{
  "id": 1,
  "title": "Chapter 1",
  "content": "# Translator's Note\n\nHey everyone,\n\nThis is my new novel called *Overgeared*. The name is basically a Korean gaming slang term used to put down users who rely on items for strength instead of skill. It's hard to find an English equivalent to this term, especially when used in many different situations and contexts throughout the novel. I have decided to go with *Overgeared* for the title and for when it is used as a noun (e.g., a guild name). However, I will go with \"item effect,\" the most accurate meaning, for when it is used in a sentence.\n\nThis is a VRMMORPG novel and while it has some of the obvious stereotypes and unrealistic parts, it also does some things differently. People might get annoyed with the MC's character at first, but he does get a lot of character development. In fact, some of the fun of reading the novel is seeing the MC's character grow. I think that people who are fans of VR novels like *Legendary Moonlight Sculptor* and *Rebirth of the Thief* will enjoy this novel.\n\nSchedule is currently two chapters a day. I've also made a glossary to help you keep track, since this is a long novel at 678 chapters and still ongoing.\n\nBrief overview that I translated from a Korean site:\n\nThe basis of this novel is a virtual reality game called *Satisfy*, developed by the world's top genius scientist Lim Cheolho and world-class scientists.\n\nThe main character is timid, flaky, selfish, cares about money and easily feels jealous of others. Because the author set up the character in this way, the story was difficult for the readers to read.\n\nBut as the main character encounters various people and geniuses, he internally matures and his personality changes. If the main character is described as cancerous early on, at present he can be called a mature adult. However, those who don't read beyond the early parts of the 5th volume (~chapter 90) find it hard to believe.\n\nThe basic settings and story line are similar to other VR novels, but the praiseworthy thing is the content development. The early parts aren't much different from rival novels, but the novel rating has exceeded the market average in recent years due to the writer's growth.\n\nLike other novels, it contains a munchkin element, but it is different from typical munchkins. In the early stages, the game progresses with the main character using his class of a legendary blacksmith. The main character expands the game content and the level of the existing users dramatically increase. Hidden talents, new players in the official rankings, classes that could break the balance—all of this makes the main character's one-man show impossible. The main character grows internally and externally while competing with others.\n\nIn fact, if you compare the simple and ignorant battle method in the beginning to his abilities in the present time, it is possible to feel such a sense of distance that he doesn't seem like the same character.\n\nAs for the evaluation of the work, the criticism was severe in the beginning, but the popularity increased rapidly after that. As described above, the improvement in the author's writing and the growth of the main character led to rapid changes in the comments. However, the main character's selfish and frustrating behavior caused many readers to stop reading in the beginning. For the readers who have gone beyond the beginning, it is a tragedy that seems really pitiful.\n\nCurrently, its popularity is increasing and a webtoon was recently released. However, there are many criticisms of the webtoon due to the various changes made. For those curious about the webtoon, here is the link to the raws, although only the first 3 chapters are free.\n\n---\n\n# Prologue\n\nA voice rang out across the chamber. \"Five minutes left!\"\n\nEight of the top-ranked players gathered on the 4th floor of Cork Island's dungeon. Peak Sword stood at the forefront, ranked 16th on the unified leaderboard. Behind him, 200 elite members of the Silver Knights Guild formed tight ranks.\n\nIt was a spectacular sight. A gathering of users with the combined power to capture a small fortress. Yet tension and anxiety twisted every face.\n\n\"Four minutes left!\"\n\nThe countdown drove the guild members to the edge. Legs bounced restlessly. Teeth worried at nails. Peak Sword's gaze swept the room, his palms slick with sweat against the hilt of his sword.\n\n*I can't calm down.*\n\nCork Island's dungeon belonged entirely to the Silver Knights Guild, and the boss monster Hell Gao appeared on this floor every two weeks. But Hell Gao was stronger than anticipated, possessed a brutal variety of attack patterns, and had crushed them in all five previous attempts.\n\nPeak Sword and the guild's elite had spent the last month strengthening their equipment with every gold piece they could spare. They were definitely stronger after the investment. But those who knew Hell Gao's true power felt no confidence.\n\n\"Three minutes left!\"\n\nThree minutes. Then Hell Gao would appear and this place would become a sea of fire. Some would die from the flames alone.\n\n\"Two minutes left!\"\n\nA wave of heat began to permeate the room.\n\n*Shit.*\n\nPeak Sword wanted to encourage everyone. But he was afraid. The overwhelming image of Hell Gao rose in his mind. The staff-wielding boss monster, enshrouded in flames.\n\n*Are we still lacking the power to defeat him?*\n\nIt might be different if they had the strength of the top 10 rankers. But he couldn't help thinking this expedition would fail with their current power. Still, the guild's best ranker couldn't show weakness. Peak Sword endured.\n\n*Do it. We can do it. We are strong!*\n\nPeak Sword steadied his heart and drank various buffing potions. The others followed his lead.\n\nThen someone shouted. \"One minute left... Wait. Intruder! There's an intruder!\"\n\n\"What?\"\n\nEvery guild member's eyes snapped to the entrance. A young man had entered, covered by a cloak. No armor or weapons visible.\n\n*Did he break through the defensive troops downstairs?*\n\nWas he a highly trained assassin? No. An assassin wouldn't openly reveal his presence here. Peak Sword studied the name hovering above the black-haired youth's head. No matter how much he searched his memory, it was unfamiliar.\n\n*He isn't a ranker?*\n\nPeak Sword glanced at his companions. They all shook their heads.\n\n*A non-ranker coming all the way here. Pathetic.*\n\nPeak Sword frowned. \"This is an area controlled by the Silver Knights Guild. I don't know how you managed to reach this point, but if you don't want to die, go back.\"\n\nThe young man ignored the warning. \"My stealth suddenly disappeared. Was it because Hell Gao detected me?\"\n\nHe threw off his cloak as he spoke to himself.\n\n\"Whoa!\"\n\nExclamations erupted from every direction. Armor materialized on the youth's body in a rapid sequence. Despite being made of metal, it seemed custom-fit for the wearer. Its smooth surface reflected like a mirror. An elegant blend of red, black, and gold. The particularly unique feature was the one-meter tail that stretched from near the tailbone. Sharp as a blade. Moving on its own.\n\n\"W-What is that armor?\"\n\n\"It's incredible... Unique grade?\"\n\nThe guild members struggled to hide their interest.\n\nPeak Sword raised his voice. \"That isn't important right now! Why aren't you throwing him out?\"\n\nHell Gao would appear soon. Nobody would be able to escape the dungeon after that. They had to deal with the outsider before then. The guild members interested in the armor moved to carry out Peak Sword's order.\n\n**Roaaaaar!!!**\n\n> **[Hell Gao, the Owner of Hellfire, has appeared.]**\n>\n> **[Hell Gao's roar has applied fear, chaos, and debilitating effects.]**\n>\n> **[Hell Gao's fire reduces heat resistance by 50%.]**\n>\n> **[Fire pillars have risen to cover you.]**\n\n\"Kuack!\"\n\n\"Hiiik!\"\n\nSilent flames surrounded every body. Half the guild members either collapsed into a dying state or burned beyond recognition. Barely half remained standing.\n\nPeak Sword stared at the notification window in shock.\n\n*I raised my fire resistance to 86%. To still receive this much damage...*\n\nThey would fail again. Despair gripped Peak Sword. Then he doubted his eyes. The unknown young man moved forward while the others writhed in flames. He moved freely, like the fire didn't affect him at all.\n\n\"H-How... What?\"\n\nPeak Sword fell silent as he witnessed something ridiculous. Hell Gao ran amok, slaughtering the guild members. The young man pulled out a pickaxe, walked to the wall, and started swinging.\n\n*Kaaang!*\n\n*Kaaang!*\n\nThe young man swung with good form. He wiped sweat from his brow. \"Ugh, hot! Isn't the labor getting worse? Why does the mineral only appear when the boss is present? At this rate, I might have to visit a dragon's lair with my pickaxe!\"\n\nA hot wind emerged from Hell Gao's staff and struck the young man. Peak Sword expected him to take massive damage and collapse. \n\nInstead, the young man only suffered minor injuries.\n\n\"Excuse me, Mister.\"\n\nThe youth stopped his pickaxe and turned his attention to Peak Sword for the first time. His expression was irritated. \"Why are you just standing there? It's hot now, but it'll only get hotter.\"\n\nPeak Sword blinked. *What am I seeing?* \n\nHe regained his composure. \"How can you be fine?\"\n\nThe young man replied like it was obvious. \"It's the item effect.\"\n\n*Chaaeng!*\n\n*Chaeng!*\n\nThe tail on the young man's armor moved by itself, fighting against Hell Gao's staff. Peak Sword gaped at the unbelievable sight, unable to close his mouth.\n\n---\n\n# Chapter 1\n\nAfter entering the Northern End Cave at the end of a three-month journey, I witnessed the overwhelming sight of battle gear piled like a mountain.\n\n\"Wow. What is this?\"\n\nThe names of the brilliant equipment glowed in a colorful mix of green, yellow, and purple. If I took only a few pieces, I'd become a rich man. I wanted to take all the battle gear.\n\nIt was impossible.\n\n> **[This item cannot be obtained.]**\n\n\"How stingy.\"\n\nItems right in front of me. I couldn't acquire them. When I tried to stuff them in my bag, they returned to their original spot like a mirage. This situation was like a pie in the sky. Or a woman already married. Actually, a married woman was still different from a pie in the sky. You could still obtain a married woman if you tried hard enough.\n\nIn the end, I could only stare at the items with longing and regret.\n\n*If a user could obtain all of these, Satisfy's economy would crumble. Unfortunately, I understand.*\n\nI didn't come here for the battle gear in the first place. I soothed my mind and turned away from the pile. An old book rested on a shiny gold table.\n\n\"Finally...\"\n\nAll the hardships I'd experienced while getting here flashed through my mind. Laughter bubbled up as my nose became runny and tears dripped down my face. Thank goodness I had patience and tenacity. Otherwise, I would've quit the game because of the terrible difficulty of the quest. I felt immense pride at clearing it.\n\n\"Kukuk... Puhahahat! I finally found it! Oh, yehhhhhh!\"\n\nA damn S-grade quest impossible to give up. How many deaths had I suffered on this solo quest? How many items were destroyed from zero durability?\n\nA human blacksmith who transcended the skills of a dwarf. Pagma achieved the culmination of god-like techniques.\n\nThe face of Earl Ashur popped into my head. He'd made me visit one of the Eternal Kingdom's five forbidden zones.\n\n\"If I bring this to him, I can get the Sun Sword? Once I get it, no one can match me for the rest of my life, you bastards! I'll make you pay for hitting me!\"\n\nPleasure surged like a tide as I picked up the book.\n\n> **[You have acquired the Legendary Craftsman's Rare Book!]**\n>\n> **[It isn't in a proper state. You can check the details using the Eye of Pallalian.]**\n>\n> **[Do you want to use the Eye of Pallalian?]**\n\n\"Eye of Pallalian? A high-end appraisal item is needed to check this?\"\n\nEye of Pallalian was the most expensive appraisal item available. Six months ago, I'd bought it just in case I got a jackpot. Sadly, I couldn't use it and it was left in my inventory.\n\n\"I don't want to miss a golden opportunity...\"\n\nI put the appraisal on hold and examined the golden table. I wondered if there was a way to take this gold. It wouldn't budge. Kicking, pulling, even biting was useless. It was an item users couldn't own, just like the battle gear.\n\n\"Ah, I really can't salvage anything because of this system. The price of my three months of work is very high.\"\n\nI gazed at the book in my hand.\n\n*I have to give Ashur the item. Do I really need to use an expensive appraisal on it?*\n\nI struggled for a moment before pulling out the Eye of Pallalian. It was natural to wonder about the source of my three months of suffering.\n\n\"Appraisal.\"\n\n> **<span class=\"rarity-legendary\">Pagma's Rare Book</span>**\n>\n> **Rating:** Legendary\n>\n> This is a book that contains the techniques of Pagma, the blacksmith who transcended human limits. The person who opens the book can become a legendary blacksmith.\n>\n> **Effects:** Become Pagma's Descendant.\n>\n> **Conditions:** None.\n>\n> *The level and stats will change when used.*\n\n> **[A legendary item has been found!]**\n>\n> **[Reputation will rise by 500 across the continent.]**\n\nMy body started trembling.\n\n\"Whoa... Jackpot...\"\n\nA legendary item. My reputation rose by 500 across the continent just because I discovered it. An amazing harvest, given that raising reputation by 100 in a single city was difficult.\n\n*Reputation is good, but...*\n\nI wondered if I'd seen it wrong. I read the item description again. There was no change in the contents.\n\n\"Jack~~pot!\"\n\nI wasn't hallucinating. Excitement surged through me. I could hear my heart beating wildly. I'd thought it was just a skill book. But it was actually for a class change. Furthermore, it was legendary grade. The strongest class in the world.\n\n\"Moreover, there's no condition to use it...\"\n\nTears flowed down from my eyes. During the past year, I'd paid interest on my loan, my *Satisfy* subscription, and taken a leave of absence from school. My friends left me one by one. The alumni from school laughed at me. People thought I was lazy.\n\nMy original plan was to sell items I gained in the game, turn them into cash, and pay off my loan, subscription, and tuition. But *Satisfy* wasn't such a fair world. It was hard to earn money. I could barely obtain equipment for myself, let alone items I could sell.\n\nNow it was different. A thrill went through my body as I shivered.\n\n\"It's over... I can say farewell to this nightmarish life!\"\n\nA legendary class change item. If I registered it as an auction item on the trading site, the transaction price would be worth tens of millions of won.\n\nNo. It was an item that gave the best class among two billion users. Would it only be worth tens of millions? I could be sure it was worth at least hundreds of millions of won. I might get my hands on an astronomical amount I'd never imagined.\n\n\"Puhahahahat! Mother! Father! This freeloader finally made it! Now it's time to leave the game and forget about finding employment! My parents can quit feeling ashamed of their son in front of the neighbors!\"\n\nI wiped my eyes. \"Sehee! Your brother finally did it! Now you don't have to be embarrassed every time you meet me on the street! When your friends want to come over, I don't have to refuse and make excuses!\"\n\nMy voice cracked. \"And my friends! Alumni! They can't ignore me anymore as a pathetic game loser! I'll become a success with a game! I've taken a few steps ahead of you guys in society! Puhahahat!\"\n\nI'd paid 10 million won to purchase a capsule. My loan interest rose by hundreds of thousands of won every month.\n\n*Ahyoung is still pretty...*\n\nI imagined attending my high school alumni meeting for the first time in two years. Pulling up in a foreign car. The successful alumni wouldn't be able to ignore me anymore. My face flushed as the image of my first love, Ahyoung, came to mind.\n\n\"Okay, go and sell it!\"\n\nQuest? I didn't care about that right now. Obviously, the reward was a weapon that belonged to the epic rating. It was nothing compared to the price of this book. My affinity with Earl Ashur would fall. I probably wouldn't receive any more quests from him. But there was no reason to be afraid in front of hundreds of millions of won.\n\n\"Logout!\"\n\nI spoke confidently. Then a notification window flashed before my eyes.\n\n> **[You cannot log out of the game here.]**\n>\n> **[Earl Ashur has appeared.]**\n\n\"...What?\"\n\nDozens of knights jumped into the cave. The familiar figure of Earl Ashur appeared. I struggled to understand. He found me. His face distorted.\n\n\"Foolish traveler. You all have the same greed.\"\n\n> **[The quest 'Earl Ashur's Secret Request' (S) has changed to 'Earl Ashur's Anger' (SS).]**\n\n> **Earl Ashur's Anger**\n>\n> **Difficulty Level:** SS\n>\n> Earl Ashur chose you due to your average abilities, your stupidity, and because you are easy to exploit. He entrusted you with the task of finding Pagma's rare book that he wasn't even sure existed.\n>\n> He put a watcher on you and came urgently as soon as he heard you entered the Northern End Cave. Earl Ashur has witnessed you become blinded by greed over Pagma's rare book and has no intention of forgiving you. He intends to kill you and take away Pagma's rare book.\n>\n> * Affinity with Earl Ashur has fallen by 100.\n> * Due to your actions, all of the fame you have built in Patrian has disappeared and you have now become infamous. The affinity of Patrian's residents has fallen by 40. They will look at you and call you a thief.\n>\n> **Quest Clear Conditions:** The deaths of Earl Ashur and his escort knights.\n>\n> **Clear Reward:** Obtain the title 'Noble Killer.'\n>\n> * **Noble Killer:** Intelligence **-50**.\n> All nobles in the kingdom will despise and oppress you. Your jobs will be limited. The affinity of some commoners and royalty will rise.\n>\n> **Quest Failure:** Level **-2**. You will no longer be able to enter Patrian. Any Patrian soldiers will kill you on sight.\n\nPatrian was the starter city where I'd first created my character. I'd built up considerable reputation while completing quests from level 1 to the present. My affinity with the residents was at its maximum.\n\nAll merchants gave me a 20% discount when buying goods. The goods I sold were purchased at 15% above their value. Residents gave me hidden quests when I approached them. But all these achievements automatically flew away the moment this quest updated.\n\n\"...Ah. This is shit.\"\n\nA curse emerged naturally.\n\n\"Earl Ashur...\" I clenched my fists. \"No, you bastard! This goddamn bastard forced me onto a quest where I wasn't sure if I could find the item or not! If Pagma's rare book was something that didn't exist, I would've struggled for months in vain! You're the one who lied in the first place, yet you want to make me notorious in Patrian? Filthy jerk!\"\n\nAs their master was cursed at, the hot-headed knights immediately pulled out their swords. Earl Ashur restrained them and spoke coldly to me. \"You had already decided to betray me before you knew you were deceived. Even so, you are still acting so proudly.\"\n\n\"Is it greedy to want a reasonable reward after the hardships of my journey? My betrayal wasn't certain!\"\n\nHe sneered at my words. \"Didn't I already promise to give you a reward in return? We entered into a contract and you have trespassed on my good faith out of greed.\"\n\nThis wasn't something I could handle with words. As I fell silent, Earl Ashur's momentum increased as he continued. \"You are truly a poor man. The more I watched, the more I could feel it. But there are times when you can do extraordinary things. I honestly hadn't expected you to find this cave that had disappeared from history. I will punish you for your ignorance, but as reward for your patience, I will kill you as painlessly as possible.\""
}