{
  "id": 10,
  "title": "Chapter 10",
  "content": "# Chapter 10\n\n\"Going to the Mubaid Ruins, one must be level 130 or higher!\"\n\n\"Looking for those who want to hunt in the Grey Forest. A level 130 warrior is waiting for people higher than level 96.\"\n\n\"Recruiting people for the Guardian of the Forest raid! A level 190 archer, level 181 martial artist, and other top rankers will join! Your class and level don't matter! Anyone will do!\"\n\nThe resurrection brought me to a town square packed with high-level users. My jaw clenched. *This isn't the Yatan Temple.* Of course it wasn't. The Church and I were hostile now. The system dumped me somewhere \"safe\" instead.\n\nBairan Village.\n\nI recognized the stone fountain, the weathered guild hall. My stomach dropped. The last time I'd been here, hunting Ashur's stupid cave, I'd died three times. Lost my boots. Lost my gauntlets. Spent two days grinding copper from goblins just to replace them.\n\n\"Damn it.\"\n\nEvery monster within ten miles of Bairan was level 100 minimum. Ferocious, fast, and they traveled in packs. Even the mid-80s users here moved in groups. Solo players below level 120 didn't leave the village perimeter unless they had a death wish.\n\n*And I'm level negative-three.*\n\nI pressed my forehead against the cool stone of a nearby wall. *What did I do? Did I insult Lady Luck in a past life? Piss on her shrine?* Nothing else explained this streak of cosmic bad fortune. Maybe I'd been some arrogant god who got his memory wiped and thrown to the mortal realm as punishment.\n\n*Stop.*\n\nWallowing accomplished nothing. I pushed off the wall and scanned the square. A row of horse-drawn carriages waited along the western edge, drivers lounging against their wheels.\n\n*I need to leave. Find a beginner zone. Grind my way out of this hole.*\n\nI approached the nearest coachman, a weathered man with a grey beard stained yellow around his mouth. He looked me up and down, taking in my plain starter armor.\n\n\"What is the safest village near here?\" I asked.\n\n\"Winston Village.\" He spat into the dirt. \"Many novice travelers visit that place. Do you need a driver to take you there?\"\n\n\"How much?\"\n\nHe raised one finger.\n\nRelief washed through me. One silver. That was manageable.\n\n\"What are you doing?\" The coachman frowned. \"It is 10 gold.\"\n\nMy brain stuttered. \"Heok! 10 gold? It is 10 gold, not 10 silver?\"\n\n\"This must be the first time you are taking a carriage.\" He scratched his beard. \"In the safe zone, the base fare for a carriage is set at five gold. In a monster-infested area such as this, there should be some profit for the high risk. This price is actually cheap. Winston is close to here, so it is only the basic fare.\"\n\n\"You are charging so much just for driving a carriage!\"\n\n\"Tsk tsk.\" He shook his head. \"This is why I don't like novice travelers. Don't you know that all the monsters in the vicinity will attack as soon as they find humans?\"\n\n\"No! I know that there aren't any monsters fast enough to catch up to the speed of a carriage!\"\n\nHe flinched. Good. I'd rattled him.\n\nThe coachman coughed into his fist. \"Obviously, the monsters have slow feet. But they know the terrain and have the instincts of natural hunters. They use these advantages to catch up.\"\n\n*Liar.* He was selling water as wine. Fine. Two could play.\n\n\"Then you should be vigilant.\"\n\n\"Cough... then I will accept nine gold.\"\n\n*Now we're talking.* Bargaining 101: Cut the price as much as possible, meet somewhere in the middle. I'd done this a hundred times in Patrian where my reputation was maxed. The dance was simple. He'd counter at eight, I'd say thirty silver, we'd spiral down to maybe two gold if I played my cards right.\n\n\"10 silver.\"\n\nSilence.\n\nThe coachman stared at me.\n\n\"Excuse me?\"\n\nMore silence.\n\n*What?* This wasn't right. He should be outraged, should counter with eight gold, then I'd go twenty silver, then he'd...\n\n\"Aren't you going to bargain?\"\n\n\"Who in the world would bargain with a crook like you?\" His face flushed red. \"This useless bastard! I was kind enough to cut it to nine gold, yet you offered 10 silver? You want me to bargain? Who is going to make a deal with a bastard like you?\"\n\n\"Isn't there the saying, 'the customer is king?!' I will sue you and make you unemployed!\"\n\n\"If you want to sue me, do it!\" He jabbed a finger at my chest. \"Do you think the union will take your side? Get lost, you insane bastard!\"\n\n*Shit.* In Patrian, this approach worked. Maximum affinity smoothed over even the most aggressive haggling. But here? I was nobody. Just another broke traveler trying to cheat an honest worker.\n\nThe math crashed down on me. I had 3 gold and 11 silver total. The Ashur quest had bled me dry on potions.\n\nI shifted tactics. Let my shoulders sag, made my voice crack. \"Please... My sick mother is in Winston Village all alone... She will die soon. What a sad son I will be if I can't watch my mother's last moments... Please take pity on me and consider the bargain.\"\n\nThe coachman snorted. \"You are obviously telling a lie. You didn't even plan to go to Winston Village in the beginning, so who would believe you now?\"\n\n\"...Sheesh, you're smarter than you look.\"\n\n\"W-What! You cheap bastard!\"\n\nI ran. He chased me halfway across the square, shouting obscenities. When I finally lost him in the crowd, I tried the other carriages. Different drivers, same result. No amount of sob stories cut the fare below 8 gold and 90 silver.\n\n*Modern society is a scam.*\n\nFrustration burned in my chest. Was I really stuck here? Level negative-three, isolated in Bairan with no way out?\n\n*No. Think.*\n\nI could make items. Earn money through crafting. If I produced something with a Normal rating, the NPC shops would buy it. And every creation granted experience.\n\nI pulled up my skills window.\n\n> **[Blacksmith Craftsmanship Skill]**\n> \n> Lv: Master\n> \n> Produce equipment items that you know how to make.\n> \n> There is a certain probability of creating <span class=\"rarity-rare\">rare rated items</span>.\n> \n> There is a low probability of creating <span class=\"rarity-epic\">epic rated items</span>.\n> \n> There is a rare probability of creating <span class=\"rarity-unique\">unique rated items</span>.\n> \n> * Due to the effect of mastering the skill, the attributes of all items are increased by 10%.\n> \n> * When <span class=\"rarity-rare\">rare rated items</span> are produced, all stats will permanently rise by +2. Reputation throughout the continent will rise by +30.\n> \n> * When <span class=\"rarity-epic\">epic rated items</span> are produced, all stats will permanently rise by +4. Reputation throughout the continent will rise by +80.\n> \n> * When <span class=\"rarity-unique\">unique rated items</span> are produced, all stats will permanently rise by +12. Reputation throughout the continent will rise by +300.\n\nMy breath caught. *This is absurd.*\n\nAccording to the rankings, the first-place blacksmith only had Intermediate level skills. The forums said he'd crafted tens of thousands of items by level 110 just to reach Intermediate. Production skills were notoriously slow to level.\n\nAnd here I was. Master rank. Not Advanced. Not Intermediate. *Master.*\n\n*If that guy knew I existed, he'd uninstall the game.*\n\nThe weight of the legendary class settled over me again. This was power. Real, tangible power.\n\nI scrolled to the next skill.\n\n> **[Legendary Blacksmith's Craftsmanship Skill]**\n> \n> Lv. 1\n> \n> Produce equipment items that you know how to make.\n> \n> You can create the production methods for a new item with the 'Legendary Blacksmith's Creation' skill.\n> \n> There is a certain probability of producing <span class=\"rarity-rare\">rare</span>~<span class=\"rarity-epic\">epic rated items</span>.\n> \n> There is a rare probability of creating <span class=\"rarity-unique\">unique rated items</span>.\n> \n> There is a very rare probability of creating <span class=\"rarity-legendary\">legendary rated items</span>.\n> \n> * All stats of a production item will increase by 10%.\n> \n> * When <span class=\"rarity-rare\">rare rated items</span> are produced, all stats will permanently rise by +2 and reputation throughout the continent will rise by +30.\n> \n> * When <span class=\"rarity-epic\">epic rated items</span> are produced, all stats will permanently rise by +4 and reputation throughout the continent will rise by +80.\n> \n> * When <span class=\"rarity-unique\">unique rated items</span> are produced, all stats will permanently rise by +12 and reputation throughout the continent will rise by +300.\n> \n> * When <span class=\"rarity-legendary\">legendary rated items</span> are produced, all stats will permanently rise by +25 and reputation throughout the continent will rise by +1,000.\n> \n> * Something special will occur with every five legendary items created.\n\n\"Wow...\"\n\nLevel one. The skill was only level one. And it already crushed the Master-ranked version.\n\n*Legendary class. This is what it means.*\n\nExcitement buzzed through my veins. I opened the Creation skill description.\n\n> **[Legendary Blacksmith's Creation Skill]**\n> \n> You can create three equipment item production methods every time the skill level of the 'Legendary Blacksmith's Craftsmanship Skill' goes up.\n> \n> Number of items that can be created at present: 3/3\n> \n> * When items are produced using this skill, the name of the creator is automatically placed on the item.\n\n\"Create an item? What is the method?\"\n\nThe description was vague. *Only one way to find out.*\n\nI activated the skill.\n\n> [What item do you want to create?]\n\nThe answer came instantly. A weapon. Weapons meant faster hunting, faster leveling. And among weapons, only one type mattered.\n\nThick. Heavy. Brutal.\n\nA greatsword that could shatter armor and crush skulls. Every game I'd ever played, I went straight for the biggest sword available. *A man's romance.*\n\n\"Greatsword.\"\n\n> [Have you decided?]\n\n\"Yes.\"\n\n> [What materials would you like to use?]\n\nI thought back to the shouts in the square. The Guardian of the Forest raid. Someone had mentioned it dropped the best mineral in the region.\n\n*Blue Orichalcum.*\n\n\"Blue Orichalcum.\"\n\n> [Have you decided?]\n\n\"Yes.\""
}