{
  "id": 100,
  "title": "Chapter 100",
  "content": "# Chapter 100\n\nPon dropped to one knee in front of Grid.\n\n\"You're better than any blacksmith I've ever seen. It's an honor to have a craftsman like you as my colleague.\"\n\nHe'd spent years chasing master smiths across the continent. Crossed the Hell Desert to meet the best blacksmith in the east. Survived an encounter with the fire dragon Trauka just to reach a famous dwarf forgemaster. If there was a renowned smith anywhere in the known world, Pon had likely tracked them down.\n\nDespite all that effort, he'd never once received a unique rated item. Even the most celebrated blacksmiths struggled to create anything above epic. The odds were astronomical.\n\nGrid had just made three items. One of them came out unique. Not only that, the performance specs exceeded what the production method promised.\n\n*The system even suggested legendary was possible.*\n\nPon shook his head slowly. This man broke every rule. The blacksmith they'd searched for had been hiding in plain sight.\n\n\"Amazing.\" The word came out quiet. \"You're really something.\"\n\nHe pictured it. Every guild member armed with Grid's work. Weapons that pushed past standard limits. Armor that defied common sense. The Tzedakah Guild wouldn't just rise to the top. They'd dominate.\n\nPon stowed the battered spear he'd carried for the last two years. His hands trembled slightly as he drew the Gale Spear from his inventory.\n\n\"Wow...\"\n\n\"That's it...!\"\n\nThe guild members crowded closer. The spear shimmered in the lamplight, blue and silver twisting together like a dragon descending from the heavens. Beautiful didn't cover it. The weapon matched Persona, the legendary treasure of the Saharan Empire.\n\n*Great performance. Stunning appearance. And.*\n\nBuuong. Buuong.\n\nPon swung it twice. Light cuts through empty air. A dark smile spread across his face. He'd wielded hundreds of spears over the years. This one felt perfect. The length, the width, the balance. Custom made for his grip, his stance, his fighting style.\n\n*I'm several times stronger already.*\n\nHe wanted to sprint to the nearest hunting ground. Test the edge on living flesh. Watch numbers rise.\n\nThe others pressed in around him.\n\n\"What's the rating? It can't be normal.\"\n\n\"Show us! The suspense is killing me!\"\n\nPon shared the item window. Mouths fell open. Eyes went wide.\n\n\"Unique?\"\n\n\"He actually produced a unique?\"\n\nThe impact rippled through the group. They'd all done what Pon had done. Visited smith after smith. Commissioned hundreds of items. Burned gold on production requests. None of them had ever seen a unique rated crafted item appear in their inventory. Theory said it was possible. Reality said go raid a dungeon instead.\n\nGrid had been in the guild for three days. Three days, and he'd shattered that barrier.\n\nEvery other blacksmith suddenly looked like an amateur.\n\nJishuka lost control. She crossed the distance in three steps and threw her arms around Grid. Her lips pressed against his cheek.\n\n\"Grid, that's incredible! You're the best! You're fantastic!\"\n\n\"Huh?\"\n\nGrid's brain short-circuited. Rational thought evaporated. He knew this was just how South American women expressed joy. Pure gratitude and excitement. That knowledge didn't help. His mental defenses crumbled under the assault.\n\n*Her lips are so soft.*\n\nHis cheek felt like it was melting.\n\n*Her chest is...*\n\nSoft wasn't the right word. Elastic. Warm. Overwhelming.\n\n*She smells amazing.*\n\nBetter than any perfume he'd ever encountered. His conclusion formed slowly through the haze.\n\n*This is a dream. Has to be. I'm definitely dreaming. That's fine. I don't care if I die right now.*\n\nWhile Grid spiraled, Vantner collapsed against the wall.\n\n\"This is insane.\" His voice came out strangled. \"This spear is better than any weapon I've ever seen. Better than my Genuine Twin Bloody Axes. And Pon gets it? Pon? He's going to leave me in the dust again!\"\n\nHe clutched his head and rocked back and forth.\n\n\"Grid!\" Jishuka squeezed tighter. \"Inviting you was one of the best decisions I've made! I love you!\"\n\nShe kept hugging him. Grid's face disappeared into her chest.\n\n\"Hehe... chest... hihi.\"\n\nThe three of them looked deranged. Grid drooling and giggling. Jishuka bouncing with joy. Vantner muttering in the corner like a madman. None of the other guild members intervened. They were too busy crowding around the spear window.\n\n\"I'm so jealous. If I could get a unique item like that, I'd die happy.\"\n\n\"Better performance than raid drops. How is that possible?\"\n\n\"Who's next? Has Grid decided? I need armor...\"\n\nPon posted the Gale Spear's full stats to the guild chat. Then he pulled out the two epic rated versions and turned toward Faker.\n\n\"I want to learn dual wielding. While I have three copies.\"\n\nFaker's shadowy form shifted. \"Smart. It's difficult to master, but the payoff is worth it.\"\n\n\"Will you spar with me?\"\n\n\"Why would I refuse?\"\n\nFaker raised his dagger. One moment he stood in front of Pon. The next, he materialized behind him, blade aimed at the base of the spine.\n\nPon had survived countless assassination attempts from the number one ranked killer. He rotated the spear in his left hand. Used the repulsive force to deflect the dagger. His right hand thrust forward.\n\nSwaeek!\n\nThe Tipan wood bent like a living thing. The Gale Spear moved like a snake. It cracked into Faker's back.\n\nPeeeong!\n\nThe sound echoed through the smithy. The spear carved a hole in the air itself. But Faker had already vanished. He reappeared on the opposite side, throwing hidden weapons from three angles at once.\n\n\"You're already familiar with the style. Have you been practicing?\"\n\nPon rested one spear on his shoulder. \"Never practiced. My fundamentals are solid. I adapt fast.\"\n\n\"Clearly.\"\n\nJjaejaeng! Jaaeng! Chachachachang!\n\nFaker pressed the attack. His unified ranking sat lower than Pon's, but his agility surpassed nearly every player in the game. In the opening exchanges, speed won. No matter how brilliantly Pon moved his weapons, Faker flowed around them like water. Only Pon's spears took damage. The superior killer's dominance showed clearly.\n\nThen the tide shifted. Pon's attack speed began climbing. Accelerating beyond what should be possible.\n\n\"Kuk!\"\n\nFaker, who rarely took damage, staggered back. Blood dripped from three shallow cuts. Pon pursued. Both spears thrust forward in a coordinated assault.\n\nPuk! Peok!\n\nThe Gale Spear lived up to its reputation. The unique option stacked attack speed bonuses as the fight continued. Negligible at first. Overwhelming given time.\n\n\"Isn't this cheating?\"\n\nFaker laughed despite being beaten on speed. His specialty. His pride. Pon drank a health potion and thought of Kraugel.\n\n*Maybe now I can actually land a hit on him.*\n\nMeanwhile, new visitors entered Khan's smithy. They stopped just inside the door.\n\n\"Is this really a smithy?\"\n\nTen people clustered in the center, talking over each other. A man and woman embraced off to one side. A large middle-aged man crouched in the corner, muttering.\n\nChaaeng! Chaeng!\n\nTwo maniacs trying to kill each other with live steel.\n\n\"...\"\n\nThe marketplace outside was quieter than this.\n\n\"We must have the wrong place.\"\n\nSeveral customers walked in, looked around, and immediately left. The chaos only ended when Khan returned and bellowed from the doorway.\n\n\"What the hell is going on in my shop?!\"\n\n\"Heok!\"\n\nGrid snapped back to awareness. He stared at Jishuka's body. The curves that probably launched a thousand obsessive fan letters.\n\n*She's trying to trick me. Probably thinks she can avoid payment with this.*\n\nHis experience with Ahyoung had taught him the lesson. Women were dangerous. Lower your guard and they'd destroy you. Let them into your heart and you'd regret it forever. The memories calcified. Grid's expression went blank as he looked at Jishuka. Then he turned to Pon.\n\n\"Hey. Stop playing around and pay me. How much are you offering?\"\n\nPon approached carefully. \"To be honest, it's hard to value the Gale Spear accurately. But considering comparable items, I should pay at least 800,000.\"\n\n\"800,000?\" Grid's voice rose. \"800,000 gold?\"\n\nHis surprise was justified. He'd sold the legendary Sword of Self-transcendence for 220,000 gold. The unique rated Gale Spear cost four times that? It didn't make sense.\n\n*800,000 gold in cash.*\n\nHis mind raced through the math. One hundred gold equaled 120,000 won. So 100,000 gold was 120 million won. Which meant 800,000 gold was... um. Wait. Hold on.\n\n960 million won.\n\nEnough to pay off his father's entire debt. With 300 million left over.\n\nGrid's brain stopped processing. A moment later, it rebooted. He looked at Pon with pity.\n\n*Poor bastard. He's too ignorant to know better. A legendary item went for 220,000, and he's paying 800,000 for unique? What an idiot.*\n\nGrid was the ignorant one. If he'd listed the Sword of Self-transcendence at auction, it would have sold for millions. Several billion won in cash. Instead, he'd dumped it to an NPC vendor for pocket change. Pon's offer was actually quite reasonable.\n\n*Regas is the number one pushover. As of today, Pon takes second place.*\n\nSometimes ignorance really was bliss.\n\nGrid nodded happily.\n\n\"Okay! I'm in a good mood, so the two epic spears are free! Service bonus! 800,000 gold works for me!\"\n\nPon had planned to buy those separately for 150,000 each. Now they were complimentary? He stared at Grid with new respect.\n\n*His behavior seems crude on the surface. But underneath, he's actually honorable. Maybe the ugly exterior is just a defense mechanism.*\n\nPon's opinion of Grid rose several notches. The rest of the Tzedakah Guild felt the same.\n\nAt that moment, figures watched from the street outside Khan's smithy.\n\n\"I didn't realize the Tzedakah Guild used this place as their base.\" The speaker crouched behind a merchant's stall. \"Could that guy be the unknown craftsman? Send word to Chris. Tell him to dispatch the rankers.\"\n\nAsk ten random people on the street which guild ruled Satisfy. Nine would answer the Giant Guild without hesitation. The largest force in the game. They'd come to Winston to recruit the mysterious artisan. Instead, they'd found him embedded with the Tzedakah Guild.\n\nThe competition was about to get bloody.\n\n---\n\n**Glossary of Common Korean Terms**\n\nOG: Glossary Link\n\nCurrent schedule: 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access content updates after daily chapter releases conclude."
}