{
  "id": 1000,
  "title": "Chapter 999",
  "content": "\"I need to know who they were.\"\n\nThis was a sacred place—a tomb where two titans who once shook the foundations of the continent now slept. Even searching the entire world, few locations could rival its significance. Grid's obsession was understandable. Someone had walked these halls before him, and he needed to understand who they were and what they'd sought.\n\n*An ordinary person couldn't survive Marie Rose's aura. Whoever came here first... they must have been extraordinary.*\n\nSomeone like a legend. What drove them here? What secrets had they uncovered? Information was power—a lesson every seasoned player learned—and fortunately, Chreshler seemed willing to talk.\n\n—*It was Muller.*\n\n\"Muller? As in... Sword Saint Muller?\"\n\n—*Yes.*\n\n\"Right... wait, what?\" The words registered slowly, and when they did, Grid felt as though lightning had struck him. Muller—the Sword Saint, humanity's greatest warrior. Even among legends, he stood supreme. The thought of learning his story sent a thrill through Grid.\n\nBut something didn't add up. *Wait. Muller lived before Pagma's era. How could he have visited this place? Shouldn't he have been dead before Marie Rose was even sealed?*\n\nHistorical records were maddeningly vague about Muller's birth, but his documented activities aligned with the First Pope's reign—roughly three to four hundred years ago. He'd sealed the great demons, ended the Age of Grief, and supposedly died about two hundred fifty years ago.\n\n\"How long ago did he come here?\" Grid asked carefully.\n\n—*Around one hundred sixty years ago.*\n\nThe answer hit like a hammer blow.\n\n*That's when Pagma was active!* The realization crystallized instantly. *Of course—Muller lived for centuries, just like Pagma did!*\n\nThe pieces fell into place. He'd heard claims that Muller died a hundred fifty years ago, dismissed them as corrupted data. But if Pagma had survived for centuries through some technique, why not Muller?\n\n*Pagma never knew. If he'd realized Muller was still alive, he would have sought him out instead of making that damned contract with a great demon.*\n\n—*I told you—I'm going to sleep now. Waking to a world without Marie Rose... it feels unbearably lonely.*\n\n\"Wait, please! Why did Muller come here one hundred sixty years ago? And when did he actually die?\"\n\n—*You ask quite a lot for someone giving nothing in return. Pagma built this coffin, but what have you done? Have you no shame?*\n\n\"...!\" The words stung because they were true.\n\nChreshler had no obligation to indulge him.\n\n—*I'm sleeping. Goodbye.*\n\n\"Hold on—!\"\n\nHe couldn't let this end here. Desperate, Grid threw out the only card he had. \"I know where Marie Rose is!\"\n\nChreshler's response came flat and unimpressed. —*I know. She's somewhere among the vampire cities. So what? Will you bring her to me? Can you?*\n\n\"...\"\n\n—*Don't make promises you can't keep. You'll only earn wrath you can't handle.*\n\n\"...I apologize.\"\n\n—*Hmm. You've done enough good to merit the goddess's blessing and the favor of three churches. Very well—I'll indulge you a little more. Tell me, do you know Amoract?*\n\n\"The great demon? First Servant of the Yatan Church.\"\n\n—*So you're already aware.*\n\nAmoract, the Demon of Conflict. Grid remembered their encounter vividly—the first time Braham had borrowed his body, traveling to Amoract's domain where the pavranium received Yatan's Blessing. Even as a mere soul fragment, Amoract's presence had been overwhelming.\n\n—*He feared Marie Rose.*\n\n\"What...?\"\n\nA great demon, afraid?\n\n—*Amoract was one of the nine who stripped Beriache of her status and drove the vampire clan from hell. As he controlled the Yatan Church's operations on the surface, Beriache represented an obvious threat.*\n\n\"...!\" The memory surfaced—that conversation between Braham and Amoract, years ago but still vivid.\n\n*\"You knew I would seek you out.\"*\n\n[*Of course. Braham needs divine blessings to escape his mortal shell.*]\n\n*\"Will you grant me Yatan's Blessing?\"*\n\n[*That's right.*]\n\n*\"How amusing. The Yatan Church seems hostile toward Marie Rose.\"*\n\n[*God Yatan favors you regardless of Marie Rose. Remember this.*]\n\nGod Yatan himself opposed her. Braham had said so explicitly. An opponent who troubled even the God of Evil...\n\nNo wonder a mere great demon feared her.\n\n*Marie Rose is far more powerful than I imagined. Amoract and Yatan empowered Braham specifically to counter her.*\n\nThe revelation elevated Grid's understanding. He was touching the edges of something vast, becoming part of the world's deeper narrative. Chreshler continued.\n\n—*Amoract manipulated Muller. He's skilled at that—scheming. He spread a rumor that unless Marie Rose was completely destroyed, she'd ally with the great demons to annihilate humanity. The rumor reached Muller in his retirement. At the time, vampires were considered archenemies of humanity. Muller had never truly faced them, never understood their nature. So he believed the lie and came here.*\n\n\"To destroy Marie Rose completely.\"\n\n—*Yes. Then he left. I explained the truth, and he departed.*\n\n\"Your Holiness... how did Muller survive so long? Did he steal lifespans like vampires? Make a contract with a great demon?\"\n\n—*You truly don't understand what legends are. A legend becomes what they are through accumulated feats. As long as people remember them, legends don't die easily.*\n\n\"...!\"\n\nA notification window flashed through Grid's mind.\n\n[*A legend doesn't die easily.*]\n\nThe skill's background suddenly made perfect sense. But it raised another question. \"Then... Khan, a great blacksmith I knew—he couldn't overcome mortality even after becoming a legend. He died almost immediately. And I've never heard of other legends living centuries except Pagma.\"\n\n—*He hadn't accumulated feats that kept people talking. Moreover, production classes like blacksmiths struggle to benefit from their achievements. People remember the creations, not the creator. Let me give you an example you'll understand. The man called the Undefeated King—he possessed combat power rivaling Muller himself, never lost a single duel. But his activities remained confined to his homeland.*\n\n\"...?\"\n\n—*His feats were spoken of only by his people, not across the continent. His fame was weak, his status as a legend diminished. He died to the Saharan Empire's forces, but even if he'd survived, he wouldn't have lasted much longer.*\n\n\"Ah...\" Understanding dawned. As a player, Grid gained immortality's benefits immediately upon becoming a legend, but this world's inhabitants faced different rules.\n\n*This...*\n\nHis thoughts flew immediately to Piaro and Mercedes. He'd kept them from combat, afraid they'd be endangered. Now it seemed he'd made a terrible mistake.\n\n*To extend their lives, they need to fight, to build feats through battle.*\n\nEspecially Mercedes. Piaro's farming could generate some renown, but Mercedes was a knight. Her place was on the battlefield.\n\n\"Why didn't Pagma understand this? He believed Muller was dead.\"\n\n—*Even understanding the concept, he'd have had no reason to doubt Muller's death. No legend has accumulated more feats than Muller, and no precedent existed for someone living that long. Who would imagine Muller surviving centuries? I couldn't, until I saw him with my own eyes.*\n\n\"Is Muller still alive?\"\n\n—*No.* Chreshler's certainty was absolute. —*He's dead. The world constantly changes, new events unfold. People grow interested in fresh heroes rather than praising someone from long ago. The times Muller was spoken of... decreased.*\n\n\"...\"\n\nGoosebumps crawled across Grid's skin. The formula was cruel: *being forgotten is true death*. He imagined Muller fading alone into silence.\n\nThen Chreshler laughed, reading his thoughts. —*Ha! Don't be ridiculous. Simply being mentioned less doesn't mean complete erasure. Aren't we discussing Muller right now? How many times have you heard his story in your lifetime?*\n\nDozens, hundreds of times. Yes—Muller was far from forgotten, hadn't died in solitude. It would be stranger if he *couldn't* die when people spoke of him every day. The loneliness, the bitterness—those came from isolation. At the end, Muller must have found peace.\n\nThroughout the tale, Chreshler's voice remained gentle. Even he respected Muller sincerely. Perhaps Muller's story had lifted his spirits, because Chreshler offered unexpected comfort.\n\n—*That great blacksmith you mentioned—Khan, was it?*\n\n\"Yes... that's right.\"\n\nHearing Chreshler—the Second Pope—speak Khan's name stirred something profound in Grid.\n\n—*The fact he couldn't overcome mortality means he enjoyed his natural lifespan. It would have been a great blessing to depart when he should. Imagine if he'd been forced to endure as long as Muller—how aged and lonely he'd have become.*\n\n\"...You're right, Your Holiness. Khan was happy at the end.\"\n\nHe'd become a legend and fallen asleep in Grid's arms, reunited with his family. Yes—he would have been satisfied. Happy.\n\n*Khan, are you watching? Chreshler is speaking of you. You've come so far. You must feel proud.*\n\nThe consolation warmed Grid, bringing a genuine smile.\n\n[Affinity with Chreshler has increased by 10.]\n\nAn unexpected notification appeared.\n\n—*You lack tact, but your nature is decent. I like you somewhat.*\n\nChreshler's evaluation (?), delivered with approval. Grid felt genuinely pleased. Even as a coffin, Chreshler remained one of history's greatest figures. Gaining his affinity felt like a victory.\n\n—*Now I truly will sleep.*\n\nGrid moved to bow when another question struck him. \"What about someone who isn't a legend but has lived centuries despite people not speaking of their feats? Are they not human?\"\n\n—*You're remarkably persistent.* Chreshler grumbled but explained anyway. —*They're either non-human or transcendent.*\n\nTranscendent...! Grandmaster Zikfrector approached that category.\n\n\"What exactly is a transcendent? How do they differ from legends?\"\n\n—*Both legends and transcendents possess talent beyond human limits. But legends build presence through feats, while transcendents focus solely on their own discipline. They can achieve longevity depending on what they've mastered.*\n\n\"Are legends superior to transcendents?\"\n\n—*Purely in terms of ability, transcendents generally surpass legends. Legends wander everywhere, spending time solving problems. Transcendents devote everything to self-improvement. Of course, a legend's experience is valuable, so many are overwhelmingly stronger than transcendents. Muller being the prime example.*\n\n\"...So transcendents are usually selfish?\"\n\n—*Who knows? Are they selfish for not fighting for world peace or progress? Sometimes it's better not to stand out. Though I suspect they're missing a few screws.*\n\n\"Missing screws?\"\n\n—*They ignore most things inconsistent with their purpose. From a normal perspective, they might seem unmotivated or quick to give up. If not for Marie Rose, I wouldn't have accepted the position of Second Pope.*\n\n\"...\"\n\nWhy had the grandmaster simply retreated at the evil eyes' village? One mystery resolved, another appeared. Transcendent Zikfrector—if he held no loyalty to the empire, why serve it?\n\n*What's his purpose?*\n\nThe question unsettled him. Grid was mulling it over when the guild chat window flashed—an exclamation mark indicating a notice.\n\n\"...!\"\n\nHis eyes sharpened as he read the contents.\n\n***\n\n\"Whose statue is this?\"\n\nSky King Rigal had conquered Bairan in under half a day. Now he stood before a massive statue in the main square, head cocked with curiosity. It depicted a kindly old man, eyes blazing like flames, wearing a gentle smile. In his hand: a hammer.\n\n\"My lord asked you a question!\"\n\nWhen silence greeted him, Rigal's soldiers turned on the prisoners, beating them viciously. The captives were Overgeared soldiers who'd been defeated and captured. They'd failed to defend Bairan and now suffered the humiliation of imprisonment. But they were determined—no matter the torture, they wouldn't answer the enemy.\n\nRigal scoffed. \"A statue? Meaningless. A nation with no history erecting monuments to fiction?\"\n\nWhen he reached out mockingly to touch it, one prisoner roared, \"Your hand. Remove it. Now!\"\n\nAn Overgeared knight, bound in chains. Jude—formidable in battle, one of the hardest captures of the entire engagement.\n\n\"Hrmm.\" Amusement flickered across Rigal's striking features—silver hair immaculate, blood-red eyes piercing beneath his air force uniform. He regarded Jude with interest. \"If I grant your request, will you serve me?\"\n\nHe coveted the knight. Jude possessed excellent physical capabilities despite limited intellect—perfect subordinate material. An alpha dog who'd never bite his master...\n\nJude shook his head firmly. \"Jude. Only master. Overgeared King. One master.\"\n\nSee? Just like that.\n\n\"I'll give you better treatment. Far superior to what the Overgeared King provides.\"\n\nImpossible. No one could give Jude better treatment than Grid. He'd grown strong only through Grid's investment and attention. Grid had discovered his talent, nurtured it, forged items perfectly suited to his characteristics. Without Grid, Jude would be nothing—worthless, empty.\n\nJude existed *because* of Grid. But Rigal didn't understand. As one of the Saharan Empire's greatest powers, he believed himself superior to any upstart king, commanding the continent's finest resources.\n\nAnother Overgeared member laughed bitterly. \"You don't know your place.\"\n\nThe youth was Ibellin, charged with defending Bairan in Jishuka's absence. He'd fought desperately throughout the battle but been captured anyway. He'd sacrificed himself cutting down enemies, died, resurrected, fought again. Still, Bairan had fallen.\n\nHe couldn't forgive himself. And he certainly couldn't forgive Rigal for trampling this land.\n\n\"You'll give more than Grid? Impossible, even if you cut off your head and offered—\"\n\nRigal crossed the distance in an instant and severed Ibellin's head. Notifications flooded Ibellin's graying vision.\n\n[You have died.]\n\n[You have lost 35.6% experience.]\n\n[You have lost an additional 10% experience from the war penalty.]\n\n[The person who killed you has applied the 'Poison to Immortals' effect. You have lost 10% additional experience.]\n\n[You have died twice within 24 hours, resulting in a restricted access penalty.]\n\nThe war penalty was expected, even fair—gaining experience in war meant risking its loss. But Poison to Immortals was devastating. An extra twenty percent gone, just like that.\n\n*Dangerous. Everyone needs to be careful...*\n\nIbellin dissolved into gray light. Rage contorted the faces of every Overgeared member while soldiers and residents looked on in terror. Jude roared, \"Kill you!\"\n\nA meaningless struggle. His thrashing only tightened the chains. Rigal dismissed him and read the statue's inscription directly.\n\n[Bronze Statue of Khan, Legendary Blacksmith]\n\n[A great blacksmith who dedicated his life to creating countless weapons and armor for the Overgeared Kingdom.\n\nMy teacher, friend, and family.\n\n—Overgeared King Grid—]\n\n\"Hoh? The famous one...\"\n\nThe empire's intelligence network was exceptional. They knew of Khan, who'd been closest to Grid.\n\n*Makes sense they'd erect statues throughout the kingdom.*\n\nKhan held immense significance for the Overgeared King and his people. Rigal understood this perfectly as he ordered, \"Tear down the statue. Throw it in the river.\"\n\n\"No! Don't!\" Jude went berserk, skin splitting where the chains bit into flesh. Blood streamed over iron. Even the soldiers and residents felt anger replace their fear. Some begged him to reconsider, but Rigal's command stood firm.\n\nAs the statue crumbled, Rigal declared, \"The empire will thoroughly restructure this place. Every symbol of the Overgeared Kingdom will burn. Your spirit will be trampled into dust. Resent being born to a powerless nation, and learn to bow before true power.\""
}