{
  "id": 1002,
  "title": "Chapter 1001",
  "content": "**Sky King Rigal** was a rider—a class built for mounted archery. From eight hundred meters up, astride his ancient wyvern **Allentica**, his bow became a reaper's scythe. Every arrow found its mark. Every target fell.\n\nBut right now, Rigal stood on the ground.\n\nNo mount. No altitude advantage. Just a training whip meant for disciplining wyverns and the crushing force of **Jude's** fists raining down like divine judgment.\n\nEach strike from Jude sent tremors rippling through the earth. Thunder seemed to rise from the very ground beneath them. The **imperial forces** watched in nervous silence while the **Overgeared members** dared to hope.\n\nOne clean hit to Rigal's face—just one—and the tide might turn.\n\n\"My Lord, let me give the boarding order.\" A subordinate couldn't hide his anxiety any longer. His hand was already raised to signal the entire army.\n\n**Earl Baron**, Rigal's right hand and commander of the air force, shook his head. \"Let him enjoy this. He wants to test the wild boar's potential.\"\n\nWhile they spoke, Rigal danced backward, evading every blow with practiced ease. His whip cracked through the air, always wary of Jude's left hand.\n\n\"Urgh!\"\n\nThe whip coiled around Jude's left wrist like a serpent. Simultaneously, the weighted tip struck his right hand with bone-jarring force. Jude's knuckles swelled instantly.\n\n\"This whip delivers shock through wyvern scales and hide,\" Rigal said, lips curving into a smile. \"An ordinary man would be writhing in agony. Yet you endure it.\" His eyes gleamed with appreciation. \"The more I see, the more I like you.\"\n\n\"Die!\" Jude roared like a wounded beast. Pain meant nothing. He yanked the whip wrapped around his left hand, pulling with terrifying strength.\n\n\"Haha, where do you—\" Rigal's amusement died as the whip went taut. \"Hup?!\"\n\nHe was dragged forward like a child on a rope swing. The world blurred past him. One moment he stood at a safe distance—the next, Jude's fist filled his entire vision.\n\nThe impact echoed across the battlefield.\n\n\"...!!\"\n\n**One of the Seven Dukes**—symbol of imperial might—overwhelmed by an unknown knight? The soldiers stared in disbelief. But their shock lasted only a moment. When Jude's fist struck home, it sounded like a sledgehammer against stone. Yet not a drop of blood appeared on Rigal's face. His body was simply too hard for Jude's raw power to penetrate.\n\n\"Ohhh...!\"\n\n\"As expected of My Lord...!\"\n\nThe cheers erupted—and died just as quickly.\n\nJude's left hand, still bound by the whip, crashed into Rigal's abdomen.\n\n\"Kuek...!\" The groan came unbidden. Rigal's face twisted with genuine pain. The **Gold Dragon Armor** that symbolized the Sky King offered no protection against that blow.\n\n\"You! Die!\" Jude's killing intent surged higher. His left hand—restored and enhanced by sheer willpower—darkened like tempered steel. Once, twice, three times, four!\n\n\"Cough!\" Dark blood finally spilled from Rigal's lips.\n\n\"This is absurd!\" Earl Baron, calm until now, barked the order. \"All units—mount up!\"\n\n---\n\nThe international community exploded with commentary.\n\n*—What the hell is that left hand? Just that one hand is terrifying.*\n\n*—Incredible. I heard even high rankers can't fight the Seven Dukes, but Grid's subordinate is doing it.*\n\n*—This is what 'Overgeared' means.*\n\n*—Wait, wasn't Jude one of the Four Heavenly Kings in the Demon King Subjugation?*\n\n*—Maybe? I think so.*\n\n*—How do you 'think so'? ㅋㅋ Jude's a Fighter. The Four Heavenly Kings were a fisherman, swordsman, knight, and tank.*\n\n*—Seriously? Then Jude isn't even one of them? And he can fight a Seven Duke?*\n\n*—That's the power of being overgeared. What the hell is he wearing on that hand?*\n\n*—I'm applying for Overgeared Kingdom citizenship right now. If I help in the war, maybe Grid will make me items.*\n\n*—But seriously... how do you get an NPC knight like that? Max affinity isn't enough. Do I need to feed him?*\n\n*—Gifts, not food. But you need status yourself and the right circumstances. It's mostly luck.*\n\n*—What luck? You need insight to read the situation correctly.*\n\n*—The method to seduce named NPCs?*\n\n*—Pure RNG system.*\n\n*—This game is all luck in the end.*\n\n*—Overgeared King Grid...*\n\n---\n\nTwelve strikes. In mere seconds, Jude's fist had hammered Rigal twelve times. Enhanced by **Frustration Raises a Man (SS)**, his left hand now exceeded his base stats by a magnitude that threatened one of the continent's strongest beings.\n\n\"Cough... cough! Kuweek!\" Blood poured freely now. The dignified duke who ruled thirteen kingdoms looked anything but dignified.\n\n\"You!\"\n\nFive thousand griffons and three hundred wyverns took to the sky in perfect formation. Weapons, magic, and breath attacks all converged on a single target—**Jude**. Enough firepower to reduce him to ash.\n\nJude didn't flinch. His entire focus remained locked on Rigal. His own survival meant nothing.\n\n\"Ohhhh!\"\n\nAll sensation had left his hand long ago. It no longer felt like part of his body—but that didn't matter. Jude roared and threw everything into one final strike at Rigal.\n\n\"...?\"\n\nSomething grabbed his neck from behind and yanked him backward. A normal person would've turned to look. Jude simply kept swinging at Rigal, his fists cutting through empty air.\n\nThe creature holding him was a wyvern—no, something far larger. A beast that could be mistaken for a dragon. Its name glowed brilliant gold.\n\n**Allentica**—the ancient wyvern passed down through the Gelder family for generations. Two hundred years of discipline had elevated its magic, flesh, and wisdom far beyond ordinary wyverns.\n\n\"Jude! It's dangerous!\"\n\n\"Look behind you, idiot!\"\n\nThe **Overgeared members** screamed warnings. Useless. Jude glared at Rigal and kept swinging at nothing.\n\nRigal pulled out a handkerchief and dabbed at his mouth, chuckling. \"Brave and ignorant. The first man to wound me on a battlefield is such a fool.\"\n\nWhile Jude's left hand carved futile arcs through the air, Rigal made his offer. \"Jude, I'll give you one last chance. Serve me. If you don't need wealth, I'll give you strength.\"\n\n\"...Strength!\" Jude stopped. Finally registered the wyvern's snout clamped around his neck. \"Jude. Need. Strength. Want to be. Strong.\"\n\nRigal's smile widened. Worth descending to this brute's level after all. He knew exactly how to claim someone with more muscle than mind.\n\nHe miscalculated the response.\n\n\"...?\"\n\n\"You. Die.\"\n\nThe ancient wyvern **Allentica** crashed to the ground like a meteor. Jude had simply grabbed its snout with his left hand and *pulled*. The artificial earthquake sent everyone sprawling. The five-thousand-strong air force launched instantly to escape the shockwave. Furious roars filled the sky as they seized aerial dominance.\n\n\"I can't tolerate this anymore.\" Rigal abandoned all mercy. \"If I can't have you, I'll kill you.\"\n\nHis whip cracked once more.\n\n\"Allentica!\" Rigal's cry brought the wyvern surging back to its feet with a roar. Flames engulfed Jude as he charged forward. He simply stood up in the fire and kept coming.\n\nRigal mounted Allentica and drew his bow—nearly two meters of death.\n\n\"Your only advantage is that ignorant strength. I thought it was amusing, but you don't know your limits.\"\n\nAura condensed around the arrow. The shaft swelled to the size of a small spear and streaked through the wind currents straight toward Jude. **Jude**, stripped of all equipment when captured, took the arrow through his bare chest.\n\nAgainst the dying light of sunset, the giant silhouette with an arrow through his heart collapsing was like the tragic ending of some epic film.\n\n\"Ah...\" The trapped **Overgeared members** could only watch. Guilt and helplessness gnawed at them as intuition whispered the truth. Jude would die. Was dying.\n\nBut—\n\n*『 No one can help. 』*\n\n*『 The Overgeared members defending Bairan aren't Agnus. What can they do without power? 』*\n\n*『 Such a shame. The last flame of Bairan will be extinguished. 』*\n\n**Bairan** had already fallen to occupation. Then Jude's sudden counterattack reignited hope. Five thousand three hundred against one. The outcome should have been obvious, yet viewers worldwide had anticipated a miracle. Jude's momentum had been so intense, so unstoppable, that millions watched with sweating palms.\n\nBut no miracle came. Despite his incredible showing, Jude hadn't even reduced Rigal's health by a tenth. Meanwhile, a single arrow left him on death's doorstep. True, he wore no equipment—but **one of the Seven Dukes** was simply on another level. According to rumors, Rigal ranked among the absolute strongest beings. An existence players couldn't hope to challenge yet. The sky above the sky.\n\n*『 Look at this estimate of the damage the Overgeared Kingdom will suffer when Bairan falls. 』*\n\n*『 It's catastrophic. Reidan's situation is also deteriorating. The Overgeared Kingdom faces its greatest crisis. 』*\n\n*『 The Saharan Empire's power is overwhelming. This proves why the empire rules the continent. 』*\n\n*『 The war's outcome is inevitable. The Overgeared Kingdom will be defeated and lose significant territory. 』*\n\nRigal climbed higher. Drew his bow again. This time, he aimed precisely at Jude's heart.\n\n\"Watch your city burn from hell.\"\n\nNo hesitation. The arrow flew true, aimed exactly where he intended.\n\nIt struck.\n\nThe trajectory matched his aim perfectly—but Jude wasn't there. Only bare ground remained where his heart should have been.\n\n\"...?\"\n\nHad something escaped Rigal's vision? At this altitude? His expression shifted—far more serious than when Jude's fist had caught him off-guard.\n\n\"...Overgeared King?\"\n\nA powerhouse had entered the field. Magic power surged like a tidal wave. Rigal's gaze snapped to the source—**Grid**, appearing through **Mass Teleport**. Jude's disappearance was clearly the king's doing.\n\nRigal smiled darkly and aimed his bow at Grid. He sat astride a massive wyvern with 5,300 air force soldiers at his back. All of them fell within Grid's field of vision.\n\nRigal released.\n\nHe wouldn't waste this opportunity to claim the enemy leader's head. The arrow crossed one kilometer in a heartbeat and struck its target.\n\n**[You have suffered 10,990 damage.]**\n\n**[You are currently in a war.]**\n\n**[During war, the king's death can trigger catastrophic consequences.]**\n\n**[WARNING: Death in war will result in massive penalties—increased experience loss, increased item drop rate, army morale collapse, facility level reduction, security deterioration, reputation loss, increased rebellion chance, and more.]**\n\nWarnings flooded Grid's vision as the arrow pierced his shoulder. He'd failed to evade. Yet Grid didn't falter. From the moment this war began, he'd been walking a knife's edge. He was already resolved. Victory against the empire's supreme forces would never come easy.\n\n\"**Blacksmith's Rage. Blackening.**\"\n\nYes...\n\n\"**Pagma's Swordsmanship.**\"\n\nNevertheless, he would win.\n\n\"**Transcended Link Flower.**\"\n\n**[Transcended Link Flower]**  \n**[Three sword dances sublimated into a single field.**  \n**Fire 40 energy blades with 200% physical attack power, marking all visible enemies.**  \n**Each mark generates two additional sword energies that track their targets.**  \n**Marked targets hit by sword energy receive 122 physical damage + 20% magic damage.**  \n**Every two hits create an additional mark. Maximum five marks can stack.**  \n**Skill Requirements: Sword-type weapon equipped.**  \n**Sword Energy Cost: 300**  \n**Cooldown: 20 minutes.]**\n\nTen thousand petals bloomed across the night sky. Blue petals fluttering with such heartbreaking beauty that souls seemed to drift after them. Viewers and Rigal's air force alike stood mesmerized for one precious heartbeat.\n\nDeadly beauty.\n\nForty energy blades cut through the scattering petals and struck Rigal—the signal. The petals revealed their true nature. Like cherry blossoms in a hurricane, they made contact with soldiers and *detonated*.\n\n\"Keuk!\"\n\n\"Kuaaaaak!\"\n\nRigal groaned. Soldiers screamed. Griffons and wyverns shuddered under the assault. The skill damage coefficient might be modest, but Grid's attack power rendered that meaningless.\n\n\"**100,000 Army.**\" Grid, who had closed the distance during **Transcended Link Flower**, suddenly retreated. Brought them all back into his field of view and raised his sword. \"**Blockade Sword!**\"\n\nThe reason Grid created the triple-fusion sword dance **Transcended Link Flower** was to maximize skill linkage. **100,000 Army Blockade Sword** dealt minor damage to every target in sight while inflicting the 'blockade' status. Roughly one-third of the air force couldn't resist. Movement sealed. Skills sealed. Magic sealed.\n\nNew marks appeared on the air force members—including Rigal.\n\nGrid reached him. Rigal's eight-hundred-meter altitude advantage meant nothing against someone wearing **Braham's Boots** and flying like a storm given form.\n\n\"You!\" Rigal fired again at Grid—who already had four arrows embedded in his flesh. But these arrows were different. **Ultimatum**—a killing technique that claimed any life it touched. The arrows contained Sky King Rigal's mana and the essence of generations of archery mastery.\n\nPointless if they never connected.\n\n\"**Revolve.**\" Grid spun, and **Ultimatum** reversed course—returned to sender. Another mark burned onto Rigal's body. The reflected strike hit with enough force to crack the **Gold Dragon Armor**. Grid kept coming.\n\n\"**Kill.**\" Catastrophic damage in succession. Rigal fired explosive arrows, desperate to create distance. Grid stood firm in the blast radius. Ignored the explosions and closed the gap.\n\n\"**Linked Kill Flower Pinnacle.**\"\n\nFive marks blazed on Rigal's body, and the death sentence fell. Grid sent no ultimatum, no challenge, no mercy.\n\nHe simply came to kill."
}