{
  "id": 1003,
  "title": "Chapter 1002",
  "content": "**Chapter [X]**\n\nFour armies converged on the empire's port cities like a tightening noose. The Immortal King Grenhal. Beast King Morse. Drunk Duke Diworth. Golden Crown Basara. Each commanded legions from their respective territories, sweeping the water clan from every harbor they touched.\n\nThere were no battles. The moment imperial banners appeared on the horizon, the water clan vanished like mist before dawn. The dukes took this as their natural due—after all, what fool would dare stand against them?\n\n\"Everybody in good health? It's been years since we've all gathered like this.\"\n\nTheir final destination was Galest, the empire's largest port and economic heart. Two days prior, King Maxong of the water clan had paralyzed every vessel in the harbor. The god of the sea, they called him. Galest's garrison had been powerless before his might.\n\nYet even the fearsome Maxong had fled at word of the dukes' approach.\n\nBeast King Morse clicked his tongue. \"I'd hoped to collar the water clan king myself. The disappointment stings.\" He shook his head. \"I knew the different species were uncivilized, but I didn't think even their king would be so... honorless.\"\n\n\"A king of beasts is still a beast,\" another duke remarked. \"What use is honor to them?\"\n\n\"At least the sea routes are open. We can flank Reidan from the rear now.\"\n\n\"If we had ships. The water clan king destroyed them all.\"\n\n\"A beast that thinks ahead? Now *that's* embarrassing.\"\n\n\"Do we really need to rush?\" Drunk Duke Diworth's voice carried the casual confidence of a man discussing dinner plans, not war. \"Rigal's already taken Bairan. We can afford to take our time.\"\n\n\"Again? That bastard's always first.\"\n\n\"The Gelder air force is the pride of the empire for good reason.\"\n\nThey all knew Rigal's record. Since inheriting his father's position seventeen years ago, he'd fought thirty-nine wars. The air force under his command had struck first in every engagement. They'd won unconditionally. And in all those campaigns—thirty-nine wars spanning seventeen years—they had suffered *zero casualties*. Not a single soldier lost. It was a testament to the terrifying advantage of raining death from high altitude while making every enemy air defense facility utterly meaningless.\n\n\"We'll wait for the shipwrights to finish repairs,\" Diworth said. \"Rigal will have it wrapped up by then anyway.\"\n\nThe others murmured agreement. For them, war was merely sport. Imperial victory was a foregone conclusion. Unlike Rigal with his obsessive need to build achievements, they felt no anxiety, no urgency.\n\nWhy would they?\n\n***\n\nBlue petals drifted through the darkened sky. Black heat rippled in their wake. The display was more colorful, more beautiful than any fireworks at a modern festival. Across the world, viewers sat transfixed. They felt genuine *loss* knowing this spectacle would soon fade. The flowers, the heat waves—they were so breathtaking that people found themselves thinking: *I wish time would stop.*\n\nThe most shocking part? One player was causing all of it.\n\n『Grid...!』 The commentators covering the Overgeared Kingdom's desperate last stand had been reduced to shouting single words. What else could they do? Less than four months had passed since the 4th National Competition. Grid's combat power had evolved to heights they couldn't adequately describe. Their vocabulary failed them.\n\n『T-The skill Grid just used in mid-air...!』\n\n『C-Casualties! The air force is taking casualties!』\n\n『The griffons that slaughtered Bairan's defenders by the thousands—they're *falling*!』\n\n『Sky King Rigal... he's bleeding!!』\n\n\"Linked Kill Flower Pinnacle.\"\n\nOne second. That was all it took.\n\nSeven strikes penetrated Rigal's chest in rapid succession. Simultaneously, ten flowers wreathed in lethal sword energy materialized around him, each one locked onto their target. Rigal—already reeling from having his own Ultimatum reflected back at him—couldn't stop the chain of devastation.\n\n**[Linked Kill Flower Pinnacle]**\n\n**Four sword dances sublimated into a single devastating field.**\n\n**Fires seven energy blades per second dealing 1,850% physical damage. Each strike triggers 'Disarm.' Inflicts bleeding and desperation effects.**\n\n**If marks exist on the target, summons two additional energy blades that ignore 65% defense and deal 961% physical damage + 10% magic damage.**\n\n**Requirements: Sword-type weapon equipped**\n\n**Sword Energy Cost: 400**\n\n**Cooldown: 1 hour**\n\nThis was the skill that proved why Grid still treasured the combination of Link and Kill. Why he'd become obsessed with Flower. His previous ultimate technique—Linked Kill Wave Pinnacle—had been formidable. Thanks to the goddess' blessing, it struck seven times per second at 300% damage while applying Wave and Pinnacle effects. Powerful, but incomplete.\n\nThe new Linked Kill Flower Pinnacle preserved Kill's devastating seven-strikes-per-second assault while maximizing the mark system's potential. Better yet, it boasted significantly faster cooldown and casting speed. Three hours reduced to one. The sword energy ignited spontaneously during the barrage, allowing for much more aggressive pressure than its predecessor. Even the raw damage output was superior.\n\nLinked Kill Flower Pinnacle outclassed Linked Kill Wave Pinnacle even without applying all five marks. The continuous Disarm effect meant the target couldn't benefit from any equipment for the duration.\n\n**[Target has received 1,250,900 damage.]**\n\n**[Target has received 1,199,320 damage.]**\n\n**[Target has received 1,301,010 damage.]**\n\n**[Enlightenment Sword's black flames trigger...]**\n\n**[Target has received 699,000 damage.]**\n\n**[Target has received 678,300 damage.]**\n\n**[Target has received 730,950...]**\n\n**[Target has received 16,409,200 damage.]**\n\n\"...!!\"\n\nKill hammered into Rigal seven times. Ten petals wreathed in sword energy followed, striking him silent—he couldn't even scream. The agony was worse than when Ultimatum had hit him. He could only endure, teeth clenched against pain that eclipsed anything he'd ever known. The devastating speed and power taxed even the caster.\n\n\"Pant... pant... pant...\"\n\nGrid's breathing came in ragged gasps as his stamina plummeted the instant Linked Kill Flower Pinnacle completed. Before him, Rigal's health bar had dropped to just over 20%.\n\n*I thought that would finish him. Damn, he's tough.*\n\nGrid had never expected Rigal to remain standing after taking his strongest combination head-on. More concerning—Rigal was the *weakest* of the Seven Dukes. He'd always struggled against his peers. His level was several times lower than Spear Saint Rachel's or Sword Duke Limit's. Despite commanding an air force that made aerial defense meaningless, his individual combat power was clearly inferior.\n\nAnd he'd just tanked Grid's ultimate technique.\n\n\"Allentica!\"\n\nThe moment Rigal shouted his ancient wyvern's name, his health gauge shifted to purple and rocketed back up to 60%. Grid's eyes widened. The wyvern's health bar had vanished completely.\n\nSynchronization. Rigal and Allentica's health pools had merged.\n\n*Boss mob mechanics!*\n\nNamed NPCs had one critical weakness—as humanoids, their health pools were inherently limited. But Rigal had overcome that limitation through his bond with the wyvern. He'd just entered a boss monster phase.\n\n*This is what a duke is...*\n\nThey were more formidable than Grid had calculated. He'd never encountered the Five Pillars, but he'd assumed he could take a duke one-on-one. That assumption now seemed dangerously naive. His eyes wavered.\n\nThen a massive, malevolent aura erupted with a deafening roar.\n\nRigal's archery was the antithesis of Jishuka's elegant precision. While her arrows moved invisible and silent, Rigal's arrows announced themselves with overwhelming presence, designed to crush the enemy's will before impact.\n\n**[You have suffered 14,500 damage.]**\n\n**[Powerful impact inflicts stiffness.]**\n\n**[You have resisted.]**\n\nThe close-range shot hurt far worse than the distance strikes. Grid crumpled, his health dropping to roughly 30%. Rigal was already drawing again, determined to end this before Grid could recover.\n\nIt was the correct tactical decision. Setting aside Grid's status as a minor king, he was too dangerous to give breathing room. Rigal's arrow became the signal. Behind him, thousands of air force soldiers trained their arrows and spells on the falling king.\n\n『Ah...!』\n\nThe commentators fell silent as a massive bombardment filled the sky. When that storm of death landed, Grid would die. His immortality would burn out, and he'd die slowly without escape.\n\nThe commentators didn't need to explain. Tens of millions of viewers watching worldwide could predict the outcome. So could the Overgeared soldiers and civilians on the ground below. Their captain—their *king*—would die here. Their screams of despair echoed across Bairan.\n\nOnly one person smiled.\n\nGrid flung himself backward as hard as he could, grinning.\n\n\"I've been waiting for this.\"\n\nSky King Rigal had earned his rank as a military commander, not an individual combatant. Grid had been *counting* on Rigal to command his army. Thousands of air force members. Grid wanted—no, *needed*—these bastards who'd trampled his land and slaughtered his people to attack him all at once.\n\n\"Belial's Power. Queen of Mocking and Violation.\"\n\nGrid split into two. Rigal's arrow struck true. Then there were three. Four. The effect of Tiramet's Power manifested an orange shield around his body while his health restored to 30% thanks to First King. But it wasn't enough. Not nearly enough.\n\nThe sky filled with arrows and spells raining down toward Grid. Rigal fired again.\n\n\"Flower Revolve.\"\n\nFour Grids moved in perfect synchronization, performing a brief sword dance while tracking as many projectiles as possible. Pagma had once fought Chreshler and read thousands of light spears with his eyes, recognizing them as targets and perfectly countering every single one.\n\nThat was impossible for Grid. The current Grid was dealing with arrows and spells comparatively slower than Chreshler's light spears. Even so, he couldn't perceive all the attacks and designate them as targets. Compared to the inhuman Pagma, Grid's perception and mental processing speed were lacking.\n\nWhich was why he'd activated Belial's Power—to share vision with his clones. Four sets of eyes tracking thousands of arrows and spells. Hundreds of petals materialized in the air. Those who looked closely could see the fine rotational pattern.\n\nThe petals centered on Grid, intercepting the thousands of projectiles flying toward him and launching them back at their sources.\n\n\"...!\"\n\nThe air force froze at the impossible sight of their own attacks returning. The sky convulsed. The world itself seemed to shudder. Returned arrows and rebounded magic reduced hundreds of air force members to ash. Meanwhile, some attacks still penetrated Grid's defense. He plummeted toward the ground as tens of thousands of cameras simultaneously shook, giving viewers splitting headaches.\n\n-...\n\nWorldwide, people sat speechless.\n\nGrid had faced thousands of enemies alone at high altitude. His feat of returning even *some* of that overwhelming bombardment had elevated him beyond the realm of mortality. Viewers couldn't measure or comprehend his strength anymore. They could only admire him while feeling awestruck and thrilled.\n\n**[A legend doesn't die easily. Health fixed to minimum value.]**\n\nFive seconds of immortality... The final notification appeared in Grid's vision as he crashed into the ground.\n\n*Shit... I only managed three Flower Revolves.*\n\nThe difficulty of coordinating skills through the clones was too high. Just as he'd prepared the fourth Flower Revolve, the enemy barrage had already arrived. He'd dealt less damage than anticipated.\n\nGrid felt disappointed. Rigal felt something entirely different.\n\nThe symbol of imperial nobility, the man whose face had never shown anything but aristocratic composure, now burned crimson with rage.\n\n\"You...! *You!*\"\n\nThe griffons and wyverns had been raised by the Gelder family for generations. Had Rigal ever experienced losing them? Never. Yet today, for the first time, he'd watched his soldiers scream and die. Nearly a thousand of them.\n\n\"Your... your head isn't enough! I'll destroy *everyone* here!\"\n\nThe enraged Rigal nocked five arrows simultaneously, pouring his entire mana pool into them. He would annihilate the Overgeared King lying broken on the ground and every resident of Bairan alongside him.\n\nThen a voice emerged from Grid's crumpled form.\n\n\"Summon Knight.\"\n\n\"...!?\"\n\nThe red drained from Rigal's face like water through a sieve. Instinct made him recall the mana he'd committed to the arrows. The presence of the two knights appearing in response to the Overgeared King's call was so overwhelming that survival instinct screamed he needed to conserve every scrap of power.\n\n\"W-What...?\" Rigal's eyes shook as the knights materialized to Grid's left and right. He knew His Majesty the Emperor had exiled Mercedes and that she'd become Grid's knight. But he hadn't imagined *this*. That *he* was also the Overgeared King's knight? That he still lived?\n\n\"S-Sir Piaro,\" Rigal whispered, voice trembling.\n\n\"It's been a while.\" The response came measured and calm. \"Since you're wearing the Gold Dragon Armor... your father must have died.\"\n\nIt wasn't an illusion. Rigal felt like he'd seen a ghost made flesh.\n\nPiaro addressed the man who'd lost all composure. \"We can talk later. Let's meet in hell.\"\n\nRigal floated 800 meters above ground. A shadow fell over him, swallowing even the moonlight. He looked up.\n\nA massive mortar descended.\n\n\"Keuk!\"\n\nDanger. The wound Grid had inflicted was serious. Fear of death overwhelmed confusion. Rigal snapped back to focus and yanked Allentica's reins. He needed to escape Pounding Mortar's range, and Allentica's flying speed made it possible—\n\n\"I won't let you escape.\"\n\nMercedes flew into his path, silver blade gleaming.\n\n\"You! Mercedes! You ugly *traitor*!\"\n\nThe Gelder air force that rendered kingdom-level air defenses meaningless was the strongest aerial force in the world. So why hadn't they participated in the Lubana war years ago? Simple—they were helpless against transcendent power. Just like Grid, powerhouses who dominated sky and ground could devastate the air force with single blows. Hundreds of years ago, Undefeated King Madra had brutally trampled the Gelder air force into nothing. The advantages of flight meant nothing before Legendary Knight Mercedes.\n\nA whirling silver sword cut through Allentica and Rigal simultaneously. The technique's destructive power matched Grid's swordsmanship but moved faster, more refined, connecting into a seamless chain of devastating strikes. Rigal lost control. The mortar fell on his head.\n\nThe shockwave obliterated thousands of air force members, turning them to ash instantly.\n\n\"Lord Rigal!\"\n\nThe survivors—Earl Baron among them—didn't flee. They rushed toward Rigal, who'd been crushed by the mortar and fallen to earth. A bitter expression crossed Grid's face.\n\n*If only they'd run... then I could slaughter disloyal troops without regret.*\n\n\"My Lord! My Lord!\"\n\nRigal's soldiers embodied loyalty itself. Knowing death approached, they still helped and escorted their commander. Meaningless sacrifice.\n\n\"Cough... cough...\"\n\nHit by both the legendary farmer and the legendary knight, Rigal's injuries were beyond recovery. Gray light—the harbinger of death—rose from his body.\n\n\"S-Sir Piaro. Please... please...\"\n\nRigal wanted to leave final words, but time wouldn't grant him even that mercy. His eyes, though, conveyed everything. He pleaded desperately for his men to be returned safely to their homeland, to their families.\n\n*Piaro, don't forget—you were their hero once.*\n\n\"What should I do?\" Mercedes asked Piaro's stone-faced silence.\n\nGrid gazed at the remnants of the air force. They stared back with fear, confusion, anger, and killing intent.\n\n\"Kill them all. Capture as many griffons and wyverns as possible.\"\n\n\"Yes.\"\n\nIf he'd intended mercy, he wouldn't have used the Undefeated King's swordsmanship. Wouldn't have summoned Piaro. He couldn't leave witnesses. War wasn't a game. He was risking his life and the lives of everyone precious to him.\n\nAnd then there was—\n\n\"...\"\n\nGrid saw Khan's destroyed statue.\n\nHis expression turned sorrowful as warning windows appeared.\n\n**[The Saharan Empire's duke 'Sky King Rigal' has been defeated.]**\n\n**[This is an unprecedented achievement.]**\n\n**[Continental reputation greatly increased. Acquired 2,000 reputation.]**\n\n**[Level Up.]**\n\n**[Level Up.]**\n\n**[Acquired Duke Gelder Family's Gold Dragon Armor.]**\n\n**[Acquired Duke Gelder Family's Giant Greatbow.]**\n\n**[Knight 'Jude' has broken through his limits by fighting the strong. Stats limit increased.]**\n\n**[You have gained special insight into the nature of legend, transcendence, and status.]**\n\n**[Achievement system—foundation of the title system—now applies to your knights as well.]**\n\n**[Knight 'Jude' has earned achievement: Loyal Knight]**\n\n**[Knight 'Jude' has earned achievement: Unquenchable Fire]**\n\n**[Knight 'Jude' has earned achievement: Battlefield Miracle]**\n\n**[Knight 'Mercedes' has earned achievement: Battlefield Miracle]**\n\n**[Knight 'Piaro' has earned achievement: Killing One of the Seven Dukes]**\n\n\"Piaro... I'm sorry.\"\n\n\"Don't apologize, Your Majesty.\" Piaro bowed respectfully.\n\nMercedes remained silent. Jude rose and looked for food.\n\nTogether with the three knights who had begun building their own *status*, Grid turned his gaze toward Bairan's people."
}