{
  "id": 1004,
  "title": "Chapter 1003",
  "content": "Not a single enemy had fallen to Ibellin or the Overgeared members. The air force's altitude advantage made interception impossible, and the heavy armor plating the griffons and wyverns proved impenetrable. They had failed to protect Bairan—trampled beneath overwhelming force.\n\nBut they hadn't fled.\n\nThey'd held the line to the bitter end, shielding the people with their own bodies. Arrows and spells meant for civilians rained down on them instead. They died. They resurrected. They gathered intelligence. Every scrap of information went straight to Lauel.\n\nArmed with their sacrifice, Lauel assessed the air force's full strength—and sent only Grid as reinforcement.\n\nThe Overgeared members seethed. Even Grid couldn't handle five thousand air force soldiers *and* Sky King Rigal alone. Where were the elite archers? The mages? The tanks to guard him? Why was he fighting without support?\n\nLauel must have underestimated the threat. Worse—they were constantly heaping impossible burdens on Grid's shoulders.\n\nNo. The fault lay with them. If they'd been stronger from the start, Bairan wouldn't have fallen. Grid wouldn't be carrying this weight alone.\n\nShame ate at them. They couldn't meet his eyes when he arrived.\n\nThen—\n\n\"...!\"\n\nGrid obliterated the air force with a single devastating strike. He battered Rigal until blood streamed down the duke's face. Though Grid crashed to earth afterward, pain stark across his features, he dragged himself upright. For his comrades. For his people. He faced Rigal and declared he would protect them all.\n\n\"...\"\n\nThen Piaro and Mercedes descended and annihilated the remaining forces.\n\n\"I'm sorry.\" The Overgeared members approached Grid, heads bowed. Still, they couldn't look at him. \"I'm sorry I'm never any help.\"\n\nBitterness saturated every word.\n\nThey trembled when Grid's gaze fell on them. \"What are you talking about? More people would've died without you.\"\n\n\"...\"\n\n\"It would've been much harder if you hadn't gathered intelligence on the air force.\"\n\n\"...\"\n\n\"You did well. Thank you.\"\n\nNo pretense colored his words. Grid was genuinely touched by colleagues who'd fought and died defending this place. Relieved to see the citizens relatively unharmed. When they still couldn't raise their heads, he added, \"If taking the bus bothers you now, just repay me later with a plane.\"\n\n\"How could we possibly—?\"\n\n\"I'm sure you can.\"\n\nGrid was certain now. The gap was closing. Chairman Lim Cheolho's prediction would come true—the divide between hidden classes and normal classes *would* narrow.\n\nTranscendents...\n\nThe more ordinary the class, the greater the potential for accomplishment. More levels. More power.\n\n'It has to be.'\n\nThese twenty-five Overgeared members who'd defended Bairan ranked mid-to-upper within the guild's power structure. Among two billion users worldwide? High rankers far beyond ordinary players.\n\nYet a single imperial unit had treated them like children.\n\nThe balance was broken.\n\nIf players remained helpless against escalating threats—the Empire, great demons, yangbans—their will to continue would erode. The game would die. S.A. Group understood this. Chairman Lim Cheolho had foreseen the problem and implemented the transcendence system.\n\n'Those who face overwhelming opponents and struggle... they'll become transcendents faster.'\n\nThe first transcendent player would emerge from the Overgeared Guild. Grid believed it absolutely. He shared his thoughts with his comrades.\n\nThe Overgeared members stared at him, stunned. Finally, one asked, \"Don't you think that's unfair?\"\n\n\"What is?\"\n\n\"You worked so hard to become a legend. You built that gap with ordinary players through blood and sweat. If it narrows—won't that feel unfair? Frustrating?\"\n\n\"Who knows?\" Grid looked skyward. Countless stars adorned the night, but only one moon hung above them.\n\n---\n\n[Gold Dragon Armor]  \n[* When struck by the same target within 3 seconds, damage reduction increases by 5%, stacking up to 30%.]\n\n[Giant Greatbow]  \n[* The giant race's power resonates through the bowstring with every draw.  \nSpecial options derived from exceptional materials.]\n\nGrid studied the items with keen interest, already planning an extended stay in the smithy. He wanted to dismantle both pieces, extract their characteristics, and forge something new.\n\nMercedes delivered her report with a note of disappointment. \"We successfully captured nine hundred fifty-seven griffons and twenty-six wyverns, but taming them will be... difficult.\"\n\nTheir loyalty to their former masters ran too deep. Even named horses rarely changed allegiance easily—griffons and wyverns far more so. Regret rippled through the Overgeared members.\n\n\"It's fine. Leave them with Nyangmong.\" Grid was the only one smiling.\n\n---\n\nSpear Saint Rachel descended from Dehakel—a legendary spearman and meritorious retainer who'd helped found the Empire. Among the Seven Dukes, her lineage and talent stood unmatched. No one treated her casually.\n\nExcept one person.\n\nRigal, her childhood friend, had always been comfortable and easy around her. Perhaps that made him special. It certainly made the shock larger.\n\n\"Rigal is *dead*?\" Rachel couldn't believe the news. Rigal had inherited his duchy only after his more talented older brother's untimely death. She knew better than anyone how hard he'd worked—training day and night to prove himself worthy of the Seven Dukes, caring for his people while mourning his brother. His efforts had been rewarded with respect and position.\n\nNow he was gone. Killed in a war against a kingdom barely ten years old.\n\n\"This isn't a funny joke.\" Nausea churned through her. Her head spun. Rachel—who looked impossibly young and beautiful despite being forty—nervously swept back her signature wavy blonde hair. It shone in the morning sunlight while her adjutant's expression remained dark.\n\nRachel couldn't bear the uncomfortable silence. \"...Is it true?\"\n\n\"Yes. Unfortunately...\" Her adjutant confirmed the reality once more.\n\n\"The air force?\"\n\n\"Annihilated.\"\n\n\"...\" Rachel's face twisted terribly. Her first thought was of Rigal's only son. A small child, barely nine years old. He'd lost his mother young—now truly orphaned. Could that little boy protect the air force, the very foundation of House Gelder, from vultures circling to seize it?\n\nImpossible. One of the seven families representing the Empire was destroyed.\n\n\"Pathetic fool. I told you to marry quickly and have more children.\"\n\nRachel had known young Rigal delayed marriage because of his feelings for her. But imperial law prohibited unions between ducal houses. She'd been forced to ignore his yearning heart, though she remembered how his gaze had burned whenever it fell on her.\n\n\"Will you go?\" her adjutant asked carefully.\n\nThe Twilight Spearmen—Rachel's elite force—stood ready to march at any moment. But she shook her head. She was a duke of the Empire. Emotion couldn't rule her decisions.\n\n\"There's something I must do first.\"\n\nRachel donned a cloak and left the barracks. Thirty knights parted to create a path when she emerged. One reported, \"According to scouts, he returned last night.\"\n\n\"Remember who we're dealing with. He owes us no courtesy—don't take offense at his words or actions.\"\n\n\"Yes, my lady!\"\n\nKirinus, the continent's best spearman. Finding him had taken years. She'd traveled to this remote place personally to meet him. Rachel needed to know if he surpassed her. Was she denied legendary status because she was inferior to him?\n\nShe had to know.\n\n---\n\nInside Kirinus' cabin, the master spearman observed the youth he'd been teaching for nearly a year with interest.\n\n\"You've improved your Control Sword.\"\n\nEight floating swords contained the fundamental essence of spear techniques—thrusting forward, spiraling, stabbing. They flew and sliced through air. The fairly monotonous skill had evolved. After clearing several hidden quests, the transformation pleased Kraugel.\n\nKirinus, however, was disappointed. \"You still haven't grasped the essence.\"\n\n\"The essence?\"\n\n\"*You* fight the enemy. Not the sword.\"\n\n\"...\" Understanding struck Kraugel immediately. Kirinus was saying the extra swords were unnecessary. Kraugel recalled the sword's true nature.\n\nCutting the target... To cut required speed and accuracy. Kraugel had been summoning multiple swords when needed, but only one sword actually required Control Sword's focus. That single blade flew far faster than before and cleaved through rock. At speeds no human could evade.\n\n[Sword Control Lv. 2]  \n[Control a sword with your will. Attack power is proportional to the weapon's attack power.  \nMaximum controlled swords: Up to 10.  \nCurrently controlled: Genuine White Fang.]\n\nWhen he first gained this skill upon becoming Sword Saint, Kraugel had thought of Grid's God Hands. He'd envisioned operating multiple swords the way Grid commanded his floating hands, expecting it would make him more versatile in combat. That's why he'd always deployed multiple blades simultaneously.\n\nHe'd been mistaken. Wielding many swords wasn't important. Mastering a *single* sword was both more critical and more powerful. The skill description never stated attack speed increased with quantity. Rather, it was proportional to Kraugel's *concentration*.\n\n\"Ah.\" Enlightenment washed over Kraugel as he recalled his battle with Grid. The fight had actually been more favorable *before* he'd used Control Sword—when he'd focused on evading Grid's God Hands while wielding just one sword. That's when he'd truly threatened Grid.\n\n'Control Sword isn't meant to assist in combat.'\n\nUnderstanding and applying it as a pure attack skill would unleash far greater power. Kraugel realized he'd advanced further. This was something he couldn't have obtained by walking the path Muller had laid.\n\nComing to Kirinus had been the right choice—an opponent he could learn from, exchange insights with. Kraugel recognized the importance of a teacher, thinking of Khan and Grid.\n\nHe was deep in concentration when—\n\n\"Kirinus, come out!\" A group appeared outside, shouting.\n\n\"...?\" Kraugel turned his head and froze when he saw Rachel. Having more information than most players, Kraugel couldn't be ignorant about the Empire's Seven Dukes. Unexpectedly, Rachel also recognized him. The Sword Saint was a celebrity even in the Empire.\n\n\"Why are you here?\" Rachel asked.\n\n\"A sign that I shouldn't turn away from a friend's crisis,\" Kraugel answered cryptically. The Sword Saint's presence pressured Rachel's knights with quiet intensity."
}