{
  "id": 1006,
  "title": "Chapter 1005",
  "content": "# Chapter: Blood in the Sand\n\nReidan stood as the gateway to the Overgeared Kingdom, its castle walls the first line of defense against the Saharan Empire's expansion. For a month now, the imperial advance had stalled in the desert—broken against the combined strength of elite soldiers equipped with Grid's standardized battle gear and the kingdom's top-ranking fighters.\n\nMarquis Fulbas squinted through the heat shimmer rising from the sand. Somewhere ahead, barely visible through the distortion, the spires of Reidan Castle wavered like a cruel joke. His men had begun to wonder if the fortress was real at all, or just another mirage conjured by this godsforsaken wasteland.\n\nThe desert was killing them slowly. Each day brought the same punishing heat, the same grinding skirmishes, the same dwindling supplies. Morale had sunk lower than the sun on the horizon.\n\nThen came the messenger, his face flushed with something Fulbas hadn't seen in weeks: hope.\n\n\"Lord Marquis! The enemy forces ahead—they've withdrawn!\"\n\nFulbas rose from his campaign chair. \"What?\"\n\n\"The Overgeared troops stationed in the deep desert have pulled back toward Reidan!\"\n\nThe tent erupted. Nobles who'd been sulking in the shade suddenly crowded forward, talking over each other.\n\n\"The desert is ours!\"\n\n\"Finally! We can advance without those damned ambushes!\"\n\n\"Prepare for a rapid march! Reidan Castle by nightfall!\"\n\nFulbas raised a hand, silencing them. He turned to his staff officers, who stood apart from the celebrating nobles, their expressions considerably more guarded.\n\n\"Opinions.\"\n\nHis chief strategist stepped forward. \"It's too convenient, my lord. The Overgeared forces know this terrain better than we know our own palace gardens. Why would they surrender that advantage?\"\n\nAnother officer nodded. \"There will be traps. Giant worm nests along our route, almost certainly.\"\n\n\"Every oasis will be poisoned,\" a third added.\n\n\"The dune slopes could hide entire companies. Classic ambush terrain.\"\n\nFulbas stroked his beard. \"And yet?\"\n\n\"And yet we must advance anyway, my lord.\" His chief strategist spread his hands. \"There's no route around the desert. We cross it, or we turn back.\"\n\n\"The timing suggests their forces are exhausted,\" another officer offered. \"Perhaps they've pulled back because they lack the manpower to hold the line.\"\n\n\"This could be our moment,\" the chief strategist pressed. \"We've had reinforcements arriving weekly. They haven't. If they're tired enough to abandon the desert entirely...\"\n\nFulbas considered this. The logic was sound, even if his instincts screamed otherwise. They had two hundred and fifty thousand soldiers. Even accounting for the casualties—and there had been thousands—the imperial army still outnumbered Reidan's defenders three to one.\n\nHe nodded slowly. \"Issue the command. Full advance, all units. But maintain extreme caution.\"\n\n\"Yes, Lord Marquis!\"\n\nThe orders rippled outward. Within the hour, the vast imperial war machine lurched into motion.\n\nTwo hundred and fifty thousand strong, the army moved like a steel tide across the sand. Officers rode up and down the columns, shouting encouragements. The momentum built—a palpable thing, lifting the exhausted soldiers' spirits.\n\nBut Fulbas couldn't shake his unease.\n\n---\n\nThe desert fought them for every mile.\n\nGiant worms erupted from the sand without warning, their massive jaws shredding through formations and swallowing soldiers whole. The oases—precious water sources that could have sustained the army—had indeed been poisoned. Men who drank from them died writhing, bloody foam on their lips.\n\nThe march slowed to a crawl.\n\n\"Damned Rebecca Church,\" Fulbas muttered as another report of casualties reached him.\n\nHis deputy glanced over. \"My lord?\"\n\n\"Centuries of imperial patronage, and when we need them most, they refuse us.\" Fulbas spat into the sand. \"Divine power that could cleanse these poisons, heal these wounds—and Damian sits in Reinhardt, holding the Church's leash for Grid.\"\n\n\"Pascal's failure,\" his deputy agreed quietly.\n\nFulbas grimaced. Yes. The empire's greatest mistake had been in not securing control of the Rebecca Church when they had the chance. After Empress Aria's death and Piaro's betrayal, the Emperor had grown... complacent. Weakened.\n\n\"Lord Marquis.\" His chief strategist rode up, face tight with concern. \"The scouts haven't reported in.\"\n\n\"What?\"\n\n\"All of them, my lord. Complete radio silence for the past two hours.\"\n\nThe unease crystallized into something colder. Fulbas raised his fist, halting the column. \"How many did we send?\"\n\n\"Forty in the first wave.\"\n\n\"Send another hundred. Double time.\"\n\nNight had fallen while they marched, transforming the desert from furnace to freezer. The sand beneath their feet had gone from burning to frigid. Above, stars glittered with cruel indifference.\n\nAn hour passed. Then two.\n\nNone of the second scouting party returned.\n\n\"Battle formations!\" Fulbas barked. \"Now!\"\n\nTwo hundred and fifty thousand soldiers shifted with practiced efficiency, weapons appearing in hands, shields locking into walls. The temperature dropped further. Men's breath misted. Hands gripped sword hilts tighter, both from cold and mounting tension.\n\nBut the desert remained still. No war cries. No thunder of hooves. Not even the distant howl of a beast.\n\nSilence.\n\nMinutes stretched. The soldiers' initial alertness began to fray. Some shifted their weight, others glanced at their neighbors. What were they even watching for?\n\nThen the center of the formation exploded.\n\n---\n\nThe blast of displaced sand knocked men from their feet. Fulbas wheeled his horse toward the commotion, and for a moment, he couldn't process what he was seeing.\n\nA child stood in the crater.\n\nNo—not stood. *Floated*, several inches above the sand, as if gravity had forgotten him. He couldn't have been more than thirteen, with features so beautiful they seemed carved rather than born. Silver hair fell to his shoulders. And his eyes...\n\nThose eyes looked at the surrounding army like a farmer appraising cattle.\n\n\"Prey,\" the boy said, voice carrying effortlessly across the shocked silence. \"It's been quite a while.\"\n\nHe smiled, and Fulbas's blood turned to ice.\n\n*Fangs.*\n\nLong, curved, designed for only one purpose.\n\n\"VAMPIRE!\"\n\nThe shout came from somewhere in the ranks, but it didn't matter who said it. Every soldier had reached the same horrified conclusion.\n\nFulbas's mind raced. Vampires lived beneath Reidan's desert—the empire knew this much. But they were cursed by Yatan himself, bound by the Curse of Idleness that kept them sleeping for decades at a time. The historical records showed only a handful of incidents where they'd actually emerged to the surface.\n\nSo why was this one here? How had he overcome the curse?\n\nThe officers were already screaming orders. Heavy infantry surged forward, shields raised. Archers nocked arrows. Spearmen formed ranks.\n\n\"Kill it!\" an officer bellowed. \"Don't let a single demon walk on human soil!\"\n\nTwo hundred and fifty thousand soldiers against one vampire child. Even a True Blood would be overwhelmed by such numbers.\n\nThe boy watched the arrows fly toward him and laughed.\n\n\"Piggish.\"\n\nMagic power detonated from his body like a bomb.\n\nFulbas had seen battlefield magic before—walls of flame, storms of ice, lightning that arced between men. This was different. This was *wrong*. The power that erupted from the child wasn't elemental. It was *blood itself*, given form and fury, a crimson tide that swallowed the darkness and painted the desert red.\n\nThe magic hit the incoming arrows and dissolved them mid-flight. It shredded through spears like they were wheat stalks. And when it reached the charging infantry—\n\n\"AAAAAGHH!\"\n\nThe screams were worse than any battle cry. Men's armor simply *peeled away*, the metal corroding as if aged a thousand years in seconds. The soldiers beneath fared worse. Their skin withered, their eyes sank, their screams died in dessicated throats as every drop of moisture was ripped from their bodies.\n\nIn five seconds, three hundred soldiers died.\n\nIn ten, a thousand.\n\nThe blood magic expanded like a living thing, feeding on its victims and growing stronger with each life consumed. Mummified corpses collapsed in its wake.\n\n\"This can't—\" An officer near Fulbas had gone white. \"That's not a True Blood!\"\n\n\"What?\" Fulbas couldn't tear his eyes from the carnage.\n\n\"Only a direct descendant could—\" The officer's voice cracked. \"Only one directly created by Shizo Beriache could possess that kind of power!\"\n\nThe words hit like hammer blows. A direct descendant. The same classification as Marie Rose, the vampire who three centuries ago had required an army of paladins and three Sword Saints to defeat. The greatest disaster humanity had ever faced.\n\n\"Who are you?!\" Fulbas roared, though his voice shook.\n\nThe boy swept his silver hair back with one delicate hand. Around him, the blood magic continued its feast, and he looked entirely unbothered by the chaos.\n\n\"An Earl.\"\n\nThe word dropped like a stone into still water.\n\n\"Earl...\" someone whispered.\n\nFewer than ten vampires in existence carried that rank. All of them were direct descendants. All of them were classified as extinction-level threats.\n\n\"An Earl of the Overgeared Kingdom,\" the boy continued, his smile widening. \"Noll.\"\n\nThe desert went silent except for the dying.\n\n*Overgeared Kingdom?* Fulbas's mind reeled. A vampire—a direct descendant—serving Grid? When? How? Why would a creature of the night ally with humans?\n\n\"Lord Marquis!\"\n\nA runner staggered up, blood streaming from a gash on his forehead. \"Captain Dellua—she's been killed! Captain Collina too! And the staff officers of the Second Army are—\"\n\n\"Assassins.\" Fulbas felt something inside him crack. \"They used this as a diversion.\"\n\nNoll's laughter echoed across the desert, and the imperial army—so mighty just moments ago—trembled.\n\n---\n\nIn the chaos of the vampire's emergence, no one noticed the shadows moving through the ranks.\n\nShay withdrew his blade from the staff officer's kidney, already turning toward his next target. Blood sprayed—less than you'd expect if you knew where to strike. The dying man tried to call out, but Shay's follow-up thrust crushed his windpipe.\n\n*Ten days,* Shay thought as the body slumped. *Ten days hiding among these bastards.*\n\nIt had been the worst infiltration of his career. Memorizing troop movements, mimicking imperial mannerisms, sleeping in shifts, always one wrong word away from discovery. He'd cursed Grid's name more times than he could count.\n\nBut they'd done it.\n\n\"Third target down,\" Kerb whispered through the communication link. \"Moving to rally point.\"\n\n\"Fourth acquired,\" Sniffer added. \"This is actually working.\"\n\n\"Fifth complete,\" Shay confirmed, cleaning his blade on the dead officer's cloak. \"Heading to—\"\n\nAn alert rang through the camp: \"Viscount Dellua has been assassinated! Count Collina is dead!\"\n\nShay froze. He glanced at Kerb, who shook his head.\n\n\"We didn't touch them,\" Kerb mouthed.\n\n\"Those weren't our targets,\" Sniffer confirmed through the link.\n\nWhich meant—\n\n\"Faker.\" All three assassins spoke the name simultaneously.\n\nOf course. The man who'd killed four Red Knights in broad daylight. The shadow who'd once eliminated an entire guild's leadership in a single night.\n\n\"Remind me never to piss off the Overgeared Guild,\" Kerb muttered.\n\nShay nodded. The kill order they'd been so terrified of suddenly seemed very, very real. \"We made the right choice working with Grid.\"\n\n\"For once, yeah.\"\n\nAround them, the imperial army descended into pure chaos. Officers shouted contradictory orders. Soldiers ran in every direction. And in the center of it all, the vampire Earl's blood magic continued its harvest.\n\nShay and his team melted back into the confusion, already planning their extraction.\n\n---\n\nIn Reinhardt, half a continent away, Grid stood in his workshop surrounded by the finest blacksmiths of two continents.\n\nWhite, from the White Hammer Smithy of Pangea. Enoch, Byuksan, and Lahochu from the East. And Panmir, the empire's former first-ranked craftsman who'd defected after seeing what Grid could accomplish.\n\n\"A cannon,\" Grid repeated, meeting each man's eyes in turn.\n\nBefore him, a notification window hovered:\n\n**[Legendary Blacksmith's Creation]**\n*[What item do you want to create?]*\n\n\"I'm going to make the biggest siege weapons you've ever seen,\" Grid continued, his hands already moving to sketch designs on parchment. \"And then I'm going to make a hundred more.\"\n\nHe thought of the Cannon Aiming at the Battlefield he'd crafted during the National Competition. That had been impressive. This would be *devastating*.\n\n\"The empire wants a war?\" Grid's smile was cold. \"Let's give them one they'll never forget.\"\n\nHis hammer struck the anvil, and sparks flew like stars."
}