{
  "id": 1007,
  "title": "Chapter 1006",
  "content": "\"Terrifying,\" someone breathed.\n\n\"Forty-three seconds beyond what I needed.\" Euphemina's eyes tracked the vampire's retreat, calculating.\n\nTwo minutes and twenty-three seconds. That was how long Noll survived in the heart of the enemy formation. Tens of thousands of attacks had rained down on him simultaneously—yet he endured.\n\nBetween his inherent vampiric constitution and the armor Grid had forged specifically for him, Noll was a nightmare to kill. The Valhalla of Strong Trust increased his maximum health while reducing incoming damage and bolstering both physical and magical defense—especially in darkness. Against multiple opponents, its protection grew even stronger. Paired with his blood-draining regeneration, he was functionally immortal.\n\n\"Nearly unkillable,\" Euphemina murmured. \"Blood-drinking and that armor...\"\n\nNoll's survivability transcended fraud—it bordered on absurd. Regular soldiers who hadn't reached their third advancement couldn't scratch him. Even among Marquis Fulbas's 250,000 troops, the real threats—the third advancement elites and fourth advancement nobles—were concentrated at the vanguard. By the time they reacted to his penetration of the center formation, Noll had already carved through the ranks.\n\nHe'd proven the old saying true: direct descendants were walking disasters.\n\nBut he'd also proven something else—the fundamental limitation of individual power against armies. \n\nTwo minutes and twenty-three seconds of combat. Against a quarter-million soldiers, that might seem impressive. But in practical terms? It was barely enough time to visit the bathroom.\n\nEven someone as formidable as Noll could only maintain that intensity for so long. In those precious seconds, he'd engaged roughly two thousand enemies. Two thousand out of 250,000 turned to ash. The mathematics were stark: no matter how powerful the individual, there was a hard ceiling on how many armed combatants one person could fight simultaneously.\n\nEuphemina watched Noll's desperate, magnificent assault from beginning to end, and something clicked into place.\n\nHis rampage hadn't been about slaughter at all. It had been a distraction—buying time for Faker and Kasim to eliminate key targets. She'd been thinking about the problem wrong. Her Duplication ability had immense destructive potential, and she'd been using it exactly that way: copying devastating spells, maximizing body count.\n\n*But against hundreds of thousands...*\n\nNo matter how massive the magic she replicated, she alone couldn't kill enough enemies to matter. Not against a fully prepared army of this scale.\n\n*I need something other than raw firepower.*\n\nWhat won wars, if not overwhelming force? Strategy. Morale. Information. How could she leverage those advantages? Grid and her guildmates trusted her completely—she refused to disappoint them. The Overgeared Kingdom had become the most precious thing in her life.\n\nThen it came to her.\n\n\"Huroi.\"\n\nOne man. An orator who lived in Grid's shadow, thinking and acting for Grid's sake alone. The loyal mouthpiece who stepped forward during every crisis. The reason Reidan's soldiers had held firm through the brutal month-long siege against imperial forces was largely due to Huroi's verbal mastery. Words that could save or doom with equal ease. The first-ranked orator, maintaining troop morale through sheer oratory.\n\n\"Excuse me. Huroi?\"\n\n\"What?\"\n\nPerched in an oasis tree overlooking the desert army, the man lowered his telescope. The hen on his shoulder ruffled its feathers. Euphemina ignored it, meeting his gaze directly.\n\nThis would be awkward. Unlike other guild members, Huroi served Grid exclusively. He had little interest in personal relationships beyond that devotion. Euphemina rarely spoke with him one-on-one. Worse, his attitude toward her had grown increasingly hostile ever since her association with Agnus began. Still, she pushed past the discomfort.\n\n\"Are you familiar with the Disguise class?\"\n\n\"I've heard of it.\" Huroi's tone remained flat. \"A hidden class specializing in flawless disguises through makeup and prosthetics.\"\n\n\"I've been tracking down information about it for two years. Since I first heard rumors of its existence.\"\n\n\"Just like you tracked down Agnus?\" Huroi's voice turned arctic.\n\n\"...Hah.\"\n\nInsufferable man. Euphemina's smile strained as her delicate eyebrows drew together. With her twin ponytails bouncing, she only looked more adorable when annoyed—which made Huroi's hostility worse. She was one of the few people Grid actually feared, and that alone was enough for Huroi to dislike her. His liege—the master of the Overgeared Kingdom, the man he'd sworn to serve—felt *intimidated* by this woman. That made her dangerous.\n\n*And she committed sins against His Majesty in the past...*\n\nAncient history, admittedly. Since joining the guild, Euphemina had compiled countless achievements. That didn't matter. Huroi simply didn't like her. Especially her relationship with Agnus, whom Grid rightfully viewed with suspicion.\n\nHe clicked his tongue. \"Why bring up the Disguise class, then?\"\n\nEuphemina had no desire to prolong this conversation either. She suppressed her irritation and cut to the point. \"I'll copy the Disguise skill and transform you into an imperial soldier. You'll infiltrate their camp, sow discord, and tear them apart from within.\"\n\n\"Is this Lauel's plan?\"\n\n\"No. It's mine. I need your cooperation. If you agree, I'll present it to Lauel for approval.\"\n\n\"Hrm...\"\n\nPropaganda. Fabrication. Verbal evisceration. Psychological warfare—all of Huroi's specialties. But the Empire had caught on. During the war, he'd never been given an opening to speak. His role had been reduced to morale support from the rear. With a Disguise skill, though? That changed everything. He'd have opportunities to work.\n\n\"The plan has merit.\"\n\n\"Good. The limitation is that Disguise lasts three days maximum. After that, you automatically revert to your original form. If your disguise is compromised before then—if the makeup smears—the effect weakens and detection becomes more likely.\"\n\n\"Three days...\"\n\nCould he spread effective disinformation through 250,000 troops in seventy-two hours? Even as the first-ranked orator? Huroi's expression soured.\n\nEuphemina laughed. \"Can't handle it? Then forget I asked. I suppose even you have limits.\"\n\n\"...What?\"\n\nFury sparked behind his eyes. He nearly launched into the type of genealogical inquiry that would make sailors blush. Swearing and Spiteful Tongue were orator skills—language-based attacks. He'd insulted so many parentages that the profanity came reflexively now. A dangerous habit. If he started verbally abusing people in the real world, he'd face lawsuits...\n\n\"...Hm.\"\n\nOr worse, he'd become like Peak Sword—spending his time writing toxic internet comments. The thought horrified him. Huroi had immense respect for Grid, who walked the middle path with perfect balance between strength and restraint. A good man, perhaps the finest he'd ever know.\n\nThinking of his liege calmed him. *Be more like His Majesty.* He composed himself, then met Euphemina's eyes with clarity. \"I'll do it. Provided your disguise is flawless.\"\n\n\"Smart answer. I'll acquire the Disguise skill as soon as possible. Meanwhile, have Faker collect detailed intelligence on potential targets—mannerisms, speech patterns, anything that'll make the impersonation airtight.\"\n\n\"Understood.\"\n\nTheir first true collaboration in years. Neither realized they were brewing a catastrophe.\n\n***\n\nThe white papal vestments hung in tatters. The holy sword—which should have blazed with divine radiance—flickered dimly, worn and fractured. Surrounded by Yatan's Servants, Pope Damian was dying. A pathetic figure compared to the First Pope, who'd eradicated evil wherever it took root.\n\n\"Are you an idiot?\" \n\nRose—the first-ranked black magician and one of Yatan's Servants—stared at him with something beyond mockery. Genuine bewilderment. \"The Rebecca Church barely has combat power outside Rebecca's Daughters. Why fight us head-on? You could've used guerrilla tactics, kept your Daughters mobile. Instead, you threw away your position. When this defeat lands on your shoulders, the Church will strip your title. You realize that, don't you?\"\n\nShe'd identified the crux of the matter. From the outset, the Rebecca Church had no path to victory against the Yatan Church. Damian would bear responsibility for this catastrophic loss. Everyone understood how foolish this war had been.\n\nYet he had no regrets.\n\n\"Even if I could return to a month ago, I'd declare war again.\"\n\nHe'd wanted to help Grid. His papal position had been a gift from Grid, anyway—something he could discard at will if it served Grid's cause.\n\n\"Interesting.\" Rose's tone shifted. \"So the rumor's true. You started this war as an excuse to refuse the Empire's call for aid.\"\n\nShe considered the past month of combat. Damian had never intended to win. He'd focused on minimizing allied casualties while prolonging the conflict—buying time. He'd thrown his life away at least twenty times to protect NPC priests and paladins.\n\n\"You've died at least ten times in this war alone. Don't you think that's excessive? All that sacrifice for others?\"\n\n\"...No.\" \n\nDamian channeled what little magic he had left into his holy sword, forcing himself upright. The tattered vestments whipped across his vision. He tore off the papal robe entirely and gripped the weakly glowing blade. \"There's nothing excessive about it.\"\n\nHe couldn't forget those early days with Grid. Back when he'd been background noise—invisible in the vast world. Meeting Grid had transformed him into a protagonist. The landscape had changed, becoming beautiful and brilliant. The joy he'd felt when Isabel recovered from the brink of death still resonated in his chest.\n\nAll the glory and happiness he'd received came from Grid. Returning it for Grid's sake wasn't too steep a price.\n\nOnly one thing troubled him.\n\n*I won't see Isabel-chan anymore.*\n\nExcommunication would bar him from Rebecca's Daughters. That loss hurt. Frightened him. But he stood by his choice. He couldn't watch the Empire crush the Overgeared Kingdom—the nation Grid and their comrades had spent years building.\n\n\"I see. I still don't understand why you'd abandon the papacy, or why Yura would forsake her position as one of Yatan's Servants.\" Rose shook her head, gathering magic at Belial's Staff's tip. The prospect of killing Pope Damian filled her with anticipation—\n\nThe blow never landed.\n\nLightning-fast movement. The intruder who'd just entered the religious battlefield carved through Yatan's black magicians in seconds, reaching Rose before she could react. A devastating strike crushed into her side.\n\n\"Keok! Agh—\" \n\nHer spell collapsed. Rose's eyes burned red with agony and rage.\n\n\"Bastard!\" The other Yatan Servants, who'd been content to watch Damian's execution, roared in fury.\n\nThe uninvited guest cut through them and reached Damian's side. \"My name is Oasis.\"\n\nDrums thundered across the battlefield. The startled Servants turned toward the hill, where tens of thousands of reinforcements stood. At their head, a middle-aged man sat astride a red warhorse—larger than any normal mount. He had a magnificent beard and an air of easy confidence.\n\nRecognition struck instantly.\n\n\"The Valhalla King!\"\n\nAres, the God of War. He waved cheerfully at Damian. \"We're hoping the Rebecca Church and Valhalla can build a good relationship.\"\n\n\"Ha... Hahaha...\" \n\nDamian laughed. He'd been despairing just moments ago—mourning the loss of Isabel, terrified of being cast out and losing everything he'd built, of returning to irrelevance.\n\nThen Oasis spoke again: \"I've read everything written about you, Damian. I deeply sympathize with and respect your journey.\"\n\nOasis had once been like him—ordinary. Crushed under the weight of expectations. But that version of Oasis no longer existed. He'd abandoned hesitation, trusted himself, overcome fear. With Ares's guidance, he'd grown steadily, finally earning the right to stand on the world stage.\n\n\"100,000 Army Swordsmanship.\"\n\n***\n\nMeanwhile, in the Overgeared Kingdom's capital...\n\n\"The West Continent hasn't developed breech-loading firearms yet? Loading from the rear would dramatically improve firing rate...\"\n\n\"If we integrate the East Continent's shipbuilding techniques, the accuracy will far exceed current sea-land artillery.\"\n\n\"Standardizing the caliber makes sense. Challenging, but manageable if we use insane dragon iron.\"\n\nBlacksmiths from both continents crowded around the worktable, exchanging ideas for the new cannon design. Too many cooks normally spoiled the broth—but not when the king himself directed the kitchen.\n\nGrid stood at the center with blueprints spread before him, occasionally coordinating the smiths' suggestions, filtering proposals, synthesizing the best elements. International media outlets, unaware of what transpired behind closed doors, published their speculation on his absence.\n\n**[GRID, THE PROTAGONIST, HAS RETIRED]**\n\n**[THE OVERGEARED KINGDOM'S WAR WITHOUT GRID]**\n\n\"...\""
}