{
  "id": 1009,
  "title": "Chapter 1008",
  "content": "# **[Overgeared Cannon]**\n\n**Rating:** Unique – Legendary\n\n**Unique Rating:**\n**Attack Power:** 45,000 fixed damage\n* Damage scales with the operator's Firearms Mastery skill level\n* Splash damage applies within a 4-meter radius of impact\n**Defense:** +200\n* Negates one ranged attack (1-minute cooldown)\n**Attack Speed:** Once every 19 seconds\n**Movement Speed:** 2 meters per second\n**Range:** 300 – 880 meters\n* Requires three operators\n* Deals triple damage to structures and siege weapons\n\n**Legendary Rating:**\n**Attack Power:** 60,000 fixed damage\n* Damage scales with the operator's Firearms Mastery skill level\n* Splash damage applies within a 6-meter radius of impact\n**Defense:** +350\n* Negates one ranged attack (45-second cooldown)\n**Attack Speed:** Once every 15 seconds\n**Movement Speed:** 2 meters per second\n**Range:** 150 – 1,050 meters\n* Requires three operators\n* Deals triple damage to structures and siege weapons\n\n*A revolutionary cannon forged by the legendary blacksmith Grid—recognized by the gods themselves—in collaboration with master craftsmen from both the West and East Continents.*\n\n*Every calculation has been refined to perfection. The weapon functions only when constructed from black iron of precise specifications. The carriage system, engineered to absorb recoil while maintaining mobility, allows rapid repositioning on the battlefield. The linkage between wheels and barrel—a triumph of collaborative ingenuity—grants operators unprecedented flexibility in trajectory adjustment.*\n\n*The protective shield mounted above embodies Grid's fervent prayer for his soldiers' safety. The breech-loading mechanism, with integrated ammunition storage, eliminates the need to reload from the muzzle—dramatically increasing firing rate while preserving aim between shots. The extended barrel maximizes both destructive power and effective range.*\n\n*This weapon represents nothing less than a paradigm shift. The Overgeared Cannon transcends every limitation of conventional artillery and will forever change the nature of warfare.*\n\n**Requirements:** Marksman class with Firearms Mastery\n**Weight:** 39,500\n\n---\n\nGrid studied the description with satisfaction. The word *revolution* stood out prominently. He could only imagine what additional accolades would appear once the legendary-rated versions were completed.\n\n\"...\"\n\nHe glanced at the exhausted craftsmen embracing each other in celebration, then quickly looked away. The finest blacksmiths of the age... all of them stripped to the waist to endure the forge's brutal heat. All of them men.\n\n*Would've been nice if at least one were a woman.*\n\n\"...\"\n\n*No. Stop that train of thought right now.*\n\nGrid shook his head sharply and surveyed the workshop. These men were masters of their craft. Every technique they'd honed over decades of labor was embedded in the Overgeared Cannon's design. The weapon they'd created together was worthy of every word of praise in its description.\n\nGrid's determination blazed hotter than any furnace. \"Let's begin mass production.\"\n\nBlueprints were consumable items. Only Grid possessed the original design and could learn it directly. However, the craftsmen who'd contributed to the cannon's creation weren't fools—they'd absorbed every detail during the design process.\n\nEach participating blacksmith received an incomplete blueprint. While it lacked Grid's guarantee of unique-minimum rating, the Overgeared Cannon's baseline performance made even imperfect versions formidable.\n\nEight hearths roared to life alongside the personal furnace of Overgeared King Grid. The temperature in the smithy climbed as master and apprentice worked in unison.\n\n*Clang! Clang! Clang!*\n\nThe rhythmic hammering resonated like a battle hymn. With every strike, the future of the Overgeared Kingdom grew stronger.\n\n***\n\nSniping was designed for maximum efficiency—to deliver a crippling wound that ended the fight before retaliation was possible. Jishuka knew this better than anyone.\n\nYet she couldn't pull the trigger.\n\n\"...\"\n\nJishuka stared through her scope at the distant imperial army, bowstring drawn taut. Perfect wind conditions. Clear line of sight. Her hands wouldn't obey. Sweat dripped from her chin.\n\nHer previous failures had shattered her confidence.\n\n\"Can you do it?\" Toban's voice was gentle, careful.\n\nThe battle had raged for over an hour. Normally, Jishuka would have torn through the imperial ranks, appearing and vanishing like a phantom. Now she crouched motionless, unable to fire a single shot.\n\nToban had known her since their L.T.S days. He'd never seen her like this—paralyzed, doubting herself. Jishuka was supposed to be untouchable. Until Satisfy came along, he'd genuinely believed she was the strongest gamer alive.\n\n\"*Hah*...\" Jishuka exhaled slowly and drew her bow again. \"The moment I shoot, I'm dead.\"\n\n\"That's why I'm here. Trust me. I'm one of the best tanks in the world, aren't I?\"\n\n\"That's not the problem.\"\n\nJishuka's enhanced vision tracked a distant archer—someone far beyond the range of normal eyesight.\n\n\"Even if I hit something, it won't matter. I can't inflict meaningful damage, and we'll be exposed.\"\n\nThe imperial formation was flawless. Troops deployed in overlapping waves that could absorb or evade concentrated fire. Even with Noll carving through their lines like a scythe, the commanders maintained cohesion and minimized casualties. Worse, defensive spells intercepted ranged attacks beyond a certain distance. Unlike Faker and Kasim, who could infiltrate directly, Jishuka couldn't assassinate the enemy officers.\n\nAnd then there was the archer.\n\nEvery time Jishuka fired, a counterattack arrived with unerring precision. She'd died twice already to arrows that found her the instant she revealed her position.\n\nThe enemy was better than her.\n\nThis environment rendered her useless. The pressure eroded her mental fortitude. The Saharan Empire—the continent's undisputed superpower—had reduced Jishuka to nothing.\n\n\"...\"\n\nFor the first time in years, Jishuka felt helpless. Toban watched, terrified and uncertain.\n\n*Should I slap her? Snap her out of it?*\n\nNo. She'd probably kill him. But he didn't know what else to do. In nearly ten years together, he'd never seen her break like this.\n\n\"You're in rough shape.\"\n\nJishuka's shoulders tensed at the new voice.\n\n\"If you can't shoot, step aside and let me do it.\" Yura leaned against a nearby boulder, transforming Alex's Magic Engineering Bayonet into sniper mode. The same damn weapon that had eliminated Jishuka at the National Competition.\n\nJishuka's laugh was bitter. \"You think you can do what I can't?\"\n\n\"Of course not. But something's better than nothing.\"\n\n\"Don't be stupid. The moment you fire that thing, we're all exposed. I don't care if you die, but Toban's life matters. So does mine.\"\n\n\"Then get out of the sniper position if you're not going to use it.\"\n\n\"*Hah.* Fine. Do whatever you want.\" Jishuka didn't have the energy to argue. She turned to leave—\n\n*BANG!*\n\nYura fired.\n\nA jade-colored bullet screamed toward the enemy lines.\n\n\"You *crazy bitch*!\" Jishuka's Hawk Eyes—trained to master rank—tracked the shot instantly. Exactly as expected, Yura's bullet struck the commander's magical barrier and dissipated harmlessly.\n\nThen—\n\n*Shhhhhk!*\n\nAn arrow came. Faster than the bullet. The archer who'd killed Jishuka twice before.\n\n\"*Shit!*\" Jishuka's body moved on instinct. She raised her bow and loosed.\n\n*CRACK!*\n\nThe two arrows collided mid-flight and fell broken to the sand.\n\nJishuka whirled on Yura, panting. \"Are you *trying* to get us killed?! I'm the only reason you're still breathing!\"\n\nLegends were immortal in the technical sense, but those relentless arrows would have hunted Yura to the respawn point and back.\n\nYura grinned. \"You're better than him.\"\n\n\"*What?*\"\n\n\"You shot second and still intercepted his arrow. That means your skill is superior.\"\n\n\"That's not—\" Jishuka stopped mid-sentence. \n\nWait. \n\nYura was right. She *had* reacted faster, adjusted better, and matched an attack that had the initiative. There was no reason to be afraid. She'd fought through worse odds before. So why was she paralyzed now?\n\n\"...Hah.\"\n\nShe'd grown soft. After establishing the Overgeared Kingdom and becoming a duke, she'd spent her days in comfort, avoiding real challenges. The National Competition had dulled her edge—death there was consequence-free, a shallow imitation. She'd grown accustomed to failure that didn't matter.\n\nAnd now she was afraid of failure that *did.*\n\n\"I've turned into prey.\"\n\nJishuka was a hunter. A predator. She'd forgotten that.\n\n\"Toban.\"\n\n\"Yes!\" He straightened immediately, seeing the fire return to her eyes.\n\n\"You said you're one of the world's best tanks. You want me to trust you?\"\n\n\"...?\"\n\nJishuka smiled—sharp and feral—and swung onto her camel. She charged directly toward the imperial army.\n\n\"*What the hell?!*\" Toban shouted.\n\nReidan's camels were a specialized breed, capable of explosive speed across desert terrain. Within seconds, Jishuka had closed a third of the distance. Toban scrambled after her.\n\nJishuka laughed into the scorching wind. \"Can't shoot from a distance? Then I'll shoot from close range!\"\n\nStill mounted, she drew the Red Phoenix Bow. It blazed to life in her hands, flames hotter than the desert sun.\n\n\"*Enemies!*\"\n\n\"Just two?! Are they insane?!\"\n\n\"*Intercept!*\"\n\nThe imperial soldiers spotted the woman with the burning bow and the man with the massive shield. Toban blocked the incoming barrage of arrows and spells. \"*Ugh!* Can't—hold—\"\n\nHe couldn't advance further. He was at his limit.\n\nBut Jishuka had already launched herself past him. \"**Fly Up!**\"\n\nA massive phoenix materialized above the imperial formation. The soldiers didn't panic—days ago, they'd weathered a similar attack without casualties.\n\n\"That was from eight hundred meters.\" Jishuka's grin was savage.\n\nThe desert *erupted.*\n\nFire, force, and shrapnel obliterated the imperial ranks. The formation shattered. Dozens died instantly. The counterattack came swift and brutal—spears, arrows, and spells converged on Jishuka from every direction. Within seconds, she was critically wounded, blood streaming from a dozen injuries.\n\nBut she was grinning.\n\n\"Good. I saw what I needed.\" Yura appeared beside her, opening a hell gate. Demons poured forth, covering their retreat.\n\n\"You're still unlucky,\" Yura said.\n\n\"Women tell me that a lot.\"\n\n\"*What?* You think I'm jealous? Want me to add a few more holes?\"\n\n\"I'll pass.\"\n\n\"W-Wait for me!\" Toban charged desperately after the two bickering women."
}