{
  "id": 101,
  "title": "Chapter 101",
  "content": "# Chapter 101\n\nPedro was a nothing town in the south of the Eternal Kingdom.\n\nNo resources worth mentioning. No strategic value. The locals grew a single crop: strawberry-flavored bananas. Pink, unnatural things that tasted wrong. Travelers took one bite and spat them out. Merchants wouldn't touch them. The economy was dead.\n\nBut for the Giant Guild, Pedro was a goldmine.\n\nBeneath the castle, in a dungeon that reeked of old blood and stone, a <span class=\"rarity-rare\">vampire baron</span> spawned every eleven days. The creature dropped <span class=\"rarity-epic\">vampire accessories</span> and stat elixirs. Chris had claimed the lordship for that dungeon alone.\n\n\"Humans!\" The baron thrashed as three swords pierced his chest. \"I will rise again to repay this disgrace!\"\n\nChris grinned. \"Yeah. Don't forget.\"\n\n\"Kuaaaaak!\"\n\nThe vampire exploded into ash. Gold and items scattered across the stone floor. Chris crouched and sifted through the pile. Two elixirs. A necklace.\n\nHe drank both without asking.\n\n> [**Strength** has increased by +3.]  \n> [**Agility** has increased by +3.]\n\nThree elixirs equaled one level's worth of stats. At level 290, Chris needed two weeks of grinding to level up once. This was efficient.\n\nHe pocketed the necklace. \"With this, the <span class=\"rarity-epic\">vampire accessory set</span> is complete.\"\n\n\"Congratulations, Chris.\"\n\n\"You're even stronger now.\"\n\nThe raid team applauded. Chris studied their faces. Loyal. Disciplined. Good.\n\n\"The drop rate is solid,\" Chris said. \"The baron keeps spawning. You'll all get the set eventually. Stay patient.\"\n\n\"Yes, sir!\"\n\nA guild of 530 members required absolute hierarchy. Small guilds played at family. The Giant Guild was an army. Orders flowed down. Obedience flowed up. The system worked.\n\n***\n\nThe banquet hall was loud with drinking and celebration.\n\nChris sat at the head table, wine in hand. Buglima approached and whispered in his ear.\n\n\"Report from Winston. Our scouts found the unknown craftsman.\"\n\nChris straightened. \"Where?\"\n\n\"Already joined the Tzedakah Guild.\"\n\nThe wine glass stopped halfway to Chris's mouth.\n\n*Tzedakah.*\n\nThe name hit like a fist to the gut. Memories flooded back. L.T.S. The old game. The Tzedakah Guild had been seventeen players. Small. Elite. Untouchable. They'd dismantled every major guild that challenged them. The Giant Guild had been one of their victims.\n\nChris had fled to Satisfy the moment it launched. Smart move. Satisfy eclipsed L.T.S. in every way. But the shame remained.\n\n\"Those bastards.\" Chris set the glass down hard. \"They're crawling into Satisfy now.\"\n\n\"Should we—\"\n\n\"Send Asellas, Mihara, and Zirkan.\" Chris's voice went flat. \"Hit the Tzedakah Guild until they give up the craftsman.\"\n\nBuglima blinked. \"All three captains at once?\"\n\n\"That's 300 troops,\" another executive added. \"The Tzedakah Guild has less than twenty members.\"\n\n\"It's like using a sword to kill chickens,\" someone muttered.\n\nChris laughed. Cold and sharp.\n\n\"Chickens?\" He looked at the five executives who'd only known Satisfy. They didn't understand. \"You think the Tzedakah Guild are livestock? You poor bastards. They're dragons. Coiled up right now. But they can ascend at any moment.\"\n\nHe'd fought them over a hundred times. Lost most of those fights. He knew their strength. Knew their cunning. Reputation meant nothing. Current rankings meant nothing. The Tzedakah Guild would rise again.\n\n\"Send all three captains,\" Chris said. \"No mistakes. Step on those dragons before they grow wings.\"\n\n***\n\nFour days since Grid joined the Tzedakah Guild.\n\nIn that time, he'd upgraded weapons for half the members. Built a <span class=\"rarity-unique\">spear</span> for Pon. Earned respect.\n\nToday, the guild voted on his next project.\n\nIbellin. Sixteen years old. Third in his class rankings. Regas's potential rival. The boy needed a weapon.\n\nGrid stood at the anvil, examining the blueprint. A flamberge. Wave-bladed sword designed to shred flesh. Cruel weapon. Difficult to forge.\n\n*Let's start with the forging.*\n\nForging meant hammering metal into shape. Each strike hardened the metal. The more it hardened, the less it moved. A flamberge's wavy blade required constant shaping. If the metal hardened too much mid-process, the waves would lock wrong.\n\nTempering came next. Heat and cooling. But tempering changed the shape. The waves would distort. Forging and tempering had to happen simultaneously.\n\nMost blacksmiths quit halfway. They focused on the shape, skipped proper tempering. That's why most flamberges were Normal or Rare rated. Weak durability. Brittle blades. The Epic ones only dropped from boss monsters.\n\nGrid wanted Epic minimum.\n\n*I need to make money.*\n\nHe opened his status.\n\n> **Name:** Grid  \n> **Level:** 97 (140,090/5,531,200)  \n> **Class:** Pagma's Descendant  \n> * Probability of adding options when crafting increases.  \n> * Probability of successful enhancement increases.  \n> * Can equip all items unconditionally (penalties apply based on rating).  \n> \n> **Title:** One who Became a Legend  \n> * High resistance to abnormal status effects.  \n> * Cannot die when health reaches minimum (5-second immunity).  \n> * NPCs recognize achievements easily.  \n> \n> **Title:** First Unique Item Maker  \n> * **Dexterity** +200  \n> \n> **Title:** Only Legendary Item Maker  \n> * **Dexterity** +350  \n> \n> **Title:** Knight Slayer  \n> * **Stamina** +100  \n> * **Strength** +30  \n> \n> **Title:** Apostle of Justice  \n> * All stats +10  \n> * Generates 'Unbreakable Justice' skill  \n> \n> **Health:** 9,016/9,016 | **Mana:** 819/819  \n> **Strength:** 824 | **Stamina:** 572 | **Agility:** 257 | **Intelligence:** 279  \n> **Dexterity:** 904 | **Persistence:** 273  \n> **Composure:** 204 | **Indomitable:** 230 | **Dignity:** 204 | **Insight:** 204  \n> **Courage:** 148  \n> \n> **Stat Points:** 0  \n> **Weight:** 15,508/21,940\n\n*With titles, my dexterity approaches 1,500.*\n\nKhan's Advanced Blacksmith Mastery sat at level 2. Grid had lived with Khan for months. Watched him work. Khan's dexterity probably sat around 500 or 600. Maybe less. Khan was the best blacksmith in the north.\n\nGrid had triple that.\n\n*I can do this.*\n\nHe gripped the hammer. \"I'll make it with my own hands. A flamberge that's never existed before.\"\n\nHis confidence had no ceiling.\n\n***\n\nElsewhere, blood was being spilled.\n\nRegas tore through the wilderness like a storm. Fists broke bone. Kicks shattered ribs. He was hunting for the thief who'd stolen Grid's shield. Every beast in his path died screaming.\n\nThe Taekwon Master. Strongest in L.T.S. Still untouchable now.\n\nA figure stepped into his path.\n\n\"Hey, Regas.\" Mihara grinned wide. \"It's been a really long time.\"\n\nMihara. Fifth captain of the Giant Guild. Magic swordsman. Ranked 19th on the unified rankings. He claimed to be Regas's rival in the old days.\n\n\"I'm so happy to fight you again.\" Mihara's eyes shone. \"My head is spinning. Kukukuk!\"\n\nHe attacked immediately. Sword and magic. Three fire pillars erupted from the ground. His blade cut toward Regas's chest.\n\n*Peeng! Seokeok!*\n\nBlood sprayed. Regas barely dodged the flames. The sword caught his ribs.\n\n\"Kuahahahat!\" Mihara's laughter echoed across the desert. \"Regas! You're weak compared to L.T.S.! The guy once called the strongest looks so pathetic now!\"\n\nRegas wiped blood from his chest. Quiet. Calm.\n\n\"Who are you?\"\n\nMihara's chanting stopped mid-syllable.\n\n\"You don't remember me?\" His voice cracked. \"Damn bastard, you—\"\n\nRegas closed the distance. His fist connected with Mihara's jaw in a perfect uppercut.\n\n*Peeeeok!*\n\nMihara's vision tilted. Sky. Ground. Pain.\n\nHe hit the dirt hard.\n\nRegas bowed slightly. \"I don't know who you are. But thank you for being my opponent. I'll grow stronger after fighting you.\" He straightened. \"Now stand up. And concentrate.\"\n\nMihara's face twisted with rage.\n\n***\n\nDeeper in the desert, Jishuka led a raid team toward the basilisk's lair.\n\nThe wingless dragon. King of the sands. Its petrification magic was legendary. Everyone in the raid party had at least 60% petrification resistance.\n\nIce magic struck from above.\n\nTheir feet froze solid.\n\n*What user can cast this?*\n\nA woman stepped out from behind a dune. Short hair. Expressionless face.\n\n\"Only your feet?\" Asellas tilted her head. \"I specialize in petrification. But the timing was off. Fine. You won't leave here anyway.\"\n\nShe raised one hand.\n\nTwo hundred users crested the surrounding hills.\n\nToban's eyes went wide. \"What are you people?\"\n\n\"The Giant Guild.\" Asellas's voice was flat. \"Give up the unknown craftsman. You'll keep dying until you expel him from your guild. You won't be able to play the game properly.\"\n\n***\n\nA dungeon on Winston's outskirts.\n\nPon swung the <span class=\"rarity-unique\">Gale Spear</span> at a monster. Mid-swing, a sword flew at his head.\n\n*Kaaang!*\n\nHe blocked with the spear. The impact rattled his arms.\n\n*Kuk!*\n\nA man emerged from the darkness.\n\n\"Zirkan.\" Pon's jaw tightened.\n\nThey'd fought over a hundred times in L.T.S.\n\n\"It's been a long time, Pon.\"\n\nZirkan had been ranked 4th in the old game. Behind Regas, Jishuka, and Pon. Now? Eleventh on Satisfy's unified rankings. Higher than all three of them.\n\nHe pointed his sword at Pon. \"You'll have to play with me here for a while.\"\n\n*The fact he's here means the others are under attack too.*\n\nPon forced a grin. \"Are you still wasting time underneath that incompetent Chris?\"\n\nZirkan laughed. \"Master has grown beyond expectations. Don't you know? He's transcended the you from the past. It's worthwhile serving him.\"\n\n\"Che. This old man looks happy.\" Pon spun the spear. \"Okay. I'll knock you down first. Just like in the past.\"\n\n***\n\nKhan's smithy.\n\nIbellin watched Grid work.\n\nThe blacksmith stood before the furnace like a statue. Unmoving. Focused. The heat painted his face in orange light. His hammer rang against metal in steady rhythm. There was a force to him now. Something Ibellin had never seen before.\n\n*This is what Grid is really like.*\n\nIbellin backed toward the door. He didn't want to disturb the work.\n\nOutside, voices.\n\nA dozen users approached the smithy. Gold mace emblems on their chests.\n\n\"The Giant Guild?\"\n\nAn emergency message flashed in guild chat.\n\n> {The Giant Guild is intentionally attacking our guild. All free personnel give priority to protecting Grid.}\n\nIbellin pulled out his flamberge. He stepped in front of the smithy door. His lips curled into a smile.\n\n\"Isn't this quite interesting?\""
}