{
  "id": 1010,
  "title": "Chapter 1009",
  "content": "The Saharan Empire had pursued a single doctrine for a thousand years: an empire's strength lay in the strength of its people. Every conquest, every war, every exploited province—all of it fed back into a system of welfare and education designed to elevate the citizenry. Pride, self-development, martial prowess—these were the returns on imperial investment.\n\nRainhud was one such return.\n\nThe archer stood motionless on a dune's crest, bow in hand, reading the desert wind. His eyes—refined through years of imperial training—tracked disturbances in the air itself. The faintest shift in atmospheric pressure. The telltale ripple of mana condensation.\n\n*There.*\n\nA blue streak of magic carved across the sky, backlit against the sun. Rainhud's gaze dropped to the horizon, tracing the trajectory back to its source.\n\n*Found you.*\n\nThe woman—enemy archer, Overgeared Kingdom—sat exposed on camelback, reloading.\n\nHis bowstring sang.\n\nThe shot was perfect. Would have been perfect, if not for the sudden flash of light from Noll's bombardment overhead. The glare washed out Rainhud's vision for a critical half-second. His arrow flew weak and off-center.\n\nIt met another arrow in mid-air.\n\nJaffa-forged. He'd know that distinctive gleam anywhere. The same arrows he'd sent through that woman's heart twice before.\n\n\"*You.*\"\n\nRage flared in his chest—not just at the interception, but at the indignity of it. An archer's greatest shame wasn't missing. It was being hunted in turn. Excuses meant nothing. He had to answer.\n\nRainhud nocked another arrow just as the desert floor trembled. Noll's magic bombardment intensified, throwing off his stance. When he recovered, the scene before him defied reason.\n\nThe madwoman was *charging* him. On a camel. Across open ground.\n\n\"Has she lost her mind?\"\n\nHe drew, aimed—\n\nThen the phoenix rose behind her.\n\nHeat rolled across the sand like a physical wall. The soldiers around him faltered, sweat already streaming down their faces. But only for a moment.\n\n\"Ignore it! It's a bluff!\"\n\n\"The barrier stopped it before!\"\n\nThey'd seen this trick already. Days ago, that same phoenix had been deflected by the empire's magic barrier. But those had been long-range shots. This...\n\nThis was point-blank.\n\nThe barrier couldn't compensate at this distance.\n\nRainhud's blood went cold. He fired anyway—assassination attempt, kill the archer before the phoenix struck—but a black-skinned man appeared from nowhere, shield raised, absorbing the arrow meant for her throat. The bastard didn't even flinch.\n\n\"Damn it!\"\n\nThen the phoenix hit.\n\nFlames erupted through the formation like judgment itself. Men screamed. Grey death pillars spiraled skyward. Something hot and wet splashed across Rainhud's face—his own blood, he realized distantly—and half his vision went dark.\n\nHis left eye was gone.\n\n\"*KUAAAAAAGH!*\"\n\nThe scream tore from his throat, aimed like an arrow at the retreating rider. Pain. Fury. Humiliation. All of it crystallized into a single, burning truth:\n\n*I will kill you for this.*\n\n---\n\n**[★HIDDEN QUEST★ Expert Archer's Grudge has occurred!]**\n\n**[Expert Archer's Grudge]**\n**[★ Hidden Quest ★**\n**An expert archer has marked you for death. He has lost an eye to your flames and will dedicate the rest of his life to your assassination.**\n**Survive his revenge.**\n**Quest Conditions: Survive 10 future sniping attempts.**\n**Rewards: +Agility, +Sensing per survival.]**\n\n---\n\n\"Huh.\" Jishuka pulled her camel into a retreating gallop, Yura providing cover fire beside her. \"That's actually not bad.\"\n\nThe pain of her two prior deaths in this campaign—the frustration, the setbacks—suddenly felt manageable. A hidden quest. Growth opportunities. And most importantly...\n\nShe glanced around at her exhausted, bloodied guildmates.\n\nShe wasn't suffering alone.\n\n---\n\n***\n\nIn the grand hierarchy of *Satisfy's* class system, some professions stood in spotlights while others languished in obscurity. The Artilleryman class didn't even rate obscurity. It lived in a category all its own:\n\n*Garbage tier.*\n\nNo portable weapons. No bazookas, no rifle-cannons, nothing an individual could wield. Rumors spoke of dwarven cities and eastern kingdoms where such things existed, but those were just rumors. In practice, artillerymen required fixed cannon emplacements—massive, crew-operated weapons that needed at least three players to function. And most shells? Monopolized by empires and kingdoms.\n\nWhich meant artillerymen couldn't hunt. Couldn't quest. Couldn't progress.\n\nThe only advancement path was military enlistment.\n\n\"This garbage class is useless even during a war.\"\n\nLost Justice sat on the empire's outskirts, staring at distant mountains, pulling at her hair. First place on the Artilleryman rankings—a title worth precisely nothing. Out of two billion players, only ten thousand had chosen this cursed profession. She was level 180. *Average.* That was her achievement after years of daily garrison quests.\n\nHer Firearms Mastery? Beginner Master stage.\n\n*Beginner.* Compared to the NPC artillery officers, she was an infant.\n\nOne month into the Overgeared War, and she hadn't fired a single shot. The empire had no use for her. She'd thought war would be her opportunity. Her breakthrough. Instead, she sat here, idle and irrelevant, contemplating the same question for the thousandth time:\n\n*Should I just reroll?*\n\nPride was the only thing stopping her. Pride and sunk cost. She'd chosen Artilleryman because it seemed *safe*—kill from range, stay out of danger. How naive she'd been.\n\n**[Friend request from 'Lauel' has arrived.]**\n\nLost Justice blinked at the notification, certain she'd hallucinated it.\n\nA friend request. Someone wanted to add *her*? In two years of playing this class, that had never happened. Not once.\n\n\"W-wait...\" She fumbled through the accept screen. \"Holy shit, someone's actually—\"\n\n**[Player 'Lauel' is now your friend.]**\n\n-*Hey. Lost Justice, right? This is Lauel from Overgeared.*\n\n-*Oh! Uh, yes! H-hi! Haha.*\n\nShe was *whispering* someone. Actually using the system. It felt surreal—different from a phone call, more immediate, like the words appeared directly in her thoughts.\n\nWait.\n\n-*...Did you say Overgeared?*\n\nThose people were *celebrities.* She'd watched Grid's broadcasts, seen the kingdom's founding, followed the war coverage like everyone else. They existed on a different plane of reality. And now one of them—Grid's right-hand man—was messaging *her?*\n\n\"This has to be a scam.\"\n\nShe pulled up her friends list with trembling hands.\n\n**[Lauel]**\n**[Level: 335**\n**Guild: Overgeared Guild**\n**Kingdom: Overgeared Kingdom]**\n\n\"Three hundred and thirty-five...\"\n\nHigh rankers averaged level 370 these days. Lauel was lower, likely from administrative work. But from where *she* stood, that number belonged to a different species.\n\n-*Y-you're real!*\n\n-*Haha, were you expecting an impersonator? I suppose I'm a decent target for that sort of thing. Anyway—*\n\n-*...Right. What do you want?*\n\nShe caught herself, reined in the fangirlism. This guy had a reputation for arrogance. Better to keep it professional.\n\nLauel seemed briefly confused by her sudden coolness, but pressed on.\n\n-*We're recruiting artillerymen for Overgeared.*\n\n-*Oh, that's nice. Wait. WHAT?*\n\n-*You heard me. We need artillerymen.*\n\n-*But... you're the top guild in the world. Artillerymen are garbage.*\n\n-*Garbage? No. We need you. Specifically.*\n\n-*This is a scam.*\n\n-*It's not.*\n\n-*...*\n\nHe was right—scamming her would be pointless. What would he even gain? Before she could spiral further, his voice continued:\n\n-*There's a ruined village on the empire's outskirts, where the Ul Clan used to live. Send a whisper when you arrive. Someone will meet you there.*\n\n---\n\n***\n\nBack in Reidan, Lauel massaged his temples.\n\nThe Overgeared Cannon was brilliant. Grid's craftsmanship had solved the supply problem. But there was one detail his king had overlooked:\n\n*You needed people to fire the damn things.*\n\nThe Overgeared Kingdom's army had focused on mass-producing Grid Sets, neglecting artillery training. Shell consumption alone made practice prohibitively expensive. As a result, they had exactly one hundred trained artillerymen.\n\nOne hundred soldiers could operate thirty-three cannons.\n\nMeanwhile, Grid and the craftsmen could produce *hundreds* of Overgeared Cannons.\n\n'We need more personnel.'\n\nThat's when Lauel thought of the players.\n\nHe switched the rankings interface to class-specific lists, navigated to *Artilleryman,* and examined the top one hundred.\n\nThen stared.\n\n*First place is level 180?*\n\nThe hundredth-ranked player was level 113.\n\n'Did time... stop for these people?'\n\nIt was absurd. He sent friend requests to all one hundred, from Lost Justice at the top to the scraping-bottom 100th. Every single one accepted. Instantly. And when he whispered them?\n\n*Immediate response. Every time.*\n\nThey were *starving* for attention.\n\n\"This...\"\n\nLauel had prepared elaborate recruitment pitches. Generous contracts. Competitive offers. He'd assumed he'd be negotiating from a weak position.\n\nInstead, he just said, \"Want to join Overgeared?\"\n\nAll one hundred said yes.\n\n'Time to formalize Overgeared Four.'\n\nThe artillery division. Now the question was leadership. Who could command a hundred glass cannons? The role required battlefield awareness, defensive positioning, aggro management, wind reading...\n\nLauel ran through the roster mentally.\n\nStrong personalities. High self-esteem. Talented, yes, but also stubborn and individualistic.\n\n\"There's no one.\"\n\nNone of his current guild members fit. Which meant...\n\n\"Toban it is.\"\n\nThe man had been Tzedakah's chief of staff before joining Overgeared. He understood battlefield dynamics. He could protect vulnerable units. Not perfect, but adequate until someone better emerged.\n\n'I need to know my people better.'\n\nOvergeared One. Overgeared Two. Overgeared Shadows. Three guilds, 913 members total. Lauel could recite their names and basic capabilities from memory, but beyond that? He didn't know them. Their backgrounds, personalities, motivations—all gaps in his intelligence.\n\nGrid was worse. The man barely remembered faces.\n\n'If external pressure is increasing, we need to strengthen internal cohesion.'\n\nDecision made, Lauel headed for the smithy. Inside, Grid and his craftsmen were assembling something massive—taller than a man, complex mechanisms gleaming.\n\n\"You're recruiting the artillerymen?\" Grid spoke without looking up, hammer in hand. \"Good work.\"\n\n'How does he always know when I arrive?' Lauel wondered, not for the first time.\n\n\"Kukuku, as expected of the man I—\" Lauel began dramatically, covering half his face.\n\nGrid ignored him completely, continuing his hammering.\n\n\"*Ahem.*\" Lauel cleared his throat, abandoning the bit. \"We should establish Overgeared Four officially.\"\n\n\"For the artillery division?\"\n\n\"Yes.\"\n\n\"Fine. Do it.\"\n\n\"One more thing.\" Lauel's grin turned sharp. \"Let's hold an event to celebrate.\"\n\nGrid's hammer paused mid-swing. \"...An event? We're in the middle of a war.\"\n\n\"Exactly.\" Lauel's smile widened. \"We'll gather all Overgeared members in Reidan. Set off fireworks. Throw a festival.\"\n\n\"To project confidence to the empire?\"\n\n\"Simple psychological warfare. When the imperial soldiers see us *celebrating* during wartime, their morale will crack. We look untouchable.\"\n\n\"Mm. Alright, do it.\"\n\nGrid returned to his work, already planning a simple toast and dismissal.\n\nThen Lauel said something that shattered that comfortable assumption entirely."
}