{
  "id": 1011,
  "title": "Chapter 1010",
  "content": "---\n\n\"Your Majesty, I'd like you to speak with each guild member personally.\"\n\nGrid blinked. \"I'm sorry, what?\"\n\nWas Lauel serious? The Overgeared Guild had swelled past nine hundred members. With the new artillerymen recruits, they'd broken a thousand. Did Lauel honestly expect him to meet with *all* of them? The mental exhaustion alone would take days.\n\n\"Isn't this a massive waste of time?\" Grid asked carefully.\n\n\"I'd also like you to promise each member a piece of equipment tailored to their needs.\"\n\n\"You want me to craft personalized items for people I've never even met?\"\n\n\"Exactly.\" Lauel's expression remained neutral. \"Because you *don't* know them, Your Majesty.\"\n\n\"...I—well, originally...\" Grid trailed off, catching Lauel's meaning. After a pause, he found his defense. \"Look, you're the one managing the guild. That's why I agreed to expand in the first place.\"\n\nGrid wouldn't have approved the recruitment drive if he'd known he'd have to personally oversee everyone. Now Lauel was calling out his negligence.\n\n\"I need to focus on leveling and crafting. How am I supposed to manage a guild on top of that?\"\n\nIt wasn't an excuse—Grid genuinely had no time. He was stretched impossibly thin already.\n\n\"I'm not like you. I can't multitask. I can only focus on one thing at a time...\" \n\nThe irritation drained from Grid's voice. He stopped mid-sentence.\n\nWork? \n\nSince when had greeting his comrades become *work*? A chill ran through him. He saw himself clearly now—how thoroughly he'd neglected the new Overgeared members.\n\n*I'm treating basic courtesy like it's forced labor.*\n\nAnd yet he expected these same people to bleed for the Overgeared Kingdom. He called them his brothers-in-arms, then pawned them off with cheap gear he'd barely put effort into.\n\nHeat crept up Grid's neck and face. Shame burned in his chest.\n\nLauel waved his hands frantically. \"Your Majesty, please don't take this so seriously. These are difficult times—I only thought this might help the members feel more connected to each other and to you. I wasn't trying to condemn—\"\n\n\"No. You should condemn me.\"\n\nOver the past years, countless players had knocked on the Overgeared Guild's door. Some came seeking power, others with darker motives. Lauel had spent untold hours and resources vetting every single applicant, carefully building the roster that now stood before them. And Grid? He'd accepted the fruits of Lauel's blood, sweat, and tears as though they were his birthright. He'd never once acknowledged the effort required to win over these colleagues.\n\n\"People don't change easily, do they?\"\n\nStill selfish after all this time. Grid smiled bitterly.\n\n\"Y-Your Majesty...\"\n\nGrid stared at the floor while Lauel shifted uncomfortably. The strategist clearly regretted burdening the kingdom's busiest man.\n\nAfter a long silence, Grid lifted his head. \"Alright. Let's meet everyone.\"\n\nHis gaze had steadied, the uncertainty replaced by resolve. Until the artillery corps was fully established, he would memorize the face of every comrade who'd chosen to believe in him and follow his banner. Even if it meant pulling several all-nighters.\n\nKing. Warrior. Blacksmith. Tailor. And above all—Guild Master.\n\nHe didn't have enough hours in the day for all these roles, but that didn't matter. He'd make it work through sheer tenacity.\n\n***\n\nThe imperial army had no respite.\n\nVampires and assassins struck at night. During the day, giant worms erupted from beneath the sand while Overgeared's elite picked them apart. The march had slowed to a crawl. Exhaustion hung over the camp like a shroud. The desert terrain crippled the horses, and the brutal temperature sapped everyone's strength. The vaunted imperial cavalry had lost both mobility and striking power.\n\n\"Morale is abysmal,\" reported one commander. \"Last night alone, three hundred fifty-nine soldiers attempted to desert.\"\n\n\"The enemy can't be faring much better,\" countered another. \"We've killed plenty of them in every raid.\"\n\n\"True. We might be taking similar losses, but we vastly outnumber them. The psychological pressure on the Overgeared Kingdom must be enormous. If we had three hundred fifty-nine deserters, they've probably lost over a thousand.\"\n\n\"That's optimistic thinking.\" A third voice cut through the false hope. \"They have fortified walls and overflowing granaries. We're sleeping in threadbare tents with barely enough water to drink.\"\n\nThe original plan called for a two-day desert crossing. Even at reduced speed, Reidan wasn't that far—it should've been achievable. But reality had crushed that assumption. Constant harassment had stretched the journey past four days, and the end wasn't in sight. At this rate, they'd die of thirst long before reaching enemy walls.\n\nEvery oasis they'd encountered was poisoned. The imperial supply lines were responsible for providing drinking water to hundreds of thousands of troops, but how could a slow-moving convoy cross this hell safely? Would the Overgeared Kingdom simply allow it to reach them unmolested?\n\nSilence settled over the command tent like dust. Even the optimists had run out of silver linings.\n\nFinally, a young noble voiced what everyone was thinking. \"Perhaps we should withdraw and regroup.\"\n\nNo one objected. No one rebuked him.\n\nEmboldened, the noble continued, \"These hundreds of thousands are relatively inexperienced. They're not accustomed to desert warfare and can't fight at full capacity. But the veteran legions—the armies that have fought in every major campaign over the past decades—they'd be different. The Seven Dukes' forces would cross this desert like it was their own backyard.\"\n\n\"You're suggesting we pull back and wait for elite reinforcements?\"\n\n\"Yes.\"\n\n\"...\"\n\nThe force that had gathered at Reidan's border numbered two hundred eighty thousand. Now, reduced to two hundred thirty thousand after days of attrition, their mission to conquer the Overgeared Kingdom felt increasingly hollow. Originally, they were meant to be a distraction—pin down the enemy while Sky King Rigal's air force struck at the kingdom's heart.\n\nThen word came that Rigal and the entire air force had been annihilated.\n\nThey'd pushed forward anyway, driven by ambition and the desire for glory. Greed had cost them fifty thousand men already. Caution was long overdue.\n\nCommander Marquis Fulbas stared at the officers surrounding him, seeing the retreat reflected in their eyes. His stomach churned.\n\nWhen had the empire grown so weak? For hundreds of years, they'd dominated the continent without peer. Now they cowered like hunters who'd forgotten how to kill.\n\n\"The empire has no use for cowards.\"\n\n\"...?!\"\n\nThe scent of wine flooded the tent. Blood sprayed across canvas walls. Three heads—belonging to the nobles who'd advocated withdrawal—bounced across the ground.\n\n\"S-Sir Diworth!\" Marquis Fulbas shot to his feet. The assembled nobles and knights rose with him, shock written across their faces.\n\nThe drunk who'd just committed triple murder was unmistakable: oil-slick hair, disheveled clothing, and a face flushed crimson. He took another pull from his wine bottle.\n\nDrunk Duke Diworth. One of the empire's Seven Dukes.\n\n\"W-We greet My Lord!\" Every head in the tent bowed. Not one voice rose in protest against the killings. Who would dare challenge someone so far above their station? Even Marquis Fulbas held his tongue.\n\nDiworth's grim smile widened as he observed the marquis' barely contained anger. \"Are you upset that I killed those wretches?\"\n\n\"They were imperial nobles. They held lands, commanded soldiers, ruled over people...\" Marquis Fulbas fought to keep his voice steady. \"Even you, Duke Diworth, will face consequences for this.\"\n\n\"Oh? I think their territories will celebrate the death of such incompetent lords. Wouldn't you agree?\"\n\nDiworth's gaze swept the tent. Every noble and knight nodded frantically. His reputation for brutality made even his fellow Dukes reluctant to deal with him. Lesser nobles didn't dare meet his eyes.\n\nHe strode to the head of the table, snatched the command baton from Fulbas, and raised it high. \"They dared question the will of the empire's Dukes! Death is too good for traitors who speak of retreat! They should be ground into dog food!\"\n\nOverwhelming magical power poured from his body, thick with the scent of alcohol. The intoxicating energy washed over everyone present. Nobles and knights swayed on their feet, succumbing to instant drunkenness. Only five remained standing—Marquis Fulbas and four earls managed to expel the alcohol through force of will.\n\nDelight flickered across Diworth's features.\n\n\"T-The enemy!\" A knight burst into the tent, gasping. \"The enemy commander Chris is approaching!\"\n\n\"One man? Just one?\" Diworth's eyes had cleared—he'd burned away his own drunkenness.\n\nThe knight paled upon recognizing the Duke, but nodded rapidly. \"Y-Yes! But the sun is setting!\"\n\n\"What about it?\"\n\nDiworth cocked his head in confusion. Then the answer came without words.\n\nThe ground convulsed. The tent swayed violently. Soldiers screamed in terror. The air itself grew heavy with malevolent power and the copper tang of blood.\n\n\"Vampire!\" Diworth burst from the command tent.\n\nHovering in the darkening sky, a beautiful boy laughed around his fangs. \"Hahahaha! Dinner time!\"\n\nCrimson energy blanketed the desert—magic with the intrinsic nature of *exploitation*.\n\n\"UWAAAACK!\" The imperial soldiers, still clustered too tightly together, shrieked as blood was torn from their bodies and drawn skyward. Three hundred fifty-nine men collapsed as withered husks in seconds.\n\nVampire Earl Noll clutched his distended stomach, cackling with glee. \"Kuhahaha!\"\n\nPure ecstasy. A feast beyond imagination. But all good things must end.\n\n\"Oof!\" Noll's laughter died. He grabbed his belly as his snow-white face flushed red. His trembling gaze found the source of his distress—a man standing casually below, holding a flask.\n\nDrunk Duke Diworth grinned up at him. \"What's wrong? Can't hold your liquor? Too young to drink, little boy?\"\n\nDiworth *launched*.\n\nHis speed defied perception. To the watching soldiers, it looked like lightning struck the vampire from below. They blinked, and suddenly the monster was cratering into the sand. Divine retribution, they thought.\n\nDiworth's iron grip crushed Noll's throat, lifting the boy by the neck. Noll's legs kicked uselessly as transcendent strength squeezed the life from him. The Duke smashed his flask across the vampire's face. Glass shards opened cuts, and the heavy fragrance of alcohol made Noll's head spin even more.\n\n\"I'm glad that bastard didn't lie about this stuff.\" Diworth pulled out a fresh bottle and drained it in one go. His flush deepened. \"Roots of the sacred tree—worth every coin.\"\n\n\"Let him GO!\"\n\nChris had been harassing the enemy flanks, drawing attention away from Noll's attack. He'd planned to retreat, but now he drove deeper into imperial territory. Seeing Noll's capture, Chris spurred his camel toward the army's heart.\n\n\"1,000 Ton Sword!\"\n\nHe leaped from his mount mid-charge. The ultimate technique of the Tyrant class descended on Diworth's head with the force to split mountains.\n\nIt should've crushed the Duke's skull.\n\nInstead, Diworth leaned aside lazily, and the massive blade cleaved empty air. His counter-kick came from an impossible angle, smashing into Chris' face with bone-breaking force. Chris tumbled off his camel and hit the sand hard.\n\n\"Kueek...! Gah!\" \n\nFor a moment, Chris thought he'd actually die. Diworth's casual strike had nearly killed him outright. Terror flooded through him. What the hell had he been thinking, charging alone into the center of an army? Was he suicidal?\n\nThen he saw Noll dangling from Diworth's hand like a broken doll.\n\n*Noll!*\n\nRegret evaporated. Chris didn't care if he died—not if he could save Noll first.\n\nHe staggered to his feet and drew on his second class, feeling the Tyrant's power surge through his battered body. He finally registered the golden nameplate hovering above his opponent—*Drunk Duke Diworth*—but raised his greatsword anyway without hesitation.\n\nDiworth laughed. \"You got up from that? Tough bastard.\"\n\nChris laughed back. \"I would've stayed down if *Grid* hit me. You're weak.\"\n\n\"Grid...?\"\n\n\"The Overgeared King.\"\n\n\"...The *Overgeared King*.\"\n\nDiworth's expression twisted into something terrible. He had zero intention of letting this lunatic live after being compared to some upstart monarch of a backwater kingdom.\n\nMore importantly—\n\n\"You dare mock my master?\"\n\nThe voice came from the shadow at Diworth's feet. In an instant, hundreds of thousands of shadows scattered across the battlefield like spilled ink.\n\n\"I fight for my new homeland! And I'll repay the grudges of my old one with your blood!\"\n\nShadow spears and shadow blades erupted from the ground, carving through the entire imperial army."
}