{
  "id": 1012,
  "title": "Chapter 1011",
  "content": "The more powerful a skill, the greater its potential—and the steeper the learning curve. A player's competence determined how much of that potential they could actually extract. But some skills transcended the issue of competence entirely.\n\nSuper Sensitivity was the quintessential example. It predicted incoming threats and enemy behavior patterns: when you'd become a target, when to strike, when you'd encounter an opponent, where to move. The skill operated continuously under all conditions, feeding information directly through system assistance—notification windows and voice alerts flooding the user's awareness in real time. Even geniuses struggled to process that torrent of data without losing their minds.\n\nSo the system imposed restrictions. A great swordsman's Super Sensitivity lasted mere seconds. Kraugel's version had most functions locked, gradually unlocking as his stats increased to give him time to adapt.\n\nThe Shadow Technique from Lantier's Methods worked similarly. This legendary skill that allowed partial control over shadows and shadow weapons eased the burden by limiting how many a player could command. Faker had studied under Kasim, and even at level three, he could only raise six.\n\nBut Kasim was different. Just as Mercedes wielded Keen Insight—the evolved form of Super Sensitivity—Kasim controlled shadows with absolute mastery. That was the privilege of a named NPC with the 'King of Shadows' designation.\n\nHundreds of thousands of shadow troops materialized across the battlefield. They erupted from the soldiers' own shadows or materialized at their backs, daggers finding necks and spines. The Shadow Technique's fundamental limitation still applied—power diluted across vast numbers—so few wounds proved fatal.\n\nStill, the effect was devastating.\n\n\"Uh... *Uwahh!*\" The imperial army's morale shattered completely. The sudden appearance of hundreds of thousands of troops struck with the force of a natural disaster.\n\nYet one man remained utterly calm.\n\nDuke Diworth stood at the center of the spontaneously cleared space, amused rather than alarmed. His eyes tracked Kasim's form hiding in the darkness with perfect precision.\n\n\"So. A black cat survivor.\"\n\nDiworth released Noll, letting the magician crumple to the ground. Blood spilled from Noll's lips as he coughed—the unidentified alcohol Diworth had forced into him was still wreaking havoc on his magic circuits and organs.\n\n*Tong!* Diworth kicked Noll toward the knights and shook his head with something resembling regret.\n\n\"There were no duty officers at headquarters that day, so it fell to me. I used my brain—unfortunately, I was too *excited* and made a mistake. You'll die by my hands, which means you'll never get your revenge on the empire—\"\n\n\"*Take those words back.*\"\n\nKasim dropped his stealth, eyes blazing with killing intent.\n\nDiworth scratched his head. \"What words?\"\n\n\"*Don't call me black cat!*\"\n\n'Black cat' was the empire's name for the Nero people. Dark-skinned and clandestine in their movements, they'd earned the nickname without any deliberate malice. Why would the empire bother to demean insects?\n\n\"We are *Nero!* We're human beings, not beasts! *Humans!*\"\n\nThe empire had trampled the Nero, slaughtering them without regard for age or innocence. Only Kasim had survived.\n\nHis roar echoed across the battlefield. Every shadow soldier surged toward Diworth in a black tide.\n\nDiworth waved one hand dismissively. \"Trivial.\"\n\nThe magic shield obliterated the shadow weapons. Scattered darkness reformed at its source.\n\n\"To deal with a duke of the Saharan Empire, you dispersed your power this far?\" Diworth didn't know Kasim personally, but he knew *of* the King of Shadows. The empire's intelligence network spanned the continent—they were well aware that the King of Shadows was Lantier's disciple and commanded shadow troops. \"The more you disperse your shadows, the weaker they become. If you truly wanted to kill a duke and claim your revenge, you should have concentrated everything at a single point and aimed for my heart. Like this.\"\n\nMagic condensed at Diworth's fingertip and fired.\n\nGoosebumps rippled across Noll's skin where the knights held him. *\"A human has such power...!\"*\n\nThe desert *split*.\n\nA lance of pure magic pierced Kasim's heart and continued beyond the horizon without slowing. No one could say where it finally dissipated. There wasn't even a sound.\n\nKasim collapsed to his knees like a puppet with cut strings.\n\n\"*Kasim!!*\" Chris, who had felt hope kindle at Kasim's arrival, screamed in despair. He belatedly understood how badly things had gone wrong. Activating his Tyrant's power, Chris prayed that Kasim was somehow alive, that Noll could escape while he drew Diworth's attention—\n\nA hand shot out from between the soldiers and stopped him.\n\n\"Teacher didn't die.\"\n\nKasim lived on rage alone. Years of protecting a child while nursing thoughts of revenge had taught him iron discipline. The fury he'd displayed creating the shadow army was *theater*—a sacrifice to announce that a Nero had survived and draw Diworth's complete focus without revealing the deception.\n\nAll for one purpose.\n\n\"...?\"\n\nTo rescue Noll.\n\nKnights fell to flashing blades as Kasim materialized among them and seized the magician.\n\n\"*Catch him!*\"\n\nThe great knights counterattacked. Magicians joined the assault. But Kasim was the ultimate assassin—ordinary knights and magicians couldn't stop him. Faster than anyone, the Nero survivor vanished into shadow with Noll in his arms. The Shadow Technique combined with his racial traits made his concealment far superior to normal shadow skills.\n\n\"He vanished?\"\n\nKasim appeared and disappeared like a ghost. Even Duke Diworth, one of the Seven Dukes, struggled to track him through the shadows.\n\n\"I was deceived.\" Diworth's intoxication faded along with his expended magic power. Sober and bored, he handed matters to Marquis Fulbas. \"Capture whoever you can.\"\n\nThe marquis needed no encouragement. His gaze locked onto Chris. *There* was a valuable prize.\n\n\"Commander Chris of Reidan—you'll make an excellent hostage.\"\n\nMarquis Fulbas raised his blade, four earls flanking him. Each outclassed Chris individually. They led hundreds of thousands of troops. There was no path through.\n\n*I can't become a hostage.*\n\nIf captured, he'd be an anchor around his comrades' necks. The time wasted would be catastrophic. Better to die cleanly. Kasim and Noll had escaped safely—he had no regrets.\n\nChris made his decision. He released his armor, intending to die to the next volley of attacks before they could take him alive. His death would devastate morale, but it was preferable to capture.\n\nThen the wind rose.\n\nA gale split the imperial soldiers like Moses parting the Red Sea, erecting a barrier between Chris and the marquis's forces. Chris knew only one magician capable of such complete wind control.\n\n\"*Zednos!*\"\n\nAn early Overgeared member. Former Tzedakah Guild veteran. The first-ranked wind magician. Zednos's whisper arrived instantly.\n\n*—I can only hold this for three seconds! Use the gap to run!*\n\nMiracles didn't come easily. Zednos had drained his entire mana pool to temporarily bind a fraction of the enemy forces. Already an earl was gathering aura along his blade. The wind barriers were crumbling.\n\n*—Understood!*\n\nHis comrade had risked everything to help. Chris couldn't waste that by dying passively. He summoned his armor again and charged through the arrow storm. His allies were everywhere—Jishuka and Yura providing covering fire with arrows and bullets, Pon and Regas and Peak Sword tearing into enemy ranks, Vantner and Toban using wide-area taunts to draw aggro. Zirkan, Laella, and the others fought desperately to clear his escape route.\n\n\"Chris! This way!\"\n\n\"*Run!*\"\n\n\"I'm such a fool.\" Chris laughed as he cut down enemies with wide sweeps of his greatsword. The Overgeared members had positioned themselves in scattered points throughout the desert, those specializing in guerrilla warfare and endurance now flooding the battlefield. They were trying to save him just as he'd tried to save Noll. None of them considered their lives worthless—they simply valued their comrades' lives above their own.\n\nAll because of Grid. Everything they'd learned from watching Grid.\n\nMagic slammed into Chris's back as he ran. The imperial army didn't miss the opening. Spells poured down, his health plummeting. Only the marquis's order to take him alive had kept him breathing this long. Chris felt the earls closing in and roared with everything he had left: \"*Give up on me and escape together!*\"\n\n\"No.\"\n\n\"...?\"\n\nChris's shadow stirred. It *spoke*.\n\n\"The commander shouldn't die.\"\n\nThe shadow elongated. Black hair rippled in an unfelt wind.\n\n\"*Faker!*\"\n\nOne of the earls reaching for Chris collapsed. Faker erupted from the darkness, dagger buried in the man's side—a devastating technique married to impossible speed. The move reminded Chris of the living Doran, though only Grid would recognize the parallel.\n\n\"*Not a chance!*\" The fallen earl surged back up. All four converged on Faker simultaneously. He dodged one blade by accepting another to his shoulder, simultaneously driving his dagger into an enemy's gut. His body was torn open. Chris had never seen Faker bleed before. Faker was *strong*—strong enough that even Chris looked up to him.\n\n\"*F-Faker!*\"\n\n\"Go.\"\n\nFaker didn't look back. He summoned six shadow soldiers to shield Chris. Maintaining control dispersed Faker's mental energy, weakening his own body—but he didn't hesitate. He was the shadow that protected the Overgeared Kingdom. It was his duty to serve and sacrifice from the darkness, unknown and unsung. His death wouldn't affect the war.\n\n\"Eclipse.\" Faker merged completely with the darkness, though controlling six shadow soldiers divided his focus. The earls tracked him regardless. Faker continued hampering their pursuit as their blades carved into his flesh.\n\n\"Next time... *Next time I'll protect you!*\" The shadow soldiers escorted Chris through the encirclement. Overgeared members rallied around him and pulled him free.\n\nBut Marquis Fulbas pursued relentlessly. \"This isn't a bad situation.\"\n\nA chance to strike down the enemy commander. The marquis welcomed the opportunity, gathering power for his ultimate technique—\n\nKasim materialized from shadow with Noll at his side, blocking the marquis's path. \"*Back off!*\"\n\nMarquis Fulbas noted that Noll had purged most of the alcohol and quietly lowered his blade. He abandoned the chase as the Overgeared forces withdrew in good order.\n\nHis thoughts turned bitter toward Diworth.\n\n*If Sir Diworth had fought seriously, we could have annihilated them.*\n\nDiworth was lethargic when sober, showing passion for nothing. He had no grounds to condemn young nobles for cowardice. The grim truth was that most of the Seven Dukes shared his apathy. The empire that had flourished for so long was rotting from the top.\n\nMarquis Fulbas sighed and addressed the army: \"Take sufficient rest.\"\n\n\"*Wahhhh!*\" An order for several days of respite. The soldiers cheered—the marquis had judged correctly that the Overgeared forces and Noll wouldn't attack again today.\n\nAt dawn, a powerful surge of magic crested over Reidan Castle.\n\n\"Mass Teleport?\" Marquis Fulbas rushed from his tent, seized by sudden apprehension.\n\nEarl Baget approached. \"Reinforcements have arrived, it seems.\"\n\nThe earl had been seriously wounded by the Overgeared Kingdom's young assassin during the battle.\n\n\"I was concerned. I'm glad to see you recovering well.\"\n\n\"Thank you for your concern.\"\n\nThe earl reeked of sweat—he must have been feverish on the battlefield."
}