{
  "id": 1013,
  "title": "Chapter 1012",
  "content": "Grid stopped dead when he crested the rise overlooking Reidan. His eyes locked onto the massive breach in the city's western wall—a wound thirty meters deep punched clean through reinforced stone that had consumed a fortune from the kingdom's treasury. Beyond the gap, nearly five hundred meters of residential district lay in ruins, homes reduced to smoking rubble.\n\n\"Which siege weapon did that?\" Grid's voice came out tight. \"Not even our Overgeared Cannons could—\"\n\n\"It wasn't a weapon.\" Chris stood beside him, and the sweat beading his brow sent a cold spike of dread through Grid's gut. \"Drunk Duke Diworth. He fired a spell from the imperial camp.\"\n\n\"A duke is already here?!\"\n\n\"No. The camp is eleven kilometers away.\"\n\nThe words didn't register at first. Grid stared at the hole again, tracing the angle back across the desert. Eleven kilometers. From that distance, to punch through maximum-level fortifications with such surgical precision...\n\n\"His magic negates distance entirely,\" Chris said, and the tremor in his voice—Chris, who never showed fear—told Grid everything he needed to know about what they were facing.\n\n'I couldn't beat Rigal alone, and he was supposedly the weakest.' Grid's jaw tightened. The other dukes would be exponentially worse.\n\nBefore he could voice the thought, three middle-aged men rushed past him toward the damaged wall, tools clutched in weathered hands. The crowd barely spared them a glance—just more technical workers from Overgeared Two.\n\n\"Hold on.\" Grid raised his voice. \"Fifteenth-ranked builder Delleon, twenty-ninth-ranked Shell, and forty-second-ranked Delont.\"\n\nThe three men froze mid-stride.\n\n\"You're all older than me. Drop the formalities—we're colleagues, not employer and employees.\" Grid offered a slight smile. \"And Delont, I heard your granddaughter just started elementary school. Congratulations.\"\n\nThe silence that fell over the gathering was absolute.\n\nGrid had over a thousand guild members now. Most guild masters struggled to remember even their core officers' names. Yet here he stood, reciting not just occupations and rankings, but personal details—ages, families, lives beyond the game.\n\nHeat crept up Grid's neck as the stares intensified. \"I, uh... probably shouldn't have brought up private matters in front of everyone...\"\n\nHe'd overdone it. Studied too hard, tried too hard to show off what he'd learned. Classic Grid—awkward, overcompensating, unable to read the room properly.\n\nThen Delont seized his hand with surprising strength.\n\n\"Thank you!\" The sixty-year-old man's eyes shone with the kind of pure joy Grid hadn't expected. \"My granddaughter will be over the moon when I tell her about this. She adores King Grid!\"\n\nThe tension shattered. Around them, voices rose in renewed energy.\n\n\"The busiest man in two continents, and he's memorized a thousand guild members...\"\n\n\"God Grid! Come join the Korean Patriotic Association! I'll give you a fifty-percent discount!\"\n\nGrid's chest constricted with guilt. Without Lauel drilling the information into him, he'd still be treating these people like chess pieces. He'd only studied out of necessity, yet they were looking at him like he'd done something noble.\n\nA whisper notification chimed in his ear. *If your heart wasn't genuine, you couldn't have memorized a thousand faces this quickly. Unless you were a genius like me, of course. Huhuhu.*\n\nGrid didn't reply.\n\n*It's worthy of praise. Be confident.*\n\n\"Move, move!\" Another group sprinted into view—miners, laden with stones. Their leader, a young man in his mid-twenties with wild hair like a lion's mane, skidded to a halt when he spotted Grid. His face fell.\n\n'I wanted better quality stones and took too long. Chris is going to get chewed out because of me!'\n\n\"Those are excellent stones.\" Grid examined the man's burden. \"Must've been hard work, Lion.\"\n\nDolce—nicknamed Lion by his friends, though few knew it—nearly dropped his load. Grid knew. Grid had noticed him, watched him, remembered the stupid nickname from his mining crew.\n\n\"I'll work even harder!\" The words burst out of him.\n\n\"Grid, do you know me too? I'm just a baker...\"\n\n\"Of course I know you. Your bread provides a small stat buff.\"\n\n\"Grid knows all of us. He's been watching this whole time.\"\n\n\"Even though he's fighting wars and forging legendary items every day...\"\n\nThe warmth spreading through the gathered crowd made Lauel smile. Grid looked at each face surrounding him—Lauel, Toban, the builders, the miners, the rankers who'd believed in him from the start. A blessing and a burden in equal measure.\n\n\"Enough chatting.\" Toban clapped his hands, cutting through the sentiment with practical efficiency. \"Repair the wall first. We still need to welcome the fourth guild properly.\"\n\nGrid appreciated Toban's level head. The man was one of the world's best tanks, keeping Overgeared's momentum focused when emotions ran high. Grid had long since forgiven the sword-pointing incident—especially since he'd gotten his payback at the time.\n\nThough Huroi had never forgiven it. The man held grudges on Grid's behalf like a jealous guardian, to the point where he'd even started avoiding Euphemina after learning about her past antagonism. Recently, he'd been openly hostile since hearing she'd interacted with Agnus.\n\n'I need to talk to him about that.'\n\nThe loyalty touched Grid, but excessive devotion could fracture the guild's cohesion—\n\n\"Aura Master!\"\n\n\"Hurent!\"\n\n\"He really joined Overgeared!\"\n\nThe shouts rippled through the crowd. All eyes turned toward a man holding a hand plow, pants rolled to his calves, boots caked with dirt. He looked like he'd stepped straight from a rice field.\n\n\"You called, so... I came.\" Hurent's discomfort was palpable as he approached Grid. Three years away from the spotlight had left him unaccustomed to attention. But this was Grid—the man who'd welcomed him despite Hurent having invaded Overgeared territory alongside the Eternal Kingdom. The man whose lieutenant, Piaro, had become Hurent's greatest benefactor and teacher.\n\n(Grid still didn't know either of these facts.)\n\nWhen Grid summoned him to Reidan for the guild creation ceremony, Hurent had come without hesitation. Now, under the scrutiny of Overgeared's famous powerhouses—Jishuka, Pon, Regas—he kept his expression neutral. He'd weathered worse pressure. And besides, he had no right to bask in their expectations.\n\nNot when he was so weak.\n\n\"Thank you for representing the kingdom so well.\" Grid extended his hand.\n\nHurent clasped it briefly. \"I didn't enhance anything. I'm lucky I didn't embarrass us.\"\n\nThe truth gnawed at him. Grid had left him alone for three years—no demands, no oversight. Just orders from Administrator Rabbit and training under Piaro. Then suddenly, today: come to Reidan for the Overgeared Four founding.\n\nBut this wasn't really a celebration. Not with an imperial army camped eleven kilometers away. This was Grid marshaling forces for war.\n\n'And I'll be expected to fight.'\n\nThree years of inactivity. Three years of rust accumulating on skills once sharp enough to make him famous. Could he even kill imperial soldiers now? What if he faced a knight and died like a chump?\n\nThe humiliation would be unbearable.\n\nWhile Hurent battled his doubts, the hundred players gathered off to one side watched him with poorly concealed envy.\n\n'The Aura Master is actually in Overgeared...'\n\n'Grid beat him, sure, but before that? Hurent was top-tier.'\n\n'Americans are still waiting for him to come back.'\n\n'Three years of training... he must be a monster now.'\n\nThese hundred were today's real guests—artillerymen, personally recruited by Lauel. Compared to Overgeared's glittering roster, they were nobodies. Their class was so terrible that none had even broken level two hundred. They'd accepted the invitation out of desperation, not expecting much beyond maybe some hand-me-down equipment.\n\nSo when Grid turned toward them, they stood frozen.\n\n\"It's a pleasure to meet all of you.\"\n\nThe shock hit differently for each person. Some went rigid. Others couldn't decide where to look. A few shuffled their feet. One stared up at Grid with disbelieving eyes. Not a single one looked confident.\n\nGrid recognized the body language—he'd lived it for years. His expression softened as he approached a woman standing slightly apart from the group. Lost Justice. First-ranked artilleryman.\n\n\"I'm honored to have the best artilleryman in Satisfy join Overgeared.\"\n\n\"No, I'm the one who's honored!\" She grabbed his offered hand with both of hers, voice cracking.\n\nGrid studied her ID: Lost Justice. The name suggested someone bitter, pessimistic, maybe even dangerous. He'd need to keep an eye on her—watch for instability, manage her carefully. But outwardly, he kept his expression warm.\n\n\"You'll find that there are good people in this world. That justice is still alive.\" He smiled at his own words. \"I hope you find happiness here with us.\"\n\n\"...?\"\n\nSeveral Overgeared members exchanged confused glances. Only the Korean players—Peak Sword and others—seemed to understand, fighting back grins.\n\nThe reason was simple. For Korean players, Lost Justice's ID displayed as 정의상실 (*Lost Justice*). But for everyone else? 정 의상실. The space between the first and second characters changed the meaning entirely: *Genuine Boutique*.\n\nThe woman's actual ID was *Genuine Boutique*.\n\nThe temperature seemed to drop as the misunderstanding settled over the crowd. Grid coughed.\n\n\"It's a joke. Just a joke.\"\n\n\"Ah... yes.\" Lost Justice—Boutique—finally broke into laughter, Korean enough to understand exactly what had happened. \"You're kind of cute.\"\n\nThe words were barely out before killing intent spiked from three different directions. Yura, Jishuka, and Ruby all turned murderous glares on the poor woman.\n\nSexy Schoolgirl clicked her tongue from the sidelines. \"A popular man really is more attractive.\"\n\nShe'd been positioning herself for years, patient as a predator in tall grass.\n\n---\n\nMeanwhile, hundreds of kilometers away, disturbing energy gathered over a different battlefield. The three-way conflict between the Rebecca Church, Yatan Church, and Valhalla's armies had transformed the very air—thick, oppressive, saturated with death.\n\nEvery soul claimed during the battle was being *sacrificed*.\n\nThird Imperial Prince Benoit stared up at the blackening sky, hands clasped in prayer.\n\n\"This time, it must succeed.\"\n\nGamigin would descend."
}