{
  "id": 1014,
  "title": "Chapter 1013",
  "content": "**Chapter: Artillery's Roar**\n\nPrince Benoit had never been like his brothers. Born the third son of Empress Aria, he'd grown up valuing knowledge over ambition, preferring genuine conversation to the posturing of court. Talent mattered to him far more than bloodline ever could.\n\nHis words from youth had become infamous throughout the palace: *\"Politics is not something I must do—it's something I observe, consider, lament, or applaud.\"* An irresponsible declaration for an imperial prince. A public renunciation of both his father's throne and his duty to pursue it.\n\nThe 3rd Imperial Prince lacked every quality that made an emperor. He was a scholar at heart, perhaps even a revolutionary. Emperor Juander couldn't stand him.\n\nEmpress Aria, however, adored her third son.\n\nBenoit returned that love tenfold. She embodied everything he admired—benevolence, wisdom, grace. He tried to model himself after her. Which made her death devastating beyond measure. \n\nHis healthy mother, suddenly ill. The decline too swift, too convenient. Benoit watched. He paid attention. His suspicions crystallized around Empress Marie, and eventually, he understood—the empress had murdered his mother.\n\nBut there was no proof. Nothing tangible.\n\nFor the first time in his life, Prince Benoit wanted to kill someone. Fury ignited in his chest, a sensation he'd never known. He hated his father for depending on the venomous woman who'd poisoned his wife. He despised his siblings for worrying more about their positions than their mother's death.\n\nRevenge became his only dream. He trained with the sword until his hands bled. Studied magic through sleepless nights. Mastered the red energy that flowed through imperial bloodlines. \n\nThen he realized—crushing them with raw strength wouldn't be true vengeance. He needed something deeper. He wanted his father to drown in hatred and regret. He wanted his siblings to mourn.\n\nSo he dove into the subjects that had always fascinated him: forbidden magic and dark rituals. He stopped praising Goddess Rebecca and began studying why the Seven Malignant Saints had betrayed the gods. He researched great demons, peered at the hidden truths of the world, and didn't flinch from what he found.\n\nInstead, he decided to summon one.\n\nThe 4th Great Demon, Gamigin—lord of the dead, capable of calling forth ghosts. Benoit would make his mother speak from beyond death. Her testimony would shatter his father. It would break his brothers.\n\n***\n\nRose knew the entire story. \n\nAs the 1st ranked black magician and one of Yatan's Servants, she understood exactly how this situation had developed. The Yatan Church had exploited Empress Marie's ambitions to destabilize the imperial family. They'd cultivated Prince Benoit's grief, twisted it into a weapon, and guided him toward this moment—summoning a great demon.\n\nShe watched him now, standing before the altar on the cliff above the battlefield. He'd gathered the necessary components. Made the required sacrifices. Now he chanted in languages that predated kingdoms, his voice raw with desperation.\n\nHe looked more alive than anyone else in this world. Hard to believe he was just an NPC.\n\n\"...I think I understand Grid a little better now.\"\n\nRose's mouth twisted into something that might have been a smile on anyone else.\n\nBut understanding wasn't the same as agreeing.\n\n\"Idiot.\"\n\nPathetic, really. If she'd been Grid, she would have taken everything the world offered and lived magnificently. Why cling to fleeting relationships? Why sacrifice for temporary attachments?\n\n\"Is he just a pushover?\"\n\nShe touched her lips, tilting her head as she considered. The gesture would have been beautiful if not for her empty eyes—two voids that reflected nothing back.\n\nThe ritual intensified. Power gathered on the clifftop altar.\n\n\"Found you.\"\n\nA voice cut through the chanting. Someone vaulted up onto the cliff—Luck, one of Valhalla's most influential members. Even Kraugel had acknowledged his abilities during his peak.\n\nLuck clenched his fists, taking in the unidentified NPC conducting some dark ritual and his escort. \"I don't know what you're doing, but it ends now.\"\n\nRose's eyes went wide. Desperate. \"Don't interrupt! My sibling's life depends on this!\"\n\n\"...What?\"\n\n\"Do you think I *want* to work for the Yatan Church?\" Her voice cracked. \"Everyone criticizes me, calls me evil—but the rewards are worth it! I *need* the money! My sibling is sick, dying! The medical bills keep coming, and if I can't pay—\"\n\nLuck's expression wavered.\n\nEveryone had a story. Rose might be an enemy, but she was fighting for someone's life. For just an instant, his guard dropped.\n\nMagic erupted from Rose's staff, slamming into him. He staggered back from the impact, looking up at her in shock.\n\n\"You going to let me go?\" Rose aimed her staff at his chest.\n\nShe didn't have a sibling. Never had. But Luck had no way of knowing that.\n\n\"Let you go?\" Luck recovered his stance. \"Just because I heard a sad story? Please.\"\n\nHe lunged forward, fist drawn back.\n\nExplosions echoed across the cliff as they clashed. Through it all, Prince Benoit never stopped chanting.\n\n***\n\n*『 That concludes the opening ceremony for Overgeared Four. 』*\n\n*『 Quite the spectacle! They must have spent tens of thousands of gold on those fireworks alone. 』*\n\nGlobal news crews and top streamers—including Bunny Bunny—broadcasted live from Reidan. When they'd first received the proposal days ago, they'd thought it was insane. A guild opening ceremony during the kingdom's worst crisis? In the middle of an active warzone?\n\nAnd an *artilleryman* guild, no less. Why organize a large-scale artillery unit in a game where cannons barely mattered? \n\nSome speculated Grid had lost his mind from stress.\n\nYet somehow, the Overgeared Guild had pulled it off. Colorful fireworks painted the sky above a city under siege. They expanded their forces openly, defiantly.\n\nThe result shocked everyone. The imperial army hesitated. Their morale visibly crumbled.\n\n*『 There's real power in showing strength during wartime. It's often called a bluff—a basic tactic, high risk, but when it works... 』*\n\nPeople began to understand. This was why Grid had chosen to establish the new guild in Reidan despite the circumstances. \n\nOf course, it was actually Lauel's plan, executed successfully because of Noll's performance. But Grid was the Overgeared King. Everything that happened became his achievement.\n\n**—I'm an artilleryman. Should I apply to Overgeared?**\n\nInterest surged. Artillerymen across the continent perked up.\n\nBut the community remained skeptical.\n\n**—Does Overgeared actually need artillerymen? This is just propaganda.**\n\n**—Exactly. They're trying to intimidate the empire with the *threat* of artillery.**\n\n**—Except there are no cannons that actually threaten the empire. Low accuracy, slow reload time. Good against buildings, useless against moving targets. Magic is superior in every way.**\n\n**—Why does the artilleryman class even exist?**\n\n**—They're deadweight.**\n\n**—Hey, that's harsh. You'll hurt their feelings.**\n\nCannons had limited tactical value. They'd performed well in the Demon King Subjugation, but that was a unique scenario. Building an artillery unit made no practical sense.\n\nThis was the consensus.\n\n\"Artillerymen, to the walls.\"\n\nGrid was about to shatter that consensus.\n\nHe'd crafted unique-rated Overgeared Cannons himself. Eight more cannons—ranging from rare to epic rating—had been forged by his craftsmen. All were positioned along Reidan's walls.\n\nAt his command, Lost Justice and the other artillerymen scrambled to their posts.\n\nThen they saw what they faced.\n\nThe imperial army spread across the desert like a dark tide. Hundreds of thousands of troops. Massive catapults, dozens of cannons, thousands of shields bearing the empire's crest.\n\n\"Oh god...\" Color drained from the artillerymen's faces. They'd spent their entire careers ignored, dismissed. Now their first real battle was against an army that blotted out the horizon.\n\n\"MOVE!\" Toban's roar cut through their paralysis. \"Load shells and target those catapults!\"\n\nEven now, imperial soldiers hauled massive boulders into siege engines. The rocks were so enormous it took whole crews to load them. Once those catapults fired, Reidan's walls would crumble. The city would fall.\n\n\"NOW!\"\n\nLost Justice snapped into motion first, loading her cannon. She blinked in surprise—the shells loaded from the rear of the barrel, not the front.\n\n*'The loading speed is incredible!'*\n\nThe artillerymen hadn't had time to examine the Overgeared Cannons' specifications. In this brutal, urgent moment, they simply followed orders.\n\n\"AIM!\" Toban raised his flag.\n\nThirty artillerymen—the top-ranked players in their class, now collectively called the Overgeared Artillerymen—adjusted their positions. Indirect firing. They angled the barrels toward the sky, increasing altitude for maximum impact. The shells would accelerate as they fell, delivering devastating force to whatever they struck.\n\n*'I have to succeed.'*\n\n*'Can't miss. Can't fail.'*\n\nThe top thirty artillerymen on the continental rankings. For years, they'd trained alone. Ignored by guilds. Dismissed by armies. But they'd never stopped practicing. Every single day, they'd drilled. Fired practice rounds. Studied ballistics and wind resistance and structural weaknesses.\n\nTheir skill levels remained low. Their experience in actual combat was minimal.\n\nBut their knowledge was solid. Their enthusiasm, unmatched.\n\n\"FIRE!\" Toban's flag swept down.\n\nTen Overgeared Cannons spoke as one. Black smoke erupted from the barrels. Thunder rolled across the battlefield.\n\n**—Lot of noise for nothing.**\n\n**—Yeah. All flash, no substance.**\n\nThe viewers sneered. Cannons were a known quantity—loud but ineffective.\n\nThen reality rewrote itself.\n\n**—...Holy shit.**\n\nThe shells arced through the sky, curved down in perfect trajectories, smashed through the magicians' defensive barriers like they weren't there, and obliterated five catapults.\n\nTen shells. Five mountain-sized siege engines reduced to splinters.\n\n\"AHHHHH!\" Thousands of imperial soldiers screamed as wreckage crashed down. Catapult debris crushed men and equipment. Bodies flew. Cannons shattered. Chaos rippled through the imperial formation.\n\nTen cannons. One volley.\n\nThe viewers, broadcasters, and even the artillerymen who'd fired the shots stood slack-jawed.\n\nNotification windows materialized.\n\n**[You have destroyed the Imperial Army's 2nd Catapult.]**\n\n**[You have defeated an Imperial Soldier.]**\n\n**[You have defeated an Imperial...]**\n\n**[Your level has risen.]**\n\n**[Your level has risen.]**\n\n**[The Firearms Mastery skill has increased to Intermediate Level 2.]**\n\n\"What?\"\n\nThe messages kept coming—impossible news, incredible gains. The artillerymen stared, unable to process their sudden success.\n\n\"RELOAD!\" Toban's voice shattered their trance.\n\n\"R-Reloading!\" They scrambled. Hands moved automatically, drilled motions taking over. The second loading was even faster than the first—several times quicker than any standard cannon.\n\n\"AIM!\"\n\nFour targets this time. The remaining catapults, already loaded with massive boulders. Imperial soldiers who'd survived the first barrage hauled on ropes, preparing to fire. But the siege engines were cumbersome. The rocks were heavy. Everything moved slowly.\n\n\"FIRE!\"\n\nThe Overgeared Cannons thundered again. This bombardment hit even harder than the first—a natural result of the artillerymen's increased stats and improved skill levels.\n\n**—This is insane.**\n\nThe viewers couldn't distinguish dream from reality as more catapults exploded. The Overgeared Cannon was a revolutionary weapon.\n\n\"Impressive.\" Even the Overgeared members looked shocked.\n\nGrid's tone remained calm. \"They're stationary targets. It won't be as effective against moving soldiers.\"\n\nHe didn't seem fazed at all. The man who'd created such monstrous weapons acted like it was routine.\n\nThe Overgeared members understood immediately—the cannons on these walls weren't even the final form.\n\n*'Could he make a legendary version?'*\n\n*'If he does...'*\n\n\"...!\" Grid had been observing the battlefield when his eyes suddenly widened. The sharp scent of alcohol cut through the smoke and gunpowder. Someone emerged from the imperial lines.\n\nGrid recognized him instantly. \"The Drunk Duke!\"\n\nDuke Diworth shot upward, covering the distance to the wall in a heartbeat. His hand reached for an Overgeared Cannon.\n\nToban threw himself forward, shield raised to block.\n\n\"Gah!\" The shield and all his defensive skills meant nothing. Toban crumpled, severely injured, blood seeping through his armor as he collapsed to his knees.\n\nThe Drunk Duke turned back toward the cannons—\n\nTwo figures blurred through the air. The Duke's instincts screamed danger. He dropped low. A sword and hand plow whistled past where his head had been a split second before.\n\n\"...What?\" \n\nThe Drunk Duke stared at the farmer gripping that hand plow. Their eyes met. His expression looked like he'd seen a ghost.\n\nThe shock sobered him completely."
}