{
  "id": 1015,
  "title": "Chapter 1014",
  "content": "Thousands of years of imperial history had birthed countless heroes, twelve of whom had been elevated to dukedoms. Yet time proved a merciless master. Corruption festered in some bloodlines; others withered from misfortune or fell to treachery. Five ducal houses crumbled into dust. Of the seven that remained, only two could trace their lineage back to the empire's founding.\n\n\"Piaro?\"\n\nThe name escaped Diworth's lips like a curse. The pillar of the empire. The only great swordsman of his generation. The emperor's sword-brother.\n\nThe traitor.\n\n\"I must be drunk.\" Diworth yanked at his collar, staring at the farmer standing before him. Those eyes, that nose, the set of his jaw—all unchanged from memory. The powerful frame remained, though time had etched new lines around his eyes. But something fundamental had shifted. The overwhelming presence that once pressed down like a mountain had... vanished.\n\nNo. Not vanished. *Changed*.\n\nDiworth could sense the passage of years, but not the *energy*. The farmer's aura had become indistinguishable from wind, sand, and soil—natural, elemental, diffuse. He looked different. He looked the same.\n\nMemories warred with reality until Diworth stopped fighting.\n\n\"It is you.\"\n\nThe farmer *was* Piaro.\n\n\"So you survived after all.\"\n\nDuring Piaro's command of the Red Knights, they had been the empire's symbol, raised on pedestals by common folk and nobility alike. Diworth among them. He'd hated Piaro. He'd been forced to acknowledge him. When the imperial execution order came down—traitor, betrayer, condemned—Diworth had joined the hunt.\n\nHe'd failed to bring Piaro in.\n\n\"I thought you'd left this world. No word, no trace, for so many years. I never imagined you'd surface in the Overgeared Kingdom.\"\n\nHis Majesty would be... pleased? The emperor still hated Piaro, still missed him. Which raised a troubling question.\n\n*Does His Majesty already know?*\n\nAfter the empress's death and Piaro's betrayal, the emperor had drowned in darkness for years. Then one day, light returned to his eyes. His vigor restored. Around the same time Mercedes—legendary knight Mercedes—had been exiled.\n\n*Why would he banish a legend?*\n\nUnless he'd known Piaro lived. Unless he'd given Mercedes secret orders to protect him.\n\n*It's possible.*\n\nThe emperor knew Mercedes served the Overgeared King now. He knew everything the Seven Dukes knew, and more. Yet he hadn't restrained her, hadn't pressed the conquest. Only after Grid harbored the evil eyes did he finally declare war—and even then, to appease outraged nobles. He hadn't compelled the Seven Dukes to march. That's why Rachel remained behind.\n\n*Yes. He knows.*\n\nPiaro lived.\n\n*And His Majesty has forgiven him.*\n\nOr perhaps—as Rachel, Grenhal, and Morse insisted—Piaro's betrayal had been fabricated from the start. If true, everything made sense.\n\n\"Hmm.\" Diworth glanced down from the wall. Hundreds of thousands of allied soldiers filled the desert below, staring upward. Artillery crews still wrestled with their cannons and catapults, reloading.\n\n*If they learn Piaro's alive...*\n\nChaos. Confusion. A weakened army.\n\n*Could the empire reconcile with the Overgeared Kingdom because of him?*\n\nImpossible. Piaro would never forgive the empire that murdered his family.\n\n*And we cannot tolerate a kingdom that refuses to acknowledge imperial supremacy.*\n\nThe decision crystallized. Kill Piaro. Now. Prevent the chaos, secure the victory, restore the empire's dominance over the continent.\n\n\"Piaro.\" Diworth's voice held an odd gentleness. \"You should know—I hated you for a long time. Watching you surpass me again and again destroyed my pride. But those are old memories now. I bear you no malice.\"\n\nHe meant it.\n\n\"For the sake of what we once were, I'll make it quick. No pain.\"\n\nOne clean stroke. Diworth raised a bottle to his lips and drank deep. Speed mattered. Basara had pushed for the executions, but the other dukes had opposed them, petitioned for mercy, *known* Piaro was framed. If they arrived before this ended, complications would multiply.\n\n*Good thing they're chasing that madman Skunk.*\n\nThe explorer they'd encountered in Galest, the one planning to cross the Red Sea. The dukes had lit up at the prospect—distracted from the war because they held the Overgeared Kingdom in contempt.\n\nMagic power surged through Diworth's body, alcohol vapor shimmering around him. He would eliminate Piaro instantly.\n\n*Die cleanly. Find peace at last.*\n\nMercy for an old hero—hated, yes, but respected.\n\nHe drew a weapon too bright and refined for his rough appearance and swung at Piaro. Then froze.\n\nPiaro's aura had diminished—he'd *assumed* weakness. But the hand plow caught his strike effortlessly.\n\n\"Still making unilateral judgments, I see.\" Piaro clicked his tongue. \"Still abusing soldiers when drunk?\"\n\nThe air around him began to fade.\n\nWind. Atmosphere. Earth. Sand. Weeds. All the surrounding nature lost its vitality, flowing into Piaro instead.\n\n\"No. This can't be—\" Diworth's fingers trembled as he wrenched his sword back. He'd heard of Natural State, but this... \"Transcendent Natural State!\"\n\nWeakened? Piaro had grown *stronger*. His swordsmanship transformed into farming techniques, but evolution, not degradation.\n\n\"Free Farming.\"\n\nAs nature surrendered its energy, gravity released its hold. Piaro floated upward, raising his hand plow overhead.\n\n\"Wait.\" Grid appeared, hand outstretched. \"Piaro, Mercedes—destroy the catapults instead.\"\n\n---\n\nIn Satisfy's peculiar physics, weapons could clash against weapons, magic against skills, forces offsetting each other in cascading impacts. The virtual reality's underlying formula allowed counterattack and defense through direct collision.\n\nUnless one force overwhelmingly dominated. Then no offset occurred.\n\nSuper-sized weapons created exactly that exception. Their mass and dimensional scale made them unstoppable by ordinary means. The system recognized 'significantly larger weight and attack area' as unilateral dominance.\n\nWhich meant the moment those imperial catapults fired, Reidan would fall. The Overgeared Kingdom had no countermeasure against flying boulders, and the walls couldn't be sacrificed. The rational solution: destroy the siege engines themselves, as the Overgeared Cannons had attempted.\n\nBut Grid couldn't reach catapults embedded within hundreds of thousands of troops. Long-range skills like 100,000 Army Swordsmanship or Fly Up were useless here. General weapons dealt reduced damage to siege equipment and structures.\n\n\"So I'm entrusting this to you both.\" Grid approached them, radiating confidence. \"Don't die.\"\n\nBefore meeting Chreshler, he would never have risked his knights' lives. Now he understood transcendence. Understood that sheltering them crippled their growth.\n\n\"I believe you'll complete the mission and return safely.\"\n\nHe would trust them. Rely on them.\n\n\"I won't forget it.\"\n\nHis Majesty's deepening faith sent thrills through them. Piaro and Mercedes launched themselves toward the enemy.\n\nBut first—\n\n\"Take these.\" Grid pressed the Enlightenment Sword into Mercedes's hands and Lantier's Cloak into Piaro's.\n\n\"I can't accept this!\"\n\n\"Neither can I!\"\n\nPiaro looked stricken. Mercedes equally reluctant. These were Grid's treasures—his favored sword, his protective cloak. Jude, Noll, Kasim, and the other Overgeared members stood nearby, but Duke Diworth was formidable. They couldn't help worrying.\n\nGrid smiled, attaching the Blade Aiming at the Gods to his belt with the Pulling Device. He patted Valhalla of Infinite Affection.\n\n\"I have plenty of quality equipment left.\"\n\nHe preferred the Enlightenment Sword for its black flame explosions—uninterrupted damage accumulation that often exceeded the Blade Aiming at the Gods. Enhanced to +4, it had closed the power gap entirely.\n\nRight now, the Enlightenment Sword outperformed the Blade Aiming at the Gods in most situations. But Grid chose it for Mercedes because it specialized in *slaughter*. Her cutting through hundreds of thousands of troops with that blade...\n\nThe mere image was terrifying.\n\n*The Blade Aiming at the Gods suits fighting the duke better.*\n\nPlus, he looked forward to testing its special property:\n\n**[50% bonus damage to transcendent beings: gods, angels, great demons, boss monsters, and named NPCs.]**\n\nBoss monsters and named NPCs qualified as transcendents. Against Named NPC Drunk Duke Diworth, the Blade Aiming at the Gods would outperform the Enlightenment Sword—even without activating Contempt of the Weak's health reduction against non-transcendents.\n\nWhile Grid conversed with his knights, Drunk Duke Diworth ground his teeth.\n\n\"Overgeared King! A petty monarch dares lecture an imperial duke? Shut your mouth and piss off!\" He drained another bottle, body swaying. \"Piaro! Mercedes! You're not escaping!\"\n\nOne hero of the old era, one of the new. Their appearance in the imperial camp would shatter morale. The soldiers wouldn't fight properly.\n\nBut as Diworth lunged for Piaro, orange flags rose across the imperial camp.\n\nRetreat.\n\n\"What?\"\n\nRetreat? Now? They'd just *arrived*. Without consulting him first?\n\nBewildered, Diworth sharpened his focus and heard Marquis Fulbas projecting through magic: \"Duke Diworth! We have imperial orders to withdraw completely!\"\n\n\"Imperial orders?!\"\n\n\"Imperial orders?\"\n\nDrunk Duke Diworth, Grid, and every Overgeared member present echoed the shock. Why retreat *now*?\n\nThe answer materialized seconds later.\n\n> **[A great explorer has discovered a new island in the Red Sea.]**\n> \n> **[The island's name: 'Ruins of the War God.']**\n\n\"...!!\" Diworth's eyes widened. The emperor's reasoning snapped into place.\n\n\"Ruins exploration...!\"\n\nDivine ruins. They had to occupy them first, claim the relics before anyone else.\n\nDiworth launched himself off the wall. Piaro and Mercedes lunged to intercept, but his drunken movements proved too erratic. Meanwhile, Grid ignored Diworth entirely.\n\nLauel's whisper had his full attention.\n\n—*The ruins are invaluable. Unknown relics will exceed our wildest estimates. We need an expedition force immediately.*\n\nThey couldn't sit idle while the emperor looted ancient treasures. Lauel's assessment matched Grid's own."
}