{
  "id": 1016,
  "title": "Chapter 1015",
  "content": "The Emperor harbored deep reservations about waging war against the Overgeared Kingdom. Not because he wished to spare Piaro from the conflict—he wasn't foolish enough to let personal sentiment compromise the realm. Rather, several strategic concerns had crystallized his opposition to this campaign.\n\nFirst, he recognized the exceptional value of Overgeared King Grid. As Pagma's Descendant and bearer of the Hero King title, Grid represented the key to fulfilling his ancestral ambition—penetrating the East Continent. Moreover, Grid had secured Piaro's allegiance. The Emperor acknowledged Grid's formidable capabilities and preferred to cultivate him as an ally rather than make an enemy of such a man.\n\nSecond, the variable of 3rd Imperial Prince Benoit troubled him deeply. He couldn't confide this paternal anxiety to the Seven Dukes, but Benoit had been wandering the continent conducting increasingly suspicious rituals. Initially, the Emperor hadn't understood their purpose. Then Belial's summoning revealed the horrifying truth—his son was obsessed with calling forth great demons, entities that threatened the entire continent's existence.\n\nThe previously summoned Belial had been relatively low-ranking, easily dispatched by Overgeared's forces. But should Benoit succeed in summoning a higher-ranked great demon, vast swathes of the continent could be annihilated—and the Empire might not escape unscathed. He needed to preserve their strength against such a catastrophe.\n\nThen there was Mercedes in the Overgeared Kingdom—another formidable obstacle.\n\n*Chensler must retrieve Benoit. Quickly.*\n\nThird, he refused to provide opportunities for 4th Imperial Prince Edan's magic machine army to prove themselves. Edan's faction had swelled dramatically following successful magic machine excavations, and the Emperor couldn't ignore his growing influence. Any military engagement would allow Edan's forces to distinguish themselves. With his traumatic birth circumstances already festering, Edan gaining further prominence could prove disastrous. Should he secure the crown prince position, revolt became a genuine possibility.\n\nFourth lay the financial burden. The Empire's vast territorial holdings created countless borders requiring defense. While many major kingdoms remained loyal, ethnic minorities across the continent had erupted in rebellion. Like the Nero before them—who had inflicted tremendous damage—these minority groups had been tempered by decades of Imperial subjugation. They were weeds that refused to die. Ignoring them to concentrate forces against the Overgeared Kingdom would consume catastrophic resources. The giants posed a particular problem.\n\n\"...My head aches.\"\n\nWhen had the dream of continental conquest grown so distant? Had it begun when the Overgeared Kingdom materialized seemingly overnight? Or when the Empire, complacent in its established power structure, failed to adapt to sudden upheaval? Perhaps the indifferent Grandmaster bore responsibility. The unreliable Five Pillars. The complacent Seven Dukes.\n\nNo. None of that mattered. He couldn't shift blame onto others.\n\n*It's all my fault.*\n\nShocked and heartbroken by Empress Aria's death and Piaro's betrayal in rapid succession, he had retreated into Empress Marie's embrace, turning away from harsh reality. He had abandoned the Emperor's responsibilities. Thus had the Empire squandered decades.\n\n\"I'm not qualified.\"\n\nHe lacked the qualities of an emperor. He had betrayed the family members who believed in him, who elevated him as heir. What would the first Emperor think, seeing the present state of the realm?\n\nThe Emperor chastised himself while opening the map of the West Continent—a map that should have been painted in Imperial colors by now.\n\n\"Your Majesty, a carrier pigeon has arrived from Duke Grenhal.\"\n\n\"A carrier pigeon?\"\n\nIn an era when magical communication existed, why resort to carrier pigeons? Was there a battlefield area where magic power was suppressed? The Emperor admired the Overgeared Kingdom's magical sophistication and thorough preparations even as he examined the pigeon's message.\n\nThe brief report described discovering the Ruins of the War God in the Red Sea. The writer insisted the site held tremendous value, warranting focused exploration.\n\n\"Hah... Haha.\"\n\nRelief flooded through the Emperor. Heaven had granted him a means to conclude this meaningless war with the Overgeared Kingdom. Though... something seemed absurd. Why was Duke Grenhal in the Red Sea instead of the battlefield?\n\n*...Even Duke Grenhal.*\n\nDuke Grenhal had helped curtail the excessive expansion of the Empress's faction. Yet even he had underestimated the Overgeared Kingdom's power, treating this campaign carelessly.\n\n\"Aish.\"\n\nDisappointment stung particularly deep—the Emperor had trusted Grenhal more than the others. He crumpled the letter irritably and commanded Bain, \"Recall the advance forces marching on the Overgeared Kingdom. Prepare for exploration of the War God's Ruins.\"\n\nEnormous treasures would lie hidden within the War God's historical site—along with equally tremendous dangers. Yet no one would object to abandoning the war to focus on the ruins.\n\n***\n\nThe voyage could be summarized in two words.\n\n*Extremely lucky.*\n\nSkunk had known the Empire held great interest in him, but never imagined the Dukes would personally participate in the expedition. Moreover, they'd willingly provided the finest ships. He'd navigated with the Compass of Truth's guidance, passed the water clan territories through Gold Crown Basara's resourcefulness, and handled sea monsters with Beast King Morse's assistance.\n\n> [You have discovered the Ruins of the War God!]\n> [This achievement will be recorded in history!]\n> [Achievement rewards...]\n\nSkunk had accomplished another historic feat—earned mere weeks after completing exploration of the entire West Continent. His heart swelled with pride. Looking at his companions who'd believed in him, and at the Seven Dukes, Skunk felt like the protagonist of his father's films. Perhaps this was how Grid always felt.\n\n\"First...\" Skunk confirmed the discovery rewards and planted a seedling. In one year it would mature into a tree, becoming his eyes here. He proceeded cautiously. \"I've heard these ruins contain numerous dangerous traps and guardians. Perhaps we should wait here until reinforcements arrive?\"\n\nSkunk's companions began establishing camp on the beach where beautiful white sand gleamed, operating under the assumption they'd explore alongside Imperial forces. Skunk's expedition group lacked the strength to tackle the site alone, and all manner of players would surely arrive following the world message. The ideal approach was cooperating with Imperial forces to explore thoroughly and secure maximum rewards before uninvited guests descended.\n\nThe woman wearing a small crown—the mysterious beauty called Basara, who kept her eyes perpetually closed—nodded. \"Sir Skunk is correct. We should wait and avoid drawing the guardians' attention until reinforcements arrive.\"\n\nA reasonable opinion, but Beast King Morse disagreed. \"Between you, me, and Duke Grenhal—the three of us should suffice against any guardians. I'd rather explore the ruins now and monopolize the treasures.\"\n\nImmortal King Grenhal nodded agreement. \"Duke Morse speaks truth. The War God's ruins hold dangers, but we can overcome them through combined strength.\"\n\nMorse and Grenhal's impatience stemmed from these being the War God's relics—not some ordinary deity's. War God Zeratul, sword and shield of Goddess Rebecca, was regarded as the sole entity capable of confronting Evil God Yatan's absolute power. His transcendent abilities, bestowed upon his followers, were described indirectly in accounts of the war against the Seven Malignant Saints.\n\n> [Those most distinguished in the Seven Malignant Saints' subjugation were the War God's followers. Their martial prowess proved overwhelming—the Seven Malignant Saints couldn't remain idle against them.]\n\nThough the War God himself never appeared, his followers had threatened the Seven Malignant Saints. Myths contained exaggeration, certainly, but this remained impressive. Grenhal and Morse coveted the War God's secret techniques likely preserved here. Neither wished to share them with anyone. Grenhal's eagerness burned particularly fierce.\n\n*If I acquire a secret technique, I can keep the Grandmaster in check.*\n\nEven the Seven Dukes couldn't fathom that man. The Grandmaster had supposedly lived for centuries without dying, advising emperors across generations—a deeply threatening existence. The Empire might owe its current state to his numerous accomplishments, but his recent activities showed little loyalty to the Imperial family.\n\n*When a monster pursuing his own agenda wields greater authority than the Seven Dukes... that's problematic.*\n\nThe Grandmaster's presence was enough to unsettle even the complacent dukes. No matter how thoroughly they investigated, this monster of unknown identity remained at the Emperor's side. What meaning existed if a monster held the national standard? This vague risk factor bred anxiety and chaos, disturbing their complacency. Now things would change.\n\n*I'll grow stronger, drive out the Grandmaster, and become new stimulus for the dukes. I'll protect the Emperor properly.*\n\nDuke Grenhal's determination crystallized into a vow. This was different from dealing with some small nation like Overgeared.\n\nBasara sighed. She knew stopping Grenhal was impossible. \"Very well. We'll explore. But let's proceed cautiously from the perimeter. The deeper we venture, the more dangerous it becomes.\"\n\n\"Sound thinking. Agreed.\"\n\n\"...\"\n\nSkunk's expedition members bristled as the dukes consulted only among themselves before deciding. Dog Woman whispered to Skunk, who hadn't dared interrupt their conversation, \"Isn't this favorable? They're Seven Dukes. We can't oppose them, and they'll help us clear this small island quickly.\"\n\n\"These are the War God's ruins, not someone ordinary's.\" Skunk's face had gone pale, recalling the War God follower who'd mastered two secret techniques at Galgunos Temple. \"If we encounter three or four... perhaps even a Duke couldn't handle a War God follower who's learned more secret techniques.\"\n\n\"Then what choice do we have? Could we handle an overwhelming enemy that three Seven Dukes cannot?\"\n\n\"...You're right.\"\n\nRegardless, discussing among themselves accomplished nothing. The dukes were already advancing into the jungle. Knights and soldiers formed an escort around Skunk, suggesting he truly held importance.\n\nThey'd taken only a few steps into the jungle when a fist suddenly shot toward Grenhal. He raised his shield defensively. The single punch struck four times in succession. With each overlapping strike, the power doubled. Eventually, the two-headed hippopotamus staggered back a step.\n\n\"Hah.\" Grenhal couldn't help expressing admiration. The two-headed hippopotamus weighed nearly 2.5 tons with strength matching two ogres combined. This was the first time he'd seen it forced backward.\n\nGrenhal unleashed energy blades in swift counterattack. However, the targeted guardian climbed a tree to evade, crossing his arms. The name hovering above his head read: War God Follower Who Learned Five Secret Techniques.\n\n\"Crazy...\" Skunk muttered. Followers with two secret techniques outmatched high rankers—how powerful would five-technique followers be? For such a monster to appear at the very beginning...\n\n*Even the name is white.*\n\nMeaning it was classified as a regular monster. This revealed the historical site's overall difficulty level.\n\n\"He moves like a monkey!\" Beast King Morse growled. The sharvel tiger he always kept leaped forward, swiping its paws at the follower. The instant the tiger's body touched the branch, a net deployed, ensnaring the beast.\n\nGold Crown Basara, eyes still closed, murmured, \"Traps everywhere.\"\n\nThe jungle grew dense. Countless trees. Leaves and branches crisscrossed like spiderwebs. Basara sensed traps installed throughout. As several troops screamed, caught by traps, Basara addressed Grenhal and Morse. \"We should retreat.\"\n\nThe traps posed the real problem. Grenhal decided to follow Basara's judgment. \"Agreed.\"\n\nMorse differed. \"I'm going to punish this bastard!\"\n\nHe evaded the War God follower while rescuing the sharvel tiger, then pivoted and kicked out explosively. Wind burst forth. The kick struck sharply, but the follower succeeded in blocking with his knees. Morse didn't relent. He used his feet like hooks, seizing the follower's knees. The follower perched high in the tree was forcibly dragged down by Morse, crashing into the ground. As his hardened face struck earth, the follower flinched.\n\nSkunk's group watched the sequence unfold with hanging jaws. They hadn't expected the dukes to be this formidable.\n\n*I thought the accounts were somewhat exaggerated since Rigal was defeated by Grid.*\n\nNo. Grid was simply too overwhelmingly strong. Skunk admired Grid deeply while telling Duke Basara, \"Several trees have keyholes. They appear to be mechanisms for disabling the jungle's traps... Finding keys that fit should be our priority.\"\n\nDuring that brief period, Skunk had thoroughly observed their surroundings. As an explorer approaching legendary status, he possessed all manner of observation skills and quickly grasped how to navigate the jungle traps. The problem was obtaining the keys.\n\n*This will be painful.*\n\nIt wouldn't prove easy without a 'master key' existing somewhere. In fact, this process seemed likely to consume considerable time."
}