{
  "id": 1017,
  "title": "Chapter 1016",
  "content": "# Chapter: The Route to Redemption\n\nAt the imperial port city of Galest, soldiers swarmed the docks in preparation for the expedition through the Red Sea passage that Duke Grenhal had secured. Moving through the organized chaos was Earl Baget—or rather, the man wearing his face.\n\n\"Only three flour bags?!\" The earl's voice cracked across the dock like a whip. \"You pathetic bastards! Call yourselves soldiers of the empire?! Can you defend your country with this piss-poor effort?! Your parents must be so proud!\"\n\nThe soldiers recoiled as if struck. Earl Baget was renowned for strict discipline, yes—but he never berated men who were performing well. And to insult their families? Unthinkable.\n\nThe effect was immediate and catastrophic. Morale crumbled. Work slowed to a crawl. Within the hour, Marquis Fulbas came striding down the dock, his expression dark.\n\n\"I understand impatience, but this is madness,\" Fulbas said, low and dangerous. \"Why curse soldiers who are working efficiently? They deserve praise, not abuse.\"\n\n\"Praise?\" Baget's voice rose to a shout. \"They crumble at a few harsh words! What good are soldiers who swore to die for their country if they can't even take criticism?! Marquis, *you* are the problem. Everyone says you're too sensitive to public opinion. Spineless. They say it's because of that domestic violence incident when you were young.\"\n\nThe color drained from Fulbas's face. That Earl Baget would raise his voice to a marquis was shocking enough. But this—\n\n\"What... did you say?\"\n\nThe Fulbas family was famous for their kindness and generosity. Domestic violence? It was an insult not just to the marquis, but to his entire bloodline.\n\n\"You *dare*?!\" Fulbas's legendary composure shattered. He stamped his foot, voice rising. \"Who spreads such lies?!\"\n\n\"I cannot say. Even with a blade to my throat, I won't betray a colleague.\" Baget's expression turned grave. \"But such slander against a superior—it borders on treason. Out of loyalty, I'll give you a hint. It was one of the earls.\"\n\n\"Earl? *Earl*?!\" Fulbas's neck flushed crimson. \"I treat them well, and this is how they repay me? Stabbing me in the back?!\"\n\nThe marquis stumbled away, muttering furiously. Earl Baget watched him go, suddenly looking a decade older.\n\nA soldier approached—Serun, the one whose Disguise skill made all this possible.\n\n\"You never miss a day,\" Serun observed with quiet admiration. \"It's really impressive.\"\n\n\"...\" Huroi's shoulders tensed beneath Baget's face. \"I don't feel comfortable. This is duty, nothing more.\"\n\n\"You seem to be enjoying it, though.\"\n\n\"...\"\n\nHuroi glanced nervously at Serun. He wanted to protest but held his tongue. The Disguise skill lasted three days. Without Serun's help, this infiltration would have been impossible. He couldn't afford to offend his only ally.\n\nSerun smiled. \"Either way, it's thrilling. I want more adventures like this. I'm glad I listened to Euphemina and followed you.\"\n\nHuroi said nothing. He'd already dreamed of being captured and executed at least ten times. But for Grid's sake, he would endure any risk.\n\n*I need that route,* he thought grimly. *Just a little longer...*\n\n---\n\n## Three Days Later\n\n\"It feels wrong when you think about it.\"\n\nThree days had passed since the imperial army withdrew. Not a gradual retreat—they'd simply *left*, as if the war had been a minor inconvenience.\n\nThe Overgeared members had spent those days in hard labor. Praising soldiers who'd fought valiantly. Comforting traumatized citizens. Coordinating repairs to Reidan's damaged infrastructure. They should have been preparing to explore the Ruins of the War God, but how could they? They lacked the route. Without it, finding the ruins would be like searching for a specific grain of sand in the desert.\n\nFor three days, they'd focused on recovery, exchanging information, saving their strength for the inevitable clash over the ruins.\n\nAnd then, during a quiet moment, the full weight of what had happened sank in.\n\nThey had risked *everything* in that war. Poured their hearts and souls into defending Reidan. Some had died multiple times. And to the empire? It had all been... trivial. A distraction. The moment something more interesting appeared, the imperials had walked away without a second thought.\n\nThe empty desert where the army had camped was a monument to that indifference.\n\n\"Those bastards.\" Katz, the Blood Warrior, spat the words in Korean—the only language with curse words that properly captured his fury.\n\n\"I'm furious.\" He slammed his fist on the conference table.\n\nAround him sat Grid and the Ten Meritorious Retainers. No one moved to stop Katz as he forgot decorum and let his rage pour out unchecked. They understood. During the war, Katz had killed 4,891 enemies. He'd thrown himself into every battle against the imperial advance, dying three times in the process. His achievements exceeded nearly everyone else's.\n\nThe Overgeared Kingdom was the first place where he'd truly belonged. The best organization in the world, as far as he was concerned. He was *proud* to be part of it. He didn't want to see it treated as a joke.\n\n\"They weren't even *serious*?!\" Katz's voice cracked. \"How pathetic must our desperate fighting have looked? Huh? *Kuso! Kuso! Kusooo!*\"\n\nHis fist came down again and again until the round table sagged, half-collapsed.\n\n\"I'm sorry.\"\n\nThe other meritorious retainers felt the same fury. But the voice that finally stopped Katz wasn't one of theirs.\n\n\"I'm sorry,\" Grid repeated. He stood and bowed deeply to everyone assembled. \"This is my fault. I was incompetent. I failed you, and the Overgeared Kingdom paid the price. That's why the empire could come and go as they pleased. I'm sorry. I'm truly sorry.\"\n\nNo pretense. No excuses. The Ten Meritorious Retainers knew him too well for that. They'd shared too many battles, too many victories and defeats. They were true comrades. So he offered them simple, honest truth.\n\n\"The day the empire invited me, I should have shown them overwhelming strength. If I had, maybe none of this would have happened.\"\n\nThe players called him the peak. The strongest. But Grid knew better. He was lacking. Too weak. The Seven Dukes' presence had intimidated him, made him seem vulnerable. Easy prey.\n\n\"When the empire declared war, I should have discussed strategies with all of you. Prepared for every variable. If I had, we could have avoided so much damage.\"\n\nHe should have checked the soldiers' equipment more carefully. Produced more weapons—not just swords and armor. But he hadn't understood war. In large-scale combat, individual soldier equipment mattered far less than the strength of key elites. He should have focused on empowering the Ten Meritorious Retainers, who could each kill thousands. Instead, he'd been greedy. While working at the smithy, he'd prioritized his own strength, sometimes neglecting his comrades.\n\nThe ones who'd trusted him. Who'd chosen production materials as their National Competition rewards. Most of them had stagnated, made terrible sacrifices during the war.\n\n\"...It's all my fault.\"\n\n\"What the hell are you talking about?\" Jishuka's voice cut through the self-recrimination like a blade. \"Did you take an arrow to the head?\"\n\nGrid couldn't lift his gaze. Around him, confusion rippled through the group.\n\n\"Why is this your fault?\" Jishuka sprang to her feet, cold fury radiating from her. \"It's *our* fault we're not as strong as you. Anyone who thinks Grid was wrong—come forward. I'll kill you myself.\"\n\nThese weren't empty words. Jishuka grasped the situation more clearly than anyone—and she wouldn't accept Grid shouldering blame that didn't belong to him.\n\n\"Especially those from the Tzedakah Guild. You should apologize to Grid. I thought I'd gathered a group of geniuses, but have we ever truly helped him? We've always been the ones being helped!\"\n\n*Clang!*\n\nUnlike Katz, Jishuka didn't strike the table. She targeted something far more expensive—and fragile. Her fist smashed through a glass window. Then another. And another. With each step, more glass shattered, until wind swept freely through the conference room.\n\n\"Look. No one can say a word.\" Jishuka broke the last remaining window before turning to face them, sweeping her brilliant red hair over her shoulder. It fell across her collarbone like flames, blazing in the sunlight. \"Grid, this isn't your fault. The problem is that we're more incompetent than you expected.\"\n\nShe was radiant. Imposing. Undeniable.\n\nYura clenched her hands into fists, watching. She envied Jishuka—envied the ease with which she could scold everyone and defend Grid simultaneously. Unlike Jishuka, Yura had joined the Overgeared Guild late. She didn't have the standing to rebuke their comrades. Didn't share that long history.\n\nHer eyes shifted between the proud, fierce Jishuka and the stunned, blank-faced Grid.\n\n*Did Youngwoo delay answering my confession because...*\n\nBecause he was more drawn to Jishuka? Not because of something trivial like appearance, but because of *heart*. Even Yura, as a woman, found Jishuka captivating in this moment. How much more radiant must she seem to Grid, who'd fought beside her since the days of the Tzedakah Guild?\n\n\"Kukukuk...\" Lauel's soft laughter broke the tension. \"This... this is turning out very well.\"\n\nAll eyes turned to him. He lifted his chin, revealing white teeth in a sharp grin.\n\n\"I received the route to the Ruins of the War God from Huroi. Since we're all here, let's plan an expedition.\"\n\nLauel showed no concern for the war's aftermath or the empire's arrogance. His attention had already moved to the historical site—to opportunity. If the Ten Meritorious Retainers' trust in him hadn't been absolute, they might have misunderstood his priorities. But they knew better. They knew Lauel had struggled behind the scenes more than anyone, working tirelessly to strengthen the kingdom.\n\nSo they waited. What scheme had the genius strategist devised now?\n\nIn the expectant silence, Lauel delivered his revelation.\n\n\"The empire withdrew the moment the ruins emerged. No hesitation. This tells us something important.\" His eyes gleamed. \"From the beginning, the empire didn't want to fight the Overgeared Kingdom.\"\n\n\"What?\" Multiple voices spoke at once. \"The empire doesn't want war with *us*?\"\n\n\"Correct. We should interpret their immediate withdrawal—without leaving garrison troops—as proof. They needed a plausible excuse to disengage, and the ruins provided it.\"\n\nLauel's gaze shifted to Mercedes, who stood guard at Grid's side. \"Perhaps... from the moment the Emperor sent Mercedes away...\"\n\nHis mind spun through possibilities, reconstructing the Emperor's motives.\n\n\"The Emperor likely wants the Overgeared Kingdom as an ally, not an enemy. This war wasn't his desire—it was forced upon him.\"\n\nVantner scratched his bald head. \"So what, the Emperor wants us on his side?\"\n\n\"Yes. More precisely, he covets *Grid*. The Emperor is looking beyond the West Continent. He's not content to be a frog in a well.\"\n\n\"Beyond... you mean the East Continent?\"\n\n\"Most likely. But many nobles demanded we be punished for the evil eyes incident. They forced his hand.\"\n\n\"Hmm...\"\n\nSilence settled over the room as they absorbed this. The Emperor's favor—it was good news, wasn't it? A prolonged war with the empire would bleed the Overgeared Kingdom dry. They'd lose regardless of victory. Even if they conquered imperial lands, holding those territories would be unrealistic. And most importantly...\n\nGrid had never expressed desire to become Emperor. How could he, when he was still struggling with kingship? There was an order to ambition, and the imperial throne was far beyond his current capacity.\n\nThere was no benefit in continuing this conflict.\n\n\"The expedition should be small and elite,\" Lauel continued. \"The ruins will contain high-level monsters. Mid-ranked members would be more liability than asset. Additionally, we must guard against leaving the kingdom vulnerable.\"\n\n\"Then who goes?\"\n\n\"King Grid and the Ten Meritorious Retainers.\"\n\n\"All of us?\"\n\n\"Yes. We respond with our best. Additionally, Hurent will join.\"\n\nPeak Sword, who'd been lost in an absent-minded daze for three days, suddenly jolted upright. \"Then let's go!\"\n\nThis was *exciting*. It had been too long since Grid and the Ten Meritorious Retainers had formed a party together. And having an Aura Master along was reassuring.\n\nFaker's cold voice cut through the rising enthusiasm. \"If we can eliminate a few dukes and claim their treasures... two birds, one stone.\"\n\n\"Imperial bastards,\" Katz growled. \"I'll kill them all.\"\n\nLauel raised a calming hand. \"Let's assess the situation first.\"\n\n---\n\nSimultaneously, in Reidan's fields...\n\n\"Why me...\" Hurent, who'd been summoned mid-fieldwork, sighed at the dirt beneath his fingernails.\n\nWhy would Grid take someone as weak as him to a high-difficulty historical site? Had Lauel's legendary intelligence finally failed him?"
}