{
  "id": 1018,
  "title": "Chapter 1017",
  "content": "Two of the continent's greatest spearsmen should have clashed in a legendary duel for the ages. Instead, after a month of relentless combat across two mountains, Kirinus and Rachel had devolved into something far more brutal—grappling in the dirt, grabbing collars, fighting like cornered animals desperate for victory.\n\n*One month. It's been exactly one month.*\n\nKraugel watched from a distance as the two masters collapsed yet again, utterly spent. Soon they would rest, recover, and begin their eighth round. The cycle never changed.\n\n*This won't end anytime soon.*\n\nBoth had achieved enlightenment with the spear—that transcendent realm where attack and defense moved as one. Each strike was answered with a perfect counter. Each thrust met with an impenetrable guard. When mastery reached such heights, drawing blood became nearly impossible. They could devastate lesser warriors with a single blow, but against each other, every exchange merely revealed openings without ever capitalizing on them.\n\nIn an old wuxia novel, their battle might have been described with flowery prose and philosophical musings. But this was reality—a reality bound by certain immutable rules. No matter how skilled they became, some limits remained absolute.\n\nStill...\n\n*I wouldn't trade this for anything.*\n\nWhat must have been tedious torture for the combatants had become priceless education for Kraugel. A month of observation had expanded his understanding of combat in ways no training could replicate. He watched with such intense focus that the world around him ceased to exist.\n\nBehind him, thirty knights knelt in respectful silence.\n\nRachel's elite guard—each one comparable to a Red Knight in their twenties—had been utterly defeated. Not in a day, of course. During the first week, they'd nearly killed Kraugel multiple times. But he'd unleashed strange blue clouds that obscured their vision, allowing him precious seconds to recover. Again and again, the pattern repeated. Two weeks of brutal attrition warfare.\n\nThen, a week ago, the inevitable happened. The thirty knights surrendered.\n\nKraugel had spared them for two reasons. First, their spear techniques specialized in mutual protection, making execution difficult. Second, he'd learned the imperial army besieging Reidan had already retreated.\n\nNews of Grid's victory had left Kraugel both amazed and thrilled. His rival continued to exceed all expectations—he'd actually forced the Empire to withdraw.\n\n*The ruins gave them a convenient excuse.*\n\nThe Empire could retreat with dignity, claiming strategic necessity rather than admitting defeat at the hands of the Overgeared Kingdom.\n\n*If only those ruins had appeared later...*\n\nKraugel had watched every war broadcast. The Overgeared Kingdom's strength had been staggering—players like Katz, Chris, and Faker leading the charge; transcendent beings like Piaro, Mercedes, and Noll demonstrating overwhelming power; unexpected allies from the Water Clan, Evil Eyes, and Ul Clan turning the tide. And those devastating Overgeared Cannons...\n\nEach element had been formidable. Yes, the Empire possessed superior numbers, but Kraugel had seen the cracks forming. The war-torn Empire couldn't sustain a prolonged campaign. Given time, the Overgeared Kingdom would have ground them down, allowing Grid to eventually consume the Empire entirely.\n\nThe ruins had ruined that perfect scenario.\n\n*Don't lose heart, Grid. You still have this opportunity.*\n\nKraugel would keep Rachel and her knights occupied here, preventing them from reaching the ruins. It was the least he could do. Meanwhile, Grid would claim new treasures, drawing ever closer to his dream of empire.\n\nSilently, Kraugel cheered for his greatest rival—the man who had defeated him time and again.\n\n***\n\nSimultaneously, at Cork Island...\n\n\"Achoo! Who's talking about me?\"\n\nGrid stood on the shore of the island where he'd once defeated Hell Gao and first met Noe. The territory technically still belonged to the Overgeared Kingdom, though barely. His ears had been burning for the past few minutes.\n\nKatz approached. \"Ship's ready. We can leave whenever you want.\"\n\n\"Wow...\" Grid stared at the massive warship floating offshore, marveling once again at what wealth could accomplish. The vessel represented shipbuilding technology beyond what the Overgeared Kingdom currently possessed. The astronomical cost put it far outside the reach of ordinary players—most couldn't even afford to *look* at such a ship, let alone purchase one.\n\n\"This is nothing,\" Katz said casually. \"The items you make are treasures no amount of money could buy.\"\n\n\"Mm.\" Grid felt his chest swell slightly. \"What did the captain say about the route?\"\n\n\"At least ten days to reach the ruins, possibly longer.\"\n\n\"Ten days? Even with a ship this fast?\"\n\n\"The Red Sea is unpredictable. Sea monsters, storms... if we run into trouble, it could take much longer. Or we might not make it at all.\"\n\nThey could have shortened the journey by departing from Galest, but that port city belonged to the Empire. Too risky.\n\n\"Well, at least we have time.\"\n\nGrid boarded with the ten meritorious retainers. He immediately summoned Randy, Noe, Tiramet, and both Overgeared Skeletons, positioning them around the deck as sentries. Then he turned back to Katz and held out a small chunk of dark ore.\n\nKatz frowned. \"What's this?\"\n\nThe description materialized:\n\n[Iron Ore with the Power of Transcendence]\n\nGrid grinned. \"Nobody can work with it because of the curse. But you...\" He let the implication hang.\n\nKatz's eyes widened as understanding dawned. Blood Warriors—a class whose very existence was considered cursed. Which meant Katz was naturally immune to curses. More than that, he could transform them into beneficial effects, a unique trait even Grid's First King title couldn't replicate. Grid's title only *reflected* debuffs; it couldn't convert them into advantages.\n\n\"I'll forge you a sword from this.\"\n\n\"You...\" Katz's voice caught.\n\n\"You still have your gold medal reward, right? You chose the White Tiger's Breath?\"\n\n\"This is... it's worth too much.\"\n\n\"Only if I let it gather dust. I can always get more later.\" Grid waved dismissively. \"Besides, who else could even use it?\"\n\nKatz stood frozen. Born into wealth, power, and privilege, he'd spent most of his life believing the world existed for his benefit. Satisfy had shattered that delusion. Joining the Overgeared Guild had shown him countless people more talented than himself.\n\nGrid especially. Others might not realize it, but Katz considered Grid his teacher in humility.\n\nNow that teacher was giving him an invaluable gift.\n\nKatz bowed his head, face flushing as his body twisted awkwardly.\n\nGrid burst out laughing. \"What are you doing? Just hand over the White Tiger's Breath already.\"\n\nHe pulled out his portable furnace, anvil, and hammer. Only a few pieces of white phosphorus wood remained—he'd need to return to the East Continent soon to replenish his supply. Piaro was attempting to cultivate both the white phosphorus trees and golden walnuts, but mass production seemed unlikely for such rare materials.\n\n*I'll have to go back eventually...*\n\nThe memory of Yangban Garam made him shudder involuntarily. He shook it off and began working.\n\nFirst, he refined and strengthened the White Tiger's Breath. Then he attempted the same with the transcendent iron ore.\n\nNothing.\n\nThe ore resisted all conventional strengthening methods. Unlike the sacred creature breaths, this material followed no systematic rules.\n\n*As expected. The sacred creatures are on another level entirely.*\n\n**Tang! Tang!**\n\nGrid possessed hundreds of production methods. Among them, the formula for 'Muksabal'—the White Tiger Sword he'd crafted for Kraugel—ranked near the top.\n\n*If I substitute the transcendent iron ore for the original metal...*\n\nWhat would happen?\n\n**Tang! Tang!**\n\nHis anticipation built with each hammer blow, eventually exceeding even Katz's excitement. Grid had a precise understanding of the materials' value, which only amplified his expectations.\n\n*Katz made a smart choice with that White Tiger's Breath.*\n\nThe material's resilience and defensive properties perfectly suited Katz's fighting style. As a Blood Warrior who absorbed health like a vampire, Katz needed to prioritize survivability over raw damage. The White Tiger's Breath was ideal.\n\n**Tang! Tang!**\n\nThree days passed.\n\n[You have completed the item production!]\n\n[White Tiger Sword Full of Craving]\n\n[Rating: Normal (Growth)  \nDurability: 390/390 | Attack Power: 307 | Defense: 65\n\n* Attack speed -10%  \n* Physical attack power +3%  \n* Physical defense +3%  \n* Magic resistance +3%  \n* Maximum health +6%  \n* Earth attribute damage +8%  \n* Low chance when attacking: sword weight increases dramatically, ignoring 33% of target's defense. (Retrieval speed reduced by 1 second)  \n* Three highest stats +30  \n* **Corrosion Effect (Evil Influence):** Greatly reduces durability and temporarily weakens items, buildings, and weapons struck.  \n* **Curse Effect (Evil Influence):** Decreases stats of targets hit.  \n* Skill 'Howl!' currently inactive.\n\nA sword destined to surpass legend and reach myth...]\n\nBoth men stared in stunned silence.\n\nKatz marveled that a *Normal* rating—even a Growth type—could possess so many options. Grid, meanwhile, compared it to Kraugel's Still Crouching White Tiger Sword. Lower base attack, yes, but superior defense and three additional effects.\n\n*And a completely new skill.*\n\nThe transcendent iron ore had exceeded his expectations. Of course, his improved technique played a role too. He hadn't yet met Hexetia when forging Kraugel's sword. His skills had grown considerably since then.\n\n*Good thing I saved those skill points.*\n\nWhen Pagma's Swordsmanship had evolved into Great Swordsman Pagma's Swordsmanship, he'd resisted the urge to immediately spend his level-up points. Production skills could be upgraded through special opportunities, and he didn't want to waste points if levels might reset. Production skills accumulated experience with each creation, making them harder to level than combat skills.\n\nHis patience had paid off.\n\nGrid handed the blade to Katz. \"Try it out.\"\n\nKatz accepted it with trembling hands. After a long moment, he asked quietly, \"What do you want in return?\"\n\n\"What do I want?\" Grid thought for a moment. \"A private plane?\"\n\n\"Done.\"\n\n\"...What?\"\n\nBefore Grid could process whether Katz was serious about buying him an actual plane, a commotion erupted on deck.\n\n\"Kiyong!\"\n\n**Clack! Clack clack!**  \n**Clack clack clack clack clack!**\n\nNoe yowled, tail and fur standing on end. The Overgeared Skeletons danced frantically, their bones rattling in alarm.\n\n\"Sea monster! Eastern approach!\"\n\nThe ten meritorious retainers rushed to the railing and immediately understood the skeletons' panic.\n\nAn octopus the size of a thirty-story building blocked their path. Its head rose so high they couldn't even see the name marker that should have floated above it.\n\nThunder cracked across the sky. Lightning struck the water as a violent storm materialized from nowhere, tossing the massive warship like a toy.\n\nVantner gulped and raised his shield. \"I'll protect the ship's integrity.\"\n\nJishuka and Yura opened fire—blazing arrows from the Red Phoenix Bow and jade bullets from the sniper rifle streaking through the tempest toward the creature's flesh.\n\n**Thunk. Thunk.**\n\nBoth projectiles bounced harmlessly off the octopus's hide.\n\n\"Are you kidding me?\" Yura stared in disbelief.\n\n\"That skin's too thick,\" Jishuka muttered. \"Some kind of mucus coating deflecting physical damage.\"\n\n\"Cut through the slime layer first.\"\n\nFaker and Chris launched themselves into the air while Peak Sword drew his blade. Three simultaneous strikes carved into the octopus's flesh—but barely. Its defense proved absurd, and the eight thrashing tentacles generated waves that disrupted their attacks. The storm only made it worse.\n\nThe ten meritorious retainers retreated to the deck, breathing hard.\n\n\"Attack pattern's simple enough.\"\n\n\"Defense is the problem. How are we supposed to wear this thing down?\"\n\nAn uneasy standoff developed, the Overgeared members staring up at the massive creature while it loomed over them.\n\n\"There you are.\"\n\nEveryone spun toward the voice.\n\nHurent stood casually on one of the octopus's tentacles, glancing between the monster and the group below. \"Of course. Leaving cleanup duty to me again...\"\n\n\"Aura Festival.\"\n\nHe activated the skill Grid had given him as a welcoming gift to the Overgeared Guild. Dozens of aura blades materialized in the air, swirling around the octopus before detonating like firecrackers. The creature writhed in agony, its protective mucus layer shredding away. All that defense meant nothing against aura—fixed damage that ignored resistance entirely.\n\n***\n\nThe ritual had lasted for weeks.\n\n\"No more... we can't stop it.\"\n\nRebecca's Daughters collapsed one by one, utterly spent from using the three sacred treasures to interfere with the summoning. Even Isabel finally fell to her knees.\n\nNotification windows flooded Damian's vision.\n\n[The great demon summoning ritual has succeeded.]\n\n\"No...!\"\n\nMost people had dismissed Belial's summoning as a minor event for high-rankers. Many had even criticized the Overgeared Guild, Kraugel, and Damian for monopolizing the raid rewards. They'd complained loudly, safely ignorant.\n\nThey didn't understand because they'd never faced Belial. They could afford their ignorance because they'd never felt a great demon's power.\n\nDamian knew better. He'd participated in the Belial raid. He understood the truth: a great demon's appearance wasn't an event.\n\nIt was a *catastrophe.*\n\nAnd now, without Grid, the Overgeared Guild, Kraugel, or Piaro present, another great demon was manifesting.\n\nThis would be a disaster.\n\nLaughter echoed in his ears.\n\nGod of War Ares stood nearby, grinning. \"Finally! Is it starting?\"\n\nDamian's stomach dropped. The current Ares Army far exceeded the strength the Overgeared Guild had possessed during the Belial raid. Like everyone else, they had no fear of what was coming.\n\nThey would learn.\n\n[The door to hell has opened.]\n\n[The 22nd great demon, Berith, has appeared.]\n\n[Vast knowledge of past, present, and future defines you as insignificant.]  \n[All stats reduced by 32%.]  \n[All skills and magic reduced by 50%.]  \n[Casting speed reduced by 50%.]\n\nIt happened while the Overgeared Guild and Empire were absent from the continent.\n\n[A cunning tongue mixing truth with a thousand lies will be your ruin.]  \n[Resistance to 'Confusion' fixed at 0%.]  \n[All deception skills—stealth, clones, illusions—are sealed.]\n\nCountless people were about to experience a living nightmare."
}