{
  "id": 1019,
  "title": "Chapter 1018",
  "content": "**[Bare Octopus Head]**\n\n**Rating:** Unique  \n**Durability:** 120/120 **Defense:** 250  \n\n* Glows brightly when exposed to light, interfering with enemy vision.\n* Slippery surface reduces all physical attack damage by 19%. Slashing and piercing attacks suffer an additional 20% reduction.\n* Swells upon contact with water, increasing defense. The more water absorbed, the greater the effect—up to a maximum of 35%.\n\n*The severed head of a luminous octopus from the depths of the Red Sea. Those without hair will find it oddly comfortable.*\n\n**User Restriction:** Bald.  \n**Weight:** 80\n\n---\n\n\"Perfect for Vantner.\"\n\n\"Shut up.\"\n\n\"You don't like it?\"\n\n\"N-No, I mean—it's not that I *dislike* it, exactly. I just... Sorry.\"\n\nGrid and Katz arrived late, sprinting toward the commotion only to find the octopus already stripped of its sticky membrane. Hurent's aura blades had made short work of the creature's natural defenses. Katz had requested permission from the others to solo the beast—a chance to familiarize himself with his newly acquired weapon.\n\nThe normal-rated White Tiger Sword Full of Craving had pathetic attack power and barely scratched the octopus. But that suited Katz perfectly. He leveraged the Blood Warrior's infamous tenacity, dragging out the fight as long as possible to maximize the sword's accumulated experience. By the time the octopus finally died, he'd secured two pieces of loot: the Bare Octopus Head and several Delicious Pieces of Octopus Leg.\n\n**[Delicious Piece of Octopus Leg]**\n\n*A severed section of the luminous octopus' limb, possessing a pleasantly chewy texture.*\n\n*If consumed raw, there is a low chance of food poisoning and a moderate chance of permanently increasing one stat by 0.5 points. Does not apply to special stats.*\n\n---\n\nKatz and Hurent had claimed two full legs between them. Each leg yielded twelve servings—just enough for Grid, the Ten Meritorious Retainers, and Hurent to share equally. One by one, notifications chimed.\n\n[You have successfully gained +1 to a random stat.]\n\n[You have successfully gained +1 to a random stat.]\n\n[You have successfully gained +1 to a random stat.]\n\nEveryone received their bonus.\n\nWell, *almost* everyone.\n\n[You have contracted food poisoning.]\n\n[You have resisted the food poisoning.]\n\n[You have contracted food poisoning.]\n\n[You have resisted—]\n\n\"You've got to be kidding me...\"\n\nGrid stared at the contradictory messages flashing before his eyes. Where the hell was his good luck stat when he needed it? Had it gone on strike?\n\n\"...\"\n\nAs the ship cut through the crimson waves of the Red Sea, Grid hunched in a corner of the deck, doing his best to ignore the pitying glances from his guildmates. \n\nA moment later, a colossal pufferfish erupted from the sea, scales glittering. Katz's eyes lit up—another perfect opportunity to level his White Tiger Sword.\n\n\"**Transcended Link! Linked Kill Flower Pinnacle! 100,000 Army Massacre Sword!**\"\n\nBefore Katz could even draw his blade, the pufferfish exploded into ash and seafoam.\n\nGrid stood at the ship's railing, steam practically rising from his shoulders.\n\nHurent's eyes widened in shock. *It took me forever just to wear down that one octopus...*\n\nHe was too weak. With a defeated sigh, Hurent slumped into his own corner of the deck, where he remained in brooding silence until they finally reached the Ruins of the War God.\n\n---\n\n**\\*\\*\\***\n\nWhat manner of karma was owed to souls?\n\nThe ritual had been completed. The gate that now stood before them was not stone or metal—it was composed of *faces*. Hundreds of thousands of human faces, different in sex, age, and race, yet united in a single expression: agony. Every mouth hung open in a silent, eternal wail.\n\n\"Oh god...\"\n\nSeveral people went pale. Someone doubled over and vomited. The Ares Army—warriors who'd dismissed the great demon summoning as nothing more than a scripted event—felt their confidence drain like water through a sieve.\n\n\"Th-The great demon the Overgeared Guild fought was ranked 32nd,\" Oasis stammered, his face slick with mud and cold sweat. \"The 22nd great demon is supposed to be even stronger. Can we really handle this?\"\n\nHis trembling gaze fixed on the *thing* squeezing itself through the Gate of Wailing.\n\nIt wore a corroded golden crown upon its head—proof of its ancient status. It sat astride a diseased, skeletal horse, surveying the gathering with pupil-less eyes. Its skin shifted color constantly: red as butchered meat, then mottled gray like rotting flesh, then corpse-blue. The body was emaciated yet grotesquely elongated, the torso stretched to accommodate at least fifty visible ribs.\n\nEven without the weight of the title \"Great Demon,\" the creature's ghastly features were enough to inspire primal terror.\n\n\"You should fall back,\" Ares said quietly, his hand firmly gripping Oasis' shoulder. \"Leave before the raid begins.\"\n\n\"What—?\"\n\nThere was no room for argument. Ares pushed Oasis away, and Sima Hui completed a teleportation spell that whisked the younger warrior to safety. Watching him vanish, Ares allowed himself a bitter smile, recalling the conversation that had led to this moment.\n\n*\"High morale built on ignorance is a house of cards,\"* Sima Hui had warned him days earlier. *\"Your army is powerful—make no mistake. But they are still inferior to the Saharan Empire and the Overgeared Guild. Yet your soldiers are fearless. They believe themselves invincible. This arrogance is dangerous. They need a painful defeat.\"*\n\n*\"You're telling me we need to lose?\"*\n\n*\"I'm telling you that defeat is the foundation of lasting victory. It's an essential experience. The great demon summoning cannot be stopped now—Berith will descend regardless. Lead your army against him. Use this defeat as a teaching moment.\"*\n\n*\"You want me to sacrifice my people? You may be my strategist, Sima Hui, but I won't tolerate—\"*\n\n*\"Not sacrifice. Educate. This is an opportunity for Valhalla to mature, to spread your name across the continent. By fighting the great demon, you gain favor with the Rebecca Church. By sacrificing yourself for the sake of the world, you win the hearts of its people.\"*\n\n*\"...That's still a betrayal.\"*\n\n*\"It's not betrayal—it's medicine. Justice can be poison or cure, depending on the dosage. Trust me, Your Majesty, and make this cold choice.\"*\n\n*\"...Fine. But I'm telling you now—my army will never go down easily. You may think Valhalla inferior to the Overgeared Kingdom, that we'll crumble before the great demon, but I don't believe that for a second. We'll destroy this demon and claim victory.\"*\n\nAnd so Ares had been persuaded. Though he bristled at the idea of \"learning his place,\" he couldn't ignore the political benefits: recognition from the Rebecca Church, continental renown for Valhalla. These were prizes worth risking for.\n\nAres stepped forward to maintain morale against the demon's oppressive aura.\n\n\"Treat this as a festival!\" he called out, deliberately downplaying the threat.\n\n\"Let's move out!\"\n\nHe trusted his troops.\n\n\"We'll show the world that we're every bit as capable as the Overgeared Guild!\"\n\nThey would challenge the great demon raid head-on.\n\nGod of War Ares activated his abilities. Buffs rained down upon his forces like golden light. Morale surged. Stats climbed, offsetting the debilitating aura radiating from Berith's mere presence. And then—\n\n\"We'll cooperate this once,\" Pope Damian declared, stepping forward despite his obvious reservations. \"Though I can't promise what happens after.\"\n\nHis divine blessings layered atop Ares' buffs, and the combined might of the Ares Army and Rebecca Church priests skyrocketed. It was a scene captured by hundreds of floating cameras—warriors and clerics standing shoulder to shoulder, expressions grim with determination as they assumed combat stances.\n\nThis would be a total offensive. They were the vanguard of the Berith Raid, and they would strike with everything they had while the buffs held. Hundreds of ultimate abilities charged simultaneously, cooldowns ticking toward zero. No matter how powerful a great demon might be, surely it couldn't survive a coordinated alpha strike from hundreds of buffed combatants unleashing their strongest techniques at once.\n\nViewers around the world munched popcorn, envying the Ares Army and Rebecca priests who would monopolize all the glory and rewards from the great demon raid.\n\nAnd then—\n\n\"Everyone,\" Berith said, his pupil-less eyes sweeping across the assembled forces before crinkling in a cheerful half-moon smile. \"I am your companion, not an enemy of humanity.\"\n\nSomething impossible happened.\n\n**[Great Demon Berith has been designated as an Ally!]**\n\nBerith's black-and-gold nameplate shifted to verdant green. The system no longer recognized him as hostile—the ally protection protocols had activated, the same safeguards that applied to certain quest NPCs.\n\n\"What—?\"\n\nThe ultimate techniques of the Ares Army and Rebecca priests *canceled*. Hundreds of devastating attacks, primed and ready to unleash, simply... dissipated. All that built-up power vanished without being triggered. Only a handful of indiscriminate AoE skills remained partially active.\n\n\"Companion of humanity?\" Damian demanded, speaking for the stunned crowd. \"What are you *talking* about?\"\n\n\"Exactly what I said.\" Berith—whose skin continued its disturbing color shifts—scratched the side of his head almost sheepishly. In stark contrast to his nightmarish entrance, his voice was gentle, even friendly. \"Not all of us oppose humanity. We possess intelligence, you see. We have values and beliefs, just as you do. Some of us simply... *disagree* with the majority opinion.\"\n\n\"...!?\"\n\nThe statement was so utterly *bizarre* that for a moment, no one could respond.\n\nThe Yatan Church followers, who moments ago had been trembling with dark anticipation, fell into confused chaos. They'd sided with the great demons over humanity, hoping to establish a foothold against the gods themselves. To these believers, Berith's declaration felt like existential whiplash.\n\n\"What's happening?\"\n\n\"Are great demons... not enemies anymore?\"\n\nThe Ares Army and Rebecca priests struggled to process the situation. The *system itself* recognized Berith as an ally—which meant his words couldn't simply be dismissed as deception. \n\nBerith's skin shifted to the color of diseased lungs as he lowered his head in what appeared to be genuine contrition. \"I understand your skepticism. For countless ages, we have been a threat to humanity. My attitude must seem alien, unbelievable. I fully comprehend your position—this is the karma we must bear. I apologize, deeply and sincerely, for the ancient sins we have committed against your kind.\"\n\n\"...!\"\n\nShock rippled through the crowd. Berith—a *great demon*—was *bowing*. Not just those physically present, but viewers across the world watching the broadcast sat frozen in disbelief. A great demon had declared himself humanity's ally, then offered an apology for past transgressions. It was unthinkable. A completely unprecedented development.\n\nIn the midst of this surreal atmosphere—\n\n\"*...$#^~%#*\" A strange sound emerged from Berith's bowed head. It was a noise that bypassed the ears and struck directly at the primitive fear centers of the brain. The words were clearly language—some infernal tongue—and unmistakably, Berith was *laughing*. \"Humans truly are foolish creatures.\"\n\nSimultaneously, his nameplate flashed.\n\n**[Great Demon Berith is no longer an Ally!]**\n\nThe green vanished. Black-and-gold reasserted itself.\n\nBerith was once again recognized as an *enemy*.\n\n\"What—?!\"\n\nAres and Damian threw up defensive skills on pure instinct. The diseased horse carrying Berith reared back, raising one skeletal hoof high. Then it *slammed* down with devastating force.\n\nThe impact wasn't just physical—it was metaphysical. The earth didn't merely crack; it *shattered*. Stone and dust exploded outward in a massive shockwave. As the debris touched Berith's magic power, it transmuted instantly into gold and silver, creating a gleaming storm of razor-sharp shrapnel.\n\nThe Ares Army and Rebecca priests—\n\nThe duration of their first wave of buffs had already expired. They had no defense against the metallic hurricane.\n\n**[You have suffered catastrophic damage!]**\n\n**[You have received excessive damage from a single attack and entered the 'Confused' state.]**\n\n**[Your wounds are transmuting into metal.]**\n\n**[Your skin, flesh, muscle, bone, and blood are hardening into ore.]**\n\n\"A-AAAAAAHHHH!\"\n\nSomeone's arms turned to iron. Another's legs became bronze. Faces and torsos transformed into unmoving sculpture. The metallic parts were heavy as lead, impossible to control. Those whose eyes turned to metal went blind. Those whose noses and mouths solidified suffocated. Those whose hearts crystallized into gold died instantly.\n\nThe terror exceeded the pain.\n\nPeople could only watch in frozen horror.\n\n\"You wear the shape of worms so beautifully,\" Great Demon Berith laughed.\n\nIt had been a lie sophisticated enough to deceive even the *system itself*. Unlike the 32nd great demon Belial, Berith completely overwhelmed humanity from the first exchange.\n\nOnly one person reacted differently.\n\n\"BERITH!\" Imperial Prince Benoit's voice cut through the screams. \"I will ask you one thing, in accordance with the oath of summoning!\"\n\nDespite witnessing people dying in agony all around him, despite knowing the despair humanity would face, Imperial Prince Benoit showed no concern. He cared about only one truth.\n\n\"Is my mother's murderer the current empress?\"\n\n\"Yes,\" Berith replied casually, plucking a piece of gravel from the ground. It transmuted into parchment in his palm—the ultimate alchemy he'd already demonstrated. \"She poisoned your mother. This document lists the specific toxins used, as well as every conspirator who aided her. Every sordid detail is recorded here.\"\n\nThe parchment floated through the air into Benoit's trembling hands. As he read, killing intent rolled off him in waves.\n\nIt was the prelude to a blood-soaked revenge drama within the imperial family.\n\nBut that wasn't the primary concern for most players.\n\n**『 The 22nd Great Demon Berith has begun slaughtering the Ares Army...! 』**\n\nThe broadcast captured every horrific detail as the massacre unfolded. Berith had neutralized his enemies' ultimate weapons and buffs with a single masterful deception, then demonstrated transmutation alchemy that created matter from nothing. \n\nAnd now, the slaughter began in earnest.\n\nThis wasn't an event. This wasn't a festival.\n\nAs they watched the continent's hope crumble before this overwhelming evil, players and viewers alike felt a creeping despair—as if their own futures had been snuffed out like candle flames."
}