{
  "id": 102,
  "title": "Chapter 102",
  "content": "# Chapter 102\n\nGrid wiped steel dust from his hands. \"Okay, perfect.\"\n\nEvery preparation was in place. He pulled out the weapon schematic Ibellin had delivered that morning.\n\n> **[Thorn Production Method]**\n> \n> Prerequisite: Advanced Blacksmith Mastery Level 5 or higher.\n> \n> Thorn: A flamberge with small thorns like a black rose. Reminiscent of a rose's stem.\n> \n> The target will suffer painful wounds when touched by this weapon.\n> \n> User Restriction: Level 210 or higher.\n\nGrid frowned. The Gale Spear required level 240 to wield but only level 4 mastery to forge. Thorn's usage level sat thirty points lower.\n\n*Which means the forging difficulty is higher.*\n\nStandard flamberges mimicked flames or waves. This blade demanded thorns. Dozens of tiny serrated edges, each one needing to withstand combat stress without snapping.\n\n*Small blades that won't shatter easily... This is going to be a nightmare.*\n\nHe activated the schematic. Text flooded his vision.\n\n> **['Thorn Production Method' has been acquired.]**\n\n> **[Thorn]**\n> \n> Rating: Rare ~ Legendary\n> \n> **Rare Rating Information:**\n> Durability: 135/135 | Attack Power: 190\n> Armor Penetration: +30%\n> * Unconditional bleeding on successful attacks\n> * Target's healing reduced by 30%\n> \n> **Epic Rating Information:**\n> Durability: 160/160 | Attack Power: 230\n> Armor Penetration: +35%\n> * Unconditional bleeding on successful attacks\n> * Target's healing reduced by 35%\n> \n> **<span class=\"rarity-unique\">Unique Rating Information:</span>**\n> Durability: 191/191 | Attack Power: 280\n> Armor Penetration: +45%\n> * Unconditional bleeding on successful attacks\n> * Target's healing reduced by 40%\n> \n> **<span class=\"rarity-legendary\">Legendary Rating Information:</span>**\n> Durability: 226/226 | Attack Power: 344\n> Armor Penetration: +60%\n> * Unconditional bleeding on successful attacks\n> * Target's healing reduced by 50%\n> * Generates skill 'Laceration'\n> \n> A flamberge with small thorns on the blade like a black rose. Reminiscent of a rose's stem.\n> \n> The target will suffer painful wounds when touched by this weapon.\n> \n> User Restriction: Level 210+, 750 Strength, 300 Agility, Advanced Sword Mastery Level 2+\n> \n> Weight: 300\n\n\"Laceration?\" Grid pulled up the skill details.\n\n> **[Laceration]**\n> \n> The target's body will be brutally torn open by Thorn. Inflicts fixed damage equal to 60% of target's current health.\n> \n> Skill Mana Cost: 500\n> \n> Skill Usage Condition: Target must be bound.\n\nGrid's eyes narrowed. *Sixty percent of current health? Useless on low-HP targets, but against a tank...*\n\nThe bound condition added complexity, but any legendary skill attached to a weapon was worth the hassle. He'd been on a hot streak lately. The legendary rating felt inevitable.\n\n*Let's do this.*\n\nHe spread Ibellin's materials across the workbench and hefted his hammer. His arm cocked back.\n\n\"$)@*U$!!\"\n\nGrid froze.\n\nCLANG! CHAENG CHAENG!\n\nMetal rang against metal outside. Voices shouted, wordless and furious through the thick smithy walls.\n\n\"Why is it so noisy?\"\n\n*Someone drinking in broad daylight? Affair gone wrong?* He half-turned toward the window. The voyeur in him wanted to watch.\n\n\"No.\" He gripped the hammer tighter. \"I need to work hard and earn money instead of worrying about others.\"\n\nPon's payment for the Gale Spear would clear in three days. If Grid finished Ibellin's commission by then, he'd have enough capital to finally breathe. Pay off the family debt. Buy that foreign car. Roll up to the reunion and make Ahyoung regret every lie she'd ever told him.\n\n*Getting older. Need transportation. Something that makes a statement.*\n\nTTANG! TTANG!\n\nHe brought the hammer down and prayed.\n\n***\n\nKRAKOOM!\n\nEarth erupted. Trees splintered. Fire met water in clouds of steam while fist collided with sword. This wasn't attrition warfare. Mihara disengaged smoothly and channeled mana.\n\nFWOOSH!\n\nFlame jetted straight at Regas' face like a military flamethrower. Regas sidestepped. The fire consumed empty air.\n\nMihara didn't flinch. He'd anticipated the dodge. His blade flowed toward Regas' exposed abdomen in a continuation so seamless it might have been rehearsed.\n\nBut Regas moved like water over stone. He rolled beneath the cut, came up on his feet, and kicked.\n\nCHAENG!\n\nMihara's sword intercepted the strike. He pivoted into another fire spell.\n\nRegas punched through the flames this time. Couldn't dodge them all. Mihara's sword cut through the dispersing fire, aiming for center mass.\n\nRegas twisted away. \"Same pattern twice in a row? Simpler than I expected. This isn't meaningful as training.\"\n\n\"How can you say that?\" Mihara's jaw clenched. \"There are variations! And this isn't training!\"\n\nCRACKLE!\n\nRegas' eyes widened. Sparks danced along Mihara's blade.\n\nBOOM!\n\nThe dried air ignited. Lightning met residual flame right beside Regas' face.\n\n\"KUAAAAK!\"\n\nPain lanced through his skull. Text flashed across his vision.\n\n> [You have lost sight in your left eye.]\n> \n> [All stats reduced by 30% until wound heals.]\n> \n> [Your head is spinning.]\n\nThe stat reduction came packaged with confusion. Not as bad as a stun, but confusion ranked among the worst debuffs. Regas' limbs moved sluggishly, disconnected from intention.\n\n*Basic elemental linkage... I'm still lacking.*\n\nMihara moved before the thought finished. He produced jewels to accelerate his casting.\n\n\"The sapphire's transparency will become a symbol of ice's ruthlessness, and the ruby's intensity will become a symbol of fire's fury. Oh small emerald to the left of the five-pointed star. Oh large emerald on the left of the six-pointed star. Merciful wind that blows in the raging storm. Two energies that cannot coexist will be carried in a storm, transcending their strength!\"\n\nMihara swayed. Dumping his entire mana pool in one cast drained more than resources. A vortex materialized, large enough to swallow a house.\n\n\"Kuahahahat!\" Mihara's laugh carried an edge of mania. \"How is it? This exterminated 180 Yatan followers! Mihara's Special Ice Fire Ultra Storm!\"\n\nThe storm howled. Thousands of ice shards rotated like blender blades while condensed fire churned at the core. It would devour Regas and spit out an unrecognizable corpse.\n\nTwo seconds earlier.\n\n\"Impressive power.\" Blood ran down Regas' face. He regulated his breathing. \"But isn't the casting time too long?\"\n\nYellow aura coalesced around his legs, crackling like bottled lightning. He shifted into a kicking stance.\n\nMihara blinked. \"You recovered from confusion already?\"\n\nAverage confusion duration: five seconds. Mihara's ultimate spell, boosted by magic stones and jewels, averaged three seconds to cast. By his calculations, the storm should have struck while Regas still reeled.\n\nSo what was this?\n\n\"Mental training matters as much as physical.\" Regas' voice stayed level. \"A martial artist must remain calm in any situation.\"\n\nMartial artists possessed accelerated status recovery. As he finished explaining, the storm consumed him. He'd already lost one eye. The shock had diminished his capacity. Mihara's laugh returned.\n\n\"Kuahahat! Like this! Fool! Your death was scheduled!\"\n\nDeath meant everything to a ranker. The time spent recovering lost experience could cost rankings, reputation, sponsorships. Mihara wanted to watch those numbers drain away.\n\nCRUNCH-CRUNCH-CRUNCH!\n\nIce fragments collided with something solid. *That's his flesh tearing. His bones breaking.*\n\nThen:\n\nBOOM!\n\nExplosion at the storm's core. The landscape flattened. Mihara tumbled backward from the shockwave, too stunned to register pain.\n\nRegas emerged from the maelstrom.\n\nDust and ash coated him. Injuries covered his body. But far less damage than Mihara had anticipated. Yellow aura still flickered at his feet.\n\n\"You... You destroyed my ultimate skill with kicks!?\"\n\nPAHAT!\n\nRegas' wounds stole his voice. He launched forward on failing strength. Once within range, he extended his foot and spun. Pure Taekwondo form. Yellow Dragon merged with martial arts into the unique synthesis skill he'd acquired after the Malacus raid.\n\nBOOM!\n\nMihara had gambled everything on that ultimate spell. Zero mana remained. His mental power scraped bottom. He couldn't resist the kick that crushed his chest.\n\nChain mail tore. Flesh split. Bone shattered.\n\n> [You have been hit with a fatal blow!]\n> \n> [You have died.]\n\n*Damn!*\n\nMihara's vision grayed out. Regas confirmed the disappearance and sat heavily.\n\n\"That was hard.\"\n\nHe wanted to find Grid immediately. But his health and stamina sat in the critical zone. Moving was impossible. He uncorked a potion and settled in to recover.\n\n***\n\nThe sun sank beneath sand dunes. White moonlight replaced it. Desert nights cut deep with cold.\n\nAsellas frowned at the battlefield. Rare for him to expose emotion this openly.\n\n\"The more I watch, the more it defies logic.\"\n\nTen people. Two hundred Giant Guild members being slaughtered by ten enemies.\n\nHis attention fixed on Jishuka. Every time her bowstring sang, at least three guild members fell wounded or worse. He'd thought \"expert archer\" was marketing hyperbole. Now the title seemed inadequate.\n\n*Archers have high attack power by nature, but Jishuka transcends that. No regular member can survive a direct hit.*\n\nThe Giant Guild's average level hovered near 130. Quite high compared to Satisfy's general population. Nothing compared to Tzedakah Guild veterans. The stat differential was a chasm.\n\n*If it were only Jishuka...*\n\nAsellas had ordered focused fire on the archer. But Toban, the first-ranked Paladin, made breaking through his defense impossible. Over two hours had passed. The enemy showed no fatigue while allied numbers dwindled.\n\n*They started Satisfy after us...*\n\nBefore arriving here, Tzedakah seemed much weaker than their L.T.S. days. He'd honestly considered ignoring them. That assessment had been premature.\n\n*The plan was total defeat, but... that won't work. I'll focus on buying time until we secure the unknown craftsman.*\n\nIf Asellas engaged directly, victory might be possible. But caution ruled him. Using magic would expose his position. He couldn't eliminate the possibility of Jishuka sniping him through the chaos.\n\nHis prudence kept Jishuka and Tzedakah's main force pinned in the desert.\n\n***\n\n\"Pant... pant...\"\n\nKhan's smithy.\n\nIbellin blocked the Giant Guild members trying to reach Grid. Sixteen enemies. Guild elites, probably exceeding level 150. Ibellin stood at 212 and ranked nationally, but those numbers weren't enough.\n\nEspecially with a flamberge against heavy armor. The blade would shatter before penetrating plate. Over half his opponents wore full knight's harness.\n\nCRACK!\n\n\"Keuak!\"\n\nThree hours of struggle. Four enemies down. Twelve remained. Stamina limitations slowed his movements. A hammer slipped through his guard and pulverized his shoulder.\n\nIbellin collapsed. A boot pressed down on him.\n\n\"Tzedakah Guild isn't impressive. Small elite group?\" The guild member sneered. \"I don't understand why they recruited a useless boy. Right?\"\n\n\"Right! L.T.S. was different, but Giant Guild is strongest in Satisfy! Tzedakah is nothing!\"\n\nThey spoke mockingly despite barely overcoming one teenager. The process had been brutal, but victory was victory. Tears welled in Ibellin's eyes.\n\n*I let them mock the members... I'm too weak.*\n\nThe Giant Guild felt no sympathy. Only amusement.\n\n\"What's this? Crying? Are you a boy or girl? Pretty face, slim body, but your chest is too flat...\"\n\nThe guild member stabbed his sword into Ibellin's chest armor. Shame burned through pain. Ibellin tried to squeeze out resistance from depleted reserves. Multiple enemies made it pointless. Street spectators gossiped.\n\n\"Rankers aren't impressive...\"\n\n\"Agreed. Even outnumbered, shouldn't he fight like a ranker? This is too one-sided. Were my expectations too high?\"\n\n\"Rankers aren't weak. Giant Guild is too strong. They're considered one of the best, aren't they? By the way, where's the rest of Tzedakah? Their friend's getting beaten and no one's helping.\"\n\n\"They fled. 'Small elite group' means pathetically small.\"\n\nTzedakah's reputation crumbled. Ibellin caused this. His helplessness was the fuel.\n\n\"Kilkil... Now for the real work.\"\n\nSatisfaction achieved through bullying, the Giant Guild finally approached the smithy door. Their true purpose. Meeting the unknown craftsman.\n\nIbellin staggered upright and blocked their path again. \"I can't let you... meet him...\"\n\nAnger flared in guild faces.\n\n\"Really. This punk won't give up. Hey, shouldn't the unknown craftsman choose? He'd rather join us than your trash guild. Now log out!\"\n\nCRACK!\n\nThe beating resumed. Part of Ibellin's destroyed armor broke loose and flew sideways. The trajectory carried it toward...\n\nWHOOSH!\n\nCLANG!\n\n\"...\"\n\nThe blast furnace. Grid had been hammering, oblivious to the violence at his doorstep. He stopped mid-swing. He'd been tempering steel on the anvil for hours. Now a bloody chunk of foreign metal contaminated it.\n\n\"...\"\n\nGrid's hands trembled.\n\nShock stole his voice. The Giant Guild approached with diplomatic smiles.\n\n\"Are you the unknown craftsman? Hello! We've come with an invitation from Chris, master of the Giant Guild and third on the unified rankings...\"\n\n\"Shit.\"\n\n\"...?\"\n\nThe greeting died. They'd been courteous. Grid had responded with vulgarity. Confusion painted their faces as Grid turned to them.\n\n\"Do you know what you just did?\"\n\nFirst time anyone had interrupted his crafting mid-process. Hours of work. The flamberge that might have reached legendary rating was ruined.\n\n\"Kill.\"\n\nGrid's eyes flashed with madness. He gripped the greatsword with one hand. The strange skull helmet descended over his face.\n\n---\n\n**Glossary of Common Korean Terms:**  \nOG: Glossary Link\n\n**Current schedule:** 20 chapters a week\n\n**Check out my Patreon** for early access to unedited chapters and goals for extra chapters. Early access updates after daily releases complete."
}