{
  "id": 1020,
  "title": "Chapter 1019",
  "content": "The moment their ship entered the Red Sea, all communication ceased. Whispers, guild chat—everything went dark. Teleportation magic sputtered and died. The Overgeared members sailed in imposed silence, cut off from the world.\n\nThen the message blazed across their vision.\n\n[22nd Great Demon Berith has appeared somewhere on the continent...!]\n\nGrid's jaw tightened. Around him, the ten meritorious retainers exchanged grim looks. They'd faced Belial. They knew exactly what a great demon could do.\n\nIf Berith reached the Overgeared Kingdom...\n\n\"We should turn back,\" someone said.\n\n\"The kingdom—\"\n\n\"Everyone, calm down.\" Lauel's voice cut through the rising panic. \"I've been in contact with Damian since the ceremony began.\"\n\nThe tension eased slightly.\n\n\"If the ritual couldn't be stopped, Damian promised to lead the demon as far from our borders as possible. The battlefield between the Rebecca Church and Yatan Church is on the opposite side of the continent.\" Lauel paused, his expression thoughtful. \"He's always kept the Overgeared Kingdom's interests at heart. He won't fail us.\"\n\n'But I never expected the ritual to succeed at all.'\n\nThe pieces didn't fit. Belial's summoning had been conducted in secret, hidden from prying eyes. But Berith's ritual had been exposed halfway through. The Rebecca Church had converged on the location with overwhelming force. By all accounts, they should have crushed it before completion.\n\nThe Rebecca Church existed specifically to counter the Yatan Church's ambitions. They had to possess countermeasures.\n\n'Yet the demon still manifested. Does that mean once a ritual reaches a certain threshold, it becomes unstoppable?'\n\nThe question nagged at him. For decades, the Rebecca Church had kept the Yatan Church suppressed, forced underground, operating in shadows. But how? On paper, the Yatan Church wielded far greater raw power. They commanded great demons, possessed devastating magic, controlled armies of darkness. The Rebecca Church's inability to halt this summoning proved they lacked definitive counter-rituals.\n\nSo why had the Yatan Church spent generations cowering in secret?\n\n'Every nation on the continent backs the Rebecca Church. Political pressure, military support...'\n\nNo. That wasn't enough. Not against beings that could level cities.\n\n'The Rebecca Church is hiding something. Some trump card they've kept concealed all this time.'\n\nIt was the only explanation that made the balance of power make sense.\n\n'I'll need to discuss this with Damian later. For now...'\n\nLauel shook off the tangled thoughts and turned his attention back to the crimson waters. Monsters erupted from the depths with disturbing frequency—things with too many teeth, too many limbs, shapes that hurt to look at. Grid and the meritorious retainers cut them down with methodical efficiency.\n\n'The journey itself is proving profitable.'\n\nThe sea monsters dropped quality loot. The meritorious retainers recovered experience lost during the war, level by level. Strange items filled their inventories—equipment with bizarre properties, materials that defied categorization. Good or bad, they were undeniably rare.\n\n'Grid's reached level 398. Once we establish a secure route, the Red Sea becomes our hunting ground.'\n\nWho would have imagined it? The Red Sea, feared by sailors for centuries, reduced to a farming zone. Only possible because Katz had purchased a warship large enough to weather the supernatural storms. With a vessel this size, even the disaster-ridden Red Sea became navigable.\n\n\"I can't bring myself to kill the octopuses,\" Jishuka said, lips quirking. \"They remind me too much of Vantner.\"\n\nVantner, crowned with his octopus helm, opened his mouth to retort—then caught himself. The protest died in his throat.\n\n\"Agreed,\" Yura added.\n\nGiven Yura's straightforward nature, she wasn't mocking him. She genuinely saw the resemblance.\n\nVantner said nothing. What could he say?\n\nGrid watched the exchange with quiet warmth spreading through his chest. The greatest treasure of this voyage wasn't loot or experience. It was watching Yura integrate with the group. She'd been distant before, keeping everyone at arm's length. But the journey had worn down her walls. She and Jishuka had developed an easy rapport that hadn't existed before.\n\n\"Doesn't this prove Grid sees you as younger?\" Jishuka asked.\n\nThey sat side by side after a brutal hunt—a whale that had dwarfed even the massive octopuses and pufferfish. The conversation flowed easily now, two women united by shared affection for the same man.\n\n\"Youngwoo-ssi gets irritated sometimes, but he never actually mocks people,\" Yura observed.\n\n\"Exactly. When I tease Vantner, Grid just gives me this fond look. Like watching kids play together.\" Jishuka groaned, covering her face. \"I'm trying to be seen as a woman, and instead I come across as a child. This is a disaster. At this rate, I'll be his little sister, not...\"\n\n\"Why are you so funny, Vantner?\" she said instead, deflecting.\n\n\"When was I funny?\"\n\n\"You. The octopus helm. Together. It's too perfect.\"\n\nVantner's eyes glistened suspiciously.\n\nYura hesitated, then spoke. She didn't want to help her competition. Every advantage Jishuka gained was ground Yura lost. But honesty compelled her.\n\n\"You're wrong. I'm the one Youngwoo-ssi sees as just a friend. The way he looks at you is completely different from how he looks at me.\" She met Jishuka's gaze. \"So stop worrying.\"\n\n\"Right. He only stares at my chest,\" Jishuka said with perfect seriousness.\n\nVantner snorted.\n\nYura's gentle expression vanished. \"Vantner. Want to spar?\"\n\n\"...My apologies.\"\n\nFighting Yura would be suicide. She'd reached the National Competition PvP finals. He still had nightmares about watching her duel Zibal, both of them piloting magic machines with inhuman specs. Everyone had predicted she'd be crushed. Instead, she'd fought him to a standstill. Yura was top five in the entire Overgeared Guild, leagues beyond Vantner's weight class.\n\nHe coughed, scrambling for a topic change. \"What happens if another guild catches the great demon first?\"\n\nPlenty of powerful guilds existed beyond Overgeared. None could match their roster of named NPCs, but they were still formidable. Ares and his army. The remnants of the former Seven Guilds. New powers rising in the vacuum left by the Seven Guilds' collapse. Any single guild would fail a great demon raid alone. But if they cooperated...\n\n\"Grid, Mercedes, and Piaro—just those three—cleared something comparable to a great demon raid with that cave cricket. What if hundreds of players united against one demon?\" Vantner shook his head. \"Feels like we're letting a golden opportunity slip away.\"\n\nSeveral meritorious retainers nodded agreement.\n\nGrid remained calm. \"They won't succeed.\"\n\nThe premise was flawed. Yes, the cave cricket's physical specs matched a great demon. But its skills and intelligence fell far short. More importantly...\n\n\"High rankers can't compare to Mercedes and Piaro.\"\n\n\"...Ah.\" Understanding dawned on Vantner's face.\n\nGrid could slaughter hundreds of high rankers single-handedly. Mercedes and Piaro could defeat even Grid. Just because those three could raid the cave cricket didn't mean hundreds of high rankers could replicate the feat against a true great demon.\n\nLauel smiled, cold and calculating. \"We should let people know.\"\n\nThe public had envied Overgeared for monopolizing the Belial raid rewards. Let them understand the truth.\n\n\"We saved the world. And nearly died doing it.\"\n\nGreat demon raids weren't blessings. They were desperate struggles against annihilation. Lauel could still see Piaro's back, the old man preparing to sacrifice everything.\n\nSeveral days later, the captain's shout rang across the deck.\n\n\"Land ahead!\"\n\nThe island rose from the crimson waters, far larger than expected. And above it—clear sky. The first glimpse of blue they'd seen in ten days of sailing through supernatural storms and suffocating fog.\n\n[You have discovered the Ruins of the War God!]\n\n\"Finally,\" someone breathed.\n\n\"It's all jungle past the coast. Limited open space.\" Pon frowned. \"Fighting room for a spear will be tight.\"\n\n\"Based on my experience, the war god's followers favor speed and agility,\" Peak Sword added. \"Jungle combat puts us at a disadvantage. We'll need to leverage the coastal areas.\"\n\nAnticipation rippled through the meritorious retainers. Secret techniques. Legendary skills. The spoils of this place could reshape their combat capabilities.\n\nLauel's thoughts ran in more calculated channels. 'Depending how this unfolds, we might improve relations with the empire.'\n\nGrid pondered something else entirely. 'Pride. The war god's sin was pride, wasn't it?'\n\nHis quest regarding the Seven Malignant Saints didn't directly involve the war god, but curiosity gnawed at him. The war god was considered the strongest divine being. And pride was the first and greatest of the seven sins.\n\n'If we actually encounter him, I'm screwed. But that won't happen.'\n\nThis was the war god. Not some random encounter waiting around every corner.\n\n***\n\n\"I've been on fire for two weeks straight,\" Grenhal said.\n\n\"Invigorating,\" Morse agreed.\n\n\"Indeed,\" Basara added.\n\nThe three dukes had suffered for a fortnight. They'd protected Skunk while his expedition group deciphered stones and murals. They'd kept anxious soldiers from breaking. They'd hunted sea monsters for food. The ruins' difficulty far exceeded expectations, forcing them to handle both critical operations and mundane logistics.\n\nYet none of them regretted it. The suffering had value. It burned away the complacency of court life and rekindled the flames of their youth.\n\n\"I'm inadequate. I'm sorry.\"\n\nSkunk carried guilt like a physical weight. The dukes had saved his life more times than he could count. Two weeks of relentless effort, and he'd barely scratched the surface of the ruins' mysteries. His archaeological expertise, his decoding skills—they weren't enough.\n\nHe'd identified the need for a key on day one. But the method to obtain it remained maddeningly elusive.\n\n'How much longer until I find a lead? I can't even guess.'\n\nTrue exploration required penetrating the jungle. Impossible. Tens of thousands of traps laced the interior, along with war god followers. They needed keys to bypass the trap network. They just had no idea where to find them.\n\n\"Don't blame yourself. Scholars and explorers from my nation are en route. They'll provide substantial assistance,\" Grenhal assured him.\n\n\"That's... actually a relief. Thank you. I'll redouble my efforts.\"\n\nSkunk relaxed marginally. The situation had deteriorated to the point where he welcomed help, despite usually preferring to solve mysteries alone.\n\nAnother day passed.\n\nThen the next.\n\n\"Wait...\" Skunk stared at a mural he'd discovered two days prior, and understanding struck like lightning.\n\nHis gaze locked onto the booklet depicted in the carving. Every mural he'd found contained this same element. He'd interpreted it as a symbol of the war god's secret techniques—natural enough for murals in the War God's Ruins.\n\nBut now he saw deeper meaning.\n\n'I thought the booklets varied because they represented different secret techniques...'\n\nThe keyhole's shape flashed through his mind. He overlaid it with the booklets from all seven murals. Perfect alignment.\n\n'The key is fragmented.'\n\nThe murals weren't just decoration. They were a map, showing where each piece could be found.\n\n'Yes.'\n\nSkunk's hands clenched into triumphant fists. He'd cracked the code. Now the real work could begin."
}