{
  "id": 1021,
  "title": "Chapter 1020",
  "content": "**Rewritten Text:**\n\nThe guardians of the War God's Ruins employed vastly different combat styles depending on which secret techniques they'd mastered, but they shared one undeniable commonality: their strength defied all reasonable expectations of the imperial soldiers, regardless of which arts they'd learned.\n\nTheir movements, however, followed strict patterns. They patrolled exclusively within the jungle's depths, never venturing to the outer edges or approaching the coastline. This limitation allowed the imperial forces to operate with relative freedom in the coastal areas. Until circumstances changed.\n\n\"At our current rate, we'll be out of drinking water in three days.\"\n\nThe warship's supply reserves were nearly depleted. An inevitable problem—fresh water was impossible to find along the coast. Replenishing their stores meant penetrating deep into the jungle to locate lakes or streams.\n\nDuke Grenhal, Morse, and Basara exchanged weighted glances. Reinforcements carrying additional supplies were en route, but their arrival had been delayed. The Red Sea's treacherous waters made any timeline uncertain, and with no means of communication, confirmation was impossible. They couldn't afford to wait.\n\n\"We'll have to retrieve it ourselves.\"\n\nThe decision hung heavy in the air. Entering the jungle was no minor undertaking. If six followers—each having mastered five secret techniques—attacked in concert, even the three dukes would face serious danger. Surrounded by dozens of these guardians? Elimination would be certain.\n\nThe traps posed an even graver threat. The ruins were riddled with mechanisms capable of killing a duke outright—deadly contraptions impossible to bypass without specific keys. Fighting the followers while navigating such hazards would stretch them dangerously thin.\n\nYet there was no choice.\n\n\"Let's go.\"\n\nFive thousand soldiers depended on them—the private forces they'd brought from their own estates. These men had helped restore their families' fortunes and honor. They couldn't be left to die of thirst. Duty and pride demanded no less.\n\n\"My lord...\" The soldiers' eyes gleamed with moisture. They understood perfectly what their lords were risking on their behalf.\n\nMorse clicked his tongue at their guilt-stricken faces. \"Have we grown so feeble that *you* worry for *us*? I've demonstrated repeatedly that these followers are manageable. You showed no such concern then.\"\n\n\"We will do better!\" The soldiers straightened, eyes blazing with renewed determination. Morse's confidence reshaped their perspective—the dukes still had matters well in hand.\n\nThe knights, however, knew better. Trained directly by the dukes, they recognized the tension their masters concealed. Their expressions remained grim.\n\n\"We're departing. Guard Skunk and the barracks until we return.\"\n\n\"Yes, my lord!\"\n\n\"Understood!\"\n\nKnights and soldiers responded with unified resolve.\n\n***\n\n[You have entered the Ruins of the War God.]\n\n[Traces of the War God can be found here.]\n\n[Warning! There is no resurrection point in the Red Sea. Death will result in forced expulsion beyond the Red Sea.]\n\n\"Breathtaking.\"\n\nGolden-white sand sparkled beneath brilliant sunlight, blending seamlessly with crystal-clear emerald waters. Grid and the ten meritorious retainers leaped from the warship's upper deck—equivalent to a ten-story building—and landed on the pristine beach.\n\nThe natural beauty before them stirred something primal. Such splendor was rare even in reality.\n\nHurent, however, remained unmoved.\n\n*I'm completely out of my depth.*\n\nThe caliber of his companions was staggering. He still couldn't comprehend why Grid had included him—someone so clearly unqualified—among such titans.\n\n*Am I supposed to learn by observation?*\n\nDuring their ten-day voyage, the Overgeared members had demonstrated abilities that bordered on the absurd.\n\nKatz had slaughtered a sea monster with a *normal-grade* weapon. Regas had maintained his fighting spirit through constant combat, actually requesting to PK his own guildmates while simultaneously battling sea creatures. Hurent had lost count of how many times he'd stared in disbelief as Regas dodged attacks from all directions while dealing devastating damage.\n\nLauel had dispersed entire swarms of predatory fish with casual waves of force. Chris had pulverized octopi and other leviathans with raw power. Grid had deployed his cat and skeleton minions to farm experience from the monsters, treating apocalyptic sea battles as leveling opportunities. The entire voyage had felt like watching demonic training regimens.\n\nAnd Euphemina? She'd done absolutely nothing. Just stood there. Yet her companions had willingly shared their experience gains with her.\n\n*Insanity.*\n\nReflecting on it now made it seem even more incomprehensible. No one would believe him if he recounted what he'd witnessed.\n\n*I have to learn from them.*\n\nThe world-class players of the new generation—he would absorb their techniques through observation. Grid's intentions were transparent. He expected Hurent to rise to their level, to unlock the potential that had once made him a legend of the old era.\n\n*He wants me to evolve. To become one of his pillars.*\n\nThe thought made Hurent's chest tighten with inadequacy. He'd done nothing but coast along during the journey. Despite his best efforts, he remained fundamentally unchanged.\n\n*I've already given everything I have.*\n\nHis training under Piaro had pushed him to unprecedented growth. Yet here he stood, still merely on par with Haster—who Grid had thoroughly dismantled at the National Competition. Despite all his efforts, Hurent hadn't truly evolved beyond his former self.\n\n*Expecting more from me is a mistake.*\n\n\"The jungle's interior is dangerous,\" Lauel's voice cut through Hurent's bitter musings, \"but the coast should be secure. The War God's followers rely on martial arts and precise footwork. They won't risk combat on sandy beaches where their footing is compromised. We're safe here.\"\n\nLauel's primary class was Qigong Master. His senses were razor-sharp, his ability to read monster behavior unmatched. If he declared the coast a safe zone, it was.\n\n\"We'll avoid the jungle for now and scout the coastline. We need suitable locations for establishing our base camp. The empire's forces should be stationed somewhere nearby. Let's split up and survey the area. Reconvene here in two hours.\"\n\n\"Understood.\" Grid nodded readily, the decisive ruler entrusting such matters to Lauel's expertise.\n\n\"If we encounter imperial forces?\" Katz asked.\n\n\"Avoid engagement. Minimize friction with the empire at all costs. Our numbers are limited, and being discovered would be disadvantageous.\"\n\n\"Stealth operations. Got it.\" Katz nodded, and the group dispersed.\n\nGrid and the ten meritorious retainers scattered in various directions. Some went solo, others paired off. Monster encounters on the beach were unlikely—this was purely reconnaissance. Moving as a group would be inefficient.\n\n\"Care to partner up?\" Lauel approached Hurent, who'd been standing alone. They'd been paired during the first National Competition; there was familiarity between them.\n\nHurent shook his head. \"Don't worry about me. Go on ahead.\"\n\n\"Alright. See you at the rendezvous.\"\n\n\"Yeah...\"\n\nHurent began walking.\n\nSome time later, as he followed the waterline admiring the gentle waves, he froze.\n\n*Why is a follower here?*\n\nIn the distance, a group was in distress. Roughly ten players, all clearly non-combat classes based on their equipment.\n\n*Not the empire. An independent expedition that followed the world message, like us.*\n\nThey showed no hostile intent. Relieved, Hurent concealed himself and observed. A woman with the ridiculous username \"Dog Woman\" was leading the group.\n\n\"Jaguar and I will hold it off. The rest of you—run! Tell the captain the followers' patrol range has expanded beyond the jungle.\"\n\nA War God follower stood before them. A muscular figure in worn clothing, the designation floating above his head: *War God Follower Who Has Learned Five Secret Techniques*. White text—indicating a normal-grade monster.\n\n*A normal-grade follower? Not elite-tier?*\n\nHurent had been briefed extensively. The War God followers at Galgunos Temple were elite-tier terrors that required pairs of meritorious retainers to defeat. Genuinely fearsome opponents.\n\n*But this one's normal-grade. Must be different from the ones Pon and Regas described.*\n\nBesides, Lauel had declared the coast safe. This follower couldn't be too dangerous.\n\n*Not my problem.*\n\nLauel had emphasized stealth. Whether this party survived or not wasn't his concern.\n\n\"Kyaaah!\"\n\n\"D-Dog Woman!\"\n\n\"Idiots, I told you to run!\"\n\nThe woman wielded a wooden shield, throwing herself between her companions and the follower. Admirable. She was sent flying from a single kick, critically wounded. Her party was pathetically weak.\n\n*...Maybe I should help?*\n\nHurent was weak too. He understood their position intimately—what it felt like to be inadequate. Watching people like himself suffer stirred something uncomfortable in his chest.\n\nHe made his decision.\n\n\"As long as they don't learn my identity.\" He pulled Piaro's straw hat low over his face and stepped onto the battlefield. \"Hey.\"\n\n\"...?\"\n\n\"...?\"\n\nThe War God follower and Dog Woman both turned, bewildered. A mysterious figure in a straw hat had appeared, completely relaxed despite the crisis.\n\n\"W-Who are you?\"\n\nHad imperial reinforcements already reached the ruins? Dog Woman tensed, demanding identification.\n\n\"A farmer.\" Hurent's reply was curt as he drew his sword.\n\nThe follower exploded into motion. One instant he was standing still—the next, his foot was driving toward Hurent's face. Hurent barely raised his shield in time.\n\n*Stronger than I anticipated.*\n\nHe suppressed a groan. Already in danger from a normal-grade mob.\n\n*They warned me the difficulty here was high.*\n\nBut struggling against a *normal-tier* monster? Humiliating.\n\nThe follower unleashed a barrage of strikes—kicks and punches hammering against Hurent's defenses. His aura shield's damage absorption was overwhelmed instantly. He channeled aura throughout his body, amplifying his movement speed, and escaped the assault range.\n\n\"Incredible...\" Dog Woman and her companions watched in awe.\n\nPerhaps the sandy terrain weakened the follower slightly compared to its jungle counterparts, but only marginally. These War God followers were monsters in the truest sense—even the Seven Dukes struggled against their martial prowess. Yet this mysterious man was holding his own. His speed matched the dukes'. Definitely a top-tier ranker.\n\nThe follower closed the distance, spinning into a devastating roundhouse kick aimed at Hurent's jaw. The impact sent stars across Hurent's vision—he nearly succumbed to the stun effect, but his high resistance kept him conscious.\n\nHe activated his ultimate technique.\n\n[Aura Impact has been activated.]\n\n[Visualize the aura's form within 2 seconds. Any deviation in the mental image will result in failure.]\n\nTwo seconds—an eternity against a War God follower.\n\nThe guardian's elbow crashed into Hurent's sternum. Blood sprayed from his mouth. Yet somehow, through sheer force of will, he maintained his concentration.\n\n\"Rain.\"\n\nThe miracle manifested.\n\nAbove the follower's head, aura materialized as countless blade-like droplets, crashing down in a devastating deluge. The guardian convulsed, crying out in agony. \n\nThis was the inherent weakness of humanoid monsters—their low health pools made them vulnerable despite their overwhelming technique. And this vulnerability was the domain of Hurent: one of the Five Miracles, a Sword Saint candidate, and an Aura Master."
}