{
  "id": 1022,
  "title": "Chapter 1021",
  "content": "Ten years. A decade-long journey, finally complete.\n\nImperial Prince Benoit stared at the evidence in his hands—proof provided by Great Demon Berith. A truth he'd known from the beginning, yet had desperately hoped was false. Complex emotions surged through him as certainty replaced hope.\n\n\"Imperial Prince! Your Highness!\"\n\nThe call echoed across the desert road. Benoit turned his head briefly, then continued walking without acknowledgment. His pilgrim's disguise was convincing—threadbare robes, gaunt frame, unkempt beard flowing down his chest. Passersby greeted him with respect, oblivious to the traitor in their midst.\n\nBut not everyone was fooled.\n\n\"Your Highness!\" \n\nA figure sprinted ahead, cutting off his path. Chensler, bearing the demon mark that bound him to eternal service, stood before him with barely concealed urgency.\n\n\"Sir Chensler.\" Benoit's tone held no surprise.\n\nOf course the Five Pillars could pierce his disguise. His red energy—the telltale sign of the imperial bloodline—blazed like a beacon to those with the senses to perceive it.\n\n\"I traced the priest who conducted the great demon summoning ritual. The trail led here.\"\n\n\"The priest?\" Benoit's laugh was bitter. \"Is that what the Rebecca Church calls me now?\"\n\n\"They don't know your true identity.\"\n\n\"How considerate of them.\" Benoit's smile turned sharp. \"Don't misunderstand—I'm not hiding for the Empire's sake. The Yatan Church knows exactly who I am. Soon the entire world will know that an imperial prince summoned a great demon.\"\n\nChensler's jaw tightened. \"Why?\"\n\n\"Worried the Rebecca Church will blame the Empire?\"\n\n\"Politics don't concern me. I worry for His Majesty.\"\n\n\"How peculiar you are, Sir Chensler. Unlike the other Pillars, your loyalty to His Majesty seems genuine.\"\n\n\"The others are equally loyal. Sir Bain especially—\"\n\n\"Are they?\" Benoit's interruption was casual, almost dismissive. \"Regardless... His Majesty knew what I was doing all along.\"\n\n\"His Majesty knows all that transpires within the Empire.\"\n\nThe words struck Benoit like a physical blow. *The blind fool who believed his wife died of illness knew everything?*\n\n\"Kuk...! Kukukuk! Kuhahahaha!\"\n\nLaughter erupted from Benoit's throat—harsh, manic, spiraling toward hysteria. He'd prepared himself for condemnation, committed atrocities while shouldering the burden alone. And all along...\n\n\"Do you truly believe that, Sir Chensler?\" His voice dropped to something dangerous. \"That His Majesty knows everything? When it took *me* over ten years to uncover this truth?\"\n\n\"Your investigation required secrecy. That takes time.\"\n\n\"Of course it required secrecy! Can you imagine the scandal if people learned an imperial prince was summoning great demons?\" Benoit's killing intent, barely restrained until now, flared with renewed vigor.\n\n\"Please mind your tongue.\"\n\n\"Fine. Enough talk.\" Benoit adjusted his robes. \"Let's return to the Empire. I was heading back anyway.\"\n\n***\n\n\"Kuoong...\" \n\nHurent's blade sang through the air one final time. The war god follower collapsed, dissolving into ash.\n\n*This place is insane.* He'd burned through every ultimate technique, expended all his resources. The follower's strength far exceeded his expectations.\n\nNo—that wasn't quite right. The follower wasn't abnormally strong. Hurent was simply too weak.\n\nToo many powerful opponents existed in Satisfy now, each one pushing themselves to the brink of death to grow stronger. The subconscious desire to reclaim his former glory gnawed at him constantly. \n\n*Maybe I should just quit.*\n\nHe smiled despite himself, watching the experience notification flood his vision. The amount rivaled a boss monster kill—more than twice what he'd gained from the sea creatures.\n\n*I'm weak, but at least this bastard was strong.*\n\nHurent shook his head and retrieved the secret technique fragment from the follower's remains.\n\n\"Aura Master...\"\n\nA woman's voice drifted from nearby. Hurent glanced toward the expedition members who'd witnessed the entire battle. Recognition gleamed in their eyes.\n\n*Of course they know.* He'd used too many distinctive skills fighting that monster. Anyone familiar with the old rankings would recognize his style.\n\nThe expedition leader—a sharp-eyed woman—studied him with barely contained excitement. She'd watched him defeat the follower in under two minutes. The Seven Dukes had taken over three. The difference was stark.\n\n*We have to recruit him.*\n\n\"Thank you for saving us,\" she said, approaching with a respectful bow. \"Without your intervention, we'd all be respawning outside the Red Sea by now. It's an honor to meet you, Hurent.\"\n\n\"Mm.\" No point denying it. Hurent switched his guild affiliation to private and removed his straw hat, revealing close-cropped gray hair and a weathered face.\n\nThe woman's eyes lit up with confirmation. \"We're with the Skunk Expedition Group, currently exploring the Ruins of the War God alongside the imperial army. Several of the Seven Dukes are with us.\"\n\n*The Seven Dukes?*\n\n\"You appear to be alone. Why not join our expedition? Your combat ability would be invaluable. Plus, it's an opportunity to establish connections with the Dukes. I think you'd find the arrangement beneficial.\"\n\n\"Hrm.\"\n\nHurent scratched his cheek, considering. \"Is there a camp nearby?\"\n\n\"Not particularly. Six kilometers east. We left briefly to investigate some clues.\"\n\n\"Without an escort?\"\n\n\"We had imperial soldiers. The follower killed them before you arrived.\"\n\n\"I see.\" He paused. \"What kind of clues?\"\n\nThe woman hesitated briefly. He was persistent with his questions. Then again, she'd invited him—he had every right to assess whether they'd be worth his time.\n\n\"Navigation keys for the jungle traps.\"\n\n\"Jungle traps?\"\n\nShe explained the trap-riddled jungle interior, the key pieces needed to safely traverse it.\n\n*Lauel will want this intelligence.* \n\nHurent felt a spark of satisfaction. This information alone made the detour worthwhile. He'd worried about arriving empty-handed.\n\n\"Thank you for sharing that, but I'll have to decline your offer.\"\n\n\"What? But traveling alone is dangerous—wait, do you have companions?\"\n\n\"I do.\"\n\n\"Oh...\" The woman looked briefly regretful about revealing so much. Then she reconsidered. *He'll discover it eventually anyway.*\n\nBesides, Hurent had saved their lives. This information was fair payment. She extended her hand. \"Good luck with your expedition.\"\n\n\"Companions...\" Hurent repeated softly.\n\nHe'd joined the Overgeared Guild after losing to Haster, but never felt like he truly belonged. Grid had earned his gratitude, certainly. But the ten meritorious retainers he'd traveled here with? He'd never considered them companions.\n\nAnd yet...\n\n*It's not unpleasant.*\n\nAge had taught him how rare genuine friendship was. Over the past ten days, he'd observed the Overgeared members—their trust, their loyalty, the authentic bonds between them. They were good people.\n\n\"It's not bad,\" he murmured.\n\n\"Pardon?\"\n\n\"Nothing. Just thinking aloud.\" Hurent clasped her hand, meeting her eyes. \"Stay safe out there.\"\n\n\"Ah! Yes! You as well, senior! This was an honor!\" \n\nShe watched him disappear into the jungle, heart racing slightly. The legendary Aura Master, even in semi-retirement, commanded respect.\n\n***\n\n\"This is... not what I expected.\"\n\nGrid hovered above the western coastline, Noe perched on his shoulder. Below, the Overgeared Skeletons were engaged in their earnest battle against rock shells.\n\nLevel 250 non-aggressive mobs with terrible loot tables. Grid wouldn't waste time on them normally.\n\nBut for the Overgeared Skeletons? Paradise.\n\nThey attacked with the intensity of sworn rivals, weapons clanging against impenetrable shells. The rock shells barely reacted, yet the skeletons persisted with almost touching determination.\n\n*They're hungry for growth.*\n\nGrid had been deliberating for months, but watching them now solidified his decision. Two item creation slots invested in the skeletons weren't a loss—not if they continued developing at this rate. Long-term, empowering them would pay dividends.\n\n\"Hm?\"\n\nArms crossed in his characteristic floating stance, Grid's head snapped toward the jungle. The distinct ring of metal on metal echoed through the trees.\n\n*Imperial army versus followers?*\n\nIntelligence was victory. He should scout the enemy's capabilities. Grid concealed himself with Stealth and considered entering the jungle.\n\nThe deliberation was brief.\n\n*Too risky. The Seven Dukes are probably in there.*\n\nBeing caught between Dukes and war god followers guaranteed death. Respawning outside the Red Sea would waste weeks of travel. He recalled his battle with Sky King Rigal—how he'd fought with one eye effectively closed, refusing to activate the Castration Eye.\n\nThe Seven Dukes wouldn't grant him that luxury. He'd need both eyes, full vision, maximum focus. Which meant rapid mana depletion from the evil eye's power. He'd be limited to Pagma's Swordsmanship and the 100,000 Army techniques.\n\n*Lauel warned me repeatedly. Don't get greedy.*\n\nGrid suppressed his curiosity and descended. The skeletons had finally finished their rock shell and were exchanging enthusiastic high-fives.\n\n\"We'll push a bit further, then head back to the meeting point. Wait...\"\n\nGrid's enhanced stats granted him exceptional vision—not quite Hawk Eyes, but superior to most players. Something on the jungle's edge caught his attention.\n\nSeveral massive trees bore keyhole-shaped markings. No—not markings. Actual keyholes.\n\n\"Why would a tree have a keyhole?\"\n\n\"Isn't it obvious, nyong?\" Noe offered helpfully.\n\n\"Obvious how?\"\n\n\"It opens something, nyong.\"\n\n\"How refreshingly simple...\"\n\nThough admittedly correct.\n\n*Wonder what's inside?*\n\nGrid produced the Master Key he'd crafted ages ago for the Behen Archipelago.\n\n***\n\nMeanwhile, deeper in the jungle...\n\n\"This is insane!\"\n\nThe Dukes ran for their lives. Expensive armor torn and dented, faces streaked with blood and sweat. Even Basara—who maintained perfect composure in court—fled desperately, her gold crown askew.\n\nTwenty war god followers pursued them through the trap-laden jungle.\n\n\"Damn it!\" Morse triggered another trap, crying out as it mangled his ankle. He spun, eyes bloodshot, watching the followers sprint freely through terrain that treated the Dukes like prey.\n\n\"It's not fair!\"\n\nThe traps were invisible—perfectly integrated with the environment. Vines, leaves, soil itself—all potential triggers. Occasionally they'd avoid one through luck, but with dozens of traps per hundred meters, sustained progress was impossible.\n\nWorse, the traps didn't respond to the followers at all. As if recognizing their masters.\n\nFighting here was suicide.\n\nAn arrow grazed Morse's ear. Pain flared, but he swallowed his rage. The magic bag of lake water slung across his shoulder—the soldiers needed it. That mattered more than revenge.\n\n\"Wait—\" Several paces ahead, Grenhal stopped abruptly. Basara and Morse skidded to a halt beside him.\n\nA wall of barbed vines blocked their path, rotating teeth whirring hungrily.\n\n\"We'll have to go around.\"\n\nBehind them, the followers closed in.\n\n\"I'll buy you time.\" Grenhal thrust the water bag at them.\n\n\"Duke Grenhal, don't be ridiculous—\"\n\n\"Unlike you youngsters, my children are grown. My family line continues without me. His Majesty will provide for them.\" His tone brooked no argument. Once Grenhal decided something, persuasion was futile.\n\nBasara and Morse prepared to flee.\n\nThen the rotating teeth *stopped.*\n\nThe vine nets retracted. Poisonous flowers wilted and fell. Every trap within sight simultaneously deactivated.\n\n\"...What?\"\n\nThe Dukes exchanged bewildered glances. In the distance, through gaps in the foliage, a figure became visible.\n\n\"Nothing happened when I inserted the key??\"\n\nThe voice was distant but familiar.\n\n\"The Overgeared King?\"\n\nYesterday's enemy. Today's savior.\n\nThe political landscape just shifted. A victory won without a single blow exchanged."
}