{
  "id": 1024,
  "title": "Chapter 1023",
  "content": "\"Where the hell is he?\"\n\nBack at the rendezvous point, the ten meritorious retainers were growing restless.\n\n\"Did something happen?\" Vantner paced back and forth. \"He's not answering whispers.\"\n\nFifteen minutes past the agreed time. Grid still hadn't shown.\n\nLogic said he'd be fine—he was leagues stronger than any of them. What could trap them would barely slow him down. But logic didn't stop them from worrying. They were his friends, after all.\n\n\"He'll be okay.\" Jishuka forced confidence into her voice. \"Lauel said the waterfront was clear.\"\n\nBut her eyes betrayed her anxiety. The ruins remained a mystery—who knew what lurked in the unexplored sections? The longer Grid's absence stretched, the darker the mood became.\n\n\"...!?\"\n\nLauel's head snapped up. Beside him, Faker's eyes narrowed.\n\nThey felt it simultaneously—three monstrous presences bearing down on them. Not trying to hide. Not attempting stealth. Raw power, unleashed and unfiltered, roaring across the beach like a challenge to the world itself.\n\n\"What the—\" Jishuka's breath caught.\n\nSomething massive crested the dunes. No—two somethings. What she'd initially mistaken for boulders resolved into muscle and fur. Beasts. Enormous ones.\n\n\"Battle formation!\" Lauel's command cracked like a whip.\n\nFaker melted into the shadows. The others drew weapons in perfect unison. Even Euphemina, who'd conserved her copied skills throughout the entire voyage, activated her orb.\n\n[You have discovered a strong person of this era!]\n\n[You are overwhelmed.]\n\n[You cannot move. All stats are slightly reduced.]\n\nThe notification windows appeared like death sentences.\n\nFootprints the size of craters marred the sand. A two-headed hippopotamus—if something that huge could be called a hippopotamus—advanced across the beach. Muscles rippled beneath its hide like shifting tectonic plates. Beside it prowled a sharvel tiger, its fangs long enough to skewer a man lengthwise.\n\nThe meritorious retainers stood frozen, unable to even swallow.\n\nThree figures rode the beasts. A rebellious-looking man and a beautiful woman wearing a golden crown sat astride the tiger. The hippopotamus bore a middle-aged man whose tranquil eyes somehow made him more terrifying. Above their heads, names shimmered in gold:\n\n**Beast King Morse**\n**Gold Crown Basara**  \n**Immortal King Grenhal**\n\n\"Dukes...\" Lauel's voice was barely a whisper.\n\nThis was true power. Absolute power. Just meeting Grenhal's gaze felt like drowning. His eyes held the promise of violence—the calm before a hurricane. They would have to face these monsters eventually, but right now? The gap was insurmountable. Even thinking about fighting seemed like arrogance.\n\n\"The moment the effect breaks,\" Lauel hissed through clenched teeth, \"get to the ship. Run.\"\n\n\"Like hell.\"\n\nYura stepped forward—the only one still moving. She was a legend too, even if she was weaker than the previous generation. She wouldn't cower.\n\nWhite armor materialized around her body, summoned by jade magic power. **Demon Predator**—a unique-rated class item she'd earned in hell, with performance exceeding most legendary armor. Alex's magic engineering bayonet shifted into sword form.\n\nPerfect combat stance.\n\nYura's blood ran cold. If the dukes were here, then Grid...\n\nBut she couldn't think about that. Right now, she had to buy time for the others to escape.\n\n\"Where exactly,\" Morse drawled, \"are you running to?\"\n\nThe casual tone seemed at odds with his title. His gaze shifted past Grenhal. The meritorious retainers followed his eyes—\n\nAnd froze.\n\nGrid sat behind Grenhal on the hippopotamus, looking slightly ill.\n\n\"YOU BASTARDS!\" Jishuka's voice cracked with rage.\n\nShe tried to draw her bow, but her fingers wouldn't respond. Even with her status resistance approaching thirty percent, the abnormal condition held firm.\n\n\"RELEASE HIM RIGHT NOW!\"\n\nGrid opened his mouth to ask why exactly he was \"hers,\" but Yura was already moving.\n\nShe launched herself at Grenhal, blade driving toward his throat.\n\nThe duke didn't even bother with a shield. His gauntlet intercepted the strike, twisted—and Yura found her own weapon used against her. Grenhal's grip locked around the blade.\n\n*No—*\n\nBefore she could process it, she was airborne. The sand rushed up to meet her.\n\nThe power gap was absolute.\n\nYura's obsidian eyes trembled, but she forced herself up almost immediately. If she could use Hell Leap, teleport behind them, maybe—\n\n\"WAIT! STOP! EVERYONE CALM DOWN!\"\n\nGrid practically fell off the hippopotamus in his haste to dismount. His movements were completely unrestricted.\n\n\"Ugh.\" He looked vaguely green. \"I'm never riding that thing again. Felt like the world's worst roller coaster.\"\n\nHe shot Grenhal a resentful look before turning to his companions. \"As you can see—these are imperial dukes. They'll be working with us while we explore the ruins.\"\n\n\"*What?*\"\n\n\"*Huh?*\"\n\nThe meritorious retainers stared at him like he'd grown a second head.\n\nThey'd witnessed countless surprises since joining Grid's service, but this topped them all. In the span of—what, an hour?—he'd somehow converted three enemy dukes into allies?\n\n\"A human magnet...\" Lauel breathed. \"He's an actual human magnet.\"\n\nPiaro. Asmophel. Bland. Sticks. Mercedes. Half the East Continent. And now imperial dukes. Grid collected powerful allies like other people collected pocket change.\n\nLauel began clapping silently.\n\n---\n\n\"This is... interesting.\"\n\nSkunk's eyes gleamed as Dog Woman delivered her report. Followers had appeared on the coast. The dukes who'd gone for water hadn't returned. Then the Aura Master had shown up and helped her party clear the jungle encounter.\n\n*He seems righteous,* Skunk thought. *In a worst-case scenario, we could depend on him.*\n\nWithout the dukes, they were trapped. No way to explore the ruins properly. No way to cross the Red Sea. They'd be stuck here until they died or logged out in disgrace.\n\nBut if they could secure the Aura Master's help... That might work. A mutually beneficial arrangement—they had exploration expertise, he had combat power.\n\n*Still, that's worst case. The dukes will return safely. They have to.*\n\nSkunk shook his head, focusing back on his work. No point borrowing trouble. Better to keep searching for the key pieces.\n\n*Won't be long now.*\n\nEven with advanced archaeology and deciphering skills, some clues had remained stubbornly opaque. The ruins held too many unanswered questions. But slowly, painstakingly, patterns were emerging.\n\nHe'd lost sleep poring over the old books in his inventory. Worked until his eyes burned. The saying \"worked hard enough to shed blood\" might be an exaggeration, but not by much.\n\nAnd it was paying off. He was close—so close—to locating the key pieces.\n\n\"THE DUKES ARE BACK!\"\n\nDog Woman burst into the barracks, grinning ear to ear. Skunk shot to his feet and rushed outside. Soldiers shouted excitedly around piles of fresh drinking water.\n\nSkunk approached the three nobles, relief flooding through him. \"Thank god you made it back safely.\"\n\n\"Were you worried?\" Grenhal's tone was mild.\n\n\"I know you're strong, but the jungle is treacherous. Those traps—\"\n\n\"Already solved.\"\n\n\"I...\" Skunk blinked. \"What?\"\n\n\"This person of distinction obtained the key.\"\n\nThe words didn't compute. Skunk's mind went blank. Surely \"key\" didn't mean *the* key. Surely \"traps\" didn't mean—\n\n\"Allow me to introduce the Overgeared King.\"\n\n\"*WHAT?!*\"\n\nEverything clicked into focus at once. The man with black hair stepping forward. That familiar face.\n\n\"P-Person of distinction?\"\n\n\"*GRID?!*\"\n\n*The traps were solved. The key was obtained.*\n\nSkunk's brain struggled to process Duke Grenhal's casual bombshell.\n\nHe seized Grid's hand, pumping it enthusiastically. \"I've been here for days and haven't found a single key piece! And you've already completed it? How? Your exploration skills must be incredible!\"\n\nIt made sense, in retrospect. Skunk knew from the Sword Grave incident that Grid had eyes and ears across the continent. His information network was frightening. And Hurent—the so-called retired Aura Master—must be working for him.\n\n*Of course. Grid's been hiring explorer rankers. Probably has several teams working for him.*\n\nThat would explain it. Multiple elite teams, working together, pooling information...\n\n\"Can you introduce me to them?\" Skunk asked eagerly.\n\n\"Them?\"\n\n\"The other explorers. The ones who gathered the key pieces.\"\n\n\"There are no other explorers...?\"\n\n\"Then how did you get the key?\"\n\n\"I already had it.\"\n\n\"...What?\"\n\nThe conversation derailed somewhere. Skunk's confusion mounted—then crystallized into understanding.\n\n*Wait.*\n\nThe Overgeared Kingdom and the Empire were at war. Grid and these dukes should be mortal enemies. Yet here they were, cooperating naturally. And Grid's answer about \"already having the key\" made no sense unless...\n\nUnless Grid himself didn't know what the key was.\n\n*He tricked them.* \n\nThe realization hit like lightning. *He deceived the dukes into thinking he had the key, approached them using some scheme, and somehow convinced them to ally with him!*\n\nWhat kind of strategy could fool three imperial dukes? What battle must have transpired that Skunk couldn't even imagine?\n\n'He's not just strong—he's brilliant. Wise. Cautious!'\n\nSkunk's eyes shone like lanterns as he studied Grid with newfound respect.\n\nHe'd never expected to feel such genuine admiration for someone younger than himself. It was refreshing. Shocking. *Exhilarating.*\n\n\"Grid!\" Skunk grabbed his shoulders. \"What are your hobbies? What do you do when you're not playing? What's your birthday? Blood type? Tell me about your family!\"\n\n*This guy is insane,* Grid thought, slightly alarmed by the intensity.\n\nMeanwhile, Lauel smiled serenely.\n\n*Human magnet. Well done, Your Majesty. Well done.*"
}