{
  "id": 1025,
  "title": "Chapter 1024",
  "content": "The emergence of Great Demon Berith drew players like moths to flame. They saw wealth and glory in the legendary raid, and ambitious rankers and guilds threw themselves at the challenge. Even forces that had lurked in the shadows, gathering strength in secret, finally stepped into the light.\n\nEvery single one of them was crushed.\n\nDozens fell. Then hundreds. Sometimes thousands perished before Berith's deceptions and alchemical horrors. The great demon's wrath didn't end with slaughter—every inch of ground he trod turned to ash and ruin. Two eastern kingdoms bore the brunt of the devastation.\n\n[Sagaltina City in the Haken Kingdom has been destroyed.]\n\n[Agarna City in the Haken Kingdom has been destroyed.]\n\n[Germon City in the Rotemon Kingdom has been destroyed.]\n\n[The Rotemon Kingdom...]\n\nDozens of settlements vanished from the map. Not even standing armies could halt his advance. Panic rippled through the player base as hunting grounds and facilities disappeared beneath the demon's shadow. Their livelihoods were burning, and with each lost territory, opportunity died.\n\nThe forums erupted:\n\n—We need to kill Berith. NOW.\n\n—If this keeps up, there won't be anything left for us.\n\n—Where are the rankers? They need to work together for once.\n\nWhat began as a gold rush transformed into a crusade. Guilds rallied not just for wealth, but for survival and heroism. Rankers set aside their rivalries and formed unprecedented alliances. They marched on Berith as one.\n\nAnd they were annihilated again.\n\nThe Ares Army led a massive expedition—the largest yet—and managed to reduce Berith's health by thirty percent. Then the demon shifted into a new phase, and the expedition collapsed twice as fast as it had formed.\n\nWorse followed. Berith had harvested enough souls from the slaughter to fuel a ritual. He summoned his first army, and with demonic reinforcements at his back, his power swelled. The continent's devastation accelerated.\n\nThe Haken and Rotemon Kingdoms teetered on the brink of total collapse. Players who'd made those regions their home faced ruin. The great demon's rampage shattered the established order, and countless players suffered as the world they knew crumbled. The Berith raid was no longer about profit or fame—it had become a crisis that threatened everyone.\n\nThe nervous masses turned their fury toward a new target. Why wasn't the Overgeared Guild stepping up? How could they turn their backs on this catastrophe? They were called irresponsible. Selfish. Cowards.\n\nThe irony was almost beautiful. These same people had screamed bloody murder when Overgeared monopolized the Belial raid. Now they condemned the guild for *not* monopolizing the Berith raid. The hypocrisy wasn't universal, of course—but enough voices joined the chorus to create an ugly noise.\n\nLauel didn't spare them a second thought. The Overgeared Guild was a private organization. They had no obligation to throw themselves into the meat grinder just because the mob demanded it. Besides, he had perfectly sound reasoning.\n\n*We can't afford to challenge Berith yet. Our top priority is recovering from the war and exploring the ruins. There's also a non-zero chance that Belial's territory gets raided while we're away.*\n\nHe logged out due to connection time limits and sent the message to all guild members via email after scanning the news articles and public opinion. Nobody disputed it.\n\n***\n\nIn the imperial barracks, Grid sat across from the 10 meritorious retainers, three dukes, and Skunk. Duke Grenhal had positioned himself directly opposite Grid—a subtle assertion of authority that marked him as first among the imperial nobility.\n\n\"Since we're working together now, we'll be forthright about our situation and share what intelligence we've gathered.\" Grenhal's gaze shifted to Basara.\n\nThe duchess took over smoothly. \"We have 4,959 soldiers and 300 knights. A total of 5,259 personnel. But the soldiers are useless against the followers, and the knights are helpless against the traps. The three of us\"—she gestured at herself and the other two dukes—\"have been the only effective combat force.\"\n\nThe imperial army, struggling on a single small island. It was almost impossible to believe that three of the empire's legendary dukes had been stymied here.\n\n\"However, the situation has changed. Your Majesty possesses the key. Going forward, we can incorporate the knights into our fighting strength. They're skilled—eight working together should be able to handle one follower.\"\n\nPeak Sword's eyebrows climbed toward his hairline. He and the other meritorious retainers had fought followers who'd learned two secret techniques. When they'd first encountered them, it took *two* of the meritorious retainers working in tandem to bring one down. That was months ago. By now, they should be capable of one-on-one fights.\n\nYet the duchess was saying it took *eight* imperial knights to match a single follower? Peak Sword couldn't suppress a slight smirk.\n\n*The dukes' knights are weaker than us.*\n\nAs expected, the 10 meritorious retainers were powerhouses. Sure, they looked like background decoration compared to the dukes themselves—but that was only because the dukes were transcendent monsters. Peak Sword was busy feeling validated when the duchess's next words shattered his confidence.\n\n\"Of course, I'm speaking about followers who've mastered *five* secret techniques. Fortunately, most followers in the jungle have only learned five. Based on our experience, we should be able to break through the jungle zone, at least.\"\n\n*Five secret techniques...*\n\nPeak Sword's mind flashed to those terrible late-night infomercials. *But wait, there's more!* He'd definitely heard her say *five*.\n\n*Insane. Five?*\n\nThey could barely go toe-to-toe with followers who'd learned *two* techniques. Now there were enemies who'd mastered *five*? Peak Sword closed his eyes. His concerns were multiplying—the ruins were more dangerous than anticipated, and apparently even the duke's knights were stronger than he'd given them credit for.\n\nMeanwhile, the others seemed unfazed. The former Tzedakah Guild members—veterans who'd cut their teeth on every genre of game before Satisfy—had easily predicted the ruins would contain stronger opponents. Yura, Chris, Euphemina, and Katz remained unshaken, confidence radiating from their postures.\n\n*Am I the only one freaking out here?* Peak Sword felt a pang of isolation.\n\nThe conversation between Lauel and Basara continued.\n\n\"You might wonder what lies beyond the jungle. Truth is, we don't know.\"\n\nLauel's eyes narrowed. \"More concerning is the uncertainty in your assessment. You're not confident that between us and your 300 knights, we can break through easily?\"\n\n\"Correct.\"\n\n\"Why? Wasn't the jungle's primary obstacle the traps? If King Grid neutralizes them, shouldn't the path become straightforward?\"\n\n\"The traps were the greatest problem, yes. But not the only one.\"\n\n\"Explain.\" Lauel's tone was sharp, urgent. It was perhaps the first time a noble from a minor kingdom had interrogated an imperial duke so directly, yet Basara showed no hint of offense. Once a temporary alliance was forged, mutual respect was fundamental—and transparency was necessary anyway.\n\n\"The followers each specialize differently and wield various weapons. Some possess impenetrable defenses that nullify attacks. Others employ psychological warfare and illusions to fragment concentration.\"\n\nThe core issue was simple: grouped followers became exponentially more dangerous than individuals. Eight knights could defeat one follower—but only in an eight-versus-one scenario.\n\n\"Put ten followers against eighty knights, and the knights lose. Decisively. Even Duke Grenhal, Duke Morse, and I would struggle against more than ten followers simultaneously.\"\n\nManaging five followers had been nearly impossible with traps interfering. That situation had improved, at least. Still, Lauel's expression darkened. \"So if we encounter a large group during the advance, we're forced to retreat.\"\n\n\"Precisely. Followers typically roam solo, but combat draws nearby ones like blood in the water. We'll need to fall back repeatedly depending on circumstances. Also, they're monsters—they'll respawn after a set interval.\"\n\n\"This...\"\n\nExtended retreats seemed inevitable. No telling how long it would take to push through the jungle.\n\n*And if we waste too much time, Berith only gets stronger.*\n\nThe great demon would continue summoning armies and absorbing power. Lauel couldn't afford to raid an enemy that grew more formidable by the day.\n\n\"Prolonging this is unacceptable. Are reinforcements coming?\"\n\n\"Five ships departed Galest two weeks ago.\"\n\n\"Two weeks...?\"\n\n\"There must have been an incident.\"\n\n\"...\"\n\nReinforcements would arrive eventually. Even if the first group had met disaster, the empire would dispatch second and third waves. But that meant delays.\n\n*We might need to reverse the order—hit Berith first, explore the ruins later. But then the empire monopolizes the site rewards while we're away. Worst case scenario.*\n\nEven Lauel's genius couldn't easily unravel the puzzle. What had happened to the imperial troops?\n\nNobody knew that *he* was working tirelessly behind the scenes.\n\nIt was problematic because his efforts might backfire spectacularly.\n\n***\n\nTwo hours later, the strategy session concluded. Information had been exchanged, plans formulated, and command structures established. Grid rose from his seat. \"Let's move out.\"\n\nHe'd been bored half to death during the meeting. Making underwear in front of the dukes would've been inappropriate, so he'd been forced to simply sit and listen. Skunk swallowed hard at Grid's eager expression.\n\n*Is he about to start a coup?*\n\nGrid hadn't collected a single key fragment. Skunk had no idea how he'd fooled the dukes, but Grid possessed no means of disarming the traps. Dread coiled in Skunk's stomach as he imagined Grid luring everyone into the jungle for some kind of ambush. Should he warn the dukes who'd treated him well? As Skunk hesitated, Grid's party and the dukes finished their preparations.\n\n\"Let's go.\"\n\n\"...Yes.\"\n\nNaturally, Skunk followed. It made no sense to stay behind when he was the only person capable of revealing the ruins' secrets.\n\n\"...\" Skunk's expression was grim as they reached the jungle's threshold. This was a place where even animals refused to live, riddled with every conceivable trap. Quiet. Sinister.\n\n*Thump. Thump. Thump.* His heartbeat thundered in his ears.\n\nHe dreaded the coming clash between Grid's faction and the dukes, but beneath the fear lay pure curiosity. Grid reached out into empty air. His hand disappeared into an invisible inventory as everyone watched.\n\n*I should stop this now... No, Grid and the Overgeared members will be the ones who die. Ahh... Dukes, it's dangerous!*\n\nSkunk wrestled with his dilemma before finally squeezing his eyes shut. He chose ignorance, imagining Grid drawing a weapon from his inventory. But when metal scraped against leather, Grid pulled out a key—not a blade.\n\nThe universal key slid into an ordinary-looking tree. A lock *clicked* open. Skunk's eyes snapped open, and he stared, mouth agape. \"...?\"\n\nGrid moved to the next visible tree and inserted the key again. One by one, the jungle's traps disengaged beneath his touch.\n\n\"W-What?\"\n\nIn the previous discussion, Grid had acted completely ignorant about key fragments. He'd given the absurd answer that he *already had* the key. And it was true—Grid's key was nothing like those found at the ruins.\n\nBut it worked? How the hell?\n\n\"Wait a minute! W-What is that key?!\"\n\n\"This?\" Grid glanced at the ornate tool in his hand. \"A universal key.\"\n\n\"...?!\" Skunk's memory jolted. Grid was the Overgeared King. That wasn't an honorific or political title—it was a literal description of how he played.\n\n\"O-Overgeared...\"\n\nRight. Overgeared. Grid was the most overgeared person in the entire world.\n\n\"Hmm?\" Grid noticed Skunk's stunned expression, then suddenly drew a sword.\n\nHe launched into a sword dance without preamble. \"Pinnacle Kill.\"\n\nA follower had approached through the vines, movements barely perceptible. Grid's high insight and the Slaughterer's Eye Patch had detected the ambush before it materialized. The fused sword dance consumed minimal sword energy, and he recovered some of it through follow-up basic attacks. Ten seconds later, the follower disintegrated into gray ash.\n\n\"You said they usually wander alone, right?\" Grid glanced at the dukes. \"Don't we just kill them as soon as we spot them?\"\n\nThe followers in Galgunos Temple had been classified as elite monsters. The followers here were technically normal-grade—despite being individually stronger, they had less health. A few solid hits would drop them. At least, that was Grid's assessment.\n\n\"...\"\n\nAn awkward silence descended."
}