{
  "id": 1026,
  "title": "Chapter 1025",
  "content": "Three hundred imperial knights stood frozen, their faces slack with disbelief. The war god follower had died in seconds.\n\n*There was a reason Duke Grenhal respected him.*\n\nThey'd thought Grenhal's deference excessive. Grid was the Overgeared King—a rebel who'd slain Duke Rigal. They needed his key, nothing more. Yet Grenhal had shown him something approaching admiration. Now they understood why.\n\nWhile Duke Grenhal fought multiple followers simultaneously, Grid had killed one before they could blink. Faster than any duke they'd ever witnessed.\n\nFear crept into their thoughts. The empire faced enemies within its borders, certainly—but to find such power *outside* its walls? Some were already whispering comparisons to the Undefeated King.\n\nThe ten meritorious retainers exchanged glances.\n\nHumanoid monsters typically possessed less health than their bestial counterparts, true, but this follower had been level four hundred. Grid had demolished it with a single skill and a handful of basic attacks. His growth over the past few months had been staggering.\n\nHurent felt the weight of it most acutely.\n\n*I burned through every skill I had just to bring one down.*\n\nHe hadn't attended the strategic meeting. Unlike the others, he held no title—sitting at a table with three imperial dukes would've been torture. Instead, he'd walked the coastline, turning over Piaro's gift in his mind. Seeds for a crop that grew in sand and drank seawater. Piaro had perfected it while farming in the water clan's underwater city.\n\nHow peaceful it would be, tending fields beside such beautiful shores...\n\nHurent had let himself dream. A mistake. He should've been training.\n\nNow the gap between himself and Grid yawned like a chasm. At this rate, he'd never even reach Grid's ankles.\n\n\"...\"\n\nThe three dukes, by contrast, showed no reaction whatsoever. No surprise. No admiration. Nothing.\n\nGrid frowned behind his mask. *The experience is too low.*\n\nThe follower had given him what a level 300 monster would drop—nothing more. Strange.\n\n\"...!\"\n\nHis instincts screamed. Grid raised his sword as a fist materialized from nowhere.\n\nThe impact against the Sword Aiming at the Gods sent shockwaves rippling through the air. Grid's feet left the ground, his body launched backward. Whoever—whatever—had thrown that punch possessed strength exceeding his own.\n\nGrid twisted mid-air, already pivoting into a counter-kick. The war god follower dropped his elbow, smashing Grid's knee before the strike could land. The kick died stillborn.\n\n\"You...?\"\n\nGrid stared at the follower's face. Identical features. The same follower he'd just killed.\n\nBefore the thought could fully form, the figure split. Two became three. Three became four. Four became five. Clones.\n\nThe follower Grid had killed had been nothing but bait.\n\n\"When followers who've mastered the cloning technique first appear,\" Grenhal murmured, \"they sacrifice clones to gauge their opponent.\"\n\nWar god followers threatened even imperial dukes. Those who'd learned five secret techniques were formidable adversaries. Those who'd mastered dozens were living catastrophes. Eliminating one in mere seconds was impossible—not without expending an ultimate technique.\n\nGrenhal watched Grid with clinical interest. The man had earned the title Hero King through concrete achievements. Would he live up to the weight of that crown?\n\n*He'll struggle at first. They always do.*\n\nThese clones operated differently from traditional manifestations. Standard clones reproduced roughly thirty percent of the original's capabilities—pale shadows. But the followers' technique allowed momentary stat exchanges with the prime body. The clones boasted destructive power equal to the original.\n\nThe cost, of course, was that such exchanges weakened the prime body, creating tactical vulnerabilities. The key lay in identifying and exploiting that weakness. But the clones were perfect copies. Finding the prime body was nearly impossible.\n\nGrenhal catalogued the variables. How would Grid break through five simultaneous opponents? For reference, Grenhal's first encounter with a cloning follower had taken four minutes to resolve. Morse had needed five.\n\n\"Hm?\"\n\nBlue sparks danced around Grid's left eye, visible even beneath the eyepatch.\n\n\"...?!\"\n\nEvery clone surrounding Grid detonated simultaneously. Gone.\n\n\"W-What?\" The shout came from Morse, who'd been yawning through the entire encounter. He'd written Grid off as weak, barely worth watching. \"What ability is this?\"\n\nEven the follower seemed baffled. War god followers were truth-seekers who'd severed themselves from emotion in their quest for ultimate nothingness. Confusion on such a face was remarkable.\n\n\"An evil eye...!\" Basara breathed.\n\n\"What? An evil eye?\"\n\nEyes that wielded direct power—the exclusive domain of the evil eyes species. A human using such an ability should've been impossible. Yet neither Grenhal nor Morse could dispute Basara's expertise. Her knowledge was encyclopedic.\n\nGrid closed the distance, his blade singing toward the now-isolated follower. The follower's skin hardened like steel plates, arms crossing to deflect the strike. His defense was legendary—normal attacks couldn't scratch him.\n\n\"...?!\"\n\nThe follower's arm fell away, severed cleanly. Blood sprayed. Pain twisted his features into something almost mortal.\n\n>[Contempt of the Weak]\n>\n>[Inflicts a fatal blow to targets outside the realm of transcendence.\n>Consumes 80% of the target's current health.\n>Mana Cost: 5,000\n>Cooldown: 1 hour]\n\nThe skill attached to the Blade Aiming at the Gods. Useless against named opponents, but a tactical nuke against common monsters. Grid pressed his advantage, landing eight more basic attacks before the follower could recover from the stun.\n\nThe war god follower crumbled to ash.\n\nGrid's experience gauge climbed. Unlike the worthless clone, this kill registered properly—0.01% even at level 398.\n\n\"...\"\n\n\"...\"\n\nThe three dukes fell silent, their composure finally cracking.\n\nGrid's first encounter with a cloning follower, and he'd dismantled it like a training dummy. Genuine admiration flickered in their eyes.\n\n*He didn't kill Rigal through luck.*\n\nTheir internal assessments of Grid shifted, recalibrating upward. He'd seized control of the battlefield's atmosphere through pure dominance.\n\nWorth burning Contempt of the Weak's cooldown.\n\n>[The Castration Eye is triggered. Mana is being constantly consumed.]\n>\n>[The Castration Eye has been closed.]\n\nGrid closed his left eye and turned to his companions. \"The followers are stronger than expected. Everyone stay sharp.\"\n\n\"...Yes.\"\n\nThe ten meritorious retainers felt something crack inside their chests. They needed caution against monsters Grid butchered in seconds. The gap between them and their king wasn't merely wide—it was oceanic. Larger even than the distance they'd once measured between themselves and Kraugel, the man who stood above the sky.\n\n*This can't continue.*\n\n*If the gap keeps growing, we'll become nothing but dead weight.*\n\nMotivation ignited like wildfire through their ranks. Fear was meant to be conquered. Strength forged through adversity. They scanned the jungle with renewed intensity, eyes sharp as hunting predators.\n\n***\n\nThe jungle proved smaller than expected. Between Grid triggering every trap, the meritorious retainers' hungry pursuit of combat experience, and the dukes' overwhelming power, they carved through to the far side without significant delay.\n\nA valley opened before them. The roar of a waterfall filled the air.\n\n\"This would make a good campsite,\" Lauel observed, already analyzing the terrain.\n\nThe others nodded agreement. They'd entered the jungle at dawn; night had fallen during their fourteen-hour push through hostile territory. Lauel coordinated the camp's construction with practiced efficiency before approaching Skunk.\n\n\"Find anything unusual on the way?\"\n\n\"Unfortunately, no. No clues, no treasures. Just murals showing how to deactivate the jungle traps.\"\n\n\"Makes sense. The jungle's just the first gateway—not the ruins proper.\"\n\nLauel handed Skunk a strip of jerky. \"Running a guild solo must be exhausting.\"\n\n\"It gets complicated above a hundred members,\" Skunk admitted, \"but nothing I can't handle. We're structured for expeditions—no permanent settlements, no political infighting. Though we do hemorrhage members pretty regularly. The lifestyle isn't for everyone.\"\n\n\"Sounds like it's time to put down roots. You've explored most of the West Continent. Even crossed the Red Sea.\"\n\n\"Mm... suppose that's true.\"\n\n\"Join the Overgeared Kingdom. We'll provide full logistical support. Warship access for Red Sea exploration. Passage to the East Continent whenever you need it.\"\n\n\"Haha, passage to the East Continent? Now that's tempting.\"\n\nThe claim was absurd. Crossing to the East Continent at will?\n\nLauel's expression remained deadly serious. \"You might not know this, but Sage Sticks serves Grid.\"\n\n\"...?\"\n\n\"We can produce intercontinental movement scrolls.\"\n\n\"What?\" Skunk's eyes widened. \"You're serious—\"\n\nHis question died in his throat. Beyond Lauel's shoulder, through the cascading water of the distant waterfall, a figure sat in meditation. Eyes closed. Utterly still. Completely unaware of the party's presence.\n\nOr so it seemed.\n\nThe name hovering above the figure read: *War God Follower Who Has Learned 10 Secret Techniques.*\n\nSkunk's pulse quickened.\n\nThe guardian. It had to be. Protecting whatever treasures lay deeper in the ruins."
}