{
  "id": 1027,
  "title": "Chapter 1026",
  "content": "**Is this it?**\n\nGrid trudged through the humid jungle, his mind troubled. The Ruins of the War God—this was the first major content added to Satisfy in six years. He'd expected a nightmare. Before embarking on this expedition, he'd privately doubted whether they could even survive.\n\nYet now that they were here? It was almost disappointingly easy. The universal key opened every door, and the enemies were manageable.\n\n*Galgunos Temple was harder than this.*\n\nThe followers here were fifty levels higher and knew more techniques, but they spawned one at a time. Normal monsters. The undead-infested temple had been far more dangerous.\n\n*Then again...* Grid's brow furrowed. *Galgunos was worshipped as a god too.*\n\nHe couldn't just assume the Red Sea automatically meant higher difficulty. The world was divided into West Continent, Red Sea, and East Continent—but each location had its own logic. Dragons lived on the West Continent, after all.\n\n*Don't jump to conclusions. The jungle's just one section. It could get exponentially harder from here.*\n\n***\n\nIn the privacy of his personal barracks, Grid sat cross-legged, absently stroking Noe's fur. The demonic beast's coat was gradually darkening to a deeper shade of black.\n\n\"Hmm.\" Grid's mind spun with calculations. What should he have the Overgeared Skeletons craft from their own bones? The system had pre-determined the categories—Skeleton One would make a sword, Skeleton Two a helmet—but the specific designs were entirely his responsibility. These items would last them for eternity. He wanted to give them something perfect.\n\n\"This is harder than I thought.\"\n\nEach skeleton could only learn one production method. The pressure was immense.\n\n\"Nyong.\" Noe's rough tongue licked Grid's hand, sensing his master's distress.\n\n*Cute little guy.*\n\nGrid's expression softened into genuine affection.\n\nThen Lauel burst through the entrance. \"King Grid! You need to see this!\"\n\n***\n\nThe roar of water drowned out all other sound.\n\nAt the jungle's end, the terrain opened into a valley dominated by fifty-three waterfalls of varying size. Two of them were monstrous—only thirty meters wide, but the water pressure could drill through solid rock. The bottom of the valley bore testament to centuries of erosion.\n\nNo one had noticed the follower concealed behind the cascading water. Pure chance had revealed him when Skunk spotted a momentary gap between two colliding waterfalls. Moonlight had speared through the opening, illuminating a motionless silhouette.\n\n\"A war god follower who's mastered ten secret techniques.\"\n\nSeveral of the Ten Meritorious Retainers audibly gulped. The followers who knew five techniques had been difficult enough. No one wanted to discover what ten techniques looked like in combat.\n\nVantner especially. He'd taken brutal damage from the followers who knew Force Palm—a technique that bypassed defense entirely. He was praying this one hadn't learned it.\n\nGrid arrived last. \"How long has he been hiding in there? Waiting to ambush us?\"\n\nThe follower was clearly no mindless mob. His name showed he was boss-tier, though the cascading water and distance made the color difficult to discern.\n\n\"Does he even know we've spotted him?\"\n\n\"Doesn't seem like it.\" Skunk shook his head. \"From inside the waterfall, the sound would be deafening. He can't see out clearly either.\"\n\nThe follower stood like a statue, eyes closed, water hammering his body. Some kind of training meditation.\n\n\"Then we hit him now. Everyone support me.\"\n\nGrid had found the jungle boring, but that was just his personal experience. He wanted excitement, not catastrophe. Better to eliminate threats immediately. He readied the Pulling Device, attached the Blade Aiming at the Gods to Sword Ghost, and prepared to activate Fly. The waterfall was three kilometers away. He'd close the distance fast, open with the four-fusion sword dance to deal critical damage, then let his allies finish the job.\n\nGrenhal's hand stopped him. \"Don't.\"\n\nGrid paused. \"What? This is perfect—he hasn't noticed us yet.\"\n\n\"He's watching us right now.\"\n\n\"What are you talking about? His eyes are closed. And why would he just stand there if he knew we were here?\"\n\n\"Your Majesty.\" Grenhal's voice was patient. \"Do you understand why he detected us? He's achieved Natural State. We haven't unified with nature, so we can't perceive him clearly. But he shares nature's senses—he knows exactly what we're doing and what we look like.\"\n\nGrid was familiar with Natural State. Piaro had mastered it years ago. But so what?\n\n\"Then what? We just wait for him to attack first?\"\n\nGrenhal nodded. \"We're far enough to read his movements. We have overwhelming numbers. Better to prepare defensive positions and let him come to us.\"\n\n\"Hrm...\"\n\nIt made sense. No reason to charge into that brutal waterfall and fight on his terms. Grid reluctantly nodded.\n\n*The dukes are surprisingly cautious.*\n\nThe Seven Dukes were among the most powerful beings on the West Continent. Grid had expected overwhelming arrogance—reckless warriors who feared nothing. Instead, they'd swallowed their pride to ally with an enemy king. They meticulously planned every encounter with powerful foes. Stronger than Grid, yet more careful than him—and Grid, who often relied too heavily on his own power, knew it.\n\n*I try to be cautious every time... but when the blood starts pumping, I just charge in.*\n\nThey were clearly operating on a higher level. If he wanted to stand as their equal, he needed their wisdom.\n\n***\n\nMorning came.\n\n\"...\"\n\nThe follower hadn't moved.\n\nAnother day passed.\n\n\"...\"\n\nStill motionless.\n\nTwo full days elapsed with the follower frozen in place behind the waterfall. Even the dukes were losing patience.\n\n\"Why is he just standing there?\"\n\nTwo days. The knights had been on edge the entire time, anticipating an attack that never came. Now they were exhausted. The Overgeared members couldn't hide their fatigue either.\n\nBeast King Morse snapped first. \"I can't wait any longer. We attack now. The Overgeared King was right from the start.\"\n\nSkunk supported him. \"There's treasure past the waterfall. The follower won't leave because he's guarding it.\"\n\n\"Mm...\" Grenhal couldn't argue anymore. His gaze shifted to Grid.\n\nGrid nodded. \"We can't leave him there. What if he comes at us from behind later?\"\n\nNot greed for uncertain treasure—pure tactical necessity. They had to clear this obstacle to advance.\n\nGrenhal finally relented. \"Understood. But you're not going alone.\"\n\nCrossing the jungle together, Grenhal had witnessed Grid's capabilities firsthand. He honestly couldn't understand how Grid had defeated Sky King Rigal. But Grid was unquestionably powerful.\n\nMore than that... Grenhal had felt something when they'd shaken hands. He couldn't let Grid fight alone. The synergy between Grid's charm stat and his class's \"easily recognized\" trait was working perfectly.\n\n\"We're coming with you.\"\n\nGrenhal, Morse, and Basara stood shoulder to shoulder behind Grid. The Overgeared members watched in awe. These people—legendary rankers they'd never dreamed of meeting, sworn enemies of their kingdom—now looked like Grid's loyal retainers.\n\nGrid felt good. People who'd been mortal threats just days ago were now guarding his back. Reliable. Reassuring.\n\n*Garam is different, though.*\n\nMaybe Lauel was right. Maybe the Empire could become an ally without bloodshed. If that happened, the Overgeared Kingdom would be secure. Grid wouldn't have to fear for the lives of those who followed him.\n\n\"Let's go.\"\n\nGrid activated Fly. The dukes launched themselves after him. Jishuka and Yura took up pre-arranged sniper positions while Euphemina and Lauel prepared spells. Faker, Chris, Pon, Regas, Peak Sword, Vantner, Katz, and Hurent followed Grid and the dukes into the valley.\n\n\"Transcended Link Flower!\"\n\nGrid in Blackening mode reached the waterfall first, unleashing forty waves of sword energy.\n\nThe follower's eyes opened.\n\nThe explosion scattered water in every direction. The follower's body, reinforced by the power of nature, remained standing.\n\n**[The target has received 3,500 damage.]**\n\n**[The target has received 3,320 damage.]**\n\n**[The target has received...]**\n\n\"...!?\"\n\nThe war god follower who'd mastered ten secret techniques boasted transcendent defense. Transcended Link Flower dealt 122% physical and 20% magic damage—yet he only took three thousand per hit.\n\nThe result shocked Grid, who'd started to believe his attack power rivaled the Seven Dukes.\n\nThe waterfall's force threw Grid into the valley. He crashed into the water.\n\n\"Gah!\"\n\nGrid swam hard and burst back to the surface. Combat had already erupted between the follower and the dukes. The destruction was spectacular—rivaling Grid's four-fusion sword dances. Water columns exploded in every direction. The three dukes attacked in perfect coordination while the follower desperately defended. Ten secret techniques or not, fighting three of the West Continent's strongest simultaneously was overwhelming.\n\n*If they're winning anyway, why were they so worried about Natural State?*\n\nWhy had the dukes hesitated? Grid clicked his tongue in faint contempt and started the sword dance for Linked Kill Flower Pinnacle. He'd exploit the marks left by Transcended Link Flower to maximize damage. Contribution determined rewards—he needed to secure as much experience and loot as possible.\n\nThen the fifty-three waterfalls defied nature.\n\nThe falling water transformed into living serpents, changing trajectory to converge on the dukes.\n\n\"Kugh!\"\n\n\"Gah!\"\n\nThousands of water lances struck the dukes. They lost massive chunks of health and collapsed, bleeding from countless wounds. The concentrated water pressure was irresistible.\n\nThe power of Natural State. Piaro was only a beginner—able to replace some of his strength with natural mana. This follower commanded nature according to his will.\n\nThe follower's gaze settled on Grid. \"You are not qualified to challenge me.\"\n\nHis finger pointed to the dukes. \"Empty shells who have already consumed all their talent.\"\n\nThen to Faker's hiding spot. \"A child who has only just begun his training.\"\n\nThen to the distant cliffside. Toward Yura in sniper mode. \"A half-grown warrior who has yet to fulfill her duty and whose strength remains suppressed.\"\n\nFinally, his finger aimed at Grid. \"A blacksmith who has already exceeded his limits.\"\n\n\"...!\"\n\n\"All of you are weak. None deserve to challenge me—one who walks the true path of martial arts.\"\n\nThis follower could speak. Unlike every other follower they'd encountered, he possessed true intelligence. And his words struck deep into Grid's heart—targeting the anxiety he'd tried to suppress.\n\n*Already exceeded his limits.*\n\nGrid understood exactly what the follower meant. His jaw clenched as he fought to deny reality. \"Exceeded my limits? Bullshit. You think I'm some ordinary blacksmith? I am Pagma's Descendant.\"\n\nThe unease had been growing for a while now. Demon Slayer's combat power blossomed over time as the class matured.\n\n\"I can still get stronger.\"\n\nThe Sword Saint was overwhelming from the beginning.\n\n\"I still have massive potential.\"\n\nGrid often felt that Pagma's Descendant had pathetically weak class-specific combat power. He'd survived countless incidents through sheer determination, pushing past every limitation. But maybe... maybe there was a ceiling. Maybe he couldn't get any stronger.\n\nHe'd had this thought before. The fear that he'd eventually fall from his hard-won position haunted him. But Grid always pushed it aside. He remained hopeful that further development was possible. He clung desperately to his achievements, terrified of sliding back into his old life.\n\nAnd now this follower was denying everything.\n\n\"A blacksmith has no qualifications. Didn't Pagma himself eventually recognize his limits and make a contract with a great demon?\"\n\n\"**Shut up!**\"\n\nEnraged, Grid fired Linked Kill Flower Pinnacle. The follower bore five marks from Transcended Link Flower—the fusion sword dance dealt tremendous damage. But the boss monster's defense and health were transcendent. His health gauge barely moved.\n\n\"You will eventually abandon the sword.\"\n\nThen—\n\n**[Zeratul]**\n\n\"...?\"\n\nThe follower's name changed. \"War god follower who has mastered ten secret techniques\" became a single, short word. A name that resembled the war god himself.\n\nThe fifty-three waterfalls went berserk. The screams of the dukes and Ten Meritorious Retainers echoed through the valley. Confusion overwhelmed Grid.\n\n**[Braham's soul has awakened.]**\n\nGrid heard a voice he'd thought lost.\n\n—*Your tail is wagging all over the place. Since when did you catch the war god's attention? He's the one who isn't worthy.*\n\n\"...!\"\n\nAbsolute indifference. Contempt. The follower watching Grid went blank.\n\nBraham steadied him. —*Let the trash talk flow out one ear. Don't even think about going astray. You are strong. You* can *become stronger.*\n\nGrid was different from Pagma. Pagma had abandoned his friend and made deals with great demons. Grid had people he could rely on.\n\n—*I am by your side.*\n\n**[A hidden quest has occurred.]**"
}