{
  "id": 1028,
  "title": "Chapter 1027",
  "content": "Every child of Shizo Beriache inherited one of their mother's consuming desires. Braham's legacy was knowledge—an insatiable hunger that drove him to endure the Curse of Idleness and pierce through to the fundamental truths of existence. Like Beriache herself, he had glimpsed what lay behind the facade of divinity.\n\nWhich was why, when Pagma confessed he'd encountered the War God, Braham's unease had been immediate. War God Zeratul—that monument to divine arrogance—would never extend his hand to a human out of benevolence. \n\nAnd Braham had been right.\n\nPagma spoke of rejection. Of inadequacy revealed. Of a newfound determination to gain the strength necessary to protect the world. That vow would later return as the cruelest betrayal imaginable. Pagma murdered Braham and stole his remaining years, all in the name of destroying evil.\n\n—*I remember his eyes as the blade pierced my heart. As I lay dying, there was no love in them. No regret. No pain. Only hunger. An all-consuming desire for power.*\n\n—*The followers aren't noble seekers of truth. They're cursed slaves who could be reborn a thousand times and never reach the ultimate realm through their own strength.*\n\n—*Don't listen to the faithless voice. That bullshit will drive you insane. Pagma fought to destroy the great demons—used that as his excuse to betray a friend—yet in the end, he made a contract with Great Demon Baal himself.*\n\nBraham's voice echoed through Grid's consciousness even as the follower's words invaded his ears.\n\n\"A demonkin resides within your body. You've pushed beyond your limits, yet you remain a weak blacksmith. Don't let evil beings deceive you. Face the truth.\"\n\n\"You are weak. Unqualified to wield the sword. Don't be complacent. Embrace greater strength.\"\n\n\"Yes... why not absorb the demonkin's soul? I can teach you how. I can show you the way to transcend your limits once more and become a master of absolute knowledge.\"\n\nThe follower's nameplate flickered, shifting to **Zeratul**. The god's consciousness had descended, borrowing his follower's flesh in the ritual called Receiving a Soul.\n\nGrid didn't flinch. No confusion clouded his thoughts. Braham stood beside him.\n\n[**Your affinity with Braham has already surpassed the maximum.**]\n\n[**War God Zeratul is interested in you.**]\n\n[**Braham is with you.**]\n\n[**All conditions are met. The hidden piece has been triggered.**]\n\nThe hidden piece's name was simple: **Don't Repeat the Mistake.** Unlike the hidden pieces tied to Pagma's Descendant, this one existed purely because of the bond Grid had forged.\n\n—*I won't make the same mistake. I won't lose my only friend again.*\n\nWith Braham's declaration, Grid's black hair began to fade. His tanned skin turned milk-white. His eyes bled crimson. As the transformation completed, his frame refined itself, becoming slender and beautiful.\n\nGrid had assimilated with Braham—not through the Assimilation skill, but through complete, event-driven fusion. Just as when they'd first met, but absolute this time.\n\n[**Forced assimilation has been carried out under the influence of the hidden piece.**]\n\n[**Your class will change.**]\n\n[**Name: Braham Eshwald (Grid)**  \n**Class:** Great Magician  \n**Title:** Duke of Wisdom  \n* The greatest intellect of this era. Though the ultimate truth remains beyond reach, his obstinacy persists. This relentless pursuit of knowledge is immensely powerful—and occasionally poisonous.  \n* Intelligence increased by 35%.  \n* Low probability of running wild.  \n\n**Title:** One who Became a Legend  \n* Highly resistant to abnormal status conditions.  \n* Cannot die when health reaches minimum threshold.  \n* Easily acknowledged.  \n\n**Title:** ???  \n* ???\n\n**Level:** 545  \n**Health:** 858,310/858,310 (Adjusted)  \n**Mana:** 13,964,000/13,965,000 (Adjusted)  \n\n**Strength:** 258  \n**Stamina:** 3,400  \n**Agility:** 1,009  \n**Intelligence:** 15,880 + 5,558  \n\n* In this human vessel, Braham Eshwald's full power cannot manifest. Most stats remain sealed.]\n\nMagical power erupted like a broken dam.\n\n\"Mana Drain.\"\n\nBraham's voice was casual, almost bored. The fifty-three waterfalls raging like maddened dragons froze mid-cascade. Their form collapsed, cascading down as ordinary rain.\n\n\"...?\"\n\nThe dukes lay broken and bleeding on the ground, battered by the relentless assault. As the pain suddenly ceased, they cracked their eyes open in confusion.\n\nThen they saw it.\n\nThe arrogant follower—the one they couldn't even scratch—was retreating, his face twisted in dismay.\n\n\"Bah. How pathetic.\" The Overgeared King stood with arms crossed, sneering.\n\n\"Wh-What?\" The dukes could barely process what they were seeing. Grid—*Grid*—was dominating the follower who'd crushed them like insects. Reality and dream blurred together.\n\n*'Braham!'* Grid cried out from within, his consciousness forcibly locked away. It came out more like a scream. *'Don't overdo it! You're still weak!'*\n\nHonorifics forgotten, worry poured through unfiltered.\n\nBraham merely laughed, clearly pleased. \"Idiot. This is weak? You have no idea.\"\n\nThis was the Red Sea—the world's origin point, where infinite mana converged. Braham's Mana Drain was like a sponge of limitless capacity, continuously absorbing power, amplifying his strength, and stoking the follower's mounting terror.\n\nAs Braham advanced, he spoke: \"Go ahead. Evaluate me.\"\n\n\"...\" The follower said nothing. His opponent was a true legend. Braham was nothing like the still-developing Grid or Yura. He was no target for a mere follower to judge.\n\nZeratul's presence had withdrawn. A fraction of divine consciousness couldn't suppress Braham. To stop him, Zeratul would need to descend fully—just as he had when he'd deceived Pagma.\n\n\"Grid, I struggled with this decision for a long time.\"\n\nBraham drew the sword at his waist.\n\n[**The conditions of use are not met.**]\n\n[**This item cannot be equipped.**]\n\n[**The characteristic inherent in the body's original owner will alleviate the requirements.**]\n\nThe Sword Aiming at the Gods hung awkwardly in the white-haired man's grip, its optimal efficiency reduced to mere decoration. Yet Braham's beauty as he raised the golden blade was so profound that everything else seemed to blur. Even Duke Basara, whose eyes remained perpetually closed, opened them at the sight.\n\n\"Was it right to give my magic to an idiot like you?\"\n\n*'...'*\n\n\"Will you even be able to use my spells properly before you die?\"\n\n*'...'*\n\n\"I finally accepted it. Giving you my magic won't help you. It's pointless.\"\n\n*'What are you saying all of a sudden?'* Panic seized Grid. Was Braham about to revoke his magic? Was this hidden piece actually a *trap*? Forget the advanced spells he couldn't use yet—would he lose even Magic Missiles and the other basics he'd mastered?\n\nAnxiety flooded through him.\n\n\"Watch.\" Braham assumed a stance drawn from Pagma's Swordsmanship. The posture was beyond perfect—flawless in a way Grid had never achieved. For Braham, who'd observed the technique countless times beside both Pagma and Grid, it was effortless.\n\n\"I'll reference the patterns Pagma used in each sword dance and imprint my magical formulas onto them. From now on, you won't need to use magic and swordsmanship separately. Even an idiot like you can take advantage of my magic this way.\"\n\nStep. Step. Braham advanced on the follower, movements flowing into the sword dance. Flames like captured sunlight blazed around him.\n\n\"Don't underestimate me!\" The follower, cornered with nowhere left to retreat, exploded forward. The seeker of ultimate martial arts chose confrontation over flight. Some of the atmospheric mana Braham had gathered scattered as the follower shot forward like a lightning strike.\n\nHis power was formidable—the same force Grid couldn't match even armed with Valhalla. Yet Braham handled it casually. A transparent shield materialized as he completed the sword dance.\n\n\"The new swordsmanship will destroy your enemies and protect your body,\" he said to the awestruck Grid.\n\nThen Braham thrust the sword into the follower's chest.\n\nGrid expected instant annihilation—a brilliant victory befitting a legend. The image played out perfectly in his imagination.\n\nReality proved... different.\n\n\"...\"\n\nBraham's strength stat was 258. Pathetically weak, with no items to supplement it. Moreover, he wasn't actually *using* Pagma's Swordsmanship—just mimicking its form.\n\n\"...\"\n\n\"...\"\n\nAwkward silence descended. The blade had struck flesh but caused no damage. The follower's unease deepened. Braham coughed.\n\n\"Haaap!\" The follower recovered first, seeing opportunity in the moment. Breaking the silence, he moved like lightning, seizing Braham's arm. He slammed him toward the ground, clearly intending to follow with a devastating barrage—\n\nWind Cutter severed the follower's hand at the wrist. He recoiled with a choked groan.\n\n\"You don't touch my body without permission,\" Braham said coldly.\n\n*'MY body?!'* Grid protested.\n\nBraham ignored him. With an irritated gesture, he thrust his hand forward. No incantation—Tornado erupted instantly, tearing the follower apart.\n\nBraham's white hair slowly darkened. Control was shifting back.\n\n\"Remember this. The War God reaches into the depths of your insecurity, then extends a hand of salvation. But it's corruption, not salvation. His pride is mechanical. Empty. It's worse than Yatan's mindless instinct for destruction.\"\n\nBraham had expended vast amounts of power. Deep sleep was approaching again.\n\n\"Don't fall for the War God's temptation. Don't forget—I'm with you.\"\n\n*'Braham, you...'* Grid understood. This was goodbye, at least for now.\n\n\"If the War God approaches you again, I'll do this again.\"\n\nHair, skin, eyes—all returned to their original colors. Control flowed back into Grid's hands. Braham clung to consciousness just long enough for one final word.\n\n\"...Fuck.\"\n\n*'...'*\n\n[**Braham's soul has fallen into deep sleep.**]\n\n[**However, Braham will be watching you.**]\n\n[**The information of Great Swordsman Pagma's Swordsmanship has been updated thanks to compensation from the hidden piece.**]\n\n[**The hidden piece's resolution has removed the possibility of Legendary Great Magician and opened the path to Braham's Descendant.**]\n\n[**(Braham's Favor) Great Swordsman Pagma's Swordsmanship Lv. 1**]\n\n[Increases physical attack power by 40%, critical hit rate by 50%, and critical damage by 80%.  \n* Effect only applies when a sword-type weapon is equipped.  \n* Reduces footwork requirements for sword dances by 50%.  \n* You can create up to five fusion sword dances.  \n* Maximum fusion sword dances increase with each skill level.  \n* With this skill's effect, you can link up to four sword dances in sequence.  \n\n**★ When a sword dance is used, one of Braham's enhanced spells will manifest.**  \n**★ Only basic spells can be expressed. Each sword dance corresponds to a different spell.**  \n**★ Fusion sword dances trigger multiple overlapping spells.**  \n**★ Consumes mana. Can be toggled on/off.**  \n\nCurrently active.]\n\n\"Braham...\" \n\nGrid stood alone again, one hand pressed to his chest. The profound affection Braham had shown him—it made him want to laugh and cry at the same time."
}