{
  "id": 1029,
  "title": "Chapter 1028",
  "content": "**It must have been one agony after another.**\n\nPagma had stood alone against a demonic army numbering in the hundreds of thousands on the Behen Archipelago. He'd glimpsed the true nature of Hexetia and realized his rigid view of good and evil had been fundamentally flawed. Then came the crushing regret over what he'd done to Braham. Looking back, Pagma had likely felt betrayed by the War God as well. Each new truth he uncovered would have brought fresh shock, fresh pain. In the end, he must have questioned the very meaning of his life.\n\n*...He deserves pity.*\n\nBoth Braham and Pagma—pitiable souls, both of them. The same applied to Piaro and Asmophel. Grid found himself contemplating the weight of friendship and trust.\n\n*I'll never betray a friend, even with a blade at my throat.*\n\nThese friendships were precious. Hard-won. He couldn't—*wouldn't*—betray them.\n\nHis resolve resonated with Braham's slumbering soul. Feeling a surge of hope, Grid pulled up his Pagma's Swordsmanship skill list. A new option had been added to every sword dance.\n\n---\n\n> **[Wave Lv. 1]**\n> \n> **★ Braham's Shield** wraps around the caster when Wave is deployed. The shield absorbs **10,000 damage + Intelligence value**. Caster's defense increases by **300** while the shield is maintained.\n> \n> **Mana Cost:** 500\n\n---\n\n> **[Restraint Lv. 1]**\n> \n> **★ Braham's Grease** activates when Restraint is deployed. Range matches Restraint's area; duration matches Restraint's duration. The friction coefficient of the ground vanishes, forcing targets to slip. This effect only applies to targets standing on the ground.\n> \n> **Mana Cost:** 2,000\n\n---\n\n> **[Link Lv. 1]**\n> \n> **★ Braham's Wind Cutter** releases when Link is deployed. Wind Cutter manifests between the air currents generated by every fourth strike of Link. Wind Cutter deals **5,000 fixed damage** and has a low probability of severing the target. Chance of severing is affected by hit rate and target's defense.\n> \n> **Mana Cost:** 1,800\n\n---\n\n> **[Kill Lv. 1]**\n> \n> **★ Braham's Detect Force** activates when Kill is deployed. Detect Force pursues the target. Kill's hit rate increases dramatically.\n> \n> **Mana Cost:** 1,000\n\n---\n\n> **[Pinnacle Lv. 1]**\n> \n> **★ Braham's Weapon Enchant** activates when Pinnacle is deployed. Weapon attack power increases by **50%**. This effect ends with the sword dance.\n> \n> **Mana Cost:** 1,200\n\n---\n\n> **[Revolve Lv. 1]**\n> \n> **★ Braham's Shield** wraps around the caster when Revolve is deployed.\n> \n> **Mana Cost:** 500\n\n---\n\n> **[Drop Lv. 1]**\n> \n> **★ Braham's Fire** releases when Drop is deployed. All targets within Drop's range receive **3,000 damage** and suffer burn damage for **3 seconds**.\n> \n> **Mana Cost:** 800\n\n---\n\n> **[Flower Lv. 1]**\n> \n> **★ Braham's Lightning** occurs when Flower is deployed. Targets struck by Flower have a low probability of being shocked and receiving **3,000 damage**. During shock, their body is paralyzed.\n> \n> **Mana Cost:** 800\n\n---\n\n> **[Transcend Lv. 1]**\n> \n> **★ Braham's Detect Force** activates when Transcend is deployed. Transcend's hit rate increases dramatically.\n> \n> **Mana Cost:** 1,000\n\n---\n\n> **[Flower Revolve]**\n> \n> **★ Lightning and Shield** effects are applied.\n> \n> **Mana Cost:** 1,300\n\n---\n\n> **[Pinnacle Kill]**\n> \n> **★ Weapon Enchant and Detect Force** are applied.\n> \n> **Mana Cost:** 2,200\n\n---\n\n> **[Transcended Link Flower]**\n> \n> **★ Detect Force, Wind Cutter, and Lightning** effects are applied.\n> \n> **Mana Cost:** 3,600\n\n---\n\n> **[Linked Kill Flower Pinnacle]**\n> \n> **★ Wind Cutter, Detect Force, Lightning, and Weapon Enchant** are applied.\n> \n> **Mana Cost:** 4,800\n> \n> ***The magic spells have been greatly reduced through simplification of the magic formulas.***\n\n---\n\n\"...\"\n\n*Power decreased through simplification.* The message stated it clearly, but Grid felt nothing but admiration.\n\nWhat did \"weakened spells\" even mean? Take Weapon Enchant as an example. When common magicians used it, the skill improved weapon power by 20%—at Level 1. Each subsequent level only added 6%. Even at Level 5, Weapon Enchant only granted a 50% boost, with correspondingly higher mana costs.\n\n*Though the duration is three minutes with theirs.*\n\nRegardless, Grid was satisfied. This power was born purely from Braham's affection for him. To feel anything less than grateful would be shameless.\n\n*The one drawback is mana consumption...*\n\nAt Level 398, Grid's total mana pool was less than 18,000. His second class, Duke of Wisdom, forced half his stat points into Intelligence.\n\n*Wait.*\n\nGrid opened his status window to check his second class. Since the possibility of becoming the Legendary Great Magician had been removed, he'd assumed the class would change.\n\nIt was still Duke of Wisdom.\n\n*Duke of Wisdom is one of Braham's powers. It remained because the path to Braham's Descendant is still available. Wait—don't tell me...*\n\nA chill ran down Grid's spine.\n\nThe upgraded swordsmanship's mana consumption could be managed through careful activation and deactivation. With the Ring of Absurdity's help, mana shortages wouldn't be an issue.\n\nHe'd thought it was straightforward. He'd been wrong.\n\nThinking deeper, a fatal problem emerged. He would no longer be able to temper minerals with magic. Grid had been striking materials with Magic Missile instead of his hammer depending on the situation. Without access to those spells, his blacksmithing capabilities would suffer.\n\n*Ah. This is bad.*\n\n...No. Was it *really* bad?\n\nGrid, now anxious, revisited the hidden piece's rewards. Was there any phrase stating his previous spells would be deleted?\n\n*There's nothing.*\n\nGrid's expression brightened as he pulled up his available spell list.\n\n---\n\n> **[Magic Missile]**\n> \n> **[Alarm]**\n\n---\n\nThe spells Grid relied on were still there.\n\n*Of course. The genius Braham wouldn't overlook something like that.*\n\nPerfect. There were no issues with this hidden piece whatsoever.\n\nJoy flooded through Grid once more. He clenched his fists, grinning. He wanted to run laps and cheer, but that would cost him his dignity in front of the dukes and imperial knights. He struggled to calm his racing heart.\n\n\"E-Excuse me, Overgeared King...?\"\n\nThe dukes approached. Their recovery speed was extraordinary—most of their wounds had already closed. Despite this, their expressions were grim. They looked half-mad. They spoke with extreme care.\n\n\"Were you... *hiding* your power?\" Duke Morse asked, his tone polite and respectful—almost deferential. He was normally rough around the edges compared to the other dukes, lacking in courtly manners. Now he was so formal that Grid felt embarrassed.\n\nBut only for a moment. Grid didn't miss the opportunity.\n\n\"There was no need to hide anything. You were all strong enough that I didn't need to reveal my full strength.\"\n\n*Can I really get away with claiming this?* Yes. Well, no—Braham had helped. But these were nobles of an enemy nation. He couldn't confess honestly. Grid chose to exploit their misunderstanding.\n\nThe method worked perfectly.\n\n\"You are this age's finest blacksmith, a swordsman, and someone who wields magic as well... Truly respectable.\" This from Duke Morse. He had a fierce and unruly temperament, but he showed respect to those he acknowledged. He deeply appreciated and revered strength.\n\nThe imperial knights were in an uproar. Understandably so. It was difficult to remain composed when a duke of the empire was—technically—groveling before an enemy king. This bordered on treason. Yet neither Duke Grenhal nor Empress Basara rebuked Duke Morse's behavior. As they studied Grid, their eyes gleamed with the same reverence. Empress Basara's face, in particular, had turned bright red.\n\n\"Do you normally hide your beauty on purpose?\"\n\n\"...?\"\n\n\"I understand. You must be swarmed by admirers because of your looks. You had to disguise yourself as plain to avoid attention.\"\n\n\"...\"\n\n*Wasn't I supposed to be handsome?* Grid looked aggrieved as he glanced toward Yura, who quickly averted her gaze.\n\nGrid was undeniably handsome—but standing next to Braham, he was merely a squid. The comparison was brutal. His heart ached. His expression turned gloomy.\n\n\"I'm truly grateful.\" Duke Grenhal bowed deeply, compensating for the half-mad states of Duke Morse and Empress Basara. \"Thanks to your aid, the three of us preserved our lives. Additionally, 300 knights and 5,000 soldiers were kept safe. Your Majesty is a benefactor of the Saharan Empire.\"\n\nGrid—no, Braham—had saved the dukes. Grid suddenly realized the magnitude of it. He'd saved the lives of three of the Seven Dukes who upheld the empire. As a result, he was now a benefactor to the Saharan Empire itself. They were dukes. The empire couldn't simply brush this aside.\n\n\"Just days ago, Your Majesty's kingdom was unilaterally invaded by the empire. Yet you saved us with a generous heart, extending a hand to the empire first. A small person like myself doesn't dare measure your magnanimity.\"\n\nThe atmosphere among the imperial knights softened. Moments ago, they'd been confused by Duke Morse's behavior. Now they bowed deeply to Grid.\n\n\"Once more, I am deeply grateful. I swear by the name of Grenhal—the empire will never forget today's grace.\"\n\nFollowing Duke Grenhal's oath...\n\n\"Thank you, Your Majesty!\"\n\n\"Thank you, Your Majesty!\"\n\nThe 300 knights shouted in unison. Duke Morse and Empress Basara added their courtesies.\n\n\"...\"\n\nIt was a scene for the history books. The king of a small nation, praised by the dukes and knights of the great empire. If word of this leaked, the world would be dominated by news of Grid rather than Great Demon Berith. Grid's reputation would soar to unprecedented heights.\n\n*He's on another level entirely.*\n\nLauel, the 10 Meritorious Retainers, Hurent, and Skunk all felt goosebumps.\n\nHurent and Skunk, in particular, didn't know about Braham. Their shock was immense. They believed Grid alone had orchestrated everything."
}