{
  "id": 103,
  "title": "Chapter 103",
  "content": "# Chapter 103\n\nA guild member stared at the masked figure. \"Mister...?\"\n\nThe Giant Guild members panicked as Grid suddenly pulled out a weapon. Private messages flickered through their party chat.\n\n<Why is he so angry? Did we do anything wrong?>\n\n<What's the big deal? Ah! Is it because we made Ibellin like that? ㅡㅡ;>\n\n<What? ㅋㅋHe's angry because of his colleague? ㅋㅋㅋ Does that make sense? He's been identified as a newcomer who only joined the Tzedakah Guild for a few days. How could he feel a sense of camaraderie after just a few days? An average person wouldn't feel like that.>\n\n<Maybe he's the kind type. Or maybe he had a relationship with Ibellin before joining the Tzedakah Guild.>\n\n<Wow... This is rotten ㅡㅡ Then this will be a headache...>\n\nGrey Bear sent another message as the guild debated. <Maybe his anger isn't because of Ibellin. Look. That person isn't even looking at Ibellin.>\n\nThe guild members paused.\n\n<If it isn't Ibellin, why is he angry?>\n\n<Do you see the anvil and production related items in front of the furnace? He seems to have been making an item.>\n\n<Aha~! He was! He ruined his work because of us! So he's upset!>\n\nOne of the members stepped forward, hands raised in a placating gesture. \"Did we disturb your work? We're truly sorry. We will compensate you, so please calm down first and put away your weapon. Then we can talk.\"\n\nHe gestured broadly. \"We came to invite you to the Giant Guild on Chris' order. How about it? Isn't it an honor? Are you happy? Have some of your upset feelings gone away?\"\n\nThe members exchanged confident glances. They had visited smithies several times and watched the tedious process of item creation. Two to three hours on average. Sometimes longer. The blacksmiths would sit hunched before the flames for three or four hours at a stretch.\n\nOne or two epic items would emerge every month. Everything else was garbage. This unknown craftsman was probably the same. Slightly better, perhaps. More epics. But still just a production class. Still just a blacksmith.\n\nThe speaker waved dismissively. \"Now, put away your sword. Isn't this too shameful just because we disturbed the production of an item? Hahaha!\"\n\nGrid's hand tightened on the weapon. \"... Just?\"\n\nHe stopped mid-swing.\n\n*Kwaduduk.* The sound of grinding teeth filled the smithy.\n\n\"Just the production of an item?\" Grid's voice was low and dangerous. \"Have you ever tried making an item? Are you making fun of my class? Have you ever thought about my efforts and perseverance? Huh?\"\n\nHe took a step forward. \"You think you can disregard me, just because you're a member of a cool guild?\"\n\n*Kkuok!*\n\nHis grip on <span class=\"rarity-unique\">Dainsleif</span> turned white-knuckled. Battle-ready.\n\nIbellin dragged himself upright, health bar flickering in the red. The Fighter's Beliefs passive had saved him. Barely. He opened a whisper channel.\n\n*Grid, calm down first. There are 12 people! Grid will be hurt if you fight alone! Please buy time until I recover!*\n\nIbellin had seen Grid's strength during the Malacus raid. The masked man was powerful. Strong. But twelve opponents, all estimated above **Level 150**? Grid was only **Level 97**. The math didn't work. No chance of winning a twelve-against-one fight.\n\nBut Grid's jaw set behind the grotesque skull helm.\n\n\"These jerks...\" He rolled his shoulders. \"I don't like your tone even when you are apologizing. I will kill you.\"\n\nGrey Bear clicked his tongue. *Really dumb. The silly words of these idiots stimulated the craftsman.*\n\nTheir orders had been clear. Persuade or kidnap Grid while the main Tzedakah force was occupied. But their team leader had died twice to Ibellin and been forcefully logged out. No one was in charge. No one to negotiate properly.\n\nGrey Bear shrugged internally. *Doesn't matter.*\n\nThe opponent was a blacksmith. The bizarre helmet and greatsword looked threatening, sure. But it was just aesthetics. A blacksmith couldn't actually wield a greatsword effectively. What could he do, really, even angry? If conversation failed, they'd just take him by force.\n\nGrey Bear and the Giant Guild prepared to move.\n\nGrid took one step forward.\n\n*Kwajajak!*\n\n\"Eh?\"\n\nSteel cleaved through flesh. The smiles vanished from the Giant Guild members' faces. A player collapsed, health bar plummeting.\n\n\"Kuaack!\"\n\nA single blow. No special skills. Just a swing. Their colleague's health dropped below half in one strike.\n\n\"No way!\"\n\nThe victim was an assassin. High damage, low defense, minimal health pool. But even accounting for that, the attack power was wrong. Blacksmiths weren't damage dealers. They were production classes. Weak attack power. Support roles.\n\nBut Grid's strike had been devastating.\n\n*What is with this blacksmith?*\n\n*An assassin is fast. But he was hit without being able to escape. From a blacksmith?*\n\n*How can a blacksmith even handle a greatsword properly?*\n\nGreatswords required immense strength. Warrior-level stats. This particular weapon looked even larger and heavier than standard models. How was Grid, a blacksmith, wielding it so perfectly?\n\n*Damn! What is this?*\n\nGrid moved while they processed. The stunned assassin tried to recover. Too slow.\n\n*Kwajajak!*\n\n> [Your party member Kido has died.]\n\nSilence.\n\nTwo hits. Their colleague was dead from two hits. The Giant Guild stood frozen.\n\nIbellin's eyes widened behind his own helmet. *Strong!*\n\nDuring the Malacus raid, Grid hadn't shown exceptional combat skills. Just high stats. Lucky timing. Good equipment. Ibellin had assumed Grid was primarily a blacksmith with some fighting ability as a bonus. That assessment had been catastrophically wrong. Grid moved like a veteran warrior. Experienced. Skilled.\n\nThe evaluation was accurate. Grid had spent a year wielding greatswords. Hunting the same low-level area daily. Slow progression. Tedious grinding. But he'd built a solid foundation. Muscle memory. Combat instincts. Those fundamentals had blossomed after acquiring Pagma's Descendant and the corresponding stat bonuses. <span class=\"rarity-unique\">Dainsleif</span> was the catalyst.\n\n*Dainsleif... Great!*\n\nGrid checked the weapon stats.\n\n---\n\n**<span class=\"rarity-unique\">Dainsleif (Reproduction)</span>**\n\nRating: Unique  \nDurability: 500/500  \nAttack Power: 451~635 **(+165)**  \nAttack Speed: -8%\n\n* Additional damage equal to 10% of the target's current defense will be dealt.\n* The greater the number of enemies, the greater the damage.\n* The skill 'Golden Flash' will be generated.\n\n---\n\n*I knew it specialized in fighting multiple enemies, but this much damage...*\n\nAfter Kido's death, the remaining eleven members of the Giant Guild had been flagged as hostiles. <span class=\"rarity-unique\">Dainsleif</span> responded accordingly. **+165** attack power. Fifteen points per enemy. Against a hundred opponents, that would be **+1,500** attack power.\n\nThe base maximum attack was **635**. Already one of the strongest weapons in the game. The additional scaling threatened to shatter any semblance of balance.\n\n*There must be a cap on the bonus damage. Has to be. But still...*\n\nGrid felt a flicker of professional envy.\n\n*Compared to my unique items, Dainsleif's performance is outstanding. My skills still haven't reached Albatino.*\n\nThe creator of <span class=\"rarity-unique\">Dainsleif</span> was the human blacksmith Albatino. A master craftsman. Yet he'd failed to acquire the title of legend like Pagma. Grid, by contrast, was already legendary by virtue of his class. Pagma's Descendant. But he wasn't as skilled as Albatino. Not yet.\n\n*I need to put in more effort. First, I will jump over Albatino and then Pagma. But before that...*\n\nHe needed to deal with these bastards.\n\n\"I will make you pay for ruining my item! Blacksmith's Rage!\"\n\n> [Blacksmith's Rage has been activated. Your attack power and attack speed will increase significantly for 20 seconds.]\n\n\"Ohhhhhh!\"\n\nPower flooded Grid's limbs. He swung <span class=\"rarity-unique\">Dainsleif</span> horizontally. Two Giant Guild members standing adjacent caught the blade simultaneously.\n\n*Kwang!*\n\n\"Kuk!\"\n\n\"What?\"\n\nThey raised weapons and shields defensively. The greatsword's weight drove them backward, boots scraping across stone. The terrible force behind the blow eliminated all doubt.\n\n\"This... No, he isn't a blacksmith!\"\n\nGrey Bear's voice cracked. \"We were tricked! He isn't the unknown craftsman! These vile Tzedakah people set up a trap!\"\n\n\"Let's get out of here!\"\n\nThey'd walked into an ambush. A setup. The Giant Guild members bolted for the door. Retreat. Survival. Report back.\n\nGrid had no intention of letting them escape.\n\n\"You're trying to run away?\"\n\nHe opened his inventory and pulled the <span class=\"rarity-unique\">Ideal Dagger</span> free. Quick Movements activated.\n\n> [Quick Movements has been activated. Your agility and evasion rate will increase significantly for 1 minute.]\n\n\"Good.\"\n\nHis body felt lighter. Faster. Grid vaulted over the crowd of stunned spectators, using shoulders as stepping stones. He swung <span class=\"rarity-unique\">Dainsleif</span> downward mid-leap.\n\n*Kwajajak!*\n\n\"Kuaaack!\"\n\nOne of the fleeing members crashed to the ground. System notifications flooded his vision.\n\n> [You have been hit by a blow!]\n\n> [You have suffered 5,900 damage.]\n\n> [The durability of the Adolph Full Plate Armor has decreased by 80.]\n\n> [The broken pieces of armor penetrated deep into your body. There will be a continuous bleeding effect until the pieces are removed.]\n\n\"Cough! This is impossible!\"\n\nMaksevun stared at his shattered armor in disbelief. He was a pure tank. Every stat point invested into **Stamina**. Maximum defense. Specialized build.\n\nBut Pagma's Swordsmanship granted Grid **+20%** physical damage and **+10%** critical hit chance passively. Blacksmith's Rage boosted attack power further. <span class=\"rarity-unique\">Dainsleif's</span> passive added damage equal to **10%** of the target's defense. The numbers stacked. Compounded. Even Maksevun's optimized defense meant nothing.\n\n*Even an ogre couldn't endure this blow!*\n\nThey should have recognized the danger immediately. A blacksmith wielding a greatsword. The unknown craftsman was far stronger than Ibellin, one of the 10 Rookies. Grid was the Tzedakah Guild's hidden weapon. Their ace.\n\n*We were wrong.*\n\n*We have to escape!*\n\nThe Giant Guild members abandoned the wounded Maksevun without hesitation. Spectators be damned. They sprinted for the exit.\n\nGrid swapped to the <span class=\"rarity-unique\">Ideal Dagger</span> again. Wind Blast erupted from the blade, cutting off their retreat path. He switched back to <span class=\"rarity-unique\">Dainsleif</span> mid-stride.\n\n\"Pagma's Swordsmanship, Wave!\"\n\n---\n\n*Glossary of Common Korean Terms.*  \n*OG: Glossary Link.*\n\n*Current schedule: 20 chapters a week.*\n\n*Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.*"
}