{
  "id": 1030,
  "title": "Chapter 1029",
  "content": "**[Affinity with Duke Grenhal of the Saharan Empire has reached 50. Grenhal will gladly share a meal with you at any time.]**\n\n**[Affinity with Duke Morse of the Saharan Empire has reached 30. Morse will respond warmly to your humor.]**\n\n**[Affinity with Duke Basara of the Saharan Empire has reached 62. Basara will view your requests favorably.]**\n\nGrid exhaled slowly as the notifications appeared. Surrounded by imperial dukes and knights, he savored the strange sweetness of this moment. These same nobles who wouldn't spare him a glance just a few years ago now offered genuine goodwill and praise. The transformation felt surreal—a validation he'd never expected, impossible to capture in words alone.\n\nA tremor ran through him. Not from fear, but from pure satisfaction.\n\nThen doubt crept in. *Why is Basara's affinity the highest?*\n\nHe'd conversed extensively with Grenhal, the head of the Seven Dukes. Their handshake alone had triggered his dexterity effect—impossible to suppress—and saving the man's life had skyrocketed their rapport. Yet somehow, Basara's affinity exceeded Grenhal's, despite her reserved demeanor and their limited interactions. She maintained strict boundaries between duty and personal matters, rarely engaging beyond necessity.\n\n*Strange...*\n\nGrid turned toward the waterfall. The fifty-two cascades had weakened to mere streams after Braham drained their mana. Below them stood the war god follower—a warrior who'd mastered ten secret techniques, only slightly weaker than the yangban Garam himself.\n\nThat formidable enemy now teetered on the edge of death. His legs hung by strips of skin, trembling uselessly. His left arm had been severed completely, along with both ears. Blood poured from his neck in a steady stream. The dignified warrior who'd overwhelmed both the dukes and the 10 meritorious retainers mere moments ago now looked utterly broken.\n\n*Better finish this quickly.*\n\nLess than ten percent of the follower's health remained. In his deteriorated condition, he posed minimal threat.\n\n\"On your feet.\"\n\n\"Yes, Your Majesty.\"\n\nGrid gestured to the knights and advanced. He needed to deliver the killing blow before the war god could descend again while Braham slept. More importantly...\n\n*He's mine!*\n\nThe dukes couldn't be allowed to claim this prize.\n\nEach footfall brought Grid closer to his quarry. Greed blazed in his eyes as he imagined obtaining a *perfect* secret technique while calculating the experience this kill would yield. Followers occasionally dropped damaged fragments of secret techniques—worthless as skill books, but tantalizing glimpses of power.\n\nGrid closed the distance and initiated a sword dance. \"Pagma's Swordsmanship.\"\n\nSword energy and mana flowed from his body simultaneously. Blue radiance enveloped the Sword Aiming at the Gods as four distinct spells manifested in perfect harmony. The prelude to Linked Kill Flower Pinnacle.\n\n**[Swordsmanship and magic have achieved unity!]**\n\nThe notification appeared as Grid targeted the one-armed follower struggling to maintain a defensive stance.\n\n**[The world recognizes you as a magic swordsman.]**\n\n**[A new class has been granted to define your path.]**\n\n**[Third Class 'Magic Swordsman of the Epics' acquired.]**\n\n*Ding~*\n\n**[Magic Swordsman of the Epics]**\n\n**[Rating: Legendary (Growth Type)**\n\n**A magic swordsman born from Pagma's legacy and Braham's blessing—your epic begins with legend and culminates in myth.]**\n\n**[Class Effect: Sword energy and mana permanently increased by 20%.]**\n\n**[Class Effect: Magic and swordsmanship unified. All skill cooldowns permanently reduced by 10%.]**\n\n**[Class Effect: Strength and Intelligence permanently increased by 100 points.]**\n\n**[Class Effect: Gain 2 additional stat points per level. Bonus points automatically allocated to Strength.]**\n\n**[Additional benefits unlock when Magic Swordsman of the Epics reaches myth rating.]**\n\n**[Your status has risen dramatically. You have become extraordinary.**\n\n**The special passive 'Origin True Energy' has been created.]**\n\n**[★Origin True Energy★**\n\n**Possessed: 3**\n\n**Consume one charge to double a specific stat for one minute.**\n\n**Consuming all three charges permanently halves all stats.**\n\n**★Consumed Origin True Energy cannot be recovered.★]**\n\nGrid's breath caught. Origin True Energy. He knew this concept intimately—had witnessed its terrible price firsthand. Mercedes had drawn upon this power against the cave cricket, unable to handle the backlash. The strain had aged her prematurely, transforming her beautiful blue hair to stark white. Guilt twisted in Grid's chest at the memory.\n\nHe bit his lip and forced the thought aside.\n\n*I won't touch this. Not even if I'm dying.*\n\nThree uses. After three uses, permanent crippling. The risk far outweighed any temporary gain.\n\nEnchant Weapon, Detect Force, Lightning, Wind Cutter... Linked Kill Flower Pinnacle merged with magic and struck the follower. The warrior attempted a counterattack martial art, but fighting with one arm proved futile. Grid continued his assault with Transcended Link Flower and Pinnacle Kill.\n\n\"Kugh...! Cough!\" The follower's health depleted. Collapsing into a pool of his own blood, he gasped, \"Thank... you.\"\n\nGrid recoiled instinctively. Until now, every follower he'd encountered had been a respawning monster.\n\n\"My name is Merlin...\" The ten-technique master spoke clearly despite his wounds. \"I... abandoned everything... trained for fifty years pursuing the path the war god showed me...\" His voice grew fainter. \"Couldn't see the end... blinded by despair. Now... finally over. I... welcome... the rest.\"\n\nNot a monster. An NPC. A person.\n\nMerlin began dissolving into gray ash. Grid's teeth ground together. Rather than celebrating his new class, fury consumed him—rage directed at War God Zeratul. In Merlin's story, he glimpsed echoes of Pagma's tragedy.\n\n*How many lives has he destroyed?*\n\nCountless souls must have suffered like Pagma and Braham. The injustice burned.\n\n**[War God Zeratul observes you.]**\n\n—*Are you baring your teeth at me?*\n\nThe voice that manifested in Grid's mind carried no emotion—no displeasure, no concern. Naturally. To an arrogant god, a mortal's hostility meant nothing. This indifference twisted Grid's expression further. That leisurely dismissal made his blood boil.\n\nThen the curse took hold—punishment for slaying the follower.\n\n**[You feel uncontrollable rage!]**\n\n**[You must release your anger!]**\n\n**[You cannot distinguish friend from foe!]**\n\n\"Kugh!\" Grid's vision bled red. The world spun violently, sky and ground trading places. He staggered, disoriented, struggling to regain balance.\n\nWhen clarity partially returned, hundreds of followers surrounded him. The dukes, knights, and his precious companions had vanished without trace.\n\n\"You bastards!\"\n\nThey'd hurt his allies? Grid prepared to unleash a sword dance.\n\n—*Calm yourself.*\n\n**[The blacksmith god Hexetia restrains you.]**\n\n\"Grid! Grid! Wake up!\"\n\n\"Ah...\" \n\nHis crimson, spinning vision normalized. The hundreds of followers disappeared. In their place stood his companions, the dukes, the knights.\n\n*No...*\n\nThe \"followers\" he'd perceived—they'd been his allies. He'd nearly attacked them with his own hands. The god's curse. A chill crawled down Grid's spine as he comprehended the punishment's true horror. His shoulders trembled.\n\n\"What happened? See a ghost?\"\n\nYura, Jishuka, and the others gathered around him supportively. They offered no words, just warm gazes. That silent comfort anchored Grid.\n\n\"Not a ghost. A monster.\" Grid smiled faintly and checked his status. He systematically suppressed the emotions the curse had unleashed. Killing the ten-technique master had granted a massive twenty percent experience boost, yet no perfect secret technique had dropped—only a damaged fragment now occupying his inventory.\n\n*Is this the real reward?*\n\nGrid left the follower's death site and approached the waterfall's hidden passage—the place Merlin had been guarding. Skunk theorized treasure lay within. Upon entering, murals covered every surface. Mysterious, dreamlike artwork reminiscent of Buddhist imagery adorned the walls, simultaneously beautiful and unsettling.\n\n\"This will take considerable time to interpret.\" Skunk spoke to himself, though his sparkling eyes betrayed his enthusiasm. Each unraveled mural would reveal another piece of the story. Grid activated his Insight stat and surveyed carefully, soon discovering a small cave entrance.\n\n\"Let me go first.\" Faker intercepted Grid and advanced cautiously, using his assassin's abilities to detect traps. After confirming safety, he signaled the party forward.\n\nThe cave extended roughly one hundred meters into the mountain.\n\n\"This is...\"\n\nAt the cave's terminus, an enormous mural dominated the wall. Humans rendered ant-small bowed toward the heavens. The object of their worship remained unclear—only a brilliant red radiance filled the sky. Not the sun. This light burned brighter and larger than any celestial body.\n\n\"Given this location, it must symbolize the warriors.\" Skunk approached the mural for closer examination, then tilted his head. \"Strange, though. Typically, worshippers in such depictions show longing or joy. These humans are *screaming*.\"\n\nThe cave trembled. Ground swelled upward, forming an altar. Atop it rested an ancient box.\n\n**[Secret Technique Box]**\n\n\"It's locked too—\" Skunk never finished. Grid produced the master key and opened it immediately.\n\n*Absurd.* Skunk clicked his tongue.\n\n***\n\n**Meanwhile, at the ruins' waterfront...**\n\n\"Finally arrived.\"\n\nAn imperial ship dropped anchor. The reinforcements had taken twice as long as anticipated, but they were here at last.\n\n\"Well, well...\" Drunk Duke Diworth leapt from the vessel and laughed upon spotting a ship bearing the Overgeared Kingdom's flag. \"The war continues, it seems.\"\n\nDiworth carried the shame of letting the enemy king slip through his fingers. A stain on his long career. A mistake demanding correction.\n\n\"Wait for me, Overgeared King. This time, I'll take your head.\"\n\nIt should be noted that Diworth's power ranked one tier below Grenhal, Morse, and Basara."
}