{
  "id": 1032,
  "title": "Chapter 1031",
  "content": "Rankers possessed exceptional talent, relentless drive, and iron determination. Their pride in their achievements ran deep. Faker was no different. If he could truly claim the title of best among two billion players, he'd at least be able to face his grandfather without shame.\n\nBut one man had changed everything. One man had shifted that perspective completely.\n\nGrid.\n\n\"You should have taken this for yourself,\" Faker said.\n\nHe'd acquired Fly on Top of Grass through Grid's generosity, and the guilt gnawed at him. The technique's effects far exceeded his expectations—a twenty percent boost to all speeds, with movement speed doubling in forests and grasslands. Grid needed this power, not him. Faker cursed himself for accepting such a gift. Even the assassin renowned for being 'undefeated in PvP' felt humbled in Grid's presence.\n\nGrid exhaled slowly. \"No. I'm glad you learned it.\"\n\nHe meant every word. Sure, the speed increase would have benefited him. He already used buffs to push his velocity to the limit, and after glimpsing the world through his transcendent perception, he understood this was likely his ceiling. At least for now. The difference another boost would make remained questionable.\n\nBesides, he had no regrets about giving Faker the secret technique. The doubled movement speed in forests and grasslands—that was the real prize. Unlike Grid, Faker spent his days gathering intelligence across the entire continent. The thought of his friend traversing those vast distances multiple times each month had always bothered Grid. Now, at least, he could ease that burden.\n\nMore than that, Grid relied on Faker far more than anyone realized.\n\n*Faker needs to keep getting stronger.*\n\nGrid had sparred with his guildmates hundreds of times over the years. He'd lost count somewhere past five hundred. Dozens of those matches had nearly stripped away his immortality buff. And Faker? Faker had pushed him harder than anyone else. The assassin's ability to dismantle an entire guild single-handedly was already legendary within Overgeared, and he'd only sharpened that edge with time. If anyone in the guild would one day surpass Grid, it would be him.\n\nEven the War God had singled Faker out, claiming the assassin was only beginning to tap into his true potential. Unlike Grid, who'd have to shatter his limits to grow stronger, Faker's path forward was smoother, faster, more natural. Grid welcomed that future. He needed Faker ready to fill the void during his inevitable absences.\n\n*And if...*\n\nIf he failed to overcome the limitations of being Pagma's Descendant... If he lost his position to Kraugel and the Overgeared Kingdom faced destruction...\n\n*When that time comes, Faker has to be the strongest. He'll have to support everyone.*\n\nGrid entrusted that wish to his friend. That's why he'd given away Fly on Top of Grass, even when he could have claimed it himself. Of course, his trust wasn't limited to Faker alone. Every person here carried Grid's faith and expectations. This was all for their sake.\n\n\"The imperial soldiers and the Skunk Expedition Group have arrived.\"\n\n\"Mm.\" Grid nodded.\n\nHe was determined to secure every secret technique in these ruins. No matter how strong someone became, there were limits to what one person could accomplish alone. True strength came from unity—from people who could respond to threats and seize opportunities together. Grid listened to Lauel's report while studying the faces of his companions and the dukes waiting outside the barracks.\n\nGrenhal approached. \"I've instructed the soldiers to establish a new camp here. We'll challenge the next trial while the Skunk Expedition Group remains behind to study the murals.\"\n\n\"Good. Let's move.\"\n\nGrid led the way. The dukes fell in behind him without question, following his lead as naturally as breathing.\n\n\"Hrmm...\"\n\nBeyond the fifty-three waterfalls, the valley opened onto a long river. In the distance, a mountain rose from the earth—modest, no more than a thousand meters high. Yet something about it felt wrong. Not a single blade of grass clung to its slopes. Just bare gray rock stretching from base to peak.\n\nThick fog shrouded the summit, obscuring it even from Jishuka's eagle eyes. The darkness up there was absolute.\n\n\"Something's not right...\" Hurent muttered, his face darkening.\n\nA greater trial awaited them there—he was certain of it. Currently, his strength was sufficient to handle one follower, maybe two if he pushed himself. Honestly, joining this expedition felt almost pointless.\n\nThough if he'd come alone, hunting in these ruins would be impossible. But he wasn't alone. They crossed the river and began their ascent.\n\n\"What are these secret techniques supposed to be?\"\n\nFollowers continually emerged to challenge them.\n\n\"I'm up! These ones are mine!\"\n\nThe Overgeared members had adapted to the followers' patterns and hunted them with gleaming enthusiasm. Perfect coordination bypassed the followers' attacks and counterattacks, reducing them to ash within moments. No matter how powerful the followers were, they remained normal monsters—helpless before this concentration of elite rankers. Thanks to his teammates, Hurent felt minimal fatigue while watching his damage accumulation and experience bar climb steadily.\n\n*This... this is what real party play looks like.*\n\nHurent had little experience working with players of this caliber. Finding anyone stronger than himself had always been difficult, and past team attempts had felt painful, restrictive. Solo play had seemed more comfortable. Now, that perception was crumbling. Hunting together proved far more efficient than going solo. Growth came faster this way. The thrill of coordinating with such powerful players ignited something inside him—rekindled that primal hunting pleasure he'd forgotten during his years of farming.\n\n*Damn. I can't go back to how things were.*\n\nIt was intoxicating. The raw, visceral pleasure that games were meant to provide was flooding through him. Hurent understood it now. After experiencing this, leaving the Overgeared Guild would be impossible. He didn't want to leave. He wanted more of this.\n\nOne factor made all the difference. Grid's presence at the vanguard made everything easier for his companions—hunting became several times faster and infinitely safer. That's what this really was—Hurent was experiencing a Grid carry. And he couldn't help but become addicted to it, much like his farming sessions with Piaro.\n\n[You have discovered the War God Temple!]\n\nIt had been difficult to locate. The group scaled the rocks with ease and soon reached the mountain's peak, where a temple stood wreathed in dense fog. Ancient and weathered, it looked ready to crumble.\n\nWould a follower who'd mastered ten secret techniques be guarding this place?\n\nGrid, the dukes, and the Overgeared members held their breath. They observed their surroundings carefully, keeping their distance from the temple. Then a voice cut through the silence.\n\n\"I wondered who else could have made it this far.\"\n\n*Step. Step. Step.* Hundreds of footfalls echoed closer. The party turned toward the temple entrance. Familiar faces emerged from the mist. Zhang Jian, Liao Wei, Mei Xiao, and more—Chinese rankers who'd made their mark during past National Competitions. Around two hundred in total. And among them, someone with deep ties to the Overgeared Guild.\n\n\"The Overgeared Guild. I'm not surprised you reached here so quickly.\"\n\nChina's strongest player. Every ranker present acknowledged his supremacy. The first player to achieve half-draconian status.\n\nHao.\n\nChina operated under the Communist Party's absolute authority—individual rights took second place to government directives. When the Ruins of the War God emerged, the Chinese government issued orders to all Chinese rankers, including Hao: depart immediately, secure as much of the War God's power as possible.\n\nChina's greatest asset was its population. Chinese players dominated every field. Hao's party had needed time, but they'd successfully mapped a route to the ruins. They arrived while Grid's group was still tied up in the waterfall valley for several days. With the jungle traps already cleared by Grid's earlier passage, they'd breached the jungle without difficulty and reached the temple first—bypassing the valley entirely.\n\n\"Grid.\" Hao's expression was grim. \"I'm sorry, but you need to turn back.\"\n\nThe Chinese rankers—everyone except his sister Mei Xiao—had already drawn their weapons and leveled them at the Overgeared members. Hao sighed and explained. \"The leadership took interest after the National Competition. Rumor has it they're furious that China didn't take first place. This is the result. We have to secure these secret techniques and grow stronger. We have to show progress for next year's competition. I know it's shameless to ask, but... I hope you'll yield this to us.\"\n\nOnce, Hao had been their enemy. He'd fought against the Overgeared members repeatedly. Through those conflicts, he'd come to acknowledge Grid's strength and develop respect for both the man and his guild. He'd even traveled to South Korea personally to bring Grid information about Kraugel.\n\nThis hurt. Hao didn't want to block Grid and the Overgeared Guild for such absurd reasons, but he had no choice. Foreigners living in modern society might not understand, but in China, the Communist Party's commands were absolute.\n\n\"I understand the situation...\" Grid's expression turned troubled, but before he could respond—\n\n\"You dare stand in our way?\" Morse's voice cut through like thunder.\n\nOne of the empire's Seven Dukes surged into the midst of the Chinese rankers atop his saber tiger.\n\n\"Who the hell is that?\"\n\n\"Is this some new subordinate of Grid's?\"\n\nThe Chinese rankers didn't recognize him. The empire's dukes were famous, certainly, but the idea that one would be traveling with Grid? Impossible. Just days ago, a massive war had raged between the Overgeared Kingdom and the empire. Grid and an imperial duke as companions? The man beside Grid was a duke...?\n\nNo sane person would make that leap.\n\nMorse's fist struck with the force of an explosion. He ignored the counterattacks from the Chinese rankers entirely, his punch sweeping dozens of them aside like leaves in a storm.\n\n\"...?\"\n\n\"...\"\n\nGrid felt a stab of sympathy for the Chinese rankers, who stood frozen in shock at the overwhelming destructive force. Awkward silence blanketed the area. Then Morse roared, \"It is a crime to obstruct a duke of the empire and the king of the Overgeared Kingdom! I, Morse, will punish you!\"\n\n\"Wait, what? What is this?\" The Chinese rankers went pale, their faces masks of disbelief.\n\nA delighted smile spread across Hao's face. *This is perfect.*"
}