{
  "id": 1033,
  "title": "Chapter 1032",
  "content": "Many players opposed the Saharan Empire—most, really. What modern person could sympathize with an empire that discriminated against other species and cultures, proclaiming itself the only righteous path? Sure, plenty of players joined for the infrastructure benefits, but few showed genuine devotion to the empire itself.\n\nThe exception? A significant portion of Chinese players favored the Saharan Empire. To them, the empire's aggressive posture toward neighboring territories mirrored their own nation's foreign policy. The empire's ideals seemed justified, its dominance natural—even admirable. Bold. Strong.\n\nNot all Chinese players felt this way, of course, but enough did that they'd taken to calling the Saharan Empire \"Satisfy's China.\" The rankers gathered here were no different. To them, the empire represented another version of home, and its nobles—wielding \"appropriate authority\"—were figures to aspire to. Among those nobles, the Seven Dukes stood at the apex.\n\nWhich made the current situation utterly baffling.\n\n\"Why is Grid...?\"\n\nThey were *defending* Grid. The king of some backwater kingdom. No—it went beyond defense.\n\n\"Your Majesty, these insignificant wretches dared point their weapons at you. Please, calm yourself. We'll handle this.\"\n\nDuke Grenhal dismounted from his two-headed hippo—the creature struggling against the rocky terrain unlike the nimble saber tigers—and addressed Grid like a subordinate addressing his emperor. His breathing was ragged from the climb, yet his deference was absolute.\n\n\"What? What the hell is going on?\"\n\nSure, Grid dominated among players. But against NPCs? He was just another adventurer. Academic consensus placed the Seven Dukes among the most powerful beings on the West Continent. Grid couldn't compare. Hell, the Overgeared Kingdom had recently *fought* the empire. Grid's knight had killed Sky King Rigal. By all logic, the dukes should hate Grid's guts.\n\n'So why are they treating him like royalty? This doesn't make sense.'\n\nThe Chinese rankers sent to the historical site were all veterans. They ran through every scenario, every angle, but couldn't piece together how this relationship had formed.\n\n\"Maybe... a brainwashing skill?\" Zhang Jian muttered.\n\nRumors existed of hidden class users with brainwashing abilities. Supposedly, you could manipulate NPCs into offering favorable quests. The catch? Higher-level or higher-quality NPCs became exponentially harder to affect. Named NPCs were essentially immune. And the Seven Dukes? They were among the most powerful named NPCs in existence.\n\nBesides, the odds of Grid having such a skill were laughably low. Whatever bond existed between Grid and the dukes, it wasn't built on tricks.\n\nThe Chinese rankers' confusion deepened.\n\n\"The laws of the Saharan Empire are absolute,\" Grenhal declared, his tone casual despite the harsh words. \"Obstructing an imperial duke carries an immediate death sentence.\"\n\nHe drew his sword.\n\nThe Chinese rankers—who'd championed the empire—suddenly found themselves on the receiving end of its \"justice.\"\n\n\"This is tyranny!\"\n\n\"You'll kill us just for being in your way?!\"\n\nStrength without accountability. Power wielded selfishly. The unfairness of it struck them like a slap. They'd never considered what it felt like to be crushed under the empire's heel until now. Resentment boiled in their chests, but the dukes didn't even blink.\n\nGrenhal raised his blade.\n\n\"Please, wait!\" Lauel rushed forward.\n\nNot that Lauel had any love for these rankers. They'd tried to monopolize the ruins and kill Grid's party—unforgivable. But after encountering the follower with ten secret techniques, Lauel had grasped the site's true difficulty. Grid's party plus the dukes might not be enough to clear it all.\n\n\"We could use their strength,\" Lauel began. \"Spare them, and they'll cooperate. They won't dare demand—\"\n\n\"I have no intention of cooperating with you, even if you spare my life.\"\n\nHao's voice cut through the negotiation like a knife. Spear in one hand, chain in the other, he declared, \"We fight to the death!\"\n\n\"Are you insane?!\" The other Chinese rankers exploded.\n\n\"Cooperating with Overgeared is better than dying here!\"\n\n\"If we die, we're banished outside the Red Sea! Do you know how hard it was to get here? We got lucky on the journey—there's no guarantee we can return!\"\n\nThe Chinese rankers were nearly screaming, unable to comprehend Hao's judgment. But Hao didn't waver.\n\nHe knew exactly what would happen if they cooperated. They'd secure some secret techniques, sure. Then the Chinese rankers would demand ownership rights. Right now, they talked reasonably to save their skins. Later? They'd do whatever served their interests. He'd seen it happen countless times.\n\n'And when that time comes, I'll be forced to take their side.'\n\nHao's position in China remained precarious. Surrendering to Grid had earned him the label of traitor. The Communist Party had warned him—given him this expedition as a test of loyalty. If China and Overgeared clashed over the secret techniques, what punishment awaited him if he sided with Grid?\n\n'If I side with China, I ruin my relationship with Grid.'\n\nUnacceptable. Grid was one of the few people he truly admired. He wouldn't let their bond shatter.\n\n'Better to cut this off before it spirals.'\n\n\"We came here to grow stronger!\" Hao shouted at the other rankers. \"How does begging for our lives make us stronger? It's an insult! A disgrace! Do you want to face the Leader's wrath?!\"\n\nThe Chinese rankers' expressions twisted. The Leader commanded both respect and fear.\n\n\"Damn it... He's right. Better to die fighting.\" Liao Wei clicked her tongue. No matter what, Chinese rankers couldn't beg for their lives. Not from Grid. He was Korean.\n\n'The Leader was already furious we underperformed against South Korea at the National Competition. If word gets out we groveled to a Korean...'\n\nIt was inefficient. Wasteful. But the choice was clear.\n\nFight to the death.\n\nThe Chinese rankers steeled themselves and readied for battle.\n\nGrid and Peak Sword watched the scene unfold, understanding dawning on their faces. As Koreans, they were intimately familiar with Chinese politics. They knew exactly what concerned Hao, why he'd forced this confrontation. Lauel caught on moments later.\n\nThe dukes turned to Lauel.\n\n\"Do you still want to spare them?\"\n\n\"...No. Do as you will.\"\n\n\"Hrmm.\"\n\nGrenhal and Morse stepped forward side by side. Grenhal gripped his sword; Morse wore gauntlets on both hands. Both fixed their gazes on Hao.\n\nWings erupted from Hao's back. The dragon's latent power within him surged wild and unrestrained.\n\n\"Let's show them China's might!\"\n\nFlames seemed to pour from Hao's mouth like breath.\n\n\"*Ohhhhh!*\" The Chinese rankers' spirits soared. They might call Hao a traitor, but they respected his strength.\n\nHao's chain lashed out at Grenhal like a striking viper. Grenhal's shield intercepted—then Mei Xiao's cloth wrapped around it, yanking the shield from the duke's grip.\n\n\"Hm!\" Surprised by the chain's force, Grenhal had been careless. The Hao siblings were exceptional—comparable to followers with five secret techniques.\n\nThe Chinese players unleashed a coordinated assault, weapons and skills flooding toward Duke Grenhal like a tsunami. It was a spectacular sight—proof of why China ranked as a Satisfy superpower behind only the United States.\n\nThe Overgeared members braced for impact. Surely Grenhal would take significant damage, no matter how strong he was. Morse's surprise attack had killed dozens, yes, but over 150 Chinese rankers remained. That was no small force.\n\nEspecially Hao. The pressure radiating from him was overwhelming. Dragon energy coiled around his spear, containing such destructive force that even Grid flinched.\n\nBut the opponent was simply too strong.\n\nGrenhal ignored the onslaught entirely. He swung his sword once. Moonlight energy blades erupted outward, crushing every skill before they could reach him.\n\n\"...!!\"\n\nHao's left arm—covered in dragon scales—was severed. Chinese rankers began disintegrating into ash.\n\nGrid felt electricity run down his spine.\n\n'They've been holding back.'\n\nThat counterattack—its range and power far exceeded Revolve. This was Grenhal's true strength.\n\n'If we weren't at the 53 waterfalls, Grenhal could've killed the follower with ten secret techniques alone.'\n\nAnd there was no guarantee Grid would fare any better.\n\n'Spear Saint Rachel and Sword Duke Limit are even stronger than Grenhal. Are they equal to that follower?'\n\nGoosebumps prickled Grid's skin. Even these mighty Seven Dukes and followers would have to bow before Yangban Garam. To operate freely on the East Continent, he'd need to deal with Garam somehow. But how?\n\n'I keep getting stronger, but why do I still feel so inadequate?'\n\nThe NPC growth system was broken. Completely unfair to players. Would players *never* surpass NPCs?\n\nGrid clenched his fists. Without realizing it, he started rooting for Hao.\n\nThe battle intensified. The army of Chinese rankers—a force Grid wasn't certain he could defeat—was being slaughtered by Grenhal and Morse's overwhelming power. Only one man remained standing.\n\nHao. His left arm gone, dragon scales peeling from his body.\n\n\"*OHHHHHH!*\"\n\nHis fingernails extended like blades. With his broken spear discarded, Hao drove those claws into Grenhal's chest.\n\n\"Kh...?!\" Grenhal grunted. Morse and Basara's eyes widened in shock.\n\nGrid's shock mirrored theirs. Watching Hao fight, the despair about players never surpassing NPCs transformed into hope. *It could be done.*\n\nHao's satisfied smile turned toward Grid. *I owe you a great deal.*\n\nGrid nodded silently. *It was an honor. I won't forget this.*\n\nGrenhal's sword descended toward Hao's neck.\n\nThen—\n\n[The **Different Species' King** title effect is activated.]\n\n[The title effect of **Different Species' King** is limited to three uses. Are you sure you want to use it?]\n\nFor the first time since absorbing the Evil Eyes species, Grid activated the title."
}