{
  "id": 1034,
  "title": "Chapter 1033",
  "content": "Grid's sharp mind hadn't dulled—far from it. He'd left the **Different Species' King** title untouched not from laziness or ignorance, but from calculated caution. No sense wasting such a precious resource without careful consideration.\n\nThe title was only as valuable as the partner who shared it.\n\n> **[Different Species' King]**\n> \n> You have proved your worthiness to rule by embracing non-human races.\n> \n> **★ Permanent Effects**\n> * Non-human species hold you in high regard.\n> * Affinity gain rate with different species is doubled.\n> * Warlike species may challenge you to prove your strength.\n> \n> **★ Limited Effects**\n> * Enables the 'Contract' system.\n> * **Contracts Available: (3/3)**\n\n> **[Contract]**\n> \n> Propose a contract to any non-human species.\n> \n> The contracted target will **awaken** and strengthen their racial characteristics. You will gain some of their racial traits.\n> \n> **Contracts cannot be broken by you.**\n> \n> However, your partner may terminate the contract at will, causing you to lose the acquired trait. The contract also ends upon their permanent death.\n> \n> **Used contract slots cannot be recovered.**\n\nThe benefits were undeniable. Acquiring traits from other species offered staggering potential. Contract with the Evil Eyes' King, for instance, and Grid would likely manifest an evil eye—no lengthy affinity grind required.\n\nYet he'd never offered the king a contract. He hadn't even approached Sticks, despite their close bond.\n\nNot from distrust. Not from fear of betrayal.\n\nFrom something more painful: the certainty of death.\n\nUnlike players, NPCs were mortal. Even a high elf with millennia ahead would eventually fall. What if tragedy struck? If Grid failed to protect them, the contract—and the trait—would vanish. Three precious slots, wasted.\n\nThe logical conclusion: contract only with players.\n\nSound reasoning. One problem.\n\nFinding suitable candidates was damn near impossible.\n\nFirst hurdle: locating players who'd transformed into non-human races. Unlike traditional MMOs where you picked your species at character creation, Satisfy offered no such option. Becoming a dwarf, orc, elf, or goblin required completing obscure hidden quests—quests as rare as the one that had granted Grid the chance to become a half-god.\n\nIn all his time playing, he'd encountered only a handful of transformed players.\n\nSecond hurdle: even finding one wasn't enough. Their racial traits had to be *useful*. And more critically, Grid had to trust them completely. A one-sided contract termination would waste a slot and strip him of the acquired trait.\n\nTrust took years to build. The bonds with his guildmates had been forged through shared trials and countless battles. How long would it take to find new candidates and cultivate that same level of confidence?\n\nBut today—\n\n> **[The title effect of Different Species' King is limited to three uses. Do you wish to proceed?]**\n\n\"Yes.\"\n\nToday, Grid had witnessed Hao's iron resolve. Felt the young man's genuine respect. He was certain he could trust Hao.\n\nAnd Hao was a half-draconian.\n\n\"I'll contract with Hao.\"\n\n> **[Target designated: Player 'Hao']**\n> \n> **[.........]**\n> \n> **[.......]**\n> \n> **[.....]**\n> \n> **[The target has accepted!]**\n> \n> **[You will randomly acquire a half-draconian trait as your contract reward!]**\n> \n> **[...Calculating with your extraordinary luck stat...]**\n> \n> **[Congratulations! You have acquired the highest-tier draconian trait: 'Dragon Wings'!]**\n\n\"...!?\"\n\nGrid's eyes went wide. His entire body trembled.\n\nThen he completely lost his composure—right there in front of hundreds of fallen rankers, with the Overgeared members and imperial dukes watching.\n\nGrid threw his arms skyward and roared, \"YEEEEESSSSS!\"\n\nThe shout echoed through the fog-shrouded temple grounds.\n\n*Creeeeeak.*\n\nThe ancient doors of the Silent Temple groaned open.\n\nThe dukes, stunned by Grid's outburst, turned as one toward the widening entrance.\n\n*Step. Step.*\n\nAn elderly monk emerged from the mist, clad in simple cotton robes.\n\n\"Huhuhu... it's been centuries since we've had visitors.\" His kind smile lifted long white eyebrows. \"Come, come. You should pay your respects at the War God's shrine first.\"\n\n\"...\"\n\nDespite his gentle manner, Grid and the Overgeared members remained tense.\n\nBecause of the name hovering above the old monk's head.\n\nNot *War God Follower*.\n\n\"What are you waiting for? Please, enter.\"\n\n**[Bentao].**\n\nThe benevolent smile never left the monk's round face—as permanent as a clown's painted grin.\n\n***\n\nIn the capital of Ark Kingdom, at the heart of the Rebecca Temple...\n\nPure white light coalesced at the resurrection point, gradually taking human form. As the radiance faded, a figure materialized.\n\n\"Hrmm...\" A black-haired man stood there, handsome features framed by sharp eyes and a refined nose.\n\nAs a high ranker, death and resurrection were old companions. He checked his status window and inventory with practiced efficiency: 38% experience lost, item durability reduced, spear destroyed.\n\nDeath always exacted a steep price.\n\nHis expression darkened as he calculated the recovery time.\n\n\"I need more training.\"\n\nHao didn't blame others. He only criticized his own weakness and vowed to train harder.\n\n\"Brother, are you okay?\"\n\nA cute girl with twin ponytails approached, her voice subdued. Mei Xiao—Hao's younger sister.\n\nOrphaned young, she worked hard to maintain a cheerful facade. Even now, she managed a smile.\n\n\"I'm fine. Sorry for worrying you.\"\n\n\"My level's low. I can recover quickly.\"\n\n\"You're right. What's done is done. No use dwelling on it.\"\n\nHao patted her head with calloused hands—the hands of someone who'd held a spear since childhood at the martial arts academy.\n\n*Duke Grenhal is strong.*\n\nThe duke's strength and stamina were twice Hao's own. His swordsmanship, honed through decades of training, had pierced through dragon scales like silk. An opponent far beyond Hao's current capabilities.\n\n*Absolute supremacy.*\n\nNo amount of effort would let Hao challenge Grenhal. Not yet. How had Grid befriended such a powerhouse? An enemy noble, no less.\n\n*Did Grid craft an item for him?*\n\nNo—too simple. Named NPCs couldn't be bought with wealth. If they could, every rich player would have legendary subordinates.\n\nAs Hao's thoughts deepened—\n\n> **[Different Species' King, Player 'Grid' has proposed to share the 'Oath That Transcends Species' with you, a half-draconian.]**\n> \n> **[The King who proved himself to all non-human races can only make three such contracts. Accepting will elevate your status.]**\n> \n> **[Your half-draconian traits will awaken and strengthen.]**\n> \n> **[Grid will gain some of your racial characteristics.]**\n> \n> **[You may terminate this contract at any time. If terminated, Grid will lose your traits. However, your awakening effects remain permanent.]**\n> \n> **[Do you accept?]**\n\n\"...\"\n\n*The contract completely favors me.*\n\nThat was his first thought.\n\nOnly Hao could break the contract, not Grid. And only Grid would suffer from its termination. An offer that couldn't be made without absolute trust.\n\n*One-sided for a reason.*\n\nGrid could only make three such contracts. If he maintained all three, the cumulative benefits would be staggering. Perhaps even unfair.\n\nThese restrictions existed to balance the scales.\n\n*I see now...*\n\nHao understood why Grid could attract even enemy nobles. The trust offered first. That overwhelming sincerity.\n\n\"I accept the contract.\"\n\n*I won't betray your faith in me*, Hao swore silently.\n\n> **[You have accepted the contract of Different Species' King, Player 'Grid'.]**\n> \n> **[Status elevation awakening half-draconian traits...]**\n> \n> **[Dragon scales, dragon breath, and dragon wings have been strengthened.]**\n> \n> **[Your dragon blood has thickened. Draconian Transformation has increased from Level 2 to Level 3.]**\n> \n> **[Draconian Transformation bonuses increased: Strength, Agility, Health, and Resistance now grant +20% (up from +15%). Fire affinity and regeneration strengthened. Flight stability greatly improved.]**\n> \n> **[Your skills remain insufficient.]**\n> \n> **[You have become a bridge between 'Grid' and the half-draconians. While this contract persists, half-draconian aggression toward Grid will be significantly reduced.]**\n\n\"...!\"\n\nPower surged through Hao's veins.\n\nThen the final notification struck him.\n\n*Half-draconian aggression... reduced?*\n\nDuring his racial quests, Hao had visited the half-draconian settlements. Their savagery had been absolute—inherited from Bunhelier, the evil dragon who'd sired them. He'd thought reconciliation between them and humanity impossible.\n\n*Their strength...*\n\nEven Duke Grenhal's power was limited to the human world.\n\nRemembering the half-draconians' true might, Hao's expression shifted."
}