{
  "id": 1035,
  "title": "Chapter 1034",
  "content": "Which lingered longer—moments of joy or moments of crisis? For Grid, the answer was always crisis. It was instinctive, a defense mechanism etched into his psyche to prevent repeating the same mistake. One particular crisis still haunted him...\n\n> [You have heard Bentao's wicked laughter. Your composure crumbles at the sound.]\n> [Composure has been lost. All active skills are being forcibly canceled.]\n> [You have heard the half-god Insane Clown King Bentao's enticement. Resistance: Failed.]\n> [You have entered a state of 'Frenzy.' Recovery time: 1 minute.]\n> [While frenzied, your base damage increases slightly and defense decreases slightly. Additionally, casting speed and resource consumption of all skills increase drastically.]\n> [Bentao extends his hand while you lose control. Your health has been exchanged with Bentao's owner.]\n\nThe first battle with Agnus. Grid could still recall every notification window that had appeared as the fight spiraled into disaster. The shock had been profound. A half-god... What manner of being was Bentao to have challenged the Seven Malignant Saints? And how had Agnus gained access to such power? Questions without answers.\n\n\"The Blacksmith God Hexetia gave tools to humanity.\"\n\nNow, Bentao stood before him. But was this the same Bentao? The phantom summoned by Agnus' Bentao's Mockery had unleashed laughter dripping with malice and cruelty. The Bentao before Grid now wore a kind, trusting smile. His deep gaze radiated only benevolence. No trace of madness remained.\n\n\"War God Zeratul taught humanity how to wield those tools.\"\n\n\"...?\"\n\nThey followed Bentao deeper into the temple. Grid studied him intently, unease gnawing at his instincts. Finally, Bentao stopped before a faceless stone statue.\n\n\"Pierce the beast with your sharpened spear. Cook food to sustain yourself and your family. If someone covets your meal, sever their hand with your knife. If someone threatens your safety, disembowel them with your blade. The sharper your sword and spear, the safer you become.\"\n\n*Clap.*\n\nBentao's hands came together in a loud crack. He bowed his head before the statue, then turned to face Grid's party. \"These tools exist for violence.\"\n\n\"...\"\n\n\"Violence is the path by which you and your family live in peace.\"\n\n\"...\"\n\n\"Humanity's greatest blessing was the War God bestowing martial arts upon mankind.\"\n\nGoosebumps rippled across the Overgeared members' skin. Bentao spoke with a gentle expression and soothing voice, yet the words themselves were brutal and merciless—the dissonance made it all the more unsettling. Despite his appearance, Bentao's presence carried nothing charitable. This was the Insane Clown King Bentao, who had warred against the Seven Malignant Saints who sought humanity's peace. Grid felt certain of it now.\n\n\"You glorify violence. Is this Zeratul's doctrine?\" Lauel asked on behalf of the agitated party.\n\nBentao nodded. \"Indeed. I trust you find our church's teachings... sympathetic?\"\n\n\"...?\"\n\n\"After all, you trampled the followers with violence to reach this place. You are qualified.\"\n\nIn that moment...\n\n> [A Hidden Piece has been discovered!]\n\nThe notification materialized before every Overgeared member simultaneously.\n\n> [You may convert to the Hidden Class 'War God Follower'!]\n> [As a War God Follower, your Strength, Stamina, and Agility will permanently increase by 15%, and you will randomly acquire four Secret Techniques!]\n> [However, you will lose your existing class and all class-specific skills.]\n> [Will you become a War God Follower?]\n\nOne of the Ruins of the War God's greatest rewards. The hidden class, War God Follower—an opportunity granted only to those who passed the trials, reached Zeratul's temple, and proved themselves qualified.\n\n'This...!' Grid instantly refused the class change, then whipped his gaze toward his companions. Each of them hungered to grow stronger. The War God Follower class would tempt them. Especially those stuck with normal classes—the appeal would be irresistible.\n\n\"No...!\"\n\nBut Grid had glimpsed the reality behind the War God Followers. They were slaves to an impossible goal, forever chasing something beyond mortal reach. If a player became a follower, the system would torment them with an unwinnable quest—a permanent burden. They must never accept this. If they were blinded by the immediate gains of stats and secret techniques, they would suffer eternally.\n\nGrid reached out desperately to stop them.\n\n> [Will you become a War God Follower?]\n\nToo late. The Overgeared members had already seen the notification. They made their choices before Grid could intervene. Their choice...\n\n\"Hoh...\" Bentao's eyes flashed. \"You all refused to become War God Followers?\"\n\n\"...!\" Grid froze.\n\nThey *all* refused the hidden class...?\n\nVantner and Pon especially had complained about their classes more than once. Grid's companions grinned at his bewilderment.\n\n\"We can't exactly change classes now, can we?\"\n\n\"I'm aiming to become the strongest Guardian Knight. I have no interest in following the War God.\"\n\n\"...Ah.\" Grid caught the trust and determination burning in their eyes. The Overgeared members had walked alongside him for a long time. They envied him, yes—far more than the average player envied him. But for them, Grid was the goal. Grid was the dream. Not the War God. The War God Follower class held no appeal whatsoever.\n\n\"Kukuk...! Kuhahaha! Kuhahahat!\" Bentao grabbed his belly as laughter erupted from his lips. The sound was frivolous and manic rather than warm, reverberating through the chamber. The Overgeared members, already wary from the start, tensed.\n\nBentao formally introduced himself. \"I am the half-god Bentao. After a lifetime of training, I reached the Peach Blossom Spring, yet I never glimpsed the reality of godhood.\"\n\nEnergy began to rise around him—a majestic white aura radiating from his rotund frame. The spiritual pressure emanated an icy chill that cyclically warmed like spring sunshine. Astonishingly, it carried the power to nurture life. Flowers and trees sprouted from between ancient tiles laid across the temple grounds.\n\n\"Long ago, I descended to the mortal realm to carry out a god's will—to punish seven wicked souls. To identify those deceived by the Seven Evils and track them down, I wandered the entire continent disguised as a clown. What I discovered at the end of that journey was darkness hidden within blinding light... The Seven Evils were not evil.\"\n\nBentao waved his hand. The temple's architecture dissolved. The ground beneath the party transformed into a paradise blanketed with beautiful flowers and trees. Lush rice paddies stretched into the distance, and massive lotus leaves floated across a tranquil lake. Far beyond a stone wall stood a tree bearing white peaches. A sweet fragrance permeated earth and sky.\n\n> [You are the first players to discover the Peach Blossom Spring!]\n> [As a reward for discovering the Peach Blossom Spring, you have received a White Peach!]\n\n\"...?\"\n\nA large, plump peach materialized in each Overgeared member's hands. Bentao observed them briefly before turning away. \"I heard the Ruins of the War God had opened, and I feared that evil roused by the aesthetics of violence would emerge. Thus, I sought to test your eyes for a moment. Forgive me.\"\n\nThat was all. Wind swept through the paradise, and the scenery flipped. Then Bentao dissipated like morning mist.\n\nGrid shouted urgently, \"Someone on the surface is using your power! How can they wield it?\"\n\n\"It was Baal who killed Insane King Bentao...\" A faint reply reached them, trailing off mid-sentence. Then the party's vision darkened once more.\n\n***\n\n\"...\" Grid's party regained awareness to find themselves standing atop the mountain.\n\n\"What are you doing?\" The dukes' voices rang out. Looking back, the nobles hadn't witnessed the temple visit at all. When had the party fallen under Bentao's illusion? It felt surreal. Distinguishing reality from illusion proved difficult. It was as if they'd all fallen asleep simultaneously—yet it had clearly been real. A white peach sat in each Overgeared member's inventory as proof.\n\n> **[White Peach]**\n> A mysterious peach that grows only in the Peach Blossom Spring.\n> It possesses a heavenly flavor and extraordinary potency.\n> When consumed, all health and status abnormalities will recover, and character experience will increase by 30% regardless of level.\n> *Can only be consumed once in a lifetime.\n> **Weight:** None\n\n\"...\"\n\nHad they chosen to become War God Followers, they'd be standing at the resurrection point right now. Basara urged the contemplative Overgeared members forward. \"The temple is empty—nothing of value remains. Let's move to the next location before nightfall.\"\n\nBelow the mountain spread a field of reeds rising to human height. Three or four followers clustered together, wandering through the stalks. Individual battles were now impossible—they'd need to face multiple enemies simultaneously.\n\nThe real challenge was beginning. They would fight without respite. The prepared Overgeared members descended the steep mountain as followers in the field welcomed them with drawn weapons. The party and dukes crossed the field in search of secret techniques. The more their bodies were wounded, the stronger they became.\n\n***\n\nNo humans remained in the ruins that had been the Rotemon Kingdom's capital mere days ago. Only the dead and demons roamed the wreckage, while Great Demon Berith occupied the throne of the fallen kingdom.\n\n> [The Rotemon Kingdom has been destroyed.]\n\nA shocking world message.\n\n> [22nd Great Demon Berith will launch a new march with two armies.]\n> [Berith's next destination is the Haken Kingdom.]\n\nA grim warning followed. The broadcast cameras captured Berith rising from the throne and beginning his march.\n\n『 According to the US Bureau of Statistics, this incident has displaced 42 million players. Approximately 280 million quests have been permanently destroyed. The resulting economic losses will affect reality... 』\n\n—Ah, shit. What am I supposed to do if I'm from Haken Kingdom?\n\n—There's a hidden quest to protect my hometown, but how...\n\n—The Haken King's brain has completely shut down. No military mobilization whatsoever.\n\n—What about the Saharan Empire? They usually meddle in everyone's business, but now they're staying quiet?\n\n—Why should the Empire get involved? They'd suffer massive losses fighting a great demon. Why do that for another country?\n\n—This is a continental threat, you idiot. Everyone's in danger.\n\n—Even the Overgeared Guild isn't doing anything ㅋㅋ. Game's finished.\n\n—S.A Group, what were you thinking releasing a boss this overpowered??\n\n—Seriously, what a disaster of game design...\n\n—When's that new VR game Briton coming out?\n\n—Delayed indefinitely after harsh criticism from closed beta ㅎㅎ.\n\n—This really fucking sucks.\n\nExperts across all fields predicted this situation would devastate half the continent. Players worldwide trembled with anxiety and fear. Some rankers argued that all players should unite to stop Berith, but few actually stepped forward. Most simply prayed the Empire would halt Berith before he reached their kingdom. Additionally...\n\n\"Hey! Zibal! Are you insane?\"\n\nIn Titan, capital of the Saharan Empire...\n\nThe Magic Machines Unit under 4th Imperial Prince Edan had erupted into chaos. One of the four magic machine riders—Zibal—had moved his machine without authorization.\n\n\"...Damn it, I'm from Haken Kingdom.\"\n\nZibal, formerly second in the unified rankings, had risen to the rank of earl in Haken Kingdom. Most of his connections there persisted to this day—he couldn't simply watch the kingdom fall. Haken's destruction would cost him dearly, both materially and emotionally. There was also a hidden quest to defend his hometown.\n\n\"Screw this! I'm just going to take a look!\" Zibal squeezed his eyes shut, roared at his superiors, and departed.\n\n4th Imperial Prince Edan arrived belatedly, hearing the commotion. He laughed as Raiders vanished into the sky. \"What a convenient excuse.\"\n\nThe Emperor had deployed every conceivable justification to block the Magic Machines Unit's deployment—preventing Edan from accumulating achievements. Edan had seethed at his father's obstruction, so he welcomed this incident.\n\n\"What can I do if a soldier acts on his own initiative? Not my problem, is it? Kukuk, the whole world will finally witness the magic machines' true power.\"\n\nSimultaneously, at Kirinus' hut...\n\n\"Stop.\" Spear Saint Rachel threw down her spear. The declaration came abruptly.\n\nKirinus frowned. \"The victor hasn't been decided yet?\"\n\nRachel's temper flared. \"Dammit, we've been fighting for nearly two months. How much longer before there's a winner? Hit me. I surrender.\"\n\nIn truth, Rachel's motivation had evaporated a month ago. However, Sword Saint Kraugel had constantly provoked her, making retreat impossible. Rachel had reached her limit. She would concede. Fighting Kirinus, her equal, felt like wasted time. There was nothing left to learn, no victory to achieve.\n\nAt that moment, Kraugel interjected, \"You've surrendered, so Sir Kirinus has won.\"\n\nRage flashed through Rachel momentarily.\n\n\"Sigh. I'm not falling for your provocations anymore.\" She reined in her emotions. Rachel wanted to reach the historical ruins immediately. Having failed to defeat Kirinus, her desire for the War God's secret techniques had only intensified. This was precisely what Kraugel sought to prevent. He wanted Grid to monopolize the ruins' rewards—he couldn't allow this monstrous woman to arrive and claim Grid's prizes.\n\nThus, he made a suggestion. \"Why not change the victory condition?\"\n\n\"How?\"\n\n\"Whoever deals more damage to Great Demon Berith?\"\n\n\"Hoh...\"\n\nBoth Kirinus and Rachel showed interest. Rachel's knights looked ready to weep.\n\nMeanwhile, Kraugel exhaled with relief.\n\n'If I can delay Haken Kingdom's destruction...'\n\nHe could minimize casualties until Grid returned from the Ruins of the War God. Then, once Grid emerged, they would raid Berith together."
}