{
  "id": 1036,
  "title": "Chapter 1035",
  "content": "**Chapter ???**\n\n---\n\nThere was a way to defeat Berith—or so the theory went.\n\nThe site of the demon's summoning lay far beyond the Saharan Empire's reach. Too far for imperial forces to intervene, and ordinary kingdoms lacked the strength to withstand such a creature. If Berith was to be stopped, players would have to take up the burden.\n\nBut that was impossible. If left to players alone, half the continent would burn. Hundreds of billions of quests would be lost forever. Hundreds of millions of players would see everything they'd built reduced to ash.\n\nCould S.A. Group truly want that outcome?\n\nSome intellectuals thought not. The company must have designed a strategy. They simply had to find it.\n\nThe key lay in one detail: the 33 Great Demons were based on Solomon's 72 demons.\n\nBaal holding the first rank, Belial's existence, Berith himself—the parallels were undeniable. Not every demon might share identical traits with their mythological counterparts, but the foundation remained. And according to Solomon's grimoire, Berith could be controlled through the Magic Ring.\n\n\"We can drive Berith back to hell with it,\" the theorists argued. \"The balance won't allow us to fully control a Great Demon—that would be absurd. But we should be able to command him to return.\"\n\n\"And how exactly do we obtain this Magic Ring?\"\n\n\"We make it.\"\n\n\"Make an item capable of banishing a Great Demon? One player? Are you insane?\"\n\n\"Not one player. All of us together.\"\n\n---\n\nAt the border between the ruined Rotemon Kingdom and Haken Kingdom, Zelgah—the 1st ranked alchemist—had gathered defenders. Five thousand players stood before him, their expressions ranging from skeptical to hostile.\n\n\"Alchemy and lies.\" A warrior spat on the ground. \"Sure, Berith matches Solomon's description in some ways. But his rank is different. Twenty-eighth in the Lesser Key, twenty-second in Satisfy. The setting has been altered.\"\n\nMurmurs of agreement rippled through the crowd. If the developers had changed one thing, what guarantee did they have that Berith's weakness remained the same?\n\n\"What happens when your Magic Ring fails?\" someone called out. \"What do you plan to do then?\"\n\nZelgah remained calm. He'd expected this resistance.\n\n\"You want our cooperation?\" Another voice, sharper now. \"Let me guess—you need money?\"\n\nThe crowd pressed forward, hostility crackling in the air. These weren't casual players. They'd come here to defend their home, prepared to sacrifice everything for the relationships and assets they'd built over years. From their perspective, Zelgah looked like a conman preying on desperate people.\n\n\"No.\" Zelgah's voice cut through the noise. \"I don't want your money. The material required for the Magic Ring is the Stone of Life. It's the ultimate alchemy stone—priceless.\"\n\nSilence.\n\nThen someone laughed—a harsh, disbelieving sound.\n\n\"...You're not a scammer. You're just insane.\" The speaker's face twisted with contempt. \"First ranked alchemist? More like a fraud with no pride. The Stone of Life is fantasy. Myth. You're telling us we can't make the ring at all, which means you have no strategy. You're wasting our time.\"\n\nHands moved toward weapons. Several players stepped forward, murder in their eyes.\n\nZelgah didn't flinch.\n\n\"Did you know that a few months ago, Agnus went on a killing spree? Murdering accessory makers across multiple kingdoms.\" He let the words hang. \"The Overgeared Guild claimed he was framed. But the truth is obvious—he was hunting for something specific.\"\n\n\"What the hell does that have to do with—\"\n\n\"He was making the Stone of Life.\"\n\nThe crowd went still.\n\n\"Agnus possesses it. And according to my intelligence, he's currently in Haken Kingdom.\"\n\nShock rippled through the gathered players.\n\n\"Obviously, we can't take it from him by force.\" Zelgah looked across the five thousand faces watching him. \"But we can make him surrender it willingly. We use public opinion. Berith threatens two billion players. When the world learns what Agnus has—when they learn it could save them—the pressure will be overwhelming. He'll have no choice.\"\n\nThe logic was sound. Beautiful, even. Agnus gives up one item, and they raid Berith. The moment this information spread, millions would turn their eyes toward the necromancer. None of the people standing here would need to risk anything.\n\n\"Let's say Agnus yields.\" A woman crossed her arms. \"Then what if the Magic Ring doesn't work?\"\n\n\"I'll bear all blame. All consequences. You have my word.\"\n\nA chance to solve their problem without dirtying their hands. Even if it failed, they'd lose nothing.\n\n\"...Alright.\" The crowd's mood shifted. \"We'll spread the strategy. We'll call for Agnus to surrender the Stone of Life. But if this goes wrong, you take full responsibility.\"\n\n\"Of course. I don't have the power to resist you anyway.\"\n\nZelgah smiled.\n\n---\n\nThe campaign spread like wildfire.\n\n*(Haken Kingdom players discover method to banish Great Demon Berith!)*\n\n*(Berith raid strategy requires 'Magic Ring')*\n\n*(Magic Ring material: Stone of Life)*\n\n*(Stone of Life confirmed in Agnus's possession)*\n\n*(Thousands demand Agnus surrender the stone)*\n\n*(Agnus remains silent)*\n\n*(Accusations intensify by the hour)*\n\nFive thousand players contacted media outlets worldwide. They used every platform, every method, every angle. Within days, Berith's name, the Stone of Life, and Agnus dominated headlines across the globe.\n\nWhether the strategy actually worked didn't matter. Players clung to the possibility. Media outlets reveled in the controversy. High-quality drama that practically wrote itself. And if the plan failed? The public and media wouldn't suffer—only Agnus.\n\nThey cornered him without hesitation. After all, surrendering one item to save the world was the obvious choice.\n\nWasn't it?\n\n---\n\nInnsbruck, Austria. An ancient castle on the city's outskirts.\n\nAgnus sat alone in the darkness, blanket wrapped around his trembling shoulders. He stared at nothing, eyes hollow.\n\nA sinner again. Always a sinner. He didn't know why—he never knew why. In the past, in the present, forever drowning in contempt and reproach from faceless masses.\n\n\"Kuweek...\"\n\nEveryone hated him. No one stood beside him. He was alone. The reality of that isolation crashed over him in waves, dragging him down into fear and horror. His heart felt empty. A void that ached.\n\nBut then something shifted.\n\n\"Why...\"\n\nThe question emerged from somewhere deep inside. Why should he be their target? He'd sworn never to be weak again. There was no reason to succumb to senseless violence.\n\nAgnus stood.\n\nHis legs carried him toward the capsule he hadn't touched in days. His body still trembled—but not from terror. Rage burned through him now, hot and vicious. Rage at a world that persecuted him. Rage at the masses trying to steal what was his.\n\nHe logged in.\n\n---\n\n\"Wow. Really... I'm surrounded by creeps.\"\n\nZibal shook his head, disgust churning in his gut. Sacrificing the minority in the name of the majority. Hiding behind the word 'masses' to force sacrifice on others. Was this proof that human nature was fundamentally evil?\n\nThe sight of thousands of players chanting Agnus's name over an uncertain solution made him sick.\n\nHe clicked his tongue.\n\nAfter deserting his unit, Zibal had ridden Raiders for days to reach his home. But now that he'd arrived at Haken Kingdom, his burning sense of duty had cooled. Tens of thousands of players gathered beneath the walls, demanding Agnus sacrifice the Stone of Life for humanity's sake.\n\nWhat right did they have? Why didn't they use that enthusiasm to raid Berith themselves?\n\n\"Zibal! You really came!\"\n\nEarl Flenitium rushed forward and embraced him. The old NPC had fought beside Zibal for years—at first just a quest target, but eventually a genuine friend. The knowledge that the earl's life was finite filled Zibal with quiet dread.\n\n\"My home is in danger. Of course I came.\" Zibal managed a smile. \"Is everyone assembled?\"\n\n\"All except Marquis Yulan, who guards the king. But this place is chaos—we should go to my mansion.\"\n\n\"Um...\"\n\nWalking through the capital, Zibal witnessed the kingdom's desperation. Young parents learned to wield spears to protect their children. Children dressed in military uniforms to protect their elderly parents. Others simply sat in the streets and wept.\n\nCould he really protect them?\n\nHonestly? Zibal had no confidence. He'd seen what remained of Rotemon Kingdom. Great Demon Berith was a nightmare made flesh. But Zibal wanted to fight anyway. If even he turned away, the people of Haken Kingdom would die without hope.\n\n*...Crazy.*\n\nWas it the desperate situation? He kept wanting to rely on someone. Wanting someone stronger to stand beside him in the coming battle.\n\nThe person who came to mind was Grid—someone who'd frustrated him countless times. Why did the man he usually resented appear in his thoughts now?\n\nBecause he acknowledged Grid's strength.\n\n\"I'm past my prime now.\"\n\nZibal smiled bitterly. He wasn't weak—far from it. He was stronger than during his days leading the Seven Guilds, when he'd sworn to become the best. \n\nBut Grid was something else entirely. Something special."
}