{
  "id": 1037,
  "title": "Chapter 1036",
  "content": "The Berith crisis had found a new target: Agnus.\n\nThe masses demanded he surrender the Stone of Life. Media outlets amplified their voices, validating the public's outrage and framing it as righteous indignation. But the entire narrative was wrong. There was no proof the Stone of Life could even harm Berith. And the public had no right to demand someone's personal property. So why had Agnus become the scapegoat?\n\nExperts offered their analysis.\n\n『 He made his own bed. Agnus built his reputation through player-killing—slaughtering anyone who stood between him and a hunting ground or quest objective. People fear him. That makes him the perfect target. When society faces unavoidable despair, it needs a vessel for its anxiety. Agnus has been chosen as that vessel—a symbol of hope through sacrifice. 』\n\n『 Whether the Stone of Life works is irrelevant. People need someone to blame, someone to direct their fear toward. Agnus fits the role perfectly. 』\n\nKraugel traveled toward the Haken Kingdom alongside Kirinus and Spear Saint Rachel. As night fell and his companions slept, he logged out—and felt his stomach turn.\n\nThe Agnus situation disgusted him.\n\n*Reap what you sow?* Bullshit. PKing was just a convenient excuse to justify mob mentality. The PK system existed for everyone—strong and weak alike. It protected rights, interests, and dignity. Plenty of players loved it for exactly that reason.\n\nHalf the pundits spouting sanctimonious garbage on those news panels probably PK'd regularly. But only Agnus was being crucified. Why? Because he was *easy*. Years ago, Agnus commanded the Immortal guild—a massive organization that made him untouchable. Now he was alone. Vulnerable. Just like when he'd been falsely accused and dragged to the guillotine before. The same people who once envied his freedom now wanted to tear him down.\n\n*And Zelgah is counting on exactly that.*\n\nZelgah was the puppet master. He'd weaponized public fear of Berith, turning the great demon into something to *avoid* rather than *raid*. The overwhelming majority of players couldn't challenge Berith anyway, so they eagerly embraced Zelgah's narrative. Enthusiasm for the raid cooled. Now Berith marched toward the Haken Kingdom unopposed.\n\n*The Stone of Life isn't what Zelgah wants at all.*\n\nHe wanted the Haken Kingdom destroyed. There was no other explanation. Kraugel was certain of it.\n\n*The Yatan Church is behind him.*\n\nThe Church's goal was summoning all thirty-three great demons to transform the world into hell. They needed Berith protected. But if they helped him openly, they'd unite humanity against them. So they worked through proxies like Zelgah.\n\n*Agnus was framed by the Church for those accessory maker murders from the start...*\n\nThis was a coordinated effort—protect Berith, eliminate Agnus. With the Church pulling strings behind the scenes, media and public opinion became weapons.\n\n*Rose...*\n\nThe black magician ranked first in her field. One of Yatan's Servants. Immense wealth and power at her fingertips. When Kraugel had encountered her, she'd seemed kind. Friendly, even.\n\n*She might be the most dangerous person in this whole mess.*\n\nRegardless, it was a nightmare scenario. Without players willing to raid Berith, Kraugel had to rely solely on Kirinus, Rachel, and her knights. It would be a brutal fight with no support. Kirinus' life hung in the balance.\n\n*Presumptuous or not, I need to ask Hao and Alexander for help.*\n\nHe needed enough power to guarantee a retreat route if things went south. Mind made up, Kraugel pressed the button on his smartwatch.\n\n***\n\n\"Damn it!\"\n\n\"Shit!\"\n\nAfter weeks of sailing, the imperial reinforcements finally reached the ruins. They'd hurried to support the vanguard who'd been here over a month. But the army's procession crawled forward at a tortoise's pace.\n\nTen thousand soldiers and dozens of nobles marched in a miasma of suspicion and paranoia, their eyes constantly darting to one another. At the center of this distrust sat Huroi, disguised as Earl Baget.\n\n\"Huhuhut...\" His was the only laughter among ten thousand confused and furious troops. Huroi was thoroughly pleased with himself. His high-level incitement had worked beautifully.\n\n*I've delayed the junction between advance team and reinforcements by triple the expected time. A complete success.*\n\nHis liege, King Grid, had already reached the site. He must have struggled to explore while evading the empire's watchful eyes—perhaps even suffered anxiety-induced hair loss with three dukes and their armies breathing down his neck.\n\n*If reinforcements had arrived during such a crisis...*\n\nHis liege would have been forced to abandon the expedition entirely. But Huroi had intervened. The supreme loyalist's scheming had bought Grid the time he needed to explore the ruins thoroughly. Huroi was confident he'd performed magnificently. He could practically hear Grid's praise echoing in his mind.\n\nMarquis Fulbas approached with a weary sigh. \"Hah.\"\n\nThe marquis' once-vibrant eyes were dull and lifeless. Dark circles had deepened beneath them. These past few months had been torture. Marquis Fulbas felt betrayed by colleagues he'd trusted his entire life. Every day was hell.\n\nHuroi dropped his smile, adopting Earl Baget's concerned expression. \"You seem troubled, my friend.\"\n\n\"Earl Silva is spreading rumors again,\" Marquis Fulbas muttered.\n\n\"That dog— No, why let his nonsense bother you?\"\n\n\"He said...\" The marquis' voice cracked. \"He said my daughter should enjoy a hundred years with her husband.\"\n\n\"What?! That piece of shit! The audacity!\"\n\n\"Haha... Indeed. I never thought I'd hear such a vile curse.\"\n\nThe marquis' daughter had married a forty-one-year-old man two years ago. An arranged marriage. Marquis Fulbas carried perpetual guilt over forcing his daughter to wed someone so much older. Her white-haired husband had recently begun showing signs of dementia. The marquis prayed daily for the man's death—so his daughter might find freedom, however late.\n\nYet Earl Silva, who'd shown him nothing but respect for twenty years, now wished his daughter *endure* a century with that deteriorating old man.\n\nThe betrayal and shock had broken something in Marquis Fulbas. His eyes grew wet. He felt adrift in a world where no one could be trusted.\n\n\"It's... disgraceful behavior.\"\n\nHad his entire philosophy of treating people with charity and kindness been wrong? The marquis hurriedly wiped his eyes, unable to meet Huroi's gaze.\n\n\"Please.\" Huroi offered him a handkerchief. It reeked of chicken droppings, but Marquis Fulbas accepted it gratefully.\n\n\"Earl Baget... you're all I have left.\"\n\n\"I will never betray you, my friend.\"\n\nTheir moment was interrupted by returning knights.\n\n\"The temple is empty, my lord.\"\n\n\"But we found evidence of a massive battle near the site.\"\n\nKnights who'd scouted the mountain summit temple delivered their report.\n\nDrunk Duke Diworth responded immediately, scratching his stomach while swigging from a bottle. \"A massive battle? I thought the followers only appeared individually.\" His eyes sharpened. \"Which means they weren't fighting followers at all.\"\n\nFor the first time in days, Diworth's expression turned focused. He'd grown sick of watching nobles backstab each other. Now he personally inspected the battle site near the temple, then gazed down the mountain slope. In the distance, a vast expanse of reeds—many crushed or sliced apart, stained with blood.\n\n\"The blood is still fresh. We move now.\" Diworth pushed past the bickering nobles. The advance team and Overgeared Kingdom had already clashed. The advance team was likely pursuing them even now.\n\n*I can't let Grid speak about Piaro.*\n\nDiworth admired Piaro, but the other dukes who'd once served alongside him would become emotional. No telling how Grid might exploit that. Better to link up with the advance team and cut off Grid's head first.\n\n\"Move out.\"\n\nDiworth descended the mountain at breakneck speed, not bothering to match the soldiers' pace. He seemed to forget anyone existed beyond the nobles and knights.\n\n*No—!* Huroi frantically chased after the suddenly accelerated procession.\n\nMeanwhile, at the reed field...\n\n\"Hah... hah... hah...\"\n\nThe ruins' difficulty had spiked dramatically upon reaching the reeds. The Overgeared members had spent days struggling through that field. Now they faced a fresh crisis without time to recover.\n\nFollowers who'd mastered six secret techniques had begun appearing in groups of four.\n\nSome possessed *Unconditional Counterattack* and *Unconditional Avoidance of Skills Seen More Than Twice*. Surrounded by thirty followers, the Overgeared members and dukes were utterly exhausted. The expedition felt impossible.\n\n*Shame to use the White Peach here. If I link 100,000 Army Swordsmanship with Astaroth's Strength, I might carve out an escape route.*\n\nGrid's vision flashed red. Vantner was dying. Grid's own health plummeted as he tanked the frontline. He had options for breaking through this immediate crisis—but could he trust the dukes?\n\nYura approached the hesitating Grid. Clad in brilliant white armor that matched her skin, she spoke with quiet resolve. \"I'll summon the elemental king.\"\n\nShe'd hesitated too. Revealing her contract with an elemental king carried political implications. But Grid and her guildmates were in desperate straits. She couldn't abandon them over politics. A circle of light formed around Yura as she began the summoning.\n\n\"Wait!\" Lauel thrust out his hand, making the decision Grid couldn't. Elementals represented power most humans could only dream of. The empire's desire for such creatures would be insatiable. Exposing the elemental king when their relationship with the empire remained uncertain was too dangerous.\n\nLauel tried to stop her—but the dukes moved first.\n\n\"Very few people in the empire know why they call me the Immortal King.\"\n\n*Trust...*\n\nGrid hadn't shown his hand. But the dukes revealed theirs first.\n\nGrenhal began removing the armor he'd worn throughout the entire expedition. Gauntlets. Greaves. Helmet. Shield. Chestplate. Each piece of heavy equipment crashed to the ground with thunderous impact.\n\nGrenhal stood revealed—a body covered in scars and corded muscle. His eyes blazed crimson.\n\n\"I'm a Berserker. The ultimate warrior. My attack power and blood-draining ability scale exponentially as my health drops.\" He flexed his fingers. \"This is who I truly am.\"\n\n\"Not many know why they call me the Beast King.\" Morse's body erupted with coarse fur. His teeth and nails sharpened into weapons. \"Because everyone who figures it out dies.\"\n\nThe transformation showed perhaps what Beastman Toon might ultimately become. Every eye turned to Basara.\n\nThe embarrassed duke flushed. \"I-I can't transform like that.\"\n\n\"...\""
}