{
  "id": 1038,
  "title": "Chapter 1037",
  "content": "**Chapter [X]**\n\n\"Then let's begin.\"\n\nDuke Grenhal rolled his shoulders, stepping forward with the casual ease of a man preparing for a street brawl rather than a battle. Gone was the refined noble—his expression turned predatory, muscles coiling beneath his skin like a prize fighter entering the ring. His eyes gleamed with barely restrained violence.\n\n\"This old dog needs to stretch his legs.\"\n\nPeak Sword swallowed hard, feeling the raw bloodlust radiating from the duke. Without warning, Grenhal exploded into motion. He crashed into the formation of followers like a battering ram, sword already arcing toward three opponents.\n\nThe followers reacted instantly. Strikes converged on Grenhal's chin and legs in perfect coordination.\n\nBut Grenhal's foundation held firm. Every warrior knew—power flows from the ground up. His stance remained immovable as he caught one follower's ankle mid-kick, then swung the man like a club. Skulls cracked together with sickening force. Before they could recover, Grenhal drove his shoulder into their guard and followed with a blade wreathed in crimson aura.\n\nThe wall of thirty followers parted like water.\n\nGrenhal's aura blazed outward in devastating arcs, each sphere of energy orbiting him like planets caught in the sun's gravity. Followers staggered back, bodies smoking from the assault.\n\nBut for every wound Grenhal inflicted, he took two in return. Blood—mostly his own—painted the canyon floor in dark streaks. The followers' counterattacks shredded him. Without armor, he had no defense against their overwhelming power. By any normal measure, he should have been dead.\n\nBut Grenhal was no normal warrior.\n\n*They become stronger as they bleed.*\n\nThat was the berserker's creed.\n\n\"*RAAAAAAGH!*\"\n\nThe Overgeared members recoiled. One of the followers simply... burst. Grenhal's fist had reduced the creature to pulp. Once his health dipped below thirty percent, his attack power transcended human limits. Even Grid, who prided himself on his offensive capabilities, felt a chill.\n\n*One hit would kill me.*\n\nImmortality might spare his life, but his armor—his body itself—wouldn't survive intact. Grenhal was a monster in his own right. If the duke who'd invaded Bairan had been Grenhal instead of Rigal...\n\n*I couldn't have protected anyone.*\n\nThe rampage intensified. Below twenty percent health, each swing of Grenhal's aura-coated fist became an execution. Followers died with every blow.\n\nGrid watched, anxiety building in his chest. The berserker's power was a double-edged blade—the more dangerous they became, the closer they danced with death. For all their devastating strength, they remained fragile, operating under brutal conditions and constraints.\n\n\"Stop! Snap out of it!\"\n\nGrenhal's health plummeted below ten percent. At this rate, he'd die. Berserkers didn't simply fight—they *drowned* in battle, losing themselves to the savage rhythm. The promise whispered in their minds: *Just a little more. A few more wounds. Then you'll be strong enough to win.*\n\nThat seductive lie killed more berserkers than any enemy.\n\n\"Dammit!\" Grid surged forward, then froze mid-step. \n\nWould Grenhal remain an ally once they left this place? Once they returned to the political realities of the surface world? The duke served the Saharan Empire—an empire that viewed the Overgeared Kingdom as an enemy. Someday, perhaps soon, Grenhal's sword might point at Grid's throat.\n\nMaybe letting him fall here would be... pragmatic.\n\n*No. Stop that.*\n\nHe'd deal with tomorrow's problems tomorrow. Right now, they needed Grenhal alive to survive this expedition. Beyond cold calculation, Grid *liked* the man. Despite his overwhelming strength, Grenhal carried himself with genuine nobility—respectful, courteous, elegant. Grid couldn't watch him die.\n\nDecision made, Grid began gathering fighting energy for his ultimate technique.\n\nA spear punched through Grenhal's chest. His health ticked below ten percent—and his aura blazed even brighter. The duke ripped the weapon free, decapitated its wielder, and suddenly his wounds began to *close*. Nearly five percent of his health returned in an instant.\n\n\"What?\"\n\nGrid lowered his weapon. The Overgeared members stood frozen in shock. Every attack Grenhal landed restored his vitality. His god-tier offensive power remained unchanged, but now combined with regeneration that would shame a direct descendant vampire.\n\nGrenhal's ravaged body—more wound than flesh—began knitting itself together. It defied every known law of the berserker class. Blood-sucking existed as a minor trait among berserkers, but the effect was negligible. Even Asuka, a high ranker with limitless resources and constant support from Black Teddy, barely managed to survive her most desperate fights through the ability.\n\nThis was different. This was *wrong*.\n\nDuke Grenhal wasn't simply a berserker. He was something beyond.\n\nThe final follower fell, skull caved in by Grenhal's gauntleted fist. As the last body hit the ground, the duke stood unmarred—as pristine as before the battle began. New wounds had vanished. Only his old scars remained, weathered badges of previous conflicts. It was as if time itself had reversed.\n\n\"...\"\n\n\"...\"\n\nSilence descended. Grid and his companions stared, caught between awe and primal fear. Then—\n\n\"...Urgh.\"\n\nGrenhal coughed. Blood spattered his lips. Before their eyes, the vanished wounds reappeared, carving themselves into his flesh like invisible blades.\n\n*What?*\n\nConcern replaced Grid's shock. Morse, who'd been systematically dismantling the reinforcement wave in his beast form, padded over.\n\n\"The power has a price.\"\n\nThough Morse's respect for Grid had deepened since witnessing Braham's possession, his bestial state made his tone rougher, more direct. Grid didn't care—he was too focused on Grenhal's suffering.\n\n\"He recovers during combat,\" Morse explained, \"but afterward, the damage returns. Permanently. Those wounds cannot be healed by any means—magic, potions, or divine intervention.\"\n\n\"The scars covering his body...\"\n\n\"Each one a battle he survived. For a man who fights for empire and people, I suppose they're medals of honor. Today, he earned another.\"\n\nGrid's jaw tightened. Grenhal had fought *for them*, knowing the cost. Morse shifted back to human form, fur falling away like discarded clothing.\n\n\"Duke Grenhal will need rest.\"\n\n\"I'll help.\" Grid moved before anyone else could, slipping his shoulder under Grenhal's arm. Up close, he saw the new scar splitting the duke's chest—a vicious line where the spear had pierced straight through.\n\n\"...You fought well, my friend.\"\n\nThey might become enemies tomorrow. Political realities didn't bend for personal feelings—not with the Emperor and Grandmaster pulling strings. Both men knew this truth.\n\nBut Grid chose the word deliberately: *friend*.\n\nWhat else could you call a man who bled for you, revealing his greatest weakness without hesitation? Grid repaid trust with trust, goodwill with goodwill.\n\n\"...Your Majesty.\" Grenhal's voice cracked. Throughout his career, people who witnessed his battle-madness either fled or recoiled in horror. But Grid saw past the blood and violence to the sacrifice beneath. He accepted Grenhal completely—both the power and the price.\n\nThe duke's gratitude went beyond words.\n\nAnd Grid wasn't finished.\n\n\"Do you know something?\"\n\n\"...What?\"\n\n\"My sister is a Saintess.\"\n\n\"...\"\n\n\"My *precious* little sister.\"\n\n\"...!\"\n\nGrid's gaze fixed on Grenhal's left shoulder—the wound carved deepest, limiting his mobility. No one could call *that* a badge of honor. Every time his right arm moved more smoothly than his left, the duke would feel that failure. Grid suspected it was why Grenhal's level lagged behind Rachel and Limit.\n\n\"You can meet her whenever you wish. Her healing abilities are... extraordinary.\"\n\n\"Thank... thank you, Your Majesty.\" Grenhal straightened despite Grid's support, trembling with emotion. Then—\n\n\"*Griiiiiiid!*\"\n\nThe reek of alcohol preceded the arrival.\n\n\"Finally! There you are!\"\n\nDuke Diworth materialized in a gust of displaced air.\n\n\"Hm?\"\n\nHe surveyed the scene—Grenhal shirtless, leaning against Grid—and smiled knowingly.\n\n\"Ah. Just before the kill.\"\n\nWhen Grenhal activated his berserker state, he became temporarily invincible. Even Rachel and Limit acknowledged they couldn't defeat the Immortal King once his power awakened. Diworth had expected to find Grid's corpse. Instead...\n\n*Wait. Something's wrong.*\n\nThe drunk duke's eyes sharpened, reading the camaraderie between Grid and the other dukes.\n\n\"You bastard! You used Piaro's name to manipulate him!\"\n\n\"Piaro?\"\n\nConfusion rippled through Grenhal, Morse, and Basara. Why would that name surface here? Still, one issue took precedence.\n\n\"Duke Diworth.\" Grenhal's voice turned cold. \"Avert your eyes.\"\n\n\"Huh? Duke Grenhal? Did I misunderstand—\"\n\n\"Don't *glare* at the Overgeared King.\"\n\n\"...?\"\n\nAs established, Diworth held the weakest authority among the Seven Dukes. Grenhal ranked near the top. Despite his drunken confusion, Diworth's gaze dropped immediately."
}