{
  "id": 1039,
  "title": "Chapter 1038",
  "content": "The empire thrived on rivalry. Nobles carved themselves into factions, each guarding their interests with jealous vigilance. Even the Seven Dukes—save the Sword Duke—maintained unwavering loyalty to the imperial throne while watching one another like hawks circling the same prey. In the worst cases, their conflicts escalated beyond words to bloodshed.\n\nSuch friction was inevitable. Each duke commanded millions of subjects across vast territories. Disputes over borders, resources, and ancient claims erupted constantly. One would fight tooth and nail to preserve ancestral holdings; another would scheme relentlessly to expand their domain. Yet despite their competing ambitions, the Seven Dukes shared one unifying trait.\n\nRespect.\n\nThey might fear each other. They might harbor deep-seated grudges. But publicly, they presented a united front of courtesy and civility. Honor demanded it. Together, they projected an image that the empire's highest nobility deserved universal reverence.\n\nIt was calculated image management. Which made the current situation all the more jarring.\n\n\"Keep your hostile glare off the Overgeared King.\"\n\n\"...\"\n\nDuke Grenhal's words cut through the tension like a blade. His rebuke of Duke Diworth wasn't merely unusual—it was unprecedented. Yes, Grenhal outranked Diworth in both power and authority. Yes, their families were locked in bitter competition over Saileta's commercial rights. But none of that justified this.\n\n*In front of a foreign adversary...*\n\nFor Grenhal to openly antagonize a fellow duke before an enemy king violated every unspoken rule of imperial nobility. Diworth's fists clenched at his sides, his gaze dropping to the ground. He drew a slow breath through his nose, fighting to contain the rage that made his limbs tremble.\n\n*Stay calm. Think.*\n\nDefending the Overgeared King while humiliating a fellow duke? Grenhal had clearly lost his mind. The man had been exhibiting berserker-like behavior lately. This confirmed Diworth's suspicions—Grid had manipulated them all, using Piaro as a lure.\n\n*Cunning bastard.*\n\nGrid was a regicide, a man who'd overthrown the very kingdom he'd once served. His treachery was cold and calculated. Was it mere coincidence that he'd taken in Piaro? Not a chance. This had been orchestrated from the start.\n\nPiaro held unique significance in the empire. By keeping Piaro close, Grid gained enormous political leverage. The evidence was clear: the emperor himself had adopted a passive stance toward the Overgeared Kingdom after learning of Piaro's survival. Mercedes had been handed over as a gift, for gods' sake. Grid had successfully neutralized the empire's continental ambitions.\n\n*Too dangerous.*\n\nGrid wasn't just strong—he was brilliant. His mere existence threatened the empire more than armies ever could. Perhaps even more than the Undefeated King. Madra had relied on brute force to halt imperial expansion. But this man? Grid would rot the empire from within. The emperor and dukes were already dancing to his tune like puppets.\n\n*For His Majesty's sake, for the empire's survival, this man must be eliminated.*\n\nBut not now. Not when Grenhal and Morse had already swallowed the bait. When Piaro had been branded a traitor years ago, those two had petitioned the emperor, insisting on Piaro's innocence and begging mercy for his family. News of Piaro's survival would delight them, while simultaneously complicating their feelings toward Grid, who'd positioned himself as Piaro's savior rather than his manipulator.\n\n*Piaro's existence can no longer be hidden. The priority now is exposing Grid's true motives—that he's using Piaro as a political asset, not sheltering him out of kindness.*\n\n*So bow your head. Swallow your pride. Wait for an opportunity to restore Grenhal's reason.*\n\nDiworth would coordinate with Basara. Unlike the others, she had no personal history with Piaro. She could assess the situation with cold objectivity. With tremendous effort, Diworth forced down his fury. He dispelled the alcohol-infused mana coursing through his veins and offered an apology.\n\n\"I overstepped.\" His tone was measured, diplomatic. \"The Overgeared King may lead an enemy nation, but he is still a king who governs his people. My excitement caused me to forget my dignity as an imperial duke and show insufficient courtesy.\"\n\nThe words were carefully chosen. He acknowledged Grid's status while simultaneously labeling the Overgeared Kingdom as hostile territory. He implied that Grenhal's defense of Grid stemmed from personal attachment rather than sound judgment—a subtle accusation that Grenhal had been duped for sentimental reasons.\n\nDiworth expected shame to pierce through Grenhal's delusion and restore his rationality.\n\nInstead, Grenhal doubled down on madness.\n\n\"I warned you to check your hostility for *your* sake, not mine.\"\n\n\"For my sake?\"\n\n\"Exactly.\"\n\n\"...?\"\n\n*This man's lost it. The ruins have broken him.*\n\nGrenhal's body bore countless scars—medals earned through six decades of service to emperor and empire. But those sixty years had clearly taken their toll. His mind and body had been exhausted long before he'd entered these godforsaken ruins. A month of exploration without troops in this cursed place? Diworth couldn't imagine what fresh hells that entailed. Apparently, it had pushed Grenhal over the edge.\n\nDiworth clicked his tongue in pity.\n\nThen Morse spoke up, his tone matter-of-fact as he drew a finger across his throat. \"Drunk Duke, you'd be dead already if you'd kept that attitude up around King Grid.\"\n\n\"What?\" Diworth's scowl deepened. \"I'd be *dead*? Did I hear that correctly?\"\n\nMorse nodded. \"You did.\"\n\n\"What?\" Diworth's face flushed red as a pomegranate despite having purged all the alcohol from his system. \"Duke Morse, you may hold the same rank as me, but I can't let those words stand.\"\n\nHis pride was on the line. He might be weaker than some dukes, but he was no fool to be mocked or dismissed.\n\n\"You'd kill me? Why? Afraid I'd interfere with your precious reunion with Piaro? So you'd murder a fellow duke? I serve His Majesty the Emperor, same as you!\"\n\nDiworth's mind raced down the wrong path entirely.\n\nHe assumed Grenhal and Morse were threatening him directly. Of course it was a misunderstanding. No matter the circumstances, one duke would never raise a hand against another. The most they could do was stand aside and watch.\n\nMorse waved dismissively. \"Are you insane? Why would we kill a fellow duke?\"\n\n\"Then *who* would kill me?!\"\n\nThe non-answer only fueled Diworth's rage. Oblivious to the actual danger, he mentally catalogued every offense for his eventual report to His Majesty. He'd make both of them answer for this humiliation.\n\nThen Basara spoke for the first time, her voice smooth as jade.\n\n\"You'd die by the Overgeared King's hand.\"\n\n\"...?\"\n\nThe words hit Diworth like a lightning bolt.\n\nHe'd die... because of Grid?\n\nThat *small* foreign king? Was this some new form of mockery?\n\n\"...Duke Basara. I'm disappointed in you.\"\n\nHe understood now. This wasn't about politics or strategy. They were *ridiculing* him. The full weight of how little the other dukes respected him crashed down on Diworth like an avalanche. The shame was so profound it would haunt him for the rest of his life. He was grinding his teeth when Grenhal asked an unexpected question.\n\n\"Why do you keep bringing up Piaro?\"\n\nPiaro was dead. Grenhal had long since accepted it, had buried that grief deep in his heart. Yet Diworth kept invoking Piaro's name, kept connecting him to Grid somehow. There had to be more to it. An unexpected seed of hope began to stir in Grenhal's chest.\n\nBut Diworth didn't answer.\n\nGrid did.\n\n\"The former captain of the Red Knights, Piaro.\" Grid's voice cut through the mounting tension. \"He currently serves as my knight.\"\n\n\"W-What?!\" Basara and Morse both reacted with visible shock, eyes widening.\n\nGrenhal's face went rigid. His voice emerged low and dangerous. \"Your Majesty, are those words true?\"\n\nHis eyes carried an unmistakable warning: *Do not toy with Piaro's name.*\n\nWas Piaro truly that significant to Grenhal? Grid recognized the weight behind that stare and met it with respect. \"Yes. It was long ago—when I was nobody, just an ordinary person, not yet a king.\"\n\nIt had been a strange twist of fate. Piaro had been a fearsome madman who'd nearly killed Grid during their first encounter. Yet somehow that violent beginning had transformed into something precious.\n\n\"Piaro has stood by my side since the day I became a noble.\"\n\n\"W-What...\"\n\nPiaro... alive? Serving a foreign king...?\n\nGrenhal carried madness in his bloodline—an inherited curse that marked his family for generations. When everyone else had feared him, had shunned him for the violent legacy etched into his very genes, only one person had smiled warmly.\n\nPiaro.\n\nPiaro had told him: *\"Don't be ashamed of your madness. Don't hide from it. You unleash it for your homeland, for the people. So never be afraid when others point and whisper.\"*\n\nThat was back when they'd been the Nine Dukes, before the number shrank to seven. Piaro had been one of the nine pillars holding up the empire.\n\n\"Ah... Ahh...\"\n\n\"Duke Grenhal!\"\n\nMorse caught Grenhal as he staggered. Grenhal's eyes turned red and glassy. Joy flooded through him—profound, overwhelming joy. The grief that had clung to his heart like indelible burn scars suddenly washed away. He thanked the Goddess of Light that Piaro had survived, that he served someone worthy. But simultaneously, crushing guilt descended on him like a physical weight. He'd failed to protect Piaro's family. All these complex emotions collided inside Grenhal at once and spilled out as tears.\n\n\"...\"\n\nPiaro was a greater man than Grid had realized. Watching Grenhal's breakdown, Grid recalled the first time he'd heard Piaro's story. *It began with 'Born into the empire's finest family...'*\n\n*Maybe Piaro was a duke himself.*\n\nHe'd lost everything overnight. What depth of loss and pain must he have endured? Thinking about it now filled Grid with renewed sympathy. Piaro had forgiven Asmophel. He smiled every day. But he'd never surrendered the dream of vengeance against the empire burning in his heart.\n\nThe sharp scent of alcohol cut through the turbulent atmosphere.\n\nGrid shifted his gaze. Drunk Duke Diworth had produced another bottle and was drinking from it, the clear glass tilted back as liquid rushed down his throat.\n\n\"I have devoted my entire life to the empire.\" Diworth drained the bottle in seconds and continued speaking. \"Fulfilled every duty expected of an imperial noble.\"\n\nHe glared at Grenhal with bloodshot eyes, pressure radiating from him like heat from a forge.\n\n\"Yet you treat me like this for a *traitor* who abandoned the empire long ago? A small kingdom—you value its enemy king above me? I'd be killed by the Overgeared King? Kuk! Kukuk!\" The laughter was bitter and sharp. \"Duke Grenhal! Now I understand exactly how pathetic you find me!\"\n\nWhen Diworth had confronted Piaro years ago, he'd admitted something painful: *\"I'm jealous of you. I envy you.\"*\n\nHis constitution only allowed him to access his full strength when intoxicated. Though he rarely spoke of it, Diworth lived with crushing low self-esteem. He was ashamed that he couldn't function without alcohol. No wonder he'd snapped when treated as inferior to Grid.\n\n\"I'll prove it!\" Diworth roared and launched himself at Grid. \"I'm not the joke you think I am!\"\n\nThis wasn't about Piaro anymore. He had to kill Grid to prove his worth. The alcohol-infused mana flooded through Diworth's body, dramatically enhancing his physical capabilities. He moved so fast that Grid couldn't track the movement properly even with the Slaughterer's Eye Patch reflexively equipped.\n\n\"Not happening.\"\n\nGrid opened his concealed eye beneath the patch.\n\n[The Castration Eye has been activated.]\n\n[Blocking all beneficial effects of the target!]\n\n[This effect persists while watching the target.]\n\nThe Castration Eye didn't just prevent incoming buffs—it stripped away buffs already in effect. It was the ultimate debuff ability, already proven devastatingly effective against Damian.\n\n\"...!?\"\n\nDiworth's intoxicated haze evaporated.\n\nHis bullet-like speed plummeted to that of a mere arrow. The wine's fragrance vanished.\n\n\"Linked Kill Flower Pinnacle.\"\n\n[The effect of Braham's Enchant Weapon has been triggered.]\n\n[Your weapon's damage is increased by 50% while the sword dance is in progress.]\n\nThe Sword Aiming at the Gods resonated with legendary magic.\n\n[The effect of Braham's Detect Force has been triggered.]\n\n[The target is being tracked, and the hit rate of the sword dance increased.]\n\nGrid's blade locked onto Diworth with perfect precision.\n\n[The effect of Braham's Wind Cutter has been triggered.]\n\nSharp wind accompanied the opening movements of Link.\n\n[The effect of Braham's Lightning has been triggered.]\n\nBlue lightning crackled through the cascading petals of the sword dance. Was there any skill in this world more beautiful yet deadly? Diworth found himself mesmerized by Grid's swordwork even as it pierced straight through his chest.\n\n\"Cough!\"\n\nIt seemed impossible. A king from a minor nation had forcibly negated his alcohol buffs, exposed his fundamental weakness, and landed a critical strike? Diworth's hands trembled as he reached for another bottle. Three still hung from his waist.\n\n*Gulp.* He brought it to his lips.\n\n\"Summon Knight.\"\n\nGrid made his decision instantly.\n\nThe Castration Eye randomly stripped buffs—it might remove all of them, or it might not. Furthermore, Diworth still had two-thirds of his health remaining despite taking a direct Linked Kill Flower Pinnacle. Grid could potentially overwhelm him with help from the Overgeared members, but it would be messy. The longer the fight dragged on, the more opportunity the other dukes had to intervene. Speed was essential. More importantly, this was the perfect chance to maximize his standing with Grenhal, who clearly shared deep bonds with Piaro.\n\nGrid calculated all of this in seconds... and played his strongest card.\n\n\"Piaro.\"\n\nPerhaps this was Grid's true ultimate technique. Though there was one problem: they were in the middle of the Red Sea. All external communication and teleportation magic was blocked here. Would Summon Knight even function?\n\nGrid harbored doubts but attempted it anyway. The Ruins of the War God blocked outside contact to prevent the weak from entering. But the war god welcomed the strong. He welcomed strength and wouldn't interfere with summoning someone powerful.\n\n[War God Zeratul will temporarily allow the application of teleportation magic.]\n\n[Your knight 'Piaro' has arrived by your side.]\n\n\"I have been waiting, Your Majesty.\"\n\nIt was magnificent. Piaro appeared not in his usual shabby farming clothes but in full knight's armor—a deliberate choice that revealed how patiently he'd been waiting since Grid had departed for the Ruins of the War God.\n\n\"S-Sir Piaro...\"\n\nIt was true. Their old hero lived. Grenhal and Morse trembled with barely contained emotion."
}