{
  "id": 104,
  "title": "Chapter 104",
  "content": "# Chapter 104\n\n**CLAAANG!**\n\nThe Gale Spear blurred through the air. Each engagement fed the weapon's momentum, the blue-silver shaft humming with accumulated velocity. Pon's strikes came so fast they seemed to multiply. A single thrust became five. Five became ten.\n\nZirkan's blade moved to intercept. Steel met steel. Once. Twice. A dozen times in three seconds.\n\nThen the rhythm broke.\n\nA gap opened in Zirkan's defense. His shoulder dipped half an inch too far. Pon saw it.\n\nThe spearman kicked off the ground. His body launched horizontal, parallel to the street.\n\n\"True Illusion!\"\n\nThe Gale Spear became a rainstorm. Point-blank. No escape.\n\n**Thunk-thunk-thunk-thunk-thunk!**\n\nZirkan's golden armor crumpled. Not shattered. Not pierced. *Crumpled*, like tinfoil crushed in a fist. Plates that had turned aside greatswords folded inward. The ornate pauldrons became scrap.\n\n\"Guh—!\" \n\nZirkan's knees hit cobblestone. His sword clattered from nerveless fingers.\n\nThe watching crowd went silent.\n\nPon landed. He swayed, blood dripping from a gash above his eye. The spear's tip found Zirkan's throat and stopped there, steady despite the tremor in Pon's arms.\n\n\"Hah... hah... You're still strong.\" The words came between ragged breaths. \"Normally... I would've lost.\"\n\nIt was true. The first three minutes had been hell. Zirkan had beaten him like a training dummy. But the Gale Spear's option effect had tipped the scales. Every exchange, every parry, every thrust. The weapon grew faster. And faster. Until even a Level 4 ranker from L.T.S. couldn't keep up.\n\nZirkan stared at the blue-silver shaft. A bitter smile twisted his bloodied lips. \"That spear.\" His voice was rough. \"An incredible weapon. Made by the unknown craftsman?\"\n\n\"That's correct.\" Pon didn't bother denying it. \"I learned the true value of items from this spear. From him.\"\n\n\"Hah.\" Zirkan's smile faded. He closed his eyes. \"End it.\"\n\n\"You fought well.\"\n\n**Thunk.**\n\nThe spear punched through Zirkan's sternum. His body dissolved into light particles.\n\nPon pulled the weapon free and looked toward the remaining Giant Guild members. \"If you're coming for us again, tell Chris to bring more than this.\"\n\nHe turned and walked toward Khan's smithy without waiting for a response.\n\n***\n\nThree sources of power. Skills. Stats. Items.\n\nGrid possessed all three at their peak. The holy trinity of combat, refined to a murderous edge. Even Maksevun, a top-five ranker within the Giant Guild, had crumpled before that combination.\n\nNow Grid stood surrounded by ten more targets. His blade dripped red. His breath came steady.\n\n*Pagma's Swordsmanship.*\n\n\"Wave.\"\n\n> **[Wave]**  \n> Unleash a violent sword dance like a high wave.  \n> Inflicts 155% of your attack power to all enemies within 1m and reduces their speed.\n\nBlue light erupted from the black greatsword. Not a wave. Waves, plural. Dozens of crescent arcs spilled outward in every direction.\n\n**SHHHHINK! SHINK-SHINK-SHINK-SHINK!**\n\nThe Giant Guild reacted instantly. Veterans. Rankers. They knew killing intent when they felt it.\n\n\"Scatter!\"\n\nBodies launched in ten directions. Away from the epicenter. Away from the skull-faced madman and his glowing sword.\n\nBut the waves followed.\n\nEach arc curved through the air like it had eyes. Like it was *hunting*. The attacks moved faster than sprinting speed. Faster than most ranged skills.\n\n\"What?!\" Someone screamed. \"Guided? What kind of broken skill—\"\n\nThe choices were binary. Block or die.\n\n**BOOM-BOOM-BOOM-BOOM!**\n\nShields shattered. Swords bent. Armor cracked. The ten guild members who'd scattered across the street now lay broken in ten different spots.\n\n\"This... this is impossible.\"\n\nMaksevun's voice shook. He was still on one knee from Grid's earlier beating, and now he watched his guildmates get erased by a single AoE skill.\n\n*An area skill shouldn't hit this hard.*\n\nEveryone knew the balance. AoE skills traded damage for coverage. First advancement users dealt 50 to 70 percent of their attack power. Second advancement rankers managed 70 to 90 percent. That was the cost of hitting multiple targets.\n\nBut Grid's skill just dealt full damage. Maybe more.\n\n*Is it a rare skill?*\n\nRare skills came from special achievements. Titles. Hidden quests. Yura's Divine Punishment, for example.\n\n> **[Divine Punishment]**  \n> Summons a lightning bolt that deals 15,000 to 23,000 damage within 10 meters.  \n> Mana Consumption: 4,000  \n> Skill Cooldown: 1,200 seconds\n\nFixed damage. Devastating at lower levels, but eventually eclipsed by stat scaling. A known limitation.\n\nBut if Grid's skill scaled with his attack power...\n\nMaksevun's stomach turned cold.\n\n*This isn't rare. This is something else.*\n\nAround him, other players whispered. Ibellin stood among the spectators, his expression unreadable.\n\n*What class does Grid have?*\n\nThe Tzedakah Guild knew Grid had a hidden class. The assumption was Epic. Three Epic classes existed in Satisfy. Agnus and Katz held two of them. Therefore, Grid must have the third.\n\nBut that logic just shattered like the Giant Guild's armor.\n\n\"Grid.\" Ibellin spoke to no one in particular. \"Maybe he has a unique rating class.\"\n\nOn the blood-slicked street, the Giant Guild survivors struggled to their feet. Their armor hung in tatters. Potions wouldn't fix this. They were dead men still breathing.\n\nGrey Bear opened the party chat.\n\n> **Grey Bear:** Everybody listen. We're going to die here. That's a fact. If death is certain, we fight anyway. We gather intel. We report everything. Agreed?\n\n> **User2:** Fine. If we come back empty-handed, the captains will crucify us.\n\n> **User3:** Not dying for nothing. I'm making this bastard burn through all his skills.\n\n> **User4:** LOL his trump cards! Let's see them all! What's a little lost XP?\n\n> **User5:** Grey Bear might drop items though~\n\n> **Grey Bear:** Don't jinx me.\n\nOne by one, the battered guild members rose. Weapons up. Stances ready.\n\nThe street erupted in cheers.\n\n\"Oh! The Giant Guild's going all out!\"\n\n\"Show them the skills that beat Ibellin!\"\n\nWhat the players didn't realize was the scope of their audience. Satisfy had built-in recording features. Players in the crowd were streaming this live. *Giant Guild versus Tzedakah Guild.* The clash of titans. Broadcasting stations had dispatched camera crews.\n\nRight now, hundreds of millions of viewers watched Grid through screens across the world.\n\nGrid had no idea.\n\nIf he'd known this was his first televised appearance, he might have posed. Might have delivered a cool one-liner like action movie heroes.\n\nInstead, he said this.\n\n\"You damn insects.\" Grid's voice dripped venom through the skull helmet. \"Why are you getting up? You think this is funny? You think *I'm* funny?\" His laugh was wrong. Unhinged. \"You shouldn't have pissed me off. Now I'm going to rip you apart piece by piece.\"\n\nThe guild members attacked.\n\n\"Charge of Anger!\"\n\n\"Spirit Control!\"\n\n\"Chain Binding!\"\n\nCC skills. Status effects. They couldn't match Grid's raw power, so they'd lock him down and chip away his health.\n\nThe skills landed.\n\nNothing happened.\n\n> **User2:** What? Why isn't he stunned?\n\n> **User3:** Level gap too high? Or he's got CC immunity.\n\n> **User4:** This rotten bastard!\n\n**CRUNCH! SQUELCH! THUD!**\n\nOne-sided. Not a battle. An execution. The black greatsword turned crimson. Grid moved through them like he was harvesting wheat. Each swing opened arteries. Each thrust punched through ribs.\n\nOver the years, Grid had been weak. People had laughed at him. Ignored him. Treated him like garbage.\n\nThese guild members wore the same expressions as those people.\n\nCrushing them felt *good*.\n\n\"**Kuahahahaha!**\"\n\nThe skull-helmeted figure bathed in blood looked like something from a horror film. Screams echoed off the buildings. The mainstream stations cut their feeds. Too graphic. Too brutal.\n\nCable channels kept rolling. Their ratings skyrocketed.\n\nThat day, headlines spawned across the globe.\n\n**\"The Human Butcher\"**\n\n**\"Satisfy's Masked Murderer\"**\n\n**\"Psychopath Rampage in Winston\"**\n\nGrid's former classmates watched the coverage from their dorm room. The color drained from their faces.\n\n\"That's... that's him. The guy from the canyon.\" One student's voice cracked. \"I knew he was a psychopath.\"\n\n\"Jesus. He's actually insane.\" Another stared at the screen. \"Doing this in the middle of a city. That guy's a monster.\"\n\nFor the next week, news programs ran think-pieces. *\"Satisfy's Violent Players. Should We Be Concerned?\"* Panel discussions. Expert opinions. Moral hand-wringing.\n\nMeanwhile, the Tzedakah Guild's reputation exploded. Less than twenty members had repelled three hundred from the Giant Guild. Jishuka received recruitment offers. Sponsorship deals. Interview requests.\n\n***\n\n\"**RAAAAGH!**\"\n\nChris tore through a dungeon. Monsters died before they could react. His greatsword painted the walls red. Nothing survived where he walked.\n\n\"Shit! **SHIT!** Damn it all!\"\n\nThe unknown craftsman had joined the Tzedakah Guild. Chris had been publicly humiliated. Broadcast worldwide. The Giant Guild had become a laughingstock.\n\nHe wanted revenge. Immediate. Overwhelming. Total.\n\nBut that skull-helmeted monster had joined Jishuka's group.\n\nChris replayed the footage in his mind. The AoE skill. The damage output. The CC immunity.\n\n*Hidden class above Epic. Has to be. But who?*\n\nOne name kept surfacing.\n\n*Agnus.*\n\nThe 7th ranked player. Owner of the second Epic class. Known for disguising himself. Known for chaos.\n\n*Could it be him? Working with Jishuka?*\n\nChris couldn't rule it out.\n\n*She's more dangerous than I thought.*\n\nAfter three days of hunting, Chris made his decision. A guild-wide announcement went out.\n\n> **[Guild Master Chris]:** All external operations are suspended. Focus on leveling. Channel your anger into growth. Hunt. Get stronger. We will repay this humiliation tenfold. That is a promise.\n\nAs the Giant Guild turned inward, the Tzedakah Guild faced a different problem.\n\nNew applicants flooded in. Top rankers. Skilled players. People who'd seen the battle and wanted to join the winning side.\n\nJishuka conducted interviews. Set challenges. Raised the bar high.\n\nSeven new members passed.\n\nAll of them were... unusual.\n\nVantner summed it up best.\n\n\"So.\" The bald tanker scratched his head. \"Crazy people attract other crazy people. That's the pattern here.\"\n\nGrid's madness had become a beacon. The new recruits shared his intensity. His violence. His complete disregard for normal behavior.\n\nThe guild had grown stronger.\n\nNo one felt safer.\n\nAnd Grid prepared for his high school reunion, blissfully unaware of the global media circus surrounding his masked persona.\n\n---\n\n**Glossary of Common Korean Terms:**  \nOG: [Glossary Link]\n\n**Current schedule:** 20 chapters a week.\n\n*Check out my Patreon for early access to unedited chapters and support bonus chapter goals. Early access chapters update after daily releases conclude.*"
}