{
  "id": 1040,
  "title": "Chapter 1039",
  "content": "**Chapter: The Farmer's Wrath**\n\nFrom the moment Grid's party departed for the Ruins of the War God, sleep had become a luxury Piaro could no longer afford. As both farmer and warrior, the legends of the War God and his followers were etched deep into his memory—tales of trials that broke even the strongest warriors. The ruins would be merciless. Grid would face dangers beyond imagining.\n\nPiaro never blamed his king for leaving him behind. Instead, he stripped off his farming clothes and donned his knight's armor, keeping vigil in full battle dress. If Grid called, he would run. If Grid didn't call... that would be even better.\n\nFor thirty days, the legendary farmer became something simpler: a knight awaiting news of his lord.\n\nWhen the summons finally came, Piaro didn't hesitate.\n\n---\n\nHis eyes locked onto Drunk Duke Diworth the instant he materialized at the historical site. The duke stood between him and Grid, radiating hostility. The threat was unmistakable—Diworth had hunted Grid all the way from Reidan to this forsaken place.\n\n\"A man who raises his hand against my king...\" Piaro's voice was quiet, almost conversational. \"...doesn't deserve to fertilize my fields.\"\n\nBecoming a legendary farmer had freed Piaro from many burdens. The obsession with achieving Sword Saint. The misunderstandings with Asmophel. The weight of old wounds. For the first time in decades, his mind had known peace.\n\nThat peace shattered like glass.\n\nPerhaps this was the face he'd wear when he finally met Empress Marie. The rage he'd buried so carefully came roaring back, transforming his features into something demonic and utterly remorseless.\n\nThe sky ignited.\n\nDozens of sparks spiraled upward, painting the sunset-red heavens with threads of light. The very air responded to his fury, nature itself bending to acknowledge his wrath. This was Natural State—the world recognizing one who had transcended.\n\n\"How nostalgic,\" Piaro murmured. \"I'd forgotten this feeling.\"\n\nWind currents wrapped around him like a cloak. The hand plow, sickle, and hoe hanging from his waist chimed against his armor—farming tools singing a battle hymn. His hand blurred. Something small and seed-like scattered through the air, hundreds of tiny projectiles too quick for normal eyes to track.\n\nDiworth stumbled backward, his transcendent senses screaming danger. The fragments hurtling toward him weren't mere seeds—they were condensed energy, each particle containing enough destructive force to reshape the landscape.\n\nBut something felt wrong.\n\nSword energy typically thrummed with killing intent, yet Piaro's emanation felt... gentle? The fragments that missed their target and struck the ground didn't explode. They simply melted like snow, absorbed harmlessly into the earth.\n\n*A feint?*\n\nDiworth's instincts shrieked at him to move. He retreated, alcohol already flowing down his throat to sharpen his reactions. He couldn't match Piaro blade-to-blade, but tactics and preparation could bridge any gap—\n\n\"Free Farming 2nd Style.\"\n\nPiaro's voice cut through the canyon like a knife through silk.\n\n\"Super Growth.\"\n\nThe hand plow gleamed in his grip.\n\nDiworth's eyes went wide.\n\nThe desolate canyon *erupted*.\n\nGrain stalks shot from barren sand. Trees burst from dust. In the space between one heartbeat and the next, the impoverished wasteland transformed into abundant farmland. Grapes hung heavy on sudden vines. The sweet scent of growing things flooded the air.\n\nDiworth felt reality shift beneath him.\n\n*Illusion magic?*\n\nNo. The fields were real—too real. The textures, the smells, the way the plants swayed in the breeze. No illusion master would allow him to distinguish fantasy from reality so easily.\n\n\"Clever trick!\" Diworth snarled.\n\nThe fragments weren't weapons—they were *seeds*. Piaro had scattered life itself, then used his techniques to force impossible growth. Understanding crystallized in an instant. Diworth took a long pull from his gourd and spat.\n\nThe alcohol stream transformed mid-flight, infused with devastating magic power. Plants withered in its path, fields turning to ash. The magical assault carved a line of destruction straight toward Piaro.\n\nDiworth charged across the dying crops, hand extended. The collision of his strike against Piaro's hand plow sent shockwaves rippling through the canyon. No time for subtlety—his other hand whipped out a hidden needle coated in white bamboo spider venom. The poison was odorless, colorless, and absolutely lethal.\n\nThe needle struck true, embedding itself in Piaro's thigh.\n\n*Got him!*\n\nVictory surged through Diworth's veins. The Tiphon family's poisons were legendary for good reason. Even transcendent warriors fell to his toxins—\n\n\"Insignificant.\"\n\nThe word hit harder than any blade.\n\nPiaro stood unmoved, the needle protruding from his leg like a broken toothpick. Natural State combined with his legendary constitution rendered the deadliest poison meaningless. He'd allowed the strike deliberately, letting Diworth taste false hope before crushing it.\n\nThe hand plow sang toward Diworth's heart.\n\nBut the Drunk Duke didn't survive this long by being predictable. His movements defied logic, body flowing like water through impossible angles. The plow tore through his robes but found only air.\n\n*He's not affected?*\n\nHorror crept across Diworth's features. The confusion hit him harder than the earlier revelation about the fields. He drank deeply, using alcohol to burn away fear and doubt.\n\nFrom the sidelines, Duke Grenhal watched with growing excitement. \"He's grown stronger...\"\n\nPiaro had lost everything—position, family, honor—and been forced into hiding. Grenhal had expected to find him broken, diminished. Instead, the man before them radiated power that eclipsed his former glory.\n\nBut something was wrong.\n\n\"Why doesn't he draw his sword?\" Morse whispered.\n\nThe Piaro they'd known was a master swordsman, a man who'd nearly achieved the title of Sword Saint. Yet now he fought with farming implements like some eccentric peasant warrior. The armor and bearing remained, but the techniques...\n\nIf he continued limiting himself this way, Diworth might actually win.\n\nThen Piaro moved.\n\n\"Free Farming 4th Style.\"\n\nThe hand plow missed its mark as Diworth twisted aside. Piaro's hand blurred to his back, pulling free the trident—no, the *rake*.\n\n\"Plow the Field!\"\n\nThe earth *inverted*.\n\nSoil exploded upward like a tidal wave. Diworth's footing vanished as the ground churned beneath him. Seeds filled his vision as he struggled for balance—\n\n\"Free Farming 5th Style: Harvest.\"\n\nHundreds of thousands of seeds converged from every direction, a storm of tiny projectiles that cut off all escape routes.\n\n*They're just seeds,* Diworth thought desperately. *Just seeds can't kill me—*\n\n\"Free Farming 8th Style: Polishing Rice.\"\n\nThe world became fire.\n\nEvery seed detonated simultaneously, the cascading explosions shaking the canyon to its foundations. Diworth's scream tore through the roar of destruction, his body engulfed in the blast. The alcohol that gave him strength burned away in an instant, leaving him sluggish and vulnerable.\n\nPiaro's sickle found its mark.\n\nThe blade punched through Diworth's chest and emerged from his back, gleaming crimson.\n\n> [The Saharan Empire's duke 'Drunk Duke Diworth' has been defeated.]\n> \n> [It is a great accomplishment that no one has achieved.]\n> \n> [Your reputation throughout the continent has increased. You have acquired 2,000 reputation points.]\n> \n> [Your level has risen.]\n> \n> [**The Duke Tiphon Family's Magic Gourd** has been acquired.]\n> \n> [**The Duke Tiphon Family's White Dragon Wine** has been acquired.]\n> \n> [Your knight 'Piaro' has accomplished the achievement 'Overwhelming the Seven Dukes'.]\n> \n> [Your knight 'Piaro' is progressing!]\n\nDiworth crumbled to ash, his death as anticlimactic as it was absolute.\n\nGrenhal, Morse, and Basara stood frozen, complex emotions warring across their faces.\n\n\"None of you helped him.\" Piaro's voice was flat, drained of inflection. He turned to regard the three dukes properly. \"You haven't changed at all.\"\n\nOf course he'd known they were there. But Diworth had been the immediate threat to Grid, which made him the priority target. Piaro had gambled that the other dukes would do what they'd always done—stand aside and watch.\n\nJust as they'd done when his family burned.\n\nHis jaw clenched hard enough to make his teeth ache. These were people he'd called friends. Basara, he could forgive—their paths had rarely crossed. But Grenhal and Morse? They'd fought beside him for *years*. Shared meals, shared victories, shared the bond of warriors who served the same empire and protected the same people.\n\nYet when it mattered most, they'd turned away.\n\n\"Sir Piaro...\" Grenhal's voice cracked. Both he and Morse lowered their heads, unable to meet the farmer's eyes. They'd fought for his family in their own way. Prayed for his peace. But in the end, they'd failed to save anyone.\n\nThey never expected this reunion. Never imagined they'd have to face the consequences of their inaction.\n\nUnderstanding Piaro's anguish made it impossible to offer excuses.\n\nPiaro forced his resentment down through sheer will. \"I won't blame you anymore.\"\n\nHe turned away from Grenhal's broad shoulders—shoulders that hadn't shielded his younger brother. \"My family's destruction came from my own carelessness. You bear no responsibility.\"\n\nHe turned away from Morse, who'd always been proud yet humble before his elders. \"Now I fight to protect my king. Nothing else matters.\"\n\nPiaro wiped moisture from his eyes and gripped his farming tools tighter. If Grenhal, Morse, and Basara had come with Diworth, they were enemies. The Saharan Empire opposed the Overgeared Kingdom. Logic dictated his next action.\n\n*Can't drag this out.*\n\nNatural State had limits. His battle with Diworth had pushed him near those boundaries. To protect Grid from three more dukes, he'd need to strike fast and overwhelming—burn through Origin True Energy and every secret technique without hesitation.\n\n*I'll die if I must.*\n\nGrid had saved his life. That life now belonged to Grid. Piaro had just committed himself to this truth when reality tilted sideways.\n\n\"Piaro, stand down.\"\n\nThe farmer froze.\n\n\"They're my friends,\" Grid continued calmly.\n\n\"...Your Majesty?\" Piaro's voice was barely audible.\n\nBasara spoke up, her reputation for wisdom and impartiality lending weight to her words. \"These two spent nearly twenty years trying to protect your family, even though they ultimately failed. They've carried that pain ever since.\"\n\n\"I'm ashamed...\" Grenhal's voice was thick with emotion.\n\n\"Damn it, I'm sorry.\" Morse looked like he might collapse. \"Truly... I'm *so* sorry.\"\n\nThe words hung in the air between them.\n\nPiaro stood motionless as a statue. Something vital slipped free inside his chest. The world tilted. A strange buzzing filled his ears, growing louder, drowning out everything else until he couldn't tell if the sound came from outside or within.\n\nHis knees hit the ground without him commanding them to move."
}