{
  "id": 1041,
  "title": "Chapter 1040",
  "content": "\"We analyzed the situation and were convinced you hadn't betrayed us.\" Grenhal's voice was heavy with old regret. \"The evidence said otherwise, and we had no proof of your innocence. Without it, we couldn't defend you before the court.\"\n\nPiaro had been charged with treason. No amount of personal conviction could overturn manufactured evidence.\n\n\"We filed appeals. Tried to protect your family, at least.\" Grenhal's jaw tightened. \"You know how that ended.\"\n\nDecades had passed, yet for those who had lived through it, the wound remained fresh—a pain they would give anything to undo. Grenhal understood what Piaro must have felt, and the weight of it crushed him. He couldn't meet his old comrade's eyes. His vision swam as he fought to control the emotions burning in his chest.\n\nPiaro said nothing.\n\nThey hadn't abandoned him—yet he blamed them anyway. Both truths warred in his mind, each one cutting deeper than the last. Finally, he looked up at the sky.\n\n\"Who do you mean by 'we'?\"\n\n\"Myself, Morse, Rachel... and Rigal.\"\n\n\"Rigal?\" The name came out barely above a whisper.\n\nGrid stood off to the side, teeth buried in his lower lip. Sky King Rigal. Now it made sense—the agitation in Rigal's eyes when he'd recognized Piaro in those final moments. Guilt twisted in Grid's gut. He'd ordered Piaro to kill Rigal. Given the command without knowing their history.\n\nPiaro gripped Grid's trembling hand. \"Your Majesty, Rigal was an enemy of the Overgeared Kingdom. That guilt is mine to carry.\"\n\n*That's exactly the problem, you stubborn fool.*\n\nAnother weight added to the burden Piaro already bore. Grid hated that he'd put it there.\n\nHis guild members sent worried whispers through the party chat:\n\n*—You couldn't have known. Don't beat yourself up over it.*\n\n*—Rigal invaded Bairan. Killed our people. Destroyed Khan's statue. He made himself an enemy.*\n\n*—It happened in war. These things happen.*\n\nThey were right. Rigal had led the assault on Bairan. Slaughtered innocents. Smashed Khan's memorial. Raised a weapon against Grid himself. Punishing him had been justified—necessary, even.\n\nThe problem was that Grid had needed Piaro's strength to do it.\n\n*If I'd been stronger... If I'd been strong enough to handle Rigal myself, without calling on Piaro...*\n\nThen this new guilt wouldn't exist. Grid clenched his fists and pulled up his combat logs, seeking any scrap of progress.\n\n[Your level has risen.]\n\n[You have reached level 399 and acquired the 200,000 Army Swordsmanship.]\n\n[Swordsmanship Textbook: 200,000 Army Swordsmanship]\n\n[Rating: Legendary\n\nA textbook recording the fundamentals of Madra's swordsmanship. However, it documents the techniques used after Madra became a death knight, so the contents are degraded compared to the original.\n\nOnly one technique is recorded: 200,000 Army Crushing Sword (Degraded).\n\nLearning Conditions: Recognition by Madra. Level 399 or higher.]\n\nGrid had gained the experience from wounding Duke Diworth before summoning Piaro—enough to push him to 399. He could become stronger. Would become stronger.\n\n*I'll shoulder the pain next time. All of it.*\n\nPiaro, Asmophel, Braham, Mercedes—nearly all of Grid's closest allies carried deep scars. Even the wise Sticks suffered under a dragon's curse, plagued by nightmares every night. His knight Jude seemed destined for loneliness. Minor studied while caring for his sick mother. Every one of them had known hardship and loss.\n\nGrid wanted to be their strength. Someone they could rely on. Someone who would make them say, *I was happy serving him.*\n\n*I'll find a way.*\n\nHe wasn't naturally talented at this—at being the person others needed. He didn't have some innate gift for leadership or comfort. But he believed that if he kept trying, kept pushing forward, he would get there eventually.\n\nWhile Grid steeled himself, the conversation continued.\n\n\"The biggest obstacle was Marie.\" Grenhal's expression darkened. \"She didn't act directly, but her family and allied nobles demanded blood. They insisted traitors and their families be punished.\"\n\n\"Obviously that bitch was pulling strings from the shadows,\" Morse spat.\n\nFor an imperial noble to speak of the Empress that way bordered on treason—an insult to the imperial family itself. Yet Grenhal had already reduced her to \"her,\" and Morse went further with outright vulgarity. They didn't acknowledge Marie as Empress at all.\n\nPiaro studied Basara's face. She carried imperial blood—descended from the third emperor and closely related to the current one. Fifth in the line of succession. To insult the imperial family in her presence was to insult her directly.\n\nBut Basara's expression remained neutral. If anything, the slight shake of her head and her averted gaze suggested she shared their suspicions about the Empress. Whatever her reasons for not defending Piaro in the past—lack of personal connection, restrictions on imperial bloodline—it clearly hadn't been out of loyalty to Marie.\n\nGrenhal spoke again, each word seeming to pain him. \"I'm sorry to say this, but... there's evidence that Asmophel worked with Marie.\"\n\nPiaro and Asmophel—childhood friends. Everyone in the empire knew their bond. Grenhal looked uncomfortable bringing it up, worried about causing Piaro more pain.\n\nMorse had no such compunctions. \"He didn't just work with her. He became her lapdog. Stabbed you in the back. He was the most active in hunting down the Red Knights.\"\n\nSilence.\n\n\"Sir Piaro, I know it's hard to believe, but Asmophel contributed more than anyone to your treason conviction.\"\n\n\"I know.\"\n\nThe admission fell like a stone. Grenhal and Morse closed their mouths, unable to imagine the depth of betrayal Piaro must feel. The resentment that must fester beneath his calm exterior.\n\n\"Several years ago,\" Basara interjected, \"Asmophel disappeared overnight. Officially, he's listed as missing. I'm certain he was assassinated.\"\n\nPiaro remained silent.\n\n\"Did you kill him, Sir Piaro?\"\n\nThe reasoning made sense. Asmophel had been in his mansion in the heart of Titan. The intruder would have needed to infiltrate the capital, locate him, and eliminate him without leaving evidence. Few possessed such capability. And fewer still had motive to kill Asmophel.\n\nPiaro had the greatest reason of all.\n\nGrenhal and Morse nodded—Basara's logic was sound. But Piaro's answer surprised them all.\n\n\"King Grid visited Asmophel that night. Not me.\"\n\nGrenhal and Morse's eyes widened. Overgeared King Grid—strong enough to overwhelm a follower who had mastered ten secret techniques? Operating freely through imperial surveillance for years?\n\n*Though Asmophel was a shadow of his former self by then. And Grid defeated a follower with ten techniques. He could have handled Asmophel easily enough...*\n\nActually, the more they thought about it, the more sense it made. The old Piaro and Asmophel might have outranked them as dukes, but both paled before Grid. Hell, even the current Piaro served Grid willingly.\n\n*The Overgeared King must be on the Grandmaster's level.*\n\nThe man who inherited Pagma's legacy and connected it to the Hero King's bloodline—those achievements alone marked him as legendary. And he wielded magic like a great magician on top of that.\n\n*To reach such heights at his age...*\n\n*A genius beyond mortal measure.*\n\nAs the dukes regarded Grid with newfound awe, Piaro continued.\n\n\"Asmophel told us the truth. The Empress conspired with the Yatan Church. Together, they destroyed the Red Knights to consolidate her power. Asmophel fell into her trap—was dosed with Yatan Essence. It shattered his mind. Made him betray me and our brothers.\"\n\nThe words hung in the air, shocking in their implications.\n\n\"I've forgiven him. He serves King Grid alongside me now.\"\n\nThe dukes' mouths fell open.\n\nEven Basara—who always kept her eyes closed—opened them in surprise.\n\n*Beautiful,* the Overgeared members thought collectively. She appeared to be in her late twenties, though they knew she must be in her forties. Basara possessed an extraordinary elegance, a dignified nobility that made even her husband hesitate before taking her hand.\n\n\"Forgiveness...\" Basara studied Piaro carefully. \"Did the Overgeared King persuade you?\"\n\nNo matter the excuse about Yatan Essence and traps, Asmophel had still betrayed his friends. Hunted down and killed their families. For the dukes—who prioritized political necessity over personal sentiment—such a man was beyond redemption.\n\nBasara didn't believe Piaro had forgiven willingly. More likely, Grid had forced the issue to strengthen his kingdom. Not that she would criticize him for it. A king sometimes needed to be ruthless. She could admire that pragmatism.\n\nBut Piaro shook his head. \"No. The decision was mine. My grudge is with Empress Marie—the one who used him. Asmophel is working to atone for his sins.\"\n\n\"Then that means...\" Grenhal's voice trailed off. \"The former pillars of the empire are in the Overgeared Kingdom.\"\n\nThe dukes' perception shifted. They'd already acknowledged Grid as formidable. Now they recognized the Overgeared Kingdom itself as a genuine threat to the empire. Thank the gods that the discovery of the War God's Ruins had created this temporary ceasefire.\n\nThen Piaro dropped another revelation.\n\n\"Do you know that Mercedes achieved the legendary knight rank?\"\n\n\"Of course. Though she left the empire immediately after.\"\n\n\"She serves King Grid.\"\n\n\"...What?\"\n\n\"Have you heard of Sage Sticks?\"\n\n\"The high elf...?\"\n\n\"He serves King Grid as well.\"\n\nSilence.\n\n\"A direct descendant vampire and the greatest demonic beast of hell also follow His Majesty faithfully.\"\n\nPiaro's pride in his king radiated from every word. The dukes watched, marveling at the depths of his loyalty.\n\n\"You've been living well,\" Morse muttered, though there was no bite to it.\n\nGrenhal burst out laughing. The sound was raw, almost painful—years of sorrow and guilt beginning to crack open. There was work ahead. They would have to tell the Emperor the truth. Hold Empress Marie accountable. Restore the honor of the fallen Red Knights and seek forgiveness from the families they'd failed to protect.\n\n*Which means we need friendly relations with the Overgeared Kingdom,* both Grenhal and Morse realized simultaneously.\n\nMaking an enemy of that kingdom would be disastrous. But how to convince the Emperor?\n\nWould he even believe them? That Piaro had been framed, and Marie had orchestrated it all with the Yatan Church? The Emperor had lost his empress and been betrayed by a friend. He'd relied on Marie for years, nursing the wounds in his heart. His trust in her might run deeper than they imagined.\n\n*Even if we shout the truth from the rooftops, His Majesty might not forgive Piaro. And if he learns that Asmophel and Mercedes left to serve the Overgeared Kingdom... he might see it as an even greater betrayal. He might refuse to tolerate the kingdom at all.*\n\nHow could they navigate this?\n\nBasara whispered to the frowning dukes, \"His Majesty will be pleased.\"\n\n\"What do you mean?\"\n\n\"Huhu. You'll find out soon enough.\"\n\nDid the Emperor truly not know Mercedes served the Overgeared Kingdom? Why had he banished a legendary knight in the first place? Basara was convinced the Emperor himself had sent Mercedes to Grid's side."
}