{
  "id": 1042,
  "title": "Chapter 1041",
  "content": "After so long apart, the reunion had finally come. The dukes laid bare years of grudges and misunderstandings before returning to the present reality. Their first order of business: mourning Duke Diworth.\n\nThe mourning was brief, though its brevity didn't diminish its sincerity. Despite little personal affection between them—despite conflicting ideologies and opposing political stances—Diworth had been a colleague who served the imperial family. It was only natural to mourn him. Yet their grief stemmed purely from obligation, not emotion.\n\nNone of them felt genuine sorrow or regret. How could they mourn someone they barely knew? The dukes governed distant territories and rarely interacted unless bound by close personal ties.\n\nRumors painted Diworth as a man consumed by alcoholism since middle age, prone to violence. Stories circulated of soldiers abused or killed under the guise of \"military discipline.\" His death was cold. There was nothing to regret. Whether his son would prove a better steward of House Tiphon remained to be seen.\n\n*Those who lose their qualifications must step aside.* \n\nDuke Grenhal suddenly wondered what judgment would be passed upon his own death. The thought chilled him.\n\n\"At the very least, I'll weep for you,\" Morse said, catching Grenhal's bitter expression.\n\n\"Ha! How gracious of you.\"\n\nThe time for mourning passed. Grenhal turned to Grid. \"The moment we return to the empire, we'll hold a grand funeral for Duke Diworth.\"\n\nDiworth might have threatened Grid's life, but on this matter, the dukes couldn't compromise. As a duke of the empire, Diworth's death would be enshrined in heroism. Grenhal's words carried that implicit understanding.\n\nGrid nodded, reading between the lines. \"How the empire honors its dead isn't my concern. You don't need to explain.\"\n\n\"Thank you for understanding.\"\n\nWith that matter settled, they could discuss the ruins' continued exploration. Only hours ago, the dukes had advocated abandoning the expedition entirely. Followers who'd mastered six secret techniques appeared with alarming frequency and proved viciously difficult to defeat. Better to retreat before exhaustion claimed them.\n\nBut circumstances had changed.\n\n\"Duke Grenhal!\" From the distance, Marquis Fulbas approached with ten thousand troops at his back.\n\n\"Hmm... too many nutrients in the soil. The crops are rotting prematurely...\" And now Piaro stood among them.\n\nYes—the dukes relied on Piaro. An old habit from the days when Piaro had been the empire's pillar. Throughout the continent, powerful enemies threatened the empire, forcing it through multiple devastating wars. Time and again, Piaro had emerged to save them. His presence had averted crises and granted the people—including the dukes—peace of mind.\n\nDuke Grenhal in particular owed Piaro a great debt and considered him a spiritual mentor. To the dukes, Piaro was *that* kind of existence. The belief that Piaro would shield them from any hardship encountered in the ruins gave them courage.\n\nYet an unexpected voice interrupted their thoughts like a rebuke: \"We're stopping the expedition. For now.\"\n\nIt was Grid.\n\n\"What?\"\n\nThe dukes had witnessed Grid's hunger from the start. His desire for new strength and treasures burned hotter than anyone's. They'd seen the raw greed flaring in his eyes when he'd spotted that Secret Technique Box. Yet now, with imperial reinforcements arrived and Piaro summoned—with exploration easier than ever—he wanted to *stop*?\n\nGrid explained to the bewildered dukes, \"I'm worried about the great demon running wild on the continent.\"\n\nEarlier, Grid had blamed himself for burdening Piaro with guilt. Then something strange occurred: his guildmates sent whispers of comfort. But wasn't this place supposed to block all communication and teleportation magic?\n\nSince arriving at the Ruins of the War God, the whisper system hadn't functioned. Yet once Piaro was summoned with the war god's permission, that restriction collapsed. Whether intentional or not, the war god had opened communication.\n\nLauel quickly contacted the Overgeared members and received real-time updates. Berith had just breached Fort Taleren, the last gateway to the Haken Kingdom's capital. A coalition had gathered to stop him: Kraugel, Hao, Alexander. The continent's greatest spearfighters—Kirinus and Rachel—had also assembled at the fortress.\n\nUpon receiving this news, Grid grew anxious. Zibal commanded the magic machine Raiders. Grid didn't know how much stronger Kraugel had become. Hao had advanced through his contract with Grid. While Grid disliked Alexander, he acknowledged the man's skill. Combined with Rachel and Kirinus—both at least Grenhal's level...\n\n*They might raid Berith without us.*\n\nUnacceptable. The Overgeared Guild had avoided the Berith raid to preserve their strength, not to concede the kill to others. Even if that person was Kraugel, Grid had no intention of yielding Berith. That would be abandoning his guildmates.\n\n*We're taking our share!*\n\nGrid studied his companions' faces. During their month crossing the Red Sea and exploring the ruins, they'd each gained two to six levels. Faker's growth proved particularly remarkable after mastering that secret technique. Yura, singled out by the war god himself, seemed to have grasped some profound enlightenment. Euphemina had copied absurdly powerful skills from the war god's followers.\n\nThe past month's journey hadn't been wasted.\n\n*This is enough for now.*\n\nGrid and Lauel had planned a massive Berith raid. They'd intended to mobilize the Overgeared Kingdom's core strength: hundreds of Overgeared members, plus Piaro, Mercedes, Jude, Sticks, Noll, Kasim, and Maxong. They'd planned to leverage everyone's power while providing opportunities to gain experience and levels. Now the key members had achieved the growth necessary to protect everyone else.\n\n*I've reached my first goal.*\n\nGrid had hit level 399 and could now acquire the 200,000 Army Swordsmanship. Time to shift priorities. The historical site and Berith needed to swap places on the agenda. Of course, they couldn't simply abandon the ruins. It would be painful if the dukes obtained something valuable while they were gone.\n\n*Plus, one of the Seven Dukes died.*\n\nHow tragic. To build bridges between the empire and the Overgeared Kingdom, there shouldn't be more deaths. The dukes' survival mattered.\n\nGrid proposed, \"Postpone the exploration. Come with us to kill Berith.\"\n\n\"...?\" The dukes responded with obvious skepticism. The ruins offered the war god's secret techniques. Berith was merely a troublesome villain. Which deserved higher priority? Time was limited. Far wiser to remain here exploring the ruins than return to the continent just to defeat Berith. The ruins' value far exceeded any rewards from killing a great demon.\n\n\"I'm reluctant to say this, but...\" Duke Grenhal stated their position honestly. \"For the empire, it's better to let Berith cause more havoc. The more damage other kingdoms suffer, the more they'll rely on the empire.\"\n\nGrid abandoned persuasion. Lauel stepped forward instead.\n\n\"The continent's sense of crisis is already high enough. If the Overgeared Kingdom defeats Berith now, every kingdom on the continent will praise us. The empire's position will weaken.\"\n\n\"...\"\n\n\"Don't you understand? King Grid proposed fighting Berith together to protect the empire's status as our ally. Are you going to throw His Majesty's favor back in his face?\" Lauel deliberately hardened his tone. Somewhat forceful.\n\nHe'd calculated that after encountering Piaro, the dukes' affinity with Grid had risen. Sure enough, it worked.\n\n\"...We hear you.\" Grenhal and Morse nodded. Meanwhile, Basara merely smiled knowingly. She glimpsed the pretense in Lauel's remarks but didn't expose it. She calculated that cooperating with the Overgeared Kingdom on this matter would cement their full friendship. Nothing to lose, and exploring the ruins without the Overgeared Kingdom would prove difficult anyway.\n\nAs the atmosphere shifted favorably, Grid interjected, \"Besides, we can shorten the time it takes to cross the Red Sea. Great Sage Sticks will arrive shortly and transport all of us via Mass Teleport.\"\n\n\"I've heard of the great sage's reputation, but in principle, this space blocks teleportation magic. Even a great sage can't—\"\n\n\"Not anymore. The environment's changed. Try using communication magic to verify.\"\n\nThe conversation proceeded smoothly. The dukes cast communication spells, contacted their families, and confirmed it worked. The group had reached the point of uniting to defeat Berith.\n\nMarquis Fulbas and his ten thousand troops stood stunned by the scene unfolding before them.\n\n*Why are the dukes standing with the enemy king?*\n\n*The dukes seem far too friendly with the Overgeared King...*\n\n*What the hell is going on... Wait—*\n\nThe puzzled Marquis Fulbas and his troops simultaneously froze in shock. Grid and the dukes were deep in serious conversation when the unidentified man squatting nearby—doing something to the soil—approached Grid. They saw his face.\n\n\"P-Piaro...!\"\n\nThe traitor Piaro. The ten thousand troops reacted in varied ways. Those who believed Piaro innocent trembled with joy at the old hero's return. Those who considered him a traitor grew alarmed. Of course, the latter group far outnumbered the former. The imperial family had long ago declared Piaro a traitor, charged him with rebellion, and executed his entire family. With such finality, very few believed Piaro had been framed.\n\nMarquis Fulbas belonged to that extremely rare minority. As a great noble who'd fought alongside Piaro in his youth, the marquis froze like a stone statue, eyes reddening. Seeing Piaro standing with the dukes revealed the truth.\n\n\"I'm relieved to see you well.\"\n\n\"...Are your parents still in good health?\"\n\n\"Yes. They've lost all their teeth, but they're healthy.\"\n\n\"I believe they'll live a long time. They always opened the granary doors to help the people during disasters, even if they starved themselves... The people praised them as gods and believed they'd be blessed with long, healthy lives.\"\n\n\"But their bellies are fat now, unlike me—so greedy I sold my daughter instead of sacrificing myself.\"\n\n\"If someone opens the granary doors, someone else must fill the granary. Don't you know that? You must have suffered.\"\n\n\"Sir Piaro.\"\n\nHe was still the same. That brief exchange purified the marquis. A hero wasn't a hero for nothing. Yet the marquis occupied the position of a servant who shouldn't doubt His Majesty the Emperor. So Marquis Fulbas had believed the treason charge rather than question it.\n\n\"I'm sor... I'm sorry.\" Marquis Fulbas collapsed, strength draining from his legs, tears streaming down his face. The nobles who'd recently distanced themselves from him wept as well. The cracks that had just formed began to mend.\n\nHuroi—disguised as Earl Baget—frowned. *Piaro's ruining everything...*\n\nHow much had Huroi struggled? Just as Huroi clutched his chest in frustration—\n\n—*I want to see it.* The voice of War God Zeratul rang in Grid's ears. —*Can you safely escape from here?*\n\n*What's he saying all of a sudden?* The bewildered Grid looked around.\n\nA group approached from the distance. One hundred knights clad in translucent white armor, radiating an ominous atmosphere. Duke Grenhal recognized them and cried out, \"Kyle! Four reinforcement units were supposed to arrive. One of them is Kyle's...!\"\n\n*Kyle?* Grid's expression soured. Kyle was one of the Five Pillars of the empire. In the past, Grid had fought Kyle face-to-face. If Braham and Mumud hadn't unleashed their power due to that quest... Grid and Agnus would've died, unable to cope with Kyle's overwhelming strength.\n\nKyle might be the weakest of the Five Pillars, but he remained a serious threat. Unlike the Seven Dukes, he shared no history with Piaro, so he'd be thoroughly hostile. The war god delivered an even greater threat to the nervous Grid.\n\n—*He listened to me, unlike you. He acknowledged his shortcomings and climbed the path I suggested.*\n\n\"...!?\"\n\n—*To leave this place, you must defeat my new follower.*\n\n[A new quest has been created!]\n\n**[Follower of the War God, Kyle]**\n\n**Difficulty:** SSS\n\n**Description:** One of the Five Pillars, Kyle, visited the ruins under the emperor's command. Then he met the War God. He believed the path of martial arts proposed by the war god was a blessing and became an ardent follower.\n\nFight and win against him, who now comes running to kill you under the war god's order!\n\n**Quest Clear Conditions:** Kyle's death or make him flee.\n\n**Quest Clear Rewards:** Free access to the Ruins of the War God.\n\n**Quest Failure Penalties:** Level -5. Remove the effect caused by the whim of the war god (communication and teleportation magic allowed at the ruins). Interest in martial arts will increase.\n\n\"Shit!\"\n\nHe'd worked so hard to raise that level over the past few months. He'd finally reached level 399—the 200,000 Army Swordsmanship was right there. If he failed this quest, he'd lose months of time and effort that couldn't be replaced with money. The terrified Grid shouted at Piaro and his companions, \"We have to stop him!\"\n\nThen...\n\n\"It's you!\"\n\nLightning erupted. The gray-haired, one-armed Kyle materialized before Grid with blinding speed, releasing lightning far more powerful than before. His very presence resembled a natural disaster.\n\n\"You dared ignore the war god's favor...! Huh?\" Kyle was snarling with a terrifying expression when he suddenly looked amazed. He saw Grid's face and recalled an old memory—the face of the Undefeated King's descendant peering at him from beneath a straw hat. The face of the absolute being who'd severed his right arm with overwhelming force. He could never forget it.\n\n\"...I think I've got the wrong person.\" Kyle suddenly stepped back.\n\n\"...?\" Grid stood dumbfounded.\n\n\"Then I'll be going now.\" Kyle hurriedly retreated.\n\n[The quest 'Follower of the War God, Kyle' has been completed!]\n\n[You can now freely access the Ruins of the War God!]\n\n\"...???\"\n\n—*...???*\n\nAn awkward silence descended. Neither Grid nor the War God could grasp the situation, quiet for a long moment. The silence stretched on until a magic circle materialized in the air and Great Sage Sticks appeared. Grid spoke politely to the war god watching him from somewhere.\n\n\"I-I'm going.\"\n\n—*...*\n\n\"Uh, let's go.\"\n\n—*...*"
}