{
  "id": 1043,
  "title": "Chapter 1042",
  "content": "# Chapter: The Gathering Storm\n\nEllelua had once been a jewel of the Haken Kingdom—a sanctuary for artists, its streets alive with tourists admiring masterworks and architectural marvels. Now it was a graveyard. Great Demon Berith's rampage had reduced the cultural capital to rubble. Shattered sculptures lay half-buried in dust. Buildings that had inspired generations stood as hollow shells against an ashen sky.\n\nA massive magic circle blazed to life overhead, cutting through the settling debris. Pillars of light crashed down, and when they faded, Grid's party materialized alongside the imperial dukes. The remaining forces had stayed behind at the ruins to assist Skunk's research expedition.\n\n\"Wait, is this Fort Taleren?\" someone asked.\n\nThe Overgeared members surveyed the desolate landscape, confusion rippling through their ranks. No fortifications. No defenders. Just endless devastation.\n\n\"No, this is Ellelua.\" The speaker approached with measured steps—Zednos, first-ranked wind magician. Behind him stood hundreds of Overgeared members: Toon, Laella, Ibellin, Zirkan, Coke, and more. Veterans and fresh recruits from the artillery division, all gathered ahead of Grid's arrival. \"Fort Taleren is the kingdom's last stronghold. The moment war broke out, they locked down all teleportation magic. This was the closest safe point we could access.\"\n\nHis explanation had the practiced cadence of someone who'd already answered this question a dozen times.\n\n\"How far to the fortress?\" Lauel asked.\n\n\"With speed buffs? Ten hours. Maybe less.\"\n\n\"*Ten hours?*\" someone groaned. \"We're not soldiers! I already did my service, I'm not marching again!\"\n\n\"Lucky you. Some of us never had the chance.\"\n\n\"Then go get naturalized to South Korea and enlist.\"\n\n\"...Pass.\"\n\n\"Seriously though, ten hours? Won't the fortress fall before we even arrive?\"\n\nThe concern was valid. Berith collected souls through slaughter, using them to tear open hell's gates and summon reinforcements. If he breached the fortress and reached the capital, he'd have an endless supply of resources. The raid difficulty would spike exponentially.\n\nToban shook his head. \"Zibal's already there with thirty thousand elite troops and the Haken nobility. That fortress was built for siege defense—Berith won't crack it quickly. Besides, Kraugel, Hao, Alexander, Rachel, and the others will arrive ahead of us. We'll have time.\"\n\n\"Toban's right,\" someone else added. \"We shouldn't worry about the fortress holding. We should worry about them clearing the raid before we get there.\"\n\n\"Ah... true.\"\n\nThe mood shifted. Kraugel and Zibal operated on a different level than most rankers. Add the continent's greatest spearman to the mix? Berith might already be dead by the time they arrived.\n\n\"How did Kraugel even recruit Kirinus and Rachel? Didn't Grid need noble status before he started gathering named NPCs?\"\n\n\"Kraugel's Kraugel. That monster's been preempting quests since day one, he—wait.\"\n\nThe chatter died abruptly.\n\nSeveral members had noticed the bright gold nameplates drifting near Lauel. Named NPCs. Grenhal. Morse. Basara.\n\n\"Why are *they* here?\"\n\n\"Oh, right! I forgot to mention.\" Lauel's grin was practically audible. \"Everyone, meet our allies. The dukes of the Saharan Empire.\"\n\n\"Dukes of the empire?!\"\n\n\"The *Seven Dukes*?!\"\n\nShock rippled through the crowd. These were the untouchable titans who had terrorized them during the imperial conflict. The enemy commanders who'd kept every Overgeared member awake at night with anxiety. Why were they *here*, fighting alongside them?\n\nThose who'd traveled with Lauel merely smiled.\n\n\"Huhuhut. You can thank Grid for this.\" Lauel's chest puffed with pride.\n\nThe members who'd just been praising Kraugel fell silent.\n\n'God Grid strikes again...'\n\n'Kraugel brought two named NPCs. Grid brought three *boss-tier* dukes...'\n\n'They look absolutely terrifying.'\n\nGrenhal astride his two-headed hippopotamus, Morse on his saber tiger—both radiated raw power. Grenhal especially, with his gleaming armor, looked like the ultimate tank. The kind of immortal fortress that would laugh off attacks from entire raid parties.\n\n'They call him the Immortal King for a reason...'\n\nIf only they knew Grenhal fought *without* his armor when things got serious. But that revelation would have to wait.\n\n\"It's an honor to fight alongside the dukes,\" someone said carefully. \"We'll watch each other's backs.\"\n\n\"The Overgeared King chooses his companions well.\" Grenhal's response carried genuine respect. \"The pleasure is ours.\"\n\nTemporary allies, perhaps, but valuable ones. The dukes would be shields against Berith's overwhelming might. The Overgeared members treated them with careful courtesy, and the dukes returned the politeness in kind. Both sides measured each other, taking stock of their combined strength.\n\nToban attempted to boost his affinity with the evil eyes' king through gifts, but even his most valuable offerings barely moved the needle. Same story for everyone else. The imperial dukes made befriending the evil eyes' king look easy by comparison.\n\n'How the hell did Grid win them over?' The question hung unspoken in everyone's minds as they stared at him.\n\nMeanwhile, Grid wrestled with his own concerns.\n\n'The Five Pillars...'\n\nClearing that SSS-grade quest had granted him free passage to the War God's Ruins—no more ten-day voyages required. A tremendous prize. Yet it sat heavy in his thoughts. The dukes were powerful, yes. But the Five Pillars? According to the war god, the dukes had \"consumed all their talents.\" Empty shells. Worthless.\n\nKyle, though? Kyle had been *chosen* after mere days in the ruins. The war god had deemed him worthy despite dismissing the dukes entirely. And Kyle was supposedly the *weakest* of the Five Pillars.\n\n'If the others become followers too...'\n\nThe implications churned in his stomach. Enhanced by the war god's power, the remaining pillars might reach yangban-level strength. Maybe higher.\n\nHe'd thought winning over the dukes would smooth relations with the empire, give them leverage in future conflicts. But now the war god had inserted himself into the equation. Could the dukes stand against empowered Pillars?\n\n'And why did Kyle run from me?'\n\nThe memory nagged at him. At first, Grid had assumed Kyle simply hadn't recognized him, that they'd passed each other coincidentally. But looking back with fresh eyes? Kyle had definitely *fled*. The quest completion proved it.\n\n'Unless...'\n\nGrid dug through his memories, hunting for the connection. Then it clicked.\n\n*\"What is this insect?\"*\n\n*\"A pathetic worm dares bare its teeth at me?\"*\n\nBraham. Of course. When Braham had borrowed Grid's body to battle Mumud, he'd treated Kyle—already missing an arm—like roadside trash. Kyle had practically wet himself before scrambling away.\n\n'He panicked. He saw my face and *panicked*.'\n\nBraham's arrogance had created an unexpected advantage. Thanks to that encounter, Grid had breezed through what should have been a deadly confrontation.\n\n'Braham really is my guardian angel.'\n\nA plan crystallized. Next time he faced Kyle, he'd exploit that trauma to its fullest. Channel the cheap, thoughtless personality he'd possessed in his early days. Let Kyle see what he feared most.\n\n'Kyle might be the key to everything...'\n\n\"King Grid.\"\n\n\"Huh?\" Grid surfaced from his thoughts.\n\nLauel stood before him, battle plan complete thanks to Basara's strategic insight and Sticks' wisdom. \"Everything's ready. Please give the order.\"\n\n\"Ah. Right.\" Grid straightened, scanning the assembled faces. Overgeared members. Imperial dukes. Strong, dependable allies—\n\n\"Wait.\"\n\nHis gaze snagged on an unfamiliar figure.\n\n\"Who's that?\"\n\nEarl Baget. An imperial noble. Standing among their ranks as if he belonged there.\n\nHuroi—wearing Baget's face courtesy of his Disguise skill—blinked behind the illusion.\n\n'He doesn't recognize me...'\n\nThe Berith raid had summoned every combat-capable Overgeared member. Huroi included. But his disguise was too perfect. Grid saw Earl Baget, not his own guild member. Huroi had assumed the circumstances would tip Grid off. That Grid would notice his absence and put the pieces together.\n\nInstead? Nothing. Grid didn't realize Huroi was missing at all.\n\nTears threatened to spill. Months of suffering flooded back—all the struggles, all the hardship, and now this. Unrecognized. Forgotten.\n\n\"Ahem.\" Grid cleared his throat, belated recognition dawning. His ears burned red.\n\n---\n\nFort Taleren rose from the canyon like a titan's fist—seventy meters of integrated stone, walls that had repelled even imperial campaigns in centuries past. The roar of thousands echoed from its battlements.\n\n\"Zibal! Zibal! Zibal!\"\n\nThe soldiers chanted the name of their returned hero, the man who'd arrived with a magic machine to defend their homeland.\n\n『This time will be different,』 a broadcaster murmured. 『They have to succeed.』\n\n『The former second-ranker's influence is remarkable. Rallying the Haken nobility, assembling this many elite troops—unprecedented.』\n\n『The army's one thing. The real question is whether Zibal and Raiders can make a difference.』\n\nMedia from across the world had converged to capture this moment. The white giant stood sentinel on the fortress wall, spear raised toward the heavens—majestic, noble, almost divine.\n\nThen the horizon *moved*.\n\nThree thousand demons surged forward, a tide of claws and fangs and malice. At their head rode Berith on his corpse-pale mount, a vision of corruption incarnate. Against that wave of hell, Raiders shone like heaven's answer.\n\n\"A giant's relic.\" Berith's voice carried across the distance, thoughtful. Magic machines—born from arrogance and ignorance, crafted to oppose the gods themselves—could threaten even great demons. When wielded by their creators. But in human hands, operated by human intelligence? \"It'll fail within seconds.\"\n\nHis army would devour the fortress whole. No need for Berith himself to soil his hands. His certainty was absolute.\n\n\"Forward.\"\n\nThree thousand demons, each level 360 or higher, began scaling the canyon walls.\n\n『The battle begins!』\n\nThe world held its breath. Would Great Demon Berith—who'd spent months crushing kingdoms into dust—finally fall? Or would another realm be erased from existence? Hundreds of millions watched from screens across the globe, suspended between hope and dread.\n\nZibal stood on Raiders' shoulder, Golden Cudgel in his massive mechanical grip. Panmir had forged that ego weapon long ago. Since then, Zibal had poured countless quest rewards and hidden piece effects into strengthening it. Now it gleamed at +8 enhancement, imbued with amplification and penetration properties.\n\n'Not for glory this time.'\n\nHis entire career had been built on ambition. Wealth. Honor. Recognition. As the second-ranked player and leader of the Seven Guilds, he'd never apologized for humanity's history of greed-driven conflict. He'd *embodied* it, fighting purely for personal gain.\n\nBut time changes people. Years of growth. Steady evolution. Today he fought for something different.\n\nToday he understood what honor truly meant.\n\n\"**Grow!**\"\n\nDemons crested the walls, jaws wide to tear into soldiers' flesh.\n\nThe cudgel fell like divine judgment.\n\n*CRASH.*\n\nDemons exploded into ash. The fortress erupted in cheers—soldiers and viewers alike roaring their approval as a new hero rose from the ashes of despair."
}