{
  "id": 1044,
  "title": "Chapter 1043",
  "content": "Debirion, the god of hunting, was born from mortal myths like countless other indigenous deities. His divine authority paled before Rebecca, Hexetia, and Zeratul. The Saharan Empire branded his worship heresy. That was the measure of his power. Yet to Zibal, Debirion remained an object of absolute faith.\n\n\"Grow!\"\n\n[Due to Debirion's favor, PvE damage has greatly increased and experience gained has increased slightly.]\n\nThe passive buff triggered the instant combat began. This blessing had once propelled Zibal to second place among all players. Debirion's Envoy specialized in hunting and accelerated growth—Zibal had been certain it would carry him past even Kraugel. But the class had crippling weaknesses in player combat. He'd been forced to abandon it for Sky Rider. Losing all that gold to Grid in the National Competition's raid event had sealed the decision. The moment Zibal became a Sky Rider, every trait of Debirion's Envoy vanished.\n\nStill, Debirion was a merciful god. Rather than curse one of his few faithful for abandoning him, Debirion bestowed a blessing that preserved Zibal's hunting prowess. Any creature classified as a monster—regardless of race—was rendered vulnerable before him.\n\n\"Increase!\"\n\nThe Golden Cudgel's function was deceptively simple: grow or shrink. But wielding it properly demanded legendary skill, making it notorious as one of the worst weapons to master. The greatest danger came from the recoil when its mass expanded.\n\n[The skill 'Lengthen' has been used to the maximum!]\n\n[The attack power of the +8 Golden Cudgel has increased significantly, and a critical hit will occur unconditionally. The critical damage is tripled.]\n\n[The target has been destroyed!]\n\n[The weapon you're using is very heavy. You can't endure the strength.]\n\n[The muscles in your right arm are torn, and the bones are broken!]\n\n[You can't move your right arm!]\n\n\"Gah—!\"\n\nZibal's eyes blazed crimson as he clenched his jaw. His right arm—still gripping the Golden Cudgel that had just pulverized a demon—turned mottled black and twisted at an unnatural angle. His fingers went numb. If he couldn't hold on, the weapon would slip free and he'd lose ownership. This brutal limitation had always prevented Debirion's Envoy from unleashing the Golden Cudgel's full potential.\n\nBut things were different now.\n\n\"Pegasus!\"\n\nThe winged horse from legend—the creature that had convinced Zibal to become a Sky Rider. Pegasus licked his mangled arm with practiced familiarity. Within seconds, the limply hanging appendage knitted itself back together. The entire process took two seconds. As one of the strongest among two billion players, Zibal existed in a heightened temporal state—he felt sensation flooding back into his fingertips immediately.\n\n\"Shrink!\"\n\nThe Golden Cudgel contracted like a spring, snapping back to normal size.\n\n\"Hngh—!\"\n\nZibal staggered backward from the rebound, his spine colliding with Raiders' leg. He downed a potion and shouted to the soldiers manning the walls, \"Hold the line!\"\n\nHell possessed hundreds of demon species. Like monsters, they came in countless forms, and Berith's army was no exception. Some resembled insects—small but swift enough to scale the fortress walls in seconds. Others took beastly shapes—massive, ponderous tanks of muscle and hide. The Golden Cudgel barely scratched them. The demons that survived Zibal's onslaught reached the battlements and vomited streams of fire and poison at the defenders.\n\n\"Ahhh!\"\n\nSoldiers who'd been emboldened by Zibal's valor were engulfed in flames and burned alive. Others hurling stones from below watched in horror as their escorts vanished without trace. Formation discipline collapsed. The demons climbed faster. Even those who'd recoiled from Zibal's attacks chittered with glee as they spread their wings.\n\nFly-like demons. Tiny, but their saliva crystallized into hundreds of needle-thin projectiles invisible to the naked eye, raining down on the soldiers.\n\n\"Shield the men!\"\n\nThe nobles, led by Earl Flenitium, vaulted over the ramparts and conjured magic. Shimmering barriers deflected the demonic assault. These were the pillars of the Haken Kingdom—nobles who'd ignored the royal family's despair when Berith first marched. They'd been Zibal's former employers, his early benefactors. When he was nobody, they'd trusted him with quests that built his confidence and reputation. Without them, the Zibal of today wouldn't exist.\n\n\"Don't overextend.\"\n\nZibal glanced at the nobles behind him and smiled. He could feel time's passage. Nobles who'd once towered over players now depended on them for survival. The world had changed.\n\n\"Pegasus, let's handle those pigs while we have the opening.\"\n\nPegasus bore Zibal skyward. The demons swarming the walls filled his vision.\n\n*These bastards.*\n\nZibal targeted the massive creatures leading the demon vanguard. They possessed bear-like physiques covered in matted gray fur, with four grotesque faces sprouting from a single head. Bizarre, and monstrously durable. Arrows and stones launched by the defenders simply bounced off their bodies, shielding the demons behind them. Hell's tanks. Zibal decided they had to die first and swung the Golden Cudgel.\n\n\"Grow!\"\n\nThe weapon's size and weight exploded. Blood vessels ruptured along Zibal's right arm. He endured. His arm was shredded meat by the time the Golden Cudgel crashed onto the multi-headed monstrosities.\n\nPegasus whinnied anxiously as Zibal trembled. Eight eyes locked onto him simultaneously. The creatures didn't die. The Golden Cudgel's strongest attack only carved away a portion of their health.\n\n\"Tough bastards.\"\n\nThese weren't even elite monsters—just common troops. Yet they'd survived the Golden Cudgel's maximum output. Frustration gnawed at Zibal. The demon army stretched across the plains like a black tide, already scaling the fortress walls. He might not even reach Berith before being torn apart.\n\n*...I really am finished.*\n\nHe smiled wryly. Back when he'd challenged for first place, no hardship had frustrated him like this. He'd endured far worse situations. Of course, he'd also failed many of those trials. He'd tasted defeat so often that reality had beaten idealism out of him, shaping who he was now.\n\n*Not today, though.*\n\nThere was no guarantee he could repel this demonic horde. But he couldn't afford frustration. He had to keep fighting. It was time to rediscover the reckless daredevil he'd once been. His courage would steel the morale of his former colleagues and the soldiers.\n\n\"Raaahhhh!\"\n\nThunder cracked across the battlefield. Earth trembled every time Zibal swung the Golden Cudgel. His right arm broke repeatedly. Pegasus's aura drained to nothing as it desperately healed him over and over. Finally, the hulking tanks at the demon vanguard collapsed one by one. Arrows from the fortress walls began finding their marks among the demon ranks.\n\n\"Yeahhh!\"\n\n\"Zibal! We believe in you!\"\n\nMorale surged. The nobles battling the fly-demons brightened. Hope kindled—perhaps they could save their kingdom with their own hands.\n\nBut Pegasus's expression grew pained. Its tongue trembled as it licked its master's arm. The white wings beating against the sky faltered.\n\n\"Hah... hah... hah...\"\n\nZibal teetered on collapse. His stamina gauge flashed crimson.\n\n\"Not... yet...\"\n\nJust a little more. He had to eliminate the demon army's ranged attackers at minimum. But his vision kept blurring. This was it. His gaze drifted to Raiders standing inside the fortress. He'd planned to deploy the magic machine against Berith, but with death imminent, plans changed.\n\n*Use Raiders to break through and kill Berith.*\n\nZibal stroked Pegasus's neck. The creature read its master's resolve and turned with mournful eyes. Just as it began descending toward Raiders—\n\n\"\"How tedious. How long did you think I'd tolerate a mere human's defiance?\"\"\n\nA putrid stench accompanied the voice in Zibal's ears. He'd heard it over a hundred times through broadcasts—the voice of Great Demon Berith.\n\n\"\"You've hurt my soldiers. The price must be paid.\"\"\n\n\"...!\"\n\nZibal's eyes widened. Absurd that Berith's voice reached him from such distance. More absurd was the dust churned up by battle solidifying into metal.\n\n\"\"Cease your struggle. Die.\"\"\n\nRazor-edged metal fragments coalesced and spun, forming a roaring cyclone. It shredded demon flesh indiscriminately as it spiraled toward Zibal. Pegasus beat its wings frantically, trying to weather the storm, but its strength was spent.\n\n\"Pegasus, return.\"\n\nBetter that Zibal die alone. Losing Pegasus would hurt far more. The creature stubbornly shook its head, refusing. Zibal canceled the summoning.\n\nHe plummeted.\n\n*Earlier than planned, but I still have one more shot.*\n\nZibal had already bound his revival point to Fort Taleren. Death meant immediate resurrection with fully restored stamina.\n\n*I'll fight again.*\n\nA second death would lock him out for hours. The Haken Kingdom would suffer in his absence, but there was no alternative. The metal storm closed in as Zibal fell. Would the storm or the ground kill him first? As he entertained that idle thought, someone caught his wrist and yanked him upward.\n\nA low, cold voice followed.\n\n\"Take a break.\"\n\nAn unforgettable voice. One that had stirred envy and jealousy. Later, admiration and longing. The voice of the former supreme.\n\n\"Kraugel...!\"\n\nA silver robe with an embroidered golden dragon rippled in the wind. Soft silk wrapped around Zibal's battered body.\n\n\"Tearing the Sky.\"\n\nThe claw of some primordial beast carved itself across the heavens. The metal storm froze mid-spiral. The attack that would've shredded Zibal reversed trajectory, sweeping back through the demon army to engulf Berith. Just before impact, the metals dissolved back into dust and scattered.\n\n\"\"Sword...\"\"\n\n\"Space Sword.\"\n\n\"\"...Saint.\"\"\n\nThe world split in two.\n\nEarth. Sky. Thousands of demons. Berith himself.\n\nAll severed."
}