{
  "id": 1045,
  "title": "Chapter 1044",
  "content": "*Hup...!*\n\nThe skill defied description. Most spectators immediately thought of Pagma's Swordsmanship—Grid's signature sword dances, especially when executed with Iyarugt's 'coolness' option, possessed an artistry that bordered on the sublime. But for sheer *scale*, nothing matched Space Sword.\n\nIt was Kraugel's ultimate technique, a super skill that took the Sword Saint's fundamental principle—*there is nothing you can't cut*—and extended it to reality itself.\n\n[Critical!!]\n[The target has suffered 15,300,599 damage!]\n[The target has suffered 17,900,143 damage!]\n[The target has suffered...]\n[...]\n[The target has sustained irreversible damage! All stats reduced by 20%! All speeds reduced by 50%!]\n[The target's weakness has been exposed! Critical hits guaranteed for 30 seconds! Critical damage multiplier increased to 1.5x!]\n[Your devastating blade has *split the world itself*!]\n\nThe canyon walls—those massive edifices of stone—cleaved in two. A line of severance traced through everything: the demon swarm blackening the sky like a plague of flies, the serpentine earth below, even the air itself. Demons advancing along the narrow path, scaling the walls, circling overhead—hundreds had their bodies bisected mid-motion, dissolving into gray ash.\n\nIf Zibal's mounted assault on Pegasus had felled over a hundred demons, Kraugel had just annihilated *thousands* with a single stroke. Space Sword's defining trait—*cutting all enemies along its path*—made it devastatingly effective against massed forces.\n\n[The Earth God Garion has intervened. All severed matter restores as if never broken.]\n\nThe canyon walls and floor, split cleanly through, rejoined seamlessly. Demons trapped in the momentary gaps vanished, swallowed by the earth's restoration.\n\nAnd then—\n\n*\"...\"*\n\nBerith's left arm, struck precisely at the shoulder, separated. White blood erupted in a fountain from the stump. The world held its breath. Every demon eye widened in shock, their advance grinding to an instant halt.\n\n*\"U-Unbelievable! The demon army has completely stalled!\"*\n\n*\"He just—the moment he arrived, he severed a great demon's arm! What tens of thousands struggled to achieve—!\"*\n\n*\"Incredible! This is Kraugel! SKY ABOVE THE SKY!\"*\n\nCommentators worldwide erupted. The global audience roared. Yet Kraugel's expression remained flat, analytical.\n\nHe evaluated the technique dispassionately: an 'empty cart.' Despite the spectacular display that had the world screaming, Space Sword hadn't secured a kill.\n\nIt boasted the highest damage coefficient among area skills, yes—but it remained *fundamentally* an area skill, with the inherent limitations that implied. Compared to other ultimate techniques, that was its weakness. The current battlefield simply highlighted its strengths: narrow terrain, massed enemies, perfect conditions.\n\n*His physical defense is double Belial's. Health roughly triple.*\n\nKraugel cross-referenced his current specifications against the Belial raid data, calculating damage ratios and health percentages. The conclusion was immediate and certain: Berith couldn't be defeated with his present power alone.\n\n*Not without Grid, Damian, and Ruby.*\n\nHis mind flickered to the Four Heavenly Kings who'd appeared during the Demon King Subjugation—Piaro, Asmophel, Noll, and that enigmatic woman. Grid had nearly lost Piaro in the Belial raid; he wouldn't risk his core NPCs again.\n\n*Buy time. That's all.*\n\nTypically, Kraugel would link Space Sword into a follow-up combo, exploiting that thirty-second critical window for devastating damage chains. Not this time. No need for heroics—the Overgeared Guild was already en route.\n\nHow did he know? Simple: Hao and Alexander had confirmed it. China's and Russia's top rankers weren't just allies—they were extensions of Kraugel's reach. His information network had evolved far beyond his solo days.\n\nThough in this case, confirmation had been even simpler.\n\n*—I'm going to kill him. Leave me a share,* Grid's whisper had promised.\n\nKraugel's gaze shifted to Zibal. The man who'd nearly died moments ago looked profoundly uncomfortable. When their eyes met, Zibal muttered, \"Dammit. I still can't tell who the protagonist is supposed to be.\"\n\n\"It's been a while since I played supporting cast.\"\n\n\"Your skin's gotten thicker.\"\n\nThey descended together, surveying the transformed battlefield. Hundreds of demons lay dead or dying. Thousands more stood frozen, staring at their master's severed limb with incomprehension.\n\nOne presence. One technique. The entire battlefield's momentum—reversed.\n\nOverwhelming. Kraugel had clearly surpassed his strength from his 'sky above the sky' days, and far exceeded the weakened state he'd shown in those first two years after becoming Sword Saint. He'd finally mastered the class's true potential.\n\n\"The competition for first place is going to heat up again,\" Zibal observed.\n\n\"No. I still have far to go.\"\n\nGrid would have grown even more. Grid commanded the continent's largest player force, with resources and information networks a solo player couldn't dream of matching. He monopolized intelligence, wealth, and talent with unparalleled efficiency.\n\nTake Great Sage Sticks, for instance. With her Mass Teleport at his disposal, Grid could deploy anywhere, anytime. His effective radius of operation dwarfed any individual's.\n\n*Truly remarkable.*\n\nWho could have predicted the Overgeared Kingdom's meteoric rise? Most observers had considered Grid lucky to maintain his initial gains. But Grid's resourcefulness had defied all expectations, developing his kingdom at a pace that outstripped centuries-old nations, now rivaling even the Empire. The man was genuinely exceptional.\n\n\"I couldn't even scratch the bastard,\" Zibal muttered, staring at Berith in the distance.\n\nThe severed arm lay on the ground like rotting meat. Blood still streamed from the stump—even great demons couldn't stop amputation bleeding instantly. Berith's slightly depleted health bar offered a glimmer of hope.\n\n\"Let's coordinate this time. I'll deploy Raiders—we can exploit an opening together.\"\n\n\"The ultimate goal of alchemy.\"\n\n\"...What?\"\n\nZibal blinked. Was Kraugel... spouting philosophy?\n\n\"It's not just transmuting gold,\" Kraugel continued, pointing. \"It's creating life. The Stone of Life proves that.\"\n\n\"What are you—\"\n\n\"Berith's flesh regenerates easily.\"\n\n\"*What?!*\"\n\nZibal's eyes widened.\n\nThe blood streaming from Berith's shoulder hardened, metallic and rigid. It formed bone, then muscle, then skin. Within seconds, the arm had regenerated completely, pristine and whole.\n\nThe viewers watching worldwide stared in shock. Zibal's jaw clenched.\n\n\"This goddamn monster.\" His tongue clicked in frustration. Severing limbs was meaningless? He'd never realized alchemy could achieve such feats. Even the Saharan Empire's alchemists—the continent's best—could barely manage enhanced potions and refined metals.\n\nBerith's gaze fixed on Kraugel—not on the stiffened Zibal beside him.\n\n*\"The Sword Saint of this era is weak.\"*\n\nDespite speaking from several kilometers away, his voice arrived perfectly clear.\n\n*\"Sword Saint Muller sealed many great demons. You? Impossible.\"*\n\nKraugel didn't argue. \"You're right. My current strength isn't sufficient.\"\n\nMuller was the strongest human in recorded history. If named NPCs measured on a potential scale from one to ten, Muller rated a hundred. No player—not even Kraugel—could match that ceiling.\n\nBut Kraugel wasn't alone.\n\n\"Sorry we're late.\"\n\n\"Took a while to round everyone up.\"\n\nHao and Alexander arrived with dozens of Russian rankers flooding in behind them. The assembled force surpassed any previous Berith raid party, Zibal's included. The audience's pulse quickened.\n\nTo Berith, they were insects.\n\nThe great demon scoffed. Ten magic circles materialized around him, rapidly converting the surrounding elements—dust, dirt, stone, water, air—into metal harder than steel. They formed ten massive spears, each radiating menace, all aimed at Kraugel.\n\n*\"Die.\"*\n\nKraugel's group swallowed hard. Fighting spirit was one thing—facing Berith's presence directly revealed power beyond imagination. Could they even hold out until the Overgeared Guild arrived? Honestly? None of them felt confident.\n\nThe ten spears crossed the battlefield, bypassing every obstacle, homing on Kraugel's position. Each one carved destruction through the canyon as it passed—clearly on a different dimensional level.\n\nThen the spears slowed. Their forms distorted, lost cohesion, and scattered.\n\n*\"What?!\"*\n\nCommentators and viewers alike stared in confusion. Hao, Alexander, and Zibal shared their bewilderment.\n\nOnly two beings understood.\n\nKraugel and Berith could see the invisible force that had shattered the alchemy.\n\n\"...Intangible will?\"\n\nA formless power—the domain of absolute masters who could obliterate matter through willpower alone. Two overwhelming presences were extinguishing Berith's technique.\n\nBerith's expression shifted, genuinely surprised. His focus left Kraugel's group, tracking toward the fortress's rear wall. Hundreds of cameras followed his gaze.\n\n\"That's an ugly horse.\"\n\n\"The great demon has an arrogant mouth.\"\n\nA man and woman stood there, both wielding spears. The somewhat short, middle-aged man displayed the name **Kirinus**. The ageless blonde woman bore the name **Rachel**. Both names shone brilliant gold.\n\nCommentators and viewers doubted their eyes.\n\n*\"The continent's best spearman, Kirinus!\"*\n\n*\"Spear Saint Rachel!\"*\n\n*\"H-How?! Why are they here?!\"*\n\nContinental powerhouses that average players would never encounter—appearing together, now, *here?* Rachel especially shocked them; as one of the Empire's Seven Dukes, her presence in the Haken Kingdom made no sense. The Empire had abandoned this region to its fate.\n\nKraugel greeted them casually. \"You came.\"\n\n\"Yes,\" both replied simply.\n\nThey knew each other. Well.\n\n*\"Don't tell me...\"*\n\nHad Kraugel recruited these powerhouses personally?\n\nThe world had written him off as an inflexible general, a solo player who'd peaked and could never catch Grid. After all, what could one person accomplish against Grid's hundreds of rankers and monstrous Four Heavenly Kings? Grid's throne seemed eternal, unassailable.\n\nThat assessment shattered in an instant.\n\nA duke. The continent's greatest spear master. Kraugel had arrived with two supreme-grade NPCs at his back.\n\nSpectators reconsidered everything. They might not know Kirinus, but the Saharan Empire ruled the continent. Its Seven Dukes wielded legendary power. Even Grid's Four Heavenly Kings would be children before them.\n\nThe realization dawned:\n\nKraugel might actually surpass Grid after all."
}