{
  "id": 1046,
  "title": "Chapter 1045",
  "content": "Everything changed when Kraugel arrived.\n\nThe fortress gates swung wide. Soldiers who had huddled behind stone walls for weeks poured into the canyon's winding paths. No longer cowering like trapped animals, they met the demon horde head-on.\n\n\"Die, you bastards!\"\n\n\"Back to hell where you belong!\"\n\n\"Get off our land!\"\n\nSteel clashed against claw. The demon advance, which had seemed unstoppable, began to falter. For the first time since the siege began, the creatures were driven back from the walls. Acid stopped eating at the stone. Flames no longer licked at the battlements. The fortress's battered defenses began, slowly, to regenerate.\n\nZibal felt his own strength returning with them.\n\n\"Artillerymen—cover fire!\"\n\nHe'd withdrawn from the front line to catch his breath, but there was no rest. As a former noble of Haken Kingdom, ex-leader of the Seven Guilds, and current soldier of the empire, commanding came naturally to him. Each volley he ordered bought time for soldiers below. Saved lives.\n\nNot enough of them, though.\n\n\"Cover them!\"\n\n\"Still loading!\"\n\n\"Shit!\"\n\nBows required skill and favorable winds. Cannons needed time between shots. Zibal could only watch as demons tore into men too far from the walls. His fists clenched. Every scream drove the blade of impotent rage deeper.\n\n*Berith. You son of a bitch.*\n\nHis gaze found the distant battlefield—a separate war being waged far from the fortress.\n\n---\n\nKirinus's spear flowed like water. Rachel's burned like dragonfire. Together, they pressed the great demon back.\n\nBerith attempted his alchemy, tried to reshape reality itself, but their wills wouldn't allow it. Kirinus and Rachel shattered each transmutation before it could form, their mental power smashing through his like a fist through glass.\n\nFinally, Berith drew his sword.\n\nThe crude blade caught Rachel's red spear. His white, pupilless eyes rolled in what might have been amusement.\n\n\"The power of thought isn't infinite.\"\n\nBoth warriors were already sweating. Their tempo had slowed—imperceptibly at first, but Berith could see it. Mental power had limits, even for legends. Soon his alchemy would outpace their disruption. Or they'd burn themselves out trying.\n\nBut Kirinus and Rachel exchanged a glance and smiled.\n\n\"Our goal—\"\n\n\"—wasn't to defeat you.\"\n\n\"We're just buying time.\"\n\n\"Exactly.\"\n\n\"...?\"\n\nThey'd spent three months as rivals, meeting daily, measuring themselves against each other. But they both remembered what really mattered. This was a raid, not a death match. Dealing damage was important. Dying wasn't part of the plan.\n\nStill, if they could hold out a bit longer...\n\n*For Kraugel's sake.*\n\nThe thought passed between them without words. Far behind, Kraugel fought alongside his companions, carving through the demon army. Kirinus saw his only disciple and truest friend. Rachel saw the man who'd captured her knights' loyalty and her own reluctant interest.\n\n*We can't let him fall here.*\n\nThey nodded to each other. Two perfectly matched warriors, standing back to back.\n\n\"Moonrise Spear Secret Technique—Eclipse.\"\n\nKirinus's spear traced a perfect circle, swallowing the light around it. The path became invisible, unreadable.\n\n\"Dehakel Fifth Style—Salamander!\"\n\nRachel's spear shot forward in a straight line, erupting in yellow flame. Unstoppable force meeting immovable object.\n\nBerith's eyes went wide.\n\nHis chest ignited. The scream tore from his throat before he could stop it.\n\n---\n\n『 Berith's health has dropped significantly! 』\n\nCommentators across the world scrambled to relay what they were seeing. Chat rooms exploded. Emotes flooded the screens—shock, celebration, applause.\n\n*Kirinus and Rachel are even stronger than we thought.*\n\nThe public's understanding of \"strongest\" shattered and reformed. Even the Overgeared farmer who'd shone during the Belial raid seemed inadequate by comparison. Of course, they had no way of knowing how much Piaro had grown since then.\n\n\"I hit harder.\"\n\n\"Only because I exposed his weakness first.\"\n\n\"Either way, I dealt more damage.\"\n\n\"My contribution was higher.\"\n\n\"Are you really that shameless?\"\n\n\"Look who's talking.\"\n\nThey bickered like children while pressing their advantage, driving back the bleeding demon. The argument mattered to them—it would settle a debate that had raged for two months.\n\nTheir spears caught Berith in the jaw and ribs. He tumbled from his mount, face slamming into dirt. His elongated body twitched.\n\nA great demon, brought low by two humans.\n\nKirinus and Rachel had achieved in minutes what tens of thousands of challengers had died attempting. The difference was simple: level. Hundreds of level 100 players were nothing against a level 300 opponent. In Satisfy, strength trumped numbers.\n\nBoth of them outclassed the thousands of rankers who'd fallen to Berith. Those thousands would struggle against either warrior alone, let alone both together.\n\nNeither Kirinus nor Rachel felt particularly threatened. This confidence explained why the Saharan Empire had ignored the Overgeared Kingdom's raid on Belial. When you commanded power like theirs, why fear great demons?\n\nOf course, that was arrogance speaking. Astaroth had already proved that. Great demons were humanity's natural predators. Never easy prey.\n\n\"You two...\" Berith spat dirt and rose slowly, his elongated form unfolding. \"You seem to be mistaken about something.\"\n\nHe smiled.\n\n\"You're my prey.\"\n\n\"Hah?\" Rachel frowned. She knew their advantage had a time limit. Knew their skills and stamina would eventually run dry, letting the tide turn. But not yet. They still held the upper hand, his alchemy sealed.\n\nThat's what she thought.\n\n\"Aren't you already dying?\"\n\n\"What—?\"\n\nRachel's question became a cough. Blood sprayed from her lips. Her pale skin was suddenly painted red, covered in wounds she didn't remember receiving. Beside her, Kirinus stared at his legs in confusion. When had they been cut? He sank to his knees, blood soaking into the earth.\n\nThe soil in Berith's mouth had become metal. Dozens of sharp nails filled his jaws.\n\n\"I told you. Mental power isn't infinite. Especially not for lower minds like yours.\"\n\nAnd then—\n\nRachel gasped. The wounds vanished. The pain evaporated like morning mist. Kirinus stood, his legs whole again. The blood-soaked earth was clean.\n\nThe world itself had been deceived.\n\nBerith's lie unraveled.\n\nReality reasserted itself—but the moment of disorientation cost them everything. Rachel and Kirinus barely had time to raise their spears before Berith spat.\n\nDozens of nails tore through armor and flesh.\n\n\"Ugh!\"\n\nReal blood flowed this time. Real pain locked their muscles, blanked their minds. For a heartbeat, they couldn't move.\n\nBerith didn't waste it.\n\n\"Humans are so simple.\"\n\nHis grin widened as the ground around them transmuted. Stone became metal. Metal became blades—dozens of them, hovering in the air, all pointed at his prey.\n\n\"Die.\"\n\nNo hesitation. No monologue. Just killing efficiency.\n\nHis sword blurred. The blades fell.\n\nRachel's and Kirinus's health bars plummeted.\n\n---\n\n『 This—this can't be... 』\n\nCommentators watched the numbers drop. The brief hope that had flared in viewers' hearts guttered and died. Helplessness settled back over them like a shroud.\n\n*Berith won't fall until the Empire itself marches.*\n\nThe experts were already making their predictions. On screen, Kirinus and Rachel had abandoned offense entirely, desperately weaving between the rain of metal death.\n\nThe dream of victory crumbled."
}