{
  "id": 1047,
  "title": "Chapter 1046",
  "content": "\"Hold.\" Box raised his hand, halting his guild members. \"We wait. We need to see how this plays out.\"\n\nThe world had expected this raid to succeed. When Kraugel arrived at Fort Taleren with Rachel and Kirinus, rankers across the continent had scrambled to join. Fighting a Great Demon meant massive rewards, even for minimal contribution. If not for the magic barrier blocking teleportation, thousands more would have flooded the battlefield by now.\n\nBut the scene unfolding before Box's eyes was nothing like what he'd anticipated.\n\nAs the first-ranked Linker—a class rivaling even Asura in difficulty—Box had served as Zibal's closest aide during the Snake Guild's golden age. When Zibal retired and abandoned the guild, leadership fell to Box. He'd brought three hundred members to Fort Taleren for what should have been an easy victory.\n\nInstead, he found himself crouched in the canyon shadows, watching disaster unfold.\n\nWhere were the rankers? Where was the overwhelming force that should have crushed Berith by now? Only a handful of players hid in scattered positions, all trapped outside the teleportation barrier. The kingdom's paranoid nobles had sealed their own doom.\n\nOn the battlefield below, Rachel and Kirinus—the continent's strongest spearmen according to every major outlet—were faltering. Kraugel's party struggled against the demon army's elite forces. These weren't ordinary demons. The plant-types sprouted tubes that belched fog across the field, corrupting soldiers' minds and turning them against each other. Insect variants fed on secreted honey, their bodies swelling with unnatural strength as they swarmed Kraugel.\n\nEach elite demon surpassed any field boss Box had ever encountered. They formed the core of Berith's power.\n\n\"Idiots,\" Box muttered, glaring at the fortress walls. What kind of fools raised a barrier when they desperately needed reinforcements?\n\nHe understood the logic. Allowing unrestricted access invited chaos—Yatan followers, rival kingdoms, anyone hoping to watch Haken burn. But wasn't certain death worse than calculated risk? The royal family had chosen security over survival, and their cowardice would doom them all. No wonder Haken remained one of the continent's weakest nations.\n\n\"This raid's finished.\"\n\nBox watched Rachel and Kirinus caught in Berith's metallic storm. Kraugel's formation broke apart—the Sword Saint, the Hao siblings, Alexander, and the Russian rankers all pulled back, abandoning the offensive. They'd recognized the inevitable.\n\n'We can't join this.'\n\nDying here meant losing experience and being immortalized on the list of failures. The Snake Guild's reputation would sink with Haken's corpse.\n\nBox exhaled slowly and turned to his members. \"We're leaving. There's nothing here but defeat.\"\n\n\"What about Zibal?\" one asked quietly.\n\nThe question cut deeper than Box expected. Zibal had founded the Snake Guild. Despite Box's leadership now, everyone knew why he'd really come. Not for glory or loot—for the man he'd once served without question.\n\nBut Box led three hundred people. Personal sentiment couldn't justify leading them all to slaughter.\n\n\"Zibal?\" Box forced a casual shrug. \"That retired fool isn't my concern anymore.\"\n\nHe turned away from the canyon, heading downstream along the river—away from his base city, away from everything he'd built in Haken. The Snake Guild would relocate to the Saharan Empire.\n\n'All those years establishing myself here, gone.' The thought stung, but survival demanded sacrifice.\n\nSmall nations offered advantages. Fewer active players meant more opportunities—high-level quests and hunting grounds with minimal competition. Better to reign in Haken than grovel at the Empire's bottom tier.\n\nBut Berith had changed everything. Watching Rotemon fall had clarified Box's thinking. Living in a nation that couldn't protect its people was simply suicide with extra steps.\n\n'Leave before the house collapses. Negotiate while you still have value.'\n\nHe followed the river, passing clusters of players heading toward the canyon—opportunists dreaming of easy rewards, ignorant of the massacre awaiting them. They'd retreat soon enough, tails between their legs.\n\nThen Box spotted another group moving in his direction.\n\nRefugees. Families abandoning their homeland before Berith's army arrived.\n\n'I'm not alone in this,' Box told himself. 'I'm not a traitor. I'm just... pragmatic.'\n\nThe rationalization felt hollow.\n\nBox froze mid-step, his guild members nearly colliding with him. Surrounded by refugees fleeing everything they'd known, he felt something twist in his chest. Guilt? Regret?\n\nHaken had been his starting city. He'd built his reputation here, met Zibal here, formed the Snake Guild here. Everything he'd become traced back to this kingdom. Did he really want to watch it burn?\n\n'Stop being sentimental. Looking back won't change anything.'\n\n\"Let's go back,\" one of his members said.\n\nBox stared at him.\n\n\"If we leave like this,\" another added, \"we'll regret it forever.\"\n\n\"Shit.\" Box closed his eyes. \"You're right. We return.\"\n\nRunning from every crisis only guaranteed you'd eventually run out of places to run.\n\nHe'd barely turned around when a shadow engulfed him.\n\n\"Hey.\"\n\nBox looked up—and up, and up—at a two-headed hippopotamus the size of a small mountain. Astride it sat a black-haired man whose face Box knew all too well.\n\n\"Coming from the fortress?\" the man asked. \"What's the situation?\"\n\nRecognition hit Box like a hammer blow. Years ago, this man had handed him one of his few defeats. Now he sat atop that absurd mount, calm as death itself.\n\n\"They'll all die if this continues.\" Box grasped the words like a lifeline, speaking to the one player who might actually make a difference—the new Supreme One.\n\n\"Then I'd better hurry.\" Grid glanced back at his companions. \"I'll go ahead. Catch up when you can. Faker, Piaro—with me.\"\n\n\"Quick Movements.\"\n\nGrid vanished. Five figures kept pace with his impossible speed—four NPCs with golden names blazing above their heads. Box squinted, reading those names, and his breath caught.\n\nA woman appeared beside him, beautiful enough to stop hearts, her smile devastating. \"You. Come with us. The first-ranked Linker should prove useful.\"\n\n\"I—\"\n\n\"Save your excuses. Move.\"\n\nHer eyes sharpened. Box nodded.\n\n***\n\n『The raid has failed,』 one broadcaster announced. 『But we must applaud their effort.』\n\n『Indeed. They fought magnificently.』\n\nDespite the spectacular battle, the outcome remained disappointing. Yet no one could deny what Kraugel had accomplished. His party had halted Berith's advance—something no force had managed before—and carved terrible wounds into the demon's flesh.\n\nThat deserved respect. They were heroes who'd stood against suffering despite knowing the odds. Across the world, broadcasters praised them. Hundreds of millions watched, silent and solemn. There were no cheers.\n\n\"\"So many souls.\"\"\n\nBerith gathered the corpses of Haken's soldiers, summoning his fourth army. The audience's mood darkened as the demon's forces swelled even larger.\n\n\"Move!\" Kraugel blocked Berith's path.\n\nHe hadn't surpassed Kirinus or Rachel, not yet. But he stepped forward anyway, hiding them behind his back as he faced the Great Demon alone.\n\n\"Are you mocking me?\" Kirinus shouted. \"I'll cover the retreat—you fall back!\"\n\nSince Aria's coronation, Kirinus had lost his purpose. When she died, his life became meaningless. If anyone should die here, it was him—not the proud student he'd accepted so late in life, the Sword Saint who represented humanity's last hope.\n\nKraugel shook his head. \"You know death means less to me. I'm immortal. I can afford the cost.\"\n\nHis eyes delivered the rest: *You can't. For you, death is the end.*\n\n\"You call yourself immortal, but death still weakens you,\" Kirinus countered.\n\n\"I can afford it.\"\n\n\"No. The Sword Saint cannot falter.\"\n\n\"...\"\n\n\"The Sword Saint is humanity's beacon. They cannot watch you fall.\"\n\nRachel moved alongside Kirinus. \"This isn't over. I still hold the title of the continent's best spearman.\"\n\nKraugel's jaw tightened. A mortal willing to die for a player—the absurdity of it struck him hard.\n\n\"Then I must ask you both something.\" He glanced at Hao and Alexander. Both nodded, grabbing Kirinus and Rachel by the wrists.\n\n\"Come. You cannot die for Kraugel's sake.\"\n\n\"Survive to train him further.\"\n\n\"\"You're all fools.\"\"\n\nThe blade storm ceased. Berith watched the humans arguing before him and shook his head.\n\n\"\"I will kill you all. Your discussions are meaningless.\"\"\n\nHundreds of magic circles materialized around the Great Demon—the precursor to something massive.\n\n\"\"This world exists as our pasture.\"\"\n\nThe magic circles transformed the canyon. Stone became metal. Tens of thousands of blades erupted from every surface—walls, ground, ceiling.\n\n\"\"Humans are livestock.\"\"\n\nBerith's white eyes curved into crescents.\n\n\"\"Your only purpose is to become food. That is destiny.\"\"\n\nThe alchemy completed. Tens of thousands of blades aimed at Kraugel's party. The ultimate technique of the 22nd Great Demon Berith, revealed for the first time since his arrival months ago.\n\n\"Dammit!\" Zibal swore, scrambling aboard Raiders. Even if he died, he'd strike at least one blow against this bastard.\n\n『Ah... no...』\n\nThe broadcasters fell silent. Witnessing those countless blades suspended in midair robbed them of words. Berith's overwhelming power rendered their analysis meaningless.\n\n*-It's going in circles again*\n\n*-Yeah, game's ruined*\n\nThe viewers had already given up. If Berith could crush an Empire duke this easily, who could possibly stop him after summoning a fourth army? Even the Saharan Empire seemed inadequate now.\n\n\"\"Go to Heaven.\"\"\n\nBerith's worst curse. The tens of thousands of blades shot forward toward Kraugel's party—\n\n\"200,000 Army Crushing Sword.\"\n\nThe explosion shattered the world. Every blade disintegrated into ash.\n\n\"\"...!?\"\"\n\nBerith's surprise eclipsed even his shock at seeing the Sword Saint. Kraugel's gaze snapped sideways. Hundreds of cameras followed. On broadcast screens across the globe:\n\n[Grid]\n\nBlack hair whipping in the wind, the Supreme One had arrived. Four golden-named NPCs stood at his side. People leaned forward, squinting at those names, then blinked and looked again.\n\nImmortal King Grenhal. Beast King Morse. Golden Crown Basara.\n\nThree dukes of the Saharan Empire stood with Grid. More remarkably, all three were staring at him like he was the monster.\n\n*-...A great game*\n\nThe Supreme One—object of envy, target of ambition. Viewers saw their futures reflected in Grid. No one called it a ruined game anymore. Hearts pounded worldwide.\n\n\"I've been waiting,\" Kraugel said.\n\nHe unleashed everything he'd held in reserve. Hundreds of swords materialized around him—Control Sword, evolved far beyond its form at the National Competition."
}