{
  "id": 1048,
  "title": "Chapter 1047",
  "content": "**\"Those aren't imposters. They're members of the Seven Dukes.\"**\n\nJohannes spoke with quiet authority. Once hailed as a once-in-a-century genius pianist in Germany, his promising career had been shattered by a terrorist attack in Britain that cost him one arm and both legs. Modern medicine had worked miracles—prosthetics so advanced they functioned at ninety-nine percent capacity.\n\nBut for a perfectionist like Johannes, that missing one percent might as well have been an abyss. Unable to match his former virtuosity, he'd announced his retirement in bitter defeat.\n\nUntil Satisfy gave him a second chance.\n\nIn the virtual world, he possessed a flawless body once more. He'd chosen the Musician class and let his boundless talent flourish, eventually earning a coveted position in the Saharan Imperial Orchestra. That role granted him access to the empire's highest social circles—a privilege few players ever experienced. Now he served as an expert panelist for German broadcasts, providing insights on the Berith raid that no one else could match.\n\n**\"Duke Grenhal and Duke Basara rank among the most powerful of the Seven. Grenhal commands the largest territory, while Basara is a close blood relation to the Emperor himself. All three present—including Duke Morse—are said to be undefeated in battle. Their pride is legendary.\"** Johannes paused as the camera zoomed in on Grenhal's weathered features. **\"Duke Grenhal bows to the Emperor alone. To him, only the Empire itself deserves his loyalty.\"**\n\n**\"Wait—don't the other royals resent that?\"** the co-host asked.\n\n**\"Quite the opposite. As a descendant of the Empire's founding bloodline, Grenhal has accumulated too many achievements to count. His military strength surpasses everyone save the Emperor. The imperial princes wouldn't dare challenge him. In fact, rumor has it they're desperate for his approval.\"**\n\nThe camera panned to Duke Morse, capturing his crude posture and unrefined bearing.\n\n**\"Duke Morse is... uncouth, to put it mildly. He lacks the dignity expected of nobility and behaves like a common brawler. The palace staff can barely hide their discomfort when he visits. He acts as though nothing in this world can touch him—a man who lives only for today.\"**\n\nFinally, the camera settled on Duke Basara. Her beauty was so striking that the cameraman held the shot longer than necessary, captivated by features that seemed carved from marble.\n\n**\"She embodies elegance itself. Every gesture is measured, every word to her subordinates gentle. The entire palace admires her. There's a persistent rumor that she's blind, since her eyes are perpetually closed...\"**\n\n**\"Hold on—aren't they open right now?\"**\n\n**\"Exactly. That's what makes this so unusual. Given the natures of these three Dukes, it's unthinkable that anything could genuinely astonish them.\"**\n\nThe commentators fell silent, pieces clicking into place. Why had Grid arrived alongside the Dukes when he was supposed to be the Empire's enemy? Most viewers focused on the surface-level strangeness, but Johannes understood the Dukes' characters well enough to recognize something deeper.\n\n**\"We've always admired Grid because he consistently exceeds our wildest expectations. But now... I believe Grid has exceeded even the Dukes' imagination.\"**\n\n**\"Come on, that's a bit—\"**\n\n**\"Think about it. Yes, the 200,000 Army Crushing Sword is devastating—he literally obliterated tens of thousands of blades targeting Kraugel's party in an instant. But skill negation isn't unprecedented. We've seen it before.\"**\n\nGranted, such abilities were exceedingly rare. Yet these were members of the Seven Dukes—individuals who'd witnessed far more than any player. Would the 200,000 Army Crushing Sword truly be revolutionary to them? Enough to make Basara open her supposedly blind eyes?\n\nIt seemed implausible.\n\n**\"The concept of countering one skill with another isn't extraordinary,\"** another panelist interjected. **\"Berith's attack operates on an unprecedented scale, certainly, but theoretically a single skill could neutralize it. If Kirinus and Rachel were at full strength, they could deploy Intangible Will to dismiss every blade.\"**\n\n**\"Perhaps... but Rachel has been frozen since Grid's arrival. That reaction seems noteworthy.\"**\n\n**\"She looks completely shell-shocked.\"**\n\n**\"Let's just... watch.\"**\n\nThe experts abandoned speculation. This was Grid, after all. They'd been burned too many times trying to predict him using conventional logic and information. Better to remain silent than have their theories demolished on live broadcast. The chat exploded with mockery for the panelists, but wounded pride was preferable to public humiliation.\n\n***\n\n> **[You have been injured by the recoil from 200,000 Army Swordsmanship.]**\n>\n> **[You have lost 50% of your health!]**\n\n\"Kkh—!\" \n\nPain lanced through Grid's body. He wiped blood from his lips with a shaking hand, reading the skill description with mounting awe.\n\n> **[200,000 Army Crushing Sword (Degraded) Lv. 1]**\n>\n> **Fires a wave of energy blades that inflicts 200% attack power to all enemies within your field of vision, crushing and nullifying their attack skills completely.**\n>\n> **Note: The more skills crushed and the greater their individual power, the more severe the recoil.**\n>\n> **Cost: 8,000 mana, 50 sword energy or fighting energy**\n>\n> **Recoil: Health loss (minimum 10%, maximum 50%)**\n>\n> **Cooldown: 30 minutes**\n\nInsane. The power dwarfed even his expectations. Like 100,000 Army Blockade Sword, it struck every target in his visual range—but dealt ten times the damage. It didn't inflict the *blocked* status, true, but instead offered guaranteed skill destruction. Not probabilistic. Absolute.\n\n'This is broken.'\n\nNothing in his arsenal compared. A genuine cheat-tier ability. He yanked out a potion and gulped it down while mopping more blood from his chin. The health cost stung, though.\n\n'And that cooldown...'\n\nThirty minutes was brutal. Few battles lasted long enough to use it twice. Still, 100,000 Army Blockade Sword shared the same restriction, so at least the higher-tier technique didn't impose a harsher penalty than its predecessor.\n\n'I've dealt with long cooldowns before.'\n\nTranscend required forty minutes between uses. Everyone saw him as invincible, but Grid constantly juggled limitations and vulnerabilities they couldn't imagine. Not that he had to sit idle waiting for cooldowns to refresh.\n\n'I have God's Command.'\n\nThe passive could reset skill cooldowns. Only a fifty-percent activation rate, but better than nothing—insurance for desperate moments.\n\n'Still...'\n\nGrid glanced back. All three Dukes wore expressions of stunned reverence. The Undefeated King's swordsmanship had that effect. They probably assumed he was the legendary descendant who'd been terrorizing the Empire from Lubana for years.\n\n\"I'm not the Undefeated King's descendant who rebelled in Lubana,\" Grid clarified.\n\n*Technically true.* He was the Undefeated King's descendant who'd slain Red Knight Lorex and severed Kyle's arm—but no reason to volunteer that information.\n\n\"...I see. I didn't think so.\" Basara's voice carried immediate certainty, her political instincts identifying truth from falsehood. If the Overgeared King were truly that notorious rebel, she'd need to verify his movements over the past months. Of course, her high affinity with Grid made her inclined to accept his words at face value.\n\nGrid had gambled on precisely that trust when choosing to demonstrate the Undefeated King's techniques before the Dukes.\n\nThe months following the National Competition had been turbulent—a whirlwind of achievements including mastering 200,000 Army Swordsmanship, developing the Overgeared Cannon, obtaining a hidden class, and refining his sword dances. His growth rate had accelerated beyond anything in his past.\n\nYet his most significant development wasn't personal power—it was connections. Cultivating affinity with the Dukes created opportunities he intended to exploit fully.\n\n'Now was the perfect time to reveal this strength.'\n\nThe Undefeated King remained the Empire's nightmare, a name spoken with fear and hostility. Ordinarily, revealing himself as a descendant would make Grid a priority target for elimination. But circumstances had changed. These Dukes had invested in a future with Grid. They'd accept—perhaps even welcome—his possession of power the Empire feared.\n\nJust as he'd predicted.\n\n\"So there are two who qualify as the Undefeated King's descendant...\"\n\n\"How fortunate that one of them is King Grid.\"\n\n\"Haha—\"\n\nRelief flooded through Grid's chest as he began to smile. Then a grotesque voice cut through the moment like a knife.\n\n**\"A hybrid.\"**\n\n\"Hybrid?\" Grid turned toward Berith.\n\nThe great demon's skin rippled between corpse-pale blue and angry crimson, fluctuating with each labored breath. A noxious stench billowed from a weeping hole in his waist—putrid and revolting. Grid's assessment was clinical. *Disgusting.* No fear, though. After confronting War God Zeratul directly, a great demon couldn't faze him.\n\nBerith's mouth twisted as he sensed Grid's dismissive appraisal.\n\n**\"Pagma. Braham. Madra. Muller... The power of four legends dwells within you. Such arrogance.\"**\n\nThe battlefield went silent. Around the world, viewers questioned whether they'd heard correctly.\n\n**\"But is that power truly yours? No. You've merely borrowed their strength temporarily, built nothing of your own. The moment you lose qualification, everything crumbles. Like now.\"**\n\n> **[A million lies have distorted the truth.]**\n>\n> **[The first class Pagma's Descendant has been temporarily lost.]**\n>\n> **[All effects and skills related to Pagma's Descendant have disappeared.]**\n>\n> **[The second class Duke of Wisdom has been temporarily lost.]**\n>\n> **[All effects and skills related to Duke of Wisdom have disappeared.]**\n>\n> **[The title Hero King has been temporarily lost.]**\n>\n> **[All effects and skills related to Hero King have disappeared.]**\n>\n> **[The skills 100,000 Army Swordsmanship and 200,000 Army Swordsmanship have been temporarily lost.]**\n\n\"—!?\"\n\nGrid froze as though struck by lightning, his body rigid as stone. The effect bypassed abnormal status classification entirely, circumventing all resistance. Confusion and disbelief warred within him as Berith's power twisted the fundamental system itself.\n\nBerith's smile widened with satisfaction.\n\n**\"Die.\"**\n\nAmong the great demons, Pagma was legendary—the human who'd blocked Hell's invasion at the Behen Archipelago. With Pagma's power, Grid couldn't be dismissed even by Berith. Moreover, Grid wielded the strength of Belial and Astaroth, proof he'd already slain two great demons. Eliminating such a threat took priority.\n\nAnd thanks to *A Million Lies*—which could only target an individual once—it should be effortless. The technique completely dismantled its victim's foundation. But Berith had miscalculated. He'd failed to properly understand who Grid truly was.\n\n> **[The third class Magic Swordsman of the Epics has replaced the first class!]**\n>\n> **[(Braham's Favor) Great Swordsman Pagma's Swordsmanship has been activated!]**\n\nGrid stood as protagonist of a mythological tale, heir to both Pagma and Braham. His status transcended Pagma's Descendant—reached beyond it to something greater.\n\nAnd in this moment...\n\n> **[An unknown person is writing the first epic.]**\n>\n> **[The beginning of the story unfolds in Taleren Canyon.]**\n\n\"Pagma's Swordsmanship.\"\n\nGrid's power crystallized, complete and undeniable.\n\n\"Transcended Link Flower.\"\n\n**\"Why—?\"**\n\n> **[He scattered azure petals across the canyon stained with crimson blood.]**\n\nReal-time world messages painted Grid's actions in mythic strokes. In Johannes' mind, a melody stirred—the opening notes of a grand epic beginning to unfold."
}