{
  "id": 1049,
  "title": "Chapter 1048",
  "content": "> *Fires 40 swords with 200% physical attack power, leaving a mark on all visible enemies. An additional two sword energies will be generated per mark, and the added sword energy will aim at their targets.*\n\nThe skill description held a simple truth: enemy count meant nothing to Transcended Link Flower. Combined with Grid's blood-sucking equipment, the ability turned overwhelming odds into an advantage. Numbers became irrelevant.\n\nMarks blazed to life across Berith's body and the demon horde within Grid's sight. Thousands of azure petals materialized above the canyon, transforming the blood-soaked wasteland into something breathtaking.\n\n> *He scattered blue petals across the canyon stained with crimson blood.*\n\n\"Incredible...\" someone whispered.\n\nThe epic's opening line resonated through the battlefield. Heads turned skyward. Eyes found Grid. Heat flooded his chest—not from superiority, but from pure recognition. After years of ridicule and exploitation, he still hadn't grown accustomed to this feeling. Perhaps he never would.\n\n> *He was an underdog familiar with insults and contempt.*\n> *A failure, exploited and unable to stand alone...*\n\n'Wait—why is it dredging up ancient history for the entire world?'\n\nGrid's face burned. The epic had just aired his darkest moments as a world message. Before he could dwell on the humiliation, the petals descended like razor rain. Beauty masked lethality. Demons shrieked as the blades found flesh.\n\n\"WAAAAHHH!\"\n\nThe Haken soldiers' roar shook the heavens. Grid's chest swelled with pride—\n\n> *He remained weak.*\n> *His slaughter of the canyon's demons was not his own achievement.*\n> *He had awakened through borrowed strength, and collapse threatened at any moment.*\n\n—only for the epic to cut him down.\n\nForty black energy blades erupted outward, converging on Berith.\n\n> *The target has received 33,250 damage.*\n> *The target has received 32,999 damage.*\n\nTwo hundred percent damage per blade. Forty strikes that would obliterate ordinary monsters. Yet Berith withstood them. After Kraugel's initial assault, the great demon had reinforced his defenses, neutralizing the technique's full power. Still—\n\n\"Why?\"\n\nShock contorted Berith's features. Confusion flickered in those inhuman eyes. The distortion of reality should have crushed this human. Yet Grid stood firm, denying the demon's authority. Anxiety sprouted in Berith's mind. He recognized the shadow of Pagma in Grid's stance, glimpsed Muller in his unwavering gaze. Another anomaly. Another transcendent capable of ending a great demon.\n\n> *The great demon of the canyon dismissed him.*\n\n\"I should've killed you first.\"\n\nBerith vanished like smoke. The corrupted steed beneath him moved with impossible speed—faster than unicorns, faster than pegasi—effortlessly outpacing the pursuing energy blades.\n\n> *Braham's Detect Force has been triggered.*\n> *Transcend's sword energy has read and locked onto the target.*\n\nThe pursuit adjusted mid-flight.\n\n\"What?\"\n\n> *He was finally complete.*\n> *His body was tempered through endless hammering, his sword dances ingrained through daily repetition.*\n> *The magic woven through his blade proved he had forged his own path.*\n> *Though overshadowed by greater names, he had accumulated enough.*\n\nImpossibility made manifest. Dozens of energy blades plunged toward the earth, then curved sharply, tracking Berith's position with predatory precision.\n\n\"Disgraceful!\"\n\nHis movements, predicted by a mere human? Berith's pride shattered alongside his bloodied face. He triggered his alchemy. An iron barrier materialized around him, designed to nullify physical attacks. The pathetic human's assault would achieve nothing against a lord of hell—\n\n\"...?!\"\n\nWind damage tore through his defenses. Every fourth strike carried Braham's Wind Cutter, splitting the iron wall and flaying Berith's skin. The petals that had shredded the demon army detonated, crackling with electricity. Braham's lightning joined the symphony of destruction.\n\nThe demon horde recoiled. Insect-types with lower health pools collapsed under the barrage. Beast-types roared in pain and fury. Hundreds of sightless demons turned toward Grid in eerie unison, drawn by the overwhelming power. The sight would have paralyzed most warriors.\n\nGrid didn't flinch. His attention remained fixed on Berith while the electrocuted demons writhed below.\n\n> *He became the first human to pierce the great demon of the canyon's inviolability.*\n> *He forged legends through his own strength.*\n\n...\n\n> *An unknown person has completed the first page of the epic!*\n\nThe world messages ceased. Silence fell across broadcasts worldwide as viewers glimpsed Grid's journey condensed into stark sentences.\n\nA supreme being without natural talent... Someone who commanded more respect than most... His beginning mirrored countless others—an ordinary star among infinite constellations—yet he had earned the world's admiration.\n\n> *Someone is paying homage to the Hero King's Stone Statue.*\n> *Someone is paying homage to the Hero King's Stone...*\n> *Someone is...*\n\n...\n\n> *There are rumors that the procession to your stone statue stretches endlessly!*\n\n...\n\n> *The Hero King's Stone Statue has reached the maximum level of 15!*\n> *The current ratio of respectful bows to the stone statue has reached maximum capacity! Over the next month, your Dexterity stat will increase by 30%, and the probability of creating higher-rated items has increased! Additionally, sword-type attack skills are 20% faster!*\n\nMore notifications cascaded through Grid's vision.\n\n> *The first page of the epic has been completed.*\n> *The epic's effect has transformed Great Swordsman Pagma's Swordsmanship into Grid's Swordsmanship.*\n> *You have witnessed Braham's magic repeatedly. Your sword dances are designed to optimize Braham's magic formulas. The magical power of your sword dances has been greatly enhanced.*\n> *You are the first player to gain a skill derived from yourself.*\n> *You have acquired one Skill Creation Right as a reward for this unprecedented achievement.*\n\n**[Skill Creation Right]**  \n*You may create one active skill.*\n\n> *Your status has risen by one level with the completion of this epic.*\n> *Maximum speed limitations, vision limitations, and sensory limitations have been partially lifted.*\n> *Your **Deity** stat has increased by 1.*\n> *Based on the epic's contents, you have gained the new title 'Legend of the Canyon.'*\n\n**[Legend of the Canyon]**  \n*All stats increased by 10%. Wide-area skill power increased by 20% in canyon terrain.*  \n*You have instilled fear in the 22nd Great Demon Berith. Berith's defense and magic resistance decrease by 10% when facing you.*  \n*The same effect applies to all demons ranked lower than Berith.*\n\n> *Your vision and bodily senses now exceed the capabilities of the Slaughterer's Eye Patch. The Slaughterer's Eye Patch merely obstructs your vision.*\n\n\"...\"\n\nDust swirled in eddies around him. Despite hovering high above the battlefield, the copper stench of blood filled his nostrils. Grid met Berith's gaze.\n\nHe exhaled slowly, closing his eyes. The world shifted behind his eyelids—adaptation required even for transcendence. When he opened them again, everything had changed. Time to test his limits.\n\n\"Worth attempting now...\" Grid murmured, reaching for the eyepatch he'd worn for so long.\n\nHundreds of cameras zoomed in on his left eye. The revealed iris blazed crimson, its narrow pupil bisecting the shadows that danced around it. An evil eye, fully awakened.\n\n> *Your refined senses are controlling the volatile magic power of the Evil Eye.*\n\n\"Hah.\"\n\nHe could see wind caressing his skin. His expanded vision created the surreal sensation of observing himself from the heavens. Time fractured into sub-second intervals. Like a cinematic superhero, his species itself seemed evolved.\n\nThe sensation wasn't foreign. He'd experienced this once before, inhabiting Chreshler's memories. This fell short of that transcendent's perception, but the nature remained identical. Grid had ascended to the level of the Seven Dukes.\n\n\"What's with that relaxed expression?\"\n\nGrid closed the distance to Berith. The great demon had fought long and hard. Only two opponents, yet they ranked among his fiercest challengers. Berith's health had plummeted. Combined with Braham's magic and Transcended Link Flower, he was approaching critical thresholds.\n\n\"Disgusting... truly disgusting. I'll teach you your place.\"\n\nThe power that had annihilated Ares' expedition materialized. Energy waves shook the canyon. The wounded demons' morale surged.\n\n\"Nothing in this world can harm me.\"\n\nReality distorted.\n\n\"My breath will level forests. Mountains will crumble beneath my steps.\"\n\nBerith wrapped himself in the lie of invincibility. For the next minute, complete immunity to all damage. His attacks would multiply exponentially. The ultimate buff that had crushed Ares' army. Viewers worldwide recognized this technique—Berith's trump card.\n\n\"I won't allow that.\"\n\nGrid's declaration cut through the tension, his face flushed.\n\n『 ...? 』  \n—*...?*\n\nWhat? Broadcasters and viewers cringed in confusion—\n\nThe false aura surrounding Berith shattered like glass. Gone.\n\n『 ....!! 』  \n—*....!!*  \n\"....!!\"\n\nThe impossible silenced everyone. Berith's shock eclipsed all others. Something materialized before him—Grid, moving with transcendent speed through Blackening's evolved state.\n\n\"Grid's Sword Dance.\"\n\n\"....!?\"\n\n\"Kill.\"\n\nThe technique pierced Berith's heart.\n\n\"Y-You...\"\n\nGrid's next strike obliterated the demon's foul mouth. Lightning exploded with each sword dance as Grid phased between positions—Berith's left flank, above his head, behind his back—a transcendent blur of destruction."
}