{
  "id": 105,
  "title": "Chapter 105",
  "content": "# Chapter 105\n\nNot long ago, I'd been drowning in debt. Then the last week happened. The Malacus raid alone netted me over forty million won in cash. Pon's payment for the Gale Spear? Nine hundred sixty million won. Appraisals and repairs for guild members added another ten million. Over a billion won, just like that.\n\nAnd there was more.\n\n> [300,000 gold has been acquired.]\n\nI stared at my inventory screen.\n\n*Huh?*\n\nThe pouch. The one Jishuka had pressed into my hands days ago. I'd shoved it into a corner of my inventory without thinking, too rattled by the whole Ahyoung disaster to check it. Now I opened it.\n\nThree hundred sixty million won.\n\n\"What the hell is this for?\"\n\nMy hands trembled as I did the conversion. The orb. Malacus's orb. She'd sold it and just... given me this? A unique-rated item that wasn't even that impressive compared to what I could forge?\n\n*Six hundred thousand gold? For that?*\n\nThe numbers didn't make sense. I'd sold the legendary <span class=\"rarity-legendary\">Sword of Self-transcendence</span> for two hundred twenty thousand gold. A *legendary* item. Meanwhile, Pon had paid eight hundred thousand for a unique-rated spear, and someone had dropped six hundred thousand on that orb.\n\n\"This is it!\" I slapped my forehead. \"Pon isn't the pushover. The world is full of pushovers! I'm out here selling legendary swords for pocket change while idiots throw money at unique garbage for ten times the price. Ha... haha... yes!\" \n\nMy laugh cracked.\n\nThe strength bled from my legs. I crumpled onto the smithy floor, the cold stone pressing against my knees. My chest constricted. The air tasted like iron and failure.\n\n*I can't breathe.*\n\n\"Uhuhuhu!\"\n\nThe truth stared me down, unblinking and merciless. No running from it now. I'd sold the <span class=\"rarity-legendary\">Sword of Self-transcendence</span> to Valdi for two hundred twenty thousand gold. A legendary weapon. To an NPC. For a pittance.\n\n\"The pushover was me! I sold it for shit! Damn it! How rotten can I be? Uwaaaack!\"\n\nConservative estimate? One point five million gold, minimum. But why guess? The auction house existed. Two million. Three million. The sky was the fucking limit. But no. I'd taken the first lowball offer an NPC tossed my way like a desperate beggar.\n\nKing of pushovers. That was me.\n\n\"I want to die.\"\n\nI pressed my forehead against the anvil. The metal was warm from the furnace. One point four billion won sat in my account. My debts, gone. Erased. That should've felt like victory.\n\nIt felt like ashes.\n\n*Breathe. Just breathe.*\n\nI forced air into my lungs. Slow. Steady. Think positive. There had to be a silver lining.\n\n*The administrator.* Right. Selling the sword had made me Winston's Person of Distinction. Tax exemption. The Divine Shield production method. Which got stolen, but then I'd killed Malacus and saved Irene. Maximum affinity. That led to the Tzedakah Guild.\n\n\"Yes!\" I pushed myself upright. \"It's fine! Actually, it's good! Great, even! No dwelling on the past. Those opportunities wouldn't have existed without the administrator. Okay! Everything's going well!\"\n\nThe self-hypnosis settled over my frayed nerves like a blanket.\n\n*Can't afford to dwell anyway.*\n\nIbellin's item. That's what mattered now.\n\n***\n\nTwo days ago, the Giant Guild had ruined everything.\n\nIbellin had scraped together enough materials for exactly one Thorn. Nab's Diaphragm, the rarest component, existed in singular form. One chance. One shot at a difficult craft.\n\nI'd been deep in the zone, hammer rising and falling with metronomic precision as I shaped the diaphragm. Forge. Temper. Fold. The rhythm of creation.\n\nThen a bloody chunk of iron came screaming through the smithy window.\n\nThe timing? Perfect. Catastrophically perfect. My hammer was already descending. Impact. The foreign metal merged with the diaphragm in a spray of sparks.\n\nI'd lost it. Hunted down the Giant Guild like rabid dogs. And the contaminated material? Useless. I'd chucked it into a corner to rot.\n\n*No point finishing garbage.*\n\nNow Ibellin stood before me, grinning like he'd won the lottery.\n\n\"I finally obtained it!\" He thrust a bundle of materials forward. The diaphragm sat nestled among them, pale and glistening.\n\nTwo days. He'd spent two days tracking down a replacement.\n\n\"Good.\" I accepted the bundle. \"I'll make it higher than epic rating. Check back tomorrow morning.\"\n\n\"Yep!\"\n\nThe kid's eyes shone with hero worship. Had been that way since I'd carved through the Giant Guild.\n\n*At least someone appreciates craftsmanship.*\n\nEveryone else? Different story.\n\nI'd watched the coverage. Seen myself on TV and the forums, Pagma's Swordsmanship cutting through bodies like wheat. My heart had pounded. Brilliant. Exciting.\n\nThe public's reaction? Horror movie villain. Psychopath. Masked murderer. They didn't care about the Giant Guild's provocation. They cared about ratings. Sensationalism. Blood.\n\n'Slaughterer.' 'Masked Murderer.' 'Brutal Psychopath.'\n\n*It's the helmet.* The Frostlight Orc Chief's Helmet was hideous. Combined with the greatsword, I looked like something that crawled out of a nightmare.\n\n*Need a new one. Something heroic. Then they'll praise me instead of running.*\n\n\"That... Grid? Are you hurt anywhere?\"\n\nI blinked. Ibellin was staring at me with concern.\n\n*This again.*\n\n\"Ibellin.\" I met his eyes. \"You admire me, right? Be honest. Does my smile look painful? Or cool?\"\n\nHis face went white. \"Yes? Were you smiling just now? I thought you had a stomachache.\"\n\n\"Shut up! Get out now!\"\n\n\"G-Grid?\"\n\n\"Get lost!\"\n\nThe door slammed behind him. Silence filled the smithy.\n\n*Focus. One chance.*\n\nI lifted the production hammer. Ibellin had exactly enough materials for one Thorn. I needed epic minimum. One hundred thousand gold. Seventy million won to clear my father's debt. Eighty million for the car.\n\nThe 13 series. Company B's mid-size visual sedan. Limited edition. The car I'd dreamed about since childhood. The car that would make everyone at the reunion eat their words.\n\n*Ahyoung's face when she sees it...*\n\nNo more mockery. Just jealousy. Regret. The power of items transcended the game.\n\n\"Ohhhh!\"\n\nThe hammer sang.\n\n*Ttang! Ttang! Ttang!*\n\nHours blurred. Night bled into morning. My concentration peaked. The hammer became an extension of my will. Metal bent. Shaped. Obeyed.\n\nThe result materialized in my trembling hands.\n\n> [Thorn]\n> \n> **Rating:** Rare\n> \n> **Durability:** 151/151 | **Attack Power:** 231\n> \n> **Armor Penetration:** +30%\n> \n> * Unconditional bleeding will occur when an attack is successful.\n> * 30% reduction in the healing ability of the attacked target.\n> \n> *A flamberge with small thorns on the blade like a black rose. It is reminiscent of the stem of a rose. The target will suffer a painful wound when touched by this weapon.*\n> \n> **User Restriction:** Level 210+, 700+ Strength, 300+ Agility, Advanced Sword Mastery Lv. 2+\n> \n> **Weight:** 300\n\n> [A rare rated item was produced, so all stats have permanently risen by +2 and reputation throughout the continent has risen by +30.]\n\n\"Ah, damn. This rotten... It's starting again.\"\n\nThe flamberge gleamed. Rare. Not epic. Not unique. Rare.\n\n*Of course.*\n\nI could forge legendary items. I was Pagma's Descendant. But probability didn't care. Most attempts? Normal or rare. That was the baseline. The average.\n\nAnd this crucial moment? Rare.\n\n\"Hah...\"\n\nI needed eighty thousand gold. Bare minimum for the car, assuming a promotion discount. Rare items didn't fetch eighty thousand gold. Not even close.\n\n*Maybe installments? No. Never again.*\n\nHeat crawled up my neck.\n\n\"Why rare? Why now? If only the administrator hadn't— Rotten bastard!\"\n\nI paced. Could I borrow from the guild? No. That would poison future negotiations. Regas? He was busy hunting for my stolen shield. Couldn't burden him.\n\n*One last option.*\n\nI opened the whisper interface.\n\n—Hey, Ibellin. I'll be late. Come back in twenty hours.\n\nThe unfinished Thorn lay in the corner where I'd tossed it. Contaminated. Ruined. Blood mixed into the metal.\n\nI picked it up.\n\n\"If I smelt it from the beginning, maybe the blood contamination is minimal. Diluted. Worth trying.\"\n\nThe furnace roared back to life.\n\n*Ttang! Ttang! Ttang!*\n\nThe hammer fell. Hope and desperation fueled each strike. The metal screamed. Bent. Reformed.\n\nThe result gleamed in the forge light.\n\n> [Thorn of Deep Grievance]\n> \n> **Rating:** <span class=\"rarity-legendary\">Legendary</span>\n> \n> **Durability:** 269/269 | **Attack Power:** 409\n> \n> **Armor Penetration:** +60%\n> \n> * Unconditional bleeding will occur when an attack is successful.\n> * 50% reduction in the healing ability of the attacked target.\n> * Generates the skill **'Laceration'**\n> * Generates the skill **'Cursed Bloodline'**\n> \n> *An item made by a craftsman with great skills and potential, but his experience and reputation is somewhat lacking. During production, this flamberge was abandoned by the creator when blood was mixed in and left as an unfinished product, so it is filled with indescribable anger and grudge. It is especially hostile to its creator and has good chemistry with the owner of the blood.*\n> \n> **User Restriction:** Level 210+, 700+ Strength, 300+ Agility, **Owner of the blood**, Advanced Sword Mastery Lv. 2+\n> \n> * If someone other than the owner of the blood equips this item, there is a 100% probability of being cursed.\n> \n> **Weight:** 300\n\n> [A legendary rated item was produced, so all stats have permanently risen by +25 and reputation throughout the continent has risen by +1,000.]\n\nI stared at the blade.\n\nBlack as midnight. Rose thorns spiraling down its length. The metal pulsed with something alive. Angry.\n\n\"This is amazing.\""
}