{
  "id": 1050,
  "title": "Chapter 1049",
  "content": "\"This... bastard!\"\n\n\"Disgraceful!\"\n\n\"*Kuaaah!*\"\n\nThe relentless barrage of sword techniques carved humiliation into Berith's flesh—a shame unlike anything he'd suffered since his birth. His elongated torso twisted as he roared through each piercing strike. But this time, even that failed. Grid vanished from his sight.\n\nThe air itself screamed. Not wind—a *storm*, born from Grid's transcendent speed.\n\nOne moment, Grid was gone. The next, thunder cracked across the sky, and he materialized to complete the final sequence.\n\n\"Pinnacle.\"\n\nGrid's blade severed Berith's head.\n\nHis skin had turned corpse-white, lips twisted in a wicked sneer. Demonic energy rose from him like heat from scorched earth. Blackening—the Dark Bus' power Grid had claimed years ago—now elevated him beyond mortal limits.\n\n*'Amoract!'*\n\nBerith's gaze locked onto the earrings adorning Grid's ears, and rage consumed him. That treacherous demon of conflict, Amoract—the bastard who *claimed* to serve Yatan faithfully, who'd scattered infernal tools among humans under the guise of \"serving all demons.\" These earrings were one such gift.\n\n*'You imbecile!'*\n\nThis was the consequence of arming humans with demonic power. All because some pathetic mortal couldn't safeguard what he'd been given. And now *Berith* paid the price.\n\n*'Amoract! This is YOUR doing! Your infernal artifacts created this anomaly! Without your meddling, I would never suffer this disgrace!'*\n\nIn his fury, Berith misread the battlefield. He believed Grid's transformation stemmed purely from Blackening. The true awakening—the completion of Grid's epic—escaped his notice entirely, masked by the activation of demonic power.\n\nGrid reappeared.\n\nThe final movements of Pinnacle Kill unfolded.\n\n>**[The effect of Braham's Enchant Weapon has been triggered.]**\n>**[The attack power of the weapon currently equipped is increased by 60% for 5 seconds, and there is an extra 20% armor penetration power.]**\n\nBefore, Enchant Weapon had merely enhanced attack power by fifty percent during sword dances. But Grid's epic completion had evolved his swordsmanship, amplifying even Braham's magic. The Enlightenment Sword blazed with white-hot radiance.\n\nGrid's blade carved luminous trails through the air—ribbons of light that resembled the Milky Way itself. Many watching found it beautiful.\n\nBerith found it *threatening*.\n\n\"What sorcery is *this?!*\"\n\nWith every sword dance, Grid invoked magic—mysterious formulas rarely glimpsed in human hands. The spells themselves were basic, their raw power unremarkable. Yet they bypassed Berith's alchemical defenses entirely, penetrating concepts of resistance and armor as though they were paper.\n\nNever had Berith endured such agony. He was meat on a butcher's block, carved and pierced without mercy.\n\nBlood flowed. His health plummeted below forty-five percent. When Grid had arrived, Berith possessed slightly over half his total vitality. Grid alone had inflicted *billions* of damage.\n\nAwe rippled through the watching world. Anticipation swelled. They imagined the great demon—who'd terrorized players for months—banished back to hell. Peace, finally restored.\n\nGrid activated Blacksmith's Rage and pressed his advantage.\n\nBut Berith's resistance proved formidable. Alchemy manifested hundreds of metal thorns around his body. The instant Grid's sword connected, the spines erupted—piercing Grid from every angle.\n\n\"*Ugh*—!\"\n\n>**[You have suffered 19,500 damage.]**\n\nThe unavoidable reflection tore Grid's body apart. Yet he didn't falter. His sword struck again as his form split in two. More reflected damage. He divided into *four* bodies, each blade driving toward Berith's heart.\n\nBelial's Power, channeled through the Rune of Darkness.\n\nGrid possessed four fields of vision simultaneously. No confusion. He perceived everything—controlled every body, every clone.\n\n\"Linked Kill Flower Pinnacle.\"\n\n\"Linked Kill Flower Pinnacle.\"\n\n\"Linked Kill Flower Pinnacle.\"\n\n\"Linked Kill Flower Pinnacle.\"\n\nThe light elemental invoked Flash. Four Grids executed the sword dance as one.\n\n>**[The effect of Braham's Enchant Weapon has been triggered.]**\n\nFour incandescent blades struck Berith's body twenty-eight times in rapid succession.\n\n\"...!\"\n\nPain beyond comprehension stole even Berith's scream. Endless suffering awaited.\n\n\"...!?\"\n\nDozens of Wind Cutters shredded his metal barriers. Blooming petals of destruction descended through gaps in the barbed wall, penetrating deep into Berith's wounds. \n\nThe explosion that followed was *catastrophic*. Had they fought on solid ground instead of mid-air, the canyon itself would have collapsed.\n\n>**[Critical!]**\n>**[The effect of the title 'Death in One Shot!' has been activated, adding 40% critical damage!]**\n>**[The target has received 8,990,600 damage.]**\n>**[The target has received 899,060 damage.]**\n>**[The target has received 899,060 damage.]**\n>**[The target has received 899,060 damage.]**\n>**[The effect of God's Command has reset the skill's cooldown time!]**\n\nImmediately after Linked Kill Flower Pinnacle concluded, the four Grids stepped back—drew their swords—and *began again*.\n\n\"Linked Kill Flower Pinnacle.\"\n\n\"Linked Kill Flower Pinnacle.\"\n\n\"Linked Kill Flower Pinnacle.\"\n\n\"Linked Kill Flower Pinnacle.\"\n\nThe same deadly sequence. Identical movements.\n\n\"...A legend.\"\n\nAs four rushing blades converged upon him, understanding finally dawned. The human before him hadn't evolved by borrowing demonkin power.\n\nHe'd become something *more*.\n\n***\n\n*『Wow... Wooow...』*\n\nBroadcasters across the globe had abandoned their duties minutes ago. Instead of commentary, only stunned exclamations escaped their lips. They'd become viewers themselves. Production directors wore dark expressions, anticipating audience backlash—but few viewers complained.\n\nThey were just as mesmerized.\n\nFully engrossed in Grid's battle, no one even *noticed* the silence. Had the broadcasters spoken, viewers would have found it intrusive.\n\n**—The chat though?**\n\nAfter two consecutive explosions, Berith crashed to the ground. A temporary lull settled over the battlefield. That single comment appeared in a broadcast chat window.\n\nIt was a signal.\n\n**—Crazy.**\n\n**—God Grid!**\n\n**—I don't even like Grid but I have to admit it now...**\n\nViewers recovered their wits and *flooded* the chat windows. Even the world's premier streaming platforms buckled under the torrent of messages. Lag spread like wildfire. Thousands of broadcast stations descended into chaos simultaneously.\n\nOn screen...\n\n\"Hah... hah... hah...\"\n\nColor returned to Grid's gasping form. The unnatural paleness faded. Blackening had ended. He recalled his clones, visibly exhausted. The absurdly-named Overgeared Corn—Grid's white horse—licked his face with concern.\n\nYet the viewers felt no anxiety. Grid collapsing was *unimaginable*. The dukes stood beside him. Berith's defeat seemed inevitable at this pace.\n\n\"...\"\n\nBerith slowly rose from the ground where he'd been embedded. The being once regarded as absolute—who'd brought despair to countless souls—looked utterly *shabby*. His health gauge lingered around forty percent.\n\nMeanwhile, four dukes remained. The continent's finest spearman, Kirinus. Kraugel. Zibal. The battle would conclude shortly. The great demon's end approached.\n\nAs that certainty solidified...\n\n\"...I can no longer use this body.\"\n\nBerith's voice. Yet his mouth remained *closed*.\n\n\"...?\"\n\nViewers and Grid alike registered confusion. Then realization struck—delayed, horrifying realization.\n\nThe owner of that voice was *that thing*.\n\n\"...!\"\n\nShock rippled through the audience. Grid went on high alert.\n\nThe sickly horse—the mount that had carried Berith since his first appearance—opened its mouth.\n\n\"This was my favorite garment.\"\n\nUnderstanding crashed down. Berith's snout stretched wide. The mouth expanded like rubber, becoming over two meters across, *swallowing* the being they'd known as 'Berith.' Flesh crushed. Bones cracked. Inside that cavernous maw, the Berith-clone was masticated and consumed.\n\n\"*Keeok*.\"\n\nA burp. White blood trickled down the elongated snout.\n\nBerith's skeleton began twisting at impossible angles. Shoulders and pelvis spread laterally. Small muscles formed across the body's surface. Three fingers erupted from equine hooves. Hind legs thickened, adapting for bipedal locomotion.\n\nWithin moments, he towered over four meters tall.\n\nA massive shadow engulfed Grid. The horse—*no*, the *demon*—gazed down at him.\n\n\"You may take pride in forcing me to use my true form. I understand all legends of this age are... *incomplete*.\"\n\nThe third phase.\n\nContrary to his previous appearance, Berith's true form—a muscular human body crowned by a horse's head—radiated overwhelming pressure.\n\n**—...Looks really strong.**\n\nHopeful viewers felt their confidence waver.\n\nBerith demonstrated an ancient truth: proper attire amplified one's power. The alchemy he'd previously executed through steps—*collecting materials, reconstructing materials*—now manifested instantaneously. A metal spear materialized before Grid's face.\n\nBerith's alchemical speed matched Grid's Blackened state.\n\nGrid moved to evade using his dragon wings—then froze. Dozens of swords flew around him, forming a protective barrier.\n\n\"...Hah.\"\n\nBerith snorted. An androgynous human stood beside Grid now. Berith recognized them immediately.\n\nThe Sword Saint.\n\nHe respected that title's weight, but the Sword Saint was only *one person*.\n\n\"You are not my—\"\n\nBerith's dismissive words died mid-sentence. His eyes widened.\n\n*When?* When had those dozens of defensive swords *left Grid's side* and embedded themselves in Berith's own body?\n\nBerith's bafflement went unacknowledged. Kraugel's gaze—deep and unfathomable as a galaxy—rested solely on Grid.\n\n\"Leave it to us and take a break.\"\n\nAs Kraugel spoke, Piaro stepped forward. Kirinus. Three dukes.\n\nOnly Rachel remained distant, staring blankly at Piaro.\n\n\"I will protect Your Majesty, even if Your Majesty is stronger than me,\" Piaro declared.\n\n\"Yes.\" Grid nodded, satisfaction warming his expression. He bumped his fist against Kraugel's. \"Please.\"\n\nKraugel was different from him. Unlike Grid, Kraugel possessed keen intelligence—he wouldn't need lengthy explanations. He'd understand that the 'Summon Hell' phase remained. He'd know they must deplete Berith's health as much as possible before the Overgeared members arrived with Yura and Ruby.\n\nMore than anything else...\n\n\"Yes, he is precious to me as well.\" Kraugel would defend Piaro too.\n\nTheir fists met.\n\n\"Heart Sword.\"\n\nThe imperfect swordsmanship of the highest realm—embodied by the current Sword Saint.\n\nBerith's shoulder *flew away*."
}