{
  "id": 1052,
  "title": "Chapter 1051",
  "content": "**How long would this take?**\n\nAs minutes stretched into twenty, then beyond, Grid's patience frayed. The system notification had said *temporarily*—surely that meant his classes and abilities would return soon? But what if he'd misunderstood?\n\nTime was subjective. For a being with eternal life, even a human lifetime might register as nothing more than a fleeting moment.\n\n*The system's screwed me before.*\n\nWhat if this \"temporary\" state lasted years? Decades? What if everything he'd lost was gone for good? Grid had been blindsided by the game's mechanics too many times to dismiss the possibility.\n\nAnd yet... would returning to normal even be the right choice?\n\nMagic Swordsman of the Epics was still developing, but already it eclipsed Pagma's Descendant. The raw power it offered was undeniable. Going back would mean regression. And if the system classified Magic Swordsman as his third class again, would it seal away Grid's Swordsmanship? The transcendent awareness he'd gained?\n\n*But I'm...*\n\nGrid exhaled slowly.\n\nHe was Pagma's Descendant. More than that—he was a blacksmith. That identity had been forged through countless hours at the anvil, through thousands upon thousands of items crafted. Some had sold for copper. Others had led to grueling quests. But each one had built connections. Relationships. Khan wouldn't be in his life if not for that shared craft.\n\nBlacksmithing wasn't just his class. It was his foundation. The core of who he'd become.\n\n\"Give it back,\" he whispered.\n\nEven if it made him weaker. Even if—\n\n\"*Give it back.*\"\n\nAround him, the canyon battlefield raged. Berith—bloodied, cornered—roared defiance as Piaro, Kraugel, Kirinus, and the imperial dukes closed in.\n\n\"*Nyang!*\" Noe mewled anxiously from Grid's shoulder.\n\nOvergeared Corn's small black tongue began licking Grid's cheek. The unicorn's expression radiated displeasure—*he* was beautiful and noble, not some common beast meant to comfort males—but his ministrations remained gentle. Grid's face had taken on a hollow, pained quality.\n\n> **[The duration of Truth Distortion has ended.]**\n>\n> **[Your classes, titles, and skills have been restored.]**\n>\n> **[However, as Magic Swordsman of the Epics possesses superior status to Pagma's Descendant, Grid's Swordsmanship remains active.]**\n\nReality snapped back into focus.\n\nRelief flooded through Grid's chest, so intense it bordered on euphoria. He'd braced for the worst. Instead, warmth kindled in his limbs as power returned—the blessings, the transcendent senses, everything rushing back like blood to a sleeping limb. Magic Swordsman of the Epics settled into place as his third class, still potent, still *his*.\n\nOf course it remained. This epic was written by his own hand. It belonged to Grid and Grid alone. No one could deny it. No one could strip it away.\n\n> **[You have encountered a mighty figure of this era. Fighting energy begins to accumulate!]**\n>\n> **[For each point of fighting energy gained, strength, stamina, and agility will increase by 0.5%.]**\n\nRed-purple light erupted around him—the aura of the Hero King, a mantle once worn by Sword Saint Muller himself.\n\n**\"*You.*\"**\n\nThrough the storm of farming implements, spears, and blades hammering his form, Berith's attention locked onto Grid. His health had dropped to thirty percent. Piaro, the dukes, even Sword Saint Kraugel—none of them mattered anymore. Only Grid. This human who walked his own path while wielding the legacy of two legends that even great demons respected: Pagma and Muller.\n\nGrid had become worthy of a demon's singular focus.\n\nUnfortunately for Grid, that meant he'd just painted a target on his back.\n\nMetal spines erupted from Berith's body in all directions, forcing his attackers to scatter. In the opening, he conjured a blade—three kilometers of sharpened death that bridged the gap between himself and Grid in an instant.\n\nIt aimed straight for Grid's heart.\n\nOr would have.\n\n**\"—!\"**\n\nBefore mastering Lantier's techniques, Faker had been the undisputed Master of Swiftness. His class granted him unparalleled speed. After learning *Fly on Top of Grass*, he'd evolved beyond even that benchmark.\n\nHe materialized between Grid and the oncoming blade.\n\nSteel met steel. Faker's dagger kissed the flat of Berith's weapon, and the angle shifted—millimeters, but enough. The blade screamed past Grid's chest and shot skyward. Faker's body hurtled backward from the impact, slamming into the canyon wall.\n\n\"*Faker!*\"\n\nGrid's shout echoed off stone.\n\nAssassins weren't built for direct confrontation. Low health, minimal armor—they were glass cannons at best. Against elite monsters with overwhelming attack power, they had no business tanking hits. Against a *great demon*?\n\nFaker should be dead.\n\nInstead, he emerged from the settling dust with barely a scratch. At the moment of contact, he'd activated Lantier's techniques to disperse the force. When he'd hit the cliff, shadow soldiers had cushioned the blow.\n\nHe dusted off his shoulders and met Grid's stunned expression.\n\n\"If I'm meant to protect you, I can't afford to be weak.\"\n\nThis was the man acknowledged by War God Zeratul himself.\n\n\"I'm joining the front line, Grid.\"\n\nThe man who'd single-handedly dismantled the Ice Flower Guild while still a normal class.\n\n\"Focus on recovery.\"\n\nThe man now pursuing the throne of assassins.\n\n\"*Kill Gate Opening.*\"\n\nFaker studied Lantier's methods. He trained under Kasim in shadow techniques.\n\n\"*God Killer.*\"\n\nAnd now he moved like light itself.\n\nHe became a streak across the canyon. Berith's crimson eyes lost focus, his consciousness wavering. Instinct screamed warnings through the demon's mind: *Crisis. Danger. The edge of oblivion.*\n\n**\"*22nd Hell Summoning.*\"**\n\nNo more holding back. Berith shattered the restrictions the world had imposed on him. The Goddess of Light would punish him for this transgression. Other great demons would mock him. None of it mattered—not compared to the humiliation of being destroyed by humans.\n\n> **[The 22nd Hell has manifested.]**\n>\n> **[Demonic energy saturates earth and sky.]**\n>\n> **[22nd Great Demon Berith's stats increase by 20%.]**\n>\n> **[All debuffs on 22nd Great Demon Berith have been dispelled.]**\n>\n> **[Humans cannot adapt to Hell's environment.]**\n>\n> **[Skill and magic effectiveness decreased by 30%. Casting speed decreased by 60%.]**\n>\n> **[Magic resistance and physical defense reduced by 20%.]**\n>\n> **[Natural health, mana, and stamina recovery disabled.]**\n>\n> **[Stamina depletes faster.]**\n>\n> **[Potions cannot be consumed.]**\n>\n> **[Creatures of the 22nd Hell are emerging!]**\n\n『 *And there it is.* 』\n\nThe excitement drained from commentators and viewers alike. They'd been celebrating as Berith was driven back, his health steadily depleting. But each new phase had made the truth clearer. Now came the final phase—Hell summoning.\n\nThey'd learned this lesson from 32nd Great Demon Belial. This was where hope died.\n\nBlack lightning split the sky. Ash fell like snow. Between the canyon walls, hellfire erupted—hotter than lava, hungry as flame. The earth cracked and split. The entire ecosystem warped: flowers on the cliffsides grew teeth, moles swelled to the size of buildings, and grotesque horses clawed their way up through fissures in the ground.\n\nAt the center of it all stood Berith.\n\n**\"*Kukukuk...! KUHAHAHAHAHA!*\"**\n\nHis laughter boomed across the transformed battlefield. These humans—livestock, nothing more—and the *fear* in their eyes was intoxicating.\n\n『 He's really enjoying himself. 』\n\n『 Which means we've pushed him to his limit. 』\n\nGratitude welled up among the broadcast audience. Without Grid, Kraugel's group, and the imperial dukes, Great Demon Berith would have trampled humanity with the same casual contempt one showed ants. They'd accomplished the impossible—forcing a great demon to take them seriously.\n\nSeeing Berith laugh so desperately was almost reassuring.\n\nStill, reality had to be acknowledged. The Overgeared Guild was at least thirty minutes out. No dramatic cavalry charge was coming this time, not like during the Belial raid. The consensus formed: the raid would fail. The best outcome now was minimizing casualties.\n\nThen came the reversal.\n\n\"So you summoned Hell. *And?*\"\n\n\"How tedious.\"\n\n**\"—*What?!*\"**\n\nThis raid party was unprecedented. Their combined power had reached an all-time peak—a convergence that could never be replicated. Kraugel. Piaro. Kirinus. The empire's dukes. Legendary figures and transcendent NPCs, every one of them equipped with resistance to Hell's influence.\n\nThe debuffs barely touched them.\n\nAs for Grid? Overgeared Corn's healing licks were still restoring his stamina.\n\n**\"Y-You *dare*—!\"**\n\nBerith's composure shattered. Hundreds of weapons materialized around him, his stats enhanced by twenty percent, the air itself crackling with amplified menace.\n\n\"Your alchemy won't save you.\"\n\nBasara's red energy corroded Berith's defenses.\n\n\"*Hahaha!* Finally, a challenge worth my strength!\"\n\n\"Don't get reckless.\"\n\nGrenhal and Morse's coordinated assault shattered the weakened constructs.\n\n\"Let's see if your skills have grown rusty.\"\n\n\"...You've improved considerably.\"\n\nThe reunion of Piaro and Rachel carved fresh wounds across Berith's form.\n\n\"*Meteor Sword.*\"\n\n\"*Shadow Legion.*\"\n\nKraugel and Faker cut through summoned beasts, clearing the path forward. Kirinus's spear blazed with azure light, each thrust a promise of judgment. The Sword Saint's Aura bolstered every member of Kraugel's party—they were humanity's champions, and they fought like it.\n\nFor the first time in eons, an unfamiliar emotion stirred in Berith's chest.\n\n*Fear.*\n\nThe weakness of prey. An apex predator should never know this feeling.\n\n**\"*Cowards—!*\"**\n\nThe flag had been planted. That word—*cowards*—rang out like a villain's dying curse. Berith glimpsed his approaching end. Grid and Kraugel's party sensed victory within reach.\n\nThen an uninvited guest appeared on the cliff's edge, green hair whipping in the wind.\n\n\"*Lich Summon: Mumud.*\"\n\nHe'd been victimized his entire life. Exploited by those who should have protected him. Humanity had disappointed him one time too many, and now he was complete. The world through his eyes had bleached to ash-gray. No expectations remained. No regrets.\n\n\"*Die.*\"\n\nLich Mumud's iridescent magic lanced toward the raid party.\n\n\"***AGNUS!***\"\n\nGrid's furious roar split the heavens."
}