{
  "id": 1053,
  "title": "Chapter 1052",
  "content": "Combat demanded speed. Prolonging the fight offered no advantage—a principle every raid veteran understood instinctively.\n\nThe oppressive environment of hell itself weighed on them, its atmosphere strangling natural recovery for players and NPCs alike. This burden drove Piaro, Rachel, and their assembled force to push harder, teeth clenched against exhaustion. They surged through the canyon with singular focus: end Berith before he ended them. Skills chained seamlessly into one another, creating an unrelenting barrage that gave the demon no respite.\n\nThe pincer strategy proved devastatingly effective. Despite his boosted defense and health from empowered stats, Berith buckled under the assault of humanity's finest warriors. His greatest vulnerability became clear—he couldn't find an opening to strike back.\n\nAs a great demon, Berith had always relied on raw power. Born strong, he'd trampled countless foes through sheer innate ability. He'd never needed to refine technique or develop tactical acumen. Now, facing adversity he couldn't simply overwhelm, those gaps in his combat repertoire became fatal weaknesses.\n\n\"You cowards...!\"\n\nFor the first time since his existence began, fear crept into Berith's voice. \n\nThen a new presence erupted from the cliff face—magical power so intense it seized the attention of everyone on the battlefield. Berith, Piaro, Kirinus, and the dukes all felt their nerves ignite. The energy condensed into brilliant light that plummeted earthward.\n\n\"Ugh...!\"\n\n\"This power...?!\"\n\nThe rainbow-hued magic detonated. Kraugel and Faker, already gravely wounded, crumpled. The dukes groaned under the assault. Only three stood firm against the onslaught—Piaro, Kirinus, and Rachel managed to shield themselves.\n\n\"Potent magic...\" Piaro studied his trembling fingertips before lifting his gaze to the cliff's edge. A green-haired figure stood there, silhouetted against the sky, the wind threatening to sweep him into the abyss.\n\n\"Agnus...\" Kraugel's voice was barely a whisper as recognition struck.\n\nBaal's Contractor. Enemy of humanity by design. His very purpose demanded he aid any great demon and imperil mankind. Yet until now, Agnus had remained silent. Kraugel thought he understood why—the burden of standing alone against the entire world was crushing.\n\nBut now Agnus had chosen. He'd intervened to help Berith.\n\n*Which means he's abandoned his hesitation.*\n\nKraugel knew what had driven him to this point. When Berith's rampage began, what had the masses done? They'd demanded Agnus sacrifice himself. When he refused their entitled demands, they'd unleashed a torrent of criticism and threats. It had transcended discourse into pure violence. From a third party's perspective, the behavior was shameful. Kraugel could imagine the anger and isolation Agnus must have endured.\n\n\"...I would've done the same if I were him.\" Faker's unexpected words cut through the tension. He clutched his wound—refusing to heal in this cursed place—and regarded Agnus not with resentment but with compassion. \"No one could tolerate that kind of harassment for days on end.\"\n\n\"...\" Kraugel couldn't disagree. If Berith fell today, the masses would celebrate their freedom from fear and pain. They'd cheer without sparing a thought for the suffering they'd inflicted on Agnus. From his perspective, rage was the only rational response.\n\nYes, both Kraugel and Faker understood Agnus's position. That didn't mean they'd defend his choice. Regardless of his circumstances, he shouldn't have turned his blade against them. Grid apparently shared that view.\n\n\"Agnus!\"\n\nGrid's voice carried across the battlefield with startling clarity—whether from his enhanced status or the raw emotion behind it was unclear.\n\n\"You bastard!\"\n\n\"...\"\n\n...On second thought, status had nothing to do with it. The fury was simply too intense to be contained.\n\n\"...Do what you need to and get out of here!\"\n\nThe words came clipped, abbreviated. Grid knew exactly what Agnus had endured—better than most, having weathered similar storms himself. He understood completely why Agnus might want this raid to fail, might crave that petty vindication.\n\n\"But push me further and I'll put you down myself.\" That's why Grid kept his sword sheathed. He'd seen the damage Agnus inflicted on Kraugel and Faker. He chose to overlook it.\n\n\"...\" Agnus's expression hardened. Fissures spider-webbed across the frozen surface of his heart. Heat bled through the cracks.\n\n\"...Don't pity me.\" His face twisted into something ugly.\n\n\"Kuhahahahat! Excellent work! Baal's Contractor! Unlike your predecessor, you actually prove useful!\" Berith's exultation rang across the canyon. That brief window Agnus created had given him the opening he needed. Reality itself began to warp under his power.\n\n\"Humans are savage beasts. They cannot master tools.\"\n\n[A million lies have distorted the truth.]\n\nBerith's curse targeted not individuals but the entire species. He didn't deny the strength Piaro, Kirinus, and the dukes had cultivated—he simply denied humanity's right to wield it at all. The effect was immediate and devastating.\n\n\"...!\"\n\nEvery weapon clattered to the ground. Spears, swords, farming implements—all tumbled from suddenly nerveless fingers. The raid party stood defenseless as hell's denizens descended upon them.\n\n\"Agnus!!\" Grid's shout carried equal parts rage and desperation as chaos consumed the canyon. They needed to hold twenty more minutes until the Overgeared army arrived. Agnus had grown formidably over the past years. His interference was catastrophic. And worse...\n\n*I can't let Braham wake up.*\n\nThe hidden quest 'Braham and Mumud' exacted a terrible price each time it triggered, consuming fragments of Braham's soul and damaging him further. Already weakened from previous activations, Braham had entered hibernation. Rousing him now to confront Mumud's soul could cause irreversible harm.\n\n\"...\" Agnus stood motionless on the cliff, gazing down at Grid. Something flickered across his face—recognition. Grid's expression mirrored one Agnus knew intimately. The same desperate reaching he'd once made through a window, trying to grasp *her* one final time.\n\n\"...Kikik.\" The sound started soft before Agnus shrugged and laughed louder. \n\nWith the battlefield reversed in his favor, Berith joined in. \"Hahaha!!\"\n\nThe raid party teetered on the brink. Grid's frustration mounted.\n\n\"Kihahahahat!!\"\n\n\"Kuhahahat!\"\n\nMad laughter—human and demon—echoed through the canyon in grotesque harmony. Viewers watching worldwide felt ice crawl down their spines. Grid's anxiety spiraled.\n\nThen—\n\n\"...Hah.\" Agnus's laughter died. He swept his gaze slowly across the broadcast cameras trained on him from every angle. \"When the next great demon descends to this world, I'll stand at its side and crush every last one of you.\"\n\n*But not today...* He swallowed those final words and turned away from the canyon.\n\n\"Agnus...\" Grid watched his retreating figure with conflicted emotions. Two men, bound by mutual debt, were finally severing those ties. The next time they met, it would be as enemies.\n\n***\n\n\"Sowing Seeds! Harvest!\"\n\nAmong those who'd lost their weapons, only Piaro and Kraugel continued the fight. Even Berith's reality distortion couldn't strip a Sword Saint of his blade, and Piaro repelled the hellish creatures through farming techniques that required no tools. But the situation remained dire. Kirinus, Faker, and the dukes—disarmed—couldn't contribute offensively. They rapidly found themselves surrounded, unable to cut through the swarm fast enough.\n\n\"Die! Hahahahat!\" Berith's excitement reached fever pitch. That precious breathing room had restored his earlier arrogance.\n\n*This can't continue.*\n\nThey'd be annihilated before reinforcements arrived. Agnus's momentary intervention had tilted the entire battlefield. They needed a new vector of attack. But who could provide it?\n\nGrid's jaw clenched—then a white titan entered his peripheral vision. Raiders emerged from the fortress and charged toward Berith.\n\n\"Die, you undead bastard!\" Zibal's war cry echoed across the canyon as a massive spear impaled Berith's torso.\n\n\"Cough...!\"\n\nBerith's laughter finally stopped. White blood fountained from the wound. His health bar visibly dropped.\n\n\"Humans cannot properly wield such artifacts...\"\n\nBut Berith quickly composed himself. He'd already known this truth—the magic machines were relics of the giants, far beyond humanity's primitive capabilities. Just as he'd anticipated, Raiders delivered only a handful of devastating blows before its control window expired. Twenty-one seconds. That's all Zibal could manage.\n\n\"A cute trick.\"\n\nBerith watched Raiders collapse and smiled despite his ravaged body. All threats had been neutralized.\n\n\"This boring performance ends now.\"\n\nTens of thousands of blades materialized around him. Time to finish this. He'd slaughter every human who'd dared oppose him, then claim the fortress for his recuperation. Zibal emerged from Raiders's cockpit and smirked at the demon's premature celebration. \"You're right about one thing. You *will* be crying soon.\"\n\n\"What nonsense—\"\n\n\"Isn't that right, Grid?\"\n\n\"....?!\"\n\nZibal's gaze directed Berith's attention behind him. The demon followed it and felt terror lance through him. \"Those eyes! Don't tell me—?!\"\n\n*Ah, Baal's eyes.* ...That's what Lauel would have said. Instead, Grid simply smiled and activated a skill, sacrificing an item he no longer needed.\n\n\"Pagma's Eyes.\"\n\n[Checking the target item's stats, options, and production method.]\n\n[The Item Replication skill has been activated!]\n\n[The legendary rated item 'Legendary Blacksmith's Hammer' will be used as the material for the artifact-rated item 'Magic Machine: Raiders'.]\n\n[The duration of the replication is one day! At the end of this period, the replicated item will be permanently destroyed!]\n\nShadow engulfed Berith's face. Before him, a second steel titan rose like a mountain range, its massive gauntlet descending to crush his skull. The canyon trembled under the immense weight. Hell creatures attacking the dukes scattered like leaves in a storm. Berith's conjured blades shattered like glass.\n\n\"K...Kuock...\" Berith's groan was barely audible. His health: 20%.\n\n\"We decide when this fight ends,\" Grid declared. His transcendent senses detected something approaching—familiar energy. Space warped like a black hole consuming reality. A woman materialized on the battlefield, having navigated multiple Hell Leaps to reach the 22nd Hell. Demon Slayer Yura had arrived.\n\n\"Hell Regulation.\"\n\n[The Demon Slayer has exerted influence on the 22nd Hell.]\n\n[The debuffs of the 22nd Hell are temporarily turned off!]\n\n[The power of the 22nd Great Demon Berith has sharply fallen!]\n\nThe impulse to blame others for one's failures wasn't uniquely human after all.\n\n\"B-Baal, you son of a bitch...\" Berith cursed the mad demon king who'd empowered two humans against him.\n\n\"Light of Destruction.\"\n\nThe Demon Slayer's ultimate weapon struck—dealing over 2000% physical damage, 4000% magical damage, and stripping away the target's magic entirely. It hammered into Berith's skull. Drastically weakened, his reality distortion collapsed. Kirinus, Faker, and the dukes reclaimed their weapons and pressed the assault alongside the black titan.\n\n\"U...Uhhh...\"\n\n*Please...give me another chance...* Berith prayed desperately. Someone, anyone—just as Baal's Contractor had suddenly appeared, surely someone would save him now.\n\n\"We made it in time?\"\n\nAs if answering his prayer, new figures emerged from every direction. Berith checked their faces and felt despair crystallize in his chest. His gaze fixed on Saintess Ruby. He realized then that his first defeat wouldn't merely cost him this physical form. Today, he would be permanently erased from existence.\n\n\"Who...! Who the hell are you?! Pagma's Descendant! Hero King! Great magician! Baal's Contractor! Why do you monopolize so much power?!\"\n\nThe question transcended even his rage and resentment.\n\n\"Me?\" Grid stood atop Raiders's shoulder and answered simply. \"Grid. I... I am Grid.\"\n\nBerith resisted with everything he had left, but stood no chance against Demon Slayer Yura and Saintess Ruby's combined might. Pope Damian's buffs empowered the raid party to unleash unprecedented firepower. The Overgeared members provided flawless support. Every Overgeared Cannon blast staggered the hell army's advance. The Snake Guild succeeded in assisting Zibal.\n\n\"Waaaaaaaaah!\" The soldiers of Fort Taleren watched Berith fall and erupted in celebration. Hell creatures fled as their realm began dissolving. After the longest battle...\n\n[You have succeeded in raiding 22nd Great Demon Berith, who has terrorized the continent!]\n\n[The soul of the 22nd Great Demon Berith has been destroyed and won't be able to reincarnate!]\n\n[The position of 22nd monarch has temporarily become vacant.]\n\n[Among the players in the Berith raid, only those who have performed to a certain level will receive the title 'Savior of the World.']\n\n[Players who already hold the title will have the title effect enhanced.]\n\n[All players who participated in the Berith raid will receive different compensation based on their performance!]\n\n[The first place in the raid...]\n\nKraugel, Zibal, and every Overgeared member turned toward the same point. Cameras from across the globe focused on that single spot. Everyone already knew the answer.\n\n[...Player Grid!]\n\n\"Waaaaahhhhh!\" Worldwide celebration erupted. Nationality meant nothing. Gender was irrelevant. The entire world praised Grid."
}