{
  "id": 1054,
  "title": "Chapter 1053",
  "content": "# The Aftermath\n\nWorld messages cascaded across the sky, visible to every player across the continent.\n\n**[Grid has obtained the raid's 1st place prize.]**\n\n**[Rachel and Kirinus have gained the raid's 2nd place prize.]**\n\n**[Piaro has obtained the raid's 3rd place prize.]**\n\n**[Kraugel and Yura have obtained the raid's 4th place prize.]**\n\n**[Basara has obtained the raid's 5th place prize.]**\n\n**[Grenhal has obtained the raid's 6th place prize.]**\n\n**[Morse has obtained the raid's 7th place prize.]**\n\n**[Zibal has obtained the raid's 8th place prize.]**\n\n**[Faker has obtained the raid's 9th place prize.]**\n\n**[Chris and Jishuka have obtained the raid's 10th place prize.]**\n\n**[★ Saintess Ruby has obtained extraordinary rewards in exchange for annihilating the soul of the great demon! ★]**\n\n**[Other personnel will be rewarded for participating in the raid.]**\n\nThe announcements sparked immediate controversy. Broadcasting channels lit up with debates. Forums exploded with analysis. Viewers dissected every placement, searching for patterns in the contribution rankings.\n\nRachel and Kirinus securing second place made sense—they'd shaved off the most health during phase one. Piaro's third-place ranking drew no complaints either. The legendary farmer had maintained consistent pressure throughout the entire encounter, never faltering regardless of which phase the raid entered.\n\nBut Yura's fourth-place ranking? That raised eyebrows.\n\nTrue, she'd arrived before most of the Overgeared Guild. She'd neutralized Berith's hell summoning—a crucial intervention. Using Hell Leap, she'd reached the canyon ahead of schedule and provided invaluable support. Still, matching Kraugel's contribution seemed excessive. The Sword Saint had empowered the entire raid with his Sword Saint Aura, and his damage output had rivaled Grid's own.\n\nThe viewing audience remained unconvinced. Kraugel and the Overgeared members, however, accepted it without question. They understood a fundamental truth the spectators missed: fighting a great demon without Yura was simply impossible.\n\nAmid the clamor, Grid focused on his personal notifications.\n\n**[The title Savior of the World has been strengthened, increasing the stat bonus from 200 points to 300 points!]**\n\n**[You have acquired <span class=\"legendary\">Berith's Human Skin Mask</span> for placing first in the raid!]**\n\n**[You have acquired <span class=\"legendary\">Berith's Hoof</span> for placing first in the raid!]**\n\n**[You have acquired two vials of <span class=\"legendary\">Berith's Blood</span> for placing first in the raid!]**\n\n**[You have acquired five pieces of <span class=\"legendary\">Berith's Mane</span> for placing first in the raid!]**\n\n**[You have acquired 30 blessed weapon enhancement stones for placing first in the raid!]**\n\n**[You have acquired 60 blessed armor enhancement stones for placing first in the raid!]**\n\n**[Berith's strength is engraved on the Rune of Darkness.]**\n\n**[...!!!]**\n\n**[Three great demons have been sealed in the Rune of Darkness! This proves you have slain at least three great demons—evidence that you walk the same path as Muller and Pagma! Should you someday achieve their level of accomplishment, your status will rise dramatically!]**\n\nGrid's lips curved into a satisfied smile. Seven guild members in the top ten rewards. His relationship with the empire's dukes had solidified considerably. His understanding of the magic machine Raiders had deepened. Every reward Berith dropped held value.\n\nOnly one absence dimmed his satisfaction—Mercedes. Missing this opportunity to enhance her status stung. Then again, she'd left for good reason. At Asmophel's request, she'd departed on a critical mission: tracking down the former Red Knights. Her absence meant a new alliance was forming.\n\n*The items are unusual...*\n\nGrid examined Berith's drops. The hoof, blood, and mane—all forged from metal rather than organic matter. He reached for them.\n\nThen everything went wrong.\n\n**[...!!!]**\n\n**[Too much of the great demons' power is contained in the Rune of Darkness. The capacity of the rune has been exceeded, and the rune is running wild!]**\n\n*What? No, this—!*\n\nThe Rune of Darkness erupted from his inventory. Grid had been basking in the attention, sharing joy with his companions. Now ice flooded his veins. The rune detonated.\n\nThe shockwave drove Grid to his knees with a strangled gasp.\n\n\"Grid!\"\n\n\"Youngwoo!\"\n\nSehee, Yerim, Jishuka, and Yura paled. They rushed forward as Grid clutched his chest, face twisted in agony. In his inventory, the shattered rune fragments began to liquefy.\n\n\"W-What's happening? This isn't funny! Grid!\" Jishuka's voice cracked.\n\n\"Get it together!\" Yerim shook his shoulder.\n\nMore figures converged—Piaro, Kraugel, the Overgeared members. Different expressions, different intensities, unified concern. Grid barely registered them through the chaos consuming him.\n\n*Thump thump thump thump.*\n\nHis heartbeat thundered in his skull. Cold sweat poured down his face, blurring his vision. Coherent thought slipped away. The Rune of Darkness had shattered completely, melting into pure demonic energy that burrowed into his body. Through his skin. Into his blood. His bones. His heart. The sensation was alien, terrifying.\n\n...Thud.\n\nThud. Thud.\n\nHis explosive heartbeat gradually... steadied.\n\n\"Hah... hah...\" Grid dragged in ragged breaths, consciousness returning by degrees. A new notification materialized before his trembling eyes.\n\n**[Your high demonic power has guided the Rune of Darkness to you.]**\n\n**[The Rune of Darkness, endangered by exceeding its capacity, has merged with you to escape destruction.]**\n\n**[The Rune of Darkness will become part of you going forward.]**\n\n**[Activating the Rune of Darkness will increase your demonic power stat by 200.]**\n\n**[Your demonic power currently exceeds 30,000...]**\n\nDemonic power. The stat Grid had acquired after raiding Hell Gao—along with Noe and the title 'Man who has Touched Hell.' Until now, demonic power had proven beneficial. It allowed him to tame Noe, activate Blackening, and upgrade Blackening's functions.\n\nYet Grid had never trusted it completely. The stat represented an unstable element. Something to guard against rather than embrace. As the name suggested, demonic power fundamentally corrupted humans. Grid suspected that increased demonic power granting free access to hell was simply... demonization in progress.\n\n*This can't go too high.*\n\nEverything else was manageable. Being forcibly transformed into a demon? Suffering mutation? Better to prevent it entirely. That's why Grid had minimized his kill count. During the Eternal War, the clash with the Red Knights, the battle against Kir—he'd slaughtered many in unavoidable circumstances. But he'd always tried to spare human lives. To suppress his demonic power.\n\nNow all that effort had burned away in an instant. The Rune of Darkness would boost his demonic power by 200 on activation. Far too much.\n\nGrid forced his racing thoughts under control.\n\n*It's fine. I don't use that skill often anyway.*\n\nThe Rune of Darkness only emerged when he faced situations or enemies beyond his normal capabilities. Nothing had changed, really.\n\n*Besides... higher demonic power means stronger Blackening.*\n\nHis recent status increases had broken through his top speed limit. He needed precise testing, but during the Berith fight, he'd managed roughly ten basic attacks per second. Blackening—which amplified attack power, magic power, and agility by fifty percent—would benefit enormously from his enhanced baseline. Demonic power wasn't entirely negative.\n\nGrid embraced optimism. At least the Rune of Darkness had survived.\n\n\"I'm... I'm alright.\" He blinked up at the worried faces surrounding him. Sehee and Jishuka looked ready to cry. Yura maintained surface composure, but her clenched fists betrayed her anxiety.\n\n\"Your Majesty!!\" Piaro's wail shattered the tense atmosphere.\n\n\"Really, I'm fine.\" Grid rose, steadying himself, and redirected attention toward the raid rewards. \"Let's see what everyone got.\"\n\nRegular participants had received modest quantities of blessed enhancement stones. Those who'd secured contribution rewards—his companions—had obtained at least one piece of Berith's Mane. The stretched metallic filaments resembled fur superficially, but direct contact revealed their hard, sharp composition.\n\n*Applied as neck armor, it could provide both style and defense.*\n\nPerhaps even reflected damage. A full set of reflective equipment crafted from great demon materials... the potential was staggering. Grid was examining items with his companions when the dukes approached.\n\n\"We'll be departing,\" Grenhal announced. Most of the dukes appeared content as they glanced between Grid and the still-emotional Piaro. Rachel, however, stared at the legendary farmer with an expression Grid couldn't quite parse. Grenhal bowed respectfully on their behalf. \"Overgeared King, we've been in your debt since the historical ruins. We will never forget our journey together.\"\n\n\"You're not returning to the ruins? Don't you need to get back as soon as possible?\"\n\n\"Reporting the great demon subjugation to His Majesty the Emperor takes priority. We'll be discussing the relationship between the empire and the Overgeared Guild seriously.\"\n\n\"I see. Then I look forward to the changing relationship between the empire and the Overgeared Kingdom.\"\n\n\"Yes. Look forward to it.\" Grenhal bowed again, then turned with the other dukes.\n\n\"Wait.\" Rachel approached, distaste flickering across her features. Sunlight caught her blonde hair, burnishing her red dress until she seemed to glow. Her beauty surpassed even Rebecca's Daughters, while her innate dignity rivaled that of Marie Rose herself. She hesitated before speaking. \"Rigal's death occurred during wartime. I won't allow personal feelings to influence how I deal with you. Rest assured.\"\n\n\"...Understood.\"\n\nGrid had heard that Rigal and Rachel were friends. Honestly, he'd feared her resentment. But she was a duke of the Saharan Empire—a powerful figure who understood emotional control. She recognized that misjudgment could create devastating ripples. She distinguished clearly between public and private matters.\n\n*Though technically, Piaro killed Rigal.*\n\nThe thought caused mild discomfort, but Grid chose to accept Rachel's gesture. She turned away.\n\n\"I've heard much about you from my disciple.\" Kirinus approached next, extending his hand. His penetrating gaze assessed Grid with evident interest. \"I'm certain we'll meet again. Next time should prove... entertaining.\"\n\n\"Stay well, Grid.\"\n\n\"Those dragon wings... I trust they'll appear in an even more spectacular scene next time.\"\n\nKirinus, Kraugel, Hao and Mei Xiao, the Russian rankers—they departed one by one.\n\n\"Let's postpone our match,\" Kirinus called back.\n\n\"What match? I won,\" Rachel retorted.\n\nTheir bickering faded as distance separated them. Grid watched until Kirinus, Kraugel, and the dukes vanished from sight.\n\nZibal and Box approached, both wearing somewhat complicated expressions.\n\n\"The raid succeeded largely because of my magic machine, right? You'll admit that? So I'm not particularly grateful or anything.\" Zibal delivered this declaration with exaggerated sulkiness before disappearing.\n\n\"...Thank you. And I apologize. Someday, I'll atone for my mistakes.\" Box bowed deeply, then led the Snake Guild members southward.\n\nOnly the Overgeared members remained. After several quiet minutes...\n\n\"Let's go home,\" Lauel said, smiling.\n\n---\n\nMeanwhile, at the canyon's far end...\n\n\"I've captured footage of a rebellion.\" Fourth Imperial Prince Edan smiled from atop a black magic machine—ominous and wicked, the antithesis of Raiders' pure white exterior. He'd clearly witnessed the dukes bowing to an enemy king instead of executing him. He'd confirmed Piaro's living, breathing presence. He could predict exactly what conversations had transpired.\n\nEdan himself had been instrumental in Piaro's condemnation as a traitor.\n\n\"I must strike first, before they strike my mother.\" Edan's smile widened as he glanced back at his forces. \"Mother must remain present if I'm to become emperor. Isn't that right?\"\n\nHis legion of magic machines bowed their heads, expressions grim with determination."
}