{
  "id": 1056,
  "title": "Chapter 1055",
  "content": "Galest—the empire's largest port—bore fresh scars from the water clan invasion. Though the dukes' swift intervention had minimized casualties, the economic devastation remained evident in every ransacked warehouse and splintered dock. Emperor Juander arrived personally, ostensibly to comfort his people.\n\n\"Long live His Majesty!\"\n\n\"The empire will endure forever!\"\n\nTears streamed down the faces of Galest's citizens as they cheered. Their devotion bordered on religious fervor—the emperor wasn't merely their ruler, but something approaching divine. This worship, cultivated over generations, was the foundation upon which the Saharan dynasty had controlled the continent.\n\nJuander accepted the adulation as his natural due.\n\nInside Galest Castle, once the lord had been dismissed, the emperor's expression soured. \"Why summon me to this backwater?\"\n\nBain, ever vigilant at the emperor's shoulder, fixed his gaze on a shadow pooling behind one of the hall's pillars. A figure emerged—3rd Imperial Prince Benoit.\n\nOnce, Benoit had shown more promise than any of his siblings. But his fascination with \"useless pursuits\" had curdled his father's opinion early. After his mother's death, he'd vanished into aimless wandering. Juander had long since written him off.\n\nYet here he stood, requesting an audience.\n\n\"I greet the great emperor—legitimate master of Saharan, lord of the continent, he who merits eternal life.\" Benoit's bow was deep, a servant's obeisance. Not the greeting of a son reuniting with his father after years apart.\n\nJuander's jaw tightened.\n\n\"The palace has too many eyes and ears,\" Benoit continued. \"Forgive the breach of etiquette, but this meeting required... discretion.\"\n\nGalest was a battlefield. No one would question the emperor's presence here, making it ideal for clandestine conversation. When Benoit saw his father's deepening scowl, he offered a thin smile. \"Besides, doesn't it serve your image? The story of His Majesty personally comforting the people will spread. Citizens throughout the empire will sing your praises.\"\n\n\"Dispense with the sarcasm and state your purpose.\" The emperor's voice could have cut glass. \"Why this secrecy? Have you summoned me here to beg I clean up the mess your great demon is making?\"\n\n\"Berith is already dead. I felt it.\"\n\nThe fundamental cost of summoning a great demon was the summoner's soul. Benoit had mortgaged his own to call forth not one but two archfiends. Recently, that burden had lifted—just as it had when Belial fell.\n\nEvidence that Berith had been destroyed.\n\n\"Whether the demon lives or dies is immaterial.\" Juander rose from his chair. \"If the world learns you're the summoner, the blame won't stop at you. It will stain the entire imperial bloodline. Can you bear that weight?\"\n\n\"Not just me. Your Majesty will share the scrutiny.\"\n\n\"Does the Yatan Church know what you've done?\"\n\n\"They do. As do you.\"\n\nJuander's eyes narrowed. \"If you think to threaten me through your Yatan connections, save your breath. That particular avenue has been... thoroughly sealed. We're done here. I can't stand to look at you any longer.\"\n\n\"One more thing.\"\n\n\"What?\"\n\nThe emperor had begun to rise from the hastily prepared throne—too ornate for the practical military architecture of Galest Castle—when he froze. Something in Benoit's gaze stopped him cold.\n\nResentment. Fury. Both burning with terrible intensity.\n\nBenoit's face twisted. \"Why don't you know the truth about my mother's death?\"\n\nThe emperor's mind reeled. There was nothing in this world beyond his knowledge. His will manifested even in his absence. No one would dare deceive him—this was understood throughout the realm.\n\nBenoit had believed it too.\n\nUntil he'd learned otherwise. Until he'd discovered that the emperor—for all his vaunted omniscience—had failed to see what happened in his own palace. Had never suspected that Marie orchestrated Empress Aria's death. Had even elevated that murderer to fill his beloved's place, lavishing her with affection meant for another.\n\n\"You...\" The emperor's voice shook.\n\n\"You. You!\"\n\nBenoit had rehearsed this moment countless times. He'd prepared every curse, every accusation. But the words caught in his throat. This man was still his father. The only man his mother had ever loved.\n\nHe couldn't let her memory witness him destroying what she'd cherished.\n\nIt was the only filial piety he had left.\n\n\"Your Majesty bears the responsibility of knowing the truth behind Empress Aria's death.\" Benoit forced his voice steady, burying his rage beneath cold formality.\n\nAs Benoit's account unfolded, the emperor's body began to tremble.\n\nWhen the tale ended, Benoit met his father's eyes one final time. \"I resent you. Part of me wanted to make you suffer as Mother suffered. But that would pain her memory more than it would satisfy me.\" His left arm—already beginning to blacken and rot from the price of opening hell's gates—throbbed. \"I'm leaving. I'll watch from a distance as you deal with Empress Marie. Then I'm done with this diseased country.\"\n\nA nation built on discrimination as doctrine.\n\nDrowning in arrogance and self-righteousness.\n\nChoked by conspiracy and danger that could never be fully excised.\n\nEven if Marie hadn't existed, his mother would have been targeted her entire life. She'd died because of what this empire was—what it had always been.\n\nBenoit wanted no part of it anymore.\n\nBesides, he had his own price to pay for summoning the archfiends.\n\n\"Farewell, Your Majesty.\"\n\nPrince Benoit clutched his decaying arm and walked away. The emperor, still reeling, made no move to stop him.\n\n***\n\nDuke Grenhal's villa sprawled across a small mountain on Titan's outskirts. Or it had.\n\nNow the estate resembled a war zone. Dozens of buildings lay collapsed, reduced to rubble by impossible winds. The riding grounds had been scoured down to bedrock. The observation platform that once offered panoramic views of the capital had crumbled into a crater.\n\nAt the center of the devastation stood one man.\n\n\"Cough! Cough!\" Blood flecked Grenhal's lips with each breath. His muscular frame was a tapestry of wounds—old scars earned defending the empire and its people, now joined by fresh injuries. Medals of honor transformed into marks of mockery.\n\n\"How long do you plan this futile resistance?\" 4th Imperial Prince Edan lounged against a towering black war machine, his tone dripping with disdain. \"You should have retreated the moment you saw me. Instead, you dig your own grave. Tsk.\"\n\nEdan had excavated six ancient magic machines from the ruins of the giants' civilization. Only five were operational—controlling these relics required exceptional compatibility, a trait rarer than diamonds. Even the best pilots could only maintain synchronization for thirty seconds at a time.\n\nBut thirty seconds was all they needed to overwhelm the empire's strongest warriors.\n\nFive machines: Trauka, currently dormant. Nevartan, in humanoid form. Raiders, piloted by the deserter Zibal. And two others prowling like mechanical predators around Grenhal's broken form.\n\n\"What did you plan to tell His Majesty?\" Edan asked mockingly.\n\n\"I would have announced Marie's crimes.\" Grenhal didn't flinch as the lion-headed and leopard-shaped machines pressed razor claws against his throat. His gaze remained level, unwavering.\n\nThat composure rankled Edan more than any defiance.\n\n\"Lower your eyes. Unless you'd prefer I pluck them out.\"\n\n\"Kill me if you must. While I draw breath, your mother's sins will see daylight.\"\n\n\"Oh, I can't kill you.\" Edan's smile was poisonous. \"If your accusations become public, my position weakens. But if I murder you?\" He shook his head. \"That makes me a criminal like Mother. Goodbye succession rights.\" He exhaled slowly, visibly restraining himself. \"Patience. Act according to your nature after the coronation. Then you can indulge every impulse...\"\n\n\"Hahahaha!\" Grenhal's laughter was genuine, delighted. \"You actually believe you'll be emperor?\"\n\n\"Who else?\" Edan's amusement vanished. \"Roland is too submissive. Dulandal's impatience makes him incompetent—even his red energy is subpar. As for the third prince... well.\" He waved dismissively. \"Perhaps a princess? Basara? Can she truly occupy the throne?\"\n\n\"Gender is irrelevant.\"\n\n\"There are limits. Look at Mother—stupid enough to leave evidence, which is why we're here now. I never imagined Piaro survived.\" Edan clicked his tongue. \"Women are inherently incompetent.\"\n\n\"Your character is fundamentally broken.\"\n\n\"Is character a prerequisite for emperorship? I think not.\"\n\n\"Your Highness!\" A knight approached and whispered urgently. Edan's grin widened.\n\n\"The Sword Duke has secured Morse and Basara. Rachel remains. But first...\" He gestured, and knights converged on Grenhal. The duke had identified the magic machines' limited operational windows during the battle, focusing on evasion. But exhaustion had its price.\n\nEdan savored the sight of Grenhal being bound. \"Attempting to defeat a magic machine with mere flesh... Raiders must have seemed laughable. Well, it made you easy to capture. Perhaps I should reward the deserter for his service.\"\n\n\"This accomplishes nothing. When His Majesty returns, he'll order our release. The truth will emerge regardless.\"\n\n\"Everyone has contingencies. Don't worry—I'll find uses for you.\" Edan's smile sharpened. \"Oh, but first.\"\n\nPain exploded through Grenhal's skull. Darkness swallowed his vision as Edan's blade punched through both eyes. The duke's scream echoed across the ruined estate.\n\nPrince Edan wiped his sword clean, still smiling. \"I told you to lower your gaze.\""
}