{
  "id": 1058,
  "title": "Chapter 1057",
  "content": "**[Alchemy Research Institute]**\n\n**Facility Level: Advanced Level 2**\n\n***Products Available for Production:***\nIntermediate to Superior Health Recovery Potions. Intermediate to Superior Mana Recovery Potions. Low to Superior Buff Potions. Weapon and Armor Enhancement Stones. Low-Grade Sunglasses. Low to Intermediate Orbs. Adjusted Video Communication. Magic Power Detection Tower. Seven Magic Traps. Telecommunication Earphones, etc.\n\n***Metals Available for Transformation:***\nSteel. Silver. Black Iron. Orichalcum *(performance enhancement guaranteed)*.\n\n***Options Available for Item Attachment:***\nStrength +1 (Small). Agility +1 (Small). Stamina +1 (Small). Intelligence +1 (Small). Movement Speed +1 (Small). Resource Consumption -1 (Minimal). Skill Enhancement (Small). ★Coolness★ ★Added Skill★ ★Added Attribute★\n\n---\n\nThis was Reidan's alchemy facility in its current state. Even at a glance, the capabilities were impressive. Superior-grade recovery and buff potions weren't items boss monsters dropped casually. They commanded prices high enough to earn the moniker 'oligarch's exclusive merchandise', and their performance more than justified the cost. The Overgeared members' dominant showing during the Berith raid could be largely attributed to the potions produced here.\n\nBeyond that, orichalcum ranked among the most valuable metals in existence, and the variety of options that could be attached to items was nothing to scoff at. If news of Reidan's alchemy facility reached the broader market, the social impact would be enormous. Already, countless merchants clamored to deal with the Overgeared Kingdom—the sole power capable of mass-producing high-end goods and attaching options to equipment.\n\n*They have no idea it's all smoke and mirrors.*\n\nEvery facility came with maintenance costs. Miss a payment, and the facility level would degrade, operations would cease. Common wisdom held that military facilities cost the most to maintain—but that wisdom was wrong. The alchemy facility's maintenance requirements dwarfed everything else. Maintaining a single alchemy facility cost more than maintaining thirty advanced barracks, each capable of training and sustaining a thousand soldiers.\n\nAnd that was just the *maintenance* cost. Investment costs soared even higher. Over the past few years, more than half the Overgeared Kingdom's revenue had been funneled into this single facility, and only through that relentless investment had it reached its current level.\n\nBut there was an even bigger problem.\n\n---\n\n**[-Materials Required for Health Potion Production-**\n**3 Lagui. 3 Long Tea Herbs. 2 Red Lotus Flowers. 0.5 Liters of Purified Water. One Glass Bottle.**\n\n**Production Failure Rate: 40%**\n**Intermediate Health Potion: 40%**\n**Advanced Health Potion: 15%**\n**Superior Health Potion: 4%**\n**Ultimate Health Potion: 1%]**\n\n---\n\nEvery alchemical product came with probability tables. Whether producing items, transforming metals, or attaching options, money flowed out in a constant stream with no guarantee of results. Getting what you actually wanted required both money and luck. The option attachment function even had cooldown periods.\n\nThis was why most kingdoms—aside from the Empire—neglected alchemy entirely. This was why Grid despised the alchemy facility with every fiber of his being.\n\n*A money-eating hippopotamus.*\n\nCompared to other buildings, the alchemy facility boasted an exceptionally mysterious and beautiful appearance. Grid arrived at the entrance of this money pit and started cursing reflexively. He still hadn't forgotten the 'Coolness' option that had been attached to Iyarugt.\n\n*Worst value I've ever seen.*\n\nHe'd wanted to shut the facility down countless times. The only reason he hadn't was the potential for magic engineering. That field existed in a realm individual blacksmiths couldn't reach. If Grid wanted to pursue it, he needed alchemy.\n\n\"Your Majesty! We welcome you!\"\n\nThe alchemists rushed out to greet him. Alchemy was disparaged in every other kingdom. For these researchers, the Overgeared Kingdom was one of the few stages where they could prove their worth. They couldn't afford to lose it, so they scrambled to stay in Grid's good graces.\n\n\"Just recently, I succeeded in transforming orichalcum! One piece from one hundred steel ingots!\"\n\n\"One orichalcum isn't worth celebrating.\" Chris, lord of Reidan, answered before Grid could. \"The reports show you invested thirteen thousand steel pieces this month and got *one* orichalcum.\"\n\nChris's blunt assessment reflected Grid's own thoughts, and was meant to preserve the king's dignity. If the king questioned every subordinate himself, wouldn't that diminish his authority? Chris had operated a large guild; he knew how these things worked.\n\n\"I-I'm ashamed. But things will change once we reach Advanced Level 3,\" the facility chief said, head bowed, sweat beading on his forehead.\n\nChris raised his voice. \"Next time will be different, next time. You say that every single time. How much more money do we have to pour into this?\"\n\n\"Enough,\" Grid said, restraining Chris.\n\n*Why is he shouting when it's my money being invested?*\n\nGrid was intelligent, but interpersonal skills still weren't his strong suit. He turned to the chief. \"How long until Advanced Level 3?\"\n\n\"...Up until now, we've accumulated experience with every successful alchemy operation. I could estimate when we'd level up. But this time is different. I can't predict it.\"\n\n\"Why? Is there a different condition for gaining experience?\"\n\n\"That...\" The facility chief wiped away sweat. He couldn't meet Grid's eyes. His demeanor made Grid's stomach sink.\n\n\"Speak.\" Grid's frown deepened.\n\nThe facility chief explained in a trembling voice. \"Ever since the facility reached Advanced Level 2, the system changed. Experience only accumulates when we achieve ultimate-grade results...\"\n\n\"What?\"\n\n\"*What?*\"\n\nGrid looked horrified. Chris's eyes went bloodshot. He stepped forward on Grid's behalf. \"So... what? In the past, even producing low-grade potions gave facility experience. Now you're saying experience only increases with *ultimate-grade* potions? Is that what you're telling us?\"\n\n\"...Yes.\"\n\n\"This is insane!\"\n\nThe cost of producing a single health recovery potion already matched the market price of a superior-grade potion. Wildly inefficient. It would be cheaper to just buy potions directly than manufacture them. Yet the reason all Overgeared members used potions from the facility was precisely to chase those ultimate-grade results and level up the facility. Once you started using an alchemy facility, you were forced to keep feeding it to accumulate experience.\n\nNow even that investment had become meaningless. Only ultimate results would count? This was the definition of throwing money into a bottomless pit.\n\n\"They've lost their minds.\" Grid finally snapped. He forgot the alchemists were watching and spoke his thoughts aloud. The researchers looked like the sky had fallen on them.\n\n\"Your Majesty, please! We're not crazy!\"\n\n\"That's right! We're perfectly sane! We're just explaining the system!\"\n\n\"No, I'm not talking about you.\"\n\nHe meant the S.A. Group. Since most of the alchemists were NPCs, Grid swallowed the rest of his words. His stomach burned. Alchemy! God, *alchemy*! The culprit that had emptied his pockets time and time again, always hitting him from behind, making him see stars!\n\n*Even the CEO of Sasung Group couldn't reach Advanced Level 3 without extraordinary luck.*\n\nGrid was certain of it. Alchemy—its efficiency was abysmal compared to its potential. This wasn't content meant for players. It was pure fantasy, dangled to inspire vague expectations and nothing more.\n\nChris seemed to share the sentiment. \"This isn't something we can rush. If we try to force the level up, we'll bankrupt ourselves. Let's maintain the current operating policy and just use the facility normally. Eventually, it'll level up.\"\n\n\"You want to reach Advanced Master level in twenty to thirty years?\"\n\n\"...\"\n\nIt might not even be possible in twenty or thirty years. The alchemy facility might not reach Advanced Master level until their *children's* generation. Chris felt miserable just thinking about it seriously.\n\n\"Fantasy content... Well, fine. I like it. This is worth it.\"\n\nA wide smile spread across Grid's face. Chris found the reaction absurd—why was Grid so happy?\n\n*Step, step.*\n\nGrid walked forward. He stood before the nucleus at the center of the institute and activated the Rune of Darkness. Black, ominous demonic energy rose around his body.\n\n**[The activation of the Rune of Darkness has increased Demonic Power by 200!]**\n\nGrid ignored the notification and placed his pale hand on the magic power nucleus.\n\n*Thump! Thump!*\n\nThe magic power nucleus of Reidan's alchemy facility—a giant amethyst that pulsed like the heart of a living creature—began reacting to the force within Grid. The smile on his face remained fixed.\n\n\"Grid?\"\n\n\"Chris, have I told you exactly what Berith's Power does?\"\n\nThe 22nd Great Demon Berith's authority—the power to produce any material that existed in the world at will—manifested at Grid's fingertips. Berith's Hoof emerged from his inventory and floated around the magic power nucleus. The Transformation system activated.\n\n\"Wait! Grid!!\" Chris was shocked. Transformation was a system where specific materials were used to either enhance inherent performance or convert them into steel, silver, black iron, or orichalcum. In other words, if the material used exceeded orichalcum in value, the system would likely cause a catastrophic loss. Enhancing Berith's Hoof's performance would fail. The hoof would simply be downgraded to steel, silver, black iron, or orichalcum.\n\n\"Stop!\"\n\nThe gamble was too big. The best metal Berith had dropped would be lost. Chris reached out to stop him.\n\n\"Transformation.\"\n\nToo late. Grid had already activated the system using Berith's Hoof as the material. Simultaneously, brilliant golden light enveloped the entire laboratory and burst through every window. All of Reidan—a city of one million—turned gold.\n\nWhen the light cleared, Chris and the alchemists gasped in unison.\n\n\"Ah...\"\n\nThey saw it. Berith's Hoof radiated a mystical brilliance, completely transformed.\n\n\"This is Berith's Power.\"\n\nGrid placed the hoof back in his inventory and shared part of the Rune of Darkness's information with Chris.\n\n---\n\n**[★Special★**\n**22nd Great Demon Berith's Power.**\n\n**The ultimate falsehood distorts reality.**\n**The ultimate alchemy manipulates all things.**\n\n**-Upon Activating Ultimate Alchemy-**\n**Automatic Transformation and Ultimate Transformation skills become active.]**\n\n---\n\n**[Automatic Transformation]**\n**[Passive Skill]**\n**If targeted by a projectile, a metal shield composed of defensive material will be automatically generated in real time.**\n**Each shield absorbs 10,000 damage.**\n**Duration: One minute.**\n\n---\n\n**[Ultimate Transformation]**\n**[Active Skill]**\n**Guarantees the best possible result when using alchemy.**\n**Charging Time: 10 days after use.**\n\n---\n\n\"I was furious at first.\"\n\nThe preconditions attached to Ultimate Transformation had bothered him. What use was an alchemy skill to a blacksmith?\n\n\"Initially, I thought it was meant to synergize with the Automatic Transformation passive—something to give me temporary defenses.\"\n\nThen Grid had realized he could exploit the alchemy system itself. The solution was simple: use the alchemy facility.\n\n\"But as you just saw, there's a better application.\"\n\nFantasy? That didn't exist in the face of Berith's Power. He had the authority to make fantasy *reality*.\n\n**[The success of Ultimate Transformation has increased the alchemy facility's experience by 1%!]**\n\n\"...!\" Chris saw the lord-only notification appear before him and pumped his fists.\n\n\"*Yes!*\" The alchemists embraced each other and cheered enthusiastically. They believed Grid's very presence was a blessing."
}