{
  "id": 106,
  "title": "Chapter 106",
  "content": "# Chapter 106\n\nI'd set out to scrape together 80,000 gold. Just 80,000. The weapon materialized on my anvil, its stats glowing in my interface, and the number staring back at me wasn't thousands.\n\nMillions.\n\nI staggered back from the forge. My hand found the wall.\n\n*This can't be right.*\n\nAn item made from contaminated materials—materials that should've been worthless garbage—was displaying a **legendary** rating.\n\n*I would've been lucky to get Rare. This has to be a bug.*\n\nThe unreality of it crashed over me. I pinched my forearm hard enough to leave marks. Pain bloomed sharp and immediate across my skin.\n\n\"Not a dream.\"\n\nThe words came out flat. Disbelieving.\n\nTwenty-seven years. That's how long I'd lived under a cloud of the worst luck imaginable. Elementary school field trip? Kidnapped. Middle school graduation trip? Witnessed a hit-and-run. Every athletic meet, every picnic—food poisoning. I'd been beaten up by gangsters and bullies eighty-nine times. *Eighty-nine.* Never once found money on the street, not even a hundred-won coin.\n\nUniversity volunteer work ended with me in the hospital after getting hit by a car. Three million won in medical bills. Then food poisoning from hospital food—except no other patient got sick. They'd accused me of sneaking outside food. No compensation.\n\n*But I only ate what they served me.*\n\nMilitary service was worse. The battalion commander, drunk and stress-crazed, appeared every single time I pulled guard duty. He'd scream himself hoarse at me. Then my replacement got injured three days before my final leave. I worked through the holidays.\n\nThe list went on. The happy moments in my entire life? I could count them on one hand.\n\nOne of them was eating four servings of rib eye by myself when I was thirteen.\n\n*Pathetic.*\n\nBut something had shifted recently. The symbol of bad luck was becoming something else. Something better.\n\nMy throat tightened.\n\n\"Mother's been going to church.\"\n\nWe'd never been religious. None of us. I'd wondered sometimes if my lack of faith was the problem. But lately Mother had started leaving on weekends, visiting both the church and the temple. Praying for her son.\n\n\"Thank you...\"\n\nHeat prickled behind my eyes. The warmth spread through my chest, radiating outward. I wasn't alone. I'd never been alone.\n\nFootsteps approached the smithy entrance.\n\n\"It's time.\" Ibellin appeared in the doorway, slightly out of breath. \"Is Thorn finished?\"\n\nI pulled the flamberge from my inventory and tossed it to him.\n\nHis hands closed around the hilt. He looked down at the stats.\n\nHis face went white.\n\n\"Guh—\" The sound choked off. He bent forward, gasping.\n\n\"Breathe.\" I watched him struggle with air. \"You look like a fish.\"\n\n\"Grid!\" He wheezed, staring at the weapon. \"Are you—are you a *bugged user?*\"\n\nI crossed my arms. \"What kind of nonsense is that?\"\n\n\"B-But...\" His hands twisted together, knuckles white around the sword. \"Blacksmiths can't make legendary items! Only unique at best! Legendary gear only drops from raid bosses—it's impossible unless you're an operator or you're exploiting some—\"\n\n\"Shut up, Ibellin.\"\n\nJishuka's voice cut through his panic. She stepped through the entrance, her gaze sharp.\n\n\"Don't fall apart over something like this.\"\n\nShe crossed the distance between us. Each footfall deliberate.\n\n*Something's different.*\n\nI swallowed. Hard.\n\nShe'd always been beautiful—that wasn't new. But today the air around her felt charged, electric. She stopped close enough that I could smell her perfume.\n\n\"Grid.\"\n\n\"Y-Yes?\"\n\nColor touched her cheeks. Her eyes, dark and bright, fixed on mine. My pulse hammered in my throat.\n\n*Too close. Way too close.*\n\nI held her gaze for exactly one second before breaking eye contact and stepping back. She followed. Her breath ghosted across my face, warm and soft.\n\n\"It's impossible to do this in Satisfy,\" she said quietly, \"unless you have a legendary class.\" Her head tilted. \"Isn't that right, Grid?\"\n\n\"...\"\n\n\"You have one, don't you? A legendary class?\"\n\nNo point in hiding it anymore. The moment I'd decided to craft a legendary item was the moment I'd accepted this would come out.\n\n\"You figured it out.\"\n\nHer eyes went wide. Then she was on me, arms wrapped tight around my ribs.\n\n\"I knew it! Grid, you're amazing!\"\n\n\"Gah—\"\n\nMy soul tried to evacuate my body. Her scent, her warmth—it surrounded me completely. But I kept my head this time.\n\n*She's just happy. This is how she expresses joy.*\n\nHer natural charisma made even innocent enthusiasm look dangerous. She probably dealt with misunderstandings because of it constantly.\n\nI extracted myself from her grip and turned to Ibellin, extending my hand.\n\n\"How much?\"\n\nIbellin, having regained some composure, held up one finger.\n\n\"One million gold.\"\n\nI blinked.\n\n*Did I hear that wrong?*\n\nA legendary item should fetch at least two million. Minimum.\n\n\"Look at the description,\" Ibellin said, his voice taking on a professional edge. \"The 'Blood Owner' restriction. This item is bound to me. Nobody else can equip it. Not without penalties.\" He met my eyes. \"That severely limits the resale value. Even for a legendary rating.\"\n\n\"...\"\n\nThe guileless kid was gone. In his place stood someone who understood market economics. \n\n*So this is why he's a ranker.*\n\nI studied him with new appreciation.\n\n\"The performance is incredible,\" Ibellin continued. \"But the monetary value takes a hit. Honestly, one million is generous. Eventually I'll outlevel this and need to replace it. At that point it becomes worthless—I can't sell it to anyone else. It's a limited-lifespan item with a single-user restriction.\" He straightened his shoulders. \"That said, it's exactly what I need *now*. And I don't want to lowball you. One million is my offer.\"\n\nEverything he said made sense. He wasn't haggling. Just stating facts.\n\nFacts I couldn't accept.\n\nI raised three fingers.\n\n\"Three million. Non-negotiable.\"\n\n\"What? Grid, I just explained—\"\n\nI shook off Jishuka's hand on my shoulder and closed the distance to Ibellin. Then I plucked the Thorn of Deep Grievance from his grip and equipped it.\n\n> [Due to your class characteristics, you have equipped Thorn of Deep Grievance.]  \n> [A penalty is applied because the item conditions aren't met.]\n\n\"What—\"\n\nIbellin's jaw dropped.\n\nI gave the flamberge a few experimental swings. The weight distribution was perfect. Exactly what I'd intended when I forged it.\n\n\"Three million.\" I met Ibellin's horrified stare. \"Buy it at that price, or I keep it and use it myself.\"\n\n\"*You can't do that!*\"\n\n\"Watch me.\"\n\n> [The Thorn of Deep Grievance hates and curses you.]  \n> [You have resisted.]\n\n> [The Thorn of Deep Grievance hates and curses you.]  \n> [You have resisted.]\n\nThe notifications kept flooding my vision. It felt like sitting on a bed of nails. But I kept my expression neutral while Ibellin made strangled noises.\n\n\"Two million...\"\n\n\"No.\"\n\n\"Two million three hundred—\"\n\nI turned toward the door.\n\n\"Two and a half million!\" His voice cracked. \"That's everything I've saved! From L.T.S., from streaming, from *everything!* Please!\"\n\nI paused. Let him sweat for three more seconds.\n\n\"Fine.\" I sighed. \"Since we're guildmates, I'll take the loss.\"\n\n\"Thank you—\"\n\n\"But I need eighty thousand gold. Right now. Deposit.\"\n\n\"I—yes!\" He fumbled with his interface. \"Yes, of course!\"\n\nEnough to cover the Sword of Self-transcendence. I couldn't stomach another loss like that. And as the only person in all of Satisfy who could craft legendary items, I had leverage. Even with guildmates.\n\nEspecially with guildmates.\n\n> [80,000 gold has been acquired.]\n\nTime to buy that car.\n\nI smiled at both of them and logged out.\n\n---\n\nFirst stop: the bank.\n\nI transferred seven hundred million won to Father's account.\n\nHis call came through thirty seconds later.\n\n\"Youngwoo! What is this? Why did you—\"\n\n\"Pay off the debt first,\" I said. \"Use what's left to stabilize the business. You and Mother have been running yourselves ragged without any employees.\"\n\n\"Son...\"\n\n\"Don't get sentimental. You worked hard. This is payment for that work. Fair compensation. That's all.\"\n\n\"*Youngwoo...*\"\n\nMother's voice came through the phone, thick with tears. \"*Our foolish boy has become such a wonderful man! I can't believe it!*\"\n\n\"It's not a dream, Mother. I promise.\"\n\nHer sobs intensified. Father said nothing, but I could picture him—head bowed, shoulders shaking.\n\n*I should have done this sooner.*\n\nThey'd paid for my university education. I'd repaid them by playing games and accumulating debt instead of finding work. Years of disappointment and struggle, all because of me.\n\n*Never again.*\n\n---\n\nThat afternoon, I stood in the dealership lot next to an eight-hundred-million-won sedan.\n\nMother's scolding echoed in my ears the entire drive home. She'd called me immature, wasteful, irresponsible.\n\nIt hurt.\n\nBut her hand on my shoulder had been strong and warm, and somehow that made everything feel right.\n\n---\n\n**Glossary of Common Korean Terms**  \nOG: Glossary Link\n\nCurrent schedule: 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}