{
  "id": 1060,
  "title": "Chapter 1059",
  "content": "# Chapter: The Mad Dog Unleashed\n\nThe Tellius Plains lived up to their name—endless flatland stretching to the horizon without a tree or boulder to break the monotony. Perfect terrain for magicians. With unobstructed sightlines and no cover for their prey, spellcasters ruled this landscape absolutely. Monster herds fell to coordinated magical bombardment before they could close half the distance.\n\n\"This is incredible. Why didn't anyone tell me about this place sooner?\"\n\n\"Because you'd have died before level 320. These silver cavalry develop magic resistance abilities—you need third advancement just to scratch them.\"\n\n\"Good timing, then.\" The speaker grinned as experience notifications scrolled past his vision. \"Keep this pace and we'll crack the top hundred inside a month.\"\n\n\"Definitely possible. Most high rankers threw themselves at Berith and died repeatedly. Their progress has stalled.\"\n\n\"And the Overgeared members got butchered during the war.\"\n\nConventional wisdom dictated balanced party composition—warriors, archers, healers, and mages working in concert to cover each other's weaknesses. But conventional wisdom didn't account for places like the Tellius Plains.\n\nHere, mid-300s monsters spawned in droves. Most possessed minimal magic resistance while boasting exceptional physical defense and health pools. Ordinarily that would make them dangerous opponents, but third advancement magicians had learned percentage-based damage spells that scaled with enemy health. The plains' creatures became fodder.\n\nAnd without terrain features to hide behind, the monsters had no answer to ranged magical assault. This was the power of specialization. \n\nWord spread. High-level magicians flocked to the plains, their numbers swelling daily. Hunting speeds accelerated. Levels climbed at rates that sent shockwaves through the rankings.\n\nThese were halcyon days. The Tellius Plains—formerly part of the now-defunct Rotemon Kingdom—had lost their master to Berith's rampage. The power vacuum drew magicians like moths to flame. *Berith's descent was a blessing in disguise* started as dark humor. It became the magicians' rallying cry.\n\n\"Wait. What's that?\"\n\nThree figures approached across the plains—death knights wreathed in purple auras.\n\n\"Boss monsters? I didn't know this place had a boss.\"\n\n\"Neither did I... but look at that presence. Definitely boss-tier. Probably a long spawn cycle—that's why we haven't seen them before.\"\n\n\"Oh?\"\n\nLong spawn cycles meant powerful bosses. Powerful bosses meant exceptional rewards. The death knights advanced steadily. Magicians scattered across the plains converged on the center, organizing their parties into coordinated formations.\n\n\"Open with ultimate skills the moment they enter range.\"\n\n\"Don't hold back on potions! Pour everything into the alpha strike! Our party's claiming first contribution!\"\n\n\"Focus fire with explosive magic. Death knights are undead—brittle durability.\"\n\nRest breeds complacency. The magicians had grown fat on easy victories. They anticipated another triumph and never questioned their assumptions.\n\n\"—?!\"\n\nMagic erupted across the battlefield. Then an iridescent curtain materialized from nothing, swallowing over a hundred spells without trace. The magicians froze, unable to process what they were seeing.\n\n\"No—\"\n\nThe rainbow shield dissipated. Three death knights stood unharmed. The magicians finally read the nameplates floating above their enemies' heads: Cao. Doom. Amy. Golden names—definitely boss grade. But each bore a prefix that turned blood to ice: *Agnus's Death Knight*.\n\n\"Son of a—\"\n\nOne word surfaced in collective memory: *Mumud*. The legendary lich who wielded rainbow-colored mana. The monster who had nearly killed the Overgeared King.\n\n\"KYAHAHAHAHAHA!\"\n\n\"Agnus!\"\n\nNo twist. No surprise. Just inevitability.\n\nDeath knights crashed into the massed magicians like wolves among sheep. Swords rose and fell. Axes cleaved through robes. Blood sprayed across trampled grass. And above the carnage, Agnus descended through empty air, standing casually on Lich Mumud's shoulders.\n\nThe magicians who still lived trembled.\n\n\"Why?\" one managed to gasp. \"Why us?\"\n\nThis power was overwhelming. Incomprehensible.\n\nThe survivors collapsed under the onslaught, staring up at Agnus with fury and confusion. He met their accusations with a smirk. Said nothing. Simply smiled as the killing continued.\n\n---\n\nPeace lasted three weeks.\n\nThree weeks since Berith fell. Then fear returned with a vengeance.\n\n**『 BREAKING: Agnus Commits Another Massacre! 』**\n\nThe one-man army had awoken. After months of silence following Immortal's collapse, Agnus was painting hunting grounds red. Wherever he appeared, players died. No pattern. No provocation. Just random, senseless violence—a madness that surpassed even his Mad Dog days.\n\n**『 Every time I review the footage, I feel sick. Agnus's brutality has crossed all lines. He's become the worst PK criminal in Satisfy's history. Living proof that monsters shouldn't have power... 』**\n\n**『 An 'Agnus Warning' is now standard among rankers. Hunting grounds across multiple kingdoms sit empty. High ranker progression has ground to a halt... 』**\n\n**『 He needs to answer for these crimes. We must stand against this villain who massacres without reason. 』**\n\n**『 Without reason? From Agnus's perspective, isn't this justified revenge? 』**\n\n**『 How is revenge ever justified? 』**\n\n**『 A month ago, we demanded Agnus sacrifice everything and attacked him when he refused. Put yourself in his position. How would you feel? 』**\n\n**『 So being criticized justifies murder? That's the logic of a psychopath. Don't even try defending his actions. 』**\n\n**『 Before assigning blame, shouldn't we analyze what drove him to this? 』**\n\n**『 He's a psychopath. Why should we try to understand psychopaths? Are YOU a psychopath? 』**\n\n**『 That's slander! 』**\n\nAgnus. Agnus. Agnus. Berith faded from headlines. Now the world fixated on one player. Media outlets spotlighted every massacre. Some condemned him. Others—a small minority—offered cautious defense.\n\nDefending Agnus meant admitting complicity. Acknowledging past mistakes. Most people preferred judging others to examining themselves. Few would champion a mass murderer if it required confronting their own sins.\n\n---\n\n\"Lauel, what's going to happen?\"\n\nJishuka strode into Lauel's office in Reinhardt, carrying a sheet of parchment. She dropped it on his desk—a formal appeal for Agnus's suppression, stamped with the seals of twenty-six prominent guild masters.\n\nThe coalition wanted Overgeared's participation. They'd paid attention when Agnus betrayed Grid during the Berith raid. They assumed Overgeared harbored resentment. That Grid's guild would feel threatened by Agnus running rampant. The coalition was convinced Overgeared would join the hunt.\n\n\"Twenty-six major guilds issued a kill order...\" Jishuka mused. \"That should severely restrict his movements.\"\n\n\"It won't stop him completely. Agnus knows that and acts accordingly.\"\n\n\"He's avoiding NPCs entirely, right?\"\n\n\"Correct. He learned his lesson about criminal penalties. Despite appearances, Agnus isn't berserk. This is calculated revenge.\"\n\n\"Revenge drama...\" Jishuka frowned.\n\nLauel's mind worked. He'd recognized Agnus's intelligence during the Immortal incident—the man was far cleverer than anyone credited. Random killing made no sense. *There's something he's counting on. Maybe he grows stronger with each kill.* The Baal's Contractor class remained an enigma. Enemy of humanity. They couldn't afford to underestimate its potential.\n\nJishuka handed over the letter. \"Just refuse them.\"\n\n\"Refuse?\" Lauel blinked in surprise. Jishuka came from Tzedakah—a guild built on pride and supremacy. Self-respect drove every decision. Given their reputation, he'd expected her to demand participation regardless of consequences. \"You don't want to join?\"\n\n\"Agnus attacked us during the raid, even after we helped him. The whole world saw. If we don't retaliate, people might think we're afraid.\" Lauel studied her expression. \"Will that damage our reputation?\"\n\n\"Grid defeated Berith.\" Jishuka met his eyes steadily. \"Who in this world would believe we fear any player, including Agnus? Anyone making that claim has the intelligence of a monkey.\"\n\n\"...You make a good point.\"\n\n\"I'm not some back-alley gang leader anymore. Tzedakah operates like a municipal authority now. And Overgeared?\" She smiled. \"We've transcended normal standards. We don't answer to mob opinion. Few people would dare tell us what to do.\"\n\n\"...\"\n\n\"You don't want to join this hunt either, do you? Then don't. Simple as that.\"\n\n\"How did you know?\"\n\n\"It's written on your face. We're old friends, Lauel. You think I can't read you?\"\n\nHeat flooded Lauel's cheeks. Wasn't she supposed to prioritize profit over friendship? He'd never expected anyone to show him this kind of trust.\n\n\"You're blushing~\" Jishuka reached over and ruffled his silver hair.\n\nThe gesture reminded him so much of Grid that Lauel couldn't help laughing.\n\n\"Alright, I'll be honest. After observing Agnus's recent activity, I believe his combat power is developing exponentially.\"\n\n\"So you don't want to make an enemy of him?\"\n\n\"Exactly. Personally, I suspect Baal's Contractor may be the strongest class in Satisfy...\"\n\n\"What if Agnus attacks us first, even though we're not hostile?\"\n\n\"Jishuka, as you noted, Agnus isn't berserk. I doubt he'll strike first—unless we publicly announce we're joining the coalition hunt.\"\n\n\"Agreed. I had the same thought.\" Jishuka paused. \"Though his personality might change eventually.\"\n\nThe Overgeared Guild knew about Agnus protecting Irene and Lord during the raid. Jishuka decided maintaining careful neutrality was wiser than making an enemy.\n\nLauel concurred.\n\n\"Then I'll refuse.\" He tossed the appeal into the waste bin.\n\nJishuka watched relief wash over his features. She worried about Lauel shouldering so much responsibility alone.\n\nThis was what comradeship meant. The bonds within Overgeared Guild grew stronger with each passing day."
}