{
  "id": 1063,
  "title": "Chapter 1062",
  "content": "\"This map is incredibly detailed...\"\n\nResh's observation earned nods from Grid and Coke.\n\nSatisfy's world rivaled Earth in scale, filled with meticulously crafted locations. But the Abyss existed on another level entirely. Most areas in Satisfy achieved 99.9% realism—close enough to feel real while maintaining a certain theatrical exaggeration. The Abyss didn't compromise. Every element registered with perfect fidelity: the musty scent of stale air, the rough texture of ancient stone, the precise way water droplets traced paths down cracked walls. The climate shifts felt genuine. The physical laws behaved exactly as they should.\n\nIt was unsettling how real it felt—like stepping across an invisible threshold from the virtual into the tangible. The absence of any background music only amplified the effect.\n\n*Chairman Lim Cheolho really must be an alien,* Grid thought, not for the first time.\n\nThe steady drip of water echoed through the passages. Time had carved the rocks into chaotic formations that jutted from every surface, making progress difficult. The path didn't simply descend—it twisted into a labyrinthine complexity, the ceiling pressing lower with each turn, swallowing the last traces of sunlight.\n\n\"I'm nervous.\" Coke's voice wavered. Beyond the meter of visibility their light elemental provided, darkness consumed everything.\n\nHis anxiety seemed justified.\n\nGrid tried to lighten the mood. \"Didn't you serve? Front-line troops spent every day fighting in tunnels. You get used to it.\"\n\n\"You were on the front lines? I knew you'd been impressive since the army—\"\n\n\"I'm lying.\"\n\nDiscussing military service in-game—only possible because they were all South Korean men. Players from other countries wouldn't naturally drift into such conversations. They'd been through countless dungeons and would stick to dialogue appropriate for gameplay. But here were three Koreans, and old habits died hard.\n\nResh felt an unexpected kinship and joined in. \"Even rear positions deserve respect. I was with the XX division. We stayed vigilant constantly, though we trained less than some rear units.\"\n\n\"Different risks, same service.\"\n\n\"Exactly. We should all take pride in what we did.\"\n\nWere they in a game or reality? The Abyss or boot camp? As the conversation meandered through reserve forces and civil defense, Grid's shoulders trembled slightly. \n\nMost people feared other people more than ghosts. Grid was the opposite. He could handle a fight, no problem. But ghosts? No solution for that. Ever since glimpsing Khan's ancestral spirits, the very thought made his skin crawl. He couldn't show it—his pride wouldn't allow it—but the Abyss had exactly the sort of atmosphere where spectral figures might materialize at any moment.\n\nNeither Coke nor Resh noticed Grid's discomfort. To them, Grid was the strongest player in the world. The majestic Overgeared King. The notion that he might fear anything seemed absurd.\n\n\"Our light stone's performing well.\" Grid forced himself into conversation, trying to banish his unease. The light elemental orbited him steadily, pushing back the darkness.\n\nResh studied the floating entity. \"Most Overgeared members have elementals. Did Great Sage Sticks help with that?\"\n\n\"No. He's powerful, but not enough to supply the entire guild.\"\n\n\"Then you received the World Tree's blessing?\"\n\n\"That's right. You know about elementals?\"\n\nResh's awareness of Sticks made sense—the sage had quite a reputation. But the World Tree's blessing? That should be insider information. Few high rankers would know about it, especially since humans couldn't access the forest. Resh's intelligence network was more extensive than expected.\n\n\"I'm reasonably well-informed,\" Resh said modestly. \"Working in the palace, you overhear things. Superficial knowledge, mostly.\"\n\nGrid nodded in understanding.\n\n\"Um...\" Coke hesitated, clearly sensing an opportunity. \"What's Prince Dulandal like? His character, I mean.\"\n\n\"Selfish. Hot-blooded. Impatient.\" Resh considered his words carefully. \"But he knows how to reward loyalty in those who serve him.\"\n\n\"His level must be extremely high?\"\n\n\"Similar to the dukes.\"\n\n\"That strong?\"\n\n\"Same level doesn't mean equal skill. I've never seen him fight personally, and he doesn't strike me as particularly formidable. The 1st Prince Roland and the 4th Prince Edan, though? They're supposedly unmatched within the empire.\"\n\n\"...!\" Coke's eyes widened.\n\nAt least two imperial princes matched the dukes in power? Born with platinum spoons, raised in comfort—he'd assumed they'd be soft, their personal combat skills neglected. \n\nResh smiled knowingly. \"The princes live in constant competition. The eldest brother especially has rivals for the throne breathing down his neck. His future is... uncertain.\"\n\n\"Why the surprise?\" Grid cut in. \"Important NPCs always have serious firepower. It's natural they'd be strong. The emperor's probably even more terrifying.\"\n\n\"As expected of Grid,\" Coke said automatically.\n\nThen he pressed on. \"What do Dulandal and the imperial family think of the Overgeared Kingdom?\"\n\nThe direct question made Coke's eyes gleam with interest, but—\n\n\"I can't discuss that.\" Resh's tone remained pleasant but firm. \"I'm grateful for your help, and I'm willing to give my best since I'm a Grid fan, but I won't jeopardize my position. Please understand.\"\n\n\"Of course. Naturally. I got carried away and forgot about your situation. I'm sorry.\"\n\n\"No need to apologize.\" Resh smiled.\n\nGrid watched the exchange, his thoughts catching up. *Coke was trying to extract information.*\n\nThe kid's abilities extended beyond combat. His class trait—absorbing monster skills through consumption—had enabled rapid growth under the ten meritorious retainers' training. He was fundamentally a predator. Remarkably strong. And apparently, he had political instincts too.\n\n*Versatile talent.*\n\nPride swelled in Grid's chest. It felt like pulling a top-tier card in a gacha game. Pure joy and satisfaction.\n\n*Ah.*\n\nHe realized his body had stopped trembling. The oppressive atmosphere of the Abyss—where ghosts could manifest at any moment—no longer gnawed at him. This was the power of human connection. Grid patted Coke's shoulder as the younger man fidgeted with embarrassment. \"You're a good kid. Stay sharp—things are about to get serious.\"\n\n\"Right!\"\n\nAs they descended deeper, signs of artificial construction emerged. Old steel bars had been wedged into natural crevices in the stone walls, converting them into crude prisons.\n\n\"Here's where the real Abyss begins.\" Grid drew the Sword Aiming at the Gods, noting the warning windows appearing with increasing frequency. He'd left the Enlightenment Sword sheathed—the narrow passages made the black flames' chain explosions too risky. One wrong move could collapse the tunnel and bury them alive.\n\nAn uncomfortable scraping sound echoed from beyond the elemental's light. Like thick chains dragging across stone.\n\n\"They're coming.\" At Grid's words, Coke shook off his tension and readied his sword and shield. Grid had crafted this battle gear when Coke became Prince Lord's knight. The sword had only reached unique rating, unfortunately, but the shield was legendary. Coke didn't care about ratings—what mattered was that Grid had poured skill and effort into creating them. Both pieces were enhanced to +8. He'd invested every asset he had with the determination to use this equipment for years.\n\n*Truly the Overgeared Guild.* Resh glimpsed the value of Coke's gear and understood the organization's power.\n\nThe Overgeared Guild controlled premium hunting grounds, raided every variety of boss monster, and secured rare production materials. Then Grid—legendary blacksmith—designed and forged items from those resources. The results transcended common sense. The guild's armament approached the ideals of high rankers like Resh himself. No wonder they dominated.\n\n*Still...*\n\nResh stepped in front of Grid. Yes, Grid was stronger, but he was only here to assist. Since this was Resh's quest, he should take point. It was his risk to shoulder.\n\n\"Let me gauge the difficulty first.\"\n\nThe moment Resh spoke, the chain-dragging sound accelerated. Two humanoid figures materialized from the darkness—imperial soldiers labeled 'Polluted Guards.' Monsters, really. Though they wore armor and wielded swords etched with the empire's symbol, they'd long since abandoned humanity. Their skin sloughed away like mucus. Poison dripped from their mouths. The clanking chains came from cracks running around their necks.\n\nResh blocked both guards' swords while simultaneously thrusting under his shield to pierce one's abdomen. Grid watched the fluid motion with appreciation. \"A skill?\"\n\n\"No, basic technique,\" Coke explained. \"The main advantage of shield classes—as long as the incoming damage doesn't exceed the shield's threshold, we can defend and counterattack simultaneously.\"\n\n\"Then why does Vantner only defend?\"\n\n\"Ah... it's extremely difficult. Against stronger opponents, the counterattack success rate plummets.\"\n\n\"Ohu.\"\n\nGrid usually fought alongside Vantner during raids. Boss monsters were generally transcendent beings, which explained Vantner's low success rate with counterattacks.\n\n\"Against same-level monsters, I have maybe a 40% counterattack success rate. That's just me, though.\"\n\n\"What?\"\n\n40% against equal-level opponents? Then what about Resh? Grid lost words. Resh blocked the guards' attacks and counterattacked in the same motion. His success rate looked closer to 70%. Most impressively, the guards clearly outleveled him.\n\n\"His control is abnormal. I'm confident in my skills, but I can't even compare.\"\n\n\"...\"\n\nCoke's abilities were formidable—Grid knew this well. Not as precise as Faker's, but definitely high-level control. If Coke was amazed, then Resh's control skills were exceptional.\n\n\"Control-wise, is he like Faker?\"\n\n\"Better to rank him with Hao, one tier below Faker.\"\n\n\"Hah...\"\n\nSo many masters existed in this world. Grid studied Resh with new respect.\n\n\"Ugh!\" Then Resh's defense faltered as both guards pressed their assault. He lost strength in one arm. His shield dropped, exposing his chest to a vicious strike.\n\n\"Heart of Steel!\" The skill activated instantly. His defense spiked, drastically reducing the incoming damage. That reduced damage transferred to his sword, amplifying his next strike. One guard took the enhanced hit square and screamed. Resh capitalized on the opening.\n\nHe evaded the second guard's lateral attack and added momentum to his shield with a charge skill, smashing the stumbling guard's skull. Attack and defense flowed together. After a brutal exchange, one guard crumbled to ash. Resh stood with 10% health and 15% mana remaining. He broke through the surviving guard's poison spray and seized the initiative.\n\n\"Thanks to Resh, we've seen what they can do. I'll handle this one.\" Coke stepped forward. He didn't neutralize attacks with Resh's finesse. His counterattack success rate was lower. But he moved twice as fast and finished the guard with relative ease.\n\nThe one-on-one engagement helped, but the real difference lay in base stats. When Coke's sword pierced the guard, health drained precipitously. When the guard struck back, Coke barely registered damage. Not solely from superior gear—Coke's collection of monster-derived passive and active skills boosted every stat. The actual level difference between him and Resh was only four levels, but the effective gap was more like twenty or thirty. Just as Grid's crafting bonuses let him overwhelm same-level players, Coke's hunting-gained abilities made him a second Grid.\n\n\"...\" Resh's expression went blank. He'd known Coke had better gear and higher level, but he hadn't expected such a vast difference.\n\n\"Raise your spirits!\" Coke called out to the staring Resh. \"Getting discouraged this early isn't good!\"\n\n\"...?\"\n\nWhat? Resh was still processing when two more guards emerged from the darkness. Then they died immediately. Grid cut them down.\n\nHe flicked blood from his blade, voice flat. \"Only level 380. We're just getting started.\"\n\n\"...Ah.\"\n\nThat's why he needed to stay focused. Understanding belatedly, Resh wiped poison from his shield. His fierce struggle suddenly felt embarrassing, and he didn't know where to look. Grid and Coke watched him with respect and genuine fondness.\n\n*If we train him properly, he'll be formidable...*\n\n*I want to learn his control techniques while we fight together.*\n\n*I want to go home...*\n\nEach harbored different thoughts as the party ventured deeper into the Abyss."
}