{
  "id": 1064,
  "title": "Chapter 1063",
  "content": "\"This is insane...\"\n\nResh's whisper echoed through the Abyss.\n\nTwo hours. They'd been descending for two hours, and with every step deeper into this hellhole, Resh felt something shift inside him. Admiration. Astonishment. A thrill that bordered on terror.\n\nHe'd always known the truth—there were limits. Hard-coded, system-enforced limits that even maxed stats and stacked buffs couldn't overcome. Attack speed capped at six strikes per second. Movement speed maxed at eighteen meters per second. Unless you burned a skill or spell, those numbers were law.\n\nIt had haunted him. No matter how much he trained, how high he climbed, eventually he'd hit that ceiling. The thought had dimmed his fire, turned his ambition hollow. What was the point of reaching the peak if the peak itself was artificial?\n\nBut Grid...\n\nGrid's sword blurred. Nine times in a single second. Not a skill—Resh checked. Grid's mana was stable, no cooldowns cycling. This was pure technique.\n\n\"Transcendent...\"\n\nThe word slipped out, reverent. The frustration that had calcified in Resh's chest cracked. If Grid could shatter those limits, then maybe—\n\n\"Ha! Hahahat!\"\n\nResh's laughter burst free as he carved through another guard. The fog cleared. The weight lifted. Why despair over limits he hadn't even reached yet?\n\nAhead of him, Grid's blade sang. The Overgeared King paused, glancing back with a frown.\n\n'What the hell is wrong with this guy?'\n\nResh was cackling like a madman. Grid's mind immediately went to the worst possibility—had this bastard changed the loot settings somehow?\n\n> [Party Name: Abyss Exploration  \n> Party Leader: Grid  \n> Party Members: Coke, Resh  \n> Item Distribution Method: Party Leader Acquisition]\n\nNormal. Everything looked normal. So why—\n\n\"His skill proficiency's climbing,\" Coke murmured.\n\nGrid blinked. \"...Ah.\"\n\nRight. At level 399, these level 380 guards gave Grid nothing—no experience, no skill growth. But for Coke and Resh, still stuck at 360? The gap between them and the party leader meant character experience was trash, but their skills were spiking with every kill.\n\n\"Good for them,\" Grid muttered.\n\nA strange warmth settled in his chest. Was this how volunteers felt? Maybe serving others wasn't such a bad thing. Once he logged out, he'd send something to those flood victims—\n\n'Wait, when did I start thinking like this?'\n\nThe change had started with that café. That conversation with the employee whose name he'd never learned. People supported him. He owed them. And for once, repaying that debt felt... right.\n\nFlash. Flash.\n\nThe light elemental orbiting Grid's head flared brighter. The darkness was closing in.\n\n\"It's getting narrow.\"\n\nGrid stopped. Ahead, the corridor choked down to a single cramped passage—barely wide enough for one person to squeeze through sideways.\n\n\"Can't even swing a knife in there, let alone a fist,\" Resh observed.\n\nGrid grunted. The tactical problem was obvious. Move through that tunnel, encounter a monster, die because you couldn't fight back.\n\n\"I'll take point.\" Resh stepped forward. \"Shield up, push through. I can tank whatever's in there until we reach the exit.\"\n\n\"You know how long that tunnel is? More than a few minutes of damage and you're done.\"\n\n\"I've got potions. Enough to tank guards for—\"\n\n\"What if it's not guards?\"\n\nResh's jaw tightened. \"Then I'll... hold as long as I can. There's no other way.\"\n\n\"Sure there is.\"\n\nGrid reached into empty air and pulled. When his hand closed, he was holding a staff—the kind magicians used, thick as his forearm. With a casual gesture, he detached the Blade Aiming at the Gods from its handle. The blade hovered, circling him like a predator.\n\n\"Let's go.\"\n\nGrid didn't wait for questions. He stepped into the tunnel first.\n\nFive minutes of shuffling sideways, shoulders scraping stone, breathing the same stale air. The walls seemed to tighten with every step—\n\n\"Stop.\"\n\nGrid's hand came up. Behind him, Coke and Resh froze.\n\n\"...Shit.\" Resh's whisper was barely audible.\n\nThe thing blocking their path radiated menace. Compact body, spine bent at an unnatural angle, limbs folded tight. In this cramped space, that small frame was an advantage, not a weakness.\n\n> [Contaminated Hunchback Guard]\n\nElite. Resh felt sweat bead on his forehead. In this tunnel, Grid was going to get torn apart—\n\nGrid raised the staff.\n\n\"**Magic Missile.**\"\n\n'Oh! That's—'\n\nThe pale bolt splashed harmlessly against the guard's chest. Its health bar didn't even flicker.\n\n'...Wait, that's it?'\n\n\"**Magic Missile. Magic Missile. Alarm. Magic Missile. Magic Missile. Magic Missile. Magic Missile.**\"\n\nThe air filled with light.\n\nGrid chained the spell with mechanical precision, exploiting the zero-cooldown between casts. Every time **Alarm** came off cooldown, he loaded another volley. The tunnel became a shooting gallery. The guard weathered the first dozen hits, then the next dozen. Its health ticked down—slowly, but steadily.\n\nFinally, it snapped.\n\nThe guard's patience broke before its body did. It charged, fangs bared, choosing death in combat over death by attrition.\n\nGrid's expression was bored.\n\nThe ceiling erupted. Stored missiles—dozens of them from **Alarm**—rained down in a cascade of arcane fire. The guard's spine folded further. Its skull smashed into stone. Grid stepped forward, planted his boot on its thrashing back.\n\n\"Difficult? Not really.\"\n\nBehind him, Coke and Resh exchanged glances and swallowed hard.\n\nThe Blade Aiming at the Gods descended. The guard shattered into light.\n\n> [Level 392]\n\nThree percent map completion. But the Abyss was clearly designed for full raid parties—level 380-390 elites, nightmare terrain. This place rivaled the Ruins of the War God in sheer hostility.\n\nGrid encountered three more guards in the tunnel. All died the same way—ground down by **Magic Missile** spam, finished by the floating blade. When his mana dipped, he summoned Overgeared Corn for the stamina recovery.\n\n\"We're through.\"\n\nThe tunnel opened into a vast cylindrical chamber. Resh stepped out and his breath caught.\n\nThe space was enormous. Circular walls stretched up and up, vanishing into darkness. Thousands of cells lined the perimeter. Some held huddled shapes. Others gaped empty.\n\n\"How many prisoners...? I thought this place was sealed decades ago.\"\n\n\"Maybe the old ones are still alive.\"\n\nTheir voices echoed, multiplying into whispers. Grid kicked a rock over the edge. It fell. And fell. No sound of impact.\n\n\"The scale...\"\n\n\"Map jumped from three percent to sixteen,\" Resh said, checking his interface. \"Just from entering this room.\"\n\n\"Prisoner list should be here somewhere.\"\n\nThe quest conditions flashed in Grid's vision—15% map exploration, secure the list. They'd satisfied the first requirement. But Grid's goal went beyond clearing quests.\n\n\"The dukes have to be here.\"\n\nThousands of cells. One narrow walkway spiraling around the chamber's edge—barely a meter wide, with a sheer drop on the inner side.\n\nCoke looked down and went pale. \"Anyone with acrophobia is screwed.\"\n\nGrid ignored him. His eyes moved methodically from cell to cell, searching for familiar faces.\n\n\"Here! Over here!\"\n\nThe voice came from a nearby cell. Grid turned.\n\nAn old man clung to the bars—face half-buried under a wild tangle of hair and beard, limbs short and thick with muscle despite obvious malnourishment. A dwarf.\n\nTheir eyes met.\n\n\"I'm called Ke ong! I don't know who you are, but please—get me out! I'll repay you, I swear it!\"\n\n'Ke ong?' Grid's brow furrowed. That wasn't standard dwarf nomenclature. Ong was an honorific for elders, and nobody called *themselves* that—\n\n\"Dwarves never forget a debt! I swear on my craft, I'll—\"\n\n\"Intruders.\"\n\nThe new voice was cold. Amused.\n\nA cell door opened. The man who emerged was young, human in shape, with thousands of keys jangling from chains around his waist. But his skin was bone-white. His eyes were solid black, no whites at all. His teeth came to points.\n\n\"You made it here under your own power? No sacrifices, no rituals?\" The man—Biplonz—smiled. \"Fascinating. I've never seen intruders reach this depth alive.\"\n\nNot a man. His ears were pointed. A tail curled from the base of his spine. And when he spread his arms—\n\nWings. Leathery, bat-like wings unfurled from his back.\n\nGrid's eyes widened. \"Demonkin?\"\n\n\"Correct.\" Biplonz lifted into the air, wings beating lazily. \"Born here in the rift. Never met another of my kind. Don't even know if I'm pure-blooded. You're my first invaders.\" He clenched both fists. \"Let's see if I'm any good at this.\"\n\nThe ground exploded.\n\nThe walkway—the only path—shattered like glass. Coke and Resh had a half-second to register the collapse before gravity claimed them.\n\n\"Keep your eyes open!\"\n\nGrid's roar cut through their panic. They looked up—\n\nAnd saw Grid diving *with* them, surrounded by a whirlwind of metal plates. The plates spun and orbited, manifesting from nothing. **Automatic Transformation**—the skill that generated shields in response to projectiles. Grid was using the falling rubble as targets, creating platforms in mid-air.\n\n\"Jump!\"\n\nCoke twisted. Resh kicked off empty air and caught the edge of a plate. They landed on the spinning shields, gravity forgotten for a precious second.\n\nThen Grid's back erupted. Dragon wings—sleek, elegant, nothing like Biplonz's crude bat-wings—spread wide.\n\n\"Hiik! D-Draconian!\"\n\nKe's shriek echoed through the chamber.\n\n\"Guard Bip! Kill that evil bastard! Don't let him—\"\n\nGrid assembled the Blade Aiming at the Gods with a thought. The handle and blade snapped together, forming a weapon that gleamed even in the Abyss's dim light.\n\nKe's voice died in his throat.\n\n\"A sword... counted among the ten greatest...\""
}