{
  "id": 1065,
  "title": "Chapter 1064",
  "content": "Grid glanced at the dwarf muttering to himself in the corner.\n\n*Best to let that one be.*\n\nKe's rambling bordered on delusional—whether from age or long imprisonment, Grid couldn't say. Still, one thing the old dwarf said stuck with him: the Sword Aiming at the Gods was merely *one* of the finest blades ever forged. Somewhere in the world, ten weapons surpassed even that.\n\nThe thought intrigued him more than he cared to admit.\n\nHe turned his attention to Coke, who teetered precariously on an iron plate suspended in the darkness. Without a word, Grid pulled Braham's Boots from his inventory and tossed them over.\n\n\"Wear these.\"\n\nCoke caught them, his eyes widening. \"These are—\"\n\nEveryone knew those boots. Grid never fought without them. They were practically his signature. And now he was just... lending them?\n\n\"Don't die.\" Grid's voice carried the weight of stone. \"If you drop these when you fall, I'll haunt you for the rest of your life.\"\n\n\"Yes!\" Coke snapped to attention, jaw tight with determination. \"I'll survive. I promise.\"\n\nHe pulled the boots on without another word, activated Fly, and swooped down to grab Resh. They landed on a stable platform farther back.\n\n\"I'm staying to help Grid,\" Coke said. \"You find that prisoner list and track down the dukes.\"\n\nResh nodded and vanished into the labyrinth of cells.\n\nAlone in the air, Grid faced Biplonz through the suffocating darkness. The demonkin tilted his head.\n\n\"Hrmm? Are you perhaps... my kind?\"\n\n*Can I actually talk to this thing?*\n\nBiplonz had called the Abyss a \"rift\"—said he'd been born here, knew nothing beyond these shadows. The childlike cadence of his speech suggested innocence, or at least simplicity. Grid saw an opening.\n\n\"Why do you think I'm your kind?\"\n\n\"We smell similar.\"\n\n*The demonic power.* That made sense. Demonic power generated demonic energy—the same force that let Grid use Blackening. He pressed forward carefully.\n\n\"If we're the same, will you work with me?\"\n\nSo far, Biplonz registered as an NPC, not a monster. Just like the demonkin farmers Grid had met in hell. The system treated certain demonkin as people, same as water clan, elves, or dwarves. Different from great demons or lesser demonic creatures, which were always hostile mobs.\n\n\"Huh? No.\" Biplonz shook his head. \"I cooperate with humans.\"\n\n\"I *am* human.\"\n\nThe shift was instant—just like Ke's mood swings. The moment Grid admitted his species, Biplonz stiffened.\n\n\"You are human, but you are an intruder. You didn't bring offerings. That makes you an enemy.\"\n\n\"Actually, I'm your kind.\"\n\n\"Then you're *still* the enemy. I've always wanted to fight my own people.\"\n\nGrid pinched the bridge of his nose. \"...\"\n\nNPC or monster, it didn't matter. Satisfy followed its own internal logic, and right now that logic meant combat. He had questions—so many questions—but those would have to wait.\n\nStill, he tried once more.\n\n*\"The seven of us, sealed between the ground and hell...\"*\n\nCorruption's words echoed in his mind. The seventh malignant saint.\n\nAnd Resh's report: *\"The bottom of the Abyss touches another world. A place in contact with hell, infested with demonic energy.\"*\n\nIt clicked all at once. Grid cursed himself for being so slow. When Biplonz called this place a \"rift,\" the pieces snapped together.\n\n\"You called this the rift,\" Grid said. \"Between earth and hell? Why were you born here? Are there others like you? When did you start working with the empire? Do you know anything about the seven malignant saints?\"\n\n\"I don't know.\" Biplonz's answer was guileless. \"I don't know any of that. I was born here. A human gave me food, so I helped him.\"\n\nHe was cooperative enough. Willing to answer. Just... ignorant.\n\n*Damn.*\n\n[**The information of the seven malignant saints and the information of the Abyss that you gathered have joined together!**]\n\nA notification flared to life.\n\n[**The Seventh Evil, 'Corruption', said he was sealed between hell and the ground.**]\n\n[**The enigmatic demonkin 'Biplonz' indirectly revealed that the Abyss is the rift between hell and earth.**]\n\n[**There seems to be a clear link between the Abyss and the seal of the seven malignant saints.**]\n\n[**The hidden linked quest ★ Place to Reach the Answer (1) ★ will proceed!**]\n\n[**Place to Reach the Answer (1)**\n\n★ Hidden Linked Quest ★\n\nDefeat the enigmatic demonkin Biplonz and obtain the 'key' to move to the heart of the Abyss!\n\n**Quest Clear Conditions:** Biplonz's capture.\n\n**Quest Failure Conditions:** Be defeated in battle against Biplonz or allow Biplonz's death.\n\n**Quest Clear Reward:** Place to Reach the Answer (1) linked quest.]\n\nThe rush hit him like lightning.\n\n*Yes.*\n\nAfter the Belial raid, Grid had been... coasting. The grind to the next level felt endless, ordinary hunting gave scraps, and with no raids on the horizon, his routine had grown stale. Even his improved relationship with the empire meant no political intrigue to navigate. He'd been *bored*.\n\nThe only time he'd felt like he was actually *playing a game* was during the occasional kingdom management quest. But now? Now he stood at the threshold of a storyline he'd been locked out of for months.\n\n*Because I was hostile to the empire.* Of course. The seven malignant saints' questline was buried deep in imperial territory. No wonder he'd found no traces these past few months.\n\nHis hands trembled with anticipation.\n\n\"Let's fight.\" Biplonz drifted closer, claws flexing. \"I need to kill the intruder, or I don't eat.\"\n\nHe lunged.\n\nBerith's Power had expired—no more Automatic Transformation. Grid stood fully exposed as those razor claws slashed toward him. But he didn't panic. His agility was high, his status effects stacked, and Alex's Quick Gloves enhanced his reaction time. He met the assault head-on, sword flashing.\n\nOne second. Eleven strikes.\n\nGrid blocked nine of them.\n\nThe other two slipped through his guard like knives through silk. He staggered back, coughing blood.\n\n[**You have suffered 5,900 damage.**]\n\n[**You have suffered 6,130 damage.**]\n\n*What the hell?*\n\nEleven attacks per second, and they punched straight through Valhalla of Infinite Affection. Grid's mind raced. Instead of activating Blackening, he summoned Flash—betting that his light elemental would devastate a demonkin accustomed to darkness.\n\nThe gamble fell flat.\n\nLight flooded the space. Biplonz flinched, blinded for maybe half a second. That was it. No screaming agony like vampires meeting sunlight. Just temporary blindness.\n\nIn that window, Grid struck five times. His expression hardened.\n\n*What is this bastard made of?*\n\nThe Sword Aiming at the Gods—with its 20% divine damage bonus and 50% extra damage against bosses and named NPCs—had dealt a measly 30,000 total damage. Biplonz was a demonkin. Vulnerable to divine attacks. And his name glowed gold, marking him as a named NPC.\n\nSo why did it feel like hitting solid iron?\n\n\"Indeed... humans are strong.\"\n\nBiplonz stared at the blood seeping from the wound on his chest. Not angry. *Curious*.\n\n\"I've never met a weak one since I was born here. Maybe that person was right—that humans will rule the world.\"\n\nGrid frowned. *That person?*\n\n\"Who?\" he asked. \"The imperial princes? The emperor?\"\n\n\"Huh? No, no. Somebody who doesn't die.\"\n\n\"...What?\"\n\nSomebody who doesn't die. Grid's mind spun for a moment—then understanding struck like a hammer.\n\n\"The Grandmaster?\"\n\n\"I don't know his name. He always came alone.\"\n\n\"Does he look impatient all the time?\"\n\n\"Yes, that's right. Is he called Grandmaster?\"\n\n\"...Christ.\"\n\nThere wasn't just one secret buried here. There were layers upon layers. To uncover them all, he needed to capture Biplonz alive.\n\n\"Blackening. Blacksmith's Rage. Quick Movements.\"\n\nBuffs flared. Grid assessed his opponent's strength—equivalent to one of the Seven Dukes, at minimum. Maybe even the strongest of the Five Dukes.\n\n\"Divinity. Item Combination.\"\n\nTime to go all out.\n\nThe Sword Aiming at the Gods merged with the Enlightenment Sword. The battle began in earnest.\n\nBiplonz fought on instinct, weaponless, his movements economical to the point of invisibility. Quick, erratic strikes chained together to maximize his monstrous damage output. And Grid's offense? Devastating. Myth-rated transcendent weapons amplified every blow into something apocalyptic.\n\n\"Link!\"\n\n\"Devouring Curtain!\"\n\nExplosions rippled through the space. The Abyss itself seemed to shudder, on the verge of collapse. Biplonz began layering skills defensively, and the pressure on Grid mounted. With half his health already sacrificed to Blackening, every hit from Biplonz felt like a sledgehammer.\n\n*Should've combined my armor too.*\n\nHe was going to burn through Immortality at this rate. With a grimace, Grid summoned Noe. Randy, Tiramet, and the Overgeared Skeletons couldn't fight in midair—useless here.\n\n\"Nyahahat! It's the best demonic beast of hell—huh?\"\n\nNoe materialized with his usual bravado, rushing forward... then skidding to a halt, fur bristling.\n\n\"S-Scary.\"\n\n\"...What?\"\n\n*Scared?* Noe only feared dragons and great demons. But he was terrified of Biplonz?\n\nGrid didn't have time to process it. He seized the moment of distraction.\n\n\"Transcended Link Flower!\"\n\nNo matter how strong Biplonz was, he was still an NPC, not a monster. His health pool had limits. A four-fusion sword dance might kill him outright—so Grid went with three fusions instead.\n\nArrogant, in hindsight.\n\nBiplonz's claws—harder than steel—shattered one of the energy blades. He surged through the gap, hand closing around Grid's throat. The other blades tore into his arms and chest, flaying them to ribbons, but the grip didn't falter. If Grid were an ordinary human, his neck would've snapped like a twig.\n\nBut he wasn't.\n\n\"...!?\"\n\nBiplonz squeezed harder. Nothing. Grid's neck didn't break. Even with strength matching a duke's, raw force alone couldn't penetrate Grid's defense.\n\n\"Try stopping *this!*\"\n\nNo preparatory motion. No tells.\n\nUnbreakable Justice triggered instantly, shattering Biplonz's posture. At Level 8, the skill dealt 900% of Grid's physical attack power. Combined with his items and buffs, it hit like a meteor.\n\nBiplonz had already taken catastrophic damage breaking through Transcended Link Flower. This was the tipping point.\n\n[**The target has received 159,000 damage.**]\n\n\"Kuek...!\"\n\nBiplonz released Grid and swung wildly with clenched fists.\n\n\"Leap of Trust!\"\n\nCoke rocketed between them, shield raised. The skill from his legendary-rated Luminary Guardian struck Biplonz with wide-area damage while Grid's defense spiked. Grid didn't waste the opening. He channeled his own sword dance—the one that bore his name—and drove Kill into Biplonz's chest.\n\n\"Cough!\"\n\nBiplonz convulsed. Blood sprayed from the wound. For a split second, an unidentified symbol blazed on his forehead—then vanished.\n\nNeither Grid nor Coke saw it. Too fast.\n\nGrid moved on instinct. He whipped out a silver thread and snared Biplonz's plummeting body before it could fall into the abyss below."
}