{
  "id": 1066,
  "title": "Chapter 1065",
  "content": "---\n\nA cascade of system messages flooded Grid's vision: Biplonz captured. The demonkin's relief. His willingness to cooperate. The acquisition of the Magic Key Pack. And then—\n\nHis knees buckled.\n\nThe weight slammed into him like an anvil to the chest. Every movement became sluggish, his stats plummeting as the burden crushed down on his frame.\n\n*What the hell?*\n\nGrid's strength stat pushed close to four thousand—bolstered by countless titles and items that elevated him far beyond normal player limits. After the Berith raid, even the Savior of the World title had evolved. He could hunt for weeks without returning to town, his inventory packed with auxiliary equipment and hundreds of potions.\n\nSo why was one package of keys bringing him to his knees?\n\nGritting his teeth, Grid forced his arm to lift the package higher and examined it.\n\n**[Magic Key Pack]**\n**[Contains 521 keys used throughout the Abyss. Grandmaster Zikfrector has enchanted it with Weight Propagation. Weight: 120% of maximum carrying capacity.]**\n\nAh. There it was.\n\nThe so-called \"shackles\" hadn't been restraining Biplonz physically—they'd been crushing him with magical weight. The grandmaster had never trusted the demonkin. Even Biplonz seemed unfamiliar with his supposed jailer, confirming they were hardly allies.\n\nGrid activated his Castration Eye, focusing on the enchantment.\n\n\"I won't allow your comfort.\"\n\n\"...\"\n\nBiplonz stared at him like he'd lost his mind.\n\nThe enchantment held firm. Of course—the Castration Eye only eliminated *beneficial* effects. This crushing weight was purely harmful. Grid coughed, heat rising to his cheeks, and deflected. \"Interesting setup. The grandmaster doubted you, yet left you as manager? Why trust someone with the keys if you don't trust them at all?\"\n\n\"He didn't.\" Biplonz's voice was steady, factual. \"The emperor from a century ago entrusted me with them. He knew I couldn't leave. To avoid starvation, I had no choice but to guard them faithfully.\"\n\nOver a hundred years. Trapped in this lightless pit with prisoners and keys, slowly starving unless he obeyed. What kind of existence was that?\n\n\"Why can't you leave? Go up a level. Or down.\"\n\n\"The humans above are too strong.\" Biplonz's tone flattened. \"And below... there's a monster.\"\n\n\"What kind of monster?\"\n\n\"A hydra.\"\n\nGrid's breath caught.\n\n*Hydra.*\n\nHe could still hear Iyarugt's voice echoing in his memory: *\"Foolish mortal! Do you have ten lives? Even a hydra couldn't land a blow on me!\"* That had been directed at Jude, back when the sword demon had genuinely been trying to kill him. And Iyarugt—hell's greatest swordsman, a being comparable to a great demon in his prime—considered hydras *beneath* him.\n\n\"I thought hydras lived in hell. Why here?\"\n\n\"I don't know.\" Biplonz shook his head. \"But I know it's impossibly strong. Nine heads. Cut one off, another grows back. The poison melts flesh and bone alike.\"\n\n*Damn it.*\n\nGrid's mind raced. The hidden quest—**★ Place to Reach the Answer (1) ★**—required reaching the heart of the Abyss. That meant fighting through a hydra. With only Coke and Resh as backup.\n\n*Impossible.*\n\nA hydra ranked at least at great demon level. Even at full strength, that would be a brutal fight. But now? He'd already burned through Berith's Power and Blackening. Sure, he had Divinity and Belial's Power in reserve, but against a super-named boss...\n\nAnd Storm Demonic Energy Field was useless here. It required rain clouds—impossible to conjure in this underground prison. Even if he managed it, the field wouldn't do much against a creature of that caliber.\n\nGrid sighed and reached back, peeling Noe off his shoulders where the cat clung like a frightened cicada. \"Why are you so scared?\"\n\nNoe was Memphis—the best demonic beast of hell. Not mere boasting, but objective fact. Right now he might be fat and useless, but one day he'd surpass even hydras. He should only fear dragons and great demons.\n\nSo why was he terrified of a demonkin?\n\nNoe's huge black eyes trembled as he clutched Grid's neck. \"I-I don't know. I'm just... scared.\"\n\n\"Is my face truly that ugly?\" Biplonz asked quietly.\n\nObjectively, he was handsome—pale unblemished skin, fine features, glossy black hair. Even the solid black eyes without whites couldn't diminish that. At least, from a human perspective. Perhaps demonkin standards were different.\n\nGrid saw a reflection of his old self in Biplonz's slumping shoulders. \"Stay strong...\"\n\n\"...Yes. Thank you.\"\n\nUgly enough to frighten a tiny beast. Having never encountered another demonkin, Biplonz absorbed this revelation with quiet devastation.\n\nCoke stared at the three of them, completely lost. *When did they become friends? Weren't they just trying to kill each other?*\n\nHe'd watched the entire sequence and still couldn't track the shift.\n\n*This is Grid's affinity...* Coke's admiration swelled. The man had captured the hearts of imperial dukes and now even a demonkin...\n\n\"Guard Bip! Wake up!\" A voice shrieked from the distance. \"Don't let the evil draconian twist your mind! Stop chatting and beat him already!\"\n\nThe dwarf. Ke. He spotted Grid and his pitch climbed higher. \"You! Draconian gentleman! Let me see your sword! If I can examine it, I'll die happy!\"\n\nCoke grimaced. \"Is he mentally stable? Are all dwarves like this?\"\n\n\"Don't say that.\" Grid felt genuine unease. \"It's not all dwarves—just him. His mind's been locked in this place for decades. Of course he's not fine.\"\n\nThe thought of this representing an entire species chilled him. His plans relied on learning dwarven blacksmithing techniques to strengthen the Overgeared Kingdom. They had to be a *normal* race...\n\nGrid spread his dragon wings and glided to Ke's cell. \"Do you have bad history with draconians?\"\n\n\"No good memories with evil draconians, that's for—huh?\" Ke's voice strangled. His eyes bulged. Trembling, he pointed. \"W-Were you... talking to *me* just now?\"\n\n\"Yes.\"\n\n\"A draconian with no honorifics! Speaking to someone as honorable as me! You're insane! You're a mad dragon!\" Ke scrambled backward. \"Don't look at me! Go away! Get out of my sight!\"\n\n\"...\"\n\nBetter to calm him down. Grid sighed and pulled out the key package, intending to unlock the cell. But with 521 keys, finding the right one...\n\nHe tried them methodically, one after another, frustration mounting. Finally he gave up and drew the Master Key. It slid into the ancient lock with a satisfying click.\n\nKe's eyes blazed like lanterns. \"Is that—is that the universal key Pagma made? Where did you get that? Let me see it!\"\n\n\"...\"\n\n*He was just terrified a second ago.*\n\nGrid studied the dwarf's manic expression, then handed the entire key package to Coke. \"It's too heavy. I can't discard it, so carry it for now.\"\n\n\"Yes!\"\n\nFreed from the burden, Grid returned his attention to Ke. \"Ke ong, I'm King Grid of the Overgeared Kingdom. Human, not draconian. I'm Pagma's Descendant. Let's clear up this misunderstanding and talk.\"\n\n\"Overgeared Kingdom?\" Ke's face went blank. \"King? Human? Pagma's Descendant?\"\n\nHe stared. And stared.\n\nThen he retreated into his cell and pulled the door shut from inside. \"Please... just leave me alone. I can't handle associating with a madman.\"\n\nWhen Ke had been imprisoned, the Overgeared Kingdom hadn't existed. This was the Abyss—only high-ranking members of the Saharan Empire could access it. A foreign king entering here? Nonsense. Humans with dragon wings? Absurd. And claiming to be Pagma's Descendant...\n\nKe huddled in the corner, determined to wait out this delusion.\n\n\"I found them!\" Resh's shout echoed from deeper in the Abyss. \"Grid! I've found the dukes!\"\n\nGrid's heart stopped.\n\nHe downed a speed potion without thinking, his body blurring through the corridors until he materialized beside Resh. And then he saw them.\n\nThree cells. Three dukes.\n\nAll alive.\n\nGrenhal's eye sockets gaped empty and raw. Morse's limbs bent at impossible angles, shattered beyond recognition. Basara stared into nothing, her eyes glazed and distant, broken in a way that transcended the physical.\n\n\"Why...\" Grid's voice emerged strangled. His hands shook. \"Why would someone...?\"\n\nHis vision swam. Rage consumed reason, the world tilting as fury overwhelmed his senses. He swayed—\n\nCoke was already moving, Master Key in hand, wrenching the prison door open.\n\nGrenhal's ruined face turned blindly toward Grid. His voice emerged as a hoarse whisper. \"Run... run away...\"\n\n\"Too late.\" \n\nThe new voice belonged to Biplonz.\n\nGrid whirled. The demonkin had recovered considerably, the silver threads binding him already unraveled.\n\n\"The Sword Duke is coming.\"\n\n**[Your intuition senses danger.]**\n**[You have encountered a strong person of this era!]**\n\nA sword descended toward Grid's skull—not physical steel, but concentrated killing intent reminiscent of Piaro's Pounding Mortar.\n\n\"Ugh!\" Blood sprayed from Grid's mouth as the impact drove him into the steel bars. Three more blades materialized, streaking toward his chest.\n\n\"Grid!\" Coke lunged from where he'd been supporting the dukes, shield raised—but the key package dragged him down to a crawl. \n\nAll three swords converged on Grid's heart.\n\nNoe leaped forward, power gathering for a skill—\n\nBiplonz was faster.\n\nHis claws intercepted the blades, deflecting their trajectories with precise strikes. \"I've repaid your grace.\"\n\n\"I'm so grateful I could cry.\" Grid's smile didn't reach his eyes as metal plates materialized around him, assembling into Sword Aiming at the Gods.\n\nA middle-aged man descended from the shadows above.\n\nThe Sword Duke had arrived."
}