{
  "id": 1067,
  "title": "Chapter 1066",
  "content": "The Saharan Empire stands as the supreme power of the West Continent. Blessed with abundant resources, countless talents, and ever-advancing technology, its might grows with each passing day.\n\nSo read the opening text when creating a new character—the reason most players chose the Empire as their starting nation. And for good reason. Generation after generation, the Empire produced extraordinary warriors befitting its grandeur. Yet by some cosmic irony, those who truly mastered the sword always emerged from beyond its borders. Which was precisely why Piaro's early rise to greatness had sparked such fervent hope within imperial ranks.\n\n\"It's been quite some time. Four years, I believe.\"\n\nSword Duke Limit descended from the ceiling with lethal grace. His gaze was iron, his brows sharp and masculine. Every hair lay precisely in place, his jaw cleanly shaven—details that spoke to a meticulous, disciplined nature. Here was a man who commanded himself as thoroughly as he commanded others.\n\n\"...\"\n\nLimit's arrival doused the flames of Grid's rage. The fury that had consumed him upon seeing the three dukes' condition—that white-hot anger that had burned away all reason—suddenly cooled. The Sword Duke's mere presence demanded it. He stood on par with Rachel herself, one of the Empire's mightiest.\n\nDuring Piaro and Asmophel's era, Limit had existed in their shadows. But those days were long past. While Piaro and Asmophel had wasted years in hiding, Limit had ascended through the imperial hierarchy, serving first the emperor, then the empress. Now he could credibly claim the title of the Empire's strongest, and Grid felt that truth in his bones.\n\n> [Your fighting energy is rising.]\n\n> [Your fighting energy is rising.]\n\nThe Hero King's power stirred in response. The thick crimson aura of fighting energy enveloped Grid's body faster than ever before. Limit came to rest at a higher elevation, looking down at him.\n\n\"Overgeared King Grid. Your name crosses my ears with increasing frequency these days.\" His tone was measured, almost conversational. \"Tell me—why does the king of a foreign nation meddle in imperial affairs? Your kingdom is currently at war with the Empire, yet here you stand, apparently intent on causing harm. How can the ruler of a nation be so frivolous? So unscrupulous?\"\n\nMost imperials reflexively called any foreign power a \"small country.\" But Limit was different. He referred to the Overgeared Kingdom as a \"home country\"—the respectful term reserved for legitimate states. This wasn't a courtesy. It meant Limit didn't underestimate them.\n\nGrid's tension spiked. *Damn. I'd rather have him look down on me than take me seriously.*\n\nHis chest still throbbed despite the healing potions. That opening strike from Limit had dealt a staggering 32,000 damage. Since becoming Overgeared King, only twice before had he suffered such devastating harm from a single attack.\n\n*He's the real deal.*\n\nMorse in beast form possessed strength equal to or slightly exceeding Grid's fully buffed state. Spear Saint Rachel's normal state matched or surpassed Morse's transformed power. Sword Duke Limit stood at least equal to Rachel. Definitely more dangerous than Kyle, who ranked as the weakest of the Five Pillars.\n\n*So what if he wasn't being careful?*\n\nWhat if he'd been careless like Yangban Garam? Garam had been superior in every measurable way, yet that arrogance had created openings. Grid studied Limit's blade intently while waiting for his potion cooldown to expire. Even in the dim light, the sword emanated a pale blue glow. Legendary-rated at minimum, and almost certainly loaded with hidden properties. Grid's regret was immediate.\n\n*Damn Pagma's Eyes and their cooldown.*\n\nPagma's Eyes were the evolved form of the Legendary Blacksmith's Eyes. The original merely displayed item information, but Pagma's Eyes enhanced understanding and enabled copying—vastly superior functionality marred by a crippling one-hour cooldown.\n\n*Can't waste it because of that restriction.*\n\nInformation won battles. Knowing an opponent's equipment could shift the odds dramatically.\n\n*Have to use it at the right moment.*\n\nGrid was evolving as a player. He understood now how crucial advance intelligence was and refused to squander opportunities. Which only deepened his frustration. His rapid thoughts barely reduced the potion cooldown by a single second. He forced his focus back to Limit.\n\n\"I won't claim my goal was to harm the Empire,\" Grid said carefully. \"I came to end this war. Along the way, I discovered the dukes being treated unjustly and moved to help them.\"\n\n\"You wanted to end the war?\" Limit's tone remained mild. \"By killing Sky King Rigal and Drunk Duke Diworth? By slaughtering tens of thousands of imperial soldiers?\"\n\n\"Those were acts of self-defense. Unavoidable. What would you have me do when invaders threaten my territory and harm my people?\"\n\n\"And the fact that these three dukes are imprisoned here is also just punishment. They colluded with you, an enemy king, and betrayed their nation. They're in this position because of you. Your presence here only worsens their situation.\"\n\n\"My discussions with them were meant to improve relations between our nations—to restore peace. I have no intention of harming the Empire!\"\n\n\"How can I believe that? Collusion with an enemy king is itself a crime, regardless of intent.\"\n\nLimit's logic was sound. Of course, it only held if you ignored certain inconvenient truths.\n\n\"Fuck...!\" Grid's patience snapped like a frayed rope. He realized this conversation was going nowhere and the profanity erupted reflexively. \"Enough bullshit! Be honest, you bastard! You're terrified the dukes will tell the emperor what they've learned—that Piaro was innocent!\"\n\n\"...\"\n\n\"Was it you? Did you and Fourth Imperial Prince Edan do this to them?\"\n\nThe strings of reason Grid had so carefully grasped slipped through his fingers again, but Limit remained unshaken. Despite this being perhaps the first time anyone had dared curse him to his face, his response was almost courteous. \"How crass. The higher one's station, the more carefully one should choose one's words. Yet you display no dignity whatsoever. Your common birth shows through.\"\n\n\"Dignity is horseshit! I asked you a question—did you do this to them?\"\n\n\"You have no right to that answer.\"\n\n\"Damn it...!\"\n\nGrid suddenly wished he'd brought Huroi. At least then he'd have someone who could win a verbal battle. His disappointment was sharp, but his mind was already moving to his next option.\n\n*Will it work?*\n\nThis was life or death. Skill alone wouldn't be enough. Time to borrow strength.\n\n\"Knight Summoning!\"\n\nHe triggered the ability immediately, even though he already suspected what would happen.\n\n> [The current quest restricts the number of participants in this area.]\n\n> [Knight Summoning cannot be activated.]\n\nThe system's rejection came as expected.\n\n\"Attempting to call Piaro, were you?\" Limit's waist shifted slightly. \"Unfortunately for you, that won't work. It would have been an excellent opportunity to face him.\" He paused, and when he spoke again there was an edge to his voice. \"I've received intelligence that the knights loyal to the three dukes are gathering in the capital. They're starting to question the official story. Which means I have considerable work ahead of me.\"\n\nHe was busy.\n\n\"I don't intend to waste more time on you.\"\n\nBrilliant particles of light began coalescing along Limit's blade like captured starlight.\n\n\"I will execute you in the name of a duke of Saharan. First, for the crime of murdering imperial nobles and soldiers.\"\n\nFive meters separated them. Yet Limit struck without closing the distance, and luminous sword energy lanced toward Grid.\n\n*A skill?*\n\nThe attack motion was economical—barely a flicker—but those light particles couldn't be a basic attack. The visual effect was understated, yet the threat was unmistakable.\n\n\"Noe, stay back unless you see a clear opening.\" Grid's decision came instantly. He chose evasion over confrontation. Two quick sidesteps carried him clear, and Limit's attack slammed into the iron bars where he'd been standing a heartbeat before.\n\n\"...!\" The sound hit his ears and Grid's eyes widened. Limit was already directly above him.\n\n\"Second, for the crime of subverting imperial nobles in an attempt to overthrow the Empire.\"\n\nLimit's steel boot lashed out at Grid's temple like a striking viper. The blow would have shattered his skull if not for the combined protection of the crown and helmet.\n\n> [You have suffered 6,750 damage.]\n\n\"Third, for illegally infiltrating imperial territory.\"\n\nGrid's condition became critical. His brain rattled inside his skull and his body refused to obey, leaving him helpless as Limit's light particles tore through him. Six strikes per second—each one a complex, devastating technique.\n\n\"Fourth, for harboring Piaro, who stands charged with high treason.\"\n\nLimit's blade carved through Grid's defenses and pierced his heart.\n\n\"The sentence is death.\"\n\nBlood soaked Grid's chest, streaming from the gaps in his Valhalla armor. His body pitched forward. At the same moment, Limit shifted sideways to evade.\n\n\"You think that's enough to kill me?\"\n\nAfter taking the brutal assault, Grid finally struck back. The golden blade that erupted from his hand moved faster than Limit's attacks. The gap in speed compensated for the gap in technique. Limit's serene, untroubled gaze met Grid's bloodshot eyes. Fragments of an orange shield flickered around Grid's battered form—the protection granted by the First King title.\n\n\"Do you believe anyone can be beaten simply by holding a sword? Is that what you've been relying on?\"\n\n\"...\"\n\nLimit's keen perception caught sight of the ring on Grid's hand—one that hadn't been visible before. Red, transparent, radiating the potent aura of a vampire.\n\nAs their blades locked, Grid stepped forward. It was the opening stride of a sword dance fueled by rage and hatred. He pressed against Limit's guard and stepped again. Limit withdrew his blade, light particles gathering once more along its horizontal edge. Grid's sword carried murderous intent in its every movement toward Limit.\n\n\"Kill!\"\n\n\"Cutting Stars.\"\n\nLimit's expression remained calm as steel met steel. He was certain his swordsmanship far exceeded Grid's, that technique would decide this clash. This wasn't arrogance or carelessness. It was a conclusion drawn from several exchanges—what could properly be called insight. But Limit had overlooked something crucial.\n\n\"...!?\"\n\nGrid's sword dance wasn't merely his personal skill. Two legendary martial traditions converged in those movements—knowledge and essence distilled into pure technique. The collision's shockwave sent both combatants flying. Grid crashed into the prison bars and stopped there. Limit hurtled across the vast space before finally arresting his momentum in the center.\n\nFor the first time, emotion cracked Limit's composure. His eyes—always so steady—now wavered. Confusion and frustration warred across his face. Grid felt a surge of satisfaction and raised his hand in challenge.\n\n\"Come on then. Let's go.\"\n\nLimit's teeth ground together as he launched himself forward. He closed the distance in an instant, sword carving a gleaming arc. Coke and Resh emerged from the shadows to strike at his exposed back while Grid was already flowing into his next sword dance. The space itself shuddered under the force of the four-way battle that erupted."
}