{
  "id": 1069,
  "title": "Chapter 1068",
  "content": "**Thump.** A violent pulse sent hot blood surging through cold metal. This sensation—Iyarugt had craved it during his long imprisonment as a wandering soul. The thrill of ending life, the visceral proof of his existence. Destruction had been his only reminder that he still *was*.\n\nBut no longer. As Iyarugt reclaimed fragments of his true body, those sick, miserable days were fading. He no longer needed to kill to feel alive.\n\n—*Move!* The voice echoed from the transparent black-gold blade—Iyarugt, the Sword Demon himself. Grid's expression flickered with surprise at the familiar tone. —*The heart strike failed. He deflected it at the last second.*\n\n\"Iyarugt.\" Grid's voice carried genuine relief. \"I wasn't sure you'd answer.\"\n\n> **[Granting an Ego]**\n>\n> You can bestow consciousness upon a target item.\n>\n> The item will be classified as an ego weapon, gaining astronomical value.\n>\n> Upon mastering the skill **(Fighting Against the Gods) Legendary Blacksmith's Craftsmanship,** the number of egos you can grant is 10.\n>\n> **Current uses available: 9/10**\n\nThe skill's description had always been vague. Combined with its limited uses, Grid had never dared experiment—until the National Competition's virtual arena gave him the opportunity. During the Demon King Subjugation event, he'd implanted Braham's ego into a magic machine, discovering four crucial facts:\n\nFirst: both Grid and the target ego must know each other. Second: the skill only activated if the ego willingly responded to Grid's call. Third: regardless of the ego's current form, it would forcibly inhabit the designated item upon answering. Fourth: if that item was destroyed, the ego would return to its original state.\n\nThe system prioritized the ego's will over the user's. If the target refused Grid's summons, nothing happened.\n\nWhich made Iyarugt's instant response all the more remarkable. The Sword Demon held no loyalty to Grid. Their affinity was mediocre at best. Grid had been maybe fifty-fifty on whether the demonkin would even acknowledge the call, let alone respond immediately. In his desperate situation, the swift answer felt like a miracle.\n\n—*You called so desperately.* The blade's tone shifted, almost... awkward? —*Hmph.*\n\n\"...?\"\n\nThat wasn't Iyarugt's usual cynicism.\n\n\"What, did you miss me?\" Grid couldn't resist the jab.\n\n—*Quiet. Fall back. Now.*\n\n\"...!\" Grid's body reacted before conscious thought completed.\n\nHis concentration, honed to a razor's edge, transmitted Iyarugt's warning directly to his brain. His agility translated that signal into instant motion. A spray of light particles sliced past his nose—another fraction of a second, and his face would've been cleaved open.\n\n\"*Ghk*—*khoff*... Impressive.\"\n\nEvery creature in Satisfy, no matter their rating, had vulnerabilities. Critical points that could be exploited. The same attack could deal vastly different damage depending on placement.\n\n\"It's been... *khoff*... so long... since anyone...! *Khaghh!*\" Blood poured from Limit's mouth and nose as he doubled over coughing. His eyes were crimson and bloodshot, legs trembling violently. With the Sword Duke suffering from severe hemorrhaging, his weakness fully exposed—this was the opening.\n\n—*Press the attack.*\n\nHundreds of lines materialized in Grid's vision, overlaying Limit's form. Most were solid black or fractured—poor options. But two glowed brilliant red, extending to perfect strike points. The *best sword paths* Iyarugt was calculating for him.\n\nLight particles seeped into Limit's wounds as the duke channeled sword energy to heal himself. Grid had no intention of allowing it. Blue petals materialized as he began the opening steps of a sword dance.\n\n\"I won't... die here!\" Limit's bloodshot eyes went wide with defiant fury. \"I refuse to fall... before fulfilling my oath!\"\n\nEveryone carried burdens. Suffering wasn't exclusive to the poor. Limit had been born heir to one of the empire's greatest houses—with that privilege came crushing expectations. He'd been groomed to display exceptional talent, to earn the people's adoration and the emperor's trust. But in his youth, he'd failed spectacularly.\n\nBecause of one man. Piaro. That heavenly genius whose talent had eclipsed Limit's at every turn, who'd monopolized the people's enthusiasm and the emperor's favor. Limit, who should have stood in the spotlight, had been cast into shadow. The humiliation had cut deep.\n\nHis entire life had been defined by those wounds. Unlike Asmophel, who could boldly declare his goal to surpass Piaro, Limit had been too cowardly to even speak the name. So he'd trained. Practiced his swordsmanship with religious fervor, focusing on *technique* rather than the nebulous 'instinct' or 'enlightenment' those two geniuses spoke of.\n\n\"I must... I *must* prove I've surpassed Piaro!\"\n\nHe'd suspected—known, really—that Piaro still lived. Yet Limit had never pursued him, never tried to reclaim the honor he'd lost in his youth. He couldn't die here. Not before breaking free from the shadow of that genius. He would survive, would confront Piaro face-to-face and *win*. The so-called 'genius' the emperor praised gritted his teeth against the agony, forcing his sword energy to accelerate his body's regeneration.\n\n—*Formidable opponent. Stay focused.*\n\n\"Flower.\" Grid's sword dance reached completion, following the optimal path Iyarugt laid out. Blue petals engulfed Limit as Braham's lightning crackled through the air. Grid's goal: brand as many marks on the duke as possible. But Limit refused to yield. He crushed descending petals with explosive strikes while executing evasive footwork, intercepting Grid's blade as it struck like a serpent.\n\nThen Iyarugt predicted Limit's dodge vector. The Sword Demon had endured daily torment serving that lunatic Peak Sword, but the experience had allowed him to break through six times total—recovering over half his original power. He wasn't the same blade that had fallen to Piaro.\n\n\"*Ghk*—?\" Limit's eyes widened in shock. The swordsmanship that had been straightforward and merely fast moments ago had suddenly transformed into something *mystical*. Had this opponent been hiding his true skill? No—Limit's eyes couldn't be deceived. This warrior was *evolving mid-battle*.\n\n'A genius...' For an instant, Limit glimpsed Piaro in Grid. Understanding crystallized—why Grid had accepted Piaro, why Piaro served him. It all made sense.\n\n'They recognized each other. Two geniuses meeting at first sight...'\n\nThe moment Limit's mind wandered—\n\nGrid's blade carved through him again.\n\n> **[The target has received 14,900 damage.]**\n>\n> **[...Black flames detonate!]**\n>\n> **[...Red lightning strikes!]**\n\nPerfect. Fortune favored Grid. Only two successful hits, yet both weapon options had triggered.\n\n'Victory is mine.'\n\nGrid's confidence wasn't arrogance—not with Iyarugt fighting alongside him.\n\n> **[The duration of Immortality has ended.]**\n\n'End this while Item Combination holds.'\n\nGrid downed a potion and raised his sword once more, confirming Elfin Stone's Ring's blood-sucking option had refreshed. Iyarugt displayed three optimal sword paths. Grid chose one and unleashed Transcended Link Flower. New wounds blossomed across Limit's body, crimson spraying in all directions as Grid's health rapidly regenerated—the power of lifesteal.\n\nWith each fresh wound, Iyarugt calculated more paths. As Limit weakened, more openings appeared. The current Sword Duke might as well be dancing in Iyarugt's palm.\n\n\"Die!\" Grid roared, driven by dual motivations. Limit hadn't just led the Empress's faction that had tormented Piaro and Asmophel—he was currently threatening three dukes Grid respected. The Sword Duke would receive no mercy.\n\n\"**Pinnacle Kill!**\"\n\nThe finisher. Hundreds of red lines wrapped around Limit's staggering form as he reeled from critical damage. Iyarugt was telling Grid that any strike would fell him now. Grid gathered momentum, taking a massive step forward—the precursor to Linked Kill Flower Pinnacle. This four-fusion sword dance had made even a yangban flinch. The empire's strongest couldn't possibly withstand it. Grid initiated the storm of sword energy with absolute confidence in victory.\n\n—*Stop! Now!* Iyarugt's warning crackled with urgency. —*It's a trap! No matter how close to death, he's still a master. The nearer to the abyss, the more damage they'll inflict. He can't reveal a true opening.*\n\nExactly as predicted.\n\n\"*Kuku...*\" Facing Grid's descending blade, Limit *laughed*. The light particles that had enveloped him for healing began vibrating violently—a telltale sign of imminent detonation. Cornered at the cliff's edge, the Sword Duke was gambling on mutual destruction.\n\nBut Grid wasn't fool enough to fall for such tactics.\n\n\"Not a chance.\"\n\nA woven cloth materialized before him."
}