{
  "id": 107,
  "title": "Chapter 107",
  "content": "# Chapter 107\n\nThe 13 series released by Company B in the second half of this year was the pinnacle of visual design for a mid-sized sedan. Smooth curves met sleek lines in perfect balance, while the bumper emphasized understated simplicity. It deserved every accolade for blending sport and force into a single package. The low-slung body contrasted beautifully with the high rear end, and the silver muffler served as one of its most striking features.\n\nThe 800 million won vehicle, praised by prominent automotive magazines for its design, was now mine.\n\n\"God... It's beautiful.\"\n\nI stood in front of my house, mesmerized as the delivery driver stepped out. The matte black finish elevated it to another level entirely. *I need to drive this right now.* It was obvious everyone would turn their heads when this masterpiece rolled past.\n\n*I could finally talk to women with confidence. Just roll down the window and say, 'Hey, hop in!'*\n\nThe 13 series was the kind of car any woman would want to ride in. I was confident I could easily succeed at picking someone up.\n\n\"But that's for later. First...\"\n\nI slid into the driver's seat and turned the ignition. The heavy, throaty roar of the engine made my pulse quicken.\n\nThe 13 series engine was actually downsized compared to the 12.8 series. Since the 12.8 was a pure super sedan and the 13 prioritized design over raw power, the reduction was inevitable. But with 580 horsepower, 72kgm of maximum torque, and a 0-100km time of 3.8 seconds, the 13 series still qualified as a monster. It was a super sedan in every way that mattered.\n\n\"Let's go!\"\n\nI prepared to depart in '23'—the name I'd given my car.\n\n*Bwaaaang!*\n\nThe acceleration hit like a hammer. Within four seconds of launching, I'd crossed 100km/h. Despite my mediocre driving skills, the ride was perfectly smooth and comfortable.\n\n\"Amazing! 23, you're incredible!\"\n\nThe situation felt surreal. Only happy laughter emerged. A few months ago, I'd been drowning in debt. Now I owned an 800 million won car. I was living proof that someone could completely reverse their life.\n\n*Thank you, Satisfy.* The virtual reality game that would have been unimaginable in the past had launched in this era and given me this success. I would never stop being grateful.\n\n***\n\nYoung Ladies High School was an all-female institution ranked among the nation's top ten schools. Despite its short history of less than fifty years, numerous graduates had accomplished great things across all walks of life.\n\nThis year, the school's fame had reached its peak, thanks to two students: Shin Sehee and Park Yerim. Both ranked in the top five nationally on mock exams, and their beauty rivaled that of celebrities.\n\nFirst, Park Yerim.\n\nShe was always smiling. Her long eyelashes shaded eyes that seemed perpetually moist, giving her a decadent air. A mole under her left eye and full lower lip combined with soft, pale skin to stir the imagination. She was the textbook definition of a bombshell—a sex appeal that seemed impossible for a high school student.\n\nShe wore her uniform skirt short and left buttons undone to emphasize her figure, ensuring her male peers lost sleep thinking about her. Some adults seriously wondered if they might be pedophiles because of her, leading them to consult psychiatrists.\n\nSehee, by contrast, embodied neatness. She always appeared calm and composed. Her large, round eyes and firmly set lips radiated quiet determination. She was simply beautiful—balanced features, long straight hair, and the ideal image of someone's first love.\n\nIf Satisfy had Yura and Jishuka, South Korean high schools had Shin Sehee and Park Yerim. The presence these two girls commanded was extraordinary. Because of them, the street in front of Young Ladies High School was packed daily.\n\n\"She's coming out! Sehee!\"\n\n\"There's Yerim too!\"\n\nThe front entrance of Young Ladies High School drew crowds that made passersby question whether it was really a girls' school. Male students from neighboring schools gathered every day, but they only cared about two people: Sehee and Yerim.\n\nThey came just to catch a glimpse of their faces. It was a daily spectacle. The Young Ladies High School students had grown accustomed to boys from other schools congregating outside. The only one suffering was Sehee.\n\n\"Revolting.\"\n\nSehee was genuinely frightened. The school employed enough security guards to prevent the boys from becoming a mob, but that was small comfort. She just wanted to attend school normally. Why did she have to endure this when she wasn't even a celebrity?\n\nYerim, however, enjoyed the attention.\n\n\"I wonder if there are any cute guys out there today?\" Yerim glanced around at the excited boys.\n\n\"Don't encourage them. Isn't it exhausting to deal with this every single day?\"\n\nYerim laughed at Sehee's nagging and hugged her waist. \"But isn't it funny? Look at them. Don't they look like monkeys? It's like visiting a zoo.\"\n\n\"We're the ones in cages.\"\n\nTwo girls completely different except for their excellent grades. Yet they'd been friends since middle school. Their contrasting personalities and tastes meant they fit together without conflict.\n\nSehee knew everything about Yerim—her preferences, family history, even intimate details. Not because Sehee pried, but because Yerim wanted to grow closer and shared everything freely.\n\nConversely, Yerim knew little about Sehee. Sehee rarely talked about herself and seemed to have no interests besides studying. Except for one thing: her brother.\n\n*She becomes a completely different person when she talks about him.*\n\nSehee was indifferent to the opposite sex. Unlike her peers, she couldn't name a single idol. What kind of person was Sehee's brother? Yerim's curiosity had grown into an obsession.\n\n\"Sehee, I'm visiting your house today. Okay?\" Her eyes curved as she leaned forward, chest bouncing. It was enough to transcend gender and make anyone stare.\n\nBut Sehee showed no reaction. \"No.\"\n\n\"Why not?\"\n\n\"Because I don't want you to.\"\n\n\"I just want to visit my best friend's house! Grant my wish!\"\n\nYerim whined and complained, but it had no effect.\n\n\"No.\"\n\n\"...\"\n\nA metaphorical cold wind blew between them. Sehee walked forward. Yerim chased after her.\n\nAs both girls approached the front gate, a voice called out from the crowd.\n\n\"Sehee!\"\n\nEmerging from the hundreds of students gathered in front of Young Ladies High School—\n\n\"Huh? Who's that?\"\n\nYerim's perpetual smile vanished. The man standing before them was deeply unpleasant to look at.\n\n*The worst.*\n\nSomeone with a below-average appearance could compensate with style. But this man seemed completely indifferent to his appearance.\n\nHe wore a brown sweater, green sweatpants, white socks, and brown slippers. His hair was parted exactly down the middle in a style that clashed horribly with his angular face. It was the worst combination Yerim had ever seen.\n\n\"I think I'm going to be sick.\"\n\n\"How did he leave his house looking like that?\"\n\nPale-faced schoolgirls backed away from the man.\n\n\"Security to the front gate. We have a suspicious individual.\"\n\nDid he escape from a psychiatric ward? The guards hurriedly radioed for reinforcements.\n\nThe male students erupted with outrage.\n\n\"How dare this dirty trash block Sehee's path!\"\n\n\"What are you waiting for? Get rid of that bastard! Don't let him breathe the same air as Sehee!\"\n\nTen security guards couldn't contain the anger of a hundred male students. The boys broke through the barricade and surged toward the man, their momentum murderous.\n\n\"W-What? What's happening?\"\n\nJust as it seemed the man would be torn apart, Sehee's words shocked everyone.\n\n\"Why is my brother at my school?\"\n\n\"What? Brother?\" Yerim clutched Sehee tightly. \"No, Sehee! You can't be dating that bum! I won't accept it!\"\n\n\"Dating?\"\n\nA beauty like Sehee dating someone like *that*? Everyone stood frozen in confusion.\n\nSehee's face turned red as she shouted at Yerim. \"What do you mean dating?! He's literally my brother! My *family*!\"\n\n\"What...\"\n\nThis was equally shocking. Why was Sehee's brother so... unfortunate-looking? Shouldn't he resemble Sehee? The most shocked person was Yerim.\n\n\"*That's* your brother?\"\n\nSehee always smiled when talking about her brother. Yerim only knew him as a good person from those stories. She'd wanted to meet him for so long. Since Sehee never allowed it, her curiosity had grown until her imagination transformed him into a prince on a white horse.\n\nBut what was this? He wasn't a prince—he was a homeless man!\n\n\"...\"\n\nYerim's disappointment was immeasurable.\n\nGirls jealous of Sehee began whispering among themselves.\n\n\"Did you hear? That's her brother.\"\n\n\"They don't look alike at all. Sehee must have had plastic surgery. I always wondered how she could be that perfect.\"\n\n\"Of course it's surgery. You think someone becomes that beautiful naturally? Same with Yerim and that famous woman, Yura.\"\n\nThe man at the center of the chaos—Sehee's brother and the greatest blacksmith in Satisfy, Shin Youngwoo—pressed a button on the remote control in his hand.\n\n*Bwaaaang!*\n\nThe <span class=\"rarity-legendary\">13 series</span> was equipped with an automatic operating system that sensed the remote control. The car rolled forward and stopped precisely in front of Shin Youngwoo.\n\n\"Whoa!\"\n\nThe 13 series had been a hot topic since launch. Even the most ignorant student recognized it. And this was one of only 199 limited edition models!\n\nAs students and guards gaped in admiration, Shin Youngwoo opened the driver's door and addressed Sehee.\n\n\"Hop in.\"\n\nYerim waved enthusiastically. \"Yes!\"\n\nHer eyes sparkled.\n\n*He's not a prince on a white horse. He's Prince Charming on a black one!*\n\nSehee sighed.\n\n*I'm exhausted.*\n\nThat day, Sehee—known for her beauty and academic excellence—suddenly had a brother who made other girls jealous. She became an unreachable wall to her peers, ensuring a peaceful school life from that point forward.\n\n***\n\nYoungwoo drove through the city with Sehee and Yerim as passengers.\n\n\"Woooo!\"\n\n\"Kyaaah!\"\n\nThe drive was aggressive. Other vehicles gave way whenever the 13 series appeared, allowing them to experience a automotive miracle. Youngwoo and Yerim kept screaming in exhilaration. Even Sehee eventually decided to enjoy the moment.\n\nAfter the drive, Youngwoo asked both of them to help style him properly.\n\nThey cut his hair short in a way that highlighted his angular features, making him appear more masculine. Long bangs softened his face. Since he didn't exercise, a long coat concealed his frame and made him look surprisingly good.\n\n\"You're tall like Sehee, so the long coat makes your proportions look great. Your skin has a darker tone, so this color...\" Yerim adjusted his collar.\n\nYoungwoo smiled with satisfaction as he watched her work. \"I'm happy Sehee has such a pretty and thoughtful friend. I'm relieved. Please take care of her in the future.\"\n\n\"Oh, yes...\" \n\nHis first impression had been the worst possible, but now he seemed completely different. This was Yerim's first experience meeting a successful adult man. She couldn't help blushing.\n\nSehee's complexion darkened.\n\n*This is exactly why I didn't bring her home.*\n\nAs night fell, Youngwoo shopped and ate with two beautiful girls, drawing envious stares from every man they passed.\n\n***\n\nThe next day, Grid connected to Satisfy all morning to craft items. Then he dressed in the clothes Sehee and Yerim had bought him the previous day and climbed into 23.\n\nThirty minutes until the reunion began.\n\nHis first reunion in two years. Youngwoo felt nervous, but more than that, he felt excited.\n\n*I've changed.*\n\nHe wasn't the pathetic person from the past anymore. Shin Youngwoo's confidence had been built through recent events, one success at a time.\n\nHe started the engine and drove toward his destination.\n\n---\n\n**Glossary of Common Korean Terms**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}