{
  "id": 1071,
  "title": "Chapter 1070",
  "content": "# Chapter [Number]\n\n\"Hold on!\"\n\nGrid's boots struck stone as he sprinted through the Abyss's winding passages, his movement speed maxed. Basara hung limp in his arms. Behind him, Grenhal and Morse were being carried by their retainers—both dukes critically wounded, one blind, the other missing limbs. They needed Ruby. Now.\n\nA guard materialized from a side corridor, spear raised.\n\nGrid's blade took the man's head before he could shout. His fourth stats awakening had transformed him into something beyond what these soldiers could handle. The guard crumpled. Grid didn't break stride.\n\n\"That sword!\" Ke's voice echoed off the stone walls as Overgeared Corn galloped beside Grid. \"Magnificent craftsmanship! The balance, the—*ghakk*—\"\n\nSaliva sprayed from the dwarf's mouth with every bounce.\n\nOvergeared Corn's eye twitched. Bad enough carrying a male rider—but one who *drooled*? The unicorn's patience snapped. He surged forward at triple speed.\n\n\"*Hiiiik!* I'm dead! This horny bastard's trying to kill me!\"\n\nKe's face smashed into stalactite after stalactite as Overgeared Corn wove through the narrow passages. Each collision sent stone fragments raining down.\n\n\"A-Aigoo...\" Ke finally went limp, face swollen like a melon, clinging to the unicorn's mane.\n\nOnly then did Overgeared Corn settle into a reasonable pace.\n\nThey burst from the Abyss into daylight.\n\nGrid drew a sharp breath, scanning for threats. Nothing. Just Resh waiting near the entrance with Coke.\n\n\"You suffered,\" Resh said, clasping Grid's shoulder briefly. \"I need to find my senior knight and wrap this quest. Don't wait on my account—get those dukes to safety.\"\n\n\"We couldn't have done it without you.\"\n\n\"You're being generous.\" Resh shook his head. \"Biplonz alone would've ended me. Then Limit showed up? Without you two, I'd still be wandering those tunnels.\" He extended his hand. \"I'm in your debt.\"\n\n\"First debt payment: dinner.\" Coke grinned. \"We're in the same country, after all.\"\n\n\"Several dinners,\" Resh agreed, his expression warming. \"It'd be an honor.\"\n\n\"Fair warning—if Peak Sword finds out you're Korean, he'll roast you alive.\"\n\n\"Haha... I'll endure.\"\n\nGrid studied Resh for a moment. Good player. Humble. Strong. The kind of person you wanted in your guild. But Resh had his own path to walk.\n\n\"We'll see you soon.\" Grid turned, adjusting Basara in his arms. \"Let's move, Coke. If Edan's forces—\"\n\nThe ground trembled.\n\nThen came the *sound*—thousands of hoofbeats merging into rolling thunder. Grid spun. Cavalry crested the horizon, rank upon rank of mounted soldiers stretching to the limits of vision. Not hundreds. Not thousands. *Tens* of thousands.\n\nCoke's face went pale. \"The empire...\"\n\n\"Of course it's the empire.\" Ke pushed himself upright, still clinging to Overgeared Corn. His swollen face twisted into a bitter smile. \"Did you think they'd just let you walk out? The Abyss is inescapable by design—that's why it's called the Abyss.\" He reached for Grid with trembling fingers. \"At least let me see the sword before they drag me back.\"\n\nGrid ignored him. \"Coke. We break through.\"\n\nHis hand moved to summon Noe—\n\n\"Lord Grenhal!\"\n\n\"Lady Basara!\"\n\n\"Morse, you *idiot!*\"\n\nThe cavalry thundered closer. But these weren't imperial soldiers. Grid recognized the banners now—three different sigils, representing three different ducal houses.\n\nThe soldiers dropped from their mounts and fell to their knees, tears streaming.\n\n\"Forgive us—we sensed something wrong, but entering the capital armed—\"\n\n\"We're so sorry!\"\n\n\"The imperial guard is coming! We have to move *now!*\"\n\n\"Morse, you absolute *moron!* I told you to go back to the estate first! Look what happened because you never *listen!*\"\n\nGrid blinked at the woman berating the limbless duke. Bold, for a retainer.\n\nHe set Basara down carefully and straightened. \"I am Overgeared King Grid.\"\n\nAn old warrior in battered armor stepped forward—his name tag gleaming gold. \"I know, Your Majesty. Duke Basara spoke of you after returning from the War God's Ruins. I am Lanford, commander of House Basara's forces.\"\n\nThe other commanders nodded, faces grim with understanding. The situation was obvious enough.\n\n\"You saved our lords,\" Lanford said quietly. \"House Basara will remember.\"\n\n\"House Grenhal will remember!\"\n\n\"House Morse as well!\"\n\nTens of thousands of voices rose in a roar that shook the plains and echoed into the Abyss itself.\n\nGrid raised a hand for silence. \"I helped my friends. That's all.\"\n\n*Though I'd love to say more. Later. When it'll have more impact.*\n\n\"King Grid...\" Grenhal's sightless face turned toward Grid's voice. Despite his ruined eyes, the duke's imagination supplied what he couldn't see—a king of true character, dignified and noble. The kind of ruler men would die for.\n\n\"Ngh...\" Morse bit back a scream as someone jostled his severed limbs. His eyes reddened with pain—and something else. Confusion. *The emperor we served for generations abandoned us. And this man we've known for days saved us.*\n\nBasara continued staring at the sky, mouth slack.\n\n\"We must return to our estates immediately,\" one of the knights urged. \"If the imperial forces catch us here—\"\n\n\"Send word to the Rebecca Church,\" another commander cut in. \"The elders might be able to restore—\"\n\n\"Come to Reinhardt.\"\n\nEvery head turned toward Grid.\n\n\"Your Majesty?\"\n\n\"Reinhardt. My capital.\" Grid let a small smile touch his lips. \"My sister is the Saintess.\"\n\nStunned silence.\n\n\"She can heal them.\"\n\nMore silence.\n\n\"It'll be hard on her, naturally. Very taxing. But she'll do it—for my friends.\" Grid paused for effect. \"Will you trust me?\"\n\n\"Yes!\" The answer burst from Lanford immediately. \"Of course, Your Majesty!\"\n\nWhat choice did they have? And besides—Grid had earned that trust.\n\nCoke sighed internally. *Here we go again. People are going to lose their minds.*\n\nResh and Ke exchanged horrified glances.\n\n*'He just convinced imperial soldiers to commit treason by following him to another kingdom,'* Resh thought.\n\n*'Has the world gone insane?'* Ke wondered. *'That easily swayed? After decades in the Abyss, I don't recognize this empire anymore.'*\n\n***\n\n**Meanwhile...**\n\n\"*Annoying,*\" Prince Edan muttered, his face contorted with fury. \"Why are you meddling in *imperial* business?\"\n\nHe'd been so close. Rachel nearly within reach, all loose ends about to be tied off. Then that black-haired *nobody* appeared—the so-called Sword Saint who couldn't match Piaro's strength—and ruined everything.\n\nKraugel's swordsmanship was irritating. Weak on paper, yet containing some mysterious principle that let him fight above his weight class. He'd known exactly how to disable the magic machines, spreading sword energy like mist to short their systems until they ran out of operational time.\n\nEdan had drawn his blade to finish Rachel personally, confident in a one-on-one match. But Kraugel kept interfering, and the prince found himself pressed despite his advantages.\n\n*'I shouldn't have sent Limit away.'*\n\nJust before arriving here, the Abyss's detection wards had triggered. Edan dispatched his fastest piece—Limit—to handle it. A mistake. Better to have overwhelmed Rachel quickly with superior numbers, *then* dealt with the intruder.\n\n*'Biplonz guards the Abyss. That should've been enough.'*\n\nClearly not.\n\n*'This is falling apart.'*\n\nEdan channeled red energy and struck at Kraugel. The Sword Saint retreated a step, blade still raised.\n\nEdan's decision came quickly. \"I need to deal with the other mess.\"\n\nRachel wasn't important right now. Every second wasted here was a second the situation in the capital spiraled further out of control.\n\nHe sheathed his blade. \"You got lucky. Next time.\"\n\n\"Next time we meet, you'll be a traitor—not a prince.\"\n\n\"Unlikely.\"\n\n*When did it all go wrong? And who the hell is behind this?*\n\nEdan swallowed his rage and departed for the capital. First stop: the Grandmaster.\n\n***\n\nSilence settled over the riverbank.\n\nRachel lowered her spear. \"How did you know to come?\"\n\n\"Master gave me a hint after the Berith raid.\" Kraugel's tone was neutral. \"He sensed strong red energy—imperial blood being spilled. He was worried the dukes might be in danger after witnessing their meeting with Piaro.\"\n\nHence the hidden quest: reach the capital, protect the dukes.\n\nKraugel had saved one. As for the others...\n\n*'Grid probably handled it.'*\n\nThe certainty came from an odd source—Grid's level. It hadn't budged after the Berith raid, which meant he'd been busy with something else. Something dangerous enough to eat the experience gain.\n\n[Hidden Quest ★Support the Dukes★ has been cleared.]\n\n[You have helped one duke escape imperial persecution.]\n\n[Level increased by 1 as a quest reward.]\n\nKraugel checked his status window. Level 499.\n\n*'Soon.'*\n\nHe'd been first to reach level 100—earning the Pioneer title. First to 200. First to 300. Those days were gone now. Grid had stolen his thunder.\n\nAnd yet...\n\nKraugel smiled.\n\nNot bitterness. Not resentment. Just pure, burning *excitement.*\n\nFinally, a real rival."
}