{
  "id": 1072,
  "title": "Chapter 1071",
  "content": "\"...?\"\n\nThe ducal retainers materialized in Reinhardt's palace courtyard, disoriented from the Mass Teleport spell. They'd expected to arrive in the city center—to crowds and fanfare befitting a king's triumphant return. Instead, they found themselves in the quiet privacy of the palace grounds.\n\n*Why forgo such an opportunity?*\n\nEvery ruler—from the empire's emperor down to minor lords—made a spectacle of their movements. Public ceremonies. Gathered crowds. Carefully orchestrated displays of power and benevolence. It was propaganda at its finest, transforming even the most trivial personal errand into a demonstration of sacrifice for the people.\n\nYet Grid had squandered this golden chance. Despite returning with dozens of imperial nobles in tow.\n\n*Our king brought back imperial nobility. Nobles of the empire now owe him their lives. The people should be celebrating in the streets.*\n\nSuch a moment could have cemented Grid's reputation for generations. But he'd simply... walked in through the front door.\n\nWas he politically naive? No—that made no sense. The man had forged a kingdom from nothing. The Overgeared Kingdom existed solely through his will and ability. Whatever else Grid might be, he wasn't ignorant of statecraft.\n\nWhich meant...\n\nThe retainers' eyes widened as realization struck.\n\n*He's protecting us.*\n\nThey'd committed treason by any legal definition. Led armies into imperial territory. Extracted prisoners from the Abyss itself—a dungeon under direct imperial authority. Loyalty to their dukes was no defense when the imperial family itself had ordered the imprisonments.\n\n*If word spreads that we visited the Overgeared Kingdom...*\n\n*The imperial court will claim we conspired with a foreign power.*\n\n*Our lords' positions would become untenable.*\n\n*The Overgeared King understood this. He brought us home in secret.*\n\n*How much do we owe this man?*\n\nGratitude and respect warred in their expressions as they followed Grid deeper into the palace.\n\n***\n\n\"Haah.\"\n\nGrid collapsed into his office chair after showing the dukes to their quarters. The mental strain of managing post-battle politics drained him more than any fight. He dismissed his armor and cloak to his inventory, then offered Lauel a tired smile. \"Thanks for the advice. You were right—publicizing their visit would've caused more problems than it solved.\"\n\n\"I wouldn't be doing my job if I missed something that obvious.\" Lauel's tone was mild. When Grid had first announced he'd be returning with forty thousand imperial cavalrymen and dozens of imperial nobles, Lauel hadn't so much as blinked.\n\nThe propaganda value would have been astronomical. *Imperial dukes visit the Overgeared Kingdom with full military escort.* The rumor mill alone would have neighboring nations reassessing their diplomatic postures.\n\nBut Lauel had seen the larger picture. The empire would brand those dukes as traitors the moment their visit became public knowledge.\n\n*The dukes are more valuable to us with their positions intact. Grid worked hard to build these relationships—we need to preserve them.*\n\nWhere Grid's concern for the dukes was genuine and personal, Lauel viewed them as strategic assets. Grid knew this, of course. He'd never begrudge Lauel for playing his role.\n\n\"So.\" Grid's expression shifted to one of concern. \"When will Sehee arrive?\"\n\n\"The Overgeared Shadows are escorting her now. Two hours, give or take.\"\n\n\"The Saintess class is absolutely broken. I still can't believe she's hunting at Galgunos Temple already.\"\n\n\"The class helps, but your sister's no slouch. I've been analyzing her play patterns—she's efficient as hell. Both Ruby and Sexy Schoolgirl have genuine talent.\"\n\n\"Really?\" Grid's voice carried a note of self-deprecation. \"She definitely didn't inherit that from me...\"\n\nSehee was everything Grid wasn't. Smart. Personable. Beautiful. Sometimes he wondered if they were actually related, given how different they were. But that difference was a comfort. How many times had he been grateful she hadn't turned out like him?\n\n\"She looks exactly like you when she's pissed, though.\"\n\n\"Huh?\"\n\n\"The eyes. The mouth. Even the way you both start cursing.\" Lauel's expression was perfectly deadpan. \"It's uncanny.\"\n\n\"I'm... not sure how to feel about that.\" Grid shook his head, then sobered. \"Can Ruby actually fix them?\"\n\nThe question came out heavier than he'd intended. Grid genuinely cared about the dukes' fate. They'd only known each other briefly, but shared hardship forged bonds quickly. The state he'd found them in still haunted him.\n\n\"Grenhal's eyes are gone. Morse's tendons are shredded. And Basara...\" He couldn't finish. Duke Basara had been reduced to a drooling husk, her brilliant mind shattered beyond recognition. \"Saintesses perform miracles, sure, but can even Ruby heal injuries like that?\"\n\nHe'd promised the dukes that the Saintess could restore them. But if he was being honest, that promise had been as much about convincing himself as it was about giving them hope.\n\nLauel met his gaze steadily. \"The Saintess class rivals the authority of the Goddess of Light herself.\"\n\nThe Saintess class came with brutal restrictions—dozens of mandatory good deeds daily. Lauel had heard reports of Ruby healing hundreds of people with permanent disabilities. Her divine power had destroyed the very soul of a great demon. And according to the system itself, that power wasn't borrowed from Rebecca—it was *hers*.\n\n\"Ruby's power is real. Have faith.\"\n\nPrivately, Lauel suspected that one day, someone would dethrone the current goddess of light. When that happened, a new goddess would rise from the ashes. And given everything he'd observed, Ruby was a strong candidate for that ascension.\n\nThe Saintess class wasn't just special—it was potentially *mythic*. Its very existence shaped the world's fundamental narrative.\n\n***\n\nOutside the ducal chambers, voices rose and fell in heated debate.\n\n\"The empress is behind this. Has to be.\"\n\n\"Obviously. Prince Edan's ambitious, but not *insane*. He wouldn't torture founding dukes without backing from someone untouchable.\"\n\n\"Maybe His Majesty is using this as an excuse to consolidate power? Eliminate the dukes, strengthen the imperial family's direct authority...\"\n\n\"That's ridiculous. The emperor's smarter than that. Attacking the founder families would trigger a noble revolt. He's been distracted since the empress died, but he's not *stupid*.\"\n\n\"Which brings us back to the empress. Or—gods forbid—what if Prince Edan has already moved against His Majesty?\"\n\n\"How? The emperor's strength is absolute. The Five Pillars protect him.\"\n\n\"Unless the Pillars have turned. Think about it—if the Grandmaster sided with Edan...\"\n\nThe retainers kept their voices low, but Duke Morse caught every word. His enhanced senses picked out each syllable through the closed door.\n\n\"Keh.\" A bitter laugh escaped him. \"None of them realize. Edan doesn't need a reason. The bastard's just *insane*.\"\n\nTheir theories were all wrong. Too rational. Too structured. They were trying to apply logic to a madman.\n\n\"...Shit.\"\n\nMorse stared at his hands. Or tried to. His fingers refused to respond. No matter how hard he focused, how desperately he willed them to move—nothing. Prince Edan had been thorough. Every tendon severed.\n\n\"...Hah.\"\n\nBetter to laugh than scream. How could he have imagined ending up like this? Duke Morse, rendered completely helpless. Unable to feed himself. Unable to walk.\n\n\"Shit... shit...\"\n\nThe worst part? He'd seen it coming. During the Berith raid, he'd identified the magic machines' weaknesses. He'd *known* they were vulnerable to ambush tactics. But when the moment came, when those machines had surrounded him in the Abyss...\n\nHe'd hesitated.\n\nCenturies of genetic conditioning. Generations of dukes serving the imperial family. That ingrained instinct to submit to imperial authority had frozen him at the critical moment.\n\n\"Dammit!\"\n\nMorse slammed the back of his head against his pillow. The only part of his body he could still move was his neck. He'd heard rumors about the Saintess's miracles, sure. But divine power—even at its highest levels—couldn't regenerate destroyed tendons. That was a permanent disability.\n\nMaybe it would be better to just die.\n\nWhile Morse raged, Duke Grenhal lay silent on the opposite bed.\n\nHis thoughts were darker. Less angry. More... ashamed.\n\n*All those years of loyal service. For what?*\n\nIf he'd truly been loyal, he would have corrected the imperial family's course when it began to deviate. A real loyalist would have protected Piaro from political persecution. Instead, he'd stood by and watched it happen.\n\n*Incompetent from the start.*\n\nThe wounds on his body weren't badges of honor. They were marks of failure.\n\n\"Shit! SHIT! *GYAAAAH!*\"\n\n\"...\"\n\nMorse's screaming intensified. Grenhal's expression grew more haunted by the second. For both of them, this existence was hell. Broken bodies. Broken futures. Nothing but despair stretching ahead—\n\n\"Purification.\"\n\nLight flooded the room. Warm and gentle, like sunlight through morning mist. The terrible tangle of emotions—rage, pain, resentment, futility—simply... *dissolved*.\n\nMorse's ragged breathing steadied. His eyes widened as he turned his head.\n\n\"Hello!\"\n\nA beautiful girl with black hair beamed at him, staff in hand.\n\n\"...Ah.\"\n\nIn that moment, Duke Morse glimpsed something transcendent. A halo of pure light surrounding the girl. The darkness that had gripped his soul melted away like frost under dawn's first rays.\n\nThen—\n\n*THWACK!*\n\n\"—?!\"\n\nThe girl's staff came down on his legs like she was beating a training dummy.\n\n\"S-Saintess?!\" The retainers outside burst into the room, frozen in shock.\n\n\"Hngh! Ugh! *Uhhit!*\"\n\nWith each involuntary grunt, Morse felt *sensation* return. His fingers twitched. Actually *twitched*. Not an illusion—everyone saw it. The retainers sucked in a collective breath.\n\nMeanwhile, Grenhal's retainers were having different concerns.\n\n*Oh gods.*\n\n*Is she going to hit the duke's eyes next?*\n\n*His EYES?!*\n\nWhy did it have to be the eyes...\n\nTheir hatred for Prince Edan somehow grew even stronger. Several retainers openly wept.\n\nAnd Duke Grenhal, his superhuman senses painting a vivid picture despite his blindness, began to tremble.\n\n\"...\" \n\n*She's going to hit my eyes. She's definitely going to hit my eyes. With that staff.*\n\nHe started snoring. Loudly. Deliberately. If he pretended to be asleep, maybe she'd move on to someone else—\n\nA finger poked his cheek.\n\n\"This uncle's cute.\"\n\n\"...\""
}