{
  "id": 1074,
  "title": "Chapter 1073",
  "content": "# Chapter Rewrite\n\nPrince Edan had seized Dukes Grenhal, Morse, and Basara, imprisoning them in the Abyss—a fate reserved for the empire's worst traitors. When the dukes' armies marched on the capital demanding answers, they vanished the moment they reached the city gates. Whispers spread through Titan: the Tower of Eternity had detected massive spatial magic at work.\n\nEmperor Juander dismounted in the imperial courtyard, dust still clinging to his boots from the road. An aide rushed forward, and the report he delivered made Juander's jaw tighten.\n\n\"Release the dukes immediately,\" the emperor said, his voice cutting through the courtyard's nervous chatter. \"My son is a traitor.\"\n\nNo long speeches. No justifications. The moment those words left his lips, Edan ceased to be a prince. Thousands of soldiers mobilized across Titan like a kicked anthill. They stormed Edan's palace, seizing property, confiscating weapons, and taking control of his magic machines—or trying to. The four operational units had already fled.\n\nMeanwhile, at Empress Marie's palace, a very different scene was unfolding.\n\n\"Move aside!\" Marie's voice cracked as she shoved against the armored knight blocking her path. \"I am the empress! The mother of your future emperor! How *dare* you bar my way?\"\n\n\"A traitor will become emperor?\" The knight's tone was flat, almost bored. \"Watch your words, Your Majesty. The prince committed treason.\"\n\n\"A mere guardsman dares—\"\n\n\"The empress is clearly distraught. Escort her inside.\"\n\nTwo knights stepped forward. Marie thrashed against their grip, but they moved with mechanical efficiency, neither flinching at her screams nor acknowledging her rank. These were *imperial* knights, sworn to the emperor alone. The rest didn't matter—not station, not blood, not even the woman who might have ordered Empress Aria's murder.\n\nNot that they knew about that. Not yet.\n\n---\n\nChensler, the empire's Armored Cavalryman and the only Five Pillar sworn to the imperial knighthood, worked with ruthless precision. He was already moving pieces across the board while others were still processing the news.\n\n\"Marquis Aileen?\" an aide asked.\n\n\"Fled the city the moment Edan was declared traitor.\" Chensler didn't look up from the map. \"I've sent five thousand men after him. Dispatch another ten thousand. Contact every general with jurisdiction over his territory.\"\n\n\"Sir.\"\n\nChensler's strategy was simple: crush Edan's faction before it could regroup. That meant rooting out every noble who'd backed the prince, every merchant who'd profited from the connection, every—\n\n\"The Red Knights?\"\n\nThe aide hesitated. \"Sword Duke Limit's whereabouts are unknown, sir. The rest are confined to barracks. I've sent word to the Neo Red Knights to... handle them.\"\n\n\"Good.\"\n\nIt was a grim calculus. The Red Knights were superb warriors, loyal to the empire in their own way. But Limit had led them, and Limit was part of the empress's web. Better to eliminate a potential problem than risk it festering. Besides, the Neo Red Knights—trained by Grandmaster Zikfrector himself—would make short work of them.\n\n\"Did Limit escape with Edan?\"\n\nThat was the real question. Marie and Edan were the visible traitors, but Limit was the blade in the dark. And those magic machines—the empire needed them back.\n\n\"Double-time,\" Chensler ordered. \"I want answers within the hour.\"\n\n---\n\nBain moved through the Abyss like smoke through a keyhole.\n\nThe emperor's shadow. One of the Five Pillars. The man who'd probably slit the throat of half the court if Juander asked politely. He'd come to release the dukes, only to find their cells empty and the air *wrong*. Thin trails of sword energy hung in the darkness like frozen lightning.\n\nLimit's sword energy.\n\n\"The Sword Duke is dead?\" Bain asked.\n\nBiplonz—the Abyss's chief warden, a demonkin whose species even Bain couldn't identify—nodded from the shadows. \"Tried to stop an intruder from taking the dukes. Didn't end well for him.\"\n\nBain considered this. The Five Pillars were the only ones in the empire capable of killing Limit. Kyle and Chensler followed orders like trained hounds; they wouldn't act without the emperor's word. Goldhit was locked in his tower, obsessed with some magical theorem. Zikfrector didn't dirty his hands with \"trivial matters.\"\n\n\"An outsider, then.\"\n\n\"Good guess.\"\n\nBain's mind raced through the list of continental powerhouses. \"The Spear Saint. The Undefeated King's heir. The Mountain King of Grenier. The Specter. Mercedes...\" He ticked off thirteen names, pausing at the last one. \"The Overgeared King.\"\n\nGrid had made the list. In Satisfy's current hierarchy of power, that meant something.\n\nBiplonz shrugged, the gesture barely visible in the gloom. \"He didn't exactly leave a calling card. I tried to fight him for the keys and got put down in under a minute. Limit was already dead when I woke up.\"\n\n\"You talk too much for a liar.\"\n\nBain's gaze swept the darkness, pinpointing fourteen locations with unnerving precision. Surveillance spells. The grandmaster's work, woven so subtly most mages would walk past them a hundred times without noticing.\n\n*Smelly bastard,* Bain thought. He'd distrusted Zikfrector from their first meeting, something about the man's scent setting off every instinct Bain had. But as long as the grandmaster served the emperor's interests, Bain would tolerate him.\n\nAnd if Zikfrector's true colors ever showed?\n\nWell. That's what shadows were for.\n\nBain vanished, the movement so fast Biplonz only registered his absence a heartbeat later.\n\n\"Can't even see it,\" Biplonz muttered to the empty tunnel. \"Humans are terrifying...\"\n\nSomewhere in Titan's winding streets, Bain spoke two words to empty air: \"Find them.\"\n\nEclipse began to move.\n\n---\n\nBain was halfway to the palace to report when two familiar figures appeared at the imperial gates.\n\nGrenhal and Morse.\n\nAlive. Whole. Healed.\n\nEmperor Juander rose from his throne, relief and confusion warring on his face. He stepped down to greet them personally—something he never did—and froze.\n\nGrenhal's scars were gone.\n\nNot all of them. The emperor's red energy, that supernatural perception unique to the Saharan bloodline, picked up the traces. But the old wounds, the badges of loyalty earned in decades of service, had been erased. Healed completely, as though they'd never existed.\n\nWhich meant Grenhal's loyalty had been... reconsidered.\n\n\"Who helped you?\" Juander asked quietly.\n\n\"The Overgeared King.\"\n\nSilence.\n\n\"Before I explain our relationship with him,\" Grenhal said carefully, \"there's something you need to know.\"\n\n\"If it's about Marie murdering Empress Aria with the Yatan Church, I already know.\"\n\nGrenhal's composure cracked. \"You—\"\n\n\"Benoit told me. Some time ago.\"\n\n\"Your Majesty...\" Grenhal's voice was thick. \"I'm ashamed. I stood by while she poisoned this empire from within. I endangered the nobility, the people, the—\"\n\n\"Stop.\"\n\nJuander waved off the rest. He had no interest in punishing the dukes for their armies marching on Titan; he *needed* them. With the imperial family in chaos, the dukes were the pillars holding up the realm. Lose them, and the entire structure would collapse.\n\nBut as he looked at his old friend, Juander saw his own reflection in a nearby mirror. White hair. Completely white, when it had been dark only months ago. The blood of Emperor Saharan ran strong in his veins, granting him transcendent vitality that should have kept him young for decades yet.\n\nInstead, he looked ancient.\n\n*The price of truth,* Juander thought bitterly.\n\nGrenhal knelt, decision crystallizing in his eyes. He'd been tempted—gods, how he'd been tempted—to abandon the empire. To follow Grid. But seeing Juander like this, broken and aging and *alone*...\n\n\"Your Majesty, reveal Marie's sins. Punish her and Edan to the fullest extent of imperial law. The nobility needs to see justice done, or they'll lose faith in the throne itself.\"\n\nThe \"fullest extent\" didn't mean execution. In the Saharan Empire, true punishment meant the Abyss: eternal imprisonment in despair, a living death stretched across years or decades. Juander had never used it, not even for Piaro's betrayal. He'd executed Piaro's entire family instead, unable to stomach the cruelty of the Abyss.\n\nBut that hesitation was why Edan's actions had cut so deep. Imprisoning the dukes there was an unforgivable violation, and Juander had disowned his son without a second thought. Any hesitation would have turned the entire nobility against him.\n\nNow it was Marie's turn.\n\n\"Justice,\" Juander agreed, the word tasting like ash, \"is necessary. I will reveal their crimes and sentence them to the Abyss.\"\n\nHis lover. The mother of his child. His son.\n\nAll damned to—\n\n\"Your Majesty!\"\n\nChancellor Velmont burst through the chamber doors, propriety forgotten. \"The armies marching on Marquis Aileen are being routed!\"\n\n\"What?\"\n\n\"Valhalla.\" Velmont could barely get the word out. \"Valhalla Kingdom is striking at our forces across multiple fronts.\"\n\nStunned silence.\n\nIt made terrible sense. Sima Qian, Valhalla's strategist—the man even Grandmaster Zikfrector acknowledged—would see the empire's chaos as prime opportunity. The truce between Valhalla and the empire? That had been arranged by *Zikfrector*, not Juander. A personal agreement between Ares, Sima Qian, and the grandmaster in the Celestial Palace.\n\n\"We will be good partners,\" Zikfrector had told them.\n\nPartners. Not subjects.\n\nJuander felt the weight of the throne pressing down on him like a physical force. White hair. A murdered wife. Treacherous children. Foreign invasion.\n\n*Father,* he thought, staring at nothing, *did your Abyss feel like this?*\n\n---\n\nIn Reinhardt, capital of the Overgeared Kingdom, Ruby collapsed into a chair.\n\nSix straight hours of healing. She'd channeled divine power until her hands shook and her vision blurred, pouring light into Basara's broken mind, fighting off the corruption of Yatan's essence inch by stubborn inch.\n\nThe notification chimed:\n\n[**You have detected the evil aura eating away at the target's spirit!**]  \n[**Your power has succeeded in denying the gods!**]  \n[**The spirit of the target has been fully restored!**]  \n\nDuke Basara's eyes opened.\n\nGrid, watching from the doorway, swore under his breath. \"Worse than dogs.\"\n\nEmpress Marie had used Yatan's essence to poison Asmophel, destroying lives and families in her quest for power. Edan had *known* and tried to replicate his mother's cruelty. The casual evil of it made Grid's blood boil.\n\nBut Basara was healed. The dukes were safe.\n\nWhich meant Grid could finally focus on what he'd been putting off.\n\nHe retreated to his personal smithy, spread his materials across the workbench, and stared at the gleaming ingot of pavranium. Pagma's metal. The signature of a legend.\n\nIt was time to create his own.\n\n\"Insane dragon iron, obviously,\" Grid muttered, sorting through minerals. The iron from Nevartan's lair had a unique property: it *grew*, doubling in mass every ten days. Pavranium could make one sword. But if Grid created a new alloy with proliferating properties?\n\nDozens of exclusive items. Maybe hundreds.\n\nHe pulled out four additional minerals, weighing each one in his palm.\n\n*Let's see what a Legendary Blacksmith can really do.*"
}