{
  "id": 1075,
  "title": "Chapter 1074",
  "content": "Material selection demanded careful consideration. Minerals possessed remarkable properties, but overlooking fundamental characteristics—hardness, strength, ductility, brittleness—would compromise the final product. Using diamond for a sword simply because it was \"very hard\" exemplified such folly. What good was power if the blade shattered after two swings?\n\n'This time is different. Performance takes priority over everything else.'\n\nThe evolved Mineral Creation skill required pavranium as its foundation. While not infinitely durable, Grid had already addressed that limitation by selecting insane dragon iron as one of the four minerals to combine with it. For the remaining three, he had considerably more freedom—no need to settle for anything less than exceptional.\n\nCommon and high-grade minerals fell off the table immediately. Money, time, and force could acquire those. No, what he needed were the rarest materials on the continent—minerals that only appeared when fortune smiled.\n\n'The insane dragon bead and stone are exceptions. Those chaotic properties could ruin everything.'\n\nLike insane dragon iron, both were tainted by Nevartan's madness. The stone suppressed a mineral's inherent properties when mixed, while the bead amplified them. Either effect posed serious risks—suppression could undermine pavranium's unique characteristics, and amplification might prove impossible to control.\n\n'If pavranium's ego gets amplified... actually, that sounds terrible.'\n\nGrid's expression darkened as the full scope of the problem crystallized.\n\n'It's not just about avoiding suppression and rampage. The properties themselves can't be too pronounced.'\n\nThis new mineral would differ fundamentally from pavranium. Better, yes, but also unlimited in quantity. It would grow gradually, becoming his standard material for future creations. Strong elemental affinities or divine attributes would severely restrict its applications.\n\n'Damn, this is more complicated than I thought...'\n\nHe surveyed the table laden with minerals and weapons. The surface could seat twenty people comfortably, yet items still spilled onto the floor—every single one at least unique-rated. The sight would stun any observer.\n\n'I was planning to disassemble the Holy Light Set for adamantium...'\n\nBut distinct properties posed problems. Divine-infused minerals would conflict with darker attributes during production. Even if the base item succeeded, the option imprinting could fail catastrophically. Perfect stats, worthless effects—a recipe for disaster.\n\n'Same reasoning eliminates the great demon by-products. I need something as neutral as possible.'\n\nThe ideal mineral would resemble raw dough—plain and adaptable. Just as dough's pale color didn't determine the final dish, the created mineral should serve as a blank canvas. Different recipes, different results. It needed to accommodate any attribute when the situation demanded.\n\nIf quantity were limited like pavranium, maximizing inherent properties made sense. But for mass production? Neutrality was paramount.\n\n\"Kuoong...\" Wrinkles creased Grid's forehead.\n\nHigher-grade minerals inevitably carried stronger properties.\n\n'Blue orichalcum has the least pronounced attributes.'\n\nBorn from moonlight and the Guardian of the Forest's magic power, blue orichalcum possessed useful features—strengthened in darkness, lightning affinity, enhanced cutting power—without the baggage of elemental, divine, or demonic properties.\n\nFurthermore, it ranked among the strongest minerals available. While perhaps less imposing than adamantium's divine power or blood stone's infernal nature, within its class nothing compared.\n\nGreat demons and fallen gods made obtaining it nearly impossible outside the Overgeared territory. The Guardian of the Forest spawned exclusively in their lands, giving the guild complete monopoly. For everyone else, blue orichalcum was a distant dream.\n\n'The value and performance are perfect. Just...'\n\n**[Blue Orichalcum]**\n\n**Orichalcum born from moonlight and the Guardian of the Forest's magic power.**\n\n**The Guardian's magic cannot be eroded, but its hardness and strength surpass all other minerals.**\n\n**Lightweight and significantly strengthened in darkness.**\n\n**Weight: 3**\n\nThe very trait that made it neutral—magic power that resisted erosion—rendered it useless.\n\n'Using this for Mineral Creation would be a disaster.'\n\nThe whole point was creating a mineral that *could* accept additional properties. Blue orichalcum's resistance to magical infusion defeated the entire purpose.\n\n'I'll need to enchant items made from the new mineral frequently.'\n\nHe'd walked straight into a swamp. The deeper he thought, the more tangled the problem became. Grid's head began to pound, and that familiar warning—*extended Satisfy usage may be harmful to your health*—flickered through his mind.\n\nThen it hit him.\n\n\"Ah.\"\n\nMinor. The minerals detector who'd helped discover both pavranium and insane dragon iron. After Grid had forced him to study minerals for a decade, the young man's knowledge had reached near-legendary status.\n\n***\n\nThe meeting room door swung open at Grid's summons.\n\n\"What's the best mineral with minimal inherent properties?\"\n\nMinor walked in, beard neatly trimmed, and answered without hesitation. \"Black mithril, obviously.\"\n\n\"...\"\n\nTime had flown. The thirteen-year-old Grid first met was now in his mid-twenties, sporting a handsome beard. Seeing him again after the insane dragon iron expedition stirred something nostalgic in Grid's chest.\n\nMinor, however, looked less than thrilled.\n\n**[Talent Will Reveal Itself (SS)]**\n\n**A one-in-ten-million gift.**\n\n**No matter how you hide, your talent will shine through. Destiny chains you to a life of constant recruitment offers and temptation.**\n\n**Your stats grow exceptionally fast, and arrogance comes naturally.**\n\nMinor attributed all his current success to personal ability. In his mind, only the Emperor deserved his service. Grid, despite everything, still seemed inadequate—a king who'd dragged a genius into endless mineral studies and trapped him managing some absurd department.\n\nYet Minor never betrayed him. He grumbled constantly but followed orders faithfully. Respect overshadowed the trait's arrogance. Though he tried to hide it, Minor deeply admired the commoner who'd built and led a kingdom from nothing.\n\nThat respect had made him refuse countless recruitment offers over the years. Had the Empire itself approached—not some lesser nation—he might have reconsidered. Fortunately for Grid, they never did.\n\n\"Black mithril?\"\n\nMinor blinked, returning from his brief reverie.\n\nHe nodded firmly. \"Yes. Black mithril matches ordinary mithril's strength but rivals blue orichalcum's hardness. The 'black' designation refers to its lack of divine power, not its color. It's completely empty of inherent properties.\"\n\nA satisfied smile curved his lips. \"Well, a layman like Your Majesty wouldn't know this, but it's a closely guarded secret. The imperial family has monopolized black mithril for generations.\"\n\n\"I know. Black mithril's like blank paper—it absorbs any property exceptionally well. That's precisely why the Empire values it.\"\n\n\"How do you—\"\n\n\"The Red Knights' armor is forged from black mithril infused with red energy.\"\n\n\"How do you know that?\"\n\n\"I killed a Red Knight.\"\n\n\"Truly, Your Majesty... running around constantly as king of a small country certainly expands one's knowledge.\"\n\n\"Skip the sarcasm and continue. I'll teach you manners later.\"\n\n\"...I'm complimenting you.\"\n\n'Adorable brat.' Grid smiled mischievously. Minor's competence despite constant grumbling endeared him. During the insane dragon iron expedition, Grid had glimpsed \"respect\" in Minor's status window. Having such talent respect him felt genuinely pleasant—even the impoliteness seemed charming.\n\n\"Black mithril's superiority lies in that blankness you mentioned. It lacks blue orichalcum's natural enhancements—the darkness boost, the cutting power—but properly harmonized, it can transcend even adamantium.\"\n\n\"Hrmm...\" Having glimpsed the gods' true nature, Grid couldn't argue. Assuming divine minerals inherently surpassed human-world materials was foolish.\n\n'All right. Black mithril is the second component.'\n\nFor a mineral meant to serve as the foundation for all future items, black mithril was ideal. Grid's creation would maximize whatever properties were added during production.\n\nOne problem remained: he had no black mithril. He'd owned a single piece once, long since incorporated into Mercedes' armor. Regardless of Mineral Creation's value, dismantling a myth-rated item wasn't happening.\n\n'Can Minor acquire more?'\n\nGrid voiced the question. \"I'm creating a new mineral by combining pavranium, insane dragon iron, black mithril, and two others. Given that I plan to use it for all future equipment production, what minerals do you recommend for the remaining slots?\"\n\nMinor's eyes gleamed with interest. \"For infinite multiplication across all battle gear types... naturally, adamantium and blood stone. The finest minerals representing the divine realm and hell respectively. No alternatives come close. You can obtain adamantium by smelting your old Holy Light Armor, and blood stone from that transparent red sword.\"\n\n\"...Then use insane dragon stone to strip their properties.\"\n\n\"Exactly. Even neutralized, they'd surpass blue orichalcum. Ask me again what the best property-neutral minerals are, and I'll say adamantium and blood stone—*after* removing their attributes.\"\n\nGrid possessed both hammer and anvil forged from insane dragon stone, making property removal feasible. But another obstacle loomed. The Holy Light Armor was unused, easily sacrificed. But blood stone required dismantling the World Crushing Sword of the Noble White Tiger—Mercedes' current weapon, myth-rated and irreplaceable.\n\nGrid gestured at Berith's by-products scattered across the table. \"Could any of these substitute for blood stone?\"\n\n\"...?\" Minor examined Berith's Hoof, confusion crossing his features.\n\n\"Does this look harder than blood stone?\"\n\n\"...I believe so.\"\n\nOnly one solution remained.\n\n\"All right, go acquire black mithril.\"\n\n\"Huh? What did you just say?\"\n\n\"Obtain black mithril.\"\n\n\"Do you understand that the Empire uses red energy-infused black mithril? Think about the implications. They've monopolized the supply chain completely—managed by massive institutions or directly controlled by the imperial family. How exactly am I supposed to acquire it under those conditions? You want *me* to handle this?\"\n\n\"Certainly... it could prove difficult for you. I'll obtain it myself.\"\n\n\"Did you hear anything I just said? It means *death*!\"\n\n\"I said I wouldn't send you—I'll handle it personally.\"\n\n\"Then *Your Majesty* will die!\"\n\n\"I won't die. One of the Empire's dukes might help.\"\n\n\"Did you eat something rotten today? Which duke would you ask?\"\n\nMinor wasn't a senior noble. Despite his closeness to Grid and vital role with minerals, he lacked political standing. He knew nothing of Grid's adventures at the Ruins of the War God—the friendships forged with imperial dukes, the great demon defeated together, the rescue and treatment of those same nobles.\n\nThe most recent Grid-related news he'd heard involved killing Sky King Rigal. Minor wondered if the king had lost his mind.\n\n\"Damn it, I'll just infiltrate the Empire myself. As a talent, they'll welcome me. I'll get hired, gather intelligence, locate black mithril sources. Give me ten or twenty years.\"\n\n\"Wow, look at this guy. Trying to defect to the Empire now?\"\n\n\"Yes, but I'd still obtain the black mithril for you.\"\n\n\"Stop. I said I'll handle it.\"\n\n\"No, what is this?\"\n\nMinor felt like he was arguing with Jude. The absurdity was making him crazy.\n\nThen—\n\n*Knock knock.*\n\nA polite rap at the door, followed by Prime Minister Lauel's voice. \"Duke Basara requests an audience.\"\n\n\"...?\"\n\n'Basara?'\n\nMinor had always claimed only the Emperor deserved his service. He studied the Empire obsessively—its politics, resources, nobility. The name Basara was intimately familiar. Only one person on the continent carried the title Duke Basara: the one with royal blood.\n\nGrid smiled at Minor's rigid expression. \"Come in.\"\n\nThen—\n\n\"I greet the Overgeared King.\"\n\nA beautiful woman wearing a magnificent golden crown entered the meeting room, bowing deeply with perfect etiquette. Someone of imperial blood.\n\n\"I apologize for the delayed visit. Recovery took time. I owe you an immense debt.\"\n\n\"Think nothing of it. Given our relationship, helping each other is only natural.\"\n\n\"...Basara Ella von Saharan, Duke of the Saharan Empire and legitimate heir to the throne, vows before the eyes of the Goddess of Light: I will repay three great favors to the Overgeared King for the remainder of my life. This debt supersedes even succession rights. Please remember these words.\"\n\n\"Huh?\" Minor's strangled response came before Grid could speak. His blank expression no longer saw Grid as merely a king—this was a god.\n\nGrid spoke immediately. \"I need black mithril.\""
}