{
  "id": 1076,
  "title": "Chapter 1075",
  "content": "\"I need black mithril.\"\n\n\"Understood.\" Basara's reply came immediately, though a flicker of concern crossed her features—brief, but Grid caught it.\n\n\"Difficult to obtain?\"\n\n\"No.\"\n\n\"Be honest with me. I don't want your position compromised on my account.\"\n\n\"Your Majesty, my position is irrelevant. You need only tell me what you require.\"\n\nHer tone brooked no argument—the firmness of someone who'd just sworn three debts of honor. It frustrated Grid more than reassured him. \"You're the bridge between the Overgeared Kingdom and the empire. We can't afford to weaken that connection.\"\n\nBasara's expression softened slightly. \"The truth is, acquiring black mithril carries significant risk. The mine is under His Majesty's direct control.\"\n\n\"Not the empire's—the emperor himself?\"\n\n\"Black mithril is too valuable to the imperial bloodline for delegation. The mine has been managed exclusively by either the emperor or crown prince for generations. With no crown prince designated yet, His Majesty oversees it personally.\"\n\n\"Simply because it conducts red energy?\"\n\n\"That one property justifies everything.\" Basara leaned forward. \"Red energy strengthens, restores, and awakens the body's physical capabilities. The Saharan Empire's ultimate goal is simple: equip as many soldiers as possible with black mithril. The founding emperor built his empire on the backs of the Red Legion. His descendants understand that legacy. Titan became the capital for one reason—it sits atop the continent's only black mithril deposit.\"\n\nGrid's jaw tightened. The emperor's obsession ran deep enough to choose his capital based on a mine. This wouldn't be simple.\n\n\"Yet I've seen black mithril outside the imperial treasury.\"\n\n\"Obtaining it is extraordinarily difficult. The only practical method would be killing a Red Knight and claiming their armor.\" Basara shook her head. \"Even that's impossible now. The moment Edan was branded a traitor, the Red Knights were marked for purging.\"\n\n\"Purging?\" Grid stiffened. He'd witnessed their loyalty firsthand—Mercedes embodied it. Why would the emperor eliminate devoted soldiers? Even if Limit led the empress' faction, why destroy everyone under his command? \"That makes no sense.\"\n\nA cold smile touched Basara's lips. \"It's efficient governance. Most Red Knights remain loyal, but if even a handful were corrupted by Sword Duke Limit's ideology, they represent an unacceptable risk.\"\n\n\"Harsh doesn't begin to cover it. Destroying knights who've served faithfully based on mere possibility—\"\n\n\"It's precedent. The Red Knights, including Sir Piaro, were purged once before.\"\n\nGrid fell silent.\n\n\"Not purging them would be worse,\" Basara continued. \"The nobility would never accept an organization tainted by traitors. They'd pressure the emperor to replace every Red Knight with their own relatives—consolidating power under the guise of loyalty.\"\n\nLauel cut in before Grid could respond. \"What about infiltration? We have a great sage capable of Mass Teleport.\"\n\n\"The mine is warded against teleportation and communication magic. More importantly, black mithril can only be extracted once annually.\"\n\n\"Once a year?\"\n\n\"On that single day, His Majesty personally leads the imperial guard to the mine. To obtain any, you'd need to infiltrate on the exact same day—meaning you'd face the emperor and his full guard. The empire would declare you hostile immediately. Any hope of harmony between our kingdoms would die.\"\n\n\"Then we're out of options?\"\n\n\"There's one.\" Basara's voice dropped. \"The imperial treasure vault. Generations of mined black mithril are stored there. If you strike when His Majesty departs for the mine, many guards will be absent. It's your only window.\"\n\nGrid's mind raced. The treasure vault of emperors who'd dominated the West Continent for centuries—even understaffed, its defenses would rival a dragon's lair. Still, better than confronting the emperor directly at the mine.\n\n*Superior materials are always a nightmare,* Grid thought grimly. Unknown locations, impossible procurement. He clicked his tongue. \"When does the emperor leave for the mine?\"\n\nHe braced for months of waiting, thumb-twiddling frustration—\n\n\"Eight days.\"\n\n\"*Eight days?*\"\n\n\"It's close, I know. Edan's chaos might work in your favor—the confusion could make infiltration easier than usual. Even so, I can't guarantee success.\"\n\n\"Understood.\" A smile tugged at Grid's lips. Edan's rampage might prove useful after all—\n\n\"By the way, why are you ignoring the meteorite?\"\n\nGrid spun toward the voice. A small shadow crouched beneath the meeting table—Dwarf Ke. The uninvited guest had somehow bypassed every defense.\n\n*How?*\n\nKnights guarded the entrance. The Overgeared Shadows maintained interior security. Yet Ke sat there casually. Grid's gaze dropped to the dwarf's feet, where a small yellow golem poked its head from a freshly dug tunnel. It resembled an elemental, but the light elemental beside Grid showed no reaction.\n\nKe grinned. \"Artificial elemental. A golem core infused with earth elemental essence—useless for most purposes. But as you can see, it excels at digging. Smells minerals too, leads me straight to them.\"\n\n\"So you could tunnel into the emperor's palace?\"\n\n\"Oh, that would be *terrible*. I tried that a century ago—spent decades in that cage because of it. Not repeating that mistake.\"\n\nGrid's expression hardened. A thief. He'd saved this thief. \"You damaged my castle without permission and trespassed illegally. That's a cell.\"\n\n\"W-What? Must you? Castles get repaired in days! Fill the hole, problem solved. Besides, I didn't mean to break in—the artificial elemental smelled minerals and acted on instinct!\"\n\n\"And the inconvenience to my people during repairs? Intent doesn't matter—trespassing is trespassing.\"\n\nGrid had wanted to build rapport with the first dwarf he'd met. That's why he'd freed Ke. But this was excessive. Boundaries needed establishing. As Grid prepared to call the guards—\n\n\"I won't just repair it—I'll expand it! I'm a master fortress architect! Even King Madra of Lubana commissioned me to build his stronghold!\"\n\n\"King of Lubana?\" Grid froze.\n\n\"Madra, yes. Ancient king of a failed nation—history barely remembers him. You wouldn't know—\"\n\n\"I know him.\" Grid's tone shifted. Someone who'd met Madra stood before him.\n\nKe continued quickly, \"I broke into your castle because I wanted to see your legendary works! No malice, I swear. Please, just this once! I'll never do it again!\"\n\nGrid exhaled slowly. Setting precedents was important, but—\n\n\"I overheard your conversation by accident. You're creating a new mineral? Using blood stone and adamantium? Forget about removing adamantium's properties—you don't need to. Meteorite fragments that fall from space and lose their divine light *become* adamantium. This sword—\" Ke pointed at the Star Sword, \"—is forged from one.\"\n\nGrid blinked. Limit's blade had been described as made from a \"star fragment,\" but he'd never connected it to meteorites. Never realized meteorites were simply adamantium stripped of divinity.\n\n*This changes everything.*\n\nAdamantium's value wasn't solely its divine properties. The strength, hardness, and workability that craftsmen prized remained intact. Ke had just handed him the solution.\n\nGrid suppressed his smile, keeping his voice stern. \"Fine. Rebuild the castle as promised and assist with this mineral's creation. Then I'll overlook imprisonment.\"\n\n\"Oh, thank you! Really, thank—\" Ke paused, doubt flickering across his features. *Should I be grateful?* But the alternative was prison, so he nodded vigorously.\n\n***\n\nThe Saharan imperial household army was formidable—veteran soldiers with elite equipment and extensive skill sets, rivaling the combined might of the Ares Army and Overgeared forces. Yet Valhalla's players dismantled them with surprising ease.\n\nCredit belonged to their military adviser, Sima Qian. Recognizing the civil war's chaos, he'd exploited the household army's fractured mentality. By reaching Marquis Aileen's territory ahead of schedule and positioning troops along every likely route, he'd orchestrated a series of devastating ambushes. Victory reports flooded in from across the capital region.\n\n\"Magnificent. Absolutely magnificent.\" Ares laughed as messages rolled in—guild members and soldiers gaining levels in droves.\n\nSima Qian remained modest. \"The grandmaster's intelligence made this possible. Without his information, we couldn't have positioned forces effectively.\"\n\n\"He provided a hint. The execution was pure talent.\" Ares leaned forward. \"Now we extract Marquis Aileen?\"\n\n\"Precisely.\"\n\nSecure the marquis, escort him to safety, then fortify his territory and await Prince Edan's arrival. With Edan rallying the Red Knights, they could withstand the imperial army's assault—ten days maximum. Sufficient time.\n\n\"Prince Edan is young, less entangled with external factions than his brothers. If he raises the banner of independence, champions the rights of minorities, he'll win support from ethnic groups across the empire.\"\n\n\"Minorities will flock to Marquis Aileen. The civil war extends. Then we mobilize our main force to the border and seize the empire's outskirts.\"\n\nThe Saharan Empire—untouchable hegemon of the West Continent, unconquerable even by Grid. Ares would be the first to crack its foundations. His blood sang with anticipation."
}