{
  "id": 1077,
  "title": "Chapter 1076",
  "content": "\"Report from the scouts, sir.\"\n\nThe aide stepped forward. \"Viscount Donut's engineering corps is trapped in the Elkas swamp. Intelligence suggests the Thallen Dam collapsed, flooding the river system and turning the entire region into an impassable morass.\"\n\n\"A dam doesn't just collapse.\" Chensler's jaw tightened. \"This stinks of Valhalla.\"\n\n\"Without the engineers, the eastern nobles' army can't advance past Gran Canyon. The old bridges spanning the gorge won't support a military column.\"\n\nChensler's eyes narrowed. \"Lord Cran submitted a report three months ago stating those bridges had been repaired and certified. Now they're suddenly unfit for use?\" He slammed his fist on the armrest. \"Valhalla again. Or worse—someone on our side is feeding them intelligence.\"\n\n\"The report appears to have been falsified, sir.\"\n\n\"Then Lord Cran committed treason.\" No hesitation colored Chensler's voice. \"Execute him immediately.\"\n\nAnother scout burst through the tent flap. \"The 2nd and 3rd armies tracking Marquis Aileen have fragmented into twenty-three separate units! They lost his trail near Mount Teri and are spreading out to search—\"\n\n\"Foolish,\" Chensler muttered. \"Aileen is a rallying point for the empress' faction. We cannot let him slip away.\"\n\n\"Sir!\" The scout's face had gone pale. \"The scattered units—Valhalla is attacking them!\"\n\n\"What?\"\n\n\"Delpito Forest, sir! Valhalla forces have engaged the 3rd Army! Heavy casualties—\"\n\nChensler exploded from his seat, the calm mask he'd worn shattering. His original mission had been straightforward: locate the traitor Prince Edan and dismantle his power base. But Valhalla's intervention had transformed a simple manhunt into a strategic nightmare.\n\n\"Those bastards.\" The words came out low and venomous. \"They're exploiting the succession crisis. Why in the hells did Vermonth negotiate a peace treaty with those mercenary dogs?\"\n\nHis fist came down on the black iron table. The metal *groaned*, then split cleanly in half, both pieces clattering to the ground.\n\nThe lieutenant swallowed hard, eyeing the ruined furniture. \"Sir, we've just learned... the Valhalla treaty wasn't negotiated by Duke Vermonth.\"\n\nChensler went still. \"Then who?\"\n\n\"The grandmaster, sir. Zikfrector himself.\"\n\nThe blood drained from Chensler's face.\n\nGrandmaster Zikfrector had served the empire through five emperors. A transcendent being of incalculable age and power, he was meant to be the ultimate guardian of the Saharan bloodline. Yet he'd never truly *acted* as a guardian—he moved independently, showed the emperor barely concealed contempt, answered to no one.\n\nAnd still, every emperor relied on him. *Had* to rely on him.\n\nThe grandmaster knew secrets the imperial family had buried for centuries. His personal strength exceeded anything that could be called reasonable. The emperor needed him. And as a loyal servant of the throne, Chensler had always respected that necessity.\n\nBut now...\n\n'The grandmaster never involves himself in external affairs.' Chensler's thoughts raced. 'He negotiated with Valhalla directly? And now Valhalla is countering our every move as if someone is feeding them our strategic plans...'\n\nA turncoat? No. Impossible. A man who'd lived in the imperial palace for *centuries* wouldn't suddenly betray his charge.\n\nWould he?\n\n\"Breaking news!\" Another messenger skidded into the tent, breathing hard. \"Remnants of the Red Knights are attacking our search parties in the capital!\"\n\n\"The Red Knights?\" Chensler's head snapped up. \"The Neo Red Knights destroyed them weeks ago.\"\n\n\"We don't know what's happening, sir! The Neo Red Knights aren't responding to communications!\"\n\n\"Damn it all—\" Ice flooded Chensler's veins. The emperor was in danger. He was already moving, sprinting from the command tent. \"To the imperial palace! *Now!*\"\n\n---\n\nIn the audience hall, Duke Grenhal and Duke Morse knelt before the emperor.\n\n\"Your Majesty, grant us permission to bring our household troops into the capital,\" Grenhal said. \"Between our two families, we can organize a proper search for Prince Edan.\"\n\nOnce they'd learned of Valhalla's involvement, the situation's true scope had become clear. This wasn't a prince's tantrum. It was a *plan*—thorough, calculated, and backed by significant resources. Someone powerful was pulling strings behind the scenes.\n\nThey needed to find Edan. Quickly.\n\nEmperor Juander didn't deliberate long. \"Granted.\"\n\nHe understood the stakes. More than that, he needed to demonstrate trust in his dukes. After the chaos with Piaro and the empress, their loyalty hung by a thread. He had to—\n\nThe massive jade doors of the audience hall swung open.\n\nAn uninvited figure stepped through.\n\n\"I must ask Your Majesty to rescind that order.\" The voice was young, confident, and entirely unwelcome. \"Private armies have no place in the capital.\"\n\nIt was the traitor they'd been hunting.\n\nFourth Prince Edan.\n\n\"*You!*\" The emperor surged to his feet, face flushing crimson. \"You *fool!*\" His voice cracked like a whip through the hall. \"To protect your mother's crimes, you threatened the very nobles who support this empire! You let power blind you—you've doomed yourself!\"\n\nWhen Benoit had revealed the truth, Juander had resolved to punish Empress Marie. But Edan? There was no evidence linking the prince to Piaro's downfall. No proof of conspiracy. Edan could have survived this. His position would have weakened, yes, but he could have lived quietly, enjoyed the privileges of his blood, perhaps even found purpose elsewhere.\n\nInstead, the fool had made everything worse. Covering up the truth. Imprisoning innocent dukes. Compounding crime upon crime.\n\nJuander was an emperor. He was also a father.\n\nHis heart broke at the thought of what must come next.\n\nEdan smiled. It didn't reach his eyes. \"So I should have done nothing? Watched my mother fall and simply... accepted it?\"\n\n\"...!\"\n\n\"Mind your tongue!\" Duke Grenhal barked, stepping forward. \"You address the emperor!\"\n\nEdan ignored him. His nostrils flared. \"This is *your* fault, Father. You clung to hope for my weak elder brother, my unqualified second brother, my wandering third brother—and you ignored *me*. I've proven myself again and again. I discovered the magic machines, secured ancient weapons for the empire. I earned the position of crown prince. Why wasn't I named heir?\"\n\n\"Silence.\"\n\n\"Was it because I'm a concubine's son?\" Edan's voice rose. \"No—your own father was born from a concubine. So why? Because I'm not Aria's blood? Because I don't remind you of your precious dead empress?\"\n\n\"*Enough!*\"\n\n\"You're the one who should be silent!\" Edan's composure shattered completely. \"Your arrogance caused all of this! If you'd focused on the empire instead of your obsession with the East Continent, Mother would never have dared act! Empress Aria would still be alive! Piaro wouldn't be branded a traitor! *None of this would have happened!*\"\n\n\"...!!\"\n\nThe emperor saw it in his son's eyes: poison. Killing intent.\n\nThere was no path back from this.\n\nHis expression hardened into something gray and final. \"Bain. Seize him. Take him to the dungeons.\"\n\n\"Yes, Your Majesty.\"\n\nBain moved without hesitation. He had no real loyalty to the royal family—his identity as a Lantier made such loyalty impossible. He felt nothing as he blurred across the chamber.\n\nDuke Grenhal felt wind rush past his ear. Thirty meters away, Prince Edan was suddenly airborne, launched backward by a strike too fast to see.\n\n\"Gkk—!\" Edan tumbled across the red carpet, blood streaming from his mouth. He staggered upright just as Bain materialized behind him, hand clamping onto his shoulder like an iron vice.\n\n\"Your Highness, please don't resist—\"\n\n\"Get your filthy hands *off me!*\" Edan's red energy exploded outward in a razor-edged corona. \"I am this empire's future! I am the *only* one qualified for the throne!\"\n\nBain leapt back, barely avoiding the energy blades that would have flayed him alive.\n\nEdan drew his sword.\n\nIt was black mithril, but the red energy coiling around the blade was *wrong*. Too dense. Too refined.\n\nThe emperor's eyes widened. 'That energy... it surpasses mine. By a considerable margin.'\n\nThis wasn't red energy Edan could have developed on his own. Who—?\n\nBain froze mid-step, instincts screaming danger. If he approached now, that blade would cut him down.\n\nEdan's smile widened. \"Did you wonder, Father, why your army couldn't find me?\"\n\nFootsteps echoed from the corridor beyond. Slow. Measured. Utterly confident.\n\nThe sound sent ice through everyone present.\n\n\"There is only one place in this empire your forces cannot reach,\" Edan continued.\n\nThe footsteps stopped just outside the audience hall.\n\n\"The Celestial Palace. I've been hiding there all along.\"\n\nThe jade doors opened.\n\nGrandmaster Zikfrector stepped through.\n\n\"I will now install Fourth Prince Edan as emperor,\" Zikfrector announced. His tone was formal, almost courteous. \"The proof of his qualification is this—the sword of our founding emperor, Saharan.\"\n\n---\n\nIn Marquis Aileen's territory, the situation had deteriorated beyond recovery.\n\n\"Isn't Prince Edan overdue?\" Ares stood atop the castle wall, watching the imperial forces tighten their siege. Too many. Far too many.\n\nMilitary Adviser Sima Qian had predicted their movements, sabotaged their supply lines, delayed their advance at every turn. So why were there three times as many enemy troops as expected? Without Edan's magic machines and the Red Knights, this position was untenable.\n\nSomething had gone terribly wrong.\n\nSima Qian's voice was hollow. \"We've been used.\"\n\nAres turned.\n\n\"The grandmaster played us from the start. Prince Edan was never coming.\" Sima Qian's shoulders sagged. \"This failure is mine. Please... execute me now and spare the others.\"\n\n\"...\" \n\nAres' world tilted. For one disorienting moment, he couldn't process the betrayal. Then training took over. \"Luck! Scott! Get the military adviser out of here. If he dies, we have no future. *Move!*\"\n\nThat day, most of the Ares Army—including Ares himself—fell. Valhalla lost years of accumulated supplies and troops in a single catastrophic defeat.\n\nIt was a blow that would take the kingdom years to recover from.\n\n---\n\n\"Perfect.\"\n\nGrid examined the molten adamantium pooling in his crucible, satisfaction warming his chest. The Star Sword had yielded exactly what he needed.\n\nNow came the difficult part.\n\nHe was about to infiltrate the imperial palace alongside Duke Basara. The emperor's treasure vault lay deep within those walls—and Grid, as the king of a rival nation, had no legitimate way to gain entry. No invitation would come. No diplomatic pretense would work.\n\nSo he'd use the simplest solution: disguise himself as one of Basara's retainers.\n\n'Time to test the face mask.'\n\nExcitement thrummed through him. A new mineral to experiment with, a daring infiltration mission, and the prospect of legendary materials waiting in that vault.\n\nHe turned toward the high elf standing nearby.\n\n\"Sticks! Teleport Basara and me to the capital's outskirts. We're going in.\""
}