{
  "id": 1079,
  "title": "Chapter 1078",
  "content": "Red energy was not a skill to be learned. Like a vampire's blood-drinking or the evil eyes of the demonkin, it was an innate force—impossible to train, impossible to cultivate. In ages past, the empire understood this. They crowned emperors based on the strength of their red energy alone. The mightiest ruled. The empire in those days was truly supreme, unmatched across the continent.\n\nBut that golden age had long since passed.\n\nAs centuries wore on, the royal bloodline grew drunk on power. Cunning schemers claimed the throne over warriors. The title of emperor, once synonymous with strength, became a badge of treachery and fortune. These pale shadows of Saharan merely paid lip service to their ancestor's dream—the unification of the West, the conquest of the East—while they gorged themselves on decadence. It was no wonder the imperial family had forgotten their oath to the grandmaster.\n\nThe Abyss.\n\nThe world's end.\n\nThe origin point. A passage connecting the mortal realm to hell itself, or so the legends claimed. Both Emperor Saharan and the grandmaster had once deemed it vital to their grand ambitions. Now? Now it was nothing more than a glorified dungeon. The thought made the grandmaster's lips curl with contempt.\n\n\"Your son, at least, showed promise.\" The grandmaster's voice was cold. \"After a single visit to the Abyss, he understood what I desired. He proposed a deal. For a moment, it was like Saharan walked the earth once more. I confess—I felt something akin to joy.\"\n\nEmperor Juander's eyes widened. \"What could you possibly want in the Abyss?\"\n\nThe emperor knew what that place was. As one descended into its depths, the laws of reality unraveled. Dimension and time became meaningless. It was a wound in the world, festering at the threshold of hell itself.\n\n\"You mean to tear down the barrier,\" Juander breathed. \"To plunge this world into chaos.\"\n\n\"How disappointingly small-minded.\" The grandmaster's finger tapped against Saharan's sword. \"The founder himself would curse you for such a pathetic guess.\"\n\n\"...!\"\n\nA torrent of red energy erupted from the blade. The throne room transformed, bathed in blood-red light that made the air itself feel wrong. The power washed over Edan, and the prince barely kept his murderous instincts in check.\n\n\"Emperor!\" Edan's voice rang out, sharp with desperation. \"Abdicate now! Name me your successor! It's the only way you survive this!\"\n\n\"I refuse!\" Juander's roar echoed through the hall. \"No emperor has ever been usurped by his own son!\"\n\nHe would not be the first to bear such shame.\n\n\"You care about *that*? Now? After everything?\"\n\nThe red energy of founder and emperor collided in midair like dueling storms. Juander's teeth ground together. Let the grandmaster and his wretched son call him incompetent, call him selfish—he was still the reigning emperor of Saharan's legacy.\n\nYes, perhaps he had failed to properly manage the grandmaster, that relic from his grandfather's time. Perhaps he had neglected his own family. But under Juander's reign, the empire had crushed ethnic uprisings and achieved unprecedented economic growth. To his people, he had built a livable world. From outside the palace walls, he was a hero.\n\nAnd now? Now this hermit who had abandoned his duties for decades, and this criminal son whose crimes couldn't be swept under any rug, dared to judge *him*?\n\nHatred burned in Juander's chest.\n\nHis red energy surged—exceptional even among emperors. For a heartbeat, it held against Saharan's power. But only for a heartbeat.\n\nThe founder's red energy was something else entirely. It moved like a tsunami, blazed like the sun itself. Where it touched, matter bent. Life itself bowed. It consumed Juander's energy whole, feeding the strength into Edan instead.\n\nThe transfer was instantaneous.\n\n\"What?\" Juander stared in disbelief at the impossible sight.\n\n\"The source cannot be resisted,\" the grandmaster murmured.\n\n\"You...! Zikfrector!!\" All of Juander's fury fixed on the grandmaster's impassive face.\n\nLooking back, hadn't this man known everything? He'd known it was Empress Marie who murdered Aria, who condemned Piaro to exile. One word from the grandmaster—just one hint—might have saved Aria's life. Might have prevented Piaro's fall.\n\nBut Zikfrector had said nothing. He'd never warned Juander about the ancient pact. Never reminded him that some oaths cannot be forgotten.\n\n\"*You* pushed me to this!\" Red energy exploded from Juander's blade, aimed straight at the grandmaster's heart. The strike carried power far beyond any duke's capability. From his position in the corridor, Zibal watched in awe.\n\n*The emperor's got to be over level 500.*\n\nIt made sense. NPCs in positions of power always had inflated stats. Still, seeing the continent's strongest authority figure in action was something else. Surely the grandmaster would suffer serious injury from such a blow.\n\nExcept...\n\nThe grandmaster didn't move. Didn't even blink.\n\nGravity itself warped. An invisible hand crushed the emperor's body downward, slamming his sword into the marble floor. Their eyes met.\n\nThe grandmaster said nothing. He didn't need to.\n\nHis silence was answer enough.\n\n\"...!\" Understanding struck like a thunderbolt. The emperor staggered back just as Saharan's sword whistled through the space where his neck had been.\n\nToo close.\n\n\"Your Majesty!\" The dukes cried out as the blade opened Juander's shoulder. They could only watch, helpless. The founder's red energy—the *source* of all imperial bloodlines—held them in chains. Generations of service to the throne meant nothing. They couldn't strike. Couldn't even rise. All they could do was kneel in the crimson light and witness the downfall of the man they'd served their entire lives.\n\nA madman was about to steal the throne.\n\n*Is there no one who can break through?*\n\nThe dukes' desperate gazes turned to the corridor beyond the audience chamber. Dozens of Red Knights and magic machine riders formed an impenetrable wall. The empire's finest troops. Even with the Imperial Guard and the dukes' personal forces combined, it would take far too long to breach that line.\n\nJust as despair began to sink its claws in—\n\n\"What are you waiting for? Get out of here and rally the army!\" Bain intercepted Edan's sword, living up to his reputation as the emperor's shadow. His defense was absolute, born of unwavering devotion.\n\n\"I know...! Just hold on!\" The dukes fought to move their leaden limbs, to stand despite the crushing weight.\n\n\"You're not going anywhere.\" The grandmaster flicked his fingers. The gravity around the dukes *doubled*. \"I need witnesses for the coronation.\"\n\nThey slammed back to the floor. \"Damn it!\"\n\nThis magic power transcended even the great demon Berith. It was beyond human limits entirely. Grenhal opened the gates to his berserker bloodline. Morse channeled his beast transformation. To stand against a transcendent being, they would need to approach transcendence themselves.\n\n\"Annoying.\" The grandmaster manifested two crystalline orbs that orbited his body—amplification tools. For the first time, he used magic in earnest.\n\nThe aftermath was devastating.\n\n\"Ghhk...\" Grenhal and Morse collapsed before they'd even fully stood. Their trump cards meant nothing. The gap in power was fundamental, absolute.\n\nThen—chaos in the corridor.\n\n\"Out of my way!\"\n\nAn explosion of force. Red Knights launched into the air, crashed into walls, burst like overripe fruit. Blood painted the marble.\n\nGrenhal and Morse's eyes lit with hope. \"Sir Chensler...!\"\n\nThe Armored Cavalryman—most loyal of the Five Pillars—had arrived. His presence shifted the entire battlefield. The Red Knights fell like wheat before a scythe. Even the single-digit elites were forced back toward the audience hall entrance.\n\n\"Your Majesty!\" Chensler's roar echoed through the palace. Behind him, hundreds of Imperial Guards flooded the corridor.\n\n\"Shit!\" Zibal and the other riders moved to summon their magic machines.\n\n\"No need for more chaos.\" The grandmaster restrained them with a thought, his two orbs still spinning as he drew a sword with his free hand.\n\nA *swordsman* mage? Zibal and the riders balked at the absurdity. But those who knew the grandmaster's true nature only tensed further. The title wasn't honorary—he'd mastered every discipline. Magic. Swordsmanship. Scholarship. All of it.\n\nChensler brandished his halberd, working to control the distance. But the grandmaster's Earthquake spell shattered his footwork. Chensler leapt skyward to evade, giving the grandmaster the opening he needed to close in.\n\n\"Ghh...!\" Only his armor saved Chensler from a fatal wound. Cold sweat broke across his skin, but he countered mid-air, his halberd carving a crescent aimed at the grandmaster's neck—\n\nThe Imperial Guards surged forward. The Red Knights blocked them.\n\n\"Why do knights sworn to the emperor serve traitors?\" the guards screamed.\n\n\"I learned how hollow that oath was,\" Susan replied, her blade cutting through the guards with terrifying efficiency. \"When I saw the grandmaster's greatness.\"\n\nShe had her cousin Mercedes's bloodline, her talent. The guards fell before her like amateurs. Blood and screaming filled the imperial palace.\n\nInside the audience hall, things had taken a turn for the worse.\n\nBain lay defeated. Edan, wielding Saharan's sword, had proven stronger than any of them.\n\nThe prince leveled his blade at his father's throat. \"For generations, the empire has stagnated. Under my rule, that changes. I will discover why our ancestors sought the East Continent. I *will* cross the Red Sea.\"\n\n\"You'll regret this.\" Juander's voice was hollow. \"One day, a sword will be at *your* throat. Just as the grandmaster's is at mine.\"\n\n\"Perhaps.\" Edan's grip tightened. \"But dying as emperor is still a hundred times better than dying as a prince.\"\n\n\"...\"\n\n\"Father. I'm taking the throne.\"\n\nNo more hesitation. Edan's arm tensed to drive the blade home.\n\nAnd then—\n\n\"Knight Summoning!\"\n\nThe voice cut through the din of battle like a blade through silk.\n\n\"...?\"\n\nAn utterly *unexpected* voice from the blood-soaked corridor.\n\n\"Piaro!\"\n\n\"...!?\"\n\nThe name struck like a thunderbolt. Everyone froze. The emperor awaiting death. The dukes watching in anguish. Bain lying broken. Edan with the throne in his grasp. Every head turned toward the corridor entrance.\n\nAnd there...\n\n\"...\"\n\nThe pillar who once held the empire aloft.\n\nThe fallen hero stood scanning the audience chamber with eyes like winter frost.\n\nThe Imperial Guards and Red Knights stared, eyes bloodshot. It was instinct. Every person here had once revered this man.\n\n\"Piaro, I apologize for the abruptness,\" said the figure standing behind the legendary swordsman. \"But we need to save the emperor.\"\n\nThe speaker stepped forward. Black hair. Unmistakable presence.\n\nOvergeared King Grid. His authority filled the corridor like a physical force.\n\nPiaro's killing intent—directed at the emperor with the focus of a drawn bowstring—evaporated like morning dew.\n\n\"Yes, Your Majesty.\"\n\nThe peerless Piaro. One of the empire's greatest heroes. He'd just become a docile sheep at a single word from the Overgeared King.\n\n\"Why is the traitor here?\" Susan moved to block Piaro's path, her blade already drawn. Piaro might have been a great swordsman in the past, but Susan had recently achieved that rank herself. She'd learned magic from the grandmaster. Her skills were formidable. One day she'd surpass even Mercedes.\n\nShe wasn't afraid of Piaro.\n\n\"Torrent of Protection!\"\n\nA pillar of translucent light descended around Susan—the grandmaster's signature buff, dramatically enhancing all stats. She raised her sword toward Piaro—\n\n\"I won't allow it.\" Grid's voice was quiet. Absolute.\n\nThe light surrounding Susan snuffed out like a candle in a hurricane.\n\n\"What—?\"\n\nA hand plow struck her forehead before she could finish the sentence.\n\nNo one in the corridor could stop Piaro. Every agricultural tool in his hands promised violence. The Red Knights, the Imperial Guards—they froze like statues before the fallen hero's advance."
}