{
  "id": 108,
  "title": "Chapter 108",
  "content": "# Chapter 108\n\nYoungwoo's knuckles were white on the steering wheel. He needed to reach the reunion. Now. The debt was gone. The car was real. He could finally shove it in their faces.\n\n*Look at 23. I made it. You can't touch me anymore.*\n\nThe engine roared. The speedometer needle kissed the legal limit. Ten minutes. Still too long.\n\n*But why the hell did they pick a spot on the outskirts?* Public transit didn't reach it. No car meant no attendance. *They were targeting me.*\n\nWithout the paid debt and the 13 series, he'd have been screwed. No friends to borrow from. No buses. Just an expensive taxi ride he couldn't afford.\n\n*Bastards.*\n\nHis foot eased off the accelerator. Ahead, a woman stood beside an open hood, waving for help.\n\nOld Youngwoo would've kept driving. No profit in charity. But the woman's silhouette caught his eye. Even from this distance, the proportions were obvious.\n\n\"That figure...\"\n\nJeans. White t-shirt. Black jacket with zero skin showing. Oversized sunglasses hiding her face. But the white skin, the curves, the ratio? Undeniable.\n\n*Ahyoung burned me, but I'm still human. Can't leave someone stranded.*\n\nHe pulled over beside her. Then froze.\n\nThe car. He'd been staring at the woman so hard he'd missed it. S-model. Company C. Four times the price of his 13 series. Limited anniversary edition for conglomerates only.\n\n*Some rich heiress? Like a drama?*\n\nYoungwoo cleared his throat. Got out.\n\n\"Need help?\"\n\nShe'd have called her insurance already. A car like that? No way she'd risk amateur repairs. He should leave. But she was waving him down.\n\nThe woman removed her sunglasses.\n\n\"I hope you'll give me a ride.\"\n\n\"What?\"\n\nHis heart stopped.\n\n\"Y-Yura?\"\n\nEveryone knew the rankers. Global celebrities. Users joked they knew Satisfy's top ten better than world leaders. Yura topped that list for Korea. Only woman in the top ten unified rankings. The country's last gaming hope. Eastern beauty, Western appeal. Dominated CF contracts internationally. Third on the list of the world's 100 most influential people.\n\nAnd she was here. In front of him.\n\n*This doesn't make sense. South Korea's small, but not this small.*\n\nThe memory hit him. Doran's quest. The conflict. Her interference costing him the completion. The bitter forum posts he'd written afterward.\n\n*She tracked me down.* Cyber forensics. Revenge. With her money and connections, it'd be easy. *No. That's insane. This is reality, not a manhwa. Just coincidence.*\n\nYura smiled.\n\n\"Nice to see you, Grid.\"\n\nHis chest tightened.\n\nShe knew. Not a coincidence. Never a coincidence.\n\n*Revenge. She's here for revenge.*\n\nHe'd seen Blood Witch Yura's cruelty firsthand. His mind raced through possibilities, each worse than the last.\n\n*Should I run?*\n\nYura climbed into his passenger seat without asking.\n\n\"Drive wherever you were heading. I need to talk.\"\n\n\"Right.\"\n\nHe couldn't refuse.\n\n***\n\n\"Where the hell is Shin Youngwoo?\"\n\nLee Junho had terrorized his classmates through high school. Violence. Extortion. Everyone paid tribute. Even seniors and teachers looked away. His two friends, Sim Kiwan and Choi Chansung, weren't exempt from his fists.\n\nMilitary service hadn't fixed him. University hadn't fixed him. Twenty-seven now, bouncing between jobs. PC room attendant. Convenience store clerk. Gas station worker. Each position ending the same way.\n\nThen one day, reality crystallized.\n\n*I'm nothing.*\n\nHigh school had been simple. Throw punches, everyone falls in line. Boys, girls, didn't matter. He'd been king.\n\nSociety didn't care about fists. The students who'd studied got careers. Junho got rejection letters. Companies didn't hire thugs. Every fight meant police stations and settlement payments.\n\nThe gym stripped away his last illusion. Martial arts classes were full of people who'd destroy him.\n\nAnxiety crept in. No job prospects. No marriage prospects. He'd be lucky to avoid starvation in a few years. If he survived, loneliness would finish him.\n\nHe drank. Couldn't sleep without it.\n\nTwo years ago, the alumni reunion saved him. Shin Youngwoo. Debt-ridden. Game-addicted. Pathetic. Junho had found someone beneath him. Someone worse off. At least Junho wasn't drowning in loan shark interest.\n\nLooking at Youngwoo let him breathe.\n\n*I'm better than him.*\n\nMagic. Since that reunion, he'd slept without alcohol. Life was terrible, but bearable. Because Youngwoo had it worse.\n\nNow? Junho's life hadn't changed. Still bouncing between jobs. Late twenties creeping toward thirty. No savings. Convenience store customers got cursed out, requiring settlement payments. Gas station work covered him in oil while his peers drove luxury cars. Manual labor meant working alongside middle-aged men who'd given up on life.\n\nHe needed to change. Knew he should change. But anxiety choked him. The alcohol returned.\n\nHe needed his prescription. Needed to see Youngwoo. Needed to laugh at him with the other alumni. Needed to forget.\n\nThe others felt it too. Maybe Junho had it worst, but they were all anxious. All needed to see Youngwoo.\n\nHeroes High School, 45th graduating class reunion. Lee Junho, alumni association secretary, checked his phone again.\n\n\"Kim Ahyoung. You sure Youngwoo's coming?\"\n\nAhyoung's laugh was sharp.\n\n\"Who knows? With this location, probably not.\"\n\nGarden restaurant. City outskirts. No car meant expensive taxi. Could debt-ridden Youngwoo afford it?\n\nJunho had picked this spot deliberately. Now regret gnawed at him.\n\n\"That pathetic bastard can't even afford a taxi?\"\n\n\"Whoa! Look!\"\n\nAlumni crowded the window. Junho and Ahyoung joined them. A black vehicle rolled into the parking lot.\n\n\"13 series!\"\n\nLimited edition. Eight hundred million won. Junho had seen luxury cars at the gas station. Nothing compared to this.\n\n*Shit. These rich bastards are everywhere.*\n\nMust be some conglomerate's kid. Junho ground his teeth. Ahyoung's eyes gleamed.\n\n*If I marry someone with a car like that, I'm set. When do I meet a guy like that?*\n\nThe car parked. The driver's door opened.\n\nShin Youngwoo stepped out.\n\n\"What?\"\n\nJunho shot to his feet. Youngwoo. Debt-ridden game addict Youngwoo. In that car?\n\n\"No way!\"\n\nStolen. Had to be stolen. The alumni nodded to each other.\n\nAhyoung's mind raced differently. *He paid off the debt? Got a job? It wasn't a lie? But what job pays for a car like that?*\n\nHer thoughts accelerated. *Actually, this works. Youngwoo liked me. No dating experience. Easy to catch. If I make him mine, I'm set for life.*\n\nThe passenger door opened. A woman emerged. Ahyoung's hope shattered. The woman's beauty was undeniable even at this distance. She seemed to glow.\n\nThe other alumni choked.\n\n\"What the—\"\n\n\"How?\"\n\nYura. Unmistakable. Her beauty was its own announcement.\n\n\"This can't be real.\"\n\nUnderstanding failed them. As they stared, Yura leaned close to Youngwoo. From their angle, it looked like a kiss. Moments later, a limousine arrived and took her away.\n\n\"Was that—?\"\n\nTo the observers, it looked exactly like a date ending. Young lovers parting. Imaginations spiraled.\n\n*Youngwoo seduced Yura? She paid his debt and bought him the car?*\n\n*How did they even meet? They live in completely different worlds. Unless... is Youngwoo secretly rich? Playing at being normal?*\n\n*Maybe through Satisfy. They met in-game, got close, brought it to reality...*\n\n*Damn. Should I have played Satisfy full-time instead of working?*\n\nYoungwoo entered the restaurant. He knew they'd witnessed everything. His wave was casual.\n\n\"How's everyone been?\"\n\nSilence. This person looked like Youngwoo but moved like someone else. Someone confident. They stared as he sat down. He lifted a wine glass, extending another toward Junho.\n\n\"Been a while. Drink with me.\"\n\n\"Uh. Yeah...\"\n\nJunho's world tilted. Shin Youngwoo, who'd cowered since middle school, was offering him a drink. As equals.\n\n*This isn't what I wanted.*\n\nRage bubbled beneath his ribs. Youngwoo drained his glass.\n\n\"Come on, drink up. How've you been? Still biting your nails? You're getting old for that habit. Don't you think?\"\n\nJunho snapped. Chair scraping, he grabbed Youngwoo's collar.\n\n\"You bastard! I don't care what happened, stop acting like you're somebody! I'll kill you!\"\n\nOld Youngwoo would've flinched. Gotten angry and afraid. But abilities bred confidence. A man with options didn't shrink.\n\n\"Why so angry? Think about every word you've thrown at me over the years. Every action. You have any idea how much I wanted to do this?\"\n\n\"...!\"\n\nSomething flashed in Youngwoo's eyes. Junho's body moved before his brain caught up. He stepped back.\n\nThe skull helmet. Kesan Canyon. The psychopath who'd beaten him senseless. The same look. The same cold fury.\n\n*Is it him? Was it always him?*\n\nThe madman who'd destroyed the Giant Guild in Winston.\n\nJunho retreated. The wild dog with teeth, now backing away with his tail between his legs. The alumni couldn't process it. This wasn't Shin Youngwoo. This was someone else.\n\nYoungwoo laughed.\n\n\"This wine's good. What're you waiting for? Drink.\"\n\nYears of suffering. Abuse from these people had been his deepest scar. Today, he'd cut it out. The weight lifted. Something settled in his chest.\n\nHe felt different. Clearer. Steadier.\n\n***\n\n*Did I help him?*\n\nEarlier, Yura had leaned in to brush dust from Youngwoo's hair. The angle from the restaurant window made it look intimate. Like a kiss.\n\nYura smiled, thinking of the Yatan Temple. Youngwoo's help then. Her debt. She'd built her reputation on solo achievements. The memory of needing rescue chafed.\n\nShe'd watched Grid since then. Tracked him. This opportunity let her settle accounts.\n\n*We're even now.*\n\n---\n\n**Glossary of Common Korean Terms:**  \n**OG:** [Glossary Link]\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}