{
  "id": 1080,
  "title": "Chapter 1079",
  "content": "The red light from the imperial palace bathed the entire capital in crimson. Even from the outskirts, Grid could see it clearly.\n\n*It looks like a slaughterhouse...* \n\nThe thought slipped out as a muttered exclamation. Fortunately, Basara's retinue was too distracted to notice—or if they did, they had more pressing concerns. All eyes were fixed on the ominous transformation unfolding before them.\n\n\"The sky... the ground... everything's red. What's happening?\"\n\n\"A terrible omen. The 4th Prince has gone mad, and the empire will fall.\"\n\nBasara's retainers voiced their dread. The supernatural phenomenon filled them with foreboding—until Basara's clear voice cut through the panic.\n\n\"That is red energy.\"\n\n\"Red energy?\"\n\nRecognition washed away the anxiety on their faces. Red energy was the symbol of the imperial family, the bloodline's unique power. For those sworn to serve Duke Basara, it was an auspicious force.\n\n\"Red energy can spread this far? His Majesty's power must be far greater than we imagined.\"\n\nEveryone assumed the emperor was the source. After all, his mastery of red energy was unrivaled in this era. But Basara knew better.\n\n*The emperor's red energy has never been this vast. This surpasses even the imperial family's understanding.*\n\nWho, then?\n\nRed energy's defining trait was its influence over matter. Typically, royalty infused it into objects—weapons, armor—to empower their subordinates. The emperor's dominance stemmed from his monopoly on red energy and black mithril.\n\nBut there was another application, one rarely used: absorption. Red energy could drain strength from materials, not just enhance them. The process consumed massive amounts of power, making it inefficient for most purposes.\n\n*Someone with enough red energy to blanket the capital could absorb the properties of everything around them. That would grant transcendent power.*\n\nBasara's expression hardened. The emperor was in grave danger.\n\nHer retainers reached the same conclusion.\n\n\"Why would His Majesty deploy red energy like this? Unless...\"\n\n\"Is the 4th Prince attacking him?\"\n\nThe speculation rippled through the ten thousand cavalrymen. All eyes turned to Basara, waiting for her command. She didn't hesitate.\n\n\"We enter the capital armed. March immediately to the palace and aid His Majesty.\"\n\nSeveral retainers objected—not from cowardice, but loyalty.\n\n\"The imperial guard will block the gates. No matter our intentions, we'll be branded traitors the moment we clash with them. We could save His Majesty and lose everything.\"\n\n\"Your Highness, this is Heaven's opportunity. Don't waste it helping him.\"\n\n\"Exactly! Contact the estate first. Summon the army. When word spreads of His Majesty's crisis, we can march in and claim the capital!\"\n\nBasara stood fifth in the line of succession, second only to the princes in actual authority. Her duke rank and territorial army gave her power that exceeded any individual prince. She was, by all accounts, a viable successor. And she had no intention of refusing the throne—but not like this.\n\n*Too dangerous until I know what the grandmaster is doing.*\n\nUnlike the emperors before her, Basara had no desire to rule through force alone. Not out of weakness, but pragmatism. Coexistence with neighboring kingdoms and ethnic minorities would enrich everyone involved, bringing greater tribute and stability to the empire. Her ancestors had already proven the inefficiency of endless conquest and domination. But would the grandmaster—who had served generations of militant emperors—accept her philosophy?\n\n*He pursues hegemony. That's why he serves the empire.*\n\nOpposing him would be catastrophic. His power, accumulated over decades of service to the imperial family, would easily overwhelm any new emperor. Unless she wanted to be his puppet, Basara needed to understand his intentions before making a move for the throne.\n\n\"No. We help His Majesty. He must remain in place.\"\n\nBasara overruled her retainers, and ten thousand riders surged forward. The ground trembled beneath their hooves. Birds startled from the surrounding hills, scattering into the sky in dark clouds.\n\nAmid the thundering march, Basara called out.\n\n\"Overgeared King!\"\n\nShe'd witnessed the white-haired Grid at the Ruins of the War God—seen enough to recognize him as a master on par with the grandmaster himself. Now she made her request.\n\n\"It will take time for our army to reach the palace. Can you go ahead and help His Majesty?\"\n\nThe request made tactical sense. Grid wanted an alliance between the Overgeared Kingdom and the empire. Saving the emperor would be the fastest route to that goal. As expected—\n\n\"Okay.\" Grid accepted without hesitation.\n\nA bittersweet smile touched Basara's lips. \"You're willing to go alone into an unknown situation... without even a moment's doubt.\"\n\nHer affinity with Grid had already reached its peak. At this rate, if he proposed, she'd be planning their honeymoon.\n\nShe offered genuine advice as Grid began working on something. \"I know you're strong, but be careful. The palace is full of people who can threaten even you. When you arrive, assess the situation first. Only act when you can ensure your safety—don't just rush in blindly to help His Majesty.\"\n\n\"Of course.\" Grid's reply was distracted as he donned a peculiar mask.\n\n**[Berith's Skin Mask]**\n\n**Rating: Legendary (Transcendent)**  \n**Durability: 10/10** *(Cannot be repaired)*\n\n*A mask crafted by Berith from processed human skin.*\n\n*Its flawless construction incorporates Berith's magic of lies and distortion. It disguises not only the face but also body shape and voice, transcending the limitations of ordinary masks.*\n\n*★ You can disguise yourself as anyone you have reasonable understanding of.*  \n*★ You must have exchanged at least 100 words with the target to achieve the necessary understanding.*  \n*★ Higher affinity with the target improves the disguise quality.*  \n*★ Disguise duration depends on your understanding of the target.*\n\n*★ You can only copy the target's appearance and voice. Be extremely careful about your words and actions while disguised.*\n\n*Cooldown: 12 hours*  \n*User Restriction: Level 380 or higher*  \n*Weight: 2*\n\n\"I'm going.\" The voice that emerged was Basara's—pitch-perfect.\n\nThat's right. To move freely through the imperial palace, Grid would pose as Basara herself: a duke and member of the imperial family.\n\nBasara's face flushed. \"This...\"\n\n\"...?\"\n\n\"M-My chest has... grown. Did you stuff it with cotton? Surely even a great demon's magic can't perfectly replicate all parts of the human body?\"\n\nGrid forgot himself, answering without maintaining the disguise. \"O-Of course.\"\n\nHe couldn't bring himself to tell her the truth.\n\n***\n\nThe capital, Titan, was the empire's beating heart—a magnificent city showcasing the realm's wealth and power. But the red-stained Titan Grid entered now was something else entirely. Knights on horseback thundered down the main roads. Soldiers with drawn swords prowled every alley. Signs of battle scarred the streets, and several aristocratic mansions burned unchecked. Displaced citizens huddled in corners, weeping.\n\nPure chaos.\n\n*It's a warzone.*\n\nAs Basara had feared, this was a dire situation. Grid needed to hurry. This was the perfect opportunity to help the emperor and gain his favor. He was also worried about the dukes who'd gone ahead to meet with the emperor.\n\n\"Isn't that Duke Basara?\" Knights searching the area spotted Grid's disguise and dismounted respectfully.\n\nGrid adopted an imperious tone. \"Are you searching for the rebel Edan?\"\n\n\"Yes, Your Grace!\"\n\n\"What's happening at the imperial palace?\"\n\n\"We apologize, Your Grace—we don't know. The red light burst out suddenly, and we're concerned, but... two dukes and the Five Pillars are there. We dare not question or worry.\"\n\n\"I see. Carry on.\"\n\n\"Yes, Your Grace!\"\n\nThe knights hurriedly cleared a path. Grid sprinted past them toward the palace.\n\n*No matter how I look at it, that son of a bitch Edan is behind this.*\n\nThe pieces fit: Edan had evaded the soldiers' search and infiltrated the palace to attack the emperor. The emperor had unleashed his red energy in response, blanketing the capital. Grid could deduce that much easily enough.\n\nThe question was whether Edan could actually harm the emperor. As the knights said, the emperor had the Five Pillars' protection. Grenhal and Morse were also present. Above all, the emperor himself was the strongest warrior in the empire. Even if Edan had received some cliché villain power-up, breaking through those defenses seemed impossible.\n\n*Which means I need to hurry.*\n\nThe situation probably wasn't resolved yet, but if Grid didn't arrive soon, he'd miss his chance to earn the emperor's gratitude. He accelerated.\n\nUnfortunately, this female body was... awkward. Long limbs were fine, but the wide hips and bouncing chest threw off his balance completely. He could grab them to stabilize himself while running, but he worried about being seen—and felt guilty toward Basara.\n\n*...Screw it.*\n\nShould he really worry about minor details in such a crisis? Grid grabbed his chest and ran full speed. The sensation transmitted through his palms was... \n\nWell. Let's skip that.\n\n***\n\n*This is worse than I thought.*\n\nThe palace interior was more catastrophic than the capital. Blood painted every corridor and pillar. The groans of dying soldiers echoed like a funeral dirge.\n\n\"D-Duke Basara...\"\n\n\"The Red Knights... they betrayed...\"\n\n\"His Majesty is in danger...\"\n\nThe soldiers who spotted Grid coughed up blood as they spoke. Grid absorbed the information and equipped the Ideal Dagger, activating Quick Movements.\n\n*The emperor couldn't stop the Red Knights. He's been hit.*\n\nThe Red Knights' skills weren't ordinary. When the single-digit knights worked together, they could match the dukes in combat power. Add in their numbers, plus Edan's magic machines, and even the Five Pillars and dukes would struggle to stop them.\n\nWhich meant this was Grid's opportunity.\n\nHe accelerated through the corridors. His transcendent senses guided him forward. As he neared the audience hall, he could hear it—the friction of metal, explosions, the clash of weapons. Grid checked his status as Quick Movements expired.\n\n*Perfect.*\n\nOnly Quick Movements was on cooldown. All other skills were ready. Health and mana topped off. Stamina barely touched.\n\n*Before the Five Pillars can wipe out the Red Knights, I'll break through and make a vivid impression on the emperor.*\n\nGrid's plan crystallized. He removed the skin mask—no need to expose its existence to the emperor or the Five Pillars. Besides, he needed to reveal his identity. When they asked how he'd reached the palace, he could mention the dukes and frame everything in the most positive light possible.\n\nHe closed in on the sounds of combat.\n\nAt the end of the long corridor, knights in red armor came into view. So far, so expected.\n\nThen he saw Grandmaster Zikfrector and Chensler—fighting *each other*.\n\nTwo members of the Five Pillars, battling one another.\n\n*What?*\n\nWas one of them on Edan's side? Or was this some momentary disagreement? Grid's confused gaze reflexively turned toward the audience hall.\n\nThat's when he saw it.\n\nEdan's sword, pointed directly at the emperor. Grenhal and Morse sprawled messily on the ground. Bain, another of the Five Pillars, covered in wounds.\n\n*Did Edan do all this?*\n\nUnderstanding the situation didn't matter right now. He had to save the emperor—immediately. For the alliance to work, the emperor who favored the dukes needed to survive.\n\nBut how?\n\nGrid was daunted by the battle between the grandmaster and Chensler raging in the corridor. Those two monsters—beings he didn't think he could defeat even with Blackening activated—blocked the path to the audience hall.\n\n*Braham, any chance you'll wake up?*\n\nHe called out anxiously, but received no answer. Braham, having fallen into deep sleep, clearly wouldn't be rousing anytime soon.\n\n—Grid! Don't interfere!\n\nA whisper message flew at him.\n\nThe sender: Zibal. Grid's gaze snapped to where Zibal stood with his Riders. Then his face filled with frustration. Even if he broke through the Five Pillars and the Red Knights, there were still the magic machines to contend with.\n\n\"**Knight Summoning!**\"\n\nGrid summoned Piaro. He was convinced he needed to play his strongest card. He also remembered that Piaro had connections to the empire.\n\n\"Piaro!\"\n\n**[Your knight 'Piaro' has arrived at your side.]**\n\nThe notification appeared instantly. Grid stared at Piaro's back, the legendary farmer having responded immediately to his call.\n\n*Piaro won't die.*\n\nHe'd make certain of it. The determined Grid issued his command before everyone present.\n\n\"Piaro, I'm sorry, but we need to save the emperor.\"\n\nHe won't be willing. He'll hesitate. That's what Grid expected.\n\n\"Yes, Your Majesty.\"\n\nTo Grid's surprise, Piaro agreed immediately. He drew a hand plow from among the various farming tools hanging at his waist and charged down the corridor.\n\n\"Piaro...!\" The Red Knights cried out. Not one dared block his path.\n\nExcept for one person.\n\n\"Damn it! Don't interfere!\"\n\nOnly the player Zibal summoned his magic machine, positioning it at the entrance to the audience hall. The giant, majestic machine scraped the high ceiling as it thrust a pillar-like spear at Piaro.\n\n\"**Free Farming 2nd Style. Super Growth.**\"\n\nA soybean plant erupted through the floor instantly, intercepting the attack. Not only did it block Raiders' spear—vines sprouted, binding the magic machine's arms and legs. Zibal stared at the immobilized Raiders, face going pale.\n\n\"This is insane!\"\n\nZibal had been beaten by Piaro before. 'Reidan's crazy farmer' had been imprinted in his mind as an unstoppable force. But he'd forgotten—distracted by witnessing the battle between the grandmaster and Chensler. Shortly after seeing their clash, Zibal had felt relatively relaxed, even fearless, facing Piaro again after so long.\n\nThis was the result.\n\nEvery second of operating time was precious. Raiders had been tied up for three full seconds. More than enough for Piaro to break through. He'd already entered the audience hall and stopped Edan from executing the emperor.\n\nSaharan's sword met a sickle. Piaro's appearance—unchanged since he'd left the empire—shocked Edan and the dukes alike.\n\n\"You became a legend... broke your shackles...\" Emperor Juander's voice echoed through the hall, bitter and filled with complex emotions.\n\nMeanwhile, Grid...\n\n\"Impressive. You infiltrated this far with such ease?\"\n\n...found himself confronted by the grandmaster.\n\nUnlike the tense Grid, the grandmaster was smiling. \"Such talent. I'm becoming more and more excited.\"\n\n\"What do you want from me?\" Grid was in no position to act aggressively.\n\nAsmophel, Mercedes, Noll, Jude, and the 10 meritorious retainers were available—but he had to be cautious about summoning them all. Asmophel and Mercedes were escorting the previous generation of Red Knights and weren't suitable to call. Noll was a different species entirely; bringing him out might antagonize the emperor. Jude was too weak. Most importantly, Grid could only guarantee one person's survival. He only had one White Peach.\n\nGrid decided to engage the grandmaster, who seemed interested in him, and probe the situation further.\n\n\"Tell me. What do you want from me?\" Grid repeated.\n\n\"Won't you become the emperor?\" The grandmaster returned a question of his own.\n\nIn that instant, Grid understood.\n\nAll of today's events—every single thing—had been orchestrated by the grandmaster."
}