{
  "id": 1081,
  "title": "Chapter 1080",
  "content": "\"Would you accept the throne?\"\n\nThree years of military service could turn a housecat into a tiger—or so the old saying went. Grid had learned to read the currents of battle in the subtle shifts of soldiers' postures. After years alongside Lauel, parsing the strategic landscape had become second nature.\n\n\"You betrayed the emperor,\" Grid said flatly. \"You've chosen Prince Edan.\"\n\n\"'Betrayal' is the wrong word.\" Zikfrector's tone remained measured, almost paternal. \"I'm merely exercising a right long owed to me.\"\n\n\"What right?\"\n\nThe grandmaster studied Grid with an expression that bordered on approval. \"Centuries ago, a man came to me with an offer. He asked me to make him emperor. In exchange, he promised to fulfill my heart's deepest desire.\"\n\nGrid's eyes narrowed. \"Saharan.\"\n\n\"Yes.\" Zikfrector's gaze drifted toward the audience hall, where Piaro and Edan clashed amid the impossible farmland sprouting through marble floors—a side effect of Piaro's Free Farming technique. \"I fulfilled my part. He became emperor. But coincidentally, he failed to keep his end of the bargain. That debt was to pass to his descendants. Yet time eroded memory, and the imperial family forgot their obligation.\"\n\nHe gestured toward the prince. \"That sword Edan wields is the token of Saharan's promise—a blade infused with his own red energy, which hastened his death. Saharan told me that if his line ever broke faith with me, I could prove my right to the throne with that very weapon. He even laid the groundwork, establishing policies that would allow my ambition to be realized.\"\n\nGrid cut through the exposition like a blade. \"Who are you?\"\n\nThe question landed like a thunderclap.\n\nEvery head in the hall turned. They'd all been wondering about the grandmaster's mysterious desire—that would reveal his identity. But Grid had skipped straight to the core. It wasn't the tactful approach. The grandmaster would never answer such a—\n\n\"...\" Zikfrector paused, genuinely caught off-guard. He'd expected questions about his desire, not this direct challenge.\n\nGrid shrugged. \"If I'm to become emperor and grant your wish, I need to know who I'm dealing with. I don't make bargains with strangers.\"\n\n\"Kukuk...\" A laugh escaped the grandmaster—low, genuine, and utterly rare. Even the emperor, who'd known Zikfrector for decades, had never heard him laugh before.\n\nThe humor faded, leaving only profound sorrow in those ancient eyes. \"The sole sinner among the Seven,\" he said quietly. \"The incarnation of the betrayer who, blinded by the light, turned away from his companions drowning in darkness. That is what I am.\"\n\nLightning struck inside Grid's mind.\n\n*The Seven Malignant Saints.*\n\nGrid knew the legends—beings who had challenged the gods themselves for humanity's sake, only to be sealed in the void between surface and hell. But an *incarnation* of one? Here, now? The revelation froze him in place while others scrambled to process the cryptic exchange. Few people alive understood the true history of the Seven Malignant Saints. None present could follow the thread of this conversation.\n\nZikfrector continued, his voice heavy with centuries of regret. \"I sought to atone for my sin. I worked tirelessly to overcome the crushing boredom that came with my curse—extending this mortal shell to transcendent levels just to buy myself time. I researched endlessly, trying to discover how to save the incarnations of my fellow saints, those who lost their chance at reincarnation after defying the gods. The experiments on other races, the pursuit of demonic byproducts, my obsession with the evil eye... all served that single purpose.\"\n\nHe paused, jaw tightening. \"Despite all my effort, I made no real progress. The curse of sloth ensured I failed at every critical juncture. But I learned something vital: my companions' greatest mistake was refusing to seek help from the *expelled* gods.\"\n\n\"The expelled gods?\" Grid's confusion deepened. Around him, unease rippled through the gathered nobles. No one had yet connected the grandmaster to the Seven Malignant Saints, but more and more were realizing he'd never been human to begin with.\n\nZikfrector leaned closer, lowering his voice to a whisper meant only for Grid. Frustration bled through his words. \"When I discovered you possess Taren's power, I felt hope for the first time in centuries.\"\n\nGrid said nothing.\n\n\"The answer lies in the Abyss.\" The grandmaster's whisper became urgent. \"Become emperor. Explore the Abyss and find the expelled gods. Only through the Second War of the Seven Evils can we save this world from the gods who have fallen to corruption.\"\n\nA notification flared in Grid's vision:\n\n[★Hidden Quest★ The Sixth Evil's Proposal has occurred!]\n\n[The Sixth Evil's Proposal]  \n[★ Hidden Quest ★  \nZik, the Sixth Evil cursed with sloth, offers you the throne of the Saharan Empire.  \n  \nQuest Clear Condition: Accept Zikfrector's offer.  \nQuest Clear Rewards: The Saharan Empire.]\n\n[Would you like to accept the quest?]\n\nGrid had completed hundreds of hidden quests. He'd never seen one with stakes this high—an entire empire as the prize.\n\nHis answer came without hesitation.\n\n\"No.\"\n\nZikfrector reeled as if struck. He'd laid bare truths kept secret for ages. Refusal hadn't even entered his calculations.\n\nGrid pressed on. \"If I took the throne, every noble in the empire would rebel. How am I supposed to handle that? I don't have the experience to rule a nation this size, and I certainly don't have the manpower. Wars would erupt across the continent. By the end, the empire would shatter into a dozen squabbling kingdoms, and my own realm would be dragged into the chaos. I'd lose everything.\"\n\n\"You misunderstand.\" Zikfrector shook his head, frustration mounting. \"Managing the empire is irrelevant. Your focus should be the Abyss—\"\n\n\"What you want is none of my business,\" Grid interrupted. \"Look, I respect what the Seven Malignant Saints tried to do for humanity. That doesn't mean I'm ready to sacrifice everything for your cause. I won't tie myself to conflicts with the gods. I learned that lesson during the Crossroad of Good and Evil and the Hexetia incident. I'm staying neutral.\"\n\nGrid pivoted toward the emperor. \"Your Majesty! I stand with you!\"\n\n\"You would turn away from the truth?\" Zikfrector's face twisted with rage.\n\nGrid held up his hands. \"I'm not trying to make an enemy of you! I just want to stop Prince Edan's treason—\"\n\n\"Sophistry.\" The grandmaster's expression became demonic. \"Edan is my agent. Opposing him means opposing me. You understand this, yes?\"\n\n\"Ah...\" Grid's stomach dropped.\n\nThis was bad. The empire's stability mattered immensely to his plans, but could he really afford to antagonize an incarnation of the Seven Malignant Saints? Even diminished, even cursed, the grandmaster's power likely exceeded anything Grid could handle. The thought of that battle made his blood run cold.\n\n\"Shut your mouth, Zikfrector!\"\n\nEveryone turned. Prince Edan had just demolished Piaro's latest defense, and now he rounded on the grandmaster, eyes blazing crimson. \"You were ready to discard me the moment a better option appeared! You call me your agent? Then maybe you should *consult* me! I'm not your puppet!\"\n\nThe air pressure changed.\n\nSaharan's sword ignited with power that dwarfed anything Edan had shown before. The blade's edge cracked Piaro's sickle—forged from Belial's own demonic byproducts—like cheap pottery. All the strength the sword had absorbed from across the capital now manifested at once, a force great enough to overwhelm even Piaro, who had yet to achieve his next breakthrough in Natural State.\n\nIn that moment, riding his fury, Prince Edan posed a genuine threat to Zikfrector himself.\n\n\"I'll kill you first, Zikfrector!\"\n\n\"What—\"\n\nThe prince launched himself at the grandmaster.\n\nGrid's eyes widened. He seized the opportunity, diving away from his position as the two clashed. Saharan's sword met the grandmaster's blade in an explosion that tore through the palace structure. The shockwave sent imperial guards and Red Knights tumbling like toys.\n\n\"Damn it!\"\n\nEven Grid's ridiculous luck couldn't save him from a stone shard that flew through the collapsing corridor straight into his mouth—\n\n\"Grab on!\"\n\nChensler burst through the chaos, extending his hand. Grid seized it without thinking, too distracted by Edan's rampage to worry about controlling his grip strength.\n\n\"Hnng...\" Chensler's face flushed, but he held firm against the unexpected sensation. \"People have... different preferences... I'll respect that...\"\n\n\"...?\" Grid had no idea what the man was talking about, but this wasn't the time for trivial matters.\n\nChensler hauled Grid into a side chamber where Piaro had retreated. The emperor stood waiting, and as Grid approached, the ruler of the Saharan Empire—master of the West Continent—bowed low.\n\n\"Thank you.\"\n\n\"Y-Your Majesty?!\" Chensler gasped.\n\nThe emperor of the greatest power on the continent, bowing to the king of a fledgling kingdom? Even the dukes, despite their maximum affinity with Grid, looked stunned. Grid himself couldn't believe it.\n\nBut the emperor's gaze had settled on Piaro. \"King Grid, you may not know this, but I've been grateful to you for some time. I've carried guilt every day for failing to stop the war against your kingdom.\"\n\nRelief flooded through Grid. His hopes for harmony with the empire hadn't been in vain after all.\n\n\"We don't know how long Edan's madness will last!\" Duke Grenhal shouted. \"When he regains his senses, he'll come for you first, Your Majesty. You must escape!\"\n\nNow, while Edan kept Zikfrector occupied—it was the perfect window. Yet the emperor hesitated.\n\n\"To abandon my throne and flee... the entire world will mock me.\"\n\nEven facing death, he worried about his image. While Grid burned with impatience, Chensler took a diplomatic approach.\n\n\"Prince Edan cannot maintain that level of power indefinitely. He'll collapse soon. Before that happens, we need to wear down the grandmaster as much as possible. If we scatter our forces now, we'll waste our strength.\"\n\n\"Still...\"\n\n\"Your Majesty, don't miss this chance to eliminate the traitors.\"\n\n\"...Very well.\"\n\nThe emperor's pride finally yielded.\n\nTogether, they began their escape: the emperor, the two dukes, Bain, Chensler, Piaro, and Grid. The secret passage they entered had been known only to emperors for generations, its existence passed down through the royal bloodline alone."
}