{
  "id": 1082,
  "title": "Chapter 1081",
  "content": "[You are the first player to discover the 'Imperial Palace's Secret Passage'!]\n\n[Your achievement of discovering the last retreat of the emperor is truly remarkable!]\n\n[You have received the 'Imperial Palace's Blueprint' as a first discovery reward!]\n\n[The Great Robber of the Red Night is interested in you. Watch out for red nights.]\n\n**[Imperial Palace's Blueprint (Central Section)]**\n\n**Rating: Legendary**\n\n*The imperial palace of the Saharan Empire stands as one of history's finest buildings, designed by the greatest architects and dwarves. There are nineteen blueprints in total, but the central section contains the most concentrated technical mastery. These blueprints form the foundation for teaching supreme architectural skills.*\n\n**Acquisition Effect:** Opens the craftsman-grade Architecture skill. Understanding of the imperial palace's structure increases by 10%. Permanently increases the probability of creating historic buildings.\n\n**Learning Conditions:** Architect class.\n\n**Weight:** 0.1\n\n---\n\nGrid stared at the notification, mind reeling.\n\nThe Seven Malignant Saints...\n\nSaharan...\n\nThe expelled gods...\n\nAfter learning the truth about the grandmaster's identity and ambitions, the flood of information threatened to drown him. He forced his gaze to focus on the passage surrounding him. Night stones lined the walls at meter-long intervals, casting soft light through the vast corridor. Only emperors knew of this place. The most secret location in the world.\n\nAnd Juander had brought him here.\n\nThe weight of that trust settled on Grid's shoulders. You didn't earn this level of confidence by saving someone's life once. The Emperor had known for years that Piaro lived. He must have viewed Grid as a benefactor from the moment he learned the truth—grateful for the slight easing of his guilt. Without Grid's intervention, Piaro would still be wandering the continent, or more likely, dead. Juander had assumed the worst: death or permanent crippling.\n\n*But Piaro saved me just as much.*\n\nBitterness flooded Grid's chest as he understood the Emperor's heart. Just as Piaro might have remained less than human without Grid, Grid would never have become what he was without Piaro. He'd still dismiss the importance of control, unable to overcome the crises that came his way. No—he wasn't Piaro's one-sided benefactor.\n\nPiaro was *his* benefactor. They'd encouraged and inspired each other. Friends who stood together, naturally.\n\nWhich was exactly why—\n\n*Piaro followed my unjust command without a single word of protest.*\n\nThe Emperor's feelings toward Piaro didn't matter. From Piaro's perspective, Juander was an unforgivable enemy who deserved death a hundred times over. The Emperor had destroyed Piaro's family, his comrades. He'd taken everything.\n\nYet Piaro had swallowed his rage. When every fiber of his being screamed to run forward and hurt the man responsible, he'd saved him instead—because Grid commanded it. How much pain must he be hiding beneath that calm exterior? Grid's heart clenched with sorrow and guilt.\n\n*And Kasim...*\n\nThe disciple of Lantier. Doran's friend. Teacher to both Faker and Lord. The last survivor of the Nero people had lost everything because of the Empire. His family, friends, colleagues—his entire nation and culture, erased.\n\nPiaro's grudge was focused: the foolish Emperor and the evil Empress. Asmophel resented the Empress and the Yatan Church. But Kasim? Kasim hated the Empire *itself*. Grid had once leveraged that hatred, promising revenge to secure Kasim's full commitment.\n\nNow everything had changed. Grid sought unity with the Empire, not hostility. Kasim understood his lord's position and endured, but patience had limits. Eventually...\n\nThe greatest obstacle to harmony with the Empire wouldn't be the nobility or the military.\n\nIt would be Kasim.\n\n*An imperial apology won't solve this.*\n\nUnless the Empire itself transformed, Kasim would never forgive. If the Empire didn't change... If Kasim's hatred remained...\n\nWhat choice would Grid make then?\n\n\"Ugh.\"\n\nA groan cut through Grid's spiraling thoughts.\n\nSaharan's sword had absorbed power from every material composing the capital. Edan's explosive assault had left Piaro stunned, but consciousness was finally returning.\n\n\"Piaro!\"\n\n\"Sir Piaro!\"\n\nGrid and the dukes rushed to support him. The Emperor remained motionless. He lacked both the right and the courage to help.\n\n\"Your Majesty...\" Piaro's gaze found Grid immediately. \"Are you safe?\"\n\n\"Of course.\"\n\nThat look—filled with loyalty and infinite affection—struck Juander like a blade to the chest. Those eyes had once been directed at *him*. Now they belonged to someone else entirely. He was grateful Piaro lived, yes. But seeing him like this? Shame burned through the Emperor's core. When had he become so selfish? Since ascending the throne and drowning in privilege? He turned away, disgusted with himself.\n\nThe man who lost everything because of his ignorance...\n\nJuander couldn't meet his gaze. Couldn't bear to witness Piaro belonging to another. His head dropped, strength draining away.\n\n\"Your Majesty.\" Chensler's voice rang out. Blood seeped from the wounds the grandmaster had carved into his body, but he forced himself to kneel on the cold stone floor anyway. \"This subordinate risks his life to make a request.\"\n\nThe Emperor looked up.\n\n\"Apologize to Sir Piaro.\"\n\nChensler was the last true loyalist. Even if Juander were stripped of his crown, Chensler would sacrifice everything for him. Which gave him the authority to speak plainly. \"Your Majesty is supreme. No one dares to punish Your Majesty—so Your Majesty must be strictest upon yourself. Take responsibility for the sins you've committed. Ask Sir Piaro for forgiveness.\"\n\nChensler had witnessed everything. The Emperor's shock upon hearing of Piaro's supposed betrayal. The sleepless nights before ordering Piaro's family executed. The devastation when the truth emerged. He'd watched it all unfold. Which was why he pushed now. The Emperor could only move forward if he sought Piaro's forgiveness.\n\nJuander hesitated. His heart screamed to run to Piaro and fall to his knees. But would a few words of apology earn forgiveness? Of course not. Piaro wouldn't forgive him. He wouldn't forgive himself if their positions were reversed.\n\nThe shock of losing Empress Aria... In the end, it was just an excuse. The grandmaster had been right. No excuse could justify betraying a trusted friend.\n\nSince forgiveness was impossible, apologizing meant severing their relationship forever. Better to avoid the confrontation. Better to ignore the irreversible sins.\n\n\"Your Majesty...\" Chensler's sigh carried profound disappointment.\n\nHe'd hoped—prayed—the Emperor might show courage in facing his mistakes, even knowing he'd be cursed. Only then could Juander become a better ruler, which would help end the royal family's current crisis. But the Emperor lacked that courage.\n\nSadness washed over Chensler. Still, he didn't blame or criticize. He understood. The greater the sin, the harder to face the one you'd wronged.\n\nMeanwhile, Piaro turned away from the Emperor as well. That familiar silhouette standing a short distance away, holding his breath...\n\nPiaro refused to look at the betrayer he'd hated every moment since that terrible day. If their eyes met, he'd break down. For revenge to succeed, he couldn't even exchange glances...\n\nHe focused on Grid instead, pouring all his attention into his lord. His shaky gaze broke Grid's heart, but Grid had no words of comfort to offer.\n\nThe heavy silence strangled the air. They waited for the sounds of battle from the audience hall above to fade. Then Grid's eyes widened.\n\n\"Ah—! Duke Basara!\"\n\nEveryone stared at him, bewildered.\n\n\"Duke Basara is leading soldiers to the imperial palace!\" Grid's words tumbled out in a rush.\n\n\"Basara?\" The Emperor reacted first, understanding immediately. To save him, Basara was advancing on the palace without waiting.\n\n*She's better than my own children...*\n\nBasara possessed true talent. Her red energy had a weaker influence on matter than his, but it gave vitality to life. The troops she led knew no fear. Other nobles became gentle sheep in her presence. Her red energy—which perceived the essence and condition of matter and guided it toward beneficial outcomes—resembled Mercedes's insight.\n\nHer father had surrendered the throne to Juander's father, who'd prepared to purge all blood relatives. That sacrifice allowed Juander to inherit the crown. If *she* had inherited instead...\n\n*Aria and Piaro would never have suffered. The Empire would have enjoyed peaceful reign.*\n\nThe enlightened Emperor's gaze shifted to Grid. The young king was struggling against the dukes and Piaro as they tried to restrain him.\n\n\"Let me go! I have to save Duke Basara!\"\n\n\"Enough, Your Majesty! That place is dangerous!\"\n\n\"Duke Basara doesn't know what's happening at the imperial palace right now! She'll die if she gets caught between the grandmaster and Edan!\"\n\n\"Duke Basara is wise. She won't be hit easily—she'll manage on her own!\"\n\n\"Your Majesty, you could die if you go out there!\"\n\n\"Oh, you—! I'll resurrect even if I die!\"\n\nGrid struck at the dukes' restraining hands, but he couldn't break Piaro's iron grip. The power and will in those hands far exceeded Grid's own.\n\n\"Your Majesty.\" Piaro's deep eyes locked onto Grid's. \"I know you're an immortal blessed by the gods. Even if you lose your life, you'll smile and live again.\"\n\n\"Yes, so let me—\"\n\n\"However.\"\n\nGrid froze.\n\n\"My heart is torn.\"\n\nSilence.\n\n\"Do you think I don't know the price you pay for resurrection? The damage you suffer? The pain you endure? You're human. You feel the same pain as me. Don't grow accustomed to dying.\"\n\n\"Piaro...\"\n\n\"As long as my eyes remain open, Your Majesty cannot die. I would rather die myself.\" Piaro's grip shifted, preparing to leave. \"I will save Duke Basara.\"\n\n\"Wait—\"\n\nNo, this was absurd. Grid barely managed to grab Piaro before he could depart. Then a completely unexpected voice cut through the chaos.\n\n\"I will go.\"\n\nEveryone turned.\n\nEmperor Juander stood tall. For the first time since entering the passage, he looked directly at Piaro. Their eyes met. The Emperor calmly accepted the gaze filled with hatred.\n\n\"A knight who met the wrong master and lost everything.\"\n\n\"...Shut up.\"\n\n\"A friend betrayed by the friend he shouldn't have trusted.\"\n\n\"Shut up!\"\n\n\"I deeply apologize.\"\n\n\"*Shut up!*\"\n\nPiaro seemed feverish, blocking his eyes as he shouted. Tears poured from beneath his hands. The hand gripping his plow trembled violently. The Emperor bowed deeply, then glanced at Chensler and Bain.\n\n\"Don't follow.\"\n\n\"My place is by Your Majesty's side.\" Chensler's voice was firm.\n\n\"I cannot let Your Majesty the Emperor die.\" Bain stepped forward.\n\nThey violated the imperial order—a deeply disrespectful act. The Emperor laughed.\n\n*Step. Step.*\n\nHe passed Piaro, who stood frozen with his plow raised but unable to strike. He stopped before the dukes.\n\n\"I name Basara as my successor. You must survive and bear witness. Help her well.\"\n\n\"Your Majesty!\"\n\nThe Emperor said nothing more. He passed the dukes and stood before Grid.\n\n\"Overgeared King. I understand now. I am the root of all this misery. I made everyone unhappy.\"\n\n\"That's—\"\n\n\"I have four children. Like his parents, my youngest Edan has made an irreversible mistake. I will take him with me. But the other three cannot be held responsible.\"\n\nGrid remained silent.\n\n\"The first is like his mother—weak but clever. The second resembles his father—incompetent and greedy. The third walks the wrong path in rebellion against me.\"\n\nStill Grid said nothing.\n\n\"Please, Overgeared King. Guide my children correctly. If the new emperor tries to purge them... I hope you can offer a little protection.\"\n\nThe Emperor believed he'd earned the right to ask this favor. Grid hadn't forgotten Juander's grace in sending him Mercedes.\n\n\"...I understand.\"\n\nThe Emperor left the secret passage, his mood strangely peaceful. The space made for emperors held no emperor now.\n\nA world message emerged.\n\n[An unknown person is writing the second epic.]\n\n[The beginning of the epic comes from the underground passage dyed with the light of night stones.]\n\nGrid felt an intense rush of emotion.\n\n[He silently watched the back of the Absolute for the last time.]"
}