{
  "id": 1083,
  "title": "Chapter 1082",
  "content": "**[An unknown person is writing the second epic.]**\n\n**[The beginning of the narrative comes from the underground passage bathed in the glow of night stones.]**\n\n\"Grid...?\"\n\n\"It's Grid?\"\n\nEveryone recognized the unknown author immediately. Grid's epic had become so legendary that even people who'd never touched Satisfy knew the story.\n\n**[He silently watched the Absolute's back for the last time.]**\n\n\"Shit...!\"\n\nScattered across the kingdom, the ten meritorious retainers froze when they saw the cascade of world messages. They all understood—Grid's epic only progressed during watershed moments in human history.\n\nThese notifications, appearing right after Grid left for the imperial palace with Basara, meant he'd been caught up in something catastrophic. The Absolute had to be the emperor. If the emperor was in mortal danger, Grid was walking into a bloodbath.\n\nLauel's message flashed across the guild window: **[All knights of Grid, prepare for summoning.]**\n\nGrid had appointed few players as his personal knights—mostly the core members of the ten. Lauel's follow-up came immediately: **[Drop everything. I don't care where you are or what you're doing. When Grid summons you, answer. Nothing matters more than keeping him alive.]**\n\nThe warning was unnecessary. They'd already made that decision. When your closest friend walked into hell, you followed without question. The ones deep in distant territories after weeks of travel, the ones fighting monthly raid bosses, the ones halfway through once-in-a-lifetime hidden quests—\n\n*Grid, call us. Call us now!*\n\nAll of them waited with the same desperate hope.\n\n***\n\n*Watching the Absolute's back for the last time...*\n\nThe system's words could only mean one thing: the emperor's death was imminent. Perhaps \"last\" didn't necessarily mean death, but Grid's instincts told him otherwise. The emperor was about to face someone equal to or stronger than Garam—no, the Grandmaster was a living incarnation of the Seven Malignant Saints, which meant he eclipsed even Garam. Meanwhile, Edan wielded the Founding Emperor Saharan's sword, a blade deified by the empire's people for centuries.\n\nFor the emperor to appear before these enemies was suicide. Yet Grid didn't stop him.\n\nThey shared a tenuous connection through Mercedes, but that was all. Their relationship existed almost entirely at arm's length. Piaro's shadow loomed between them, yes, but beyond that? Nothing. Different births. Different worlds. Different lives. No personal bond whatsoever. If anything, they were adversaries. Grid feared the emperor. To the emperor, Grid was merely an individual who needed to be managed.\n\nThey existed to eliminate each other.\n\nGrid had no right to stop the emperor. No reason to.\n\nSo why did grief take root in his chest?\n\n*The emperor dying would be better for everyone.* The thought was logical, cold, *correct*. If Juander fell, Grid and Basara would survive. Basara would claim the throne. She *needed* to claim the throne—it would solve everything. Create the harmony Grid desperately wanted. His rational mind knew this with crystalline clarity.\n\nThen why? Why this ache? When had he started caring about the emperor?\n\nConfusion clouded Grid's thoughts before understanding struck.\n\nEmperor Juander possessed absolute power. Anything he wanted, he could take. Any flaw, he could conceal. Yet he chose otherwise. He turned away every beauty in the empire and loved only one woman his entire life. He carried the weight of an old friend who'd lost everything because of his sins. He repaid a foreign king's grace by sending his most loyal knight. Even now, facing oblivion, he worried about his children.\n\nThe emperor valued connections above all else. The Grandmaster had mocked him for it. Edan and Benoit had condemned him as incompetent. Perhaps he'd committed sins born from ignorance, perhaps he truly was an inadequate ruler.\n\nBut Emperor Juander was never wicked. He was a fool who couldn't be corrupted even if he tried.\n\nThat's why Grid felt this pull. He recognized something of himself in the man.\n\n**[The last of the Absolute, a pilgrim walking the path of atonement—he sacrificed himself to answer for his sins, refusing to hide from them.]**\n\n\"My choice today will be a model for the next generation.\"\n\nHad he ever imagined being driven from his throne by his own son? The emperor straightened his crooked crown and brushed dust from his blood-stained cloak. The hand that once caressed his beloved Aria's cheek now gripped a sword. The hand that had stroked Marie's hair now held a shield. Shadow fell across the face that had smiled while watching his children grow, but his eyes blazed with the will to extinguish that darkness.\n\nStanding before the exit to the audience hall, the emperor turned to Grid. \"The emperors who follow me won't repeat my mistakes.\"\n\nThey would learn from his failure. Of course he couldn't protect the throne—that chance died when his vision clouded and he committed irreversible sins. But the future emperors who studied foolish Emperor Juander would remain vigilant. They would be wise where he was blind.\n\nThe emperor believed this as he opened the door.\n\nSaharan's red energy flooded through, revealing the secret passage's interior.\n\n\"*Emperor!*\" Edan's voice erupted like a beast's roar. Combat sounds followed—groans, but no bodies falling. The emperor, the two dukes, Edan, the magic machines, the Grandmaster, the Red Knights—all of them held their ground. They knew this was the decisive moment.\n\n**[The Absolute knew his blood wouldn't wash away his sins.]**\n\n\"Your Majesty!\" Basara's voice cut through the chaos. Everything was happening too fast. She'd be in danger. Grid tensed, preparing to rush into the audience hall.\n\n\"Basara! You must survive and lead the empire to prosperity!\"\n\nThe vibration—was that Origin True Energy? The emperor's red energy exploded beyond anything Grid had witnessed before. Edan cried out. Simultaneously, Basara's slender body flew backward into the passage.\n\n**[However, the Absolute sacrificed himself at the end. His blood might not wash away his sins, but he hoped to send ripples through the empire's decaying history for generations to come.]**\n\n**[It was his hope that no sinner like himself would ever be born again...]**\n\n**[A fool who understood that one Absolute could plunge countless lives into misery.]**\n\n\"Duke Basara!\"\n\nGrid and the dukes rushed to where Basara lay. The exit was sealing itself. She scrambled from their hands and threw herself at the door, but too late. Her fingers clawed at the stone.\n\n\"Your Majesty!\"\n\nBasara's mind plunged into memories from decades past. Young Juander's brilliant smile. She'd loved seeing that sunny expression on her cousin's face, the one some dismissed as insincere. She'd thought of him as blank paper that could never be stained red.\n\nThen somewhere along the way, he lost that smile. Sorrow and rage filled the empty space.\n\nWhy hadn't she taken care of him? What had she been doing when his son pointed a blade at his heart?\n\n**[The Absolute's wish ends an era of history.]**\n\n**[He witnessed it through the Absolute.]**\n\n**[He saw the responsibility of the highest position—to guide a new millennium of history.]**\n\n**[He has seen the end of an age.]**\n\n**[At the center of the old and the new, he felt the great narrative that couldn't be achieved through personal power become part of him.]**\n\n**.......**\n\n**....**\n\n**[An unknown person has completed the second page of the epic!]**\n\nThe world messages ceased.\n\nA sickening sound emerged from beyond the exit. Screams, metal clashing, explosions—all of it gradually faded into ominous silence.\n\n\"Your Majesty...\"\n\nThe dukes closed their eyes, understanding what that silence meant. Basara choked on her sobs. Piaro drove his fists into the wall. A notification window materialized before Grid.\n\n**[The second page of your epic has been completed.]**\n\n**[The history that will never be forgotten, 'The Birth of a New Millennium of the Empire,' has become part of you. You are part of the millennium empire's history.]**\n\n**[Epic completion has made your relationship with the Saharan imperial family special.]**\n\n**[The Saharan imperial family will consider you special for generations to come.]**\n\n**[Epic completion has made you a witness of a new era.]**\n\n**[You have accomplished a feat impossible within a human's short lifespan. For this remarkable achievement, you have acquired the title 'Protagonist of Two Eras.']**\n\n**[Protagonist of Two Eras]**\n\n**[If you died easily, you couldn't have witnessed two eras. You will never die easily.]**\n\n**[Indomitable's effect is enhanced.]**\n\n**[Your status has risen to the next level through epic completion.]**\n\n**[Your status has risen an additional level due to the large-scale rewards from epic completion.]**\n\n**[Some upper-grade species are now considered beneath you. Species ranked lower than you will deal reduced damage and take additional damage.]**\n\n**[You feel less bound by the concept of space. Yet it still looms.]**\n\n**[Deity stat increased by 2.]**\n\nGrid closed his eyes, then opened them.\n\nThe dukes who'd seemed so terrifyingly powerful months ago now felt... comfortable. Not that he was looking down on them—Grid never judged people purely by strength. Just... literally comfortable. He wouldn't shrink back as much when facing Garam now. Though that didn't mean his actual power had caught up to his courage.\n\n\"Your Majesty?\" Piaro's startled voice broke the silence.\n\nThe dukes turned, their expressions blank for a moment. Facing Grid's serene gaze triggered an indescribable feeling—the same sensation they'd experienced when first meeting the Grandmaster.\n\nGrid's enhanced hearing and sixth sense painted the picture beyond the door. \"The army's coming. Edan's nearly spent. Let's move.\"\n\n\"Wait—\" Grenhal tried to intervene. The Grandmaster had to still be alive. His death was inconceivable. He was biding his time at best. Walking out there now could trigger catastrophe. They should wait for reinforcements.\n\nGrid ignored him, already pushing the exit open. Originally, the stone wall responded only to the emperor's red energy. Perhaps Juander's death had broken the mechanism, or the shock had damaged it—either way, the door opened easily.\n\nSilence.\n\nThe blood-soaked audience hall stood empty. The Grandmaster, the Red Knights, the magic machines—all vanished without a trace. The emperor, Chensler, Bain—gone.\n\n\"You came... just in time...\" A voice echoed through the chamber.\n\nEdan sat slumped on the throne, holding the crown rather than Saharan's sword. Had the Grandmaster reclaimed it? The aftermath of burning through all his power had left Edan dying, as if poisoned.\n\n\"An imperial... order...\" Blood bubbled from his lips as he tried to command the dukes, his eyes already glazing. \"My mother... Mother...\"\n\nEdan's final wish died unspoken. His shaking hands failed to set the crown on his head. He crumbled to gray ash.\n\nThen—\n\n\"Father! *Father!*\"\n\n\"Your Majesty!\"\n\nFirst Prince Roland and Second Prince Dulandal burst into the audience hall. They'd gathered their forces the moment they sensed the disturbance, leading many soldiers. But far too late.\n\n\"My stupid, slow self...! I killed you! Someone kill me!\" Roland spotted the crown rolling through the blood before the empty throne. He ran to it, clutching the bloodied circlet in trembling hands. Dulandal simply stood there, blank-faced.\n\nBasara and the dukes handled the aftermath. Grid glanced at Piaro before approaching Basara.\n\n\"The princes... he asked that you not treat them too harshly.\"\n\n\"I'm not worthy to care for them.\"\n\nSilence.\n\nAfter what happened with Edan, this made sense. First impressions painted her as cold and severe, but the more you knew Basara, the warmer and more compassionate she revealed herself to be.\n\nGrid smiled and left the audience hall.\n\n\"I'll return soon with a magnificent gift!\"\n\n\"Stay strong until we meet again, Your Majesty!\"\n\nBasara and the dukes bid Grid farewell. The princes were ignored.\n\nHad Basara rallied them? The thirty thousand cavalrymen belonging to the dukes who'd entered the palace saluted Grid and Piaro in perfect unison. The sound of thirty thousand fists striking thirty thousand chests echoed to the blue sky.\n\nIt was the day the supreme power of the West Continent—the empire that had existed since Satisfy's beginning—fell."
}