{
  "id": 1084,
  "title": "Chapter 1083",
  "content": "[Juander, 19th emperor of the Saharan Empire, has died.]\n\n[Duke Basara has ascended to the throne as the new empress.]\n\n[All players sworn to the Basara Duchy will receive the 'New Emperor's Blessing' buff. For the next month, experience acquisition will increase by 5% and death penalties will be reduced by 50%.]\n\nThe succession unfolded with surprising ease. With Duke Grenhal and Duke Morse presenting the emperor's will before the assembled court, what choice did the princes have? 1st Prince Roland certainly had none—or rather, he wanted none. His passive devotion to the throne had never translated into ambition. He honored his father's final decree without hesitation, pledging his support to Empress Basara.\n\nThe nobles who had invested fortunes positioning Roland as heir seethed with quiet fury, yet their resistance collapsed before it could truly form. Challenging a dead emperor's will was political suicide, and the combined might of three ducal armies made rebellion unthinkable. Besides, Basara's reputation for wisdom and measured judgment offered reassurance—she would not be the kind of ruler who purged her rivals on coronation day.\n\nPrince Dulandal and his faction, however, refused to bend.\n\n\"How can we accept this?\" His voice echoed through the palace halls. \"The emperor's own sons still draw breath! She was struck from the line of succession years ago!\"\n\nHis protests died swiftly. Thirty thousand cavalrymen loyal to the three dukes had already secured every gate and avenue of the capital. Dulandal's forces could not match them, especially without Roland's support. And Roland had already made his position clear.\n\n*My brother is a coward,* Dulandal thought bitterly as he turned to the remaining powers of the empire.\n\nSpear Saint Rachel received him in her estate, surrounded by the battle-hardened troops she'd marched from her holdings. Dulandal had expected support—she'd witnessed Prince Edan's madness firsthand, after all. Surely she understood the chaos to come.\n\n\"There is no disagreement with Basara as our ruler,\" Rachel said simply.\n\n\"Damn it all!\" Dulandal abandoned diplomacy and rushed to the Tower of Eternity.\n\nMagician King Goldhit looked up from her research with the bored expression of someone interrupted from important work. When Dulandal finished his impassioned plea for cooperation, she tilted her head.\n\n\"It doesn't matter who sits the throne.\"\n\nHer tone suggested the question itself was absurd. Goldhit had sworn service to the empire only because the emperor funded her pursuit of enhanced magic—that singular, magnificent dream of recreating the lost art. Politics were beneath her notice.\n\nIf the new empress cut the tower's funding or meddled in their research, she would simply relocate. Dozens of kingdoms would welcome the Tower of Eternity's power and prestige.\n\n\"Pathetic! Every last one of them!\" Dulandal's fist slammed against the tower's stone wall. \"Where is your loyalty to the imperial bloodline?\"\n\nHe was the son of both emperor and empress—legitimate by every measure—yet he'd been outmaneuvered by political convenience and convenient indifference.\n\n\"Wait.\" Hope flickered in his chest. \"Isn't it time for him to return?\"\n\nThe Five Pillars. Grandmaster Zikfrector—a traitor. Magician King Goldhit—a disinterested bystander. Chensler the Unkillable—vanished in the final battle. Guard Captain Bain—presumed dead in that same chaos. But Kyle, the fifth pillar, had been absent from the capital entirely.\n\nHe'd departed to explore the Ruins of the War God before this catastrophe unfolded. The weakest of the Five Pillars, yes, but weakness suggested room for growth. Potential. And men of potential often possessed the fierce loyalty of those still climbing toward greatness, like Chensler.\n\nKyle would support him. Kyle *had* to support the legitimate heir.\n\nDulandal's jaw set with determination. Basara had positioned her soldiers and seized the capital as though she'd *anticipated* the emperor's death. Dulandal would prove that power seized by force could be torn away just as quickly. With Kyle at his side, he would build a faction capable of reclaiming the throne.\n\nIt was a reasonable plan.\n\n\"So why isn't he back yet?\"\n\nThe scheduled return date had passed. Then the week after. Still no word from the Ruins of the War God. No messengers, no letters, no Kyle.\n\nAs the days stretched into weeks, Dulandal felt the throne slipping further beyond his grasp.\n\n***\n\nThe appearance of Grid's epic set the world ablaze with speculation. Who was this 'Absolute'? What did it mean for Satisfy's unfolding narrative? Television networks scrambled to assemble expert panels, packing their studios with academics, game analysts, and anyone else with credentials impressive enough to print on a chyron.\n\n『Grid created his first epic during a confrontation with a great demon. The epic system only triggers when connected to world-altering events. Logically, the 'Absolute' mentioned must be at least great demon tier.』\n\n『Agreed. My analysis suggests the Absolute is likely a yangban—a member of the divine noble class ruling the Hwan Kingdom on the East Continent. They possess near-immortal lifespans and overwhelming power.』\n\n『Grid witnessing the fall of such a being would indeed herald a new era. It signals the East Continent storyline finally opening in earnest.』\n\n『Fascinating. But what sin could possibly destroy someone with eternal life and absolute force?』\n\n『At the moment, only Grid knows. I imagine we'll discover the truth as future content patches unfold...』\n\nThe experts fell silent mid-speculation. Staff members outside the studio were gesturing frantically.\n\nText crawled across the bottom of the screen:\n\n**(BREAKING)** Juander, emperor of the Saharan Empire, confirmed dead. Prince Edan's rebellion identified as primary cause.\n\n**(BREAKING)** Duke Basara crowned as empress.\n\n『Ahem. Well...』\n\nThe panel members coughed in unison. Their carefully constructed yangban theory had imploded in real-time. The Absolute wasn't some Eastern divine being—it was the emperor himself. Several faces flushed crimson. Getting proven spectacularly wrong seconds after broadcasting your analysis required either extremely thick skin or a complete lack of shame.\n\n—Why are these \"experts\" always wrong?\n\n—The broadcasters are the real problem. Why do they keep hiring people who don't know shit?\n\n—To be fair, they're usually decent. Grid incidents just break everyone's brains ㅋㅋㅋ\n\n—God Grid strikes again...\n\n—Okay so what's the actual conclusion here? The new millennium is about the empire now?\n\n—Makes sense. Old imperial family got exposed as incompetent. New leadership will be terrified of looking weak. Empire's about to get scary strong.\n\n—But what does that have to do with Grid?\n\n—Seriously, why is Grid EVERYWHERE? Wasn't he at war with the empire like five minutes ago? Then he's buddies with the dukes killing Berith. Now he's connected to the imperial succession??\n\n—Honestly I don't get Grid's angle. The empire literally invaded his kingdom a few months back. Why would he help them?\n\n—Because he's scared, obviously. Even Grid can't handle the full empire. Did you see those dukes fighting Berith? They were super friendly to him. Grid's been kissing ass behind the scenes.\n\n—So he got lucky enough to witness the emperor die and scored an epic?\n\n—This game has always been 90% luck lmao\n\nThe panel sat in uncomfortable silence while the chat erupted. Then new text scrolled across the screen:\n\n**(BREAKING)** Empress Basara officially recognizes Player Grid as benefactor of the empire. The Saharan imperial family proclaims eternal alliance with the Overgeared Kingdom. At her coronation before the assembled nobility: \"All enemies of the Overgeared Kingdom are enemies of the empire.\"\n\n—...\n\nThe chat window went dead quiet. Then, belatedly, an earlier message seemed to echo in everyone's minds:\n\n—Just shut up.\n\n***\n\n\"The Yatan Church corrupted Empress Marie and Prince Edan through deception and dark arts. They sought to seize control of the empire and use it as a weapon against the entire continent. However, the late Emperor Juander and Overgeared King Grid perceived their scheme and thwarted it at great personal cost.\"\n\nEmpress Basara's official statement served multiple purposes. By attributing the rebellion to Yatan manipulation, she reduced Marie and Edan's culpability while dampening public panic. The masses needed simple narratives, not complicated truths.\n\nNotably absent from the announcement: any mention of Grandmaster Zikfrector. Most citizens didn't know he existed, and the imperial family intended to keep it that way. Explaining the grandmaster meant revealing that Saharan, the founding emperor himself, had prioritized loyalty to an outside master over the empire's interests. Some truths were too damaging to expose.\n\n\"Tear it down.\"\n\nThe imperial servants presented their petition with barely concealed eagerness. The Celestial Palace—that monument to arrogance whose very name declared its occupant superior to the emperor—should be demolished and erased from history.\n\n\"No. Leave it standing,\" Basara said.\n\nConfusion rippled through the assembled ministers. Why would the new empress preserve such an obvious symbol of imperial humiliation? But Duke Grenhal, Duke Morse, and Spear Saint Rachel exchanged knowing smiles.\n\nBasara's expression softened. \"You understand, then. I'm preserving it for Grid.\"\n\nShe raised a hand before the protests could begin. \"The grandmaster, whatever his failures, helped forge this empire. I won't defend his betrayal, but neither can I erase his contributions. The same applies to Overgeared King Grid. Without him, there would be no new empire. He is our benefactor, our guardian. The Celestial Palace was built to house the empire's protector—so let it serve that purpose for its rightful master.\"\n\n\"Chancellor Vermont.\"\n\n\"Yes, Your Majesty.\"\n\n\"Send a gift to the Overgeared King immediately.\"\n\n\"Understood. We'll assemble appropriate riches—\"\n\n\"Send half our black mithril reserves.\"\n\n\"*What?*\"\n\nVermont's composure shattered. The other nobles gaped in open shock. Even the three dukes looked stunned.\n\nBlack mithril was the foundation of imperial military dominance. The imperial family had hoarded it for centuries, carefully rationing each ingot. And Basara intended to *give away half?* This transcended generosity—it was institutional sacrifice that could cripple the empire's strategic position for decades.\n\n\"Your Majesty, please reconsider!\" The nobles' voices overlapped in desperate protest. \"This is impossible!\"\n\nBasara didn't waver. \"It still isn't enough to repay what we owe. Begin preparations at once. Actually, wait—\"\n\nRelief flooded the throne room. She'd reconsidered. Sanity had prevailed.\n\n\"I should deliver it personally.\"\n\n\"Your Majesty, allow us to go in your stead,\" Duke Grenhal cut in smoothly. Duke Morse nodded agreement. Having the empress abandon the capital days after her coronation would trigger political chaos. Besides, they genuinely wanted to visit Grid themselves.\n\nBasara recognized the wisdom in their counsel. \"...Fine.\"\n\nHer pout was unmistakable. Since claiming the throne, she'd kept her eyes perpetually wide—determined not to miss any detail, any potential threat. Those large, clear eyes gave her refined features an almost luminous quality. But now, with her cheeks slightly puffed in childish frustration, she looked remarkably young. Cute, even. Easy to forget she was an empress of significant years and harder political instincts.\n\nWatching her, the assembled nobles felt their loyalty crystallize into something deeper. They would work themselves to exhaustion for this ruler. Gladly."
}