{
  "id": 1085,
  "title": "Chapter 1084",
  "content": "# Chapter: The Long Road Home\n\nThe journey back to the Overgeared Kingdom stretched across days of silence and anguish. Grid walked beside Piaro rather than using a return scroll or warp gate—a conscious choice born from concern. The emperor's death had come in a form neither of them had anticipated, and it had shattered something fundamental in Piaro's soul.\n\nFor three days, Piaro said nothing. His face bore the pallor of a man haunted, his eyes hollow and distant. Then, without warning, he would surge forward with a roar that shook the mountainsides, unable to contain the fury burning through his veins.\n\nGrid chased after him each time, his chest tight with worry.\n\n*Will he ever smile again?*\n\nThe irony wasn't lost on him. For years, the emperor had been Piaro's anchor—the singular focus that had kept him from drowning in the abyss of his grief. Hatred was a powerful tether. When Piaro lost his comrades, his family, his entire world, that burning desire for vengeance had been the only thing preventing him from shattering completely. Every night, Grid imagined, Piaro had fallen asleep dreaming of the moment his blade would find the emperor's throat.\n\nBut that moment never came.\n\nWhen they finally stood before the emperor, Piaro couldn't extract his revenge. The emperor died willingly—a sacrifice, not an execution. He fell by another's hand, and no curse or blade could reach him now.\n\n\"Kuek...! *Kuaaaaak!*\"\n\nThe seizure began again.\n\nPiaro had been chewing on the beef jerky Grid offered when his entire body went rigid. The dried meat fell from his trembling fingers as he snatched up his hand plow, eyes rolling white. He charged forward like a wounded bull, bellowing his rage at the uncaring sky.\n\nNothing could stop him. Steep ridges crumbled beneath his feet. Rivers as wide as seas parted before his fury. Rain lashed at him, and monsters fled from his path. Piaro roared and climbed, scaled peaks and plunged through valleys without rest, driven by something primal and devastating.\n\nGrid followed, though his body screamed in protest.\n\nHis stamina gauge flickered into the red. Each breath came as a labored gasp, his legs trembling beneath him. His vision blurred at the edges. Sweat stung his eyes, and his heart hammered against his ribs as if trying to escape.\n\n*Natural State...*\n\nNow Grid understood why the imperial dukes had regarded that skill with such reverence. Drawing energy directly from nature meant Piaro's stamina was virtually inexhaustible. He could run like this forever.\n\nGrid could not.\n\n\"Pant... pant...\"\n\nHis body felt submerged in thick water, every movement sluggish and heavy. The world tilted dangerously. Worse than the physical exhaustion was the helplessness—he couldn't reach Piaro, couldn't share the despair consuming his knight from within.\n\n*If only I were as thoughtful as Lauel...*\n\n*If only I had Huroi's way with words...*\n\n*If only I possessed Peak Sword's quick wit, or Regas' simple purity...*\n\n*If only I could say something—anything—to ease his pain...*\n\nBut Grid had nothing to offer except his presence.\n\n\"Over...geared... Corn...\"\n\nHis hand trembled toward his summoning interface. He'd avoided calling the unicorn out of respect for Piaro's anguish, but now Grid feared he might actually collapse and die out here. And if he died, if Piaro was left alone in this state—\n\nThe system notification blazed across his vision.\n\n[Your knight Piaro has reached new heights in extreme conditions!]\n\n[Your knight Piaro's Natural State skill has evolved from Beginner to Intermediate level!]\n\nGrid's breath caught.\n\nThe world changed. \n\nRivers and seas, mountains and forests, sky and earth—all of nature reached out to Piaro. Energy poured into him like water into a vessel, washing away the sweat and exhaustion. The air itself seemed to glow around him.\n\nThen—\n\n[Your sixth sense transcends the concept of space.]\n\n\"...?\"\n\nGrid blinked. Piaro's back, which had been a distant silhouette on the far ridge, was suddenly right in front of him. The space between them had folded like paper.\n\n*This is—*\n\n[You feel less attached to the concept of space. Yet it is still looming.]\n\nRecognition flooded through him. This was the same sensation he'd felt when his transcendence stat increased—the way space itself seemed to bend and compress. The yangban Garam had called it *Shunpo*. A method of contracting distance. And Grid had just used it.\n\nNot intentionally. Not with control.\n\nBut he'd done it.\n\n*A new skill, maybe?* The thought flickered and died. Right now, none of that mattered.\n\nHe approached Piaro slowly, hesitantly, and sat down on the rocky ground.\n\n\"Your Majesty.\"\n\nPiaro turned. The violence had drained from his eyes. His voice, which had been raw with rage only moments before, was quiet. Calm. The darkness that had carved shadows across his face began to recede like a tide going out.\n\n\"It is very regrettable,\" Piaro said, \"that I couldn't execute the emperor with my own hands.\"\n\nGrid said nothing.\n\n\"I wanted to cut out the eyes that looked at me as he bowed. I wanted to sever the ears that heard that shameless apology.\"\n\nSilence stretched between them.\n\n\"But in the end...\" Piaro lifted his gaze to the horizon. \"The emperor is dead.\"\n\nDawn was breaking. The first rays of sun crested the mountain peaks, painting everything in shades of gold. The light touched Piaro's face, and for the first time in days, Grid saw something besides pain there.\n\n\"My past is over.\"\n\n\"Piaro...\"\n\n\"In the future,\" Piaro said, his voice steady and sure, \"I will live for Your Majesty.\"\n\nThe system message appeared with a gentle chime.\n\n[You feel a deep bond beyond liking with your knight 'Piaro.']\n\n[A new system is opened!]\n\n[★ BOND SYSTEM ★]\n\n[Bond List:\n★ Piaro ★\nBond Level: 1\nEffect: +1% to all stats when together\nAdditional: Can detect when bond target's health reaches dangerous levels]\n\nGrid stared at the notification through blurring vision.\n\nHow many people in the world would do what he'd done? Stay beside a suffering man for days without complaint? No matter how much you cared for someone, practical concerns always intruded. Responsibilities. Obligations. The pressing need to maintain your position and livelihood.\n\nBut Grid had set all of that aside. The kingdom could wait. His economic ventures could wait. His constant grinding for power could wait.\n\nNot because he'd calculated the value of Piaro's loyalty. Not because he expected something in return.\n\nSimply because he'd wanted to be there.\n\nHe hadn't spoken words of comfort—he didn't have the gift for that. But he'd stayed. And somehow, that had been enough.\n\n\"Thank you.\" Grid's voice cracked. A smile broke across his face even as tears streamed down his cheeks. \"Really... thank you.\"\n\nRelief washed over him in a wave.\n\nBut with it came another feeling. Sharp. Painful.\n\n*Khan.*\n\nGrid wished he'd done more. Spent more time. Built this bond before it was too late. If he had shared those moments with Khan, would the old blacksmith's final journey have been less lonely?\n\n*I have to do better this time.*\n\nThe resolution settled into his bones. Irene's face appeared in his mind, then Lord's bright smile. Sehee. His friends. Even Braham, Asmophel, and Mercedes—scattered across the world but never far from his thoughts.\n\n*Are you all doing well?*\n\nAsmophel and Mercedes sent regular letters. Brief updates on their missions: someone persuaded, someone else refusing, locations and movements. They claimed everything was fine, but Grid could read between the lines. They were hiding the difficulties from him, trying not to worry him.\n\nAnd Braham remained silent. Deep in slumber, his presence a fading ember since his soul had shattered saving Grid's life.\n\n\"Sleep well,\" Grid murmured to the absent soul. \"And come back strong.\"\n\nThe habit of talking to Braham had become a ritual. After speaking his daily message, Grid finally summoned Overgeared Corn. The unicorn nuzzled him affectionately, its healing aura restoring his stamina. With Piaro's help, Grid recovered enough to activate his return scroll.\n\nIt was time to go home.\n\n---\n\n# Chapter: Wrath of the Ten\n\nThe grand corridor of Reinhardt Palace stretched before him, familiar and welcoming. Grid had planned to go straight to Irene and Lord—he'd missed them terribly during the ordeal in the empire.\n\nInstead, he found himself surrounded.\n\nThe ten meritorious retainers formed a loose circle around him, their expressions ranging from concerned to furious to coldly analytical.\n\n\"Despite going through a *pretty big crisis*,\" Jishuka said, her voice syrupy sweet, \"you handled things *all by yourself*. I'm *so* glad you came back safely.\"\n\n\"Yes.\" Chris crossed his arms. \"We were clearly just fools, worrying ourselves sick.\"\n\n\"Have strength!\"\n\nGrid's head snapped toward the gentle voice. Irene stood at the far end of the corridor, holding Lord's hand. The boy had grown so much. She raised her fist in a small gesture of encouragement, her eyes sympathetic.\n\nShe knew exactly what was coming.\n\nJishuka's smile widened, sharp as a blade. She'd been on the verge of competing against the legendary archer Povia's ghost—a hidden quest she'd desperately wanted to complete—when Grid's epic broadcasted across the system. She'd abandoned everything to return home, only to find he'd already resolved the crisis.\n\n\"Tell me, Grid,\" she said pleasantly, \"do you have an earthworm lodged in your ear? Did your brain shift at a strange angle and make you forget you can *summon your knights?*\"\n\n\"...\"\n\nThe bright laugh that followed sent chills down his spine. Grid took a step back.\n\nYura moved forward to take Jishuka's place.\n\nShe'd been deep in the 33rd Hell, having spent years conquering the masterless 32nd Hell after Belial's death. The four heavenly kings of the 33rd Hell had been as powerful as Grid himself—and she'd killed three of them before his epic forced her to abandon the fourth and rush back.\n\n\"Youngwoo,\" she said calmly, \"we're going to an amusement park this week. For our date.\"\n\n\"Eh...?\"\n\nHorror flashed through him. He couldn't—absolutely *could not*—go on amusement park rides. Not even at knifepoint. When he was ten, he'd ridden the Viking and pissed himself. He'd *told* her this story already—\n\nHe opened his mouth to protest, then saw the way Yura's eye twitched.\n\nHe closed his mouth.\n\n\"The reason you don't trust me is because I'm weak!\" Huroi suddenly shouted, drawing his sword. \"I will apologize with my death!\"\n\nHe moved to disembowel himself.\n\n\"Whoa, hey!\" Peak Sword lunged forward and grabbed his arm. \"What are you, a samurai? Put the damn sword away!\"\n\nRegas smiled bitterly, his expression distant. \"I understand now. We're so weak that Grid can't trust or rely on us anymore...\"\n\n\"Actually,\" Chris said with a shrug, \"Grid relies on me plenty. I'm the second-ranked player, after all.\"\n\nPon snorted. \"Did Grid call *you* specifically? Because from where I'm standing, any of us would've done.\"\n\nFaker said nothing, watching in his usual silence.\n\nVantner scratched his bald head. \"Do I need to get a shield? Or maybe a wig?\"\n\nThe chaos swirled around Grid like a storm.\n\nThen Lauel stepped forward, cutting through the noise.\n\nHis expression was colder than anyone else's. More serious.\n\n\"Did you bring the goods?\"\n\n\"Th-that...\" Grid swallowed hard.\n\n\"The black mithril,\" Lauel pressed. \"Tell me you obtained the black mithril.\"\n\nGrid launched into a long explanation. The emperor's sacrifice. The princes' grief. The solemn, sacred atmosphere of those final moments. How asking for payment in the midst of that would have been—\n\n\"Unforgivable,\" someone finished quietly.\n\nThe group fell silent, imagining the scene. The dying emperor opening a path to a new era. His children weeping. The weight of history shifting. And Grid, in the middle of all that, sticking out his hand and demanding minerals.\n\n\"...It would've been a problem,\" Lauel finally conceded. His jaw tightened. \"But this is going to cause a huge delay in our schedule.\"\n\nBasara had become the busiest person in the world overnight. The empire was entering a new era—the system itself had acknowledged it. There would be massive reforms, political restructuring, economic shifts. Basara would be drowning in responsibilities for months.\n\nShe might forget her promise to Grid entirely.\n\nWhich meant his mineral creation project was now indefinitely postponed.\n\n\"Can you bear waiting that long?\" Lauel asked.\n\nGrid exhaled slowly. \"I'll have to. If it drags on too long, I'll send a letter to remind her.\"\n\n\"Your Majesty!\"\n\nEveryone turned. Royman sprinted down the corridor, still dressed in her masculine knight's attire despite her promotion to senior knight. She skidded to a stop and bowed.\n\n\"Message from the gate! Duke Grenhal of the Saharan Empire is requesting entry. He says it's urgent.\"\n\nGrid blinked. Grenhal was here? Now? When the empire was in such turmoil?\n\n\"Take him to the audience hall,\" Grid said immediately. \"I'll meet him there.\"\n\n---\n\nMinutes later, Grid sat upon his throne, the ten meritorious retainers assembled behind him. Duke Grenhal entered and bowed low—lower than protocol required.\n\n\"This,\" he said, producing a heavy bundle from his pack, \"is a gift from Her Majesty the Empress.\"\n\nHe placed it before the throne.\n\n[You have acquired 102 Black Mithril.]\n\nThe notification hung in Grid's vision.\n\nHis mouth fell open.\n\nBehind him, sharp intakes of breath echoed through the hall. Even Lauel's carefully controlled expression cracked.\n\nGrenhal remained bowed. \"Her Majesty says that the imperial family of Saharan will never forget the grace of the Overgeared King. Any enemy of the Overgeared Kingdom is an enemy of the empire. We will be a dam, protecting you from all winds. A palace has been prepared for you within the imperial grounds, and you are welcome at any time.\"\n\nHe straightened, meeting Grid's eyes.\n\n\"Overgeared King, will you accept an alliance with the empire? The right to dissolve this alliance will be granted solely to the Overgeared Kingdom.\"\n\nSilence.\n\nThe words hung in the air like something precious and fragile. Grid's heart hammered in his chest. This was more than he'd dared hope for. More than he'd even dreamed.\n\nBut there was something he had to consider.\n\nHis gaze drifted upward, toward the ceiling.\n\nKasim was there. Invisible to most, but Grid could feel his presence like a blade pressed against skin.\n\nGrenhal could feel it too. His posture remained relaxed, but his eyes tracked the ceiling with the awareness of someone who'd spent a lifetime in mortal danger.\n\nThe killing intent radiating from above was palpable. And as Kasim had once told Grid, the imperial dukes operated on a level above even the King of Shadows.\n\n\"The empire will change,\" Grenhal continued, his voice steady despite the invisible threat. \"Our armed forces will serve only as defenders, not conquerors. We seek coexistence with all species on the continent. No more trampling others simply because they're different. No more exploitation in the name of governance. The new empire will spend eternity atoning for those the old empire destroyed.\"\n\nBeautiful words.\n\nThey meant nothing to Kasim.\n\nHe dropped from the ceiling like a falling blade, landing in a predatory crouch. His red eyes burned with barely restrained bloodlust as they fixed on Grenhal.\n\nThe air itself seemed to hold its breath."
}