{
  "id": 1086,
  "title": "Chapter 1085",
  "content": "\"Repent?\" Kasim spat the word like poison. \"Don't insult me with your empty words!\"\n\nNo world was perfect for everyone. What satisfied one could devastate another. Kasim proved it now. While Grid and the ten meritorious retainers dared to hope for a brighter future under this new empire, Kasim's fury reached its breaking point. Even Regas—who'd thought nothing could surpass Asura's terrifying visage—recoiled from the twisted mask of rage consuming Kasim's face.\n\n\"Your empire declared us *ominous*,\" Kasim said, voice deadly quiet. \"Simply because our skin was dark.\"\n\nGrenhal said nothing.\n\n\"You called us spies—because our ears were large. You named us *beasts*, not humans—because our arms were long.\"\n\nSilence.\n\n\"Your soldiers invaded our homeland and violated our women.\" Kasim's dagger trembled in his grip. \"Your knights butchered our men and scattered their remains like refuse. Your nobles—those *noble* lords—caged our royal family. Displayed them for *entertainment*.\"\n\nStill, Grenhal offered no defense.\n\nIt hadn't been only Kasim's family, his friends. An entire people had been humiliated, degraded, *erased*. Kasim's eyes burned with tears as memory dragged him back to those final days. Grenhal remained silent. Those who inflicted wounds had no right to mourn the wounded. No words existed that could comfort what Kasim had become.\n\nThe Nero massacre—orchestrated by Second Imperial Prince Dulandal—ranked among the empire's most heinous crimes. Even within the empire itself, voices had risen in opposition.\n\nYet opposition meant nothing to the dead.\n\nKasim's dagger kissed Grenhal's throat. \"The imperial family you serve.\"\n\nNo response.\n\n\"The prince who never even *spoke* our names.\"\n\nNothing.\n\n\"I watched him use my king's severed head as a torch. Watched him drink wine while it *burned*.\"\n\n\"...\"\n\n\"*Repent?*\" Kasim's voice cracked. \"The dead don't return! Dignity, once destroyed, can never be rebuilt! You think your guilt will ease just because you apologize to corpses?\"\n\nBlood welled where poisoned steel pressed flesh. Grenhal's neck darkened as venom seeped into the wound.\n\n\"Even if you mean every word—!\" Kasim's composure shattered. \"You could reflect for ten thousand years, flagellate yourself until your bones showed, and it would change *nothing*! The dead will never forgive you! Never!\"\n\nThe Overgeared King's audience hall—cramped and austere compared to the emperor's—nevertheless stretched across hundreds of square meters. Dozens of pillars cast countless shadows. Perfect terrain for Kasim's power.\n\nShadow soldiers materialized, surrounding Grenhal as poison blanched his face. Each specter gripped a spear. Kasim's roar echoed from the rafters:\n\n\"I am Kasim! Last son of the Nero people! Enemy of the Saharan Empire!\" His voice rang like struck iron. \"I challenge you to a duel to the death!\"\n\nDespite everything—despite the fury threatening to consume him—Kasim maintained control. Remarkably, impossibly, the man who'd lived solely for vengeance kept his reason intact even as he faced one of the empire's highest-ranking nobles.\n\nHe understood the consequences of one-sided violence. If he simply murdered Grenhal, relations between the Overgeared Kingdom and the empire would collapse catastrophically. That understanding had stayed his hand when the wounded dukes first arrived. Kasim himself might not realize it, but after guarding Lord for over a decade, he'd become part of something larger than revenge.\n\nHe'd become Overgeared.\n\n\"Kasim...\" Grid's chest tightened, making the name emerge hoarse.\n\n\"I accept.\" Grenhal's voice carried absolute conviction. \"This duel stems from the empire's sins against the Nero people. My retainers will testify that the Overgeared Kingdom bears no responsibility.\"\n\n\"My lord!\" Grenhal's subordinates surged forward. They knew Kasim's reputation—the King of Shadows, the finest assassin of the age. They trusted Grenhal's abilities, certainly, but the opponent was *dangerous*. One mistake could cascade into disaster. \"This isn't your burden to carry alone!\"\n\n\"The Nero grudge belongs to the Second Prince!\" another retainer shouted. \"You don't have to—\"\n\n\"*Enough!*\" Grenhal's authority silenced them. \"I am no different from Dulandal.\"\n\nThe empire's genocides had been executed under imperial decree. Grenhal had participated in countless campaigns. Perhaps he'd never personally committed massacre, but he'd seized territories, taken prisoners, enforced occupation. Imperial orders could not be refused. Yes, the Nero incident had been extraordinary—so egregious it drew criticism even within the empire, branding Prince Dulandal as corrupt...\n\nBut these were excuses. Self-justifications. Somewhere, to someone, Grenhal remained an object of hatred. Would he spend his life offering excuses to every victim he encountered? To every second and third Kasim?\n\nImpossible.\n\nThose who sinned must face accountability. Only then could the empire move forward. The emperor himself had demonstrated as much.\n\n\"I am Duke Grenhal of the Saharan Empire.\" He channeled mana, purging the poison from his system, then removed his armor. \"Through your blade, I will glimpse the Nero people's resentment. I will understand the terrible, arduous path of repentance the empire must walk.\" His stance widened. \"And I will show my nation how to walk it correctly.\"\n\n\"You talk well for a dead man!\" Kasim roared. \"If you possess even a shred of shame—*die willingly*!\"\n\nDozens of shadow soldiers thrust their spears simultaneously.\n\nGrenhal evaded most strikes through pure speed, but the sheer volume overwhelmed him. Spearpoints opened wounds across his upper body. The injuries seemed to *energize* him—each cut making him faster, more ferocious. He surged through the shadow formation like a tsunami through driftwood, closing on Kasim.\n\n\"My death accomplishes nothing!\" Grenhal's shout carried conviction that made the shadows waver. \"If whoever replaces me abandons the path, then all of this—all of it—means nothing!\"\n\nKasim's eyes widened.\n\n\"I will *live*!\" Grenhal's fist shattered a shadow soldier. \"I will take responsibility for what we've done!\"\n\nThe audience hall descended into chaos. Kasim vanished and reappeared through the darkness itself. Grenhal answered with speed and devastating power that made the floor crack, the pillars groan. Their clash was so violent that spectators feared the entire structure might collapse.\n\nIn the corner, Administrator Rabbit clicked his abacus beads, already calculating the repair bill he'd present to both combatants.\n\n\"Damn it...\"\n\nThe ten meritorious retainers watched with distorted expressions. Jishuka and Peak Sword both muttered curses under their breath. Before them, an imperial duke's true power was on full display—and Kasim, their comrade, was being methodically overwhelmed. The gap between their abilities and those of named NPCs suddenly felt vast and unbridgeable.\n\n'Grid matches the dukes in strength,' someone thought.\n\nGrid had proven it repeatedly. Players had no inherent limits. Their weakness stemmed purely from insufficient effort.\n\n'We're too weak to help him,' Jishuka realized.\n\n'That's why Grid didn't summon us,' Peak Sword acknowledged.\n\n'We're pathetic,' another admitted.\n\nThe truth settled over them like winter frost. They weren't in any position to worry about Grid. Their concerns were *meaningless* given the chasm between their strength and his. Every moment spent anxious about Grid was a moment stolen from their own growth.\n\nLauel had accepted the limits of his personal power the day the Overgeared Kingdom was founded—he'd chosen a different path. But the others? The remaining meritorious retainers clenched their fists until knuckles whitened. Each burned with renewed determination to close the gap.\n\nTo become worthy.\n\nThe duel's conclusion became inevitable.\n\nWhen Grenhal's health dropped below thirty percent, his stats erupted to overwhelming levels. He smashed through the shadow soldiers like they were made of smoke. They scattered, reformed, scattered again—but Kasim's strength was finite. Finally, the ragged assassin collapsed.\n\nBlood bubbled from Kasim's lips as he slumped against the floor. \"Kill me.\"\n\nThe words emerged flat. Final.\n\nHis dream of avenging the empire—of toppling the world's dominant power—what a pathetic fantasy. His heart had been weak enough to grow attached to the Overgeared Kingdom, the very tool he'd meant to exploit. His strength? Insufficient to defeat even a single duke, let alone an empire. Better to die now. Better to end it cleanly.\n\nKasim closed his eyes, embracing the wretched emptiness in his chest.\n\n\"Survive.\"\n\nKasim's eyes snapped open. \"Don't... don't you dare pity me.\"\n\n\"This isn't pity.\" Grenhal stood over him, breathing hard. \"I want you to ensure the empire walks the correct path.\"\n\n\"You're a fool.\" Kasim laughed bitterly. \"I told you—ten thousand years of repentance won't change anything.\"\n\n\"I know.\" Grenhal's voice gentled. \"I know the empire cannot be forgiven. This isn't about relieving my guilt.\"\n\n\"Then...?\"\n\n\"The empire must ensure it never repeats these mistakes.\" Grenhal's conviction rang clear. \"No second Nero. No third. No more genocide disguised as policy.\"\n\nSilence.\n\n\"Survive to the end,\" Grenhal continued. \"Watch us. Warn us when we risk losing our vigilance. And regarding the atrocities the empire committed against your people...\" His voice cracked. \"I am... truly, deeply sorry.\"\n\nGrenhal dropped to his knees. He pressed his forehead to the stone floor before Kasim.\n\nCould sincerity bridge such an abyss?\n\nKasim's dark eyes trembled. Through Grenhal's prostration, through his vulnerability, Kasim glimpsed something genuine. It devastated him. All his motivation—the burning rage that had sustained him for years—bled out like water from a cracked cup. His body, mind, and soul began sinking into darkness. His gaze drifted toward the distant ceiling, unfocused.\n\n\"Master!\"\n\nLord had been waiting outside, hoping his father's business would conclude quickly. The young prince—Kasim's first disciple, his only true friend—burst through the doors and threw himself at Kasim's collapsing form.\n\n\"Master, you have to live! Live with me!\"\n\n\"...\"\n\n\"I'll make you happy! I promise!\"\n\nPerhaps it was Lord's infamous talent—the intuition of someone destined for greatness. Or perhaps just the bond forged through years together. Either way, Lord recognized Kasim's crisis. His desperate cry anchored Kasim's spirit, pulling it back from the abyss. Clear eyes—so much like Irene's—captured Kasim's face.\n\n\"Master is the last survivor of the Nero!\" Lord's voice rang with absolute certainty. \"If you die, the Nero people disappear forever!\"\n\n\"...\"\n\n\"Stay with me! We'll work together until the Nero people rise again!\"\n\n\"...My prince.\"\n\nLord's warmth—his living, breathing presence—rekindled something in Kasim's hollow chest. Kasim had believed revenge was his sole purpose. Now he understood differently. His life wasn't meaningless. It *couldn't* be meaningless, not when such a friend stood beside him.\n\nWhen Kasim managed a weak nod, Grid exhaled and sank back into his throne.\n\nA new era was healing the ghosts of the old."
}