{
  "id": 1087,
  "title": "Chapter 1086",
  "content": "After Grenhal departed, Yura turned to Grid with a cheerful smile. \"So you don't want to go out with me?\"\n\nAware of the suddenly hostile stares from the others, Grid hastily clarified, \"I just meant I don't like having to run around everywhere! I never said I didn't want to date *you*.\"\n\n\"Isn't that the same thing?\" Vantner asked, confused, earning sharp elbows from the other meritorious retainers.\n\nGrid's protest died on his lips as he met Yura's gaze. She'd pulled her slightly wavy hair back in a simple style that somehow made her look like a model posing on a beach. Fresh. Radiant. Beautiful enough to make him forget everything else.\n\n\"W-What?\" he stammered.\n\nHe'd never gotten used to her beauty. She seemed to exist in an entirely different world from his own. After a few seconds of that penetrating stare, Grid was the first to look away, cheeks burning.\n\n\"I understand now.\" Yura's own cheeks colored as she nodded slowly. \"This is why I've always been behind.\"\n\n\"...?\"\n\n\"Let's stop the dating. For a while.\"\n\n\"What...?\"\n\n\"I'm going to become stronger.\"\n\nYura was a single-digit ranker. She naturally exhausted her daily gameplay limit, and her passion for Satisfy was such that she spent every spare moment maintaining optimal condition and gathering intelligence. In that respect, she wasn't unique—all rankers, all professionals, all devoted players invested the majority of their time into Satisfy. Yet not everyone who spent equal time achieved equal results. Otherwise, there would be no such thing as rankings.\n\nYura realized that to reach Grid's level, she needed to focus on Satisfy every waking moment. The luxury of spending time planning dates with her favorite person—she couldn't afford it anymore. As she made this determination and began opening a gate to Hell, Grid shouted, \"You're misunderstanding! I'm just lucky!\"\n\nLuck. It had followed him.\n\nUntil last year, Grid would have hated hearing that. The implication that he'd reached this stage purely through fortune? That his position was anything less than earned through blood and sweat? It had disgusted him—the netizens and experts who dismissed his accomplishments as mere luck. He'd seen it as an insult, a degradation of everything he'd fought for.\n\nBut that had changed. After achieving so much, Grid finally recognized the truth: he *was* lucky. Being born with the strength to persevere, the fact that Satisfy existed at all, obtaining Pagma's Rare Book, meeting good people... all of it was luck he'd been blessed with.\n\nNow he acknowledged it easily. The assessment didn't offend him anymore. It was simply true.\n\nThe gap between him and Yura? It wasn't effort. It was the number of times luck had knocked on his door. Grid insisted on this point.\n\n\"Is there anyone without luck?\" Yura countered. \"Luck visits everyone. But few people can recognize and capitalize on the luck that comes their way.\" She called Grid's luck an ability—a skill. \"Watching you, getting to know you, I realized I've probably missed countless opportunities. I'm not as focused as you. I probably would have given up where you pushed forward.\"\n\n'Compromised' would have been more accurate than 'given up,' but Yura couldn't bring herself to use that word. Not in front of Grid, who'd faced every adversity head-on without compromise. As her body began passing through the Hell gate, she added, \"At the very least, I'll come back as someone who won't hold you back.\"\n\nThat was the signal.\n\n\"I'm going too.\"\n\n\"Same here.\"\n\n\"See you later. I'll keep in touch, don't worry.\"\n\n\"Try not to cause any international incidents while we're gone?\"\n\nOne by one, all the meritorious retainers except Lauel said their goodbyes. Their eyes burned with determination—no longer content to watch Grid's back, they were hungry to see the world he saw, to stand beside him rather than behind.\n\n\"Everyone...\"\n\nThe separation would be long. Grid sensed it instinctively, his expression turning melancholy. Had his growth alienated his closest companions?\n\nChris scoffed at the thought. \"Have you forgotten? We once aimed to be supreme.\"\n\n\"...\"\n\n\"Are we has-beens just because we fell short? We have our pride. We have to prove our worth. Right?\"\n\n\"Chris...\"\n\n\"Get stronger while I'm gone. The moment I return, I'm challenging you to a duel. Be ready.\"\n\nDespite owning territories—apart from Yura and Faker—they all relinquished their rights as lords that day, breaking the shackles that had bound them. The meritorious retainers, who'd carried so many responsibilities, were now free to focus on personal growth.\n\nAfter they'd gone, Lauel addressed Grid in the now-empty office. \"They're not weak enough to need your worry. Why don't you focus on your own work?\"\n\n\"My work?\"\n\n\"As a blacksmith, of course. And...\" Lauel's gaze drifted to the window, where a small shadow was visible on the path Lord used when visiting Kasim. \"Why not spend more time with your family? The years pass quickly. Prince Lord will be fifteen in less than four years. Until then, spend as much time with him as you can.\"\n\nOnce Lord turned fifteen, all manner of constraints would fall on his shoulders. As a continent-recognized genius certified by the system as a super-named talent, would he remain a pillar of the Overgeared Kingdom? Or might he want to travel, or turn rebellious like the imperial princes? A parent's role was crucial.\n\n***\n\n\"There's my boy!\"\n\nLauel wanted Grid to be cautious about Lord's future, but Grid didn't share those concerns. Lord's future? Lord would decide that for himself. Grid just wanted to love his son.\n\n\"How have you been?\"\n\nLord's skin—pale and soft, never burning despite rolling in the sun daily—felt warm against Grid's cheek. The boy's fluffy hair and round cheeks pressed against him, soothing the emptiness left by the retainers' departure.\n\nLord didn't seem to mind the affection. Now eleven years old, Grid had worried puberty might bring rejection, but the boy remained understanding, feeling admiration rather than resentment for a father who was often away.\n\n\"I listened to Mother. I eat well and study hard.\"\n\n\"That's my boy. And...\"\n\nWith black hair, blue eyes, a noble nose, and that slight upturn to his mouth, Lord was an ideal blend of his parents' features. Grid hugged his beautiful son and kissed his cheek. \"Healing Kasim—that was an impressive achievement. You saved him.\"\n\n\"He's my friend and teacher. I only did what I had to.\" Lord's expression grew resolute.\n\nGrid nodded with a smile. \"You're right to cherish your bonds.\"\n\n\"Aunt Ruby says I should treat everyone with care.\"\n\n\"True enough. Everyone is precious to someone, which makes them all worthy of respect. If you see someone in trouble, help them.\"\n\nWas Grid really saying this?\n\n\"*Cough, cough!*\"\n\nThe early Overgeared members—including Zednos and Laella, newly appointed as lords after the retainers' departure—had just entered the office. They stared in surprise. Grid ignored them, lifting Lord to the window where the city sprawled below, teeming with people.\n\n\"But don't be nice to *everyone*. If you give too freely, people might become lazy, or you'll exhaust yourself.\"\n\n\"Yes, Father. I understand.\"\n\nHe could follow Grid's rambling explanations perfectly. Grid understood why teachers in every field praised Lord. Thrilled, Grid grew excited. \"I'll be in the smithy. Want to come with me?\"\n\nHe naturally assumed Lord would agree. But...\n\n\"I'd love to watch you work, but unfortunately, I have plans.\"\n\n\"Plans? With whom?\"\n\n\"A girlfriend.\"\n\n\"...\"\n\nWas he talking about the Rebecca's Daughters candidates? Managing hundreds of girlfriends must keep him busy. Grid felt both impressed and slightly sad that Lord, despite his rigorous education, still made time for socializing. \"Well, can't be helped. Have fun.\"\n\n\"I will. I'll cherish my bonds, just as you taught me.\"\n\n\"...R-Right. By the way, which one are you seeing today?\"\n\nGrid remembered several names and faces among Lord's many girlfriends—about ten who were particularly pretty. He wondered which might be his future daughter-in-law. While Grid mentally catalogued the possibilities, Lord mentioned an unexpected name.\n\n\"Sister Sua.\"\n\n\"What?!\"\n\nGrid's mind exploded with terrible imaginings. The moment he opened his mouth to unleash his fury—\n\n\"Quick! Go now!\" Zednos created a wind barrier between Grid and Lord, pushing the boy toward the door. He didn't want the harsh words about to erupt from Grid's mouth to contaminate the young prince's ears.\n\n\"Yes, I'll be going.\" Lord politely bid goodbye and left the office.\n\nThe instant Zednos lowered the barrier, Grid's cursing turned the office inside out. \"Damn it! How could this happen?!\"\n\nGrid grabbed Zednos by the collar and shook him. \"I know how beautiful, kind, and wonderful Sua is! But she's a pervert!\"\n\n\"*Gkk*... *Gkkk!*\"\n\n\"So she's been quiet lately because she was targeting my son? Is that it?\"\n\n\"*Gkk*...! *Gkkk!*\"\n\n\"What did she do to such a young, pure child?!\"\n\n\"M-Mi... Mis...\"\n\n\"What? A disaster? This *is* a disaster!\"\n\n\"...under...standing...\"\n\nNearly strangled, Zednos was finally released. He clicked his tongue at the strength Grid had displayed—stronger than ever—and gasped out an explanation. \"She treats him like a nephew, like a child. Faker said when Lord was mentally exhausted from his lessons, she took care of him. That's how they grew close.\"\n\n\"...Ah.\"\n\nSatisfy had many behind-the-scenes stories, some reminiscent of morning dramas and ancient myths. Grid had worried for nothing. Thankfully, there was no inappropriate story here—just an adult woman being kind to a tired child. Relieved, Grid banished his lurid imaginings. He instructed his colleagues, the newly appointed lords of the eight territories, to work hard before heading to the smithy.\n\nFinally, the moment had come to create the new mineral."
}