{
  "id": 1088,
  "title": "Chapter 1087",
  "content": "**[Adamantium that Lost its Light]**\n[-Debris from a crashed meteorite.\nPossesses the hardness and strength of adamantium, but has lost its divine power.\nWeight: 10]\n\nAt Reinhardt's smithy...\n\n\"Hrmm...\"\n\nGrid turned the dull grey matter over in his hands, brow furrowed in thought. Adamantium was a mineral that grew naturally in the divine realm—so why would a meteorite be classified as adamantium?\n\nDwarf Ke approached, his footsteps echoing across the stone floor. \"It is said that Goddess Rebecca split the highest mountains in the distant heavens, forming the sun, moon, and stars from the shattered fragments.\" He spoke with the gravity of one recounting ancient truth. \"Those fragments of that primordial mountain—that was the first adamantium.\"\n\n\"I see.\"\n\nThe fundamental role of NPCs and quests revealed itself once more through this endowment of lore. Grid nodded, absorbing the explanation.\n\nThen Ke posed another question. \"So what do you think bloodstone is?\"\n\n\"...?\"\n\n\"The foundation upon which we blacksmiths build our understanding of mineral creation comes from the teachings of the Goddess of Light herself. We know minerals' role in creation because the material the goddess used to forge all things was adamantium.\"\n\n\"...\"\n\nKe had spent over a century trapped in the Abyss, which often left him scattered and unfocused—more troublesome than a child at times. But not now. Now he spoke with perfect clarity, exuding the dignity of a true craftsman. This was the 'dwarf archetype' Grid had always envisioned.\n\n\"Which means there should be no minerals in Hell, yes? The myths describe Yatan only as an evil god of destruction. Though he sleeps between cycles, he is always plotting the world's end. So how does one explain the existence of minerals—tools of *creation*—in his realm?\" Ke paused, his expression deadly serious. \"Fart?\"\n\n\"...\"\n\n*Tone really does matter,* Grid thought, his concentration shattering.\n\nKe had been asking profound questions, demonstrating mythological knowledge that few players could match. But that last word—\"fart\"—had demolished the entire atmosphere.\n\nIs this how others felt when talking to him? The newly self-aware Grid made a silent vow.\n\n*I need to read more actual books in the future.*\n\nNow that he thought about it, well-read people stood out from an early age. Especially those who read extensively from sites like FreeWebNovels—they possessed intellectual appeal and superior interpersonal skills. Many of them met wonderful, capable wives or handsome, accomplished husbands and went straight to marriage.\n\nGrid's consciousness had just started wandering down this tangent when—\n\n\"I sense there's a massive twist to it all,\" Ke said, jarring him back to reality.\n\n\"...!!\"\n\n*He noticed inconsistencies in the entire mythology just from examining the concept of minerals?* If true, Ke would be exceptional even among dwarves. Grid felt a surge of admiration—then an old memory surfaced.\n\n\"In the end, don't the demonkin need a living environment? I've visited Hell myself. There were fences, villages, houses, castles. Of course there were blacksmiths. It wouldn't be unusual for Hell to have minerals, since they need resources to live. Besides, Yatan is a god of *cyclical* destruction. Would he care what lives there create before his time of activity returns?\"\n\n\"That's a common sense answer. But isn't it still strange? Yatan opposes the Goddess of Light, and Hell is a world in conflict with the divine realm. So why would a concept *created by the Goddess of Light* permeate Hell? I can't accept it.\"\n\n\"...\"\n\nGrid sensed where this was leading. Ke was about to voice questions that might be unacceptable in this world. *Rebecca and Yatan might not actually be opposed to each other...* Well, it was the obvious conclusion.\n\n*Don't tell me...?*\n\n\"Oof! Oof oof!!\"\n\nGrid clamped his hand over Ke's mouth just as the dwarf opened it to continue. He remembered the 'gods' who appeared whenever he approached topics related to the Seven Malignant Saints. The instant Ke began raising this question, Grid felt it might not be forgiven—and acted reflexively.\n\n\"Dammit!\" Ke shoved Grid's hand away, face flushed with anger. \"You're the same as the rest! Telling me to stop spouting nonsense and shut up? You're treating me like a foolish old man! Isn't that right?\"\n\n\"...\"\n\nKe seemed to have suffered many unjust experiences. Had he fled Talima and Lubana for the empire because he'd lost his standing? Was it the gods' curse?\n\n*Then as a result, he got trapped in the Abyss? No, that's too much.*\n\nBut then, these were petty gods. Could they truly be called almighty and benevolent when they constantly monitored the mortal world?\n\nGrid had glimpsed the truth of the world through the Seven Malignant Saints. He'd witnessed the inferiority of the gods through Hexetia. And now he found himself curious about the 'expelled gods' the Grandmaster had mentioned. Did the Grandmaster consider them the true gods, banished by the current divine order?\n\n*I wish we could have talked longer.*\n\nAn incarnation of the Seven Malignant Saints...\n\nThe Grandmaster was more valuable than Emperor Juander himself. A proper conversation would have provided Grid with invaluable information. It was just that the circumstances hadn't allowed for focused dialogue. Grid felt the loss keenly.\n\n*I'll get another chance someday.*\n\nHe wasn't too worried. Grid was convinced the Grandmaster still lived, that they would eventually meet again. He just didn't know if it would be to his benefit.\n\n\"Have you calmed down?\" Grid removed his hand from Ke's mouth. The agitated dwarf's energy soon drained, leaving him subdued.\n\nGrid tried to soothe him. \"I have no intention of ignoring or dismissing you. I stopped you because the words you were about to speak could have endangered you.\"\n\nKe's eyes widened in surprise. His words would endanger him? There was truth in that.\n\n\"You're right... I've suffered misfortune every time I've told this story. Perhaps it *is* the gods' curse?\"\n\nFor dwarves, the concept of 'transcendent curses' wasn't foreign. They were the ones who'd been tormented by the dragon Trauka for centuries. Ke shuddered, glancing around nervously. A chill crawled down his spine at the thought that someone—or something—might be watching from the shadows.\n\nGrid reassured him. \"You don't need to be anxious. As long as you're by my side, you're safe.\"\n\n\"...\"\n\nGrid's Dignity and Charm stats were exceptionally high. He also excelled at amplifying those stats through items. With the king's sword and crown dramatically boosting his presence, Grid's confident assertion of Ke's safety resonated deeply—the dwarf felt genuine trust and relief wash over him.\n\n[Affinity with the dwarf 'Ke' has increased by 3.]\n\n\"...I'll take my leave now. The castle will be repaired and expanded as I promised. Rest assured and focus on creating your new mineral.\" Ke's tone had shifted, becoming noticeably more respectful.\n\nIt was tremendously encouraging that Grid had managed to raise his affinity with Ke, who had lived for centuries and witnessed the legends of old. Grid considered for a moment whether to show him the imperial palace blueprint, but decided it was too soon. Besides, he'd been saving that blueprint with Eat Spicy Jokbal in mind.\n\nEat Spicy Jokbal still hadn't officially joined the Overgeared Guild, yet he'd unknowingly provided immense assistance over the years. The dungeons he built around Reinhardt attracted monsters away from small villages while providing hunting grounds for beginners, intermediate players, and high-level users alike.\n\n*\"I'm not a fool. I'll never build a dungeon for the Overgeared Guild,\"* he still claimed—despite years of actions proving otherwise.\n\nHe used helping his niece Elizabeth as an excuse, but the Overgeared members knew better. Eat Spicy Jokbal had been cooking with Poison Master Idan, providing meals to Overgeared members regularly—he was genuinely well-liked now. Something was just holding him back. He wanted to join but hesitated for some reason.\n\nGrid didn't know the exact cause. Initially it seemed connected to being denied the dragon egg, but that no longer appeared to be the case.\n\n*Everyone has their circumstances...*\n\nEat Spicy Jokbal was an enigmatic figure who'd founded and operated the shadowy organization Blood Carnival. It would take considerable time to open his heart and learn his story.\n\nGrid pushed the thoughts aside and began working the bellows. The furnace temperature rapidly climbed to precisely where Grid needed it. The smelting process had to be done separately—adamantium, insane dragon iron, black mithril, and Berith's Hoof all had different melting points. This wasn't a task that could be rushed.\n\n*Concentrate.*\n\nMetal liquefied in the roaring flames. The four minerals each had distinct shapes and colors, but all glowed crimson once smelted. Heat surged through the smithy, drenching Grid in sweat. If Grid weren't a blacksmith—if he weren't a legend—he might have retreated or collapsed from the infernal temperature. As it was, Grid remained as composed as someone relaxing in a sauna. Still, he didn't let his guard down. To successfully smelt and fuse five minerals including pavranium, he couldn't afford to lose focus for even a tenth of a second.\n\n\"Let's meet again with a new form.\"\n\nA golden blade...\n\nThe pavranium floating around Grid dove into the furnace of its own accord. This was the moment when the Blade Aiming at the Gods—which possessed the characteristics of summoning 'golden clouds' and 'God Hands' with low probability after being struck, but remained largely ineffective due to Grid's abysmal luck—vanished from the world. The newly reborn pavranium would be far more active than it had been during the God Hands era.\n\nHe swore it again and again. Grid succeeded in smelting the pavranium and finally began the fusion process.\n\n[Pavranium, created with the skills and knowledge of legends, has been reborn at your fingertips.]\n\n[Very high Dexterity has been detected.]\n\n[The Legendary Blacksmith's techniques have led to the creation of a new mineral.]\n\n[Potential knowledge has been detected.]\n\n[The characteristics of Duke of Wisdom are assisting in the mineral creation process.]\n\n[Multiple epics have been detected.]\n\n[The stories woven through your existence are soaking into the new mineral.]\n\nBrilliant light flooded the smithy and spilled beyond its walls. Though modest compared to Saharan's red energy that had blanketed the entire imperial capital, the golden radiance at Reinhardt's heart was a magnificent spectacle that captured everyone's attention.\n\n[Congratulations! You have succeeded in creating a new mineral!]\n\n[Please name the new mineral!]\n\nA substance that had never existed was born at Grid's fingertips—a 'Grid-exclusive material' that transcended even the concept of 'class-specific items' possessed by hidden classes.\n\n\"Ah...\"\n\nHow much adversity and hardship had he overcome to reach this moment? The emotional Grid opened his mouth. \"The name of the new mineral is...\""
}