{
  "id": 1089,
  "title": "Chapter 1088",
  "content": "# Chapter: Greed\n\n\"So what should I call this new mineral?\"\n\n*Overgeared Stone*, obviously.\n\n'...Absolutely not.'\n\nWhat about *Overgearanium*?\n\n'Even worse.'\n\nGrid grimaced. True growth meant developing on multiple fronts—when side A improved, side B naturally followed, creating synergy. That was how humans evolved. Thanks to his recently enhanced intelligence, Grid had finally realized something crucial: his naming sense was *abysmal*.\n\n'Both options are terrible.'\n\nHe finally understood Lauel's pained expression when he'd first announced the names \"Overgeared Guild\" and \"Overgeared Kingdom.\" His strategist had adapted over time, but those early nights must have been sleepless. Though admittedly, from an outside perspective, the names probably seemed fine.\n\nGrid scratched his cheek, then his chin. He couldn't just slap \"Overgeared\" in front of everything he created. It was monotonous. Boring. Hell, he'd nearly called the White Tiger Sword the \"Stone Sword\"—or was it the other way around? Either way, that disaster had made him take naming seriously.\n\n'Can't use Grivurnum.'\n\nThat name was already promised to Braham. When they eventually created a mineral together, *that* would be Grivurnum. This black-gold creation had evolved from pavranium. Even though the Duke of Wisdom had contributed through his blessings, Braham would be furious if Grid used his name for something he'd had no direct hand in creating.\n\n\"Okay, Grivurnum's off the table. Don't worry, sleep well,\" Grid muttered toward his unconscious companion while organizing his inventory.\n\nAnother one of his talking-to-himself habits.\n\nHe recovered the white light mithril, Astaroth's Horn, the Strengthened Blue Dragon's Breath, and the cave cricket shell—all materials that had been broken down during the smelting of the Blade Aiming at the Gods. The white light mithril had taken serious damage to its durability, but the rest remained mostly intact.\n\n'...Alright. I've decided.'\n\nGrid finished sorting and focused on the notification window floating before him.\n\n**[Please name the new mineral.]**\n\nThe answer came easily.\n\n\"Greed.\"\n\nThis mineral embodied infinite desire. It would never be consumed. It would multiply endlessly. The name fit perfectly—it reflected its creator, someone who'd reached the summit only to set his sights on an even higher mountain.\n\n\"I'll name it Greed.\"\n\nThe name would also serve as a reminder. Grid knew that unchecked greed was poison. He didn't yet understand the problems that Greed's proliferation might cause in the future. Only Braham could solve those issues—a being who possessed both profound wisdom and the knowledge to apply it.\n\nOn the day Braham returned, Grid would be complete. He believed this as he clutched the small, melon-sized black-gold mineral. His fingers tingled with anticipation.\n\n**[Naming complete.]**\n\n**[Updating mineral information...]**\n\n*Ding!*\n\n**[Greed]**\n\n**Durability:** Infinite\n\n*The legendary blacksmith Pagma and the legendary great magician Braham's collaborative work, pavranium, has been reborn through Grid's skills and epics. Many new characteristics have been added.*\n\n**Properties:**\n* Acquired healing skill through Goddess Rebecca's blessing: Increases owner's health recovery rate by 300%\n* Acquired attack buff through God Dominion's blessing: Owner's attack power increased by 15%\n* Acquired defense buff through God Judar's blessing: Owner's defense increased by 15%\n* Acquired magic power buff through God Yatan's blessing: Owner's magic power increased by 15%\n* Judges and acts independently, prioritizing master's commands. All movement requires zero energy\n* Hardness, strength, and brittleness cannot be changed beyond certain limits\n* Completely absorbs all properties (Warning: Do not grant conflicting properties simultaneously)\n* **Proliferation:** Doubles volume and weight every 10 days when in pure form\n* High chance to activate *Crushing* and *Reconstruction* effects on impact\n\n**★ Passive skill 'Always Together' automatically applied**\n\n**★ Titles 'Legend of the Canyon' and 'Protagonist of Two Eras' shared with Greed**\n\n\"Holy shit...\"\n\nEverything had merged seamlessly. The unique properties of pavranium—the ultimate mineral. The adamantium that had lost its holy power. The black mithril gifted by Empress Basara. The demonic stone purified of its corruption. The enhanced characteristics of Berith's Hoof, transformed through Ultimate Alchemy. Even the titles earned from his epics.\n\n*All of it* had fused into Greed.\n\nThe result exceeded Grid's wildest expectations. Could he have imagined that his legendary accomplishments would physically manifest in mineral form? And that proliferation effect—perfectly calibrated.\n\nSystem correction was something every Satisfy player benefited from. The game auto-corrected blueprints, compensated for gaps in knowledge, and smoothed out technical imperfections. It was why Grid could draw flawless designs and work across multiple disciplines without formal training.\n\nThe system implemented solutions for problems beyond a player's knowledge based on skill *probability*. Mineral creation apparently worked the same way.\n\nGrid had been worried. The insane dragon iron's proliferation didn't just duplicate mass—it added volume exponentially. Imagine if a sword made from Greed grew larger and heavier every ten days. At some point, he'd have to dismantle it and forge something new, or use the Insane Dragon Hammer to strip away the proliferation trait entirely. Wasteful, though manageable since the base material would keep multiplying.\n\nNow all those concerns were moot. Greed only proliferated in its pure, unworked form.\n\n'Once it's multiplied enough, I can break off pieces and craft items.'\n\nThose items would remain perfect forever.\n\nGrid's heart hammered with excitement. Joy beyond words flooded through him.\n\n\"Alright... let's leave it like this for now.\"\n\nThe mysterious spherical mineral gleamed black and gold. Grid stroked the light elemental perched on his shoulder and dove into his work. He wanted to experiment with the remaining 101 units of black mithril. What effect would the Hero King's fighting energy have? Could he transfer these properties to other minerals? What about imbuing items with the power of his pets and summons?\n\nSo many questions.\n\nHis curiosity burned. Thanks to his *Genuine - (Fighting Against the Gods) Legendary Blacksmith's Craftsmanship*, he was guaranteed at least epic-rated results. The Blacksmith Hammer to Go Against the Gods amplified everything further. He could afford to experiment freely.\n\n*CLANG! CLANG! CLANG!*\n\nClear, resonant hammer strikes echoed through the smithy complex for the first time in weeks. Hundreds, then thousands of blacksmiths gathered to watch Grid work. Energy surged through the Overgeared workshops once more. For the next month, Grid planned to focus entirely on experimentation while Greed proliferated three times over.\n\n'Then I'll create two new items with the multiplied material.'\n\nThat unique satisfaction only blacksmithing could provide settled over him. His smile never faded.\n\n---\n\nTime flew.\n\nBefore long, discussions about the next National Competition dominated conversation. Media outlets worldwide scrambled to analyze who'd been selected as the next \"Demon King.\" But most rankers paid more attention to the Overgeared Kingdom than the tournament.\n\n\"The pace of economic growth there is *insane* lately, don't you think?\"\n\n\"They've got a complete alliance with the Empire. They can expand without fear.\"\n\n\"It's beyond alliance at this point. More like the Empire's about to absorb them.\"\n\n\"I heard the Emperor's completely obsessed with Grid.\"\n\n\"You mean *Empress*. Though yeah, crazy either way...\"\n\n\"That's because Grid's the one who *made* Basara Empress in the first place.\"\n\n\"Come on. Even if it's Grid, how could he orchestrate something like that?\"\n\n\"Have you read his epic? The timeline matches up perfectly.\"\n\n\"You can interpret epics multiple ways. It's coincidence. Has to be.\"\n\n\"So what, it's all luck then? Bullshit. When 'luck' happens consistently, it's not luck—it's *skill*. Grid intended for Basara to become Empress. I'm convinced.\"\n\n\"Fine, whatever. What are you going to do about it?\"\n\n\"Move to the Overgeared Kingdom.\"\n\n\"What? You too?\"\n\n\"Yeah. The way things are going, I don't see a future here. When the Overgeared Kingdom gets ambitious, we'll be the first nation they swallow. Better to migrate now.\"\n\n\"Hmm...\"\n\nThe player base was fracturing. Two clear options emerged: the safe, stable Empire, or the Overgeared Kingdom with its explosive potential. Under Empress Basara's unification policies, the Empire had grown steadily—but its expansion opportunities were exhausted. Meanwhile, the Overgeared Kingdom was reaching critical mass, poised to devour neighboring territories.\n\nOutside these two powers, the rest of the world offered little hope. Players needed to choose. Better to jump ship early. Three factors drove this mass migration:\n\nFirst, the Overgeared Kingdom's obvious expansionist trajectory.\n\nSecond, the Great Demon Berith incident had proven the critical importance of strong national backing.\n\nThird, the wild card of the East Continent.\n\nAs information about the East Continent spread, fear of the Hwan Kingdom and its yangbans intensified. A vicious force that dominated an entire continent... If those transcendent beings—who possessed civility far exceeding even the old Saharan Empire—turned their attention westward, weak nations would crumble overnight. The resulting damage to displaced players would be catastrophic.\n\nOnly two powers could withstand that pressure: the Empire and the Overgeared Kingdom.\n\nThe Overgeared Kingdom was the protagonist of this new era. And with this new era came profound changes.\n\n\"Grruk. Kurruk.\"\n\nOrcs emerged from hiding.\n\n\"...\"\n\nElves stepped into the light.\n\n\"Kuahahat!\"\n\nHalf-draconians spread their wings.\n\nSpecies that had concealed themselves across the continent to escape Imperial tyranny began to surface, drawn to the promise of a new order.\n\n---"
}