{
  "id": 109,
  "title": "Chapter 109",
  "content": "# Chapter 109\n\nMost of the people at the reunion had come to make fun of me. But now that I'd clawed my way out of debt and found success, no one could touch me. The whole gathering lost its purpose. The room felt hollow, awkward.\n\nLee Junho couldn't even look at me. He drained his glass in silence and left first. After that, the mood shifted. People started noticing the empty seat where the ringleader had been. Questions came at me like arrows.\n\n\"How the hell did you show up in a 13 series? Did you win the lottery or something? Last time I saw you, you were drowning in debt.\"\n\n\"Are you a ranker in Satisfy now, Youngwoo? Did you make bank from streaming? Should we be watching for you on TV?\"\n\nA guy I barely remembered leaned forward. \"What's the deal with you and Yura? Are you two actually dating?\"\n\nSomeone else whistled. \"Dating the woman who's every man's fantasy. I can't even imagine how good that must feel.\"\n\nCuriosity. Envy. Jealousy. I could see it all swimming in their eyes, and I was drinking it in like expensive wine.\n\nThen a few people I'd once considered friends sidled up to me.\n\n\"Hey, Youngwoo. You remember how close we were back in school, right? Those were fun times. Don't you miss it sometimes? We should hang out again.\"\n\nAnother one jumped in. \"Yes, that's perfect. Everyone drifted apart after the army and university. It'll be just like old times.\"\n\nThe third one grinned. \"You should bring Yura when we meet up. It's only natural to introduce your girlfriend to your friends, right?\"\n\nThe first guy spoke again, voice dropping to something almost pleading. \"Hey, so... could I maybe drive your car? I've always wanted to try the 13 series. Just five minutes. Come on, please?\"\n\nThese bastards had turned their backs on me when I needed help. They'd laughed along with the others when I was nothing. Now they wanted to be friends again.\n\nI shut them down cold.\n\n\"You want to come crawling back now and play friends? Shut your mouths. You're looking at me with the same jealousy as everyone else. I'm here to laugh at you. That's all.\"\n\n\"What?\"\n\n\"The hell is with this bastard's attitude? You think you can act like this just because you're doing well now?\"\n\nI'd hit them where it hurt. They were upset. Good.\n\nI scoffed. \"Isn't it funny? You sound exactly like Lee Junho did earlier. Why did you laugh at me? Why did you ignore me until I started succeeding? You were the ones harassing people in the first place. Now look at yourselves. Do you really think you can still push me around?\"\n\n\"You...!\"\n\nTheir faces went red. Veins bulged in their necks. But none of them could argue back.\n\n\"You're the bastards who only feel superior when you're stepping on someone weaker.\"\n\nMy voice came out flat. I knew this was the end. After tonight, any relationship I'd had with these people was finished. I grabbed my coat and walked out.\n\n***\n\nThe engine of the 23 rumbled to life. I set my home address in the navigation system and selected automatic driving. The car was about to pull away when someone tapped on the window.\n\nAhyoung.\n\nI rolled the window down. She stared at me with anxious eyes.\n\n\"Are you leaving?\"\n\n*Kim Ahyoung.*\n\nJust days ago, she'd been everything to me. I'd loved her so much that I'd dreamed of dating her, marrying her, more than a hundred times. But now, looking at her, I felt nothing. The emotions had evaporated like water on hot stone.\n\nOnce I'd seen who she really was, the disappointment and betrayal had killed whatever lingered.\n\n\"The kids who used to look down on me are jealous now. The ones who abandoned me are clinging. I got my revenge. If I stay longer, someone's going to throw a punch, and that's a waste of my time.\"\n\nWhen I'd liked Ahyoung, I couldn't meet her eyes properly. My heart had hammered in my chest. I'd babbled nonsense. Now it was different. No emotions meant I could look straight at her and speak clearly.\n\n\"Take care, Ahyoung. I liked you.\"\n\nShe grabbed my arm. \"L-Liked? Past tense? Are you saying you don't like me anymore? I... I like you!\"\n\nShe was still my first love. That fact wouldn't change, even if she'd trampled on my heart. I wanted to leave with whatever good memories remained intact, without destroying her illusions completely. I'd been blind for thirteen years. I didn't want to leave any opening for her to cling to.\n\n\"Can't you see? I have Yura now. Someone so far above you there's no comparison. It would be stupid to throw that away. I don't have any feelings for you.\"\n\n\"Youngwoo, you...!\"\n\nI made my voice as cold as I could manage. Then I pulled away from her sad, hurt expression.\n\n\"This is the end.\"\n\nThe bad connection between us, that poisonous thread from the past, was finally cut. Now I could start fresh.\n\n***\n\nOn the drive home, I replayed the conversation I'd had with Yura earlier.\n\n*\"After the Tzedakah Guild succeeded in the raid against Malacus, the Yatan Church's forces weakened rapidly. The Tzedakah Guild is now their primary enemy. They'll retaliate, and as everyone expected, I'm the Yatan Church's Eighth Servant. Conflict between us is inevitable.\"*\n\nI'd panicked. *\"Did you come to declare war? Are you going to kill me here? No matter how angry you are in the game, isn't killing people in reality going too far?\"*\n\n*\"Don't make me out to be a murderer. I just want to repay a debt from when we fought before.\"*\n\n*\"Debt?\"*\n\n*\"In the Yatan Temple quest. You beat me, but you logged out to help me clear the quest. Thanks to that, I consolidated my position in the Yatan Church and became the Eighth Servant. You're a great benefactor to me. It's hard for me to point a weapon at you.\"*\n\n*\"I deliberately logged out to help your quest? What are you talking about?\"*\n\nYura had firmly misunderstood something.\n\n*\"I wasn't trying to help your quest at that time. You don't owe me anything.\"*\n\nI'd wanted to clear up the misunderstanding. I didn't want to be connected to her. But she'd already dug deep into her deluded fantasy.\n\n*\"I don't know why you're denying it. Even if you didn't intend to help me like you claim, it doesn't change the fact that you did. I'll pay off this debt.\"*\n\nShe had a selfish streak a mile wide. In the end, I could only nod.\n\n*\"I guess words won't work. Fine. Do what you want. Then I can cut this bad connection sooner. How are you planning to pay it off?\"*\n\n*\"Bad connection...?\"*\n\nShe'd frowned like she didn't like the phrase. Even her frown was beautiful. It amazed me.\n\n*She's a scam.*\n\n*\"After war breaks out between the Yatan Church and the Tzedakah Guild, I won't kill you. I can't kill my benefactor. Although there might be situations where fighting is unavoidable.\"*\n\n*\"You'll spare me? Wow. I'm so thankful I'm on the verge of tears.\"*\n\nMy role in the Tzedakah Guild was blacksmith, not soldier. I didn't plan to get involved in guild activities unless I was directly affected, like the recent mess with the Giant Guild. Making items was a hundred times more profitable than fighting. I'd rather be the guild's blacksmith. There was basically no chance Yura and I would meet in a war.\n\nI'd felt assured and nodded.\n\n*\"Okay. I understand how you'll pay off your debt. Are we done? We've arrived at the destination. Let's separate. Please don't appear in front of me again. It's not good for my heart.\"*\n\nYura was the woman who'd destroyed the Yatan Temple while trying to kill me. Having a connection with her felt like torture. I'd wanted to separate quickly, but she'd had different thoughts.\n\n*\"It's not over. I want to pay off the debt in another form.\"*\n\n*\"What else?\"*\n\n*\"Excuse me, but I've been researching your past. Over the years, you've suffered humiliation because of your high school alumni.\"*\n\n*\"What?\"*\n\nWhy was she bringing up my shameful past? Didn't she know about privacy?\n\n*Is she a stalker?*\n\nI'd wanted to snap at her, but fear kept my mouth shut. She'd suggested, *\"You're going to attend a reunion, right? I'll come too. Let me pretend to be your girlfriend in front of your fellow alumni.\"*\n\nWhat nonsense was that?\n\n*\"Why?\"*\n\nShe'd explained kindly. *\"Once they find out that a famous, intelligent, and beautiful woman like me is your girlfriend, they'll stop making fun of you. You'll silence them all. How about it? Pretend to be lovers. Isn't this a great way to pay off my debt?\"*\n\nI'd been fairly certain Yura had a princess complex. It didn't make sense for a famous, intelligent, and beautiful woman to make that suggestion.\n\n*\"Isn't this a scene common in dramas and movies? The gender roles are reversed, but...\"*\n\nI'd vetoed it.\n\n*\"That's unnecessary. I can change my position with my own abilities.\"*\n\nI'd refused Yura's suggestion.\n\nBut as a result, the alumni had witnessed Yura getting out of my car and misunderstood that she was my girlfriend. They'd envied me enormously. The 13 series alone wouldn't have been enough to get that response.\n\n*The more I think about it, the stranger she is. What kind of person develops a misunderstanding like that, does a background check, and tries to repay a debt this way? Isn't it preposterous? Paying off a one-sided debt. She's insane.*\n\nBased on common sense, Yura seemed to have a narrower understanding of human relationships than I did.\n\n*She probably became strange after succeeding at an early age and living apart from others.*\n\nI arrived home. I went straight to the capsule and connected to Satisfy.\n\n***\n\nWinston had lost troops in multiple battles against the Yatan Church. The knight captain was wounded. The lady had been kidnapped. The city was becoming one of the best in the north, and the population was growing rapidly, but there was a limit to the guard forces.\n\nEarl Steim became aware of the situation. He led support troops to Winston.\n\n\"Father!\"\n\n\"My lovely daughter! You've become even more beautiful since I last saw you!\"\n\nEarl Steim was one of the most influential nobles in the Eternal Kingdom and the ruler of the north. But in front of his daughter, Irene, he was just a doting father. Despite the numerous soldiers and knights watching, Earl Steim embraced his daughter. Tears ran down his cheeks.\n\n\"You must have suffered! I'm sorry I burdened you so much! Thank you for being safe! Thank you!\"\n\nIrene was Earl Steim's only child. Rather than keeping her safe by his side, he'd appointed her as ruler of a territory. She'd been kidnapped again. He couldn't forgive himself.\n\nIrene shook her head. \"Father didn't do anything wrong. The whole thing was my fault. That's why... I wish I had a strong person taking care of me.\"\n\nEarl Steim glared at Phoenix.\n\n\"You're right. You need a strong person. Someone much better than the incompetent Captain Phoenix.\"\n\n\"Please kill me!\"\n\nPhoenix's guilt was unimaginable. He'd lost in the war. He hadn't been able to protect his master. Earl Steim ignored him and spoke to Irene. \"But sweetheart, Doran is dead. Unfortunately, there's no one stronger than Phoenix in the north. Leave Winston to him and return with me.\"\n\n\"No. There's someone here I can depend on. He's stronger and more courageous than anyone else.\"\n\n\"Oh?\"\n\nIrene was the daughter of a warrior. While she wasn't trained, her ability to recognize strength was excellent. She was complimenting someone so confidently that Earl Steim felt his expectations rise.\n\n\"Then who is this person?\"\n\n\"He's a blacksmith.\"\n\n\"Eh?\"\n\nThe answer from his daughter's smiling mouth was so unexpected that Earl Steim thought he'd heard wrong. He regained his composure and asked, \"Sweetheart. The strong and brave person you can rely on is a blacksmith? Did I hear that correctly?\"\n\nIrene nodded without shame.\n\n\"That's right. He's the great blacksmith who made the sword that became a family treasure not long ago. He's also the one who saved me from Malacus. Not just that. He's the hero who saved Winston from the Mero Company.\"\n\n\"Ha! That rumored person.\"\n\nHe was clearly a great person based on the achievements alone. But Earl Steim became frantic after seeing Irene's face.\n\n*My daughter has the face of a woman in love!*\n\nHe knew about the one who'd helped save Winston from the evils of the Mero Company. It had been reported that the man possessed the power of a legendary blacksmith. But a blacksmith strong enough to kill one of Yatan's servants?\n\nEarl Steim couldn't believe it.\n\n\"Sweetheart, no matter how I think about it, such a perfect person doesn't exist in this world. Is he handsome? It seems like you've been deceived by a scammer.\"\n\nIrene's voice rang out. \"I'm not deceived! Do you think I'm a pathetic woman who'll be enticed by looks? In the first place, he isn't really handsome!\"\n\nPhoenix and the knights nodded in unison.\n\n\"That's correct. He's talented, but his appearance...\"\n\nEarl Steim didn't like that either.\n\n\"An ugly man dares lure my daughter? Disgraceful! I want to see what type of person he is! Drag him in front of me right now!\"\n\nPhoenix cleared his throat. \"Earl, he's Winston's hero and Irene's savior. Shouldn't we bring him respectfully?\"\n\nEarl Steim grumbled. \"Yes. Bring him respectfully.\""
}