{
  "id": 1092,
  "title": "Chapter 1091",
  "content": "Grid studied the newly forged boots with satisfaction. The Arrogant Blue Dragon's Boots were flawless—every stat perfectly optimized, every enhancement seamlessly integrated. Only one detail nagged at him.\n\nThe Reconstruction option.\n\nWith infinite durability built into the Greed foundation, what was the point of a restoration function? Nothing could damage these boots in the first place. Still, the option came naturally from combining Berith's Hoof properties with his Protagonist of Two Eras title. Harmless redundancy. He could live with it.\n\nBut then Lauel's message appeared in his vision.\n\n—*Lightning God could turn you into a liability against magic-heavy opponents. Though I suppose only catastrophic luck would make that a real problem.*\n\nGrid's jaw tightened.\n\nLightning God. The conditional passive that granted complete physical immunity while doubling magical damage received. Low activation chance. High reward. Higher risk if it triggered at the wrong moment.\n\n\"Shit.\"\n\nHis luck stat was abysmal. Always had been. He'd once convinced himself that his rare strokes of good fortune were simply karma balancing out the constant disasters.\n\n'I can already see it happening. Fighting some archmage, Lightning God procs, and I get deleted.'\n\nThe anxiety coiled in his chest, tightening with each passing second.\n\n'No. Stop. You've been through worse.'\n\nHe forced himself to breathe. How many times had he survived \"obvious\" narrative pitfalls? The Braham Assimilation disaster during the 2nd National Competition came to mind—pulling out his trump card only to have Braham throw the fight against Kraugel through sheer arrogance.\n\nThat was years ago. Surely the entity writing his fate had better storytelling skills than to recycle the same tired plot twist.\n\n'And if it does happen...'\n\nLightning God came with Mana Burn. If a magician pushed him to the brink, he'd drain them dry and turn the tables. Simple.\n\n'I'll make it work. I always do.'\n\nHe'd learned to weaponize bad luck as efficiently as good fortune. Grid pulled on the boots—knee-high, sleek, perfectly tailored. He checked his reflection and grinned.\n\nThe extended coverage had eaten through more adamantium, but the investment was worth it. More surface area meant better defense distribution, and the metal's adjustable properties eliminated the mobility penalties that normally came with plate greaves.\n\n\"Quick Movements. Blackening.\"\n\nGrid drew the Ideal Dagger and accelerated. The theoretical player speed cap was one hundred meters in five seconds. He crossed the same distance in four, Greed-enhanced velocity blurring his form into streaks of black and crimson.\n\n*BOOM. BOOM. BOOM.*\n\nThe impacts echoed across the training field as he pushed harder, demonic energy trailing behind him in dark ribbons.\n\n\"What the—\"\n\nDawn had barely broken. The soldiers shuffling toward morning drills looked up, half-asleep complaints dying on their lips.\n\n\"Is that...?\"\n\nKnights stationed by the field perimeter snapped to attention. Their king was running laps. Again. And again. Relentless.\n\nHeat flushed through the ranks—shame mixing with sudden determination. Every soldier who'd cursed the early wake-up calls despite enlisting to protect their families. Every knight who'd privately questioned their vows during the endless grind.\n\nThey all knew. His Majesty had spent the last month locked in the smithy, working through the nights.\n\n'He's exhausted... but he's out here anyway...'\n\n'Setting the example...'\n\n[The soldiers' motivation and morale have surged dramatically!]\n\n'This is insane.'\n\nSoldier—a former Eternal Kingdom sailor who'd switched allegiances after losing to Peak Sword at Cork Island—watched the phenomenon unfold. He'd earned his promotion to Asmophel's lieutenant through consistent performance during the kingdom's founding, and lately he'd been running himself ragged covering for his commander's absence.\n\nManaging tens of thousands of troops without Asmophel's natural charisma was brutal. Morale had been sliding. Training efficiency dropping. No matter how skilled Soldier's fellow officers were, none of them could command the same respect.\n\nUntil now.\n\n\"Formations, ready!\"\n\n\"Give me everything you've got! Sound off!\"\n\n\"HOOOAAAHHH!\"\n\nThe previously listless soldiers trained with ferocious intensity, eyes bright, backs straight. All because Grid had simply shown up.\n\n'He's really something else.'\n\nSoldier smiled as the roar of synchronized drills filled the morning air. The Overgeared Kingdom was rapidly becoming a continental power, yet one man's presence could still ignite the entire army.\n\n\"Soldier.\"\n\n\"Sir!\"\n\nThe response was automatic, parade-ground crisp. Soldier's real-world military background made discipline second nature. Grid stood at the center of the field, gesturing him over. \"Let's spar.\"\n\n\"It would be an honor, Your Majesty!\"\n\nWho would refuse? Even a guaranteed loss was a masterclass opportunity. Soldier drew his blade and closed the distance fast—top-five-thousand-ranker fast. His opening strike carried real commitment.\n\nGrid didn't draw a weapon. He simply raised his leg to block.\n\n\"—?!\"\n\nThe impact sent Soldier stumbling backward, sword arm numbed by the recoil. Black metal had met steel and *won*. He tried to analyze the effect, find the exploit, but there was no time. He shifted targets to Grid's upper body—\n\nAnd Grid disappeared into a column of crackling lightning.\n\nSoldier's eyes widened. His king was *flying*, genuine flight without any visible magic, soaring overhead in a storm of blue-white energy.\n\n'Did he forge flying boots from the Water Clan King's essence—'\n\n\"Come Down.\"\n\nGrid inverted mid-air, spinning like a descending meteor. Lightning followed.\n\nThe bolt struck before Soldier's neurons could fire a dodge command. No human reflexes could avoid natural electricity.\n\n[You have suffered 30,000 damage.]\n\n[You have been inflicted with the 'Electric Shock' status!]\n\nHis body locked up, muscles seizing. Grid materialized behind him a heartbeat later. \"Good work. You can stand down.\"\n\n\"Yes, sir.\"\n\nGrid hadn't drawn a single weapon. He'd dismantled a top-five-thousand ranker with footwear alone. To outside observers, it would look like an exploit. But both combatants understood the truth.\n\nThis was nothing. Grid could have handled *dozens* of rankers with just the boots.\n\nThe tactical applications were beautiful. Achieve flight with Lightning Speed, establish distance, deny counterplay, chain attacks from untouchable angles. The Blue Dragon's Boots weren't equipment—they were a battlefield control system.\n\n'God, this game.'\n\nItems were everything. Grid felt the familiar rush of excitement and laughed, pure and unselfconscious.\n\nMeanwhile, Soldier was mentally congratulating his past self for joining the Overgeared Guild.\n\n* * *\n\nThe Violet Kingdom's call for an allied army went unanswered.\n\nIsolated, they attempted to repel the twilight orc invasion alone and failed spectacularly. Territory fell like dominoes. As media coverage spread the orcs' strength, player race-changes to orc spiked dramatically. The Violet Kingdom, now desperate, sent diplomatic requests across the continent, promising generous compensation.\n\nThe official letter reached the Overgeared Kingdom with similar terms. Grid's response was immediate refusal.\n\nThe Gauss Kingdom and other Overgeared neighbors also declined. Who would send troops abroad while an expansionist power loomed next door?\n\nKingdoms farther from the Overgeared sphere, however, scrambled to send forces. The Violet Kingdom's offered price was too tempting.\n\nEven the Fold Kingdom—barren land, scarce resources, barely three hundred thousand soldiers trained primarily for monster suppression—had reason to jump at the opportunity. Mercenary work could fill their coffers for years.\n\n\"We're declining.\"\n\nFold refused as well. They'd served the Overgeared Kingdom too long. Where Grid's will led, they followed.\n\n\"Was that all you came to report?\"\n\nGrid's tone carried mock reproach, but his expression was warm. He'd liked Prince Shining from their first meeting, and that opinion had only strengthened after Shining risked his life defending Irene and Lord during the Yatan Church's Vatican assault.\n\n\"I wanted an excuse to visit Your Majesty.\" Shining's face brightened. \"It's good to see you thriving.\"\n\nThe man who'd challenged the empire itself—the Overgeared King was Shining's personal hero.\n\nGrid chuckled. \"You're smooth. Go see the Queen and Prince while you're here. They'll want to catch up.\"\n\n\"I'd be honored.\"\n\n\"Hold on.\" Grid stopped him at the door.\n\nThe Fold Kingdom might be poor, but their soldiers were hardened veterans. And Prince Shining, already designated heir apparent, was a named NPC—which meant unlimited growth potential.\n\n\"Take this.\"\n\n\"...!!\"\n\nThe blade was translucent blue, shaped like some predatory deep-sea creature the landlocked Fold Kingdom had never seen. Shining stared at Failure like it was a divine relic.\n\n\"I've carried this sword for over a decade.\"\n\nThe stat requirements made it impossible to give to his guild members, and he had stockpiles of blue orichalcum to forge superior replacements now that his technique had advanced. No need to mention those details.\n\n\"You won't be able to wield it yet. But when you master it, you'll be formidable. Make that your goal.\"\n\n\"Your Majesty, I—\"\n\n\"Consider it payment for protecting my family.\"\n\n\"I only did my duty. This is too much—\"\n\n\"Stop arguing and take the damn sword.\"\n\n\"...\"\n\nSubordinate nations existed to be exploited. That was the standard model. But the Fold Kingdom's relationship with Overgeared had never followed convention. Since pledging service, they'd received continuous benefits—imperial protection, food security, royal stability.\n\nNow this. A weapon worthy of becoming a dynastic treasure. A symbol of the Overgeared Kingdom itself, placed in Prince Shining's hands.\n\nHe stood speechless for several heartbeats before managing to force words through his constricted throat. \"I will never forget this grace. The Fold Kingdom will repay it for generations.\"\n\nA minor gesture from Grid had just secured another eternal ally."
}