{
  "id": 1095,
  "title": "Chapter 1094",
  "content": "**Chapter: The Orc Lord's Challenge**\n\nThe panic subsided.\n\nWhere fear had gripped the continent—voices crying out about the \"worst calamity since the Great Demons\"—reason slowly returned. Discussion threads that had spiraled into hysteria began to stabilize.\n\n*The threat isn't as dire as we thought.*\n\n*Nothing like the Great Demons at all.*\n\nThe distinction was crucial. When Great Demons walked the earth, humanity had been livestock. Slaughtered without mercy. Humiliated without reason. Tortured for sport. But orcs? They were different. Brutal, yes—but intelligent. They could be *reasoned* with. They didn't wage war for sadistic pleasure or to impose some twisted ideology. They simply needed land. Territory to call their own.\n\n\"I am Teruchan, lord of great warriors!\" The voice boomed across the field, guttural and commanding. \"My warriors have no taste for torturing the weak! Guruk! Gruruk! Surrender your land, raise the white flag, and we guarantee your safety!\"\n\nHowl Fortress. The gateway to the Fold Kingdom. Thirty thousand elite soldiers manned its walls—veterans who'd weathered every crisis the kingdom had faced. Knights who'd turned back invasion after invasion.\n\nThe army stationed here was legendary. Even the Saharan Empire thought twice before testing Howl's defenses. It was why the Fold Kingdom had dared ally with the Overgeared Kingdom despite the Empire's wrath—Howl Fortress was their shield, their sword, their unbreakable wall.\n\nAnd yet...\n\n\"Damn orcs. Why target *us*?\" One soldier spat over the battlements. \"Plenty of richer kingdoms out there.\"\n\n\"Right? Our land's barren as hell. What do they even want with it?\"\n\n\"Maybe they don't realize? They seem... articulate enough. Perhaps if we *explain* the situation, they'll withdraw?\"\n\nEven Howl's legendary garrison trembled.\n\nBelow the walls, one hundred thousand orcs stood in formation. Each dark-skinned warrior topped two meters, muscle-bound and armed. But it was the figure at their head that made soldiers' bowels turn to water. The orc lord himself. Meeting his gaze alone was enough to bring bile rising in your throat. More than one man had already pissed himself.\n\n\"A conversation.\" Marquis Veze—Lord of Howl, commander of the fortress, and living legend among Guardian Knight players across the world—reached his decision. \"Yes. Dialogue is the answer. Open the gates. I'm going out.\"\n\n\"My lord, you *cannot*!\"\n\nHis retainers erupted in protest. True, the orcs had shown surprising restraint so far. Every village they'd passed remained intact, their people unharmed. In that sense, these orcs demonstrated more honor than some *humans*. But this could all be theater. Performance. The orcs were still the enemy, and no commander with half a brain walked into enemy territory unarmed.\n\n\"They'll capture you!\"\n\n\"One hostage situation and this fortress falls!\"\n\n\"Send the warden instead! Anyone but you!\"\n\n\"What message does that send?\" Veze's voice cut through the chaos. \"That our commander cowers behind walls while demanding parley? They'd laugh us off the field.\"\n\n\"Then fight! My lord, going out there yourself is suicide!\"\n\n\"They're *orcs*! Monsters! There's nothing to negotiate!\"\n\n\"And if we fight?\" Veze's question silenced them all. \"What then?\"\n\n\"We have thirty thousand trained soldiers! We can hold these walls!\"\n\n\"Reinforcements are coming from the capital!\"\n\n\"Can we hold that long?\"\n\n\"...\"\n\nEvery eye followed the marquis's gaze. There—embedded in the fortress gate—a massive spear. Orc Lord Teruchan had thrown it from *beyond visual range*. The impact had spiderwebbed cracks through the fortification's stonework. Even combining the strength of dozens of knights hadn't budged it. The weapon sat lodged in the gate as though it had always been part of the structure.\n\n\"Two days.\" Veze's voice was flat. \"If they attack, the walls last two days at most. When they collapse, this fortress becomes a slaughterhouse. I'd rather negotiate than pile up corpses in a battle we cannot win.\"\n\n\"But if something happens to you, my lord, we won't last two *hours*!\"\n\n\"Then the moment they strike me down, you abandon Howl and retreat to the capital. Prince Shining will understand. He'll take you in.\"\n\n\"You expect us to *run*? To abandon our post without even fighting?\"\n\n\"Yes. Some will call you cowards. Let them. History will record that your choice today was the only way to preserve the kingdom. Bear that shame for your country.\"\n\n\"Sir...!\"\n\nThere was no dissuading him. Marquis Veze pushed through his officers' blockade and strode toward the gates.\n\n\"Gods above...\"\n\nNobles and knights scrambled to the battlements, watching their commander cross the killing field. Marquis Veze was a Guardian Knight, master of defensive arts. His frame was imposing—built like a fortress himself. Yet among the orcs, he seemed diminished. And standing before Teruchan...\n\nHe looked like a child.\n\n\"I am Veze, commander of this fortress and Marquis of the Fold Kingdom.\" His voice rang clear across the field. \"Orc Lord Teruchan, I come to speak truth—however shameful.\"\n\n\"Grruk. Kruruk!\" Teruchan's eyes gleamed with interest. \"Speak, then.\" \n\nWhatever else he was, the orc lord respected courage. A lone warrior walking unarmed into an army of a hundred thousand deserved to be heard.\n\n\"The Fold Kingdom possesses the most barren territory on the continent.\" The words tasted like ash. \"Mountains and wasteland, nothing more. No sea access. No fertile plains. It holds no value—even for orcs.\"\n\n\"Then we should invade elsewhere? Grruk.\"\n\n\"I'm asking you to *withdraw*.\"\n\nThe Fold Kingdom spawned more monsters than any other realm. Marquis Veze had spent decades on the frontlines, cutting down tens of thousands of creatures. Orcs had always been among them—monsters to be eliminated. Bowing to them now...\n\nThe shame burned. The guilt threatened to choke him. But he lowered his head anyway.\n\n\"The Fold Kingdom isn't worth conquering. Please. Withdraw.\"\n\nDisparaging his own nation. A crime bordering on treason, regardless of intent. Veze had devoted his life to defending this kingdom, and now here he stood, declaring it worthless. But if belittling his homeland convinced the orcs to leave...\n\nAfter all, the assessment was accurate. Even internationally, the Fold Kingdom was considered a backwater.\n\nTeruchan's laughter rolled across the field. \"For our warriors, the Fold Kingdom is *perfect*.\"\n\n\"...What?\"\n\nThis wasn't the script. Veze had gambled on their ignorance—assumed they'd invaded without understanding what they were taking. Once they realized there was no profit here, no resources to plunder, they'd move on. That was the plan.\n\nInstead...\n\nTeruchan's grin widened, revealing teeth like daggers. \"Grruk. Our warriors train by hunting monsters. We grow strong through combat.\"\n\n\"...!\"\n\n\"More monsters here than anywhere else. Grruk. Kurruk. The Fold Kingdom is exactly what we need.\"\n\n*Failure*.\n\nThe revelation hit like a physical blow. Hope drained from Veze's chest. His mind raced—calculating, adapting. He needed to get back to the fortress. Order a full retreat. Rally every garrison across the kingdom to the capital for a unified defense. It was their only chance.\n\nThen he noticed the red-spotted leopards.\n\nThousands of them, domesticated by the orcs. Beasts capable of hunting B-rank monsters. Several times faster than horses. Any retreat would become a massacre.\n\nTeruchan followed his gaze and, remarkably, showed mercy.\n\n\"Human with courage.\"\n\n\"...?\"\n\n\"You speak with dignity before me. Grruk. Your bearing marks you as a warrior.\" The orc lord's tone shifted, taking on weight. \"Kurruk. By warrior's honor, I offer you a chance.\"\n\n\"...!\" \n\n*A chance!* The dying ember of hope flared back to life. If the orc lord himself offered terms, perhaps survival was possible after all.\n\n\"Thank you!\"\n\n\"Fight me.\"\n\nA duel. And—somehow—one weighted in Veze's favor.\n\n\"Match blows with me, Orc Lord Teruchan. Grruk. Kurruk. Survive ten exchanges, and I will recognize you as a true warrior. I will withdraw. Grruk.\"\n\n\"...\" Veze couldn't process it. \n\nHe didn't need to *win*. Just survive ten blows, and an army of one hundred thousand would turn around and march away? It seemed too good to be true. Suspicion crept in.\n\nTeruchan found the wary expression amusing. \"Our warriors watch. Your men watch. Guruk. I speak before witnesses. Kurruk. If I break my word, grruk, I lose my seat as lord.\"\n\nBinding. Absolute. In orc culture, such a declaration couldn't be violated.\n\nMarquis Veze nodded slowly. \"Very well. I accept your terms. Hold to your promise.\"\n\nThe rope was frayed, half-rotted—but it was the only lifeline offered. If he didn't grasp it now, only annihilation awaited.\n\nThe marquis drew his sword and raised his shield. Every movement was textbook perfect—the result of decades mastering defensive arts. He was more than a warrior. He was an *icon*. Knights across nations studied his techniques. Millions of Guardian Knight players idolized him.\n\nThe orcs roared approval. His stance was flawless. Shield coverage total. Blade positioned for counterattack. No openings. Any assault would be blocked, deflected, punished.\n\nTeruchan threw back his head and laughed. \"Indeed! An outstanding warrior, just as I sensed! Kuhahahaha!\"\n\nThe orc lord's skin was dark as twilight, thicker than steel plating. Muscles rippled like living stone. His hands—large enough to palm a watermelon—were covered in calluses that spoke of endless training. This was no savage relying on brute strength alone. This was a *warrior*.\n\nThe pressure radiating from Teruchan was suffocating. Yet Marquis Veze didn't falter. He'd spent his entire career as the underdog. Born in the weakest kingdom, he'd learned to fight uphill battles. Learned how to topple stronger foes through skill, timing, and unwavering resolve.\n\n*Bring it.*\n\nEvery defensive skill activated simultaneously. Seven techniques—each capable of nullifying an ultimate-tier attack. Among Guardian Knights, mastering even *one* would mark you as elite.\n\nTogether, they made Marquis Veze immovable as an ancient tree.\n\nHis shield rose. Teruchan's broadsword descended.\n\nThen—\n\n\"*Cough!*\"\n\nMarquis Veze's body launched backward like a cannonball, tumbling across the ground for over a hundred meters.\n\n\"SIR!\" \n\nThirty thousand soldiers lining Howl's walls cried out in horror.\n\n*Dear gods...*\n\nAcross the world, viewers sat frozen before their screens. The ultimate Guardian Knight—the pinnacle of defensive specialists—knocked aside like a ragdoll. *In one blow.*\n\nTeruchan stood motionless, waiting. \"That was one. Grruk.\"\n\n\"Gh... ugh...\"\n\nMarquis Veze staggered upright, legs threatening to buckle. But he refused to fall. Using his shield as a crutch, he forced himself to stand. Raised his blade toward Teruchan.\n\nOne exchange had revealed the truth: defense was meaningless. Against power this overwhelming, his only chance was offense—strike before being struck.\n\nThe strategy failed.\n\nBefore Veze's sword came within range, the broadsword struck again.\n\nOne blow. Two. Three.\n\nThrough the first three exchanges, Veze managed to interpose his shield—barely. Then his concentration cracked. The shield slipped. His guard failed.\n\nAround the world, Guardian Knights watching the broadcast felt something fundamental shift. An attack power that the ultimate tank couldn't withstand. \n\n*Why even play a tank, if this is possible?*\n\nOrc Lord Teruchan wasn't just powerful. He was *rewriting the rules*. Invalidating the entire concept of defensive specialists. His presence transcended even the Great Demons of legend.\n\nMeanwhile...\n\n\"Kgh... guogh...\" \n\nAfter the fifth blow, Marquis Veze collapsed, unable to rise. Before this apex of a different species, he tasted helplessness for the first time in his life. Realized how insignificant he truly was. How powerless the Fold Kingdom stood against this force.\n\nTeruchan's voice rolled over him like thunder. \"The chance is lost. Grruk. You failed, brave human warrior. Kurruk. Return to your walls. Wait in fear with your soldiers. Guruk. We *will* march.\"\n\n\"...\"\n\nMarquis Veze's expression went hollow. No victory. No hope. Only the prospect of limping back on shattered legs to face his demoralized troops. How could he rally them now? How could he ask them to fight after they'd witnessed his complete defeat?\n\nEach step toward the fortress felt like dragging mountains.\n\nThen—light split the sky.\n\nA pillar of radiance descended, and within it, a figure materialized. Black hair. A crown. Every eye on the battlefield—orc and human alike—locked onto the newcomer.\n\n\"You. Who?\" Teruchan demanded.\n\nHundreds of millions of viewers already knew the answer.\n\n\"The Overgeared King.\"\n\n\"...King?\" Excitement blazed in Teruchan's eyes. He didn't question why Grid had appeared here. Didn't care. Only one thing mattered—*how strong was this human king*?\n\nGrid glimpsed that naked battle-lust and smiled. \"Come on, then.\"\n\nNo warning. Teruchan's shoulders shifted, and his broadsword—over two meters of killing steel—shot toward Grid's chest like a ballista bolt.\n\n*Ah...*\n\nGlobal chat feeds exploded with despairing reactions. The attack that even the world's greatest tank couldn't block. Grid would fall just as easily. If only he'd arrived sooner...\n\nIf he'd witnessed Teruchan's power, he wouldn't have allowed such an opening. Victory wouldn't have been decided in a single—\n\nThe viewers' lamentations died.\n\nFour hands—black-gold, gleaming—materialized and intercepted the blade.\n\nGod Hands. Grid's signature technique, unseen for months, returned in perfect form.\n\n\"Interesting. Grruk. Toys!\" Teruchan ripped his weapon free and attacked again. This time low, aiming to shear through Grid's legs.\n\nBut—\n\n\"...!?\"\n\n*Teruchan* withdrew, not Grid.\n\nAn invisible force repelled the broadsword, sending it ricocheting away. The orc lord stumbled back a step.\n\n\"Magician?\"\n\n\"Blacksmith.\"\n\n\"...?\"\n\nLightning wreathed Grid's body. He rose into the air until his eyes were level with Teruchan's—two heads above his natural height. \"Ten blows. Survive ten of *mine*, and I'll spare your life.\"\n\n\"...?\"\n\n*Were human kings all insane?* \n\nThe question flashed through Teruchan's mind as he activated his trump card for the first time in years. His broadsword spun like a windmill—faster, faster, building lethal momentum—then launched forward as a piercing drill. His ultimate skill. **Ignore 100% of Defense.**\n\nThe blade screamed through the air, unstoppable, and—\n\nReversed course mid-flight.\n\nTeruchan watched his own broadsword punch through his chest.\n\n\"...Gruruk.\"\n\n*Why?* \n\nAnger surged where amusement should have been. He'd found a worthy opponent at last, but rather than joy, only frustration burned through him.\n\nWhat kind of monster was this Overgeared King?"
}