{
  "id": 1096,
  "title": "Chapter 1095",
  "content": "**'Victory is within reach.'**\n\nMost considered the orc lord a match for any great demon. While vulnerable to magic, his raw combat power placed him in that tier—at least by conventional wisdom. To the average player, both categories represented insurmountable walls. Functionally identical obstacles.\n\nBut Grid saw the chasm between them.\n\nTwo great demon raids had taught him what true power looked like. Against that benchmark, the orc lord paled. Unless Teruchan possessed some unknown heritage—demonic ancestry or vampiric blood—he remained firmly in the realm of the conquerable. King Maxong proved the principle. The pinnacle of the water clan, undeniably formidable, yet ultimately overwhelmed by Grid's knights and Iyarugt's tactical brilliance.\n\nDeploy that same force against a great demon? Impossible. The gulf was too vast.\n\nHigh rankers and named NPCs might struggle against the orc lord, but compared to hell's nobility? A child playing at war. Even one-on-one against Piaro or Mercedes, Teruchan's odds looked grim.\n\n*'Even against me.'*\n\nThe epic sagas. The transcendent growth. New God Hands. Blue Dragon Boots. Grid had evolved dramatically in recent years, yet he still couldn't confidently claim victory over Piaro or Mercedes. His stats were closing the gap, but skills? Still leagues behind. Piaro's miraculous farming reshaped battlefields themselves. Mercedes saw *everything*. Grid had no counter for either.\n\nThe orc lord, though? Different story entirely.\n\nGrid had studied the footage obsessively. Every engagement recorded, every pattern mapped. The orc lord's weaknesses were well-documented: magic vulnerability, no equipment, limited skill repertoire. Predictable. Exploitable.\n\nTrue, each of those limited skills hit with demonic force—the primary reason people equated him with great demons. But Grid could evade. The God Hands provided defense. The Blue Dragon Boots offered counterattack capability. From Teruchan's opening strike through his throwing techniques, Grid had countermeasures prepared.\n\n*'I can win.'*\n\nNo—*must* win. \n\nThis confrontation carried weight beyond simple combat. If he defeated the orc lord, the orcs would recognize his strength. The titles Duke of Virtue and Different Species' King meant nothing if he fell to a power-worshipping race. Lose here, and those achievements became hollow.\n\n*'Win. Make them submit.'*\n\nChild's play compared to great demons, perhaps, but Teruchan remained a species pinnacle. On the West Continent, that designation commanded respect. Grid needed allies—needed *power*—to stand against the great demons, the East Continent's yangbans, perhaps even gods themselves. The orc lord's hot-blooded yet honorable temperament made him ideal.\n\n\"Ten blows.\" Grid's eyes gleamed with undisguised hunger. \"Endure ten blows, and I'll spare your life.\"\n\nThe naked greed in that declaration stirred something in Teruchan. Animosity, hot and visceral.\n\n*'I am lord of the greatest warriors. And this human looks at me like prey.'*\n\nDisgraceful. Orcs and humans possessed different talents, different strengths. Teruchan never imposed orcish values on weaker races, never mocked their limitations. He showed them respect. Pity, certainly—recognition of their fragility—but respect nonetheless.\n\nThis human crossed the line.\n\n\"Your eyes. *Gruruk.* They are arrogant.\"\n\nTeruchan's gaze turned hostile. He prided himself on honor, on warrior's discipline, but he was still an orc. Compared to humans, his kind prioritized instinct over patience. He could offer respect, even mercy, but not to those who radiated strength from a *weak species*.\n\n\"Get your head straight. Then. *Gruruk.* I will spare your life. *Kurruk.*\"\n\nGrid smiled, utterly calm. \"You still don't understand the situation? I'm not the one receiving mercy here.\"\n\n\"*Gruruk!!* Rude!!\"\n\nTeruchan's veneer of civility shattered. The gentleman's mask fell away, revealing pure orcish fury—the naked fervor of a warrior unleashed. Shackles released. Power surging. Complete.\n\nA blackish-gray aura erupted around him, spreading outward in a meter-and-a-half radius.\n\n[**Fighting energy is at maximum.**]\n\n[**Strength, stamina, and agility have increased by 50%.**]\n\nGrid's fighting energy, already kindled the moment their eyes met, peaked instantly. Purple-red light enveloped him.\n\nTeruchan's eyes widened. \"*Gruruk!!* The legend I've heard...!\"\n\nThe Hero King. Humanity's strongest. That aura—too similar to Sword Saint Muller's, the human even *that era's* orc lord worshipped. Recognition hit Teruchan like a hammer. Too late. The creature before him was no weak human.\n\n\"Transcended Link Flower.\"\n\nGrid struck during that instant of hesitation, sword dance already complete.\n\nTens of thousands of blue petals materialized over plains packed with a hundred thousand twilight orcs. The darkness created by their thick-skinned horde lifted. The battlefield blazed with ethereal light.\n\n*—Ah...*\n\nViewers caught their breath. Was this the fabled Peach Blossom Spring? Mysterious, beautiful, impossibly serene against the bleakness of war. Every orc in that vast army stood frozen, mouths agape.\n\nTeruchan alone maintained focus.\n\nHe understood. Shouted to his warriors: \"*Gruruk!!* Grit your teeth!!\"\n\nForty energy blades lanced through the petal storm, hammering into him. Thousands more petals bombarded the orc army. Cutting winds scythed through their ranks. Between the petals, lightning arced endlessly, linking target to target.\n\n**[Transcended Link Flower]**\n\n*Three sword dances sublimated into a unified field.*\n\n*Fire 40 energy blades with 200% physical attack power, marking all visible enemies.*\n\n*Each mark generates two additional sword energies targeting that enemy. Each hit deals 122% physical damage + 20% magic damage.*\n\n*Every two hits creates another mark. Maximum five marks per target.*\n\n**Skill Usage Conditions:** Sword-type weapon equipped.\n\n**Sword Energy Cost:** 300\n\n**Cooldown:** 20 minutes\n\n★ *Incorporates effects of Detect Force, Wind Cutter, and Lightning.*\n\n**Mana Consumption:** 3,600\n\nThe true terror of wide-area skills with line-of-sight targeting. Grid had launched himself skyward with Lightning Speed, positioning for maximum coverage. His vision now encompassed most of the battlefield—allowing him to wound tens of thousands simultaneously.\n\nTeruchan roared at Grid's ascending form. \"*Gruruk!!* Focus on *me*!\"\n\nThis was single combat. Honor and pride on the line. And this human dared strike at his army instead? Arrogance beyond measure. Teruchan's carefully maintained calm evaporated. He smashed his feet into the earth and *launched*.\n\nDespite forty energy blades and cascading sword energy, his thick hide remained nearly intact.\n\n*'Formidable indeed.'*\n\nThe orc army, teeth gritted at their lord's command, uttered no sound despite petals slicing flesh and lightning searing skin. The orc lord himself absorbed Transcended Link Flower's impact without armor, nearly unscathed.\n\nOrcs. Grid hadn't expected such warrior spirit from what he'd classified as monsters. Floating in midair, he felt genuine admiration while starting the steps for his next sword dance.\n\n\"Flower.\"\n\nHis formula since inheriting Great Swordsman Pagma's Swordsmanship: stack maximum marks through Flower combinations.\n\n\"Linked Kill Flower Pinnacle.\"\n\nThe ultimate four-fusion sword dance. Maximum theoretical damage. And his current weapon—Belial's Staff combined with the Enlightenment Sword.\n\n**[Belial's Staff + Lightning Sword Born from Enlightenment and Strong Desires]**\n\n**Rating:** Myth (Transcendent)\n\n*[Details omitted]*\n\n* +30% Intelligence\n* +40% Magic Attack Power  \n* +30% Fire Attribute Damage\n* +30% Dark Attribute Damage\n* +15% Lightning Attribute Damage\n* Certain probability of releasing flames (large) on attack\n* Low probability of releasing illusions on attack\n* Low probability of summoning red lightning bolt on attack\n★ *Certain probability of black flames explosion on attack*\n* +30% Magic Casting Speed\n* Can cast three magic types simultaneously (requires proficiency)\n* When fire and dark magic cast together: +200% magic power each\n* Each spell cast auto-generates shield absorbing 5,000 damage. Targets striking shield receive fear and slow debuffs\n★ *Fire emission, hallucinations, red lightning, black flames explosion, etc., count as spell casts*\n* +20% Magic Critical Chance\n* +150% Magic Critical Damage\n\nThe combined form traded some attack power and magic attack—the weapons losing individual identity in fusion. Options remained largely similar to their separate states.\n\nExcept one area.\n\nThat auto-generated shield. Five thousand damage absorption. Fear and slow on contact. And the critical detail: every elemental proc counted as casting, triggering another shield.\n\nAgainst magic-vulnerable orcs, the synergy approached invincibility.\n\n\"*Gruruk...?!*\"\n\nTeruchan reeled from Linked Kill Flower Pinnacle's impact mid-leap. For the first time since his duel with the previous orc lord, his skin tore. Peeled. Bled. His eyes blazed with fighting spirit as he counterattacked.\n\nA translucent barrier sheathed the Overgeared King. Teruchan shattered it quickly—only for it to regenerate whenever Grid executed sword dances or black flames detonated. The shield reformed endlessly, working in concert with four floating hands and Grid's armor and boots to create layered defense.\n\n\"*A shell! Guruk! Hiding! Kurruk!* Like a turtle!!\"\n\nMockery in his words, unease in his heart. Each destroyed shield made his body heavier, fear creeping in. Naturally, as his species' pinnacle, Teruchan possessed immunity to most status effects or rapid recovery. *Fear* couldn't touch him. *Slow* barely registered.\n\nBut—\n\n\"You...! Indeed...! *Magician...!*\"\n\nTeruchan's broadsword swung fractionally slower through the air. Definitely slower. A trivial reduction viewers might miss entirely, but devastating against an opponent of Grid's caliber. Weapons materialized in the God Hands—spears, staves, swords—striking whenever Teruchan's attacks landed. The orc lord barely noticed.\n\n\"*Tickles...!*\"\n\nHis natural body remained undisturbed. Teruchan believed his trained skin and muscle surpassed any armor. Confident that no blade could breach his conditioning. Orcs, wielding crude tools compared to human craftsmanship, couldn't comprehend being *overgeared*.\n\n\"...*Cough?!*\"\n\nBlood flooded his mouth. Shocked, Teruchan looked down. Grid's weapon impaled his chest. The broadsword swung in panicked reflex. Grid activated a skill reflexively, his lightning speed overwhelming Teruchan's debuffed reactions.\n\n\"Blackening.\"\n\nAbsolute velocity. Lightning consumed Grid's form, crackling and surging. He executed sword dance steps between Teruchan's strikes, attacks falling like torrential rain.\n\n\"Transcended Linked Kill Pinnacle.\"\n\n\"...*Keok!*\"\n\nThe warrior *screamed*. Shame abandoned. The mountain of stone called Teruchan collapsed earthward.\n\nGrid didn't pursue. Incandescent with power, he hovered and lifted one foot.\n\n\"Come Down.\"\n\nThe sky split. Lightning tore the heavens. An enormous blue dragon descended behind Grid—nothing like normal dragonkind. The lightning-wreathed monstrosity swept across the battlefield below. Then—\n\n*'One... two... three...'*\n\nTeruchan frantically counted. Calculating how many strikes Grid had landed."
}