{
  "id": 1097,
  "title": "Chapter 1096",
  "content": "Gravity crushed down on hardened flesh, driving Teruchan earthward with merciless force. The world blurred past. Wind shrieked in his ears.\n\n*Nine...*\n\nThe Orc Lord plummeted from cloud height toward the unforgiving ground below. Yet even as death rushed up to meet him, he focused only on his count. What terrified him wasn't the obliteration of his body—it was the destruction of his honor.\n\nThe Overgeared King. The human who'd challenged him to withstand ten blows...\n\nHe was formidable. Those sword techniques, that devastating magic, the lightning, the artifacts moving of their own accord—all of it surpassed the previous orc lord's capabilities. When the bastard summoned a dragon, Teruchan finally understood: defeat was possible.\n\nLightning wreathed the blue dragon that struck him down. As electricity locked every cell in his body, Teruchan acknowledged the truth. His opponent was strong. The title of Hero King was no empty boast. Yes... he might lose. But no matter how powerful this human was, Teruchan refused to fall without dignity.\n\nHe was a king of warriors. If a dragon swallowed him, he'd tear out its tongue on the way down. He stood at the pinnacle of all orcs, leader of the twilight tribes—and he couldn't endure ten blows? Such weakness would shame every orc in the world. Prestige lost, just like in the old days. He had to hold. Had to endure.\n\n*Ten...!*\n\nTeruchan's eyes snapped wide just before impact. That number—it counted their exchanges of offense and defense. During his brief flight through the sky, Teruchan had swung his broadsword over twenty times. His blade and roars had shattered nearly thirty of Grid's shields.\n\nHe'd endured. Despite that overwhelming presence making him fear he'd fall in fewer than ten blows, he'd done it.\n\n\"Guruk!\"\n\n*I survived your ten blows.*\n\nHe'd met the Overgeared King's declaration and preserved his honor. Fire reignited in Teruchan's eyes. His muscles, nerves, cells—all paralyzed by lightning—awakened in response to his iron will. Like a predator adjusting mid-fall, Teruchan broke free of the paralysis just before collision. Motor control returned. He twisted, flattening his body horizontal, and slammed into the earth.\n\nThunder cracked across the battlefield as a hundred thousand orcs screamed.\n\n\"Ohh...!\"\n\nMarquis Veze and the Howl Fortress soldiers watched in awe through the rising dust cloud. They imagined the orc lord's broken corpse. Sure, he had impenetrable skin and muscle, but nothing survived a fall from that height. Yet...\n\n\"Kuoooooooh!\"\n\nWhen the dust cleared, Teruchan stood. Bloodied but unbroken, he crouched on all fours and roared—a bestial sound that enthralled every orc present. Those paralyzed by lightning surged back to their feet in unison.\n\n\"Teru—chan!! Guruk!\"\n\n\"Teru—chan!! Guruk!\"\n\n*Kung kung! Kung! Kung kung! Kung!*\n\nOrcs submitted to strength through survival instinct—obedience or death, a simple equation. But this moment transcended instinct. Rational thought drove every orc now stamping their feet and chanting Teruchan's name. The sight of their bloodied lord rising from that impossible fall captivated them utterly. They roared for a second legendary figure to stand beside Grid. The propaganda called Grid had united the orc species.\n\nIn the sky above, Grid began to sweat.\n\n*Still standing after taking that much damage. Transcended Link Kill Pinnacle hit for less than I expected.*\n\nHe'd given everything to end this in under ten blows. Fighting energy maxed out, every item deployed, sword dances and magic chained together. Using both Linked Kill Flower Pinnacle and Transcended Link Kill Pinnacle in succession demonstrated just how serious he was.\n\n**[Transcended Link Kill Pinnacle]**\n\n*Four sword dances sublimated into a single field.*\n\n*Fires seven energy blades per second dealing 3,700% physical damage. Every attack triggers 'Disarm' while applying bleeding and desperation effects.*\n\n*Ignores 65% of target's defense.*\n\n*★ Effects of Detect Force, Wind Cutter, and Lightning applied.*\n\n*Requirements: Sword-type weapon equipped*\n\n*Sword Energy Cost: 400*\n\n*Cooldown: 2 hours*\n\nBy the principle that Transcend doubled attack power, Kill's multiplier should have doubled as well. Against a target with maximum marks, Linked Kill Flower Pinnacle's 22,560 physical attack plus 100% magic attack offered a higher damage coefficient.\n\nBut there were drawbacks. The longer cooldown. And critically—against opponents with overwhelming physical defense like Teruchan, it underperformed. His magic resistance was low, his physical defense astronomical. Pinnacle's defense-ignoring properties would've been far more effective. Even Linked Kill Flower Pinnacle's initial damage disappointed. Worse still, Teruchan wore no items. Disarm was completely wasted.\n\n*His raw stats are killing me.*\n\nGrid clicked his tongue, watching the distant orc lord. Teruchan's health sat below one-fifth, yet Grid felt hollow. The bastard's recovery speed was inhuman. And the real problem? Grid's sword energy was depleted. He couldn't chain additional sword dances when Teruchan was vulnerable and paralyzed after Come Down! Recovering sword energy required sustained combat, continuous strikes—but his own declaration trapped him. Ten blows. No more.\n\n*Flower, Transcended Link Flower, Link, Kill...*\n\nGrid counted the sword dances he'd already spent while Teruchan glared up at him. Seven. Three blows remaining out of ten. Could he finish an orc lord with three attacks when all his ultimate skills were exhausted?\n\nImpossible. Grid trembled.\n\n*Fucking God's Command.*\n\nIf it had activated even once, the orc lord would be finished. But that fifty percent chance might as well be a lottery. Goddamn terrible luck... Rage simmered in his chest.\n\nThen—\n\n\"Human king! Guruk!\" Teruchan's shout echoed across the battlefield. His right arm and left leg hung limp, broken from the landing. \"I... Guruk! I've endured more than fifty blows!\"\n\nPure joy radiated from Teruchan's face. Even pride flickered there. He acknowledged Grid's skill and felt genuine satisfaction at surviving the onslaught.\n\nGrid frowned. \"What are you talking about? I've only used seven.\"\n\n\"Guruk? You swung your sword. Guruk! Many times! Forty times! How is this seven?\"\n\nWas this bastard serious? Grid caught the confused reactions from Teruchan's orcs and snorted. \"That's absurd. I swung my sword dozens of times, yes—but I only used seven sword dances. Seven techniques. Seven blows.\"\n\n\"...?\"\n\n\"...\"\n\nWas he some kind of gangster? Grid's logic turned the battlefield into a tomb. Teruchan, his orcs, the Fold Kingdom soldiers—all fell silent. Even the savage orc lord had honored his promise to Marquis Veze. So what did it mean when the Overgeared King—equal in standing to an empress—played word games? Some felt disappointment. Others outright disapproval.\n\nMeanwhile, Teruchan looked... delighted. \"Guruk...! I see! Still only seven!\"\n\nThis was terrifying. The Overgeared King was a strong human—terrifyingly so. That's what made Teruchan's blood sing.\n\n\"Good! Guruk! I wanted to fight more!\"\n\nHis competitive fire blazed hotter. Teruchan wanted to discover his limits. He craved an extreme battle where he could pour out everything. No regrets, even if it meant death. Warriors who feared death never became warriors in the first place.\n\n\"Gruruk!! Let's fight! Until one of us falls! Continue!\"\n\n\"Excellent suggestion.\"\n\nA duel without restrictions. For Grid, whose sword energy sat at zero, it was a godsend. He smiled like a demon.\n\n\"I'm looking forward to it.\"\n\nGrid descended. He'd draw this out as long as Blackening's duration lasted. What Grid didn't realize—as he plummeted downward, his body gradually turned incandescent. The Blue Dragon Boots' conditional passive activating. At maximum speed, there was a low chance his body would transform into living lightning.\n\n\"Kurruk...!\"\n\nWas this fate itself? Teruchan's heart hammered as he blocked Grid's strike. The sword blow, accelerated by that descent, drove him back several steps.\n\n\"Human...! Your name! Guruk! Tell me!\"\n\nTeruchan's burning gaze locked with Grid's greedy eyes.\n\n\"Grid.\" Lightning swelled around him. The moment Item Combination's duration expired, the Enlightenment Sword returned to its complete form and crashed against Teruchan's broadsword. \"And you're mine.\"\n\nHis skin grew hotter with every exchange. Teruchan's battle fervor was infectious—even Grid felt it bleeding into his words.\n\n\"Kuahahahat! Guruk! A warrior! Doesn't obey humans!\"\n\nTeruchan's laughter boomed across the field. Not mockery. Not displeasure. Something closer to joy—the kind born from remembering a long history where lords bowed to worthy humans.\n\nThe shriek of metal on metal intensified. Grid and Teruchan's focus peaked as they attacked and defended across impossible angles and trajectories. Broadcasters' cameras from around the world struggled to track their movements. Melee shots became impossible.\n\nThen the Lightning God invaded Grid's body. Teruchan's broadsword passed through empty air—Grid had become the storm itself."
}