{
  "id": 1099,
  "title": "Chapter 1098",
  "content": "The Duke of Virtue title from Pangea was a joke—a microscopic chance that might trigger once every few years if Grid was lucky. He'd only kept it equipped out of habit, never expecting it to actually proc.\n\nHis real plan had been simpler: beat Teruchan into submission, then leverage his 'Different Species' King' title. That one had useful effects—doubled chances of making a good impression with non-humans, massive affinity bonuses. A straightforward recruitment strategy.\n\nInstead, Duke of Virtue had fired.\n\n*Damn. Did beating Noll somehow boost the odds?*\n\nThe flames that had erupted from God's Command guttered and died. But before Grid could celebrate—\n\n\"Look at me! Open your eyes!\"\n\nThe triumph lasted all of three seconds.\n\nTeruchan was dying.\n\nThe orc lord who'd weathered Grid's full arsenal now trembled like a leaf, his massive frame wracked with convulsions.\n\n\"Wake up! Get up!\" Grid fumbled for a potion, hands shaking. He yanked Teruchan upright and forced the vial between his tusks, tilting the orc's head back.\n\nNothing happened.\n\nThe liquid ran down Teruchan's chin, wasted.\n\n*He can't be healed?*\n\nWhy wasn't it working? What the hell? Grid pulled up Teruchan's status window—they were allies now, the system allowed it.\n\n**Name:** Teruchan  \n**Age:** 19 | **Gender:** Male  \n**Race:** Twilight Orc\n\n**Title: Strongest Warrior**  \n*Strength and health stats increase in proportion to battle duration (up to 30%).*\n\n**Title: Usurper**  \n*Increases attack power, defense, health and resilience when fighting leaders (up to 20%).*\n\n**Title: Indomitable Warrior**  \n*Nullifies damage over a certain threshold up to 10 times. Once exhausted, consumes Origin True Energy (resets every 30 days).*\n\n**Level:** 500  \n**Strength:** 4,003 | **Stamina:** 6,130  \n**Agility:** 2,280 | **Intelligence:** 320\n\n**Skills:** Iron Arm (A), Roar of Strength (S), Instinct (S), Belief (S)\n\n*Like most twilight orcs, Teruchan was abandoned by his parents at age five.*\n\n*After the twilight orcs fled deep into the mountains to escape the empire's surveillance and oppression, their sanctuary became suffocatingly small. Teruchan survived alone. When liberation finally came, he made a vow.*\n\n*\"We must not let our children experience our misfortunes.\"*\n\n*Teruchan defeated the former orc lord who opposed the war. His desire to seize leadership stemmed not from ambition, but from a dream—happiness for the newly born children.*\n\n\"...\"\n\nStrongest Warrior. Usurper. Indomitable Warrior.\n\nThose three titles explained everything—why Teruchan's stats blazed like a bonfire, why he'd survived most of Grid's attacks. But Grid's attention snagged on a different detail.\n\n*He's nineteen years old? This terrifying giant who looks like a hardened criminal? He looks twenty years older than me.*\n\n\"No, shit!\"\n\nNow wasn't the time for that.\n\nOrigin True Energy—the source of life itself. When it ran dry, even transcendents died. Teruchan was at the edge of that precipice.\n\n*Right! I could ask Sehee—*\n\nThe thought turned Grid's blood to ice.\n\nKhan's death replayed in his mind. Ruby hadn't been able to save Khan. Natural death—the kind that came from life simply... ending—lay beyond even a Saintess's reach.\n\n\"...Dammit!\"\n\nHe couldn't call her. His sister would drown in guilt if she failed to save Teruchan. Putting that burden on her heart just to cling to this desperate hope? He couldn't do it.\n\n*I wish he was a villain.*\n\nGrid stared down at the dying orc lord.\n\nIf only Teruchan had been a simple monster—a bloodthirsty invader, a mindless predator. Then Grid's heart wouldn't feel like it was being crushed in a vice. At worst, he'd have cursed the Duke of Virtue title for its terrible timing.\n\nBut Teruchan wasn't evil.\n\nHe fought for children who couldn't fight for themselves. He hadn't forced humans to kneel or worship his strength. And now Grid knew all of this, had seen it through the title's revelation. The information twisted like a knife in his gut. He mourned for this person—for dreams that would die unfulfilled, for a future stolen.\n\n\"Shit... Damn...\"\n\nTeruchan's voice rasped in his ears, barely a whisper.\n\n\"Grid... Grruk... In your hands... I die... with pride...\"\n\n\"Shut up!\" \n\nGrid didn't want to hear it. Didn't want the pain to deepen.\n\nBecause he knew exactly how to save Teruchan.\n\nThe White Peach. One bite restored all health and vitality—a miracle item so powerful it could only be consumed once per lifetime. It would almost certainly replenish even exhausted Origin True Energy.\n\nAnd Grid couldn't make himself use it.\n\nNot because Teruchan lacked value. God, no. The orc's worth exceeded all expectations. Imagining him fighting alongside Noll at the vanguard made Grid's blood sing. Against enemies like the grandmaster or the yangbans, Teruchan's performance would be devastating.\n\nBut—\n\n*I can't. I just... can't give it to him.*\n\nGrid already had too many precious people.\n\nIrene. Lord. Piaro. Braham.\n\nFrom the moment he'd summoned Piaro to the perilous imperial palace, Grid had sworn to reserve the White Peach for them. He felt sick with guilt over Teruchan dying in front of him, but the weight of those already precious to him tipped the scales. They always would.\n\n\"Glory... Grruk...\"\n\n\"I said shut up!\"\n\nThis was rotten. All of it.\n\nHe'd come to the Fold Kingdom to *save* them from the orc lord, not to stand here drowning in misery. Grid clutched at his chest, expression twisting—\n\n\"Overgeared King!\"\n\nThe shout snapped his head up.\n\nMarquis Veze sprinted toward him, arm outstretched toward the horizon. \"Those who have lost their king will run wild! You have to evacuate—now!\"\n\nIn the distance, a hundred thousand orcs surged forward like a living avalanche.\n\nThe marquis had witnessed everything. Grid's absurd logic to bend the 'ten blows' promise. The crushing victory. For a while, Veze had been suspicious—wondered if Prince Shining's devotion to Grid bordered on brainwashing. But watching the duel, understanding dawned.\n\nGrid hadn't worried about his reputation because he'd sought something else entirely: a conversation through crossed blades. Throughout the battle, Teruchan had grown animated, expressing joy and respect. The atmosphere of two warriors becoming friends.\n\nGrid had respected Teruchan in his own way. He'd sympathized with the twilight orcs who glorified combat without sneering at their culture.\n\nAs expected, he was a great man.\n\nGrid's intention must have been to persuade Teruchan to end the war. But something had gone catastrophically wrong. Now Teruchan lay dying, and the enraged orcs would never forgive the one who struck him down.\n\n\"Hurry! I'll buy you time!\"\n\nVeze raised his shattered shield and turned to face the hundred-thousand-strong army alone.\n\n\"Marquis Veze!\"\n\n\"My lord! Why aren't you running?\"\n\nThe knights of Howl Fortress erupted into chaos. Someone bellowed orders to open the gates. Others had already vaulted the walls and were sprinting across the plains. All of them rushing to save their commander.\n\nVeze's lion-like roar cut through the din.\n\n\"Everyone retreat! Escort the Overgeared King to the capital!\"\n\n\"My lord!\"\n\n\"That's an *order*!\"\n\n\"...!\"\n\nThe knights skidded to a halt. Their esteemed superior's final command—they couldn't disobey. An old knight locked eyes with Grid and shouted desperately, \"Your Majesty! Come quickly! Don't let Marquis Veze's sacrifice be in vain!\"\n\n*Bullshit.*\n\nGrid clicked his tongue and ignored the desperate cries.\n\nInstead—\n\n\"Uh?!\"\n\nHis four God Hands shot through the air and seized the marquis's limbs in perfect unison.\n\n\"Your Majesty...?\"\n\nThe bewildered marquis's gaze ping-ponged between Grid and the approaching army. Less than two hundred meters now.\n\n\"I'm here to *save* the Fold Kingdom, not collect sacrifices.\" Grid hurled the marquis toward the knights like a sack of potatoes.\n\nThen he stepped forward, positioning himself beside Teruchan's fading form to face the orc horde.\n\nA hundred thousand dark-skinned orcs charging across the plains looked like a massive rockslide given terrible, vengeful life.\n\n*This is garbage.*\n\nFighting the orcs now was suicide. He'd burned through almost every skill and resource against Teruchan—his condition was a disaster. The smart move was retreat.\n\nGrid knew this.\n\nBut he couldn't move.\n\nBecause at the vanguard of the orc army, thousands of red-spotted leopards carried mounted warriors. Their speed exceeded warhorses. If Grid fled, the soldiers of Howl Fortress wouldn't survive the pursuit. At best, they'd be scattered. At worst, slaughtered to the last man.\n\nAll the rewards from rushing here would evaporate.\n\nGrid reminded himself of his original purpose: guardian of the Fold Kingdom.\n\n\"Shit... Come on!\"\n\nHe also needed an outlet for his boiling rage.\n\nGrid roared at the tsunami of enemies and leveled the Enlightenment Sword. He kept his voice low—conscious of the cameras—but let the curse words flow. One against a hundred thousand.\n\nIf it were anyone else, viewers would have scoffed.\n\nBecause it was Grid, they held their breath and watched.\n\nNoe, Randy, Tiramet, and the Overgeared Skeletons materialized at his flanks. The God Hands clutched the Red Phoenix Bow. Clouds gathered overhead as he prepared to unleash Storm Demonic Energy Field on the leading leopards—\n\nThe leopards stopped running.\n\nThe orcs dismounted and rushed toward Grid.\n\nWithout drawing their weapons.\n\n\"Gruruk! Great warrior!\"\n\n\"...?\"\n\n\"We! Want! Lord's body! Grruk!\"\n\n\"...\"\n\nUnderstanding crashed over Grid like cold water.\n\nOnly the orc lord determined policy. With him dead, they had no reason to wage war. They'd return home, elect a new leader, follow new orders. And from a warrior's perspective, the duel between Grid and Teruchan had been legitimate. They bore no grudge.\n\n*...Basara was right.*\n\nThe idea of liberating them hadn't been naive. They weren't mindless beasts.\n\nGrid nodded and stepped aside.\n\n\"Take him.\"\n\n\"Thank you. Grruk.\"\n\nThe orcs beat their chests with their fists and bowed. They lifted Teruchan onto a leopard with reverent care. He looked almost like a corpse—skin drained to pale blue, mouth slack.\n\nAt that moment—\n\n\"...?\"\n\n\"...?\"\n\nIntense light flashed across the sky.\n\nMass Teleport.\n\nBoth Grid and the orcs stared upward in amazement. Sage Sticks appeared first, then Lauel descended rapidly toward the ground.\n\nLauel hit the dirt running and pulled out a fruit.\n\nWhite. Radiant.\n\nThe White Peach.\n\n\"You—!\"\n\nGrid lunged forward but Lauel was faster. He pried Teruchan's jaws open and shoved the fruit inside.\n\n\"I know the entire situation. This is the only way to save him.\"\n\n\"No, are you *crazy*? That's—!\"\n\n\"I know the value of the White Peach. That's exactly why I'm investing it here.\"\n\n\"*You're* supposed to eat it!\"\n\n\"It's too big a luxury for me.\" Lauel's expression remained calm. \"Don't you know I'm retired from field work?\"\n\n\"That's only because you're busy! Once you come back—\"\n\n\"No.\" The word landed with finality. \"I chose this path because I *like* it. I don't want to leave. I'll continue assisting Your Majesty with ruling the Overgeared Kingdom, so I don't need this luxury.\"\n\nThe White Peach granted experience regardless of level—its value increased exponentially for higher-level players. Lauel had given up something priceless.\n\nGrid knew this decision had cost him dearly. Lauel was sacrificing his own advancement.\n\nAnd thanks to that sacrifice—\n\n\"Grruk...!\"\n\nTeruchan drew a shuddering breath and opened his eyes.\n\nViewers gasped. Orcs stared wide-eyed. It felt like the entire world held its breath.\n\n\"Great warrior!\" Teruchan's voice rang out strong. \"Life saver! I, Teruchan, swear—grruk—I will serve you!\"\n\nWas Grid really his life saver...?\n\nThere were questions to unpack later. But regardless of the details, Grid had gained a powerful new subordinate."
}