{
  "id": 110,
  "title": "Chapter 110",
  "content": "# Chapter 110\n\nSatisfy offered complete freedom to its two billion players. Among the ten thousand available classes—both common and hidden—each common class maintained its own top ten ranking. For months, those rankings remained static, the same names appearing week after week. The gap between the top ten and everyone else had become a chasm, seemingly impossible to bridge.\n\nThen, six months ago, everything changed.\n\nThe Tzedakah Guild migrated from L.T.S. Within four months, they seized top ten positions across sixteen major class rankings. The upheaval was massive. Media outlets scrambled for interviews. Users watched in awe as these newcomers dominated the leaderboards.\n\nThe rankings froze again after that initial shock. For half a year, the hierarchy remained unchanged.\n\nUntil a month ago.\n\nTen new names erupted across ten major class rankings like comets blazing across the night sky. Players called them the '10 Rookies', showering them with praise and expectations.\n\n\"Cursed Bloodline!\"\n\n> [The blood imprinted in the <span class=\"rarity-legendary\">Thorn of Deep Grievance</span> has resonated with your blood and makes you run wild.]\n>\n> [Skill damage increased by 150%. Movement speed increased by 80%.]\n>\n> [Health is continuously consumed while the skill is activated.]\n\n\"Ohhhhhh!\"\n\n> [You have suffered 34,030 damage.]\n>\n> [You have suffered 25,111 damage.]\n>\n> [You have suffered 29,600 damage.]\n\nThe flamberge carved through monsters like a scythe through wheat, its wave-blade edge resembling the thorny stem of a rose. Blood sprayed. Ibellin flew between his targets, bleeding but relentless. He seized one monster by the throat.\n\n\"Laceration!\"\n\n> [You have dealt 505,900 damage.]\n\n\"Kieeeek!\"\n\nEver since receiving the <span class=\"rarity-legendary\">Thorn of Deep Grievance</span> from Grid, Ibellin's progression had skyrocketed. Dungeons that once frustrated him for weeks now fell in days. He hunted monsters thirty levels above him and reaped legendary rewards.\n\n> [Your level has risen.]\n\n\"Good!\"\n\nAfter entering the two-hundred-level zone, he'd been gaining one level every five days. Now he leveled daily. The difference? Better hunting grounds. And he could access those hunting grounds because of the <span class=\"rarity-legendary\">Thorn</span>.\n\n*It was worth investing 2.5 million gold. This is a completely new world.*\n\nZirkan still held first place in the swordsman rankings with an overwhelming lead. First place seemed impossible. But second? At this pace, Ibellin would claim it soon.\n\n*Just wait, Lauel.*\n\nIbellin had started Satisfy two months later than his guildmates, finishing his studies first. He'd missed the Tzedakah Guild's spectacular debut and instead emerged as one of the 10 Rookies. Until recently, he'd been confident he was the best among them. The strongest of the new generation. Of course he was; he belonged to the Tzedakah Guild.\n\nThen Lauel shattered that illusion.\n\nWhen Ibellin debuted at 9th in the swordsman rankings, Lauel appeared in the qigong master rankings. Now Lauel stood at 1st among qigong masters and 178th on the unified rankings. Ibellin? 3rd among swordsmen, 199th overall.\n\nHe'd seen Lauel in a TV interview. They were the same age. The revelation had struck like lightning. For Ibellin, who'd always possessed the strongest self-esteem among his peers, it was devastating.\n\nSince then, he'd recognized Lauel as a rival. He pushed himself harder, striving to surpass the gap. But it was like chasing a ghost. Every step Ibellin took forward, Lauel took two. The limitations of raw talent became painfully clear. He couldn't deny it anymore. Lauel was superior.\n\nThen he'd gotten his hands on the <span class=\"rarity-legendary\">Thorn of Deep Grievance</span>.\n\n*Items are also part of our abilities. Lauel, this time I'll be ahead of you.*\n\n***\n\n{Grid! You came ~^0^~}\n\n{I've missed you so much!}\n\n{A half day without you is like 10 years... I was desperately waiting for you to come!}\n\nThe guild chat erupted the moment Grid logged in. His guildmates welcomed him like a long-separated lover finally returning home.\n\nThe reason was simple.\n\n{Make my items quickly!}\n\n{I'm dizzy because I want a legendary rated item ㅠㅠ}\n\n{Me first! Grid, if you make a legendary item for me, I'll shoot up to the top 20 right away!}\n\n*Please make my items.*\n\nThat's what they really meant. Right now, Grid was irreplaceable.\n\n\"Huhuhut... They're prisoners of my items.\"\n\nGrid laughed, basking in their desperation. Then Ibellin appeared in the chat.\n\n{Brothers, Sisters. Do you think it's so easy for Grid to make a legendary item? ^^ Don't bother Grid. ^^}\n\n{What? Ibellin, you raised your level again? Hasn't it only been one day?}\n\n{Yup! ^^ I moved my hunting grounds. ^^ My experience is rising quickly ~ ^^ Previously I worked hard and only gained 1 level in 5 days ~ ^^ This is the true power of items ^^ ㅋ It's all thanks to Grid. ^^}\n\n{Hey... No matter how excited you are, stop using ^^ <-... It's bad luck.}\n\n{I'm really envious ㅡ ㅡ I was envious when Pon got a unique item, but Ibellin's is even better. Sooner or later, won't you reach second ranking?}\n\n{A legendary item is really... I want to have one as well ㅠㅠ}\n\nSince joining the guild, Grid had only produced Pon's spear and Ibellin's Thorn. Both had finished with unique and legendary ratings respectively, inflating expectations to unreasonable heights.\n\nGrid couldn't unconditionally produce unique or legendary items. But the guild members hoped for at least unique. Grid needed to manage their expectations before disappointment bred resentment.\n\n{I don't think I can make unique or legendary items often. In fact, two out of three Gale Spears were completed with an epic rating and one of Ibellin's Thorns had a rare rating. I also often make normal or rare items. So keep in mind that your items might be completed as a rare or epic rating.}\n\n{Yes, that's right. Let's calm down. Didn't we want epic items from Grid in the first place? Let's not lose sight of things. In addition, items made by Grid are unconditionally better than other items of the same level, regardless of their rating. It's enough, even if a rare rating appears.}\n\n{Yes... If we're lucky, one day we'll receive unique or legendary items.}\n\nAs the excitement settled, Jishuka made the call.\n\n{Grid, this time I want you to make armor for Vantner.}\n\nVantner protested immediately.\n\n{Armor? Why armor? Stop! I don't need armor! I want a weapon! Make a weapon! A weapon allows me to hunt faster and I can level up!}\n\n{Shut up Vantner. Isn't your current weapon good enough thanks to Grid? It's a good weapon, even if it can't be compared with Pon's or Ibellin's. And you're a tanker. Right now, you're useless in raids. ^^}\n\n{ㅠㅠ Master...}\n\n{What? Do you have something to say?}\n\n{No... I don't...}\n\nNot just Vantner, but all members regardless of age and gender submitted to Jishuka. They normally acted as family and friends, but once an order dropped, they followed it unconditionally. Their trust in her was absolute.\n\n{I already have an armor production method. But I haven't yet obtained all the necessary materials. It'll take up to half a day. Until then, feel free to do whatever you want.}\n\n\"Half a day...\"\n\nGrid frowned. It was an awkward amount of time to make one item.\n\n\"Should I hunt for the first time in a while? There's a place I wanted to see...\"\n\n***\n\nWinston offered hunting grounds for every level range, from beginners to rankers. Among users above level 150, the most popular was the Golem's Labyrinth. The golems had been designed by a magician to protect hidden treasures, dropping magic stones and minerals in abundance. The experience was excellent.\n\nBut there was a fundamental problem. Golems possessed crushing defense and near-immunity to physical attacks. The Golem's Labyrinth was effectively a private hunting ground for magicians.\n\nMost parties consisted of magicians and healers, or a paladin, magician, and healer. Physical attackers were nowhere to be found.\n\nInto this place walked a lone man carrying a greatsword.\n\nPeople laughed.\n\n\"Hey Mister, did you come here to hunt?\"\n\n\"Yes.\"\n\nThe greatsword wielder didn't break stride.\n\n\"Ha? Really? Without a party?\"\n\n\"I like solo play...\"\n\n\"Pfff!\"\n\n\"Kilkil! A beginner!\"\n\nLaughter rippled through the crowd. A warrior hunting golems alone? He clearly lacked common sense. The greatsword wielder ignored them, his heavy footsteps echoing through the labyrinth.\n\nDozens watched as he approached a golem. Without hesitation, he stabbed forward.\n\n\"Pagma's Swordsmanship, Kill!\"\n\nPeeeeeong!\n\n\"...!\"\n\nImpossible. The giant iron golem, which couldn't be damaged even by dozens of swords, went flying into the wall from a single blow. The crowd stood frozen. Someone shouted,\n\n\"W-Wait a minute...! That helmet and black greatsword...! Isn't he the human butcher who smashed the Giant Guild on his own, instantly boosting himself into fame?\"\n\n\"T-That's right! I see it now! The Cruel Butcher!\"\n\n\"Kyaaak! He actually looks scarier!\"\n\n\"Wow... Really dirty... He really did shatter the Giant Guild alone.\"\n\nMeanwhile, Grid stared at the golem through his skull helmet, confused.\n\n*Its health only decreased by half, even though I used Kill? This is really hard.*\n\nKill was a deadly blow. Dainsleif dealt bonus damage proportional to the opponent's defense. He'd expected to easily hunt golems. He was wrong. The golems of the labyrinth were far tougher than anticipated.\n\n*However, I have a method.*\n\nGrid put away Dainsleif and pulled out a pickaxe. The finest pickaxe he'd made himself. With 100% understanding of the item, red dots appeared across the golem's body. Vital spots. Mineral deposits.\n\nGrid aimed his pickaxe at the red dots.\n\nKaaang! Kaaang!\n\n> [Iron ore has been acquired.]\n>\n> [Deluxe Iron ore has been acquired.]\n>\n> [Three damaged orichalcum have been acquired.]\n\nExcept for the magic stones serving as engines, the golems were made entirely of minerals. As a legendary blacksmith with 100% pickaxe understanding, Grid transformed golems into walking ore deposits.\n\n\"...What the hell is this?\"\n\nEvery pickaxe strike produced minerals. Users gaped at the impossible sight. They could barely hunt golems by pouring out magic. Grid was mining them to death with a pickaxe.\n\n\"Just one time...\"\n\nA paladin user with a miner side job caught a passing golem, excitement bright in his eyes. He pulled out his pickaxe and swung hard.\n\nChaaeng!\n\n\"...Kkeok!\"\n\nThe paladin screamed, clutching his wrist. It felt broken. The golem wasn't even scratched. It turned its head, verified the paladin, and struck out.\n\nMeanwhile, Grid approached another golem and started mining after knocking it down. Minerals poured out. Grid's excitement grew.\n\n\"Kukukuk...! What is this? It's really good! Kuahahahat!\"\n\nGrid's face was hidden by the skull helmet. He kept swinging the pickaxe at golems like a madman. The users watching felt genuine terror.\n\n\"What, so scary...\"\n\nPeople had been wary since Grid slaughtered the Giant Guild. Now they backed away until they were no longer in danger. Then they fled.\n\nThanks to the wide labyrinth, Grid was left alone.\n\nHe didn't pay attention to his surroundings, fully absorbed in collecting minerals. He gathered far more than originally intended. He even gained a level.\n\nThen a whisper from Jishuka arrived.\n\n{Grid, the preparation of the materials is over.}\n\n\"Okay, I'll go back now.\"\n\nGrid hummed, checking his inventory stuffed with minerals. He left the labyrinth. Or tried to. He got lost.\n\n\"No, damn! What is this? Why is this place so complicated? Where have all the people gone? Damn! Even if I want to ask for directions, I can't because there are no people! This bastard labyrinth!\"\n\nGrid wandered for a while. No matter how much he walked, he couldn't find the exit. Eventually, he called the guild for help.\n\n{I'm in the Golem's Labyrinth, can someone come and help me?}\n\n\"Huh?\"\n\nGrid had been leaning against a wall while chatting. His eyes suddenly widened. The wall was collapsing.\n\n\"W-What? Aaaaack!\"\n\nGrid's body fell with the crumbling stone.\n\nKuuong!\n\n\"Cough! Cough! Huh?\"\n\nGrid struggled with the pain of the fall. Then he shivered. He raised his head and saw a golem at least five times larger than the others in the labyrinth.\n\n\"...What?\"\n\nKuweeeeeoh!\n\n> [The Guardian of the Labyrinth has woken up from a long sleep.]\n>\n> [The magical traps set up by the Great Magician Braham have been triggered.]\n>\n> [You have suffered 205,100 damage.]\n>\n> [You have suffered 399,000 damage.]\n>\n> [You have suffered 174,340 damage.]\n>\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\nPepeng! Kakakakak!\n\nMagic traps activated in rapid succession. All types of attribute attacks slammed into Grid. But his passive triggered, granting invincibility. He survived. Fortunately, the traps finished before his invincibility duration ended.\n\nThe Guardian of the Labyrinth moved.\n\nGrid downed the highest quality health potion and grimaced.\n\n*The invincible passive's cooldown time is one day. Losing my insurance at the start is the very worst.*\n\nHe couldn't see a way to escape. Grid decided he needed to defeat the Guardian of the Labyrinth to survive. He grabbed Dainsleif.\n\n***\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}