{
  "id": 1100,
  "title": "Chapter 1099",
  "content": "# Chapter: The Orc Lord's Oath\n\n\"I, Teruchan, pledge myself to you!\" The orc lord's declaration thundered across the battlefield. \"You shall be my master!\"\n\nSilence.\n\nThe enormity of Teruchan's oath rippled through the assembled forces like a shockwave. The orc lord—ruler of tens of millions—kneeling before a single human. In effect, Grid had just gained dominion over an entire species.\n\n---\n\nThe broadcast panels erupted.\n\n\"This is ridiculous! A normal player catches a pet lizard, and Grid gets an army of millions? How is that fair?\"\n\n\"Isn't fighting the orc lord harder than taming a pet? Who else could've done this besides Grid?\"\n\n\"You're missing the point! I'm talking about game balance—one player shouldn't have this much power!\"\n\n\"Why not? Grid already rules a kingdom with tens of millions of people. What's a few more?\"\n\n\"Besides, the orcs won't join the Overgeared Kingdom directly. They're already a massive nation. This'll be an alliance, like with the water clan.\"\n\n\"But the water clan is different! Millions of *players* have converted to the orc race. What happens if Grid uses the orc lord to control them? To violate their player rights?\"\n\n\"Exactly. The orc lord can give absolute commands. Orc players can't refuse orders to wage war. If he commands them to 'fight for Grid,' millions of players become puppets overnight.\"\n\nA calmer voice cut through the chaos. \"You're catastrophizing. If Grid abused this, wouldn't the S.A. Group step in? What kind of amateur operation do you think they're running?\"\n\n\"Right. Orc lord commands are treated as quests with fair rewards. Maybe focus on real issues instead of conspiracy theories... Wait, General Zhang, Li Tai—aren't you both Chinese? Ah. Now I understand your *concern*.\"\n\n\"What does my nationality have to do with anything?\"\n\n\"Everyone knows millions of Chinese players switched to orcs because their government told them to. The goal was to install a Chinese player as orc lord and control the race. How many decades will it take China to produce someone who can challenge Grid now?\"\n\n\"That's bullshit! Shut your mouth!\"\n\nThe broadcast devolved into shouting. Viewers worldwide began to realize just how deeply China had infiltrated the orc population—and started asking uncomfortable questions.\n\n—Wait, doesn't the orc who defeats the lord *become* the lord? Won't Grid just take over?\n\n—All those players who went orc are screwed if Grid forces them into garbage quests for no reward.\n\n---\n\nThe concerns, however, proved unfounded.\n\nGrid didn't become orc lord. He *couldn't*. The succession rule—defeat the lord, become the lord—only applied between orcs. Grid wasn't an orc, so the title remained beyond his reach.\n\n\"I, Teruchan, pledge eternal loyalty to the great warrior Grid!\" The orc lord's voice boomed across the plains. \"Not as lord to kingdom—but as warrior to warrior! No orc shall complain. This is *my* choice!\"\n\nWith those words, Teruchan clarified everything. The *twilight orcs* weren't submitting to Grid. *Teruchan* was. It was a personal oath, not a racial one. The distinction quelled the rising panic among both orcs and players.\n\nLauel exhaled slowly. *Thank the gods.*\n\nIncorporating the orcs into the Overgeared Kingdom would've been a financial disaster. Orcs bred like rabbits and ate nothing but meat. Even with master farmers like Piaro and Hurent working miracles, feeding millions of carnivores would bankrupt them. The kingdom's territory couldn't handle the population explosion. And with the orcs' obsession with combat prowess, conflicts with existing citizens were inevitable.\n\nThis way? They avoided every problem while keeping Teruchan's loyalty on call. Perfect.\n\nGrid, however, looked disappointed.\n\n*Did he actually want to absorb the orcs?*\n\n*Dammit.*\n\nLauel drifted closer to the floating Grid. \"Your Majesty, the orc lordship isn't hereditary. Tomorrow, a new lord could rise. Our relationship with the orcs would shift dramatically with every succession. Future lords might rebel. Accepting them as subjects carries enormous risk.\"\n\n\"Hmm...\" Grid frowned. \"You don't regret this?\"\n\n\"Not at all. This arrangement shields us from player jealousy and suspicion.\"\n\n\"Alright. I trust your judgment.\"\n\nGrid descended to Teruchan. \"If your loyalty is genuine, then formalize it. Make a contract with me.\"\n\nTeruchan's massive brow furrowed. \"Contract? Loyalty needs no chains. Why bind what is already given?\"\n\n\"It's not like that. Let me explain—actually, hang on.\"\n\nThis was proving harder to articulate than expected. Grid paused, then activated his Different Species' King title. The contract system materialized before him.\n\n> **[Contract]**\n> \n> If the target belongs to a different species, you may propose a contract.\n> \n> The contracted target will awaken strengthened racial characteristics. You will acquire some of the target's racial traits.\n> \n> Once formed, *you* cannot dissolve the contract.\n> \n> However, the target may dissolve it at any time. If dissolved or if the target dies permanently, the acquired racial trait disappears. Contract slots cannot be recovered.\n\nGrid had already contracted with Hao, leaving him two slots remaining. He couldn't waste them. But after consideration, Teruchan was worth the investment. The orc racial bonus to strength and stamina was too valuable to pass up.\n\n> The orc lord **'Teruchan'** has been designated as your contract target. The **'Oath of Affection that Transcends Race'** will be shared.\n> \n> If accepted, the target's status increases and all characteristics strengthen. You will gain a characteristic of the twilight orcs.\n> \n> The target may terminate the contract at any time. If terminated, you lose the gained characteristic.\n\nNotification windows cascaded across Grid's vision.\n\nTeruchan went silent, reading the terms. Even with his limited intellect, the imbalance was obvious. The agreement heavily favored him.\n\n\"You trust me... this much?\" The orc lord's voice held genuine wonder.\n\nGrid met his eyes. \"Don't you trust me? Then I have to trust you first.\"\n\nTeruchan's tusked jaw tightened. \"Yes. I accept!\"\n\n> The target has accepted the contract!\n> \n> You will randomly acquire one twilight orc characteristic!\n> \n> ...Calculating against your luck stat!\n> \n> **Congratulations!** Your stamina stat coefficient has increased by **1.8x**!\n> \n> Health gain per point of stamina increased: **30** → **54**\n> \n> Defense bonus per point of stamina increased: **1.2** → **2.1**\n> \n> Affinity with Orc Lord Teruchan: **+20**\n\n*Yes!*\n\nPlayers who chose the orc race sacrificed aesthetics and intelligence for power. Grid reaped the benefits without any penalties whatsoever. Combined with the First King title's health bonuses, the increased stamina coefficient was phenomenal.\n\n\"Teruchan is honored!\" The orc lord beat his chest. \"Great warrior! When you need me—I will come! Anywhere, anytime!\"\n\n\"Stay in the Overgeared Kingdom for a few days. I'll craft you new weapons and armor.\"\n\n\"Yes! Thank you!\" Teruchan wheeled toward his army. \"Warriors! Return home! I remain here!\"\n\n\"GRAAAH!\" The roar of acknowledgment shook the earth.\n\nThe hundred thousand orcs surrounding Howl Fortress withdrew like a receding tide. Within minutes, the plains stood empty. Marquis Veze and his thirty thousand soldiers could only stare, dumbfounded. The army that could've annihilated their kingdom in days had vanished as though it had never existed. They'd witnessed the entire miracle unfold, yet it still felt unreal.\n\nGrid turned to the marquis. \"If fate allows, we'll meet again. Give Prince Shining my regards.\"\n\n\"Y-yes! We pray for your continued glory!\"\n\n\"ATTENTION!\"\n\nMarquis Veze and thirty thousand troops snapped into salute, eyes shining with absolute respect.\n\n---\n\n**[BREAKING: Millions of Chinese Players Now Under Grid's Influence!]**\n\n**[Twilight Orcs Can No Longer Operate Free of Grid's Shadow...]**\n\nChinese media outlets howled with outrage. A single battle had derailed China's momentum. The humiliation was unbearable.\n\nTwo days later, two Chinese fighter jets violated South Korean airspace, claiming \"navigational error.\" They ignored warnings from the Korean Air Force and flew through the East Sea at will.\n\nThe message was clear: a warning to a small nation getting too big for its britches. China wanted to isolate Grid by stoking anxiety in his home country.\n\nTwenty-four hours later, China faced condemnation from dozens of nations, led by the United States.\n\nAmerica, the European Union, and India discussed sanctions in concert, declaring that China threatened global peace and couldn't be trusted as the center of the world economy.\n\nThis was the power of the S.A. Group.\n\nThe company behind Satisfy had transcended corporate status—it operated with the influence of a nation-state. Its trade networks spanned every developed economy. Its cooperative relationships formed the backbone of international commerce. And Lim Cheolho had no intention of forgiving China's disrespect toward South Korea or the veiled threat to his headquarters.\n\nHe retaliated with surgical precision.\n\nWhen the capsule production plant in China shut down overnight, Beijing finally grasped the severity of the situation. Within hours, an official statement arrived: a full apology to the Korean people and a pledge that such incidents would never recur.\n\n---\n\nChairman Lim Cheolho sat in his office, watching Grid's progress on screen while enjoying chicken and soju. The world's wealthiest man. The \"grandfather\" Grid adored. The eccentric billionaire who wore a party hat to Grid's birthday celebration.\n\nHe raised his glass toward the screen and smiled."
}