{
  "id": 1101,
  "title": "Chapter 1100",
  "content": "\"Armor. *Gruruk.* Don't want. Too tight.\"\n\n\"Then wear it normally and only remove it before battle.\"\n\n\"...?\" \n\n*Why bother wearing it at all?* \n\nAs Grid studied Teruchan's expression, he realized the orc was considerably sharper than Jude. He cleared his throat. \"You need protection against surprise attacks.\"\n\n\"No need. *Gruruk.* Warriors don't fall to coward's tricks.\"\n\n\"Listen. You swore loyalty to me, didn't you?\"\n\n\"That's different! *Gruruk!*\"\n\n\"...\"\n\nTeruchan's physique resembled carved granite. Grid had witnessed the orc's incredible transformation firsthand—especially when Iron Arm activated. The skill caused Teruchan's shoulders and forearms to more than double in size during weapon throws.\n\n*That's exactly why I used cloth and leather.*\n\nThe experiment had failed spectacularly. Grid's cloth armor stretched past its limit and tore. The leather had constricted like a vice, crushing Teruchan's expanding muscles.\n\n*No wonder he hates it. It's not just uncomfortable—it's dangerous.*\n\nThe armor would become shackles mid-battle. A death sentence.\n\n*I can't make proper armor until I have more Greed.*\n\nGreed possessed extraordinary elasticity—a property inherited from adamantium. Armor crafted from it would accommodate Teruchan's transformations perfectly. But using Greed now was impossible.\n\nRemoving pavranium's traits would eliminate the 'Grid-only' restriction. However, the insane dragon hammer and anvil offered no precision. If it stripped away adamantium's properties as well, the entire point would be lost.\n\n*My past attempts proved that base metal properties get deleted easily. I can't risk wasting multiple pieces of Greed on trial and error.*\n\nFirst, he needed to improve his tools—gain better control over which properties survived the forging process.\n\n\"Then take this.\" Grid tossed a large bundle of fabric at Teruchan. \"Underwear. Wear it even if you refuse everything else.\"\n\nCurrently, Teruchan wore only a yellowed scrap of cloth that barely covered his groin. From behind, his muscular buttocks were completely exposed—a display that had sparked protests from certain player groups complaining about the sexualization of male bodies. More importantly, the rag offered virtually no defense.\n\nGrid's underwear, by contrast, boasted double-digit protection. A solid 10 defense. Small, yes—but infinitely better than nothing. For Teruchan, whose percentage-based buffs multiplied his defense, it could make a real difference.\n\n\"It's roomier than you're used to. Might feel strange at first, but you'll adjust. The fit is close to the skin, so it won't restrict movement.\"\n\n\"...\"\n\n\"And don't worry about... accidents. I reinforced the front panel.\"\n\n\"...\"\n\nThe stitching was immaculate—even, precise intervals throughout. Grid's underwear wasn't just functional; it was crafted with genuine care.\n\nTeruchan stared at the garment, expression unreadable. Then, hesitantly: \"Great warrior. *Gruruk.* You made this armor yourself?\"\n\n\"I'm multi-talented.\"\n\n\"...*Gruruk*...\" \n\nTeruchan's eyes reddened. Like most orcs, he'd been abandoned young. Gifts were foreign to him. No one had ever made him something so personal—something meant to be worn every day, close to his skin.\n\n\"Until cloth is destroyed. *Gruruk.* Won't change. Will wear carefully.\"\n\n\"What? No, I'll make dozens. Change them daily.\"\n\n\"Never! Won't take off! *Guruk!* Your sincerity! Will treasure!\"\n\n\"...\"\n\n*He's not listening.*\n\nIf Teruchan's skin were green like normal orcs, Grid would've nicknamed him 'Tree Frog.' He smiled ruefully and pulled up Failure's production method.\n\nHe could have chosen the White Tiger Sword or the Enlightenment Sword—but Failure was a *greatsword.* Teruchan's preferred weapon was the broadsword. The synergy would be exceptional. \n\nBesides, Grid had always valued Failure highly.\n\n*The damage output is incomparable.*\n\nThe unique-rated White Tiger Sword—created with Kraugel—dealt 493 to 817 damage. The unique-rated Enlightenment Sword ranged from 930 to 1,050.\n\nFailure? 733 to 1,621.\n\nTrue, the White Tiger and Enlightenment Swords were one-handed weapons, fundamentally different from Failure's two-handed aggression-focused design. And yes, Failure used cheaper materials—no adamantium, no bloodstone, no sacred creature breaths or great demon byproducts.\n\nYet despite being forged from relatively common materials, Failure's damage rivaled divine weapons.\n\n*It's almost criminal.*\n\nThe system had compensated with brutal stat requirements—hence the name 'Failure.' But Teruchan was the Strongest Warrior. \n\nTeruchan could wield it.\n\n*Thirty percent of 4,000 is 1,200... so his combat strength reaches 5,200.*\n\nGrid double-checked his calculator before addressing the orc. \"Teruchan, I'm making you two weapons. First, an improved broadsword for regular use. Second, an exceptional greatsword.\"\n\n\"*Guruk?*\"\n\n\"The greatsword will require your full strength to swing. Carry it on your back—use it when battle demands. Practice switching between weapons until it becomes natural.\"\n\n\"Why difficult?\"\n\nTeruchan genuinely didn't understand. As the strongest warrior, why would any blade be hard to wield?\n\n\"I. *Gruruk.* Can uproot giant trees. Swing them like clubs. Sword. *Gruruk.* Easy.\"\n\n\"I think it's a design flaw... Well, you'll see once you try it.\"\n\nGrid poured all his accumulated Greed into the roaring furnace—keeping only one piece for proliferation.\n\n\"Let's begin.\"\n\nHe drew out the insane dragon hammer and anvil. Unlike with armor, deleting mineral properties wouldn't matter here. He moved without hesitation.\n\n*Ttang! Ttang!*\n\nSmelting. Forging. Tempering. Quenching...\n\nGrid's pace wasn't fast. In fact, he worked slower than average blacksmiths. Instead of using casting molds, he shaped the blade entirely through hammer strikes. Auto-production could mass-produce items in hours, but for important pieces, Grid insisted on manual craftsmanship. \n\nPhysical and mental strain didn't matter—not if it improved the results.\n\n*I need stronger allies.*\n\nPeace in Satisfy was always temporary. Two billion players generated endless stories—small neighborhood dramas and world-shaking crises involving the Yatan Church and great demons alike.\n\nOne certainty remained: new episodes would bring new threats. The game could expand overnight from the West Continent to the East. Grid needed to be ready. He needed more companions—*stronger* companions.\n\nThat's why he endured the long absences of Asmophel, Mercedes, and the Ten Meritorious Retainers.\n\n*I can't embarrass myself when we reunite.*\n\n*Ttang! Ttang!*\n\n*I'll improve. Prepare. Grow stronger.*\n\nThe Legendary Blacksmith's Breath and Patience—converted to passive skills during his competition against the blacksmithing god Hexetia—pushed his concentration to its absolute limit.\n\n***\n\n[The **Failure Honoring the Strongest Warrior** has been completed!]\n\n\"...?\"\n\nGrid snapped out of his trance. He'd hoped for good results—Greed was valuable despite losing most properties during forging. But he hadn't dared expect a *modifier.*\n\nFailure was inherently flawed. The system rarely rewarded it with high completion rates. Yet somehow, a modifier appeared. Tailored perfectly for Teruchan.\n\n> **[Failure Honoring the Strongest Warrior]**\n> \n> **Rating:** Unique (Growth)  \n> **Durability:** Infinite  \n> **Attack Power:** 1,190~2,005  \n> **Defense:** 80\n> \n> * Agility +60\n> * Low probability of blocking enemy attacks.\n> * Chance to activate **5 Joint Attacks**.\n> * Chance to activate **Cutting**.\n> * Generates skill **Bisect**.\n> * High probability of triggering **Crush**.\n> * Fear effect against enemies 10+ levels lower than user.\n> * +20% damage when used by Teruchan.\n> \n> *After achieving enlightenment against the gods, Blacksmith Grid reinterpreted the failed work he created during his inexperienced days.*\n> \n> *This greatsword possesses excellent cutting ability despite its classification. The blade resembles a shark—apex predator of the seas—and instills fear in enemies. Small serrated edges provide defensive utility.*\n> \n> *Every element was crafted with Teruchan in mind.*\n> \n> *Teruchan will feel complete unity with this weapon.*\n> \n> **Conditions of Use:** Teruchan, Grid  \n> **Weight:** 860\n\n\"I tried to make it usable by others...\"\n\nGrid hadn't expected the restrictions to turn out this way. Now he looked like a liar. Setting a terrible example for a young orc...\n\nHe shook his head and glanced toward the window. Deep night. He'd started in early evening, so it shouldn't have been long.\n\n*...Wait.*\n\nHis eyes were red and watery. His legs trembled. Both hands were numb. Sweat had cooled across his entire body. Grid checked his stamina gauge—nearly depleted—and looked sideways.\n\nTeruchan sat there. Eyes hollow. Cheeks gaunt, as if ill.\n\n\"What's wrong? Are you alright?\" Grid asked with concern.\n\n\"*Grruk.* You not great warrior.\" Teruchan's massive hands reached out. \"You. *Gruruk.* Not great blacksmith.\"\n\n\"...?\"\n\nBefore Grid could respond—\n\n\"You...\" \n\nTeruchan fell to his knees.\n\n\"You are Great Grid. *Grruk.*\"\n\nTeruchan knew nothing of blacksmithing. So he'd watched Grid's dedication instead. Been moved countless times. Grid had worked two and a half days straight—for an enemy from mere days ago.\n\nThat sincerity would never be forgotten.\n\n\"Armor. *Gruruk.* Will wear. Even if uncomfortable.\"\n\n\"Wait—\" Grid started.\n\nWas it the Different Species' King title? His affinity with Teruchan was maxing out—the highest he'd ever achieved. Grid smiled and reached up to stroke Teruchan's forehead, which dwarfed his own hand.\n\n\"You don't have to wear it if it's uncomfortable. You might get hurt.\"\n\n\"No. *Gruruk.* Will wear.\"\n\n\"No, I'll craft better armor later.\"\n\n\"Until then. *Gruruk.* Today's armor. Will wear.\"\n\n\"No, damn it! Just listen to me!\"\n\n\"*Hiccup!* Understand.\"\n\n\"S-Sorry for yelling.\"\n\n\"*Grruk*...\"\n\n*Shit.* He'd cursed in front of Teruchan. Made the orc feel scolded.\n\nGrid hated himself.\n\n***\n\n**Simultaneously, in a forest within the Gauss Kingdom...**\n\n\"Human, leave. This territory is under elven protection.\"\n\n\"Tell me where the black thing is before you die.\"\n\nThe elves confronted a green-haired man.\n\n\"Black thing...?\"\n\n\"Your former comrade. I need the flesh of the fallen.\"\n\nOne step.\n\nAfter acquiring his third class—Demon World Noble—and gaining greater authority, he was only one step away from resurrecting his lost love."
}