{
  "id": 1104,
  "title": "Chapter 1103",
  "content": "# Chapter Excerpt: The Scent of Consequences\n\nShay, Kerb, and Sniffer—that infamous trio of player killers—had tried to ambush Grid more times than he could count. And yet, strangely enough, he'd developed an odd fondness for them. Their schemes had yielded unexpected rewards: equipment crucial for defeating Pope Drevigo, the legendary assassin Kasim as an ally, and even direct aid during the war against the Empire.\n\nThey were like harbingers of fortune disguised as misfortune. Every plot they'd hatched against him had somehow worked in his favor. With one exception: Marie Rose.\n\nWhen Grid had stumbled into their trap and broken the seal on Marie Rose's prison, he'd inadvertently awakened a vampire duke of unimaginable power. The encounter had left him unsettled. A demonkin with strength rivaling the upper great demons—what kind of monster must she be for the Rebecca Church to risk everything sealing her away? Surely crossing paths with her would prove disastrous eventually.\n\nThat's what he'd believed, anyway. But his perspective had shifted. Not all demonkin were evil. He'd befriended vampires before. And the Rebecca Church itself wasn't the paragon of righteousness he'd once thought—not even Goddess Rebecca herself. Various encounters had taught him that much.\n\n\"Sniff, sniff. Sniff sniff sniff.\"\n\nThe nostalgic scent Marie Rose had mentioned... Grid experimentally sniffed his armpit.\n\n'She seems favorably disposed toward me. Maybe she wants to repay me for freeing her?'\n\nHe'd met several of her direct descendants—Braham and Noll among them—and found them surprisingly principled. They possessed a certain cruelty, treating human blood as sustenance, but that was biological necessity rather than malice. Their fundamental nature wasn't evil.\n\nBesides, they despised Evil God Yatan and the great demons. Their progenitor, Shizo Beriache, had been exiled because of them, and all vampires suffered under the Curse of Idleness as a result.\n\nGrid nodded to himself. 'Contrary to Nefelina's warnings, there's no reason Marie Rose and I should become enemies. If anything, she's likely to view me with goodwill.'\n\nThe probability supported this conclusion. If the Overgeared Kingdom made an enemy of Marie Rose, they'd be wiped out within days. Her power matched that of an upper great demon. Better to have her as a friend.\n\nAfter a productive day at the forge, Grid returned to his office, still contemplating these matters.\n\n\"Gods, that reek. When's the last time you bathed?\"\n\nGrid looked up from sniffing his armpit to find Lauel pinching his nose with an expression of disgust.\n\nGrid shrugged. \"I'm worried Marie Rose won't recognize me if I wash away my scent.\"\n\n\"Hm... Does Marie Rose actually like Your Majesty's particular... aroma?\"\n\n\"...?\"\n\n\"You were wearing Malacus's Cloak when you met her, weren't you? She woke up because of the blood-scent saturating that cloak.\"\n\n\"...\"\n\n\"It's rather far-fetched to assume she'd notice your personal odor through that overwhelming stench of blood. The scent she finds nostalgic isn't your body odor—it's the blood soaked into Malacus's Cloak.\"\n\nThe logic was sound. So Marie Rose liked the cloak, not him? Grid's face fell as Lauel laughed.\n\n\"I'm joking. You only wear Malacus's Cloak for gathering mobs at hunting grounds. The nostalgic scent Damian and Zednos mentioned was definitely your natural odor.\"\n\n\"Damn it. You scared me. What kind of joke was that?\"\n\n\"The kind meant to raise your guard. Don't think too positively about Marie Rose.\"\n\n\"...?\"\n\n\"Her presence is overwhelming. You can't afford her attention. Your Majesty shouldn't become entangled with her.\"\n\nThis surprised Grid. He'd expected Lauel to be thrilled about Marie Rose's emergence.\n\n\"Why the pessimism? Even Braham and Noll started as enemies, and now they're our comrades. Meanwhile, Marie Rose has shown me favor from the beginning. I think we could easily gain her as an ally.\"\n\n\"Braham and Noll were vulnerable.\"\n\n\"...?\"\n\n\"Powerful, yes, but emotionally unstable. They unconsciously sought someone to depend on. Your Majesty's care and attention affected them deeply. But Marie Rose? According to Braham's testimony, she's *perfect*.\"\n\nBeing perfect meant having no regrets. No need for assistance or affection.\n\n\"My assessment is that what she feels toward Your Majesty is curiosity rather than genuine fondness. You unsealed her, and you resisted her charm. She's intrigued by you as an anomaly.\"\n\n\"...\"\n\n\"The moment she encounters you and satisfies that curiosity, her goodwill might evaporate. Then she'll change in an instant. She could devour you.\"\n\n\"That's excessive—\"\n\n\"It's based on Zednos's account of her casual violence toward Fenrir. She has no regard or respect for others. She's cruel and capricious.\"\n\n\"...\"\n\n\"Don't be blinded by her beauty. Think objectively. She's different from the other descendants you've befriended. She's not someone you should gamble on.\"\n\nGamble...\n\nGrid understood all too well. He couldn't deny that his friendships with Braham and the others owed much to luck.\n\n\"I understand.\" Grid rose and headed for the bathroom. He scrubbed himself thoroughly with soap, rinsing again and again until every trace of sweat vanished. An effort to eliminate any lingering odor.\n\nLauel's expression remained troubled. 'Marie Rose's purpose in visiting the forest must be to meet the elves.'\n\nHe doubted she was going for a pleasant conversation. The mutual hostility between demonkin and elves ran deep. Marie Rose would likely clash with them.\n\n'How frustrating.'\n\nLauel viewed the elves as valuable political assets. He wanted to support their activities—their movements were causing difficulties for every nation except the Overgeared Kingdom and the Empire. But Marie Rose threatened to disrupt those efforts.\n\nHe prayed silently, 'Let a great demon fall from the sky. Please, let some massive event capture Marie Rose's attention instead.'\n\n***\n\n[You have suffered catastrophic damage!]\n\n[You have died.]\n\n[You possess the qualifications of a Hell Ruler and transcend the concept of death.]\n\n[Your health has been fixed at minimum. You will not die. Your race has changed to Undead.]\n\n[You have suffered catastrophic damage!]\n\n[Your right arm has been severed!]\n\n\"Shit...!\"\n\n[You have suffered catastrophic damage!]\n\n[Your left ankle has been shattered!]\n\n\"God *damn* it!\"\n\n[You have suffered catastrophic damage!]\n\n[Your neck has been broken!]\n\n\"Fuck...!\"\n\n[You have suffered catastrophic damage!]\n\n[Your skull has been crushed!]\n\nThe undead transcended death and suffering, but possessed a fatal weakness: physical fragility. Their bodies broke far too easily.\n\n[Your body is completely destroyed and has ceased functioning.]\n\n[Your soul is being transferred to a new vessel in Baal's sanctuary.]\n\n[Your soul suffered severe trauma during transfer.]\n\n[You have lost 38.1% experience.]\n\n[The item 'Soul Absorption Cloak' has been dropped.]\n\n\"*Fuck!*\"\n\nFour days straight, and he'd died every single one. Twice yesterday alone, earning him a temporary game ban. Today would be the same. But Agnus refused to quit. He resurrected in a fresh body, burst from the incubator, and sprinted back toward the portal.\n\n\"Pathetic.\" The mocking voice stopped him cold. \"You can't handle a single elf despite all the power the great Baal bestowed upon you. Human weakness never changes, does it?\"\n\nAgnus turned to find an enormous frog wearing a crown—a comical sight if not for the name floating above its head: 'Chepardea,' rendered in ominous black text.\n\n\"Bestowed power? He gave me necromancy and commands. That's it.\"\n\nChepardea was one of Baal's Four Henchmen, among the most powerful beings in Hell. He could kill Agnus with a flick of his tongue. Yet Agnus feared nothing in any world and glared at the demon without flinching.\n\nThe frog made an exaggerated gagging motion like something from a comedy sketch, then inflated his throat. \"Your incompetence is showing. Typically, those who contract with Baal receive absolute swordsmanship, magic, and the wisdom to perceive all truths. You lack the capacity to fully inherit these gifts.\"\n\n\"Shut your putrid mouth.\"\n\nAgnus had no time to waste on this creature. He needed to track down that dark elf again before she disappeared completely. Ignoring Chepardea, he reached for the portal. The demon's tongue shot out, blocking his path. At its rolled tip rested an ancient tome.\n\n\"Stand in Idleness.\"\n\n\"...?\"\n\n\"The descendants of the exile will approach you. Open this book, and they will be forced back into their coffins.\"\n\n\"Descendants of the exile?\"\n\n\"The vampires. I care little if the elves trample you, but you will not disgrace Baal or show weakness before the vampires. Understood?\"\n\nAgnus sneered but accepted the Book of Idleness. He despised the frog, but saw no reason to refuse.\n\n***\n\nEvery player affiliated with the Yatan Church received the same quest notification: reseal the vampire duke Marie Rose, who had recently awakened. An absurd SSS+ rated quest—but with five million Yatan Church members, confidence ran high. The masses heading toward the quest location showed no signs of doubt.\n\n\"Hold on—aren't vampires demonkin?\" Rose, the 1st ranked black magician and Yatan's Eighth Servant, voiced the question aloud. \"They're hostile to Rebecca. Doesn't that make them our allies? Why seal her?\"\n\nHaving profited immensely from every great demon summoning ritual, Rose now ranked among the world's strongest players. She was confident she could hold her own against anyone except the top five—including Overgeared King Grid.\n\nYatan's Fourth Servant Frodo, walking beside her, answered. He'd inherited Silvenas's position after the previous Fourth Servant fell to Agnus, and possessed far greater strength than his predecessor. \"The vampires are descendants of the exiled Beriache. They harbor hostility toward Evil God Yatan. Punishing their leader is righteous.\"\n\n\"But won't the Rebecca Church act even if we don't? Why not let them handle the sealing?\"\n\n\"The current pope is worthless despite the templars' support. He lacks the power to seal Marie Rose.\"\n\n\"...?\"\n\nWait—hadn't the pope defeated them? Did that mean this quest was impossible? Rose wondered, 'Could this \"great world change\" involve the Yatan Church's destruction?'\n\nShe decided to hang back from the frontlines, but realized too late they'd already arrived at the forest's edge.\n\n\"Move forward,\" Frodo commanded, urging Rose and the other Yatan players onward. Then—\n\n\"You go no farther.\"\n\nKnights in crimson armor materialized, blocking the path. Everyone recognized them instantly.\n\n\"The Red Knights?\"\n\nWhat were the Empire's elite knights doing in the Gauss Kingdom? The Yatan followers exchanged confused glances.\n\n\"Cross into this forest and you'll be declared enemies of the state. You'll be executed on sight.\"\n\nAn unexpected figure emerged from among the knights—a player whose ID read 'Zibal.' One of the five strongest players Rose acknowledged as her superiors. The power of magic machines made manifest.\n\n\"Why are you...?\"\n\n\"My new master is welcoming a distinguished guest.\"\n\nHe didn't mention that his new master was Grandmaster Zikfrector. From the Rebecca Church to the Yatan Church, from Baal's Four Henchmen to the grandmaster himself—Marie Rose's awakening sent ripples throughout the entire world.\n\nAs for Grid...\n\n\"Husband, you're wearing an awful lot of cologne today. Almost like you're trying to cover up another woman's perfume.\"\n\n\"Irene, you're misunderstanding. There's a perfectly good reason—\"\n\n\"Oh, I'm not upset. I'll respect and support you even if you take a thousand concubines.\"\n\n\"No, I can only manage once a month anyway, so a thousand would be... wait, huh? Irene? Where are you going? *Irene!*\""
}