{
  "id": 1105,
  "title": "Chapter 1104",
  "content": "Zibal had served Prince Edan—the traitor who murdered Emperor Juander before meeting his own death. Everyone assumed Zibal had been purged along with Edan's other conspirators. Yet here he was, fighting alongside the Red Knights. The sight of a supposed traitor still operating within the empire raised questions.\n\n\"Shouldn't you have been executed for treason by now?\" Rose studied him with renewed interest. \"It seems even the mighty empire recognizes exceptional talent when it sees it.\"\n\nThe imperial family had kept the Grandmaster's involvement secret. The public only knew that Prince Edan had staged a failed rebellion and the emperor had changed in the aftermath. The Yatan Church shared this limited understanding—that bastard Edan had cut their deal short, leaving them blind to the true details. Naturally, the Yatan followers assumed these Red Knights served the empire.\n\n\"Didn't the new empress declare her intention to unite the world through diplomacy rather than conquest?\" Rose's tone carried false innocence. \"I recall a proclamation against unilateral military intervention. Yet here you are, occupying foreign soil. The empire seems unchanged from its old ways—just more subtle about it now.\" She gestured expansively. \"Why not extend that same courtesy to our church? Consider this an opportunity to establish mutually beneficial relations.\"\n\nRose still held cards to play. Yatan followers were converging on this location from across the continent. With reinforcements arriving steadily, breaking through these knights and completing her mission seemed well within reach.\n\n\"Curse the emperor all you like. Curse the empire if it pleases you.\" A knight leveled her blade at Rose. \"But you turn back here. Now.\"\n\nSusan cut an imposing figure despite—or perhaps because of—the vicious scar carved across her forehead, a mark that only enhanced her severe beauty.\n\nRose's eyes narrowed. \"How peculiar. Isn't the loyalty of the Red Knights supposed to run deeper than the ocean itself? Or were those merely empty words?\"\n\n\"Filthy servant of Yatan, do you intend to waste my time with idle talk?\" Susan's blade didn't waver. \"Turn away, or die.\"\n\n\"Such harsh words. That scar on your forehead must have robbed you of your manners as well.\" Rose smiled coldly.\n\n\"Then death it is.\"\n\nSusan's sword became a streak of silver light. Most rankers couldn't have tracked the blade's path, but Rose had prepared for this fight the moment she'd seen Susan's golden name marker. Her Diamond Shield manifested instantly.\n\nThe shield shattered.\n\nA single strike demolished her strongest defense. Rose immediately reformed the barrier, fingers already weaving the pattern for her next spell. Even as she braced for the inevitable pain, a spear intercepted Susan's follow-up strike.\n\n\"She's a bad match for you.\" Frodo held the knight's sword at bay with apparent ease. \"Fall back. Provide support from range.\"\n\nRose nodded sharply. \"Understood.\"\n\n\"This filth won't stop me!\" Susan pressed her attack with renewed fury, but found her opponent frustratingly resilient. Frodo's movements flowed with practiced creativity, each counter executed with masterful timing.\n\n\"A Yatan Servant?\" Susan's eyes widened fractionally.\n\n\"Perceptive. And you—a single-digit knight.\"\n\nThe skirmish erupted into full-scale battle. Thousands of Yatan followers joined Rose in weaving curtains of black magic to shield Frodo while the Red Knights carved bloody paths through enemy ranks. Twenty against thousands, yet the knights more than lived up to their fearsome reputation.\n\n*This is worse than the intelligence suggested.* Rose's expression darkened. The Red Knights weren't merely master swordsmen—they wielded magic with equal proficiency. Protective wards and enhancement spells manifested with disturbing speed, negating the followers' dark sorcery.\n\n*Since when do Red Knights use magic? And these spells... I've never seen their like.*\n\nRose withdrew another step, her instincts—honed through years of survival—screaming warnings.\n\n*The skill gap is too vast. We'll lose half our forces before reinforcements even arrive.*\n\nShe didn't know the identity of this \"master\" commanding Zibal and the Red Knights. If he matched or exceeded the empire's dukes in power, then even with reinforcements, the Yatan followers faced grim odds. And another possibility gnawed at her thoughts.\n\n*What if their master is Marie Rose?*\n\nIf the vampire duke had forged an alliance with these knights... the Yatan Church would be crushed between two overwhelming forces. Rose made her decision.\n\nFly magic surged through her body as she launched herself skyward. The quest could wait. She'd traded demon summonings for her current equipment—death would mean losing everything.\n\n*Damn it. What a waste of time.*\n\nShe ascended rapidly, confident that Frodo and the other followers would cover her escape.\n\nIt was a fatal miscalculation.\n\n\"Gkkk—!\"\n\nSomething slammed into her with the force of a falling star. Rose plummeted, her vision exploding red as her face cratered into the earth. The impact rattled her bones, scrambled her thoughts.\n\n*What... what hit me?*\n\nAn enormous shadow fell across her broken form. A mountain of metal and magic looming overhead.\n\n\"...No...\"\n\nRose forced her head to turn through the haze of pain and shock. A massive spear had impaled her body, pinning her to the ground like an insect in a collection. The white giant gripping the weapon's shaft began extracting it with agonizing slowness.\n\n\"Do you know who I hate most in this world?\" Zibal's voice echoed from the magic machine's shoulder where he perched.\n\nHe pointed down at her. \"Selfish people like you.\"\n\n\"Kgh... *cough*...\"\n\n\"Do you have any idea how many innocents suffered each time you helped Benoit summon those demons?\"\n\n\"That's... sophistry. I was just... *cough, cough*... completing a quest. The emergence of great demons is inevitable. *Cough.* If not me, then someone else would have... you'd have done the same.\"\n\n\"You're right. I probably would have.\" Zibal's expression hardened. \"But would I have been as shameless about it as you?\"\n\n\"...?\"\n\n\"When the Overgeared Kingdom declared their intention to kill you... I got chills watching you cry on television.\"\n\n\"What—\"\n\n\"A rat should die like a rat. You had no right to complain about persecution when you carried even a shred of guilt for the millions who died because of you.\"\n\n\"Are you insane? I was completing a quest. Why should I feel guilty? Besides, I'm a person. I have every right to defend myself when attacked.\"\n\nRose discreetly downed a potion, her fingers tracing spell patterns beneath Zibal's line of sight. She counted seconds in her head, waiting for the magic machine's operational limit to expire. \n\nZibal shook his head slowly. \"Your quests killed people. Did you ever consider their perspective? Even once?\"\n\n\"Ah... I see now. This is genuinely pathetic. 'The pain of the dead?' You're making my skin crawl. Aren't you a bit *too* immersed in this game? What are you, some basement-dwelling shut-in?\"\n\nRose's expression shifted from wronged innocence to predatory satisfaction. She'd been wary of that magic machine—but without it, Zibal posed no threat. And according to her calculations, the machine's operating time had just expired.\n\n\"Black Hole!\"\n\nHer ultimate spell. Devastating damage to all targets within range, five concurrent debuffs, reality itself warping at her command. The designated space began to collapse inward with Zibal at its epicenter. She could already imagine his screams—\n\n\"—?!\"\n\nThe white giant's spear swept through the distorted space and *deflected* the black hole itself, dispersing her ultimate magic like smoke.\n\nZibal laughed at her shock. \"Still thinking too small, aren't you?\"\n\nThe day Edan fell, Zibal had escaped the imperial palace alongside the Grandmaster. When that legendary figure offered cooperation, Zibal had seized the opportunity—this changing world demanded his participation in its greatest performances. The result stood before her, enhanced beyond her outdated intelligence.\n\n\"W-Wait! Wait, please!\" Rose's voice cracked with sudden desperation. \"I *am* sad about what happened! I've always felt terrible about those who suffered because of me! I just couldn't admit it—I was too ashamed!\"\n\nShe wept like a condemned criminal, tears streaming down her face with apparent sincerity. \n\nIt changed nothing.\n\nThe spear punched through her torso once more, and Rose crumbled to gray ash. Her story ended there.\n\nAn explosion tore through the distant forest—a violent eruption of fire and demonic energy that obliterated more than half the woodland.\n\nZibal's expression hardened. *Negotiations broke down?*\n\nGrandmaster Zikfrector had claimed to be an incarnation of the Seven Malignant Saints. He'd revealed many truths: his purpose to find the expelled gods and strip the fallen gods of their authority, which meant earning the enmity of both fallen deities and great demons alike. He needed to gather strength for the battles ahead.\n\nThen Marie Rose had awakened. Zikfrector had placed high hopes on the vampire duke—she hated the great demons, making her a natural ally. But would Marie Rose, herself a demonkin at her core, truly cooperate with someone like Zikfrector? Zibal had harbored doubts from the start.\n\n\"Zibal!\" Susan's shout cut through his thoughts. \"Leave this to us! Go help Master!\"\n\n\"Son of a bitch.\" \n\nSending the weakest one to help? Zibal clicked his tongue but sprinted toward the forest as a high-difficulty quest notification materialized before his eyes.\n\n***\n\nRoaring flames devoured the forest. At the epicenter of devastation stood three figures: Vampire Duke Marie Rose, Vampire Marquis Fenrir, and Grandmaster Zikfrector.\n\nMarie Rose's crimson eyes fixed on the Grandmaster. \"You're strong. You remind me of Chreshler.\"\n\n\"I'm rather different from him.\" Zikfrector's voice remained measured. \"This body may be human, but my soul is not.\"\n\n\"Cryptic words. A tiresome habit.\"\n\n\"I am the incarnation of the Seven Malignant Saints.\"\n\n\"...?\"\n\n\"I am the soul of Zik, the Sixth Evil, consumed by the sin of sloth, who has reached the end of his reincarnation cycle.\"\n\n\"...\"\n\n\"I seek revenge against not only the fallen gods but the great demons who allied with them. My cherished wish is to cast down the deities who wronged us seven, and reveal the truth to the world.\"\n\n\"Don't spout nonsense,\" Fenrir interrupted, his tone flat with disbelief. His reaction was entirely reasonable—Zikfrector's claims bordered on delusional.\n\nZikfrector ignored the marquis entirely, maintaining eye contact with Marie Rose. \"To achieve this dream, I must discover the whereabouts of the expelled gods. I've finally found a location closely connected to them.\"\n\n\"Then investigate it.\"\n\n\"Precisely. However, I cannot do so alone. I need someone who could earn the favor of gods without arousing their suspicion. Or... the cooperation of those with overwhelming power against great demons.\"\n\nMarie Rose's lips curved slightly. \"And I represent the latter option.\" She spoke as if accepting his claims at face value. \"Does someone fitting the former description exist?\"\n\n\"Yes.\"\n\n\"Who?\"\n\n\"That...\" Zikfrector's response died as both Marie Rose and Fenrir's gazes snapped toward the sky.\n\nA black portal tore through reality, reeking of sulfur and damnation. A hell gate—bridging the infernal realm and the surface world.\n\nFenrir's composure shattered. \"Only a handful of beings can freely open hell gates... entities even single-digit great demons cannot summon easily...\" His voice dropped to a venomous whisper. \"Baal...!\"\n\nThe absolute monarch of Hell.\n\nMarie Rose and Zikfrector both tensed, gathering magical power as they focused on the widening portal.\n\n\"Who are you?\" Marie Rose called out sharply.\n\nA green-haired figure emerged from the gate. Agnus surveyed the three before him, then growled, \"Where did that black-haired thing go? Tell me before I rip your limbs off and kill you slowly.\"\n\n\"...Baal's Contractor?\" Marie Rose's eyes gleamed with interest. One of the primary reasons she'd awakened—her irritation at Baal's latest contractor. \"Fenrir. Tear out that bastard's heart. Erase Baal's imprint.\"\n\n***\n\nAt the same moment, in Reinhardt, capital of the Overgeared Kingdom...\n\nSticks approached Grid with unusual gravity. \"Mother wishes to see you.\"\n\nGrid blinked, running through his mental calculations. \"Your mother's still alive?\"\n\n\"...\"\n\n\"The World Tree,\" Lauel interjected smoothly, translating for the speechless high elf. \"He means the World Tree.\""
}