{
  "id": 1106,
  "title": "Chapter 1105",
  "content": "\"...!?\" \n\nThe recognition hit Agnus like a physical blow. Vampire. The blood-scent alone was enough to choke him—if even a drop of Fenrir's essence touched his skin, he'd be finished.\n\nA death knight materialized between them. These weren't ordinary undead—each had been a legend in their time, champions who'd conquered their eras. Against high-rankers and boss monsters alike, they'd proven unstoppable.\n\nFenrir crushed the death knight's skull in one hand.\n\nThe undead's sword bit into Fenrir's chest, but the vampire's counterattack had already punched through its ribcage. The death knight crumpled, its damage output pathetic against such overwhelming power.\n\nBlood erupted in a pillar, obliterating what remained of the skull. Even headless, the death knight kept fighting—but blind strikes meant nothing. Fenrir tore through it like parchment and lunged for Agnus.\n\nAnother death knight blocked his path.\n\n\"Resistance is meaningless. Don't bother.\"\n\nAgnus ignored him, eyes locked on the notification.\n\n**[You have encountered Vampire Duke Marie Rose.]**\n\n**[You have encountered Vampire Marquis Fenrir.]**\n\nThe frog's prophecy. He'd never imagined meeting the exiled bloodline so soon.\n\n*Damn it... why now...*\n\nHis glare could have killed Marie Rose where she stood. \"The black thing. Did you already hunt her?\"\n\nThe dark elf Beniyaru was a monster—close to level 500, master of archery, elementalism, and black magic. Her attack power dwarfed typical elves. Seven times Agnus had challenged her. Seven times he'd lost.\n\nAnd these people would shred her.\n\nFenrir alone felt comparable. Marie Rose? Several times stronger. And this 'Zikfrector' character radiated something dangerous, something *wrong*.\n\n\"Answer me!\" Agnus' voice cracked. \"Did you kill her or not?\"\n\nThis was it. The final piece. His lover's resurrection hung in the balance, and reason was slipping through his fingers like sand. Tears burned in his eyes. He wanted to tear the world apart, to scream until his throat split open and bled.\n\n\"Why...! WHY?! KUAAAAAAH!!!\" \n\nControl shattered. Every death knight. All of them. Agnus summoned his entire arsenal and charged Marie Rose. He knew the odds. Zero chance of victory. But this wasn't bravery—it was having nothing left to lose.\n\n\"Die! Die! DIE!!\"\n\nNo strategy. No tactics. Pure frenzy.\n\nHis body refused to move.\n\n\"...?\" \n\nThorns of crystallized blood spiderwebbed through his veins, binding him, binding his death knights. Paralyzed.\n\n\"This is the full extent of Baal's Contractor?\" Marie Rose's voice was flat, almost bored. \"The current Pope is equally disappointing.\"\n\nShe studied Agnus with cold detachment. Would hurting this pathetic creature even register as revenge against Baal? The demon king probably wouldn't blink. Still... she glanced at Fenrir. \"Finish it. This will wound Baal, however slightly.\"\n\nShe had no burning need to destroy Yatan's Church or the great demons. But her mother deserved that much loyalty. Marie Rose wouldn't hunt down those who'd exiled Beriache from Hell—but if vengeance presented itself freely? She wouldn't refuse.\n\nAt her command, Fenrir's hand plunged into Agnus' chest.\n\n\"*Cough!*\" Black-red blood sprayed from Agnus' lips as he doubled over. Flesh tearing. Intestines shifting. Bones cracking. Through the agony, memories surfaced.\n\nHe'd cried while watching his lover suffer, powerless against the strong. Now he was powerless again, victim to the same ruthless violence. Nothing had changed. He'd vowed to be different. He'd failed.\n\n\"K... Kukuk! Kik! Kikikik!\" \n\nHe knew how to resurrect her. One elf. That was all he needed. The madness he'd briefly suppressed came roaring back. \"*Kahahat! Kek!*\"\n\n\"...!?\" \n\nFenrir's hand froze mid-extraction. Agnus had bitten through his own tongue—suicide?—but no. His body was withering, blood evaporating, skin and flesh rotting into dust. Even the heart in Fenrir's grip crumbled. Within seconds, only bone and scraps of tissue remained, rattling inside the blood-thorn prison.\n\n\"You fool!\"\n\nHe'd transformed himself into undead to save his heart? Making that calculation through the terror of being ripped apart alive? Fenrir's elbow cracked into Agnus' half-flayed skull, fury overriding restraint.\n\n\"...*Kikik*.\" \n\nAgnus laughed. Lich Mumud manifested above him.\n\n\"Buy me time.\"\n\nMumud's spell ignited the air.\n\nFenrir dismissed the lich—what threat could it pose?—but Marie Rose's expression hardened.\n\nMagical power detonated. For the first time, Fenrir staggered, blood streaming from his wounds. The thorns binding Agnus and his death knights disintegrated.\n\n\"Remarkable magic power.\" Grandmaster Zikfrector's voice carried through the chaos, tinged with genuine admiration.\n\nAs Fenrir's scream echoed through the trees, Marie Rose's attention fixed on Mumud.\n\n\"What were you in life?\" Even she sounded impressed.\n\nA genius magician who'd surpassed Braham himself—but death had neutered him. Against Marie Rose, he was nothing. She flicked one finger. Blood coalesced and *detonated*, annihilating Mumud and the death knights in a crimson eruption.\n\nOver.\n\n\"Zikfrector!\" \n\nZibal burst into the forest, spotted the Grandmaster standing amid flames, and panicked—had he provoked Marie Rose? \"Are you oka—?\"\n\nZikfrector opened his mouth to respond.\n\nThen he froze like a statue. His perpetually neutral expression collapsed into dismay and bone-deep exhaustion. Marie Rose and Fenrir—teeth bared in humiliation—mirrored his reaction.\n\nThey were all staring at the book in Agnus' skeletal hand. A book describing the original sin of a god. Written by the one who'd cursed both Shizo Beriache and the Sixth Evil, Zik.\n\n\"*Sloth...*!\"\n\nFenrir and Zikfrector lunged, but too late. Agnus cracked the cover.\n\n\"*Kihahahahat!*\"\n\nMadness rippled outward like a shockwave. Marie Rose, Fenrir, and Zikfrector—who managed to partially resist through sheer disciplined will—collapsed simultaneously.\n\n\"Everything's so annoying... Sleep... *Snore*.\" Fenrir gave up instantly, already unconscious.\n\n\"Baal's preparations run deep...\" Zikfrector drove daggers into both thighs, fighting to keep his eyes open.\n\nMarie Rose shook her head and began casting. \"We'll continue this conversation another time.\"\n\nHer spell completed. She and Fenrir vanished—teleportation so instantaneous it violated magical law. \n\nAgnus' blood-red eyes swiveled toward the remaining Zikfrector. \"*Kik, kikik...* I'll tear off his limbs and watch him die.\"\n\n\"...\"\n\nA declaration that should have been impossible. The Curse of Idleness was terrifying. In ages past, Zik had neglected his allies because he couldn't fight this very curse. During the war against the gods, he'd fallen asleep while his companions died around him.\n\n*Step. Step. Step.*\n\nAgnus advanced slowly on Zikfrector, whose eyes were sliding shut. Bone-creature wielding a blade—a scene from a nightmare. But before he reached his target—\n\n\"Stop.\"\n\nZibal, drenched in sweat, blocked his path. He'd checked on Zikfrector the instant the man collapsed. \"This person can't die now. I don't know what he did to you, but let it go. Just this once.\"\n\nHis gaze held compassion as it fell on Agnus. He knew the necromancer's history. The wound that defined him.\n\n\"*Kuk... Kukuk...*\" Agnus' expression twisted into something grotesque. That look—that *pitying* look—he hated nothing more in the entire world. \"Go die.\"\n\nSteel rang on steel. Agnus was exhausted. Zibal had burned through his magic machine summoning. Two depleted fighters in an empty forest.\n\n\"Agnus! What's the point of this?! We can't actually hurt each other like this!\"\n\n\"Shut up! SHUT UP!\"\n\n\"Shit! Calm down, you crazy bastard!\"\n\n\"*Kyaaaak!*\"\n\n\"*Hiiik!*\"\n\nHonestly? Zibal was terrified. Agnus came at him like a zombie, all wrong angles and inhuman movements. He just wanted the Red Knights to arrive, to finish mopping up outside and rescue him from this—\n\n\"**Tornado.**\"\n\nThe storm hit like a hammer. Not meant to injure—just to force separation. Wind screamed between them, tearing them apart.\n\n\"...?\"\n\nBoth fighters turned toward the spell's source. A blonde girl stepped into view.\n\n\"Stop... Please stop.\" Her expression was heartbreaking.\n\nEuphemina.\n\n\"Why do you keep following me?!\" Agnus' face contorted into something demonic as he shouted—\n\nAn arrow materialized in Euphemina's chest.\n\n\"*Ah...*\"\n\nSomething inside Agnus *snapped*."
}