{
  "id": 1108,
  "title": "Chapter 1107",
  "content": "**Reinhardt, Capital of the Overgeared Kingdom**\n\nLauel's eyes widened as Grid recounted what had transpired in the forest.\n\n\"That was Baal, wasn't it? It had to be Baal.\"\n\nGrid shook his head firmly. \"Impossible. Baal is practically the final boss. It's far too early for him to appear, and besides—that thing wasn't strong enough.\"\n\nHis reasoning was sound. The great demons Belial and Berith had been absolute nightmares to face. Even Grid, let alone other players, had witnessed firsthand how effortlessly they crushed hope. If the entity possessing Agnus had truly been Baal, the absolute monarch of hell, Grid would have felt bone-deep terror.\n\nBut he hadn't been afraid.\n\n\"Think about it logically,\" Grid continued. \"No final boss is going to manifest through a single player. That would shatter game balance completely. The S.A. Group obsesses over balance—they'd never allow one player to borrow that kind of power.\"\n\n\"But you borrow Braham's power all the time.\"\n\n\"Braham isn't the final boss.\"\n\nLauel's lips quirked. \"To most people, Braham and Baal are equally ridiculous.\"\n\n\"It's different.\" Grid's tone left no room for argument. \"That wasn't Baal. It was weaker than the Grandmaster.\"\n\nThis wasn't bravado. The demonic energy radiating from Agnus' possessed body had been inferior to Berith's—honestly, not much better than Belial's. If Zikfrector had been awake, the Grandmaster likely would have forced the demon onto the defensive. Even accounting for the penalties of possessing a player's body, it was far too weak for the 1st Great Demon.\n\nOf course, certain details troubled him. His fighting energy had filled at an alarming rate. The demon had moved with the fluid grace of Shunpo. And it had effortlessly shredded Grid's own demonic energy. These facts suggested a high-ranking great demon.\n\nJust not *that* one.\n\n\"The demon called himself master of hell's throne,\" Lauel pointed out.\n\n\"Hell has thirty-three territories, Lauel. Thirty-three great demons, each ruling their own domain. That means thirty-three thrones.\"\n\n\"Agnus is Baal's Contractor.\"\n\n\"So?\" Grid spread his hands. \"I'm not contracted to Belial or Berith, but I use their power. Why couldn't Agnus borrow power from other demons? Runes, for instance.\"\n\n\"But the demon knew Pagma intimately. Wouldn't Baal know him best, since Pagma was the previous Baal's Contractor?\"\n\n*Pagma.* That was the crux of Lauel's theory. The demon had demonstrated deep knowledge of Pagma, even comparing Grid to his predecessor. It was why Lauel suspected Baal.\n\nGrid countered immediately. \"Pagma single-handedly stopped hell's invasion at the Behen Archipelago. Multiple great demons fought him during that war. Baal isn't the only one who would recognize Pagma's style.\"\n\n\"Hmm.\" Lauel conceded the point. Grid had purified the Behen Archipelago as the Hero King. He'd walked in Asgard and spoken with gods. His understanding of demons and divinity far exceeded Lauel's knowledge. \"Then who do you think possessed Agnus?\"\n\n\"Amoract, maybe?\"\n\n\"Yatan's First Servant? The one Braham mentioned?\"\n\nGrid nodded. \"He's the most likely. And the most willing to interfere.\"\n\n\"Still, if he's running the Yatan Church from the shadows, doesn't that seem like a full-time job? Hard to imagine him as someone who lounges around watching gods and humans for entertainment—\"\n\n\"Then it's someone else.\" Grid waved dismissively. \"Honestly, does it even matter?\"\n\nThe demon had only manifested through items and skills—borrowing Agnus' body as a vessel. Just like the rune-powered demons Grid used, or Braham during Assimilation, the entity's true strength was severely limited. It was simply part of Agnus' arsenal now. Why waste time obsessing over its identity?\n\nGrid was already sick of thinking about Agnus.\n\n\"We have a more pressing problem.\"\n\nHe shared the quest window. The one from the World Tree.\n\n**[Early Death]**  \n**Difficulty: SS**\n\n*The World Tree desires the death of the dark elf, Beniyaru.*\n\n*Assist the World Tree by killing Beniyaru.*\n\n**Quest Clear Conditions:** Beniyaru's death.  \n**Quest Reward:** Slight increase in affinity with the World Tree. Linked quest *'Search'* will activate.  \n**Quest Failure Penalty:** None.\n\n***This quest has already been completed.***\n\n\"...What?\"\n\nEven Lauel looked baffled. The World Tree had existed since the world's beginning, embracing all life like a mother. For it to demand an elf's death made no sense.\n\n\"The World Tree determined that Beniyaru was the source of the encroaching darkness,\" Grid explained. \"Elves are pure, but stubborn to a fault. Their strong wills make corruption nearly impossible. But according to the World Tree, Beniyaru *willingly* assimilated with the darkness after I rescued the elves from Kir.\"\n\n\"And the next quest?\"\n\n*Early Death* had concluded the moment Beniyaru died. Grid pulled up the linked quest.\n\n**[Search]**  \n**Difficulty: S**\n\n*The World Tree has determined that the Beniyaru active in the Gauss Kingdom forest is a fake. The World Tree suspects the ancient species 'rafflesia' is responsible. These creatures have threatened forest visitors and tribes since ancient times, feeding on the darkness within hearts.*\n\n*Locate the rafflesia holding Beniyaru's true body.*\n\n**Quest Clear Conditions:** Find the rafflesia.  \n**Quest Reward:** Slight increase in affinity with the World Tree. Maximum affinity with Beniyaru.  \n**Quest Failure Penalty:** None. Beniyaru's permanent death.\n\n\"Ah.\" Understanding dawned on Lauel's face. \"The World Tree knew all along that Beniyaru was nothing but a fake clone. Its insight is extraordinary.\"\n\n\"Ancient species only inhabit the World Tree's Forest,\" Grid said. \"Of course it knows them better than anyone. Anyway—do we have anyone in Overgeared Two or the Shadows with tracking skills? You know I'm useless at searching. I need support from scouts or assassins.\"\n\nThe quest merely required finding the rafflesia, not fighting them. Despite the S-grade difficulty, it was straightforward. Grid had no reason to refuse this chance to save Beniyaru without excessive risk.\n\nWhy did he want to save her? \n\nBeniyaru was one of the legendary Twelve Te—one of the strongest. Establishing a favorable relationship, possibly even a contract, would be invaluable. Beyond calculations, though, they'd fought side by side. He'd witnessed her grief and rage. The desire to help her had taken root in his chest like a blooming spring flower.\n\nLauel understood perfectly. He smiled. \"Searching the World Tree's Forest isn't easy. Unfortunately, the Overgeared Guild lacks anyone specialized in tracking.\"\n\n\"Shit. Really? No wonder no one came to mind.\"\n\n\"There's only one outsider perfect for this job.\"\n\n\"Outsider?\"\n\nLauel pointed at Grid's chest. \"A man captivated by Your Majesty.\"\n\n\"...What?\"\n\n\"The world's top-ranked explorer—Skunk. He'll help you.\"\n\n---\n\n***Meanwhile, in the Saharan Empire...***\n\n*Since obtaining Kyle, he's grown insufferable.*\n\nResh, the knight serving 2nd Imperial Prince Dulandal, had developed a habit of sighing. Every day felt like walking on a blade's edge. Dulandal had abandoned all pretense of giving up the throne, conducting secret negotiations across the continent.\n\n\"I will liberate the forests of your kingdom.\"\n\nLetters went out to monarchs across the land—promises that with an imperial prince's authority, Dulandal would reclaim forests stolen by the elves. In return, they would need to support him closely in the future. It was groundwork for securing the military force needed to seize the throne.\n\nTransparently obvious—yet surprisingly, every kingdom accepted.\n\nNo, *every single royal family* that received Dulandal's offer agreed immediately and begged for salvation. They desperately wanted their forests back and seethed with resentment at the current power structure.\n\nWhile the Empire and Overgeared Kingdom reaped benefits, other kingdoms were being systematically destroyed. They hated an Empire that favored only the Overgeared Kingdom. They despised an Empire that preached unity with different species while abandoning them to their fate. Some even suspected the rhetoric of unity was deliberately designed to weaken them.\n\nThen came Dulandal's proposal. He shared their grievances with the new Empire. He possessed the power to save them.\n\n*The other kingdoms' position makes sense,* Resh thought grimly. *But Dulandal's ambition is spiraling out of control.*\n\nDulandal still commanded substantial support—more than ever, in fact. Corrupt nobles threatened by Empress Basara's unprecedented willingness to intervene in politics and economics had flocked to the prince's banner. And with Kyle's recent return from the Ruins of the War God, Dulandal's forces now rivaled the imperial dukes themselves. Add support from foreign kingdoms, and he would become a power the Empress could no longer ignore.\n\nThe Empire might tear itself apart.\n\n*Empress Basara must know about this...*\n\nIdeally, Basara would move decisively and crush the conspiracy before it bloomed. Yet inexplicably, she allowed Dulandal to operate freely. Rumors claimed this was at the former Emperor's request—that he'd asked her to protect his children. But what good was honoring the dead if it got her killed?\n\n*No. From the Empress's perspective, Dulandal must be intolerable. Perhaps she's deliberately letting him overreach—gathering justification to break the former Emperor's final wish.*\n\nTime to decide. Should Resh remain loyal to Dulandal, who would inevitably become a traitor, and endure the dangers that came with it? Or should he gamble on the potential rewards if Dulandal's rebellion somehow succeeded?\n\n*Damn it. The penalty for breaking my oath of loyalty is massive. I'm trapped.*\n\nA knight's loyalty was sacred obligation. Those who broke their vows suffered catastrophic consequences. Player knights might be abandoned by their masters, but they couldn't easily betray them first. Resh wrestled with this burden when a notification appeared in his vision.\n\n**[Your master, Dulandal, has issued a command to all knights.]**\n\n**[A quest has been triggered.]**\n\n**[Reclaim the Forests]**  \n**Difficulty: S**\n\n*I can no longer tolerate the illegal occupation of our forests by these filthy different species.*\n\n*The time has come to fight for human peace, rights, and dignity.*\n\n*We shall work alongside the innocent victims to liberate forests across the continent.*\n\n**Quest Clear Condition:** Liberate three forests.  \n**Quest Reward:** Medal of military merit. Linked quest *'Reclaim the Forests II'* will activate.  \n**Quest Failure Penalty:** Dulandal's confidence in you will decrease.\n\n\"Damn it all...\"\n\nHe would wait and observe a little longer. Under the guidance of a senior knight, Resh departed the Empire with a heavy heart."
}