{
  "id": 1109,
  "title": "Chapter 1108",
  "content": "\"This is bullshit.\"\n\nGrid wiped the sweat from his brow—then stopped. The temperature was perfect. The Comet Group's diamond-class capsule regulated his body to an ideal seventy degrees, even with South Korea baking under a brutal heat wave outside. His physical comfort was flawless.\n\nSo why did he feel like his skin was crawling?\n\nHe'd been like this ever since arriving in the Gauss Kingdom. A persistent buzz in his skull. A tightness in his chest that wouldn't ease. Curse words kept slipping out unprompted, and his hands had started shaking whenever he tried to work. Finally, Grid abandoned the half-finished blade on his anvil and stalked out of the smithy.\n\nHe knew exactly what—or rather, *who*—was responsible.\n\n—Hey.\n\nThe whisper function activated. Two hours ago, before meeting with Lauel, Grid had contacted Euphemina first. Just to check on her after the incident. Just to make sure she was all right.\n\n—Still worrying? I told you, I'm fine.\n\nHer voice had been bright. Too bright. The kind of brightness someone forced into their tone to reassure others.\n\n—I didn't lose any items, and the experience loss won't take long to recover. Compared to you, I'm still low level, so the grind isn't that—\n\n—You already said you were fine.\n\nGrid's interruption came out harsher than intended. His voice shook—not with concern, but with something rawer.\n\n—I can't let this go. We need to talk.\n\n—...?\n\n—You said you wanted to get stronger to help me, didn't you?\n\nSilence stretched between them.\n\n—Was that a lie? Or did you just need an excuse to keep chasing after Agnus? To throw your life away for him instead of actually improving?\n\n—Grid...\n\nEuphemina's shock bled through the whisper. Grid never spoke like this. He was the one who always understood, who respected everyone's choices, who kept the peace.\n\n—What is it about him? Are you that fascinated by Agnus?\n\n—It's not like that. I just—\n\n—You can only play the pity card so many times!\n\n—...\n\n—Is he your pet? Some stray you can't help but feed? You've already helped him repeatedly. That bastard helped Irene and Lord, so I tried—*tried*—to understand. I even repaid the favor! And what happened? He *killed* you!\n\n—It wasn't Agnus. It was the entity possessing—\n\n—Don't! Don't make excuses for him again. Every time you get betrayed, you find another reason to forgive him. Why? Is he family? A lover?\n\nGrid's voice rose.\n\n—Or do you *want* to be his lover?\n\n—...\n\nThe silence that followed felt like ice water.\n\n—...!\n\nGrid's anger evaporated in an instant, replaced by horror at his own words. Euphemina was one of his closest allies. One of the people who'd helped him become who he was today. Without her, he wouldn't have secured the water clan's allegiance. The Overgeared Kingdom's foundation owed a debt to her efforts.\n\nSo why had he lashed out like a jealous child?\n\nThe answer settled in his gut, cold and shameful. This wasn't righteous anger. This was possessiveness. He resented that Euphemina cared so deeply about someone else—more than she seemed to care about him. And that petty jealousy had momentarily eclipsed everything he owed her.\n\n*Pathetic.*\n\nBefore Grid could force an apology through his teeth, Euphemina spoke.\n\n—I'm sorry.\n\n—No. No, *I'm* sorry. I shouldn't have—\n\n—It's my fault. I didn't realize how much I was hurting you.\n\nHer voice cracked.\n\n—I got so focused on Agnus because he's broken and desperate, not because I don't care about you. I knew he was your enemy. I knew he'd caused you pain. But you're so strong, so patient... I thought you'd understand my selfishness. I took advantage of your kindness.\n\n—...\n\n—How many times have I disappointed you? How angry have you been, just swallowing it down? I'm sorry. You deserve to be angry. You *should* be angry. I've been thoughtless and selfish.\n\nThe tremor in her voice wasn't anger. It was grief—genuine remorse cutting through her usual composure.\n\n—I never realized how much you were holding back. How much you sacrificed just to keep smiling at me instead of showing how hurt you were.\n\n—...\n\n—Thank you. And I'm sorry.\n\nGrid's throat felt tight.\n\n—Thank you for what?\n\n—For finally being honest with me. For showing me your real feelings instead of hiding them.\n\nHe could hear her faint, sad laugh.\n\n—I think this is the first time I've really felt like your friend. Not just an ally—an actual friend.\n\n—...You've always been my friend. But thank you for hearing me out.\n\n—You know what?\n\n—What?\n\n—When I talk to you, my heart feels warm. You're so supportive and genuine. It makes me happy.\n\n—I don't think so. I just get angry and confused whenever something pisses me off.\n\n—Good. Keep a whip handy. I'll bend over whenever you need to set me straight.\n\n—What the hell? Do I look like some kind of sadist to you?\n\nThe tension broke. Despite everything, Grid found himself smiling. Something heavy and old inside his chest seemed to peel away, leaving him feeling lighter. Sometimes honesty hurt—but it also healed.\n\nTrying to be endlessly patient, to always say the right thing and never express displeasure... that kind of selflessness would eventually crush anyone. Grid filed that lesson away as his mind cleared.\n\nThen he froze.\n\nWith his anger dissipated, a crucial detail resurfaced. He immediately whispered to Lauel.\n\n—Lauel!\n\n—...Kukuku, the demon king answers. Red blood flows through my eardrums to my throat, and—\n\n—Agnus took the dark elf's body.\n\nThe theatrical nonsense stopped.\n\n—...Hmm. Then his target was the dark elf from the start.\n\n—Yes. Why do you think?\n\n—The reason's obvious.\n\nThey'd seen this before during the Stone of Life incident. Agnus had only one true goal driving every action: resurrecting his dead lover.\n\n—He's going to use the dark elf's body as crafting material. To make a doll resembling her.\n\n—Damn it...!\n\nThe dark elf Agnus stole wasn't real—just an illusion, a fake. It couldn't produce the result Agnus wanted. Whatever emerged from that ritual would be something twisted. Something wrong. If the resurrected \"lover\" turned out to be a monster...\n\n*He'll lose his mind completely.*\n\nGrid had witnessed Agnus' madness firsthand. Sometimes the necromancer seemed rational enough to suggest it was all an act. But sanity was a thin veneer over something fundamentally broken. If Agnus snapped and remembered that Grid and Euphemina had been present when he acquired the \"fake,\" he'd absolutely turn his fury on the Overgeared Kingdom.\n\n—Lauel, we need to identify the demon that possessed Agnus. Immediately.\n\n—Wasn't it Amoract?\n\n—I just threw out a name I knew. You're the one with the actual information.\n\n—Ah, yes. I noticed you found talking about Agnus unpleasant, so I didn't press you for details earlier.\n\n—Am I that transparent?\n\n—Not at all. You just get agitated when discussing people you dislike. Like the neighbor's cat that keeps shitting in my garden.\n\n—...What?\n\n—Every time that creature goes for a walk, it leaves a massive pile right in my flowerbed. The smell varies daily, but the volume and intensity are consistently traumatizing. I've tried everything—even doused the area with an entire bottle of perfume. Useless.\n\n—I... see.\n\n—Anyway, the demon possessing Agnus is definitely Baal.\n\n—Huh?\n\n—I consulted Sticks while you were working through your feelings. She's certain it's Baal, not speculation.\n\n—Certain?\n\n—Yes. In Genesis, Baal is the only great demon who can legitimately claim rulership over hell. It's documented fact, not theory.\n\n—...Baal. But he seemed weak when we encountered him.\n\n—The next time you meet, he might be completely different. What descended into Agnus' body was just a fragment—a splinter of Baal's ego.\n\n—A fragment?\n\n—Yes. That wasn't Baal with his power limited. It was literally a *piece* of him. Depending on which fragment descends next time, his personality and abilities could be entirely different.\n\n—...\n\n—Regardless, Agnus is wielding terrifying power now. We may need to help him create the doll correctly—ensure it actually works—so he doesn't go on a rampage.\n\nLauel had already mapped out the strategy to prevent catastrophe. His confidence was reassuring.\n\n—I'll handle it. You focus on your immediate priorities. Your meeting is coming up.\n\nGrid spotted a familiar silhouette approaching in the distance. He nodded.\n\n—Thank you, Lauel.\n\n***\n\nThe empire's most elite forces were common knowledge: the Black Knights and Red Knights stood above all others. But not everything was public information. Of the hundreds of knights in imperial service, ninety-nine percent would rank below the Black Knights. But there were rare exceptions.\n\nPrince Dulandal's personal Black Knights were one such exception.\n\nAn organization forged with staggering resources and effort, they were an elite division Dulandal proudly called his \"royal guard.\" Even within this exceptional unit, the high ranker Resh was just a rank-and-file member.\n\n*The medals come too easily.*\n\nResh and his fellow knights had already swept through seven forests. Each completion of the \"Forest Reclamation\" quest awarded a medal, and he'd already earned three. The missions were almost disappointingly simple. Each forest was defended by maybe ten elves and a few hundred beasts—hardly a threat to the Black Knights.\n\n\"...\"\n\nResh tracked down another elf with his senior knight and watched the creature disintegrate into ash. The medal notification appeared, granting +2 to all stats. He felt nothing. No satisfaction. No pride.\n\nOnly disgust.\n\nThe elves had trusted the empire's declaration of liberation. After centuries of human persecution, they'd finally been promised the right to protect nature. They'd entered these forests believing in that promise—only to be slaughtered without warning or explanation. Betrayed again.\n\nResh had completed enough quests to know the elves' tragic history. Now he felt like a monster. His hands felt filthy with innocent blood.\n\n\"It's a holy war for humanity.\"\n\nA senior knight clapped his shoulder, reading the darkness on Resh's face. The words offered no comfort. This wasn't a holy war. It was a massacre dressed up to satisfy Dulandal's ambition.\n\n*Yes, the elves' methods were heavy-handed. But couldn't we at least talk to them first?*\n\nUnderstanding their motives. Negotiating the forests' return. The elves weren't mindless beasts—their actions clearly carried intent. But the kingdoms whose forests had been occupied refused any dialogue. To them, conversing with a \"lesser species\" after losing territory was humiliating. Unthinkable.\n\n\"...?\"\n\nResh was gulping water, drowning in his bleak thoughts, when he heard something that made him choke.\n\nKyle—one of the Five Pillars, the emperor's most powerful servants—stood nearby. Ever since visiting the Ruins of the War God, lightning had crackled perpetually through his veins. Dulandal had taken to calling him \"the Lightning God.\"\n\n\"This war of attrition is pointless,\" Kyle said, his tone flat. \"The elves are scattered across the continent. Better to strike the World Tree's forest directly while it's undefended.\"\n\n*He can't be serious.*\n\nBefore Resh could process the insanity of that suggestion, a senior knight spoke up—the knight Resh admired most, a man of integrity and loyalty.\n\n\"Sir Kyle, the World Tree's forest is sacred ground. Entering with weapons drawn would be blasphemy against—*Keok!*\"\n\nThe protest ended in a wet gurgle.\n\nResh watched in frozen horror as the senior knight collapsed, throat slit. Kyle held the man's severed head almost casually, lightning coursing through his blood vessels in place of crimson. His eyes glowed with crackling energy. He looked less than human—either a descending god or an ascending demon, depending on your perspective.\n\n\"I didn't realize Prince Dulandal's knights harbored heretics.\"\n\n\"...?\"\n\n\"The empire recognizes only the gods of Asgard—Goddess Rebecca, War God Zeratul. The World Tree?\" Kyle's lip curled. \"What kind of heretic venerates a *tree*?\"\n\nSilence.\n\n\"Prince Dulandal has granted me command authority over this unit. You will follow my orders without question. We march on the World Tree's forest. I know the way.\"\n\nResh understood with terrible clarity: this could not be allowed to continue. If Dulandal claimed the throne with Kyle as his right hand, tyranny would reign unchecked.\n\n*I have to record this. Players need to know what they'd be supporting.*\n\nTears blurred Resh's vision as his fingers activated the recording function."
}