{
  "id": 1112,
  "title": "Chapter 1111",
  "content": "**Chapter: The Power of the Number Two**\n\n'Did Grid learn swordsmanship from Asmophel?'\n\nResh's confusion was understandable. Asmophel's technique—depicting a flower's birth and death—appeared to be the ultimate evolution of the Flower Sword Dance that Grid had demonstrated.\n\nFire Sword Asmophel.\n\nOnce proclaimed as a pillar of the empire alongside the legendary Piaro, Asmophel's reputation preceded him. The bud that bloomed upon Kyle now detonated, and destructive force tore through the forest in a wave of soundless devastation.\n\nFrom within the inferno, Kyle emerged—ragged but unbroken. Blood painted his body, yet his momentum never faltered.\n\nAmelda, Kentrick, and Dante stared in disbelief.\n\n\"What? How is he still standing?\"\n\n\"He... he must have deflected the explosive force with raw power.\"\n\n\"...\"\n\nThe three knights understood the truth behind Asmophel's old weakness. Though his swordsmanship generated devastating wide-area destruction through explosive sword energy, it lacked single-target lethality and devoured the user's stamina. Against Piaro, Asmophel had always fallen short—Piaro possessed the unique ability to dissipate that explosive force entirely.\n\nYet against anyone else, Asmophel had never lost.\n\nIn their memories, he remained 'the man who could never surpass Piaro, but who conquered everyone else.' If Kyle could withstand the sword energy of a great swordsman directly, then he was something beyond human.\n\n*'Piaro-grade...'*\n\nHad the former Emperor Juander—that incompetent fool who cast them all aside—actually chosen correctly when he selected Kyle? The thought filled the three knights with bitter resentment.\n\nKyle closed the distance with Asmophel, his superior form overwhelming what the single-digit knights had once represented. His body became a weapon—no gaps, no wasted motion. A diagonal elbow crashed into Asmophel's shoulder. Asmophel's blade drove toward Kyle's abdomen while Kyle's fist targeted the opposite flank. Kyle raised his knee to intercept the sword thrust and channeled electric current through the elbow crushing Asmophel's shoulder.\n\nElectricity surged through Asmophel's body.\n\nDespite his noble features, Asmophel's face became a canvas of brutality as fists found their mark. His blue cloak, once immaculate, now dragged through the dirt. Kyle seized the fluttering fabric and wrenched Asmophel earthward, slamming him down once, twice, three times! His fists became a storm of violence.\n\n\"Hahaha! HAHAHAHA!\"\n\nIn his frenzy, Kyle recalled the divine message—the moment the war god had chosen him. He had been lesser than the other pillars, broken after losing an arm to a monster, confidence shattered. The great god had granted him the ultimate martial arts.\n\nSeven secret techniques learned while wandering the ruins. The miracle of divinity made manifest. Not only had his arm returned, but the electric currents flowing through his body had evolved—stronger, more responsive, perfectly controlled.\n\n*This* was divine power. Eventually, Kyle would surpass even the Grandmaster. The monster that took his arm would no longer terrify him. Once he mastered the ultimate martial arts, he would ascend to heaven itself.\n\nKyle believed this with religious fervor, and this moment confirmed his faith. Alone, he was dominating the single-digit knights who had led the empire's golden age. The ecstasy was intoxicating.\n\n\"Hah...?\"\n\nHis laughter died mid-swing. Something felt wrong. Despite the relentless pummeling, Asmophel's condition remained... stable. His skull hadn't caved. His nose hadn't even broken.\n\n*'Skin of Transcendence?'*\n\nHad Asmophel achieved transcendence through pure talent? No—impossible. He wasn't capable of that. Kyle's sharp gaze shifted to the blue cloak partially covering Asmophel's face.\n\n*'That cloak...'*\n\nWas it absorbing his attack power? This mere piece of cloth? Kyle ripped the garment away. A blade materialized through the swirling fabric.\n\n\"Don't touch it.\" Asmophel's voice was ice. \"It's a treasure from my king.\"\n\nThe sword pierced Kyle's chest mid-sentence.\n\nAsmophel rose, shoving Kyle's staggering body aside. His blade traced a crescent arc as he hurled his sheath skyward. Kyle, bisected by the attack, released an electric current that intercepted the pursuing sword energy. The sheath hung suspended two meters up, refusing to fall.\n\nShockwaves and magnetism clashed. The sheath danced between them as dozens of collisions spawned blooming energy. Asmophel's sword energy rapidly dwindled.\n\nKyle's turbulent current, however, never weakened. For him, electricity was perpetual motion—it didn't deplete. It was infinite. Asmophel's sword energy bloomed again, obscuring Kyle's vision while sweeping toward his collarbone. The attack glanced off. Asmophel retreated, but Kyle's Force Palm was relentless, crushing into his chest.\n\nThe airborne sheath finally dropped.\n\n\"Koff!\" Asmophel choked back a scream, blood staining his lips. His intestines felt shredded. He understood now—this wasn't the same man who once cowered. Kyle had become everything Juander hoped for and more.\n\nThe number two who forever chased number one no longer existed. Asmophel was no longer number two. He'd wasted years drowning in regret, becoming stagnant.\n\n*'If only I'd met King Grid sooner...'*\n\nNo—if only he'd awakened before Grid found him. If he hadn't fallen for Marie's machinations. If he'd never envied Piaro in the first place.\n\nA life built on regret. His shameful past flickered before him like broken glass.\n\nIn that moment, Asmophel's eyes went dark.\n\nResh paled as Asmophel collapsed. \"Help him!\"\n\n\"...\"\n\n\"You're his comrades!\"\n\nEvery imperial knight knew Asmophel's story—the fallen hero, the jealous traitor who sold out his friends. Empress Basara's revelations had exposed the full truth, yet his reputation remained tarnished.\n\nStill, the knights here had begun to respect him again. That he fought alongside those he'd betrayed meant they'd granted forgiveness. Resh and the Sword Knights understood vaguely the courage required to seek that forgiveness, the sacrifice and suffering endured. They believed Asmophel was truly worthy, deserving this hard-won chance at redemption.\n\nBut now he was dying.\n\n\"Haven't you already forgiven him?\"\n\n\"...\"\n\n\"Then *why*?! Why turn away now?!\" Resh's voice cracked with fury.\n\nHe had no personal connection to Asmophel. By rights, watching him fall should mean nothing. Yet he couldn't stomach Mercedes and the former single-digit knights simply standing idle.\n\nHis eyes found Mercedes. \"No matter how much you resent him...! A knight doesn't abandon their own!\"\n\nMercedes—the only knight trusted by an emperor who trusted no knights, sent to the Overgeared Kingdom after achieving legendary status. Resh admired her, which made witnessing this cowardice unbearable.\n\nMercedes, silent until now, finally spoke.\n\nA dazzling smile crossed her face. \"You don't understand.\"\n\nThe three knights continued as if they'd been waiting.\n\n\"You think the deputy chief would fall so easily?\"\n\n\"He's the most cunning bastard we've ever known. That's why he could betray us.\"\n\n\"If anyone's going to kill the deputy chief... it'll be us.\"\n\n\"...?!\"\n\nResh's confusion shattered as his eyes widened. Asmophel—who'd absorbed Kyle's assault—rolled across the dirt and lost his sword.\n\nFor a knight to lose his blade meant death.\n\n\"This is the end!\"\n\nKyle gathered his current, channeling it to his fingertips to deliver the killing blow. He groaned before releasing it. Asmophel had thrown his sheath straight at Kyle's eyes.\n\n\"Gah! You coward!\"\n\nHad Asmophel played the desperate dog just to reclaim the sheath he'd discarded? Losing his sword to lower Kyle's guard so he could grab it? Constantly exposing his belt during battle for this exact moment?\n\nWhat a despicable tactic.\n\nKyle, blinded, staggered back.\n\n\"You expected honor from trash like me?\" Asmophel's voice was hollow, stripped of emotion.\n\nAll feeling had drained when the light left his eyes. He'd abandoned morality just as he had the day he betrayed Piaro and the others. The difference? Today, he fought for Grid, not himself.\n\n\"My king commanded me to return alive. Therefore, I cannot die yet.\"\n\nTruth be told, he wanted death. Shame, guilt, and agony consumed him. Meeting his former comrades' eyes made him want to bite through his own tongue. But Grid's words echoed still. *Don't die.* So Asmophel endured. He would live. He would win.\n\n**[Your knight Asmophel has exhibited the unique characteristic 'Power of the Number Two!']**\n\n\"...Asmophel?\"\n\nGrid had just entered the World Tree's Forest when the notification appeared.\n\n---\n\nFar from Grid, Asmophel addressed Kyle once more. \"Will you withdraw? The empire and Overgeared Kingdom are allies now. There's no need to fight to the death.\"\n\n\"Ridiculous. You obstructed me and stained my honor. Worse, you're weaker than me. By the providence of strength, you should die.\"\n\n\"I see. Then I apologize. Since you're stronger, subduing you without killing you will be... difficult.\"\n\nIn his prime, Asmophel had never lost to anyone except Piaro. His 'standard' had always been Piaro. He might be weaker than number one, but if he could match even half of Piaro's skill against an opponent, victory was assured.\n\n**[Your knight 'Asmophel' is thinking of the back of his number one goal.]**\n\n\"Free Farming Altered Style.\"\n\nA colossal shadow consumed the area. A pillar as thick as the World Tree's branches descended from the heavens—not sword energy, but concentrated suppression energy given form.\n\n\"W-What is this?!\"\n\nThe shadow swallowed Kyle whole."
}