{
  "id": 1113,
  "title": "Chapter 1112",
  "content": "\"I will kill you because you are stronger than me.\"\n\nThe words hung in the air—absurd, backwards, wrong. Asmophel's declaration inverted the natural order of things. Strength dictated who lived and who died. For the weak to speak of killing the strong wasn't just foolish—it was heresy.\n\n*This man dares deny the hierarchy of power itself. He blasphemes against the war god.*\n\nKyle's fanaticism had taken root the moment he'd glimpsed the war god's ultimate technique. That single revelation had transformed him. Dignity, law, civilization—all of it was built on a foundation of strength. He'd been raised on this philosophy, and it was the only truth he recognized.\n\n*I'll teach you the natural order. You'll learn it as you die.*\n\nKyle ground his teeth together. No surprises awaited him here. He knew what Asmophel's 'Fire Sword' title meant. He'd seen the Flower technique in action.\n\n*Just watch carefully. That's all it takes.*\n\nMost observers missed the nuance of Asmophel's swordsmanship. Yes, power erupted when the technique bloomed fully—but it also manifested in the sparking moments before. Kyle needed to stay alert, but with proper focus, Asmophel couldn't bridge the gap between their abilities.\n\nHis vision was already clearing from the sheath strike. Electricity coursed through him, becoming blood, flesh, bone. The regeneration technique worked its miracle, just as it had when he'd regrown his severed arm years ago. Another gift from the war god.\n\n*The stamina cost is enormous. It's classified among the higher secret techniques for a reason.*\n\nNothing could threaten him now. No openings existed in his defense—\n\n\"Free Farming.\"\n\n\"...?\" Kyle's eyes snapped fully clear. He stared at Asmophel, certain he'd misheard. Supreme Swordsmanship—the ancestral art of Piaro's bloodline, the signature of the legendary swordsman himself. Asmophel couldn't possibly wield it.\n\n*No. I must have heard wrong.*\n\nThe momentary confusion threw him off balance. Perhaps the name had been different, only similar in pronunciation to Supreme Swordsmanship.\n\nBut his rationalization crumbled in the next instant.\n\n\"Altered Style.\"\n\nAsmophel had done it. He'd reproduced the power of the number one.\n\n\"What is this?\"\n\nThe electrical web Kyle had spread throughout the forest—insurance against Mercedes' interference—suddenly thrummed with warning. Every strand vibrated in unison, screaming danger.\n\n\"...!?\" Kyle jerked his head skyward, finally noticing the darkness blanketing the forest. His breath caught.\n\nA colossal pillar was falling from above.\n\n*A tree trunk?*\n\nBut no natural tree had ever grown to such monstrous proportions. The descending mass bristled with thousands of thorns, each one sharp and long enough to impale a man with casual contact.\n\n\"Clever parlor trick!\"\n\nThe Power of the Number Two—Asmophel's unique trait, born from his obsessive drive to surpass Piaro—was something Kyle had never encountered. He'd assumed Asmophel was mimicking Supreme Swordsmanship, but this was something else entirely. Something that merely *sounded* similar enough to be mistaken for the real thing.\n\nFury ignited in Kyle's chest. He unleashed a technique he'd previously reserved for offense and propulsion alone. His body dissolved into pure current.\n\nThe pillar crashed down a heartbeat later. It swallowed the space where Kyle had stood, obliterating a twenty-meter radius of forest.\n\n\"Uh... what?\"\n\n\"...\"\n\nMercedes alone remained composed, her Keen Insight having tracked every detail of Asmophel's technique. The others stood frozen in shock. They'd known Asmophel was powerful, but this—calling down a disaster to crush a single opponent—exceeded their understanding. The Sword Knights and former single-digit knights stared at the devastation, speechless.\n\nEven Resh felt his assumptions shatter.\n\n*Is he a farmer too?*\n\nFree Farming—the technique Piaro had unleashed against Great Demon Belial—was one of the most-viewed videos in Satisfy's history. Resh had never imagined anyone else could use it.\n\n*Is the Overgeared Kingdom secretly training farmers? Did the single-digit knights join because they wanted to learn agriculture?*\n\nHis thoughts spiraled down increasingly absurd paths until—\n\n\"Hah... hah... grab the elves. Run.\" Asmophel's ragged voice cut through the silence. \"I didn't... kill him.\"\n\nLightning lanced through the stillness, slamming into Asmophel's chest. Then again. And again. The repeated strikes shredded his body, reducing him to a broken puppet that collapsed like severed strings.\n\nThe bombardment ceased. White light coalesced where Asmophel lay, gradually resolving into human form. Kyle's hand seized Asmophel's golden hair with vicious force.\n\n\"You've humiliated me at every turn. Weak. *Weak!*\" Kyle's voice cracked with rage.\n\nHis body, forcibly expelled from its electrical state, was catastrophically damaged. Nearly half-crushed. The result blindsided him. In current form, he shed physical vulnerability and gained massive elemental resistance. By every calculation, the pillar should have passed through him harmlessly.\n\nInstead, that concentrated energy—superior even to sword energy—had inflicted grievous wounds despite his transformed state. Of course it had. Asmophel had recreated Piaro's suppression energy, power drawn from nature itself. No mortal body could fully withstand the force that had torn apart a great demon.\n\n\"*Raaaagh!*\" Kyle's roar echoed through the ruined forest. He'd nearly died to someone weaker than him. He'd violated the fundamental law of strength. The war god would be disappointed. The ultimate technique might forever remain beyond his reach.\n\n\"You...! *You!*\" Anxiety and fury stripped away his reason. He raised a spear of crackling electricity toward Asmophel's throat—\n\nMercedes intercepted him. Her shield, wrapped in sword energy, deflected the electric spear. Her other hand caught him under the jaw with brutal precision. A spinning kick followed, driving into his back.\n\n\"...\"\n\nKyle tumbled like a rag doll, chin to spine, bouncing across the forest floor. The watching crowd struggled to process what they'd witnessed. Could the man who'd defeated three single-digit knights and Asmophel really be handled so easily?\n\n*No,* the Sword Knights realized. *That can't be right.*\n\nEven Resh, who wanted Kyle dead, thought: *He's injured and off-balance. His guard's down temporarily.*\n\nTheir assessment proved correct.\n\n\"*Gkk*...! Damn it! Like she's—like she's nothing—!\" Kyle forced himself upright.\n\nHis eyes were bloodshot as he transformed his left arm into electrical current and swung it like a whip. It happened faster than thought. To Resh and the Sword Knights, it appeared as though 'lightning struck Mercedes' head.' Yet Mercedes simply raised her shield and deflected it.\n\n\"Impossible!\"\n\nEach crack of the whip generated multiple lightning bolts. Dozens, then scores of electrical strikes converged on Mercedes' position, overwhelming her defense through sheer volume.\n\nAnd still...\n\n\"...\"\n\nMercedes stood untouched. Not a single scratch marred her skin. Even her white hair remained perfectly arranged, as though static electricity itself feared to approach. Kyle's mind reeled. Her speed and technique rendered all close combat futile. His electrical attacks broke against a simple shield—not even reinforced metal.\n\n*Even if sword energy negates the current, residual charge should remain.*\n\nBasic physics. The residual energy should seep through the shield into her armor, delivering at least some shock. How was she completely nullifying every attack?\n\nAs Kyle flailed for understanding, continuing his electrical assault more from desperation than strategy, his vision began to blur.\n\n\"Ah...\" He looked down at himself. Crushed ribs. His back torn open, exposing spine. White bone gleaming below his left shoulder. Death should have claimed him already. Instinct had redirected most of his current into healing, weakening his offensive power. And against an opponent with Keen Insight, that meant every vulnerable point had been ruthlessly exploited without his awareness.\n\n*I can't win.*\n\nThe calculation was simple and devastating. He'd never anticipated Asmophel inflicting such catastrophic damage.\n\nStagger. One step back.\n\nStagger. Two steps.\n\nKyle retreated from Mercedes, his tactical mind racing despite the pain.\n\n*The 12 Te should be responding by now.*\n\nThe elite elves were notoriously reluctant to leave their posts. Only truly exceptional circumstances could motivate them. But with the World Tree's Forest this badly damaged...\n\n*I need to leave. Now.*\n\nIt wasn't too late. If the Sword Knights covered his escape, he could evade Mercedes' pursuit. But if the 12 Te surrounded him before he escaped, even his Origin True Energy wouldn't save him.\n\n\"Retreat,\" Kyle commanded. \"Buy me time.\"\n\n\"...No.\" The Sword Knights' refusal was unanimous.\n\n\"...??\" Kyle's exhaustion gave way to shock. \"I am Prince Dulandal's agent! *I* am your commander here! You dare refuse a direct order? You call yourselves knights?\"\n\nDesperation made him ugly. The Sword Knights shifted uncomfortably—but it was Resh who stepped forward.\n\n\"We already violated the chivalric code once. Under your orders. Breaking it again isn't difficult.\"\n\n\"This isn't about chivalry—this is *treason!* Do you think Dulandal will let you live?\"\n\n\"I'll probably die if I fight here. If death is inevitable either way, I choose to avoid meaningless killing.\"\n\nResh and the other knights surveyed their surroundings. Elves with drawn bows had surrounded them the moment Mercedes' group arrived. Survival was already off the table.\n\n\"Pathetic... I'll tear you apart and—\"\n\nKyle wouldn't die here. Without the knights as shields, he'd take additional damage during his escape, but he'd make it. He gathered his Origin True Energy, and the electrical field around him surged to unprecedented intensity.\n\nGray-robed figures dropped from the canopy around him. One wore a blindfold over his eyes.\n\n\"Kyle. We received a divine message. We've come to extract you.\"\n\nThe war god's followers, operating on the West Continent. They prepared to execute the Light Footwork Technique and spirit Kyle away.\n\n\"None of you are leaving.\" Mercedes blocked their path with a white, translucent blade.\n\n\"...!?\"\n\nA tiger's roar shook the forest. Arrows fell like rain. Bushes erupted to obscure vision. Thorns and uneven ground appeared where smooth paths had been moments before. The war god's followers, who'd been confidently navigating the obstacles, suddenly lost their balance and tumbled to the forest floor."
}