{
  "id": 1114,
  "title": "Chapter 1113",
  "content": "\"Ah...\"\n\nGasps rippled through the forest as the World Crushing Sword of the Noble White Tiger materialized in Mercedes' hand. The blade gleamed white and translucent—pale as Mercedes' own skin—while its crown-shaped knuckle guard could have graced a museum, a masterwork symbolizing power and prestige. The sword belonged on a palace wall.\n\nBut the White Tiger Sword was no ornament.\n\nEvery element of its design existed for one purpose: slaughter. In Mercedes' hands, flowing with her relentless footwork, it achieved an ideal state of lethality.\n\n\"...?!\"\n\nThe sword roared. The earth bucked. The forest itself surged upward—arrows rained from above, bushes erupted to blind them, thorns jutted like daggers, and uneven stones rolled underfoot. The War God Followers, who moments ago had been casually dismantling every obstacle, lost their footing and tumbled.\n\nAll except one.\n\nA blindfolded man twisted in midair, his restrained hands somehow maintaining perfect balance.\n\nMercedes tracked the swirling dust overhead. The White Tiger Sword met the follower's restraints with a thunderous *crack*. The earth shuddered. A violent gale tore through the surrounding brush. It looked like the wrath of heaven itself had descended upon the world.\n\n*'Is this the strength of a legend?'*\n\nResh and the Sword Knights stared, awestruck. Even Kyle—who until now had believed himself supreme—suddenly understood the depth of the well he'd been trapped in. Mercedes stood above him. They all struggled to analyze her movements, to grasp the intent behind each strike. Understanding would mean rapid growth.\n\nMercedes wasn't as fast as Kyle. But she was clearly beyond human. She moved at speeds Resh's eyes should track—and indeed, he *could* see her movements. Each technique flowed with such elegance it seemed obvious.\n\nExcept this was only one pattern out of a hundred.\n\n\"Hup...?\"\n\nAfter Mercedes' assault, the follower with steel plates binding his hands let out a soft groan. Her attacks followed honest trajectories—easy enough to read. Yet the follower's confusion was written across his face. Mercedes' swordsmanship was like the World Tree itself: massive trunks growing straight and true, then exploding into hundreds of branching paths at the crown. The apparent simplicity was a trap.\n\nThe follower's body hurtled backward, smashing through a tree five meters thick. Then another behind it. He finally stopped after piercing through four more. The knights clearly saw blood spray from his lips.\n\nYet the follower returned instantly, his kick aimed at Mercedes' head.\n\nMercedes—on the verge of breaking through Kyle's guards to cut his throat—was forced to retreat. The follower who'd returned with impossible speed spoke for the first time: \"I see. You are the strongest on this continent.\"\n\nA statement, not a question.\n\n\"No. There is someone stronger than me.\" Mercedes' denial carried weight. The West Continent was vast.\n\nThe follower's mouth curved upward. \"Indeed... So the divine message was no lie.\"\n\n\"...\"\n\nThe battle paused.\n\nThe followers analyzed the 'sword'—the ever-shifting techniques that excelled at both offense and defense, that made the very earth tremble. Meanwhile, Mercedes remained wary, having noted these were 'followers of the War God.'\n\n*'They're similar in many ways to the followers in Galgunos Temple. Based on their techniques, they must serve the War God as well.'*\n\nKyle's proclamations about the providence of power, his claims that people came to aid him through divine messages—it all pointed to a 99.9% certainty. Still, one critical difference stood out.\n\n*'The temple followers had no reason.'*\n\nThe War God Followers in Galgunos Temple had distinct limitations, but not from learning too few secret techniques. Their lack of reason meant they followed only instinct. The temple followers were obsessed with secret techniques alone and weak in everything requiring thought—applying techniques dynamically, reading opponents' emotions, creating variables through psychological warfare.\n\nBut these followers possessed reason. They'd clearly mastered even more secret techniques than their temple counterparts.\n\n*'They won't go down easily.'*\n\nEspecially the blindfolded follower wearing restraints—he was stronger than Kyle despite being unable to fully use his hands or eyes. The other followers who'd endured the White Tiger's Cry couldn't be underestimated either. Their initial carelessness had vanished, replaced by attitudes and physical abilities approaching Amelda's level.\n\n*'This could be dangerous.'*\n\nMercedes' alarm wasn't solely due to their strength. This location itself posed risks. She'd experienced the World Tree's Forest firsthand. A domain filled with ancient species... Somewhere in these woods lurked an enemy that had forced her to consume her Origin True Energy.\n\n*'Carelessness here means death...'* Mercedes shifted into a particular stance. *'I have to end this quickly.'*\n\nKyle—who supported Dulandal—and his follower allies posed a clear threat to His Majesty. Mercedes understood her role with crystal clarity. She would handle Kyle and all the followers. For her liege. Her life was a small price.\n\n\"Amelda, leave with the others and Asmophel.\"\n\nMercedes extended her left arm and pivoted. The White Tiger Sword sang in her right hand, hammering toward the blindfolded follower. He blocked it, then registered her left hand streaking toward his neck and jerked downward.\n\nHis leg snapped backward in a crane kick aimed at Mercedes' throat. The White Tiger Sword's weight suddenly intensified against his restraints, collapsing his posture. Two stone pillars erupted from the ground, slamming into his shoulders.\n\n*'This...?'* The follower wavered slightly. *'The spirit of the White Tiger dwelling within the blade?'*\n\nWeapons forged with a sacred creature's breath were rare even in the East Continent. How common were they here?\n\nThe fierce exchange continued. Mercedes gave him no time to think. This follower wouldn't fall easily. The blindfold served to heighten his other senses. He adapted quickly to Mercedes' techniques and accounted for the White Tiger Sword's variables.\n\nTheir strikes clashed, shockwaves rippling outward. The blast swept over both combatants.\n\nThe follower retreated one step and called out, \"My name is Lee Jeong! I once worshipped the expelled gods, but now I am one of the Triad who serve War God Zeratul!\"\n\nLike him, Mercedes stepped back, wiping blood from her mouth. \"I am Mercedes. I serve King Grid.\"\n\nLee Jeong's restraints and Mercedes' White Tiger Sword collided repeatedly, then locked. Close enough to feel each other's breath, they continued speaking.\n\n\"The War God values those with abilities like yours. You've seen his foundation. You've witnessed the ultimate technique he offers. Why serve a human instead of a god? Is it knightly pride?\"\n\n\"The ultimate item surpasses the ultimate technique.\"\n\n\"Item?\"\n\n\"I already wield my liege's power. He possesses a status approaching godhood.\"\n\n\"A god-like status?\" Lee Jeong laughed sharply. \"What a ridiculous claim!\"\n\n\"It's no claim. King Grid will transcend the god you serve.\"\n\n\"Your arrogance borders on insanity!\"\n\n\"Isn't your god the height of arrogance? The ultimate technique? Would a farmer dare call himself ultimate after glimpsing only his own fields?\"\n\n\"You truly are mad.\"\n\nLee Jeong refused further conversation. Though blindfolded as part of his training, he could sense the truth. Mercedes—this knight who matched him blow for blow—possessed exceptional insight. A true warrior who believed she should perfect herself without divine aid to reach the pinnacle.\n\n*'You're still young. Narrow-minded.'*\n\nA human couldn't surpass a god. He'd experienced this truth. Tasted its bitter inevitability.\n\nThat's why he'd chosen to follow the War God instead.\n\n\"Black Death Light.\"\n\n──!\n\n*'A rare talent...'*\n\nIf he showed Mercedes the War God's greatness, could she become an ally? Lee Jeong harbored this hope as he activated his skill, and Mercedes' vision plunged into darkness. In a world drained of light, Lee Jeong's fist drove toward her solar plexus.\n\nOr it should have.\n\n\"...?!\" Lee Jeong jerked his fist back and leaped away, horrified. Too late. A brilliant sword light severed one ankle.\n\nLee Jeong's voice shook. \"Keen Insight...! You possess Keen Insight?\"\n\nHe'd covered his eyes to develop a mind's eye. Yet here stood someone who'd achieved something *beyond* the mind's eye. Agitated, Lee Jeong shouted, \"Melsede! You deserve to master the ultimate technique! You shouldn't waste yourself serving a human! Join us...!\"\n\n\"My name is Mercedes.\"\n\n\"I know! My pronunciation is poor! Don't—don't change the subject!\"\n\n\"And—\"\n\n\"...?\"\n\nFrom beginning to end, Mercedes' expression had remained unchanged—not when facing Kyle's grandeur, nor when Asmophel demonstrated Piaro's power, nor when the War God Followers intervened, nor even when she prepared to die. But now, for the first time, her face transformed.\n\nAnger.\n\n\"Don't insult my liege.\"\n\n[Legendary Knight Mercedes has created a new chivalric code.]\n\n\"My liege far surpasses the gods you serve. In the end, it comes down to being overgeared.\"\n\n\"...?\"\n\n\"The ultimate weapon beats ultimate martial arts.\"\n\nIn the end...\n\n\"Everything is equal beneath superior items.\"\n\n[Your knight Mercedes can equip all item types without restrictions and will enhance the performance of all equipped items by 15%.]\n\n\"Stop trying to recruit me.\"\n\n\"...\"\n\nWhat? What kind of twisted logic—? Lee Jeong stood speechless. Only now did he grasp what 'overgeared' truly meant.\n\nMeanwhile, among the followers, Kyle was recovering. Believing this was the only way to erase today's humiliation, he consumed an Origin True Energy.\n\n*'Don't underestimate the providence of strength.'*\n\nThe elves—weak yet arrogant...\n\nThe knights—shouting about pride they didn't possess...\n\nAsmophel—who'd humiliated him...\n\nThe haughty Mercedes...\n\nKyle despised them all.\n\n\"You'll all die here!!\"\n\nKyle surged to his feet and unleashed an electrical torrent at full power, sweeping everyone within range. The elves and knights were torn apart. The single-digit knights supporting Asmophel sensed mortal danger. Even Mercedes struggled to endure despite wrapping her shield in sword energy.\n\nResh was already dying. *'Damn it...'*\n\nPlayers came in all types. Most wanted easy, comfortable, enjoyable gaming. Would anyone understand his intentions? He was dying and would be forcibly logged out soon. Resh, who'd been recording, converted his video to a live broadcast.\n\nHis linked YouXube channel activated. The gray landscape before his fading vision spread across the world in real time. Viewers would flood in. Someone would come to this forest and broadcast what happened next.\n\n*'Let them warn the world about Dulandal and Kyle's threat.'*\n\nThe moment Resh began this prayer, Mercedes charged forward. Kyle's followers pressed her from all sides. Even Mercedes couldn't handle them all. Her white hair and pale skin gradually stained crimson with blood.\n\n*'No... She can't...'*\n\nMercedes had saved him. A legendary knight. Grid's knight. He couldn't let her die. He had to come back and help—even if he couldn't actually help.\n\n*'Log out...'*\n\nThen, just as Resh tried to voluntarily surrender against the forced logout timer—\n\nLightning struck.\n\nIt rendered Kyle's electrical current meaningless. The true power of the Lightning God pierced Kyle—who'd just recovered—and made him double over, retching.\n\nThe supreme...\n\nThe black-haired man who'd shattered player limitations and ascended to transcendence had finally appeared before Resh's eyes."
}