{
  "id": 1115,
  "title": "Chapter 1114",
  "content": "Kyle had been born a monster—a mutant whose body crackled with lethal voltage, shocking anyone who dared come close. No one had loved him. Not even his parents, who couldn't bring themselves to touch their own child.\n\nOnly Emperor Juander had wanted him.\n\nKyle still remembered the relief that lit his parents' faces as they handed him over—the brightness in their eyes as they finally rid themselves of their burden. Reviled from birth, Kyle buried his sorrow and loneliness deep. He threw himself into training, desperate for acknowledgment from the master the Emperor assigned him.\n\nWhen that master abandoned him too, Kyle's self-worth shattered. But he clawed his way back up. Alone, he learned to control the electricity raging through his veins. Once he succeeded, he dedicated himself to proving his value to Emperor Juander.\n\nThen the Undefeated King's descendant severed his arm.\n\nThe loss brought crushing fear and frustration—but Kyle refused to break. He overcame it. And when he met the war god at the Ruins of the Red Sea, when he gained power through that trial by fire, Kyle felt vindicated. He believed becoming stronger was the only way to prove he deserved to exist. He conquered his fear of the Undefeated King's descendant.\n\nHe returned to the empire victorious.\n\nThe Emperor was dead.\n\nThat moment of solitude—the one Kyle thought he'd conquered years ago—came crashing back. Now only one thing sustained him: power. All he had left was the pride of the strong.\n\nAnd now even that was crumbling.\n\nHe'd lost here. To *these people*. Unknown soldiers had rescued him like some helpless victim. If he died now, it would all be meaningless. His entire existence would amount to nothing—proof that his parents had been right to throw him away.\n\n\"All of you will die!!\"\n\nHe had to overcome this. Had to move forward. Kyle consumed his Origin True Energy, feeling it burn through him as he unleashed every volt of electricity in his body at once.\n\nThunder cracked across the forest.\n\nLightning fell like rain, striking earth and tree alike in a cascade of electrical fury. Kyle stood at the center, the source of dozens of bolts—a living storm given human form.\n\nFor a moment, he looked like a god.\n\nEvery warrior present froze, overwhelmed by the display of raw power.\n\n*'Impressive talent,'* Lee Jeong thought, even as he braced against the onslaught. *'No wonder the war god favors him.'*\n\nKyle was still immature, but given time, he might one day stand equal to the Triad itself...\n\nLee Jeong was considering this when an unusually loud thunderclap split the air.\n\nThe others didn't notice—but Lee Jeong, who had long since reached transcendence, sensed danger.\n\n\"...!?\"\n\nHe whipped his head toward the sound.\n\nAn incandescent figure dropped from above and seized Kyle by the throat.\n\nImpossible. The storm of electricity should have made physical contact impossible, yet this man had torn straight through it and dragged Kyle from the eye of his own tempest.\n\n\"K-Keok!\"\n\nKyle thrashed, vision swimming. When had he been struck? The scattered currents reformed into spears, dozens of them piercing the unidentified attacker. But Kyle still couldn't breathe. The hand around his throat didn't loosen.\n\n*'He's unharmed?'*\n\nNo time to understand. Had to survive first. Kyle transformed his body into pure electricity, intending to slip free—\n\n\"...!!!\"\n\nThe moment he shifted, agony ripped through him. Every volt of his being *burned*. He forcibly reverted, gasping.\n\nDifferent voltages. That was the problem.\n\nKyle's electricity came from his innate constitution, enhanced by the blue dragon's favor he'd earned on the East Continent. But it was still generated through the medium of a human body—the blue dragon had merely amplified his natural strength.\n\nThis man, however, had processed and absorbed the Blue Dragon's Breath itself through the Arrogant Blue Dragon's Boots. Where Kyle generated ten thousand or even a hundred thousand volts, this monster channeled the blue dragon's own power—one million, ten million volts.\n\nLike comparing a spark to a lightning bolt.\n\nAgainst the Blue Dragon's Boots, Kyle's electricity was meaningless.\n\nA heavy, cold voice entered his ears: \"It has been a while.\"\n\nKyle's eyes widened in recognition. He bit down hard on his tongue. His body went limp. Warmth spread down his leg.\n\nThe god-like figure he'd been moments ago vanished. Kyle trembled. His newly regrown left arm erupted in phantom pain.\n\n\"...\"\n\nGrid assessed the situation. Could he handle all the war god's followers plus this one with half his health remaining? The Lightning God state had a time limit, and—\n\n[The target has completely lost his will to fight.]\n\n*'As expected.'*\n\nKyle had been crushed by Braham—who'd borrowed Grid's body—during their last encounter. He equated Grid with that overwhelming force and still carried the trauma. No resistance. Couldn't even meet Grid's eyes.\n\n\"I'll deal with you later.\"\n\nNo point wasting time on a broken opponent. Named NPCs were notoriously difficult to kill anyway. Grid released Kyle and turned toward the silent, blindfolded follower restrained in iron.\n\nAfter scanning the scene, Grid grasped the situation—and fury ignited in his chest. Most of Mercedes' wounds were bruises. Someone had *beaten* her.\n\n\"You dared harm my knight.\"\n\n\"...!\" Lee Jeong's eyes widened beneath the blindfold. The man who'd crushed Kyle with such overwhelming force was Mercedes' master?\n\n*'So that's why she worships him like a god.'*\n\nHis skin prickled with numbness. The power of the blue dragon. But why? Why did he witness power he'd only seen while serving the expelled gods, here of all places?\n\n\"...I see.\" Lee Jeong formed a hypothesis. \"You're allied with the expelled gods?\"\n\n\"...?\"\n\n\"Ridiculous. They aren't humanity's saviors.\"\n\nThe expelled gods...\n\nThe beings Grandmaster Zikfrector had mentioned were surfacing here? Grid moved instantly. He couldn't miss this chance for crucial information. The Lightning God state only lasted while he maintained maximum speed, and he'd already reached it—fast enough to threaten even perfect transcendence.\n\nBehind him, Kyle desperately gathered his currents. Thunder crashed through the forest again.\n\nLee Jeong allowed nine strikes through his defense as Grid completed his sword dance.\n\n\"Transcended Link Flower!\"\n\n*'This swordsmanship—'*\n\nWas this man truly allied with the expelled gods?\n\nThe forest fell quiet.\n\nDozens of energy blades descended toward the iron restraints binding Lee Jeong's hands. Grid didn't target the restraints directly—but Lee Jeong raised them as a shield anyway.\n\nDefense proved pointless.\n\nThunder boomed again.\n\nLee Jeong's body convulsed as lightning coursed through him. Yet impossibly, he counterattacked. His kick struck Grid's temple—transcendent willpower overcoming status effects, transcendent senses overcoming speed.\n\nOne problem: damage without effect was meaningless.\n\nLee Jeong's kick connected cleanly, but Grid took no damage. The foot passed straight through him as if through mist.\n\n*'Different,'*\n\nLee Jeong realized. *'This is a true lightning god.'*\n\nPinnacle Kill hammered into him before the thought finished.\n\nLee Jeong bled but tried to escape—only to find Grid already blocking his path.\n\n\"Magnificent!\" Lee Jeong felt genuine admiration as he evaded Grid's follow-up. He counterattacked again. Again, his strikes phased uselessly through lightning.\n\n\"Transcended Link Kill Pinnacle.\"\n\nAll Grid's magic and sword energy converged as four sword dances sublimated into one devastating finisher.\n\nLee Jeong's instincts screamed danger. *'I have to remove these restraints—!'*\n\nWrong judgment. He wasn't the only experienced fighter here. Lee Jeong realized too late, cursing the training weights he wore.\n\n[The duration of Blackening is over.]\n\nGrid's speed dropped dramatically.\n\n[Lightning God has been turned off.]\n\nThe white radiance wreathing Grid's body vanished.\n\nBut Grid wasn't concerned. He'd calculated the skill duration precisely. He'd already seized control of Lee Jeong and completed Transcended Link Pinnacle Kill. The attack would land. Victory was decided.\n\nGrid swung the Enlightenment Sword with calm certainty.\n\n\"Black Death Light!\"\n\nLee Jeong hadn't fought Mercedes to a standstill while restrained for nothing. Without Lightning God, Grid couldn't handle him alone.\n\n\"...?!\"\n\nGrid's vision plunged into darkness. His body staggered in confusion.\n\n*Flash!*\n\nA blade pierced through the black.\n\n[You have suffered 145,900 damage!]\n\n[The First King title effect is activated.]\n\n[A protective shield containing the health that was lost in the last minute has been created. While the shield persists, terrain adaptability will increase by 100%, movement speed and defense by 10%.]\n\n[Tiramet's Power belonging to the Rune of Darkness is activated.]\n\n[Your health has dropped below 10%. Restoring 30% health instantly.]\n\n\"Kugh...!\"\n\nWorst case scenario. Blinded, Transcended Link Pinnacle Kill canceled mid-execution.\n\n*'Took too long to get here.'*\n\nHe'd arrived via Mass Teleport, then witnessed the distant explosion when Asmophel triggered the Power of the Number Two. He'd been running ever since. But the forest was vast—he'd feared he wouldn't make it in time. Then Mercedes established her new chivalric code, another explosion erupted, and Grid had activated Blackening out of desperation.\n\nHe'd used the transformation because summoning his knights without knowing the exact situation was too risky.\n\nThis was the result. Defeat?\n\n\"You survived Black Death Light unharmed?\"\n\nNo.\n\nAsmophel and Mercedes had recovered exactly as Grid hoped—he'd bought them enough time.\n\n\"Your Majesty!\"\n\nGrid steadied himself as two figures appeared at his flanks. Red-hot Asmophel and ice-cold Mercedes formed a perfect contrast. Grid moved with them as one.\n\n\"Tell me about the expelled gods!\"\n\n\"K-Kuaaaack!\"\n\nThree master swordsmen flowed like water, their blades crashing toward Lee Jeong in a coordinated assault."
}