{
  "id": 1116,
  "title": "Chapter 1115",
  "content": "# Chapter: The Truth of the Expelled Gods\n\n*\"The Seven Malignant Saints failed because they didn't rely on the Expelled Gods.\"*\n\nGrandmaster Zikfrector's confession echoed in Grid's mind. The old warrior had been insistent—to overthrow the present pantheon, one must seek the Expelled Gods. And the path to them lay hidden somewhere in the Abyss.\n\nBut what *were* the Expelled Gods?\n\nGrid's curiosity burned as he silently vowed to explore that nightmare realm—once he grew strong enough to face the hydra lurking in its depths.\n\nThen fate delivered an answer he hadn't expected.\n\n\"Tell me about the Expelled Gods!\" Grid had demanded.\n\nAnd Lee Jeong—this follower of the War God who had appeared from nowhere—spoke as if he knew them intimately. Unlike the Grandmaster, this man's tone dripped with contempt.\n\nGrid unleashed Link with everything he had. Dozens of energy blades carved through the air, but Lee Jeong moved with an uncanny grace, deflecting each strike with minimal effort. Or so he thought.\n\nPain lanced across Lee Jeong's face. Blood welled from a thin cut near his eye, barely visible beneath the blindfold. More scratches appeared across his body—shallow, but bleeding nonetheless. Each of Grid's strikes had triggered Braham's Wind Cutter, invisible blades riding in the wake of steel.\n\nThe improved spell was still weak. Barely an annoyance to someone of Lee Jeong's caliber. Yet the warrior's composure cracked.\n\n*To harmonize swordsmanship and magic to such a degree...*\n\nIt was something no martial artist or supreme magician could replicate alone. Lee Jeong's jaw tightened.\n\n*So this is the power of being Overgeared.*\n\nHe had to admit it—this represented one of the ultimate combat techniques. Had the power been greater, he would have suffered genuine injury.\n\n*To glimpse such heights without the War God's guidance...*\n\nMercedes' earlier words surfaced in his mind: *\"My king is already like a god.\"*\n\nLee Jeong's eyes narrowed behind the blindfold. *Dangerous.*\n\nThis man had to die here. Now. Before he became an unstoppable threat.\n\nLee Jeong shifted his stance, preparing to counterattack—\n\nHeat erupted against his back. Agony tore through him as Asmophel's blade blossomed from the shadows, finding the gap between ribs. The Fire Sword's sneak attack had succeeded.\n\n\"Kuek...!\"\n\n**[You have joined forces with people you absolutely trust!]**\n\nFlames cooked his organs from within. Blood boiled in his veins. Lee Jeong gritted his teeth against the pain and vanished.\n\nHe reappeared before Grid in an instant. Five fingers speared toward Grid's throat.\n\nThe protective barrier from the First King title shattered like glass.\n\n\"Shit!\" Grid's eyes widened.\n\nWhere had this *monster* come from? Even braced for Lee Jeong's strength, experiencing it firsthand sent ice through Grid's veins.\n\nBut fear didn't paralyze him. He wasn't alone.\n\n\"Kuaaaack!\" Lee Jeong's scream tore through the forest as Mercedes' White Tiger Sword punched through his side.\n\n**[The player common hidden piece, 'Cooperative Skill' has activated!]**\n\n*Now!*\n\nGrid forced his swimming vision to focus. His hands moved through the familiar forms. \"Linked Kill Flower Pinnacle!\"\n\n**[The power of all skills have increased by 240% thanks to the Cooperative Skill!]**\n\nThe Cooperative Skill—a hidden synergy that emerged when linking attacks with trusted allies. Grid had experienced it before with Piaro, Asmophel, and Maxong. He'd even been the first player to discover it.\n\n**[You are the first person to uncover the existence of the Cooperative Skill.]**\n**[The achievement has increased the power of your skill by 260%!]**\n\nLinked Kill Flower Pinnacle normally dealt 1,850% physical damage—enough to give even Great Demons pause. Now, amplified several times over, it became devastation incarnate.\n\nFor Lee Jeong—classified as an NPC rather than a boss monster—it was unsurvivable.\n\nThe War God's follower couldn't even scream. He slammed into the ground, health gauge plummeting. He'd already taken critical damage fighting Mercedes alone. This pushed him past his limit.\n\n\"Cough... cough...!\" Blood spattered from Lee Jeong's lips. He twisted away from Mercedes' follow-up strike and shoved Asmophel back, but his movements had grown sluggish. He fumbled for a potion with trembling hands, eyes locked on Grid. \"Do you really know?\"\n\n\"The Expelled Gods?\" Grid steadied his breathing. \"No. I wouldn't be asking if I knew.\"\n\n\"Kuk... kukukuk...!\" Laughter burst from Lee Jeong—not at his own defeat, but at the absurdity before him.\n\nThe heir to Pagma's Swordsmanship didn't even know the identity of the Expelled Gods. What could be more ridiculous?\n\nStill... relief flickered through the pain. At least this man wasn't their puppet.\n\nLee Jeong's laughter faded. Just before Grid's patience snapped, he spoke: \"Do you know there's another continent beyond the Red Sea?\"\n\nGrid nodded. \"The East Continent. I've been there.\"\n\n\"There's a nation called the Hwan Kingdom.\"\n\n\"...?\" Grid stiffened.\n\n\"Ruled by immortal humans.\"\n\nThe yangbans. It couldn't be—\n\nLee Jeong smiled at Grid's widening eyes. \"Yes. They are the Expelled Gods.\"\n\n\"Wait.\" Grid's mind reeled. He'd experienced firsthand how the yangbans treated humans—as insects beneath notice. \"That's impossible. It can't be.\"\n\nThe Seven Malignant Saints had rebelled against the gods' original sins—jealousy, betrayal, deception, cruelty. They'd fought to protect humanity from divine wickedness.\n\nWere those heroes truly seeking aid from the *yangbans*?\n\nThe same yangbans who enslaved and murdered humans without hesitation? While the present gods at least maintained the *illusion* of caring for mortals?\n\nA ringing filled Grid's ears. Confusion crashed over him like a wave. \"Are you... lying?\"\n\n\"Hah! Kuhahaha!\" Lee Jeong's laughter echoed again.\n\nMercedes witnessed Grid's flushed face and surged forward. Lee Jeong, hands now free from his restraints, parried her strike with renewed strength.\n\n\"Didn't I tell you?\" Lee Jeong's voice cut through the clash of steel. \"The Expelled Gods aren't humanity's saviors.\"\n\n\"...\"\n\n\"They were banished and stripped of their divinity because they were *weak*. Not because they were noble protectors of mankind.\"\n\n\"Then why—\" Grid struggled to process it. \"Why are the Seven Malignant Saints seeking their help?\"\n\n\"Obviously—to win.\" Lee Jeong deflected another of Mercedes' attacks. \"The Seven Malignant Saints might have won their war if they'd borrowed the Expelled Gods' power.\"\n\n\"...?\"\n\n\"You said your name was Guldu?\"\n\n\"Don't speak My Liege's name so casually.\" Mercedes' blade sang through the air. \"And it's *Grid*, not Guldu.\"\n\n\"My pronunciation isn't good,\" Lee Jeong said mildly, then turned his attention back to Grid. \"Guldu—whoever among the Seven Malignant Saints you've met, don't lose sight of what matters.\"\n\n\"...?\"\n\n\"Did they ever say the Expelled Gods were *good*?\"\n\n\"...!\"\n\nThe question struck like a hammer.\n\nNo. The Grandmaster had only said he needed the Expelled Gods' power to overthrow the present pantheon. He'd never mentioned their character.\n\n\"All gods are evil—from a human perspective.\" Lee Jeong's tone grew philosophical. \"If you grow a flower in a pot and occasionally envy its peace or beauty, are you evil? Are humans evil for using plants as fertilizer? The history of this world, the events yet to come—it's all just providence.\"\n\n\"...\"\n\n\"But one thing is certain.\"\n\nLee Jeong had been born on the East Continent. Like everyone there, he'd once worshipped the yangbans as gods. His voice hardened with the weight of centuries-old memory. \"The present gods are better than the Expelled Gods. Think of it as the difference between an owner who occasionally tends their plants well... and one who constantly abuses the flower they're raising.\"\n\n\"...\"\n\nAn unpleasant metaphor. Unfortunately, it rang true.\n\nLee Jeong studied Grid's silent face. \"You're definitely not a minion of the Expelled Gods. Then we have no reason to be enemies.\"\n\n\"...\"\n\n\"My name is Lee Jeong. I'm one of the Triad who explored the mysteries presented by the War God. I *will* defeat the Expelled Gods with the ultimate martial arts. I swear it...\"\n\nWhatever the yangbans had done to him, the grudge ran soul-deep. Remembering Garam's arrogance, Grid could imagine.\n\nFinally, Grid found his voice. \"Are the Seven Malignant Saints good?\"\n\nThe Grandmaster knew the yangbans' nature. Yet he still sought their alliance. Was he truly acting for humanity's sake? Or was he endangering everyone?\n\nLee Jeong snorted. \"Weren't you listening? Judge for yourself.\"\n\nGood and evil shifted with perspective. Grid couldn't argue.\n\nBesides, the Seven Malignant Saints' morality didn't concern him. He'd already made his choice—to avoid making enemies of the gods.\n\n\"...Fine. I understand.\" Grid straightened. \"Go your way.\"\n\nHe wouldn't waste time pursuing Lee Jeong. Not when victory would likely require sacrifices he wasn't willing to make.\n\n\"But leave Kyle behind.\"\n\n\"...\"\n\nLee Jeong hesitated, halfway to retrieving the fallen knight. After their conversation confirmed they needn't be enemies, this man would still obstruct him?\n\n\"You're surprisingly unwise.\"\n\nGrid smiled at the hostility radiating from Lee Jeong. \"Our positions are different, right?\"\n\nHe read the surviving elves' expressions. Only a handful had survived. Once again trampled by humans, their fury focused on Kyle—not the War God's followers. Kyle had orchestrated this massacre. Someone had to answer for it.\n\nLee Jeong realized words were useless. He glanced at Mercedes. \"Tell your master—I don't know about the future, but you can't beat me right now.\"\n\nHis restraints were gone. Mercedes' Keen Insight would have gauged his true level. This fight was pointless. Lee Jeong was certain.\n\n\"Summon Knights. Piaro, Noll, Teruchan.\"\n\n\"I have responded to My Liege's call.\"\n\nA farmer appeared, hand plow gleaming.\n\n\"Ah! I was asleep! Asleep!\"\n\nA vampire materialized, cheeks bulging with red potatoes.\n\n\"Grruk. Underwear. Didn't take off. Grruk.\"\n\nAn orc emerged in garish yellow undergarments.\n\n\"...\" Lee Jeong's certainty evaporated.\n\nParticularly regarding the farmer. That one radiated danger.\n\n\"I understand.\" Lee Jeong's tone shifted. \"I'll leave Kyle to you.\"\n\n\"Wise decision.\"\n\n\"Che.\" Humiliation burned through Lee Jeong—a sensation he hadn't felt since leaving the Hwan Kingdom. He clicked his tongue and turned to depart.\n\n\"Wait.\" Grid's voice stopped him. \"Two more questions.\"\n\n\"What?\"\n\n\"Do you know the Abyss?\"\n\n\"The end of the world? Naturally. You must pass through there to reach the Hwan Kingdom without permission.\"\n\n*So that's the connection.* Grid nodded. \"Last question—are you planning to stay active on the West Continent?\"\n\nThe most crucial question. The War God's followers were absurdly powerful. Lee Jeong especially—at least the Grandmaster's equal. If he remained in the west, the Overgeared Kingdom could be caught in the crossfire.\n\nLee Jeong shook his head at Grid's wariness. \"I don't have time to play here. If we meet again, it'll probably be on the East Continent—beyond the Red Sea.\"\n\nThat was as far as Lee Jeong's consideration extended. He stepped onto empty air and vanished from sight, leaving only disturbed leaves in his wake.\n\nMeanwhile, an argument erupted behind Grid.\n\n\"Y-You—this orc *dared* to take my food?\"\n\n\"Raw liver. Gruruk. Tastes... gruruk... delicious!\"\n\n\"I'm going to drain your blood today!\"\n\n\"...\"\n\nGrid pinched the bridge of his nose. Exhaustion crashed over him as Piaro moved to reunite with his former colleagues.\n\nSkunk's haggard group finally arrived at the scene, panting and wide-eyed.\n\nKyle stood motionless. He'd given up on life itself. Flight was meaningless when Mercedes' Keen Insight tracked his every breath."
}