{
  "id": 112,
  "title": "Chapter 112",
  "content": "# Chapter 112\n\nGrid stood at the center of the chamber, Dainsleif heavy in his grip. The dark greatsword pulsed with red lightning as he swung it forward.\n\nA blade of dark energy shot out.\n\n*Crack!*\n\nThe guardian screamed. Its deformed arms hung useless at its sides, and now the energy slash carved across its face. The metal golem staggered backward, unable to process the damage.\n\nGrid grinned. The power of Transcend was intoxicating.\n\nHe swung again.\n\nTwo blades erupted from Dainsleif in a cross pattern, slamming into the guardian's chest. The golem wailed. Grid adjusted his stance and slashed diagonally. The energy blade bent mid-flight like a whip, striking the back of the guardian's neck with surgical precision.\n\nHe didn't stop. Black swords flew in rapid succession.\n\n*Boom! Boom! Boom!*\n\n> [You have dealt 4,100 damage.]\n\n> [You have dealt 3,730 damage.]\n\n> [You have dealt 4,450 damage.]\n\nThe red lightning coursing through Dainsleif doubled its attack power. Each strike hit harder than his previous Link skill. And unlike Link, Transcend had no cooldown restrictions.\n\nGrid's eyes gleamed.\n\n\"Blacksmith's Rage!\"\n\n> [Blacksmith's Rage has been activated. Your attack power and attack speed will increase significantly for 20 seconds.]\n\nThe skill activated. Grid launched himself at the guardian.\n\n\"Die! Die! Die!\"\n\nHis laugh echoed through the collapsing chamber, manic and unrestrained.\n\n*Thud! Thud! Thud!*\n\n> [You have dealt 5,500 damage.]\n\n> [You have dealt 5,350 damage.]\n\n> [The Best Gauntlets option effect is activated, causing you to attack the target twice.]\n\n> [You have dealt 10,940 damage.]\n\n> [You have dealt 5,900 damage.]\n\nThe guardian roared, but it was pointless. The battle had become entirely one-sided. Grid's barrage of flying swords kept the golem pinned, unable to advance. If its arms had been functional, it might have defended itself. But Grid's hammer strikes had warped the metal beyond repair. The guardian was nothing more than a stationary target.\n\nEach impact sent shockwaves through the chamber. Cracks spiderwebbed across the walls. Dust and debris rained from the ceiling.\n\nAbove, clinging to a ledge near the top of the chamber, Jishuka watched with nervous eyes.\n\nVantner crouched beside her. \"Shouldn't we help? Why are we just sitting here?\"\n\nJishuka bit her lip. She was a physical damage dealer. Her arrows could tear through the Guardian of the Labyrinth. And from this vantage point, she had a perfect sniping angle.\n\n\"I could help,\" she admitted. \"But Grid would be furious if I interfered. You know how he is.\"\n\nVantner smacked his forehead. \"Ah. Right.\" He nodded slowly. \"Yeah, considering his personality... He'd throw a fit if someone stole his experience.\"\n\n\"Exactly. And honestly, he seems to be handling it fine.\" Jishuka's sharp gaze tracked the fight below. \"I just wish he'd hurry.\"\n\nShe'd already assessed the situation. The Guardian of the Labyrinth was weaker than the Guardian of the Forest. Its defense, health, and attack power might be equal or slightly higher, but it had a critical flaw.\n\n*No skills.*\n\nThat was the difference. The Guardian of the Forest had area stuns, golem summons, and a variety of tricks. This guardian was just a metal lump with high stats.\n\nJishuka cupped her hands around her mouth. \"Grid! Look behind the guardian! See that small cave? If the ceiling starts to collapse, run there!\"\n\n\"Got it!\"\n\nGrid didn't look up. He continued his relentless assault, blade after blade slamming into the golem. It couldn't retaliate. Couldn't even move forward.\n\n\"Overwhelming firepower,\" Vantner muttered.\n\n\"His damage output and durability are both superior,\" Jishuka agreed.\n\n*He didn't use his full strength during the Malacus raid,* she realized. *Or against the Giant Guild.*\n\nVantner had a different thought. *Could he beat Regas?*\n\nBelow, the Guardian of the Labyrinth stumbled backward. Its metal back hit the wall with a resounding crash.\n\nGrid's eyes locked onto the small cave entrance revealed behind the guardian.\n\n*There.*\n\nHe activated Quick Movements. His body blurred forward as he swung Dainsleif. A sword aura flew straight into the guardian's eyes.\n\nThe golem's eyes flared red with lightning. It thrashed blindly.\n\nGrid appeared directly in front of it.\n\n\"Pagma's Swordsmanship!\"\n\nTranscend's duration had ended, but Link's cooldown was finally over.\n\n\"Link!\"\n\n*Clang! Clang! Clang!*\n\nWhen Grid first learned Link, he could only unleash six strikes. With practice, that number rose to eight. Through combat experience, it reached ten.\n\nTen red lightning blades carved into the Guardian of the Labyrinth. The golem dropped to its knees.\n\nGrid leaped into the air. He gripped Dainsleif with both hands and channeled every ounce of strength he had.\n\n\"Kill!\"\n\n*Thunk.*\n\nThe black greatsword pierced the guardian's head.\n\nThe golem collapsed.\n\n> [You have defeated the Great Magician Braham's Guardian of the Labyrinth!]\n\n> [180 gold has been acquired.]\n\n> [90 pieces of deluxe iron ore have been acquired.]\n\n> [33 pieces of black iron have been acquired.]\n\n> [45 pieces of orichalcum have been acquired.]\n\n> [3 Deluxe Magic Stones have been acquired.]\n\n> [<span class=\"rarity-epic\">Braham's Treasure Chest Key</span> has been acquired.]\n\n> [45,350,000 experience has been acquired.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\nDuring the Malacus raid, Grid had shared experience with seventeen party members. The distribution had been pitiful. But now, as a solo raider, the full reward was his.\n\nHis level jumped from 106 to 114 in a single fight.\n\nGrid stared at the notifications. He'd also received dozens of expensive black iron and orichalcum pieces. His expression soured.\n\n\"Apart from the experience, the rewards are garbage.\"\n\nDisappointment settled heavy in his chest. A boss monster should drop at least one unique item. That was how it worked.\n\n*The guardian had high stats and no special attacks, but it's still a boss. Shouldn't there be better loot?*\n\nThe Guardian of the Labyrinth hadn't used a single skill from start to finish. Its only attack pattern was swinging its arms. Once those arms were deformed, it became helpless. But that didn't mean the raid was easy.\n\nJishuka and Vantner didn't know this, but when Grid first fell into this chamber, he'd triggered dozens of Braham's magical traps. Sudden traps were nearly impossible to react to. The damage had been in the hundreds of thousands. Only his legendary passive kept him alive. Any other user would have died instantly.\n\nThe traps were part of the raid. Even if the guardian itself was weak, the overall difficulty exceeded Malacus. Yet the rewards were just production materials?\n\n*Sure, black iron and orichalcum are expensive, but I was hoping for something more special.*\n\n*Rumble.*\n\nThe chamber began collapsing around him.\n\nGrid moved quickly, stepping past the guardian's corpse and into the small cave. He stopped.\n\nThree boxes sat side by side.\n\n\"Ohhh!\"\n\nHis mind flashed back to the key he'd just received.\n\n\"This is it! The real reward is separate!\"\n\nHe approached the three boxes.\n\nThe first was ornate, covered in embellishments, shining brilliantly. A true treasure chest. The second was scratched and plain, utterly unremarkable. The third was just an old wooden box.\n\nHe only had one key.\n\nMost people would think the ornate chest was a trap. They'd assume the real treasure was hidden in the old box. Or maybe the plain one. It would cause deliberation, overthinking.\n\nBut Grid was simple.\n\n\"Of course the shining box is the treasure chest! Overthinking just shows weakness!\"\n\nHe pulled <span class=\"rarity-epic\">Braham's Treasure Chest Key</span> from his inventory and inserted it into the ornate box.\n\n*Click.*\n\nGrid smiled with confidence. The key turned smoothly.\n\nThe box opened wide.\n\n\"Ohhh!\"\n\nA brilliant flash of light.\n\nGrid gulped in anticipation.\n\nThen he frowned.\n\n\"...What?\"\n\nThere were no colorful treasures. No rare items. Just one egg. A plain, ordinary egg. Based on size, shape, and color, it looked like a chicken egg.\n\n\"...?\"\n\nGrid stared in stunned silence. He'd fought through the labyrinth, defeated the guardian, survived the traps, only to receive an egg?\n\n\"...\"\n\nHis body trembled.\n\nHe couldn't suppress his anger any longer.\n\n\"Damn it! How rotten! What the hell is this?!\" His voice echoed through the cave. \"This egg won't even satisfy my hunger! No, why the hell is there an egg in a treasure chest in the first place?! Does this make sense?! Damn operators! If you're going to make a game, put some thought into it!\"\n\nThe recent string of good luck had made him forget.\n\n\"...Right. Originally, I was unlucky.\"\n\nWas his streak of misfortune returning? Grid's face paled. He sighed and turned his grouchy gaze to the remaining two boxes.\n\n\"The real treasure must be in one of those.\" He shook his head. \"I should've opened the old box. Damn it.\"\n\nHe checked the first box to see if he could reuse the key.\n\nIt had already shattered.\n\n\"I can't go back like this.\" He clenched his fists. \"Wait.\"\n\nAn idea struck him.\n\n\"Item Creation!\"\n\n> [What item do you want to create?]\n\nGrid answered immediately.\n\n\"A key.\"\n\nHe was going to create a master key to open the remaining boxes. Item Creation had a limited number of uses, so he needed to be careful. But he'd learned from creating Failure.\n\n*A universal key that can open anything will benefit me permanently. Even if it costs one creation slot, it's worth it.*\n\nTreasure chests were essential in games. RPGs and adventure games always had boxes. What if he had a master key that could open all of them? It would be perfect. Every time he encountered a locked box, he'd gain the rewards without hassle.\n\nThe same logic applied to Satisfy.\n\n*I need a master key.*\n\n> [Have you decided?]\n\nGrid nodded firmly.\n\n\"Yes.\"\n\n> [What materials would you like to use?]\n\nBraham's key was made of black iron. The same material as Dainsleif.\n\n*Black iron has special durability. If I use it, the key will last semi-permanently.*\n\nBraham's key was disposable due to the event's nature. Grid's would be different.\n\n\"Black iron.\"\n\n> [Please design the item.]\n\n\"Hmm.\"\n\nGrid paused. What should a master key that could open anything look like? It wasn't an easy decision. He thought back to the thieves in dramas, movies, and anime he'd watched.\n\n*Wires!*\n\nSkilled thieves could pick any lock with just two thin wires. Even if he'd only seen it in movies, it might actually work.\n\nGrid drew two pieces of wire on the blueprint. Too thin. He deleted them and redrew. He added a cylindrical pillar, punched a small hole in the center, and connected two wires there.\n\nThe design was crude, but Grid was satisfied. He clicked the complete button.\n\n> [Have you decided? When you complete the blueprint, the number of available creation skills will decrease by one.]\n\n\"I've decided!\"\n\nNumbers and letters filled the blueprint. The system calculated stats and functions. After a moment, the blueprint was finalized.\n\n> [Please describe the characteristics of the item.]\n\n\"An incredible, scientifically designed key that can open all types of locks!\"\n\n> [Please name the item.]\n\n\"Master Key!\"\n\n> [Have you decided on 'Master Key'?]\n\n\"Yes!\"\n\n*Hum.*\n\nA hologram of the finished Master Key appeared before Grid, complete with its description.\n\n> [**Master Key**]\n>\n> A key made of black iron. The form is somewhat ambiguous to be called a key. When hung around the neck, it resembles a necklace. When placed around the wrist, it resembles a bracelet.\n>\n> The appearance is crude, but it is made of excellent materials. The performance is surprisingly spectacular. It can open many types of locks.\n>\n> * The higher the user's dexterity, the more types of locks that can be opened.\n>\n> **Conditions of Use:** More than 300 dexterity.\n\n\"Perfect!\"\n\nThe result was a complete success. And Grid had the highest dexterity among all users.\n\n\"This is an item made for me!\"\n\nNow he just needed to craft it. But that required smelting black iron, which meant returning to the smithy. Grid didn't want to risk that.\n\n*I got lost in this labyrinth. I fell here by coincidence. Will I even be able to find my way back? And what if this cave disappears while I'm gone? It's a treasure trove, so maybe there's a time limit...*\n\n\"Grid! Are you safe?\"\n\nJishuka's voice came from behind him. She'd grown worried when he didn't emerge from the cave.\n\nGrid smiled widely.\n\n\"That Phoenix Arrow of yours... It has a pretty high temperature, right?\"\n\nJishuka's Phoenix Arrow was the ultimate skill she'd used during the Malacus raid. The fire arrow resembled a gigantic phoenix, and seething lava erupted where it exploded. It dealt tremendous damage, but Jishuka rarely used it because it consumed 100% of her mana.\n\nNow, Grid intended to exploit it.\n\n\"Jishuka, do you see that spot just outside the cave? Fire Phoenix Arrow there.\"\n\n\"What?\"\n\nJishuka frowned. He wanted her to waste her ultimate skill on empty ground? Had Grid lost his mind?\n\nGrid saw her confusion.\n\n\"I need fire to smelt minerals. Just for a minute. I need to make a small item.\"\n\n\"...You're saying you want to use my Phoenix Arrow to make a campfire?\"\n\n\"Exactly.\"\n\n\"...\"\n\nAn expert archer's ultimate technique reduced to a furnace substitute. Jishuka felt humiliated. She bit her lower lip, trembling.\n\nGrid drove the point home.\n\n\"You're not in a position to refuse. Understand? There are plenty of guilds who would welcome me.\"\n\n\"...\"\n\n\"It's not that difficult, is it? Don't be so stubborn.\"\n\nGrid was no longer timid around her. He'd grown flexible enough to leverage people when needed. Jishuka realized he was completely different from the Grid she'd met two weeks ago.\n\nIt was oddly reassuring.\n\n\"Fine.\"\n\nHelping each other wasn't a bad thing.\n\n*Grid is a blacksmith who can make legendary items. Assisting him in production isn't a waste.*\n\nJishuka forced herself to think positively. She aimed her bow toward the remnants of the underground chamber.\n\n\"Brace for impact.\"\n\n*Whoosh.*\n\nA small flame appeared at the end of her arrow. It swelled rapidly into a massive fireball.\n\n\"Phoenix Arrow!\"\n\n*Screech!*\n\nA deafening cry, like a pterodactyl's scream, echoed through the cave. Grid winced as the sound stabbed into his ears. The flaming bird shot from Jishuka's bow, leaving a trail of fire in its wake. It vanished an instant later.\n\nGrid identified the burning spot and sprinted toward it, grinning. He pulled out an anvil and hammer and began smelting black iron.\n\nMeanwhile, Jishuka slumped against the cave wall, her mana completely drained. Dizziness washed over her.\n\n\"Using my ultimate skill like this... It really doesn't feel good.\"\n\nNearby, Vantner watched Grid with open envy.\n\n*Being able to handle Jishuka like that... This is the first time I've met a man like you, Grid. You're incredible!*\n\n---\n\n**Glossary of Common Korean Terms:**\n\n**OG:** [Glossary Link]\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and to help achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}