{
  "id": 113,
  "title": "Chapter 113",
  "content": "# Chapter 113\n\nTen minutes crawled by. Grid crouched before the pool of lava, hammer rising and falling in steady rhythm. When he finally stood and dusted off his knees, a grin split his face.\n\n\"Got it!\" He held up his creation. \"Done!\"\n\nJishuka tilted her head from where she'd been watching. \"Already?\" She stepped closer, squinting at the object. \"What is it?\"\n\nThe item Grid clutched looked like nothing more than a small metal cylinder with two wires jutting from one end. Not exactly inspiring.\n\nGrid's grin widened. \"Watch this.\"\n\nHe marched into the cave and made a beeline for one of the two remaining chests. The old wooden one. Grid knelt and inserted the wires into the padlock.\n\n\"Open up.\"\n\nThanks to crafting countless items, Grid's Dexterity had climbed past 1,600. Khan, the legendary blacksmith of the north, sat around 600. The gap was obscene. And the Master Key fed directly off that stat. With this tool in hand, no lock could stand against him.\n\n*Click.*\n\nThe rusted padlock popped free. Purple light spilled from the chest's interior, washing Grid's face in violet radiance.\n\n\"Yes!\" Grid thrust his fist in the air.\n\n> **[Braham's Boots]**\n> \n> Rating: <span class=\"rarity-unique\">Unique</span>\n> \n> Durability: 140/150  \n> Defense: 130\n> \n> * Movement Speed +10%\n> * Skill Cooldown Time -20%\n> * Generates Skill: **Fly**\n> \n> *Boots once cherished by Great Magician Braham.*\n> \n> *These knee-high boots are crafted from supple griffon leather, offering comfort despite their length. Black iron guards provide excellent defense while lending a striking appearance. Silver-embroidered cloud patterns add an elegant, classical touch.*\n> \n> *They are imbued with Braham's enigmatic magic.*\n> \n> **User Restriction:** Level 240 or higher.  \n> **Weight:** 50\n\nGrid's breath caught. Pagma's Swordsmanship was built on devastatingly powerful skills, each one capable of turning the tide of battle. But the cooldowns were punishing. Kill and Transcend especially. Their raw power came at the cost of being locked out for agonizing stretches.\n\nA 20% cooldown reduction was like someone had turned on the lights in a dark room.\n\n*And Fly magic on top of that.*\n\nThat was a spell reserved for advanced mages. Second advancement minimum.\n\n> **[Fly]**\n> \n> *Summon invisible wings woven from magic power to soar through the air.*\n> \n> *Flying speed scales with magic power. No height restrictions, but beware of oxygen deprivation at extreme altitudes.*\n> \n> **Skill Mana Cost:** 2 per second.\n\n\"Hey.\" Vantner's voice cut through Grid's thoughts. The bald man leaned forward, eyes fixed on the boots. \"Share the item info. Please.\"\n\nThe chest had been glowing purple. Whatever Grid pulled out was clearly valuable. Vantner needed to know just how valuable.\n\nJishuka said nothing, but her emerald eyes gleamed with barely restrained curiosity. She clasped her hands behind her back, clearly trying to maintain some dignity.\n\nGrid smirked. \"If you're *that* curious...\"\n\nHe shared the information.\n\n\"What?\" Vantner's jaw dropped. \"Fly magic? Seriously?\"\n\nMagicians needed their second advancement to learn flight. That required hitting level 200 at minimum. Which meant the number of players currently capable of flight could be counted on one hand.\n\nYet these boots just... granted it? To anyone?\n\nJishuka whistled low. \"That's incredible.\" She folded her arms. \"The cooldown reduction alone makes them exceptional. Add flight and high defense?\" She shook her head. \"Anyone would kill for these.\"\n\n\"I'll buy them!\" Vantner blurted. \"Name your price. I'm serious. I've got the gold.\"\n\nHe could picture it already. Flying freely through the sky. A privilege reserved for elite mages, now his for the taking. He'd empty his bank account if necessary.\n\nGrid had money now too. Real money. The kind that changed how people looked at you. After buying that luxury car, he'd experienced it firsthand. The respect. The attention. Doors that opened automatically. He finally understood why people flaunted designer brands and foreign vehicles.\n\n*I'm done living like a beggar.*\n\nNo more humiliation. No more scraping by. He'd made enough to eat chicken whenever the craving hit. To add two eggs to his ramen instead of one.\n\nBut there was no rush. The debt was paid. His income was stable. The car was already parked in his building's garage.\n\nGrid shook his head. \"I'm not hurting for money right now.\" He glanced at the boots. \"These are too useful to sell. Sorry.\"\n\nVantner deflated like a punctured balloon. \"Damn.\" He sighed. \"Can't argue with that.\"\n\nThe level requirement was 240. Grid was stuck at 114. It'd be a while before he could even wear them. But Vantner kept his mouth shut. If Grid didn't want to sell, pushing would only backfire.\n\n*I still need him to make my armor.*\n\nGrid clapped Vantner on the shoulder. \"Don't look so depressed, Mister. I'm still making your armor, right?\" He flashed a confident grin. \"I'll craft something incredible. Assuming you've got a decent production method.\"\n\nHe'd already created a Unique spear and a Legendary sword. The words carried weight.\n\nVantner's spirits lifted. \"That's what I like to hear.\" He rubbed his hands together. \"The armor pattern we found is special. Real special. I'm counting on you.\" He paused. \"But why do you keep calling me 'Mister'? I'm the same age as Pon! You call him by name!\"\n\nTo Grid, Pon looked maybe thirty. Vantner looked like he'd hit sixty years ago. The man was clearly delusional.\n\nGrid ignored the complaint and moved to the final chest. The ordinary one. Not flashy. Not decrepit. Just... plain.\n\n*What's inside the boring box?*\n\n\"Let's find out!\"\n\nHe'd slain a giant monster and discovered treasure. Like a hero from the old stories. The atmosphere crackled with excitement.\n\nGrid jammed the master key into the padlock.\n\n*Click. Click. Scrape.*\n\n\"...\"\n\nHe wiggled the wires. Twisted them. Adjusted the angle.\n\nJishuka's eye twitched. *He looks like a common thief.*\n\nThe image of her Phoenix Arrow, melted down into lockpicks, made her blood pressure spike.\n\n*Click!*\n\nThe lock gave way. The chest creaked open.\n\nWhat lay inside?\n\nGrid, Jishuka, and Vantner all leaned forward, breath held.\n\nA streak of light lanced from the chest's interior and slammed into Grid's sternum.\n\n*Thunk.*\n\n\"What—?!\"\n\nIt happened too fast. Jishuka's hand flew to her bow. Vantner's fingers twitched toward his axes. But they were too slow. They could only watch as Grid stumbled backward and collapsed.\n\n\"Grid!\" Jishuka's voice cracked like a whip.\n\n\"Did he just die?\" Vantner stared.\n\nThe attack had come without warning. Lightning quick. Aimed directly at the heart. Fatal damage, no question.\n\nJishuka's eyes blazed as she nocked an arrow. \"Who *dares* kill a guild member in front of me?\"\n\nHer gaze locked on the chest. White smoke began pouring from its open lid. Someone was inside.\n\nVantner yanked his twin axes free. \"You're dead!\" he roared at the smoke. \"You just killed a Tzedakah Guild member! We'll make you regret it!\"\n\nHis shout echoed through the cave.\n\n\"Why are you acting like I'm dead?\"\n\n\"...Grid?\" Jishuka whirled around.\n\nGrid was on his feet, brushing dust from his pants. An egg floated in front of his chest, rotating slowly in midair.\n\n\"The hell?\" Vantner blinked. \"That egg?\"\n\nGrid shrugged. \"Your guess is as good as mine.\"\n\nThe egg from the first chest. It had looked completely ordinary. Felt ordinary. He'd tossed it aside and forgotten about it. Yet somehow, it had flown across the cave and intercepted a lethal attack?\n\n*Not an ordinary egg at all.*\n\nGrid replayed the moment in his mind. The chest opening. The flash of light. That blade of condensed magic power, aimed straight for his heart. He'd been certain death was coming.\n\nThen the egg had materialized between him and the attack. Moving on its own. Fast as lightning. And durable enough to block whatever that spell was.\n\n*This isn't a chicken egg.*\n\nSome kind of mythical creature, maybe. A rare monster.\n\n*Could it be a dragon?*\n\nThe egg was small, sure. But who said dragon eggs had to be huge?\n\n*Thump. Thump. Thump.*\n\nHis pulse quickened. The first player in Satisfy to own a dragon. The prestige alone would be astronomical. Grid's heart hammered so hard the sound seemed to fill the cave.\n\nThe egg trembled.\n\n*Crack.*\n\nA hairline fracture appeared on the shell. Then another. The surface splintered like glass, pieces falling away to reveal...\n\nNot a creature. Not a baby dragon or phoenix or griffin.\n\nA blob of liquid metal. Perfectly spherical. Exactly the size of the egg it had occupied. The substance gleamed gold, flowing and shifting like mercury but brighter. Liquid gold.\n\n\"What the hell is this?\"\n\n*Sssss.*\n\nThe golden blob rippled. Meanwhile, a shadow emerged from the smoke still pouring from the chest. A figure began to take shape.\n\n---\n\n**End of Chapter**"
}