{
  "id": 114,
  "title": "Chapter 114",
  "content": "# Chapter 114\n\nGrid stared at the lump of gold floating before him. Smoke billowed from the ornate chest. A shadow stretched upward, coalescing into form.\n\nJishuka's bow creaked.\n\n*Paang!*\n\nAn arrow launched before Grid could blink.\n\n*Peng!*\n\nThe projectile exploded into ash mid-flight. The shadow extended a pale finger, flames dancing at the tip.\n\n\"What the—\" Jishuka's grip tightened on her bow.\n\nVantner shifted his weight, shield rising. \"That speed...\"\n\nA man materialized from the dissipating smoke. Long hair cascaded past sharp shoulders. Eyes like polished steel swept over Jishuka and Vantner with disinterest before settling on Grid.\n\n*This guy's strong.* Jishuka's pulse hammered in her throat. *Malacus-level at minimum.*\n\nShe'd burned every skill just to survive the raid boss. This entity had negated her fastest shot with a gesture. Beside her, Vantner's knuckles whitened around his shield's grip.\n\nThe figure's gaze remained fixed on Grid.\n\nRelief flickered through Jishuka's chest. *At least he's ignoring us.*\n\nGrid had no such luxury.\n\n\"You jerk!\" He ripped <span class=\"rarity-unique\">Dainsleif</span> from his inventory. \"What kind of lunatic tries to kill someone without warning? You think you can just—Heok?\"\n\nThe words died in his throat.\n\nThe man's body shimmered with translucence. His feet hovered six inches above the stone floor. Grid's eyes widened. His face drained of color.\n\n*A ghost.*\n\n\"H-Hik!\" The greatsword trembled in his grip.\n\nHe'd served his country. Survived debt collectors and loan sharks. Faced down corrupted nobles and fanatic cultists. But ghosts? Ghosts were different. Cold sweat beaded on his forehead. His bladder suddenly felt very full.\n\n*Should've joined the damn marines.*\n\nThe specter tilted its head.\n\n[You survived my traps. Opened three locks with different mechanisms. The pavranium protects you.] Those steel eyes narrowed. [Are you Pagma's Descendant?]\n\n\"Pagma's what?\"\n\n\"Shh.\" Jishuka grabbed Vantner's arm, dragging him toward the wall. \"Grid's quest is triggering. Don't interfere.\"\n\nHer eyes gleamed as she watched the exchange. *Finally. A chance to learn his exact class.*\n\nGrid's fear slowly curdled into curiosity. *He mentioned Pagma's Descendant. Is the class quest moving forward again?*\n\nHe sucked in a breath. Forced his spine straight. \"That's right. I'm Pagma's Descendant. Who are you?\"\n\nThe ghost crossed transparent arms.\n\n[I was known as the Great Magician Braham. You came for minerals, yes? If you truly inherited Pagma's legacy, you should have sought this place long ago. Unlike Pagma, you lack curiosity. Attachment to materials.]\n\nGrid's jaw clenched. *Great Magician Braham?* According to Khan, Braham was the legend who'd created most modern magic. And this ghost claimed he'd designed this entire labyrinth... for Grid?\n\n*I would've come sooner if I'd known,* Grid thought. But something didn't add up.\n\n\"You made this place waiting for me?\" He gestured at the collapsed cavern. \"What if I never showed up?\"\n\n[I created twenty-seven more locations across the continent. Eventually, we would meet.] Braham's expression darkened. [Though I hoped it would be sooner.]\n\n\"Why?\"\n\nBraham pointed at the floating metal.\n\n[Pavranium. The pinnacle of minerals, forged through Pagma's mastery and my magic. Harder than <span class=\"rarity-legendary\">adamantium</span>. Lighter than mithril. Superior magical conductivity, with jaffa's elasticity.]\n\nGrid's breath caught. \"What?\"\n\nA mineral combining every advantage of legendary materials? If true, this was beyond anything he'd imagined. His fingers twitched toward the shimmering gold.\n\n[It possesses will. Moves by its own volition.] Braham's lips thinned. [That is its sole flaw.]\n\n*A mineral made by Pagma...*\n\nGrid no longer heard the ghost's words. The pavranium rotated slowly, light cascading across its flawless surface. Beautiful. Dangerous. Perfect.\n\n*Could I work with this?* His mind raced through possibilities. *Even if I fail, to touch something Pagma created... to understand his techniques through the mineral itself...*\n\nHunger overwhelmed caution.\n\nBraham's eyes narrowed.\n\n*Ttak.*\n\nFire blossomed on his fingertip. The same flame that had devoured Jishuka's arrow.\n\n*Kwaang!*\n\nThe fireball detonated against Grid's face.\n\nThe pavranium blurred. Seven golden discs interlocked into a shield before Grid could flinch. The explosion dispersed harmlessly.\n\nGrid staggered back. \"What the hell?!\"\n\nBraham wasn't looking at him. His glare targeted the floating metal.\n\n[Still playing favorites with the blacksmith, I see.]\n\n\"Are you insane?\" Grid's hands shook with adrenaline. \"Why did you attack me again?!\"\n\nThose cold eyes swiveled back.\n\n[Pay attention.]\n\n\"...\"\n\n*Like some expensive private tutor.* Grid's jaw worked. But the quest mattered more than his pride. He nodded stiffly.\n\nBraham's expression shifted. Anger mixed with something rawer. Desperation.\n\n[At life's end, I requested something of Pagma. I helped him create pavranium so he might fulfill my wish. Nine years and eleven months we labored.] His hands clenched into fists. [But mortality is absolute. Even legends cannot escape time. Pagma died of old age shortly after completing the work.]\n\nSilence stretched through the cavern.\n\n[Everything I hoped to achieve crumbled. I sought the dwarves, begged them to work the pavranium. Their muscles couldn't even smelt it.] Braham's voice rose, cracking with ancient fury. [Despair! Complete despair!]\n\nHe surged forward. Grid instinctively recoiled.\n\n[But now... you.] Braham's eyes blazed with manic hope. [Pagma's Descendant! Complete the work he could not! Create the Vessel of the Soul! Reward my efforts protecting this pavranium for three centuries!]\n\n\"The Vessel of the... what?\"\n\nA system window materialized.\n\n> **[Pagma's Descendant]**\n> \n> **Difficulty:** Class Quest\n> \n> You have inherited Pagma's blacksmithing skill and swordsmanship. But you do not know who Pagma was.\n> \n> Who was Pagma? If he were merely a skilled craftsman, his legends would not span the continent.\n> \n> Follow Pagma's legends. Collect them all. Only then will you understand his true legacy and inherit his will.\n> \n> When that day comes, a new legend will be born.\n> \n> * No time limit exists for this class quest.\n> * This legendary class quest has the power to transform Satisfy's world based on the outcome.\n> \n> **Class Quest Clear Conditions:** Complete all linked quests successfully.\n> \n> **Class Quest Clear Reward:** Unknown\n\nA second notification followed.\n\n> **Second Class Quest: Great Magician's Resurrection**\n> \n> The legendary Great Magician Braham was a genius. From his first studies, he reigned as history's greatest mage. Myth claims he survived battle against the fire dragon Trauka.\n> \n> As age claimed his body, Braham mourned mortality. Mentally and physically, he had transcended humanity. He craved immortality.\n> \n> After extensive research, he designed the Vessel of the Soul—an artifact to transform his mortal spirit into an immortal essence. But the Vessel existed only in theory. No materials in this world could give it form.\n> \n> He learned his old friend Pagma was attempting to create an entirely new mineral. Together, they combined their abilities and forged pavranium.\n> \n> Braham believed pavranium could construct the Vessel. But only Pagma could smelt it, and Pagma died before the work began.\n> \n> Braham's wish died with him.\n> \n> Before his own death, Braham created twenty-eight mines and labyrinths across the continent, each filled with treasures to lure Pagma's Descendant. He sealed fragments of his soul within each location.\n> \n> Three hundred years have passed. One of twenty-eight soul fragments has finally encountered you.\n> \n> Braham wants you to create the Vessel of the Soul. Through it, he will resurrect with an immortal body and spirit.\n> \n> **Second Class Quest Clear Condition:** Create the Vessel of the Soul.\n> \n> **Second Class Quest Clear Reward:** Large quantity of pavranium.\n\nGrid blinked. \"Large quantity? This isn't all of it?\"\n\n[Twenty-seven more labyrinths exist. Twenty-seven more pieces of pavranium.] Braham's form flickered. [Create the Vessel. The rest is yours.]\n\nGrid's mind spun. <span class=\"rarity-legendary\">Adamantium</span> came from the realm of gods. The human world contained only trace amounts, making it the rarest mineral known. But even adamantium might exist in abundance beyond the mortal plane.\n\nPavranium was different. Artificially created. The method lost to time. More limited than adamantium. Superior in every measurable way.\n\n*I can't refuse this.* The class quest offered exactly what he needed. A path forward. Access to materials beyond imagination.\n\nGrid straightened. \"Okay. I'll make the Vessel of the Soul.\"\n\nThen reality crashed back.\n\n\"...How? Can I just make a rice bowl?\"\n\n[Rice bowl?]\n\nBraham's aura exploded. Killing intent rolled off the ghost in waves. The pavranium shuddered. Frost crept across nearby stone.\n\nGrid raised his hands. \"Wait, I meant—\"\n\n[The god of health and wisdom, Judar. The god of war, Dominion. The goddess of light, Rebecca. The god of darkness and pestilence, Yatan.] Each word struck like a hammer. [Obtain blessings from all four upon the pavranium. Then use the divine metal to forge a vessel. Any shape that can hold something. Bring it to me. Do. Not. Be. Late.]\n\nGrid swallowed. \"Four gods? How am I supposed to get blessings from four gods?\" His stomach sank. \"I'm hostile with the Yatan Church.\"\n\n[In the past, I forced each church to comply through power.] Braham's expression turned merciless. [If you cannot do the same, find another method. Beg. Flatter. Lie. I do not care how you accomplish it. Only that you do.]\n\nThe unspoken threat hung heavy in the air.\n\nBraham's form began to dissolve.\n\n[The...n... Pag...ma's... Des...cen...dant...] His voice fragmented like a corrupted recording. [I... be...lieve... in... yo...u...]\n\nThe ghost scattered into motes of fading light.\n\nGrid stood motionless. *Rebecca, Dominion, and Judar... affinity went up after the Malacus raid. High enough to approach them? Maybe. But Yatan?* His jaw clenched. *How the hell do I get a blessing from the god whose church I've been slaughtering?*\n\nAgainst the far wall, Jishuka pulled up her messaging interface.\n\n**-Do you know a magician named Braham?**\n\nLaella's reply came instantly.\n\n**-Absolutely. Braham is the strongest magician in history. Most modern magic derives from his research. He's considered the teacher of all current mages. Every magician knows Braham.**\n\n**-Heh... he's that significant? What about Pagma? Who's Pagma?**\n\n**-Pagma? I'm not sure. First I've heard the name.**\n\nJishuka's eyes narrowed. *Interesting.* Pagma and Braham were historical titans with continent-spanning legends. NPCs studied Satisfy's history from childhood, so they knew these names by heart.\n\nBut users were different. They researched what interested them. Jishuka, an archer, had never heard of Braham. The magician Laella knew Braham intimately but had zero knowledge of Pagma.\n\nShe turned to Vantner. \"Investigate who Pagma is. Discreetly.\"\n\nIf they discovered Pagma's identity, Grid's class would become clear.\n\n*I didn't plan to dig this deep.* Jishuka chewed her lip. But Grid possessed a legendary hidden class. The opportunity to uncover its nature was too valuable to ignore.\n\n\"Huh?\" Her eyes widened.\n\nGrid's feet lifted off the ground.\n\n\"The boots!\" Vantner's face went slack. \"How is that possible?\"\n\n<span class=\"rarity-unique\">Braham's Boots</span> had a level 240 requirement. Grid was level 114. He shouldn't be able to equip them.\n\n*Wait.* Jishuka's gaze tracked to Grid's cloak. *<span class=\"rarity-unique\">Malacus' Cloak</span> requires level 200. And Ibellin's <span class=\"rarity-legendary\">Thorn of Deep Grievance</span>...* Understanding crystallized. *Grid can use all items regardless of restrictions?*\n\nEvery revelation made him more of an enigma.\n\nGrid floated toward the ceiling of the collapsed underground chamber. He looked down at them.\n\n\"I'm heading back to the smithy.\"\n\n*Peeng!*\n\nHe shot upward through the gap in the ceiling and vanished.\n\nVantner whistled. \"Damn! That's incredible!\"\n\n\"...More than I imagined.\" Jishuka's expression was distant, calculating. \"This game really is about item power.\"\n\nThey pictured Grid soaring through the sky, <span class=\"rarity-unique\">greatsword</span> in hand. The image was absurd. Spectacular.\n\n*A warrior who can fly. A warrior stealing the skies from magicians.*\n\nThe headlines would write themselves.\n\nIn reality, he was a blacksmith.\n\n***\n\n**Glossary of Common Korean Terms**\n\nOG: Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}