{
  "id": 115,
  "title": "Chapter 115",
  "content": "# Chapter 115\n\nA hunting ground sprawled near Winston, a favorite haunt for level 100 users.\n\n\"Eh? What's that?\" A user battling a wolf pointed skyward.\n\nHis party members squinted at the approaching speck. One of them frowned. \"It's too big to be a bird. Is it perhaps a griffon?\"\n\n\"There are no griffon habitats in the area.\" Another user gripped his sword tighter. \"But I don't think there is anything else besides a griffon. It's serious if it is a griffon. Will we die?\"\n\n\"U-Uh? A person?\" The first user's eyes widened.\n\nThe dot swelled into a figure. A man in a billowing red cloak flew through the air, something golden flashing beside him in the blazing sun.\n\n\"Wow... A second advancement magician.\"\n\n\"It's my first time seeing a ranker up close. So cool!\"\n\n\"What is that thing shining next to him? A pet?\"\n\n*Kuwaaang!*\n\nGrid tore through the sky, the forest canopy blurring beneath him. The users shrank to ants, then vanished altogether. He shot over a wide expanse of trees before his momentum faltered.\n\n*I'm out of mana.*\n\nHe'd already downed one mana potion. Now his reserves ran dry again before the cooldown expired. Grid angled down, his boots crunching against the forest floor.\n\n\"Winston is beyond this forest.\" He checked his remaining mana. \"I can recover some while walking.\"\n\nThe woods pressed close around him, dense and quiet. Grid gauged the distance to Winston, then examined the frostlight orc chief's helmet sitting in his inventory. After this forest, he would encounter crowds. The helmet was the mark of the Human Slaughterer. People would recognize it.\n\n*I have to quickly replace this helmet.*\n\nGrid vowed once more to commission something worthy of a mythical hero. Above his head, the pavranium circled in lazy loops. It seemed almost... pleased.\n\n\"Are you excited to get fresh air after being trapped in a box for 300 years?\" Grid asked.\n\nThe pavranium offered no reply. Of course it didn't. It had a will, but it was just a mineral. It couldn't carry out a conversation. Grid kept talking anyway.\n\n\"But aren't you unbelievably fast? My flight speed was 100 meters in 7 seconds, yet you managed to keep up. Do you have tireless stamina as well?\"\n\nThe mineral gleamed. Grid watched it with the affection a blacksmith reserves for the finest materials.\n\n\"Kuwooh!\"\n\nGrid's head snapped up.\n\n\"Give it to me! Human! Your life! Flesh and bone! Separate!\"\n\nSturdy orcs crashed through the underbrush, crude red leather strapped to their bodies. Large wolves loped beside them. Their command of the human language marked them as wolf fang orcs, a powerful breed known for their intelligence and brutality.\n\n*Grrrung.*\n\nOne wolf lifted its muzzle, nostrils flaring. The beast reacted to the bloody reek of <span class=\"rarity-unique\">Malacus' Cloak</span>. It caught the scent and led its pack straight here.\n\n*Kuuong! Kung!*\n\n\"Kyaooooh!\"\n\nOgres. Goblins. Snakes. Every manner of monster poured through the trees. In seconds, Grid stood surrounded by a hundred enemies.\n\n\"Wow... What is this?\"\n\nUsers hunting nearby heard the commotion and came running. They gawked at the scene, at all types of monsters converging on a single player.\n\n\"That person is screwed.\"\n\n\"What did he do wrong that angered so many mobs?\"\n\nOne user shook his head. \"Tsk tsk. Purposely angering mobs like this. He should hunt in moderation.\"\n\nThe spectators murmured among themselves, oblivious to the truth.\n\n*Syuok! Syuok!*\n\nGoblin archers in the rear nocked arrows. The users saw the dark rain covering the sky and assumed Grid would die. But Grid's stats pushed him toward level 200 combat effectiveness. He'd observed Jishuka's expert archery. The goblins' clumsy volleys looked like children's pranks.\n\n\"Are there any idiots who would be killed by these arrows?\" Grid drew the <span class=\"rarity-unique\">Ideal Dagger</span>.\n\nHe triggered Wind Blast.\n\n*Kuwaaaang!*\n\nGrid had dumped every point from reaching level 114 into strength. Wind Blast's damage scaled with attack power. The skill carved through the arrow storm and kept going.\n\n\"Kiek!\"\n\n\"Kyak!\"\n\nThe volley disintegrated. Goblin archers screamed as Wind Blast severed arms and legs. Bodies crumpled. The remaining monsters roared and charged as one.\n\n\"Wearing the cloak was worthwhile!\" Grid grinned.\n\nHunting meant levels. Grid swapped to <span class=\"rarity-unique\">Dainsleif</span> and drank a mana potion. He activated Wave, sweeping it in broad arcs. Monsters approaching from all sides collapsed in waves. Ogres survived the initial blast but stumbled under the debuff, their movements sluggish. They couldn't threaten Grid with that crawling pace.\n\n*Peeok! Pajik!*\n\n\"Keok!\"\n\n*Puoook!*\n\n\"Kkieek!\"\n\nWave killed most monsters outright. Grid finished the stragglers one by one. The few surviving goblins loosed desperate arrows. A handful flew true, straight at Grid's exposed back.\n\n\"Che!\" Grid spun too late.\n\nHe braced for impact. The arrows never landed.\n\n*Kwajak! Kwajajajak!*\n\nPavranium blurred around Grid's body, shattering every shaft mid-flight.\n\n\"Wow...\"\n\nThe watching users stared. This swordsman wielded overwhelming attack power with his black greatsword while a metal pet defended him. Perfect balance.\n\nOne user stepped forward. \"That's amazing... Excuse me, but what is your class?\"\n\nGrid swept up the last monsters with pavranium's help and started looting. The users crowded closer, questions spilling out.\n\n\"What is that gold object floating next to you? Is that a pet? Or maybe a new style of armor?\"\n\n\"Mister, how about you? Aren't you actually a high level user? Why is a high level user hunting in a place like this? Is there anything good here?\"\n\n\"Mister?\"\n\n\"Mister, are you deaf? Answer us.\"\n\nGrid had watched these users stand idle while monsters swarmed him. Not one offered help. He'd never been friendly toward people anyway. He had no obligation to answer their questions.\n\n\"This is too annoying.\" Grid looked up. \"Fly.\"\n\nHe shot into the sky, leaving the users gaping below.\n\n\"...?\"\n\nThey blinked. After a few minutes, posts began appearing in communities around the world.\n\n---\n\n**<I saw a swordsman flying.>**\n\n*It was a place called Popo Forest near Winston. I hunted with my friend there and saw a high level user slaughtering mobs. Then after wiping out all the mobs, he flew away. A swordsman was flying?*\n\n**RnfkRk's comment:** ㅋㅋㅋㅋㅋㅋ A swordsman can't fly ㅋㅋㅋㅋㅋ\n\n**Durururubam's reply:** A swordsman was flying? I'm a priest but I can't use Heal. ㅂㅅ\n\n**Black Dragon's Right Arm's comment:** Kukuk... That swordsman was me... Kukukuk... I was careful but I never thought someone would witness it... Yare yare...\n\n**Zkxhfm's comment:** Liar's disease.\n\n**Admiral's comment:** Did your mother eat seaweed soup on the day you were born?\n\n**30,000 won Salary's comment:** Don't write shit just to gain traffic.\n\n---\n\nThe abuse was immediate and brutal. Other witnesses saw what happened to the original poster and kept quiet. The topic died before it could spread.\n\nMeanwhile, Grid landed at Khan's smithy and went straight to the furnace. He placed the pavranium inside and carefully adjusted the temperature, searching for the melting point.\n\n\"It is 1,900 degrees.\"\n\nThe pavranium was so small it smelted almost instantly.\n\n*I don't want to carry it around in an egg shape until I make the Vessel of the Soul, so I should transform it into something else.*\n\nThe volume was minuscule. Not enough to produce a proper weapon. The pavranium wouldn't make even a dagger. To create an item, Grid would need to mix in other materials. But contaminating pure pavranium felt wrong.\n\n\"Let's be satisfied with changing the shape.\"\n\nAfter spending time with the mineral, he'd noticed its tendency to orbit the owner for protection. He needed to exploit that feature.\n\n*A shape more suitable for defense than an egg... Ah!*\n\nMalacus' shield flickered through his memory.\n\n\"He formed a disc-shaped shield with magic power at each attacked point, effectively blocking the attack...\"\n\n*Ttang! Ttang!*\n\nGrid hammered with care. The pavranium slowly flattened under his strikes. After a while, two discs emerged, each slightly smaller than an adult's palm.\n\n\"Okay.\"\n\nGrid lifted the discs. They floated free, then began circling his body in smooth orbits. Relief washed through him. This should protect him from most attacks.\n\nFootsteps echoed in the doorway. Jishuka entered the smithy. Grid turned to her.\n\n\"Shoot an arrow at me.\"\n\n\"Huh?\"\n\n\"Hurry.\"\n\nJishuka studied the golden discs spinning around Grid. Understanding dawned on her face. \"Hrmm, okay.\"\n\nShe nocked an arrow and fired without hesitation.\n\n*Syuk!*\n\n*Chaaeng!*\n\nThe two discs blurred. They intercepted the arrow mid-flight, deflecting it completely.\n\n\"That is great...\" Jishuka's words didn't match her sour expression.\n\n*It's that simple to block? Did I shoot it too weakly?*\n\n\"Hey, wait a minute!\" Grid raised his hands.\n\nJishuka fired again. This time she pulled the bowstring back to its absolute limit.\n\n*Swaeek!*\n\n\"Aaaagh!\" The arrow screamed toward Grid's chest.\n\n*Jjejeong!*\n\n\"...Hah!\"\n\nGrid and Jishuka exhaled simultaneously. Jishuka's came out as a displeased sneer. Grid's was pure delight.\n\n\"This arrow can even pierce through steel...\" Grid examined the discs. \"Isn't this extremely durable? Like Braham said, it's the peak of all minerals.\"\n\nThe golden discs had stopped Jishuka's arrow cold. But the impact was severe. The disc that took the hit froze in place, unable to move for two full seconds before resuming its orbit.\n\n*If it receives excessive shock, it is immobilized for two seconds.*\n\nIf Jishuka kept firing at full strength, two discs wouldn't protect his entire body. Grid felt the urgency of completing this quest and claiming the rest of the pavranium.\n\n*But... If there are 27 more pavranium of this size, it won't be enough to make armor... Well, it isn't a problem. I can still use it.*\n\nGrid's mind was flexible. Rather than force a complete armor set from limited materials, he should maximize efficiency through multiple small items.\n\n*For example, attaching a blade made of pavranium to armor. The blade would move on its own to protect me from attacks I can't react to, or if the enemy attacks me from an unexpected angle.*\n\nAn item that could move on its own. If he cleared this quest and gained the remaining pavranium, he would write a new chapter in the history of equipment. As Grid savored the thought, someone knocked on the smithy door.\n\nJishuka glanced at the discs. \"These discs, they don't need to be exposed to other people right?\"\n\n\"Of course.\" Grid nodded. \"Isn't it common sense to hide it?\"\n\n\"Yes.\"\n\nGrid placed the discs in his inventory. The smithy doors swung open. One knight and dozens of soldiers entered. They saluted Grid with crisp precision.\n\n\"Earl Steim is looking for you.\"\n\n\"Earl Steim?\" Grid straightened. \"Lady Irene's father?\"\n\n\"Yes.\"\n\n\"Oh? Okay! Let's go!\"\n\n*Why would the master of the north, one of the great powers in the Eternal Kingdom, summon me?* Grid followed the knight toward the door. *And why is a high-level NPC knight, famous for their arrogance, acting so respectful toward a user?*\n\nJishuka watched the knight and soldiers escort Grid from the smithy. She frowned.\n\n\"What is this?\"\n\nVantner's armor production would have to wait.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}