{
  "id": 116,
  "title": "Chapter 116",
  "content": "# Chapter 116\n\n\"Put that decoration here!\"\n\n\"Hey, the new curtain color doesn't match the wallpaper. Change it back to the previous one.\"\n\n\"Chef! Is the food preparation finished?\"\n\n\"There's dust left on the carpet! Clean it again!\"\n\nEighty servants working in Winston Castle bustled about. In a little while, Winston's top VIP would arrive. Earl Steim was the one who invited the VIP, but he didn't look pleased.\n\n*I don't like this.*\n\nIrene was Earl Steim's only child. She was truly a lovely daughter. He was confident that she was the most beautiful and gentlest woman in the world. Therefore, he thought that her husband should at least be the prince of another country.\n\nThen!\n\nHis precious daughter, famous for being aloof in social circles, had her heart taken by a con artist! What a blunder!\n\nIrene hummed to herself. \"Hum hum hum~\" She smiled, radiating the glow of a new bride waiting for her husband.\n\nEarl Steim's jaw tightened. *That person called Grid... No matter how I think about it, he's just a scammer.*\n\nGrid was the hero who saved Winston from the Mero Company and previous lord, and the one who made the Sword of Self-transcendence that was a new heirloom in their family. Above all, he saved Irene's life.\n\nBut wasn't it just words?\n\nHe couldn't believe that the young blacksmith who made the best sword would be skilled enough in the sword to kill Malacus, one of the Eight Servants, and rescue Irene from the remaining Yatan followers.\n\nIt was impossible the more he thought about it. Perhaps Irene was deceived by him?\n\n*My daughter... You're being fooled by a scammer. You have no eye for men.* Earl Steim clenched his fist. *Grid! I will reveal that you are a scammer!*\n\n\"Lord Earl.\"\n\nA young man approached Earl Steim. His blond hair made him look like he was the protagonist of a romantic drama. His luxurious attire and elegant demeanor made it obvious that he was a noble.\n\nHis name was Bland de Ian. He was the son of Earl Ashur, lord of the south, and a disciple of Earl Steim. In addition, he was Irene's childhood friend. Having adored Irene since childhood, he was filled with greater anger and jealousy than Earl Steim.\n\n\"I've thought about it all night.\" Bland's voice was tight. \"That person called Grid is definitely a con artist.\"\n\nEarl Steim nodded. \"I was thinking the same thing. So let's wait for him to come. We will reveal the truth!\"\n\n\"Yes!\"\n\n***\n\nAfter a while, Earl Steim, Bland, and Irene waited for Grid with different feelings.\n\nGrid was delivered by a knight and kneeled down in front of Earl Steim.\n\n\"I greet the great lord of the north, Earl Steim.\"\n\nGrid usually wore scruffy beginner's clothing, but he was worried about meeting nobles. On the way to the castle, he stopped by a clothing store and bought clothes worth one gold. But while the one gold clothes might seem luxurious for beginners, it looked cheap even for mid-level users, and the materials weren't good. In the eyes of the nobles, he was like a beggar.\n\n*His appearance is shabby.*\n\nIt wasn't just Grid's clothing. The forearms and shoulder muscles showed that his body was trained, but it wasn't at a special level. There wasn't one element where Grid was superior to Bland. Bland was sure of this.\n\nHe shouted, \"Who are you? Even if you are a commoner, shouldn't you know the basic etiquette?\"\n\nGrid made a mistake. Originally when greeting the nobility, it was etiquette to reveal his identity.\n\n*It was a mistake I made after not meeting nobles for a long time. But even so...*\n\nGrid looked at the noble with the name 'Bland' over his head.\n\n*Why is he wound so tight?*\n\nGrid was aware of the reason why he was brought here. He was the creator of the Sword of Self-transcendence and the hero who saved both Winston and Irene, so Earl Steim was probably going to reward his achievements. But instead of a warm welcome, he received this unpleasant reaction.\n\nHowever, he remained patient.\n\n*This isn't just any noble... Earl Steim might become my father-in-law so...*\n\nGrid smiled and corrected his mistake.\n\n\"The blacksmith Grid living in Winston greets the lord of the north, Earl Steim.\"\n\nEarl Steim nodded. \"Ah, yes. I have heard the story. Thus, I am glad to meet you. However... You introduced yourself as a blacksmith? I heard you are also an excellent swordsman.\"\n\nGrid humbly explained, \"I'm not a swordsman. My main vocation is a blacksmith, and my swordsmanship is just shallow.\"\n\n\"Huh, it must not be shallow if you manage to defeat Malacus. Shouldn't you be the best?\"\n\n\"I didn't defeat Malacus alone. It was with my colleagues.\"\n\n\"But isn't it true that you defeated dozens of Yatan followers? Irene was a direct witness.\"\n\n\"It is true but... The followers of Yatan were so weak that I could deal with them with my shallow fencing.\"\n\nEarl Steim's expression hardened. \"Hah... The followers of Yatan are weak? If they are so insignificant, how have they troubled the soldiers and people of this land for decades? Is it true that your opponents were the Yatan followers? In the first place, was it the Yatan Church who actually kidnapped Irene? Perhaps someone deceived Irene in order to make himself stand out?\"\n\nRather than being rewarded, Earl Steim was pushing the conversation in a strange direction. Grid grasped the situation.\n\n*Earl Steim, I sold you the Sword of Self-transcendence and saved your daughter's life, but you are making me out to be a con artist?*\n\nIt was very unpleasant. Anger flared inside Grid. He had tried to show humility because the other person was a noble. Grid's face turned red.\n\nIrene came forward. \"Father! What do you mean by that? Are you suspicious of Grid right now?\"\n\n\"That's right!\" Earl Steim snapped and got up from his seat. Then he spoke bluntly. \"Grid! I'm sorry, but aren't you too suspicious? You're the greatest blacksmith on the continent and the strongest swordsman at the same time? Common sense suggests that it isn't possible! First, I have to check if your swordsmanship is real or not. Bland!\"\n\n\"Yes, My Lord!\"\n\n*Chaang!*\n\nWhen Earl Steim called, Bland pulled out his sword like he had been waiting. Then he rushed towards Grid.\n\n*Yes, this is better.*\n\nHonestly, this method was better to resolve their doubts. Grid thought positively and pulled Dainsleif out of his inventory. He jumped forward.\n\n\"This is how it is! Yes, my swordsmanship isn't shallow! I will show you!\"\n\n\"Are you prepared? I will defeat you now!\"\n\nBland jumped up and aimed his sword towards Grid's head.\n\n*Chaaeng!*\n\n\"...?!\"\n\nBland was perplexed. The striking force that had the weight of his body applied was rendered ineffective by that big sword in Grid's hand.\n\n*Che! I guess he trained up his strength and muscle development!*\n\nBland determined that it was difficult to compete with strength, so he used the repulsive force to spin in the air and land. Then he lowered his body as much as possible and attacked Grid's lower body.\n\nGrid stuck his greatsword to the ground. Bland's sword flying towards Grid's ankles was blocked by the greatsword.\n\n*He's good at fighting!*\n\nA chill went down Bland's spine. He was certain that Grid was a scammer due to his appearance, but what was this? He hurriedly moved as Grid drew up his feet. A kick.\n\n\"Cough...\"\n\nBland coughed out some gastric juices. Grid stood over him. \"You are like a kid who only fought in your house... No, I'm sorry to your sword.\"\n\n\"T-This guy...!\"\n\nNPC knights had a minimum level of 180. Among the knights, Bland was one of the most talented and had a level of 200. Yet he was overwhelmed by Grid who was only level 114. It was inevitable. Grid's stats were high enough to be considered level 200, and the items he used had a level limit of over 200. In particular, <span class=\"rarity-unique\">Dainsleif</span> was the strongest weapon. His stats, skills, items and combat experience made the difference in level meaningless.\n\nBut Bland was also a formidable presence. His father Earl Ashur was one of the best magicians in the Eternal Kingdom. He'd also inherited his father's talent for magic. That's right. He was a magic swordsman. It wasn't attack or defense magic, but buff and debuffs which were the most powerful in a one-on-one match.\n\n\"Sword's Grace! Armor's Will!\"\n\nBland's sword and armor started to shine blue. It was imbued with the power of magic. This wasn't the end.\n\n\"Storm's Fury!\"\n\nHeavy winds stirred around Bland. The wind magic increased the speed of his blade and provided a certain amount of shielding.\n\n*Now I will unconditionally win!*\n\nBland regained his confidence. \"I am the youngest son of the great magician, Earl Ashur! It is possible for me to use powerful magic! Hahaha! Can you go against Earl Steim's swordsmanship and my father's magic?\"\n\n\"Earl Ashur...?\"\n\nGrid's face distorted at that moment.\n\nEarl Ashur! Who was he? He was the lord of the fortified city Patrian, and the one who ordered Grid to find the Northern End Cave and obtain Pagma's Rare Book.\n\nAt the time, Grid was forced to take a quest that didn't fit his level and suffered for months. He experienced more than a dozen deaths, lost many items and became broke, increasing the risk of being chased after by the creditors. Grid had really wanted to quit the game. Logging into the game itself was like hell. He would rather go into the army one more time. An average person would've given up the game.\n\nGrid's only advantage was his patience, so he persevered and persevered until he finally found Pagma's Rare Book. But he wasn't greeted with a happy ending. All the reputation he built up with Earl Ashur and Patrian turned into infamy and he was killed by Earl Ashur's knight.\n\nAs a result of Earl Ashur, Grid was able to change to Pagma's Descendant and reverse his life, but that was all due to Grid's efforts. Grid was only filled with hostile emotions towards Ashur.\n\n\"Oho, you are Earl Ashur's son?\"\n\nGrid had promised several times that he would someday kill Earl Ashur. And now! He found a target that could get rid of some of that deep grudge. Bland in front of him had identified himself as Earl Ashur's son.\n\nBland was still unable to grasp the atmosphere.\n\n\"Hahaha! You are afraid after knowing my identity! But it is too late! You will be completely trampled on by me!\"\n\nBland grew up as a member of the nobility and was always victorious thanks to his outstanding talents. He was very confident in himself. He didn't think that the commoner in front of him could be stronger than himself.\n\n\"Lord of the Storm!\"\n\nBland's debuff magic aimed at Grid and strong winds started to press at him. Grid couldn't move even one hand. Bland smiled with satisfaction and rushed towards Grid, stabbing forward with his magic enhanced sword.\n\n> [A strong wind has suppressed your body. Agility will become zero for two seconds and you can't move.]\n>\n> [You have resisted.]\n\nGrid scoffed as he checked the notification window.\n\n\"Pagma's Swordsmanship.\"\n\n*Pagma? Pagma?! Don't tell me?*\n\nEarl Steim's eyes widened as he heard Grid's voice. Grid unleashed a dazzling sword dance.\n\n\"Link!\"\n\n*Jjejeong! Jjejejeok! Pepepepeok!*\n\nThe greatsword swiftly moved ten times, regardless of its heavy weight. Bland's attack was easily neutralized and the wind shield protecting Bland's body shattered. Even his armor strengthened by magic was torn apart.\n\n\"Kuaaaaak!\"\n\nBland couldn't believe it. How could this man move freely? And what was this beam of light?\n\n*Pipipipit!*\n\nBland's body was swept by the ten silver lights of different orbits, causing him to bleed and kneel down.\n\n*This can't be...! This is me! Me!*\n\nHe couldn't show this shameful image in front of the woman he liked and his respected teacher. Bland didn't want it to end like this. He wanted to get up and kill Grid right now. But his wounded body didn't move as intended.\n\nGrid snorted and turned his gaze towards Earl Steim. Then he straightened. \"With this, are there any doubts about my swordsmanship? Shall I show you my blacksmithing skills next? Huh?\"\n\n\"Yes! This is good! Okay! I want to know everything about you! But before that!\" Earl Steim ran up in front of Grid. He grasped both of Grid's hands and pleaded. \"Grid! Please take my daughter as your bride!\"\n\nThe greatest blacksmith and swordsman in history. The name of this famous person was Pagma. Earl Steim had realized that Grid was Pagma's Descendant.\n\nAt this moment, Grid was the first to obtain the status of a noble's son-in-law from among the two billion users playing Satisfy. It was the position he failed to obtain in the past after being interrupted by Yura during Doran's quest.\n\n***\n\n**Glossary of Common Korean Terms.**\n\n**OG: Glossary Link.**\n\n**Current schedule: 20 chapters a week.**\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day**"
}