{
  "id": 117,
  "title": "Chapter 117",
  "content": "# Chapter 117\n\nThis was the best development for Grid.\n\n*Isn't this the perfect financial backer?*\n\nHe would become the husband of a lady. That meant authority. Access. The ability to skim taxes without anyone questioning it. Winston had grown into one of the Eternal Kingdom's premier cities. The revenue flowing through here was staggering. Even a fraction would make him wealthy. More than that, though—Irene was heir to a prestigious noble house. Marriage meant nobility. Real power. Not just gold.\n\n*I can grab both wealth and status at once. And beyond that...*\n\nIrene was pretty. Silver hair that caught the light. Eyes that curved upward when she smiled, which was often. A delicate nose. Everything about her radiated gentleness. Her reputation for kindness was well-earned. She was, by any measure, an exceptional woman. Her chest was a bit modest, but Grid wasn't going to complain.\n\nHe had no reason to refuse. Only one concern nagged at him.\n\n\"A moment ago, you thought I was a fraud.\" Grid watched Earl Steim carefully. \"Now you're offering me your daughter. Are you serious?\"\n\nEarl Steim's expression remained steady. \"Only one person in history combined supreme blacksmithing with supreme swordsmanship. That man was Pagma.\"\n\n\"...\"\n\n\"The sword dance you performed matches the legends describing Pagma's techniques. You're not a con artist. You are Pagma's Descendant.\"\n\n\"Being Pagma's Descendant is enough?\"\n\n\"More than enough! It's the entire reason!\"\n\nGrid shifted his gaze to Irene. Her face was flushed, but the smile playing at her lips suggested she was... amenable.\n\n*Hehehehe.*\n\nGrid's throat worked. After the disaster of his first love, he'd resigned himself to dying alone. But now—Irene! Some would laugh, call them NPCs, dismiss them as code. But Satisfy wasn't a game. It was another reality. These NPCs had emotions, thoughts, bodies that responded to stimuli. They were human in every way that mattered.\n\nGrid's eyes burned with unshed tears of joy.\n\n*I'm finally going to lose this damn virginity.*\n\nTwenty-seven years. Twenty-seven years of unwanted chastity were about to end. Status, wealth, and sex. All at once. He absolutely could not let this opportunity slip through his fingers. But there was a complication.\n\n*I want to marry her immediately and get started on the wedding night... but the class quest. And I still need to work at the smithy.*\n\nGrid cleared his throat. \"It's... an honor. To marry someone as beautiful and caring as Lady Irene. However, I have personal matters that require attention before we can proceed. Also, I'd like to continue blacksmithing after our marriage. Is it appropriate for a noble's son-in-law to work as a blacksmith?\"\n\n\"Pagma's Descendant is a blacksmith by nature. There's no shame in it. The opposite, actually. It's something to take pride in. We'll set the wedding date at your convenience.\"\n\n\"This can't be!\"\n\nBland, who'd been nursing his bruised ego in silence, finally snapped. \"My Lord! He's corrupt! Cursed by the gods! He'll resurrect after death. He'll never age! He's not human! Are you really going to make him your son-in-law?\"\n\n*Corrupt.* One of the terms NPCs used for players. From their perspective, users who didn't age or die permanently weren't human. They were aberrations, cursed beings. But not all NPCs saw it that way. Earl Steim didn't.\n\n\"Why is eternal life a curse? It's a blessing. I don't see corruption. I see beings favored by the gods. I'm pleased my daughter's husband has divine protection.\"\n\nBland's teeth ground together. \"Blessing? You're deluded! Imagine Irene aging alone while he stays young forever! Think of her loneliness, her grief! You're blinded by greed and ignoring Irene's happiness!\"\n\n\"It's their matter to resolve, not ours.\"\n\nIrene nodded. \"Sir Bland is correct. I do like Mr. Grid. His appearance might never change, but I can handle sadness or loneliness. I want to be with him.\"\n\n*Kwaduduk.*\n\nThe sound of Bland's composure cracking was almost audible. Over the past few years, he'd confessed his feelings to Irene multiple times. Each time, she'd rejected him gently but firmly. He'd accepted his fate, becoming her family's knight, content to watch over her from a distance.\n\nHe'd hoped she would find a good man someday. Someone worthy of her. But a corrupt being?\n\n*How is this possible? Does being Pagma's Descendant transcend even his cursed status?*\n\nPagma was legend incarnate. Bland understood that. But Grid wasn't Pagma himself. He was merely Pagma's heir. Surely that made him inferior. If Bland could defeat Grid, he could prove that Pagma's Descendant was separate from Pagma. Then maybe the Earl would reconsider.\n\nBland's hand found his sword hilt again. \"Grid! I challenge you to another duel.\"\n\nHe'd been careless before. This time would be different. Bland layered every buff he possessed onto himself. He merged the techniques Earl Steim had taught him with Storm Sword.\n\n*Kuwooooh!*\n\nThe tempest generated by Bland's magic sent decorations tumbling and carpets rippling. His blade glowed with raw power. The energy was so violent that Irene stumbled back, wincing.\n\n\"Sir Bland! Stop!\" Irene's voice cut through the chaos, but Bland was beyond hearing.\n\n*I'll defeat this bastard.*\n\nIt was his duty. His calling. To sever the connection that would bring the woman he loved nothing but misery.\n\n*Kwaang!*\n\n\"Ohhhhhh!\"\n\nBland's body shot forward, propelled by the storm. Grid's face twisted.\n\n*You want another beating? This kid doesn't learn.*\n\nGrid could use Restraint to freeze him. Could activate Fly to evade. Could summon pavranium to defend. Instead, he chose direct confrontation. He would show Bland the gulf between them so thoroughly that the knight would never try this again.\n\n\"Pagma's Swordsmanship, **Kill**!\"\n\n*Peeeeeong!*\n\nPure hatred condensed into Dainsleif. The blade met Bland's storm-wreathed sword head-on. The shockwave obliterated pillars. Interior walls crumbled. The ceiling collapsed in a shower of debris.\n\n\"Bland, you fool!\"\n\nThe blast had injured Irene. Earl Steim, barely managing to shield her, was livid. \"You wounded Irene! You've forgotten your duty! My own daughter—\"\n\nHe stopped mid-sentence. Bland lay crumpled on the floor, unconscious. Grid, meanwhile, stood unmarked except for a few torn edges on his clothing. Grid glanced at Irene in Earl Steim's arms and adopted an expression of remorse.\n\n\"Lady Irene was hurt because of me.\"\n\nEarl Steim shook his head. \"This isn't your fault. It's mine. I doubted you and triggered this disaster. I was rude. I apologize.\"\n\nAn apology. From a noble. Nobles didn't bow to those beneath them. Their pride wouldn't allow it. But Earl Steim valued responsibility over social hierarchy. He could admit fault.\n\n*Better father-in-law than I expected.*\n\nGrid allowed himself a small smile. \"If you're sincere, may I ask a favor?\"\n\nEarl Steim's eyes gleamed with something like respect. *He's not easily satisfied... truly the descendant of legend.* He approved of that ambition.\n\n\"You deserve compensation for creating the Sword of Self-transcendence and rescuing Irene. Yes. Whatever you want. I'll do my best.\"\n\n\"I heard you have connections to the Rebecca Church. I need to see the Pope. Could you write a letter of introduction? With your endorsement, he might grant me an audience.\"\n\nEarl Steim nodded. \"I understand. You defeated Malacus, after all. The Pope will welcome you gladly.\"\n\n---\n\nThe banquet was canceled due to the chaos. Grid left the castle with a marriage agreement and letter of introduction in hand. When he returned to Khan's smithy, someone was waiting.\n\n\"You Grid?\"\n\nA man. Powerfully built. Tattoos like claw marks striped both cheeks. Grey hair spiked upward as if electrocuted. His ID read **Toon**—one of six new rankers who'd recently joined the Tzedakah Guild after passing their strength trials.\n\nHis tone was pure command. \"Heard you're a great blacksmith. Make me a weapon. You know the guy who destroyed the Giant Guild in the streets? I want to fight him, but I need better gear first. So make me something good. I'll use it to crush that helmeted bastard. *Kyaaack*—\" He spat. \"*Ptoo.*\"\n\nA gangster. That's all Grid could think. This punk spat while talking, just like the loan sharks from Mother's Heart is Happy who'd made his life hell. Grid's glare could have melted steel.\n\n\"Do you know where you're spitting?\"\n\n\"Hah? Hahaha!\"\n\nToon blinked. He checked the guild roster. The blacksmith was barely level 100. Cute.\n\n\"Listen, blacksmith. Your skills are great, so you can join any guild you want. But me? I joined to get close to that butcher. Once I fight him, I'm gone. Understand? I'm not kissing your ass like the others. Make me a weapon before I kill you. Got it? *Kyaack.* Spit.\"\n\n\"...\"\n\nThe six new members didn't know Grid was the helmeted figure. The guild leadership hadn't trusted them with that information yet.\n\n\"Hey, you know that butcher's ID? The other members won't tell me no matter how much I ask. Why keep it secret? Just makes it harder to track him down. *Kyaaack.*\" Spit.\n\nGrid's patience evaporated.\n\n*Damn it.* He was exhausted from playing nice in front of nobles. Now this asshole shows up. \"Hey, you little [email protected]#$.\"\n\nThis smithy was sacred ground to Grid. Where his connection with Khan began. Where he'd started earnestly pursuing blacksmithing. Where memories accumulated like layers of steel, folded and refolded. His place of power. He couldn't tolerate someone defiling it.\n\nHe drew the Ideal Dagger. \"You'll be punished for desecrating my workspace.\"\n\n\"Pfff!\" Toon grabbed his stomach, laughing. \"Puhahaha! This blacksmith's actually angry! Sacred workspace? Kuhahaha! I'll kill you once!\"\n\n*Clink.*\n\nToon snapped his right hand forward. Three blades sprang from the wrist mechanism. He closed the distance with murder in his eyes.\n\n\"You pull a weapon on me? Die.\"\n\nHe meant it. Toon intended to kill Grid once to shut him up permanently.\n\n*Chaaeng!*\n\nToon's wrist blades slashed toward Grid's chest like a beast's claws. Grid blocked with the Ideal Dagger and was forced halfway down.\n\n*Three times? Four times stronger?*\n\nGrid couldn't process it. Since the Malacus raid, his strength had climbed steadily. Crafting unique and legendary items. Repeated level-ups. His strength exceeded 1,000 now. He'd thought himself competitive with anyone in raw power.\n\nBut against Toon, he was being overpowered.\n\n*Kikik! Kkikikik!*\n\nThe dagger trembled as the wrist blades pressed down. Grid stepped back as the longest blade touched his chest. He angled the dagger, redirected the force, and created separation.\n\n*I can't win a strength contest.*\n\nGrid knew he was strong. Stronger than Ibellin had been before obtaining the Thorn of Deep Grievance. Ibellin lost to the Giant Guild. Grid had demolished them. But he'd never properly tested himself against the top-tier guild members. He didn't know where he stood against actual rankers. And Toon was ranked 40th globally.\n\nToon whistled. \"*Hwiik.* What, you actually blocked that? Not bad.\"\n\n*Ssik.*\n\nThe corners of Toon's mouth curled upward. He'd assumed Grid was just a blacksmith. This was more interesting.\n\n\"I like this!\"\n\n*Flash.*\n\nToon's eyes turned red. Grey fur sprouted across his muscular frame. An explosive pressure radiated outward. Grid's body tensed involuntarily.\n\n*What monstrous power...*\n\nGrid reached for his inventory. Dainsleif. The Frostlight Orc Chief's Helmet. Everything.\n\n*Peeeong!*\n\nA kick came from the side. Toon flew backward.\n\n\"Cough!\"\n\n*Kwaduduk.*\n\nBones broke. Toon's eyes rolled back as he hit the floor.\n\n\"Crazy... bastard!\" After the cursing, Toon turned to identify his attacker. Regas stood there, smiling. \"What the hell, Regas? A coward's surprise attack from behind? I thought you were a Taekwon Master.\"\n\nSarcasm dripped from Toon's voice as he glared.\n\n\"Toon.\" Regas' smile didn't waver, but his tone dropped several degrees. \"If you disrespect Grid one more time, you'll lose your head.\"\n\nRegas was always friendly, always grinning. This was the first time Grid had seen him genuinely angry. Even Toon looked unsettled.\n\n*The guy everyone says is mild-mannered... his rage is terrifying.*\n\nToon stood slowly. His bizarrely twisted waist straightened itself. Phenomenal recovery. He retracted the wrist blades.\n\n\"Taekwon Master Regas. We'll fight someday, but not now. That blacksmith is more surprising than expected. Two against one? Too much trouble. See you later.\"\n\n\"Hey, you bastard! Clean up your spit before you leave!\"\n\nRegas caught Grid's shoulder as he moved to chase Toon. \"He's strong in beast form. Hard to fight without preparation.\"\n\n\"I don't care! I'll beat him senseless right now! And why did we even accept him into the guild? His behavior is completely unacceptable! Don't we screen people?\"\n\n\"His thinking is simple. Jishuka can control him. But forget about that.\" Regas' expression brightened. \"I found the Divine Shield.\"\n\n\"...!\"\n\nRegas had been searching since the theft. He'd finally located it. Grid forgot about Toon entirely. \"Where? Where is it?\"\n\nRegas' expression dimmed. \"One of Rebecca's Daughters has it. I tried to meet her. She refused. She seems... unwilling to return the shield.\"\n\n\"Rebecca's Daughter?\"\n\nGrid remembered the girl in the blue dress. The one who'd burst through the wall to confront the Yatan follower who'd stolen the Divine Shield. *Her name was Isabel, I think. The Yatan follower looked shocked when he realized she was Rebecca's Daughter.*\n\n\"What's a Rebecca's Daughter?\"\n\nRegas explained. \"It's the title for the top three paladins in the Rebecca Church. Goddess Rebecca personally granted them sacred weapons. Their power supposedly rivals the Second and Third Servants. The church is relatively small, but thanks to Rebecca's Daughters, few dare threaten them.\"\n\n\"So... she won't return my shield?\"\n\n\"Correct.\"\n\n\"...\"\n\nGrid's head pounded. He needed to meet the Pope. Now this complication with Rebecca's Daughter. He had a bad feeling about this.\n\nRegas smiled gently. \"Don't worry. You're part of the Tzedakah Guild. If you need help, call. Everyone will assist you. The six new members are especially eager.\"\n\n\"I've heard those six are called psychos. Looking at Toon, it doesn't seem like a lie. They seem useless.\"\n\n\"Haha.\"\n\nAfterward, Grid sent a whisper to Jishuka explaining the situation. She understood immediately.\n\n> [Whisper - Jishuka]: Of course your quest comes first. I won't ask you to make items for guild members until you're finished. If you need help, call anytime. I'll come running.\n\nThat night, Grid left Winston immediately. His destination: the Rebecca Vatican.\n\n---\n\n**Glossary of Common Korean Terms**  \nOG: Glossary Link  \nCurrent schedule: 20 chapters a week  \nCheck out my Patreon for early access to unedited chapters and goals for extra chapters. Early access chapters update after daily releases are complete."
}