{
  "id": 118,
  "title": "Chapter 118",
  "content": "# Chapter 118\n\nParties roamed Satisfy's major cities like beggars, their leaders shouting themselves hoarse.\n\n\"Need priest for Dunpapa! Two minutes!\"\n\n\"Level 150 party, priest slot open!\"\n\n\"Priest! Priority on drops! Please!\"\n\nThe same scene played out in every plaza, every tavern, every marketplace. Priests serving Rebecca, Goddess of Light, were the only class capable of casting Heal. Without them, raid parties crumbled. Dungeon runs failed. Players bled gold hiring NPC clerics from the temples.\n\nThe Rebecca Church understood the market perfectly. Their donation boxes overflowed with coin.\n\nMost users avoided the priest class entirely. The restrictions were brutal. No dating. Days spent in prayer. Mandatory fasting. Vows of silence. Players joked that becoming a Rebecca priest meant joining a monastery in a fantasy game.\n\n*Who wants to starve and stay celibate in a video game?*\n\nThe shortage persisted. The Church's wealth grew.\n\nAnd at the center of it all sat Pope Drevigo, the 13th to wear the golden crown.\n\n***\n\nIsabel pressed her palms against her ears. The sounds coming from the papal chambers made her skin crawl.\n\n\"The divine presence shakes his hips like a dog every night.\" The words came out flat, poisonous.\n\nCassus grabbed her shoulder. His fingers dug in hard enough to bruise. \"Quiet.\"\n\nShe jerked away from him. \"Then what should I say? Our pope is engaging in intercourse every night with—\"\n\nHis hand clamped over her mouth. Cassus's eyes darted toward the shadows in the corner, the cracks beneath the door. He leaned close and whispered against her ear.\n\n\"He has eyes and ears everywhere. Be careful.\"\n\nIsabel bit her lip until she tasted copper. *I can't speak in front of him. I can't even complain behind his back.*\n\nThe door burst open.\n\nPope Drevigo stood naked in the moonlight, sweat gleaming on skin that should have sagged with age but didn't. At nearly sixty, he maintained the body of a man half his years. The scent of perfume and sex wafted through the doorway.\n\n\"It's noisy out here.\" His voice carried an edge beneath the pleasant tone. \"Were you cursing me?\"\n\nIsabel and Cassus dropped to their knees, heads bowed.\n\n\"It is great to see Your Holiness.\"\n\nThe Pope crossed the room. His hand slid into Isabel's hair like a serpent. She froze. Every muscle locked tight. Her jaw clenched so hard her teeth creaked.\n\n*Shake him off. Do it.*\n\nShe couldn't. The brainwashing ran too deep. Loyalty to Rebecca. Loyalty to the Pope. The mantras beaten into her skull since childhood.\n\n\"You look as beautiful as ever, Isabel.\"\n\nShe forced words past the bile rising in her throat. \"Your Holiness, surely you are busy with those prostitutes in your bed? Is it okay to leave them?\"\n\nHis smile widened. He released her hair. \"No matter your position, isn't that a bit much?\"\n\nShe said nothing.\n\n\"I've discovered why the Yatan Church wants the Divine Shield.\" He began pacing, hands clasped behind his back. \"Dark magic can be imbued into the shield. The divine power converts to demonic power. They intend to turn our weapon against us.\"\n\n*Finally. Something that matters.*\n\n\"We must prevent them from obtaining any Divine Shield.\" Isabel's voice steadied when discussing strategy.\n\n\"Recall them all.\"\n\nThe Church had distributed the production method to allied kingdoms and noble families. But a Rebecca priest was required for the forging process. Every Divine Shield ever made existed in their records. Who made it. When. Where. For whom.\n\nIsabel straightened. \"I'll direct the paladins to collect every shield from each family and country.\"\n\n\"Let others handle that grunt work.\" The Pope's expression shifted. Something darker slid behind his eyes. \"I have a special task for you.\"\n\nDread pooled in her stomach. \"Your Holiness?\"\n\n\"I received a divine message last night.\" He spoke the words like a judge pronouncing sentence. \"Goddess Rebecca said one of her daughters will betray me. Soon.\"\n\nThe temperature in the room dropped. Isabel's breath caught.\n\n*What?*\n\n\"Get Rin.\" The Pope's smile never reached his eyes. \"She is the traitor the goddess warned me about. I intend to punish her.\"\n\n\"No.\" The word ripped out before Isabel could stop it. \"Rebecca's Daughters are loyal only to Goddess Rebecca and Your Holiness! There are no traitors among us!\"\n\n\"Rin has ignored three summons. Three.\" He held up fingers. \"What reason could she have unless she's plotting betrayal?\"\n\nRage burned through the brainwashing, through years of conditioning. Isabel surged to her feet.\n\n\"She must have a reason! Your Holiness, are you certain about this divine message? I didn't know you could hear divine messages!\"\n\n\"How presumptuous!\"\n\nHis hand locked around her throat. He lifted her until her toes scraped the floor. His grip crushed her windpipe. Stars burst across her vision.\n\nThe Pope's face pressed close to hers. \"My will is the will of Goddess Rebecca. Do you distrust me?\"\n\nThe conditioning slammed back down like an iron cage. Years of indoctrination. Obedience beaten into muscle memory.\n\nShe choked out the words. \"I believe you.\"\n\nHe released her. She collapsed, gasping.\n\nThe Pope's smile returned, friendly and terrible. \"You have two days. Bring Rin back here.\"\n\n**Kwang!**\n\nThe door slammed behind him.\n\nCassus waited until the footsteps faded. He knelt beside Isabel and reached out slowly, carefully. \"What will you do?\"\n\nShe stayed silent for a long time. When she finally spoke, her voice came out hollow.\n\n\"What can I do? I have to obey.\"\n\n*Rin would never betray us.* The thought echoed in the empty space inside her skull. *The Pope is garbage. The Church is rotten. Rin probably just needed to escape for a while.*\n\nIsabel knew. She understood completely.\n\nIt changed nothing.\n\nCassus turned toward the window. Moonlight illuminated his face as he pressed his palms together.\n\n*Goddess Rebecca, please send divine punishment toward the corrupt Pope.*\n\nHis prayer disappeared into the night, unanswered.\n\n***\n\nFour days had passed since Grid left Winston.\n\nIn those four days, he'd reached Level 130.\n\n\"This is great.\" Grid grinned at the horde gathering around him.\n\n**Grrrung.**\n\nThe border between the Eternal Kingdom and Saharan Empire cut through the Suaz Mountains. Dozens of monsters surged toward Grid from every direction, drawn by the scent bleeding from Malacus' Cloak. The bloody smell worked like a dinner bell.\n\nFor four days straight, Grid had been wearing the cursed item. The results spoke for themselves.\n\n\"Haap!\"\n\nThe mobs here averaged Level 160. Grid no longer needed skills to handle them. He practiced pure swordsmanship instead, cutting through monsters one by one like wheat before a scythe.\n\n**Kuaaak!**\n\n**Yip! Yelp!**\n\nHis body moved according to his will now. Stats pushed him past human limitations. Techniques impossible for him as a warrior flowed naturally from his hands.\n\n**Sukakak!**\n\nGrid launched himself into the air, both hands gripping Dainsleif. He spun three times, building centrifugal force, then brought the blade down through an eti's spine. The creature exploded into pixels.\n\nA troll's axe whistled toward his head from beyond the eti's corpse.\n\nHe twisted. The axe passed close enough to feel the wind. An ogre attacked from his left. Three rocks flew at him from behind. Trees blocked his right flank. The troll swung again even as blood fountained from its neck.\n\n**Chengkang!**\n\nGrid ducked the second swing and jumped right. He used the ogre's axe as a stepping stone, vaulted over its head, and shattered all three rocks with a single horizontal slash of Dainsleif. He landed in the center of the stone-throwing etis before they could react.\n\n**Papat! Pa pa pa pa!**\n\nThe dark blade carved unpredictable patterns through blue flesh. His cloak flapped and swirled, destroying sight lines. By the time the etis recovered their vision, they were dead.\n\nGrid sprinted after the fleeing survivors. He drove Dainsleif through an eti's heart, then hurled the dying monster at a gargoyle descending from above.\n\n**Peok!**\n\nThe gargoyle kicked the corpse aside, irritated.\n\nGrid activated Fly. He shot upward and stopped directly above the gargoyle's head.\n\n\"Hello.\"\n\n**Kyaack!**\n\nThe gargoyle shrieked. It fired a petrification beam point-blank. No room to dodge at this distance.\n\nGrid kept flying straight at it. The gargoyle's cry turned triumphant.\n\nThe beam struck him dead center. Grid didn't turn to stone. He didn't even slow down.\n\nConfusion flashed across the gargoyle's face in the half-second before Dainsleif took its head.\n\n\"Hahat!\"\n\nGrid was laughing. More monsters on the ground meant more experience. More levels. He could feel himself growing stronger with every fight.\n\n*This is what progression feels like.*\n\n\"Let's go!\"\n\nHe pulled pavranium from his inventory. Four days of constant practice had improved their synchronization dramatically. The golden discs no longer just defended. Now they attacked in response to his intent.\n\n**Pipit!**\n\nThe discs moved like boomerangs, slicing through an ogre's Achilles tendons. The massive creature crashed down. Grid pounced on it. The one-sided slaughter continued.\n\nMore monsters arrived, drawn by Malacus' Cloak. The sun crawled across the sky and died. Night fell.\n\n\"Heok... heok...\"\n\nGrid's Stamina and Strength stats were absurd. Even he had limits. After hunting hundreds of monsters throughout the day, exhaustion finally caught up.\n\nHe peeled off the bloody cloak and collapsed. The night sky stretched above him, close enough to touch. Stars burned like distant forges.\n\n*It would be nice to keep leveling while moving in the cloak. But creatures swarm from everywhere. Travel speed drops to nothing.*\n\nHis class quest required visiting the Judar Church, the Dominion Church, the Yatan Church, and the Rebecca Church. The quest chain would take considerable time. He couldn't afford to waste it.\n\n*Should I take off the cloak tomorrow?*\n\nGrid weighed his options. The answer came quickly.\n\n*I can't wander around often. After this quest, I need to get married. Work at the smithy. Handle guild business. Yes. Take advantage of it now.*\n\nThe next morning, he put Malacus' Cloak back on. The hunt resumed.\n\nThe Suaz Mountains normally took three days to cross. Grid spent an entire week making the journey, stopping every few hours to slaughter the monsters that swarmed him.\n\nHe enjoyed every moment.\n\nBut somewhere else, someone was suffering because of his absence.\n\n***\n\n\"Grid... when are you coming back?\"\n\nKhan's smithy felt emptier than usual despite the NPCs working the forges. A bald man squatted in the corner near the entrance, staring at the door like a dog waiting for its master.\n\nVantner muttered the same words he'd been repeating for days. \"Grid... come now... hurry... come back...\"\n\nIt was finally his turn. After waiting so long, Grid was supposed to make him equipment. Instead, the bastard had vanished on some quest. Ten days. Ten whole days without word.\n\n\"Why? Why on my turn?\"\n\nPon and Ibellin were out leveling with their new Grid-made weapons. Pon had pulled far ahead. Ibellin was catching up to Vantner's level.\n\n*Everyone else got their gear. Everyone except me.*\n\n\"Please come back soon!\"\n\nOther guild members arrived with items for Khan to repair. They spotted Vantner in his corner.\n\n\"Why is he acting like that?\"\n\n\"He saw Pon and Ibellin sweeping monsters with their new weapons. After that, he couldn't bring himself to go hunting.\"\n\n\"Isn't he in a better situation than us? Grid already enhanced his axes through appraisal.\"\n\n\"Still, he can't hunt in level-appropriate zones. His defense is too weak.\"\n\n\"That's his own fault. He's a guardian knight who dumped every stat point into Strength. Only cared about weapons. Now it's screwing him.\"\n\nThe next time Jishuka visited the smithy, Vantner cornered her with a proposal.\n\n\"Next time Grid goes on a quest, all guild members should go with him.\" The words tumbled out in a rush. \"We'll help him complete it faster. Then Grid won't waste time and can focus on making our items.\"\n\nJishuka studied him. \"Grid should also enjoy playing the game.\"\n\n\"He's a blacksmith! He should do his duties!\"\n\nShe said nothing. What could she say?\n\nVantner's heart remained locked on the smithy, waiting, always waiting, for Grid to return and forge his armor."
}