{
  "id": 119,
  "title": "Chapter 119",
  "content": "# Chapter 119\n\nThe Suaz Mountains fell behind Grid as he descended into Rolling. The village was small, barely worth the name, but it sat only half a day's walk from the Vatican itself.\n\n\"Rebecca statues everywhere.\"\n\nEvery street corner. Every shopfront. Every residential doorway. Large and small, the stone likenesses of the Goddess stared down at him. Grid couldn't turn his head without finding one or two watching.\n\n*Makes sense. The Vatican's close by, so the whole village probably worships her.*\n\nA cat meowed nearby.\n\nGrid leaned against one of the statues, letting the warm sun wash over him. Cats lounged in patches of light. Merchants and residents moved through their daily routines without urgency. Even Grid felt the calm seep into his bones.\n\n*Different from Winston. This place feels like a resort.*\n\nA hum escaped his throat as he wandered the village with an unburdened heart.\n\nThen reality struck.\n\n*Am I crazy?*\n\nHe needed to finish this quest. Fast. Tourism was a waste of time.\n\n*I've been getting lazy lately.*\n\nGrid knew exactly what happened when people got lazy. Debt. Endless, crushing debt. The trauma made his skin crawl. He quickened his pace toward the smithy, irritation mounting with each step.\n\n> [The effect of mastering 'Blacksmith's Craftsmanship Skill' is activated. Blacksmith NPCs whose craftsmanship skill is beyond the intermediate level will treat you in a friendly manner.]\n\n> ['Pagma's Descendant' class effect is activated. Blacksmith NPCs whose craftsmanship skill is at the advanced level will recognize you and worship you.]\n\nNotification windows he hadn't seen in weeks appeared as he stepped inside. He'd been holed up in Winston, only entering Khan's smithy. Was Rolling's blacksmith intermediate or advanced? Grid wanted to be admired.\n\nHowever...\n\n\"Welcome!\"\n\nA young blacksmith approached. Unfortunately, just a beginner by the look of him. Unable to distinguish Grid from any ordinary customer.\n\n\"Is there anything you're looking for?\"\n\nGrid's shoulders slumped. \"I want to repair my items.\"\n\n\"Yes, I'll repair them for you.\"\n\nGrid doubted his ears. \"What? *You'll* repair my items?\"\n\nA beginner blacksmith was going to repair the items of a legendary blacksmith?\n\nGrid scoffed. \"You're either brave or ignorant. You don't even know who I am.\"\n\n\"Huh?\"\n\n\"Hey, hey. Cut it out.\" Grid waved a dismissive hand. \"I'm a blacksmith, so I'll fix my own items. Can I borrow your furnace? I'll pay a fee.\"\n\nThe blacksmith, Rector, studied Grid with caution. \"Are you really a blacksmith?\"\n\nSteel gauntlets. Black iron boots. Heavy armor. Grid looked like a warrior at first glance, not a craftsman.\n\nGrid clicked his tongue. \"You doubt I'm a blacksmith? Poor guy. You can't even recognize a great blacksmith when one stands in front of you.\"\n\n\"W-What?\"\n\nRector was only twenty years old. Young, yes, but old enough to understand when someone insulted him. His face reddened.\n\nGrid felt a twinge of guilt. He cleared his throat several times. \"But who can tell the future? Your eyes might be rotten now, but they can be trained. Watch me. This is a rare chance. You should thank Goddess Rebecca for letting you meet me and see how I work.\"\n\n\"...?\"\n\nGrid didn't wait for permission. He approached the furnace and started lighting it.\n\n\"Hey! You'll be burned if you do that... Huh?\"\n\nRector's eyes went wide. Grid had raised the blast furnace's temperature in seconds.\n\n*Handling the fire so freely? How is that possible?*\n\nEven his father, an intermediate blacksmith who'd died two years ago, couldn't manipulate fire as easily as this stranger. Grid moved like he *was* the fire. Rector stared, admiration building as Grid pulled a hammer and anvil from his inventory. Then he began repairing his items one by one.\n\n> [The durability of the <span class=\"rarity-uncommon\">Ideal Dagger</span> has been maximized.]\n\n> [This is an item you created. Your understanding is 100%.]\n\n> [The durability of the <span class=\"rarity-epic\">Best Gauntlets</span> has been maximized.]\n\n> [This is an item you created. Your understanding is 100%.]\n\n> [In the case of items made by you, a penalty will be applied if you don't meet the item usage requirements, even if you have full understanding.]\n\n> [The durability of <span class=\"rarity-epic\">Khan's Masterpiece</span> has been maximized.]\n\n> [Your understanding of Khan's Masterpiece is at 100%. You have learned the production method and can use it without any penalties.]\n\n> [The durability of <span class=\"rarity-unique\">Dainsleif (Reproduction)</span> has been maximized.]\n\n> [Your understanding of Dainsleif (Reproduction) has increased from 3% to 31%.]\n\n> [The durability of the <span class=\"rarity-unique\">Frostlight Orc Chief's Helmet</span> has been maximized.]\n\n> [Your understanding of the Frostlight Orc Chief's Helmet has increased from 7% to 85%.]\n\n> [The durability of <span class=\"rarity-unique\">Braham's Boots</span> has been maximized.]\n\n> [Your understanding of Braham's Boots has increased from 3% to 6%.]\n\nUnderstanding an item. A concept that only existed for Pagma's Descendant.\n\nPagma's Descendant could increase their understanding of an item by using it, appraising it, repairing it, or disassembling it. At 100% understanding, they could freely use items. It was even possible to learn the production method.\n\nIf Dainsleif's understanding reached 100%, Grid would be able to produce Dainsleif. However, the higher the rating and usage conditions of the item, the slower the comprehension. Therefore, it was still unclear when he'd master it.\n\n*But the Frostlight Orc Chief's Helmet has high understanding already. Hmm, should I try for 100%?*\n\n*Kaaang!*\n\nGrid placed the perfectly repaired helmet on the anvil and started hammering again.\n\n*He's crazy.*\n\nRector watched in amazement and growing concern. Grid suddenly attacking the perfectly fine skull helmet looked like the actions of a madman. And...\n\n*Kaaang! Kaaang!*\n\nThanks to Grid's relentless hammering, the Frostlight Orc Chief's Helmet shattered into pieces.\n\n*Why is he destroying a perfectly good helmet? He's too violent.*\n\nRector misunderstood. He thought Grid was destroying it, but Grid was actually using the Legendary Blacksmith's Disassembly skill to break it down and reassemble it.\n\n\"Putting the wires in the seams like this...\" Grid muttered, examining fragments. \"It's sloppy. I'll need to supplement this part.\"\n\nGrid grasped the helmet's structure perfectly and began reassembly. It wasn't a simple reconstruction. He corrected the helmet's flaws as he worked. The Frostlight Orc Chief's Helmet returned to its original shape in minutes.\n\n> [Your understanding of the Frostlight Orc Chief's Helmet has increased to 100%.]\n\n> [From now on, you can use the Frostlight Orc Chief's Helmet without any penalties.]\n\n> [The production method of the Frostlight Orc Chief's Helmet has been acquired.]\n\n\"Perfect.\"\n\nGrid equipped the helmet with a satisfied expression.\n\n> [Due to your class characteristics, you have equipped the Frostlight Orc Chief's Helmet.]\n\n> [You don't meet the conditions to use the item. However, your understanding is 100%, so no penalties will be applied.]\n\n> **[Frostlight Orc Chief's Helmet]**\n> \n> Rating: <span class=\"rarity-unique\">Unique</span> (Set)\n> \n> Durability: **290/290** Defense: **190**\n> \n> * The chance of suffering a critical blow is reduced by **25%**.\n> * Health will increase by **15%**.\n> * Has a certain chance to cast fear at the target.\n> * **Frostlight Orc Chief's Set Effect:**\n>   - 3 set items equipped: Strength **+50**, Stamina **+80**.\n>   - 5 set items equipped: Strength **+100**, Stamina **+200**, can transform into the frostlight orc chief.\n> * **Frostlight Orc Chief's Transformation:**\n>   - It is possible to command the frostlight orcs.\n>   - The skill 'Rotation Cut' will be generated.\n> \n> *The frostlight orc chief can be described as the ruler of the northern snowfields. This helmet, which he loved, was made from the skull of a snowy ogre and has a terrible appearance. In particular, the horn on the left has a very threatening appearance. Just wearing this helmet can cause fear.*\n> \n> *Originally there was a sense of crudeness, but a craftsman with great talent and potential had reassembled it, complementing the weaknesses and enhancing the function.*\n> \n> Conditions of Use: Level 150 or more. More than **400** Strength.\n> \n> Weight: **800**\n\n\"Truly great.\"\n\nGrid admired the improved performance. He turned to Rector, still wearing the helmet.\n\n\"How about it? Don't you think this helmet is somewhat cool?\"\n\n\"H-Hik...\"\n\nRector went pale. The bizarre skull helmet was terrifying.\n\nGrid saw his expression and sighed. \"Seems to be my mistake. Damn, I need to replace this helmet quickly.\"\n\nHe grumbled as he approached Rector and handed over 10 silver.\n\n\"Did you watch me well? You should start practicing from now on, trying to recall how I used the bellows and my hammering. Perhaps we'll see each other again. Your skills might be low now, but you might become an intermediate blacksmith after ten years of practice.\"\n\nGrid was joking. He never imagined Rector would take his words seriously.\n\nGrid left the smithy.\n\nAfter a while, Rector jumped up. He locked the smithy's door and followed Grid's advice, practicing his handling of the bellows and hammering.\n\nLater, Rector, who was inherently gifted, became an advanced blacksmith representing the area. He often told his disciples the story of how he met Grid.\n\nBut Grid didn't know this.\n\n***\n\nThe village center.\n\nGrid stood before the Rebecca Temple, amazed.\n\n*Gold?*\n\nThe temple was small compared to others in the area. A single story building, less than a hundred square meters. But the outer walls were painted gold, shining brilliantly.\n\n\"Is there any way to get this...?\"\n\nGrid glanced around at the other people before scratching at the gold with his nails. But no matter how hard he scratched, not one speck of gold dust fell.\n\n\"How rotten and dirty.\"\n\nGrid didn't give up. He refused to miss an opportunity for free gold. His obvious scratching revealed him as a first-time visitor to Rolling. A middle-aged priest spotted him and gave a meaningful smile.\n\n*It's been a long time since I've seen a sucker.*\n\nThe priest's ID was Dong Pao. He was a Chinese user. He'd followed the rigid laws of the Rebecca Church: forbidding love, forced silence, and fasting. He'd managed to raise his level to 160.\n\nHe grinned and approached. \"Brother, is this your first visit to Rolling?\"\n\n\"...!\"\n\nGrid flinched from where he squatted in a corner, scratching at the gold. *I'm not a thief!* He laughed loudly while trembling.\n\n\"Ah! Yes! It's my first time here! Oh, this temple is so beautiful! It reminds me of the beautiful Goddess Rebecca! Hahaha! Yes?\"\n\nThe person who'd suddenly greeted him wore the clothes of the Rebecca Church. Grid had been so worried about being called a thief that he hadn't noticed until now. The priest in front of him was a user, not an NPC.\n\n*First time I've seen a priest user.*\n\nGrid had heard rumors about how difficult it was to become a Rebecca priest. In fact, all Rebecca priests Grid had met since playing Satisfy were NPCs. So it was surprising that the middle-aged priest before him was a user.\n\n*His ID is Dong Pao... Chinese...*\n\nThe ID was somewhat appetizing. Grid made a mental note to visit a Chinese restaurant today with his family and eat Dongpo pork.\n\n\"Are you a monk in reality? How did you manage to clear the Rebecca Church's class change quest?\"\n\nDong Pao laughed heartily.\n\n\"In reality, I'm just an ordinary person. However, in Satisfy, I succeeded in suppressing all desires while thinking that I only want to serve Goddess Rebecca. Then I was able to become a priest of sacred light.\"\n\n\"Wow. I don't know about anything else, but staying silent seems pretty hard. Well, I can't date anyway... No, I don't want a relationship, but it'll be hard to withstand the silence and fasting. Weren't you supposed to stay silent for twenty days? How did you manage it? And even if you succeed in the priest class change quest, don't you have to perform quests often to keep the position? It's great that you could endure all of that.\"\n\nThe original Grid was indifferent to other people's matters. But this was his first experience meeting a priest user, so he was naturally interested. When he'd been in a bad situation, he became sick when he saw others doing well. Now he'd paid off his debt and was running along a path of success, so he could praise others.\n\nDong Pao smiled.\n\n\"It was difficult to remain silent. But when I prayed to Goddess Rebecca, the time passed quickly. The act of praying itself raises the divine power stat, so if you think about it positively, it's good to be disciplined. But what brings you to Rolling? There's no special hunting ground or sightseeing spots besides the Vatican, so most people who visit here have business in the Vatican.\"\n\n\"I'm on my way to the Vatican. I need to meet the pope for a quest.\"\n\n\"Hah... His Holiness?\"\n\nDong Pao's eyes sharpened at the words.\n\n*Someone who isn't part of the Rebecca Church is on a quest to meet the pope? Even I've only seen the pope from afar. It seems like he's on an S-grade or higher quest.*\n\nDong Pao observed Grid's equipment closely.\n\n*The armor and gauntlets are ordinary... That cloak is garbage... The only accessory is a ring that looks simple... But the boots are tremendously expensive. Yes, he must be high level.*\n\nRolling was far from the center of the continent. It was difficult to reach without being high level because the roads were treacherous and full of monsters. Dong Pao was pleased at the thought of Grid being a high-level user.\n\n*He'll have high value.*\n\nDong Pao's eyes curved into crescents as he suggested to Grid, \"I'm also on my way to the Vatican. Do you want to accompany me?\"\n\nIf a healer accompanied him, how much money would he save on potions? Others had to pay money to party with a healer, but he could party with one for free? Grid readily accepted.\n\n\"Of course I would like that.\"\n\nThe two formed a party. Grid was surprised when he saw Dong Pao's level in the party window.\n\n\"Level 160? I know that priest is a difficult class to level up, so isn't this level very high?\"\n\n\"There are many quests to be done, so there's no time to raise my level. However, due to the nature of the class, it's easy to find a party. I hunted with high-level parties and quickly raised my level. But Mister Grid... You're level 147? That's surprisingly low.\"\n\n\"Haha, I don't have much time to raise my level. I've only been able to raise it lately.\"\n\n\"Ah, yes...\"\n\nDong Pao made an uncomfortable expression.\n\n*He crossed the Suaz Mountains alone at this level? Did he avoid the ogres and gargoyles? He has good luck. Damn, I thought he'd be at least level 160.*\n\nDong Pao used his status as a priest to lure high-level travelers to a certain place that couldn't be logged out of. He made money by intimidating, killing, or ransoming travelers.\n\n*Level 147.*\n\nObviously, the higher the level of prey, the higher the ransom value. Level 147 was ambiguous. Higher than the average level, but not that high compared to rankers.\n\n*If he's level 147, he can recover the experience lost through dying by hunting. He won't pay a large amount of money for his life. Tsk, this is annoying. I'll have to make money by killing him and selling the boots.*\n\nThe two of them set off on a short journey to the Vatican. A group watched them from the village entrance.\n\n\"Dong Pao has started the game.\"\n\n\"Okay. We can follow slowly and eat up the profit.\"\n\nThree people. Assassin users who'd joined hands with Dong Pao. The fifth-ranked assassin Shay, the 11th-ranked Kerb, and the 13th-ranked Sniffer. The three of them had managed to assassinate a user who was 51st on the unified rankings, so there was no doubting their skill.\n\nGrid was the target of some dangerous players.\n\nBut Grid didn't know this. He was just excited at the thought of partying with a priest."
}