{
  "id": 12,
  "title": "Chapter 12",
  "content": "# Chapter 12\n\nIf I didn't join now, who knew when I'd get another shot at a Guardian of the Forest raid party?\n\nI straightened my shoulders. \"Let me join.\"\n\nThe plan was simple: survive until the Guardian died, then scoop up every piece of blue orichalcum that dropped. If the other party members died? Not my problem.\n\n*At least I can't lose experience if I die.*\n\nThe risk was real. If I got unlucky, I might drop Mamon's Greatsword or Mengel's Plate Armor, everything I owned. But blue orichalcum... that was worth gambling on. I locked eyes with Toban, pouring every ounce of desperate want into my stare.\n\nHis face twisted with confusion.\n\nToo brazen? Where was my shame supposed to be hiding?\n\nToban scratched his jaw. \"What's your level?\"\n\n\"Didn't you say level and class don't matter?\"\n\n\"I did, but...\" He gestured vaguely at the crowd behind him. \"Unexpected arrivals. Now I'm looking for people over level 120, preferably divine magic users or magicians. The Guardian's body is made of minerals. Physical attacks bounce off.\"\n\nHis gaze dropped to my greatsword. The disgust on his face spoke volumes. He didn't want me.\n\n*This bastard shouldn't have said he'd take anyone.*\n\nGive up? No. Not with blue orichalcum on the line. I'd claw my way into this party if I had to.\n\nI clasped my hands together. \"Please. I won't slow you down.\"\n\n\"What. Is. Your. Level?\"\n\nI was level negative three. Mamon's Greatsword and Mengel's Plate Armor boosted my actual combat ability to something like level 30. If I admitted level 30... instant rejection.\n\n\"Thirty... no, minus... no, plus one hundred.\"\n\n\"Thirty minus plus one hundred?\"\n\n\"No, no. Just one hundred.\"\n\nTechnically, I would've been close to level 100 without Ashur's cursed quest dragging me down. Worth a shot. Once I got into the party, I wouldn't fight anyway. I'd stick to the edges like a dead mouse.\n\n*If I'm careful, they won't realize I lied.*\n\nToban frowned. \"Your weapon is a greatsword. Level 65 requirement, right? Even if it's epic rated, claiming you're level 100...\" He leaned closer. \"Are you really level 100?\"\n\n\"Of course.\" I kept my face blank. \"Mamon's Greatsword is enhanced to plus five. That's why I can still use it.\"\n\nPure bluff. I was exploiting the fact that items below plus five didn't change appearance. My plus zero greatsword masquerading as plus five.\n\nToban wasn't buying it.\n\n\"Even at plus five, still using Mamon's Greatsword at level 100...\" He looked me up and down. \"Your armor's worse than what level 100 users wear. And where are your boots? Gauntlets? Accessories?\"\n\nAccurate. Mengel's Plate Armor was only level 60. My helmet, boots, gauntlets, accessories... all lost during those three hellish months.\n\n*Items like my own blood...*\n\nThe boots and gauntlets had shattered from neglected durability. The helmet and accessories I'd actually maintained, but they dropped when I died anyway.\n\nThe memories burned. Toban's suspicious stare intensified.\n\nI straightened. \"People who don't need armor and accessories are those with excellent weapon control. Like me. I actually remove this armor when I hunt. Just the greatsword.\"\n\nControl. A word utterly foreign to my playstyle. I chugged potions like water. Real hunters on TV exploited monster attack patterns, fired off powerful skills while dodging. Me? I swung randomly and drank potions when my health bar dipped. That was hunting.\n\nBut I needed this bluff to work.\n\nHuge mistake. Toban wore full heavy armor and carried a shield.\n\n\"Oh?\" His smile didn't reach his eyes. \"So people who wear armor aren't skilled?\"\n\nThe temperature dropped. Righteous indignation radiated from the surrounding party members.\n\n\"He's saying armor is bad.\"\n\n\"Listen to this guy. Never wears armor.\"\n\n\"Armor and accessories aren't authentic? Guess we should strip naked...\"\n\nI raised my hands. \"That's not what I meant. I was explaining why I rely less on defense.\"\n\n\"So I shouldn't wear armor!\" A wild-looking, hairy middle-aged man shoved forward. \"Your level's lower than mine!\"\n\nHis two gleaming axes, armor, and ornate accessories screamed high-level user. His rage outpaced everyone else's.\n\n\"Grid? Never heard of you.\" He jabbed a finger at me. \"You hunt around here? I know how nasty the monsters are. You're confident enough to brag about hunting them naked?\"\n\nThe other party members nodded along.\n\n\"Must be new to the area.\"\n\n\"Ever seen someone called Grid?\"\n\n\"Never noticed him at the nearby hunting grounds.\"\n\n\"Sounds like crap. He's probably under level 100.\"\n\n\"Look at him. Died on a solo hunt and lost everything. Now he wants in the party because he's got nothing left to lose...\"\n\nThe atmosphere curdled.\n\n*Sharp people. Do I give up?*\n\nBefore I could retreat, a blond man with a bare upper body stepped through the crowd.\n\n\"Everyone stop.\"\n\nExcited whispers rippled outward.\n\n\"First ranked martial artist, Regas.\"\n\n\"Equipment requirements are brutal for his class, but he's already over level 180.\"\n\n\"Taekwon Master. Is it true his fists melt mobs?\"\n\n\"He actually came! This party was worth joining! Martial artists ignore defense and attack weak points. Won't that wreck the Guardian of the Forest?\"\n\nRegas caught my eye and approached. \"A greatsword is slow with wide movements. Dodging during battle isn't easy. Hunting without armor is impressive.\"\n\nHe looked good. Slim, ideal muscle definition, and the class requirement for a bare chest made him popular with women. Up close, he was genuinely handsome.\n\nStanding next to him, I felt like a squid.\n\nI hated handsome people on instinct. \"It's nothing special.\"\n\n\"Nothing special...\" His eyes gleamed. \"My expectations for your skills just increased. I'd love to see your abilities directly.\"\n\nHe turned to the others. \"This guy joins the party. Originally, we had no limits on class or level. Some members are below level 90. Adding one level 100 user isn't a problem.\"\n\n\"But—\"\n\nThe resistance continued. Regas cut them off.\n\n\"Only level 170 and higher users can properly damage the Guardian of the Forest. I gathered as many people as possible without a level limit because we need bodies to handle the crystal golems it constantly summons. My 17 guild members, including Toban and Vantner, will focus on the Guardian. We need people to tie up the golems. Grid's skills are sufficient.\"\n\nSilence.\n\n\"He wants to join. Why refuse? I understand doubting his actions, but why doubt people beforehand?\"\n\nThe words of the strong carried weight. The party members' hostility shifted toward grudging acceptance, but their intentions remained impure.\n\n\"Let's see how good his control is.\"\n\n\"Watch him fight. We'll know if he's a braggart.\"\n\n\"He hunts with armor off? Then he can't wear armor on this raid.\"\n\n\"I'll watch him closely.\"\n\nNot a Guardian of the Forest raid party. A Grid raid party.\n\n*I can't join this.*\n\nIf I joined now, I'd have to fight in front of them. As a level negative three player, I'd die instantly without ever seeing the Guardian, let alone blue orichalcum. Plus the humiliation.\n\nI stepped back. \"It's fine. I won't join.\"\n\nThe middle-aged man laughed. \"Just bluffing after all?\"\n\nAn attitude that dismissed people completely. But I didn't get angry. His words were true.\n\nMy voice came out cold. \"It's not smart to join a party that doesn't trust me.\"\n\nParty members should trust each other enough to watch each other's backs. Everyone here doubted me.\n\nThe party members shifted uncomfortably.\n\n\"Well... that's true.\"\n\n\"Now that I think about it, we got too excited and drove him away.\"\n\n\"Yeah. If I didn't know the truth, I should've stayed quiet.\"\n\n\"Right. Actually, weren't we the ones at fault? I feel bad.\"\n\nI didn't hold onto them any longer. Time to leave. Regas followed.\n\n\"What?\"\n\nMy tone was cold. Regas just offered his hand with a gentle smile.\n\n\"I hope to see you again, greatsword warrior who doesn't use armor. As someone walking the path of a martial artist, I'm very interested in you.\"\n\nI didn't doubt his sincerity. No bluff in those honest eyes.\n\nI shook his hand. *Why is he so naive?*\n\nA good person. Someday, if I got the chance, I'd make him a friend I could borrow money from.\n\n\"See you around.\"\n\nTake money from him later... no, I owed him. I flashed Regas a big smile and headed straight for the smithy."
}