{
  "id": 120,
  "title": "Chapter 120",
  "content": "# Chapter 120\n\nDong Pao's mind reeled.\n\nThe road from Rolling to the Vatican had always been peaceful. Rebecca's paladins patrolled it regularly, keeping thieves, monsters, and beasts at bay. It was one of the few genuinely safe routes on the continent.\n\nToday, that safety had shattered. Monsters poured out like water through a broken dam, swarming Grid and Dong Pao in endless waves.\n\n\"Pant... pant...\" Dong Pao wheezed, his lungs burning. \"So many... monsters...\"\n\nLess than an hour since they'd left Rolling, and they'd already slaughtered over a hundred creatures without respite. His mana pool had bottomed out multiple times, forcing him to chug expensive potions. Now his stamina threatened to give out entirely.\n\n\"Pant... pant! This is... wrong!\" He gasped out the words between healing spells, watching Grid butcher the lizardmen encircling them. \"I've walked this road... hundreds of times! Never seen... anything like this!\" His hands glowed with divine light as he cast Heal again. \"Why are there so many...?\"\n\nThey needed to travel fifteen more kilometers to reach the ambush point. But at this rate, the monsters would kill them both before they arrived. How many people had ever died to monsters in a safety zone? Perhaps he'd be the first. The unfairness of it made his throat tight.\n\nDespair crept through Dong Pao's chest.\n\nMeanwhile, the source of this chaos quietly removed his cloak.\n\n*I've got a healing shuttle. Unfortunately, time for a break.*\n\n> [<span class=\"rarity-unique\">Malacus' Cloak</span> has been unequipped.]\n\nThe cloak's bloody scent had drawn every monster within range. The moment Grid stuffed it into his inventory, the onslaught ceased. Dong Pao, still catching his breath and checking his mana reserves, failed to notice the correlation.\n\nGrid turned his attention to the remaining stragglers.\n\n*Kiyaaaaak!*\n\n> [You have defeated a Giant Salamander.]\n>\n> [Party leader 'Grid' has acquired Salamander's Gallbladder.]\n>\n> [Party leader 'Grid' has acquired <span class=\"rarity-rare\">Rare Pearl</span>.]\n>\n> [203,000 experience has been acquired.]\n\n> [You have defeated an Iran Clan Lizardman.]\n>\n> [Party leader 'Grid' has acquired <span class=\"rarity-uncommon\">Usable Scimitar</span>.]\n>\n> [Party leader 'Grid' has acquired Sapphire.]\n>\n> [255,000 experience has been acquired.]\n\nDran Valley, where crystal-clear water carved through stone. The monsters here vastly outclassed the creatures of Suaz Mountains. Minimum level 190, most higher. Grid struggled when more than seven converged on him at once.\n\nBut Dong Pao's healing changed the equation entirely.\n\n*A level 160 priest's Heal is incredible. Kukuk, I could stay here forever with this healing shuttle.*\n\nGrid's experience bar had swelled despite splitting the gains with Dong Pao. Still, he contorted his face into a grimace and let out a theatrical groan. \"Phew... thought I was going to die. Never seen so many monsters at once. Is this area always like this?\"\n\nDong Pao shook his head, confusion written across his features. \"I don't know what's happening. This place should barely have any spawns...\" He glanced around the blood-soaked ground. \"I didn't even know there *were* this many monsters here. It's... unsettling.\"\n\nHis eyes tracked to the dagger in Grid's hands.\n\n*That deep blue aura... like the sea. Enhanced to at least +8. Incredible.*\n\nWhen Grid had first joined the party, Dong Pao had assumed the man's solo journey to Rolling was pure luck. A fluke survival by a lucky fool.\n\nFighting alongside him told a different story. Grid possessed genuine strength, far beyond what his level suggested. He'd crossed Suaz Mountains through skill, not fortune.\n\n*That +8 dagger is the secret. Daggers usually have weak attack power compared to swords or maces, but... enhanced this far, it can outdamage most blunt weapons.*\n\nFast attack speed, devastating damage output. Grid's dagger broke the usual trade-off.\n\n*He must be wealthy to carry that. Good. More profit than I expected. If I can take that dagger...*\n\n\"This is enough rest.\" Grid stood, interrupting Dong Pao's greedy fantasies. The cloak settled back onto Grid's shoulders. \"Time to move. Don't want to arrive too late.\"\n\n\"Yes... but before that...\" Dong Pao's eyes sharpened.\n\nGrid's throat tightened. *He noticed the cloak.*\n\n\"Item distribution.\" Dong Pao gestured at the air between them. \"Can you change it to sequential instead of party leader distribution? Brother, let's be fair.\"\n\n\"...\" Grid forced himself to relax. \"Keep it as party leader distribution for now. With sequential, the expensive items might go to only one person. That's not fair either. We'll split the proceeds fifty-fifty once we arrive at the destination. Don't worry.\"\n\n\"No, but...\"\n\nGrid's destination was the Vatican. Dong Pao's destination was a shallow grave for Grid, somewhere short of that goal. If the distribution settings remained unchanged, Dong Pao would receive nothing. Sequential distribution was essential.\n\nBut Grid was already walking.\n\n*Damn bastard!* Dong Pao bit back the curse. *Fine. I'll get plenty of money from him.*\n\nHe smiled at Grid's retreating back, amused by the man's urgency. The smile died five minutes later when new monsters materialized like storm clouds.\n\n\"What the hell is this?!\" Dong Pao's voice cracked. \"Why do they keep appearing?!\"\n\n\"Didn't you do difficult quests for the Rebecca Church?\" Grid's face showed perfect innocence. \"Perhaps this is a trial from Goddess Rebecca?\"\n\nMethod acting. Grid excelled at playing ignorant, and Dong Pao swallowed the bait without suspicion.\n\n\"No! I've never heard of a trial involving monster hunting! And there's no quest window...!\"\n\n\"Hrmm.\" Grid drew <span class=\"rarity-epic\">+8 Ideal Dagger</span> again. \"Support me while I handle them. Thank you.\"\n\n\"Yes...\"\n\nDong Pao's shoulders sagged at the thought of burning through expensive mana potions. Grid's inner voice sang with triumph.\n\n*Free healing shuttle. Use it as much as possible!*\n\nThat's right. Grid had planned this from the moment he'd accepted the party invitation. Until they reached the Vatican, he'd drain Dong Pao's mana pool dry for infinite hunting. Dong Pao aimed for Grid's life. Grid aimed to exploit him.\n\nThe cycle repeated. Hunt, rest, hunt, rest.\n\n> [Your level has risen.]\n>\n> [Your level has risen.]\n\n\"Yes!\" Grid pumped his fist.\n\n\"Ohh! I leveled too...!\"\n\nTwelve hours since leaving Rolling. Grid gained three levels. Dong Pao gained one.\n\nShock rippled through Dong Pao. Hunting high-level monsters with only two people yielded faster leveling than most five-man parties. Better than he'd experienced in recent memory. Like Grid, he felt the pull to stay here, to grind until he broke into the ranker tier.\n\nThen reality reasserted itself.\n\n*Money is more important than levels.*\n\nThey'd reached Crime Forest. Originally a three-hour trip from Rolling. The journey had taken twelve hours. The assassins must be tired, resentful from waiting. Anxiety gnawed at Dong Pao's gut. He pointed ahead.\n\n\"Brother, let's rest in that cave.\"\n\nGrid turned, spotting the cave entrance. His face showed reluctance. \"Do we need to rest? Shouldn't we push straight to the Vatican with this momentum?\"\n\n\"Unlike you, my stamina has hit its limit several times.\" Dong Pao injected weariness into his voice. \"I need proper rest. My mana regeneration is crawling... I can only use Heal a few more times.\"\n\nGrid sighed. \"Can't be helped.\"\n\n\"Thank you for understanding.\"\n\nGrid followed Dong Pao's guidance into the cave. Notification windows flashed.\n\n> [The Vampire Countess Marie Rose is sealed in this space.]\n>\n> [Marie Rose's evil influence makes your magic power turbid. All types of spells and skills are unavailable.]\n>\n> [You have resisted.]\n\n\"...?\"\n\n*Is this a raid room? Vampire Countess? The barons are terrifying enough, and this is a Countess? Are we going to have our blood drained here? Why would we rest in such a dangerous...*\n\nDong Pao shook his head. \"Don't worry. Marie Rose has been sleeping for hundreds of years, sealed by two of Rebecca's Daughters... She never wakes. Marie Rose isn't what you should worry about right now.\"\n\n\"...?!\"\n\nThree shadows peeled from the darkness at the cave's rear. Assassins. They moved to block the entrance, cutting off escape routes, glaring at Dong Pao.\n\n\"Why are you so late?\" The speaker's voice carried an edge.\n\nDong Pao spread his hands. \"Strangely, monsters kept appearing. We were forced to slow down while handling them.\"\n\nSniffer, 13th ranked assassin, sneered. \"Monsters? If you're going to lie, make it believable. There's hardly a wolf in this area, let alone monster spawns. This is why I hate the Chinese. Always bluffing.\"\n\n\"It's not a lie. Check for yourself later if you don't believe me.\"\n\n\"Enough.\" Kerb, 11th ranked, raised a hand. He aimed two daggers at Grid. \"Hey. If you don't want to die and lose experience, give us your gold. Then we'll spare your life.\"\n\nAssassins specialized in killing players. Their class change quests required assassination. Additional rewards came from body counts. These three had honed themselves on human prey, not monsters.\n\nIn this cave, where Marie Rose's presence suppressed all magic and skills, assassins held unique advantages. Combined with numerical superiority, Kerb felt no doubt about the outcome.\n\nGrid surveyed the situation. \"Dong Pao.\" His voice stayed level. \"Don't priests of the Rebecca Church have to obey the laws? Isn't it against your doctrines to harm travelers for money? This act of betraying Goddess Rebecca, doesn't it have fatal consequences for you as a priest?\"\n\nDong Pao's laugh held pity. \"Many people are confused about that. They think Rebecca's priests must always follow laws and doctrines to maintain our position. Reality is different. We only have to obey the law during quest periods. Whatever wrongdoings I commit don't matter if the church doesn't discover them.\"\n\n*He doesn't understand.*\n\n\"Isn't your divine power stat strengthened by following laws and doctrines?\" Grid pressed, desperation creeping into his tone. \"Rather than acting for immediate profit, isn't it better long-term to follow the laws and raise your divine power?\"\n\nDong Pao's expression softened with sympathy. Such pathetic persuasion.\n\n\"Brother, have you forgotten what I explained earlier? We have prayer. Divine power can be raised through prayer alone. I don't need to worry about following laws. I don't deny Goddess Rebecca, despite committing evil.\" He placed a hand over his heart. \"I deeply believe in, admire, and love the goddess. My loyalty to her is so profound that even now, my divine power rises slowly and steadily.\"\n\n\"...\"\n\n\"It's still unknown to outsiders, but the Rebecca Pope is deeply depraved. The Pope often breaks the laws and doctrines of the church. Yet his divine power transcends common sense. His belief in Goddess Rebecca is absolute.\"\n\n\"That's just a contradiction.\" Shay, the 7th ranked assassin, stepped forward. Disgust twisted his features. \"The Yatan Church stands for pure evil. They believe evil is the right way. But the Rebecca Church commits atrocities while claiming to serve good. Front and back are different. They're sneakier and more dangerous than the Yatan Church.\" He shrugged. \"Well, it's nothing to do with us... Give us your money.\"\n\nGrid examined Shay's equipment.\n\n*Armed with top-notch items. At least level 200...*\n\nLegendary Blacksmith's Discernment let him gauge item quality at a glance. Shay wasn't ordinary. None of them were.\n\n*Rankers. The other two are even higher level than Dong Pao.*\n\nBut.\n\n*...Boring compared to Faker.*\n\nGrid shared a guild with Faker, 1st ranked assassin. He'd witnessed Faker's skills firsthand multiple times. These three? They didn't inspire fear.\n\n\"You guys picked the wrong prey.\"\n\nGrid pulled two items from his inventory.\n\n> [<span class=\"rarity-unique\">Dainsleif (Reproduction)</span> has been equipped.]\n>\n> [Frostlight Orc Chief's Helmet has been equipped.]\n\n\"...This guy?\"\n\nDong Pao and the assassins froze. A black greatsword materialized in Grid's hands. The bizarre skull helmet settled onto his head, transforming him.\n\nRecognition struck like lightning. The Slaughterer. The man who'd annihilated the Giant Guild. They'd walked straight into a trap of their own making.\n\n---\n\n**Glossary of Common Korean Terms**\n\nOG: Glossary Link\n\nCurrent schedule: 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day."
}