{
  "id": 121,
  "title": "Chapter 121",
  "content": "# Chapter 121\n\nShay rounded on Dong Pao. \"You brought a big shot here?\"\n\nThe logic was simple. Higher-level targets meant higher ransoms. But there was always a line. An opponent too strong meant threats wouldn't stick, and the tables could turn.\n\nDong Pao's jaw tightened. \"The butcher's face and ID weren't revealed. How could I know?\"\n\nThe man he'd stumbled across by pure chance, the one he'd marked as an easy target, was the infamous Psychopath Butcher. Ice crawled down Dong Pao's spine at the thought of spending half a day beside him, hunting together in ignorance.\n\n*That video showed how cruel and violent he is. I was lucky he didn't plant a knife in my back while we hunted.*\n\n*Pathetic.*\n\nShay shook his head at Dong Pao's trembling form. He drew a weapon roughly 80cm in length and spun it with casual arrogance.\n\n\"Since we're already here, I'll test how good this famous Psychopath Butcher really is.\"\n\nNo retreat. Not for him.\n\nDong Pao's voice cracked. \"H-Hey, Shay! Didn't you watch his battle video? You saw those wide-area skills! He must have a hidden class. Wouldn't it be smarter to retreat? Can't we settle this peacefully?\"\n\n\"Peacefully?\" Shay's laugh was harsh. \"A man who's killed dozens for money wants peace?\"\n\nHe stepped forward, blade gleaming dully in the cave's dim light.\n\n\"You're right about the powerful skill. In a normal place, I'd avoid him. But this cave seals all skills. With his abilities locked down, we have a real chance.\"\n\nShay's certainty radiated from every movement as he lunged toward Grid.\n\n**Sakak!**\n\nSteel flashed through darkness. The black greatsword rose to meet it.\n\n**Chaaeng!**\n\nSparks erupted where the blades collided, briefly illuminating the cave. For an instant, the grotesque skull helmet blazed into full visibility.\n\nShay's lips curled. \"If you were a normal person, I'd wonder about the psychology behind wearing something so hideous. But I suppose trying to understand a psychopath's mind is pointless.\"\n\nGrid's shout echoed off stone walls. \"You think I *like* wearing this thing? I don't have a choice! The stats are too good! And stop calling me a psychopath!\"\n\n**Chaaeng! Chaaeng!**\n\nThe rapid exchange of blows drew admiring murmurs from Kerb and Sniffer.\n\n\"That bastard is reacting to all of Shay's attacks.\"\n\nKerb crossed his arms. \"When you consider the entire game, very few can match Shay's attack speed. He's the 7th ranked assassin.\"\n\nAssassins possessed high agility. Swiftness was their defining trait. Yet Grid, armed with a cumbersome greatsword, blocked every strike.\n\nDong Pao's mouth hung open. \"Is he that skilled in combat? Or is he predicting trajectories by reading Shay's movements?\"\n\nKerb shook his head. \"No. He's not that clever. He's simply... fast.\"\n\n\"What?\"\n\nSniffer shot Dong Pao a contemptuous look. \"Open your damn eyes and look properly. The speed Grid is swinging that greatsword matches Shay's attack speed.\"\n\nDong Pao couldn't process it. Grid's greatsword stretched 3 meters and weighed over 20kg. Shay's blade was under a meter, light as air. Given the difference in length and weight, shouldn't Shay dominate?\n\nKerb's explanation was clinical. \"Grid's **Strength** and **Agility** are high enough to shatter normal logic. Skills aren't the problem. That man is a stat monster.\"\n\n**Chaaeng!**\n\n\"Kuk!\"\n\nAfter dozens of exchanges, Shay stumbled backward first.\n\n*Every clash feels like striking a boulder.*\n\nHis right arm screamed with cramping muscles. Shay could no longer endure Grid's overwhelming attack power.\n\n\"Grid.\" Shay rolled his shoulder, trying to work out the stiffness. \"Your name isn't even in the top 3,000, but you're leagues beyond me. Hidden class or not, doesn't this exceed the concept of level? There's got to be a balance issue here.\"\n\nGrid snorted. \"Have you ever met someone with a hidden class? Then you don't know. Obtaining one requires constant effort and ridiculous luck. Maybe you'll get one after 100 years of buying lottery tickets.\"\n\n\"Unlucky bastard.\"\n\nShay gestured sharply. His colleagues moved in a blur, flanking Grid from both sides.\n\n\"First, I'll make you bleed! Then you'll pay with your lives!\"\n\n**Papapat!**\n\nSniffer, eager for violence, hurled three darts while shouting. Kerb stayed silent, aiming two daggers with professional precision.\n\n\"What will you do?\"\n\nGrid had accumulated considerable combat experience. The thrown weapons were nothing. He spun, deflecting every projectile flying from both directions. In the process, he registered the unusual heft of Sniffer's darts.\n\n*Specialized in throwing techniques.*\n\nDifferent assassins, different specializations. Some focused on stealth, others on speed, some on traps, and others on ranged weapons. In a one-against-many fight, Sniffer posed the most consistent threat. Grid decided he was the priority target.\n\nA black arc of sword energy lashed out.\n\n\"Aigoo!\"\n\nSniffer bent backward, the attack missing by a hair's breadth. From that precarious position, he launched new darts. While Grid tracked Sniffer, Kerb closed from behind, twin daggers whistling toward Grid's spine. Shay scaled the wall, reaching the ceiling before dropping like a stone toward Grid's head.\n\nA perfect pincer attack with flawless timing.\n\n*Victory!*\n\nThe three assassins' certainty lasted exactly one second.\n\n**Chaaeng! Chaaeng!**\n\n\"What the—?!\"\n\nImpossible. A golden disc materialized from nowhere, intercepting Sniffer's darts. It spun through the air, blocking Shay's descending blade. A second disc engaged Kerb's daggers in a metallic duel.\n\n\"What *is* this?\"\n\nThe flying discs interfered with every attack. The assassins stood frozen, minds struggling to comprehend. Grid seized the opening.\n\n\"Pagma's Swordsmanship, Wave!\"\n\n**Peeeeeong!**\n\nBlack waves of sword energy rippled outward in all directions. The cave erupted into chaos. The assassins were hurled through the air without even time to scream.\n\n\"Cough! Ugh!\" Shay clutched his chest, blood seeping between his fingers. \"How? How can you use a skill in this place?\"\n\nAssassins had passive skills that granted probability-based evasion. But this cave suppressed even passives. Grid using an active skill here violated the fundamental rules.\n\nGrid approached the three collapsed figures. \"Aren't there many exceptional people in the world?\"\n\nTerror flooded their faces as they scrambled to resist.\n\n\"Ugh! Damn it! Crazy!\"\n\nShay's movements dragged with visible sluggishness. The Wave debuff had slowed him to half speed.\n\n**Chaaeng! Chaaeng!**\n\nGrid yawned while deflecting Shay's desperate attacks. Boredom saturated the gesture.\n\n\"Damn you!\"\n\nA top 1,000 ranker, reduced to this humiliation.\n\n\"Ohhhhhh!\"\n\n**Suuk.**\n\nGrid sidestepped Shay's lunge with minimal effort. Dainsleif split Kerb vertically as the assassin tried to flank from behind.\n\n\"You monster!\"\n\nSniffer's composure shattered. He threw every remaining dart in his possession. Dozens of projectiles filled the air. Two golden discs intercepted them all. Not a single dart touched Grid's cloak.\n\n\"You guys can't even catch up to Faker's toes.\"\n\n**Sukakak!**\n\nA single overhead strike fell like judgment, catching Shay and Sniffer simultaneously. Grid watched them dissolve into grey light and once again measured Faker's true strength. Then he turned toward Dong Pao.\n\n\"T-This...\"\n\nComplete devastation. Grid had fired one skill and annihilated three top assassins in seconds.\n\n*How?*\n\nDong Pao checked Grid's level again. They were still partied. **Level 150**. Grid had been **147** when they first met, gaining three levels during their hunting trip. A mere level 150 had crushed the level 200 Shay and the level 180 Kerb and Sniffer.\n\n*Is this what a hidden class means?*\n\nHis turn was next. Dong Pao had tried to rob and murder Grid.\n\n\"H-Hik!\"\n\nExperience loss hurt. But that wasn't the worst. In the worst case, items dropped on death. Dong Pao would do anything to avoid that fate. Even kiss Grid's feet.\n\n\"S-Spare me! Please!\"\n\nDong Pao bowed until his forehead nearly touched the ground. Grid approached and squatted beside him. \"How many people in this place have begged you with the same emotions you're feeling right now?\"\n\n\"...\"\n\nDong Pao had never kept count. Looking back now, he grasped the despair of everyone he'd victimized.\n\n\"I'm sorry! I'm truly sorry! I'm a bastard! I swear I'll never bargain with lives again! I'll never commit evil, so please spare me!\"\n\n\"What? It has nothing to do with me what you do to other people.\"\n\n\"B-But didn't you just ask about how many I've hurt?\"\n\n\"I was just wondering.\" Grid shrugged. \"I was going to split the items from our hunt with you, but you've lost that right now. Agreed?\"\n\nDong Pao nodded frantically. \"Yes! You're absolutely right! I'm the trash who tried to deceive you to take your life and money! Splitting items makes no sense! Of course you should keep everything! So please, just spare my life!\"\n\nHe begged until the last moment. But escape was never an option.\n\n**Puok!**\n\n\"K-Keok!\"\n\nBlood drained from Dong Pao's face in a rush. His flesh collapsed inward, withering into a mummified husk. Grid hadn't touched him.\n\n\"Don't tell me...\"\n\nGrid's muscles tensed. An unidentified woman materialized behind Dong Pao, draining his blood like wine from a glass.\n\n\"Nice to meet you.\"\n\nThe woman smiled through lips stained crimson. The moment Grid registered her red eyes, notification windows flooded his vision.\n\n> **[You have encountered Vampire Countess Marie Rose.]**\n\n> **[Marie Rose's evil influence makes your magic power turbid. All types of spells and skills aren't available.]**\n\n> **[You have resisted.]**\n\n> **[A vampire's gaze will subdue lower species. You will lose your willpower and control over your body.]**\n\n> **[You have resisted.]**\n\n> **[Marie Rose's attraction is absolute. Her charm is so high there are even high odds of both genders being attracted.]**\n\n> **[You have resisted.]**\n\nGrid put maximum distance between himself and Marie Rose. Then he spoke carefully, each word measured.\n\n\"Why did you suddenly wake after hundreds of years when your seal isn't released? Were we being too loud?\"\n\nMarie Rose pointed at <span class=\"rarity-unique\">Malacus' Cloak</span>.\n\n\"The blood of thousands, perhaps tens of thousands, is soaked into that cloak you're wearing. Isn't that stimulation enough to wake me?\"\n\nMalacus, priest of the Yatan Church, had slaughtered countless virgins for decades. Their blood saturated the cloak completely, creating an irresistible beacon for vampires.\n\n\"But you are quite unusual, aren't you? You lack the divine power of Rebecca's Daughters and the magic power of Braham, yet my gaze and presence have no effect on you. How strange.\"\n\nMarie Rose appeared to be in her early twenties. Jishuka possessed glamorous beauty. Yura carried neat, refined beauty. Marie Rose's beauty transcended both, so perfect it seemed unreal, like an illusion.\n\nThe perfection was so absolute that Grid felt no attraction whatsoever. He wasn't bewitched at all, maintaining complete calm.\n\n\"Isn't this strangeness interesting? Are you interested enough to keep me alive? I woke you from your seal, so consider it a favor.\"\n\nMarie Rose imposed the worst possible conditions. Skill sealing. Body control. If she possessed powerful area-of-effect abilities, she would be invincible. Even if the top 200 rankers charged her simultaneously, none would survive. Grid's fear was entirely rational.\n\nMarie Rose found this endearing.\n\n\"Cute.\" Her laugh was light, almost musical. \"Let's meet again one day.\"\n\n**Saaah!**\n\nMarie Rose's beautiful form dissolved into black powder, scattering on the wind. Grid stood frozen, afraid she might reappear. He tore off the cloak immediately. He started to head straight for the Vatican, then stopped.\n\nSeveral items littered the ground.\n\n\"This is good fortune, at least.\"\n\nThe assassins and Dong Pao had dropped items upon death. Grid's hands trembled slightly as he collected them, but the fear Marie Rose planted in his gut refused to completely fade.\n\n---\n\n**Glossary of Common Korean Terms**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week  \n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}