{
  "id": 122,
  "title": "Chapter 122",
  "content": "# Chapter 122\n\n\"Rin, shouldn't you be faithful to me and Goddess Rebecca, as well as serve as a role model to the believers?\"\n\nThe Vatican. Dozens of senior paladins and priests bore witness as one of Rebecca's Daughters stood trial. Rin lifted her chin.\n\n\"This is a misunderstanding. My loyalty to Goddess Rebecca and Your Holiness is eternal. I will never betray you.\"\n\n\"If you are loyal, why haven't you responded to my calls? Shouldn't you obey my commands in any circumstances?\"\n\nLast January, Drevigo had risen to the seat of 13th Pope after defeating the other candidates. The moment he seized power, his true nature emerged. For nearly two years now, he had broken sacred laws to fill his own coffers and defiled the honor of Goddess Rebecca.\n\nThe high priests were remorseful. They tried to correct their mistake, but they weren't successful. Those who voiced opposition found themselves demoted to temples in the most remote corners of the empire. Only those who abandoned their principles and embraced corruption remained at the Vatican.\n\nReform was needed.\n\nFinally, this September, the senior clergy rebelled to remove Drevigo from the papal throne. But Drevigo had Rebecca's Daughters. Absolutely loyal to the Pope, the three divine warriors crushed the rebellion before it could take root. After that, Drevigo consolidated his position even further.\n\nThe priests lamented. Three of the strongest paladins ever fostered to guard the church now protected the worst pope in its history. As long as Rebecca's Daughters existed, Drevigo would remain untouchable, and the Rebecca Church would rot from within.\n\nBut now, something had shifted. Due to Drevigo's endless appetites, even Rebecca's Daughters could feel the wrongness. Those who had been taught absolute loyalty from childhood were beginning to question their conditioning.\n\nRin's hands trembled at her sides. \"I felt confused because Your Holiness didn't fulfill your duties as pope. I prayed to Goddess Rebecca to see if I should submit to your commands. I asked for answers.\"\n\nRin was strong, but she was pure. Naive, like a child. The Pope ridiculed her for answering so honestly.\n\n\"You *wondered* if you should submit to my commands?\"\n\n\"Yes.\"\n\nThe Pope's eyes widened. His voice cracked like a whip. \"Why are you so simple? I am the agent of Goddess Rebecca! It is your duty to believe and follow me. Are you trying to use prayer as an excuse?\" He jabbed a finger at her. \"Rin! You are a dangerous child! You are no longer my daughter! I will reclaim Ikael's Sword!\"\n\nAt that moment, a quest notification window appeared in front of Damian, who stood among the high-ranking paladin and priest NPCs.\n\n> **[Pope's Decision]**\n> \n> Difficulty Level: **SS**\n> \n> Rebecca's Daughters are the absolute weapons of the Rebecca Church. Their armed strength is reliable, but they can be dangerous if they aren't under perfect control. The pope is worried about the worst and eventually gave a command.\n> \n> Kill Rebecca's Daughter, Rin. Killing her won't deal a direct hit to the church. As long as Ikael's Sword exists, an endless number of substitutes can replace her.\n> \n> Quest Clear Conditions: Rin's death.\n> \n> Clear Reward: Abilities awakening.\n> * You can exert the true abilities of a paladin of the Rebecca Church.\n> \n> Quest Failure: Level -4. Divine Power will decrease by 10,000.\n> \n> [Would you like to accept the quest?]\n\nDamian stared at the window. There were three types of paladins in Satisfy.\n\nThe most popular belonged to the Judar Church. They specialized in a wide range of buff skills and had excellent defense. They handled party buffs, thrived in party hunting, and could serve as the main tank. They were considered the most popular class after the Rebecca priests.\n\nThen there were the paladins of the Dominion Church. They specialized in personal buff skills and had high attack power. They weren't popular for large-scale parties and raids, but they excelled in small party hunting. Their single combat ability was the best among all paladins.\n\nThe last were paladins of the Rebecca Church.\n\nThey were the only paladins who could use **Heal**. But they didn't have buff skills. Their healing output wasn't high either, so they weren't popular in party hunting or raids. It was a class grudgingly accepted only when a priest couldn't be found. No buffs, and the weakest combat ability among paladins.\n\nThey were much harder to find than paladins of other churches, and deeply unpopular. Rare was the user who chose to become a paladin of the Rebecca Church.\n\nBut wasn't it strange? Rebecca's Daughters were paladins. Not only that, they were the strongest among all NPC paladins. Thanks to their presence, Damian had speculated that a Rebecca paladin would become stronger if they broke through a certain threshold.\n\n*If I reach my second advancement, won't I become stronger than paladins of other churches?*\n\nHe had thought about it before choosing to become a paladin of the Rebecca Church. However, he reached level 200 after much struggle and found nothing special. The paladins of the other churches were still superior.\n\nDamian had felt extreme disappointment and skepticism. But right now...\n\n*Abilities awakening!*\n\nIt was the reward of his first SS-grade quest after playing Satisfy for over a year. If he cleared this quest and his abilities awakened, Damian would obviously become as strong as he'd originally anticipated. He had been waiting for this moment since he became a paladin of the Rebecca Church.\n\nHe made a decision.\n\n\"I reject.\"\n\n> [If you refuse the quest, the pope will view you as a traitor. Do you still want to reject?]\n\nDamian swallowed. He was a paladin of the Rebecca Church. He had struggled to raise his level and divine power. Everyone laughed and called Rebecca's paladins garbage, but Damian hadn't stopped dreaming of the day his abilities would awaken.\n\nThen a month ago, he became 2nd on the paladin rankings. As a result of effort that other people couldn't imagine, he was finally faced with the moment his abilities would awaken. So why was he refusing the quest?\n\n\"How can I aim a sword at Rin?\"\n\nIt was his virtuous heart. Damian had been watching Rebecca's Daughters for a long time, attracted by their beauty and charm. He ran a blog on the Internet praising Rebecca's Daughters.\n\n\"Don't underestimate my virtue! I refuse the quest!\"\n\n> [The quest was refused.]\n> \n> [An angry Pope Drevigo has pointed you out as a traitor.]\n\n\"Disgraceful person! What are you doing? Get rid of him and Rin!\"\n\n*Chaaeng!*\n\nDozens of senior paladins simultaneously armed themselves. They rushed toward Rin and Damian after receiving the pope's command.\n\nRin's breath came in shallow gasps. \"Ah...\"\n\nShe had been branded as a traitor after a lifetime of loyalty. She had no idea what to do. Damian ran to her side.\n\n\"Rin, it will be okay. I will protect you.\"\n\nExcluding the time he spent playing Satisfy, Damian spent all his time managing his blog and watching Japanese anime. Now he had an opportunity to defend the heroine, just like the protagonists of the shows he watched.\n\nRin looked at his back. Tears welled in her eyes. \"Damian... I'm not alone?\"\n\nDamian glanced at her. \"Yes. I am beside you. And Goddess Rebecca will surely protect us.\"\n\nAt that moment, a new quest window emerged in front of Damian.\n\n> **[Goddess' Divine Punishment]**\n> \n> Difficulty: **Class change quest.**\n> \n> Your choice to reject the corrupt pope's command wasn't wrong. Goddess Rebecca has blessed you.\n> \n> As an agent of Goddess Rebecca, punish the corrupt pope!\n> \n> Quest Progress Reward: Abilities awakening.\n> \n> Quest Clear Conditions: Pope Drevigo's death.\n> \n> Quest Clear Reward: The hidden class **'Goddess' Agent.'**\n> \n> Quest Failure: Level -20. You will lose your current class. The complete corruption of the Rebecca Church.\n> \n> * The hidden class change quest has the power to transform Satisfy's world, according to the result. Please be careful.\n> \n> [Goddess Rebecca has blessed you for following her teachings faithfully.]\n> \n> [Due to this, your suppressed powers have been awakened.]\n> \n> [All stats have increased by 100.]\n> \n> [The skill **'Light's Blessing'** has been generated.]\n> \n> [The skill **'Heart's Desire'** has been generated.]\n\n*Kkuok!*\n\nDamian gripped his sword tightly. His heart pounded against his ribs.\n\n*Duguen! Duguen!*\n\nHis blood boiled. It was the first time in 32 years that his adrenaline rose like this.\n\n*I chose this.*\n\nReality was different from manhwa. The main characters in manhwa were rewarded for their effort, but reality was grim. It was a world that was only beneficial to those who studied or had money.\n\nIn reality, Damian couldn't be a protagonist. But Satisfy was another reality, and his efforts and choices were repaid, giving him a chance to become a hero.\n\nDamian surged forward. \"Drevigo! As an agent of Goddess Rebecca, I will deal divine punishment! **Light's Blessing!**\"\n\n> [You and your party's defense, attack power and accuracy will increase by 80% for 3 minutes.]\n\n\"Ohhhhhh!\"\n\nGolden light enveloped Damian as he broke through the paladins and reached Drevigo. The Pope's hand rose.\n\n\"You dare to act as an agent of the goddess in front of me. Do you believe that you can receive a divine message?\"\n\n*Kwaang!*\n\nDrevigo's belief in Goddess Rebecca was real. His overwhelming divine power was comparable to Rebecca's Daughters. The power of light fired from his fingertip easily penetrated Damian's chest.\n\nDamian coughed. \"Cough!\"\n\n> [You have lost 41% of your health from a single blow.]\n> \n> [You can't regain your mental state.]\n\nWhat was this result? His vision swam. His body refused to move the way he wanted.\n\n*Indeed, I'm not a protagonist.*\n\nDamian fell into a stunned state. He was unprotected. The Pope raised his hand to launch another attack. All of Damian's efforts were about to be in vain.\n\nThen the doors of the huge room opened without permission. An outsider entered. It was a man wearing a scruffy cloak and a bizarre skull helmet.\n\n\"Who is it now?\"\n\nGrid surveyed the scene. \"A protagonist? I see.\"\n\n*Papapat!*\n\nAfter examining the situation, Grid threw three darts at the pope standing at the end of a long red carpet.\n\n\"Block it!\"\n\nThe paladins used their shields to block the darts. But the moment the darts hit the shields, an explosion occurred and smoke emerged. Grid used that gap to rescue Damian and Rin from the enemy.\n\nHe dragged them back and looked at Damian. \"Invite me into the party. Instead, can I have all the items that the pope drops? I think that is sufficient for saving your life.\"\n\nDamian's eyes were wide at the suddenly revealed savior. \"...\"\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}