{
  "id": 123,
  "title": "Chapter 123",
  "content": "# Chapter 123\n\nIsabel sat in the Vatican's backyard, her face buried in her knees. Tears streamed down her cheeks.\n\n\"I... I forced Rin into this...\"\n\nThe weight of her guilt pressed down on her shoulders. She'd dragged Rin here.\n\n\"I wanted to refuse His Holiness's command... But I was afraid...\" Her voice cracked. \"I know how much Rin hates the current Vatican... It is because of me... Rin came back here because of me...\"\n\nCassus crouched beside her. \"If you refused His Holiness's order, Rin would've been brought back by another person.\" His tone was gentle. \"Rin will be grateful for being brought politely by a friend, rather than being dragged by someone else. So please don't beat yourself up about it.\"\n\nSilence hung between them.\n\nIsabel slowly raised her head. Her eyes were red and swollen. She carefully brushed her long platinum hair away from her face, tucking the strands behind her ear.\n\n\"Rin... What will happen to her?\"\n\nThe pope had convened the high-ranking members of the church to determine Rin's fate. Isabel had wanted to watch, but the pope denied her permission. Now anxiety gnawed at her. *I can't let them treat her unfairly.*\n\nCassus said nothing.\n\n*Perhaps Rin will be deprived of her qualifications. Or in the worst case, she can lose her life.*\n\nOn the surface, Rebecca's Daughters were treated as sacred beings, second only to the pope himself. Everyone respected them. But Cassus knew the truth. The senior members dismissed Rebecca's Daughters as consumables. Mere powerful weapons. As long as the three divine artifacts were preserved, Rebecca's Daughters could be replaced at any time.\n\n*Right now, Rebecca's Daughters serve the pope. They are a thorn in his eye. The pope wants new Rebecca's Daughters who are unconditionally loyal.*\n\nThe pope would try to pass the three divine artifacts to new people.\n\n*Rin isn't the only one in danger. Maybe sooner or later, Isabel...*\n\nCassus' heart sank. Rebecca's Daughters were raised in the church. They only knew how to exist as enforcers of the church.\n\n*Once they become useless, they are deserted.*\n\nWhy was this terrible thing happening?\n\n*It is a poor fate.*\n\nIsabel was only seventeen. Rin was nineteen.\n\nThey were born with inherently high divine power. They were taught how to fight, how to be loyal to the church since childhood. If the church abandoned them, would they adapt to ordinary life? It would be even more unfortunate if they were killed. Too harsh for them to die without feeling the warmth of family, friends, or even a lover.\n\n*Also...*\n\nOnce new Rebecca's Daughters were born, ones absolutely loyal to the pope, no one would be able to stop him any longer. From then on, the Rebecca Church would walk the path of complete corruption. It was getting out of hand.\n\n\"Someone...\"\n\nCassus, who was usually stoic and expressionless, couldn't hide what he was thinking. He shed tears for the first time in his life.\n\n\"Someone, please... Save us...\"\n\n\"Cassus...?\"\n\nIsabel stared at him, her embarrassment written across her face. She had no idea what to do.\n\n\"W-Why are you crying all of a sudden? Huh? I-Is it because of me? Am I so depressed that I am making you cry? I'm sorry. I'm sorry so don't cry. Everything is good. Rin will be okay, and someday Goddess Rebecca will lead His Holiness to the right path.\"\n\nIsabel was free-spirited. Despite being harshly raised by the church, she possessed a strong personality. There were many times when she made people tired, but she had a warm heart like sunshine. She was in the most difficult position, yet she smiled and comforted her subordinates.\n\nCassus became sadder at the thought of this sacred, beautiful, and warm life ending. The moment he was about to burst out sobbing...\n\n\"Why is a big man crying? Eh? Especially in front of a girl. What a shame.\"\n\n\"...!\"\n\nCassus whipped around. That voice...\n\nA black-haired young man stood behind them, smiling.\n\n\"It has been a long time, Cassus.\"\n\n\"Grid...!\"\n\nWinston Castle had requested the support of a priest to create the Divine Shield. Cassus had been dispatched. At the time, Cassus had bonded with Grid while two Divine Shields were produced. But he never dreamed this relationship would continue.\n\nWhy had Grid come to the Vatican?\n\n\"Why are you here... No?\"\n\nCassus' eyes widened mid-question. Evil magic power radiated from Grid's cloak. The stench of virgin blood.\n\n\"That cloak...!\"\n\nIsabel rose to her feet. \"That is Malacus' Cloak.\"\n\n\"Malacus' Cloak... Really?\"\n\n\"Yes.\"\n\nIsabel had several encounters with Malacus. She'd raided sites where he offered virgins as sacrifices. She was interrupted every time, missing him each attempt. But she'd heard rumors that mighty soldiers of Winston destroyed Malacus. One of those mighty people seemed to be the young man called Grid.\n\nIsabel bowed her head slightly. \"It is an honor to meet such a great warrior.\"\n\n\"Ah! You!\"\n\nGrid glanced at Isabel and startled. Then recognition sparked in his eyes.\n\n\"Shield Thief! No, Shield Thief Girl! Ah, this... Ah! That's right! Was it Rebecca's Daughter? Hey! Rebecca's Daughter! Give me my shield!\"\n\n\"What?\"\n\nIsabel had encountered Grid at Winston Castle. But she didn't remember him because she hadn't seen his face at the time. Cassus stepped forward to explain.\n\n\"He is the blacksmith of Winston. He is the creator of the Divine Shield that you are holding.\"\n\n\"Omo, really? This young man has that type of blacksmith skill? Huh? But how can a blacksmith kill Malacus?\"\n\nGrid strode toward Isabel. He thrust out his hand.\n\n\"Give me my shield.\"\n\nIsabel's eyes widened. \"I appreciate the fact that you defeated Malacus. But I can't help you. The Divine Shield is a dangerous weapon so we have decided to recall all of them. That other shield that you made, could you please give it back?\"\n\n\"W-What?\"\n\nGrid's face fell.\n\n\"How much money did I spend making these shields? Do you have any idea how great the value of the shield is? I can be rich if I sell it!\"\n\n\"I understand but... I'm sorry. It can't be helped. The policy has already been set.\"\n\n\"D-Dammit!\"\n\nGrid's jaw clenched. His <span class=\"rarity-legendary\">Perfect Divine Shield</span>. Hundreds of millions of won, gone. How could he be calm when they were robbing him? His face turned red.\n\n\"Blood won't be shed if you give me the shield immediately.\"\n\nGrid was currently level 150. Different from when the Divine Shield was stolen by the Yatan follower. His confidence overflowed, even facing the Rebecca Church's strongest paladin.\n\nGrid pulled out his greatsword.\n\nCassus grabbed his arm. \"Grid, please calm down. Let's start with a conversation first. Why did you come here?\"\n\n\"Ah, you! What are you saying? Do I seem like I want to talk right now? Eh?\"\n\n\"Grid, please. Please calm down.\"\n\nCassus bowed deeply.\n\nGrid paused. He remembered making items with Cassus. The memory softened his anger slightly.\n\n\"I came to see the pope.\"\n\n\"His Holiness?\"\n\n\"I have something that I want him to bless... I also wanted to ask for the Divine Shield back.\"\n\n\"Hah...\"\n\nCassus felt it was mysterious. Amazing to reunite with someone he thought was merely a passing relationship.\n\n*This is all Goddess Rebecca's doing...*\n\nWhat did his relationship with Grid mean? Cassus was deeply interested when...\n\n**KWAANG!**\n\nA powerful explosion rang out from inside the Vatican.\n\n\"...?!\"\n\nIsabel's face turned white.\n\n\"This divine power... It is His Holiness!\"\n\nSomething had happened to Rin. Was the pope doing something terrible to her while Isabel stood here? Isabel rushed toward the Vatican.\n\nCassus blocked her path.\n\n\"Didn't His Holiness command you not to enter? Don't go. If you break his command, His Holiness will punish you and Rin.\"\n\n*Rin is being punished.*\n\nCassus was certain of it.\n\nIsabel gritted her teeth.\n\n\"Indeed... I have to save Rin from His Holiness!\"\n\nA gold circle materialized in the empty space. A white spear emerged from within. One of the three divine artifacts of the Rebecca Church. <span class=\"rarity-legendary\">Lifael's Spear</span>.\n\nGrid stared at the weapon.\n\n*I didn't recognize it before, but isn't this a huge weapon? It is much better than the Gale Spear that I made. No, it is a few dimensions above Dainsleif.*\n\nOnly one person could produce a weapon like this.\n\n*Pagma!*\n\nHe'd found a clue to Pagma in a place like this. Grid lunged forward.\n\n\"Hey! Let me see this!\"\n\nHe grabbed Lifael's Spear.\n\n\"What?\"\n\nIsabel's anger flared. She waved her spear firmly. This man dared put his hand on a sacred weapon. She wanted to blow Grid's body into a tree 100 meters away. However...\n\n\"Huh?\"\n\nThe spear wouldn't swing freely. Grid's grip was beyond human category.\n\n\"Eek!\"\n\nIsabel wielded the spear with all her strength.\n\nGrid's body flew 30 meters. He rolled across the ground.\n\n**Ku tang tang tang!**\n\n\"Uhh...\"\n\nGrid's vision blurred. He staggered to his feet.\n\n\"What? What is with this girl's strength?\"\n\nGrid had stopped putting points in Intelligence after securing enough mana. He'd invested everything into Strength. At level 150, combined with his title effects, Grid had over 1,500 Strength. He could break rocks by swinging his fist.\n\nGrid's strength had grown to where Toon couldn't compete anymore. Yet this huge strength wasn't a match for Isabel.\n\n*Rebecca's Daughters isn't an empty name.*\n\nA slender girl, yet she exerted physical strength beyond human limits. Isabel reached the front door of the Vatican while Grid admired her.\n\n\"Isabel! Please stop!\"\n\n*Just wait a little longer, Rin. I will save you!*\n\nCassus couldn't stop her. Isabel threw open the Vatican doors, filled with the desire to save Rin.\n\n**KWAANG!**\n\nA girl with purple hair descended from the roof. She attacked Isabel.\n\n\"You!\"\n\nIsabel barely defended. The girl who suddenly appeared at the entrance was the last of Rebecca's Daughters. The owner of <span class=\"rarity-legendary\">Everiel's Shield</span>. Luna.\n\n\"Here... You can't enter.\"\n\nIsabel shouted. \"Luna, get out of my way! Rin is in danger!\"\n\nLuna shook her head. \"His Holiness' commands are absolute... I have to follow them.\"\n\n\"Really... You really can't? It is a request.\"\n\nIsabel begged. Luna remained adamant.\n\n\"I'm sorry... I can't.\"\n\nLuna was much younger than Isabel and Rin. Fourteen years old. The brainwashing was still strong. Unlike Isabel and Rin who thought for themselves, Luna only obeyed orders. She was the one who had the most achievements when suppressing the rebellion three months ago. The one most favored by the pope.\n\n\"It is impossible to break Everiel's Shield... This can't be... Rin...!\"\n\nIsabel knew she couldn't persuade Luna. Despair gripped her heart. At this moment, Rin was suffering alone. Isabel was the only one who could help her. But why was the goddess giving her such trials?\n\n\"Goddess, are you throwing Rin away...?\"\n\nA notification window flashed before Grid's eyes.\n\n> **[Help the Rebecca Church!]**\n>\n> **Difficulty:** Class Quest\n>\n> The Rebecca Church is a religion with deep ties to Pagma. The friendship between 5th Pope Franz and Pagma is still spoken about hundreds of years later.\n>\n> As Pagma's Descendant, you are obliged to help the Rebecca Church that is being corrupted by 13th Pope Drevigo.\n>\n> **Kill Pope Drevigo!**\n>\n> **Help the Rebecca Church!**\n>\n> **Quest Clear Conditions:** Drevigo's death.\n>\n> **Quest Clear Reward:** Goddess Rebecca's blessing.\n>\n> * This is a sub-quest that works in conjunction with the second class quest. If you fail this quest, you won't meet the conditions to clear the second class quest.\n\n\"Are they crazy?\"\n\nLook at the warning. If he failed this quest, he'd fail his class quest. Grid couldn't understand it.\n\n\"Shit, what is this craziness?\"\n\nThe quest caused him to tremble.\n\n\"Ah, this is really... If I fail... Huh?\"\n\nGrid was complaining when his gaze fell on the spear in Isabel's hand. A transparent arrow appeared. Visible only to Grid's eyes. It pointed at Isabel's spear."
}