{
  "id": 124,
  "title": "Chapter 124",
  "content": "# Chapter 124\n\nA translucent arrow materialized in Grid's vision, hovering over Isabel's spear. The system's guide function—an aid that had helped him countless times in his early days, even after becoming Pagma's Descendant. The bellows incident flashed through his mind.\n\n*So that's it.* The spear was connected to this quest somehow.\n\nGrid's jaw tightened. High-penalty quests always came with system assistance. A fail-safe built into the game's architecture.\n\n\"Hey, Isabel.\"\n\n\"What?\" Isabel's head snapped toward him, her expression still haunted by Luna's appearance.\n\nGrid stepped closer. \"I'll kill the Pope and rescue Rin. In exchange, I get my shield back.\"\n\nThe words hung in the air between them.\n\n*Why?* Isabel's frown softened as something inexplicable stirred in her chest. *Believe in him.* Was that... the Goddess's voice?\n\n\"You'll really save Rin?\" Her fingers whitened around the spear shaft. \"Has Goddess Rebecca condemned His Holiness?\"\n\nGrid met her gaze. \"That's what the sky told me.\"\n\nHe reached for the spear. Isabel flinched, but Grid's hand was already closing around the shaft. \"You—!\"\n\n\"<span class=\"system-skill\">Legendary Blacksmith's Appraisal</span>.\"\n\n> [The blacksmith who becomes a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\n> [<span class=\"rarity-legendary\">Sealed Lifael's Spear</span>]\n> \n> Rating: Legendary  \n> Durability: 1,000/1,000  \n> Attack Power: 730~1,270\n> \n> * Divine Power +1,500\n> * All stats +60\n> * 100% increase in health recovery\n> * Fixed damage of +2,000 on each attack\n> * High probability of activating 'Light Wheel'\n> * High probability of activating 'Shield of Light'\n> * High probability of activating 'Light of Guidance'\n> * Generates skill 'White Transformation'\n> * Attack power +20% against dark magic users\n> \n> One of the three divine artifacts of the Rebecca Church. The 5th Pope Franz commissioned the legendary blacksmith Pagma to seal its power.\n> \n> Conditions of Use: Rebecca's Daughter  \n> Weight: 400\n\n*Almost like Failure.* Grid's pulse quickened as he processed the stats. The weapon he'd forged without consideration for game balance had seemed absurd enough, but this—\n\n*Wait. Sealed? By Pagma? Why would he—*\n\nWhite light erupted from the spear.\n\nGold radiance followed, blinding and pure. Grid squinted against the glare.\n\n> [You have discovered a hidden feature in the item!]\n\n> [<span class=\"rarity-mythic\">Lifael's Spear</span>]\n> \n> Rating: **Myth**  \n> Durability: 1,500/1,500  \n> Attack Power: 2,330~2,890\n> \n> * Divine Power +3,000\n> * All stats +200\n> * 300% increase in health recovery\n> * Fixed damage of +5,000 on each attack\n> * High probability of activating 'Light Wheel'\n> * High probability of activating 'Shield of Light'\n> * High probability of activating 'Light of Guidance'\n> * **Skill 'White Transformation' permanently active**\n> * Attack power +50% against dark magic users\n> \n> One of the three divine artifacts of the Rebecca Church. Contains tremendous divine power that human beings cannot handle, placing heavy burden on the user's mind and body. Since Rebecca's Daughters became short-lived after being unable to cope with this weapon's power, 5th Pope Franz asked Pagma to seal it. However, Pagma's Descendant emerged during the 13th Pope's reign and discovered the weapon's true power, unsealing it.\n> \n> Conditions of Use: Rebecca's Daughter  \n> Weight: 400\n\n> [You have witnessed a god-made weapon!]\n> \n> [Insight has increased by 200.]\n> \n> [Your insight stat has exceeded 500. You will see the world differently from before.]\n> \n> [All blacksmith related skill levels have increased by +1.]\n> \n> [You can now produce myth rated items.]\n\nGrid's breath caught in his throat.\n\n*It surpasses even Failure.* His gaze swept over the weapon's stats again. *No—this could disrupt the entire game's balance.*\n\n*Myth rating.* The concept settled into his mind like a key turning in a lock. *So items exist beyond legendary. Does that mean I could recreate something like Dainsleif at full power? Or even—*\n\nNumbers appeared.\n\nFloating above Isabel's head: **55,000**. Luna: **26,300**. Cassus: **4,000**.\n\n*Combat power.* Grid's enhanced insight made the meaning crystal clear.\n\nGolden energy detonated around Isabel. The unsealed spear's power—<span class=\"system-skill\">White Transformation</span>—activated automatically. Her combat power surged upward.\n\n**120,000**.\n\nGrid snorted. \"Convenient, but seriously? Did I just get pulled into some old battle manga?\"\n\n*There was that series from a century ago,* he mused. *The one with scouters measuring power levels. Created a worldwide phenomenon.* \"Why am I stuck with an ability ripped from ancient media?\"\n\nNot that he was actually complaining. The utility was undeniable.\n\nLuna stared at Isabel, her expression unreadable. That platinum hair—like liquid silk, so much more elegant than her own curly, multi-colored locks. Luna had always envied it, coveted it more than any jewel in the Church's treasury.\n\nNow that beautiful hair blazed with divine power.\n\n*I have to fight.* Luna's chest tightened. She liked Rin. Loved her like a sister. Isabel too. But orders were orders. The Pope had commanded it, and she'd been trained since childhood to obey.\n\n<span class=\"system-skill\">White Transformation</span> flooded Luna's body.\n\n**50,000**.\n\nThe gap was insurmountable.\n\n*Isabel wins this one.* Grid's confidence crystallized into certainty.\n\n\"H-How—?\" Isabel's voice shook. The spear pulsed in her grip, wild and overwhelming. She could feel its edge cutting through air itself. *I could pierce Everiel's Shield. I could cut through anything.*\n\n\"Hey.\" Grid's hand fell on her shoulder.\n\nShe jerked, nearly dropping the weapon.\n\n\"Have strength.\" His tone carried the weight of a blessing. \"I'm going after Rin first.\"\n\n\"I—!\" \n\nRin's name snapped Isabel's focus back into place. Her fingers locked around the spear. Luna stood between her and salvation.\n\n*Perfect.* Grid watched the determination harden in Isabel's eyes. *She'll keep Luna occupied. I clear the quest. Everyone wins.*\n\n\"Let's go!\"\n\nGrid sprinted past the dueling paladins, pulling <span class=\"rarity-rare\">Dainsleif</span> and the <span class=\"rarity-uncommon\">Frostlight Orc Chief's Helmet</span> from his inventory as he ran. The Vatican's halls stretched before him—marble and gold and stained glass filtering colored light across ancient stone.\n\nMassive doors loomed at the corridor's end.\n\n*There.*\n\nGrid's boot connected with the doors. Wood and iron crashed inward.\n\nThe Pope stood at the far end of a blood-red carpet.\n\n\"That guy?\" The Pope's bewilderment was almost comical.\n\nGrid's eyes swept the chamber. Two figures—a man and woman—surrounded by dozens of paladins and priests. His timing was perfect. Cinematic, even.\n\nA laugh bubbled up from his chest. \"A protagonist? Sure, I'll play along.\"\n\nHis hand dropped to his belt.\n\n> [<span class=\"rarity-unique\">Kenen's Dart Belt</span>]\n> \n> Rating: Unique\n> \n> The favorite belt of Kenen, a master of assassination who made many people panic. One dart charges every 20 seconds (maximum 3). Generated dart type is random with varying effects.\n> \n> Conditions of Use: Assassin Throwing Technique Level 7+  \n> Weight: 140\n\n*Sniffer's drop.* Grid's grin widened. Similar to an infinite quiver, but the randomness was both blessing and curse. He'd tested it on the way here—the results had been... interesting.\n\n*That idiot's probably crying blood over losing this.* PK users had absurdly high drop rates on death. Attacking him had been monumentally stupid.\n\n*Papapat!*\n\nThree darts hissed through the air.\n\n\"Block it!\" Paladins surged forward, shields raised.\n\n*Pepepeng!*\n\nSmoke billowed across the chamber. Grid clicked his tongue. \"Poison fog was an option, and I got plain smoke? Typical.\"\n\n*My luck stat must be in the negatives.*\n\nHe burst through the haze, scooping up Rin and Damian before the paladins could reorient.\n\n*Not bad.* Damian's combat power read **12,500**. Impressive for a user, though Rin's **27,000** put him to shame. Definitely a top ranker. The paladin class meant he could tank.\n\n\"Send me a party invite,\" Grid said. \"Oh, and I'm taking all the Pope's drops. Fair trade for saving your life, yeah?\"\n\nSilence.\n\n*Agreement.* Damian was running the same quest type. He couldn't refuse even if he wanted to. Grid set himself as leader—for loot distribution purposes—and fired off the invitation.\n\nDamian accepted.\n\n> [Party formed: Grid (Leader), Damian, Rin]\n\n*Level 227.* Grid's eyebrows rose. *On par with the Tzedakah Guild average. Definitely top 200.* \"As expected from a ranker.\"\n\nDamian stared at his rescuer's information.\n\n*Level 150?* The man had arrived like some divine intervention, radiating protagonist energy, and he was barely past the mid-game threshold? *This is the lifeline Rebecca sent me? A rotten rope about to snap?*\n\n**KWARURUNG!**\n\nCrimson lightning punched through the Vatican's ceiling. The bolt struck Grid's black greatsword, wreathing it in crackling red current.\n\n*Pachichik! Pachik!*\n\nThe weapon hummed with power, definitely <span class=\"rarity-unique\">Unique</span> rated or higher.\n\n*That's an incredible weapon,* Damian admitted silently.\n\n\"Buffs.\" Grid glanced at him. \"You're a paladin. Hit me with whatever you've got.\"\n\n*Rebecca paladins don't get buffs. That's common knowledge.* Damian's jaw clenched. Except... his awakening had changed that. He pulled up his new skills.\n\n> [<span class=\"system-skill\">Light's Blessing</span>]\n> \n> Increases party defense, attack power and accuracy by 80% for 3 minutes.\n> \n> Mana Cost: 900  \n> Cooldown: 300 seconds\n\n> [<span class=\"system-skill\">Heart's Desire</span>]\n> \n> Immediately resurrects the dead on the spot.\n> \n> * Does not apply to NPCs\n> \n> Mana Cost: 80% maximum mana  \n> Cooldown: 24 hours\n\n*Incredible.* No existing buff surpassed Light's Blessing. And resurrection—even second advancement Rebecca priests hadn't unlocked that. *I might be the only player with a rez skill right now.*\n\n*This user's weak, but with these skills...* Damian's hope rekindled. *Maybe we have a chance.*\n\n\"<span class=\"system-skill\">Light's Blessing</span>.\"\n\nGolden light washed over Grid. His stats surged.\n\n\"Nice.\" Genuine appreciation colored Grid's voice.\n\nThen he started dancing.\n\n*What the—?* Damian's mouth fell open as Grid launched into an elaborate sword routine. *Is he mocking them? Is this some kind of—*\n\nGrid's feet stopped moving. The dance concluded.\n\nRed-black sword energy exploded from <span class=\"rarity-rare\">Dainsleif</span>.\n\n**Kwa kwa kwa kwang!**\n\n\"Keok—\" Damian hiccuped.\n\nEvery swing carved through space itself. The Vatican's twenty-three elite paladins—the Church's pride—staggered under the bombardment. Priests scrambled to cast heals, but the aura blades came faster. Three, four strikes landed before a single <span class=\"system-skill\">Heal</span> completed.\n\nRecovery fell behind. Paladins retreated, bloodied and gasping.\n\nThe Pope stood exposed.\n\n\"You...!\" His voice shook with fury.\n\nGrid leveled Dainsleif at the trembling pontiff. \"Relying on others for protection? Pathetic.\"\n\n---\n\n**[Glossary of Common Korean Terms]**\n\n**[OG: Glossary Link]**\n\n**Current schedule: 20 chapters a week.**\n\n**Check out my Patreon for early access to a certain number of unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing the day's chapters.**"
}