{
  "id": 125,
  "title": "Chapter 125",
  "content": "# Chapter 125\n\nThe Pope's voice cracked across the temple. \"Do you know who I am? I am Pope Drevigo! Parent to seventy million believers, agent of the Goddess herself. The most sacred being in this world! You dare point a sword at me? Infidel, you aren't afraid of divine punishment?\"\n\nGrid listened. His jaw worked. When he spoke, his voice was flat. \"You spat at me.\"\n\n\"W-What? Disgraceful wretch!\"\n\nColor flooded the Pope's face. A paladin aiding the traitor was bad enough. Now this. The old man's head turned crimson with rage.\n\n\"I will punish you myself! Don't think about leaving here alive!\"\n\nGrid's gaze stayed cold. \"You keep talking about divine punishment.\" He tilted his head. \"Pope. You haven't grasped the situation yet? I came here to inflict divine punishment on you. You're the one who will be punished. Not me. So maybe act a little better? Tsk.\"\n\nThe Pope wasn't the only one annoyed. Grid felt it too. If this old bastard had been normal, the quest would've been simple. Get the pavranium blessed. Leave. But no. The Pope was corrupt, the Church was rotting, and now Grid had to deal with a quest that kept shifting under his feet.\n\n\"The introduction from my father-in-law is useless.\" Grid's fingers tightened on Dainsleif's grip. \"This is really annoying.\"\n\n*Peeng!*\n\nHe squeezed harder. The blade hummed. Then he aimed at the Pope.\n\nThe Pope launched light magic.\n\n*Kwa kwang!*\n\nWhite flash met black flash. The collision tore ten meters of carpet to ash. Red fragments drifted down like angry eyes.\n\n*My sword was blocked?*\n\nGrid's blade had the red lightning enhancement. Damian's buffs layered on top. The fact that it didn't pierce the Pope's magic meant the old man's power exceeded Grid's current attack.\n\n*My attack power right now is higher than Malacus' magic. Malacus couldn't stop me even with a three-layer shield.*\n\nIt didn't make sense. Grid's insight showed the Pope at 24,000 combat power. Damian sat at 12,500 as a level 227 ranker. By pure numbers, two Damians should overpower the Pope.\n\n*The Tzedakah Guild averaged 12,000 combat power during the Malacus raid.*\n\nSeventeen members. Twelve thousand each. Over 200,000 combined. Yet Malacus had crushed them. Which meant Malacus should've been near 200,000 combat power. The Pope at 24,000 should be ten times weaker.\n\nBut after that exchange, the Pope felt stronger than Malacus.\n\n*Well.*\n\nGrid's insight sharpened. The concept clicked into place.\n\n*A small gap in combat power is actually a massive cliff to climb.*\n\nOne ant versus a praying mantis. Two ants don't win. They die.\n\nCombat power wasn't 1+1=2.\n\nIt was 1+1 < 2.\n\nThat's how seventeen guild members got overwhelmed by one Malacus.\n\n\"The sum means nothing,\" Grid muttered. \"Seventeen cats can't beat an elephant. And the Pope is a predator that devours elephants.\" He smiled. \"Strong.\"\n\n\"Cat? Elephant?\" The Pope frowned. \"What are you babbling about?\"\n\nGrid's smile widened. \"I'm either a cat or an elephant. Let's find out which.\"\n\n\"Are you insane?\"\n\n\"Don't worry about it.\"\n\nGrid wasn't discouraged. His blood heated. *Let's see how far I can push this.*\n\nHe'd learned control during the Guardian raid. What he lacked in raw power, he could compensate with precision.\n\n*Pepeng! Pepepeng!*\n\nDainsleif blurred through different angles. Each sword aura flew on a separate orbit. Front. Side. Rear. Unless the Pope had eyes everywhere, he couldn't intercept them all.\n\nGrid grinned.\n\nThe Pope was better than expected. Light magic unfolded in rapid succession, swatting down each energy blade.\n\n\"Useless!\" The Pope thrust both hands forward.\n\n*Kwa kwa kwa kwang!*\n\nWhite magic spread like noon sun. It shattered every black energy sword in the air.\n\n\"Wow.\" Grid watched the brilliant light fade. He actually admired it. \"Really strong.\"\n\nWas he discouraged?\n\nNo.\n\n\"Okay! Time to get serious!\"\n\nPagma's Descendant had a unique buff. Self-only. But the effect was insane.\n\n\"**Blacksmith's Rage**!\"\n\n> [**Blacksmith's Rage** has been activated. Your attack power and attack speed will increase significantly for 20 seconds.]\n\n\"Ohhhh!\"\n\n*Pepepeng! Pepepepeng!*\n\nGrid doubled his sword speed. His arms became a blur.\n\n*Kwa kwa kwa kwang!*\n\nAttacks fell like heavy rain. No pause. No break.\n\n\"Hah...\"\n\nThe Pope's face drained of color. He fired light magic continuously, but the speed couldn't match Grid's onslaught. He released another wide-area burst.\n\nThis time, the result changed.\n\n*Kwa kwa kwa kwang!*\n\nBlacksmith's Rage amplified the energy swords. They tore through the light magic. Then they landed on the Pope's body.\n\n\"You became stronger? Kuaaaaak!\"\n\nThe light shattered. The swords hit again and again. The Pope's scream echoed through the hall.\n\n> [You have dealt 13,300 damage.]\n> [You have dealt 13,910 damage.]\n> [You have dealt 14,080 damage.]\n> [The Best Gauntlets option effect is activated, causing you to attack the target twice.]\n> [You have dealt 28,300 damage.]\n> [Critical!]\n> [You have dealt 31,050 damage.]\n\nThe Pope's health bar plummeted. Grid compared damage to the remaining gauge.\n\n*Around 300,000 total?*\n\nThe Guardian had over 1.2 million. But that was a golem. The Pope was human. Lower inherent health. This boosted Grid's confidence.\n\n*Twenty more hits?*\n\nHe might not need Isabel after all.\n\n\"Puhahahat! The pope should die and drop some items!\" Grid laughed as victory loomed. He attacked relentlessly. The health gauge dropped to a quarter. Then Transcend and Blacksmith's Rage ran out.\n\n\"I'll finish it here!\"\n\nThe Pope was dying. His white garments embroidered with gold thread hung in tatters. Grid closed the distance. Ten meters in seconds. He triggered his strongest skill.\n\n\"Pagma's Swordsmanship, **Kill**!\"\n\n*Kuooooh!*\n\nKilling intent thickened the air. Dark haze wrapped Dainsleif. The blade drove toward the Pope's heart.\n\n\"Goddess' Breath...!\"\n\nThe Pope cast magic. His health bar refilled instantly.\n\n*A heal that restores hundreds of thousands of health?*\n\nBut the magic didn't stop there. A green translucent shield unfolded. It completely neutralized Kill.\n\nGrid's stomach dropped. \"What skill is this? Damn. Is he a guardian knight?\"\n\nThe Pope had an invincible skill meant only for guardian knights. Grid backpedaled.\n\nThe Pope sneered. \"The Goddess' divine blessing fully protects my body and soul. No matter what you do, you can't harm me!\"\n\nThe Pope was fundamentally a priest. If Rebecca's Daughters were peak paladins, the Pope was the peak priest. His bloody body restored. He cast a broad heal on the wounded paladins who'd withdrawn. Then he pointed.\n\n\"What are you doing? Kill that infidel immediately!\"\n\n\"...\"\n\nThe paladins didn't like the Pope. They didn't want to follow an existence that corrupted their church. But depraved or not, he was the Goddess' agent. The high-ranking paladins were deeply religious. They couldn't imagine refusing his order.\n\nThey grabbed their weapons. They rushed Grid simultaneously.\n\n\"Damian!\" Grid barked, eyes darting between opponents. \"What are you doing? Just watching?\"\n\nDamian, who'd been frozen in shock at Grid's display, snapped back to awareness.\n\n\"I'm sorry!\"\n\n*A level 150 overwhelmed the Pope. What the hell is Grid's identity?*\n\nDespite his confusion, Damian threw his weight behind Grid. He had to defend Rin.\n\n*Chaaeng! Chaeng chaeng!*\n\nDamian blocked a paladin's sword with his shield and counterattacked. His blade bit sharp. The paladins struggled to defend. Blood began to flow.\n\nDamian had awakened during this quest. He'd received the strongest buff skill. He was now strong enough to overpower the Church's senior paladins.\n\nNeither Damian nor Grid knew it, but Damian had surpassed Toban, the first-ranked paladin. He couldn't defeat twenty-three paladins alone. But he could tie them up for a while.\n\n\"Good! I'll leave this to you!\"\n\nGrid decided Damian was enough. He rushed the Pope again.\n\nThe Pope blasted him with light magic.\n\n*Pepeng! Kwa kwa kwa kwang!*\n\nThe bombardment concentrated on Grid. He wanted to dodge, but the Pope had read his movement patterns. His reaction rate. The light magic came efficient and precise.\n\n\"Ack!\"\n\n*Pepeng!*\n\nA white ray passed over Grid's head. Another aimed at his face without pause.\n\n*Jeeeong!*\n\nGrid threw up the Divine Shield.\n\n> [The durability of the Divine Shield has decreased by 78.]\n\n*Crazy!*\n\nThe Divine Shield was famous for its resistance to dark magic. But even without that feature, the shield had excellent defense. Yet the Pope's blow reduced durability by an eighth.\n\n*If only I was holding the legendary rated Divine Shield!*\n\nHe needed to kill the Pope quickly. Reclaim the legendary shield. Grid kept the shield raised and pushed forward.\n\n\"How dare an infidel carry our battle gear! Disgraceful!\"\n\n*Kwaang! Kwaang! Kwaang!*\n\nEvery step forward, a ray struck the Divine Shield. The metal warped. Cracks spread. On Grid's seventh step, the Pope prepared to shatter the shield completely.\n\nGrid had no intention of letting that happen.\n\n*Peeng!*\n\nHe tracked the white flash's approach. Put away the Divine Shield. Armed himself with the Ideal Dagger. Used Wind Blast.\n\nSwirling wind twisted the flash's orbit. The ray grazed Grid's cheek.\n\n*Jjejeok!*\n\nPart of the Frostlight Orc Chief's Helmet cracked. A sliver of Grid's face showed through. He endured it.\n\n\"This works.\"\n\nThe Pope ground his teeth. \"You still have tricks left!\"\n\nThat explosion should've blown Grid's head off. The Pope prepared another attack. Two golden discs appeared from nowhere and slammed into his back.\n\n\"Kuk?\"\n\nThe Pope's eyes went wide.\n\nGrid used Quick Movements. He closed the gap. Fired Pagma's Swordsmanship, **Link**.\n\n*Pipit! Pipipipipi!*\n\nThe dagger attacked incomparably faster than the greatsword. Quick Movements maximized his agility.\n\nGrid unleashed twenty-two strikes with the Ideal Dagger. Each dealt less damage than Dainsleif. But the dagger's delicate control meant every hit landed.\n\n\"Kuaaaak! You!\"\n\nThe Pope screamed and counterattacked. His magic aimed precisely at Grid's heart.\n\n*Peeng!*\n\n\"No!\" Damian's scream cut through the temple. Grid's health had dropped by more than half. A single strike.\n\n*Stun.*\n\nPlayers who lost over 40% health in one hit got stunned. Unprotected. Damian wanted to rush over. Give healing. Give protection. But the paladins blocked him.\n\n*This is the end! The quest will fail! I can't save Rin-chan!*\n\nThen something strange happened.\n\nGrid took no potion. Yet his health recovered. He remained unaffected by any status effect.\n\nGrid coolly plunged his dagger deep into the Pope's heart.\n\n---\n\n**Glossary of Common Korean Terms.**  \nOG: Glossary Link.  \nCurrent schedule: 20 chapters a week.  \nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}