{
  "id": 126,
  "title": "Chapter 126",
  "content": "# Chapter 126\n\nThe ray of light punched through Grid's chest. He staggered backward, boots scraping stone as his vision tunneled.\n\n> [You have suffered 14,560 damage.]\n> [You have lost 52% of your health from a single blow.]\n\nHis knees threatened to buckle. The world tilted. A normal player would be locked in the 'Stunned' status, but Grid's body refused to collapse. Then green light pulsed from the blue ring on his finger.\n\n> [The effect of Doran's Ring has been activated.]\n> [7,280 health has been restored.]\n\nThe searing pain in his chest dulled to a throb. Grid's spine straightened. He surged forward and drove the **+8 Ideal Dagger** into the Pope's heart.\n\n\"Cough!\" Black blood sprayed from the Pope's mouth. His face twisted in disbelief.\n\n*What is this situation?*\n\nThe Pope's mind reeled. The masked bastard should be dead—Grid's heart was destroyed. Yet instead of crumpling, he'd counterattacked?\n\n\"This monster...! **Goddess' Breath**!\"\n\nWhite light flooded the Pope's body, restoring his health bar instantly. He lashed out with a desperate kick, trying to create distance. Grid slipped the strike and clamped both hands around the Pope's ankle.\n\n\"You.\" Grid's voice dripped venom through the helmet. \"Did you think you could run?\"\n\nThe Pope's blood went cold. \"Let me go!\"\n\n\"No.\"\n\nGrid's fist crashed into the Pope's face. Bone crunched. He seized the Pope's shoulders and slammed him into the marble floor. The **Frostlight Orc Chief's Helmet** tilted down, eye sockets burning with madness.\n\n\"Let's experiment. How long can you keep healing?\"\n\n\"You bastard!\"\n\nGrid stabbed. The dagger punched through robes, through flesh, into the Pope's heart. He ripped it free. Stabbed again. And again.\n\n> [Critical hit!]\n> [You have dealt 7,500 damage.]\n\n> [Critical hit!]\n> [You have dealt 6,980 damage.]\n\n> [Critical hit!]\n> [You have dealt 7,330 damage.]\n\nEvery thrust found the vital point. Blood sprayed in arterial jets, painting the white marble in spreading crimson pools.\n\n\"Puhahaha! Die! Die!\" Grid's laughter echoed off the vaulted ceiling.\n\n\"Kuaaaaack!\" The Pope's scream was wet, gurgling.\n\nThe paladins and priests stood frozen, faces drained of color. The man in the grotesque skull helmet straddled the Holy Father's body like a butcher over livestock. Blood and shredded flesh flew with each strike. The Pope's shrieks mingled with that horrible, grating laughter.\n\nOne priest doubled over, retching onto the sacred floor.\n\n*A demon.* The thought crystallized in their minds. *A demon has come to punish wickedness with greater evil.*\n\nDamian's eyes widened behind his helmet. Recognition hit him like cold water.\n\n*The butcher from the broadcast.* The psychopath who'd massacred the Giant Guild in Winston. The rumors were true.\n\n*He fights like a monster.*\n\nThe dagger rose and fell, rose and fell. The Pope's body jerked with each impact, unable to resist. The skull helmet's eye sockets glowed with that eerie light, making the scene even more nightmarish.\n\nThe Pope's mind couldn't process it. He ruled seventy million souls. Kings knelt before him. He was the Goddess' agent on earth, one of the most divine beings in the world. And now this—this nobody was butchering him like a pig.\n\n\"Kuaack!\"\n\nRage overwhelmed humiliation. The Pope's body erupted with blinding white light.\n\nGrid's instincts screamed. He threw himself backward.\n\n> [You have suffered 12,600 damage.]\n> [You have lost 45% of your health from a single blow.]\n\nThe light seared through his armor. The **Frostlight Orc Chief's Helmet** cracked, blood-soaked red giving way to spiderwebbing fissures. Grid's face showed through the gaps.\n\nThe Pope staggered upright, gasping. \"**Goddess' Wrath**!\"\n\nReality warped. Two massive golden circles materialized behind the Pope, each three meters wide. Energy condensed within them, building to a roar.\n\nGrid's eyes narrowed. Mana saturated the air, thick as syrup.\n\nTwin beams of annihilation screamed forward.\n\n\"This is the strongest divine magic!\" The Pope's voice cracked with triumph. \"You cannot survive this!\"\n\n\"Only **Everiel's Shield** can stop that!\" Rin's shout cut through the building thunder.\n\nGrid didn't retreat. He raised one hand.\n\nTwo small golden discs flickered into existence.\n\nThe white flash met shining pavranium.\n\nThe world exploded.\n\nStone shattered. The five-hundred-year-old Vatican groaned, pillars cracking like kindling. Priests and paladins scattered, screaming as debris rained from above.\n\n\"Rin-chan!\" Damian lunged through the chaos and wrapped his arms around her. A chunk of masonry slammed into his back. He grunted but held firm. \"Are you okay?\"\n\n\"Damian...\" Something shifted in Rin's chest as she looked up at him. Blood ran down his temple. His arms were warm. Solid.\n\n*Someone is protecting me.*\n\nHer entire existence had been as a shield for the Church. This was new. Strange. It made her heart ache.\n\nShe summoned **Ikael's Sword**, white light coalescing into a blade.\n\n\"I will fight too!\" Determination hardened her voice. \"If this is the goddess' will, I will follow it. We'll punish the corrupt Pope and rebuild the Vatican!\" She met Damian's eyes. \"Together, we'll lead the Rebecca Church back to the righteous path.\"\n\n\"Rin-chan...!\" Heat flooded Damian's face.\n\n\"Rin! Are you okay?\" Isabel sprinted through the rubble, Luna's unconscious form left behind. The collapse had sent terror through her. *What if Rin died to the Pope's attack?* But there she was—alive. Whole. Tears blurred Isabel's vision.\n\nRin's grip tightened on her blade. \"Isabel! I will defeat His Holiness. He has sinned. The goddess wills it!\"\n\nIsabel nodded, jaw set. \"Yes. Let's fight together.\"\n\nThe two strongest paladins of the Rebecca Church turned as one toward their enemy.\n\nA voice cut through the settling dust.\n\n\"Don't.\" Grid stepped from the smoke, armor shattered, helmet gone. \"Take. My. Prey.\"\n\nHis face was cold. Furious.\n\n\"Damn bastard. I'll make you pay for destroying my gear.\"\n\nOn the far side of the ruined hall, the Pope's voice wavered. \"How did you stop **Goddess' Wrath**? What are those golden discs?\"\n\nThe papal throne stood intact amidst the devastation. The Pope slumped against it, robes torn, hair matted with blood and dust. All dignity stripped away.\n\nGrid's hand closed around **Dainsleif's** hilt.\n\nDamian recognized the killing intent. He raised both hands. \"**Light's Blessing**!\"\n\nGolden radiance washed over the greatsword. The blade began to glow, brighter and brighter.\n\nGrid's muscles coiled. He swung with every ounce of strength.\n\n\"**Golden Flash**!\"\n\nA tidal wave of light erupted from **Dainsleif**, carving through the wrecked Vatican toward the Pope.\n\nThe Pope threw up a shimmering barrier—one designed for physical attacks.\n\nHis eyes went wide.\n\n\"Magic power...!\"\n\n**Golden Flash** dealt damage proportional to the wielder's magic stat. Grid rarely used it—his strength far exceeded his intelligence. But now, with perfect timing, the skill bypassed the physical shield entirely.\n\n\"Kuaaaak!\" The Pope's scream was raw agony.\n\nGrid didn't stop. \"**Pagma's Swordsmanship, Link**!\"\n\n> [The level of Link has risen.]\n> [Your damage will increase. The number of times a target is hit will increase by 5 times.]\n\nFirst time. After hundreds of uses, the skill finally leveled up. Seventeen strikes blurred through the air, each one tearing into the Pope's flesh.\n\n\"**Goddess' Protection**!\"\n\nA pale green shield materialized around the Pope's body just as the final strike landed.\n\n\"Die!\"\n\nThe Pope's face twisted into a savage grin. Light magic detonated outward in all directions.\n\nTwo golden discs couldn't cover Grid's entire body. The blast slammed into him.\n\n> [You have suffered 13,000 damage.]\n> [You have suffered 9,500 damage.]\n\nGrid's knees buckled. But he didn't fall.\n\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\n\"What...?! What the hell are you?\" The Pope's voice cracked. \"Why won't you fall?\"\n\nHe tried to cast a healing spell. His mana pool was nearly empty—**Goddess' Wrath** had drained him dry. Physical and mental exhaustion dragged at him like chains. The magic wouldn't come.\n\nHe had nothing left.\n\nGrid raised **Dainsleif** overhead, blade catching the dying light.\n\n\"I...\" His voice rang through the ruins. \"Am a legend! **Pagma's Swordsmanship, Kill**!\"\n\n> [The level of Kill has risen.]\n> [Your damage will greatly increase.]\n\nThe Pope scraped together the dregs of his magic power. A flickering shield appeared.\n\nThe greatsword punched through it like paper and buried itself in the Pope's chest.\n\n\"Cou...gh! You...!\"\n\nBlood poured from the Pope's mouth. His eyes, red with broken vessels, fixed on Grid. His body began to dissolve into grey particles of light.\n\nNotification windows flooded Grid's vision.\n\n> [You have defeated the 13th Pope Drevigo, who was corrupting the Rebecca Church!]\n\n> [500 gold has been acquired.]\n\n> [Party leader 'Grid' has acquired the Goddess' Essence.]\n\n> [Party leader 'Grid' has acquired the <span class=\"rarity-legendary\">Holy Light Armor</span>.]\n\n> [Party leader 'Grid' has acquired the <span class=\"rarity-legendary\">Holy Light Gloves</span>.]\n\n> [Party leader 'Grid' has acquired the <span class=\"rarity-legendary\">Holy Light Crown</span>.]\n\n> [145,350,000 experience has been acquired.]\n\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level has risen.]"
}