{
  "id": 127,
  "title": "Chapter 127",
  "content": "# Chapter 127\n\n\"Kuaaaaak!\"\n\nPope Drevigo's reign ended. The man who had been more wicked than any sinner and more divine than any saint collapsed, his body dissolving into light. Dozens of flashes erupted around Grid's armor.\n\nDamian's eyes widened. The party window showed Grid's level jumping from 150 to 170 in seconds.\n\n*Twenty levels at once.*\n\nThe system had rewarded Grid for killing a man who ruled over seventy million believers. Damian, meanwhile, had gained almost nothing. A pittance of experience. No items. The system had judged his contribution worthless.\n\nHe should have felt bitter. Instead, relief washed over him.\n\n*I just threw buffs at him and distracted some paladins. He fought the Pope alone.*\n\nThe bizarre skull helmet lay shattered on the floor. Damian studied Grid's exposed face. Younger than expected. Unremarkable.\n\n*But he cleared my quest.*\n\nNotification windows bloomed before his eyes.\n\n> [The quest 'Goddess' Divine Punishment' has succeeded.]\n> \n> [You have changed to the unique hidden class 'Goddess' Agent.']\n> \n> [You are qualified to become the pope.]\n> \n> [There is a possibility that you will be elected as a pope candidate.]\n> \n> [If you are crowned as the pope, you can run the Rebecca Church. Please be patient until the day when tens of millions of people worship you.]\n> \n> [The skill Goddess' Breath has been created.]\n> \n> [The skill Goddess' Breath has been mastered.]\n> \n> [The skill Goddess' Protection has been created.]\n> \n> [The skill Goddess' Protection has been mastered.]\n> \n> [The skill Divine Message has been created.]\n> \n> [The Dignity stat has been opened.]\n> \n> [The growth rate of divine power will become three times higher.]\n\nThe skill descriptions unfolded.\n\n> **[Goddess' Breath]**\n> Recovers 100% of your health and 70% of your party members' health.\n> Skill Mana consumption: 30% of the maximum mana.\n> Skill Cooldown Time: 10 minutes.\n\n> **[Goddess' Protection]**\n> Creates a shield of absolute defense that will invalidate an enemy's attack once.\n> Skill Mana Cost: 2,000\n> Skill Cooldown Time: 1 hour.\n\n> **[Divine Message]**\n> You can hear the voice of Goddess Rebecca. The goddess will give you a lot of advice. You can earn big profits if you act on that advice.\n> Skill Activation Condition: Random\n\n*The Pope used these every few minutes, but that was NPC privilege. For me, the cooldowns are brutal.*\n\nDamian's hands trembled. Not with disappointment. With euphoria.\n\n*I have a unique hidden class.*\n\nHidden classes came in four tiers: Rare, Epic, Unique, and Legendary. Most known classes were Rare. Three Epic classes existed in the entire game. No one had ever confirmed a Unique class.\n\nUntil now.\n\n*Thirty-two years. I've lived thirty-two normal, mediocre years without feeling accomplished once.*\n\nHis throat tightened.\n\n*Grid. You're my benefactor. I don't care if you're a psychopath. To me, you're an angel. Someday I'll repay this debt.*\n\nGrid sprawled on the rubble, oblivious. He'd killed the Pope to clear his own quest, not to help some stranger. He had no idea what Damian had just obtained.\n\nBut the debt existed regardless. One day, Damian would repay it. One day, Grid would gain an ally without ever knowing why.\n\n\"I'm done.\" Grid collapsed onto his back without ceremony. \"Can't move a damn finger.\"\n\nThe Vatican lay in ruins. A few pillars remained standing. The ceiling had caved in completely, exposing the blue sky. Grid stared up at the clouds, a satisfied smirk on his face.\n\n*Jackpot.*\n\nHe pulled up his inventory.\n\n> [<span class=\"rarity-legendary\">Holy Light Armor</span>]\n> Rating: Legendary (Set)\n> Durability: 924/924 Defense: 872\n> \n> * There is a high chance of completely resisting dark spells.\n> * 300% increased in magic recovery effects.\n> * 40% reduction in damage from physical attacks.\n> * 50% reduction in damage from magic attacks.\n> \n> When 3 set items are equipped: Defense +500, health +6,000.\n> \n> An armor that the legendary blacksmith Pagma made for 5th Pope Franz.\n> Thanks to this armor made by the god mineral adamantium, Franz was able to survive many times in the war against the Yatan Church.\n> Since it was an armor customized for Franz, the other popes have stored this armor away.\n> \n> Conditions of Use: Franz.\n> Weight: 1,517\n\n> [<span class=\"rarity-legendary\">Holy Light Gloves</span>]\n> Rating: Legendary (Set)\n> Durability: 300/300 Defense: 130 Attack Speed: +20% Accuracy +40%\n> \n> * There is a normal chance of activating '5 Joint Attacks.'\n> * There is a high chance of activating 'Counterattack.'\n> \n> When 3 set items are equipped: Defense +500, health +6,000.\n> \n> An armor that the legendary blacksmith Pagma made for 5th Pope Franz.\n> There is a legend that Franz, who has a weak sword technique, became a master of the sword when wearing these gloves.\n> Since the gloves were personally customized for Franz, the other popes have stored these gloves away.\n> \n> Conditions of Use: Franz.\n> Weight: 10\n\n> [<span class=\"rarity-legendary\">Holy Light Crown</span>]\n> Rating: Legendary (Set)\n> Durability: 180/180 Defense: 20\n> \n> * Intelligence +300\n> * Dignity +200\n> \n> When 3 set items are equipped: Defense +500, health +6,000.\n> \n> A crown that the legendary blacksmith Pagma made for 5th Pope Franz.\n> There is a legend that Franz became more intelligent and dignified after wearing this crown.\n> Since the crown was personally customized for Franz, the other popes have stored this crown away.\n> \n> Conditions of Use: Franz.\n> Weight: 25\n\nThe crown's defense was pathetic. But the set bonus would compensate.\n\n*The armor and gloves though. Those are beautiful.*\n\nGrid equipped all three pieces.\n\n> [A penalty is applied because the item conditions aren't met.]\n> \n> [Defense of <span class=\"rarity-legendary\">Holy Light Armor</span> will decrease by 55%.]\n> \n> [As your understanding of the <span class=\"rarity-legendary\">Holy Light Armor</span> increases, the penalty will decrease.]\n> \n> [Defense of <span class=\"rarity-legendary\">Holy Light Gloves</span> will decrease by 55%.]\n> \n> [As your understanding of the <span class=\"rarity-legendary\">Holy Light Gloves</span> increases, the penalty will decrease.]\n> \n> [Defense of <span class=\"rarity-legendary\">Holy Light Crown</span> will decrease by 55%.]\n> \n> [As your understanding of the <span class=\"rarity-legendary\">Holy Light Crown</span> increases, the penalty will decrease.]\n\nGrid winced. Fifty-five percent penalty. The armor's 872 defense became 393. The gloves dropped to 59. The crown, a measly 9.\n\n*But the set bonus still applies. And the option effects.*\n\nHe forced optimism.\n\n*Understanding increases with use. I wore Dainsleif down to a 20% penalty. This is fine.*\n\nThen reality set in.\n\n*Who the hell is going to buy Franz-exclusive gear? Can't auction this garbage. What a waste.*\n\nFirst legendary drops, and they were vendor trash to everyone except him.\n\nA new window appeared.\n\n> [The quest 'Help the Rebecca Church!' has succeeded.]\n> \n> [Affinity with the Rebecca Church has risen to the maximum. Members of the Rebecca Church will have unlimited affection and trust in you. You will be able to receive aid from them.]\n> \n> [Talk to Rebecca's Daughter, Isabel. She will give the goddess' blessing to the pavranium.]\n\nGrid groaned. His stamina had recovered enough to move. He unequipped the Holy Light set and pushed himself upright. Isabel stood nearby with Rin, Damian, and dozens of church members. All watching him.\n\n\"Grid.\" Isabel approached. Tears tracked down her cheeks. \"Thank you. The goddess' honor... you protected it. You saved Rin. You saved all of us.\"\n\nShe bowed. Deep. Formal.\n\nThe other paladins and priests followed suit. Dozens of bodies bent in unison.\n\nSilence filled the ruined Vatican.\n\nThese people thought Grid was their savior. The man who'd purged the corruption that had festered for two years.\n\n*This is amazing.*\n\nDamian stared at Grid with naked envy. It was like something from a comic. The hero defeats evil, and everyone honors him. The protagonist's moment of glory. The exact fantasy Damian had been chasing his entire life.\n\nHe wanted to be Grid so badly it hurt.\n\nThen Grid opened his mouth.\n\n\"For free?\" Grid made a circular gesture with his thumb and forefinger. His eyes gleamed. \"If you really appreciate it, shouldn't you show me some courtesy? The Rebecca Church is loaded, right?\"\n\nDamian's jaw dropped.\n\n\"Give me a tip. Look at me. My helmet's destroyed. My armor's wrecked. I took massive damage fighting that old man. Plus, I deserve compensation for the mental anguish Isabel caused when she stole my Divine Shield.\"\n\nThe silence changed texture. Became uncomfortable.\n\nDamian muttered under his breath. \"This guy is really...\"\n\n***\n\nGrid followed Isabel and Rin through the rubble. They reached the center of the collapsed Vatican. Despite the destruction, the Rebecca statue remained pristine. Not a scratch on the white stone.\n\nGrid handed Isabel the two golden discs.\n\n\"Use the goddess' blessing on these.\"\n\nIsabel accepted them. She knelt before the statue. Her lips moved in silent prayer.\n\nMinutes passed.\n\nWarm light descended from the sky, wrapping around the golden discs like cloth.\n\n*Ttiring~*\n\n> [Goddess Rebecca's blessing has fallen on the pavranium.]\n> \n> [The pavranium will be able to demonstrate recovery abilities.]\n\n\"Recovery ability?\" Grid pulled up the item window.\n\n> [Golden Discs Made of Pavranium]\n> Durability: Infinite\n> \n> Golden discs made of pavranium, the strongest mineral produced by the collaboration between the legendary blacksmith Pagma and the legendary great magician Braham.\n> \n> By default, they revolve around and protects their owner. They will also take other actions when given commands from their owner.\n> \n> * They have obtained healing skills due to Goddess Rebecca's blessing. They will increase their owner's health recovery speed by 300%.\n> \n> Weight: 5\n\n\"Holy shit.\"\n\nThe mineral could learn skills. He'd never considered that possibility.\n\n*Three more gods to go. Dominion, Judar, Yatan. Each blessing will add another skill.*\n\nGrid's mind raced with possibilities. Then stopped cold.\n\n*Yatan. The enemy. How am I supposed to get a blessing from the god whose church I'm slaughtering?*\n\nHe was still frowning when Damian rushed over.\n\n\"Mr. Grid!\"\n\n\"What?\" Grid's tone was flat, irritated by the sudden shouting.\n\nDamian's eyes were wild. Desperate. \"Can I rub my cheek against those golden discs? Please. It's my life's dream.\"\n\nGrid stared. \"Why would you want that?\"\n\nDamian snorted like a bull in heat. \"They just touched Isabel's chest! I want to feel the warmth of her bosom!\"\n\n\"What?\"\n\nThe words were so absurd Grid thought he'd misheard. This ordinary-looking man was talking like a complete degenerate.\n\nIsabel's elbow crashed into Damian's ribs.\n\n\"Keo... keook!\" Damian collapsed, his face twisted in pain and ecstasy. \"Isabel's elbow... haack...\"\n\nIsabel's face burned red. She kicked Damian across the floor.\n\nThen she turned to Grid, still stunned, and held out the Divine Shield.\n\n\"We need money to rebuild the Vatican. I can't give you a tip, but...\" She pushed the shield toward him. \"I promised you this.\"\n\nThe legendary Divine Shield. Stolen months ago. Finally returned.\n\n> [<span class=\"rarity-legendary\">Perfect Divine Shield</span>]\n> Rating: Legendary\n> Durability: 680/680 Defense: 370 Magic Resistance: 280\n> \n> * There is a high chance of completely resisting dark spells.\n> * The skill 'Divine Light' will be generated.\n> * The skill 'Divine Favor' will be generated.\n> \n> An item made by a craftsman with great skills and potential, but his experience and reputation is somewhat lacking.\n> Thanks to the power of Cassus, a priest of the Rebecca Church, it shines with the divine power of the goddess of light. Due to its strength against dark magic, all followers of demons and the Yatan Church will suffer when facing this shield.\n> \n> User Restriction: Level 190 or higher. More than 500 strength. More than 1,000 divine power. A member of the Rebecca Church.\n> Weight: 800\n\n\"Good enough.\"\n\nWith this shield, he could handle the Yatan Servants.\n\n*If I can't get Yatan's blessing willingly, I'll beat it out of them.*\n\nIsabel's expression softened. \"Are you leaving now?\"\n\nRegret colored her voice. But Grid was already thinking about Winston. About his beautiful bride waiting for him. About the hot night ahead.\n\n\"I have to go. Wait.\" He paused. \"Do you have connections with the Dominion and Judar churches? I need blessings from their gods too.\"\n\nIsabel's face brightened. \"The Dominion Church and Judar Church are like our brothers. They pledged allegiance to our Pope... I can help with that.\"\n\nShe'd felt guilty about having nothing to give him. This was a chance to repay the debt.\n\n\"I'll write you an introduction letter. They'll give you the blessings with my recommendation. I'd like to accompany you, but...\" She glanced at the ruins. \"We have work to do. Electing a new Pope. Rebuilding the Vatican. I'm sorry.\"\n\nGrid looked at Damian, still groaning on the floor. Looked back at Isabel.\n\n\"Don't be sorry. I don't want to travel with a crazy girl like you anyway. The letter's enough.\"\n\n\"W-what?\"\n\nIsabel's face fell. Rin shot Grid a reproachful look. He didn't notice.\n\nHe took the letter, turned, and headed for the nearest Dominion Church."
}