{
  "id": 128,
  "title": "Chapter 128",
  "content": "# Chapter 128\n\nThree religions dominated the continent. The Judar Church. The Dominion Church. The Rebecca Church.\n\nThey didn't war against each other. Politics, alliances, shared theology—all bound them together in an unbreakable trinity. Goddess Rebecca reigned supreme over her two sons: Judar, god of health and wisdom, and Dominion, god of war. The Rebecca Church stood as the mother institution, dispensing justice and light. The Judar Church hoarded knowledge and healing arts. The Dominion Church bred warriors and conquest.\n\nBut the current leader of the Judar Church wanted more than his station allowed.\n\nPascal leaned back in his chair, fingers steepled. \"The 5th Pope Franz came from our ranks. The Rebecca Church had no one qualified at the time, so they borrowed him. Placed him on the papal throne like a piece on a game board.\"\n\nThe man across from him said nothing.\n\nPascal continued, warming to his subject. \"Look at Drevigo now. That corrupt parasite shames the office. Everyone knows it. They whisper in corners, but no one acts. The Rebecca Church rots from the head down because of him.\" He stood, pacing. \"He should resign. A new pope must rise. Someone with vision. Someone with legitimacy.\"\n\nHe turned, eyes bright with ambition.\n\n\"Franz set the precedent. I am his descendant. My lineage, my talent, my devotion—all of it points to one conclusion. I *should* be the next pope.\"\n\nThe black-haired man listening had heard enough preamble. Toban was 1st on the paladin rankings, chief of staff for the Tzedakah Guild, and he had learned long ago that nobles loved the sound of their own voices. He cut through the rhetoric with a single question.\n\n\"What do you need from me?\"\n\nPascal smiled. \"The Rebecca Church keeps Franz's battle gear locked away. The <span class=\"rarity-legendary\">Holy Light Crown</span>, the <span class=\"rarity-legendary\">Holy Light Armor</span>, and the <span class=\"rarity-legendary\">Holy Light Gloves</span>. I want them back.\"\n\nThe system announcement materialized.\n\n> **[A quest has been created.]**\n\n> **[Franz' Descendant]**\n> \n> **Difficulty:** SS\n> \n> The 5th Pope Franz remains the most respected pontiff in history. His reign built the foundation of the Rebecca Church's current power.\n> \n> Pascal dreams of ascending to the papal throne! He seeks to prove his lineage by reclaiming Franz's legendary battle gear. If he succeeds, the factions opposing the corrupt Pope Drevigo may rally behind him.\n> \n> Use any means necessary to retrieve the <span class=\"rarity-legendary\">Holy Light Crown</span>, <span class=\"rarity-legendary\">Armor</span>, and <span class=\"rarity-legendary\">Gloves</span>. Pascal will prove his identity by wearing the gear—items that only Franz's bloodline can equip.\n> \n> **Quest Clear Conditions:** Retrieve all three pieces of Franz's battle gear.\n> \n> **Quest Clear Reward:** **Level +5**, <span class=\"rarity-legendary\">Sword of Wisdom</span>\n> \n> **Quest Failure:** Pascal's ambitions crumble. Your standing with him will plummet.\n\n*Five levels.*\n\nToban's pulse quickened. The unified rankings shifted on fractions of a percent. He was Level 232, ranked 68th globally. Five levels represented two months of brutal grinding—handed to him in a single quest clear.\n\n*But that's not even the real prize.*\n\nHe pulled up the item description.\n\n> **[<span class=\"rarity-legendary\">Sword of Wisdom</span>]**\n> \n> **Rating:** Legendary\n> \n> **Durability:** 500/500\n> \n> **Attack Power:** 385\n> \n> **Attack Speed:** +3%\n> \n> * When attacking normally, there is a chance to reset skill cooldown times.\n> * **Intelligence +250**\n> \n> A divine artifact of the Judar Church. In ages past, the church leader bestowed it only upon their most trusted paladin.\n> \n> **Conditions of Use:** Best paladin of the Judar Church\n> \n> **Weight:** 450\n\n*That option is broken.*\n\nThe raw attack power looked mediocre for a Unique-rated Level 230 sword, let alone a Legendary. But the cooldown reset mechanic? Stack it with attack speed buffs and the synergy would explode. Infinite skill chains. Perpetual damage output.\n\n*With this, I could level as fast as Pon and Ibellin.*\n\nThe thought stung. Grid had put him dead last on the production queue after the Guardian of the Forest debacle. Watching his guildmates parade around in custom gear while he scraped by with marketplace trash—it grated. This sword represented salvation.\n\nThe failure penalty loomed like a guillotine blade. Affinity loss with the Judar Church leader could cripple his standing. SS-difficulty meant the odds sat somewhere south of terrible.\n\nBut the rewards...\n\nToban straightened. \"I'll leave for the Vatican immediately.\"\n\n> **[The quest has been accepted.]**\n\nPascal's smile widened. \"As expected from our finest paladin. I have a spy embedded in the Vatican. He'll reveal where the treasures are hidden. Follow his instructions precisely.\"\n\n\"Understood.\"\n\nToban didn't waste time. He headed for the door, already composing a message to the guild chat.\n\n---\n\n{Guys! Just picked up an SS-grade quest!!}\n\n{FINALLY! When's my turn for the good RNG?}\n\n{ㅊㅋㅊㅋ What's the loot?}\n\n{Legendary sword. -_-v}\n\n{Legendary reward? Jackpot ㄷㄷ}\n\n{Wait, SS-difficulty though? Can you solo that?}\n\n{Probably not. Anyone free to help? I'll owe you.}\n\n{What's the objective?}\n\n{Break into the Rebecca Vatican. Steal three treasures.}\n\n{...The Vatican?}\n\nThe chat went cold. Toban watched the typing indicators flicker and die.\n\n{Aren't Rebecca's Daughters stationed there? You'd have to FIGHT them?}\n\n{Isn't that worse than Malacus? ;;;}\n\n{There's THREE of them. ㅡ,ㅡ;}\n\n{Um... Toban, I'm sorry but count me out. If things go sideways, I'm dead.}\n\n{Same... too risky. Sorry man.}\n\n{Maybe just skip this one? ~ _ ~;;}\n\nToban's jaw clenched. *These bastards.*\n\nHe understood the logic. Death meant lost levels. Lost items. Lost time. For rankers, a single death could erase weeks of progress. Loyalty only stretched so far when stacked against real consequences.\n\nBut there was one person who might help. Regas. The volunteer. The guy who threw himself into impossible situations just to test his limits.\n\nToban fired off a whisper.\n\n> **[The other person has blocked all whispers.]**\n\n\"Damn it!\"\n\nRegas went dark when he trained. Complete radio silence, sometimes for a week straight. Of course this would be one of those times.\n\nToban sighed. *Guess I'm doing this alone.*\n\nHe started mentally mapping stealth routes through the Vatican when a new whisper arrived.\n\n{Chief, if you don't mind... can I help you?}\n\n*Box?*\n\nBox was one of the six new rankers the Tzedakah Guild had recruited. Linker class. Ranked 1st among Linkers, 230th on the unified rankings—dead last in the guild. But his potential was undeniable. The class required surgical precision and magic power control that would break most players.\n\n{Oh? I'd appreciate that! But you know we might have to deal with Rebecca's Daughters, right?}\n\n{I'm aware of the risk. Black Teddy and Asuka want to help too. Four of us against Rebecca's Daughters? We can handle it. Or at least escape alive.}\n\nToban frowned. Black Teddy, the 1st ranked Summoner. Asuka, somewhere in the top 20s. All three of them, volunteering for a suicide mission.\n\n*They want something.*\n\n{What's the price?}\n\n{Let us meet Bone Helmet.}\n\nThere it was. All six of the new rankers had joined for one reason—to get close to Grid. They were obsessed with uncovering his class, convinced it was some mythic hidden tier.\n\n{I've told you before. I can't reveal his identity until I trust you completely.}\n\n{We just want to talk to him... Look, okay. You don't have to tell us now. I'll help as a favor?}\n\n{A favor?}\n\n{Building trust, right? Comradery through shared risk? We help you now, you trust us faster, eventually we meet him. Simple transaction.}\n\n{So your intentions are entirely selfish.}\n\n{Haha, yes.}\n\n{...Fine. I need the help. Thank you.}\n\nThey arranged a rendezvous point near the Vatican. Toban sent the coordinates and logged off to prepare.\n\n---\n\nTwo days later, Toban stood alone at the meeting spot. No sign of Box's group yet.\n\nA nondescript man in priest's robes approached. Pascal's spy. He moved with the careful gait of someone used to avoiding attention.\n\nThe spy's first words hit like a hammer.\n\n\"Pope Drevigo is dead.\"\n\nToban blinked. \"What?\"\n\n\"Killed by one of the blessed.\" The spy used the NPC term for users. \"Someone like you. He lost his life to a player.\"\n\n\"That's...\" Toban's mind reeled. The Pope was easily Level 350, protected by legendary-tier gear and Rebecca's Daughters. The idea that a user could solo him seemed impossible. \"Who? What's his name? How did he do it?\"\n\nThe spy shook his head. \"I was hiding. Couldn't confirm his identity. But his swordsmanship was... exceptional. He dismantled the Pope methodically.\"\n\n*Could it be Kraugel?*\n\nPon talked about the 1st ranked user like he was a force of nature. According to him, even if Pon, Regas, and Jishuka fought together, Kraugel would tear through them. If anyone could solo the Pope, it would be him.\n\n*Or maybe someone we've never heard of.* The world was massive. Two billion users. Hidden monsters everywhere. Euphemina had demolished Faker a few months back, and no one saw her coming.\n\nBut still.\n\n\"What about Rebecca's Daughters? They're supposed to guard the Pope. Did they die with him?\"\n\n\"No. They're unharmed.\"\n\n\"They're ALIVE while the Pope is DEAD?\" Toban's voice rose.\n\nThe spy nodded. \"Drevigo was... controlling them. Abusing his authority. One of the Daughters, Rin, was about to be discarded entirely. So when the attack came, they didn't intervene.\"\n\n\"The Pope was a fool.\"\n\nToban didn't care about papal politics. He cared about Franz's treasures. He forced himself to focus.\n\n\"Fine. The Vatican will be in chaos. Security should be weak. Where are Franz's treasures hidden?\"\n\nThe spy's expression shifted. Uncertain. Apologetic.\n\nToban's stomach dropped. \"Don't tell me—\"\n\n\"The user who killed the Pope. He took Franz's battle gear.\"\n\n\"WHAT?\" Toban grabbed the spy's collar. \"And Rebecca's Daughters just let him walk out with it? Those items are sacred to the church!\"\n\n\"They...\" The spy swallowed. \"They felt they couldn't reward him enough. He saved them from Drevigo's tyranny.\"\n\n\"This is insane!\"\n\nThe quest was collapsing before it even started. Toban released the spy, pacing in tight circles.\n\n\"This is bad. This is very, very bad.\"\n\nFootsteps approached. Box's group materialized from the tree line—Box himself, a stocky man carrying a teddy bear (Black Teddy), and a young woman with multiple legendary weapons strapped to her back (Asuka).\n\nBox grinned. \"Hope we didn't keep you waiting, Chief.\"\n\nToban looked at them, then back at the spy, then up at the sky.\n\n*Yeah. This is definitely going to be a disaster.*"
}