{
  "id": 129,
  "title": "Chapter 129",
  "content": "Chapter 129\n\nBox spotted Toban first and waved him over. \"You beat us here.\"\n\nBox was the kind of man who turned heads. Sharp jawline, clear skin, eyes that could pierce through steel. His long black hair was tied back in a style that belonged in an old painting. The effect was immediate and calculated.\n\nBut looks only went so far. The man was a serial philanderer. His nickname, Octopus Prince, came from the way he kept multiple women \"on the hook\" simultaneously. The Box Killing Group, an entire coalition of spurned female players, existed solely to hunt him down.\n\nToban shifted his weight, still rattled from his conversation with the spy. \"Right on time.\"\n\nBlack Teddy and Asuka approached next. Toban offered them the same greeting, but neither bothered with pleasantries.\n\n\"Let's move.\" Black Teddy's voice was flat.\n\nThe man stood well over two meters tall, built like a brick wall. Everything about him screamed intimidation—the hard eyes, the squared shoulders, the way his presence seemed to shrink the space around him. Everything except the teddy bear cradled in his arms. That goddamn teddy bear. Toban had met Black Teddy half a dozen times now, and the cognitive dissonance still hadn't worn off.\n\n*That thing is cursed.* \n\nA massive, hairy hand patted the bear's head. Toban suppressed a grimace.\n\nThe spy sidled closer and lowered his voice. \"Toban. The man who killed the pope is wearing the <span class=\"rarity-legendary\">Holy Light Armor</span>. For the sake of the church, he must be punished.\"\n\nA system window flashed.\n\n> [The contents of the quest 'Franz' Descendant' have changed.]\n\n\"Shit.\"\n\nToban's expression went rigid as he read the update. He turned to Box's group. \"The treasures aren't in the Vatican anymore. A player intercepted them. We're hunting him down.\"\n\nBox rubbed the back of his neck. \"A player? That's going to cost us. Quest items don't change hands for free. He'll ask for a fortune.\"\n\nToban shook his head. \"Money's not the issue. The quest wants him dead. Kill him, and the items drop.\"\n\nBox's face brightened. \"Oh. That's actually easier.\"\n\nFour top rankers. One target. The math was simple.\n\n\"I'll track him down.\" Box's confidence bordered on arrogance.\n\nBlack Teddy grunted. Asuka looked bored. Neither seemed concerned in the slightest.\n\nToban cleared his throat. \"The difficulty is still SS-grade. Even though we're fighting a player, that means something. Don't get careless. Let me share the quest.\"\n\nThe window materialized in front of them.\n\n---\n\n> **[Franz' Descendant (2)]**\n>\n> **Difficulty:** SS\n>\n> According to intelligence from a spy, an enigmatic figure killed the pope alone and claimed Franz's treasures.\n>\n> Unfortunately, he now wears Franz's treasures.\n>\n> Only Franz's descendant can wear his treasures. Pascal's claim to legitimacy grows weaker by the hour.\n>\n> Track down this figure. Kill him.\n>\n> Reclaim Franz's treasures.\n>\n> **Quest Clear Conditions:** Kill the enigmatic figure and recover the <span class=\"rarity-legendary\">Holy Light Crown</span>, <span class=\"rarity-legendary\">Armor</span>, and <span class=\"rarity-legendary\">Gloves</span>.\n>\n> **Quest Clear Reward:** Level +5. <span class=\"rarity-legendary\">Sword of Wisdom</span>.\n>\n> **Quest Failure:** Pascal's ambitions collapse. Pascal's hatred.\n\n---\n\nSilence.\n\nBox's cocky expression cracked. Black Teddy's hand froze mid-pat on the teddy bear.\n\nAsuka spoke first, her tone measured. \"I couldn't kill the pope alone.\"\n\nShe was ranked 28th. The guild compared her combat power to Pon and Regas. She'd soloed boss monsters in the low 200s before. But the pope? Level 330 minimum, according to their intel.\n\n*That fight would be suicide alone.*\n\nYet this \"enigmatic figure\" had done exactly that.\n\n\"Someone who can take down the pope solo has to be top ten. Probably a hidden class.\" Box stroked his chin. \"Maybe Agnus?\"\n\nAgnus. Seventh on the unified rankings. One of three known epic hidden classes. A legend wrapped in blood and mystery.\n\nBox's excitement returned. \"If it's him, this'll be interesting. A chance to figure out what his class actually does.\"\n\nBlack Teddy shifted. \"Or we all die horribly.\"\n\nAsuka's eyes narrowed. \"Then leave. I'm fighting regardless.\"\n\n\"Miss Asuka...\"\n\nThe young woman was the daughter of a global conglomerate's chairman. Black Teddy was her attendant. He'd started Satisfy on her orders, learned the game for her sake, and somehow ended up a ranker in his own right. Most days, the duty came naturally. Others, the gamer in him won out.\n\n\"I'm out. Losing experience at my level takes forever to—\"\n\n\"Fine. You're fired.\"\n\nBlack Teddy's spine went rigid. \"Excuse me?\"\n\nAsuka's voice was ice. \"I don't need an attendant who abandons their employer.\"\n\n\"It was a joke.\" The words came fast. \"I'll fight.\"\n\nBlack Teddy had elderly parents. A terminally ill brother. Asuka's paycheck covered living expenses and medical bills both. He couldn't afford to lose this job. \n\n*Besides.* He'd known the girl since she was five years old. The money mattered, but so did she.\n\nToban exhaled. \"If everyone's committed, let's move.\"\n\n---\n\nThree hours of tracking later, they found him.\n\nThe forest was dark here, thick canopy choking out the sun. A single figure walked through the gloom ahead, maybe a hundred meters distant.\n\n\"Quiet.\" Toban motioned his companions into the underbrush.\n\nThey crouched low, watching.\n\nBox squinted at the black-haired man. \"That's him? Why's he wearing such a shit-tier cloak? Looks broke.\"\n\nToban kept his voice low. \"High-level players don't always advertise their gear. Some prefer stealth.\"\n\nThe cloak looked vaguely familiar, but the design was plain. Nothing worth noting. Asuka glanced at Black Teddy. The big man had served her for two decades. He could read her without words.\n\n\"Understood.\" Black Teddy cracked his knuckles. \"I'll test him.\"\n\nHe raised one hand. \"Summon Black Bear.\"\n\n**Kwaaaaah!**\n\nThe creature that materialized was monstrous. Grizzlies were the largest bears on Earth—three meters long, over 600 kilograms. Compact cars made of muscle and rage. This thing was fifty percent larger. It roared and charged.\n\nThe black-haired man stopped mid-hum. He turned.\n\nThe ID floated above his head: **Grid**.\n\nToban's eyes went wide. *Wait. Grid?*\n\n**Kwaaaaah!**\n\nThe bear's paw swung for Grid's skull.\n\n\"Stop!\" Toban lurched forward. \"Stop the bear!\"\n\nBlack Teddy blinked. \"What the hell are you—\"\n\n**Pipit! Pipipipit!**\n\nThe bear's body erupted in a storm of cuts. Dozens of slashes opened simultaneously across its hide. It dissolved into grey light.\n\nBox whistled low. \"Damn.\"\n\nThe black-haired man held a small dagger. A level 200 summon. Dead in seconds. The damage output was absurd. Box knew maybe two people capable of that kind of physical burst: Jishuka and the helmet psychopath.\n\n*So he's strong enough to kill the pope. But Grid? Who the hell is Grid?*\n\nNot a ranker. Not on any list Box had memorized. So how was he this strong?\n\n*Hidden class. Has to be.*\n\nBlack Teddy's face darkened. \"You son of a bitch.\" His voice shook. \"You killed that bear without even flinching.\"\n\n\"Wait!\" Toban scrambled to defuse the situation. \"Just hold on—\"\n\nBut Black Teddy loved bears more than most people loved their families. Once his temper snapped, only Asuka could rein him in. And Asuka just watched.\n\n\"Summon Brown Bear Knights!\"\n\nThree bears materialized. Smaller than the black bear, but armed. **Helmets. Armor. Swords. Shields.** Level 240, all of them.\n\n\"Avenge your brother!\" Black Teddy roared.\n\n**Kuwaaah!**\n\nThe bears charged. Their coordination was professional, pressuring Grid from three angles at once with textbook swordsmanship. \n\nFor about ten seconds.\n\nGrid sidestepped the first sword, ducked under the second, and drove his dagger into the gap between a bear's armor plates. The bear didn't even slow. Summons felt no pain. It kept swinging.\n\nGrid clicked his tongue. \"Tough bastards.\"\n\n**Pepepeng!**\n\nHe threw a dart. Poison mist bloomed from the impact point.\n\n**Kwaaaaah!**\n\nThe knights bled. They stumbled. Grid closed the distance and delivered the killing blows with surgical precision. Then he turned toward the treeline where Toban's group hid.\n\n\"The hell are these bears? Did a circus lose its acts?\"\n\nToban's stomach dropped. *It's not a bug. Grid actually killed the pope.*\n\nBlack Teddy was first on the summoner rankings. During the guild membership test, those bear knights had given even Faker trouble. Grid just dismantled them in two minutes.\n\n*When did he get this strong?*\n\nGrid had a legendary hidden class. Everyone in the guild knew that. But his level had been embarrassingly low. Two weeks ago, he'd barely scraped into the low 100s.\n\n*Whatever. I can work with this.*\n\nToban had questions, but they could wait. Grid was guildmate. He'd cooperate with the quest if Toban asked nicely.\n\nThen everything went to hell.\n\n\"Hey, Grid—\"\n\n\"Unforgivable!\" \n\nBlack Teddy charged out of the bushes, already summoning new pets. Asuka emerged beside him, weapon drawn.\n\nToban's brain caught up too late. *Grid's never met the new members. They don't know each other.* Sure, they'd seen each other's names in the guild window, but who memorized that?\n\n\"Stop!\" Toban shouted. \"We're in the same guild—\"\n\nGrid pulled out a greatsword.\n\n\"Now this is interesting.\" Box had identified Grid from the weapon. He grinned and raised his hand. Puppet magic flared to life, and Toban's body locked up under Box's control.\n\nToban wanted to scream.\n\n---\n\n**Glossary of Common Korean Terms**\n\n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}