{
  "id": 13,
  "title": "Chapter 13",
  "content": "# Chapter 13\n\nGrid checked his coin purse again. Three gold and eleven silver. The meager weight of it made his stomach clench.\n\n*I need to craft something. Sell it. Build up capital for the carriage fare. Then buy blue orichalcum ore for 'Failure.'*\n\nBut earning money felt like trying to catch falling stars with his bare hands.\n\nThe smithy door creaked open under his palm. Before he could take another step, golden text blazed across his vision.\n\n> [The effect of mastering 'Blacksmith's Craftsmanship Skill' is activated. Blacksmith NPCs with craftsmanship skill beyond the intermediate level will treat you in a friendly manner.]\n\n> ['Pagma's Descendant' class effect is activated. Blacksmith NPCs with advanced level craftsmanship skills will recognize and worship you.]\n\nGrid froze. *A hidden feature?*\n\nHis pulse quickened. This meant he could obtain production methods easily. Just walk in, let the skill work its magic, and blacksmiths would hand over their secrets.\n\n*Maybe this class isn't so bad after all.*\n\nAt first, he'd hated it. A production class? For someone drowning in debt? But the more he discovered about Pagma's Descendant, the more potential he glimpsed beneath the surface. The legendary rating wasn't just for show.\n\nHe stepped inside, wearing his brightest smile. A middle-aged blacksmith stood hunched over a forge, sweat dripping from his brow as he hammered iron.\n\n\"Excuse me.\" Grid layered false confidence into his voice. \"I want to make the most profitable item with the highest demand. What would you recommend?\"\n\n*Go ahead. Recognize me. I'm Pagma's Descendant. Someone who mastered Blacksmith's Craftsmanship. Worship me. Hand over your best recipe.*\n\nThe blacksmith glanced up. His eyes were cold. Flat.\n\n\"Bah.\" He spat into the coals. \"Some kid wants to talk shop? I don't waste time on rude, incompetent brats. Get out.\"\n\nGrid's smile cracked. \"......?\"\n\nThe NPC's tone, the dismissive wave of his hand—it was the standard treatment for level 1 users. Complete strangers.\n\n*He didn't recognize me?*\n\nThe notification had promised recognition from intermediate and advanced blacksmiths. Which meant this man was neither. Just a low-level craftsman who hadn't even reached the intermediate threshold.\n\n*Of course. Of course I'd find the one incompetent blacksmith in the entire village.*\n\nHe glanced around. This was the only smithy. The notification window had gotten his hopes up for nothing.\n\n*Right. Because I'm unlucky. I always forget how unlucky I am.*\n\nGrid swallowed his frustration. He needed this. Without learning production methods here, his only options were washing dishes or digging irrigation ditches until he'd saved enough gold for a carriage. Weeks of labor. Maybe months.\n\nHe straightened his posture. Bowed slightly. \"Forgive me. You were working so intently I didn't want to disturb your concentration. I tried to be direct and failed. If I sounded rude, I apologize.\"\n\nThe blacksmith's expression shifted. Curiosity replaced contempt. \"Huh. Strange manners for a kid.\"\n\nGrid maintained his service-industry smile. The kind that hid gritted teeth. \"My name is Grid. I'd like to learn how to make items.\"\n\nThe blacksmith snorted. \"You think anyone can learn smithing? A child like you should start with chopping firewood. No—you should be grateful I'm even giving you that chance. You want to learn from me? Prove yourself first. Go to the backyard and gather wood.\"\n\n\"...Figures.\" Grid's mutter slipped out before he could stop it.\n\n\"Huh? What was that?\"\n\n\"Nothing.\" \n\n*Just calling you a lowly blacksmith in my head.*\n\nBut he couldn't afford to get kicked out. This lowly blacksmith was his only option. \n\n\"I'll chop the firewood. How much do you need?\"\n\nThe NPC handed him a battered axe. The handle was smooth from decades of use. \"As much as you can.\"\n\n> [Chop Firewood]\n> \n> Difficulty: E\n> \n> Blacksmith Smith has given you an errand to chop firewood. If you can finish this task well, Smith will look upon you in a more favorable light.\n> \n> Quest Clear Conditions: 500 pieces of firewood.\n> \n> Quest Reward: Affinity with Smith +10, experience +10, 20 bronze.\n> \n> Quest Failure: Affinity with Smith -10.\n\nGrid exhaled. *A normal quest. Finally.*\n\nAfter the avalanche of S-grade and SS-grade disasters from Earl Ashur's quest chain, seeing basic E-rank difficulty felt like breathing fresh air.\n\n*Twenty experience needed for next level. This gives ten. Halfway there.*\n\nThe experience requirement hadn't changed between level -3 and level -1. It seemed minus levels only required twenty points each. Which meant he could escape this humiliating negative level zone through simple errands.\n\n*First, get back to level one. Then everything else.*\n\nHe headed to the backyard, axe in hand. A pile of unsplit logs waited against the fence. Grid examined the tool he'd been given.\n\n*This axe is ancient. Will it even survive hitting the wood? If I break it, he'll throw me out for sure.*\n\nBetter to check first. He activated his skill.\n\n\"Appraisal.\"\n\n> [The blacksmith who becomes a legend appraises items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\n> **[Smith's Old Axe]**\n> \n> Rating: Normal\n> \n> Durability: 6/6  \n> Attack Power: 4~7\n> \n> An axe that the blacksmith Smith has used since he was young. Well-made and very old, but still cuts cleanly. Durability is low; there is danger of destruction.\n> \n> Weight: 40\n> \n> [No hidden functions exist.]\n\nJust an ordinary axe. Worn but functional. Grid felt relief instead of disappointment. After the chaos of recent weeks, normal felt good.\n\nMore text scrolled across his vision.\n\n> [You have grasped the materials that make up Smith's Old Axe, the production method, and the intentions of its creator.]\n\n> [Your understanding of Smith's Old Axe is now at 100%. You can use Smith's Old Axe perfectly.]\n\n> [You have learned how to make an axe.]\n\nGrid blinked. \"Straight to 100% understanding?\"\n\n*Makes sense. A legendary blacksmith looking at a normal axe shouldn't need time to figure it out.*\n\nHe set the axe aside and positioned a log upright. For a moment, he considered spitting into his palms like he'd seen in period dramas. But what would be the point?\n\n*Firewood doesn't need strength. You follow the grain.*\n\nHe'd heard that somewhere. Read it in a book, maybe. But he had no idea what 'following the grain' actually meant in practice. Just empty knowledge.\n\n*Doesn't matter. I'll treat it like killing a monster. Apply swordsmanship logic to wood.*\n\nHe picked up the axe. As he raised it above his head, something appeared on the log's surface—a solid black line, running vertically through the center.\n\nGrid lowered the axe. The line vanished. He raised it again. The line reappeared.\n\n*Is the axe... telling me where to strike?*\n\nHe could only think of one explanation. \"The effect of 100% understanding.\"\n\nMade sense, but he wanted to confirm. He deliberately aimed away from the black line and swung with full force.\n\n**Beeok!**\n\nThe axe bit halfway into the wood and stopped. Stuck. A notification informed him the durability had decreased by one.\n\n*I can't even chop firewood properly.*\n\nThe humiliation burned in his chest. He wrenched the axe free, tossed the half-split log aside, and grabbed a fresh one.\n\n\"This time...\"\n\nHe aimed for the black line. Swung.\n\n**Ttaak!**\n\nThe blade passed through the wood like silk parting. The log fell into two clean halves. The sensation sang up his arms—perfect resistance, perfect release.\n\n\"Ohh!\"\n\nGrid stared at the split wood. At the axe. At his own hands.\n\n*This is what 'understanding' means. Not just reducing penalties or learning recipes. It's mastery.*\n\nThere was an old expression about items becoming extensions of your body. If he raised a sword's understanding to 100%, that sword would move like his own limb. Understanding was like Weapons Mastery—maybe even deeper.\n\n*If I craft items myself and push understanding to 100%...*\n\nThe thought electrified him. *I could become a ranker. Actually compete with the top players.*\n\nAnd rankers? They appeared on television. Talk shows. Commercials. The performance fees alone could pay off his debt. He'd gain fame. Respect. No one would look down on him anymore. Maybe Ahyoung would finally see him as someone worth noticing.\n\nHis motivation surged.\n\n\"Alright! Let's do this!\"\n\n**Ttaak! Ttaak! Ttaak! Ttadadak~!**\n\nHe worked without stopping. Two hours blurred together in a rhythm of swinging, splitting, stacking. The feeling of success was intoxicating—each perfect strike down the black line, each log falling into two clean pieces.\n\nBut pleasure faded. His stamina was trash at level -3. By the 150th piece of firewood, exhaustion clawed at him. His breathing turned ragged. His stomach growled.\n\n*Should I rest?*\n\nNo.\n\nHe'd spent three months suffering through Earl Ashur's quest. Hell on earth. If he'd survived that without giving up, he sure as hell wouldn't quit now over something as simple as chopping wood.\n\n*This is nothing. Don't stop. Finish the quest. Level up. Make money.*\n\nGrid clenched his jaw. Raised the axe. Brought it down again.\n\nAnd again.\n\nAnd again."
}