{
  "id": 130,
  "title": "Chapter 130",
  "content": "# Chapter 130\n\nGrid stood over the fallen pope's body. The quest notification blinked in his peripheral vision. *Finally.* He turned and left the Vatican without a backward glance, already planning his next move. But first, his body demanded rest.\n\n\"Logout.\"\n\nThe world dissolved.\n\n***\n\nShin Youngwoo's eyes snapped open inside the capsule. He shoved the door up and stumbled out, yanking his boxers higher on his hips as he made for the kitchen. His stomach felt like it was eating itself.\n\nThe refrigerator glowed when he opened it. Ham and egg rolls. Sliced meat. Side dishes packed in neat containers. A note sat on the table in his mother's handwriting.\n\n*'Son. Don't forget to eat meals regularly! It's good to make money, but don't play the game too much and exercise as well. ^^'*\n\nYoungwoo stared at the note. Six months ago, his parents had looked at him like he was a ticking time bomb. The debt collectors. The constant calls. His father's disappointed silence. His mother's forced smiles that never reached her eyes.\n\nNow? Now they left him encouraging notes with double carets.\n\n*I can't go back to that.* He pulled out a container and started eating standing up. *Never again.*\n\nThe food disappeared quickly. Youngwoo carried his dishes to the sink, then collapsed on the couch. The TV remote sat within arm's reach. He clicked through channels until he found OGC, the gaming specialty station.\n\n\"...shocking developments from within Satisfy today,\" the anchor was saying. \"The Pope of the Rebecca Church, Drevigo, has been killed by an unidentified player. Church officials are scrambling to...\"\n\nYoungwoo's eyes drifted shut. The anchor's voice became white noise.\n\n***\n\nThirty minutes later, he jerked awake. The TV was still on, now showing some analysis panel arguing about papal succession. He killed the power and stretched, vertebrae popping down his spine.\n\n*Time to get back to it.*\n\nThe capsule's interior lights glowed softly as he settled in. The system hummed. Reality peeled away.\n\n***\n\nGrid materialized in the forest north of the Vatican. The air tasted clean, pine and earth. Birds called from the canopy above. He started walking, humming tunelessly.\n\n*Best condition in days. Good meal. Good rest. Now I can focus on—*\n\nSomething massive crashed through the underbrush.\n\nGrid spun. A bear, easily three hundred kilograms, charged at him with unnatural speed. Its eyes glowed red.\n\n> [You are being attacked!]\n\n\"What the hell?\" Grid's hand went to his belt, fingers closing on Failure's hilt.\n\nThe bear wasn't alone.\n\nTwo more burst from the tree line, flanking him. Behind them, a man in his forties stood stroking a teddy bear clutched to his chest. The nameplate read: **Black Teddy**.\n\nTo Grid's left, a woman with sharp features and blue eyes stepped out from behind a tree. Dual blades gleamed in her hands. **Asuka**.\n\n*I know those names.* Grid's mind raced. *Where do I know those names from?*\n\n\"Summon White Bear Warriors!\"\n\nBlack Teddy's voice was surprisingly gentle. Three white bears materialized. They wore red cloaks. Black sunglasses. Their arms crossed over their chests like nightclub bouncers.\n\nGrid blinked. *Is this guy serious?*\n\nThe bears looked ridiculous. Completely unthreatening despite their size. One of them cracked its neck from side to side with an audible pop.\n\n*Actually kind of cute.*\n\nThe white bear in the center moved. Grid barely registered the motion before it was airborne, fist cocked back.\n\n**Crack.**\n\nPain exploded across his jaw. His health bar dropped by a fifth.\n\n> [You have suffered 2,550 damage.]\n> [The effect of Doran's Ring has been activated.]\n> [1,275 health has been restored.]\n\n\"Shit!\" Grid staggered back.\n\nSteel flashed. Asuka's dual blades came at him from opposite angles. He got his dagger up to catch one. The other carved a line across his ribs.\n\n**Clang. Clang.**\n\n**Thunk.**\n\n> [You have suffered 2,900 damage.]\n\nBlood welled up, hot and immediate. Grid twisted away, breathing hard.\n\n*Fast. Way too fast.*\n\n\"Girl!\" he snarled.\n\nAsuka pressed forward. Her blades moved in perfect synchronization, high and low, forcing him to choose which attack to block. Grid gave ground, his earlier confidence evaporating.\n\n*These two are good.* The thought was cold water. *Really good.*\n\nHe'd just killed the Pope solo. Somewhere in the back of his mind, a small voice had started whispering that maybe he was special. Untouchable.\n\nThat voice shut up fast.\n\nGrid activated his Insight stat, focusing on his attackers. Numbers crystallized in his vision.\n\n**Asuka: Combat Power 18,000**\n\n**Black Teddy: Combat Power 9,000**\n\n**With summons: Combat Power 20,000**\n\n*Ranked players.* His pulse kicked up another notch. *Has to be.*\n\n\"Inventory!\"\n\nGrid's hands blurred. The dagger vanished. His fingers closed on familiar leather wrapping as he pulled out the <span class=\"rarity-legendary\">Holy Light Battle Gear</span>.\n\n> [You have equipped the Holy Light Battle Gear set.]\n> [The additional effects of defense +500 and health +6,000 have been received.]\n\nPure white armor materialized across his body, gold thread gleaming at the seams. The <span class=\"rarity-legendary\">Holy Light Crown</span> settled on his head, small but heavy with presence. <span class=\"rarity-legendary\">Holy Light Gloves</span> covered his hands, supple leather that moved like water.\n\n*Now I look like someone to take seriously.* Grid's confidence ticked back up.\n\nBlack Teddy's eyes narrowed. The teddy bear in his arms shifted slightly. \"So he's not just some random.\"\n\nGrid sheathed the dagger. His hand went to his back. Failure came free of its scabbard with a metallic whisper.\n\nThree meters of black iron. The blade seemed to drink the light.\n\n\"That sword...!\" Asuka's eyes went wide.\n\nHer whole posture changed. The casual fighter's stance evaporated, replaced by something intense. Hungry.\n\n\"You're the Psychopath Butcher, right?\" Her tone was almost friendly.\n\nGrid's eye twitched.\n\n*The Frostlight Orc Chief's Helmet is destroyed! I'm wearing a crown that makes me look like a manhwa prince! And she still calls me a psychopath?!*\n\nHis jaw clenched. *They recognize me from Dainsleif. Fine. But shouldn't she at least comment on how I look now?*\n\nThe <span class=\"rarity-legendary\">Holy Light Battle Gear</span> was gorgeous. Objectively, empirically gorgeous. Far better looking than any armor set he'd seen in Satisfy.\n\nBut fashion, Grid was learning, lived and died on the face beneath it.\n\n\"What happened to the skull helmet?\" Asuka tilted her head. \"I think I preferred that one.\"\n\nSomething in Grid's brain snapped.\n\n\"You...\" His voice came out low. Dangerous. \"You attack someone without even introducing yourself. Don't even ask permission. And now you're insulting my appearance?\"\n\nAsuka blinked. \"Was that an insult?\"\n\n\"You'll be sorry.\" Grid's knuckles whitened on Failure's grip.\n\nHe moved.\n\nThe sword dance began with a single step. Failure came up in a rising arc, black energy coalescing along its edge. The air warped. Rippled.\n\n\"**Kill!**\"\n\nThe technique screamed toward Asuka's heart.\n\n\"Defend the young lady!\" Black Teddy's voice cracked with urgency.\n\n**Roar!**\n\nThe lead white bear intercepted. Its fist, massive and callused, met Failure's edge head-on.\n\n**BOOM.**\n\nThe shockwave flattened grass in a ten-meter radius. For a heartbeat, bear and blade hung suspended. Matched.\n\nThen physics reasserted itself.\n\nFailure carved through fur and muscle like they weren't there. The bear's health bar plummeted by a third. Blood sprayed.\n\n**Grrrr.**\n\nThe bear didn't flinch. Didn't hesitate. That was the advantage of summons. No pain receptors. No self-preservation instinct.\n\nIt headbutted Grid square in the chest.\n\n**Crack.**\n\n> [You have suffered 890 damage.]\n\nGrid's feet skidded backward. He grunted. But the <span class=\"rarity-legendary\">Holy Light Armor</span> absorbed most of the impact. Barely felt it.\n\nThen the <span class=\"rarity-legendary\">Holy Light Gloves</span> activated.\n\n> [The 'Counterattack' effect has triggered!]\n\nGrid's fist snapped out on autopilot. Caught the bear across the jaw. The creature's head whipped to the side, health dropping another chunk.\n\nBlack Teddy cursed under his breath. \"**Berserk!**\"\n\nThe white bear's eyes went from red to crimson. Its muscles swelled. Steam rose from its fur as its stats doubled.\n\n**ROOOAAAR!**\n\nIt came at Grid like a freight train.\n\n*Shit!* Grid backpedaled. Claws scraped across his armor, leaving shallow gouges. Each hit rattled his bones despite the legendary defense.\n\n*Temporary buff. Has to be.* His mind worked frantically. *Can't last long at this power level.*\n\n\"**Restraint!**\"\n\nPagma's Swordsmanship flooded the air with pressure. Invisible. Suffocating.\n\nThe white bear stumbled mid-swing. Its eyes went wide. It took a step back. Then another. The overwhelming presence of the technique overrode its berserk state.\n\nBlack Teddy's face twisted. \"What? Why isn't it listening?\"\n\n*Ten seconds.* Grid's internal clock was ticking. *Berserk is probably ten seconds max. Five already gone. Don't waste it.*\n\n\"**Blacksmith's Rage!**\"\n\n> [Attack power has increased by 30%!]\n> [Attack speed has increased by 45%!]\n\nGrid blurred.\n\nHe crossed the distance to Asuka in two strides. Failure came down in an overhead chop.\n\n**CLANG!**\n\nAsuka crossed her dual swords. Caught the blow. Her arms shook from the impact, boots digging trenches in the dirt as she skidded backward.\n\n\"Heavy!\" she gasped.\n\nGrid didn't give her time to recover. He pressed forward, each swing flowing into the next. High. Low. Diagonal. Thrust. The attack speed bonus from Blacksmith's Rage made Failure move like it weighed nothing.\n\nAsuka's blades worked desperately. Parry. Deflect. Sidestep. But she couldn't counter. Could barely defend.\n\n*Strange.* Confusion flickered across her face between blocks. *That sword has to weigh forty kilos. How is he swinging it this fast?*\n\nShe didn't know about the black iron. Didn't know that Dainsleif's reproduction, while massive, was engineered for speed by a master craftsman.\n\n**Clang! Clang! Clang!**\n\nGrid's assault continued. Relentless. Mechanical. Every opening Asuka created, he filled before she could exploit it.\n\n*He's good.* Asuka's eyes gleamed. *Better than I expected. But...*\n\nA smile curved her lips.\n\n*This is my specialty.*\n\nHer class was Berserker. The longer a fight dragged on, the stronger she became. Her body adapted. Learned. What seemed impossible to block at first became merely difficult. Then manageable.\n\nAfter thirty seconds of pure defense, Asuka's brain mapped Grid's attack patterns.\n\n*There.*\n\n\"**Sword Frenzy!**\"\n\nHer eyes flashed from blue to crimson. Both blades became a whirling storm. Nine strikes in two seconds, each one aimed at a different vital point.\n\n**Screech!**\n\nGrid caught the first six. His sword moved on pure instinct, perfect positioning.\n\nBut human reaction time had limits.\n\nThe seventh strike carved across his shoulder.\n\n> [You have suffered 1,700 damage.]\n\nThe eighth opened his thigh.\n\n> [You have suffered 1,650 damage.]\n\nThe ninth slipped past his guard entirely and punched into his ribs.\n\n> [You have suffered 1,810 damage.]\n\nGrid stumbled back, breathing hard. Blood dripped from multiple wounds.\n\nAsuka's smile widened. \"See? Your defense went up with that fancy armor. But you're still too slow. My dual blades will cut you to pieces.\"\n\nGrid looked at her. Then he started laughing.\n\n\"What's funny?\" Asuka's smile faltered.\n\n\"**Pagma's Swordsmanship, Link!**\"\n\n**Whoosh-whoosh-whoosh-whoosh-whoosh!**\n\nBlack energy swords materialized in rapid succession. Five. Ten. Fifteen. Seventeen total projectiles screaming toward Asuka.\n\n\"What?!\"\n\nShe triggered Sword Frenzy again. Her blades moved in a blur, deflecting energy swords. But the math was simple. Nine blocks versus seventeen attacks.\n\nEight projectiles got through.\n\nThey tore into Asuka from every angle. Arms. Legs. Torso. Face. She screamed.\n\nWhen the barrage ended, she was on one knee. Health bar at forty percent.\n\nGrid walked forward slowly. Deliberately. He pressed Failure's tip against her throat. The black iron was cold against her skin.\n\n\"What,\" Grid said quietly, \"is your purpose for attacking me?\"\n\n***\n\nElsewhere in the forest, Toban's body seized up.\n\n> [Magic power has started to manipulate your body. It is hard to reject.]\n> [You will become the puppet of 'Box' for three seconds.]\n\n*Three seconds?!* Toban tried to move his hand. Nothing. His fingers wouldn't even twitch. *I'm the number one ranked Paladin! My magic resistance is maxed! How?!*\n\nHumiliation burned in his chest.\n\nBox, meanwhile, stared at his hands in disbelief. *Three seconds? That's it?*\n\nPuppet was his ultimate spell. His trump card. Against monsters, it lasted five minutes. Against players, thirty seconds minimum.\n\nToban shattered that benchmark like it was glass.\n\n*The first ranked Paladin is different.* Box felt a mixture of awe and frustration. *The Tzedakah Guild really is full of monsters.*\n\nPuppet had a two-hour cooldown. Using it for a mere three seconds was a catastrophic waste. Box gritted his teeth and seized control of the magical threads connecting him to Toban.\n\n\"Chief, go help Asuka.\"\n\n\"Wait, stop!\" Toban's voice cracked with panic.\n\nHis body moved on its own. Marched toward the clearing where Grid had Asuka at sword-point. His legs carried him into the gap between them.\n\nHis shield came up. Deflected Failure away from Asuka's neck with a metallic **clang**.\n\nGrid's head snapped toward him. \"Toban?\"\n\nThe puppet magic released. Control returned. Toban could move again. He tried to smile. Failed miserably.\n\n\"Ah... hello?\"\n\n*I need to explain. Fast. Before this gets worse.*\n\n\"I'm glad to meet you for the first time, Grid.\"\n\nBox's voice. Grid's eyes tracked past Toban to the slim man approaching from the tree line. Handsome features. Confident stride.\n\nGrid's expression immediately soured.\n\n*Another pretty boy.*\n\n\"Who are you?\"\n\nBox smiled. Professional. Disarming. \"The three of us joined the guild recently. We're helping Chief Toban with a quest. The quest target is you. We need to kill you.\"\n\n\"What?\"\n\nGrid's gaze swung back to Toban. Toban saw the exact moment comprehension hit. Saw Grid's face harden.\n\n\"Grid, wait, this is a misunderstanding!\" Toban held up both hands. \"I didn't know you were the target! I swear, I—\"\n\n**ROAR!**\n\nThe white bear warrior, freed from Restraint, barreled past Toban. Its paw came down on Grid's head like a hammer.\n\n**Crunch.**\n\n> [You have suffered 3,200 damage.]\n\nBlood poured down Grid's face. Dripped from his chin. He looked at Toban through the crimson curtain.\n\n\"So,\" Grid said softly. \"You're talking to distract me. While your pets attack from behind. Is that it, Toban?\"\n\n\"No!\" Panic surged through Toban's chest. \"That's not—\"\n\n\"Were you that angry? That I said I'd make your item last?\" Grid's voice was cold. Dead. \"Is this your revenge?\"\n\n\"Listen to me!\" Toban's voice cracked. \"The quest is to kill the person who murdered the Pope and stole the treasures! I didn't know that was you! Not until just now!\"\n\n\"And now that you know?\" Grid wiped blood from his eyes. \"Perfect opportunity to clear the quest, right?\"\n\n\"No! We don't have to fight!\" Toban was almost shouting now. \"Sell me the treasures! I just need the treasures! That completes the quest!\"\n\nGrid paused. \"You just need the treasures?\"\n\n\"Yes!\" Toban's relief was palpable. \"The <span class=\"rarity-legendary\">Holy Light set</span>. That's all I need.\"\n\nGrid's expression shifted. Calculation replaced anger. \"You want to buy it?\"\n\n\"Yes! I'll pay well! Please, we're in the same guild!\" Toban clasped his hands together. \"Just this once?\"\n\nGrid's mind was already running numbers. *Can't sell these to anyone else. The usage conditions are too specific. But if Toban wants them...*\n\nHe let his shoulders slump. Sighed heavily. \"Fine. Since we're guildmates, I'll consider it. How much?\"\n\n\"2,000 gold each!\" Toban said immediately. \"6,000 gold total!\"\n\nGrid stared at him.\n\n*Two thousand gold. For legendary items.*\n\n\"Are you playing with me right now?\"\n\nToban blinked. \"Is that... not enough? Okay, 2,200 gold each?\"\n\n\"Get lost.\"\n\n\"Wait, how much do you want?\"\n\n\"Two million gold. Each.\"\n\n\"WHAT?!\"\n\nThe number hit Toban like a physical blow. He stumbled backward. \"That's... that's insane! They're quest items! I need them for an SS-grade quest, you have to help me!\"\n\nGrid's expression didn't change. *They're legendary rated. I'm not giving them up for anything less than two million each. I'd rather keep them.*\n\n\"I'm serious,\" Grid said flatly. \"Two million or nothing.\"\n\nToban's face cycled through several emotions. Disbelief. Anger. Desperation. Finally, resignation.\n\nBox leaned close to Toban's ear.\n\n\"Chief,\" Box whispered. \"Let us fight him. We want to see his strength. We'll kill him and take the items for you. Okay?\"\n\nTemptation flickered in Toban's eyes. Just for a moment.\n\n\"Grid,\" Toban said slowly. \"Are you absolutely sure? Two million gold each? You're not joking?\"\n\n\"Not joking.\"\n\nToban closed his eyes. Made his decision. Opened them.\n\nHe whispered to Box, barely moving his lips.\n\n\"Pretend to use magic on me.\"\n\nBox's eyebrows rose. But he nodded.\n\nHe made a show of casting. Gesture. Incantation. Magic circles glowed around Toban's feet.\n\nToban's body went rigid. He toppled backward and hit the ground, limbs splayed.\n\n\"No!\" Toban's voice rose to a theatrical wail. \"What is this?! I can't move! My body won't respond! This is Puppet! The ultimate Linker magic! Oh no! This is terrible! Grid, I can't stop them! They're going to attack! Look out!\"\n\nSilence fell over the clearing.\n\nGrid looked at Toban lying on the ground. Looked at Box, who was very deliberately not making eye contact. Looked at Black Teddy, who'd gone very still.\n\nAsuka started laughing first. Couldn't help it. The sound bubbled up from her chest, half hysterical.\n\nGrid pinched the bridge of his nose.\n\n*What did I do to deserve this guild?*"
}