{
  "id": 131,
  "title": "Chapter 131",
  "content": "# Chapter 131\n\nGrid watched Toban's performance and felt his eye twitch. \n\nHe'd seen bad acting before. Idol actors fumbling through their first drama roles. But this? This transcended embarrassment. The paladin stood there, jerking his limbs like a puppet with tangled strings, his face contorted in what was probably supposed to be distress.\n\n*Pathetic.*\n\nThe acting didn't matter. What came next did. Grid's gaze sharpened as he assessed the situation. Toban was lying. That much was obvious. The question was why.\n\n*Interesting.*\n\nThe quest had gotten its hooks into him. Deep enough to make him betray a guildmate.\n\nBox's voice cut through Grid's analysis. The man adjusted his folding fan with a satisfied smile. \"The situation is regrettable, but unavoidable. Grid, I've been curious about the hidden class that dismantled the Giant Guild. Chief, buff us.\"\n\nToban's jaw tightened. His fingers flexed around his shield.\n\n*This is wrong.*\n\nHe knew it. Quest or no quest, betraying a colleague violated everything he claimed to stand for. If someone called him garbage for this, he couldn't argue. Wouldn't even try. But the quest dangled in front of him like bait on a hook.\n\nSS-grade. <span class=\"rarity-legendary\">Legendary rated sword</span> as a reward. Opportunities like this didn't knock twice.\n\n*I'm sorry, Grid. But you forced my hand.*\n\nToban's internal justification built momentum. \n\n*You couldn't spare quest items for a guildmate? I offered compensation. Gold. Materials. But you refused. That makes you the unreasonable one.*\n\n*I have to kill you for the quest. I'll repay the damage. I swear it.*\n\nHe sucked in a breath and threw himself back into his performance.\n\n\"Ah! How is this possible?\" Toban's voice cracked with theatrical anguish. \"My body moves to Box's commands! I'm using a skill! I want to resist, but I can't! This situation... It can't be helped. I'm sorry, Grid! Forgive me!\" He clasped his hands together. \"God of health and wisdom, Judar! I earnestly pray for your blessing. Light's Glory!\"\n\n> [The effect of Light's Glory is activated.]  \n> [The stats of you and your party members have increased by 20%.]\n\nPaladins from the Judar Church specialized in buffs. Their abilities surpassed other support classes, and the effects extended to all party members, pets included. That versatility made them invaluable for party hunting. Popular enough to charge premium rates.\n\nAsuka rolled her shoulders. The buff coursed through her body like liquid fire. \"Let's start again. Show us everything you've got.\"\n\nShe pulled a spear from her inventory. The weapon blurred as she activated her skill.\n\n\"Spear Frenzy!\"\n\nBerserkers embraced aggression. Every weapon type, every combat style. Asuka, blessed with generational wealth, had acquired an arsenal. She wielded it with vicious precision.\n\nThe ground exploded. Cracks spiderwebbed outward as the spear struck, releasing shockwaves in a wide cone. The skill didn't discriminate. Primary target, surrounding area. Everything within range took damage. Fifty percent to secondary targets, full force to the first. The earth shook. Debris launched into the air.\n\nSpear Frenzy came with a bonus. Point-eight seconds of forced airborne time. Even if the target dodged the strike, the aftermath caught them. Crowd control at its finest.\n\nGrid's greatsword met the spear shaft. Metal shrieked. His boots skidded backward across stone, but the ground beneath him crumbled. His body lifted.\n\nAsuka's eyes gleamed. She'd fought enough battles to read the rhythm. Chain Frenzy came next. The skill combo kept opponents suspended, helpless for two full seconds. Easy pickings.\n\nShe snapped the chain forward.\n\nGrid's feet touched stone. Gravity reasserted itself like he'd never left the ground.\n\n\"What?\" Asuka's voice pitched higher.\n\nGrid's grin was all teeth. \"Pathetic tricks.\"\n\nShe yanked the chain back, already reaching for her primary weapons. Twin swords cleared their sheaths. She brought them up in a cross guard.\n\nThe impact rattled her bones. \n\n*Still fast. Still heavy.*\n\nHer stats had jumped twenty percent. Grid's strength hadn't diminished at all.\n\nThe greatsword ground against her blades. Metal squealed. Her arms trembled.\n\n*Incredible.*\n\nAsuka's expression shifted. Not fear. Ecstasy. She leaned into the pressure, her smile widening.\n\n*He's immune to crowd control. Does his class just... invalidate status conditions?*\n\nThat kind of passive broke game balance. Shattered it. She wanted it. Needed it. Her mind was already calculating. Money meant nothing. She could pay Grid whatever astronomical sum he named to learn how to obtain his class.\n\nMost users didn't understand how hidden classes actually worked. The conditions weren't fixed. They shifted like sand. One player might need to eat three loaves of bread three times in a specific location. Another player, same class? Four loaves. Four times. Different NPC. Different dialogue triggers.\n\nHidden classes emerged from a confluence of luck, timing, and meeting precise conditions that changed with every potential candidate. If the method stayed constant, people would sell it. Hidden classes would flood the market like common drops.\n\nClass change books could be bought. The actual method? Never.\n\nAnd Grid's class was legendary. Unique. Singular. All the money in the world couldn't replicate it. As long as Grid was Pagma's Descendant, no one else could be.\n\n\"Wave.\"\n\nGrid sensed the white bear warrior moving behind him. His sword traced an arc. Energy rippled outward in a expanding circle. Asuka flew backward. The bear tumbled away, its bulk crashing into the ground.\n\nAsuka coughed blood. Her vision swam.\n\n> [You have suffered 4,500 damage.]\n\nA quarter of her health. Gone. Despite her <span class=\"rarity-unique\">unique rated armor</span>. Her eyes widened as more messages appeared.\n\n> [Due to the enemy's skill, all speeds have decreased for 10 seconds.]\n\n*A wide-area skill with massive damage AND a debuff effect?*\n\nAdd the status immunity to the equation. Grid's class transcended common sense. Asuka's certainty crystallized.\n\n\"There is still one epic class undisclosed.\" She studied him. \"Is that you?\"\n\nGrid shrugged. \"Think what you want.\"\n\nHe stepped forward. Asuka's hand shot up.\n\n\"Let me know how to obtain your hidden class. In exchange, I'll give you enough money to never work again...\"\n\nBox lunged forward and clamped a hand over her mouth. \"Miss Asuka, don't you want to have more fun?\"\n\nHe didn't wait for an answer. His folding fan snapped open. He began moving it like a conductor leading an orchestra. The fan channeled magic power, directing it with theatrical flourishes.\n\n*Parasitic bastard.*\n\nGrid's irritation spiked. The handsome man hummed while he waved his fan, completely at ease. Everything he did looked effortless. Grid's jaw clenched.\n\nBox's conducting stopped. Less than two seconds had passed. His skill connected the magic power of every party member into a network.\n\n\"Magic Power Resonance.\"\n\n> [The effect of Magic Power Resonance is activated.]  \n> [The buff effect applied to you and your party members will increase by 1.5 times.]\n\nLinkers did more than puppet magic. They amplified effects. Beneficial or harmful, it didn't matter. If an enemy suffered a debuff, the Linker could extend its duration and spread it through their magic network.\n\nDespite the support focus, Linkers belonged to the magician class. They had attack spells.\n\n\"Magic Pistol.\"\n\nBox's fingers moved like he was squeezing a trigger. Magic power fired in rapid bursts. Low damage, but the activation speed made evasion nearly impossible. Grid took the hits.\n\n> [You have suffered 307 damage.]  \n> [You have suffered 315 damage.]\n\nThe <span class=\"rarity-legendary\">Holy Light Armor</span> was classified as light armor. Crafted from adamantium, its defense exceeded level 250 <span class=\"rarity-unique\">unique rated heavy armor</span>. Eight hundred seventy-two defense points. One of the best armors in existence.\n\nGrid didn't meet the usage conditions. The penalty reduced his effective defense to three hundred ninety-three points. Comparable to level 200 <span class=\"rarity-rare\">rare rated heavy armor</span>. But the Holy Light Armor's options compensated. Forty percent physical damage reduction. Fifty percent magic damage reduction. The Holy Light Battle Gear set effect added five hundred defense.\n\nGrid didn't flinch as the magic bullets pelted him. Box's fan dipped slightly, covering the lower half of his face. Hiding his confusion.\n\n*Magic Pistol only dealt three hundred damage?*\n\nLinkers had weak attack power, but this defied logic. His stats had increased thirty percent from the combined buffs of Light's Glory and Magic Power Resonance. Yet he'd barely scratched Grid.\n\n*More than I imagined.*\n\nClasses with high attack power typically suffered from low defense. Box had assumed Grid followed that pattern. This shattered the assumption. Grid possessed exceptional attack power AND defense.\n\n*A perfectly balanced class. No, that's still understating it. His items must be extraordinary.*\n\nBox's gaze lingered on Grid's equipment. \n\n*The battle gear Toban dismissed as simple quest items might be incredible. Stay calm. Analyze.*\n\nNo matter how high Grid's defense, his health had limits. Sustained damage would wear him down. Box committed to the strategy. His fan moved again.\n\n\"Magic Pistol.\"\n\n> [You have suffered 290 damage.]  \n> [You have suffered 310 damage.]  \n> [You have suffered 305 damage.]\n\nMagic Pistol's advantages extended beyond activation speed. Low mana consumption meant Box could spam it indefinitely. The magic bullets kept coming. Grid's eyes narrowed.\n\n*Irritating.*\n\nThe damage wasn't threatening. Grid had reached level 170. His health approached forty thousand, boosted by six thousand from the Holy Light set and Doran's Ring. Three hundred damage per hit was negligible. A mosquito bite.\n\nBut accumulation mattered. The attacks couldn't be avoided. Grid made his decision. Box needed to die first.\n\nThe white bear warrior blocked his path. Toban stood behind it. The first ranked paladin. Famous for his defensive capabilities. An iron wall.\n\nBox surveyed the formation with satisfaction.\n\n*Perfect. Black Teddy's summons and Toban will pin Grid down. I'll deal damage from the rear. Asuka will exploit openings for finishing blows.*\n\nTheir opponent had killed the pope. A monster. But they were four top rankers with excellent synergy. Victory was inevitable. Box and Toban believed it.\n\nGrid's assessment differed.\n\n*I'm stronger than Pon or Regas.*\n\nHe'd solo killed the pope. Malacus had been weaker than Drevigo by comparison. Grid believed himself the strongest user. Especially with the pavranium.\n\nHe reached into his inventory and withdrew it. Time to use his full strength.\n\n\"First, take care of the annoying one.\"\n\nTwo golden discs materialized. Box and his companions stared.\n\nThe discs spun like gears. They rose into the sky, arcing over Toban's ground-level defense like it didn't exist. After reaching their apex, they descended and slammed into Box's chest.\n\n\"Guaaaah!\"\n\nBox crashed to the ground. His companions gaped at the autonomous weapons.\n\n*What kind of item attacks on its own?*\n\n\"Toban, what is that? Did he have something like this?\"\n\nWhile they fixated on the golden discs, Grid activated his sword dance.\n\n\"Pagma's Swordsmanship, Transcend.\"\n\nBlacksmith's Rage followed. His attack power and speed skyrocketed. Energy swords erupted from his blade, bombarding Toban and the white bear warrior.\n\nExplosions consumed them. Smoke billowed.\n\n\"Kuoong!\"\n\nToban activated his defensive buff and raised his shield. Futile. His <span class=\"rarity-epic\">epic rated shield</span> disintegrated under the assault. He wanted to cry.\n\n*Grid. Why are you so strong?*\n\nJishuka, Pon, and Vantner had called Grid talented. He'd dismissed it as exaggeration. Now he understood. If this continued, they'd lose.\n\n*This is disgraceful.*\n\nDeath meant experience loss. Toban's desperation mounted.\n\nAsuka's voice cut through his panic. \"Truly amazing.\"\n\nBox was still being harassed by the golden discs. They flew past Toban and Black Teddy's defenses like the barriers didn't exist, striking Box repeatedly. This wasn't a battle between rankers. This was a high-level user toying with weaklings.\n\nOne-sided domination.\n\nThe situation could shift if Asuka rejoined the battle as their main damage dealer. As a berserker, she grew stronger as her health dropped. She'd lost a quarter already. Her passive granted twenty percent attack power and ten percent attack speed. She could face Grid.\n\nBut Asuka made a different choice. Fascination overrode combat instinct.\n\n\"Grid! Tell me how to obtain your hidden class! I'll provide enough money for you to live in luxury forever!\"\n\nGame information for financial security. Who could resist? Asuka assumed Grid would cooperate.\n\nGrid's ears perked up. He paused the bombardment. \"How much?\"\n\n\"Name your price.\"\n\nGrid met her gaze. \"One trillion won.\"\n\n\"What?\"\n\nNot one hundred billion. One trillion. The sum exceeded what even a corporate heir could access casually. One trillion represented one-third of her father's company's total assets.\n\nAsuka sputtered. \"Are you insane?\"\n\nGrid stared at her. \"Is something wrong with your head?\"\n\nHis tone dripped with contempt.\n\n\"Do you have a brain? Do you think class change methods stay constant? If they could be sold freely, would hidden classes be rare? They'd be as common as dirt on the street.\"\n\nSilence.\n\nGrid scoffed as comprehension dawned on Asuka's face. She'd overlooked the obvious.\n\n\"You have money, but no sense. Stupid.\" His mood had soured completely. \"You asked for my hidden class method? You attack people for such absurd reasons?\"\n\nGrid wanted to finish his quest. Return to Winston. Consummate his marriage with his beautiful bride. He'd been looking forward to it. The first night. Then back to daily life. Earning money and stats as a blacksmith. Eventually embezzling Winston's taxes once he became lord.\n\nThese people had delayed him. For items. For selfish curiosity.\n\n\"What are you doing?\"\n\nInterfering with others was acceptable. Others interfering with him? Intolerable. Grid's eyes glinted with cold fury.\n\n\"Kill.\"\n\n---\n\nGrid had underestimated Toban and Box's group. That carelessness would nearly cost him.\n\n---\n\n**Glossary of Common Korean Terms**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week  \n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day."
}