{
  "id": 132,
  "title": "Chapter 132",
  "content": "# Chapter 132\n\nThe Pope outleveled Malacus. His stats granted him superior combat power on paper. But numbers lied. His class was Priest, a support role built for healing and buffs. Combat ability? The worst among all classes.\n\nThe Pope's entire offensive arsenal consisted of Goddess' Breath. A single cast would've vaporized an ordinary user. His backup plan was raw magic bombardment, waves of energy that would've turned lesser players to ash. But rankers chose their classes deliberately. They built power. They trained for war.\n\n\"You called me stupid?\" Asuka's face flushed red. \"Even my father never said that to me.\"\n\nShe charged. Twin swords blurred as Transcend and Blacksmith's Rage timed out on Grid's status bar.\n\n*What? She's faster than before.*\n\n**Jjejeong!**\n\nGrid grunted. Keeping pace with the dual blade assault pushed him to his limit. He snapped off Link.\n\n**Chaaeng! Chaeeeeeng!**\n\nAsuka blocked three of the seventeen strikes. Sword Frenzy intercepted nine more. Five landed clean. The party UI showed her health bar drop below half in an instant.\n\nToban tensed. Black Teddy remained calm beside Asuka. He knew berserkers better than anyone. Low health meant high damage.\n\n**Kwakakakang!**\n\nGrid blinked. Asuka's strikes accelerated, each impact biting deeper through his defenses.\n\n> [You have suffered 1,900 damage.]\n\n> [You have suffered 2,080 damage.]\n\n*Why is she stronger?*\n\nGrid recalled the Pavranium from their assault on Box. The golden discs orbited him, intercepting Asuka's assault.\n\n**Chaaeng! Chaeeeeeng!**\n\nThe autonomous defense bought him breathing room.\n\n\"What is that item?\" Asuka's eyes tracked the spinning blades. \"Legendary rated?\"\n\nGrid ignored her. He drew the Ideal Dagger, activated Quick Movements, then swapped back to Dainsleif mid-dash.\n\n\"Shut up and die quickly!\"\n\nHis Insight confirmed what his body already knew. Asuka's combat power was rising with every second. Grid abandoned offense. He let the Pavranium handle defense while he pressed forward, slamming Dainsleif down on her shoulder. The blade bit deep. He chained attacks during her stagger.\n\n**Papat! Papapat!**\n\nStab wounds bloomed across Asuka's body. Her health dropped to twenty percent. That's when the real berserker emerged.\n\n> [You have suffered serious damage. Maximizing the berserk effect.]\n\n> [Attack power will increase by 80% and attack speed will increase by 50%.]\n\nFifty percent attack speed with heavy weapons was obscene. Asuka swapped her twin swords for a halberd larger than her entire frame.\n\n**Chaaeng!**\n\nGrid blocked. His arms buckled under the impact.\n\n\"Kuk?\"\n\nToban saw an opening. He cast his buff.\n\n\"Fierce Momentum!\"\n\n> [Fierce Momentum is activated. You and your party's attack power will increase by 30%, while defense is reduced by 20%.]\n\nBox layered his own skill.\n\n\"Magic Power Resonance!\"\n\n> [The effect of Magic Power Resonance is activated. The buff effect applied to you and your party members will increase by 1.5 times.]\n\n\"Ohhhhhh!\"\n\nAsuka roared. Power surged through her muscles. She swung the halberd, trailing crimson afterimages.\n\n**Peeeeeong!**\n\nGrid's feet left the ground. Dainsleif blocked the strike, but physics didn't care about immunity. His body launched skyward. Hell Chains materialized, black links wrapping his limbs. Chain Frenzy activated. Two seconds of airborne helplessness.\n\nThe white bear warrior charged through the gap, claws arcing toward Grid's exposed throat. Golden discs intercepted, sparking against bone and fur.\n\nAsuka smiled. She'd been waiting for the discs to commit elsewhere. Half a second before Grid's captivity expired, she materialized the Onslaught Greatsword. Her highest damage weapon.\n\nShe jumped. The blade punched through Grid's chest.\n\n\"Kuaaaaak!\"\n\nRed flooded his vision.\n\n> [You have been hit by a blow!]\n\n> [You have suffered 29,900 damage.]\n\nHoly Light Armor reduced physical damage by forty percent. Without it, that strike would've deleted his health bar entirely. Even with it, Grid's consciousness flickered.\n\n**Flop.**\n\nThe Chain Frenzy timer expired. Grid collapsed, rolling across dirt. Blood pooled beneath him.\n\nBox exhaled. *We can actually win this.*\n\nGreen light pulsed from Grid's finger. Doran's Ring triggered. Fifty percent of the damage converted to healing. But the Holy Light Armor had an option. Three hundred percent bonus to recovery magic.\n\nTwenty-nine thousand, nine hundred damage. Doran's Ring restored half. Fourteen thousand, nine hundred and fifty health. The armor tripled it.\n\n> [44,850 health has been restored.]\n\n\"Shit.\" Grid stood. \"I almost died.\"\n\n\"Eh...?\"\n\nAsuka stared. No wounds. No blood. Not even a scratch where her blade had pierced his heart.\n\n\"What's this?\"\n\nToban, Black Teddy, and Box froze.\n\nPagma's Swordsmanship: Kill came off cooldown. Asuka sensed the killing intent, swapping back to dual swords for defense. She couldn't handle it alone. Black Teddy commanded the white bear warrior forward.\n\nThe bear's health was already depleted from the Pavranium bombardment. Kill tore through fur, bone, and muscle. The summon evaporated. The skill continued, colliding with Asuka's crossed blades.\n\n**Jjejeong!**\n\n\"Kyaaack!\"\n\nFirst time for everything. First defeat to another user. First player-driven death.\n\n> [Your party member Asuka has died.]\n\n\"W-What?\"\n\nTheir strongest member, gone. Toban felt half-amazed, half-devastated. Box trembled.\n\n*This is enough.*\n\nBox's obsession with Grid wasn't about his class like Asuka's. He was confirming Grid's worth. Checking if an invitation made sense. Box was a spy. He represented another guild.\n\n\"Grid! Leave the Tzedakah Guild and come to our guild. In the unified guild rankings, we are—\"\n\nA black disc separated Box's head from his shoulders.\n\n> [You have been hit by a lethal blow!]\n\n> [You have died.]\n\n*Crazy.*\n\nThey called him a psychopath for good reason. Who cuts someone's throat mid-sentence? Box died grimacing, his body dissolving into grey light.\n\nBlack Teddy and Toban remained. Black Teddy's face twisted with rage.\n\n\"You dare... How dare you kill the Young Lady!?\"\n\nGrid glared back. \"I'm wrong for killing her? Think about it. Who attacked first? Who tried to kill me? Who should be angry right now?\" His voice rose. \"Ah, shit. I'm angrier the more I think about it. Die.\"\n\nBlack Teddy was strong. Not strong enough. His pets were dead, resurrection timers still counting down. Grid attacked. Black Teddy became light.\n\nToban stood alone.\n\n\"Haha...\" Nervous laughter escaped his throat.\n\nGrid's smile was sharp. \"Aren't you good at acting? You should receive something at this year's acting awards.\"\n\n\"Haha...\"\n\nThe laughter continued. Grid's expression darkened.\n\n\"Do you have any excuses?\"\n\nToban had a conscience. Deception had limits. He bowed, voice cracking.\n\n\"I'm sorry! I was blinded by greed!\"\n\nGrid squatted in front of him. Extended his hand.\n\nToban stared at the open palm, confused.\n\n\"Give me money.\" Grid's tone was flat. \"If you give me enough to soften my anger, I might forget about this. You don't have to. I'll just report you to Jishuka.\"\n\nJishuka's nature meant zero tolerance for traitors. Toban knew this better than anyone.\n\nHis inventory opened. Twenty thousand gold. Twenty-four million won in real currency. But Toban was genuinely sorry. Afraid of retaliation. He didn't hesitate.\n\nGrid's anger cooled. Twenty-four million won from one battle wasn't a bad haul. He pocketed the gold.\n\n\"Okay. This is enough for now.\" Grid paused. \"But I'm sorry. Don't even dream of having an item made by me.\"\n\n\"G-Grid...!\"\n\nToban looked ready to cry. But guilt prevented him from begging forgiveness.\n\nGrid's heart softened at the genuine regret. He offered a thread of hope.\n\n\"Well... Yes. I'll just forgive you. If you serve me like a slave, I'll make you an item someday...\"\n\n\"...Thank you.\"\n\nServe as a slave? Toban couldn't decide if this was mercy or punishment. But he'd committed the betrayal. He had no choice but to accept.\n\nGrid stood. \"Stand up. Let's depart.\"\n\n\"Huh? Depart...? Where?\"\n\nGrid's smile turned sweet. \"Let's go complete my quest. You've become my slave.\"\n\n\"...\"\n\nFirst ranked paladin. Sixty-eighth on the unified rankings. Chief of staff of the Tzedakah Guild.\n\nToban had just become Grid's property.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}