{
  "id": 134,
  "title": "Chapter 134",
  "content": "# Chapter 134\n\nThe Judar Church's sanctum wasn't far from the Dominion Church. A shortcut could cut the journey to three days. But almost no one used it. Most travelers stuck to the main road, even though it doubled their travel time.\n\nThe reason was simple: griffons.\n\nTheir habitat dominated the shortest route. One moment of distraction and you'd find yourself surrounded by dozens of the beasts. Local lords used the area as an execution ground, dumping criminals into the canyon and letting nature take its course. Visitors were rare. Survivors, rarer still.\n\nGrid and Toban were walking straight into the habitat.\n\nGrid yawned. \"Toban, what are you doing? I'm bored.\"\n\n\"Shh!\" Toban's hand shot out, clamping over Grid's mouth. Sweat beaded on his forehead. \"How many times do I have to tell you? Keep your voice down unless you want every griffon in the canyon on our heads.\"\n\nGriffons were level 260. Strong wings, high stamina, aerial superiority. They struck from above and dragged prey into the sky. Even high-level rankers couldn't fight back when ambushed by a flock.\n\nToban crouched lower. \"Please. Just follow my lead. I've used this path dozens of times. If you do exactly as I say, we'll slip through without seeing a single griffon.\"\n\n\"...\"\n\n\"Minimize your breathing. Move in a crawl. Got it?\"\n\nToban dropped to his belly and demonstrated the proper form.\n\nGrid stared at him. His frown deepened. \"Isn't your tone annoying? Are you trying to teach me? A slave doesn't fear his master?\"\n\nToban's eyes widened. \"A-Ah, Grid. Don't be angry. I just wanted to advise—\"\n\n\"Annoying.\" Grid waved him off. \"I'm not listening to you. Crawling? Are you insane? Didn't I do it enough as a soldier?\"\n\nSouth Korea still hadn't unified with the North. Over a century of armistice, and the provocations continued. Strong young men served mandatory military terms to defend the border. Grid had been one of them.\n\n\"Have you been to the military? Do you know what crawling actually is?\"\n\nToban blinked. \"The military...?\"\n\nHe'd been born in the United States. Military service was a foreign concept.\n\nGrid clicked his tongue. \"A guy who's never served is lecturing me about crawling.\" He jabbed a finger at Toban's chest. \"Hey, civilian. I was part of the South Korean army. I'm *still* a reservist. Do you know how much I suffered crawling through mud during training? I still tremble thinking about it. And now I have to crawl in a *game*? With someone who doesn't even know proper form?\"\n\nToban opened his mouth. Closed it. *How was I supposed to know crawling would be a sore spot?*\n\nGrid grumbled and pulled something from his inventory. A scruffy cloak materialized in his hands.\n\nMalacus' Cloak.\n\nToban's face went white. \"H-Hey, Grid! Are you insane? Why are you taking that out? I told you a dozen times to keep it in your inventory!\"\n\nToban had participated in the Malacus raid. He knew the cloak's option. The bloody smell would stimulate every griffon on the cliff faces. Hundreds of them.\n\n\"You're committing suicide!\" His voice cracked. \"The griffons will swarm us! Put it away!\"\n\nGrid looked at the panicked Toban and smirked. \"Why do you think I chose the shortcut? To save time? No. My purpose is to hunt griffons. I can't overlook a habitat like this.\"\n\nGriffon bones, leather, tendons—all extensively used in item production. Griffon tendons were a main ingredient for the Gale Spear. Pon had paid a fortune to acquire them. Grid had decided then and there to hunt his own.\n\nThis was the perfect opportunity. No griffon habitats existed near Winston.\n\n\"I'm getting everything from these griffons today!\"\n\n\"Crazy bastard!\"\n\n\"What?\" Grid's glare could have melted steel. \"What did you just say?\"\n\nToban didn't shrink back. The griffons were scarier than Grid.\n\n\"I know you're incredibly strong! Your abilities rival the top ten users!\"\n\n\"Hehe, is it that much?\" Grid scratched his nose, embarrassed despite himself.\n\nToban closed the distance and got in Grid's face. Spittle flew. \"But that isn't enough! The number of griffons here is *immeasurable*! Make a disturbance and hundreds will surround us. Even Kraugel couldn't kill them all alone! And you want to hunt them while wearing Malacus' Cloak? Put. It. Away!\"\n\n\"U-Umm...\"\n\nGrid hesitated. *Damn, he has a point.* Griffons were level 260. He placed the cloak back in his inventory.\n\n\"Okay, I understand.\" Grid held up a hand. \"I'll give up on group hunting. Instead, let's pick them off. We hunt griffons one by one. Understood?\"\n\nGrid's jaw was set. Toban realized he wasn't getting out of this.\n\n\"Yes, if it's one at a time...\" Toban exhaled. \"It'll take time, but it's doable.\"\n\nHonestly, Toban wanted the experience and loot too. The moment he decided to commit—\n\n*Kieeeeek!*\n\nThe problem was Toban's shouting. His agitated voice had echoed off the canyon walls.\n\nDozens of griffons gathered in the sky above.\n\n\"Damn...!\" Toban collapsed to his knees. \"It's over! We're dead!\"\n\nGrid snorted. \"Stop talking nonsense. How can I die in a place like this?\"\n\n\"Grid...\"\n\nIn seconds, Grid stood fully equipped. White armor gleamed on his torso. Silver crown on his head. A black greatsword materialized in his right hand. The dignified figure gave Toban a spark of hope.\n\n*That's right... Grid is strong!*\n\nHe'd singlehandedly defeated Asuka, Black Teddy, and Box. His level might be low, but his legendary class put him among the strongest users. Maybe, just maybe, they could survive.\n\n\"Grid! Give me a command!\"\n\nHe'd agreed to be a slave. Time to fulfill his duty. Toban steeled himself for orders.\n\nGrid tossed Malacus' Cloak at him.\n\n\"First, put that on. Then run.\"\n\n\"...?\"\n\n*Run... with Malacus' Cloak? If I put it on, I'll become the target!* Confusion warred with dawning horror. *Why would I wear it if I'm trying to escape?*\n\nGrid's face twisted with frustration. \"You still don't understand? You're bait!\"\n\n\"Bait?\"\n\nToban doubted his ears. *A human—the species with the highest intellect on the planet—used as monster bait?*\n\n\"Are you serious?\"\n\n\"Do I sound like I'm joking?\" Grid's tone was ice. \"This is a command.\"\n\n\"No way! Acting as bait is against human rights! It's not ethical!\"\n\n\"Ethics?\" Grid laughed. \"What does a slave know about civil rights? We can survive this crisis if you act as bait while I pick them off from the rear!\"\n\nIt was true. Fighting dozens of griffons head-on meant mutual death. Toban's eyes stung.\n\n*A few days ago, I was thrilled about receiving an SS-grade quest. My first one! Now I know better. This isn't a quest from God. It's a curse.*\n\n\"Damn!\"\n\nTears threatened to fall. Toban equipped Malacus' Cloak.\n\nThe bloody smell spread like a wave. Every griffon's attention locked onto him.\n\n*Kyaooooh!*\n\nThe griffons were as violent as orcs. The scent drove them into a frenzy. Sharp beaks angled for Toban's skull.\n\n\"Hiik!\"\n\nToban raised his shield.\n\n*Chaaeng!*\n\nThe impact shoved him back several steps. A griffon capitalized on the gap, flapping massive wings to generate crushing wind pressure. Heavy paws slashed toward his chest.\n\n\"Eh? Ehhhh?\"\n\nThe wind knocked him off balance. The griffon's claws zeroed in.\n\n*I can't adjust my shield in time!*\n\nThe paw connected. A serious injury was guaranteed. *Wait, why is this one so strong?*\n\nToban checked the griffon's name.\n\n\"Dammit! This bastard's a field boss!\"\n\nThe griffon leading the twenty-two others was a level 290 field boss.\n\n**Griffon Captain.**\n\n\"Why has God forsaken me?\"\n\nToban screamed as the blow landed. He immediately chugged a health potion and activated defensive buffs. His eyes squeezed shut, bracing for pain—\n\nGrid appeared behind the Griffon Captain.\n\nPagma's Swordsmanship, Kill.\n\nThe timing was perfect.\n\n> **[Critical!]**\n\n> **[The Holy Light Gloves option effect is activated, causing you to attack the target five times.]**\n\nKill's damage at level 2: 1,800% of attack power. Grid had dumped his 200 stat points from the Pope into strength. The pavranium carried God Dominion's blessing, enhancing damage further.\n\nDainsleif recognized twenty-three griffons as enemies. An additional 345 attack power surged through the blade.\n\nBlacksmith's Rage stacked on top.\n\nThe math was lethal. Then the critical hit. Then the Holy Light Gloves proc.\n\nThe damage transcended common sense.\n\n> **[You have dealt 284,000 damage.]**\n\n*Didn't the Pope only have around 300,000 health?*\n\nGrid's eyes widened at the notification.\n\n*Kyaooooh!*\n\nThe Griffon Captain suffered catastrophic damage from a single blow. It plummeted from the sky, slamming into the canyon floor. Critical condition. Barely clinging to life.\n\nToban's jaw dropped. \"Grid... What is this attack power? Don't tell me you didn't use your full strength against Box's group?\"\n\n*Maybe a legendary class is more powerful than I realized.*\n\nGrid shook his head. \"It's not like that. This is pure luck.\"\n\nHe was more surprised than Toban.\n\n---\n\n**Glossary of Common Korean Terms**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to unedited chapters and support goals for extra releases. Early access chapters update after daily releases are complete."
}