{
  "id": 135,
  "title": "Chapter 135",
  "content": "# Chapter 135\n\nGrid was even more surprised than Toban. \"It's not like that. This is pure luck.\"\n\nHe hadn't expected a critical hit. He definitely hadn't expected the glove's five-hit option to trigger *alongside* Kill.\n\n*A critical attack and five hits at once... this is absurd.*\n\nThe power coursing through him felt limitless. Grid pointed at the circling monsters. \"Toban, I'll handle the griffons. All of them.\"\n\nMinutes ago, Toban had ranked the griffons above Grid in threat assessment. But watching Grid reduce the Griffon Captain to a near-corpse in a single strike changed that calculation instantly.\n\n\"Yes! If it's Grid, it's possible!\" Toban raised his shield. \"I'll serve as bait!\"\n\n\"Good.\" Grid turned back to the collapsed boss and raised Failure. \"Pagma's Swordsmanship, Link!\"\n\nThe skill fired at Level 2 potency—800% of his attack power. The Griffon Captain, already crippled by Kill, had no chance.\n\n*Pipit! Pipipipit!*\n\nEnergy blades hammered the creature without mercy. It shrieked, thrashed once, then dissolved into particles of light.\n\n> [You have killed the Griffon Captain!]\n> \n> [4,500,900 experience has been acquired.]\n> \n> [<span class=\"rarity-common\">Griffon Tendons</span> have been acquired.]\n> \n> [<span class=\"rarity-common\">Griffon Leather</span> has been acquired.]\n> \n> [<span class=\"rarity-common\">Griffon Bones</span> have been acquired.]\n> \n> [The spellbook <span class=\"rarity-unique\">Tornado</span> has been acquired.]\n> \n> [Your level has risen.]\n\nGrid frowned at the loot.\n\n*What is this garbage?*\n\nField bosses. They respawned regularly, so the system compensated by making them stingy. Most players were satisfied with the experience and crafting materials, but Grid had different standards.\n\nStill, objectively, he'd gotten lucky. The **Tornado** spellbook had a **0.1%** drop rate. Griffon Captains only spawned in remote habitats, making them a nightmare to farm. Any magician would kill for this book.\n\nGrid, not being a magician, remained ignorant of its value.\n\n*Just an old spellbook. Probably won't sell for much.* He kicked at the pile of bones and leather. *At least the experience was good.*\n\nWhile Grid grumbled over his 'meager' rewards, Toban was sprinting in wild circles, twenty-two griffons snapping at his heels. His mind caught up to a critical error.\n\n*Dammit! I'm not in the party!*\n\nThe boss kill notification hadn't appeared. No experience. No items. He'd been too panicked to notice, but he and Grid weren't grouped. He needed to send an invite—except the griffons were two seconds from turning him into shredded meat.\n\n\"Grid!\" Toban bellowed. \"Party! Add me to the party!\"\n\nGrid looked up, genuinely confused. \"Why?\"\n\n\"What do you mean, why? So I can join your party!\"\n\n\"No, I mean why *should* you join the party?\"\n\nToban nearly tripped. \"You're asking why? Isn't it natural to form a party when hunting together?\"\n\n\"Are you insane?\" Grid's eyes glinted. \"Why would I share my experience and loot with you?\"\n\nHe stepped closer, and his voice dropped into something cold and petty.\n\n\"You keep forgetting that you're my **slave**. We're not equals. You follow. I collect. That's the arrangement.\"\n\n\"W-What?\"\n\nAfter the massacre of Box's group, Toban had traveled with Grid long enough to realize the Holy Light set wasn't just a quest reward—it was a **legendary** artifact. That realization had deepened his shame over the initial betrayal attempt.\n\nBut this was too much. They were hunting together. The bare minimum was a party invite!\n\n\"You're really spiteful!\" Toban stopped running. The griffons encircled him, talons scraping stone. He ignored them, glaring at Grid. \"I'm truly sorry I betrayed you, but not even letting me in the party? That's excessive! I might be beneath you, but I'm still a **ranker**. Experience is precious to me! If I'm playing bait, you should at least give me that!\"\n\n*Kiooooh!*\n\nTwenty-two beaks opened in unison. Toban stood his ground, staring Grid down.\n\nGrid sighed. \"Fine. I understand.\" He waved a hand dismissively. \"If you insist, I'll add you to the party. Hell, I'll even release you from being my slave.\"\n\n\"Eh? R-Really?\"\n\nHope flickered across Toban's face. Then Grid smiled.\n\n\"But I'll tell Jishuka exactly what you tried to do to me. And I'll never craft another item for you. Ever.\"\n\n\"...\"\n\n\"Pretty funny, right? This is what happens when you try to steal my rice bowl.\"\n\n\"G-Grid...\"\n\n*Kiooooh!*\n\nThe griffons struck. Beaks stabbed from every angle. One shield couldn't cover twenty-two attack vectors. Toban's health bar plummeted.\n\n\"I was wrong!\" He stumbled backward, throwing up his shield in a futile guard. \"I got too excited after seeing you kill a boss! I lost control! Please, just save me! I won't ask to join the party again!\"\n\n\"Don't want to.\"\n\n\"Grid!\"\n\n\"...I'll save you if you promise not to forget your position again.\"\n\n\"I understand! Fine! I promise!\"\n\nIt was wrong. Completely, utterly wrong. Grid was *too* spiteful. Toban felt the crushing weight of his situation—there would be no escaping this arrangement anytime soon.\n\nHe didn't know it yet, but the luck he'd encounter as Grid's slave would more than compensate.\n\n***\n\nThe Tzedakah Guild's strength had become legend, even among NPCs.\n\nRoyalty and nobles from across the continent sent envoys with offers—titles, land, gold, power. The temptations came in waves, each more extravagant than the last.\n\nBut the Tzedakah Guild refused them all. They'd committed to working with Grid in Winston. So they resisted, quietly waiting for his return.\n\nIn the process, they'd built exceptional standing with Lady Irene.\n\nDuring the counteroffensive against the Yatan Church—the campaign that began with the birth of the Eighth Servant—the Tzedakah Guild had cleared dozens of quests. They'd even succeeded in raiding Malacus himself. Lady Irene took notice.\n\nShe summoned Jishuka to the castle.\n\n\"To the east of Winston lies a village called Bairan.\" Lady Irene gestured to a map spread across the table. \"Monster incursions keep the population small, but the territory is large. There are several mines. The potential for development is significant.\"\n\nJishuka studied the map.\n\n\"Jishuka, would you like to govern that village? I can grant you the title of baroness.\"\n\nBairan.\n\nThe name resonated. That auction house in Bairan was where Grid first sold the Special Jaffa Arrows—where the world learned his name. The Guardian of the Forest spawned near the village, giving Jishuka countless quest opportunities.\n\n*There are hunting grounds and high-level dungeons nearby. It's only half a day by carriage from Winston...*\n\nGeographically perfect. She could interact with Grid easily. The guild could level efficiently. The population might be low, but users would flock to any territory managed by a top guild. Proper administration could turn Bairan into a goldmine.\n\nJishuka bowed. \"I'm grateful for Lady Irene's favor. I'll serve you loyally for the rest of my life.\"\n\n\"I'm fortunate to have someone of your caliber.\"\n\n> [You have become a baroness of the Eternal Kingdom!]\n> \n> [You have obtained the right to enter the noble social circles.]\n> \n> [You have become the lord of Bairan.]\n> \n> [The estate management system has been created.]\n\nImplementation moved quickly after that.\n\nJishuka convened the guild and marched for Bairan. Pon and Ibellin took the **100 soldiers** stationed in the village and began clearing nearby monster dens to stabilize security. Engineers were hired to repair and expand the crumbling castle.\n\nMeanwhile, Faker and several members assessed Bairan's economy and population, mapping out development strategies. Toban's absence as chief of staff increased everyone's workload, but it wasn't crippling. Honestly, Toban had never been *that* outstanding in the administrative role. The difference was manageable.\n\nStill, something felt off.\n\n\"When's Toban coming back?\"\n\nA week had passed since they'd declined his request for help with that SS-grade quest. At some point, he'd blocked whispers entirely. They couldn't help wondering if something had gone wrong.\n\nBut worry didn't take root. Toban was a top ranker. Dependable. He was probably just grinding through the quest with his usual focus.\n\n\"He's busy with his quest. He'll show up when he can.\" Vantner scratched his bald head. \"More importantly, when the hell is Grid coming back?\"\n\nVantner was *still* complaining about Grid.\n\nAnd honestly, Grid *was* overdue. A month had passed since he'd left for his class quest. No contact through the guild window. Whispers went unanswered.\n\n\"Grid left for a quest, right? But that guy's reached **Level 170** in the past month.\" Vantner squinted at the guild roster. \"Seems more like he's grinding in some dungeon, just like Regas.\"\n\nGrid's leveling speed, visible in the guild information, was genuinely monstrous.\n\n*Pagma's Descendant...*\n\nJishuka had witnessed Grid receive Braham's quest in real-time. She'd researched Pagma's identity afterward. Grid was the successor to history's greatest blacksmith—a **legendary class**.\n\n*A legendary class quest would have insane difficulty. No wonder he's late.*\n\nVantner wasn't alone in wanting Grid back. Jishuka wanted him to return immediately. The members wanted to see his growth. More urgently, they were *desperate* for him to craft their items.\n\nWhile they waited, Bairan developed rapidly.\n\nWord spread that the renowned Tzedakah Guild had claimed the territory. Users began migrating steadily. If the trend held, economic growth would accelerate exponentially. Someday, Bairan could be promoted from village to city—just like Winston.\n\nBut good news came with bad.\n\nThree of the six new recruits—Asuka, Black Teddy, and Box—left the guild without warning.\n\n\"They just vanished. What the hell?\"\n\n\"They were sketchy from the start. Better they left now than cause problems later.\"\n\nThe veteran members grumbled but cooled off quickly. The *other* new recruits, however, grew nervous.\n\nToon, recently appointed chief of security in Bairan, was making his daily patrol when curiosity got the better of him. He opened a whisper to Box.\n\n—Hey, what's going on? I thought you were staying until you figured out who the skull helmet guy was?\n\nBox's reply dripped with amusement.\n\n—I already met him. Led to... unwanted results. So I'm leaving.\n\n—Hoh? Really? So who is he?\n\n—No fun if I tell you that easily. Here's a hint: he's a very surprising person.\n\n—What? That's it? Are you trying to piss me off?\n\nToon's tone sharpened. He forced himself to calm down and typed a farewell.\n\n—Toon, remember my offer? After you meet the skull helmet, leave the Tzedakah Guild and join mine. We'll always welcome someone with your skills. Later.\n\n\"Che, what a sly bastard.\"\n\nToon closed the whisper and pulled up the guild information window. Something caught his eye.\n\nThat **Level 110** blacksmith he'd met in Winston a month ago was now **Level 172**?\n\n\"...Ohu.\"\n\nToon's eyes gleamed with fighting spirit."
}