{
  "id": 136,
  "title": "Chapter 136",
  "content": "# Chapter 136\n\nEvery gamer knew the truth: levels didn't lie.\n\nSatisfy had revolutionized the world with its virtual reality system, but at its core, it was still a game. Level remained the most fundamental measure of power.\n\nEvery level granted 10 stat points. More stats meant more strength. Higher levels unlocked better equipment and stronger skills. But the real advantage ran deeper than simple numbers. At certain thresholds, the stats themselves evolved.\n\nTake Strength, for example.\n\nBelow Level 100, each point granted 0.1 Attack Power, 3 Health, and 20 Weight Limit.\n\nAbove Level 100? That became 0.2 Attack Power, 5 Health, and 30 Weight Limit.\n\nAt Level 200, the growth accelerated further: 0.3 Attack Power, 7 Health, and 40 Weight Limit per point.\n\nThis exponential scaling triggered every hundred levels. Players called it Stats Awakening. The higher you climbed, the wider the gap between you and those below.\n\nGrid, however, existed outside this paradigm.\n\nAt a mere Level 170, he'd knocked down four rankers above Level 200. He'd slaughtered dozens of Level 260 griffons. Hundreds more had fallen to his blade over the past four days. The legendary class didn't just bend the rules. It shattered them.\n\nToban watched Grid skin another griffon carcass. *Epic hidden classes are already considered powerhouses. But a legendary class? This is absurd.*\n\nThey'd camped in the griffon habitat for four days straight, hunting without pause. Toban wiped sweat from his brow. The question had been building in his mind for hours.\n\n\"Grid.\" He kept his voice casual. \"How did you get a legendary class?\"\n\nHidden classes required immense effort and a healthy dose of luck. Legendary classes? Those were statistical impossibilities. Toban wanted to know the story. Maybe he could learn something. At the very least, it would make for entertaining conversation.\n\nGrid's expression darkened.\n\nThe memories clawed at him. Months of suffering. Dozens of deaths. Everything he'd owned, stripped away piece by piece. His stomach churned.\n\n\"Don't ask.\"\n\nToban caught the look on Grid's face and backed off immediately. *Shit. Touched a nerve.*\n\n*He must've gone through hell. Of course getting a legendary class wouldn't be easy. I should drop it.*\n\nFour days. They'd been grinding in this griffon habitat for four full days. Grid had gained 10 levels and reached Level 180. Toban suspected Grid wanted to hit Level 200 before moving on.\n\nThe problem? Toban was getting nothing. No experience. No items. Just the privilege of wearing <span class=\"rarity-unique\">Malacus' Cloak</span> and playing bait while Grid reaped all the rewards. His number one spot on the paladin rankings—the position he'd defended for months—was slipping away. Damian was probably closing the gap right now.\n\nToban shifted his weight. \"Grid. We should wrap this up. Don't you have a quest to finish?\"\n\n\"Hrmm...\" Grid scratched his chin.\n\nThe experience here was incredible. *If I could just stay until Level 200...*\n\nHe shook his head. *Bad idea.*\n\n*It took four days to gain 10 levels. Twenty levels would take at least eight more days. That's too long.*\n\nHis eyes drifted to Toban. *And honestly... I feel a little bad for him.*\n\nThe realization surprised him. He'd been treating Toban like a slave. Somewhere around day two, a tiny seed of guilt had sprouted. It felt foreign. Uncomfortable.\n\n*He's a ranker. I can't keep using him for free. This is a good stopping point.*\n\nSomething had changed in him. Grid felt remorse for exploiting another person. When had that happened?\n\n*No. I need to stay ruthless. This world doesn't reward kindness.*\n\nHe frowned at the sky. *Why did God make me so soft-hearted?*\n\nGrid gathered his equipment. \"Let's go.\"\n\n\"Finally!\" Toban's shoulders sagged with relief.\n\nNo more playing bait for griffons. No more watching Grid collect all the loot. Freedom was within reach.\n\nThey reached the Judar Sanctum in less than a day.\n\nToban stopped at the entrance. His expression turned serious.\n\n\"Leader Pascal is after the Holy Light Set.\" He met Grid's eyes. \"He might be hostile. If there's a fight, I can't help you. You understand?\"\n\nGrid shrugged. \"I'm used to fighting alone.\"\n\n*How could the leader of the Judar Church be stronger than the Pope?* Grid had killed Pope Drevigo. Pascal would be easy by comparison.\n\nStill, better to check his progress. *Know yourself before knowing the enemy.*\n\n\"Status window.\"\n\nThe familiar blue screen materialized.\n\n---\n\n> **[Status Window]**\n> \n> **Name:** Grid  \n> **Level:** 180 (140,090/5,531,200)  \n> **Class:** Pagma's Descendant  \n> \n> * The probability of adding additional options when making items will increase.\n> * The probability of item enhancement will increase.\n> * All equipment items can be worn unconditionally. However, there is a penalty depending on the rating of the item.\n> \n> **Title:** One who Became a Legend\n> * Abnormal conditions don't work well on you.\n> * You won't die when health is at the minimum.\n> * Easily acknowledged.\n> \n> **Title:** First Unique Item Maker\n> * Dexterity +200\n> \n> **Title:** Only Legendary Item Maker\n> * Dexterity +350\n> \n> **Title:** Knight Slayer\n> * Stamina +100\n> * Strength +30\n> \n> **Title:** Apostle of Justice\n> * All stats +10\n> * The Apostle of Justice's bravery is unmatched.\n> \n> **Health:** 29,560/29,560 (+7,000)  \n> **Mana:** 3,240/3,240\n> \n> **Strength:** 1,584  \n> **Stamina:** 962  \n> **Agility:** 417  \n> **Intelligence:** 439 (+200)  \n> **Dexterity:** 984  \n> **Persistence:** 498  \n> **Composure:** 364  \n> **Indomitable:** 414  \n> **Dignity:** 364  \n> **Insight:** 664  \n> **Courage:** 308\n> \n> **Stat Points:** 0  \n> **Weight:** 25,519/57,480\n> \n> **[Ability Details]**\n> \n> **Basic Attack Power:** 325  \n> **Weapon Attack Power:** 412~579  \n> **Additional Attack Power:**\n> * Pagma's Swordsmanship Lv.1 (Deactivated): 20% additional attack power\n> * God Dominion's Blessing: 15% additional attack power\n> \n> **Total Attack Power:** 995~1,220\n> \n> **Basic Magic Power:** 220  \n> **Item Magic Power:** 100  \n> **Additional Magic Power:** None  \n> **Total Magic Power:** 320\n> \n> **Basic Defense:** 192  \n> **Item Defense:** 539  \n> **Additional Defense:**\n> * <span class=\"rarity-legendary\">Holy Light Battle Gear Set</span>: Defense +500\n> \n> **Total Defense:** 1,231\n\n---\n\nGrid scanned the numbers. At Level 100, he'd crossed the first Stats Awakening threshold. Each point of Strength now granted 0.2 Attack Power instead of 0.1. Stamina provided 0.2 Defense per point. Intelligence gave 0.5 Magic Power.\n\nHis base stats far exceeded other users at the same level. All those items he'd crafted had paid dividends in permanent stat gains.\n\nBut the penalties gnawed at him.\n\n*Look at this bullshit.* His <span class=\"rarity-unique\">+5 Dainsleif</span> had an attack power of 549~772. The 25% penalty reduced that to 412~579. His armor penalties ranged from 40% to 55%. So much wasted potential.\n\n*Being able to wear anything regardless of requirements should make me broken. Instead, I'm stuck with these goddamn penalties.*\n\nHe closed the window with a gesture. *Whatever. It worked against the Pope.*\n\nGrid had been 30 levels lower when he'd killed Drevigo. His defense had been far worse. He'd still won.\n\n\"Okay. Let's do this.\"\n\nHe approached the entrance. A paladin in white armor blocked his path. Grid produced Isabel's letter of recommendation.\n\n\"I'm here to see Leader Pascal.\"\n\nThe paladin examined the letter. His stern expression softened. He stepped aside and gestured toward the interior.\n\n\"Welcome, Sir Grid. The leader has been expecting you.\"\n\nGrid blinked. *What?*\n\nHe glanced back. Toban had vanished behind a pillar.\n\nA whisper arrived in his ear.\n\n*—Grid, I'm sorry but I can't go in with you. If the leader sees me, he'll be furious.*\n\nGrid rolled his eyes. *Coward.*\n\nHe proceeded alone into the sanctum. The smell of roasted meat and exotic spices hit him first. Long tables groaned under the weight of elaborate dishes. At the head of the room stood a man in golden robes.\n\nPascal, the 11th leader of the Judar Church, spread his arms wide.\n\n\"I am honored to meet the person who received the blessings of Goddess Rebecca and God Dominion!\"\n\nHis smile was warm. Too warm.\n\nPascal was ambitious, yes. But he wasn't stupid. He'd heard about Grid's victory over Malacus. The recognition from both the Rebecca Church and the Dominion Church. Only a fool would antagonize someone with that much political capital.\n\nBesides, Grid had done him a favor.\n\n*The Pope's seat is vacant. I'm the obvious choice to fill it.* Pascal's smile widened. *The Holy Light Set would've been nice, but I don't need it. I'll become Pope regardless.*\n\nFew in the Rebecca Church had the credentials to compete for the position. The leader of the Dominion Church wasn't the ambitious type. Pascal's path was clear.\n\n*I should be thanking Grid. He removed my biggest obstacle.*\n\n\"Please.\" Pascal gestured to a chair. \"I would love to hear the story of how you defeated the demon Malacus and the corrupt Pope Drevigo. Sit. Eat. The food will grow cold.\"\n\nGrid sat.\n\nThe conversation lasted hours. By the end, his affinity with Pascal had soared. The pavranium received God Judar's blessing without incident.\n\nGrid examined the updated item description.\n\n---\n\n> **[Golden Discs Made of Pavranium]**\n> \n> **Durability:** Infinite\n> \n> Golden discs made of pavranium, the strongest mineral produced by the collaboration between the legendary blacksmith Pagma and the legendary great magician Braham.\n> \n> By default, they revolve around and protect their owner. They will also take other actions when given commands from their owner.\n> \n> * They have obtained healing skills due to Goddess Rebecca's blessing. They will increase their owner's health recovery speed by **300%**.\n> * They have obtained an attack buff skill due to God Dominion's blessing. The owner's attack power will increase by **15%**.\n> * They have obtained a defense buff skill due to God Judar's blessing. The owner's defense will increase by **15%**.\n> \n> **Weight:** 3\n\n---\n\n*Perfect.*\n\nThree down. One to go. The journey was almost complete.\n\nPascal's expression grew apologetic. \"But Grid, there's a problem. Finding the sanctum of the Yatan Church is virtually impossible. They operate in complete secrecy. The location has never been exposed in recorded history. You need God Yatan's blessing? That might take some time.\"\n\nGrid's stomach sank.\n\nHe spoke with Toban afterward. Neither of them had any leads on the Yatan Sanctum's location.\n\n*This could take weeks. Months.*\n\nGrid returned to Winston without achieving his goal.\n\nThe city was in chaos.\n\n\"What the hell? Is this an event?\"\n\nUsers crowded the streets. At the city entrance, NPCs lined up in formation. Soldiers. Knights. Phoenix stood among them. Even Lady Irene had come out.\n\nThe Tzedakah Guild members were there too. Rumors said they'd sworn loyalty to Irene recently.\n\n\"Maybe the King is visiting?\"\n\n\"Has to be. He probably heard about Winston's development and came to inspect personally.\"\n\nA king sighting was rare. Some players believed just seeing royalty could grant stat bonuses. Thousands of users packed the walls and square, craning their necks toward the gates.\n\nThe crowd held its breath.\n\nFinally, the gates swung open.\n\nA figure entered. The soldiers verified his identity and blew their trumpets once. Knights drew their swords in salute. Citizens smiled and threw flower petals.\n\nBut it wasn't the King. It wasn't even an NPC.\n\nA scruffy user in beginner-quality gear shuffled through the gates. He wore a wide-brimmed hat pulled low, obscuring his face and nameplate. As if he'd expected the attention.\n\nLady Irene ran toward him.\n\n\"Huh?\"\n\nThe crowd's confusion erupted in a chorus of bewildered murmurs. Irene, the goddess of Winston, beloved by thousands of male players for her beauty and kindness, threw her arms around the mysterious beginner.\n\n\"I've missed you so much.\"\n\nShe gazed up at him with open affection.\n\n\"What the fuck?\"\n\n\"This has to be a bug.\"\n\nWhy would such a beautiful, noble NPC embrace a user like that? While the crowd reeled, another figure approached.\n\nJishuka, one of the most beautiful women in the world, walked up to the beginner. Her usually cold expression had softened into a genuine smile.\n\n\"You came back safely. I was waiting anxiously.\"\n\n\"No way...\"\n\nThe users stood frozen. Winston's Lady came from an influential NPC family. The top-ranked beauty Jishuka, greeting this nobody like an old friend.\n\nThe scene exploded across social media within minutes. News outlets around the world picked up the story. Internet forums erupted in heated debate.\n\n\"Who the hell is that guy?\"\n\n---\n\nAfter dinner, Sehee curled up on the couch next to Youngwoo. The evening news played on the TV. Footage of the mysterious beginner's welcome parade filled the screen.\n\nSehee leaned forward. \"I wonder who that is.\"\n\nShe didn't play Satisfy herself, but she'd absorbed enough from TV coverage to understand why this was newsworthy.\n\n\"He looks like a total noob. Why are all these important people fawning over him?\"\n\nYoungwoo yawned. \"That's me.\"\n\n\"...What?\"\n\n\"I was away on a quest for a while. Everyone was welcoming me back.\"\n\nYoungwoo grinned. \"Pretty popular, right?\"\n\n**CRACK.**\n\nThe TV remote in Sehee's hand made a sickening crunch. Plastic shards scattered across the couch.\n\nYoungwoo clicked his tongue. \"Wow. That remote was ten years old, but still. How does it just break like that? The manufacturer must use garbage materials. We shouldn't buy their products again.\"\n\n\"Argh!\"\n\nSehee glared at her brother and stormed off to her room.\n\nOnce she was gone, Youngwoo sprawled across the couch. Fatigue pulled at his eyelids. Within seconds, he'd dozed off.\n\nA sly chuckle drifted through the living room.\n\n\"...The first night... Hehehehe.\"\n\n---\n\n**[Author's Note]**  \nToo busy tomorrow, so here are the chapters early. Also, no Q&A this month."
}