{
  "id": 138,
  "title": "Chapter 138",
  "content": "# Chapter 138\n\nSeveral months ago, Faker hadn't thought much of Grid.\n\nThe man's blacksmith abilities were excellent, his combat strength undeniable. But his mental immaturity meant he couldn't exert all those abilities. Faker had never voiced it aloud, but he'd thought Grid was frankly ridiculous. A waste of a legendary class.\n\nNow? Everything had changed.\n\n*If he keeps growing at this pace, I might be able to trust him with my back someday.*\n\nGrid pulled out a pair of unfamiliar items and held them up. \"These are the items. I don't know how to use them. There's no manual.\"\n\nFaker examined the trap installation tools and poison combination machine. His eyebrows rose. \"They're good items. This poison combination machine especially. Where did you get it?\"\n\n\"Killed an assassin called Shay. He dropped it.\"\n\n\"Shay?\" Faker's eyes narrowed. \"A user?\"\n\n\"Yeah.\"\n\nShay was the fifth ranked assassin user. Well established. Experienced. And Grid had taken him down and claimed the spoils.\n\n*Shay always travels with Kerb and Sniffer. Did Grid defeat all three alone? Just how strong has he become?*\n\nThe degree of growth exceeded Faker's expectations by a wide margin.\n\n*Jishuka and Vantner said Grid was equal to or better than Pon and Regas.*\n\nHe'd thought it was exaggeration. Friendly boasting. But maybe they'd been telling the truth? Faker felt the familiar competitive urge rising in his chest. The same aggressive drive that all Tzedakah Guild members shared. He wanted to test himself against Grid.\n\nBut now wasn't the time.\n\n\"Wouldn't it be better to learn how to use them later?\" Faker gestured at the clock. \"Look at the time. Your wedding is soon.\"\n\n\"Ah, already?\"\n\nGrid checked the time and bolted for the exit. This wasn't someone else's wedding. He couldn't be late to his own. The Tzedakah Guild and Khan followed in his wake. Khan's expression was heavy with melancholy.\n\n\"Grid... Grid has become the husband of the lady...\"\n\nKhan had lost his sick wife, then his son. After being left alone, he'd fallen into drinking. The trickery of the Mero Company had nearly cost him the smithy that had been in his family for generations.\n\nThen Grid had appeared and saved him. Pulled him from the depths of despair. Helped him rebuild the smithy. Grid was his savior. Similar in age to Khan's dead son, Khan treasured him deeply.\n\nNow that precious person was ascending to a high place Khan could never reach. Of course, he was happy to see Grid doing well. But he couldn't hide the sadness either. He swallowed back tears and forced a smile.\n\n\"Grid, you might be a commoner marrying into a noble family, but don't shrink back. Live well. I'm always cheering for you.\"\n\nGrid grinned at Khan's encouragement. \"I'm Pagma's Descendant. Why should I shrink back from nobles? And don't talk like we're breaking up. I'll still come to the smithy like before, even after I marry Irene. Have you forgotten? I'm your successor.\"\n\n\"Grid!\"\n\nIt must be annoying to help a poor and sick old man, but Grid didn't show it at all. Khan was overwhelmed. Tears spilled down his weathered cheeks. Grid handed him a handkerchief.\n\n\"Your son asked me to do something. He asked me to take care of his father.\"\n\nIt wasn't a lie. In the past, Grid had visited Khan's family cemetery. While Khan slept, he'd encountered ghosts. Among them, Khan's ancestor had given him the clue to obtain Pagma's Swordsmanship. Khan's son had asked Grid to take care of his father.\n\nA son who worried about his father even after death. Grid liked Khan and had been touched by his son's devotion, so he tried to do right by the old man. Of course, it wasn't purely altruistic. To be honest, some of his actions had been calculated to inherit the smithy. But that didn't change the fact that he genuinely liked Khan. That emotion was still there.\n\nKhan's expression slowly contorted.\n\n\"Grid... Why is your handkerchief so filthy? Is this a rag?\"\n\n\"It isn't a rag. It's a handkerchief. But I didn't wash it, so it looks like one. Hahaha! Well, it's fine. Are you going to die if you wipe your tears with a rag?\"\n\n\"Tsk tsk, you're worse than an old widower.\" Khan shook his head. \"I'm relieved that the maids will take care of you after you marry the lady.\"\n\nThe Tzedakah Guild watched Grid and Khan with warm eyes. Grid looked admirable to them, demonstrating that users and NPCs could truly be friends. NPCs had the same emotions as humans. They felt ashamed for treating NPCs as simple artificial intelligence in a game.\n\nThe party arrived at the castle.\n\n\"Welcome!\"\n\nThe knights and soldiers already recognized Grid as their lord. He was lauded as a hero, soon to become the husband of the lady. They entered the castle's garden, where the beautiful bride waited.\n\n\"Grid!\"\n\n\"Lady Irene...\"\n\nHer white dress highlighted her beauty. Irene's shy smile was radiant enough to rival Yura and Jishuka.\n\n\"Ack!\"\n\nThis beautiful and noble woman was being taken away by Grid. Vantner swallowed back tears. He discovered Knight Bland crying with a runny nose and felt an immediate kinship.\n\n\"You too, Lady Irene...\"\n\n\"You...\"\n\nThe two men exchanged glances as the grand marriage ceremony began.\n\nDozens of senior nobles from across the kingdom attended, along with foreign envoys. Earl Steim's speech and the congratulatory message from the king's messenger elevated the atmosphere.\n\n\"There are foreign envoys and even a message from the king...\" Jishuka murmured. \"It's no exaggeration that Earl Steim is one of the kingdom's greatest powers.\"\n\nShe'd only pledged to Irene because of Grid, but now it seemed to be a wise decision in many ways.\n\n*No matter how I look at it, Grid is truly amazing.*\n\nJishuka smiled as the military band started playing light, cheerful music. Hundreds of people watched as Grid and Irene exchanged vows of love.\n\n\"Do you swear to respect and love one another until you become light and return to Goddess Rebecca's side?\"\n\n\"I swear.\"\n\n\"I swear.\"\n\nNo one spoke first. Grid and Irene responded at the same time. The guests cheered like they were witnessing soulmates.\n\n\"Share the token of your pledge.\"\n\n*Token of the pledge?*\n\nGrid couldn't understand the officiant's words. The bride's side had handled all wedding preparations. He panicked. Irene handed him a pair of rings. The finest gold rings with diamonds in the center.\n\n\"Put these rings on our hands.\" Irene's face flushed as she spoke.\n\nHer red face was so lovely that Grid picked up the small ring with trembling hands. He slid it onto Irene's finger. Irene placed the ring on Grid's finger. A notification window flashed.\n\n> [You have worn the Ring of Pledge. If you are with the person wearing the same ring, special effects will occur.]\n>\n> [You have pledged eternal love with Irene Winston von Steim.]\n>\n> [You have become the husband of a lady.]\n>\n> [You can now check the estate's information using the authority of the lady's husband. However, you have no right to decide estate policy.]\n>\n> [You will gain more benefits and have a stronger voice the higher your wife's liking towards you.]\n>\n> [If your wife's liking is low, the worst case scenario is a divorce. Be careful.]\n>\n> [You have become an earl's son-in-law.]\n>\n> [The Nobility stat has been opened.]\n>\n> [All stats have increased by 20.]\n>\n> [You can advance into the social circle of the nobles.]\n>\n> [You will receive a monthly salary of 500 gold.]\n\nGrid's mouth dropped open. His fortune was increasing thanks to his beautiful, competent, and kind bride.\n\nEarl Steim watched his daughter blush as Grid slipped the ring onto her finger. He scanned the crowd and spotted Khan. He approached the blacksmith and offered him a drink.\n\n\"Are you Grid's friend?\"\n\nKhan looked up with surprise. \"Why is a great person like Your Lordship interested in someone like me?\"\n\n\"Don't speak like that. Aren't you a blacksmith who represents the north and a friend of my son-in-law? It's an honor to talk to you.\"\n\n\"Yes...\"\n\nAfter that, the drinking began in earnest. Most people drank alcohol like water while blessing the bride and groom. Vantner and Bland got drunk together and cursed the bridegroom. Knight Captain Phoenix expelled them.\n\nForeign envoys and senior nobles discreetly laughed at the fact that the groom was a commoner. But the good mood was sustained because Faker secretly stunned them and placed them asleep in a corner.\n\nMeanwhile, the residents and users in Winston were also celebrating. Fireworks and music filled the air with a festive atmosphere.\n\n\"Lady Irene got married!\"\n\n\"Ahh! It's to our hero!\"\n\n\"I hope the lady gives birth to a son!\"\n\n\"Yes! I'm looking forward to the future!\"\n\nThe NPCs learned that Irene's marriage partner was Grid and danced with joy. The users didn't know the details and weren't particularly interested in Irene's marriage. They were delighted about other things.\n\n> [Irene, the lady of Winston, has married and blessed everyone!]\n>\n> [All Winston products will be exempt from taxes for the next 10 days.]\n>\n> [Users who set Winston as their residence will gain a 50% increase in experience and 30% increase in item acquisition for the next 15 days.]\n>\n> [Users who have settled in a city or village that belongs to Earl Steim will gain a 30% increase in experience and 15% increase in item acquisition for the next 10 days.]\n\nThis was incredible luck.\n\nThe millions of users in Earl Steim's territory started hunting hard to take advantage of this opportunity. Users from other regions heard the rumors and migrated to Earl Steim's territories to experience the event. The population growth was enormous.\n\nAmong them, the number heading to Winston was unmatched. But Winston's population was already saturated. Users who planned to move to Winston were forced to look at other villages nearby.\n\nThose villages included Bairan, managed by the Tzedakah Guild. Bairan was a territory under Winston. As a result, it achieved tremendous growth in a short period. Thousands of people migrated daily. Hundreds of new houses were built. The number of shops increased. The economy boomed.\n\n\"Ah! What is this? I'm too busy!\"\n\nJishuka and the Tzedakah Guild cried out. If this trend continued, money would pour in. But they worried about being too busy to level up.\n\n***\n\nNow, let's go back in time to the wedding night.\n\nGrid stood naked before Irene, who had uncovered her white body.\n\n\"Beautiful...\"\n\n\"I'm embarrassed...\"\n\nIrene had wide hips and long slender limbs, like a model. Her breasts were only a B cup, making them somewhat inadequate for Grid's taste. But Grid wasn't disappointed. The shape of Irene's breasts was perfect. The harmony of colors was wonderful. The details will be omitted.\n\n\"Irene!\"\n\n\"Oh my.\"\n\nThe excited Grid lowered Irene onto the bed. He immediately used the techniques described in the book he'd read before accessing Satisfy. The techniques were very dazzling. The details will be omitted.\n\n\"Ahh!\"\n\nWhenever Grid's long, hard fingers swept over Irene's white, soft skin... The details will be omitted.\n\n\"Grid!\"\n\nIrene shed tears as pleasure she'd never experienced in her 20 years of living surrounded her. The sensation was so huge that she was almost scared.\n\n\"I'm scared... I feel like another person... It feels like I'll fly away somewhere...\"\n\nHis hands gave her such pleasure that it was hard to believe Grid was a virgin. The reason he could demonstrate such excellent hand techniques wasn't because he'd read the book, but because he was influenced by his high dexterity stat.\n\nThe combination of his stats and titles meant he had over 1,500 dexterity, transcending human limitations. Sometimes delicate. Sometimes strong. He was able to perfectly control the tempo as his hands swept over Irene's whole body. It was almost enough to earn him the title of caressing king.\n\n\"Grid... Hurry!\"\n\n\"Irene!\"\n\nIrene looked up at him with a yearning expression. The moment Grid met that gaze, he let go of his reason. He took a deep breath as for the first time in his 27 years of life... The details will be omitted.\n\n\"Ahh... Grid! I love you! I love you! I love you!\"\n\nAs the night grew deeper, the intensity of Irene's pleasure grew. Combined with the title effects, Grid's strength exceeded 1,600 and his stamina exceeded 1,000. Grid was comparable to the legendary virile king.\n\nThanks to that, Irene was surrounded by pleasures that ordinary women never experienced. The details will be omitted.\n\n> [Irene's liking towards you has increased.]\n>\n> [Irene's liking towards you has increased.]\n>\n> [Irene's liking towards you has increased...]\n\nIrene's love towards him grew bigger every time Grid moved his waist. The details will be omitted.\n\nThus, the first night was a great success. Grid achieved maximum affinity with Irene in just one night."
}