{
  "id": 139,
  "title": "Chapter 139",
  "content": "# Chapter 139\n\nGrid's eyes snapped open to the sound of birdsong. He sat up, pulse quickening as panic seized him. *Was last night just a dream?*\n\nHis gaze swept right.\n\nA girl with silver hair slept beside him, the morning light turning her pale skin luminous where it showed above the blanket. Grid's chest tightened.\n\n*Irene.*\n\n*My woman.*\n\nTwenty-seven years. He'd gone twenty-seven years without achieving this. Hell, he'd never even held a girl's hand before last night. The thought made something fierce and possessive coil in his gut.\n\n*I'll make her happy. No matter what it takes.*\n\nThe Yatan Church had kidnapped Irene twice. Those memories would haunt her for years. Grid's jaw clenched. He wouldn't let it happen again. Couldn't let it happen again.\n\n*I need to get stronger. Strong enough to protect her.*\n\nDoran would be pleased, wherever the dead went.\n\nIrene breathed softly, still deep in sleep after last night's exertions. Grid rose with exaggerated care, wincing at every creak of the bed frame. He dressed in silence and slipped from the room.\n\nTwo maids waited in the hallway.\n\n\"Have you woken, Sir Grid?\"\n\n\"I need to wash up. Show me to the bathroom.\"\n\n\"Of course.\"\n\nGrid followed them without thinking, then froze in the dressing area. Both maids moved toward him with practiced efficiency.\n\n\"What are you doing?\"\n\nTheir hands were already at his collar. Grid's clothes came off like magic—one moment he was dressed, the next he stood naked, hands frantically covering himself.\n\n\"Are you crazy? Why are you stripping me?\"\n\nBoth maids blinked at him.\n\n\"You must undress to bathe, Sir Grid.\"\n\n\"It's natural for maids to attend their master.\"\n\n*Wait.*\n\nGrid's thoughts raced. *These noble bastards make young girls wash them? That's—*\n\n*That's incredible.*\n\nHe'd seen this in manhwa. Always wanted to experience it.\n\n*Don't waste this opportunity.*\n\nGrid dropped his hands and straightened his shoulders. \"Fine. Proceed.\"\n\n\"Yes, Sir Grid.\"\n\nHe'd fallen for Irene overnight. Sworn to love her forever. But that didn't mean monogamy, right? He was a man! Heroes always had harems! Since ancient times, great men surrounded themselves with beautiful women!\n\nReality proved crueler than fantasy.\n\n*Nothing's happening.*\n\nThe game's restrictions were absolute. Sex once per month, married partners only. Outside those conditions, his body simply didn't respond. Two attractive maids ran soft hands over every inch of him, and Grid felt nothing at all.\n\n*This is insane.*\n\nA famous line surfaced in his mind.\n\n*I'm a eunuch.*\n\nHis frustration mounted as they continued washing him. Worse, he could swear they were laughing at him. His masculine pride crumbled with every pitying glance.\n\nThirty minutes later, Grid emerged from the bathroom, soul thoroughly crushed. The maids dressed him in noble finery—silk and velvet far beyond anything he'd worn before.\n\n\"Sir Grid, you look so handsome!\"\n\n\"The clothes suit you perfectly!\"\n\nGrid studied his reflection and grimaced. \"These aren't too much? I'm the lady's husband, not a noble. If I wear expensive clothes, won't Irene—won't it damage her reputation?\"\n\n\"There's a ceremony today,\" one maid explained. \"You'll be made a noble this morning.\"\n\n\"These aren't a costume, Sir Grid. They're your new station.\"\n\nAfter breakfast, Earl Steim summoned him.\n\nThe earl's study smelled of leather and old paper. Steim gestured Grid to a chair across from his desk.\n\n\"Irene is my only heir. She carries the authority of an earl, and will inherit my title upon my death.\" The earl's weathered hands folded on the desk. \"Beyond her title, Irene governs a major city. Her husband cannot be a commoner. I wish to grant you the rank of viscount. Will you accept?\"\n\n\"Of course.\"\n\nWithin the Eternal Kingdom's hierarchy, an earl could appoint two viscounts and eight barons. Earl Steim already had five viscounts under his banner—one of only two nobles in the kingdom who wielded such authority beyond normal law.\n\nGrid became the sixth.\n\n[You have become a viscount of the Eternal Kingdom.]\n\n[As Earl Steim's son-in-law, you have acquired the Steim surname.]\n\n[You have the authority to rule a territory.]\n\n[You have the authority to command soldiers.]\n\n[You can employ up to three knights—both NPCs and users.]\n\n[You can issue forceful commands to the people. (Not recommended)]\n\n[Monthly salary: 2,000 gold.]\n\n*Yes!*\n\nGrid's salary as the earl's son-in-law had been a disappointing 500 gold per month. Now, with the viscount's stipend added, he'd earn 2,500 gold.\n\n*Three million won a month. In cash. Guaranteed.*\n\nThe thrill hit him like lightning.\n\nEarl Steim noticed his satisfaction. His voice dropped. \"So. Did the first night go well?\"\n\nGrid's enthusiasm died. *How do I answer that?* What son-in-law explained the details of his wedding night to his father-in-law?\n\nHe settled for modest deflection. \"It was something to be proud of.\"\n\n\"Haha!\" Earl Steim's laugh filled the study with warmth.\n\nThe door opened. Irene entered, face flushing as she read the atmosphere. She addressed her father directly.\n\n\"You'll have grandchildren soon, Father. Grid is amazing.\"\n\n\"Oh? My son-in-law is exceptional?\"\n\n\"Truly amazing. I experienced far more than I imagined last night.\" Irene's eyes shone. \"Perhaps five boys, at least. I'll give you as many grandchildren as my strength allows, Father. You'll have a joyful old age.\"\n\n\"Wonderful! I'm so pleased! Grid, please do your best. I want at least ten grandchildren!\"\n\n*Ten?*\n\nGrid couldn't explain the once-per-month restriction. He understood the Steim family's circumstances—they needed heirs. He didn't want to worry the earl.\n\n\"I'll do my best.\"\n\nThe words tasted like ash. Grid excused himself and fled the study.\n\nIrene caught his arm in the hallway. \"You're returning to Khan's smithy today?\"\n\nShe clung to him like she'd die if they separated. Her desire was written plainly—twenty-four hours a day together, forever.\n\nGrid's heart squeezed. \"Before that, I need to do something else. Can you lend me soldiers?\"\n\nHe'd spent a month maximizing Irene's affection through skills and effort. Now he leveraged that goodwill deliberately. Irene couldn't refuse.\n\n\"Soldiers? What do you need them for?\"\n\nGrid led her to the walls overlooking Winston. They stood together, gazing south toward Bairan Village.\n\n\"As your husband, I want to fight for your territory's peace.\" Grid kept his expression serious. \"I'm going to defeat the Guardian of the Bairan Village. The one that's terrorized your people for so long.\"\n\nThe truth was more pragmatic. Grid had learned priorities since becoming Pagma's Descendant. Before acquiring the legendary class, he'd spent a year in one city and barely reached level 80. Now he understood what mattered.\n\n*I need to craft Failure.*\n\n**Failure**—his first creation, an absolutely fraudulent greatsword. Worthless as a commercial product due to impossible usage requirements. He'd never felt strong desire for it before, not when Dainsleif was already the strongest weapon in existence.\n\nBut his thinking had shifted. He needed Failure. He'd awakened to the common sense that better weapons were simply natural progression.\n\n\"You'd fight for my sake? For this territory?\"\n\n\"Only for you.\"\n\n*Sometimes well-meaning lies are necessary.*\n\n\"Oh, Grid!\" Irene's eyes glistened. \"Take a hundred soldiers and two knights. But please, don't push yourself too hard. If you're hurt, my heart will break.\"\n\nShe was so lovely.\n\n*I really did marry well.*\n\nGrid pulled her into a tight embrace. He'd succeed in defeating the Guardian of the Forest. He'd collect that blue orichalcum. Her help wouldn't be wasted.\n\n---\n\n*[Author's Note: Too busy tomorrow, so here are today's chapters instead. No Q&A this month.]*\n\n*[Glossary of Common Korean Terms.]*\n\n*[Current schedule: 20 chapters per week.]*\n\n*[Check out my Patreon for early access to unedited chapters and bonus content.]*"
}