{
  "id": 14,
  "title": "Chapter 14",
  "content": "# Chapter 14\n\nThe 280th log split cleanly in two. Hunger gnawed at my stomach, and the world tilted slightly as dizziness set in. I raised the axe again.\n\n*I wouldn't be me if I gave up now.*\n\nSince childhood, I'd never excelled at anything. Not smart. Not handsome. Shit personality. No athletic ability. No special talents. Zero skills, drowning in jealousy, always making excuses.\n\nI was, objectively, a garbage human being.\n\nBut somehow, I'd managed to have friends in high school. The secret? Persistence.\n\nI wasn't smart, so I studied three times harder than everyone else just to scrape by with average grades. My personality was trash, so I learned to fake it like a politician. I sucked at sports, so I practiced soccer drills until my legs gave out just to keep up during PE.\n\nI knew what I was. So I tried. I refused to quit.\n\nThat persistence got me into university. Got me through military service. Sure, I was drowning in debt because of Satisfy, but I'd clawed my way to something resembling a normal life.\n\nPersistence was the only thing I had.\n\n\"Level... money...\"\n\nThe words became a rhythm matching the axe strokes. On the 460th piece, a notification flared to life.\n\n> [Persistence stat has been opened.]\n\nI froze. \"What?\"\n\n> [Persistence]\n>\n> You never give up, even in the face of a difficult task. You won't get tired easily. The possessions weight limit has increased. The feeling of satiation will last for a long time.\n>\n> * The higher the number, the higher the effect.\n> * Stat points can't be distributed to this stat.\n> * Every time 10 points are gained in this stat, the 'Indomitable' stat will increase by 1 point.\n\nMy hands trembled on the axe handle. *This is insane.* Reduced fatigue, increased carry weight, longer satiety duration. And it boosted Indomitable as a bonus?\n\n*But why now?* I'd shown plenty of persistence during Earl Ashur's nightmare quest. Why hadn't it triggered then?\n\nThe answer clicked into place. *Legendary class.* The same actions, the same effort... but a legendary class amplified the gains beyond what normal classes could achieve.\n\nFatigue evaporated. I attacked the woodpile with renewed fury.\n\n**Ttaak! Ttaak!**\n\nThe rhythm improved as the pile grew. At first, the axe lost a durability point every 200 logs. Then the losses stopped, and my chopping speed increased.\n\nBy the time I split the 1,000th piece, I'd gained four points in Persistence.\n\n> [You haven't consumed food in a long time, so all stats have dropped by half. It is easier to become affected by an abnormal state. If you continue to starve, your health will gradually decline.]\n\nI collapsed. My knees buckled, and I lay sprawled in the wood chips, gasping for air.\n\nThe hunger debuff had nearly killed me.\n\nEven with Persistence helping, my **Level -3** stamina was pathetic. Six hours of chopping wood, and I was completely spent. I pulled bread and water from my inventory, forcing down mouthfuls while staring east toward the Grey Forest.\n\n*The raid party should be at the Guardian by now.* I'd dodged a bullet by not joining them. At this level, I wouldn't have kept up with the party's movement speed. Imagine dying from exhaustion instead of monster attacks. I shuddered.\n\n*I was an idiot to even consider it.* I didn't even know the drop rate for blue orichalcum. My thinking had been too shallow, too desperate.\n\n*Think before you act, dumbass.*\n\nMaybe I'd grown, just a little.\n\nAfter recovering enough to move, I dragged myself back to Smith's smithy.\n\n\"I finished the firewood.\" My voice was hoarse. \"Got as much as I could. One thousand pieces.\"\n\nSmith's jaw dropped. \"**What?**\" Then he exploded into laughter. \"Puhahahaha! You? A **newbie** like you chopped a thousand pieces in six hours? You're not just a newbie, you're a **liar**! Trying to con me, boy?\"\n\nThe laugh died. His glare could've melted iron.\n\n*Is this guy bipolar?*\n\nI pointed toward the backyard. \"Why would I lie about something you can verify in ten seconds? Go check.\"\n\n\"Don't need your permission.\" He jabbed a finger at my chest. \"But if you're scamming me, I'll boot you straight out of here.\"\n\nI followed him outside.\n\nSmith's expression went slack. He stood frozen, staring at the massive pile of perfectly split firewood stacked against the fence.\n\n\"H-How...\" His mouth worked soundlessly. \"How did someone like **you** cut this much this fast? And they're **perfect**...\" He whirled on me. \"No, forget the time! You don't have the **stamina** for this! Tell me the truth! Where'd you get it? Vans' carpenter shop? That woodcutter in the mountains? You stupid bastard, I said to chop it **yourself**!\"\n\n\"Are you serious right now?\" Heat rose in my chest. \"I **did** chop it myself!\"\n\n\"Impossible!\"\n\n*Is he senile?* I grabbed the axe. Smith flinched, stumbling backward.\n\nI set up a fresh log.\n\n**Ttaack!**\n\nA thousand repetitions had refined my technique to its peak. The axe connected with a clear, ringing note that sang through the courtyard. The log split perfectly down the grain.\n\nSmith's eyes widened. He stared at the split wood, then at me, then back at the wood. Finally, he nodded slowly.\n\n\"I thought you were just another worthless newbie.\" His tone had shifted to something resembling respect. \"But you've worked in woodcutting for years.\"\n\n\"No.\"\n\n\"A professional woodcutter, then.\"\n\n\"No.\" I extended my hand. \"Pay me first.\"\n\n\"Mm... yes.\" Doubt still lingered in his eyes, but he pulled out 40 coins. \"The work's better than expected. Here's extra.\"\n\n> [Quest Complete!]\n> [Experience +15]\n> [Affinity with Smith has increased.]\n\nSmith's expression had changed. Before, he'd looked at me like a cockroach. Now... maybe a stray dog?\n\nProgress.\n\nA wave of satisfaction washed over me. After the crushing weight of those S and SS-grade quests, completing something **normal** felt incredible.\n\nBefore I could savor it, Smith shoved a pickaxe into my hands.\n\n\"Climb the mountain. There's a mine up there.\" He jerked his thumb toward the peak. \"Gather iron ore.\"\n\n\"How much?\"\n\n\"As much as possible!\"\n\n> [Mine Iron Ore]\n> \n> Difficulty: E\n>\n> Blacksmith Smith is suspicious of you. He keeps looking and looking, but Smith can't understand why you are better at chopping firewood than him. Smith has greatly increased the difficulty of the task in order to assess you properly.\n>\n> Quest Clear Conditions: 80 pieces of iron ore.\n>\n> Quest Reward: Affinity with Smith +30, experience +55, 20 bronze.\n>\n> Quest Failure: Affinity with Smith -30.\n\nFifty-five experience. Enough to push me up three levels and finally escape the negative zone.\n\nThen reality hit. *Other people start at Level 1. I'm celebrating reaching Level 0.*\n\nThe absurdity of it settled in my chest like a stone.\n\n\"I'm going.\" I gripped the pickaxe and turned toward the door. My passive skill for understanding items would make the mining easier. No point wasting time.\n\nOn the path to the small mountain behind the village, I spotted a kid walking by.\n\n\"Hey.\" I waved to get his attention. \"Any monsters on that mountain?\"\n\nThe kid couldn't have been older than eight. He wiped his runny nose with his sleeve and shrugged. \"Are you stupid? There's no monsters on a mountain **attached to the village**. My dad says the lord's soldiers patrol here for our safety.\" His lip curled. \"Stop being such a **coward**, Traveler.\"\n\n\"C-Coward?\" My fist clenched. \"Listen here, you little—\"\n\nThe urge to give this brat a proper headlock surged through me, but movement caught my eye. A large man approached. Probably the kid's father. He looked between us with open disapproval.\n\n\"Boy.\" The man's voice was gruff. \"Why are you wasting time with that **traveler**? He looks **stupid**. Don't associate with him.\"\n\nThe kid nodded seriously. \"I only answered because he looked so pathetic and frustrated.\"\n\n\"Huhu, my son's too kind.\" The father ruffled the boy's hair. \"How did a traveler like **that** even get into our village? This isn't a place for lazy people.\"\n\n\"Right.\" The kid puffed up his chest. \"But he asked me a question, and I didn't want to be rude.\"\n\n\"Hahahat! Good, good. Let's go eat. Your mother's waiting.\"\n\n\"Yes, Father!\"\n\nThey walked away, leaving me standing in the dirt.\n\n*Even the kids are shitting on me now.*\n\nThe NPCs' attitude was getting worse. During the Level 1-10 beginner phase, NPCs might not have been **friendly**, but they'd at least taught me things and helped me progress. Now? At Level -3, they treated me like garbage. Eye contact alone seemed to irritate them.\n\nMy 500 reputation from discovering Pagma's Rare Book, plus the Dignity stat from my class change... none of it mattered. The negative level itself seemed to poison every interaction.\n\n*Doran was a saint compared to this.*\n\nAt least Doran had mistaken me for someone competent. Sure, he'd forced that insane quest on me, but he hadn't **ignored** me.\n\n*Doran's Ring...*\n\nThe loss still stung.\n\nI stared at the sky for a moment, letting the frustration drain away. Then I pulled up my status window before heading into the mountains.\n\n---"
}