{
  "id": 140,
  "title": "Chapter 140",
  "content": "# Chapter 140\n\nWinston's parade ground stretched wide enough to hold five thousand soldiers. Today, only a hundred men stood in formation, confusion rippling through their ranks.\n\n\"Morning drills ended an hour ago. Why are we still here?\" one soldier muttered.\n\nAnother shifted his weight. \"And it's just our unit. Nobody else.\"\n\nWinston currently housed two thousand and thirty troops. Earl Steim had brought fresh recruits to replace the men lost fighting the Yatan Church. Out of that entire garrison, only one hundred had been summoned. The 13th Hundred Man Unit.\n\nA soldier wiped sweat from his brow. \"We're the ones who always fuck things up. They're going to punish us for something.\"\n\n\"Alright, think. What did we do?\" The man next to him started counting on his fingers. \"Last night, third watch at the armory. Did any of you fall asleep?\"\n\n\"No way.\" The accused guard shook his head. \"The Yatan Church situation is still hot. We rotated sleep shifts. Nobody caught us.\"\n\n\"Then second patrol, the market run. Did a merchant complain about theft?\"\n\n\"We only grabbed some fruit. Maybe a meat skewer. No one raised hell.\"\n\nSomeone scratched his chin. \"I don't think we did anything wrong. We roughed up some gangsters causing trouble in the slums, but that's our job, right?\"\n\n\"Should've earned us a commendation.\" The first soldier threw up his hands. \"So what the hell did we do?\"\n\nUnable to solve the mystery themselves, they turned to their captain.\n\n\"Jude. Why are we here?\"\n\nJude's face remained blank. He'd been following his normal routine when the assembly order came down. His mind, which worked best when his fists were flying, offered nothing useful now.\n\nOne soldier elbowed another. \"He doesn't know either.\"\n\n\"Obviously. Fighting is all the captain's good for. Everything else...\" The man made a helpless gesture.\n\nJude stood in silence.\n\nFootsteps echoed across the parade ground. Two knights emerged from the keep. Romeo Laniche, his golden plate armor catching the sun beneath a crimson cloak, and his second, Deck. Romeo's voice cut through the murmuring ranks.\n\n\"Silence! Viscount Grid approaches!\"\n\n\"Viscount?\" a soldier whispered. \"Didn't he just get married yesterday?\"\n\n\"Man should be exhausted from his wedding night, not inspecting troops.\"\n\nGrid appeared at the far end of the ground. White armor encased his frame, white gloves on his hands. Something about his bearing made Romeo's flashy gold plate look cheap by comparison. Like the difference between theater costume and a warlord's panoply.\n\n*The hero who saved Winston from that bastard lord and the Mero Company...*\n\nThe 13th Hundred Man Unit saw him for the first time. Admiration rippled through the formation.\n\n*They say he killed Malacus to rescue Lady Irene.*\n\n*Isn't he a master blacksmith too? Damn.*\n\nGrid possessed high reputation stats. His Dignity was substantial. The soldiers stared, and Grid's head dipped slightly under the weight of their attention. He mounted the podium, his gaze settling on Jude. A faint smile touched his lips.\n\n\"Quality is good overall. Irene was right to recommend this unit.\"\n\nWinston's standard troops averaged level seventy to eighty. Yesterday, Grid had used his Insight to measure combat power. Most soldiers clocked in around one thousand. But the 13th Hundred Man Unit averaged two thousand each. Jude registered a staggering five thousand.\n\nLevel one-eighty knights with top-tier equipment barely reached seventy-five hundred combat power. Yet here was Jude in threadbare chainmail, pushing five thousand.\n\nGrid reached for the sheath at his waist. The blade whispered free.\n\n> [Commander's Sword]\n> \n> Durability: 100/100  \n> Attack Power: 100\n> \n> **Dignity +30**  \n> Generates Skill: **Character Observation**\n> \n> *A ceremonial sword given to military commanders appointed by royalty or nobility. The jewel-encrusted hilt makes it impractical for combat, but its true value lies in command. The wielder can observe their soldiers' capabilities in detail, a decisive advantage when directing armies.*\n> \n> Weight: 220\n\n*Character Observation.*\n\n> [Your Insight exceeds 600 points. Character Observation Lv.3 has been activated.]\n> \n> [Character Insight Lv.3]\n> \n> *Observe not only basic personal information but current stats, maximum stat potential, and acquired skills. Limited to allies.*\n\nGrid's eyes focused on Jude.\n\n> **Name:** Jude  \n> **Age:** 25  \n> **Gender:** Male  \n> **Occupation:** Captain, Winston 13th Hundred Man Unit  \n> **Level:** 103\n> \n> **Strength:** 818/2,080  \n> **Stamina:** 431/908  \n> **Agility:** 34/330  \n> **Intelligence:** 11/20\n> \n> **Skills:**  \n> Snatch the Enemy's Weapon and Use it as a Weapon (S)  \n> Silence (A)  \n> I have no Idea (SS-)\n> \n> *A rare fool born in Winston. His strength is unmatched among peers. A natural warrior who knows no fear. Unfortunately, his brain never evolved past basic function. No matter how he struggles, higher command will forever elude him. That he became a unit captain borders on miraculous.*\n\n*What about the knights?*\n\nGrid shifted his attention to Romeo and Deck.\n\n> **Name:** Romeo Laniche  \n> **Age:** 34  \n> **Occupation:** Lady Irene's Knight  \n> **Level:** 196\n> \n> **Strength:** 878/910  \n> **Stamina:** 420/441  \n> **Agility:** 253/270  \n> **Intelligence:** 174/200\n> \n> **Skills:**  \n> Elite Spirit (A+)  \n> Decent Blow (A+)  \n> Cool-headed (B)\n> \n> *Son of Viscount Laniche. Phoenix's disciple. He followed his master into the Steim family's service. His talent blossomed early, and he trained in elite academies. Lately, his growth has stagnated. He feels the weight of that plateau.*\n\n> **Name:** Deck  \n> **Age:** 32  \n> **Occupation:** Lady Irene's Knight  \n> **Level:** 185\n> \n> **Strength:** 750/1,050  \n> **Stamina:** 334/536  \n> **Agility:** 213/320  \n> **Intelligence:** 199/230\n> \n> **Skills:**  \n> Flattery (B+)  \n> Ability to Grasp the Situation (S-)  \n> Conventional Swordsmanship (B)\n> \n> *Excellent at reading situations. Always acts according to prevailing trends. Possesses talent as a commander.*\n\nThe knights' total stats dwarfed Jude's current numbers. But when Grid accounted for the twenty-level gap...\n\n*Jude's base stats are higher. His innate potential crushes theirs.*\n\nHumans weren't born equal. Jude had been gifted something Romeo and Deck lacked.\n\n*But the real difference is the maximum growth threshold.*\n\nThe ceiling on Jude's stats absolutely overwhelmed the knights. If Jude reached his full potential, he'd be twice Romeo's strength. Minimum.\n\n*His intelligence is garbage. But those skill ratings...*\n\nGrid noted the letters beside each skill. Jude's abilities ranked far higher than the knights'. Those skills explained his combat power despite poor equipment and shit brains.\n\n*Jude. You're going to be my knight.*\n\nAs a Viscount, Grid could appoint three knights. Most people wanted cunning advisors or competent governors. Grid thought differently.\n\n*I'm already stupid enough for both of us.*\n\nHe'd pick men with monstrous stat ceilings. Raise them. Make them loyal as hounds. Grid's smile took on a predatory edge as he cycled through the remaining soldiers' information. None matched Jude's potential, but all exceeded standard troops.\n\n*If I work them properly in this raid... no, if I train them hard enough, they'll become elite soldiers. Protection for Winston. Protection for Irene.*\n\nRomeo shifted his weight. Deck glanced at his commander.\n\n*What is he doing?*\n\nGrid had drawn his sword, grinned at them like a lunatic, and spent five minutes staring without speaking. The man they'd lauded as a hero was acting deranged. Anxiety crept through the formation.\n\n*Maybe the stories were exaggerated...*\n\nDisappointment began to color their thoughts. Grid finally sheathed the Commander's Sword. His voice cut across the parade ground.\n\n\"We depart for Bairan Village.\"\n\n\"Bairan?\" A soldier frowned. \"Why? What's there?\"\n\nMurmurs spread. Romeo's bark silenced them.\n\n\"Quiet! Listen when the Viscount speaks!\"\n\nSeveral soldiers jumped. \"Shit! You scared me.\"\n\n\"Sorry.\"\n\nGrid had been standing right next to Romeo when the knight roared. He rubbed his ear, then smiled at the troops.\n\n\"We're hunting the Guardian of the Forest. It's going to be brutal, so prepare yourselves.\"\n\n\"What?!\"\n\nThe exclamation didn't come from the soldiers. Romeo stared at Grid, his usual composure cracking. He forgot about maintaining his dignified image in front of the men.\n\n\"Viscount. You want to fight the Guardian of the Forest? With just... these people? Are you serious?\"\n\n\"Obviously.\"\n\n\"But... why would you say something so insane?\"\n\nThe Guardian of the Forest was a peak-tier golem. Its body consisted of layered rock and orichalcum plates. Swords bounced off. Arrows shattered. It summoned smaller golems endlessly, and its attacks caused localized earthquakes. One of the most dangerous monsters in the north.\n\n\"Even with all of Winston's troops, defeating that thing would be borderline impossible!\"\n\nRomeo wasn't exaggerating. The Guardian required dozens of battle mages or multiple Great Magicians. Winston had four mediocre mages total.\n\nTwo thousand troops without a proper magic corps would be slaughtered. Yet Grid wanted to take one hundred soldiers and two knights?\n\nRealization struck Romeo. \"Ah! You're calling the Tzedakah Guild, right? You'll combine forces like you did against Malacus?\"\n\n\"What the hell are you talking about?\"\n\n*Obviously it'd be easy with the Tzedakah Guild. But I'm not calling them.*\n\nThe soldiers and knights were salaried NPCs. They couldn't claim loot from the Guardian. The Tzedakah Guild members were users. Equals. If they came, Grid would have to split the drops.\n\nFuck that.\n\nGrid planned to use NPCs exclusively. Monopolize every item the Guardian dropped.\n\n*Besides, I don't need their help.*\n\nHe'd solo'd the Pope. Why borrow hands to kill some overgrown rock pile? Grid's voice rose.\n\n\"Everyone, move out! We leave immediately!\"\n\n\"This is sudden...\" A knight's voice held strain.\n\nThe soldiers exchanged grim looks. They were going to die. The Viscount had married their Lady yesterday and already he was making catastrophic decisions. Their future looked bleak.\n\nOnly Jude stood silent. He simply waited to follow Grid.\n\nThe day Grid's subordinate training program began.\n\n---\n\nMeanwhile, at Khan's smithy.\n\n\"When the hell is Grid coming to work?\"\n\nVantner had arrived before dawn. Five hours later, he was still waiting. Yesterday, he'd been so upset about losing Irene that he'd lost his temper. He wanted to apologize for his rudeness. Ask Grid to make his armor.\n\nHe'd waited forty days for this. He needed Grid to show up. But lunch passed. Afternoon bled into evening. Grid never appeared.\n\n*Enjoying his honeymoon, not even coming to his job. That bastard. He's not answering guild chat or whispers either.*\n\nVantner's expression turned black.\n\n---\n\n**Author's Note:** Busy tomorrow, so here are today's chapters early. No Q&A this month."
}