{
  "id": 141,
  "title": "Chapter 141",
  "content": "# Chapter 141\n\nThe journey to the Grey Forest took three days. Grid worked Jude and the soldiers relentlessly.\n\nMalacus' Cloak drew monsters like flies to rot. Each time, Grid forced the soldiers to engage. It was brutal arithmetic. The Bairan monsters started at level 100; the Grey Forest edge crawled with monsters above 120. His soldiers? Level 70 to 80 at best.\n\nThey screamed. They bled. They begged for breaks that never came.\n\nGrid ignored them. He never ordered a retreat. If they had to die fighting, so be it.\n\n*They'll thank me later.*\n\nThe soldiers stopped calling him a hero. Now they muttered \"devil\" when they thought he couldn't hear.\n\nOn the surface, this expedition looked like torture. Yet none of them died. Every time a soldier teetered on death's edge, Grid or the knights intervened. Just enough. Never more than necessary.\n\nThree days of this meat grinder pushed the average soldier level to 90. Jude, always in front, always bleeding, hit level 110.\n\nGrid wiped sweat from his brow. *NPCs are different.*\n\nUsers got 10 stat points per level. Fixed. Predictable. But NPCs? The system rolled dice for them. Six to twenty points, random as hell. Every time Jude leveled, he scooped up at least 16 points.\n\n*Yes. Keep growing, Jude. Then you'll be my faithful dog.*\n\n---\n\nThe party reached the Grey Forest the next morning.\n\nThe soldiers' confidence evaporated the moment they saw the fog.\n\n\"I... I'm sorry, my lord. We can't go any further.\" A soldier's voice cracked.\n\nPoison fog, courtesy of carnivorous flowers, blanketed the forest entrance. Three hundred meters of green death. Even standing five meters back, the soldiers' skin blistered. Health bars ticked downward in real time.\n\nRomeo stepped forward, jaw tight. \"My lord, without a Rebecca priest, we're dead men walking. The Guardian is out of reach. We should turn back.\"\n\nThe knights and soldiers stood frozen. Grid didn't push them.\n\n*Poison fog deals 350 damage per second.*\n\nThe soldiers had less than 3,000 health. Forcing them in meant they'd be corpses before covering 100 meters. He'd spent three days training these men. No point wasting that now.\n\n*I'll go alone.*\n\nThe poison flowers weren't just plants. They were level 160 predators, all tentacles and teeth, terror to travelers and monsters alike.\n\nBut Grid wasn't worried. His hand dipped into his inventory, fingers brushing Dainsleif's hilt. He'd clear a path.\n\n\"Jude?\"\n\nThe captain walked past him. Toward the fog. Toward certain death.\n\nThe knights froze. Jude didn't.\n\n*That's my man!* Grid grinned. *What trick does he have? Some hidden skill?*\n\nJude stepped into the fog.\n\nHis health bar plummeted like a stone down a well. He groaned. Took another step. Another. Then collapsed face-first into the grass.\n\n\"...What.\"\n\nGrid blinked.\n\nThe soldiers erupted.\n\n\"The captain! He just—he's killing himself!\"\n\n\"Rescue him! Now!\"\n\n\"Are you insane? We go in there, we die too!\"\n\n\"Gods, is he really going to die like this?\"\n\nJude's health ticked down. 60%. 50%. 40%. The soldiers could only watch their captain choke on poison.\n\n*Oh. Right.*\n\nGrid's eye twitched. *He's just stupid.*\n\nThree days of leveling, and Jude's intelligence still sat at 11. That skill—\"I have no Idea\"—wasn't a joke. The idiot hadn't marched into the fog because he had a plan. He'd marched in because he had *no plan*. No thought. Just forward.\n\n\"I can't lose him!\"\n\nGrid bolted.\n\n\"Viscount!\" Romeo and Deck shouted in unison.\n\nA viscount throwing himself into poison fog to save a common soldier? It defied logic. Defied every noble instinct.\n\nDeck grabbed Romeo's arm. \"Sir Romeo! If the viscount dies, we're finished!\"\n\nRomeo cursed. \"Move—!\"\n\nToo late. Grid's agility stat wasn't for show. By the time Romeo processed the thought, Grid was already knee-deep in green death.\n\n---\n\n\"Drink!\"\n\nJude's vision swam. Pain crawled through every nerve. He tasted copper. Death felt close, warm, almost welcoming.\n\nThen someone hauled him upright. Liquid fire poured down his throat. A potion.\n\nGrid.\n\n*A noble? For me?*\n\nJude had seen nobles use soldiers as meat shields. Expendable. Replaceable. Grid was different.\n\n*Why?*\n\nHis 11 intelligence couldn't puzzle it out. So he just felt... grateful. Stupid and grateful.\n\nTentacles lashed toward them. Dozens. The poison flowers sensed prey.\n\nNone of the tentacles reached him.\n\n\"Pagma's Swordsmanship, Wave!\"\n\nLight erupted from Grid in a perfect circle. The tentacles disintegrated. The poison flowers *screamed*. Then the fog dissolved like it had never existed.\n\nClean air rushed into Jude's lungs. His high stamina kicked in, purging the poison. He stood, bowed his head.\n\n\"Thank you.\"\n\nGrid stared at him. *Is that all you can say?*\n\n\"It's good to be brave.\" Grid's voice was tight. \"But think before you act. You don't have ten lives.\"\n\n\"...Mm.\" Jude nodded.\n\nBut his expression was blank. Uncomprehending.\n\n*He has no idea what I just said.*\n\nGrid's jaw clenched. It wasn't a complex instruction. Just \"be careful.\" How stupid did someone have to be to not understand that?\n\nThe knights and soldiers caught up, panting.\n\n\"You're alive!\"\n\nThey stared at Grid like he'd split the sky.\n\n\"Dozens of poison flowers at once!\" Romeo's eyes shone. \"This is the man who defeated Malacus!\"\n\n\"And he risked his life for a common soldier!\" Deck added. \"The epitome of nobility!\"\n\n\"Viscount Grid! Viscount Grid!\" The soldiers chanted.\n\nTheir devil had become a hero again. Grid forced a smile.\n\n*Time to crush their hope.*\n\n\"See? With me, the Guardian of the Forest is easy.\"\n\n\"...Ah. Well.\" Romeo shifted his weight. \"That is...\"\n\nDespite the display of power, doubt still flickered in their eyes.\n\nGrid didn't wait for their answer. He just started walking deeper into the forest.\n\nThe knights and soldiers had no choice but to follow.\n\n---\n\nThey found it in the forest's heart.\n\n\"Humans! No humans in forest! Humans pollute forest! No forgive humans!\"\n\nThe goblin lord stood two meters tall, twice the height of his smaller kin. A level 180 field boss. The gatekeeper before the Guardian.\n\nHobgoblins materialized around him. Dozens of them.\n\nGrid assessed the field, then barked orders. \"Final training! Three soldiers per hobgoblin. Knights and Jude, watch the whole field. Help anyone in danger. When the goblin lord crouches, earthquake incoming. Spread out.\"\n\nThe pattern was identical to the Guardian of the Forest. Goblin lord summoned hobgoblins; Guardian summoned golems. Both used area-wide earthquake attacks.\n\nSmart raid parties always fought the goblin lord first. Practice before the main event.\n\nGrid had memorized every step.\n\n\"Move!\"\n\nThe soldiers and knights swarmed the hobgoblins. Grid closed on the goblin lord.\n\n*Pagma's Swordsmanship, Kill.*\n\n> [Critical!]\n> \n> [The Holy Light Gloves option effect is activated, causing you to attack the target five times.]\n> \n> [You have dealt 302,555 damage.]\n> \n> [You have defeated the Guard of the Grey Forest, the Goblin Lord!]\n> \n> [2,600,100 experience has been acquired.]\n> \n> [The Goblin Lord's Club has been acquired.]\n> \n> [The Goblin Lord's Fang has been acquired.]\n> \n> [Your level has risen.]\n\n\"...Fuck.\"\n\nThe critical hit. The Holy Light Gloves' five-strike chain. Kill's absurd multiplier. The combo that had crippled a level 280 griffon boss now annihilated a level 180 field boss in one blow.\n\n*I didn't mean to.*\n\nHe'd wanted to wound it. Train the soldiers. Not delete the damn thing from existence.\n\n\"Hiik! Humans! Scary!\" The hobgoblins scattered like roaches in light.\n\nGrid's eye twitched. *Should've taken the gloves off.*\n\nThe opportunity to train them, wasted. The knights and soldiers just stared.\n\n*Is that even human?*\n\n*Ridiculously strong...*\n\n\"The Guardian of the Forest.\" Grid dusted off his hands. \"Time to hunt it.\"\n\nAmid the stunned silence, only Jude moved forward.\n\nWithout thinking.\n\nAs always."
}