{
  "id": 143,
  "title": "Chapter 143",
  "content": "# Chapter 143\n\nThe combat power hovering above the Awakened Guardian of the Forest's head displayed nothing but question marks. Grid stared at the cryptic symbols.\n\n*A few months ago, I would've thought this was a bug.* He rubbed his jaw. The memory of his old self, constantly complaining about every inconvenience, felt distant now. After the raid on the Yatan Church, after Winston's siege, after becoming a duke... he'd changed. His brain finally worked like a normal person's.\n\n*My Insight stat can't measure this thing.*\n\nThe guardian's crystalline body gleamed with embedded blue orichalcum. Each movement sent refracted light scattering through the ashen forest.\n\nGrid's eyes narrowed. \"Immeasurable combat strength? Like one of those old manhwa villains.\"\n\nHis Insight had worked on Pope Drevigo. That meant the creature in front of him was stronger than the Pope.\n\nGrid shifted his weight, testing his footing on the volcanic soil. \"Came here to hunt, met a raid boss instead.\"\n\nHe'd expected an easy win. The Holy Light Armor set from the Vatican had pushed his combat power to ridiculous levels. This \"awakening mode\" wasn't part of the plan.\n\nStill, Grid's breathing remained steady. *It's stronger, but that just means better drops.* The blue orichalcum coating the guardian's body caught the dim light filtering through the ash clouds. *If I harvest all that mineral, I could forge two weapons like Failure.*\n\nHis pickaxe practically called to him from his inventory. Grid's fingers twitched. *Not yet. Need to kill it first. Can't get distracted chasing the jackpot.*\n\nHe was a greatsword specialist. Ever since character creation, aside from the Ideal Dagger quest item, Grid had lived and died by massive two-handed blades. He understood their weight distribution, their timing, their devastating power better than ninety percent of Satisfy's player base.\n\nMaximum force. One-shot kills.\n\nGrid exhaled slowly and gripped Dainsleif's leather-wrapped handle. His knuckles whitened. The waiting game began.\n\nThe awakened guardian locked its eyeless gaze on Grid. Twin red lights flared where eye sockets should be. It dropped into a sprinter's crouch.\n\nThen it moved.\n\nGrid's internal count started. *One. Two. Now!*\n\nThe guardian entered Dainsleif's strike zone. Grid released every tensed muscle in a single explosive motion.\n\n**KWANG!**\n\nThe dark red greatsword blurred. Steel met crystal with a sound like a church bell. Grid's blade carved into the guardian's torso.\n\n> [Critical hit!]\n> [You have dealt **5,700 damage** to the target.]\n\nThe health bar floating above the guardian dropped roughly one percent. Grid's lips curled.\n\n*Small body, low defense and HP. Just like I thought.*\n\nMonsters fell into basic categories. Attack types. Defense types. Support. Balanced builds. The normal Guardian of the Forest was a textbook tank, a peak golem with absurd health pools and defenses that made mages weep.\n\nThis awakened variant? Pure glass cannon. Its health dropped one percent from a single critical. It had one-shotted that knight earlier with contemptuous ease.\n\n*Fast. High attack power. Aggressive AI.* Grid's eyes gleamed. *Perfect.*\n\nHe excelled at offense. His items, his skills, his entire build focused on overwhelming damage output. Defense-type bosses turned into drawn-out slogs. But attack types? He could delete them.\n\nGrid settled back into his stance. \"Going to kill you quick.\"\n\nStronger than the Pope? Grid was also stronger than the Pope now. Confidence burned in his chest.\n\nBut his head stayed cold.\n\nGrid refused to make the first move. He planted his feet and waited.\n\nThe guardian proved his theory correct. Offensive monsters had offensive AI. It charged again in a straight line, learning nothing.\n\n*Now!*\n\nGrid timed the counter perfectly. Dainsleif swept up in a vertical arc the moment the guardian entered range.\n\n**CHAENG!**\n\nThe blade bit into crystal shoulders.\n\n> [Critical hit!]\n> [You have dealt **6,380 damage** to the target.]\n\nThe guardian's body produced a grinding noise, like stones scraping together. It stumbled, paused, then lined up for another charge.\n\n*Idiot. Single-digit IQ confirmed.* Grid allowed himself a smirk. *Meanwhile, I've got a solid double-digit IQ going.*\n\nHe prepared his third counter. Same timing. Same devastating swing.\n\nThe result was completely different.\n\nThe guardian shifted its upper body at the last instant. Dainsleif cut through empty air. The monster flowed around the blade's arc, positioning itself at Grid's exposed flank.\n\n*The charging was a setup?!*\n\nIce flooded Grid's veins. Monsters using tactics wasn't in the guidebook.\n\nThe guardian planted its back foot and spun. Centrifugal force multiplied the impact as its heel rocketed toward Grid's face.\n\n> [You have been hit by a lethal blow!]\n> [You have suffered **13,090 damage**.]\n\n\"**Kuheok!**\"\n\nPain exploded across Grid's face. Not a skill. Not magic. A basic kick. That basic kick deleted a third of his health bar in one frame.\n\nTwice his own damage output. While wearing legendary armor.\n\n> [The effect of **Doran's Ring** has been activated.]\n> [The option of the **Holy Light Armor** has been activated.]\n> [**19,635 health** has been restored.]\n\nThe shattered nasal bones knit back together. Blood flow reversed, pulled back inside his skull. The pain vanished as if it never existed.\n\nGrid's fury did not vanish.\n\n\"Damn bastard!\" He snarled and activated his skill. \"**Link!**\"\n\n**Pipit! Pipipipipi!**\n\nSeventeen blades of light materialized and slashed into the guardian's body from multiple angles.\n\nThe damage was disappointing. The guardian dodged nine strikes outright, moving with a martial artist's grace. It leaped straight up, sailed over Grid's head, and brought its heel down like a guillotine.\n\nGrid raised Dainsleif horizontally.\n\n**JJEJEONG!**\n\nThe impact sent vibrations through Grid's arms.\n\n> [The durability of **+5 Dainsleif (Reproduction)** has been reduced by **37**.]\n\n*That blue orichalcum is no joke!* Grid's eyes widened behind his helm. Black iron had endured countless battles without a scratch. Now it was being damaged by a crystal golem. *Adamantium would've been better, but blue orichalcum is still premium material.*\n\nThe thought steadied him. This wasn't a disaster. This was a harvest opportunity.\n\n\"I'll kill you!\" Grid roared. His voice echoed through the dead forest. \"Tear your body to shreds! **Blacksmith's Rage!**\"\n\nHe didn't retreat. His momentum intensified.\n\n> [**Blacksmith's Rage** has been activated. Your attack power and attack speed will increase significantly for 20 seconds.]\n\n**CHAENG! CHAEEENG!**\n\nGrid's assault became a storm. The awakened guardian crossed its arms defensively. Grid's boosted attack speed was too fast. The guardian couldn't find an opening to counter. It was pinned down, forced into a defensive shell.\n\nGrid pressed his advantage. \"**Pagma's Swordsmanship, Wave!**\"\n\nEnergy exploded outward in concentric rings. The guardian tried to dodge.\n\nImpossible. Omnidirectional attacks had no blind spots.\n\n> [You have dealt **10,300 damage** to the target.]\n> [The target's attack speed has been reduced.]\n\nThe guardian's movements turned sluggish. It struggled to correct its balance.\n\nGrid had accumulated hundreds of hours of combat experience. He recognized the opening instantly.\n\n\"**Pagma's Swordsmanship, Kill!**\"\n\n**KUOOOOOH!**\n\nKilling intent flooded the air like a physical presence. Romeo and the soldiers crouched in the bushes felt it. Some urinated. Others fainted. The pressure was overwhelming.\n\nThe awakened guardian flinched. Every sensor in its crystalline body screamed danger. The black aura coating Grid's greatsword promised annihilation.\n\n**KWANG!**\n\nThe guardian stomped. The earth itself answered. Seismic waves radiated from the impact point. Trees swayed. Volcanic ash erupted in clouds.\n\nOne of the original Guardian of the Forest's AOE abilities. The awakened form retained it.\n\n\"Ugh.\"\n\nGrid's immunity protected him from status effects. It did not protect him from physics. The ground bucked beneath his feet. His stance collapsed.\n\n> [Your attack has **missed**.]\n\n*Shit!*\n\nHis strongest skill. Wasted.\n\nThe guardian capitalized immediately. Both fists became blurs as they hammered Grid's body.\n\n**PEPEPEPEOK!**\n\nMore hits than Link. Dozens of strikes in seconds. Each impact could crush steel. Grid's legendary armor groaned under the assault.\n\n\"V-Viscount Grid!\"\n\nThe soldiers' screams were distant.\n\nVolcanic ash swirled through the combat zone. To the observers, Grid looked like he was being pulverized.\n\nJude surged to his feet. \"We have to help. The savior will die!\"\n\nRomeo grabbed his shoulder. \"Viscount Grid is safe! We'll only get in the way!\"\n\nRomeo was right. Through the ash cloud, Grid stood firm. He hadn't fallen. The guardian's fists kept striking, but Grid's boots never left the ground.\n\nFinally, the guardian stopped. It stepped back, apparently convinced Grid was dead.\n\nGrid was not dead.\n\nGolden discs emerged from the volcanic haze. They orbited Grid's body, pristine and undamaged.\n\nThe awakened guardian's red eyes widened. It had been striking the golden discs this entire time.\n\n**KWAANG!**\n\nRage fueled its kick. The disc didn't even wobble.\n\nThe two golden discs separated and repositioned. They revealed Grid standing between them, completely unharmed.\n\nGrid's expression was thunderous. \"You dodged **Kill** with a earthquake trick?\" He took a step forward. \"Think you're a smart golem? Think you're clever?\" His voice dropped. \"Damn bastard.\"\n\nHis body rose.\n\nNot a jump. Not a skill activation. Smooth, sustained flight. The **Fly** magic embedded in Braham's Boots activated at Grid's will.\n\nRomeo's jaw dropped. \"Heok! The Viscount can use magic?!\"\n\n\"I don't know!\" Another soldier stammered.\n\nRomeo's mind raced. *Earl Steim said Grid is Pagma's Descendant. How can he use magic? That's senior-level magic!* His worldview shattered. *Could Pagma use magic too? Or is Pagma's Descendant something beyond Pagma?*\n\n**TEONG!**\n\nThe awakened guardian jumped. Four meters. Maximum altitude.\n\nGrid floated at five meters.\n\nThe guardian's grasping hands closed on empty air.\n\nGrid smirked down at it. \"Try another earthquake, stupid bastard.\" His voice carried over the wind. \"Earthquakes don't work on people in the sky.\"\n\nAerial superiority. Ground units had no answer.\n\nIn the grey sky, surrounded by falling volcanic ash like black snow, Grid began to move.\n\n\"**Pagma's Swordsmanship.**\"\n\nHis sword dances normally lasted one-point-five to three seconds. This one stretched longer. Much longer.\n\nBecause he was performing two simultaneously.\n\n\"**Transcend, Link.**\"\n\n> [The new skill fusion has **succeeded**.]\n> [Fusion skill **'Transcended Link'** has been created.]\n> [Your intelligence has increased by **10** due to the successful fusion of a new skill.]\n\n---\n\n**[Transcended Link]**\n\n*A sword dance that transcends imagination and is more dazzling than a butterfly's wings.*\n\n*You will temporarily be in a transcended linked state.*\n\n*A total of 20 strikes will be launched, dealing 150% attack power with each hit.*\n\n*Every time a target is hit, they will be stiff for 0.1 seconds.*\n\n*This skill doesn't share a cooldown with Transcend and Link.*\n\n**Skill Mana Cost:** 1,600  \n**Skill Cooldown Time:** 15 minutes\n\n---\n\n\"Huh?\"\n\nGrid blinked at the notification.\n\nHis plan had been simple. *Transcend doubles my attack power and turns it ranged. Link fires multiple strikes. Combining them should multiply Link's damage.* Basic math.\n\nThe system had other ideas.\n\nSkill fusion. And its power was beyond anything he'd calculated.\n\n**KWAKWAKWAKWAKWAKWAKWAKWANG!**\n\nThe deepest part of the Grey Forest lit up. Black energy blades erupted from Grid's position like artillery fire. The sky above the forest, where the Guardian of the Forest had lived for hundreds of years, became a storm of annihilation.\n\n---\n\n**Glossary of Common Korean Terms:**  \nOG: Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}