{
  "id": 144,
  "title": "Chapter 144",
  "content": "# Chapter 144\n\n> [Critical!]\n> [You have dealt 183,900 damage to the target.]\n\nThe fusion skill Transcended Link hit harder than Kill. More than that, it inflicted stiffness on the target. A new finishing move was born.\n\n*Kiyaaaaaah!*\n\nThe awakened guardian shrieked, its voice raw with pain from the devastating blow. New notifications flooded Grid's vision.\n\n> [Pagma's Swordsmanship has evolved.]\n> [The level of Pagma's Swordsmanship has increased.]\n> \n> [Pagma's Swordsmanship]\n> Lv. 2\n> \n> **When the skill is deactivated:**\n> You can become one with the sword at any time. Increases Physical Attack by 30%, Critical Hit Rate by 20%, and Critical Damage by 10%.\n> * This effect is only applied when a sword-type weapon is equipped.\n> * The skill consumes no mana.\n> \n> **When the skill is activated:**\n> Become one with the sword. Wave, Restraint, Link, Kill, Transcend, and Transcended Link. You can unleash a total of six sword techniques.\n> * The effect of the deactivated skill will be lost.\n> * 20 mana is required to activate the skill.\n> * Once deactivated, it will take 10 seconds until the skill can be activated again. Nothing will be consumed when deactivated.\n\nGrid scanned the updated information. \"This is good.\"\n\nA ten percent increase to physical attack power, critical hit chance, and critical damage while Pagma's Swordsmanship remained inactive. The passive bonus rivaled Advanced Weapon Mastery, a skill only rankers above level 240 could acquire. No, it surpassed it.\n\n*Shame it only works when deactivated, but...*\n\nHe only activated Pagma's Swordsmanship when using Wave, Kill, or Link. Unfortunately, those active skills came with brutal cooldown timers. The window where Pagma's Swordsmanship stayed active was painfully short. For that reason alone, Grid looked forward to reaping the benefits of the deactivated state.\n\n*Kuweeeeeoh!*\n\nThe awakened guardian bellowed. Its health gauge had dropped by a third. It roared at Grid to come down and face it on the ground.\n\nGrid sneered from above. \"You want to kill me?\"\n\nNow that Pagma's Swordsmanship had leveled up, he was tempted to descend and test its improved power. But why make things harder than they needed to be?\n\n\"This ends now.\"\n\n*Suuuuoh.*\n\nGrid drained a high-grade health potion and launched into another sword dance. This time, he executed two techniques in rapid succession. He was aiming for a new fusion. Transcend and Wave. Grid had no doubt this combination would birth something as devastating as Transcended Link.\n\nHe called out the names. \"Transcend, Wave!\"\n\nAnticipation surged through him. But nothing fused. The skills activated normally.\n\n*Kukukukung!*\n\nBlack energy blades cascaded from the sky like a waterfall, raining down from every angle. The awakened guardian recognized the threat immediately. It pulled every mineral and rock embedded in its body inward, forming a hardened shell.\n\n> [You have dealt 15,800 damage to the target.]\n> [The target's attack speed has been reduced.]\n\nGrid frowned. \"Damn.\"\n\nThe fusion had failed, but Wave's attack power had doubled thanks to Transcend. The shell showed deep cracks and dents.\n\n*Looks like only certain sword dances can fuse. I'll finish this first, then experiment later.*\n\nThe combinations he wanted to test most were Transcend and Kill, or Link and Kill. If either worked, the resulting skill would eclipse even Transcended Link.\n\nBut Kill had a four-hundred-second cooldown, reduced to three-twenty thanks to the twenty percent reduction from <span class=\"rarity-unique\">Braham's Boots</span>. The cooldown hadn't expired yet. The experiment would have to wait.\n\n\"Blacksmith's Rage!\"\n\n**Attack Power** and **Attack Speed** surged. Grid swung <span class=\"rarity-unique\">Dainsleif</span> with everything he had.\n\n*Pepepepeong!*\n\nSword energies of different shapes flew out depending on the angle of his swings.\n\nThe guardian couldn't evade. Wave had slowed its movement speed. The Awakened Guardian of the Forest failed to block every attack with its shell. Another scream tore from its throat.\n\n\"Amazing!\"\n\n\"Viscount Grid is invincible...\"\n\nRomeo and the soldiers erupted with excitement. The mighty Guardian of the Forest was being pummeled into submission, reduced to cowering inside its shell. Grid truly seemed to transcend human limits. But that transcendent image was fleeting.\n\n> [The duration of Transcend is over.]\n\nFifty-minute cooldown. Thirty-second duration.\n\n\"Pant... pant...\"\n\nAfter thirty seconds of relentless assault, Grid stopped. Stamina loss hit him like a hammer. Despite his high **Persistence** stat, exhaustion dragged at his limbs. His breathing came in ragged gasps. But his expression stayed relaxed.\n\n*Almost done.*\n\nThe awakened guardian had only a quarter of its health left. After taking Transcended Link head-on, it had resorted to using its minerals as a shield. Useless. Grid's power in Transcend mode had been so overwhelming that its health kept plummeting.\n\nKill's cooldown was nearly over. Time to finish this. Grid steadied his breathing as he slowly descended.\n\n\"Time to collect the loot.\"\n\nGrid prepared to pull out his pickaxe. However, he had overlooked one critical detail. Night was falling.\n\n*Kikik. Kkikikikik.*\n\nGrid descended, confident the awakened guardian was finished. Then it made a strange sound. As darkness bled across the forest, the guardian's red eyes shifted to blue. The blue orichalcum covering its body began to turn purple.\n\nGrid's eyes narrowed. \"What? What are you trying to pull?\"\n\nHe sensed the change in the air. Then the transformed awakened guardian *erupted* with magic power.\n\n*Kwaaaang!*\n\n\"Shit!\"\n\nThe explosion threatened to level the entire forest. The shockwave caught Grid just before he landed, hurling him backward. He spun through the air and crashed into the forest.\n\n*Ku tang tang tang! Kwa kwang!*\n\n\"Ugh...\"\n\nGrid slammed into rocks. Pain flared through his body. Volcanic ash shaken loose from the trembling trees rained down on him. He spat ash from his mouth and cursed.\n\n\"That crazy bastard... Huh?\"\n\nGrid pushed himself up from the ground.\n\n*Kwang! Kwang!* The awakened guardian charged through the forest. Its speed was incomparable to before. Yet Grid felt no tension.\n\n*Jjejeong!*\n\nThe rotating pavranium intercepted the guardian's fists and kicks.\n\nThe awakened guardian tried to strike through the gaps in the pavranium's defense. The attempt failed. The wall of defense the pavranium constructed was absolute. They successfully blocked the guardian's lightning-fast attacks.\n\nGrid snorted. \"Isn't it amazing? This is the power of items.\"\n\n*Kiyaaaaaah!*\n\nThe awakened guardian shrieked, as if offended by his words. Then a blue flash erupted from its open mouth.\n\n*Jeeeong!*\n\nThe pavranium shuddered as they blocked the flash. They became rigid, motionless, just like when they had defended against Jishuka's arrow. This was bad. For the first time, Grid's face tensed.\n\n*Kikik. Kik.*\n\nThe awakened guardian made a sound like laughter and shot past the pavranium. Grid didn't freeze. He raised <span class=\"rarity-unique\">Dainsleif</span> to block the kick flying toward his abdomen.\n\n*Chaaeng!*\n\n> [The durability of <span class=\"rarity-unique\">+5 Dainsleif (Reproduction)</span> has been reduced by 46.]\n\n*What?*\n\nBefore the transformation, <span class=\"rarity-unique\">Dainsleif</span>'s durability had dropped by thirty-seven when blocking the guardian's attack. Now it dropped by forty-six. A twenty percent increase. Numerically, that meant the guardian's attack power had increased by twenty percent.\n\n*What is this?*\n\nGrid stared at the strengthened guardian, then noticed the darkness surrounding him. Night had fallen. He recalled part of the description for <span class=\"rarity-legendary\">Failure</span>.\n\n*Attack power increases by twenty percent in dark places.*\n\n*Blue orichalcum becomes stronger in the dark.*\n\nGrid's jaw clenched. \"...Should've come in the morning.\"\n\nAfter entering the Grey Forest in the afternoon, he had wasted time hunting monsters. The poison flowers, the goblin lord. All of it had cost him.\n\n*Chaaeng! Chaaeng!*\n\n\"Damn it!\"\n\nGrid vowed that next time he would arrive in the morning. He blocked the awakened guardian's onslaught. <span class=\"rarity-unique\">Dainsleif</span> boasted a maximum durability of five hundred. Under the continuous assault, cracks began to spread across the blade.\n\nDuring that time, the pavranium recovered and resumed protecting Grid. But the guardian had already learned how to disable them. It fired the blue flash at the pavranium again.\n\n\"Damn! Damn!\"\n\nGrid's true personality started to surface under the confusion and agitation. He lost his cool. The awakened guardian stretched its limbs, as if mocking him. *Kik.* That strange noise again, like laughter.\n\nAn obvious provocation.\n\n\"You dog bastard!\"\n\nGrid was about to completely lose control of his reasoning.\n\n> [The effect of the Composure stat is activated.]\n\nHis four hundred points in **Composure** kicked in. Grid's mind cleared instantly. A greatsword user focused on attacks that leveraged weight to deal damage.\n\n*Peeeeok!*\n\nGrid didn't block the incoming fist.\n\n> [You have suffered 7,300 damage.]\n\nThe instant after the hit landed, Grid roared. \"Ohhhhhh!\"\n\nHe swung his greatsword with his full strength.\n\n*Kwaang!*\n\n> [Critical!]\n> [You have dealt 7,700 damage to the target.]\n\n*Peeok!*\n\n> [You have suffered 7,250 damage.]\n\nAnother hit.\n\n> [You have dealt 3,900 damage to the target.]\n\nHe hit back.\n\nGrid grinned savagely. \"Yes, let's see who dies first!\"\n\nGrid had always been terrible at evasion and control. His combat method was simple. Get hit. Hit back. Drink potions. Hit again.\n\n> [You have suffered 7,140 damage.]\n> [You have dealt 3,920 damage to the target.]\n> [You have taken a high-grade health potion. 8,000 health will be restored.]\n> [You have suffered 7,300 damage.]\n> [Critical!]\n> [You have dealt 7,810 damage to the target.]\n> [You have been hit by a lethal blow!]\n> [You have suffered 15,600 damage.]\n\nHit. Be hit. Drink potion.\n\nThen, at that critical moment:\n\n> [The effect of <span class=\"rarity-unique\">Doran's Ring</span> has been activated.]\n> [The option of <span class=\"rarity-legendary\">Holy Light Armor</span> has been activated.]\n> [23,400 health has been restored.]\n\nThe power of his items revealed itself.\n\n*Kkik?*\n\nThe awakened guardian panicked. The longer it fought the intruder, the weaker it became, while the intruder seemed unchanged.\n\n*Buuong.*\n\nThe guardian grew cautious. It was disadvantaged every time it took damage. It avoided the massive greatsword and tried to counterattack when Grid's back was exposed. Then it froze in surprise. Grid had been moving in one direction, but he suddenly pivoted toward the opposite side.\n\n*Chaaeng!*\n\nThe guardian flinched as the blade slammed into its waist.\n\n*Tong!* Grid's right foot left the ground. He used the momentum to wrench <span class=\"rarity-unique\">Dainsleif</span> upward, tearing it free from the awakened guardian's waist.\n\n*Kwajak!*\n\nThe awakened guardian's body was thrown into the air. Unlike the past, Grid now possessed a modicum of control.\n\n\"Pagma's Swordsmanship...!\"\n\nHe prepared to deliver the final blow while the guardian hung defenseless in the air.\n\n*Kiyaaaaaah!*\n\nThe guardian's survival instincts ignited. It refused to die alone. The blue flash erupted from its mouth, aimed directly at Grid.\n\n\"Kill!\"\n\n*Peeeeeong!*\n\nThe greatsword shattered the awakened guardian's head.\n\n*Puoook!*\n\nThe blue flash pierced Grid's heart.\n\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\nGrid lived.\n\nThe awakened guardian's head exploded and dissolved into grey light. Blue orichalcum ore scattered across the ground, gleaming more beautifully than any jewel under the moonlight.\n\n> [Under two full moons, you have defeated the Awakened Guardian of the Forest!]\n> [14 pieces of blue orichalcum have been acquired.]\n> [3 pieces of purple orichalcum have been acquired.]\n> [The <span class=\"rarity-epic\">Amethyst Shield</span> has been acquired.]\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level has risen.]\n> [Your level...]\n> [You have reached level 200!]\n> [Your stats have awakened and the unique features of all stats will improve.]\n\nGrid stared at the notifications. \"...Damn it.\"\n\n*Flop!*\n\nThe joy of gaining levels and items lasted only a heartbeat. Grid collapsed without hesitation. Then he sprawled on the ground, lamenting. The enemy had been so strong that he had focused entirely on the battle and forgotten about the pickaxe. A matter of enormous regret.\n\n---\n\n**Glossary of Common Korean Terms.**\nOG: Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}