{
  "id": 145,
  "title": "Chapter 145",
  "content": "# Chapter 145\n\nGrid pulled up his inventory, fingers trembling as he examined the loot from the awakened guardian.\n\n> **[Blue Orichalcum]**\n> \n> A mineral born from moonlight and the Guardian of the Forest's essence. Impervious to the Guardian's magic, it possesses unmatched hardness and tensile strength among known minerals.\n> \n> Lightweight. Defensive properties amplify in darkness.\n> \n> *Requires Advanced Blacksmith Mastery to smelt.*\n> \n> **Weight:** 3\n\n> **[Purple Orichalcum]**\n> \n> Obtainable only when the Guardian awakens beneath twin full moons.\n> \n> Channels unique magic that enhances attack power and spell potency. Structurally fragile compared to blue orichalcum.\n> \n> Unsuitable for armor or weapons. Ideal for accessory crafting.\n> \n> *Requires Master-level Blacksmith skill to smelt.*\n> \n> **Weight:** 1\n\n> **[<span class=\"rarity-epic\">Amethyst Shield</span>]**\n> \n> **Rating:** Epic  \n> **Durability:** 200/200  \n> **Defense:** 200  \n> **Magic Resistance:** 200\n> \n> A shield that shifts between purple, crimson, and obsidian depending on the viewing angle. Symbolic regalia awarded exclusively to the Captain of the Red Knights.\n> \n> Lost three years ago when Piaro—framed as a traitor by Asmophel—fled to the Eternal Kingdom.\n> \n> The Third Prince of the Saharan Empire seeks this shield.\n> \n> **User Restriction:** Red Knights Captain  \n> **Weight:** 350\n> \n> *[No hidden functions detected.]*\n\nGrid's jaw clenched. *Fourteen. Exactly fourteen blue orichalcum.*\n\nHis hands balled into fists. Failure required fifteen pieces. Fifteen. Someone, something in this goddamn game was mocking him.\n\n*One short. One fucking piece short.*\n\nHis breath came faster. *Would've been better to get five or six. Not fourteen. Not one away from what I need.*\n\nHe pressed his palm against his forehead. If he hadn't sweet-talked Administrator Valdi months ago, if he hadn't squeezed three pieces out of that transaction...\n\n*I'd be screwed. Completely screwed.*\n\n\"It's a miracle,\" he muttered, then louder, forcing his voice steady. \"An enormous miracle.\"\n\nHe switched to the purple orichalcum before his anxiety spiraled further.\n\nAccessories. He had two: Doran's Ring—proven, reliable, lifesaving. The other...\n\n> **[Ring of Pledge]**\n> \n> **Rating:** <span class=\"rarity-unique\">Unique</span>\n> \n> A token of eternal love.\n> \n> Grants the **Happy** status when near your spouse: **+8%** Movement Speed, **+30** to all stats.\n> \n> *Status varies by spouse's affection level: Happy, Joyful, Content, Neutral, Displeased, Depressed, Resentful.*\n> \n> Spending an intimate night with your spouse while wearing this ring increases **all skill experience by 10%**.  \n> *Intimate encounters available once per month.*\n> \n> While worn, affinity gains with NPCs of the opposite sex (excluding spouse) are severely reduced.\n> \n> If your spouse catches you not wearing this ring, **affinity drops by 90%** and pregnancy chance decreases dramatically.\n> \n> **Weight:** 0.1\n\nGrid stared at the description. The benefits only worked around Irene. The skill boost capped at once monthly. Worse, it actively sabotaged building relationships with female NPCs.\n\n*I don't need to wear this. Not constantly.*\n\nBut his hand moved to the ring, confirming its presence.\n\n*Then again...*\n\nIf Irene discovered him without it, her affection would plummet ninety percent. He wasn't lucky. Even with his recent fortune, one unlucky moment...\n\n*Best not risk it.*\n\nThe pregnancy mechanic caught his attention. Satisfy simulated that far?\n\n*Raising a kid. Teaching them. Discovering talents.* The concept held appeal.\n\nThen reality reasserted itself. Over a decade to raise one child. With the gender ratio in Satisfy skewing so heavily male, the \"second generation system\" seemed more gimmick than feature.\n\n\"Necklace.\" He nodded to himself. \"Purple orichalcum necklace.\"\n\nMultiple rings were possible. Only one necklace. The math was simple. Necklaces carried better stats.\n\n\"I'll need a jeweler.\" Khan would know someone reputable.\n\nHis gaze shifted to the Amethyst Shield.\n\nThe quest item. His pulse quickened again.\n\nPiaro's words from Kesan Canyon echoed in his memory. *Asmophel. The betrayer. The man who framed me.*\n\nAsmophel served in the Saharan Empire.\n\n*Someday,* Grid told himself. *When I deliver this shield to the Third Prince, I'll settle that score for Piaro.*\n\nThe Empire was half a continent away. Not an immediate problem.\n\nHe tucked the shield into a remote corner of his inventory, then looked up as footsteps approached.\n\n\"You okay?\" Romeo's voice cracked with worry.\n\nThe soldiers clustered behind him, eyes wide. They'd watched Grid take the awakened guardian's final flash attack head-on. None had expected him to survive.\n\nGrid waved dismissively. \"I told you. The gods blessed me. I don't die that easily.\"\n\nHe gripped Romeo's shoulder, his expression darkening. \"Deck, though... Damn shame. I'm sorry. Should've protected him better.\"\n\nThe words tasted sincere. Khan had taught him blacksmiths were people. Irene had shown him NPCs bled the same as users. Deck had been young, talented, promising. Now he was data fragments scattered across some server.\n\nRomeo's eyes glistened. \"He saved half a dozen men on the march here. We won't forget.\"\n\nThe soldiers bowed their heads in silent agreement.\n\nA screech split the night sky.\n\n\"The hell—?\"\n\n\"Gargoyle?!\"\n\nMassive wings beat against the darkness. Grid squinted upward. The silhouette was too large, too heavy for a gargoyle. Moonlight painted scales the color of dried blood.\n\n*Drake.*\n\nFour meters of apex predator. Rare beyond measure. A wyvern looked like a pigeon next to this thing. Griffons and gargoyles? Prey species.\n\nThe drake descended, and Grid's jaw actually dropped.\n\n\"My Liege.\" The rider dismounted with a theatrical flourish. \"Have you been well in the meantime?\"\n\n\"Huroi.\" Grid's surprise lasted exactly two seconds. Then his eyes narrowed, analyzing. *Combat power: 10,000. Two thousand more than Romeo.*\n\nLevel 200-plus. As an orator. A non-combat class.\n\n*The second class really transformed him.*\n\n\"You've grown strong,\" Grid said.\n\nHuroi clasped his hands together. \"All thanks to My Liege's—\"\n\n\"Good. You can repay me by serving under me properly now.\"\n\n\"...Pardon?\"\n\nThey hadn't spoken in four, maybe five months game-time. Huroi had stories. The drake acquisition alone was an epic. He'd planned to share adventures, ask about Grid's marriage to nobility, reconnect like—\n\n\"Hunt frostlight orcs.\" Grid's tone brooked no argument. \"I need sylphid scales. Minimum twenty-eight.\"\n\n\"Why would I—\"\n\n\"Low drop rate, I know. Ten days should cover it if you're efficient.\"\n\nHuroi's mouth worked silently.\n\nOnly a hundred users worldwide controlled drakes. Peak aerial mobility. Devastating combat potential. And Grid wanted him to...\n\n\"Farm mobs. For crafting materials.\"\n\n\"The scales are for an invisibility cloak,\" Grid explained, as if this justified everything. \"Hooded Zip-Up. Needs twenty to craft. I tried grinding them myself before I got Pagma's Swordsmanship. Gave up after twelve.\"\n\nHe gestured at the drake like it was a mining pick.\n\n\"Now you're here. I'll make two: one for me, one to auction. We'll split the profit.\"\n\n*No,* Huroi thought. *You'll take seventy percent and call it generosity.*\n\nBut then the memories surfaced. Winston's dungeon. Two hundred hours of darkness and despair. Grid's hand extended through the bars, offering salvation.\n\nThe frostlight orc chief. Stunned, defenseless, skull about to cave in. Grid's body shielding him from the deathblow.\n\n*He saved me. Twice.*\n\n\"I'll leave immediately,\" Huroi said.\n\nA ranker couldn't afford ten days in one hunting ground. His leveling would stagnate. His ranking would slip. But debts were debts.\n\nHe turned toward the drake.\n\n\"Wait.\" Grid pointed at Romeo and the soldiers. \"Walk.\"\n\n\"...What?\"\n\n\"If you fly, they can't follow. Take them along. Train them while you hunt.\"\n\nHuroi stared. Ground travel would double the time investment. Babysitting soldiers would triple the tedium.\n\n\"You don't want to?\" Grid's voice dropped half an octave.\n\n\"...No, My Liege.\"\n\nThe descendants of the Blue Wolf honored their oaths. Huroi bowed stiffly, then trudged toward the soldiers.\n\nGrid watched them depart, humming tunelessly.\n\n*Perfect timing,* he thought. *I wanted those scales, but grinding them myself was idiotic. Too inefficient.*\n\nGuilt tugged at his conscience. Faint. Barely perceptible.\n\n*I'll craft him something nice later. Stop whining, conscience.*\n\nHe'd cleared his debt. Six hundred million won of crushing pressure, gone. The act had loosened something in his personality. Made him fractionally less selfish.\n\nFractionally.\n\n*First things first.* His body lifted off the ground, Braham's Boots humming with power. *Time to make Failure.*\n\nThe flight toward Khan's smithy was fast, though nowhere near drake-speed.\n\n* * *\n\nHours later, the Grey Forest stood silent.\n\nA figure materialized in the clearing where blood still stained the moss.\n\n\"Impossible.\" The man surveyed the destruction with narrowed eyes. \"The Tzedakah Guild couldn't drop an awakened guardian. Not this one.\"\n\nSomeone from the top five unified rankings had gotten here first.\n\n\"Wasted trip.\" He spat into the dirt. \"Four-month respawn timer. I can't camp this location indefinitely.\"\n\nThe ID above his head flickered in the moonlight as he vanished into shadow.\n\n**Agnus.**\n\n---\n\n**Glossary of Common Korean Terms:**  \nOG: Glossary Link\n\n**Current Schedule:** 20 chapters a week\n\n*Check out my Patreon for early access to unedited chapters and support goals for bonus releases. Early access updates after daily chapter completion.*"
}