{
  "id": 146,
  "title": "Chapter 146",
  "content": "# Chapter 146\n\nGrid had returned.\n\nThe news reached Jishuka within minutes. She abandoned her post at Winston Castle and made straight for Khan's smithy, her boots kicking up dust as she crossed the cobblestone streets.\n\n*He must be furious.*\n\nShe pictured Grid seething over his failure against the Awakened Guardian. The man never checked the guild chat. Never coordinated. Just charged headfirst into situations he knew nothing about.\n\n*Perfect opportunity to teach him a lesson about communication.*\n\nShe pushed open the smithy door, ready to deliver a lecture about teamwork and basic guild etiquette.\n\n\"Jishuka?\" Grid looked up from organizing materials, his expression bright. \"Why are you here?\"\n\nShe froze. That was not the face of a man who'd just gotten his ass handed to him by a field boss.\n\n*Where's the frustration? The anger?*\n\n\"Did you do the Guardian of the Forest raid?\" she asked carefully.\n\n\"How did you know?\" Grid shrugged. \"Yeah, I did.\"\n\n\"...Were you successful?\"\n\n\"Of course.\" He said it like she'd asked if water was wet.\n\n*What? The guardian didn't awaken?*\n\n\"But why did the guardian awaken?\" Grid continued, scratching his head. \"I suffered because it was a bit too strong.\"\n\nThe words hit her like a slap.\n\n\"Huh?\"\n\n*He beat it. The Awakened Guardian of the Forest. With two knights and a hundred soldiers.*\n\nImpossible. It had to be a lie. Her fingers moved on autopilot, pulling up the guild information window. She navigated to Grid's profile.\n\nLevel 200.\n\nYesterday, he'd been 180. Twenty levels from a single raid. The confirmation stared back at her in glowing numbers.\n\n*It's outrageous.*\n\nShe knew Pagma's Descendant was broken. Legendary blacksmithing combined with combat power rivaling rare classes, plus the ability to equip anything regardless of restrictions. That alone defied game balance.\n\nBut this?\n\n*One Grid is worth more than our entire guild combined.*\n\nThe Tzedakah Guild couldn't defeat the awakened guardian with their current roster. She'd run the numbers. But Grid had done it alone.\n\nOf course, Jishuka didn't know the full picture. Pavranium blocked the guardian's attacks while Braham's Boots let Grid strike from the air, exploiting the boss's inability to defend airborne targets. Against the full might of the Tzedakah Guild, two pieces of pavranium wouldn't shield him from overlapping attacks. Even his five-second invulnerability wouldn't last against sustained assault from seventeen top rankers.\n\nThe guild's class diversity enabled tactical combinations Grid couldn't counter alone. But Jishuka didn't have these details. Her mind filled the gaps with assumptions.\n\n*This isn't a balance collapse. It's a goddamn bug.*\n\nWorry crept in. Yatan Church spies infested Bairan Village. Retaliation for the Malacus raid was inevitable. Could they really afford to waste Grid's combat potential on blacksmithing?\n\nShe wanted him. Needed his power on the frontlines.\n\n\"Grid, do you want to migrate to Bairan...\"\n\n\"Jishuka.\"\n\nThey spoke simultaneously. Grid didn't pause. He barreled forward, cutting her off.\n\n\"If there isn't anything special, can you go? I have work to do.\"\n\nSilence.\n\nGrid was the guild blacksmith. He owed them items. Production. Support. But he kept running off on personal ventures, ignoring his obligations. The urge to scream built in her throat.\n\nThen reality checked her.\n\n*I promised him freedom. No conditions when he joined. Push too hard and he'll leave.*\n\nShe adjusted her posture. Leaned forward slightly. Let her chest do the talking. Grid had always been vulnerable to this particular tactic.\n\n*Make him lose focus first.*\n\nThe expected reaction never came. Grid's eyes didn't waver. Didn't drop. Ever since he'd slept with Irene, breasts no longer held the same power over him.\n\n\"What? You aren't going?\"\n\n\"Eh? Y-Yes. I'm going.\" Heat flooded her face. Mortification burned through her as she clutched her arms across her chest and fled the smithy. \"Bah, what is this? Was he better as an idiot?\"\n\nTwo months ago, Grid had been stupid, stingy, and easy to manipulate. Now his entire personality had shifted. He was impossible to read. Impossible to control.\n\nIt hurt.\n\n\"Just because you've grown a little? Idiot!\"\n\nShe marched down the street and kicked a flower pot. Hard. It shattered against the wall.\n\nBad move.\n\nJishuka was famous. Beautiful. A celebrity. Acting out in public meant witnesses. Witnesses meant gossip. Within minutes, the internet exploded.\n\n*[Tzedakah's Guild Master Creating a Disturbance on the Street]*\n\n*[According to the Testimony of a Witness, a Man is Believed to Have Broken Her Heart]*\n\n*[(Column) Jishuka is Sexy Even When Angry! Let's Explore Her Charms!]*\n\n*[Jishuka's Love is the Martial Artist Regas?]*\n\n*[Jishuka Has Received a Hollywood Love Call...]*\n\nThe forums buzzed with speculation about one of Satisfy's two great beauties.\n\nGrid, meanwhile, remained oblivious. He stood inside Khan's smithy, annoyed at the wasted time. He crossed to the furnace and retrieved the hammer he'd used for months.\n\n> **[Unknown Blacksmith's Hammer]**  \n> Rating: <span class=\"rarity-epic\">Epic</span>  \n> Durability: 350/350 | Attack Power: 70~80  \n> Odds of Making a Rare Rated Item: +17%  \n> Odds of Making an Epic Rated Item: +7%  \n>  \n> A blacksmith's hammer made by a craftsman with great skills and potential, but his experience and reputation is somewhat lacking.  \n>  \n> This is a hammer produced by the craftsman himself, so it isn't suitable for other blacksmiths to use.  \n>  \n> Conditions of Use: Pagma's Descendant  \n> Weight: 80\n\n*This won't cut it.*\n\nSeventeen pieces of blue orichalcum sat in his inventory. One chance to forge Failure. He needed every advantage.\n\n*Failure is a supreme weapon. It has to be legendary.*\n\nThe production window confirmed his ambition.\n\n> **[Failure]**  \n> Rating: Unique ~ <span class=\"rarity-legendary\">Legendary</span>\n\nUnique rating guaranteed minimum performance. The weapon would be fraudulent regardless. But Grid's greed ran deeper than logic.\n\n*Legendary or nothing.*\n\nWhat separated legendary from unique? He'd crafted thousands of items. Always gave maximum effort. Never less than twenty hours per piece. Yet satisfactory results remained rare. Three legendary items total. The rest? Normal and rare rated garbage churned out like factory products.\n\n*I need better odds.*\n\nThe answer crystallized.\n\n*I need a legendary hammer.*\n\n\"Let's make a hammer.\"\n\nHe hadn't touched blacksmith tools for combat purposes in weeks. Now he returned to his roots.\n\n**Ttang! Ttang!**\n\nThe furnace roared to life. Grid's hammer fell in steady rhythm. Once begun, he didn't stop. Day bled into night, night into day. The heat and his obsessive focus transformed Khan's smithy into a pressure cooker ready to explode.\n\n\"There will be no guests.\"\n\nKhan locked the doors. Grid's concentration was absolute. Interruptions were unacceptable. The old blacksmith did everything he could to support the work.\n\nTime passed.\n\nFive hammers emerged. Normal, rare, epic, rare, rare. Each failure twisted the knife deeper. But Grid's mental fortitude had evolved. He pushed forward without breaking.\n\nDawn of the fifth day brought salvation.\n\n> **[Legendary Blacksmith's Hammer]**  \n> Rating: <span class=\"rarity-legendary\">Legendary</span>  \n> Durability: 550/550 | Attack Power: 130~150  \n> Odds of Making a Rare Rated Item: +30%  \n> Odds of Making an Epic Rated Item: +20%  \n> Odds of Making a Unique Rated Item: +8%  \n> Odds of Making a Legendary Rated Item: +1%  \n>  \n> * The amount of experience acquired for production related skills will increase.  \n>  \n> A blacksmith's hammer made by a craftsman with great skills and potential, and is accumulating his experience and reputation.  \n>  \n> This is a hammer produced by the craftsman himself, so it isn't suitable for other blacksmiths to use.  \n>  \n> Conditions of Use: Pagma's Descendant  \n> Weight: 50\n\n> [A legendary rated item was produced, so all stats have permanently risen by **+25** and reputation throughout the continent has risen by **+1,000**.]\n\nGrid's fourth legendary item. After the Sword of Self-transcendence, Divine Shield, and Thorn of Deep Grievance. He frowned instead of celebrating.\n\n\"It isn't much.\"\n\nThe disappointment was real. Twenty percent epic chance and eight percent unique chance were solid. Better than expected, even. But one percent legendary?\n\n*Will 1% actually help? No. Wait. This is better than I thought.*\n\nHe forced optimism. His historical legendary rate sat below 0.1%. Increasing that by a full percentage point represented massive improvement.\n\nOne in a hundred items would be legendary. Simple math. Compared to the thousands required before, this was a revolution.\n\n*Just odds, but infinitely better.*\n\nGrid moved immediately. Five days of work had sharpened his focus to a razor's edge.\n\n*Now.*\n\nHe gripped the Legendary Blacksmith's Hammer. Blue orichalcum went into the furnace.\n\n**Ttang! Ttang!**\n\nSkilled strikes shaped the mineral. Delicate. Precise. Deliberate.\n\n\"Ohh!\"\n\nKhan watched in awe. Under Grid's hammer, a blue shark took form on the anvil. The smithy's oppressive heat faded. For a moment, Khan saw the cool ocean. The shark moved. Writhed. Lived.\n\n*Unbelievable.*\n\nThe transparent shark-shaped greatsword transcended anything Khan had seen. More creative and practical than dwarven masterworks.\n\n**Ttang! Ttang!**\n\nGrid hammered through sunset. Through moonrise. Through the moon's descent.\n\n> [The Legendary Blacksmith's Patience skill has been activated. **Concentration**, **stamina** and **defense** will rise to the extreme for one hour.]\n\nDawn arrived again. Chickens crowed outside.\n\n> [The Legendary Blacksmith's Breath has increased the effectiveness of your production items]\n\nGrid allowed himself a rare, genuine smile.\n\n> **[Failure]**  \n> Rating: <span class=\"rarity-legendary\">Legendary</span>  \n> Durability: 1,090/1,090  \n> Attack Power: 1,040~2,166 | Defense: 80  \n>  \n> * **Agility +50**  \n> * There is a low probability of blocking the enemy's attacks.  \n> * There is a certain probability of activating the **'5 Joint Attacks'** skill.  \n> * There is a high probability of activating the **'Cutting'** skill.  \n> * The skill **'Bisect'** will be generated.  \n> * There will be a fear effect if the enemy is more than 20 levels lower than the user.  \n> * Attack power +20% in dark places.  \n>  \n> It's a weapon designed by a legendary blacksmith. It's a greatsword, but its cutting ability is excellent because of its unique shape. It resembles the predator of the sea, a shark, and gives fear to enemies. The small blades spiking from the sword will increase the defense.  \n>  \n> Blue orichalcum is used as a material. Its lightness means the attack speed doesn't fall. Due to the nature of the blue orichalcum, it becomes stronger in the dark.  \n>  \n> User Restriction: Level 300 or higher. More than 5,000 strength. Advanced Sword Mastery level 8 or higher.  \n> Weight: 550\n\n**Pachichik! Pachichik!**\n\nAlong the blade's lower edge, the name 'Grid' began to etch itself in flowing cursive. \n\nThe first item Grid had created as Pagma's Descendant was complete."
}