{
  "id": 148,
  "title": "Chapter 148",
  "content": "# Chapter 148: Sister Complex\n\nBy the end of February, spring vacation at Young Ladies High School was drawing to a close. Sehee had only a few days before her second year began, and she sat hunched over her desk, pen scratching across paper.\n\nHobbies? Travel? Dating? She had no interest in such frivolities. Her leisure consisted of morning jogs and evening yoga—activities she performed purely to maintain optimal study conditions, nothing more.\n\nSehee devoted herself entirely to academics. The reason was simple.\n\nHer brother, Youngwoo.\n\nHe possessed no talent for studying. He failed to stand out in any particular field. His only redeeming quality was patience, but even that had eroded during his university years as laziness took root. She'd hoped military service would straighten him out. Instead, he'd worsened. Rather than return to his studies, he'd fallen into a game called Satisfy and drowned himself in debt. Their parents had worried constantly, sighing as their son's future dimmed with each passing day.\n\n*I have to take care of him.*\n\nGrowing up watching her pitiful, useless brother had forced Sehee to mature early. By middle school, she'd made her decision. She would shoulder the burden of the entire family.\n\n*I'll study hard in his place. I'll succeed and become responsible for our parents and Youngwoo.*\n\nUnlike her brother, Sehee possessed talent. She was a stellar student at the prestigious Young Ladies High School, maintaining top grades nationally. Her goal was straightforward: graduate from the best university, secure an excellent job, earn a high salary, and support her parents and brother for life.\n\n*He can count on me.*\n\nShe continued studying with this mantra in mind. But recently, a problem had emerged.\n\nHer brother had changed.\n\nThat damned game—Satisfy, the very thing that had devoured his youth—had somehow made him economically self-sufficient. He'd cleared his debts. Not just his own, but their father's as well. Then he'd given their parents hundreds of millions of won as spending money.\n\nOne day, he'd told her something ridiculous. \"In one year, I'll buy a ten billion won building. We can rent it out, and our family will live comfortably for the rest of our lives.\"\n\nSehee had been proud of his transformation. Delighted, even. But worry followed close behind.\n\n*It's not a bluff...*\n\nHe could afford such extravagance. That was the problem. He'd immediately blown eight hundred million won on a foreign car. She knew the pattern well—nouveau riche who squandered their wealth through poor financial planning. What if her brother lost everything?\n\nAnd then there were the women.\n\n*If he flaunts that car...*\n\nPlenty of gold-diggers would swarm a man driving an eight-hundred-million-won vehicle. Her brother had zero dating experience. He'd be easy prey.\n\nShe sighed, setting down her pen. \"I'd feel better if I could watch him around the clock.\"\n\nSehee harbored an unusual obsession with her brother—years of feeling responsible for him had warped her sense of boundaries.\n\nA commotion outside drew her attention.\n\n*A celebrity?*\n\nMen, women, and children were making noise on the street. Sehee approached the window to investigate, then froze.\n\nHer bad feeling crystallized into reality.\n\n***\n\nThe Geumcheon-gu neighborhood of Seoul consisted of ordinary, working-class families. Lately, however, it had become anything but ordinary. An expensive foreign car had appeared in front of the Shin residence—the family who operated a modest vegetable store—and locals couldn't stop gawking.\n\n\"That's the 13 Series from Company B.\" An older man adjusted his glasses. \"Eight hundred million won.\"\n\n\"Unbelievable.\" His companion shook his head. \"Did Shin ahjussi sell that many cabbages? How'd he afford it?\"\n\n\"I heard it's the son driving it, not the old man.\"\n\n\"The one who wears sweatpants everywhere like he's unemployed? Where'd he get that kind of money?\"\n\n\"Lottery, probably.\"\n\n\"Makes sense. Paid off his debts and bought a car like that... definitely hit the jackpot.\"\n\n\"Even if I worked myself to death, I couldn't afford it. Life's unfair.\"\n\n\"I buy five lottery tickets every week and never win. Maybe I should try ten.\"\n\nIt was the weekend. Residents enjoying the spring weather continued their running commentary on Youngwoo's vehicle. Then another car turned onto the street.\n\nEyes widened.\n\nAn 8.5-meter limousine—pure white and gleaming like a wedding cake—rolled to a stop in front of the Shin house. The locals forgot about the 13 Series entirely.\n\nThe door opened.\n\nThree burly men emerged. Two surveyed the area with professional wariness while the third hurried to the rear door. He opened it with a slight bow.\n\nA woman stepped out.\n\nThe flowers lining the street seemed to wilt in her presence. The world itself appeared to fade, colors bleeding away until only she remained in sharp focus. Her beauty transcended the ordinary into something almost painful to witness.\n\n\"Wow...\"\n\n\"That woman—\"\n\nRecognition rippled through the crowd. Yura. The Jewel of South Korea.\n\nPandemonium erupted.\n\n\"Yura! I can't believe it's really you!\"\n\n\"Sign my shirt!\"\n\n\"A photo! Please!\"\n\n\"Marry me!\"\n\n\"I could die happy right now...\"\n\n\"She's even more beautiful in person. A goddess.\"\n\nPeople swarmed forward. The three bodyguards moved with practiced efficiency, creating a protective barrier with their bodies alone. Three men controlling dozens. Thanks to their skill, Yura reached the Shin family's gate unmolested.\n\nShe pressed the doorbell.\n\n\"Why is Yura at the Shin house?\"\n\n\"You don't think...\"\n\n\"The unemployed son? Does he have a relationship with Yura?\"\n\n\"Maybe he's a kept man! That's how he bought the car!\"\n\n\"No way. Yura would never look at someone that plain.\"\n\n\"Even on a deserted island, she'd ignore him.\"\n\n\"Then what's she doing here?\"\n\nThe gate swung open.\n\n\"What are you doing at my house?\"\n\nSehee's voice cut through the noise like a blade. The crowd fell silent.\n\n\"Wow... she's actually talking to Yura like that.\"\n\n\"Look at them together. Both so beautiful.\"\n\n\"Maybe they're friends? Beautiful people stick together.\"\n\n\"That makes sense.\"\n\nThe spectators were half-delirious, their thoughts scattered.\n\n*How annoying.*\n\nCameras were already appearing. Sehee felt the pressure of eyes and grabbed Yura's wrist, pulling her inside.\n\n\"Come in.\"\n\n\"Thank you.\"\n\nSehee locked the gate and turned. \"What's your purpose for coming here?\"\n\nYura glanced at the small garden with its blooming camellias. She smiled. \"I came to see Youngwoo.\"\n\nSilence.\n\nSehee didn't bother hiding her hostility. \"Why would someone like you need to meet my brother? How do you even know him? What's your relationship?\"\n\nYura possessed genius-level intelligence. That genius, however, did not extend to social relationships. She answered without recognizing the minefield beneath her feet.\n\n\"I met Youngwoo in Satisfy. We became friendly while playing lovers.\"\n\n\"Playing lovers?\"\n\n\"It was very short, but quite fun.\"\n\nSehee stopped hearing anything after that. One word echoed in her skull like a death knell.\n\n*Lovers.*\n\nHer brother had claimed he was working hard to make money. But he'd been flirting inside a game? She'd been studying herself half to death for his sake. She'd never even held a man's hand.\n\nHer expression crumbled. Tears welled in her eyes.\n\n***\n\nGrid stood in Khan's smithy, staring at the production method for Wave Armor.\n\n*I originally planned to enhance Failure and my armor, but...*\n\nHe knew his priorities. The raid against the Awakened Guardian had taught him a brutal lesson. His defense wasn't sufficient. Even legendary armor had failed to protect him adequately. He needed to leverage his class's enhancement bonus to strengthen his equipment.\n\n*I want to use these items as long as possible. Even if it costs a fortune, the risk is worth it. I'll need to buy every enhancement stone in the auction house.*\n\nBut first, he owed Vantner armor.\n\n\"Can't put it off any longer.\"\n\nBetween the quest, his marriage ceremony, and the Guardian raid, he'd delayed this commission for nearly two months. His conscience wouldn't tolerate further procrastination. He pulled up the Wave Armor recipe.\n\n*Good.*\n\nThe Wave Armor was genuinely excellent. The first option provided outstanding defensive utility.\n\n*Still less than the Holy Light Armor.*\n\nThe Holy Light set boasted superior base defense. It also reduced physical damage by 40% and magic damage by 50%. Considering the additional options and set bonuses, the Holy Light Armor outclassed Wave Armor several times over. However, Franz's restriction made it Grid's exclusive equipment.\n\n*For selling armor, Wave is better.*\n\nOnce he'd equipped his guild, he could mass-produce Wave Armor and sell it to rankers. The fact that he'd acquired the production method for free thrilled him.\n\nHe raised his hammer.\n\n**Ttang! Ttang!**\n\nThe sound rang light and clear. Grid worked with intense concentration, hammering with enthusiasm.\n\nApproximately three hours passed.\n\nVantner appeared. Grid sensed his presence but continued hammering without pause.\n\n\"Mister, didn't you say you were going to pray?\"\n\nVantner scratched his head sheepishly. \"I want to watch my armor being finished. Can I watch? Please?\"\n\nAfter nearly two months of waiting, his excitement had reached critical mass. Grid understood the anticipation.\n\n\"Fine. Stay quiet and sit over there.\"\n\n\"Thank you! I'll pray to every god that it's legendary.\"\n\nVantner dropped to his knees. He pressed his palms together and began praying in earnest. The sight reminded Grid of Cassus during the Divine Shield's creation.\n\n*The Vatican is stable, at least...*\n\nNo news of a new Pope. Good.\n\n*Wait, did I forget to seal Isabel's spear? What if she dies because of my negligence?*\n\nGuilt flickered through him.\n\n*Well, she'll come for it eventually.*\n\nGrid focused on his hammering again.\n\n**Ttang! Ttang!**\n\nThe tempered black iron and mithril steel plates gradually assembled themselves into armor. Vantner's excitement soared with each strike as he continued his fervent prayers.\n\n*Please! Please let it finish as legendary! I'm praying to every god in existence! Please, please, please!*\n\nHis prayer reached its crescendo when—\n\n\"Ah, my sister's calling.\"\n\nGrid's hammer stopped mid-swing.\n\n\"Huh? What?\"\n\nVantner blinked in confusion, unable to process this new development. Grid stored both the hammer and the half-finished armor in his inventory.\n\n\"Sorry. My sister's calling. I have to go.\"\n\nHis tone suggested urgency.\n\n\"...?\"\n\nVantner doubted his ears. This had to be a joke.\n\nIt wasn't.\n\n> **[The guild member 'Grid' has closed his connection.]**\n\nGrid vanished.\n\nVantner stared at the furnace flames for a long, silent moment. Then he screamed.\n\n\"YOU BASTARD! YOU'RE DELIBERATELY TOYING WITH MEEE!\"\n\n\"You're too loud. Get out.\"\n\n\"Ugh... UWAAAACK!\"\n\nKhan kicked him out of the smithy. Vantner ran to the hunting grounds and took out his fury on monsters, each swing of his axes accompanied by thoughts of throttling Grid.\n\n---\n\n**Glossary of Common Korean Terms:** [Link]  \n**Current schedule:** 20 chapters per week.  \n**Patreon:** Early access available."
}