{
  "id": 149,
  "title": "Chapter 149",
  "content": "# Chapter 149\n\n\"Brother, get out here! Quickly!\"\n\nThe message jolted Youngwoo from his capsule. He stumbled out, blinking against the light. \"Sehee?\"\n\nHis sister had never interrupted him like this. Not since he'd started earning real money in Satisfy. *What could be so urgent?*\n\n*A robbery?*\n\nYoungwoo was, by nature, a coward. Horror movies affected him four times worse than normal people. He couldn't walk alone at night unless drunk. Eye contact with anyone remotely intimidating sent him into a panic. If a burglar broke in, his instinct was to flee, not fight.\n\nBut.\n\n*Things are different now.*\n\nHe'd survived enough suffering to change him. Success after success had built something in his chest. And for family? He'd always found courage for family.\n\nSnap.\n\nYoungwoo threw open the door. \"What bastard dares? I'll kill anyone who touches my sister!\"\n\nHe'd protect Sehee even if the intruder had a knife. Then he froze.\n\n\"Hello.\"\n\n\"...Eh?\"\n\nNot a robber. A familiar beauty sat inside his house.\n\n\"Don't you care about your sister at all?\" The beauty smiled.\n\nShe faced a flushed Sehee across the coffee table. Sehee looked happy but spoke with forced curtness. \"Brother, seriously? What did you imagine? Anyway, I'm not part of this. Can you not advertise yourself as a sis-con?\"\n\nSehee shot the beauty a winner's expression. *There's no room for you between siblings.* The beauty smiled back like Sehee was adorable.\n\n\"What...?\"\n\nYoungwoo rubbed his eyes. Once. Twice. He stared at the beautiful woman sitting across from his sister, trying to make sense of it.\n\n*Why is she in my house?*\n\nYura. South Korea's jewel. In this shabby apartment. It didn't seem real.\n\n*I don't know why she's here, but she's really pretty.*\n\nShe wore a pale yellow jacket over a V-neck shirt that revealed her collarbone. Good posture. Confident eyes. Delicate gestures. Clear pronunciation. The overall impression was nobility itself.\n\nTwo seconds. That's how long Youngwoo lost himself before snapping out of it. External factors might deceive him, but his feelings toward Yura weren't positive. He shook his head and moved to the sofa, settling next to Sehee.\n\n\"Why did you come to my house? By the way, don't you know too much about me? Are you a stalker?\"\n\nYura's eyes narrowed.\n\n*He's changed.* The Shin Youngwoo she'd met before the alumni reunion would have shrunk from her presence. He'd acted like a sinner, unable to meet her eyes. Now he was different. Dignified instead of cowering. Gazing straight at her.\n\n\"You look like a completely different person.\"\n\n\"I hope you mean it positively.\"\n\nEven his speech had changed. Yura smiled. \"I like you better this way.\"\n\n*She likes it?*\n\nYura was one of Earth's most beautiful women. Powerful. Successful. Such a woman saying she liked him sparked involuntary joy.\n\n*The glory of my family... No, no. It's not good to be in the heart of such a strange woman.*\n\nYura had stalker tendencies. Youngwoo replied as coldly as possible. \"I don't want to be in your heart.\"\n\nYura didn't flinch. She studied his whole body.\n\n\"You've gained weight. It's really good compared to before. Your skeleton is excellent, so you look nice now.\"\n\nTrue enough. During his debt-ridden days, he couldn't enjoy full meals. Playing games all day, skipping meals, no exercise. He'd been underweight. But wealth changed that. He ate delicious foods now. Enjoyed them like a gourmet. The desire to live long and enjoy his riches motivated morning jogs with Sehee. Before he knew it, he'd reached normal weight.\n\nCompared to his previous appearance, he was slightly above average now. A huge development.\n\n\"I feel like I can depend on you now.\"\n\n\"What?\" Youngwoo's face heated. \"What is it? Tell me clearly. Why did you come to someone else's house? I don't like this situation. Cut to the chase.\"\n\n*Well done, Brother!*\n\nSehee watched the exchange with delight. Unbelievably, Yura seemed one-sidedly interested in her brother. Meanwhile, her brother treated Yura with indifference. Why was a woman the world admired obsessed with him? And why was he so dismissive?\n\nSehee couldn't believe it, but she enjoyed watching. \"I'll prepare tea.\"\n\nHer brother was brushing off a beautiful woman. Sehee found it hilarious as she headed to the kitchen.\n\nYura finally got to the point. \"I'd like you to participate in the National Competition as South Korea's representative.\"\n\n\"Eh?\"\n\nYoungwoo's subtle reaction earned an explanation.\n\n\"This is an unofficial offer from the South Korean government. They want me to organize a national team for the upcoming competition. May first. Four days. They want South Korea to achieve a good score.\"\n\nYura was top five in Satisfy's rankings. A global star. A government connection made sense.\n\n\"I understand the situation, but why me? Aren't you overestimating me?\"\n\n\"I'm convinced you have the first hidden Epic class.\"\n\nThe second Epic class belonged to Agnus. The third to Katz. Only the first remained unrevealed. Youngwoo knew the first Epic was Euphemina's Duplicator, but Yura didn't. He'd survived her strongest magic before, leading to this misunderstanding.\n\n\"As you know, South Korea was a gaming powerhouse decades ago. Most competitions saw Korean professional gamers and teams win championships. Rankers in all RPG games were Korean. But that's just past glory now. Koreans aren't doing well, especially in Satisfy.\"\n\n\"I read about it before. Koreans don't have a physical presence?\"\n\n\"Exactly. It's a problem facing all Asians generally.\"\n\nSehee misunderstood the conversation from the kitchen and emerged quietly, sitting where she wouldn't interfere. Yura thanked her for the tea and continued.\n\n\"The South Korean government wants to reclaim some past glory through this competition. Right now, the gaming industry is competitive. They want to revive our competitive gaming power. Build the image of a country strong in Satisfy.\"\n\n\"They want a good showing in the National Competition?\"\n\n\"Yes, but it's extremely difficult.\"\n\n\"Why? Aren't you fifth on the unified rankings? One person can participate in three events. Can't you compete in three and earn three gold medals?\"\n\nThis was the first National Competition. Only eight countries participating. Three gold medals would be enough for top rankings. Youngwoo thought it simple, but reality wasn't so clear.\n\n\"Seven people are stronger than me in PvP. Boss raid and labyrinth breakthrough aren't my specialties. Production competitions are for production classes only, so those are out.\"\n\n\"...\"\n\n\"The pet marathon will be between drakes, but no Korean user owns one. We have to give up on that. The remaining events are siege, target processing, sword drawing, and treasure hunt. Among them, the only one where I can win gold is target processing. Siege is also my specialty, but the Korean team is too weak for a medal.\"\n\nYoungwoo, who'd been listening quietly, asked a question. \"Don't you seem kind of useless?\"\n\n\"...\"\n\nYoungwoo casually stabbed a sore spot. Yura's eyebrows twitched before her face settled into a frown. Youngwoo continued without caring.\n\n\"Is this true? Why are seven people stronger than you? Aren't you fifth on the unified rankings? Shouldn't only four people be stronger? Plus, you're the Eighth Servant. You should have special powers. I thought you were strong enough to be one of Satisfy's three pillars.\"\n\nYura recovered her composure and explained.\n\n\"I did obtain the Eighth Servant status. By sacrificing my Divine Power stat to God Yatan, I acquired new dark spells. My combat abilities rose dramatically. But the world is huge. Rankings aren't the only measure of strength. In fact, you aren't a ranker. Given the number of unlisted rankers like you, there are probably at least ten people stronger than me.\"\n\n\"Hrmm. Who are the people stronger than you right now?\"\n\nYura listed them without hesitation. \"First ranked Kraugel. Second ranked Zibal. Third ranked Chris. Seventh ranked Agnus. Eighth ranked Hurent. Eleventh ranked Bondre. Fifteenth ranked Hao. That's it.\"\n\n\"I know Agnus has an Epic class, but the eighth, eleventh, and fifteenth ranked?\"\n\n\"Yes. Their levels are lower than mine. But they're monsters in combat. Though they're unimpressive compared to Kraugel.\"\n\n\"Is Kraugel that great?\"\n\n\"I've seen him hunt many times. He's beyond common sense. A person who draws maximum results with minimal movements at all times. His field of view is large. He accurately calculates damage, skill cooldowns, movement patterns. Counters everything. People call me a genius, but Kraugel has several times more talent for the game.\"\n\n\"Wow. Sounds amazing.\"\n\nHe said so, but Youngwoo thought differently. *So what if he's excellent at these things? It's nothing in front of the power of items.*\n\nThe truth of RPG games was items. As Youngwoo ridiculed Kraugel internally, Yura asked him politely.\n\n\"I need your strength as the first Epic class. Please participate in the National Competition and demonstrate your skills. The government promised high incentives for winning medals. It won't be bad for you.\"\n\nYoungwoo's ears perked at the word 'incentives.' He hesitated for a moment.\n\n*I want to participate... But it'll be annoying if it's revealed I have a Legendary class. Ah, perhaps?*\n\nYoungwoo asked Yura, who waited for an answer with serious posture. \"Is it possible to participate while hiding my ID?\"\n\n\"You can't. Your identity must be thoroughly proven to enter the competition.\"\n\nExpected. Youngwoo changed the question. \"What about the pet marathon? Can inanimate objects participate?\"\n\n\"Inanimate objects?\"\n\n\"An inanimate pet.\"\n\nPets were pets. Animals. Living creatures. But inanimate?\n\n\"An inanimate object isn't a pet.\"\n\n\"The inanimate objects have egos. They absolutely obey commands.\"\n\nInanimate objects with egos?\n\n\"Like golems made by great magicians?\"\n\n\"The concept is roughly like that.\"\n\n\"Roughly?\"\n\n\"Anyway, the pet marathon is basically a competition between drakes. They'll bite at each other until reaching the destination. My pet doesn't have the concept of stamina. It can tease other pets and win the marathon. I'll win the gold medal. The condition is that I don't appear before the public.\"\n\n\"Huh?\"\n\n\"Pretend my pet is your pet. Don't worry, I'll pilot it. Of course, all benefits you receive for the gold medal will be mine. Okay?\"\n\n\"I honestly don't care about credit. Do you have a pet equivalent to a high-grade golem with an ego?\"\n\n\"If you don't believe me, go home and connect to Satisfy. I'll show you.\"\n\n\"Okay. I'll connect and send you a whisper.\"\n\nYura stood. She told Sehee the tea was delicious and headed for the door. Youngwoo opened it out of courtesy. Yura gazed at him and gave belated news.\n\n\"There's something you should know. By now, Bairan Village should be ruined.\"\n\n\"What?\"\n\n\"Neberius, the Fourth Servant of the Yatan Church, determined Bairan Village's coordinates through spies. Using Mass Teleport, he led a large army, including the Fifth Servant Balak, to invade Bairan Village. The Tzedakah Guild is either already wiped out or on the brink of annihilation.\"\n\n\"...\"\n\nYura raised a finger and pointed it at Youngwoo's heart. \"Didn't I say I wouldn't kill you when war broke out between the Yatan Church and the Tzedakah Guild? This time I've paid off my debt.\"\n\n*It can't be.*\n\nYoungwoo checked the time. Forty minutes or so since he logged out from Satisfy. Two hours in-game.\n\n\"Did you time your visit with the Yatan invasion?\"\n\n\"Yes. You said you didn't care about getting caught up in the war. Isn't this good?\"\n\n\"I'm not sure.\"\n\nIt was annoying. His relationship with the Tzedakah Guild didn't require involvement in wars. Youngwoo was a blacksmith, not a soldier.\n\n\"Then I'm leaving now.\"\n\n\"Wait.\"\n\n\"What?\"\n\nYoungwoo stopped Yura before she could leave.\n\n\"The Fourth Servant. Does he have the ability to give God Yatan's blessing?\"\n\nYura shook her head. \"Only the First Servant can give God Yatan's blessing. Why? Do you have a quest?\"\n\n\"What if I do? Can you help?\"\n\n\"It's hard. I'm the Eighth Servant, but I haven't met the First Servant. And aren't you hostile to the Yatan Church in the first place?\"\n\n\"True. I understand.\"\n\nYura left. Youngwoo immediately returned to his capsule and logged into Satisfy.\n\n**{Shit! Kill, the killing doesn't end!}**\n\n**{Faker's group, we're facing Neberius. His magic will be sealed when we draw his attention.}**\n\n**{This is Toban. Balak is so strong I can't last much longer. Where's the support from Regas and Pon?}**\n\n**{The senior followers are focusing on Pon and Regas. I'm supporting with magic, but it seems hard for them to leave.}**\n\nAn uproar in the guild chat window. The situation was so dire that few people noticed Grid logging in.\n\n**{Ah... How rotten. Being Jishuka's protector is arduous. If only Grid made my armor... Damn.}**\n\nVantner. Grid smiled widely.\n\n\"You can play an active role if you have armor?\"\n\nCertainly, only Vantner's weapons were good. It wasn't just him. Not surprisingly, many of Satisfy's rankers were armed with items unsuitable for their level. A lack of top-quality items. Grid was one of the few people who could overcome this scarcity.\n\n\"I'll deliver the armor.\"\n\nGrid opened his inventory. He pulled out the **Legendary Blacksmith's Hammer** and the Wave Armor on the verge of completion. The guild had endured the enemy's ambush far longer than Yura predicted, but he still initiated quick and deliberate hammering.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \nCurrent schedule: 20 chapters a week.  \nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}