{
  "id": 15,
  "title": "Chapter 15",
  "content": "# Chapter 15\n\n---\n\n**Name:** Grid  \n**Level:** -3 (15/20)  \n**Class:** Pagma's Descendant\n\n* The probability of adding additional options when making items will increase.\n* The probability of item enhancement will increase.\n* All equipment items can be worn unconditionally. However, there is a penalty depending on the rating of the item.\n\n**Title:** One who Became a Legend\n\n* Abnormal conditions don't work well on you.\n* You won't die when health is at the minimum.\n* Easily acknowledged.\n\n**Health:** 34/34  \n**Mana:** 3/3\n\n**Strength:** 1 + 5  \n**Stamina:** 1  \n**Agility:** 1  \n**Intelligence:** 1  \n**Dexterity:** 1  \n**Persistence:** 4  \n**Composure:** 1  \n**Indomitable:** 1  \n**Dignity:** 1  \n**Insight:** 1\n\n**Stat Points:** 0\n\n**Weight:** 3,075/200\n\n* The weight limit exceeds 200%, so movement speed is reduced by 100%.\n* The body is heavy and cannot exert any power properly.\n* The probability of receiving the 'weakened' state has become really high.\n\n---\n\nI stared at the numbers. *It'll take forever to climb the mountain at this pace.*\n\nDespite moving at full speed, I crept forward like something half-dead. The smart move would be dumping everything in a warehouse. But nothing in this world came free. Using the warehouse meant paying money I didn't have.\n\n*I can't waste gold on storage when I need every copper for a carriage.*\n\nIt wasn't just about money. Part of me hoped that enduring this miserable crawl would raise my persistence stat. The pain had to count for something.\n\n\"Fine. Let's go.\" I shuffled toward the mountain.\n\nThe smithy wasn't far from the base. A normal person could make the walk in thirty minutes. But my movement speed had tanked by a full 100%. One hour later, I finally dragged myself to the mountain's base.\n\n\"Hah...\" \n\nI was exhausted despite moving slower than everyone else. *How do turtles and slugs even survive?*\n\nThree hours of climbing later, I reached the midpoint.\n\n\"Pant... pant...\"\n\nThe path was well-maintained, the slope gentle. Yet here I was, barely clinging to consciousness as darkness fell around me. The mine entrance glowed ahead, a beacon that might as well have been on another continent.\n\n*Just a little further...*\n\nMy stamina bar blinked red. Empty. I swayed on my feet.\n\n*Damn it.*\n\nRest called to me like a siren. I shoved the desire down. One step. Another step. Each movement felt like wading through waist-deep mud while wearing waterlogged clothes. My legs trembled. I forced them forward.\n\nThe moment I staggered into the mine entrance, the notification appeared.\n\n> [Your persistence has risen.]\n\n\"Yes!\" \n\nLaughter burst from my chest. The fatigue vanished, replaced by a rush of pure satisfaction. Stats I couldn't raise through leveling, stats I had to earn through suffering, these felt like a drug. The high was incredible. *I'll never stop grinding stats. Never.*\n\nI collapsed just inside the entrance. After catching my breath, I pulled out bread and water. The food restored my stamina slowly, painfully.\n\n\"Right. Time to work.\" I retrieved the pickaxe. \"Appraisal.\"\n\nThe skill activated.\n\n---\n\n**[Smith's Pickaxe]**\n\n**Rating:** Normal  \n**Durability:** 19/19  \n**Attack Power:** 7~9\n\nA pickaxe used by the blacksmith, Smith. It was used by Smith to build up his skills.\n\nThanks to the strong durability, Smith collected 120 iron ore in a single day with this pickaxe. Since that day, the miners in this village have acknowledged Smith.\n\n**Weight:** 40\n\n> [A hidden function doesn't exist.]\n\n> [You have grasped the materials that make up Smith's Pickaxe, the production method, and the intentions of its creator.]\n\n> [Your understanding of Smith's Pickaxe is now at 100%. You can use Smith's Pickaxe perfectly.]\n\n> [You have learned how to make a pickaxe.]\n\n---\n\nMy eyes widened. *That old bastard mined 120 ores in one day?*\n\nThe quest wanted 80 iron ore. No time limit. I'd planned to take my time, spread it over multiple days. But Smith had pulled 120 in a single shift.\n\n*Fine. I'll get 200 in one day and make that geezer eat his words.*\n\nRed dots glittered across the mine walls, marking the ore veins. I hefted the pickaxe and moved toward the nearest one.\n\n\"Hey, newbie.\" \n\nA group of miners lounged against the wall. One of them sat up. \"Why are you holding a pickaxe? Don't tell me you're actually going to mine.\"\n\n\"I am.\"\n\n\"What? Puhahaha!\"\n\nThey erupted in laughter. One miner rolled on the ground, clutching his stomach. Another miner scowled. \"Cut it out. A newbie like you could swing all day and not get a single ore.\"\n\n\"You should be glad if you don't break your wrist,\" another added.\n\n\"We're saying this out of concern. Just go home, new-bie.\"\n\n*Laugh now, assholes.*\n\nI ignored them. Actions spoke louder than words.\n\n*Kaaang! Kaaang!*\n\n> [Iron ore has been acquired.]\n\nThree swings. Four at most. The ore popped free. The miners gaped.\n\n\"Wait, what? How did he...\"\n\n\"It's a fluke.\"\n\n*Kaaang! Kaaang!*\n\n> [Iron ore has been acquired.]\n\n\"Damn...\"\n\n\"How is that scrub doing it so easily?\"\n\n\"Idiots. It's the pickaxe. Has to be.\"\n\nOne miner approached, hand extended. \"That pickaxe. Let me try it.\"\n\nThey thought I was succeeding because of the tool. Perfect. I wanted to see their faces when they realized the pickaxe was ordinary. I handed it over.\n\n\"Watch closely.\" The miner hefted the pickaxe. \"I'll prove this thing is special.\"\n\n*Kakang! Kakakang! Kang! Kaaang! Kang!*\n\n\"Pant... pant... it's just a normal pickaxe...\"\n\nAfter a dozen swings, he'd managed one ore. The other miners shifted uncomfortably.\n\n\"So he's actually good at mining...\"\n\n\"Guess you can't judge by appearances. Anyway, shift's over. Let's head down.\"\n\nThey filed past me without a word. No apology. No acknowledgment. I didn't care.\n\nI started mining in earnest.\n\n> [Iron ore has been acquired.]\n\n\"This is easy.\"\n\nThe 100% understanding corrected my posture automatically. My hands knew exactly where to strike. At this rate, I could manage 200, maybe 300 ores. The confidence lasted about twenty minutes.\n\nThen exhaustion hit like a landslide.\n\n\"Pant... pant... this damn...\"\n\nBy the 26th ore, my breathing had turned ragged. My lower back spasmed. My arms burned. This level minus-3 body was screaming for rest.\n\nBut I couldn't stop. The need to level up consumed everything else. I straightened, adjusted my grip, and swung again.\n\n*Kaaang! Kakang!*\n\n\"Urgh...\"\n\nOre number 41. My wrists had gone numb. So had my lower back. Sweat soaked through my clothes, dripped into my eyes. My legs shook. But I kept swinging. I looked up, searching for sky, and saw only the suffocating stone ceiling.\n\n*I want to rest.*\n\nThe thought gnawed at me. But I wanted money more. Wanted to learn crafting. Wanted to escape this hellhole. My trembling hands raised the pickaxe.\n\n*Kakang! Kajajak!*\n\n\"Pant... pant... I'm dying...\"\n\nOre 59. My vision blurred. Every muscle in my body screamed for mercy. The pickaxe nearly slipped from my grasp. I forced down some bread and water. It barely helped.\n\nThis was my limit. I wanted to throw the pickaxe into the darkness and collapse. Instead, I tightened my grip until my knuckles turned white.\n\n\"I won't give up because of this! My whole life is labor! Grahhh!\"\n\n*Kakang! Kakang! Kakakang!*\n\nDebt had destroyed me. The game had destroyed me. I was a loser in reality. One day, a friend told me our high school classmates mocked me behind my back. The worst part was knowing that friend had joined in the mockery.\n\nMy army buddies? University friends? I'd lost touch with all of them. Except for one guy who'd contacted me four months ago. He was working for a pyramid scheme company, wanted to recruit me. The message was clear: he thought I was desperate enough to fall for it.\n\nI didn't bother defending myself. If I told them I was obsessed with a game, they'd pity me. That made it worse.\n\nI'd been too ashamed to attend the second reunion. But I'd gone to one alumni meeting on army leave because it was my only chance to see Ahyoung, my first love...\n\nNothing good came of it. After that, Satisfy had been my only refuge. The one place where reality couldn't touch me.\n\nBut now? Now Satisfy was just as brutal as the real world. Even the NPCs looked down on me. But this wasn't reality. I could change things here. I would level up. Earn money. Pay off my debts. Become a ranker. Get interviewed on TV like Katz.\n\nI was Pagma's Descendant! Epic classes that amazed two billion users? They were garbage compared to a Legendary class.\n\n\"I'll show the whole world!\"\n\n*Kaaang!*\n\n> [Iron ore has been acquired.]\n\n\"I'll succeed.\"\n\nEvery day in reality, I did backbreaking labor because of debt. When I escaped this, I'd throw it in everyone's faces. All the people who ignored me, who mocked me. *You weren't so great either, assholes.*\n\nMy pickaxe moved again. My persistence stat climbed steadily. As I grew more familiar with the technique, the durability decreased more slowly. Before I knew it, bright morning sun streamed through the entrance.\n\nThe miners arriving for their shift froze.\n\n\"Did that guy work all night?\"\n\n\"He doesn't look it, but his stamina is insane. And his mental state? How is he still functional? What a monster.\"\n\n\"Wait, look at the amount of ore! Did he break Smith's record?\"\n\n\"No way he broke Smith's record. I'll admit he's doing well, but... hold on. Has his mining skill improved overnight?\"\n\nThroughout the day, I teetered on the edge of collapse multiple times. I almost died from exhaustion. But I pushed through. By lunch, I'd gathered 170 iron ore.\n\nLess than my target of 200. But my water had run out. I couldn't continue.\n\n*Stagger. Stagger.*\n\nI stumbled toward the exit. The miners stared.\n\n\"You're... incredible. I apologize for yesterday. For ignoring you. Please forgive my rudeness.\"\n\n\"You'll be a great miner someday! No, with that spirit, you'll succeed at anything!\"\n\nThe same miners who'd mocked me yesterday now showed respect. Being acknowledged, even by NPCs, was an experience I'd rarely had in my life. Pride swelled in my chest.\n\nI descended the mountain with lighter steps. My persistence had reached **16** points overnight. My stamina had increased too. The descent didn't tire me.\n\nI dragged the heavy sack of iron ore toward the smithy. The villagers' gazes had changed. The miners must have spread word of my achievement.\n\n\"Um, I'm sorry about yesterday, Mister Miner.\"\n\nThe kid from yesterday bowed deeply. His father smiled at me.\n\nMy level was still negative. But overnight, everyone's attitude had reversed. The 'easily acknowledged' trait from my title must have kicked in.\n\n*This feels good...*\n\nFor a moment, Satisfy felt like a haven again instead of a second hell. I smiled and patted the boy's head. Then I continued to the smithy.\n\nSmith's eyes widened when I handed him the sack containing 170 iron ore.\n\n\"So? Can you still call me a newbie?\" I smirked.\n\n\"Haha...\" Smith examined the ore carefully. He shook his head, expression stunned. \"No. You're exceptional. You have remarkable talent and will overcome any hardship.\"\n\nHe extended his hand.\n\n\"A blacksmith like you... every craftsman on this continent will rejoice. Thank you for giving me the honor of teaching you.\"\n\nI shook his hand.\n\nSmith's smile was warm. \"You've exceeded my expectations. You even broke my mining record, which stood for years. I'll double the promised reward.\"\n\n> [You have completed the quest 'Mine Iron Ore'!]\n\n> [Reputation in Bairan Village has increased by 200.]\n\n> [Affinity with Smith has risen to 60.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [You are now level 1. Your stats, which were fixed to a minimum due to the minus level penalty, have been restored to their normal state.]\n\n> [The basic stats of Pagma's Descendant have been applied.]\n\nFinally.\n\n\"This is the start.\""
}