{
  "id": 150,
  "title": "Chapter 150",
  "content": "# Chapter 150\n\nBairan Village sat at a crossroads—close enough to level 100-200 hunting grounds to attract a steady trickle of users, yet too small and too overshadowed by the nearby metropolis of Winston to inspire anyone to call it home. The population hovered around five hundred souls, NPCs and users combined, struggling to grow.\n\nThen Grid married Lady Irene.\n\nThe wedding shifted everything. Within a week, the trickle became a flood. Five thousand residents now packed streets that had been dirt paths a month ago. The Tzedakah Guild threw gold at the problem, hiring northern craftsmen and specialists to raise buildings and infrastructure at breakneck speed.\n\nTwo travelers stood at the village entrance, mouths slightly open.\n\n\"This place has changed.\" The first user, a swordsman in worn leather, gestured at the skyline. \"Last month, there were maybe a dozen hovels. Now look at it.\"\n\nHis companion, a mage, nodded slowly. \"Those are proper buildings. Stone foundations, multiple stories...\" She trailed off as a crew of workmen hauled timber past them, shouting measurements to each other.\n\nHundreds of laborers swarmed the construction sites. Hammers rang against nails. Saws bit into fresh wood. The village sprawled outward with each passing hour.\n\nThe swordsman whistled. \"At this rate, they'll be calling it Bairan City by summer.\"\n\n\"And the security's solid,\" the mage added. \"Tzedakah Guild runs a tight operation.\"\n\n\"Who'd be stupid enough to mess with them anyway?\" The swordsman snorted. \"Best guild estate I've ever seen. They'll be drowning in tax revenue once this place is finished.\"\n\n\"All because Lady Irene got married.\" The mage shook her head. \"Perfect timing for them.\"\n\n\"Who'd she marry, anyway?\"\n\n\"Some noble, probably. Does it matter?\"\n\nThey moved into the crowd. Even with half the users out hunting, two thousand people filled the streets—a chaotic mix of merchants hawking wares, adventurers comparing equipment, and residents going about their daily business.\n\nThen a magician near the central square froze mid-step.\n\n\"Wait.\" She lifted her head, eyes widening. \"Do you feel that?\"\n\nHer party member, another caster, followed her gaze upward. \"Magic power. Massive magic power.\"\n\nThe tallest spire of Bairan Castle pierced the sky at the village's heart. At its peak, energy gathered—a pinprick of light at first, then expanding like a unfurling flower. The air itself seemed to vibrate.\n\nA low-level warrior squinted at the phenomenon. \"What is that?\"\n\n\"Teleportation magic,\" the first magician breathed. \"Mass teleportation.\"\n\nSomeone nearby laughed. \"Isn't that third advancement stuff? Man, what kind of event is this?\"\n\n\"Event! It's gotta be an event!\"\n\n\"For the National Competition, maybe?\"\n\nExcitement rippled through the crowd. Users pointed at the sky, pulling out recording crystals to capture the moment. The magic circle expanded, brilliant white against the afternoon sun, and then—\n\n*Crack.*\n\nHundreds of light beams erupted from the circle, screaming downward like artillery fire.\n\nCheers turned to screams.\n\n> [Warning: You are under attack!]\n\n\"**Infidels! Receive God Yatan's judgment!**\"\n\nThe beams struck earth. Where light touched ground, figures emerged—men and women in dark robes, their faces twisted with zealous fury. Black magic poured from their hands before their feet even found purchase.\n\n\"**Witness the glory of God Yatan!**\"\n\n**BOOM. BOOM. BOOM.**\n\nExplosions tore through the streets. Poison fog billowed outward in noxious clouds, thick and choking. A building the Tzedakah Guild had just finished collapsed, its wooden frame dissolving into black sludge. The flowers lining the merchant's row withered and died in seconds, leaves curling into ash.\n\nFire erupted from a dozen points at once.\n\n\"No—help! Please!\"\n\nBlood sprayed across cobblestones as a Yatan believer's blade found an NPC merchant's throat. The man crumpled, gurgling.\n\nThe swordsman from earlier drew his weapon with shaking hands. \"What the fuck is happening?!\"\n\nOver a thousand Yatan followers materialized in Bairan's streets. The weakest among them was level 160. Two hundred wore robes of purple and red—elders, each one cresting level 200 or higher.\n\nBairan's residents? Average level 140. Half of them were non-combat NPCs.\n\n\"Don't engage!\" Someone was shouting from the walls. \"You'll just die! Fall back!\"\n\nBut there was nowhere to fall back to.\n\n\"**This is divine punishment!**\" A red-robed elder raised his staff. Dark lightning crackled at its tip, then lanced forward. It caught three users in mid-retreat, and they screamed as their bodies seized, health bars plummeting.\n\n\"Fuck this!\" A ranger stabbed at the air, bringing up his menu. \"I'm logging out!\"\n\n\"Me too!\"\n\nBut the system denied them. Those already engaged in combat found their escape greyed out, unavailable. Others vanished in swirls of light, abandoning the village to its fate.\n\nLess than three hundred users remained to face the horde.\n\n\"We're outnumbered!\" someone wailed.\n\n\"Outnumbered and outleveled!\"\n\nThe Yatan followers surged forward like a black tide. NPCs fell in droves—shopkeepers, craftsmen, children. Their death cries filled the air, mingling with the crackle of flame and the wet sounds of blades meeting flesh.\n\nThen a roar split the chaos.\n\n\"**Someone dares attack MY territory?!**\" \n\nToon landed in the center of the eastern square with enough force to crack the stones beneath his feet. The head of Bairan's security spat to one side—a habit that made Jishuka grimace every time—and bared his teeth at the invaders.\n\n\"Protect the civilians!\" He jabbed a finger at the knights and soldiers rallying behind him. \"All of you—evacuate the non-combatants! **Now!**\"\n\nThe guards scattered to their tasks. Toon didn't wait for confirmation. He crossed his arms, wristblades gleaming, and charged alone into a cluster of twenty Yatan believers.\n\n\"Get him!\"\n\n\"**King of the Beasts!**\"\n\nHis body twisted, bones cracking and reforming. Fur sprouted across expanding muscle. In half a second, where a man had stood, a massive lion prowled—easily twice the size of any natural predator. Its amber eyes locked onto the believers.\n\nThey barely had time to scream.\n\n**CRUNCH.**\n\nToon's paw caved in a believer's ribcage. The man flew backward, limbs flailing, and hit a wall hard enough to leave a crater. He burst into grey light before he hit the ground.\n\n\"Kyaaaaack!\"\n\nFangs closed around another cultist's skull. The sickening *pop* echoed across the square.\n\n\"Impossible—\" A third believer stumbled backward, eyes wide with terror.\n\nToon pounced. Claws raked across exposed throats. Bodies crumpled like puppets with cut strings.\n\n\"**Shackles of Darkness!**\"\n\nThe purple-robed elders responded, chanting in unison. Black chains materialized from nothingness, wrapping around the great lion's legs, neck, torso. Dozens of them, each one pulsing with cursed energy.\n\nToon snarled, muscles straining against the bindings. For a moment, he seemed trapped.\n\nThen his form shimmered.\n\n\"**Lord of Heaven!**\"\n\nThe lion compressed, shrinking into the shape of an eagle with obsidian feathers. The shackles, sized for a massive predator, went slack. Toon slipped free and shot into the sky.\n\n\"Where—\"\n\nHe dove. His beak, sharp as any spear, punched through the top of an elder's skull and erupted out the bottom of his jaw.\n\nEven as the elder's body began to dissolve, Toon transformed again—back to the lion, landing with a thunderous **BOOM** that rattled windows.\n\n\"**KUWEEEEEOH!**\"\n\nThe roar was physical force. Sound became weapon. Believers within ten meters clutched their ears, blood streaming from their canals. They dropped to their knees, weaponless, defenseless.\n\nToon's jaws found their necks one by one.\n\n\"Kuhahahaha!\" The lion's laughter was disturbingly human. \"Fighting is fun! Come on!\"\n\nFrom atop the northern wall, Laella watched the carnage with a mixture of awe and discomfort.\n\n\"Mister Toon...\" She shook her head, pink hair swaying. \"His personality is definitely strange. But those skills...\"\n\nShe couldn't finish the thought. A group of believers had broken away from the main force, circling toward the soldiers trying to rescue civilians trapped in a burning tavern.\n\nLaella's hand tightened around her orb—the Dark Magic Orb, still humming with power from the Malacus raid. She channeled magic through it, feeling the artifact amplify her strength threefold.\n\n\"**Wrath of the Red Witch.**\"\n\nThe spell erupted from her palm as a column of scarlet energy, wider than a man's torso. It carved a perfectly straight line through the battlefield.\n\n**FWOOOOSH.**\n\nWhere it touched, believers ignited. Not mere burns—their bodies turned to ash mid-scream, armor melting, flesh vaporizing. The pillar of magic burned for three full seconds, leaving a scorched trench in the earth.\n\nThe soldiers she'd saved gawked up at her.\n\n\"Thank you, Miss Laella!\"\n\nShe nodded, already gathering power for her next cast. *We can't let them overwhelm us. Keep the pressure on.*\n\nAt the eastern gate, Vantner skidded to a halt just in time to watch three users fall.\n\n\"Pathetic.\" He spat the word like a curse. The three men—a warrior, a ranger, and a mage—lay crumpled at the feet of a Yatan elder whose black robes were crusted with dried blood.\n\n\"**Go to hell,**\" the elder intoned, raising his hands for the finishing blow. \"**Become God Yatan's eternal servants!**\"\n\n\"Not today, you bastard.\"\n\nVantner's twin axes caught the elder mid-cast. The blades, empowered by the **Genuine Twin Bloody Axes**, bit deep into the man's torso. A hidden mechanism in the weapon shifted—weight redistributing, balance changing—and the second swing came faster than the elder could dodge.\n\n\"Keok—!\"\n\nThe elder split in half vertically, a perfect bisection. Grey light consumed his remains.\n\nThe three saved users scrambled to their feet, eyes shining with gratitude and awe.\n\n\"Thank you!\"\n\n\"The number one guardian knight! You saved us!\"\n\n\"I'm posting this on the forums—Vantner, you're as strong as they say!\"\n\n\"Hehe...\" Vantner scratched his bald head, a grin spreading across his face. After weeks of Grid treating him like a punching bag, the praise felt like cool water in a desert. \"It's not such a big deal, really. I just—huh?\"\n\nMovement on a rooftop caught his eye. Three stories up, Jishuka stood with her bow drawn, picking off believers with mechanical precision. But behind her, three figures in crimson robes were ascending the building's far side.\n\n*High-ranking believers.* The real threats.\n\n\"Shit—\"\n\nVantner moved. His heavy armor slowed him, but not enough to matter. He hit the building's base at a dead run, used a market stall as a springboard, and hauled himself up the wall with pure strength. His fingers found purchase on window ledges, decorative stonework, anything.\n\nHe crested the roof just as the lead elder raised a dagger toward Jishuka's unprotected back.\n\n**CLANG.**\n\nVantner's axe intercepted the blade, deflecting it wide. Jishuka spun, eyebrow raised.\n\n\"Took you long enough,\" she said, a smile playing at her lips.\n\nHer white teeth flashed against her tanned skin. Vantner gave her a thumbs up, planting himself between her and the elders.\n\n\"Leave these guys to me!\" He brandished both axes. \"You just keep killing!\"\n\n\"Okay~\"\n\n*Swish.*\n\nEven after seeing it a hundred times, Vantner couldn't help but be impressed. Jishuka's arrows moved like guided missiles. The first shot traveled a hundred meters, threading between two burning buildings and a panicking crowd to strike a believer who'd been about to execute a family huddled in an alley. The man dropped, an arrow through his eye socket.\n\nHer second shot—a single arrow—struck five mages on a distant rooftop who were chanting a group spell. The shaft pierced the first mage's throat, continued through the second's chest, and skewered the remaining three in a perfect line.\n\n\"Basics,\" Jishuka said, nocking another arrow.\n\nVantner laughed. \"Show-off.\"\n\nThen the three elders attacked as one.\n\nAcross the battlefield, five more high-ranking believers broke from the main force, eyes fixed on the walls where Laella and Zednos continued their magical bombardment.\n\n\"Magicians!\" one of them hissed. \"Kill the magicians!\"\n\nThey sprinted toward the wall's base, preparing spells to scale it.\n\nNone of them heard the footsteps behind them.\n\n\"You should always watch your back.\"\n\n\"—?!\"\n\nThe lead believer's eyes went wide. His hand flew to his throat, but it was already too late. Blood sprayed between his fingers as Faker's dagger withdrew, the blade barely making a sound.\n\nThe second elder spun, bringing up a defensive spell, but Faker was already gone—melted into shadow, reappearing behind the third cultist.\n\n\"Suddenly—? Keok!\"\n\n*Slash.*\n\nAnother throat opened. Another body fell.\n\nThe remaining three believers formed a defensive triangle, staffs raised, scanning frantically for their invisible assailant. \n\n\"Show yourself, coward!\"\n\nFaker's voice came from everywhere and nowhere. \"Next.\"\n\nAll three died within the span of two heartbeats—throats slit, major arteries severed. Faker stood amidst their dissolving corpses for only a moment before activating **Stealth** once more, his form blurring into nonexistence.\n\n*The others can handle themselves,* he thought, already seeking his next target.\n\nAt the northern gate, a different sort of battle was unfolding.\n\nIbellin moved through the smoke and chaos with quiet purpose. Unlike Toon's roaring fury or Vantner's blunt aggression, the boy-like swordsman hunted with surgical precision.\n\nHe found his targets in a burning mansion—four high-ranking elders cornering six users who'd taken shelter inside.\n\n\"This is bullshit!\" One of the trapped users, a mage, clutched a bleeding arm. \"I just got here! Why do I have to die like this?!\"\n\n\"All my experience...\" A ranger was nearly sobbing. \"Months of grinding, gone...\"\n\n\"Please.\" A third user, younger than the others, held up trembling hands. \"Please, we'll give you anything—\"\n\nIbellin accelerated. His boots hit the mansion's threshold, then a chair, using the momentum to vault over the cowering users and land between them and their executioners.\n\nHe drew **Thorn of Deep Grievance** in one smooth motion. The legendary flamberge caught the firelight, its blade writhing like a living thing.\n\nThe elders paused.\n\n\"You? Alone?\" One of them actually laughed.\n\nIbellin met his gaze. \"Overgeared No.2.\"\n\nIt was the nickname Vantner had given him—mockingly at first, but Ibellin had come to wear it with pride. If being 'overgeared' meant relying on powerful items, then so be it. He'd earned this weapon.\n\n*Shing.*\n\nThe flamberge moved. Its wave-like edge made the trajectory impossible to predict—what looked like a horizontal slash curved upward at the last instant, opening a gash along an elder's jaw.\n\n\"Tch.\" The elder jumped back, hand going to the wound. \"Barely a scratch—heok?\"\n\nBlood fountained from the cut. Not a trickle, not a steady flow, but a pressurized spray that painted the floor crimson.\n\n\"A magic sword!\" another elder shouted, retreating.\n\n\"Not quite.\" Ibellin advanced, his pretty features expressionless. \"Just cursed.\"\n\nHe struck again. **Thorn of Deep Grievance** sang through the air, its irregular shape creating impossible angles of attack. One elder tried to parry and found his guard irrelevant—the blade twisted around his staff and opened his forearm to the bone.\n\n*Puk. Slash.*\n\nBlood erupted like a fountain. The elder screamed, dropping his weapon to clutch the wound. Ibellin's return stroke took his head.\n\nThe remaining three believers scrambled backward, terror replacing confidence. They threw spells without aiming, desperate to create distance.\n\nIbellin walked through the magic as if it were rain. Minor burns, shallow cuts—nothing that would stop him. The flamberge rose and fell with metronomic consistency.\n\n*Slash. Stab. Slash.*\n\nScreams echoed through the burning mansion. When silence finally fell, six users stared at the blood-soaked boy who'd saved them.\n\nIbellin wiped his blade clean on a fallen elder's robe and sheathed it without a word.\n\n\"Let's go,\" he said quietly. \"This isn't over yet.\"\n\n---\n\nThe battle for Bairan had only just begun."
}