{
  "id": 151,
  "title": "Chapter 151",
  "content": "# Chapter 151\n\nThe inner sanctum of the castle.\n\nRegas yawned, his posture relaxed as he stretched behind the desk. Two weeks of self-imposed isolation to clear his workload, and the moment he looked up from his accounts, the alarm had sounded. An invasion. He'd dropped everything and run, adrenaline surging.\n\nNow he stood outside, scanning the battlefield.\n\n*No inspiration.*\n\n\"It's fine without me.\" The words came out flat. These Yatan believers weren't even worth warming up on. He turned toward the castle, ready to return to his paperwork, when something in his peripheral vision caught his attention. Two beams of light descended through the slowly closing teleport gate overhead.\n\nHis eyes sharpened. \"Are they strong?\"\n\nRegas bolted up the stairs, taking them three at a time. He vaulted onto the wall and squeezed between Laella and Zednos, who had been watching the battlefield while supporting the guild members below.\n\n\"Many people are suffering.\" Laella's voice trembled.\n\n\"Ah...\" Zednos went rigid.\n\n\"Huh?\" Regas glanced between them.\n\nLaella's shoulders were shaking. Not from fear. From the sheer density of magic power she was sensing.\n\n\"What is it?\"\n\nMagicians possessed the ability to detect magic power. Both Laella and Zednos had felt the danger before Regas could process it visually. They spoke in unison, voices hollow.\n\n\"Monster.\"\n\n\"A monster.\"\n\n**Kwaang!**\n\nTwo rays of light slammed into the center of the battlefield. The impact shook the walls. A notification window materialized in front of all users in Bairan Village.\n\n> [The Fourth Servant of the Yatan Church, Neberius has appeared.]\n>\n> [The sound of the flute that contains dark magic flows into your ears.]\n>\n> [There is a loss of balance and loss of concentration.]\n>\n> [Evasion rate has fallen to 0%. Accuracy has fallen by 60%. Magic casting speed is two times slower.]\n>\n> [These effects will last until the sound of the flute stops.]\n>\n> [The Fifth Servant of the Yatan Church, Balak has appeared.]\n>\n> [He is a demonkin who controls fire. If you enter within 1m of Balak, you will receive 500 fire damage per second.]\n>\n> [The flames of a demonkin are like God Yatan's breath. Yatan has blessed all believers, increasing the stats of the Yatan believers by 50%.]\n\nRegas exhaled slowly. \"Whoa.\"\n\nHis eyes gleamed with anticipation. *It is time to show the result of my training.*\n\nSeveral months ago, the Tzedakah Guild couldn't handle even one servant. That was the past. They'd grown faster than any other guild in Satisfy. Two enemies stronger than Malacus had just appeared simultaneously, but Regas felt no fear. His confidence burned bright.\n\nZednos, however, was already calculating the odds. The number one wind magician shook his head.\n\n\"We should give up on Bairan.\" His tone was clinical. \"It's better to go to Winston and borrow troops from Lady Irene to recapture it.\"\n\nThe grey-haired Neberius played his cursed flute, and Zednos could already see how the battle would unfold. The debuffs countered all physical attack classes as well as magicians. *There's no chance of winning.*\n\nLaella rounded on him. \"Recapture? Zednos, do you think they came to take over this place? No. They simply came to destroy. The moment we abandon this place, it will be turned to ashes. We can't back down. We must fight and win.\"\n\n\"It will waste money and time, but can't we restore the village at any time?\" Zednos gestured toward the chaos below. \"Isn't it better than dying and losing experience and items?\"\n\n\"Is that the only problem? If we lose, all the NPCs will die.\"\n\nThe weight of her words settled between them. Rebuilding required the power of NPCs. Buildings could be restored with time and money, but without residents, Bairan would become nothing but a ghost town. And hadn't they all learned from Grid that NPCs were no different from humans?\n\nZednos's jaw tightened. \"I understand. We will fight.\"\n\nA message appeared in the guild chat window.\n\n**{Jishuka: Everyone converge. Go towards the middle of the village while saving the NPCs.}**\n\nLaella nodded. \"Let's go.\"\n\n---\n\nThe rooftop of a three-story building.\n\nJishuka sent the command through the chat window, then glanced at Vantner. He'd been acting as her escort as they navigated toward the narrow alley area. The plan was to avoid the enemy's gaze as much as possible while heading toward the walls.\n\nBut they were already Neberius' targets.\n\nThe moment they entered the alley, the old man materialized ahead of them, blocking the path. Grey hair, barely 150cm tall. The flute never left his lips.\n\n\"The power of our church rapidly weakened due to you murdering Malacus.\" His pronunciation remained crystal clear despite the instrument. \"You need to take responsibility for that.\"\n\n*Malacus can't be compared to him.*\n\nThe pressure emanating from the small figure made both Jishuka and Vantner take an involuntary step back. The guild members sprinted into the alley, forming a protective barrier.\n\n\"Leave this place to us!\" one shouted.\n\n\"Vantner, please look after Master!\"\n\nVantner grabbed Jishuka's wrist. \"Thank you!\"\n\nAs an archer, Jishuka couldn't exert her power at close range. The Tzedakah Guild's standard tactics always prioritized protecting her. Distance was her weapon.\n\n\"Let's go!\" Vantner pulled her toward the opposite alley.\n\nThe guild members blocked Neberius while Vantner and Jishuka plunged into the shadows. Then they skidded to a halt. At the end of the foggy alleyway, ten high-ranking believers stood waiting.\n\nVantner advanced through the poison fog, twin axes raised. \"If you don't want to die, get lost!\"\n\nHe couldn't be stopped. His master needed protection. The believers flinched, pushed back by his sheer momentum. Vantner seized the opening and led Jishuka down a different route.\n\n*We need to reach the walls.* That's where Jishuka could shoot most effectively. Vantner was determined to escort her there, even if it cost his life.\n\nBut the followers weren't idle. They rushed forward as Jishuka broke from the alleyway.\n\n**Jjejeong!**\n\nSteel rang against steel. Due to Balak's passive power, even the elder believers hit like sledgehammers.\n\n\"Kuk!\" Vantner grunted as black knights emerged from among the black magicians, pulling swords hidden beneath their robes.\n\nHe deflected the first strike, but his complexion darkened. As a guardian knight, he should have been a wall. But he'd invested all his stat points into strength, and his armor was mediocre at best. His defense was pathetic.\n\nStill, he didn't retreat. \"Shit! This is me! I am a tank destroyer, you scum!\"\n\nVantner activated a guardian skill to boost his defense, then counterattacked.\n\n**Peeok! Peeok!**\n\nHis axes battered the knights' swords with brutal force. But there were ten black knights. They surrounded him. Blood began to flow.\n\n\"Kuoh!\" Vantner's health bar plummeted.\n\nThe black magicians hid among the knights, constantly layering curse magic. His legs wobbled. He could barely stand upright. A glance at his health confirmed it: nearly empty.\n\n*Protect Jishuka!* The vow echoed in his mind, fueling his courage. But courage couldn't heal wounds or restore stamina. *I am the worst.*\n\nJishuka fired arrows every time Vantner's defenses showed a gap, but her expression twisted in frustration. She wasn't able to exert her full strength. The constant debuff from Neberius's flute sabotaged every shot.\n\nMeanwhile, the guild members who had stayed behind to confront Neberius in the narrow alley were dying.\n\n\"K-Kuack!\" one choked out.\n\n\"Dirty old...\" Another collapsed.\n\nThe Tzedakah Guild was composed entirely of top 200 unified rankers. Every member was a monster in their own right. But it wasn't enough to threaten the Fourth Servant.\n\nNeberius tilted his head, almost curious. \"What is with the strength of this dark magic? It has excellent compatibility with all magic power attributes. Some attributes are even enhanced by the dark magic.\"\n\nHe kindly explained his superiority, then summoned a lightning bolt.\n\n**Kwa kwa kwa kwang!**\n\nThe alley ceased to exist. Nearby buildings collapsed simultaneously. The lightning wrought devastation.\n\nNeberius blinked. \"You?\"\n\nThe enemies who should've been vaporized were still standing. His eyes widened.\n\nThen a cold voice cut through the dust. \"I will kill you.\"\n\nThe number one assassin appeared. Faker had rescued the guild members at the last second, repositioning behind Neberius in the span of a heartbeat. He struck.\n\nMagicians possessed weak physical abilities, and Neberius lacked defensive skills like Malacus. He should have been completely vulnerable.\n\nBut he twisted at the last instant. The dagger carved a line across his neck instead of severing his throat. The cursed flute had saved him by reducing Faker's accuracy by 60%, throwing the strike slightly off target.\n\nNeberius touched the wound, frowning for the first time. \"Hrmm. You are quite good?\"\n\nFaker's eyes were dead. \"You are good as well.\"\n\nThe colleagues behind Faker were his constant companions. They'd trained relentlessly after being defeated by Euphemina, evolving into what was now known as Faker's group.\n\nFaker typed into the guild chat.\n\n**{Faker: Faker's group, we are facing Neberius. His magic will be sealed when we draw his attention.}**\n\n---\n\nToban gritted his teeth. \"Kuk... It's hard.\"\n\nThe number one paladin was struggling to tie up Balak's feet. The continuous fire damage chipped away at his health with every passing second. Balak was also devastatingly strong with the sword. Toban had already taken several clean hits. He boasted the strongest defense and highest health in the guild, but his voice came out weak.\n\n**{Toban: This is Toban. Balak is so strong that I can't last much longer. Where is the support from Regas and Pon?}**\n\nLaella checked the battlefield from the wall, then typed back, frustration seeping into her message.\n\n**{Laella: The elders are focusing on Pon and Regas. I am supporting them with magic, but it seems hard for them to leave.}**\n\nToban's hands trembled. *How good would it be if Grid was here right now?*\n\nBut there was no point in wishful thinking.\n\n**{Vantner: Ah... How rotten. Being Jishuka's protector is very arduous. If only Grid made my armor... Damn.}**\n\nVantner's grumbling filled the chat as he reached his limit. It was a total crisis.\n\nHowever, the strength of the Tzedakah Guild was terrifying.\n\n\"I've taken care of all the followers here!\" Toon's voice boomed across the battlefield. \"How about it? Should we help you? Kyaaack... spit! How strong is a demonkin? Kukuk!\"\n\nToon and the two other new members joined Toban against Balak. The pressure eased.\n\nFaker took a breath as the enemy forces divided. \"I came!\" Ibellin appeared, adding his strength to Faker's group.\n\nNeberius found himself repeatedly unable to complete his spells.\n\nBut the good atmosphere didn't last long.\n\n\"Pant... pant...\" Someone gasped.\n\n\"Shit. It won't work.\" Another curse.\n\n\"I've never seen a demonkin before.\"\n\n\"Balak is Balak, but Neberius is the problem. The debuff is too extensive. I can't attack properly due to the lowered accuracy.\"\n\n\"The evasion rate of 0% is deadly for assassins...\"\n\nAs the battle dragged on, the faces of the Tzedakah Guild grew darker. Neberius and Balak were both powerful, but Neberius was the real threat. The top priority was stopping his flute.\n\nEveryone shared the same thought.\n\n---\n\n**『The Tzedakah Guild have struggled well, but there is a limit.』**\n\nThe battle of Bairan Village was being broadcast by media outlets around the world. Users in Bairan Village recorded the situation and uploaded footage in real time.\n\n**『The situation might improve if Regas and Pon could join the main battle, but there are 60 to 70 people affected by Balak's passive skill thoroughly marking the two of them. It can't be helped.』**\n\n**『In the first place, Malacus was the weakest of the Yatan Servants. The Tzedakah Guild may have defeated Malacus, but dealing with two stronger servants simultaneously is beyond them. It's obvious that the Tzedakah Guild will be wiped out without help from the top 10 of the unified rankings.』**\n\n**『It's odd to see the Tzedakah Guild collapsing.』**\n\n**『But it's incredible that they lasted so long. I don't think anyone watching this broadcast can argue with the fact that the Tzedakah Guild is the strongest. They are fighting so well, even in the worst situation. It is great.』**\n\n**『Personally, Faker and Vantner seem the most impressive. Aren't they doing a good job?』**\n\n**『Vantner? Are you deceived by the splendid appearance of his swinging axes? Vantner is still immature. He didn't pay attention to defense as a guardian knight and is paying for it. Right now, the best people fighting are Faker, Ibellin, Pon, and Regas.』**\n\n**『Are you ignoring Laella and Zednos?』**\n\nThe experts debated, their voices overlapping as the battle reached its critical moment.\n\nThen one of them stopped mid-sentence.\n\n**『Eh? Wait a moment. Who is that person?』**\n\nA man appeared on screen. His face and ID were completely concealed.\n\n**『He is using Fly magic. A magician.』**\n\nThe figure hovered in the air, then reached into his inventory. He pulled out black armor and hurled it toward Vantner, who was isolated with Jishuka.\n\nVantner shouted something toward the man in the sky. His expression was clearly angry. But then he caught the armor, and his face split into a grin.\n\nHe equipped the armor.\n\nHis color improved instantly. The bleeding stopped. His posture straightened. He surged forward, fighting the elders with renewed ferocity.\n\nThe anchors and experts went silent.\n\n**『That armor...?』**\n\nA mysterious man had appeared and given Vantner armor. What was the relationship between them? What was the identity of that armor? Cameras zoomed in as anchors, experts, and viewers around the world began to wonder about the man's identity.\n\nThe man reached into the air again. This time, he pulled out a black greatsword.\n\nHe shouted something to the Tzedakah Guild members. One of them on the ground raised a hand.\n\nThe man threw the greatsword.\n\nThe guild member caught it, and the transformation was immediate. He became stronger, faster. He attacked Balak with terrifying momentum.\n\nOne of the experts gasped. **『Ah! I know that greatsword! Isn't it the weapon used by the butcher who slaughtered the Giant Guild members in Winston in the past?』**\n\nAn anchor leaned forward. **『Yes! I thought it looked familiar! It really is that greatsword!』**\n\n**『No, then that person...?』**\n\nThe man in the sky. People's curiosity about his identity amplified.\n\nThen the man began to arm himself.\n\nHe donned beautiful white armor with gold thread embroidered across the chest. The Holy Light set. After that, he draped an ordinary cloak over it.\n\n**Saaah.**\n\nEvery head turned.\n\nNeberius, Balak, and all the Yatan believers shifted their gaze toward the man in unison.\n\n**『Eh...? What is this phenomenon? Are they focusing on the butcher?』**\n\n**『Does that cloak have a taunting effect? But he's alone. How can he deal with all of them...?』**\n\nThe anchors, experts, Tzedakah Guild members, and all users in the area fell silent. The attention of hundreds of millions of viewers across the world focused on one man.\n\nThe man reached into the air once more.\n\nBlue light flared.\n\nHe began to pull something out.\n\n**『A shark?』**\n\nThat's right. The shape was unmistakable. The man pulled out a blue, shark-shaped greatsword from his inventory.\n\nThen, with the entire world watching, he spoke.\n\n\"Pagma's Swordsmanship, Transcended Link.\"\n\n**『Pagma?!』**\n\nIt felt like the entire world shook. As the anchors and experts reeled in astonishment, blue-black light filled the screen.\n\n---\n\n**Glossary of Common Korean Terms:** OG: Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}