{
  "id": 152,
  "title": "Chapter 152",
  "content": "# Chapter 152\n\nThe smithy in Bairan Village was one of the finest in the region. Before Khan's rise to prominence, the blacksmith who worked there had been considered the best in the north. His disciple, Smith, lacked that same spark of talent. At sixty-six years old, with fifty years spent at the forge, Smith remained stuck at the beginner rank.\n\n\"Gods above, Mister Smith's farm equipment breaks down so quickly.\"\n\n\"I have to travel to another village just to buy decent tools.\"\n\n\"Uncle Smith should've become a miner instead.\"\n\n\"Ha! Right. At least he swings a pickaxe as well as any miner.\"\n\nDecades in the same place, and the villagers still gossiped behind his back. The travelers were even worse.\n\n\"Damn it. Bairan Village is perfect except for this useless blacksmith. Can't get anything worthwhile from the smithy.\"\n\n\"The hunting grounds here are for high-level players, but the blacksmith is bottom-tier trash.\"\n\n\"He makes decent Jaffa Arrows, at least. Cheap too. Good enough for grinding.\"\n\n\"Good enough is the problem.\"\n\nThe criticism never stopped. Smith tried. Gods knew he tried. Every morning, he reminded himself of his master's teachings. He practiced controlling the flames, manipulating the iron, repeating the motions until his muscles burned. Nothing changed. His skills refused to improve, as if some witch had cursed him to eternal mediocrity.\n\n*I can't give up now.*\n\nYoung men in the village dreamed of mining, not smithing. He had no disciples. Worse, he was old. The lord would force him into retirement soon.\n\nSmith clung to one desperate hope. He wanted to reach intermediate rank before the end. He needed to prove his worth. To die as a beginner blacksmith after a lifetime of ironwork? People would laugh at his grave. He refused to be mocked even in death.\n\n*Try to remember.*\n\nSmith closed his eyes at the anvil. He recalled the young man from a few months back. Grid was his name. Ugly helmet, worse attitude, but the bastard had managed to create Special Jaffa Arrows despite being a novice.\n\n*How did he do it?*\n\nSmith reconstructed the memory. He'd watched Grid's every movement, studying how he controlled the heat and worked the metal. Time blurred. The moon sank. Dawn broke. Light filtered through the cracks in the walls.\n\nUnderstanding hit him like a hammer blow.\n\n*Kaaang! Kaaang!*\n\nHis movements grew precise. Efficient. No wasted motion. The fire and minerals bent to his will in ways they never had before.\n\n*Kaaang!*\n\nThe sun climbed to its zenith. Smith existed in a trance, feeling neither time nor hunger. He didn't hear the screams starting outside the smithy. The world narrowed to fire and hammer, to smelting and tempering, to the pure art of shaping metal.\n\nThen it happened.\n\n\"Oh... Ohhhh!\"\n\nEnlightenment crashed through him like breaking surf. The wall that had blocked him for fifty years crumbled to dust. His hands trembled as tears streamed down his weathered face. He clutched the newly forged Special Jaffa Arrow and collapsed to his knees.\n\n\"Ha... Hahaha! Thank the gods... Thank them...\"\n\nThe euphoria wouldn't fade. Smith stroked the arrow like a newborn child, weeping openly. His last desperate effort had been rewarded. Decades of failure, erased in a single night.\n\nThe smithy door crashed open.\n\n\"Infidel.\" A figure stepped inside. \"You will be judged.\"\n\nSmith blinked. A Yatan Church believer stood framed in the doorway. Beyond him, the village burned. Screams echoed through the streets.\n\n*The Yatan Church has invaded.*\n\nThe believer's footsteps echoed on the stone floor. *Ddubeok. Ddubeok.* He raised his dagger, leveling it at Smith's chest.\n\n\"Die, infidel.\"\n\nSmith laughed. The sound came out bitter and tired. \"Yes. I can die now. I have no one left anyway.\"\n\nHe'd finally broken through his limitations. Anyone who found the arrow he'd made would know he'd transcended beginner rank. That was enough.\n\n*I can face my master now.*\n\nSmith closed his eyes. The dagger's approach sent a chill across his skin.\n\n*Puok!*\n\nBlood sprayed. Smith waited for pain that never came.\n\nHe opened his eyes slowly. The believer stood frozen, an arrow protruding from his heart. Blood bubbled from the man's lips before he collapsed. Behind him stood a young man with an insufferable grin.\n\n\"Long time no see, old man.\"\n\n\"Why are you here?\"\n\nIt was Grid. The young man who'd inadvertently granted him enlightenment had appeared at this exact moment and saved his life. Smith had thought he was ready to die, but relief flooded through him anyway. Fresh tears blurred his vision.\n\n\"Have you been well?\"\n\nSmith grabbed Grid's hand, shaking it enthusiastically. The palm was broad, covered in thick calluses. Unmistakably a blacksmith's hand. Grid pulled him to his feet with a wry chuckle.\n\n\"You made excellent arrows, old man.\"\n\n\"Ah!\"\n\nSmith's heart hammered. Recognition. For the first time in sixty-six years, someone had acknowledged his skill. Not just anyone either, but a master craftsman. The enlightenment from last night had pushed Smith to advanced blacksmith rank. He could sense Grid's greatness now, and it made him want to weep again.\n\n\"I can keep working for a few more years. I want to... I need to keep working...\"\n\nGrid clapped him on the shoulder. \"Of course you can work. You're in your prime now.\"\n\nHe rose into the air, meeting Smith's gaze directly.\n\n\"Your workspace.\" Grid's voice carried absolute certainty. \"I'll protect it.\"\n\n> **[Your heart warms when you think about the old blacksmith who overcame his limits through commitment and a desire to work.]**\n> \n> **[The quest 'Blacksmith's Affection' has been created.]**\n\n> **[Blacksmith's Affection]**\n> \n> **Difficulty:** B\n> \n> You are the successor of Pagma's techniques and will. You carry Pagma's humanitarian ideology of using blacksmithing to benefit others.\n> \n> The new dream of an old blacksmith who surpassed his limits has inspired you.\n> \n> You want to reward this old blacksmith whose heart burns as hot as his forge and stands as solid as steel.\n> \n> **Quest Clear Conditions:** Protect Smith's smithy.\n> \n> **Quest Clear Rewards:** Smith's lifespan will be extended by 30 years.\n> \n> *Smith is a late bloomer who succeeded through sheer effort. He possesses the qualities of a fine blacksmith. Extending his life will benefit you.*\n> \n> **Quest Acceptance Reward:** The skill 'Blacksmith's Affection' will be created.\n> \n> **Quest Failure:** Smith's life is not extended.\n\n> **[Blacksmith's Affection]**\n> \n> If you have maximum affinity with an NPC blacksmith, you can raise their skill level by 1 to 5 levels.\n> \n> Blacksmiths who receive your teachings will remain loyal to you for life and share any new item production methods they learn.\n\n> **[Quest is in progress.]**\n\n*Interesting.*\n\nWhen Grid first met Khan in Winston, his rage at injustice had generated the Blacksmith's Rage skill. Now, coming to deliver Vantner's armor, he'd stumbled onto Smith's crisis. Saving the old man brought unexpected rewards.\n\n*Maybe the world isn't quite what I thought.*\n\nHe'd always believed the world rewarded only the selfish and cruel, that good people got trampled. His perspective was shifting. Good deeds could pay dividends.\n\nGrid felt lighter as he exited the smithy. His enhanced Insight immediately detected fifteen Yatan followers nearby. He donned Malacus' Cloak and let them approach, calculating the perfect timing.\n\n\"Pagma's Swordsmanship, Wave!\"\n\nThe energy blast from <span class=\"rarity-legendary\">Failure</span> cut through all fifteen believers in a single sweep. They died without knowing what hit them.\n\n> **[The quest 'Blacksmith's Affection' has been cleared.]**\n> \n> **[Smith's life will be extended by 30 years.]**\n\n*Good. Very good.*\n\nGrid allowed himself a satisfied smile before turning toward the village center. The Tzedakah Guild was engaged with two major threats. The old man Neberius played his cursed flute while the demonkin Balak bubbled like molten lava beside him. Despite the odds, the guild members were holding their ground. Regas, Pon, Jishuka, and Vantner were absent from the main force, but the others fought competently.\n\n*They're much stronger than during the Malacus raid. At this level, they could probably handle Malacus easily now.*\n\nHis gaze shifted to another section of the village. Jishuka and Vantner were pinned down in a dense residential area.\n\n\"That's where I'm needed.\"\n\n***\n\n\"Hah... hah... Damn it! You bastards!\"\n\nVantner's health bar had dropped to critical levels. The damage kept pouring in faster than his potion cooldowns could handle. Death loomed.\n\n\"Die!\"\n\n\"Divine punishment!\"\n\nThe believers recognized his weakness and focused their assault. In the end, Jishuka made her decision.\n\n*Kaaang!*\n\nShe intercepted a black knight's blade meant for Vantner's back. The impact made her cough blood. Vantner's eyes went wide.\n\n\"What are you doing? I'm supposed to protect you, not the other way around!\"\n\nJishuka's laugh came out sharp and mocking. \"Do you have the ability to protect me?\"\n\n\"Ugh...\"\n\nWhen the Tzedakah Guild had quit L.T.S. and migrated to Satisfy, Vantner had rerolled as a tank. He'd been a damage dealer before, and the other guild members had expressed concern about the change. Vantner had been stubborn. He wanted to try a different role.\n\nHe'd regretted it almost immediately. The tank's weak attack power and glacial hunting speed didn't suit his temperament. Solo play became impossible. He always needed a party to level efficiently. Meanwhile, his rival Pon had pulled further and further ahead. Impatience had consumed him.\n\n*Tanker? Screw that.*\n\nTo recapture the pleasure of solo grinding, Vantner had started dumping stat points into Strength. He'd abandoned his original purpose of protecting his guild.\n\n\"How many times have I been told tanking doesn't suit me?\" Vantner's voice cracked. \"If Garcia had joined us as guardian knight like we planned, the guild would be stronger and more stable. I'm sorry.\"\n\n\"...\"\n\nVantner hung his head. Jishuka smiled at his dejected expression.\n\n\"After we survive this, redistribute your stats properly.\"\n\n\"Yes. Since the Malacus raid, I've been putting points into Stamina when I can. From now on, I'll go pure Stamina build.\"\n\n\"Good.\"\n\nJishuka pulled her bowstring back to maximum tension. Flames began materializing at the arrowhead. She was preparing Phoenix Arrow, her ultimate attack skill.\n\n\"Jishuka?\"\n\nShe was going to burn through all her mana to eliminate the black knights in front of them? That was suicide. Vantner reached out to stop her, but Jishuka had already committed.\n\n\"I'll wipe out all the enemies here. You recover quickly and rejoin the others.\"\n\nJishuka sat at 17th on the unified rankings. At that level, rankings fluctuated with single percentage points of experience. Dying and losing 20% would tank her position by twenty ranks or more.\n\nVantner couldn't let her make that sacrifice.\n\n\"No! I'll die instead!\"\n\nJishuka stared at him flatly.\n\n\"Are you an idiot? If you die, I can't escape alone. Just listen to me.\"\n\n> **[You have suffered 2,800 damage.]**\n> \n> **[You have suffered 2,550 damage.]**\n> \n> **[You have been cursed. Your defense is reduced by 30% and your movement speed has slowed.]**\n\nMagic attacks slammed into Jishuka. She didn't flinch.\n\n*Hwaruruk!*\n\nThe flames spread from the arrowhead across the entire bow until fire engulfed the weapon. The moment she released the string, everything in the target area would be incinerated.\n\n\"Ohhhhhh!\"\n\nThe black warriors and magicians sensed the danger. They launched a desperate assault.\n\n*Papapat!*\n\nA volley of darts flew from above, intercepting the attacks aimed at Jishuka. A voice called down from the sky.\n\n\"Stop.\" Grid descended slowly. \"Why are you planning to die?\"\n\n*Paruru.*\n\nJishuka's long eyelashes fluttered. Without hesitation, she dispersed the flames and turned her gaze upward.\n\n\"Why are you so late, you bastard?\"\n\nShe looked ready to cry. Her usual confident sexiness had given way to something almost cute as she puffed out her cheeks. Grid felt his face heat up.\n\n\"I'm sorry.\"\n\nVantner wasn't as sentimental. \"Hey! You bastard! You logged out in the middle of making my armor and disappeared? That's too much! I could've played a more active role if you'd finished it!\"\n\nGrid tossed down a bundle. \"Then start now.\"\n\n\"What do you want me to do from now... huh?\"\n\nVantner's complaint died in his throat as he examined what Grid had thrown.\n\n> **[<span class=\"rarity-legendary\">Relieved Wave Armor</span>]**\n> \n> **Rating:** Legendary\n> \n> **Durability:** 574/574  \n> **Defense:** 861  \n> **Movement Speed:** -4%\n> \n> * Reduces damage received by 60% if your health is above 60%.\n> * Increases defense against cutting attacks by 30%.\n> * High chance of invalidating cutting attacks.\n> * Generates the skill 'Persistence'.\n> \n> Among the items crafted by the legendary blacksmith 'G,' this is the second piece born with emotions.\n> \n> It was neglected during production and became anxious. Now it feels relief at being completed. It is filled with the desire not to be discarded twice, and that desire affects the wearer.\n> \n> It harbors bad feelings toward its creator, but isn't petty enough to express them.\n> \n> **User Restriction:** Level 240 or higher. More than 500 **Strength**. Advanced Heavy Armor Mastery Level 2 or higher.\n> \n> **Weight:** 1,920\n\n> **[Persistence]**\n> \n> If your current health falls below 5%, you will instantly regain 20% of your health and unconditionally defend against one enemy attack.\n> \n> **Skill Cooldown Time:** 30 hours.\n\nGuardian knights possessed the invincible skill Guardian's Power, which could block a single attack. Used correctly, it could neutralize enemy momentum. That defined the guardian knight's role as the ultimate tank. But this item's skill was superior.\n\nVantner's eyes went wide.\n\n*The cooldown is longer and harder to time perfectly, but that instant 20% health recovery...*\n\nThis was a true legendary item. Excitement surged through him.\n\n\"Grid! Thank you!\"\n\nVantner ripped off his old armor and equipped the new piece. His defense skyrocketed, and 20% of his health immediately restored. With renewed invincibility, he charged the black knights.\n\n\"Jishuka! I'm strong now! Hahaha! Strong! I'll attack and protect you unconditionally!\"\n\n*Chaaeng!*\n\nA black knight's blade swung at Vantner's exposed back. An invisible barrier deflected it harmlessly.\n\n\"What?!\"\n\nThe target who'd been on death's door had suddenly recovered, and what was this defensive ability? The confused dark knights stumbled back. Vantner exploded forward like a berserker, his twin axes carving through their ranks. The enemies had no choice but to focus on him.\n\nJishuka created distance. Her arrows flew without mercy.\n\n*Puk! Puuok!*\n\n\"Kuaaaak!\"\n\n\"K-Kieek!\"\n\nTwo black knights burst into light particles.\n\n*Kaaang! Kaang!*\n\nThe surviving knights attacked Vantner relentlessly, but their swords frequently slipped off the wave pattern engraved on his armor.\n\n\"You...!\"\n\nThe black magicians began casting spells to stop Vantner's rampage. Jishuka made them regret it.\n\n\"Keok!\"\n\nShe switched to sniping the casters. With no one to stop Vantner, the tide turned decisively.\n\nGrid had already moved on. \"You're next.\"\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}