{
  "id": 153,
  "title": "Chapter 153",
  "content": "# Chapter 153\n\nJade fire. The flames of the demonkin burned with a beauty that could seduce the soul, but the heat beneath that elegance could liquefy steel.\n\nFire roared through Bairan's ruins. Every sweep of Balak's blade carved molten scars across the earth, spreading an inferno that turned the village center into a crematorium.\n\n\"Damn it. He's as scary as Grid.\"\n\nA dark-skinned man sprinted through the wreckage, dodging between blackened buildings that matched his skin tone.\n\n*So fast.*\n\nBalak wore human shape, lean and adult-sized, but his flesh bubbled like lava. Two massive white eyes sat above a grin that split his face from ear to ear. Flames wreathed his scalp, completing the image of a demon torn from nightmare.\n\nThe ghastly creature surged forward with inhuman speed. His elongated sword swept down.\n\nThe fire blade cleaved through a building's outer wall like it was wet paper.\n\nToban would have been bisected if he hadn't raised his shield in time. Metal screamed. The impact drove him to one knee.\n\n\"Kuk...\"\n\nPain twisted Toban's face as jade fire illuminated his features. \n\n*This bastard's passive is too threatening.*\n\nThe shield had held, but Toban's health bar continued its steady drain. Balak's flames spiraled outward in a one-meter radius, dealing continuous damage just from proximity.\n\n*Fixed damage. Fire resistance doesn't help. Definitely a problem.*\n\nThe damage dealers hung back, unable to close the distance. Five hundred damage per second would shred through the 19,000 health pools of level 250-260 players in under a minute. Even Toon, with his higher health, couldn't find an opening. The entire party was banking on Toban to create one.\n\nFor now, their tank fought alone.\n\nSteel rang against steel in rapid succession.\n\n*Is he getting faster?*\n\nToban had burned through every buff skill in his arsenal. His status window bloomed with percentage increases, some rising into double digits. But even augmented, he couldn't block Balak's blade forever.\n\nThe demonkin's sword accelerated. Toban's shield was a fraction too slow.\n\nThe fire blade punched through his guard and opened his chest.\n\n&gt; **[You have suffered 3,900 damage.]**  \n&gt; **[You have been hit by a lethal blow!]**  \n&gt; **[You have suffered 7,980 damage.]**\n\nBlood sprayed. Toban's scream tore from his throat as he collapsed to his knees.\n\nBalak smiled. He raised his sword for the killing stroke.\n\nToban triggered a skill. \"Swamp Shield!\"\n\nA barrier of slimy mud erupted between them.\n\nBalak's blade crashed into the shield and sank. The mud gripped the weapon, sucking it down with relentless pressure.\n\n\"Trying tricks.\"\n\nBalak tightened his grip. The shield's pull increased in response. Annoyance flickered across the demonkin's features.\n\n\"It would be easier if you simply became a slave of the death god...\"\n\nBalak's voice bypassed Toban's ears and spoke directly into his brain. The words carried fear and confusion woven into their cadence. But Toban was the first paladin of the Judar Church. He didn't flinch.\n\n\"Goodbye.\"\n\nToban grinned. Toon and seven other Tzedakah Guild members attacked as one.\n\n\"Hit him now!\"\n\nBalak's passive punished anyone within a meter. The longer this dragged on, the worse their odds became. They needed to end it in a single burst.\n\n\"Counterattack!\"\n\n\"Fox Fire Queen!\"\n\n\"Sword of the Moon!\"\n\n\"Brilliant Strike!\"\n\n\"Frost!\"\n\n\"Vacuum Wave!\"\n\nThe top 100 unified rankers unleashed their ultimate skills.\n\nToon led the assault. His body rippled and shifted through a menagerie of predators: elephant, rhino, hippo, bear, lion, tiger, jaguar, eagle, snake, wild boar. Each form struck Balak's chest with surgical precision.\n\n\"Lord's Strike!\"\n\nThe Beast Master's rare hidden class delivered 1350% of his physical damage in a single devastating blow.\n\nThe concentrated force of a dozen apex predators hammered into Balak's sternum.\n\n\"You...!\"\n\nBalak coughed blood. With his sword trapped in the Swamp Shield, he had no defense. The remaining guild members followed up. Flaming fists, a blade that carved reality itself, arcing lightning, bone-freezing frost, and a spear thrust converged on him in rapid succession.\n\nEach skill dealt over 1100% of the user's attack power. But Neberius' flute continued to play in the distance. Three of the six skills were non-targeted, their accuracy cut by 60%. They whiffed through empty air.\n\n\"Ah...\"\n\n\"Damn.\"\n\nDismay rippled through the ranks. Balak, who had staggered from four consecutive hits, straightened. He roared.\n\n\"Hell Fire Festival!\"\n\nHundreds of jade fireballs materialized around Balak, spinning and swelling as they ignited.\n\n\"This looks bad!\"\n\n\"Fall back!\"\n\nToo late. The guild members scrambled for distance as the fireballs detonated in a cascading chain.\n\nExplosions ripped through the area like a fireworks display gone apocalyptic.\n\n\"Kuaaaack!\"\n\nThe blasts hurled bodies through the air. Toban took the worst of it, his health plummeting into critical range.\n\nThe Swamp Shield shattered. Balak's sword clattered to the ground, freed from the mud. The demonkin retrieved his blade, teeth gleaming in a predatory smile.\n\n\"This time, I will invite you to the sword festival.\"\n\n\"Stupid cubs who used non-targeted skills...\" Toban coughed. Blood flecked his lips. \"If your hit rate is reduced, you use certain skills, you fools.\"\n\n\"Shit... Why are you so confident... Shut up.\"\n\nThe guild members sprawled across the scorched earth, hurling insults between groans of pain. They all felt it. This was the end.\n\n*I got caught by Grid, lost hunting time, and now I'm going to die and lose experience...*\n\nToban's chest tightened with despair. His own incompetence had led to this. If he survived, he'd level harder. Get stronger.\n\nA voice called from above. \"Who is above level 250, has more than 1,800 strength, and has Advanced Sword Mastery?\"\n\nThey looked up. Relief and annoyance warred on their faces.\n\n\"What the hell? What are you saying all of a sudden? Kyaaack!\" Toon spat blood, speaking for everyone.\n\nToban grinned despite the pain. Grid appeared like a stage magician, floating overhead. The newer members, including Toon, didn't recognize him beneath his hat. But Toban and the veterans knew him instantly.\n\nGrid usually wore scruffy clothes when working at the smithy.\n\n\"Grid, what are you talking about? Level? Strength? Mastery? Why are you asking?\"\n\n\"Hey, stop the nonsense and get down here to help!\"\n\nGrumbles rose from the guild members, but hope kindled in their eyes. Pagma's Descendant. A Legendary class. His presence alone bolstered their confidence.\n\n\"I want to lend you a weapon. I'll ask again. Who is above level 250, has more than 1,800 strength, and has Advanced Sword Mastery?\"\n\n\"Toban is over 250, but the other conditions...\"\n\nThe guild members exchanged glances as Grid repeated his question. Several met one or two requirements. None met all three.\n\nToon raised his hand.\n\nGrid's frown deepened. \"I don't like that bastard.\"\n\nToon processed Grid's words and recognition dawned. \"I don't like you either. Kyaaack!\" He spat. \"You're a coward who lied about being a blacksmith.\"\n\n\"Whatever. Take it.\"\n\nGrid tossed Toon a black greatsword. The blade the butcher had wielded. The weapon Grid had used for a long time. Toon recognized it immediately.\n\n\"Are you crazy? Why are you giving me your weapon? You planning to fight bare-handed?\"\n\nGrid snorted. \"You think that garbage is my weapon?\"\n\n\"Garbage?\"\n\nToon inspected the <span class=\"rarity-unique\">+5 Dainsleif (Reproduction)</span>. His jaw went slack. This monstrous item, potentially the strongest weapon in existence, was... garbage?\n\n*What's wrong with this bastard? Oh, right. Isn't he always like this?*\n\nThe butcher was famously psychotic. Toon released his worn wrist blades and equipped Dainsleif. He activated 'Half Man Half Beast.'\n\n\"Ku...ooooooh!\"\n\nHis muscles swelled like the Hulk's. Grey fur sprouted from thickening skin. His face extended into a lupine snout, teeth elongating into fangs. A werewolf in all but name.\n\nGrid observed the transformation and sighed.\n\n\"No creativity... Hey, if you like that sword, buy it from me. Four million gold.\"\n\n\"Awooooo~!\"\n\nToon howled. Then he charged Balak, Dainsleif singing through the air.\n\nThe greatsword crashed into the demonkin with earth-shaking force. Toon's hybrid form combined human dexterity with bestial power, making him exponentially stronger. Toban and the other guild members layered buff skills onto him. Balak faltered.\n\n\"How can a human be so strong...?\"\n\n\"This area can hold a bit longer...\"\n\nGrid had bought them time by throwing Dainsleif. Now he turned his attention eighty meters back, where an elderly man played a flute with one hand while fending off Faker and Ibellin with the other.\n\n*I need to stop that old man and his flute first.*\n\nThe magic-infused melody echoed across Bairan Village, sabotaging every non-targeted skill.\n\n\"That old man ends now.\"\n\nGrid reached into his inventory.\n\nBlue light bloomed in the sky. A second greatsword emerged, its form like a prowling shark. The predator's dignity radiated from its edge.\n\n\"Pagma's Swordsmanship, Transcended Link.\"\n\nTwenty strikes launched without interval, each dealing 150% of Grid's attack power. The world watched, though Grid didn't know it yet.\n\n\"...What?!\"\n\nNeberius cried out, still engaged with Faker and Ibellin. A heavy rain of sword strikes poured from above. His eyes widened. Not just his. The overwhelming assault stunned the world, including the Tzedakah Guild.\n\n\"Dark Fire Storm!\"\n\nNeberius summoned an orb. Three-attribute magic, the most powerful combination stored within, erupted to meet Grid's attack. Fire and storm collided with blue energy blades.\n\nExplosions tore through the air.\n\n\"Get clear!\"\n\nThe Tzedakah Guild scattered. Eighteen of twenty sword strikes were consumed by Neberius' storm. But two persevered, plunging toward the dark magician.\n\n\"This mighty force...!\"\n\nNeberius stopped playing his flute for the first time. He cast frantically. \"Dark Ice Wall!\"\n\nAn ice barrier materialized, towering higher than Bairan's walls.\n\nThe two energy swords shattered against the barrier.\n\nSparks flew from the collision, arcing toward Grid.\n\n\"Look out!\"\n\nIbellin had experienced Neberius' black flames firsthand. He shouted a warning.\n\nGrid was fine.\n\nA **Golden Shield** flashed, annihilating the flames. Grid descended to the ground, sharp eyes gleaming beneath black hair.\n\n\"You!\"\n\nDozens of dark thunderbolts fell, converging on Grid.\n\nHe didn't flinch.\n\n\"Eek...?\"\n\nNeberius recoiled in shock.\n\n&gt; **[The effect of the Holy Light Armor has been activated, resisting the dark magic.]**\n\nGrid smiled at the notification. The dark lightning dissipated. Then red lightning crackled to life.\n\nElectricity sizzled across the battlefield.\n\n\"Pagma's Swordsmanship, Kill!\"\n\nThe strongest skill in his arsenal.\n\nNuclear force descended toward Neberius' skull.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}