{
  "id": 154,
  "title": "Chapter 154",
  "content": "# Chapter 154\n\n*This momentum...!*\n\nNeberius was 123 years old. God Yatan's blessing had granted him a long life—and with it, hard-won insight. The masked man had shifted the entire battlefield with minimal effort. One misstep now would mean serious injury.\n\n*No.* The magician's eyes narrowed behind his aged face. *One misstep will mean death.*\n\n**Kuwaaaang!**\n\nGrid descended to ten meters above the ground, then accelerated. The air tore itself apart. The earth trembled. A legendary class wielder with maxed stats and skills evolved through his equipment—a monster in human form.\n\n*That level of power shouldn't exist. It's impossible.*\n\nUnfortunately, defending was out of the question. His body was old, his reflexes dulled by a century of magic study rather than combat. Evasion? Equally futile. Offsetting the attack with raw magic would drain him dry.\n\nNo. There were more elegant solutions.\n\n*Gravity manipulation.*\n\nAs a dark sorcerer, Neberius commanded far more than simple attack and defense spells—unlike that brute Malacus. The title of Great Magician wasn't honorary. He wielded magic of every attribute, a vast arsenal of techniques.\n\n\"Reverse Gravity.\"\n\nThe spell matrix snapped into place.\n\n**Teong!**\n\n\"...?\"\n\nGrid swept down like a hawk toward its prey, <span class=\"rarity-legendary\">Failure</span> raised high for Kill. But an invisible hand seized him mid-strike. His blade stopped centimeters from Neberius's throat. Then, against every instinct in his body, Grid began rising skyward.\n\nGravity itself had turned traitor.\n\n\"Shit...!\"\n\nGrid floated upward like a child's lost balloon. His attack registered as a MISS, and the accumulated energy of Kill evaporated from his blade. Transcended Link, then Kill—two of his strongest techniques consecutively neutralized. The frustration threatened to choke him.\n\nNeberius and the building debris rose as well, pulled by the same inverted force. They accelerated toward Grid like objects falling into a black hole.\n\nThe magician smiled. His hands began weaving spell matrices. \"The tables have turned. Your turn to suffer.\"\n\nNeberius's specialty was double casting—mind and mouth working in perfect synchronization to complete two spells simultaneously. Dark thunder coalesced in one hand. Dark water gathered in the other.\n\n**Pajik! Pajijik!**\n\nFive spheres of crackling electricity struck Grid from crown to heel. Before he could recover, three spheres of water exploded against his armor, doubling the lightning's bite.\n\n\"**Kuaack!**\"\n\nThe scream tore from Grid's throat as electricity cooked him inside his armor. Neberius watched with clinical interest.\n\n*That divine armor resists dark magic, but the probability isn't absolute.*\n\nRelief flooded through him. The old magician pressed his advantage, unleashing a magical barrage.\n\n**Hwaruruk! Chachak!**\n\nArrows of fire and ice materialized in rapid succession, streaking toward the helpless warrior.\n\n*This is bad.*\n\nGrid remained trapped by Reverse Gravity, unable to control his body. It was like playing a game with inverted controls—every instinct working against him.\n\n**Pepepepeng!**\n\n> [You have suffered 1,160 damage.]\n\n> [You have suffered 1,230 damage.]\n\n> [The effect of the <span class=\"rarity-legendary\">Holy Light Armor</span> has been activated, resisting the dark magic.]\n\n> [You have suffered 1,155 damage.]\n\n*Annoying.*\n\nHe had no choice but to take the hits. The <span class=\"rarity-legendary\">Holy Light Armor</span> cut magic damage by fifty percent and occasionally nullified dark magic entirely, but this was still a one-sided beating. Was he supposed to just be a punching bag?\n\n*I don't like it.* Those days were over—the days of being powerless, of taking abuse without recourse. *Never again.*\n\nGrid twisted in midair, reversing his orientation. Then he launched himself toward the spell-weaving magician.\n\n*I won't be hit one-sidedly anymore!*\n\nReverse gravity? Once he stopped panicking, the solution was obvious. He simply recalibrated—sky became ground, ground became sky. Combat experience had sharpened his adaptability. His mind adjusted to the inverted world.\n\n\"You have no respect for the elderly!\"\n\nGrid fell toward the ground. Neberius flew toward the sky. Their trajectories formed a collision course neither could avoid.\n\n*Pagma's Swordsmanship.*\n\nGrid calculated the distance, the timing. As the gap closed, he activated his skill.\n\n\"**Link!**\"\n\nPerfect. The instant Neberius entered his attack range, the greatsword flared blue.\n\nBut Neberius wasn't idle. He snapped his fingers.\n\n**Teong!**\n\nGravity snapped back to normal. Neberius and the debris stopped their skyward flight and plummeted earthward instead. Grid's blade cut through empty air. His third consecutive wasted skill.\n\n\"Damn old man!\"\n\nGrid hit the ground hard, rolling. Neberius landed lightly, already completing his next spell matrix.\n\n\"Dark Storm.\"\n\n**Kwa kwa kwa kwang!**\n\nThe same magic Yura had used to kill Grid and Doran. The same magic that had shattered the Yatan Temple.\n\nGrid flinched—old trauma clawing at him—but muscle memory took over. He swapped to the <span class=\"rarity-legendary\">Divine Shield</span>.\n\n*High chance of completely resisting dark spells.*\n\nBoth the legendary Divine Shield and the Holy Light Armor possessed this option. The overlapping effects formed a bulwark against the dark arts.\n\n\"Haha.\"\n\nNeberius laughed at the absurdity. The man walked through Dark Storm as if it were a light rain. Not a scratch on him. And now he was charging forward.\n\n**Pepeng! Peng peng!**\n\nMagic spells hammered against the shield, but Grid didn't slow. The Divine Shield's performance exceeded any Neberius had witnessed in his long life.\n\n*What master craftsman forged that...?* Admiration flickered through him. *But it won't help against what comes next.*\n\nNeberius focused his magic power into the orb he'd been cradling. An orb was both weapon and insurance for a mage—capable of storing spells with lengthy casting times, releasing them instantly when fed magic power.\n\nHis orb currently held two spells. His strongest techniques, three-attribute amalgamations comparable to the Dark Fire Storm that had countered Grid's Transcended Link. What if he unleashed both with no delay between them?\n\n*Victory!*\n\nGrid emerged from the black storm, shield vanished, gripping his greatsword two-handed.\n\n*Fool!*\n\nNeberius grinned and poured magic into his orb.\n\n\"**Dark Thunder Explosion!**\"\n\n**Kwaaaaaaaaaaaaaaang!**\n\nAn eruption of darkness and lightning detonated point-blank.\n\n*What?*\n\nNeberius could chain powerful magic immediately after Dark Storm? This was Grid's first fight against a mage who truly understood orb mechanics. The damage was catastrophic.\n\n> [You have suffered 14,300 damage.]\n\nEven with the Holy Light Armor, the hit staggered him. But Grid didn't retreat. He saw the opening—the moment when Neberius would be drained from the powerful spell's backlash.\n\nExcept Neberius still had one spell stored.\n\n\"**Dark Stone Blizzard!**\"\n\n**Kwa kwa kwa kwang!**\n\n*Again?*\n\nSharp stones and ice shards manifested around Grid, whirling like blender blades.\n\n\"Grid!\"\n\n\"Ahh!\"\n\nThe Tzedakah Guild members who'd been counting on Grid to handle Neberius groaned in unison. Around the world, hundreds of millions watched through screens—TV broadcasts, internet streams—thinking the same thought as Grid disappeared into the maelstrom.\n\nChat windows across streaming platforms exploded with commentary.\n\n**—LMAO a legendary class? Yeah right. This is hilarious. It's over.**\n\n**—What kind of legendary class doesn't account for orb-stored magic? Why'd he drop the shield? Trash. Can't fight for shit.**\n\n**—His judgment's compromised. Exhausted from Neberius's Reverse Gravity? Lost his composure after getting his skills cancelled.**\n\n**—Fair. The old man's fighting smart. Even top 10 rankers would struggle.**\n\n**—Nah, that's cope.**\n\n**—Haven't you been watching the news? Pagma's Descendant is a blacksmith, not a fighter. Fundamentally weak in combat.**\n\n**—Did you see the power on those three skills? He's not weak.**\n\n**—Pagma had the best swordsmanship after Sword Saint Muller, even if he was 'just a blacksmith.'**\n\n**—Had high expectations for the first legendary class... but this...**\n\n**—Just trash lol**\n\n**—Ah... didn't think it'd end this fast. I just ordered chicken.**\n\nHundreds of millions disappointed or laughing in real time. None of them had noticed yet. The storm around Grid wasn't just stone and ice.\n\n**Kakakang! Kwaaaaaang!**\n\n*This is insane!* Neberius stared. In the heart of the maelstrom, two golden discs had materialized, deflecting stones and ice alike. The spell's duration expired. The target should have been shredded.\n\nInstead, Grid floated in the air, battered but intact.\n\n\"You're more troublesome than the Pope, despite having lower combat power.\" Grid's voice carried through the settling debris. \"Got any more tricks?\"\n\nThe two golden discs orbited Grid like satellites.\n\nNeberius's composure cracked. \"What **are** those? What manner of artifact—\"\n\nThat armor. That shield. Those golden discs. Treasures a king would envy.\n\n\"I would've won this fight ages ago if not for those artifacts...!\"\n\nGrid approached like a specter, raising <span class=\"rarity-legendary\">Failure</span>. \"Don't worry about it.\" His voice was flat. \"Being overgeared is my job.\"\n\n\"**Ugh! Diamond Shield! Dark Shield!**\"\n\nNeberius had exhausted the orb's stored spells. His magic power teetered near empty—no powerful spells remaining. He strained himself, layering two defensive techniques simultaneously.\n\nThen he began chanting Teleport. Flight was the only option.\n\n*This is my last shot.*\n\nThe cooldowns on Transcended Link, Link, and Kill still ticked down. Could he break through the double shields and stop Neberius's escape?\n\nOf course he could.\n\nSkill power? He didn't need it.\n\n*I have item power.*\n\nGrid swung <span class=\"rarity-legendary\">Failure</span> down toward the layered shield.\n\n**Chaaeng!**\n\n> [The <span class=\"rarity-legendary\">Holy Light Gloves</span> option effect is activated, causing you to attack the target five times.]\n\n**Jjeejeeeong!**\n\n*Impossible! What the—*\n\nNeberius's eyes bulged mid-chant. The opponent's strike hit so hard the shields couldn't fully absorb it. Cracks spiderwebbed across the barriers.\n\n**Jjejeong! Jjejejeok!**\n\n> [<span class=\"rarity-legendary\">Failure</span>'s option effect is activated, causing you to attack the target five times.]\n\n**Jeeeong!**\n\n\"**Heeook!**\"\n\nThe double shields shattered. Hundreds of reflections of Neberius scattered across the fragments like broken mirrors.\n\nFear. In 123 years, Neberius had felt this emotion perhaps three times. Now a fourth.\n\nThe predator swallowed him whole.\n\n> [<span class=\"rarity-legendary\">Failure</span>'s option effect is activated, causing the skill 'Bisect' to be generated.]\n\n> **[Bisect]**  \n> Deals 800% of your attack power to a single target. If the target's body is cut, various abnormal status conditions are inflicted.  \n> **Skill Cooldown Time:** 5 minutes.\n\n**Seokeok!**\n\n\"**Kuaaaack!**\"\n\nSurvival instinct screamed. Neberius raised his right arm. The blade severed it cleanly. Blood fountained from the stump.\n\nTerror replaced fear.\n\n\"That's... impossible...!\"\n\nHe'd known the Tzedakah Guild was stronger than expected. The assassin radiated danger. The young swordsman possessed frightening potential. The archer and half-beast tied up Balak. The martial artist held off seventy strengthened elders alone.\n\nBut this masked man who'd arrived last was **different**. Too strong. Despite being a mere user, he reminded Neberius of Yura—the one chosen by God Yatan himself. That white armor. That divine shield containing overwhelming sacred power.\n\nWas he connected to the Rebecca Church?\n\n\"I heard rumors... a secret temple in the Rebecca Church, fostering Rebecca's Daughters and assassins in isolation. Did you come from there?\"\n\nGrid's response was flat. \"Temple? No. I'm Overgeared.\"\n\n\"...Overgeared?\"\n\nThe non-answer deepened Neberius's confusion.\n\nThen came the pain.\n\n**Puok!**\n\nThe blue greatsword pierced his heart.\n\n\"K... **Kuock**...!\"\n\nThe Fourth Servant of the Yatan Church fell to a single user.\n\n---\n\n**Glossary of Common Korean Terms:**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day."
}