{
  "id": 155,
  "title": "Chapter 155",
  "content": "# Chapter 155\n\n\"Finally... To hell... By God Yatan's side... I can go...\"\n\nThe decrepit body collapsed. Neberius crumpled to the cold floor, his form dissolving into particles of grey light.\n\nThe world erupted in cheers.\n\n『 Oh...! Ohhh! Incredible! The first legendary class, Pagma's Descendant, has defeated the Fourth Servant of the Yatan Church! What a remarkable achievement! 』\n\nAsia.\n\n『 Neberius is level 300—a third advancement dark magician and a hidden boss. He defeated that enemy alone? The power of a legendary class is staggering. 』\n\nNorth America.\n\n『 I wouldn't call it a solo raid. The Tzedakah Guild whittled down Neberius's health and magic power before Pagma's Descendant arrived. 』\n\nEurope.\n\n『 Without the Tzedakah Guild's support, could Pagma's Descendant have knocked down Neberius alone? 』\n\n『 Hard to say. 』\n\nSouth America.\n\n『 What strengths and weaknesses of Pagma's Descendant could be observed in this battle? 』\n\nOceania. Africa. Every continent's international media broadcasted headlines about Pagma's Descendant. Communities across the world exploded with discussion.\n\n**—A hidden boss defeated in a one-man raid. Insane.**\n\n**—Thought he was done when that magic hit him LOL but he still won LMAO**\n\n**—Honestly though, he won because of his items.**\n\n**—Agreed.**\n\n**—What are those golden discs? Where did he get them? Quest reward?**\n\n**—If we knew, would we be asking? Think before you post.**\n\n---\n\n**[A Review of Pagma's Descendant by a Level 269 Ranker]**\n\n*Hello. I'm ranked 15th on the unified rankings. Proof? Don't need it—too much hassle. Believe me or don't.*\n\n*Straight to the point.*\n\n*Based on what I observed, Pagma's Descendant is a beginner at combat. Too harsh? Fine, I'll call him a 'magic dictionary.'*\n\n*Magician basics. Pagma's Descendant used skills against a great magician but got caught by gravity magic, didn't account for the orb's built-in spells, and took massive damage. Amateur mistakes. Specifically, his inability to handle Reverse Gravity properly proves his control is weak. Of course, 'weak' is from a ranker's perspective.*\n\n*(Omitted.)*\n\n---\n\n**[PvP Expert Commentator RIX on Pagma's Descendant]**\n\n*(Omitted.)*\n\n*Bottom line: Pagma's Descendant's control and combat ability are mediocre. The power of his items, however, is extraordinary.*\n\n*His white armor and golden shield have absurd magic resistance. The cloak appears to have a built-in taunt function. The boots grant Fly magic. The greatsword deals overwhelming damage. Most importantly, those two golden discs blocked 70% of Dark Stone Blizzard—a high-tier spell combining three attributes.*\n\n*How valuable are those discs? Impossible to measure, but they're almost certainly legendary-rated.*\n\n*Here's the key point: Pagma's Descendant is a 'legendary blacksmith.' Did he craft these items himself? How does he do it? I want to commission something right now.*\n\n---\n\n**[Excerpt from an Interview with Chris, Ranked 3rd]**\n\n**Q: Many theorize that Pagma's Descendant is the same person as the Butcher of Winston who devastated your guild. Your thoughts?**\n\n**A:** I believe that's correct. I also think he's the craftsman who made those Special Jaffa Arrows that caused such a stir.\n\n**Q: Is he a member of the Tzedakah Guild?**\n\n**A:** The context suggests so.\n\n**Q: I'll be direct. Who's stronger—you or Pagma's Descendant?**\n\n**A:** His raid ability surpasses mine. Neberius might have weak defense and health for a hidden boss, but he's still a hidden boss. I lack the offensive power to kill him instantly. If I attempted to solo raid Neberius, I could drive him into a defensive position, but he'd escape before I could finish him.\n\nMy PvP ability, however, is several times higher. His class might be powerful, but his control is atrocious. His skill usage is predictable. I could avoid or counter his attacks easily. I'd wager most of the top twenty rankers feel the same.\n\n**Q: Many criticize Pagma's Descendant's control, but no one questions the class itself. What kind of class is Pagma's Descendant?**\n\n**A:** It's multifaceted, but its greatest strength is item creation. He's the only legendary item maker in existence, isn't he? The combat power is also exceptional—attack, defense, speed, nothing's lacking. His items are outstanding, but I suspect his base stats are superior as well.\n\nI can't speak to his skill power. As everyone saw, Pagma's Descendant's skills kept missing. *(Laughs.)*\n\n---\n\nThe world fixated on Pagma's Descendant with ravenous attention.\n\nGrid, however, remained oblivious.\n\n> [You have defeated Neberius, the Fourth Servant of Yatan, who had been experimenting with countless black magic spells!]\n\n> [Reputation throughout the continent will rise by +4,000.]\n\n> [Hostility with the Yatan Church has risen to the maximum.]\n\n> [Affinity with the Rebecca Church is already at maximum. You will be welcomed when visiting a Rebecca Temple.]\n\n> [Affinity with the Dominion Church has increased by +2,000. Visiting a Dominion Temple will grant you great blessings. Your current affinity is 3,500.]\n\n> [Affinity with the Judar Church has increased by +1,400. Visiting a Judar Temple will grant you great blessings. Your current affinity is 2,000.]\n\n> [Until a new priest is appointed, the Yatan Church's ability to produce black magicians will decline.]\n\n> [421 gold has been acquired.]\n\n> [<span class=\"rarity-uncommon\">Blessed Weapon Enhancement Stones</span> (2) have been acquired.]\n\n> [<span class=\"rarity-uncommon\">Blessed Armor Enhancement Stones</span> (3) have been acquired.]\n\n> [<span class=\"rarity-rare\">Deluxe Magic Stones</span> (4) have been acquired.]\n\n> [<span class=\"rarity-legendary\">Neberius' Flute</span> has been acquired.]\n\n> [<span class=\"rarity-unique\">Neberius' Bracelet</span> has been acquired.]\n\n> [67,131,050 experience has been acquired.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level...]\n\n---\n\n**[<span class=\"rarity-legendary\">Neberius' Flute</span>]**\n\n**Rating:** Legendary\n\n*A treasure preserved for many years by the Yatan Church. It influences the minds of those who hear its melody. The appearance is ancient, but that doesn't affect its sound quality.*\n\n*When a member of God Yatan plays this flute, it reduces enemy evasion rate by 50%, accuracy by 30%, and slows magic casting time by 1.5x.*\n\n*When a member of the three other gods plays this flute, it increases ally evasion and accuracy by 20% and reduces casting time by 1.5x.*\n\n*When a neutral person plays this flute, a random effect occurs.*\n\n* *You must play for at least five seconds.*\n* *Effect duration: 30 seconds.*\n\n**Conditions of Use:** None.\n\n**Skill Cooldown Time:** 10 minutes.\n\n**Effect Range:** 20-meter radius.\n\n---\n\n**[<span class=\"rarity-unique\">Neberius' Bracelet</span>]**\n\n**Rating:** Unique  \n**Durability:** 14/20  \n**Defense:** 5\n\n**Intelligence** +30\n\n* Reduces magic casting time by 20%.\n\n*A bracelet Neberius treasured. Its effects are modest, but it's an artifact invaluable to any magician.*\n\n**User Restriction:** Level 250 or higher.  \n**Weight:** 1\n\n> [A hidden function doesn't exist.]\n\n\"Yes!!\"\n\nJackpot.\n\n*Neberius' Flute especially. This is huge.*\n\nClasses capable of using buff and debuff magic were rare—black magicians, paladins, and a handful of others. Among them, wide-area buff and debuff magic was even rarer. With Neberius' Flute, he could use wide-area effects regardless of class.\n\n*If I register this at auction... how much would it sell for?*\n\nHe paused.\n\n*Should I test the random effect first?*\n\nGrid raised the flute to his lips.\n\n*Bik. Biiik. Bik.*\n\nHe'd never played a recorder, much less an ancient flute. Still, the instrument's tone was so pure that the discordant notes didn't grate on his ears.\n\n*What's he doing?*\n\nThe Tzedakah Guild members had been celebrating Grid's victory over Neberius. Those still battling Balak suddenly froze as the flute's sound washed over them. Their faces drained of color.\n\n> [You have heard an ill-played melody. All stats will drop by 30%. You are more susceptible to status conditions. This effect lasts for 30 seconds.]\n\nEvery member of the Tzedakah Guild weakened.\n\nBalak's jade flames, in contrast, roared higher.\n\n\"I feel **stronger**!\"\n\n\"Y-You maniac!\"\n\n\"Hey, Grid! What the hell are you doing?!\"\n\n*Kwaang! Kwaang!*\n\nBalak's blazing sword tore through the weakened guild. Pon and Regas, who'd nearly finished off the remaining elders, suddenly found themselves on the brink.\n\n\"Pant... pant... my stamina's draining...\"\n\n\"The elders are... getting stronger...\"\n\n> [A random effect has occurred. Decrease the stats of all allies and increase the stats of all enemies.]\n\n\"...Wow.\" Grid belatedly checked the notification window. He scratched his head. \"Sorry.\"\n\n\"This is **bullshit**!\"\n\nVantner caught Balak's twin sword strikes on his axes, then tumbled backward. He wasn't alone. Most of the guild collapsed under the empowered Balak's assault.\n\n\"Can't be helped.\" Grid glared at the flute. \"Cheap piece of garbage.\"\n\nHe blamed the item and turned toward Balak. The demonkin watched Grid approach, then abruptly shot into the air. A shimmering portal tore open before him.\n\n\"Neberius is dead. I'll withdraw for now. But next time, I'll be prepared.\"\n\nWhere the magician Neberius required lengthy chants to cast Teleport, the demonkin Balak simply willed dimensional doors into existence. The Tzedakah Guild trembled as their prey escaped.\n\n\"We let him slip away...\"\n\n\"Damn! We had him!\"\n\n\"Goddammit, Grid... did you do that on **purpose**?\"\n\n\"...I'm sorry.\" Grid's sincerity showed. Unlike the past, he'd developed a conscience. The apology was genuine.\n\nThe Tzedakah Guild members sighed. They couldn't muster further complaints.\n\n\"Let's restore the village.\"\n\nThe Tzedakah Guild rallied. They defeated the remaining cultists, rescued the NPCs, and began reconstruction efforts under Jishuka's direction. Grid, feeling guilty for letting Balak escape, joined the labor without protest.\n\nThe guild members watched him work in shock.\n\n\"Has Grid... changed that much?\"\n\n\"He's... a little too helpful.\"\n\n\"I thought I was seeing things...\"\n\nToban listened to the murmurs and shook his head. \"Don't exaggerate. He's better than before, sure. But he's still not *good*.\"\n\n---\n\nMeanwhile, in a luxury mansion in Miami, USA.\n\nA blond man watching Grid on the screen clicked off the television. He turned to the long-haired youth beside him.\n\n\"You were defeated by that guy?\"\n\nThe youth—Box in Satisfy—hid his face. \"I'm sorry.\"\n\nThe blond man rose from his chair. He approached the gold ultra-high-tech capsule dominating the center of the living room.\n\n\"Asuka and Black Teddy are trash too. Offering them executive positions was a mistake.\"\n\n\"But we need Asuka's wealth. We can't afford to lose her.\"\n\n\"I know.\"\n\nThe blond man's sharp features resembled a serpent. This was Zibal—ranked second on Satisfy's unified rankings and head of the Snake Guild. He'd recruited talented individuals across disciplines, systematically conquering Satisfy's most valuable territories. His ambition was kingship.\n\nHe evaluated Grid.\n\n\"He's a dunce. The fact that he's the only legendary item maker irritates me, but if we occupy territories and monopolize secret dungeons across the map, we can secure our own supply of legendary items.\""
}