{
  "id": 156,
  "title": "Chapter 156",
  "content": "# Chapter 156\n\nNeberius was dead. Balak had fled. Jishuka pulled up the estate information, her jaw tight as she tallied the damage.\n\n> **Name:** Bairan  \n> **Size:** Village  \n> **Ruler:** Jishuka Bairan (Baroness, Master of the Tzedakah Guild)  \n> **Administrator:** Grill (C-grade administrative ability)  \n> * The higher the administrative ability of the administrator, the higher the overall development of the estate.  \n> **Affiliation:** The Eternal Kingdom, Earl Steim  \n> **Population:** NPCs - 451. Players - 5,104  \n> **Troops:** Knights - 2. Soldiers - 103  \n> **Security:** 10/100  \n> * The state of security is the worst. Residents of the village can riot, and gangsters and monsters will often pop up near the village.  \n> * Each time the number of soldiers increases by 10, the security will increase by one point.  \n> * Security will increase hourly in proportion to the number of soldiers.  \n> **Internal Affairs:** 269/1,200  \n> * Increasing the number of shopping malls, public cultural facilities and buildings will increase the internal affairs number.  \n> * Once the internal affairs number reaches the maximum, the scale of the estate will increase.  \n> **Diplomacy:** None  \n> **Forces hostile to the ruler:** Yatan Church / Rio Kingdom / Red Dragon Trauka / Iron Style Group / Helding Clan / Couch Clan  \n> **Forces hostile to your affiliated groups:** Yatan Church / Rio Kingdom  \n> **Specialties:** Jaffa, steel  \n> **Distinguished Figure:** ★ ☆ Currently one person present ☆ ★\n\nThis morning, before the Yatan Church's invasion, Bairan had boasted 700 NPC residents. Security had been 90. Internal affairs had exceeded 600. Twenty days of pouring every gold coin the guild possessed into development.\n\nHalf a day. That's all it took to tear it apart.\n\nMost people would have cursed. Jishuka's face lit up.\n\n*A distinguished figure.*\n\nThe column had always read \"unknown.\" Now someone exceptional had appeared. One talent could play the role of a hundred soldiers. Maybe a thousand. Maybe ten thousand.\n\n*I hope they have administrative ability.* She opened the personnel menu. *But anything is good.*\n\n> * If the ruler of the estate or a subordinate has more than 300 insight and wears the Ruler's Sword, there is a very rare chance of finding the distinguished person.  \n> * If the ruler of the estate or a subordinate has more than 600 insight and wears the Ruler's Sword, the odds of finding the distinguished person isn't bad.  \n> * If the ruler of the estate or a subordinate has more than 900 insight and wears the Ruler's Sword, there is a medium chance of finding the distinguished person.\n\nThree hundred insight minimum.\n\nInsight was a special stat. Commanders possessed it by default. For general users like Jishuka, it only developed through long-term management. Guilds. Estates. Logistics.\n\nThe only user with the insight stat in the Tzedakah Guild was Jishuka herself. And hers was pathetic.\n\n*I have 75 insight. Will I even be able to find them?*\n\nA distinguished person had appeared for the first time. If she missed them...\n\nShe set her jaw. \"I'll search every corner if I have to.\"\n\n***\n\nThe eastern region had suffered the worst damage. Jishuka made her way there, directing guild members and soldiers toward the repair work. She walked between the crews, watching the residents haul debris and patch walls.\n\nThen she spotted something interesting.\n\n\"You there.\" A man's voice, sharp with irritation. \"You're pretty good with a shovel.\"\n\n\"Huh?\"\n\n\"You have a skill called Shovel Mastery.\" A pause. \"No, it's your nickname.\"\n\n\"Wait, how do you know that?\"\n\n\"Wow, look at you. You have a talent like that and you've been hiding here playing around because you don't want to work?\"\n\n\"Playing around? I'm standing guard!\"\n\n\"The war's over. Why are you standing guard?\"\n\n\"I received orders to protect the residents from any surviving Yatan followers!\"\n\n\"Bullshit. Even if there are stragglers left, you should've confessed you're good with a shovel. We have plenty of soldiers for guard duty. You should be digging.\"\n\n\"I was seriously injured fighting the Yatan Church! I don't have enough stamina for shoveling.\"\n\n\"Seriously injured? You mean that scratch on your forearm?\" The man's tone turned disgusted. \"You're pathetic. Shovel, or I'll make you.\"\n\n\"...I'll do it.\"\n\nJishuka stopped walking. Grid stood there, the Commander's Sword in his hand. Irene must have given it to him. He was scanning the soldier with a single glance, reading skills like a scanner reading barcodes.\n\n*Does a legendary class have special stats?*\n\nHer expectations rose. The Commander's Sword required high insight to use properly.\n\n*Can he handle the Ruler's Sword?*\n\nShe jogged up to him. \"Grid, can you find my distinguished person?\"\n\n\"What nonsense are you talking about?\"\n\nGrid's frown was immediate. He didn't ask follow-up questions. Jishuka held out the Ruler's Sword.\n\n> **[Ruler's Sword]**  \n> Durability: 150/150 | Attack Power: 150  \n> * Dignity +60  \n> * Skill 'Character Observation' will be generated.  \n> * Skill 'Talent Search' will be generated.  \n> A sword only given to a recognized lord. It gives you the ability to observe soldiers and residents closely, so it can be used for estate management.  \n> Weight: 200\n\nAn upgraded version of the Commander's Sword.\n\n*Talent Search?*\n\nJishuka leaned closer. \"You can use the Commander's Sword, so you can use this one too, right? There's currently one distinguished person in Bairan. Find them for me.\"\n\n\"Are you making a blacksmith do everything?\"\n\n\"Heheh.\" She smiled, poked his side, and winked. \"I'll personally reward you. Yes?\"\n\n\"Ugh...\"\n\n*Personally reward?* Grid's mind stuttered. The sensual beauty plus the suggestive phrasing sent his imagination somewhere it had no business going.\n\n*It's been 22 days and my heart is still pounding. Is this more than lust?*\n\nLove?\n\n*Crazy.*\n\nHe'd never even held hands with a woman in reality. Of course he'd misinterpret his feelings for someone like her. He forced himself to remember Ahyoung. That disaster. That humiliation.\n\n*A woman like this wouldn't be interested in me. I shouldn't waste time on delusions.* Besides, he didn't need a human woman. *I like the NPC Irene best.*\n\nGrid was gradually becoming Damian.\n\nHe stored the Commander's Sword and drew the Ruler's Sword. \"As a personal reward, fund Vantner and Toon. They're short on gold to buy the Wave Armor and Dainsleif.\"\n\n\"Unfortunately, the guild's resources are depleted.\" Jishuka grimaced. \"It'll take time. Sorry. But take this.\"\n\nShe handed him minerals.\n\n> [7 pieces of blue orichalcum have been acquired.]  \n> [21 pieces of orichalcum have been acquired.]  \n> [55 pieces of black iron have been acquired.]\n\nPrecious minerals. Blue orichalcum especially. You could only obtain it from the Guardian of the Forest. Priceless.\n\nFor free?\n\nJishuka grinned at his shocked expression. \"It's natural to give valuable minerals to the guild's blacksmith.\"\n\nThe Tzedakah Guild already provided Grid with materials when they requested production. He crafted items at no cost and made huge profits. He'd thought that was generous enough. But now they were giving him minerals outright?\n\nGrid was honestly impressed. Being acknowledged by others. It felt good.\n\n*Like Zhuge Liang serving Liu Bei.*\n\n\"Thank you for recognizing my value.\"\n\nJishuka blinked at his shameless confidence, then coughed. \"You're a treasure for our guild. I'll do my best to make you feel like this is the best place for you. So let's keep working well together.\"\n\n\"If you want to keep working well together, shouldn't you show your elder some respect?\" Grid gave her a pointed look. \"You're only 24, aren't you?\"\n\n\"W-What? Respect? I don't want to!\"\n\nWithin the Tzedakah Guild, Jishuka was on the younger side. She hated being reminded. She'd been accepted as master due to her leadership and excellent abilities, but commanding older members still felt uncomfortable. So she'd deliberately abandoned her age. She was only the guild leader. Not a young woman managing people twice her age.\n\nCalling Grid anything that acknowledged his seniority was impossible.\n\n\"I can't do that.\"\n\nJishuka's serious tone made Grid pause. She must have her reasons.\n\n*Or maybe she just doesn't like it. Non-Asian countries aren't tied to age like that.*\n\n\"Then please get started.\"\n\nJishuka gave him the task and returned to work. Grid stood alone, checking the Talent Search skill.\n\n> [Your insight is more than 600 points. Due to the influence of insight, Talent Search Lv.2 is activated.]\n\n> **[Talent Search Lv. 2]**  \n> Observes the hidden potential of the target.  \n> * The observation targets are limited to NPCs belonging to the estate.\n\n\"...Does this mean I have to observe everyone?\"\n\nAs a Tzedakah Guild member, Grid could access Bairan Village's information. Five hundred and fifty-six inhabitants and troops total. Did he have to observe every single one?\n\nHis annoyance lasted only a moment.\n\n*It's interesting. I don't mind.*\n\nObserving current abilities, maximum stats, and skills was pleasant. The time investment didn't matter. And if he discovered hidden potential? Twice the fun.\n\n*My insight will rise quickly while I'm observing them. Maybe I can find knight candidates.* He thought of Jude. *That guy is great.*\n\nJude was hunting frostlight orcs and gathering sylphid scales under Huroi and Romeo's leadership. Well, officially. Actually, Jude and the soldiers were undergoing special training. Grid hoped they'd return quickly with the sylphid scales. No, he hoped they'd return after getting stronger.\n\nA whisper arrived as he wandered the village, scanning NPCs.\n\n*-Youngwoo.*\n\nYura.\n\nGrid continued observing NPCs as he replied.\n\n*-Why are you so late?*\n\n*-I'm sorry. I was watching the battle of Bairan Village on the Internet.*\n\nGrid stopped walking.\n\n*-The battle of Bairan Village?*\n\n*-Yes. The first legendary class, Pagma's Descendant, appeared in public for the first time.*\n\n*-It was broadcasted on the Internet?*\n\n*-The Internet and TV. The whole world is in an uproar right now. It's surprising. I never thought Pagma's Descendant would belong to your guild.*\n\n*At least they don't know it's me.*\n\nHe'd been conscious of the users in Bairan Village. Hidden his face and ID. Yura continued.\n\n*-Are you in Bairan Village? I want to see the pet you mentioned.*\n\n*-You're coming here?*\n\n*-I'd like to try finding out who Pagma's Descendant is.*\n\n*-Aren't you Yatan's Eighth Servant? You think our guild will let you in?*\n\n*-I'll hide my ID. It won't be dangerous unless you reveal my identity.*\n\n*-Why do you think I won't reveal your identity? Why do you trust me?*\n\n*-Don't you and I have a secret relationship? We have a cooperative relationship. I won't act hostile toward you.*\n\n*-Don't misunderstand. Anyway, fine. I can't leave this place for a while, so it's better if you come here.*\n\n***\n\nWinston.\n\nIrene was informed that Bairan Village had been ravaged. She rose to her feet.\n\n\"Gather the soldiers and technicians. We're going to help with Bairan Village's restoration. We leave immediately.\"\n\nPhoenix stepped forward. \"Will My Lady go herself?\"\n\n\"My husband is suffering. Shouldn't his wife help?\"\n\n\"But the road to Bairan Village is dangerous. Monsters. Winston can't be left empty, so is it wise for you to go?\"\n\n\"We can leave Valdi in charge of Winston.\"\n\n\"Administrator Valdi can't handle the current workload. He's still recovering from being attacked by the Yatan Church—\"\n\n\"Shut your mouth!\"\n\n\"...My Lady?\"\n\n\"I am lonely!\" Irene's voice cracked. \"I can't sleep because I think of him every night! I want to have a child soon! Do I have to say anything else?\"\n\n\"I have sinned greatly.\" Phoenix dropped his head. \"Please kill me.\"\n\nAn old man who couldn't understand his lady's heart.\n\nIrene made her decision. As soon as the knights were prepared, she departed."
}