{
  "id": 157,
  "title": "Chapter 157",
  "content": "# Chapter 157\n\nThe notification hit him after he'd scanned the thirty-ninth resident.\n\n> [Insight has increased by 1.]\n\nGrid felt the fifth tick upward and smirked. \n\n*The Commander's Sword gives better detail, but this Talent Search bullshit levels Insight faster.*\n\nHis eyes tracked a young man patching holes in the wall.\n\n\"Talent Search.\"\n\n> [You have discovered the target's abilities, skills and potential.]\n>\n> **Name:** Ian  \n> **Age:** 27 **Gender:** Male  \n> **Occupation:** Miner  \n> **Level:** 33  \n> **Strength:** 45/115 **Stamina:** 69/138  \n> **Agility:** 21/80 **Intelligence:** 48/81  \n> **Skill:** Pickaxe (C)\n>\n> *A young miner in Bairan Village.*\n>\n> * A very ordinary person. You have failed to discover any hidden talents.\n\nGrid leaned against the wall, processing the data.\n\n*Jude is actually brain-dead.*\n\nForty residents checked. Not a single one had worse Intelligence than that moron. Every other NPC bottomed out at 80 maximum potential—**80**. But Jude? Maximum of 20. Current stat sitting at 11.\n\n*Makes him easier to control, I guess. Still pathetic.*\n\nFootsteps approached—heavy, deliberate. A man built like a brick shithouse walked up and spat onto the dirt.\n\n\"Kyaaack—*ptoo*!\"\n\nGrey hair spiked up like he'd been electrocuted. All muscle and feral eyes. Toon. Rank 35 on the unified rankings. Rare hidden class. The guy handed <span class=\"rarity-unique\">Dainsleif</span> back.\n\n\"Can't buy it.\" Toon's voice was flat.\n\nGrid frowned. \"Why not? It's Unique rated, but the performance rivals Legendary gear. Attack power's slightly lower than same-level Legendary items, sure, but the options are better. Four million gold is fair market value.\"\n\nToon's face twisted. \"I **know** it's good. I **want** it. But I'm not dropping four million gold I don't have.\" He spat again. \"Kyaaack—*ptoo*!\"\n\n\"You're rank 35. Shouldn't you be raking in cash from TV appearances? CFs? Every guild member does that. Jishuka makes a fortune spending half a day posing for magazines.\"\n\n\"...That's...someone else's story...\" Toon mumbled.\n\n\"What?\"\n\n\"**I don't get broadcast or CF offers!**\" Toon's voice cracked with frustration. \"I make money through **hunting only**! Ten thousand gold a week!\"\n\nGrid did the math. Ten thousand gold equaled twelve million won. Twelve million won weekly sounded massive to normal people, but for a ranker? Useless. Items with level 250+ requirements cost **at least** 400,000 gold for Epic-rated gear. At this rate, Toon would fall behind, unable to afford proper equipment. His ranking would nosedive.\n\nToon rubbed his neck. \"I was a swordsman before the rare class. Got Sword Mastery. But I've used wrist blades for years—that's what feels **right**. If Dainsleif was a wrist blade, I'd buy it on credit. I'm not stupid enough to go into debt for a greatsword.\"\n\n\"Fair enough.\"\n\nToon glanced at the weapon in Grid's hands. \"Why'd you trust me with this? I could've run off. We met **once**, and I was a dick to you. How do you hand over an item worth millions to a guy like me?\"\n\nCold realization crawled down Grid's spine.\n\n*I'm an idiot.*\n\nYura. The Tzedakah Guild. Every ranker Grid had met was **loaded**. They appeared on TV constantly, money pouring in from interviews, photo shoots, endorsements. So Grid had assumed: *rankers are rich, rich people don't steal.*\n\nBut Toon wasn't rich. If he'd wanted to steal expensive gear, what would've stopped him?\n\n*And rich people steal anyway. I got too comfortable. Too much has been going right lately—I let my guard down.*\n\nLucky Toon had a conscience, or Grid would be out four million gold. He made a mental note to tighten up. But looking at Toon now...the guy **had** returned it.\n\n*That counts for something.*\n\nGrid crossed his arms. \"If you find good production methods or materials while hunting, bring them to me. I'll craft items for you at a discount.\"\n\n\"...What?\"\n\nToon stood frozen.\n\nHe'd been an orphan in Italy. Life had beaten him down until the mafia felt like the only option. Five months in the organization—lucky he never killed anyone, but he'd done **plenty**: blackmail, drugs, gun trafficking. Then Satisfy launched. Something about it made him question everything. *Why hurt people when this exists?*\n\nHe'd left the organization. Cost him his left eye.\n\nSince then, Toon had clawed his way into the rankings, but his temper stayed broken. He fought users constantly. No friends. Notorious.\n\nJoining the Tzedakah Guild changed things. Jishuka kept his violence in check. For the first time, he could play the game without self-destructing.\n\nBut this? Someone offering him a favor with **no strings attached**? That had never happened. Not in Satisfy. Not in **life**.\n\n*Grid...*\n\nToon had assumed Grid hated him like everyone else. But here he was, extending a hand.\n\nThe word \"legendary\" suddenly made sense. Not just the class—the **person**.\n\nToon bowed his head. \"The other day, I disrespected you. Insulted your workshop. I'm sorry. And...thank you.\"\n\n\"Then fix your behavior. First step: stop spitting. You look like a thug.\"\n\n\"Yeah. I'll work on it.\"\n\nToon's face—normally locked in a scowl—cracked into something close to a smile. Awkward, but genuine. \"I need to get back to work!\"\n\nHe jogged off with lighter steps.\n\nGrid watched him go, eyes gleaming.\n\n*Simple guy, just like Regas said. One small gesture and he's this grateful. Long-term investment paid off.*\n\nToon would bring production methods and materials. Grid would gain recipes for free, level his production skills, and pocket a \"small tip\" for the crafts. Toon got cheap gear. Grid got profit and loyalty. Two birds, one stone.\n\n*I'm actually smart now.*\n\nGrid had the thinking power of an **average** person. He was proud of himself for reaching baseline competency.\n\n*The Neberius raid was broadcast. Everyone knows about the pavranium.*\n\nThe original plan: enter the pet marathon with pavranium disguised as Yura's pet. But the world now knew the golden construct belonged to Pagma's Descendant. Should he scrap the marathon plan?\n\n*No. Not necessary.*\n\nGrid's mouth curled into a grin.\n\nHe headed for the smithy.\n\n---\n\n\"**Ohh!** Welcome, Grid!\"\n\nSmith hammered at a blade near the forge, crafting weapons for the administrator's soldiers. He straightened up, beaming. \"You saved Bairan Village! I speak for everyone here—**thank you**! You're a hero!\"\n\nThe word buzzed in Grid's chest. He walked over and clapped Smith on the shoulder.\n\n\"Not just a hero. An **almighty** hero.\"\n\nGrid activated the skill.\n\n\"Blacksmith's Affection.\"\n\n> **[Blacksmith's Affection]**\n>\n> If you have maximum affinity with an NPC blacksmith, you can raise their skill level by 1~5 levels.\n>\n> The blacksmith who received your teachings will be loyal to you for life and will share every new item production method they learn.\n\n> [Smith's **Advanced Blacksmith's Craftsmanship** has reached Level 4.]\n\n\"**Heok—!**\"\n\nSmith's eyes went wide. Power surged through him, knowledge crystallizing in his mind. He lunged forward and wrapped Grid in a bear hug. \"**Thank you!** I can create my life's masterpiece now—and you've given me enlightenment on top of that! For you, I'd even **lick your ass**!\"\n\n\"**Get off me!**\"\n\nGrid shoved him back.\n\n*Lick my ass?* Could be an expression. Could mean *I'll do anything for you.* But Grid **knew** Smith was gay. A gay man saying that? Nope.\n\n\"You married yet?\"\n\n\"Married? At my age...?\"\n\n\"Get married. Drop the weird tendencies. And let me use your equipment.\"\n\n\"W-Weird tendencies...? Y-Yes, of course. Use whatever you need. The whole smithy is yours.\"\n\nGrid ignored him and moved to the furnace. He pulled out the **Legendary Blacksmith's Hammer** and began smelting pavranium.\n\n*Time to change the form.*\n\nRight now, the pavranium existed as two small golden discs. The entire world associated those discs with Pagma's Descendant. But if he transformed their shape, that association would break.\n\nGrid heated the god-metal until it glowed.\n\n*Let's see them connect the dots after this.*\n\n---\n\n**Glossary of Common Korean Terms:**  \nOG: Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to unedited chapters and goals for extra chapters. Early access chapters update after daily releases finish."
}