{
  "id": 159,
  "title": "Chapter 159",
  "content": "# Chapter 159\n\n*I'm losing my mind.*\n\nThree days ago, Jishuka had given Grid a job: find talented people in Bairan. At first, he'd enjoyed it. Observing residents with Talent Search while raising his Insight stat had been satisfying work. Simple. Productive.\n\nThen Irene arrived.\n\nShe'd led troops north under the pretext of aiding reconstruction, and for three days straight, she hadn't left his side. Grid couldn't move freely through the village anymore. He was trapped.\n\n\"Grid... don't you think you're overdoing it?\" one of the guild members muttered as he passed.\n\n\"Wow, the quality of that repair,\" another whispered.\n\nGrid sat outside the temporary smithy, repairing and appraising gear for Overgeared members. Every passerby stopped to stare. Not at his work. At Irene.\n\nShe stood beside him, pulling out a handkerchief whenever sweat beaded on his forehead. She fed him snacks at regular intervals. When bored, she hummed softly to herself.\n\nA beautiful woman with porcelain skin, full lips, large eyes, and elegant gestures treating Grid like royalty. The male guild members couldn't hide their jealousy.\n\n*Did that bastard save a country in his past life? How did he land a woman like that?*\n\n*I'm more envious of Irene than his legendary class. God, I want to die.*\n\n*I'd obtain the heart of the dragon Trauka for her. I'd do anything.*\n\n*They're married. They sleep together. Grid took her purity... that lucky son of a—*\n\nThe hostile stares pressed against Grid's back like needles. He set down his hammer.\n\n\"I need a break.\"\n\n\"Good idea.\" Irene rose when he did. Her blue eyes shone. \"You've been working since dawn. You must be exhausted. Let's get you to bed.\"\n\n\"No. I don't need a nap.\"\n\nUsers only slept in Satisfy to recover health or stamina quickly. Right now, both of Grid's bars were full. He just wanted to escape the smithy for a few minutes, away from his guild members' murderous glares.\n\nIrene pressed forward. \"No. You must rest. Don't you know that proper sleep is the secret to good health? Come. It's time for your nap.\"\n\nHer insistence was strange. Over the past three days, she'd been relentless about bedtime. Morning, afternoon, night. She pushed him toward the bedroom at every opportunity.\n\n*Why does she keep trying to make me sleep?*\n\nGrid frowned at her. \"Be honest. What do you want from me?\"\n\n\"Huh?\"\n\nIrene's eyes widened. Grid stepped closer, backing her against the smithy wall. He leaned in.\n\n\"Do I need to repeat myself? What's the reason?\"\n\n\"T-That...\" Her pale face flushed crimson. She turned her head away, unable to meet his gaze. \"How annoying. Why do I have to say it out loud?\"\n\nHer voice came out weak and small.\n\nGrid felt a stab of guilt, but he didn't back down. He needed an answer.\n\n\"Yes. You have to say it.\"\n\nTears welled in Irene's eyes. Her face burned with embarrassment.\n\n\"Sob... Husband, are you the type of man who... who commands women to say shameful things...? Sob...\"\n\n\"Irene? Why are you crying?\"\n\nGrid jerked back, glancing around in panic.\n\n*I'm screwed.*\n\nAnyone watching would think he was the garbage husband making his beautiful wife cry in public. While Grid froze, unsure what to do, Irene bit her lower lip. Then, like a kitten begging for food, she looked up at him.\n\n\"I want to have a baby.\"\n\n\"A baby? Okay, I'll get you one right away, so stop crying— Huh? B-Baby?\"\n\nGrid stumbled backward. Irene ran forward and hugged him. She pressed her face against his chest.\n\n\"I want a baby boy. Give me a baby.\"\n\n\"Wow...\"\n\nGrid's mind went blank.\n\n*Is she serious? Am I understanding this correctly?*\n\nIrene had wanted children from the beginning. After their first night together, she'd declared to Earl Steim that she would bear several heirs. But he hadn't expected her to be so... aggressive. In broad daylight.\n\n*This is completely... No, isn't she too direct?*\n\nIrene was the synonym of gentleness. Yet here she was, acting like this. Grid blinked at her. She drove the point home.\n\n\"Why aren't you answering? Am I not... attractive enough for you?\"\n\n\"Attractive?\"\n\n\"I want... Dear husband, I want your—\"\n\n\"Don't say anything else.\"\n\nGrid couldn't stand hearing those words from Irene's pure face. He covered her mouth with his hand. Heat surged through his chest.\n\n*This is inappropriate.*\n\nWas he disappointed? Hell no. She was even more adorable. A beautiful woman wanted him this badly. His self-esteem as a man skyrocketed.\n\n\"Let's go.\"\n\nGrid bent down and scooped Irene into his arms. The classic princess carry.\n\n\"Oh my.\" Irene looked surprised, then pleased. She smiled shyly and buried her face in his chest. Grid grinned and started running toward their quarters.\n\n\"What? Why is he in such a hurry?\"\n\n\"Is Lady Irene injured?\"\n\nGuild members called out as Grid sprinted past, but neither he nor Irene heard them. Right now, nothing else existed.\n\n\"Dear husband... come here.\"\n\nThey reached the bedroom. Irene sat on the bed, arms spread wide to welcome him.\n\nGrid swallowed hard. \"Irene...\"\n\nHe moved toward her, drawn by the sight of her slender limbs. Then he stopped.\n\n*I can't respond.*\n\nIt wasn't just Irene who wanted this. Grid had a strong desire for her. But Satisfy's system restricted sex to once a month. To enforce this, the game suppressed user arousal by controlling brainwaves. It reduced physical responses. Grid wanted Irene with all his heart, but his body refused to cooperate.\n\n*The demon who designed this system...*\n\nTears ran down his face.\n\n\"Dear husband...?\"\n\nIrene looked alarmed. Grid had started crying.\n\n\"I'm just so happy.\" Grid forced a smile to reassure her. \"I can't help it.\"\n\nHe walked up to the bed and sat beside her. Then he started applying techniques 21 through 35 from *100 Techniques to Satisfy Women*, the manual he'd been studying.\n\n\"I'll make sure you're satisfied.\"\n\nGrid's long, thick fingers began to move. After the Guardian of the Forest raid and crafting Failure and the Wave Armor, his Dexterity stat had climbed higher than during their first night. His manual technique had entered the realm of legend.\n\n\"Ahh...\"\n\nIrene let out a beautiful sound. She trembled like a finely tuned instrument.\n\nThe bedroom filled with hot, rapid breathing...\n\n[Content Omitted]\n\n***\n\n\"Husband, I understand you're a great man with many responsibilities. But don't forget that Winston is your home. Please return soon.\"\n\nThanks to Grid's efforts, Irene had satisfied her pent-up desires. She'd finally regained her composure.\n\n\"I'll head back now.\"\n\nBetween the Overgeared Guild's work and Irene's assistance, Bairan had been restored to a functional state. Irene decided her help was sufficient. She gathered her troops and prepared to return to Winston. The guild members watched her depart.\n\n\"Doesn't Lady Irene seem even more beautiful than when she first arrived?\"\n\n\"I originally thought Jishuka was prettier, but now I'm not so sure.\"\n\nRegas smiled warmly. \"A woman in love blooms like a flower. Grid makes her happy every night, so naturally she's radiant.\"\n\n\"What?\"\n\nThe other guild members turned on Grid with indignation.\n\n\"Grid, you beast! That bastard touched the pure Lady Irene?\"\n\n\"That woman, of all people! I can't believe it!\"\n\n\"He's her husband! Is it okay for a husband to be like this?\"\n\nGrid scowled at them. \"I literally used my hands. Now shut up.\"\n\nSilence.\n\nThere was still a fortnight remaining on his penalty. Until then, he needed to avoid Irene as much as possible. If they met, he'd use his hand techniques to satisfy her and survive the crisis.\n\nGrid left the smithy, enjoying his newfound freedom. He resumed examining the residents, but days passed without finding any talent. That day, the next day, the day after that.\n\n*I've observed over four hundred people and found nothing. Is there actually a talented person here?*\n\nThe outer walls had been fully restored. Now residents scattered across the village to repair buildings. Grid followed them around, using Talent Search on everyone he could. His Insight and Persistence stats rose steadily. It was satisfying and educational, but anxiety gnawed at him.\n\n*If I've been searching for days and find no one, did I waste all this time? I don't like that thought.*\n\nGrid examined the village with his Ruler's Sword and turned his attention toward a small mountain behind Bairan. The same mountain where he'd mined iron ore during his minus-level days.\n\n*The special products of Bairan are jaffa and iron. Most villagers are miners.*\n\nWeapons were needed to rebuild the garrison. Iron was needed to forge weapons. Jishuka had sent some residents to the mine instead of assigning them to reconstruction work, prioritizing security over speed. Maybe a talented resident was hiding inside the mine.\n\nGrid climbed the mountain. What had been a grueling trek at minus level was now an easy jog. He reached the mine entrance in minutes.\n\nCLANG. CLANG.\n\nTwenty miners swung pickaxes inside the shaft. Grid gripped his Ruler's Sword and observed them one by one. Among the old, weathered faces, he spotted a boy around fifteen years old. Above the young miner's head, something like a gold star blinked.\n\n*That's him.*\n\nExcited, Grid activated Talent Search.\n\n> **Name:** Minor  \n> **Age:** 13 **Gender:** Male  \n> **Occupation:** Miner  \n> **Level:** 23  \n> **Strength:** 64/450 **Stamina:** 89/608  \n> **Agility:** 51/200 **Intelligence:** 98/420  \n> **Skills:** Fantastic Pickaxe Technique (S), Minerals Master (S+), Talent will Reveal Itself (SS)  \n> \n> A boy who has held a pickaxe since the age of five, following in his father's footsteps. Despite his youth, he collects minerals as efficiently as miners with twenty years of experience.\n> \n> The villagers believe this boy will someday surpass the legendary miner, Gis.\n> \n> *A prodigious talent. If nurtured properly, he will represent his nation in this field.*\n\n*Incredible.*\n\nConsidering that ordinary people maxed out around 100 stat points, Minor's potential was absurd. His current stats were exceptionally high for his age and level.\n\n*And all his skills are S-grade or higher.*\n\nBetter yet, a miner paired perfectly with a blacksmith. Grid checked the skill details. The Ruler's Sword was a superior version of the Commander's Sword, allowing him to view complete information on a target's abilities.\n\n> **[Fantastic Pickaxe Technique]**  \n> Rating: S  \n> A talent found in one person per 100,000.  \n> Collect minerals at exceptional speed. All minerals collected will be above minimum grade.\n\n> **[Minerals Master]**  \n> Rating: S+  \n> A talent found in one person per 1,000,000.  \n> Intelligence determines knowledge of mineral types, properties, and spawn locations worldwide.\n\n> **[Talent will Reveal Itself]**  \n> Rating: SS  \n> A talent found in one person per 10,000,000.  \n> No matter how you try to hide, your talent will be obvious to others. You are destined to be scouted repeatedly. You will receive many temptations.  \n> Stat growth is exceptionally fast. You will become arrogant.\n\nThe final skill was annoying, but Grid didn't care. He walked up to Minor and spoke.\n\n\"Starting today, you're following me.\"\n\nMinor stopped mid-swing. The pickaxe lowered. He turned to face Grid, frowning.\n\n\"You're the hero who saved the village. The husband of Lady Irene. I know your reputation. You're a great person.\" Minor set his pickaxe against the wall. \"But I don't know if you're suitable to be my master. If you want to recruit someone talented, shouldn't you show proper sincerity? Shouldn't you pay the price?\"\n\nMinor understood his own value. Throughout history, kings visited talented individuals personally to extend invitations. Grid should demonstrate respect.\n\nBut Grid was fundamentally blunt. His frown deepened. He reached out and rapped Minor's head with his knuckles.\n\n\"Gah!\"\n\nMinor felt sharp pain lance through his skull. He couldn't even scream. He grabbed his head and collapsed, rolling on the floor.\n\nGrid spoke cheerfully. \"You brat. You don't know who I am. Hey, what does it matter how talented you are? You've still got a long way to go. Just follow me. Study under me. Grow. Once you've matured enough, we can revisit the terms of this contract.\"\n\n\"Yes...\" Minor's voice came out small.\n\nGrid's current Dignity stat, combined with the options from the Holy Light Crown and Ruler's Sword, totaled close to 700 points. No matter how talented, Minor was just a young boy. He was overwhelmed by Grid's presence.\n\n\"I'll follow you.\"\n\n\"Good decision.\"\n\nA future minerals detector had fallen into Grid's hands. Grid never imagined there would come a day when he'd need to enter a dragon's lair to obtain minerals because of this damn detector.\n\nBut that was a problem for another time."
}