{
  "id": 16,
  "title": "Chapter 16",
  "content": "# Chapter 16\n\n> [You are now Level 1. Your stats, which were fixed to minimum due to the minus level penalty, have been restored to their normal state.]\n\n> [The basic stats of Pagma's Descendant have been applied.]\n\nGrid's pulse hammered against his ribs.\n\nThe notification windows hovered before him, casting pale light across the smithy's soot-stained walls. His fingers trembled as he reached up, hesitating for just a moment before swiping to open his status window.\n\n> **Name:** Grid  \n> **Level:** 1 (45/100)  \n> **Class:** <span class=\"rarity-legendary\">Pagma's Descendant</span>  \n> \n> * The probability of adding additional options when making items will increase.  \n> * The probability of item enhancement will increase.  \n> * All equipment items can be worn unconditionally. However, there will be a penalty depending on the rating of the item.  \n> \n> **Title:** One who Became a Legend  \n> \n> * Abnormal conditions don't work well on you.  \n> * You won't die when health is at the minimum.  \n> * Easily acknowledged.  \n> \n> **Health:** 280/280 **Mana:** 75/75  \n> **Strength:** 20 + 5 **Stamina:** 18 **Agility:** 12 **Intelligence:** 25  \n> **Dexterity:** 50 **Persistence:** 16  \n> **Composure:** 10 **Indomitable:** 11 **Dignity:** 10 **Insight:** 10  \n> \n> **Stat Points:** 40  \n> \n> **Weight:** 3,035/820  \n> \n> * The weight limit exceeds 200%, so movement speed is reduced by 100%.  \n> * The body is heavy and cannot exert any power properly.  \n> * The probability of receiving the 'weakened' state has become really high.\n\nGrid stared at the numbers.\n\n*A dream?*\n\nHis hands dropped to his sides. No panic rose in his chest. If he'd been in the real world, he would've pinched himself until his skin bruised. Instead, he calmly opened the menu and logged out.\n\nThe capsule's interior lighting flickered on. Grid lay still, staring at the curved ceiling above him. His breathing was shallow, controlled.\n\n*I fell asleep. That's all. I didn't switch to sleep mode.*\n\nThat had to be it.\n\nHe climbed out of the capsule and stumbled to the bathroom. After relieving himself, he twisted the faucet and thrust his head under the stream of cold water. The shock of it drove the haze from his mind. Water dripped down his neck as he returned to his room, soaking into the collar of his shirt.\n\nHe logged back in.\n\nThe smithy materialized around him. Same soot-stained walls. Same cluttered workbench. He hadn't moved an inch.\n\n*It wasn't a dream. Don't get your hopes up. Don't.*\n\nUnlucky people like him didn't get miracles. Every time he'd dared to hope, the world had crushed him a little deeper into the dirt. He opened the status window with numb fingers.\n\nThe numbers hadn't changed.\n\n\"An amazing jackpot,\" he whispered.\n\nHis heart slammed against his ribs again, faster this time. The pounding rhythm filled his ears.\n\n\"Wow...\"\n\nGrid knew the numbers by heart. A Level 1 character started with 6 Strength, 7 Stamina, 4 Agility, and 5 Intelligence. Twenty-two total stat points. That was the baseline for every single player in Satisfy.\n\nHis hands shook as he tallied the numbers again.\n\nPagma's Descendant gave him **165** base stat points. Add the 16 Persistence he'd ground out during his nightmare in the minus levels, plus the 1 Indomitable, and the total reached **182 points**.\n\nHe did the math three times to be sure.\n\n*I have more stats than a Level 15 player. At Level 1.*\n\nThe sheer weight of the advantage made his head spin. A legendary class wasn't just different. It was overwhelming.\n\nBut that wasn't all.\n\nHis gaze locked onto the **40 Stat Points** waiting to be distributed.\n\n*Why do I have stat points at all?*\n\nThe system granted 10 points per level. At Level 1, he should have zero unallocated points. Grid's mind raced through possibilities, discarding theories until only one explanation remained.\n\n*I gained stat points even while leveling up through the minus levels.*\n\nHe'd been Level -3. Climbing from -3 to 0 meant passing through four level thresholds. Four times ten equaled forty.\n\nGrid rubbed his eyes until they stung. The number didn't disappear.\n\nHis body began to shake.\n\n*My time in the minus levels wasn't wasted. It wasn't.*\n\nEvery humiliating death. Every grueling hour. The despair of watching his level drop below zero. It had all mattered. Maybe, just maybe, his luck wasn't as rotten as he'd thought.\n\n\"Kuk. Kukuk...\"\n\nThere were no words for this feeling. His throat closed up. All he could do was laugh.\n\n\"Puhahahahahat!\"\n\nThe sound burst out of him, loud and uncontrolled. Other players in the smithy glanced over, then quietly left. Grid didn't care. His stomach ached from laughing. Tears leaked from the corners of his eyes.\n\n\"Hehe! Keke! Puha...! Urghh...\"\n\nSmith stepped closer, staring at him with an odd expression. The NPC raised his thumb. \"This is a hero's excited laugh! You are such an outstanding figure that I don't know how I mistook your identity yesterday. My vision was lacking. I am ashamed and embarrassed.\"\n\nGrid blinked away the moisture in his eyes.\n\n*A hero? He thinks I'm a hero?*\n\nIt made sense, in a way. He'd completed two quests in Bairan Village. His reputation here exceeded 200. The title **One who Became a Legend** had the attribute **Easily Acknowledged**. All of that should raise NPC affinity.\n\nBut Smith's reaction went beyond that. The blacksmith wouldn't meet his eyes. His posture was deferential, like a student before a master.\n\n*Is this the Dignity stat?*\n\nGrid checked his status window again. Dignity sat at 10 points. A pittance. Yet Smith clearly felt its effect.\n\n*Against high-ranking NPCs, it probably means nothing. But for ordinary NPCs like Smith, even 10 points changes everything.*\n\nHe'd never imagined a stat could alter NPC behavior so drastically. Yesterday, Smith had barely tolerated his presence. Today, the man looked ready to bow.\n\nGrid forced himself to take a breath.\n\n*Calm down. Think carefully.*\n\nHe'd spent the past few days acting on impulse, stumbling from one disaster to the next. Now that things were finally improving, he couldn't afford to be reckless. One wrong move could unravel everything.\n\n*I have massive stats at Level 1. There's no reason to rush and distribute these points.*\n\nHe needed to prioritize.\n\n\"Money!\" The word burst out of him.\n\nSmith flinched.\n\nGrid stepped closer. \"When I first visited your smithy, I told you what I needed. High-demand items. Things that will sell for maximum profit. What should I make?\"\n\nSmith turned and pointed toward a rack displaying bundled arrows.\n\n\"This one.\"\n\nGrid's enthusiasm deflated. \"An arrow?\"\n\nArrows were consumables. Cheap. Even if the profit margin was decent, the low sale price meant he'd have to churn out huge volumes. His shoulders slumped.\n\nSmith must have read his expression. The blacksmith pulled one of the arrows free and held it up to the forge light. \"This isn't an ordinary arrow. It's a <span class=\"rarity-uncommon\">Jaffa Arrow</span>, made by mixing a small amount of jaffa with steel. It ignores some of the enemy's defense.\"\n\n*Ignores defense?*\n\nGrid straightened.\n\nThe Guardian of the Forest raid was ongoing. Archers participating in that nightmare would pay premium prices for anything that could pierce golem armor. Even players not in the raid would want these. The Grey Forest crawled with golems.\n\n\"Jaffa.\" Grid tasted the unfamiliar word.\n\nSmith ducked into the back room and returned carrying a chunk of light purple mineral. He set it on the workbench. \"Jaffa has low oxygen content, making it easy to smelt. It's superior to iron in several ways. The weakness is durability. You can't forge a weapon from pure jaffa. But when mixed with steel, the durability problem vanishes and the penetration power becomes extreme. Cavalry troops arm their spears with jaffa tips for a reason.\"\n\n\"How expensive is it?\"\n\n\"Two gold per kilogram.\" Smith tapped the mineral with one knuckle. \"Even top-tier iron ore looks like cheap gravel next to this.\"\n\nGrid winced. \"Then how can you afford to produce dozens of arrows?\"\n\n\"Because you only need a small amount per arrow. The production cost is three silver. The sale price is fixed at six silver.\" Smith's mouth curved into a slight smile. \"Double the profit. And this village has high demand. Do you want to learn how to make them?\"\n\nYesterday, Grid would have nodded without hesitation. The appraisal skill could grant him instant understanding. But today was different. He needed to confirm his assumptions.\n\n\"Let me see the arrow.\"\n\nSmith handed it over.\n\nGrid activated his appraisal skill.\n\n> **[Jaffa Arrow]**  \n> Rating: Normal  \n> Attack Power: 20~26  \n> \n> An arrow made by mixing a small amount of jaffa with steel.  \n> Due to the effect of combining jaffa with steel, it has extremely high penetration and ignores some of the enemy's defense.  \n> \n> Weight: 0.1  \n> \n> [A hidden function doesn't exist.]  \n> \n> [You have grasped the Jaffa Arrow's material composition, production method, and intentions of its creator.]  \n> \n> [Your understanding of the Jaffa Arrow is now at 89%. You will be able to use the Jaffa Arrow skillfully.]\n\nGrid stared at the notification.\n\n*Only 89%.*\n\nThe production method hadn't unlocked. He needed 100% understanding for that. His fingers tightened around the arrow shaft.\n\n*I could use the disassembly skill. That might push me to 100%. But this arrow costs six silver.*\n\nSix silver to destroy. He couldn't afford to waste money like that. Not when he still needed funds for a carriage to the next town.\n\n*Learning it normally isn't the worst option.*\n\nHe met Smith's expectant gaze. \"I'll learn how to make it.\"\n\nSmith's face brightened. \"I thought so. First, let's start with smelting the mineral.\"\n\nThe blacksmith launched into a detailed explanation of furnace structure. He covered the elements required for proper smelting, the principles behind temperature control, the chemistry of combining metals. Technical jargon peppered the lecture. Terms like \"carbon bonding\" and \"flux ratios\" came up repeatedly.\n\nGrid followed along without much difficulty.\n\nSatisfy pursued realism, but it was still a game. The developers kept the barrier to entry low enough that anyone could learn. The blacksmithing knowledge required here wasn't much more complex than what other classes needed for their skills.\n\nBesides, he'd prepared. After his double-death penalty locked him out of the game yesterday, he'd spent hours researching blacksmithing techniques. Smith's explanations matched what he'd read almost exactly.\n\n*Preparation matters. Review matters.*\n\nOne of his middle school friends had drilled that lesson into him. The guy had been obsessive about it, studying for hours every night.\n\n*But he never made it past second place in high school.*\n\nGrid remembered the bitter frustration on his friend's face. No matter how hard the guy worked, there was always one classmate ahead of him. Some genius who claimed he \"only studied during class\" and still topped every exam.\n\nOn the day the final semester results came out, Grid had found his friend on the school rooftop, shouting at the sky: \"Why did a genius have to be born in the same year as me?\"\n\nThere were always people you couldn't catch. Talent you couldn't match, no matter how much blood and sweat you poured into the effort.\n\n*But now things are different.*\n\nGrid's hand tightened into a fist.\n\nHe had a legendary class. This time, he'd be the one standing at the top. He'd achieve everything possible.\n\nAnd no one would look down on him ever again."
}