{
  "id": 160,
  "title": "Chapter 160",
  "content": "# Chapter 160\n\nBairan Village had risen from the ashes of war, now bustling with more life than ever before.\n\nThe Tzedakah Guild's televised battle had created a wave of new fans. Some tried to hunt for clues about Pagma's Descendant, but the videos revealed nothing useful. Grid's actual residence was Winston, not Bairan. Spying here was pointless.\n\nVantner leaned back in his chair, arms crossed. \"If the current trend continues, the population will exceed 12,000. It's expected to steadily increase in the future.\"\n\n\"12,000?\" Zednos frowned. \"Can the size of this village accommodate that many people?\"\n\n\"We need to expand the scale of the village by raising our internal affairs.\" Lauel tapped the table with one finger. \"But to do that, money is required, and we don't have any at the moment.\"\n\nPon adjusted his spear against the wall. \"The tax revenue will naturally increase as the population grows, so won't time solve the insufficient funds? Isn't it better to invest in internal affairs afterwards, instead of getting into debt?\"\n\n\"There is no need to be in debt.\" Lauel's eyes gleamed. \"Most of the new migrants have a very good feeling towards us. If we get our fan club to donate money to us, we will be able to grow our internal affairs faster than expected.\"\n\nVantner's face lit up. \"Oh! The women's cries filled the street whenever I walk through the village. Are they my fans? Puhahat!\"\n\n\"They can't be called fans but...\" Lauel paused. \"Anyway, you're pretty popular. It seems that people liked the appearance of you trying your best to protect Jishuka.\"\n\n\"Ohh, really?\" Vantner slapped his knee. \"There will be more requests for broadcasts in the future. I have to quickly earn money and pay Grid for the armor! Puhahat!\"\n\nThe atmosphere had shifted dramatically. When the large-scale army invaded and shattered the village, the guild had been desperate. Now they were relaxed, stronger than before.\n\nFaker broke his usual silence. \"This is all thanks to Grid.\"\n\nNo one disagreed.\n\nPon nodded. \"It was big when Regas and I were tied up. If Grid hadn't appeared on time and helped us, we would have all died. We might've managed to stop the Yatan Church if we fought hard, but the damage would've been too big.\"\n\n\"I never dreamed that Grid would make such a big difference on the battlefield when he was brought on as a blacksmith.\" Zednos shook his head.\n\n\"I thought with Grid's nature, he would ignore us when we were in a crisis.\" Regas stretched his arms. \"But he helped us. I was honestly impressed.\"\n\nLaella smiled. \"When I first saw him, Grid was incredibly selfish, but not anymore. His personality has become softer and there is some sense of fellowship. He is growing as a colleague we can depend on in the future.\"\n\n\"We should try to be colleagues that Grid can rely on.\" Pon's voice was firm.\n\n\"Of course.\"\n\nGrid's reliability and affinity with the guild members had reached its peak.\n\n*I am proud to see that Grid is being recognized.* Ibellin had admired Grid since he smashed the Giant Guild in Winston.\n\n\"Did you see the broadcast?\" Laella leaned forward. \"I watched it a few days ago and Grid really looked like the protagonist of a movie. I got goosebumps.\"\n\n\"I also saw the video.\" Rook added. \"I didn't know it at the time of the battle, but Grid was really nice on the video. In particular, the scene of him showing up to save Jishuka was fantastic.\"\n\nThe guild members sat around the big round table in Bairan Village Castle's meeting room. Their gazes turned toward Jishuka. Playful expressions spread across their faces.\n\n\"At that time, Jishuka looked different from usual.\"\n\n\"Right? She seemed to be looking at Grid like a woman. She was blushing.\"\n\n\"Master, are you attracted to Grid?\"\n\nJishuka didn't deny the giggling guild member's words. It was true that her heart started beating quickly the moment Grid saved her from death.\n\n\"He was definitely cool.\" Her voice came out small, sad. \"But he's already married.\"\n\nNobody heard her. Everyone kept talking, everyone except Faker, whose assassin class granted him exceptional hearing.\n\n*Master is finally interested in the opposite sex.* Faker gave a rare smile and changed the atmosphere. \"I heard that the blacksmith in Bairan Village has become an advanced blacksmith.\"\n\nThe topic shifted instantly.\n\n\"Ah, I heard that as well.\" Pon straightened. \"Isn't it strange? An old man who was a beginner blacksmith for decades suddenly became an advanced blacksmith in a few days?\"\n\n\"I don't know why, but it's still good.\" Vantner waved a hand. \"Thanks to that, the production speed and quality of the weapons have greatly improved, so it is easier to replenish the soldiers.\"\n\n\"An advanced blacksmith...\" Zednos stroked his chin. \"I'm looking forward to the synergy with the genius miner kid recruited by Grid a week ago.\"\n\n\"If the power of those two are added to Grid's power...\" Regas grinned. \"Kouh, it is big. The day when the guild will have the power of an army will someday arrive.\"\n\nThe Tzedakah Guild was a collection of talented people dreaming about the future. They had become the strongest guild since recruiting Grid. Their potential for growth was endless.\n\n***\n\nBairan Village's library.\n\n\"What am I doing?\" Minor's voice cracked with exhaustion.\n\nFor the past week, he had been reading 16 hours a day. He was mentally at his limit. He had never picked up a book before, and now he had to read two books a day. In the beginning, he only read books about minerals, so he was interested. But now he had to read books related to geography.\n\nMinor got up from his seat.\n\n\"I am a miner! Why does a future king's miner have to read?\"\n\nA knight noticed his shouting. \"Have you forgotten that this is a solemn place? Be quiet and study hard.\"\n\nNo matter how much of a genius he was, Minor was still just a boy. He couldn't take it. He wept.\n\n\"This is torture.\" Tears rolled down his cheeks. \"Why do I have to stay here all day reading books? Huh? Sob sob.\"\n\n\"This is Viscount Grid's command. Follow it without complaining.\"\n\nJishuka's knight had no mercy. He thoroughly performed his supervisor role. Minor's spite grew with every passing day.\n\n\"Grid, that bad man...\" He wiped his eyes. \"I will get revenge later on.\"\n\n***\n\nAt the same time, Smith's smithy.\n\n\"Why are my ears ticklish?\" Grid paused his work.\n\nHe was disassembling, reassembling, and enhancing his equipment. The <span class=\"rarity-legendary\">Holy Light Armor</span> and <span class=\"rarity-epic\">Dainsleif</span> lay on the workbench, each part carefully separated to increase his understanding.\n\nSmith approached with a frown. \"Do you need an earbud?\"\n\n\"Please act moderately.\" Grid grimaced.\n\n*Still feels insecure about Smith's tendencies. I want to leave here as soon as possible.*\n\nKaaang! Kaaang!\n\nHe kept hammering. Grid's skill at disassembling and reassembling items had improved significantly. He turned his attention toward the entrance of the smithy.\n\n\"I have completed my mission and returned.\"\n\nA Mongolian man appeared with perfect timing. It was Huroi. In the last 12 days, he had led Jude and 100 soldiers to hunt the frostlight orcs, and now he had returned. It was finally time for Grid to go back to Winston.\n\nGrid smiled at this thought and welcomed Huroi. Then he pulled out the <span class=\"rarity-rare\">Ruler's Sword</span>, which he still hadn't returned to Jishuka in the name of finding another talent.\n\n> **[Character Observation]**\n> \n> **Name:** Jude  \n> **Age:** 25 **Gender:** Male  \n> **Occupation:** Captain of Winston's 13th Hundred Man Unit  \n> **Level:** 120\n> \n> **Strength:** 1,016/2,080 **Stamina:** 490/908  \n> **Agility:** 54/330 **Intelligence:** 11/20\n> \n> **Skills:** Snatch the Enemy's Weapon and Use it as a Weapon (S). Silence (A). I have no Idea (SS-).\n> \n> A rare fool born in Winston. When it comes to strength, he doesn't fall behind anyone. He is a natural warrior who doesn't know fear.\n> \n> Unfortunately, his brain is less evolved. No matter how hard he tries, he can never climb to a higher position. It is close to a miracle that he became the captain of a hundred man unit.\n\n*He gained 17 levels and his stats increased by 280.*\n\nGrid knew the mechanics. A user gained 10 fixed stat points with every level up, while an NPC randomly gained between 6 and 20 stat points. Jude was a superb NPC who got at least 16 stat points every time his level went up. Truly dazzling growth.\n\nBut there was one annoying part.\n\n*Isn't his intelligence the same?*\n\nGrid frowned for a moment.\n\n*In the first place, his maximum intelligence is 20. He's so stupid that I won't expect anything from him. Let's check the details of his skills.*\n\n> **[Snatch the Enemy's Weapon and Use it as a Weapon]**  \n> **Rating:** S\n> \n> A talent that one person per 100,000 people will have.\n> \n> If you take advantage of a chance, you can take the enemy's weapon and use it.\n\n> **[Silence]**  \n> **Rating:** A\n> \n> The default rating of the 'Silence' skill is S-grade. However, the intelligence of the owner is so low that it is demoted.\n> \n> A talent that one person per 100,000 people will have.\n> \n> Those with this talent are very reticent and don't boast about what they see and hear.\n> \n> In general, your loyalty to your superiors is high, so it's rare for you to betray your masters. Most stewards have this skill.\n\n> **[I have no Idea]**  \n> **Rating:** SS-\n> \n> A Jude only skill.\n> \n> You are ignorant and brave. In order to fulfill your mission, you will even run into a fire pit.\n> \n> You will never feel the fear state. However, the chances of receiving other status conditions will increase by 50%.\n> \n> If you face a crisis, there is a high chance to activate the 'Fight Desperately' skill.\n> \n> **[Fight Desperately]**  \n> For three minutes, damage will be reduced by 50% and attack power will increase by 80%.\n\n*The level of the soldiers rose by an average of 8 to 10 and there are no victims.*\n\nOverall, it was a great performance. His plan to make Jude's Hundred Man Unit an elite unit of Winston had taken one step forward. Grid smiled and reached out to Huroi. Huroi thought that Grid was going to pat him on the shoulders.\n\nThat wasn't it.\n\n\"What about the sylphid scales?\"\n\nHuroi couldn't hide his sadness and searched his inventory. Then he pulled out the 28 sylphid scales that he worked hard to earn over the past 28 days.\n\n*I am finally able to create the invisibility cloak.*\n\nGrid happily collected it and said, \"As you may have noticed, the sylphid scales are items not easily traded between users. So it is difficult to determine how much to pay you.\"\n\nHis words were the truth.\n\nThe frostlight orcs weren't well known and their habitat was so cold that most users didn't hunt there. It was much more beneficial to hunt other monsters of the same level. The drop rate of the sylphid scales was also very low, so its value wasn't known.\n\nGrid meant to pay for it in a different way.\n\n\"Huroi, I heard that you obtained the Sword Mastery skill after acquiring your second class?\"\n\n\"Yes.\"\n\n\"Okay, I will make a sword for you.\" Grid nodded. \"Let's return to Winston first.\"\n\nGrid returned the <span class=\"rarity-rare\">Ruler's Sword</span> to Jishuka, said goodbye to the guild members, and left Bairan. Of course, he took Minor with him. The guild questioned Grid's strange way of educating Minor, but Grid had asked Minor to be assigned to him and they trusted him.\n\n***\n\nTime passed quickly when one was busy.\n\nFour months passed in Satisfy time, while it was time for the national competition in reality.\n\n> **『Satisfy's national competition is to be held in three days, and the number of tourists visiting South Korea is estimated to reach 800,000.』**\n> \n> **『Considering that tourists for the Olympics averages between 200,000 and 500,000, the popularity of Satisfy's national competition is well above the Olympics and the ratings will be very high...』**\n\n\"Is this the last one?\" Grid stood before a small cave in an unexplored forest. The north of the Eternal Kingdom stretched out behind him.\n\nA boy with a sharp impression, who seemed like he would become handsome when older, replied gruffly. \"Yes.\"\n\n\"Okay, you wait here.\" Grid pulled something from his inventory. It was a white <span class=\"rarity-unique\">Hooded Zip Up</span> worn by young people in modern society.\n\nAn amazing thing happened once he wore it. The man suddenly disappeared. It was a sight that seemed like a lie.\n\nBut the boy, Minor, didn't seem surprised at all. He looked tired and leaned back against the entrance of the cave.\n\nThen, after a while.\n\n**BOOM!**\n\nA huge explosion sounded from the deepest part of the cave. It was like an earthquake, causing the forest outside the cave to shake and for birds to fly into the air. Minor didn't wake up.\n\n*How much sleep is he lacking to be so deeply asleep?*\n\n\"Eek?\" The orc group that ran away with fright because of the earthquake stopped as they found Minor.\n\n\"Uwekukukrerek.\"\n\n\"Ekkukikuk? Eekuik.\"\n\n*Ssik.*\n\nThe orcs exchanged sly smiles and quietly pulled out their axes. Then they were surprised as they cautiously approached Minor.\n\n\"I can avoid the golems' gazes, but it's impossible to stop Braham's trap.\" A voice echoed from nowhere. \"It seems that Stealth is useless against it. I feel bad every time my passive disappears.\"\n\n\"Eek?\"\n\nIn front of the sleeping boy, someone's voice was heard, but there was no one there. The orcs doubted their ears and rubbed their eyes. Suddenly, a shark-shaped sword popped out of thin air.\n\n\"Kiek!\"\n\nBlood spurted from the five astonished orcs. Grid slowly appeared in front of them, wearing the <span class=\"rarity-unique\">Hooded Zip Up</span>. He whistled as he held an egg-shaped lump in his hand.\n\n\"With this, I have recovered all the pavranium in the Eternal Kingdom.\" *Okay, I should go back now.*\n\nIf he wanted to acquire all the pavranium that Braham hid around the continent, he needed to revive Braham after receiving the blessing from God Yatan. But that was currently impossible.\n\nSo Grid tried to figure out a different approach. It was to raise Minor's intelligence, maximize his minerals detection ability, and then use him to search directly for the pavranium.\n\nThese actions were enough to stimulate Braham.\n\n> **[Pagma's Descendant has started questioning my identity? Then I have to take the next step.]**\n\nSatisfy's team manager, Yoon Nahee, reported it to Chairman Lim Cheolho.\n\n\"The emergence conditions for a new legendary class, Braham's Descendant, has been achieved.\"\n\nLim Cheolho's face lit up with amusement.\n\n\"The truth that Braham is a wicked liar has finally been grasped by Grid?\"\n\n\"It seems unlikely.\" Yoon Nahee replied with an embarrassed expression.\n\n\"Hahaha! That friend is still the same.\" Lim Cheolho chuckled. \"His name is on the national competition's list, so it will be a lot of fun to watch.\"\n\n\"The person who registered his name on the list isn't him, but Yura, who is backed by the Korean government.\" Yoon Nahee shook her head. \"It is unlikely that he will participate in the national competition.\"\n\nLim Cheolho gave a meaningful smile. \"Is it really like that?\""
}