{
  "id": 161,
  "title": "Chapter 161",
  "content": "# Chapter 161\n\nSeoul Olympic Stadium opened its gates in 1984. After the expansion in 20XX, it became the world's fifth-largest arena—a concrete colosseum capable of swallowing 198,000 spectators whole.\n\nToday, every seat was filled.\n\nThe roar of the crowd rolled through the stadium like thunder. Voices merged into a single living thing—anticipation made flesh. Camera drones circled overhead, their red recording lights blinking like predatory eyes.\n\n\"The First Satisfy National Competition begins here in South Korea,\" the lead commentator's voice boomed across millions of screens worldwide. \"After two months of qualifiers and preparations, we've reached this moment.\"\n\n\"Seventeen nations earned their place,\" his co-host added. \"The qualification threshold was brutal: a minimum of ten users who ranked in the top tier of National Competition-related quests. Only seventeen countries cleared that bar.\"\n\n\"Each team fields thirteen representatives. Ten starters, three reserves.\"\n\n\"Two hundred and twenty-one athletes stand on that field right now. Average level: 213. Most are ranked within the top 500 globally. Though we've identified a few outliers—level 100 users who demonstrated exceptional skill in specific events.\"\n\n\"Let's go down to Reporter Braum for a closer look at the competitors.\"\n\n\"These athletes will battle across nine categories over the next five days: PvP, boss raid, labyrinth breakthrough, production competition, pet marathon, siege, target processing, sword drawing, and treasure hunting.\"\n\n\"Twenty-one of the top fifty rankers are here. Unprecedented concentration of elite talent.\"\n\n\"Kraugel's absence is disappointing for fans, but the other four members of the top five are all present. Seeing them together in one place is a historic moment.\"\n\n\"Analysts favor the United States for the championship. Their roster depth is overwhelming—six players in the unified top twenty. They're projected to medal across all categories. Britain and China are expected to challenge for second place. Though Pagma's Descendant's nation could be a wild card.\"\n\n\"Japan aims for top five. Meanwhile, the host nation South Korea is predicted to finish last. Their team is paper-thin beyond Yura.\"\n\n\"South Korea's participation is itself surprising. They barely met the ten-qualifier threshold. Some speculate they received special consideration as the host nation.\"\n\nBroadcasting networks from every participating country had been dissecting the competition for days. The viewership numbers made executives grin like sharks. Ratings eclipsed both the Olympics and World Cup—these days, the world lived and breathed Satisfy.\n\nThe athletes marched onto the field.\n\n*A country of Taekwondo.*\n\nThe blond man on the British team was Regas. In his teens and early twenties, he'd represented Britain in Taekwondo championships, always yearning to visit Korea—the birthplace of the art that defined him. The opportunity never came. Now twenty-six, he finally stood on Korean soil.\n\nJishuka's eyes scanned the South Korean delegation with predatory focus.\n\n*Where is he?*\n\nShe hadn't come here for the Brazilian government's frantic recruitment efforts. Guild management and leveling had consumed her schedule—she'd turned down the National Competition initially. But the chance to see Grid changed everything. The man who first made her heart race like a war drum. Yet no matter how many times her gaze swept the Korean team, she couldn't find him.\n\n*His name isn't on the roster.* Her jaw tightened. *Did I fly to South Korea for nothing?*\n\nMeanwhile, a Spanish player stepped forward. Pon raised his hand, receiving the oath on behalf of all participants.\n\n*Shame Kraugel isn't here.* His fingers flexed around an invisible spear. *I'll test myself against Zibal instead.*\n\nFour months of grinding with Grid's equipment had transformed the Tzedakah Guild. Jishuka, Regas, and Pon all cracked the unified top fifteen. Confidence ran hot in their veins. Korea was Grid's nation—surely they'd rank high. That's what they believed.\n\nBut outside their small circle, no one spared the Korean team a second glance. Why worry about a roster of sub-rankers propped up by a single star?\n\n\"Thank you.\"\n\nThe American man in his early thirties—blonde hair pulled back in a tight ponytail—finished reciting the oath.\n\n\"WAAAAHHHHH!\"\n\nTwo hundred thousand voices exploded. Feet hammered the stadium floor, a drumbeat that shook the bones. The heat surpassed any Olympics. A competition offering both glory and fortune in equal measure had begun.\n\n---\n\nFire stone.\n\nThe name of an ore containing fierce heat, as if a volcano's heart had crystallized. High affinity with flame. Essential for forging fire-attribute magic swords or armor that could withstand infernos. Certain bosses dropped them—rarely—when their corpses cooled.\n\nToban needed them for his Fire Shield.\n\n\"Hey, Toban.\" Grid studied the production method and material list, then his face twisted. \"Why are you dumping the job of finding fire stones on me?\"\n\nToban shifted his weight. \"Finding them is beyond my abilities. I thought... Minor has the Minerals Master skill. Maybe he could locate a source.\"\n\n\"So what if he finds them?\" Grid's eyebrow climbed. \"You expect me to go dig them up?\"\n\n\"Please.\" Toban's voice dropped. \"The Phoenix raid is scheduled in ten days. The main tank needs maximum fire resistance or we're finished.\"\n\nGrid snorted.\n\n\"You've had four months to learn that Minerals Master isn't some miracle solution. Minor is useless without accurate clues. There are dozens of minerals he hasn't found. Fire stones? You think he'll just stumble onto such a rare deposit?\"\n\n\"Please try once.\"\n\nGrid laughed at the desperation in Toban's eyes. \"Fine, fine. I'll have him look. And if Minor actually finds something, I'll collect it myself.\"\n\n*As if that'll happen.* He spoke with the certainty of someone betting on an impossibility.\n\nThen, after half a day...\n\nMinor had spent four months studying instead of mining—despite his natural talent. His intelligence now topped 350. The Minerals Master skill finally clicked into true usefulness. He'd buried himself in ancient texts all morning before returning with news that wiped the smirk off Grid's face.\n\n\"I found references to fire stone collection in old documents.\" Minor's expression mixed triumph and resentment. \"Fire stones appear when Hell Gao, the Owner of Hellfire, emerges from hell.\"\n\n\"...\"\n\nGrid's jaw locked. Toban's face lit up like sunrise.\n\n\"Fire stones exist where Hell Gao spawns?\" Toban leaned forward. \"Where does Hell Gao appear?\"\n\nMinor answered the trembling question. \"A dungeon on Cork Island.\"\n\n\"Cork Island?\"\n\nThe location sat in the South Sea off the Eternal Kingdom's coast. Reaching the nearest port took a week by conventional travel, then another boat ride. But Grid possessed Braham's Boots—Fly magic ignored geography. He could arrive three times faster.\n\nToban's eyes gleamed.\n\n\"Grid! Please!\"\n\n\"...\"\n\n*This is going to be annoying.* Grid had made a promise, but his enthusiasm had evaporated.\n\nToban pressed his advantage. \"Think about it. Fire stones are rare minerals—you could sell them for serious gold. Remember what you said before? You gain massive skill experience smelting new minerals. This is valuable for you, Grid. I'm asking as a request.\"\n\nToban had wronged Grid badly in the past. That guilt shaped everything—he tried never to ask unreasonable things, bent over backward to accommodate. Grid had forgiven him eventually, and now...\n\nHe nodded.\n\n\"Fine. Be ready to pay me well.\"\n\n\"Thank you!\" Toban bowed so low his forehead nearly touched his knees.\n\nGrid had grown these past months, matured in ways that earned respect. Despite his legendary class, he gave to others instead of drowning in arrogance. Toban felt genuine gratitude for that.\n\nNot just Toban—all the Tzedakah Guild members recognized it. *A place makes a person.* Grid's interactions with them had shifted toward something positive. He deserved respect.\n\n\"Find out Hell Gao's spawn cycle.\"\n\n\"Yes!\"\n\n*Kaaang! Kaaang!*\n\nKhan's smithy rang with hammer strikes.\n\nGrid returned to crafting after Toban left. As chief of staff, Toban had access to the guild's intelligence network—confirming Hell Gao's schedule would be simple.\n\nAfter a while, Toban returned. His expression had soured.\n\n\"What's wrong?\" Grid set down his hammer. \"Long wait until he spawns?\"\n\nToban shook his head. \"Hell Gao appears in two days. If you leave now, you'll reach Cork Island just as he emerges.\"\n\n\"That's perfect. Why the face?\"\n\n\"Well...\" Toban grimaced. \"Cork Island's dungeon is fully controlled by the Silver Knights Guild. Hell Gao is their boss.\"\n\nGrid shrugged.\n\n\"So? I'm not raiding Hell Gao. Just collecting minerals.\"\n\n\"It absolutely matters. No guild lets outsiders into their territory. Since you're acting as a guild member, we need to request official cooperation or risk starting a guild war.\"\n\n\"Don't cooperation requests cost money?\"\n\n\"Can't be helped.\"\n\nThe Silver Knights Guild commanded respect—over two hundred members, led by Peak Sword, a Korean user ranked sixteenth. One of only two Koreans in the unified top hundred. Their overall strength fell below Tzedakah's peak, but they weren't to be trifled with.\n\nGrid studied Toban in silence. Then he pulled out a hooded garment and zipped it up, vanishing completely.\n\n\"Can't I just sneak in like this?\"\n\n> **<span class=\"rarity-unique\">Hooded Zip Up</span>**\n> \n> Rating: Unique  \n> Durability: 61/61 | Defense: 12  \n> \n> * Movement speed +30%  \n> * Wind resistance +20%  \n> \n> A cloak designed by the legendary blacksmith G. The appearance deviates from traditional cloak aesthetics.\n> \n> Sylphid scales used as material grant wind affinity and enhanced mobility. Allows the wearer to hide completely, but stealth breaks when attacking an enemy.\n> \n> Conditions of Use: None  \n> Weight: 5\n\nOver two hundred years ago, the legendary tailor Kruger created five invisibility cloaks. Only two remained in existence, presumably owned by royalty or high nobility. That a user had crafted another was a secret known only within the Tzedakah Guild.\n\n\"That's right! You have the invisibility cloak!\" Toban's worry evaporated.\n\nThe invisible Grid's voice carried cocky confidence. \"Believe in me. I'll sneak in while the Silver Knights are busy with the raid and grab the fire stones.\"\n\n\"Don't get careless. Be careful.\"\n\nBut Grid had already left the smithy.\n\n\"Time to travel.\"\n\nWinston—the great northern city. Among the thousands of users crowding its streets, not one noticed Grid flying overhead toward Cork Island.\n\n---\n\n**Glossary of Common Korean Terms:** [Link]\n\n**Current schedule:** 20 chapters a week."
}