{
  "id": 163,
  "title": "Chapter 163",
  "content": "# Chapter 163\n\nGrid counted out five hundred gold coins and set them on Ellen's counter. The weight of the payment made his fingers twitch, but he pushed the feeling aside. He pulled the <span class=\"rarity-legendary\">Holy Light Armor</span> and <span class=\"rarity-legendary\">Holy Light Gloves</span> from his inventory, the metal pieces materializing with a soft shimmer.\n\n\"Please add fire resistance to these.\" He handed them over, keeping his voice level. Respectful.\n\nThe combined pieces would grant him twenty percent fire resistance. A worthwhile investment, even if it stung his wallet. Ellen's weathered face split into a warm smile as she reached for the items.\n\n\"Hoho, I'll dye them beautifully. Huh?\" Her hands froze mid-motion. The sagging skin around her eyes pulled taut as they widened. \"How is this possible?\"\n\n*What's wrong?*\n\nEllen cradled the armor like it might vanish. \"I've been dyeing since I was fifteen. I'm seventy-one now.\" Her voice dropped to a murmur. \"Fifty-six years. Thousands of pieces. Every color you can imagine.\" She traced the breastplate's curve with one gnarled finger. \"I've never seen armor like this.\"\n\nHer gaze lifted to Grid. \"A perfect harmony. Is there even a better piece than this in the world? So beautiful. The blacksmith who made this probably isn't a regular person.\" She paused, weighing the metal in her hands. \"Is this the skill of a master who surpasses dwarf craftsmen?\"\n\nGrid felt a flicker of satisfaction.\n\n*This old woman has sharp eyes.*\n\nTrust began to settle in his chest. Someone with this level of insight wouldn't botch the job.\n\nEllen's jaw set with determination. \"I will do my best not to ruin these wonderful pieces.\"\n\nShe laid the armor out on her workspace. The <span class=\"rarity-legendary\">Holy Light Armor</span> covered the neck, shoulders, chest, waist, and right arm in seamless plates. The <span class=\"rarity-legendary\">Holy Light Gloves</span> featured several layers of reinforced leather, with gold thread embroidered near each wrist in an elegant, flowing pattern.\n\n*If she dyes the embroidery red too, it'll look cheap.*\n\nEllen seemed to share his concern. She worked with meticulous precision, her movements economical despite her age.\n\n*Chwaack. Chwaack.*\n\nThe white gloves dipped into the fire stone dye. When they emerged, pale pink had replaced the pristine white. Another dip. The pink deepened. Again. Dark pink now, bleeding toward crimson. With each successive immersion, the color intensified until it reached a strong, blood red.\n\nThe gold embroidery remained untouched. Not a single drop of dye had marred it.\n\n*Great skills.*\n\nGrid watched without blinking. He committed every motion to memory, cataloging the angle of her wrist, the timing of each dip, the way she rotated the fabric to ensure even coverage. When Ellen moved on to the armor, he remained rooted in place.\n\nOne hour passed. Then two. Then three.\n\nThe fire stone water steamed in its basin. Sweat beaded on Ellen's temples. Grid's legs ached from standing, but he didn't shift his weight. This was an opportunity. Learning another craft's techniques might prove useful later.\n\n> [**Insight** has increased by **10**.]\n\n> [Your **Dexterity** has risen.]\n\n> [You have learned a little bit about how to dye cloth and paint metal.]\n\nThe <span class=\"rarity-legendary\">Holy Light Armor</span> and <span class=\"rarity-legendary\">Gloves</span> emerged from their transformation a dark, rich red. The color seemed to drink in the light. Ellen set down her tools and straightened, one hand pressed to her lower back.\n\n\"Please check it.\"\n\nGrid took the pieces from her, his fingers already pulling up the item descriptions.\n\n*Better than I expected.*\n\nThe armor now granted nineteen percent fire resistance. The gloves added seven percent. For five hundred gold, Ellen had successfully modified legendary-rated equipment without destroying its inherent properties.\n\n\"I will use it well.\" He meant it.\n\nEllen's smile deepened, cutting new lines into her face. \"Thank you for giving me the opportunity to dye such excellent pieces before I die.\" She gestured toward a full-length mirror against the wall. \"Thanks to you, I have achieved a higher level. Now, please wear it.\"\n\nGrid crossed to the mirror. The metal was cool against his hands as he buckled the armor into place, followed by the gloves. He settled each piece with practiced efficiency, then looked up.\n\n*I look much cooler.*\n\nThe <span class=\"rarity-legendary\">Holy Light Armor</span> was a Pagma original. Despite being metal, it had been custom-forged to follow the natural lines of a body. The problem had always been the color. Pure white. Like freshly fallen snow.\n\nGrid had yellow-toned skin. Black hair. The aesthetic clash had made him look washed out. Sickly, even. The white armor had emphasized everything wrong with his appearance instead of enhancing it.\n\nNot anymore.\n\nThe dark red suited his complexion. The gold threading caught the light without being gaudy. The black boots he'd kept grounded the entire ensemble. The pieces worked together instead of fighting each other.\n\nEllen clasped her hands together. \"Very cool! I want to transfer your image to a picture frame!\"\n\nShe wasn't exaggerating. Grid could see it himself. The way the colors flowed from one piece to the next created a cohesive whole that demanded attention.\n\n*Is this really me?*\n\nEveryone wanted to look good. Grid was no exception. But years of mockery had taught him not to hope for it. His unimpressive features had earned him nothing but scorn, and those experiences had carved grooves into his personality that were hard to smooth out.\n\nHe wasn't ugly anymore.\n\n*I'm not ugly.*\n\nGrid studied his reflection. The man staring back stood straight. Shoulders squared. Eyes clear and focused instead of downcast. His face had filled out, the hollows in his cheeks gone. From an objective standpoint, he looked significantly better than before.\n\nThe armor elevated the entire package to another level.\n\n*But there's something missing.*\n\nHis gaze dropped to his lower body. No gold embroidery accented the legs or waist. The bottom half looked plain compared to the upper. Grid frowned slightly.\n\n*It would look twice as good if that was fixed.*\n\nEllen had already moved on to greet her next customer. Grid waited until she was engaged in conversation, then spoke under his breath.\n\n\"Pavranium.\"\n\nSeven golden blades materialized around him. Each one measured roughly fifteen centimeters long, eight centimeters wide, and three centimeters thick. They floated in a loose orbit, silent as ghosts.\n\n\"Join together.\"\n\nGrid pictured the shape he wanted. The blades responded instantly, flowing together like liquid metal. When they solidified, a thin sword approximately one meter in length hovered at his side. He adjusted the configuration, making the blade ripple like a wave. Like a serpent's spine.\n\nThe sword fit perfectly onto the ring-belt that protruded near the armor's tail section.\n\n\"Kill.\"\n\nThe blade-like tail extended from beneath the red armor, sharp and threatening. It gave him the appearance of something dangerous. Something not quite human.\n\n\"It is completely to my taste.\"\n\nGrid was admiring the result when Toban's voice crackled through party chat.\n\n*Grid, have you arrived at Cork Island? Hell Gao will appear in exactly one hour. Please take care, and I hope you find the fire stones.*\n\nGrid dismissed the armor back to his inventory and stepped out of Ellen's shop. Too many eyes on the street. He triggered party chat as he walked.\n\n*Believe in me.*\n\n***\n\nCork Island sprawled across the southern waters, the largest of hundreds of islands dotting the Eternal Kingdom's coastline. Rich mineral deposits. Pristine beaches. Forests thick with game. Countless guilds had fought over it.\n\nThe Sakura Guild had been particularly ambitious. Right-wing extremists, every last one of them. They'd wanted to plant their flag on Cork because it reminded them of some disputed rock back in the real world. As if virtual conquest meant anything.\n\nWhen war had broken out between the Allied Guilds and the Yatan Church, the Sakura Guild had seen their chance.\n\n\"We will join the Eternal Kingdom's army and gain enough achievements to receive Cork Island as a reward!\"\n\nTheir plan had worked. They'd racked up contributions during the war. The king had owed them a favor.\n\nThen the Silver Knights Guild had blocked them.\n\nPeak Sword, ranked sixteenth on the unified rankings, led a guild composed primarily of Koreans. They'd confronted the Sakura Guild with a simple goal: stop the nationalistic idiots who couldn't separate a game from reality.\n\nBoth guilds had earned similar contributions. The king couldn't easily choose between them. So they'd fought. Guild versus guild, over and over, until one side broke.\n\nThe Silver Knights had won. Peak Sword's individual skill had tipped the scales despite the Sakura Guild's higher average power level. Cork Island had changed hands, and the Silver Knights' symbol had shifted from a sword and shield to a three-legged raven.\n\nThat was four months ago.\n\nNow, the Silver Knights Guild focused on their next objective: raiding Hell Gao.\n\n*If we clear this raid, we can accelerate our growth.*\n\nPeak Sword stood in the fourth floor of Cork Island's dungeon, mentally reviewing the plan. The items Hell Gao dropped would let him nurture more Korean rankers. Build a stronger foundation. He'd skipped the National Competition this year. The South Korean government had asked him to participate. Yura had too.\n\nBut he'd refused.\n\n*Even with me, we wouldn't rank well.*\n\nKorea's reputation as a gaming powerhouse had taken hits. This year was a lost cause. But next year? With proper preparation?\n\n*Next year will be different.*\n\nHe would raise an army of Korean rankers. Reclaim the glory. Show the world what they could do.\n\nThis was the sixth attempt at Hell Gao. The previous five had ended in failure.\n\n\"Over the past month, we have become stronger and invested our money wisely.\" Peak Sword raised his voice so it carried across the assembled guild. \"Now we will surely be able to take Hell Gao. Have courage and let's defeat him!\"\n\n\"Ohhhh!\"\n\nTwo hundred elite members filled the chamber. The best the Silver Knights had to offer. Their roar shook dust from the ceiling.\n\nTen minutes remained until Hell Gao spawned.\n\nPeak Sword watched the timer count down. The initial surge of enthusiasm was already fading. He could see it in their faces. Tension creeping back in. Anxiety tightening their jaws.\n\n\"Five minutes left!\"\n\nThey remembered Hell Gao's power. The black flames that turned flesh to ash. The staff that crushed armor like paper. Could they really beat that thing? The question hung unspoken in the air.\n\n\"Four minutes left!\"\n\nHeat began to seep into the chamber. Not the natural warmth of body heat and exertion. Something else. Something wrong.\n\n\"Three minutes left!\"\n\nIn three minutes, Hell Gao would manifest. The entire room would become a sea of fire. Some of them would die before they even drew their weapons. Just from the ambient heat.\n\n\"Two minutes left!\"\n\nSweat rolled down Peak Sword's spine.\n\n*Shit.*\n\nHe wanted to rally them. Boost morale. But his own hands were shaking. He remembered Hell Gao too clearly. The demon wreathed in flames, staff spinning, every motion leaving trails of combustion in the air.\n\n*Are we strong enough yet?*\n\nWith one of the top ten rankers, maybe. But with their current lineup?\n\n*We might fail again.*\n\nPeak Sword couldn't show that doubt. He was the highest-ranked member. The leader. If he faltered, everyone would.\n\n*We can do this. We're strong enough.*\n\nHe downed a **Strength** potion, followed by **Agility** and **Stamina** buffs. The rest of the guild mirrored him. Glass vials clinked against belt pouches as two hundred users prepared for battle.\n\n\"One minute left... wait.\" The scout's voice cracked. \"Intruder! There is an intruder!\"\n\n\"What?\"\n\nEvery head turned toward the entrance.\n\nA young man strode into the chamber. Black hair. Asian features. A cloak covered his body, concealing any armor or weapons he might carry.\n\n*Did he break through the defensive line downstairs?*\n\nPeak Sword's mind raced. An assassin would have stayed hidden. Not walked in openly.\n\n*Grid?*\n\nThe name floated above the stranger's head. Peak Sword searched his memory but came up empty. Not a ranker he recognized. He glanced at his officers. They all shook their heads.\n\n*A nobody got this far? Pathetic.*\n\nPeak Sword stepped forward, his voice sharp. \"This is an area controlled by the Silver Knights Guild. I don't know how you managed to reach this point, but if you don't want to die, go back.\"\n\n\"My stealth suddenly disappeared.\" The young man ignored him completely, talking to himself as he shrugged off his cloak. \"Was it because I was detected by Hell Gao?\"\n\nArmor materialized around him in segments. Red plates edged with gold. Black boots. The pieces assembled themselves with mechanical precision, locking into place until the transformation was complete.\n\n\"Ohh!\"\n\nExclamations rippled through the guild. The armor was striking. An elegant blend of red, black, and gold that seemed to shift in the firelight. But the most unusual feature was the tail. A blade approximately one meter long extended from near the tailbone, sharp-edged and moving independently. Like a living thing.\n\n\"What is that armor?\"\n\n\"It's incredible. Unique grade?\"\n\nGuild members crowded closer, eyes wide. Peak Sword's jaw clenched.\n\n\"That isn't important right now!\" He turned on his officers. \"Why aren't you throwing him out?\"\n\nHell Gao would spawn any second. Once the demon manifested, no one could leave. They had to remove the intruder before that happened. Several guild members moved to comply.\n\n**Kuwooooh!**\n\nThe roar split the air like thunder.\n\n> [Hell Gao, the Owner of Hellfire has appeared.]\n\n> [Hell Gao's roar has applied **Fear**, **Chaos**, and **Debilitation** effects.]\n\n> [Hell Gao's fire reduces heat resistance by **50%**.]\n\n> [Fire pillars have risen to cover you.]\n\n\"Kuack!\"\n\n\"Hiiik!\"\n\nFlames erupted from every surface. The floor. The walls. The ceiling. Silent black fire that burned hotter than a forge. Half the guild collapsed immediately, their health bars plummeting into critical. Some didn't even scream. The fire consumed them too quickly, reducing flesh and bone to ash before their nervous systems could register the pain.\n\nThe survivors staggered, their gear smoking.\n\nPeak Sword checked his own status bar. More than half his health was gone.\n\n*I raised my fire resistance to eighty-six percent!*\n\nIt wasn't enough. It was never enough. They were going to fail again. Peak Sword's chest tightened.\n\nThen he saw the intruder.\n\nGrid moved forward through the flames like he was taking a stroll. No flinching. No stumbling. The fire parted around him, licking at his armor but finding no purchase.\n\n\"How?\" Peak Sword's voice came out strangled. \"What?\"\n\nGrid walked past him without acknowledgment. He reached the chamber's far wall and pulled something from his inventory.\n\nA pickaxe.\n\n\"You've got to be kidding me.\"\n\nGrid hefted the tool and began swinging at the exposed rock face.\n\n**Kaaang! Kaaang!**\n\nEach impact sent sparks flying. Grid paused to wipe sweat from his forehead with the back of one gauntlet.\n\n\"Ugh, hot! Isn't the labor getting worse?\" He resumed swinging, his form practiced. \"Why does this mineral only appear when the boss mob is present? Based on this, I might have to visit a dragon's lair with my pickaxe!\"\n\nHell Gao spun toward the new target. The demon raised its staff. A wave of superheated air erupted from the weapon's head, slamming into Grid's back.\n\nPeak Sword braced himself for the inevitable collapse.\n\nGrid's health bar barely moved.\n\n*Huge defense power. A guardian knight?*\n\n\"Excuse me, Mister.\" Grid stopped mining and turned to face Peak Sword. His expression was irritated. \"Why are you just standing there blankly? It's hot, but it will just get hotter.\"\n\nPeak Sword's brain refused to process what he was seeing.\n\n\"How can you be fine?\"\n\nGrid shrugged. \"It's the item effect.\"\n\n**Chaaeng! Chaeng!**\n\nThe tail extending from Grid's armor came alive. It intercepted Hell Gao's staff mid-swing, the collision sending shockwaves through the chamber. The demon recoiled, flames flaring brighter.\n\nPeak Sword's mouth hung open.\n\n*What am I looking at?*\n\nUnofficial rankers existed. High-level users who avoided the rankings to play like hermits. Legends in their own right.\n\n*Is he one of them?*\n\nGrid sighed and closed his inventory. When it reopened, he held a massive greatsword. Dark metal, edged with red light. The blade was easily as tall as he was.\n\n\"Hey, you monster.\" Grid pointed the sword at Hell Gao. \"I don't want to fight you, so don't bother me and go away.\"\n\nHe swung.\n\n**Kwang!**\n\nThe impact drove Hell Gao back several steps. The demon's flames surged higher, turning from black to blue-white. It seemed confused. Almost offended.\n\nThe Silver Knights Guild, including Peak Sword, stood frozen in stunned silence."
}