{
  "id": 164,
  "title": "Chapter 164",
  "content": "# Chapter 164\n\n*Hell Gao didn't even flinch when the guild's top three damage dealers attacked simultaneously.*\n\n*And this guy pushed him back with one shot?*\n\n*What kind of attack power is that?*\n\n*What is that tail defending against Hell Gao's attacks?*\n\n*Why is he still holding the pickaxe...?*\n\nThe scene defied belief. Peak Sword and the Silver Knights Guild stared at Grid, their confusion written across every face.\n\n*I thought he was a tank because of his high defense. But his attack power is even higher?*\n\nPeak Sword knew of several classes with excellent balance. But balanced classes suffered from a chronic flaw: they excelled at nothing. Yet both Grid's attack power and defense defied reason.\n\n*He must have a hidden class. And...*\n\nGrid's words circled through Peak Sword's mind. Item effect. Item effect. Item effect. Item.\n\n*It really is the power of his gear.*\n\nIn Satisfy, items could be enhanced up to +10. The stones cost a fortune, and the higher the enhancement value, the lower the success rate. Worse, success meant +1, but failure meant -3. The odds of an ordinary user owning highly enhanced equipment were astronomical. Most rankers used +7 items. Only the wealthy or the exceptionally lucky reached +8 or higher.\n\nPeak Sword's eyes widened. Grid's sword glowed with a deep orange light, like the dying sun.\n\n*A +8 enhanced item.*\n\n*So he's a high-level hidden class who's both rich and lucky?*\n\nGrid frowned at Peak Sword's expression. \"What's with that look?\"\n\nThis was no coincidence. Someone this powerful didn't just wander into raid territory. Peak Sword's alarm bells rang.\n\n\"You look Chinese or Japanese. Did the Sakura Guild send you?\"\n\nGrid had the appearance of a Northeast Asian. Korea and Mongolia were weak nations in Satisfy. Peak Sword couldn't imagine a powerhouse hiding among Koreans or Mongols. This man had to be Chinese or Japanese.\n\nThe answer stunned him.\n\n\"Sakura Guild? Never heard of them. And I'm South Korean.\"\n\n\"South Korean?\"\n\nMurmurs rippled through the guild.\n\n\"There's someone this strong among Koreans...\"\n\n\"Besides Yura and Peak Sword, South Korea has another top player.\"\n\n\"Wow! South Korea really is something!\"\n\nMost Silver Knights Guild members were fiercely patriotic. The type to ask foreigners \"Do you know Kimchi?\" at every opportunity. They beamed at the revelation.\n\n\"We're Koreans like you!\"\n\n\"I knew it watching you fight! Korean gaming talent is unmatched!\"\n\n\"I'm proud such a great player shares our nationality!\"\n\n\"Quiet!\" Peak Sword silenced his excited guildmates and glared at Grid. \"If the Sakura Guild didn't commission you, why are you interfering with our raid?\"\n\n\"Interfering?\"\n\nClang! Clang!\n\nGrid staggered as Hell Gao's aggro swung toward him.\n\n\"Interfering? I helped you.\"\n\n\"Helped? You crashed someone else's raid!\"\n\n\"What?\"\n\nAnger flashed across Grid's face. He dropped his pickaxe and grabbed Dainsleif with both hands.\n\n\"Ridiculous humans! I will burn you to ash!\"\n\nHell Gao waved his staff, and a heat storm erupted. Grid began to move, his body flowing into a deadly rhythm.\n\n*Pagma's Swordsmanship.*\n\n\"Become ashes!\"\n\n**Kwaaaaang!**\n\nMaterials in the area melted. Scorching wind blasted over Grid. His movements completed.\n\n\"Kill.\"\n\n**Kwa kwa kwa kwang!**\n\nThe sight overwhelmed. The massive blade, wreathed in red and black energy, pierced Hell Gao's heart with terrible momentum.\n\n\"Kuheok...!\"\n\nEveryone noticed Hell Gao's flame-shrouded face twist in pain.\n\nHell Gao collapsed, blood spraying like molten lava. Grid turned to the stunned Peak Sword.\n\n\"I'm sorry I crashed your raid, but honestly, without me, wouldn't you all be dead right now? That monster attacked me first. I only got involved because of that. I didn't actually do anything wrong.\"\n\nThe words held truth. But that didn't justify Grid's actions.\n\n\"I acknowledge that. But you still intruded. How can we proceed with a raid while you're watching? Could you, if you were us? What if you attack us mid-fight?\"\n\nGrid snorted. \"If I wanted to hit you in the back, I would've done it earlier. Right?\"\n\nAccurate. The guild had been in trouble when Hell Gao appeared. Grid had been fine. If he'd attacked then, the guild would have faced disaster.\n\n\"Uh...\"\n\nEvidence that Grid wasn't an enemy. Still, his presence was disruptive. Grid had planted a seed of doubt in Peak Sword's mind.\n\n\"I didn't come here for that monster anyway. Fire stones.\" Grid sheathed Dainsleif in his inventory. He picked up his pickaxe and headed toward a fire stone. \"I have no intention of interfering. Ignore me and continue your raid.\"\n\n\"...\"\n\n**Kaaang! Kaaang!**\n\nPeak Sword watched Grid mine, his motivation draining away.\n\n*He's not someone we can overpower. Let's just ignore him.*\n\nThey could deal with this after the raid. Peak Sword turned away from Grid and focused on the battle. The guild members quickly surrounded the downed Hell Gao.\n\nGrid glanced at them and clicked his tongue.\n\n*Do they really think they can raid that thing? Pointless.*\n\nThe current Grid couldn't measure Hell Gao's combat strength accurately.\n\n*That monster took Kill and didn't even lose a tenth of his health.*\n\nHell Gao was a creature that even Muller couldn't seal completely. Very strong. Grid estimated he was several degrees more powerful than the Awakened Guardian of the Forest.\n\n*I can't beat him, even with my invincible passive. Better to avoid him.*\n\nGrid's judgment was sound. Most users didn't know the details of demon-related episodes yet. Hell Gao, Master of Hellfire, ranked 9th among the 33 Great Demons of Hell, with demonkin like Balak serving as subordinates. Best not to associate with him.\n\n*Hurry.*\n\n**Kaaang! Kaaang!**\n\nGrid's pickaxe accelerated. He'd use the time while the Silver Knights fought Hell Gao to mine fire stones.\n\nThat behavior was the problem.\n\nWhy did fire stones always appear with Hell Gao? No coincidence. The fire stones were the source of Hell Gao's power. Hell Gao needed them to manifest in the human world. A human attempting to mine them? Hell Gao couldn't tolerate it.\n\n\"Damn human!\"\n\n**Peeeeeong!**\n\nHell Gao released black flames, burning through the Silver Knights, and charged toward Grid.\n\n**Clang! Clang!**\n\nThe pavranium moved to shield Grid. But the current pavranium, attached to his armor and restricted in movement, couldn't completely block Hell Gao's assault.\n\nGrid felt a flash of heat with every staff strike.\n\n> [You have suffered 2,930 damage.]\n\n> [You have suffered 3,190 damage.]\n\n*How annoying. I raised my fire resistance, but I'm still taking this much damage.*\n\n**Kaaang! Kaaang!**\n\nGrid downed a potion to restore his health and quickened his pickaxe pace. He tried to ignore Hell Gao attacking behind him.\n\n*Just a bit more...*\n\nFive more swings to obtain one fire stone. Grid endured, relying only on pavranium to defend.\n\nHell Gao's rage peaked.\n\n\"Stop now!\"\n\n**Kwaang!**\n\nHell Gao's body erupted in crimson flames, the heat intensifying.\n\n**Kaang!**\n\nHell Gao's attack power surged. The pavranium took a hit and temporarily stiffened.\n\n*This is bad.*\n\nHell Gao's staff aimed at Grid's side. Three swings left to obtain the fire stone. Grid tried to raise a shield, but too late.\n\nPeak Sword stepped forward.\n\n\"Draw Sword, string.\"\n\nPeak Sword stood two meters behind Hell Gao. He drew his sword so fast the eye couldn't follow. A sharp flash. Blood spurted from Hell Gao's neck.\n\n\"Kuooh!\"\n\nHell Gao's gaze swung toward Peak Sword.\n\n\"Insolent!\"\n\nHell Gao closed on Peak Sword, staff swinging. Peak Sword sheathed his sword.\n\n\"Sheath Sword, breadth.\"\n\n**Kwaang!**\n\nJust before Hell Gao's staff connected, a powerful wave of sword energy exploded around Peak Sword, forcing Hell Gao to retreat.\n\nPeak Sword spoke to Grid, his expression grim. \"You're Korean, and you helped us once. Consider the debt paid.\"\n\nThe Silver Knights Guild launched their assault.\n\n\"Die, monster!\"\n\n\"This time we'll finish you!\"\n\nThe Silver Knights were a well-trained unit. Qigong masters suppressed Hell Gao's heat while damage dealers attacked without taking injury. A pincer maneuver perfected through experience fighting Hell Gao.\n\nThe problem was Hell Gao's overwhelming strength.\n\n\"This doesn't even tickle!\"\n\nHell Gao laughed and launched flames in every direction. Inevitable fire AOE magic. The qigong masters controlled ambient mana while magicians erected water barriers to suppress the force.\n\nThe flames' momentum didn't diminish at all. They evaporated the water barriers instantly.\n\n**Kwa kwa kwa kwang!**\n\nScalding steam erupted. Peak Sword and the knights defended with weapons and shields. The qigong masters and magicians used defensive magic.\n\nEveryone except Peak Sword turned to gray light.\n\n\"What?!\"\n\nPeak Sword realized the truth the moment over a hundred death notifications flooded his screen.\n\n*This is impossible.*\n\nRaiding Hell Gao? A pipe dream. He'd been confident in the guild's power this past month, but they were nothing more than insects before Hell Gao.\n\n*My mistake for not accurately measuring Hell Gao's strength.*\n\nHe felt crushing guilt for the guild members wiped out because of their foolish master's hubris. Peak Sword's dream of fostering enough Korean rankers to compete in next year's National Competition died in that moment.\n\nHe collapsed.\n\n\"Kukukuk.\"\n\nHell Gao's hot breath accompanied his laugh as he approached. He aimed his staff at Peak Sword, who'd lost all his men and all hope.\n\n**Kaaang!**\n\n> [A fire stone has been acquired.]\n\nGrid finally obtained a fire stone.\n\nThe black flames around Hell Gao's body visibly weakened.\n\n**Crack!**\n\n> [You have suffered 4,200 damage.]\n\n\"...Huh?\"\n\nPeak Sword survived the staff blow. Both Peak Sword and Hell Gao froze in shock.\n\n*Weaker?*\n\nNot an illusion. Hell Gao had rapidly weakened. An awkward silence fell.\n\n\"Transcended Link.\"\n\n**Kwa kwa kwa kwa kwa kwa kwa kwa!**\n\nTwenty blue and white energy blades flew, striking Hell Gao.\n\n\"Kuaaaaak!\"\n\nBlood spurted in every direction like boiling lava. Hell Gao released a terrible scream of agony. Then he spotted the fire stone in Grid's hand.\n\n\"You dare...! I'll kill you!\"\n\n**Hiss.**\n\n\"Can you?\"\n\nGrid smirked and raised the blue sword reminiscent of an ocean predator.\n\nPeak Sword startled twice.\n\nFirst, he realized Grid was Pagma's Descendant, who'd appeared in the Battle of Bairan months ago.\n\nSecond, the white light surrounding the blue greatsword.\n\n\"A +9 item?\"\n\n\"Take this pickaxe.\"\n\nGrid tossed his pickaxe toward the gaping Peak Sword. He explained to the puzzled man.\n\n\"Hell Gao's weakness is the fire stones. The more fire stones collected, the weaker he becomes. Collect them while I hold him off.\"\n\nPeak Sword's expression darkened. \"I understand what you're saying, but I don't have the mining skill. It'll be difficult for me...\"\n\n\"Don't worry. Anyone can mine with that pickaxe.\"\n\n\"...?\"\n\nGrid spoke with absolute confidence. Peak Sword examined the pickaxe's details, curious.\n\n---\n\n[<span class=\"rarity-legendary\">Fantastic Pickaxe</span>]\n\n**Rating:** Legendary  \n**Durability:** 155/219  \n**Attack Power:** 107\n\n* The chances of acquiring advanced minerals will increase by 10%.\n* The chances of acquiring the highest grade minerals will increase by 5%.\n* The skill 'Intermediate Mining Technique' Lv. 3 will be generated.\n\n*A pickaxe made by the legendary blacksmith G. With this pickaxe, even a five-year-old child can collect high-quality iron ore.*\n\n**User Restriction:** Level 200 or higher.  \n**Weight:** 45\n\n---\n\n\"...\"\n\n\"Why are you just standing there?\"\n\nHell Gao wasn't a fool. He couldn't let the humans touch more fire stones. He moved to eliminate the injured Peak Sword first.\n\nGrid wouldn't allow it. He detached the pavranium from his armor and pointed at Hell Gao's head with his fingers.\n\n\"Go.\"\n\n**Chwachwachwachwachwachwa!**\n\nThe combined pavranium separated into seven blade-like shapes. They spread out and attacked Hell Gao from different angles.\n\n\"Kuooh!\"\n\nHell Gao lost track of Peak Sword. He raised his staff and tried to resist the seven blades, but they couldn't be destroyed.\n\n*What even is this...*\n\nPeak Sword thought it absurd. A parade of overpowered items kept appearing.\n\n*Item effect.*\n\nThe words Grid had spoken when he first appeared echoed in Peak Sword's head.\n\nGrid prompted him. \"What are you doing? Go mine the fire stones.\"\n\n\"Ah, y-yes... Right... Yes...\"\n\nPeak Sword, ranked 16th, mined for the first time since starting Satisfy.\n\nAnd it was the day Hell Gao, Master of Hellfire, met his strongest enemy since the Great Sword Saint Muller.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** [Glossary Link]\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day."
}