{
  "id": 165,
  "title": "Chapter 165",
  "content": "# Chapter 165\n\n*Syuok! Syu syu syu syu syuk!*\n\nSeven golden blades shot through the air. They converged on Hell Gao's face from different angles. Eyes, cheeks, skull, chin. The speed rivaled Memphis, the fastest demonic beast in hell. No ordinary demonkin could react.\n\nHell Gao wasn't ordinary.\n\n*'Skilled thrower, but this is just pest control.'*\n\nHe drew a small circle with his staff.\n\n*Chaeeeeeng!*\n\nThe blades scattered mid-flight. They didn't fall. Instead, they arced upward and dove at him again.\n\nHell Gao's eyes narrowed. *'What?'*\n\nHe'd assumed the human in red armor had thrown them. But they moved on their own?\n\n*Kaang! Kakakang!*\n\nThe relentless assault grated on his nerves. Hell Gao swung his staff and struck one of the blades directly. The impact should have shattered it.\n\nThe blade shuddered. No scratch. After a brief pause, it resumed its attack.\n\n*'Outstanding durability. Adamantium? But why are they autonomous?'*\n\nFast. Solid. Golden. They weren't controlled by magic. How did they move? They didn't tire. Hell Gao felt the pressure building.\n\n\"Get lost!\"\n\nHe released a wave of superheated wind. The blast of air pressure drove the blades back, forcing them away from his body.\n\n\"Come back.\"\n\nThe human in red armor spoke from a distance. The blades obeyed instantly, flying to orbit around him.\n\n*'What a bizarre artifact.'*\n\nHell Gao opened his mouth. \"I never dreamed in my thousands of years of existence that I would have a question for a human. Those blades, what are they? They have durability comparable to the god mineral adamantium and they move by themselves. Why is an ordinary human carrying something like this?\"\n\nThe human in red armor grinned. Grid. \"Ordinary human? You still think I'm ordinary?\"\n\n\"What?\" Hell Gao's voice dripped with contempt. \"Kukuk! You only barely managed to wound this trash body! So what, you think that you are special?\"\n\nHe was the 9th strongest of the 33 great demons. But that ranking only applied in hell. After Sword Saint Muller sealed him 150 years ago, he'd been forced to borrow a demonkin's body whenever he manifested in the human world.\n\nThis body wasn't his. He couldn't exert his true strength. And this human was arrogant enough to think wounding such a weakened form was an achievement?\n\nHell Gao snorted. \"I know that you are a fairly strong human. But you aren't particularly special.\" The black flames around his body flared brighter. \"I only recognize the man called Muller. You're just a trivial existence who can't even reach Muller's toes.\"\n\nGrid tilted his head. \"Ah, Sword Saint Muller? Wasn't he the one who turned your body into a rag in the past?\"\n\nHell Gao's eyes narrowed to slits.\n\n\"What's so funny?\"\n\nGrid's smile widened. \"I am in the same class as Muller. It's laughable that you can't see that. Well, today you will die again.\"\n\nThe absurdity of it made Hell Gao laugh.\n\n\"Kuhahahaha! This crazy person is talking nonsense!\"\n\nSword Saint Muller was such a transcendent figure that he'd shattered Hell Gao's understanding of mortal limits. The man had lived for thousands of years, and Muller was the first to make him question reality. His swordsmanship could cut through the flames of hell itself, making them look docile as sheep.\n\nIn comparison, this human was plain. Stronger than average, yes. But no match for Muller.\n\n\"A person who puts himself in the same class as Muller, he really doesn't understand...\" Hell Gao's laughter cut off. \"Huh?\"\n\nHis gaze snapped to a corner of the dungeon. Thanks to the distraction from the golden blades, he'd missed the other human. That one was aiming a pickaxe at a fire stone.\n\nPeak Sword. The 16th ranked user. A man who inspired fear in some, respect in others. Currently attempting mining for the first time in his life.\n\nHell Gao's fury ignited.\n\n\"I don't like this pair!\"\n\nHe had brought four fire stones from hell to the human world. Each one cost him a quarter of his magic power. He'd already lost one. He couldn't afford to lose another.\n\n*Kuooooh!*\n\nDark flames wrapped around Hell Gao's body like a cloak as he charged. His target: Peak Sword. He would smash that fool's head and destroy that pickaxe.\n\nGrid blocked his path.\n\n\"Where are you going during our conversation?\"\n\nGrid attacked mid-sentence.\n\n*Chaaeng!*\n\nHell Gao's arms shook as he parried the blue greatsword with his staff.\n\n*'It isn't just that I'm weaker. He has grown stronger.'*\n\nGrid watched the demon's reaction. \"Of course, my current skills aren't even one-hundredth of Sword Saint Muller's skills. But it isn't a lie that I am in the same class as him. I am also a legend.\"\n\n\"Legend?\"\n\nConfusion flickered across Hell Gao's face. Grid pressed the attack. He wielded <span class=\"rarity-legendary\">+9 Failure</span>, a master weapon he'd used for months. His understanding of it had reached 100%.\n\n*Jjang! Jjejejeok! Jjejeong!*\n\n**Pagma's Swordsmanship (Lv.2)** increased his physical attacks by 30%, critical hit rate by 20%, and critical damage by 10%. Combined with **+9 Failure**, the power transcended imagination. Confusion rippled through Hell Gao's expression.\n\n*'This guy... the attack power in one blow...!'*\n\n*Kwang!*\n\n\"Kkuk!\"\n\nHell Gao defended with his staff. He vomited. A red glow shone through the black flames surrounding him.\n\nGrid's white teeth flashed. \"Can you feel it? This is strong enough to fill up the difference in abilities.\"\n\n\"You...!\"\n\nAlarm finally registered in Hell Gao's voice. The man before him wasn't a master swordsman like Muller. His comprehensive physical abilities fell far below Muller's level.\n\nBut.\n\n*'Strong.'*\n\nWhy was he so strong? Hell Gao's suspicious gaze fixed on Grid.\n\n*'It's that greatsword.'*\n\nIn his thousands of years of existence, he had never seen a weapon like that blue greatsword. Hell Gao trembled. The golden blades that moved autonomously, this devastating greatsword. How did this man acquire such powerful items?\n\n*'Does this person have the treasures of the gods?'*\n\nHell Gao could no longer afford to hold back. He made his decision and unleashed hellfire.\n\n*Peeng!*\n\nThe flames that would never extinguish once ignited struck Grid's chest. Hell Gao confirmed the fire taking hold and burst out laughing.\n\n\"Kuhahaha! It's useless even if you jump into the sea right now. Once the hellfire has started burning, it won't fade away until the target has been turned to ashes!\"\n\nHell Gao didn't doubt Grid would become ashes within seconds. However...\n\nGrid waved his hand a few times. The hellfire went out.\n\n\"What!?\"\n\nHow could anyone extinguish hellfire like it was a candle flame? In Hell Gao's thousands of years of living, his belief that 'hellfire will never go out' had been absolute. The last time someone had shattered his common sense was 150 years ago.\n\nWhen he met Muller.\n\n*'It isn't a lie that he is in the same class as Muller...!'*\n\nA chill ran through Hell Gao. He reflexively took a step back.\n\n> [You have suffered 4,800 damage.]\n> \n> [The black fires of hell have attached to your body. The flames won't turn off until your body is turned to ashes.]\n> \n> [You will receive 2,000 burn damage per second until death.]\n> \n> [You have resisted.]\n\nGrid checked the warning windows. Pleasure coursed through him. He began his dance. White light traced around the blue greatsword like a shark swimming through deep water.\n\n\"Pagma's Swordsmanship, Link.\"\n\nThe muscles that coiled during the dance released all at once. The greatsword moved explosively. Seventeen blue and white energy blades ripped through the air at terrible speed, compressing the atmosphere itself.\n\n\"...\"\n\nSilence.\n\n*Kaaang!*\n\nOnly the sound of Peak Sword swinging his pickaxe echoed through the chamber. Hell Gao blinked.\n\n*'What?'*\n\nWas it a miss?\n\nAnd then.\n\n*Susuk.*\n\nThe seventeen strands of energy materialized around Hell Gao's body. This was followed by seventeen sharp waves.\n\n*Pipit! Pipipipipit!*\n\nThe compressed air detonated simultaneously. At the same instant, seventeen wounds appeared on Hell Gao's body.\n\n\"Kuaaaak!\"\n\nHell Gao screamed. It wasn't a miss. This was the true essence of the sword of light, **Link**. Grid had raised his stats and reached level 246 over the past four months. He had perfectly reproduced one of Pagma's legendary techniques.\n\n\"Didn't I tell you? I am also a legend.\"\n\nGrid was impressed with himself.\n\n\"T-This guy...!\"\n\nHell Gao's body wobbled. Before the fire stone had been collected, when Hell Gao was in perfect condition, a fatal strike barely decreased his health. Now he'd lost more than a tenth of his health from **Link** alone.\n\nGrid felt certainty crystallize.\n\n*'It is enough to fight.'*\n\n*Kaaang! Kaaang!*\n\nThe sound of Peak Sword's pickaxe rang non-stop from the rear. Grid's courage swelled. Then from the corner of his vision, Hell Gao's staff came flying.\n\n*Peeok!*\n\n> [You have been hit by a lethal blow!]\n> \n> [You have suffered 7,930 damage.]\n\n\"...Kuk!\"\n\nThe staff slipped between the rotating golden blades and struck Grid perfectly. Hell Gao chanted a spell as he shouted.\n\n\"You aren't Muller!\"\n\nThat was right. He wasn't Sword Saint Muller. One strike from Muller's sword had severed Hell Gao's limbs. It was true that Grid's weapons covered his deficiencies. But he couldn't deny that he was very lacking compared to Muller.\n\n*Chaaeng! Chaaeng!*\n\nThe seven golden blades moved briskly to contain Hell Gao while simultaneously protecting Grid. But Hell Gao had entered full combat mode. His speed and power had transformed.\n\n*Jjejeong!*\n\nThe golden blades Hell Gao struck froze in place for two seconds. Then.\n\n*Peeok!*\n\nHell Gao's staff moved with serpentine flexibility, avoiding the other blades and slamming into Grid's abdomen.\n\n> [You have suffered 3,550 damage.]\n\n*'Damn! It hurts!'*\n\nAll of Grid's armor had been enhanced to **+6**. He'd spent a tremendous amount enhancing <span class=\"rarity-legendary\">Failure</span> up to **+9**, so he'd had to settle for this much on his armor. After extensive testing, he'd thought his current defense was sufficient.\n\nA month ago, he'd faced the Awakened Guardian of the Forest. His defense had been quite bearable then. But Hell Gao's attack power was too strong.\n\n*'This is after he was weakened by having the fire stone mined...!'*\n\n*Peeok! Peeeeok!*\n\n> [You have suffered 3,590 damage.]\n> \n> [You have suffered 3,480 damage.]\n> \n> [You have suffered 4,900 damage.]\n> \n> [You have been hit by a lethal blow!]\n> \n> [You have suffered 7,700 damage.]\n\nThe critical hit rate was absurdly high. One in every three blows. Hell Gao's base damage was tremendous. His frenzied assault restrained Grid's actions. Grid barely survived with one-third of his health remaining. He fought back with <span class=\"rarity-legendary\">Failure</span>.\n\n*Kwang!*\n\nGrid used the repulsive force from the collision to create distance. He activated a skill.\n\n\"Wave!\"\n\nA blue and white wave spread outward from his position.\n\n> [You have dealt 18,500 damage to the target.]\n> \n> [The target's attack speed has been reduced.]\n\nHesitation.\n\nHell Gao's overwhelming momentum faltered. Grid counterattacked several times during the gap. He shouted at Peak Sword.\n\n\"No, this damn guy! You still haven't mined one fire stone?\"\n\nPeak Sword sounded frustrated. \"I told you that it is my first time mining! I don't know the tricks!\"\n\n\"Ah, it's frustrating!\"\n\n\"...\"\n\nHell Gao was the master of hellfire. Grid was the first legendary class. There was such a massive gulf between them and Peak Sword. Despite being 16th on the unified rankings, he couldn't prove his reputation here.\n\nGrid tried to explain. \"Take a good look around the fire stones! There is a part around the root where the ground will be weak, attack that place...!\"\n\n\"Shut up.\"\n\n*Pepepepeng!*\n\nHundreds of hellfire spheres flew. Grid pulled out the <span class=\"rarity-legendary\">Divine Shield</span> and defended with it alongside the golden blades.\n\n*Teook!*\n\nHell Gao struck the ground with his staff. He used the rebound to leap and landed on Grid's shoulder.\n\n*Puuok!*\n\nThe golden knives stabbed Hell Gao mercilessly. But they couldn't stop his actions. Hell Gao grabbed Grid's head with both hands.\n\n\"If you can't burn then I will crush you!\"\n\n\"...!\"\n\n*Peeng!*\n\nBlack flames erupted from both of Hell Gao's hands, swirling into a vortex.\n\n*Kwa kwa kwa kwa kwa kwa kwa kwa!*\n\n\"Kuhahahahaha!\"\n\nEven rock would quickly turn to sand from this heat. Hell Gao laughed as he anticipated flesh and brains splattering everywhere. He didn't see it. Grid pulled out a blue ring and slipped it onto his finger.\n\n\"Okay?\"\n\n\"Hahaha...! Huh?\"\n\nThe voice of the man who should be dead rang out clearly. Hell Gao froze in shock. Grid activated **Blacksmith's Rage** and severed both of Hell Gao's hands with <span class=\"rarity-legendary\">+9 Failure</span>.\n\n> [Critical!]\n> \n> [Failure's option effect is activated, causing the skill 'Bisect' to be generated.]\n\n*Seokeok!*\n\n> [You have dealt 46,940 damage to the target.]\n> \n> [You have cut both wrists of Hell Gao, the master of hellfire. Hell Gao's actions will be limited and his attack power and attack speed will be greatly reduced.]\n\n\"Kuaaaack!\"\n\nHell Gao's terrible screams echoed through the wide dungeon.\n\nGrid smiled wickedly.\n\n\"This is the second round.\"\n\nGrid had accumulated significant combat experience. He'd learned how to exploit <span class=\"rarity-unique\">Doran's Ring</span>. The trick was simple. Wear the ring when the enemy used a powerful skill.\n\nThis maximized the effect of Doran's Ring and the <span class=\"rarity-legendary\">Holy Light Armor</span>. Meanwhile, Hell Gao's health had dropped by three-tenths after Grid consecutively used **Kill**, **Transcended Link**, **Link**, and **Wave**.\n\nThen.\n\n*Kaaang!*\n\n\"Yes! Success! I gathered a fire stone!\"\n\nPeak Sword had been playing Satisfy for a year and a half. He felt the pleasure of mining for the first time.\n\n\"Kuk...! You guys...!\"\n\nThe black flames around Hell Gao's body lost more intensity. Grid felt no doubt. The second round would end in a knockout victory.\n\n---\n\nGlossary of Common Korean Terms.\n\nOG: Glossary Link.\n\nCurrent schedule: 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}