{
  "id": 166,
  "title": "Chapter 166",
  "content": "# Chapter 166\n\n**Kaaang!**\n\n> [A fire stone has been acquired.]\n\nWhile Grid struggled against Hell Gao, Peak Sword's pickaxe finally struck true. The red mineral clung to the rock face like a stubborn tick, refusing to budge until the final blow sent it tumbling free.\n\n*I did it!*\n\nA surge of satisfaction washed over him. The sensation reminded him of finally clearing a blocked nostril after days of congestion. Pure, visceral relief.\n\n\"Yes! Success!\" Peak Sword straightened, brandishing the stone overhead. \"I got one!\"\n\nA year and a half of grinding through Satisfy. Hunting, raiding bosses, fighting rival guilds. All of it had led him to 16th place on the unified rankings. But this? This felt different. The raw pleasure of extraction, of tearing something valuable from the earth itself, sparked something new in his chest.\n\n*Should I learn the mining skill?*\n\nHe turned toward Grid, waving the fire stone like a trophy. \"How about it? Didn't I do well?\"\n\nGrid's thumb shot up from across the chamber, his attention still locked on Hell Gao. \"Well done.\"\n\n\"Ohh!\"\n\nWarmth bloomed in Peak Sword's chest. Then reality crashed down.\n\n*Wait. What am I doing right now?*\n\nHe was the master of the Silver Knights Guild. Sixteenth on the unified rankings. A grown man in his thirties, and here he was, tail wagging like an eager puppy for someone a decade younger.\n\n*Get it together.*\n\nPeak Sword shook his head and focused on the battle. Grid looked relatively unscathed despite the prolonged fight. Hell Gao, by contrast, bled from multiple wounds. Both of his hands lay somewhere on the dungeon floor, severed at the wrists.\n\n*Incredible.*\n\nThe monster who'd massacred 200 Silver Knights members, all averaging level 140, was being pushed back.\n\n*The dignity of a legendary class.*\n\nPeak Sword's mind drifted to Bairan. Four months ago, the world had watched breathlessly as the Tzedakah Guild faced annihilation. He'd gathered his guild in a pub that night, and they'd all predicted the same outcome. The Yatan Church would crush them. Neberius and Balak were simply too strong, their numbers too overwhelming. The Tzedakah Guild had no chance.\n\nThen Grid appeared.\n\nHe'd tossed armor to Vantner, a weapon to Toon, and unleashed Pagma's Swordsmanship on Neberius. The pub had erupted. Peak Sword's blood had boiled with the rest of them. For one glorious moment, the entire world had held its breath.\n\nAfterward, the critics emerged. They mocked Pagma's Descendant for his clumsy control, claiming he relied too heavily on powerful items. But Peak Sword disagreed. Pagma was fundamentally a blacksmith. Of course his descendant would leverage superior equipment. That was the class's entire identity. Grid fought exactly as he should.\n\nAnd now, watching Grid trade blows with Hell Gao, Peak Sword saw that philosophy in action. The armor and weapon radiated legendary power. Seven golden blades moved with autonomous precision. A ring pulsed with what had to be a regeneration effect. Grid's control remained mediocre, but the sheer quality of his equipment elevated him to ranker-level strength.\n\nHell Gao's onslaught continued unabated. Handless or not, the demon refused to yield.\n\n*Hurry. Two more fire stones.*\n\nPeak Sword gripped his pickaxe. Grid represented Korea's best hope in Satisfy. If Peak Sword could help him succeed here, if Grid could continue growing at this monstrous pace, maybe one day he'd inspire the entire nation. But there were still mountains to climb.\n\n\"Back to mining!\"\n\n**Kaaang! Kaaang!**\n\nPeak Sword located another vein and swung. For now, he wasn't Peak Sword.\n\nHe was Peak Pickaxe.\n\n---\n\n\"I'm worried. So worried.\"\n\nToban paced across the resting room floor in Bairan Castle. Returning guild members grimaced at the sight of their chief of staff.\n\n\"What happened? You look terrible.\"\n\nToban grabbed his head with both hands. \"Grid went to mine fire stones.\"\n\n\"And?\"\n\n\"He told me to believe in him. Twice.\"\n\nOnce before leaving for Cork Island. Once after arriving. Two distinct instances of those cursed words.\n\n**Kwaduduk!**\n\nToban's nail cracked from the pressure of his grip. The guild members recoiled.\n\n\"Grid said it?\"\n\n\"Believe in him? Twice?\"\n\n\"That's the worst possible sign.\"\n\nThe numbers spoke for themselves. After preventing the Yatan Church's invasion, Grid had spent four months in production. 142 items total. 25 Normal. 84 Rare. 30 Epic. 3 Unique.\n\nBad luck? Operator sabotage, as Grid insisted? Either way, the pattern was undeniable. Early on, Grid had produced legendary items with shocking consistency. Two, in fact. But for the past four months, he'd been mired in a creative drought.\n\nThe guild members appreciated his work. Even his Rare-rated items outperformed standard equipment by 20%. But disappointment lingered. Especially for those who'd received Normal-rated gear from a legendary blacksmith. The irony burned.\n\nWorse still was the pattern. Every time Grid believed he'd create a legendary item, every time he uttered those damning words, the result was Normal. The guild had learned to dread \"Believe in me.\" It was a death sentence for quality.\n\nAnd now he'd said it twice.\n\n\"Believe in me.\"\n\nToban's voice cracked. Could Grid even collect three fire stones? The odds seemed grim. His instincts rarely led him astray.\n\nAnother guild member voiced the obvious question. \"If he fails to make the Fire Shield, do we delay the Phoenix raid?\"\n\n\"Probably. Vantner won't survive without it.\"\n\nGloom settled over the room. They'd grown so much stronger with Grid's equipment. The Awakened Guardian of the Forest fell easily now. Higher-level bosses awaited. But without the right gear, they'd hit a wall.\n\n---\n\nThe fourth floor of Cork Island's dungeon.\n\n**Jeurereuk.**\n\nBlood streamed steadily from Hell Gao's severed wrists, hissing where it struck stone.\n\n**Chiik!**\n\nAcrid smoke rose. Grid wrinkled his nose. \"Why does your blood smell like rot?\"\n\n\"Shut up!\"\n\nHell Gao's body bore dozens of wounds. The demonkin form proved weaker than anticipated. Worse, Peak Sword had claimed a second fire stone, draining Hell Gao's reserves. More than half his black flames had faded to jade.\n\n*This is bad.*\n\n'*Another disgraceful loss to a human.*'\n\nHe'd thought Sword Saint Muller was an anomaly. A once-in-a-millennium aberration. But Muller had been dead for over a century, and now this. The other demons were right. Human potential could never be dismissed.\n\n*If I lose to humans twice, I'll be a laughingstock in hell.*\n\nSurrender wasn't an option.\n\n\"I will kill you!\"\n\nHell Gao swung his stumps. Blood sprayed from the wounds, coating Grid in crimson droplets.\n\n> [You have suffered 1,850 damage.]\n\n> [You have suffered 1,790 damage.]\n\n*Damage from blood drops? This damn monster!*\n\nGrid flinched. Hell Gao cauterized his wounds with his own burning vitae, then fixed Grid with murderous hatred.\n\n\"I'll drag your soul to hell and chain you there forever!\"\n\n**Kwa kwa kwang!**\n\nHell Gao's tactics shifted. Without hands to wield his staff, magic became his sole weapon. Scorching winds and hellfire erupted in rapid succession.\n\n**Pepepepeng!**\n\n\"Ugh!\"\n\nGrid dodged desperately, unable to close the distance. Hell Gao's lips curled.\n\n*Yes. He's a swordsman. Range favors me.*\n\nHell Gao had lost half his strength since the battle began. But by human standards, his magic remained bottomless. He generated hellfire every 0.3 seconds, a solar-powered laser gun that never ran dry.\n\n\"Come! Burn to ash!\"\n\n**Kwa kwa kwa kwang!**\n\nThree fire rays converged. Grid's escape route vanished. The pavranium responded before he could think.\n\n**Chwachwachwachwachwachwa!**\n\nThe seven blades assembled into a triangular shield.\n\n**Kwa kwa kwa kwang!**\n\nGold met flame. The shield buckled and crashed to the floor. Residual heat washed over Grid's exposed body. Hell Gao aimed for his heart.\n\n\"Your death approaches.\"\n\n**Kwaaaang!**\n\n> [You have suffered 3,900 damage.]\n\n> [You have suffered 4,150 damage.]\n\n> [You have been hit by a lethal blow!]\n\n> [You have suffered 8,870 damage.]\n\n\"Ohh!\"\n\n**Flop!**\n\nGrid crumpled. His thoughts spun.\n\n*I thought cutting off his hands would end this. He was easier to fight when he had his staff.*\n\nHell Gao had definitely weakened after losing the second fire stone. The hellfire damage had dropped noticeably. But \"weakened\" was relative. The demon remained overwhelming.\n\n*I need to close the distance.*\n\nTranscend could strike from range, but it only lasted thirty seconds. Better to save that trump card. Close combat was the answer.\n\nExcept Hell Gao controlled the battlefield with synchronized hellfire and wind attacks. Grid couldn't find an opening.\n\n**Hwaruruk!**\n\nThirty fire spheres materialized around Hell Gao. He cackled.\n\n\"Kuahahaha! This is the end!\"\n\n**Pepepepeong!**\n\nThe spheres launched simultaneously, each on a different trajectory. Seven blades couldn't possibly block them all.\n\n*Some damage is unavoidable.*\n\nGrid yanked three darts from his belt.\n\n**Pepepeng!**\n\nFog erupted where he stood. The thirty spheres plunged into the gray cloud and detonated as one.\n\n**Kwaaaaang!**\n\n\"Ugh!\"\n\nIn the corner, Peak Pickaxe, no, Peak Sword, fell on his rear. The entire dungeon shook. He whipped around toward Grid's position.\n\nThe fog cleared. The blast zone lay empty.\n\n\"It can't be.\"\n\nHad Grid been reduced to particles? Turned into a gray light?\n\n\"This can't be happening!\"\n\nPeak Sword's chest tightened. Hell Gao threw his head back and laughed.\n\n\"Kuahahaha! That cockroach is finally ash!\"\n\nHuman flesh was fragile. No one could survive thirty hellfire spheres unscathed. Grid's armor was exceptional, and the golden blades provided additional protection, but there were limits. Hell Gao savored his victory.\n\nUntil...\n\n\"What?!\"\n\nHis laughter died. Hell Gao spun toward the dungeon's center. Only he remained, or so he'd thought.\n\n\"Pagma's Swordsmanship.\"\n\nGrid pulled down the zipper of his Hooded Zip-Up and materialized from the air. Hatred and killing intent radiated from his <span class=\"rarity-legendary\">blue greatsword</span>, focused entirely on Hell Gao.\n\n\"Kill.\"\n\n**Puoook!**\n\nA massive wound opened across Hell Gao's torso.\n\n---\n\n**Glossary of Common Korean Terms:**\nOG: Glossary Link\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}