{
  "id": 167,
  "title": "Chapter 167",
  "content": "# Chapter 167\n\nTwenty-four seconds earlier.\n\n*Damn.*\n\nGrid's muscles locked as Hell Gao conjured dozens of black spheres from nothing. Each one radiated heat that blistered the air. Could he survive a barrage where every impact dealt 3,700 to 4,200 damage?\n\n*Twenty-nine, thirty.* His eyes tracked the forming orbs. *He's not actually going to launch them all at once, is he?*\n\nHell Gao's flames were fast. Explosive. If thirty spheres came at him simultaneously, dodging was a fantasy. Blocking them all? Even less likely.\n\n*Worst case scenario, I burn the invincible passive.*\n\nGrid abandoned his defensive stance. His grip shifted on Failure's hilt.\n\n*They say a crisis is an opportunity.*\n\n**Pepepepeng!**\n\nHe focused on the thirty fireballs hovering in the air. Beyond the flames, Hell Gao's face twisted into something between monster and man. A thick, cruel smile stretched across those bizarre features.\n\n*That bastard thinks he's already won.*\n\nGrid had survived enough battles to recognize overconfidence. The moment before victory was when guards dropped. When weakness showed.\n\n*If the passive can't save me, then defending is pointless. Better to hit back.*\n\nHe'd faced knight Leo of Winston back when he was weak and pathetic. During his mid-levels, Malacus and the Guardian of the Labyrinth. After that came Shay's party, the Pope, the Awakened Guardian, Neberius.\n\nDifferent enemies. Same lesson.\n\n*I have to eat some damage.*\n\n**Pepepeng!**\n\nGrid hurled Kenen's darts. The belt generated random effects. Fog, poison fog, or explosion. He needed the first. Vision had to go.\n\nGray mist bloomed across the chamber.\n\n*Yes.* \n\nHe barked a command at the pavranium. *Protect me as much as you can.*\n\nThe seven golden blades shot into motion. They formed a rotating barrier as thirty black fireballs punched through the fog.\n\n**Kwa kwa kwa kwang!**\n\nThe blades moved with inhuman precision, but thirty targets was too many. Gaps appeared. Fireballs slipped through. They slammed into Grid's armor like hammers made of hate.\n\n**Kwa kwa kwa kwang!**\n\n> [You have suffered 3,870 damage.]\n\n> [You have suffered 3,920 damage.]\n\n> [You have been hit by a lethal blow!]\n\n> [You have suffered 8,100 damage.]\n\n\"Ugh!\"\n\nGrid raised the Divine Shield to catch the worst of it, but the shielded areas were limited. His health plummeted. He fumbled a potion from his inventory and chugged it while yanking the Hooded Zip Up over his armor.\n\n**Suuuk.**\n\nThe cloak activated. Kruger's legendary craftsmanship reproduced perfectly. As explosions rippled across the chamber, Grid's body vanished from sight.\n\n\"Kuahahaha! That cockroach has finally been turned to ash!\"\n\nHell Gao's laughter echoed off stone walls.\n\nGrid equipped the Ideal Dagger. Quick Movements kicked in. His legs pumped as he sprinted toward the demon at inhuman speed. Hell Gao had been weakened twice now. His detection ability was a shadow of what it had been.\n\n> [You have been detected by Hell Gao, the Master of Hellfire.]\n\n> [Stealth has been turned off.]\n\nHell Gao's head snapped around when Grid closed to three meters. The invisibility shattered.\n\n\"What!?\"\n\n\"Pagma's Swordsmanship.\"\n\nGrid had already summoned the red lightning. It coiled around Failure's blade like a serpent. Blacksmith's Rage flooded his veins with chemical fire. He drove the greatsword toward Hell Gao's chest and called his strongest technique.\n\n\"Kill!\"\n\n**Puoook!**\n\n> [Critical!]\n\n> [You have dealt 538,000 damage to the target.]\n\nRed lightning, Blacksmith's Rage, and the +9 <span class=\"rarity-legendary\">Failure</span> combined into overwhelming violence. Hell Gao's health gauge dropped from seven-tenths to half.\n\nBut Grid's jaw tightened. Neither 5 Joint Attacks from the <span class=\"rarity-legendary\">Holy Light Gloves</span> nor from <span class=\"rarity-legendary\">Failure</span> had triggered.\n\n*If both had activated. Ten strikes total. He'd be dead.*\n\nNo point dwelling on it. Grid had closed the distance. That was the victory that mattered.\n\n\"Cough! You bastard!\"\n\nHell Gao's face went rigid. Blood the color of tar leaked from his chest. The demon finally understood danger.\n\n**Chwaack!**\n\nGrid twisted Failure deeper into Hell Gao's sternum.\n\n\"Now it's your turn.\"\n\nEvery skill except Transcended Link had cycled off cooldown. Kill was spent, but Link remained ready.\n\n\"Pagma's Swordsmanship, Link!\"\n\n**Pipit! Pipipipipit!**\n\nGrid's body moved through the forms with practiced ease. Dozens of energy blades materialized in the air.\n\n> [The level of Pagma's Swordsmanship, Link has increased.]\n\n> [Your damage will increase. The number of times a target is hit will increase by 5 times.]\n\n> **[Link Lv. 3]**\n> \n> *A dazzling sword dance like butterfly wings.*\n> \n> Deals 1,100% of your attack power to a single target.\n> \n> **Skill Usage Conditions:** Sword-type weapon equipped.\n> \n> **Skill Mana Cost:** 500\n> \n> **Skill Cooldown Time:** 100 seconds\n\nFive months since the Pope's death. Hundreds of uses. Finally, the level had risen. Grid's lips pulled back in a feral grin. Hell Gao's face twisted into something uglier than before.\n\n\"Kuaaaack!\"\n\n> [You have dealt 154,600 damage to the target.]\n\nHell Gao had been weakened twice, but 150,000 damage wasn't a killing blow. The demon recovered his balance and sprayed flames wildly across the chamber.\n\nGrid pressed forward. \"Where are you aiming?\"\n\nHe closed the gap until Hell Gao's flames couldn't track him properly. Pagma's Swordsmanship, Wave, swept out in a circle. The energy canceled Hell Gao's fire. Grid followed with Restraint. Three seconds of helplessness locked the demon in place.\n\n*Looking back, Transcended Link only became possible after Link reached level 2.*\n\nGrid's mind raced. He stepped toward Hell Gao's shrinking form and prepared two skills in rapid sequence.\n\n*Now that Link is level 3, can I combine it with something else?*\n\nWorth testing. Kill seemed the most promising fusion target. If that failed, he'd try Wave.\n\n\"Pagma's Swordsmanship!\"\n\nGrid began the sword dance. Killing intent gathered at Failure's tip like a physical weight. Hell Gao broke free from Restraint's influence. Flame coalesced in his left hand. Hot wind in his right. The demon merged both forces together.\n\n*Can't take that hit again.*\n\nHell Gao fired the combined attack in a straight line.\n\n**Kwa kwa kwa kwang!**\n\nThe ground charred black. A whirlwind of flames roared toward Grid. \n\nGrid's dance reached its conclusion.\n\n\"Kill, Link.\"\n\nIf the fusion failed, Grid's remaining health would drain to zero. The invincible passive would trigger.\n\n*Please.*\n\nLess than a second. Grid prayed for success. Hell Gao prayed for death.\n\n**Kwajak!**\n\nFailure collided with the flame whirlwind. The fires didn't consume the blade. They were drawn into it. The greatsword's light intensified until it burned brighter than Hell Gao's flames.\n\n*Yes!*\n\n> [The new skill fusion has succeeded.]\n\n> [Fusion skill 'Linked Kill' has been created.]\n\n> [Your Intelligence has increased by 10 due to the successful fusion of a new skill.]\n\n> **[Linked Kill]**\n>\n> *A sword dance combining hatred with the dazzling flapping of wings.*\n>\n> *Due to the weight of Kill, the dazzling style is reduced, but the strength of Kill is overpowering.*\n>\n> Generates a minimum of 3 to 7 random blows dealing 1,500% damage per hit (current Kill damage minus 300%).\n>\n> * This skill does not share cooldown with Kill and Link.\n> * **Warning:** Stamina will be fully depleted if 7 strikes occur.\n>\n> **Skill Mana Consumption:** 90% of maximum mana\n>\n> **Skill Cooldown Time:** 1 hour\n\nThe power of Kill, slightly reduced. Not as devastating as Kill plus 5 Joint Attacks, but the advantage was clear. Three strikes guaranteed. No relying on RNG.\n\n**Duguen! Duguen!**\n\nGrid's heart hammered against his ribs. The first Linked Kill strike crushed through the fire whirlwind's power.\n\n**Jjejeong!**\n\n*He still has this much left?*\n\nGrid was clearly injured. Blood seeped from burns beneath his armor. Yet he continued to unleash devastating attacks. Hell Gao's confusion was palpable.\n\n*Is he even human?*\n\nSuch tenacious vitality. Grid truly resembled Muller. Hell Gao was forced to acknowledge this as the blue greatsword penetrated the remnants of flames.\n\n> [You have suffered 215,000 damage.]\n\nSecond blow.\n\n> [You have suffered 219,800 damage.]\n\nThird blow.\n\n> [You have suffered 214,600 damage.]\n\nFourth blow.\n\n> [You have suffered 220,100 damage.]\n\nFifth blow.\n\n> [You have suffered 218,700 damage.]\n\nSixth blow.\n\n> [You have suffered 219,200 damage.]\n\nThe end? \n\nNo.\n\nLike a restaurant on opening day offering ridiculous service, Grid received a bonus for his successful fusion.\n\n> [Failure's option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n\nNotification windows erupted across Grid's vision as he struck Hell Gao.\n\n> [You have dealt 1,057,300 damage to the target.]\n\n> [Failure's option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n\n> [Critical!]\n\n> [You have dealt 2,230,900 damage to the target.]\n\n\"...!\"\n\nHell Gao couldn't even scream. The black flames wreathing his body shifted to jade, then extinguished completely. Grid's strongest skill combined with his strongest item's option drove Hell Gao toward death in an instant.\n\nGrid looked down at the kneeling demon. \"I am in the same class as Muller.\"\n\n**Pisik.**\n\nHell Gao nodded for the first time. \"I admit it.\"\n\nHe had watched this human called Grid grow during their battle. Eventually, Grid would follow Muller's path.\n\n\"I lost. I will postpone my purpose of consuming human souls to increase my strength.\"\n\nHell Gao admitted defeat. The demonkin's body disintegrated into fog.\n\n**Pepeng! Pepepeng!**\n\nThe two unmined fire stones exploded as Hell Gao vanished.\n\nPeak Sword jerked upright. \"The fire stones?\"\n\nHe'd been so absorbed watching the battle that mining had slipped his mind completely. Grid was focused on notification windows and didn't notice.\n\n> [You have defeated Hell Gao, the Master of Hellfire, who seizes human souls.]\n\n> [Memphis' Egg has been acquired.]\n\n> [118,411,132 experience has been acquired.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has...]\n\nEleven levels at once. Grid reached level 253. That put him comparable to the top 300 rankers, though still the lowest in the Tzedakah Guild. And the reward was some strange egg.\n\nPeak Sword approached cautiously. \"In the end, only two fire stones were mined. That's serious damage.\"\n\nHell Gao had been the most powerful boss Grid had ever faced. The rewards felt inadequate for the effort invested. He collapsed onto the stone floor. His stamina was completely depleted. Even lifting a finger seemed impossible.\n\nPeak Sword jogged over. \"Are you okay?\"\n\nGrid's frown deepened into a scowl. \"Am I okay? What will you do if I'm not okay? Give me the fire stone you mined?\"\n\nPeak Sword's response came without hesitation. \"Of course.\"\n\nHe pulled out the fire stone. The mineral glowed with internal heat.\n\n\"I'll give this to you.\"\n\nFire stones were so valuable that pricing them was nearly impossible. But Peak Sword's life and ranking had been saved by Grid. This was gratitude made tangible.\n\nGrid grabbed the fire stone and muttered under his breath. \"I need one more. I tied Hell Gao up for ten minutes. How did you only get one fire stone in that time? Your level isn't good enough. Pretty pathetic.\"\n\n\"...\"\n\nPeak Sword was ranked sixteenth on the unified rankings.\n\n---\n\n**Glossary of Common Korean Terms**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing the day's content."
}