{
  "id": 168,
  "title": "Chapter 168",
  "content": "# Chapter 168\n\nReality and Satisfy.\n\nPeak Sword, ranked 16th, had built a successful life in both worlds.\n\nHe stared at Grid with barely concealed wonder. *There's someone who actually treats me like this. Grid, you're the first man since I went to the army 17 years ago.*\n\nPeak Sword couldn't adapt to Grid's treatment of him. But he didn't feel bad. Patriotism was a hell of a drug, and Grid looked beautiful through that lens, no matter how the man acted.\n\n\"Were there any good items?\"\n\nGrid shook his head. He pulled out an egg. \"This is the only thing that dropped. I didn't even get one silver.\"\n\n\"A bean?\"\n\n\"It's an egg.\"\n\nPeak Sword blinked. \"What? That's an egg?\"\n\nThe object was twice as small as a quail egg. It looked more like a bean or small bead. Grid pulled up the item window and turned it toward Peak Sword.\n\n> **[Memphis's Egg]**\n> \n> Memphis' egg.\n> \n> Weight: 1\n\nPeak Sword frowned. \"Hah. It's really an egg? If so, is this a pet egg?\"\n\nHell Gao, the master of hellfire, was a formidable adversary. The item he dropped couldn't be ordinary. Peak Sword didn't doubt that a monster with the name of Memphis would hatch. \n\nGrid thought differently.\n\n\"Do you know what a memphis is?\"\n\n\"No? It's the first time I've heard of it.\"\n\nGrid gestured at the window. \"Look. It's impossible to grasp what type of pet it is.\"\n\nSatisfy's pets gave their owners various effects. In rare cases, there were pets that increased the amount of experience or drop rate of items, so the users' interest in pets was very high. South Korea broadcasted several Satisfy pet-related programs. Grid knew the basic information about pets.\n\nHowever, the name Memphis was unfamiliar.\n\nEven more suspicious.\n\n\"If this is a pet, there should be a hatching method in the item description.\"\n\nGrid had a point. All pets had a brief explanation of the hatching method. However, Memphis' Egg didn't describe how to hatch it. Rather, it only had a short description of 'Memphis' egg.'\n\n\"Even if you are right that it is a pet, it's useless if I don't know how to hatch it.\"\n\nPeak Sword nodded. \"That's right. Even if that bean is an egg, it looks like you'll never see what is inside.\"\n\nGrid frowned. He put Memphis' Egg back into his inventory.\n\n\"I'll ask the guild members to research the identity of the egg.\"\n\n\"I will also use my network to find out.\"\n\n\"Thank you.\"\n\nGrid didn't have any expectations. *This egg is more likely to be a cooking ingredient than a pet.*\n\nHe ran a hand through his hair. *Considering that Hell Gao is such a strong guy, eating it might be similar to an elixir that permanently raises my stats.*\n\nFor ordinary users, elixirs that permanently raised stats were very rare. But in the case of production class users like Grid, they didn't feel a huge need for elixirs because producing items raised their stats.\n\n*That damn Hell Gao. He should've dropped equipment instead of this.*\n\nDidn't the pope drop three legendary items, despite being much weaker than Hell Gao? Grid had been hoping that Hell Gao would drop legendary items. But the reality was the worst, so he felt down.\n\n*I don't know exactly what the item is, so I can't sell it.*\n\nGrid lay on the floor and looked up at the ceiling. Peak Sword held out a hand.\n\n\"Get up. I want to invite you to my castle. You can eat delicious food and rest there.\"\n\nGrid eyed the offered hand with suspicion. \"Why are you acting so favorable towards me? Are you hoping for something? I didn't lie about the item dropped by Hell Gao. I can't give you anything.\"\n\n\"I don't want anything. Didn't you save my life? I'm just grateful for that.\"\n\n\"But didn't I steal your guild's prey as a result? You must be angry.\"\n\nPeak Sword shook his head. \"In the first place, it was a battle that we couldn't have succeeded with our strength. So I don't feel like it was taken away. It's true that you walked into an area controlled by our guild, but aren't you a Korean? I am happy and grateful to have discovered that the first legendary class is a Korean.\"\n\n\"I see.\"\n\nGrid smiled and grabbed Peak Sword's hand. \n\nAt that moment, Peak Sword's expression turned cold. Grid stopped.\n\n*Did he really have ulterior motives?*\n\nPeak Sword shouted. \"Logout!\"\n\n\"What are you saying?\"\n\nPeak Sword's jaw clenched. \"The Sakura Guild is attacking!\"\n\nThe resurrection point of the Silver Knights members was at Cork Castle. Therefore, the guild members wiped out by Hell Gao resurrected at Cork Castle. Peak Sword had commanded them to wait there and not come back.\n\nBut was someone a mole? Peak Sword's guild discovered that the Sakura Guild somehow knew the situation. They came here, where only a minimum of troops guarded the entry. They had already reached the 2nd floor.\n\n\"Those guys received information that we were challenging the Hell Gao raid today and waited.\"\n\nGrid straightened. \"What is the Sakura Guild?\"\n\nIt was a power in Satisfy that Grid had no clue about. Peak Sword gave a brief description.\n\n\"They are one of the three guilds that represents Japan. Unlike the other two guilds, they are nationalists who are very malicious. Even the Japanese users avoid them.\"\n\n\"They have a grudge against your guild and came here to hurt you, is that right?\"\n\nPeak Sword nodded. He placed a hand on the sword at his waist. He took a fighting posture and declared. \"Log out first.\"\n\n\"What about you?\"\n\n\"I will never run away from guys like that. The guild members are coming, so I will hold on until then.\"\n\nPeak Sword denounced the Sakura Guild as nationalists, but he also seemed quite nationalistic.\n\n*I am tired.*\n\nGrid tried to logout.\n\nBut.\n\n> [The remnants of the great demon Hell Gao's magic power is scattered into the atmosphere. It is impossible to logout due to this disturbance.]\n\n\"Shit.\"\n\nThis damn monster was screwing with him even after death. A chill went down Grid's spine. His stamina was depleted after Linked Kill, and only 60 points had been recovered. With 60 stamina, he couldn't fight for even one minute. This was a huge crisis, because stamina was a different concept from health.\n\n*My invincible passive might activate, but if my stamina is zero, I can't move a single finger and will eventually die.*\n\nPotions to restore stamina didn't exist. Only rest was required to restore stamina, but that was slow. The speed could be slightly increased by eating. In other words, this was bad. Grid hardly ever felt the constraints of stamina thanks to his unusually high persistence stat, making this crisis unfamiliar to Grid.\n\nHe urgently shoved beef jerky into his mouth as he asked, \"What is the Sakura Guild's power? What is the level of their strongest users? How many minutes can you hold on by yourself? When will your guild members arrive?\"\n\nPeak Sword had encountered countless crises while playing Satisfy. He was able to explain calmly, in contrast to the agitated Grid.\n\n\"The Sakura Guild has 180 people. Their master Yoshimura is 2nd in the archer rankings and 98th on the unified rankings. Apart from him, there are eight more rankers in the top 300.\"\n\n*Isn't this formidable?*\n\nGrid's expression stiffened. Peak Sword made a grim prediction.\n\n\"The guild members will take 15 minutes to get here and the amount of time I can hold up alone...\" He paused. \"If I am being generous, it's seven minutes.\"\n\nKwaduduk.\n\nPeak Sword finished his explanation and shouted to Grid. \"Don't think about helping! It is a matter that doesn't have anything to do with you! Go ahead and logout!\"\n\n\"I can't logout.\"\n\nOriginally, it was impossible to logout in raid rooms. But that was only when the boss was present. There were few cases where a user couldn't logout after the boss had died. So Peak Sword misunderstood.\n\n\"Grid...\" Peak Sword's eyes gleamed. \"Do you want to help me because I'm also Korean? While you aren't in a perfect state? Hah, you are a true Korean...\"\n\nGrid waved his hands frantically. \"No, don't talk such nonsense! What drivel are you saying when I really can't logout? I can't logout! I really can't!\"\n\nAt that moment, the Sakura Guild came pouring down the stairs. Peak Sword gulped and continued to babble nonsense.\n\n\"I would like to encourage you to logout. Don't worry. It isn't shameful to logout in front of enemies.\"\n\n*Why? Ah, this really sucks.*\n\nGrid didn't know. The man Peak Sword admired since childhood was Admiral Yi Sunshin.\n\n\"How dare you guys! I will turn you into a river of blood today!\"\n\n\"Bah! Peak Sword! You're the one who will shed blood on this earth today, not us! I'll pay you back for taking Takeshima from us!\"\n\nA small man emerged from among the Sakura Guild members and shouted. It was Yoshimura, the best archer after Jishuka and 98th on the unified rankings.\n\n*It's like a drama.*\n\nGrid was able to grasp the atmosphere of the two people with one glance. The Silver Knights Guild and the Sakura Guild. It was clear that the two people enjoyed the Korea-Japan war in Satisfy more than anyone else.\n\nYoshimura declared, \"Since you're alive, I guess you succeeded in the Hell Gao raid? You, I don't know the jackpot you received, but that joy is short-lived. I will take away everything you obtained.\"\n\nPeak Sword yelled. \"Try it! And this is Cork Island, so stop calling it Takeshima!\"\n\n\"Bah! You still can't grasp the situation!\"\n\nYoshimura made a sly smile. He pointed fingers covered in calluses as he commanded his men.\n\n\"Kill that damn Korean person.\"\n\n\"Ohhh!\"\n\nSeveral months ago, at the time of the contest over Cork Island, Peak Sword had caused terrible agony to the Sakura Guild. It was due to Peak Sword that they lost Cork Island, and many guild members died and lost experience. This was a perfect chance to pay back the grudge of that time.\n\nPeak Sword was 'alone' so their morale skyrocketed. Peak Sword pulled out his sword from the sheath.\n\n\"Draw Sword, annihilate.\"\n\nMultiple lights flashed. The eight knights of the Sakura Guild who had been rushing at the front vomited and collapsed.\n\n\"Your skills haven't gone rusty!\"\n\nThis was the dignity of the 16th rank that made level 150 knights fall into a critical state with one blow. Yoshimura truly admired it. But there wasn't the slightest bit of tension in his expression. Only eight out of the 180 guild members were injured, so the situation didn't change.\n\nOn the other hand, Grid hadn't seen Peak Sword's swordsmanship and was amazed.\n\nThen he heard a strange voice.\n\n*Hungry.*\n\nGrid froze. \"...?\"\n\n*I want to eat.*\n\n\"...\"\n\nIt was the voice of a young boy or girl. It wasn't a hallucination. Where did this voice, filled with a strong greed, come from? Then a notification window flashed in front of Grid.\n\n> [A memphis, the first demonic beast of hell, has hatched due to his greed for human souls.]\n> \n> [You are the first user in Satisfy to become the master of a demonic beast from hell!]\n> \n> [Title, 'Man who has Touched Hell' has been acquired.]\n> \n> [Health has increased by 3,000 points.]\n> \n> [Demonic power stat has opened.]\n\n\"What?\"\n\n\"Huh?\"\n\nGrid made a surprised noise at the notification windows and Yoshimura was surprised to hear it.\n\n\"W-What? That guy?\"\n\nAt this point, all of his followers except for him were struggling with Peak Sword 10m ahead. Yoshimura was nervous when he suddenly heard someone else's voice near him. Then he flinched. A long tail suddenly protruded from empty space. There was an enormous gaping mouth?\n\n\"H-Hik?\"\n\nYoshimura reflexively tried to shoot his bow, but it was already too late. His body was swallowed by that huge mouth.\n\n> [You have lost a part of your soul to the memphis.]\n> \n> [You are more likely to be affected by status conditions.]\n> \n> [There will be a 50% decline in your main stats for 3 seconds.]\n\nSuuk.\n\nYoshimura was spat out after being swallowed. He saw the image of a cat. It was a typical Persian cat. However, it was black, had a small horn on its forehead and small devil wings on its back.\n\nThe cat licked its paws and winked.\n\n\"Hello!\"\n\nThe cat with a horn and wings was talking? In particular, the color of its fur was attractive. It was black all over, except for its four paws which were white as snow.\n\n\"K-Kawaii...\"\n\nYoshimura was a cat lover, so he couldn't help feeling thrilled. He wanted to bring this cat into reality and raise it at home. Then the cat revealed its canines.\n\n\"Delicious!\"\n\n\"Y-You?\"\n\nYoshimura's face turned pale. It was due to the appearance of a person behind the cat. There was no one there a little while ago, but he appeared like he always existed and naturally stabbed with a black greatsword.\n\n\"Keok!\"\n\nIt was a surprise attack. Yoshimura's agility was decreased by 50% so he was slow to move, while his opponent was too fast. Yoshimura lost two-thirds of his health from a single strike and fell into a confused state.\n\n\"Master!\"\n\nThe Sakura Guild noticed the crisis of their master and belatedly shifted their gaze. They were able to see it. A flying cat demon. Then a black-haired man in red armor and a gold tail was cutting down their guild master.\n\n\"T-This is ridiculous...!\"\n\nWas it so easy to kill someone that was ranked 98th on the unified rankings? It was hard just going against Peak Sword. How could they deal with that monster as well? The Sakura Guild lost their willpower and retreated.\n\nGrid and Peak Sword didn't chase after them. Meanwhile, the cat with an enlarged belly walked around Grid and rejoiced.\n\n\"My master is a killer ~~ my master is a killer ~~ killer~~ nyang!\"\n\nThe cat singing the eerie song innocently was the first demonic beast of hell, memphis. It was the worst pet that stole some of the stats from the souls he ate and temporarily gave them to his master.\n\nGrid faced an unfamiliar notification window after killing Yoshimura.\n\n> [Your demonic power has increased by one.]\n\n> **[Demonic Power]**\n> \n> You can communicate with demonic beasts. The higher the number, the more likely you are to enter hell.\n> \n> * Stat points can't be distributed to this stat.\n\n\"I want to go to heaven.\"\n\nThe word 'hell' wasn't very good.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}