{
  "id": 169,
  "title": "Chapter 169",
  "content": "# Chapter 169\n\nHell? Grid pushed the thought away immediately.\n\n*Won't there be more monsters like Hell Gao down there?*\n\nThe demons were too strong. The dropped items weren't worth the trouble either. Grid shook his head, then paused.\n\n*No, wait. That's not quite right.*\n\nHe glanced at the small creature currently grooming itself with a red tongue. The memphis—his new pet—purred contentedly as it licked its midnight-black fur.\n\n*Hell Gao was the strongest boss I've faced. Sure, I only got two fire stones, but this little guy is a treasure all on its own.*\n\nGrid pulled up the pet's information, curious about the species description.\n\n> **[Memphis]**  \n> The most powerful species among the thousands of demonic beasts inhabiting hell.  \n> As adults, their fighting abilities surpass even higher-ranked demonkin, making them favorites of the 33 great demons.  \n> Their poor breeding ability has pushed them to the brink of extinction.  \n> Natural habitat: Hell.\n\n*I managed to obtain something this precious, and I almost dismissed it.*\n\nGrid mentally kicked himself, then examined the creature's status window.\n\n> **Name:** Not Set  \n> **Level:** 1 (0/200)  \n> **Affinity:** 0/100  \n> **Health:** 5,000/5,000  \n> **Physical Attack Power:** 60 | **Magic Attack Power:** 30  \n> **Defense:** 50 | **Magic Resistance:** 80  \n> **Attribute:** Dark  \n> **Status:** Narcissistic  \n> *(As soon as I was born, I ate a human soul with my own strength! I am the best demonic beast of hell! Nyang!)*\n>\n> **Current Skills:**\n>\n> **[Fluidization]**  \n> When attacked, the body becomes fluid like a slime to minimize damage. However, damage from some attribute magic may increase.\n>\n> **[Soul Ingestion Lv. 1]**  \n> Takes away half of the target's highest stat and transfers it to your master.  \n> Skill Cooldown Time: Your own decision.\n>\n> **[Scratch Lv. 1]**  \n> Your paws attack and poison the target.  \n> Skill Cooldown Time: Whenever you like.\n\n*He gained zero experience from defeating Yoshimura. So PK doesn't grant experience to pets?* Grid studied the skills more closely. *Anyway, his abilities at level 1 are incredible. Soul Ingestion is practically cheating.*\n\nThe fact that the cooldown depended entirely on the memphis' whims was annoying, but Grid could work with that. He'd train the creature properly. A grin spread across his face.\n\n\"Master, do you like me? Nyang!\" The memphis ceased its grooming and stared up at him.\n\nGrid's expression softened as he regarded the cat. *Sehee would love something this cute. She has no hobbies besides studying. Maybe I should buy her a capsule?*\n\nThe memphis' eyes curved into cheerful crescents, appearing sweet even to Grid's critical eye. He found himself genuinely wanting to show his little sister this creature.\n\n\"Yes, I like you.\"\n\n\"Of course you do!\" The memphis puffed out its small chest. \"I am elegant, beautiful, and powerful. I am the best demonic beast of hell! Nyang!\"\n\nThe creature's large, round eyes narrowed into slits. Then it sniffed disdainfully and delivered a verbal blow that struck Grid's heart like a physical attack.\n\n\"But I don't like Master.\"\n\n\"Eh?\" Grid blinked. \"Why?\"\n\n\"You are ugly! I don't like you!\"\n\nGrid's face went blank.\n\n\"Take a look twice, can't unsee it! Nyang nyang!\"\n\nRecently, Grid hadn't heard such blunt criticism about his appearance. He'd built up confidence. People no longer recoiled or fled when he smiled at them. Having a *cat* call him ugly shouldn't have stung as much as it did.\n\nThe memphis seemed to notice his dismay. \"Don't worry! I won't abandon you because you're ugly! You can be ugly! Master just needs to entertain me!\"\n\nGrid's eye twitched.\n\n*This damn cat. Does it not understand the meaning of the word 'master'?*\n\nThe cat should honor and serve him, yet here it was demanding to be entertained.\n\nGrid's expression twisted into something dark. Peak Sword, watching from nearby, burst out laughing.\n\n\"It looks like a cat, but its nature is completely different.\" Peak Sword wiped his eyes. \"Won't you be struggling in the future?\"\n\n\"Well...\" Grid exhaled slowly. \"I can tolerate some things if I have this pet.\"\n\nThe first step to building affinity with a pet was naming it. Grid mulled over what to call the memphis.\n\n*If it were a dog instead of a winged cat, 'Dog' would be perfect.*\n\nWhat name suited this prideful creature? Grid settled on something appropriate.\n\n\"Slave.\"\n\n\"Nyang?\"\n\n\"Your name is Slave.\"\n\n\"Kyaak!\"\n\nThe memphis erupted into motion, flapping its wings furiously as it circled Grid's head. Its fur bristled in outrage.\n\n\"Master's naming sense sucks! How can a noble beast of hell be a slave? Master is crazy! Nyang!\"\n\nGrid recoiled as the memphis extended its claws, genuinely surprised.\n\n*This cat doesn't know the meaning of 'master,' but it knows 'slave'?*\n\nIf affinity dropped into the negatives, the pet could escape. Grid needed to prevent disaster. He quickly backtracked.\n\n\"You heard wrong. It isn't Slave, it's Noe. Noe.\"\n\n\"Noe?\" The memphis tilted its head, confusion replacing anger. \"What does Noe mean? Nyang?\"\n\nGrid waved his hand vaguely. \"A slave is... Noe means you are *not* a slave. That's what it means.\"\n\n\"Oh...! Ohhhh!\"\n\nThe memphis' wild eyes transformed back into cheerful lanterns. As a demonic beast of hell, it possessed considerable knowledge from birth, but it was still just a kitten. Something about Grid's words sounded wonderful and profound.\n\n\"Good! I am Noe! Nyang!\"\n\nThe creature rubbed its cheeks against Grid's arm affectionately. Grid laughed at the poor, gullible little beast.\n\n\"Okay! Your name is Noe.\"\n\n> **[Do you want to set the memphis' name to 'Noe'?]**\n\n*Yes.*\n\n> **[The memphis' name has been set to Noe.]**  \n> **[Affinity with Noe has risen by 5.]**\n\nNoe placed a paw on his engorged belly and announced proudly, \"You are Master and I am Noe!\"\n\n\"Correct.\"\n\nGrid raised his thumb with mock solemnity. Noe looked satisfied with this arrangement.\n\nPeak Sword clicked his tongue. *Giving that name to a demonic beast...*\n\nGrid truly wasn't ordinary. \n\nThey left the dungeon shortly after and headed for Cork Castle.\n\n\"Ohh! The return of the heroes!\"\n\n\"You cut down Yoshimura?\"\n\nThe guild members swarmed Grid and Peak Sword, praising them for defeating both Hell Gao and the Sakura Guild. They tried to question Grid directly, but Peak Sword intercepted.\n\n*He didn't register in the rankings, so he probably doesn't want people knowing he's Pagma's Descendant.*\n\nPeak Sword possessed keen insight as the head of an organization. He protected Grid's identity, instead highlighting their success by explaining Hell Gao's weakness to fire stones.\n\n***\n\nThat night, Grid enjoyed a banquet and built genuine friendships with Peak Sword and the Silver Knights Guild. Some guild members caused a ruckus after drinking too much, but fortunately nothing serious occurred.\n\nThe next morning came quickly. Peak Sword approached Grid carefully as he prepared to depart.\n\n\"You aren't participating in the National Competition this year?\"\n\nGrid shook his head. \"A strange woman put my name on the participant list, but I have no intention of going. I don't want to expose my identity, and there isn't much benefit to participating.\"\n\n\"I see.\" Peak Sword nodded slowly. \"But I hope you change your mind next year. As a man, fighting for your country's honor isn't a bad experience. I'll participate next year. Let's join together.\"\n\n\"I'll think about it.\" Grid moved toward the terrace. \"As a reservist, I'm already in the arduous position of defending our country's security.\"\n\nGrid stepped outside, savoring the smell of salt on the wind. He turned back to Peak Sword.\n\n\"Let me know if Hell Gao respawns normally during the next cycle. I need one more fire stone.\"\n\n\"I understand. But as I said yesterday, Hell Gao probably won't appear for a while. He's likely to be replaced by other high-ranking demonkin.\"\n\n\"I'll look forward to it, then.\" Grid activated Fly. \"I'm leaving now.\"\n\nHe lifted into the air and flew away from the island, disappearing into the horizon. Peak Sword watched him go, thoughts churning.\n\n*The greatsword with fraudulent attack power. The golden blades. The invisibility cloak. And now boots with Fly magic attached. Amazing. This game truly is about items.*\n\nEnvy gnawed at him. *I want to obtain items like that soon.*\n\nGrid's voice entered his ears through whisper.\n\n**—If you have a request to produce an item, contact me. I'll add you to the schedule. Of course, it's a paid service.**\n\nPeak Sword's face lit up. \"Ohh...!\"\n\nHe could commission items from a legendary blacksmith!\n\n**—Thank you, Grid!**\n\nThe two became considerably closer after sharing secrets.\n\n***\n\n\"Grid!\"\n\nToban waited at Khan's smithy as Grid returned after six days. Grid's good mood from obtaining Noe evaporated the moment he saw Toban's expectant face.\n\n\"Good work!\" Toban stepped forward eagerly. \"Did you obtain the fire stones?\"\n\nGrid met Toban's hopeful expression and pulled out two fire stones.\n\n\"I'm lacking one.\"\n\n\"Kuk!\" Toban's shoulders slumped.\n\nHe'd already predicted this outcome the moment Grid said 'Believe in me.' Still, having his suspicions confirmed hurt. Grid bowed his head slightly.\n\n\"I'm sorry. I did my best, but Hell Gao was too strong. Focusing on mining was impossible.\"\n\nToban's eyes widened. \"Why are you apologizing? Is this something you should apologize for? I'm grateful you even tried.\"\n\n*To think he would apologize.* Grid really had changed. He felt like a completely different person compared to the Grid Toban first met.\n\n*Can people mature while playing a game?*\n\nAnyone could grow stronger by leveling up. That was normal game design. But the level-up system wasn't meant for internal personal growth. So how had Grid changed so fundamentally?\n\nToban considered it a small miracle.\n\n\"In the past four months, Vantner put all his stat points into stamina. He can play the tanker role now. Even without the Fire Shield, there's a chance we can succeed in the Phoenix Raid with him. Don't worry about it.\"\n\n\"Then I'm glad.\" Grid pocketed the fire stones. \"I'll keep these for when you're ready to craft the Fire Shield.\"\n\n\"Yes, thank you. By the way...\" Toban's expression shifted. \"Why did you ignore Jishuka's whisper?\"\n\n\"Jishuka?\" Grid frowned in confusion. \"Jishuka never whispered me.\"\n\n\"On the day you left for Cork Island, Jishuka kept trying to contact you. There was no response.\"\n\nGrid searched his memory and nodded slowly.\n\n\"Ah. I was busy flying that day and ignored several whispers. Jishuka's might've been among them. Why was she trying to reach me?\"\n\n\"She wanted your home address.\"\n\n\"My home?\"\n\n\"She came to South Korea and wanted to meet you.\"\n\n\"Hrmm...\"\n\nGrid considered this, feeling a pang of regret. The guild members who'd come to South Korea for the National Competition were Jishuka, Pon, and Regas. This was a rare opportunity to meet all of them in person.\n\n*I definitely want to meet them. If I don't this time, will I get another chance?*\n\nHe'd regret missing the opportunity to see Jishuka, who earned hundreds of millions of won for a few hours of photoshoots. Grid checked the time.\n\n\"What day of events is it in reality?\"\n\n\"The second day. Target Processing and Siege.\"\n\n\"The second day...\" Grid muttered. \"Target Processing and Siege.\"\n\nThe National Competition dominated every TV channel. Grid couldn't help but memorize the schedule.\n\n\"Maybe I should go.\"\n\nHe said goodbye to Toban and logged out."
}