{
  "id": 17,
  "title": "Chapter 17",
  "content": "# Chapter 17\n\nSmith wiped the soot from his hands, his lesson complete.\n\n\"Words alone won't suffice.\" He gestured toward the blast furnace. \"Watch closely.\"\n\nThe old blacksmith measured out iron ore, coke, and limestone with the precision of decades of practice. The furnace roared to life beneath his hands. Within minutes, sweat plastered his tunic to his chest as he worked the bellows, stoking flames that turned the air itself into a wavering mirage.\n\nThe coke ignited. The iron ore began its transformation under the relentless heat, reduction reactions Grid barely understood turning solid rock into molten metal. Limestone separated the iron from its impurities, forming slag that Smith filtered with practiced efficiency. Black debris bled through holes at the furnace base while the molten iron brightened to orange.\n\n\"Once this cools, it becomes pig iron.\" Smith never stopped moving, adjusting the airflow, maintaining the temperature. \"Too much carbon. Hard but brittle. Worthless for weapons. We reduce the carbon through steelmaking.\"\n\nHe glanced back. \"Understand smelting now?\"\n\nGrid nodded.\n\n\"Good.\" Smith's expression softened. \"Jaffa ore is simpler. Fewer impurities, lower melting point. The ratio is twelve parts jaffa, two parts coke, four parts limestone.\"\n\n> **[Mineral Smelting]**  \n> **Difficulty: E**  \n> Mineral smelting forms the foundation of all production. Smith entrusts this task to you, an aspiring blacksmith.  \n> **Quest Clear Conditions:** Successfully smelt jaffa ore.  \n> **Quest Reward:** Affinity with Smith +30, Experience +80, 300g smelted jaffa.  \n> **Quest Failure:** Perfecting mineral smelting takes practice. Smith will understand if you fail.\n\nNo reason to refuse. Grid accepted.\n\nSmith prepared a second furnace. \"Don't fret if it fails. Watching me made it look easy, but it's harder than it appears.\"\n\nGrid loaded the ingredients and positioned his foot on the bellows. A translucent arrow materialized in his vision, pointing to a specific spot.\n\n*So this is the class compensation effect.*\n\nHe stepped where the arrow indicated. Another arrow appeared, showing him where to aim the bellows. The arrows blinked in rhythm, providing tempo. Five minutes later, the furnace blazed at full heat. Smith had needed ten.\n\n> [Sensitivity to ambient temperature changes detected. 30 degrees. 31 degrees. 31.5 degrees. 32...]\n\nThe mechanical voice droned in Grid's skull.\n\n> [Pagma's Descendant possesses heightened thermal sensitivity. Furnace temperature can be measured precisely within proximity.]\n\nGrid held his hand near the furnace mouth.\n\n> [700 degrees. 720 degrees. 740...]\n\nNumbers climbed in the notification window.\n\n*1,000 degrees.*\n\nIron ore required 1,150 to 1,250 degrees Celsius for proper smelting. Jaffa needed only 950 to 1,000. When the temperature hit 1,000, Grid stopped stoking the flames.\n\nThe jaffa liquefied. Lower impurity content meant it glowed bright orange from the start. Grid focused on filtering slag. The translucent arrows guided his movements, directing the metal pipes with speed and accuracy that exceeded Smith's demonstration.\n\nSmith checked on his progress. His jaw went slack.\n\n\"H-heok!\" The old man choked, coughing violently.\n\nAfter several moments, Smith steadied himself. \"How are you so skilled at smelting?\" His face had gone pale. \"Do you have prior experience? This can't be your first time.\"\n\n\"...It is my first time.\"\n\nSmith looked at him like he'd seen a ghost. \"Ridiculous... This level of talent defies representation. A novice surpassing his teacher. Am I dreaming?\" He shook his head. \"Are you the reincarnation of Pagma?\"\n\n*Reincarnation of Pagma.* The highest praise a blacksmith could receive. Most would explode with joy at such words.\n\nGrid wasn't most blacksmiths.\n\n*Not a reincarnation. A descendant.*\n\nThe high-purity molten jaffa finished cooling.\n\n> [Quest Success!]\n\nSmith's weathered face crinkled into a smile. \"Absolutely wonderful! You're quite the find.\"\n\n> [Affinity with Smith has risen by 30.]  \n> [Experience has risen by 80.]  \n> [Your level has risen.]\n\n*Level 2!*\n\nThe ease of it brought genuine joy. Grid had once been level 80. Now he celebrated reaching level 2. He dreaded the grind once he hit double digits.\n\n\"Bring it here.\"\n\nSmith poured the molten jaffa into molten iron, mixing them at a 1:12 ratio. One part jaffa, twelve parts iron. He returned the mixture to the furnace and began heating it again, stirring six times before pouring the solution into a prepared mold.\n\nForty minutes for the metal to solidify. Smith retrieved a chunk of completed jaffa from his stores.\n\n\"Your first successful smelt. Keep this as a memento.\"\n\n> [**300g Jaffa** has been acquired.]\n\nOne piece of jaffa weighed 700 grams to a kilogram. At one gold per 300 grams, this represented a substantial reward for an E-grade quest.\n\n*This old man's more generous than I expected.*\n\nSmith's affinity climbed higher in Grid's estimation. The blacksmith approached the mold with a heavy hammer, striking it until the hardened metal emerged in the shape of a thick wire. He moved the wire to a smaller mold and hammered it again before using a grindstone to sharpen the edge.\n\nMinutes later, a jaffa arrowhead gleamed in the firelight. Thick, heavy, with a wicked point capable of punching through armor. Smith attached it to a pre-made shaft.\n\nGrid watched the entire process.\n\n> [Your understanding of the Jaffa Arrow has reached 100%. You can now use Jaffa Arrows perfectly.]  \n> [You have learned how to make Jaffa Arrows.]\n\n\"Think you can replicate that?\" Smith asked.\n\n\"Yes.\"\n\nSmith barked a laugh. \"No hesitation... such confidence. Balance is everything in arrows. The feathers, the head, the shaft must all work in harmony. Even slight imbalance ruins the flight distance. Delicate work. You truly believe you can do it after watching once?\"\n\n\"I can do it.\"\n\n\"Then I'll trust you again.\"\n\n> **[Create a Jaffa Arrow]**  \n> **Difficulty: D**  \n> Mixing two metals demands precision. Crafting arrows requires delicacy. Novice blacksmiths struggle with Jaffa Arrows for good reason.  \n> Smith trusts you with expensive materials.  \n> **Quest Clear Conditions:** Produce 100 Jaffa Arrows.  \n> **Quest Reward:** Affinity with Smith MAX, Experience +300, 50 Jaffa Arrows.  \n> **Quest Failure:** Smith's disappointment.  \n> *Disappointing a client locks you out of new commissions for a time period.*\n\nSmith provided 100 finished shafts and a kilogram of jaffa. The iron ore was free to use. All thanks to high affinity. The old Grid would have accepted without question.\n\n\"I appreciate the offer, but I'll make the shafts myself.\"\n\nGrid returned the hundred shafts. Smith frowned in confusion.\n\n\"Why refuse them? If you're worried about being indebted, don't be.\"\n\n*Tsk.* Grid understood why this man remained a beginner blacksmith.\n\n\"Will you supply shafts every time I make arrows?\"\n\n\"Well, no, I can't...\" Comprehension dawned on Smith's face. \"Ah! You want to learn proper shaft construction?\"\n\n\"Exactly. If possible, provide the raw materials instead.\"\n\nSmith shrugged and fetched sturdy branches and quality feathers. \"I focused so much on smelting and forging the head, I neglected to teach shaft construction. Let me explain now.\"\n\nA beginner blacksmith's lessons had limits. Grid waved him off and pulled a thick booklet from his inventory: *List of Items Production Methods.*\n\nFour entries filled the table of contents: an axe, a pickaxe, the Jaffa Arrow, and **<span class=\"rarity-legendary\">Failure</span>**. Empty now, but someday this book would overflow with knowledge.\n\nGrid opened the Jaffa Arrow page. Text and diagrams detailed shaft construction. He read it once. Twice. Then closed the book.\n\n*Okay. I can do this.*\n\nTension and excitement warred in his gut. His first true crafting attempt. He began with the shafts, straightening crooked branches by heating them lightly before bending them true. He cut them to uniform length, carved the nock grooves at the top, and affixed the feathers.\n\nOne. Two. Three.\n\nCompleted shafts accumulated. Proficiency climbed with each one. High dexterity enabled delicate work, amplified by his class's correction effects.\n\nSmith watched with open admiration. \"This isn't novice work... You divined the production method from examining finished shafts? True craftsman's eyes. Your dexterity and accuracy are exceptional.\"\n\nGrid finished one hundred shafts without struggle, then moved on to the arrowheads.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule:** 16 chapters a week.  \n**Check out my Patreon** for early access to unedited chapters and support goals for extra chapters. Early access chapters update after daily releases conclude."
}