{
  "id": 171,
  "title": "Chapter 171",
  "content": "# Chapter 171\n\nYura anchored herself at the base and unleashed Dark Storm. The black vortex tore through the canopy before she shifted to dual-attribute magic.\n\n\"Dark Lightning.\"\n\n*Crack!* **BOOM!**\n\nLightning punched down from roiling clouds. The forest ignited. The ground split open in jagged tears. Targets exploded in cascading chains of destruction.\n\n『 Thirty-eight, thirty-nine, forty! Forty-five! Forty-six! South Korea now leads with forty-six points! An unmatched pace! 』\n\n\"**WAAAAHHHHH!**\"\n\nThe crowd erupted. The stadium shook hard enough that the tremors might carry all the way to North Korea.\n\nJishuka lowered her bow. \"It's like watching Neberius. That magic power and casting speed are already beyond player level. As the Eighth Servant, she's practically a boss monster.\"\n\nSamuel shifted his weight. \"The other teams are going to swarm Yura. Shouldn't we join them? If you add support fire, won't she go down?\"\n\nJishuka scoffed. \"That's a stupid play.\"\n\n*Creeeak.*\n\nHer bow tilted skyward. Arrows blurred from the string in rapid succession.\n\n**Pa-pa-pa-pa-pak!**\n\nFive-centimeter targets streaking at forty meters per second burst apart in midair. The cameras swiveled from Yura to Jishuka. The crowd roared again. Arrow after arrow found its mark with mechanical precision.\n\n『 Brazil scores thirteen! Fourteen! Fifteen! They're accumulating points while the other teams fixate on Yura! Ah, the moment I say it, the US, France, China, and Japan have also pivoted to scoring! 』\n\nSomeone needed to contain Yura. But it didn't need to be them. The United States, France, and Brazil had made the wise call. The teams charging at Yura were trash. Sacrificial pawns.\n\n\"Dammit!\" Med of the Spanish team cursed as he sprinted toward Yura alongside the rush. The other teams were gorging themselves on points while Spain played cop? The score wasn't climbing fast, but it still grated.\n\n*Should we focus on targets instead?*\n\nToo late to turn back now. Eight teams, including Spain, converged on Yura.\n\n**Pe-peng! Peng!**\n\nDark magic bombardment continued unabated. Yura's control was surgical. She threaded attacks between players while simultaneously destroying targets. Jaws dropped in the stands. Commentators drooled praise into their microphones.\n\nBut she wasn't the only special one. Everyone here represented their nation. The top rankers, especially, dominated events emphasizing individual combat like Target Processing and PvP.\n\nOnly one person ranked below eightieth on the unified rankings. Samuel, Jishuka's partner.\n\n**Kwa-kwang! Kwang!**\n\nThe players burned defensive skills and exploited terrain to weather Yura's magic. They closed the distance in a tightening noose. Yura's eyes narrowed.\n\n*They're more skilled than I expected.*\n\nIf her blitz failed, this would grind into an endurance battle. Yura had no hope when outnumbered.\n\n*In the end... should I give up?*\n\nForeign media had interviewed her as South Korea's representative. The questions always circled back to the same theme. She was the \"only hope of a declining South Korea.\" Would another talent like Yura ever emerge from such a small nation? Was she secretly propped up by government funding and S.A. Group support?\n\nYura hated those interviewers. They treated her homeland like dirt. It burned in her chest. She'd never thought her patriotism was anything special, but she couldn't tolerate foreigners spitting on the country where she was born. She'd wanted to make them look at South Korea again through this competition.\n\nBut it was too much for her alone.\n\nA man dropped in front of her. He descended from the treetops like a stage actor hitting his mark. Regas, representing Britain.\n\n\"What are sixteen men and women doing against one woman?\"\n\n\"Good grief, don't be stupid.\"\n\nRegas' partner Natasha pinched her brow.\n\nMed bared his teeth. \"Regas! Do you still not understand the situation? If you help Yura, South Korea takes gold! Put aside your cheap justice for one moment!\"\n\n\"Cheap justice?\" Regas' normally mild face turned to stone. \"Why are you cheapening my martial path?\"\n\nOne month ago, Regas had finally surpassed Jishuka to reach twelfth on the unified rankings. The Taekwon Master. He moved like a butterfly.\n\n**Pak! Pa-pat! Pa-pa-pa-pat!**\n\n\"Kuk!\"\n\nThe kick combo of a former Olympic gold medalist struck Med like hammer blows. Each strike drove deep like an awl. The Korean section of the crowd went wild.\n\n\"Taekwondo!\"\n\n\"Show them the dignity of Taekwondo!\"\n\nRegas, a famous Brit, had appeared at the perfect moment to save Yura. He looked like a movie protagonist. Not just Korean and British spectators, but crowds from other nations started cheering for him.\n\nMed's group knew how dangerous Regas was. But Med wasn't a villain. He was just doing what he had to.\n\n*I can hold on.*\n\nMed ranked thirty-third as a Monk. He didn't crumble easily under Regas' brutal assault. He planted his feet and shouted to his companions. \"Leave this guy to me and get Yura! Hurry up and finish, then we check the US and France!\"\n\nEight teams meant fifteen members if you excluded Med. Regas worried Yura would get swarmed. He activated lightning aura.\n\n**Chaaaeng!**\n\nGolden energy shattered Med's iron defense.\n\n\"Keeok!\"\n\nMed coughed blood and collapsed.\n\n**Kwa-jak!**\n\n> [You have been hit by a lethal blow!]\n>\n> [You have suffered 10,900 damage.]\n\n\"T-This bastard...!\"\n\nMed guzzled a potion and counterattacked. Regas flowed around the strike and lashed out with his leg.\n\n**Chaaaeng!**\n\nThe lightning-wreathed kick cracked into Med's face.\n\n> [You have suffered 4,800 damage.]\n\nIt was over. A flurry followed.\n\n**Jje-je-jeok!**\n\n> [You have suffered 4,350 damage.]\n\n\"Force Palm.\"\n\n**Peeeeng!**\n\n> [You have suffered 9,200 damage.]\n\n\"...!\"\n\nMed couldn't even moan. Blood filled his mouth. He tumbled down the hill to escape Yura's bombardment.\n\n*Damn bastard...!*\n\nUnlike Paladins, a Monk didn't serve any of the three main religions. He served a local god. Boris. The name was weak compared to the three great religions with temples scattered across the continent. Because of that, Med had traveled to a crumbling village in the corner of the world to change class. He had to return to that same temple every time he wanted to learn new skills.\n\nThat wasn't the only downside. Unlike Paladins, Monks couldn't wear heavy armor or use swords. Only cloth armor. Only clubs. Clubs with weak attack power and slow attack speed.\n\nRaising a Monk was hell. Most users avoided the class entirely.\n\n\"Reverse Origin.\"\n\n> [Your health has been fully restored.]\n>\n> [Your damaged body has been reversed to its original state.]\n>\n> [You will suffer a continuous decline in health. This effect will not stop until your health reaches minimum.]\n\n\"Origin Opportunity.\"\n\n> [You can temporarily redistribute your stats. Please configure them.]\n\n\"Invest my intelligence, indomitable, persistence, and luck points into agility.\"\n\n> [Intelligence, indomitable, persistence, and luck have fallen to 1 point. Your agility stat is now 2,137 points.]\n\nA Monk was a religious class, but the concept differed from Paladin or Priest. They were pilgrims walking the path of suffering. They always had to sacrifice something to obtain something. The rewards were great, depending on what they gave up.\n\n\"**OHHHHHHH!**\"\n\nMed, the first-ranked Monk, climbed the hill. He was clearly different now. The world watched one of the few Monk users.\n\n**Peeok!**\n\nHis club swung at the Taekwon Master.\n\n**Ku-tang-tang-tang!**\n\nRegas tumbled and scrambled to his feet. He spoke with genuine surprise. \"Your recovery is quite fast.\"\n\n\"If a martial artist trains their martial arts, a Monk trains their body. I have built it up patiently. It won't fall so easily. I will never fall down.\"\n\nAttacking a woman with overwhelming numbers was shameful?\n\n*Don't make me laugh.*\n\nThis was a battlefield. It was unreasonable and hypocritical to consider your opponent's situation when fighting.\n\n*I am Spain's representative. My people are counting on me.*\n\nNations fought over even unpopular sports. Satisfy, played by a third of the world's population, carried far more weight. As a representative, he had to give everything.\n\nMed burned with fighting spirit as he attacked Regas. He knew his opponent was stronger, but he refused to show weakness when representing his country. He struggled against Regas while the remaining fifteen people concentrated their assault on Yura.\n\n*This is annoying.*\n\nRegas' partner Natasha was different. She didn't help Yura because she wasn't the type to forget her duty. She settled into a safe position and started destroying targets.\n\nYura faced fifteen enemies alone. Her relaxed expression was long gone.\n\n***\n\nThe tickets for the National Competition had sold out months ago. Youngwoo entered the Olympic Stadium without hesitation anyway.\n\n\"You can't enter if you can't prove your identity.\"\n\nA guard blocked his path.\n\n\"You mean this?\"\n\nYoungwoo pulled out the ID card he'd received in the mail a few days ago. The path opened. He moved easily through the corridor to the participants' waiting rooms. He headed straight for the Brazilian room.\n\nBut Jishuka wasn't there. She appeared on a large monitor in the waiting room instead.\n\n*The target processing match?*\n\nYoungwoo's expression slowly twisted as he stared at the screen. He saw Yura standing alone.\n\n*Foolish girl.*\n\nIrritation flared in his chest. Was she trying to make him look bad?\n\n*Why did you put someone who didn't want to participate on the list? Persistent and selfish woman. Look at this.*\n\nYoungwoo dropped into an empty seat between the Brazilian players. Nobody cared about him. Everyone was glued to the monitor.\n\n『 Player Yura is in crisis! Representatives of eight countries have started focusing their attacks on her. 』\n\n『 The fifteen opponents are strong. At least six rank in the top thirty. It's frustrating to watch. South Korea's only hope is crashing down. 』\n\n『 Ah! She's struggling against Yura's overwhelming ability, but now she's allowing attacks through! 』\n\n『 A magician's defense and health are very low. Once they start taking hits, they collapse rapidly. This must hurt. Yura was the person most likely to win a medal in target processing. As many predicted, it seems South Korea won't achieve anything in this competition. 』\n\n『 This is South Korea's reality. They're trying to reclaim their past reputation as gaming powerhouses, but it's just an illusion. 』\n\n『 Ah, Player Yura has allowed another attack! She's reaching her limit now. It's over when she collapses. 』\n\nYoungwoo's expression gradually hardened as he watched the monitor. The Brazilian players laughed.\n\n*Annoying.*\n\nHe didn't like it. Was it because he'd spent years being crushed by the strong while alone, without a single friend? Recently, Youngwoo had felt the urge to help when he saw the weak being trampled by the strong.\n\nRight now, the weak were Yura and South Korea.\n\nIt was confusing. In his childhood, he'd never understood heroes who unconditionally helped others. He'd empathized with realistic villains. But now he felt something alien stirring in himself.\n\n*Didn't I promise to live as a solitary, self-centered person once I succeeded? Then why is this happening now? Huh? Shin Youngwoo.*\n\nWhen he'd gone through tough times, other people hadn't helped him. They'd turned away. Felt disgusted by him. But now that other people needed his help? He didn't have a reason to give it.\n\n\"I don't know.\"\n\nHe didn't know why, but he couldn't stay still. He eventually stood. Then he rationalized.\n\n*Won't I gain money if I win a medal? It was two hundred million won for one gold medal, right?*\n\nThat wasn't all. The Korean government had promised special benefits if the team placed at least third.\n\n*Yes. It's because of that.*\n\nThat was why he was going out. It wasn't because he was a hero. He didn't feel sorry for Yura facing enemies all alone. He wasn't that type. Then what? Did he dislike seeing foreigners laugh at South Korea?\n\nNo. It was for his own self-interest.\n\nThat thought eased his mind."
}