{
  "id": 172,
  "title": "Chapter 172",
  "content": "# Chapter 172\n\nTalent could be grown.\n\nStudy. Exercise. Work. A person could reach first place in any field if they tried hard enough.\n\nBut Satisfy was different. Two billion users. Geniuses everywhere. Cross ten thousand mountains, and a thousand more remained. Climb those thousand, and dozens blocked the path again.\n\nAmong those mountains, the highest was Yura. Immovable at 5th place on the unified rankings.\n\n*Kwa kwang!*\n\n*Pepepeng!*\n\nBubat gritted his teeth. *She truly is a monster.*\n\nHe was Turkey's representative. Twenty-fifth on the unified rankings. Known as Satisfy's best initiator for his bold judgment and brutal crowd control. When Bubat led the charge, the battlefield bent to his will.\n\nBut none of that mattered against Yura.\n\n*Peng!*\n\n*Damn. Perfect timing. No errors. Is she human? Or a computer wearing skin?*\n\nThe Crusher class was designed to shatter formations. His **Unconditional** skill let him rush within three meters of any target. From there, rapid CC combos destroyed enemies before they could react.\n\nYura's calm responses made every advantage irrelevant.\n\n*Half a second. That's the gap between my approach and the combo. She exploits it every time. Counters at the exact instant. Breaks my posture. My techniques fall apart.*\n\nThis wasn't even one-on-one. Yura was fighting fifteen people simultaneously. She poured magic toward fourteen targets while keeping Bubat's CC in check.\n\n*If she's fifth place, what the hell are the four above her?*\n\n*Kwa kwang! Kwa kwa kwang!*\n\n\"Kuak!\"\n\n\"Crazy!\"\n\nThe best defense was a good offense. Yura hadn't cast a single defensive spell. She used curse magic to neutralize the tanks and damage dealers, then hammered them with offensive spells. Her ability to suppress attacks through sheer aggression was overwhelming.\n\n*Too strong. This is boss-monster level.*\n\n*We need CC on her, or this becomes a war of attrition. Bubat needs the perfect opening.*\n\nThe defenders fought to expose a weakness. Their magic resistance kept the curses from being fatal, but damage still accumulated. This was no easy fight.\n\nYura's true strength wasn't her curse magic or raw firepower. It was analysis. Prediction. Choice. She read behavioral patterns and predicted responses, then used magic her opponents struggled to counter. She forced two or three decisions on them at once, confusing them about the optimal action.\n\n*Kwa kwa kwa kwang!*\n\n> **『 This is truly amazing! The dignity of the 5th ranked user! 』**\n\nThe commentator's voice carried across the stadium. Experts from every nation. Spectators. Viewers watching worldwide. All were shocked beyond admiration. Yura's power was so unrealistic that she'd lasted five minutes against top rankers from eight countries.\n\n\"But now she's reached her limit.\"\n\nZibal leaned forward in the US waiting room. He'd been waiting for this moment.\n\n*Seokeok!*\n\n\"...Uh!\"\n\nYura began allowing attacks through. Not because her concentration dropped. Her magic power was at its limit.\n\n*She's weakened!*\n\nThe curse magic restraining the rankers loosened. Yura's mana was nearly depleted. She couldn't afford new curses. The tanks burst through the magical bombardment with their solid frames.\n\n\"This is the end!\"\n\n\"Hiyaaack!\"\n\nSwords. Spears. Axes. Shields. All aimed at Yura.\n\n*They broke free from the curses too early.* She frowned. *Their magic adaptation is excellent. They're strong.*\n\nYura used defensive magic for the first time.\n\n\"**Diamond Shield**.\"\n\n*Jjeejeeeong!*\n\nBlack magicians had fewer defensive spells than other magic classes.\n\nYura was level 291, close to her third advancement. But the shield she summoned was one she'd learned at level 230. The same **Diamond Shield** she'd used the day she first met Grid at the Yatan Temple.\n\nThe shield's absorption capacity was limited.\n\n*Jjejeok! Jjejejeok!*\n\n*Victory!*\n\nThey saw cracks spiderwebbing across the shield. Then Yura pulled an orb from her inventory.\n\n\"**Divine Punishment**.\"\n\n> **[Divine Punishment]**  \n> Summons a lightning bolt dealing 15,000~23,000 damage within 10 meters.  \n> Damage Range: 3m radius around the target.\n\nDark spells stored in orbs required no casting time. And Yura's target wasn't the tanks.\n\nIt was the damage dealers in the rear.\n\n*Kwajajajajak!*\n\nFixed-damage skills had obvious limitations. They weren't effective against high-health targets. Once users leveled higher, this **Divine Punishment** would become obsolete.\n\nBut it was still deadly now. Damage dealers in the mid-200s only had around 15,000 health.\n\n\"Kuaaaaak!\"\n\nShe ignored the threat from the tanks and eliminated the damage dealers. The four rankers didn't have time to activate defensive or evasive skills. They screamed and dissolved into grey light.\n\n\"Ray!\"\n\n\"Dammit! Vas is out!\"\n\nThe tanks roared. Their partners were logged out. Rage fueled their attacks as they poured everything onto Yura.\n\n*Jjejeong!*\n\n*Seokeok!*\n\nThe newly deployed diamond shield shattered. Scratches appeared on Yura's pale skin.\n\n*Puk! Puuok!*\n\nSharp iron pierced her slender body.\n\nShe staggered.\n\nThe commentators sighed as South Korea's treasure began to collapse.\n\n> **『 Ahh! They struggled against Yura's overwhelming ability, but she's allowing attacks now! 』**\n\n> **『 A magician's defense and health are very low. Once they allow an attack, they collapse rapidly. This must hurt. Yura was most likely to win a medal in target processing. As many predicted, it seems South Korea won't achieve anything in this competition. 』**\n\nThe Korean crowd erupted in outrage.\n\n\"Do it in moderation! Don't mess up Yura's face!\"\n\n\"Bastards! Why are you ganging up on a girl fighting alone?\"\n\n\"Dog-like bastards! I'll remember your IDs. If we meet in the field, I'm sacrificing my life for revenge!\"\n\n*Crash!*\n\nYura collapsed to one knee.\n\n\"Ah...!\"\n\n\"Serves you right!\"\n\nKorean spectators gasped. Foreign audiences cheered.\n\n*Jebeok jebeok.*\n\nA young Asian man entered the stadium, guided by staff members. He headed toward the capsule room.\n\n\"Huh? What's going on?\"\n\n\"Who is that?\"\n\nSudden confusion rippled through the crowd. The commentator finally explained.\n\n> **『 That person's ID is Grid. He's a member of the South Korean national team, scheduled to be Yura's partner in target processing. He was unavoidably delayed and arrived late. 』**\n\nThe Korean crowd booed.\n\n\"Grid? First time I've heard that name.\"\n\n\"What is this? Some nobody shows up at the last minute? Is this a comedy?\"\n\n\"That bastard appears now? Yura's suffering because of him!\"\n\nForeign audiences voiced complaints.\n\n\"What? He can join midway?\"\n\n\"That's against the rules!\"\n\nThe commentator continued.\n\n> **『 According to the organizers, there's no rule prohibiting participation during an ongoing event. The Korean team member's late admission isn't a problem. 』**\n\nInternational media experts frowned.\n\n> **『 For a player to join mid-match... 』**\n\n> **『 The National Competition's Organizational Committee is staffed by Korean government personnel and S.A. Group executives. Their lack of professionalism is showing. 』**\n\n> **『 This is the first year, so there are loopholes. It'll improve gradually. I hear the committee is restructuring with experts. 』**\n\n> **『 Bottom line, the Korean team member is joining. How will this change the situation? 』**\n\n> **『 What will change? Yura's already at her limit. This 'Grid' isn't even in the top 1,000 rankers. Korea's fate won't change. At this rate, they're eliminated. 』**\n\nAn unknown player joining a match filled with top-80 rankers. The odds were effectively zero. No one expected anything from Grid.\n\nMeanwhile, players from eight countries surrounded Yura, moving to deal the final blow.\n\n\"You forced my teammate to logout! It's over for our country! I'll kill you myself!\"\n\n\"This...\"\n\nRegas tried to intervene. Impossible. Med was suddenly more agile than Faker, pursuing him relentlessly. Regas couldn't escape.\n\n*Pepeok!*\n\nMed struck Regas with a club, glaring.\n\n\"You ruined everything. Without you, Yura would've been managed easily. We wouldn't have wasted so much time.\"\n\nThe scoreboard told the story. The US, France, Brazil, China, and Japan all exceeded 50 points. South Korea had 78 points, but Yura would die soon. The other countries' players were still going strong. That 50-point gap was impossible to close.\n\n\"Die!\"\n\nMultiple weapons aimed at Yura. The club swung toward Regas.\n\nRegas could break through on his own. Give up flesh and bone. Counterattack after taking the hit.\n\nYura was helpless. Her mana depleted. A weapon poised to stab into her neck.\n\n\"No!\"\n\n\"Yura!\"\n\nSouth Korea's sole hope was about to die. Korean spectators and viewers screamed. Foreign audiences cheered.\n\n\"South Korea should exit here! Obviously!\"\n\nMillions watching the competition didn't doubt Yura would die.\n\nAll except one person.\n\n*Chaeeeeeng!*\n\nSeven golden blades fell from the sky. They deflected the weapons targeting Yura with surgical precision.\n\n\"...What?!\"\n\nThe rankers who'd been denied Yura's life stared in shock. Who interfered? They looked up, following the blades' trajectory. The cameras followed.\n\nBlue sky filled the worldwide broadcast.\n\nJust sky.\n\n\"No one?\"\n\nThe blades came from there, didn't they?\n\n> **『 What is this? 』**\n\nRankers. Commentators. Experts. Spectators. Viewers. All felt the same confusion.\n\n\"The villain has appeared.\"\n\nA young man called Grid materialized behind the rankers staring at the sky.\n\n\"Heok?\"\n\n\"When?\"\n\nUnexpected. A voice where nothing existed.\n\n*A person with Faker-level stealth?*\n\nIf so, they were facing a monster. The rankers felt something ominous and turned. Too late.\n\nThe dark greatsword was already swinging.\n\n*Kwa kwa kwa kwang!*\n\n\"Kuak!\"\n\nThe strongest representatives of each country were taken out with a single blow. Supporters of the eight nations reeled in shock. Grid knew better than anyone how shock turned to despair.\n\nHe warned them.\n\n\"Be fully prepared. You'll experience the same thing from now on.\"\n\n*Ttaak!*\n\nGrid snapped his fingers. The seven blades protecting Yura launched skyward and began attacking targets flying at 40 meters per second.\n\n*Pepepepeng!*\n\nFragments of exploded targets filled the screen. Korea's frozen score resumed its climb. Grid removed his <span class=\"rarity-unique\">Hooded Zip Up</span> while enemies stared at the golden blades. Beneath it, he wore brilliant armor. Red. Gold. Black.\n\n\"The one-sided game starts now.\"\n\nWas this a devil?\n\nAn arrogant black-haired man framed against the sky. His words weren't the problem.\n\n*It's serious.*\n\nThey'd lost four damage dealers to Yura. Now eight of the remaining eleven players from eight countries couldn't move.\n\n\"Waaahhhhhhhh!\"\n\nThe Korean spectators cheered in unison. No one frowned at Grid now. They were thrilled by his spectacular entrance.\n\n---\n\n**Glossary of Common Korean Terms:**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters are updated after I finish releasing all chapters for the day."
}