{
  "id": 174,
  "title": "Chapter 174",
  "content": "# Chapter 174\n\n\"Bad person.\"\n\nJishuka's voice cut through the dense forest canopy. She had just finished struggling against Samuel, the weakest participant in the target processing match, and her anger finally reached its breaking point.\n\n*He ignored my whisper, only to come running for another girl?*\n\nThe memory of the opening ceremony burned fresh. She had logged onto Satisfy in South Korea and sent Grid a whisper to find his location. He'd continued to ignore her messages. At the time, she'd tried to be understanding. *He must be busy.*\n\nBut this? This was different. He didn't seem too busy to rescue another woman.\n\n*Did he ignore my whispers because he wasn't interested in me? He didn't want to meet up, so he just... ignored it?*\n\nShe had thousands of fan clubs scattered across the world. Hundreds of millions of men wanted her. The best men had courted her: handsome actors, oil tycoons, successful intellectuals. But now she was being ignored.\n\nJishuka's pride crumbled. The <span class=\"rarity-epic\">Special Jaffa Arrow</span> in her grip snapped in half. She threw the pieces aside and fixed Samuel with a glare. \"Who is prettier between me and Yura?\"\n\nThe people of the world enjoyed comparing them. It was a global hobby to evaluate who was more beautiful. Not just appearance, either. They were compared in every respect: both international stars, both top rankers of Satisfy. Even their payment for TV appearances and photo shoots remained identical.\n\nJishuka recognized Yura as her rival. However, she'd always been confident she was superior. But when it came to the man she was interested in, she seemed to be... defeated. She'd never known Grid and Yura were so close.\n\n*A person who would rather make items rushed to participate in the National Competition... Is Yura a special presence to him?*\n\nSamuel studied her for a moment, then responded with painful honesty. \"Jishuka, you are much sexier. Your qualities are definitely better. Objectively, I think you are more beautiful.\" He paused. \"But I personally prefer elegant women, so Yura seems more beautiful to me. In addition, Yura is Asian, right? She has calm eyes, no freckles, a mysterious charm in many ways. Hehe, she is a goddess.\"\n\n\"Shut up.\"\n\n*Puok!*\n\n> [The effect of the Special Jaffa arrow is activated, meaning the enemy's defense is completely ignored.]\n\n> [The Special Jaffa Arrow has poisoned the enemy.]\n\n\"Keok!\"\n\nSamuel shuddered in pain as the arrow punched through his thigh. Jishuka pulled back her bowstring again.\n\n\"I am angry.\"\n\n*Papapat!*\n\nHer quick fire unfolded. Targets flew between trees and bushes, exploding without escaping her wrath.\n\n\"I am becoming heated up!\"\n\n*Pepepepeng!*\n\nThe Brazilian team's score kept climbing thanks to her furious firing. The commentator's voice rose.\n\n**『 Brazil 72... 73 points! Truly an expert archer! The Brazilian representative, Jishuka's arrows ignore all obstacles and are wiping out the targets in a flash! Ah! As soon as I spoke, the Chinese team and Japanese team have started attacking Jishuka! 』**\n\n\"Wahhhh!\"\n\nThe audience's attention, which had been fixated on Pagma's Descendant, finally returned to the battlefield. They began cheering for their own country's players once again. Meanwhile, the United States representative, Hurent, stared at the scoreboard with a perplexed expression.\n\n\"Um, what is this?\"\n\nSouth Korea: 113 points.  \nUnited States: 77 points.  \nBrazil: 73 points.  \nCanada: 71 points.  \nFrance: 69 points.  \nChina: 62 points.  \nJapan: 61 points.  \nUnited Kingdom: 49 points.  \nSpain: 0 points.\n\nThe Korean team's solo performance dominated the board.\n\nHe'd almost caught up to the Korean team's score when Yura was attacked by representatives from eight countries, but the sudden appearance of Pagma's Descendant had made his efforts useless.\n\n*Destroying 11 top rankers alone and controlling those blades to handle the targets...*\n\nDuring the Bairan battle, he'd been 'passable.'\n\n\"Really, isn't it a foul to introduce a legendary class at this time?\"\n\nHurent made a frightened expression on the outside, but his eyes remained calm. He scratched his grey hair, and his middle-aged brain started spinning quickly. The situation had shifted due to a single influence. How should he deal with it?\n\nHe considered the problem, then called out his partner's name. \"Lauel.\"\n\n\"Yes.\"\n\nThe young silver-haired man, who had been watching Grid, replied with an expressionless face.\n\nHurent looked at him. \"Those golden blades. Can you handle them?\"\n\n\"...\"\n\nLauel's gaze shifted back toward the sky where Grid hovered. He observed the seven blades moving around 1.5 times faster than the targets, then explained. \"Sniping is possible if I can get within 30m of them. However, if those blades are made of the same material as the golden discs that appeared during the Bairan battle, they won't be destroyed.\"\n\nHurent nodded. \"Okay. Then we will give up on the gold medal.\"\n\nThe United States was the world's strongest power.\n\nAs representatives of the United States, Hurent and Lauel were exceptional. Hurent, the number two person on the US team, ranked 8th on the unified rankings and possessed a hidden class. Meanwhile, Lauel was one of the Ten Rookies. They'd originally aimed to win, but they changed their target without hesitation.\n\n\"Pagma's Descendant and Yura. It might be possible with just one of them, but it is folly to become enemies with both at the same time. Let's leave them alone and focus on our own fight.\"\n\nThey would aim for the silver medal. Hurent made the decision and selected his next target.\n\n\"First of all, our target should be the Canadian team.\"\n\nThe United States, France, Brazil, China and Japan: five teams battling in the forest, busy keeping each other in check. The British team was near the Korean team, but their score was rising slowly because Natasha was handling targets alone. The Spanish team? Med was the only survivor, confronting Regas. His score was also zero, so there was no need to worry.\n\nOn the other hand, the Canadian team was an eyesore.\n\nThey were hidden halfway up a mountain, persistently handling targets. Thanks to their position, their speed of point acquisition was fast and no one was disturbing them. The obvious choice.\n\n\"...\"\n\nThe French and Chinese representatives on either side looked over with frightened eyes. Hurent laughed at them. \"Three minutes. Just hold on for three minutes without me.\"\n\nLauel's face twisted. \"Hold on alone for three minutes? Won't the other teams focus their attacks on me the moment you leave my side? I won't even be able to last two minutes.\"\n\n\"No, you can hold on. If not, just endure for 2 minutes and 50 seconds. I will come back in that time.\"\n\n\"Shouldn't we go together?\"\n\n\"No. Then the Canadian team can cooperate with other teams to isolate us. See you soon.\"\n\nHurent spoke one-sidedly before jumping high in a manner that defied his large frame. Like a martial artist, he ran along the trees and reached the mountain in a minute.\n\n\"Have you come to be killed?\"\n\nThe Canadian representative ridiculed him. There were two of them, while Hurent was alone. Lauel was left behind, being attacked by representatives from other countries. This was the end for the US.\n\n\"You're foolish, Hurent.\"\n\nAfter the Korean team with Pagma's Descendant and Yura, the United States had the next best power. Now the Canadian team had an opportunity to defeat them. Hurent might be ranked 8th, but they were also in the top 30 rankings. The two of them believed they could defeat Hurent if they worked together.\n\n*Hurent isn't a monster like Yura and Pagma's Descendant. If he was a monster like them, he would've already smashed the other teams alone.*\n\nThe Canadian representatives thought so. But in fact, Hurent was a monster. He was one of the seven rankers that Yura analyzed to be stronger than her.\n\n\"I have to hurry.\"\n\n*Hwaruruk!*\n\nRed aura blazed on both of Hurent's hands like fire.\n\n\"Eh?\"\n\nDifferent from their information? Hurent had a rare hidden class called 'Aura Master,' and didn't he originally deal with blue aura? Confusion and wariness flickered across their faces as Hurent offered new information.\n\n\"Among the hidden classes, 'growth' types exist. My Aura Master was a rare class when I first acquired it, but now it's been promoted to an epic class. My aura has become stronger.\"\n\n\"Bullshit!\"\n\nThis was the first time they'd heard of growth type classes. The Canadian team thought it was a bluff and attacked. The aura around both of Hurent's hands formed swords.\n\n\"I will let you learn the glory of a future legendary class.\"\n\nHurent spoke sincerely and swung his two aura blades.\n\n*Chaaeng! Chaaeng!*\n\nThe Canadian representatives struggled. They exchanged a few blows with Hurent. But his swordsmanship was superior. The Canadian representatives started taking injuries. Hurent's aura blades completely ignored their defenses, inflicting 100% fixed damage.\n\nThe Canadian representatives reeled from their wounds. Hurent's aura blades moved like whips.\n\n*Puuok!*\n\n\"Kuk... Kuak!\"\n\n\"From this angle, how...?\"\n\nA Canadian representative was pierced through the heart and stunned after suffering massive damage. Their survival was already in Hurent's hands.\n\n\"Your abilities are good, but... somehow, the recent rankers are too weak in PvP. Is it because they're only focused on levelling up? You don't know how to fight.\"\n\nHurent couldn't conceal his relaxed expression as he logged out the Canadian rankers. He checked the time while taking a potion and hit his forehead.\n\n\"Damn, it has already been over three minutes.\"\n\nHurent channeled aura around his lower half, allowing him to move at tremendous speed. He quickly reached Lauel, then laughed. Lauel, who he thought would already be dead, was relatively fine.\n\n\"No wonder he's called the strongest rookie.\"\n\nLauel glared sharply. \"It took you 4 minutes and 9 seconds.\"\n\n\"Sorry, sorry. The enemies were further than I thought.\"\n\nThe apologetic Hurent attacked the French and Chinese representatives who had been pressuring Lauel. At that moment, an arrow flew toward his heart.\n\n*Puok!*\n\nHurent avoided a fatal hit with breathtaking reflexes and expressed his disapproval. He pulled out the arrow. \"I wanted to avoid a melee because of that woman.\"\n\nAn archer was vulnerable in a one-on-one match. But it was a terrifying class when hidden behind allies. In the first place, Jishuka was an outstanding talent.\n\n\"Well, she was my second goal. Cover me, Lauel.\"\n\nHurent leapt in the direction of the Brazilian team.\n\n*We can't beat the US team if Jishuka is killed.*\n\nThe other teams judged simultaneously and blocked him. But there was one problem.\n\n*Kwa kwa kwa kwang!*\n\nHurent dispersed aura around him. It transformed into aura spears and pierced the bodies of his enemies.\n\n\"Kuk...! Is this aura's true power?\"\n\n\"This is the strength of a top 10 ranker...!\"\n\nSurprises kept appearing.\n\nZibal. Chris. Bondre. Yura. Then there was Pagma's Descendant and Hurent.\n\nThey showed strength that transcended common sense in this National Competition. Even if all participants were rankers, the level was different. It was to a point where the others felt insignificant.\n\nHurent pierced through the disgruntled representatives and reached the Brazilian team. Samuel blocked his way, but Samuel was the weakest one here. He couldn't beat Hurent.\n\n\"Eek!\"\n\nSamuel was struck down. Hurent had been hit with arrows several times, but he ignored them and closed the distance to Jishuka instantly.\n\n\"Isn't this quite hard?\" Hurent wiped sweat from his brow and spoke to Jishuka. \"It's possible to operate my aura defensively. Anyway, it's great. This is the first time I've become a hedgehog.\"\n\n\"Why don't you experience your body being cut in half?\"\n\n\"...!\"\n\nAn unexpected voice from above? Hurent freaked out and moved.\n\n*Kwang!*\n\nThe greatsword hit the place where he'd been standing.\n\n*Jjejeok! Jjejejeok!*\n\nThe ground shook like an earthquake had occurred. Grid descended.\n\nHurent noticed his mistake. \"That's right. Didn't Pagma's Descendant belong to the Tzedakah Guild? Ah, I tried to touch someone I shouldn't have.\"\n\n\"You saw it right away.\"\n\nGrid kicked dirt off his boots. He might've never expressed it, but the Tzedakah Guild was very precious to him. They'd noticed his value more quickly than anyone else, and they were people who respected and cared about him.\n\nHe'd originally built a relationship with them because of money, but not anymore. This was a relationship built up over half a year. They'd helped him in many ways. Grid might laugh at some of them, but to him, they were his only friends.\n\nHow could he not protect his friends when he had enough strength? It was no different from his past friends who'd ignored him when he was in pain.\n\n*Yes. I will never do that.*\n\nAt this moment, he realized why he'd wanted to enter the competition despite having to reveal his identity.\n\n*Sururuk.*\n\nGrid's eyes changed.\n\nThe arrogance cleared from his gaze. The reasons he'd used to convince himself about why he participated in this competition were just a means to conceal his confusion, because he couldn't understand his own psychology. At this moment, his eyes shone deeply and gently.\n\nHurent witnessed the change in real time and was amazed.\n\n*It feels like he has become another person.*\n\nMeanwhile, Jishuka's eyes were shining from beside Grid.\n\n*W-What? Why is he so good looking today?*\n\nJishuka, who was always confident and didn't pay attention to men, couldn't tear her eyes away from Grid.\n\nGrid moved her behind him and declared, \"Watch me.\"\n\n\"Ye... Huh?\"\n\n*Duguen!*\n\nJishuka stared at Grid's wide back and turned red. Right now, this situation was being broadcast around the world.\n\n\"Damn! This isn't a drama!\"\n\n\"Boo! Boo!\"\n\nThe men around the world started booing together. Pagma's Descendant and Yura weren't enough for him? He was aiming for Jishuka as well? Wasn't he a very bad person?\n\n\"Damn bastard!\"\n\n\"Rotten guy!\"\n\nOne man was gobbling up the hearts of two of the world's most beautiful women. Swearing echoed around the globe.\n\nAt the same time, a young man in his 30s was watching the competition on TV. He stood up. Then toward the Grid on the screen... *Clap. Clap.* A standing ovation.\n\n\"Plant flags all around you. Bravo...!\"\n\nThis man had posters of Rebecca's Daughters covering every wall in his house. Thanks to Grid, the pope was killed and he'd become the first to receive a unique hidden class. He was cheering for Grid from a distance.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}