{
  "id": 175,
  "title": "Chapter 175",
  "content": "# Chapter 175\n\nHigh school. Lee Junho had ruled through his fists, grinding down anyone weaker than him. Mental torture, physical beatings, extortion—all of it came naturally. He was king.\n\nNo one dared resist. Everyone obeyed. Shin Youngwoo had been one of his victims—a pathetic creature who trembled when scared and threw tantrums when his pride was bruised. Even university and military service hadn't changed him.\n\nEvery alumni meeting, Junho mocked him without mercy.\n\nBut this year's reunion? Different. The man who walked through the door carried himself with confidence. Economic success radiated from him like heat.\n\nMeanwhile, Junho hadn't moved an inch from his school days. The gangster mentality still clung to him, making him unemployable. Late twenties, and all he could scrape together were part-time gigs.\n\nShame settled into his bones. The throne crumbled beneath him. Reality punched him in the face.\n\n*I need to change. Like Youngwoo did.*\n\nThe decision hardened in his chest. He would claw his way up, just like Youngwoo had.\n\nFirst, he killed his pride. Gas stations, convenience stores, PC cafes, construction sites—he worked them all. No boasting. No waste. Penny by penny, he saved. Understanding came slowly.\n\nHow fucking wasteful it had been, stealing money through violence. Every customer who looked through him like he was furniture, every dismissive glance—he felt them all. The sin of crushing the weak burned in his gut now.\n\n*I'm sorry, Shin Youngwoo.*\n\nThe smoking booth reeked of cigarettes and regret. Junho exhaled smoke toward the night sky, a bitter smile twisting his mouth.\n\n\"If I could apologize to you face to face...\" He ground the cigarette under his heel. \"I'd never show my face to you again.\"\n\nThe billboard on the skyscraper blazed to life. The Satisfy National Competition. Youngwoo's face filled the screen, massive and untouchable.\n\n*We live in completely different worlds now.*\n\nCrowds gathered below, necks craned upward. Among them stood Youngwoo's sister, Sehee.\n\n\"Cool.\"\n\nYerim stood beside her. Her voice carried genuine admiration as Youngwoo swept in to save Yura, overwhelming the foreign teams with raw power.\n\n\"He's capable, strong, and overflowing with confidence.\" Yerim sighed. \"Your brother is really the best man.\"\n\nSehee's jaw tightened. \"The game and reality are different. I admire my brother, but he isn't the best man.\"\n\n\"Aren't you aware that Satisfy isn't a simple game?\" Yerim turned to her. \"Satisfy is already another reality. He is the best man in that reality.\"\n\nThe words hit harder than Sehee expected. Yerim knew Satisfy better than she did. Despite her age, maturity lined her features as she giggled. \"I will surely have your brother.\"\n\nGulp.\n\nThe sound rippled through the crowd. Men stared, souls visibly leaving their bodies. Several gangster types already prowled closer. Sehee glared them back, then rounded on Yerim.\n\n\"You don't fit his taste.\"\n\n\"Huh?\" Yerim's eyes widened. She studied Sehee's sulky expression and laughed. \"Sorry, sorry, Sehee. I forgot how much you love your brother. I'm sorry for making you jealous.\"\n\n\"I'm not just saying this.\" Sehee crossed her arms. \"You really don't fit his taste.\"\n\n\"What man would dislike me?\"\n\nAs one of South Korea's high school queens alongside Sehee, Yerim's confidence ran sky-high. Sehee delivered the killing blow.\n\n\"My brother likes busty girls.\"\n\nYerim tilted her head. \"Aren't I pretty big?\"\n\n\"You need to at least have a D cup.\"\n\nOn the billboard, Youngwoo saved Jishuka from Hurent. Saving Yura made sense—she was Korean. But Jishuka represented another country. Why help her? Yerim's gaze locked onto Jishuka's chest. Her lip jutted out.\n\n\"Really, that's his taste?\"\n\n\"He's a dog in rut.\"\n\nFury radiated from Sehee. That woman hanging onto her brother made her stomach churn.\n\n\"I'm going.\"\n\nShe turned from the electronic billboard and stalked toward the library. Yerim wanted to watch more of the broadcast, but followed reluctantly. A thought nagged at her.\n\n*I'm not even twenty yet. Should I try for a D cup?*\n\nShe considered it seriously.\n\n***\n\nHurent's gaze swept over Jishuka and Grid.\n\nHe downed a health potion and antidote.\n\n\"This isn't a common antidote...\" His expression soured. \"The poison arrows are quite awful.\"\n\nThe scoreboard burned in his mind.\n\n*Korea: 131 points. US: 82 points. Brazil: 73 points. United Kingdom: 60 points. Spain: 0.*\n\nFive countries remained. Spain was done. Their representative Med was on the verge of being logged out by Regas. Hurent processed the battlefield and whispered to Lauel in the rear.\n\n**-Get out of battle and focus on handling the targets. We've given up on the gold medal, but we need to take the silver medal.**\n\n**-Isn't the damage pretty big? Can you afford to go against Pagma's Descendant in that state?**\n\nThe seven golden blades still moved autonomously, destroying targets. Hurent watched them and smiled darkly.\n\n**-Why not?**\n\nTtadak.\n\nHe looked at Grid. \"Since the situation is like this, shall I enjoy it a little?\"\n\nObvious provocation. The confident Grid wasn't falling for it.\n\n\"Stop fooling around.\"\n\n1st ranked Kraugel. 2nd ranked Zibal. 3rd ranked Chris. 7th ranked Agnus. 8th ranked Hurent. 11th ranked Bondre. 14th ranked Hao. Yura had named them—seven players stronger than her.\n\nGrid remembered distinctly. But nervousness didn't touch him, even knowing Hurent belonged to that list. He raided the strongest boss monsters alone. His stats, skills, and items would crush high rankers.\n\n\"Jishuka, leave him to me and concentrate on the targets.\" Grid shifted his stance. \"Don't you want the silver medal?\"\n\n\"Yes! Thank you!\"\n\nJishuka vanished into the forest with Samuel. Grid stood alone with Hurent. He immediately launched into his sword dance.\n\n\"Pagma's Swordsmanship!\"\n\nGrid moved two steps.\n\nPuok!\n\nA five-meter red blade erupted from Hurent's fingertip and punched through Grid's chest.\n\n> [You have suffered 4,600 damage.]\n\n*What?*\n\nHurent's timing was perfect—Grid was locked in his sword dance animation. The damage hit hard.\n\n*That much despite my legendary armor set?*\n\nWas it aura's default damage? Confusion flickered through Grid's mind, but his strongest skill was already activating.\n\n\"Kill!\"\n\nKuooooh!\n\nThe massive blue greatsword, filled with hatred, roared toward Hurent.\n\nKwarururung!\n\nTrees vibrated from the overwhelming energy waves. Grid planned to obliterate Hurent.\n\nBut—\n\nHurent sidestepped at the perfect moment. Kill missed. He closed back in on Grid and aimed his aura blades at the gap exposed by the greatsword swing.\n\n> [You have suffered 4,600 damage.]\n> [You have suffered 4,600 damage.]\n\n*Constant damage. Aura ignores defense and deals fixed damage?*\n\nGrid's frown deepened as understanding clicked into place. Kill's energy pierced empty air and faded. Hurent clicked his tongue.\n\n\"In order to hit with a non-targeted skill, you first have to restrain your opponent's movements. If that isn't possible, you should predict their movements.\" His voice dripped with condescension. \"Isn't that part of the basics?\"\n\nGrid pulled a potion and downed it. \"Are you attempting to teach me right now?\"\n\n\"Teach? Hahat! Nonsense. Is there any reason to do that type of favor for you?\" Hurent laughed. \"I'm simply disappointed. You have the strongest class and this is the extent of your skills? Don't you have any combat experience?\"\n\n\"Of course I have combat experience!\" Grid snapped. \"You can't imagine how many bosses I've raided alone so far!\"\n\nHurent chuckled. \"Is your combat experience limited to boss raids? Kukuk, of course bosses are strong. But don't they just fight with strength or with a fixed pattern? They don't fight cleverly.\" He paused. \"Yes, just like you. Can't you see that the difference in our combat experience is too big?\"\n\n\"Talking nonsense just because you avoided my skill once.\"\n\nGrid moved his sword like butterflies dancing, heat flooding his chest. This time, Hurent's cheeky face was getting hit.\n\nBut Pagma's Swordsmanship had a weakness. The skill name had to be spoken aloud. A minimum of 0.8 to 2 seconds passed before activation.\n\nSome might consider that short. In fact, none of the players, monsters, or bosses Grid had faced managed to touch him during that window. But Yura had countered a Crusher in 0.5 seconds. Hurent was far superior to her.\n\nTeook!\n\nGrid took the first step of his sword dance.\n\nPuuok!\n\n> [You have suffered 4,600 damage.]\n> [You have suffered 4,600 damage.]\n\nHurent struck twice in that timeframe. Simultaneously, he retreated, opening distance.\n\n\"Kuk!\"\n\nGrid checked the gap and realized it was impossible. He cancelled Link's activation.\n\n*This stinks.*\n\nHe admitted it. Hurent was strong. Stronger than the bosses he'd faced. The aura's fixed damage and ability to freely transform its shape was annoying, but the vulnerability was clear—Hurent couldn't use skills either.\n\nGrid had combat experience. But after two failed skills, perception dawned.\n\n\"Are you going to use a skill haphazardly again?\" Hurent sighed. \"Do you have no learning ability?\"\n\nGrid charged. \"Okay! I can just swing my sword instead of using skills. Then will you be able to avoid it? Blacksmith's Rage!\"\n\nJjejeong!\n\nThe +9 Failure clashed against the aura blades.\n\n*Strong.*\n\nHurent felt his aura shake like flame before wind. He clicked his tongue and tried to open distance, but his base movement speed wasn't enough.\n\nJjejeong! Jjang!\n\nGrid stuck to him relentlessly, swinging his sword. Hurent barely defended and confirmed his Escape skill cooldown was finished.\n\n\"Escape.\"\n\nPeeng!\n\nThe close-range distance skill all warrior classes possessed. Hurent gained five meters and shifted aura to his lower body.\n\n> [Attack power is reduced by 30%.]\n> [Movement speed has increased by 30%.]\n\n*Faster?*\n\nGrid couldn't close the distance. Hurent ran like a coward. Grid swapped to the Ideal Dagger, activated Quick Movements, and shouted.\n\n\"Let's finish this game.\"\n\nPepepepeok!\n\nHurent leaped toward a cluster of targets and released his aura in all directions. An explosion. The US team's score rapidly updated.\n\n> **『 The United States has 109 points! Really amazing! After logging out the representatives from France, China, and Japan, Hurent destroyed 16 targets in a single strike while running from Pagma's Descendant! 』**\n\n\"What are you trying to do?\"\n\nGrid wanted to help Jishuka and Regas. He wanted their countries to win the silver and bronze medals. So he chased Hurent to stop him. Thanks to his high persistence, Grid's stamina held steady while Hurent gradually exhausted.\n\n*I thought he invested most of his stats into strength, then some into agility and stamina. But now I see his stats are high overall. Indeed, a blacksmith can increase their stats dramatically through item production.*\n\nOver time, Hurent grasped more about Grid. But his breathing labored. He slowed.\n\n*I almost caught up!*\n\nGrid's eyes sparkled. This was the end. He'd catch that annoying bastard soon.\n\nPleasure flooded through Grid.\n\nThen—\n\n> **『 South Korean team! 150 points! Victoryyy! 』**\n\n\"What...?\"\n\nThe mistake hit him like cold water. He'd forgotten about Yura and the pavranium. He hadn't told Yura he wanted to beat the US team. He hadn't recalled the target destruction order he'd given the pavranium. Yura and the pavranium kept destroying targets while he pursued Hurent.\n\nThis was the result.\n\n\"Bye-bye~?\"\n\nHurent laughed. He'd predicted this situation from the beginning. Grid logged out forcibly. The rule was absolute—the team who achieved the quota could no longer remain on the battlefield.\n\nAfter that.\n\nThe United States reached 150 points next and claimed the silver medal. Britain and Brazil fought for third place. Britain eventually won.\n\nJishuka's target destruction ability surpassed Natasha's, but her partner was the problem. Samuel was too lacking and couldn't protect Jishuka from Regas. Hundreds of thousands of spectators watched as the Korean, United States, and United Kingdom teams mounted the podium.\n\n\"It was enjoyable, newbie.\"\n\n\"Dammit...!\"\n\nAn absurd scene played out. Grid won the gold medal but scowled from the top of the podium. Beside him, Hurent received the silver medal and laughed loudly.\n\nLooking at the atmosphere between the two men, it seemed like the US had won."
}