{
  "id": 176,
  "title": "Chapter 176",
  "content": "# Chapter 176\n\nYura watched Grid hum to himself as they walked toward the waiting room. The man who'd been seething during the awards ceremony now looked like he'd won the lottery.\n\n\"Why didn't you use Transcended Link?\" She kept her tone casual. \"It's optimized for catching runners like Hurent.\"\n\nGrid pulled out his phone, still grinning. \"Wanted to. Cooldown wasn't finished.\"\n\n*Of course.* Yura's mind ticked through the numbers. Fourteen minutes and forty-seven seconds between his entry and the final score. Transcended Link had at least a fifteen-minute cooldown.\n\nThe phone screen lit Grid's face as he scrolled through articles:\n\n**[Target Processing Upset: South Korea Stuns the World!]**\n\n**[First Legendary Class Belongs to Korea—Who is Shin Youngwoo?]**\n\n**[Grid's Debut Sends Shockwaves Through Competition]**\n\n**[Column: Can Grid Restore Korea's Gaming Dominance?]**\n\n**[Eyes of the World Turn to Pagma's Descendant]**\n\n**[Grid Assists Brazilian Rep Jishuka—Romance Rumors Fly]**\n\nSatisfy's cultural grip was terrifying. One match, and Shin Youngwoo had become a global phenomenon.\n\nYura studied him while he read. She'd dissected every second of the Bairan footage—Transcended Link, Link, Kill, Wave. Four skills from Pagma's Swordsmanship. All devastatingly powerful. All hamstrung by the same weakness.\n\n*Sword dances.* Every technique required that 0.8 to 2-second invocation. A window where any competent player could interrupt him. Combined with the long cooldowns...\n\nHer conclusion had been clinical: **insufficient.**\n\nNot a question of talent. The class itself was the problem. Pagma's Descendant was fundamentally a production class—a blacksmith who could fight, not a fighter who could craft. The legendary rating granted him status immunity and the ability to forge world-class items, but in pure combat? She'd seen Epic classes with more killing power.\n\n*He makes up for it with gear, but against top-tier players...*\n\nWhat Yura didn't know—what no analyst knew—was that Grid had been holding back.\n\nRestraint. Transcend. Linked Kill. Unbreakable Justice. Wind Blast. Wind of Justice. Golden Flash.\n\nAny one of them could have ended Hurent. Restraint locked targets down for three seconds—an eternity in high-level PvP. Transcend turned him into a ranged artillery platform. Linked Kill was overkill incarnate.\n\nBut Grid had reasons. His intelligence sat at 643 after four months of obsessive crafting, with another 200 available from Malacus' Cloak. At level 200+, that translated to enough mana to chain his entire arsenal. And unlike Pagma's Swordsmanship, skills like Unbreakable Justice activated instantly—no dance, no delay.\n\nHe could have buried Hurent in the sand and made it look easy.\n\n*But why waste the reveal?* Grid pocketed his phone. *The pavranium screwed me, sure. Without it, I would've forced him to log. But this works better.*\n\nThe National Competition had fourteen days left. Korea's team was weak, desperately reliant on him. He'd already locked in three PvP brackets.\n\n*That's where I'll show them.* His reflection grinned back from a hallway window. *New opponent, new skill. Keep them guessing. Keep the cameras rolling.*\n\nHurent would get his receipt. With interest.\n\nControl meant nothing against the holy trinity: skills, stats, items. Aura Master? Growth-type hidden class?\n\n*I started legendary.*\n\nThree events. Three gold medals.\n\n\"Grid!\"\n\n\"Pagma's Descendant!\"\n\nThe hallway ahead was a wall of bodies. Hundreds of reporters crushed against the security barriers outside the Korean waiting room. Cameras swung toward Grid like wolves spotting prey.\n\n\"Oh my,\" Yura murmured.\n\nFor the first time in her career, she was invisible. Every lens, every microphone, every hungry stare bypassed her completely. The Blood Witch, fifth on the unified rankings, might as well have been a coat rack.\n\nHer pride wasn't wounded. If anything, she felt lighter. *Let him take the heat.*\n\nGrid, meanwhile, was drowning.\n\n\"When did you obtain the class?\"\n\n\"Tell us the acquisition process!\"\n\n\"Why hide your identity?\"\n\n\"What's your level?\"\n\n\"Kraugel is 297—have you hit 300?\"\n\n\"Disclose your equipment! Especially that blue greatsword!\"\n\n\"What are those golden blades?\"\n\n\"How did you turn invisible at the start?\"\n\n\"Are you and Jishuka lovers?\"\n\n\"Education? Age? Address? Family?\"\n\n\"Married?\"\n\n\"Favorite animal?\"\n\n\"Favorite food?\"\n\nThe questions ranged from penetrating to deranged. A dozen languages crashed together into white noise.\n\n*This is insane.* Sweat prickled Grid's collar.\n\nYura slipped through the crowd, speaking crisp English. \"Give him a moment to equip an interpreter.\"\n\nThe reporters fell back half a step. She retrieved a translation earpiece from a staff member and turned to Grid, voice low.\n\n\"You've revealed yourself. Better to control the narrative now than let them build it for you.\" Her eyes were sharp. \"Answer what you want, but don't be stupid. Protect your privacy while keeping them fed. Starve them, and they'll stalk you for months.\"\n\nGrid swallowed. \"Right.\"\n\nHe'd chosen this path when he registered for PvP. No point hiding now.\n\n\"I'm nervous.\" He accepted the earpiece. \"But I'll manage.\"\n\n\"Huhut.\"\n\n*Sometimes he's almost charming.* Yura smiled despite herself.\n\nGrid faced the cameras.\n\n\"Hello.\"\n\nThe first question was a haymaker.\n\n\"You seem close with Yura. Are you lovers?\"\n\n\"What about Jishuka?\"\n\nGrid's brain stalled. *Are you tabloid trash or actual journalists?*\n\nYura rescued him smoothly. \"We're allies working toward Korea's success in this competition. Nothing more. His relationship with Jishuka is similar—they're both Tzedakah Guild members.\"\n\n\"Ah. Understood.\"\n\nThe feeding frenzy resumed.\n\n\"Forty days ago, the first legendary class notification appeared. Was that you?\"\n\n*No. That was the fifth legendary item.* Grid had become Pagma's Descendant eight months ago. But there was no benefit to honesty here.\n\n\"Correct.\"\n\n\"Current level?\"\n\n\"I'm not disclosing that.\"\n\n\"The golden discs and blades—autonomous, insanely durable. Are they class-specific?\"\n\nGrid hesitated. Stonewalling them would backfire, but revealing too much...\n\n*Satisfy them moderately.* Yura's advice echoed.\n\n\"Think of them as tools unique to Pagma's Descendant.\"\n\n\"Tools to compensate for the class's lacking combat power?\" someone ventured.\n\nGrid's glare could have melted steel.\n\nAn American reporter pounced. \"You were dominated by the U.S. representative, Hurent. Analysts worldwide question Pagma's Descendant's combat viability. The legendary Pagma was history's greatest blacksmith **and** swordsman. Did you inherit both skillsets?\"\n\n\"Dominated?\" Grid's laugh was cold. He met the reporter's eyes. \"You want the truth? I haven't fully inherited Pagma's power. My class quest isn't finished.\"\n\nThe hallway went silent.\n\n\"...Incomplete?\"\n\n\"And you still won gold?\"\n\n\"I'm a child compared to Pagma.\" Grid's voice hardened. \"But **only** compared to Pagma.\"\n\nHe let that sink in. Then he dropped the bomb.\n\n\"Hurent? If he enters PvP, I'll log him out in thirty seconds.\"\n\nThe reporters exploded into motion.\n\n\"Write it down!\"\n\nBeside him, Yura's heart hammered against her ribs.\n\n*You magnificent idiot.*\n\n---\n\n**Glossary of Common Terms:**\n\n**OG:** [Original Glossary Link]\n\n**Current schedule:** 20 chapters per week.\n\n**Patreon:** Early access to unedited chapters and bonus content."
}