{
  "id": 177,
  "title": "Chapter 177",
  "content": "# Chapter 177\n\n\"Hurent? If he participates in PvP, I will log him out in 30 seconds.\"\n\nThe conference room went silent. Youngwoo heard nothing but the shallow breathing of two hundred reporters.\n\n*Are you making fun of the United States?*\n\nThe thought ricocheted through the crowd. The US team was superior to every country competing in the National Competition. Most analysts predicted an American sweep of the overall standings.\n\nHurent ranked second on the US roster. Yet Grid—Shin Youngwoo—just promised to eliminate him in half a minute. The remark was dangerous enough to ignite the entire American population.\n\n*This will be front page, guaranteed.*\n\nThe reporters' eyes gleamed. The Korean journalists could barely contain themselves. How would their countrymen react to such a bold claim? They didn't dare imagine the fervor.\n\nThe American reporters shifted in their seats.\n\n\"The experts have analyzed that Hurent is better than you.\" One of them leaned forward. \"Don't you think you're being overconfident? This seems like an exaggeration.\"\n\nAnother raised her voice. \"You've declared it publicly. What happens when you can't log out Hurent in 30 seconds? You'll be disgraced globally. Can you afford that mockery?\"\n\n\"The world will become disappointed that the first legendary class is just a simple braggart.\" A third reporter tapped his recorder. \"Do you have any intention of withdrawing your remark?\"\n\nThe questions carried the weight of threats. Youngwoo met the American reporters' stares and drove his point home.\n\n\"I am better than you think.\"\n\nOriginally, Youngwoo had been below average. He'd taken a leave of absence from school and played Satisfy the day it launched, but he'd fallen behind instead of getting ahead. Then he'd plummeted to hell during Earl Ashur's quest to find Pagma's Rare Book. He'd wasted months on that quest, dying repeatedly and losing everything.\n\nThanks to his unyielding spirit, he'd barely managed to become Pagma's Descendant. But his personality and lack of talent remained problems. He'd been unable to properly utilize the fraudulent class and squandered several more months.\n\nEverything changed after the Malacus raid. After building relationships with the Tzedakah Guild and surviving all types of incidents, Youngwoo gradually evolved. He surely grew. Now, at this moment, Youngwoo was confident he was the best player.\n\n\"Please don't overlook the fact that I am a legend.\"\n\nHe felt proud about overcoming the trials that accompanied his pathetic nature and lacking talent. He expressed this pride without shame.\n\n\"I am the best. Control?\" He shook his head. \"You shouldn't judge and ignore people because of that.\"\n\nThe reporters swallowed. Hundreds of them reached the same conclusion in that instant.\n\n*He's a star.*\n\nNot all of Satisfy's talents became stars. Only a handful possessed something special—something that would stimulate the public and make them enthusiastic. From that perspective, Youngwoo was a true star.\n\nHe was the first legendary class and had pride that matched it. The uncompromising words might make someone uncomfortable, but they would give others excitement. He would be a hot topic whenever he opened his mouth, regardless of whether it was positive or negative.\n\nThe reporters surged forward with more questions.\n\n\"'A successor to Pagma's techniques and will has emerged. He's the only one in the world that can create legendary items.' That phrase appeared in Satisfy. Can you actually create legendary items?\"\n\n\"That's right.\"\n\n\"Ohh...!\"\n\n\"A true legendary blacksmith!\"\n\n\"How likely is it that a legendary item would be produced?\"\n\n\"It isn't high, right?\"\n\n\"What's the difference between your legendary items and the legendary items acquired from raids?\"\n\n\"Do all your equipped items have a legendary rating?\"\n\n\"It's predicted that many top guilds will invite you. Have you ever thought about leaving the Tzedakah Guild?\"\n\n\"What is your stealth? Did you create an invisibility cloak like many experts speculated?\"\n\nThe interview stretched past thirty minutes. The reporters' questions never seemed to end. Youngwoo, a beginner at interviews, reached the limit of his concentration.\n\n*This is crazy.*\n\nYoungwoo wasn't a clever person. Until now, he'd led the interview with full confidence, but he couldn't grasp the point of the current questions. His head spun.\n\nYura noticed his difficulty. \"The interview ends here.\"\n\n\"Isn't there time to spare until the next event?\" A reporter protested. \"Can't you cooperate a bit more?\"\n\n\"No. It will end here.\"\n\nYura had a definite personality. Her decision was final. The reporters knew her nature and retreated. They were already satisfied with the scoops they'd obtained.\n\n\"Sigh... That wasn't an easy task.\"\n\nAfter the reporters left, Youngwoo finally let out a deep breath. His shoulders sagged.\n\nYura smiled. \"You did well.\"\n\nHer ebony hair flicked back as she turned to him, and the sight seemed like a refreshing tonic. Youngwoo felt his fatigue melt away just looking at her.\n\n\"Thank you. I was able to do well thanks to you.\"\n\n\"Rather, I should be the one thanking you.\" Yura clasped her hands behind her back. \"Thanks to you coming today, I was able to win a gold medal.\"\n\nYoungwoo had clearly stated his intention not to participate in the National Competition. Nevertheless, the Korean government and Yura had arbitrarily put him on the roster. It must have been unpleasant for him.\n\nYura knew that Youngwoo hadn't planned to participate in the competition. She was grateful he'd appeared at an unexpected moment and achieved good results. She was also sorry.\n\n\"...Aren't you angry at me?\" Yura asked carefully.\n\n\"I was mad that you got me involved as you pleased.\"\n\nYura bowed her head.\n\nYoungwoo's expression softened. \"But in the end, it was me who decided to participate in the National Competition.\"\n\nThat's right. He'd made the decision himself.\n\n\"I don't blame you.\" He stretched his arms over his head. \"And I unexpectedly like this stage. I really like the situation right now. Ah, it's enjoyable.\"\n\n\"I'm glad.\" Yura smiled.\n\nShe looked at Youngwoo with clear affection. Unfortunately, Youngwoo failed to notice this fact.\n\nArticles about Youngwoo were spreading across the world.\n\n---\n\n**[Shocking news! Pagma's Descendant isn't complete yet!]**\n\n**[The golden discs and blades are Pagma's Descendant's exclusive items! Will future legendary classes also have exclusive items?]**\n\n**[The owner of the first legendary class, Shin Youngwoo. In reality, he's just an ordinary youth.]**\n\n**[Yura and Jishuka? It's a simple friendship.]**\n\n**[Pagma's Descendant can make legendary rated items.]**\n\n**[(Column) The economic influence that Pagma's Descendant can exercise is astronomical. Grid will become the richest.]**\n\n**[Grid has no intention of leaving the Tzedakah Guild.]**\n\n**[Can Grid really produce an invisibility cloak?]**\n\n**[Grid, 'Hurent? I'm not complete yet, but I can log out the 8th place person on the unified rankings in 30 seconds.']**\n\n**[The Americans are angry at Grid's arrogant remark!]**\n\n**[There is a festive atmosphere in Korea.]**\n\n---\n\nThe Korean team's waiting room buzzed with energy.\n\n\"Hahaha! Grid is doing well in interviews!\" One of the Korean players clapped Youngwoo on the shoulder.\n\n\"I felt relieved after seeing all the American reporters close their mouths!\"\n\n\"I'm looking at the reactions from overseas sites right now, and it isn't a joke! There's an uproar. Foreigners are envious of South Korea.\"\n\n\"I never imagined that the first legendary class would be a Korean!\" Another player pumped his fist. \"My heart beat wildly the moment you came!\"\n\n\"Grid is the light of hope for South Korea! I'm proud!\"\n\nYoungwoo's nose rose into the sky. \"Huhuhut... Korea's light of hope... It's a good saying.\"\n\nThe real-time search terms of the portal sites included 'Grid,' 'Grid's interview,' 'Grid's class quest,' 'Shin Youngwoo,' 'Pagma's Descendant,' 'legendary items,' '30 second logout,' 'invisibility cloak,' and 'golden blades.'\n\nIt was the same for TV. Broadcasting stations around the world repeatedly showed how Youngwoo actively destroyed the targets.\n\n---\n\nThe Shin family's vegetable store sat on a quiet corner in the suburbs. Youngwoo's parents were closing up for the day when they turned on the TV.\n\n\"Eh...?\"\n\nThe screen showed their son. Their son. On television.\n\n\"...What's this?\"\n\nYoungwoo's mother dropped the dish towel she'd been holding. News anchors and experts were praising their son as one of Korea's heroes.\n\nThe phone rang. Then rang again.\n\n**—Did you see the news? Aren't you really proud of your son?**\n\n**—Youngwoo's mother always boasted about her son, but isn't her son a really good person? I'm so envious. So happy.**\n\nAlumni they hadn't talked to in more than ten years called. They all spoke about how Youngwoo was a treasure of Korea. \n\nYoungwoo's mother covered her mouth with both hands. His father stood beside her, eyes wet. Their hearts filled to bursting.\n\n---\n\nThe Korean team's waiting room door opened. Three figures entered, producing a friendly atmosphere.\n\nJishuka, Regas, and Pon.\n\nYoungwoo lost his soul.\n\n*Is that a person?*\n\nJishuka's body ratio in real life was too unrealistic. She didn't wear heels, but she looked larger than life. Her legs were very long. Youngwoo stood approximately ten centimeters taller than her, but the length of her legs seemed longer. Her face was also very small. Her body ratio resembled the famous artwork X, which had been lauded as a 'work of art from God.'\n\n*Pretty.*\n\nHer eyes and lustrous red lips stimulated male instincts. Her bright coppery skin and voluptuous body proved why she was regarded as one of the sexiest beauties in the world.\n\n\"Grid!\"\n\nJishuka ran to him. He stood frozen, unable to form words.\n\n\"I wanted to see you!\"\n\nA South American woman's aggressiveness revealed itself.\n\n\"W-Wait...\"\n\nYoungwoo had experienced being hugged by Jishuka several times. He was even a married man. But that was in Satisfy. In reality, he was a virgin who'd never once dated anyone. The world's sexiest woman was hugging him. He couldn't cope with the stimulation.\n\nBlood dripped from his nose.\n\n\"Haha, Grid looks the same in reality and in Satisfy.\" Regas grinned.\n\nPon nodded. \"Yes. It's different from a certain person.\"\n\nThe Korean players stared with jealousy burning in their eyes.\n\n*Yura acted like his manager during the interview and now Jishuka...?*\n\n*He said there was no relationship between them in the interview... No matter how I look at it, isn't this special?*\n\n*Monopolizing two goddesses...! Even if he's Grid, it's hard to forgive...!*\n\nYura's gaze turned cold as she watched Jishuka hug Youngwoo. Jishuka met her eyes and stuck her tongue out.\n\nYura's thin eyebrows narrowed together.\n\nSparks flew as the two women's gazes crossed.\n\n---\n\nThe waiting room of the United States team.\n\n\"Hahahahat! Hurent is going to be logged out in only 30 seconds?\"\n\nZibal, ranked 2nd, laughed pleasantly. He scoffed at Grid. \"He still doesn't understand, despite his weakness being revealed in the target processing event. That dumb guy.\"\n\nHe wasn't just incompetent but stupid as well. Indeed, he was so stupid that the highly acclaimed legendary class was dimmed.\n\nZibal kicked back in his chair. \"Hurent, thoroughly smash him in PvP. Embarrass him publicly.\"\n\nLauel frowned. \"Honestly, is he a person to poke fun at? In the target processing event, he didn't use the golden blades as weapons. If he does, the likelihood of Hurent winning in a one-on-one match will decrease.\"\n\n\"Our rookie is saying so?\"\n\nZibal smiled like he'd heard something cute and shifted his gaze to Hurent.\n\nHurent giggled while reading an adult magazine. \"Don't worry, Lauel. I also have power that I haven't shown.\"\n\nHis battle method that utilized aura was extraordinary. Given Grid's sense of control displayed in the target processing, it was hard for Hurent to imagine being defeated, even considering the added bonus of the golden blades.\n\n\"Pagma's Descendant is clearly a superior class. But Grid is incompetent.\" Hurent flipped a page. \"He won't be able to beat me. This is fate.\"\n\nGrid might've succeeded in raids due to the performance of his items, but a match against a human was different. Control was the most important part. Hurent truly recognized that Grid was inferior to him.\n\n---\n\nAfter a few moments, Hurent held a press conference. The media had enthusiastically requested he respond to the '30 seconds logout' statement.\n\n\"Yes, I am too mature to respond to my opponent's statement about logging me out in 30 seconds...\" Hurent adjusted his collar. \"I won't say anything. But let's make this as clear as possible. That newbie will fall to his knees in front of me.\"\n\nApplause erupted. Due to Hurent's press conference and Grid's interview, the atmosphere of the National Competition became heated.\n\n---\n\nThree days later.\n\nThe world's attention focused on the PvP event that would be held on the last day of the National Competition. Grid and Hurent. Who would receive the stigma of being a braggart?\n\nVarious illegal gambling facilities and sites hurriedly started the betting.\n\nThe Tzedakah Guild didn't miss this opportunity.\n\n\"I will bet everything on Grid.\" Toban spread his hands across the table.\n\nIn the target processing, Hurent had escaped from Grid. Due to that, people analyzed that Hurent was better than Grid. Therefore, the betting odds of Grid winning were raised to 3.2 times. The Tzedakah Guild knew Grid's real power. This was a golden opportunity for them.\n\nToban leaned forward. \"The fact that we are going to gamble, don't let it enter Grid's ears. The moment he tells us to believe in him, we will all go bankrupt...\"\n\n\"Y-Yes...\"\n\nThe guild members fell silent with admiration at Toban's sharp warning."
}