{
  "id": 178,
  "title": "Chapter 178",
  "content": "# Chapter 178\n\nThe second day of the National Competition dawned with no fanfare.\n\nTarget processing ended. The siege and treasure hunt followed in quick succession. Nothing remarkable happened. Youngwoo's involvement with the South Korean team was over. He sat out both events, and without him, South Korea naturally ranked among the weakest of the seventeen competing nations.\n\nStill, it surprised him. Yura had participated in the siege. He'd hoped South Korea would make a decent showing with her on the field.\n\nThe result was a massacre.\n\n\"I'm sorry.\"\n\nThe Korean team waiting room felt like a funeral parlor. Players filed back from the siege with heads bowed, apologizing to Yura. Their faces burned with embarrassment. A few of the younger teenagers had tears streaming down their cheeks. Everyone carried the same weight of frustration and humiliation after being crushed by foreign players.\n\nBut what could they do? This was reality, stark and unforgiving. Korea's rankers sat in the 800s and 1000s. Other countries fielded top 200 players. The power gap was a canyon. Yura alone couldn't bridge it.\n\n\"We held Yura back.\"\n\n\"If I'd just been stronger!\" A young player's voice cracked.\n\nNo one could meet her eyes.\n\nYura moved between them, touching shoulders. \"Don't blame yourselves. You gave everything you had. The whole world saw that. None of this is your fault.\"\n\nShe smiled at them. Beautiful and kind. An angel descending among mortals.\n\nYoungwoo watched her smile and felt fury ignite in his chest.\n\n*Those Yankee bastards.*\n\nThe US team had been livid after settling for silver in target processing, all because of him. They'd wanted payback. So they'd descended on the Korean castle the moment the siege began, attacking with the single-minded focus of a grudge.\n\nSouth Korea's overall power was too weak. They couldn't withstand the American onslaught. Yura fought like a demon, but the other players couldn't support her properly. The walls crumbled. The Korean players were logged out one by one.\n\nFine. Up to that point, fine. War was heartless. The strong devoured the weak. That was the way of things.\n\nBut then one American player crossed the line.\n\nID: Primal.\n\nHe'd survived until the bitter end of Yura's resistance. And then, standing atop the conquered castle, he'd torn down the Korean flag.\n\nRipped it apart. The official flag of a sovereign nation.\n\nThe backlash was immediate and nuclear. Even his fellow Americans refused to defend him. Zibal apologized as the US representative, groveling before the cameras, but it did nothing to stem the tide of outrage. In the end, the organizers stripped Primal of his qualifications. He was barred from the rest of the competition.\n\nBut the damage was done. Korean anger had reached a boiling point. Yes, Primal was the obvious problem. But there were also American players who'd *laughed* while he did it. Some Koreans now hated the entire US team.\n\nYoungwoo was one of them.\n\nHe'd served in the army. He was a reservist. Seeing that flag torn apart had struck something deep in his gut, something visceral and raw.\n\n\"That piece of shit.\"\n\nIf he ever met Primal in Satisfy, he'd make the bastard pay. The US team? He'd repay every drop of despair and disgrace the Korean team suffered today.\n\nHe clenched his jaw, making the silent promise.\n\nFootsteps approached. Yura stopped beside him.\n\n\"That's everything for today. I'm heading back now.\"\n\nYoungwoo studied her face. \"Are you okay?\"\n\nShe'd fought harder than anyone. Alone, she'd held the line until there was nothing left to hold. She should be the most disappointed person here.\n\nYura laughed at his concern. \"I'd be lying if I said I was okay. But I'm not crushed by this. I'll grow from today's defeat.\"\n\nShe was already looking ahead. Next year and the year after that, she'd make sure the outcome was different. Her eyes carried that promise.\n\n*She really is the 5th ranked user.*\n\nYoungwoo felt a surge of respect. They left the waiting room together and found a group waiting for them. Jishuka, Regas, and Pon stood there with expectant grins.\n\n\"Show us around Korea.\" Jishuka's eyes gleamed like lanterns. All three of them radiated excitement at the prospect of having Youngwoo as their guide.\n\nRegas bounced on his heels. \"Take me to a Taekwondo theme park.\"\n\nPon waved him off. \"What nonsense. We should visit a place with beautiful women. Let's hit the hottest club.\"\n\nJishuka crossed her arms. \"You two play by yourselves. I'll enjoy my time with Grid. Alone.\"\n\n\"...\"\n\nYoungwoo's mind went blank. He had no friends. No dating experience. Therefore, he knew absolutely no good places to recommend to foreigners visiting South Korea for the first time.\n\nHe grasped for the simplest solution.\n\n\"Let's eat first.\"\n\n\"Agreed!\" Regas pumped his fist.\n\n\"I'll contact a restaurant.\" Yura inserted herself smoothly into the conversation. Youngwoo, Jishuka, and the rest climbed into her limousine. They headed to the restaurant she'd chosen.\n\n*Why is this woman coming with us?*\n\nYoungwoo didn't want to lose his sanity around Jishuka. Having Yura along felt like a necessary buffer.\n\n*An interpreter is required.*\n\nThat was true. His English was nonexistent. Without Yura, who was fluent in eight languages, he'd be reduced to desperate hand gestures and pantomime.\n\n*An interpreting device is too clunky. Besides, isn't building a relationship with Yura a good thing?*\n\n*Don't forget the Yatan Church is our main enemy.*\n\n*She'll be easier to deal with if she cooperates. Think positive.*\n\n*Hmm.*\n\nYura joined the party after he'd argued himself into accepting it.\n\nThen she proceeded to mistranslate everything at the table.\n\nJishuka leaned forward, voice earnest. \"Grid, do you know why I joined the National Competition? I wanted to see you.\"\n\nYura smiled sweetly at Youngwoo. \"Jishuka said she entered for her country's honor.\"\n\n\"South Korea seems wonderful. Better than Brazil. I'd love to live here.\"\n\n\"Jishuka says she hates South Korea. She never wants to come back.\"\n\nJishuka's eyes narrowed. \"Hey. *Hey*. You're translating me accurately, right?\"\n\n\"It's hard to translate the squealing of a pig.\"\n\n\"You Yatan bitch!\"\n\n\"...\"\n\nYoungwoo sat trapped between them, their voices rising in a rapid-fire English argument he couldn't follow. He looked to Regas and Pon for help.\n\nRegas was shoveling food into his mouth. \"Delicious!\" He sampled every Korean dish on the table with single-minded focus.\n\nPon was leaning over a server, grinning awkwardly. \"Why don't you take off that apron and embrace me?\"\n\n*Are these really the people I know?*\n\nYoungwoo felt a profound sense of dislocation. Regas and Pon seemed like completely different people from their Satisfy counterparts. The chaos escalated as the meal dragged on.\n\n\"G~r~i~d!\" Jishuka's voice had taken on a singsong quality.\n\n\"Youngwoo.\" Yura's words slurred together.\n\nThe argument had devolved into a drinking contest. Both women were now thoroughly drunk. The burden of managing two intoxicated girls fell squarely on Youngwoo's shoulders. He looked around for backup. Pon had left with some woman he'd picked up. Regas had found a nearby Taekwondo dojo and was currently challenging the owner to a spar.\n\nThe sidewalk buzzed with gathering pedestrians.\n\n\"Is that Jishuka and Yura?\"\n\n\"Look! Grid! That's Grid!\"\n\n\"What are the three of them doing together?\"\n\nPeople swarmed. Cameras flashed.\n\n*This is bad.*\n\nJishuka and Yura clung to him like barnacles. If this continued, someone would call the police. His first experience dealing with drunk women, and his imagination immediately conjured the worst possible scenarios. He frantically flagged down a passing taxi.\n\nThe driver looked back. \"Where to?\"\n\nYoungwoo's voice came out flat. \"My house.\"\n\n\"Address?\"\n\nHe gave it. The taxi pulled away with him and two unconscious women in the back seat.\n\nThe witnesses' imaginations ran wild.\n\nMinutes later, speculative stories flooded the internet.\n\n**[Photo News] Drunk Yura and Jishuka Leave in Taxi with Grid**\n\n**[Witness Reports: Yura and Jishuka Could Barely Stand]**\n\n**[Where Did the Three of Them Go?]**\n\n**[Scene Coverage] Currently at OO Hotel Where Jishuka is Staying. Nearly Dawn and She Hasn't Returned**\n\n**[What is Grid Doing Right Now?]**\n\n***\n\n\"Who are these girls?\"\n\nYoungwoo's parents had spent the entire day glued to the TV, watching their son compete. They stared now, pleasantly shocked, as he brought two young women through the door. Their son, who never brought friends home, had just arrived with two beauties at once?\n\nHis father cleared his throat. \"Ahem.\" He retreated to his room, face red.\n\nHis mother fixed Youngwoo with a serious look. \"Son, are you prepared for this? South Korea isn't open enough to welcome two daughters-in-law at once.\"\n\nHeat flooded Youngwoo's face.\n\n\"Mother, you're misunderstanding. If I was planning *that*, would I bring them to our house? Wouldn't I go somewhere else?\"\n\n\"Hohoho, yes, yes. I'll get blankets. Put them in your room. You sleep in the living room tonight.\"\n\nShe disappeared to fetch bedding. Youngwoo bent to remove his shoes. His eyes traveled upward involuntarily. Under their skirts. Pure instinct, not intention.\n\n\"The *lowest*.\"\n\n\"...\"\n\nSehee stood in her doorway, arms crossed. The contempt in her eyes could have melted steel. Youngwoo's dignity crumbled to dust under his sister's glare.\n\n***\n\nDay three of the National Competition arrived.\n\nThe production events took center stage. Crowds cheered as top-ranked crafters appeared in various fields. Blacksmiths, tailors, alchemists.\n\n\"Huh?\"\n\n\"Where's Grid?\"\n\nFaces fell as people scanned the lineup. Grid was a legendary blacksmith. Everyone had naturally assumed he'd participate. They'd been excited at the possibility of witnessing a legendary item's creation.\n\nBut Grid was absent.\n\n\"Is he staying away because of last night's scandal?\"\n\n\"At least the other blacksmiths have a chance now.\"\n\n\"Grid's probably still with Jishuka and Yura...\"\n\n\"My murderous intent is boiling over!\"\n\nSpeculation ran rampant. But Youngwoo hadn't avoided the production events out of shame. It wasn't about Yura and Jishuka.\n\nIt was the three-event limit.\n\nHe wanted to participate in events where he could dominate. Where his individual performance could swing the entire competition's outcome.\n\n\"PvP and pet marathon.\"\n\nBoth events were scheduled for day five. Not team competitions, but solo exhibitions. One country could potentially sweep all six medals. Experts predicted the US would clean up that day, cementing their first-place position.\n\nYoungwoo wouldn't allow it.\n\n*Don't celebrate too early.*\n\nHe'd make them pay. The decision made, he rose from his seat. He opened his bedroom door as usual, preparing to log into Satisfy.\n\nHe froze.\n\nYura and Jishuka were asleep in his bed. Together. Side by side.\n\n\"Pfft!\"\n\nBlood erupted from his nose at the sight. They'd come back so late last night. He'd been paralyzed with indecision. Then both women stirred awake.\n\nAfter that, Youngwoo's house became a circus.\n\nYura and Jishuka bonded instantly with his parents.\n\n\"Let me help with the meal, Mother.\" Yura rolled up her sleeves.\n\n\"Oh my, thank you. Wait, why are you washing eggs and rice with *detergent*?\"\n\nJishuka beamed at his father. \"Father, I'll give you a massage!\"\n\n\"Thank you. My son brought such a nice... *Heok!* M-My back!\"\n\nYura was unfailingly polite. Jishuka radiated brightness. Both were dangerously over-enthusiastic, but they'd already wormed their way into his parents' hearts.\n\n\"...\"\n\nYoungwoo sat on pins and needles. Sehee's death glare never wavered.\n\n\"Sightseeing? Yes, we haven't gone anywhere as a family in ages. Let's make it a trip.\"\n\n\"Our Youngwoo's so accomplished! A TV hero, a hero in some game I don't understand!\"\n\nTwo days passed in a blur.\n\nDay five. The final day of the National Competition. PvP in the morning, pet marathon in the afternoon.\n\n\"Let's go.\" Youngwoo stood.\n\n\"Okay.\" Yura grabbed her bag.\n\n\"Yes!\" Jishuka bounced.\n\nAfter two days living at his house, the three of them arrived at the stadium. The crowd erupted. Cheers and jeers mingled in equal measure."
}