{
  "id": 179,
  "title": "Chapter 179",
  "content": "# Chapter 179\n\nPlayers were aware of other players.\n\nHurent knew there were six people stronger than him: 1st ranked Kraugel, 2nd ranked Zibal, 3rd ranked Chris, 7th ranked Agnus, 11th ranked Bondre, and 14th ranked Hao. Except for them, no one in Satisfy could beat him.\n\n*And I'll surpass all six of them soon.*\n\nHe was the only one. This was his goal. He would get the results he intended.\n\n> **Class: Aura Master**\n> \n> * Weapons are meaningless.\n> * You can control 'Aura.'\n> * The minimum qualifications to become a sword saint have been achieved.\n\n> **Title: Sword Saint Candidate - Stage 1 (Transcendent)**\n> \n> * All stats will become 1.3 times greater.\n> * Quickly detect the target's weakness.\n> * There is a high probability of predicting the target's movements.\n> * 'Super Sensitivity' will be opened.\n\n> **[Aura]**\n> \n> **Rating:** <span class=\"rarity-epic\">Epic</span> (Red)\n> \n> A type of energy that can be controlled. Aura is infinite and always present.\n> The shape, size and characteristics will depend on the caster's inclination.\n> The color of the aura will change according to the rating.\n> The higher the rating, the higher the effectiveness of the aura.\n> The higher the rating, the greater the size of the aura.\n> \n> * Aura can't be separated from the caster.\n> * You can raise the aura rating through training.\n\n> **[Super Sensitivity Lv. 1 (36.4%)]**\n> \n> All senses will become transcended.\n> \n> **Lv. 1 - Telepathy:** You can predict 100% of all your target's behavior within 10m.\n> * This effect will last for six seconds and will continue for two seconds after the effect has ended.\n> \n> **Skill Mana consumption:** All of your current mana.\n> **Skill Cooldown Time:** 1 hour.\n\nGrid?\n\n*He's not even close to my level.*\n\nHurent could see all of his target's movements, despite only being at the beginner level. Pagma?\n\n*How stupid.*\n\nAccording to legend, Pagma was the strongest swordsman. But that was only when Muller was absent. Pagma earned the title after Muller's death. And wasn't Pagma a blacksmith in the first place? How could a blacksmith who swung his sword as a hobby compare to a sword saint?\n\n*Pagma's Descendant is nothing compared to a sword saint.*\n\nHurent manifested aura at his fingertips. He released it at a massive tree exactly five meters ahead.\n\nThe giant tree split the instant the aura touched it. Fixed damage of 4,600. Ranged up to five meters. Free transformation of shape. He also had Super Sensitivity, which let him read enemy movements. This was his strongest skill.\n\nAura Master.\n\nThe weakness was a lack of powerful attack skills, but that could be overcome by raising his aura rating. No matter how he looked at it, Aura Master was a perfect combat class. Nothing like Pagma's Descendant.\n\n\"30 seconds...? Hahat!\"\n\nHurent laughed, recalling Grid's arrogant logout remark. Grid was cocky just because he had the first legendary class.\n\n\"Newbie.\"\n\nGrid didn't know. He couldn't see the gap between them.\n\n\"Prepare to be embarrassed.\"\n\nThe whole world would watch the PvP competition. Hurent would shatter Grid in front of millions. Legend? He wouldn't give Grid a chance.\n\nGrid was nothing. Right now, Hurent only considered Chris and Bondre, who were also on the participant list.\n\n*I'll surpass those two today.*\n\nHurent wasn't even looking at Grid.\n\n***\n\nYoungwoo barely managed to escape the reporters and sighed as he reached the waiting room.\n\n\"Wow, why are they so terrible? I thought I was going to die.\"\n\nIt wasn't a joke. Among the reporters, the male ones looked like they wanted to commit murder. Yura and Jishuka. They cursed and hated Youngwoo for having a scandal with both of them.\n\nYura handed a tournament table to the pale Youngwoo. \"There are a total of 32 PvP participants. The matches were drawn through a fair lottery.\"\n\n\"The number of participants is surprisingly small.\"\n\n\"It's because individuals are limited to three events. The players prioritize events where they can get gold medals, so the 32 players participating in the PvP are all renowned top rankers.\"\n\nYoungwoo looked at the table. He found his ID and froze. \"Is this really true?\"\n\nYura replied with a worried expression. \"Honestly, I'm really surprised. It's a match between you and Hurent in the round of 32. It's also the opening match. Who would've imagined?\"\n\nThe big match of the PvP was the confrontation between Grid and Hurent. People around the world were fixated on it. They wondered how spectacular the clash would be.\n\nThe public grew boisterous. Round of 32. It seemed like a miracle that the confrontation between Grid and Hurent was the opening match. The fight was now imminent.\n\nWho would win? Grid, who claimed he would log out his opponent in 30 seconds? Or would he be disgraced? Most Koreans wanted Grid to win, while foreigners predicted his defeat. The betting pool was astronomical, and the odds for Grid were sky-high.\n\n\"Hurent! Hurent! Hurent!!\"\n\n\"Grid! Grid!\"\n\n\"Hurent! Hurent! Hurent!!\"\n\nThe stadium atmosphere was electric. The voices cheering for Hurent drowned out those for Grid. Some in the crowd even booed. Yura worried Grid's morale would collapse under the one-sided support. But Youngwoo remained calm.\n\n> **[System Announcement]**\n> \n> The PvP competition will be held in 20 minutes. All participants should go to the capsule room.\n\nYoungwoo stood and reassured Yura. \"First of all, I don't have much experience with people cheering me on.\" Conversely, he was familiar with mockery. \"The cheering atmosphere has no effect on me. Hurent? I'll shatter him in 30 seconds and win the gold medal.\"\n\nTwo days ago, Yura had worried after seeing Hurent's one-sided dominance. She thought the walls of the world were too high for Youngwoo. But not anymore. She just trusted him.\n\n\"Take care.\"\n\nThe most beautiful smile was aimed at Youngwoo.\n\n***\n\nPearl Island.\n\nIn the past, it was an island used by the knight academy of the Bonkost Principality. The giant island that once flourished had become deserted and desolate. The glory of the past couldn't be found in the Lion's Castle standing at the center.\n\nAll the facilities, including the walls, were destroyed. The garden was devastated. Ghosts seemed to lurk behind the broken windows. The long-forgotten place shrouded in fog appeared on the massive screens set up in Olympic Station.\n\nThis was the stage of the duel.\n\nThe commentator's voice echoed through the speakers. \"The PvP tournament is heating up the last day of the National Competition!\"\n\n\"Waaaaahhhhh!\"\n\nThe hundreds of thousands of spectators roared. It wasn't just them. Viewers all over the world were excited as well. Who was the strongest person in the world? How brilliant were their control and skills?\n\nKraugel and Zibal might not be participating, but there would be plenty to see.\n\nThe chat rooms lit up:\n\n*It came! Chicken and beer!*\n\n*Two chickens. If 32 people are participating, one chicken won't be enough.*\n\n*If each match is 10 minutes, the PvP will last at least a few hours. I have to binge drink today. ㅋ*\n\n*It's nonsense. Grid will be knocked out in 30 seconds. The match will finish before the chicken arrives.*\n\n*ㅇㅇㅇ Grid is scheduled to lose.*\n\n*Wow ㅋㅋ Do you really mean that? You believe Grid's bluff? ;;*\n\n*He'll log out Hurent in 30 seconds? Crazy ㅋㅋㅋㅋㅋ He was defeated by Hurent in the target processing. ㅋㅋㅋㅋㅋ*\n\n*Guys. If you're South Korean, then you should support our fellow Korean. Cheer for Grid.*\n\n*That's right. I'm anti-Grid because of the matter with Yura and Jishuka. But love is a separate, personal matter.*\n\n*Aye! Don't forget that Grid gave our country a gold medal. I'm very thankful.*\n\n*No, what ㅡ_ㅡ^ a gold medal doesn't matter. What good is it for us if he wins a gold medal? Why should we be thankful? ㅡ_ㅡㅋ*\n\n*ㅋㅋ I shudder every time I see Grid being called a hero on TV. How is he a hero just because he won one gold medal? ㅋㅋ*\n\n*Isn't it natural to praise athletes who win a gold medal for their country? Would you say such things about Olympic athletes?*\n\n*Well anyway, Grid doesn't matter. In a few minutes, he'll be logged out by Hurent.*\n\n*You scum...I bet 4 million won on Grid...My whole fortune...Now I'm dying of tension. I might shit blood in the morning...*\n\n*Oh my god ;; you bet on Grid? ㅋㅋㅋㅋ*\n\n*Wow ㅋㅋ 4 million won on Grid? ㅋㅋㅋ Isn't Hurent certain to win? ㅋㅋㅋ You're just throwing your money into the trash.*\n\n*But the dividend rate is 3.2. If Grid wins, that 4 million won will triple.*\n\n*That only matters if he wins...*\n\nEven on Korean internet sites, few people thought Grid would win. Surprisingly, many netizens expected Grid to be the first eliminated.\n\nAnd then:\n\n\"The players are entering!\"\n\nThe broken Lion Castle. In a desolate garden, a black-haired Asian man and brown-haired Westerner materialized. Grid and Hurent met after attracting worldwide attention for three days.\n\nHundreds of millions watched as they finally clashed.\n\n\"Now I will announce the opening of the PvP match! It has started!\"\n\n\"Waaahhhhhhhh!\"\n\nThe crowd's roar transmitted vividly through the TV.\n\n\"Will Grid win as the Korean people wish?\"\n\nThe commentator's voice boomed. Youngwoo's family sat frozen in front of the TV, praying earnestly for their son and brother to win.\n\nAnd Youngwoo. No, Grid. He began his sword dance.\n\n\"Pagma's Swordsmanship.\"\n\nHurent clicked his tongue. \"Oh my, you're using your slow-paced skill again?\"\n\nHe attacked Grid in the exposed gap.\n\nThe golden blades flew to protect Grid, but Hurent's aura control was delicate. He was already aware of their presence and responded calmly, avoiding the wall of blades to strike Grid.\n\n> [You have dealt 4,600 damage to the target.]\n\n*Good, good.*\n\nHe would trample Grid step by step. Hurent knew Grid's skills. Kill, Link, and Wave didn't have long range, so they posed no threat as long as he maintained distance.\n\nThe ranged skill Transcended Link was somewhat annoying, but it had a cooldown of at least 15 minutes. Hurent thought he could withstand one bombardment by focusing his aura on defense.\n\nHowever...\n\n\"Restraint.\"\n\n\"...?!\"\n\nA completely different skill. Not shown in Bairan or the target processing event. Hurent paled as the notification window appeared.\n\n> [You have been overwhelmed by the enemy's spirit. Your actions are constrained for three seconds.]\n\n*What is this...!?*\n\nHis body stiffened, refusing to obey. Grid closed the five-meter gap. Hurent's body instinctively retreated, but he couldn't open distance. Grid took several steps in the time it took Hurent to shuffle back once.\n\nTwo seconds. Grid closed the gap and unfolded a new sword dance. Hurent focused all his aura on defense.\n\n> [Your defense has increased by 150%.]\n> [A shield that will absorb 5,000 damage has been created.]\n\n*I can endure it once...!*\n\nThe thought didn't last.\n\n\"Kill.\"\n\nThe impact hit like a sledgehammer.\n\n> [You have absorbed 5,000 damage.]\n> [You have suffered 68,300 damage.]\n> [You have died.]\n\n\"...?\"\n\nOn various internet portal sites, the real-time search queries updated to a single entry: '5 seconds.'\n\n***\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}