{
  "id": 18,
  "title": "Chapter 18",
  "content": "# Chapter 18\n\nI melted the iron ore and jaffa together, watching the metals blend in precise proportions. The molten mixture glowed orange-hot as I poured it into the mold. Forty minutes later, I hammered the cooling metal into a thin wire. Then I grabbed a bucket of water and dumped it over the wire.\n\n**Chiiiik!**\n\nThe wire hissed and spat steam as the temperature plummeted. Quenching. The process forced the metal's molecular structure to lock tight, increasing hardness and tensile strength.\n\nSmith's expression soured for the first time since we'd started.\n\n\"You even know about quenching?\"\n\nI wiped sweat from my forehead. \"Yes. I've studied various production methods. I believe in being prepared.\"\n\n\"Studied what, exactly?\" Smith crossed his arms. \"Because this reeks of amateur hour. Why the hell would you quench metal for an arrowhead? You do realize that makes it harder, but also *brittle*, right? The moment that arrow hits armor, the head's going to shatter instead of pierce.\"\n\nHe wasn't wrong. But I had a plan.\n\n\"I'm also going to temper it.\"\n\nTempering meant reheating the quenched metal, then cooling it gradually to reduce brittleness. It was an extra step, a flourish on top of the basic production method. Done right, it would strengthen the metal significantly.\n\nThe problem? It would take forever. More labor. More time hunched over a forge.\n\n*I fucking hate this.*\n\nSmith's frown deepened, clearly thinking the same thing.\n\n\"Do you plan to work all night? I don't understand why you'd waste so much effort on *arrows*.\" He gestured dismissively at the forge. \"Anyone who buys arrows treats them like disposable trash. They're consumables. Why devote yourself to something people are just going to shoot once and forget about?\"\n\n*Why?*\n\nI grabbed the wire with tongs and shoved it back into the coals. *Because if I make it better, I can charge more for it.*\n\n\"If I make it a bit better,\" I said aloud, \"I can sell it for a higher price.\"\n\nSmith stared at me for a long moment. Then he grunted and stepped back. \"Fair enough.\"\n\nHe stopped interfering after that.\n\nI fell into the rhythm of the work. Quench. Forge. Temper. Repeat. Time blurred. My arms ached. My back screamed. The heat from the forge felt like it was baking my skin from the inside out. But my hammering, clumsy at first, grew steadier with each strike.\n\n> [Your persistence has risen.]\n\n> [Your dexterity has risen.]\n\nThe notifications made it worth it. Stats were stats. I'd do damn near anything to increase them.\n\n\"This is insane,\" I muttered, bringing the hammer down again. \"Labor. In a *game*.\"\n\n**Ttang! Ttang!**\n\nBut it was also... fun? In a weird, masochistic way?\n\n*Am I going to end up addicted to this shit?*\n\nThe thought disturbed me. If I started enjoying labor in the game, what would stop me from enjoying it in real life too? I'd probably end up with osteoporosis by forty.\n\n**Ttang! Ttang!**\n\nI kept working despite my complaints. The wire slowly transformed under my hammer. Each strike grew more precise. More controlled.\n\n\"Hoo. Hoo.\"\n\nMy breathing came in short bursts. My arms had gone numb. My skin felt like it was on fire. But I pushed through. As my stamina drained, my focus sharpened.\n\n> [The Legendary Blacksmith's Patience skill has been activated. Concentration, stamina, and defense will rise to the extremes for one hour.]\n\nThe exhaustion vanished like someone had flipped a switch. Energy flooded back into my limbs. I felt refreshed, like I'd just slammed a bowl of cereal with cold milk on a summer morning.\n\n\"Hell yes!\"\n\nI attacked the work with renewed vigor. Hammer met metal in a steady rhythm. The arrowheads taking shape under my hands looked clean. Sharp. Maybe I was biased because I'd made them myself, but they were actually kind of beautiful.\n\nA strange sense of fulfillment settled over me as sweat dripped down my face.\n\n*This isn't just labor.* The thought surprised me. *It's closer to art.*\n\nIn reality, I had no talent. No matter what I tried, I never felt satisfaction. I could break my back working and still fall short. But here? Here I had talent. It only existed in Satisfy, sure. But it was enough.\n\n**Ttang! Ttang!**\n\nHarmony with the hammer. For once in my life, I felt stable. Content.\n\n> [The Legendary Blacksmith's Breath has increased the effectiveness of your production items]\n\n> **[Legendary Blacksmith's Breath]**\n> \n> **Lv. 1**\n> \n> When you are concentrating on making an item, the will of Pagma's Descendant fills the production item.\n> \n> All stats of a production item will increase by 5%.\n> \n> There is a rare chance of giving special features to your production items.\n\nOne hundred arrows. Complete.\n\n> **[<span class=\"rarity-epic\">Special Jaffa Arrow</span>]**\n> \n> **Rating:** Epic\n> \n> **Attack Power:** 35~42\n> \n> An arrow made by a craftsman with great skill and potential but lacking in experience and reputation.\n> \n> Due to the effect of combining jaffa with steel, it has extremely high penetration and ignores some of the enemy's defense.\n> \n> * Has a certain chance of ignoring the enemy's defense.\n> \n> **Weight:** 0.1\n\n> [An epic rated item was produced, so all stats have permanently risen by +4 and reputation throughout the continent has risen by +80.]\n\n> [Quest success!]\n\n> [Affinity with Smith has risen to the maximum.]\n\n> [Experience has risen by 300.]\n\n> [Your level has risen.]\n\nI stared at the notification.\n\n\"Epic rated... arrow?\"\n\n*Arrows are supposed to be Normal rating. Always.*\n\nI'd never heard of an Epic rated arrow in my life. A hollow feeling opened in my chest.\n\n\"Epic rated consumables.\" The words tasted bitter. \"I got an Epic rating on *arrows*.\"\n\nIf I'd made a sword or a piece of armor, this would've been a massive windfall. But arrows? Cheap, disposable arrows? The profit margin was shit.\n\nFrustration boiled up inside me.\n\n*That bastard should've told me to make a sword! Or armor! Anything but arrows!*\n\nI glared at Smith, suddenly hating him for suggesting Jaffa Arrows in the first place. The admiration I'd felt moments ago curdled into anger.\n\n\"You haven't gone through an apprenticeship, yet you're already making something this incredible!\" Smith practically vibrated with excitement. \"These are *ideal* arrows! I've never considered an arrow beautiful before! You're definitely Pagma reincarnated! Ah, you must be tired of my praise by now! You're great! Amazing! Wonderful!\"\n\nHis enthusiasm cut through my resentment.\n\n*Wait.*\n\nI forced myself to think rationally. This was the first item I'd ever crafted, and it came out Epic rated. I hadn't failed. Not even once. That alone was worth celebrating. Plus, the stats. All my stats increased by four points. My reputation jumped by eighty.\n\nAnd the arrow's performance was genuinely impressive. What other arrow in the game had attack power exceeding 40? Plus that special option about ignoring defense.\n\n*One of these arrows is stronger than a level 20 hand weapon.*\n\nSure, arrows were less profitable than other equipment. But with performance like this? I'd definitely make money.\n\n*I just got confused because the result was bigger than I expected.*\n\nI had the Legendary Blacksmith's Craftsmanship skill, which boosted all my items by 10%. That meant a basic Jaffa Arrow with 20 to 26 attack power would come out at 22 to 28 when I made it. Any buyer with half a brain would choose mine over the standard version.\n\nBut would they pay more for a marginal improvement? Probably not. A slight increase in attack power didn't justify a price hike.\n\nThat's why I'd used quenching, forging, and tempering. I'd wanted to maximize my skill's effects through a more elaborate process. I'd expected to produce fairly good arrows. The 10% boost plus the refined production method should've resulted in something decent.\n\nThen the Breath skill kicked in. The finished product exceeded my expectations by a wide margin. Fifteen more attack power than standard Jaffa Arrows, *plus* an option to completely ignore enemy defense. High-level users would buy these no matter the price. They were absolutely worth it.\n\n\"Pu... hahahahaha!\"\n\nEverything hit me at once. The superior stats and skills of Pagma's Descendant. The forty stat points I'd gained from those minus levels. The stat increases from crafting Epic items. And now, arrows I could sell for a premium.\n\nThis was the best day of my life. No question.\n\n\"Better than my birthday,\" I said.\n\nThe only person who remembered my birthday was my little sister anyway. And she always made it awkward with questions like \"Are you sitting alone at home again?\" or \"Don't you have any friends?\" This year, I should ask *her* those questions on *her* birthday. See how she likes it.\n\nYeah. Today was a hundred times better than those embarrassing, lonely birthdays.\n\nSmith watched me laugh like a lunatic. Then he picked up the hundred completed Jaffa Arrows and held them out.\n\n\"I originally promised you half of these.\" He pushed the bundle toward me. \"But I can't take such wonderful creations. You should have all of them.\"\n\nMaximum affinity at work. What a beautiful perk.\n\nMy heart swelled. Smith reminded me of my grandfather. I couldn't help myself. I stepped forward and hugged him.\n\n\"You've shown me great kindness! This was a short meeting, but I'll never forget you.\"\n\nTears glistened in Smith's eyes as he returned the embrace. \"You're leaving already? That's too bad.\"\n\n\"Maybe we'll meet again someday. If we're lucky.\"\n\n\"I don't want you to leave.\" Smith's face flushed. He glanced at me with an odd intensity.\n\nLike a peacock spreading its tail feathers, he tried to attract my attention using his hammers, his tongs, and the solid muscles of his upper body. This man had the air of a widower. He'd been alone too long. Maybe loneliness had driven him to this after his affinity with me maxed out. Or maybe he'd always been this way.\n\nHis dignity crumbled under the weight of his affection.\n\nI straightened and stepped back.\n\n\"I should go now.\"\n\nI grabbed the hundred Epic arrows and tried to make a quick exit. But the 100% reduction in movement speed from my equipment made it impossible. I moved like I was wading through tar.\n\nSmith caught up easily. He wrapped his arms around me from behind.\n\n\"I can see you don't want to leave either! Your passionate heart is full of thoughts of me! I won't give up this affection easily! I won't forget you until the day I'm laid in my coffin! No, I'll think of you even *in* the coffin!\"\n\n\"You crazy bastard, stop saying terrible things!\"\n\nJust like with Doran, the excess weight caused another misunderstanding.\n\nI finally managed to escape Smith's clutches. As I limped away, I made a silent vow. Sell the arrows. Find a warehouse. Move to another village as soon as physically possible.\n\n***\n\nGlossary of Common Korean Terms.\n\nOG: Glossary Link.\n\nCurrent schedule: 16 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}