{
  "id": 180,
  "title": "Chapter 180",
  "content": "# Chapter 180\n\nThe final day of the National Competition fell on a national holiday.\n\n9:00 a.m.\n\nDespite the early hour, chicken shops across South Korea roared to life. Owners mobilized entire families to fry batch after batch of poultry. Phones rang incessantly.\n\n\"One chicken, three beers. Deliver by eleven.\"\n\n\"Two whole chickens for eleven o'clock. I was swamped during the World Cup, so I'm using all my coupons this time.\"\n\n\"Soju, beer, and roasted chicken. Before eleven, got it?\"\n\n\"What do you mean you're out of chicken? Fine. I'll call somewhere else!\"\n\nBy 11:00 a.m., when the PvP tournament finally began, the nation's chicken shops had pulled in ten times their usual revenue. Owners barked orders at delivery drivers hired specifically for this day.\n\n\"Move!\"\n\nEngines roared.\n\nForeign tourists visiting Seoul for the competition witnessed something bizarre. The streets flooded with motorcycles, each bike sporting a delivery box and colorful shop stickers plastered across the sides.\n\n\"Don't Koreans always eat rice?\" one tourist muttered.\n\n\"Apparently they switched to chicken,\" another replied.\n\n\"They stay in good shape despite all that meat.\"\n\n---\n\nExactly at eleven o'clock, the broadcast began.\n\n> **[System] The players are entering!**\n\n\"It's finally starting!\" someone shouted.\n\nFamilies, friends, couples—everyone clustered around televisions in their homes. The camera panned across the Lion's Castle as Grid and Hurent materialized on opposite ends of the arena.\n\n\"I hope Grid wins.\"\n\n\"Honestly, after that target processing disaster, I don't think he can. But I hope he tries.\"\n\n\"Right. Let's cheer him on anyway.\"\n\n\"I don't care what the experts say. He's got a legendary class. That has to count for something.\"\n\n*Ding dong.*\n\n\"Chicken's here!\"\n\n\"Right on time. Perfect.\"\n\nYoung families. Groups of friends. Couples on their couches. They all rushed to their doors as the commentator's voice echoed from the TV.\n\n『 Now I will announce the opening of the PvP match! The duel has begun! 』\n\nThey grabbed their chicken from the delivery drivers, turned back toward their screens, and froze. Boxes tumbled from slack fingers.\n\n『 H-Hurent has been logged out! 』\n\n\"What...?\"\n\nThe legendary class versus the 8th ranked user. How many people had predicted Grid's victory? How many believed he'd actually log out Hurent in the thirty seconds he'd promised?\n\n『 Five seconds! 』\n\nSilence.\n\n『 In only five seconds, Grid has logged out the tournament favorite, Hurent! 』\n\nThe commentator's delayed shout finally broke through the stunned atmosphere. Hundreds of millions of viewers responded.\n\n\"WAAAHHHHH!\"\n\nKorean fans erupted. Foreign viewers sat shell-shocked. The world descended into chaos.\n\n**[BREAKING: Grid wins in 5 seconds]**\n\n**[Pagma's Descendant logs out 8th ranked user in 5 seconds!]**\n\n**[Grid fulfills his 30-second promise!]**\n\n**[United States receives devastating blow]**\n\n**[Will Grid claim another gold medal for South Korea?]**\n\n**[The 5-second logout legend!]**\n\nFive seconds. Five seconds. Five seconds. Every headline screamed the same thing. Real-time search rankings exploded with terms like \"5 seconds,\" \"Grid,\" \"Grid victory,\" \"Grid is broken,\" \"Shin Youngwoo,\" and \"Korean gold medal.\"\n\nThe internet forums ignited.\n\n*—G...God Grid.*\n\n*—God Grid! Forgive us who mocked you five seconds ago!*\n\n*—What just happened? Is this a bug?*\n\n*—The 8th ranked user just got deleted.*\n\n*—I'm getting chills. Actual chills.*\n\n*—What's that emoticon supposed to mean?*\n\n*—The American forums must be on fire right now lol*\n\n*—Chinese forums are drowning in jealousy lol*\n\n*—Japanese community is screaming about bugs and conspiracies*\n\n*—So satisfying! That American who tore the Korean flag must be crying. Praise God Grid.*\n\n*—3.2x on 4 million won. Congratulations to me.*\n\n*—I bet 6 million on Hurent... that bastard.*\n\n*—I put my entire salary on Hurent. Three million won gone.*\n\n*—Koreans should support Koreans. I bet 15 million on God Grid. From now on, I only believe in God Grid.*\n\n*—You're a degenerate gambler.*\n\n*—I bet 300,000 won, this jackpot will last me three months lol*\n\nTens of thousands, hundreds of thousands, millions of won exchanged hands. Fortunes won and lost. For some, chewing gum money. For others—wealthy businesspeople, successful freelancers, Satisfy rankers—hundreds of millions or billions of won gambled away.\n\n\"I shouldn't have trusted those damn experts!\" one mogul screamed.\n\n\"Get my lawyer on the phone. I'm suing everyone.\"\n\nSeveral wealthy investors suffered devastating losses. Meanwhile, others celebrated.\n\n\"Hahaha! Amazing! Incredible!\"\n\n\"Grid, I love you!\"\n\nMisfortune for some, fortune for others. The Tzedakah Guild members, already billionaires from Satisfy profits, had struck gold. Those who believed in Grid's victory had bet not just their existing assets but borrowed funds from financial institutions.\n\nA 3.2x dividend. Instant multi-billionaires. Tens of billions of won gained in a single moment. Enough to buy yachts, private jets, travel with models, live like movie stars.\n\nBut they were Satisfy rankers. The game meant more to them than reality.\n\n\"Hehe... I need to commission an item from Grid with this money.\"\n\n\"I'll keep investing in Grid until he makes me a legendary item.\"\n\nThe gaming addicts planned to buy one or two buildings for security, then funnel the rest back into Grid.\n\n---\n\n『 Not only is he a legendary class user, but he possesses ultimate-tier skills. That Kill technique is clearly the pinnacle of his class abilities. No player could withstand damage of that magnitude. 』\n\n『 The skill power is impressive, but I'm more interested in that blue greatsword. Remember the target processing event? Grid used that same weapon to log out multiple rankers. It's clearly an exceptional legendary item. 』\n\n『 Agreed. The so-called \"best weapon\" theory. It would be fascinating if Player Grid revealed the weapon's details. 』\n\nThe analysts weren't wrong. Even among legendary items, weapons created by Pagma's Descendant existed on a different plane.\n\nThe <span class=\"rarity-legendary\">+9 Failure</span> boasted an attack power of **1,768~3,682**. Already the strongest weapon at +0, the +9 enhancement with its 70% damage boost pushed it into truly overpowered territory.\n\nCompare it to other legendary weapons of equivalent level. The average powerful two-handed weapon hit around 1,000 attack power. Failure's maximum damage was three times higher. Apply the 1,800% multiplier from Level 2 Kill to that?\n\nDeath. Instant, unavoidable death.\n\nGrid mulled over the results. *The boss monsters took hundreds of thousands of damage, but Kill only dealt 68,000 to Hurent... His defense is real. Guess he wasn't just bragging.*\n\nAura Masters didn't need weapons. Hurent could afford to invest more heavily in armor than other users, and he wore the highest-ranked unique armor available. Yet he still died in one blow.\n\n\"Huk...!\"\n\nHurent burst from his capsule, face pale as death, body drenched in sweat.\n\n*What the hell just happened?*\n\nLauel handed him a towel.\n\n\"You lost.\"\n\nSilence stretched between them.\n\nHurent couldn't process it. Losing to Grid hadn't even entered his calculations. He stared at nothing, replaying the fight frame by frame. Then he smiled, bitter and resigned.\n\n\"Yes... That's a legendary class, alright.\"\n\nHis control meant nothing against that raw strength. That crowd control skill that locked his body despite maintaining a perfect five-meter distance—what was that? He couldn't move, couldn't react, just took the linked skill combination straight to the face.\n\nCrushed by pure power. Like a fly.\n\n\"Legendary skills...\"\n\nSomething he didn't possess yet. He needed to push his aura to legendary rating faster. Train harder. Hurent felt motivation rising through his frustration. His expression cleared as he wiped away sweat.\n\n\"Now that I'm the loser, reporters will leave me alone for a while. I should abandon other activities and focus on hunting.\"\n\nStrength came through training. Nothing else.\n\nLauel offered his assessment. \"The real problem is that blue shark-shaped greatsword Grid wields. Its performance exceeds imagination.\"\n\n\"Yeah.\"\n\nHurent couldn't deny it. No matter how high the skill multiplier, wasn't that damage excessive? Skills needed baseline high attack power to function. Grid's weapon was undeniably top-class. But why mention it now? Hurent studied Lauel's determined expression, then understood.\n\n\"You're... going to join him, aren't you?\"\n\nLauel didn't deny it.\n\n\"That's right.\"\n\nHe was sick of being called a rookie. He wanted to leap to the top of the rankings immediately. But he'd started too late. When he hit level 1, the top rankers were already level 180. Talent alone couldn't bridge that gap. To catch up with them...\n\n\"This match showed me the true power of items.\"\n\nLauel was one of the Ten Rookies. Even now, Ibellin from the Tzedakah Guild considered him a rival.\n\n\"I'm joining the Tzedakah Guild.\"\n\n\"...\"\n\nZibal, ranked 2nd globally, harbored ambitions of conquering every territory in Satisfy to become its supreme ruler. He needed the strongest players for that vision, and he'd been courting Lauel aggressively. The offer to join the Snake Guild came with shocking incentives. Lauel planned to refuse.\n\n\"Didn't the Snake Guild promise you millions of gold?\" Hurent asked. \"Is rejecting that astronomical sum worth following Grid?\"\n\nLauel nodded without hesitation. \"Don't you understand now better than anyone? Combat sense and control aren't special. The most important element in this game is items.\"\n\nMillions of gold? What use was that? No amount of money could buy the strongest items. In Satisfy, only Grid could forge the most powerful equipment. His abilities were necessary for Lauel to reach the top ranks. Beyond that, Lauel genuinely admired Grid.\n\n\"Items over control... I envy Grid for teaching me the simple greatness of that truth. I'm fascinated by strength capable of logging you out in five seconds. I want to play this game alongside him. How about you?\"\n\n\"...\"\n\nZibal had also invited Hurent to join his guild. But Hurent's pride as a Sword Saint candidate made him reluctant to serve under anyone. He'd never responded to the invitation.\n\nBut now.\n\nAfter experiencing Grid's power firsthand, after hearing Lauel's words, something shifted. To become stronger, he needed items. To obtain those items...\n\n*There's no answer except Grid.*\n\nPride still held him back.\n\n\"I'm an Aura Master.\" Hurent's jaw tightened. \"The strongest items? They're useless against me.\" \n\nEventually, his aura would reach legendary rating. \n\n\"When that happens, I'll cut down Grid and that blue greatsword.\"\n\nNext time they met, he'd log Grid out before Grid could even activate a skill. Hurent made that vow, left the stadium, and headed straight for Incheon International Airport. Time to return to the States and devote everything to building strength.\n\n---\n\n\"Impressive.\"\n\nBondre, the French representative and 11th ranked user, considered Grid's performance. No—he marveled at it. Logging out Hurent in five seconds? He'd never imagined such a thing possible. But he didn't feel threatened.\n\n\"The Restraint and Transcended Link skills are somewhat troublesome.\"\n\nBondre's class was Ice Mystic. What if he froze the entire arena floor with overwhelming magic power? Grid's sword dances wouldn't function properly. Pagma's Swordsmanship required at least four steps to activate.\n\nCould that guy dance on frozen ground? He'd be lucky not to fall on his ass.\n\n*Looking back at the Bairan battle, he has some artifact that lets him fly.*\n\nWhat if Grid took to the air to avoid the ice? Bondre would feel even more comfortable.\n\nThe PvP stage was an island. The atmosphere brimmed with moisture. If he froze all that moisture, Grid would be trapped in the sky. The physical constraints of ice webs couldn't be broken with CC immunity alone.\n\n*An island is the perfect stage for me. Grid, you can never beat me.*\n\n**[Absolute Zero Lv.2 (76.0%)]**\n\n> Freezes the target and deals fixed damage of **42,000**.\n> \n> Skill Mana Consumption: 50% of current mana.\n> \n> Skill Casting Time: 7 seconds.\n> \n> Skill Cooldown: 20 minutes.\n\nHis ultimate skill, learned from an S-grade magic book. Yura's Divine Punishment she'd demonstrated in target processing looked pathetic compared to this. The casting time was incredibly long, limiting opportunities to use it.\n\nBut one-on-one duels were different. If he could completely lock down his opponent's movement, this became the perfect finishing move. Superior to Divine Punishment in raw damage because it focused on a single target.\n\nThis Absolute Zero skill had defeated both Yura and Hurent when they fought Bondre.\n\n*Assuming Grid is level 290, his health must be... no, it's impossible even in the worst-case scenario.*\n\nGrid's health had to be 35,000 or less.\n\n\"This time, you'll be the one dying in a single blow.\" Bondre laughed. \"Kukukuk...\"\n\nHe'd face Grid in the round of sixteen. He'd prove his supremacy by completely overwhelming Grid, who'd just logged out Hurent in five seconds.\n\nBondre brimmed with confidence.\n\nJust like Hurent had, five minutes ago.\n\n---\n\n**Glossary of Common Korean Terms:**\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}