{
  "id": 181,
  "title": "Chapter 181",
  "content": "# Chapter 181\n\nExperts across the broadcast networks shared the same prediction. Bondre held the advantage.\n\n『 An ice mystic specializes in crowd control and defense. Every attacking skill inflicts slowness and frostbite. Some spells freeze targets solid. The class excels at chaining status effects without gaps. 』\n\n『 The defensive capabilities are equally formidable. Ice mystics command multiple shielding spells, particularly effective against physical damage. Superior crowd control combined with impenetrable defense. A perfect counter to physical damage dealers. 』\n\n『 The class has drawbacks, naturally. Low damage output makes hunting and raiding inefficient. But players have far less health than monsters. In PvP, weak firepower becomes irrelevant. 』\n\nA second analyst leaned forward. 『 You mentioned crowd control as Bondre's strength. Grid demonstrated complete immunity to Bubat's status effects during target processing. Won't Bondre's skills be nullified? 』\n\n『 Incorrect. Even with CC immunity, Grid cannot escape ice. 』\n\n『 Explain. 』\n\n『 Skills like Ice Prison or Ice Spider Web create physical barriers. They don't rely on status effects. They trap the target in frozen walls. CC resistance means nothing when you're locked in a cage, waiting for Absolute Zero to hit. 』\n\n『 So Bondre restricts Grid's movement space? 』\n\n『 Precisely. The PvP stage is an island surrounded by water. Ice magicians gain twenty percent bonuses to magic power and casting speed in aquatic environments. Bondre is strongest near water. His defeat seems unlikely. 』\n\n『 Win or lose, we'll witness the legendary Ice Spider Web. That alone makes this worth watching. 』\n\nIce Spider Web was as beautiful as it was deadly. The spell froze atmospheric moisture into crystalline patterns that bound everything within range. Victims found themselves trapped in a web closing from all directions. Not even finger movement remained possible in that frozen prison.\n\nThree months ago, Bondre had won a JIN-sponsored PvP tournament using that exact technique. He'd crushed Katz, JIN's heir and holder of the third epic class.\n\n\"Class ratings don't determine outcomes. Bondre is a normal class, yet he trampled an epic class user. A legendary class holds no terror for him.\"\n\n\"Bondre fights smart. Solid fundamentals, calculated risks. Unlike Hurent, he can beat Grid.\"\n\nMost French viewers agreed with the expert analysis. Bondre's victory seemed certain. Their faith had foundation. Bondre had never lost a match. His nickname, '100 Matches 100 Victories' Bondre, wasn't empty boasting.\n\nInternational reactions varied.\n\n\"I've stopped trusting the experts.\"\n\n\"Right? They guaranteed Hurent would win. Look how that turned out.\"\n\n\"But Bondre's strength is legitimate. An undefeated legend...\"\n\n\"Bondre's level doesn't match Hurent's. Grid can take him. I'm betting on it.\"\n\nKorean netizens launched into heated debate.\n\n*-100 Matches 100 Victories Bondre... This time Grid faces real trouble.*\n\n*-God Grid will win.*\n\n*-Bondre is famous for clever tactics. Remember how he outplayed everyone in the labyrinth breakthrough? Grid revealed Restraint against Hurent. Bondre will exploit that.*\n\n*-If Grid closes the distance, isn't victory guaranteed?*\n\n*-An ice mystic means constant stiffness. Multiple ice barriers and shields will prevent Grid from activating skills. Then Bondre counterattacks during the opening.*\n\n*-How does Grid approach in the first place? Ice mystics are broken. Only downside is slow hunting speeds.*\n\n*-But Bondre is ranked 11th.*\n\n*-Which proves his skill. Meanwhile, Grid has overgeared equipment.*\n\n*-Here we go again.*\n\n*-Didn't you say Grid couldn't beat Hurent? What happened? Five-second knockout. Stop pretending you know everything.*\n\n*-Shut up and praise God Grid.*\n\n* * *\n\nYoungwoo's parents couldn't hide their anxiety. Every expert on television predicted their son's defeat.\n\nSehee crossed her arms. \"Brother will win again.\"\n\nBefore the Hurent match, the world had declared her brother's loss inevitable. The result? Five seconds. Her brother would win again. She believed it.\n\n*All the time and passion Brother has poured into Satisfy...*\n\nSehee knew nothing about Satisfy's mechanics. But her brother lived in that game. Spent every waking hour inside it. The idea that someone could defeat him seemed absurd.\n\n*Right, Brother? Just win.*\n\nPeople had ignored him for so long. Now the world was watching. Acknowledging him. Sehee's chest felt warm. Pride swelled within her.\n\n* * *\n\nThe Korean team's waiting room felt too quiet.\n\nYura paced near the door. After defeating Hurent, Youngwoo hadn't returned. He'd gone somewhere else. Her phone showed no missed calls.\n\n*I need to give him advice...*\n\nBondre fought nothing like Hurent. She'd lost to him personally. Understood his methods. Youngwoo had demolished Hurent in five seconds, a phenomenal achievement, but success bred carelessness.\n\n*If he gets trapped in an ice prison or web, there's no room to swing.*\n\nYoungwoo's greatswords measured three meters minimum. Greatswords needed space. Tight quarters meant death. Once trapped, the sword couldn't swing. The ice walls wouldn't break. Absolute Zero would finish him.\n\n*He needs to end this before Bondre casts his prisons and webs.*\n\nYura wanted to tell him. Needed to tell him. But Youngwoo's phone went to voicemail. She couldn't find him.\n\n*If he's careless...*\n\nWhile Yura worried, Youngwoo was meeting someone in a private room beneath the stadium.\n\n* * *\n\n\"My name is Rail Smith. In Satisfy, I go by Lauel.\"\n\nThe speaker looked too young to be called a man, too mature to be a boy. Late teens, probably. Blond hair, pale skin. Calm eyes above stubborn lips. Delicate forehead, narrow jaw. He reminded Youngwoo of a British period drama protagonist.\n\nYoungwoo glared at him.\n\n\"So what? Why did you call me here?\"\n\nLauel blinked at the hostility. \"The Tzedakah Guild...\" He paused. \"Actually, forget them. Please accept me as your subordinate.\"\n\nGrid knew who Lauel was. Ibellin talked about him constantly.\n\n*A genius among geniuses.*\n\nThe only person Ibellin considered a rival. That guy wanted to be Youngwoo's subordinate? Youngwoo's expression turned skeptical. \"Why do you want to follow me? You want me to make you an item?\"\n\n\"Yes.\" Lauel answered directly.\n\nYoungwoo nodded.\n\n\"Okay.\"\n\n\"Huh?\"\n\nLauel stared. Youngwoo had agreed immediately. He'd prepared elaborate arguments, contingency plans, persuasive rhetoric. All wasted.\n\n\"The more slaves I have, the better.\"\n\n\"...\" Lauel's Korean was imperfect. He didn't know the exact meaning of 'slave,' but context suggested 'subordinate.' \"Thank you for accepting me. Give me what I want, and I'll pledge eternal loyalty.\"\n\n\"Yes, yes.\"\n\nLauel spoke casually about eternal loyalty. Another one like Huroi.\n\n*Not bad.*\n\nRecently, his mineral finder, Minor, had only recommended dangerous locations. Cork Island Dungeon, for example.\n\n*Never thought I'd fight the great demon Hell Gao while mining. I need a bodyguard for when these absurd situations happen.*\n\nHe already had Jude, a powerful knight, but Jude was an NPC. NPCs had finite lives. Youngwoo hesitated to bring them into danger zones.\n\nBut Lauel was a user. Youngwoo's expression brightened.\n\nLauel cleared his throat. \"You should be careful of Bondre. Don't give him time to cast his ice prisons and webs.\"\n\n\"I don't know what ice prisons and webs are, but don't they need casting time?\"\n\n\"...Yes, but approaching him will be difficult.\"\n\nBondre could generate a one-meter diameter ice barrier in under 1.5 seconds. Even if Grid advanced while resisting slow, frostbite, and freeze, the barrier would delay him.\n\n\"By the time you break the ice barrier, Bondre finishes casting.\"\n\nSo what? Ranged skills were the answer.\n\n\"If I had to give advice on timing...\"\n\nYoungwoo waved his hand, cutting Lauel off mid-explanation. Lauel had been about to suggest the optimal moment for Transcended Link.\n\n\"I'll take care of it.\"\n\n\"Yes.\"\n\n*He should taste frustration at least once.* Lauel hoped defeat by Bondre would cure Youngwoo's arrogance, make him more cautious. He didn't know. Youngwoo had suffered countless setbacks already.\n\n*Anyway, I can log out Bondre in five seconds.*\n\nRight now, Youngwoo wasn't being arrogant. He understood his strength better than anyone. The situation was clear.\n\n*I'm the strongest.*\n\nHurent had called boss monsters \"fools who just use strength.\" Boss monsters were strong but ignorable, according to him. The reality? The Pope. The Awakened Guardian of the Forest. Hell Gao. Had Hurent ever struggled with monsters of that caliber? Even if he'd fought strong bosses, had he ever defeated them solo?\n\n*He doesn't understand the subject.*\n\nYoungwoo had ignored that conceited man. Smashed him in five seconds. The memory made him grin.\n\n\"Puhuhu.\"\n\n> [After a while, the first match of the round of 16 will begin. All participants should go to the capsule room.]\n\nYoungwoo moved according to the announcement.\n\n\"I am on a different dimension from all of you.\"\n\nThe only legend. He would show the world why a legend was a legend.\n\n* * *\n\n> [Grid, who logged out Aura Master Hurent in five seconds, versus the undefeated Bondre! With hundreds of thousands of spectators and hundreds of millions of viewers watching! Their showdown begins... now!]\n\nPapat!\n\nGrid and Bondre materialized in the desolate garden of Lion's Castle.\n\n\"Ice Field.\"\n\nBondre didn't hesitate. He immediately transformed the terrain to favor his magic.\n\n*Jjejeok! Jjejejejeok!*\n\nThe ground froze solid in a fifty-meter radius. Now Grid would slip with every step. \n\nGrid stood still. Didn't even attempt to move.\n\nBondre smiled.\n\n*I've blocked his skills.*\n\nGrid needed at least four steps to activate Pagma's Swordsmanship. The ice field prevented free movement. And even if he somehow avoided slipping?\n\n*Sharp ice spikes will erupt with each step. His sword dance becomes impossible.*\n\nGrid had one choice. He couldn't use skills on the ground, so he'd inevitably fly into the sky. Bondre was planning to cage him mid-air with Ice Spider Web.\n\n*I'll finish it with Absolute Zero.*\n\nBondre's satisfied smile widened.\n\nGrid still hadn't taken a single step. He swung his black greatsword lightly.\n\n\"Golden Flash.\"\n\n*Kuwaaaaaang!*\n\n> **[Golden Flash]**\n>\n> A skill attached to <span class=\"rarity-unique\">Dainsleif (Reproduction)</span>.\n>\n> All enemies in a straight line will receive damage equal to 1,000% of your current magic power.\n>\n> **Skill Mana Cost:** 500  \n> **Skill Cooldown Time:** 1 hour\n\nGolden Flash was an instant skill, unlike Pagma's Swordsmanship. The speed was brilliant when used across flat terrain. Just...\n\nGrid was a warrior-type player. He couldn't use Golden Flash efficiently due to low magic power. However, the current Grid...\n\n> **Name:** Grid  \n> **Level:** 253 (11,090/39,556,900)  \n> **Class:** Pagma's Descendant  \n> * The probability of adding additional options when making items will increase.  \n> * The probability of item enhancement will increase.  \n> * All equipment items can be worn unconditionally. However, there is a penalty depending on the rating of the item.\n>\n> **Title:** One who Became a Legend  \n> * Abnormal conditions don't work well on you.  \n> * You won't die when health is at the minimum.  \n> * Easily acknowledged.\n>\n> **Title:** First Unique Item Maker  \n> * Dexterity +200\n>\n> **Title:** Only Legendary Item Maker  \n> * Dexterity +350\n>\n> **Title:** Knight Slayer  \n> * Stamina +100  \n> * Strength +30\n>\n> **Title:** Apostle of Justice  \n> * All stats +10  \n> * The Apostle of Justice's bravery is unmatched.\n>\n> **Title:** Man who has Touched Hell  \n> * Health +3,000  \n> * You have the right to go to hell.\n>\n> **Health:** 48,778/48,778 **+9,000**  \n> **Mana:** 5,118/5,118\n>\n> **Strength:** 2,314 **+40** | **Stamina:** 1,182 **+110**  \n> **Agility:** 647 **+10** | **Intelligence:** 643 **+210**  \n> **Dexterity:** 1,384 **+560** | **Persistence:** 808 **+10**  \n> **Composure:** 594 **+10** | **Indomitable:** 675 **+10**  \n> **Dignity:** 594 **+10** | **Insight:** 907 **+10**  \n> **Courage:** 538 **+10** | **Demonic Magic Power:** 2 **+10**\n>\n> **Stat Points:** 230  \n> **Weight:** 45,019/110,520\n\nGrid's intelligence reached 853 when wearing <span class=\"rarity-unique\">Malacus' Cloak</span>. He'd experienced the level 200 stat awakening. The second awakening meant mana increased by six points and magic damage by two points per intelligence.\n\nGrid currently possessed 1,706 magic power. Multiply that by ten. The attack power far exceeded Bondre's Absolute Zero.\n\n\"What...?\"\n\nDidn't Grid always dance when using skills? What was this? Bondre hadn't expected it.\n\n\"Ice Barrier!\"\n\nBondre paled. He hurriedly cast magic. Ice Barrier had the most physical defense among all his shields. \n\nIt was helpless before Golden Flash, which dealt damage proportional to magic power.\n\n*Jjejeong!*\n\n\"Heok...!\"\n\nGolden Flash penetrated the shield completely. The overwhelming force shattered the ice barrier instantly.\n\n> [You have suffered 12,530 damage.]\n\nA blow removing forty percent of a user's health at once caused three seconds of stun. Bondre just lost eighty percent of his health.\n\n> [You can't regain your mental state.]\n\n\"W-What...!\"\n\nA chill ran down his spine. Dozens of energy blades hurtled toward his face.\n\n\"...!\"\n\n*Kwa kwa kwa kwang!*\n\nA devastating explosion shook Lion's Castle. The commentator glimpsed faint grey light and shouted reflexively.\n\n『 P-Player Bondre has been logged out...! 』\n\nThis time, four seconds. '4 seconds' immediately ranked first on real-time search terms across multiple portal sites. The world reeled in shock again.\n\n* * *\n\nZibal jumped to his feet.\n\n\"He broke the ice barrier? That means his magic power...!\"\n\nZibal hadn't lost composure when Hurent fell. Hurent was overconfident and got stung. Nothing more. But now that assessment changed.\n\n*A monster.*\n\nWas Grid hiding special tricks? Nonsense. He wasn't hiding anything. His power simply exceeded Zibal's predictions by an immeasurable margin. Yes, just like Kraugel. Someone who couldn't be matched until third advancement.\n\nThe world began pouring praise toward Grid. Korean netizens united for the first time in almost a century, shouting 'God Grid!' Even the experts stopped ignoring Grid.\n\n『 The phrase 'Praise God Grid' is spreading across the Internet. I also want to praise God Grid. 』\n\n『 That... me too... 』\n\n『 ... 』\n\n* * *\n\nSatisfy.\n\nAt a hunting ground, Peak Sword encountered a party of foreigners. He asked in broken English:\n\n\"Do you know Grid?\"\n\n***\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}