{
  "id": 183,
  "title": "Chapter 183",
  "content": "# Chapter 183\n\nDragons birthed creatures in their own image as playthings. These lesser beings became known as drakes. Where dragons possessed godlike intellect and power, drakes were crude imitations. A dragon stretched dozens of meters in length; a drake measured barely three meters, tail excluded.\n\nYet they demanded respect. Dragon blood flowed through their veins, making them apex predators. Their minimum level sat at **260**. They moved twice as fast as griffons and hit twice as hard. Top speed reached 120 kilometers per hour. They breathed fire.\n\nIn short, drakes made perfect pets. They had no weaknesses, save one: taming them bordered on impossible. Each drake's temperament varied wildly depending on its elemental affinity.\n\nHundreds of millions of viewers anticipated the variety of drakes this pet marathon would showcase. Grid drew particular scrutiny.\n\n\"Think Grid tamed a dark drake?\"\n\n\"Dark attribute? That exists? First I'm hearing of it.\"\n\n\"Not surprising. Fewer than a hundred users in Satisfy have tamed drakes. Maybe one or two managed dark drakes.\"\n\n\"What makes dark drakes special?\"\n\n\"Like bone dragons, they're undead. Pure skeleton. Infinite stamina.\"\n\n\"Wait. They never get tired? That's broken. You could cross the entire continent.\"\n\n\"There are restrictions. The bones degrade. You have to replace them constantly. And they're dumb as rocks.\"\n\nDark drakes couldn't process complex commands. In battle, they were liabilities. But that infinite stamina made them ideal for a simple race to the finish line. Even a stupid dark drake could handle that.\n\n\"Grid might actually have one.\"\n\n\"He's shocked us twice already in this competition.\"\n\nExpectations ran high. The man who dominated target processing and PvP could easily possess such a rare mount.\n\nBut then...\n\n\"Nyang!\"\n\nGrid summoned not the strongest pet, but a tiny cat.\n\nSilence blanketed the arena.\n\n\"A cat?\"\n\n\"You've got to be kidding.\"\n\nDisappointment rippled through the crowd. It lasted only seconds before transforming into something else entirely.\n\n\"Gwiyeopda!\"\n\n\"Cute!\"\n\n\"Kawaii!\"\n\n\"Mignon!\"\n\nExclamations erupted in every language. Korean, English, Japanese, French. Even viewers who typically ignored cats found themselves captivated. Children and young women began to swoon.\n\nA child tugged her mother's sleeve. \"Mother! Buy me one!\"\n\n\"Honey, let's get a cat. Please?\"\n\nGrid's summon resembled a Persian cat. Its coloring was striking. Jet black fur covered its entire body except for four snow-white paws. In darkness, those paws would float like ghosts.\n\nSmall devil wings sprouted from its back. The cat flapped them lazily, circling Grid's head. It looked plucked from a storybook.\n\nThe commentators stared, transfixed, before turning to the panel of pet experts.\n\n『 What type of creature is that? 』\n\n『 ... 』\n\nFour renowned specialists sat in stunned silence. None recognized the winged cat. But they reached one immediate conclusion.\n\n『 The drakes will eat it alive. 』\n\nNo one could argue otherwise. Cats didn't fight the continent's strongest monsters. The size disparity was absurd. Three meters versus forty centimeters. A drake could swallow the cat in a single gulp.\n\n\"That poor thing...\"\n\nSympathy washed over the spectators. Meanwhile, Grid's fellow competitors laughed openly.\n\n\"A cat? I thought legendary classes had legendary pets!\"\n\n\"Taming isn't easy. He must have no talent. None at all.\"\n\n\"Wish he could forge an item to help with taming, right?\"\n\n\"Still, a cat is too much. South Korea has no drakes, sure, but a cat?\"\n\n\"At least a griffon would survive. They're called drake prey for a reason. But they'd outlast a cat.\"\n\nSouth Korea should have placed last in the National Competition. Grid alone dragged them to third. Foreign players seized this chance to mock him.\n\nGrid snorted. \"Laugh while you can.\"\n\nNoe wasn't a cat. Memphis weren't cats. The creature's appearance deceived. In truth, Noe was fearsome. Hell's strongest demonic beast, no less.\n\n*These idiots.*\n\nGrid smirked at the competitors, then glanced at Noe. Something was wrong. The brave creature from their first meeting was trembling.\n\n\"What's this?\"\n\nGrid opened Noe's status window.\n\n---\n\n> **Name:** Noe  \n> **Species:** Memphis  \n> **Level:** 1 (0/200)  \n> **Affinity:** 5/100  \n> **Health:** 5,000/5,000  \n> **Physical Attack Power:** 60 | **Magic Attack Power:** 30  \n> **Defense:** 50 | **Magic Resistance:** 80  \n> **Attribute:** Dark  \n> **Status:** Fearful  \n> *(What is this, nyang? Why so many dragons, nyang? Kyak! Crazy Master wants to feed me to dragons! Nyang! Save me, nyang!)*\n\n---\n\nMemphis possessed intelligence and strength surpassing most demonkin. The great demons cherished them above other hellish beasts. Pride ran thick in their blood. Fear rarely touched them.\n\nDragons were the exception. Dragons ruled both hell and earth as supreme predators. Memphis feared nothing else.\n\n\"D-Dragons are scary! Nyang!\"\n\nNoe launched himself into Grid's arms, eyes squeezed shut. He buried his face against Grid's chest.\n\n\"Evil Master! You're throwing me at dragons as food! Nyang! You'll burn in hell when you die! Nyang!\"\n\nResentment dripped from every word. Grid stared in disbelief.\n\n*Hell's strongest demonic beast. Afraid of drakes?*\n\nDisappointment settled in his gut. Grid clicked his tongue and grabbed Noe by the scruff. The cat immediately thrashed.\n\n\"Save Noe! Save me! Nyang!\"\n\nNoe's belly protruded as he wailed. His stubby legs pumped frantically. Tears welled in his emerald eyes at the prospect of being fed to dragons. He looked pathetic.\n\nGrid remained unmoved.\n\n\"If you want to live, fly hard and dodge the drakes. You'll be safe once you reach the finish line.\"\n\nThis was hell's strongest demonic beast. Grid believed in Noe's potential. The creature was still a baby, but superior to any drake.\n\n\"Go!\"\n\nGrid hurled Noe toward the starting line.\n\n\"Evil bastard! Remove your hand! Nyang! Save Noe! Nyang!\"\n\nThe cameras caught every moment. The broadcast zoomed in on Grid's face and Noe's terrified struggles.\n\n『 Oh my. That cat is genuinely terrified. 』\n\n『 Amazing that a cat has wings. And he called it Slave? Is that the cat's name? 』\n\n『 This is disgraceful! Grid treats his pet as a slave, and now he's abusing it on the world stage! 』\n\n『 Virtual reality or not, animal abuse is unacceptable. The animal protection groups will riot. This footage will traumatize children. Parents should cover their eyes immediately. 』\n\nBoos erupted from the stands.\n\n\"Grid, you bastard! Leave the cat alone!\"\n\n\"Making such a cute cat compete, he's sick!\"\n\n\"We can't let our daughter watch a cat get eaten! Committee, remove Grid from the competition!\"\n\n\"Treating a small animal as a slave! What a demon!\"\n\n\"The poor frightened cat... How terrible...\"\n\nA child's voice rose above the din. \"Mother, will the drakes eat it?\"\n\n\"Don't look, sweetie!\"\n\nYoung children began to cry. In their eyes, Grid had become a monster. Confusion gripped the arena. Committee members debated whether to intervene.\n\nThe logged-in players remained oblivious to the chaos.\n\n**BANG!**\n\nThe commentator checked the time and fired a magic bullet. The pet marathon began.\n\nIn that instant, everything changed.\n\n\"...Nyang?\"\n\nNoe had mistaken drake scent for dragon scent. As Grid manhandled him, the starting shot cleared his head. His emerald eyes focused on the drakes properly for the first time.\n\n\"...You're not dragons, nyang?\"\n\nHis mind reasserted itself.\n\n\"These lizard bastards tricked me! Kyaak!\"\n\nFear evaporated. His status updated.\n\n---\n\n> **Status:** Angry  \n> *(What are these lizards? Nyang! I thought they were dragons, but they're food! Nyang! Daring to deceive a great demonic beast of hell! Nyang! I won't forgive them! Nyang nyang!)*\n\n---\n\nGreat Demon Hell Gao once compared pavranium's speed to a Memphis. The comparison was incomplete. Memphis were faster than pavranium. They were the fastest creatures in hell.\n\n\"Kyaak!\"\n\nThe marathon erupted into chaos. Noe's small mouth distended to impossible proportions. He swallowed a drake whole.\n\n\"W-What...?\"\n\nThe drake's owner froze in shock. Then an absurd notification appeared.\n\n---\n\n> [Your drake Johnson's movement speed has dropped by **50%**.]\n\n---\n\nGrid's vision flooded with alerts.\n\n---\n\n> [Your Memphis Noe's movement speed has increased by **50%**.]  \n>  \n> [**Soul Ingestion Lv. 1**]  \n> Has the ability to take away half of the target's highest stats and transfer it to your master.  \n> **Skill Cooldown Time:** Your own decision.\n\n---\n\nThe skill's master transfer effect activated for the first time."
}