{
  "id": 184,
  "title": "Chapter 184",
  "content": "# Chapter 184\n\nJohnson was a drake with the wind attribute. Faster movement speed than other drakes. The most advantageous breed for a pet marathon.\n\nHis master, Pesto, didn't doubt Johnson's victory. He believed his drake would cross the finish line first and deliver Italy's inaugural gold medal.\n\nThen it happened.\n\nPesto stared at Grid's pet. *Movement speed dropped by half?*\n\nThe weapon had been stripped from him so easily. He looked at the creature like it had crawled out of a nightmare.\n\n*What is that thing?*\n\nGrid's pet was a cat. Apart from the wings, it looked exactly like the cats Pesto knew. But that small, triangular mouth opened impossibly wide and swallowed a three-meter drake whole. The sight defied belief. It felt like a fever dream.\n\nThe other participants froze.\n\n\"What just happened?\"\n\n\"Grid's cat just... ate Pesto's drake.\"\n\n\"But the drake is fine?\"\n\nA nearby player shook his head. \"Don't be fooled. Look at Pesto's face. He's white as a sheet. Something absurd just went down.\"\n\n\"Well, it's Grid.\" Another shrugged. \"Of course he wouldn't carry around an ordinary cat.\"\n\nThe pet marathon began in earnest. Thirty-eight drakes, excluding Grid and Pesto's pets still frozen at the starting line, flapped their wings and launched into the air. The players exhaled in relief.\n\n*I don't know what happened, but that works for me.*\n\nJohnson had been a frontrunner. The exact details were unclear, but the drake's elimination was good news. They knew now that Grid's pet wasn't ordinary, but so what?\n\nThe other drakes were already five hundred meters ahead. Grid and Pesto's pets remained grounded. Both had dropped out. The players were certain.\n\n\"Keeeok.\"\n\nNoe burped, his stomach distended. Grid prodded him.\n\n\"Start moving.\"\n\nGrid had grown close to Huroi. He'd experienced Huroi's drake firsthand. The speed and stamina were admirable. Honestly, he was skeptical whether Noe could afford this leisurely attitude. Noe shot a mocking look at his anxious master. He placed his pink paw pads against Grid's waist.\n\n\"Is Master a coward, nyang? This is the best body in hell. The lizards can't defeat me, nyang! Don't rush me! Nyang!\"\n\nThe eastern side of Yurea Island rose into a mighty peak. Chingsu Mountain. The pets had to race to reach the summit.\n\nNoe declared with absolute confidence.\n\n\"I'm the fastest! Nyang!\"\n\nA notification window materialized.\n\n> [Your memphis **Noe's** movement speed has returned to normal.]\n\n\"...\"\n\nRight. The duration of 'Soul Ingestion' lasted only three seconds. Grid had confirmed the timing while clashing with Yoshimura during the Hell Gao raid.\n\nGrid's expression twisted.\n\n\"This stupid cat...\"\n\nPesto's face brightened.\n\n> [Your drake **Johnson's** movement speed has returned to normal.]\n\n*The effect is massive but the duration is pathetically short!*\n\nThe delighted Pesto commanded Johnson.\n\n\"Go forward! Eliminate everyone ahead.\"\n\nKyaooooh!\n\nJohnson responded by beating its wings with renewed vigor. It surged after the drakes ahead. Tremendous speed. This was a true wind drake. But Noe didn't fall behind.\n\n\"Nyaang!\"\n\nNoe latched onto Johnson's back and swallowed the drake again.\n\n> [Your drake **Johnson's** movement speed has dropped by **50%**.]\n\n\"What...?\"\n\nPesto reeled. That insane debuff skill had a short cooldown? This was a complete scam!\n\n\"Why are you only targeting my Johnson!\" Pesto's shout was furious.\n\nNoe had already caught up to the thirty-eight drakes.\n\n\"Predation! Nyang!\"\n\nJjeok!\n\nNoe's mouth gaped impossibly wide. He swallowed the three-meter drakes whole.\n\n> [Your memphis **Noe's** movement speed has increased by **30%**.]\n> [Your memphis **Noe's** health has increased by **250%**.]\n> [Your memphis **Noe's** defense has increased by **500%**.]\n> [Your memphis **Noe's** attack power has increased by **400%**.]\n\n\"What...?\"\n\nThe owners of Noe's victims stared in disbelief.\n\n> [Your drake **Thunder's** movement speed has decreased by **50%**.]\n> [Your drake **Ultima's** health has decreased by **50%**.]\n> [Your drake **Bugu's** defense has decreased by **50%**.]\n> [Your drake **Ole's** attack power has decreased by **50%**.]\n\nNonsense. The highest stats of their drakes had simply vanished.\n\nKyaack!\n\nThe drakes swallowed by Noe were paralyzed with terror. They instinctively recognized a predator from a higher tier and felt primal fear. The drakes scattered in confusion, falling behind. Noe accelerated past them at overwhelming speed.\n\nThe commentator's voice cracked. \"What is going on...?\"\n\nThe spectators and viewers grew frustrated. The expert panel leaned forward with interest.\n\n\"That isn't just a cat with wings and the ability to speak.\"\n\n\"It's a species capable of partial gigantification! Such creatures are exceedingly rare and valuable!\"\n\n\"The cat's power surges every time it devours a drake! The act of swallowing appears to steal the target's stats!\"\n\nAccurate analysis. They were experts for a reason. The spectators and viewers became aware of Noe's true nature.\n\n\"Cat-chan is incredible!\"\n\n\"A skill that steals the target's stats...!\"\n\n\"And the cooldown is short. Isn't this completely broken?\"\n\n\"Grid even has a legendary-grade pet!\"\n\nAdmiration rippled across the world. Zibal, participating in the pet marathon, ground his teeth.\n\n\"Grid, that bastard...!\"\n\nThe United States were supposed to be the definite winners. Experts had predicted at least five gold medals for the US in this National Competition. The result? Three gold medals. No one had predicted South Korea would claim two.\n\nNow, at this very moment, another gold medal was slipping away. South Korea would match their count. The difference in silver and bronze medals meant the US would technically remain first, but their pride was shattered. Victory felt hollow.\n\nSouth Korea, the candidate for worst-performing country, had stripped them of three gold medals. All because of Grid. The US, with its overwhelming power, was suffering because of one man.\n\n\"This is disgraceful...! My pride won't tolerate this!\"\n\nSix American players were participating in the pet marathon. As the country with the strongest power, they fielded the most drake users. Zibal barked orders.\n\n\"Kill that cat!\"\n\nKuooooh!\n\nThe breath attack barrage began. The drakes vomited fire, ice, poison, and light at Noe. At level one, the assault was genuinely burdensome.\n\n> [Your memphis **Noe** has suffered **2,430** damage.]\n\nAfter three seconds, the buffs expired. All stats returned to normal. The bombardment cut Noe's health nearly in half.\n\n\"Noe...!\"\n\nGrid's concern lasted only a moment. Noe was the number one demonic beast of hell. He had no rival except dragons. Despite his youth, drakes were completely inferior.\n\n\"I am angry! Nyang!\"\n\nNoe, who had surged ahead, whirled around. He grinned at the six US team drakes flying toward him.\n\n\"Kyaak!\"\n\nNoe's fur bristled.\n\nThe drakes flinched. They sensed the threat and halted. But only for a heartbeat.\n\n\"Attack!\"\n\nThe drakes rallied at their masters' commands. They fired breaths at Noe or lashed with their tails. Noe's true counteroffensive began. He used simple movements to evade the breath attacks and Fluidization to neutralize the tail strikes. Then he opened his mouth and devoured the stats of all six drakes.\n\nKyaooooh!\n\nThe drakes panicked. Noe closed the distance and swiped randomly at one drake.\n\n> **[Scratch Lv. 1]**\n> Your paws will attack and poison the target.\n> Skill Cooldown Time: Whenever you like.\n\n> [Your drake **Captain America** has suffered **2,900** damage.]\n> [It has become poisoned and is in a petrified state for **3 seconds**.]\n\n\"Heok...!\"\n\nCaptain America was Zibal's drake. Level one hundred fifty. That tiny cat's scratch inflicted three seconds of petrification? The health damage was manageable, but the status condition was devastating.\n\nThe same fate befell the other drakes. Struck by petrification, they hung in the air like stone statues. Then gravity reclaimed them.\n\nKwaang!\n\nThe US team's drakes shook from the impact. The one with the lowest level dissolved into grey light. Noe's level skyrocketed.\n\n> [Your memphis **Noe's** level has risen.]\n> [Your memphis **Noe's** level has risen.]\n> [Your memphis **Noe's** level has risen.]\n> [Your memphis **Noe's** level has...]\n\nNoe gained twenty-six levels in an instant.\n\n\"This body is the best demonic beast of hell! Nyang!\"\n\nDozens of cameras converged on his roar. Hundreds of millions of viewers sat stunned.\n\n\"Best demonic beast of hell?\"\n\n\"That cat is a demonic beast from hell?\"\n\n\"Wow... I've never even seen a demonic beast before.\"\n\nThe expert panel vibrated with excitement.\n\n\"Hell is an unknown territory with virtually no information! Occasionally, demonic beasts and demonkin emerge as boss monsters, but...!\"\n\n\"He tamed a demonic beast! Grid is truly extraordinary!\"\n\n\"Kuk...! He is God Grid!\"\n\n\"I would very much like to analyze that cat claiming to be the best demonic beast of hell. I would be grateful if God Grid cooperates after this tournament.\"\n\nZibal stared at Grid.\n\n\"Demonic beast of hell? Best demonic beast of hell? What the hell are you? You've already been to hell?\"\n\nGrid seemed to exist on an entirely different plane. He'd tamed a beast from uncharted territory? Intimidating. In that moment, Zibal and the other drake owners, who had claimed mastery over the finest pets, felt ashamed.\n\nThe truth was different.\n\n*I've never been to hell.*\n\nGrid didn't even know where hell was located. It was a place he never wanted to visit.\n\nGrid shouted, \"Go! Noe!\"\n\nOne kilometer remained to the finish line. After overpowering the US team's drakes, Noe showed no signs of defeat. Then very good prey approached.\n\nJohnson.\n\n\"Hahahaha! This is my chance! Win while that monster cat is distracted, Johnson!\" Pesto laughed.\n\nThe drake blazed past the US team's drakes and Noe. The drake Noe had eaten twice surged into the lead. It became prime food for Noe.\n\n\"Nyang!\"\n\nHe ignored the already-defeated US drakes and swallowed Johnson.\n\n> [Your memphis **Noe's** movement speed has increased by **50%**.]\n> [Your drake **Johnson's** movement speed has dropped by **50%**.]\n\n\"Kek.\"\n\nPesto bit his tongue in shock. Wronged didn't begin to describe it.\n\n*Does this skill have no cooldown?*\n\nAbsurd. Was this truly the best demonic beast of hell?\n\nIn the end, Noe arrived first at the destination. He stood atop the mountain and waved his short legs.\n\n\"I am the best demonic beast of hell! Nyang! Master's Noe! Nyang!\"\n\n\"...\"\n\nA cat pretending to be Grid's slave. People began to feel pity for it. Grid, who enslaved a demonic beast, seemed like the devil himself.\n\n\"Grid has won!\"\n\nGrid was a formidable figure. He'd won gold in all three of his events. In this pet marathon, the US team couldn't even secure bronze. The overall ranking was determined: US in first place, South Korea in second, France in third.\n\n\"Waaaaaaaah!\"\n\nThe Koreans erupted at the unbelievable result. The French, who'd aimed for third from the start, were satisfied. But the Americans wore expressions like spoiled fruit. First place was 'obviously' supposed to be theirs. They had overwhelming power.\n\nThe United States, originally supposed to dominate by a massive margin, barely managed to win because of one Grid. Zibal was bombarded by the media. He was accused of incompetence as team leader.\n\nGrid emerged as South Korea's hero.\n\nThe South Korean government awarded him a massive three hundred million won per gold medal. CF requests poured in. He was flooded with offers from talk shows and entertainment programs.\n\nIt was time to hire a manager.\n\n\"God Grid! God Grid! God Grid!\"\n\nGeumcheon-gu, XX Neighborhood, 000-0 Street.\n\nYoungwoo panicked as he returned home. A massive crowd had appeared in his neighborhood, welcoming him warmly. At the entrance, a banner proclaimed: 'South Korea's Hero, God Grid!'\n\nThe moment when Youngwoo's image as an unemployed youth freeloading off his parents completely transformed. The children, teenagers, and adults of the neighborhood all treated him differently.\n\nYura proved invaluable during this time.\n\nShe knew Youngwoo wanted to build a property. Using her intelligence network, she recommended purchasing land where prices remained low but would surge in the future.\n\nAfter earning nine hundred ninety million won and finally scraping together his target of ten billion won, Youngwoo immediately bought the land. He started construction on a seven-story building with a company Yura recommended.\n\nThen Jishuka declared.\n\n\"I will build next to Grid's building. I wanted to stay close to Grid anyway.\"\n\n\"I was thinking the same thing.\" Regas nodded. \"I want to dedicate myself to Taekwondo, except when playing Satisfy.\"\n\n\"I like Korean women...\" Pon added.\n\nJishuka, Regas, and Pon planned to relocate to South Korea. Most of the Tzedakah Guild had made fortunes from illegal gambling and followed suit. It seemed fun. Yura belatedly heard the news and also began construction on a building adjacent to Youngwoo's. Jishuka became alert.\n\nAfter that.\n\nThanks to Youngwoo, Yura, and the Tzedakah Guild, a certain underdeveloped satellite city near Seoul transformed into a luxury building complex.\n\nYoungwoo panicked. He was informed of income-related health insurance premiums, pension insurance premiums, income tax, land tax, and building tax. Grid had to pay fees to the item trading site when converting Satisfy's gold to cash. He shed tears of blood when the tax bomb detonated.\n\nFor a while, he operated at a deficit.\n\nStress mounted. He suffered hair loss until Yura recommended a talented tax consultant.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}