{
  "id": 185,
  "title": "Chapter 185",
  "content": "# Chapter 185\n\nYubadakan ranked among the most prosperous cities in the Harken Kingdom. Seventy thousand residents called it home, drawn by aggressive capital investment and shrewd governance. High-level hunting grounds ringed the city walls, pulling in a constant tide of adventurers. The markets never emptied. Gold flowed like water.\n\nThe lord who collected over 1.5 million gold each month from this economic engine wasn't some NPC noble. It was Zibal.\n\n\"Kukukul! You looked down on Grid. How's that working out for you?\"\n\nInside Yubadakan Castle, Asuka leaned back in her chair. The 12th executive of the Snake Guild wore a savage grin.\n\n\"You laughed when Black Teddy and I got demolished. But you?\" She slapped the table. \"Watching that cat beat down your drake was the most fun I've had in months!\"\n\nThe memory still burned. Right after the Pope Drevigo raid, when she'd been part of the Tzedakah Guild, she'd fought Grid alongside Black Teddy, Box, and Toban. They'd been slaughtered. Zibal had mocked her for weeks.\n\nBut now? Grid had proven himself impossible to ignore. Zibal had felt that same sting of defeat. The reversal tasted sweet.\n\n*Ten years of stress, gone.* Asuka couldn't stop smiling.\n\n\"How does it feel? Getting crushed by someone you dismissed as trash?\"\n\nBox shifted in his seat. \"Asuka, maybe dial it back a little—\"\n\n\"I'm sorry.\"\n\nThe words cut through the tension. Zibal bowed his head to Asuka. The thirteen executives watched in silence.\n\n\"I underestimated Grid. Making fun of you was wrong. I apologize.\"\n\nAsuka wasn't petty. Seeing Zibal acknowledge his mistake in front of the entire leadership council satisfied her completely.\n\n\"Well, fine. I'll be generous and forgive your ignorance.\"\n\n\"Thank you.\"\n\nThe atmosphere settled. The executives, however, remained grim-faced.\n\nOne of them cleared his throat. \"Master, public opinion has turned toxic since the National Competition.\"\n\n\"You're the face of the Snake Guild,\" another added. \"Your reputation affects all of us. Focus on damage control.\"\n\nA third executive shook his head. \"No. Get your third advancement class first. The gap between you and Kraugel and Grid is widening.\"\n\n\"I heard Hurent and Lauel both declined our offers?\" A woman tapped her fingers on the armrest. \"Finding replacements is critical.\"\n\n\"What about Katz?\" someone suggested. \"He's been training obsessively since Bondre beat him. He's probably grown.\"\n\n\"The guild's morale is shot after seeing the Tzedakah Guild's strength. The members look to you, Master, not to us executives.\"\n\nThe debate continued. Each executive offered their vision for Zibal's path forward, their ideas for strengthening the guild. Zibal stared at the table, barely listening.\n\n*Grid.*\n\nYesterday's National Competition had been supposed to be Zibal's stage. Millions of eyes watching worldwide. He would shine. The Snake Guild would explode in prestige and recruitment.\n\nGrid had stolen all of it.\n\nThe most brilliant performer wasn't Zibal. It was Grid. Everyone talked about the Tzedakah Guild now, not the Snake Guild. Their rivals would grow at an exponential rate.\n\n*The number of users migrating to Bairan is already out of control.*\n\nSome of them were talents he'd been courting. Like Lauel.\n\n*This can't continue.*\n\nHis plan had always been clear. Dominate the Harken Kingdom as a foundation. Money, talent, military might. Use wealth to recruit the best, then leverage their strength to conquer territory. Simple.\n\nThe National Competition had taught him something crucial, though. Money wasn't enough.\n\nThe reason was obvious.\n\n*Items.*\n\nGrid's black greatsword and blue greatsword, slicing through top rankers like they were made of paper. The knuckles that let Regas demolish Chris. Pon's red spear that had nearly killed Regas outright.\n\nThe sheer power of those four weapons haunted him. He wanted them. Every user who'd watched the competition felt that same gnawing desire. Lauel had gone to Grid after seeing those items. At this rate, Grid would monopolize all the talent on the continent.\n\nOne executive's comment snapped Zibal back to attention.\n\n\"Should we contact Panmir?\"\n\nPanmir. The 1st ranked blacksmith. Before Grid's emergence, every major guild had pursued him relentlessly. Pagma's Descendant had overshadowed him completely.\n\n\"I've located him. He's in the city of dwarves.\"\n\n\"Dwarves?\"\n\nDwarves were born blacksmiths. Their entire species produced craftsmen of extraordinary skill. They were also insufferably arrogant, treating human smiths like incompetent children. How could Panmir be staying in their city?\n\nThe executives exchanged glances.\n\n\"He must have earned their recognition. He might be doing a hidden class change quest.\"\n\n\"Interesting.\"\n\nA handful of dwarves could grant life to items. The species as a whole excelled at gunpowder engineering. Pagma might be the superior all-around blacksmith, but dwarves surpassed him in specialized fields. If Panmir inherited dwarven techniques...\n\n*He'd be Grid's only real rival.*\n\nThey had to recruit him. Zibal stood abruptly.\n\n\"I'll go meet Panmir personally.\"\n\nThe outcome proved successful. Zibal secured Panmir's allegiance, and the Snake Guild's explosive growth began.\n\n---\n\nThe Yatan Church's Third Temple stood amid the ruins of the Bonkost Principality. Inside, the Yatan Servants gathered in their black robes. Yura stood among them.\n\n\"The successor to Priest Malacus has been chosen.\"\n\nSince the Tzedakah Guild and Grid had killed Malacus, the church's rituals had stalled. Their power had waned. Now a new priest took the vacant seat.\n\n*Level 420?*\n\nYura studied the replacement with barely concealed shock. The new priest's level exceeded Malacus by a hundred.\n\n*A fourth advancement NPC.*\n\nThe same tier as the Second Servant and Third Servant. Neberius's eventual replacement would probably match this level. The question that gnawed at her was simple.\n\n*How strong is the First Servant?*\n\nShe'd never met them. Grid needed God Yatan's blessing for his quest, but she still hadn't figured out how to help. The Second Servant, Likaos, stepped forward.\n\n\"Eighth Servant.\" His voice echoed in the stone hall. \"You are too weak to display God Yatan's grandeur. Embark on the Path of Penance and grow stronger.\"\n\n> [The quest 'Path of Penance' has been created.]\n\n> **[Path of Penance]**  \n> Difficulty: SS  \n> Meet the First Servant unharmed.  \n> Quest Clear Conditions: ??  \n> Quest Failure: ??\n\nThe description was pathetically sparse for an SS-difficulty quest. Yura felt a headache building.\n\n*This is going to be brutal.*\n\nStill, she'd finally qualified to meet the First Servant. Tension and anticipation coiled in her chest.\n\n\"For the sake of God Yatan,\" she murmured.\n\nBy Satisfy's worldview, she was unquestionably evil.\n\n---\n\n\"Thanks for your hard work.\"\n\nAt S Broadcasting Station in Ilsan, Youngwoo stood the moment the talk show wrapped. The main host, PDs, and staff members swarmed him with smiles and handshakes.\n\n\"You did an amazing job.\"\n\n\"The broadcast turned out great because of you.\"\n\nOne PD grabbed his hand. \"I'll see you next time. Let me buy you dinner.\"\n\nAnother grinned. \"Are you logging into Satisfy the second you get home? Please reveal your level!\"\n\nSatisfy had revolutionized the world. The first true virtual reality game, surpassing all existing technology by decades. Over two billion users. It had woven itself into the fabric of the global economy. Its influence touched every industry, every country.\n\nKoreans felt immense pride that this masterpiece had been created in South Korea.\n\nBut there was a problem.\n\nSouth Korea had been a gaming powerhouse in the past, but those days were long gone. Satisfy was Korean-made, but most Korean players struggled to compete. American, French, Canadian, and Chinese users dominated the content. South Korea had Yura and Peak Sword, but two stars weren't enough.\n\nThe Korean public felt that absence like a wound. Why were they weak in their own game? The game the whole world played? It stung.\n\nThen, one month ago, everything changed.\n\nShin Youngwoo entered the National Competition as a Korean representative. He won three gold medals. His dominance was absolute, overwhelming.\n\nHe quenched Korea's thirst in a single stroke.\n\nYoungwoo became a national hero overnight. Every Korean loved him. His popularity exceeded Park Jisung and Kim Yuna at their peaks. He rivaled Yura herself.\n\nAny broadcast featuring Youngwoo guaranteed high ratings. Products he endorsed flew off shelves. He'd become the blue chip of the advertising industry.\n\nBroadcasters and advertisers fought over him.\n\nBut Youngwoo was busy. He needed at least fourteen hours a day in Satisfy.\n\n*Broadcasts are exhausting.*\n\nTo make real money in Satisfy, Youngwoo needed to craft level 200 items with at least a <span class=\"rarity-unique\">Unique</span> rating. But he couldn't produce <span class=\"rarity-unique\">Unique</span> items on command. Sometimes he'd spend an entire week and get a single <span class=\"rarity-epic\">Epic</span> item to show for it.\n\nMeanwhile, one broadcast paid tens of millions of won. One CF commercial paid hundreds of millions.\n\nYet Youngwoo hated broadcasts and advertising. At first, appearing on TV had been exciting. That novelty had worn off fast.\n\nBroadcasts were difficult because he was plain and terrible at improvisation. CFs required shooting the same scene dozens of times, exposing his lack of acting talent and poor concentration.\n\nHe'd started losing hair from the stress. Playing Satisfy was infinitely preferable.\n\n*It's like chewing on pine needles.*\n\nTime spent in Satisfy was more profitable than time on broadcasts anyway. Even <span class=\"rarity-rare\">Rare</span> and <span class=\"rarity-epic\">Epic</span> items generated steady income.\n\n*Plus my production skills improve.*\n\nHigher production skill levels meant better items. Youngwoo had decided to quit broadcasting and focus on Satisfy. Yura's advice had helped solidify that choice.\n\n*Minimize image consumption.*\n\nShe'd warned that overexposure would dilute his influence. Youngwoo agreed. From now on, he'd only do broadcasts and CFs when absolutely necessary.\n\n\"I hope we can work together again soon,\" the PD said.\n\nYoungwoo gave a noncommittal shrug. \"If I have time.\"\n\nHe left the eager PD behind and walked briskly to the parking lot. Sliding into 23, he checked the rearview mirror.\n\n\"Phew. It's getting better, right?\"\n\nThe past month had been hell. He'd barely slept, working frantically to handle the tax bomb. Fourteen hours a day in Satisfy making items, six hours doing broadcasts or advertisements. Four hours of sleep if he was lucky.\n\nThe stress-induced hair loss had accelerated to the point where he'd feared going full bald like some cursed Japanese yokai. But he'd been taking medication religiously, and Yura had connected him with a good tax accountant. The situation was improving. Hair had started growing back on the bare patches.\n\n\"Alright. Soon I'll be completely fine.\"\n\n*Buaang!*\n\nThe engine roared, as if 23 sensed its master's improved mood. The car pulled out of the lot.\n\nDestination: home.\n\nThree months until his new building was completed. Until then, Youngwoo's family remained in their original house."
}