{
  "id": 187,
  "title": "Chapter 187",
  "content": "# Chapter 187\n\n\"The time for revenge has come.\" Shay clenched his fist, eyes burning with barely contained fury.\n\nThe assassins—Shay, Kerb, and Sniffer—had failed to hunt Grid when his identity was still unknown. Worse, they'd lost valuable items in the attempt. The memory festered like an open wound. Every time they calculated the value of those dropped items, rage bubbled up fresh and hot.\n\nSniffer spat on the ground. \"We assassinate him. Make him drop everything he owns.\"\n\nAfter leaving Rolling, the trio had finally arrived in Winston. Their eyes gleamed with avarice as they recalled the staggering array of items Grid had displayed during the National Competition. The blue greatsword. Those golden blades. If the assassination succeeded, the payout would be legendary.\n\n*Our Stealth is Level 6 now.*\n\nKerb's jaw tightened. *If we can get close, the kill is guaranteed.*\n\nTheir rankings had climbed since their last encounter. Shay now held 3rd place among assassins, Kerb 7th, and Sniffer 9th. More importantly, they'd secured a trump card: a third advancement assassin NPC. The S-grade quest for the Assassins Association had been brutal, but the reward was worth it. For an exorbitant fee, they could now hire the continent's finest blade.\n\n*With him on our side, Grid is already dead.*\n\nAt least, that's what they believed.\n\n***\n\n> **Class:** Duplicator  \n> * The target's skill can be perfectly replicated.\n\n> **Title:** A Qualified Hero  \n> * You won't get tired easily.  \n> * Your stats will grow faster.\n\n> **Title:** Competitor  \n> * Interacts with high luck.  \n> * Skill 'Rolling Dice' can be used.\n\n> **Title:** Friend of the Water Clan  \n> * It is possible to breathe in water for a long time.  \n> * Movement speed in water doesn't decrease.  \n> * Have a high affinity with the Water Clan.\n\n> **Title:** One who Receives Sunlight  \n> * Health +2,000. Mana +2,000.  \n> * Under sunlight, all skills will increase by 7%.  \n> * Under sunlight, the power of fire skills will increase by 16%.\n\n> **[Skill Observation Lv.8 (51.3%)]**  \n> You can observe the skill used by the target and analyze the information thoroughly.  \n> The analysis of the skill can be saved for only 3 minutes.  \n> Skill Mana Cost: 300  \n> Skill Cooldown Time: None.\n\n> **[Skill Duplication]**  \n> Successfully duplicate the observed skill.  \n> The duplicated skill will be permanently stored in your skills list until it is used. It will be deleted when used once.  \n> Skill Mana Cost: 1,050  \n> Skill Cooldown Time: 8 hours.\n\n> **[Rolling Dice]**  \n> Roll a dice and a phenomenon will occur, depending on the number that is rolled.  \n> * If the target is yourself or an ally: There will be a beneficial effect if the number 4 or higher is rolled. There will be a harmful effect if the number rolled is 3 or lower.  \n> * If the target is an enemy: There will be a beneficial effect if the number 3 or lower is rolled. There will be a harmful effect if the number rolled is 4 or higher.  \n> Skill Mana Cost: 30  \n> Skill Cooldown Time: 20 minutes.\n\nEuphemina. The first Epic hidden class. The woman who had defeated Faker, the 1st ranked assassin. If she invested a few days into duplicating the right skills, she could dismantle armies.\n\nShe moved through Winston's streets with quiet confidence, taking in the changes. \"The new lord really transformed this place.\"\n\nHalf a year had passed in reality since she'd last visited Winston for that item production game with Grid. The city barely resembled its former self.\n\n*It's night and day compared to when that corrupt bastard ruled.*\n\nEven six months ago, Winston had been large and economically developed. But the residents had walked with hunched shoulders and hollow eyes. The lord had been a parasite, bleeding the people dry for his own profit.\n\nNow? Energy pulsed through every street. New facilities dotted the districts. Children laughed. Merchants haggled with genuine smiles. The new ruler had earned his position.\n\n*Now... where was Khan's smithy again?*\n\nEuphemina paused at a bustling intersection, trying to orient herself. The city's transformation was so complete that her old mental map was useless. She wandered for quite a while, asking for directions twice, before finally locating her destination.\n\nWhat she found stopped her in her tracks.\n\n\"Show me a Level 150 longsword!\"\n\n\"These are all the helmets you have?\"\n\n\"This plate armor is incredible! How much?\"\n\n\"Look at the weight distribution on this greatsword... Masterwork.\"\n\n*What the hell?*\n\nThe smithy wasn't just busy. A queue of customers stretched at least 100 meters down the street. The National Competition had changed everything. Once Grid revealed his identity, pilgrims had descended on Khan's smithy in droves.\n\nThey came seeking Grid's work, but Khan's own craftsmanship captivated them. It was inevitable. Thanks to Grid's **Blacksmith's Affection** skill, Khan's proficiency had skyrocketed five levels to Advanced Level 7.\n\nNo blacksmith on the entire continent could match that. Word spread. Now visitors from foreign kingdoms arrived daily, gold pouches heavy.\n\n\"There's no end to it.\" Khan wiped sweat from his brow.\n\nHe'd hired four assistants, but the smithy ran nonstop. The revenue was astronomical, and he dutifully set aside Grid's share. But his stamina wasn't what it used to be. His bones ached.\n\n\"One more commission and I'll...\" His complaint died as a familiar face emerged from the crowd. His eyes lit up. \"Euphemina! Is that you? It's been far too long!\"\n\nKhan held deep affection for the woman. She'd helped rescue Grid from that cell after the production game debacle.\n\nEuphemina smiled warmly. \"Khan. You look younger than I remember.\"\n\n\"Hahaha! Grid made me quit drinking. Best decision of my life.\" Khan's grin widened. \"You're more radiant than ever. Have you been well?\"\n\n\"Don't flatter me, old man.\" Euphemina's tone held fondness. \"I've been traveling the continent. Searching for the ultimate orb production method.\"\n\n\"And did you find it?\"\n\n\"Of course.\"\n\nKhan leaned forward eagerly as Euphemina produced an ancient scroll from her inventory. His eyes went wide.\n\n\"This is... truly a supreme orb. Even labeled 'best' in the description.\"\n\nThe specifications were staggering. Khan couldn't produce it with his current skill. He doubted even his grandfather, that legendary craftsman, could have managed it.\n\n*But Grid...*\n\n\"You're an incredibly determined woman,\" Khan breathed.\n\nEuphemina tucked the scroll away. \"So where's Grid? Working in the back?\"\n\nKhan shook his head slowly. \"He's not here. If he showed his face in public now, there'd be a riot. He hasn't visited in days.\"\n\n\"Right.\" Euphemina laughed. \"Celebrity status has its drawbacks. Where can I find him, then?\"\n\n\"Um...\"\n\nKhan hesitated. Even for Euphemina, revealing Grid's whereabouts felt wrong.\n\n*Grid doesn't exactly... like her.*\n\nEuphemina read the reluctance on his face. \"It's fine. I understand if there's a complication.\"\n\nShe'd hoped to surprise Grid with an unannounced visit. Now she had no choice but to send a whisper.\n\n*Grid.*\n\nThe message reached him instantly.\n\nAt that exact moment, in Winston Castle's council chamber, Grid went rigid.\n\n\"Gah!\" He jerked in his seat.\n\nHuroi jumped to his feet, hand flying to his sword hilt. \"My Lord! What's wrong?\"\n\n*An assassin? Poison?*\n\n\"What is it?\" Lauel's chair scraped backward.\n\nHe'd never seen Grid like this. The man who faced armies with a smirk now sat pale and sweating. Like prey that just spotted a predator.\n\n*What in the world could shake him this badly?*\n\nLauel's throat bobbed as he swallowed hard. *What disaster is coming?*\n\nGrid's voice came out strangled. \"Euphemina... sent me a whisper. She's in Winston.\"\n\n\"Euphemina?\"\n\nLauel didn't recognize the name. Huroi, however, perked up immediately.\n\n\"She's here? That's wonderful! It's been so long.\"\n\nFrom Huroi's perspective, Euphemina was a hero. She'd rescued Grid from that cell, which in turn allowed Grid to save him from the dungeon.\n\n\"I'd love to meet her again. We should...\" Huroi trailed off, finally noticing Grid's expression. \"Um. Isn't Euphemina an excellent candidate for recruitment? Someone with her skills would be invaluable.\"\n\nGrid said nothing.\n\n*The relationship isn't what I assumed,* Huroi realized.\n\n\"Who is Euphemina?\" Lauel asked carefully.\n\nGrid's answer was blunt. \"A terrifying person.\"\n\nDuplicator. Euphemina could copy legendary spells and unleash them without chanting. Grid didn't know the drawbacks, so from his perspective, she was absurdly overpowered.\n\n\"She has one of the three Epic classes.\" Grid rubbed his face. \"I promised to craft her an item. If I produce anything below Unique rating, she'll probably kill me.\"\n\n\"...!\"\n\nOnly two Epic classes were publicly known: Agnus and Katz. The first had remained completely anonymous. And now Grid revealed he not only knew this mystery player, but owed them a favor.\n\n*He's connected to everyone,* Lauel thought with growing excitement. *If we could recruit an Epic class...*\n\nGrid cut through his strategizing. \"Huroi. Go to Khan's smithy and escort Euphemina to the castle.\"\n\n\"Yes, My Lord.\"\n\nHuroi bowed and departed.\n\n***\n\nWinston's streets bustled with afternoon commerce. Huroi moved with purpose, unaware of the shadows trailing him.\n\n\"That's Grid's right hand man, according to our intel,\" Shay murmured.\n\n\"Ranked 900th overall,\" Kerb added.\n\n\"An Orator?\" Sniffer scoffed. \"What kind of combat class is that?\"\n\n\"Our source says he practically worships Grid. Probably weak as hell given that class.\"\n\n\"Let's kill him. Grid will lose his mind when his lapdog dies. I want to see him rage.\"\n\n\"Agreed. Let's do it.\"\n\nThe assassins had done their homework. They watched Huroi enter a deserted alley and grinned.\n\nThree figures materialized from the shadows, blocking Huroi's path.\n\nHuroi stopped calmly. \"Can I help you?\"\n\nSniffer's smile was all teeth. \"We're here to kill you.\"\n\nShay spread his hands in mock apology. \"Consider us villains. Or something.\"\n\n\"Villains?\"\n\nHuroi's expression darkened. After Grid's performance at the National Competition, this was Huroi's first major public appearance. And these fools wanted to make a statement.\n\nHis voice dropped to a frigid register. \"You dare threaten someone under My Lord's protection? Your mothers must weep with shame at the monsters they birthed.\"\n\n\"What...?\"\n\nWhy was he insulting their parents? What kind of psychological warfare was this?\n\nThen a notification flashed before Shay's eyes.\n\n> [You have been overwhelmed by Spiteful Tongue. Defense and attack power will decrease by 30%.]\n\nIn that moment of confusion, Huroi drew his sword. The blade gleamed—a compact version of Dainsleif, elegant and deadly.\n\nHis eyes held no mercy.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}