{
  "id": 188,
  "title": "Chapter 188",
  "content": "# Chapter 188\n\nIf Pagma's Descendant was a class built on items, Orators specialized in words as weapons.\n\nThey squeezed favorable quest terms from NPCs through persuasion. They buffed allies and debuffed enemies with specific phrases. Nobles and lords valued them above almost any other profession. A skilled Orator could ignite an army's morale through eloquence alone, or sway public opinion with a single speech.\n\nYet users avoided the class like plague.\n\nThe reason was simple. Orators were hell to level.\n\nTheir weapon was a *book*. Not a staff. Not an orb. A book. It had narrative power bonuses, sure, but no magic amplification. No spell storage. You had to charge at enemies and swing paper at their faces. The attack power was pathetic. A blacksmith's hammer hit harder.\n\nThey had one attack skill. **Spiteful Tongue**. Eighty-second cooldown. Single target. Two hundred percent damage. That was it.\n\nNo defense skills. No escape skills. Lower health than a mage.\n\nSolo hunting? Impossible. Party hunting? Good luck finding a party. Who wanted dead weight that never stopped talking? Who wanted to babysit a glass cannon that dealt no damage? Clerics, Black Magicians, Dancers, Linkers—they all provided buffs without the liability. Why bring an Orator?\n\nLeveling through hunting was a non-starter. They couldn't craft like production classes. Quests were their only path forward, grinding reputation and favors one conversation at a time.\n\nThe hardest class in Satisfy. Bar none.\n\nMost users wouldn't touch it with a ten-foot pole.\n\nNobles and lords across the continent would pay fortunes for a skilled Orator. Didn't matter. The class was cancer.\n\nGrid was lucky beyond measure to have the first-ranked Orator as his subordinate.\n\nLauel watched Grid send Huroi on yet another errand. *Does Grid even understand what he has?*\n\n***\n\nThe outskirts of Winston.\n\n\"Sword?\"\n\nShay's party stared at Huroi. The debuff crushing their stats was bad enough. Now the Orator held a blade?\n\nWorse—it resembled the greatsword Grid had used to butcher them before. The memory clawed up Shay's spine.\n\n*It can't be. No way.*\n\nShay forced a smile. \"An Orator with a sword? Still an easy threat, right? You're bluffing. You can't even use that thing. Right?\"\n\nHuroi ranked 937th on the unified rankings. Close to Shay's own position. High enough to match Kerb and Sniffer. Yet Shay felt confident facing him.\n\nBecause Huroi was an *Orator*.\n\nThe weakest class. His level was high, sure, but that came from Grid's gear and party carries. Huroi himself was fragile. A liability.\n\nSo why the sword?\n\nUnease crawled through Shay's gut. *I can't read him.*\n\nHuroi looked at the three assassins. \"Originally, I was helpless.\"\n\nHis voice was quiet. Controlled.\n\n\"I leveled through small quests. Errands. Delivery jobs. Then one day, I received the first S-grade quest of my life.\"\n\nShay blinked.\n\n\"Trapped in a dungeon for fifty real-time hours. Two hundred in-game. I couldn't log out. Couldn't escape. Just darkness and silence and the crushing weight of time.\"\n\nHuroi's knuckles whitened on the sword hilt.\n\n\"I wanted to quit. Every second, I wanted to give up. But I endured. I waited for a savior who might never come. The quest kept going. And going. I went half-insane. Lost track of time. Lost track of myself.\"\n\nHis eyes refocused.\n\n\"Then, just before the time limit ended, light pierced the darkness.\"\n\nGrid's face flashed in Huroi's memory.\n\n\"My Lord saved me. My wait wasn't in vain. I completed the quest.\"\n\nSomething shifted in Huroi's stance.\n\n\"I received new strength.\"\n\n> **[Second Class: Apostle of Justice's Partner]**\n> \n> * Possesses matchless bravery.\n> * When accompanying the Apostle of Justice, all stats increase by 20%.\n> * Skills **'Unbreakable Justice'** and **'Sacrifice for Justice'** unlocked.\n\n> **[Title Acquired: One who Overcomes Hardships]**\n> \n> * Holds extremely high mental fortitude.\n> * Refuses to yield to any trial.\n> * Skill **'Strong Will'** unlocked.\n\n\"Master gave me new strength.\"\n\nThe sword gleamed in his hand.\n\n\"Now I'm strong. I exist only for my lord.\"\n\nHis voice rose.\n\n\"I won't allow *anyone* to harm him!\"\n\nShay's party felt something stir in their chests.\n\n*That's... actually touching.*\n\n*Grid saved him?*\n\n*My heart feels heavy.*\n\nThis was an Orator's true power. Huroi's story wrapped around them like chains. They couldn't help but listen. Couldn't help but imagine themselves in that dark dungeon. Couldn't help but feel the relief when Grid appeared.\n\nThey felt *admiration* for Grid.\n\nTheir enemy.\n\nThat was the problem.\n\n> [You have become fascinated by the story.]\n> \n> [You feel like the protagonist of the narrative.]\n> \n> [Reality has blurred. You cannot assess your situation.]\n> \n> [**Confused** for 3 seconds.]\n\n\"What—?\"\n\nAn Orator's weapon was their mouth. Giving an Orator time to speak was suicide.\n\n\"What is this fraudulent skill?!\"\n\nShay's group had never fought an Orator before. The confusion locked their bodies.\n\nHuroi's eyes blazed. \"You dare try to kill me? **Come!**\"\n\n> [Morale increased.]\n> \n> [Next attack will be a **Critical Hit**.]\n\nThe Orator's highest-tier buff. Two seconds. All allies.\n\nHuroi swung the black sword.\n\n\"**Unbreakable Justice!**\"\n\n> **[Unbreakable Justice Lv. 5]** *(88.1%)*\n> \n> Deals **650%** of attack power.\n> \n> **Mana Cost:** 500  \n> **Cooldown:** 100 seconds\n\nUnbreakable Justice was unique to the Apostle of Justice and his Partner. Wide-area damage. Short cooldown relative to power.\n\nGrid rarely used it anymore. Pagma's Swordsmanship outclassed it in every way except activation speed. Mana efficiency favored the legendary skills.\n\nBut for Huroi, Unbreakable Justice was everything. His main skill. He'd ground the proficiency to Level 5 through endless practice.\n\nSix hundred fifty percent wide-area damage.\n\nThe black sword in his grip amplified it further.\n\n> **[<span class=\"rarity-unique\">Mass-produced One-handed Sword (Prototype)</span>]**\n> \n> **Rating:** Unique  \n> **Durability:** 49/51  \n> **Attack Power:** 423  \n> **Attack Speed:** -7%  \n> **Accuracy:** -2%\n> \n> A trial work by the legendary blacksmith **G**.\n> \n> A one-handed sword designed for ease of use while maintaining high attack power. The aggressive design references **Dainsleif (Reproduction)** and succeeds in manifesting exceptional damage. However, the emphasis on convenience sacrifices overall perfection. Durability is weak.\n> \n> If steel had been used instead of black iron, this work's limitations would render it a consumable item.\n> \n> **User Restriction:** Level 230+, 300 Strength, Beginner Sword Mastery  \n> **Weight:** 410\n\nHuroi had gained Sword Mastery with his second class. But his Strength stat was abysmal for an Orator. Normal swords for his level were unusable.\n\nGrid had solved the problem.\n\nThe Mass-produced One-handed Sword (Prototype). Grid intended it as a future revenue stream, but its attack power already pushed the limits of one-handed weapons. Comparable to Dainsleif's minimum damage.\n\nHalf of Grid's design goal was a success.\n\n**KWAAAANG!**\n\n> [**CRITICAL HIT!**]\n> \n> [You dealt **7,910** damage to the target.]\n> \n> [You dealt **9,250** damage to the target.]\n> \n> [You dealt **10,180** damage to the target.]\n\nAssassins dumped points into Agility, not Stamina. High evasion over defense. But they were *confused*. They couldn't dodge.\n\nShay's party took Unbreakable Justice head-on.\n\n\"Khuk!\"\n\n\"Gah!\"\n\n> [You have suffered fatal damage!]\n> \n> [Mental state cannot recover.]\n\nThe massive damage triggered another confusion proc. 'Confusion linkage'—the dreaded chain effect they'd only heard rumors about.\n\nAn *Orator* doing this.\n\n*Does this make sense?*\n\n*Fuck.*\n\nShay's mind reeled. They'd dreamed of revenge on Grid. Now they were dying to his *subordinate* before even reaching him.\n\nAnd that subordinate was an *Orator*.\n\n\"Damn it...\"\n\nCurses spilled from their lips. Three assassins beaten by an Orator. If word got out, they'd be mocked across the entire server. The experience loss. The item drops.\n\nThis was humiliation.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing the daily batch."
}