{
  "id": 189,
  "title": "Chapter 189",
  "content": "# Chapter 189\n\n\"This is the end.\"\n\nHuroi's voice cut through the alley like a blade.\n\nBefore acquiring his second class at level 127, he'd been an ordinary orator. Back then, he'd split his stat points between intelligence and persuasion, trying to survive in a world that didn't favor pure support builds. Everything changed when he became an Apostle of Justice's Partner. From level 127 to his current level 236, he'd poured every available point into strength, stamina, and agility.\n\nThe shift was necessary. His class thrived on the **Courage** stat, a rare attribute that increased both attack and defense simultaneously. Yet even with that advantage, the gap remained. He'd started too late. His physical capabilities lagged behind warriors of the same level, his body unable to match the muscle memory and reflexes they'd honed from level one. His Sword Mastery sat at a mediocre Intermediate Level 2.\n\n*I need more time,* Huroi thought. *More time to reach my class's true potential.*\n\nBut recently, Grid had changed everything. The Mass-produced One-handed Sword (Prototype) his guild master had forged for him bridged the gap between Huroi's current ability and where he needed to be. Items. In the end, it always came down to items.\n\n**Swaaek!**\n\nThe black sword sliced through the air toward Shay's throat.\n\n\"Ugh!\"\n\nThey'd come for revenge on Grid, only to die without ever seeing him. The irony wasn't lost on Huroi. But Shay had one final card to play. Just before the blade could pierce his heart, he screamed.\n\n\"Kasim!!\"\n\nA shadow detached itself from the wall behind Shay, and steel flashed in the firelight.\n\n**Chaaeng!**\n\nLightning-fast daggers intercepted the black sword, deflecting it. The shadow spun, and cold metal kissed Huroi's throat.\n\n> **[You have suffered 4,140 damage.]**\n\n\"Ugh...!\"\n\nHuroi staggered back, blood streaming from the shallow gash across his neck. His hand moved on pure instinct, yanking a health potion from his inventory and downing it in one gulp. That reflexive movement had saved his life.\n\nThe figure who'd emerged from the shadow regarded him with mild interest. Kasim tilted his head, grey cloth wrappings shifting with the motion.\n\n\"You escaped a fatal wound?\" The assassin's voice carried a note of approval. \"Your sensitivity is better than I thought.\"\n\n*He isn't a player?*\n\nThe name floating above the thin man's head glowed green. An NPC. Huroi's mind raced to process this new variable.\n\n*An NPC assassin is escorting them.*\n\nNot just any assassin either. That single blow had stripped away 4,000 health. Based on the damage output alone, Huroi estimated the opponent sat at level 280 minimum. A named NPC, possibly higher. How had Shay's group acquired such a powerful escort?\n\nWhile Huroi calculated the threat, Shay recovered from his near-death experience. He gulped down a health potion and crowed at his opponent.\n\n\"Willingly give up your life! Kasim is a third advancement assassin! You're not his opponent!\"\n\n*Third advancement class?*\n\nCold sweat trickled down Huroi's spine. The gap between second and third advancement was like comparing earth to sky. Put a level 299 second advancement warrior against a freshly advanced level 300 third advancement fighter, and the level 300 would win every time. The class difference alone made it a massacre.\n\nHuroi wasn't even close to 300. Level 236 meant he faced both a massive class disadvantage and a crushing level gap. Every tactical bone in his body screamed at him to retreat.\n\n*Calm down.* He forced the panic away. *Think.*\n\nThis wasn't about pride or reputation. He didn't know these people, and dying here accomplished nothing. The smart play was obvious. Create distance, secure his safety, send a whisper to Euphemina for backup. A simple tactical withdrawal.\n\nShay's party sensed his hesitation and pressed their advantage, momentum building.\n\n\"We completed an S-grade quest and paid a huge sum of money to hire Kasim! All in order to get revenge on Grid!\"\n\n\"Before we kill Grid, we will experiment with Kasim's power on you!\"\n\n\"What...?\"\n\nThe words hit Huroi like cold water.\n\nThey wanted to hurt Grid.\n\nUnderstanding crystallized in that moment. He finally knew why they'd attacked him. The strategic calculus he'd been running evaporated like morning dew. Huroi's feet rooted to the cobblestones instead of carrying him to safety. His eyes, when they fixed on Shay's party, burned with demonic intensity.\n\n\"You guys.\" His voice dropped to something cold and final. \"I will kill you here.\"\n\nHe'd wipe out Shay's group. Even if that NPC assassin cut him down afterward, he'd eliminate this threat to his lord. It was his duty as Grid's subordinate.\n\n\"I will never let you see My Lord's shadow!\" \n\nHuroi thrust his hand skyward. Mana pulsed through the summoning link.\n\n\"Descend! Lord of the Skies above the Grasslands!\"\n\nThe Mongols had always possessed a gift for emotional, descriptive names. The fire drake *Lord of the Skies above the Grasslands* materialized above Huroi's head, massive wings beating the air. The wind pressure alone slammed Shay's party against the alley walls.\n\n\"Drake...!\"\n\nAfter the National Competition, drakes had lost some of their fearsome reputation. Grid's cat, that absurd demonic beast from hell, had systematically defeated dozens of them in the pet marathon. Some users had started dismissing drakes entirely, claiming their power had been overrated.\n\nBut the truth remained unchanged. Drakes were exceptional pets. Their combat ability, mobility, intelligence, and stamina overwhelmed ordinary creatures. Grid's cat was simply an outlier, a freak of nature that defied normal power scaling.\n\n\"This guy has strong items *and* a strong pet?\" Shay's voice rose to a shrill pitch. \"What the hell? You're just like Grid!\"\n\nHuroi didn't waste breath responding. He simply commanded his drake.\n\n\"Turn these people to ashes.\" He met the drake's eyes, conveying absolute trust. \"I acknowledge you. You are the strongest drake, so you can do it.\"\n\n**Kwaaaaah!**\n\n> **[Your drake 'Lord of the Skies above the Grasslands' was inspired by your words and his morale has risen. His attack power and magic power has greatly increased.]**\n\n**Hwaruruk!**\n\nThe drake's body swelled with power from the orator's buff. Its maw gaped wide, and a torrent of flame erupted forth. The narrow alley offered no escape routes. Shay's party was boxed in completely.\n\nWinston's streets became an inferno.\n\nDozens of people witnessed the conflagration.\n\n\"What? A drake?\"\n\n\"Wow... Is it a fight between rankers?\"\n\n\"In the middle of the city? Amazing! Let's go!\"\n\nNothing drew a crowd like violence. The promise of watching high-level combat had users and NPCs alike rushing toward the disturbance. Even Winston's soldiers responded to the emergency.\n\n\"Captain! We have to hurry!\"\n\n\"Go ahead and bring the guards!\"\n\nWinston's security forces prided themselves on their rapid response times. The guards sprinted toward the scene, ready to restore order. Unfortunately, their chief was the problem.\n\n\"We need to turn off the lights.\" Jude stared at the flames consuming the city block, his brow furrowed in concentration. \"Wind...? Fan?\"\n\nThe chief of security forces, the man responsible for coordinating the emergency response, was trying to determine what tools would suppress the fire. That man was Jude. Grid had assigned him to security duties as part of a comprehensive training regimen designed to raise his stats evenly. Monster subjugation, security activities, mineral extraction, sparring. Jude did it all.\n\n\"First of all, a fan. Please.\"\n\nJude's intelligence stat hovered somewhere near single digits. The answer he provided to his worried subordinates reflected that reality.\n\n\"Fans won't be able to stop this!\"\n\n\"Bring in others to put it out!\"\n\nThe guards pleaded with him. Jude's patience, never particularly robust, reached its limit. As always when confronted with complex problems, he stopped thinking.\n\n\"I will go.\"\n\nThe fire didn't matter. He'd go there and handle it directly. Grid's constant reminders to think carefully before acting faded from his mind, replaced by the siren call of immediate action.\n\n**Tadak!**\n\n*Fast!*\n\nThe guards gaped at their chief's retreating form. Jude ran three times faster than any of them, despite the full-plate armor encasing his body and the 3-meter greatsword slung across his shoulder. He didn't move like a human in their eyes.\n\nIndeed, there was a reason for his ignorance. High stats compensated for his lack of brains.\n\n***\n\nAt Khan's smithy, a different observer spotted the commotion.\n\n\"Hrmm, isn't there a splendid fight over there?\" \n\nEuphemina's eyes gleamed as flames painted the view outside the window orange. Combat meant opportunities. Opportunities to observe, to analyze, to duplicate outstanding skills. She'd never been one to resist such temptation.\n\n\"I will go.\"\n\nLike everyone else drawn to the spectacle, she ran straight toward the turmoil. Khan, left alone in his suddenly empty shop, finally released a breath he didn't know he'd been holding. For the first time that day, as his customers fled toward the fight, he could actually rest.\n\n***\n\nMeanwhile, at Winston Castle, Grid maintained his daily routine.\n\nHe had one unbreakable habit. Every single day, he disassembled and reassembled items to increase his understanding of them. He'd already achieved 100% comprehension of Dainsleif long ago. Now he devoted his efforts to the <span class=\"rarity-legendary\">Holy Light Armor</span>, methodically taking it apart and putting it back together.\n\nGrid was waiting for Euphemina in the castle's smithy when he heard soldiers rushing past, shouting about flames erupting near Khan's establishment.\n\n\"Khan...!\"\n\n*Is Khan in danger?* Worry spiked through him.\n\nGrid abandoned his work and bolted from the smithy. <span class=\"rarity-unique\">Braham's Boots</span> materialized on his feet mid-stride. Magic thrummed through the footwear, and Grid launched himself into the sky.\n\nLauel followed a moment later, his own flight magic kicking in.\n\n***\n\nThe fire drake's greatest strength lay in raw damage output. Among all drake variants, their breath attack dealt the highest burst damage. However.\n\n\"How is this possible...?\"\n\nHuroi stared at the impossible sight before him.\n\nThe instant *Lord of the Skies above the Grasslands* unleashed his breath attack, Kasim had summoned dozens of shadow soldiers. The spectral warriors formed a living wall, absorbing the entire inferno. Because the breath never reached Shay's group, it scattered in all directions instead.\n\nThe alley became a sea of fire.\n\n*How does an assassin have that type of defensive capability?*\n\nAssassins specialized in agility. They possessed outstanding attack power and mobility, perfect for quick strikes and rapid repositioning. Defense was supposed to be their critical weakness. Yet Kasim had used shadow soldiers as shields, demonstrating defensive capabilities that shattered everything Huroi knew about the class.\n\nShay recovered from his shock first, crowing at the stunned orator.\n\n\"This is the power of third advancement! It's my future!\" His laugh was shrill with triumph. \"How about it? Isn't it a class completely incomparable to an orator? Hahaha!\"\n\nAssassins generally fell into four major categories. Stealth specialists like Faker who excelled at infiltration and instant kills. Sword-users like Shay who blended blade work with assassination techniques. Ranged throwers like Sniffer and Kerb who relied on projectiles. And trap-setters who turned environments into death zones.\n\nBut those categories only applied to second advancement. Third advancement assassins transcended such limitations. They gained access to shadow techniques, abilities that allowed them to perfectly assimilate into shadows, travel between them, or summon shadow warriors.\n\nKasim was a master of shadows. He stood at the peak of assassins, rivaled only by legendary figures like Doran. The current Huroi had no realistic chance against him.\n\n\"Let's play a little bit.\"\n\n**Sururuk.**\n\nKasim melted into Shay's shadow like ink dissolving in water. A heartbeat later, he materialized in the darkness behind Huroi. Cold steel flashed.\n\n**Seokeok!**\n\n> **[You have suffered 4,010 damage.]**\n\n\"Ugh!\"\n\nKasim struck with surgical precision, targeting weak points with every blow. Defending was impossible. Evasion was futile. When Huroi tried to counterattack, the assassin simply vanished back into the shadows, making retaliation pointless.\n\n**Puok!**\n\n\"Kuak!\"\n\nHuroi tried striking at shadows on the ground. Kasim simply emerged from a different shadow, the darkness beneath a crate or the shade of a wall. It was spectacular to watch.\n\nThe gathering crowd murmured their appreciation.\n\n\"He is terrific. What is that skill?\"\n\n\"A hidden class?\"\n\n\"Assassin...? Considering that he's an NPC, is he a third advancement class?\"\n\n\"Wow, this is a big hit. I'm going to be an assassin.\"\n\n**Sakak! Seokeok!**\n\nKasim danced through the shadows, appearing and disappearing at will. Each strike carved away chunks of Huroi's health. He would have died already if not for his drake, the loyal creature using its massive body to intercept attacks meant for its master.\n\n> **[The Apostle of Justice's Partner's bravery is unmatched. Your current health has fallen below 20%, so all stats will increase by 30%.]**\n\n*This is my last chance.* The buff surged through Huroi's body. *I need to take down Shay's group NOW.*\n\nKasim had disappeared into the shadows again. Huroi pivoted toward Shay's group. They were giggling, caught off guard by his sudden movement. He raised his sword for a desperate charge.\n\nSomething rose from Shay's shadow. A shadow soldier, conjured as a guardian.\n\n**Kwachak!**\n\nHuroi's desperate swing collided with the spectral warrior. His attack dissipated against the shadow's form, nullified completely.\n\n\"This...!\"\n\nDespair crashed over him.\n\n\"This isn't fun.\" Kasim's voice came from directly behind him. \"I will end it quickly.\"\n\nThe assassin emerged from Huroi's own shadow, dagger point pressed against the orator's neck. Then a woman's voice rang out, clear and commanding.\n\n\"Raise Shadow Soldiers.\"\n\n**Kuoooh!**\n\n\"...!\"\n\nKasim froze, genuine surprise flickering across his features. Shadow soldiers erupted from the ground around him, spectral warriors turning against their natural master.\n\n**Chaaeng! Chaeng!**\n\nThe shadow soldiers forced Kasim to abort his execution. He leaped back, abandoning Huroi to deal with this new threat.\n\n*The same technique as mine was used?*\n\nThat meant another assassin of similar caliber was in the area. Kasim's gaze swept across the crowd of spectators. He reached out through the shadows, commanding the darkness beneath the onlookers, using it to identify whoever was attacking him.\n\nA blonde girl.\n\nKasim's eyes narrowed.\n\n\"An assassin wouldn't have such white skin.\" His voice carried accusation and confusion. \"Then how did you use the shadow technique?\"\n\nThe blonde girl met his stare without flinching. Euphemina smiled.\n\n\"What is this? Is it a technique that only you can use?\"\n\n\"Kukuk...!\" Kasim's laugh was sharp. \"Stop talking nonsense!\"\n\n*It must be black magic.* He dismissed her as a mere nuisance.\n\nKasim ignored the shadow soldiers and refocused on Huroi. He'd deal with that blonde pest after finishing his original target. However.\n\n\"What are you doing?\"\n\nA cold voice descended from above. Kasim and Huroi both looked up. Thousands of spectators, including Euphemina and the recently arrived Jude, turned their gazes skyward.\n\nShay's eyes went wide. \"Grid!\"\n\nThat's right. The figure hovering in the sky, backlit by Winston's lights, was Grid himself.\n\nThe spectators erupted.\n\n\"God Grid! God Grid has showed up!\"\n\n\"Pagma's Descendant...!\"\n\n\"Kyaaak! Look over here!\"\n\nHis popularity was undeniable. People praised him regardless of nationality or gender, screaming his name and waving their arms with frantic enthusiasm. They begged for even a moment of his attention.\n\nBut Grid's eyes held only one target. They fixed on Kasim with laser focus, taking in the dagger pressed to Huroi's bleeding throat. He didn't like what he saw. Not one bit.\n\n\"Take your hands off what is mine.\"\n\nThe command reached Kasim's ears. The assassin tilted his head.\n\n\"What if I don't want to?\"\n\n\"Then die.\"\n\n**Chwachwachwachwachwachwa!**\n\nSeven golden blades materialized around Grid, the metal singing as it caught the firelight. Pavranium. The legendary mineral that had captured the world's attention during the National Competition. The special armament of Pagma's Descendant.\n\nThe crowd went wild with excitement. Kasim, however, simply exhaled slowly.\n\n*Artifacts that move by themselves?*\n\nHis initial assessment of Grid had been dismissive. Shay's group had made the legendary blacksmith sound like an overhyped item-maker with mediocre combat skills. But this... this was something else. The boy with silver hair hovering beside Grid radiated power as well.\n\nBut more importantly...\n\n*Why does he have Doran's Ring?* \n\nKasim's attention locked onto the blue ring adorning Grid's finger. His mind raced through the implications.\n\n*This is interesting. I need to learn more about him before committing to a fight.*\n\nThe calculation took only a moment. Kasim released Huroi and stepped back.\n\n\"...Eh?\"\n\nThen he melted into the shadows and vanished.\n\nShay's group stood alone in the burning alley, abandoned by their hired protector. Their faces cycled through shock, confusion, and dawning horror. How could Kasim flee? How much money had they spent to hire him?\n\n*This is a lie. This has to be a lie.*\n\nGrid descended slowly, touching down on the cobblestones. He smiled at Shay's party, but the expression held no warmth.\n\n\"You came again?\" He pulled items from his inventory. Kenen's Belt. Trap installation tools. The poison combination machine. \"Did you come to give me more items? Eh?\"\n\nThe sight of their confiscated equipment made them want to kill him even more. But without Kasim, it was an impossible dream.\n\n\"...Haha.\"\n\nShay's group laughed awkwardly, a pathetic attempt to defuse the situation. Grid's smile vanished.\n\n\"Is something funny?\"\n\nThe National Competition had taught Grid the value of camaraderie. Seeing his people hurt ignited a cold fury in his chest. He reached for <span class=\"rarity-legendary\">Failure</span>, fully intending to execute them on the spot.\n\nLauel caught his wrist.\n\n\"Imprison them instead of killing them.\"\n\n\"Why?\" Grid's expression remained grim. \"Isn't that a waste of taxpayer money?\"\n\nLauel leaned in close, whispering so the growing crowd couldn't overhear.\n\n\"If a criminal is put in prison, the ruler can check the criminal's belongings. You can ask Lady Irene to inspect their items, then dispose of the equipment as you see fit.\" His smile was cunning. \"Anyway, can't you kill PK users at any time? It's more beneficial to trade their items for their lives first.\"\n\n\"Hoh...\"\n\nLauel always had ideas. Knowledge. He made himself useful in ways Grid could never anticipate. This was why Grid's mother had always told him to make smart friends back in elementary school. The advice finally made sense.\n\nGrid turned to address Jude, who'd arrived at the scene moments earlier.\n\n\"Lock them up in jail.\"\n\nAs the guards moved to restrain Shay's group, Euphemina approached. She held something in her hands. A production method. The blueprint for creating the best orb associated with Braham Eshwald.\n\nGrid's day was looking up.\n\n***\n\n**Glossary of Common Korean Terms**  \nOG: Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}