{
  "id": 19,
  "title": "Chapter 19",
  "content": "# Chapter 19\n\nThe lead party of the Tzedakah Guild moved along the main road and barely managed to finish the Guardian of the Forest raid after three days.\n\n*Kurururung.*\n\nThe Guardian of the Forest, encrusted with minerals, crashed to the ground with a thunderous boom. Some party members stumbled from the shockwave, leaving them vulnerable to the remaining golems.\n\n\"Ack!\" A mage tumbled backward.\n\n\"H-Help me!\" Another user flailed as a crystal golem closed in.\n\nJishuka's expression darkened as she searched through the Guardian's remains. The survivors couldn't even savor their victory, too busy scrambling for their lives.\n\n\"Idiots. What were you even watching?\"\n\nShe'd drilled the strategy into them before the fight. Every precaution, every pattern, every formation. The guild members had listened. The hired users? They might as well have been asleep. Her thorough preparation wasted.\n\n\"I'd rather die than live with the judgment and learning ability of a monkey.\"\n\nEach death tarnished the guild's reputation further.\n\n\"Tch.\"\n\nJishuka loosed arrow after arrow, each shot perfectly placed to save the fools who'd ignored her warnings. The number one ranked archer on the continent. \n\nThe party crawled out of the crisis thanks to the martial artist Regas, the twin-axe wielder Vantner, and the other Tzedakah Guild members. But the damage was severe.\n\n\"Seventy-five dead total.\" Toban's voice was flat.\n\nFour guild members among the deceased. Unlike the other fools who died from stupidity, these four had fallen in actual combat against the Guardian of the Forest.\n\n\"But it's over.\"\n\n*Finally.*\n\nIt had been a brutal battle. The Guardian boasted superior defense, massive health, and area-of-effect skills that kept the main party occupied. Meanwhile, it constantly summoned golems to pressure everyone else.\n\nWithout Jishuka and Regas carrying the raid, they would've failed. 100%.\n\nJishuka examined the drops. Her disappointment was palpable. The other party members sighed.\n\nThey'd fought the Guardian and its golems for two days. When they finally killed it, more golems spawned.\n\nThe loot was pathetic. Thirty iron ores. Seven orichalcum ores. One blue orichalcum ore.\n\nRegas shrugged. \"The Amethyst Shield didn't drop again.\"\n\nThe Tzedakah Guild challenged this raid every two weeks, hunting for that specific shield. But the drop rate was abysmal.\n\n*The difficulty of S-grade quests is beyond imagination.*\n\nEven among S-grade quests, the gap between single quests and linked quests was the difference between heaven and earth. \n\nVantner picked up the blue orichalcum. \"At least we got this.\"\n\n> **[Blue Orichalcum]**\n> \n> Orichalcum is a mineral born with the power of moonlight and the Guardian of the Forest.\n> \n> It is impossible to erode the Guardian of the Forest's magic power, but it has the best hardness and strength among all minerals.\n> \n> It is lightweight and becomes much stronger in the darkness.\n> \n> * Advanced blacksmith skills are required to smelt it.\n> \n> **Weight:** 3\n\nIts true value couldn't be determined yet, but once an advanced blacksmith appeared, this would fetch a fortune. \n\nJishuka led her exhausted party back to the village. The dead had already resurrected and were waiting in the square.\n\nToban converted the minerals' value to gold, dividing it according to market price and distributing shares to the party members. They barely avoided a deficit. The guild members didn't complain, but the hired users grumbled about the small compensation.\n\nWhat could they do? This was the result.\n\nJishuka disbanded the party and gathered the guild members. Her expression was serious.\n\n\"This is already the fourth failed raid. Rumors are spreading among general users that there's no value in participating. Next time, the quality of participants will be even lower. This is a problem.\"\n\nThe Tzedakah Guild was composed of top rankers. But their low reputation meant they remained a small guild.\n\nThe seventeen members had been together since before Satisfy, back in the L.T.S. days. They couldn't challenge the Guardian of the Forest raid with just their strength alone, so they recruited general users. But that well was running dry.\n\nToban, the level 172 paladin and the guild's chief of staff, nodded.\n\n\"I need the Amethyst Shield for my linked quest, but it can't be helped. For now, we should abandon the Guardian of the Forest raid and focus on strengthening the guild.\"\n\nVantner, ranked second among guardian knights, wielded twin axes despite his defensive class. He grunted in agreement.\n\n\"Right. Forcing it in this state is useless. Let's shelve the raid and improve our quality.\"\n\nJishuka scanned the faces of her guild members. They all seemed to share the same opinion. Only Regas' eyes shone like lanterns, clearly thinking *anything is fine as long as I can fight!*\n\nJishuka considered for a moment, then declared her decision.\n\n\"We're suspending the raid for three months. In that time, we'll improve our levels and equipment. If we each gain fifteen levels, we can kill that thing. Regas, you need twenty.\"\n\nJishuka's smile was bright. Her half-moon eyes were alluring—but to the guild members, they were terrifying. Their leader was ruthless. If they failed to meet the goal, they'd experience hell. The guild members, who knew better than anyone how fierce Jishuka could be, swallowed nervously.\n\nRegas cried out in a trembling voice. \"Let's go train!\"\n\nThe Tzedakah Guild discreetly dispersed.\n\nJishuka headed to the guild warehouse alone. Her South American beauty and curves attracted attention from every male she passed. Being a famous ranker only increased the crowd.\n\nShe ignored them all.\n\nJishuka deposited the <span class=\"rarity-rare\">Blue Orichalcum</span> in the warehouse, then headed to the auction house without concern for the followers. The blue orichalcum could be sold later, but not now. For the moment, the iron ore and regular orichalcum would fetch the best price.\n\nShe registered the minerals, then browsed the auction house.\n\n\"Show me the list of Jaffa Arrows.\"\n\nA transparent screen materialized before her. The current listings for Jaffa Arrows appeared. The immediate purchase price was six silver per arrow.\n\nAn incredibly expensive price for a single arrow, but she'd never found better. Jishuka swept up every listing. Money was no object. She invested her earnings as a top ranker precisely where they'd make the biggest impact.\n\n\"What is this?\"\n\nJishuka noticed a bid-only listing at the bottom of the screen and frowned. It was the only one without a buy-now price. Ninety-nine bids already, with the highest at eighteen silver.\n\n*What madman would bid three times the normal price for a Jaffa Arrow?*\n\nThen she noticed the name of the arrows wasn't white. It was purple.\n\n*Did I see wrong?*\n\nShe blinked. Still purple. Her pulse quickened as she checked the details.\n\n> **[<span class=\"rarity-epic\">Special Jaffa Arrow</span>]**\n> \n> **Rating:** Epic\n> \n> **Attack Power:** 35~42\n> \n> An arrow made by a craftsman with great skills and potential but lacking in experience and reputation.\n> \n> Due to the effect of combining jaffa with steel, it has extremely high penetration and ignores some of the enemy's defense.\n> \n> * Has a certain chance of ignoring the enemy's defense.\n> \n> **Weight:** 0.1\n\n\"......!\"\n\nJishuka's eyes widened. If people weren't watching, she would've screamed.\n\n*Unbelievable!*\n\nShe was shocked beyond words. She'd played Satisfy every day for the past six months, adventured with countless users, collected information using money and guild resources.\n\nNever had she imagined an epic rated arrow could exist. She'd been convinced arrows were unconditionally normal rated items.\n\nShe'd visited famous blacksmiths with various materials, commissioned arrows, but everything they produced was normal rated. She'd never heard of or witnessed anything higher.\n\nUntil now! \n\nEpic arrows. Not even rare—epic. And the performance was fraudulent.\n\nJishuka bid immediately. Thirty-five silver.\n\nAn absurd price for a consumable, but she had to consider scarcity. Besides, it could serve as a secret weapon against a powerful opponent.\n\n*Who made this?*\n\nTwo names came to mind first. Panmir and Steng, ranked first and second among blacksmiths. But they didn't fit the description of 'lacking experience and reputation'—both were famous.\n\n*...A blacksmith who surpasses them is hiding somewhere.*\n\nProbably someone who'd invested heavily in production skills but kept their character level low, staying off the rankings. The description of 'great skill and potential' was tantalizing.\n\n*If I find them...*\n\nJishuka canceled the registration of her iron and orichalcum.\n\n*Thanks to the Guardian of the Forest raid, I've steadily accumulated minerals.*\n\nShe'd use the best materials as bait for whoever made these epic arrows.\n\n{Contact all users in the top one hundred blacksmith rankings and measure their skill levels. Shortlist anyone whose production skills are high compared to their character level.}\n\nJishuka's command appeared in the guild chat window. The guild members erupted in protest.\n\n{What are you suddenly saying? Contacting blacksmiths out of nowhere?}\n\n{We need to level up!}\n\nJishuka shut them down.\n\n{Shut up! There's a greatly skilled person hiding! If we find them and recruit them to the guild, the Guardian of the Forest raid won't be a problem.}\n\n{Are they really that skilled?}\n\n{This blacksmith is better than Panmir and Steng. The items they produce will exceed anything currently available. So far, they haven't surfaced so no one knows they exist, but that's changed. Every guild on the continent will be scrambling to find this blacksmith. We can't lose them... Find them! Find the blacksmith before anyone else.}\n\n{If Master says so...}\n\n{This blacksmith must be huge. Okay, let's find them!}\n\nAs a rule, the Tzedakah Guild didn't accept new members. They were seventeen elites who'd relied on each other since the L.T.S. days. Their small numbers constrained them and slowed their growth, but no one complained.\n\nThey couldn't occupy castles like large guilds, but anyone would fear their power. They might lack the reputation of major guilds, but they made up for it with force. The Tzedakah Guild members occupied the top three rankings of each class in the six months since Satisfy launched. They were confident and proud.\n\nSeventeen members strong enough to dominate their nation. For the first time since the L.T.S. days, they were interested in recruiting an outsider.\n\n\"Someone raised the bid again?\"\n\nJishuka received the notification that her bid had failed. She didn't hesitate to bid higher.\n\nThe first epic rated arrows! The bidding price skyrocketed.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 16 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}