{
  "id": 190,
  "title": "Chapter 190",
  "content": "# Chapter 190\n\nOne and a half years ago in Satisfy, Grid was still level 21. Fresh from becoming Pagma's Descendant. Broke. Desperate.\n\nRabbit had cornered Khan in his smithy, the Mero Company's shadow looming over Winston like a plague. The merchant's proposal was simple: an item production game. Winner keeps the smithy.\n\nKhan was drunk. Always drunk back then. His hands shook too badly to grip a hammer. So he'd turned to Grid with bloodshot eyes and begged.\n\nGrid had said yes. The promise of gold made the decision easy.\n\nThe contest against Euphemina should have been straightforward. Make an item. Best quality wins. But the Mero Company didn't play fair. They'd arrested Grid mid-forge and thrown him in a cell to rot.\n\nHe'd failed. Lost. Screamed at the stone walls about божественный curses and shit luck until his throat bled.\n\nThen Euphemina had appeared like some kind of saint. Freed him. Helped him reclaim the Ideal Dagger, rescue Huroi, earn the title 'Apostle of Justice.'\n\nShe was his savior.\n\nGrid hated that.\n\n***\n\n*I'm not pleased at all.*\n\nThe thought crawled through Grid's skull as he watched Euphemina approach across Winston's courtyard. Old memories clawed at him. Gratitude tasted like bile.\n\nIt wasn't personal. Euphemina hadn't wronged him. The problem was simpler.\n\n*If I can't produce a unique rated orb... what will she do?*\n\nGrid didn't know the Duplicator class had weaknesses. To him, Euphemina was a walking apocalypse, a spell-slinger who could copy anything and destroy everything. Stronger than him. That made her dangerous.\n\nShe wanted a unique rated orb. Minimum. In exchange for returning the Ideal Dagger.\n\n*What if I fail? What if I make trash?*\n\nHis palms went slick. The image of Euphemina's magic bombardment turning him into paste played on loop behind his eyes.\n\n*I can't survive that.*\n\n\"It's been a while.\"\n\nEuphemina's voice was bright. Cheerful. She smiled at Grid like they were old friends, her eyes sparkling with something that looked like genuine pleasure.\n\n*She watched the National Competition. Saw me win.*\n\nGrid's jaw tightened. Euphemina thought he was competent. That made the stakes worse.\n\n\"I watched your great performance in the National Competition on TV. You were really cool.\"\n\nShe beamed up at him. Literally up, her head barely reaching his shoulder. One hundred fifty centimeters of deceptive cuteness wrapped in an innocent face that made grown men stupid.\n\nThe crowd proved it.\n\n\"Who's that girl?\"\n\n\"Seriously adorable. I want to put her in my pocket.\"\n\n\"Damn Grid... He already has Yura and Jishuka, now there's this girl. I'm seriously envious.\"\n\n\"Beauties always follow the heroes. God Grid deserves to be king of the harem.\"\n\nGrid felt nothing. Euphemina's appearance registered as 'small' and 'young' and his brain moved on. He preferred curves. Maturity. Irene's body. This girl looked like someone's kid sister.\n\nThe lack of attraction was a mercy. It kept his head clear.\n\n\"There are many eyes watching.\" Grid scanned the gawkers. \"Let's talk after moving.\"\n\n***\n\n*That attitude is still present.*\n\nEuphemina's cheeks puffed slightly as she followed Grid's party toward the castle. The last time they'd met, he'd been the same. Completely indifferent to her looks. She'd fluttered her eyelashes, angled her face just so, deployed every trick in the book.\n\nNothing. He'd looked through her like glass.\n\n*Is he gay? Impotent?*\n\nThen the National Competition happened. Yura. Jishuka. Scandals plastered across every news site.\n\nEuphemina's pride throbbed like a fresh bruise.\n\n*Are Yura and Jishuka better than me?*\n\n***\n\nWinston Castle's gates swung open before Grid arrived.\n\n\"Welcome!\"\n\nThe soldiers snapped to attention, salutes crisp. Grid returned the gesture without breaking stride.\n\n\"You worked hard.\"\n\nNatural. Easy. Like he'd been nobility his whole life instead of a debt-ridden part-timer who couldn't afford proper meals.\n\nEuphemina's eyes widened. \"You seem to have become a noble?\"\n\nThe logic tracked. User levels were climbing across the board. Experts estimated at least fifteen rankers held baronies now. Euphemina wanted one herself. The tax benefits alone would be worth the effort.\n\n*A legendary class really is incredible.*\n\nLauel's voice cut through her thoughts.\n\n\"He is a viscount. In addition, he is the husband of Lady Winston.\"\n\n\"...Huh?\"\n\nThe world tilted.\n\n*Viscount?*\n\nNot baron. Viscount. The same rank as Zibal. As Chris. Masters of guilds with hundreds of members.\n\n*And Lady Winston.*\n\nIrene. Earl Steim's only heir. A marriage that should have shaken kingdoms, announced with trumpets and political intrigue.\n\nInstead, silence. Secrecy. A user husband.\n\n*It was Grid.*\n\nEuphemina's mind raced. You didn't marry into nobility by accident. The relationship between Grid and Irene had to run deep. Months of careful courting. Strategic seduction.\n\n*He played a completely different game from the rest of us.*\n\nLike those dating sims. Visual novels where you picked the right dialogue options and won the perfect waifu.\n\n*Amazing.*\n\nHer gaze locked onto Grid's back. Lantern-bright. Reverent.\n\n*The first legendary class person transcends common sense.*\n\nGrid was the first user whose skills her Duplicator class couldn't copy. The first true anomaly. During the National Competition, commentators had mocked his control. Called him clumsy.\n\nEuphemina knew better.\n\n*There's no need for control when you can just roughly use your skills.*\n\nHis PvP matches proved it. Overwhelming stats turned poor technique into brutal efficiency.\n\n*I'm proud to know him.*\n\nGrid had no idea. He wasn't paying attention.\n\n***\n\nWinston Castle's smithy was exactly as Grid remembered. Stone walls. The familiar heat of the furnace bleeding into the air.\n\nHe lit the fire. Watched flames catch. Turned to Euphemina.\n\n\"Did you obtain all the materials needed to make the orb?\"\n\nHis voice came out flat. Blunt. He didn't mean to sound rude. Social graces just... weren't his thing.\n\nEuphemina's expression soured. Her lips pressed into a thin line.\n\n\"Of course. It took me a year to get the orb production method and then six months to obtain all the ingredients listed. My preparation is perfect.\"\n\n*One year? Half a year?*\n\nGrid's brain stuttered.\n\n*Is she insane?*\n\nA year and a half. For one item. The waste made his skin crawl. You could earn millions of gold in that time. Pay off debts. Buy a building.\n\nEuphemina was a fool.\n\nBut Grid was wrong. Euphemina was normal.\n\nShe played Satisfy like everyone else in her bracket: with goals. Heavy users chased objectives no matter the cost. Light users quit when things got hard.\n\nLevel 283. Private ranker. Obviously a heavy user.\n\nInvesting eighteen months for the best orb in the game? Standard. That was how you played.\n\nPast Grid would have understood. He'd found Pagma's Rare Book after months of grinding without complaint. But debt had rewired his priorities. Satisfy wasn't a game anymore. It was a job. The current Grid couldn't comprehend Euphemina's mindset.\n\n*She truly is scary.*\n\nCold sweat prickled down his spine.\n\n*I can't upset her.*\n\nBreaking someone's year-and-a-half investment would justify murder. PK. A hunt that wouldn't end.\n\n*It must be at least a unique rating.*\n\nGrid's hands curled into fists.\n\n*It has to be.*\n\nHe closed his eyes. Mouthed a silent prayer.\n\n*God, Buddha, Goddess Rebecca, God Judar, God Dominion, please protect my experience.*\n\nGrid wasn't religious. Didn't attend church, didn't bow to altars. But he didn't reject gods either. If begging helped, he'd beg.\n\n*Please. Just this once.*\n\n\"Let's begin.\"\n\nThe words felt heavy. Grid met Euphemina's gaze.\n\nHer hand extended. A scroll rested in her palm.\n\n\"I'm asking you, the legendary blacksmith.\"\n\nThe system chimed.\n\n> **['Mumud's Orb Production Method' has been acquired.]**\n\n*...Mumud?*\n\nThe name was awful. Grid's first thought was disappointment.\n\n*Sounds like Dainsleif.*\n\nHe had no idea who Mumud was. Some NPC probably. Another dusty legend.\n\nThen he opened the production method.\n\nHis breath caught.\n\n> **[Mumud's Orb Production Method]**\n>  \n> **Learning Conditions:**\n> Mastered the Blacksmith's Craftsmanship skill.\n> **Or** have Dwarven Blacksmith's Craftsmanship skill level 5 or higher.\n>  \n> **Description:**\n> An orb designed by the dwarven craftsman Milepeu, who taught Pagma before he became a legend. It was widely known as Mumud's Orb because Braham's disciple, Mumud, loved this orb all of his life.\n\n*Mastered Blacksmith's Craftsmanship?*\n\nThe learning conditions were insane. Higher than anything Grid had ever seen. Albatino himself, the greatest blacksmith before Pagma's era, couldn't make this orb.\n\nWhich meant one thing.\n\n*This orb... it's higher rank than Dainsleif.*\n\nFree. Euphemina handed it to him for free. No payment. Just trust.\n\nThe year and a half she'd spent wasn't wasted. This was treasure.\n\nGratitude bloomed. Genuine. Unfamiliar.\n\n\"Euphemina.\"\n\n\"Huh?\"\n\nShe startled. Grid had never called her by name before.\n\nHe looked at her. Really looked. Let the calm settle into his eyes.\n\n\"I will do my best.\"\n\n***\n\nEuphemina felt the shift. For the first time since they'd reunited, Grid focused on her. Not through her. Not past her.\n\n*On* her.\n\nHis face changed. The perpetual anxiety smoothed out. Confidence replaced it. A craftsman staring at a challenge.\n\nA completely different man.\n\nShe smiled. Bright. Relieved.\n\n\"Thank you.\"\n\nGrid nodded. The notification appeared again.\n\n> **['Mumud's Orb Production Method' has been acquired.]**\n\n*Interesting.*\n\nHeat bloomed in Grid's chest. This was rare. A chance to create something legendary. As a blacksmith, the hunger roared to life.\n\nHe cracked his knuckles. Turned to the furnace.\n\nTime to work.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}