{
  "id": 191,
  "title": "Chapter 191",
  "content": "# Chapter 191\n\n> **[<span class=\"rarity-rare\">Mumud's Orb</span> ~ <span class=\"rarity-legendary\">Mumud's Orb</span>]**\n>\n> **Rating:** Rare ~ Legendary\n>\n> **<span class=\"rarity-rare\">Rare Rating Information:</span>**\n>\n> Durability: 149/149\n>\n> Magic Damage: **+13%**\n>\n> Magic Casting Speed: **+5%**\n>\n> Number of spells that can be stored: **3**\n>\n> * You can permanently store one spell at or below B-grade.\n>\n> **<span class=\"rarity-epic\">Epic Rating Information:</span>**\n>\n> Durability: 175/175\n>\n> Magic Damage: **+16%**\n>\n> Magic Casting Speed: **+8%**\n>\n> Number of spells that can be stored: **3**\n>\n> * You can permanently store one spell at or below B-grade.\n>\n> **<span class=\"rarity-rare\">Unique Rating Information:</span>**\n>\n> Durability: 200/200\n>\n> Magic Damage: **+20%**\n>\n> Magic Casting Speed: **+12%**\n>\n> Number of spells that can be stored: **4**\n>\n> * You can permanently store one spell at or below A-grade.\n>\n> * **10%** reduction in skill cooldown time.\n>\n> **<span class=\"rarity-legendary\">Legendary Rating Information:</span>**\n>\n> Durability: 247/247\n>\n> Magic Damage: **+27%**\n>\n> Magic Casting Speed: **+18%**\n>\n> Number of spells that can be stored: **4**\n>\n> * You can permanently store one spell at or below S-grade.\n>\n> * **15%** reduction in skill cooldown time.\n>\n> An orb designed by the dwarven craftsman Milepeu, who taught Pagma before he became a legend.\n>\n> The crystal ball made by combining abyss mithril, Frost Queen's Breath, and Water Clan King's Tears allows it to contain enormous power and special functions.\n>\n> **User Restriction:** Level 280 or higher. More than 3,000 **Intelligence**. Advanced Orb Mastery Level 5.\n>\n> **Weight:** 150\n\nGrid stared at the information window.\n\n*A magic possession item?*\n\nStorage and possession were different beasts entirely. Stored magic vanished after one use. Possessed magic became part of the item itself, permanent, reusable. Like the Fly magic embedded in Braham's Boots that let non-magicians soar through the air.\n\nMagic possession items were efficient beyond measure. Their utility shifted with the spells they held. Millions of users craved them. Dreamed of owning just one.\n\nBut they were rarer than dragon's teeth. Even veteran players who'd logged in since day one had never laid eyes on such a treasure. Only monster drops from hell-tier bosses, impossible raids, or miracle quests yielded them. In the past, Vantner would've emptied his bank account, sold his house, pawned his soul for Braham's Boots.\n\n*This is outside a blacksmith's domain.*\n\nGrid was a <span class=\"rarity-legendary\">Legendary</span> blacksmith. He still didn't know how to create magic possession items. His **Legendary Blacksmith's Craftsmanship** sat at level 5, but the section on magic possession items remained empty. A void in his knowledge.\n\nPagma hadn't known either. That much was clear.\n\nYet here Grid stood, production method in hand. The first person among two billion users to learn how to forge a magic possession item.\n\n*If I study this orb...*\n\nHe could crack the secret. Reverse-engineer the principles. The dwarven craftsman Milepeu had taught Pagma once. Now, through this work, Milepeu would teach Grid as well.\n\nHis knuckles whitened around the <span class=\"rarity-legendary\">Legendary Blacksmith's Hammer</span>.\n\n*Thump-thump. Thump-thump.*\n\nHis pulse hammered in his ears.\n\nA grin split his face. Electric anticipation crawled up his spine, flooded his chest.\n\n*Through this...*\n\nGrowth. Evolution. He'd surpass Pagma in this one narrow slice of craftsmanship. And in exchange for this chance to climb higher, he'd bless Euphemina with a <span class=\"rarity-rare\">Unique</span> rated orb. Grid pulled up the materials list and turned to her.\n\nEuphemina handed them over without hesitation.\n\n> [22 <span class=\"rarity-epic\">deluxe magic stones</span> have been acquired.]\n\n> [One Frost Queen's Breath has been acquired.]\n\n> [One Water Clan King's Tears has been acquired.]\n\n> [5 abyss mithril have been acquired.]\n\n\"I'm asking you.\" Her voice was steady, but her fingers trembled slightly as she released the materials.\n\nSix months of work. Six months of blood, sweat, and near-death experiences to gather these components. The abyss mithril, Frost Queen's Breath, and Water Clan King's Tears were priceless. The magic stones alone ran 4,000 gold each.\n\nIf Grid burned these materials on an <span class=\"rarity-epic\">Epic</span> rated result, or worse, <span class=\"rarity-rare\">Rare</span>... disappointment wouldn't cover it. Euphemina's stomach knotted at the thought.\n\nGrid nodded, casual as breathing. \"Believe in me.\"\n\nLauel's face went pale.\n\n*We're doomed.* \n\nHe'd stayed quiet to avoid interfering, but he knew Grid's patterns too well. When Grid said \"believe in me,\" disasters followed. Fires. Explosions. Items that somehow ended up worse than the materials used to make them.\n\n\"Okay.\" Euphemina smiled, radiant and trusting. \"I'll believe in you.\"\n\nLauel forced his mouth into something approximating a smile. \"Let's leave Grid alone so he can concentrate.\"\n\n\"Yes.\"\n\nShe beamed at him. Euphemina floated out of the smithy on a cloud of optimism.\n\nLauel's expression curdled the moment she was out of sight. He ground his teeth.\n\n*The <span class=\"rarity-rare\">Unique</span> orb is already gone.*\n\nWorst case scenario. Lauel needed Euphemina in the guild. Needed her power, her skills, her potential. If Grid produced a <span class=\"rarity-rare\">Unique</span> or <span class=\"rarity-legendary\">Legendary</span> orb, Euphemina would pledge herself to Grid on the spot. Loyalty bought with excellence. But the conditions weren't right. Not with Grid's cursed \"believe in me\" hanging in the air.\n\n*If she'd joined us...*\n\nSome people played Satisfy like a vacation. Disabled users walked on whole legs. Tourists gawked at vistas Earth couldn't match. Foodies gorged on impossible delicacies.\n\nBut Satisfy had levels. Wealth gaps. Class systems. Competition was inevitable, baked into the code. Most users didn't treat it like a game. They clawed for every advantage.\n\nThey leveled frantically. Built power, wealth, reputation. Dreamed of noble titles, of crowns, of armies. The continent's territories, currently held by NPC aristocrats and royalty, would eventually fall into user hands.\n\nNatural progression. Lauel intended to ride that wave with Grid at the crest. His master would become a king. To make that happen, he needed talent like Euphemina.\n\nMissing this opportunity tasted like ash.\n\nOutside, Huroi caught Euphemina before she left. \"I really appreciate it. In the past and this time, you saved my life.\"\n\nEuphemina waved him off. \"It was Grid, not me, who helped you before. I just helped Grid to clear my own quest. Don't think about the past.\" She paused. \"This time... I couldn't just stand by. It's not something to be thankful for.\"\n\nDeception came naturally to Euphemina when chasing goals. But she wasn't heartless, not toward people she knew. Her weakness and her strength, wrapped in the same package. Color rose in her cheeks as she deflected Huroi's gratitude.\n\nHuroi watched her with a quiet smile. She'd saved him from Kasim. Saved his experience points from deletion. He'd repay this debt eventually.\n\nEuphemina didn't realize she'd just earned powerful allies. Grid had gained a priceless production method for nothing. Huroi had kept his experience intact. But her attention remained laser-focused on the orb's final rating.\n\n*Clang! Clang!*\n\nHammer on metal rang from inside the smithy. Euphemina crept to a small window and peered through.\n\nGrid stood before the blast furnace, sweat gleaming on his skin. The firelight painted him in shades of orange and shadow.\n\n*He's changed.*\n\nThe Grid in her memory had been... less. Unremarkable features. A face you'd forget in a crowd. But now he'd grown into his bones. His high nose and pronounced forehead caught the eye. His monolid eyes held a mysterious, Asian charm. Not conventionally handsome, perhaps. But striking. Appealing in unexpected ways.\n\n*He didn't get surgery...* \n\nThe difference was simpler. Hairstyle. Expression. Posture.\n\nBefore, his hair had flopped messily over his forehead, hiding his better features. His face had been locked in a permanent scowl, lips twisted in complaint. No muscle tone. Shoulders hunched. Back bent like he was carrying the world's weight.\n\nNow his hair was neat. His body had filled out with lean muscle. Confidence radiated from his movements, his expressions. The transformation was total.\n\n*A miracle.*\n\nWarmth spread through her chest. If Grid could change this much, maybe she could too. Maybe someday she'd look back and see growth in herself.\n\nGrid's existence grew larger in her mind. A milestone on her path to becoming someone better.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}