{
  "id": 192,
  "title": "Chapter 192",
  "content": "# Chapter 192\n\nGrid stared at the blueprint, his jaw clenched.\n\n*The more I look at this thing, the more it pisses me off.*\n\nHe had to admit it. <span class=\"rarity-legendary\">Mumud's Orb</span> was a masterpiece. The magic possession system alone was revolutionary, but the reduced cooldowns? The faster casting speeds? It made his mouth water.\n\nBut the magic damage coefficient was... ordinary. Not bad. Just ordinary.\n\n*Why?*\n\nGrid's eyes narrowed as he traced the numbers again. Then it clicked.\n\n*Balance. They nerfed the damage on purpose.*\n\nIf the orb had peaked stats across the board, the usage requirements would spike through the roof. No one could equip it. A perfect weapon you couldn't use was just expensive trash.\n\nHis pulse quickened. *This is it. This is what I've been missing.*\n\n<span class=\"rarity-legendary\">Failure</span> flashed through his mind. That beautiful, stupid, useless shark-shaped greatsword gathering dust in his inventory. Pure offense. Zero compromise. **5,000 Strength**. **Advanced Sword Mastery Level 8**.\n\nRequirements so absurd that Grid himself couldn't use it.\n\n*Two years.* That's how long the analysts predicted before any player hit **5,000 Strength**. Two years of the strongest weapon in Satisfy sitting in his inventory like a participation trophy.\n\nHe'd named it Failure for a reason.\n\n*If I'd just... lowered the attack power. Made it balanced like this orb.*\n\nLower requirements. Actually usable. Sellable.\n\n*I'd be swimming in gold right now.*\n\nHis hands trembled slightly. The revelation felt like a physical weight lifting from his shoulders. This was it. This was how you made *practical* legendary items. Not just stat-stick abominations.\n\nGrid exhaled slowly, a rare smile creeping across his face. *I can fix the Mass-produced One-handed Sword with this. Lower the ceiling, raise the floor.*\n\nHe pulled up the material list for Mumud's Orb.\n\nAbyss Mithril. Frost Queen's Breath. Water Clan King's Tears.\n\n*What the hell are these?*\n\nHis cursor hovered over each item. The descriptions loaded.\n\nThe smile died.\n\n> **[Frost Queen's Breath]**\n> \n> The extremely low temperature climate of Heraris caused the Frost Queen's breath to crystallize. This crystal will never melt and has the effect of amplifying magic power.\n> \n> **Weight:** 0.1\n\n> **[Abyss Mithril]**\n> \n> Deep in the ocean. A rare mineral that is only found near the Siren Kingdom. Its harmony with magic power is three times better than normal mithril.\n> \n> **Weight:** 15\n\n> **[Water Clan King's Tears]**\n> \n> The Siren King sheds tears every five months, longing for his daughter who left the world before him. These tears have the mysterious function of imbuing items with magic.\n> \n> **Weight:** 0.1\n\nGrid's stomach dropped.\n\n*Siren Kingdom.*\n\nThen the gears started turning.\n\n*The tears. That's the secret.* If he designed items around the Water Clan King's Tears as a core material, he could create magic possession weapons. Real ones. Not this half-baked elemental nonsense.\n\n*What if I put S-grade magic on my armor?*\n\nCounter Barrier soaking hits while he waded into melee. Meteor raining from his sword with every swing. He wouldn't just be strong.\n\n*I'd be a one-man army.*\n\nHell Gao flashed through his mind. That burning bastard who'd killed him twice. With magic possession items?\n\n*I could solo him.*\n\nHis thoughts spiraled. *And the pavranium...*\n\nThe golden discs. The needles. All of them capable of flight, autonomous defense, and now—if he cracked this—autonomous *offense*. Meteor from seven different angles. Lightning needles. Fire blade bombardment.\n\n*True Overgeared.*\n\nGrid's grin stretched wide. *I'm a damn genius.*\n\nFor thirty glorious seconds, he basked in his own brilliance.\n\nThen reality returned with the force of a sledgehammer.\n\n*How did Euphemina get this stuff?*\n\nHis eyes locked on the description again. \"Only found near the Siren Kingdom.\" \"Siren King sheds tears every five months.\"\n\n*First discoverer of the Siren Kingdom.*\n\nEuphemina.\n\n\"Kuoh...\"\n\nThe sound escaped before he could stop it. A low, strangled groan. His stomach cramped.\n\n*How much did she make?* First discoverer benefits were legendary. Quests. Titles. Exclusive access to rare materials. And Siren was an entire *kingdom*.\n\n*That lucky...*\n\nHis jaw worked silently. She'd handed him this production method out of charity. Gratitude. Friendship. And Grid had been moved. Genuinely moved.\n\n*I wanted to make her something amazing.*\n\nThe affinity was real now. He didn't flinch when she smiled anymore. Didn't feel that gnawing suspicion.\n\n*But she doesn't need my help.*\n\nEuphemina had the <span class=\"rarity-epic\">Duplicator</span> class. Hidden. Overpowered. And now she'd stumbled into the *Siren Kingdom* like some protagonist out of a fairy tale.\n\nGrid's hands hovered over the materials.\n\n*Wouldn't it be educational to let her experience failure for once?*\n\nThe thought wormed in like poison. He knew it was petty. Knew it was small. But human nature didn't rewrite itself overnight. Despite everything, despite his growth, Grid was still the guy who argued with strangers on forums at 2 AM.\n\n*Just... a rare rating. That's still decent.*\n\nHe grabbed the Abyss Mithril and shoved it into the furnace. The bellows hissed as he pumped air through the coals.\n\nSilence.\n\nThe metal began to glow.\n\n\"...Sigh.\"\n\nGrid stopped. His hand fell away from the bellows.\n\n*I can't do this.*\n\nSabotaging the craft wouldn't hurt Euphemina. It would hurt *him*. In the long run, this kind of rot festered. He'd already crawled out of the hole once. Why dig himself back in?\n\nHe straightened. Cracked his knuckles. Took a breath.\n\n*Do it right.*\n\nThe Abyss Mithril reached optimal temperature. Grid pulled it free and laid it on the anvil, hammer raised.\n\n**Ttang! Ttang!**\n\nThe ornamental housing for the orb began to take shape. His hands moved with surgical precision, shaping the blue-silver metal into delicate filigree. The design was old-fashioned. Baroque. Every curve had to align perfectly or the magic conductivity would drop.\n\nThree hours blurred past.\n\nSweat dripped from Grid's chin. The handle was done. Perfect. He set it aside and turned to the magic stones.\n\nAccording to the blueprint, Frost Queen's Breath and Water Clan King's Tears had to be mixed *before* integration. He placed both crystals in a crucible and heated them slowly.\n\nThey melted. Fused.\n\n*What the...*\n\nThe liquid cooled into a single crystalline mass. Translucent blue. Hard as steel. Not a magic stone anymore. A completely new mineral.\n\n*Milepeu created a new element.*\n\nJust like Pagma and Braham had forged pavranium from impossibility, the dwarf Milepeu had done the same. Created something that shouldn't exist.\n\nGrid's stomach twisted again.\n\n*Euphemina gets to keep this mineral too.*\n\nFirst discoverer rights. Exclusive access. Siren was an underwater nation. No one else could even *reach* these materials without her permission.\n\n*She's hoarding an entire periodic table.*\n\nHis hands slowed. The hammer came down crooked.\n\n**Kaaang! Kaaang!**\n\nThe crystal sphere dimpled. Warped.\n\n\"Heok?\"\n\nGrid jerked back, staring at the misshapen lump. His jealousy had bled into the metal.\n\n*Get it together.*\n\nHe gritted his teeth. Focused. The修正 strikes came carefully, painstakingly.\n\n**Ttang! Ttang!**\n\nThe sphere smoothed. Rounded. Started to gleam.\n\n*This is going to be Epic at minimum.*\n\nThe realization hit, and with it, another cramp.\n\n\"Kuoh...!\"\n\n*Why does she get everything?*\n\nThe Duplicator class. The Siren Kingdom. And now a legendary orb on top of it all?\n\n*Where's MY lucky break?*\n\nHis next swing came down sloppy.\n\n**Kaaang! Kaaang!**\n\n*No. Stop. She helped you. She gave you this method.*\n\n**Ttang! Ttang!**\n\nDelicate corrections. Smooth curves.\n\n*But she already has a fraudulent class! She doesn't NEED more advantages!*\n\n**Kaaang! Kaaang!**\n\nAngry, graceless hammering.\n\n*She trusted you to make this. Don't be trash.*\n\n**Ttang! Ttang!**\n\n*First discoverer benefits are literally unfair. The system is rigged.*\n\n**Kaaang! Kaaang!**\n\n*You're better than this.*\n\n**Ttang! Ttang!**\n\nThe cycle repeated. Precision. Rage. Precision. Rage.\n\nGrid felt like a passenger in his own body, watching his hands war with themselves. One moment, the sphere was flawless. The next, dimpled with fury. Then corrected again.\n\n\"Hah... what am I even doing?\"\n\nDawn light crept through the smithy window. An entire night had passed.\n\nThe orb was finished.\n\n*Clink.*\n\nGrid set down the hammer and stared.\n\nA blue crystal sphere, perfectly smooth, nested in baroque silver handles. Despite his manic process, the exterior was *pristine*.\n\n\"...Sigh.\"\n\nHe'd lost count of how many times he'd sighed. Had to be over a hundred.\n\nBut he hadn't stopped. Hadn't walked away. Through the chaos, Grid had finished the job.\n\nThen the windows came.\n\n> **[The Legendary Blacksmith's Patience skill has been activated. Concentration, stamina and defense will rise to the extremes for one hour.]**\n\n> **[The Legendary Blacksmith's Breath has increased the effectiveness of your production items.]**\n\nGrid stared at the notifications.\n\nHe didn't know whether to laugh or cry.\n\nThe item screen loaded.\n\n> **[<span class=\"rarity-legendary\">Indecisive Mumud's Orb</span>]**\n> \n> **Durability:** 311/311  \n> **Magic Damage:** +34%  \n> **Magic Casting Speed:** +23%  \n> **Number of spells that can be stored:** 4\n> \n> * You can permanently store one spell at or below S-grade.\n> * 15% reduction in skill cooldown time.\n> * There is a certain chance that magic damage will decrease by 50%.\n> * There is a certain chance that magic damage will increase by 100%.\n> * When using possessed magic, there is a certain chance of the effect halving or doubling.\n> \n> Among the items made by the great blacksmith 'G,' this is the third piece born with emotions. It has been affected by the indecisiveness of its creator. Due to the emotional ups and downs, it might not work properly or perform better than expected.\n> \n> The compatibility with its creator will differ depending on its mood on the day.\n> \n> **User Restriction:** Level 280 or higher. More than 3,000 Intelligence. Advanced Orb Mastery Level 5.  \n> **Weight:** 150\n\n> **[A legendary rated item was produced, so all stats have permanently risen by +10 and reputation throughout the continent has risen by +500.]**\n\n\"...Is this okay?\"\n\nGrid picked up the orb. Turned it over. The blue crystal caught the dawn light and scattered it in prismatic shards across the walls.\n\nThe base stats were incredible. Legendary Blacksmith's Craftsmanship boosted performance by **18%**. Legendary Blacksmith's Breath added another **8%**. The orb's magic damage and casting speed were off the charts.\n\nBut that random variance.\n\n*50% decrease.*\n\nWhat if Euphemina cast her strongest spell and it fizzled? What if she stored Meteor and it came out as a firecracker?\n\n*How is she going to react to this?*\n\nGrid set the orb down gently. Even with a legendary rating, he felt uneasy.\n\nHe didn't know.\n\nEuphemina's <span class=\"rarity-epic\">Competitor</span> title had unlocked the **Good Luck** stat months ago. Random effects bent in her favor. Always had. Always would.\n\n***\n\n\"Amazing...\"\n\nEuphemina cradled the orb like a newborn.\n\nHer hands trembled. Tears welled up, spilled over, tracked down her cheeks.\n\nThe reaction was instant. Primal. The orb Grid produced didn't just meet her expectations.\n\nIt *shattered* them.\n\nAnd that random modifier? The emotional instability of the creator bleeding into the item?\n\n*It's made for me.*\n\nHer <span class=\"rarity-epic\">Competitor</span> title would turn every coin flip into heads. The 50% penalty would never proc. The 100% bonus would fire constantly.\n\n\"Thank you...\"\n\nHer voice cracked. The joy was deeper than discovering the Siren Kingdom. Rawer.\n\n\"I'm really grateful. Encountering you was the best luck I ever had.\"\n\nEuphemina smiled through the tears, nose running, face blotchy.\n\nGrid saw her without the mask for the first time. No manipulation. No calculation.\n\nJust genuine, overwhelming gratitude.\n\n\"What... why are you crying?\"\n\nGrid's jealousy evaporated. Gone like morning dew.\n\n***\n\nThat day, Grid achieved two milestones.\n\nHe learned how to forge *practical* legendary items. And he finally broke the \"Believe in me\" curse.\n\nEuphemina became a slave to the power of Overgeared items.\n\nHuroi and Lauel welcomed their newest guild member with open arms.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** [Glossary Link]\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}