{
  "id": 193,
  "title": "Chapter 193",
  "content": "# Chapter 193\n\nSatisfy launched one year and eight months ago. Since that first day, Euphemina logged in for more than fourteen hours every single day. No breaks. No exceptions. She burned through nineteen, then twenty. The supposedly precious years of her youth, gone.\n\nMost people would call it a waste. Those days would never come back, they'd say. But Euphemina had no regrets. Satisfy gave her something her empty house never could. Joy. Purpose. A world where she wasn't alone.\n\nAnd today, in that world, she finally found someone worth admiring.\n\nGrid.\n\n*He can produce legendary items.*\n\nLevel 283. Hundreds of quests cleared. Countless monsters slain, bosses raided. And in all that time, Euphemina had never seen a legendary item. Unique rating was the ceiling. Legendary gear existed only in rumors and fairy tales.\n\nShe'd asked Grid to make a unique rated orb. That alone would have been enough.\n\nBut he made a legendary one instead.\n\nThe result sat in her hands now, almost too perfect to be real. It felt like a dream. Like Grid himself was glowing.\n\n*Grid. You're the god in my heart from this moment on.*\n\nHer chest felt tight with elation.\n\nLauel's whisper cut through her thoughts. \"If you become Grid's subordinate, you will be able to get more magnificent items like this orb.\"\n\n\"...\"\n\nThe devil's bargain. Impossible to refuse.\n\nEuphemina became Grid's subordinate.\n\n***\n\n\"You can use this room in the future.\" Lauel gestured around the space. \"You will normally have freedom, and only have to follow Grid when there is a specific mission.\"\n\n\"I understand.\"\n\n\"Then I will be going. Huroi and I have to accompany Grid to Bairan.\"\n\nWinston Castle. Her new quarters.\n\nEuphemina surveyed the room as Lauel left. Moderately large. A window overlooking a garden and wide sky. But the best part was its proximity to Grid's bedroom.\n\n\"Hihit.\"\n\nThe laugh escaped before she could stop it. After so long playing solo, she finally had colleagues. She could see Grid every day. Adventure alongside him. The thought made her pulse quicken.\n\nShe shook her head. *Focus.*\n\n\"First of all, I need to permanently store a spell on my orb.\"\n\nThe legendary rating meant she could bind an S-grade spell to it. Euphemina pulled up her skills list. The S-grade magic she'd duplicated and stored appeared in a separate category.\n\n> **[Demon King's Tail Lv. 2]**\n> \n> Can burn up to 16 people.\n> \n> Deals **2,509** fixed fire damage per second for up to 4 seconds.\n> \n> Skill Range: 10m radius\n> \n> Skill Mana Cost: **3,200**\n> \n> Skill Cooldown Time: 15 minutes\n\n> **[Fluid Escape Lv. 1]**\n> \n> The soul and body of the caster will be separated for 3 seconds.\n> \n> The caster can control the soul that emerged from the body, while the body will be immune to all damage.\n> \n> The soul can deal **1,030** + (half of the caster's current magic power) damage to all targets in the way.\n> \n> As soon as the soul returns to the body, a shockwave will be generated, pushing all nearby enemies back.\n> \n> Skill Mana Consumption: **65%** of your current mana\n> \n> Skill Cooldown Time: 1 hour\n\n> **[Storm Gravity Field Lv. 1]**\n> \n> Installs a gravity field 5m in diameter at the specified location. It will take 1.2 seconds to install and all objects trapped in the gravity field will be suppressed for 2 seconds. After that, the raging storm will deal **8,600~15,900** damage.\n> \n> Skill Range: 20m radius\n> \n> Skill Mana Cost: **2,500**\n> \n> Skill Cooldown Time: 18 minutes\n\n> **[Carshian's Fury Lv. 2]**\n> \n> Shields the caster with a fire shield.\n> \n> The shield absorbs a total of **15,000** damage and will return half of the absorbed damage back to the opponent.\n> \n> Physical defense and magic resistance will increase by **20%**, and fire resistance by **99%** while the shield is active.\n> \n> Skill Mana Cost: **3,000**\n> \n> Skill Cooldown Time: 20 minutes\n\nS-grade magic required level 280 minimum, plus other brutal conditions. And the spellbooks themselves were rare as hell. Among all users and NPCs, only a handful had acquired S-grade magic.\n\nEuphemina's collection was limited. But she wasn't disappointed.\n\nFluid Escape alone made up for everything. A fraudulent spell that dealt magic power-scaled damage while making her body invincible. The hallmark of a true great magician.\n\nShe'd stalked Earl Ashur for a month just to duplicate it. The memory made her wince. She'd cherished the spell so much that she never used it, even in life-or-death situations. Storing it in the orb felt like the right choice. No hesitation.\n\n> [Do you want to attribute the spell 'Fluid Escape' to the <span class=\"rarity-legendary\">Indecisive Mumud's Orb</span>?]\n\n\"Yes.\"\n\n> [The spell can't be released when attached to an item. Do you still want to progress?]\n\n\"Yes.\"\n\nThe blue orb flared with light.\n\n> [The skill 'Fluid Escape' has been removed from the Duplicator's skills list.]\n\n> ['Fluid Escape' now belongs to the <span class=\"rarity-legendary\">Indecisive Mumud's Orb</span>.]\n\nBururu.\n\nEuphemina's body trembled as she confirmed the result. Her cheeks flushed. She stroked the orb with reverent fingers.\n\n\"Beautiful. This is too good.\"\n\nShe finally owned something this incredible. The reality of it hit her. She equipped the orb to feel the full weight of that truth.\n\n> [You have equipped the <span class=\"rarity-legendary\">Indecisive Mumud's Orb</span>.]\n\nThe standard notification appeared.\n\nThen another one followed.\n\n> [Your position has been revealed to someone. You won't be able to escape from the eyes of surveillance.]\n\n\"Huh?\"\n\nEuphemina blinked. *What does that mean?*\n\nUnderstanding clicked into place. \"My position is being delivered to Grid.\"\n\nThat made sense. Grid crafted the orb. A legendary item could easily have built-in features like that. She dismissed the thought and rushed to the mirror, admiring how the blue sphere looked in her hands.\n\nBut the truth was different.\n\nThe eyes watching her didn't belong to Grid.\n\nAt the same time, in one of the twenty-seven golem labyrinths scattered throughout the continent, a voice echoed through ancient stone corridors.\n\n> [I finally found it.]\n\nThe great magician Braham's words rang with satisfaction. He issued a command to thousands of golems.\n\n> [Show the fool who dared to ignore the great me.]\n\nKuuong! Kuuong!\n\nEvery type of powerful golem moved in unison. Slowly but surely, they converged on a single destination.\n\nSoon, this scene would be captured by users across the world. Another wave was coming to Satisfy.\n\n***\n\n\"What?\"\n\nBairan Castle. Grid's words landed like a bomb.\n\nThe Tzedakah Guild members gathered in the meeting room didn't look happy.\n\nToban leaned forward. \"Are you serious about withdrawing from the guild?\"\n\nGrid nodded. \"Yes.\"\n\n\"Why all of a sudden?\"\n\nIbellin spoke up. He shot a glare at Lauel. \"What did that guy say to mislead Grid?\"\n\nAs one of the 10 Rookies, Ibellin had a fierce rivalry with Lauel. He growled every time they met. Lauel usually ignored him.\n\nNot this time.\n\nLauel's gaze shifted to Ibellin. \"Are you saying that Grid is an idiot who would be swayed by my words?\"\n\nTwitch.\n\nHuroi's eyes narrowed from where he stood silently behind Grid.\n\nIbellin sputtered. \"W-What? What kind of leap is that? That isn't what I meant!\"\n\n\"Quiet.\"\n\nJishuka stepped forward. Her folded arms emphasized her figure as she stared Grid down.\n\n\"Why do you want to leave?\"\n\nGrid kept it simple. \"I want to become a lord.\"\n\n\"Why?\"\n\n\"You're asking why?\" Grid made a coin shape with his fingers. No point sugarcoating it. \"Because of money.\"\n\nNow they understood. The taxes collected from Bairan after its promotion to city status were massive. Anyone would feel greedy. Especially Grid, who only played for profit.\n\nJishuka tried a different angle. \"Can't you be a lord even if you belong to the guild?\"\n\nShe didn't want Grid to leave. Personal feelings aside, he was one of their strongest assets.\n\n\"Well, that...\" Grid fumbled for the words.\n\nLauel stepped in. \"In order to become a lord, a certain position is required. It isn't enough to be a viscount. Grid is only a member of the guild, but he also has a lot of subordinates. Therefore, he can't be left as a guild member of the Tzedakah Guild.\"\n\nGrid nodded. \"That's what I was trying to say.\"\n\n\"...\"\n\nThe Tzedakah Guild members' stares turned cold. They didn't like Lauel encouraging Grid to cut ties with his companions. It looked like he was trying to separate them from Grid.\n\nOnly Faker watched Lauel with an approving expression.\n\n*Indeed. He fills everything that Grid is lacking.*\n\nIt was impressive. The other guild members were too jealous to see it. But Faker knew. Someday they would recognize Lauel's value.\n\nJishuka made an offer. \"Grid, if it's just money, I will give you the taxes from Bairan. So why don't we stay like this?\"\n\nThe taxes from Bairan were shared fairly between guild members. Now she was offering to cut them out and give everything to Grid. A shocking proposal.\n\nThe other members showed no dissatisfaction despite Jishuka deciding unilaterally. Grid was worth it. They'd already made bank betting on him in the National Competition.\n\nLauel wanted to curse. *He's going to accept. I know it.*\n\nBut Grid's response surprised everyone.\n\n\"I don't want to.\"\n\n\"...?\"\n\nDidn't Grid need money? Hadn't he been losing hair over debt recently? Then why refuse so easily? Even Huroi and Lauel looked stunned.\n\nGrid continued. \"I can't be satisfied with just the taxes of one city.\"\n\n\"...\"\n\nBairan had grown into the third largest city in the north after the National Competition. And it wasn't enough?\n\nJishuka's eyes widened. \"Grid, perhaps you...\"\n\nGrid was aiming higher.\n\nThe realization hit her as Grid spoke.\n\n\"The minimum of what I want is a territory the size of Winston. That is the starting point.\"\n\nHuroi and Lauel asked him to be king. He would claim it before the two billion users of Satisfy. The thought consumed him. Why? Because it was a chance to become the richest man on Earth.\n\nGrid locked eyes with Jishuka. \"Take the kids and come under me.\"\n\n\"Huh!\" Jishuka's mouth fell open. He wanted to swallow the elites in the top 100 of the unified rankings all at once? \"A complete thief.\"\n\nNo better description existed."
}