{
  "id": 194,
  "title": "Chapter 194",
  "content": "# Chapter 194\n\n\"Jishuka, take the others and come under me.\"\n\nGrid's words landed like a stone. Lauel's face twitched. A whisper notification blinked in Grid's vision.\n\n*-Grid, what did you just say?*\n\nGrid frowned. *-What's wrong?*\n\n*-Your way of talking is completely wrong!*\n\nLauel's message practically radiated frustration. The Tzedakah Guild wasn't some random group of newbies. They'd been together since L.T.S., six years of history built on pride and skill. Small in number, but elite. Top-tier players who'd reigned at the peak of the rankings. And Grid just told them to \"come under\" him? Like servants? Like subordinates?\n\n*-You need to negotiate. Show respect. Then convince them to cooperate. Do you honestly think they'll just roll over because you ordered them to?*\n\n\"...\"\n\nThe realization hit Grid like cold water. He replayed the words in his head, this time from their perspective.\n\n*Disgusting.* The thought made his stomach turn. *Isn't this exactly what Lee Junho did to me?* That bastard in high school who'd made Grid his errand boy, his bread shuttle, just because he had more social power. *I chose the wrong words. Completely wrong.*\n\nBut no. It was worse than that. These weren't strangers. Grid had fought beside the Tzedakah members. Bled with them. Shared meals, shared victories, shared the weight of impossible odds. He'd started thinking of them as friends. As equals. As comrades.\n\nAnd then he'd just told them to get under him. Like they were servants.\n\nGrid's jaw clenched. *How could I treat them like this?*\n\nHe'd been giving them items. Equipping them. Empowering them. Had that twisted something in his head? Had he started seeing them as lesser? As dependents?\n\n*I'm better than them. I have more fame.*\n\nThe thought surfaced unbidden, and Grid hated himself for it. Was he ignoring them? Just like those alumni had ignored him? Looked down on him? Dismissed him as worthless?\n\n*Dammit! Just now, at the National Competition, I realized I was fighting for my companions!*\n\nGrid had grown. He knew that. The petty, desperate scavenger who'd first logged into Satisfy was gone. He'd matured. He'd changed.\n\nBut \"mature\" was relative. Mature compared to his old self? Sure. Actually mature? The evidence said otherwise. Just last night he'd been jealous of Noe's popularity and posted malicious comments about his own pet on the forums. His personality was still a work in progress. Years of poverty and powerlessness had left marks that wouldn't fade in a few months.\n\nBut.\n\n\"I'm sorry.\" Grid's voice cut through the awkward silence. \"I'll correct what I just said.\"\n\nIf nothing else, Grid tried. That had always been his one redeeming quality. In school, he'd clawed his way to mediocrity through pure effort despite having no natural talent. In Satisfy, he'd become the first legendary class the same way: grinding, failing, trying again.\n\nHe could do this too.\n\n\"Let me say it properly this time.\" Grid met Jishuka's eyes, then looked at each guild member in turn. \"Please join the guild I'm going to create. I want to keep fighting beside you. I need your strength. And I'll give you mine in return. Let's build something together. A country. A kingdom. I see you as friends. As equals. So please.\"\n\nGrid bowed. Deeply. His forehead nearly touched his knees.\n\nThe stiff, offended expressions around him gradually softened.\n\nJishuka studied him for a long moment. \"Give us time to discuss it.\"\n\n***\n\n\"What should we do?\"\n\nGrid had returned to Winston to avoid hovering over them. Now the Tzedakah Guild huddled together, voices low.\n\n\"Grid is necessary.\" Pon leaned against a pillar, arms crossed. \"Not just as a blacksmith. As a warrior too. He's strong. We can't afford to lose him.\"\n\n\"Agreed,\" Zednos said. \"But can Grid actually lead a guild?\"\n\nThe question hung heavy. Leadership required charisma. The ability to inspire loyalty or command respect. Not everyone had that gift.\n\nThe Tzedakah Guild had stayed small for exactly that reason. They lacked a true leader. Everyone in the room was a top-tier individualist, built for solo glory or small-team tactics. None of them had the temperament to manage a large organization. Even Jishuka, for all her skills, could only command their current seventeen members effectively.\n\nGrid was stingy. Jealous. Motivated primarily by money. Could someone like that lead?\n\n\"And he wants to become a king?\" Vantner shook his head. \"That's delusional.\"\n\n\"Lauel is clever,\" Regas pointed out. \"He can compensate for Grid's lack of strategic thinking. But intelligence alone doesn't build an organization. You need presence. Authority.\"\n\n\"Exactly.\" Vantner nodded. \"If Grid creates a guild, it'll collapse within six months.\"\n\nThe consensus seemed clear. Better to be a skilled officer in a small guild than a grunt in a doomed larger one.\n\nThen Toban spoke up.\n\n\"Grid is a natural leader.\"\n\nEvery head turned. Stares locked onto the chief of staff, the man who'd once been Grid's slave during that humiliating quest. The same Toban who'd resented Grid initially but had slowly become his most vocal supporter.\n\n\"What kind of nonsense is that?\" someone muttered.\n\nToban remained calm. \"What does a leader need to do? Unite the organization. Drive it forward. Make it grow. Grid has something that can replace traditional leadership.\"\n\nMurmurs spread through the group.\n\n\"Replace leadership? What does that even mean?\"\n\n\"I can't figure it out.\"\n\nToban offered a hint. \"Don't forget that Satisfy is a game.\"\n\n\"Ah!\" Jishuka and Pon got it simultaneously. \"Items!\"\n\nToban smiled. \"Exactly. What's the core desire in any game? Getting stronger. Better gear. Grid can fulfill that need. As long as he crafts equipment for guild members, they'll never betray him. And Grid will evolve while working to support them.\"\n\nThe reason the Tzedakah Guild wanted to keep Grid wasn't complicated. It was his production ability. His items. That simple.\n\n\"In Satisfy, at least, Grid is qualified to lead.\"\n\n\"If he rewards high-performing members with custom gear...\" Jishuka's eyes widened. \"They'd never leave. They'd fight to stay in his favor.\"\n\n\"And they'd grow stronger in the process,\" Toban finished. \"An elite force, all equipped with Grid's creations.\"\n\n\"Just like us,\" someone whispered.\n\nThe logic clicked into place. Lauel wouldn't have attached himself to Grid without a reason. The strategist clearly saw the potential: the strongest guild in Satisfy, built on a foundation of legendary-tier equipment.\n\n\"Lucky for Grid that he has Lauel,\" Jishuka said. \"With that brain backing him up, Grid can stay at the top.\"\n\nPagma's Descendant was currently the strongest known class. But there were nine legendary classes total in Satisfy. As a production-focused class, Pagma's Descendant was inherently weaker in direct combat than pure combat legendaries.\n\nIf Grid played solo forever, eventually he'd hit a wall. Someone with a combat-focused legendary class would surpass him.\n\nBut if Grid owned the strongest guild? The strongest guild that only he could create through his items? That changed everything.\n\n\"Why don't we join him?\" Regas straightened. \"We've hit our limit for expansion anyway.\"\n\n\"I'm in,\" Vantner said. \"I don't want to watch Zibal or Chris slowly devour this continent while we sit here.\"\n\n\"Satisfy isn't like L.T.S.,\" another member added. \"Small elite teams can only do so much here. Better to be part of a larger force.\"\n\n\"I can never escape Grid's items anyway.\" Jeep grinned. \"I absolutely want his gear.\"\n\nThe decision crystallized. Unanimous.\n\nJishuka stood. \"Today, the Tzedakah Guild disbands. All twenty-one of us join Grid.\"\n\nThey'd been the strongest in L.T.S. They'd dreamed of reclaiming that title. To achieve those dreams, they chose Grid.\n\nGrid had just swallowed the most elite force in the Eternal Kingdom. For free.\n\nIt was an event that would echo through Satisfy's history.\n\n***\n\nThe dominant guild in the Eternal Kingdom was, without question, the Giant Guild. The Tzedakah Guild had its reputation as a small group of elites, but that couldn't compare to Giant's raw numbers. Over seven hundred members. A force that could genuinely challenge the Snake Guild's expansion in the Haken Kingdom.\n\n\"A golem army?\"\n\nChris stared at the report. Pedro City, southern Eternal Kingdom. His city.\n\n\"Over a thousand golems advancing toward the kingdom.\"\n\n\"What magician controls a thousand golems?\" Chris's voice carried disbelief. \"Even if every great magician on the continent pooled their power, it wouldn't be possible. This is ridiculous.\"\n\nThe golems weren't wandering aimlessly either. They moved with purpose. Direction. Someone was controlling them.\n\nZirkan, one of the seven Giant Guild captains, met Chris's skepticism with a grim expression. \"The information is confirmed. The golems are moving toward the Eternal Kingdom. Based on their trajectory, the south will be hit first.\"\n\nAsellas, another captain, added, \"The king will issue a defense quest soon.\"\n\nChris's doubt faded. His expression shifted to something sharper. Hungrier.\n\n\"This is an opportunity.\"\n\nA thousand golems? So what? Slow masses of rock and metal. The Giant Guild would crush them, raise the guild's reputation, and rack up kingdom contribution.\n\n\"This is how I become an earl.\"\n\nThe National Competition defeat to Regas still stung. The loss had shaken the Giant Guild's morale, sent them spiraling toward decline. But Chris had rallied them. His charisma, combined with the seven captains' leadership, had pulled the guild out of its tailspin. They were stronger now than before.\n\nChris was confident.\n\n\"Prepare thoroughly before the king's quest arrives. Tell the mages to store area-of-effect spells in their orbs. Distribute heavy weapons to the physical damage dealers.\"\n\nThree days later, a messenger arrived from the capital.\n\n\"By decree of the 13th King of the Eternal Kingdom, King Wiesbaden. Viscount Chris, destroy the golems that dare threaten my sacred kingdom!\"\n\n> **[Defense War]**  \n> **Difficulty:** S  \n>  \n> Precisely 1,231 golems have crossed the border of the Eternal Kingdom.  \n> Defend the kingdom.  \n>  \n> **Quest Clear Conditions:** Repel the golem army (0/1,231)  \n>  \n> **Quest Clear Rewards:** One small city. 25,000 kingdom contribution. Guild level +1. 2,000,000 gold.  \n>  \n> **Quest Failure:** The golems will advance to the capital. The kingdom will fall into chaos.\n\nThe rewards were staggering.\n\nChris's blood heated. *Zibal, you won't be the first user to become an earl. I'll also be the first to reach one thousand guild members!*\n\nHe didn't doubt victory. The Giant Guild had cleared an A-grade difficulty guild quest before. An S-grade was just the next step. All he had to do was defeat the golems and claim his prize.\n\nNot a single Giant Guild member questioned their success.\n\nThree days later, breaking news flashed across every gaming network worldwide.\n\n*『Several days ago, golems gathered from across the continent and advanced into the Eternal Kingdom. The Giant Guild moved to intercept them...』*\n\nIt was a massacre.\n\nThe Giant Guild managed to destroy three hundred golems. Just three hundred out of 1,231.\n\nThe southern Eternal Kingdom burned.\n\nChris stood amid the ruins of Pedro, watching flames consume everything he'd built over the past year and a half. A small village when he'd first claimed it as a viscount. Now a thriving city. Or it had been.\n\nCollapsed buildings. Thousands of NPC residents reduced to gray particles of light. Damage that would take months, maybe years, to repair.\n\n\"How... how did this happen?\"\n\nHe had no answer. No time to process. The golems marched north, trampling through the capital on their way to their true destination.\n\nThe northern Eternal Kingdom.\n\nThe great magician Braham had orchestrated this entire invasion for one purpose: to capture Grid's attention.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}