{
  "id": 195,
  "title": "Chapter 195",
  "content": "# Chapter 195\n\nNews had moved to smartphones decades ago, yet newspapers clung to life through a stubborn readership. In the packed subway cars, commuters clutched various publications. Different mastheads, different political leanings, but the same headline plastered across every front page.\n\n**[The Golem Army's Attack on the Eternal Kingdom!]**\n\nOne month since the National Competition. Satisfy had been quiet. No major incidents beyond Kraugel becoming the first user to reach a third advancement class.\n\nThe internet exploded.\n\n*-Why the Eternal Kingdom? They're neutral. Who would attack them?*\n*-What kingdom deployed the golems?*\n*-There are 17 kingdoms on the continent. Neutral doesn't mean safe when everyone has their own interests.*\n*-To control that many golems, you'd need dozens of great magicians working together. No single country has that capability.*\n*-So multiple kingdoms formed an alliance to attack the Eternal Kingdom?*\n*-Is this leading to a massive episode?*\n*-Golems are still just golems, no matter the numbers. How did they wipe out the Giant Guild?*\n\nChris sat at level 298, ranked third globally. His seven captains were all high-rankers exceeding level 260, and the Giant Guild's 700 members averaged level 180. The idea that over 1,000 golems—capped at level 200—could one-sidedly massacre them defied belief.\n\nAs confusion mounted, footage began circulating worldwide.\n\n> **『 This is video from the Eternal Kingdom war, just obtained. Watch this and you'll understand the severity of the kingdom's crisis. 』**\n\nThe screen shifted.\n\n\"Through this war, our Giant Guild will advance to the next level. Record this glorious moment.\"\n\nChris addressed the camera directly.\n\n**Kuuong! Kuwuong!**\n\nMassive footsteps shook the ground, rumbling from the distant horizon. The camera swung toward the sound, following Chris and his guild members' stares.\n\n**Kuoooh!**\n\nOne. Two. Three. Tens. Hundreds. Over 1,000 golems marched forward in a slow, inexorable advance. They stretched across the horizon like a mountain range.\n\nTheir sizes varied wildly. The names were unusual. Roughly 1,000 \"old golems\" that resembled standard models. Two hundred smaller golems with human proportions called \"soul dolls.\" And twelve colossal figures—towering 8 meters high, 4 meters wide—designated as \"ancient weapons.\"\n\n\"Those names.\" Chris's voice carried an edge. \"Based on the names alone, they're stronger than standard golems. Especially those massive ones and the human-shaped variants.\"\n\nAsellas stepped forward—one of the seven captains, a magician specializing in petrification. \"The humanoid golems look problematic. We should eliminate them first.\"\n\nGolems possessed high physical defense and health pools but were vulnerable to magic and slow-moving, making them manageable. If these humanoid variants retained golem durability while moving quickly, they'd be nightmares to fight.\n\nThe logic convinced Chris. \"Understood. Target the humanoid golems.\"\n\n\"Yes!\"\n\nA brilliant magical barrage erupted. Asellas and 200 magicians unleashed their most devastating spells at the humanoid golems.\n\n**Kwa kwa kwa kwang!**\n\nExplosions tore through the wilderness. Dust clouds billowed skyward. The camera feed blurred to near-opacity. Surely such overwhelming magical bombardment had obliterated the 1,000 golems.\n\nBut then—\n\n\"What...?\"\n\nThe dust settled. Everyone froze. The golem army stood completely intact. The magical assault from Asellas and the guild's entire magical division hadn't scratched them.\n\nAsellas's face drained of color. \"Anti-magic Shield...?\"\n\nAnti-magic Shield blocked all forms of magic—a perfect counter to spellcasters. Classified as S-grade magic, it wasn't something just anyone could cast. Yet the golems were deploying it.\n\nAsellas stared at the pink translucent barriers radiating from the twelve super-sized golems.\n\n\"No way. How is this possible?\"\n\nGolems using magic? S-grade magic at that? The Giant Guild couldn't process it. Asellas and the other magicians' morale shattered.\n\n\"I used all my mana...\"\n\n\"Emptied my orb's storage...\"\n\n\"We couldn't even scratch them...\"\n\n\"How do we fight golems immune to magic?\"\n\nThe Giant Guild's fighting spirit collapsed. The golem army continued its relentless advance. Chris barked orders. \"Change targets! Focus on the super-sized golems!\"\n\nThe magicians were useless while the Anti-magic Shields held. Chris decided to eliminate the shield-generators first, but executing that plan proved impossible.\n\n**Kuwaaah!**\n\nPhysical damage dealers and tanks charged the massive golems, but the old golems intercepted. They resembled standard models, but their performance didn't match.\n\n\"Damn things!\"\n\nChris and the damage dealers attacked with oversized weapons. The golems' defense defied expectation. Strikes that should have connected bounced off armor harder than the toughest iron golem.\n\nChris realized they were in deep trouble. He unleashed his strongest technique to crush a single golem.\n\n> [You have destroyed an old golem.]\n> \n> [350,300 experience has been acquired.]\n\nWhen a monster type was hunted, its details became available through the system. Chris pulled up the old golem's information.\n\n> **[Old Golem]**\n> \n> Level: 240\n> \n> A relic of the past. Made of volcanic rock mixed with black iron, harder than iron golems. No existing magician can produce golems of this caliber.\n\n*Dammit!*\n\nStandard golems ranged from level 50 to 200. These old golems sat at 240. Not a threat to Chris or the seven captains, but far too tough for regular guild members.\n\nChris shouted across the battlefield. \"Form groups of three! Three per golem!\"\n\nThe Giant Guild averaged level 180. He calculated three members could take down one old golem. But the old golems weren't the problem. The real crisis began when the 200 humanoid golems entered the fight.\n\n**Pepeok! Kwakwang!**\n\n\"Kuak!\"\n\n\"H-Hik!\"\n\nGuild members logged out under the swift, precise attacks of the humanoid golems. Chris, rattled, ordered his captains. \"We'll mark the humanoid golems! Kuk!\"\n\nThe humanoid golems' strength exceeded all logic. Fast wasn't enough to describe them—their combat skills were refined. Some fought like martial artists with fists and feet. Others weaponized their own bodies like swords or spears. Even the seven captains struggled against two or more simultaneously.\n\nThere were 200 of them.\n\n**Kwajak!**\n\nChris destroyed a humanoid golem and checked its details.\n\n> **[Soul Doll]**\n> \n> Level: 280\n> \n> A battle doll housing a captured warrior's soul. The ego is lost, but the soul retains its original combat techniques.\n\n*What fraudulent—!*\n\nThe soul dolls matched field boss strength. What kind of magician created these monstrosities? Chris's skin crawled. The battlefield turned against them. Magic shields were worthless against Anti-magic Shields. Most guild members were pinned down fighting old golems.\n\nThe seven captains couldn't handle the soul dolls' coordinated assaults. Less than ten minutes into the battle, half the guild members had logged out.\n\n*It's over.*\n\nThis S-rank guild quest defied all logic. Chris accepted the truth and roared in defiance. \"You damn scrap heaps! I'll smash one more before I die!\"\n\nSoul dolls converged from every direction. Chris swung his greatsword in wide arcs. The third-ranked user didn't fall easily. Time crawled forward. All his guild members logged out, but he endured, destroying hundreds of golems. But he wasn't invincible. Eventually his stamina depleted. He fell. Then he could only watch helplessly as the golems reduced Pedro to rubble.\n\n***\n\nThe war footage cut back to the news studio. Hosts and analysts wore grim expressions.\n\n> **『 Chris's loss to Regas was primarily due to carelessness. As he's proven now, Chris is far more powerful than his National Competition performance suggested. 』**\n\n> **『 Correct. He's stronger than Regas—not weak at all. But individual strength can't stop the golem advance. It's tragic. 』**\n\n> **『 The soul dolls are especially overwhelming. Chris only managed to defeat four. The ancient weapons are clearly extraordinary, but they didn't even engage directly. Who created these mighty golems? 』**\n\n> **『 The old golems and ancient weapons... Based on their names, they seem to be relics from the past. Perhaps the legacy of the great magician Braham. 』**\n\n> **『 Braham? Isn't that speculation? Even if Braham created these golems, what magician could control them? 』**\n\n> **『 Maybe Braham's disciple. We'll find out eventually. Right now, the critical question is whether the Eternal Kingdom can withstand this assault. 』**\n\n> **『 The Eternal Kingdom's military is formidable. That's how they maintained neutrality. But that's in human versus human warfare. Against golems, they might be helpless. 』**\n\n> **『 Then there's only one answer. Users, head to the Eternal Kingdom immediately! This is a golden opportunity for quests with massive rewards! 』**\n\nUsers and guilds were already on the move. King Wiesbaden of the Eternal Kingdom distributed widespread quests to halt the unprecedented golem advance.\n\n> **[Fight the Golems]**\n> \n> Difficulty: B~S\n>\n> The Giant Guild bravely engaged the golems that crossed the Eternal Kingdom's border but were ultimately defeated. The southern territories have been destroyed and the golem army advances toward the capital.\n>\n> King Wiesbaden senses the crisis and has summoned troops from across the kingdom. He requests your cooperation.\n>\n> Quest Clear Conditions: Repel the golems.\n>\n> Quest Clear Rewards:\n> - Defeating an old golem: 300 gold and 100 kingdom contribution\n> - Defeating a soul doll: 1,000 gold and 500 kingdom contribution  \n> - Defeating an ancient weapon: 3,000 gold and 1,500 kingdom contribution\n\nOne hundred gold equaled 120,000 won. Additionally, accumulating 3,000 kingdom contribution granted baron status, while 10,000 secured a viscountcy. From the users' perspective, refusing this quest made no sense. From across the continent, tens of thousands of users converged on the Eternal Kingdom's capital.\n\n\"Everyone! Form parties! We need parties to defeat the golems!\"\n\nIn Satisfy, parties capped at 24 members. Users organized quickly and marched to war. But could regular users handle soul dolls that challenged even the Giant Guild's seven captains? The defense proved futile.\n\nMost parties barely managed to destroy one or two old golems before the soul dolls annihilated them. The Anti-magic Shields prevented magicians from contributing, and the battlefield tilted toward disaster.\n\nThen—\n\n**Kuweeeeeoh!**\n\nHundreds of users logged out when an ancient weapon casually fired a massive beam of magical energy. The Eternal Kingdom faced its darkest hour. Users refused to continue throwing themselves at the grinder, forcing the kingdom to rely on its own soldiers.\n\nKing Wiesbaden raged. \"What wicked person? Why? What purpose justifies inflicting this trial upon my kingdom?\"\n\nMeanwhile, in a grocery store within the capital, two girls struggled through a packed crowd, barely accomplishing anything.\n\n\"I picked this place because it's supposed to be the easiest starting location, but what is this? We can't hunt because of these giant rocks. We're just wasting our capsule room booking time.\"\n\nThe complaining girl's ID read 'Sexy Schoolgirl'—a fairly juvenile name, though her face was genuinely pretty. Actually sexy, even. Her real name was Park Yerim. She was Grid's younger sister Sehee's best friend. Sehee stood beside her, the picture of composed neatness."
}