{
  "id": 196,
  "title": "Chapter 196",
  "content": "**Chapter 196**\n\nSehee was in her second year of high school. Unlike her peers, her world consisted of textbooks, lecture notes, and study schedules. Morning jogs and evening yoga provided her only respite from the relentless grind of academics.\n\nIdol music? Makeup tutorials? Shopping trips? The hobbies her classmates obsessed over held no appeal. Her daily route traced a simple triangle: school, library, home. Not because she loved studying. The weight of responsibility drove her forward. Every hour at her desk was an investment in her family's future, a way to support the brother who had sacrificed so much for her.\n\nThen everything changed. Her brother became the best celebrity in the world, his name synonymous with success. Money stopped being a source of anxiety. The burden Sehee had carried for years lifted from her shoulders like morning mist.\n\nShe still studied. Old habits died hard. But for the first time, a new thought crept into her mind: *Wouldn't it be nice to have a hobby?*\n\nSatisfy drew her attention. The virtual reality game had captured the world's imagination, and more importantly, it was something she could share with her brother.\n\nSaturday afternoon found Sehee standing outside a capsule room for the first time in her life, Yerim bouncing excitedly beside her.\n\nThe moment they stepped inside, heads turned.\n\n\"Hey, aren't you two really pretty?\" A university student leaned against a capsule, grinning. \"I'll play with you. Give you items, help you hunt. Just tell me your game IDs.\"\n\n\"Come sit with us.\" Another gestured to empty seats. \"I'll buy you drinks.\"\n\nThe room was packed with university students. Most working adults owned personal capsules at home, but the expensive equipment remained out of reach for those still in school. Some of these students had probably lied to their parents about attending lectures, sneaking here instead.\n\n\"Wow, that uniform! Young Ladies High School?\"\n\n\"Isn't that school ranked in the top ten? Pretty *and* smart.\"\n\n\"A Young Ladies High School student. Please marry me?\"\n\nSehee's jaw tightened. *How cheap.*\n\nYerim assessed the nerdy university students with the calculating gaze of a predator sizing up prey. Her eyes glittered. *I could milk these idiots for items and capsule fees.*\n\nA smile curved her lips as she shifted her posture, adopting the deceptive charm she wielded like a weapon.\n\nSehee caught the movement. She grabbed Yerim's wrist. \"Just ignore them.\"\n\nMen were all the same. Except for her father and brother, Sehee had no use for them. Her beauty attracted attention like honey drew flies, and she found it equally annoying.\n\n\"Hrmm.\"\n\nIn the past, Yerim would have disregarded Sehee entirely, gleefully manipulating the university students for sport. But circumstances had changed.\n\n*Can't clash with my future sister-in-law.*\n\nYerim followed Sehee's lead without protest.\n\nThey settled into their capsules and connected to Satisfy. The character creation screen prompted them to select a starting city. Sehee chose Reinhardt, capital of the Eternal Kingdom.\n\nVirtual reality hit them like a tidal wave.\n\nYerim moved her body experimentally, marveling as clean air filled her lungs. The sensation was *real*. All five senses engaged perfectly, indistinguishable from physical reality.\n\n\"What's the deal?\" Yerim stretched, testing her virtual muscles. \"Why not tell your brother we started playing? Wouldn't it be easier to play together?\"\n\n\"If he finds out, he'll order a capsule for me.\" Sehee examined her starting equipment, shabby cloth armor and a wooden training sword. \"I already rejected his offer once.\"\n\nYerim's eyes went wide. \"Youngwoo is amazing. What kind of brother buys his sister a ten-million-won machine? That's on a completely different level from mine.\" She tilted her head. \"But I don't get it. If your brother wants to buy it, why not accept? Why refuse?\"\n\nThe question touched something deeper in Sehee. She stared at the cobblestone street beneath her feet.\n\n\"I don't want to spend his money just because he's earning it.\" Her voice was quiet. \"I want him to value what he has. To save for the future.\"\n\nSatisfy's popularity seemed unshakeable. But nothing lasted forever. What if a bigger, better virtual reality game launched someday? Her brother's income would plummet. Sehee hoped he would learn to think ahead, to prepare for uncertainty.\n\n\"A capsule is a luxury. Once I get a job and buy one with my own money, *then* I'll tell him I'm playing.\"\n\nYerim clicked her tongue. \"Amazing. You're too virtuous for your own good.\"\n\n*Marrying Youngwoo means dealing with Sehee as a sister-in-law. How exhausting.*\n\nThey opened the map and began exploring Reinhardt. The capital sprawled before them, vast and beautiful. Medieval architecture that would cost hundreds of millions to recreate in a film stretched in every direction. There was too much to see, too much to absorb. Time slipped away unnoticed.\n\n\"Look at those girls. They're gorgeous.\"\n\n\"Isn't the Oriental one white? No, they're both whiter than white. Like milk. Flawless skin.\"\n\n\"Complete noobs. Maybe we can befriend them if we help with a quest.\"\n\nA trail of male users followed in their wake. Two stunning girls walking side by side naturally attracted attention. Yerim's ID didn't help matters.\n\n*Sexy Schoolgirl.*\n\n*Her username is actually Sexy Schoolgirl.*\n\n*Oh god.*\n\nThe men gulped audibly, their serpentine gazes fixed on the pair.\n\nSuddenly, quest windows materialized before every player in the vicinity.\n\n> **[Fight the Golems]**\n>\n> **Difficulty:** B~S\n>\n> **Quest Clear Conditions:** Repel the golems.\n>\n> **Quest Clear Rewards:**\n>\n> * Old Golem: 300 gold, 100 kingdom contribution\n> * Soul Doll: 1,000 gold, 500 kingdom contribution  \n> * Ancient Weapon: 3,000 gold, 1,500 kingdom contribution\n\n\"Finally. It's here.\"\n\n\"The rewards are better than expected.\"\n\n\"Which means the opponents are tough. Still, this is our chance. Time to turn things around.\"\n\nWord of the golem army's approach had spread through the capital. Users rushed toward the gates, eager to test themselves against the invasion. Meanwhile, Sehee and Yerim stood frozen, staring at the quest notification.\n\n\"I was just walking and received a quest?\" Yerim blinked. \"Is that normal?\"\n\n\"What even are golems?\"\n\n\"I've seen them in movies. Stone giants. Very solid, very strong.\"\n\n\"Can we fight them?\"\n\n\"I have no idea.\"\n\nMale users surrounded the confused girls, friendly smiles plastered across their faces. Their equipment gleamed, brilliant armor and weapons that made Sehee and Yerim's starting gear look like rags.\n\n\"Golems aren't something beginners can handle. Don't even think about leaving the city, or you'll be wiped out in two minutes.\"\n\nYerim's eyes widened, glistening like gemstones. \"Oh my, really? But the rewards are so tempting. As beginners, we don't have any chance, do we?\"\n\nHer seduction was a work of art. The male users practically vibrated with excitement, nodding so enthusiastically their heads might fall off.\n\n\"You can get the rewards if you party with us!\"\n\n\"Exactly! We'll defeat the golems. You just watch and collect!\"\n\nYerim's smile brightened. She raised one hand delicately. \"So who are the cool men willing to invite us?\"\n\n\"Me!\"\n\n\"No, Sexy Schoolgirl, come with *us*!\"\n\n\"I'm the highest level here! Join our party!\"\n\nTwenty-two users over level 150 competed to recruit two level 1 beginners. The situation escalated rapidly. Sehee sighed, her expression troubled. Yerim laughed.\n\nThe laughter died quickly.\n\nThey stood outside the gate, watching in horror as the party of twenty-two high-level men charged a massive golem. The golem's fist descended. All twenty-two died instantly.\n\n\"N-No!\"\n\n\"S-Save me!\"\n\nScreams erupted everywhere. The protection system activated for Sehee and Yerim, blurring wounds and preventing them from seeing blood splatter. Even with the filters, fear and disgust roiled in their stomachs as people died before their eyes.\n\n\"Oh god.\" Sehee bent over, nauseous.\n\nYerim grabbed her arm, and they fled back toward the city.\n\nBeginners were supposed to start slowly, hunting rabbits and deer, gradually adapting to the system. Instead, Sehee and Yerim witnessed human death within their first hour of gameplay. The shock cut deep.\n\n\"This is too cruel.\"\n\n\"What kind of terrible game is this?\"\n\nHundreds of thousands of bodies packed the capital. Users who had recognized their powerlessness and retreated. Merchants. Terrified NPCs. Other beginners. All types of people converged in a crushing mass. Sehee and Yerim struggled to move, pushed and jostled by the panicked crowd.\n\n\"We can't move. Too many people.\"\n\n\"I picked the first-ranked recommended city. Why is this happening?\"\n\nA thunderous boom split the air.\n\n**KUUONG! KUUONG!**\n\n**KWAAA KWANG!**\n\nReinhardt's ten-meter walls, imposing and ancient, crumbled under the magical energy beams fired by the ancient weapons. Stone and mortar cascaded into the streets.\n\n\"Kyaak!\"\n\n\"Run!\"\n\nSoul dolls and old golems poured through the breaches, attacking indiscriminately.\n\nThe noble armies gathered from across the kingdom resisted, but their efforts were futile. Soldiers averaged level sixty to ninety. The golems killed them in single blows. Even high-level users struggled. Unless you were a top ranker, survival became a desperate gamble.\n\nHell descended on Reinhardt.\n\nTears streamed down Sehee's face as expressionless golems methodically slaughtered screaming users and NPCs. Yerim clutched her hand, trembling.\n\n\"They're killing children.\" Yerim's voice cracked. \"Monsters. They're all monsters.\"\n\nThe golems made no distinctions. Users could resurrect, but NPCs possessed finite lives. They fled desperately through the crush of bodies, but the crowd made movement nearly impossible. Some died trampled by their own kind.\n\n\"Ahhh! Mother! Mother!\"\n\nA five-year-old child stumbled and fell, separated from his parent. Tears poured down his face as he cried out, lost in the chaos.\n\nA shadow fell across the boy's small body.\n\nAn old golem loomed over him, its massive hand rising.\n\nSehee's body moved before her mind could catch up. There was no thought, no calculation. Just instinct. *Save him.*\n\nYerim reached for her, too slow.\n\n**KUUONG!**\n\nSehee threw herself over the child, wrapping her arms around him. She squeezed her eyes shut, bracing for the impact of the golem's merciless hand.\n\nPeople watched, certain both the boy and the girl would die.\n\nBut Reinhardt was not defenseless. Knights and soldiers filled the capital. Someone always noticed citizens in crisis. Fortunately, their savior was exceptionally strong.\n\n**CHAAENG!**\n\nPhoenix, the strongest knight of the north, intercepted the blow. The <span class=\"rarity-legendary\">Sword of Self-transcendence</span> met the golem's hand with a resounding clash.\n\n\"Flee with the child!\" Phoenix's voice cut through the chaos.\n\n\"Thank you!\" Sehee scrambled to her feet, lifting the boy.\n\nNotification windows appeared in the corner of her vision.\n\n> [You are weak. Nevertheless, you possess the spirit of sacrifice to save others. You will be an example to the people.]\n>\n> [You have reached the conditions required to become the growth type hidden class **'Saintess'**.]\n\nA level one female user, willing to sacrifice herself for an NPC. If anyone fulfilled this specific condition in Satisfy, they would receive the hidden class called Saintess. The strongest healer in the game, capable of healing through innate power rather than borrowed divinity. A healing class destined to reign supreme.\n\nAnd it belonged to the younger sister of the first legendary class.\n\n*A hidden class?*\n\nSehee might be a beginner, but she understood the significance. Hidden classes were legendary.\n\nA soul doll surged toward her as she stood stunned.\n\n\"Danger!\"\n\nYerim shoved Sehee aside, placing herself between her friend and the construct.\n\nA blue greatsword fell from the sky.\n\n**PEEEONG!**\n\nThe soul doll struck by Grid collapsed, unable to withstand the shock.\n\n---\n\n**Glossary of Common Korean Terms:**\n\n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}