{
  "id": 197,
  "title": "Chapter 197",
  "content": "# Chapter 197\n\nSword of Self-transcendence.\n\nDivine Shield.\n\nThorn of Deep Grievance.\n\nLegendary Blacksmith's Hammer.\n\nFailure.\n\nRelieved Wave Armor.\n\nFantastic Pickaxe.\n\nIndecisive Mumud's Orb.\n\nEight legendary items. That was Grid's entire output since becoming Pagma's Descendant a year and a half ago. From the S.A. Group's perspective, the number was pathetically small. They'd hoped their first legendary blacksmith would demonstrate more consistent results.\n\nBut for Grid, a man who'd spent most of his life eating shit, eight legendary items felt like a miracle. *No, salvation is more accurate.* He'd reached the point where he didn't even complain about normal or rare rated drops anymore.\n\nGrid frowned at his workbench, hammer in hand.\n\nThe memory of his fifth legendary item still haunted him. That 'special event' had brought both reward and punishment in equal measure. Now, with the Indecisive Mumud's Orb fresh off his anvil, he was three items away from the next milestone.\n\n*What happens at ten?* The question gnawed at him. *Will it help me? Or will they nerf me again?*\n\nHe pictured his stat gains vanishing. Four measly points per unique item, ten per legendary. Less than what ordinary blacksmiths earned. Surely they wouldn't reduce it further.\n\n*Right?*\n\nGrid shook his head. *Think positive. Something good will happen when I make the tenth legendary item.*\n\nHe had to believe that.\n\n**Ttang! Ttang!**\n\nThe rhythmic hammer strikes echoed through Bairan's smithy. A full day had passed since his return from the vampire cities. While waiting for the Tzedakah Guild's decision, Grid poured his energy into production. The enlightenment from creating Mumud's Orb still burned fresh in his mind. He could fix the prototype's flaws, create something better.\n\nHours later, he pulled the blade from the quenching tank.\n\n> **[Mass-produced One-handed Sword]**\n> \n> Rating: Epic\n> \n> Durability: 171/171 Attack Power: 264\n> \n> Attack Speed: +8% Accuracy: +3%\n> \n> A weapon made by the legendary blacksmith G.\n> \n> A one-handed sword that can be easily used by anyone, designed to exert high attack power.\n> \n> It's an aggressive design that references Dainsleif (Reproduction), working to improve the disadvantages of the prototype.\n> \n> User Restriction: Level 300 or higher. 1,000 strength. Advanced Sword Mastery level 1.\n\n*Another failure.*\n\nThe balance was better than the prototype, sure. But those usage conditions were still too damn high. Lower than comparable weapons, yes, but Grid wanted something anyone could swing.\n\n\"Next time, I'll delete an option.\" He set the sword aside with a grunt.\n\nThose attack speed and accuracy bonuses were driving up the requirements. Simpler design. Cruder construction. Better base materials for raw attack power instead of fancy options.\n\n**Didididi.**\n\nHis alarm chimed. The real-world clock in the corner read 12:50 PM. \n\nLunch time.\n\nGrid logged out.\n\n***\n\nShin Youngwoo pulled himself from the capsule, joints popping. \n\n\"Today is kanjajang.\"\n\nHe said it to the empty apartment like it meant something. A few months ago, his choices had been cold instant noodles or cheap ramen from the convenience store. Delivered food was an unthinkable luxury when every won went to loan interest.\n\nBut now? Now he could order whatever the hell he wanted. The pricier kanjajang over regular jajangmyeon? Not even a question.\n\nYoungwoo placed the order and collapsed onto his worn sofa. His hand found the TV remote before his ass even hit the cushions.\n\n*Will the Tzedakah Guild actually join me?*\n\nThe thought made his stomach clench. They'd built up reputation, history, shared memories. Disbanding their guild to follow some paranoid asshole making demands?\n\n*I was stupid to even suggest it. Stupid to say those things.*\n\nThe odds of them actually coming to him felt microscopic. He was lucky they hadn't called him a traitor for trying to jump ship.\n\n*But Lauel told me to wait and believe.*\n\nHe had to trust that. Had to.\n\nThe news anchor's voice cut through his spiraling thoughts.\n\n『A massive gathering of 100,000 users has assembled in Reinhardt, the capital of the Eternal Kingdom, to undertake the golem subjugation quest. Additionally, nobles from across the kingdom have arrived with their armies under King Wiesbaden's direct order.』\n\n『This marks the end of the golem advance. No matter their individual strength, there are only 1,000 golems. How could 1,000 enemies possibly contend with 100,000 users and 200,000 soldiers?』\n\nThe expert's assessment seemed reasonable. Youngwoo nodded along.\n\n\"Father-in-law brought 60,000 troops. Reinhardt will be fine.\"\n\nHe hadn't bothered watching the war footage from the Giant Guild's encounter with the golems. Too busy dealing with guild politics and hammering away at his forge. He only knew the golems were marching on the capital. The numbers alone made it seem like a minor event.\n\nA cleanup operation.\n\nThen the footage started.\n\n**Kwaaaaah!**\n\nYoungwoo sat forward, noodles forgotten.\n\n\"What the fuck are these things? Why are they so strong?\"\n\nThe golems tearing through Reinhardt defied every expectation. Dozens, even hundreds of users swarmed individual golems and died screaming. NPC soldiers didn't survive a single blow. Even high-level users and knight NPCs were getting butchered by the sleek humanoid models.\n\nThen there were the giants. Twelve super-sized golems that wielded magic like breathing. Each magical blast vaporized hundreds of users and NPCs in bursts of grey light. When human magicians tried to retaliate, translucent shields appeared. Anti-magic barriers that nullified every spell.\n\n\"Jesus Christ...\"\n\nReinhardt was collapsing. The massive walls crumbled. Users fled in every direction. Despair twisted the faces of nobles and military commanders alike.\n\nBased on what he was seeing, those twelve super-sized golems matched the Awakened Guardian of the Forest. And the 200 humanoid ones? Boss-tier monsters, every single one.\n\n*What kind of magician could create something like this?*\n\nThen Youngwoo's blood turned to ice.\n\n\"What?\"\n\nHis eyes locked onto a figure in the crowd. A girl in a corner of Reinhardt, squatting down, shaking.\n\n\"Sehee?\"\n\nHis sister. His fucking sister was in that death trap.\n\n\"Goddammit!\"\n\nThe food hit the table. Youngwoo was already running for the capsule.\n\n*Why she's playing doesn't matter. Move. MOVE.*\n\nHe had to reach her before those golems did. Before the kanjajang got cold could wait.\n\n***\n\nWinston Castle materialized around Grid the instant he logged in.\n\nA whisper hit him immediately. Lauel's voice was infuriatingly casual.\n\n**-You came. A king's quest was just granted to all users within the Eternal Kingdom. The rewards are enormous. Why don't you try the quest?**\n\n> **[Fight the Golems]**\n\nThe quest window appeared, but Grid barely glanced at it before footsteps echoed through the hall.\n\n\"Dear husband!\"\n\n\"Irene?\"\n\nShe ran to him, tears streaming down her face. The moment she reached him, she grabbed his armor with trembling hands.\n\n\"The battle for Reinhardt is going badly. I'm terrified for my father.\"\n\nAnother window appeared.\n\n> **[Save Earl Steim]**\n> \n> Difficulty: A\n> \n> The golems invading Reinhardt Capital are far stronger than anticipated. The situation has deteriorated rapidly.\n> \n> Earl Steim is almost certainly in crisis.\n> \n> Save him for Lady Irene's sake.\n> \n> Quest Clear Conditions: Earl Steim's survival.\n> \n> Quest Clear Rewards: Maximum affinity with Earl Steim. You will gain the ability to exercise significant power in the north.\n> \n> Quest Failure: Level -1. If Earl Steim dies, Lady Irene will be consumed by grief for an extended period. Your marital relationship may deteriorate.\n\n\"Please.\" Irene's voice broke. \"Please help my father.\"\n\nShe was an NPC. Just code and algorithms. But she'd taught Grid what it meant to love another person, to want someone's happiness more than his own. Seeing her like this made his chest hurt.\n\nGrid cupped her face. \"I'll bring him back. Not a scratch on him. Don't worry and wait for me.\"\n\n> **[The quest has been accepted.]**\n\n*Reinhardt. Fast.* He'd never been there, so he couldn't gauge the distance precisely.\n\n**-Lauel, how far is Winston from Reinhardt?**\n\n**-Half a day if you use Fly.**\n\n**-That's—**\n\nToo slow. Noe was too small to ride. He'd need to summon Huroi's drake.\n\n**-Euphemina is a Duplicator, right? She keeps spells copied. She might have Mass Teleport.**\n\n*Smart bastard.* Grid immediately switched channels.\n\n**-Euphemina, do you have Mass Teleport available?**\n\n\"I do.\"\n\nThe voice came from behind him. Euphemina stood in the castle courtyard, staff in hand. Perfect timing. She'd been on standby in Winston.\n\n\"It's precious magic that I've saved, but I'm willing to use it for you.\" She tilted her head. \"What's the destination?\"\n\nGrid smiled despite everything. \"Reinhardt.\"\n\n***\n\n\"Are there no mighty warriors to deal with those golems?! The shortage of talent is too great!\"\n\nKing Wiesbaden's scream echoed from Reinhardt's walls.\n\nPhoenix, strongest knight of the north. Ector of the west. Kis of the east. Three pillars, and nowhere near enough. The king felt desperation clawing at his throat.\n\nEven the royal bodyguards, elite knights to a man, were helpless against the golems. The hundreds of thousands of troops? Useless. Worse than useless. They stabbed and died. Their spears and swords couldn't even scratch that rocky hide.\n\nMagic was the answer, but magic didn't work. Those Anti-magic Shields devoured every spell.\n\nTotal crisis. The city crumbled. Wiesbaden and his nobles turned to prayer.\n\n\"Rebecca, goddess of light! Grant me strength to protect my kingdom and my people!\"\n\nThe gods existed. But prayers rarely succeeded. The king and his nobles knew this. Their voices died out.\n\n**Kuuong! Kuuong!**\n\nOnly the sound of collapsing walls and buildings remained. Only screams.\n\n***\n\n\"They're all gathered together like sheep.\"\n\nHappy, ranked 304 on the unified rankings, clicked his tongue as he surveyed the battlefield. Out of 100,000 users in Reinhardt, 99,900 were average level trash. No wonder things went to shit.\n\n\"I expected more.\" He shook his head.\n\nTop rankers prioritized personal hunting over events like this. Happy realized, not for the first time, that he needed to leave. Most users felt the same. How many of these 100,000 actually cared about protecting Reinhardt? Most came to try the quest for easy rewards. There was no merit in staying.\n\n\"Huh?\"\n\nA commotion erupted in North Street. Happy and the other users turned.\n\nA female user in beginner clothes threw herself over an NPC, shielding the woman with her own body. People laughed.\n\n\"Pfft, beginners are so pure.\"\n\n\"Right? I tried to save NPCs at first too.\"\n\n\"Well, it's not like beginners lose experience when dying. Wait, what?\"\n\n\"Huh?\"\n\nThe mocking users looked up. King Wiesbaden and the nobles on the wall did the same.\n\nA brilliant light flashed in the darkening sky, expanding rapidly.\n\n\"Mass Teleport?\"\n\nSomeone figured it out first. The light grew, and two figures emerged.\n\nA blonde girl with a doll-like face. An Asian man beside her.\n\n\"Get off!\"\n\nThe Asian man plummeted from the Mass Teleport portal, voice raw with fury.\n\n\"Get your goddamn hands off my sister!\"\n\nHis shout carried across Reinhardt. Everyone turned. Users, NPCs, golems. All eyes went to the sky.\n\nThen they saw it. A blue greatsword, shaped like an oceanic predator's maw, screaming down toward a soul doll.\n\n\"That's—!\"\n\n\"G-God...!\"\n\nThe person who wielded the blue greatsword in the National Competition. The first legendary class. An existence known to every Satisfy user.\n\nGrid had arrived.\n\nThe users erupted.\n\n\"God Grid! God Grid is here!\"\n\n『Grid has appeared at the perfect moment!』\n\n『Doesn't this remind you of his entrance during the National Competition months ago?』\n\n『A protagonist always follows the basic rule of arriving late.』\n\nThe Reinhardt war footage dominated ratings across global channels. The world watched as Grid shielded Sehee and Yerim from the soul doll's strike.\n\nHe landed hard, dirt exploding outward. \"Summon Knights! Huroi! Lauel! Jude!\"\n\n**Pak! Papat!**\n\nThree figures manifested. Lauel, strongest of the 10 Rookies. Huroi, first-ranked Orator. And an NPC in armor.\n\n*'Summon knights?'*\n\n*'God Grid is a noble now!'*\n\n*'Three knights means viscount rank? Amazing...'*\n\nAdmiration rippled through the crowd. Grid pointed at the golems without looking at his party.\n\n\"Smash every last one of these things. But first, I need to make a party with my sister.\"\n\n\"...\"\n\nThe counterattack was about to begin.\n\n***\n\n**[Author's Note]**\n\n*Gonna be busy this week for Christmas, so I'm posting all this week's chapters today and tomorrow.*\n\n*Glossary of Common Korean Terms.*\n\n*OG: Glossary Link.*\n\n*Current schedule: 20 chapters a week.*\n\n*Check out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.*"
}