{
  "id": 198,
  "title": "Chapter 198",
  "content": "# Chapter 198\n\n\"Are you okay?\"\n\nThe NPC boy wiped his nose. \"Sniffle! Thank you.\"\n\nSehee had just pulled him to safety when a shriek split the air.\n\n*Kiyaaak!*\n\nA soul doll launched itself at Sehee.\n\n\"Danger!\" Yerim's body moved before her mind caught up. \n\nShe shoved Sehee aside and took the hit meant for her friend. *I'd do this in real life too.* Sehee was her only friend. Precious as family.\n\nThe Satisfy system recognized her sacrifice.\n\n> [The Saintess is the symbol of wisdom and virtue.]\n>\n> [I applaud your courage for making a sacrifice on behalf of the unique Saintess who will benefit the world.]\n>\n> [You can convert to the <span class=\"rarity-epic\">epic rated hidden class, Saintess' Knight</span>.]\n\n\"Eh?\" Yerim stared at the notification window, stunned.\n\nThe soul doll's kick was already in motion, aimed at her face.\n\nA blue greatsword fell from the sky like a lightning bolt.\n\n*Peeeeeong!*\n\n*Kyaak!*\n\nThe soul dolls had withstood group attacks from armored soldiers without a scratch. But this single strike had sent one reeling. Sehee and Yerim looked up at the man descending from above.\n\nBlack hair, neatly kept. A crown. Red and gold armor matched with black boots. A cloak that reeked of blood. Seven golden blades orbited around him in a lazy spiral.\n\nThe absolute champion of the National Competition.\n\nShin Youngwoo. Grid.\n\n\"Brother?\" Sehee's eyes widened.\n\n*How did he know to come here?* Yerim's heart hammered. *It's like destiny.*\n\nSehee thought, *As expected from him.*\n\nYerim thought, *My prince.*\n\n\"Come this way.\" Grid moved, placing himself between the girls and the approaching horde.\n\nHundreds of golems. Red with the blood of slaughtered humans.\n\n*Kwaduduk!*\n\nGrid's teeth ground together. *If I'd been even a minute later, these bastards would've hurt Sehee. And her friend.*\n\nA month ago, he would've charged in swinging. But Lauel's influence had made him more cautious. He still slipped up sometimes, like yesterday with the guild members, but not often.\n\nGrid opened a whisper channel. \"Euphemina, how many golems are there?\"\n\nEuphemina surveyed Reinhardt from her aerial position. \"There are **733** old golems, **187** soul dolls, and **12** ancient weapons.\"\n\nHer Duplicator class granted high Insight, surpassing even Grid's current **950 points**. She could assess numbers quickly and accurately.\n\nGrid nodded, then pulled up the combat power readings.\n\n*The old golems clock in at **9,300**. Soul dolls at **15,000**. Ancient weapons at **26,000**.*\n\nHe frowned.\n\n*The Pope was **24,000**.*\n\nEven a difference of **100** was significant when measuring combat power. If **1** was an ant and **100** was an eagle, then these ancient weapons sat **2,000** points above the Pope. They couldn't be ignored.\n\n*Twelve opponents stronger than the Pope.*\n\nEven the weakest old golems outmatched the knights. Every soul doll equaled a top ranker. This wasn't a solo job. The quest had been labeled as cooperative from the start for a reason.\n\nGrid made his decision and raised his voice.\n\n\"Summon Knights! Huroi! Lauel! Jude!\"\n\n*Pak! Papat!*\n\nLight flashed. Three figures materialized around him. Grid formed a party, adding Euphemina to the roster.\n\n\"Smash these golems.\" He gestured at the approaching army. \"First, I need to add my sister to the party.\"\n\n> [Ruby has joined the party.]\n>\n> [Sexy Schoolgirl has joined the party.]\n\n*Sister?*\n\nThe knights turned. Behind Grid stood two beautiful girls in starter gear. The party window showed them at **Level 1**.\n\nLauel raised an eyebrow. \"Do you plan to bus them?\"\n\nBussing. High-level users carrying low-level ones. Normally impossible in Satisfy due to the **35-level** gap restriction that blocked experience gain.\n\n\"A **Level 1** noble will be born.\"\n\nBut cooperative quest rewards were shared equally among party members. If Grid killed a golem, the system treated it as all members killing that golem. And the Fight the Golem quest offered generous compensation.\n\nOld golem: **300 gold**, **100 kingdom contribution**  \nSoul doll: **1,000 gold**, **500 kingdom contribution**  \nAncient weapon: **3,000 gold**, **1,500 kingdom contribution**\n\nA user couldn't reach earl, marquis, or duke through contribution alone. But baron required **3,000 points** and viscount **10,000 points**, regardless of level.\n\n*Thanks to Grid, Ruby and Sexy Schoolgirl can enjoy the game from Level 1 as nobles.*\n\nWas this being born with a gold spoon?\n\n*No. Diamond cutlery. No, adamantium.*\n\nThe world was unfair. Lauel filed that observation away as Grid issued orders.\n\n\"Jude, protect Ruby and Se... xy Schoolgirl.\"\n\nGrid shot Yerim an incredulous look. She just laughed. He sighed.\n\n\"The rest of you help me deal with the ancient weapons.\"\n\nThe NPC army and users were struggling because magic didn't work on golems. To let Euphemina and the other magicians contribute, to shift the battlefield in their favor, the ancient weapons had to fall first.\n\n\"Right, Lauel?\"\n\n\"You are wise.\"\n\nGrid gripped **+9 Failure**. The thrilled Huroi shouted, \"My Lord! You are a divine being! Nobody can block your way! All results will bend to your will!\"\n\n> [Your morale has increased.]\n>\n> [Your attack power and magic attack power will significantly rise for the next attack.]\n>\n> [The next attack will be a critical hit!]\n\nThe second advancement Orator's buff washed over Grid. He smiled.\n\n\"Pagma's Swordsmanship! Transcended Link!\"\n\nHis target: the ancient weapon **200 meters** ahead. Twenty energy blades, each dealing **150%** of his attack power, streaked toward the golem that had marched from the south of the Eternal Kingdom without taking a single hit.\n\n*Kuuuuong.*\n\nThe critical strike brought the ancient weapon to one knee. Buildings nearby shook from the impact.\n\n*Kik. Kikik.*\n\nThe golem's health dropped by more than two-thirds. It made a bizarre grinding sound. The Anti-magic Shield flickered and died.\n\nEuphemina saw her opening.\n\n\"Storm Gravity Field.\"\n\n*Jjejejeok!*\n\nA **5-meter** gravitational sphere formed around the fallen ancient weapon. Ten old golems and one soul doll were sucked into its pull.\n\nThen the storm fell from above.\n\n*Kwa kwa kwa kwang!*\n\n> [The Indecisive Mumud's Orb's option effect is activated, increasing magic damage by 100%.]\n>\n> [Magic damage has increased by 68%.]\n\n*Kiyaaaaaah!*\n\nThe golems shrieked. Their bodies disintegrated, stone powder spreading across the plaza.\n\nLauel stepped forward. Armed with Grid's <span class=\"rarity-unique\">Unique rated</span> qi gun, he proved why he held first place on the qigong master rankings.\n\n\"Dragon's Scream.\"\n\nClean finish. The golems trapped in the gravity field collapsed, turning to grey light.\n\n> [You have destroyed an ancient weapon.]\n>\n> [**3,342,000** experience has been distributed.]\n>\n> [You have destroyed a soul doll.]\n>\n> [**87,300** experience has been distributed.]\n>\n> [You have destroyed an old golem.]\n>\n> [**24,550** experience has been distributed.]\n\n\"Heok!\"\n\n\"Crazy!\"\n\nThe golems had crushed hundreds of thousands of Reinhardt's troops. Yet four skills had reduced them to rubble. People stared, mouths open.\n\nHappy, ranked **304th**, watched in disbelief.\n\n*What type of monsters are they?*\n\nEveryone knew Grid was strong. But Huroi? The only non-combat class in the top **1,000** rankings had just doubled Grid's power with a single buff. Fraudulent.\n\nLauel exceeded his reputation. That massive qi gun on his shoulder clearly fueled his rapid growth.\n\nThen there was Euphemina.\n\n*Who is she?*\n\nA complete unknown, yet she wielded magic on par with **5th ranked** Yura.\n\nFinally.\n\n\"Ruby. Sexy Schoolgirl. Jude will protect them.\"\n\n*Kwaaaaang!*\n\nThe NPC, armed with the black sword Grid had used to defeat Bondre in the National Competition, was dominating three old golems alone.\n\n\"Hiccup!\"\n\nHiccups echoed from all directions. Grid wasn't impressed.\n\n\"These golems, why don't they drop items?\"\n\n\"I'm not sure.\" Lauel shrugged.\n\nHe couldn't answer every question Grid had.\n\n***\n\n『 Grid doesn't just excel as an individual. He commands powerful knights. 』\n\n『 In particular, the user called Euphemina cast **S-grade** magic without chanting. She must possess a hidden class. 』\n\n『 The conclusion: we must praise God Grid. 』\n\nThe anchors and experts relaying the Reinhardt war situation heaped praise on Grid. Netizens echoed the sentiment. The National Competition felt like ages ago, but this battle footage was just as exciting. The seeds of Grid worship spread through Satisfy's community.\n\nEven Wiesbaden, King of the Eternal Kingdom, was moved.\n\n\"Ohh! Who is this brave warrior dealing justice to these cruel golems? Goddess Rebecca has heard our prayers and sent us a champion!\"\n\nEarl Steim cleared his throat. He stuck out his chest proudly.\n\n\"He's my son-in-law.\"\n\n***\n\n**Glossary of Common Korean Terms.**  \nOG: Glossary Link.  \nCurrent schedule: 20 chapters a week.  \nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}