{
  "id": 199,
  "title": "Chapter 199",
  "content": "# Chapter 199\n\n\"Son-in-law?\"\n\nOne of the nobles muttered the word, his voice carrying across the castle ramparts. The fact that Earl Steim's son-in-law was a commoner had spread through the kingdom like wildfire. The royal family and nobles had mocked the decision relentlessly. *What idiot would marry his successor to a commoner instead of a political ally or wealthy noble?*\n\nEarl Steim was over sixty years old. The consensus had been simple: senility had finally taken hold of the old war dog. But now, watching the black-haired warrior cleave through golems like wheat before a scythe, the truth became inescapable.\n\n*It was like this all along.* The noble who'd spoken first licked his lips. *Such a sly snake wouldn't pass his only successor to common rabble.*\n\nAnother nobleman leaned forward against the battlements, eyes wide. *Despite being a commoner, he possesses abilities beyond measure.*\n\nA third noble, younger than the others, felt his chest tighten with envy. *So reliable. I would kill to have such a warrior pledged to my house.*\n\nThe assembled aristocracy watched the black-haired man move through the battlefield. A heroic warrior. There could be no other term for someone who defeated an ancient weapon that hundreds of thousands of troops couldn't even scratch.\n\nKing Wiesbaden stepped forward, his ceremonial armor catching the light. \"Your son-in-law is a hero fighting for the kingdom!\" The King's voice boomed across the ramparts. \"Earl Steim's judgment is truly exceptional! Your presence is the light of hope for this realm!\"\n\nEarl Steim held the highest authority in the Eternal Kingdom, surpassing even the two dukes and three marquises. Three generations of defending and developing the harsh northern territories had built power that made even royalty cautious. Many nobles watched the Earl like hawks circling prey. Now, with the King's public praise, their anxiety crystallized into cold calculation.\n\n*There's no stopping his rise now.* One duke clenched his jaw.\n\n*He might become a marquis after this.* A marquis touched his chin, mind racing through political ramifications.\n\nThe shrewder nobles moved quickly, pivoting from mockery to flattery with practiced ease.\n\n\"Truly amazing.\" A portly count approached Earl Steim, bowing low. \"Having a heroic warrior as a son-in-law... your acumen is beyond compare.\"\n\n\"Indeed.\" Another noble chimed in, voice oily with false warmth. \"The Earl, who has secured a heroic warrior, will influence nations beyond our borders. We are humbled by your foresight.\"\n\n*Heroic warrior.* The term rippled through the crowd. Someone talented and brave, who alone could match the value of hundreds of thousands of troops. A figure worthy of admiration in these dark times.\n\nEarl Steim's jaw tightened. These fools misunderstood Grid completely.\n\n\"My son-in-law isn't a heroic-level warrior.\"\n\n\"Hahaha!\" The count slapped his knee. \"Aren't you being too humble, my lord?\"\n\nThe nobles exchanged knowing glances. *He's managing his image. How shrewd.*\n\nBut they had no idea what was coming.\n\n\"My son-in-law isn't merely a heroic warrior.\" Earl Steim's chest swelled with pride. \"He is a **legendary warrior!** Hahaha!\"\n\nSilence crashed over the ramparts like a tidal wave.\n\n*What is he saying now?* The portly count's smile froze.\n\n*He's too arrogant.* The younger noble's lip curled. *We flattered him a little and it went straight to his head.*\n\nBluffing. It had to be bluffing. Everyone knew the history. Only nine legendary warriors in all of recorded time. After Pagma and Sword Saint Muller, a century had passed with only one new legend emerging. Now Earl Steim dared to call his commoner son-in-law a legend? Arrogance didn't begin to describe it.\n\n\"My son-in-law is the greatest, isn't he? Hahahaha!\"\n\n\"Ha... haha...\" The King's laugh came out strangled.\n\nNervous chuckles spread through the nobility. Earl Steim, it seemed, had finally cracked under the pressure.\n\n***\n\n**Reinhardt's West Street.**\n\n\"Kiyaaak!\"\n\n\"Ugh!\" A soldier's scream cut through the chaos as a ray of condensed magic pierced his chest.\n\nThe army from the north faced annihilation. Ancient weapons fired their devastating rays in mechanical succession. One-third of the troops had already fallen. Old golems pushed through the ranks like iron fists through parchment. Soul dolls, their weapons forged from their own bodies, tore through the knights with surgical precision.\n\nCaptain Phoenix, their anchor, had left the formation to rescue two civilians. Without him, desperation turned to panic.\n\n\"H-Help me!\" A young soldier's plea ended in a wet gurgle as a soul doll's blade found his throat.\n\n\"Ugh!\" An older man collapsed, blood spreading across his tabard. \"My wife in Winston... she'll be a widow today.\" He coughed. \"Please... remarry a better man.\"\n\n*Kyaak!*\n\nThree soul dolls spotted a gap in the formation. They moved like water, swords humming through the air. Bodies fell in their wake.\n\n\"Ugh!\" \n\nRomeo Laniche, one of Winston's knights who'd joined Earl Steim's forces, felt cold steel punch through his stomach. \n\nHe hit the ground hard. Staring up at the smoke-choked sky, his thoughts drifted to an old colleague. Knight Deck, who had fallen facing the Awakened Guardian of the Forest to protect Viscount Grid. Romeo's lips curved into a small smile. *I'll see you soon, old friend.*\n\n*Deck... I'll be your sparring opponent again in the afterlife...*\n\nHe had stepped down from the succession line for Viscount Laniche. A bachelor who lived only for training. No wife to mourn him. No children to carry his name. Leaving this world held no regrets. Just...\n\n*It's too bad I never took that date with the seamstress.* \n\nRomeo's eyes closed, accepting the inevitable. But death didn't come.\n\n\"I can't watch my wife's knight die before my eyes.\" A familiar voice, rough with exertion. \"She'd be sad.\"\n\n*Jeeeong!*\n\nA blue greatsword split the soul doll from crown to crotch. Grid kicked the dissolving remains aside and tossed a potion. It bounced off Romeo's chest plate.\n\n\"Viscount Grid...\"\n\nThe timing was exquisite. Romeo and the Winston soldiers watching felt their hearts swell with desperate hope.\n\n\"Thank you.\" Romeo's voice was hoarse.\n\nHe hadn't expected salvation. He was overjoyed to receive it. He started to bow, but Grid cut him off. \"Stay alive and pay me 50 gold. That's the value of the potion.\"\n\nRomeo blinked. \"...The price of this potion is 8 gold.\"\n\nBut Grid was already gone, sprinting toward the center of the battlefield where soul dolls and old golems were slaughtering the northern troops wholesale.\n\n\"Viscount Grid!\" The knights and soldiers shouted in alarm.\n\nHow could one man survive against that mass of steel and stone? But these soldiers didn't know the truth. Grid was a legend. He'd fought solo against Pope Drevigo, the Awakened Guardian of the Forest, Neberius of the Yatan Church, and the great demon Hell Gao. Ancient weapons might be formidable, but old golems and soul dolls? They were target practice.\n\n\"Pagma's Swordsmanship. Link.\"\n\nGrid moved like a dancer through the golems' clumsy strikes. His muscles coiled during the dance, storing potential energy. Then, at the apex of his movement, everything released at once. The blue greatsword moved faster than thought.\n\nTwenty-one blades of compressed blue-white energy screamed through the air at terrible speed, squeezing the atmosphere itself.\n\nSilence blanketed the battlefield. Knights, soldiers, even the golems themselves went still.\n\n\"This is the moment.\"\n\nGrid's voice was barely a whisper.\n\n*Pipit! Pipipipipit!*\n\nThe compressed air detonated. Old golems and soul dolls shattered into dozens of pieces, bodies fragmenting like dropped pottery.\n\n*Kukukukukung!*\n\nStone fragments scattered across the cobblestones. Grid stepped forward, his gaze locked on the ancient weapon one hundred meters ahead.\n\n\"My Lord! I'm ready!\" Huroi's voice rang out as he caught up.\n\nGrid didn't break stride. \"I'm ready as well.\"\n\nThe orator's voice boomed across Reinhardt, amplified by skill and passion.\n\n\"The world is watching My Lord! Show them your dignity! I, Huroi, shall lend you my strength!\"\n\n> [Your morale has increased.]\n> \n> [Your attack power and magic attack power will rise significantly for the next attack.]\n> \n> [The next attack will be a critical hit!]\n\nHuroi's 'Morale Boost' buff skill carried a ten-minute cooldown. Ten minutes had passed since the first ancient weapon fell. The time had come for Grid to turn the tide once more.\n\n\"Blacksmith's Rage! Fly.\"\n\nGrid triggered his buff and launched skyward. A blacksmith wielding a massive greatsword in one hand while casting flight magic. The spectators in the National Competition had witnessed it before, but the sight never lost its impact.\n\n『 God Grid has entered the battle! 』\n\nThe anchors' voices echoed through televisions across the world.\n\n\"Pagma's Swordsmanship!\"\n\nWhite light wrapped around the blue greatsword like the cosmos painted across a midnight sky. Grid descended from above like a falling star, his sword dance unfolding with the grace of a butterfly. The air around him grew heavy, thick with condensed hatred and killing intent. A precursor to disaster.\n\n**[Linked Kill]**\n\n*A minimum of three to seven blows will be randomly generated, each dealing 1,500% damage per hit.*\n\nHundreds of thousands of NPCs and users filled Reinhardt's streets. Hundreds of millions more watched through streams and broadcasts. All eyes turned skyward.\n\n\"Linked Kill!\"\n\nThe ultimate skill that had felled Hell Gao activated once more.\n\n*Roaaaaar!*\n\nThe ancient weapon towered eight meters tall. The white glow from Grid's blue greatsword aimed straight for its head.\n\n*Jjejeong!*\n\n> [Critical Hit!]\n> \n> [Failure's option effect is activated, causing the skill '5 Joint Attacks' to generate.]\n> \n> [You have dealt 6,250,900 damage to the target.]\n\nThe second blow.\n\n*Jjejejeok!*\n\n> [Holy Light Gloves's option effect is activated, causing the skill '5 Joint Attacks' to generate.]\n> \n> [You have dealt 2,238,400 damage to the target.]\n\nThe third blow.\n\n*Jjeejeeeong!*\n\n> [You have dealt 445,200 damage to the target.]\n\nThe fourth blow.\n\n*Jjeejeeeong!*\n\n> [Failure's option effect is activated, causing the skill '5 Joint Attacks' to generate.]\n> \n> [Holy Light Gloves's option effect is activated, causing the skill '5 Joint Attacks' to generate.]\n> \n> [You have dealt 4,851,000 damage to the target.]\n\nThe perfect killing strike. The world held its breath.\n\nThe ancient weapon's head disintegrated.\n\n*Kung! Kukung! Kukukukung!*\n\nStone fragments rained down like meteors, pulverizing surrounding buildings.\n\n*Kukukukukung...*\n\nThe ancient weapon collapsed, silent and dead. Lauel scratched his head, watching dust billow across the street. \"This time, I didn't even get a chance to act.\"\n\nSweat trickled down Lauel's temple. He hadn't realized Grid had grown this strong.\n\n*Did he hide his true capabilities during the National Competition?* \n\nLauel swallowed hard. Meanwhile, Sexy Schoolgirl bounced on her toes, voice pitched high with excitement. \"Oppa is so cool!\"\n\nThis was only the beginning.\n\n\"Waaaaahhhhh!\"\n\nStarting with Sexy Schoolgirl's cry, every NPC and user in Reinhardt erupted.\n\n\"L-Legendary...!\" \n\nOn the ramparts, the King and nobles stood with mouths hanging open like suffocating fish. Earl Steim's political power had just launched into the stratosphere. Meanwhile, Grid was grumbling. \"These damn golems refuse to drop items. They also give pathetic experience.\"\n\nLauel clicked his tongue from his position on the ground.\n\n\"Aren't these golems quest monsters? Every kill earns you 300 gold and 100 kingdom contribution. Isn't that sufficient?\"\n\nGrid's eyes narrowed. \"Why shouldn't I be greedy? Isn't it natural to want more?\"\n\nLauel stared at his guild master, momentarily speechless.\n\n*It's the first time I've seen someone like this.*\n\nIndeed, Grid's greed seemed to have no ceiling. While they stood there debating,\n\n*Kikik. Kik.*\n\nA strange clicking sound emanated from the ancient weapon's corpse.\n\n\"...?\"\n\nThe seven golden blades moved before Grid could process the threat. They gathered together, forming a shield around their master.\n\n*Kuwaaaaaang!*\n\nA devastating explosion erupted from the ancient weapon's body.\n\n> [You have suffered 591,140 damage.]\n> \n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with minimum health.]\n\n\"Cough!\" \n\nThe blast hurled Grid across the street. He crashed into the cobblestones hard enough to crack them. Huroi, Lauel, and Euphemina sprinted toward him immediately. Ruby and Sexy Schoolgirl went pale, frozen like stone statues.\n\n***\n\nAt the same moment, in golem labyrinths scattered across the continent, Braham's voice echoed through empty halls.\n\n*[My golems will grow as they fight and eventually destroy Grid. I will teach you a lesson. Then... Huh?]*\n\nThe twenty-eight scattered fragments of Braham's soul stirred with confusion.\n\n*[What power is this?]*\n\nAs Braham grappled with the unknown, a notification window appeared before every user connected to Satisfy.\n\n> [The Saintess, an existence with superior wisdom and virtue, has emerged.]\n> \n> [The Saintess will be an example for the people and benefit the entire world.]\n\n\"...Sehee?\"\n\nIn Reinhardt, Grid's eyes widened. Not because of the system message, but because his party window had changed.\n\n**Name:** Ruby  \n**Level:** 1  \n**Class:** Saintess\n\n\"Don't hurt my brother!\"\n\nSehee rarely showed her true feelings to anyone. Now her warm hands touched Grid's ravaged body, and healing light poured forth.\n\n> [20% of your total health has been restored.]\n\n\"...Percentage heal?\"\n\nGrid's voice came out stunned. The strongest healer in Satisfy had just been born.\n\n***\n\n**Glossary of Common Korean Terms**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day."
}