{
  "id": 2,
  "title": "Chapter 2",
  "content": "# Chapter 2\n\nGrid's jaw clenched. *That bastard.*\n\nHe wanted nothing more than to ram his sword down Ashur's throat, but the cold reality of numbers crushed that fantasy before it could form. The Earl was level 300—a Great Magician who'd completed his third class advancement. His escort knights averaged level 180.\n\nGrid? Level 73. He couldn't beat the youngest knight in Ashur's retinue, the one they used as a glorified errand boy.\n\nAnd the quest conditions demanded he kill them all.\n\nWorse—*worse*—the quest rewards were garbage. Intelligence -50. Grid had 30 Intelligence total. The math was brutal. *I'll be functionally brain-dead. Minus twenty Intelligence. And every noble in the kingdom will hate me on sight. Where's my escape route? What kind of sadistic quest design is this?*\n\nOnly one option remained: die. He'd lose two levels, but the quest was impossible anyway. And even if he could somehow clear it, those penalties would cripple him permanently.\n\nGrid exhaled slowly. The pressure radiating from the knights made his skin crawl.\n\n*Eight levels lost to this nightmare of a quest. Ashur, you bastard. One day I'll be high enough level to make you regret this. I swear it.*\n\nHe glared at the Earl, etching that smug face into memory, then closed his eyes as the knights' blades descended. His fingers tightened reflexively around Pagma's book.\n\n*Wait. What about this thing?*\n\nIf he stuffed it in his inventory before dying, would it stay there? This wasn't a standard quest item—the system might not protect it. And Ashur's whole purpose here was stealing Pagma's book. For the quest narrative to make sense, if the Earl killed him, the book would probably vanish from Grid's inventory and appear in Ashur's hands.\n\n\"Shit!\"\n\nIf he was losing the book regardless, why not use it instead? A new possibility crystallized. He could activate Pagma's rare book right now.\n\nBut Grid hesitated. He hated production classes with a passion. Games were supposed to deliver the visceral thrill of combat—the clash of steel, the spray of blood. Becoming a blacksmith meant sweating over a forge, hammering iron until his hands blistered. Hauling pickaxes through mines to gather materials.\n\nIt was labor.\n\nThe realization hit like ice water down his spine. He already spent his real life doing brickwork and shovel jobs at construction sites. Now he'd be doing manual labor in a game too? Just imagining it made his stomach turn.\n\nGrid's vision blurred slightly. He'd dreamed of staying a warrior—swinging his sword, cutting through enemies, rising through the ranks to become a general. But that dream was dead. An item worth hundreds of millions of won was about to fall into an NPC's hands. Into that bastard Ashur's hands.\n\n\"Better to use it than lose it to him!\"\n\nGrid tore open Pagma's book. Ashur's eyes widened. The Earl flung out a hand, lips moving in a frantic chant.\n\n\"Too late, you bastard.\"\n\nGrid's triumphant sneer died as notification windows erupted across his vision.\n\n> [You have become Pagma's Descendant.]\n\n> [Your level has dropped.]\n\n> [You are now Level 1.]\n\n> [All skills and stats have been reset.]\n\nGrid stared at the messages. His brain refused to process them.\n\nClass changes were supposed to build on your existing foundation—strengthening your level, enhancing your stats, evolving your skills. That was how every game worked. So why was everything being wiped clean?\n\n\"What is this?\"\n\nBefore he could make sense of it, more windows flooded in.\n\n> [Dexterity stat has opened.]\n\n> [Blacksmith's Craftsmanship skill has been created.]\n\n> [Blacksmith's Craftsmanship skill has been mastered.]\n\n> [Blacksmith's Appraisal skill has been created.]\n\n> [Blacksmith's Appraisal skill has been mastered.]\n\n> [Blacksmith's Patience has been created.]\n\n> [Blacksmith's Patience has been mastered.]\n\n> [Blacksmith's Disassembly skill has been created.]\n\n> [Blacksmith's Disassembly skill has been mastered.]\n\n> [Blacksmith's Repair skill has been created.]\n\n> [Blacksmith's Repair skill has been mastered.]\n\n> [All blacksmith skills have been mastered to the Pinnacle. The skills of the Legendary Blacksmith have been opened.]\n\n> [Legendary Blacksmith's Craftsmanship skill has been created.]\n\n> [Legendary Blacksmith's Discernment skill has been created.]\n\n> [Legendary Blacksmith's Appraisal skill has been created.]\n\n> [Legendary Blacksmith's Patience skill has been created.]\n\n> [Legendary Blacksmith's Repair skill has been created.]\n\n> [Legendary Blacksmith's Disassembly skill has been created.]\n\n> [Legendary Blacksmith's Breath skill has been created.]\n\n> [Legendary Blacksmith's Blessing skill has been created.]\n\n> [Legendary Blacksmith's Creation skill has been created.]\n\n> [Title acquired: 'One who Became a Legend'.]\n\n> [Composure stat has opened.]\n\n> [Indomitable stat has opened.]\n\n> [Dignity stat has opened.]\n\n> [Insight stat has opened.]\n\nDexterity was standard for production classes. But Composure, Indomitable, Dignity, Insight? Grid had never heard of those. Was this good?\n\n\"Not good!\"\n\nPanic clawed at his chest. He'd had fifteen passive skills and twenty-two active skills as a warrior. Combat abilities he'd earned through months of grinding. Gone. All of it, erased. The class change had transformed him into a laborer.\n\nAnd he was level one. A year of progress, hundreds of hours of leveling, reset to nothing. He had to start the grind from scratch.\n\n\"Why does a quest like this even exist? Son of a—\"\n\nGrid strung together a creative chain of Korean profanity as a knight's sword blurred toward his neck.\n\n> [You have been hit by a fatal blow!]\n\n> [You have died.]\n\nGrid's minimal health pool evaporated instantly.\n\n> [Quest failed!]\n\n> [You are now banned from entering Patrian.]\n\n> [Patrian soldiers will kill you on sight.]\n\n> [Your level has dropped by 2.]\n\n> [You are now Level -1.]\n\n> [No registered residence detected. Resurrect at the nearest temple?]\n\nGrid stared at his character sheet. The words refused to make sense.\n\n\"Negative? My level is *negative*?\"\n\nHe must have done something heinous in a past life to deserve this. Three months of brutal grinding, and this was his reward? Grid didn't even bother resurrecting. He logged out.\n\nThe moment he disconnected, Grid pulled up every Korean Satisfy forum he could find, searching for information on negative levels. Nothing. Not a single post, guide, or complaint. Finally, he made his own thread.\n\n**Title:** I am currently Level -1.\n\n**Contents:** I spent three months on a quest and received a legendary old book. But I failed the quest and my level dropped to -1. Why??? Has this happened to anyone else???????\n\nGrid hit post, then hauled himself out of the capsule. His reflection in the mirror looked like a cancer patient in the terminal ward—gaunt, hollow-eyed, skin stretched tight over bone. Three months of ignoring sleep to grind that quest had left their mark.\n\nAnd his reward? A few hundred million won down the drain and a negative level.\n\n\"Three months. Three months of my life, just... gone.\"\n\nGrid could have worked actual jobs during that time. Instead, he'd been shoveling digital air. No—worse than that. He'd lost time *and* levels. Energy drained out of him. He slumped against the wall, overwhelmed by a crushing wave of negative emotions. Sadness, emptiness, rage, resentment—they poured in until he felt hollow. If he were a weaker person, Grid thought, he might actually consider suicide.\n\nHis stomach cramped. \"I need to take a shit.\"\n\nThree in the morning. The apartment was dark, everyone asleep. If he woke his parents, they'd curse him out for disrupting their rest again. Grid crept through the living room, used the bathroom as quietly as possible, washed up, then raided the kitchen. He grabbed a container of leftovers from the fridge, found a spoon by touch in the darkness, and returned to his room with a bowl of rice.\n\n\"Oh, sausage fried rice.\"\n\nThe taste of processed meat hit his tongue. As Grid ate, the food settling warm in his belly, some of the emotional chaos receded. He could think clearly again.\n\n*How did my level go negative?*\n\nGrid wiped his mouth and checked the forum post he'd made.\n\nHis eyes widened. Over 10,000 views. More than 2,000 comments.\n\n*Don't tell me—*\n\nMaybe negative levels were famous among veteran players, and everyone was excited because it granted incredible hidden benefits? Grid's hope died the moment he started reading.\n\n**Iksl\\*\\*:** If negative levels exist, a ghost will crawl out of my monitor tonight.\n\n**Eksk\\*\\*:** Wow, I'm Level -5 too! We're low-level buddies!\n\n**Tutu\\*\\*:** Did you find a legendary book as well? lololol Do you crave attention that badly?\n\n**cm3s\\*\\*:** Someone commit this guy to a mental hospital. Delete this post.\n\n**7r14\\*\\*:** Legendary book... negative level... these days people really...\n\n**jk12\\*\\*:** Wouldn't -1 put you dead last in the rankings? lol I'd quit the game immediately.\n\n**Kkks\\*\\*:** Something this unique that's never appeared before? What nonsense.\n\n**Qkr8\\*\\*:** Lay off the booze, buddy.\n\n**Gjte\\*\\*:** Wow, negative levels... I salute your imagination. You should write fiction.\n\nGrid scrolled through 2,000 variations of the same mockery. He felt like an idiot.\n\n*So information about negative levels hasn't leaked at all. Am I the first person to experience this?*\n\nSatisfy's design philosophy rejected traditional customer service. With two billion players, the community was expected to discover and share information organically. The game was vast enough that huge chunks of content remained hidden—like negative levels, apparently.\n\nRain pattered against the window. According to the weather forecast, it would pour all day. No point looking for construction work in this weather. Grid scraped the last grains of rice from his bowl and logged back into the game."
}