{
  "id": 20,
  "title": "Chapter 20",
  "content": "# Chapter 20\n\nSatisfy was in chaos.\n\nMajor guilds mobilized to hunt down the mysterious blacksmith. Every forum, every news outlet—they all screamed about the epic-rated arrows. Who was this craftsman with monstrous skill but no reputation? No experience?\n\nThe entire player base wanted answers.\n\nPanmir stared at his forge, jaw clenched. *I've poured everything into this craft. Every hour. Every failure. And there's someone better than me?*\n\nHe'd only managed to produce epic-rated items twice in his entire career. He held the title of first epic-rated item maker. Yet his items had never earned the descriptor 'craftsman' in their descriptions. Who had achieved what the number one ranked blacksmith could not?\n\nThe hammer struck the anvil. **Ttang! Ttang!**\n\nPanmir burned with competitive fire, driven by the shadow of an unknown rival.\n\nMeanwhile, the subject of all this attention sat hunched over a cup of noodles at a convenience store, preparing for another shift.\n\nGrid stabbed at the noodles with his plastic fork. \"Scamming bastard. One thousand won for instant noodles? Does he want people like me to starve?\" He slurped bitterly. \"Nobody can survive without screwing someone over.\"\n\n***\n\n5:30 a.m.\n\nSunday meant nothing at the labor office. The building hummed with desperate energy.\n\nGrid rubbed his temples. *When did things change so much?* Gone were the days of students picking up day jobs. Now, young Koreans avoided manual labor like a plague. Foreign workers had flooded in to fill the void. *The country's going to hell.*\n\nThe stench of cigarettes and soju hit him like a wall, even at this ungodly hour. *I still can't get used to this smell.*\n\n*Just get through the day. Get paid. Go home.*\n\nA wiry man in a construction vest called out, \"Four workers needed for the Shinwoo Building site!\"\n\nConstruction cleanup. Hauling bricks. Moving lumber. Shoveling sand until your back screamed. Grid knew the drill—he'd done it a dozen times before. He shot his hand up without hesitation.\n\n\"Here! I'm—\" A body slammed into him. *Cough!*\n\nAn older man reeking of alcohol drove an elbow into Grid's gut, shoving him back. Grid stumbled into the corner. By the time he recovered, all four slots were filled.\n\n\"You heartless pricks!\" Grid clutched his stomach. \"Young people should get priority!\"\n\nBefore he could catch his breath, another voice rang out.\n\n\"Need three tile assistants. Must have strength and experience.\"\n\nTile work wasn't glamorous—lugging materials, following the lead tiler around, trying not to shatter expensive tiles—but it beat most alternatives. Grid's hand went up again.\n\n\"Right here! I've done tile work more than ten times—\" *Ugh!*\n\nShoved aside again. Three older workers swarmed the employer, their greater experience securing the spots before Grid could even finish his sentence.\n\n\"Anyone else?\"\n\n\"Me! I can—\" *Ack!*\n\nEvery opportunity, the same story. The older men formed a blockade, intercepting him at every turn.\n\nGrid's hands balled into fists. \"You'll regret ignoring me! I'm worth ten of these old farts!\"\n\nThe older workers glared. They'd marked him as competition, someone young and capable who threatened their meal tickets.\n\n\"You think I'm here for fun?\" Grid's voice cracked. \"I'd love to work a cushy part-time job like other college kids! But I'm trying to survive, just like you! Let me eat too!\"\n\n*They're like rabid dogs protecting scraps.* But they were adults. Fighting them would accomplish nothing. Grid forced himself to sit down, fuming.\n\n\"Kukuk.\"\n\nThe labor office chief glanced up from his newspaper. The man looked to be in his early thirties—he'd inherited the office from his father. Grid had been here at least thirty times in the past few months. Ten visits meant three trips home empty-handed. The chief watched with vague amusement as another employer entered.\n\n\"Who can do electrical cable pulling? No experience required. I'm paying one hundred ten thousand won for the day. Need someone now.\"\n\nTwenty thousand won above standard rate.\n\nNobody moved.\n\n*I remember that hell.* Grid's muscles twitched at the memory.\n\nCable pulling sounded simple enough—just dragging thick electrical cables through conduit. But the reality was torture. The cables weighed a ton. Your wrists took constant punishment. Even with gloves, blisters formed within hours. The muscle soreness lasted for days.\n\n*Last winter... that nightmare...*\n\nGrid shuddered. The other workers suddenly found the walls fascinating. Some whistled tunelessly. A few stepped outside to smoke.\n\n\"No takers?\" The employer's face fell.\n\nOne of the middle-aged men pointed directly at Grid. \"That young guy's perfect for it.\"\n\n\"Absolutely. Look at him—full of energy. Great stamina.\"\n\n\"He's done cable pulling dozens of times. A real expert.\"\n\n*You psychotic bastards!*\n\nGrid shot them a murderous glare, but they kept singing his praises. The employer walked over, eyes brightening.\n\n\"Excuse me, young man. Want to come with me? You look strong.\"\n\n*I'm dead if I follow him.*\n\nGrid glanced at the chief. The man just smiled behind his newspaper.\n\nDesperate, Grid lifted his phone to his ear as if answering a call.\n\n\"Yes, this is Shin Youngwoo. Oh, you have an opening? Yes, I'll be right there—\"\n\n**Ddiririring~ Ddiririring~**\n\nHis phone's default S Corporation ringtone blared through the silent office.\n\n\"...\"\n\nLaughter exploded around him. Workers wiped tears from their eyes. Even the employer chuckled.\n\n\"Come on, let's go.\"\n\n*Who the hell calls me this early?* Grid barely received calls at all. *Of course this happens now.*\n\nThen he saw the caller ID. His blood went cold. He answered.\n\n\"Hello~ This is Mother's Heart is Happy Financial Services.\" The woman's voice was saccharine poison. \"Customer Shin Youngwoo, you remember your payment is due tomorrow, yes?\"\n\n\"Already?\"\n\n\"Forgetting means you don't have the money, correct?\"\n\n\"No! No, of course I have it. Yes, I understand. I'll have it ready tomorrow.\"\n\n\"Thank you, Debt—I mean, Customer. Have a happy day. Mother's Heart is Happy hopes you'll smile today~\"\n\nClick.\n\n\"Damn vultures...\"\n\nReality crashed down. He'd been so absorbed in Satisfy that he'd forgotten his loan payment. The interest alone required serious cash. *No more easy jobs. Only hard labor will dig me out of this hole.*\n\nGrid looked at the employer. \"You'll really pay one hundred ten thousand?\"\n\n\"Yes!\"\n\n\"For real?\"\n\n\"Of course! I'll even feed you lunch!\"\n\nGrid trudged toward his fate.\n\n***\n\nThat evening, Sehee's eyes went wide when he collapsed through the door.\n\n\"Brother?\" She rushed over as he hit the floor, shoes still on.\n\n\"Bastard...\" Grid's words came out slurred. \"Said he'd feed me... only gave me cream bread... no milk... what kind of monster gives cream bread without milkkkkk?! I need to log in... the arrows... I sold...\"\n\nHe blacked out mid-sentence.\n\n***\n\nWhen consciousness returned, Grid felt like he'd been flattened by a steamroller.\n\nEvery muscle screamed. He forced his eyes open, checking his phone. 5:20 a.m.\n\n\"Ugh!\"\n\n*Shit.* He'd overslept. The labor office was far from his apartment. He'd need to hurry to snag a decent job. If he arrived late, yesterday's nightmare would repeat itself.\n\nGrid scrambled into his work clothes, joints protesting every movement.\n\n\"I'm leaving!\" He jammed his feet into his shoes without washing up.\n\nAfter paying the loan interest, he'd have exactly 9,220 won left. The capsule rental fee was due in a week. *I need money. Now.*\n\nHis mother appeared beside him, hand on his shoulder. \"Come eat breakfast.\"\n\n\"Can't. I'm already late.\"\n\n\"Youngwoo.\" His mother's voice carried a weight that made him flinch. *Here comes the lecture.*\n\nHe braced himself. She knew about the debt. She'd questioned his game addiction, mourned his disappearance from university, worried about his future.\n\nBut when he turned, her eyes held only warmth.\n\n\"Come eat.\"\n\n\"Why? I need to get to the office.\"\n\nThe door opened. His father walked in, sat at the table, and unfolded his newspaper without a word. He coughed once. \"Take a break today.\"\n\n\"A break? What are you talking about?\"\n\n\"Cough, cough.\" His father studied the paper as if it contained the secrets of the universe.\n\nHis mother leaned close, voice dropping to a whisper. \"You came back destroyed yesterday. Your father was worried—he carried you to your bedroom himself.\"\n\n\"What?\"\n\n\"We're your parents, Youngwoo. We don't want to see you suffer. You worked yourself to death yesterday. Rest today.\"\n\n\"Mom...\" Something caught in Grid's throat. Despite all his failures, all the disappointment he'd caused over the past year, they still cared.\n\nSehee emerged from her room, yawning. She pressed something into his hand—pain relief patches.\n\n\"Put these on. You overdid it yesterday.\"\n\n\"Sehee...\"\n\n*My family. They're still here for me.*\n\nThe realization hit like a hammer. He'd felt so alone, drowning in debt and failure. But his family had never left. They were angels putting up with a disaster of a son and brother.\n\nGrid pulled them into a hug, eyes stinging.\n\n\"W-What are you doing?\" Sehee squirmed. \"Your hug is actually... I mean, it's terrible. Isn't it terrible?\" She hugged him back anyway.\n\nHis mother stroked his head gently.\n\nGrid changed out of his work clothes and sat at the table. The beef rib soup steamed before him—his first taste in months.\n\n\"Father, can you pay off my debt for me?\"\n\n**Beeok!**\n\nA spoon bounced off his forehead.\n\n\"Ow!\" Grid clutched his head as his mother clicked her tongue and handed his father a fresh utensil.\n\n\"I've told you before.\" His father's voice was granite. \"You need to be self-reliant. You're twenty-six years old. You must be responsible for your own actions.\"\n\n*The warm atmosphere lasted all of three minutes.* Grid rubbed the growing lump on his forehead.\n\nHis father pulled out an envelope. \"I'll give you an allowance today. Since we're making you rest, I can't let you take a financial hit.\"\n\n\"Father...\" Emotion swelled again. His usually stern father was showing concern in his own way.\n\n*Thank you. I'll accept this graciously.*\n\nGrid's practiced fingers gauged the thickness of bills through the paper. He frowned. *That feels... light.* He peeked inside. Seven bills.\n\nHis spirits sank. \"Father, minimum wage for day labor is at least nine thousand won per hour...\"\n\nHis father looked genuinely apologetic. \"Is that so? Sorry, but that's all the cash I have on me right now. Be satisfied with that.\"\n\nTranslation: *Don't ask for the difference later.*\n\n*Right.* Grid had forgotten his father's legendary frugality. The man who bought one chicken and made the family eat it over three meals would never part with extra money.\n\nGrid surrendered to his fate, pocketing the seventy thousand won.\n\n*At least he gave me something.*\n\n***\n\nGlossary of Common Korean Terms.  \nOG: Glossary Link.  \nCurrent schedule: 16 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}