{
  "id": 200,
  "title": "Chapter 200",
  "content": "# Chapter 200\n\n**Kuaaaaaaang!**\n\nThe ancient weapon flashed white. The explosion tore outward in a sphere of pure destruction, obliterating everything within fifteen meters.\n\n\"Grid!\" Sehee's face drained of color as her brother vanished into the blast. The party window showed his health bar at the absolute minimum. A sliver. Nothing more.\n\n\"My Lord!\" Huroi's voice cracked.\n\n\"Grid!\" Lauel sprinted forward.\n\nBoth men had only ever witnessed Grid's invincible presence on the battlefield. The concept of him actually dying had never entered their minds. Confusion washed over them as they ran. Euphemina followed, panic clear in her movements.\n\nGrid himself lay sprawled in the rubble, relieved and shocked in equal measure.\n\n\"Ugh.\" He pushed himself up, one hand pressed to his temple. \"Why the hell did it explode? My head is killing me.\"\n\nHe checked his status.\n\nOne.\n\nOne single point of health remained. That solitary point stood between him and respawning in some distant town. It was absurd. Impossible luck.\n\nHuroi's eyes were wide with excitement. \"The heavens smiled on you!\"\n\nLauel exhaled slowly, forcing calm back into his expression. \"I can't believe you survived that blast. What kind of defense rating do you have?\"\n\nGrid managed a smile, though it didn't reach his eyes. \"Nothing special. Just good gear.\"\n\n*I lost my safety net.*\n\nThe realization settled in his gut like lead. Every battle he'd fought, every risk he'd taken, had been backed by that passive. Two lives instead of one. Now he was down to a single thread, same as everyone else.\n\n*Twenty-four hour cooldown on the invincible passive.*\n\nHe'd have to fight smart. No more brute forcing through damage.\n\nGrid turned to Lauel. \"The first one didn't explode. Why did the second? What's the pattern?\"\n\n\"Two samples isn't enough for certainty.\" Lauel's analytical mind was already working. \"Best assumption is that all ten remaining ancient weapons will detonate on death.\"\n\n\"So we kill them and run.\" Grid frowned. \"Great.\"\n\nThe sound of grinding stone and metal grew louder. Grid looked up.\n\nGolems. Hundreds of them. From every street, every alley, every corner of Reinhardt, they converged. Eight hundred metallic forms, all focused on a single point.\n\nOn him.\n\nGrid's jaw tightened. *Worst case scenario.*\n\n\"You pulled aggro from the consecutive kills.\" Lauel's voice was steady despite the approaching horde. \"Euphemina, did you copy Heal?\"\n\nEuphemina shook her head. \"No. Rebecca priests are too valuable. I never had the chance to observe them properly.\"\n\n\"Then we retreat.\" Lauel grabbed Grid's arm. \"You need time to recover.\"\n\nThe soul dolls moved too fast. Their inhuman speed closed the distance before Grid could take three steps.\n\n**Kyaak!**\n\n**Jjejeong! Jjeejeeeong!**\n\n\"Gah!\" Huroi barely managed to deflect the first strike. The second stabbed into his shoulder, dropping him to one knee. His skills weren't built for dueling these things. Only his drake's intervention kept him alive. Lauel fared no better in close combat.\n\nEuphemina tried to support them. Her magic fizzled uselessly against the Anti-magic Shield surrounding the golems.\n\nGrid had one option.\n\nIn the past, he would've run. Saved himself. Left them behind.\n\nNow? The thought didn't even surface.\n\n\"Get behind me.\" Grid stood, reaching into his inventory for a potion. He stepped between his party and the incoming wave.\n\n> [7,500 health has been restored.]\n\nHe grimaced. With all his gear and titles, his max health pushed close to 60,000. The potion barely scratched the surface.\n\n**Chaaeng! Chaaeng!**\n\nGrid moved conservatively, hyper-aware of his vulnerability. One hundred soul dolls and seven hundred old golems pressed in from all sides. Sweat ran down his temples as he raised the pavranium discs, deflecting blow after blow, waiting for the potion cooldown to expire.\n\n**Kwa kwa kwa kwang!**\n\nThe ten ancient weapons scattered across Reinhardt fired simultaneously. Beams of condensed magic power forced Grid further on the defensive.\n\n\"Protect Viscount Grid!\" The northern troops surged forward to assist.\n\nThey died in droves. The golems cut through them like wheat.\n\nGrid's teeth ground together. *Should've worn Doran's Ring from the start.*\n\nHe'd gotten better at using the ring in combat. Timing it perfectly to trigger the healing effect right as massive damage landed. But he'd been overconfident. Cocky. The explosion caught him unprepared, and now the ring sat useless in his inventory while his health remained critical.\n\n\"Brother!\" Sehee watched him struggle, saw the strain in every movement.\n\n*I want to help.*\n\nShe couldn't stand watching Grid suffer. Couldn't ignore the soldiers dying to protect him.\n\n\"I need more power.\" Her voice was barely a whisper.\n\n\"I'll become a Saintess.\"\n\nA golden exclamation mark materialized beside her vision. Unlike her brother, Sehee immediately understood what it meant. She reached out and touched it.\n\nA woman's voice, warm and melodic, filled her mind.\n\n> [The Saintess must be a role model for everyone. If you become the Saintess, you are obliged to do 50 or more good works every month. If you violate this rule, you will be deprived of your status and won't be able to become a Saintess again.]\n\n> [It isn't possible for a Saintess to acquire any skills other than class specific skills.]\n\n> [A Saintess can only use class specific weapons.]\n\n> [Do you still want to become a Saintess after knowing these facts?]\n\n\"Yes.\"\n\n**Swaahh!**\n\nGolden light erupted from Sehee's body. The glow was gentle, comforting, like sunlight through morning mist. Notification windows cascaded across her vision.\n\n> [You have become the growth type hidden class, a Saintess.]\n> \n> [A Saintess class starts at the epic rating. You must meet certain conditions in order to raise the rating.]\n> \n> [You have obtained the Saintess class weapon, <span class=\"rarity-epic\">Wooden Staff</span>. As the class rating grows, the rating of the weapon will also grow.]\n> \n> [The Goodness stat has been opened.]\n> \n> [The Composure stat has opened.]\n> \n> [The skill Hope has been created.]\n> \n> [The skill Discipline has been created.]\n> \n> [The skill Benevolent Light has been created.]\n> \n> [The skill Upright Heart has been created.]\n> \n> [The title 'Everyone's Role Model' has been obtained.]\n> \n> [The skill Sacrifice has been created.]\n> \n> [Congratulations! You are a unique existence in Satisfy. Your great power to heal others without borrowing from divine power is backed by a strong sense of responsibility.]\n\nSehee absorbed the information rapidly. She equipped the staff and scanned through her abilities.\n\n> **[<span class=\"rarity-epic\">Wooden Staff</span>]**\n> \n> Rating: Epic\n> Durability: 200/200  \n> Attack Power/Defense: 133\n> \n> \\* All stats **+50**.\n> \n> A staff made of unidentified wood. It is very hard and can't be cut by a sword.\n> \n> There are no special features yet.\n> \n> Conditions of Use: Saintess.\n> Weight: 180\n\n> **[Hope]**\n> \n> Skill Rating: Epic\n> \n> Randomly recovers 10~30% of the target's maximum health.\n> \n> Skill Mana Consumption: 10% of your maximum mana.\n> Skill Cooldown Time: 1 minute and 30 seconds.\n> \n> \\* The skill rating will increase as the class rating increases.\n\n> **[Discipline]**\n> \n> Skill Rating: Epic\n> \n> After restoring the party member's condition, the status conditions immunity effect will be given for a certain period of time.\n> \n> Skill Mana Cost: 2,000\n> Skill Cooldown Time: 5 minutes.\n> \n> \\* The skill rating will increase as the class rating increases.\n\n> **[Benevolent Light Lv. 1]**\n> \n> Restores the health of the party members, including yourself, by **3,500** + (Goodness x 3 + Intelligence x 2).\n> \n> Skill Mana Cost: 1,500\n> Skill Cooldown Time: 3 minutes.\n\n> **[Upright Heart Passive]**\n> \n> Skill Rating: Epic\n> \n> Immune to all abnormal conditions.\n> \n> You will give off a feeling of threat to vampires, demonkin and other such corrupt beings.\n> \n> \\* The skill rating will increase as the class rating increases.\n\n> **[Sacrifice]**\n> \n> Skill Rating: Epic\n> \n> Resurrects the dead in return for your health and mana dropping to 1 point. This skill can't be used on NPCs.\n> \n> This skill will do huge damage when used on a corrupt being.\n> \n> Skill Cooldown Time: 12 hours.\n> \n> \\* The skill rating will increase as the class rating increases.\n\nAt level one, her mana pool was pathetic. She could cast Hope or Sacrifice. Nothing else.\n\nSehee started forward. Jude's hand caught her shoulder.\n\n\"Ruby. Sexy Schoolgirl.\" His voice was flat, matter-of-fact. \"You shouldn't go to that dangerous place. You must be safe. It is Viscount Grid's command.\"\n\nSehee met his eyes. Despite his low intelligence, Jude was straightforward. Easy to reason with.\n\n\"Do you think our lives matter more than Viscount Grid's?\" She kept her voice calm. \"He's the one in danger. If we don't help him, he might die.\"\n\nJude's grip loosened. His expression shifted.\n\n\"Viscount Grid is more important.\"\n\nHe wrapped both hands around the black greatsword's grip. Then he charged.\n\nOne hundred fifty meters of carnage. Old golems and soul dolls crumpled beneath his assault. After Grid's training, Jude's strength had reached **2,080**. Among top rankers, breaking 2,000 in a single stat was exceptional. Combined with the **+8 Dainsleif**, each swing carried destructive force comparable to Grid himself.\n\n**Jjejeong! Jjejejeok!**\n\n**Kiyaaaaak!**\n\nMonsters scattered. A path opened.\n\nSehee ran through it, staff clutched tight.\n\n\"Sehee?\" Grid caught sight of her through the press of bodies.\n\n\"Don't hurt my brother!\" She raised the staff and activated Hope.\n\nWarm light enveloped Grid's form.\n\n> [20% of your total health has been restored.]\n> \n> [The option effect of the <span class=\"rarity-legendary\">Holy Light Armor</span> has increased the power of recovery magic by 300%.]\n> \n> [35,580 health has been restored.]\n\nThe synergy between legendary armor and epic healing was devastating.\n\n\"Percentage based healing?\" Grid stared at his sister in disbelief. *She was level one two minutes ago.*\n\n\"Brother, aren't you the best?\" Sehee's grin was fierce. \"Go smash these things!\"\n\nThe best.\n\nThe word hit harder than any golem's fist. For twenty-eight years, he'd been worthless. A burden to his family. Someone who inspired worry, not pride.\n\n*Thank you, Satisfy.*\n\nThis game had given him everything. The legendary Pagma's Descendant class. A new life. A path forward.\n\n*Without Satisfy, I'd still be rotting in that apartment, drowning in debt.*\n\nThe shame that had clung to him for years finally loosened its grip. His blood began to boil. Not with rage, but with determination. An aura flickered around his frame, stronger than Huroi's Morale Boost buff. With 40,000 health restored, confidence surged back into his movements.\n\n\"Pagma's Swordsmanship.\" Grid's voice cut through the chaos. \"Wave!\"\n\n**Roaaaaar!**\n\nHundreds of blue-white energy waves erupted outward. They tore through the front ranks of golems, shredding metal and stone. Damage numbers scrolled across his vision. Slowed debuffs stacked on every enemy caught in the blast radius.\n\nBut there were so many more.\n\n**Kiyaaak!**\n\nSoul dolls darted in. Their blades found gaps in his defense. Three strikes. Four. Five.\n\nGrid didn't retreat. Didn't dodge. He pressed forward, trading blow for blow, relying on Sehee's healing to sustain him through the punishment.\n\n> [You have suffered 3,300 damage.]\n> \n> [You have dealt 20,900 damage to the target.]\n\n> [You have suffered 2,930 damage.]\n\n> [Critical!]\n> \n> [You have dealt 44,200 damage to the target.]\n\n> [You have suffered 3,080 damage.]\n\n> [<span class=\"rarity-legendary\">Failure's</span> option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n> \n> [You have dealt 101,500 damage to the target.]\n\n> [You have destroyed a soul doll.]\n\n> [15% of your total health has been restored.]\n> \n> [The option effect of the <span class=\"rarity-legendary\">Holy Light Armor</span> has increased the power of recovery magic by 300%.]\n> \n> [26,685 health has been restored.]\n\n\"Sehee!\" Grid's laughter was wild, unrestrained. \"You're amazing! The best! Puhat! Puhahahat!\"\n\nBrother and sister. A synergy that shouldn't exist. The momentum shifted.\n\n> [Your level has risen.]\n> \n> [Your level has risen.]\n> \n> [Your level has risen.]\n\nSehee hit level thirteen. Healing a level 270 user granted absurd experience gains.\n\nHuroi stood frozen. Lauel's analytical mind had stopped processing. Euphemina stared at the spectacle, notifications scrolling endlessly across her vision.\n\n> [You have failed to observe the target's skill.]\n> \n> [You have failed to observe the target's skill.]\n> \n> [You have failed to observe the target's skill.]\n\n*A class that only heals from level one?* Euphemina's hands trembled slightly. *With healing output rivaling high level priests?*\n\nIt had been months since she'd failed to copy a skill. Not since Grid and Agnus.\n\n***\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}