{
  "id": 201,
  "title": "Chapter 201",
  "content": "# Chapter 201\n\n> [You have failed to observe the target's skill.]\n\nEuphemina stared at the notification. She tried again. Same result. A third time. Nothing changed.\n\nShe lowered her hands. \"A Saintess is a class that has at least a Unique rating.\"\n\nLauel's eyebrows shot up. \"Based on what?\"\n\n\"A Duplicator has clear limits, even as an Epic class.\" She folded her arms, studying Ruby's glowing form across the battlefield. \"I can't duplicate skills from anyone with a higher rating than mine.\"\n\n\"So you failed to copy Ruby's skill?\"\n\n\"Yes.\" A bitter taste settled on her tongue. \"The only people whose skills I've failed to duplicate, after raising my Insight to a certain threshold, were Grid and Agnus. It's an experience I haven't suffered in a long time.\"\n\n\"Agnus?\" Lauel's tone sharpened. The 7th ranked user was known to have an Epic class. \"But Agnus is Epic-rated like you. Why would Skill Observation fail?\"\n\n\"He must have a growth type hidden class.\"\n\n\"Like Hurent?\"\n\n\"Exactly.\" Euphemina nodded. \"Growth type classes are considered higher-rated than standard Epic classes. I can't duplicate their skills.\"\n\nAgnus remained a ghost. He never showed up in public. His existence was confirmed only through ranking lists and scattered NPC accounts. Some claimed he was an NPC himself. Others whispered that he was a game operator hiding in plain sight.\n\nBut Euphemina seemed familiar with him. Lauel leaned forward.\n\n\"What exactly is Agnus' class?\"\n\n\"At first I thought necromancer, but considering the various features...\" She paused, choosing her words. \"It's more appropriate to call him a Lich.\"\n\n\"Lich? You mean an undead?\"\n\nLiches were among the strongest undead in existence. They transcended life and death, wielding infinite magic power. If Agnus was a Lich, he might actually be stronger than Grid.\n\n\"On the surface, he doesn't appear undead, but...\" Euphemina shook her head. \"It's difficult to explain. You'd have to meet him to understand.\"\n\n\"Where can I meet him?\"\n\n\"You're being very active.\" Her eyes narrowed. \"Are you thinking about recruiting Agnus as Grid's subordinate? Forget it. Agnus is dangerous. Abnormal. Nothing positive comes from contact with him.\"\n\nLauel exhaled slowly. \"I'll take your word for it.\"\n\n*Agnus isn't the priority right now.* Lauel's mind shifted gears. Grid's sister had obtained a hidden class with at least Unique rating at level 1.\n\n*Did these siblings save a country in their past lives?*\n\nThe older brother claimed the first Legendary class. The younger sister obtained a hidden class at level 1. The odds were astronomical.\n\n*Anyway, this is good.*\n\nGrid's power base was solidifying. Euphemina the Duplicator. Ruby the Saintess. And if the Tzedakah Guild joined, the possibilities multiplied exponentially. Lauel's mind spun faster.\n\n*Grid and his sister are fighting well, but we can't drag this out.*\n\nStamina existed as a system mechanic. The longer a battle lasted, the more stamina drained. Even Grid would eventually face a crisis.\n\n*The golems only target Grid. The ancient weapons explode when destroyed. Then...*\n\nLauel's eyes widened. He shouted across the battlefield.\n\n\"Grid! Drive all the golems toward the ancient weapons!\"\n\n\"Huh?\" Grid turned mid-swing, frowning. He'd been enjoying the rhythm of combat with Sehee's support, treating the golems like walking experience chunks. \"Isn't that too much? I'd have to deal with the ancient weapon at the same time. Are you trying to kill me?\"\n\nGrid didn't understand. Unlike his sister, he was dense.\n\n*Can't be helped.*\n\n**Kuwaaaang!**\n\n\"Dragon Claws!\" Lauel threw up an earth barrier, intercepting a magic blast aimed at Grid. \"Just do as I say! Focus on defeating the ancient weapon, then run!\"\n\nQi operated on different principles than mana in Satisfy. That was why the Qigong Master class existed as a separate entity. Anti-magic Shield couldn't block qi-based skills.\n\n\"Dragon's Whispers!\"\n\n> [The amount of damage the target will receive has increased by 30%.]\n\n**Kukukukung!**\n\nThe ancient weapon twitched, affected by the debuff. Grid confirmed the effect and reached toward Jude.\n\n\"Jude, lend me your sword.\"\n\n\"Gladly, my liege.\"\n\nGrid stored his +8 Dainsleif in his inventory and activated Fly. Sehee cast Hope on him. Huroi layered a buff skill over it.\n\n\"Thank you.\"\n\nFull health. The strongest buffs nestled in his body. An invincible feeling surged through him.\n\n*The kanjajang is probably soggy by now.*\n\nThe food would be tasteless. Annoying. But the annoyance couldn't dampen his mood. His precious sister. His reliable companions. They were all here, enjoying Satisfy together, relying on each other. For someone who'd lived a lonely, friendless life, this experience was irreplaceable treasure.\n\n**Ssik!**\n\nGrid smiled and shot toward the debuffed ancient weapon like an eagle diving for prey.\n\n**Kiyaaak!**\n\nThe old golems and soul dolls ignored everyone else, stampeding after Grid. He gritted his teeth, remembering Lauel's words, and kept flying.\n\n**Kuoooh!**\n\nThe ancient weapon remained motionless as Grid approached. Then it fired.\n\n*It's learning.*\n\n\"Tch!\"\n\nToo close to dodge. Grid activated Doran's Ring.\n\n> [You have suffered 23,900 damage.]  \n> [Healing effects will be reduced.]  \n> [You have resisted.]  \n> [The options of Doran's Ring and the Holy Light Armor have been applied to restore 35,850 health.]\n\n*Healing effect reduction?*\n\nThat was new. Grid understood immediately. The ancient weapons were evolving mid-battle, optimizing themselves to kill him.\n\n*Impressive. But useless.*\n\nThe moon and stars vanished behind dark clouds. His '20% increased damage in dark places' effect triggered. <span class=\"rarity-legendary\">Failure</span> grew sharper in his hands.\n\n\"Pagma's Swordsmanship!\"\n\nHis sword dance erupted.\n\n\"Kill!\"\n\n\"Link!\"\n\n\"Transcend!\"\n\nBlue-white energy blades stormed through the air. The power fell short of Linked Kill or Transcended Link, but it shattered the Anti-magic Shield.\n\n**Gruruk!**\n\nGrid swapped weapons mid-flight. <span class=\"rarity-unique\">Dainsleif</span> replaced <span class=\"rarity-legendary\">Failure</span>. With this many enemies clustered around him, Dainsleif's passive matched Failure's raw power.\n\n**Chaaeng!**\n\nHe activated a skill the instant the weapon settled in his grip.\n\n\"Golden Flash!\"\n\n**Kwa kwa kwa kwang!**\n\nA golden ray split the night sky like a miniature sun.\n\n**Kuaaaah!**\n\nThe ancient weapon screamed as the ray punched through its core.\n\n**Kiik! Kiiik!**\n\nThe 800 golems chasing Grid erupted in rage. They watched their ancient weapon collapse and howled like children losing a parent.\n\nEuphemina's voice cut through the chaos. \"Exploit! Thunder Storm! Light Sword! Blizzard!\"\n\nA-grade magic rained down without chants. The spells hammered the ancient weapon's collapsing form with surgical precision.\n\n> [You have destroyed an ancient weapon.]  \n> [3,342,000 experience has been distributed.]\n\n\"Move!\"\n\nLauel's warning came the instant the notification appeared. Grid vanished at full speed.\n\n**Kwa kwa kwa kwa kwa kwa kwa kwa!**\n\nClose. Immediately after Grid cleared the blast radius, the ancient weapon's body detonated. Most of the 800 golems trailing him were consumed by the explosion and reduced to ash.\n\n\"Wow...\" Grid hovered in the air, staring at the devastation. Recognition dawned. \"That's what you intended. Lauel, you're really smart. The best.\"\n\nLauel bowed gracefully toward Grid's envious gaze.\n\n\"You are the one who is the best. I'm merely your bridesmaid.\"\n\n*My hands and feet are shriveling.*\n\nGrid winced at Lauel's flowery language. Euphemina appeared beside them, having finished her count.\n\n\"Forty-three old golems, eleven soul dolls, nine ancient weapons remaining.\" She met Grid's eyes. \"Let's finish this.\"\n\n\"Good.\"\n\nGrid returned Dainsleif to Jude and issued his command.\n\n\"The golems only focus on me. You don't need to protect Ruby and Sexy Schoolgirl anymore. Attack the ones chasing me.\"\n\n\"Yes, my liege.\"\n\nWhen it came to pure combat ability, Jude outclassed both Huroi and Lauel. He was an idiot, incapable of handling complex missions, but on the battlefield, Jude was utterly dependable. Once his rampage began, the surviving old golems and soul dolls crumbled. They were beaten into mere fragments of stone.\n\n『 Jude... I've never heard of him, but he must be a named NPC. Obtaining NPCs as knights requires clearing at minimum an S-grade quest and building maximum affinity... Grid truly is amazing. 』\n\nAs the world marveled at Jude's prowess, Grid tackled the remaining ancient weapons alongside Huroi, Lauel, and Euphemina. Without the golems and soul dolls obstructing them, the ancient weapons fell at a far faster pace.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}