{
  "id": 203,
  "title": "Chapter 203",
  "content": "# Chapter 203\n\n\"Overgeared!\" Huroi's voice rang across the battlefield. \"Let's show the world the emergence of the Overgeared Guild and elevate our lord!\"\n\n> [Your morale has increased.]\n> [Your attack power and magic attack power will significantly rise for the next attack.]\n> [The next attack will be a critical hit!]\n\n**Morale Boost**, the strongest buff skill of the first ranked orator, rippled through the assembled guild members. The former Tzedakah veterans murmured amongst themselves.\n\n\"The effect is insane,\" someone whispered.\n\n\"A guaranteed critical strike...\"\n\nJishuka turned toward Toban, her eyes glinting with challenge. \"Shouldn't the first ranked paladin prove he isn't lacking in comparison?\"\n\nToban stood at level 280, a full ten levels above Grid despite his relatively lower standing among the guild's elite. He raised his arms skyward, divine light gathering around his form.\n\n\"**God Judar's Blessing**!\"\n\n> [All stats will increase by 20% for 5 minutes.]\n> [Your health and defense will increase by 30% for 10 minutes.]\n\nLauel finally shook off his lingering shock at Grid's guild name choice.\n\n*This is the legendary skill of the first ranked Judar paladin I've only heard rumors about.* The two buffs layered perfectly, their effects complementary rather than overlapping. *Every member of this guild is a monster.*\n\nJishuka nocked an arrow, the motion fluid and practiced. \"Then shall we begin?\"\n\nThe <span class=\"rarity-unique\">Salamander's Horn</span> gleamed in her hands. Grid had forged it specifically for her, a bow that could claim the title of most powerful in existence despite its sluggish firing speed. The ruthlessly high attack power and fire attribute amplification compensated for any drawbacks.\n\n\"**Firecrackers**.\"\n\nThe woman moved like a goddess of archery incarnate. Seven arrows left her bowstring in rapid succession, each shot flowing into the next with barely a heartbeat between them. The projectiles screamed toward the ancient weapon 2,300 meters distant.\n\nThe arrows detonated mid-flight. Flames erupted from their tails like ignited fuses, adding explosive acceleration to already deadly velocity.\n\nThe ancient weapon recognized the danger. Its massive jaw dropped open, gathering white magical energy for a counterattack. But Jishuka's assault gave it no time. The arrows struck home in a cascade of fire and force.\n\nA grinding metallic shriek echoed across the battlefield.\n\n> [The target's mana core has been shocked.]\n> [The target's magic power flow has been blocked.]\n> [The target can't use magic for three seconds.]\n\n**Firecracker** had achieved its intended effect. The ancient weapon's Anti-magic Shield flickered and died. Laella and Zednos moved as one.\n\n\"**Demon King's Tail Fire**.\"\n\n\"**Tyrant's Hammer**!\"\n\nJishuka poured her remaining mana into her ultimate technique.\n\n\"**Phoenix Arrow**!\"\n\nThe world exploded. Black flames, a descending hammer of compressed air, and a blazing phoenix converged on the ancient weapon. Everything in their path vaporized. The golem's eyes flared crimson as it searched for allies.\n\nNone came. The other five ancient weapons faced identical onslaughts, each surrounded by divided Overgeared strike teams.\n\nThe ancient weapon confronting Regas suffered worst of all.\n\n> [The 5th combo has been achieved!]\n> [The effect of the <span class=\"rarity-unique\">Lightning Duke's Knuckles</span> has been activated, causing additional physical damage to the target.]\n\nRegas's fists blurred.\n\n> [The 6th combo has been achieved!]\n> [The effect of the <span class=\"rarity-unique\">Lightning Duke's Knuckles</span> has been activated, causing additional lightning damage to the target.]\n\nHis strikes built in intensity, each impact feeding the next.\n\n> [The 8th combo has been achieved!]\n> [The effect of the <span class=\"rarity-unique\">Lightning Duke's Knuckles</span> has been activated, causing additional physical and lightning damage to the target.]\n\nThunder crackled around his hands.\n\n> [The 10th combo has been achieved!]\n> [The effect of the <span class=\"rarity-unique\">Lightning Duke's Knuckles</span> has been activated, causing Thunder Chariot to be triggered.]\n\nLightning tore through the sky. A chariot of pure electrical fury materialized and hammered the ancient weapon to its knees. An eagle soared overhead before plummeting downward, transforming mid-dive into human form.\n\nToon landed atop the golem's bowed head. His silver wristblades caught the light, Grid's distinctive 'G' engraved along their length. He roared with bestial satisfaction.\n\n> [Weaken all nearby enemies.]\n\n\"Kukuk! Kuhahat! Now I will slice you up!\"\n\nHis body shifted, werewolf transformation lending savage strength to already deadly blades. The electrocuted ancient weapon could only endure as Toon's weapons found every weak point in its construction.\n\nNear the south wall, another ancient weapon staggered under Pon and Vantner's coordinated assault.\n\n\"Hap!\" Pon's spear carved glowing lines across the golem's torso.\n\n\"Ura! Ura! Urahh!\" Vantner's axes struck like thunder, each blow reverberating through stone and steel.\n\nThe ancient weapon finally snapped. Its massive arms swept outward in a desperate counterattack. Pon danced backward, agile as wind. Vantner planted his feet and raised his shield.\n\nThe impact nearly folded him in half. Vantner's body locked up, muscles seizing from the transmitted force. The ancient weapon's mouth began to glow.\n\n\"Hey!\" Vantner's voice cracked. \"Help me, Pon!\"\n\n\"You're stiffened? Just hold it.\"\n\nPon launched himself forward using Vantner's shoulder as a springboard. He twisted mid-air, spear aimed with surgical precision.\n\n\"**Mach Spear**!\"\n\nThe weapon broke the sound barrier. It punched through the ancient weapon's head, shattering half the golem's skull.\n\nPon landed in a crouch. \"Okay!\"\n\nThe ancient weapon wobbled, threatening to topple. Vantner glared at his partner through a coating of charred flesh.\n\n\"You bastard!\" Steam practically rose from Vantner's bald head. \"Using a companion as a sacrifice? Does that make you feel good?\"\n\nThe magic ray had reduced him to little more than charcoal. Pon simply shrugged.\n\n\"It's called teamwork.\"\n\n\"Shit! What kind of teamwork is that?\"\n\nVantner's face flushed crimson, a boiled octopus given human form. Pon couldn't suppress his laughter. Vantner swung his axe at his partner's head.\n\n\"Today I will kill you!\"\n\n\"Try it if you can, bald bastard.\"\n\nThe ancient weapon processed this scene with incomprehension. Fighting each other in front of a lethal opponent? It swung both arms at the bickering duo.\n\nPon sidestepped effortlessly. Vantner blocked with his shield. The pattern repeated itself.\n\nThe ancient weapon made a tactical decision. Ignore the fast one, eliminate the slow one. Its mouth flared with gathering energy, targeting the rigid Vantner.\n\n\"Pon!\" Desperation entered Vantner's voice. \"This time you really need to help me! I will actually die! Yes?\"\n\n\"Use your Invincible skill.\"\n\nVantner had invested heavily in stamina since the Malacus raid. His survival capabilities now rivaled a cockroach's tenacity. Pon understood this better than anyone, which made exploiting it guilt-free.\n\n\"**True Illusion**!\"\n\nThe ancient weapon fired. Simultaneously, dozens of illusory spears materialized and struck its body from impossible angles.\n\n\"My skills are indeed perfect.\" Pon's self-satisfaction lasted until an axe whistled past his ear.\n\n\"Those two are still acting like that.\"\n\nFrom within the city, Faker watched the distant comedy with a slight smile. He murmured to himself, paying attention to his own opponent.\n\n*No room for overconfidence.*\n\nThe first ranked assassin had skipped the National Competition entirely. While top rankers competed for glory, he had focused on pure progression. The result: level 293 and seventeenth on the unified rankings.\n\nNow came the fruits of that training.\n\nTwenty clones flickered into existence. They swarmed the ancient weapon from every angle, scaling its blood-slicked frame. The golem stood in the city's heart, surrounded by the corpses of ordinary soldiers it had massacred without effort.\n\nThese attackers proved different.\n\nThe ancient weapon jerked as twenty daggers penetrated its supposedly impervious shell. Actual holes appeared in its construct, structural integrity compromised.\n\nIt windmilled its arms with frantic desperation, trying to shake off these dangerous pests. Faker didn't defend. He simply advanced, moving through the whirlwind of deadly limbs with inhuman grace. Each step brought him closer to the golem's neck.\n\nThe ancient weapon's mouth gaped. Magical energy gathered.\n\n\"Thank you.\" Faker hurled five daggers down the golem's throat.\n\nThey detonated.\n\nThe ancient weapon collapsed. But even falling, it retained deadly intent. One massive arm swept toward Faker during his descent. An assassin's pitiful health and defense meant instant death from such a blow.\n\n*Failure at the critical moment.* Faker's expression tightened.\n\nLightning split the sky. The bolt struck with impossible precision, deflecting the golem's arm away from Faker's trajectory. He twisted mid-air, locating his savior.\n\nA beautiful blonde girl stood below.\n\n\"Euphemina!\" Recognition flashed through him.\n\nShe had annihilated Faker's party in the past, earning a permanent position on the Tzedakah Guild's kill list. But that guild no longer existed. The future offered different possibilities.\n\nFaker landed smoothly. \"I owe you a debt.\"\n\nEuphemina's smile carried awkwardness. History stood between them still.\n\nElsewhere on the battlefield, Ibellin coordinated with Lauel.\n\n\"Can you bind it with **Dragon's Wings**?\"\n\n\"I can hold it for one second.\"\n\n\"That's enough.\"\n\nKnown as the strongest and second strongest among the 10 Rookies respectively, their combination produced devastating results.\n\n\"**Wind Dragon's Wings**!\"\n\n> [The target's movements have been bound.]\n\n\"**Laceration**!\"\n\nThe <span class=\"rarity-legendary\">Thorn of Deep Grievance</span> lived up to its name. The blade tore through the ancient weapon's body with sadistic thoroughness.\n\n> [The target will receive fixed damage equal to 60% of their current health.]\n\nThe ancient weapon's health bar plummeted. A single strike had crippled it, leaving the golem stunned and helpless.\n\nLauel stared. *That attack power rivals Grid himself.* He reassessed his estimation of Ibellin's capabilities upward. Significantly upward. *This is troubling.*\n\nHe kept his voice casual. \"I guess even slugs have a talent for rolling around.\"\n\n\"Who are you calling a slug?\" Ibellin's face flushed. \"Dammit! I'll surpass you soon!\"\n\nLauel snorted. \"You're just overgeared.\"\n\n*Rich coming from me,* Lauel admitted internally. His own equipment came exclusively from Grid's forge.\n\nAt the inner wall, Grid faced his ancient weapon opponent alone.\n\n\"Have strength!\" King Wiesbaden leaned over the battlements, voice raw with desperation and hope.\n\nGrid's lips curved. Satisfaction filled his expression.\n\n\"**Transcended Link**. **Linked Kill**.\"\n\nConflicting emotions rippled across King Wiesbaden's face, mirrored by the assembled nobles. One hundred thousand users throughout Reinhardt held their breath. Millions of viewers worldwide watched their screens.\n\nWhite light banished the darkness. An artificial dawn bloomed across the battlefield.\n\nEarl Steim gazed at the impossible radiance and roared with paternal pride.\n\n\"My son-in-law is a legend!\""
}