{
  "id": 204,
  "title": "Chapter 204",
  "content": "**Chapter 204**\n\nThe air split with a sound like tearing metal. Twenty blue-white energy blades erupted from Grid's position and screamed toward the ancient weapons.\n\n\"It has come! The strongest skill!\" The broadcast host's voice cracked with excitement through speakers across Reinhardt. A hundred thousand users held their breath. Sweat slicked their palms.\n\nGrid's lips curved. The familiar warmth of a skill evolution flooded his chest.\n\n> [The fusion skill 'Transcended Link' has increased a level.]\n>\n> **[Transcended Link Lv. 2]**\n> You will temporarily enter a transcended linked state.\n> A total of 20 strikes will be launched, dealing **180%** attack power with each hit.\n> Every time a target is hit, they will be stiff for **0.1 seconds**.\n> * This skill doesn't share a cooldown with Transcend and Link.\n> Skill Mana Cost: **1,600**\n> Skill Cooldown Time: **15 minutes**\n\n*Stronger.* The thought cut clean through Grid's mind. *I'm stronger.*\n\nThe storm of blades slammed into the stiffened ancient weapon. Grid's body followed, <span class=\"rarity-legendary\">Failure</span> already rotating for the first strike of Kill.\n\n**JEEEONG!**\n\n> [Critical!]\n> [<span class=\"rarity-legendary\">Failure</span>'s option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n> [<span class=\"rarity-legendary\">Holy Light Gloves</span>'s option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n> [You have dealt **12,140,700** damage to the target.]\n\nGrid used the rebound to spin again. Second blow.\n\n**JJEJEONG!**\n\n> [<span class=\"rarity-legendary\">Holy Light Gloves</span>'s option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n> [You have dealt **2,612,000** damage to the target.]\n\nThird blow. The greatsword bit deep, metal screaming against stone.\n\n**JJEJEJEOK!**\n\n> [Critical!]\n> [You have dealt **1,205,800** damage to the target.]\n\nFourth blow.\n\n**JJEEJEEEONG!**\n\n> [You have dealt **500,300** damage to the target.]\n\nFifth blow. Grid's arms burned, but the weapon sang.\n\n**JJEEJEEEONG!**\n\n> [<span class=\"rarity-legendary\">Failure</span>'s option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n> [<span class=\"rarity-legendary\">Holy Light Gloves</span>'s option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n> [You have dealt **5,579,000** damage to the target.]\n\nThe trinity aligned. Grid's base stats, bloated from growth. Toban's buffs stacking on top. The absolute killing power of legendary equipment. Together, they carved reality apart. The number flashed across Grid's vision. Ten million damage. One blow.\n\n*Yes.*\n\nGrid's boots hit stone as Transcended Link expired. The ancient weapon sagged like a puppet with cut strings.\n\n\"WAAAHHHHHHHH!\"\n\n\"Grid! Grid! Grid!\"\n\nThe roar came from everywhere. Hundreds of thousands of NPCs. Their voices blended into a single thunderous chant. Grid glanced toward the palace walls. King Wiesbaden stood there, tears cutting tracks down his face.\n\n\"Thanks to the great hero, the 400-year history of the kingdom has been preserved!\" The king's voice shook.\n\nNear him, nobles whispered.\n\n\"Earl Steim will surely gain the title of duke.\"\n\n\"His son-in-law will at least be an earl...\"\n\nGrid caught fragments of it. Politics. Always politics. Some of those nobles were already calculating grudges against him.\n\n\"Truly God Grid! He's on a different dimension!\" The broadcasting anchors barely contained themselves.\n\n\"Today, we have learned one fact. Grid is the strongest. There is no doubt about it. This talent in the National Competition wasn't just a bubble.\"\n\n\"In fact, it isn't just Grid's power. Grid absorbed the power of the Tzedakah Guild while everyone was watching. Today is an important day where the power dynamics of Satisfy will rapidly change.\"\n\n\"From Bairan Village to the present day... Grid is really becoming a legend.\"\n\n\"He will be the first user to become an earl. How much power will he have as an earl? I'm already curious and excited.\"\n\n\"Will it stop at just getting the title of an earl? In my opinion, it's different...\"\n\nAll six ancient weapons lay broken. The golem invasion was over. Everyone believed it.\n\nLauel materialized at Grid's elbow. \"Grid, give us a signal so that we can finish the ancient weapon at the same time.\"\n\n*Right.* Grid nodded. If even one survived, it would learn from the others. Evolution in real time. They had to die together.\n\nGrid raised his voice. \"I will count to three. One! Two!\"\n\nThe guild members tensed. Weapons gleamed. Magic gathered in outstretched hands.\n\n\"Three!\"\n\nFive teams struck as one. Their ancient weapons shattered.\n\nPon and Vantner were the problem.\n\n\"I will finish it!\" Pon lunged.\n\n\"No, me!\" Vantner charged from the opposite side.\n\nTheir weapons collided. The ancient weapon, caught between them, survived with a sliver of health.\n\n> [High fire and lightning resistance are necessary.]\n>\n> [Minerals that have high conductivity must be excluded from the body.]\n>\n> [The body will become smaller by abandoning the massive minerals. It will restore the lost agility.]\n>\n> [The firing rate of magic power should be increased.]\n>\n> [Instead of lowering the power of the mana, rebuild the magic circles so that it is dispersed better.]\n>\n> [Tolerance to edged tools should be increased.]\n>\n> [Tolerance to explosions should be increased.]\n>\n> [It is determined that flying ability should be acquired.]\n\n**Clink. Clink clink.**\n\nThe ancient weapon's body folded. Eight meters of stone and metal compressed like an origami crane collapsing in reverse. The golem contracted into a cube, then unfolded into something new.\n\n**Grrr.**\n\nThe thing that emerged stood two meters tall. Human-shaped. Sleek where the original had been massive. It looked weaker. The aura radiating from it said otherwise.\n\n\"Are you crazy?\" Someone grabbed Pon by the shoulder.\n\n\"No, are your brains working? What are you doing?\" Another voice, sharp with anger.\n\nThe guild members closed in on Pon and Vantner. The temperature dropped. Faces hardened. This mess came from nothing but pride.\n\nPon's jaw set. \"We will handle this.\"\n\nVantner hefted his axe. \"I will clean up my shit!\"\n\nThey moved together for the first time in weeks. Weapons raised, they charged the evolved ancient weapon.\n\nPon's spear struck first. The tip skittered off the golem's chest.\n\n\"Eh?\" Pon's eyes widened.\n\nVantner's axe followed. Same result. Barely a scratch.\n\n\"Why has its defense increased so much when its size is smaller?\" Vantner backed up a step.\n\nThe evolved ancient weapon tilted its head. One finger rose, pointing at them.\n\n\"...?\" Pon and Vantner froze.\n\nTwo beams of concentrated magic erupted from the golem's fingertip. They punched through armor and flesh.\n\n> [You have suffered **18,010** damage.]\n> [Healing effects will be reduced.]\n\n\"Cough!\" Vantner stumbled. Thirty percent of his health gone. He wore legendary armor.\n\nPon had less.\n\n> [You have suffered serious damage!]\n> [You can't regain your mental state.]\n> [Healing effects will be reduced.]\n\nSixty percent. Gone in one hit. Pon's vision swam. The stun locked his muscles.\n\nThe evolved ancient weapon advanced.\n\n*What...?* Pon's thoughts moved like syrup.\n\nThe golem's head snapped forward. Skull met skull.\n\n\"Hope!\" Sehee's voice cut across the battlefield. Light bloomed around Pon, but the debuff ate most of it. His health ticked up. Not enough. Nowhere near enough.\n\nThe guild members surged forward. Toban planted himself in the golem's path, shield raised. From behind, Jishuka, Laella, and Zednos unleashed everything they had. Regas and Faker led the damage dealers in a coordinated strike. Ultimate skills flared.\n\n**Peeeeeong!**\n\nThe Anti-magic Shield unfolded like a flower. Every spell splashed harmlessly against it. Jishuka's arrows curved past the golem's head, missing by centimeters. Then it moved. A blur of motion. Regas took a fist to the chest. Faker's guard crumpled under a kick. Magic rays sprayed outward, chewing through health bars.\n\nBodies hit the ground.\n\nVantner's hands went cold. \"...It's the end.\"\n\nGuilt crushed his chest. His fault. His pride. His friends bleeding because of him.\n\nA hand landed on his shoulder. Large. Callused like a warrior's knuckles or a blacksmith's palm. Vantner knew that hand.\n\n\"Sorry...!\" Vantner couldn't look up. Grid had every right to be furious.\n\nBut Grid smiled.\n\n\"Didn't I tell you? I will be your strength.\"\n\nThe memory surfaced. The day Grid had asked the Tzedakah Guild to join him. He'd asked them to be his strength. He'd also vowed to be theirs.\n\n*He's changed again.* Vantner's throat tightened. The guild members stared. This was Grid. The man who hoarded every copper, who calculated every gain and loss down to the last decimal. He'd matured even further.\n\nGrid raised his hand. Summoned the worst pet.\n\n\"Nyang!\"\n\nNoe appeared in a flash of dark wings and gleaming eyes. The best demonic beast of hell, reduced to a cat with delusions of grandeur.\n\n\"Will you give me something delicious today? Nyang!\"\n\nGrid gestured at the evolved ancient weapon. \"Perhaps. It might be the most delicious prey you've ever eaten.\"\n\n*Jealousy.* The word tasted bitter in Grid's mind. That's why he hadn't summoned Noe earlier. The damn cat had more fans than him. If Noe played a critical role in public, Grid's popularity would sink even lower.\n\nGrid had intended to end this battle with his own hands. But the evolved ancient weapon changed the calculation. Its combat strength matched Hell Gao's, maybe. The weakened version, at least.\n\nGrid had burned Transcended Link and Linked Kill. His trump cards sat on cooldown. He couldn't face this thing alone.\n\n*The fan cafe numbers will go up again...* Grid swallowed the regret like poison.\n\n\"Swallow it.\"\n\n\"Nyaang!\"\n\nNoe shot forward, a black comet. His jaw unhinged. The evolved ancient weapon vanished into darkness.\n\n> [The memphis has taken part of the target's soul.]\n> [There will be a **50%** decline in the target's main stats for **3 seconds**.]\n> [The stats taken from the target will be transferred to the master.]\n> [**Stamina** has increased by **2,133**.]\n\nGrid's muscles swelled. Power flooded his limbs.\n\n\"Pagma's Swordsmanship! Kill!\"\n\nLucky. The critical hit notification flashed. <span class=\"rarity-legendary\">Failure</span> and the <span class=\"rarity-legendary\">Holy Light Gloves</span> both triggered. The ancient weapon's health plummeted. Its defense cratered. The golem reeled.\n\nThe guild members descended like wolves.\n\nEuphemina stepped forward, staff raised. The S-grade magic she'd been hoarding gathered in a sphere of howling energy.\n\n**Kwaaaaah!**\n\nThe explosion swallowed the battlefield in light. The ancient weapon fought. It clawed and blasted and refused to die.\n\nBut the minimum level of the Overgeared Guild members was 270. Only Grid fell below that threshold. The evolved ancient weapon endured Noe's swallowing three times, four times. Its stats gutted again and again. It couldn't last.\n\n> [Your level has risen.]\n> [Your level has risen.]\n\nSehee's level climbed with each wide-area heal. Grid grinned. Good for her.\n\nThe ancient weapon collapsed. Its body shattered into fragments. An item materialized where it fell.\n\n> [You have acquired Braham's Message.]\n\n*Braham...* Grid's eyes narrowed. *Is he the cause of this?*\n\nHe wanted to read it immediately. Footsteps approached. Grid shoved the item into his inventory.\n\nKing Wiesbaden ran toward them, crown askew, robes flapping.\n\n\"Thank you! Thank you!\" The king grabbed Grid's hands. The absolute monarch of the Eternal Kingdom bowed his head like a commoner.\n\nGrid filed that image away. Useful, maybe.\n\nThe rewards awaited. Grid headed toward the palace with the Overgeared Guild trailing behind. Reporters surged forward. Guards blocked them.\n\nLauel appeared at Grid's side. \"Grid, you should ask the king to allow them to come. We need to inform the world about how much you and the Overgeared Guild has grown from today's achievement. This is an opportunity to make everyone look up to us.\"\n\nGrid trusted Lauel's judgment. The man had never steered him wrong.\n\nGrid turned. Beckoned the reporters forward.\n\nThe king's gratitude broadcast live. Grid's reputation climbed.\n\nAcross the ocean, Director Yoon Sangmin of the S.A. Group watched the feed. For the first time, his expression softened.\n\n\"Yes, this is like a legendary class.\"\n\nA unique existence causing positive change. Making users aspire to greatness. Yoon Sangmin nodded. They would play harder now. Chase that dream.\n\nExactly as intended.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}