{
  "id": 205,
  "title": "Chapter 205",
  "content": "# Chapter 205\n\nThe Eternal Kingdom's army had been gutted.\n\nA thousand golems marching toward the capital. Hundreds of thousands of soldiers who couldn't stop them. Online, netizens tore into King Wiesbaden and his nobles with savage glee, calling them dog breeders instead of military commanders.\n\nHappy stood in the chaos of Reinhardt's recovery efforts, ignoring the NPCs trying to shove quests at him. He pushed through the crowd toward the royal palace instead.\n\n*They have no idea.*\n\nThe Kingdom wasn't weak. The opposite, actually. You didn't maintain neutrality for centuries by accident. No, the problem was simple.\n\n*The golems were fucking monsters.*\n\nEven the Giant Guild with a hundred thousand users backing them had been slaughtered like livestock. Happy had barely managed to destroy a single soul doll, and that had nearly killed him. Meanwhile, Grid's people carved through the army like it was made of wet paper.\n\nHuroi. Lauel. Euphemina. Grid himself.\n\nGrid had already assembled a terrifying roster of talent, and now he'd absorbed the Tzedakah Guild in front of the entire world. Within months, he'd eclipse the Giant Guild and Snake Guild combined.\n\n*Overgeared.* \n\nHappy rolled the name around in his head as he walked. \n\n*Maybe I should apply. Join that guild and my life's set.*\n\n***\n\nThe training ground swarmed with bodies. Thousands of users packed the space, all of them high performers from the golem invasion. A tiny fraction of the hundred thousand who'd shown up to fight, but these were the ones who'd actually accomplished something.\n\nAdministrators worked through the crowd, distributing rewards.\n\n\"Sixteen of you destroyed an old golem?\" An administrator nodded at a weary-looking party. \"Impressive work. The kingdom thanks you. Three hundred gold and one hundred contribution points.\"\n\nThree hundred gold translated to 360,000 won in real money. The users grinned, satisfied. Some shot envious looks at parties who'd managed to kill multiple golems.\n\n\"Sir Happy!\" \n\nThe administrator's eyes lit up when Happy stepped forward. \n\n\"Soldiers and civilians witnessed your valor on the battlefield. An old golem and soul doll, defeated alone?\" The man's voice rose with genuine admiration. \"You are awarded nineteen hundred gold and eight hundred kingdom contribution. The kingdom is grateful for your defense.\"\n\nWhispers rippled through the crowd.\n\n\"Damn. He soloed an old golem *and* a soul doll?\"\n\n\"Nineteen hundred gold...\"\n\n\"Isn't Happy a ranker, though?\"\n\n\"Yeah, three hundreds or four hundreds, I think.\"\n\n\"Still. That's ranker-level power right there.\"\n\nHappy snorted, pocketing his reward. \n\n*They're looking at the wrong person.*\n\nHis gaze drifted across the training ground to where Grid's group stood, bathed in golden light from the cameras. The king himself was handling Grid's ceremony personally. \n\n*How much are they getting?*\n\nHappy's fingers twitched. He needed to log out and watch this on TV.\n\n***\n\n*The legendary great magician.*\n\nGrid hadn't realized Braham was such an absolute freak. A man dead for hundreds of years, still capable of mobilizing an army that brought a kingdom to its knees. The sheer scale of power required for that made Grid's head hurt.\n\n*Why the hell did he invade the Eternal Kingdom, though?*\n\nWhatever the reason, Grid hated it. That insane dead bastard had nearly killed Sehee and Earl Steim. Grid wanted to crack open Braham's Message and see what excuses the magician had prepared.\n\n*But first...*\n\nThe throne room gleamed. Gold trim. Polished marble. Soldiers standing at attention despite having just survived an apocalypse and lost comrades.\n\n\"Glory to Viscount Grid!\"\n\nThe synchronized salute made Grid pause. These men had just buried friends and family. Their homes were destroyed. And yet here they were, backs straight, eyes forward.\n\n*Like when I was in the military.*\n\nThe memory surprised him. His service hadn't been pleasant, but distance had softened the edges. Grid found himself respecting the discipline, the duty these soldiers embodied.\n\n*Korean soldiers are suffering right now to defend the country, too.*\n\nThe thought carried unexpected weight. The world still fractured, still divided.\n\n*North Korean women are supposed to be pretty. Unification would be nice.*\n\nThump. Thump.\n\nGrid marched forward, spine straight. His stats gave him endurance and focus beyond human limits. The effect translated into presence. Pure, undeniable authority radiated from him with each step.\n\nThe king shifted on his throne. Nobles swallowed hard.\n\n*That's the bearing of a legendary warrior. No weaknesses.*\n\n*Those eyes... like staring into an ocean.*\n\n*That waist, those shoulders... if I'd had a body like that in my youth, I could have satisfied so many more women...*\n\nThe Holy Light Crown boosted Grid's Dignity past 850 points. That number exceeded most major nobles in the kingdom. The effect crushed the room's resistance. Even knowing Grid was a commoner, the nobles looked at him with envy instead of contempt.\n\n\"Thank you, once again.\"\n\nKing Wiesbaden's voice carried warmth. He had no idea Grid was connected to Braham. To him, Grid was simply the hero who'd saved his kingdom.\n\nGrid didn't know he was the culprit, either. But he could read a room. He held the power here.\n\n\"I hope Your Majesty will show me your sincerity.\"\n\nThe words were blunt. Borderline rude. If Grid had been anyone else, the king would have bristled and the nobles would have called for his head.\n\nInstead, silence. Then nods of appreciation.\n\nThe high Dignity stat recontextualized everything. Grid's directness became charming confidence. His demands became justified expectations. He could probably drop his pants and take a shit on the floor, and they'd call it a power move.\n\n\"Earl Aden.\"\n\nThe king gestured. An elderly nobleman stepped forward, managing the kingdom's finances with the grim expression of a man about to hemorrhage gold.\n\n\"First, we recognize Baroness Jishuka and the twenty-one warriors who reinforced the battlefield.\"\n\nThe Tzedakah Guild stepped forward as their names were called.\n\nEarl Aden's voice carried across the throne room.\n\n\"Baroness Jishuka and her companions saved Earl Steim, defended the kingdom, and assisted Viscount Grid in destroying six ancient weapons. For this service, you are awarded twenty thousand gold and ten thousand kingdom contribution. Additionally, each of you is elevated to the rank of Viscount for your loyalty.\"\n\n\"We are honored.\"\n\nThe guild members dipped their heads, satisfaction clear on their faces. The compensation matched their expectations perfectly.\n\nCameras flashed. Reporters whispered frantically into their microphones.\n\n『 Experts estimate roughly twenty users hold noble titles in Satisfy. Until today, only three held the rank of Viscount: Grid, Zibal, and Chris. 』\n\n『 Now twenty-two more Viscounts have been created in a single day. All twenty-two are Grid's subordinates. Each Viscount can appoint three knights, which means Grid effectively commands around seventy knights. The power consolidation is staggering. 』\n\nEarl Aden continued, his voice growing heavier.\n\n\"Huroi, Lauel, Euphemina, Ruby, and Sexy Schoolgirl. You fought alongside Grid to destroy seven hundred thirty-three old golems, one hundred eighty-seven soul dolls, and twelve ancient weapons. Without your intervention, this country would have fallen. You are hereby honored as heroes of the kingdom and awarded four hundred forty-two thousand nine hundred gold, one hundred eighty-four thousand eight hundred kingdom contribution, and the title of Earl.\"\n\nNotification windows materialized in rapid succession.\n\n> [The title 'Kingdom's Hero' has been obtained.]\n\n> [The title 'First Earl' has been obtained.]\n\n> [You have become an Earl of the Eternal Kingdom.]\n\n> [In accordance with Eternal Kingdom law, an Earl may command 10,000 soldiers and appoint five knights. An Earl may take up to three spouses. Monthly salary: 3,000 gold.]\n\n> **[Kingdom's Hero]**\n> A hero who saved the Eternal Kingdom from annihilation.\n> * All Stats +120\n> * Reputation throughout the Eternal Kingdom: Maximum\n\n> **[First Earl]**\n> The first user to achieve the rank of Earl.\n> * Dignity +200\n> * Charm +500\n> * Charm exceeding 500 causes both sexes to show significant favor toward you.\n\nThe reporters went silent for three full seconds. Then the feeding frenzy began.\n\n『 Earl rank? 』\n\n『 Doesn't the kingdom have strict limits on senior nobility? To create five Earls in one day... 』\n\n『 The financial burden must be enormous. The kingdom is willing to bleed resources to keep these people happy. 』\n\n『 If they're Earls, Grid has to become at least a Marquis. 』\n\n『 He's rewriting history every single time he appears. 』\n\n『 Wait. Sexy Schoolgirl barely fought, and she still got Earl rank? 』\n\n『 ... 』\n\nFive new Earls. All of them Grid's subordinates. The internet detonated with breaking news alerts. Stock tickers adjusted in real time.\n\nHuroi, Lauel, and Euphemina grinned, pleased to exceed their expectations.\n\nSehee and Yerim looked... bored.\n\n\"Is Earl rank good?\" Sehee asked.\n\nYerim shrugged. \"Maybe?\"\n\n\"Is four hundred forty-two thousand nine hundred gold a lot?\"\n\n\"Beats me.\"\n\n\"...\"\n\nLauel sighed, watching the two girls with a mixture of envy and despair.\n\n*Must be nice to be born with a platinum spoon in your mouth.*\n\n*I wish I had siblings like Grid's sister, too.*\n\nWhile Lauel wrestled with jealousy, Grid received his own reward.\n\n\"Viscount Grid. You led your knights and allies to destroy seven hundred thirty-three old golems, one hundred eighty-seven soul dolls, and twelve ancient weapons. Your achievements are unprecedented. You will be honored as a hero of the kingdom...\"\n\n\"I'll handle the rest, Earl Aden.\"\n\nKing Wiesbaden rose from his throne. He descended the steps, approaching Grid directly, a gesture reserved for the highest honors.\n\n\"Viscount Grid is awarded five hundred thousand gold, unlimited kingdom contribution, and the large city of Reidan. Additionally, you are elevated to the rank of Duke. Your statue will be erected in the Hall of Fame, preserving your legend for future generations.\"\n\n> [The title 'Kingdom's Hero' has been obtained.]\n\n> [The title 'First Duke' has been obtained.]\n\n> [You have become a Duke of the Eternal Kingdom.]\n\n> [Due to the continent's historical precedent, a Duke has no restrictions on power expansion. The royal family cannot openly constrain you.]\n\n> [Warning: Expanding power to the point of threatening royal authority will have severe consequences.]\n\n> [A statue in the Hall of Fame will generate special effects.]\n\n> **[First Duke]**\n> The first user to achieve the rank of Duke.\n> * Dignity +600\n> * Charm +800\n\n> [As a prominent figure, your reputation across the continent has increased by 10,000.]\n\n\"Pledge your eternal loyalty to the royal family.\"\n\nGrid opened his mouth. \"I, Grid...\"\n\nLauel's whisper cut through his thoughts like a knife.\n\n*Only swear loyalty to King Wiesbaden. Not the royal family. Just him.*\n\nGrid didn't understand the distinction. But Lauel hadn't steered him wrong yet.\n\n\"I, Grid, swear eternal loyalty to Your Majesty.\"\n\nSeveral nobles stiffened. The princes' faces darkened with poorly concealed rage.\n\nKing Wiesbaden, however, was over seventy and in visible decline. He missed the subtle rebellion entirely, smiling with genuine warmth.\n\n\"I accept your oath.\"\n\n***\n\nThe internet exploded within minutes.\n\nArticles praising Grid flooded every gaming site, news outlet, and social media platform. His fan cafes multiplied exponentially, membership counts spiraling into the hundreds of thousands.\n\nBut Noe's fan clubs grew even faster.\n\nGrid checked the numbers, then closed his browser in defeat.\n\n*Even as a Duke, I still can't beat a damn cat.*"
}