{
  "id": 206,
  "title": "Chapter 206",
  "content": "# Chapter 206\n\nThe title came with a price.\n\n\"Thank you.\" Marquis Steim gripped Grid's shoulder, his voice thick with emotion. \"Thanks to you, the kingdom stands. My position has risen beyond what I dared hope. Getting you as a son-in-law was the fortune of a lifetime.\"\n\nEarl Steim was now Marquis Steim. The king had recognized his contribution—more troops dispatched than any other noble—and rewarded the father of Grid's wife accordingly. A marquis with a duke for a son-in-law. The man's faction had become the largest in the kingdom overnight.\n\nAll of it would eventually pass to Irene. Which meant it would pass to Grid.\n\n\"Continue looking after my daughter, Duke Grid.\"\n\nGrid nodded. \"Of course, Marquis Steim.\"\n\n\"Good, good.\" The older man's eyes crinkled. \"But when will you give me a grandchild?\"\n\nGrid's jaw tightened. \"We're working on it.\"\n\n\"I should prepare some healthy food for you!\" Marquis Steim laughed, loud and unrestrained.\n\n*It's only once a month...* Grid bit back the complaint before it could escape.\n\n\"Once a month?\" Marquis Steim's laughter died. \"What was that?\"\n\n\"Nothing. Just talking to myself.\" Grid forced a smile. \"Nothing at all.\"\n\nNeither man noticed the cameras still trained on them, broadcasting their conversation to millions.\n\n***\n\n『 The relationship between Marquis Steim and Grid seems... intimate. 』\n\n『 Based on that exchange, I'd say father and son-in-law. 』\n\n『 Did Marquis Steim have a daughter? 』\n\n『 Only one. Lady Irene of Winston. 』\n\n『 The beauty? That Irene? 』\n\n『 She consistently ranks at the top of every NPC popularity poll. There was an uproar when news of her marriage broke. To think her husband is a user—and that it's Grid... 』\n\n『 Dear god. 』\n\nThe broadcasters sighed in unison. Envy radiated through the airwaves. Across the world, men threw remotes at their screens. Internet forums exploded.\n\n**>> He married Irene but still has Yura and Jishuka?**\n\n**>> Married couples can sleep together once a month in Satisfy...**\n\n**>> Eight months in-game means at least eight times...**\n\n**>> My Irene was defiled!**\n\n**>> Most importantly, Irene is Marquis Steim's sole heir. When he dies, Grid inherits everything.**\n\n**>> This is insane ㅋㅋㅋ**\n\n**>> Speaking of which, aren't Euphemina, Ruby, and Sexy Schoolgirl all pretty too?**\n\n**>> Yeah, same tier as Yura and Jishuka.**\n\n**>> So many beautiful women around Grid. Plus he'll eventually inherit Marquis Steim's power? I can't take this.**\n\nWhile curses flooded the internet, Grid stood apart from the celebration, eyes fixed on the cascade of notifications filling his vision.\n\n> **[The quest 'Save Earl Steim' has been completed.]**\n\n> **[Affinity with Marquis Steim has risen to maximum.]**\n> **[Marquis Steim would jump into fire for you.]**\n\n> **[The quest 'Defense War II' has been completed.]**\n\n> **[The Overgeared Guild's kingdom contribution has increased by 50,000.]**\n\n> **[The Overgeared Guild has gained 2 levels.]**\n\n> **[You have acquired 5,000,000 gold.]**\n\n> **[You have acquired the city of Reidan.]**\n\nGrid's breath caught. Five million gold from the quest. Another five hundred thousand from the king. Total: 5.5 million gold. He did the mental conversion automatically now. 6.6 billion won.\n\nThe most money he'd ever made at once.\n\n*The quest reward is worth more than a legendary item...*\n\nThe realization settled in his gut. Despite the difficulty, despite nearly dying, he felt vaguely cheated. *I could make more clearing quests than crafting.*\n\n*The problem is how often quests like this appear.*\n\nNot often. He knew that. Large-scale kingdom quests were rare by design. His thoughts drifted to Braham's soul fragments scattered across the continent in various labyrinths.\n\n*I hope he keeps attacking the kingdom.*\n\nThe smile crept across his face before he could stop it. Defend the kingdom every time Braham struck, collect massive rewards, become a tycoon. Simple.\n\n\"Your expression is concerning.\"\n\nGrid flinched. Lauel had appeared at his elbow, studying him with clinical interest.\n\n\"Are you thinking of that five million gold as personal property?\"\n\n\"If it's not mine, whose is it?\"\n\nLauel sighed. The sound carried profound disappointment. \"It's the guild's property, obviously. The rewards from a guild quest get invested back into the guild.\"\n\n\"What? I have to do that?\"\n\n\"Technically, you could keep it all.\" Lauel's tone turned pedagogical. \"The problem is credibility. Do you want to disappoint the guild members who fought beside you?\"\n\nGrid's face went pale. Sweat beaded on his forehead. Money had always been his primary motivator, but the thought of losing his guildmates' trust...\n\n\"Think bigger,\" Lauel continued, voice softening. \"Invest that five million in our development, and you'll see returns that dwarf this amount. You're aiming to be king, not just a duke. This is seed money.\"\n\nGrid swallowed. Lauel was right. King of a kingdom. That was the goal. That was where the real fortune waited. This was just an investment.\n\n\"I will hold a banquet for Duke Grid and the Overgeared Guild!\"\n\nKing Wiesbaden's voice rang across the courtyard. Lauel immediately stepped forward and bowed.\n\n\"Thank you for Your Majesty's grace.\"\n\nThe guild members followed suit with varying degrees of coordination. Grid remained rooted in place, staring into the middle distance.\n\n\"What are you doing?\" Lauel hissed.\n\nGrid's voice came out strangled. \"My kan jajang. I need to eat my kan jajang.\"\n\nKan jajang didn't get soggy as fast as regular jajangmyeon. There was still a chance it wasn't completely ruined. He could log out right now and salvage his meal. Seven thousand won worth of black bean noodles waiting for him.\n\nLauel's expression flattened. \"Don't say absurd things. Attend the banquet.\"\n\nHe'd tried jajangmyeon during his visit to South Korea—a decent, salty dish, but nothing worth postponing a royal banquet for. Grid opened his mouth to argue, then caught the dangerous glint in Lauel's eye.\n\n*My seven thousand won...*\n\nGrid's stomach twisted as he followed the others inside.\n\n***\n\nReinhardt Palace sprawled across the heart of the capital, a monument to excess and power. Gold leaf covered the columns. Jewels studded the walls. Everything gleamed.\n\n\"This garden is seven times larger than Winston Castle's,\" Pon observed, craning his neck to see the full scope.\n\n\"Six training grounds behind the barracks,\" Vantner added. \"The land here could fit a small village.\"\n\n\"I count gold and gems every time I turn my head,\" Zednos murmured. \"Incredible.\"\n\nThe live broadcast had ended. While servants prepared the banquet, the Overgeared members explored the palace grounds. They gaped and pointed like tourists. All except Grid, who continued his quiet lament.\n\n\"My kan jajang...\"\n\n\"Why do you keep saying that?\" Regas glanced over. \"Are you feeling unwell?\"\n\n\"What's kan jajang?\" another member asked. \"An item?\"\n\nCuriosity rippled through the group. Meanwhile, Sehee and Yerim stood frozen, faces drained of color.\n\n\"Five hundred thousand million...?\"\n\n\"F-five hundred... million?\"\n\nHuroi held up a calculator, nodding with satisfaction. \"Converting Korean won to the gold exchange rate, the exact value is 531,480 million won.\"\n\nThe figure represented the 442,900 gold they'd received as a guild quest reward. Sehee's legs went weak. Yerim's mouth hung open.\n\n\"Is it always this easy to make money?\" Yerim finally managed.\n\nThe misunderstanding was profound. Both girls had played Satisfy for mere hours. In their minds, the game was a money-printing machine available to anyone.\n\nLauel pinched the bridge of his nose. \"Ordinary people can't earn significant sums from Satisfy, even with full-time investment. You two achieved this windfall because of Grid.\"\n\nSomething shifted in the girls' expressions. \n\n*My brother is more impressive than I realized,* Sehee thought.\n\n*Youngwoo is premium husband material,* Yerim decided.\n\nJishuka watched the exchange from across the hall, eyes narrowing on Yerim.\n\n\"Sexy Schoolgirl? Who is this child?\" Her voice dropped to a dangerous register. \"Is she looking at Grid?\"\n\nShe'd spent several days at Grid's house—friendly with Sehee, but unfamiliar with her friend. Vantner, oblivious to the building storm, offered commentary.\n\n\"Ruby's friend. Pretty, right? Give her two or three years and she'll be as stunning as you.\"\n\nAnother guild member disagreed. \"She's already there.\"\n\n\"Both Ruby and Sexy Schoolgirl are beautiful,\" a third chimed in. \"More my type than Yura or Jishuka, honestly.\"\n\n\"I prefer Euphemina.\"\n\n\"Shut up, you creep.\"\n\nJishuka's temper flared. Her gaze locked with Yerim's across the room.\n\nThe younger girl smirked.\n\n*I'm better than the old one.*\n\nThe message transmitted clearly across the distance.\n\n\"This girl with the perverted ID...\"\n\nJishuka started forward. Jude materialized between them like a wall of muscle and confusion.\n\n\"Ruby. Sexy Schoolgirl. Jude will protect them.\"\n\n\"Move, you idiot.\"\n\n\"Jude isn't stupid. Grid is stupider.\"\n\n\"That fool is beyond foolish!\"\n\n\"I'm not an idiot.\" Jude's tone remained placid. \"Idiot.\"\n\n\"The banquet is ready.\"\n\nA minor noble scurried over, gesturing frantically toward the dining hall. The timing saved everyone from violence, though the tension between Jishuka and Yerim followed them like a toxic cloud.\n\n***\n\nThe banquet table groaned under the weight of delicacies. Roasted meats, fresh fruits, imported wines. A feast worthy of heroes.\n\nGrid found himself wedged between two forces of nature.\n\n\"Here, try this.\" Yerim's voice dripped honey as she held a fork to his lips.\n\n\"I'll give you this one.\" Jishuka's attempt at sweetness came out strained, mechanical.\n\nThey competed viciously, shoving food into his mouth faster than he could chew. Flavors blurred together. His jaw worked overtime. Taste became irrelevant in the face of survival.\n\nGrid choked on a particularly aggressive piece of meat.\n\n\"Kekek.\"\n\nMarquis Steim's laughter boomed across the hall. \"Heroes are always surrounded by beauties! It reminds me of my youth!\" He slapped the table, delighted.\n\nThe marquis had only ever married once, but he wouldn't dream of imposing such limitations on his son-in-law. Lauel watched the spectacle and sighed.\n\n*Lady Irene deserves better.*\n\nThe situation was absurd. Worse than the overwrought Korean morning dramas he'd suffered through during his stay in Seoul for the National Competition. \n\nAcross the table, Sehee's expression darkened. She watched her brother surrounded by women and carved into her steak with excessive force.\n\n\"Enemy!\"\n\nThe word was barely audible, but Jude's head snapped around. His hand went to his sword hilt. The motion created a ripple of alarm through the nearby guards.\n\nThus the royal banquet descended into controlled chaos, the atmosphere growing stranger with each passing minute.\n\n***\n\n**Yubadakan Castle, Haken Kingdom**\n\n\"It's fortunate, isn't it?\" Box, one of the Snake Guild's thirteen executives, leaned back in his chair. \"His subordinates got titles, but Grid was the only one granted territory. The rest are nobles in name only.\"\n\nZibal's frown could have curdled milk. \"Fortunate? You fool. The fact that they received titles is precisely what matters.\"\n\nBox blinked.\n\n\"Titles make them eligible to become lords,\" Zibal continued, voice tight with frustration. \"In the future, Grid will expand his territory without restriction. He'll carve out sections for his subordinates. His power will grow exponentially. Imagine his authority when he has dozens of lords under his command.\"\n\nUnderstanding dawned on Box's face. \"That's... concerning.\"\n\n\"Concerning?\" Zibal stood abruptly. \"It's catastrophic. We need to set aside our differences. I must contact the leaders of the seven guilds immediately.\"\n\nThe game had changed. Grid was no longer just a powerful individual. He was becoming something far more dangerous.\n\nA true power."
}