{
  "id": 208,
  "title": "Chapter 208",
  "content": "# Chapter 208\n\nGrid wiped the sweat from his brow. \"Do you remember Rabbit?\"\n\nEuphemina's eyes brightened. \"How could I forget?\"\n\nShe'd first met Grid because of that administrator. Rabbit had recruited her for the production game, then asked her to break Grid out of prison. The man's mind worked faster than most humans she'd encountered in Satisfy.\n\n\"He was the brains behind the Mero Company,\" she said.\n\n\"Good.\" Grid leaned against the desk. \"What do you think about inviting him to the guild?\"\n\nEuphemina opened her mouth to answer, then stopped.\n\n*Focus.*\n\nGrid's robe hung loose on his shoulders, damp cloth clinging to the muscle beneath. The casual disorder of his appearance struck her harder than it should have. She blinked, forcing her attention back to his face.\n\n\"Euphemina?\"\n\n\"Sorry.\" She shook her head. \"You were saying?\"\n\n\"Rabbit. Should we invite him to the guild?\"\n\n*Right. Business.*\n\n\"Yes,\" Euphemina said. \"He turned the Mero Company into the north's dominant force. That takes serious talent. Plus, he recognized your potential when you were still a nobody. That kind of judgment is rare.\"\n\nGrid nodded slowly. \"Probably a named NPC.\"\n\n\"Definitely.\" Their time with Rabbit had been brief, but his competence had left an impression. \"Though there's one problem.\"\n\n\"He's in prison.\"\n\n\"Exactly.\" Euphemina crossed her arms. \"Your father-in-law sentenced him to ten years. How do we get him out?\"\n\n\"Why can't I get him out?\"\n\nGrid reached into his inventory. Light flared as he withdrew a sword, its blade humming with a faint resonance.\n\n> **[Great Lord's Sword]**  \n> Durability: 220/220 | Attack Power: 220  \n>  \n> **Dignity** +150  \n> **Insight** +150  \n> **Leadership** +150  \n>  \n> Generates skill: **Character Observation**  \n> Generates skill: **Talent Search**  \n>  \n> *A rare sword only given to the best lords. Allows close observation of soldiers and residents for efficient command.*  \n>  \n> Weight: 200\n\nHe offered it to Euphemina.\n\n\"I'm a duke now,\" Grid said. \"My authority overrides a marquis's sentence.\"\n\n\"...Probably?\"\n\nGrid shrugged. \"He became a marquis because of me. He'll listen to one small request from his son-in-law.\"\n\n*That logic is so Grid.*\n\nEuphemina waved off the sword. \"I don't need this.\"\n\n\"Take it anyway. Check Rabbit's potential before you recruit him.\"\n\n\"I already have Character Observation.\" She tapped her temple. \"Unlocked it when my Insight hit 1,600.\"\n\nGrid's expression soured. *1,600? I'm barely at 1,100, even with the Kingdom's Hero bonus.* \n\nCharacter Observation let you examine an NPC's stats, skills, and potential without equipment. Euphemina's class as a Duplicator made Insight her primary stat, pushing her far beyond normal thresholds.\n\n*Envious doesn't begin to cover it.*\n\n\"Should I bring Rabbit back to Winston?\" Euphemina asked.\n\n\"No. Take him to Reidan. We're leaving soon.\"\n\n\"Understood.\"\n\nShe left the office, her footsteps fading down the corridor. Grid turned the Great Lord's Sword over in his hands, studying the craftsmanship.\n\n*Is there hidden talent in Winston I haven't found?*\n\nHe wanted to tie up loose ends before departing. The Talent Search skill could reveal exceptional NPCs among the common population. Grid started toward the door, then froze mid-step.\n\n*Kesan Canyon.*\n\nThe memory surfaced like a blade from still water. When he'd gone to find Pagma's Swordsmanship, an NPC claiming to be a Saharan knight captain had tried to offer him a quest.\n\n*What was his name? Piero?*\n\nThe man had been terrifyingly strong. Grid had only encountered one other NPC with that kind of presence: Doran. Even Jude armed with the +8 Dainsleif wouldn't match him.\n\n*I have to recruit him.*\n\nGrid weighed the risk. If the invitation failed, what did he lose? The NPC had mentioned the Saharan Empire, and Reidan bordered their territory. The proximity was an advantage.\n\n\"Worth a shot.\"\n\nHe summoned the guild members to the courtyard.\n\n\"Take Khan and head to Reidan,\" Grid said. \"Start organizing the city. I'll catch up. Oh, and bring Minor. Don't let him out of your sight, or he'll vanish.\"\n\nVantner scratched his bald head. \"You're not coming with us?\"\n\n\"I need to make a detour.\"\n\nLauel appeared, fresh from confiscating Shay's party's equipment. He fixed Grid with a pointed stare. \"You're the guild master. When you go off on personal business, you owe us details. So we don't worry.\"\n\n\"I'm picking up a treasure.\"\n\nThe words sparked immediate interest. Several guild members leaned forward.\n\n\"Then I'll head out.\" Grid turned before they could ask questions. \"See you in Reidan.\"\n\nThe journey west would take them days. Grid made his farewells to Irene in private, then launched himself into the sky alone. Wind howled past as he angled toward Kesan Canyon.\n\nHe pulled Braham's Message from his inventory mid-flight.\n\n> **[Do you want to open Braham's Message?]**\n\n> **[Warning: Unidentified magic power detected.]**\n\nGrid's gut clenched. He remembered the treasure chest in the Golem's Labyrinth. That had nearly killed him.\n\nHe equipped every defensive item he owned. The Pavranium blades orbited him in a protective pattern.\n\n*Alright. Open it.*\n\n> **[Unidentified magic power is forming a voice.]**\n\nBraham's words carved directly into Grid's mind like hot iron.\n\n> *Pagma's Descendant. If you're receiving this message, you've defeated my golem army. This is your warning: Obtain the four blessings of the gods and create the Vessel of the Soul. Resurrect my body. If you continue delaying, disaster will follow.*\n\n\"You invaded an entire kingdom just to threaten me?\"\n\nGrid's jaw clenched. Thousands of people had died. Soldiers, civilians, children. All because a dead magician wanted to make a point.\n\n*He's worse than selfish.*\n\nGrid pulled up the quest information.\n\n> **[Great Magician's Resurrection]**  \n> Rating: Second Class Quest  \n>  \n> The legendary great magician Braham was a genius who reigned supreme from the moment he began learning magic. Myth claims he survived battle against the fire dragon Trauka without perishing.\n>  \n> In his old age, he mourned his mortality. Having transcended humanity mentally and physically, he sought immortality through the 'Vessel of the Soul'—an object capable of regenerating a mortal soul into an immortal one.\n>  \n> The Vessel could only be made from materials not of this world. Braham learned his old friend Pagma was attempting to create such a mineral. Together, they forged **pavranium**.\n>  \n> Braham believed pavranium could construct the Vessel of the Soul. But Pagma, the only blacksmith capable of smelting it, died of old age.\n>  \n> Braham never achieved his wish.\n>  \n> Before his own death, he created 28 labyrinths filled with minerals, sealing fragments of his soul within each. He believed this would lure Pagma's Descendant.\n>  \n> 300 years have passed. One fragment has found you.\n>  \n> **Quest Objective:** Create the Vessel of the Soul.  \n> **Reward:** Large quantity of pavranium.\n\n*There's something off.*\n\nGrid had read that Pagma died 100 years ago. But this quest claimed Braham died 300 years ago. The timeline didn't match. He'd missed the discrepancy before, too focused on immediate survival.\n\n*What's Braham hiding?*\n\nBesides, Grid didn't need the quest reward. Minor had already helped him locate seven pavranium deposits in the north. They'd recover the rest eventually.\n\n\"Great Magician's Resurrection? Screw that.\" Grid dismissed the notification. \"You want to threaten me? Fine. Threaten me. I don't like your attitude, you arrogant bastard.\"\n\nClass quests were mandatory for understanding Pagma's story and completing his class evolution. But Grid wasn't sweating it. Once he collected all the pavranium, the narrative would advance on its own terms. He'd learned that much from clearing impossible quests.\n\n> **[Braham's Message has been destroyed.]**\n\nGrid accelerated, wind screaming past his ears. Two hours later, Kesan Canyon's jagged walls rose into view.\n\nLoran Falls thundered in the distance, mist rising like incense at a shrine. The people of the Eternal Kingdom considered this place sacred.\n\nGrid descended to the canyon floor.\n\n\"Come out!\" His shout echoed off stone walls. \"Piero!\"\n\nSilence answered for several heartbeats. Then:\n\n\"My name is Piaro, not Piero.\"\n\nThe middle-aged farmer materialized from shadow and mist. His eyes narrowed as he studied Grid.\n\n\"I don't recognize you.\" Piaro's hand drifted toward the sickle at his belt. \"Did Asmophel send you?\"\n\nGrid had changed too much since their first meeting. His equipment, his bearing, his presence—all transformed.\n\nPiaro's stance shifted, weight settling low. \"Your skill... You could handle the current Asmophel, couldn't you?\"\n\n*He's on guard.*\n\nGrid radiated the quiet confidence of a legend now. It put Piaro on edge in a way their previous encounter hadn't.\n\nGrid cut straight to the point.\n\n\"Become my knight.\"\n\nHe activated the Great Lord's Sword's observation skill. The information that flooded his vision hit harder than crafting a legendary item.\n\nHis pulse quickened.\n\n*Jackpot.*\n\n---"
}