{
  "id": 209,
  "title": "Chapter 209",
  "content": "# Chapter 209\n\n> **Name:** Piaro  \n> **Age:** 39 **Gender:** Male  \n> **Class:** Swordsman/Hermit  \n> **Title:** Great Swordsman\n> \n> * The closest person to becoming a sword saint in this age.\n> * When a blade type weapon is equipped, attack power will increase by 40% and attack speed by 10%. This effect is applied separately from the Sword Mastery skill effect.\n> \n> **Level:** 367  \n> **Strength:** 2,038 **Stamina:** 1,380  \n> **Agility:** 1,910 **Intelligence:** 530  \n> **Leadership:** 812 **Indomitable:** 824\n> \n> **Skills:** Trap Installation (C+), Empire's Swordsmanship (B), Overwhelming (A), Empire's Military Tactics (A+), Great Swordsman's Enlightenment (S+), Supreme Swordsmanship (SS), Fated to Perish (??).\n> \n> A descendant of a prestigious bloodline in the Saharan Empire, he was born with a natural talent for swordsmanship and military tactics. He joined the knights at a young age and became a captain in only 12 years.\n> \n> In the following 5 years, he succeeded in winning a lot of achievements. However, 2 years ago, he witnessed the liaison between Asmophel and Empress Marie.\n> \n> He was wrongfully branded as an imperial traitor and forced to flee.\n> \n> * Currently, this person is suffering from a severe sickness of the heart. He has lost his original nature and all stats are reduced by 20% from those shown in the status window.\n> \n> **[Trap Installation]**  \n> Piaro can install simple traps. It's a skill acquired to beat his pursuers.\n> \n> **[Empire's Swordsmanship]**  \n> The basic swordsmanship passed down to the knights of the Saharan Empire. It is made of five forms and is easy to learn, but the power is relatively good.\n> \n> Piaro has reconstructed this swordsmanship and raised it to a higher level.\n> \n> **[Overwhelming]**  \n> Piaro can overwhelm a target that has a much lower level than you. The overwhelmed target will feel fear.\n> \n> **[Empire's Military Tactics]**  \n> High level military tactics that the Saharan commanders learn. Piaro personally studied these tactics and raised it to another level.\n> \n> He can seamlessly command thousands of troops.\n> \n> **[Great Swordsman's Enlightenment]**  \n> Piaro developed aura after achieving enlightenment as a swordsman. Be cautious, since forming the aura will take some time.\n> \n> Now that he has become one with the sword, his aura has become intangible and more powerful.\n> \n> His sword techniques have gone beyond the limits of a human.\n> \n> **[Supreme Swordsmanship]**  \n> The swordsmanship that was passed through Piaro's family for generations. Piaro was able to become a great swordsman by mastering this swordsmanship that hasn't been mastered by anyone in his family for hundreds of years.\n> \n> There is a theory that this swordsmanship originated on the Eastern Continent.\n> \n> **[Fated to Perish]**  \n> Piaro's unique technique. The sword will attack one point on the target. The target hit by the sword must die.\n> \n> Piaro is deserving to be a legend just from this technique alone.\n> \n> **Skill Mana Consumption:** 40% of the maximum mana.  \n> **Skill Cooldown Time:** 1 hour.\n> \n> * This skill can't be applied in quests and raids.\n\n*Beyond my expectations.*\n\nGrid scanned the status window again. Piaro's passive skill matched the power of his own Pagma's Swordsmanship (Lv. 2), which boosted physical attack by 30%, critical hit rate by 20%, and critical damage by 10%. The active skills were even more impressive.\n\n*That Fated to Perish ability. A skill that guarantees death?*\n\nThe technique alone qualified Piaro as legendary material. A legendary-rated skill, without question. But something else caught Grid's attention.\n\n*No stat caps.*\n\nEvery NPC Grid had observed possessed hard limits on their growth. Jude. Minor. Even high-tier NPCs hit walls eventually. Piaro's name glowed gold in the interface, but the stat columns showed no maximum values. Infinite growth potential, just like a user.\n\n*This is what a real named NPC looks like.*\n\nGrid's pulse quickened. He stepped forward. \"You. Become my knight.\"\n\nPiaro's eyes narrowed. \"What?\" His weathered face twisted into a frown. \"Several things need clarification. First.\" He crossed his arms. \"Who are you?\"\n\nGrid straightened his spine. His voice came out steady. Confident.\n\n\"I'm Grid. Pagma's Descendant and a duke of the Eternal Kingdom.\"\n\nThe Saharan Empire stood at the continent's peak. They dismissed the Eternal Kingdom as provincial at best. Tribute flowed from the kingdom to the empire every year, like water running downhill. To a former noble of the Saharan Empire, a duke from such a minor kingdom carried little weight.\n\nBut then.\n\n\"Pagma's Descendant?\"\n\nPiaro's posture shifted. Blacksmith Pagma had earned his reputation as the greatest swordsman since Sword Saint Muller. A legend's inheritor naturally commanded interest.\n\n\"Is this true?\"\n\nPiaro dropped into a combat stance without conscious thought. His instincts as a swordsman.\n\nGrid's smile came out crooked. \"Why that look? Want to fight?\" He raised his hands. \"I'd rather not.\"\n\nPiaro leveled his sword at Grid's chest. \"You started this. Demanding I become your knight?\" The blade's tip didn't waver. \"I should verify your qualifications first.\"\n\n*I can gauge Pagma's Descendant's level. Then measure the gap between us and Sword Saint Muller.*\n\nPiaro's feet moved. The distance between them collapsed in a heartbeat.\n\n*Is he seriously swinging at me? Fighting maniac.*\n\nGrid had wanted to avoid this. The old version of himself would have bolted. But that pathetic coward had died somewhere along the way. He yanked out <span class=\"rarity-legendary\">+9 Failure</span>.\n\n**JEEEONG!**\n\nThe ring of steel on steel echoed through the clearing. Piaro's eyes widened at the blue shark-shaped greatsword.\n\n\"Fine craftsmanship.\"\n\nGrid glanced at Piaro's weapon and snorted. \"Your sword looks like garbage.\" He jerked his chin toward the nicked blade. \"Needs repairs. Badly.\"\n\n\"The weapon means nothing.\"\n\n**Kkirik!**\n\nPiaro rotated his sword against Failure's edge. Pressure slammed into Grid's arms like a physical blow. His fingers spasmed. The greatsword nearly slipped from his grip. He clenched harder, knuckles white.\n\n*I have higher strength. Why am I losing in raw power? Some kind of technique?*\n\nGrid's strength concentrated in his upper body to maintain his hold. Piaro's boot lashed out at his ankle.\n\n\"Eh?\"\n\nGrid stumbled sideways. Piaro's other foot rocketed toward his exposed face.\n\n\"Kuk!\"\n\nGrid jerked his knee up to intercept the kick. His strength shifted downward to his lower body.\n\n**Chukak.**\n\nPiaro spun his blade again and carved into Failure's guard. The edge bit into Grid's chest. Blood sprayed across his armor.\n\nPiaro shook his head. \"Crude techniques. Your claim of being Pagma's Descendant is false.\" His lip curled. \"Or perhaps Pagma's skill was this pathetic to begin with.\"\n\n\"Crude?\" Grid's vision tinged red. \"Insult Pagma all you want, but don't you dare humiliate me!\"\n\n\"...\"\n\nGrid's expression hardened into something cold. His pride had taken too many hits today. He activated Pagma's Swordsmanship. \"Link!\"\n\nTwenty-one blue-white blades materialized from nothing and swarmed toward Piaro at horrifying speed.\n\nBut.\n\n**Chaeeeeeng!**\n\nPiaro's sword became a blur. Minimal movements. Perfect economy of motion. All twenty-one strikes deflected. His stats had dropped 20%, yet his agility still doubled Grid's current speed. The gap in their builds became painfully obvious. Grid had been pouring everything into strength and stamina for so long.\n\n*Speed matters in swordsmanship. I need to invest in agility going forward.*\n\n\"Your strongest technique?\" Piaro's tone dripped with derision.\n\n\"Not even close!\"\n\nGrid pulled from his combat experience. The combo he'd refined through countless battles. Theoretically unbeatable.\n\n\"Pagma's Swordsmanship, Restraint!\"\n\nThe skill locked Piaro's movements in place. Grid struck three times in rapid succession. He deliberately avoided linking into Kill, which might actually kill the man. As Restraint's duration expired, Grid chained into Wave to slow Piaro's reactions, then immediately triggered Link again.\n\nPiaro's massive agility and passive defenses blocked most of the assault. But eventually two strikes slipped through his guard. He coughed. Blood flecked his lips.\n\nThen his sword clattered to the ground.\n\n\"What?\" Grid blinked, still riding the combat high. His frown deepened. \"That's it?\"\n\nPiaro straightened. Wiped his mouth. \"You held back as well. I concede.\"\n\nThe truth was neither had used their full arsenal. Piaro never activated Fated to Perish. Grid possessed his invincible passive as a safety net. Still, Grid didn't doubt the outcome. His expression brightened.\n\n\"Good. I won. So now you'll become my knight?\"\n\nPiaro shook his head. \"I said I would verify your qualifications. I made no promise about becoming your knight.\" He met Grid's eyes. \"I'm sorry, but I swore never to pledge allegiance to anyone again. I can't accept your request.\"\n\n\"Traumatized because your master abandoned you?\"\n\n\"What?\"\n\nGrid spoke plainly to the stunned man. \"I know your situation. You were framed by a colleague. Became a fugitive.\" He paused. \"The emperor didn't defend you. That means he doubted your loyalty too.\" Grid tilted his head. \"Now you're determined to isolate yourself completely. Betrayed by everyone you trusted?\"\n\nKilling intent rolled off Piaro for the first time. His eyes went flat and cold.\n\n\"Only the empire knows that story. It can't be discovered through rumors.\" His hand drifted toward where his sword had fallen. \"Did Asmophel tell you?\"\n\n\"No?\" Grid tapped his own face. \"I heard this directly from you.\"\n\nNonsense. Piaro's confusion was written across his features. Grid pointed at his own eyes.\n\n\"Look closely. Don't I seem familiar somehow?\"\n\n\"Now that you mention it...\" Recognition dawned slowly. \"You're that person?\"\n\nA year and a half ago. Someone had entered Kesan Canyon alone. A place infested with powerful monsters. Back then he'd been weak, but showed potential for rapid growth. Piaro had asked him to act as his proxy.\n\n\"Remarkable.\" Piaro studied Grid's face. \"Your skills, presence, appearance. Everything changed.\" He frowned. \"I didn't think you'd grow from that ugly wretch.\"\n\n\"Even if I was ugly, you didn't have to say it like that...\"\n\nGrid's jaw clenched. Frustration and shock warred on his face.\n\nA beat of silence.\n\nGrid forced his mind back on track. He tried again.\n\n\"I'll get your revenge. In exchange, come with me.\" Grid spread his hands. \"Isn't it unfair? Living isolated from the world just because of one traitor's actions?\"\n\nPiaro's gaze sharpened. \"I don't understand why you need me. The Eternal Kingdom enjoys guaranteed peace as a neutral nation.\" His head tilted. \"Why do you need my help?\"\n\n\"I want you to escort me when I go mining...\"\n\n\"What nonsense.\"\n\n*If I can achieve revenge...*\n\nThe thought cut through Piaro's mind like a blade. Asmophel had stolen everything. His loyal colleagues lay dead. Revenge remained Piaro's final desire.\n\n*If I can have revenge, I'd even sell my soul to the devil.*\n\nBut the question haunted him. What came after? Could he pledge the rest of his life to another person?\n\nWhile Piaro hesitated, Grid drove straight to the heart of it.\n\n\"You demanded a duel the moment you heard I'm Pagma's Descendant. That means you still hunger for strength.\" Grid leaned forward. \"Don't you want to become a sword saint? Among my companions, many are strong. Don't you want to live and train alongside them?\"\n\n\"I doubt I can be loyal to you.\"\n\n\"Don't force yourself to be loyal. You don't have to pledge as a knight if you're unwilling.\" Grid waved a hand. \"Stay as my guest. You decide for yourself whether you want to follow me.\"\n\n*I can't lose Piaro. Not this opportunity.*\n\nGrid took a step back from his original demand. Left Piaro room to breathe. Gave him a choice instead of a cage.\n\nPiaro had no grounds left to refuse.\n\nOn that day, Grid departed the city where he'd lived for a year and eight months after becoming Pagma's Descendant. The legend shifted to a new stage.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}