{
  "id": 210,
  "title": "Chapter 210",
  "content": "# Chapter 210\n\nMost of the magic formulas used by magicians today were established by Braham. Thanks to Braham, the science of magic developed and the authority of magicians rose. For magicians, Braham was a teacher and object of respect.\n\nBut what was the truth?\n\nBraham's achievements, the ones people celebrated, actually belonged to Mumud. The person who simplified complicated magic formulas, made them easier to learn, and spread them across the world was Mumud, not Braham.\n\nThen why was Mumud unknown while Braham received all the praise? Only Braham knew.\n\n***\n\nThe Golem's Labyrinth.\n\n> [You ignored my warning. Pagma's Descendant, you are the first person to make me this angry since Mumud.]\n\nBraham's fury burned at Grid's silence. His 28 souls twisted like flames caught in a gale.\n\n> [I will make you regret it.]\n\nIn the past, Mumud had been Braham's best disciple. Mumud's talents grew day by day, threatening to surpass even his master. Braham couldn't tolerate it. He refused to let his top position be stolen by a disciple, so he monitored Mumud's every move.\n\nThat was how the 'Eyes of Surveillance' magic came to be attached to Mumud's Orb.\n\n> [I will find out your weakness.]\n\nGrid had reproduced Mumud's Orb for Euphemina, allowing Braham to watch his every move. The day would come when Grid would dance to Braham's tune, whether he wanted to or not.\n\n***\n\nDeep in the forest, a man with matted hair waited by a campfire. Great Swordsman Piaro looked up as Grid materialized into the world.\n\nGrid approached with a smile. \"Good morning. Have you eaten?\"\n\nHis attitude towards Piaro was remarkably friendly, far warmer than when he dealt with beautiful people like Yura and Jishuka. Piaro, however, remained cold.\n\nHe stood. \"I ate. Let's go.\"\n\n\"Yes.\"\n\nGrid's smile didn't falter. The thought of having the strongest swordsman as his ally filled him with satisfaction.\n\n*If Piaro becomes a sword saint...*\n\nThe possibilities stretched out before him. Unsurpassed power. No more fear of demons like Hell Gao. Maybe he could even try raiding a dragon.\n\n*It's enough for now.*\n\nStrength, stamina, agility. Combined, Piaro's combat-related stats surpassed Grid's own. He also possessed the strongest skills. Very reassuring. But there was one drawback.\n\n*His appearance is deplorable.*\n\nPerhaps it was the sickness of the heart. Piaro looked ancient, weathered beyond his 29 years. He could pass for 50.\n\n*It's a matter of style.*\n\nThe shabby attire, the shaggy hair matted like a homeless person's. The scruffy beard. The stench.\n\n*Appearance is important.*\n\nGrid had once had the worst appearance himself. He knew better than anyone how much it mattered. Hadn't people despised him just for being ugly, just for his clothes? Grid pulled noble clothing from his inventory, a gift from Irene. His hand hesitated over the 50 gold value, but he closed his eyes and extended it.\n\n\"Put this on. And why don't you cut or tie your hair up?\"\n\nPiaro's refusal came immediately. \"I don't care about my appearance.\"\n\n\"I'm embarrassed to go around with you.\"\n\nThe words tasted familiar in Grid's mouth. How many times had Sehee said the same thing to him?\n\n*This is how Sehee felt.*\n\nA bitter smile crossed Grid's face.\n\nPiaro's response was blunt. \"You have to endure it if you want me to come with you.\"\n\n\"Ah...\"\n\nPiaro's nerves were sharp. Anger burned in his eyes, the only thing visible there. Obsessed with revenge. As stated in the status window, Piaro was currently suffering from a sickness of the heart and had lost his original nature.\n\nGrid swallowed his words. Rather than forcing or persuading, he would let Piaro do as he wanted. It was the best and smartest choice for someone with little experience building relationships.\n\n***\n\nGrrr.\n\nA pair of twin ogres materialized in front of them after half a day's walking. Powerful level 260 monsters that were nothing more than puppies before a legendary class and a Great Swordsman.\n\nSeokeok!\n\nPiaro's twin ogre fell in seconds, bifurcated before it could roar.\n\nPeeeeok!\n\nGrid took around a minute to destroy his.\n\nPiaro wiped blood from his blade with a scrap of cloth. \"I felt it when we fought the other day, but your basics are terrible. You can implement Pagma's wonderful techniques, but you haven't mastered the sword.\"\n\nGrid had been using a greatsword since Satisfy began. He might not be the best, but he knew the basics. Still, considering his experience and level, the gap was obvious.\n\nHe grimaced. \"I don't care about swordsmanship. I'm armed with excellent weapons and armor. If I rely on my equipment, I can overpower my opponent.\"\n\n\"Wrong.\" Piaro's voice cut like his blade. \"That mindset is wrong for warriors. Moreover, it's foolish to rely on equipment that isn't suitable.\" He pointed at Braham's Boots. \"If you truly want to rely on equipment, you should change those shoes first.\"\n\n\"Why?\"\n\nThe defense of Braham's Boots was outstanding for a level 240 item. Light, comfortable, they increased movement speed. They couldn't compare to <span class=\"rarity-legendary\">Failure</span> or the <span class=\"rarity-legendary\">Holy Light Set</span>, but the **Fly** ability made them valuable.\n\nGrid's expression conveyed his skepticism clearly. *You don't know anything.*\n\nPiaro sighed. \"The greatsword emphasizes power over swiftness. To put as much weight as possible behind your strikes, you need sturdy shoes that can withstand that weight.\"\n\n*What is this?*\n\nGrid wasn't quick to understand new concepts. He needed things spelled out.\n\nPiaro continued with more direct explanation. \"Heavy boots make it easier to concentrate your weight. You gain more power behind your strikes. I recommend heavy boots.\"\n\n*So... Wearing heavy boots will increase the greatsword's attack power?*\n\nGrid's face lit up. *I found a hidden system!*\n\nThe thrill of discovery rushed through him. Most people didn't know about this. Named NPCs could give all sorts of specific advice. His fondness for Piaro grew.\n\n*I'll be able to get ahead of others.*\n\nGrid didn't know that this was already common knowledge to most users. Heavy weapon users armed with heavy boots received additional attack power from the system. Basic game mechanics.\n\nHis ignorance remained intact.\n\n***\n\n\"Is this Patrian?\"\n\n\"Yes.\"\n\nAfter three days of travel, Grid and Piaro arrived at the fortified city. Patrian. A strategic point at the border of the Gauss Kingdom, establishing the boundary that separated the western and northern parts of the Eternal Kingdom.\n\nGrid's starting city.\n\n*I lived here for nearly a year...*\n\nHe'd hunted countless orcs and goblins around Patrian. Cleared every type of quest. Maximized his affinity with all the residents. Received Earl Ashur's quest. Eventually became Pagma's Descendant.\n\n\"That bastard Ashur...\"\n\nGrid's teeth ground together. The memory of being forced into Pagma's Descendant status burned. His days as a minus level character trembled through his mind.\n\n*...I vowed revenge once I became stronger.*\n\nThe fury had consumed him for a while. But that was the past. Earl Ashur's betrayal had inadvertently benefited him.\n\nHe exhaled. \"We'll stay here tonight and leave tomorrow.\"\n\nAt this pace, they'd arrive in Reidan in four days. Grid entered Patrian with Piaro, relaxed and unsuspecting.\n\nAt that moment, Earl Ashur's detection magic flared. He checked Grid's identity through the magic spheres installed throughout Patrian. Rose to his feet.\n\n\"He isn't afraid of this place...!\"\n\nEarl Ashur had dreamed of revenge ever since Grid stole Pagma's Rare Book from under his nose. He summoned his knights immediately.\n\n\"We're going hunting.\"\n\nThe opportunity was perfect. Joy overcame caution, despite his awareness of Grid's importance. He knew Grid had become a duke. He didn't care.\n\n***\n\n\"This meal tastes terrible.\"\n\nGrid poked at the greasy stew with a wooden spoon.\n\nPatrian was a fortified city, not a tourist destination. It didn't cater to outsiders. The cheap inn they'd found lacked proper facilities.\n\nPiaro watched Grid complain about the meal. \"Why are you hiding your identity?\"\n\nGrid claimed to be a duke of the kingdom. If true, the city's owner should have greeted him with grand hospitality. Yet Grid had concealed his identity with a hat before entering. Like a wanted criminal, not a duke.\n\nGrid swallowed a mouthful of stew before answering. \"We're only staying overnight. I don't want to be bothered.\"\n\n\"Hrmm...\"\n\nGrid's actions didn't matter to Piaro. He only cared about revenge. Piaro tilted his glass. Cheap alcohol, but the first he'd tasted in two years.\n\nMeanwhile, other users stared at Grid and Piaro with puzzled expressions.\n\n\"Strange combination.\"\n\n\"Why are those two together?\"\n\nGrid was dressed in beginner's clothing to conceal his identity. Piaro looked like a beggar. People recognized Grid as a newbie and Piaro as a beggar NPC. The pairing confused them.\n\n\"No matter how cheap the food is, it'd be burdensome for a beginner to afford... How can he buy drinks as well?\"\n\n\"The smell is too much.\"\n\n\"Really annoying. What is that?\"\n\nFemale users wrinkled their noses at the odor emanating from Piaro. Male users, seeing their reactions, stepped forward to play hero.\n\nOne approached the table. \"Hey, Beggar. I don't know why a poor person is trying to get drunk, but can you stop disturbing the other guests with your rancid smell?\"\n\nHis companion nodded. \"The ladies have lost their appetite because of you. Get lost.\"\n\nUsers didn't care about NPCs. The treatment was worse when the NPC was a beggar. Piaro ignored them. Grid didn't even look up. The two men weren't worth acknowledgment. He continued enjoying his food and drink.\n\nGrid chewed a steamed lizardman tail. \"These are good. Similar to pig trotters.\"\n\n\"What are pig trotters?\" Piaro frowned. \"I've tasted all types of delicacies in the empire, but I've never heard of such a dish.\"\n\n\"Delicious pig's feet.\"\n\n\"Hah~ the beggar is ignoring us.\"\n\nThe level 109 user called Coke flushed red at being dismissed. His anger overrode his common sense. His hand moved.\n\nPiaro didn't allow it.\n\nHe spat out the bone of the lizardman tail he was eating.\n\n\"Eek.\"\n\n> [You have suffered 3,190 damage.]\n\nCoke's eyes bulged. The bone struck his forehead with the force of a crossbow bolt, erasing more than a third of his health in an instant."
}