{
  "id": 211,
  "title": "Chapter 211",
  "content": "# Chapter 211\n\nCoke's health bar plummeted. One-third gone. From a bone.\n\n*What the hell?*\n\nThe beggar had just thrown a bone at him. A bone. And it had nearly killed him.\n\n*Has to be a bug.*\n\nIt made more sense than the alternative. He was level 109. One of Patrian's rising stars. He'd solo'd the orc captain last week. People whispered his name in the taverns.\n\n*I'm going to be God Coke someday. Like Grid. I can't be taken out by a damn bone.*\n\nThe humiliation burned hotter than the pain.\n\n\"You hit me.\" Coke rolled up his sleeves, fists clenched. \"So I'll hit you back.\"\n\nHe swung at Piaro's head.\n\n> [You have suffered 3,140 damage.]\n\nA pea. This time it was a pea. Not even a kidney bean. A tiny green pea had just punched a hole through his health.\n\nCoke's mouth filled with copper. Blood spilled over his lips, warm and thick.\n\n*Not a bug. Not a bug at all.*\n\nHis legs went weak. Satisfy didn't have bugs. Everyone knew that. Lim Cheolho, the game's creator, was called a god for a reason. Which meant the beggar sitting across from him wasn't a beggar at all.\n\n*I picked a fight with the wrong NPC.*\n\nCoke tried to bow. Tried to stammer an apology. But the other users didn't read the room.\n\n\"He's throwing food! Coke! Smash him!\"\n\n\"Teach that beginner a lesson!\"\n\nThey couldn't see he was dying. Half his health gone. Two hits.\n\n\"Coke! Coke! Coke!\"\n\n\"Get rid of that beggar!\"\n\nThe chant made his stomach twist.\n\n*Please. Someone. Anyone. Notice I'm about to die here.*\n\nHe couldn't get killed by produce in front of everyone who looked up to him. Coke glanced at Piaro, hoping for mercy. But the old man had already dismissed him. Like swatting at a fly that had landed on his soup.\n\nGrid leaned forward. \"What did you just do? That bone and pea hit hard.\"\n\nHe studied Coke's gear. Based on the armor, the kid was at least level 100. Rare-rated equipment. Decent stuff. And a bean had made him cough blood.\n\n\"I used qi.\" Piaro picked at his teeth with a splinter. \"Inject qi into an object and it maximizes power. I could kill a man with a feather if I wanted.\"\n\n\"Like a wuxia master.\"\n\n\"Wuxia?\" Piaro raised an eyebrow. \"What's that?\"\n\n\"Strong people like you. Who can bend the world.\"\n\nThe inn crowd grew louder. Angrier. Grid and Piaro ignored them.\n\n\"That beggar's mocking us!\"\n\nCoke stayed frozen. A level 78 monk named Pitu stood, followed by Dais, an 85 berserker. They started toward Piaro.\n\nThe door crashed open.\n\n\"Sir Dio is coming!\"\n\nDozens of soldiers flooded the narrow space. They snapped to attention as a knight entered. White armor caught the lamplight. Blonde eyelashes so pale they were almost invisible. He surveyed the room with a wrinkled nose.\n\n\"Stinks in here.\" Dio raised a blue rose to his face, breathing through the petals. \"Are you people eating worse than pigs?\" \n\nHe scanned the crowd. \"Has anyone seen Duke Grid?\"\n\n\"Duke Grid?\"\n\n\"You mean God Grid?\"\n\nMurmurs rippled through the inn. Patrian had no high-level monsters nearby. The knights used them all for training exercises. Which meant high-level users had no reason to be here.\n\n\"Why would they look for God Grid in this backwater?\"\n\n\"He wouldn't come to a place like this.\"\n\nDio sighed. He began examining faces one by one.\n\n\"Not you. Not you. Not you either. Mm?\"\n\nHis gaze landed on the corner. A beginner adventurer sitting with a beggar.\n\n\"Take off your hat.\" \n\nDio approached. Then recoiled.\n\n\"Ugh!\"\n\nA stench hit him like a physical force. Sweat and dirt and unwashed clothes. At least a month's worth.\n\n\"Filthy.\" Dio's face twisted. He had noble blood and a knight's obsessive need for cleanliness. \"How dare you walk around in such a disgusting state! You shameless bastard! My nose will rot because of you! Get out before I vomit!\"\n\n\"Yeah!\"\n\nThe users who'd been irritated by Piaro perked up.\n\n\"Let's go.\" \n\nGrid stood. No point staying if Earl Ashur had already tracked him down.\n\n*Can't waste time here.*\n\nReidan. His city. He wanted to see it. Wanted to count the tax revenue. \n\nDio blocked his path. \"I told you to take off your hat.\"\n\nGrid smiled under the brim. \"The boat's probably already sailed.\" \n\nHe looked up at the knight. \"You really think I'm Duke Grid?\"\n\n\"That's right.\" Dio's tone was flat. \"I received a tip you were here.\"\n\nGrid's expression darkened. \"Then why are you speaking like that?\"\n\n\"Uh...?\"\n\nPressure flooded the room. Invisible. Crushing. Dio, the soldiers, the users. All of them felt it press down on their chests. Grid's **Dignity** stat rivaled a king's. \n\nHe swept the hat off his head.\n\n\"G-Grid!\"\n\n\"God Grid!\"\n\nDio's face went white. The other users erupted in shouts. Grid pressed his finger to Dio's forehead, pushing hard enough to make the knight stumble back a step.\n\n\"If you knew I was Duke Grid.\" Grid's voice dropped. Quiet. Dangerous. \"Why didn't you use honorifics? What did you call me? A bastard? Are we friends?\"\n\nEarl Ashur's knights. Grid remembered them all. The ones who'd cut him down when he found Pagma's Rare Book. Dio had been there. Sword drawn. No hesitation.\n\n\"I tried to be patient.\" Grid's jaw tightened. \"But you're too arrogant.\"\n\nHe slapped Dio across the face.\n\nThe crack echoed. Dio's head snapped to the side. His eyes went wide. No one had ever struck him. Not his parents. Not his tutors. Not anyone.\n\n\"Y-You hit me!\"\n\nHe bit his lip. Grid slapped him again.\n\n\"You didn't even apologize! Didn't bow! Rude bastard!\"\n\nGrid had grown. He'd matured through blood and failure. But the roots of a person didn't change overnight. He'd been stepped on his whole life. And now he wasn't the one on the ground anymore.\n\nSlap. Slap. Slap.\n\nDio's handsome face swelled like a toad's. Red welts rose on both cheeks. His eyes watered. Something inside him snapped.\n\n\"Such humiliation!\" \n\nDio grabbed for his sword, forgetting Earl Ashur's order to bring Grid in peacefully.\n\n\"What?\" Grid's eyes went cold. The same look from when he'd been called the Psychopath Butcher. \"You dare draw steel on a duke? You want to keep this going?\"\n\nHis hand moved to <span class=\"rarity-legendary\">Failure</span>. \"You're sentenced to death.\"\n\nThe greatsword sang as it left its sheath. Grid swung. Once. Dio flew backward, smashing into the wall hard enough to crack the plaster.\n\n\"Cough!\" \n\nBlood sprayed from Dio's mouth. He slid down, armor scraping stone.\n\nThe soldiers froze. Should they protect their commander? But that meant raising weapons against a duke. Treason. \n\nGrid stepped forward, pressing <span class=\"rarity-legendary\">Failure's</span> edge to Dio's jaw.\n\n\"Do you remember that day?\"\n\n\"What day?\" Dio wheezed.\n\n\"The day I found Pagma's Rare Book.\"\n\n\"I remember.\"\n\nHow could he forget? Earl Ashur's rage had been apocalyptic.\n\nGrid's teeth ground together. \"That day, your swords killed me. You and your friends. Now you get to experience the same pain.\"\n\nNPCs didn't respawn. Kill one and they stayed dead. Real murder. Grid had learned to value NPC lives. Khan had taught him that. He didn't plan to kill Dio. Just scare him. Make him understand.\n\nDio's body made the decision for him. The smell of urine filled the air. Foam bubbled at the corner of the knight's mouth. His eyes rolled back. He fainted.\n\nIt would haunt him forever. The elite prodigy. Pissing himself. Passing out. In front of everyone.\n\n***\n\n\"Strange for a duke of the kingdom to act like that.\" \n\nPiaro walked beside Grid as they left the inn.\n\nGrid shrugged. \"Bad history here. This place and I have... chemistry problems.\"\n\n\"So you hid your identity.\"\n\nThey moved toward Patrian's gates. Footsteps pounded behind them.\n\n\"Grid! Grid!\"\n\nGrid turned, scowling. \"Can't you see I'm trying to move in secret? Why are you shouting my name?\"\n\n\"Sorry! I'm sorry!\" \n\nCoke fumbled with a piece of paper, thrusting it forward. \"Please sign this!\"\n\n\"Sign?\" Grid's frown softened. \"You're a fan?\"\n\n\"You're my idol! I want to be just like you!\"\n\n\"Hmm.\"\n\nAn idol. Grid had spent his whole life being ignored. Mocked. This felt good. He took the paper and scrawled his name.\n\n\"Thank you.\"\n\nCoke clutched the autograph. The kid who would soon break into the next 10 Rookies list. Already a true believer.\n\nMeanwhile, Earl Ashur received word about Dio.\n\n\"I can't let this stand.\" \n\nThe disgrace of his subordinate was his own disgrace. Earl Ashur's fury burned white-hot. He tracked Grid through his scrying orbs. Then cast **Mass Teleport** on himself and his knights.\n\nGrid stopped mid-step. Light poured from the sky. Reality bent. Earl Ashur appeared in front of him, knights materializing at his back.\n\n\"You actually came here.\" Ashur's voice shook with rage. \"Do you want to die? Are you insane?\"\n\n\"I'm not what I used to be.\" Grid met his eyes. No fear. \"I'm not someone you can push around anymore. Can you afford to make an enemy of me?\"\n\nEarl Ashur laughed. Sharp and cold. \n\n\"I'm the only great magician in the Eternal Kingdom. One of the 10 Great Magicians on the continent.\"\n\nNo exaggeration. Ashur was the kingdom's strongest. That's why they'd stationed him at Patrian. A strategic chokepoint.\n\n\"Pagma's power doesn't frighten me. You're not Pagma. You're just a user with his class. I have more than enough skill to erase you from...\" \n\nAshur's words died.\n\nAn overwhelming presence pressed down on them. Energy so thick it was almost visible.\n\n\"I'd like to test myself against one of the continent's 10 Great Magicians.\"\n\nPiaro stepped forward. Competitive spirit blazing in his eyes.\n\n\"Who are you?\"\n\nEarl Ashur forgot about Grid. A monster had just appeared. And he'd walked right into its path.\n\nThe cart was now in front of the horse.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after the daily release is complete."
}