{
  "id": 212,
  "title": "Chapter 212",
  "content": "# Chapter 212\n\nThe Eternal Kingdom and the Gauss Kingdom didn't share a border. They shared a wound. Decades of disputes had bled both nations dry over trade routes and tariffs. The Eternal Kingdom played the neutral mediator while quietly strangling Gauss's economy, monopolizing their finest exports through diplomatic sleight of hand.\n\nGauss could do nothing. One man stood at the border, and his existence ended all arguments.\n\nEarl Ashur. A great magician. A walking apocalypse.\n\nHis power was a nuclear warhead in human form. Enough to suppress any military ambition the Gauss Kingdom might entertain.\n\nBut Piaro was more than a warhead.\n\n\"W-Who are you?\"\n\nThe beggar hadn't registered in Earl Ashur's awareness. Not at first. The earl's attention had been laser-focused on Grid, calculating angles of attack, weighing the cost of revenge against the political fallout. The ragged farmer hadn't even been a footnote.\n\nNow the air itself recoiled from the man.\n\n*Is this fear?* Goosebumps crawled across Earl Ashur's skin like insects fleeing a flood. *There was a monster like this hiding in the kingdom? Here, of all places?*\n\nHis throat clicked as he swallowed. Piaro stepped forward.\n\n\"I want to experience the skills of one of the continent's 10 great magicians.\"\n\n\"I refuse.\" Earl Ashur's voice was flat. \"I have no reason to fight you. No desire to.\"\n\nPiaro drew his sword.\n\nThe farmer was still drowning in his thirst for revenge, but another hunger gnawed at him. The need to test himself against the strongest opponents. The obsession with reaching the peak of swordsmanship, of becoming a sword saint. Earl Ashur represented something Piaro had never faced: a true great magician.\n\n\"You have no choice.\"\n\n*Crazy bastard.*\n\nThis was Earl Ashur's only window. Grid was traveling to Reidan. Once the blacksmith arrived and solidified his position as a duke, once he claimed his territory and soldiers, Earl Ashur would lose all leverage. He'd be forced to bow. To smile. To swallow his hatred like bile.\n\nOne chance to extract justice for the stolen Pagma's Rare Book. For his son's humiliation.\n\nAnd this beggar was burning it down.\n\n\"Who the hell are you?\"\n\nEarl Ashur knew about Overgeared. He'd compiled intelligence on Grid's allies, studied their movements, assessed their threat levels. But there'd been no mention of this ragged swordsman. No files. No warnings.\n\nWhere did this monster come from?\n\n\"Why are you with Grid?\" Earl Ashur's mind raced. \"Are you his protector?\"\n\n\"Protector?\" Piaro's laugh was dry. \"You're mistaken. I don't have anything to do with Duke Grid. This is my personal interest.\"\n\n*Did Grid need his protection?* The thought carried its own answer. This Ashur didn't know Grid at all.\n\n\"Anyway, you aren't Duke Grid's opponent.\" Piaro's blade caught the light. \"It's better for you to compete against me. Right now, I'm in an incomplete condition.\"\n\n\"This person!\"\n\nResentment dripped from Earl Ashur's words, but his thoughts stayed cold. Clinical.\n\n*Calm. I must be calm. I can't turn him into my enemy.*\n\nThe rumors about Grid might be inflated, exaggerated by bards and forum-dwellers. But the footage from Reinhardt was real. Grid had earned his title as the kingdom's hero through blood and steel. Fighting him would require Earl Ashur's full concentration, every scrap of magic power, perfect execution.\n\nAfter fighting a much stronger opponent? After depleting his reserves against this beggar?\n\n*Impossible.*\n\nThe wisest choice was retreat. Let Grid slip away. Swallow the grudge.\n\nBut.\n\n*I can't miss this chance. It will never come again.*\n\nEarl Ashur made his decision.\n\n*Create a barrier. Isolate Grid from this monster.*\n\nSpatial magic consumed magic power like a bonfire devoured kindling. Even for Earl Ashur, generating a dimensional ward would burn through half his reserves. But if it meant a clean duel with Grid, uninterrupted, the cost was acceptable.\n\n\"Buy me some time.\"\n\nAn earl's military authority was limited by law. Five knights. That was the statutory maximum for a noble of his rank.\n\nEarl Ashur commanded dozens. The privilege of governing a fortified city granted him an army. Not just individual power, but overwhelming force.\n\nThe elite knights snapped into formation. In that gap, Earl Ashur began his chant.\n\nPiaro smiled.\n\n\"Shake hands.\"\n\nElite knights. The pride of Patrian. Well-trained, well-equipped, disciplined.\n\nThey were nothing.\n\nCompared to the knights of the Saharan Empire, the strongest military force on the continent, they were children playing with wooden swords. And Piaro? Piaro had been the captain of the Red Knights. He'd commanded that Empire's blade.\n\n\"It's a waste of manpower.\"\n\nPiaro's sword blurred forward. A knight raised his shield, muscles tensing, weight shifting into a defensive stance.\n\nPiaro had already predicted it.\n\n\"Supreme Swordsmanship 3rd style.\"\n\nThe impact sounded like artillery fire.\n\nPiaro's blade met the shield. The knight holding it became a broken puppet, limbs twisted at wrong angles, armor crumpled like paper. The men standing behind him erupted blood from their mouths and noses, the shockwave passing through the shield-bearer to pulverize their organs.\n\nTwenty-three knights. Earl Ashur's pride.\n\nOne blow.\n\n\"Heok?\"\n\n\"Defense is useless?\"\n\nPanic rippled through the formation. It felt like being hit by a collapsing building. Piaro leapt, body weightless, impossibly light.\n\nHe didn't give them time to regroup.\n\n\"Kuaaaaak!\"\n\nGravity meant nothing to him. Piaro stood in the air, horizontal, sword weaving patterns of death. The knights below couldn't track the attacks, couldn't predict the angles. Their numerical advantage dissolved. They could only defend.\n\nBut Piaro's blade accelerated past the limits of human perception. Defense became a prayer.\n\n\"Ugh!\"\n\nJacks, the knight-captain, swung his halberd through the chaos. He aimed for the gaps between Piaro's strikes, exploiting the microsecond delays when the old man repositioned.\n\nBut hitting him was like trying to spear smoke.\n\nPiaro rotated mid-air, body spinning at a dizzying speed, and the halberd's wide arc cut only empty space.\n\n\"This monster!\"\n\nIt was unbelievable. A man, defying physics, avoiding a massive sweeping attack while airborne. Was this beggar secretly an assassin? Jacks kept swinging, kept trying, desperation fueling each strike.\n\nPiaro avoided them all.\n\nThen something changed.\n\n\"What?\"\n\nThe halberd began moving toward Piaro instead of away. Like iron filings to a magnet, the weapon was being pulled into the old man's rotation. Jacks planted his feet, threw his entire weight backward, muscles screaming.\n\nIt wasn't enough.\n\nHis hands slipped. The halberd flew free.\n\nThe spinning vortex of Piaro's technique caught it. Metal screeched. The halberd shattered mid-air, breaking into dozens of razor-sharp fragments.\n\n\"Keok.\"\n\nThe debris fell like rain. Each piece aimed with surgical precision. The knights wore expensive armor, reinforced steel covering vital areas.\n\nThe fragments found the gaps. Armpits. Neck joints. The space between helmet and gorget.\n\nWhether by coincidence or intent, the armor was useless.\n\nThe knights collapsed.\n\n\"M-Monster...!\"\n\nJacks couldn't close his mouth. Earl Ashur's shock was even greater.\n\n*They couldn't last?*\n\nOne minute. That's all he needed. Sixty seconds to complete the ward chant.\n\nTwenty-three elite knights couldn't buy him sixty seconds.\n\nPiaro's feet touched earth. He stepped past Jacks without a glance, moving toward Earl Ashur.\n\n\"In the end, we have to fight?\" Earl Ashur's scream carried equal parts fury and resignation. \"That's right! Okay! Let's try it!\"\n\nAvoidance was no longer an option. Earl Ashur pulled a staff from his robes. Fifty centimeters of carved wood, deceptively simple.\n\nMost magicians used orbs. Orbs offered versatility, storage capacity, multi-element compatibility.\n\nEarl Ashur didn't need versatility. His casting speed was already inhuman. He needed amplification.\n\n\"Haste!\"\n\nSpeed determined survival in magical combat. The warrior must close distance before the spell completes. The magician must finish casting before the warrior reaches them.\n\nEarl Ashur's movement speed doubled. He created distance, boots skimming across packed earth, already chanting his next spell.\n\n\"Orion's Illusion!\"\n\nFive copies of Earl Ashur materialized. Perfect duplicates, each one moving independently, scattering in different directions.\n\nWhile Piaro searched for the real body, the real Earl Ashur widened the gap.\n\nNext came the debuff.\n\n\"Soul Weakness!\"\n\nPiaro's body transformed. His skin took on an oily sheen, movements sluggish, as if he were wading through molasses. Unpleasant magic power pressed down on him like a physical weight.\n\n\"Disgusting.\"\n\nPiaro's speed had been stolen, but his body bent like a drawn bow. When he released, he shot forward like lightning. Pure physical power compensating for the magical suppression. The debuff effect halved.\n\n*Did he resist? My magic? That's impossible.*\n\nEarl Ashur's eyes widened. But he kept his hands moving, kept the chant flowing.\n\n\"Ice Tornado!\"\n\nA fusion spell. Two **A-grade** magics, different attributes, woven together. The combination exceeded the power of a single **A-grade** spell, approaching but not quite reaching **S-grade** potency.\n\nWhy use it? Why not deploy **S-grade** magic immediately?\n\nBecause even a great magician couldn't instant-cast **S-grade** spells. Against an opponent like Piaro, attempting one without preparation was suicide. The casting time would become a death sentence.\n\nThe tornado formed. Ice and wind merged into a howling vortex. Piaro's body froze mid-charge, ice creeping across his skin, his clothes, his blade. Earl Ashur's magic power exceeded common sense. No one could resist this.\n\n*But this guy won't die like this.*\n\nEarl Ashur knew that. Five seconds. That's how long the ice would hold.\n\nHe began chanting his **S-grade** spell. The words formed in his mind, complex patterns of power and will.\n\nHe'd underestimated Piaro.\n\nA sharp crack split the air. The frost shattered before Earl Ashur could finish three words of his chant.\n\n\"...!\"\n\nAn intangible energy had erupted from within the ice. Piaro stood free, blade ready.\n\n\"You've already recovered?\"\n\nToo fast. **S-grade** magic was off the table. Earl Ashur switched tactics, mind recalculating. Stack damage with **A-grade** spells. Accumulate wounds. Slow him down.\n\nHe barely reacted in time to Piaro's next attack.\n\n\"Shield!\"\n\nThe most basic defensive magic. Even apprentices could cast it.\n\n\"Great magic power.\"\n\nPiaro's acknowledgment carried genuine respect. Earl Ashur's shield had absorbed most of the damage, the barrier glowing bright before shattering. But Piaro didn't stop.\n\nHis sword kept moving.\n\nEarl Ashur stood firm. He relied on **Haste** to dodge what he could, **Shield** to absorb what he couldn't. Blood appeared. Shallow cuts on his arms, his face, his shoulder.\n\nHe ignored the pain. His mind stayed locked on the **S-grade** chant, building it word by word, concept by concept, even as Piaro's blade carved into his flesh.\n\nEarl Ashur's concentration was worthy of respect.\n\n\"Yes!\"\n\nPiaro felt it before he saw it. A surge of magic power, dense and hostile. He shifted stance, activating Supreme Swordsmanship 5th style. A defensive technique.\n\nSomething invisible exploded from Earl Ashur the moment the spell completed.\n\n\"Fluid Escape.\"\n\nThe spell separated soul from body. Three seconds of disembodied existence. During that time, Earl Ashur's soul could move freely, attack independently. His body became immune to all damage.\n\nPiaro's blade struck flesh. The impact rang like steel on steel. No wound appeared.\n\n*This is the power of Fluid Escape!*\n\nEarl Ashur's soul, translucent and shimmering, passed through Piaro's torso. Damage manifested in proportion to the caster's magic power.\n\n\"Kuk!\"\n\nBlood poured from Piaro's mouth.\n\n\"I can't tangle with this monster forever.\"\n\nEarl Ashur's soul changed trajectory. It raced toward Grid, who stood watching the battle with folded arms. The original target. The original purpose.\n\n\"Die!\"\n\nThe soul pierced through Grid's chest.\n\n> [You have suffered **40,985** damage.]\n\n> [You have received catastrophic damage all at once, and your spirit can't endure it.]\n\n> [You have resisted.]\n\nGrid staggered. The soul's movement speed was beyond human perception. Even the pavranium reacted late, its autonomous defense failing to intercept.\n\nEarl Ashur's soul snapped back to his body.\n\n\"You deceived me!\"\n\nPiaro's pride had been wounded. His sword lashed out, but the return of soul to body generated a massive shockwave. Piaro knew this would happen. He was confident his blade could neutralize it, cut through the backwash of magic power.\n\nHe was wrong.\n\nEarl Ashur's magic power was a wall. The sword couldn't pierce it.\n\nPiaro was thrown backward by the blast. While he stumbled, fighting for balance, Earl Ashur turned to Grid.\n\n\"This is the end!\"\n\nFinally. The grudge would be repaid. Earl Ashur moved in for the kill. Grid was still reeling from massive damage, mind fractured, unable to react properly.\n\nBut what was this?\n\nGrid moved smoothly. Fluidly. His greatsword swept up, wreathed in blue-white light.\n\n\"Kuaaaaak!\"\n\nEarl Ashur screamed. The unexpected attack caught him across the torso. He'd accumulated damage during the **S-grade** casting, taken wounds while focusing on Piaro. His defenses were depleted.\n\nHe fell.\n\nGrid pointed <span class=\"rarity-legendary\">Failure</span> at the great magician's throat.\n\n\"Beg me, Duke Grid, for your life.\"\n\n\"W-What...!\"\n\n*Grid's sword damage was as powerful as Piaro's. Maybe even greater.*\n\nEarl Ashur's world didn't make sense anymore.\n\n---"
}