{
  "id": 213,
  "title": "Chapter 213",
  "content": "# Chapter 213\n\nEarl Ashur had heard the reports from Reinhardt. The unstoppable golem army, the one that hundreds of thousands of soldiers couldn't defeat, cut down like wheat before a scythe. But rumors always grew in the telling, didn't they?\n\n*He was pathetic back then.* Earl Ashur recalled Grid's novice days. The fool stumbling through basic quests. The weakling who couldn't handle a simple retrieval mission. *This legend business must be propaganda. The nobles inflating stories to keep the people calm.*\n\nHe'd been wrong.\n\nThe man standing before him now shattered every memory. Grid's transformation wasn't just physical. It was absolute.\n\n*This is what a legend looks like.*\n\nThose dull, fish-like eyes from before? Gone. In their place burned an intensity that seemed to pierce through flesh and bone, measuring the worth of everything they touched. The hunched, trembling body that used to flee from common orcs, that died pathetically to a mere orc captain? It now stood immovable as a mountain, radiating power in every line.\n\nEven that unremarkable face had changed. Where jealousy and insecurity once twisted Grid's features, dignity now sat enthroned. The kind of presence that commanded rooms and bent wills.\n\n*Can a person truly transform this completely?*\n\n\"You want me to beg for my life?\"\n\nThe question hung in the air. Earl Ashur studied the blue sword in Grid's grip. White light rippled along its edge. The weapon itself whispered of legends and impossibilities. Fear coiled in Earl Ashur's gut, a primal thing that screamed at him to kneel, to submit, to *survive*.\n\nGrid's dignity stat pressed down like a physical weight. But Earl Ashur hadn't become one of the ten great magicians by breaking easily. Pride was its own form of magic, and his ran deep as bedrock.\n\n\"I'd rather die.\"\n\nThe words came out steady. He held Grid's gaze.\n\nThe quest for Pagma's Rare Book. Earl Ashur had never been certain the tome even existed. Grid had been a convenient tool. Nothing more. Yes, Earl Ashur had offered fair payment and set no deadline. He'd genuinely hoped Grid's stubborn persistence might uncover something. Where was the deception in that?\n\n*But Grid betrayed the agreement first.* Found the book and decided to steal it, blinded by greed and opportunity.\n\nAnd that wasn't even the worst of it.\n\nBland. His precious son had loved Irene for years, courted her properly, done everything right. Then Grid swooped in and took her. Took everything.\n\n*Death is preferable to kneeling before this man.*\n\nEarl Ashur closed his eyes. Waited for the blade.\n\nGrid stared at the magician's shut eyelids, baffled.\n\n*He actually wants to die?*\n\nThe hatred had been real once. After Earl Ashur's knights killed him, after the death threats, the fury had burned hot enough to melt steel. But now, with the man at his mercy, Grid felt that heat cooling.\n\n*I chose to open that book.* The admission came reluctantly. *Nobody forced me. Nobody twisted my arm.*\n\nFor years he'd blamed Earl Ashur for everything. Every hardship, every death, every setback. Classic Grid behavior. Deflect responsibility. Point fingers. Whine about unfairness.\n\n*Pathetic.*\n\nThe truth was simpler and more uncomfortable. If Pagma's Rare Book hadn't existed, Grid never would have found it. Never would have become Pagma's Descendant. Never would have climbed this high.\n\nIn a twisted way, Earl Ashur had made him.\n\n*That doesn't mean I owe him gratitude.* Grid's jaw tightened. *I found that book through my own efforts. I survived through willpower. Everything I am now, I built with my own hands.*\n\nStill. The conclusion remained.\n\n*I've already won. Killing him serves nothing.*\n\nThe dislike lingered. The memories of betrayal and murder didn't just evaporate. Forgiveness felt premature, possibly impossible. But the urge to kill? That had faded. His conscience wouldn't bend far enough to allow cold-blooded execution.\n\nGrid sighed. He lowered Failure and returned it to his inventory. \"Forget it.\"\n\nEarl Ashur's eyes snapped open. Confusion painted his features. \"I tried to kill you. You're sparing me?\"\n\nHis strength exceeded his title. Earl Ashur knew this. But titles still mattered in the kingdom's hierarchy. Grid was a duke. Earl Ashur was an earl. The earl had not only disrespected his superior but attempted murder based on ancient grudges. Now that Grid had proven himself worthy of his rank a hundred times over, Earl Ashur understood the magnitude of his crime.\n\n*Execution would be justified.* \n\nHe couldn't process mercy.\n\n\"Is there something you will demand separately of me?\" Suspicion crept into Earl Ashur's voice. His eyes narrowed.\n\n*I show mercy and he still doesn't trust me?* Grid's pulse quickened. Irritation sparked in his chest. The old Grid would have exploded. Would have shouted something stupid and made everything worse.\n\n*But I've changed.*\n\nGrid forced his breathing to slow. Thought through the situation.\n\n*Actually, demanding something would be smarter. Use this leverage.*\n\nThree months watching Lauel operate had taught him things. How to read situations. How to extract value. How to think like someone with an actual brain.\n\n*What can I get from him?*\n\nThe possibilities tumbled through Grid's mind. Gold. Jewels. Territory. Magical artifacts. His greed catalog expanded with each passing second. As Grid wrestled with the decision, a familiar mental chime announced an incoming whisper.\n\n> **[Whisper from Lauel]:** Grid, everyone has arrived in Reidan except for Euphemina. When are you going to arrive?\n\nGrid composed his reply as he walked a few steps away from Earl Ashur.\n\n> **[Whisper to Lauel]:** I think it will take three more days.\n\n> **[Whisper from Lauel]:** Three days? What is taking so long? Can't you come quickly if you use Fly? Come quickly. There is a mountain of work to do.\n\n> **[Whisper to Lauel]:** I have a companion. But my companion doesn't want to ride a carriage, so we're walking. Just handle things for a few days.\n\n> **[Whisper from Lauel]:** Companion? Who are you talking about?\n\n> **[Whisper to Lauel]:** You'll see when you meet him. It is good that you got in touch with me. I actually have a situation here.\n\nGrid provided a condensed version of his history with Earl Ashur. The quest. The betrayal. The attempted murder. The current standoff. He finished with the critical question.\n\n> **[Whisper to Lauel]:** In these circumstances, what should I ask from Earl Ashur?\n\nSeveral seconds passed. Grid could almost see Lauel's tactical mind churning through scenarios.\n\n> **[Whisper from Lauel]:** Earl Ashur. One of the ten great magicians on the continent. Extremely famous. Let me think.\n\nA longer pause.\n\n> **[Whisper from Lauel]:** There is a story I've heard from Vantner. I heard Earl Ashur's son caused a disturbance on the day of your wedding to Irene?\n\n> **[Whisper to Lauel]:** Really? I didn't know. I couldn't pay attention to anything else on that day.\n\n> **[Whisper from Lauel]:** Pay attention to him now. Ask Earl Ashur to give you his son.\n\n> **[Whisper to Lauel]:** What? What are you saying?\n\n> **[Whisper from Lauel]:** Earl Ashur is famous for his love for his son. If you keep his son, he won't be able to go against you again and he will have to move according to your will. Earl Ashur's mighty power will surely help one day.\n\n*Brilliant.*\n\nThe simplicity and ruthlessness of it made Grid grin. Lauel always thought ten steps ahead. Never settled for immediate profit when he could secure long-term strategic advantage.\n\n*One day I'll be that smart.* \n\nThe thought felt almost believable now.\n\nGrid turned back to Earl Ashur. Let the wicked smile spread across his face. Watched the magician's anxiety spike in response.\n\n\"Give me your son.\"\n\nEarl Ashur recoiled as if struck. \"What?\"\n\nThe demand shattered something in the magician's composure. His hands trembled. \"You mean to take my son hostage!\"\n\nGrid had expected resistance. What he hadn't expected was the depth of anguish that contorted Earl Ashur's face.\n\nThe magician was forty-eight but looked thirty. Sharp features that belonged on theater stages or romance novel covers. Women had literally fought over him in his youth. Dozens had pursued him through the social circuits of the capital.\n\nBut Earl Ashur had only loved one. She hadn't been beautiful by conventional standards. No noble pedigree. No stunning looks. Just warmth. Just kindness. Just everything that mattered.\n\nTheir marriage had been short and perfect. Two sons. Laughter filling the halls. Then terminal illness. Then death.\n\nEarl Ashur had broken. But he couldn't afford to stay broken. The kingdom needed him. His sons needed him. So he'd compartmentalized his grief, locked it away, and kept functioning.\n\nHis eldest became a royal mage. His second, Bland, showed gifts in both sorcery and swordplay. The pride Earl Ashur felt watching them grow had slowly filled the wound his wife's death left behind.\n\nThen two years ago, his eldest went on a monster subjugation.\n\nDidn't come back.\n\nSomething in Earl Ashur fractured after that. His gentleness calcified into hardness. His patience evaporated. But his love for Bland only intensified. It was the one thing keeping him tethered to sanity.\n\n\"My flesh and soul might burn.\" Earl Ashur's voice came out raw. \"But I will never sell my son. Just kill me.\"\n\n*Stubborn old bastard.* \n\nGrid's mind raced. He wasn't clever enough for subtle manipulation. The only tool he really understood was force. But before he could figure out how to threaten someone who'd already chosen death, a new voice cut through the tension.\n\n\"I will follow you.\"\n\nA blond man stepped into the clearing. Bland de Ian. His armor caught the afternoon light.\n\nEarl Ashur's head whipped around. \"Why are you here?\"\n\nBland ignored his father's panic. He approached Grid with measured steps and dropped into a formal bow. \"I, Bland de Ian, son of Earl Ashur, greet Duke Grid, the great hero of this kingdom.\"\n\nThey'd dueled once. Over Irene. Bland had lost and been escorted from the wedding in humiliation. Grid remembered him sulking and angry.\n\nThis man showed no trace of that resentment.\n\n\"I will go to Reidan according to Duke Grid's will.\" Bland straightened. His expression remained calm. Resolved.\n\nEarl Ashur's face drained of color. \"Bland! Why are you deciding this by yourself?\"\n\n*This is wrong.* The thought crashed through Earl Ashur's mind. *Grid took everything from him. Irene. His pride. And now he's volunteering to be a hostage?*\n\nMagic power began gathering around Earl Ashur's hands. Blue light flickered between his fingers. Pain lanced through his wounded body but he pushed through it.\n\n\"I will kill you.\" The words came out as a snarl. \"And give your soul to God Yatan if you touch one hair on my son!\"\n\nBland moved before Grid could react. Dropped to his knees in the dirt.\n\n\"Duke Grid, my father lost his temper because he cares too much about me.\" Bland's voice stayed level. Professional. \"Please show mercy one more time.\"\n\n\"Bland...\" Earl Ashur's gathering magic dissipated. He stared at his son kneeling before his rival.\n\n*Begging. He's begging on my behalf.*\n\nThe humiliation of it crushed Earl Ashur's remaining will to fight. Bland seemed to sense his father's collapse. Gentleness entered his tone.\n\n\"Father, I will go and study under Duke Grid.\" He met Earl Ashur's eyes. \"Please trust in your son and wait for me to return. Don't skip any meals.\"\n\nEarl Ashur's throat worked. No sound emerged.\n\n*My grudge did this. I caused this.*\n\nHis vision blurred.\n\nGrid stepped forward. Placed a hand on Earl Ashur's shoulder. The touch was surprisingly gentle.\n\n\"Earl Ashur, don't worry. I will look after your son.\"\n\nThe smile that accompanied the words made Grid look demonic. Earl Ashur saw teeth and cruelty and something monstrous wearing human skin.\n\n*He's going to torture him. Use him. Break him.*\n\nBut Grid was just human. A human with terrible social skills and a naturally unfortunate face shape that made sincere expressions look sinister.\n\n*Please don't overdo it. I'm not going to eat your son.* Grid thought the words but didn't voice them. *This is just insurance. Political leverage. He'll be fine.*\n\nGrid glanced between Piaro and Bland. Nodded once.\n\n\"Let's go.\"\n\nThey departed. Left Earl Ashur standing amid the wreckage of his knights. Blood stained the grass. Wounded men groaned. The great magician stood perfectly still, staring at nothing, looking for all the world like a man who'd finally lost everything that mattered.\n\n---"
}