{
  "id": 214,
  "title": "Chapter 214",
  "content": "# Chapter 214\n\nGrid walked beside Piaro across the packed earth. Behind them, Bland stumbled along, his posture rigid with discomfort.\n\nGrid glanced at the farmer. \"So? What did you think of one of the continent's ten great magicians?\"\n\n\"Stronger than expected.\" Piaro's eyes tracked the horizon. \"His mind withstood my oppression. If he'd wielded an orb instead of that staff, the outcome would've been uncertain.\"\n\n*A staff.* Grid recalled the weapon's trade-off. High magic amplification, but no spell storage. A glass cannon approach that few magicians risked. Ashur's casting speed let him abuse that power, but against someone like Piaro, the setup time was a death sentence. The earl had crumpled before completing a single incantation.\n\n*Still. That bastard hits like a freight train.*\n\nThe memory of Fluid Escape made Grid's ribs ache. Forty thousand damage in one strike. Through the **<span class=\"rarity-legendary\">Armor of Holy Light</span>**, no less. Legendary-rated adamantium crafted by Pagma himself, with a fifty-percent magic damage reduction baked in.\n\n*And Piaro took the same hit without a scratch.*\n\n\"How strong is this Asmophel,\" Grid asked, \"if you can't handle revenge yourself?\"\n\nPiaro's jaw tightened at the name. \"Reaching him is the problem, not defeating him. Every soldier in the empire knows my face. The moment I cross the border, I'm a dead man.\"\n\n\"Bullshit.\" Grid kicked a stone. \"Who's strong enough to kill you? Use that Fated to Perish technique. Wipe them out like you did Ashur.\"\n\n\"If it were that simple, I wouldn't have spent two years hiding in a cave.\" Piaro stopped walking. \"You have no concept of the empire's strength.\"\n\n\"What?\"\n\n\"Monster.\"\n\nGrid scanned the landscape. They'd left the forest behind. Nothing but desert now, rippling dunes stretching to the horizon.\n\n\"I don't see anything. Not even an ant.\"\n\n\"Below.\"\n\nThe ground trembled.\n\n*Shit.*\n\nGrid threw himself sideways. The sand where he'd been standing erupted. Something massive and segmented burst through, spraying grit. A centipede. A centipede the size of a bus.\n\n**KIYAAAK!**\n\n\"Ugh.\" Grid recoiled.\n\nThe thing had to be ten meters long. Hundreds of legs, each as thick as a human thigh, churned the air. Yellow fluid leaked from between its armored plates. The stench hit him like a physical force.\n\nPiaro smirked. \"Squeamish like a girl.\"\n\n\"Gender has nothing to do with being disgusted by *that*.\" Grid unsheathed **<span class=\"rarity-legendary\">+9 Failure</span>**. \"Dammit.\"\n\nHe'd fought spiders in Kesan Canyon. This was different. This was *wrong*. He launched himself at the centipede's head, bringing the greatsword down in a savage arc.\n\nThe blade bounced.\n\n*What?*\n\nChitin like plate steel. **Failure** barely scratched it. Grid's hands buzzed from the impact, defense comparable to those ancient weapon golems.\n\n*Specialized tank. Probably slow.*\n\nHe committed to a follow-up strike, telegraphing the angle.\n\nThe centipede moved like liquid. Its bulk twisted sideways and a mandible caught Grid across the chest.\n\n> [You have suffered 6,300 damage.]\n\nGrid staggered. Six thousand? Through the **Holy Light set**? The strongest armor on the continent, and this *common mob* just tagged him for a quarter of his health.\n\nThe sand shifted beneath his boots. Loose footing. His next swing went wide, leverage bleeding away into the dunes.\n\n\"Fly!\"\n\nBraham's boots summoned invisible wings. Grid shot upward, adjusting his angle, and hammered down at the centipede's head.\n\nThe thing barely flinched.\n\nSand exploded behind him. A second centipede erupted from the dune, pincers snapping.\n\nPiaro started forward, then stopped. His eyes narrowed, studying Grid's movements.\n\n\"When you attack,\" Piaro called out, \"commit your weight to the blade's tip. Basic principle, even while airborne. Engage your core. Neck muscles. Transfer momentum through the spine and into the steel. You're scattered. Unfocused. Before addressing technique, we need to fix your—\"\n\n*Is he serious right now?*\n\nGrid dodged a lunging strike. Two centipedes circled below, coordinating their attacks like pack hunters. And Piaro wanted to lecture him about *form*? This wasn't a dojo. This was a fight.\n\n*I don't need a lesson. I need to win.*\n\nGrid activated the skill. \"Link!\"\n\nBlue-white energy blades materialized in a cascading storm. They hammered into both centipedes, shattering their carapaces. The creatures convulsed, legs twitching, then went still.\n\n> [The giant worm has been destroyed.]\n> [2,330,900 experience has been acquired.]\n> [The giant worm has been destroyed.]\n> [2,340,100 experience has been acquired.]\n> [The giant worm's leg has been acquired.]\n\n*Two million experience. Each.*\n\nGrid pulled up the monster's information.\n\n> **[Giant Worm]**\n> Level: 330\n> \n> A worm inhabiting the western territories of the Eternal Kingdom. It dwells deep underground, emerging to attack surface creatures. Common throughout the western desert.\n> \n> Some scholars claim medicinal properties. They are incorrect.\n\n*Level 330. Common.*\n\nThe western region was a ghost town in terms of player traffic. Those twin ogres formed a barrier most users couldn't breach, so information stayed scarce. Which meant Reidan sat at the edge of unexplored, high-level hunting grounds.\n\n*That's… good?*\n\nGrid frowned. Good for the Overgeared Guild's leveling speed. Bad for economic development. Who would travel to a city surrounded by level 330+ monsters? His dreams of taxing hundreds of thousands of visitors evaporated.\n\n\"Dammit.\"\n\nAnother worm breached the sand.\n\n\"Ah, forget it.\" Grid dismissed the concern. *Lauel's problem now.*\n\nThis was a chance to grind. He'd been stuck at level 270 since before the reunion with Euphemina, sidetracked by constant crises. Time to fix that.\n\nGrid opened his status window. At the National Competition, he'd been level 253 with 230 unspent points. Now he was 270 with 400 banked.\n\n\"All points into Agility.\"\n\nHe thought of Piaro's inhuman speed.\n\n> [Agility has permanently increased by 400.]\n\nThe change was immediate. His body felt lighter, reactions sharper. The next worm that surfaced died in half the time.\n\nPiaro remained grounded, still offering commentary. \"Focus power through your thighs and glutes. Upper body acceleration increases. Faster torso, faster blade. And stop overthinking the swing angle. Let muscle memory guide it.\"\n\n*My thighs? Is he kidding?*\n\nGrid ignored the advice. He'd been fighting his whole Satisfy career without form coaching. Pagma's Swordsmanship did the work. That was the point of a legendary skillset.\n\n\"Kill!\"\n\n**KIYAAAAK!**\n\n> [The giant worm has been destroyed.]\n> [2,339,500 experience has been acquired.]\n\n\"Haha!\" Grid checked his experience bar. Seventy percent before the golem invasion. Now past eighty. \"I might actually level today.\"\n\nHe threw himself into the grind, skills cycling through cooldowns, worms erupting and dying in steady rhythm.\n\nPiaro watched, perplexed. Grid wasn't improving. The teachings landed, but didn't take root.\n\n*Why?*\n\nThe man was clever. Cunning enough to leverage Bland as a hostage against Ashur, forcing the earl into a political corner instead of a clean execution. That kind of mind should grasp combat fundamentals.\n\n*Unless…*\n\n*Pride.*\n\nPagma's Descendant, rejecting instruction from anyone except Pagma. A legendary class fostering legendary arrogance.\n\n*Waste. His physicals could carry him so much further.*\n\nIf Grid tightened his basics, he'd be a genuinely challenging sparring partner. But breaking through that ego?\n\nPiaro's attention drifted. Fifty meters away, Bland struggled against his own worm. Alone. Outmatched. But his movements were sharper than they'd been hours ago during the goblin hunt.\n\n*The boy absorbed what Grid ignored.*\n\nPiaro smiled. A lion's cub indeed. Magic from his father, blade talent from somewhere else. Rare. Exploitable.\n\n*I'll train him properly during the journey to Reidan.*\n\n---\n\nKraugel checked the rankings.\n\n> **[Unified Rankings]**\n> 1st. Kraugel — White Swordsman  \n> 2nd. Zibal — Debirion's Envoy  \n> 3rd. Chris — Destruction Warrior\n\n*Chris finally advanced.*\n\nDestruction Warrior. The class fit his aggressive alignment. He'd have unlocked it sooner without the golem siege derailing everyone's schedules.\n\nKraugel made a habit of monitoring the leaderboard. Knowing who chased you was survival 101.\n\nHe turned to his inventory. Fifteen hours of non-stop hunting left it bloated. He sorted mechanically: unappraised items, quest materials, production supplies, vendor trash. NPC merchants versus auction house. Profit margins calculated to the copper.\n\nInventory clean, he reviewed his skill list.\n\n*Two-sword style reached intermediate. Time to challenge it again.*\n\nThe **White Swordsman** class had carried him across the continent divide, but the East remained unconquered. He'd slammed against its difficulty ceiling, earned new titles grinding through the barrier, and grown stronger for it. \n\nNext targets: the eastern and southern Saharan territories. The Orias labyrinths. The western Eternal Kingdom. A full circuit of the West Continent's endgame zones before returning east.\n\nKraugel played with joy. With discipline. With *planning*.\n\nUnlike certain other players.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}