{
  "id": 215,
  "title": "Chapter 215",
  "content": "# Chapter 215\n\nPatrian lay three days behind them. Reidan waited somewhere ahead, beyond the sand and the monsters.\n\nGrid's party didn't avoid the fights. Every creature that crossed their path became experience points, and the journey stretched from three days to six.\n\n*The experience is really good.*\n\nGrid checked his status. Level 273. The gauge sat at 60%. Six days of constant combat had pushed him up from level 267.\n\n*Two days per level. That's insane.*\n\nHe didn't know it, but even Kraugel had never maintained this pace at level 270. The western monsters were that dangerous, and Grid was reaping the rewards.\n\n*I'll hit 275 before we reach Reidan.* Grid kicked at the sand. Pride swelled in his chest. Top rankers would struggle with these monsters. He was cutting through them. *This is what good items get you. Control? That's what losers worry about. Hahaha!*\n\nThe thought crystallized in his mind. Control was for the weak trying to beat the strong. Why bother when you could just overpower everything?\n\nThe Malacus raid had cemented this belief. Items were everything.\n\nThat conviction was about to crack.\n\n***\n\n\"Hah... hah...\" Grid stumbled forward. Sweat poured down his face. \"This is dirty. The giant worms were nothing compared to this.\"\n\nThe desert sprawled before him, endless and hostile. His passive resistance kept heat stroke at bay, but the temperature drained his stamina faster than normal. The sand shifted under every step, forcing his muscles to work twice as hard.\n\nThe monsters kept getting stronger.\n\nFour basilisks emerged from the dunes. Boss-grade monsters in the north, just common predators here. Grid unleashed his skills. Failure carved through scaled flesh. But the basilisks were smart, coordinating their attacks.\n\nOne struck from the left. Another from the right.\n\n\"Damn it!\" Grid's sword caught the first. The second slammed into his ribs. \"Let me catch my breath!\"\n\nHis control couldn't keep up. Every mistake cost him. The monsters capitalized on every opening. Even the best armor had limits, and his health bar was dropping. The invincible passive loomed closer.\n\n*Even Braham's golems would struggle here.*\n\nThe western monsters weren't just strong. They were numerous. That's why the Eternal Kingdom had abandoned this region, letting the giant worms spread unchecked rather than sending armies.\n\n*The kingdom can't manage the west. So the king dumped me here.*\n\nThe realization brought fresh anger. King Wiesbaden had confidence in Grid, sure. But he'd also solved a problem by shipping Grid to the frontier.\n\nGrid cursed under his breath.\n\n*Kiyaaak!*\n\nA massive desert toad whipped its tongue forward. Sticky mucus splattered across Grid's armor, coating him in paralytic poison.\n\n> [You have resisted.]\n\nGrid's resistances held. He lunged forward. **+9 Failure** tore through the toad's fat belly. But western monsters didn't die in one hit, not even from Grid. The toad's tongue lashed out like a whip.\n\n*Too slow!*\n\nThe tongue caught him. Grid felt himself flying, crashing into the sand with his face buried in the toad's underside.\n\n*Thud thud thud!*\n\nHis head rang. The toad hammered him into the ground. Other monsters closed in, sensing weakness.\n\n\"Gah!\" Grid's health plummeted. \"Transcend's not ready! Transcended Link is still on cooldown!\" \n\nHis entire combat style depended on skills. When they weren't available, he floundered.\n\n\"Piaro! Help me...\" Grid's voice trailed off. \"Wait.\"\n\nBland moved.\n\nGrid blinked. He'd barely paid attention to the knight for the past six days. But now Bland waded into the monster horde, his sword a blur of steel and magic.\n\n*What the hell?*\n\nSix days ago, Bland had struggled with level 280 horned goblins. Now he fought western monsters fifty levels higher. One-on-one. Winning.\n\n*Is this a bug?*\n\nBland pulled aggro. The monsters turned toward the easier target. Grid scrambled backward, pulling out the **Great Lord's Sword** and activating its skill.\n\n**[Character Observation]**\n\n---\n\n**Name:** Bland  \n**Age:** 25 | **Gender:** Male  \n**Occupation:** Magic Swordsman  \n\n**Title:** Great Magician's Son  \n*He has inherited the magical talents of his father, Earl Ashur. Bonus to magic casting speed and mana regeneration. Every level grants significantly increased intelligence.*\n\n**Title:** Marquis Steim's Disciple  \n*He once learned swordsmanship from Marquis Steim, a swordsman of the north. When a blade-type weapon is equipped, attack power increases by 20% and attack speed by 10%.*\n\n**Level:** 255  \n\n**Strength:** 1,331 / 1,990  \n**Stamina:** 420 / 1,030  \n**Agility:** 519 / 1,401  \n**Intelligence:** 2,540 / 4,550  \n**Charm:** 212 / 800  \n\n**Skills:** Northern Swordsmanship (B), Spell Casting Acceleration (S), Magic Power Concentration (S), 9 C-grade Spells, 5 B-grade Spells, 2 A-grade Spells.\n\n---\n\n*Click on the details to examine the spells that the target has currently acquired.*\n\nGrid had checked Bland's stats six days ago. The difference now was minimal. Five levels. A handful of stat points.\n\n*So why is he so much stronger?*\n\nA voice cut through Grid's confusion.\n\n\"That's it. You've got it.\" Piaro stood beside Bland, watching the knight fight. \"Don't play around when holding a sword. You can't dodge everything. Better to block or counterattack. Even if your opponent is stronger, steady swordwork makes them easier to defeat.\"\n\nThe pieces clicked together in Grid's mind.\n\n*It's Piaro's teaching.*\n\nBut could advice alone create this much growth? Grid moved closer, keeping near Piaro and Bland instead of charging ahead. He watched them fight.\n\n\"You're too focused on being a 'magic swordsman.'\" Piaro deflected a monster's claw without looking. \"Magic casting and swordsmanship can't happen simultaneously. That creates gaps. But don't abandon magic. Your talent for it exceeds your talent with the sword. Against stronger enemies, focus on magic. Use swordsmanship for defense only.\"\n\nEvery monster became a lesson. Piaro spoke. Bland applied the teaching in real time.\n\nGrid's worldview trembled.\n\n*If I combine control with my items... how much stronger could I become?*\n\nThe realization settled over him like a weight. Items alone had a ceiling. He was approaching it.\n\nGrid swallowed his pride. \"Teach me too.\"\n\nPiaro raised an eyebrow. \"You said there was no need before.\"\n\n\"A person's mind is flexible.\" Grid avoided eye contact. \"Now I want to learn.\"\n\n*He can't stand watching Bland grow alone. He's losing confidence as Pagma's Descendant.*\n\nPiaro saw through Grid immediately. An unprincipled person. The type Piaro disliked. But he nodded anyway.\n\n\"Very well.\"\n\nRaising Grid's strength would enhance Piaro's own plans. His frozen mind, obsessed with revenge for so long, was slowly thawing. Meeting Grid and Bland had sparked something. A small change, but significant.\n\nThe training began.\n\n***\n\n\"Stop moving your head.\" Piaro's voice was flat. \"How many times must I repeat this?\"\n\nGrid wiped sweat from his face. \"My head moves when I move! How do I control that?\"\n\n\"Make an effort. Think while you fight.\" Piaro parried a sand scorpion's stinger. \"And stop using Fly. Warriors must adapt to terrain. The desert is valuable experience.\"\n\n\"How can I swing my sword when my feet sink into the sand?\"\n\n\"Put your weight on the tip of your sword, not your feet.\"\n\n\"So how do I do that?\"\n\n\"Move your muscles properly.\"\n\n\"How do I move my muscles?\"\n\n\"...\"\n\nBland was a genius. Best teacher meets best student. The synergy exploded.\n\nGrid was not a genius.\n\nEven a great swordsman struggled to teach him. Piaro felt his patience fraying with every clumsy question.\n\n*I thought he was smart, but...*\n\nHow could such a stupid person gain Pagma's power? Piaro wanted to give up. But he'd given his word. The teaching continued.\n\nGrid grumbled. He complained. But he followed every instruction to the best of his ability. Three days of constant drilling slowly ground competence into him.\n\n\"He's ordinary now.\" Piaro watched Grid deflect a claw strike without stumbling. \"Barely.\"\n\nGrid had built the basic skills of a swordsman. The absolute limit of what his talent and Piaro's teaching could achieve.\n\n*He won't grow beyond this.*\n\nPiaro felt a strange sense of defeat.\n\nThen the walls of Reidan appeared on the horizon."
}