{
  "id": 216,
  "title": "Chapter 216",
  "content": "# Chapter 216\n\nNine days ago.\n\nThe Overgeared members arrived in Reidan ahead of Grid, their carriages rolling through the desert heat with practiced efficiency. They'd expected a jewel of the west. What they found was a corpse.\n\n\"What the hell happened here?\" Vantner slowed his stride, staring at the skeletal buildings.\n\nPon craned his neck. \"Is that... is that supposed to be a marketplace?\"\n\n\"Half the shops are boarded up.\" Zednos stepped over a pile of refuse. \"The ones that aren't have broken doors.\"\n\nRegas jogged ahead, then stopped. His voice dropped. \"There are people sleeping in the street.\"\n\nThe rice fields stretched to the horizon, brown and cracked. Dust devils spun through rows of dead stalks. The population density felt wrong. Too much space, too few bodies moving through it.\n\n\"This doesn't make sense.\" Ibellin pulled out his map. \"Reidan is marked as the second largest city in the Eternal Kingdom.\"\n\n\"Second largest ruin, maybe.\" Vantner spat into the dirt.\n\nHuroi, Lauel, and Faker stood apart from the commotion. Huroi pulled up the city interface while Lauel's eyes tracked the walls, the guard towers, the abandoned watchtowers.\n\nA translucent window materialized.\n\n> **Name:** Reidan  \n> **Size:** Big City  \n> **Ruler:** Grid (Duke of the Eternal Kingdom, Master of the Overgeared Guild)  \n> **Administrator:** Arik (C-grade administrative ability)  \n> *The higher the administrative ability of the administrator, the higher the overall development of the estate.*  \n> \n> **Affiliation:** The Eternal Kingdom  \n> **Population:** NPCs 20,551 / Players 0  \n> **Troops:** Knights 2 (Huroi, Lauel) / Soldiers 141  \n> \n> **Security:** 5/100  \n> *The state of security is the worst. It isn't unusual if the people turn into a mob straight away. Gangsters and monsters will often pop up near the village.*  \n> *Security will increase hourly in proportion to the number of soldiers.*  \n> *People lack jobs and food for policing activity; security cannot rise without addressing this.*  \n> \n> **Internal Affairs:** 169/4,500  \n> *Increasing the number of shopping malls, public cultural facilities, and buildings will increase internal affairs.*  \n> \n> **Foreign Affairs:** The Butin Barony in the Saharan Empire  \n> **Forces Hostile to Ruler:** Yatan Church  \n> **Forces Hostile to Affiliated Groups:** Gauss Kingdom, Luvia Principality  \n> \n> **Specialties:** None  \n> **Distinguished Figures:** None\n\n\"Five hundred thousand capacity.\" Lauel closed the window. \"Twenty thousand residents.\"\n\nFaker's jaw tightened. \"No users.\"\n\nHuroi exhaled slowly. \"Security is in the gutter. We're one bad harvest from a riot.\"\n\nDuring the journey west, the guild had reveled in the monster density. Strong creatures meant fast experience, rare drops, efficient leveling. The carriages became mobile hunting platforms. Every ambush turned into a festival of loot.\n\nBut Lauel had seen the other side of that coin. Strong monsters meant low accessibility. New players couldn't farm here. Merchants wouldn't risk caravans. The land would stay wild, untamable.\n\nAnd now, standing in Reidan's shadow, the full scope of the problem became clear.\n\n\"Population capacity over half a million.\" Lauel walked toward the nearest building. Its door hung crooked. \"Actual population? Four percent of that.\"\n\n\"And zero players want to live here.\" Faker appeared beside him without sound.\n\nVantner threw his hands up. \"So what's the plan? We just start throwing gold at people until they smile at us?\"\n\nLauel ran the numbers. The Overgeared Guild treasury held 5 million gold. For a personal fortune, that was staggering. For a major city's operating budget? Laughable. For a dying city that needed total reconstruction? Suicide.\n\n*Security comes from soldiers. Soldiers need to eat. People need to eat. We have no farms, no merchants, no supply chain.*\n\nHe paced. The math turned ugly fast.\n\n*Three silver per meal minimum. Twenty thousand residents. That's six hundred gold per meal.*\n\nOne meal. Not breakfast, lunch, and dinner. Just... one.\n\n*Until we get sustainable food production, we're burning through thousands of gold per day just to keep people from starving.*\n\nBut there was no choice. People were infrastructure. Healthy, fed people worked. Working people generated tax revenue, cleared land, raised security. Starving people rioted and died.\n\nThe calculus was brutal, but simple.\n\n\"Get the people fed.\" Lauel turned to Huroi. \"Then put them to work on the fields.\"\n\nHuroi frowned. \"Shouldn't we wait for Grid? This is his city.\"\n\n\"Grid will want to know why we're hemorrhaging gold on meals.\"\n\nLauel could already hear the argument. Grid saw people as numbers, as tax generators. He wouldn't understand the long game. Not immediately.\n\nHuroi shifted his weight. \"This feels like overstepping.\"\n\n\"Koreans don't give up on making hot pepper paste just because of worms.\" Lauel met his eyes. \"This is the right move. Even if Grid disagrees.\"\n\nHuroi's face went red. \"Don't compare Grid to worms!\"\n\n\"That's not—\" Lauel held up his hands. \"That's not what I meant. It's a saying about persistence.\"\n\n\"Your sayings are terrible.\"\n\nWhile Lauel sweated through his explanation, Faker melted into the yellow dust. He moved like smoke, his silhouette blurring through the haze until Reidan Castle loomed overhead.\n\nAt the castle entrance, a fat man in silk and armor barked orders at a cluster of guards.\n\n\"Why are you just standing there? The new lord's representatives arrived! Your greeting is late!\"\n\nOne guard stammered. \"Administrator Arik, we were... we didn't know when—\"\n\n\"Excuses!\" Arik's jowls shook. \"Pathetic. Move faster next time or I'll have you flogged.\"\n\nThe guards scattered. Arik adjusted his belt, his greasy face slick with sweat, and hurried toward the castle gate.\n\nA shadow detached from the wall.\n\n\"Why didn't you greet us at the gate?\" Faker's voice cut through the dust. \"Your courtesy is lacking.\"\n\nArik spun, nearly tripping. \"I... I was afraid! If I left the castle, the people might stone me. You must understand—\"\n\n\"You wear a sword. You have armor.\" Faker stepped closer. The yellow dust swirled around him like a living thing. \"But you're afraid of rocks?\"\n\n\"Please, I—\"\n\nFaker's dagger appeared at Arik's throat. The blade didn't touch skin, but Arik's breath stopped anyway.\n\n\"Hiik!\" The administrator's eyes bulged. \"W-Who are you?\"\n\n\"Someone with questions.\" Faker's tone could have frozen magma. \"You're going to answer them.\"\n\n\"W-What do you—Kiyaaack!\"\n\nThe dust thickened. When it cleared, both men were gone.\n\nThe soldiers blinked at empty air.\n\n\"Administrator Arik?\"\n\nNo answer. No footprints. No trace.\n\n***\n\n*This is supposed to be normal?*\n\nBland had spent three days watching Grid train under Piaro. Three days of watching a man he'd considered a prodigy get dissected, corrected, and rebuilt from the ground up.\n\nBefore Piaro, Bland had measured swordsmen against Earl Steim and Phoenix. They were the ceiling. The absolute limit of what a blade could do in human hands.\n\nThen Grid had appeared. Grid, who killed armies. Grid, who fought like physics was optional.\n\n*He should be untouchable. Piaro should be calling him a genius.*\n\nBut Piaro had called Grid ordinary. Adequate. Acceptable for someone at his level.\n\nAnd Grid had smiled. *At least I'm not below average.*\n\nBland couldn't reconcile it. *How can someone this skilled be considered mediocre?*\n\nThe problem was perspective. Bland compared Grid to the knights he'd grown up around. Skilled men, yes, but mortal. Human.\n\nGrid compared himself to rankers. To boss monsters. To Kraugel.\n\nPiaro compared Grid to legends.\n\n\"Puhahat!\" Grid bisected a Level 260 Sand Worm without activating a single skill. \"I can actually fight these things with fundamentals now!\"\n\nPiaro nodded. \"This is baseline competence. The weak rely on skills. You still have progress to make.\"\n\n\"Then keep training me. I'll practice steadily.\"\n\n\"I refuse.\" Piaro's tone was flat. \"Further training would yield diminishing returns.\"\n\n\"Don't give up on me that fast.\" Grid wiped his blade. \"I'm not that hopeless.\"\n\n\"This is analysis, not emotion.\" Piaro watched another monster collapse. \"Your growth curve has plateaued.\"\n\nGrid was strong. That was objective truth. Compared to top rankers, his mechanics were sloppy. Compared to normal players, he was stratospheric.\n\nBut the west's monsters were top-ranker caliber. And against them, Grid's cracks showed.\n\n\"Hap!\" \n\nGrid's footwork had adapted to the sand. He ran across dunes without sinking, Failure carving through exoskeletons and scale armor with equal ease. The experience poured in. \n\nLevel 275.\n\nReidan appeared on the horizon.\n\n\"This is your city?\" Piaro shielded his eyes.\n\nThe walls stretched across the desert like a sleeping dragon. They weren't tall. Weren't pristine. But their scope was staggering.\n\n\"Second largest city in the Eternal Kingdom.\" Grid's grin spread. \"Only Reinhardt is bigger.\"\n\n*Hundreds of thousands of people. My people. They'll throw a parade. Confetti. Maybe a feast.*\n\nHe could already taste the wine.\n\n\"Let's go.\" Grid picked up his pace. Bland and Piaro followed.\n\nThe first thing Grid saw was the workers.\n\nThin bodies. Ragged clothes. Skeletal frames bent over hoes and rakes.\n\n*Refugees?*\n\nHe slowed. *Why are there refugees doing fieldwork in Reidan?*\n\n*Wait. Are those slaves?*\n\nHis lip curled. *They should at least feed them properly. What kind of cheapskate employers...*\n\nWhatever. Not his problem. As long as they paid taxes, the people could hire whoever they wanted.\n\nGrid hummed as the city gate grew closer. He imagined trumpets. Banners. A crowd chanting his name.\n\nThen he saw Vantner.\n\nVantner, shirtless and sweating, swinging a pickaxe.\n\nGrid stopped humming.\n\nPon was there too. And Zednos. And Jishuka.\n\n*What the hell?*\n\nThe Overgeared members were scattered across the field, bent over farming tools, indistinguishable from the workers Grid had mistaken for slaves.\n\nHis stomach dropped.\n\nRegas spotted him. The martial artist's face split into a grin and he jogged over, dust caking his shoulders.\n\n\"You're finally here!\"\n\nRegas' chest gleamed with sweat and grime. He looked like he'd been working in a coal mine.\n\nGrid's voice came out strangled. \"What are you doing?\"\n\n\"What does it look like?\" Regas gestured at the fields. \"Clearing land with the people.\"\n\n\"With... the people?\"\n\n*What people?* Grid only saw his guild and the slaves.\n\n\"I greet you.\" Huroi appeared, breathing hard. A rake hung from his hands.\n\nGrid pointed at the tool. \"What are you doing?\"\n\n\"Clearing the fields with the people.\"\n\n\"No, I mean—\"\n\nLauel arrived. His clothes were filthy. Dirt streaked his face. He carried a shovel like it was a sword.\n\n\"Why are you late?\" Lauel's tone was accusing. \"You didn't answer my whispers. I had to mobilize everyone for emergency work.\" He gestured at the expanse of farmland. \"We're connecting waterways and preparing soil. In a few months, we'll have basic food production.\"\n\nGrid's brain finally caught up. The question clawed its way out.\n\n\"Where are the people?\"\n\n\"Can't you see them?\" Lauel pointed at the field workers. At the thin, ragged figures Grid had written off as slaves. \"They're your people.\"\n\nGrid stared.\n\nAt the skeletal farmers. At the crumbling walls. At the 20,000 starving residents of his grand, glorious, second-largest city in the kingdom.\n\n\"Ah.\"\n\nHis voice was small.\n\n\"Why me?\"\n\nHis expectations didn't collapse. They disintegrated. Like a sandcastle hit by a tsunami.\n\n---\n\n**Glossary of Common Korean Terms**  \nOG: Glossary Link  \nCurrent schedule: 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}