{
  "id": 217,
  "title": "Chapter 217",
  "content": "# Chapter 217\n\nGrid kicked at the dusty ground. \"Damn! What is this? I knew things were going too well!\"\n\nHis fate had shifted after becoming Pagma's Descendant. Before, his life was one long streak of bad luck. After the class change, most outcomes turned positive, no matter what hell he crawled through. *But why do I keep crawling through hell in the first place?* The thought burned in his skull. *Do I just accept it because things work out in the end?*\n\nHe forced the anger down. His gaze swept across the hollow-eyed crowd gathered before him. \"Isn't this the kingdom's second largest city? Doesn't that mean it's rich? So why are the people in this state?\"\n\nThe skeletal figures stared back with empty expressions.\n\nGrid's voice rose. \"Were they robbed by a group of thieves or something?\"\n\n\"It used to be the richest city in the kingdom.\" Lauel stepped forward, his tone measured. \"Everything changed ten years ago when the giant worms appeared.\"\n\n\"The giant worms?\" Grid frowned. \"What do those monsters have to do with Reidan?\"\n\nLauel gestured toward the crumbling buildings around them. \"This is what Faker discovered after questioning the administrator and the locals.\"\n\nThe explanation came in flat, clinical detail. A decade past, Reidan stood as the second capital of the Eternal Kingdom. Wealth flowed through its streets like the river through its fields. Then the worms came.\n\n\"The giant worms ravaging the land were too strong for a regular army.\" Lauel's jaw tightened. \"They turned the western territories into desert. Resources dried up. Water became scarce.\"\n\nDesert monsters followed in the worms' wake. The isolation strangled Reidan slowly. Supply lines collapsed. Food stocks depleted.\n\n\"Large-scale support from the kingdom became impossible, so the former lord gave up. Hundreds of thousands of people were forced to abandon their homes.\"\n\nGrid absorbed this, his fists clenching. \"But some stayed.\"\n\n\"Forty thousand remained behind in Reidan.\"\n\nLauel continued. The remaining people fought to protect the rivers and lakes not yet consumed by sand. Their strength wasn't enough. King Wiesbaden searched for talent to rebuild the west, but no one suitable could be spared. Earl Ashur couldn't leave Patrian.\n\n\"The people turned to the empire for salvation.\" Lauel's expression darkened. \"And the empire readily accepted. It was a chance to absorb part of the Eternal Kingdom's territory.\"\n\nThe Saharan Empire dispatched the Black Knights. The second strongest order of knights couldn't fully purge the monster infestation.\n\n\"The empire had to make a choice.\" Lauel crossed his arms. \"Obtaining the west would require committing massive forces. That's a heavy burden, even for them.\"\n\nGrid saw where this led. \"So they made a deal.\"\n\n\"They protect the Hebend River directly connected to Reidan from monsters. In return, the people pay tribute every year.\"\n\n\"That's reasonable.\" Grid nodded slowly. \"The people would've had to accept.\"\n\n\"Yes. But the problem was that the tribute amount grew every year.\"\n\nThe protection allowed farming to resume. The economy crawled back to life. Then the empire bled it dry again with escalating demands. Another food crisis loomed.\n\n\"Eventually, the people couldn't meet the empire's demands anymore.\" Lauel's voice went cold. \"The empire withdrew their forces. Only twenty thousand people remained in Reidan. They were on the brink of starvation. That was the situation when we arrived.\"\n\nGrid's patience snapped. \"Why did the kingdom abandon Reidan? It might be impossible to eliminate the monsters, but can't they provide minimum supplies?\"\n\n\"There was no merit. They saw no value in helping foolish people who wouldn't abandon a land that couldn't be rebuilt.\"\n\nThe words landed like stones. Cold, but Grid recognized the logic. *The kingdom made the rational choice.* He rubbed his face. \"I understand the kingdom's position. So the real issue is the people themselves. Why insist on staying in Reidan despite the circumstances? Isn't it a simple fix if they just leave?\"\n\nLauel's expression softened. \"It's unfortunate. Ten years ago, the lord recruited troops to raid the vampire lairs. Most of the people who didn't leave Reidan are the families of those young men conscripted for the vampire raid.\"\n\n\"They stayed because...\" Grid's throat tightened. \"They don't know when their sons or husbands will return.\"\n\n\"That's right. As you know, this world differs from modern society. The reunion of separated families is almost impossible.\"\n\nThe timeline fell into place. The giant worms emerged soon after the vampire raid began. Reidan fell within five months. The vampire subjugation troops were scheduled to return in half a year. The families waited.\n\nOne year. Two years. Three years. Four years. More. The vampire subjugation team never returned. The family members refused to leave Reidan. Ten years passed. Forty thousand people waited. Half gave up or starved. The rest remained.\n\n\"They've been waiting ten years for the vampire subjugation team's return.\" Lauel shook his head. \"The troops were probably annihilated long ago. But blood relationships run deep.\"\n\n*Stupid.* The thought came immediately. Then Grid pictured Sehee waiting for him. His parents. *They'd do the same thing.*\n\nCompassion welled up, unwanted and uncomfortable.\n\n\"The conclusion is that the former lord is a stupid jerk.\" Grid's voice came out rougher than intended. \"Why did he try to clear the vampire lairs?\"\n\n\"Until the giant worms appeared, the vampires were the only threat to Reidan. The vampire lairs are somewhere in the west. The vampires often used the people of Reidan as their food source. The former lord made an unavoidable decision.\"\n\nVampire Duke Marie Rose. The memory surfaced like cold water. That entity on the road to the Vatican. Grid's skin prickled.\n\n\"Are the vampires still active?\"\n\n\"No. Vampires haven't appeared since monsters emerged in the west. Considering the strength of vampires, they wouldn't have been wiped out by monsters. It's possible they turned the monsters into their food source.\"\n\n\"That's lucky.\" Grid exhaled. \"So? What should I do next?\"\n\nLauel answered as if it were obvious. \"We need to focus on clearing the fields.\"\n\n\"...\"\n\nDuring Grid's nine-day absence, the Overgeared members had defeated the monsters around Hebend River. They connected the waterways to the fields. The sight was deceptively beautiful, the result of hard labor alongside the people.\n\nLauel smiled. \"Labor is good. The sight of the people sweating while working is beautiful.\"\n\n*But I hate doing it.* Grid's jaw set. \"I'm the duke, yet I have to work in the fields with the people? Isn't this too much?\"\n\nLauel shrugged. \"You don't have to. You have a different workspace.\"\n\nHe'd brought Khan to Reidan on Grid's orders. Support staff were already building a facility. A smithy.\n\n\"Please do your duties as a legendary blacksmith. There's a limit to the farming equipment Khan can produce alone. We need you to help manufacture a large quantity of tools.\"\n\n\"What?\"\n\n*A legendary blacksmith making farmer's tools?*\n\n\"Hey, what's with that look?\" Lauel's tone sharpened. \"We need your strength to revive Reidan, and you want to refuse? Don't you feel any responsibility as the Lord?\"\n\nThe words struck home. Grid's protest died in his throat.\n\n\"I was lacking in understanding.\"\n\n*I became too arrogant after becoming a duke.* The realization tasted bitter. A blacksmith couldn't afford the word 'only' in their mind. Farming equipment wasn't beneath him. Nothing was beneath him.\n\nGrid regained his pride. He rolled up his sleeves and pulled out his blacksmith's hammer. \"Believe in me.\"\n\n\"...\"\n\nLauel's face twisted. *Those ominous words.* But then relief followed. *Farming equipment only comes in normal rating anyway. There's nothing to worry about.*\n\nCombat class users knew nothing about production items. They weren't interested because opportunities to use them were rare. A hammer was just a hammer. A pickaxe was just a pickaxe. A hoe was just a hoe. Most production items distributed had normal ratings.\n\nBlacksmiths aimed for mass production. High-rated production tools were uncommon. But Grid was different. He invested at least twenty hours into every item. He'd already produced a legendary rated hammer and pickaxe.\n\n\"Then I'm going.\" Grid turned toward the city. \"Time to work.\"\n\n*I'll produce the best farming equipment that even the starving can use easily.* The pledge settled in his chest like an oath.\n\nLauel called after him. \"By the way, Grid, who are these two people?\"\n\n\"Ah.\" Grid remembered Piaro and Bland. He faced them. \"This is what happened, so I'll be in the smithy for a while. You'll be bored in the meantime, right? Shouldn't you move your bodies to avoid boredom?\"\n\n\"If I look around the city and train Bland some more, I won't be bored.\" Piaro's tone was mild.\n\nGrid continued as if he hadn't heard. \"I'll tell you how to relieve your boredom.\"\n\nHis finger pointed toward the fields.\n\nPiaro and Bland stared. Their noble upbringings and natural talents left them unequipped to grasp Grid's intentions. The idea that someone would assign them to fieldwork seemed impossible.\n\n\"Help clear the fields. Please.\"\n\n\"W-What?\" Bland's voice cracked.\n\n*I'm an elite of the kingdom with the best bloodline flowing through my veins!* His thoughts spiraled. *A cornerstone of the kingdom, made to do fieldwork?*\n\n*No, I can understand since I'm a hostage. But Piaro?* Bland's gaze shifted to the older man. *He's a former captain of a knight troop, one of the best swordsmen on the continent. Despite his achievements, forced to work in the fields?*\n\n*Grid is insane.*\n\nBut then Piaro spoke.\n\n\"Physical training is good for increasing the body's stamina. Moreover, since I've never worked in the fields, it's an opportunity to develop unused muscles or experience new movements. I understand.\"\n\nPiaro accepted readily. The Great Swordsman, the one closest to becoming a Sword Saint, positively evaluated the fieldwork. He started stretching. Bland fell silent and loosened up his body as well.\n\nGrid blinked. \"Are you really going to work in the fields?\"\n\n*I didn't expect Piaro to accept.*\n\n\"Why so easily?\"\n\nPiaro met Grid's confused expression. \"I've regained my motivation after being with you and Bland for the past nine days. I don't want revenge to be my whole life. You'll get revenge for me sooner or later, so I need to shake off the past and try living in the future. I'm not a noble anymore. It's a good idea to learn about the lives of common people in advance.\"\n\n\"Thank you.\" Grid bowed deeply.\n\n*Not just for helping with the fields. For his willingness to live.*\n\n*A person like that was affected by me.* The thought settled like weight in Grid's chest. He had enough influence to change someone's life. Piaro made him realize this.\n\n*A lord rules over tens of thousands of people. A guild master leads the Overgeared members. I can never forget. My thoughts and actions can change the fate of many.*\n\nGrid vowed to become more mature with each experience. But he couldn't abandon his nature. He was prone to losing prudence whenever hurried. *I need to manage myself more thoroughly.*\n\nHe left Winston for the west. This was the moment Grid's heart grew again in response to Piaro's words.\n\n***\n\n**Glossary of Common Korean Terms.**\n**OG:** Glossary Link.\n**Current schedule:** 20 chapters a week.\n**Check out my Patreon for early access to a certain number of unedited chapters and to achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}