{
  "id": 218,
  "title": "Chapter 218",
  "content": "# Chapter 218\n\nGrid gestured toward the two men. \"Lauel, Piaro and Bland will help in the fields while I'm in the smithy. Thank them for their work.\"\n\nLauel blinked. \"Wait. Who are they?\"\n\nHe wanted Grid to introduce the pair properly, but Grid simply turned to Piaro and Bland, speaking to them directly as if Lauel wasn't there.\n\n\"Then I'm going.\"\n\n\"Grid!\" Lauel's voice rose with frustration.\n\nGrid walked away without looking back. *He'll figure it out soon enough.* A grin tugged at Grid's lips. *Better to let him experience it firsthand. The shock, the awe, the reverence. Name-grade NPCs don't grow on trees.*\n\nHe could already picture the moment Lauel realized who Piaro really was—a great swordsman who could elevate the entire Overgeared Guild to new heights.\n\n***\n\n*So damn insensitive.*\n\nLauel stood alone with the two strangers. He cleared his throat and studied them both, starting with the young man beside the filthy beggar.\n\n*That must be Bland, Earl Ashur's son.* That part made sense. Grid had mentioned taking a hostage when he'd traveled to Patrian.\n\nThe problem was the other one. Piaro stood there in rags too tattered to wipe a floor with, reeking like a sewer. His physique was solid beneath the grime, but everything else screamed destitution.\n\n*This is who Grid wasted nine days bringing back?*\n\nLauel's jaw clenched. Grid had talked about bringing powerful allies to Reidan. *A slave? He dragged a slave across the desert?*\n\nDisappointment soured his gut. Grid needed to understand his position as a Duke. They had work to do, territory to develop, enemies closing in—and he'd returned with this?\n\nLauel forced his face into a pleasant mask. \"I am Lauel, Grid's chief of staff.\" He kept his voice level and professional. \"I'm proficient in handling people. May I ask your names?\"\n\nAt level 287, first in the qigong master rankings, fresh from defending the kingdom against golems, Lauel chose his words carefully. No need to intimidate these two with titles.\n\nBland straightened his posture. \"I am Bland de Ian, youngest son of Earl Ashur. I know a bit of magic and have some skill with the sword.\"\n\n*A bit of magic.* The young noble was being modest. His father was one of the Ten Great Magicians, after all. But Bland's magic couldn't match that legacy, and his swordsmanship was infantile compared to what he'd witnessed from Grid and, somehow, Piaro.\n\nThen the beggar spoke. \"I am Piaro. I have nothing to introduce beyond my name.\" He scratched at his matted beard. \"I know how to use the sword, but I'm still lacking.\"\n\n*Lacking.* Lauel's assessment crystallized. *They're field workers because they can't be useful anywhere else.*\n\n\"Well.\" Lauel exhaled slowly. *Better than nothing, I suppose.*\n\nHe retrieved two rakes from the pile of farming equipment and handed them over. \"Use these to clear foreign matter from the soil—stones, roots, whatever you find. Prepare the land for planting.\"\n\nNeither of them would complete the task properly. Bland was nobility; manual labor would be beneath him. Piaro looked like he'd collapse after an hour, probably just here for free meals.\n\nBland turned the rake over in his hands, examining it like an artifact. \"This is farming equipment used by common people.\"\n\nPiaro's eyes widened. \"I never thought I would hold a tool like this in my entire life.\"\n\n\"This is also an experience,\" Bland said.\n\n\"I will keep that in mind.\"\n\nLauel ignored their exchange and pointed toward a vast stretch of untamed wilderness. \"Clear this piece of land by the end of the day. If you don't know how, ask the workers nearby.\" He paused. \"If you can't do it, take a break. I won't force you to work.\"\n\nOf Reidan's 20,551 residents, nearly everyone with able bodies was out here clearing wilderness—men, women, elderly, youth. But efficiency was abysmal. Between the tools the residents owned and what Khan had managed to produce, they only had about 3,000 farming implements. That meant only 3,000 people could work effectively. The rest picked up stones with their bare hands.\n\nLauel studied the rake in Piaro's grip. *Am I wasting precious equipment on these two?*\n\nHe'd given them ten times the normal workload. They'd give up within the hour, and he could redistribute the rakes to someone useful.\n\n*Let's see how long they last.*\n\nLauel walked away and got to work himself.\n\n\"Dragon Claws.\"\n\nFive sharp stone pillars erupted from the earth before crumbling back into the soil. Fifty pyeong of land overturned in an instant. Lauel raked through the loosened dirt, gathering stones and roots into a pile, then smoothed the ground flat.\n\n\"This is enough.\"\n\nHe moved to the next plot and repeated the process, doing the work of hundreds alone.\n\nBland watched from a distance, then brightened. \"Magic can be applied to clear the land quickly. I should give it a try.\"\n\nPiaro caught his arm. \"Why waste magic on something that doesn't need it? You want to miss this golden opportunity for physical exercise?\"\n\nBland's eyes widened with understanding. \"I was too short-sighted.\"\n\n\"Look over there.\" Piaro gestured toward the laborers bent over their work, sweat gleaming on their backs. \"We must learn from them. New movements will be acquired. This will nourish your swordsmanship.\"\n\n\"Yes.\"\n\nThey observed the common workers—the angle of their spines, the pivot of their hips, the rhythm of the rake's swing. After studying for several minutes, they began.\n\n\"How about it?\" Piaro asked. \"Isn't this training?\"\n\nBland grunted as he worked. \"That's right. It places a severe burden on the waist, shoulders, and knees. My body hasn't been overworked like this before.\"\n\nThis wasn't exercise. It was labor. Raw, backbreaking work that neither noble had ever experienced. But their disciplined bodies adapted quickly, mimicking and refining the techniques they'd observed. Their rakes moved in precise arcs, impossibly fast.\n\nOne and a half hours later, they'd cleared the entire 500 pyeong plot.\n\n\"Lauel.\"\n\n*Finally.* Lauel straightened from his work, satisfaction warming his chest as he heard Piaro's voice. *They gave up.*\n\nHe didn't turn around. \"Was it too hard? You must have suffered.\" He wiped sweat from his brow. \"Go rest. Oh, and return the rakes.\"\n\n\"Why should we rest?\" Piaro's tone held genuine confusion. \"I'm here to report that we've finished our work. What else needs doing?\"\n\nLauel spun around. \"...What?\"\n\nPiaro was caked in dirt from head to toe, proof of hard labor. But the entire plot? In just two hours?\n\n\"If you don't mind.\" Lauel's voice came out strained. \"I'd like to check it myself.\"\n\n\"Of course.\" Piaro showed no offense. Natural, since this was his first time farming.\n\nLauel walked to the assigned plot. His breath caught.\n\n\"Heok.\"\n\nThe 500 pyeong stretch of wilderness had been transformed into perfectly cleared farmland. Every stone removed. Every root extracted. The soil turned and leveled with professional precision.\n\n*What type of magic did they use?*\n\nPiaro approached. \"Then, please give us the next task.\"\n\n\"Ah, yes...\" Lauel's mind reeled. He assigned them another 500 pyeong plot, then stayed to watch.\n\nWithin minutes, the other Overgeared members had gathered, drawn by Lauel's stunned expression. They folded their arms and observed the two workers.\n\nBland started first.\n\n\"Ohh.\" Vantner's eyebrows rose.\n\n\"Isn't he quite good?\" Pon murmured.\n\nBland cleared land ten times faster than the average worker—comparable to when Overgeared members used their skills. His strength and stamina matched theirs.\n\nThen Piaro began. After thorough stretching, he lifted his rake.\n\nThe Overgeared members' jaws dropped.\n\n\"W-What?\" Regas breathed.\n\n\"A professional farmer...!\" Huroi exclaimed.\n\nPiaro moved at ten times Bland's speed. But speed was only part of it. He understood the rake on a fundamental level, wielding it with perfect economy of motion. The tool sliced through packed earth like warm butter. With exquisite precision, he swept every stone, every root, every foreign object into neat piles.\n\n\"Hah...!\" Lauel pressed his hand to his forehead. \"Grid brought someone huge!\"\n\n\"Yes, a master of farming!\" Peak Sword nodded vigorously. \"With those skills, he's almost like a legendary farmer. We can't judge by appearance...\"\n\n\"But how did Grid know we needed a farmer for Reidan?\" Jishuka asked.\n\n\"This Huroi is impressed with My Lord's foresight!\" Huroi declared.\n\nAt that moment, Piaro paused. His eyes unfocused, sensing something the others couldn't perceive.\n\n\"Hmm?\" He turned to Lauel. \"Does this place not have enough water connected to it right now?\"\n\nLauel blinked. \"That's right. We plan to connect more channels in the future.\"\n\n\"I'll take care of it.\"\n\n\"...?\"\n\nEven Lauel's quick mind couldn't parse Piaro's meaning. The Overgeared members exchanged confused glances as Piaro drove his rake deep into the ground.\n\nThe earth shook. An invisible wave of energy rippled outward.\n\n\"An earthquake all of a sudden...!\" Zednos stumbled.\n\n*Giant worms?* Lauel's hand moved to his weapon. Around them, residents cried out in alarm.\n\nThen—\n\n**KUWAAAAAANG!**\n\nA pillar of water exploded from where Piaro stood, shooting skyward like a geyser. The column stretched higher and higher, droplets catching the desert sun.\n\n\"Wahhhh!\" The crowd erupted in cheers.\n\nLauel and the Overgeared members stood frozen in shock. Water gurgled and rushed around them as Piaro wiped his face clean of mud and spray.\n\n\"This is a good plot of land,\" Piaro said simply.\n\n\"...\"\n\nThe legend of the beggar farmer began that day. Piaro—clever, talented, the best at whatever he attempted—transformed from great swordsman to legendary farmer and legendary feng shui expert in a single afternoon.\n\nA festive atmosphere consumed Reidan. Precious water, found in land that had become wilderness. The people laughed, cried, embraced strangers.\n\nAt the same time, in the Reidan smithy:\n\n*Ttang! Ttang!*\n\n\"I can't even rest after being overworked in a week-long monster hunt...\" Grid muttered.\n\nThe Duke of the Eternal Kingdom, Lord of Reidan, hammered fiercely before the roaring blast furnace. His rank was the highest. His workload matched it.\n\nThis was normal.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and to achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}