{
  "id": 219,
  "title": "Chapter 219",
  "content": "# Chapter 219\n\nThree hours before the legendary farmer incident, Grid found Khan working alone in the smithy.\n\n\"Khan!\" Grid pushed through the door.\n\nThe old blacksmith looked up from his anvil. \"Ohh! You came!\"\n\n\"I missed you!\" Grid crossed the room in quick strides.\n\n\"I haven't been able to eat, because I wanted to see you!\" Khan set down his hammer.\n\nGrid paused. \"Eh? Should I have missed meals as well?\"\n\n\"Hahaha!\" Khan laughed and pulled Grid into an embrace.\n\nThey held each other, their friendship transcending the gap of identity and age. When they finally stepped back, Grid studied his mentor's face.\n\n\"I was worried that you wouldn't be able to adapt to the warm weather of the west, but you seem fine. Rather, you look healthier.\"\n\nKhan was in his late sixties, well past the average life expectancy in the Eternal Kingdom. By all accounts, he should be slowing down. Yet since returning to blacksmithing, he'd worked himself back to the vigor of a man twenty years younger.\n\nKhan waved off the concern. \"You don't have to worry. I have been working with fire all my life. How can I be threatened by this heat?\"\n\n\"You're a great inspiration.\"\n\nGrid smiled, but the expression didn't quite reach his eyes. He knew NPCs didn't live forever. The uneasiness sat in his chest like a stone.\n\n*Please live for a long time.*\n\nKhan had been his first real friend. The thought of losing the person who'd opened his heart was unbearable. Khan caught the shadow in Grid's smile. His own eyes grew wet.\n\n*He reminds me of my son.*\n\nHis late son. If the boy hadn't fallen sick and died, he would've been Duke Grid's age right now.\n\n*Originally, my son should be the one worrying about me.*\n\nHe wanted to see his son. But Duke Grid filled that void, in his own way. Khan swallowed the lump in his throat and bowed his head.\n\n\"Thank you.\"\n\nGrid blinked. \"Huh? What?\"\n\nKhan smiled at his puzzled expression. \"Didn't you come here to help me? So I wanted to thank you! Hahaha!\"\n\n\"What?\" Grid shook his head. \"This is originally my work.\"\n\nHe'd brought Khan to Reidan to ease the old man's loneliness, not to exploit his labor. Still, Grid had to acknowledge the reality.\n\n\"But the situation of the city is a little inconvenient right now, so I am grateful for your help. Let's work together to solve the problem.\"\n\nGrid stripped off the Holy Light set, the legendary armor clattering to the floor. From his inventory, he pulled out the old novice clothing, dirty and threadbare. It was what he'd worn back in Winston when he was nobody. The fabric had seen better days, but it allowed free movement. The only downside was looking like a complete beggar.\n\nKhan's eyes widened. \"Ohh! You can't hide your dignity with these shabby clothes!\"\n\nIt was true. Grid's dignity and charm stats now rivaled royalty. Even in rags, he radiated presence.\n\nGrid swept his hair back, exposing his forehead. He tied a cloth around his head to keep the strands from falling into his eyes, then surveyed the smithy.\n\n*It is unbelievably large.*\n\nMost smithies had one or two furnaces, maybe room for five people at most. This place was different. Eight large furnaces stood in a row, each one capable of industrial-scale production. The Overgeared members had invested heavily in Reidan's future.\n\n*Isn't this at the level of a factory? Dozens of blacksmiths could work at the same time and produce a large quantity of items.*\n\nThe thought was sobering. Currently, only he and Khan manned this vast space. The potential sat unused.\n\n*I should look into inviting blacksmith users.*\n\nGrid approached one of the furnaces, ready to begin. Then he stopped.\n\n*I don't know how to make any farming equipment.*\n\nThe realization was embarrassing. He'd never needed to craft tools for farmers before. But the legendary skills existed for moments like this. Grid picked up one of Khan's completed rakes and activated his appraisal skill.\n\n> [Sturdy Rake]\n>  \n> Rating: Normal  \n> Durability: 20/20  \n> Attack Power: 3~7\n>  \n> A farming equipment suitable for digging at the ground.\n>  \n> It is made by Blacksmith Khan who can represent a region, so it is a rake with excellent durability.\n>  \n> Weight: 60\n\n> [A hidden function doesn't exist.]\n\n> [You have grasped the materials that make up Sturdy Rake, the production method, and the intentions of its creator.]\n\n> [Your understanding of the Sturdy Rake is now at 100%. You will be able to use the Sturdy Rake perfectly.]\n\n> [You have learned how to make a rake.]\n\nThe knowledge flowed into his mind. Grid smiled and got to work.\n\n*Ttang! Ttang!*\n\nThe hammer blows echoed through the smithy. Khan worked at a steady pace, bending iron into the trident-like structure. Simple, efficient. He finished one rake in twenty minutes.\n\nGrid's process was different. He hunched over the anvil with the same intensity he brought to boss raids. Each strike of the hammer was deliberate. He shaped the prongs like sword edges, testing the angles. His hands moved with surgical precision, over two thousand dexterity guiding every touch.\n\nTwo hours passed.\n\nKhan set down his hammer. \"Ah, I should take a rest.\"\n\nAge showed in the weariness of his movements. Grid, with his superhuman stamina, kept working. Khan walked over to inspect Grid's progress and froze.\n\n\"No, what are you doing right now?\"\n\nGrid looked up. \"Huh? What's the problem?\"\n\nKhan gestured at the single rake on the workbench. \"Why are you spending two hours making a rake? I've already finished six rakes in two hours. Isn't this a waste of time?\"\n\n\"Hrmm.\"\n\nGrid examined Khan's six completed rakes. All normal rating. The craftsmanship was serviceable, but far below what Khan was capable of. Grid straightened and met the old man's eyes.\n\n\"Khan.\"\n\nThe weight in that single word made Khan flinch. Grid's eyes held depths Khan rarely saw, the gaze of someone much older and wiser. It was quite different from the usual Grid.\n\n*Grid can also look like this!*\n\n\"Shouldn't you always do your best when making equipment?\" Grid's voice was quiet. \"So why are you roughly making the farming equipment?\"\n\n\"That...\" Khan hesitated. \"Lauel said to mass produce as much farming equipment as possible so that he could put more manpower into the rehabilitation project. Produce as much as possible.\"\n\n\"Mass production?\" Grid's presence filled the room. \"Even lowly blacksmiths can do something like that.\"\n\nIn that moment, he wasn't the greedy young man or Khan's valued friend. He was Pagma's Descendant, a legendary blacksmith bearing the weight of that title.\n\n\"Your role isn't to produce average farming equipment for ordinary farmers.\"\n\nKhan swallowed. \"Then what is my role?\"\n\n\"It's to make the best farming equipment that will help ordinary farmers become the best.\" Grid's tone left no room for argument. \"That is your mission as an advanced blacksmith. Please don't forget your pride as an advanced blacksmith, no matter the situation.\"\n\n\"Ah!\"\n\nUnderstanding crashed over Khan like a wave. He'd worked with Grid long enough to accumulate vast experience. The **Blacksmith's Affection** skill had elevated him to advanced level 7, one of the finest craftsmen alive. And Grid's words rang true.\n\n\"You're absolutely right!\"\n\nMotivation surged through Khan's veins. Grid handed him the rake he'd just completed.\n\n\"Look at what I created.\"\n\nKhan's breath caught. \"Truly brilliant!\"\n\n> [Ideal Rake]\n>  \n> <span class=\"rarity-epic\">Rating: Epic</span>  \n> Durability: 50/50  \n> Attack Power: 25~31\n>  \n> * Stamina **+7**\n> * Dexterity **+12**\n> * It will slightly improve the quality of the soil.\n>  \n> A farming equipment suitable for digging at the ground.\n>  \n> An item made by the blacksmith 'G' who has a reputation close to a legend. Despite the use of bad quality iron and wood as the material, its function is outstanding.\n>  \n> The three delicate prongs will make the soil finer, improving soil quality.\n>  \n> Weight: 51\n\n*The one rake that Grid made in two hours is much more valuable than the six rakes that I made!*\n\nKhan wanted to make a good rake. No, he *needed* to. He turned back to the furnace with renewed purpose.\n\n*Ttang! Ttang!*\n\n\"Don't overdo it.\" Grid watched him with concern.\n\nKhan, lost in concentration, didn't respond.\n\n*Yes, this is like him.*\n\nGrid smiled warmly and began his second rake.\n\n---\n\nTwo hours later, both Grid and Khan completed rare-rated rakes. Another two hours after that, Khan straightened with a triumphant shout.\n\n\"Yes! It can't be compared to your work, but I have also produced a satisfactory rake!\"\n\nAn epic-rated rake. The performance fell short of Grid's first attempt, but it was clearly excellent work. The dignity of an Advanced Blacksmith level 7 shone through.\n\nGrid, meanwhile, stared at his own creation.\n\n\"Damn.\"\n\nNormal rating. Heat crept up his neck. How could such a simple item defeat him?\n\n\"Are you trying to deceive me with a rake?\"\n\nHis pride as a legendary blacksmith stung. Two hours later, both completed rare-rated rakes again.\n\nKhan was satisfied. \"Not bad.\"\n\nGrid's anger boiled over. \"Ugh, dammit!\"\n\nHow could a legendary blacksmith struggle so much with farming equipment? This wasn't normal.\n\n\"Are you tricking me again? These damn scum!\"\n\nHe shouted at the invisible operators, wherever they watched from. Khan gave him a pitying look.\n\n\"It has been a long time since I've seen this.\"\n\nIt was a frequent phenomenon from their days in Winston. Khan left Grid to his shouting and started a new rake.\n\n---\n\nEvening arrived. Lauel finished his administrative work and rushed to the smithy.\n\n\"Grid! Let's go eat. Then we need to consult with the guild about the estate management plans...\" He stopped in the doorway. \"Eh?\"\n\nHis expression twisted. After half a day, there should be a mountain of tools. Instead, fewer than twenty pieces sat on the benches.\n\n\"Surely you weren't playing around?\"\n\nLauel had expected the legendary blacksmith to work like a machine. Disappointment colored his tone. Grid threw him a rake.\n\n\"I wasn't playing around. Look at this.\"\n\nLauel caught it reflexively. \"...?\"\n\nWhy examine the details of a rake? Still, he complied. His eyes went wide.\n\n\"Heok.\"\n\n> [Perfect Rake]\n>  \n> <span class=\"rarity-unique\">Rating: Unique</span>  \n> Durability: 71/71  \n> Attack Power: 49~61\n>  \n> * Stamina **+15**\n> * Dexterity **+28**\n> * Greatly improves the soil quality.\n>  \n> A farming equipment suitable for digging at the ground.\n>  \n> An item made by the blacksmith 'G' who has a reputation close to a legend. Despite the use of bad quality iron and wood as the material, its function is outstanding.\n>  \n> The three delicate prongs will make the soil finer, improving soil quality. The three prongs are bent at the ideal angle to work the soil. Even a child can use this rake to turn a wasteland into an excellent garden.\n>  \n> Weight: 45\n\nThe implications hit Lauel like a hammer blow. A normal rake let a healthy adult clear a thousand pyeong in a day. Reidan's malnourished residents could barely manage a hundred pyeong.\n\n*The people of Reidan will be able to do more than that if they have this rake. The soil improvement means that the land will give a good harvest.*\n\nThis game truly revolved around items. Grid was the proof. Lauel's decision to follow this man solidified further. One day, every soldier in Reidan would wield equipment like this.\n\nThen an ominous thought struck him.\n\n*Don't tell me that when he becomes a king...*\n\nSurely he wouldn't name it Overgeared Kingdom, would he? Lauel's face crumpled in despair."
}