{
  "id": 22,
  "title": "Chapter 22",
  "content": "# Chapter 22\n\nThe carriage departed in the afternoon and rolled into Winston Village the following morning. Grid stepped out, blinking in the early light. \n\nWinston was massive. Four times the size of Bairan, bustling with activity—it rivaled Patrian's fortified walls in scope. *How is this still called a village?*\n\nHe counted out 8 gold and 90 silver to the coachman, the coins clinking into the man's weathered palm.\n\n\"I have a question.\"\n\nThe coachman pocketed the fare. \"Ask. I'll answer if I can.\"\n\n\"Why isn't Winston called a city?\"\n\n\"Originally, it was smaller than Bairan.\" The coachman gestured toward the crowded streets. \"But there are hunting grounds nearby—good ones for beginners and intermediate users. Word spread. Travelers flooded in. Rumor has it the place will be upgraded to a city soon. Earl Steim's heir might be sent as the new lord when that happens, but I don't know the timing.\"\n\n*Earl Steim?* The name tugged at Grid's memory, but he'd lived through too much chaos recently to place it. *Where have I heard that before?*\n\nHe shook his head. \"Well, it has nothing to do with me anyway.\"\n\n*Now, shall I begin?*\n\nGrid headed straight for the warehouse administration. After providing his registration number and password, the administrator extended an open palm. A tip. Of course.\n\n*Dammit. I have to pay just to use my own warehouse?*\n\nHis hands trembled as he handed over 30 silver. The administrator counted it, then began chanting while tracing a small circle with his magic wand. Space warped. A small personal warehouse materialized before Grid through teleportation magic.\n\nEmpty. Completely empty.\n\nHe'd sold everything—every scrap of japtem—to afford potions for Ashur's three-month quest. One year of playing Satisfy, and his warehouse contained nothing but dust.\n\n\"Ugh... in reality and in the game...\"\n\nGrid opened his inventory with mounting frustration.\n\n> [Mamon's Greatsword]\n> \n> Rating: Epic  \n> Durability: 88/204 | Attack Power: 178~301 | Attack Speed: -16%\n> \n> * Additional water damage will be added to all critical attacks.\n> \n> This greatsword was patronized by Mamon, guardian of Lake Pamian. The influence of the lake imbued it with a strong water aura.\n> \n> Conditions of Use: Level 65+, 260+ Strength, 150+ Stamina.  \n> Weight: 1,050\n\n> [Mengel's Plate Armor]\n> \n> Rating: Rare  \n> Durability: 51/180 | Defense: 165 | Movement Speed: -2%\n> \n> * Strength +10\n> \n> A work crafted by the blacksmith Mengel in the fortified city of Patrian. The defense is improved, the weight reduced. Mengel's strong willpower lingers in the metal.\n> \n> Conditions of Use: Level 60+, 180+ Strength.  \n> Weight: 1,203\n\n> [Intermediate Potion] (34)  \n> Restores 1,500 health. Cooldown: 20 seconds. Weight: 306\n\n> [Advanced Potion] (27)  \n> Restores 4,000 health. Cooldown: 20 seconds. Weight: 324\n\n> [Intermediate Strength Potion] (2)  \n> Increases Strength by 50 for 5 minutes. No cooldown. Weight: 62\n\n> [Intermediate Agility Potion] (3)  \n> Increases Agility by 50 for 5 minutes. No cooldown. Weight: 90\n\n> [Special Jaffa Arrow] (1)\n> \n> Rating: Epic  \n> Attack Power: 35~42\n> \n> An arrow crafted by someone with great skill and potential, but lacking experience and reputation. The fusion of jaffa and steel grants extreme penetration.\n> \n> * Chance to ignore enemy defense.  \n> Weight: 0.1\n\n> [Yaffa] (3)  \n> A metal obtained from smelting Jaffa ore. Weak on its own, its properties change when mixed with steel. Weight: 60\n\nGrid stared at the pathetic list. This was it. Everything he owned. He wanted to store Mamon's Greatsword and Mengel's Plate Armor to reduce his encumbrance, but a thought stopped him.\n\n*I haven't appraised them yet.*\n\nThe Legendary Blacksmith's Appraisal skill revealed hidden functions and increased his understanding of items. If he used it now, he could reduce the penalties for wearing equipment above his level.\n\nGrid activated the skill on both pieces.\n\n> [A hidden function doesn't exist.]\n\n> [You have grasped the materials, production method, and creator's intentions for Mamon's Greatsword.]\n\n> [Your understanding of Mamon's Greatsword is now 33%.]\n\n> [A hidden function doesn't exist.]\n\n> [You have grasped the materials, production method, and creator's intentions for Mengel's Plate Armor.]\n\n> [Your understanding of Mengel's Plate Armor is now 65%.]\n\nHis stats didn't meet the equipment requirements. Normally, Mamon's Greatsword would suffer a 30% attack penalty, and Mengel's Plate Armor a 20% defense penalty. But with increased understanding...\n\n> [Due to your class characteristics, you have equipped Mamon's Greatsword.]\n\n> [A penalty is applied because item conditions aren't met.]\n\n> [Attack power will decrease by 20%. Only half of the option effects will be applied.]\n\n> [Your understanding of Mamon's Greatsword is high. Penalties are reduced.]\n\n> [Due to your class characteristics, you have equipped Mengel's Plate Armor.]\n\n> [A penalty is applied because item conditions aren't met.]\n\n> [Defense will decrease by 8%. Only half of the option effects will be applied.]\n\n> [Your understanding of Mengel's Plate Armor is high. Penalties are reduced.]\n\n\"Hoh.\"\n\nThe greatsword now dealt 143-240 attack. The armor provided 152 defense. The options were still halved, but any reduction in penalty was welcome.\n\nStill, disappointment gnawed at him. He had 100% understanding with his axe and pickaxe, but these items remained stubbornly low. *I would've preferred it went up higher.*\n\n*Well, no need to be hasty.* Understanding would grow as he disassembled, repaired, and used the equipment. Time would solve it.\n\n\"Let's try repairing them.\"\n\nBoth items had degraded significantly. Using the Legendary Blacksmith's Repair skill would boost his understanding of them.\n\nThen...\n\n> [A repair tool is needed.]\n\n\"Ah, a separate repair tool is needed?\"\n\n*What is a repair tool? Fuck! My money! Money! Money!*\n\nDuring his warrior days, Grid had never possessed a repair skill. He'd always paid NPC blacksmiths. He'd never known special tools were required.\n\n*It's no wonder the repairs were so expensive!*\n\nHe could postpone repairs. But he'd already wasted 30 silver opening this warehouse. If he closed it now to buy tools, another 30 silver would vanish when he reopened it.\n\nGrid ground his teeth and stored both items in the warehouse. The storage fee was 10 silver per item. Brutal.\n\n\"The world is a thief...\"\n\nThirty silver to open the warehouse. Ten silver per item stored. Mother's Heart is Happy, the auction house, the warehouse administrators—all crooks.\n\n\"My 50 silver... My 50 silver...!\"\n\nFifty silver equaled 600 won in cash. Enough to buy 200 milliliters of milk, which could quench his thirst and strengthen his bones. He placed the heavy equipment inside with shaking hands.\n\n\"Kuuack...\"\n\nThe warehouse administrator bowed politely as Grid departed. Grid glared at him before stalking toward the square.\n\nThe central plaza teemed with life. Newbies fresh from character creation mingled with veterans in Level 100 gear. People stumbled about, adjusting to virtual reality. Party recruiters shouted. Merchants haggled. Quest information changed hands. Beggars panhandled. Couples strolled. Sightseers gawked. Every type of person imaginable filled the space.\n\nGrid stood at the edge, observing.\n\nBeginners gravitated toward East Street. Mid-level users favored South Street. West and North Streets drew everyone, regardless of level.\n\n*Makes sense.* East Street connected to beginner quest NPCs and appropriate hunting grounds. South Street served the mid-level crowd. West and North were commercial districts—shops, smithies, and markets.\n\n\"The blacksmith's likely in the west or north.\"\n\n> [Insight has increased by 1.]\n\nInsight helped detect hidden objects and predict risks. Grid hadn't tested it enough to gauge its usefulness yet.\n\n\"Well, any increase is good.\"\n\nHe explored West Street first, finding nothing inspiring. North Street yielded similar results. Then, on East Street, he spotted it. A massive smithy.\n\nThe building rose two stories high, dwarfing the cramped workshop in Bairan Village. Unlike Smith's one-man operation, this place clearly housed multiple blacksmiths working together.\n\n*The leader of dozens of blacksmiths should be at least intermediate level.*\n\nIf so, the master would recognize Grid's class and treat him well. Unlike Bairan, he could learn in a proper environment. Grid approached eagerly, anticipating the ring of hammers on anvils and the heat of roaring forges.\n\nSilence greeted him.\n\nNo hammering. No heat. No signs of life.\n\n\"W-What?\"\n\nGrid looked around, confused. In the corner, a pot-bellied man slumped against the wall, an empty bottle beside him. Was he sleeping? Dead?\n\nGrid approached cautiously and shook him.\n\n\"Hey. Hey!\"\n\n\"...Eh? What?\" \n\nThe man stirred. Not dead, then. He blinked blearily, then focused on Grid with an annoyed expression. \"What did you come here for?\"\n\n\"I want to learn how to make the best-selling item in this village. Can you help?\"\n\nThe old man's expression twisted into something mocking. \"This place ended a long time ago.\" He gestured at the empty smithy. \"The Mero Company bought up all the blacksmith shops and commercial real estate. They bulk-sell items at rock-bottom prices. Customers abandoned us. You came here to learn crafting? Are you sure you want to perish with me?\"\n\nThe door slammed open.\n\nA group of rough-looking thugs burst inside.\n\n\"Hey, Old Man! You decided yet?\" The leader grinned, showing yellowed teeth. \"Will you hand this building over to us? You'll have enough coin to drink yourself to death. Sounds like a good deal, doesn't it?\"\n\nGrid's eye twitched.\n\n*...What is this now?* \n\nHe felt the all-too-familiar sensation of being dragged into someone else's mess.\n\n---\n\n**Glossary of Common Korean Terms.**  \nOG: Glossary Link.  \nCurrent schedule: 16 chapters a week.  \nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing the day's chapters."
}