{
  "id": 220,
  "title": "Chapter 220",
  "content": "# Chapter 220\n\nThe central spire of Reidan Castle pierced the sky at eleven stories. Grid's neck ached as he craned upward, squinting against the sun.\n\n\"Is the height important?\"\n\nLauel gestured toward the weathered stone. \"It symbolizes the lord's power. Greater prestige, higher spire.\"\n\n\"So the former lord rivaled the king in authority.\"\n\n\"Correct.\"\n\nThe comparison wasn't hyperbole. Reidan Castle sprawled across the landscape with the same grandiosity as the royal palace itself.\n\n\"One hundred twenty-seven rooms,\" Lauel continued, his footsteps echoing through the vacant corridors. \"Six outbuildings. Five gardens, three parade grounds, and barracks for eight thousand troops.\"\n\nGrid ran his hand along a wall, rust flaking onto his palm. Every piece of furniture had been stripped away. Every ornament, gone. Dust coated the floors in thick layers, and the stale air tasted of abandonment. Yet beneath the decay, the bones of the castle remained intact.\n\n\"I expected ruins,\" Grid said. \"Like the city outside.\"\n\n\"The people of Reidan protected it.\" Lauel's voice carried quiet reverence. \"During the days when the empire controlled the Hebend River, Reidan paid tribute. When they couldn't meet the quota, they dismantled their own homes. But the castle?\" He shook his head. \"The castle was their pride. Their symbol. They'd rather starve than see it fall.\"\n\nGrid stopped walking.\n\n*The people are dying, but they protected their pride.* \n\nHe'd been a selfish bastard for most of his life. But mandatory military service had beaten one thing into his skull: patriotism. Forced or not, it gave him a lens to understand the people of Reidan.\n\n*They love this place. Really love it.*\n\nA realization crystallized. \"If I save them, they'll be loyal. They'll follow orders.\"\n\nLauel blinked, visibly impressed. \"I didn't think you'd make that connection.\"\n\n\"Don't exploit them,\" Grid said. \"And don't give unreasonable commands.\"\n\nLauel froze mid-step.\n\nGrid caught the look. \"What?\"\n\n\"Nothing. Just...\" Lauel exhaled slowly, the surprise melting into something resembling pride. \"I'll remember that.\"\n\n*I'm their lord now. Can't act like a child.* Grid's jaw tightened. *Do it properly.*\n\nThe people were his cash flow. He still believed that. But he'd do the minimum to protect them. They'd bled to preserve the lord's symbol. The least he could do was let them live.\n\n\"People need to exist here for this to work, right?\"\n\nLauel smiled. \"Right.\"\n\n***\n\nHours later, Grid stood in the great hall. The cavernous space could hold five hundred people, though currently it held only dust and a single decrepit throne. He crossed the floor, each footfall kicking up clouds, and lowered himself onto the seat.\n\nHis eyes closed.\n\n*This is real.*\n\nDuke of the Eternal Kingdom. Second only to the king in status and power. Representative of Huroi, Lauel, Jishuka, the entire Overgeared Guild.\n\n*Am I qualified?*\n\nThe question gnawed at him. Memories surfaced unbidden: childhood anxiety that made him shrink from others, adolescent limitations that kept him small, the suffocating frustration of his twenties. Before Satisfy, his life had been a graveyard of failed potential.\n\nThen Pagma's Rare Book changed everything.\n\n*Was it just luck?*\n\nHe sat with the question, turning it over in his mind like a problem he couldn't solve.\n\n*No.*\n\nLuck played a part. But he'd found the North End Cave after **months** of exploration. He'd endured, adapted, overcome. His strength. His effort.\n\n*I'm qualified. I climbed here because I earned it.*\n\nSomething shifted in his chest. A warmth spread through him as he opened his eyes, and for the first time in years, the weight he'd carried felt lighter. His gaze steadied, deep as the ocean floor.\n\n\"Huroi. Lauel.\"\n\nBoth men straightened. \"Yes.\"\n\n\"You've both said I'm destined to be the best.\" Grid's voice was calm. Controlled. \"Was that flattery? Exaggeration?\"\n\nHuroi dropped to one knee, Lauel following a heartbeat later. Their foreheads nearly touched the dusty floor.\n\n\"My Lord is already the best,\" Huroi said, unwavering.\n\n\"You're the only one I acknowledge,\" Lauel added. \"You're qualified.\"\n\nThey meant it. Grid's stats, skills, and items put him at the apex of two billion players. The only weakness was gold, and Reidan could fix that. His personality? His intelligence? He was improving. Evolving.\n\n\"...I'll believe you. And I'll take pride in myself.\"\n\nThe words settled into him like an anchor finding the seabed. Not arrogance. Not delusion. **Pride.** Real, earned pride.\n\nHe exhaled, long and slow.\n\nThe victim mentality, the gnawing inferiority complex born from a lifetime of failure—it didn't vanish. But the stranglehold loosened. His jealousy of others faded. His mind cleared. His vision expanded.\n\n\"This feels better.\"\n\nThe smile that spread across his face was genuine.\n\nGrid was finally reaching the end of his internal climb.\n\n***\n\nReidan could house four hundred thirty thousand people. Currently, it held barely twenty thousand. Lauel stood before a chalkboard, scratching out numbers with a piece of white stone.\n\n\"Food shortage is addressed,\" he began. \"Piaro discovered water sources, so farmland expansion is accelerating. Drinking water distribution is simple now.\"\n\n*Legendary farmer? Feng shui expert?* Grid frowned, but Lauel pressed on.\n\n\"Agriculture drives population growth. Consumption rises. External trade follows. Meanwhile, we build the smithy into an industrial center with Grid and Khan as the foundation. That's our path to becoming a commercial hub.\"\n\nHe tapped the board. \"Overgeared members focus on monster subjugation. Clear the west. Priority target: destroy the giant worm nest.\"\n\n\"Nest?\" Vantner leaned forward.\n\n\"Special category monsters don't respawn normally,\" Lauel explained. \"Find the nest, destroy it, and the giant worms stop appearing permanently.\"\n\nMurmurs of approval rippled through the room.\n\n\"We get experience,\" Jishuka said.\n\n\"And they're high-level targets,\" Pon added.\n\n\"High-level and dangerous,\" Regas countered.\n\n\"We're Overgeared,\" Vantner grinned. \"We have Grid.\"\n\nToban raised a hand. \"What about villages in the west? If people survived out there, we could bring them to Reidan.\"\n\nLauel shook his head. \"Too risky. Any settlement in the deep desert is likely near a vampire lair. Minimum level two-fifty for young vampires. The old ones hit four hundred. We're not ready for that fight.\"\n\nGrid stood, chair scraping against stone. \"I'm heading to the smithy. Work's piling up.\"\n\nNot exactly lordly words. Lauel was the real administrator, Grid the blacksmith. At first glance, the roles seemed backwards. But this was the correct division of labor.\n\nGrid wasn't smart enough to run a city. He'd appointed Lauel for exactly that reason.\n\n***\n\nThe Overgeared members scattered to hunt monsters and gather resources. Timber was the priority; desertification had stripped Reidan of wood.\n\nPiaro and Bland worked the fields alongside the people, dirt under their nails and sweat soaking their backs.\n\nJude drilled soldiers Grid had identified via the Great Lord's Sword.\n\n\"Jump! Roll! Gear up! Spear—stab and swing!\"\n\nHalf the recruits quit. The ones who remained transformed into elite fighters. Their Weapons Mastery stayed low, but their strength and stamina skyrocketed.\n\n*They don't need mastery,* Grid thought, hammering at his anvil. *Not when I give them weapons that hit like sledgehammers.*\n\n**Ttang! Ttang!**\n\nHe'd moved from farming tools to construction equipment. The rhythm consumed him. Every strike precise. Every product different. It wasn't hunting or raiding, but there was satisfaction in creation.\n\n*Irene will appreciate this.*\n\nHis dexterity climbed with every swing. More dexterity meant better manual techniques. He grinned at the thought.\n\nAcross the workshop, Khan barked at apprentices.\n\n\"That forging is sloppy! You add firewood **now**, your temperature control tanks!\"\n\nThe old man's voice grew stronger each day. Grid watched him work, warmth spreading through his chest.\n\nThen the door opened.\n\n\"It's been a while.\"\n\nRabbit stepped inside.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule: 20 chapters a week.**  \n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}