{
  "id": 221,
  "title": "Chapter 221",
  "content": "# Chapter 221\n\nRabbit came from nowhere. A backwater village in the rural north. But genius doesn't care about pedigree. He'd clawed his way to the top of the Mero Company through raw intellect alone. Years ago, he'd been the first to recognize potential in a broke, level 21 blacksmith named Grid.\n\nThe merchant bowed low. \"This commoner, Rabbit, greets the great hero, Duke Grid.\"\n\nGrid studied him. Thin-rimmed glasses. Cultured mannerisms. The air of a gentleman scholar. Those eyes held no visible greed, which made him look more like a priest than a merchant.\n\n*All lies.*\n\nBeneath that saintly exterior, Rabbit was as hungry for wealth as Grid had ever been. That hunger was exactly how he'd succeeded.\n\n*A true con artist makes you trust them completely.*\n\nGrid smiled. \"Must've been rough. Prison cell to palace. Quite the upgrade.\"\n\n\"The people of Winston treat me as a hero. Marquis Steim was generous with his accommodations.\"\n\n\"Good. I'm glad you're healthy.\" Grid's tone was easy, relaxed. \"It's good to see you again.\"\n\nRabbit's sharp gaze tracked every detail. Grid's posture. His expression. The cadence of his speech. Everything had changed. The transformation wasn't superficial. It ran deep.\n\n*I underestimated him.*\n\nRabbit had envisioned Grid as the greatest blacksmith of their generation. Perhaps the wealthiest man in the kingdom. But the man standing before him now aimed higher.\n\n\"You're climbing to the summit,\" Rabbit said. \"Where everyone else will be looking up.\"\n\nIt was sincere. The old Grid would have puffed up with pride, made some boastful declaration. This Grid met his eyes with calm certainty.\n\n\"It's a long climb. I'm still lacking. That's why I need your help.\" Grid paused. \"Will you serve me?\"\n\nRabbit bowed again. Deeper this time. When he spoke, his words carried the weight of genuine oath.\n\n\"Duke Grid, I believe you will make me the wealthiest man on the continent. I will follow you.\"\n\nGrid's lips quirked. \"Not the wealthiest on the continent. *I* will be the wealthiest.\"\n\n\"Haha. Then I'll settle for simply rich.\"\n\n\"Works for me.\"\n\nGrid drew the Great Lord's Sword. The blade caught the forge-light as he laid it across Rabbit's shoulder. They stood in Khan's smithy, not a throne room. Good. This place meant something. This was where Grid had forged himself.\n\n\"From this moment, you are a viscount of the Eternal Kingdom.\" The blade lifted. \"But your loyalty belongs to me alone.\"\n\nMarquis Steim had elevated Grid from commoner to viscount. Now Grid held that same authority. He wouldn't abuse it. Rabbit would receive proper compensation. A monthly salary befitting his rank.\n\nLauel had already warned him against selling noble titles to users. *Too many problems down that road.*\n\nRabbit pressed his fist to his chest. \"I and my descendants will serve only you, My Lord.\"\n\nThe system chimed.\n\n> **[You have used your authority as a duke to appoint 'Rabbit' as a viscount.]**\n>\n> **[You must pay Rabbit a monthly salary of 500 gold. Failure to pay will decrease his loyalty.]**\n\nGrid's grin widened.\n\n*Knew it. Named NPC.*\n\nHe pulled up Rabbit's information via the Great Lord's Sword.\n\n**Name:** Rabbit  \n**Age:** 37  \n**Gender:** Male  \n**Occupation:** Merchant / Viscount of the Eternal Kingdom  \n**Title:** Wealthy Merchant  \n\n*The finest merchant of this era. He possesses the ability to create demand for stones.*\n\n**Level:** 307  \n**Strength:** 49  \n**Stamina:** 380  \n**Agility:** 150  \n**Intelligence:** 2,241  \n**Political Power:** 1,505  \n**Insight:** 1,533  \n**Leadership:** 512  \n**Charm:** 210\n\n**Skills:** Composure (A+), Detection (A+), Administration (S), Business Acumen (S+), Wisdom of a Great Merchant (SS)\n\n*Born in Winston, northern Eternal Kingdom. Commoner origins. Devoted himself to study and earned sponsorship to Central Academy, graduating top of his class. Served as royal administrator but faced discrimination. Became a merchant and achieved unprecedented success. Poor childhood instilled obsessive relationship with money.*\n\n**[Composure (A+)]**  \nMaintains clarity in any situation. Active mind prevents errors.\n\n**[Detection (A+)]**  \nPerceives essence of people and objects. Facilitates communication and optimal outcomes.\n\n**[Administration (S)]**  \nExceptional governance ability. Can develop a village into a city.\n\n**[Business Acumen (S+)]**  \nPeak trading ability. Can transform garbage into profitable goods.\n\n**[Wisdom of a Great Merchant (SS)]**  \nExperience and expertise of a corporate magnate.\n\nGrid's eyes lingered on the **Administration (S)** rating.\n\n*Development speed scales with administrator quality.*\n\nAdministrators were vital. And rare. Winston was the second-largest city in the north, yet Administrator Valdi only possessed a B-grade rating. What could an S-grade accomplish?\n\n*And his merchant abilities are S+ and SS.*\n\nThe man could literally sell trash. Make it desirable. The description read like a scam artist's fever dream.\n\n*How do I use him?*\n\nAdministrator? Or merchant? Before Grid could decide, Rabbit cleared his throat.\n\n\"I surveyed Reidan before coming here.\" The merchant adjusted his glasses. \"The field-clearing and waterway projects are solid. But the scale is excessive.\"\n\n\"Excessive?\"\n\n\"Reidan's population is twenty thousand. Reduce the farmland by a third. You'll still feed everyone.\"\n\nGrid shook his head. \"Once we finish clearing, we're expanding agricultural output. Building an agricultural base first, then transitioning to commercial.\"\n\n\"Wrong approach.\" Rabbit's tone was matter-of-fact. \"Reidan's climate limits viable crops. It's unsuitable as an agricultural hub.\"\n\n\"We're focused on fast-growing species. High turnover, quick export cycles.\"\n\nLauel strode into the smithy, expression sour. \"Fast-growing crops aren't competitive. They're commodities. Available everywhere.\"\n\nRabbit turned toward the newcomer. \"Precisely my point.\"\n\nLauel's eyes narrowed. \"We compensate with volume and low prices. Reidan's advantage is land. Lots of it. Agriculture generates capital. It's the only viable path.\" He paused. \"And who are you?\"\n\n\"This is Rabbit,\" Grid said. \"Former second-in-command of the Mero Company. Largest trading house in the north.\"\n\nLauel's jaw tightened. *Second-in-command. Of a regional company. And he's dictating city policy?*\n\nGrid held out the Great Lord's Sword.\n\n\"What's this for?\"\n\n\"Wear it. Check Rabbit's stats yourself.\"\n\nLauel snatched the blade, grumbling. He equipped it and activated Character Observation.\n\nHis eyes went wide. \"Ah.\"\n\nGrid watched Lauel's face cycle through surprise, calculation, and finally reluctant respect. \"I'm not undermining you. But hear him out. Might learn something.\"\n\nLauel stared at Rabbit's stat window for a long moment. Then he nodded slowly.\n\n***\n\n\"Rabbit handles territorial administration. I'm working the fields.\"\n\nLauel's decision was immediate. He'd recognized superior capability and adapted.\n\nGrid frowned. \"Can't you administrate too? Wouldn't it be better to have Rabbit build a merchant company? Play to his strengths?\"\n\n\"I have business skills. Not the **Administration** skill.\"\n\n*Right. Game mechanics.*\n\nSkills mattered more than practical knowledge. The **Administration** skill accelerated domestic development exponentially.\n\n\"Plus, diplomacy falls under administration.\" Lauel glanced at Rabbit. \"His merchant talent will manifest through diplomatic channels.\"\n\nLauel's prediction proved accurate.\n\nRabbit's first act as administrator was restructuring Reidan's economy. He cut agricultural projects by half. Redirected resources into alchemy facilities. Invested in smithing infrastructure to amplify the output of Grid, Khan, and the other craftsmen. Simultaneously, he opened diplomatic relations with Baron Butin of the Saharan Empire.\n\n***\n\n\"The alchemists confirm it. Desert sand has no alchemical value.\"\n\nSand was Reidan's only abundant resource. Useful for construction, but only sea sand. Desert sand was too fine. Useless.\n\nModern technology could repurpose it. But Satisfy's medieval-fantasy setting lacked such advancements. Rabbit had explored magical and alchemical applications. All failed.\n\nThen one afternoon, he approached Lauel with a proposal.\n\n\"We're exporting sand to Baron Butin.\"\n\nLauel blinked. \"Sorry, what?\"\n\n\"Sand. To Baron Butin.\"\n\n\"Why would we export desert sand to someone who lives in the desert?\"\n\nThe west was nothing *but* desert. Sand was everywhere. Exporting it made zero economic sense.\n\nRabbit smiled. \"I'll create the demand.\"\n\n\"How?\"\n\n\"Baron Butin operates an imperial resort. Wealthy nobles, rich merchants. They vacation there.\" Rabbit steepled his fingers. \"Reidan's people have survived this hostile desert for a decade. We market the sand as the reason. A health tonic. The **Longevity Remedy**.\"\n\nLauel stared. \"You're insane.\"\n\n\"It's a luxury product. Scarcity creates desire. We price it high to establish prestige. If it's cheap, no one will believe it works.\"\n\n\"This is fraud.\"\n\n\"Is it?\" Rabbit's expression remained placid. \"Who can prove their exact lifespan? There's no way to verify whether the remedy extends life or not. Without proof, there's no fraud.\"\n\nLauel opened his mouth. Closed it. *That's... actually true.*\n\n\"Khan will be our spokesman,\" Rabbit continued. \"Over sixty years old. If he endorses it, credibility increases. The remedy's reputation grows.\"\n\n*He's genuinely mad.*\n\nBut weeks later, Lauel stood corrected.\n\n\"It's selling.\"\n\nThe **Longevity Remedy**. Desert sand in decorative glass bottles. Three gold per ten grams. An insane price.\n\nNobles and merchants visiting Baron Butin's resort heard the story. Curiosity did the rest. They bought bottles as conversation pieces. As exotic gifts. As desperate bids against mortality.\n\n\"This is going to cause problems,\" Lauel muttered.\n\nRabbit shrugged. \"Three gold means nothing to the wealthy.\"\n\nEven if they discovered the truth, they'd laugh it off. The amount was trivial to them. And how could they prove it didn't work? Lifespans were unknowable. The product was unfalsifiable.\n\n\"My only regret is the limited customer base. The Butin Barony doesn't see heavy traffic. Current revenue is around eight hundred gold per month.\" Rabbit paused. \"But when word spreads, that will change.\"\n\nLauel calculated. Eight hundred gold monthly. Pathetic for a major city. But the product was *sand*. Free raw material. Packaged and sold for three gold per ten grams. The profit margin was 99.9%. If sales scaled as Rabbit predicted...\n\n*He really is a wealthy merchant.*\n\n*This is a complete scam.*\n\nLauel and the Overgeared members exchanged uneasy glances. They'd seen behind Rabbit's saintly mask.\n\nGrid just laughed.\n\nTalented people kept gathering around him. One by one, the pieces were falling into place."
}