{
  "id": 223,
  "title": "Chapter 223",
  "content": "# Chapter 223\n\nYoungwoo helped his parents harvest garlic, wolfed down dinner, and pulled up his fan cafe.\n\n\"Finally...\"\n\nThe member count had broken two million. Yesterday it sat at 1,998,411. The golem invasion and his promotion to duke had spiked his popularity hard.\n\n*I'm actually happy.*\n\nTwo million people cared about him. Liked him. After years of being treated like dirt, the attention felt strange. New. He smiled every morning now.\n\n*Wonder how Noe's doing.*\n\nHe navigated to his pet's fan page and laughed.\n\n\"Can't compete with a cat.\"\n\nNoe's fan cafe clocked 2.75 million members. The gap widened daily. A few months ago, that would have eaten him alive. But now?\n\n*Noe's fame reflects on me. I'm his owner.*\n\nMonths of watching Lauel think had rubbed off. He closed the flame war draft he'd been writing and scrolled instead.\n\nThe top post stopped him cold.\n\n**Title: Grid Doesn't Know About Noe?**\n\nYoungwoo's eye twitched. Noe was *his* pet. He knew everything about that narcissistic furball, including the stupid simple personality hiding behind those jewel-like eyes.\n\nHe clicked.\n\n**Content:** It's been a while since Noe appeared in Reinhardt to save the day.\n\nThose gem-like eyes. That overwhelming presence. He even weakened the evolved ancient weapon by swallowing it whole, turning the tide for Grid and Overgeared.\n\nBut here's my question. Don't pets change form as they level up? Noe looks identical to his National Competition appearance. That means his level hasn't increased. Grid isn't raising him properly.\n\nThink about it. Grid is the first legendary class. His schedule is packed. Turn on any TV right now and you'll see his commercials back to back. He's a top star. He barely has time to play Satisfy.\n\nYoungwoo's jaw clenched.\n\n\"Nonsense.\"\n\nThose commercials? Filmed right after the National Competition. He'd stopped all broadcast work since then. Every waking hour went to Satisfy and managing Reidan. This idiot didn't know anything.\n\nHe kept reading.\n\nGrid having less playtime means less time raising Noe. That's why Noe's level is stagnant. I can deduce Grid has poor understanding of top-grade pets.\n\nNormal pets lose loyalty if separated from their owners too long. Owners usually store them in inventory during long absences or logout.\n\nBut drakes? Top-grade pets don't lose loyalty easily, even when active separately from their owners. Drake owners let them hunt freely to level independently. They don't waste inventory space.\n\nHere's the problem. Noe is superior to drakes. He dominated dozens of drakes solo and calls himself the best demonic beast of hell. He should have *more* freedom than a drake.\n\nIf Grid had given Noe freedom, his growth would be tremendous. But Grid lacks pet knowledge. He probably keeps Noe locked in his inventory like a common summon.\n\nNoe's growth is stagnant. This proves Grid's ignorance and insults top-grade pets everywhere.\n\n\"Ah...\"\n\nUnderstanding crashed over him.\n\n*I really don't know anything about pets.*\n\nCommon pets split experience with their master while hunting. That's why he'd never bothered leveling Noe. The cat was strong enough without it, and Youngwoo didn't want to hemorrhage experience.\n\n*But top-grade pets can hunt independently? Grow on their own?*\n\nWithout betraying their owner.\n\n*I should give Noe freedom. Let him grow.*\n\nNoe hadn't eaten since the golem invasion. One meal in weeks. The rest of the time, inventory storage.\n\n\"Must be suffocating.\"\n\nGuilt gnawed at him. He appreciated the knowledge.\n\n\"But this is too much.\"\n\nAnger simmered beneath the guilt. A community of 2.75 million members, and this guy publicly called him ignorant based on pure speculation?\n\n*I represent Overgeared.*\n\nAn insult to him was an insult to the guild.\n\nYoungwoo cracked his knuckles and started typing.\n\n**God Grid isn't Bald's comment:** Yes, next pet expert please ^_^ I am an expert on all classes ~\n\nThe post's author claimed pet expertise. But the keyboard warrior just labeled him a \"non-expert who knows nothing about pets.\"\n\n***\n\nLater, in Reidan.\n\n\"The best demonic beast of hell has arrived!\"\n\nNoe hovered at eye level. Still level 35 despite demolishing an ancient weapon.\n\n\"Is it time to eat?\"\n\nHopeful eyes fixed on Grid.\n\n\"Starting now, you can move freely around Reidan. Eat any monsters you want, but don't harm humans. Report anything suspicious to me. And fly to me when I call, no matter what you're doing. I'm still your master.\"\n\nNoe's eyes grew wet. His triangular nose twitched.\n\n\"Master is giving Noe freedom? Noe can really go? Master can believe in Noe!\"\n\n\"As long as you follow my rules.\"\n\n\"Thank you! Master is the best!\"\n\nThe tiny demon wings beat frantically. Noe circled Grid's head three times, then shot skyward.\n\n\"A cat?\"\n\nReidan's citizens gaped at the black cat soaring overhead. The historic day when Noe, future guardian deity of Reidan, revealed himself to the people.\n\n***\n\nSehee and Yerim were living legends among South Korea's high school population. Top 10 nationwide on mock exams. Drop-dead gorgeous. Walking targets for envy.\n\nRecently? Their popularity went nuclear. Before, they were school celebrities. Now? National icons. International recognition. All because of the golem invasion of Reinhardt six weeks ago.\n\n\"Ruby!\"\n\n\"Sexy Schoolgirl!\"\n\nThe two girls who fought beside Grid to save the Eternal Kingdom. The first player earls. People mobbed them everywhere.\n\n\"How did you join Overgeared?\"\n\n\"What's God Grid really like?\"\n\n\"How do you study and play so well?\"\n\n\"Why is your ID Sexy Schoolgirl?\"\n\nThe interrogations never stopped. Media outlets hounded them for interviews. Corporations flooded them with CF modeling contracts.\n\n\"This is insane.\"\n\nLeaving the house without a disguise became impossible. After school ended, they wrapped themselves in masks and scarves before navigating the crowd of students. They barely made it off campus.\n\nTheir destination wasn't home or the library. The capsule room. Three sessions a week, by schedule.\n\nThree hours later.\n\n\"That was so much fun, right?\"\n\n\"Yeah. I'm finally comfortable with the new skills.\"\n\nSehee had hit level 70 after the golem invasion. Yerim, the Saintess' Knight, sat at level 51. She hadn't gained experience during the defense battle. But in a party, the level gap didn't matter.\n\nSaintess and Saintess' Knight synergized perfectly. Plus, Youngwoo had crafted their gear. Together, they could hunt level 100 monsters. To quote Lauel, they were golden spoons leveling up to support Youngwoo.\n\n\"It really is Ruby and Sexy Schoolgirl.\"\n\nFour university students had tailed them from the capsule room. They'd seen through the disguises.\n\n\"It's not even 10 PM. Why go home so early?\"\n\n\"Let us buy you something nice. We're all Satisfy players. We should be friends.\"\n\nThe students clearly thought highly of their looks. Online shopping mall models, confident that pure high school girls would fall for pretty faces.\n\nWrong assumption.\n\nSehee hated all men except her brother. Yerim measured men by their bank accounts.\n\n\"Do you have money? We only eat expensive food.\"\n\nYerim flashed a dazzling smile. Predatory.\n\nThe students' hearts hammered.\n\n\"Tell us what you want! We'll buy anything!\"\n\n\"No need. Someone's already taking us to dinner.\"\n\n\"Grid?\"\n\n\"That's right.\"\n\n\"...\"\n\nFour pairs of eyes went cold. Avid Yura and Jishuka fans, all of them. The National Competition scandal had transformed them into rabid Grid anti-fans. The bastard had already monopolized the world's two most beautiful women. Now he was hoarding Sehee and Yerim too?\n\n\"That bastard Grid...\"\n\n\"Hey, listen. You shouldn't hang around a playboy like that. Dump the trash and come play with us instead.\"\n\nThe mention of Grid's name shattered their composure. They grabbed Sehee and Yerim's wrists.\n\n\"Get your hands off them.\"\n\nThe voice dripped fury. A voice everyone in South Korea knew. Everyone in the world.\n\n\"Brother!\"\n\n\"Grid!\"\n\nShin Youngwoo. Ever since his sister and her friend became famous, he'd worried about their safety. He picked them up every night now. Tonight, he'd arrived just in time to see this.\n\n\"Remove your hands. Right now. I'll let it slide this once.\"\n\nHe pulled out his phone and dialed 112.\n\n*Beep.*\n\nThe screen went black.\n\nDead battery.\n\n\"Are you serious right now...\"\n\nWhy did this always happen to him?"
}