{
  "id": 224,
  "title": "Chapter 224",
  "content": "# Chapter 224\n\nYoungwoo's grasp of social norms remained tragically underdeveloped. His phone existed solely to summon delivery drivers. The battery indicator? Irrelevant. He'd never bothered to check it, treating the device like decorative furniture.\n\nUntil now.\n\n*I'm screwed.*\n\nHe'd been seconds away from calling the police. His thumb had hovered over the emergency dial. Then the screen went black.\n\nThe four university students closed in.\n\n\"Grid, isn't managing an estate a full-time job?\" The tallest one stepped forward, still gripping Sehee's wrist. His tone dripped with false concern.\n\n\"You were partnered with Yura and Jishuka during the Competition.\" Another student tightened his hold on Yerim. \"So why are you slumming it here?\"\n\nThe third one sneered. \"We looked up your age. What's a guy your age doing monopolizing high school girls?\" He leaned closer. \"Want handcuffs? Because that's how you get handcuffs. *Real* ones.\"\n\nThey knew exactly how old he was. They'd done their homework. Yet their hands remained clamped around the girls' wrists, knuckles whitening with pressure.\n\n*Those bastards.*\n\nRage flared hot in Youngwoo's chest. Their mocking voices. Sehee's pained expression as fingers dug into her skin. Every instinct screamed at him to charge forward and shatter their jaws.\n\nBut this wasn't Satisfy.\n\nIn reality, Shin Youngwoo was helpless. He'd spent years on the receiving end of beatings. Countless times, he'd tasted blood and concrete. Now he was supposed to take on four healthy university students?\n\nImpossible.\n\nHis eyes swept the street. Empty. Not even a passing car. The clock hadn't reached 10 p.m., but the area was silent. Sehee and Yerim had deliberately chosen this isolated spot to avoid recognition.\n\n*This isn't good.*\n\nYoungwoo drew a slow breath. Forced the anger down. Smiled.\n\n\"Let them go. Please?\" He spread his hands, non-threatening. \"This isn't some drama. Nobody's entertained. Right?\"\n\nThe university students didn't budge.\n\n\"What if we don't want to?\"\n\nTheir resentment was palpable. Grid monopolized the beautiful women. Yura. Jishuka. Now their future prospects too? Unacceptable. The lead student yanked Sehee forward hard enough to make her stumble.\n\n\"These girls are playing with us tonight.\" He grinned. \"What does it matter who we are? We make money from the game too. Girls don't care who they're with, as long as the wallet's fat. Right?\"\n\n\"Let go!\" Sehee twisted, trying to break free. Her strength was nothing against grown men.\n\n\"Stay still!\"\n\nInstead of releasing her, the student's grip turned brutal. His free hand rose, palm open. Threatening.\n\n\"Won't you be more reasonable?\"\n\nYerim, silent until now, spoke. Her voice was ice.\n\n\"You damn scum...\" Yerim's frown deepened. \"Do you want to die?\"\n\nThe words snapped something inside Youngwoo.\n\nIt didn't matter that he couldn't fight. He couldn't stand by while his sister was insulted and manhandled like livestock.\n\n*Even though I was a loser.*\n\nHigh school. Lee Junho had beaten him regularly. For nothing. For entertainment. Youngwoo had never fought back, too afraid of worse retaliation. He'd laughed it off when he wanted to scream. The other students learned to ignore him. That isolation became a scar that followed him into adulthood.\n\n*But I've moved past that.*\n\nShin Youngwoo was no longer a pushover. He wouldn't surrender to thugs out of fear.\n\n\"What? You'll kill us?\"\n\n\"Puhahaha!\"\n\nLaughter erupted from the group. Some of Youngwoo's former classmates had leaked stories online after his rise to fame. His school days were public knowledge.\n\n\"This idiot can't tell reality from games.\"\n\n\"Hey, Grid.\" The tallest student spat on the sidewalk. \"This is reality, not Satisfy. Try your Pagma's Swordsmanship here. Use Kill!\" He made exaggerated sword motions. \"Oh wait. You can't. So where's this courage coming from? Huh?\"\n\nThey saw him as prey. Weak. Exploitable. Even Youngwoo doubted he could win. But retreat wasn't an option. His fists clenched.\n\n*They're shaking.*\n\nA student hawked phlegm onto the pavement and advanced. Could he beat even one of them? The old Youngwoo would've run. But Satisfy had rebuilt his self-worth. Given him something precious.\n\nCourage.\n\n*If I have to fight, I'll fight.*\n\nFighting spirit kindled in his eyes. He wasn't Grid here. But he had his own pride.\n\n\"Damn bastard.\"\n\nThe student's anger boiled over. His fist shot forward. Fast. Practiced. No hesitation about connecting with flesh.\n\nYoungwoo's eyes widened.\n\n*It's slow?*\n\nCountless battles in Satisfy. High-level opponents moving at inhuman speeds. His dexterity stat translated to reality the same way it sharpened his blacksmithing. These untrained students telegraphed every move.\n\nYoungwoo's head slipped sideways. The fist whistled past his ear.\n\n\"What? He dodged?\"\n\nDisbelief twisted the student's face. He flicked his cigarette away and launched a kick. Korean citizenship came with mandatory Taekwondo lessons. His kick carried more power and speed than his punch.\n\n*Concentrate strength in the thighs and glutes. Your upper body acceleration increases proportionally.*\n\nPiaro's teaching surfaced unbidden. Youngwoo's upper body dropped. The kick sailed over his head, connecting with nothing but air. Something primal stirred as the wind of the attack brushed his hair.\n\n*Not just the limbs. Engage the throat muscles. Concentrate mass at the sword's terminus.*\n\nSword? He'd swung it thousands of times. Muscle control? Piaro had drilled it into him until it became instinct. Youngwoo visualized his fingertips as a blade. Struck upward.\n\n**Crack!**\n\n\"...!\"\n\nThe student had no defense against the rising strike. Youngwoo's hand drove into his chin. He collapsed without a sound.\n\n\"...Huh?\"\n\n\"W-What?\"\n\nThe remaining students stood frozen. Youngwoo was more shocked than any of them.\n\n*I won?*\n\nFirst time. First time in his life he'd struck another person. And he'd dropped him. Before, he'd only run or bled.\n\n*Thud-thud. Thud-thud.*\n\nHis heart hammered at the alien sensation. The other three students recovered and charged.\n\n\"You bastard!\"\n\nOne flew at him, technique abandoned for aggression. Youngwoo's mind stayed clear.\n\n*Sloppy.*\n\nThe kick's trajectory was predictable. Two steps back. Arm raised.\n\n**Smack!**\n\nHis hand caught the student's ankle mid-flight.\n\n\"Ugh...!\"\n\nCork Island. Flying there non-stop to mine fire stones. That had been Youngwoo's introduction to physical limits. The addictive burn of pushed muscles. He'd chased that feeling in reality. Morning jogs with Sehee. Weekend mountain hikes. Weight training whenever possible.\n\nThree months of consistency. His body wasn't the soft, neglected thing it once was. These students, marinated in alcohol and tobacco, had no foundation to match him.\n\n\"I-It hurts...\"\n\nThe struck student trembled. It felt like being hit with a steel pipe. Natural. Youngwoo moved with the principles of a legendary swordsman. Ordinary people couldn't withstand that.\n\n\"T-This...!\"\n\nInternet rumors painted Youngwoo as a perpetual punching bag. But he could actually *fight*? The last two students wavered.\n\nYoungwoo, meanwhile, marveled at his own capability. He wanted more. To test this newfound strength.\n\n\"What? Not coming?\"\n\nHe crooked a finger. Beckoning. The remaining students snapped.\n\n\"What's with that cocky attitude!?\"\n\n**Thwack! Thud!**\n\nThe brawl erupted. Fists and feet flew wildly at Youngwoo from two directions. No martial artist could dodge simultaneous attacks from multiple angles.\n\nYoungwoo responded with footwork lifted from Pagma's Swordsmanship. Like water flowing around stones, he slipped between their strikes. \n\nThe grace lasted only moments. His body wasn't trained enough to maintain this level. His health was average. Civilian-grade. Reproducing legendary techniques indefinitely was impossible. Eventually, his foot landed wrong. Ankle twisted. Balance shattered.\n\n\"Haha! This moron's done!\"\n\nThey swarmed him. Fists pounded his guard. Kicks found his ribs.\n\n\"Ugh! Keh!\"\n\n**Bam. Bam. Bam.**\n\nStars exploded across his vision. But through the pain, he registered one critical fact.\n\nSehee and Yerim were free.\n\n\"Run!\"\n\nHe swallowed the urge to shout about calling police. They'd figure it out. He trusted that much.\n\nThen—\n\n\"That's enough.\"\n\nUnlike Sehee, who was frozen and panicking, Yerim moved. She jumped, light as a dancer. Youngwoo caught a flash of white, smooth legs extending from beneath her short skirt. Her heel drove into the nearest student's spine.\n\n**Crack!**\n\nDespite the restrictive clothing, Yerim's kick landed with surgical precision. Both students' eyes rolled back.\n\n\"Cough...\"\n\n\"Ugh!\"\n\nThey dropped like puppets with cut strings.\n\n*What? Why is she that strong?*\n\nYerim extended a hand to the stunned Youngwoo.\n\n\"Can you stand? My prince.\"\n\nThe streetlight haloed her. She looked older than her years. Mature. Her half-moon eyes held a magnetism that could ensnare anyone.\n\nBut she was a minor. Youngwoo's brain refused to go there.\n\n***\n\n\"What? 3rd dan Taekwondo?\" Youngwoo's voice echoed outside the convenience store. \"Then why were you just *watching*? That's cruel.\"\n\nSehee and Yerim pressed cold eggs against the bruises blooming across Youngwoo's face. To passersby, he looked like a manhwa protagonist surrounded by beautiful girls. Some harem fantasy made flesh.\n\nYoungwoo ignored the stares. He was too busy complaining.\n\n\"If Yerim fought from the start, I wouldn't look like this.\" Sehee dabbed gently at a cut on his eyebrow.\n\n\"It's rude to interfere in a fight between men.\" Yerim's tone was matter-of-fact. \"I endured.\"\n\n\"That wasn't a fight between men. It was one against four.\"\n\n\"Hihi, it was still impressive.\"\n\nYoungwoo was strong. For a normal person. Not truly powerful, but his courage to protect his sister deserved recognition. Today, Yerim's feelings intensified tenfold. She genuinely wanted to marry him.\n\n\"Ugh...\" Youngwoo tried standing from the plastic chair. \"Let's head back. And you're both banned from capsule rooms. I'll buy you personal capsules. Okay? Deal?\"\n\nHis muscles screamed from exertion and accumulated damage. He swayed. Yerim caught him, her arms wrapping around his torso.\n\n\"Haah.\" A strange sound escaped her lips. Youngwoo's fingers had brushed from her underarm to her waist during the catch.\n\n\"W-What?\"\n\nSurprise flooded Youngwoo's face. Yerim's cheeks flushed. Her eyes grew misty.\n\n\"...You're really an incredible person.\"\n\nSehee missed the subtext. Youngwoo understood perfectly. His throat cleared, embarrassment rising.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}