{
  "id": 225,
  "title": "Chapter 225",
  "content": "# Chapter 225\n\n\"Finally! Finally level 300!\"\n\nToban's voice echoed across the training grounds. Four months had passed since the Overgeared Guild moved to Reidan. Four months of hunting monsters that could tear a man in half. Toban was the last member of the former Tzedakah Guild to hit the milestone.\n\nLauel adjusted his glasses. \"There will be a cataclysm in the unified rankings.\"\n\nGrid frowned. \"Cataclysm?\"\n\n\"The top seven have held their positions like iron,\" Lauel said. \"But most of the top forty? Overgeared members.\"\n\nGrid shrugged. \"Why is that a cataclysm? It isn't anything special.\"\n\n*It is rather strange that no one has entered the top seven, despite the items I made.*\n\nThe Tzedakah Guild members had all been ranked in the top fifty before. Their average ranking had only climbed by ten spots. Grid failed to see what the fuss was about.\n\nBut the world was watching. The top one hundred rankings didn't fluctuate easily. The growth rate of the Overgeared members was unprecedented. Media companies around the globe asked the same question: *What secrets are hidden in Reidan that allow them to grow so quickly?*\n\n『 The reporters have failed to enter the west. 』\n\n『 In the western part of the Eternal Kingdom, there are monsters that have never been seen before. Experts speculate that only a party of at least level 280 users or rankers can enter... 』\n\n『 It seems like the Overgeared members are raising their level quickly by hunting the powerful monsters in the west. 』\n\n『 Um... The monsters in the west will be a double-edged sword to the Overgeared Guild. The level up speed of the Overgeared members has risen exponentially, but there are few users who can move to Reidan due to the high entry barriers. 』\n\n『 That's right. Reidan's speed of development will be slow. Duke Grid will definitely be hurt. 』\n\n***\n\nTtang! Ttang!\n\nThe sound of hammering rang through the massive smithy in Reidan. Thirty young blacksmiths, trained by Khan, worked the forges in shifts. They produced supplies the city needed. Weapons. Armor. Tools.\n\nGrid wiped sweat from his brow. *I'm tired.*\n\nDespite the increased manpower, he was still buried in work. The Overgeared members had reached their third advancement classes. Now they wanted more powerful items. Commissions piled up like corpses after a siege.\n\n*But this damn hammering will be over soon.*\n\nFive commissions left. After those, Grid would be free.\n\n*Let's plan for the future.*\n\nThree challenges dominated his thoughts. First, complete the class quest. Second, recover all the pavranium. Third, complete Piaro's quest. As for his work as a lord? Lauel and Rabbit handled that. Those two could run a kingdom in their sleep.\n\nGrid set down his hammer. \"You over there.\"\n\nA soldier guarding the smithy entrance stiffened.\n\n\"Did you call?\" The soldier ran over, spine rigid with discipline.\n\n*The great duke called me!*\n\nThe man's eyes shone with barely contained excitement.\n\nGrid jerked his chin toward the door. \"Bring Minor here.\"\n\n\"Yes!\"\n\n***\n\nThirty minutes later, a boy slouched into the smithy. His expression suggested he'd rather be anywhere else.\n\n\"Oh, what do you want?\"\n\nMinor. Despite possessing the talents of a great miner, he'd been fostered as a 'minerals detector' because of his <span class=\"rarity-legendary\">Minerals Master (S+)</span> skill.\n\nGrid crossed his arms. \"I will give you an escort to search for the presence of the golem's labyrinths here in the west.\"\n\n\"It isn't an escort, but surveillance.\" Minor's tone was flat.\n\n\"Someday, I will give you freedom if you swear true allegiance to me.\"\n\nMinor tilted his head. \"Well, I do acknowledge you these days. You're a commoner who became a duke. But I'm still wondering if a genius like me should devote the rest of my life to you.\"\n\nThe boy possessed <span class=\"rarity-legendary\">Talent will Reveal Itself (SS)</span>. His talent would always be visible to others. He was destined to receive temptations his entire life. Arrogant. Quick to betray. His loyalty was a coin flip at best.\n\n\"Is it lacking to be the subordinate of a duke?\" Grid asked.\n\n\"Indeed. At a minimum, shouldn't it be a king?\"\n\n\"Hoh...\" Grid's lips curled. \"You should remember that.\"\n\n*I will become a king. And when I do, you'll be mine.*\n\nGrid waved his hand. \"Go now.\"\n\n\"Yes, yes.\"\n\nMinor's answer was insincere, but Grid knew the boy would work properly. That SS-ranked skill wouldn't let him slack off.\n\n*If searching for pavranium in the west is resolved...*\n\nThe only things left were the class quest and Piaro's revenge quest. But the class quest was impossible right now. No way in hell could Grid get God Yatan to bless the pavranium.\n\n*Even Yura doesn't know where the First Servant of the Yatan Church is... First, I should resolve Piaro's grudge.*\n\nAsmophel. The cause of Piaro's heart sickness. If Grid defeated the former vice-captain of the Red Knights, Piaro could be freed from his chains.\n\n*Once he is in perfect condition, he might become my subordinate...*\n\nGrid returned to the anvil, hope warming his chest.\n\n***\n\nFive items later, Grid completed the guild commissions. He stretched, joints popping, then activated **Legendary Blacksmith's Creation**.\n\n> **[Legendary Blacksmith's Creation Skill]**\n>\n> You can create three equipment item production methods every time the skill level of the 'Legendary Blacksmith's Craftsmanship Skill' goes up.\n>\n> Number of items that can be created at present: 12/15.\n>\n> * When items are produced using this skill, the name of the creator is automatically placed on the item.\n\nThe familiar notification windows emerged.\n\n> [What item do you want to create?]\n\n\"Heavy boots.\"\n\n> [Have you decided on 'Heavy Boots?']\n\n\"Yes.\"\n\n> [What materials would you like to use?]\n\nGrid rubbed his chin. *I shouldn't use only high grade minerals like black iron, mithril and blue orichalcum. The reason I want heavy boots is for weight.*\n\nPiaro's advice echoed in his mind. The heavier the shoes, the greater the power of the greatsword.\n\n\"The main material will be steel. I will mix blue orichalcum into it to add strength and hardness, and to make it exert more power in dark places.\" Grid paused. \"Ah, I have to make the color darker by mixing in black iron so that it will harmonize with my armor.\"\n\n> [Have you decided?]\n\n\"Yes.\"\n\n> [Please design the item.]\n\nGrid was smarter now. More skillful. Over the past four months, he'd made more than six hundred items. His dexterity stat exceeded three thousand points. He drew the shape of the boots on the blank blueprint with steady hands.\n\nBig. Black. Rising to just below the knees. A rustic beauty.\n\n\"It's done.\"\n\n> [Have you decided? When you complete the blueprint, the number of available creation skill will decrease by one.]\n\nGrid clicked the button. The system corrected the shape, perfecting the lines.\n\n> [Please describe the characteristics of the item.]\n\n\"Heavy and solid boots. Thanks to the nature of blue orichalcum, the defense will increase in dark places.\"\n\nSimple. Accurate. The system calculated performance and options based on his description.\n\n> [Finally, please decide the name of the item.]\n\nFrom now on, all his items would bear his name. Grid's voice carried pride. \"Grid's Boots.\"\n\n> [Have you decided on 'Grid's Boots?']\n\n\"Yes.\"\n\n*I will aim to complete a set item based on these boots.*\n\nEvery piece would carry the Grid name. A legend in the making.\n\n> [A new item, <span class=\"rarity-epic\">'Grid's Boots'</span> have been created.]\n\nThe item window materialized:\n\n> **[Grid's Boots]**\n>\n> Rating: <span class=\"rarity-epic\">Epic</span> ~ <span class=\"rarity-legendary\">Legendary</span>\n>\n> **<span class=\"rarity-epic\">Epic</span> Rating Information:**\n>\n> Durability: 335/335 Defense: 324\n>\n> Movement Speed: -12%\n>\n> Evasion Rate: -14%\n>\n> * Increases defense by 10% against attacks from the bottom.\n> * When using a dashing skill, there is a 30% chance of failure.\n> * Defense will increase by 10% in dark places.\n>\n> **Unique Rating Information:**\n>\n> Durability: 401/401 Defense: 388\n>\n> Movement Speed: -10%\n>\n> Evasion Rate: -12%\n>\n> * Increases defense by 12% against attacks from the bottom.\n> * When using a dashing skill, there is a 25% chance of failure.\n> * Defense will increase by 15% in dark places.\n>\n> **<span class=\"rarity-legendary\">Legendary</span> Rating Information:**\n>\n> Durability: 496/496 Defense: 470\n>\n> Movement Speed: -8%\n>\n> Evasion Rate: -10%\n>\n> * Increases defense by 15% against attacks from the bottom.\n> * When using a dashing skill, there is a 20% chance of failure.\n> * Defense will increase by 20% in dark places.\n>\n> An item designed by a legendary blacksmith. Designed with a perfect combination of steel, black iron and blue orichalcum, it boasts overwhelming defense. However, there are many disadvantages to its function because it is only focused on defense.\n>\n> In particular, it is too heavy, so movement is restricted.\n>\n> **User Restriction:** Level 320 or higher. More than 1,450 strength. More than 1,200 stamina. Advanced Heavy Armor Mastery Level 5 or higher.\n>\n> Weight: 2,930\n\nGrid studied the stats. The effectiveness was low compared to <span class=\"rarity-legendary\">Braham's Boots</span>. These were tanker boots, not for damage dealers who relied on charging techniques. But the defense was nearly twice as strong as comparable armor. Unusually high for footwear.\n\n*This is perfect for me.*\n\nGrid didn't have an evasive fighting style. He favored swinging the sword. It wasn't just control. It was the nature of the greatsword itself. Besides, Grid had no charging skills.\n\n*The boots won't have any negative effect on me, except for a reduction in movement speed. These boots will also suit Vantner and Toban.*\n\nGrid smiled at the finished creation. One day, both he and the Overgeared members would be armed with a complete Grid set.\n\nHe lifted his hammer again.\n\nTtang! Ttang!\n\nAcross the smithy, thirty young blacksmiths and Khan watched. They studied every movement. Every angle of the hammer. Every adjustment to the forge temperature.\n\nThe future was bright.\n\n***\n\nA year had passed since the fall of Pope Drevigo.\n\nThe question consumed the Rebecca Church: who would become the new pope? Numerous senior priests ran as candidates. Most were good priests with a sense of mission to lead seventy million people to the path of light.\n\nBut a small number wanted the position to satisfy individual needs.\n\nPascal of the Judar Church was very ambitious.\n\nHe paced his chambers. \"What if I became the master of seventy million people? The momentum of our family will pierce the sky and Father will surely become a duke.\"\n\nPascal's father was an earl of the Saharan Empire. Originally Pascal was a viscount, but he'd joined the church and become the leader of the Judar Church. Now he looked toward a higher place.\n\nAn ally spoke from the shadows. \"I understand. Pascal, I will help you become the pope.\"\n\nThe largest religion on the continent teetered on the edge. If Pascal succeeded, seventy million followers of Goddess Rebecca's teachings would become a political tool of the empire.\n\n***\n\n\"Isabel!\"\n\nDamian's voice cracked. The first unique hidden class user trembled with sorrow. Isabel's life was draining away after the unsealing of Lifael's Spear. Her health bar dropped with each passing second.\n\n*No. No. No.*\n\nHe reached for her, desperate to stop what he couldn't control."
}