{
  "id": 226,
  "title": "Chapter 226",
  "content": "# Chapter 226\n\nWhite Transformation was the technique of borrowing the goddess' power stored in the three divine artifacts of the Rebecca Church. It granted strength beyond mortal limits. The cost was brutal.\n\nRebecca's Daughters avoided White Transformation whenever possible. When they had no choice, they kept it brief. Isabel had been trapped in the state for a year.\n\nGrid had unsealed Lifael's Spear. Her life force drained away, drop by drop.\n\n\"Cough! Cough!\"\n\nIsabel's platinum hair had turned the color of ash. Her eyes, once luminous, now stared vacant as a corpse. Her cheeks were pale where they should have flushed with health. Even dying, she was beautiful.\n\n*Right now she is only 18 years old.*\n\nShe would die at this age.\n\nDamian looked at her out of habit. Tears burned down his face. \"How many times have I told you? Lifael's Spear must be sealed! Then why...\" His voice cracked. \"Why won't you listen to me? Isabel, are the orders so important? More than your life?\"\n\n\"Cough! Cough!\"\n\nIsabel lay in bed without answering. She stared through the window at the distant sky. Her hearing had failed long ago. She couldn't hear Damian's voice, even as he shouted beside her.\n\n\"Isabel...\"\n\nDamian's handsome face twisted into something ugly. Tears and snot streaked his cheeks. Someone laughed at the sight.\n\n\"Why are you empathizing with tools?\"\n\nPascal. He entered Isabel's room without knocking. Damian trembled.\n\n\"You...!\" Damian's hands clenched into fists. \"How many times have I warned you not to call them tools?\"\n\nDamian hated Pascal.\n\nThe 5th Pope Franz had felt a moment of compassion and sealed the divine artifacts of the church, leading to the church's weakening. Pascal used this as his argument to keep Lifael's Spear unsealed.\n\nPascal had spoken those words.\n\nPascal shrugged. \"Rebecca's Daughters are fostered to serve this church in exchange for their lives. Don't waste your sympathy thinking about individual worth. Consider what is needed to preserve the church. You're only damaging yourself.\"\n\nAs Franz's descendant, Pascal respected the 5th Pope. But he couldn't understand all of Franz's policies. From the beginning, weren't Rebecca's Daughters raised as tools? Sealing the power of the divine artifacts just because they couldn't endure it?\n\nPreposterous. An ignorant mistake. Pascal and most of the senior priests of the Rebecca Church thought this way. They planned to contact Pagma's Descendant so he could release the seals of the two remaining artifacts as soon as possible.\n\nDamian couldn't tolerate it.\n\n\"I will never accept it.\"\n\nRebecca's paladins were much weaker than the Judar and Dominion paladins. It wasn't a popular class. Damian walked this path to the end without giving up because of Rebecca's Daughters.\n\nIsabel. Rin. Luna. Damian wanted these three girls to be happy. He wished for them to smile forever. He couldn't stand watching them suffer.\n\n\"They are people like us. They've worked harder for this church than anyone else. To disparage them and call them mere tools...\" Damian's divine power flared. \"Goddess Rebecca won't forgive it.\"\n\n\"You dare mention Goddess Rebecca?\" Pascal's lip curled. \"You're deceived by beautiful faces and lost control. Stupid.\"\n\nPascal laughed at Damian. It was similar to those who ridiculed Damian in reality for running a fan site of Rebecca's Daughters.\n\nDamian couldn't understand them. \"Why do you have to ridicule someone's love and respect?\"\n\n\"The problem is that the target is a tool, not a person.\"\n\n\"Isn't this just like people in reality saying that Rebecca's Daughters are NPCs, not humans?\"\n\n\"Reality? NPC?\" Pascal frowned. \"I can't understand the language you're using.\"\n\n\"Shut up!\"\n\n\"...\"\n\nPascal was the former leader of the Judar Church and a pope candidate. He possessed mighty divine power. Only Rebecca's Daughters in the church held greater divine power than him.\n\nHowever, at this moment—\n\n\"They are people too! They rejoice! They're impressed! Angry! Sad! They're the same as us! Not tools or NPCs! Don't compare them to such things!\"\n\nThe divine power radiating from Damian was threatening. It was a threat to Pascal, who was likely to become the pope after Drevigo.\n\n*This is the power of the Goddess' Agent.*\n\nPascal had always ignored Damian, who usually chased after Rebecca's Daughters. He had laughed when he heard some priests talk about making Damian pope. Now he was wary.\n\nDamian glared at him. \"I will change everything! I will root out all the rotten people, including you, who treat Rebecca's Daughters as sub-human! For Isabel! For Rin! And for Luna!\"\n\nDamian accepted the quest he'd been avoiding.\n\n\"I will become the pope!\"\n\n> [The quest 'Become the Pope' has been accepted.]\n>\n> **[Become the Pope]**\n>\n> Difficulty Level: **SS**\n>\n> It has been one year since the death of 13th Pope Drevigo.\n>\n> The Rebecca Church has barely recovered from the confusion and is now preparing to elect a new pope. However, Pascal is now the most powerful pope candidate and he plans to use the Rebecca Church as a political tool.\n>\n> As the agent of the goddess, you have an obligation to guide the Rebecca Church to the right path and to stop Pascal's ambitions. Your power, beliefs and willpower will play a major role in defeating irrational violence and calming political strife.\n>\n> After your crowning, you can never disobey Goddess Rebecca.\n>\n> The faithful church members will cheer for you.\n>\n> Quest Clear Conditions: In three months, become the pope in the pope's election.\n>\n> Quest Clear Rewards: Second class 'Pope' will be obtained. 'Goddess Rebecca's Armor,' 'Goddess Rebecca's Helmet,' and 'Goddess Rebecca's Gloves' will be acquired.\n>\n> Quest Failure: Pascal will become the pope. The Rebecca Church will decline even worse than the days of Drevigo.\n\n\"You will become the pope?\"\n\nPascal was angry. He'd already bought more than half of the votes. This declaration had no foundation to succeed.\n\n\"Well, good.\" Pascal composed himself. \"As the Goddess' Agent, you are qualified to be a pope candidate. I respect you.\"\n\nThump thump.\n\nPascal nodded before heading over to Isabel's bed. Isabel looked at him. He gave her an order.\n\n\"A Yatan Temple was found in Kent Village on the outskirts of the empire. Show them the divine power of the spear. Ah, can you hear me? This is the command. Read this and act accordingly.\"\n\nThe user of Lifael's Spear always had White Transformation triggered. Naturally, the work had to be done fast, so the elders assigned Isabel more duties than the other two Rebecca's Daughters. Isabel's life energy depleted more quickly as a result. The elders didn't care. They were already preparing substitutes in large quantities.\n\n\"I will go.\" Damian intercepted the command. \"I will take on all the duties that she will perform in the future.\"\n\nPascal shook his head. \"Didn't I say it before? Are you making fun of the elders' commands? As you know, the pope's seat is currently empty so they are working on his behalf. Violating their orders is like going against the pope...\"\n\n\"I am the Goddess' Agent.\" Damian cut him off. \"As you said, the elders aren't the pope.\"\n\n\"...\"\n\n\"I don't want to hear anymore about the elders' orders. Only the true pope and Goddess Rebecca can command me.\"\n\nDamian's words sounded good, but he had a weak base. The senior priests didn't treat Damian as important and ignored his opinions. Now Damian made his position clear. Pascal couldn't help feeling dumbfounded.\n\n\"Hrmm...\"\n\nPascal paused to think.\n\n*If this guy is busy on the battlefield, he will be less likely to win the pope's election held in three months.*\n\nDamian wasn't competition in the first place. Still, it would be wise to clear the path.\n\nPascal nodded. \"Go ahead. But I doubt that you will be able to perform the difficult missions with your abilities.\"\n\n\"I am strong.\"\n\nHe had a unique hidden class. Damian was different from the past. He was no longer the extra who just watched while Grid fought Drevigo. Damian was also a protagonist.\n\n\"Kukuk, good. Prepare your heart. If you become tired and fall down, Isabel will take on the missions again.\"\n\nPascal left the room. Damian cursed him and planned for the future.\n\n*The mission is in the east of the empire. It is relatively close to the western part of the Eternal Kingdom.* \n\nReidan was located in the west of the Eternal Kingdom. \n\n*I will stop by to meet him.*\n\nThe person who went against Pope Drevigo and saved Rebecca's Daughters. He helped Damian become the Goddess' Agent. Also—\n\n*The only one who can seal Lifael's Spear.*\n\nPagma's Descendant, Grid. He was the only person Damian could rely on.\n\n\"Damian...\"\n\nIsabel called out to Damian as he turned to leave. Damian took a deep breath. His expression that was distorted with rage gradually softened to a smile.\n\n\"I am going, Isabel. Please stay well.\"\n\nDamian said goodbye to her with a smile.\n\n***\n\n> [The experience of (Witness of God's Weapon) **Legendary Blacksmith's Craftsmanship Skill Lv. 5** has increased by **19%**.]\n>\n> [A unique rated item was produced, increasing all stats by **+4**.]\n>\n> [Reputation throughout the continent will rise by **+150**.]\n>\n> [You currently have **25,110** reputation throughout the continent. You can use the Reputation Store when your reputation reaches over **30,000**.]\n\n\"It's good.\"\n\nGrid was very satisfied as he checked the result."
}