{
  "id": 227,
  "title": "Chapter 227",
  "content": "# Chapter 227\n\n> **[Grid's Boots]**\n> \n> Rating: <span class=\"rarity-unique\">Unique</span>\n> \n> Durability: 477/477 Defense: 483\n> \n> Movement Speed: -10%\n> \n> Evasion Rate: -7%\n> \n> * Increases defense by 12% against attacks from the bottom.\n> * When using a dashing skill, there is a 25% chance of failure.\n> * Defense will increase by 15% in dark places.\n> \n> Weight: 1,930\n\nGrid stared at the notification window. His shoulders sagged in relief.\n\n\"Good. Good.\" He rubbed his face. \"It wasn't an epic rating.\"\n\nOver the past four months, he'd cranked out more than 630 items. Hammering, smelting, tempering until his hands cramped. Not a single legendary item in all that time. But five unique pieces? He'd take it. He'd take it and run.\n\n*Five uniques out of 630 items. That's... actually lucky. Ridiculously lucky.* He flexed his fingers. *And honestly? I don't want to make any more legendary items. Not if I can help it.*\n\nThe count sat at eight legendary items since becoming Pagma's Descendant. Two more and some 'special event' would trigger. The system loved its milestones, and Grid had learned to dread them. Better to stick with unique rated gear. Safer.\n\n*Besides, unique items aren't that much worse than legendary ones. Not really.*\n\nFootsteps approached from behind. Grid turned as the thirty young blacksmiths surrounded him, their eyes fixed on the boots still resting on the anvil. One of them, a lanky kid with soot on his cheek, leaned in close.\n\n\"Duke Grid!\" The kid's voice cracked with excitement. \"This is a work of art!\"\n\nAnother pushed forward. \"The degree of completion...\" He shook his head. \"I can't even describe it.\"\n\nA third circled the boots like a predator studying prey. \"Such elegance hidden inside a primitive design.\" He touched the leather reverently. \"It truly is high quality!\"\n\nGrid watched them fawn over the boots. They had no idea what made the piece good. They couldn't. Inferior blacksmiths lacked the eye to parse a legendary craftsman's work. They just felt the weight of it, the presence. But that was fine. Their potential stretched far beyond their current abilities.\n\n*I searched through 20,000 people in Reidan for these thirty.* Grid crossed his arms. *Khan's been teaching them the fundamentals. Between my eye and his... we don't miss talent.*\n\nThe ability to spot quality in people worked the same as spotting quality in ore. You looked. You tested. You measured.\n\n*At least eight of them will hit advanced blacksmith tier. I'll use them as the core to train more.*\n\nThey would've become advanced blacksmiths eventually, even in another city. But here, with Grid's Blacksmith's Affection skill? The progression was guaranteed. Not hope. Certainty.\n\n> **[Blacksmith's Affection]**\n> \n> The NPC blacksmith's maximum skill level increases by 1~5.\n> \n> Any blacksmith who receives your teachings will remain loyal for life and share all new production methods they discover.\n\n*Anyway.* Grid glanced at the boots. *Next comes enhancement.*\n\nHis passive skill increased the odds of successful enhancement. He'd pushed <span class=\"rarity-rare\">Dainsleif</span> to **+8** and <span class=\"rarity-legendary\">Failure</span> to **+9**. With enough stones and luck, these boots could reach **+8** as well.\n\n*I want to use the full Grid set for a long time. Worth investing in enhancement now.*\n\nExcept enhancement stones cost money. Real money. Current market price sat at 180 gold for general stones, 2,500 gold for blessed versions. Based on past attempts and probability, getting one piece of equipment to **+8** would burn through at least 500,000 gold.\n\n*Damn it.* Grid clenched his jaw. *Why do the prices keep climbing? Used to be 100 gold for regular stones, 1,200 for blessed ones.*\n\nUser levels had risen across the board. Higher level players spent more time grinding the same tier, which meant they needed better gear to progress. Enhanced gear. Demand spiked, prices followed. Supply wouldn't increase unless S.A. Group boosted drop rates, and they wouldn't do that because of inflation concerns, and...\n\nGrid's head hurt. Economics. He hated economics.\n\n\"Huh?\"\n\nThe thirty blacksmiths had gone quiet. Grid looked up. Their earlier enthusiasm had curdled into something else. Disappointment? Shame? They hunched over their workbenches, tools slack in their hands.\n\n\"What's wrong?\" Grid moved closer.\n\nThe lanky kid spoke first. \"Lauel ordered us to produce boots and gauntlets for the soldiers.\" He set down his hammer. \"We've been working hard, but...\"\n\nAnother apprentice gestured at Grid's boots on the anvil. \"After seeing your work, the boots and gauntlets we make feel insignificant.\"\n\nThe predatory one from earlier stepped forward. \"We know we can't match Duke Grid's level. But...\" He hesitated. \"Could you teach us? So we can at least mimic the technique?\"\n\nGrid's stomach twisted. Khan had already taught them the boot production method. But they wanted Grid instead. He glanced toward the old blacksmith.\n\nKhan smiled. No bitterness. No jealousy. Just acceptance.\n\n\"I don't mind.\" Khan wiped his hands on his apron. \"Their desire to learn from you is very natural.\"\n\nA legendary blacksmith existed on a different plane than an advanced one. Khan knew it. Lived it. Grid saw the understanding in the old man's eyes and nodded.\n\n\"All right.\" Grid grabbed four pieces of iron ore from the material pile. \"Watch carefully. I'll only demonstrate once.\"\n\n\"Yes!\" The apprentices crowded closer, jostling for position.\n\n*I can receive the teachings of the great Duke Grid!*\n\nTheir eyes tracked Grid's every movement. He began smelting the ore, adding brief explanations as he worked. Temperature control here. Hammer angle there. The rhythm of the forge, the song of metal on metal.\n\nThen the notifications came.\n\n> [The experience of <span class=\"rarity-legendary\">Legendary Blacksmith's Breath</span> Skill Lv. 4 has increased by 9%.]\n\n> [The experience of **(Witness of God's Weapon) Legendary Blacksmith's Craftsmanship** Skill Lv. 5 has increased by 19%.]\n\n> [A <span class=\"rarity-legendary\">legendary rated item</span> has been produced! All stats will permanently rise by **+10**.]\n\n> [Reputation throughout the continent will rise by **+500**.]\n\nGrid stared at the steel boots cooling on the anvil. Level 80. <span class=\"rarity-legendary\">Legendary rating</span>. Perfect craftsmanship.\n\n\"...\" His eye twitched.\n\n\"Incredible!\" The lanky apprentice picked up the boots with shaking hands. \"You made something this amazing so easily!\"\n\n\"Duke Grid truly is a legend!\" Another clapped his hands.\n\n\"The technique, the precision...\" The predatory one shook his head in awe.\n\n\"Damn it.\" Grid's voice came out flat.\n\nThe apprentices fell silent. Grid walked past them, through the smithy doors, out into the street. One more legendary item. Just one more until the special event triggered. If those boots had been for his personal Grid set, maybe he could stomach it. But a soldier's equipment? Wasted on a <span class=\"rarity-legendary\">legendary rating</span>?\n\n\"Goddamn it.\"\n\n***\n\nGrid trudged through Reidan's streets. Each step felt like dragging his feet through mud. His shoulders slumped. His head hung low. He looked like a man who'd lost everything.\n\nResidents stopped to stare. Whispers followed in his wake.\n\n\"Duke Grid looks... troubled.\"\n\n\"He's always so proud and confident. What could cause this?\"\n\n\"Maybe a crisis is approaching Reidan?\"\n\n\"A monster invasion?\" Fear crept into the woman's voice. \"A large one?\"\n\nThe rumors spread. Reidan's security rating, carefully maintained by Jude and the soldiers' constant patrols, began to plummet. Jude cornered Lauel in a panic an hour later, demanding to know what catastrophe loomed. The Overgeared members scrambled to contain the damage.\n\nGrid remained oblivious to all of it.\n\n***\n\nGrid stood in Reidan Castle's warehouse, scanning the mostly empty shelves. According to Piaro, Asmophel's escorts possessed serious combat power. Grid needed every advantage. Which meant enhanced gear. Which meant enhancement stones.\n\n*Please let there be stones in here. Please.*\n\nHe found minerals. Sylphid scales shipped from Bairan by Jishuka. Miscellaneous crafting materials. No enhancement stones.\n\n\"I'll have to buy them.\" Grid checked his inventory. Twenty thousand gold. Money from selling monster drops during his journey back to Reidan. The 5.5 million gold from the golem invasion? Five million went into guild funds. The remaining 500,000 he'd converted to real currency for his building purchase.\n\nTwenty thousand gold. Not nearly enough.\n\n*With this much, I can maybe get to +5 if I'm lucky. Maybe.*\n\nGrid left the guild warehouse and headed for his private storage. He threw open the doors, hope flickering in his chest. That hope died instantly. The space stretched empty except for dust and cobwebs. A few months ago, he'd liquidated nearly everything to buy land and construct his building in Seoul.\n\n\"Shit.\"\n\nHe was a duke. The ruler of a major city. Why was he always broke?\n\n*Reidan's such a poor territory. I should've asked for a different—*\n\nGrid froze. His gaze locked on something wedged in the corner, half-hidden behind a support beam. A glass bottle the size of his pinky finger. Golden liquid sloshed inside.\n\n*That might be worth something.*\n\nHe picked it up, turning it over in his hands.\n\n> **[Goddess' Essence]**\n> \n> Weight: 0.1\n\nA drop from the Pope Drevigo raid. Even his Legendary Blacksmith's Appraisal skill offered no details. No description, no value, no hint at its purpose. Grid had shoved it in storage and forgotten about it.\n\n*But Drevigo dropped the Holy Light Battle Gear set. The strongest armor in the game.* Grid clutched the bottle. *This essence has to be valuable too. It has to be.*\n\nVague hope. No evidence. Pure speculation. But what choice did he have? He needed to know the item's worth, which meant he needed an expert. Someone with deep knowledge of rare goods and their values.\n\nRabbit.\n\n*He's handled more merchandise than anyone in Reidan. If anyone can identify this, it's him.*\n\nGrid pocketed the bottle and headed for Rabbit's office at a jog.\n\n***\n\nMountains of documents covered every surface of Rabbit's workspace. Reports on trade routes, production quotas, tax collection, supply requisitions. The administrator sat behind his desk, reading glasses perched on his nose, quill scratching across parchment.\n\nGrid burst through the door. \"I need you to appraise something.\"\n\nRabbit set down his quill. Grid placed the bottle on the desk between them. The golden liquid caught the lamplight, seeming to glow from within. Rabbit picked it up. Held it to the light. Shook it gently. Set it down. Picked it up again. Repeated the process twice more.\n\nThen he pushed it back toward Grid.\n\n\"I don't know.\"\n\nGrid's heart sank. \"What?\"\n\n\"I don't know,\" Rabbit repeated. He removed his glasses and rubbed his eyes. \"There's something you can't grasp with your insight?\"\n\n\"I know it contains liquid imbued with Goddess Rebecca's divine power.\" Rabbit tapped the bottle. \"But the specific effect? The application? I have no idea.\"\n\n\"Can I sell it?\" Grid leaned forward. \"Even without knowing the details?\"\n\nRabbit's calm demeanor cracked. He raised his voice. \"Be cautious!\"\n\nGrid flinched back.\n\n\"This liquid contains Goddess Rebecca's divine power.\" Rabbit pushed the bottle firmly into Grid's hands. \"You will regret it someday if you sell it now. Treasure it. Keep it safe.\"\n\n\"I need money.\" Grid's voice came out plaintive. \"Fast.\"\n\n\"For what purpose?\"\n\n\"Enhancement stones.\"\n\n\"Enhancement stones.\" Rabbit sighed and stood. He moved to the wall where a massive map hung, showing the western region of the Eternal Kingdom. The Overgeared members had spent the past four months exploring and charting every detail. Rabbit traced a finger along one section.\n\n---\n\n**Current schedule: 20 chapters per week.**"
}