{
  "id": 228,
  "title": "Chapter 228",
  "content": "# Chapter 228\n\nGrid stared at the map spread across the table. Everything looked tiny. Reidan, marked dead center, was barely the size of a 500 won coin.\n\n*A large city that can hold 430,000 people, and it's the size of a coin.* He pressed his thumb against the spot. *The west is massive.*\n\nThe Eternal Kingdom sprawled across four regions: east, west, north, and south. But they weren't equal. The west was the largest by far, followed by the north, then the east and south. This entire vast territory had withered into desert. If he could destroy the giant worms and reclaim the land...\n\nGrid leaned back. He already held significant power in the north. Controlling the west would cement a position nobody could challenge.\n\n\"Look here.\" Rabbit tapped a blue line snaking through the parchment. The Hebend River cut directly through Reidan. \"The villages and cities cluster along the southern basin.\"\n\nWere there survivors? Grid didn't care.\n\n\"Why?\"\n\nRabbit blinked. \"Pardon?\"\n\n\"Why the south side?\" Grid crossed his arms. \"Why are you asking me this?\"\n\n*How should I know?*\n\nA few months ago, he would've said it out loud. Now, he bit his tongue and actually tried to think. His brain creaked like a rusted hinge.\n\n\"Umm...\" He scratched his jaw. \"Water?\"\n\nPeople needed water. Simple answer.\n\nWrong answer.\n\nRabbit shook his head. \"The northern basin has water too. The population concentrated on the south because of something else. Something that drew them there.\"\n\n\"What?\"\n\n\"Mines.\" Rabbit traced the small mountain range marked on the map. \"The geography makes it possible. Iron, silver, gold.\"\n\n\"Mines?\" Grid straightened. Any resource meant money. Money meant Reidan grew stronger. \"That's good, but why bring this up now? Just handle it with Lauel. I asked about enhancement stones. How did we jump to mines?\"\n\n*Classic.* Rabbit's whiskers twitched. *He really doesn't care about administration.*\n\nSome would call Grid irresponsible. Rabbit disagreed. Grid recognized his own weaknesses and delegated to capable people. That took wisdom most lords lacked.\n\n*The duke spent four months locked in his smithy. He's a blacksmith and warrior, not a politician. Better this way.*\n\nRabbit had served under Valmont, who'd been too stupid and greedy to trust anyone. Grid was the opposite.\n\n\"The Overgeared members explored the southern basin,\" Rabbit continued. \"They confirmed the mines exist. But a boss monster drove them back. They marked it as a danger zone.\"\n\n\"Which members?\"\n\n\"All of them.\"\n\n\"What?\" Grid's eyes widened. The Overgeared Guild ranked in the top 40. Every member was a monster. If they'd worked together and still retreated... \"Is it Hell Gao tier?\"\n\nEven Grid had barely survived Hell Gao, and only after stealing two fire stones to weaken it first.\n\n*The current Overgeared members are way stronger than they were then.*\n\nRegas had been the first to reach third advancement. He'd picked Asura, a fighting demon class that fit his brutal style perfectly. Then he'd marched straight to Grid and demanded a rematch for the PVP finals.\n\nGrid won. Barely.\n\n*I almost burned my invincible passive.*\n\nThat was after his training with Piaro, too. Third advancement Regas hit like a freight train. The other members had grown just as much. Yet something in the western desert made them run?\n\nGrid whistled low. \"Must be a nightmare.\"\n\n\"So?\" He drummed his fingers on the table. \"What's this got to do with enhancement stones?\"\n\n\"Did you hear why I invested over half the guild funds into alchemy facilities?\"\n\n\"Lauel mentioned it. Alchemy's amazing, right? Buff potions, special item options.\"\n\n\"Alchemy can do much more. But most cities refuse to invest.\" Rabbit's nose wrinkled. \"Even the wealthiest capitals hesitate. Kingdom treasuries won't touch it.\"\n\n\"Why not?\"\n\n\"Uncertainty.\"\n\nAlchemy results were random. The success rates were abysmal. Even max-level alchemy facilities only managed 70% success on buff potions and under 30% on item enchantments. Worse, the materials cost a fortune.\n\nBottom line: alchemy was a money pit.\n\nGrid's face darkened. \"Wait. That's complete garbage.\"\n\n2,937,000 gold. Nearly three million of their five million guild fund, dumped into alchemy.\n\n*This bastard's trying to bankrupt me!*\n\nRabbit saw the murder in Grid's eyes. \"I plan to make Reidan the second Talima.\"\n\n\"Talima?\" Grid paused. \"The dwarf city?\"\n\n\"Correct.\"\n\nTalima, the city of heaven. Every shop sold equipment comparable to unique-rated gear. Even their trash was treasure. People across the continent dreamed of shopping there. None could. Talima sat in the dragon Trauka's territory, a death sentence for any human foolish enough to approach.\n\n\"What if Reidan matched Talima's quality?\"\n\nGrid saw it immediately. People would flood in from every corner of the continent. Rabbit's strategy clicked into place: train blacksmiths, invest in alchemy, create a monopoly.\n\n\"Alchemy makes items produced by you and your smiths shine brighter. Reidan is the only city worth this investment.\"\n\n\"Hrmm...\" The economics made sense. The vision was solid. Grid wanted that future. But. \"Alchemy's success rate is trash. Can we afford it? What if our luck runs dry and we go bankrupt instead of becoming the second Talima?\"\n\n\"Remember Administrator Arik?\"\n\n\"Arik?\" Grid searched his memory. \"The fat administrator before I took over?\" That guy had been a riot. \"He's in prison, right? What about him?\"\n\n\"Lauel kept him alive to extract information about the west. I learned something valuable.\"\n\n\"What?\"\n\n\"Somewhere in the west, there's a yellow mithril mine.\"\n\n\"Yellow mithril?\"\n\nThis was Rabbit's ace.\n\n\"Yellow mithril creates fairy dust. Fairy dust dramatically increases alchemy success rates. I believe the southern basin hides that mine.\"\n\n\"Oh...\" Grid's pulse quickened. Reidan's future blazed bright in his mind.\n\n\"...So what about the enhancement stones?\"\n\nHe'd reached his limit. Rabbit cut to the point.\n\n\"Alchemy can produce enhancement stones.\"\n\nGrid's jaw dropped. He'd assumed only boss monsters dropped them.\n\n\"Normally, it's not worth trying. The success rate is too low. But with fairy dust, the math changes completely.\"\n\nEverything clicked.\n\n\"So you need me to secure the mine.\"\n\n\"Exactly.\"\n\n\"Okay.\" Grid stood. No reason to refuse. The Overgeared members couldn't handle the boss, but adding his and Noe's power shifted the equation.\n\n\"I'll leave now.\"\n\nOnce Grid decided, he moved. He summoned the Overgeared members immediately. They gathered in the courtyard, buzzing with excitement.\n\n\"First time raiding with Grid since the golem invasion,\" Pon said, spinning his spear.\n\n\"We'll crush that monster with Grid here.\" Vantner grinned.\n\nGrid looked them over. \"What type of monster? Demonkin?\"\n\n\"No.\" Pon shook his head. \"Doppelganger.\"\n\n\"Doppelganger?\" Grid frowned. Doppelgangers copied their target's form and abilities. Troublesome, sure, but... \"Even if it copies one of us, we outnumber it. Can't you just surround and kill it?\"\n\nPon grimaced. \"It doesn't copy us. It transforms into someone much stronger.\"\n\nVantner jumped in. \"Incredibly strong. Slim build, handsome face, moves fast with a greatsword as big as Dainsleif.\"\n\nRegas nodded. \"The way it handles the greatsword reminds me of you, Grid.\"\n\nFaker added, \"Basic movements match yours. But the sword techniques are several times better.\"\n\n\"Hrmm...\" Grid's curiosity spiked. The strongest members of Overgeared, praising an enemy's skill?\n\n*I'll see for myself soon enough.*\n\nThe members finished their preparations. Grid raised his voice. \"Move out. Jude, you stay and protect Reidan with the soldiers.\"\n\n\"Yes...\" Jude's shoulders slumped.\n\n\"I will accompany you.\"\n\nThe continent's strongest swordsman stepped forward. Piaro looked completely different. Clean-shaven, wearing fresh clothes, radiating presence. Nothing like the beggar from four months ago.\n\n\"Please lend us your strength.\" Grid welcomed him.\n\nThe Overgeared members exchanged confused glances.\n\n*Why bring a farmer to a raid?*\n\nFarmers had zero combat value. What role could a farmer possibly play? They belonged in fields, not boss fights. Lauel opened his mouth, then closed it.\n\n*Wait. Piaro's a feng shui expert, right?*\n\nGrid must be planning to use Piaro's talents to identify valuable land after they cleared the area.\n\n*Impressive. He's thinking strategically now.*\n\nLauel marveled at Grid's growth. He seemed like a completely different person.\n\n---\n\n**Glossary of Common Korean Terms**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week  \n\nCheck out my Patreon for early access to unedited chapters and goals for extra chapters. Early access updates after daily releases finish."
}