{
  "id": 229,
  "title": "Chapter 229",
  "content": "# Chapter 229\n\nThe National Competition, the golem invasion. Grid had proven himself the strongest. But two months had passed in the real world since then.\n\nWas he still the strongest?\n\nA broadcast studio in Seoul buzzed with the same question. Three analysts sat behind a curved desk, their screens flickering with combat footage.\n\n\"I don't think so.\" The first analyst, a former pro-gamer with graying temples, leaned forward.\n\n\"What's your basis?\" The host gestured at the display. Stats scrolled past in green columns.\n\n\"Third advancement classes operate on a completely different dimension than second advancement.\" The analyst tapped his tablet. \"The performance gap is massive. Most of the top fifty rankers have reached their third advancement. Duke Grid, who lacks refined control, is no longer unique.\"\n\n\"I agree.\" A younger analyst nodded. \"Grid overpowered rankers in the National Competition through his items and class. But he's lost the class advantage now.\"\n\nThe host raised an eyebrow. \"What if Grid overcomes his control deficiencies?\"\n\n\"Haha!\" The first analyst laughed, sharp and dismissive. \"From a professional standpoint, Duke Grid has no talent for control. His only advantage is his items.\"\n\n\"And that advantage will be offset by the fantastic control of other ranked players.\"\n\nAs information about third advancement classes spread across forums and streams, the experts sharpened their knives. Pagma's Descendant wasn't a combat-specialized class, after all. The analysts were convinced that third advancement rankers would demonstrate skills far beyond Grid's capabilities.\n\nAt the Second National Competition in Paris, nine months from now, Grid wouldn't dominate.\n\n\"Ah, Grid's fans, please don't misunderstand.\" The older analyst raised his palms. \"I'm not disrespecting the man himself. He's a capable leader who absorbed the Tzedakah Guild. He has talented people like Huroi, Lauel, Euphemina, and Ruby supporting him.\"\n\n\"I also acknowledge Duke Grid's blacksmithing skills.\" The younger analyst straightened his papers. \"However, we're analyzing his combat ability. We have to be objective.\"\n\nIn truth, Satisfy's experts nursed a grudge. Their predictions during the National Competition had been spectacularly wrong. They'd been embarrassed in front of millions.\n\n*It would be nice if Grid's era ends quickly.*\n\n*I don't want to discuss Grid anymore. My credibility takes a hit every time I'm wrong about him.*\n\nWould their wishes come true?\n\n***\n\n\"Sura Charge!\"\n\n*Pepepepeong!*\n\nRegas blurred forward. After converting to Asura, his combat power had doubled from his martial artist days. Punches and kicks shifted trajectories mid-strike. The enemy couldn't track him. Lightning and dark skills chained together seamlessly.\n\nFour giant worms surrounded him. He dominated them.\n\nGrid watched from atop a nearby dune. *He's stronger than when I won our duel. Has he completely adapted to his new class?*\n\n\"Nobody will call Regas a Taekwon Master now.\" Lauel stood beside Grid, shading his eyes. \"Soon, they'll call him a war god.\"\n\n\"Yes.\"\n\nAs Grid and Lauel watched, a spear knight mounted on a camel charged forward.\n\n*Puk! Puk puk!*\n\n*Rumble!*\n\n*Kiyack!*\n\nPon's spear blazed. A spear knight's attack power increased dramatically when mounted. The spectacle was devastating. Even the western monsters, notorious for their resilience, couldn't cope with his blows.\n\nBut killing them in one strike? That was impossible. Unless you were Grid.\n\nPon soon faced five giant worms. They reared up, mandibles clicking.\n\n\"Gatling Spear.\"\n\n*Pepeng! Pepepepepeng!*\n\nThe sonic spear moved multiple times in a fan-like arc. Flesh tore. Ichor sprayed. The five giant worms became shredded meat before transforming into light.\n\n*Great.* Grid's jaw tightened. Gatling Spear exerted power comparable to Pagma's Swordsmanship, Kill. Unlike the single-target Kill, it covered a wide area.\n\n*I have higher stats than Pon. Failure's performance exceeds his weapon by a significant margin.* Grid flexed his fingers. *But the difference in passive skills is too great.*\n\nCombat classes all possessed Weapons Mastery passives, which directly increased attack power. Grid relied exclusively on Pagma's Swordsmanship. His limitation was clear.\n\nHe pulled up the skill information.\n\n> **[Pagma's Swordsmanship Lv. 2 (89.9%)]**\n> \n> **When the skill is deactivated:**\n> You can become one with the sword at any time. Increases physical attack by **30%**, critical hit rate by **20%**, and critical damage by **10%**.\n> * This effect is only applied when a sword type weapon is equipped.\n> * The skill consumes no mana.\n> \n> **When the skill is activated:**\n> Become one with the sword. Wave, Restraint, Link, Kill, Transcend, Transcended Link, and Linked Kill. You can unleash a total of seven sword techniques.\n> * The effect of the deactivated skill will be lost.\n> * **20 mana** is required to activate the skill.\n> * Once deactivated, it will take **10 seconds** until the skill can be activated again. Nothing will be consumed when deactivated.\n\nThe fatal weakness stared back at him. The passive effect disappeared the moment he activated a sword dance. That 30% attack power increase, 20% critical hit rate boost, 10% critical damage enhancement? None of it applied to skills like Kill or Link.\n\n*The passive only affects base damage.* Grid dismissed the window. *This is the limit of Pagma's Descendant.*\n\nBut Grid wasn't worried. Confidence flooded his chest.\n\n*Right now, Regas and Pon might seem comparable to me. But that's temporary. The gap will widen again the moment I reach level 300.*\n\nThere was an old gaming axiom. Levels were bullies. That saying held true in Satisfy.\n\nTen stat points arrived with every level. Users grew stronger as their stats increased. Not just from better items or stronger skills, but from the unique function of stats themselves.\n\nThe **Strength** stat, for example. At level 200, each point granted 0.3 attack power, 7 health points, and a weight limit increase of 40. At level 300, each point granted 0.4 attack power, 9 health points, and a weight limit increase of 50.\n\nStats effectiveness increased every hundred levels. They called it Third Stats Awakening.\n\nGrid was level 275. The sum of his stats already exceeded those of his level 300 Overgeared members. Looking at total stat distribution, Grid's effective level approached 380.\n\nHe'd gone through minus levels. Obtained special titles. Produced countless items. What would happen when Grid reached level 300 and received the third stats awakening?\n\n*The difference between our passive skills only applies for now.*\n\nGrid's power source was his overwhelming stats. He understood this better than anyone. He didn't need to be nervous about others' growth.\n\n*If I complete the Grid set, then...*\n\nHe would be the strongest.\n\n\"Huhuhu...\"\n\n*Why all of a sudden?* Lauel turned. Grid's smile made him shiver. It was like encountering a demonkin.\n\n\"My Lord!\" Huroi's shout cut through the air. \"Seven basilisks! Eight hundred meters south!\"\n\nThe Overgeared members tensed.\n\n\"Seven basilisks?\"\n\n\"We should bypass them.\"\n\nThe western monsters' respawn rate was unusually fast. If a battle lasted too long in one location, they'd be surrounded. The basilisk ranked among the strongest monsters in the west. Fighting seven at once spelled crisis.\n\n\"There's a small mountain to the west.\" Lauel pointed. \"It might delay our journey, but we can avoid the monsters.\"\n\n\"I don't want to.\" Grid grabbed <span class=\"rarity-legendary\">Failure</span>. \"I haven't hunted in 131 days. I'll use this opportunity to increase my experience.\"\n\nThe desert was harsh terrain. Every step sank into sand, severely limiting movement. The Overgeared members were combat experts. They'd adapted to the desert. But Grid?\n\nThe Overgeared members exchanged worried glances. Grid's stiff movements, his lack of combat sense. It was impossible for him to exert full power in the desert. They'd planned to clear any monsters encountered on the journey to spare him.\n\nBut what was the truth?\n\n*Jebeok jebeok.*\n\nGrid was armed with heavy boots. He walked across the desert like it was a plains area. He even sped up and ran.\n\nPiaro's thorough education showed.\n\n\"Huh...?\"\n\n\"What's gotten into Grid...?\"\n\nThe Overgeared members doubted their eyes.\n\n*Kiyaaak!*\n\nA basilisk noticed the human running toward it. Its mouth opened. The light of petrification flashed, the same light that dealt devastating damage. The skill was hard to respond to. The light's range was wide. Its speed was extreme.\n\nThe Overgeared members were certain Grid would suffer. He lacked control skills. He always got hit by monsters. This time would be the same.\n\nHowever.\n\n\"Have I only fought you once or twice?\"\n\nGrid had traveled from Patrian to Reidan. Piaro had trained him. He'd killed numerous basilisks. He already knew this pattern.\n\nHe accurately estimated the flash's timing and fired Pagma's Swordsmanship, Wave to offset it. He approached the slowed basilisk, activated Blacksmith's Rage, and stabbed the creature's weak eyes.\n\n*Kiyaaaaaah!*\n\nThe basilisk writhed. Six other basilisks surrounded Grid and swung their tails.\n\n\"My Lord!\"\n\n\"Grid!\"\n\nThe Overgeared members paled. If six basilisks attacked simultaneously, Grid would definitely die.\n\nBut Grid was already in the rear. He dodged four tails flying from the front. He defended against the others using pavranium.\n\n*Jjeejeeeong!*\n\n*Kieek?*\n\nThe basilisks recoiled. Golden blades had blocked their attacks. Confusion rippled through them. Danger. They saw it in the black eyes of the human visible through gaps in the golden blades. Those eyes looked at them like prey.\n\nOne of the desert's top predators, reduced to prey? This human was dangerous. The basilisks were instinctively engulfed in fear.\n\n\"First one.\"\n\nGrid stepped forward toward the basilisk he'd attacked initially.\n\n*Teong!*\n\nThe heavy weight of Grid's boots made the desert sand explode loose. His greatsword, empowered beyond its previous state, struck the basilisk's wounded eyes. This wasn't the end. Grid evaded the basilisk's subsequent counterattack and triggered Pagma's Swordsmanship.\n\nThe sword followed his evasive movements.\n\n\"Kill.\"\n\n*Peeeeeong!*\n\nThe blue greatsword, reminiscent of an ocean predator, penetrated the basilisk's skull.\n\n*Kuwaaah!*\n\nOne of the seven basilisks instantly transformed into gray light.\n\nThe Overgeared members couldn't close their mouths.\n\n\"Is that Grid?\"\n\nThe control skills Grid demonstrated weren't particularly outstanding. Anyone who played the game could show such movements. But this was Grid. He'd been mocked by everyone for poor control. This person who lacked talent had acquired the skills.\n\nHe'd overcome his own weakness.\n\n*Has Grid been working where we couldn't see him?*\n\n*How much effort did he put in?*\n\n*This is truly my lord! I'm proud!*\n\n\"No, aren't you going to help me? Aaaaack!\"\n\n\"...\"\n\nWhile the Overgeared members felt moved, Grid was becoming bloody from the other six basilisks. The party window showed his health gauge dropping exponentially. The Overgeared members panicked and hurried to save him.\n\nPiaro observed Grid's battle from beginning to end. He clicked his tongue.\n\n\"Really. There are no signs of improvement.\"\n\nVantner heard Piaro's voice. He shook his head.\n\n*This farmer isn't sane either.*\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and to help achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}