{
  "id": 230,
  "title": "Chapter 230",
  "content": "# Chapter 230\n\n\"My Lord! There are 15 cacti in a cluster 400 meters ahead! It is presumed to be mine cacti in disguise, so pay special attention...\"\n\n\"Advance and destroy them!\"\n\n\"My Lord! Two golden toads in the oasis are mating! It is wiser to bypass them...\"\n\n\"Two field bosses appeared at the same time?\" Grid's eyes lit up. \"This is a jackpot! Charge!\"\n\n\"My Lord! Dozens of desert toads are chasing us 800 meters to the rear! We have to speed up or they will catch us...!\"\n\nGrid turned in his saddle. \"Do they want revenge for the golden toads? Okay! Stop! We will meet the prey who are willingly coming to us!\"\n\n\"My Lord... There is a small nest of giant worms below the mountain...\"\n\n\"Go in and sweep them up!\"\n\nHuroi fell silent.\n\nFrom his drake high above, Huroi could grasp the terrain in advance and discover enemies before they became threats. If Grid depended on those scouting abilities, they could minimize clashes with monsters until reaching their destination.\n\nBut who was Grid? A man starved for combat after weeks of administration work. The monsters of the west were destined for destruction. Every time Huroi discovered an enemy, Grid rushed toward it rather than around it. The Overgeared members grew more exhausted with each battle.\n\n\"Pant... pant! Damn, doesn't Grid ever get tired?\"\n\n\"I feel it every time, but his stamina is much higher than we think.\"\n\n\"Uhh... It's unbearably hot.\"\n\nMarching through the desert pushed even top rankers to their limits. The repeated battles combined with the oppressive heat depleted their stamina at an alarming rate. Grid, however, seemed fine. His stamina was twice as high as the Overgeared members' thanks to the Persistence stat he'd raised through years of manual labor and blacksmith work.\n\n*No matter how strong the monsters in the west are, field bosses have obvious limits.*\n\nField bosses were weaker than quest bosses or dungeon bosses, and their item drop rate was also low. Grid and the Overgeared members had hunted one large cactus and two golden toads, but only obtained two epic items and five enhancement stones.\n\nDisappointment gnawed at Grid's chest.\n\n\"River!\"\n\n\"We've finally arrived!\"\n\nThe group reached the Hebend River. Only ten hours from Reidan. If they'd fully exploited Huroi's scouting ability, they could have arrived within three hours. Instead, Grid had made their journey at least three times longer.\n\nPon wiped sweat from his brow. \"Grid, all the guild members are tired. It's late at night. Why don't we take a break?\"\n\nGrid checked the status of the Overgeared members. Their stamina bars hovered in the red zone.\n\n\"I understand. Get ready to camp.\"\n\nStamina recovery was slow outdoors. Meals and simple rest weren't sufficient. A short nap would be better. The Overgeared members gathered near the river and pulled tents from their inventories. They paused when Grid began setting up his own.\n\n\"Wow, isn't this great? It is the first time I've seen someone build a tent as quickly as Grid.\"\n\n\"Has he set up a lot of tents in reality? Does he go camping often?\"\n\n*What camping...*\n\nGrid didn't have any friends to go camping with. His tent-building skill was good because he'd been thoroughly trained in the army. With over 3,000 dexterity points, he could set up a tent several times faster than ordinary users.\n\nWere there any advantages to building a tent quickly? No. It wouldn't be helpful in reality unless he had a lover to go on a camping trip with.\n\nGrid hammered in the final stake. \"Let's eat.\"\n\nOnce the tents were complete, the Overgeared members sat around a crackling fire. The food they prepared was common: rainbow potatoes, the only food currently grown in Reidan.\n\nVantner poked at his portion. \"I'm sick of eating this for every meal.\"\n\n\"I agree.\"\n\nThe rainbow potato had seven flavors. The red portion tasted like meat, the yellow like fried shrimp, the orange like tangerine sauce, and so on. Soft, strong, delicious flavors. But in the end, it was just a potato. Eating it for every meal had grown tiresome.\n\n\"It would be nice if we had a good chef.\"\n\nA chef with high cooking skills could make food using wild grasses and monsters. The dishes would give small buffs. Very useful.\n\n*Euphemina can duplicate the cooking skill...*\n\nEuphemina wasn't included in this raid. Currently, she was making great contributions to Reidan's security and internal affairs by duplicating skills like monster taming, blacksmithing, alchemy, building, and more. Relying on her for cooking as well was too much. Grid shook his head.\n\n*We can't always depend on Euphemina.*\n\nShe might leave the guild. There was a limit to relying on only one person. Grid decided it was better to recruit users with various secondary classes like chefs.\n\n\"Now my eyes are tired.\"\n\n\"What should we do?\"\n\nThe guild members finished their meal. Grid rose from his spot and proclaimed, \"Leave the lookout position to me. Everybody should get a good sleep.\"\n\nGrid had matured. Now he was sacrificing himself for his colleagues. But the Overgeared members refused.\n\n\"Grid is the core power of this raid group. You can't overdo it.\"\n\n\"Don't worry. I'm still okay because I have a lot of stamina.\"\n\nPon crossed his arms. \"It isn't enough just to be okay. You have to be well prepared. The opponent is strong.\"\n\nIn the end, Grid was excluded from guard duty. The members started to consult among themselves. The scheduled break was four hours. During that time, eight people should stand guard in intervals of 30 minutes.\n\n\"The eight people with the highest stamina stat will have to sacrifice 30 minutes.\"\n\nEvery time.\n\nThe higher the stamina stat, the higher the maximum stamina and the quicker the recovery speed. Therefore, guard positions were always taken by tankers. Vantner and Toban groaned.\n\n\"I'm tired of being a tanker all day long...\"\n\n\"A tanker is a sinner.\"\n\nIt might be reasonable, but the tankers couldn't help complaining. Lauel watched them and made a wise suggestion.\n\n\"Why doesn't Piaro stand guard?\"\n\nOn the way here, Piaro hadn't taken part in any battles. He'd just walked. Lauel guessed that Piaro still had plenty of stamina left.\n\n*A legendary farmer should have high basic stats... A four-hour guard shift shouldn't be a huge burden to him.*\n\nPiaro nodded readily at Lauel's suggestion. \"I understand. Leave it to me and get a good night's sleep.\"\n\n\"Ohh!\"\n\nThe faces of the Overgeared members brightened. They didn't know why Piaro had joined this raid, but they were delighted he was here. However, some people showed negative reactions.\n\n\"This is a danger zone. We shouldn't leave the guard position to a farmer.\"\n\n\"That's right. What if monsters hide in the fog at dawn and attack? A farmer wouldn't be able to detect the attack of a monster. We'll be vulnerable to danger.\"\n\n*They don't know the honor it is to have a great swordsman standing guard...*\n\nGrid found this situation hilarious. How long would they mistake Piaro for a farmer? Knowing the truth made it interesting to watch. He smiled and settled the situation. \"You shouldn't doubt Piaro's ability to be a lookout. Don't you know that he is a legendary farmer, not an ordinary farmer?\"\n\n\"...?\"\n\nThe Overgeared members looked confused.\n\n\"Why should a legendary farmer be good at being a lookout?\"\n\n\"Explain it so that we can understand.\"\n\n\"...\"\n\nGrid felt stress because the members asked for clarification. It was impossible to give a convincing explanation since it was just a thoughtless remark.\n\nAt that moment, Lauel made a guess. \"Farmers have to protect their fields from ice, beasts, and monsters. A legendary farmer should have an excellent ability to defend his fields, meaning that his ability to sense beasts and monsters is sharp. This is the reason why Grid told us to trust the legendary farmer.\"\n\nGrid seized the lifeline. \"That's right.\"\n\nThe Overgeared members with negative reactions started to understand.\n\n\"I see... Farmers have this ability...\"\n\n\"Okay then. Piaro, please work hard for four hours. It is a request.\"\n\nThe Overgeared members entered their tents. Pon was the last one to enter. He spoke to Piaro.\n\n\"There is a huge monster that lives in Hebend River. It's extremely powerful, unlike the golden toads that we hunted during the day. If it emerges, let us know without any delay.\"\n\n\"Yes.\"\n\nPon ducked into his tent. Piaro sat alone in front of the campfire and recalled the past.\n\n*It reminds me of my days as a knight.*\n\nDuring his time in the Red Knights, they'd gone on many expeditions and set up campsites. At that time, he'd been with his colleagues. But due to Asmophel's false accusation, they were all dead.\n\n*Tadak. Tak.*\n\nPiaro was organizing branches for the campfire when he suddenly shifted his gaze to the river. Early dawn. Something moved silently in the fog. It was hard to detect even for the most skilled person. But who was Piaro? It was extremely rare that anything could succeed in an ambush against a great swordsman.\n\n\"You are the monster of Hebend River.\"\n\nPiaro threw the branch he was holding into the river. Something let out a sharp scream as the branch struck true.\n\nOn this day, the top predator of the Hebend River for the last decade met its end.\n\n***\n\n\"Okay, perfect.\"\n\nGrid and the Overgeared members slept for four hours and recovered enough stamina. They ate rainbow potatoes and moved straight to their destination. They finally reached the edge of the mountains after passing through large and small ghost villages.\n\nGrid and the Overgeared members no longer encountered monsters. Grid puzzled over the bamboo forest that stretched along the mountain path.\n\n\"How was this forest preserved without being turned into a desert? Is this place safe from the giant worms?\"\n\nLauel explained. \"The doppelganger here blocks the path of monsters as well as humans. Thanks to it, this forest and the mine in the mountains behind it are safely preserved.\"\n\n\"Hrmm...\"\n\nIt was a strange phenomenon where a monster defended the land from another monster. Grid felt great interest as he stepped into the bamboo forest.\n\n> **[You have entered the mysterious forest.]**\n\n> **[Your mind has become calm.]**\n\n> **[You will be helpless in the midst of this tranquility.]**\n\n> **[You have resisted.]**\n\n\"Ugh...! This feeling is so disgusting.\"\n\n\"I just want to sleep.\"\n\nWith the exception of Grid, the Overgeared members were overcome by the helpless feeling. Their bodies became limp and pained expressions crossed their faces. Grid kept moving forward.\n\nHe stopped cold.\n\n\"...Pagma?\"\n\nAt the center of the forest where bamboo soared into the sky, one man sat on a flat rock. He had an egg-shaped face on a slender body. White skin and red lips. His long eyes smiled even at rest. He gave off such a beautiful and neat impression that it was hard to believe he was a man. He looked exactly like Pagma, who Grid had seen depicted on the murals at Loran Falls.\n\n*Suuk.*\n\nPagma sat quietly on the rock, then slowly moved. The silk clothes that seemed to come from the Joseon Era flapped as he shifted his gaze toward Grid. The look in those eyes contained outright hostility.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**\n\n**Current schedule: 20 chapters a week.**\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}