{
  "id": 231,
  "title": "Chapter 231",
  "content": "# Chapter 231\n\nThe moment Grid locked eyes with Pagma, his body seized up.\n\n*Thump. Thump. Thump.*\n\nHis heart hammered against his ribs. Sweat broke out across his skin, cold and sudden. His hands trembled. This wasn't just tension. This wasn't nerves.\n\nThis was fear.\n\n*What the hell?* Grid's thoughts raced. *Is this killing intent? No. It's something else.*\n\nHe knew what it was. Instinct. Pagma was the source of everything he had. Every skill, every technique, every scrap of power he'd clawed his way to. Standing before that presence, even a copy of it, made him feel like an ant before a mountain.\n\nGrid clenched his jaw. *Get a grip. This isn't Pagma. It's just a doppelganger. Don't fall for it.*\n\nHe forced himself to look up. The name floating above the figure's head read 'Doppelganger of the Mysterious Forest,' not Pagma. Grid stared at it until the words burned into his mind. Slowly, his breathing steadied.\n\n*This is still going to suck.*\n\nWho could have predicted this? The raid boss was Pagma's doppelganger. Looking back, the descriptions from the Overgeared members matched Pagma's appearance. But Pagma had died over a century ago. How could a doppelganger copy someone from that far back?\n\nThe staring contest dragged on. Grid's eyes held confusion, doubt, a dozen conflicting emotions. The doppelganger's gaze held only one thing.\n\nHostility.\n\nThe doppelganger moved first. A casual swing of his jade greatsword.\n\n*Clang!*\n\nGrid blocked with <span class=\"rarity-legendary\">Failure</span>. The impact traveled up his arms like a freight train.\n\n\"Shit!\" Grid bit out.\n\nThe attack power was insane. Comparable to Hell Gao at full strength.\n\nGrid twisted his head toward Lauel. \"A doppelganger copies appearance, right? But can it copy abilities too?\"\n\nLauel shook his head, his expression tight. \"There are limits. It can't fully replicate someone stronger than itself.\"\n\nThat meant this thing wasn't as strong as Pagma, the greatest swordsman after Muller. The doppelganger was incomplete.\n\n*Crack. Crack. Crack.*\n\n\"You've got to be kidding me.\"\n\nBottom. Side. Top. The doppelganger's greatsword became a blur, each strike separated by fractions of a second. Grid stumbled backward, his guard breaking.\n\n> **[The durability of <span class=\"rarity-legendary\">+9 Failure</span> has decreased by 3.]**\n\n> **[The durability of <span class=\"rarity-legendary\">+9 Failure</span> has decreased by 8.]**\n\n*What the hell is that weapon?*\n\nNothing had ever chewed through Failure's durability this fast. If Failure was taking this much damage, that meant the doppelganger's sword was dealing double.\n\n\"Lauel!\" Grid shouted. \"What about copying items?\"\n\n\"Doppelgangers are made of flexible material,\" Lauel called back. \"They can reproduce hair, skin, even blood. Depending on strength, they can create items comparable to orichalcum. Most reproductions perform better than the original.\"\n\n*Better than the original.*\n\nGrid's stomach dropped. This wasn't even the real Pagma's work. It was a copy of a legendary blacksmith's weapon. And it was still destroying him.\n\n*I've been working for two years. And I can't even match a fake?*\n\n*Clang! Clang!*\n\nGrid's strikes grew sluggish. His agitation made him sloppy. The doppelganger's blade stayed sharp, mechanical, emotionless.\n\n*Thunk.*\n\nPain flared across Grid's shoulder. Blood seeped through his armor, staining the metal red. The momentum of the fight tilted hard.\n\nAgainst him.\n\n\"We need to help Grid!\" one of the Overgeared members hissed.\n\nThe others shifted nervously. They wanted to move. But the oppressive aura of helplessness rooted them in place. Their fingers wouldn't twitch unless their survival instincts kicked in.\n\n\"We'll have to wait until the doppelganger attacks us,\" someone muttered.\n\n\"Wait. Look at that swordsmanship,\" another voice cut in. \"Doesn't it look familiar?\"\n\n\"You're right. Now that they're side by side, the styles are identical.\"\n\n\"It can't be...\"\n\nRealization dawned on the Overgeared members' faces. The identity of the person the doppelganger had copied. But the weight of that name was too heavy to speak aloud.\n\nLauel had no such reservations. \"It's Pagma.\"\n\nSilence.\n\nPagma. One of the nine legends. The source of Grid's power. And now, through some twist of fate after the golem invasion, Grid was fighting Pagma's doppelganger.\n\n*What does this mean?*\n\n\"This raid will change Grid,\" Lauel said quietly. \"He'll gain new skills. Quests. Items. He'll grow exponentially. The king didn't make him lord of Reidan by accident. This is Satisfy's plan for Pagma's Descendant.\"\n\nLauel's tone was optimistic. The other Overgeared members nodded, hope flickering in their eyes.\n\n*Thud.*\n\nGrid's back hit bamboo. He had no more room to retreat. The forest blocked his escape. The only option left was to fight back.\n\n\"Damn it! Let's do this!\"\n\n*How long am I going to get pushed around by a copy?*\n\nGrid prepared to activate Pagma's Swordsmanship.\n\n\"Stop!\"\n\nPiaro's voice cracked like a whip. Grid froze.\n\nThe doppelganger's blade sliced through the space where Grid would have moved. If Grid had committed to the skill, the greatsword would have pierced his heart.\n\nGrid swallowed hard.\n\nPiaro stepped forward, arms crossed. \"Why aren't you calm? Watch your opponent. The difference between you isn't that great. There's no reason for this to be one-sided.\"\n\n*The difference isn't great?* Grid stared. The doppelganger's attack speed and power were double his own.\n\nPiaro's gaze was steady. \"He knows your swordsmanship. But don't you know his? If that's true, can't you adapt?\"\n\nGrid blinked.\n\nFour months ago, he wouldn't have understood. But now, after months of grinding his brain into gear, Piaro's words clicked.\n\n*That's right. His swordsmanship is based on Pagma.* Grid's eyes narrowed. *A stab uses the footwork of Kill. A slash uses Link. If I watch his feet, I can predict his next move.*\n\nGrid exhaled slowly. *Let's try this again.*\n\nThe doppelganger took two steps forward. Link's footwork. A slash. Horizontal or vertical? Right or left?\n\n*Watch his gaze. Watch his shoulders.*\n\nPiaro's teachings echoed in Grid's mind.\n\n*The right!*\n\nGrid saw it. He twisted his body, dodging the strike despite the doppelganger's doubled speed. It was clean. Precise.\n\nBehind him, the Overgeared members' eyes widened.\n\n*He took advice from the farmer and...*\n\n*He's growing in real time?*\n\n*What the hell?*\n\nAll eyes turned to Piaro. The farmer stood motionless, arms folded. Unlike the others, he showed no sign of helplessness.\n\n*Wait. Is he not just a farmer?*\n\nBefore anyone could speak, Grid moved.\n\n\"Pagma's Swordsmanship, Link!\"\n\n*Whoosh. Whoosh. Whoosh.*\n\nDozens of blue-white energy blades erupted from his sword. The doppelganger countered with the same technique.\n\n*Crash!*\n\nThe blades collided mid-air. The bamboo forest shook from the force. The Overgeared members watched, jaws slack.\n\n\"Kill!\"\n\nGrid pressed forward. The doppelganger responded in kind.\n\n*Boom!*\n\nThe collision of two Kills created an explosion. The center of the forest shattered. The rock where the doppelganger had been sitting crumbled, shards flying outward and cutting into the Overgeared members' armor.\n\nGrid grinned. \"How about this?\"\n\nHe activated a fusion skill. Something born from his own experience. The doppelganger wouldn't have this.\n\n\"Transcended Link!\"\n\nTwenty strikes. **180%** physical damage each. No time difference between them. A merciless barrage that had shredded an ancient weapon to scrap. Grid didn't doubt it would work.\n\nThe doppelganger tilted his head.\n\n\"Revolve.\"\n\n\"What?!\"\n\nThe jade sword moved in a half-moon arc. A vortex formed around the doppelganger, sucking in every blade from Transcended Link.\n\nThen the vortex reversed.\n\n*Crack. Crack. Crack. Crack. Crack. Crack. Crack. Crack!*\n\nAll twenty energy blades shot back toward Grid. A perfect counter.\n\n\"Grid!\" Jishuka screamed.\n\n\"My Lord!\" Huroi shouted.\n\nThe blades zigzagged through the bamboo, converging on Grid's position. The Overgeared members tensed, certain he was dead.\n\nPiaro appeared in front of Grid. He drew his sword.\n\n*Wham!*\n\nOne blade deflected.\n\n*Wham!*\n\nTwo more.\n\n*Wham!*\n\nThree.\n\n*Wham! Wham!*\n\nFour.\n\n*Wham! Wham! Wham!*\n\nPiaro struck down all twenty blows like a batter hitting fastballs.\n\nGrid stared. The Overgeared members stared.\n\n*He just swatted away Transcended Link like it was nothing?* Grid's mind reeled. *How strong is Piaro?*\n\n*What the hell is this farmer?*\n\nThe silence stretched. Awkward. Heavy.\n\nPiaro stepped back, gesturing toward the doppelganger. \"Fight him again. Absorb the techniques in Pagma's Swordsmanship that you don't know yet. Make them your own. Then you'll become stronger.\"\n\nPiaro had recognized the doppelganger's identity after the second exchange of blows. But he hadn't intervened. There was no value in it.\n\n*This is a perfect stepping stone for Duke Grid.*\n\nThe private lessons from the continent's greatest swordsman continued.\n\nStage two had begun.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}