{
  "id": 232,
  "title": "Chapter 232",
  "content": "# Chapter 232\n\nThe doppelganger couldn't reproduce Pagma's power. Not fully. Yet its stats matched Hell Gao, and when Pagma's Swordsmanship was sealed, Grid's complete reliance on skills left him defenseless.\n\nHe'd been destroyed in the first bout.\n\n*Fight again?*\n\nEvery muscle in Grid's body screamed against the idea. The result would be the same. Another beating. Another humiliation. Piaro could handle this bastard easily. Just let the monster farmer do his thing.\n\nGrid shook his head.\n\n*Piaro said to absorb Pagma's Swordsmanship. This is a chance to become stronger.*\n\nHe needed more power. Enough to protect what mattered. Enough to do what needed doing.\n\n\"Sigh...\"\n\nGrid sucked in a deep breath.\n\n**Kuoooh!**\n\nThe doppelganger lunged forward. The greatsword howled through the air. Grid stood five meters away, yet the jade blade seemed to stretch toward his gut like a living thing.\n\nPiaro's voice cut through the tension. \"There are limits to a greatsword. Big, dull, slow to redirect. A greatsword's stab is simple. Readable. Block it. No hidden tricks to worry about.\"\n\nThe words steadied Grid's nerves. He shifted his weight, utilizing Link's footwork. Left. Right. The doppelganger's thrust slid past.\n\n**Kudududuk!**\n\nThe jade greatsword scraped Holy Light Armor. Sparks exploded like fireworks. Beyond them, the doppelganger's perfect face remained expressionless.\n\n\"When the stab misses, there's an opening. Strike back.\"\n\nWeight. Momentum. A greatsword committed to a thrust couldn't recover quickly. The wielder would stumble, posture collapsing.\n\n\"Okay!\"\n\nGrid smiled. Failure swept upward in a vicious arc, aimed at the doppelganger's heart.\n\n**Seokeok!**\n\nThe bastard twisted. His upper body rotated with inhuman grace, and Failure passed through empty air. The motion tore open the doppelganger's shirt, revealing a sculpted torso.\n\n\"Kyaaak!\"\n\nLaella's gasp cut through the clearing. The doppelganger wore Pagma's face and body. Sleek muscle wrapped perfect bone structure. A god's creation.\n\nBut beauty didn't win fights.\n\n\"Ohhhh!\"\n\nFailure descended. Grid's boots planted deep, transferring every ounce of weight into the strike. The blade could shatter stone. Could it crack this bastard's skull?\n\n**Sukakak!**\n\nThe impact jarred Grid's arms.\n\n> **[Critical!]**\n> \n> **[You have dealt 17,790 damage to the target.]**\n\n*Not even a scratch on him.*\n\nThe doppelganger's health bar refused to budge. Then jade steel flashed toward Grid's ribs.\n\n*Ah!*\n\nCold terror spiked down his spine.\n\n**Jeeeong!**\n\nSeven golden blades intercepted the strike. They merged into a single barrier. The greatsword stopped, but the pavranium locked up from the impact.\n\nPiaro spoke again. \"A greatsword's biggest flaw is recovery time after attacking. You forgot. Allowed a counter.\"\n\n*Then what the hell should I do?*\n\n**Jjejeong! Jjang!**\n\nThe doppelganger pressed forward. An endless barrage. No time to think. The pavranium defended Grid on instinct, but each block left it frozen for crucial seconds.\n\n\"The opponent's approach is correct. You should do the same. Use the recoil from your attacks to chain more strikes.\"\n\n\"Urgh...!\"\n\nGrid needed to stop the assault. Evasion over defense. Piaro had warned him not to play around with a sword in hand. But the doppelganger's attack speed outstripped his reaction time.\n\n*Then what?*\n\nGrid's guard broke. The jade blade angled for his throat.\n\n**Teong!**\n\nPiaro's hand moved. His finger deflected the sword. Grid's life, spared again.\n\n\"Why use the golden blades only for defense? Optimize your control. Make them weapons.\" Piaro stepped back. \"Fight again.\"\n\n\"...\"\n\nThe cycle repeated.\n\nGrid listened. Adjusted. Fought. Made mistakes. Died. Piaro saved him before the final blow landed.\n\n*I'm in an arcade.* Grid thought distantly. *And the neighborhood kid keeps feeding quarters into the machine.*\n\nExcept no kid had ever been this generous.\n\n\"Against an opponent with overwhelming health, attack instead of defending. Fight again.\"\n\n\"Upward strikes fight gravity. You're weakening your own blows. Is that even viable with such a massive weapon? Fight again.\"\n\n\"Don't ignore the golden blades just because they can't kill. Make them obstruct the enemy's vision. They're worth more than extra party members if used right. Fight again.\"\n\n\"I explained why greatsword stabs are simple, yet you're obsessed with them. Only stab when you can guarantee knockback. The greatsword is built for stabbing *and* slashing. Use appropriate techniques for the situation. Fight again.\"\n\n\"Again.\"\n\n\"Fight again!\"\n\n\"Again! Again! Again!\"\n\n\"...Pant... pant...\"\n\nHow many times had he died now? They'd arrived at dawn. Now the sun blazed overhead. Grid's body was a wrung-out rag. His mind, worse.\n\nMeanwhile, the Overgeared members...\n\n\"Yum. Grid's really going through it.\"\n\n\"The strongest NPC is teaching him swordsmanship and saving his life. How is that suffering? I'd be thrilled.\"\n\n\"Thrilling, sure. But exhausting.\"\n\n\"You think continuously fighting for half a day is easy?\"\n\n\"True... If I was in Grid's position, I'd have collapsed hours ago.\"\n\nThe Overgeared members sat around a campfire, freed from the paralysis of helplessness. Rainbow potatoes sizzled and boiled. They ate and watched Grid's struggle like a sporting event.\n\nNot out of laziness. They wanted to participate. Growth through combat was their lifeblood. But Piaro's training session left no room for interference.\n\nLauel observed the distant battlefield. \"Grid's growth rate is remarkable.\"\n\nHeads nodded around the fire.\n\n\"Absurd progress.\"\n\nThe doppelganger had demolished Grid in the first match. Total domination. Grid couldn't land a single blow before nearly dying. The second bout, he struck once. Third, twice. Fourth, three times. By the fifty-first battle, Grid exchanged blows almost evenly. The way he avoided lethal strikes every time was particularly impressive.\n\n\"Grid's a blank slate. Even minor improvements show massive results.\"\n\nThe synergy between master teacher and perfect sparring partner was sculpting Grid's control in real time. What user wouldn't kill for this opportunity? Envy burned in every Overgeared heart.\n\n\"I want a mentor like that...\"\n\n\"How did Grid obtain such an incredible NPC?\"\n\n\"It's creepy that he was cosplaying as a farmer for so long.\"\n\nWhat was Piaro's identity? What circumstances led him to teach Grid? The questions deepened as the sun climbed higher.\n\n\"Sob...!\"\n\nGrid collapsed. Stamina completely gone. Meanwhile, the doppelganger stood unscathed. Half a day of combat, and the boss's health remained at ninety percent.\n\nPiaro stopped the finishing blow. He turned toward the Overgeared members. His finger extended, pointing at Regas.\n\n\"You.\"\n\n\"Huh? Me?\"\n\nRegas had been watching Grid grow with mounting frustration. He'd been shadow boxing against an imaginary doppelganger in his mind. Piaro's sudden attention stunned him.\n\nPiaro's tone allowed no argument. \"You will engage this enemy while Duke Grid recovers.\"\n\nRegas' eyes lit up. \"Are you going to train me?\"\n\nPiaro didn't deny it. \"I've observed your potential from a distance.\"\n\n\"Ohh...!\"\n\nJoy surged through Regas. An opportunity to learn from someone stronger than anyone he'd ever met. He sprinted forward.\n\nPiaro began immediately.\n\n\"Wow.\"\n\n\"What is this...? That NPC will teach anyone?\"\n\n\"Incredible! We can receive his guidance?\"\n\nThe Overgeared members buzzed with excitement. Expectations of growth filled the air. Those expectations became reality.\n\n\"Next.\"\n\nPiaro rotated through members systematically. Each sparred against Pagma's doppelganger. He dissected their techniques, pointing out strengths and weaknesses he'd observed during his time in Reidan. He intended to make them stronger.\n\nStronger subordinates made him stronger.\n\nThe great swordsman Piaro would be a tremendous fortune for Grid and the Overgeared members.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}