{
  "id": 233,
  "title": "Chapter 233",
  "content": "# Chapter 233\n\nDawn bled into the sky.\n\nThe Mysterious Forest, once pristine as an ink painting, lay in ruins. Shattered bamboo littered the earth. Scorched grass marked where flames had danced.\n\nA figure stood amid the devastation. Black hair hung past his shoulders, matted with dust. Pale skin bore countless shallow cuts. Behind him, dying embers flickered.\n\nHis gaze swept across the battlefield. \n\n*How long can I hold out?*\n\nDozens of humans sprawled across the clearing. They fell, rose, fell again. The doppelganger wanted to end them permanently, but the task proved impossible. They grew stronger with each defeat. And one human in particular, the older one with the hand plow, protected them with effortless grace.\n\n*He possesses half my original master's strength.*\n\nThe memory stirred something. Long ago, an army had marched on this forest. Before that, a horde of monsters. For over a century, he had defended these grounds from all manner of threats. But this was different. This was the first time he faced true defeat.\n\nYet panic did not come.\n\n*I must hold.*\n\nBeyond the treeline, atop the distant hill, *she* waited. The only human who had never looked at him with disgust. The only one who smiled when he wore borrowed faces. He couldn't remember the last time he'd seen her, but her warmth remained vivid. These intruders would not pass. They would not shatter her happiness.\n\nGrid stepped forward, sword raised.\n\n\"Pagma's Swordsmanship.\"\n\nThe doppelganger's eyes narrowed. *That technique.* The same style his master had used. Easy enough to counter. He knew every form, every footwork pattern.\n\nThe fake Pagma began the kata for Kill.\n\n\"...\"\n\nMid-strike, Grid's feet shifted. The angle changed. Kill became Link.\n\n\"Link!\"\n\nTwenty-two translucent blades erupted from Grid's sword. They scattered like a flock of startled birds.\n\nThe doppelganger tried to deflect them. His sword blurred through three, four, five strikes. Not enough.\n\nPain lanced through his shoulder. His thigh. His ribs.\n\nBlood sprayed across the torn earth. One-fifth of his health vanished in an instant.\n\nGrid pumped his fist in the air. \"How is it? You were tricked, right?\" He bounced on his toes, grinning like a fool. \"Pretty amazing, yeah?\"\n\nThis was Grid's eighty-third duel against the doppelganger. Somewhere between his tenth death and his twentieth, he'd learned to fake out the sword techniques. To start one form and pivot into another mid-swing.\n\nPiaro watched from the sidelines, arms crossed.\n\n\"Wonderful.\"\n\nThe word carried genuine admiration. During their journey from Patrian to Reidan, Piaro had watched Grid struggle. The man's talent had clear limits. Teaching him swordsmanship was like trying to sculpt stone with a spoon.\n\nBut now, a miracle unfolded.\n\n*The doppelganger.*\n\nIt couldn't fully replicate Pagma's power, but it was leagues beyond Grid's current ability. The perfect training dummy. With Piaro's guidance and the doppelganger's relentless pressure, Grid evolved.\n\n*My master once said: A mentor shows the student the shape of the vessel. A good opponent strips away false limits. An ideal opponent makes them forget limits exist at all.*\n\nAn ideal opponent.\n\nPiaro wanted to find one for himself. Just as Grid had found his.\n\n\"Grr...\"\n\nThe doppelganger's throat produced a sound halfway between a growl and a whimper. Killing intent rolled off him in waves. His survival instinct, stripped bare.\n\nPiaro straightened. \"From now on, the real battle begins.\" He met Grid's eyes. \"Duke Grid. I wish you the best.\"\n\nGrid nodded. \"Right.\"\n\nHe advanced. Confidence replaced the hesitation that had plagued him days ago.\n\nThe doppelganger raised his jade greatsword. His stance shifted into something new.\n\n\"Pinnacle.\"\n\n*Shit.*\n\nGrid knew this skill from the murals at Loran Falls. Unlike Link or Wave, Pinnacle was targeted. It locked onto the enemy with absolute certainty. And it ignored most armor.\n\nThe jade sword vanished.\n\n**Kwachak!**\n\nThe blade materialized inside Grid's guard, already cutting. The edge bit through the Holy Light Armor, through flesh, deep into his chest cavity.\n\n\"Kuaaaaak!\"\n\nGrid collapsed. Blood pooled beneath him.\n\nPiaro's eyes widened. *Pinnacle.* He'd only heard stories. Pagma's technique that expressed the essence of a warrior god. Even legendary adamantium armor couldn't fully withstand it.\n\n*Pagma. The more I witness your swordsmanship, the more I long to face you. Not these imitations.*\n\nA blacksmith who mastered the sword. Techniques that could cleave mountains and pierce the heavens. The second-greatest swordsman after Sword Saint Muller.\n\n*They are stronger than my current self.*\n\nRegret gnawed at Piaro's heart. Why couldn't he have been born in their era? If he'd lived under the same sky as Muller and Pagma, he could have stood as their equal.\n\nBut those titans were dead. He stood alone. Stagnant.\n\nA pale green glow erupted around Grid's body.\n\n\"Kuk... okay.\" Grid pushed himself upright. His voice was steady. \"Good thing I equipped Doran's Ring in advance.\"\n\nThe wound sealed. Flesh knitted back together. Within seconds, Grid's chest showed no trace of injury. His health bar refilled to maximum.\n\nPiaro stared. \"What...?\"\n\nEven legendary Saintesses couldn't perform instant full heals. But Grid wasn't a healer. This was pure item synergy. Doran's Ring's emergency heal, amplified by the Holy Light Armor's divine power multiplier.\n\nGrid rolled his shoulders. Bones popped.\n\n\"I can learn it too.\"\n\nPagma's Swordsmanship relied on deceptively simple footwork. Three to seven steps per technique. The forms themselves were easy to copy. But without the proper foundation, the skills refused to activate.\n\nGrid was different. He was Pagma's Descendant. The class skill allowed him to absorb the legendary techniques just by observing them. And now, with the doppelganger demonstrating the forms directly, the learning speed accelerated.\n\nGrid's boots slammed into the ground. The impact cracked stone.\n\n\"Pagma's Swordsmanship.\" His voice deepened. \"Pinnacle.\"\n\n> [You have learned a new skill.]\n> \n> **[Pinnacle Lv. 1]**\n> *A sword that expresses the essence of a warrior god.*\n> Deals 700% of your attack power to a single target. This skill will ignore 60% of the target's armor.\n> \n> **Skill Usage Conditions:** Have a sword-type weapon equipped.\n> **Skill Mana Cost:** 750\n> **Skill Cooldown Time:** 3 minutes.\n\nAn intermediate skill. Less powerful than Kill, but targeted. No wasted strikes.\n\n**Kuoooh!**\n\nFailure arced through the air in a half-moon slash. The jade blade descended toward the doppelganger's neck.\n\nThe doppelganger was ready.\n\n\"Revolve.\"\n\nPerfect timing. The vortex caught Pinnacle's energy and reversed it. The slash flew back at Grid.\n\nCould he survive another hit? Doran's Ring was still on cooldown.\n\nNo need.\n\n\"Revolve.\"\n\n> [Revolve Lv. 1]\n> *Like the eye of a storm, it is calm and powerful.*\n> It will return all attacks that hit it within 0.5 seconds of casting with 100% of the power.\n> \n> **Skill Usage Conditions:** Have a sword-type weapon equipped.\n> **Skill Mana Cost:** 2,000\n> **Skill Cooldown Time:** 2 minutes.\n\n\"...!\"\n\nThe Overgeared members, scattered around the clearing's edge, gasped. They'd been fighting the doppelganger in shifts while Grid recovered from his previous deaths. Now they watched in stunned silence.\n\nPiaro's jaw tightened. *Impossible.*\n\nGrid's control had improved dramatically over the past day. But this transcended mere improvement. Counterattacking required perfect timing. Perfect prediction. It was a technique that took years to master.\n\nYet Grid had done it. He'd read the doppelganger's intent and countered the counter.\n\n**Seokeok!**\n\n> [The <span class=\"rarity-legendary\">+9 Failure</span>'s option effect is activated, causing the skill 'Bisect' to be generated.]\n> \n> [The <span class=\"rarity-legendary\">+9 Failure</span>'s option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n> \n> [The <span class=\"rarity-legendary\">Holy Light Gloves</span>'s option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n> \n> [Critical!]\n> \n> [You have dealt 1,375,900 damage to the target.]\n\nThe doppelganger's right arm separated at the shoulder. The jade greatsword tumbled through the air, clattering against bamboo stalks.\n\nGrid's eyes sharpened.\n\n*When you seize the opening, link the attack!*\n\nPiaro's lesson from yesterday echoed in his skull.\n\n\"Ohhhhhh!\"\n\nThe doppelganger staggered, clutching his severed stump. Blood fountained between his fingers.\n\nGrid activated his ultimate skill.\n\n\"Linked Kill!\"\n\n**Kwachak!**\n\nFailure became a shark. The ancient predator that ruled Earth's oceans for 415 million years. The blade tore through the doppelganger's torso in rapid succession.\n\nOne strike! Two! Three! Four! Five! Six! Seven!\n\n> [Critical!]\n> \n> [Critical!]\n> \n> [Critical!]\n> \n> [Critical!]\n> \n> [All of your stamina has been depleted due to the maximum number of Linked Kill blows being triggered.]\n> \n> [Your stamina will fall to 0 and you can't move.]\n\n\"Ugh...\"\n\nGrid's vision grayed at the edges. He tried to stay upright. Failed. His legs gave out. He collapsed face-first into the dirt like a puppet with cut strings.\n\nNew messages flooded his UI.\n\n> [You have defeated the Doppelganger of the Mysterious Forest that has existed for 153 years.]\n> \n> [8,450,109 experience has been acquired.]\n> \n> [The party leader 'Grid' has acquired 6,300 gold.]\n> \n> [The party leader 'Grid' has acquired the <span class=\"rarity-unique\">Guardian's Necklace</span>.]\n> \n> [The party leader 'Grid' has acquired the <span class=\"rarity-unique\">Guardian's Bracelet</span>.]\n> \n> [The party leader 'Grid' has acquired the <span class=\"rarity-legendary\">Doppelganger's Greatsword</span>.]\n> \n> [The party leader 'Grid' has acquired 13 weapon enhancement stones.]\n> \n> [The party leader 'Grid' has acquired 15 armor enhancement stones.]\n> \n> [The party leader 'Grid' has acquired 4 blessed weapon enhancement stones.]\n> \n> [The party leader 'Grid' has acquired 6 blessed armor enhancement stones.]\n> \n> [Your level has risen.]\n\n\"Hah... haha...\"\n\nTwenty-three hours and twenty-one minutes. Grid had died eighty-two times. The Overgeared members had each died at least ten times. But the victory was theirs.\n\nGrid lay on the cold earth and laughed. He couldn't lift a finger. Exhaustion and euphoria mixed into something intoxicating.\n\nFootsteps pounded toward him. The guild surrounded him in seconds.\n\n\"My Lord! Amazing!\"\n\n\"Grid! You were incredible!\"\n\nVantner slapped the ground beside Grid's head. \"You magnificent bastard! Hahat! Puhahahat!\"\n\nLaughter echoed through the Mysterious Forest. For twenty-three hours, only screams had filled these groves. Now, joy.\n\nThe doppelganger heard it through fading consciousness.\n\nMemories surfaced. *Her* laughter as a child, bright and pure. As a girl, sharp and quick. As a young woman, tender and knowing.\n\n\"...\"\n\nDarkness crept in. Thought became difficult.\n\nVoices drifted through the haze.\n\n\"Eh? He's not dead? Still moving?\"\n\n\"He's lost the copied appearance, but the core's still intact.\" That sounded like Lauel. \"However, he might as well be dead. His abilities and intelligence have degenerated severely.\"\n\n\"Should we kill him?\"\n\n\"Considering a doppelganger's nature, he's worth studying. Let him recover.\"\n\nThe doppelganger lay motionless. His body had melted into something resembling tar.\n\nPiaro stood apart from the celebration. His arms trembled.\n\nHe'd witnessed Grid's power firsthand. Perhaps he hadn't been born under the same sky as Muller or Pagma. But he shared the sky with Pagma's successor.\n\n*It's you.*\n\nThe one who would guide him to the realm of the Sword Saint.\n\n---\n\n**Glossary of Common Korean Terms:** [OGC Glossary](link)\n\n**Current Schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and to help unlock goals for bonus releases!"
}