{
  "id": 234,
  "title": "Chapter 234",
  "content": "# Chapter 234\n\nGrid's stamina bar crept back to acceptable levels. He pushed himself upright on a flat slab of rock, muscles protesting. The Overgeared members watched him with an intensity that hadn't been there before.\n\n*The atmosphere has changed.*\n\nHe'd survived by breaking past his limits again and again. The growth felt tangible, like something solid settling into his bones. Grid pulled up his inventory and shared the item data.\n\n> **[Guardian's Necklace]**\n> Rating: <span class=\"rarity-unique\">Unique (Set)</span>\n> Durability: 23/23 Defense: 35\n> * Indomitable +30\n> * When the set is worn: Defense +100\n> * When the set is worn: Indomitable +50\n> \n> A necklace manifested by the Doppelganger of the Mysterious Forest. It gives the wearer strong willpower and defense.\n> \n> User Restriction: Level 300 or higher.\n> Weight: 15\n\n> **[Guardian's Bracelet]**\n> Rating: <span class=\"rarity-unique\">Unique (Set)</span>\n> Durability: 21/21 Defense: 37\n> * Indomitable +30\n> * When the set is worn: Defense +100\n> * When the set is worn: Indomitable +50\n> \n> A bracelet manifested by the Doppelganger of the Mysterious Forest. It gives the wearer strong willpower and defense.\n> \n> User Restriction: Level 300 or higher.\n> Weight: 11\n\nJishuka leaned forward. \"Magic accessories?\"\n\n\"With defense stats?\" Regas scratched his head. \"That's unusual.\"\n\nMost accessories prioritized utility over raw numbers. Doran's Ring could heal with near-legendary potency but offered zero defense. These Guardian pieces boasted defense values that would make armor jealous.\n\n*With the set effect, that's 172 points.*\n\nGrid ran the math. That matched level 300 heavy gauntlets. Impressive for two accessories. But judging by the faces around him, his guild wasn't celebrating.\n\nVantner folded his arms. \"Just defense? No other options?\"\n\n\"Accessories need attribute resistance at minimum,\" Zednos muttered.\n\n\"I need cooldown reduction.\" Laella frowned.\n\n\"The Indomitable stat is garbage anyway,\" Pon added.\n\n> **[Indomitable]**\n> Has a certain probability of invalidating a portion of incoming damage. The lower the health, the higher the probability.\n> * The higher the number, the higher the effect.\n> * Stat points can't be distributed to this stat.\n\nThe description made Indomitable sound useful. Essential for tanks, even. But the activation rate was so low that most players dismissed it as worthless.\n\n*They're right. It is garbage.*\n\nGrid sat at nearly 900 points in the stat. He'd never seen it proc. Not once. For a boss like Randy to drop only this? He understood the disappointment.\n\nBut his situation was different.\n\n\"If no one objects, I'd like these.\" He met their eyes. \"I don't have accessories.\"\n\nSince obtaining Pagma's Descendant, he'd crafted his own gear or looted it from raids. Accessories fell outside a blacksmith's domain. Boss drops were rare. His slots remained empty.\n\n*And no one could handle the purple orichalcum.*\n\nEven weak accessories beat nothing. The Overgeared members didn't hesitate.\n\nJishuka waved a hand. \"Take them. You earned first contribution.\"\n\n\"You carried us,\" Regas said. \"It's only fair.\"\n\n\"Thank you.\" Grid equipped the set, then shared the greatsword's information.\n\n> **[Doppelganger's Greatsword]**\n> Rating: <span class=\"rarity-legendary\">Legendary</span>\n> Durability: 731/731 Attack Power: 780~1,516\n> Attack Speed: -6%\n> * Ignores 20% of the enemy's defense.\n> * Increases the power of attack skills by 20%.\n> \n> A greatsword that the Doppelganger of the Mysterious Forest copied. It imitated the work of the legendary blacksmith Pagma, but the resemblance is only in appearance. The power isn't comparable to Pagma's works.\n> \n> User Restriction: Level 320 or higher. More than 2,010 strength. Advanced Sword Mastery level 2 or higher.\n> Weight: 3,955\n\nPon whistled. \"Now that's a weapon.\"\n\n\"Those options are insane!\" Vantner's eyes gleamed.\n\nGrid studied the numbers with growing appreciation.\n\n*This is only a copy? What would the original be like?*\n\nBase damage fell slightly short of <span class=\"rarity-unique\">Failure</span>, but those options. The 20% skill damage increase made his pulse quicken.\n\n*Pagma's Swordsmanship would devastate opponents with this.*\n\nStill, it couldn't replace Failure. Not even close. He glanced around. The guild wore similar expressions of reluctant admiration.\n\n\"Shame it's a greatsword,\" Regas said.\n\n\"If only it were one-handed...\" Zednos trailed off.\n\nNone of them mained greatswords. Toon could use one, but wrist blades defined his style. The <span class=\"rarity-legendary\">legendary</span> weapon might as well be vendor trash.\n\nLauel stepped forward, calculation gleaming in his eyes. \"Grid, have you considered dual wielding?\"\n\n\"Dual wielding?\" Grid blinked. \"With greatswords?\"\n\n\"Why not?\"\n\nSome swordsman classes unlocked Two Sword Style. They traded shields for overwhelming offense, paired blades creating devastating patterns.\n\nLauel gestured. \"You don't have the skill, but does that matter? Pagma's Descendant bypasses restrictions.\"\n\nTrue. But Grid shook his head.\n\n\"The weight's not the issue.\" He hefted Failure. \"Both blades are over two meters long.\"\n\nHis strength could handle the load. Failure was light. The Doppelganger's Greatsword, while heavier, posed no problem. But fighting with weapons longer than his own height, simultaneously? The physics alone seemed absurd.\n\n\"Your control improved dramatically during this raid.\" Lauel's voice carried conviction. \"More than you realize. With practice, you'll master it. Besides...\" He pointed. \"You have excellent teachers.\"\n\nPiaro stood nearby, silent. Toon practiced forms with his wrist blades.\n\n\"The strongest swordsman and a dual-weapon expert,\" Lauel continued. \"Study under them. Master it properly.\"\n\nGrid's jaw clenched. Tempting. The greatsword boosted basic damage and skills. Combined with Failure and Pagma's Swordsmanship, his offense would reach uncharted heights.\n\n*I want this.*\n\nHeat rushed through his veins. But this was a guild drop. He couldn't monopolize everything.\n\n\"I can't just take it all,\" Grid said.\n\n\"Do it.\" Jishuka's tone left no room for argument.\n\nRegas nodded. \"Smart play. Use your advantages.\"\n\n\"Balance the defense from accessories with offense,\" Pon added.\n\nGrid's throat tightened. They were handing him millions in gold without hesitation. The old Grid would've snatched it, giggling. But he'd changed. Grown this inconvenient conscience.\n\nVantner snorted. \"You're the only greatsword user. Should we sell it to outsiders? Let some ranker get stronger? Hell no.\"\n\n\"We're not creating competition,\" Zednos agreed.\n\n\"You've given us plenty already,\" Jishuka said quietly.\n\nSince becoming guild master, Grid had crafted their equipment for free. No costs, no fees. He'd considered it responsibility. Gratitude had flowed one way.\n\nUntil now.\n\n\"Thank you.\" His voice cracked. \"I mean it.\"\n\n***\n\nThey moved through the forest and climbed the mountain, searching for mines. Grid walked beside Piaro, discussing technique.\n\n\"Adapting to dual swords requires time,\" Piaro said. \"Especially greatswords. Quick mastery is theoretically impossible.\"\n\n\"So I should abandon it?\"\n\n\"No.\" Piaro's expression remained neutral. \"Pagma's power makes the impossible merely difficult. Expect a long road. First, suppress impatience. I'll train you to integrate dual wielding with Pagma's Swordsmanship.\"\n\nHuroi's shout cut through their conversation. \"Cabin ahead! On the slope!\"\n\n\"A cabin?\" Grid frowned.\n\nSomeone lived here? In Randy's territory, where entry meant near-certain death? The group approached cautiously. Grid knocked.\n\n\"Hello? Anyone home?\"\n\nSilence. No voices, no footsteps, nothing.\n\nVantner reached for the handle. \"Going in.\"\n\nThe door groaned open. Stale air rushed out, heavy with rot and abandonment.\n\n\"Decade old, at least.\" Pon wrinkled his nose.\n\nThey spread out to search. The cabin held almost nothing. A bed, a desk, shadows and dust. Grid was about to suggest leaving when Vantner called out.\n\n\"Found something!\"\n\nA storage box sat in the corner, birch wood with a rusted lock. Vantner grabbed it, muscles flexing.\n\n> [Nothing happened.]\n\n\"Locked.\" He scowled. \"Need a key.\"\n\nGrid pulled out his Master Key. \"Let me try.\"\n\n*Click.*\n\nThe lock surrendered. Inside, a single item waited. Grid lifted out a small, worn book and opened the cover.\n\nHis breath caught."
}