{
  "id": 235,
  "title": "Chapter 235",
  "content": "# Chapter 235\n\nThe box's lock gave way with a brittle crack. Inside, nestled in velvet gone threadbare with age, lay a small leather-bound journal. Grid opened it. The first pages were filled with crooked, childish letters.\n\n**Summer, Year 259 of the Kingdom.**\n\n*Today I met a child who looked exactly like me in the forest on the way out of the village. The person said hello! I smiled and greeted the child back.*\n\n\"Year 259...\" Lauel's finger traced the date.\n\n\"146 years ago.\"\n\nThe pages were remarkably preserved, the ink unfaded despite the passage of time. Grid turned to the next entry.\n\n**Winter, Year 259 of the Kingdom.**\n\n*I went to the forest for the first time in a while. The child who looked exactly like me was wearing summer clothes. I took off my hat and scarf and gave them to the child, who laughed.*\n\n**Winter, Year 259 of the Kingdom.**\n\n*I told my dad about the child in the forest. My dad became angry. He said the child was a dangerous monster. He told me not to meet the child again.*\n\nGrid's jaw tightened. \"The child in this diary... it's the doppelganger?\"\n\nLauel nodded slowly. \"Seems so.\"\n\nNot all monsters hungered for blood. Some attacked on sight. Others didn't. The Doppelganger of the Mysterious Forest had once been gentle, it seemed.\n\n*Then why did it try to kill us first?* Grid frowned at the contradiction.\n\n**Spring, Year 260 of the Kingdom.**\n\n*Dad said that child in the forest was dangerous, but he doesn't know her like I do. I went to see her again. The child treasured the hat and scarf I gave her.*\n\n*\"Hello!\" I greeted her. She replied with the same words.*\n\n*We promised to be friends.*\n\n**Spring, Year 260 of the Kingdom.**\n\n*I named my friend Randy. My name is Wendy, so together we'll look like sisters.*\n\n**Autumn, Year 260 of the Kingdom.**\n\n*Randy speaks very well now. She can follow everything I say. My good friend is so smart.*\n\n**Winter, Year 260 of the Kingdom.**\n\n*I played with Randy every day and was caught by my dad. Dad took out his bow, stating he was going to kick Randy out. I was scared and followed. My dad saw Randy's greeting and couldn't shoot. Thank god.*\n\n**Summer, Year 261 of the Kingdom.**\n\n*My dad taught Randy how to use the bow. Now Randy is better at hunting than Dad. Thanks to Randy, my family never goes hungry. Thank you, Randy.*\n\n*But I still like rabbit meat more than boar meat.*\n\nThe diary entries flowed like water downstream. The young girl named Wendy spent her days in simple happiness. Her father and her friend Randy filled each page with new experiences. The joy radiating from those ink-stained words warmed something in Grid's chest. Around him, the Overgeared members leaned closer, silent.\n\nThen the handwriting changed. The letters grew sharper, more controlled. The tone shifted.\n\n**Spring, Year 270 of the Kingdom.**\n\n*There seems to be an amazing mine behind our house. The villagers gathered to check it, then said they should report it to the lord of Reidan.*\n\n**Spring, Year 270 of the Kingdom.**\n\n*The lord visited with dozens of knights. He told my dad to guide him to the mine. The sight of the lord watching me was... unpleasant.*\n\n**Summer, Year 270 of the Kingdom.**\n\n*Oh my god! A gentleman more beautiful than anyone I've ever seen came to the mine today. His dignified manner and fine features were like a prince from a fairy tale.*\n\n*The prince looked concerned.*\n\n*\"The minds of humans are still too immature to bear this mineral.\"*\n\n\"She's talking about Pagma.\" Grid's voice cut through the silence.\n\n\"Same thought.\" Lauel crossed his arms.\n\nThe pieces fit. Just as Rabbit predicted, a mine existed in this mountain. And the mineral inside was significant enough to draw Pagma's attention.\n\n*Yellow mithril.* Grid kept reading.\n\n**Autumn, Year 270 of the Kingdom.**\n\n*The lord declared he would develop the mine. Then he ordered me to pour him a drink. As I served him, the lord kept touching my hips. I was uncomfortable, but refrained because he was the lord.*\n\n**Autumn, Year 270 of the Kingdom.**\n\n*The lord said he would make me his concubine. What is a concubine? When I asked my father what that meant, he just shed tears.*\n\n**Autumn, Year 270 of the Kingdom.**\n\n*The villagers told me. There were one or two women who went to become the lord's concubines, but they were all treated as playthings. Everyone is worried about me. I'm scared.*\n\n**Winter, Year 270 of the Kingdom.**\n\n*I explained the matter to Randy, that I would need to leave home soon to become the lord's concubine. I don't want to leave my father and Randy. I cried loudly and Randy patted my back. Randy is always nice. Winter with Randy wasn't too cold.*\n\n**Winter, Year 270 of the Kingdom.**\n\n*It's serious. The lord tried to visit the mine, but was attacked by a monster in the Mysterious Forest. The identity of the monster is a doppelganger.*\n\n*Randy...*\n\n**Spring, Year 271 of the Kingdom.**\n\n*I heard the angry lord organized an army to kill Randy. I'm worried about Randy and can't sleep.*\n\n**Spring, Year 271 of the Kingdom.**\n\n*As soon as dawn came, I went to Randy. Randy's appearance was different. She looked exactly the same as one of the lord's knights.*\n\n*\"I don't like it. I will protect Wendy.\"*\n\n*Randy shouted at me to run away. No matter how I tried to persuade her, Randy wouldn't step back. What if Randy gets hurt? I was afraid and sad.*\n\n\"Since then...\" Lauel's voice was soft.\n\nTo defend the girl called Wendy, the gentle doppelganger had transformed into a guardian. For over a century, it had attacked anyone who invaded the forest. Fighting. Alone.\n\n\"The Guardian accessories...\" Grid touched the necklace in his inventory. \"The doppelganger made these.\"\n\nWhat happened to Wendy in the end? How did the doppelganger take on Pagma's appearance? The questions pulled Grid deeper into the pages.\n\n**Spring, Year 271 of the Kingdom.**\n\n*They say Randy defeated the army sent by the lord by herself. It's scary that many people died. But Randy was unharmed, so I was happy.*\n\n*I went to Randy.*\n\n*\"Don't worry. I'll protect Wendy. Don't worry, Wendy, don't worry.\"*\n\n*Randy said the same thing over and over while bleeding. She was seriously injured and couldn't get up properly. I had been saving herbs to treat Randy, but Randy was impervious to their effects. I will stay with Randy tonight to look after her.*\n\n**Spring, Year 271 of the Kingdom.**\n\n*A few days later, Randy's wounds still haven't healed. According to rumors, the lord is preparing a new army. Please... somebody please help Randy.*\n\n**Summer, Year 271 of the Kingdom.**\n\n*I was leaning on Randy's shoulders when the prince I saw last year appeared.*\n\n*\"Your killing originates from a noble heart.\"*\n\n*Despite Randy swinging the sword at him, the prince hammered at her. No! I yelled, but the prince didn't stop. Randy's body kept being hit.*\n\n*Then something strange happened. Randy's wounds became better.*\n\nLauel's eyes widened. \"Repair? The material that makes up a doppelganger's body can be treated like metal?\"\n\nGrid nodded slowly. \"Seems so.\"\n\n*Could I do that too?* He filed the thought away and turned the page.\n\n**Summer, Year 271 of the Kingdom.**\n\n*\"This world is full of danger. Humans are threatened by monsters and are busy fighting among themselves, while the demons underground are helped by the Yatan Church.\"*\n\n*The prince who called himself Pagma said difficult words. He smiled at me while patting Randy's head.*\n\n*\"There is a balance to be kept. If the present-day Eternal Kingdom gains the power to threaten the empire, it would cause great confusion. I will give you the right to use some of my strength, so you must defend this forest thoroughly. The consequence of that will be Wendy's safety.\"*\n\n*Randy was smarter than me. Unlike me, Randy understood the words and nodded. Then on this day, Randy's appearance changed into that of the beautiful prince.*\n\n**Summer, Year 271 of the Kingdom.**\n\n*Randy defeated the lord's army. This time, Randy wasn't seriously injured. Thank god. But I was worried. Randy's atmosphere changed. The warmth of his eyes felt a bit cold.*\n\n**Winter, Year 271 of the Kingdom.**\n\n*Randy has been fighting for the last few months. The lord hired mercenaries after his army couldn't defeat Randy. Randy warned me when I visited.*\n\n*\"Don't come here anymore. Wendy should stay with your dad.\"*\n\n*Why?*\n\n*\"Aren't we friends? Why are you rejecting me?\"*\n\n*I asked, and Randy explained.*\n\n*\"I'm able to easily kill humans. And Wendy is a human. I... I'm scared.\"*\n\n*Randy looked lonely. My heart hurts.*\n\n**Spring, Year 272 of the Kingdom.**\n\n*I visited Randy today. Randy acted as usual. He told me to 'Go back' and then fell silent. He didn't respond to any of my stories. I'm sorry and scared. More than anything, I am sorry.*\n\n**Summer, Year 272 of the Kingdom.**\n\n*Randy has killed many people. \"Are you okay?\" There was no answer from Randy. Now he doesn't even look at me. He just looks into the distance. He's changing more and more.*\n\n*Because of me...*\n\n**Winter, Year 272 of the Kingdom.**\n\n*My dad went to the village to sell leather and hasn't returned for several days. I tried to visit the village, but Randy blocked my way. He still doesn't speak.*\n\n**Winter, Year 272 of the Kingdom.**\n\n*I have to go to the village today! I yelled at Randy. I spoke harshly and said it wasn't necessary for him to protect me. Then Randy opened the way. In retrospect, Randy looked very sad.*\n\n**Winter, Year 272 of the Kingdom.**\n\n*I arrived in the village and heard shocking news. My dad was arrested by the lord. His crime was conspiring with the doppelganger. The lord found out my dad and I were close to Randy.*\n\n*It's all my fault. The sweet and pure Randy became covered in blood and my dad is suffering... all my fault.*\n\n**Winter, Year 272 of the Kingdom.**\n\n*The lord promised to release my father. Instead, I would become his concubine. I have no other options.*\n\n**Spring, Year 273 of the Kingdom.**\n\n*I met Randy last night. I couldn't bear to tell him, who was trying so hard to protect me, that I was leaving. Thank you, I'm sorry. And I can only say that I love you.*\n\n*Now I am leaving this house. I will never be able to come back. However, I lied and told Randy I would be back after a while. Today will be my last diary entry.*\n\n\"Poor Randy!\" Vantner's voice cracked. Tears and snot ran down his face, his rough exterior crumbling. \"He struggled to protect Wendy, but in the end he couldn't! He didn't even know he failed! Until now! For over 100 years, he's been waiting for Wendy to come back!\"\n\nSilence settled over the group like ash. They hadn't known. They'd assumed the doppelganger was simply hostile. Grid saw the guilt etched on their faces and exhaled slowly.\n\n\"Even if it wasn't us, someone else would've done the same thing eventually.\" His voice was steady. \"At least we know how Randy was feeling now, because of this book.\"\n\nThe Overgeared members stared at him.\n\n\"Grid...\"\n\n\"My Lord...\"\n\nGenuine respect flickered in their eyes. Grid had changed. Grown. He turned to the final entry.\n\n**Summer, Year 286 of the Kingdom.**\n\n*The lord abandoned me. My soul and body that have become rags have finally found freedom. The Mysterious Forest that I hadn't returned to in 13 years. Randy was waiting for me, looking just like he did in the past.*\n\n*Randy... there were so many words I wanted to say. I wanted to express my pain. But I didn't want Randy's heart to hurt, so I smiled as brightly as possible.*\n\n*I'm back.*\n\nSmall traces of blood dotted the final page. Wendy had been sick. Broken. She'd died shortly after returning home.\n\n\"The doppelganger doesn't understand that humans have limited lifespans.\" Lauel's throat worked. \"It's been waiting all this time.\"\n\n\"Yeah.\"\n\nGrid closed the diary.\n\n> **[You have learned a little more about the person called Pagma.]**\n>\n> **[There is a bond with Pagma. The growth rate of your skills will increase.]**\n\n*What?* Grid's eyes widened. Legendary skills grew painfully slow compared to normal abilities. This would offset that weakness. His heart beat faster.\n\n> **[You have discovered the story of the Doppelganger of the Mysterious Forest.]**\n>\n> **[The Doppelganger of the Mysterious Forest that fell by your hands is now different from the past. Its intelligence, physical abilities, and most of its memories have been degraded. But if you call it Randy, it will be delighted and follow you.]**\n\nA new pet. Grid's lips curved.\n\n*I'll be your new friend.* He carefully placed the diary back in the box, securing the lock. When he turned to face his guild, his expression was resolute.\n\n\"After we confirm the mine, I'll collect the doppelganger and return.\"\n\nIt had been an expedition of many rewards.\n\n***\n\n*Glossary of Common Korean Terms.*\n\n*OG: Glossary Link.*\n\n*Current schedule: 20 chapters a week.*\n\n*Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.*"
}