{
  "id": 236,
  "title": "Chapter 236",
  "content": "# Chapter 236\n\nGrid and the Overgeared members trudged through Reidan's gates four days after departure. Twice the planned schedule. Dust clung to their armor.\n\nRabbit emerged from the administrative building. His mustache twitched. \"I was worried. You're two days overdue.\"\n\nVantner wiped sweat from his bald head. \"Training. We killed every monster between here and Alzar Mountain.\" He spat into the sand. \"Both ways.\"\n\nGrid's face remained impassive behind his helmet. \"We're stronger for it.\"\n\nThe statement held truth. Four days of constant hunting interspersed with the doppelganger raid had forged them into something deadlier. Levels and items mattered, but the real gains ran deeper. Control. Coordination. Piaro's tactical instruction had woven through their sparring sessions, reshaping how they fought as a unit.\n\nRabbit's expression soured. \"Stick to the schedule next time. Delays compound. Costs multiply.\" He adjusted his spectacles. \"You all hold critical positions here. Reidan's administration can't halt because its leaders vanish into the mountains.\"\n\nThe rebuke landed. Grid nodded slowly.\n\n\"Understood. It won't happen again.\"\n\n*I need to be more responsible.* \n\nRabbit studied Grid's face. Something had shifted in the duke's bearing. Less reckless. More measured. The administrator's tight frown softened into something approaching a smile.\n\n\"Good. Now then.\" Rabbit clasped his hands together. \"What did you find? Was the survey accurate?\"\n\nYellow mithril. The words hung unspoken between them. Rabbit's shoulders were tense with anticipation.\n\nGrid pulled a chunk of ore from his inventory. Even in Reidan's harsh sunlight, the mineral gleamed with an inner luminescence. Pale gold, threaded with veins of amber.\n\n\"Yellow mithril mine. Secured and claimed under Reidan's authority.\"\n\n\"By the gods...\" Rabbit's hands shook as he accepted the sample. He turned it over, reverent. \"Yellow mithril hasn't been seen in centuries. The alchemical texts describe it, but no living craftsman has worked with it.\" His grip tightened. \"Not even the Saharan Empire controls a deposit. And now Reidan does.\"\n\nThe implications cascaded through Rabbit's mind. Monopoly. Leverage. Wealth beyond calculation.\n\n\"This changes everything.\" Rabbit's voice cracked. \"Reidan's future just crystallized into something magnificent.\"\n\nHyperbole served no purpose here. Yellow mithril would revolutionize Reidan's alchemy industry. Combined with a legendary blacksmith? The synergy would be explosive. Reidan could become what Talima was to the dwarves. A center of craft and commerce for the human world.\n\nRabbit was already moving toward the castle. \"Come. We need to convene immediately. Development timelines, investment allocation, security protocols...\"\n\nGrid held up one hand. \"Handle it without me.\"\n\nRabbit stopped. Turned.\n\n\"The Overgeared members know the details.\" Grid's voice was flat. \"Discuss it with them. Make the decisions you need to make.\"\n\n\"I... see.\" Rabbit had expected this. Grid's aversion to administrative work was well-documented. Still, the trust implicit in that delegation sent warmth through the administrator's chest. *He believes in my judgment.*\n\n\"I'll make us both wealthy beyond measure.\" Rabbit's voice carried quiet conviction.\n\nHe ushered the Overgeared members toward the meeting room, already running calculations. Grid remained in the courtyard. The other members filed past until only one figure lingered.\n\nEuphemina. Blonde hair tied in twin tails. Dark circles shadowed her eyes.\n\n\"Productive expedition?\" Exhaustion roughened her words. \"Congratulations on the discovery.\"\n\nShe'd been working nonstop since returning from Frontier with Rabbit weeks ago. The alchemy facility demanded constant oversight. Training NPC specialists. Optimizing production chains. Every day bled into the next.\n\n\"Do you have another assignment for me?\" Edge crept into her tone. \"More impossible tasks disguised as opportunities?\"\n\nGrid surprised her.\n\n\"Rest.\"\n\nEuphemina blinked. \"What?\"\n\n\"You've worked harder than anyone for months.\" Grid shifted his weight. Uncomfortable. \"Since joining the guild, you've carried more than your share. Take time off. Sleep. Hunt something for yourself. Raise your level.\"\n\n\"Is that... allowed?\" Suspicion warred with hope in her voice. \"Reidan's understaffed. Losing me would cripple production.\"\n\nGrid actually smiled. The helmet made it invisible, but his voice lightened. \"The alchemy facility is stable because of your groundwork. The experts you trained can maintain operations.\" He shrugged. \"Don't worry so much.\"\n\n\"Grid...\" Something unfamiliar stirred in Euphemina's chest. Appreciation? In all their interactions, he'd been distant. Professional. This sudden warmth felt like recognition. Reward for her sacrifice.\n\nThen he continued.\n\n\"I recommend the Siren Kingdom. Good hunting grounds for your level range.\" His tone shifted. Casual. \"While you're there, collect some Water Clan King's Tears.\"\n\nThe warmth evaporated.\n\n\"You want me to hunt in Siren...\" Euphemina's voice went flat. \"And acquire Water Clan King's Tears as a side objective.\"\n\nWater Clan King's Tears could permanently imbue items with magic. Legendary crafting material. Nearly impossible to obtain. And Grid wanted her to just... pick some up. Like groceries.\n\n*How long will he exploit me?*\n\nEverywhere else, people treated her like royalty. Here? She was a workhorse. A tool. *Did I make a mistake joining Overgeared?*\n\nGrid thrust something at her before she could voice her frustration. Fabric. Black, with a hood. Modern styling, like clothing from reality.\n\n\"What is this?\" She accepted it reflexively.\n\n\"A gift.\"\n\n\"A...\" Euphemina's protest died unspoken. She examined the item properly.\n\nThe information window materialized.\n\n> **<span class=\"rarity-unique\">Hooded Zip-Up</span>**  \n> Rating: Unique  \n> Durability: 61/61 | Defense: 10  \n> **Movement Speed +30%**  \n> **Wind Resistance +20%**  \n> Allows the wearer to hide their appearance. Stealth breaks upon attacking.  \n> Weight: 5\n\n\"An invisibility cloak?\" Her voice pitched upward. \"This is...\"\n\nTwo hundred years ago, the legendary tailor Kruger had crafted five such garments. Only two were rumored to still exist. Their locations unknown. System classified them as super-rare. And Grid just... gave her one.\n\nLike it was nothing.\n\n\"I'll go to Siren!\" The words tumbled out. Euphemina clutched the zip-up to her chest. \"Right away. I'll get those tears. Multiple samples. Whatever you need.\"\n\n*Joining Overgeared was the right choice.*\n\nGrid's mood improved watching her excitement. Give and take. Simple economics. A colleague's joy enriched the guild. A colleague's growth strengthened everyone.\n\nHe believed that completely.\n\n***\n\nKhan's smithy smelled of coal and hot metal. Grid opened his pet inventory with a thought.\n\n*Time to fix Randy.*\n\n> **[Summoning Doppelganger of the Mysterious Forest]**\n\nThe creature spilled across the workshop floor. Liquid metal given semi-solid form. No distinct features. Just a puddle of possibility, rippling with confusion.\n\nGrid drew his hammer. The weight was familiar. Comforting.\n\n*Pagma repaired the doppelganger in Wendy's diary. His descendant should be able to do the same.*\n\nHe activated the skill.\n\n> **[Legendary Blacksmith's Repair Lv. 3]**\n\nThe hammer rose. Fell.\n\n**Ttang!**\n\nThe first strike did nothing visible. Just sent vibrations through the doppelganger's form. Grid studied the ripples. Searching for structure. Pattern. Logic.\n\n*I don't know how this thing is built.*\n\nAnother strike.\n\n**Ttang!**\n\nThe doppelganger's body was alien. Not metal or flesh or stone. Something else. Grid would have to learn its nature through trial and error. He trusted his skill to guide him. To show him what he couldn't see.\n\nAn hour passed. Sweat soaked Grid's undershirt. His shoulders burned. But understanding crystallized with each hammer blow. The doppelganger wasn't solid. It was layered. Compressed sheets of semi-liquid material wrapped around a central core.\n\n*There.*\n\nGrid adjusted his aim. Targeted the core directly.\n\n**Ttang! Ttang! Ttang!**\n\n> **[Your Dexterity has increased by 5]**\n> \n> **[Your Persistence has increased by 3]**\n> \n> **[Legendary Blacksmith's Repair has reached Level 4]**\n> \n> **[The Doppelganger of the Mysterious Forest has been restored!]**\n\nThe creature shifted. Rose. Solidified into something resembling a translucent slime. Two dark spots formed where eyes might be. Grid opened its status window.\n\n---\n\n**Name:** Not Set  \n**Species:** Doppelganger  \n**Level:** 1 (0/200)  \n**Affinity:** 0/100  \n\n**Health:** 1,200/1,200  \n**Physical Attack Power:** 15 | **Magic Attack Power:** 2  \n**Defense:** 30 | **Magic Resistance:** 6  \n\n**Attributes:** None  \n**Status:** Confusion\n\n*Who am I...?*\n\n**Description:**  \nA doppelganger that existed for over 150 years in the Mysterious Forest. It has accumulated wisdom through human relations and possesses significant combat experience.\n\nAbove all, there is the power to copy the appearance and abilities of the legendary blacksmith Pagma, so it isn't comparable to normal doppelgangers.\n\n**Current Skills:**\n\n**[Copy Lv. 10 (Mastered)]**  \n- Target lower level than user: Perfectly copy appearance, 80% stats, some skills (random).  \n- Target same level as user: Perfectly copy appearance, 50% stats, some skills (random).  \n- Target higher level than user: Perfectly copy appearance, 20% stats, few skills (random).  \n- Copy owner: Perfectly copy appearance, 30% stats, some skills (selected).\n\n**[Language Ability Lv. 1]**  \nThe language ability is at the level of a five-year-old child.\n\n**[Half Immortality (Passive)]**  \nSomewhere in the doppelganger's body exists a core of life energy. The doppelganger won't die unless this core is completely destroyed.\n\n---\n\n*Excellent.*\n\nThe base stats were pathetic compared to Noe. Level one weakness. But that Copy skill... Grid could create a clone demonstrating thirty percent of his own combat power. A decoy. A distraction. A second Grid on the battlefield.\n\n*I'll need to level this one carefully.* \n\nDifferent from Noe's chaotic hunting style. Randy would require protection. Guidance. Grid would play favorites. *Noe will throw a tantrum.*\n\n\"Wh...o?\" The doppelganger's voice was uncertain. Halting. \"Who... am I? You... who?\"\n\nGrid crouched to eye level. \"Your name is Randy.\" He spoke slowly. Clearly. \"I'm Grid. We're friends.\"\n\n\"Ran...dy.\" The word rolled clumsily. \"Frie...nds.\"\n\nSomething shifted in the creature's form. Colors bled through the translucent surface. Hair sprouted. Orange, like autumn leaves. The body compacted, reshaped itself into something small and human. A girl. Five or six years old. Round face. Bright eyes.\n\nShe would've been beautiful as an adult.\n\n*This is Wendy.*\n\nGrief tightened Grid's throat. Randy and Wendy. Two lives destroyed by cruelty and loneliness. The doppelganger had protected Wendy's memory for over a century. Alone in that forest.\n\n*Not anymore.*\n\n\"Randy. Good name.\" The child-form smiled. Pure joy. \"Friend. Good.\"\n\n\"I'm glad.\" Grid reached out. Hesitated. Then let his hand rest on her orange hair. Light stroke. \"Things were difficult before. But this time will be different.\"\n\nHe made the decision then. No half measures. *Randy deserves happiness. I'll make sure she gets it.*\n\n\"Next...\"\n\nWork remained. The <span class=\"rarity-legendary\">Doppelganger's Greatsword</span> needed enhancement. His boots too. Grid pulled enhancement stones from his inventory. The Overgeared members had contributed their surplus. Enough for multiple attempts.\n\n*After this preparation, I'll settle accounts for Piaro.*\n\nThe Saharan Empire would learn what it meant to betray a legend. Soon, the history books would record a new entry. A reckoning delivered by Grid, Duke of Wisdom.\n\nThe hammer rose again.\n\n---\n\n**Glossary of Common Korean Terms:** [Link]  \n**OG:** [Glossary Link]\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and help achieve goals for extra chapters. Early access chapters update after daily releases complete."
}