{
  "id": 237,
  "title": "Chapter 237",
  "content": "# Chapter 237\n\nGrid stared at the pile of enhancement stones in his inventory, and his hands started to sweat.\n\n*Fuck.*\n\nHe'd done this hundreds of times. Maybe thousands. Every guild member's gear had passed through his forge, every sword and helmet subjected to the brutal lottery of the enhancement system. His passive skill increased the odds, sure, but that didn't mean shit when the stones crumbled to dust and an Epic weapon dropped to +3.\n\n*There's no trick to it.* \n\nThat was the cruel truth he'd learned through bankruptcy and sleepless nights. Dexterity didn't matter. Timing didn't matter. Repairing the item first, sacrificing a chicken, praying to the moon—all useless superstition. Enhancement was pure, distilled **RNG**. A coin flip with his wallet on the line.\n\nHe wiped his palms on his pants. His heart hammered against his ribs, worse than the time he'd walked up to Ahyoung in the school hallway with sweaty hands and a practiced confession.\n\n*I need the greatsword or the boots to hit at least +7.*\n\nThe math was simple. Failure meant wasted stones. Wasted stones meant wasted gold. Wasted gold meant another month eating convenience store kimbap while his loan interest compounded.\n\n*Please.*\n\nHe didn't know who he was praying to anymore. God, Buddha, Goddess Rebecca, the developer who coded the enhancement algorithm. Anyone who would listen.\n\nGrid selected the first stone. His finger hovered over the confirmation button.\n\nHe clicked.\n\n***\n\nThe meeting room doors swung open. Lauel and Rabbit had just finished negotiating mine development budgets and alchemy facility funding with brutal efficiency. The numbers were green. The projections were optimistic.\n\nNone of the Overgeared members walking out looked happy.\n\n\"We're going to suffer for months.\" Vantner dragged a hand down his face, helmet tucked under one arm. \"Fucking months.\"\n\nHis mission was simple in concept, hellish in execution. Clear the monster-infested route from Reidan to Alzar Mountain. Kill everything between point A and point B. Oh, and destroy at least ten Giant Worm nests while he was at it.\n\n*Because killing the worms wasn't enough. No, the nests respawn them.*\n\nOne of the seventeen members assigned to the detail groaned. \"I'm going to see Giant Worms in my sleep.\"\n\n\"I'm going to *be* a Giant Worm,\" another muttered.\n\nPon watched them complain and felt a spike of bitter envy.\n\n*At least they have a map.*\n\nHis mission was worse. Identify every dungeon, every field boss, every profitable hunting ground in the western wastes. Chart them. Rank them. Figure out which ones printed gold and which ones were XP traps. All of it. The entire western frontier.\n\nRegas clapped him on the shoulder, grinning like a maniac. \"It'll be interesting! Let's use this as a chance to try two-man raid tactics.\"\n\n*Of course he's excited.* \n\nRegas lived for this shit. Challenge. Struggle. The chance to punch something five levels higher than him in the face and call it training. Pon had to spend the next few months attached to this muscle-brained lunatic who thought 'strategy' meant 'hit it harder.'\n\nHe could already see the corpse runs stretching out before him like a paved highway.\n\nLauel cleared his throat. \"Our roles are critical while Grid is away. We're the foundation. We raise our levels, we develop the city, and we hold the line.\"\n\n\"Grid's leaving?\" someone asked. \"Where?\"\n\n\"The Saharan Empire.\" Lauel's expression went carefully neutral. \"Piaro has a quest for him.\"\n\nThe room went quiet.\n\n\"The Empire,\" Vantner repeated slowly. \"That place is crawling with—\"\n\n\"We know.\" Lauel cut him off. \"Let's just hope he doesn't start a war.\"\n\n***\n\nThe fields of Reidan stretched out under the desert sun, vast and flat and green in defiance of the sand. Wheat stalks swayed in neat rows, still young but growing strong. Piaro stood in the center of it all, dirt caked on his hands, sweat soaking through his shirt.\n\nHe looked exactly like what he was: a farmer.\n\nBland spotted the approaching figure first. \"Duke Grid.\"\n\nEvery head turned.\n\n\"Duke Grid! Duke Grid! Duke Grid!\"\n\nThe workers erupted into cheers, voices raw with genuine fervor. No one forced it. No one had to. The people of Reidan loved their lord with a loyalty that bordered on fanatic, and Grid had earned every ounce of it by not being a complete bastard.\n\nGrid walked through the field, and a faint blue haze shimmered around his boots. The aura of a **+8** enhancement.\n\nPiaro noticed immediately. \"The enhancement went well.\"\n\n\"Both of them.\" Grid couldn't keep the grin off his face. \"Doppelganger's Greatsword and Grid's Boots. Both to +8.\"\n\n*Lucky. So fucking lucky.*\n\nThis whole event had been a windfall. He'd learned more Pagma's Swordsmanship techniques. He'd tamed a <span class=\"rarity-legendary\">Doppelganger</span> as a combat pet. He'd found a yellow mithril deposit worth a small fortune. Everything was clicking into place like the universe owed him a favor.\n\nHe wanted to ride this streak as far as it would go.\n\n\"I think it's time.\" Grid's eyes locked onto Piaro's. \"Let's get your revenge. I'm heading to the Empire.\"\n\nPiaro studied him for a long moment. Then he nodded.\n\n\"I trust you.\"\n\n> [A Quest Has Been Created.]\n>\n> **[The True Traitor of the Red Knights]**\n>\n> **Difficulty:** SS\n>\n> Asmophel dared to betray his captain by conspiring with the Empress. When Piaro discovered the affair, Asmophel framed him and his men as traitors to save himself.\n>\n> Piaro lost everything. His comrades were slaughtered. He was forced to flee like a dog.\n>\n> Now, Piaro's patience has run dry. But he cannot take revenge himself without triggering a war that would destroy Reidan.\n>\n> You are his blade.\n>\n> **Quest Clear Conditions:** Kill Asmophel, former Vice-Captain of the Red Knights.\n>\n> **Quest Reward:** Maximum affinity with Piaro.\n>\n> **Quest Failure:** Level -6.\n>\n> [Accept Quest: Y/N]\n\n*It's changed.*\n\nThe first time Piaro had offered this quest, back when Grid was a broke beginner stumbling through Winston, it had been **S-grade**. The rewards had been the title *Agent of Revenge* and Piaro's cursed sword.\n\nNow the difficulty had spiked. The rewards had shifted.\n\n*Because we're closer now. Because Piaro isn't drowning in rage anymore.*\n\nGrid's mind raced.\n\n*What happens if I max out affinity?*\n\nWould Piaro teach him Supreme Swordsmanship? No. That was family technique, passed down through blood. Piaro wouldn't hand that over to an outsider.\n\n*But maybe he'd become my subordinate.*\n\nThat was the real prize. Piaro's power was apocalyptic. If Grid could bind him as a vassal, it would be like gaining an entire army in a single package.\n\n\"Believe in me,\" Grid said.\n\nPiaro's expression darkened. \"I've warned you before. The Empire is full of monsters wearing human faces. The road to Asmophel will be dangerous. Be cautious.\"\n\n\"I understand.\"\n\n*I'm not scared.*\n\nPiaro frowned. \"Don't rely on tricks. Dual wielding isn't something you can master with a few days of practice.\"\n\nGrid had been training with Sword Ghost's split form on the road back from the Doppelganger raid. He'd gotten the basics down. The rest would come.\n\n\"Don't worry,\" Grid said. \"I know my limits.\"\n\n*For now.*\n\nThe Empire's capital, Titan, was at least twenty days away. If he practiced every night on the road, he'd have the two-sword style down cold by the time he arrived. Piaro had drilled the fundamentals into him. The rest was repetition.\n\nGrid accepted the quest.\n\n***\n\nThe Saharan Empire was the center of the world.\n\nThat wasn't propaganda. It was fact. The Empire had the largest army, the deepest coffers, the most advanced magic, the strongest knights. Kingdoms outside its borders bent the knee or got crushed. There was no middle ground.\n\nNo one dared to call them arrogant. Arrogance implied delusion. The Empire's superiority was *objective*.\n\n\"There.\" Veradin pointed down the slope. \"The Ul Clan village.\"\n\nHe was a Baron of the Empire, master of the White Wolf Guild, and currently on assignment from Earl Zebra. The mission was simple: exterminate the immigrant tribe hiding in the remote wastes. One week of tracking had finally paid off.\n\nVeradin narrowed his eyes. \"How many?\"\n\nKiki activated **Hawk's Eyes**, her vision zooming in on the settlement below. Wooden huts. Cook fires. Figures moving between buildings.\n\n\"One thousand and fifty,\" she reported. \"More than half are women and children.\"\n\n\"So less than five hundred combatants.\" Veradin relaxed. \"No tactics needed. We charge straight through and kill them all.\"\n\nKiki's jaw tightened. \"This feels wrong.\"\n\n\"They're NPCs.\"\n\n\"They're *people*.\" Her voice dropped. \"The Ul Clan used to have a kingdom. The Empire took their land, burned their cities, and now we're hunting the survivors like animals.\"\n\n\"They're lines of code,\" Veradin said coldly. \"Graphics and AI routines. Don't waste sympathy on data.\"\n\nHe needed this. Every Ul Clan member killed was **+12 Contribution** to the Empire. If he cleared this quest perfectly, he'd have enough to push for a Viscount title. That was worth more than a village full of NPCs.\n\nKiki exhaled slowly.\n\n*I wish a golem army would show up right now.*\n\nShe was thinking about the Eternal Kingdom invasion from months ago. The one that had catapulted Grid from nobody to Duke overnight.\n\n\"That Grid bastard was lucky,\" one of the guild members muttered. \"He just happened to be in the right place when the golems attacked.\"\n\n\"Right?\" another chimed in. \"Kill a few boss monsters and boom, instant Duke. If we'd been in the Eternal Kingdom, we'd be the ones sitting on a territory right now.\"\n\n\"Enough.\" Veradin's voice cut through the chatter. \"Focus on the mission.\"\n\n\"\"Yes!\"\"\n\nThe guild members straightened, bloodlust flickering in their eyes. Most of them had no moral qualms about this. NPCs were loot piñatas shaped like humans. Killing them was no different than clearing a dungeon.\n\nVeradin raised his hand. \"Trample them.\"\n\n\"**WAAAHHH!**\"\n\nTwenty-four players launched down the mountain like a landslide. They moved fast, boots slamming into rock, weapons drawn. The terrain meant nothing. Arrows fired from the watchtower. Magic spells arced through the air, bright and desperate.\n\nNone of it mattered.\n\nThe White Wolf Guild cut through the defenses like wet paper.\n\n\"Get lost!\"\n\n\"Thanks for the free Contribution!\"\n\n\"**Kuaaack!**\"\n\nThe village turned into an abattoir. Blood sprayed across wooden walls. Bodies crumpled in doorways. A woman clutched her daughter, begging in a language none of them understood.\n\n\"P-Please! She's just a child!\"\n\n\"Die quietly.\"\n\nThe sword came down.\n\nTwenty-four players against a thousand civilians wasn't a battle. It was a slaughter.\n\nBut it didn't last long.\n\n\"Why the hell do incidents follow me everywhere?\" a voice drawled from the edge of the village. \"I'm not some kid detective. Whatever. At least I got a quest out of it.\"\n\nVeradin's head snapped around. A figure stood between two burning huts, silhouetted against the flames. He wore a wide-brimmed hat pulled low, obscuring his face and nameplate.\n\n\"Who the fuck are you?\" one of the guild members barked.\n\nThe stranger tilted his head. He pulled a jade greatsword from his inventory, the blade glowing faintly in the firelight.\n\n\"This time?\" He smiled. \"I'm the Apostle of Justice.\"\n\n**Puok!**\n\n\"What?!\"\n\nVeradin's eyes went wide. The stranger was suddenly *behind* his guild member, sword buried hilt-deep in the man's spine.\n\n*A clone. No. Two of them.*\n\nIt wasn't an illusion. The clone was *real*. It had mass. It had killing intent.\n\n*A high-level user.*\n\nVeradin's mind raced. \n\n*Who the hell is this?*"
}