{
  "id": 238,
  "title": "Chapter 238",
  "content": "# Chapter 238\n\nMost clones were illusions. Cheap tricks that couldn't land a real hit. But the unidentified man's clone struck true. Elvo screamed as the blade bit into his flesh.\n\nThe White Wolf guild members froze.\n\n*I heard third advancement assassins can make perfect clones.*\n\n*What? Then this bastard is over level 300?*\n\n*Is that Faker...?*\n\nFaker. Number one assassin. Fourteenth on the unified rankings. A ghost who never showed his face in public, but the rumors spread like wildfire anyway. Ten thousand users assassinated. Rankers hunted like animals. Even Kraugel, the first ranked player himself, had supposedly lost levels to Faker's blade.\n\nAll lies, of course. Faker wasn't a player killer. He trained alone, obsessive and methodical, like Regas. But rumors didn't care about truth. They twisted and grew until Faker became a myth wrapped in blood.\n\nThe White Wolf Guild had swallowed every word.\n\n*We're fucked.*\n\n*Today I die.*\n\nThe guild members trembled. Sweat ran cold down their backs. Veradin's voice cut through the panic. \"Assassins don't use greatswords. They work in shadows. If this was Faker, we'd already be corpses.\"\n\n\"Ah...!\"\n\nThe obvious truth slapped them awake. Panic had blinded them to basic logic. The guild members steadied their breathing.\n\n\"He probably has a hidden class,\" Veradin said.\n\nA reasonable guess. Hidden classes existed. Why not one specialized in clones? The guild members exhaled in relief.\n\n\"Phew... I'm glad. I don't want to fight Faker.\"\n\n\"A hidden class is easier than a third advancement ranker.\"\n\n\"Those people are monsters.\"\n\nThe fall of hidden classes since third advancement. A sad reality. Veradin caught their relaxation and his jaw tightened. \"Don't underestimate him. We don't know his abilities yet. Fall back.\"\n\nThe White Wolf members obeyed without complaint. Strong loyalty kept them disciplined. They retreated in formation.\n\nThe unidentified man walked forward through the blood-stained street. His boots crunched on scattered debris.\n\n\"Not fighting back?\" His voice carried amusement. \"Scared?\"\n\nVeradin didn't bite. A guild master learned caution early or didn't survive long. He watched the man and his clone, calculating. \"What's your relationship with the Ul Clan? Why help them?\"\n\nThe answer came sharp and simple. \"Got a quest.\"\n\nGrid. That's who stood before them, though they didn't know it yet. During his travels, he'd stumbled into the Ul Clan's village by accident. Then the attack happened, and of course he got dragged into it. *Am I cursed? Everywhere I go, shit happens.*\n\n> **[Ul Clan's Rescue]**\n>\n> **Difficulty: A**\n>\n> The Ul Clan lost their kingdom to the Saharan Empire. Survivors hide in remote villages, but the Empire's eyes are everywhere. Another invasion has begun.\n>\n> Free them from the Empire's grasp. Become their sun.\n>\n> **Quest Clear Conditions:** Repel the invaders.\n>\n> **Quest Reward:** Maximum affinity with the Ul Clan.\n>\n> **Quest Failure:** The Ul Clan will perish.\n\nFour days ago, before leaving Reidan, Grid had researched the Empire. Genocide as policy. Minorities who refused to kneel were slaughtered across the realm. Brutal oppression, thorough and merciless. Could they resist?\n\nPointless to even try.\n\nGrid hadn't accepted the quest for noble reasons. He wanted the reward.\n\n*If they have nowhere else to go and max affinity...*\n\nHe could make them his people. The Ul Clan quest was a chance to boost Reidan's population. Even better if he could gather all the persecuted minorities from the Empire. Grid was thinking like a lord now. Lauel would be proud.\n\n\"You have two choices.\"\n\nKilling intent radiated from Grid's eyes. Fury burned in his chest after witnessing the White Wolf Guild's brutality. Khan and Irene had taught him to respect NPCs, and these bastards had trampled that lesson into the dirt.\n\n\"Die easy, or get beaten first, then die. Pick one.\"\n\n\"Crazy bastard!\"\n\nThe White Wolf members bristled with rage. Who did this arrogant prick think he was?\n\n\"Veradin! How long are you going to let this brat run his mouth? We should attack right now! He's alone!\"\n\nElvo snarled the loudest. The clone's surprise attack had cut deep, both his health and his pride. Veradin checked Elvo's health bar.\n\n*Not bad.*\n\nElvo was a berserker. Paper-thin defense by design. But he'd only lost a fifth of his health from the ambush.\n\n*The clone isn't that strong.*\n\nThe unknown man's clone was clearly weaker than its master. The evidence was right there in the damage numbers.\n\n*Maybe he can make multiple clones. But if they're all this weak...*\n\nVeradin made his decision. \"We can't avoid this fight. Do it.\"\n\n\"Okay!\"\n\nElvo charged forward. Level 179, the lowest in the White Wolf roster, but he had balls of steel. Fear didn't live in his vocabulary.\n\n\"I'll kill you!\"\n\nMurderous intent poured off him. He wanted to carve the clone into pieces.\n\n\"Dash!\"\n\nTeong!\n\nThree meters vanished in a heartbeat. Elvo grinned. His dashing ability never failed him. He activated Madness Vortex. Five devastating strikes, enough to drop an ogre.\n\nBut he'd picked the wrong target.\n\n> **[The target has resisted the damage.]**\n\n\"Eh?\"\n\nNot defense. Resistance. The skill had connected clean. So what the hell was damage resistance? Grid stared at the stunned berserker.\n\n\"You want me to die?\"\n\n\"Heok?\"\n\nElvo's pride shattered. The prideful warrior became a terrified rat. Grid's dignity stat crushed him, a low chance to make enemies yield. With over 1,500 dignity, Grid radiated an aura that broke low and mid-ranked users like cheap pottery.\n\n> **[You stand before an immeasurable existence. Your head bows involuntarily. Your body trembles. Your thoughts scatter.]**\n\n*W-What...!*\n\nStunned just from eye contact? Was this guy a medusa boss? Elvo couldn't process it. *This has to be a dream.* The other guild members didn't understand what had happened. They rushed in like moths to flame.\n\n\"Magic Transmission!\"\n\n\"Atra's Poison!\"\n\n\"Fire Spear!\"\n\n\"Lower Cut!\"\n\n\"Kick! Abyooo~!\"\n\nCrowd control, physical attacks, magic attacks. Twenty enemies unleashing skills simultaneously. Grid looked like a dead man.\n\nThe silent clone moved. Randy the doppelganger stepped forward.\n\n\"Revolve.\"\n\nKwa kwa kwa kwa kwa kwa kwa kwa!\n\nThe counterattack skill triggered with perfect timing. Every skill reversed course. The White Wolf members ate their own attacks.\n\n\"Kuaaaak!\"\n\n\"What the hell is this?\"\n\nThe guild members reeled. A clone using advanced skills? A counterattack technique even players struggled to time correctly? Veradin felt ice slide down his spine.\n\n*He hid his strength in the first attack!*\n\nThe realization hit hard. Randy possessed 30% of Grid's combat power. Roughly equivalent to level 200. If he wanted, he could have bisected that guild member with the opening strike.\n\nBut Randy had held back. Deliberately played weak to lower their guard. This wasn't Grid's command. This was Randy's instinct, battle experience carved into his bones over more than a century. His memories were gone, but his body remembered war.\n\nGrid nodded with appreciation. \"Look at those faces. I was surprised too. Isn't my friend amazing?\"\n\n*Friend?*\n\nNot a clone? Then what? The White Wolf members tumbled into confusion's black hole.\n\nPuok!\n\nThe jade greatsword punched through Elvo's chest.\n\n> **[You have been hit by a lethal blow!]**\n>\n> **[The enemy has attacked five times using an unknown ability.]**\n>\n> **[You have suffered 103,900 damage.]**\n\n*Over 100,000? Not 10,000 but 100,000? I don't even have 20,000 health!*\n\nElvo's vision turned grey.\n\n*Is this a dream?*\n\n> **[Your party member Elvo has died.]**\n\nSilence blanketed the street. A monster beyond comprehension stood before the White Wolf Guild.\n\nVeradin kept his composure. He was one of the 10 Rookies alongside Lauel and Ibellin. Level 281 now. Meeting strong opponents didn't rattle him. Besides, he had a trump card. A sniper hidden in the mountains.\n\nHe sent the whisper. *Now.*\n\nA flash sparked from the low mountain three hundred meters behind them. An arrow cut through the air.\n\nPeeeeeong!\n\nKiki. Also one of the 10 Rookies. The White Wolf Guild's second-in-command. Her sniping rivaled Jishuka herself. The arrow flew true, aimed precisely at Grid's skull. Veradin expected massive damage, at minimum confusion and disorientation. He pulled out his staff, preparing to raise corpses. The Ul Clan dead. Elvo's body.\n\nThen he froze.\n\n\"T-This...?\"\n\nShocked cries erupted everywhere. They saw them. The famous golden blades.\n\n\"Surprised.\"\n\nThe man's voice echoed from behind the golden discs that had intercepted the arrow. The voice carried anger so pure and concentrated it could stop a heart.\n\nSururuk.\n\nThe shockwave from arrow meeting blade knocked the man's hat loose. It fell. The ID revealed itself. A name most of the world knew.\n\n\"Grid...!\"\n\nThe first legendary class. Three gold medals at the National Competition. Hero of the golem invasion. First user to become a duke. GOD. The titles stretched on forever.\n\nHe drew the blue greatsword. The same weapon that had destroyed Hurent in five seconds. Two massive swords, one in each hand. The White Wolf members felt their courage drain like water from a broken cup.\n\n\"Don't use surprise attacks!\"\n\n*You did it first!* The White Wolf members wanted to scream the words. But their throats closed. Grid's eyes locked onto the mountain peak three hundred meters away.\n\n\"You first. Transcended Link.\"\n\nKwa kwa kwa kwang!\n\nBlue-white and jade energy blades erupted simultaneously. The small mountain vanished from the Saharan Empire's map. Permanently.\n\n> **[Your party member Kiki has died.]**\n\n\"...I would've rather fought Faker.\"\n\nThe White Wolf members groaned. Veradin's composure finally cracked. This was the worst disaster since the guild's founding. The result was total annihilation.\n\n***\n\n\"Huh? The desert is smaller than it was a year ago?\"\n\nA black-haired man dressed in white stepped into the western Eternal Kingdom. His feet touched sand that shouldn't be there."
}