{
  "id": 239,
  "title": "Chapter 239",
  "content": "# Chapter 239\n\n*An A-grade quest was surprisingly tough.*\n\nGrid wiped blood from his cheek. Ever since obtaining Pagma's Descendant, A-grade quests had fallen before him like wheat before a scythe. This time was different. Twenty-five enemies lay scattered across the dirt, and he had paid for each corpse with stamina and health. More than one-sixth, gone.\n\nGrid rolled his shoulders, testing the ache. \"It was an unexpected melee.\"\n\nAnyone who heard that would have laughed. There was no melee. Twenty-five bodies. No survivors. A slaughter, plain and simple. But to Grid, the one who had dominated rankers at the National Competition, this fight stung.\n\n*The average level was only around 200. I should have finished them instantly.*\n\nVeradin was the problem. The necromancer.\n\n*That bastard was too strong.*\n\nNecromancers were parasites. They didn't care about friend or foe. Corpses became soldiers. Health, mana, stamina... everything bled away fighting an army that kept standing back up. And Veradin wasn't just powerful. He knew how to fight. His undead moved with purpose, harassing Grid with coordinated offense and defense.\n\n*He's as strong as my Overgeared members.*\n\nGrid clenched his fist. *I need to create an item that can easily kill the undead.*\n\nExperience. That was the lesson here. He was evolving in real time, already sketching mental blueprints for anti-undead weapons. His fingers traced the Guardian's Bracelet on his wrist, and his expression softened.\n\n*The more I use this, the more I like it.*\n\nOriginally, his Indomitable sat at 900. With the Guardian set equipped, it had broken 1,000. The difference was tangible. Lower-level attacks bounced off him now, resisted completely. High defense plus high Indomitable equaled an iron fortress.\n\n*Randy exceeded my expectations.*\n\nGrid had trusted Randy's fighting skills from the start. The doppelganger copied 30% of Grid's stats and items, putting him roughly equivalent to a level 180 swordsman. But Pagma's Swordsmanship gave Randy wings. **Pinnacle**, **Link**, **Revolve**... Randy wielded them all, crushing level 200 users like they were made of paper.\n\nRandy morphed back into the shape of a little girl. Grid reached out and patted her head. \"You fought well.\"\n\nRandy's buggy eyes lit up like stars. A flush spread across her cheeks. \"Praise! Happy!\"\n\n*Sehee was once this cute.*\n\n\"I also want to fight with Master! Nyang!\" Noe's voice cut through Grid's nostalgia. The demonic beast circled his feet, tail lashing. \"Why don't you let me fight? Nyang! Why is the best demonic beast being treated like this? Kyang!\"\n\nNoe had been grinding solo near Reidan, reaching level 143. He had expected this journey to be his time to shine alongside Master. Instead, he had watched a doppelganger steal all the glory.\n\nGrid crouched down and scratched behind Noe's ears. \"You are my precious secret weapon. I don't need to borrow the strength of my great secret weapon for something minor like this.\"\n\n\"Ohh...! Ohhhh!\"\n\nSecret weapon. Precious. Great. Noe's brain latched onto each word. His short limbs danced. His chubby body shook. Grid watched the demonic beast prance and noted the changes. The horns jutting from Noe's forehead had grown slightly larger. The fangs, sharper.\n\n*He's becoming more like a demonic beast.*\n\nGrid's **Demonic Power** stat ticked up by one with each PK. The number climbed steadily.\n\n*Will I become a demon if this stat keeps increasing?*\n\nHigher Demonic Power increased the likelihood of entering Hell. But there was currently no way in or out of Hell, so Grid could only imagine worst-case scenarios. His mind conjured images of horns sprouting from his own head.\n\nFootsteps pounded the earth. Grid looked up.\n\n\"Hero!\"\n\nThe Ul Clan survivors rushed toward him. Buda, the village mayor, led the group. He dropped to one knee.\n\n\"If you didn't help us, our people would've been lost in the backdrops of history! I don't know how to express our gratitude!\"\n\n> [The quest 'Ul Clan's Rescue' has been completed.]\n>\n> [Affinity with the Ul Clan has risen to the maximum. The Ul Clan will jump over a cliff for you.]\n\nThe entire clan bowed. Grid drew the **Great Lord's Sword** and activated **Character Observation**.\n\nNumbers scrolled across his vision.\n\n*Their Intelligence stat is very high.*\n\nGeneral NPCs averaged around 100 Intelligence. The Ul Clan averaged 300. One girl in particular caught Grid's attention.\n\n**Name:** Hwarin  \n**Age:** 11  \n**Gender:** Female  \n**Occupation:** Refugee  \n**Title:** Last of the Ul Clan's Royal Family  \n**Level:** 7\n\n**Strength:** 3/70  \n**Stamina:** 12/249  \n**Agility:** 14/398  \n**Intelligence:** 120/1,890  \n**Charm:** 155/1,503  \n**Dignity:** 30/550\n\n**Skills:** Haven't learned any yet.\n\n*A survivor of the Ul Kingdom that the Saharan Empire destroyed. Her identity might be hidden but she actually has the noble lineage of the Ul Clan.*\n\n*This is good.*\n\nThe Ul Clan was an excellent race. Useful in many ways. Some could be trained as magicians. Grid sheathed the sword and stepped forward.\n\n\"The empire isn't a place where you can live. Would you consider moving to the Eternal Kingdom?\"\n\n\"The Eternal Kingdom...?\" Buda's brow furrowed. The Eternal Kingdom was one of the seventeen great nations of the continent, but it was still beneath the empire's boot. \"Will the Eternal Kingdom accept us, who are hunted by the empire? It might provide grounds for the empire to retaliate.\"\n\n\"If you move in secret then the empire won't notice.\"\n\n\"But the royal family won't be happy.\"\n\n\"Don't worry.\" Grid crossed his arms. \"Go to Reidan. Even the royal family can't intervene in the administration of a duchy.\"\n\n\"Who are you?\"\n\n\"I am the master of Reidan. I promise the people there will treat you without discrimination.\"\n\n\"Heok...!\" Buda's eyes widened. \"That means you are a duke!\"\n\nThe Ul Clan murmured among themselves. Why was a duke from another kingdom operating inside the empire? It defied common sense.\n\nGrid opened a whisper channel to Lauel.\n\n*I need someone who can lead 930 people from Earl Zebra's territory in the empire to Reidan.*\n\n*Yes?*\n\nGrid explained the situation. Lauel's confusion shifted to excitement. *Faker.*\n\nGrid blinked. *Faker? Is it okay?*\n\nFaker always moved in the darkness. He didn't show himself in public. Leading a massive refugee caravan seemed outside his skill set.\n\n*Faker's trap installation ability and situational judgment abilities are unique,* Lauel replied. *If there are pursuers, he can install traps as quickly as possible and secretly lead the Ul Clan.*\n\n*I know his abilities but... Isn't there someone better than Faker?*\n\n*There is a lot of work piled up in Reidan. It is impossible to send more than two people, so please trust Faker.*\n\nGrid closed the whisper window. It was decided. He activated a skill.\n\n\"**Summon Knight**.\"\n\n> [Summon a knight. Currently you have Huroi, Lauel, Jude, Jishuka, Euphemina, Faker, Pon and Regas. Which knight would you like to summon?]\n\n\"Faker.\"\n\n> [The target has accepted the summons.]\n\nGrid's shadow rippled. Black liquid oozed upward, coalescing into the shape of a man wrapped in a cloak. Faker rose from the darkness with a nonchalant expression.\n\n\"You worked hard.\"\n\n\"Yes.\"\n\nFaker's gaze swept across the Ul Clan. His eyes were emotionless. Dead. The refugees flinched.\n\n*Those eyes feel like they are penetrating me to the bone.*\n\n*I'm scared.*\n\nFear settled over them like a burial shroud. Faker's **Killing Intent** stat leaked through his mental defenses. It was a curse for an assassin. Killing Intent was supposed to be concealed. Maintaining that concealment consumed mental power constantly.\n\nFaker didn't waste time. \"Go.\"\n\nThe Ul Clan scrambled to gather their belongings. Faker turned and walked into the wilderness. The refugees followed, stumbling over roots and rocks in their haste.\n\n***\n\nDays passed. The Ul Clan felt like they were sitting on thorny cushions. Faker didn't say a single word. Not one. The silence made everything worse. They became increasingly frightened. Each step felt like it could be their last. They held their breath, terrified that even breathing too loudly might provoke him.\n\n***\n\nGrid changed his schedule. He hunted. It was an inevitable choice. His Infamy had spiked from all the PKing. High Infamy meant no entry to villages or cities. The Eternal Kingdom might overlook it, but this was the empire. He needed to grind it down.\n\nThe problem was the monsters. Zebra's territory only had level 180 to 220 spawns. They gave less experience. Infamy dropped slowly. Grid was nervous about the delay, but he remained calm. He used the time to practice dual swordsmanship and raise Randy and Noe's experience.\n\nA flapping sound cut through the air. Grid looked up.\n\nA homing pigeon descended. It landed on his outstretched arm. Grid untied the letter from its leg.\n\nIrene sent one every week. Usually they expressed longing. Today's was different.\n\nGrid read the first line. His eyes widened.\n\n\"This letter?\"\n\nHe had dismissed Irene's constant talk about wanting to get pregnant. He hadn't thought it was actually possible for a user and NPC to conceive.\n\nThe letter continued:\n\n*Around a month ago, my stomach started hurting. I didn't think much of it, but then I started experiencing pregnancy symptoms. Somehow, I feel like my belly has... Happy tears are flowing. I would like to have a son that resembles Dear Husband.*\n\n\"Heok...\"\n\nA child?\n\nGrid was more baffled than glad. The news was unfamiliar. Alien. His mind couldn't process it. A notification window materialized.\n\n> [Do you want to honor the news of your wife's pregnancy?]\n>\n> [The birth of a new life should be congratulated, but those with no sense of responsibility should keep in mind that they don't deserve to be a parent. Think carefully.]"
}