{
  "id": 24,
  "title": "Chapter 24",
  "content": "# Chapter 24\n\n> **[Blacksmith's Rage]**\n> \n> **Difficulty:** B\n> \n> As Pagma's descendant, you have inherited not only his techniques but his will. You carry Pagma's humanitarian ideology: blacksmithing exists to benefit others.\n> \n> You cannot forgive the Mero Company and its minions who oppress the old and powerless blacksmith.\n> \n> Help the blacksmith Khan, who fell victim to the Mero Company's schemes and lost his customers.\n> \n> **Quest Clear Conditions:** Eliminate the Mero Company's minions and destroy the smithy transfer contract.\n> \n> **Clear Reward:** Blacksmith Khan's alcoholic symptoms will improve. Affinity with Khan will reach maximum.\n> \n> ***Note:** Khan was originally an excellent blacksmith. After his business was ruined by the Mero Company's schemes, severe stress drove him to alcohol dependency. He is currently an incompetent old man, but recovery from alcoholism will restore his former greatness. When that happens, he will discover your identity and provide invaluable assistance.*\n> \n> **Quest Acceptance Reward:** The skill 'Blacksmith's Rage' is created.\n> \n> **Quest Failure:** In a few days, Khan will die and all quests related to him will be permanently destroyed.\n\n\"Eh?\"\n\n*The blacksmith's ideology?*\n\n\"Is this a parody of humanitarianism?\"\n\n*The motto of the legendary blacksmith Pagma!*\n\n\"...Is there a hidden class that appears after eating only garlic for 100 days?\"\n\nI shook my head. Now wasn't the time to joke around.\n\n*This situation is a quest.*\n\nIt was exactly as I'd expected. A ruined smithy, a broken blacksmith, gangsters appearing out of nowhere. Classic quest setup.\n\n> **[Would you like to accept the quest?]**\n\nFive enemies. Level 35 minimum, probably higher. Meanwhile, I was alone and barely level 3. Unarmed, since I'd left my sword and armor in the warehouse.\n\nShould I refuse?\n\n*No.*\n\n\"I accept.\"\n\nNo reason to refuse, actually. Even at level 3, my stats made me equivalent to a level 20. I also had 'Legendary Blacksmith's Patience,' that absurd skill that maxed out my concentration, stamina, and defense for an hour. And beyond that? The passive that made me invincible for five seconds if my health hit the minimum.\n\n*I'm not weaponless either.*\n\nI opened my inventory and pulled out a single arrow I'd kept as a souvenir.\n\n> **[Special Jaffa Arrow]**\n> \n> **Rating:** Epic\n> \n> **Attack Power:** 35~42\n> \n> An arrow made by a craftsman with great skill and potential but lacking in experience and reputation.\n> \n> Due to the effect of combining jaffa with steel, it has extremely high penetration and ignores some of the enemy's defense.\n> \n> * Has a certain chance of ignoring the enemy's defense.\n> \n> **Weight:** 0.1\n\nArrows were consumables. But only when fired from a bow.\n\n*If I hold it and stab with it like a dagger, it won't break.*\n\nApparently most arrows could be retrieved and reused unless the target destroyed them. I didn't know from experience since I'd never shot a bow, but I'd grabbed a passerby earlier to confirm. The information had seemed strange at the time. Arrows were expensive, after all.\n\n*Hehe, information is power! I shouldn't neglect gathering intelligence in the future.*\n\nI smiled and examined the gangsters more closely. They held threatening weapons: axes, swords, maces. All wore leather armor.\n\n*The heavens are helping me.*\n\nIron armor would have been a problem. But leather? I could pierce it repeatedly with the Jaffa Arrow.\n\n*This arrow is something I poured my heart into. Its value can't be compared to normal arrows. I might only have the attack power of a level 20, but I trust this weapon. With the defense-ignoring option, I can bridge the offensive gap. Plus, I have all the combat experience I accumulated in my warrior days.*\n\nStats higher than my level. A suitable weapon. A fraudulent skill. Combat instincts from past experience.\n\nThose four elements were enough to clear the quest.\n\n*The probability is still extremely low.*\n\nWould I willingly accept a quest more likely to fail than succeed? Obviously. But consider the facts.\n\nFirst, no penalty for failure. The NPC Khan would die and associated quests would vanish, but I had no idea what those quests even were. Not my problem.\n\nSecond, the acceptance reward.\n\n> **[The quest has been accepted.]**\n> \n> **[Due to quest acceptance, the skill 'Blacksmith's Rage' has been acquired.]**\n\nQuest acceptance reward. Not clear reward. *Acceptance.* A skill just for saying yes. Who could resist that?\n\nI opened the skills window immediately.\n\n> **[Blacksmith's Rage]**\n> \n> **Lv. 1**\n> \n> Increases attack power by 10% and attack speed by 30% for 20 seconds.\n> \n> **Skill Mana Cost:** 50\n> \n> **Skill Cooldown Time:** 60 seconds\n\n*Amazing!*\n\nProduction classes like blacksmiths weren't supposed to learn combat skills. Yet here I was with a combat buff from accepting a blacksmith quest! And the performance was insane.\n\n*This is way better than the warrior buff skills I used to have.*\n\nMy old warrior buff increased attack power by 20% with a three-minute cooldown. This new skill boosted both attack power *and* attack speed, with only a one-minute cooldown.\n\n*Isn't this a windfall? Haha... is this the hidden quest everyone talks about? But the difficulty seems low for a hidden quest. Unless... it's probably a linked quest. Khan's quests are likely connected in a chain. This is a real jackpot.*\n\nThe moment I realized Khan's importance, I became obligated to clear the quest.\n\n*Thanks to the new skill, my clearing probability just increased. Good.*\n\nI approached the gangsters.\n\n\"What the hell?\" They tilted their heads as I returned instead of leaving. \"This guy came back?\"\n\nI pointed the arrow at them. Then I explained the biggest reason for accepting this quest.\n\n\"You crossed the line.\" My grip tightened on the arrow. \"I'm indifferent to elderly people, sure. But not as much as you bastards. You don't have to respect them, but shouldn't you maintain basic courtesy? You need to work on your education, you pieces of shit. I can't forgive you.\"\n\nThis wasn't me imitating some apostle of justice. I just genuinely didn't like these people!\n\n\"Blame the fact that you look exactly like Mother's Heart is Happy employees.\"\n\nI stepped closer. The gangsters grabbed their weapons.\n\n\"You bastard!\" The nearest one snarled, face reddening. \"This brat dares say such things to us? Did something happen to make you suicidal? Hey, you! You want to die? Huh?\"\n\n\"This bastard didn't appreciate us letting him go...\"\n\nIndeed, lawless NPCs were fearsome. They instantly showed killing intent. Truly people who'd committed countless evils.\n\n*They're formidable.*\n\nBut no reason to fear them. Right now, these people weren't objects of fear. They were targets that had to be defeated to clear the quest.\n\nThe warrior's ambition boiled inside me.\n\nI snorted with derision and raised my hand. \"Stop your useless talking and come on.\"\n\nThe gangsters reacted immediately.\n\n\"This crazy bastard!\"\n\n\"Get him! Hold him down!\" Another shouted, \"No, kill him! Just kill him!\"\n\nFive red-faced gangsters rushed forward. In an open space, I'd be surrounded and killed instantly. I'd already identified the smithy's terrain, though. I headed for the stairs leading to the second floor. The staircase was wide enough for two adult men to stand side by side.\n\nI planted myself in the middle with the arrow ready.\n\n\"Anyone who wants to get stung should come up.\"\n\nThe gangsters flinched as I seized the geographical advantage. Then they belatedly noticed my weapon.\n\n\"What is that? An arrow?\"\n\n\"Puhahaha!\" Another laughed. \"You want to fight us with an arrow? Where's your bow? Did you drop it on your mother's skirt, newbie?\"\n\n\"Blacksmiths can't even use bows anyway,\" a third added. \"They don't handle weapons well. No wonder he's swinging an arrow around. He's seriously green.\"\n\nThese bastards were mocking me!\n\nAmong them, Johnson had the most vicious nature. He rushed forward first. \"I'll cut this blacksmith up like a bear.\"\n\nI faced Johnson as he charged like a wild boar and activated my new skill.\n\n\"Blacksmith's Rage.\"\n\n> **[Blacksmith's Rage has been activated. Your attack power and attack speed will increase significantly for 20 seconds.]**\n\nA timer appeared at the top of the screen: 20 seconds. It showed the skill's duration.\n\nI thrust my arm forward.\n\n*Papat!*\n\nFaster than Johnson could swing his axe. The arrow pierced his chest twice. Large weapons had high damage and durability, but they suffered from fatal attack speed penalties. My arrow weighed nothing. Combined with Blacksmith's Rage, I overwhelmed Johnson with pure speed.\n\n> **[Critical!]**\n> \n> **[The effect of the Special Jaffa Arrow is activated, meaning the enemy's defense is completely ignored.]**\n\n\"Ke...heok!\"\n\nOnly two attacks. But both at full power. One critical strike. One defense-ignoring proc from the Special Jaffa Arrow. Lady Luck was smiling on me. I'd never imagined an arrow could deal this much damage.\n\n\"H-how...?\"\n\nJohnson stared in disbelief at the arrow protruding from his leather armor. Then he coughed blood and tumbled down the stairs. He dissolved into grey light.\n\n> **[You have defeated Winston's outlaw, Johnson.]**\n> \n> **[Reputation in Winston Village has increased by 60.]**\n> \n> **[Your relationship with the Winston outlaws has become hostile.]**\n> \n> **[The Winston outlaws will try to kill you when they find you.]**\n> \n> **[4,300 experience has been acquired.]**\n> \n> **[Your level has risen.]**\n> \n> **[Your level has risen.]**\n> \n> **[Your level has risen.]**\n> \n> **[Your level has risen.]**\n> \n> **[Your level has risen.]**\n\n\"Wow.\"\n\nI'd expected the gangster to be at least level 35. My guess seemed right. Five levels from one kill.\n\n*I defeated a level 35 enemy in just two hits?*\n\nEven with a critical and the defense-ignore proc, I'd expected it to take more strikes.\n\n*Do these guys have less health than they look?*\n\nThat made sense. Considering their aggressive tendencies, the gangsters had probably focused their stats on strength.\n\n*Okay.*\n\nI felt more confident about clearing this quest.\n\n\"Status window.\"\n\n> **Name:** Grid\n> \n> **Level:** 8 (125/1,400)\n> \n> **Class:** Pagma's Descendant\n> \n> * The probability of adding additional options when making items will increase.\n> * The probability of item enhancement will increase.\n> * All equipment items can be worn unconditionally. However, there is a penalty depending on the rating of the item.\n> \n> **Title:** One who Became a Legend\n> \n> * Abnormal conditions don't work well on you.\n> * You won't die when health is at the minimum.\n> * Easily acknowledged.\n> \n> **Health:** 316/316 **Mana:** 87/87\n> \n> **Strength:** 24 **Stamina:** 22 **Agility:** 16 **Intelligence:** 29\n> \n> **Dexterity:** 55 **Persistence:** 21\n> \n> **Composure:** 14 **Indomitable:** 16 **Dignity:** 14 **Insight:** 14\n> \n> **Stat Points:** 110\n> \n> **Weight:** 842/1,000\n\nFive levels meant 110 stat points.\n\n*Perfect timing to distribute them.*\n\nI didn't hesitate. All points into strength and agility.\n\n> **[You have invested 50 points in strength. Is this correct?]**\n\n\"Yes.\"\n\n> **[Once the points are invested, they can't be reversed. Do you want to proceed?]**\n\n\"Yes.\"\n\n> **[You have invested 60 points in agility. Is this correct?]**\n\n\"Yes.\"\n\nThe warning prompts vanished. My strength and agility surged.\n\nThe other gangsters couldn't climb the stairs. They stood frozen, staring at where their companion had died.\n\n\"W-what is that guy?\" one stammered. \"How did he handle Johnson so easily?\"\n\n\"Johnson wasn't vigilant,\" another argued. \"He allowed himself to be stabbed in the heart twice.\"\n\n\"Still, that bastard's weapon is just an arrow! Not shot from a bow, but hand-wielded, and it broke through leather armor and dealt that damage? Nonsense. Impossible.\"\n\n\"...This blacksmith must be strong enough that he doesn't depend on weapons. Maybe he isn't a blacksmith at all. He's a warrior. I'm sure of it.\"\n\n\"What does that...\" The speaker trailed off. \"Maybe he just looks weak.\"\n\n\"Don't focus only on appearances.\"\n\nThe gangsters watched me carefully.\n\nBlacksmith's Rage only had 10 seconds remaining. I provoked them.\n\n\"What are you doing? Aren't you attacking? It's four against one. You third-rate, hulking gangster scum.\"\n\n\"Third-rate?\" The one called Praga flushed. \"What is this jerk seeing?\"\n\n\"Praga, wait!\"\n\nDespite his companions' warnings, Praga fell for the taunt and charged. This time the weapon was a huge mace. The attack speed was glacially slow, just like Johnson's axe.\n\n*Kwajajak!*\n\nHe thundered up the staircase. The mace aimed for my face. I sidestepped and thrust the arrow forward.\n\n*Papapat!*\n\nMy increased agility showed immediate results. Three strikes before he could attack once.\n\n\"Ahhhhhh!\"\n\nPraga recoiled, stabbed three times in the chest.\n\n*Dammit.*\n\nNo critical hit this time. The Special Jaffa Arrow's optional effect didn't activate either. Even with 50 points invested in strength boosting my attack power, Praga didn't die.\n\n\"Hey, you okay?\"\n\nPraga grunted. \"Kuoock... not enough to kill me.\"\n\n\"Hmm...\" The speaker studied me. \"I guess it was coincidence that he took down Johnson in two hits. Attack power seems weaker than expected.\"\n\nLittle by little, the gangsters were identifying my strength.\n\nThen Veil, who appeared to be the leader, explained to his men. \"The thing to watch out for is his attack speed. He's overwhelmingly faster because we use large weapons. Fighting one-on-one is definitely a disadvantage.\"\n\n\"Then what?\"\n\n\"What should we do?\" Veil smirked. \"Simple.\"\n\nHe gestured. The group assembled in front of the staircase. Then he addressed me. \"I won't come up to grab you. But you can't stay up there forever. Eventually you'll have to come down. Then I'll kill you.\"\n\n*Heok...* they were actually smart.\n\n*If they were monsters, they'd move without thinking.*\n\nMy plan to exploit the terrain was worthless.\n\n*Four remaining. One's seriously injured but can still fight. Damn... no matter what method I think of, dealing with them all at once is too dangerous. How can I clear this quest?*\n\nI could be satisfied with acquiring a new skill. I was curious about the linked quests and rewards from Blacksmith Khan, but should I really take this risk?\n\n*It's wiser to quit by running away instead of dying. But...*\n\nMy eyes found the old man in the corner. Khan. I flinched when our gazes met. Was it the expectation, hope, and gratitude in those eyes?\n\nHe looked at me like I was a hero.\n\n*Don't look at me with those eyes. I'm not a hero.*\n\nI tried to ignore the old man's stare. My hand moved toward the logout command.\n\nThen I stopped.\n\n*Just accepting the quest gave me a new skill. I'm 100% certain this is a hidden quest. The rewards from the linked quests must be beyond imagination. Isn't it stupid to give up on a rare quest I might never encounter again?*\n\nYes. I had to try.\n\nI headed down the stairs. The gangsters waiting below immediately surrounded me.\n\n*My defense is close to zero. My health is small. If I let these guys attack, I'll die in two or three hits, even without critical strikes. The important thing isn't to fight quickly. Carefully. Carefully.*\n\nI concentrated as hard as possible. Blacksmith's Rage had finished its cooldown. I activated it again.\n\n\"Blacksmith's Rage.\"\n\n> **[Blacksmith's Rage has been activated. Your attack power and attack speed will increase significantly for 20 seconds.]**\n\nGood. Next.\n\n\"Legendary Blacksmith's Patience.\"\n\n> **[Nothing happens.]**\n\n\"Eh...?\"\n\nThe skill didn't activate? Confused, I hurriedly opened the skill window and read the detailed explanation.\n\n> **[Legendary Blacksmith's Patience]**\n> \n> Vitality, defense, and dexterity will rise by 200% for one hour.\n> \n> * This skill doesn't consume mana.\n> * This skill can't be used intentionally. It will naturally be triggered if you continue to persevere.\n\n\"...Ah, you.\"\n\nThis damn thing... a conditional activation skill?\n\n*I should've read the description. It's like not reading the fine print.*\n\nAs one of my trump cards vanished, the gangsters closed in with their weapons.\n\n\"Hey, you ready to go to hell?\"\n\nThe nearest one grinned. \"I'll make you pay for hurting and killing my companions.\"\n\nI was screwed."
}