{
  "id": 242,
  "title": "Chapter 242",
  "content": "# Chapter 242\n\nOne of the farmers wiped his brow, watching the two swordsmen clash. \"He's particularly intense today.\"\n\nHis companion nodded, leaning against his hoe. \"That means his opponent is strong. First time I've seen anyone push Piaro like this.\"\n\n\"But who is that person?\" A third farmer squinted at the black-haired swordsman. \"Never seen him before.\"\n\n\"I think he's Duke Grid's new subordinate.\"\n\nThe wheat field was becoming a wasteland. Already a 50-meter radius of destruction surrounded the dueling pair. It looked like it had before Piaro arrived, back when this was nothing but dead earth.\n\nYet none of the farmers showed confusion or frustration as they watched. They were used to this. Piaro often sparred with the Overgeared members. The fields had been trampled more times than they could count. Rabbit kept telling him to move the fights elsewhere, but Piaro stood firm.\n\n*If he destroyed the field, then he'd have more work to do.* \n\nIt was bizarre logic, but the fields had officially become a sparring ground. Piaro was a real labor addict.\n\n\"Bland, isn't that Piaro's share?\"\n\nThere was a noble among the farmers. Bland had been caught eating Piaro's snack. He cried out in protest.\n\n\"Why is this Piaro's share? Piaro said he wouldn't eat!\"\n\nThe farmer shrugged. \"I don't know.\"\n\n\"Piaro said it!\" Bland clutched the potato defensively. \"Then the person who eats it first is the owner!\"\n\nSilence.\n\nBland had completely adapted to farmer life. Hard to believe he was a noble. He was covered in dirt, chewing on a potato. The farmers knew about him being taken hostage and felt compassion for him.\n\nBland was happy, though. He found these days a hundred times more free and enjoyable than when he'd needed to be conscious of other people's opinions.\n\n*Caw!*\n\nA roc flew overhead. It had a large body and liked eating wheat. A couple days ago, the monster had tried to loot the wheat field. Before it could reach the crops, something hit it from the sky. Magic that Bland had strengthened through continuous duels with Piaro. Blood spilled out. The monster's body fell to one side of Reidan's wheat field.\n\nThis place was peaceful today. There were few safer places on the continent.\n\n***\n\nThe power of **Advanced Sword Mastery Level 7**, his passive skill Sword Reinforcement, and the effect of various titles—including Sword Saint Candidate—overlapped with the power of Storm Sword. It allowed him to cope with the Supreme Swordsmanship.\n\nPiaro laughed as the Storm Sword neutralized his strike.\n\n*It was offset.*\n\nFew people survived against Supreme Swordsmanship 1st Style. But Kraugel defended against it. Piaro had expected at least a serious injury.\n\n*My condition isn't very good right now.*\n\nAs a great swordsman, he didn't cling to weapons or armor. He didn't feel the need to rely on tools. But at this moment, he felt regret about his tools. If he'd been armed with a better sword, would the Supreme Swordsmanship 1st Style still be blocked?\n\nPiaro shook his head.\n\n*Muller wouldn't blame his tools.*\n\nIt was laughable that a person aiming to be a sword saint would blame his tools. The purpose of this duel wasn't a one-sided victory. It was to assist his growth. He should be happy if his opponent held on for a long time.\n\n*This technique is relentless.*\n\nThe remnants of the Storm Sword persistently clung to Piaro. He had to waste time defeating these fragments. Kraugel didn't miss the gap. He used Mole Ascension.\n\nWhite Fang moved through the earth. Piaro responded with Supreme Swordsmanship, 5th Style.\n\nColorless energy unfolded around him like a spider web. It destroyed the remnants of the Storm Sword while simultaneously neutralizing Mole Ascension and covering Kraugel.\n\n*Nine.*\n\nKraugel grasped the number of invisible energy threads. It was the power of Keen Senses.\n\n*I can't block all of them.*\n\nKraugel's brain rotation speed was unmatched. He determined his actions quickly and protected his vital spots.\n\n> [You have suffered 8,830 damage.]\n\n> [You have suffered 9,200 damage.]\n\n> [You have suffered 9,050 damage.]\n\n*The damage is more than expected.*\n\nThe legendary armor and artifacts he'd gathered while raiding boss monsters weren't much help. Piaro had a power that made defense useless. Kraugel endured the pain and didn't delay his next attack. It was his turn to take off some flesh and bones.\n\n\"Moonrise Sword.\"\n\nIt was a skill that exerted full power under the light of the full moon. But he was in a predicament and couldn't afford not to use it. The moon moved behind the sun.\n\nKraugel accelerated and activated the stealth function in the blazing sunlight. It was the effect of the white light, which utilized the refraction of light. Kraugel had amazing control skills. This technique was perfect in his hands.\n\nPiaro had to concentrate not to lose track of the disappearing Kraugel. Kraugel wasn't emitting any energy. As soon as he disappeared from view, Piaro couldn't detect him. It was the moment when the man who reached the peak of two billion users met the strongest swordsman on the continent.\n\nPiaro was tense. This was the first time he'd sweated in a long time. White Fang penetrated through his qi defense.\n\n> [You have dealt 12,400 damage to the target.]\n\nThe attack hit. Kraugel's expression wasn't good.\n\n*I can only deal this much damage, despite attacking a person wearing no armor. I could only exert 30% of my power.*\n\nKraugel was regretful about his attack. But he believed he could change the flow with this. He went on the offensive against Piaro. The power of Supreme Swordsmanship was scary, though.\n\nPiaro's sword started to intentionally harmonize with Kraugel's blade. Kraugel was forced back by the sword. He felt like he was caught in a large spider web. He couldn't even unfold his swordsmanship.\n\n*Calm down. It doesn't matter if his swordsmanship style is stronger than mine.*\n\nKraugel was aware of it. The world was wide and there were many monsters. He might be the strongest among users, but he knew there were stronger monsters and NPCs that could trample on him. He was prepared to taste the bitter sense of defeat at any time. But he'd never dreamed that one day he would be defeated by a farmer.\n\n*No, it hasn't been decided yet.*\n\nKraugel tried to suppress his sense of defeat. Piaro used the Supreme Swordsmanship, 3rd Style. It wasn't a speed that could be followed with the eyes. A normal person wouldn't have been able to cope. They would've been pierced through the heart.\n\nBut Kraugel succeeded in responding. He instantly twisted White Fang.\n\nThe moment he defended against the attack, Kraugel realized he'd made a mistake.\n\n*Force palm?*\n\nQi was delivered through White Fang. Blood poured from Kraugel's mouth.\n\n> [You have suffered 18,900 damage.]\n\nHe lost half his life. Fortunately, Piaro had discarded his sword. If it had been a sword, then it wouldn't have ended well.\n\n*I have half my mana left.*\n\nHe needed to arrange his power. Kraugel had many powerful sword skills such as Meteor Sword, Storm Sword, and Moonrise.\n\nOne of the ultimate skills of a White Swordsman, White Light Sword, generated a brilliant light. Piaro lost sight of him. A white light covered him. Piaro felt a sense of crisis.\n\n\"Supreme Swordsmanship 4th Style!\"\n\nSomething terrific happened. White Fang, which should've pierced Piaro, was sucked toward something like a magnet. The momentum of White Light Sword naturally collapsed.\n\nPiaro's discarded sword attracted White Fang using a magnetic force.\n\n*I can't resist this force.*\n\nThe magnetic force was too strong. Control was useless. There were few options left for Kraugel. He couldn't lose this weapon. He was forced to use Tearing the Sky. Tearing the Sky was another one of the White Swordsman's ultimate moves. It consumed a lot of mana. A skill he was reluctant to use.\n\nWhite Fang was surrounded by the claws of a beast and started to resist the magnetic force, tearing it up. The skill proved why it was called Tearing the Sky.\n\n> [The durability of the White Fang has decreased by 213.]\n\n*This is nonsense.*\n\nHis weapon's durability had decreased by two-thirds at once. This was dangerous. He hadn't been able to repair it for 10 days. The low durability caused it to shine red. It might break if he kept fighting.\n\n*Even my mana is at the bottom. Meanwhile, my opponent is fine.*\n\nPiaro only lost one-fifth of his health from the attack. Moreover, he seemed to have a lot of cards left.\n\n*Should I just stick with it?*\n\nIf he bought the Sweet Candy from the Reputation Store, all his stats would increase by 30% for 10 minutes. It might be a 30% increase, but his overall combat strength would become approximately twice as high. If he opened up the Super Sensitivity effect, he might be able to equal Piaro.\n\n*No, maybe I can win.*\n\nBut there was no need to take it that far.\n\n*There is no reason to take a loss in a fight where I have nothing to gain.*\n\nThe Sweet Candy was something he'd used in the Drasion raid.\n\nMuller defeated Drasion, Hell Gao, Lepir, and Kurson. There were 29 great demons left. He didn't want to waste the candy that he reserved for dragon raids or the 29 great demons.\n\nIn the end, Kraugel made a reasonable choice. He admitted defeat.\n\n\"It's my defeat.\"\n\nIt was an absurd development. He never imagined he would be defeated in a city he'd stopped at to dispose of loot.\n\nPiaro shook hands with Kraugel. \"It was a good fight.\"\n\n\"Why aren't you killing me?\"\n\nKraugel questioned. Piaro clicked his tongue.\n\n\"I'm not crazy. Why would I kill a person for no reason? You would've died if I wanted to kill you.\"\n\nHe had the skill Fated to Perish. Kraugel couldn't believe his ears.\n\n\"You seemed to be filled with killing intent.\"\n\nPiaro picked up the sword he'd thrown to one side of the wheat field. He apologized.\n\n\"I wanted it to be a sincere fight. I'm sorry.\"\n\nKraugel asked a question. \"What type of person is Duke Grid? Why is a strong person like you acting as a farmer in Reidan?\"\n\nIt was okay if Piaro was stronger than him. He knew that was reality. However, he couldn't accept this strong person being someone else's subordinate. Aside from the problem of pride, it was too dangerous.\n\nPiaro frankly explained to Kraugel, who had a serious expression. \"I'm not Duke Grid's subordinate. I am doing field work as part of training. I receive a reward for finding water.\"\n\n\"Field work as training?\"\n\nPiaro made a proposal to the confused Kraugel. \"Why don't you do it with me? Together, we will be able to quickly grow stronger.\"\n\n\"Together.\"\n\n*What were they going to do?*\n\nKraugel made an uneasy expression. Piaro pointed to Reidan's fields. \"Work in the morning, spar in the afternoon.\"\n\nSilence.\n\n\"You will really become stronger. Do you want to try it for a month?\"\n\n*It is different.*\n\nA notification window popped up in front of Kraugel, who was going to dismiss it as nonsense.\n\n> [A hidden quest has been created.]\n\n*This.*\n\nThe quest was amazing. If he practiced together with Piaro, he would be closer to becoming a sword saint.\n\n*A month isn't a short amount of time, but...*\n\nThis was an opportunity to go beyond the wall. It was a different concept from simply raising his level. It was worth investing time into. No, he couldn't miss this. It was a once in a lifetime chance at a jackpot.\n\n\"I understand. I will stay with you for the moment.\"\n\n> [The quest has been accepted.]\n\nOn this day, a good farmer was added to Reidan. But this was a minor thing. It wasn't reported to the higher ups. Grid was currently in the empire. The Overgeared members weren't present due to the mine development mission or raids.\n\nGrid and the Overgeared members didn't know that the first ranked user was growing the food they were going to eat."
}