{
  "id": 244,
  "title": "Chapter 244",
  "content": "# Chapter 244\n\nThe <span class=\"rarity-unique\">Slaughterer's Eye Patch</span> sat in Grid's palm, unassuming. Black leather. Simple stitching. The kind of thing a one-eyed beggar might wear in an alley. Nothing about it screamed \"worth ten days of hunting.\"\n\nThe old Grid would have lost his mind.\n\n*This is shit! I wasted 10 days just trying to get an eyepatch? Damn! What is this? Lauel, you bastard!*\n\nHe could practically hear his own whining echoing off the basement walls. But that version of him belonged to a different life.\n\n*Lauel wouldn't send me after garbage.*\n\nGrid turned the patch over, studying the worn leather. Items didn't advertise their value with sparkles and gold trim. He'd learned that much.\n\n\"Legendary Blacksmith's Appraisal.\"\n\n> [The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\nThe familiar chime rang out.\n\n> [Slaughterer's Eye Patch]\n> \n> Rating: Unique\n> \n> Durability: 7/7\n> \n> * The skill 'Vital Spot Detection' will be generated.\n> \n> The Slaughterer was tortured for a long time. He was also forced to watch the torture of countless people. As a result, he has a high grasp of vital spots. This eyepatch has been used by the Slaughterer for a long time and gained this ability.\n> \n> Conditions of Use: None.\n> \n> Weight: 0.1\n\n> [You have discovered a hidden feature in the item!]\n\n> [This is an item with a grudge. The wearer will be dominated by the impulse to kill and will become a reckless murderer.]\n\nA curse. The kind of debilitating affliction that would turn most players into mindless PKers, ruining their experience.\n\nGrid's lips curved upward.\n\n\"Lauel, you beautiful bastard.\"\n\n*Curse? I'll just resist it.*\n\nThe skill alone justified everything. **Vital Spot Detection.** A passive ability typically locked behind elite combat classes, the kind of advantage that separated rankers from the masses. Point at an enemy and the skill would paint a target on their weaknesses. Hit those spots and critical rates skyrocketed. Bleeding. Paralysis. Status effects that could flip entire fights.\n\nIn short, his damage output was about to explode.\n\n*Lauel must have paid Haynes a fortune for this information.*\n\nHaynes. First-ranked monster discerner. The man could look at a creature and predict its loot table like reading a recipe. If Minor was a divining rod for ore, Haynes was a treasure map with legs.\n\nGrid felt warmth spread through his chest. Lauel was drowning in administrative work for Reidan, yet he still carved out time to research Grid's weaknesses and patch them.\n\n*I need to reward him properly.*\n\nGrid lifted the eyepatch to his face. The moment leather touched skin, his left eye erupted with crimson light. Faint, barely visible under direct sun, but down here in the gloom of the basement, it glowed like a demon's gaze.\n\n*Lauel's going to lose his mind when he sees this.*\n\n> [Your hatred for humans is growing. You are filled with the urge to murder someone.]\n\n> [You have resisted.]\n\nThe world shifted. Randy stood three meters away, and suddenly Grid could see *through* him. Not literally, but close. The doppelganger's core pulsed beneath false flesh, a concentrated point of vulnerability that practically begged to be struck.\n\n*I was worried about losing depth perception. This is better than normal vision.*\n\nA perfect artifact. Assuming you could handle a curse that turned you into a frothing murderer, anyway. Grid's excitement rivaled the high he'd felt raiding the Pope and walking away with the <span class=\"rarity-legendary\">Holy Light</span> set.\n\n\"Then...\" Grid's gaze drifted to Noe. The Memphis lounged nearby, tail swishing. White fur tipped the end like a flower petal.\n\n*Your tail is your weakness.*\n\n\"I am the best demonic beast of hell! I don't have a weakness! Nyang!\"\n\nNoe's paws shot up defensively. His ears flattened against his skull.\n\nGrid filed the information away. *Armor for his tail. Add it to the list.* Then he reached for the second drop.\n\n<span class=\"rarity-legendary\">The Slaughterer's Mask</span>.\n\nThe iron sat heavy in his hand. Black iron, specifically. Quality material for a face covering. But the design...\n\nThe right half was shaped like a theatrical mask. One side showed a crying eye with carved teardrops trailing down the cheek. The other side curved into a mocking smile. Clown aesthetics mixed with tragedy. It looked deranged.\n\n*Lauel didn't mention this one.*\n\nProbably because Haynes hadn't flagged it. A minor drop, easily overlooked. Grid didn't expect much.\n\n\"Legendary Blacksmith's Appraisal.\"\n\n> [The Slaughterer's Mask]\n> \n> Rating: Legendary\n> \n> Durability: 39/39 Defense: 21\n> \n> * The skill 'Evil Spirit's Bloody Tears' will be generated.\n> \n> It is a mask that reflects the sadness of the Slaughterer, a being who lived a painful life just before he was born as a half man, half beast.\n> \n> Conditions of Use: None.\n> \n> Weight: 55\n\n> [You have discovered a hidden feature in the item!]\n\n> [This is an item with a grudge. The wearer will be dominated by the impulse to kill and will become a reckless murderer.]\n\n> [Evil Spirit's Bloody Tears]\n> \n> When hit, there is an 8% chance of releasing a blood flow. The ejected blood will paint the Slaughterer's mask with blood. When this happens 10 times, the mask will turn a distinct red. At that time, the wearer's attack power will increase by 50% for 5 seconds.\n\n\"Crazy.\"\n\nThe word slipped out before Grid could stop it.\n\n**Legendary** rating. A conditional trigger, sure, but a 50% attack buff? For five seconds? That was enough time to unload every skill in his arsenal. Stack it with other multipliers and he could delete bosses.\n\n*Haynes didn't know about this. That's why Lauel didn't pay extra.*\n\nProof that even the best information brokers had blind spots. Which meant this was pure profit.\n\n\"Kukukuk.\"\n\nGrid's laughter echoed off stone walls as he fitted the mask over his face. Black iron covered the right half. The eyepatch sat on the left, crimson light bleeding through the gap. Together, they transformed him into something out of a horror story. Worse than the <span class=\"rarity-rare\">Frostlight Orc Chief's Helmet</span> he'd worn in the past.\n\n*Lauel's going to piss himself.*\n\n***\n\n\"T-This...\"\n\nEarl Zebra stumbled into the basement, flanked by guards. The scene stopped him cold.\n\nThe Slaughterer, the unkillable monster that had terrorized his estate for years, lay scattered in chunks across the floor. Blood pooled in the cracks between stones. The stench of death saturated the air.\n\nOne person. One user had done this.\n\n\"W-Who are you? Heok?\"\n\nZebra's question died in his throat.\n\nGrid turned to face him. The mask and eyepatch combination created a visage straight from nightmares. The red glow from his left eye cut through shadow like a blade.\n\n*There's a red light in his eyes...*\n\nNot human. Couldn't be. Maybe a demon wearing human skin?\n\nGrid extended his hand. \"Give me the earrings.\"\n\n\"U-Understood!\"\n\nZebra tore the <span class=\"rarity-rare\">Black Quartz Earrings</span> from his ears. Family heirloom. Priceless treasure passed down through five generations. An accessory that increased intelligence by 15%, coveted by mages across the empire.\n\nHe dropped it into Grid's palm without hesitation.\n\n*I was supposed to give this to the knights coming to kill the Slaughterer. Shit. I need to send assassins after this bastard the second he leaves.*\n\nGreed wormed through Zebra's panic. Get the item back. Eliminate the witness. Clean problem.\n\nBut greed recognizes greed.\n\nGrid read the calculation in Zebra's eyes instantly.\n\n*This ridiculous bastard.*\n\nGrid's smirk stretched the mask into something even more grotesque.\n\n\"W-Why are you suddenly smiling?\"\n\n\"Cute.\"\n\n\"What...?\"\n\nRed flooded Zebra's face. He was an **Earl** of the Saharan Empire. Over forty years old. A man who commanded thousands. And this vagrant just called him *cute*? Like he was a pet? A lapdog?\n\n*This insane bastard!*\n\nZebra's hands clenched into fists. He wanted to order Grid flayed alive. Wanted to hear him scream in the torture chamber where the Slaughterer had been born.\n\n\"T-Thank you.\"\n\nBut his voice came out meek. Pathetic.\n\nGrid had killed the Slaughterer alone. That single fact recontextualized everything. Zebra's bravado evaporated under the weight of that red-eyed stare.\n\n*Just leave. Please just leave.*\n\nGrid equipped the earrings.\n\n> [Intelligence will increase by 15%.]\n\n*S-grade quest reward.*\n\nValuable, technically. Any magician would kill for a 15% intelligence boost. But Grid's intelligence already exceeded 1,000 thanks to title stacking and stat allocation. He had enough mana to spam skills freely. He didn't even use <span class=\"rarity-unique\">Dainsleif</span> anymore, so magic power was becoming irrelevant.\n\n*Placeholder until I can commission something with blue orichalcum.*\n\nGrid fixed Zebra with a stare. \"Do you think about weak people?\"\n\n\"...?\"\n\nConfusion broke through fear on Zebra's face. He just wanted this nightmare to end. Wanted the demon to vanish so he could breathe again.\n\n\"That is something I don't know.\"\n\nHonest answer. Zebra had been born into nobility, raised with a silver spoon shoved down his throat. Tens of thousands bowed before him. Thousands of soldiers followed his orders without question. Weak? The concept didn't register.\n\nGrid nodded. \"Right. You wouldn't know about such a thing.\"\n\nHe'd never experienced one-sided bullying. Never felt the soul-crushing weight of powerlessness while others ground him into the dirt. Grid knew that pain intimately. Knew what it did to a person.\n\nHe had zero interest in saving Earl Zebra. The man tortured people for entertainment. Oppressed his subjects. Turned human beings into monsters for his amusement.\n\n\"You, aren't you weak?\"\n\nThe red eye swept over Zebra from head to toe. Every instinct in the earl's body screamed danger. He stumbled backward.\n\n\"W-What? What are you trying to do?\"\n\nGrid shrugged. \"What am I doing?\"\n\nHe turned and walked toward the stairs.\n\nFootsteps echoed. Then faded.\n\nEarl Zebra stood frozen until silence returned to the basement. Only then did he sprint for the exit, already planning which assassins to hire.\n\n---\n\n**Glossary of Common Korean Terms.**\n**OG: Glossary Link.**\n**Current schedule: 20 chapters a week.**\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}