{
  "id": 245,
  "title": "Chapter 245",
  "content": "# Chapter 245\n\n\"Come out!\"\n\nEarl Zebra burst into his great hall. Nine shadows materialized from the darkness. The Black Arrows had served his family for generations. Their reputation was flawless. Not once had they failed an assassination.\n\n\"Kill the man who was just here.\" Earl Zebra's voice cracked with rage. \"Bring me back the <span class=\"rarity-unique\">Black Quartz Earrings</span>.\"\n\n\"Yes, my lord.\"\n\nThe assassins vanished. Earl Zebra blinked. One moment they stood before him. The next, nothing. He couldn't pinpoint the instant they disappeared.\n\n*That bastard doesn't stand a chance.*\n\nA twisted smile spread across his face. No target had ever survived the Black Arrows. He began humming, already imagining Grid's corpse.\n\n\"Nyang.\"\n\nA small cat padded into the hall. Its fur was smooth and black, except for the four white paws and tail tip that gleamed like fresh snow.\n\n*C-Cute!*\n\nEarl Zebra froze. The cat possessed an absolute charm that seized even his deranged mind. For one precious moment, his cruelty evaporated. He wanted nothing more than to keep this creature by his side forever.\n\nThe moment passed.\n\n\"Where are the guards?\" He bellowed at the walls. \"Why can't you keep a beast out of my hall? Do you want to die?\"\n\n\"I-I'm sorry, my lord.\"\n\nThe soldiers who rushed in looked pale. They had been standing watch. Nothing should have gotten past them. Not even an ant.\n\n\"Stop gawking. Get rid of it.\"\n\nThe soldiers lunged for the cat. Despite its chubby frame, it moved like lightning. It bounced around the great hall as though it owned the place.\n\n\"Heok?\"\n\nEarl Zebra and his men stared. Small wings had sprouted from the cat's back. A tiny horn protruded from its forehead.\n\n\"M-Monster...!\"\n\nEarl Zebra finally understood. He raised his hands to defend himself. Too slow. Too clumsy.\n\n\"Kiyaaah!\"\n\nPapat! Pa pa pa pat!\n\nThe cat's paws became a blur. Pain exploded across Earl Zebra's face. His skin burned.\n\n\"Kuaaaaak!\"\n\nHis scream echoed through the stone chamber. Blood poured down his mangled face.\n\n\"H-Hik.\"\n\nThe soldiers went rigid with terror. Earl Zebra's wrath would fall on them now. They had failed to stop the creature.\n\n*He'll torture us.*\n\n*What do we do?*\n\n*Why us?*\n\nThe soldiers exchanged glances. Their eyes drifted to their spears. They began inching toward Earl Zebra, who writhed in agony on the floor.\n\n\"Y-You...!\"\n\nEarl Zebra had never known suffering. Noble blood had shielded him from hardship his entire life. This was his first real injury. And his own men were closing in.\n\n\"How dare you threaten your master! This is treason! I'll cut off your limbs! You'll all die screaming!\"\n\nHis threats fell on deaf ears. The soldiers raised their spears.\n\nEarl Zebra changed tactics. \"Put down your weapons. I'll forgive you. I'll reward you. Just calm down.\"\n\n\"You think we'll believe you?\" One soldier spat. \"We've seen you lie to the people you torture!\"\n\n\"I've hated you from the start! Human butcher! The world is better without you!\"\n\n\"You killed my cousin. She was only fifteen, you son of a bitch.\"\n\nSuppressed rage boiled over. They had nothing left to lose. If they didn't kill him, he would kill them. The soldiers knew there was no going back.\n\nPuk! Puk puk puk!\n\n\"Y-You! Kuheook!\"\n\nThe man who was crueler than any demon choked on his own blood.\n\n\"Nyang.\"\n\nThe cat, architect of this chaos, sauntered out of the great hall.\n\n***\n\n\"Was this what you aimed for?\"\n\nOn the outer walls, Kiki lowered her head. She had just used her Hawk Eyes skill to observe the castle interior.\n\nVeradin shook his head. \"No. I only wanted the Slaughterer's bones.\"\n\nHe couldn't know why Grid had come to visit Earl Zebra. The Slaughterer was a bounty monster sought by many rankers. Perhaps Grid had come to raid it? Veradin had predicted Grid's presence. He hadn't warned Earl Zebra. The result was Grid claiming the Slaughterer's corpse.\n\nSo far, everything had gone according to plan. But Earl Zebra's death? That was unexpected. Technically, the soldiers had killed him. Yet the black cat that sparked the incident clearly belonged to Grid.\n\n\"Interesting.\"\n\nWas Grid really acting on behalf of people from another kingdom? A strange smile crossed Veradin's face.\n\n\"What should we do?\" Kiki asked. \"There will be an uproar.\"\n\nThe empire wouldn't ignore a murdered noble. They would send investigators. The atmosphere would turn bloody. That wasn't the only problem. Earl Zebra's son was still young and emotionally unstable from watching his father's cruelty. He was easily manipulated. The other nobles wouldn't trust such a boy with territory. A vicious power struggle would erupt.\n\n\"Veradin? Are you listening? Shouldn't we report Grid now?\"\n\n\"Dismissed.\"\n\n\"What?\"\n\nKiki stared at him. Grid was their enemy. He had hurt their guild. He had destroyed Earl Zebra's territory, their guild's home. Yet Veradin was letting him go?\n\nVeradin explained. \"We'll arrest the soldiers who killed Earl Zebra. We'll gain a massive achievement. Then we can increase our influence and install Earl Zebra's son as lord.\"\n\nHe was playing a longer game.\n\n\"This is an opportunity.\"\n\nVeradin believed this would let him eventually absorb Earl Zebra's territory. He would give this estate to his master, Agnus.\n\n***\n\nGrid waited in a thicket beyond the castle walls.\n\n*I wanted to kill him myself.*\n\nEarl Zebra was wicked beyond redemption. Grid had been through countless adventures. He had never encountered someone so brutal. But killing the earl personally was too dangerous.\n\nThe empire would hunt him. That would make reaching Asmophel difficult. It would also put the Eternal Kingdom in a bad position. If he had known Veradin was an imperial noble, Grid wouldn't have touched the White Wolf Guild. But he didn't know. He couldn't feel grateful that Veradin hadn't reported him.\n\n\"Grid is a good person? Then you punished a bad person?\"\n\nRandy was questioning the division between good and evil. Grid looked at his companion, satisfied by how much Randy grew each day.\n\n\"I'm not good.\"\n\nThat was true. Grid wasn't a good man. He wouldn't sacrifice himself unless it was for his colleagues. But he had a minimum level of conscience. He couldn't ignore those living in fear of Earl Zebra. If he lacked strength, he might have walked away for his own comfort.\n\n*I'm no longer weak.*\n\nHe was willing to help if he could. As long as it didn't harm him. This was Grid's evolution. It wasn't quite justice. But it wasn't truly contemptible either.\n\nGrid sensed movement. Uninvited guests were approaching their position. With over **1,400** Insight, detecting them was easy.\n\n\"Zebra's dogs.\"\n\nGrid measured assassins against one standard. Faker. These men weren't in Faker's league. In other words, Grid didn't acknowledge most assassins in the world. It wasn't arrogance.\n\nHis judgment was sound. Assassins relied on stealth and speed. But with Grid's high Insight and absurd defense, threatening him was nearly impossible. They would need at least Faker's skill to pose a real danger.\n\nSusuk.\n\nThe assassins crept closer, unaware they had been detected. They closed the distance. Daggers aimed for Grid's throat.\n\nChaaeng!\n\nGolden blades intercepted the strike.\n\n\"Cute tricks.\"\n\n\"...!\"\n\nThe assassins' faces remained blank. Inside, they reeled with shock.\n\n*He noticed us? Impossible.*\n\nThey struck again. Useless.\n\nPuok!\n\n\"Kuaaaak!\"\n\nThe golden blades flew from nowhere, burying themselves in an assassin's thigh.\n\n> **[Critical!]**\n> **[You have dealt 1,590 damage to the target.]**\n\n*Only that much damage, even on a critical hit.*\n\nPavranium was the strongest mineral. A weapon forged entirely from it would surpass even <span class=\"rarity-legendary\">Failure</span>. But these blades contained only trace amounts. Their attack power was limited.\n\n*Minor needs to find those western labyrinths.*\n\nHe needed more pavranium. Minor had a heavy responsibility. As Grid pondered this, the assassins grew wary.\n\n*He has backup!*\n\nGrid had been alone when he entered the castle. Now a girl accompanied him, and someone was throwing golden blades. They needed to find the hidden guard. But no matter how hard they looked, they detected nothing.\n\nGrid smiled. He pointed at the sky.\n\n\"Above.\"\n\n\"...?\"\n\nThe assassins looked up. The golden blades moved on their own.\n\n*Artifact!*\n\nThe assassins whirled back toward Grid.\n\n\"Keok...\"\n\n\"Ugh...\"\n\nThree of them were already impaled on a blue greatsword.\n\n\"What is this?\"\n\nThis was absurd!\n\n\"Are we being hunted?\"\n\nPast Grid and present Grid shared one trait. He showed no mercy to enemies.\n\n\"Don't waste my time. Die quietly.\"\n\nThe iron mask covering half his face seemed to be crying at first glance. Now it looked like it was smiling. The assassins experienced the greatest terror of their lives."
}