{
  "id": 246,
  "title": "Chapter 246",
  "content": "# Chapter 246\n\n*Are we going to die like this?*\n\nThe Black Arrows were trained to maintain composure under any circumstances. Surveillance, assault, assassination. Their tasks demanded secrecy and patience, making emotional control the most fundamental skill.\n\nYet here they were, losing that composure. Fear etched itself across their faces in ways no elite killer should allow. An excellent assassin would've kept calm regardless of the target's strength. Their terror proved one thing.\n\nThey were second-rate.\n\nGrid stepped forward. \"Your master is a dog, and you're just gangsters.\"\n\nThe assassins excelled at close combat with daggers. Normally, they'd welcome an enemy closing the distance. But this?\n\n*There's no chance facing him head-on.*\n\nTheir colleagues had been slaughtered in seconds. The six survivors scattered, then hurled their blades.\n\n*Clang clang clang!*\n\nDozens of daggers flooded toward Grid from every angle. No room to evade. The assassins anticipated blood.\n\nTheir imagination was pathetically limited.\n\nGrid's jade greatsword slid free in one smooth motion. The vortex began, dragging every thrown blade into its center. Then the spin reversed.\n\nPagma's Swordsmanship, Revolve.\n\nThe daggers exploded outward like bullets.\n\n*Thunk! Thunk thunk!*\n\n\"Gkk!\"\n\n\"Agh!\"\n\nThe bombardment hit harder than when they'd thrown the blades themselves. Grid's skill damage bonus turned their attack lethal. Assassins became pincushions, punctured by their own weapons.\n\n*Hit by my own daggers...*\n\nThe survivors' eyes wavered like candles in the wind. Grid activated Blacksmith's Rage. The blue greatsword became lightning in his hands.\n\n*Slash!*\n\nTwo heads rolled. The bodies turned to ash before hitting the ground.\n\n*Too strong...!*\n\nThe Black Arrows knew the Slaughterer's reputation. Nine of them attacking together should've been enough. But only three could fit in the basement at once, meaning this masked man had killed that monster alone. Even accounting for that, nine elite assassins should've been sufficient.\n\nThey'd miscalculated.\n\nHis strength rivaled the Red Knights themselves.\n\nThe Black Arrows who'd served Earl Zebra's cruelty were annihilated that day.\n\n***\n\nGrid wiped blood from his greatsword. *Vital spot strikes trigger Bisect more often... maybe? Need more testing.*\n\nThe experience from the Slaughterer had been substantial. Nine assassins averaging level 240 pushed him over the edge.\n\n> [You have leveled up!]  \n> [Level 288]\n\nBased purely on level, he'd cracked the top 500.\n\nHis actual combat power? That was a different story.\n\n*Agility is still garbage.*\n\nHe dumped all 10 stat points into agility. It wasn't enough. Piaro maintained a 1:1 ratio between strength and agility. Grid had been following that example for months, but the gap remained massive. Too many early levels invested purely in strength.\n\nCurrent stats: **2,810 Strength**, **1,606 Agility**.\n\nTo match Piaro's ideal balance, he needed another 120 levels minimum.\n\n*This is going to take forever.*\n\nDid despair grip him? Not even close.\n\n*Just hunt harder during breaks.*\n\nGrid refused to acknowledge exhaustion. Every hour of effort paid dividends. He'd learned that much.\n\nNoe landed on his shoulder. \"Praise the best demonic beast of hell! Nyang!\"\n\nThe cat's smug expression confirmed success. Earl Zebra's reign had ended.\n\nGrid removed the hat. Between the mask and eyepatch, his features remained hidden. His ID stayed concealed. \"Let's move to Titan.\"\n\nThe journey would take two weeks. Monsters blocked the path, giving him opportunities to practice dual-wielding and Vital Spot Detection. After each fight, he analyzed his performance, cataloging weaknesses.\n\nBy the time he reached Titan, he'd hit level 291 minimum.\n\nThat was the goal.\n\nRandy floated alongside Noe. \"Noe! Cute!\"\n\n\"Kyang! Pat the best demonic beast of hell's head! Stroke my chin too! Kyang!\"\n\nThe doppelganger and Memphis had become friends somehow.\n\n***\n\nIdan surveyed the great hall with the casual arrogance of youth.\n\nAt 23, he was the youngest of the Red Knights. No prestigious bloodline. No inherited title. Just raw talent that earned him the 31st position at age 14.\n\nNobody dared mock him.\n\nWho'd insult one of the empire's deadliest warriors?\n\nDozens of nobles and knights stood frozen like statues, watching him work. Idan ignored them. His focus remained on the seven soldiers who'd murdered Earl Zebra.\n\n\"Mm. I see.\" He settled into the throne. The blood staining it hadn't fully dried.\n\nNot one noble objected to his presumption.\n\n\"Execute them,\" Idan said. \"Their families too.\"\n\n\"Sir Idan!\" The lead soldier's composure shattered. \"You promised our families would live if we cooperated!\"\n\nIdan's smile didn't reach his eyes. \"I understand why you killed Earl Zebra. The man deserved death. But a crime is still a crime. The law must be enforced.\"\n\n\"You gave your word!\"\n\n\"I promised mercy if you cooperated.\"\n\n\"We told you everything!\"\n\n\"Did you?\" Idan tilted his head. \"When?\"\n\nThe soldiers understood then. This boy was evil. Vicious in ways that made Earl Zebra look straightforward. He smiled while condemning dozens to death.\n\nIdan watched guards drag the screaming men toward the execution platform. Then he turned to the assembled nobles.\n\n\"Baron Veradin, was it?\"\n\nVeradin stepped forward. \"Yes, Sir Idan.\"\n\nThe knight studied him with predatory interest. \"You witnessed Earl Zebra's murder, arrested his killers... how wonderful.\"\n\nPure sarcasm dripped from every word. The situation was too convenient. Too clean. Veradin had positioned himself perfectly, and Idan could smell the manipulation.\n\nVeradin didn't flinch. He bowed, expression neutral. \"If I'd arrived moments earlier, I might've saved Earl Zebra. My apologies.\"\n\nIdan's eyes darkened. Tough bastard. \"What about the one who killed the Slaughterer?\"\n\nSomeone had slain that monster alone just before Earl Zebra's death. The timing couldn't be coincidence. But Veradin maintained his story with irritating consistency.\n\n\"The soldiers described him as black-haired and graceful. I never saw him myself.\"\n\n\"Fine.\" Idan stood. He didn't spare Earl Zebra's corpse a glance on his way out.\n\nHis gaze tracked the direction the mysterious killer had traveled.\n\n*Who are you?*\n\nThe empire's judgment division rated the Slaughterer as A+ grade. Three Black Knights had failed to defeat it, forcing them to send Idan alone. He'd resented the assignment. Now it had gotten complicated.\n\n*Someone who can solo an A+ monster isn't ordinary. The seniors won't like it if I return without answers.*\n\nHe sighed.\n\nThis was going to be tedious.\n\n***\n\n\"This intelligence is confirmed?\" Zibal stared at the report.\n\n\"Yes, sir.\"\n\n\"Then we move now.\"\n\nRanked second on the unified rankings, Zibal commanded the Snake Guild's rapid expansion. But anxiety gnawed at him despite the numbers. 275 members. Average level exceeding 230. Over 100 ranked in the top 1,000 globally.\n\nHe'd recently achieved his earldom in the Haken Kingdom. The path to becoming the first user king seemed clear.\n\nExcept for Grid.\n\nThat bastard had jumped straight to duke after the golem invasion. Grid would likely claim the \"first king\" title at this rate. Zibal refused to accept that.\n\nSeven guilds had formed an alliance specifically to suppress Grid and Reidan. The leaders had sworn cooperation.\n\nThe problem was scale.\n\nThe Overgeared Guild dominated ranks 10 through 40 on the unified rankings. How could they invade Reidan with that concentration of power? Even combining all seven guilds, victory would come at catastrophic cost.\n\nA pyrrhic victory was the same as defeat.\n\nFor months, they'd waited for an opening.\n\nFinally, one appeared.\n\nScouts reported that Grid had vanished recently. The Overgeared members had left Reidan to develop some distant mine.\n\nThe city was empty.\n\nDestroying its facilities would cripple Grid's momentum for months.\n\n\"Deploy to Reidan immediately.\" Zibal's fingers drummed the table. \"Masks and helmets. Hide all identifying marks. Move fast and silent.\"\n\n***\n\n\"This is Grid's city...!\"\n\nDamian stared at the endless fields and massive walls. He'd visited countless major cities during his travels, but Reidan dwarfed them all in sheer scale.\n\n\"A duke's territory really is something else! Ruling a place this massive... incredible! The population has to be over 100,000!\"\n\nHis head swiveled, taking in the architecture.\n\nTwo farmers approached. Their sudden appearance startled him.\n\n\"Who are you?\" the first asked.\n\nDamian blinked. \"...Huh?\""
}