{
  "id": 247,
  "title": "Chapter 247",
  "content": "# Chapter 247\n\nDamian replayed the last few minutes in his mind as he approached the wheat fields. Nothing about his behavior warranted suspicion. He'd kept to the road, avoided confrontation, minded his own business. So why were these farmers now blocking his path?\n\n*They must think I'm a threat.*\n\nThe farmers stood in a loose semicircle, hoes and hand plows resting against their shoulders. Their weathered faces showed no hostility, only a strange, appraising curiosity. It made no sense.\n\nThen a different thought occurred to him. Damian glanced down at his armor.\n\n*Oh. It's the engravings.*\n\nHis white plate gleamed in the afternoon sun, every surface etched with phrases in gold script. The craftsmanship was exquisite. Each declaration flowed with the armor's curves, creating a harmony of color and form that any artisan would admire. But the content was another matter entirely.\n\n\"I love you, Rin.\" \"Beautiful Isabel.\" \"Precious Luna.\" \"Rebecca's Daughters forever.\"\n\nOn and on they went, covering every available inch of metal. Some people found them endearing. Most found them revolting. He'd been challenged to duels over those words, both in reality and in Satisfy. Being an otaku made you a target.\n\nDamian had learned to live with it. His love for the Daughters was pure. If others couldn't understand that devotion, that wasn't his problem.\n\nHe straightened and addressed the closest farmer. \"I'm a paladin of the Rebecca Church. Why are you asking who I am?\"\n\nThe farmer smiled. Not mocking. Not hostile. Just... interested. \"You don't seem like an ordinary paladin.\"\n\n\"Yes!\" Damian's voice rose. \"I'm not an ordinary paladin. I'm an otaku paladin! So what? Do you want to beat me up?\"\n\nThe farmer tilted his head. \"Otaku? What's that?\" He hefted his hoe, testing its weight. \"Anyway, won't you spar with me? The divine power I sense around you is far more interesting than any paladin or priest I've met.\"\n\nDamian blinked. \"This...\"\n\n*Oh.*\n\nThey weren't disgusted by his armor. They were insane. What kind of farmer sensed divine power? What kind of farmer challenged traveling paladins to combat? These people had clearly lost their minds working under the desert sun.\n\n*Poor souls.*\n\nCompassion welled in Damian's chest. He clasped his hands together and bowed his head.\n\n\"Goddess of Light, please bless these poor people...\"\n\nThe prayer took several minutes. When he finished, Damian opened his eyes and nodded to the farmers. \"I hope you'll recover your senses under the Goddess Rebecca's divine favor. I'll be going now.\"\n\nHe turned and walked toward the city gate. No point in dealing with lunatics. He had more important matters to attend to. Finding Grid. Convincing that greedy bastard to seal Lifael's Spear. Saving Isabel from her cursed fate.\n\n*Even if I have to give him everything I own.*\n\nHis hand moved unconsciously to the shield at his side. For Isabel, he'd sacrifice anything. His gear. His gold. His very soul if necessary. The Daughter had to be saved, no matter the cost.\n\nA sharp whistle cut through the air.\n\n*Peeng!*\n\nDamian's head whipped around. A hoe spun end over end through the air, closing the distance between them with terrifying speed. Killing intent radiated from the crude farming tool like heat from a forge. The qi surrounding it was overwhelming, oppressive, *wrong* for such a simple weapon.\n\n*Shit!*\n\nInstinct took over. Damian yanked his shield up.\n\n**Chaaeng!**\n\nThe impact sent shockwaves rippling through the wheat field. Stalks bent and swayed in the sudden gust. Damian's arm went numb from wrist to shoulder. His boots slid backward through the dirt, carving twin furrows before he managed to arrest his momentum.\n\n*Strong! This is...*\n\nA chill raced down his spine. He was the first paladin of the Rebecca Church. His defensive stats were among the highest in the entire game. And a farmer with a hoe had just rattled his bones.\n\nBefore he could process what was happening, the farmer strode forward and caught his returning hoe. With his free hand, he swept off his straw hat, revealing a weathered face and sharp eyes.\n\n\"Good defense.\" The farmer, Piaro, smiled. He shifted his stance, hand plow rising to a guard position. \"I'll have to use Supreme Swordsmanship.\"\n\nExcitement flickered across Piaro's features. Duke Grid. The Overgeared members. Kraugel. And now Damian. Powerful opponents who couldn't be crushed with mere Imperial techniques kept appearing in his life. It was exhilarating.\n\n*I need to take him seriously. Like when I fought Kraugel.*\n\nHis duel with Duke Grid at Loran Falls had been compromised. Piaro's mental state had been fractured then, his emotions in turmoil. He hadn't performed at his peak. But these past few months working beside the Duke had brought stability. Clarity. Now his skills flowed as they should.\n\n\"Let's begin.\" Piaro's grip tightened on his farming implements.\n\n\"I don't want to!\" Damian's rejection was immediate and emphatic.\n\nThere was no reason to fight. None whatsoever. He was just trying to enter a city. That didn't require combat.\n\nBut Piaro was unmoved. \"You must defeat me to enter Reidan.\"\n\n\"What kind of nonsense is this?\" Damian gestured at the absurdity of the situation. A farmer serving as a gatekeeper? What kind of backwards city was this?\n\nAnother farmer who'd been standing silently off to the side leaned close to Piaro. \"Go easy on him,\" the second farmer whispered. \"I also want a turn.\"\n\nKraugel had been working the fields and training with Piaro for two weeks now. The hellish regimen had borne fruit. He'd grown significantly stronger. Against Piaro, he could now survive long enough to lose only half his health before defeat. Even that monster was eager to test himself against this newcomer.\n\nDamian was exceptional. Rising to second place in the paladin rankings despite being part of the Rebecca Church, which was infamous for weak combat classes. Then he'd vanished from the public rankings entirely. Rumors suggested he'd obtained a hidden class.\n\nThat man was Damian. A celebrity among rankers. Kraugel had followed news of him with interest. But Damian himself was oblivious to his fame, his attention consumed entirely by thoughts of Rebecca's Daughters.\n\nRegardless, the celebrity was now facing a crisis.\n\nPiaro. The continent's strongest swordsman.\n\nKraugel. The peak of two billion users.\n\nTwo battles. Back to back. No escape.\n\n***\n\nThe Ice Flower Guild held the distinction of being one of the Seven Great Guilds despite having only thirty members. But those thirty were all elites ranked in the top one hundred magicians globally.\n\nTheir guild master, Bondre, was particularly formidable. A month ago, he'd held first place in the magician rankings and eleventh on the unified rankings. The Overgeared members' recent rise had pushed him down to seventeenth, but no one questioned his strength.\n\nWell. Except Grid. Grid had logged Bondre out in four seconds during the National Competition.\n\nThat humiliation had lit a fire under Bondre. He'd thrown himself into acquiring more S-grade magic, pouring every resource he had into the effort. Money. Time. Sanity. The result was a version of himself far more powerful than the one who'd been embarrassed on the international stage.\n\nThree S-grade spells. That was his current arsenal. Nine months until the Second National Competition in France, his home country. He'd get his revenge there. Thoroughly. Publicly. Perfectly.\n\n\"I'll log you out in three seconds.\" Bondre's grin was manic as he led his guild through the thorny vine forest. \"But first, today I'll shatter your estate.\"\n\nGrid was the lord of Reidan. Bondre intended to reduce that city to rubble. All the development of the past months? Gone. The infrastructure? Demolished. The resources? Scattered to the winds.\n\n\"I'll make you crumble! Kuhahahaha!\"\n\n\"The disease has returned,\" one guild member muttered.\n\nOthers nodded. Their master had been like this ever since the National Competition. They missed his old, sane personality.\n\n\"Wait.\" A guild member near the front raised a hand. \"What's that?\"\n\nThe path ahead was blocked. Not by terrain, but by people. Hundreds of them. Refugees, from the look of their ragged clothes and gaunt faces, standing in a mass that choked the narrow passage through the vines.\n\n\"Don't they look like refugees?\" someone asked.\n\n\"Terrible timing,\" another complained.\n\nThey were close. So close to Reidan. But nine hundred refugees would slow their advance to a crawl. Frustration rippled through the group.\n\n\"Kill them.\" Bondre's voice was flat.\n\nSeveral guild members winced. \"Master, our infamy will skyrocket if we massacre that many people. We won't be able to play normally for weeks.\"\n\n\"Please calm down.\"\n\n\"Shit! Shit! Shit!\" Bondre's hands clenched and unclenched. \"I want to smash Reidan right now!\"\n\n\"We can fly over them!\" A guild member pointed upward. \"Look, we're magicians. We don't need to push through on foot.\"\n\nThe reminder seemed to penetrate Bondre's rage. He took a long breath and nodded. \"Fine. It'll drain mana, but that's better than wasting time on a slaughter.\"\n\n\"Float.\"\n\nBondre activated Fly, his body rising smoothly into the air. The other guild members followed suit, their robes billowing as they ascended above the refugee mass.\n\nA hand shot out from the thorny vines.\n\nIt wrapped around a guild member's ankle and yanked him sideways. The magician's scream was cut short as he vanished into the foliage.\n\n\"Eh?\"\n\nThe guild stared. Shock rendered them motionless for a critical second.\n\n> [Your party member Ren has died.]\n\n\"What?\"\n\n\"This is insane!\"\n\nBondre whirled toward the vines. His hands moved through casting gestures, magic coalescing between his palms. \"You bastard!\"\n\n**Kwajajajajak!**\n\nIce bombs detonated in a chain, flash-freezing the vines before shattering them into crystalline fragments. Ren's corpse tumbled into view, throat slit, eyes still wide with surprise.\n\n*Where?*\n\nBondre scanned the area. The other guild members did the same, eyes darting, searching for any hint of the killer. Nothing. No movement. No shadow out of place.\n\n*Puk!*\n\nSomething wet hit the ground. A guild member collapsed, a dagger buried in their spine.\n\n> [Your party member Silver has died.]\n\nColor drained from Bondre's face. One of their own had died right next to them, and they still couldn't detect the enemy. It was like fighting a ghost.\n\n*Assassin.*\n\nA powerful one. Strong enough to kill level 290+ magicians without being detected by Bondre's level 303 senses. That level of skill was rare. Almost unique.\n\n*Faker?*\n\nThe thought sent ice through Bondre's veins.\n\n\"We need to leave! Get out of the forest now!\"\n\nAssassins were the natural counter to magicians. Low health, low defense, low agility. Magicians had no answer to swift killers in close quarters. Fighting in this dark, obstacle-filled terrain was suicide. They needed open ground. Space to maneuver and cast.\n\nThe Ice Flower Guild cast Haste in unison. Their movement speed doubled as they fled toward the forest's edge.\n\nBut the figure in the darkness had no intention of letting them escape.\n\nDaggers flew from the shadows. Silent. Precise. Lethal."
}