{
  "id": 248,
  "title": "Chapter 248",
  "content": "# Chapter 248\n\nAsk any member of Overgeared who they trusted most, and the answer came without hesitation: Faker.\n\nWhile the rest fought in the light, he hunted in the dark. Shadows became his domain. The tip of his dagger found throats before enemies knew they were marked. When Faker spoke, his words carried weight. No wasted breath. No empty threats.\n\n\"You will die here today.\"\n\nFive minutes into the ambush, Faker stepped from the undergrowth. Blood still dripped from his blade.\n\nBondre's face twisted. \"Faker!\"\n\nFive minutes. A bathroom break. Nothing more. In that span, eleven of his people had died. The magicians' shields meant nothing. That damned dagger cut through barriers like they were smoke.\n\n\"What are you doing here?\" Bondre's voice climbed higher with each word. \"How did you know we'd pass through this route? How did you even know about the invasion?\" He jabbed a finger at the assassin. \"You planted a spy.\"\n\n*Spy?* Faker's expression didn't change. There was no spy. Just bad luck on Bondre's part. This thorny forest was the safest path for moving refugees without drawing Imperial eyes. The Ice Flower Guild had walked straight into his route.\n\nPure coincidence. Not that Bondre needed to know.\n\nSilence stretched between them.\n\n\"Damn you!\" Red crept up Bondre's neck. \"Ignoring me now?\"\n\nThe ground trembled. Six massive ice pillars erupted from the earth, their surfaces gleaming in the filtered sunlight. Minutes ago, Bondre had used this same spell to flatten half the forest, forcing Faker to abandon cover.\n\nBondre stood at the center of a vortex of frost. \"This is one of the spells I saved for Grid.\" His breath misted in the sudden cold. \"Let's see if you can handle it.\"\n\n**Ice Dragon's Fury.** S-grade magic.\n\nThe six pillars lifted from the ground, rotating through the air like dragons in flight. Their shadows swept across the forest floor.\n\n\"I'll kill you before I ever reach Reidan!\"\n\nThe pillars struck from every angle. Speed, power, range. The magic lacked nothing except efficiency. It devoured mana, but Bondre's reserves ran deep.\n\n*His cover's gone. He's dead.* Bondre's fingers twitched in anticipation. *Come on. Show me what the bastard who stole my 11th rank can do.*\n\nWide-area spells countered speed. No time to dodge. Low damage compared to single-target magic? Irrelevant. Assassins had paper-thin health, same as mages. One solid hit meant...\n\n\"What?\"\n\nBondre's certainty cracked.\n\nFaker moved left.\n\nThe first pillar shattered empty ground.\n\nRight.\n\nThe second missed by inches.\n\nLeft again.\n\nStone and ice exploded where Faker had been standing.\n\nThen up. While six pillars spun like blender blades, Faker blurred into afterimages. The frigid air that should have slowed him may as well have been summer wind.\n\n*How high is his agility?* \n\nBut it wasn't just stats. Speed without control was useless, a waste of potential. Faker didn't just control his movement. He *owned* it. Every step precise. Every shift calculated.\n\n*Godly con...*\n\nThe word died in Bondre's throat. That term belonged to one player. Kraugel. Only Kraugel.\n\nUntil now.\n\nFaker's thoughts drifted to Grid as he moved. *Your work never disappoints.*\n\n**Wind God's Leather Armor.** Grid had crafted it from a production method Faker discovered. The original specs boosted agility by 6% and all speeds by 12%. Grid's version? 8% agility, 15% speed.\n\nThe difference showed.\n\nMore afterimages spawned with each passing second. **Master of Swiftness** demanded perfect control, the highest skill ceiling of any third advancement class. Combined with Grid's items, Faker's capabilities doubled.\n\n\"Impossible!\"\n\nThe six pillars began to slow. Faker accelerated. To watch him was to court vertigo. The Ice Flower members started casting, desperate to pin him down.\n\nDaggers whistled through the air. Mages stumbled, their concentration broken. No pattern to predict. Just chaos. Faker weaved through the large-scale spells while his thrown blades shut down everything else.\n\n*This is broken.* Bondre's jaw clenched. *The rumors said he was good. Why is he better than the rumors?*\n\n**Ice Dragon's Fury** finally collapsed, its duration spent.\n\n\"Use your orbs!\" Bondre's shout cracked. \"Now!\"\n\nStored spells activated instantly. No casting time. But the mages hesitated. Orb spells were emergency reserves, last resort options saved for—\n\nThis was the emergency.\n\nFire, ice, lightning, stone. Every element manifested at once, converging on Faker as he dodged between the fading ice pillars. Spells hammered his position.\n\n\"We got him!\"\n\nThey'd hit an afterimage. The real Faker stood untouched nearby, his health barely scratched.\n\n\"Damn it!\" Bondre activated **Double Casting**, weaving two spells simultaneously.\n\nFirst, an ice barrier erupted in a circle, contracting to limit movement.\n\nThen the **Ice Spider Web** unfurled, its colorful strands freezing the air itself.\n\nThe other mages layered their magic on top.\n\n*Let's see you escape this.*\n\n**Master of Swiftness** had clear limits. No shadow-walking like a **Master of Shadows**. No defensive abilities. Just speed. Lock down the speed, and the class became worthless.\n\nFaker's hand dipped to his belt.\n\nSmoke bombs hit the ground. Thick gray clouds swallowed him whole.\n\nBondre laughed, the sound harsh and triumphant. \"Got you now! That web won't let you move!\"\n\nWind mages cast their spells. The smoke cleared.\n\nThe **Ice Spider Web** gleamed in the sunlight, empty.\n\n\"Where...?\"\n\nBondre spun. The other mages looked at each other. Flat ground. No cover. No shadows deep enough to hide in.\n\n*He dug a tunnel. Has to be.* Bondre's lip curled. *Pathetic.*\n\nDetection magic spread outward.\n\nThe spell painted a picture. Faker's presence, directly behind him.\n\nA blade kissed Bondre's throat. At the same time, white fabric fluttered to the ground. The hooded zip-up Faker had worn.\n\n\"Invisibility cloak.\"\n\nThe realization hit the Ice Flower Guild all at once. Faker was Overgeared. That meant items. Grid's items.\n\n\"Shit.\"\n\nThe dagger sank home.\n\nBondre collapsed. Under the blazing sun, red droplets caught the light, painting the gleaming spider web like flowers in bloom.\n\n***\n\nBunny Bunny once commanded audiences of 150,000 concurrent viewers. Best gaming broadcaster in the world. That title felt like ancient history. These days, 30,000 viewers was a good day.\n\nHe needed a comeback. Fresh content. Something provocative that grabbed attention and didn't let go.\n\nHis network had come through. The seven great guilds were moving as one, targeting Reidan.\n\n\"Good quality. Good angle.\" Bunny Bunny adjusted his recording settings.\n\nPatrian's fortified walls rose behind him. Beyond them lay the western territories of the Eternal Kingdom. He activated video recording and zoomed in on the **Yak Guild** and **Zeraph Guild**. Two hundred members, easy. Bunny Bunny checked his surroundings before whispering his narration.\n\n\"See them? Can't confirm IDs because of the masks, but the profiles match. Yak Guild and Zeraph Guild. My intel was solid.\"\n\nHe kept his distance.\n\n\"They're moving. I'll tail them, stay out of detection range.\"\n\nGetting caught would be bad. The seven guilds wanted this quiet. Why? Shame. Seven of Satisfy's greatest guilds, united to crush one city. Not exactly a story that boosted reputations.\n\n\"Bubat's covering his face, but you can tell it's him. Guy's built like a bull. Wait. What's this?\"\n\nBunny Bunny stopped. Ahead, dozens of knights blocked the road. The two guilds ground to a halt.\n\n\"What's happening? Why are knights stopping them? Curious? Me too. Let me get closer. For you, viewers. I'm risking it all.\"\n\nLevel 209 assassin. **Stealth** active. He slipped from cover to cover. The guilds were too focused on the knights to notice one more shadow.\n\n\"What are you doing?\" A Yak Guild member called out. \"Why are you blocking the path?\"\n\n\"Move aside.\" Another voice, sharper. \"Now.\"\n\nThe knights said nothing. They stood in formation, an iron wall of bodies and steel.\n\nBubat shouldered his way to the front. \"Why are you preventing us from using the gate?\" His massive frame loomed over the knight commander. \"Give me a reasonable explanation, or I'll break through.\"\n\nA voice cut through the tension.\n\n\"You have no right to ask questions.\"\n\nA middle-aged man in white robes emerged from behind the formation. The name above his head read **Ashur**.\n\n*Earl Ashur.* Bunny Bunny's breath caught.\n\nOne of the continent's 10 great magicians. Why was someone of his stature here?\n\nEarl Ashur studied the guild members like insects. \"Why do you want to go west?\"\n\n\"We don't have to answer that,\" Bubat said.\n\n\"Don't you?\" Ashur released his magic power.\n\nThe air turned heavy. Invisible pressure crushed down on the guild members. Several fell to their knees. Breathing became work.\n\nEarl Ashur's golden eyes gleamed with contempt. \"It is natural for you to answer my questions. There is no need to discuss why.\" He paused. \"Understood?\"\n\n\"What... what is this?\" Bubat's voice strained against the weight pressing on his chest. \"Why?\"\n\nIt made no sense. The situation defied logic.\n\n\"I'll ask again.\" Ashur's tone sharpened. \"Tell me why you are going west.\"\n\nMagic sensors throughout Patrian fed information to Earl Ashur constantly. He already knew about the planned invasion of Reidan. But he wanted to hear them say it. Wanted to watch them squirm.\n\nBubat tried to lie. \"We're hunting in the area...\"\n\n\"Hunting.\" Ashur's laugh was cold. \"An obvious lie. You remind me of another lying bastard from the past.\"\n\nEarl Ashur's son was in Reidan. Nothing would harm that city while his blood remained there.\n\n\"I'll give you a choice.\" Magic crackled around his fingertips. \"Turn back the way you came, or I'll bury your bones in my city.\"\n\nSteel sang as dozens of knights drew their blades. On the walls above, soldiers nocked arrows. Earl Ashur stood behind them, his arrogance absolute.\n\nBunny Bunny kept recording, his hands trembling with excitement.\n\n*Earl Ashur is Duke Grid's ally.* \n\nOne of the continent's 10 great magicians, loyal to a user. This was the scoop of the century. Broadcasting this footage would bring viewers flooding back.\n\nHis comeback started now.\n\n***\n\n**Glossary of Common Korean Terms**\n\n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}