{
  "id": 249,
  "title": "Chapter 249",
  "content": "# Chapter 249\n\nBubat, master of the Yak Guild, had built his reputation on bold decisions and devastating crowd control. When he led the charge, the battlefield bent to his will. Opponents called him the man who promised victory with every engagement.\n\nThen came the National Competition.\n\nYura dismantled his techniques with raw athleticism. Grid ignored his crowd control entirely, his legendary class shrugging off effects that should have locked him down. Bubat had swallowed the bitter taste of helplessness twice in as many days.\n\nHe'd spent the months since then hunting, grinding, perfecting his craft. New skills. Higher levels. Sharper control. If he faced either of them again, he'd be ready.\n\nInstead, he found himself broken before Earl Ashur.\n\n\"Your skills are pathetic.\"\n\nThe Earl's words cut deeper than any blade. Bubat's armor was scorched, his health bar trending toward critical. Earl Ashur's white robes remained pristine.\n\n*One of the continent's ten great magicians.* Bubat clenched his jaw. *A walking nuclear deterrent.*\n\nThe rumors hadn't done the man justice.\n\nEarl Ashur raised one hand. Lightning crackled between his fingers. His other hand moved in a subtle gesture, and water vapor coalesced from the air itself.\n\n\"I'm not someone that small fries like you can dare to look at.\"\n\nThunder rolled across the sky. The vapor spread in a widening cloud, and then the storm struck. Electricity arced through the Yak and Zeraph Guild members caught in range. Arrows rained from the walls above. Knights charged into the chaos, weapons flashing.\n\nBubat roared. He shook off the paralysis and shoulder-checked two knights, sending them sprawling. Dio, the knight with a blue rose between his teeth, met him blade to mace. They traded blows, neither giving ground.\n\nEarl Ashur watched with the detachment of a man observing insects.\n\n\"Planning to invade Reidan with such skills?\" He snapped his fingers. \"You should reevaluate. Don't you know? There is a monster at Reidan.\"\n\nFire erupted from his fingertips. Not in a single lance, but in a continuous barrage. C-grade magic shouldn't hit this hard. Shouldn't come this fast. But Earl Ashur made a mockery of conventional limitations.\n\nThe fireballs struck like artillery. Guild members screamed as flames consumed them. The ground shook. Wind howled.\n\nTwo of Satisfy's seven great guilds collapsed under the assault of a single NPC.\n\nBunny Bunny captured it all in high definition, cackling behind his camera. \"Amazing! Amazing! Puhahaha!\"\n\n*This is it.* His hands shook with excitement, not fear. *Maximum viewership, here I come.*\n\n***\n\nReis, the last surviving member of the Ice Flower Guild, clawed at the dirt. His vision swam. His health bar blinked red, then empty.\n\nHe collapsed.\n\nThirty members. One of the seven great guilds. All of them, gone. Erased by a single assassin.\n\nThe timing had worked too well for Faker. The gap between second and third advancement classes was widening every day now. Only Bondre had reached the third tier among the Ice Flower members. Only Bondre could have challenged Faker on even footing.\n\nBut Bondre was a magician. Faker was an assassin. The matchup was poison.\n\nThree months ago, the outcome might have been different. Three months from now, perhaps. But today, in this moment, Faker stood alone against thirty and won.\n\n> [Your stamina is depleted.]  \n> [You won't be able to take any action.]\n\nFaker's legs gave out. He hit the ground like a puppet with severed strings. Master of Swiftness devoured stamina faster than any class in the game. Grid had been working on equipment to compensate, but nothing had materialized yet.\n\nFaker's hands shook. He pushed himself to his knees.\n\n*I have to move.* He gritted his teeth. *Only me.*\n\nBased on what the Ice Flower members had said before they died, seven guilds were converging on Reidan. The Overgeared members were scattered. The mine expedition. Personal quests. Jishuka in Bairan. Reidan was empty except for the NPCs.\n\n*I'm all that's left.*\n\nHe tried to stand. His body refused. He pitched forward into the dirt.\n\n> [Stamina: 0]\n\nNo amount of willpower could override the system.\n\n\"Grid...\" The name came out as a rasp.\n\nIf Grid were here, this would be different. Faker's expressionless mask cracked. Despair and frustration bled through.\n\nFootsteps approached. The Ul Clan emerged from their hiding places, fear warring with concern on their faces. At first, they'd been terrified of the assassin. Now they rushed to help him.\n\nThe whispers would start today. Spread by merchants and travelers who witnessed the aftermath. A legend was born in this forest.\n\n*Faker. The man who destroyed an entire guild alone.*\n\nAnd Grid's reputation would rise with it.\n\n***\n\nMinutes before Faker's ambush, Lauel had received the whisper.\n\n*-The seven guilds are heading to Reidan. Ice Flower is in the thorny vine forest. I don't know where the other six are.*\n\nLauel's hand clenched around thin air.\n\n*Seven guilds.* The blood drained from his face. *When Reidan is empty.*\n\nSomeone had fed them intelligence. Someone knew the exact moment to strike.\n\n*I got complacent.* His nails bit into his palm. *I should have been more thorough. Counter-intelligence. Spy sweeps. This is my failure.*\n\nHe didn't want to tell Grid. Couldn't bear to. Grid had trusted him with everything.\n\n\"Shit...! Shit!\"\n\n\"Lauel?\" Vantner jogged over, concern creasing his features. \"What happened?\"\n\nAlzar Mountain sprawled around them. The rest of Overgeared was clearing monsters near the mine entrance, unaware. Lauel took a breath and forced the words out.\n\n\"The seven guilds are heading to Reidan.\"\n\nThe color drained from Vantner's face. \"What?\"\n\n\"Damn it!\" Vantner slammed his shield into the ground. \"What do we do? It'll take half a day to get back!\"\n\nLauel turned to Huroi. \"Your drake. How many can it carry?\"\n\n\"Three people.\"\n\nThree hours to Reidan by air. Lauel scanned the assembled members. Pon and Regas were deep in a dungeon, communications down. Faker was on assignment. Jishuka was in Bairan.\n\nThat left him with second-tier options.\n\n\"Vantner and Toon.\" Lauel met their eyes. \"Go with Huroi. If the attack hasn't started when you arrive, coordinate with Jude. Fortify what you can.\"\n\nHe paused. The next words tasted like ash.\n\n\"If they're already inside... abandon Reidan. Save Khan. Rabbit. Piaro. Jude. Those four are priority.\"\n\nVantner's jaw worked. \"I understand...\"\n\n*I want to say no.* Vantner's knuckles whitened around his shield grip. *I want to say I'll defend it myself.*\n\nBut Lauel spoke with Grid's authority. Vantner had chosen Grid as his leader. He wouldn't undermine that now.\n\n\"Let's go!\"\n\nThe drake's wings beat the air. Huroi, Vantner, and Toon lifted off, shrinking rapidly against the sky.\n\nLauel turned to the rest. \"We move. Don't conserve stamina or mana. Our goal is speed.\"\n\nThey'd arrive too late. Reidan would be burning.\n\n\"We're going to kill every last one of them.\"\n\nGrid would be the first user king. Untouchable. Anyone who thought otherwise would learn the price.\n\n***\n\nZibal stood at the edge of Reidan's wheat fields and sneered.\n\n\"Developing such a large city as an agricultural center.\" He shook his head. \"Grid has no talent for internal affairs.\"\n\nA legendary class. That's all Grid had. The man wasn't king material.\n\nZibal raised his hand. \"Burn it. All of it.\"\n\nThe other guilds hadn't arrived yet, but he didn't care. The magicians began their incantations, fire magic building in their palms.\n\n\"Who are you?\"\n\nZibal turned.\n\nFour farmers stood at the field's edge, hoes resting on their shoulders."
}