{
  "id": 25,
  "title": "Chapter 25",
  "content": "# Chapter 25\n\n\"Go to hell! Johnson's enemy!\"\n\n*Buuuong.*\n\nThe explosive crack of impact rang out. Grid ducked low. His breath came in ragged gasps as sweat stung his eyes.\n\n*Kwang! Kwajajak!*\n\nThese bastards hit hard enough to shatter stone walls. Grid dodged left, then right. The attacks were slow. Predictable. But his concentration was a flickering candle in a storm.\n\n*How long can I keep this up?*\n\nOne of the gangsters raised a hand.\n\n\"Attack at the same time.\"\n\n\"Ohhhhhh!\"\n\nWeapons converged from every angle.\n\n> [You have received 150 damage.]\n\n> [You have received 163 damage.]\n\n\"Urghh.\" Grid stumbled. His vision blurred at the edges.\n\nThe health bar plummeted. Twenty-three points remained.\n\n*Crazy. They weren't even critical hits.*\n\nHis fingers fumbled in the inventory. The glass vial of intermediate health potion felt cool against his palm. He yanked the cork with his teeth and swallowed.\n\n> [Health restored by 1,500 points.]\n\n*My maximum health is way less than 1,500, but this is the cheapest potion I have. Should've bought inferior ones...*\n\nTwenty seconds. The potion cooldown was twenty seconds. Grid rolled away from a descending mace.\n\nThe gangsters pressed forward in coordinated strikes.\n\n\"We've been fighting together for ten years. No matter what you try, you're dead!\"\n\nGrid sidestepped. A greatsword whistled past his ear. He shifted his weight to dodge the follow-up, but his instincts screamed a warning.\n\nA mace aimed for his knees.\n\n*Unavoidable.*\n\n\"Kuk!\"\n\nGrid nocked an arrow and fired downward.\n\n*Kaaang!*\n\nThe Special Jaffa Arrow struck the mace head-on. Physics won. The arrow was too light, the mace too heavy. The trajectory barely shifted.\n\n*Kwajak!*\n\nPain exploded through Grid's leg.\n\n\"Kuaaaak!\"\n\n> [You have received 200 damage.]\n\n> [Your left leg is severely damaged. Movement speed decreased by 40%. Body control reduced.]\n\nGrid collapsed. Above him, a sword began its descent toward his skull. He gritted his teeth and rolled.\n\n*Kakakakak!*\n\nThe floor where he'd been lying shattered into fragments. Grid stared up at the gangsters.\n\n*I'm going to regret this.*\n\nHe pulled two more potions from his inventory. Intermediate strength. Intermediate agility. Ten gold each. Twelve thousand won. Each.\n\n*I'm sorry. I can't help it.*\n\nGrid closed his eyes and poured twenty-four thousand won down his throat.\n\n*Gulp gulp.*\n\nTears welled up as the liquid burned.\n\n*Ahh! This costs more than sweet and sour pork!*\n\nHe'd been saving these for Earl Ashur's quest. For a boss monster. Not for some B-grade mob quest.\n\n> [Strength increased by 50 for five minutes.]\n\n> [Agility increased by 50 for five minutes.]\n\nThe notification windows popped up. Two gangsters lunged.\n\n\"Son of a bitch! Don't think you're safe while chugging!\"\n\nGrid's enhanced reflexes kicked in. He twisted between the strikes and jabbed his arrow forward. Two more attacks converged. He gave ground.\n\n\"Pant pant. R-really horrible.\"\n\n*Would've died without that agility potion.*\n\nHis heart hammered against his ribs. The gangsters snarled.\n\n\"This rotten bastard! How long will you run?\"\n\n\"Where's your momentum now? What a shameful brat! Fight fair.\"\n\nGrid barked a laugh. \"Hey, you fuckers have no conscience! Four on one and you're talking about fair?\"\n\n\"We'd still win one-on-one.\"\n\n\"Then let's do it!\"\n\n\"Bullshit! Being able to fight in groups is a virtue.\"\n\n*Chwaruruk!*\n\nThe flail snaked out.\n\n*Tatatang! Tang!*\n\nGrid deflected it with his arrow shaft and spun. A greatsword scraped his ribs.\n\n> [You have received 30 damage.]\n\n*Barely avoided that.*\n\nThe crisis passed. Grid forced a grin. \"Hey guys, let's talk honestly. You know by now I'm not a pushover, right?\"\n\nSilence. The gangsters exchanged glances but didn't argue.\n\nGrid pressed on. \"Hand over the contract. No one else has to die.\"\n\n\"What?\"\n\nThe lead gangster's face purpled. \"Don't play games! You think you're leaving alive after killing Johnson? Don't worry about the contract. You die here.\"\n\n\"Too scared to step forward? You'll regret this. Hand it over and you can walk out breathing.\"\n\n\"Hahat! Stop talking nonsense! A cripple with a broken leg acting tough. We're leaving alive. You're the corpse.\"\n\n\"Hrmm. Will that really happen?\"\n\nThe potion cooldown had reset. Grid turned slightly, blocking their view with his shoulder, and drank.\n\n> [Health fully restored.]\n\n> [Left leg fully healed.]\n\n*Now.*\n\nThey thought he was still injured. Grid's lips curled. He burst forward and drove the arrow into the nearest gangster's exposed side.\n\n\"N-No?\"\n\n*Too slow.*\n\n> [Critical!]\n\n> [Special Jaffa Arrow effect activated. Enemy defense completely ignored.]\n\n\"Keeok!\"\n\n> [You have defeated Winston's outlaw, Neil.]\n\n> [Reputation in Winston Village increased by 60.]\n\n> [4,300 experience acquired.]\n\n> [Level Up!]\n\n> [Level Up!]\n\n> [Level Up!]\n\n*Yes!*\n\nThe gangster dissolved into grey light before his scream finished. The remaining three stared.\n\n\"You. You bastard! How is your leg healed? D-Don't tell me you drank a potion?\"\n\nGrid blinked. \"Didn't you watch me drink it?\"\n\n\"You stupid bastard! Fight with your own body!\"\n\n\"Bullshit! You're gangsters bullying an innocent citizen!\"\n\nThe leader's face twisted. \"Kill him! Kill that brat now! He's like a cockroach. Keep attacking until he's dead!\"\n\n\"Isn't he just a druggie? I'll crush him!\"\n\nVeil shouted. \"The 'You will Die' formation!\"\n\n*Worst naming sense ever.*\n\nThe villains charged.\n\n*Kwa kwa kwa kwang! Chukak. Bam!*\n\nThey abandoned defense entirely. Grid aimed for a heart. The target didn't even flinch, just kept swinging.\n\n\"Kuk!\"\n\nEven with an arrow in his chest, the gangster attacked. Grid found himself retreating.\n\n> [You have received 203 damage.]\n\n> [You have received 180 damage.]\n\n*Chwaruruk! Buuuong. Kwaang!*\n\nThe greatsword user pressed forward. The mace wielder smashed terrain to throw off Grid's footing. Thirteen seconds left on the potion cooldown. His health bar was red.\n\n*This is my limit. I can't keep this up.*\n\nUnless Legendary Blacksmith's Patience activated. Unless his defense tripled. There was no way out.\n\n*The end...*\n\nThen a thought struck him.\n\n*Why am I relying on potions and skills?*\n\nHe wasn't a warrior. He was Pagma's Descendant.\n\n*Where am I right now?*\n\nA smithy.\n\n*I'm such an idiot. Why didn't I think of this earlier?*\n\nWeapons and armor lined every wall. The solution had been staring at him the entire time.\n\n\"Khan!\"\n\nThe old blacksmith jerked upright in the corner. \"Speak.\"\n\nGrid dodged another strike. \"Do you want to keep this smithy?\"\n\n\"Of course! I gave up before, but you changed my mind. If you help me, I can keep this place!\"\n\n*Good answer.*\n\n\"Hey! What are you doing? Chatting with that old man instead of fighting? Planning some trick?\"\n\n*Kwa kwa kwang!*\n\nThe offensive continued. Grid sidestepped a mace and hurled his arrow at the largest gangster.\n\n*Swaeek!*\n\nThe Special Jaffa Arrow flew true. Praga, sensing danger, raised his weapon to block.\n\n> [Critical!]\n\n*Chaaeng!*\n\n\"Wah!\"\n\nThe impact sent Praga staggering backward. The other two didn't slow. Grid spun and ran.\n\n\"Kuhahahaha! Stupid! You threw away your weapon.\"\n\nThey chased him. Praga recovered and joined the pursuit. Grid never looked back. He took the stairs two at a time.\n\nThe second floor.\n\nA suit of brilliantly shining full plate armor stood on display. Beside it, a greatsword three meters long caught the lamplight.\n\nGrid shouted down to the ground floor. \"Khan! Lend me this equipment!\"\n\n\"B-But...\"\n\n\"I'll return it after the fight! If you want to keep your smithy, give me permission!\"\n\nTaking items without consent meant a criminal flag. Grid waited. Khan hesitated.\n\n*Frustrating.*\n\n\"Not just anyone can use that! Take the leather armor and blacksmith hammer instead. Those suit you better.\"\n\n\"No. Just lend me this.\"\n\n\"B-but that battle gear...\"\n\n\"Kihahaha! Finally caught you. Die!\"\n\nThe gangsters pounded up the stairs. Khan's eyes widened. He nodded frantically.\n\n\"Y-Yes! If you can use it, go ahead!\"\n\n\"Good. Should've said that sooner.\"\n\n> [Due to class characteristics, you have equipped Dainsleif (Reproduction).]\n\n> [Penalty applied. Item conditions not met.]\n\n> [Attack power reduced by 20%. Only half of option effects applied.]\n\n> [Penalty reduces as understanding increases.]\n\n> [Due to class characteristics, you have equipped Valhalla.]\n\n> [Penalty applied. Item conditions not met.]\n\n> [Defense reduced by 20%. Only half of option effects applied.]\n\n> [Penalty reduces as understanding increases.]\n\n---\n\n**Glossary of Common Korean Terms:**  \n**OG:** Glossary Link.\n\n**Current schedule:** 16 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}