{
  "id": 252,
  "title": "Chapter 252",
  "content": "# Chapter 252\n\nSeuron's stomach dropped. The farmer wasn't panicking. He was *laughing*.\n\n*Why is he acting so freely?*\n\nThe realization hit like cold water. *He's a named NPC.*\n\n\"Stop!\" Seuron barked.\n\nToo late. Three vanguard members closed in and swung their blades at the farmer.\n\n**Kwakakakang!**\n\nA sickle, barely forty centimeters long, swept through the air. The farmer blocked all three strikes with a single motion. He predicted where each opponent would attack and responded with surgical precision. The Golden Guild members froze. It felt like their minds were being read.\n\n**Chaaeng!**\n\nThe farmer twisted the sickle. Three swords flew upward, dragging their wielders' arms with them. Gaps opened in their defenses. One farmer had overwhelmed the combined strength of three warriors.\n\nMore than that. This wasn't brute force. He had maximized his own power by redirecting theirs.\n\n*Does this make sense?*\n\nThe Golden Guild members stood paralyzed. They felt like insects trapped on the farmer's palm. Then he attacked.\n\n**Puk!**\n\n\"Kuaaaak!\"\n\nThe sickle found every gap in their armor. Blood welled from shallow cuts. The damage was minimal compared to Piaro's furious slaughter across the field.\n\n\"This isn't a match for my skills.\"\n\nKraugel dropped the sickle and drew a silver sword. Three necks opened. Three bodies fell. The dying men glared at Seuron with their final thoughts.\n\n*Calling him a hole...*\n\n*Master, how is that a hole...? Damn...*\n\n\"Crazy!\" Seuron spat.\n\nHis mind reeled. What the hell was this area? Why were the farmers so strong? It defied all logic. Alice stumbling through a nightmare world. He lost his grip on reason and the curses poured out.\n\n\"How rotten! What is this farmer? Does this mean soldiers can be dragon slayers? Dammit! Does this make sense?\"\n\nWhat magic did that bastard Grid possess to attract all these talented people? And why were they working as *farmers*? No matter how he turned it over in his mind, nothing made sense. His chest felt ready to explode.\n\nHis eyes turned bloodshot. The farmer tilted his head.\n\n\"The damage will only increase if you send out your members. Isn't it better for the master to go out directly?\"\n\nSeuron's jaw clenched. The farmer was right. Those three vanguard members were level 230, higher than most of the guild. Sending more would only stack corpses. But retreat? Impossible. Their enemy stood right there. If the guild master turned his back, dignity and authority would crumble.\n\nSeuron had to fight. He studied the farmer. Definitely weaker than the monster Piaro.\n\n\"Come. I will kill you myself.\"\n\nFirst, he would rip off that straw hat. Then he would watch the bastard bleed out. Seuron activated **Soul Exploitation** on the three fresh corpses. Green light coalesced into **Soul Arrows**.\n\n**Pepepeng!**\n\nThree arrows screamed through the air. Formidable speed, but nothing compared to Jishuka's shots. Nothing that could threaten Kraugel. He shifted his head. The arrows sailed past.\n\nSeuron didn't panic. He smiled.\n\n\"**Soul Explosion!**\"\n\n**Kwa kwa kwa kwang!**\n\nThe three arrows detonated behind Kraugel. A unique skill that dealt damage proportional to both attack power and magic power. Seuron waited for the smoke to clear and reveal shredded meat.\n\nThe farmer emerged. Minor burns. Nothing more.\n\n\"Your skill linkage is delayed,\" Kraugel said. \"So it's easy to react. Would you like to practice so you can link it faster?\"\n\n\"Nonsense!\"\n\nThe linkage was already optimized. Fast enough. Perfect timing. Every other opponent died from this combo.\n\n*You are the strange one!*\n\nSeuron bit back the words.\n\n\"What are you trying to teach me?\"\n\nHis pride stung like an open wound. He summoned a weapon from inventory.\n\n> [<span class=\"rarity-legendary\">Brutal Heavy Sword</span>]\n\nThe reward from clearing Vasco's labyrinth with his guild. A legendary one-handed blade that raised both **Strength** and **Intelligence** simultaneously. Perfect for a Soul Predator whose skills scaled with attack power and magic power.\n\nSeuron gripped the sword. Kraugel met it with White Fang.\n\n**Kaaang!**\n\nSparks erupted where the weapons collided.\n\n**Chaaeng! Chaeeeeeng!**\n\nThirteen exchanges on the ground and in the air. Seuron's cloak and Kraugel's straw hat crossed paths in a brilliant dance of steel. Kraugel's eyes gleamed.\n\n*He's a good swordsman. High Sword Mastery level.*\n\nSoul Predator. The skill tree appeared magician-type, but fought closer to a magic swordsman. Seuron activated **Soul Transference**.\n\n**Chaaeng!**\n\nEnhanced attack power surged through Seuron's frame. The sword grew heavier in his hands. Yet he couldn't overwhelm Kraugel. Kraugel had taught himself the way of steel. He moved like water and subdued force with technique.\n\n\"Eek!\"\n\nSeuron's anger flared as the fight refused to follow his script. But losing consciousness in battle was suicide. He fought for calm. Reason and emotion warred inside his skull. Reason won by a hair.\n\nSeuron's blade regained its composure.\n\n\"I will win! **Soul Plundering!**\"\n\nThe skill description flashed in his mind.\n\n> **[Soul Plundering]**  \n> Takes away part of the target's soul. The opponent will find their body hard to control for a certain period.\n\n*A good skill.*\n\nKraugel registered the thought as the heavy sword crashed into his shoulder. Originally aimed at his heart. Kraugel had minimized the damage.\n\n*Moving without a soul!*\n\nThe farmer grew stronger the more Seuron analyzed him. Doubt crept into Seuron's bones.\n\n*I thought I was stronger...!*\n\nSoul Predator was a combat-specialized class. A variety of powerful skills. Kraugel and Agnus didn't participate in external activities, so they didn't count. But compared to the current Overgeared members and Grid, Seuron had been convinced he was the strongest.\n\nNow an NPC was grabbing his ankles. Maybe he was weaker than he thought.\n\n*I need to focus on leveling up for a while.*\n\nSeuron made the decision while Kraugel examined his injury with growing excitement.\n\n*It's more than rumored.*\n\nKraugel valued the Soul Predator class and Seuron's swordsmanship highly. One of the strongest users he'd met.\n\n*Fun.*\n\nOriginally, Kraugel had no interest in PvP. Only adventuring, hunting, and raids. But living with Piaro changed that. Fighting the strong was exhilarating. PvP had a different flavor from raids. This process connected directly to becoming a sword saint. Next year, the National Competition might be worth attending.\n\n\"Kukukuk.\"\n\nKraugel laughed as blood ran down his shoulder. Seuron stared.\n\n*What is this?*\n\nThe farmer looked insane, laughing at his own blood. Kraugel approached. The sky above the sky. The title for someone with true talent who reached infinite heights.\n\n\"**Moonrise Sword.**\"\n\n\"...!\"\n\nSeuron realized it in that instant. The farmer hadn't used any skills until now!\n\n**Susuk. Sususuk.**\n\nTwo moons hung in the night sky. Kraugel activated the stealth function as he stood beneath the moonlight. Seuron forced himself to concentrate. He couldn't afford to lose track of Kraugel. But how could he detect what even Piaro couldn't?\n\nKraugel vanished completely. Seuron's fear spiked. He consumed the souls of five Snake Guild members and activated **Soul Armor**.\n\n**Pahat!**\n\nTransparent green armor layered over his existing plate. Seuron braced for the attack he knew was coming.\n\n**Jjeejeeeong!**\n\n\"Ku... heok!\"\n\nPressure crushed him from an unseen angle. Without Soul Armor, that blow would have been fatal. He barely withstood the assault. Sweat poured down his face.\n\n*My Soul Armor was destroyed!*\n\n**Soul Armor Level 2** could absorb 17,300 damage. Destroyed with one blow. And he'd *still* taken damage.\n\n*This monster!*\n\nSeuron stumbled back. A straw hat materialized before him. The eyes shining beneath sent ice down his spine.\n\n\"**Mole Ascension.**\"\n\n**Pahat!**\n\nWhite light erupted from the ground. Seuron's body wouldn't respond. Had he ever felt this helpless since becoming a Soul Predator? Never. This was the first time.\n\n\"Sh... it! You! Who the hell are you?\"\n\nSeuron coughed blood. Kraugel remembered Piaro's introduction.\n\n\"I am a farmer of Reidan.\"\n\nSeuron's eyes bulged. \"That term...!\" Spoken like it was equivalent to knight or magician. \"You can't just be a farmer!\"\n\nKraugel nodded.\n\n\"That's right. I am a farmer.\"\n\nIt was true. For the next two weeks, Kraugel worked as a farmer. Three meals a day and a snack, same as the others. Accommodation provided due to the short-term contract. No salary, though.\n\n\"Dammit!\"\n\nSeuron abandoned the charade. He consumed eleven souls and activated **Soul Prison** to restrain Kraugel. The strongest binding skill in his arsenal. It could trap even a level 280 boss monster for five seconds.\n\n\"Taste inevitable death.\"\n\nSeuron drained his mana pool. Thirty-nine **Soul Spears** manifested around him. He launched them at the farmer. Once he linked **Soul Explosion**, the farmer would be scattered to dust.\n\n\"**White Light Sword.**\"\n\nKraugel's blade erupted with radiance. The light blazed bright enough to banish darkness itself.\n\n\"Kuk!\"\n\nLike a flashbang detonating in Seuron's face. His eyes slammed shut. The Soul Spears scattered, unguided. Two hundred Golden Guild members tried to assist Seuron, but their bodies locked in place. Hao and the Hades Guild members watching from afar bowed their heads against the brilliance.\n\nThe white light faded.\n\nSeuron's corpse hit the ground. The farmer's sword had pierced his heart. He screamed as his body dissolved into grey light.\n\nHao's voice cut through the shock.\n\n\"Run away.\"\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}