{
  "id": 255,
  "title": "Chapter 255",
  "content": "# Chapter 255\n\nStrength was relative.\n\nThe Overgeared Guild was called a group of powerhouses, but even within those ranks, hierarchies existed. Based on pure combat ability, Lauel belonged to the weaker tier.\n\nGrid. Pon. Regas. Jishuka. Faker. Euphemina. Toon. Vantner. All the strongest were missing.\n\n*But even so.*\n\nFifteen against one. Hao had endured for five minutes and three seconds. Not even Pon or Regas could pull that off.\n\n*They would've slaughtered half of us in three minutes, then died.*\n\nAnd if it was Grid?\n\n*We'd be wiped out before we could blink.*\n\nGrid's power had exploded since the doppelganger raid. Lauel didn't want to imagine fighting him. He clicked his tongue and refocused on analyzing Hao.\n\n*Clever bastard.*\n\nThe draconian transformation had been fully optimized. Hao weaponized the desert itself, aiming **Flame Explosion** at the sand to spawn continuous sandstorms that blinded the Overgeared members. His wings let him evade fatal skills while maintaining harassment.\n\nHe hadn't fought to kill. Every move was calculated to buy time. The way he controlled that chain, binding and dragging the entire group... it was surgical.\n\n\"Kill me.\"\n\nIbellin finally pinned him. Hao spoke without fear. Pride radiated from his trapped form. He'd saved his guild. That was victory enough.\n\nThe Overgeared members looked like they wanted to vomit blood. Fifteen high-rankers stalled for over five minutes by one man. Their egos were shattered.\n\nHao twisted the knife.\n\n\"You aren't weak. You're stronger than the rumors.\" He smiled. \"But I'm simply exceptional.\"\n\nNo arrogance. Just fact. The Overgeared members had grown under Piaro's training, but Hao existed on another level.\n\n*Hmm.*\n\nLauel smiled.\n\nHe'd lost harder than anyone in that fight. He was the tactician, the one who orchestrated group battles. The chief of staff. His pride lived in his ability to coordinate overwhelming force.\n\nHao had dismantled him. Outmaneuvered him. Made his tactics look like child's play.\n\nBut.\n\n*I won.*\n\nLauel's smile widened.\n\n\"The Hades Guild's retreat failed.\"\n\n\"What?\" Hao's eyes narrowed. \"What's the point of lying now?\"\n\n\"I'm not.\" Lauel gestured casually. \"Check your guild chat if you don't believe me.\"\n\nSilence.\n\nThen Hao's eyes widened.\n\n\"You... What did you do?\"\n\n\"Simple logistics.\" Lauel examined his nails. \"I predicted your retreat path and stationed someone there. When our team finished wiping the Golden Guild, I redirected them to the same location.\"\n\nFaker had recovered from crushing the Ice Flower Guild. Right now, the Hades Guild was surrounded at the border between the Saharan Empire and the western Eternal Kingdom. Faker and Huroi's detachment had them boxed in.\n\n\"Damn it...\"\n\nRegret flickered across Hao's face. *Should've killed one more.*\n\n\"Are you willing to serve Duke Grid?\"\n\nHao blinked.\n\n\"What?\"\n\nServe? Him? He led one of the seven great guilds. He stood at the pinnacle of two billion players. Serve some lucky bastard whose only advantage was a Legendary class?\n\n\"A dragon doesn't serve a dog.\"\n\nThe Overgeared members' faces flushed red. Ibellin took a step forward, hand on his flamberge.\n\n\"Just kill me and be done with it!\"\n\nIbellin had been dragged by chains like a animal for five minutes. His rage burned hotter than anyone's. He raised his blade toward Hao's heart.\n\nLauel caught his wrist.\n\n\"Grid isn't a dog. He's the sky.\" Lauel stared at Hao. \"If he proves that fact, will you serve him?\"\n\nLauel wanted Hao. Not just for his strength. The nobility to sacrifice himself for subordinates. The tactical sense. The Overgeared Guild was full of individual powerhouses but lacked team-oriented thinkers. Hao was exactly what they needed.\n\nHao snorted.\n\n\"There's already a sky.\"\n\nKraugel. The real sky. Grid wasn't even close.\n\nLauel laughed.\n\n\"Good. I look forward to it.\"\n\n\"...?\"\n\nLauel released him. Hao stumbled back, confused.\n\n\"I look forward to our reunion.\" Lauel turned away. \"I'll let all your guild members retreat safely. Don't worry.\"\n\n\"I won't serve Grid just because you show mercy.\"\n\n\"Will you serve him if he proves he's the sky?\"\n\n\"Yes, but...\" *How could a cow become the sky?*\n\nLauel's grin turned triumphant.\n\n\"Watch his path. You'll learn soon enough. He's the only sky.\"\n\n\"Hah.\" Hao laughed at the fanaticism. *Is this a pseudo-religion?* \"Fine. I'll watch.\"\n\nHe didn't expect anything. He accepted the favor and left.\n\nIbellin rounded on Lauel.\n\n\"They invaded Reidan for no reason! Why let them go? Are you insane?\"\n\n\"Didn't you hear Huroi's report? According to the Golden Guild's statement, Reidan is safe.\" Lauel's voice cooled. \"Think practically instead of chasing petty grudges.\"\n\n\"What if they strike again?\"\n\n\"At that time...\" Lauel's blue eyes turned to ice. \"We'll kill them all. Then we'll raze their estates to the ground.\"\n\nNo second chances. No more forgiveness.\n\n***\n\nDawn broke over Reidan's fields.\n\nThe Overgeared members arrived as farmers worked through the early morning heat. Lauel approached Piaro and bowed deeply.\n\n\"Thank you for saving Reidan. This grace... I'll spend my life repaying it.\"\n\nPiaro laughed, wiping sweat from his brow.\n\n\"It's fine. I just acted according to the value of my meals.\"\n\n\"Value of the meal...\"\n\nA farmer's meal cost seventy-three silver.\n\n*Reidan is worth seventy-three silver.*\n\nLauel's feelings were complicated. He surveyed the vast farmland. The harvest was in full swing. High-quality wheat, growing in massive quantities. Soon, Reidan's people would eat bread instead of just potatoes.\n\nAll thanks to Piaro. He worked like a hundred men. He found water sources where none should exist, bringing life to dead earth. A Great Swordsman with no arrogance, who carried out his duties with respect and discipline.\n\n\"But... I heard there were many enemies. How did you repel them alone?\"\n\nLauel had heard the reports, but he didn't believe them. Zibal. Seuron. Hao. All famous, all dangerous. Piaro defeated them all by himself? Impossible, unless Piaro was a legend on par with Pagma or Muller.\n\n*It can't be.*\n\nHe couldn't imagine that last night's system message about a 'legendary farmer' referred to Piaro. Piaro aimed to be a Sword Saint. Not a farmer.\n\nPuzzled, Lauel watched Piaro point to three farmers.\n\nOne was Bland. The other two wore straw hats, faces hidden.\n\n\"They helped me.\"\n\n\"Is that so?\"\n\n*More hidden warriors in Reidan?*\n\nLauel approached. The two farmers cutting wheat with sickles tensed.\n\n*I don't want to meet you.*\n\nKraugel, ranked first, had been working these fields for two weeks. He couldn't let others know. The attention would be unbearable.\n\nSo he did the only thing that worked.\n\n\"My mother is calling me. I need to go. Logout.\"\n\n\"...\"\n\n*The parent intervention.*\n\nA phenomenon that terrified Satisfy users worldwide. Mothers calling their children to dinner mid-raid. Forced logouts leading to blacklists. Kraugel had just used it as an excuse, leaving Damian alone.\n\n\"Huh? Who was just here?\"\n\nLauel stared. An NPC had logged out? A user was working as a farmer in Reidan? A high-level one, at that. *Why would someone grind levels just to farm?*\n\nHis confusion locked onto Damian.\n\n\"Who are you? Why are you doing fieldwork here?\"\n\n\"...\"\n\nDamian wasn't prepared for this. Embarrassment washed over him. A high-ranking paladin working as a farmer? He wanted to logout too.\n\nThen he reconsidered.\n\n*He's the person closest to Grid.*\n\nIf he explained his purpose to Lauel, arranging a meeting with Grid would be easier.\n\n*Suuk.*\n\nDamian removed his straw hat. Dark blue-violet hair caught the morning light.\n\n\"Y-You...\"\n\nLauel's eyes widened as Damian's attractive features were revealed.\n\nDamian. The second-ranked paladin despite belonging to the Rebecca Church. Then one day he'd vanished from the rankings, spawning rumors of a hidden class. An otaku. A celebrity.\n\nWhy was he doing fieldwork?\n\nThe Overgeared members stood speechless.\n\nDamian offered an awkward greeting.\n\n\"Hey.\"\n\n\"...\"\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}