{
  "id": 256,
  "title": "Chapter 256",
  "content": "# Chapter 256\n\nThe VIP room in the lord's castle was silent save for the creak of chairs as Damian settled across from the Overgeared members. He cleared his throat.\n\n\"I'll tell you everything.\" Damian leaned forward. \"How I met Grid. Why I came to Reidan.\"\n\nHe laid out the facts. The circumstances. The desperation. There was no point in hiding anything from these people.\n\nVantner's eyes grew wet as he listened. A tear rolled down his bald head.\n\n\"Struggling to save the woman you love.\" Vantner's voice cracked. \"That's beautiful, man.\"\n\nThe sight of a massive bald man weeping was less than dignified. Pon would have torn into him for it, but Pon was still off with Regas. Two days now. They had likely stumbled into an instance dungeon and gotten sealed off from the outside world.\n\nLauel watched Vantner wipe his nose, then turned to Damian.\n\n\"I understand you need Grid to save Rebecca's Daughters.\" Lauel's fingers drummed on the armrest. \"But the fields? You're a pope candidate. The administrator would have rolled out a red carpet. We could have contacted Grid immediately.\"\n\nIt was a fair question. The Rebecca Church stood alone among Satisfy's religions. Over eighty million followers. A pope candidate would receive VIP treatment anywhere on the continent.\n\nSo why had Damian been digging in the dirt?\n\n\"That...\" Damian's stomach churned as the Overgeared members stared at him.\n\n*It's all because of that crazy farmer.* But admitting the truth meant admitting he'd been kidnapped and forced into agricultural labor. Worse, the hidden quest had transformed his resentment into something resembling friendship.\n\n\"I enjoy farming.\" The lie tasted bitter. \"Always have.\"\n\n\"Ah.\"\n\nPeople had strange hobbies. No reason to question it. The Overgeared members accepted his words without suspicion.\n\nThey had no idea. None of them knew about Piaro's reign of terror in the fields. How he ambushed travelers. How he dragged them into servitude with a sickle and a smile. Damian pitied the future victims. There would be more.\n\n\"Who was the other person?\" Lauel asked.\n\n\"An outsider. Never gave his name. Stayed silent the whole time.\"\n\n\"Interesting.\"\n\n*I should plant the Eyes of Surveillance on him.* Lauel dismissed the concern. Piaro would have filtered out anyone truly dangerous. Trust in Piaro ran deep. His focus shifted entirely to Damian.\n\n*If Grid is the pope's benefactor...*\n\nThe possibilities unfolded like a map. Closer ties between Reidan and the Rebecca Church. Active exchanges. A temple built within the city walls. Residents blessed. Priests stationed. Population growth.\n\nLauel seized Damian's dirt-caked hands.\n\n\"The Overgeared Guild will help you.\" The words came fast and earnest. \"We'll back you in the papal election. Grid will save Rebecca's Daughters. Whatever you need, just ask.\"\n\nA windfall. Lauel wouldn't let it slip through his fingers. He smiled with the practiced warmth of a hospitality worker.\n\nDamian, unfamiliar with Lauel's nature, felt genuine emotion swell in his chest.\n\n\"You're so kind!\" His voice shook. \"Thank you! I'll give you a pillow with Isabel's image printed on it!\"\n\n\"How generous.\" Lauel's smile widened. \"The alter ego I sealed away in my past life is dancing with joy.\"\n\nThe other Overgeared members exchanged glances.\n\n*What are they even talking about?*\n\n*No idea.*\n\nThe conversation had become incomprehensible.\n\n***\n\nRabbit had known about Piaro's capabilities long before the rest of the Overgeared members learned the truth. His discerning eyes saw through facades easily. Yet he'd left Piaro in the fields for one simple reason.\n\nMoney.\n\nAcknowledging Piaro's skills meant giving him an appropriate position. An appropriate position meant a commensurate salary. A high salary meant strain on Reidan's already precarious finances.\n\nSo Rabbit played ignorant. Kept Piaro farming. Paid him seventy-three silver.\n\nMaximum efficiency for minimum wage.\n\nAnd the wheat fields had become Piaro's domain. When enemies invaded his territory, the farmer defended it. Defended Reidan.\n\nThe results exceeded all expectations. Truly remarkable.\n\nAlso frustrating.\n\n*He deserves compensation.*\n\nConverting Piaro's contributions to monetary value yielded a figure in the hundreds of millions of gold. Obviously, Reidan lacked such funds.\n\n*I have to give him something.*\n\nRewards fell under the lord's purview, not the administrator's. Grid was away. Proper compensation remained impossible.\n\n*Then...*\n\nRabbit exercised the full extent of his current authority. He poured his sincerity into the gesture.\n\n> [Administrator Rabbit appoints farmer Piaro as Wheat Fields Manager.]\n\nPiaro's salary increased to two gold and thirty silver. More than triple his previous wage. The maximum Rabbit's conscience would allow.\n\n***\n\n**[One of the Continent's 10 Great Magicians Fighting for Duke Grid!]**\n\nThe headline ignited the internet worldwide.\n\nReal-time search queries exploded. 'Grid.' 'Earl Ashur.' '10 great magicians of the continent.' 'Seven guilds.' 'Reidan's invasion.' The terms dominated every feed.\n\nNews of a legendary farmer's emergence drowned beneath the flood.\n\nBunny Bunny, who'd broken the story, struck gold.\n\n*The seven guilds, minus Giant, conspired to invade Reidan. Earl Ashur crushed the Yak and Zeraph Guilds without mercy.*\n\nHis livestream peaked at 300,000 concurrent viewers. Cumulative views hit 600,000 in a single day. Bunny Bunny accumulated enormous wealth and reclaimed his reputation.\n\nThe world's premier gaming broadcaster had staged a spectacular comeback.\n\n**> Grid is insane. He's got Earl Ashur as a subordinate. ㄷㄷ**\n\n**> Wait, isn't Earl Ashur the strongest in the Eternal Kingdom? God Grid lives up to the name.**\n\n**> I'm in the US and Grid is on TV every single day. ㅋㅋㅋ Pretty sure everyone here knows about Grid now. ㅋㅋㅋ**\n\n**> Studying in Japan. After the National Competition, all my classmates ask about Grid. Being Korean feels good thanks to him. ㅎ**\n\n**> What happened to the other four guilds besides Yak and Zeraph?**\n\n**> My friend's cousin's wife's friend is in Golden Guild. Says all seven guilds got wiped by Reidan's farmers.**\n\n**> Yeah, right. ㅉㅉ Fantasy novelists everywhere. If you're going to lie, at least make it believable.**\n\nKorean netizens buzzed with particular fervor. National pride swelled each time Grid captured global attention.\n\nGrid himself remained oblivious to the invasion. The Overgeared members had kept him in the dark, afraid of disrupting his quest. The silence allowed him complete focus.\n\n***\n\nTitan, capital of the Saharan Empire.\n\nGrid stood before Asmophel's mansion after three weeks of travel. He opened his status window.\n\n**Name:** Grid  \n**Level:** 291  \n**Class:** Pagma's Descendant\n\n**Strength:** 2,770 (+140) **Stamina:** 1,246 (+120)  \n**Agility:** 1,626 (+110) **Intelligence:** 711 (+310)  \n**Dexterity:** 1,634 (+660) **Persistence:** 958 (+110)  \n**Composure:** 658 (+110) **Indomitable:** 913 (+220)  \n**Dignity:** 1,566 (+110) **Insight:** 1,406 (+110)  \n**Courage:** 602 (+110) **Demonic Magic Power:** 31\n\nThe numbers were staggering. The penalty from crafting his fifth legendary item had slowed his stat growth considerably, but disappointment didn't touch him.\n\nHe still gained stats from production. The titles earned through blood and sweat had boosted him significantly. Items. Skills. Control. Grid could state it without hesitation.\n\n*I am the best.*\n\nTwenty-eight years of life had led to this peak. Confidence and motivation surged through his veins.\n\n\"Asmophel.\" The name tasted like iron. The man who'd framed Piaro. \"Time for you to lose.\"\n\nThe Slaughterer's Eye Patch flared red. Grid pulled on the white Hooded Zip-Up.\n\n***\n\nAsmophel had been noble once. Sincere. Born as Earl Pedro's eldest son, one of the emperor's three most trusted men. He'd embraced his role despite crushing pressure. Trained relentlessly with the sword, following his family's traditions. Joined the Red Knights young. Built a sterling reputation.\n\nA fragile life of glass. New achievements daily. An expanding network. Praised as a pillar of the empire alongside his closest friend, Piaro.\n\nThen Empress Marie's web caught him.\n\nEverything shattered.\n\nHe'd driven daggers into the hearts of friends and colleagues. Every day since had been a waking nightmare.\n\n\"Damn woman!\"\n\nThe table crashed over. Bottles shattered. Alcohol pooled across the floor.\n\nEmpress Marie. He drank to forget her. It never worked. That terrible beauty burned behind his eyelids, inescapable.\n\n\"Piaro!\" His voice broke. \"My friend!\"\n\nThe words meant nothing. He'd screamed apologies a hundred times. A thousand. They couldn't reach Piaro. Couldn't undo what he'd done. The knowledge carved deeper wounds.\n\n\"What's the commotion?\"\n\nKnights rushed in at the noise. Red armor gleamed. Marie's loyal dogs, assigned to \"protect\" him. They'd kept him caged in this mansion for years.\n\n\"Scum.\" Asmophel made no effort to hide his hatred. His eyes swept the room, searching for a weapon.\n\nThere were none.\n\nThe knights whispered among themselves. One left and returned with a magician. A black magician.\n\nAsmophel's body seized with terror.\n\n\"Stay back!\"\n\nHe tried to resist. Useless. Piaro's blade had left him broken. Years of drugs and black magic had eroded body and mind. His iron will had rusted through.\n\nThe spell struck like a hammer.\n\nAsmophel's furious, terrified expression smoothed into blank neutrality.\n\n\"Who is Piaro?\"\n\n\"A traitor to the empire.\" The words left his mouth without thought. \"My enemy.\"\n\nHis eyes glistened. Tears he'd shed before the brainwashing, still wet on his cheeks."
}