{
  "id": 257,
  "title": "Chapter 257",
  "content": "# Chapter 257\n\nThe Yatan Church existed to drown the world in chaos. Their followers sowed pain and despair into human hearts, activating the dark magic that would tear open the veil between worlds and drag the thirty-three great demons to earth.\n\nSuch was the will of God Yatan.\n\n***\n\nThree years ago, Emperor Juander had summoned every master healer and high priest on the continent. His wife lay dying. Empress Aria, mother to the imperial princes and princesses, wasted away in her chambers while gold piled up like cordwood in the treasury and legendary artifacts gathered dust on velvet pillows.\n\nNone of it mattered.\n\nThe healers wrung their hands. The priests spoke in hushed tones of impossibilities, of how only the legendary Saintess could save her now. Juander watched his beloved wife's breathing grow shallow. Her skin turned the color of old parchment. Then she was gone.\n\nGrief swallowed the Emperor whole. He abandoned the affairs of state. Wine became his constant companion. Within months, illness had joined it. The empire drifted without a hand on the tiller.\n\nMarie changed that.\n\nThe second Empress possessed beauty sharp enough to cut, and she knew exactly how to wield it. She was mother to the fourth Imperial Prince, and she had patience. Night after night, she sat with Juander. She listened to his rambling stories about Aria. She dabbed at his fevered brow with cool cloths. Slowly, the Emperor's grief dulled to a manageable ache.\n\nMarie's world opened.\n\nPower followed devotion the way smoke follows fire. Juander's favor settled on her shoulders like a royal mantle, and Marie wore it well. Too well. Behind her painted smile and gentle touches, a different woman was at work.\n\nShe wanted her son on the throne.\n\nBeauty was her first weapon. The court nobles fell over themselves for a kind word or fleeting glance. Power was her second. Those who resisted learned the price of opposition when their estates burned or their daughters vanished. Her third weapon walked in shadows and spoke in whispered curses.\n\nBlack magicians.\n\nThe first Imperial Prince's supporters died. Some fell to scandal, their reputations shredded by rumors that spread like plague. Others simply disappeared. The Red Knights, that legendary order sworn to the first Prince, were dissolved on charges of treason. New knights rose to take their place, loyal only to Marie.\n\nThree years of careful work had built her an empire within the empire. Nobles lined up to pledge themselves to her son. The reorganized Red Knights would die at her command. Marie surveyed her dominion and found it good. Her son would be Emperor. It was inevitable now.\n\nDive laughed at her certainty.\n\nHe was an old man, this Dive. A black magician who had served Marie's family since before she became Empress. Long before. So long, in fact, that the real Dive had died years ago, murdered by the hand of the seventh Servant, Dark Bus.\n\nThe man wearing Dive's face was Dark Bus himself.\n\nHe specialized in curses, this Servant of Yatan. His mission was to rot the Saharan Empire from within, and he was very, very good at his work. The fourth Prince was weak. Malleable. Easily manipulated. *Perfect.* When that fool sat on the throne, the first Prince's faction would erupt in fury. Civil war would consume the empire. Blood would soak into the earth. Despair would bloom like black flowers.\n\nAnd the magic... Oh, the magic. Enough to summon a great demon.\n\n\"It won't be long now.\" Dark Bus ran his fingers along the armrest of his chair. \"Three years of groveling will finally pay off.\"\n\nThree brutal years. The empire's court magicians and sages possessed sharp senses. One slip, one moment of carelessness, and they would have sniffed out his deception. He could never relax. Every word had to be measured. Every spell, perfectly disguised.\n\nBut the hardship was ending.\n\nDark Bus chuckled, the sound dry as autumn leaves. The noise echoed in his darkened study, bouncing off walls lined with—\n\nSomething shattered.\n\nThe old man froze. *What?*\n\nHis wards. The extensive magical barriers he'd woven around Asmophel's mansion collapsed like wet paper. Dark Bus lurched to his feet, extending his senses. An intruder had breached the perimeter.\n\n*Impossible.*\n\nAsmophel was critical to the plan. The man had once been praised as a pillar of the empire, and his fall from grace fed Dark Bus a steady diet of delicious despair. Asmophel's brainwashing required constant maintenance, which meant Dark Bus resided in the mansion to guard his investment. For years, he'd ensured no outsider could approach.\n\nYet now his wards lay in ruins.\n\n*Who could break through so easily?* Dark Bus probed with his magic power, searching for the intruder's signature. Only one. A single person had torn through barriers that could withstand a squad of battle mages.\n\nOne target. He could handle that.\n\nDark Bus smoothed his robes and strode to the living room. The Red Knights had finished their shift earlier, replaced by the Black Knights. Good. The Black Knights were easier to control. Less prideful than their Red counterparts.\n\n\"You.\" Dark Bus jabbed a finger at the nearest knight. \"With me. All of you.\"\n\nThe Black Knights fell in behind him without question. The group swept through the mansion and out into the gardens, where the perimeter guards stood at attention.\n\n\"Attention!\" The soldiers saluted, oblivious to the danger stalking their grounds.\n\n*Covert intrusion.* Dark Bus probed the darkness with his magic. *Useless in front of me.*\n\nHe could feel the intruder's presence like a wound in the fabric of magic. Two hundred meters ahead. Dark Bus smiled, the expression making his wrinkled face even more grotesque.\n\n\"Intruder! Defensive formation!\" His voice cracked like a whip.\n\nSoldiers poured out of the barracks. One hundred and twenty elite troops, two Black Knights, and Dark Bus himself arrayed across the gardens. It was a small army.\n\nDark Bus channeled his magic power, forcing it outward in a wave that stripped away concealment.\n\n\"Reveal yourself!\"\n\nThe spell took hold. A figure materialized from the shadows ahead, wearing a bizarre hooded cloak and a mask that covered most of their face. Black hair. Red eyes catching the moonlight.\n\nDark Bus had never seen this person before.\n\n\"Who are you?\" The old magician kept his voice steady.\n\nThe intruder's answer was flat. \"What else? An enemy.\"\n\nThen the enemy moved.\n\nGrid had spent three weeks fighting his way here. He was done with talking. His boots struck packed earth as he closed the two hundred meters separating him from the soldiers. The elite troops held their ground, drawing swords in perfect synchronization. Behind them, archers nocked fire arrows and drew.\n\n*Impressive.* Grid noted their discipline. *Higher level than most soldiers I've encountered.* \n\nThe arrows flew.\n\n*But that won't save them.*\n\nGrid summoned the Divine Shield. The holy artifact materialized on his left arm, its surface blazing with golden light. Fire arrows struck the shield and scattered like ash. Grid dismissed it and called forth his primary weapon.\n\nBlue-white light erupted from his right hand. **Failure** answered his call, the legendary greatsword humming with barely contained violence.\n\nFive soldiers rushed him. Grid swung.\n\nMetal screamed. Bodies flew through the air, armor crushed like tin. The soldiers crashed into their comrades, bones breaking with wet cracks. Grid's strength had long since surpassed mere human limits. These men might as well have been trying to wrestle an ogre.\n\n\"Forward!\" An officer screamed the command, and more soldiers charged over the fallen.\n\nGrid activated his skill. \"**Blacksmith's Rage**.\"\n\n> [Blacksmith's Rage Lv. 4 activated. Attack power increased by 25%. Attack speed increased by 40%.]\n\nThe Failure's passive trait layered on top. In darkness, its attack power swelled another 20%. Grid became a storm of blue light and blood. His blade carved through armor like parchment, splitting shields in half. Soldiers died before they could scream. Those who lived long enough to feel pain wished they hadn't.\n\nThe survivors fell back, reforming into a circular pattern designed to trap and crush.\n\n*They think I'm surrounded.* Grid's lips curved behind his mask. *Adorable.*\n\nHe could break them. **Transcended Link** would slaughter half of them in seconds. But wasting legendary skills on fodder seemed idiotic, and grinding through them one at a time would drain his stamina.\n\n*Work smarter.*\n\nGrid's eyes swept the battlefield. Flower beds, decorative fountains, ornamental trees. The garden was a maze of obstacles. He sprinted toward the most tangled section, forcing the soldiers to follow single-file through narrow paths.\n\nTheir formation shattered.\n\nTwo soldiers squeezed between a fountain and hedge, trying to flank him. Grid pivoted. Failure split the first man from shoulder to hip. The second died when Grid reversed the blade, the edge punching through the gap in his helmet. Blood misted the fountain's water.\n\n\"Aagh!\"\n\n\"He's a monster!\"\n\nThe soldiers' discipline cracked. Grid danced between obstacles, using terrain to isolate targets. Three more died. Then five. The survivors stopped chasing, their faces pale in the moonlight.\n\nOne of the Black Knights stepped forward. \"Sir Dive, curse him.\"\n\n\"Yes.\"\n\nDark Bus traced a crimson magic circle in the air, his fingers leaving trails of bloody light. The formation pulsed, and curses erupted from its heart.\n\n\"**Amplify Damage**! **Lower Resist**! **Lower Blessing**!\"\n\nThree devastating curses struck Grid simultaneously. The spells should have crippled him, doubling the damage he took while stripping away his resistances and stats. The Black Knights moved before the magic finished settling, confident their prey was helpless.\n\n\"Wait—\" Dark Bus choked on the word.\n\nThe curses had done nothing.\n\nBoth Black Knights were already committed to the charge. Grid faced them and smiled.\n\n\"**Pagma's Swordsmanship, Restraint**.\"\n\nTerror crashed down on the Black Knights like a physical weight. It was wrongness given form, the feeling of standing on a cliff edge in the dark. Every instinct screamed *danger*.\n\n\"What...?\" The first Black Knight stumbled backward.\n\n\"What is this?\" His partner retreated, sword wavering.\n\nGrid closed the distance. His footwork mimicked the aggressive patterns of **Kill**, each step eating ground. The first Black Knight was still frozen when Failure punched through his chest.\n\nNo scream. Just a wet, surprised gasp. Blood poured from the wound as the knight collapsed.\n\n\"You bastard!\" The second Black Knight broke free of the fear. \"What kind of black magic was that?\"\n\n\"Black magic?\" Grid cocked his head. The Slaughterer's Eye Patch activated, painting the Black Knight's vital points in deepening shades of red.\n\nGrid's voice was calm. \"This is technique, not magic.\"\n\nSeven golden blades materialized behind him. The pavranium weapons hung in the air like a predator's fangs, then struck.\n\nThe Black Knight tried to defend. Futile. The golden blades were too fast, too precise. They targeted the joints in his armor—elbows, knees, neck seal. Metal parted. Blood sprayed. The knight's movements turned sluggish as his mobility died.\n\nGrid used **Link**.\n\n> [Link Lv. 5 activated.]\n\nThe world became a strobe of blue-white light. **Failure** moved faster than thought. Ten strikes. Fifteen. Twenty. Twenty-five. Thirty. Each blow carved away another piece of the Black Knight. His desperate parries meant nothing. At level 255, he simply lacked the stats to resist a legendary skill.\n\nThe knight coughed blood. His ruined body toppled backward into the fountain with a wet splash. Red spread through the water like ink.\n\nSilence.\n\nThe remaining soldiers stood frozen, eyes wide. Two Black Knights dead. The empire's finest, butchered in seconds. This couldn't be real. It had to be a nightmare.\n\nDark Bus stared at the carnage. His curse magic, his pride and joy, had accomplished exactly nothing. How? Unless...\n\n*That blue greatsword. The golden blades. Resistance to curses.* \n\nMemory clicked into place. Balak, the fifth Servant, had sent a warning before his death in Bairan. A monster wearing red armor, wielding a blue greatsword and golden artifacts. He'd killed Malacus. He'd killed Neberius.\n\nHe called himself—\n\n\"Templar.\" Dark Bus's voice cracked.\n\nNo.\n\n\"Overgeared!\"\n\n*Why is he here?* The question tore through Dark Bus's mind like a blade. *He should be in the Eternal Kingdom, thousands of miles away. Why would he come to the empire?*\n\n\"You...\" Dark Bus's hands shook. Three years of work. Three years of careful manipulation, of playing the loyal servant while rotting the empire from within. \"Do you intend to destroy everything I've built?\"\n\nHad God Yatan abandoned him?\n\nGrid said nothing. He simply walked forward, Failure dripping red in the moonlight, ready to finish what he'd started.\n\n---\n\n**Glossary of Common Korean Terms:** [OG: Glossary Link]\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and to achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}