{
  "id": 258,
  "title": "Chapter 258",
  "content": "# Chapter 258\n\n*This man... he must be from the Rebecca Church.*\n\nDark Bus's mind raced as magic flew from his fingertips. Why else would someone with the power to kill two of Yatan's Servants appear here, now? The answer was obvious. Grid was the Rebecca Church's secret weapon, sent to dismantle their operations piece by piece.\n\nIt was a reasonable conclusion, given the evidence.\n\n*I have to kill him here. If he continues unchecked, the church will face disaster.*\n\nDark Bus unleashed spell after spell at Grid, who was still engaged with the soldiers. Yet landing a clean hit proved maddeningly difficult. Grid used the terrain with practiced efficiency, and those damned golden blades intercepted magic with inhuman speed.\n\n*Shit. He defeated Neberius, and I can't even raise my attack power properly.*\n\nThe problem was simple: Dark Bus specialized in curses, not direct combat. He excelled at manipulation and orchestration, but among the Yatan Servants, his raw fighting ability was pathetic.\n\n*Why won't curse magic work?*\n\nThat was the crux of it. Grid shrugged off every hex and debuff like water off stone. Dark Bus might as well have been throwing pebbles at a fortress wall. This was the worst possible matchup.\n\nSweat dripped down Dark Bus's temple as he searched for a solution. Then it hit him.\n\n*Asmophel!*\n\nAsmophel, the second greatest swordsman after Piaro. True, his skills had degraded over the years, but he still outclassed any regular knight by a wide margin.\n\n*He's recovered from Piaro's wound. And for years now, he's been consuming God Yatan's essence.*\n\nWith Dark Bus's magic amplifying him, Asmophel would become an unstoppable weapon.\n\n*Overgeared! You've reached your grave.*\n\nDark Bus allowed himself a smile.\n\n\"Come out, Asmophel!\"\n\nIn his arrogance, Dark Bus had just delivered Grid's quest target on a silver platter. Some villains never learn.\n\n***\n\nTwo soldiers rushed across the garden, spears aimed at Grid's torso. He sidestepped, letting momentum carry them past.\n\nA notification materialized in his peripheral vision.\n\n> [Your demonic power has increased by 2.]\n\nGrid grimaced. Demonic power. That cursed stat that would eventually drag him to Hell if it climbed high enough. Every user or NPC he killed added one point to the tally.\n\nHell. The name alone told him everything he needed to know about that destination.\n\n*This useless stat just keeps climbing.*\n\nHe surveyed the battlefield with calculating eyes. Sixty-one soldiers remained, plus the black magician flitting around like a persistent horsefly. Killing them all would push his demonic power to 154.\n\n*And reinforcements might arrive any moment.*\n\nShould he use his pet? Would Noe killing someone raise Grid's demonic power too? During the White Wolf Guild massacre, Randy had only provided support while Grid handled the actual killing. There was no precedent to confirm the theory either way.\n\nWorth testing. Grid pulled Noe from his inventory. No need to summon Randy for this experiment. He wasn't about to split experience between two pets unnecessarily.\n\n\"Jjang! The best demonic beast of hell has emerged! Nyang!\"\n\nNoe stretched his limbs in what was clearly meant to be an impressive pose. His legs were so short, however, that the effect was more adorable than intimidating.\n\n*How is he getting cuter?*\n\nGrid barely suppressed a laugh. The sound effects didn't help. How was this creature supposed to be a demonic beast from hell? He opened Noe's status window to distract himself.\n\n**Name:** Noe  \n**Species:** Memphis  \n**Level:** 151  \n**Status:** Happy  \n(Ohhhh! This gorgeous appearance has emerged! Nyahahat!)\n\n**Current Skills:**  \n[Fluidization] [Soul Ingestion] [Scratch] [Bewitchment]\n\nNoe had gained Bewitchment at level 150. The skill drained an enemy's will to fight, which gave the small cat a significant edge. Despite the imperial soldiers' training, they wouldn't withstand Noe's skillset. With proper execution, Noe could hunt monsters far above his level. As long as he stayed alert and avoided taking hits, he was borderline fraudulent.\n\nGrid deflected another spell with his pavranium discs.\n\n\"Go on a rampage.\"\n\n\"Nyang!\"\n\nNoe's wings fluttered as he shot toward the nearest soldier. The man swung his blade to knock the cat away, but Noe was fluid as mercury. He slipped past the guard and struck with his stubby paw.\n\nThe soldier's vision exploded with stars.\n\n*That... hurt?*\n\nBlood welled from the wound. Before shock could fully register, those soft paws became anything but soft. Claws flashed.\n\n\"Nya nya nya nya nyang!\"\n\nNoe's strikes blurred into invisibility. The soldier's face became a canvas of red streaks.\n\n\"This crazy cat!\"\n\nThe soldier thrashed wildly, sword cutting empty air. Noe danced between the attacks, relentless and vicious. A true demonic beast.\n\n\"Ugh.\"\n\nGrid's expression soured the moment the soldier hit the ground.\n\n> [125,600 experience has been acquired. Some experience has been distributed to your pet 'Noe.']\n>\n> [Your demonic power has increased by 1.]\n\n*Shit.*\n\nSo pet kills counted too. Grid made his decision instantly. He recalled Noe to monopolize the experience and dove back into the slaughter himself.\n\nGrid activated the <span class=\"rarity-unique\">Hooded Zip Up</span> and wielded both greatswords in a whirlwind of steel. The golden blades formed a barrier that kept soldiers at bay while Grid's swords reaped lives with mechanical efficiency.\n\n*Just a little more.*\n\nHis gaze fixed on the mansion entrance as the <span class=\"rarity-legendary\">Doppelganger's Greatsword</span> carved through three soldiers in one sweeping arc.\n\nInside that building waited Asmophel. The end of this long journey. Completing the quest would maximize his affinity with Piaro, and then...\n\n*Piaro will become my sword.*\n\nThe thought of claiming a Great Swordsman as his subordinate sent electricity through Grid's veins.\n\n*Peeng!*\n\nThe warlock at the mansion entrance fired another spell. Grid's jaw clenched.\n\n*This pest is getting annoying.*\n\nBlack magicians were fragile. Judging by the attack spells, this one was barely level 200. Still, the constant harassment grated on Grid's nerves. He cut down the remaining soldiers and charged the mansion, ready to swat this insect before confronting Asmophel.\n\n*Did he hear the fighting and run?*\n\nThe thought barely formed when—\n\n\"Come out, Asmophel!\"\n\nThe disheveled black magician shouted. A lean figure materialized beside him, the name floating above his head unmistakable: **Asmophel**.\n\n\"...What?\"\n\nHis target was being delivered? Grid blinked at the unexpected turn of events.\n\n\"Your rampage ends here! You will receive divine punishment—!\"\n\nDark Bus never finished his declaration. <span class=\"rarity-legendary\">Failure</span> was already carving through his neck.\n\n\"...!\"\n\nDark Bus crumpled with a sound like wind through broken shutters. The <span class=\"rarity-legendary\">Doppelganger's Greatsword</span> buried itself deep in his chest.\n\n\"You...!\"\n\nDark Bus lurched upright, rage contorting his features. As the weakest combatant among the Yatan Servants, he was still a named boss with millions of HP. Two strikes wouldn't end him.\n\nGrid's brow furrowed.\n\n*Why isn't he dead yet?*\n\nHe'd assumed this was just another black magician. One or two hits should have been sufficient. This unexpected durability changed things. Grid activated his Insight and checked the combat power.\n\n*20,000.*\n\nField boss level. So why was the fight so one-sided?\n\n*He must be the mid-boss for this quest.*\n\nGrid yanked both greatswords free. Blood fountained from Dark Bus's wounds. The blades rose high before plummeting down again.\n\n**Pagma's Swordsmanship, Pinnacle.**\n\nThe devastation was immediate.\n\n\"Kuaaaaak!\"\n\nDeep gouges split both of Dark Bus's shoulders. His mind reeled.\n\n*Mana Shield did nothing!*\n\nThis opponent was far more dangerous than anticipated. At this rate, death was certain. Frontal assault was suicide. Dark Bus scrambled behind Asmophel and reached for the mental chains controlling his puppet.\n\nGrid was faster.\n\n\"Wave.\"\n\nThe shockwave caught Dark Bus full in the throat.\n\n*Puok!*\n\n> [Critical Hit!]\n>\n> [<span class=\"rarity-legendary\">Failure's</span> option effect is activated, causing the skill 'Bisect' to be generated.]\n>\n> [<span class=\"rarity-legendary\">Failure's</span> option effect is activated, causing the skill '5 Joint Attacks' to be generated.]\n\n*Flop.*\n\nDark Bus's head separated from his shoulders. His body toppled.\n\n\"Why is a magician so tank—huh?\"\n\nGrid muttered about the inflated health pool. Then notifications cascaded across his vision.\n\n> [You have defeated the Seventh Servant Dark Bus, who spread chaos through the world!]\n>\n> [You have saved the Saharan Empire from a crisis by interfering with the conspiracy of the Yatan Church.]\n>\n> [Reputation throughout the continent will rise by +3,000.]\n>\n> [You currently have 28,110 reputation throughout the continent. You can use the Reputation Store when your reputation reaches over 30,000.]\n>\n> [The title **'Secret Hero'** has been obtained.]\n>\n> [The title **'Yatan Servant's Slaughterer'** has been obtained.]\n>\n> [3 Blessed Weapon Enhancement Stones have been acquired.]\n>\n> [7 Blessed Armor Enhancement Stones have been acquired.]\n>\n> [3 Deluxe Magic Stones have been acquired.]\n>\n> [<span class=\"rarity-unique\">Dark Bus' Earrings</span> have been acquired.]\n>\n> [<span class=\"rarity-unique\">Dark Bus' Ring</span> have been acquired.]\n>\n> [88,052,440 experience has been acquired.]\n>\n> [Your level has risen.]\n\n\"...?\"\n\nGrid stood frozen. A Yatan Servant? *That* weakling?\n\nAsmophel stirred, freed from the brainwashing. He approached Grid, who was still staring at Dark Bus's corpse in disbelief.\n\n\"The hero who punished the wicked Yatan Servant.\" Asmophel's voice cracked. \"My savior... will you hear my story? I have been wronged.\"\n\n> ['The True Traitor of the Red Knights (SS)' quest has been changed to the 'Hidden Story (Hidden)' quest.]\n\nGrid's brain short-circuited.\n\n\"???\"\n\nQuestion marks multiplied in his head as Asmophel began speaking.\n\n\"One day, Empress Marie came to me.\"\n\nThe tale was long. Asmophel recounted every detail. How Marie had approached him. How she'd poisoned his relationship with Piaro. The Yatan Essence—a substance that shredded human willpower and corrupted mana with a single drop.\n\nHe described the brainwashing process. How Dark Bus had turned him into a perfect puppet. Asmophel trembled, tears streaming down his face as he spoke of being weaponized against Piaro and his comrades.\n\n\"Someday... if you meet a man named Piaro, please tell him this.\" Asmophel drew his sword and pressed it to his own throat. \"I'm sorry. I'm truly sorry.\"\n\nThe blade moved without hesitation. Steel kissed skin. Asmophel intended to pay for his crimes with blood.\n\nHe never got the chance. Grid's hand shot out, stopping the sword before it could bite deep.\n\n\"Don't delegate.\" Grid met Asmophel's eyes. \"Apologize directly.\"\n\nThe first condition of Grid's hidden quest materialized in his mind: reunite Piaro and Asmophel. The two pillars who had once upheld the empire were about to become Reidan's foundation.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}