{
  "id": 259,
  "title": "Chapter 259",
  "content": "# Chapter 259\n\nThe day before the seven guilds invaded Reidan.\n\nPon and Regas trudged through the desert, sand scraping against their armor. Heat shimmered off the dunes. Then Regas stopped. Ahead, a structure rose from the sand like a massive ant hill.\n\nRegas squinted at the entrance. \"This dungeon isn't marked on the map, is it?\"\n\nPon unfolded the map and scanned the parchment. He shook his head.\n\nRegas grinned. He turned and walked straight toward the entrance.\n\nPon's hand shot out. \"Wait—\"\n\nToo late. Regas vanished into the opening.\n\n*Reckless bastard.* Pon cursed under his breath and followed.\n\nTen seconds after they entered, the desert sand shifted. The entrance collapsed inward and disappeared.\n\n---\n\n\"Wow.\"\n\n\"This...\"\n\nPon and Regas stood in silence. Then notification windows flashed before their eyes.\n\n> [System] You have entered the Vampire's Underground City (13).\n\n> [System] Benefits granted to first discoverers! Gold and item drop rate increased by 8%. This benefit lasts for 10 days and will disappear upon death.\n\nPon scanned the messages. The experience boost was missing, but the drop rate was solid. Then the next notifications appeared.\n\n> [System] The dungeon entrance is blocked. Contact with the outside world has been severed.\n\n> [System] You cannot escape until the dungeon boss is defeated or you die.\n\nThe words hung in the air.\n\n\"We're trapped...\" Pon muttered.\n\nHe knew vampires. Top-ranking combat species. Attack cancellation. Enchantment skills. Stronger in darkness. And here they were, sealed in a city of vampires with no light.\n\n*We're going to die.*\n\n\"Isn't this place amazing?\"\n\nPon turned. Regas stared at the dungeon sprawling before them, eyes bright.\n\nThe city stretched into shadow. High buildings. Pointed spires. Gothic architecture like Notre Dame or Cologne Cathedral scattered throughout the darkness. The scenery was spectacular and oppressive at once.\n\nRegas cracked his knuckles. \"We should hunt while the buff is active.\"\n\n\"...\"\n\nAnyone else would fear the death penalty. For rankers, it was worse. But Regas wasn't afraid. He held 12th on the unified rankings because he enjoyed the challenge.\n\n*This idiot.* Pon smiled despite himself. \"Let's go.\"\n\nThey had to fight anyway. Might as well do it right. Kill all the vampires and the boss before the buff ended. That was the ideal scenario.\n\nPon and Regas moved into the shadows. It was the start of an epic struggle.\n\n---\n\nJude served as Grid's knight and captain of Reidan's security forces. He existed to protect Duke Grid's city.\n\nThis was Jude's perspective.\n\n\"Captain, get some rest now.\"\n\n\"I don't want to.\"\n\nThere was no rest for Jude. He maintained Reidan's safety every waking hour. He even ate while patrolling, chewing dry bread as he walked the walls.\n\n*Captain is admirable.*\n\n*I have to work harder!*\n\nThe soldiers watched him. They saw his dedication. Jude became their model. The soldiers of Reidan grew more diligent every day. They endured Piaro's harsh training. Their growth speed was remarkable. They were overgeared soldiers. It was only a matter of time before they became elites.\n\nJude marched along the wall. He swallowed another bite of bread.\n\n\"Today. Reidan. Safe.\"\n\nHe didn't know the truth.\n\nOne week ago, hundreds of invaders had tried to breach Reidan while he slept. Four farmers repelled them before they reached the walls. Jude never knew it happened.\n\nWas it because he was an idiot with only **20 Intelligence**?\n\nNo. This was Lauel's intent. Lauel suppressed the news to avoid disturbing the people. It was easy to cover up. The attack happened at night. The enemies only reached the wheat fields outside the walls. They retreated quickly. Only a few people knew what happened that night.\n\nJude wasn't part of that minority.\n\nHe continued his patrol. \"Jude. Today. Strong.\"\n\nToday, Reidan was peaceful. The people believed it was Jude's doing.\n\n\"Captain Jude! Please work hard today!\"\n\n\"Thank you!\"\n\nJude's chest swelled with pride. He walked faster, patrolling harder. Everything was for Duke Grid.\n\n---\n\n> [System] The hidden quest 'Fun and Enjoyable Training!' has been completed.\n\nKraugel set down the farming tools he'd held for a month.\n\n*The end.*\n\nDisappointment flickered through him. He was glad to leave on new adventures, but he would miss Reidan. This was the first time he'd stayed in one place for so long.\n\n*I'll miss it.*\n\nHe looked across the vast wheat fields. The memories from the last month were engraved on his mind. Fun. Precious. Unforgettable.\n\n\"I'm leaving.\"\n\nHe approached the impressive middle-aged man standing at the field's edge. Piaro. Commanding presence. Deep gaze. The fact that he wasn't ordinary showed in his eyes.\n\nPiaro. The first ranked Kraugel couldn't defeat him in the end.\n\nKraugel smiled gently. He bowed low.\n\n\"Thank you for everything.\"\n\nMeeting Piaro was the luck of a lifetime. Working tirelessly in the field. Sparring with Piaro. Because of this, Kraugel finally crossed the wall.\n\nSword Saint 4th Stage.\n\nOne more step until he became a Sword Saint.\n\n\"You should come back here often.\" Piaro extended his hand. \"You're always welcome.\"\n\nKraugel looked at the hand. Dirty. Covered with calluses. He could see the road Piaro had walked. All of it was visible in those hands.\n\nKraugel grasped the hand politely.\n\n\"Yes, Brother.\"\n\nWhen he returned next time...\n\n*I will be the best.*\n\nKraugel had been disappointed when Piaro became a farmer. He thought Piaro gave up the road to Sword Saint. But that wasn't it. He realized the truth when they worked together.\n\nPiaro didn't give up. He chose a more suitable path for himself.\n\nThe class wasn't important. Being a legend was what mattered.\n\nPiaro combined farming equipment with swordsmanship. Sword Saint Muller couldn't even compare. Piaro became the strongest man.\n\nTo compete with him...\n\n*I also have to become a legend.*\n\nSword Saint. It didn't matter how long it took. Kraugel was determined to achieve it. He wanted to become equal to Piaro and face him.\n\n---\n\n*I have noticed.*\n\nA man wearing a straw hat said goodbye to Piaro. He didn't remove his hat once. Faker followed him from the shadows. As soon as the man left Reidan, he activated White Light Steps.\n\nWhite light flashed beneath his feet.\n\n*It truly is him...*\n\nFaker was certain now.\n\n*The sky above the sky.*\n\nThe peak of two billion users. Kraugel.\n\nIt wouldn't be hard for him to shake off Faker if he tried. A faint smile broke across Faker's face.\n\nKraugel had a relationship with Reidan. He might become a positive influence on Grid later.\n\n---\n\n> [System] The hidden quest 'Fun and Enjoyable Training!' has been completed.\n\nEight days after Kraugel left, Damian finished the quest.\n\n\"Good!\"\n\nDamian confirmed his ascending stats and skill levels. The quest reward filled him with joy. Unbelievable compensation for such a short period. He achieved dramatic growth compared to three weeks ago.\n\n\"It would've been nice to share this joy with Rin.\"\n\nDamian felt regret. He turned his attention to the horizon beyond the wheat field.\n\n*Now I just have to wait for Grid.*\n\nToday was the day Grid was scheduled to return. Damian's expectations soared.\n\n*If Grid could seal Lifael's Spear...*\n\nIsabel could be saved.\n\nOn the other hand, he was worried.\n\n*What if Grid refuses my request?*\n\nThe Grid that Damian knew was a very greedy person. He couldn't imagine such a person helping others out of simple goodwill.\n\n*Lauel says I should have faith, but...*\n\nHe had to prepare for the worst. Damian started gathering treasures to offer Grid. He disposed of all items except his main equipment. He even converted his savings to gold.\n\n*I'm willing to sell my house...*\n\nDamian firmed his resolve.\n\n---\n\nThat night, Grid returned. Asmophel was with him.\n\n\"Have you been well?\"\n\nGrid stood before them. Five weeks away. Now level **295**. He grew even more after the long journey. The Overgeared members looked overwhelmed.\n\nLauel felt a thrill.\n\n*G-Great!*\n\nGrid's eyes shone with a red light. Completely to Lauel's taste.\n\nGrid scratched his head. He looked at the people around him. His eyes were tinged with affection.\n\n\"What happened?\"\n\nDamian shook his head. He stood behind the Overgeared members, staring at Grid.\n\n*What's this? He doesn't know his city was invaded?*\n\nThe invasion of Reidan by the seven guilds was a global issue. Even people who didn't play Satisfy much knew about it thanks to the news. The person involved, Grid, wasn't aware of it.\n\nSurprising.\n\nLauel laughed. \"Were you so busy with the quest that you didn't watch TV?\"\n\n\"Yes.\" Grid rubbed his eyes. \"I'm so busy playing the game that I reduced my sleeping time.\"\n\nThe quest was annoying in many ways. Long distance to Talima. Asmophel's mansion was hard to find. The wards installed by Dark Bus made it worse. Grid trembled as he recalled Talima, the biggest city on the continent. Much bigger than Reidan.\n\nHe was lucky the last boss was weak. If the opponent had been strong, he would've started crying.\n\n*I had a hard time, but it was worth it. The reward was good. Most of all, it linked with a hidden quest.*\n\nGrid wanted to finish this quest by reuniting Piaro and Asmophel as soon as possible. Then he would log out, wash, and sleep. He missed his mother's meals. He hadn't seen his family's faces for several days.\n\n\"But why are you talking about the TV?\" Grid asked. \"What happened?\"\n\n\"Just something trivial...\" Lauel waved his hand. \"You can check it later.\"\n\n\"I have something separate to do.\" Grid looked around. \"Where's Piaro's house?\"\n\nLauel and the Overgeared members guided him forward. Damian noticed it wasn't his turn yet. He followed silently.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule: 20 chapters a week.**\n\n**Check out my Patreon for early access to a certain number of unedited chapters and to achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}