{
  "id": 26,
  "title": "Chapter 26",
  "content": "# Chapter 26\n\nThe gold armor settled onto my shoulders like a fortress made manifest. I gripped the greatsword's handle, testing its weight. The weapon was absurd—oversized, brutal, heavy enough to split stone. *I could kill a dragon with this thing.*\n\nThe gangsters charged. Weapons raised, faces twisted with violence.\n\nI didn't move.\n\n**Kwang! Kwajajak!**\n\n> [The enemy's damage has been neutralized.]\n\nTheir blades sparked off my chest plate. The impact barely registered—a gnat striking iron. One thug's sword bent visibly where it met the armor. Another's club split down the grain.\n\n\"W-What?\"\n\n\"What is this...?\"\n\nThese men had survived in Winston's criminal underworld. They knew danger when they saw it. Now, staring at me, I watched that recognition bloom into something colder.\n\n\"T-This is ridiculous...!\"\n\nI smiled at them. Felt my lips pull back from my teeth. \"Have you heard of item effects?\"\n\n*Drugs? Skills?* I'd never needed that crutch. Khan's smithy was a treasure vault, and Pagma's Descendant could equip every piece of it.\n\n**Clink!**\n\nI adjusted my grip—both hands on the handle, waist twisted, core engaged. Then I lifted. No technique. No finesse. Just the greatsword's momentum carving through meat and bone.\n\n**Seokeok!**\n\nThe blade bit deep. The sensation was clean. Satisfying. Two bodies collapsed into grey light before the blood could even spray.\n\n> [You have defeated Winston's outlaw, Praga.]\n> \n> [Reputation in Winston Village has increased by 60.]\n> \n> [4,300 experience has been acquired.]\n> \n> [You have defeated Winston's outlaw, Um.]\n> \n> [Reputation in Winston Village has increased by 60.]\n> \n> [4,300 experience has been acquired.]\n> \n> [You have defeated Winston's outlaw, Veil.]\n> \n> [Reputation in Winston Village has increased by 100.]\n> \n> [6,600 experience has been acquired.]\n> \n> [Your level has risen.]\n> \n> [Your level has risen.]\n> \n> [Your level has risen.]\n> \n> [Your level has risen.]\n> \n> [Your level has risen.]\n> \n> [Your level has risen.]\n> \n> [Your level has risen.]\n> \n> [Your level has risen.]\n> \n> [Your level has risen.]\n> \n> [Your level has risen.]\n> \n> [Quest success!]\n> \n> [Affinity with Khan has risen to the maximum.]\n\nThe notifications kept flooding my vision. I ignored them.\n\n\"This weapon and armor...\"\n\nI activated Legendary Blacksmith's Appraisal immediately.\n\n> [The blacksmith who becomes a legend appraises items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\n---\n\n**<span class=\"rarity-unique\">Dainsleif (Reproduction)</span>**\n\n**Rating:** Unique  \n**Durability:** 500/500  \n**Attack Power:** 451~635  \n**Attack Speed:** -8%\n\n* Additional damage equal to 10% of the target's current defense will be dealt.\n* The greater the number of enemies, the greater the damage.\n* The skill 'Golden Flash' has been generated.\n\n*A work created by Albatino, the first human to receive the nickname of 'craftsman' before Pagma's era. He attempted to reproduce the mythical weapon, Dainsleif.*\n\n*While far lacking compared to the original Dainsleif, he succeeded in restoring some of its features, making it a masterpiece of its own.*\n\n*It was acclaimed as a 'masterpiece of human history' by the founder of the Eternal Kingdom and king of the north, Loran.*\n\n*The legendary blacksmith Pagma is said to have received great inspiration from Albatino's work.*\n\n**User Restriction:** Level 250 or higher. More than 1,800 **strength**. Advanced Sword Mastery.\n\n**Weight:** 1,580\n\n> [A hidden function doesn't exist.]\n> \n> [You still don't have enough knowledge and experience to understand the material, the production method, and the intentions of the maker of <span class=\"rarity-unique\">Dainsleif (Reproduction)</span>.]\n> \n> [You have no understanding of <span class=\"rarity-unique\">Dainsleif (Reproduction)</span>.]\n\n---\n\n**<span class=\"rarity-unique\">Valhalla</span>**\n\n**Rating:** Unique  \n**Durability:** 701/701  \n**Defense:** 872  \n**Movement Speed:** -5%\n\n* 20% increase in health recovery.\n* If health falls below 10%, a shield will be generated for 5 seconds that will absorb 3,000 damage.\n* Increases defense by 10% against cutting and stabbing attacks.\n* **Magic resistance +180**\n\n*A work created by Albatino, the first human to receive the nickname of 'craftsman' before Pagma's era. He aimed to create a walking fortress.*\n\n*It was acclaimed as a 'masterpiece of human history' by the founder of the Eternal Kingdom and king of the north, Loran.*\n\n*The legendary blacksmith Pagma is said to have received great inspiration from Albatino's work.*\n\n**User Restrictions:** Level 250 or higher. More than 800 **strength**. More than 1,000 **stamina**. Advanced Heavy Armor Mastery.\n\n**Weight:** 1,712\n\n> [A hidden function doesn't exist.]\n> \n> [You still don't have enough knowledge and experience to understand the materials, the production method and the intentions of the maker of <span class=\"rarity-unique\">Valhalla</span>.]\n> \n> [You have no understanding of <span class=\"rarity-unique\">Valhalla</span>.]\n\n---\n\n\"C-Cough...\"\n\n*What the hell are these things?* My hands were shaking. Khan's smithy—this backwater village workshop—had been hiding items worth a fortune. Items I couldn't even begin to understand.\n\nKhan stumbled toward me. His gnarled hands gripped my shoulders hard enough to hurt through the armor.\n\n\"You...\" His voice cracked. \"How can you use <span class=\"rarity-unique\">Dainsleif</span> and <span class=\"rarity-unique\">Valhalla</span>?\"\n\nI shook my head. \"I'm the one with questions. Khan, why are these here? Where did you get them?\"\n\n\"Heok!\"\n\nThe old man's eyes bulged. Literally. The veins in his temples stood out like cords.\n\n*Holy shit, is he having a stroke?*\n\nKhan shook me so hard my teeth rattled. \"You... Do you really know the value of these things?\"\n\n\"It's obviously incredible. The creator is the great Albatino.\"\n\n\"H-Heok! You figured out who the maker is? P-Perhaps you are...?\"\n\nRed flooded Khan's face. His neck. He swayed on his feet.\n\n*High blood pressure. Fuck.*\n\nI'd saved him from gangsters only to watch him die from shock.\n\n\"Hey, hey, Old Man! Calm down!\" I steadied him by the elbows. \"Breathe! You have to be careful!\"\n\n\"Ah! Kuoock...\"\n\n\"Heok? F-Foam?\" White spittle appeared at the corner of his mouth. \"Hey! Old Man. Don't die! I succeeded the quest, right? If you have another quest, give it to me!\"\n\n*Wait.* If Khan died, what happened to <span class=\"rarity-unique\">Dainsleif</span> and <span class=\"rarity-unique\">Valhalla</span>?\n\n\"...Hey, Old Man. Are you okay? Damn it! You have to live. You *must* live.\"\n\nI stripped off the equipment, returned it to its display, and hoisted the unconscious blacksmith onto my back. The clinic. I needed to find the clinic.\n\n***\n\nWinston had started small. A remote village, nothing special. Then the roads improved. Commerce routes opened. Now travelers flooded through daily, drawn by diverse hunting grounds, quality specialty products, and unique quests. A broadcasting survey ranked it in the top ten of 'New Villages Where I Want to Start.'\n\nOutsiders envied Winston's residents. Land prices had increased twentyfold. Everyone assumed the locals were getting rich.\n\nThey were wrong.\n\nThe reality was uglier. Most residents were poorer than ever, thanks to the Mero Company.\n\nValmont, the Mero Company's owner, had predicted Winston's potential years ago. While the village was still worthless, he'd bought up land and commercial areas for copper. Now he owned everything. Every shop bore the 'Mero' brand. The residents who'd sold cheap had been left with nothing. No jobs. No prospects. Just poverty.\n\nThe monopoly was a goldmine. Wealth poured into Valmont's coffers while the lord looked the other way, bribed into silence by higher taxes and under-the-table payments.\n\n\"People must have insight,\" Valmont said often, lounging in luxury.\n\nBut one thorn remained lodged in his side. The smithy.\n\nRoyal decree limited each settlement to a single legal smithy—a measure to prevent local powers from arming themselves into rebellion. Winston's smithy belonged to Khan, not the Mero Company. A weapons business was steady income, and Valmont wanted it.\n\nHe'd offered astronomical sums. Khan refused. The smithy had been in his family for seven generations.\n\nIntimidation didn't work either.\n\nValmont ground his teeth over the problem until inspiration struck.\n\n\"Buy quality weapons and tools in bulk from the Taji Blacksmiths,\" he ordered Rabbit. \"Sell them to Winston's residents and travelers below cost. I don't care about profit. Undercut him.\"\n\nThe strategy worked. Khan's smithy lost all competitiveness. The Mero Company's weapons were slightly inferior, but cheaper and more diverse. Customers stopped visiting Khan's shop.\n\nThen Valmont layered in a second scheme. He hired an impostor.\n\n\"If you expand the smithy, customers will have more confidence,\" the impostor told Khan. \"Business will recover. I'll lend you money at a low interest rate. Invest. Show Winston and the Mero Company you won't be defeated!\"\n\nKhan believed him. The scammer was a longtime friend—someone Khan trusted. He never imagined Valmont had bought the man's loyalty. Khan borrowed without reading the contract. The debt snowballed into an amount that would crush him.\n\nValmont savored watching Khan's collapse.\n\n\"Huhuhu, that smithy will be mine soon.\"\n\nAs a final measure, he'd hired gangsters. Surely they'd break the old man's will.\n\nBut Khan was stubborn. Even cornered, even ruined, he refused to surrender the smithy.\n\n\"Where are they?\" Valmont snapped at Rabbit now. \"I warned those gangsters. They should have finished this.\"\n\nRabbit shifted his weight. \"Master.\"\n\n\"What? They're missing?\"\n\n\"Yes.\"\n\n\"Those damn bastards!\"\n\n**Chachachang!**\n\nValmont swept his arm across the table. Delicacies crashed to the floor. Wine pooled on expensive carpet.\n\n\"Who recommended them?\" Valmont demanded.\n\n\"Biel.\"\n\n\"Bring him here. Now.\"\n\nMinutes later, Biel stood trembling before Valmont's desk.\n\n\"You recommended those gangsters,\" Valmont said quietly. \"You told me I could trust them. So explain this. Not only have they failed to deliver Khan's smithy, they've vanished. I paid them an advance. How will you take responsibility?\"\n\n\"I-I'm truly sorry. They were the most notorious in the area, so I thought—\"\n\n\"I don't want your apology. Give it to me.\"\n\n\"Huh? W-What...?\"\n\nValmont's patience evaporated. \"Money, you idiot. You're responsible for the advance and compensation for the failed commission.\"\n\n\"Y-Yes?! I-I don't have that much! Please, give me one more chance...\"\n\nBiel grabbed at Valmont's sleeve. Valmont jerked free.\n\n\"If you don't have money, acquire it. Otherwise, I'll sell you to the slave market. That should cover part of my losses. Huhuhu.\"\n\n\"M-Master! Please...please!\"\n\n\"Remove him.\"\n\nBiel had served Valmont for ten years. He'd worked like a dog. It didn't matter. Valmont tolerated no mistakes.\n\nRabbit watched the man get dragged away. *Proud and cruel.* He disliked this aspect of Valmont's nature, but the pay was good. Betrayal wasn't worth the risk.\n\nWhen they were alone again, Rabbit spoke. \"It's strange the gangsters would run. They live in Winston. Abandoning their homes for a small advance makes no sense.\"\n\n\"If they didn't run, what happened? Did the old man kill them?\"\n\n\"Most likely, something occurred at the smithy. They visited Khan this morning as usual. After that, nothing. They disappeared.\"\n\n\"Where's Khan?\"\n\n\"Also disappeared.\"\n\n\"Ridiculous! What happened in that damn smithy?\"\n\n\"We're investigating,\" Rabbit said. \"We'll know soon.\"\n\nValmont paced, mind churning through possibilities.\n\nAn informant burst through the door. \"I've found Khan's location! Two hours ago, a witness saw a strange young man carrying him on his back.\"\n\n\"A strange young man.\" Valmont's eyes narrowed. \"The culprit. Rabbit, the smithy business is yours now. Remove anyone who gets in our way.\"\n\n\"Yes.\"\n\nValmont was a talented merchant, but harsh and violent. His success came from having Rabbit—resourceful, skilled, capable of covering Valmont's deficiencies. Rabbit suppressed emotion, made calm judgments, delivered results.\n\nNow Rabbit was about to meet Grid.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 16 chapters a week.\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}