{
  "id": 260,
  "title": "Chapter 260",
  "content": "# Chapter 260\n\n\"This is the place.\"\n\n\"What?\"\n\nGrid didn't know exactly what treatment Piaro received in Reidan. He'd assumed the man would be well-respected, comfortable. A talent like that deserved luxury. \n\nApparently not.\n\n*I never thought he'd live somewhere like this.*\n\n> **[Farmer's House]**  \n> A large-scale accommodation where widowers or single farmers lived together.\n\nA great swordsman stayed in a place like this? Grid stared at the weathered building, baffled.\n\n\"Isn't Reidan huge? Why's it so hard to give him a house?\"\n\nThe man was approaching the realm of Sword Saint. He mentored everyone who asked. Grid shot Lauel a reproachful look.\n\nLauel spread his hands. \"Piaro refused anywhere else. He says he doesn't deserve to live comfortably.\"\n\nGrid's expression darkened.\n\n*Guilt.*\n\nThe man felt guilty for the family and colleagues who died because of his false accusation. Maybe Piaro hadn't slept well in years.\n\n*And on the surface, he acts so bright.*\n\nGrid had thought Piaro overcame most of his trauma. He'd been wrong.\n\n\"Duke Grid came...\" Lauel started to announce.\n\n\"No.\" Grid grabbed his arm. He turned to Asmophel instead. \"Are you ready?\"\n\nAsmophel had been silent since arriving in Reidan. Now he spoke. \"I have been prepared to die for a long time.\"\n\n\"Don't talk about dying so easily.\"\n\nThe reward for the hidden quest 'Hidden Story' depended on both men surviving. Their affinity had to rise to maximum. Grid needed Asmophel alive. But the problem was his survival depended on Piaro, not Grid.\n\n*I'm actually shaking.*\n\nGrid took a deep breath. He entered the house. The interior smelled of sweat and dirt. Exhausted farmers sprawled on pallets, too tired to acknowledge the visitors. Among them sat Piaro, alone, meditating.\n\nThe moment Piaro's eyes opened and locked with his, Grid knew.\n\n*He's become stronger.*\n\nPiaro had always been strong. Grid had fought him before, and he'd been confident he could win. Their swordsmanship might differ, but with Noe and Randy summoned, Grid believed victory was possible.\n\nThat assessment had been wrong.\n\nGrid's high Insight screamed warnings. Piaro was a monster beyond prediction now. Completely different from five years ago.\n\n*More presence than Hell Gao...*\n\nHad he achieved Sword Saint status while Grid was gone?\n\nGrid's heart hammered in his chest, pulse pounding in his ears. He imagined Piaro as a true Sword Saint. Excitement surged.\n\n\"You have become stronger, Duke Grid.\"\n\nPiaro stood, facing him. Those eyes gazed deeply, measuring.\n\n*I want to fight him.*\n\nGrid wanted to test his skills against this new Piaro. Fighting spirit blazed through him. But this wasn't the time. The quest came first.\n\n\"Did you kill Asmophel?\"\n\nDeep emotion flickered in Piaro's eyes. A glimpse of hatred.\n\nGrid shook his head. \"I didn't kill him.\"\n\n\"You didn't?\" Confusion crossed Piaro's face. \"What does this mean?\"\n\nGrid pointed toward the doorway. \"I brought him to see you.\"\n\n\"What?\"\n\nThe culprit behind everything. If that bastard was here, Piaro would tear off his limbs and grind his bones to dust. He rushed out immediately. His expression twisted into something demonic as he spotted his enemy. The pressure radiating from him was suffocating. Damian and the other Overgeared members stepped back instinctively. Only Grid held his ground.\n\n\"Asmophel!\"\n\n\"...Piaro.\"\n\nDarkness had descended on the street. Two friends who hadn't seen each other in three years. The distance between them closed rapidly.\n\nCrack.\n\nPiaro's hand clamped around Asmophel's throat. Asmophel's pale face twisted. Not from physical pain. All his emotions burst out at once, seeing Piaro again. He wanted to cry. Piaro drew his sword, then paused at the sight of Asmophel's face.\n\n\"You! Why is a shameful person like you shedding tears?\"\n\n\"I'm...sorry...\" Asmophel choked out the words he'd rehearsed countless times over the years.\n\nPiaro's heart thumped. He sensed something. Maybe Asmophel's atrocities had been against his will.\n\nBut that didn't matter right now. Hidden circumstances or not, Asmophel's sins couldn't be rationalized.\n\n\"You!\"\n\nPiaro tightened his grip. Asmophel didn't resist. He just repeated his apologies, suffocating. He'd been prepared to atone with death for years.\n\n*Kill me. Tear me apart brutally, burn my body, drop my filthy soul into hell. As long as your grudge is resolved.*\n\nPiaro read Asmophel's heart through his eyes. Twenty-five years of friendship meant he could interpret every expression. That's why the betrayal had cut so deep.\n\n\"You awful bastard!\"\n\nThe sword flew toward Asmophel's neck. Grid turned his head away.\n\n*I failed to recruit Asmophel.*\n\nThe man would die here. Grid couldn't intervene. He'd misjudged this situation. He was about to retreat when...\n\n\"Shit!\" Piaro cursed.\n\nGrid glanced back. The blade had stopped beneath Asmophel's jaw. \"Dammit!\"\n\nPiaro shoved Asmophel away. Then he sat down hard on the ground. His noble friend, Asmophel. A great man until the day of betrayal. Piaro knew him better than anyone.\n\n\"Let me hear your story.\"\n\nHe wasn't forgiving Asmophel. He'd just been curious for years. Why their bond had ended so catastrophically. He needed to know.\n\nAsmophel said nothing. He knew there was no excuse.\n\nPiaro grabbed his collar roughly. \"Say something!\"\n\nHe'd lost everything. Ironically, the only friend he had left was this enemy. He was sorry to his dead family and colleagues, but he wanted to hear it. Asmophel read Piaro's feelings. Painfully, he opened his mouth. He spoke the truth buried in his heart for so long.\n\n\"...\"\n\nPiaro's murderous expression shifted to distress as he listened. The biggest victim of this story was Asmophel himself. But Asmophel didn't try to justify anything. He described himself as weak, as the worst trash. The listeners couldn't accept that framing at all.\n\n\"...\"\n\nAsmophel tried to speak calmly. He constantly listed reasons why he should die. He kept emphasizing his sins. But with every word, Piaro's hatred lessened.\n\n\"Dammit!\"\n\nPiaro slammed his fist into the ground, losing his target for anger. Tears flowed from his eyes. He was confused, knowing the whole truth now. He couldn't kill Asmophel. But killing Asmophel felt like the right way to appease the souls of Piaro's family and colleagues.\n\nAs he struggled with the decision, Grid approached. \"I know it's hard to forgive. But now that you know the truth, isn't killing him foolish?\"\n\n\"...\"\n\n\"Isn't there a separate target for revenge?\"\n\nEmpress Marie. The woman who'd destroyed countless lives for her greed.\n\n\"Kill her.\"\n\nGrid's tone was blunt.\n\nLauel winced. *Couldn't you phrase it better?* Something like, 'Become my person. Lend me your strength, be my weapon against the empress. I'll be your sword and strike down your true enemy.' Weren't those better lines? While Lauel filled with regret, Piaro was already forgiving Asmophel.\n\n\"I can no longer resent you. Not after learning you were used in Marie's wicked schemes.\"\n\nAsmophel wept. He could only repeat his apologies. This was the ending Grid wanted. He smiled as he watched them.\n\n> **[The hidden quest 'Hidden Story' has been completed.]**\n> \n> **[The relationship between Piaro and Asmophel has improved.]**\n> \n> **[Your affinity with both has risen to maximum.]**\n> \n> **[If you recruit Piaro, the effect of barracks increases by 20% and chance of good harvest increases by 100%. You can create a 'Knights Division.']**\n> \n> **[If you recruit Asmophel, the effect of Techniques Research Institutes increases by 20%. You can create a 'Knights Division.']**\n\n> **[Knights Division]**  \n> You can command a group of knights.  \n> Buff effects depend on the appointed captain.\n\n> **[Barracks Effect]**  \n> Affects soldier training speed.  \n> Soldiers gain new tactics as level and abilities increase.  \n> Number of usable weapons increases.\n\n> **[Techniques Research Institute Effect]**  \n> Affects speed at which soldiers and citizens gain skill experience.  \n> Higher skill levels unlock greater skill variety for soldiers.  \n> Increases skill power.\n\nThe hidden quest rewards exceeded Grid's imagination.\n\n*Amazing.*\n\nA massive windfall. Exorbitant returns he couldn't easily quantify. Grid felt like he owned the world. His fists clenched as thrills raced through him.\n\n*But...*\n\nA question nagged at him.\n\n*What's the 100% increase in chance of good harvest?*\n\nWhat did that have to do with a Sword Saint? Grid puzzled over it until he suddenly recalled a notification window from Titan.\n\n> **[A legendary farmer has been born!]**\n\n*Maybe...* No. It couldn't be. *It can't be.*\n\nHe tried to shake off the sinister thought.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule: 20 chapters a week.**\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}