{
  "id": 263,
  "title": "Chapter 263",
  "content": "# Chapter 263\n\n\"First time we've met in reality.\"\n\nYoungwoo paused on his doorstep, sweat cooling on his neck from the morning jog with Sehee. A man in his mid-thirties stood waiting, hands clasped behind his back. Expensive suit, confident posture. \n\n\"Peak Sword?\"\n\nThe man's physical presence felt diminished compared to his in-game persona. Still, there was no mistaking that aggressive stance. Peak Sword. The South Korean ranker who harassed every foreigner with his favorite question: *Do you know Grid?*\n\n\"Hahaha! It's an honor that God Grid recognized me.\"\n\nYoungwoo shrugged. \"Not exactly difficult.\"\n\nThey'd raided Hell Gao together on Cork Island. Fought side by side against the Sakura Guild. Friendship forged in digital fire translated to real-world familiarity, even if this unannounced visit was strange. Still, Youngwoo found himself oddly pleased to see the man.\n\nPeak Sword must have read the confusion on his face. \"I heard you jog around this time. Took a gamble on the morning visit.\" He extended a business card between two fingers.\n\n> **[Korean Patriotic Association]**  \n> President Kang Daehan\n\nKang Daehan. Peak Sword's real name.\n\nYoungwoo turned the card over. \"Korean Patriotic Association? What is that?\"\n\n\"Our task is to spread South Korea to the world. For example, if we encounter a foreigner...\"\n\n\"I understand.\" Youngwoo held up his hand. *I don't want to hear more.* He could already picture the absurdity. \"I get the concept.\"\n\n\"For reference, my sibling's name is Minguk.\"\n\n*Daehan Minguk.* South Korea in Korean. Youngwoo blinked at the sheer commitment to patriotism Peak Sword's parents had demonstrated. \"Cool name.\"\n\n\"Right?\" Peak Sword beamed. \"My sibling hates it, though.\"\n\n\"Why?\"\n\n\"She's a girl.\"\n\n\"A girl named Kang Minguk?\"\n\n\"Yes.\"\n\nYoungwoo winced. \"I'd hate it too.\"\n\n\"Yes, same here.\" Peak Sword's expression turned solemn. \"But she can't change it. If Minguk disappears, the meaning of my name vanishes. Besides, you don't just throw away what your parents give you.\"\n\n\"True enough.\"\n\n*Wait.* Youngwoo caught himself. *Why are we even having this conversation?*\n\nPeak Sword had pulled him into some bizarre rhythm. The man probably sold insurance in another life. Youngwoo shook his head to clear it. \"Why are you here?\"\n\n\"That...\" Peak Sword began, then noticed Sehee standing behind her brother. He executed a precise ninety-degree bow. \"It is an honor to meet God Grid's sister and Saintess Ruby. This brother and sister are truly the treasure of South Korea.\"\n\nSehee's face flushed crimson. She backed toward the door. \"I'll go inside. You two talk.\"\n\nShe fled into the house. Peak Sword watched her retreat with warm approval.\n\n\"Pretty and polite. My sister Minguk is also pretty.\"\n\nYoungwoo said nothing.\n\n\"Well, shall we grab coffee and talk?\"\n\nHis throat was dry from the run. Youngwoo nodded. \"Fine.\"\n\n***\n\nThe Tomorrow Cafe was unusually quiet for late June. Final exams had ended, and university students had scattered to summer jobs or home. A few occupied the scattered tables, nursing iced drinks.\n\nThe door chimed.\n\n\"Welcome.\"\n\nHeads turned reflexively. Eyes widened.\n\n\"Peak Sword?\"\n\n\"It really is Peak Sword.\"\n\nWhispers rippled through the space. Peak Sword, South Korea's other top ranker besides Yura. Phones appeared. Camera shutters clicked in rapid succession.\n\nThe door chimed again.\n\nYoungwoo stepped inside.\n\n\"G-God Grid!\"\n\n\"Grid! We live in the same neighborhood, but this is the first time I've seen him in person!\"\n\n\"Kyaaak! Youngwoo is so cool!\"\n\n\"What's Noe doing these days?\"\n\nAttention shifted like iron filings toward a magnet. Youngwoo was the trend. Peak Sword might as well have been a third-rate actor. Peak Sword watched his companion with visible pride, then approached the counter.\n\n\"Cappu...chino.\" His voice cracked slightly. A flicker of wounded dignity crossed his face.\n\nYoungwoo ignored the stares and ordered a banana shake. They claimed a corner table, away from prying eyes and camera phones.\n\nPeak Sword leaned forward. \"I want to merge the Silver Knights Guild into the Overgeared Guild.\"\n\n\"What?\"\n\n\"We want to become members of Overgeared.\"\n\nThe Silver Knights Guild wasn't some amateur operation. Over two hundred members. They owned Cork Island, famous for gold mines and tourist appeal. Well-funded, well-organized. Easily top fifty in the global rankings. And they wanted to be absorbed into Overgeared.\n\n*That doesn't make sense.*\n\nYoungwoo frowned. \"The Silver Knights Guild is thriving. Why dissolve it to join us?\"\n\nPeak Sword met his eyes. \"Our growth has plateaued. Nobody in the guild has exceptional talent. Cork Island is geographically limited. We can't expand forces beyond the island. Eventually, we'll be left behind.\"\n\n*Culled by stronger competitors.*\n\n\"Besides, I want to add strength to your team. The pride of South Korea.\" Peak Sword's expression turned earnest. \"I want to build the strongest guild together. Raise South Korea's status.\"\n\nHe clearly expected immediate acceptance. What sane guild master would refuse to devour a massive, wealthy guild? But Youngwoo's response was cold.\n\n\"You've misunderstood something.\" He set his drink down. \"I didn't establish Overgeared for my country. The only reason I made Overgeared is so my colleagues and I can earn money and live better.\"\n\nPeak Sword blinked.\n\n\"Increasing South Korea's status?\" Youngwoo shook his head. \"Don't even dream of joining if that's your reason. The Overgeared members and I don't care about nationalism. We're a multinational guild. You know that.\"\n\n*Honestly, it's a waste.* Youngwoo wanted the resources. Wanted the manpower. The smart play would be to accept them, exploit the merger, then discard Peak Sword's patriotic nonsense once he'd stripped the guild clean. Lauel would approve. Rabbit would applaud the strategy.\n\nBut Youngwoo liked Peak Sword.\n\n*I don't want to ruin this.*\n\nIf he felt nothing for the man, manipulation would be easy. Use them, throw them away. Classic Lauel tactics. But affection complicated things.\n\nPeak Sword absorbed this, then bowed his head. \"Thank you for speaking honestly. My thoughts were selfish.\"\n\n\"I'm glad you understand.\"\n\nA waitress appeared with their drinks. She made eye contact with Youngwoo, smile lingering a fraction too long. Sharp eyes. Impressive build. Not conventionally handsome, but the kind of face that grew on you.\n\n*He's building a billion-won building, isn't he?*\n\nShe adjusted her apron, hoping for acknowledgment. Youngwoo didn't notice. His experience with female attention remained catastrophically limited. He lifted his banana shake without a glance.\n\n*Might've been different if she had a D-cup.*\n\nThe waitress retreated. Peak Sword waited until she was out of earshot.\n\n\"I still want to merge the Silver Knights Guild into Overgeared.\"\n\nYoungwoo's frown returned. *What?*\n\nPeak Sword raised his head. \"I'm a ranker. I want a better environment. I want to belong to the best guild and compete at the highest level. Everyone in the Silver Knights Guild feels the same.\"\n\nThe Overgeared Guild. A legendary blacksmith commanding top-tier talent. The synergy would be explosive. The resulting force would dominate the landscape. Peak Sword wanted that. Wanted it for himself, not just his country.\n\nMeeting Youngwoo in person had solidified the decision. *He's a good person.*\n\n\"More than anything, I want to work with you.\" Peak Sword's voice softened. \"I can't forget the Hell Gao raid. Most enjoyable day of my gaming life.\"\n\nYoungwoo remembered the swordsman mining fire stones with manic enthusiasm. A strange smile tugged at his mouth. \"Still mining these days?\"\n\nPeak Sword had discovered an addiction during that raid. Fire stones appearing in his inventory had triggered something primal.\n\n\"I enjoy it regularly. While hunting in dungeons, I mine during health recovery. Better than sitting idle. It's fun, profitable, and raises stats.\"\n\n\"Mining skill level?\"\n\n\"Beginner level nine. Almost at intermediate.\"\n\n*Hoh.* Youngwoo had suspected Peak Sword possessed talent when he'd watched him work. But this growth rate exceeded expectations. More miners would be valuable.\n\n\"Cork Island has many mines, doesn't it? Professional miners?\"\n\n\"Of course. Most residents work the mining industry. Several guild members have mining classes.\"\n\nYoungwoo's smile widened. \"Okay. I'll accept the Silver Knights Guild.\"\n\n\"Really?\"\n\nJoy radiated from Peak Sword like heat.\n\nYoungwoo held up a finger. \"One condition. You don't force other guild members to share your nationalism.\"\n\nHe was Korean himself. South Korea was rotten in many ways, corrupt and frustrating. But he loved it anyway. That didn't mean imposing those feelings on others.\n\nPeak Sword nodded immediately. \"I understand.\"\n\n*Done.*\n\nYoungwoo drained his banana shake and stood. \"Let's go. I need to log into Satisfy and discuss the merger with Lauel.\"\n\n\"Yes!\"\n\nPeak Sword's shout drew stares from nearby tables.\n\n*Did he abandon his patriotism?* No. Not remotely. Peak Sword understood the calculation. As long as Koreans belonged to Overgeared, South Korea's status would rise naturally. Indirect benefit. Plausible deniability. The best of both worlds.\n\n\"Hey.\"\n\nOutside the cafe, Peak Sword spotted a foreign couple passing on the sidewalk. He pointed at Youngwoo.\n\n\"Do you know Grid?\"\n\nYoungwoo's jaw tightened.\n\nPeak Sword was trying. Adjusting his behavior. But there were limits. *The Overgeared members are going to struggle with this one for a while.*\n\n*At least Lauel can handle the integration.*\n\nThank god for Lauel.\n\nYoungwoo said goodbye and returned home. He climbed into his capsule, mind already churning through the task list. Accept Piaro and Asmophel. Create a knights division. Observe and seal Lifael's Spear. Acquire the myth-rated item design. Save Isabel.\n\n*More Grid Sets to manufacture.*\n\nThe list stretched endlessly.\n\n\"Login.\"\n\nHis vision went black.\n\n***\n\n> **Glossary of Common Korean Terms**  \n> OG: Glossary Link  \n> Current schedule: 20 chapters a week  \n> Check out my Patreon for early access to unedited chapters and goals for extra chapters."
}