{
  "id": 264,
  "title": "Chapter 264",
  "content": "# Chapter 264\n\n**{Welcome.}**\n\n**{You came!}**\n\n**{Are you rested?}**\n\nThe Overgeared members greeted Grid the moment he logged in. He pulled up the guild roster and frowned.\n\n**{Where are Pon and Regas? What are they doing?}**\n\nBoth showed as connected, but their locations displayed as 'unknown.' That was a first.\n\n**{Been that way for two weeks already,}** Lauel replied. **{I can't reach them. They must be trapped in some unusual dungeon.}**\n\n**{Should we organize a search party?}** Vantner asked.\n\n**{A search party? For those two?}** Zednos scoffed.\n\n**{No need to worry about them,}** Jishuka added. **{Look at their levels. They've each gained one in just two weeks.}**\n\n**{They found a monster hunting ground.}**\n\n**{We don't need to waste emotions on those maniacs.}**\n\n*Really?* Grid checked their stats. Pon and Regas were both level 307—two levels higher than Faker. The gap between them had been only one level before. *Where the hell did they find such a great hunting ground?*\n\nFrom level 299 onward, the experience required to gain a single level increased exponentially. But they were level 306 and had gained one in just two weeks...\n\nGrid shook off his amazement and delivered his news.\n\n**{By the way, the Silver Knights Guild is merging with Overgeared.}**\n\n**{The Silver Knights Guild? What about Peak Sword?}**\n\nCurrently, Overgeared members were leveling at a blistering pace and causing chaos in the rankings. Existing rankers had dropped at least five spots—some as many as twenty. The Overgeared members had stolen their positions.\n\nPeak Sword, on the other hand, had climbed the rankings. Fifteenth on the unified rankings. And that was without access to Reidan, the best hunting ground available. It meant his skill level matched Pon and Regas.\n\nThe Overgeared members buzzed with interest.\n\n**{Hey, Peak Sword's becoming our companion? Isn't this great?}**\n\n**{Peak Sword is the master of the draw sword style. I watched his war video against the Sakura Guild last year.}**\n\n**{I saw that too. Peak Sword was incredible. A Sakura Guild member died every time he drew his sword.}**\n\n**{Did you see that arrogant prick Yoshimura run away?}**\n\n*Is Peak Sword that strong?*\n\nGrid liked Peak Sword. He respected the man's character and personality. But combat ability? That was another story. During the Hell Gao raid, Peak Sword had been nothing but a miner—useless in a fight.\n\n*Well, he did help me once when I was in danger.*\n\nPeak Sword had grabbed Hell Gao's attention. Thanks to that distraction, Grid had secured one fire stone unharmed. That was it. After that moment, Peak Sword hadn't played any offensive role.\n\n*Of course, back then Peak Sword only had his second advancement class.*\n\nA 2nd advancement class couldn't hope to take on Hell Gao. Now Peak Sword would have his third advancement. He'd be far stronger than before.\n\n**{But why would the Silver Knights Guild want to merge with us?}**\n\n**{The Silver Knights Guild controls Cork Island. Their guild is massive and they have serious financial power. Why would they merge?}**\n\nGrid explained the situation to the confused members. After hearing the story, they recalled what they knew about Peak Sword and nodded in understanding.\n\n**{Ah, that makes sense if it's Peak Sword.}**\n\n**{It wouldn't be strange if he started a religion worshipping Grid.}**\n\n**{Lauel, the guild merger...}**\n\n**{Leave it to me.}**\n\nLauel was overjoyed. Piaro, Asmophel, Rabbit, and now the Silver Knights Guild... It was incredible how Grid constantly rallied the best powers to his side. Grid truly was exceptional.\n\n\"They seem happy about it.\"\n\nThe guild chat window scrolled in a frenzy. Everyone was excited about the Silver Knights Guild merger.\n\nThe Overgeared Guild desperately needed this. They had too few members. They might be top rankers, but including Grid, there were only twenty-eight people in the guild. Two of them—Ruby and Sexy Schoolgirl—barely played. In this situation, absorbing the Silver Knights Guild was massive.\n\nPiaro and Asmophel approached Grid.\n\n\"Duke Grid.\"\n\nPiaro—a man who respected Grid but never yielded to him—bowed. Asmophel mirrored the gesture.\n\n\"Grant us the opportunity to serve you.\"\n\nThe moment had finally arrived. Grid smiled.\n\n\"It would be my pleasure.\"\n\nSunshine streamed through the window, illuminating Grid's face. It was a bright, dignified expression. Piaro recalled the day he'd first met Grid in Kesan Canyon. Grid had been a dark, depressed young man. Frankly, he'd looked pathetic.\n\n*But his potential was always excellent.*\n\nPiaro had never imagined Grid would grow to this point.\n\n***\n\nThe great hall was wide and undecorated, reflecting Reidan's financial situation. In a word: pitiful. Piaro and Asmophel swore their allegiance to Grid here as the Overgeared members watched.\n\nGrid experienced a new system.\n\n> [You have accepted Piaro as a subordinate. The effect of Reidan's barracks will increase by 30%. The probability of a good harvest will increase by 100%.]\n\n> [You have accepted Asmophel as a subordinate. The effect of Reidan's techniques research institute will increase by 30%.]\n\n> [You have people qualified to lead a knights division. Would you like to establish a knights division?]\n\nNo reason to hesitate.\n\n\"Form a knights division.\"\n\n> [Appoint a leader for the knights division that will be created.]\n\n—**List of People Who Can Be Appointed as Leader of a Knights Division**—\n\n**[Piaro]**\n\nPiaro can lead a total of 50 knights.\n\nPiaro's knights will have their physical attack power increased by 10%, attack speed by 3%, and movement speed by 5%.\n\nThe effect is permanent as long as the person belongs to the knights division.\n\nKnights Division's Passive Skills: Increased Health Regeneration (High), Decreased Stamina Consumption (Medium).\n\n**[Asmophel]**\n\nAsmophel can lead a total of 35 knights.\n\nAsmophel's knights will have a 5% increase in physical attack power and magic power. Skill cooldown time will be reduced by 8%.\n\nThe effect is permanent as long as the person belongs to the knights division.\n\nKnights Division's Passive Skills: Increased Mana Regeneration (Medium), Decreased Stamina Consumption (Low).\n\nClasses that relied on skills were better suited to Asmophel's knights division.\n\n*Huge buffs.*\n\nAdmiration surged through him. Grid formed two knights divisions.\n\n\"Piaro and Asmophel.\"\n\n> [Piaro and Asmophel's knights divisions have been created.]\n\n> [Please name the knights division.]\n\n\"1st Overgeared Knights Division. 2nd Overgeared Knights Division.\"\n\n\"Wait! Wait a minute!\" Lauel rushed forward from where he'd been watching nervously. He trembled as he begged. \"Please! Please give it a more inspired name!\"\n\n\"Um...\"\n\nWas dividing them by one and two too shabby? Grid felt some remorse after seeing Lauel's anguished expression. He renamed them.\n\n\"Overgeared Knights Division. Overgeared Magic Knights Division.\"\n\n\"...\"\n\nLauel was speechless. He couldn't help resenting Grid's terrible naming sense. But when he thought about it, hadn't that ship already sailed the moment the guild was named Overgeared? Given the guild's name, Overgeared Knights Division and Overgeared Magic Knights Division wasn't actually that bad.\n\n*It doesn't feel right.*\n\nWas his taste becoming more like Grid's? The thought was a nightmare. A notification window appeared in front of Grid.\n\n> [Congratulations! You have become the first owner of a knights division!]\n\n> [<span class=\"rarity-legendary\">Ruler's Cloak</span> has been acquired.]\n\nA bright red cloak materialized. The golden insignia of a dragon adorned the shoulder. It was a gorgeous, elegant cloak that immediately drew every eye.\n\n**[<span class=\"rarity-legendary\">Ruler's Cloak</span>]**\n\nRating: Legendary\n\nDurability: None\n\n* Skills 'Charge Command,' 'Military Command,' and 'Ruler's Voice' will be generated.\n\nA cloak symbolizing a monarch qualified to rule an army.\n\nWeight: 33\n\n**[Charge Command]**\n\nGrants the 'Charge' skill to your soldiers.\n\nWhen soldiers advance toward enemies, movement speed and damage will increase by 200%, depending on distance.\n\nSkill Cooldown Time: 5 minutes.\n\nNothing will be consumed by the skill.\n\n**[Military Command]**\n\nYou can change the direction of marching soldiers immediately.\n\nSkill Cooldown Time: 3 minutes.\n\nNothing will be consumed by the skill.\n\n**[Ruler's Voice (Passive)]**\n\nYou can deliver a clear voice to soldiers at any location.\n\n*These are skills for war.*\n\nSimple but effective. Considering that most Satisfy users were ordinary people who'd never commanded an army, the value of this item was astronomical.\n\nGrid had military experience. He recognized the cloak's worth immediately.\n\n*Clear, swift commands make an army stronger. Unfortunately...*\n\nThere were no additional features. It would've been better with options to raise defense, resistance, or stats. He activated Legendary Blacksmith's Appraisal, but no hidden functions revealed themselves. Maybe if he used Legendary Blacksmith's Disassembly?\n\n*Maybe there's something more.*\n\nGrid wasn't perfect yet. He was still just Pagma's Descendant. It was difficult to see himself as a true legend. If he mastered the skills of a legendary blacksmith or completed certain quests...\n\n*At that point, my current self will be no comparison. Maybe I'll learn modification skills.*\n\nIf he wanted that day to come, he needed to work harder. Grid resolved himself and stored the <span class=\"rarity-legendary\">Ruler's Cloak</span> in his inventory. He addressed those gathered in the great hall.\n\n\"Each of you should join a knights division, then continue with your missions. Lauel, coordinate with Rabbit to assign Piaro and Asmophel separate districts. Ah, and handle the guild merger.\"\n\n\"...Yes.\"\n\n*I'll take care of it. Trust me*—that's what Lauel wanted to say.\n\nBut somehow he wasn't feeling motivated today. It might be due to 'Overgeared Magic Knights Division' floating in his status window.\n\n\"Sob sob.\"\n\nLauel could only weep. Grid approached Piaro and asked an absurd question.\n\n\"Piaro, can I join your knights division?\"\n\nHe wanted the buff. Unfortunately, the lord couldn't join a knights division.\n\n\"That isn't possible.\"\n\n\"...\"\n\nGrid wanted to cry like Lauel.\n\n***\n\nGrid left the rest in Lauel's hands. Huroi joined him as he departed.\n\n\"I'll accompany you, Duke Grid.\"\n\nThe red drake was waiting in the garden. Huroi would act as Grid's pilot. They were ready to head to the Vatican.\n\n*This will be good.*\n\nHuroi was the first colleague who'd followed Grid, making him a special existence. Grid mounted the drake with a willing heart and checked Huroi's level.\n\n*290.*\n\nA meaningful smile crossed his face. Huroi couldn't help feeling curious at the expression.\n\n*What's he thinking about?*\n\nGrid addressed the puzzled Huroi. \"You heard what happened between me and Damian?\"\n\n\"Yes, I was impressed after hearing you solo raided Pope Drevigo.\"\n\n\"The Rebecca Church knows me well, right?\"\n\n\"Of course. They all praise you. Just...\"\n\nThere was one complication. Damian was fighting other candidates to become pope. Those candidates might be hostile to Grid. Saving Isabel meant becoming Damian's guardian. Huroi got an ominous feeling.\n\n*Could it be?*\n\nThe pope candidates hostile to Grid...\n\n\"Why aren't you taking off? Aren't we going to the Vatican?\"\n\n\"...\"\n\nIt was certain. His lord was about to provoke a bloodbath at the Vatican.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}