{
  "id": 265,
  "title": "Chapter 265",
  "content": "# Chapter 265\n\nGolden ceilings crowned white walls. Three palatial structures sprawled across the hills of Rolling, nestled among ancient forests and flowing waterfalls. At the center of it all, a towering statue of Goddess Rebecca stretched toward the sky.\n\nThe Vatican. Heart of the Rebecca Church.\n\n\"Isabel!\"\n\nDamian sprinted through the marble corridors, his boots echoing against stone. He needed to check on her. To see if she'd lasted another day.\n\nThe sight that greeted him crushed the air from his lungs.\n\nIsabel lay on a threadbare bed, motionless. Her platinum hair had thinned to brittle strands. The skin stretched tight over her skull, translucent and waxy. When he called her name from beside the bed, she didn't react. Her eyes stared at nothing.\n\n\"Cough! Cough!\"\n\nBlood flecked her lips. A strand of hair came away in his fingers, weightless as ash.\n\n*She can't hear me. Can't see me.*\n\nDamian's hands clenched into fists. \"Why is this room always so cold?\"\n\n\"You came.\"\n\nThe voice belonged to Cassus. The priest materialized from the shadows, his presence so faint that even now, Damian had to focus to see him. Those emotionless eyes gave him chills, but Cassus was one of the few he could trust. He'd been watching over Isabel.\n\nCassus tilted his head. \"The mission to destroy the Yatan Church in the western empire. I expected you back forty days ago.\"\n\nA week late. Damian could read the concern in Cassus's otherwise blank expression. *Does he doubt I can handle this?*\n\n\"I finished that mission over a month ago.\" Damian ran a hand through his hair. \"I stayed in the Eternal Kingdom.\"\n\nCassus blinked. \"A month ago? You destroyed an entire temple in less than a week?\"\n\nSomething like pride flickered across the priest's features.\n\n\"But why the Eternal Kingdom?\"\n\n\"I met Grid.\"\n\n\"Grid.\" Cassus straightened. The only man capable of sealing Lifael's Spear. The one who'd saved the church by bringing down Pope Drevigo. \"Is he...?\"\n\n\"He's on his way here now.\" Damian allowed himself a thin smile. \"Just like before, he'll save her. Isabel will smile again.\" He turned toward the door. \"In the meantime, I'll start my campaign against Pascal.\"\n\nForty-two days until the papal election. Enough time, surely. His class abilities as Goddess' Agent had won him followers throughout the church.\n\n*I'll build my campaign on that foundation. Defeat Pascal. Become Pope.*\n\nPascal. Direct descendant of the 5th Pope Franz. Backed by political connections and the wealth of his father, an earl in the Saharan Empire. The front-runner.\n\n*But he's corrupt.* Damian's jaw tightened. *He wants to use the church to strengthen his family's power. If he becomes Pope, we'll be worse off than under Drevigo.*\n\nMany in the church knew this. Those members would choose the righteous path. Would choose Damian.\n\nHe believed this with the certainty of the naive.\n\n***\n\nThe Elders Assembly occupied the highest chamber in the Vatican. Twenty-three of the church's most senior priests sat in a semicircle, judging those who stood before them. During the papal vacancy, their word was law.\n\nDamian stood alone in the center of the room.\n\n\"We have reports of Yatan followers operating in the Gauss Kingdom.\" The lead elder's voice echoed off marble walls. \"Goddess' Agent, Damian. You will depart immediately to search for and destroy their temple.\"\n\nDamian's eyes widened. \"There are forty-two days until the papal election. I'm a candidate. You want me to abandon my campaign?\"\n\nHe was thirty years old. He'd lived his life on his own terms, which meant he lacked the social skills to navigate church politics. The irrationality of the order stunned him.\n\nSeveral elders chuckled.\n\n\"You can't fulfill your duties because of an election?\" One of them leaned back in his chair. \"You're confessing your own incompetence.\"\n\nAnother clicked his tongue. \"This is basic work. Any dutiful priest could handle it. How pathetic.\"\n\n\"Perhaps you should withdraw your candidacy if you can't handle the responsibilities.\"\n\nA third elder smiled. \"Or Isabel could go instead.\"\n\nMockery. Contempt. Hostility radiating from every lined face.\n\n*They're with Pascal. All of them.* The realization settled in Damian's gut like ice. *But this is too blatant.*\n\nFear prickled along his spine. They weren't even hiding their opposition.\n\n*I thought this would be simpler.*\n\nThe elders wanted Isabel dead. They wanted to find a new wielder for Lifael's Spear. Every mission Damian accepted to save her was one they assigned hoping she'd die instead.\n\n*And now...*\n\nIf he went to the Gauss Kingdom, he'd lose precious campaign time. If Isabel went, she'd die.\n\nDamian had entered this election to protect Rebecca's Daughters. He couldn't sacrifice Isabel for his own ambitions.\n\n\"I understand.\" The words tasted like ash. \"I'll depart for the Gauss Kingdom immediately.\"\n\nThe mission included searching for a temple. Finding it before the election was doubtful.\n\n*The temple might not even exist.*\n\nAn obvious trap. But he had no choice. Disobeying would give them the excuse they needed to remove him. To remove Isabel's only protection.\n\n*Isabel just needs to survive until Grid arrives.*\n\nFour days. That's how long it took to run nonstop from Reidan to the Vatican. Grid had sent a whisper yesterday that he was leaving. Three more days.\n\n*Please.*\n\nDamian's footsteps dragged as he walked toward the exit.\n\n*Please save her, Grid.*\n\nWhen he returned, Isabel would be healed. He'd see her smile again.\n\nThe massive door swung open on its own, urging him to leave.\n\n\"Don't go.\"\n\nDamian froze. His gaze snapped up from the floor.\n\n\"Isabel...\"\n\nShe stood in the doorway, Lifael's Spear gripped in her skeletal hands. Her eyes were clear. Her back was straight. The white divine power of the transformation swirled around her, temporarily repairing her shattered body.\n\nTemporary. The word rang in Damian's mind like a death knell. Every second she held that spear drained more life. Now the deterioration would accelerate.\n\n\"Why?\" His voice cracked. \"Why are you here?\"\n\nThree days. She could have lived.\n\n\"Why?\"\n\nIsabel smiled. It lit up her gaunt face. \"Thank you, Damian.\" Her voice was soft. \"I heard you. Everything you did for us. You struggled alone.\" She straightened. \"Now you must become Pope.\"\n\n*No.* Damian shook his head. *No, no, no.*\n\n\"If Pascal becomes Pope, there will be more children like me. More Rebecca's Daughters suffering.\" Isabel's grip tightened on the spear. \"You can't miss this opportunity because of me.\"\n\nDamian knew she was right. If he wanted to prevent a second or third Isabel, he needed to win. This was the moment for her sacrifice.\n\n*But I don't want you to die.*\n\nThe conflict tore at him.\n\nIsabel reached out and stroked his head with her bony hand. Warm despite everything.\n\n\"I'll go to the Gauss Kingdom.\" Her smile never wavered. \"You become Pope. For Rin. For Luna. For my successor. Protect them.\"\n\nTears burned in Damian's eyes.\n\n\"Someone who wants to become Pope is shedding tears in front of others?\"\n\nThe new voice dripped with contempt. Pascal strode into the room, one hand stroking his thin mustache. His smirk was razor-sharp.\n\n\"You truly don't have the dignity of a Pope. It will disgrace the church if this crybaby takes the throne. Isn't that right, Elders?\"\n\n\"Indeed.\"\n\n\"Damian is inadequate.\"\n\n\"Pascal is the only choice.\"\n\nThe twenty-three elders voiced their agreement in a chorus of mockery.\n\nIsabel's eyes flashed. \"You dare disparage the Goddess' Agent? That's blasphemy.\"\n\n\"Mind your attitude.\" Pascal approached her, each step deliberate. \"Isabel, the Yatan Church is your enemy. Not us.\"\n\nHe stopped mere inches from Lifael's Spear.\n\n\"Know your place. You are Rebecca's Daughter only because you can wield our divine artifact. You are a tool. A weapon of war for the goddess and the church.\"\n\nHis eyes were ice. Empty of anything human.\n\n\"Like this spear, you exist to kill. Don't think. Don't speak. Understand?\"\n\n\"Shut your mouth!\"\n\nDamian lunged forward. His fists ached to smash that smug face. But if he did, they'd expel him from the church. Everything would be ruined.\n\nHe forced his hands to still, even as Pascal turned that cold gaze on him.\n\n\"Rebecca's Daughter is being abused before your eyes.\" Pascal's smile widened. \"But you swallow your anger? You're just a coward who can only shout.\"\n\n\"Save your cheap provocations.\"\n\nEvery head turned.\n\n\"You're having quite the fun after grabbing the weapon by the point, aren't you?\" The voice was sharp. Confident. \"Multiple people bullying one? Really?\"\n\nGrid walked down the hall. Solid build, black hair, eyes like flint. His presence filled the space.\n\n\"Why are you here?\" Pascal's composure cracked.\n\nThe elders shifted in their seats.\n\n\"Grid!\" Damian's face split into a grin.\n\nGrid's timing was perfect. He clapped a hand on Damian's shoulder.\n\n\"You endured well.\"\n\nHe'd made it here days early, thanks to Huroi's drake. Grid turned to Pascal and the elders, meeting their stares without flinching.\n\n\"From now on, I'm backing Damian.\"\n\n\"Backing?\" Pascal's brow furrowed.\n\nHuroi stepped forward, his orator's voice resonating through the chamber. \"As of this moment, I, Duke Grid of the Eternal Kingdom, am the guardian of Damian, Goddess' Agent.\"\n\nThe words echoed off marble and gold. Pascal's face went pale.\n\nGrid's smile had teeth. \"Don't bother him. Or you'll answer to me.\"\n\n\"Ridicule the papal candidate again, and you'll face consequences.\"\n\n\"Any complaints? Then bring them. You're all just experience points to me. Unlike Damian, I'm not bound by your rules. I can handle you however I like.\"\n\nSilence.\n\nEven Huroi seemed stunned by Grid's bluntness.\n\nThe Elders Assembly sat frozen, their certainty shattered by the presence of the man who'd killed a Pope.\n\n---\n\n**Glossary of Common Korean Terms**\n\n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day."
}