{
  "id": 266,
  "title": "Chapter 266",
  "content": "# Chapter 266\n\n*It's baffling.*\n\nGrid was a very special person for the Rebecca Church. The hero who had saved their institution by punishing the corrupt Pope Drevigo. Most members praised his feat. If he now claimed to be Damian's guardian, a big wave would follow. Numerous believers would rally behind Damian.\n\n*That fool Damian was preparing for his loss all along.*\n\nIt was a deadly move. The elders had never imagined that such a seemingly incompetent man would summon someone as influential as Grid.\n\n*This is a crisis.*\n\nThe election wasn't the only way Grid could tip the scales. By sealing Lifael's Spear, he could eliminate Damian's greatest weakness.\n\n*Ah, this is a quandary.*\n\nUnlike the anxious elders, Pascal's face remained relaxed. He had dealt with Grid before. He could turn this crisis into an opportunity.\n\n*Grid isn't a hero.*\n\nPascal knew the truth behind Grid's defeat of Drevigo. The man hadn't acted for the Rebecca Church's sake. He'd done it for himself.\n\n*He killed Drevigo because he needed to bless that odd mineral called pavranium.*\n\nGrid was selfish and violent. When the pavranium received God Judar's blessing, Pascal had witnessed Grid's true nature firsthand.\n\n*The more selfish a person is, the easier they are to handle.*\n\nWhy was Grid claiming to be Damian's guardian? Simple. There was something in it for him.\n\nPascal's lips curved into a smile.\n\n*Grid, I can give you more than Damian ever could.*\n\nWealth, power, beauty. He would offer Grid everything the man desired.\n\n*So leave Damian and come to me.*\n\nIf he secured Grid's allegiance, he could unseal all three divine artifacts and win the election. It was the perfect opportunity to become Pope with the strongest Rebecca's Daughters at his command. Pascal broke the uncomfortable silence with deliberate cheer.\n\n\"Hey! Who is this? The savior of the Rebecca Church! Hero among heroes!\" He strode forward, smile blazing. \"If it isn't Grid!\"\n\nPascal praised him with exaggerated words while extending his hand for a shake.\n\n\"I'm so glad to see you again.\"\n\nGrid's brow furrowed.\n\n*This bastard can smile instead of getting angry after my blatant provocation?*\n\nIt was unexpected.\n\n*He was like this before, too.*\n\nGrid had taken the Holy Light set that Pascal wanted, yet the man had welcomed him rather than showing hostility. He'd thanked Grid for punishing Drevigo, held a banquet, and given God Judar's blessing without conditions. Pascal was dangerous. The type who avoided making powerful enemies.\n\n*I need to provoke him harder.*\n\nGrid clasped the offered hand.\n\n\"Nice to see you as well.\"\n\nPascal's confidence swelled at the civil response.\n\n*That's right. The other elders might be wary, but he has no reason to be rude to me.*\n\nGrid had to be aware of it. Pascal would be far more useful than Damian. Filled with certainty, Pascal seized control of the conversation.\n\n\"You're a duke of the Eternal Kingdom now? Truly heroic. Your outstanding abilities have been recognized.\" He gestured toward the exit. \"Now, let's move to a better location. I'll prepare a reunion celebration banquet. We can catch up properly.\"\n\nDamian's face went pale as he watched the exchange.\n\n*Grid and Pascal know each other?*\n\nThis was bad. Pascal was extraordinarily wealthy. Grid might be swayed by money. As worry gnawed at Damian, Pascal drove in the final wedge.\n\n\"Sir Grid, I'll prepare many gifts for you today.\"\n\n\"Oh? Gifts.\" Grid's tone shifted with interest. \"I'm looking forward to it.\"\n\nDamian's stomach dropped. Pascal's smile deepened.\n\nThen Grid spoke again.\n\n\"But Pascal, I'm a duke, right?\"\n\n**Crack.**\n\nGrid's grip tightened around the hand he held. Pascal's face contorted.\n\n*What is this...?*\n\nThe strength was incredible. Pain shot through Pascal's hand. He tried to pull away. Grid didn't let go.\n\n\"You aren't Pope yet.\" Grid's voice was conversational, almost pleasant. \"A Pope candidate asks for a handshake instead of greeting me properly? You seem to be making fun of me, Pascal. Was it a lie when you praised me as a hero?\"\n\n*You're just the duke of a small kingdom!*\n\nPascal was a noble of the Saharan Empire. He recognized no nation but the Empire as worthy. He considered all others small and barbaric. He was a nationalist who believed only the Empire deserved Goddess Rebecca's blessing. Being treated this way by some minor kingdom's duke was the worst humiliation imaginable.\n\n\"What is this violence? Let go!\" His shout cut off when he met Grid's eyes.\n\n*You...!*\n\nThere were no readable emotions in those eyes. No measurable depth. Grid's gaze was unfathomable, yet the intent was crystal clear. A provocation.\n\n*Bring it on, Pascal. I want to destroy you.*\n\nThe message couldn't be clearer.\n\n*A beast!*\n\nAs Pascal's composure cracked, a figure dropped from the ceiling. A knight in red armor materialized between them. Kamiyan, the 30th knight of the Red Knights. The Emperor himself had assigned him to Pascal in hopes the man would become Pope.\n\n\"Let go.\" Kamiyan's sword pressed against Grid's neck.\n\nGrid snorted.\n\n\"What if I don't want to?\"\n\n\"I'll cut off your hand.\"\n\nNo hesitation. The blade moved toward Grid's wrist.\n\n\"Stop!\" Pascal's voice cracked through the chamber.\n\nKamiyan's sword halted a hair's breadth from Grid's skin. Grid's eyes narrowed. His hand had already been moving toward his inventory to summon Failure.\n\n*Too bad.*\n\nPascal wrenched his hand free, fingers throbbing.\n\n\"Sir Grid, I'll overlook your rudeness today.\"\n\n\"You don't have to.\" Grid's smile was all teeth. \"I already told you. If you have a complaint, come forward. Bring it on.\"\n\nSilence.\n\nAnger boiled in Pascal's chest. He was the son of a Saharan noble, a man who had risen to prominence within the Rebecca Church. No one had ever treated him like this. Every instinct screamed to order Kamiyan to strike Grid down. But he forced himself to breathe. He needed Grid's strength to unseal the three divine artifacts.\n\n\"I hope we can laugh together when we meet again soon.\" Pascal's face was crimson. \"I'll always have a gift waiting for you.\"\n\nHe turned and strode away, Kamiyan and the elders trailing after. Grid watched them go with visible disappointment.\n\n*His patience is impressive.*\n\nGrid couldn't attack senior NPC priests first. As long as they weren't abandoned by the goddess like Drevigo had been, they remained under her protection. Striking first would bring a curse.\n\n> [Goddess' Curse]\n> The unlucky stat will be generated.\n\nThe unlucky stat was too vague. Grid had no desire to be cursed by a goddess. That's why he'd tried provoking Pascal into attacking. It hadn't worked.\n\n*Well, don't worry. Just wait.*\n\nFrom Pascal's perspective, Grid was an eyesore. Eventually, the man would make a move.\n\nAfter Pascal and the elders departed, Isabel approached. She'd remained silent throughout the confrontation.\n\n\"It has been a long time.\"\n\nHer voice was cold. She clearly had complaints.\n\n*I hate you.*\n\nIsabel had suffered terrible pain because of Grid. This situation existed because he'd forgotten to seal Lifael's Spear.\n\n\"I'm sorry.\" Grid's apology was sincere.\n\nIsabel gritted her teeth.\n\n\"Why are you sorry? Are you apologizing for unsealing Lifael's Spear?\" Her hands clenched into fists. \"Don't make me laugh. I was able to save my friends because you released the seal. The entire church was saved. So don't apologize.\"\n\nShe was grateful.\n\n*Then why is she angry?*\n\nTears welled in Isabel's eyes as Grid stood puzzled.\n\n\"You always do this.\" Her voice wavered. \"Why do you only show up when I'm in a desperate crisis? Like a prince on a white horse.\"\n\nIsabel had feelings for Grid. Her emotions had intensified after being saved from the brink of hell. But Grid had already rejected her once. This time would be no different.\n\n\"You won't accept me anyway, so why are you acting like this...?\" She whispered the words while bowing her head. They didn't reach Grid's ears.\n\n*Her condition is terrible. She must be in so much pain.*\n\nGrid studied Isabel with concern. Her beautiful platinum hair had faded to near grey, dull and lifeless. Her lustrous red lips were pale. Her body looked skeletal, almost mummified. There was another problem.\n\n*Her breasts have gotten smaller.*\n\nWeight loss, obviously. The original B cup had diminished to an A cup. Truly a shame.\n\n\"W-Where are you looking? Pervert!\" Isabel covered her chest with both arms.\n\n\"What is there to look at?\"\n\n\"What is there to look at? What does that mean?\"\n\n\"Do I need to explain?\"\n\n\"Forget it!\"\n\nDespite everything, Isabel seemed more energetic than she had in a long time. Damian watched the exchange with a smile.\n\n*Isabel, you've always missed Grid.*\n\nHe hoped her feelings would reach him. Damian was genuinely rooting for her. He wasn't a rival for Grid's affection.\n\n*It's natural for the heroine to connect with the hero.*\n\nHe was just an extra. Too incompetent to be anything more. He was content watching Rebecca's Daughters from the sidelines.\n\nHuroi sidled up to Damian and whispered, \"Don't worry. She doesn't fit My Lord's taste.\"\n\n\"...\"\n\nThe beautiful Isabel didn't suit Grid's taste? That was somehow offensive. Damian was processing this when Grid's voice cut through his thoughts.\n\n\"How long are we going to stand here? Guide me to a suitable place.\"\n\nIt was time to figure out how to create and seal Lifael's Spear.\n\n---\n\n**Glossary of Common Korean Terms.**\n**OG: Glossary Link.**\n**Current schedule: 20 chapters a week.**\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}