{
  "id": 267,
  "title": "Chapter 267",
  "content": "# Chapter 267\n\n\"Beautiful and benevolent Goddess Rebecca, give your light to this weak and foolish servant who can't move without it. I will use your light to save the weak and punish the wicked.\"\n\nPascal knelt in the first prayer room. This sacred space, reserved only for the pope, now served as his personal sanctuary. He needed to cleanse the fury Grid had ignited, to reclaim the composure that was his greatest weapon.\n\n\"...May the whole world be bathed in the warm light.\"\n\nThe final words of his prayer echoed in the silence. Pascal rose, brushing dust from his knees. His breathing steadied. The rage that had coiled in his chest loosened its grip.\n\n*It isn't simply riches or power that Grid covets.*\n\nIf it were, the man would have crumbled under temptation already.\n\n*There's a special link between him and Damian.* An unexpected variable. *But eternal friendship doesn't exist. Even blood and flesh will kill each other when greed takes hold.*\n\nOnly faith remained constant. Everything else could be corrupted.\n\nPascal's lips curved into a smile. \"Open the warehouse.\"\n\n\"Yes!\"\n\nHis followers from the Judar Church moved with practiced efficiency.\n\nThe secret door behind the goddess's statue groaned open. Golden light spilled across the stone floor. Treasures and coin filled the hidden vault, relics of Drevigo's greed preserved for this very purpose.\n\n*Grid, how much will make you satisfied?*\n\nPascal's men began loading the gold into chests. Each coin was a link in the chain he would use to bind the legendary blacksmith.\n\n*I will offer more if it's still lacking. If that is not enough, I will give even more. In the end, you will be caught by my hands.*\n\nKamiyan watched the preparations, his jaw tight. \"That person called Grid. Isn't it better to just kill him?\"\n\n\"He is the only one who can unseal the three divine artifacts of our church.\" Pascal gestured dismissively. \"He can't die.\"\n\n\"What if you can't obtain him?\"\n\n\"Haha, that won't happen. He's very greedy. He will surely accept my heart.\"\n\n\"...\"\n\nPascal radiated confidence, but Kamiyan felt the weight of doubt settle in his gut.\n\n*He's a wild beast. He can never be tamed.*\n\nThe memory surfaced unbidden. When Kamiyan had aimed his sword at Grid's wrist, the man hadn't flinched. Not a single blink. Grid had been prepared to sacrifice his hand to reach Kamiyan's throat. The cold calculation in those eyes had sent a chill down Kamiyan's spine.\n\n*That isn't a skill you develop after fighting once or twice. His momentum was overwhelming. Perhaps I would've had to fight properly.*\n\nGrid's power might benefit the church, but if he became an enemy...\n\nThe emperor's command rang clear in Kamiyan's mind. Pascal must become pope. Kamiyan would carry out that order, which meant eliminating all threats.\n\n\"Come out.\"\n\nHe moved beyond Pascal's line of sight and spoke into the shadows.\n\nA flicker of movement. The darkness answered.\n\n\"You saw that guy called Grid, right?\" Kamiyan kept his voice low. \"Can you assassinate him?\"\n\n\"Is that a question that needs to be asked?\" The assassin's reply dripped with contempt. \"I can even kill a mouse.\"\n\nNot an empty boast. Crow possessed the skill to eliminate enemy knights. With Doran and Kasim vanished, no living assassin could match him.\n\n\"Good answer. Kill Grid as soon as possible.\"\n\n\"Look forward to tomorrow morning. He will be hung on Goddess Rebecca's statue.\"\n\nCrow melted back into shadow.\n\n***\n\nGrid's frown deepened as he stepped into Isabel's room.\n\n\"What is this?\"\n\nA shabby bed. That was it. The only furniture in this tiny cell. Cold air seeped through cracks in the stone, biting at exposed skin.\n\n\"There isn't even a fireplace?\" He moved to the wall, touching the grey surface. Stone powder crumbled under his fingers. \"It will be freezing in the middle of winter.\"\n\nHe shook off the dust and turned to Isabel. \"Hey, you will catch pneumonia.\"\n\nShe stood silent, unmoving.\n\n\"It's still like this?\"\n\n\"...\"\n\n*Rebecca's Daughters suffered under Drevigo too.* Despite their strength, they had never rebelled. They endured this cruelty without complaint.\n\nIt made Grid's blood simmer. But what could he do? The church had raised these women as weapons, teaching them only obedience. The brainwashing ran marrow-deep.\n\n*The church's fault. Not theirs.*\n\nOn the surface, the Rebecca Church preached peace and charity. Beautiful words. Empty promises. From where Grid stood, this organization differed from the Yatan Church in name only.\n\n*Bad people.*\n\nPascal's smug face flashed in his mind. The way the elders sneered at Damian. How they treated Isabel like a disposable tool.\n\nThe assassin Shay's words echoed back to him.\n\n*'The Yatan Church stands for pure evil. They believe evil is the right way. But the Rebecca Church commits atrocities while claiming virtue. The front and back are different, so they are far sneakier and more dangerous.'*\n\n*It wasn't always like this.* Drevigo had rotted everything from the inside.\n\nThe current leaders were Drevigo's students. They had tasted the sweet fruit of corruption and discovered they enjoyed the pain of others. Could they abandon that pleasure?\n\nNo. The evidence stood before him. They followed Pascal without resistance, surrendering to temptation.\n\n*Pruning is required.*\n\nGrid's jaw set. *Damian should be pope.*\n\nAn otaku, yes. But a pure person. Under Damian's leadership, the church could change.\n\n*First, Pascal can't become pope.*\n\nPascal came from the empire. The son of Earl Chirita, a powerful noble. If Pascal seized the papacy, the empire would control the Rebecca Church completely. Lauel was convinced the empire's strength would multiply. Grid agreed with that assessment.\n\n*Someday I'll be hostile to the empire when I become king. They can't become stronger than they are now.*\n\nHe considered his options, then spoke.\n\n\"Damian, you should start your campaign right now. Make sure you thoroughly advertise that I am your guardian. Huroi will help you.\"\n\n\"Yes!\"\n\nHuroi. The first ranked orator. His words could capture ears and hearts with equal ease. He would be invaluable support for Damian's bid.\n\n\"In the meantime, I will seal Lifael's Spear.\"\n\nGrid sat on Isabel's bed. He studied the weapon in her trembling hands.\n\n\"Legendary Blacksmith's Appraisal.\"\n\n> [The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\n> [<span class=\"rarity-mythic\">Lifael's Spear</span>]\n> \n> **Rating:** Myth  \n> **Durability:** 1,500/1,500  \n> **Attack Power:** 1,330~1,890  \n> \n> * **Divine Power** +3,000  \n> * **All stats** +200  \n> * 300% increase in health recovery  \n> * Fixed damage of +5,000 on each attack  \n> * High probability of activating the 'Light Wheel' skill  \n> * High probability of activating the 'Shield of Light' skill  \n> * High probability of activating the 'Light of Guidance' skill  \n> * The skill 'White Transformation' will always be invoked  \n> * Attack power +50% against those with dark magic power  \n> \n> One of the three divine artifacts of the Rebecca Church.\n> \n> It contains tremendous divine power that human beings cannot handle, placing a heavy burden on the user's mind and body.\n> \n> Since Rebecca's Daughters became short-lived after being unable to cope with the power of this weapon, 5th Pope Franz asked Pagma to seal its power.\n> \n> However, Pagma's Descendant appeared in the days of 13th Pope Drevigo and released the seal on the weapon.\n> \n> **Conditions of Use:** Rebecca's Daughter  \n> **Weight:** 400\n\n> [You have already uncovered the hidden feature of the item.]\n\n*In order to reseal this...*\n\nHe needed to understand its structure. How it was made. The process of disassembly and assembly would reveal everything.\n\nGrid had torn apart and rebuilt countless items since becoming Pagma's Descendant. He knew how to read the language of metal and magic. This task should be simple.\n\n*But the reality is different.*\n\nThe problem was Isabel. Her condition was far worse than expected. If she released Lifael's Spear, even for a moment, she would die. Which meant he couldn't disassemble it.\n\n*I have to do it with observation alone.*\n\nNo guarantee of how long it would take. But one thing burned clear in his mind.\n\n\"Isabel, I will be sure to save you.\"\n\nShe was precious. They shared memories. And Damian loved her the way Grid loved Irene.\n\n*I won't allow you to die.*\n\nGrid began his examination. He studied every curve, every rune, every thread of divine power woven through the weapon's structure. Was it possible to reach 100% understanding through observation alone? With his current abilities?\n\nImpossible.\n\nBut Grid believed in his potential.\n\n*I have abilities that haven't blossomed yet.*\n\nClass quests were designed to unlock power. To draw it from dormant depths.\n\n*I can do it.*\n\nHis class quest had stalled. More than a year since he received it.\n\n*The developers aren't brainless.*\n\nThey would have prepared a method to awaken his power even if the quest remained incomplete.\n\nThe answer lay in Lifael's Spear. Why had the system led him to unseal this weapon in the first place? The guidance had been deliberate. An arrow pointing him toward this exact moment.\n\n*An arrangement to let my skills blossom.*\n\nGrid's eyes sharpened. His focus narrowed until nothing existed except the spear. The willpower and spirit forged through countless trials took hold.\n\n*Grid...*\n\nIsabel's racing heart began to slow. Somehow, she felt a presence. A warmth.\n\n*Believe in him.*\n\nWas that the voice of Goddess Rebecca?\n\n***\n\nDawn approached. Stillness blanketed the church grounds.\n\nCrow emerged from the window's shadow and observed Grid through the glass.\n\n*It's already been 8 hours.*\n\nThe man sat motionless in that cramped room. For eight full hours, Grid had examined Lifael's Spear. His entire being focused on the weapon. Every sense committed to that single task.\n\n*Full of holes.*\n\nCrow's gaze shifted to Rebecca's Daughter. Asleep. Vulnerable.\n\n*This will be an easier assassination than I expected.*\n\nHe dropped from the window ledge, landing beneath a tree without sound. He entered the building. Not a whisper of fabric. Not a breath out of place.\n\n\"...\"\n\nCrow glided down the hallway. Even the rats failed to notice his presence.\n\nBut something watched from the shadows."
}