{
  "id": 268,
  "title": "Chapter 268",
  "content": "# Chapter 268\n\nSomething watched from the shadows.\n\nNoe.\n\nHis small, round haunches shifted left, then right. His paws pressed flat against the stone floor. The best demonic beast of hell stalked his prey.\n\n*This is a scientific, beautiful, and perfectly designed hunting posture.* Noe's tail twitched. *Nyang!*\n\nCrow climbed toward the third-floor landing, unaware. He was a competent assassin, but not skilled enough to sense the best demonic beast of hell lurking in darkness. The third floor housed Isabel's room.\n\n*Soon.*\n\nCrow imagined the moment. His dagger plunging into Grid's flesh.\n\n\"Kyong!\"\n\nNoe launched himself through the air. His small fangs glinted in the dim light.\n\nCrow's eyes widened. A cat? He'd never been caught off guard by a housecat before.\n\n*I didn't notice it following me?*\n\nThe shame burned. The embarrassment stung deeper. But Crow was a professional. He'd survived eighty-nine kills and countless crises. Panic was a luxury he couldn't afford. His breathing steadied. His pulse calmed.\n\nNoe's paw swiped down.\n\nCrow raised his dagger to deflect.\n\nThe impact jarred his wrist. His fingers went numb. The blade nearly slipped from his grip.\n\n*Why is this cat so strong?*\n\nNot a normal cat. Crow spotted the details now. Small horns protruding from the forehead. Vestigial wings folded against the back. A high-class demonic beast.\n\n*How is a demonic beast here?*\n\nThe Vatican radiated divine power. Monsters couldn't approach without withering. One step past the threshold should have killed this creature.\n\nThat was the problem.\n\nNoe struggled to channel his strength. His limbs felt heavy. His reflexes dulled.\n\n*It's serious.*\n\nHis master had given clear orders. Stay vigilant while Master concentrated. If enemies invaded, alert Grid immediately. But Noe had failed.\n\n*I moved unconsciously.*\n\nNoe considered himself rational, but instinct ruled him. He was young. When the dark figure slipped through shadows, Noe pounced. No thought. No control. Just action.\n\nThe divine power pressed down on him like a weight. The Rebecca Church's Vatican was suffocating. His body refused to obey. But the best demonic beast of hell would never lose to a human.\n\n\"Nyaang!\"\n\nNoe swung again.\n\nHis claws raked across Crow's ear. Blood welled. Crow jerked back, pulse hammering.\n\n*Fast. Too fast for a normal beast.*\n\nThe cat was a demonic beast. Clearly. Perhaps it concealed a larger form. Perhaps it possessed the skills of an intermediate-level demonkin. Nothing else explained its presence in the Vatican's sanctified air.\n\n*I need to take this seriously.*\n\nThe reason didn't matter. One more target. One more kill.\n\nCrow drew a short sword with his left hand. His right held the dagger. His stance shifted. The famous Crow emerged.\n\n\"Kiyong!\"\n\n*No strength.*\n\nCrow blocked the next strike with his short sword. He cut diagonally. He thrust with the dagger.\n\nThe blade opened a shallow wound on Noe's chest. The short sword sliced through nothing but air. The dagger missed entirely.\n\nCrow's expression twisted.\n\n*It dodged?*\n\nNoe bared his fangs.\n\n\"Nyaang!\"\n\nThe claws came faster. Harder. Crow struggled to parry. He crossed his weapons to block. Then he understood.\n\n*A senior demonkin.*\n\nHow was that possible? Demonic beasts served demonkin. They didn't rival them. Shock froze Crow for half a second. Then he reached for his trump card.\n\nThe walls trembled. The floor shuddered. The shadows on the ceiling writhed.\n\nNoe's eyes widened.\n\nCrow smiled. \"Go to hell.\"\n\nHe spoke for the first time. The shadows on all four sides shifted. They formed thorns.\n\nSix thorns launched from different angles.\n\nNoe recognized the danger. He activated Fluidization.\n\n> [Fluidization]\n\nPhysical damage should pass through him harmlessly. But the divine power disrupted the skill. Fluidization failed. Soul Ingestion was completely sealed.\n\nOne thorn pierced Noe's small body.\n\n\"What, nyang?\"\n\nNoe hit the floor. Pain lanced through him.\n\n*It's unfair, nyang.*\n\nSoul Ingestion would have turned the tide. Noe hated the Vatican.\n\nCrow's boot came down on Noe's belly. Noe's mouth gaped. A pained sound escaped. Crow laughed. \"This is the end of the demonic beast.\"\n\nHe raised the short sword toward Noe's face.\n\n\"Die.\"\n\n\"It's up to here.\"\n\nCrow spun toward the voice. Nothing. Only darkness filled the space.\n\n*A hallucination?*\n\nNo signs. No presence. Stealth beyond human limits.\n\nThen Crow felt it. The shadows slipping from his control.\n\nThe shadows surged like a wave. Crow tried to dodge. Too slow.\n\nThe force slammed into him. Lifted him. Compressed.\n\n\"Kuak!\"\n\nCrow's body hurtled through the air. The shadows crushed him.\n\n*The speed. The control. Impossible.*\n\nThe shadow technique couldn't evolve to this extent. The pressure increased. Crow thrashed. The pain intensified.\n\nA man stepped from the darkness.\n\n\"Y-You...!\"\n\nBlack skin. Gaunt frame. Arms abnormally long. Only one person fit the description.\n\n\"Kasim!\" Crow's voice cracked.\n\nThe assassin who commanded shadow soldiers. The man who transcended mere offense and defense with shadow arts.\n\n\"King of Shadows!\"\n\nWhy was he here? Crow wanted answers.\n\nDeath came instead.\n\nThe shadows tightened. Crow couldn't scream. Kasim removed the body. The shadows swept the area clean. Even the bloodstains vanished.\n\nKasim glanced at the unconscious Noe. \"The more I look, the cuter it is.\"\n\nHe disappeared into shadow.\n\n***\n\nBirds chirped. Warm sunlight touched Noe's fur.\n\n\"Nya.\"\n\nNoe woke from peaceful sleep. He looked left. Then right.\n\n\"Heok! What is going on? Kyak!\"\n\nDawn. A savage human. A terrible technique. Being knocked unconscious. Noe traced the memories and found them ridiculous. The best demonic beast of hell beaten by a human?\n\n\"It's a disgrace! Nyang!\"\n\nUnacceptable. Even accounting for the Vatican's suppression. Why should this great body suffer such indignity?\n\nNoe trembled with anger. Then a question surfaced.\n\n\"Why am I alive? Nyang?\"\n\nIf knocked unconscious by a human, death should follow. Noe considered the question. He reached a conclusion.\n\n\"It was a dream! Nyang!\"\n\nLast night wasn't real.\n\n\"Nyahahat! That is it! How can the best demonic beast of hell be beaten by a human? Nyahahat!\"\n\nNoe convinced himself.\n\nWhat other explanation existed? His wounds had healed completely thanks to his tremendous resilience. The logic held.\n\n> Ttiring~\n\nNoe's status shifted from frustration to self-satisfaction.\n\nGrid ignored the pet window. He was too focused on Lifael's Spear.\n\n***\n\n*I'm screwed.*\n\nGrid felt the pressure building. Two days observing Lifael's Spear. No progress. No insight.\n\n*Was I thinking too easily?*\n\nRecent victories had made him complacent.\n\n*I can't understand what's connecting the parts.*\n\nThe bonding area was flawless. Grid couldn't identify the technique.\n\n*It's impossible with forging alone. But it isn't one piece.*\n\nDisassembling and reassembling the spear would reveal the secrets. But Isabel made that option impossible. Grid continued observing, building a mental model of the structure.\n\nThe next day, an uninvited guest arrived.\n\nPascal entered the room. \"I want to give you a present.\"\n\nHe extended a box. One million gold gleamed inside. Nearly twice Damian's offering of 530,000 gold. In cash terms, 1.2 billion won.\n\n> [Would you like to receive Pascal's gift?]\n> [If you receive the gift, you must unconditionally accept one of Pascal's requests.]\n\nGrid snorted. \"Are you kidding me? This is the extent of your gift? Get lost.\"\n\nHe wasn't desperate enough to cling to short-term profits anymore. His eyes stayed fixed on the horizon. One million gold wouldn't buy his cooperation in letting the empire devour the Rebecca Church.\n\nTwo more days passed.\n\nGrid drove Pascal away. He decided to change his perspective on Lifael's Spear.\n\n*Maybe the secret isn't in the technique but the materials.*\n\nThe main ingredient was adamantium. Silver by nature. But the bonding area showed blue.\n\n*No other minerals were used. Something must be mixed with the adamantium.*\n\nThere was clearly something else.\n\n*This... perhaps?*\n\nUnderstanding flickered in Grid's mind."
}