{
  "id": 270,
  "title": "Chapter 270",
  "content": "# Chapter 270\n\nPascal approached with his entourage trailing behind. He'd bent himself into shapes that would make a contortionist proud, all to secure Grid's allegiance. The disgrace sat like bile in his throat, but he swallowed it down and forced his face into a pleasant expression.\n\n\"Duke Grid! What brings you outside today?\"\n\nGrid glanced at him. Pascal gestured, and his men dropped a heavy treasure chest onto the cobblestones.\n\nThen Pascal's eyes locked onto the spear in Grid's hands. His manufactured smile twisted into something genuine.\n\n*Isabel's dead.*\n\nRelief flooded through him. That cockroach of a girl had finally been crushed.\n\n*Ten years. Ten years of that obstinate brat questioning every order.*\n\nRebecca's Daughters were supposed to be tools. Obedient weapons. But Isabel, Rin, and Luna had served under Pope Ruiz, the reformer, and under Pope Drevigo, the corruptor. That dual experience had taught them to think. To judge. To question.\n\nUnacceptable.\n\nPascal needed the Rebecca Church as a subsidiary of the Saharan Empire, and these three girls stood in his way. Now Isabel was gone. One obstacle removed. He'd give Lifael's Spear to someone more malleable, then arrange accidents for Rin and Luna.\n\n*My world is coming.*\n\nJoy surged in his chest, threatening to spill across his face. He barely contained it when he noticed Grid's expression.\n\nThose cold eyes cut through him.\n\n\"A girl who spent her entire life bleeding for your goddess and your church just died.\" Grid's voice was flat. \"Why are you smiling?\"\n\nPascal's face contorted. He wanted to strike this insolent duke for diminishing service to the noble goddess. But he'd invested too much patience to throw it away now.\n\nHe forced his anger down. \"As you've said, Isabel served the goddess and the church her entire life. Now that child has gone to the goddess's side.\" The words tasted like ash. \"She'll serve the goddess forever in the divine realm and live in eternal happiness. I'm proud of her sacrifice. How could I not smile?\"\n\n*Bullshit.*\n\nGrid couldn't stomach another word. Pascal lifted the treasure chest.\n\n\"Please accept this today.\"\n\n> [Pascal wants to give you 1.8 million gold. Would you like to receive Pascal's gift?]\n\n> [If you receive the gift, you must unconditionally accept one of Pascal's requests.]\n\n\"Damian won't become pope anyway.\" Pascal's confidence oozed from every word. \"What does it matter if he wins the congregation's hearts? Only one hundred senior priests hold voting rights, and at least eighty percent already belong to me. Duke Grid, look toward the future. Make the wise choice.\"\n\n\"I don't want it.\" Grid cut him off. \"I have no intention of joining hands with someone whose face makes me want to vomit.\"\n\nThe hatred ran deep. Pascal wore the same expression as every bully who'd tormented Grid in his previous life. The image of Pascal humiliating Damian and Isabel had burned itself into Grid's memory. He wouldn't ally with this man for a hundred million gold, let alone less. Besides, there were political considerations.\n\nPascal's smile evaporated. His patience cracked.\n\n\"Then we're done with pleasantries?\" His voice hardened. \"I've spent days trying to befriend you. You've mocked every effort and insulted me repeatedly. Don't you understand basic courtesy?\"\n\n\"Why should I be courteous to you?\" Grid met his glare. \"You enjoy mocking and insulting others. Why should you be exempt?\"\n\n\"Ack!\"\n\nPascal saw the wall for what it was. Immovable. He abandoned pretense and spoke bluntly.\n\n\"Tell me what you want! Name your price! I'll give you anything if you join my side. What will make you hold my hand?\"\n\n\"Anything?\"\n\n\"Yes!\"\n\n\"Hoh.\" Grid stroked his chin. \"Isn't this tempting?\"\n\nPascal's eyes lit up. Finally, progress. He leaned forward, ready to negotiate.\n\nGrid told him, \"A thousand trillion.\"\n\n\"...?\"\n\nA thousand trillion? Was that some legendary artifact?\n\n*I've never heard of such a treasure.*\n\nGrid clarified for the confused priest. \"Give me one thousand trillion gold. Then I'll be your true friend.\"\n\n\"This is crazy!\"\n\nThe words burst out before Pascal could stop them. One thousand trillion gold would drain the entire empire's treasury. No, it would bankrupt every nation on the continent combined. Grid demanding such an absurd sum proved his insanity.\n\n\"What? Crazy?\" Grid's voice dropped. \"You said you'd give me anything I want, but I'm crazy?\"\n\n\"No, I...\" Pascal backpedaled. \"The shock made me delirious...\"\n\nGrid waved him off. Excuses didn't interest him.\n\n\"The negotiations have collapsed. Let's go our separate ways.\"\n\nHe reached for Lifael's Spear, intending to head for the smithy. A blade suddenly pressed against his neck. Kamiyan had moved with silent precision.\n\n\"Leave Lifael's Spear.\" The knight's voice was cold. \"How long will an outsider carry the church's sacred weapon?\"\n\nGrid's eyes darkened as he stared at the gleaming steel.\n\n\"Second.\"\n\n\"What?\"\n\n\"This is the second time you've pointed a sword at my neck.\" Grid's tone remained level. \"I'm the duke of a kingdom.\"\n\nKamiyan scoffed. \"So what? Will you run crying to Wiesbaden? Tell on me to your king like a child?\"\n\nThe knight of another nation was disparaging Grid's sovereign. The provocation was deliberate. Kamiyan expected Grid to lose his temper, to fight recklessly with rage clouding his judgment.\n\nHis strategy failed. Grid had never been particularly loyal to King Wiesbaden.\n\n\"Good. You called my king's name like he's the neighbor's dog.\"\n\nGrid's hand closed around Lifael's Spear.\n\n> [White Transformation is activated.]\n\n> [You don't have any divine power. White Transformation has failed to be activated. Side effects will occur to your body.]\n\n> [You have resisted.]\n\n\"You can't afford to play with me.\"\n\nThe Goddess's Curse prevented Grid from attacking the elders and Pascal. They were priests. Kamiyan, however, wore a knight's armor. He served the church, but he wasn't a priest.\n\nNo reason to hold back.\n\n\"Let's go.\"\n\nGrid had studied Pon, the strongest spearman he knew. They'd sparred countless times. He'd absorbed fragments of Pon's technique, developed his own incomplete imitation.\n\nThe spear moved. A diagonal slash caught Kamiyan's blade and deflected it downward.\n\nMetal shrieked.\n\n\"You!\"\n\nKamiyan stumbled back, surprised by the fluid technique. Grid planted his right leg behind him and thrust forward.\n\nThe spear sang through the air.\n\n> [Lifael's Spear's option effect is activated, causing the skill 'Light Wheel' to be generated.]\n\n> [Lifael's Spear's option effect is activated, dealing an additional 5,000 damage to the target.]\n\n\"Keook!\"\n\nKamiyan's world tilted. The straight thrust had become a circular strike. An irregular attack that bypassed even the Keen Senses passive skill.\n\nHe hit the ground, blood spraying from his mouth.\n\n*Such power!*\n\nPain exploded through his torso. His bones felt shattered, his organs ready to rupture. This was the might of a myth-rated weapon combined with a myth-rated skill.\n\n\"Impossible...\" Pascal stared at the fallen Red Knight. One of the continent's strongest warriors, defeated in a single exchange? But something else horrified him even more.\n\n\"How can you use Lifael's Spear?\"\n\nThe three divine artifacts of the Rebecca Church required specific conditions. The wielder needed innate transcendent divine power. Nine years of prayer to Goddess Rebecca. And finally...\n\n*They must be a woman!*\n\nPascal's voice cracked. \"You...\" His face drained of color. \"Grid, you! Are you a woman?\"\n\nSilence.\n\nIt was the most uncomfortable question Grid had ever heard. Not even worth dignifying with a response. The 181cm tall, solidly built Grid tightened his grip on Lifael's Spear. He genuinely considered killing Kamiyan in that moment.\n\nPascal's panic overrode his judgment. He cast Heal. Light washed over Kamiyan, restoring his health enough to stand. Fear marked the knight's face as he raised his sword again.\n\n*It's been a while since I've seen Heal.*\n\nThe spell was rare in Satisfy. Becoming a priest of Rebecca required sacrificing too much. Few users chose that path.\n\n*Too many eyes.*\n\nA crowd had gathered in the garden. Grid calculated quickly. Killing Kamiyan here might damage Damian's chances in the papal election.\n\n\"I'll leave it for today.\"\n\nHe turned and walked away at a leisurely pace.\n\nKamiyan's eyes burned holes in Grid's back.\n\n*Kill! I'll kill you, Grid!*\n\nToday's defeat came from carelessness. He'd never imagined Grid could wield a divine weapon.\n\n*Damn him!*\n\nPain lanced through his side. Nausea churned his stomach. Kamiyan swore to himself that in one week, when Earl Chirita returned, Grid would kneel before him.\n\n---\n\nGrid entered the smithy inside the Vatican. This was where paladin weapons were forged.\n\nThe <span class=\"rarity-legendary\">Legendary Blacksmith's Hammer</span> felt solid in his grip.\n\n\"Shall I begin?\"\n\nThe hammer fell. Once. Twice.\n\nLifael's Spear lay on the anvil. A weapon forged by a god, now being reinterpreted by human hands.\n\n*Tang! Tang!*\n\n---\n\n**Glossary of Common Korean Terms**\n\n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}