{
  "id": 271,
  "title": "Chapter 271",
  "content": "Chapter 271\n\nCombat replays were invaluable, especially the losing battles. Kamiyan closed his eyes and ran through it again.\n\n*When Grid chose to stab.*\n\nHe replayed the decision to defend. What if he'd pushed forward instead?\n\n*No. I'd still be hit. If Grid struck from the side, the result would be identical.*\n\nWhat if he'd retreated?\n\n*Still the same. Grid was already closing the gap at maximum stride.*\n\nFrom every angle, defense had been the correct choice. The problem was his swordsmanship couldn't stop it.\n\n*The trajectory changed from straight to circular in an instant.*\n\nThe spear flew in a line, then curved into a circle just before hitting his blade. The memory sent goosebumps crawling across Kamiyan's skin. Grid was a spear expert, no question.\n\n*I should have responded with a skill.*\n\nSuper Armor would have blocked the attack. Then he could have counterattacked while Grid recoiled from the impact.\n\n*Victory would've been mine.*\n\nHe'd been too hesitant to use his trump card in the opening bout. That hesitation cost him the match.\n\nKamiyan rubbed his chest. \"Dammit... I didn't think it would hurt so much.\"\n\nThe Red Armor hadn't saved him. One shot. That's all it took. The attack power of Lifael's Spear defied belief. A divine artifact in truth.\n\n*The fight was wrong from the start.*\n\nHe hadn't expected Grid to wield Lifael's Spear. When Grid retrieved the weapon, Kamiyan failed to react, failed to stay vigilant. Control of the fight shifted in that moment. Unfair.\n\n*Isn't he supposed to be a swordsman?*\n\nChurch members witnessed Grid's battle against Drevigo. Elders among them explained what happened. Grid used a greatsword, they said. So how could he handle a spear?\n\n*And not just any spear. Lifael's Spear!*\n\nWasn't Lifael's Spear exclusive to the chosen few who received the goddess' divine message? Women, specifically?\n\nKamiyan clenched his jaw. \"It's really annoying.\"\n\nWrong information. That was the core of his defeat. Those faulty details planted false assumptions and cost him the victory.\n\n*I should have assumed Grid could use Lifael's Spear.*\n\nThen he wouldn't have taken such a devastating hit.\n\nKwaduduk!\n\nHis teeth ground together hard enough to ache. It was maddening. Rage boiled in his chest and poured out through his sword as he trained.\n\n\"Grid! Next time will be different!\" The blade cut through the air. \"I will be alert! I will show you the true power of the Red Knights!\"\n\nEnemies judged the current Red Knights weaker than their predecessors. Inevitable, perhaps. The former Red Knights had Great Swordsman Piaro among their ranks. Without Piaro, the current generation seemed one tier lower. Duke Limit never once defeated Piaro in their time. But that was history.\n\n*Lord Limit has surpassed Piaro now.*\n\nThe Red Knights who trained under Duke Limit must have surpassed the old guard as well. To prove it, the Red Knights had to remain undefeated. Kamiyan steeled his resolve to crush Grid.\n\nHe swung. \"You will see soon!\"\n\nKwajak!\n\nAura wrapped his blade and shattered the boulder. He grew stronger with each strike.\n\n***\n\n\"Pagma.\"\n\nPascal's voice was quiet in the empty corridor. The legendary blacksmith. The finest swordsman after Sword Saint Muller. Known to wield all weapon types with mastery. Grid inherited that power, true. But to use even the church's three divine artifacts...\n\nHe sighed. \"This is very frustrating.\"\n\nPascal needed to identify Isabel's successor quickly. His plan involved appointing a girl he'd secretly fostered as the new Rebecca's Daughter, elevating his own position in the process. The problem was Grid. Grid would never surrender Lifael's Spear.\n\nPascal's expression darkened. \"...Damian, that bastard.\"\n\nThis had Damian's fingerprints all over it. Asking Grid to protect Lifael's Spear was a move to contain Pascal's influence.\n\n\"I won't fall for such a trick.\"\n\nPascal sought out the elders and had them draft an official order for Grid to return Lifael's Spear. He clutched the document.\n\n\"Grid, even you cannot violate our church's official order.\"\n\nIf the command was broken? Pascal's lip curled.\n\n*Then it can't be helped. You'll be declared an enemy... Wait.*\n\nHe paused mid-stride toward the smithy.\n\n\"Pascal?\"\n\nPascal's head snapped up. \"Damian!\"\n\nThe younger paladin was running a campaign in the square. That charlatan Huroi helped raise the crowd's energy. Pascal's face flushed red at the sight.\n\n\"You!\" He jabbed a finger at Damian. \"Lifael's Spear is a divine artifact of our church! How could you give it to Grid illegally? You must answer for this, or you will be punished!\"\n\nDamian blinked. \"What are you saying? The current owner of Lifael's Spear is Isabel. She left it directly to Grid...\"\n\n\"Shut up!\"\n\n\"...\"\n\nPascal's voice cracked. \"Isabel is already dead! The ownership of Lifael's Spear returned to the elders... Heok?\"\n\nHis words died in his throat. Color drained from his face. His complexion turned worse than when he'd wondered if Grid was a woman. A figure approached through the crowd, platinum hair gleaming in the sunlight.\n\nThe woman stopped before them. \"What's the fuss?\"\n\nIsabel.\n\nPascal's mouth worked soundlessly. \"W-What is this?\"\n\nIsabel wasn't dead. More than alive, her color had fully returned. She walked without assistance, steady and strong. Damian asked the stunned elder, \"Isabel is dead? Have you finally become senile?\"\n\n\"Unbelievable!\"\n\nHow did she suddenly recover after dying?\n\n*Things are going terribly wrong!*\n\nUnknown actions were unfolding beyond his sight. This was serious. Pascal gripped his head, trying to process the situation. Something tickled his palm.\n\nHair. It was falling out. The stress accumulating since Grid's arrival manifested as hair loss.\n\nHwaduk. Hwaduuk.\n\n\"...\"\n\nEvery time he touched his scalp, another clump came free. Pascal's anger evaporated, replaced by horror.\n\nHe looked up at the sky. \"Gridddd!\"\n\nThat man. Everything twisted the moment he appeared. Pascal could no longer tolerate Grid's presence. He tore the order he'd drafted into pieces, hands shaking.\n\n*Grid! You are now my enemy!*\n\nThe decision solidified. Damian and Isabel watched Pascal's meltdown and clapped in unison, grinning.\n\n***\n\n> **[Light Wheel]**\n> \n> Stabbing, slashing, cutting, etc.\n> \n> Any type of attack will link to a circular strike. The target cannot escape this irregular assault.\n> \n> * Hit rate: 100%.\n> * Contains the light attribute.\n\nThis skill granted <span class=\"rarity-mythic\">Lifael's Spear</span> perfect accuracy. No resource consumption. No cooldown. A high probability of activation during normal attacks, with absolutely fraudulent power.\n\nGrid set down the spear. \"I thought it wasn't good because there was no additional damage.\"\n\nHe'd miscalculated. The extraordinary base damage of Lifael's Spear made the 100% hit rate option devastating. Enough to drop a famous Red Knight in one strike. Even Grid hadn't expected that result.\n\n*Lifael's Spear. This is the majesty of a myth-rated weapon.*\n\nOne regret remained.\n\n\"A spear doesn't fit with me.\"\n\n**Pagma's Swordsmanship Lv. 3**. When deactivated, it increased Grid's attack power by 32%, critical hit rate by 22%, and critical damage by 15%. When activated, it enabled skills like Kill, Link, and Transcend.\n\nBut only with sword-type weapons. The passive didn't trigger with anything else equipped. A disappointing limitation.\n\nGrid exhaled. *I have to give up using Lifael's Spear myself.*\n\nStill, he'd include it in the mass-produced Grid set. For Pon. For guild members. For soldiers who mained the spear. That's right. Grid envisioned a day when his guild and troops wore his standardized equipment.\n\n\"Kukukuk! Puhahahat!\"\n\nOvergeared Kingdom! A thrill shot through him imagining people praising the name. His fantastic kingdom's soldiers marching in Grid sets.\n\n\"That person... Isn't he scary?\"\n\n\"Right? I think so too.\"\n\n\"He doesn't seem like a normal person...\"\n\nThe Vatican smithy's blacksmiths muttered among themselves, sensing the dark energy radiating from Grid. Their gazes weren't friendly. Grid didn't care. No. More precisely, he didn't need to worry about it. His focus belonged entirely to Lifael's Spear.\n\nTtang! Ttang!\n\nLifael's Spear came apart completely over two days. Grid sought the hidden structure through reassembly. He spent days in the smithy, studying.\n\nObservation, disassembly, assembly. The cycle repeated endlessly. His natural talents for persistence and concentration let him immerse in the tedious process without breaking. The result...\n\n> [Your understanding of Lifael's Spear is now at 100%!]\n\n> [Blueprint: Lifael's Spear has been acquired.]\n\n> [Experiencing every detail of a myth-rated weapon will raise your skills to the next level!]\n\n> [The level of all skills related to production will increase by one.]\n\n> [(Witness of God's Weapon) Legendary Blacksmith's Craftsmanship Skill has evolved into (Understanding of Gods' Weapons) Legendary Blacksmith's Craftsmanship Skill.]\n\n\"Good!\"\n\nEleven days total, including the time he spent with Isabel in her room. The hidden abilities didn't reveal themselves as expected, but he learned how to use the Goddess' Essence. Various skills strengthened. More than that. He'd acquired a myth-rated item blueprint.\n\nGrid felt as happy as the day he gained Piaro and Asmophel.\n\nHe set down the spear. \"First of all.\"\n\nRight now, he lacked the materials to craft Lifael's Spear. But...\n\nGrid smiled and grasped the hammer again, a plan forming.\n\n---\n\nGlossary of Common Korean Terms.\nOG: Glossary Link.\nCurrent schedule: 20 chapters a week.\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}