{
  "id": 273,
  "title": "Chapter 273",
  "content": "# Chapter 273\n\nPark Jongsoo, PD of OGC Station, entered Satisfy to observe Damian directly.\n\n\"He's the pope candidate?\"\n\n\"Yes. The audience ratings will hit 15% because of him. Stick seven cameras to him.\"\n\n\"That's the rumored Isabel who's a Rebecca's Daughter? She's prettier than the rumors say.\"\n\n\"That's right. Put two cameras on her.\"\n\nHer beauty would increase the number of male viewers. An indispensable element in broadcasting.\n\n\"I understand. Eh? That person...?\" \n\nPark PD had been watching Damian and Isabel when his gaze caught on an Asian man. Excitement flooded through him.\n\n\"Huroi! The person next to Damian is Huroi!\"\n\n\"Huroi? The first ranked orator?\"\n\n\"Yes! Overgeared!\"\n\n\"The person closest to Grid?\"\n\n\"It's certain!\"\n\n\"Hoh? What is this?\"\n\nSomeone close to Grid was attached to a pope candidate? The director's eyes shone.\n\n*Is Grid related to this election?*\n\nGrid. The first to obtain a legendary class and South Korea's pride. He'd been involved in a variety of events. And now he was intervening in the Rebecca Church?\n\n\"Maybe this... Perhaps we might obtain a scoop?\"\n\nOf course, regardless of Grid, Huroi could be doing a personal activity.\n\n\"But we need to keep an eye out. We need to find out what type of relationship pope candidate Damian and Grid have. Put two cameras on Huroi as well.\"\n\n\"Yes, I understand. Then what about that man?\"\n\nThe man wore a bizarre half mask with curious symmetry between crying and smiling. His face and ID couldn't be seen. He seemed close with Damian's group.\n\n\"Put one camera on him.\"\n\nPark PD observed the courtyard where Huroi stood. He agreed with the director's command to observe the masked man more thoroughly.\n\n***\n\nGrid's current Insight stat exceeded **1,400**. He could feel the attention of two low-level users from 50 meters away.\n\n*They're station officials.*\n\nAs soon as they logged out, the cameras would start to roll. Grid grasped their exact distance without even seeing them.\n\n*Too annoying. That's why I hid my identity.*\n\nGrid scoffed. He didn't find the cameras particularly intrusive. It would be easy to escape them.\n\nDamian asked, \"You have sealed Lifael's Spear, so are you returning to Reidan?\"\n\nBoth Damian and Isabel looked regretful. Grid shook his head.\n\n\"No. I still have something to do.\"\n\nPascal had finally recognized Grid as an enemy. It was what he wanted. The moment Pascal attacked him...\n\n*I'll get experience.*\n\nDamian spoke to the wickedly smiling Grid. \"Then please watch over me. I will do my best. I will tell everyone why I must become pope. I believe it is the reward for your infinite grace.\"\n\nDamian had been making speeches with Huroi. His eyes filled with confidence. Grid saw the imposing gaze and nodded.\n\n\"I'll trust you.\"\n\n\"Thank you. Then go and get ready.\"\n\nIsabel grabbed Grid's sleeve. \"Grid, you must tell me before you leave. Don't leave without telling me. Understood?\"\n\n\"Yes.\"\n\nDamian and Isabel left for the venue, leaving Grid and Huroi alone. Isabel glanced back several times, worried Grid might disappear. Damian only looked ahead and vowed again.\n\n*I have to work hard today to build a foundation that will allow me to become pope.*\n\nGrid had saved Isabel. Huroi had helped Damian gain the trust of the church's members. Damian was desperate to give back to those who hadn't been able to hunt for two weeks because they were stuck in the Vatican.\n\n*I need to gain the ability to repay them. And in order to defend Isabel, I must become pope.*\n\nDamian looked like he was heading to the battlefield. \n\nAfter a moment, Huroi asked carefully once they were alone.\n\n\"Can I ask what it is you still have to do?\"\n\n\"Hunting.\"\n\n\"Hunting... What are you saying?\"\n\n\"Yes. Apart from Ruby and Sexy Schoolgirl, aren't you and I the only ones who haven't reached level 300? Since we came all the way here, shouldn't we get some levels?\"\n\nThe Vatican was an area with no monsters. There was nothing to hunt.\n\n\"What are you going to catch to level up...?\" Huroi's throat worked. \"Can I ask about your plan?\"\n\nHe had some idea. But he wanted his prediction to be wrong.\n\nGrid laughed. \"Elders.\"\n\nPascal and the elders. Trash who despised the weak and formed a huge barrier to Damian. What would they do if Damian gave a good speech? He could never become pope with Pascal in the way. Grid had to take care of Pascal.\n\n\"And.\"\n\nGrid's gaze shifted behind Huroi.\n\n\"There's a bonus of seven knights.\"\n\n\"...!\"\n\nHuroi spun around. Two knights in red armor and five knights in black armor stood behind them.\n\n\"Grid, I will pay back that disgrace.\"\n\nGrid welcomed Kamiyan with a relaxed expression. \"You came.\"\n\nAccording to his own experience, the Black Knights and Red Knights were weak, unlike the rumors. The rumors must be exaggerated. Grid judged he could take care of two Red Knights and the Black Knights in an instant.\n\nAt that moment.\n\n> [The pope candidate's speech event will begin soon. For the sake of safety, all outsiders are prohibited from possessing weapons.]\n> \n> [All weapons in your inventory will be disabled.]\n\n\"...Eh?\"\n\n\"Huh?\"\n\nGrid and Huroi cried out in bewilderment. Kamiyan laughed and pulled out his sword. He'd received the warning from Pascal ahead of time and registered the knights with the Rebecca Church. An effective temporary measure. Unlike Grid and Huroi, they could use weapons.\n\n\"This will be your grave.\"\n\n*Ah, really.*\n\nIt had been a really long time since he'd stepped in shit. As Kamiyan approached, Grid retreated behind Huroi.\n\n\"We should leave here for now.\"\n\n\"Good decision!\" \n\nHuroi immediately summoned his drake. \"Descend! Lord of the Skies above the Grasslands!\"\n\nSilence.\n\nGrid's expression stiffened.\n\n\"Why isn't your drake coming?\"\n\nHuroi started sweating. \"T-That... My pet summoning doesn't work.\"\n\n\"That joke isn't funny in a situation like this.\"\n\nGrid tried to summon Noe and Randy.\n\n> [Goddess Rebecca is watching the pope candidates. Due to the extreme divine power concentrated on the Vatican, non-human existences can't enter.]\n> \n> [Pet summoning has failed.]\n\n\"There really is a variety of things.\"\n\nGrid grumbled as the relaxation disappeared from his face.\n\n***\n\n\"The problem with the Rebecca Church is that it is divided into several factions. Unity must be achieved in order to properly go against the Yatan Church...\"\n\nThe speeches from the pope candidates began. They were free to speak as they liked. It caused drowsiness.\n\nAt OGC Station, the employees wore dark expressions. The ratings for the live broadcast didn't meet their expectations.\n\n\"Did you spread the information that a user is appearing among the pope candidates?\"\n\n\"The candidate's speeches are more boring than expected. There isn't enough to make the viewers stick around.\"\n\n\"Try to focus on Damian more than the speeches of the other pope candidates. Keep filming the people I mentioned.\"\n\n\"I understand.\"\n\nOut of the dozens of monitors, the most notable one displayed Isabel's beautiful face.\n\n\"This?\"\n\nThe director bit his fingernails out of nervousness. His eyes suddenly widened. Something was happening on a small monitor at the bottom.\n\n\"Number 19! Look at monitor number 19!\"\n\n***\n\n—This is boring.\n\n—Why am I watching this broadcast?\n\n—Isabel is really pretty.\n\nThe netizens who came to the OGC web channel after hearing that there was a user among the pope candidates started complaining. The chat window filled with curses.\n\n—No fun. No fun.\n\n—Guys, is the pope going to be decided today?\n\n—Nope. The pope election is in one month. This is just publicity for the pope candidates.\n\n—What? Then I don't need to watch this.\n\n—I know who the pope candidate is, so I will be going.\n\n—The PvP tournament is live on another channel right now. There's more benefit to watching that.\n\n—I should go see. There's no point watching this broadcast.\n\nThe number of viewers on the OGC web channel dropped rapidly. Suddenly, knights in red armor and black armor filled the screen that previously contained Isabel's face and the boring pope candidates.\n\n—Huh? Red Knights?\n\n—Wow! Red Knights and Black Knights?\n\n—This isn't fake?\n\n—It's real if you look at the pattern on the armor.\n\n—The Saharan Empire's strongest knights!\n\nTheir unannounced appearance excited the viewers.\n\n—But why are the Red Knights and Black Knights in the Vatican?\n\n—Who are they fighting?\n\nThe audience's attention focused on the people the enemy knights were attacking. The opponents were two users. One was an unidentified masked man and the other was the first ranked orator, Huroi.\n\n—Why are users fighting knights...?\n\n—Huroi will die.\n\n—Even if he's part of the Overgeared Guild, he still can't beat a knight ㅋㅋㅋ\n\n—It will be the first time the Overgeared Guild is defeated.\n\n—Who is the masked man?\n\n—Who cares? It won't last long.\n\nIt was a one-sided battle. The knight called Kamiyan drove back the man in the mask, while five Black Knights surrounded Huroi. They wielded swords, while the masked man and Huroi could only evade and defend without any weapons.\n\nWhy weren't they holding weapons? As the viewers started to question it, subtitles rose explaining the current situation.\n\n[Non-Rebecca Church members are prohibited from using weapons.]\n\nWho was the man in the mask? Why and how were they under attack by the Red Knights and Black Knights? The viewers wondered. But they quickly realized their questions wouldn't be resolved.\n\n—It's over.\n\n—Boring.\n\nThis fight would soon be over.\n\nThe man in the mask and Huroi would soon be pierced by the swords and turned to ash. Then the screen would once again show the boring speeches of the pope candidates. The viewers were sure of it.\n\nBut the man in the video didn't allow the obvious development.\n\n\"You disgraceful bastards are really cheap.\"\n\nThe man in the mask cursed.\n\nThe voice was familiar.\n\n—Eh???\n\n—Grid?\n\n—God Grid!\n\nThe comments in the chat window and the ratings started to rise exponentially. OGC's director startled.\n\nAs everyone's attention focused on the screen...\n\n\"<span class=\"rarity-legendary\">Lifael's Spear</span>.\"\n\nGrid pulled out a gold spear. The pavranium that used to be divided into seven blades in the past. Now it exerted overwhelming attack power. Blood sprayed from Kamiyan's chest. \n\nEarlier, the director had said that Damian would cause the ratings to rise to 15%.\n\n\"We are unable to measure the audience ratings!!!\"\n\nThe call to raise advertising shook OGC Station."
}