{
  "id": 274,
  "title": "Chapter 274",
  "content": "# Chapter 274\n\nDetecting the target. Predicting the risks. These were the functions of the Insight stat. Before meeting Piaro, Grid had only used it to measure combat power. But Insight was an absolute factor that could elevate his abilities in battle.\n\nHe could predict risks. He could read the enemy's movements.\n\n\"You rat bastard!\" Kamiyan's blade carved through the air.\n\nGrid sidestepped. The sword whistled past his ear. He didn't give Kamiyan an opening. Every dodge flowed into a block, every block into a counterattack. Piaro had drilled these sequences into him over countless repetitions.\n\n\"Keok!\" Kamiyan stumbled back from Grid's counterpunch.\n\nThe efficient movements helped Grid draw out 100% of his abilities. His fist connected with Kamiyan's jaw.\n\n\"K-Kuaaack! You bastard!\" Kamiyan spat blood.\n\nHe couldn't believe it. Rather than overwhelming an opponent who didn't have a weapon, he was the one receiving damage.\n\n*The difference between me and this guy is so large? Something is wrong. It can't be!*\n\nKamiyan believed the Empire was the whole world. He paid no attention to the happenings of small kingdoms. Therefore, he had no idea who Grid really was. He only knew about Grid's first visit to the Vatican. Grid was just someone who 'barely' defeated ex-Pope Drevigo.\n\nBut what was the truth? Grid had raided bosses far more powerful than Drevigo. Under Piaro's guidance, he had fought Pagma's clone eighty-three times. To be exact, Grid had studied under Piaro, who was once the Captain of the Red Knights. He wasn't an opponent that the 30th knight Kamiyan could handle.\n\nGrid's lips curled. \"Is your sword just a decoration? Isn't it disgraceful that you can't even subdue a barehanded opponent?\"\n\n\"Shut up!\"\n\nKamiyan lunged. His movements grew wild, erratic. A gold spear materialized and punched through his chest.\n\n*There.* Grid had baited him perfectly. The provocation had made Kamiyan's attacks bigger, sloppier. The Vital Spot Detection from the Slaughterer's Eye Patch combined with his high Insight to create an explosive synergy. At this moment, Grid was the puppeteer controlling the strings.\n\n*Peok! Peeeeok!*\n\nGrid channeled Regas's style. The strongest martial artist's techniques might be crude in his hands, but he could follow the fundamentals. Short jabs. Heavy hooks. His fists stretched out in relentless combinations. Each strike targeted the gaps in Kamiyan's armor, exploiting the seams with surgical precision.\n\n*Another five!*\n\nWhen Grid's fist connected, his gloves flashed. Light pulsed from the knuckles. Kamiyan reeled. It felt like five punches instead of one. The '5 Joint Attacks' effect from the <span class=\"rarity-legendary\">Holy Light Gloves</span> triggered again.\n\nThat's right. Grid was actively relying on his items, as always.\n\n*Swaeek!*\n\n*Puk!*\n\nLifael's Spear shot forward like a bullet, exploiting every gap in Kamiyan's defense. This was the pinnacle of item power. A reproduction of a divine weapon crafted from pavranium. Unlike Grid's bare hands, it dealt damage that couldn't be ignored.\n\n> [You have dealt 3,830 damage to the target.]\n\n*Okay, this time it struck properly.*\n\nThe spear statistics flashed through Grid's mind:\n\n> **[Lifael's Spear (Reproduction)]**  \n> Rating: <span class=\"rarity-unique\">Unique</span>  \n> Durability: None  \n> Attack Power: 101~730  \n> \n> * Divine Power +200\n> * Fixed damage of +1,500 on each attack.\n> * There is a low probability of activating the 'Light Wheel' skill.\n> * Attack power +20% against those with dark magic power.\n> \n> Maybe by the blacksmith G, who is being reborn as a true legend.\n> \n> It is a miniature version of one of the three divine artifacts of the Rebecca Church, Lifael's Spear.\n> \n> It is made from the legendary mineral with a will, pavranium. Therefore, it has a strong tendency to protect its owner. It makes decisions and moves by itself.\n> \n> Weight: 14\n\nThere was no handgrip on the spear. People couldn't wield it directly. So it wasn't classified as a weapon. Maybe because of that, or because it carried divine power, but Lifael's Spear was exempt from the weapon ban.\n\nGrid took aggressive advantage. Kamiyan's injuries mounted.\n\n\"Kuaaah! Kill! I will kill you!\" Kamiyan's eyes went bloodshot.\n\nOriginally, Kamiyan had planned to toy with Grid slowly. Now irritation consumed him. He triggered a skill.\n\n*Papat!*\n\nKamiyan's form blurred. Keen Senses activated. He dodged Grid's next three strikes in rapid succession. His sword carved through the air. Four strokes without delay. Dual Cross Sword manifested, each cut as fast as Link. A wave of crimson energy followed.\n\nThe red light in Grid's eyes deepened. His high Insight screamed warnings.\n\n*I can't avoid it.*\n\nShould he counterattack afterward? No. Grid's bare hands would only suffer damage. They were too weak against aura. Then...\n\n*Crush it.*\n\nGrid formed a fist. He drove it forward to meet the aura blade head-on. It looked insane. Kamiyan believed Grid's fist would be torn into eight pieces. The millions of viewers watching the battle shared the same expectation. But it was arrogant to judge a legend by the standards of a moderate genius.\n\nThere was a reason for Grid's actions that the public couldn't imagine. The power of items.\n\n*Chaaeng!*\n\nThe cross sword collided with Grid's knuckles. Light flashed from the ruby ring on his finger.\n\n> [The option effect of '<span class=\"rarity-unique\">Dark Bus' Earring</span>' is activated, neutralizing the target skill.]\n\n\"What?\" Kamiyan's jaw dropped.\n\nThe OGC chat exploded.\n\n—Wow, what is that?  \n—The skill disappeared;;  \n—No, in the first place, why is Grid's control so good? How can he punch back against such quick swordsmanship? Is that really Grid?  \n—His agility is high.  \n—ㅇㅇ It seems like his agility is maximized by his gear.\n\n*If I can't avoid it, then I should use it.* Grid's expression, transmitted through the magic orb, was magnificent. *Take a good look.*\n\n*Chaaeng!*\n\nGrid's fist pierced through the dissipating cross sword and smashed into Kamiyan's face. The knight staggered. Lifael's Spear shot toward him. Grid pulled out the Red Lightning Summoning Bead he'd obtained from hunting the Frostlight Orc Chief in the past.\n\n*I am the master of the Overgeared Guild.*\n\nThe Overgeared Guild was the strongest.\n\n*Don't look down on us!* This was a warning to the seven guilds who dared to invade Reidan while he was away.\n\n*Kurururung.*\n\nThe red lightning bolt fell from the sky. It coiled around Lifael's Spear.\n\n*Puok!*\n\nThe electrified spear pierced Kamiyan's shoulder.\n\n> [Critical!]  \n> [The red lightning adds 30% damage. The target has received an electric shock.]  \n> [You have dealt 17,300 damage to the target.]\n\n\"Kuaaaaak!\" Kamiyan's scream tore through the smithy.\n\nIt was the worst pain since the battle began. The shock debuff froze him in place. Grid saw the opening and triggered Blacksmith's Rage. Rather than using Grid's Boots that maximized greatsword power, Grid equipped Braham's Boots. Then he wore the Hooded Zip Up. His movement speed increased by 40%.\n\n\"W-Wait a minute...!\" Kamiyan raised a trembling hand.\n\nUseless. Grid's eyes glowed crimson. Unbreakable Justice, the skill learned by rescuing Huroi and acquiring the Apostle of Justice title, erupted through Grid's fist.\n\n*Kwaaaaang!*\n\nKamiyan couldn't even scream. His head snapped back from the impact. His body flew into the smithy wall. Teeth scattered across the floor. Blood splattered across the Slaughterer's Mask.\n\n> [Critical!]  \n> [The <span class=\"rarity-legendary\">Holy Light Gloves</span>' option effect is activated, causing the skill '5 Joint Attacks' to be generated.]  \n> [You have dealt 7,020 damage to the target.]\n\n*Jjejeok! Jjejejeok!*\n\nCracks spiderwebbed across the stone wall where Kamiyan's head had struck. This scene was proof of Grid's strength exceeding human limits. But more than two-thirds of Kamiyan's health still remained.\n\nThis was the limit of bare fists. Kamiyan's health and defense were simply too high.\n\n*He won't be defeated unless he dies.*\n\nThere was another Red Knight in the distance, watching. Grid would take full advantage of the lazy knight's refusal to participate. He would kill Kamiyan before that knight intervened.\n\n*Chaaeng! Chaaeng! Jjejejeok!*\n\nGrid's fists hammered Kamiyan's face in a relentless barrage. Grid's damage and speed, enhanced by Blacksmith's Rage, completely neutralized Kamiyan. The knight tried to activate Super Armor to escape, but Dark Bus' Ring neutralized the skill.\n\n*This bastard is a dragon!*\n\nThe golden spear. The fast-moving boots. The ring that neutralized skills. The gloves that struck multiple times. The armor with overwhelming defense. Grid was covered in artifacts that appeared in legends. It was like an imperial treasury had gained legs and started walking. Due to the short lifespan of humans, it was impossible to collect such artifacts in an entire lifetime.\n\nKamiyan's resentment toward Grid deepened. In the meantime, Grid's punches continued.\n\n*Kururung!*\n\nThe smithy wall completely collapsed. As the support disappeared, Kamiyan fell backward. Grid's knee shot up and caught his jaw. Then Lifael's Spear flew forward and impaled him.\n\n*Puoook!*\n\nBlood sprayed across the smithy's remnants. The scene was reminiscent of a battlefield.\n\n—Wow...  \n—God...\n\nThis strength was beyond common sense. After the golem invasion, Grid had grown significantly in the public's eyes. He seemed to have overcome his only weakness: control. Items, skills, stats, and now control. Grid was becoming truly perfect.\n\n—I had to change my underwear.  \n—I'm wearing a diaper.  \n—But isn't a Red Knight weaker than the rumors?  \n—This is the 30th knight? It is said that they are strong according to their number.  \n—ㅇㅇThe single numbers must be a real wall.  \n—What? I was almost scared of Grid again.  \n—I am scared. ㅡㅡ  \n—So that's the 30th knight? Even other rankers can defeat him.  \n—No. Grid is using his bare hands.  \n—What bare hands? He has the golden spear. Isn't that a weapon?\n\nDozens of messages per second flooded the OGC web channel chat. The administrators tried to restrain abusive users but gave up halfway. On the other hand, the TV channel's ratings were exceeding 30%. The numbers climbed in real time.\n\nIt was 6:20 p.m. on a Saturday. Prime time, with various popular programs competing for viewers. This was a phenomenal record for a cable channel.\n\n*Indeed, Grid's power over audience ratings is beyond imagination.*\n\nThe team couldn't predict how high the ratings would climb. But there was one problem.\n\n\"Isn't this too cruel?\" One staff member grimaced.\n\n\"We will be hit with a warning. We might have to stop broadcasting for a while.\" Another nodded.\n\nGrid's battle style wasn't suitable for minors to watch. The opponent was an NPC, but Grid kept smiling as he targeted vital points. He was called a psychopath for a reason. The team members grew concerned.\n\nThe director's voice cut through the worry. \"I will take responsibility for everything. Don't worry and keep broadcasting.\"\n\nHis broadcaster's blood was boiling. He would take responsibility for any repercussions, even if he needed to resign. He would write a new legend in the broadcasting world."
}