{
  "id": 275,
  "title": "Chapter 275",
  "content": "# Chapter 275\n\nFulito, 19th knight of the Red Knights, scowled at the desert horizon. The assignment grated against every fiber of his pride. Taking orders from a *priest*, of all people.\n\n*I am a knight in the 10s.*\n\nHe flexed his gauntleted hand. A knight of his distinction, reduced to babysitting some backwater noble. The whole affair reeked of wasted potential.\n\n*This is work for the guys in the 20s. Tsk.*\n\nThe complaint died in his throat the moment he witnessed Grid dismantle Kamiyan.\n\n*Strong.*\n\nFulito's eyes narrowed. The man moved with a precision that belied his provincial title. Each strike carried the weight of someone who had earned their strength through blood and repetition. And those items... each one radiated power comparable to imperial regalia. Especially that golden spear.\n\n*A competent person, hiding in a small kingdom.*\n\nKamiyan was green, yes. But he was still a Red Knight. Still a member of the strongest military order on the continent. Watching Grid crush him like an insect sent a thrill down Fulito's spine.\n\n*He's at the level of the 21st knight. I have to intervene.*\n\nThe boredom evaporated. Fulito straightened, his hand moving to his sword hilt.\n\n\"Let's take a look.\" The words came out as a low growl.\n\nLifael's Spear stabbed down at Kamiyan. The man's armor was already breached, blood pooling in the sand. Right before the killing blow landed, Fulito activated his skill. \n\nGrid took to the air. Fly magic propelled him directly at Fulito's position. The knight smiled, satisfaction curling his lips.\n\n*Did you notice that I am your rival?*\n\nFulito drew his blade. Steel sang as it left the sheath. He pivoted, bringing the weapon up to intercept Grid's trajectory. Then stopped.\n\n*What?*\n\nHis focus scattered like sand in a windstorm. His body refused commands. The sword hung uselessly in his grip as Grid blazed past, so close that wind from his passage tugged at Fulito's cloak.\n\n*Why am I doing this?*\n\nSwaeek!\n\nThe sound of Grid's passage hung in the air. Fulito stood frozen, watching the man disappear toward the Black Knights with dreadful speed.\n\n---\n\n\"Pant... Pant...\"\n\nBlood ran down Huroi's chin. He spat a globule of red into the sand and forced himself upright. Apostle of Justice's Partner. The title meant something when Grid stood beside him. Twenty percent to all stats. Skills that turned words into weapons. But fundamentally, he was still an orator.\n\nHis strength stat was garbage. His stamina barely kept him conscious. Agility meant nothing when five Black Knights had him surrounded. And unlike Grid, he had no legendary items to compensate for his shortcomings.\n\n\"Ugh...\" The groan escaped through clenched teeth.\n\nThe Black Knights closed in. One jabbed an accusing finger at him, face red with rage.\n\n\"Wicked person! How could you scorn my late grandmother? I will surely kill you!\"\n\nAnother knight stepped forward, sword raised. \"Why are you talking about my parents?\"\n\n\"My colleagues didn't ask me to pick up soap!\" The third knight's voice cracked with indignation.\n\nHuroi allowed himself a blood-flecked grin. Spiteful Tongue had done its work. The debuffs clung to them like wet wool. But the cooldown stretched ahead like an endless road, and his health bar flickered in the danger zone. Red crept in at the edges of his vision.\n\n*But I'm not worried about dying.* \n\nHe could respawn a hundred times. Lost experience, dropped items, none of it mattered. What mattered was keeping Grid alive.\n\n\"M-My Lord...!\" \n\nHuroi turned his gaze across the battlefield. *He must be suffering.* Fighting a Red Knight barehanded, every second must be agony. The guilt of being useless threatened to crush him.\n\n\"Die! Die! Die! Puhahahat!\"\n\n\"...\"\n\nGrid's laughter rang out like a bell. The Red Knight's face resembled a smashed tomato. Grid hammered away with both fists, clearly enjoying himself.\n\n\"Wow.\" Huroi felt heat rise to his cheeks. *I'm an idiot.*\n\nPuok!\n\nPain exploded in his side. A sword had slipped through his distraction, the blade punching deep between his ribs. His knees buckled.\n\n\"Where are you looking?\" The knight's voice was cold.\n\n\"Kuck!\"\n\nHuroi's vision swam. His health dropped to twenty percent. Maybe less. Two more hits and he'd see the respawn screen. He spat more blood and made his decision.\n\n*I need to bring one of them with me.*\n\nIf he could eliminate even one Black Knight, it would ease the burden on Grid. Huroi lunged with everything he had left. His hand clamped around a knight's arm. He threw a punch with his full body weight behind it.\n\nThe blow landed with a pathetic thump against the black armor. Like hitting a wall with a pillow.\n\n\"This weak brat! I don't even feel a tingle!\" \n\nThe knight seized Huroi's wrist. Yanked his arm high. The motion exposed Huroi's chest, his heart, everything vital. Another knight stepped in, sword aimed with surgical precision.\n\nThe viewers saw it coming.\n\n*This is normal. How can a Black Knight be taken down without a weapon?*\n\n*Right... Grid is abnormal.*\n\nHuroi closed his eyes. He'd done what he could. But Grid refused to accept it.\n\nThe system responded to Grid's title.\n\n> [You have dispersed the consciousness of the enemies.]\n\nAggro vanished like smoke.\n\n> [The skill 'Influence' has been activated. This effect will last for 10 seconds.]\n\n> [Reduces the defense of all enemies within 50m of you by 50%.]\n\n> [The skill 'Freely Move' can be used once.]\n\n> [Creates a high level dash skill that avoids all attacks until it reaches the 'desired target' that is within 200 meters.]\n\n\"You dare!\" Grid's roar cut through the battlefield.\n\nTeong!\n\nHe launched into the air. The camera struggled to track him. For a moment, Grid simply disappeared, moving faster than the broadcast equipment could follow.\n\n\"Huh...?\" \n\nFulito charged toward Grid's last position. Then stopped. His sword hung loose in his grip, his attention scattering to meaningless details. Grid shot past him like an arrow.\n\n\"A really strange ability.\" Fulito clicked his tongue and pivoted. His blade came up in a sweeping arc. Aura poured from the steel like concentrated moonlight.\n\nPahat!\n\nThe energy slashed toward Grid's exposed back. A perfect killing blow. But Freely Move was still active. Without looking, without slowing, Grid twisted. The aura carved empty air where he'd been a fraction of a second before. Four Black Knights stood between him and Huroi. Grid crashed through them like they were tall grass.\n\n\"W-What?\" The knight about to execute Huroi froze, mouth open.\n\n\"Get lost.\" Grid's voice was flat.\n\nPeeok! Puk!\n\nLifael's Spear and Unbreakable Justice connected in rapid succession. The knight's defense had been halved by Influence. The damage was catastrophic. Grid kicked the man aside, sending him tumbling across the sand. He reached down and pulled Huroi to his feet.\n\n\"Are you still weak? You still have the status of a punching bag.\"\n\nHuroi managed a bloody smile. \"Haha... I am weak.\"\n\n*The power of my items is still lacking.*\n\n\"Let's aim for the third advancement class soon.\" Grid steadied him. \"Then I'll make new items for you. Your biggest problem is that you are lacking items.\"\n\n\"I will keep that in mind.\"\n\n\"Join my party now.\" Grid extended his hand.\n\nKamiyan chose that moment to lunge. His sword punched through Huroi's guard and into his gut.\n\n\"Cough...!\"\n\n\"...!\"\n\nBlood sprayed across Grid's Hooded Zip Up. The white fabric turned crimson. Grid's expression went flat. Huroi looked up at him, eyes already glazing.\n\n\"Please... Stay alive.\" Huroi's voice was barely a whisper. \"My Lord absolutely can't collapse.\"\n\n> [Your morale has increased.]\n\n> [Your attack power and magic attack power will significantly rise for the next attack.]\n\n> [The next attack will be a critical hit!]\n\nFlop!\n\nHuroi collapsed. The buff skill, the one he'd been saving for the perfect moment, washed over Grid like liquid fire. Kamiyan raised his sword again, reading Grid's attachment to the fallen orator.\n\nChaaeng!\n\nGrid moved. The Divine Shield appeared in his grip, golden surface intercepting Kamiyan's blade. The knight grinned behind his helmet.\n\n\"You! You are like a turtle!\"\n\nKamiyan pressed the attack. His sword rang against the shield in a steady rhythm.\n\nChaaeng! Chaeeeeeng!\n\nPuok! Puk puk!\n\nGrid's back was to the Black Knights. They closed in like wolves, stabbing at his exposed armor. He couldn't dodge. Couldn't retaliate. Every movement was dedicated to keeping Huroi's body safe.\n\n\"My Lord, why are you sacrificing yourself for me!\" Huroi's voice cracked with frustration. \"Wake up! Fight against the enemies! I don't want to grab at My Lord's ankles!\"\n\n\"You and I, aren't we friends before the master and subordinate relationship?\" Grid didn't take his eyes off Kamiyan.\n\n\"...!\"\n\n\"Well, I usually treat you more like a subordinate than a friend.\" Grid's jaw tightened. \"I'll make it up to you. I've promised many times.\"\n\nPuk! Puuok!\n\nSeokeok!\n\nThe Black Knights' swords found gaps in his armor. Blood ran freely down Grid's legs. Kamiyan pressed harder, sensing victory.\n\n*Foolish man.* Fulito folded his arms and watched with detached interest. *Sacrificing yourself to protect your subordinate. You are no match for me.*\n\nHe'd already written Grid off. The orator would die. Grid would follow. Such was the price of sentimentality.\n\nKamiyan's assault continued without pause. \"Without that golden spear, you are nothing!\"\n\nHe gave Grid no space to breathe. No chance to switch to offense. Then new text materialized in Grid's vision.\n\n> [The Legendary Blacksmith's Patience skill has been activated.]\n\n> [Health, defense and dexterity will rise by 200% for one hour.]\n\nThe skill couldn't be triggered intentionally. It only activated when Grid pushed himself beyond normal limits. When he endured the unendurable. His muscles hardened. His breathing steadied. The defensive gap closed.\n\nKamiyan's next strike hit armor that suddenly felt like castle walls. The knight stumbled back, eyes wide behind his visor.\n\n*What ridiculous defense!*\n\nThe Black Knights redoubled their efforts. Their swords rained down on Grid's back, his shoulders, his legs. He didn't fall. Didn't flinch. Just stood there, immovable as a mountain, while Huroi lay safe behind his shield.\n\n*Monster.* The word rippled through the Black Knights' ranks.\n\n\"How long can he endure?\" one whispered.\n\n\"Light Sword!\" Kamiyan activated the technique he'd learned from Duke Limit.\n\nChaaeng!\n\nA blade of pure aura materialized and struck the Divine Shield. The impact was tremendous. Grid's guard wavered for a heartbeat. Five Black Knights lunged at the opening, their swords converging on his exposed torso.\n\nGrid let them hit. The Slaughterer's Mask covering half his face shifted from white to blood red. This was the moment he'd been waiting for.\n\n> [The effect of Evil Spirit's Bloody Tears is activated. Attack power will increase by 50% for 5 seconds.]\n\n\"Now it's my turn.\" Grid triggered Blacksmith's Rage. His muscles swelled. \"I will kill all of you within five seconds.\"\n\nDark red light poured from his eyes. Kamiyan's Keen Senses screamed at him to dodge. He tried. Grid's fist came anyway, impossibly fast. Lifael's Spear whipped out and tangled Kamiyan's legs.\n\n\"Kuheook!\"\n\nThe punch caved in Kamiyan's helmet. The force traveled through the metal and into bone. Grid didn't stop. His fists were pistons, mechanical and relentless, each blow landing with surgical precision on Kamiyan's already swollen face. The red armor meant nothing. The helmet crumpled like paper.\n\nThe Black Knights stabbed at Grid's back. Tried to break his concentration. Lifael's Spear intercepted every blade.\n\nChaaeng! Jjang! Jjejejeok!\n\nCrash!\n\nThree buff skills stacked. Blacksmith's Rage. Evil Spirit's Bloody Tears. Morale Boost. Four seconds of continuous pummeling. Kamiyan's health bar, already depleted from the earlier beating, shattered. He dropped to his knees.\n\n\"This... Yo...u.\"\n\nA grey pillar erupted from his body. The death marker. A Red Knight, defeated barehanded.\n\n\"...\"\n\nSilence blanketed the battlefield. Every viewer watching from South Korea felt their breath catch. Within minutes, the footage spread globally. OGC's audience rating climbed to forty-one percent.\n\n---\n\nOGC Station hummed with barely contained chaos. The director stood at the center of the production floor, fist pumping the air like a lottery winner. Then the door opened.\n\nPerfect proportions. Slender legs that seemed to go on forever. Beauty so profound it rendered everything else in the room monochrome. Yura stepped inside, and every head turned.\n\n\"I came to receive Youngwoo's payment.\" Her smile could have melted hearts. Her eyes were glacial. \"Are you having fun?\"\n\n---\n\n**Glossary of Common Korean Terms:**\nOG: Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}