{
  "id": 276,
  "title": "Chapter 276",
  "content": "# Chapter 276\n\nThe OGC Station lobby fell silent.\n\nYura stepped through the entrance, and every head turned. One of the producers dropped his coffee cup. It shattered against the tile floor, but no one noticed. They were too busy staring.\n\nThe woman's beauty didn't just command attention. It *demanded* it. Dark hair framed porcelain features that transcended cultural preference. Cameras and edited photographs couldn't capture the way light seemed to bend around her, or how her movements carried an effortless grace that made the air itself feel heavier.\n\nDirector Lee Gookrae felt his chest tighten. Forty-five years old. Twenty years married to his first love. Never once strayed.\n\n*What the hell is wrong with me?*\n\nHe coughed into his fist. Once. Twice. The spell broke. \"Miss Yura.\" He forced a professional smile. \"Your presence honors our humble station. But why are you here?\"\n\n\"I'm here to collect Youngwoo's appearance fee.\"\n\n\"Youngwoo?\" The director blinked.\n\nThen it clicked.\n\n*Grid.*\n\nThe name rippled through the production team like a shockwave.\n\n\"Did Grid actually give us permission to broadcast?\" One assistant gripped his tablet like a lifeline.\n\n\"We didn't even *know* it was Grid at the time.\"\n\n\"Christ. Legal is going to have a field day.\"\n\n\"Why would Yura come here for Grid's sake?\"\n\n\"The rumors about them must be true.\"\n\n\"Wait, isn't he with Jishuka? There was that scandal last month.\"\n\n\"There was a scandal with Yura too.\"\n\nA collective groan swept through the room. The male staff members exchanged glances heavy with envy.\n\n*Next life. I'm coming back as Grid.*\n\nNone of them realized that being Grid meant shouldering debts that would make a grown man weep.\n\n***\n\nThe director's office was a shrine to mediocrity. Cheap leather furniture. Generic landscape paintings. A desk cluttered with energy drink cans.\n\nYura sat on the sofa as though it were a throne. She lifted the teacup the director offered, held it with both hands, and sipped. The gesture belonged in a period drama about aristocracy.\n\nShe set the cup down with a soft *clink*.\n\n\"Pay Youngwoo thirty percent of the advertising revenue generated by today's broadcast.\" Her voice was silk over steel. \"Do that, and he'll forget you aired his footage without permission.\"\n\nDirector Lee's smile faltered. \"Thirty percent?\"\n\n*That's insane.*\n\nYura was the biggest star in South Korea. Even *she* didn't receive a percentage of ad revenue. Grid was trending, sure, but this demand shattered the fundamentals of the industry.\n\n\"I can offer three hundred and fifty million won.\" The director leaned back in his chair. \"That puts him in the same compensation bracket as top-tier celebrities. More than fair.\"\n\nYura's expression didn't change. \"You're aware of the liability for commercial use of another person's gameplay footage without consent.\"\n\nThe director's smile vanished.\n\n\"The content aired today was violent.\" Yura continued. \"The Communications Commission will scrutinize every frame. Fines. Investigations. Public hearings.\" She tilted her head. \"Excess greed becomes poison, Director.\"\n\n*Shit.*\n\nYura came from old money. The kind of wealth that bought law firms instead of lawyers. Director Lee knew this. He'd known it the moment she walked through the door.\n\nHe drummed his fingers against the armrest. \"Our position isn't *entirely* disadvantageous. We relayed the footage without knowing the masked individual was Grid. No intentional exploitation. Grid didn't reveal his face, so image rights weren't violated. The filming location was a public event venue.\" He spread his hands. \"We have the right to broadcast public events.\"\n\n\"Perhaps.\"\n\nYura smiled. It was the smile of someone holding a royal flush.\n\n\"Work with me, and I'll coordinate my schedule with OGC. Future projects. Exclusive interviews.\" She paused. \"Who knows? Youngwoo might develop a fondness for this station because of how you handle this situation.\"\n\nDirector Lee's brain rerouted like a highway detour. *Grid and Yura.* South Korea's two brightest stars. If he could broker a working relationship with both of them, OGC's future revenue would dwarf today's numbers.\n\n\"I'll need to meet with the executive board.\" He stood. \"If we transfer ad revenue, there will be contracts to review. Legal formalities.\"\n\n\"Of course.\"\n\nYura rose from the sofa. Director Lee moved to escort her out, then hesitated at the door.\n\n\"One more thing.\" He glanced back. \"You disappeared from the rankings recently. Is it true you obtained a hidden class?\"\n\nYura's smile widened. \"Perhaps one day I'll explain. In an exclusive interview with OGC.\"\n\nThe director's face lit up like a child on Christmas morning. He practically skipped as he escorted her to the building entrance.\n\n***\n\nThe limousine door closed with a muted *thunk*.\n\nYura leaned back against the leather seat, satisfaction warming her chest. The negotiation had gone smoother than expected.\n\n*It would've been different with a major network.* But OGC was a specialty broadcaster. They understood Grid's value in a way mainstream stations didn't.\n\n*Will Youngwoo be pleased?*\n\nHer class, Demon Slayer, created automatic hostility with the Yatan Church and demonkin. That made the Rebecca Church a natural ally. She'd tuned into the papal candidate speeches partly for reconnaissance.\n\nThen Grid had hijacked the entire broadcast.\n\nYura had watched with equal parts amusement and concern. Grid remained oblivious to how the media operated. One wrong move could destroy his reputation before he realized what happened.\n\nSo she'd taken action. Turned a potential disaster into a windfall.\n\nThe reasoning was practical. Yura needed Overgeared Guild. Her level had crashed after the class change, and she needed allies during the grind back to the top.\n\nBut practicality wasn't the whole story.\n\nA warm flutter settled somewhere below her ribcage. Yura pressed her palm against her chest, as if she could smooth it away.\n\n*Later. Think about that later.*\n\n***\n\n> **[Vatican - Cathedral Plaza]**\n\n\"Pathetic.\"\n\nFulito stared at the spot where Kamiyan had died. His fellow knight. Killed by a man's bare fists.\n\n*The shame of the Red Knights.*\n\nFulito felt no grief. Only disgust.\n\n\"I'm in this situation because of that incompetent bastard.\" He spat the words like poison.\n\nAfter Piaro's betrayal, the new generation of Red Knights had been rebuilt by Sword Duke Limit. They were harder. Crueler. They looked at ordinary soldiers the way lions looked at sheep.\n\nAnd now one of their own had died. To *fists.*\n\nThe dignity of the Red Knights hung by a thread.\n\nFulito rolled his shoulders. His red armor caught the sunlight, throwing crimson reflections across the cobblestones.\n\n\"Wait until the event ends.\" He raised his voice so Grid could hear. \"When you can use weapons again, I'll crush you and restore the honor you've tarnished.\"\n\n\"Hoh.\"\n\nGrid's lips curved. *Perfect.*\n\nFulito's combat power was an unknown variable. Far stronger than Kamiyan. Even with Lifael's Spear, Grid wasn't certain he could win. But if Fulito was giving him time to prepare...\n\n*Then I'll use every second of it.*\n\nThe viewers erupted.\n\n—*Wow, this Red Knight is cold-blooded. Let Grid watch him murder his colleague and THEN offered him time to gear up.*\n\n—*That's confidence. Is he a single number knight?*\n\n—*No, those have gold epaulettes. This guy's rank is lower.*\n\n—*Even the 20th knight is exponentially stronger than the 30th. This is going to be brutal.*\n\nThe illegal gambling sites exploded with activity.\n\n**[Grid vs. Red Knight Fulito - Place Your Bets]**\n\nMoney poured onto Fulito. He'd watched Kamiyan die without flinching. Then he'd *offered Grid a handicap.* The man clearly knew something the audience didn't.\n\n—*Time to order chicken. This is gonna take a while.*\n\n—*My delivery got here five minutes ago. Already ate two drumsticks.*\n\n—*How long until this kicks off? I'm cracking open a bottle of soju.*\n\n—*There are still pope candidates giving speeches lmaooo*\n\n—*Wait, I forgot this was originally a CHURCH EVENT ahahaha*\n\nOGC's viewership hit 43%.\n\nRumors spread like wildfire. *Grid versus a Red Knight. Starting soon.* Foreign viewers flooded the web channel. The servers groaned under the load, teetering on the edge of collapse.\n\nThe world watched.\n\n> **[The Pope Candidate Speech Event has ended.]**\n> **[Safety restrictions have been lifted. Weapons are now available.]**\n\n> **[+9 Failure has been equipped.]**\n> **[+8 Doppelganger's Greatsword has been equipped.]**\n> **[Only 50% of the weapon's attack power will be applied due to the penalty.]**\n\nGrid raised both greatswords. Failure in his right hand. The jade greatsword in his left.\n\nThe chat erupted.\n\n—*Two Sword Style?*\n\n—*Is he stupid? How do you dual-wield GREATSWORDS?*\n\n—*The balance required is insane. His stance is going to crumble the second he swings.*\n\n—*He should only use one. This is just for show.*\n\nThe gambling sites descended into chaos. Players who'd bet on Grid started typing furious messages.\n\n—*Fuck.*\n\n—*I believed in him. I'm an idiot.*\n\n—*I thought he'd improved. Guess not.*\n\n—*Here we go again...*\n\n—*Does he even know people are laughing at him?*\n\nGrid lunged.\n\nNo words. No posturing. Just violence.\n\n*CLANG!*\n\nThe Doppelganger's Greatsword met Fulito's blade. The knight parried, muscles coiling for a counter.\n\n*Whoosh.*\n\nFailure swept in from the opposite angle. Fulito twisted. His passive skill kicked in, a sixth sense honed through decades of combat. He slipped the strike by millimeters and retaliated.\n\n\"Light Sword.\"\n\nUnlike Kamiyan's version, this technique carried *weight.* The aura blade screamed toward Grid's chest. Too fast to dodge. Too precise to deflect cleanly. Blocking would shatter bones.\n\nGrid's mind raced. *Option three.*\n\n\"Pagma's Swordsmanship.\" He pivoted on his heel. The jade greatsword moved in a perfect half-moon arc. \"**Revolve.**\"\n\n*CRACK.*\n\nThe vortex swallowed Fulito's aura blade, reversed its momentum, and spat it back amplified. The Doppelganger's Greatsword bonus took the skill's power and *multiplied* it.\n\nBlood sprayed. Fulito staggered back, clutching his chest. His red armor had split open like overripe fruit.\n\n*How?*\n\nFulito's eyes widened. Grid was stronger. *Significantly* stronger than during the Kamiyan fight.\n\nThe reason was simple.\n\nPagma's Swordsmanship only activated with sword-type weapons equipped. The passive stat bonuses. The hidden synergies. All of it required the right gear.\n\nArmed with two greatswords, Grid had become something Fulito hadn't accounted for.\n\nA mistake.\n\n—*HOLY SHIT TWO SWORD STYLE IS REAL*\n\n—*GOD GRID LETS GOOOO*\n\nThe viewers flipped like pancakes. The same people who'd mocked him thirty seconds ago now spammed his name in chat.\n\nOGC's viewership climbed.\n\n45%.\n\nFifty percent wasn't a dream anymore. It was a *certainty.*\n\nSouth Korean broadcasting history was being written in real time.\n\nAnd Grid stood at the center, greatswords gleaming, carving his legend one strike at a time."
}