{
  "id": 278,
  "title": "Chapter 278",
  "content": "# Chapter 278\n\n> [You have defeated Fulito, the 19th Red Knight of the Saharan Empire, who slaughtered ethnic minorities under their banner.]\n> \n> [If this news spreads to the Empire, they will order your assassination.]\n> \n> [43,908,500 experience has been acquired.]\n> \n> [You have leveled up to 81.]\n> \n> [<span class=\"rarity-epic\">Red Armor</span> has been acquired.]\n> \n> [Skill Book: <span class=\"rarity-epic\">Aura Festival</span> has been acquired.]\n\nGrid's breath came hard as the notifications cascaded across his vision. He wiped blood spatter from his mask and checked the loot.\n\n> **[<span class=\"rarity-epic\">Red Armor</span>]**\n> \n> Rating: Unique\n> \n> User Restriction: Level 300 or higher. Advanced Heavy Armor Mastery Level 5 or higher.\n\n> **[Skill Book: <span class=\"rarity-epic\">Aura Festival</span>]**\n> \n> Rating: Unique\n> \n> Launches aura in a wide explosion.\n> \n> Range and power increase with skill level.\n> \n> Acquisition Conditions: Must be able to use aura.\n\nThe red armor was dense, built for raw protection rather than flexibility. Too heavy. No special options. *Not good enough for my people.*\n\nGrid turned the armor over in his inventory. *Still, it'll fetch a decent price.*\n\nThe Overgeared members had grown spoiled on his custom gear, but regular players would see the Red Armor differently. To them, this was S-grade equipment. A treasure, even if they couldn't wear it yet.\n\n*Better to modify it first.* If he succeeded in reconstructing it, the value could skyrocket. Maybe even enough to meet Overgeared standards.\n\nThen there was the skill book.\n\nGrid's jaw tightened behind the mask. *A unique skill.*\n\nSkills lasted forever once learned. This book held the same value as a legendary item, maybe more. Pon or Ibellin would kill for this.\n\n*That's real money.* He'd been living like a pauper after dumping everything into the building construction. Now he had breathing room again.\n\n*Pizza. I'm getting pizza.*\n\nNot just any pizza. The cheese crust that cost an extra 3,000 won. Grated Parmesan and hot sauce, 700 won each. The whole works.\n\n\"Kukukuk.\"\n\nThe laugh bubbled up from his chest. Behind the blood-smeared mask, Grid's grin would have terrified anyone close enough to see it.\n\n*Wait.*\n\nGrid stopped. His eyes found the camera drone hovering nearby.\n\n*How many people are watching this?*\n\nOGC was a professional gaming channel. At minimum, 100,000 viewers were probably tuned in right now.\n\n*An unexpected broadcast opportunity.*\n\nHe needed to capitalize on this. Grid straightened and addressed the camera directly.\n\n\"The Overgeared Guild is recruiting members with production classes. Cleaners, chefs, tailors, construction workers, blacksmiths, alchemists, and more. Contact Lauel for details.\"\n\nHis guild was combat-heavy. Himself and Euphemina aside, the Overgeared members focused purely on fighting. The Silver Knights Guild they were merging with had the same problem. To develop Reidan properly, he needed crafters. Lots of them.\n\n*Maybe a hundred applicants. A few talented ones in the bunch.*\n\nGrid had no idea that OGC's ratings had just shattered 55%. Peak viewership had touched 63%. Records hadn't been broken like this in half a century, not since the end of traditional broadcasting in 2011.\n\nFifteen seconds of ad time was selling for 3 billion won. Grid had just advertised to millions of people. For free.\n\nTens of thousands of users were already flooding Lauel's inbox with applications.\n\nLauel's sleepless nights had just gotten worse. Grid remained blissfully unaware.\n\nA new window materialized.\n\n> [The time attack quest **'Evidence Destruction'** has been created.]\n> \n> **[Evidence Destruction]**\n> \n> Difficulty: AAA\n> \n> Defeating the Black Knights and Red Knights of the Saharan Empire will bring a crisis to your door.\n> \n> Destroy the remaining enemies. Kill or appease the leaders behind this incident.\n> \n> **Quest Clear Conditions:** Eliminate the surviving Black Knights (0/4). Kill or reconcile with Pascal and the elders.\n> \n> **Quest Rewards:** Rumors about you won't spread to the Saharan Empire.\n> \n> **Quest Failure:** The Saharan Empire will issue a death warrant.\n> \n> **Time Limit:** 2 hours.\n\n\"Huroi.\"\n\n\"Yes?\" Huroi had recovered under the protection of Lifael's Spear while Grid battled Fulito. His health bar glowed full.\n\nGrid jerked his chin toward the remaining Black Knights. \"Kill them.\"\n\nRevenge for his earlier humiliation. Experience points. Huroi understood immediately, and his face brightened.\n\n\"Leave it to me.\"\n\n\"Good.\"\n\nGrid turned and walked away, heading for the elders' meeting room. Behind him, the Black Knights closed in on Huroi with predatory grins.\n\n\"Grid's an idiot,\" one sneered. \"Leaving you alone like this.\"\n\nAnother laughed. \"We'll kill you, then return to the Empire to report Grid's crimes.\"\n\nHuroi's expression went cold. \"Don't speak My Lord's name with your filthy mouth.\"\n\n\"Big words from a dead man.\"\n\nThe Black Knights circled closer. They'd watched Huroi fight earlier. Watched him get demolished. Even Grid had admitted it. Huroi was weak. These were the second most elite knights on the continent, and it was four against one.\n\n\"Die!\"\n\nThey attacked as one. The momentum crushed the air between them.\n\nHuroi didn't flinch. He drew the one-handed version of Dainsleif and met their blades head-on. Steel shrieked against steel.\n\n\"You...!\"\n\n\"You're not our match!\"\n\nThe Black Knights pressed harder, trying to overwhelm him through sheer force.\n\nThen a massive shadow fell across them all.\n\n**Kuwooooh!**\n\nA red drake roared. Only 100 out of two billion users owned a drake. This was Huroi's trump card.\n\n\"I'm weak,\" Huroi said quietly. \"But only when compared to My Lord.\"\n\n\"This... no!\"\n\n**Kwaaaaah!**\n\nFire engulfed them. Huroi tore through the Black Knights one by one, flames and steel working in tandem. The Apostle of Justice's Partner had begun his rampage.\n\nThe chat exploded.\n\n*—Holy shit*\n\n*—An ORATOR just killed Black Knights?*\n\nHuroi's display sent fresh shockwaves through the audience.\n\n***\n\nOne hour before the Pope's speech event.\n\nPon and Regas returned to Reidan after a month of silence. Their faces told the story before they spoke.\n\nFailure.\n\nThey hadn't even reached the boss. The vampire city had slaughtered them with overwhelming numbers and power.\n\n\"It's not designed for two players.\" Pon shook his head. \"You need at least ten third advancement classes. Probably twenty if you want to clear it in four days.\"\n\nRegas nodded. \"The vampires have evasion abilities that nullify non-divine attacks. You need holy weapons or divine skills to hunt them efficiently.\"\n\n\"We tried to scout the boss before dying,\" Pon continued, \"but we couldn't push that far.\"\n\n\"Ran out of potions and food. Durability went to hell. It was a wipeout.\" Regas grimaced.\n\nThey shared everything they'd learned with the guild. Lauel absorbed it all, mind racing.\n\n*At least 13 vampire cities in the western Eternal Kingdom.*\n\nClassified as dungeons. Entrances sealed 10 seconds after entry. No exit until the vampire boss died. Hunt the boss or die trying. Those were the only options.\n\n*The 13th city has vampires ranging from level 280 to 350. Sensitive to scent, blood, and light. Excellent at reading facial expressions. Main skills are dark magic and attribute evasion. Some use swords. Loot includes jewelry and cloth armor.*\n\nTrue blood vampires, classified as quasi-boss monsters, also dropped spellbooks and elixirs.\n\n*Elixirs...* Lauel's pen stilled. *Permanent stat increases. Astronomical value.*\n\nA vampire city was a goldmine for any guild that could monopolize it.\n\n*Boss information is still unknown.*\n\nHis hand moved across the paper, drafting a report for Grid. He was deep in concentration when someone knocked.\n\n\"Come in.\"\n\n\"Been a while, hasn't it?\"\n\nLauel was an earl of the Eternal Kingdom and acting lord of Reidan. Only one person outside the Overgeared members would address him so casually.\n\nMinor. The boy was as indifferent as ever.\n\nThree months ago, Grid had sent the young minerals detector to search for pavranium. He'd finally returned in one piece.\n\n\"It was a hell of a search,\" Minor complained.\n\nThe boy dropped onto the couch without asking. Lauel didn't object. He evaluated people on capability, not manners.\n\nThat was why he'd chosen to follow Grid.\n\n\"Good to see you back safely.\"\n\nMinor shrugged. \"I'm not glad at all.\"\n\n\"Hahaha! Still the same, I see.\" Lauel smiled. \"Did you find the golem labyrinths?\"\n\n\"No. There are no labyrinths in the west.\"\n\nLauel's expression froze. \"No pavranium...? Duke Grid will be very disappointed.\"\n\n\"Who said there's no pavranium? I said there are no golem labyrinths.\"\n\n\"What?\"\n\nMinor tossed a map onto the desk. \"I can sense pavranium energy from these dungeons marked here.\"\n\nA map of the west. Fifteen locations marked with an X. One of them matched the vampire city coordinates.\n\n*Could it be...?*\n\n\"Are the dungeon entrances shaped like anthills?\" Lauel asked carefully.\n\n\"Huh? How did you know?\"\n\nOf course. The locations Minor had marked were all vampire cities.\n\n\"Kukukuk...\"\n\nLauel covered his face with one hand. His shoulders shook with laughter. He exposed his teeth in a wild grin.\n\n\"This... if the pavranium is sealed in the vampire cities... Lady Luck from my past life hasn't forgotten me. She's giving me a gift. To repay her, I'll retrieve my sealed memories. Then I'll kiss her cheek.\"\n\n*Psycho.*\n\nMinor was young, but he recognized insanity when he saw it. Normal people didn't exist around Grid. That made sense. Grid himself wasn't normal.\n\n*I don't belong here. I should be the emperor's genius advisor.*\n\nHe dreamed of greater fame. Greater glory.\n\n\"Huhuhut...\"\n\n\"Kukukuk...\"\n\nLauel and Minor laughed like madmen, each lost in their own delusions.\n\n\"Um.\"\n\nJude stood in the doorway, clutching a report. An uncomfortable feeling settled in his gut as he watched them."
}