{
  "id": 279,
  "title": "Chapter 279",
  "content": "# Chapter 279\n\n\"A silver tongue.\" \n\nDamian dominated the papal candidates' speech event. While the other candidates criticized factions and the Yatan Church, flaunting their political allegiances, Damian focused on charity.\n\nHe invoked the fundamental doctrines of the Rebecca Church, stirring the innate nature of the clergy and forcing them to confront the wickedness of Pascal's actions. It was a rhetorical technique based on Huroi's teachings: when an audience's attention scattered, approach them indirectly rather than head-on.\n\nThe effect was substantial. Pascal's supporters wavered, hairline fractures appearing in their solidarity. Some even showed faint signs of warming to Damian. Over the past two weeks, Huroi had drilled the orator's craft into Damian with relentless precision.\n\nPascal, however, remained contemptuous.\n\n\"Your ideals can never be realized.\" He gestured dismissively at the assembly. \"Most of the existing senior priests are already tainted because of Drevigo. Charity? Why waste energy on such a meaningless performance?\"\n\n\"What are you trying to say?\" Damian's tone was level.\n\n\"That flattering the junior priests is useless. The senior priests hold the voting rights, and they won't agree with you. You targeted the wrong audience.\"\n\nDamian's expression didn't shift.\n\n\"That may be true now. But it will change, slowly. Most priests aren't rotten to the core, unlike you. I'll dedicate myself to helping them recover their original path. Today is only the first step.\"\n\n\"You...\"\n\nDamian had transformed significantly over the past two weeks. He carried himself with more pride, displayed no fear, and spoke with unwavering conviction. His eyes held a firm light that had appeared the moment Grid entered his life.\n\n*It's infuriating.*\n\nHe was becoming more like that insufferable Grid. Pascal shrugged, releasing a theatrical sigh. \n\n\"Well, believe in Grid if you want. It's only temporary. Soon enough, you'll face reality. I look forward to that moment.\" His lips curved into a cruel smile. \"In one month, I'll become pope. I'll treat Rebecca's Daughters harshly. You'll be helpless, forced to watch with despair.\"\n\nIsabel, standing beside Damian, flinched. Pascal's serpentine eyes dragged up memories of her hell-like past. The fear struck deeper because she'd teetered on the edge of death just days ago. Damian shifted, placing himself between her and Pascal.\n\n\"Even if you become pope, I'll protect Isabel.\"\n\n\"You still haven't grasped the fundamental truth. Without strength, you should shut up and sit down. That's providence.\" Pascal's voice carried the edge of absolute certainty.\n\nOnly the strong could reign. The weak existed to be trampled. It was the core value of the empire that had conquered colonies and reduced populations to livestock. If Pascal ascended to the papacy, the Rebecca Church would transform into an instrument serving imperial interests.\n\n\"Hahahahat!\"\n\nDamian covered the frightened Isabel with his body. Pascal laughed at them both, then departed the room. Damian shook his head slowly, turning to reassure the girl.\n\n\"Don't worry. You'll be happy. I'll make certain of it.\"\n\n\"Damian...\"\n\nThe young man's pure, genuine heart began to reach her.\n\n***\n\n**The Elders' Meeting Room**\n\nTwenty-three elders held a drinking party in the very chamber that oversaw the divine affairs of the Rebecca Church. Some had naked women beside them. Prostitutes that Earl Chirita had imported from the empire.\n\nPascal's face contorted.\n\n\"What are you doing? Have you forgotten how many people from across the world are visiting the Vatican today? Of all times to be reckless, you choose now, when eyes are everywhere?\"\n\n\"Now, now. Don't be so angry.\" Earl Chirita rose from his seat among the elders. He pulled Pascal down into a chair, smiling placidly. \"That man called Grid. He should be dead by now.\"\n\nPascal wrestled his temper under control.\n\n\"Are you certain?\"\n\n\"Obviously. 19th Knight Fulito can slaughter thousands of soldiers single-handedly. The moment Grid became his target, there was no escape, regardless of what tricks he employed.\"\n\nThere was no room for doubt. The Red Knights might be weaker than the previous generation, but the power of knights ranked in the teens remained absolute. Undefeatable.\n\n\"Let's drink to my son, who will become father to eighty million followers in one month.\"\n\nPascal accepted Earl Chirita's glass. They were father and son, yet their interaction held the formality of business partners.\n\n\"Hrmm.\"\n\nGrid had been an eyesore. The thought of him dead brought Pascal a perverse pleasure. It felt like new hair might sprout from his balding patches.\n\n*Finally free from that damn hair loss.*\n\nPascal was savoring his drink when the door burst open. Had Fulito returned from his mission? Everyone assumed so.\n\n\"Kuak!\"\n\n**Ku tang tang tang!**\n\nSomeone crossed the threshold without permission. No, one of Earl Chirita's knights came flying through it. One of the six guards stationed at the entrance. Already dying.\n\n\"R-Run away.\" The knight's words stuttered out. Pure terror glazed his eyes, as if he'd witnessed the grim reaper incarnate.\n\n\"Run away?\"\n\nThis was the elders' meeting room. As one of the most sacred places in the Vatican, its safety had remained unbreached for centuries. This was the final stronghold people fled **to**, not **from**. What was this man saying?\n\nA drunk elder lurched to his feet.\n\n\"Who dares intrude on this sacred place?\"\n\n\"Sacred place?\" A sarcastic voice drifted from beyond the doorway. \"I thought it was a brothel.\"\n\n**Step. Step.**\n\nThe footsteps drew closer. It was someone nobody expected. The identity of the intruder...\n\n\"G-Grid?\"\n\n\"Impossible!\"\n\nPascal and the elders stared as if confronting ghosts. Wasn't Grid supposed to be dead by the hands of the Red Knights and Black Knights?\n\n*It can't be!*\n\nA chill crawled down Pascal's spine.\n\n*Grid defeated the 19th knight?*\n\nAs confusion rippled through the room, Grid's gaze swept over the prostitutes. There were women with large breasts, and ordinarily his eyes would linger.\n\n\"Look at this.\"\n\nAt this moment, Grid reached a conclusion.\n\n*Goddess Rebecca is flawed.*\n\nThey violated doctrines and committed wicked acts, yet retained divine power simply through sincere belief? She was narrow-minded and careless.\n\n*No. The goddess might just be naive.*\n\nThe problem lay with those who exploited the goddess's purity.\n\n*Whatever. Doesn't matter to me.*\n\nOnly one thing mattered now.\n\n\"All of you will die here.\"\n\n\"...!\"\n\nPascal and the elders recoiled. Grid grinned at them, his expression hard as iron.\n\n\"Didn't I tell you? I'm in a different position from Damian. I can deal with you however I like. This is the truth, so thank you for targeting me.\"\n\nPascal and the elders flushed red. The system recognized that they had dispatched the Red Knights and Black Knights as assassins. Therefore, Grid could attack them without fearing the Goddess' Curse. Earl Chirita shouted at the grinning Grid.\n\n\"You stupid bastard! Don't you know who I am? Who are you to waltz in here and spout such nonsense?\"\n\nThanks to his son, Earl Chirita had lost all sense of reality. He believed everything would always bend to his will.\n\n\"What are you doing? Go kill him!\"\n\nHe commanded the wounded knights. They would die anyway. Earl Chirita's knights rose again, then immediately struck at Grid. They felt no fighting spirit, no will to live. Only fear. But they hadn't reached the 200s yet and couldn't match Grid.\n\n**Seokeok!**\n\nThe greatest advantage of a greatsword was its destructive power. The superior blade carved through the knights like parchment. Blood scattered across the table laden with delicacies.\n\n\"Kyaaak!\"\n\nThe prostitutes and Earl Chirita stumbled backward.\n\n\"R-Really... He's stronger than Fulito...\"\n\nEarl Chirita muttered blankly. Pascal attempted to defuse the situation.\n\n\"Duke Grid, what happened to enrage you so? First, let's calm down and discuss this misunderstanding.\"\n\nPascal was a natural con artist. Even now, his performance was flawless.\n\nGrid snorted.\n\n\"What's there to discuss when you sent the Red Knights and Black Knights to assassinate me? Stay silent and die.\"\n\nPascal protested vehemently.\n\n\"No, was there such a thing? I know nothing about it.\"\n\n\"Stop acting.\"\n\n\"Ah!\" Seeing Grid's disbelief, Pascal glanced toward Earl Chirita. \"Earl Chirita, was it you? Did you send assassins to kill Duke Grid?\"\n\n\"W-What...?\"\n\nWas this bastard selling out his own father? Earl Chirita received the shock like a physical blow, rendered speechless. Pascal whispered to him.\n\n\"Sacrifice yourself. I'm the one who will become pope.\"\n\n\"Pascal...! How can you do this to your father?\"\n\nPascal's expression twisted into anger as he faced Earl Chirita.\n\n\"Over the past decades, you became a favored lord thanks to me. Haven't I fulfilled my duty as your child? But you? What have you done for me as my father?\"\n\n\"P-Pascal...\"\n\n\"Be a father once before you die. Isn't that right?\"\n\n\"U-Ugh...\"\n\nEarl Chirita finally shed tears. Not from fear of Grid. He was devastated, treated as insignificant by his son, who had been his only source of pride. As he bowed his head and sobbed, Pascal turned to Grid with a manufactured smile.\n\n\"Haha, it's like this. Earl Chirita seems to have done something foolish. Now, Duke Grid, direct your wrath toward the earl and share a drink with me...\"\n\n\"Crazy bastard.\"\n\nThe fundamental reason Grid hated Pascal was because he represented the type who trampled the weak. Seeing Pascal reminded Grid of everyone who had taunted and tormented him in the past. But now, Grid discovered another reason to despise him.\n\n\"Unfilial bastard.\"\n\nGrid was born and raised in the East. He was a filial son who always gave the chicken drumsticks to his parents at dinner. Pascal sacrificing his father was unacceptable. The sight ignited a visceral hatred in Grid's chest.\n\n\"Don't play these games with me. Only one person is leaving here alive, and it isn't you.\"\n\nGrid's entire presence shifted as he equipped the mask and eye patch. Pascal recoiled from the red light emanating from the items, shouting desperately.\n\n\"Quit being stupid! The Saharan Empire will punish you if you harm its ambassadors! Aren't you afraid of them?\"\n\n\"Of course I'm afraid.\"\n\nHe couldn't make an enemy of the Saharan Empire yet. Reidan would be crushed within half a day if forced to face the empire's full might.\n\n\"Which is why I have to kill all of you. The fact that I killed the Red Knights and Black Knights cannot reach the empire.\"\n\n\"You should be worried! Even if you kill us, things will spiral out of control! Do you think no one witnessed you heading here? You'll be identified as the criminal and executed, and Damian won't become pope since he's tied to you!\"\n\n\"No need to worry about that. 'I' am currently chatting with church members in the Vatican gardens.\"\n\nDoppelganger Randy.\n\n\"I have the perfect alibi.\"\n\n\"I don't know what you're talking about!\"\n\n\"Doesn't matter. You'll die soon.\"\n\n\"Ugh!\"\n\nGrid's killing intent thickened like smoke. Pascal realized battle was unavoidable and shouted to the elders.\n\n\"We can endure with buffs and heals! The paladins will rush here once the commotion grows!\"\n\nPascal's divine power currently approached that of former Pope Drevigo. It was remarkable to possess pope-level divine power without having been crowned. If Pascal and the twenty-three elders joined forces?\n\n*We won't die!*\n\nAs long as they avoided instant death, they could continuously heal each other. It was fairly rational thinking. But the problem was their opponent. Grid. Divine power and black magic power were antithetical to each other.\n\n\"Blackening.\"\n\n> **[Your black magic power has increased.]**\n> \n> **[You don't have any black magic power. It will be replaced with demonic power.]**\n> \n> **[While Blackening is activated, your species will change to half-demon.]**\n> \n> **[As a half-demon, your maximum health is reduced by 50%. Your attack power, magic power, and agility will increase by 20% each.]**\n> \n> **[All attacks will be converted to the black magic attribute.]**\n\nBlackening. A skill belonging to the Legendary rated accessory, Dark Bus' Earrings. It possessed excellent compatibility with Grid, who wielded demonic power.\n\n**Sururuk.**\n\nHis skin became pale white. The whites of his eyes vanished, consumed entirely by black. His dark hair rippled with demonic energy, creating an ominous aura. Grid's current appearance resembled the demons of human nightmares.\n\n\"Transcended Link.\"\n\nBerserk demonic power flooded the room. The elders' meeting chamber filled with raw, primal fear.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}