{
  "id": 28,
  "title": "Chapter 28",
  "content": "# Chapter 28\n\nI kept my voice light. \"The heroes Pagma mentioned... I'm probably different from them.\"\n\nDisappointment flickered across Khan's weathered face.\n\n*This old man's too eager.* I suppressed a smirk. *Should I mess with him a little?*\n\n\"To be honest, I'm more like Pagma than those heroes.\"\n\nKhan blinked. \"You are like Pagma? What does that... Ah! No way.\"\n\nHis rheumy eyes widened. \"Are you?!\"\n\nThe gears turned slowly in the old blacksmith's head. The heroes Pagma spoke of could wield Dainsleif and Valhalla, sure. But would they recognize their true worth? Only someone on par with Albatino himself could appraise such masterpieces.\n\nYet I'd seen through them instantly.\n\n\"That's right.\" I puffed out my chest. \"I'm Pagma's Descendant.\" Pride bled into my tone despite my better judgment. \"I understand Dainsleif and Valhalla better than anyone. I can use them freely. Give me a chance to obtain them.\"\n\n\"Ohh!\"\n\nKhan's hands trembled. The resemblance was uncanny. His ancestor had stood before Pagma 130 years ago, and now he faced Pagma's heir.\n\n\"I understand.\" Khan gripped my shoulders. \"If you are truly Pagma's Descendant, I will hand over the heirlooms. But you must prove it first.\"\n\n> [The quest 'Pagma's Descendant' has been created.]\n\nThe blue window materialized between us.\n\n> **[Pagma's Descendant]**\n> \n> Difficulty: Class Quest\n> \n> You possess Pagma's blacksmithing techniques, but do you know who Pagma truly was? Can you carry out his will with pride? Pagma was more than a skilled craftsman. His legend scattered across the continent for a reason.\n> \n> Begin with the clue of the swordsmanship that pierced the sky. Follow Pagma's legend. Collect every fragment. Only then will you understand him completely and become his true successor.\n> \n> A new legend will be born.\n> \n> * No time limit for this class quest.\n> * Accepting a legendary class quest locks you into that class permanently.\n> * The legendary class quest has the power to transform Satisfy's world based on the outcome.\n> \n> **Class Quest Clear Conditions:** Complete all linked quests successfully.\n> \n> **Class Quest Clear Reward:** Unknown.\n> \n> **First Class Quest:** [Pagma's Swordsmanship]\n> \n> The force of Pagma's swordsmanship was said to pierce the sky. This may be a clue to the techniques not described in Pagma's Rare Book.\n> \n> **First Class Quest Clear Condition:** Learn Pagma's swordsmanship.\n> \n> **First Class Quest Clear Reward:** <span class=\"rarity-unique\">Dainsleif (Reproduction)</span>.\n> \n> [Quest is in progress.]\n\nMy breath caught.\n\n*I should've figured it out when I could equip anything.* The realization hit like cold water. *Pagma wasn't just a blacksmith.*\n\nThe implications sprawled before me. What would this class become after clearing all the linked quests? A blacksmith and warrior hybrid? Something beyond that? The uncertainty gnawed at me, but excitement thrummed underneath.\n\n*A new legend.* The words echoed in my skull.\n\n\"Good!\" I spun toward the door. \"I'll find Pagma's swordsmanship right now.\"\n\nMy boots hit the floor with purpose. Then I froze mid-step.\n\n*Where exactly am I going?* Reality crashed down. *I'm level 21. Should I really run off on some grand adventure without a plan?*\n\nThe class quest demanded I collect legends scattered across the entire continent. That required levels I didn't have. Resources I couldn't afford. Time I'd rather spend making money.\n\n*This is a marathon, not a sprint.* Frustration curdled in my gut. *I want to finish it now, but that's impossible.*\n\nThe fire in my chest dimmed to ash.\n\nKhan must have read my deflation. He pressed a bottle into my hands. \"It's late. Have a drink with me. We should discuss Pagma, blacksmithing techniques, the future of this smithy.\"\n\nI pulled the bottle away from my mouth before it touched my lips. \"Shouldn't you stop drinking?\"\n\n\"Cough, cough.\"\n\nKhan sputtered. I yanked the bottle from his grip and began searching the smithy. Behind the anvil. Under the workbench. In the coal bin. I found every hidden stash.\n\n\"I'm confiscating all of these.\"\n\nThe old drunk wouldn't complete my quest if he died of liver failure first. Call it protecting my investment.\n\nKhan's hands reached out weakly. \"Today I'm happy. Just one bottle...\"\n\n\"No.\" I shoved the collection into my inventory. \n\n*Let's see.* I tallied the labels. *If I sell all this liquor, that's two gold easy.*\n\nThe calculation soothed my earlier disappointment.\n\nThe smithy door creaked open.\n\nA slim man stepped inside, glasses perched on a sharp nose. His eyes found me first, lingered for a moment, then dismissed me. He turned to Khan with a polite smile.\n\n\"Khan? Pleasure to meet you. I'm Rabbit, an employee of the Mero Company.\"\n\n*Mero Company?* My thoughts sharpened. *The bastards who hired those gangsters?*\n\nThis man looked nothing like a thug. Too clean. Too composed. His mild expression screamed calculated civility.\n\nI stayed silent and watched.\n\nKhan tensed like a cornered animal. Rabbit's smile never wavered as he spoke.\n\n\"You owe the Mero Company 600 gold. From what I hear, you lack the ability to repay this debt.\"\n\n\"So you want the smithy.\" Khan's voice turned brittle.\n\nRabbit spread his hands in a gesture of false magnanimity. \"I'd like to offer you an opportunity. Your skills are excellent. Too valuable to waste.\"\n\n\"What... opportunity?\"\n\n\"Simple. The Mero Company takes ownership of this smithy, but we transfer operating rights to you. We'll pay you a generous salary.\"\n\nA compromise. They'd own the building but let Khan pretend he still mattered.\n\n\"You mean the Mero Company becomes my master?\" Khan spat the words.\n\n\"Haha, such rough language.\"\n\n\"And if I refuse?\"\n\nConfusion rippled across Rabbit's carefully neutral expression. \"Refuse? These terms are quite favorable compared to our previous offer.\"\n\n\"I won't hand over my family's legacy!\" Defiance rang in Khan's voice. \"I'd rather lose everything.\"\n\n\"Hrmm. Indeed.\"\n\nRabbit pushed his glasses up and muttered to himself. The words came out loud enough for both of us to hear.\n\n\"Should I use force? No, too crude. A lawsuit for unpaid debts? Too slow, too many steps. Khan's stubborn. What's the best angle here?\"\n\n*What kind of idiot thinks out loud like this?* I watched the performance with growing suspicion.\n\nAn idea seemed to strike him.\n\n\"Khan. Let's test whether you deserve to keep this smithy. Compete with a blacksmith hired by the Mero Company. Make something better than our craftsman and win, I'll acknowledge your qualification. I'll even forgive your debt. But if you lose, you admit you're unfit and hand over the smithy. Fair terms, yes?\"\n\n*Absolutely not.* Alarm bells rang in my head. *They'll bring someone way better than Khan. He needs to go to the lord, report the Mero Company's shady dealings, get legal protection.*\n\nKhan's face lit up. \"I accept!\"\n\n*You goddamn fool.*\n\n\"Ohh, excellent choice.\"\n\nKhan held up a finger. \"One condition. I haven't worked in weeks. Too much drinking. My skills are rusty. Let my successor compete in my place.\"\n\nRabbit's expression hardened. \"I was told you had no successor.\"\n\n\"Your information is wrong.\" Khan pointed directly at me. \"There. He's my successor.\"\n\n*Wait, what?*\n\n\"Hoh. I see.\" Rabbit studied me like an insect under glass. \"He looks incompetent for such a role. You want this... person to represent you? You're certain?\"\n\n\"Do I look like I joke around?\"\n\n\"No complaints from me. In fact, I'm grateful.\"\n\n> [The quest 'Item Production Game with the Mero Company!' has been created.]\n\nThe window appeared before I could protest.\n\n\"What is this?\" My voice rose. \"Khan, you crazy old—\"\n\n> **[Item Production Game with the Mero Company!]**\n> \n> Difficulty: A\n> \n> The Mero Company challenged Khan to a blacksmith competition. Khan's condition is abysmal from weeks of drinking and inactivity. He's decided he can't win and thrust the burden onto you.\n> \n> **Quest Clear Conditions:** Win the game against the Mero Company's blacksmith.\n> \n> **Quest Clear Reward:** **+500 Reputation** in Winston. Increased affinity with Winston residents. **600 gold** prize.\n> \n> **Quest Failure:** **Reputation** in Winston falls to minimum. Khan's smithy becomes Mero Company property.\n> \n> [Would you like to accept the quest?]\n\nThe anger died in my throat.\n\n*600 gold.* The number burned into my retinas. *600 gold!*\n\nMy mental calculator spun to life. One hundred gold equaled 120,000 won. Times six.\n\n\"720,000 won!\"\n\nI could work brutal manual labor for eight straight days without rest and not make that much. The failure penalty? Khan would eat most of it. His smithy, his problem. Meanwhile, I'd walk away with a fortune.\n\n*This is it. The honey quest I've been waiting for.*\n\n\"Why would I refuse?\" The words tumbled out. \"I accept!\"\n\n> [The quest has been accepted.]\n\nRabbit blinked behind his glasses. \"Hoh? Your successor isn't backing down? Surprisingly confident.\"\n\n\"What's surprising?\" I jabbed a thumb at my chest. \"Look at this face. Pure confidence, right?\"\n\n\"Huhut. That confidence can be either medicine or poison.\" Rabbit turned toward the door. \"I'll send word about the location and date soon. Until then.\"\n\nThe door closed behind him.\n\nKhan dropped to his knees. \"I'm sorry. I'm truly sorry. Doing this without asking you first... But I had no choice. I need to keep this smithy!\"\n\nI pulled the old man to his feet and wrapped him in an embrace.\n\n*His tears are going to ruin my shirt.* I patted his back anyway.\n\n\"Why apologize? Don't worry about it. We're practically family at this point, right? I'll handle this for you.\"\n\n\"Ahh... thank you.\" Khan's voice cracked. \"You're an angel. There's no one like you. Sob!\"\n\nThe wetness seeped through the fabric.\n\n*I should charge him for laundry.* I dismissed the thought. *No need to nickel and dime him. He just handed me 720,000 won.*\n\n\"Kukukuk... kuhahahaha!\"\n\nThe laughter bubbled up unbidden.\n\n*Winston! This blessed land!* I squeezed Khan tighter. *You beautiful, profitable village!*"
}