{
  "id": 280,
  "title": "Chapter 280",
  "content": "# Chapter 280\n\nThe meeting room exploded.\n\nBlack energy blades crashed through stone and wood like a tsunami of razors. Walls crumbled. The round table split down the middle, fragments spinning through the air. Within seconds, the chamber had become a crater.\n\nPascal stumbled backward, robes whipping around him. *Enormous damage!*\n\nThe prostitutes huddled in the corner, protected by the golden shimmer of Lifael's Spear. The elders had no such luxury.\n\n\"Holy Shield!\" someone screamed.\n\n\"Resist the Dark!\"\n\nGreen light flooded the room as Pascal and the elders layered defensive spells over themselves. They didn't bother conserving mana. Survival was the only priority now.\n\nPascal gritted his teeth. \"The paladins will come when they hear the noise! We just have to last until then!\"\n\n\"Don't stop healing!\"\n\nThe green auroras of their healing magic blazed without pause. Twenty-three of the Rebecca Church's highest-ranked priests, pouring their divine power into staying alive. Magic strong enough to withstand a dragon's breath, at least for a time.\n\nBut not this.\n\n*The recovery can't keep up with the damage!*\n\nOne elder clutched his ribs, blood seeping between his fingers. *This isn't human! Grid must be demonkin!*\n\nThe <span class=\"rarity-legendary\">+9 Failure</span> had attack power comparable to the Rebecca Church's three divine artifacts. The <span class=\"rarity-legendary\">+8 Doppelganger's Greatsword</span> carried penalties Grid couldn't fully overcome, but it still boosted skill damage by twenty percent.\n\nThe combination turned his legendary skills into something monstrous.\n\nStone rained from the ceiling. The floor buckled.\n\n\"Kuaaaak!\"\n\nThe twenty-three elders averaged level 300. Seven of them were still second advancement priests at level 290. The weakest links.\n\nBlack magic consumed divine power like fire eating paper.\n\nGrid's eyes, glowing red in the Blackening state, locked onto them. *These people are the hole.*\n\nThe seven elders scattered, robes shredding under the assault. Grid's crimson vision highlighted every weakness, every gap in their defenses.\n\n*I have to finish this fast.*\n\nBlackening lasted five minutes. If he couldn't kill them in that window, the elders' healing would wear him down. Numbers always won wars of attrition.\n\n\"Blacksmith's Rage.\"\n\n> [Attack power will increase by 25% and attack speed will increase by 40%.]\n\n**Level 4** now. The duration stretched to thirty-five seconds. Grid launched himself over the ruined table, careful to angle away from the prostitutes.\n\n\"Link.\"\n\nHis body blurred. Dozens of black energy projections materialized around the seven weakest elders, each one a phantom sword. The afterimages made it impossible to track which was real.\n\nThe elders blinked.\n\nBlood erupted from their bodies.\n\n\"Hueok!\"\n\n\"H-Help me!\"\n\nThey hadn't even felt the cuts. The terror of that realization froze them for a critical half-second. By the time they started casting Heal, Grid was already moving again. His attack speed vastly outpaced their casting time.\n\nThey never should have let him close the distance.\n\nSteel punched through flesh.\n\n\"Kyaak!\"\n\nThe **5 Joint Attacks** from his <span class=\"rarity-legendary\">Holy Light Gloves</span> combined with **Bisect** from Failure. The elders burst into grey ash.\n\n> [You have defeated the corrupt elder Huda.]\n> [12,910,300 experience has been acquired.]\n> [Advanced priest's clothing has been acquired.]\n> [A high quality emerald ring has been acquired.]\n> [You have killed a human in the half demon state, so demonic magic power has increased by 10.]\n\n> [You have defeated the corrupt elder Furell.]\n> [12,552,000 experience has been acquired.]\n> [Advanced priest's shoes have been acquired.]\n> [You have killed a human in the half demon...]\n\nGrid barely glanced at the cascade of notifications. The items were mediocre. The experience was solid. But that demonic power gain gnawed at him.\n\n*Ten points just for killing humans while in this state.*\n\nThe stat let him access hell. But was that all? Or was he changing into something else, something not human?\n\nGreen light slammed into him.\n\nIt was Pascal's Heal, timed perfectly as Grid finished off the seventh elder.\n\n> [You have been affected by Great Heal.]\n> [The Holy Light Armor raises the recovery magic's power by 300%.]\n> [Great Heal is a deadly poison to a half demon!]\n> [You have suffered 23,640 damage.]\n\n\"Kuak!\"\n\nGrid's strongest armor had become his execution device. Two-thirds of his health bar vanished in a single flash. Pascal stared, confused.\n\n*What? It worked better than I thought.*\n\nWhy? Pascal didn't understand the mechanics, but he filled in the blanks himself.\n\n*The goddess is blessing me!*\n\nOf course. Goddess Rebecca wanted this demon dead. Pascal's confidence surged.\n\n\"Now! Pour out your heals! Give the goddess' punishment to this wicked demon who dares deceive the faithful!\"\n\nThe remaining sixteen priests were all third advancement. Their Great Heals hit harder than the weaker elders' spells.\n\nGreen light converged on Grid from every angle.\n\nGrid tried to dodge the first ray. Failed. The light caught him, and the rest followed, sixteen beams of divine power lancing through his half-demon body. Pascal and the elders smiled.\n\n*Too easy!*\n\n*He sold his soul and now he pays!*\n\n*Grid is dead!*\n\nVictory.\n\n\"Pagma's Swordsmanship.\"\n\nGrid moved through the light.\n\n\"What?\"\n\nHe closed the distance to Pascal in a heartbeat. The **Quick Movements** from his <span class=\"rarity-unique\">+8 Ideal Dagger</span> made him a blue streak.\n\n\"Kill!\"\n\nPascal's Holy Divine Shield, three times more powerful than a standard Holy Shield, shattered like cheap glass.\n\n\"Y-You! Why are you still alive?\"\n\nGrid looked like a corpse. Blood poured from dozens of wounds. A gaping hole in his chest exposed bone. But he was standing.\n\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\nGrid had learned to rely on this skill. And right now, he was furious.\n\n\"Rotten bastards! How can multiple people gang up on one person?\"\n\nPascal gaped. \"What? Aren't you the one who came to attack all of us alone?\"\n\nHe cast Heal on himself while restoring his Holy Divine Shield. Double casting.\n\nGrid didn't wait. **Evil Spirit's Bloody Tears** activated, boosting his attack power. He used **Wave** to slow Pascal and the elders, then chained **Unbreakable Justice** before Pascal could complete his shield. No gaps. No hesitation.\n\n\"Linked Kill!\"\n\nThe first blow pierced Pascal's heart.\n\nThe second blow.\n\nThe third blow. Both greatswords stabbed simultaneously.\n\nGrid clicked his tongue. *If there had been two more strikes, he'd be dead.*\n\nLinked Kill's hit count was random. He couldn't control it. Frustrating.\n\nPascal clutched his chest, face twisted in agony. \"Y-You cruel bastard!\"\n\nGrid had targeted the heart three times without flinching. Now he looked almost disappointed it hadn't been enough. This wasn't normal.\n\n\"What right do you have to denounce and punish me when you're just as cruel?\"\n\nPascal's voice cracked with outrage.\n\n\"The right of the strong.\"\n\nSimple. Pascal had crushed countless weak people because he had power. Now he was reaping what he sowed.\n\nPascal looked like he'd been slapped.\n\nGrid swung Failure again. The elders poured healing magic into Pascal, but it wasn't enough. Linked Kill had taken most of his health, and demonic power now corrupted his body, weakening the effects of their spells.\n\n\"This guy!\"\n\nThe veins on Pascal's balding head bulged. His eyes went bloodshot. In one month. One month, and he would have been Pope, commanding eighty million followers.\n\n\"Why did you appear before me? Youuu! Kuaaaaak! I won't die alone! Light Blaze!\"\n\nPascal was level 330. Lower divine power than former Pope Drevigo, but a much higher level. Named NPCs scaled with the average user level. His magic couldn't be ignored.\n\nRays of divine energy erupted from his body, dozens of them, all aimed at Grid.\n\n*Not a big deal.*\n\nTwo seconds of invincibility remained. Grid charged through the barrage.\n\n\"Crazy!\"\n\nPascal couldn't comprehend it. This was supposed to be a mutual kill. Why wasn't Grid backing down?\n\n\"Even if you're a zombie, you won't survive this! Goddess' Wrath!\"\n\nPascal burned the last of his divine power and health. His final gambit to end the man who had destroyed his future.\n\nTwo massive golden circles materialized behind Pascal, each three meters in diameter. The same spell Pope Drevigo had used. The circles were smaller than Drevigo's version due to Pascal's weaker divine power, but still devastating.\n\nBrilliant white light poured from the circles. The room shook. Cracks spider-webbed across the walls. Magic that surpassed **Transcended Link** in raw destructive power.\n\n> [The duration of Invincible is over.]\n\n*Will I die?*\n\nGrid dismissed the thought. *No.*\n\nPascal with his healing support had been stronger than expected. But the outcome was never in doubt. Grid had known from the start.\n\n*I will win.*\n\nA year and three months since Pope Drevigo fell. Grid had grown. Variables existed, sure. But there was no scenario where Pascal, who was merely on par with Drevigo, could defeat the current Grid.\n\n\"Freely Move!\"\n\nThe skill from his **Secret Hero** title. Limited range, one-hour cooldown. But it was a top-tier dash that avoided all non-targeting attacks until reaching the target.\n\nGrid launched himself at Pascal. He twisted in midair, the white beams of Goddess' Wrath screaming past his shoulders.\n\nDemonic power concentrated in Failure and the Doppelganger's Greatsword, turning them black as pitch.\n\n\"This is ridiculous!\"\n\nPascal watched his ultimate spell miss the target standing right in front of him.\n\nThe greatswords fell.\n\n\"Pinnacle!\"\n\n> [The level of Pagma's Swordsmanship, Pinnacle has increased.]\n> [The amount of damage done to the target and the mana consumption will increase.]\n\nSteel bit deep.\n\n\"Kuk! Kuaaaaak!\"\n\nPascal screamed. The elders abandoned him, redirecting their healing magic to Grid instead.\n\nGreen light flooded the room.\n\nInvincible had just ended. Freely Move was spent. Grid had exactly one health point left, and sixteen beams of divine healing were about to hit him.\n\n*Am I dead?*\n\nNo. Grid wasn't the helpless fool who had died countless times in the early days. He'd learned to think ahead. To calculate.\n\n> [Dark Bus' Earrings have been turned off.]\n> [The effect of Blackening will disappear.]\n\n> [You have been affected by Great Heal.]\n> [The Holy Light Armor raises the recovery magic's power by 300%.]\n> [Your health has been restored.]\n> [Your health has been restored.]\n> [Your health...]\n\nPascal blinked. \"What?\"\n\nHe'd been seconds from death, happy at the thought of dragging Grid with him. Now his expression twisted as Grid's health bar refilled.\n\nThe elders had just healed the man they were trying to kill.\n\n\"This is crazy!\"\n\nPascal's final words before he disintegrated into ash.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}