{
  "id": 281,
  "title": "Chapter 281",
  "content": "# Chapter 281\n\nPascal, third son of Earl Chirita. He understood the world's cruelty well enough. Born too late in the succession, his birthright meant nothing. Did he rage against fate? Did he curse the heavens?\n\nNo.\n\nPascal had *worked*. He'd searched for a path through the darkness, endured every trial the church could devise, and served Goddess Rebecca with fanatical devotion. His fate had changed because of it. The papacy was within reach.\n\n*Now it's my turn. My turn to rule.*\n\nHe'd been ready to savor the end of this unjust world.\n\nThen Grid had arrived.\n\n*Grid!* Pascal's mind screamed. *You destroyed everything!*\n\nThe resentment burned through his chest like acid. His vision pulsed red. Blood leaked from the corners of his eyes, streaming down his greying cheeks.\n\n\"Kuaaaaak!\"\n\nPascal's gaze locked onto Grid, venomous hatred radiating from those bloodshot eyes even as his body dissolved into ash. Grid recognized the curse taking shape in that stare. He didn't flinch.\n\n*Curse me? Go ahead and try.*\n\nHe'd already lived through one hell. Survived it. Clawed his way out. If this curse opened a new one, he'd do it again. Grid's confidence had become ironclad through blood and pain.\n\n\"This guyyyyy!\"\n\nPascal witnessed Grid's unshakeable eyes. Rage consumed the dying man's final moments. His scream echoed through the prayer room, reverberating against stone walls. Then the notification windows appeared.\n\n> [You have defeated pope candidate Pascal, who has caused heartbreak to numerous people.]\n> \n> [725,477,950 experience has been acquired.]\n\nSeven hundred and twenty million experience. Massive. Pascal had given Grid a truly absurd amount as a high-level named boss.\n\nGrid frowned.\n\n*I thought it'd be at least two levels.*\n\nEvery boss raid until now had catapulted him through multiple levels. But he was level 296 now. Different territory. The experience requirements had become astronomical. Despite earning over 700 million points, his gauge hadn't even reached the halfway mark.\n\nUnexpected.\n\n*I can't rely on boss raids alone anymore.*\n\nHe'd made giant leaps through solo hunting, but that method had hit its ceiling. Now he needed grinding. Real grinding. Potions, hunting grounds, repetitive mob kills. The tedious loop every other player dealt with.\n\nHis first targets stood before him.\n\n\"Heok.\"\n\nThe sixteen remaining elders flinched as Grid's eyes swept over them. Hungry eyes.\n\n\"All of you.\"\n\nThe Blackening effect from Dark Bus' Earrings could only activate once every twelve hours. Five minutes of demonic power, twelve hours of cooldown. Unlike the White Transformation attached to the divine artifacts, this Blackening from a single artifact was incomplete. Inefficient.\n\nGrid couldn't rely on demonic power anymore. He faced the sixteen elders with pure strength.\n\n\"Holy Missile!\"\n\n\"Holy Wave!\"\n\n\"Great Heal!\"\n\nThe elders resisted. Their determination not to suffer Pascal's fate sharpened their focus. Casting speed accelerated beyond their normal limits.\n\n\"Link!\"\n\nGrid had acquired the hidden piece 'Sealed Ability.' His skill cooldowns were reduced by 10%. Pagma's Swordsmanship became available far more often. He slashed through two elders in a blur, finished with Unbreakable Justice, then flowed into Kill.\n\nPuok!\n\nThe elder coughed blood onto Grid's Hooded Zip-Up despite his companions channeling Heal. He stared down at the blue greatsword piercing his chest, eyes wide with shock.\n\n\"K-Kuack...!\"\n\n> [You have defeated the corrupt elder Haiber.]\n> \n> [45,908,230 experience has been acquired.]\n> \n> [Your demonic power has increased by one.]\n\n> [You have defeated the corrupt elder Sairus.]\n> \n> [46,441,000 experience has been acquired.]\n> \n> [Your demonic power has increased by one.]\n\n> [You have defeated the corrupt elder Raid.]\n\nThe experience from third advancement priests was terrific. At least ten times more than normal monsters. Semi-named NPCs made the difference. Grid appreciated the gains, but the battle itself was grinding him down.\n\nWithout Blackening, his damage against the elders dropped significantly. His basic attacks barely scratched them. Skills on cooldown left him vulnerable. The elders sustained themselves with Heal while bombarding him with attack magic.\n\nPepeng!\n\nPepepepeng!\n\nLight exploded across his body in continuous waves. Wounds multiplied. The Holy Light Armor became soaked with blood, fabric tearing into rags.\n\n*This can't continue.*\n\nGrid made the choice. He recalled the pavranium protecting the prostitutes in the corner. Unavoidable.\n\nJjejeong! Jjejejeok!\n\nThe golden spear joined the battle. It defended Grid's blind spots, struck at enemies, effectively doubling his offensive capability.\n\n\"Kuaack!\"\n\nLifael's Spear shattered Holy Shields. Grid's blade followed through the openings, carving into the elders' health. He downed mana potions, triggered skills the instant cooldowns ended, methodically eliminating targets one by one.\n\n*It's hard to endure!*\n\nPanic spread across the elders' faces. Priests were support classes, not frontline combatants. Their offensive abilities alone couldn't deliver fatal damage to Grid.\n\n\"Ohhhhhh!\"\n\nGrid's rampage intensified. His physical abilities far exceeded the elders' capabilities. A moment of crisis came, but Doran's Ring saved him. Five seconds of invincibility. And there was always the legendary passive waiting.\n\nGrid functionally had three lives. A fraudulent combination of class and equipment.\n\n*Dammit!*\n\nEight elders remained. They resorted to the worst tactic. They grabbed the prostitutes trembling in the corner.\n\nOne elder's voice cracked with desperation. \"Don't move a single muscle! If you move, I'll kill them!\"\n\nInnocent women. They'd witnessed slaughter. Now they were being threatened. It was regrettable.\n\nThe elders smiled as Grid hesitated.\n\n*It worked!*\n\n*Now we just need to hold until the paladins arrive!*\n\nGrid had protected the prostitutes with the golden spear. The elders assumed he valued their lives.\n\nBut.\n\n\"Kill them.\"\n\nGrid started walking forward.\n\n\"What...?\"\n\nHe didn't care that the elders' magic was aimed at the prostitutes.\n\n\"I won't take damage even if they die.\"\n\nOf course, he felt bad. This was a moral issue. He'd probably be called a psychopath. Who wouldn't condemn letting innocents get swept away by turmoil he'd caused?\n\nGrid had done his best. He'd minimized damage to the prostitutes, supported them with Lifael's Spear.\n\nThat was enough. He wouldn't fail the quest because of them.\n\n*Actually, this is better.*\n\nThe prostitutes were witnesses. They'd seen Grid hunt Pascal and the elders. There was risk they'd testify against him later. Better for them to die than for Grid to fail.\n\nStep. Step.\n\nThe frightened elders cried out as Grid approached.\n\n\"D-Don't come closer! I really will kill them!\"\n\nYiing.\n\nPower gathered at the elders' fingertips, aimed at the prostitutes. Grid snorted.\n\n\"Kill them?\"\n\nTeong!\n\nGrid leapt forward. The elders' eyes widened as he drew Failure.\n\n\"I really will kill them!\"\n\nKwa kwa kwa kwang!\n\nLight exploded. The prostitutes' bodies disintegrated. Grid's eyes darkened as he identified their ashes.\n\n\"Wave.\"\n\nChaaeng!\n\nEnergy rippled outward, slamming into the eight elders. Their speed dropped. The blue greatsword carved through them. After approximately ten minutes of fighting, silence fell.\n\n\"Pant... Pant...\"\n\nOnly Grid and Earl Chirita remained in the room.\n\n\"P-Please! Please spare me!\"\n\nEarl Chirita staggered forward. He'd witnessed the helpless Pascal and the slaughtered elders. Half-insane, he dropped to his knees.\n\nGrid's voice was cold. \"I told you. I'm the only one who survives here.\"\n\nPuok!\n\n\"Cough...!\"\n\n> [Earl Chirita of the Saharan Empire has been defeated.]\n> \n> [3,110,400 experience has been acquired.]\n> \n> [2,000 gold has been acquired.]\n> \n> [Your demonic power has increased by one.]\n\nGrid rifled through the corpse. \"This is an unexpected bonus.\"\n\nTwo thousand gold. That was 2.4 million won. Earl Chirita had been carrying a fortune in his luxurious clothing.\n\n> [The time attack quest 'Evidence Destruction' has been completed!]\n> \n> [Rumors about you won't spread to the Saharan Empire!]\n\nKurururu...\n\nThe room began collapsing. Ceiling tiles cracked. Support pillars fractured. Grid identified the structural damage and bolted.\n\n***\n\n\"Master! Why do you look like this? Nyang!\"\n\nGrid escaped to Isabel's room. Noe worried over him as he collapsed onto the bed. The atmosphere around Grid felt dark, oppressive.\n\nGrid stroked Noe's head. Guilt over the dead prostitutes gnawed at him.\n\n\"It's nothing.\"\n\nHe sometimes forgot this fact, despite his love for Irene. This was ultimately a game world. It was good to cherish NPCs, but that could also become poison. Grid controlled his emotions. Then he examined Pascal's drops one by one.\n\n<span class=\"rarity-uncommon\">Goddess' Essence</span>\n\n<span class=\"rarity-rare\">Blessed Weapon Enhancement Stones (5)</span>\n\n<span class=\"rarity-rare\">Blessed Armor Enhancement Stones (7)</span>\n\n<span class=\"rarity-epic\">High-rated Magic Stones (11)</span>\n\n<span class=\"rarity-rare\">Pascal's Secret Warehouse Key</span>\n\nNo equipment items dropped. Somewhat disappointing, but Grid was satisfied enough.\n\nThe <span class=\"rarity-uncommon\">Goddess' Essence</span> was essential material for crafting the three divine artifacts of the Rebecca Church (Reproduction). Only a small amount, but he was happy Pascal had dropped it.\n\nThe <span class=\"rarity-epic\">High-rated Magic Stones</span> were worth 4,000 gold each and could be used to make magic items.\n\n*The more enhancement stones I have, the better.*\n\nAll of Pascal's drops were recognizable. Among them, Grid was particularly interested in a golden key.\n\n> [Pascal's Secret Warehouse Key]\n> \n> The key to opening Pascal's secret warehouse.\n> \n> There is a mountain of gold and silver piled up in Pascal's warehouse.\n\n*Mountain...!*\n\nHow much wealth would it take to be described as a *mountain*?\n\n*I'm going to be rich!*\n\nGrid shot to his feet. Then Damian's whisper arrived.\n\n*—It's chaos out here! Someone killed Pascal and the elders!*\n\n*—I killed him.*\n\n*—Huh?*\n\nGrid asked the stunned Damian a question.\n\n*—Do you know where Pascal's warehouse is?*\n\nDamian went silent for a moment before replying.\n\n*—Warehouse...? I don't know, but Pascal always uses the first prayer room.*\n\n*The first prayer room.*\n\nGrid didn't delay. He sprinted straight toward the first prayer room.\n\nClink.\n\nHe inserted the key. The warehouse door opened.\n\nSwaaaaah!\n\nBrilliant golden light flooded his vision. Painful to look at directly.\n\n\"Amazing...\"\n\nGold was literally piled like a mountain inside the massive warehouse. The epitome of a dragon's hoard.\n\n\"Is this all mine?\"\n\nIf he took everything here, he'd have tens of billions of won. The excitement made his sphincter muscles contract involuntarily.\n\n\"Puhahaha! I'm going to be rich! Rich!\"\n\nGrid celebrated.\n\nThe notification window appeared like lightning from clear skies.\n\n> [The safekeeping system of the secret warehouse has failed to detect Pascal's divine power and has activated.]\n> \n> [The warehouse will explode after three minutes!]\n> \n> [Gather as much riches as possible in three minutes.]\n\n\"Dammit!\"\n\nThings had been going too well. What should he do to maximize gold collection in three minutes? Grid thought frantically while pouring gold coins into the confused Noe's mouth.\n\n\"Summon Knights.\"\n\nThe system he never used during crises to save experience finally activated.\n\n\"I have responded to My Lord's call.\" Piaro materialized from light.\n\n\"Please give a command.\" Asmophel appeared beside him.\n\n\"Grid!\" Ten Overgeared members followed.\n\nGrid shouted at them. \"Grab the money! Money!\"\n\n\"...\"\n\nTheir historic first mission after being pillars of the empire. Picking up gold coins.\n\nComplex emotions crossed Piaro and Asmophel's faces."
}