{
  "id": 282,
  "title": "Chapter 282",
  "content": "# Chapter 282\n\n*I want to see him.*\n\nJishuka, the expert archer, sat in her office in Bairan. Paperwork covered her desk. Development plans. Raid schedules. Resource distribution logs. She'd been running this territory for seven months now, raiding the Guardian of the Forest on a regular cycle and funneling the profits to Reidan. Without her work, Reidan would have collapsed under its own financial weight by now.\n\nBut the satisfaction she should have felt from that knowledge was absent. Instead, irritation gnawed at her.\n\nSeven months. Seven months since she'd last seen Grid in person.\n\nShe leaned back in her chair. Closed her eyes. Men courted her constantly. The wealthiest, most powerful men in South America sent letters, gifts, requests for her time. She was beautiful, she knew that. Everyone told her so. The cameras loved her. The rankings proved it.\n\nNone of it mattered.\n\nShe exhaled through her nose.\n\n*I could just leave. Drop everything and go to him.*\n\nThe thought surfaced for the hundredth time that day. Her fingers drummed against the armrest.\n\nThen the notification appeared.\n\n> [Your lord 'Grid' has summoned you. Would you like to accept the summons?]\n\nHer eyes snapped open. Her heart kicked against her ribs.\n\n*He knows.* The certainty flooded through her with zero rational basis. *He knows I was thinking about him right now.*\n\nHeat rose in her cheeks. Her pulse quickened. She had no reference point for this feeling. No past experience to anchor her judgment. At twenty-six years old, she'd never wanted anyone the way she wanted Grid.\n\n*A surprise.* The thought crystallized. *He wouldn't summon me without warning unless he planned something.*\n\nHer imagination supplied the rest. Grid waiting for her. That intense look in his eyes when he focused on something. His voice low, private. \"Jishuka, I wanted to see you too. I thought about you every night.\"\n\nThe smile spread across her face before she could stop it. She glanced down at herself. At the high-cut leather armor that revealed more skin than it covered. Stats were stats. Function over modesty. But still.\n\n*Too late to change now.*\n\n\"I will respond to the summons.\"\n\nThe world dissolved.\n\nWhen her vision cleared, she stood in a warehouse. Mountains of gold coins surrounded her, glittering under the torchlight. Her breath caught.\n\n*For me?*\n\nHer throat tightened. The gold piled so high it nearly touched the ceiling. More wealth than she'd ever seen in one place.\n\n*Our wedding fund.* The thought arrived unbidden. Her face burned. *No. Stop. Dating first. Marriage later. I need to know him better. What he's like during the day. What he's like at night.*\n\n\"Hey Jishuka.\" Pon's voice cut through the fantasy like a blade. \"Hasn't it been a while?\"\n\n\"Have you become prettier in the meantime?\" Regas grinned at her. \"Did you get a boyfriend?\"\n\nVantner leered. \"Why does women's armor become more exposed the higher the level? I am thankful.\"\n\nReality crashed back into focus. She turned her head. Pon, Regas, Vantner, Toban, Faker. The entire Tzedakah crew stood scattered around the warehouse, all of them staring at the gold.\n\nHer stomach dropped.\n\n*Not alone. He didn't call me here alone.*\n\nShe searched for Grid. Found him crouched near the largest pile, both hands shoved into his cat's mouth, forcing gold coins down its throat.\n\n\"Get the money! Money!\" Grid's voice cracked with urgency. \"This place will explode in 2 minutes and 40 seconds, so make sure you get as much as you can!\"\n\nThe fantasy shattered completely.\n\n\"...This is the reason for summoning us.\"\n\nThe Overgeared members moved as one, converging on the gold. Lauel appeared at Jishuka's elbow.\n\n\"What are you doing?\" He bent down and scooped up a handful of coins. \"Go and grab the money.\"\n\nShe stood frozen. Stared at the absurd scene. At Grid wrestling with his demonic cat. At grown men scrambling for loose coins like children at a carnival.\n\nReidan needed this gold. The finances were a disaster. She knew that better than anyone.\n\nShe knelt and started filling her inventory.\n\n> [62]\n\n> [75]\n\n\"There is a limit to picking it up one by one.\" Someone complained behind her.\n\n\"If Euphemina was here, she could move it all at once with Mass Teleport.\"\n\n\"That...\" Another voice. \"Why is she disconnected when this is happening?\"\n\n\"I'll use a shovel.\"\n\n\"Should I pick it up with my shield?\" Toban hefted his massive shield.\n\n\"Oh, that is a good idea?\"\n\n\"Hrmm.\"\n\nLauel straightened. His eyes narrowed in calculation. Then he raised one hand.\n\n\"Dragon Claws.\"\n\nThe stone floor ruptured. Three pillars of rock exploded upward through the gold, scattering coins in all directions. The pillars retracted just as quickly, leaving deep pits in their wake. Lauel's hands moved in a fluid gesture.\n\n\"Wind Dragon's Roar.\"\n\nThe wind struck like a physical force. It gathered the loose coins in a howling vortex and poured them into the pits like a waterfall of gold. The sound drowned out everything else for three seconds.\n\nThe other Overgeared members caught on fast.\n\n\"Mach Spear!\"\n\nPon's spear shot forward. The sonic boom hit the warehouse wall and blew it apart. Stone and wood exploded outward, opening a passage to the outside.\n\n\"Charge!\"\n\nVantner and Toban locked their shields together. They advanced on the nearest gold mountain like a two-man phalanx, pushing the coins toward the hole. Their boots scraped against the floor. Muscles strained. The mountain shifted, slowly at first, then faster.\n\nPiaro climbed to the top of another pile. He held a hand plow in one fist and a hoe in the other. His weathered face showed no expression.\n\n\"Free Farming.\"\n\nHis hands blurred. The tools moved faster than sight. Each strike launched gold coins through the air in perfect arcs. They sailed through the broken wall and landed in neat stacks outside. The precision was surgical.\n\nAsmophel had been standing still, watching. His jaw tightened. Then he moved.\n\n\"Aura Explosion.\"\n\nThe blast carved a hole in the opposite wall twice as large as Pon's. Asmophel thrust both palms forward. A tornado of blue aura erupted from his hands and grabbed hundreds of coins at once, hurling them through the opening in a glittering stream.\n\nIt was working. They might actually salvage most of the treasure before the explosion.\n\nGrid remained on his knees, both hands crammed with coins, shoving them into inventory slots and Noe's protesting mouth.\n\n\"Oh! I will pack all of this!\"\n\nPiaro glanced at him. Shook his head.\n\n\"This limited field of view is poisonous.\"\n\nThe words cut through Grid's greed. He blinked. Looked up. Saw his guild members using skills to move gold by the ton while he picked up individual coins like a miser.\n\n*I can use skills.*\n\nThe realization hit him like cold water. He released Noe.\n\nThe cat's eyes welled with tears. \"Spit spit spit! These shiny things are tasteless! Nyang! Kuuock!\"\n\n\"Taste isn't important.\" Grid grabbed Noe's scruff. \"Don't spit it out and keep eating... You, why are you burping?\"\n\n\"Didn't I say I won't eat this? Nyang!\"\n\n\"No! Don't chew it and keep it in your mouth! Like a squirrel keeps acorns!\"\n\nNoe was a Memphis. A demonic beast of hell. When he used Soul Ingestion, his mouth could expand to any size. Grid had seen him swallow a man's soul whole. Storing coins should be trivial.\n\nGrid gave Noe a final push toward the gold, then straightened. Drew Failure from his back.\n\n*How much have my skills increased?*\n\nHe felt the weight of attention shift. The Overgeared members watching. Piaro and Asmophel waiting, evaluating. Grid pulled on the Slaughterer's Eye Patch. The world sharpened into lines of force and weakness.\n\n\"Pagma's Swordsmanship, Transcend.\"\n\nPower flooded through him. His hair lifted in an invisible wind. Red light gathered at Failure's edge. He studied the mountain of gold, tracing the stress points, the places where weight pressed against weight. Then he swung.\n\nThe greatsword carved through the air.\n\n*Crack.*\n\nThe impact was surgical. Precise. The mountain's balance collapsed. Coins poured through the holes in the walls like a golden tide, the cascade deafening.\n\nPiaro's eyes narrowed. *Wonderful.*\n\nThe skill had improved. Proof that Grid hadn't wasted the months he'd spent alone. Even if he relied on the Eye Patch's vision, the execution was his own. The control was his.\n\nEveryone stared at the waterfall of gold.\n\nEveryone except Jishuka.\n\nShe stood near the back wall. Her bow materialized in her hand. The string pulled back without her consciously deciding to draw it. Frustration and embarrassment and something sharper burned in her chest.\n\n\"Avoid this. Phoenix Arrow!\"\n\nThe bowstring sang.\n\nA phoenix made of flame erupted from her position. It crossed the warehouse in a heartbeat and struck the remaining gold mountain dead center. The explosion shook the foundation. Half the remaining coins launched through the exits in a burning wave. Many melted in mid-air, liquefying from the heat.\n\nGrid didn't care about the loss. Ten seconds remained. If Jishuka hadn't acted, they'd have lost everything left inside.\n\n\"Pant pant... Avoid it!\"\n\nHe dove sideways as a stray ember from the phoenix nearly caught his shoulder. The rest of the Overgeared members sprinted for the exits.\n\nThe warehouse detonated behind them.\n\nThe shockwave hit like a fist. Grid's ears rang. He tumbled across the ground outside and came up on his knees, coughing.\n\n\"Kyaaak!\"\n\n\"What is it this time?\"\n\nVoices from the main courtyard. The wedding guests turning toward the noise. Beyond the waterfall, the first prayer room burned.\n\n\"It must be the criminal who murdered the elders!\" Paladins rushed toward the fire. \"Go there now!\"\n\n\"Wait a minute.\" Damian's voice cut through the chaos.\n\nThe paladins stopped. \"Yes, Goddess' Agent.\"\n\nDamian had no formal rank. The elders had ignored him. But the rank-and-file paladins respected him. They listened when he spoke.\n\n\"You will remain here and investigate.\" Damian gestured toward the burning building. \"I will go there with Isabel and Grid.\"\n\n\"I will follow the will of the Goddess' Agent.\"\n\nThe paladins parted. Created a path. Damian glanced back at Isabel and at Randy, who was Grid wearing the doppelganger's face. The divine power saturating the Vatican was eroding Randy's disguise. The features flickered. Sometimes Grid, sometimes not.\n\n\"Follow!\"\n\nThe OGC camera team surged after Damian's group. They smelled blood. A story. The murders of the elders would drive viewership through the roof.\n\nDamian didn't let them through. He drew his sword and unleashed the techniques Piaro had drilled into him. Swordsmanship and magic combined. Dozens of spells erupted from his hands, creating walls of light and force that blocked the cameras.\n\nThe viewers would rage. Damian didn't care.\n\nProtecting Grid mattered more than ratings.\n\n***\n\n\"It is Pascal's hidden wealth.\"\n\nGrid and the Overgeared members knelt in the grass outside the warehouse, stuffing coins into their inventories. Damian approached and stopped. His expression twisted.\n\n*This is what Pascal built with stolen funds and corruption.*\n\nThe thought turned his stomach.\n\n\"Damian, become the pope.\"\n\nGrid spoke without looking up. He crouched in the grass, hands working mechanically, grabbing coin after coin. He looked ridiculous.\n\nTo Damian, he looked like a saint.\n\n\"I will surely become the pope, whom you need.\"\n\nGrid had done everything. Rescued Isabel. Killed Pascal. If Damian failed to claim the papal throne after that, he'd have no pride left. No right to call himself a man.\n\nGrid met his eyes. Grinned. \"I believe in you.\"\n\nSomething in Damian's chest cracked open.\n\nHe knew Grid's motives weren't pure. Grid wanted a pope he could work with. A political ally. Benefits for Overgeared. Damian understood that clearly.\n\nBut Grid still said he believed in him.\n\nNo one had ever said that before. Damian had lived his whole life dismissed, ignored, labeled an otaku and a fanatic. Even his own church treated him like an embarrassment.\n\nGrid believed in him.\n\n\"Perhaps...\" Grid stood. Brushed dirt off his knees. \"Would you like to join Overgeared?\"\n\nA pope in a player guild. The idea was absurd.\n\nIt was also the best offer Damian had ever received.\n\n\"The Rebecca Church is supposed to be neutral on the surface.\" Lauel materialized beside Grid. He spoke quietly. \"Officially, at least.\"\n\nGrid frowned. Considered. Then nodded. \"That's right.\"\n\nThe disappointment on Damian's face must have shown, because Grid reached out and clasped his shoulder.\n\n\"Well, so what if we aren't in the same guild?\" Grid's grip tightened. \"It doesn't change the fact that we are eternal companions. Join the guild after your term as a pope is over.\"\n\n\"...Yes.\"\n\nDamian smiled. A real smile, not the nervous expression he usually wore.\n\nHe had a friend.\n\nHe shook Grid's hand.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}