{
  "id": 283,
  "title": "Chapter 283",
  "content": "# Chapter 283\n\nThe mountain of gold coins stood nearly four meters high. During the three-minute scramble, the Overgeared members had clawed, grabbed, and hauled as much as humanly possible. Lauel tallied the final count.\n\n\"Twenty-one million gold.\"\n\nPon's eyes widened. \"Are you serious?\"\n\n\"That's incredible.\" Regas whistled.\n\nVantner slapped Grid's shoulder. \"He did it again! This is insane!\"\n\nTwenty-one million gold. The Korean won equivalent hovered around 25.5 billion. Nearly half the annual salary of the world's top athletes. Pon turned to Vantner, frowning in thought.\n\n\"When Seuron cleared Vasco's Labyrinth, what was his haul?\"\n\nThat raid had happened two months before the Reidan invasion. Vantner had watched the broadcast live. He scratched his bald head.\n\n\"Including the <span class=\"rarity-legendary\">Brutal Heavy Sword</span>, maybe eight million gold total.\"\n\n\"Grid got almost triple that? By himself?\"\n\nLauel adjusted his glasses. \"Technically, it wasn't solo. Without us, Grid couldn't have moved two hundred thousand gold by hand in three minutes. But the raid itself? That was all him. His choices. His skills. Summoning the knights was brilliant.\"\n\nThe Overgeared members erupted into cheers.\n\n\"Grid, you're the best!\"\n\n\"Of course our master's the best!\"\n\n\"Congratulations on getting rich!\"\n\nTheir praise washed over Grid like warm water. Genuine congratulations. Real joy, as if the money belonged to them all. No jealousy. No envy. Their respect for Grid ran deeper than greed.\n\n\"Haha!\"\n\n\"Kilkil.\"\n\n\"...\"\n\nThe Overgeared members buzzed with excitement, voices overlapping in celebration. Grid stood silent. They assumed he was overwhelmed by happiness, struck speechless by his good fortune.\n\nThey were wrong.\n\n*Why?* Grid's jaw clenched. *Why isn't it one trillion?*\n\nThe warehouse had been packed. Mountains of gold, ceiling-high stacks that seemed endless. He'd expected at least one trillion won. But twenty-one million gold?\n\n\"This is ridiculous!\" Grid's shout cut through the chatter. \"We carried out most of those gold coins before the explosion! There were **countless** coins! So why? Why is it only twenty-one million?!\"\n\nThe celebration died.\n\n*Only?* The Overgeared members exchanged glances. Who calls twenty-one million gold 'only'?\n\n\"It's a scam! A complete scam!\"\n\nLauel stepped forward, palms raised. \"The explosion was more powerful than expected. It reached outside the building. A lot of coins were destroyed in the blast. Plus, your skills damaged many more during the fight.\"\n\nDamaged gold coins always disintegrated. Some kind of anti-duplication measure by S.A. Group.\n\n\"Dammit!\" Grid kicked at nothing. \"The gold gets destroyed? The warehouse explodes? Those bastards!\"\n\nHe couldn't stop the curses. His temper flared hot and ugly. Only Lauel possessed the patience to talk him down.\n\n\"Twenty-one million gold is still massive. The S.A. Group is probably more shocked than you are. They never imagined you'd extract this much in three minutes.\"\n\nThe **Summon Knights** skill used for gold collection? Impossible to predict. S.A. Group probably calculated Grid could manage one million gold at best. He'd blindsided them. Grid should feel triumphant. Instead, he fumed.\n\n\"The coins could've been melted down! Why destroy them?!\"\n\n*He has a point.* The Overgeared members nodded. S.A. Group's inflation controls seemed excessive. Two billion users, plus NPCs, all used the same currency. The value wouldn't crash from one big payout.\n\nGrid and the group filed out of the Vatican ruins.\n\n\"Winston, right?\" Lauel asked.\n\n\"Yeah.\" Grid sighed.\n\n\"Your wife needs to see you.\"\n\n\"She's pregnant, isn't she?\"\n\n\"The childcare system, a future heir. I'm jealous. Raising a child sounds fun.\"\n\n\"Grid Junior...\" Regas trailed off.\n\nTalk of Irene and his unborn child cooled Grid's anger. He couldn't afford to lose control when fatherhood loomed. After a moment, he pulled out a trade window and transferred gold to Lauel.\n\n\"Take twenty million for Reidan's development.\"\n\n\"...!\"\n\nLauel's jaw dropped. The Overgeared members froze in shock. None had expected Grid to invest the money into the territory.\n\nGrid looked away. \"I'm useless as a lord. I do nothing. The least I can do is throw money at the problem.\"\n\nHe should be working hardest for Reidan. Reality painted a different picture. Grid neglected his obligations while the Overgeared members handled everything. The guilt gnawed at him constantly. He wanted to help, even if only financially.\n\n\"When Reidan develops, we all benefit. Right?\"\n\n\"You're absolutely correct.\" Lauel's smile widened.\n\nA strong Reidan meant a strong Overgeared Guild. The foundation for Grid's future kingdom. Enormous wealth in the long term. Twenty million gold was pocket change compared to that potential. Grid understood this calculation perfectly.\n\n\"By the time you return, Reidan will be transformed. Look forward to it.\"\n\nTwenty million gold was enough to jumpstart everything. Once the yellow mithril mine opened and the alchemy facilities expanded, Reidan would leap forward.\n\n*The second Talima!* Lauel's mind raced. Talima, the dwarven city producing the continent's finest equipment. Locked behind the dragon Trauka's territory, inaccessible to humans. If Reidan could rival that legacy...\n\nPlans crystallized in Lauel's head. The Silver Knights Guild merger. Infrastructure priorities. Resource allocation.\n\n***\n\n\"First time we've traveled alone together.\"\n\n\"Y-Yeah.\"\n\nAfter parting from Lauel's group, Grid and Jishuka walked toward Winston.\n\n*Gulp.*\n\nGrid swallowed hard. He couldn't help it. Jishuka's face was beautiful, her body incredible.\n\n*Grid's watching me.* Jishuka felt his gaze. She adjusted her walk, hips swaying with each step like a runway model. Curves emphasized, movement deliberate.\n\n*Gulp.*\n\nGrid stared at her hips. Unavoidable. Jishuka's figure matched his preferences perfectly. Her personality, too.\n\n\"Let's camp here tonight.\" Jishuka glanced back. \"Grid... can I use your arm as a pillow?\"\n\n\"Huhu, your body is so solid.\"\n\nProvocative at night.\n\n\"I'll cook.\" She smiled sweetly the next morning.\n\n\"Oh my, Grid. Watch where you're going. Focus on the monsters.\"\n\n\"I'm embarrassed.\"\n\nGentle during the day.\n\n*I'm going crazy.*\n\nGrid's attraction to Jishuka multiplied exponentially. He seriously considered buying a **Love Potion** from the Reputation Store, the one that reset the monthly restriction. But Jishuka had no intention of allowing that.\n\n*There's no point in Satisfy.* Grid was married to Irene. She wouldn't be a concubine. Her real feelings would emerge in reality, not here. For now, she was simply teasing him. And Grid suffered for it. He wanted to see Irene immediately.\n\n***\n\nJust before Winston's walls appeared on the horizon, Grid made plans to meet Jishuka again in six hours and logged out. His phone was buzzing. Sehee's call.\n\n\"Why'd you call?\"\n\nGrid climbed from the capsule and spoke bluntly to his sister.\n\n\"We have a guest.\"\n\n\"A guest?\"\n\nHe checked the time. Eleven in the morning. Sunday. What kind of guest visits when families are supposed to be together? Youngwoo frowned, then walked into the living room.\n\nHis brain short-circuited.\n\n\"Y-Yura?\"\n\nYura sat on the sofa, smiling and chatting with his parents. She looked particularly beautiful today. That neat, polished charm radiating from her. If Jishuka's beauty matched his tastes one hundred percent, Yura possessed a beauty that made taste meaningless.\n\nYoungwoo stared too long. His mother noticed.\n\n\"Youngwoo, stop gawking. Come sit.\"\n\n\"Ah. Right.\"\n\nHe shuffled to the couch awkwardly. His parents occupied one sofa together, forcing Youngwoo to sit beside Yura. Her perfume tickled his nose. She bowed slightly to his parents, then turned to him.\n\n\"Buy me a meal.\"\n\n\"What?\" The request came from nowhere. \"Why are you asking me to feed you? Can't you buy your own food? Wait, how'd you find out I made money?\"\n\n*This witch came for my cash!* Yura was different from the Overgeared members. She'd helped him plenty, but wariness still prickled his instincts. They weren't friends yet. His parents caught Yura's wounded expression and rounded on him.\n\n\"How can you talk to a guest like that?\"\n\n\"Youngwoo, we raised you better than this.\"\n\nYura was pretty, talented, and wealthy. Youngwoo's parents desperately wanted her as a daughter-in-law.\n\n*You don't know her nickname is Blood Witch.* Youngwoo thought bitterly. A murderer who hurt people without changing expression. That first impression still haunted him. He sighed and stood.\n\n\"Let's go.\"\n\nYoungwoo didn't bother washing up. He wore sweatpants with food stains. His mother tried to make him change, but Yura didn't care. She found his indifference to others' opinions attractive.\n\n***\n\nThey chose a shabby restaurant near his building. Youngwoo ordered two servings of bulgogi rice while Yura studied the modest interior. She pulled out a bankbook and slid it across the table.\n\n\"What's this?\"\n\n\"Your broadcast fee from OGC Station.\"\n\n\"Oh.\" He hadn't expected much. Youngwoo didn't understand why Yura delivered it personally, but money was money.\n\n*I should celebrate tonight. Go to a nice restaurant.* He'd eat big. Bean sprouts. Lots of monkfish. He assumed maybe a few million won. Then he opened the bankbook.\n\n\"Wh... what?!\"\n\nThe number didn't make sense. Not hundreds of thousands. Not even hundreds of millions.\n\n\"Five... five **billion**?\"\n\nYura nodded. \"Some was withheld for taxes.\"\n\n\"Why is it so much?!\"\n\n\"My negotiating ability.\"\n\nNot arrogance. Simple truth.\n\n\"Why are you doing this for me?\" Youngwoo's voice dropped.\n\nYura answered without hesitation. Her life was busy. Time had value. No point wasting it.\n\n\"Let me join Overgeared.\"\n\nYoungwoo didn't hesitate either. Collecting talent was his obsession, and Yura was better than anyone. Fifth on the unified rankings, right? As a private ranker, Youngwoo didn't follow the ranking system. He didn't know Yura had vanished from the list entirely.\n\n\"Welcome aboard.\"\n\nThey ate the bulgogi together. Yura wore a happy expression throughout the entire meal. Anyone who knew her would've been shocked speechless.\n\n---\n\n**Current schedule:** 20 chapters a week.  \n**Patreon:** Early access to unedited chapters and bonus chapter goals available."
}