{
  "id": 284,
  "title": "Chapter 284",
  "content": "# Chapter 284\n\n*Did he forget about me?*\n\nThe great magician Braham. Over a year had passed since he commissioned Grid to craft him a Vessel of the Soul, a requirement for his resurrection. Yet no word had come. Through Mumud's Orb, Braham caught fleeting glimpses of Grid's activities. The bastard showed no inclination to fulfill the request.\n\n*He plans to take all the pavranium!*\n\nBraham's patience had shattered. He'd dispatched the golem army as a warning. When that failed, his fury reached a boiling point.\n\n[Pagma's Descendant...!]\n\nA soul's emotions cannot lie. His fragments, scattered across the continent, flared crimson in unison. One such fragment caught someone's attention.\n\nThe first vampire city.\n\n\"Oh my? I feel dirty magic power. Who is it?\"\n\nThe wards crumbled like parchment. A woman appeared before Braham's soul, her magic power blazing like a dragon's heart. Even Braham felt his essence waver.\n\n[Y-You...!]\n\nBlack hair framed a face of impossible beauty, equal parts gentle and sensual. The soul fragment trembled.\n\n[Marie Rose! How did you escape your seal?]\n\nMarie Rose. Vampire Duke. A direct descendant of the founder Shizo Beriache, possessing magic power that eclipsed all others. She reached out and plucked Braham's soul from the air like a firefly.\n\n\"I could have broken the seal whenever I wished.\" She examined the fragment with idle curiosity. \"I was simply bored. Sleeping passed the time.\"\n\nThe bloody scent wafting from a certain human's cloak had roused her. Her lips curved into a crescent smile.\n\n\"Braham, you lost your pure blood. Degenerated. Died. Now only your soul remains.\" She tilted her head. \"This insignificant form suits you.\"\n\n[Don't taunt me!]\n\nThe soul burned brighter, shifting from red to crimson.\n\n\"Our Braham wouldn't be without countermeasures.\" Marie Rose rotated the soul fragment between her fingers like clay. \"What are you planning?\"\n\nHer smile could have lit the entire dark city.\n\n\"You dream of resurrection, don't you?\"\n\nBraham was unique among their kind. He'd rejected the clan's innate power, choosing instead to pursue magic itself. Perhaps he'd actually completed the resurrection spell. The soul didn't deny it.\n\n[So what will you do? You can't stop me!] The fragment pulsed with defiance. [As long as one soul hidden across the continent survives, I will return! And when I do, I will devote every ounce of my power to destroying you!]\n\nMarie Rose found the outburst endearing.\n\n\"I wonder how far you'll go as a mortal.\"\n\n[...!]\n\n*Mortal!* That cursed word. Braham recoiled as if struck.\n\nMarie Rose returned the fragment to its hiding place. She turned to leave.\n\n[Aren't you going to destroy it?]\n\nThe question stopped her mid-step.\n\nBraham had been banished from the clan. He'd hidden his soul fragments in the vampire cities under cover of darkness, gambling they'd go unnoticed. Now that Marie Rose had found one, surely she'd crush it.\n\nBut Marie Rose had no interest in swatting insects.\n\n\"How annoying.\"\n\nShe vanished.\n\nBraham's soul flickered like a flame in her wake. *This mutation that transcends even the founder...!* He had to be resurrected. *I will kill the one who made me like this. Take their heart. Reclaim eternal life!*\n\n***\n\nWinston had problems.\n\nGrowth into the north's second-largest city brought infiltrators. Rival factions. Violence. Security crumbled under the weight of competing interests.\n\nPhoenix pressed his palms against his temples. *Lady Irene needs to recover...*\n\nSix months into her pregnancy, Irene had withdrawn into herself. Her father remained in Frontier. Her husband was in Reidan. She was alone.\n\nPhoenix exhaled slowly. Winston's chief knight was old now. Too old to shoulder Irene's administrative burden alone.\n\n*If only Grid were here.*\n\nHe stared at the mountain of documents when boots thundered in the hallway.\n\n\"Captain Phoenix! Blood at Rein!\"\n\nRein. A slums tavern. The sort of establishment that attracted the worst Winston had to offer. Phoenix's jaw tightened.\n\n\"Who?\"\n\n\"The Double-Billed Merchant Group and the Yellow Guild!\"\n\nThe Double-Billed Merchant Group controlled Winston's markets with an iron fist. Their recent push into orc leather had sparked a collision with the Ikeil Merchant Group, who'd hired the Yellow Guild as enforcers.\n\n*Those Yellow bastards.*\n\nThe Yellow Guild was powerful. Average level close to 200. The strongest guild in Winston. Phoenix would need to handle this personally.\n\n\"Let's go.\"\n\nHe strode from the office, soldiers and knights falling in behind him.\n\n***\n\n\"The strongest knight in the north isn't much.\"\n\nRein Tavern. Dozens of patrons watched Phoenix collapse to his knees. The Yellow Guild had mauled him.\n\n\"You...!\"\n\nPhoenix glared through bloodied teeth.\n\nAt a Rebecca Church priest.\n\nDong Pao. The same priest who'd once enjoyed PKing with Shay's group now lent his strength to the Yellow Guild. For money, naturally. What could be better than earning a fortune while gaming?\n\n\"A tip for your service.\"\n\nAnk, master of the Yellow Guild, tossed a coin purse to Dong Pao. Payment for approaching Phoenix under the guise of a holy man and creating an opening. Dong Pao counted the contents and grinned.\n\n\"Excellent. Kill the witnesses.\"\n\n\"Naturally.\"\n\nAnk had no intention of leaving survivors. The penalty for murdering knights and soldiers? Worth the risk. He'd flee the Eternal Kingdom after this job.\n\n*Once I have the Sword of Self-transcendence!*\n\nA legendary item, supposedly crafted by Grid as a novice. Expected selling price: 1.5 million gold.\n\n*No.* Ank reconsidered. *More users are hitting level 180 now. An auction could push it past 2 million.*\n\nEnough to transform his life.\n\n*I can finally drink with girls!*\n\nA remarkably petty dream. Ank approached the fallen Phoenix, who'd fought alone against forty guild members. Half of them lay dead around him. The price had been steep, but worth it.\n\n\"Be a good NPC and drop the Sword of Self-transcendence.\"\n\nAnk smiled. He felt no guilt about killing NPCs for profit. Murder meant nothing to him.\n\nHis blade descended toward Phoenix's forehead.\n\n*Puok!*\n\nA golden blade punched through Ank's neck.\n\n> [You have suffered 3,900 damage.]\n\n\"Ugh!\"\n\nA throwing weapon dealt *that much*? Ank spun toward the source.\n\n\"Where are you?\"\n\nThe answer came from behind.\n\n\"Guess.\"\n\n*Kwajak!*\n\n> [You have suffered 11,900 damage.]\n\n*This is insane!*\n\nWhy was the attack power so monstrous? Ank stared at the blue greatsword embedded in his side. It resembled some deep-sea predator.\n\n*N-No way!*\n\nHis head whipped around. The figure standing there made his blood freeze.\n\n\"Grid!\"\n\nWhy was he in the north when he should be in the west? Ank and the Yellow Guild members stood paralyzed. Grid wrenched the greatsword free.\n\n\"Cheeky bastards. How dare you cause trouble in my wife's territory?\"\n\n*Peok! Puk puk!*\n\nThe slaughter barely qualified as combat. Early 200s users crumpled like wheat before a scythe.\n\n\"G-Grid! It's been so long!\"\n\nDong Pao emerged from the corner, forcing a smile. The scammer shifted gears.\n\n\"Today I was moved by Goddess Rebecca's guidance! Meeting you here, of all places! Grid, I've been repenting since we first met, but these villains took me hostage! Forced me to cooperate! You've saved me, so let me repay this grace...\"\n\n\"Who are you?\"\n\nDong Pao blinked. \"Y-You don't remember me?\"\n\n\"No. My brain capacity isn't good enough.\"\n\n\"W-What are you...\"\n\n\"Shut up.\"\n\n*Peok! Bam bam bam!*\n\n\"Kuheook!\"\n\n***\n\nBy day's end, the Yellow Guild and Dong Pao had been stripped of their citizenship. They could no longer set foot anywhere in Steim territory. Two weeks imprisonment in Satisfy awaited them.\n\nTwo weeks felt like an eternity to a user. For Dong Pao especially, who'd now had his schemes ruined by Grid *twice*, the desire to quit the game gnawed at him.\n\n\"Security needs to be addressed immediately.\"\n\nGrid absorbed Phoenix's report on Winston's situation. He summoned Jude. Armed with Dainsleif and the best armor, Jude had grown formidable. His level surpassed Phoenix, whose development had stagnated with age.\n\n\"Train the soldiers here. Punish anyone who disturbs the peace without mercy.\"\n\n\"Yes.\"\n\nJude didn't think. He simply obeyed Grid's orders.\n\nWinston's soldiers would taste hell through Jude's brutal regimen. Deserters fled. Others fell to injury. But the few who endured emerged as elites.\n\nUnder Jude's iron fist, Winston's security stabilized rapidly."
}