{
  "id": 286,
  "title": "Chapter 286",
  "content": "# Chapter 286\n\nThe announcement of the merger between the Silver Knights Guild and Overgeared would plaster itself across newspapers in a dozen countries. But the ceremony itself was small. Not one reporter received an invitation. There was no benefit in broadcasting Overgeared's growth to potential rivals.\n\nNot yet.\n\n\"Puhahahat!\"\n\n\"Kukuku!\"\n\nA banquet followed the merger. The goal was simple: forge unity between Overgeared's veterans and the fresh recruits from Silver Knights. Laughter bounced off the stone walls. Ale flowed freely.\n\nA young knight stumbled toward Vantner, eyes bright. \"It's an honor to be your colleague! I've admired you for so long! You're the reason I became a strength-type guardian knight!\"\n\nVantner took a long drink, then wiped his mouth. \"Oh, you're completely screwed. Still level 180? Delete your character and start over. Otherwise, you'll be stuck with that garbage build forever.\"\n\nThe knight's face went blank. \"...\"\n\nAnother recruit approached Faker, wringing his hands. \"I heard about how you demolished the Ice Flower Guild. Alone. I trembled when I heard the story. How should I develop my stats and skills to become a great assassin like you?\"\n\nFaker said nothing.\n\n\"Hello? Are you listening?\" The recruit leaned closer. \"Why aren't you saying anything?\"\n\nFaker's expression remained flat. \"...\"\n\nA third voice cut through the noise. \"Regas! I heard you really love Taekwondo and South Korea! The South Koreans thank you!\" The speaker grinned wide. \"Have you tried kimchi? Do you even know what kimchi is?\"\n\nRegas stared at him. \"...\"\n\nGrid watched from his seat at the head table. *Both guilds are a bit unconventional.* He rubbed his temple. *This is going to take time.*\n\nHis gaze swept the hall, cataloging faces and names. Two hundred and twenty-five new colleagues. Future friends. Maybe family. He forced himself to memorize IDs, distinctive features, the shape of their jaws and the color of their hair.\n\n*Do you know kimchi...? That guy is just like Peak Sword. Korean Patriotic Association? And that one looks young but acts like a mute. I should keep an eye on him. Blacksmith instincts.*\n\nThe task was overwhelming. An hour in, Grid's skull throbbed. *Ouch. My head hurts.*\n\nIn the past, his brain would have shut down in five minutes. This was progress.\n\nJishuka, Lauel, and Peak Sword stood nearby, voices low.\n\n\"The average level of the Silver Knights Guild is 220,\" Lauel said. He tapped his fingers on the table. \"At that level, they'll get shredded by desert monsters. We need to boost their levels fast. Have the Overgeared members rotate in to help.\"\n\nJishuka shook her head. \"No. Improving the yellow mithril mine takes priority. Send the low-level members to Cork Island and Bairan to grind. The higher-leveled ones should focus on monsters near the mine.\"\n\n\"Won't the low-level members fall too far behind?\" Lauel asked.\n\n\"No. For lower levels, Bairan and Cork Island are far better hunting grounds than Reidan.\" Peak Sword crossed his arms. \"Besides, I hate power-leveling. What happens when people borrow strength to level up? They can't perform at their actual level. Skills don't match stats.\"\n\n\"You're right. I was being short-sighted.\"\n\nLauel nodded slowly. \"The key question is who we appoint to Bairan and Cork Island. A good lord will develop the territory *and* the guild members. It might be better for Peak Sword to remain lord of Cork Island. What do you think?\"\n\nPeak Sword grimaced. \"Can't. Grid told me to go mine.\"\n\n\"What?\"\n\nPeak Sword was a swordsman. Ranked 15th on the unified rankings. His combat ability matched Pon and Regas. He could compete with top rankers. And Grid wanted him to... mine?\n\n*What is Grid thinking? Is there something I don't know?*\n\nBefore Lauel could voice his confusion, a boy burst into the hall. Minor. The minerals detector. He sprinted toward Grid, boots slapping stone.\n\n\"Pant... pant...\" Minor gasped. \"Hey, Duke. You need to move. Now. The pavranium—\"\n\nGrid straightened. \"Why the rush? What happened?\"\n\n\"The pavranium sealed in the vampire cities is being corrupted. Some kind of strange energy.\"\n\nMinor was arrogant. He held zero loyalty to Grid. But he took his duties seriously. Today, he'd inspected the pavranium's condition.\n\n\"Strange energy?\" Grid's brow furrowed.\n\nA window materialized before his eyes.\n\n> **[A new quest has been created!]**\n> \n> **[Vampire City!]**\n> \n> **Difficulty:** ?\n> \n> *An incident has erupted in the vampire cities at the heart of chaos.*\n> \n> *An enormous power has spread its presence throughout the 15 vampire cities, blessing the vampires while corroding the pavranium.*\n> \n> *If you cannot secure the pavranium quickly, this presence will erode and alter it, destroying its extraordinary properties and reducing it to ordinary mineral.*\n> \n> *Head to the vampire cities immediately to secure the pavranium.*\n> \n> **Quest Conditions:**\n> * Every vampire city contains one piece of sealed pavranium.\n> * Obtain as much pavranium as possible within 90 days.\n> * Pavranium not secured within 90 days will be permanently destroyed.\n> * High probability of linked hidden quests.\n\n*The difficulty is a question mark.* Grid's stomach dropped. *A question mark.*\n\nIn Satisfy, that symbol referred to matters \"impossible to measure.\" Which meant this quest's difficulty likely exceeded SS-grade.\n\n*This is bad.*\n\nA chill crawled down his spine. He knew about the vampire cities thanks to Lauel's research. Clearing even one city required at least ten third-advancement classes working together.\n\n*The estimated clear time for one city is ten days.*\n\nThe dungeons were massive compared to normal instances. Monster levels were absurd. The conclusion was obvious.\n\n*I can't clear this alone.*\n\nAnger flared hot in his chest. Pavranium was the inherent weapon of Pagma's Descendant. Limited to exactly twenty-eight pieces. The possibility of losing fifteen made his blood boil.\n\n\"Dammit. Really.\" Grid slumped in his chair. \"Things were going too well.\"\n\nHe'd been reminded, yet again, that nothing in this world came free. Jishuka and Lauel exchanged glances after hearing his sigh.\n\n\"What is it?\" Jishuka moved closer. \"What kind of quest did you get?\"\n\n\"Can you share it?\" Lauel asked.\n\nGrid flicked the window open to them. Moments later, both frowned.\n\n\"This quest can't be cleared.\" Jishuka's voice was flat.\n\nPon and Regas had attempted a single vampire city. They'd invested a full month. Failed. Now Grid had to clear fifteen cities in ninety days. Solo.\n\nImpossible.\n\n\"But the quest *must* be cleared.\" Lauel's jaw tightened. \"Losing the pavranium weakens Grid directly. We can't allow it.\"\n\n\"Have the guild members help,\" Jishuka said.\n\n\"That would work. However, we're managing three territories now. The number of people who can support Grid is around ten.\"\n\nEuphemina wasn't at the ceremony. She was on a separate mission. Ruby and Sexy Schoolgirl hadn't even reached level 120 yet. They were out of the question.\n\n\"Ten members...\" Jishuka calculated aloud. \"Even if we can't get all fifteen, we can secure at least nine pieces of pavranium.\"\n\n\"Yes. It's possible.\"\n\nGrid's expression soured as he watched them discuss the matter. \"Stop.\" He raised a hand. \"I don't want to drag the guild members into my personal quest.\"\n\nIt was the right mindset. A guild master exploiting members for individual quests was toxic behavior. Lauel smiled at him and shook his head. \"The vampire cities offer massive experience. There's also a low probability of obtaining elixirs. The guild members will develop by helping you.\"\n\n\"But—\"\n\nA cluster of Overgeared members gathered around Grid. Voices overlapped.\n\n\"I haven't hunted in ages.\"\n\n\"Let's gain some levels.\"\n\nThe Overgeared members sought strength. Top rankings. They wouldn't pass up an opportunity to grind at the best hunting grounds. Vantner practically vibrated with energy.\n\n\"I need stamina elixirs.\" He slammed a fist on the table. \"Take me with you.\"\n\nGrid blinked. \"...\"\n\nWhatever their reasons, they wanted to help. It was different from the days when Grid had no one to rely on. Warmth spread through his chest. His eyes stung.\n\nA wide smile broke across his face. \"Thank you.\" He nodded. \"Next time you come to Korea, I'll buy you kanjajang.\"\n\nThe golem invasion of Reinhardt. Grid had skipped the king's banquet because he'd wanted to eat kanjajang. Through that single remark, he'd convinced the Overgeared members of its value.\n\n*Kanjajang...* One member's eyes went wide. *It must be incredibly precious food.*\n\n*Is it royal Korean cuisine?* Another wondered.\n\nHow expensive could it be? As the Overgeared members lost themselves in this foolish delusion, Peak Sword watched quietly. He sighed.\n\n\"I prefer jjampong.\"\n\nNow that they were colleagues, Peak Sword figured he'd help Grid anyway.\n\n***\n\nThe expedition was organized.\n\nGrid, Jishuka, Pon, Regas, Peak Sword, and Faker formed the damage-dealing core. Vantner tanked. Huroi provided buffs. Zednos handled rear support. Ninety days to clear fifteen dungeons. The composition mattered.\n\nThe formation was designed to pierce through mobs quickly, reaching bosses with minimal delay. Lauel couldn't join. As temporary lord, his presence in Reidan was non-negotiable. Before the expedition departed, Lauel issued a final warning.\n\n\"As you all know, cooperation balance is critical. There's a high probability of surprise attacks. Always watch your surroundings.\"\n\n\"I get it, I get it.\" Vantner waved a hand. \"Are you our mother? How many times do you need to repeat yourself?\"\n\nLauel ignored him. \"Consider this. Once you enter a city, the entrance seals. Communication cuts off. There's a ninety-nine percent chance that summoning your knights won't work. Don't get into a desperate situation.\"\n\nHe wouldn't feel so anxious if Piaro and Asmophel were joining this expedition. But unlike users, NPCs had only one life. They couldn't be risked on a quest like this. Grid clapped Lauel on the shoulder and grinned.\n\n\"I'm going.\"\n\nGrid made a silent pledge. He would complete <span class=\"rarity-legendary\">Lifael's Spear</span> through this expedition.\n\n*If I reclaim all fifteen pieces of pavranium, I can forge a Lifael's Spear composed purely of pavranium.*\n\nA weapon that could easily surpass <span class=\"rarity-legendary\">Failure</span>. His heart pounded at the thought. A weapon that flew independently, striking enemies on its own while he fought.\n\n\"Let's move out.\" Grid turned toward the exit.\n\nThe strongest party in Satisfy's history, led by Grid, embarked on their journey. \n\nA figure followed in their wake."
}