{
  "id": 287,
  "title": "Chapter 287",
  "content": "# Chapter 287\n\nA shadow trailed Grid's party through the desert. Long-armed and thick-lipped, his skin was dark as volcanic glass. His name was Kasim—last descendant of the Nero people crushed beneath the Saharan Empire's heel, bearer of the title 'King of Shadows.'\n\nKasim exhaled softly. He'd been watching Grid since before the dukedom, always maintaining a precise five-meter distance. Lately, the young assassin called Faker had forced him to extend that margin to seven meters, but the adjustment barely registered. The gap between their skills remained vast.\n\n*Vampire city.* He'd identified Grid's destination.\n\nVampires. Demonkin who made their lairs in the human world rather than hell itself. Their strength was overwhelming—natural, since they'd been designed to hunt humans. Walking into their territory was suicide.\n\n*Duke Grid can handle a viscount. But an earl?* Kasim's jaw tightened. *They'd be slaughtered.*\n\nShould he intervene? No. Kasim had observed enough to understand the truth. Grid and his companions were immortal, cursed beings who returned from death. The cost of failure wouldn't break them.\n\n*Sometimes defeat teaches what victory cannot.*\n\nHis thoughts drifted to Doran. Thousands of spars between them, and a loss in one match never guaranteed the outcome of the next.\n\n\"I miss you.\" The words escaped before he could catch them.\n\nDoran. A friend raised under the same blade, the same teacher. How had Grid come to possess the ring Doran inherited from their mentor? Kasim had followed to answer that question. The truth came quickly—Grid had married Irene.\n\nYet he remained because Grid carried something rarer than skill. Possibility. The potential to grow strong enough to challenge the Saharan Empire itself. That empire, which had persecuted innocent minorities and annihilated those who refused to kneel.\n\nKasim's grudge against the empire ran bone-deep. One day, Grid would tear it down. Kasim would witness that reckoning.\n\nThe assassin vanished like smoke dissolving in wind. Until Grid returned, he would guard Irene. Nothing could be allowed to shackle Grid's growth. Kasim would protect what Grid cherished.\n\nPiaro tended the fields. Asmophel drilled the soldiers. Kasim moved unseen through the city's shadows. Reidan had become a fortress that would stand against anything short of a dragon or great demon—far safer than when Kraugel had passed through.\n\nAdministrator Rabbit could develop the city without fear.\n\n*In a few months, we'll finally escape the deficit.* Rabbit's quill scratched across ledgers. *Time to raise labor costs. Increase worker efficiency. Point-one percent should suffice.*\n\nGrid remained unaware of the capable people gathering around him. All of it—the loyalty, the dedication—had grown from his own transformation. He had every right to pride.\n\n***\n\n> [The giant worm has been destroyed.]\n\n> [2,330,900 experience has been acquired.]\n\n> [The desert toad has been destroyed.]\n\n> [2,607,400 experience has been acquired.]\n\n*Incredible.*\n\nPeak Sword marveled as Grid's party cut through desert creatures on their approach to the vampire cities.\n\n*These monsters give absurd experience. Can't process it.*\n\nThe desert fauna yielded at least twenty percent more experience than Cork Dungeon's top floor. Yet they died faster. Ridiculous. This was why the Overgeared members had monopolized the top rankings after Grid became Reidan's lord.\n\n*The vampires will give even more. Might hit three-oh-seven during this expedition.* Peak Sword's ambitions crystallized. *Top ten isn't a dream anymore.*\n\nMeanwhile, Grid's internal monologue ran in the opposite direction.\n\n*The experience is pathetic.*\n\nMost users leveled through hunting or quests. Grid leveled through raids—massacring high-value targets. His standards had warped accordingly.\n\nThe knights and elders of the Rebecca Church had given tens of millions. Pascal? Seven hundred million. Compared to that, two million from desert monsters was insulting.\n\n*When will I reach three hundred?*\n\nPagma's Descendant lacked traditional class advancements. But at level 300, his stats would undergo their third awakening like any other user. Grid's stats were already abnormally high. The awakening would transform him into something monstrous.\n\nHe dreamed of that day. Currently stuck at 296, experience bar not even half-full. Grid sighed, then remembered the Reputation Store. He'd broken thirty thousand reputation after obtaining the 'Sealed Ability' hidden piece, unlocking access.\n\nHe'd browsed it recently.\n\n*There's a potion that buffs experience gain.* His pulse quickened. *If I take it inside a vampire city? I'll level.*\n\nGrid opened the interface.\n\n\"Reputation Store!\"\n\n> [This is a special service for the best in Satisfy!]\n\nA golden carriage materialized in his vision—invisible to his companions. It resembled those supply vehicles that visited forward bases with no proper exchange.\n\nGrid was convinced the system designer had served in the military.\n\n> [Introducing the luxurious goods to our guest!]\n\n> [<span class=\"rarity-epic\">Sweet Candy</span>]\n> \n> *A little candy bar!*\n> \n> *A candy with natural sweetness is the best!*\n> \n> *There are no chemicals added!*\n> \n> **Effects:** When the sweet candy is in your mouth, all stats will rise by 30% for 5 minutes.\n> \n> * This item can only be purchased five times per account.\n> \n> **Price:** 20,000 reputation.\n\nLimited-edition products with premium performance filled the upper listings. Then came the useless junk.\n\n> [Good-looking Sunglasses]\n> \n> *The large frame is the highlight of the square sunglasses!*\n> \n> *It is big enough to cover half the face, so it will help someone ugly look handsome!*\n> \n> **Effect:** Look handsome.\n> \n> * The charm stat isn't created or increased. It is a simple accessory with no special function other than a visual effect.\n> \n> **Price:** 5,000 reputation.\n\nAround thirty products cycled through the golden carriage display, with event-limited items occasionally rotating in. Grid needed only one.\n\n*Where's the experience potion? Ah, there.*\n\nHis gaze locked onto a specific product.\n\n> [<span class=\"rarity-rare\">Draw! Draw! Draw everything!</span>]\n> \n> *A random drawing machine.*\n> \n> *At the price of 999 reputation, you can get a variety of items randomly.*\n> \n> * Limited edition items aren't included.\n> \n> * There is a certain chance of gaining an experience buff potion.\n> \n> **Price:** 999 reputation.\n\n*Perfect!*\n\nSatisfy lacked a maximum level. Experience buff potions would exponentially widen the gap between users. Standard MMOs were flooded with experience boosts—but not Satisfy.\n\nThe Reputation Store was different. Only a handful of users could accumulate such achievements. The store needed to tempt them. That temptation came in the form of experience buff potions.\n\nGrid approached the machine instantly.\n\n*The cost is cheap. Why nine-ninety-nine instead of a thousand?*\n\nStores priced items at 29,990 won instead of 30,000. Basic marketing psychology to make people think they were getting a deal.\n\n*An opportunity to get a buff potion cheap!*\n\nNine hundred ninety-nine reputation. Considering he earned 150 for crafting a unique item and 500 for a legendary, it wasn't trivial. Still, Grid judged the gamble worthwhile. He spent the reputation.\n\n> [Draw! Draw! You have drawn a product.]\n\nThe machine's contents whirled in a blur of color. Then—\n\n*Clack!*\n\nAn item dropped into the collection slot.\n\n> [Congratulations! <span class=\"rarity-uncommon\">Pretty Hairpin</span> has been acquired!]\n\n> [Pretty Hairpin]\n> \n> *A colorful and pretty hairpin.*\n> \n> *If you gift it to a woman, she will be delighted.*\n> \n> **Weight:** 0.1\n\n\"What?\"\n\nHis brain had short-circuited at the thought of guaranteed experience buffs. Grid had temporarily forgotten how these games actually worked.\n\n\"Dammit!\"\n\nThe blue hairpin glittered in his palm—genuinely pretty. It would complement Irene's silver hair beautifully. But it wasn't worth nine hundred ninety-nine reputation. Grid's arm cocked back to hurl the thing into the sand, but he hesitated. His hand lowered. The hairpin vanished into his inventory.\n\nA gift for Irene.\n\nPicturing her smile dulled his anger.\n\n\"Right. Things never work the first time.\"\n\nSecond attempt. Grid bought another spin.\n\n> [Congratulations! You have acquired the <span class=\"rarity-rare\">world's most delicious skewer</span>.]\n\n> [World's Most Delicious Skewer]\n> \n> *It is a skewer of a hell dog's hind legs aged for 100 days, then roasted with a secret sauce.*\n> \n> *It is the supreme taste that gourmet raiders enjoy.*\n\n\"It's just dog meat!\"\n\n> [This! You have failed! Unfortunately, please look for the next opportunity.]\n\n\"There's a failure option?!\"\n\nBefore virtual reality, Grid had never touched the mobile games that dominated the market. He'd stuck to PC MMORPGs. The horror of gacha mechanics was alien to him. Confusion warred with outrage.\n\n\"Bullshit! Complete bullshit!\"\n\nGrid's rage found innocent targets. On the march to the vampire city, he slaughtered more monsters than the rest of his party combined. Even Pon and Regas exchanged surprised glances.\n\n\"Grid's really fired up today.\"\n\nPon nodded. \"He's in a leadership position now. Feels the responsibility.\"\n\n\"The guild merger matured him even more.\" Regas grinned. \"Truly admirable.\"\n\nBias was a terrifying force. Drowning in misunderstandings, Grid's party finally reached the vampire city."
}