{
  "id": 288,
  "title": "Chapter 288",
  "content": "# Chapter 288\n\n## The 13th Vampire City\n\nPon and Regas had already scouted the area. They shared what they'd learned before the group entered.\n\nPon gestured toward the entrance. \"Once we're inside, there's a twelve-meter drop. The climb down isn't dangerous, but the darkness makes it steep. Anyone with less than 400 Agility should take it slow.\"\n\n\"You won't see anything for about two minutes,\" Regas added. \"Even after that, your vision stays impaired. The darkness limits mobility. We won't fight at full strength down there.\" He glanced at Jishuka and Faker. \"Jishuka and Faker have Hawk Eyes and Assassin's Eyes, so they'll adapt faster.\"\n\nVantner frowned. \"Why not just light torches? Are we cavemen or something?\"\n\n\"Vampires are drawn to fire,\" Pon said. \"Light a torch and you'll get swarmed.\"\n\n\"Oh. Right.\" Vantner scratched his head. \"I knew that.\"\n\n\"Stupid,\" someone muttered.\n\nPon continued. \"Below the cliff, there's a city about half the size of Bairan. Vampire familiars patrol the streets. Their average level is lower than the giant worms, but don't underestimate them. Combat capability depends on the monster type.\"\n\n\"Familiars? Where are the actual vampires?\"\n\n\"Sleeping in the buildings. They wake up when we enter. Sometimes they ambush us outside.\"\n\n\"So the boss is in one of the buildings?\"\n\n\"Most likely. We'll have to search them one by one.\"\n\nRegas nodded. \"Watch out for True Blood vampires. They're way stronger than the regular ones.\"\n\n\"How strong?\"\n\n\"Strong enough that even Regas and I struggled to kill them together.\"\n\n\"Field boss level?\"\n\n\"No, not quite that bad. The problem is they resist everything except divine power. If we focus fire, we can take them down.\"\n\nThe party had six heavy hitters: Jishuka, Grid, Pon, Regas, Faker, and Peak Sword. Pon believed they could handle True Blood vampires with concentrated damage.\n\nGrid summarized. \"So we watch for the cliff in the darkness, avoid creating light, and burn down True Blood vampires fast. That's it?\"\n\n\"Yes.\"\n\nGrid checked the party status one final time.\n\n---\n\n**Party Name:** Pavranium Expedition  \n**Party Leader:** Grid (Pagma's Descendant, Level 296)\n\n**Party Members:**  \nPon (Spear Knight, Level 307)  \nRegas (Asura, Level 307)  \nPeak Sword (Hidden Sword, Level 306)  \nFaker (Master of Swiftness, Level 305)  \nJishuka (Red Flame Archer, Level 305)  \nVantner (Impregnable Fortress, Level 302)  \nZednos (Storm Magician, Level 301)  \nHuroi (Orator, Level 292)\n\n**Item Distribution Method:** Party Leader Acquisition\n\n---\n\nEveryone's Health, Mana, and Stamina sat at full. The loot settings were correct.\n\n\"Let's move.\" Grid entered the dungeon without delay.\n\n> [You have entered the Vampire's Underground City (13).]\n>\n> [The entrance is sealed. Contact with the outside world is blocked.]\n>\n> [You cannot escape until the dungeon boss is dead or you die.]\n\n*It's dark.*\n\nThe thought hit him immediately. An oppressive darkness consumed everything. Grid was glad Pon and Regas had warned them. Otherwise, the disorientation would've been worse.\n\nThe party shuffled forward, eyes adjusting.\n\n*Crack. Crunch.*\n\n\"What the hell?\"\n\nWings beat the air. Hundreds of tiny red eyes ignited in the blackness. A swarm of bats descended.\n\n\"Are you kidding me?!\" Vantner snarled, hefting his shield. \"You said nothing attacks until we're down the cliff!\"\n\nBad intel could kill you on a battlefield. Everyone understood Vantner's anger.\n\n*Clang! Clang-clang-clang!*\n\nHe raised his shield.\n\n<span class=\"rarity-rare\">Grid's Shield: Prototype A</span>. A black iron shield modeled after the Divine Shield. It boasted high defense and magic resistance. The drawback was weight, but Vantner's absurd **Strength** stat made it manageable.\n\nHundreds of bats slammed into the massive black barrier. Blood sprayed.\n\n*Crunch!*\n\nTiny skulls shattered in rapid succession.\n\n\"Ugh!\" Vantner grunted. He blocked the frontal assault, but bats flanked him, fangs sinking into exposed flesh.\n\n\"Dammit! Didn't want to burn a skill this early!\" He activated his buff. \"Guard of Steel!\"\n\n> [For three minutes, **Physical Defense** increases by **30%**. Resistance to stabbing and cutting increases by **50%**.]\n\n*Tink! Tink!*\n\nVantner's body hardened. The bats' needle-like teeth failed to pierce his skin.\n\nJishuka and Faker were the first to adapt to the darkness. They moved to support him.\n\n\"Dancing Arrows.\"\n\n*Thwip-thwip-thwip-thwip!*\n\nThe skill worked in tandem with Multi-shot. Dozens of arrows launched simultaneously, spinning through the air. They pierced bats and curved mid-flight, seeking new targets. The swarm fell, plummeting into the chasm.\n\nFaker's response was equally devastating. He hurled twenty daggers enhanced with Explosion Runes. The blasts incinerated clusters of bats.\n\nBy the time the rest of the party gained their vision, the threat was eliminated.\n\nVantner collapsed, wheezing. \"Hah... hah... almost died the second we walked in.\"\n\n\"Sorry.\" Pon's expression was genuinely apologetic. \"The pattern must've changed since last time.\"\n\nDungeon monsters usually had fixed spawn points and behavior patterns. They'd assumed this place would be the same.\n\nVantner couldn't stay mad after seeing Pon's sincerity. \"Whatever. Let's keep moving.\"\n\nGrid's group waited for Vantner to recover. As the party's only tank, his condition was critical.\n\n\"Take your time,\" Grid said.\n\n\"Yeah.\"\n\nOnce Vantner's Health was topped off, they began the descent. Most of the party struggled with the steep, uneven rock face.\n\nGrid and Zednos relaxed. They could both use Fly magic. They descended smoothly, landing first at the bottom.\n\n*Thud.*\n\nGrid scanned the area. *Better check for ambushes while everyone's climbing down.*\n\nFive massive wolves charged from the gloom.\n\n\"They're huge,\" Zednos muttered.\n\nEach wolf was the size of a bear. But neither Grid nor Zednos felt fear.\n\n> [<span class=\"rarity-legendary\">+9 Failure</span> has been equipped.]\n>\n> [The **Attack Power** of **+9 Failure** increases by **20%** in dark places.]\n>\n> [<span class=\"rarity-epic\">+8 Grid's Boots</span> has been equipped.]\n>\n> [The **Defense** of **+8 Grid's Boots** increases by **20%** in dark places.]\n\nGrid trusted his gear.\n\n*Grid is with me!* Zednos thought.\n\nThe wolves realized their mistake too late.\n\n*Yelp! Yip!*\n\n> [You have defeated a Vampire Wolf.]\n>\n> [490,800 experience has been distributed.]\n>\n> [You have defeated a Vampire Wolf.]\n>\n> [487,210 experience has been distributed.]\n>\n> [<span class=\"rarity-uncommon\">Vampire Wolf Leather</span> has been acquired.]\n\nGrid examined the drop.\n\n**<span class=\"rarity-uncommon\">Vampire Wolf Leather</span>**  \n*Very sturdy leather. If tanned properly, it can be used to craft armor.*  \nWeight: 15\n\nThe experience was solid for a nine-person split. The vampire cities were excellent for leveling.\n\n*The Silver Knights Guild has three tailors, right?*\n\nGrid could craft leather armor, but his experiments showed the results were inferior compared to his work with metals. It was more efficient to focus on what he did best.\n\n\"We should distribute materials to guild members and commission crafts,\" Grid said once everyone reached the bottom. \"We'll sell the finished products and funnel the profits back into the guild. The crafters get a separate reward.\"\n\nGrid rarely planned this far ahead. Actually, it was the first time. His companions nodded, impressed by his growth.\n\nPon and Regas exchanged glances, silent for a moment. Then their expressions shifted to concern.\n\n\"Something's off.\" Pon looked around. \"The atmosphere is different from before.\"\n\n\"The bats and vampire wolves weren't here last time,\" Regas added. \"The familiars have a wider patrol radius. The experience is up ten percent, too.\"\n\nPon turned to Grid. \"You said strange energy is radiating from these cities, right?\"\n\n\"Yeah.\"\n\n\"That's the problem. The energy must've increased the difficulty.\"\n\n*Gulp.* Peak Sword tensed. *Is this expedition going to fail?*\n\nThe rest of the Overgeared members had a different reaction.\n\n\"Higher difficulty means better rewards!\"\n\n\"Hell yeah! Faster leveling!\"\n\n\"...\"\n\nPeak Sword couldn't comprehend the Overgeared mindset. He stood there, dumbfounded, then let himself get swept along.\n\nThe group cut through the streets, killing familiars and collecting loot. Soon, they stood before a gothic high-rise.\n\n\"There are about ten of these buildings, right?\" Grid asked.\n\nThey needed to search quickly and thoroughly to find the boss and secure the pavranium. Grid reached for the massive door.\n\n> [The Master of the 13th City, <span class=\"rarity-unique\">Vampire Earl Elfin Stone</span>, has appeared.]\n>\n> [A powerful evil influence corrupts your magic power. All spells and skills are disabled.]\n>\n> [A vampire's gaze subdues lower species. Your body is subjected to intense oppression.]\n\nThe notification windows hit the entire party at once.\n\n*Whoosh.*\n\nBlack smoke coalesced above Grid's head. A blond man emerged, impossibly beautiful. His features rivaled the finest jewelry.\n\n\"Humans *dare* invade my city?! Polluting the air with your stench!\"\n\nElfin Stone had a grudge. About a month ago, he'd woken from a long sleep to find his city in ruins. His subordinates said two insane humans were responsible. *Two* humans had invaded a vampire city?\n\nAbsurd. Insulting. The furious Elfin Stone hadn't slept well in two months. Even today, he'd only managed eighteen hours before going for a walk. And now he'd discovered more humans. Perfect. Time to vent his rage.\n\n\"Die so I can finally get some rest!\"\n\nElfin Stone unleashed his strongest skill on the human who seemed to be their leader.\n\n> [**Extreme Blood Transfusion**]\n\nA devastating ability that drained massive Health from the target and converted it into his own. The downside was a once-per-day limit, but it was perfect for terrifying these pathetic insects.\n\n*Splatter!*\n\nA curtain of blood engulfed the male human. He was dead. No question.\n\n\"Kukuku. I'll return soon.\" Elfin Stone's smile was cruel. \"I'll kill one of you. Then another. Again and again. You'll taste the purest form of terror!\"\n\n*Whoosh.*\n\nElfin Stone transformed into smoke and vanished.\n\nThe blood curtain lifted.\n\nGrid stood there. Alive.\n\n\"What the hell?\"\n\nHis legendary passive had triggered. The one with a twenty-four-hour cooldown. Gone. But he'd survived.\n\nBoth Grid and Elfin Stone stared, equally stunned.\n\n---\n\n**Glossary of Common Korean Terms:**  \nOG: Glossary Link\n\n**Current Schedule:** 20 chapters a week\n\n*Check out my Patreon for early access to unedited chapters and support goals for extra releases. Early access chapters update after daily releases are complete.*"
}