{
  "id": 289,
  "title": "Chapter 289",
  "content": "# Chapter 289\n\n\"Humans dare trespass in my city! You pollute the very air!\"\n\nThe Overgeared members froze. A blond man materialized from the shadows, and with his arrival came a cascade of notification windows.\n\n> [For the next five minutes, you cannot use 'Wind Curtain,' 'Black Mace,' and 'Storm of Eternity.']\n\n> [For the next five minutes, you cannot use 'Shield Throw,' 'Damage Break,' and 'Guardian's Power.']\n\n> [For the next five minutes, you cannot use 'Multi-shot' and 'Red Flame Arrows.']\n\nThe messages scrolled endlessly. Every Overgeared member except Grid watched two or three of their core skills vanish from their hotbars. Those whose main abilities were sealed paled.\n\nThen came the final message.\n\n> [All speed will decrease by 30% for the next five minutes.]\n\n*Shit.* The word echoed through Grid's mind as his limbs turned sluggish. Attack speed, movement speed, everything cut by a third. Five minutes might as well be an eternity in combat.\n\n\"Grid! Move!\"\n\nFaker's shout came too late. The vampire earl, Elfin Stone, master of the thirteenth city, was already upon him.\n\n*Puhahahak!*\n\nA curtain of blood erupted from the stone floor, swallowing Grid whole. Elfin Stone's laughter rang through the chamber. \"Kukukuk. I will return soon. Another will die. Then another after that. Again and again, until you know true terror.\"\n\n*Suruk.*\n\nThe vampire dissolved into darkness like smoke dispersing. None of the Overgeared members gave chase. They couldn't. Elfin Stone's presence alone had crushed the fight out of them.\n\nSilence hung heavy in the air. The blood curtain dissipated, revealing Grid standing motionless, his face twisted in a grimace.\n\n\"What the hell was that?\"\n\nGrid's health bar showed a single point. His armor, everything except the <span class=\"rarity-legendary\">Holy Light Armor</span>, hung in tatters. Blood soaked his clothes and pooled beneath his boots.\n\n\"Grid! Are you okay?\"\n\nThe members rushed forward. Jishuka reached him first, her bronze skin drained of color. *Her expression tells me everything.* Grid noted the raw fear in her eyes, the way her hands trembled as she reached toward him.\n\n\"As you can see, I'm not.\"\n\nGrid uncorked a potion and tilted his head back. The liquid burned down his throat. *Shit.* He wanted to cry. The <span class=\"rarity-rare\">Super Health Recovery Potion</span> cost ten gold. Three bottles equaled two chickens in reality. His carefully hoarded fortune, draining away with every gulp.\n\nPeak Sword exhaled hard. \"That was a miracle. You survived with one health point. I can barely believe what I just saw.\"\n\nPeak Sword didn't know about the passive. Grid decided he needed to. If they were going to work together, truly work together, then transparency mattered.\n\nGrid wiped blood from his mouth. \"I have a passive skill. When I take fatal damage, my health fixes at one point and I become immune to damage for five seconds. The cooldown is twenty-four hours.\"\n\n\"Wow.\" Peak Sword's eyes widened with undisguised envy. A second life, effectively. No wonder legendary classes were considered broken.\n\nGrid forced a grin despite the pain radiating through his body. \"Remember this. In the worst situations, I stand in front.\"\n\nHe said it with confidence, as if he'd deliberately baited Elfin Stone's attack. *Better they think I'm in control.*\n\n\"Regas, did Elfin Stone never appear during your month here?\"\n\n\"First time I've seen him.\"\n\n\"Same. We never encountered him in all our explorations.\"\n\n\"Then you were lucky.\"\n\nThe mood soured. Elfin Stone's strength existed on a different plane from anything they could handle.\n\nRegas crossed his arms. \"Grid has the highest health pool, and even his invincible passive triggered. That means we can't let Elfin Stone finish his skill cast. But the activation is fast, and we can't predict when he'll appear.\"\n\n\"We'll die one by one,\" Vantner muttered.\n\n\"Should we go all-out offense? Strike before he picks us off?\"\n\n\"Result is the same. Total wipe. Especially if our main skills get sealed.\"\n\nFive minutes stretched like an eternity when fighting a superior enemy. Having core abilities locked away for that duration meant certain death.\n\n\"So what do we do?\"\n\n\"There is no answer.\"\n\nDespair settled over the group like a burial shroud. Grid listened, then spoke quietly. \"It wouldn't be desperate if I had more time.\"\n\nTime to level. *If I could just reach level 300...*\n\nElfin Stone was strong. Hell Gao tier, back when Grid had faced him with all the fire stones fueling his flames. The skill deletion ability made Elfin Stone arguably worse. Grid's insight painted the scenario clearly. But if he hit level 300 and unlocked the third stats awakening...\n\n*I could read his approach. Counter with Revolve.* A fatal blow before the five-minute debuff expired. *Then we'd have a real chance.*\n\nBut Grid sat at level 296. The experience from this dungeon would push him to 297, maybe 298 with enough grinding. Level 300 needed days, maybe a week. Only possible if he consumed an experience potion and cleared every vampire in the city.\n\n\"Dammit.\"\n\nElfin Stone had promised to return. Five minutes? Ten? Grid had no time. The conclusion crystallized in his mind.\n\n*This expedition fails here.*\n\nHis expression darkened. Fifteen vampire cities to clear. Stuck on the first. Frustrating didn't begin to cover it.\n\n\"Dammit! The quest difficulty is absurd!\" Grid's shout echoed off the stone walls. Fifteen <span class=\"rarity-mythic\">pavranium</span> pieces, slipping through his fingers. The Overgeared members wore identical expressions of defeat. They'd reached the same conclusion. Failure loomed inevitable.\n\nBut Jishuka stepped forward.\n\nShe'd been a top player in L.T.S. before Satisfy launched. Her analytical mind worked through the problem, searching for angles others missed.\n\n\"Elfin Stone's reappearance timer might be longer than we think. A skill that powerful must have a lengthy cooldown.\"\n\nMonster patterns typically followed skill cooldowns. Like the Fusers on Skeleton Island, appearing every seven minutes to spray acid before fleeing.\n\n\"If the period before his return is long enough, we have hope. We level Grid to 300.\"\n\n\"How?\"\n\n\"We feed him experience. Run interference and funnel everything to Grid. Based on the XP these vampires give, he can hit 300 in a week, maybe less.\"\n\n\"Once Grid reaches 300, our chances against Elfin Stone improve dramatically. But what about his periodic attacks?\"\n\nJishuka's jaw set. \"We endure his skill as long as possible. The first few encounters, we'll take casualties. No avoiding it. But eventually, we'll find a pattern. A way to handle it.\"\n\nNo better plan existed. The members voiced their agreement to the Grid-building project. Shame twisted in Grid's chest.\n\n\"I'm sorry. Putting you at risk for my personal quest.\"\n\n\"Don't apologize. Work hard.\" Jishuka met his eyes. \"Reach level 300.\"\n\nHe would. Grid nodded and opened the Reputation Store interface.\n\n*I need to save them. Even one person.*\n\nReaching level 300 required speed. Speed required the experience potion.\n\n*This time I'll draw it.*\n\nGrid stood before the 'Draw! Draw! Draw Everything!' machine. His reputation: **28,013**. Each pull cost **999 reputation**. Twenty-eight attempts total.\n\n*One in twenty-eight. That's reasonable odds. Strange if I don't get it.*\n\n*Rattle.*\n\nGrid pulled the lever.\n\n> [This! You have failed! Unfortunately, please look for the next opportunity.]\n\n> [This! You have failed! Unfortunately, please look for the next opportunity.]\n\n\"Are you kidding me?!\"\n\nTwo failures immediately. Grid's heart plummeted. If he could turn back time, return to before this cursed machine... But his reputation evaporated for nothing, and reality remained cold. The temptation of the gacha system, that ancient predator that had devoured countless gamers' wallets and bloated game companies' coffers, now sank its teeth into Grid.\n\n\"Damn it! Fine! Let's go!\"\n\nGrid cursed and pulled the lever again.\n\n> [Congratulations! The best chocolate has been acquired.]\n\n> [This! You have failed! Unfortunately, please look for the next opportunity.]\n\n> [Congratulations! Block Toys to Help a Child's Development has been acquired.]\n\n> [This! You have failed! Unfortunately, please look for the next opportunity.]\n\n> [This! You have failed! Unfortunately, please look for the next opportunity.]\n\nWhy did the odds feel worse with every pull? Grid's hands shook as his reputation dropped below **10,000**. His vision blurred at the edges.\n\n*Forget the experience potion. Why isn't anything useful dropping?*\n\nHis head pounded. Dizziness washed over him. He wanted to stop, but his hand kept turning the lever. Just one more. Just get his money's worth. His remaining reputation plummeted to **6,000**.\n\n> [Congratulations! An Experience Increase Potion has been acquired.]\n\n**[Experience Increase Potion]**  \nIncreases experience gained by 20% for the next three days.  \nWeight: 0.1\n\n\"Finally...\"\n\nJoy and despair warred in Grid's chest. Happy, yes, but why did victory taste so bitter? Most of his yearly reputation earnings, gone. Evaporated into garbage prizes and failure messages.\n\nGrid exhaled slowly. \"At least it appeared.\"\n\nHe reached into his inventory and withdrew <span class=\"rarity-unique\">Malacus' Cloak</span>. The garment that attracted monsters with its scent of dried blood, unused for months. Grid held it out to Vantner.\n\n\"Put it on.\"\n\n\"Uh...\"\n\nVantner's face fell. He'd been discussing strategies to accelerate Grid's leveling with the others. Now he understood his role. His vision went dark.\n\n---\n\n**Glossary of Common Korean Terms:**  \nOG: Glossary Link  \n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}