{
  "id": 29,
  "title": "Chapter 29",
  "content": "# Chapter 29\n\nThe item production game with the Mero Company. An A-rank difficulty quest. High difficulty. Common sense said a level 21 user had no business attempting something like this.\n\nGrid stared at the quest notification in his vision.\n\n*Am I really going to fail?*\n\nThe doubt crept in, but he shoved it aside. He'd accepted this quest for a reason. If it involved combat or adventuring, he'd have run the other way. No amount of legendary class power could save him from getting his skull caved in at his current level.\n\nBut this? This was different.\n\nThe Mero Company wanted a crafting contest. Win by making a better item than their hired blacksmith. Simple.\n\nGrid's lips curled into a grin. \"I'm the legendary blacksmith who produced an epic arrow. Even if they hire an advanced level blacksmith, I can win this.\"\n\nMoonlight filtered through the smithy window, casting his shadow long across the floor. He spread his arms wide. \"This isn't a quest. It's an event!\"\n\nThe warehouse door creaked open.\n\nKhan shuffled in, arms loaded with tools, and froze mid-step. His weathered face twisted with concern.\n\n\"Did you eat something bad at dinner?\" Khan set the tools down with a clatter and hurried forward. \"You look sick. Are you okay? Do you need medicine? No, I'll bring you to the doctor right now.\"\n\nGrid's dramatic pose deflated. \"Where do I look sick?\"\n\n*This old man has no sense of aesthetics. Tsk. A blacksmith is supposed to be an artist.*\n\nKhan's work clearly reflected that lack. The pieces Grid had seen were inferior in both appearance and performance.\n\nKhan pulled out a beautiful sword and helmet from his pack, holding them up to the light. \"These are pieces I made. What do you think? Pretty good, right? I was famous for making beautiful pieces during my prime. My aesthetic sense has always been admired by artists.\"\n\nHe laughed, clearly pleased with himself.\n\n*...Is this old man reading my mind?*\n\nGrid examined the items. They were, admittedly, well-crafted.\n\nKhan laid out various production tools on the workbench. \"As you can see, the tools are properly stocked. Various metals, ores, logs of wood, all piled up in the warehouses. Lots of materials, but I haven't done any business in the past months...\"\n\nHis smile turned bitter.\n\nGrid couldn't help himself. \"The Mero Company tried to put you into debt. They hired gangsters to interfere in your sales, threatened you, assaulted you. Why didn't you ask the lord or the guards for help? Why stay quiet?\"\n\nKhan's shoulders sagged. He pulled up a stool and sat heavily.\n\n\"I filed complaints with the guard captain several times. Appealed to the lord. I wanted the guards to protect me, for the lord to stop this injustice.\" He shook his head. \"They didn't even look at me. My requests were ignored.\"\n\n\"Let me guess. The Mero Company's work?\"\n\n\"Right. The Mero Company is one of the largest and richest companies in the north. The lord and guards have already received bribes. It isn't just me. Many Winston residents were hurt by the Mero Company and thrown onto the streets, but the lord didn't lift a finger to help them.\"\n\nGrid clenched his fist. *Money really is the best. I need to get rich. I will get rich.*\n\n\"Wait.\" Grid frowned. \"Doesn't Winston belong to Earl Steim?\"\n\n\"That's right.\"\n\n\"Why don't you and the residents go to Earl Steim directly? He'd punish the lord. Unless...\" Grid's eyes narrowed. \"Does the Mero Company have their hooks in the Earl too?\"\n\nKhan shook his head quickly. \"It doesn't seem like it. We've tried many times to meet Earl Steim. But the lord noticed and prevented us from leaving Winston every time. Even if we raise an appeal, it won't be passed on to the Earl.\" He leaned forward. \"The lord wouldn't go so far to stop us if the Earl was on his side.\"\n\n\"No one's monitoring this place?\"\n\n\"The inspectors were bought by the lord a long time ago.\"\n\n*Money. Always money.*\n\nGrid stood abruptly and moved to the furnace. He began stoking the coals, watching them flare to life.\n\n\"Don't worry. Now you have me. I'll give the Mero Company a flat nose.\" He glanced back at Khan. \"Do you trust me?\"\n\n\"Of course I trust you.\" Khan's voice grew thick with emotion. \"Pagma's Descendant can win against any blacksmith. Grid, you really are dependable. If my son was alive, he would be a similar age to you...\"\n\nHis voice cracked.\n\n\"That child would've been a good young man like you. Just like...\"\n\nKhan wiped at his eyes.\n\nGrid looked away, uncomfortable. *Poor man.*\n\n*Wait. Why am I feeling like this?*\n\nSomething about Khan made his chest tighten. Was this part of being Pagma's Descendant? Some ideology implanted without his knowledge?\n\nHe'd always had good affinity with Khan, but this was different. This felt personal.\n\nKhan reached for a bottle, movements subtle. Grid caught him mid-reach.\n\n\"Old man, watch my work all night.\" Grid pulled the bottle away and set it on a high shelf. \"You'll soon forget about drinking. You'll be filled with the desire to be a blacksmith again.\"\n\n\"I-Is that so?\"\n\n*Why did I just smile at him like that?*\n\nGrid stared into the furnace flames. A memory surfaced, old and half-forgotten. Elementary school. His grandfather's house during the holidays. The warmth of his grandparents' love, simple meals shared around a low table, his grandfather's hands guiding his own.\n\n*Ah. That's it.*\n\nKhan reminded him of his grandfather. The atmosphere, the way of talking, even the stubborn pride masking deep pain.\n\nKhan held out a steaming cup. \"Have some tea. Lunol leaves, boiled. The fragrance is very good.\"\n\n\"It's not bad.\" Grid took the cup. \"I'd rather receive money, but...\"\n\n\"Huh? What did you say? The noise is so loud, I can't hear you!\"\n\n\"You can't hear me?\"\n\n\"I can't hear what you're saying!\"\n\nKhan's grin was knowing. \"Indeed, you are skilled.\"\n\n*Kaaang! Kaaang!*\n\nThe hammer rang against the anvil. Grid worked, Khan watched, and they shared tea between strikes.\n\n*This is the first time I've felt a moment like this in Satisfy.*\n\nHis chest felt heavy, but not unpleasant.\n\n\"But you... how come your hammering form is like that?\" Khan leaned in, squinting. \"Was I mistaken because my expectations were too great? No, it should look like this. You need to narrow your elbows a bit more.\"\n\nKhan grabbed Grid's arm, adjusting his stance.\n\n\"Are you really Pagma's Descendant? Tell me honestly. You're not a scam artist, are you? Are you someone from the Mero Company?\" Khan's face flushed. \"I was crazy to accept Rabbit's offer!\"\n\nGrid jerked his arm free. \"Be quiet! Can you see my skills so quickly? Just leave me alone a little bit! Why are you taking the hammer?\"\n\n\"I judged too quickly?\" Khan snatched the hammer from Grid's hand. \"This is too strange. Pagma's Descendant should've mastered this. A fraud! A crook!\"\n\n\"Give that back, you annoying...\"\n\n*Ttang! Ttang!*\n\nThe night deepened. Grid didn't rest. He was in peak condition, and he'd use every second to improve his skills.\n\nKhan eventually stopped calling him a scammer.\n\nThe next day, training began in earnest. Khan forgot about drinking entirely, revealing sixty years of accumulated experience and knowledge.\n\n\"The thing to consider when making armor isn't just durability.\" Khan circled Grid's workbench, examining each piece. \"First, design armor that allows the wearer to move freely.\"\n\nGrid examined the armor he'd made and started over.\n\n\"Wrong! The strength and weaknesses aren't aligned properly! Why is only this part calibrated?\" Khan tapped the breastplate with his knuckle. \"You need to focus! You aren't a three-year-old child. Why are you becoming so distracted?\"\n\nGrid gritted his teeth and bore the scolding.\n\n\"Amazing. Why is it so different as soon as you start concentrating? Your talent is endless.\"\n\nPraise followed punishment.\n\n\"There are stupid people who stop when they think something is good enough.\" Khan's voice turned serious. \"Their logic is that they're pushed for time, so they might as well skip forging. But they're mistaken. Forging is not a minor task. If forging is omitted, the meaning of quenching and tempering fades. If you're lacking time, skip quenching instead of forging.\"\n\nGrid absorbed every word.\n\n\"I agree with you. Does it make sense to skip processes just because of time constraints? That creates imperfect items. No matter how much time it takes, I'll make perfect things.\"\n\n\"Ohh! A respectable craftsman.\" Khan beamed. \"As expected of Pagma's Descendant, having such noble ideas at a young age.\"\n\n\"It isn't a big deal. I just want to make perfect stuff to sell at a higher...\"\n\n\"Hahaha! Modesty is also a great virtue in a young man. You are respectable, Grid! It's the luck of a lifetime that I met you!\"\n\n*He completely misunderstood.*\n\nEither way, it was a happy time.\n\n***\n\nGrid woke before the alarm.\n\nHe pulled back the curtain. Darkness pressed against the window. He checked his phone. 4 a.m.\n\nToo early. He could sleep another thirty minutes easily. His usual self would've grumbled and buried his face in the pillow.\n\nBut today felt different.\n\n\"Refreshing morning.\"\n\nYesterday, he'd spent two nights of Satisfy time polishing his blacksmithing skills. Three pieces of armor, two swords, two of them rare-rated.\n\nHis stats had risen by plus four across the board. His Legendary Blacksmith's Craftsmanship skill experience had climbed to nearly twenty percent, and Legendary Blacksmith's Breath had jumped by almost eight percent.\n\nHis concentration and sophistication had improved dramatically. Production speed had accelerated. Khan had helped a lot. He was nothing like Smith from Bairan Village.\n\n*Khan still hasn't returned to his peak condition, but the difference between a low-level blacksmith and an advanced blacksmith is like the difference between the sky and the earth.*\n\nGrid wanted to see Khan. To learn from him while making items. Growth was just as addictive as leveling up.\n\n*I want to see him. Right now, first thing in the morning.*\n\nGrid stopped mid-thought.\n\n\"Am I overdoing it?\"\n\nHe sniffed and swung his legs out of bed. \"Let's shower.\"\n\nThe hot water felt good on his shoulders. When he emerged, steam billowing from the bathroom, his mother was already in the kitchen preparing breakfast.\n\n\"Good morning.\"\n\nHis mother glanced up from the cutting board. \"Youngwoo, you rested yesterday. Has your fatigue improved? Why are you awake so early?\"\n\n\"Power of beef rib soup! I ate well, so I feel great.\" Grid stretched his arms overhead. \"So I should eat some grilled eel next...\"\n\n\"Why does a person with no girlfriend need to eat eel?\"\n\nHis father's voice drifted from the living room, newspaper rustling.\n\nGrid puffed up. \"Are you ignoring me because I don't have a girlfriend? There are many places where it has an effect. And who says I don't have a girlfriend?\"\n\n\"What? A girlfriend?\"\n\nHis mother clutched her stomach and burst into laughter. She laughed so hard tears appeared in the corners of her eyes.\n\nGrid's face burned.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 16 chapters a week.  \n**Check out my Patreon** for early access to a certain number of unedited chapters and to achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}