{
  "id": 290,
  "title": "Chapter 290",
  "content": "# Chapter 290\n\nVantner stared at the cloak in Grid's hands. His throat went dry.\n\n\"M-Malacus's Cloak.\"\n\n*This is suicide.* Vampires could smell blood from a mile away. Wearing that thing would draw every bloodsucker in the building like flies to a corpse. He'd be painting a target on his back.\n\nGrid stepped forward, jaw set. \"Vantner, we don't have time for this.\"\n\n\"Speed matters.\" Pon adjusted his spear. \"We need them bunched up.\"\n\nRegas cracked his knuckles. \"We'll cover you. Just put it on.\"\n\nVantner looked at their faces. Every member of Overgeared had accepted they might die here. He exhaled slowly and reached for the cloak.\n\n\"Fine.\"\n\nThe fabric settled over his shoulders like a shroud. The stench of dried blood hit his nostrils immediately. Vantner grimaced and pushed toward the massive building's entrance.\n\n\"Let's go.\"\n\nGrid didn't waste another second. He strode through the doorway.\n\n***\n\nThe first floor sprawled before them like a baron's ballroom gone to rot. Vantner's footsteps echoed against stone walls that stretched upward seven stories. Two staircases curved along opposite walls, leading to shadowed balconies above.\n\n\"This is bad.\" Jishuka scanned the hall. \"Too much open space.\"\n\nZednos nodded. \"We need a chokepoint. Otherwise they'll surround us.\"\n\n\"The stairs.\" Faker materialized beside them, voice low. \"Force them to funnel through.\"\n\nThe party moved quickly. Grid's eyes swept across the hall's center as they ran. Hundreds of coffins littered the floor in haphazard clusters. Some were ornate, carved with twisted faces. Others were plain wood, splintered and ancient.\n\nPon whistled. \"Feels like a graveyard.\"\n\nThey'd barely reached the base of the left staircase when the first coffin rattled.\n\n*Kung.*\n\nThen another.\n\n*Kung. Kung kung.*\n\nThe sound rippled through the hall like dominoes. Hundreds of coffins shook in unison, lids straining against their seals. The bloody reek of Malacus' Cloak had reached them.\n\n\"Here they come!\" Peak Sword drew his sword.\n\nGrid's hand found Failure's hilt. Around him, his guild materialized their weapons. Jishuka's dark red greatbow gleamed like polished scales. Pon's blue spear caught what little light existed. Vantner's gauntlets could probably crush stone.\n\n*All made by me.* The thought carried weight Grid couldn't quite name.\n\n*KUNG!*\n\n*KWAJAK!*\n\nCoffin lids exploded outward. Pale figures emerged from the darkness. Red eyes flared to life, pupils contracting to pinpoints as they locked onto their prey. Dozens of vampires rose from their rest, fangs already bared.\n\n\"Fresh blood.\"\n\n\"How thoughtful of them to deliver themselves.\"\n\nThe vampires smiled. They moved with the casual confidence of apex predators who'd never known fear. Their gazes fixed on Vantner like starving wolves spotting a wounded deer.\n\n*Gods, they're fast.* Grid barely registered the blur of movement before the vampires were halfway across the hall.\n\n\"Give me blood!\"\n\n\"That one's neck looks clean!\"\n\nTwo hundred vampires charged. Their footfalls were nearly silent despite their speed. They closed the distance in seconds, claws and fangs gleaming.\n\n\"I can't hold them long!\" Vantner planted his shield. \"Guard of Steel! Guardian of Wisdom! Giant's Blessing!\"\n\n> **[For three minutes, physical defense will increase by 30% and there will be a 50% increase in resistance to stabbing and cutting.]**\n\n> **[For three minutes, magic resistance will increase by 30% and attributes resistance will increase by 50%.]**\n\n> **[A shield that will absorb 20,000 damage has been created.]**\n\nThe buffs washed over him in layers. Vantner had dumped every stat point into strength until level 200, but his class skills made him a wall. A wall that was about to take a beating.\n\n\"Sun Guard!\"\n\n*Flash!*\n\nLight erupted from Vantner's shield. The sudden glare cut through the darkness like a blade. Vampires recoiled, hissing and clutching at their faces.\n\n\"Ugh!\"\n\nMost of the front runners stumbled, blind. But fifty vampires in the rear guard maintained momentum. They hit Vantner like a battering ram.\n\n*Jjejeong! Jjejejeok!*\n\n*Kukwakwang!*\n\n> **[You have suffered 5,600 damage.]**\n\n> **[You have suffered 5,980 damage.]**\n\n> **[You have suffered 7,110 damage.]**\n\n\"Gah! It hurts!\" Vantner's shield rang like a bell under the onslaught.\n\nThe vampires fought like they'd been born with weapons in hand. Magic sparked across Vantner's armor, testing his resistances. The instant his magic defense activated, claws raked across his throat. When he shifted to block physical attacks, dark fire scorched his legs. They probed for weaknesses with surgical precision.\n\nBlood ran down Vantner's neck. He staggered.\n\nZednos finished his chant.\n\n\"Storm of Eternity.\"\n\n*KWAANG!*\n\nWind screamed to life. A vortex materialized around the fifty vampires still pressed against Vantner, trapping them in a howling prison. They clawed at the walls of wind, but the storm held firm. Zednos's ultimate skill could bind enemies for up to five minutes. Nothing could pass in or out.\n\n\"Thank the gods!\" Vantner gulped a health potion.\n\nThe remaining 150 vampires recovered their sight. They rushed forward with renewed hunger.\n\nVantner's eyes widened. \"Save me! Aaack!\"\n\n*Papat! Papapat!*\n\nSome vampires came with fists and blades. Others shaped dark magic between their fingers, hurling it at Vantner's exposed flanks.\n\n\"Cripple!\"\n\n\"Dark Binding!\"\n\n\"Neder's Grab!\"\n\nCurse magic slammed into him. Vantner's limbs locked up as shadowy hands erupted from the floor, wrapping around his ankles and wrists. He couldn't move. The vampires converged, swords aimed at gaps in his armor.\n\nOne vampire lunged for his throat with bared fangs.\n\n*Puok!*\n\nThe fangs sank deep. Vantner screamed as steel punched through his breastplate.\n\n*This is it.* His health plummeted. If it bottomed out, he'd have to burn Guardian's Power, the one-time invincibility that was supposed to save him when Elfin Stone reappeared. But that wouldn't matter if he died here.\n\n\"Do something!\" Vantner's voice cracked.\n\n\"You're doing great!\" Pon called back.\n\n\"Almost done!\" Regas added.\n\nPon, Regas, Faker, and Peak Sword moved like ghosts through the chaos. While every vampire focused on Vantner's suffering, they struck from behind. Spears pierced kidneys. Daggers opened throats. A palm strike shattered a spine.\n\n\"Kuhak!\"\n\n\"You dare!\"\n\nThe wounded vampires whirled, rage replacing hunger. They turned on the four attackers.\n\n\"Looking for me?\"\n\nJishuka stood at the top of the stairs, bow drawn. The firelight caught her curves as she released.\n\n*Pepepepeong!*\n\nDozens of arrows screamed through the air. They fell like a meteor shower, punching through vampire flesh while the monsters were still focused on the melee fighters.\n\n\"Kuaaaak!\"\n\nFire bloomed across the hall. Vampire blood hissed as it vaporized in the flames. The dark interior became an inferno. When the smoke cleared, the vampires were down to sixty percent health.\n\n\"My Lord! Now!\"\n\n> **[Your morale has increased.]**\n\n> **[Your attack power and magic attack power will significantly rise for the next attack.]**\n\n> **[The next attack will be a critical hit!]**\n\nHuroi's buff hit Grid like a shot of adrenaline. Grid withdrew from the party to monopolize experience, downed an experience potion, and strapped on the Slaughterer's Eye Patch. He activated Blacksmith's Rage.\n\nHeat flooded his veins. His muscles sang.\n\n\"Pagma's Swordsmanship.\"\n\nDarkness was supposed to limit vision. Slow reactions. Make you weak.\n\nNot for Grid.\n\n*Kuoooooh!*\n\nFailure erupted with blue-black light. The aura bled off the blade like smoke, filling the space around Grid with crawling energy. This was the prelude to destruction.\n\n\"Transcended Link.\"\n\nThe skill had leveled up after the Pascal raid. The power was different now. Sharper. Deadlier.\n\n*KWA KWANG! KWA KWA KWA KWANG!*\n\nTwenty blades of compressed energy tore through reality. They carved through the vampires fighting the Overgeared members, bisecting torsos and severing limbs. The energy blades didn't stop. They penetrated flesh and bone, continuing forward to strike the vampires who'd just escaped Zednos's storm.\n\n> **[Critical!]**\n\n> **[The <span class=\"rarity-legendary\">Holy Light Gloves</span>' option effect is activated, causing the skill '5 Joint Attacks' to be generated.]**\n\n> **[You have dealt 5,490,500 damage to the target.]**\n\n> **[You have dealt 5,670,000 damage to the target.]**\n\n> **[You have dealt...]**\n\nThe numbers climbed.\n\n> **[This is a phenomenal record!]**\n\n> **[You have dealt over 100 million total damage in 5 seconds!]**\n\n> **[Reputation throughout the continent will rise by +5,000.]**\n\n*Five thousand reputation.* Grid's mind raced. That was the same as crafting ten legendary items.\n\n*I just recovered five draws from that machine!*\n\nThe thought brought a savage grin.\n\n\"Kiyaaaaack!\"\n\n\"Keooook!\"\n\nVampire screams echoed off stone. Two hundred monsters reduced to bleeding wrecks in seconds. They trembled, eyes wide with something they'd forgotten.\n\nFear.\n\nGrid leaped from the stairs into the center of the mass. \"Wave.\"\n\n*Kurururung!*\n\nEnergy rippled outward in concentric circles. It slammed into every vampire, dealing massive damage and slowing their movements to a crawl.\n\n\"You!\"\n\n\"I'll drain you dry!\"\n\nThe vampires fixated on Grid. All two hundred of them. They crawled and limped toward him, murder in their eyes.\n\nThe Overgeared members held position. They couldn't help. Any damage they dealt would split Grid's experience. This was his hunt.\n\n> **[Your attack has missed.]**\n\n\"What?\"\n\nThe vampires dissolved. Their bodies became black smoke, formless and intangible. Grid's blade passed through empty air. The smoke swirled around him in a vortex.\n\n\"Kuhahahaha! Humans can't kill us!\"\n\n\"Your attacks are worthless!\"\n\n*Shaaaah!*\n\nThe dark mist spun faster, forming a hurricane with Grid at the center. The vampires would confuse him, then materialize and drain his blood. A perfect ambush.\n\nGrid didn't look worried.\n\n\"Go around once.\"\n\nHe wasn't talking to Noe. Not Randy either. Grid had no intention of sharing experience with his pets.\n\nHe was talking to Lifael's Spear.\n\nThe divine weapon appeared in a flash of white light. It orbited Grid once, trailing blessed radiance. The smoke recoiled like it had been burned.\n\n\"Heok!\"\n\nThe Rebecca artifact was anathema to darkness. Even Grid's reproduction carried enough holy power to force the vampires back into physical form.\n\n\"U-Unbelievable!\"\n\nThe vampires materialized on the ground, severely wounded and trembling. The divine power sapped their strength. They crawled toward the exits, arrogance replaced by desperation.\n\nGrid watched them flee.\n\n\"Kuhahahahat! Beautiful!\"\n\n*Elfin Stone is still coming.* Grid knew that. But the experience in front of him was too sweet to resist.\n\n*Seokeok!*\n\n*Puok!*\n\nFailure swept through vampire flesh. Each swing ended a life. The monsters tried to fight back, but Jishuka's arrows and Zednos's magic cut them down. Pon, Regas, Faker, and Peak Sword blocked every escape route.\n\nGrid wasn't just on a power-leveling bus. He was riding first class on a private jet, destination level 300, and his guild was paying for everything."
}