{
  "id": 291,
  "title": "Chapter 291",
  "content": "# Chapter 291\n\n> [A junior vampire was vanquished.]\n> [4,901,000 experience has been acquired.]\n\n> [4,855,000 experience has been acquired.]\n\n> [An intermediate vampire was destroyed.]\n> [6,954,300 experience has been acquired.]\n\n> [6,899,000 experience has been acquired.]\n\nThe experience flooded in faster than Grid expected. Nearly triple what the desert monsters gave, even after splitting credit with the Overgeared members who'd chipped away at the vampires' health bars.\n\n*The experience buff potion.*\n\nThe gamble had paid off. Twenty-five thousand reputation, gone in an instant for that cursed lottery wheel, but the payoff made his teeth stop grinding. For now.\n\n*Never again. I might draw another damn red pepper.*\n\nHe shook off the memory. There were more immediate problems. The surviving vampires had stopped trying to fight him up close.\n\n\"Blood Transfusion!\" A vampire twenty meters back raised both hands, dark energy coalescing.\n\n\"Dark Missile!\" Another joined in, crimson bolts streaking toward Grid.\n\nHe ducked left. Pain lanced through his shoulder where one missile clipped him. The burns sizzled against the Holy Light Armor, but the divine metal absorbed most of the damage. Without it, he'd be a corpse already. Without **Lifael's Spear** in his off-hand to punish their evasion, they'd dance circles around him until he dropped.\n\n*These bastards are strong.* Individually varied, but most hit several times harder than the Black Knights. And that bloodsucking skill kept topping off their health bars. He needed to end fights in one decisive blow.\n\nGrid surged forward, closing the gap. \"Pagma's Swordsmanship, Link!\"\n\nThe fusion skills scaled better with levels. **Linked Kill** and **Transcended Link** gained new effects as they climbed higher. But the basic techniques? They just added raw damage. **Link** sat at level 5 now, respectable but nothing special compared to the big moves.\n\nStill, against wounded prey, it was more than enough.\n\nHis blade became a blur. The jade greatsword carved through the first vampire's torso in three rapid strikes, each one faster than the last. The creature tried to dodge, but exhaustion slowed its movements. The final slash opened its throat.\n\nFlash!\n\nFifty vampires down. A pillar of light crashed through the ceiling, bathing Grid in warmth.\n\n> [Your level has risen.]\n\n> [10 stat points have been acquired.]\n\nLevel 297. Three more levels to the threshold.\n\n\"Distribute my stat points.\" Grid fed all ten into Agility without hesitation.\n\nHe'd modeled his distribution after Piaro. **Strength 1: Agility 1: Stamina 0.7.** Piaro was aiming for Sword Saint, which meant his stats couldn't be garbage. Grid had gambled that the ratio represented some optimal balance, and so far, the gamble kept paying out. As his Agility crept closer to his Strength, his swordsmanship felt smoother, sharper.\n\n*Faster.*\n\nSeokeok! Puk!\n\n\"Kuaack!\" A vampire's scream cut short as Grid's blade punched through its sternum.\n\nHis improved speed let him chain attacks before they could respond. The kill rate accelerated.\n\n> [<span class=\"rarity-epic\">Finest Tailcoat</span> has been acquired.]\n\n> [<span class=\"rarity-epic\">Junior Vampire's Ring</span> has been acquired.]\n\nGrid dismissed the windows and kept moving, but his mind catalogued the loot automatically.\n\n**Finest Tailcoat.** Epic rating. Defense 301, Charm +50. Level 300 requirement, men only. *Vampire fashion sense. Figures.*\n\n**Junior Vampire's Ring.** Epic rating. Five percent lifesteal on normal attacks, fifteen-second cooldown. Level 280 minimum.\n\nThe vampire drop rate was atrocious. One item per thirty or forty kills. But the quality? Every piece was worth its weight in gold. Vampire accessories were legendary for improving sustain. He'd never even seen one before today.\n\n*Let's test it.*\n\n> [The <span class=\"rarity-epic\">Junior Vampire's Ring</span> has been worn.]\n\nPuk! Puk puk!\n\n\"Kuaack!\" A vampire staggered back, Grid's spear lodged in its gut.\n\n\"I...! To a human...!\" Its protest died as **Failure** split it from shoulder to hip.\n\nThe wounds Grid had accumulated began to close. Slowly, but measurably. The Holy Light Armor's regeneration bonus stacked with the ring's lifesteal.\n\n> [Critical hit!]\n\n> [You have dealt 9,300 damage to the target.]\n\n> [5% of the damage has been absorbed as health.]\n\n> [The <span class=\"rarity-legendary\">Holy Light Armor</span> has increased recovery by 300%.]\n\n> [1,350 health has been restored.]\n\nEvery fifteen seconds, a hit would trigger the effect. Not constant, but when the Holy Light Gloves proc'd their **5 Joint Attacks**, his health bar would leap upward in chunks. His base damage was absurd enough to make even a five percent conversion meaningful.\n\n\"Kukukuk! Kuhahahaha!\" Grid's laughter echoed through the building, the sound warped by the **Slaughterer's Mask** into something inhuman.\n\n\"Hiik!\" The nearest vampire flinched.\n\n\"V-Vampire slaughterer!\" Another turned to run.\n\nThe first floor was his. Every vampire reduced to ash, every drop of experience absorbed. His gauge climbed past twenty percent.\n\nHe couldn't celebrate. Elfin Stone was still out there, waiting. And the vampires from the upper floors had started descending. Higher level. Stronger.\n\n\"Stop!\" The Overgeared members formed up on the staircase, shields raised.\n\nThey didn't charge. Smart. They held the line, buying Grid time to catch his breath. His stamina bar was in the red. Mana nearly empty.\n\n*Good team.*\n\nGrid lowered himself against a pillar, gulping from a potion.\n\nMeanwhile, Vantner discovered new depths of suffering.\n\n\"Ugh! Not this again!\" The warrior braced as three vampires converged on him.\n\nPeok! Peok peok! Kwajak!\n\nHe cursed **Malacus' Cloak** and its aggro-generating stench. He cursed his class choice. Tanking didn't suit him. Never had. He wanted to delete this character, start fresh. But he bit down on the complaints and held the line.\n\nBehind him, the Overgeared members whittled away at vampire health bars, setting Grid up for the finishers.\n\n***\n\nHalf a day. One entire building cleared. Grid's experience bar sat at sixty percent.\n\n\"Wow, faster than expected,\" Zednos said, checking the combat log.\n\nJishuka nodded. \"Seven top-twenty users and Huroi. Makes sense.\"\n\n\"True. Four more buildings and you'll hit 299.\"\n\n\"Then the real grind starts.\" Lauel adjusted his glasses. \"299 to 300 requires four times the experience of 298.\"\n\n\"Half a day per building...\" Pon did the math. \"Five days to 300?\"\n\n\"Assuming Elfin Stone doesn't show up.\"\n\nSilence.\n\nVantner and Huroi had one-time invincibility skills. Everyone else? One mistake and they were ash.\n\n\"If someone dies, we lose momentum,\" Jishuka said. \"The hunt slows to a crawl.\"\n\n\"Well...\" Pon shrugged. \"We've been lucky so far. He hasn't come back yet.\"\n\nHalf a day since Elfin Stone's first appearance. Long, considering his promise.\n\n\"Good if he stays gone.\" Zednos started toward the next building.\n\nInside, the resistance stiffened. True Blood vampires emerged from the shadows.\n\n> [**True Blood Vampire: Boras**]\n\n> [**True Blood Vampire: Rujul**]\n\nNamed monsters. Stronger than the 19th Knight Fulito by a significant margin, each backed by dozens of subordinates.\n\nVantner felt his stomach drop. No choice. He triggered **Guardian's Power**, the golden shield enveloping him.\n\nForty-eight hour cooldown. One safety net against Elfin Stone, gone.\n\n\"Don't worry.\" Huroi stepped forward, chest puffed. \"Next time Elfin Stone shows, I'll provoke him first.\"\n\nImpossible. Elfin Stone struck instantly, no warning. But Huroi believed in his silver tongue.\n\n\"Words are faster than action. I'll pull aggro before he casts.\"\n\n\"...\" The others exchanged glances.\n\nThey'd heard Huroi's 'provocations' before. The man could insult someone's ancestors, present lineage, and future descendants in a single breath. They pitied Elfin Stone's parents. Whatever Huroi was planning, it would be brutal.\n\n> [The True Blood vampire, Boras, has been destroyed.]\n\n> [44,690,500 experience has been acquired.]\n\n> [<span class=\"rarity-rare\">Complete Ruby</span> has been acquired.]\n\n> [The True Blood vampire, Rujul, has been destroyed.]\n\n> [45,900,000 experience has been acquired.]\n\n> [**Third Piece of ???** has been acquired.]\n\nGrid examined the drops while catching his breath.\n\n**Complete Ruby.** Material for top-rated accessories.\n\n**Third Piece of ???** Unknown. Minimum three pieces required for identification.\n\n> [Your level has risen.]\n\nLevel 298. Another pillar of light, another ten stat points into Agility.\n\nThe second building, done. A hundred and fifty vampires plus two True Bloods. But Grid felt a twinge of disappointment.\n\n*True Bloods can drop elixirs.* Permanent stat boosts. Or better vampire accessories, intermediate or advanced tier. The mysterious ??? piece was clearly unique, but was it worth more than raw stats?\n\n> [The cooldown time of the title skill 'One who Became a Legend' is over.]\n\nHis invincibility passive, restored.\n\n*Now I can breathe easier.*\n\nWithout that safety net, every fight felt like walking a tightrope. Grid exhaled slowly.\n\n\"Didn't I say I would come back?\"\n\nThe voice came from directly above.\n\n> [The master of the 13th city, **Vampire Earl Elfin Stone**, has appeared.]\n\n> [A strong evil influence is making your magic power turbid. All types of spells and skills aren't available.]\n\n> [A vampire's gaze will subdue lower species. Your body is subjected to strong oppression.]\n\n\"Elfin Stone!\" Huroi lunged forward, mouth opening.\n\n\"You—\"\n\nA curtain of blood swallowed Grid whole before Huroi's second word.\n\nElfin Stone smiled, cold and cruel. \"I will come back soon. I will kill another person, and then another the time after that! This will be repeated again and again. I will show you the extreme taste of fear!\"\n\nSuruk! He vanished.\n\nGrid stumbled out of the blood curtain, limbs shaking.\n\n\"That crazy bastard!\" His hands clenched. \"Why does he keep targeting me?!\"\n\nGrateful, yes. The passive kept him alive. But being singled out felt dirty, like the universe was mocking him."
}