{
  "id": 293,
  "title": "Chapter 293",
  "content": "# Chapter 293\n\nEarl Elfin Stone woke.\n\nHe stalked toward Grid's party, fangs already anticipating fresh blood. For three consecutive days, he had killed one human each time. Yet something nagged at him as he studied the cluster of warm bodies ahead.\n\n*The same count as yesterday.*\n\nHe wasn't mistaken this time. Yesterday he'd counted them carefully. Memorized the exact number. The humans should have been one fewer.\n\n*What is this?*\n\nElfin Stone scanned Grid's group, searching for the face he'd drained the night before. The task proved difficult. Just as humans struggled to tell one beast from another, vampires found individual humans indistinct.\n\nSniff. Sniff.\n\nUnable to locate his prey by sight alone, Elfin Stone inhaled deeply. He tracked the lingering scent of blood.\n\n*There.*\n\nHis gaze locked onto Grid. The man's aura was rough, unpolished, but his frame suggested strength. Elfin Stone's certainty crystallized. This was the one he'd attacked yesterday. No, not just yesterday. The first day. The second day. All three days, the same target.\n\nHis eyes narrowed to slits.\n\n\"You.\" Elfin Stone's voice dropped to a whisper. \"Why are you still alive?\"\n\nThree consecutive Extreme Blood Transfusions should have killed any ordinary human. Which meant this one was extraordinary. \n\n*A close call.*\n\nHe'd nearly wasted premium stock. Nearly destroyed blood of exceptional quality without savoring it properly. The human's survival was fortunate.\n\n*Should I taste him now?*\n\nStep. Step.\n\nThe appeal Grid emanated pulled Elfin Stone forward. Grid tensed, his entire body going rigid.\n\n\"Your parents must've had a hard time after giving birth to you!\"\n\n\"...!\"\n\nEven the lowest human thought of their parents with reverence. How much more so for vampires, who recognized themselves as humanity's superiors? The True Blood, especially, revered their progenitor as divine.\n\nShizo Beriache. She who granted eternal life. She was no existence for a mere human to disparage.\n\n\"This is the second time I have become so angry in three hundred years!\"\n\nBlood rushed to Elfin Stone's face. His features contorted into something monstrous.\n\n\"I will feed on all of you today!\"\n\nKuwooooh!\n\nMagic power erupted from Elfin Stone in waves. It hadn't reached the plateau of a great demon, but it dwarfed even the strongest demonkin by several magnitudes. The pressure approached Hell Gao's level after Muller had destroyed that demon's flesh.\n\nGrid and Peak Sword exchanged glances amid the party's shock. Both had fought Hell Gao. Both recognized what this meant.\n\n*This is bad.*\n\nHell Gao had possessed the fire stone weakness. Elfin Stone was different. Grid studied him through the Slaughterer's Eye Patch, searching for vulnerabilities. Nothing revealed itself. This was a high-ranking boss without exploitable flaws.\n\n*Shit.*\n\nHuroi's aggro had gone too far. He'd pushed every button, crossed every line. Grid had known the orator would get beaten down eventually for mentioning someone's parents, but...\n\n*Why today?*\n\nGrid's internal lament was cut short by Jishuka's voice.\n\n\"This is fine!\" She tried to rally the group. \"There's a chance to win!\"\n\nThey'd feared Elfin Stone primarily because of his opening attack. That unavoidable surprise strike that guaranteed one death. But now the vampire stood before them. No more ambushes. With proper formation, maybe they could...\n\n\"...Not.\"\n\nThe group collectively deflated as Elfin Stone demonstrated his full power.\n\n\"Blood Field!\"\n\nPuhahahak!\n\nMagic surged outward in a crimson tide, dominating a thirty-meter radius. Grid's party stood within its borders. More precisely, everyone except Grid felt its effects.\n\n> [Your blood is influenced by Blood Field.]\n> [153 health will be transferred to Earl Elfin Stone per second.]\n> [All healing effects will be reduced by 80%.]\n\nThe party's squishiest members were Jishuka, Zednos, and Faker. Archers, magicians, and assassins typically maintained 20,000 to 30,000 health. Losing 153 per second created crushing pressure. In two minutes, they'd lose two-thirds of their life.\n\nWorse, that drained health fed directly into Elfin Stone. 1,400 health per second, constantly regenerating.\n\n\"Such a scam,\" someone muttered.\n\n\"We fight here, we lose.\"\n\nThe party scrambled to escape the Blood Field's radius. Elfin Stone simply smiled.\n\n\"Blood Requiem.\"\n\nHe raised both arms. The gesture reminded Grid of a conductor before an orchestra. Then pillars of blood crashed down on every party member's head.\n\nPepeng! Pepepepeng!\n\nBlood Requiem struck without discrimination. Elfin Stone's unique skill targeted every enemy within the Blood Field simultaneously. Each pillar dealt a minimum of 10,000 damage. The area-of-effect devastation was absolute.\n\n\"Kuack!\" Vantner coughed blood. \"How do we defeat that?\"\n\n\"I'm going crazy,\" Zednos gasped.\n\nThe Overgeared members staggered, frantically downing potions. The 80% healing reduction made each recovery item worthless. Grid summoned Noe and Randy with mounting desperation.\n\n*Noe can drain his stats. Randy can copy his skills. We can turn this around.*\n\nNeither pet could fulfill their role.\n\n\"I can't swallow the souls of noble True Blood vampires, nyang...\" Noe's short legs gave out. He collapsed, ears flat against his head. \"I tried to swallow, but the curse of blood turned on me...\"\n\nThe cat's misery at failing Grid was palpable. Randy wore a similar expression of shame.\n\n\"I can't copy that target.\"\n\n\"Didn't you copy Pagma?\" Grid's voice rose. \"Is Elfin Stone stronger than Pagma?\"\n\nRandy shook his head. Strength wasn't the issue. Race was. The True Blood vampires existed as a superior species to doppelgangers. Physiology created an insurmountable wall.\n\n*Dammit.*\n\nHis trump cards had evaporated. The situation spiraled toward desperation. Elfin Stone summoned something while Grid's mind raced.\n\n\"Iyarugt.\"\n\n*Yakult?*\n\nThe pronunciation echoed the 200-won drink Grid enjoyed. But the weapon itself was no joke. From handle to blade, the sword formed a smooth, slightly curved strip of pure red. Blood stone. So sharp it could cleave anything.\n\nGrid's breath caught. If adamantium represented the gods' domain, blood stone embodied hell itself. Adamantium occasionally surfaced in the human world because the gods favored humanity. Blood stones were different. Throughout human history, barely any had appeared. The mineral was alien to Grid.\n\n*This weapon...*\n\nIt felt leagues apart from Pagma's craftsmanship. What blacksmith besides Pagma could forge such a blade? Grid found himself captivated by Iyarugt's beautiful form and perfectly rational structure. Then memory stirred. The 'Third Piece of ???' dropped by True Blood vampires.\n\nThe unidentified fragment's color matched Iyarugt's hue exactly. Elfin Stone's white robes billowed in the bloody magic power as he made his declaration.\n\n\"Only one being has survived Iyarugt. There will be no second.\"\n\nChaaeng!\n\nElfin Stone lunged for Huroi first. Peak Sword intercepted, deflecting the blood-red sword. His prediction of the trajectory had been perfect.\n\n\"...!\"\n\nElfin Stone's eyes curved upward fractionally. Mild surprise that a human could defend against his strike. Nothing more. Peak Sword withdrew the sword that had met Iyarugt, preparing to sheath it. The motion exposed a one-second gap.\n\nSeokeok!\n\n\"Ku...heok!\"\n\nThe red blade flowed through that opening, biting into Peak Sword's shoulder.\n\n*It's like Iyarugt is reading our movements.*\n\nObviously an ego sword. The weapon showed its wielder optimal attack routes. Peak Sword understood now. Elfin Stone's swordsmanship itself was unrefined, lacking polish. That made the sword's path harder to predict, not easier.\n\nPeeng!\n\nElfin Stone wound up for another strike at Peak Sword. A spear thrust at his exposed flank. Pon's Mach Spear. Even that posed no real threat. Ordinary vampires could only transform their entire bodies into smoke. Elfin Stone could alter specific parts. His waist dissolved into black mist. Pon's spear passed through empty air. The vampire's arm came down in a vicious counter.\n\n\"How the hell do we kill him?\" Pon clutched his bleeding chest.\n\nThe other party members launched their offensive. Flaming arrows. Unpredictable kicks. Swift daggers. Powerful storms. The attacks blanketed Elfin Stone from every angle.\n\nNot even the vampire earl could neutralize everything. The Overgeared members' standards were too high. But none of the damage was fatal.\n\n*We'll be wiped out at this rate.*\n\nThe certainty settled over everyone. Grid's mind worked furiously, searching for an angle, an opening, anything. Only he had the tools to break this stalemate.\n\nA solution crystallized. It was only possible because it was Grid.\n\n---\n\nGlossary of Common Korean Terms.\nOG: Glossary Link.\nCurrent schedule: 20 chapters a week.\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}