{
  "id": 295,
  "title": "Chapter 295",
  "content": "# Chapter 295\n\nThe notification window materialized before Grid's eyes the moment they broke free from the Blood Field's radius.\n\n> [Your party member Huroi has died.]\n\nNobody spoke. Vantner kicked at the dirt. Pon stared at his spear like he wanted to snap it in half.\n\n\"Shit.\" Regas spat the word. \"There's a day when I have to sacrifice my companion to live.\"\n\n\"This is the result of our lack of power.\" Zednos adjusted his glasses. \"Let's take this opportunity to work harder.\"\n\nThe rest of the party had stopped blaming Grid after the first hour. They understood he hadn't abandoned Huroi out of malice. When viewed objectively, Grid's call had been correct. Brutal, but correct. Thanks to that decision, seven people had survived instead of zero.\n\n*He factored in the boss mechanics and forced that scenario?*\n\nIt was the day they realized Grid wasn't just evolving in personality and combat ability. His tactical thinking had sharpened too. From a certain angle, the situation wasn't completely catastrophic.\n\nBut Regas kept shaking. His fists clenched and unclenched at his sides.\n\n\"It would've been better for all of us to die, rather than sacrificing someone.\"\n\nGrid knew why Regas felt this way. Back when Grid had been pathetic, selfish, unbearable to work with, Regas had been the only one who showed him respect. The only one who trusted him when everyone else wrote him off. Grid understood Regas' anger.\n\nUnderstanding didn't mean acceptance.\n\n\"If you have time to grumble, kill more monsters.\" Grid's voice was flat. \"We now have to clear four buildings in 23 hours.\"\n\n\"What?\" Vantner's head snapped up.\n\nThey had been averaging ten hours per building. That was already an improvement. The first two days, they'd needed twelve hours minimum to finish a single structure.\n\nEvery building swarmed with powerful vampires. The ones housing two or more True Bloods were particularly vicious. There had been runs where Vantner burned his once-per-two-days invincibility skill just to survive.\n\nGrid was declaring they'd cut that time nearly in half. With one fewer party member. In a twisted way, it proved Grid was the most enraged person present about Huroi's death.\n\n\"Look.\" Vantner stepped forward. \"We'll be wiped out if we rush like that. What if we encounter a building with three True Blood vampires and no time to rest?\"\n\n\"Vantner is correct.\" Pon tapped his spear against the ground. \"We should maintain our previous pace. Grid, I understand your feelings, but don't let rage cloud your judgment.\"\n\nJishuka crossed her arms. \"No. We have to do as Grid says. Elfin Stone will come for us again tomorrow.\"\n\nPeak Sword nodded. \"If Grid doesn't reach level 300 by then, this situation will repeat itself.\"\n\nThe goal crystallized in the silence that followed.\n\n\"More haste, more speed.\" Grid strode toward the next building. \"We have to hurry.\"\n\nHe entered through the main entrance and immediately activated **Transcend**, aiming at the ceiling.\n\n**Kurururung!**\n\nThe roof collapsed. Dust billowed through the hall in choking clouds.\n\n**Bump!**\n\n**Kung! Kung!**\n\nStone rubble piled high across the floor.\n\n**Kwaang!**\n\n**Kwang! Kwang!**\n\nThe coffins in the collapsed section burst open simultaneously. Hundreds of vampires spilled out, their eyes glowing red in the darkness as they scanned for the source of the disturbance.\n\n\"Who dares awaken us from our sleep?\" one snarled.\n\n\"These human scum want to die!\"\n\n\"No.\" Grid gripped Failure in his right hand and the Doppelganger's Greatsword in his left. His expression was carved from ice. \"I want to kill you.\"\n\n*I'm angry.*\n\nHis party members were here risking their lives to help him complete his quest. His helplessness made him sick.\n\n\"I...\"\n\nGrid charged forward. There was no hesitation, no defensive positioning. The red glow from the Slaughterer's Eye Patch cut through the gloom like a beacon.\n\n\"I'm going to become stronger!\"\n\nStrong enough that this filthy, hollow feeling would never poison him again. He would become the best. Grid finally understood what he needed from this game. Combat experience. Levels. Instinct. And the overwhelming power that only perfect items could provide.\n\n\"Ohhhhhh!\"\n\nGrid crashed into the center of the vampire horde. In the darkness, Failure and Grid's Boots amplified his stats significantly. He fought better now than he ever had before entering these cursed cities.\n\nHe'd been struggling against large groups all day and had grown more efficient with every encounter. But he needed to stay calm. Needed to maintain composure.\n\n\"Kek! Ugh! H-Hik! Save me!\"\n\n\"...\"\n\nGrid tore through the vampires like a rabid animal. His health bar plummeted as claws raked his armor and fangs found gaps in his defense. Blood sprayed. The party members scrambled to cover his suicidal assault, struggling to prevent a complete collapse.\n\n***\n\nAt Reidan Castle's resurrection point, light flared.\n\n**Pahat!**\n\nHuroi materialized in a burst of white radiance. Considering his body had been shredded apart by Elfin Stone minutes ago, he looked remarkably intact.\n\n\"Pant... pant...\"\n\nHis breathing came in ragged gasps. His entire body trembled. Huroi possessed a strong mentality, but nothing prepares you for the sensation of being hacked to pieces. He forced himself to breathe slowly, methodically shaking off the trauma. Finally, he opened his status window and checked his experience gauge.\n\n*Ten percent.*\n\nThe drop was brutal. 29.3% of his total experience, gone. Past level 200, death penalties scaled proportionally with level.\n\n*Fortunately, no items dropped.*\n\nCold comfort. The durability of all his equipment had decreased by at least 100 points. If Huroi were an ordinary user without access to Grid's crafting, the repair costs would bankrupt him.\n\n\"Huroi?\"\n\nLauel jogged over, dark circles visible under his eyes. He was the busiest person in the guild. Exhaustion clung to him like a second skin.\n\n\"What happened?\"\n\nLauel knew only two methods to escape a vampire city. Kill the boss or die. If one party member returned alone, the reason was obvious.\n\n\"You died.\" Not a question.\n\nHuroi nodded.\n\n\"The boss is too strong.\"\n\n\"Tell me everything.\"\n\nThere was no point hiding details. Huroi recounted the entire encounter in the vampire city. To his surprise, Lauel's reaction was almost cheerful.\n\n\"Grid used that method? Haha! Incredible!\" Lauel's grin widened. \"Grid's brain wasn't just a decoration after all!\"\n\n\"...\"\n\nLauel seemed genuinely jubilant about Grid's tactical evolution. But the phrasing was tactless enough that Huroi couldn't help glaring.\n\n***\n\n\"Grid's expedition to the 13th city will end in failure. By this time tomorrow, Grid's party will respawn at the resurrection point.\"\n\nLauel stood at the head of the meeting room table in Reidan Castle. He'd convened the former Tzedakah Guild members to deliver news about Grid's situation. Murmurs rippled through the assembled Overgeared members at the grim report.\n\nToban ground his teeth together. \"I should've gone.\"\n\nAs a paladin with divine power, Toban was the natural counter to vampires. But he'd remained behind to manage the yellow mithril mine. Few people in Overgeared possessed the administrative skills to handle that many workers, making Toban invaluable in logistics.\n\nLauel waited until the atmosphere settled before continuing.\n\n\"As you know, pavranium is indispensable for Grid. The more pavranium Grid obtains, the stronger he becomes. I'm sending two additional people to support Grid's party.\"\n\nReidan, Bairan, Cork Island. Managing three territories simultaneously left zero room for flexibility. Even dispatching two people strained Lauel's resources. If he pulled two more members, he'd need to sacrifice sleep entirely just to keep everything running.\n\nToban stood. \"I'm going.\"\n\n\"No. Not you.\"\n\n\"Think about it!\" Toban's voice rose. \"I'll be the biggest help to Grid's party right now!\"\n\n\"I'm aware.\" Lauel's tone remained flat. \"But with over 100 miners under your supervision, you can't leave.\"\n\n\"Then what about me?\"\n\nToon, the human beast, leaned forward.\n\nLauel shook his head. \"Not you either. If you leave while the main force is absent, the guild's combat power drops to dangerous levels.\"\n\n\"Then who?\"\n\n\"Hrmm.\"\n\nLauel's gaze swept across the Overgeared members present. Including Huroi, there were three people in the room. Who could provide significant support to Grid's expedition without crippling territory management?\n\nHe deliberated before pointing.\n\n\"Ibellin.\"\n\n\"Yes!\" The flamberge master straightened in his chair, clearly delighted. For the past several days, he'd been relegated to grinding monsters near the mine.\n\n\"The second one...\" Lauel sighed. \"No matter how I look at it, there isn't another useless person like Ibellin.\"\n\n\"You bastard!\"\n\nThe rivalry between Lauel and Ibellin from their Ten Rookies days remained unresolved. As the two began bickering, someone knocked on the meeting room door.\n\n\"Come in.\"\n\nAt Lauel's call, a soldier pushed the door open.\n\n\"A guest has arrived.\"\n\n\"A guest?\" Lauel frowned. What visitor would come directly to the guild?\n\n\"Heok.\"\n\n\"This is ridiculous...\"\n\nThe Overgeared members stared, shock rippling through the room as they recognized the guest.\n\n\"Nice to meet you.\"\n\nEven her voice was beautiful. Pale skin and black hair. A slender figure and composed bearing that radiated natural charisma. \n\nYura.\n\nLauel's smile stretched wide.\n\n***\n\n\"Pant, pant... shit, I'm going to die.\"\n\nVantner's armor was caked with dried blood. He cursed between gasps, voice raw. The situation had deteriorated into desperation. Over 100 vampires encircled Grid's current position, including three True Blood vampires.\n\nGrid's eight-person party looked like corpses still standing. Health bars flickered in the red. Mana pools sat empty. Even their stamina gauges had bottomed out, making it difficult to lift their weapons. This was the consequence of grinding without rest.\n\n\"It's too much.\"\n\n\"I wanted to punch that bastard Elfin Stone's face in.\" Pon's laugh was bitter. \"Too bad I'll die before getting the chance.\"\n\nThe party members had resigned themselves to the worst outcome. Even Jishuka, who typically encouraged the group through impossible odds, remained silent. Grid watched her chest rise and fall with each labored breath and tightened his grip on Failure.\n\n**Kwajak!**\n\nHe squeezed out his remaining strength and swung at a vampire's skull. The blow drew every vampire's attention. Their eyes locked onto Grid simultaneously.\n\n\"Crazy!\"\n\n\"Hey! The leader can't die first! We should die protecting you!\"\n\nThe terrified party scrambled toward Grid's position.\n\n\"Pant... pant...\"\n\nGrid said nothing. He kept gasping for air as he swung his swords at the approaching vampires. The only mercy was that Lifael's Spear hovered beside him, unaffected by physical exhaustion. Without the divine weapon's autonomous support, Grid would have fallen minutes ago.\n\n\"Sigh. One last rampage.\"\n\nVantner was galvanized by Grid's suicidal determination. He raised his shield despite having already burned his invincibility skill hours ago. His defensive skills sat on cooldown. Potions? He'd been chugging them the moment they came off cooldown. The other members were in identical states.\n\n\"Die!\"\n\nThe vampires launched their final assault. The three True Blood vampires led the charge. Vantner tried to intercept with his shield but was simply overpowered, forced backward. The other party members managed to kill two or three vampires each before reaching their absolute limits. They failed to block subsequent attacks. Their health plummeted toward zero.\n\n\"Jishuka!\"\n\nEnemies broke through the collapsed front line and targeted Jishuka. Zednos squeezed out the last dregs of his mana, but the wind magic proved too weak to save her. This was the end.\n\n\"Hah... hah...\"\n\nThe party could only wait for death. The vampires closed in to deliver the killing blows.\n\n**Chaaeng!**\n\nA brilliant pillar of light erupted upward. The unmistakable signal of a level-up. And that someone was naturally...\n\n\"You've been waiting.\"\n\nGrid.\n\n> [Congratulations!]\n> \n> [You have reached level 300 and achieved the third stats awakening!]\n> \n> [For every point of stamina, health will increase by 25 and defense will increase by 0.9.]\n> \n> [For every point of strength, health will increase by 7 and attack will increase by 0.6.]\n> \n> [For every point of intelligence...]\n\n...\n\n...\n\n> [One of Pagma's Descendant's hidden pieces 'Sealed Ability' has been acquired.]\n> \n> [The skill 'Item Combination' has been acquired.]\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}