{
  "id": 298,
  "title": "Chapter 298",
  "content": "# Chapter 298\n\n*Is this the ability of a human?*\n\nElfin Stone had existed for over 350 years. He'd met countless humans during that time. Geniuses. Warriors. All of them inferior in the end. For Elfin Stone, humans were just prey to be hunted and eaten.\n\nBut his perception shattered at this moment. Extreme Blood Transfusion—invisible to the naked eye—was blocked by a sword. Outstanding. This person wasn't inferior.\n\nElfin Stone's face twisted.\n\n*It is like Braham said.*\n\nBraham. The first to give him anger and pain. Braham, who did all types of terrible things and was eventually banished.\n\n*\"Do you fail to understand my inquiring mind even until the end? Brethren, you are worse than humans. The humans you regard as livestock aren't lazy. They are different from us. Always working. Always developing. One day a transcendent entity will emerge that will threaten us, and it will be a human.\"*\n\n*That damn bastard...*\n\nBraham Eshwald had studied human magic and vampire magic, sacrificing countless vampires in the process. Some of Elfin Stone's blood relatives had been the lab rats. His lover, Leah, among them.\n\n\"Kuk... Kukuk...\"\n\nHow hard had he worked over the past hundreds of years? Sleeping more to forget the terrible memories. Hunting to clear the wounds in his heart. Meeting these humans stirred up those memories again.\n\n*It makes me think of Braham's disgusting face.*\n\nHe couldn't forgive Braham. Elfin Stone's eyes filled with hate as he glared at Grid.\n\n\"Your skills are decent, but in the end, you're just a human!\" Spittle flew from his lips. \"You are my prey!\"\n\nPuhahahak!\n\nElfin Stone's blood gathered into a sphere. It shot towards Grid and detonated. The manifestation then explosion of blood. Its power exceeded that of the continent's 10 great magicians.\n\n*I can't avoid it.*\n\nGrid's eyes tracked the blast radius. Too big. He had no choice but to defend. But could he completely absorb the damage with the Divine Shield? The moment Grid reached for the shield, a body slammed into him.\n\n\"I will protect the leader!\" Vantner wrapped his arms around Grid and activated Thousand Shields. The skill flared, a barrier of light that reduced the power of Blood Explosion.\n\nPeeeeeong!\n\n\"Kuak!\" Vantner's cry tore through the air. \"I'm dead!\"\n\nEven Thousand Shields couldn't completely suppress the force. The explosion shattered the barrier. Contaminated blood scattered across Vantner's flesh, burning him. Grid raised his thumb from within the tank's arms.\n\n\"Thank you.\" He grimaced. \"Although it isn't a great feeling to be in a man's arms.\"\n\n\"Kukuk!\" Vantner laughed through the pain. \"I'm not doing this because I like it! Now go!\"\n\nGrid had already shot forward.\n\n\"You!\" Elfin Stone's fury manifested as Blood Missiles. The crimson projectiles chased Grid, trying to block his approach.\n\n*It's hard to shake off.*\n\nThe missiles were fast. Relentless. Avoidance and interception impossible. He couldn't protect his body with just Lifael's Spear.\n\n*It can't be helped.*\n\nGrid started his footwork. He planned to use Pagma's Swordsmanship, Wave, to shoot down the missiles. But dozens of flaming arrows appeared from the rear.\n\nPepeng! Pepepepeng!\n\nAmazing. They shot down all the missiles aiming at Grid. There was only one person in Satisfy with such bow skills.\n\n\"Leave the cover to me.\" Jishuka winked, her appearance bright despite the chaos.\n\nGrid's heart thumped. He kept moving forward, narrowing the distance to Elfin Stone.\n\n\"Kill!\"\n\nKuwooooh!\n\n*Isn't this crazy?*\n\nThe two greatswords came flying at Elfin Stone. The dimension of the swordsmanship was different than before. Elfin Stone used Fly, trying to avoid it in the air. However, he couldn't. Strong wind pressure pushed down on his shoulders.\n\nZednos' Storm of Eternity. The original Storm of Eternity completely restrained the target. However, Elfin Stone's magic resistance was so high that only some of his movements could be limited.\n\nOf course, that alone was a great help to Grid.\n\n*Yes. Now I'm not alone. I can count on the people with me.*\n\n*Now I...*\n\nHe was stronger than ever.\n\nPuoook!\n\n\"Kuk...! Kuaaaaak!\" Elfin Stone's scream echoed through the chamber.\n\nThe two greatswords penetrated his chest. It was enough to drive him mad. Grid alone was enough to make Elfin Stone feel alert, but the humans supporting Grid meant the battle was developing in an unexpected way.\n\nIt would've been different if Blood Field was deployed, but there was still 3 minutes left of the cooldown time. The worst situation caused by his failure to use the skill before.\n\n\"I will kill all of you in this place!\" Today would be different from yesterday. Elfin Stone used the blood from his chest as a medium. He blew Grid away with an explosion and called out. \"Iyarugt!\"\n\nKiiing.\n\nThe advent of the red longsword. The moment that Blood Cry caused the Overgeared members to lose their sense of balance...\n\n*Now!*\n\nGrid would also be affected by Blood Cry. Elfin Stone smiled and wielded Iyarugt. The red line crossed Grid's stumbling body.\n\n\"What?\" Confusion replaced Elfin Stone's smile. Grid defended against his sword. \"Who the hell are you?\"\n\nGrid wasn't affected by his evil influence. He wasn't disturbed by Iyarugt's Blood Cry. Was this really a human? Grid confirmed Elfin Stone's shaken eyes and replied.\n\n\"Who will kill who?\" Grid scoffed. His gaze was focused behind Elfin Stone.\n\n*Ah!*\n\nElfin Stone hurriedly moved his sword. Too late.\n\n\"The Price of Living.\" Faker's voice was cold.\n\nPuk! Puk puk puk!\n\nThe silver dagger pierced Elfin Stone's neck again and again. The Price of Living dealt more damage according to the number of strikes. Yesterday, Elfin Stone had only allowed three strikes, but today was the worst. He actually allowed seven hits. This was due to Grid perfectly catching the aggro.\n\n\"Kuock... You rat bastards!\" Elfin Stone's health gauge naturally decreased as Iyarugt aimed at Faker. The aggro was changed to him due to the Price of Living. In a normal raid, drawing aggro could endanger the party. But this situation was different. Grid originally had more utility as a damage dealer than as a tanker.\n\n\"Pagma's Swordsmanship, Pinnacle!\" Grid's greatsword came down.\n\nSeokeok!\n\nPinnacle struck true. Elfin Stone paid a heavy price for looking away from Grid.\n\n> [You have dealt 210,900 damage to the target.]\n\n*Not enough.*\n\nGrid's expression became dark. 5 Joint Attacks wasn't activated. Elfin Stone's current health was at 80%. This was the result of being hit by Extreme Blood Transfusion, Kill, Price of Living and Pinnacle.\n\nElfin Stone's health and defense was outstanding as a named boss.\n\n*I was unlucky!*\n\nIf 5 Joint Attacks was activated with Kill, it would've been a fatal wound. However, he had the worst luck and 5 Joint Attacks wasn't activated at all.\n\n*No, there is no need to worry.*\n\nA smile appeared on Grid's face. He was reminded that he had companions to cover for his lacking luck.\n\n\"Sura Descends!\" Regas approached Elfin Stone's side. His lightning assault began. His destructive power at this moment was enough to make even Grid speechless.\n\nPepeok! Pepepepeok!\n\nThe shining punches and kicks left afterglows. Once Regas became an Asura, the true power of Grid's <span class=\"rarity-unique\">Lightning Duke's Knuckles</span> started to explode.\n\n> [The 6th combo has been achieved!]\n> \n> [The unique effect of the Asura class is activated, dealing 5,000 fixed damage to the target.]\n> \n> [The effect of the 'Lightning Duke's Knuckles' has been activated, causing additional physical damage to the target.]\n\nPeeng!\n\n> [The 7th combo has been achieved!]\n> \n> [The unique effect of the Asura class is activated, dealing 8,000 fixed damage to the target.]\n> \n> [The effect of the 'Lightning Duke's Knuckles' has been activated, causing additional lightning damage to the target.]\n\nKwa kwang!\n\n> [The 8th combo has been achieved!]\n> \n> [The unique effect of the Asura class is activated, dealing 12,000 fixed damage to the target.]\n> \n> [The effect of the 'Lightning Duke's Knuckles' has been activated, causing additional physical and lightning damage to the target.]\n\nJjejejeok!\n\n> [The 10th combo has been achieved!]\n> \n> [The unique effect of the Asura class is activated, dealing 20,000 fixed damage to the target.]\n> \n> [The option effect of the Lightning Duke's Knuckles is activated, deploying Lightning Beam three times.]\n\nChaaeng!\n\n> [The 12th combo has been achieved!]\n> \n> [The unique effect of the Asura class is activated, dealing 30,000 fixed damage to the target.]\n> \n> [The effect of the 'Lightning Duke's Knuckles' has been activated, causing additional physical damage proportional to the target's maximum health.]\n\n\"Kuheok! Ugh! Kuak!\" Elfin Stone groaned. Regas opened up the power of an Asura and demonstrated a speed and power that couldn't be endured by even Elfin Stone. However, the disadvantages were that the duration was short and the after effect was large.\n\nRegas's combo reached its peak.\n\n\"This is the last one!\"\n\nKwajak! Kwajajajak!\n\n> [The 15th combo has been achieved!]\n> \n> [The unique effect of the Asura class is activated, dealing 100,000 fixed damage to the target and reducing defense and recovery by 50% for 5 minutes. In addition, Lightning Spear is used.]\n\nPuoook!\n\n\"Kuaaaaak!\" Elfin Stone's scream tore through the chamber. Ninety percent of Elfin Stone's total screams occurred today. He was pierced by the lightning spear that fell from the sky and finally sat down. Lightning Spear. The Asura's ultimate move that disabled the target for 1.5 seconds.\n\n\"Heok... P-Please...\" Regas's voice was weak.\n\nFlop!\n\nThe drained Regas collapsed. He consumed a large amount of stamina at once, so he wouldn't be able to move for three seconds. It was up to his companions to fill this gap.\n\n\"Mach Spear!\" Pon roared.\n\n\"Draw Sword, Blow.\" Peak Sword's blade sang.\n\n\"Phoenix Arrow!\" Jishuka's bowstring thrummed.\n\n\"Black Winds!\" Zednos conjured the storm.\n\nThe party members' ultimate moves poured out. Elfin Stone tried to turn to smoke, but Lifael's Spear was the problem. He was forced to allow the attacks.\n\n\"Good!\" Grid smiled with satisfaction and started his sword dance. Thanks to the party members, Elfin Stone's health had fallen to 45%, so Grid would use Linked Kill to ensure their victory. However, something unexpected happened.\n\n\"You dare...! You dare!!!\" Elfin Stone's voice shook the walls.\n\nCertain bosses became stronger once health fell to a certain level, and Elfin Stone was one of them.\n\nPuhahahak!\n\nMagic power stretched out around Elfin Stone and dominated the land. Blood Field, which Grid had previously blocked, was instantly used.\n\n> [Vampire Earl, Elfin Stone has opened up his real power. All of Elfin Stone's stats will rise and his recovery ability will increase by 300%.]\n> \n> [Your blood is influenced by Blood Field.]\n> \n> [153 health will be transferred to Earl Elfin Stone per second.]\n> \n> [All healing effects will be reduced by 80%.]\n\nThe Overgeared members felt desperate as the notification window appeared before them.\n\n\"I will eat all of you.\" Elfin Stone got up. His red eyes were tinged with black. The feeling of intimidation was incomparable.\n\n\"...Now how should we defeat him?\" The Overgeared members were lost. They weren't sure how to deal with Elfin Stone, who had all his stats increased by Blood Field. As everyone was feeling desperate...\n\n\"Don't you know that I have a hidden power as well?\" Grid spoke.\n\nElfin Stone and the Overgeared members focused on him.\n\n*A hidden power?*\n\nElfin Stone tensed.\n\n*Truly God Grid!*\n\n*He had a trump card!*\n\nThe Overgeared members felt relief wash over them. As everyone's attention was fixed on him, Grid shouted.\n\n\"Item! Combi!! Nation!!!\"\n\n\"...?\"\n\nWas it a cool animation like the transformation robots that were popular in his grandfather's generation? No, it was...\n\nTtang! Ttang!\n\nGrid took out a hammer and anvil. He squatted down and started to hammer. Honestly, it was ludicrous behavior.\n\n\"This person has become crazy from fear.\" The previously tense Elfin Stone ridiculed Grid.\n\nThe Overgeared members felt embarrassed."
}