{
  "id": 299,
  "title": "Chapter 299",
  "content": "# Chapter 299\n\nThe entire raid hinged on preventing Blood Field. That plan had just collapsed. Elfin Stone had unleashed his true power, and the crimson domain now saturated the battlefield. Their chances of success plummeted. If they couldn't kill Elfin Stone in the next three minutes, annihilation was inevitable.\n\n*I need more power.*\n\nNo time for hesitation. Grid yanked two accessories from his inventory.\n\n**Dark Bus' Ring**  \n**Rating:** Unique  \n**Durability:** 15/15\n\n*A ring worn by the 7th Yatan Servant, Dark Bus. The wearer's mana is constantly consumed, and the dispel function depends on this.*\n\n* 50 mana per second will be consumed. When 5,000 mana has been consumed, you can use Skill Deletion twice within 10 minutes.\n* If you consume 5,000+ mana but fail to use Skill Deletion twice within 10 minutes, the ring will overload and explode. The wearer will suffer critical damage and the ring is permanently destroyed.\n* If you fail to consume 5,000 mana within 3 minutes of equipping, the ring disappears.\n* Skill Deletion activates only when the hand wearing the ring physically touches the target skill.\n* Skill Deletion does not apply to passive or continuous effect skills.\n\n**User Restriction:** Level 300 or higher.  \n**Weight:** 0.1\n\nA thin black band. Brutal restrictions. Tricky conditions. Especially problematic considering Grid's total mana barely exceeded 4,000. To use Dark Bus' Ring properly, he'd need to chug potions and burn skills systematically. It hurt in every conceivable way.\n\n*But the performance is undeniable.*\n\nHe'd mastered its use during the Kamiyan raid. Grid slipped the ring onto his finger and retrieved a second item.\n\n**<span class=\"rarity-legendary\">Dark Bus' Earrings</span>**  \n**Rating:** Legendary  \n**Durability:** 55/55\n\n*Earrings worn by the 7th Yatan Servant, Dark Bus. A conduit to summon great demons, imbued with potent black magic. Contains enough malevolent power to control the body and mind of the wearer.*\n\n* The skill 'Blackening' can be used once every 12 hours.\n* Maximum duration: 5 minutes.\n* Frequent use of Blackening risks awakening you as a non-human being.\n\n**User Restriction:** Level 300 or higher. Must possess a reserve of black magic power.  \n**Weight:** 0.1\n\nSimpler requirements than the ring. Far more dangerous.\n\n*Doesn't matter.*\n\nIf not now, when? Grid fastened the earrings without hesitation. Then he activated the new skill he'd acquired at Level 300.\n\n\"Item Combination!\"\n\nHe'd expected something cinematic. Dramatic music swelling in the background. Two items fusing together in a blaze of special effects.\n\nReality was a ditch.\n\n> [Take out your hammer and anvil.]\n\nThe notification flashed. His body moved on autopilot, retrieving the tools.\n\n> [Place the two items to be combined on the anvil.]\n\n\"What?\"\n\nComplete automation. Grid stared, baffled. No time to waste, though. He followed the system's commands, placing <span class=\"rarity-legendary\">Lifael's Spear</span> and **+9 Failure** atop the metal surface.\n\n> [Begin combining Lifael's Spear and Failure.]\n\n*Ttang! Ttang!*\n\nHis arms swung independently. Hammer striking metal. Over and over. Item Combination was a forced-motion skill.\n\n*I look like an idiot.*\n\nSquatting mid-battle? Hammering away like some deranged blacksmith? Grid cursed internally.\n\n\"This person has gone mad from fear.\"\n\nElfin Stone's voice dripped with contempt. Even the party members stared with something approaching pity. Grid's face burned with embarrassment.\n\n> [Analyzing time required for combination. Please wait.]\n\n> [...3]\n\n> [...2]\n\n> [...1]\n\n> *Ttiring~*\n\n> [Analysis complete! Total combination time: 43 seconds.]\n\n> [Continue hammering for 43 seconds.]\n\n*You've got to be kidding me.*\n\nCold sweat beaded on Grid's neck. Forty-three seconds of forced animation during a boss fight? He was a sitting duck. And not just any boss—Elfin Stone was the strongest vampire they'd ever faced.\n\n*This is bad.*\n\nHis party's voices crackled through the mental link.\n\n*{What are you doing? Why are you hammering during combat? Did you hit your head?}*\n\nJishuka's tone wavered between concern and bewilderment.\n\n*{Grid, I know the situation is desperate, but you need to stay calm. Act rationally.}*\n\nThey thought he'd snapped. Grid forced the explanation through gritted teeth.\n\n*{It's a new skill. Forced animation. I need 40 seconds. Buy me time.}*\n\nSilence.\n\nA skill with mandatory motions? Forty seconds of vulnerability? It sounded absurd. But Grid had no reason to lie. The Overgeared members turned their attention to Elfin Stone.\n\nThe vampire earl watched Grid with narrowed eyes.\n\n\"Suspicious.\"\n\nEvery hammer strike sent ripples of power through the blue greatsword and golden spear. Light flared. Energy crackled. Elfin Stone tensed.\n\n\"I don't know what you're attempting, but I won't allow it.\"\n\n*Kururung.*\n\nMagic coalesced across the blood-soaked ground. The prelude to Blood Wave, a spell linked directly to Blood Field's domain.\n\n\"Protect Grid!\"\n\nThe earth cracked. Waves of crimson magic surged toward the crouching blacksmith. Zednos threw himself forward.\n\n\"Do you think you can stop me?\"\n\nElfin Stone radiated arrogance. With Blood Field active, he was invincible. His confidence materialized in the form of devastating magic.\n\n*Kwa kwa kwa kwang!*\n\nRed torrents erupted from the fissures, flooding toward the Overgeared members. Vantner activated Thousand Shields. Zednos conjured Wind Curtain. Both skills boasted exceptional magic resistance.\n\nNeither was enough.\n\n*Pepeng!*\n\n*Kwa kwa kwa kwang!*\n\n\"Aagh!\"\n\n\"I'm going to die!\"\n\nThousand Shields shattered like glass. Wind Curtain scattered like mist. Vantner and Zednos took the full brunt of Blood Wave and crumpled. The crimson flood continued its inexorable advance.\n\nStraight at Grid.\n\nPeak Sword lunged into its path.\n\n\"Draw Sword, Annihilate.\"\n\n*Seokeok!*\n\nSteel sang. Light cleaved through the magical torrent. Vantner and Zednos' sacrifice had weakened Blood Wave just enough.\n\n\"Got it! Huh?\"\n\nHe'd protected God Grid! Peak Sword's triumphant grin twisted into a grimace.\n\nRed thorns burst from the ground, piercing both thighs.\n\n\"Dammit!\"\n\nHis movement speed plummeted. Elfin Stone glided past.\n\n\"You bastard!\"\n\nPeak Sword's hand flew to his sheath again.\n\n> [You have suffered 9,980 damage.]\n\n\"Guaaaah!\"\n\nPain and notification arrived simultaneously. He hadn't even seen Iyarugt move.\n\n\"Kneel before your superior.\"\n\nElfin Stone didn't spare Peak Sword another glance. He stepped over the fallen swordsman, eyes locked on Grid. Grid checked the timer without looking up.\n\n> [27]\n\n*Should I cancel it?*\n\nNo. Too late to abort now. He had to trust his teammates.\n\n\"Not another step.\"\n\nPon and Regas blocked the vampire's path.\n\n*Pepeng!*\n\n*Pepepepeok!*\n\nSpear and fists converged on Elfin Stone. But Lifael's Spear no longer pinned him in place. The vampire's body scattered into smoke.\n\n\"Learn your place.\"\n\n*Sususuk.*\n\nMist reformed behind them.\n\n\"Ghost!\"\n\nPon and Regas spun, weapons raised. Iyarugt was faster.\n\n*Seokeok!*\n\n\"Gah!\"\n\n\"Nngh!\"\n\nThe crimson blade carved through both chests. Massive damage. They scrambled for health potions, but Blood Field's aura reduced healing effectiveness to 20%.\n\n*Pahat!*\n\nFaker materialized behind Elfin Stone as the vampire moved to finish his prey. Faker's surprise attacks had been effective before. Not anymore. Against a fully empowered Elfin Stone, speed and stealth meant nothing.\n\n\"Blood Tornado.\"\n\n*Kwa kwa kwa kwang!*\n\nCrimson winds erupted around the vampire's body. Faker couldn't close the distance. The gale hurled him backward like a ragdoll.\n\n\"Too strong.\"\n\nJishuka's teeth dug into her lower lip. Arrows flew to cover her retreating teammates, but the gap was too wide. She had no idea how to hurt him.\n\n\"Kuhahahaha!\"\n\nElfin Stone laughed. A fish returned to water. Intoxicated by his dominance over the humans who'd dared threaten him.\n\n\"Now! Only two of you remain!\"\n\nGrid, still hammering. Jishuka, still guarding him. Elfin Stone's gaze fixed on both targets. Around him, the Overgeared members lay broken. Blood Field drained their health in a relentless pulse. They'd be dead within a minute.\n\n\"I'll feast until I'm satisfied!\"\n\n*Teoong!*\n\nThe vampire launched forward, covering the distance in an instant. Jishuka triggered Multi-shot and Dancing Arrows, desperate to slow his momentum.\n\nFutile.\n\n*Seokeok!*\n\nBlood sprayed from Jishuka's shoulder. Elfin Stone reached Grid.\n\n\"Iyarugt!\"\n\n*Kiing!*\n\nThe crimson sword responded to its master's call. The blade's edge gleamed with supernatural sharpness, angled to pierce straight through Grid's armor.\n\n\"This ends now!\"\n\n*Ttang! Ttang!*\n\nGrid kept hammering. Iyarugt descended toward his exposed neck. The Overgeared members squeezed their eyes shut.\n\n*It's over.*\n\nThey didn't know what Grid's new skill did, but it had taken too long. The raid was finished. Despair settled over the fallen party.\n\nElfin Stone's face split into a victorious grin.\n\n> [Items successfully combined!]\n\nThe notification Grid had been waiting for materialized. His lips curved upward.\n\n\"Blackening.\"\n\n*Kuwaaaang!*\n\nBlack magic detonated.\n\n*What is this power?!*\n\nElfin Stone's eyes widened in shock.\n\n*Peeeeeong!*\n\nA gold-and-blue greatsword collided with Iyarugt. The earth trembled. When the blood cleared, it was Elfin Stone who bled.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}