{
  "id": 3,
  "title": "Chapter 3",
  "content": "# Chapter 3\n\nLim Cheolho was the architect of the virtual reality system. Thirty-three scientists built the framework, but he'd been the one to give it a heartbeat. Later, he founded the S.A. Group and birthed Satisfy into the world.\n\nThe media had dubbed him many things over the years: *the one with the knowledge of a god, the creator of the virtual reality system, the man who changed the world, the father of Satisfy.* He was the wealthiest person in South Korea and one of the most influential figures alive. Dozens of countries offered him citizenship every year. He was the pride of his nation.\n\nHis countless titles meant cameras followed him at every international summit. Presidents courted his favor. The world watched his every move.\n\nThe reality was far less glamorous. As head of both Satisfy's development team and the S.A. Group itself, Lim Cheolho averaged less than four hours of sleep per night. His back ached constantly. His eyes burned from staring at screens. But unhappy? No. He'd chosen this life willingly. Satisfy had captured the hearts of two billion people, and that filled him with a pride that bordered on obsession.\n\nThe phone shattered what little sleep he'd managed.\n\nLim Cheolho cracked one eye open. The clock read 2:50 a.m. He'd collapsed into bed twenty minutes ago. A month of accumulated exhaustion pressed down on his skull like a vice, crushing coherent thought.\n\nHe snatched the phone. \"What is it?\" His voice came out sharper than intended.\n\nThe urgent voice on the other end snapped him fully awake.\n\n\"I'm coming now.\" He was already moving, throwing off blankets. \"Have the report ready the moment I walk through the door.\"\n\nHe dressed in yesterday's clothes and took the elevator down to his underground garage. Limited edition vehicles lined the space in neat rows, organized by manufacturer and type. Lim Cheolho climbed into a sports car with butterfly doors and gunned the engine.\n\n***\n\n\"What happened?\"\n\nLim Cheolho burst through the doors of Satisfy's Operations Office, still catching his breath. Yoon Nahee, the operations team leader, bowed and adjusted her orange horn-rimmed glasses.\n\n\"Five minutes ago.\"\n\n\"Show me.\"\n\nThe excitement in Lim Cheolho's voice was palpable. He dropped into a chair, and Yoon Nahee gestured toward the massive monitor dominating one wall. The video began to play.\n\nA level 73 warrior appeared on screen. An Asian youth navigating the northern edge of an island. Finding a cave. Inside, his hand closed around something precious.\n\n*Pagma's Rare Book.*\n\nHe used it.\n\nA staff member placed two documents in Lim Cheolho's lap. He scanned them, rubbing his chin.\n\n\"Completely ordinary.\" He looked up at the screen. \"Both in reality and in-game. No exceptional traits. After entering Satisfy, he demonstrated a severe lack of self-control that resulted in... this. The lowest quality of life I've seen in a user profile.\" He tapped the document. \"So how did someone like this find the North End Cave? A location concealed by one of our most complex algorithms?\"\n\nAccording to Morpheus, their supercomputer's projections, that cave wasn't supposed to be discovered for another year and ten months. The appearance of Pagma's Rare Book had been scheduled accordingly.\n\nOne man had shattered their timeline.\n\nFewer than a hundred users had completed their second class advancement. Now there was a sole legendary class holder, and he was *this* person.\n\nLim Cheolho leaned forward, fascinated.\n\nYoon Nahee's expression remained skeptical. \"It was merely coincidence. Obsession leading to a lucky break.\"\n\n\"Explain.\"\n\nShe pulled up additional data. \"The user's name is Shin Youngwoo. In-game designation: Grid. He spent an entire year in a single city. Accumulated over 8,000 reputation there while his intelligence stat languished below 50.\"\n\nLim Cheolho nodded slowly.\n\n\"That combination satisfied the activation requirements for Earl Ashur's secret quest.\" Yoon Nahee continued. \"Then he spent three months exploring zones populated by monsters over level 200. He was barely level 80. He died repeatedly but never gave up.\"\n\n\"And the cave?\"\n\n\"He found the quest item. Got greedy.\" A thin smile. \"Logged out to protect it. That decision triggered the linked quest requirements for possessing the legendary book.\"\n\nLim Cheolho exhaled. There were multiple paths to activate that quest chain, but logging out at that specific moment was the most extreme option. The algorithm had accounted for it, but assigned it a negligible probability.\n\n*Coincidence and stubbornness,* as Yoon Nahee said. Yet this young man had proven that coincidences, stacked high enough, could transform into something else entirely. Luck, perhaps. Or destiny.\n\n*Luck and persistence are abilities too.*\n\nYoon Nahee glanced at her tablet. \"How does the minus level work?\"\n\nLim Cheolho's eyes sparkled. \"That's also part of his cascade of fortune.\"\n\n\"Fortune?\" One eyebrow rose. \"You're a scientist.\"\n\nHe laughed and accepted a cup of coffee from a nearby staff member. The aroma helped clear his mind.\n\n\"Users below level 10 receive beginner protection. Death doesn't reduce their experience. They can't lose levels.\" He sipped the coffee. \"However, there's a hidden override. Quest failure penalties supersede beginner protection. Always have. But the system was designed so that beginners would never encounter quests with level reduction penalties. It was meant to remain theoretical.\"\n\nHe set the cup down.\n\n\"Morpheus predicted that anyone receiving 'Earl Ashur's Secret Request' would be minimum level 350. At that tier, they'd have the skills to clear 'Earl Ashur's Anger' and become Pagma's Descendant without failing. They'd never trigger the penalty.\" His grin widened. \"Only this young man was weak enough, reckless enough, to expose the hidden system.\"\n\nYoon Nahee's expression shifted as understanding dawned.\n\nGrid had logged out from desperation, clinging to his prize. The penalty came down hard when he failed the subsequent quest. He'd been level 1 at the time. The system forced him down two levels.\n\nLevel minus one.\n\nBeginner protection prevented experience loss from death, but quest penalties were absolute. Grid had fallen through the floor of the leveling system into unprecedented territory.\n\n\"Then...\" Yoon Nahee spoke carefully. \"A minus level user gains experience normally?\"\n\n\"Correct.\"\n\n\"And earns stat points for each level?\"\n\nLim Cheolho nodded. \"He's currently level negative one. He'll need to gain two levels to reach level 1. That means 20 stat points before he's technically 'started.'\"\n\nThe implications hung in the air.\n\n\"His base stats will be 20 points higher than any equivalent character.\" Yoon Nahee's jaw tightened. \"Permanently.\"\n\n\"Exactly. A benefit impossible to obtain any other way. This young man is *lucky*.\"\n\nSeveral employees exchanged worried glances. Yoon Nahee leaned forward. \"A legendary class appeared two years ahead of schedule. Legendary classes are already overpowered by design. If he also has a 20-stat-point advantage...\" She paused. \"Won't this break game balance?\"\n\nLim Cheolho slid the documents toward her.\n\n\"Look at this graph. His leveling speed is abysmal relative to time invested. He stayed in one city for a full year. Never explored. Never sought better hunting grounds or quests.\" He tapped the page. \"He lacks the talent of our rankers. No need to worry.\"\n\n\"Are you certain? To other users, even a mediocre legendary class will appear special.\"\n\n\"What would you have me do?\" Lim Cheolho spread his hands. \"We have a strict non-interference policy. The game must run itself. Besides, consider this. An ordinary user obtained it, not a ranker. Isn't that preferable? And Pagma's Descendant is relatively weak in direct combat compared to other legendary classes...\"\n\nHis eyes returned to the monitor. Something on screen made him freeze mid-sentence.\n\nYoon Nahee studied his face. \"Chairman?\"\n\n\"It's nothing.\" He shook his head and rose. \"I should go. You've all endured too many late nights recently. I'll arrange bonuses. Bear with it a little longer.\"\n\nExcited murmurs rippled through the staff at the word 'bonus.' Lim Cheolho smiled and headed for the door.\n\n*What was that?*\n\nYoon Nahee remained silent as her colleagues celebrated. She'd caught the flicker of surprise on Lim Cheolho's face. Something had unsettled him.\n\nIn the elevator, alone, Lim Cheolho's expression shifted. He muttered the name under his breath.\n\n\"Shin Youngwoo.\"\n\n***\n\nI'd been expelled from Patrian, which meant I lost my designated respawn point. The system resurrected me at the temple nearest to my death location.\n\nA temple, sure. A temple to Yatan, God of Darkness.\n\nDark energy clung to every surface of the chamber. Black-robed magicians shuffled past with hollow expressions. A crowd surrounded an altar, shouting and beating their chests. Their chanting echoed off stone walls.\n\n*Kiyaaaaak!*\n\nA woman's scream tore through the floor. It came from somewhere below.\n\nI swallowed hard. \"Well. It's nothing compared to actual military service.\"\n\nThe barracks had been worse. Probably. The oppressive atmosphere here would've sent female users fleeing, but I'd survived conscription. Horror movie aesthetics couldn't touch me.\n\nMy hands still shook when I opened the menu.\n\n\"S-Status window.\"\n\nI forced the words out steady. Ignored the cultists. Focused on the translucent display that materialized before me.\n\n***\n\n> **[Status Window]**\n> \n> **Name:** Grid  \n> **Level:** -1 (0/20)  \n> **Class:** Pagma's Descendant  \n> \n> *The probability of adding additional options when making items will increase.*  \n> *The probability of item enhancement will increase.*  \n> *All equipment items can be worn unconditionally. However, there is a penalty depending on the item's rating.*\n> \n> **Title:** One who Became a Legend  \n> *Abnormal conditions don't work well on you.*  \n> *You won't die when health is at the minimum.*  \n> *Easily acknowledged.*\n> \n> **Health:** 14/14  \n> **Mana:** 3/3\n> \n> **Strength:** 1  \n> **Stamina:** 1  \n> **Agility:** 1  \n> **Intelligence:** 1  \n> **Dexterity:** 1  \n> **Composure:** 1  \n> **Indomitable:** 1  \n> **Dignity:** 1  \n> **Insight:** 1\n> \n> **Stat Points:** 0\n> \n> **Weight:** 3,035/20\n> \n> *The weight limit exceeds 200%, so movement speed is reduced by 100%. The body is heavy and cannot exert any power properly. The probability of receiving the 'weakened' state has become extremely high.*\n\n***\n\nEmotions crashed through me in waves.\n\n*Minus one. I'm minus level one.*\n\nI couldn't wrap my head around it. My stats were so pathetic a rabbit could kill me. Pure, incandescent rage bubbled up from somewhere deep in my chest.\n\nBut then my eyes tracked back to the title. The class description.\n\nThe special functions.\n\n*Wait.*\n\nThe anger didn't disappear. It transformed into something else. Something sharper.\n\n*This might actually be worth it.*"
}