{
  "id": 30,
  "title": "Chapter 30",
  "content": "# Chapter 30\n\n*What?*\n\nYoungwoo watched his mother's reaction, a familiar sinking feeling settling in his gut. He slumped in his chair.\n\n\"Mother, why are you laughing? I'm serious about getting a girlfriend.\"\n\nHis mother waved her hand dismissively, unable to contain herself.\n\n\"Hohohoho! It's just... my son, twenty-six years old, never once dated, and now he's so confident about it.\" She clutched her stomach, tears forming at the corners of her eyes. \"You're my child, but honestly, you're something else. Hohohoho!\"\n\nYoungwoo's jaw clenched. *This is ridiculous.*\n\nHe turned to his father, hoping for backup. Instead, the older man set down his chopsticks and shook his head slowly.\n\n\"Son, focus on next year. But before that...\" His father ticked off points on his fingers. \"First, pay off your debt. What woman would look at you with that hanging over your head? I know you're feeling good right now, but confidence doesn't pay bills. Until you sort yourself out, maybe put the dating thing on hold.\"\n\nThe warmth Youngwoo had felt that morning evaporated. He gripped the edge of the table.\n\n\"You're both too much! There are *reasons* I haven't dated yet. And it's not the debt.\" Heat crept up his neck. \"It's you two! If you'd made me look like a movie star, I'd have a girlfriend by now. But no, I got stuck with your genetics, and girls don't give me a second glance.\"\n\nHis mother stopped laughing. Her expression shifted to something between exasperation and pity.\n\n\"Now you're blaming us for how you were born? Look at your sister. Same parents, same belly, and Sehee turned out beautiful. You were a cute baby too, you know.\"\n\nHis father snorted. \"Appearance isn't everything. It's personality that matters.\" He gave Youngwoo a long look. \"And the more I see, the more I understand why you're struggling.\"\n\n\"Ugh...\"\n\n*Am I adopted? Is that it?*\n\nThe thought wasn't new. Youngwoo had entertained it before, during particularly brutal family roasts. *They said I was a beautiful baby, but maybe they just found me somewhere. Maybe my real parents are out there, wondering...*\n\nHe checked his watch. The spiral of self-pity would have to wait.\n\n*No time for this. Work starts soon.*\n\nYoungwoo straightened up and grabbed a piece of toast, forcing his voice into something resembling calm.\n\n\"Father, how's Grandfather these days? Is he doing well?\"\n\nHis father's eyebrows rose. \"Why the sudden interest?\"\n\n\"There's an old blacksmith NPC in the game. Reminded me of him.\"\n\n*Here it comes. He's going to yell about the game again. Maybe even hit me...*\n\nBut his father simply grunted, his tone flat. \"If you're thinking about him, come along next month when I visit. You haven't seen him in a year. You should be ashamed.\"\n\nThe comment hit harder than expected. Every holiday for the past seven years, the family had made the trip to Grandfather's house. After Grandmother passed, it became a ritual. His parents had begged the old man to move in with them, but he'd refused every time.\n\n*Too proud. Didn't want to be a burden.*\n\nYoungwoo had loved those visits as a kid. Even last year, he'd gone without complaint. But then Satisfy launched, and suddenly the hours-long trip felt like a waste of gaming time.\n\n*I'm a terrible grandson.*\n\nKhan's loneliness flickered through his mind. The way the old blacksmith's hands shook when he talked about his son. How his voice cracked.\n\n*Is Grandfather like that? Sitting alone, waiting?*\n\n\"I ate well.\"\n\nYoungwoo pushed back from the table and grabbed his jacket. The walk to work passed in a blur of cigarette smoke and regret. By the time he reached the office, his coworkers had already turned the break room into a haze.\n\n*Why do people waste money on these things? If I had what they spend on cigarettes...*\n\nHe swallowed the complaint and found his desk. The smell of tobacco wormed into his sinuses, triggering the start of a headache.\n\n*Just a little longer. Once the item manufacturing gets going, I'm done with this place. I'll make enough money selling gear to quit. Satisfy will be my job. All day in the capsule, no more nagging, no more smoke.*\n\n*But first, I have to beat the Mero Company.*\n\nHe pulled out his phone, pretending to check messages while his mind raced.\n\n*Khan's smithy is the foundation. I win this game, I protect the smithy, I build from there.*\n\n*I can't lose.*\n\n***\n\n**Mero Company – Winston Branch**\n\nValmont wasn't in a good mood. The apple in his hand had lost its appeal three bites ago, but he kept gnawing at it anyway, eyes fixed on Rabbit.\n\n\"Explain to me why you did something so stupid.\"\n\nRabbit stood with perfect posture, hands clasped behind his back. He didn't flinch.\n\n\"A production game? Over a *smithy*?\" Valmont tossed the apple from hand to hand. \"I don't understand your thinking here.\"\n\nHe stopped tossing. The apple hovered in his palm.\n\n\"Khan can't pay us back. That means the smithy becomes collateral. Khan doesn't have the resources to clear the debt, so the smithy ends up ours. It's simple math. Just a matter of time.\" Valmont's fingers tightened around the fruit. \"I sent you to speed up the process, not complicate it. Have you forgotten your job?\"\n\n**Bam!**\n\nThe apple exploded against the wall. Chunks of white flesh and juice splattered across Rabbit's face and shoulder. The administrator reached into his pocket, withdrew a handkerchief, and calmly wiped himself clean.\n\nValmont's breathing grew heavier. \"Why give Khan hope with a pointless bet? You opened a door for him to keep the smithy. Did he bribe you? Is that it?\"\n\nTrust didn't come easily to Valmont. Rabbit had been the exception, the one person he'd relied on without reservation. That made this betrayal sting worse.\n\nRabbit folded the soiled handkerchief and tucked it away. His voice remained level.\n\n\"Our main base is Winston. Unfortunately, Winston's residents view the Mero Company as an enemy. If we want long-term business growth here, we need to change that perception. People support what they trust. Right now, they think we stole from them. That resentment won't fade easily.\"\n\n\"*Stole?*\" Valmont spat the word. \"Sophistry! Their land was worthless. I paid fair market value, legally. They were *happy* to sell. Now prices go up and suddenly I'm the villain? They're the treacherous ones!\"\n\n\"If you'd shared some of the profits, invested in community improvements, their attitude would be different. They'd appreciate what the company provides and contribute to its development.\"\n\n\"So this is *my* fault?\" Valmont's face flushed. \"I did all the work and they still hate me!\"\n\n\"My master used to say, 'Don't look at the backs of people. Follow the money.'\" Rabbit's tone didn't waver. \"I disagree. Win hearts first. The money follows naturally. People grateful to the Mero Company become loyal customers.\"\n\nValmont's hand shot out, finger jabbing toward Rabbit's chest. \"Don't lecture me! Do I look like some child you need to educate? Just do what I tell you.\" He lowered his hand. \"And stop with the philosophy. Get to the point. Why did you make that idiotic bet with Khan?\"\n\n*This is Valmont's limit. The company won't grow beyond this with him at the helm.*\n\nRabbit had seen it coming. When Valmont was younger, hungry, he'd listened to advice. He'd been strategic. But success bred arrogance, and arrogance bred deaf ears.\n\n*Once this business concludes, I'm leaving.*\n\nThe decision settled in his mind like a stone. For now, though, he had a role to play.\n\n\"Khan holds significant influence in Winston. Many residents see him as the hero standing against us. If we seize his smithy through underhanded means, the backlash will be severe. They'll organize, sabotage our operations, damage the company's interests.\"\n\nValmont's expression shifted. He was listening now.\n\n\"The production game lets me reframe the narrative,\" Rabbit continued. \"Residents will ask themselves why we'd give Khan a chance if we could just take the smithy. Then we announce, 'We recognized Khan's skill and wanted to be fair.' Suddenly, the Mero Company isn't a monster. We're a potential ally. The population's perception shifts. We're not just money-hungry. We care about people.\"\n\n\"And that gives us... loyal customers.\"\n\n\"Exactly.\"\n\nValmont crossed his arms, jaw working. He wasn't fully convinced, but the game was already in motion. No point stopping it now.\n\n\"If you hire a good blacksmith, we win?\"\n\n\"Correct.\"\n\n\"And the opponent isn't Khan?\"\n\n\"My research indicates it's a young man with such a poor reputation, I question whether he's actually a blacksmith at all.\"\n\n\"Fine. Hire the best. Don't worry about the cost.\"\n\nWhatever Valmont's flaws, indecisiveness wasn't one of them. The ability to make quick calls had gotten him this far, turned him into the master of a thriving enterprise.\n\nRabbit allowed himself a small smile. \"I've already found someone.\"\n\nKhan wasn't foolish enough to trust the game to an amateur. That meant this Grid person might pose a threat. But when Rabbit had investigated, all he'd found was inexperience and failure. No cause for alarm.\n\nStill...\n\n*I can't be careless.*\n\nCaution was second nature to Rabbit. Every task deserved thorough preparation. He'd hire the best blacksmith available, ensure victory beyond doubt.\n\n*No room for error.*"
}