{
  "id": 300,
  "title": "Chapter 300",
  "content": "# Chapter 300\n\n> [The items have successfully combined!]\n>\n> [<span class=\"rarity-legendary\">(Combination) Failure + Lifael's Spear</span>]\n>\n> Rating: Legendary (Transcendent)\n> Durability: Infinite\n> Attack Power: 1,100~2,390 \n> Defense: 100\n>\n> * **Agility +100**\n> * **Divine Power +400**\n> * Fixed damage of **+2,200** on each attack.\n> * There is a certain probability of activating the **'Light Wheel'** skill.\n> * **Attack power +30%** against those with black magic power.\n> * There is a certain probability of blocking the enemy's attacks.\n> * There is a high probability of activating the **'5 Joint Attacks'** skill.\n> * The skill **'Bisect'** will be generated.\n> * There will be a fear effect if the enemy is more than 15 levels lower than the user.\n> * **Attack power +30%** in dark places.\n>\n> A weapon that maximizes the merits of the legendary rated <span class=\"rarity-legendary\">Failure</span> and <span class=\"rarity-legendary\">Lifael's Spear (Reproduction)</span> after being combined by the legendary blacksmith G.\n>\n> Conditions of Use: Pagma's Descendant\n>\n> * The combination time is 2 minutes.\n> * This item can't be traded.\n\n*Transcendent legendary.*\n\nGrid's pulse hammered in his ears. The weapon's performance bordered on mythical. Item Combination was proving itself one of Pagma's Descendant's ultimate techniques.\n\n*Two minutes. Only two minutes.*\n\nThe realization settled like ice in his gut. This battle would end within that window. Either Elfin Stone would die, or Grid's party would be annihilated. Blood Field guaranteed nothing less.\n\nGrid wrapped his fingers around the golden hilt. The weapon thrummed against his palm.\n\n\"Blackening.\"\n\nThe word left his lips like a curse.\n\nA violent eruption of black magic tore through the air. Grid's skin blanched white. The whites of his eyes bled to pitch black.\n\n> [Your black magic power has increased.]\n>\n> [You don't have any black magic power. It will be replaced with demonic power.]\n>\n> [While Blackening is activated, your species will change to half-demon.]\n>\n> [As a half demon, your maximum health is reduced by 50%. Your attack power, magic power and agility will increase by 20% each.]\n>\n> [All attacks will be converted to the black magic attribute.]\n\nPower flooded Grid's veins. His muscles coiled with strength far beyond their normal limits. But something was wrong. His heart rate spiked. A spike of agony drove through his skull. Each breath scraped against his lungs.\n\n*What the hell?*\n\n> [Your demonic force and divine power of the weapon oppose each other.]\n>\n> [The divine power of <span class=\"rarity-legendary\">(Combination) Failure + Lifael's Spear</span> has doubled the strength of the demonic power.]\n>\n> [All your attacks will have both demonic and divine power at the same time.]\n>\n> [Whenever you hit a target with an attack, there is a clash between the demonic power and divine power, causing an explosion.]\n>\n> [The demonic power will increase the power of Blackening by devouring the divine power.]\n>\n> [Maximum health will drop by 50%. Your attack power, magic power and agility will increase by 10% each.]\n\n*Idiot. You goddamn idiot.*\n\nHe'd been so desperate for power that he'd ignored the compatibility between Lifael's Spear and Blackening.\n\n\"Ack!\"\n\nThe pain intensified. His vision blurred at the edges. \n\nSteel sang through the air.\n\nIyarugt sliced toward his exposed neck.\n\n*Chaaeng!*\n\nThe small shark-fin blade jutting from Failure's edge caught Iyarugt mid-swing. Grid hadn't moved consciously. The weapon had acted on its own.\n\n> [The option effect of <span class=\"rarity-legendary\">(Combination) Failure + Lifael's Spear</span> has been activated in order to block the enemy's attack.]\n\n*Kwaang!*\n\nDarkness erupted where the two blades met. The force threw both combatants back.\n\n> [You have suffered 5,300 damage.]\n>\n> [You have dealt 15,900 damage to the target.]\n\nDemonic and divine power had collided. Grid's resistances and the Holy Light Armor's magic reduction kept him alive. Elfin Stone, vulnerable to divine power, suffered far worse.\n\nBut the math wasn't in Grid's favor. His maximum health sat at 16,000 points now. That 5,300 damage bit deep. Meanwhile, Elfin Stone still had four million health remaining. The explosion was an inconvenience to him. Nothing more.\n\nElfin Stone didn't know Grid's weakness, though. He'd seen Grid trigger the explosion deliberately. A chill crawled down the vampire's spine.\n\n*Is this really a human?*\n\nThe creature before him wielded both demonic and divine power. Its physical abilities matched a True Blood earl. Transcendent. Aberrant.\n\n\"What the hell is your identity?\" Elfin Stone demanded.\n\nGrid said nothing. He couldn't. The agony in his skull devoured his capacity for speech. He clung to reason by his fingernails.\n\n\"Kuaaaah!\"\n\nThe sound tore from Grid's throat like a beast's roar. He closed the distance. Kill activated.\n\nThe speed was incomparable to before. The damage, monstrous. The attack carried the weight of inevitability.\n\nElfin Stone moved with everything he had. The blade passed a hair's breadth from his chest.\n\n*Dammit!*\n\nSweat slicked Elfin Stone's brow.\n\n*I felt fear.*\n\nHe was a direct descendant of Shizo Beriache. Yet this unknown human made him afraid.\n\n*Unacceptable.*\n\nRage displaced his shock.\n\n*Kwaduduk!*\n\nElfin Stone created distance between them. If their swords clashed, explosions would follow. Magic, then. He'd use magic to avoid the damage.\n\nA fatal miscalculation.\n\nGrid had Pagma's Swordsmanship, Transcend. Ranged attacks meant the explosions would detonate on Elfin Stone alone, sparing Grid from the backlash.\n\n*Pepepepeok!*\n\nExplosions rippled across Elfin Stone's position as energy blades hammered him.\n\n> [You have dealt 15,760 damage to the target.]\n>\n> [You have dealt 16,400 damage to the target.]\n>\n> [Lifael's Spear's option effect is activated, causing the skill **'Light Wheel'** to be generated.]\n>\n> [You have dealt 82,900 damage to the target.]\n>\n> [The option effect of <span class=\"rarity-legendary\">(Combination) Failure + Lifael's Spear</span> is activated, causing the skill **'5 Joint Attacks'** to be generated.]\n>\n> [You have dealt 60,040 damage to the target.]\n\n\"Kuaaaack!\"\n\nElfin Stone's shriek echoed through the city. The relentless bombardment and detonations of black light carried destructive power that even a vampire earl couldn't dismiss.\n\nVantner's jaw had gone slack. \"Wow.\"\n\n\"Really strong,\" Pon muttered.\n\nRegas exhaled slowly. \"It's terrifying.\"\n\nThe Overgeared members stood frozen. They'd seen high-level combat before. They were top twenty rankers themselves. But Grid's attack power existed in a different dimension.\n\n*Maybe... maybe this...*\n\nPon's thoughts drifted to a past encounter. Kraugel. The memory of that overwhelming strength. At this moment, wasn't Grid comparable?\n\n\"Shit! Shitt!\"\n\nElfin Stone's curses shattered Pon's reflection. The vampire couldn't transform to smoke. The divine power in Grid's attacks prevented it. Blood Shield couldn't fully absorb the explosion damage.\n\n*Moving back was a mistake!*\n\nThe realization struck too late. Elfin Stone shifted his stance. Defense was meaningless. He'd meet Grid's force with his own. Pride demanded it. Wisdom agreed.\n\n*Kuwooooh!*\n\nElfin Stone's scattered blood coalesced. The crimson liquid reshaped itself into a spear and launched toward Grid.\n\n\"Heart Seeker!\"\n\n*Peeeeeong!*\n\nHeart Seeker was targeted magic. It never missed. A guaranteed kill. The skill surpassed even Extreme Blood Transfusion in raw power, but Elfin Stone rarely used it because it consumed his health. That he deployed it now meant he'd acknowledged Grid's strength.\n\n*Kiiiing.*\n\nAbsolute authority given form. The blood spear punched straight through Grid's bombardment, through Transcend and Blacksmith's Rage alike.\n\n*Puoook!*\n\n\"Grid!\"\n\nThe Overgeared members' faces drained of color. Grid failed to react. The spear pierced his heart.\n\n\"Cough!\"\n\nBlood poured from Grid's nose and mouth. \n\nElfin Stone pressed forward. \n\n*He survived Extreme Blood Transfusion.*\n\nConfirmation was necessary. Elfin Stone channeled another spell despite the massive health and magic power he'd already spent.\n\n\"Blood Wave!\"\n\n*Kwa kwa kwa kwang!*\n\nBlood Wave surged toward Grid. Elfin Stone's mouth curved into a smile as the spell closed in.\n\n\"Pagma's Swordsmanship...\"\n\nElfin Stone's smile froze.\n\nGrid activated Skill Deletion from Dark Bus' Ring and carved through Blood Wave. He closed the distance. Elfin Stone hurriedly deployed Blood Thorn to intercept. Grid used Link's lateral movements, weaving between most of the thorns erupting from the ground.\n\n\"Damn bastard!\"\n\nElfin Stone fired Blood Laser. Blood magic that pierced through a narrow trajectory. Grid waved his hand. The laser dissipated. He was weaponizing Dark Bus' Ring with terrifying efficiency.\n\n\"This is nonsense!\"\n\nAlarm cracked Elfin Stone's voice. Grid narrowed the gap, his footwork from Kill letting him slip past Iyarugt's guard. He unleashed his strongest skill.\n\n\"Linked Kill.\"\n\n*Kuwooooh!*\n\nBlack and gold light exploded like fireworks.\n\n*Chaaeng!*\n\nElfin Stone raised Iyarugt against the first strike. But the explosion that followed was the real threat.\n\n\"Kuk!\"\n\nElfin Stone staggered. Grid did too. Elfin Stone recovered first. A fraction of a second. In battle, fractions meant everything. Iyarugt lanced toward Grid's heart. Grid's immortal passive had already triggered from Heart Seeker. This was a fatal crisis.\n\n*Not after coming this far.*\n\nGrid refused to surrender. Death was a possibility. Retreat wasn't. He continued Linked Kill. \n\nAnd received his reward.\n\n> [The option effect of <span class=\"rarity-legendary\">(Combination) Failure + Lifael's Spear</span> is activated, causing the skill **'Light Wheel'** to be generated.]\n\nThe skill manifested at the perfect moment. Linked Kill's thrust changed trajectories. Elfin Stone had committed to his attack, exposing himself. The blade found flesh.\n\n> [Critical!]\n>\n> [You have dealt 304,600 damage to the target.]\n\n*Impossible!*\n\nIyarugt transformed its wielder into a swordsmanship master. Yet what was this technique? Elfin Stone reeled from the shock. The third consecutive Linked Kill strike landed.\n\n*Puok!*\n\n> [You have dealt 119,400 damage to the target.]\n\nThe fourth blow followed.\n\n> [You have dealt 122,000 damage to the target.]\n\nThen the fifth.\n\n> [The Holy Light Gloves's option effect is activated, causing the skill **'5 Joint Attacks'** to be generated.]\n>\n> [You have dealt 608,500 damage to the target.]\n\nThe sixth blow crashed home.\n\n> [Critical!]\n>\n> [The Holy Light Gloves's option effect is activated, causing the skill **'5 Joint Attacks'** to be generated.]\n>\n> [Lifael's Spear's option effect is activated, causing the skill **'Light Wheel'** to be generated.]\n>\n> [You have dealt 3,054,900 damage to the target.]\n\nGrid's sword was relentless. Each impact triggered an explosion that also damaged Grid. Doran's Ring and a supreme health potion fought to keep him alive. The recovery couldn't match the incoming damage.\n\n\"Kuk... Kuock!\"\n\nElfin Stone's mind drifted. Leah. His love. Her smile the last time he'd seen her.\n\nHe scattered into black smoke.\n\n> [You have died.]\n\nGrid collapsed. Grey light consumed him.\n\n> [Vampire Earl Elfin Stone is forced to sleep after exhausting all his powers.]\n>\n> [Your party leader Grid has died.]\n>\n> [The Pavranium Expedition has acquired Elfin Stone's Ring.]\n>\n> [The Pavranium Expedition has acquired Iyarugt.]\n>\n> [The Pavranium Expedition has acquired the 4th Piece of ???.]\n>\n> [The Pavranium Expedition has become the first party to capture a vampire city!]\n>\n> [The Pavranium Expedition party members will receive bonus experience points and increased item acquisition rate in all vampire cities for the next month.]\n\nNotification windows flooded Grid's vision. Darkness swallowed them before he could read a single word.\n\n---\n\n**Glossary of Common Korean Terms:**\nOG: Glossary Link.\n\nCurrent schedule: 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}