{
  "id": 301,
  "title": "Chapter 301",
  "content": "# Chapter 301\n\nThe massive screen flickered as Elfin Stone scattered into black smoke. An incredible result.\n\nLim Cheolho stretched out his hand toward Yoon Sangmin and Team Leader Ashley. Both men stood frozen, mouths agape.\n\n\"Come on. Give it to me.\"\n\nThe two pulled out 50,000 won notes with trembling fingers.\n\n\"My allowance...\" Yoon Sangmin groaned.\n\nTeam Leader Ashley clutched his wallet. \"No chicken this week.\"\n\nDespite ranking among South Korea's highest earners, both men lived under the iron rule of strict wives and survived on meager allowances. The lost bet stung.\n\n\"I never should've taken it.\" Yoon Sangmin shook his head. \"I didn't think they had a chance.\"\n\n\"None of us did.\" Team Leader Ashley sighed.\n\nThey'd been convinced Grid's party would fail against Elfin Stone. Lim Cheolho pocketed the bills and leaned back in his chair.\n\n\"Grid won because he blocked the first Blood Field.\" The chairman tapped the screen. \"If that domain had deployed at the start, the Overgeared members wouldn't have lasted five minutes.\"\n\n\"Agreed.\"\n\nGrid's growth accelerated daily. After hitting level 300 and acquiring Item Combination, his combat ability rivaled the specialist legendary classes. Enough to transcend all presumptions. There was good reason Lim Cheolho counted him among the 'five who make miracles.'\n\nYoon Sangmin frowned. \"But Grid... isn't it dangerous? He died in the Blackening state.\"\n\nChairman Lim Cheolho's laugh echoed through the observation room. \"Grid's about to discover a whole new world.\"\n\n\"Sir?\"\n\n\"His activity radius has been too narrow. The Human World, the Eternal Kingdom specifically. It's time he experienced the wider world two billion users enjoy.\" The chairman smiled. \"Besides, it isn't dangerous where he's going. Most residents are friendly. Similar to humans, even.\"\n\n***\n\n> [You have died.]\n\nGrid had died before. Four times to a green slime that even level 5 beginners crushed without effort. But death had become unfamiliar after he'd claimed Pagma's legacy. The last time was with Doran. It had been ages since the struggle with Yura ended in his defeat.\n\nThe old Grid would've trembled at the penalties. Cursed. Raged. Now, different concerns occupied his mind.\n\n*Is everyone okay?*\n\nHe wasn't certain the Elfin Stone raid had succeeded. His consciousness had darkened the moment Linked Kill's fifth strike landed.\n\n\"Status window.\"\n\n**Lv.300 (11.05%)**\n\nA smile crept across Grid's face. When he'd encountered Elfin Stone, his experience gauge had read 0%. If the raid had failed, his level would've dropped. But now it sat at 11%.\n\nWhich meant—\n\n\"We did it.\"\n\nThe death penalty at level 300 consumed 30% experience. Which meant Elfin Stone had granted 41% experience. A massive haul, as expected from a named boss.\n\n*Everyone must be safe.*\n\nRelief flooded through him. Then another thought surfaced.\n\n*Did he drop my pavranium?*\n\nEven if it hadn't dropped, his party would search the city thoroughly. Grid exhaled slowly.\n\n\"In the meantime...\"\n\nDeath had shredded his items' durability. Item Combination had pushed Failure down to 10 points. One more mistake and it would've shattered completely.\n\n*I need repairs.*\n\nGrid turned toward where Khan's smithy should be and froze.\n\n\"Where the hell is this?\"\n\nHis resurrection point was Reidan. The landscape should've been familiar—the sandstone walls, the central spire, the bustling streets. Instead, a small, tranquil village sprawled before him. Twenty ramshackle huts clustered around a central clearing. Grid stood alone in the dirt square.\n\n\"What...?\"\n\nHe pulled up his map. The interface flickered. No marker indicated his position. The entire map remained blank.\n\n\"What the hell?\"\n\nGrid scanned the village. No general store. No NPCs. Just twenty huts, a grove of macaroon trees, and a narrow stream cutting through the settlement.\n\n*No people either.*\n\nHe plucked a macaroon from a low branch. The sweet-sour flesh burst in his mouth as he chewed. Why had he resurrected here instead of Reidan? A bug seemed unlikely. He'd never heard of bugs discovered in Satisfy. The system was too refined, too perfectly managed by Morpheus.\n\n\"Damn it...\"\n\nHis analytical ability failed to process the situation.\n\n*I need to get back to Reidan.*\n\nWhich required knowing his current location. Grid accessed the guild interface.\n\n{Does anyone know my location right now?}\n\n> [You have failed to send a message to the guild. Hell is disconnected from the Human World.]\n\n\"Hell?\"\n\nHell had blue skies? Warm breezes? Shouldn't hell be filled with lava and eternal darkness?\n\n\"Dammit!\"\n\nHis true nature surfaced.\n\n\"This is hell! I actually fell into hell!\"\n\n*If I'd known this would happen, I would've lived better. No—I should've paid more attention to my demonic power stat.*\n\nHe'd slaughtered his way through the Empire, the Vatican, Winston. Grid currently possessed **401 Demonic Power**. High enough to flag the system. High enough to drag him down here when he died.\n\n\"Wait. Who are they?\"\n\nMovement at the village entrance. A group entered through a gap in the crude fence. Strange appearances marked them—horns sprouting from foreheads, purple-tinged skin, eyes with vertical pupils. They didn't radiate power or menace. In fact, they looked remarkably... ordinary.\n\n*Demonkin?*\n\nGrid turned to flee. His items were too damaged for a fight. The demonkin spotted him before he'd taken three steps. Their speed caught him completely off-guard.\n\n*Damn it. I have to fight. But wait—why are demonkin carrying farming tools?*\n\nEach demonkin held rakes, hoes, baskets of harvested plants. Their clothes were dirt-stained and worn. They looked like... Piaro after a hard day's work.\n\nThe lead demonkin tilted his head. \"Who are you?\"\n\n\"A traveler?\" another chimed in. \"Why would a traveler come here?\"\n\nNo hostility colored their voices. No wariness sharpened their gazes. They treated him like... a person.\n\n*The demonkin aren't hostile to humans?*\n\nDoubt crept through Grid's mind. He looked down at his hands. Pale. Bloodless. He checked his arms, his torso. The same unnatural pallor.\n\n*Blackening is still active.*\n\nThat explained it. He remained in half-demon form. The demonkin perceived him as one of their own.\n\nAn elderly demonkin set down a basket overflowing with unfamiliar plants. Warmth filled his wrinkled face.\n\n\"You seem tense, young one.\" The old demonkin gestured toward the huts. \"Don't be nervous. Everyone's curious—it's been nearly a century since we've had a visitor. The journey must've been exhausting. Would you like a meal? As you can see, this is a poor village. We can only offer Atura grass, but you're welcome to share it.\"\n\n\"Grass?\" Grid blinked. \"You eat grass? You don't... eat humans?\"\n\nThe demonkin burst into laughter.\n\n\"This young friend made a funny joke.\"\n\n\"How could we eat humans?\"\n\n\"We're fortunate not to be eaten *by* humans.\"\n\n\"...?\"\n\nTheir perception of humans seemed backwards from everything Grid knew about demons.\n\n*Living in this shabby place... are they weak among demonkin?*\n\nThen Grid tensed. A demonkin called Helmis approached and grasped his wrist.\n\n*Do they know I'm human?*\n\nHelmis examined his hands with keen interest.\n\n\"Looking at these calluses, you're a blacksmith?\" Helmis grinned. \"How interesting. I never knew there was another blacksmith among our kind.\"\n\n*Blacksmith? Among the demonkin?*\n\n*Wait. Could the one who forged Iyarugt have been a demonkin?*\n\n> [Blackening will end in one minute.]\n\nGrid's blood went cold. Blackening hadn't lifted when he died, but it wouldn't last forever.\n\n*If I transform back here...*\n\nThe demonkin seemed genuinely kind. Harmless. But would that kindness extend to a human who'd deceived them? Grid cleared his throat.\n\n\"Do you know the way to the Human World?\"\n\nHopelessness clouded the old demonkin's face.\n\n\"We don't know. Even the great demons can't freely enter the Human World. How could trivial people like us know the path?\"\n\n\"Why would you want to go there?\" A younger demonkin frowned. \"You're acting strange.\"\n\n\"Something's suspicious about this one.\"\n\nThe demonkin began murmuring among themselves, casting sideways glances.\n\n*Did I screw up?*\n\nGrid swallowed hard. Then Noe burst from his pet inventory in a shower of light.\n\n\"Nyang! The smell of home!\"\n\nThe short-legged cat landed gracefully, his tail swishing as he inhaled the familiar scent of hell. His entire body radiated joy. He even appeared to be doing a little shoulder dance.\n\n*Cute.*\n\nGrid wanted to keep watching, but the demonkin's faces had drained of color.\n\n\"A Memphis!\"\n\n\"The best demonic beast of hell!\"\n\nThe stunned demonkin dropped to their knees. A memphis—the most intelligent and mighty servants of the great demons. Objects of worship for common demonkin. Noe finally noticed the prostrated villagers.\n\n\"Ah! Do you see, Master? This body is so great!\"\n\nGrid flicked his ear. \"You only hid when I was fighting Elfin Stone.\"\n\n\"I'm sorry...\" Noe's expression crumbled.\n\nThe demonkin exchanged shocked whispers as they registered Noe's words.\n\n\"Memphis' Master!\"\n\n\"We didn't know who you were! We dared offend you!\"\n\n\"Please, kill us for our disrespect!\"\n\nThese were friendly people who'd offered him a meal despite being demonkin. Grid opened his mouth to reassure them.\n\n> [The duration of Blackening is over.]\n\n> [Your demonic power is sealed. Your species has returned to human.]\n\n> [It is impossible for ordinary humans to enter Hell. You are being expelled.]\n\n\"Wait—!\"\n\nGrid's vision blurred like watercolors in rain. The village dissolved. Then his eyes snapped open at Reidan's resurrection point—the familiar sandstone walls, the central spire rising toward the sky.\n\n{Grid! Are you okay?}\n\n{Why were you marked in an unknown location?}\n\nThe guild chat window exploded with messages. Jishuka and the Pavranium Expedition members were in an uproar. He could feel their worry bleeding through the text.\n\n*The Elfin Stone raid succeeded. Otherwise, they couldn't contact the outside world from inside.*\n\n{Grid! Look, look! These are the items Elfin Stone dropped!}\n\n{Incredible! A growth-type item! We didn't even know these existed!}\n\nGrid's eyes widened. Not because he'd reviewed the shared item stats for <span class=\"rarity-epic\">Elfin Stone's Ring</span> and <span class=\"rarity-legendary\">Iyarugt</span>. Something else had caught his attention.\n\n\"You came.\"\n\n\"Yura?\"\n\nShe stood beside Lauel and the Overgeared members. Her cheeks puffed out in an expression somewhere between annoyance and relief. He'd never seen her make such a cute face before.\n\n*Acting like this because she's pretty. Those pathetic guys.*\n\nBut Grid was smiling too. The power of beauty was truly formidable.\n\n---\n\n**Glossary of Common Korean Terms**\n\n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day."
}