{
  "id": 303,
  "title": "Chapter 303",
  "content": "# Chapter 303\n\n\"Agnus...!\"\n\nJishuka's voice cut through the darkness of the cave.\n\nRanked 6th on the unified rankings after Yura's disappearance. Originally thought to possess an Epic class, the truth was far worse. A hidden growth class. He never appeared in public, but the top rankers knew. Those who'd crossed paths with him at contested hunting grounds understood the threat he posed.\n\n\"Hey, Overgeared noobs.\"\n\nAgnus stood before them. Jishuka, Peak Sword, Pon, Regas, Faker, Vantner, and Zednos. Eight against one. Yet he didn't flinch. Instead, his lips twisted into a mocking smile.\n\n\"I've been hunting that lich for eleven months.\" His voice carried the cold certainty of someone who'd killed before. \"Touch my prey and I'll kill you.\"\n\nVantner's fists clenched. \"You bastard!\" He stepped forward, fury contorting his features. \"Don't make fun of us if you don't want to die!\"\n\nAgnus shrugged, the gesture casual and infuriating. \"Bald Vantner. You're really stupid.\"\n\nRed flooded Vantner's face.\n\n\"I'm not stupid! And this is a **shaved head**, not bald!\" Spittle flew from his mouth as he jabbed a finger toward Agnus. \"You're the one interfering. We found this place first!\"\n\n\"So what?\" Agnus tilted his head. \"Are you actually going to fight that lich?\"\n\n\"Why not?\"\n\n\"Kukuk!\" The laugh was dry, devoid of humor. \"How funny. You look exhausted. Probably from defeating this city's master, right?\" Agnus circled them slowly, appraising. \"Mumud was close to becoming a legendary magician. Now that he's transcended death, he's even stronger. He isn't something you people can handle.\"\n\n\"You bastard!\" Vantner lurched forward. \"Yet you want to raid him alone...? Oof! Mmph!\"\n\nJishuka clamped her hand over Vantner's mouth, yanking him back.\n\n\"Relax. Our goal isn't to raid the lich.\"\n\nShe turned to Agnus, her expression carefully neutral.\n\n\"I'll give you the lich. We won't interfere with your raid.\" Her tone carried the weight of negotiation. \"But we have separate business here. Can you leave us alone?\"\n\n\"I'll think about it...\" Agnus' smile widened. \"If you kneel.\"\n\n\"You should act in moderation, Agnus.\"\n\n\"Kukuk. Yes, yes. I understand.\"\n\nJishuka's passive stance surprised the others. But the logic was sound. Agnus would get his lich. They could secure the pavranium undisturbed. A clean exchange.\n\nVantner couldn't accept it.\n\n**Are you seriously letting him go?** The whisper came through party chat. **Why are we taking this? He's treating us like trash!**\n\nVantner was the lowest ranked member present. He'd never faced Agnus personally. The others had. Every one of them had shared hunting grounds with the necromancer at least once.\n\n**It's better to avoid Agnus,** Pon sent back.\n\nKraugel. The sky above the sky. Pon acknowledged him as the strongest in single combat. But Agnus? Agnus was the King of the Dead. He commanded hundreds.\n\n**He's a man who absolutely shouldn't become our enemy.**\n\n**I don't understand.** Vantner's frustration bled through the text. **You've all been saying he's great, but I honestly don't see it. Is he so strong that eight of us need to flee?**\n\n**We aren't running away. We're avoiding him.**\n\n**That's the same damn thing!** Vantner's avatar trembled. **I'm sorry to Grid! Ignoring the Overgeared Guild is no different from ignoring Grid himself!**\n\n**...Speaking of Grid.** Zednos' message was grim. **If those two ever meet, they'll fight.**\n\n**Their personalities are too similar. Grid and Agnus absolutely shouldn't cross paths.**\n\n**We need to find the pavranium before Grid arrives.**\n\nPapat!\n\nThe determined Overgeared members scattered throughout the cave. Vantner stood alone, glaring at Agnus, before finally following his companions. Agnus watched them go, his smile widening.\n\n\"Don't rush.\" The words were a murmur, meant only for himself. \"I'll have to test the performance against you once I obtain Mumud.\"\n\n> [Why do things keep getting twisted?]\n\nBraham's soul flared with indignation. The voice echoed from Grid's body.\n\n> [Who are you?]\n\n\"Me?\" Agnus' gaze shifted toward Braham's ethereal form. \"I'm someone looking for your body.\"\n\nKwajik! Kwajijik!\n\nThe ground split open around Agnus. Hundreds of skeletons erupted from the earth like grotesque seeds finally sprouting. Death knights clad in black armor emerged. And then, impossibly, a lich.\n\nThird advancement necromancers could summon death knights. That was known. But liches? No necromancer skill tree contained such abilities.\n\nLiches were once human. Even the great magician Braham couldn't fully control Lich Mumud without exploiting the vampire coffin as a binding mechanism. When Braham's soul recognized the lich standing among Agnus' forces, shock rippled through the fragment.\n\n> [You...! You're Baal's Contractor!]\n\n\"Don't speak that damn name.\"\n\nAgnus' face twisted. He waved his hand with casual disdain. Death knights and hundreds of skeletons surged toward Lich Mumud.\n\nKiyaaaaaah!\n\nMumud unleashed a torrent of magic power. The flash of light shot forward in a perfectly straight line, pulverizing the skeletons in its path. Like a dark dragon's breath made manifest.\n\n\"Hoh.\"\n\nAgnus didn't flinch despite losing dozens of summons in an instant. If anything, he seemed pleased.\n\n\"As expected.\"\n\n*Now. Become mine.*\n\n\"Kuahahaha!\"\n\nLaughter burst from Agnus' throat. In response, the death knights, lich, and skeletons' eye sockets flared crimson. Braham's soul fragment wavered like a lamp caught in a windstorm.\n\n> [This dog...!]\n\nHe couldn't lose Mumud. Braham only had a handful of soul fragments remaining. Mumud was nearly his sole support. But Baal's Contractor showed no mercy. The powers of the death knights and lich flowed into the skeleton soldiers, empowering the horde. Gradually, inexorably, they drove Mumud onto the defensive.\n\n> [Indeed... you were chosen by Baal for a reason...!]\n\nPuok!\n\nA death knight's sword cleaved through Braham's soul fragment. The voice cut off mid-curse. Several minutes crawled past before Lich Mumud finally submitted to Agnus' control.\n\n\"Sigh.\"\n\nExhaustion settled over Agnus' features. The dark circles beneath his eyes had noticeably deepened. He swept matted hair from his face with a tired gesture, then approached the captured Mumud. His finger traced an unidentified sigil onto the skull. The Sigil of Absolute Domination. Only three uses remained in total.\n\nKyaak!\n\nMumud's scream pierced the cave. Strange, considering the undead couldn't feel pain.\n\n\"Kukuk.\"\n\nAfter several long moments, Lich Mumud stood beside Agnus. The necromancer stroked the skull like one might pet a favored hound, then scanned the cave.\n\nThe Overgeared members had already fled.\n\n\"Took too long.\" He shrugged. \"Well, it's fine. This brings me closer to my heart's desire. Now I own two liches.\" His smile turned predatory. \"The third and final one will be saved for you, Braham.\"\n\nHe would find where Braham was buried. No matter what it took.\n\n\"Kukukuk!\"\n\nLaughter echoed through the cave as Agnus departed.\n\n***\n\nMinutes ticked by in silence.\n\nThen, one by one, the Overgeared members materialized from a shadowed corner of the empty cave. Their invisibility cloaks shimmered as the enchantment released. Each face was pale, shaken by what they'd witnessed. Sweat dripped down Vantner's temples as he spoke.\n\n\"Agnus is a necromancer with a lich?\" His voice was hoarse. \"Death knights and skeleton soldiers, fine. But how can he summon a lich? Even Braham can't...\"\n\nA lich. Three death knights. Hundreds of skeleton soldiers. The force could be considered an army in its own right. The kind of power that could destabilize nations.\n\nPon's expression was troubled, his usual confidence absent. \"His strength is on a completely different dimension compared to when I saw him last year.\" He shook his head slowly. \"This makes me anxious.\"\n\nNothing good would come from such a twisted person gaining this much power.\n\n***\n\n\"The entrance is open.\"\n\nThe 13th vampire city. The ant hill entrance that had sealed itself upon their entry now gaped wide. Elfin Stone's defeat had released the lock.\n\n\"Where are they?\"\n\nGrid stood with Huroi and Yura, waiting. Eventually, he sent a whisper to Jishuka.\n\n*We just arrived at the city's entrance. Where are you? Have you found the pavranium yet?*\n\nJishuka's reply came quickly, almost too quickly.\n\n*We found it! We'll leave soon, so head toward the 14th city first.*\n\n*Why do we need to go first? We'll wait at the entrance.*\n\n*No, just go ahead!*\n\nGrid frowned. *What is this?*\n\nSomething was wrong. A thought crossed his mind.\n\n*Perhaps...*\n\nWere they in danger? Being considerate by not wanting him caught up in it? The possibility seemed likely.\n\n*How useless.*\n\nGrid was no longer someone to be protected. The opposite, in fact. He turned a cold gaze toward Yura and Huroi.\n\n\"Are you ready to fight?\"\n\n\"Of course, My Lord.\" Huroi's hand moved to his weapon.\n\n\"I'm always ready.\" Yura checked her gun.\n\n\"Then let's go.\"\n\nGrid's group plunged into the entrance.\n\nAt the same moment...\n\n\"Huh?\"\n\nAgnus emerged from the ant hill. The timing was exquisite. Grid's party missed him by mere seconds.\n\n\"Was I mistaken?\"\n\nHe'd felt something when warping through the doorway. Some presence. But certainty eluded him. Regardless, his work here was finished. Agnus consulted his mental schedule.\n\n\"Next is the Sword Grave.\"\n\nPagma. The legendary blacksmith. At the end of his life, he'd allegedly forged and destroyed thousands of swords. According to historical records acquired through quests, Braham had visited the location frequently...\n\nAgnus sent a whisper.\n\n*Veradin, have you located the Sword Grave?*\n\n*I'm sorry. I mobilized all my resources, but couldn't find it.*\n\n*Really worthless.*\n\n*I'm sorry.*\n\n*Find it quickly. I'm heading to the next location.*\n\n*I'll keep that in mind.*\n\n\"Tsk.\"\n\nAgnus clicked his tongue and started across the desert. The boiling heat was merciless, yet not a single drop of sweat appeared on his skin.\n\n***\n\n\"Huh? You're safe?\"\n\nRoughly ten minutes after entering the 13th vampire city, Grid reunited with the Pavranium Expedition. Jishuka examined him with visible concern, searching for injuries.\n\n\"Are you okay? You're not hurt? You weren't bitten by a crazy dog?\"\n\nHer insistence that Grid head to the 14th city first had been motivated by fear of an Agnus encounter. Fortunately, that seemed not to have happened.\n\nGrid's brow furrowed. \"Why would there be a dog in the desert?\"\n\nRelief flooded Jishuka's features. She reached into her inventory.\n\n\"Then take this.\"\n\nItems materialized between them. Drops from Elfin Stone, various minerals, and gleaming pavranium.\n\n\"Everyone has worked hard.\"\n\nGrid bowed his thanks to Jishuka and the others. Bright smiles bloomed across the party members' faces.\n\n\"You're the one who worked hardest.\"\n\nStrictly speaking, that wasn't true.\n\nGrid had been carried. If they hadn't surrendered the experience, he never would have reached level 300. The city would have remained unconquered. Securing pavranium? An impossible dream.\n\nGrid made a silent vow.\n\n\"Once this expedition is over, I'll give all of you the best items.\"\n\n\"Are you talking about the Grid set you mentioned before?\"\n\nExcitement rippled through the party.\n\n\"What? Why is **this girl** here?\"\n\nJishuka had just noticed Yura standing beside Grid. Yura's response was calm, unruffled.\n\n\"You still speak in such a violent manner. I'm afraid it will have an adverse effect on Youngwoo's feelings.\"\n\n\"Youngwoo?\" Jishuka's eyes narrowed. \"He's Duke Grid. Can't you distinguish between reality and the game?\"\n\n\"I'll call him what I like.\" Yura met her glare without flinching. \"It's none of your business.\"\n\nPajijik!\n\nSparks seemed to fly where their gazes locked.\n\n*Beauties are fighting over Grid...*\n\n*Grid already has Irene...*\n\nJealousy gnawed at the party members. They were truly envious. Grid, however, paid them no attention. His focus was entirely on the newly acquired items.\n\n> [Three pieces of ??? have been collected.]\n\n> [The information about the ??? Pieces has been updated.]\n\n*This...!*\n\nGrid's eyes widened.\n\n***\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}