{
  "id": 304,
  "title": "Chapter 304",
  "content": "# Chapter 304\n\n> [Three pieces of ??? have been collected.]\n> [The information about the ??? Pieces has been updated.]\n\nA notification chimed in Grid's vision.\n\n> [Red Mirror Piece]\n> \n> Pieces of a round mirror made of blood stones.\n> \n> The exact function of the mirror isn't known.\n> \n> The third prince of the Saharan Empire is looking for this mirror. It is recommended that you gather all the pieces and give them to him.\n> \n> Weight: 3\n\nGrid's breath caught. *This is...*\n\nHe stared at the updated description, his mind racing to another item buried deep in his inventory.\n\n*The Amethyst Shield.*\n\nHe pulled up its information.\n\n> [Amethyst Shield]\n> \n> Rating: Epic\n> \n> Durability: 200\n> \n> Defense: 200 | Magic Resistance: 200\n> \n> A beautiful shield that shines purple, red, or black depending on the angle. It is a symbolic piece awarded only to the head of the Red Knights.\n> \n> This item was lost three years ago when Piaro, framed as a traitor by Asmophel, fled to the Eternal Kingdom.\n> \n> The third prince of the Saharan Empire is looking for this shield. It is recommended that you bring it to him.\n> \n> Weight: 350\n\nHe'd acquired it over a year ago in Satisfy time. The Awakened Guardian of the Forest had dropped it during one of his early raids. Back then, he'd had no idea how to reach an imperial prince. The shield had simply vanished into his inventory, forgotten beneath the mountain of items he'd accumulated since.\n\n*The performance isn't very good, but I kept it because it's a quest item.*\n\nGrid frowned. *How did I forget about this?*\n\nThen again, he barely had time to breathe between one crisis and the next. He dealt with incidents daily. Forgetting minor details was only natural for someone as busy as he was.\n\n*Still, if the empire's third prince keeps appearing in quest descriptions, there must be a major storyline connected to him.*\n\nHis thoughts turned to Piaro, the Amethyst Shield's original owner. The man would know something.\n\n*Once this expedition ends, I'll ask him about it.*\n\nGrid dismissed the window and moved on to the remaining drops. First, Iyarugt.\n\n\"Legendary Blacksmith's Appraisal.\"\n\n> [The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\n> [Iyarugt]\n> \n> Rating: <span class=\"rarity-rare\">Unique (Growth)</span>\n> \n> Durability: 351/351 | Attack Power: **793**\n> \n> * **Sword Mastery Level +5**\n> * The skill 'Blood Cry' is generated.\n> * Decreases the healing ability of the target by 50% when hit.\n> * Critical strikes cause bleeding status for 3 seconds. Bleeding damage is proportional to your attack power.\n> * The target's bleeding effect is maximized at three combos. Damage increases by 200% for 1 second.\n> * At five combos, the target's thinking ability is destroyed for 0.3 seconds. You can link the skill 'Hell Sword.'\n> \n> Iyarugt is a sword forged by the only blacksmith of hell from a soul and blood stones. It has exceptional damage for a one-handed sword.\n> \n> The soul of Iyarugt will turn the wearer into a master of swordsmanship. However, he rarely accepts anyone as a master.\n> \n> Conditions of Use: A person chosen by Iyarugt.\n> \n> Weight: 290\n\n> [A hidden function doesn't exist.]\n\nGrid's pulse quickened. *Amazing.*\n\nA legendary two-handed sword typically boasted 1,040 to 2,166 attack power. Iyarugt, despite being a unique-rated one-handed weapon, reached nearly 800. The number was staggering when he considered the standard trade-off: two-handed weapons sacrificed speed for raw damage, while one-handed weapons did the opposite.\n\n*And it increases Sword Mastery by five levels.* Grid ran the calculations in his head. *The average damage might fluctuate slightly compared to Failure, but if I can upgrade this to legendary rating...*\n\nThe sword was exceptional. The material surpassed even blue orichalcum, which spoke to the skill of its creator.\n\n*Hell's only blacksmith.*\n\nHelmis. The demonkin he'd encountered during his brief, fatal trip to the underworld while consumed by Blackening.\n\n*Was this his work?* Grid's brow furrowed. *He seemed connected to the blacksmithing craft itself. If we meet again, could he teach me?*\n\nHope stirred in his chest, immediately tempered by caution. He had no desire to return to hell. The place had defied his expectations, true. Instead of fire and brimstone, he'd found clear blue skies, rolling grasslands, and surprisingly cordial demonkin farmers.\n\nBut he couldn't afford to be fooled by pleasant scenery.\n\n*Hell is the land of evil.* His jaw set. *I should avoid it unless I know exactly what risks I'm facing.*\n\nGrid pushed thoughts of Helmis aside and examined Elfin Stone's Ring.\n\n> [The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\n> [Elfin Stone's Ring]\n> \n> Rating: <span class=\"rarity-epic\">Epic (Growth)</span>\n> \n> * During normal attacks, 12% of damage dealt is restored as health.\n> * During skill attacks, 5% of damage dealt is restored as health.\n> * This effect is invoked once every 21 seconds.\n> * **Strength, Stamina, Health +20**\n> \n> A ring containing Earl Elfin Stone's unique magic power.\n> \n> It raises the potential and survival ability of the wearer.\n> \n> Weight: 1\n\n*This is incredible too.*\n\nIn Satisfy, potion cooldowns were punishing and healers were scarce. Lifesteal accessories commanded astronomical prices. But Elfin Stone's Ring went further. It applied to skill attacks, a feature that defied the normal limitations of vampire equipment. The synergy with his legendary skills was perfect. The only drawback was the 21-second cooldown, but even that felt minor.\n\n*And it gives me a 60-point stat bonus.* His heart hammered against his ribs. *That's like gaining six levels instantly.*\n\nGrid's satisfaction swelled. After Doran's Ring and Dark Bus' Ring, he'd secured another top-tier accessory. All the deaths, all the grinding through this vampire expedition had been worth it.\n\nA new notification materialized.\n\n> [This item has a hidden function.]\n> [The information of Elfin Stone's Ring has been updated.]\n\nGrid's eyes went wide.\n\n> * If this ring grows to legendary rating, the wearer can summon Vampire Earl Elfin Stone.\n\n\"What?\"\n\nHe could summon the boss? The strongest, most nightmarish enemy he'd faced in this entire expedition?\n\nThe notification didn't clarify whether the summoned Elfin Stone would be a subordinate or remain hostile. But common sense suggested the former. Growth-type items rewarded their wielders.\n\nGrid clenched his fists, knuckles white. The image of Elfin Stone groveling at his feet sent a thrill through him. Then reality intruded. He turned toward his party members, who were sorting through their own loot.\n\n\"All of you know the value of these items.\" His voice was rough. \"It's too much for me to take alone.\"\n\nThe party smiled.\n\nPon stretched, rolling his shoulders. \"Don't you do this for us all the time?\"\n\n\"We get items from a legendary blacksmith for free,\" Regas added. \"All we provide are materials.\"\n\nVantner grunted. \"Besides, you were the MVP of this raid.\"\n\n\"We wouldn't have even attempted Elfin Stone without you,\" Zednos pointed out.\n\n\"Everyone...\" Grid's throat tightened.\n\nThey'd helped him with his quest. They'd given him first pick of the loot without hesitation. Where else in the world could he find friends this generous?\n\nHe swore to himself, not for the first time, that he would repay their kindness tenfold.\n\nBut first, there was work to do.\n\nGrid turned to Jishuka. \"Fire Phoenix Arrow here.\"\n\nShe blinked. \"What? Why?\"\n\nPhoenix Arrow was her signature move, the ultimate skill that crowned her as the continent's greatest archer. A massive firebird that transformed entire battlefields into infernos. Grid pointed at the chunk of pavranium Jishuka had given him earlier.\n\n\"To smelt this.\"\n\nSilence fell.\n\nJishuka's face went through several emotions. She remembered the last time Grid had made this request, treating her most powerful technique like a glorified furnace. Her pride had taken a beating.\n\nBut refusing her guild master over something so petty felt wrong. And Yura was watching. Jishuka refused to appear smaller or pettier than her rival.\n\nShe drew her bow. \"Fine.\"\n\nThe decision spoke volumes about her feelings. Her guildmates exchanged glances, expressions torn between sympathy and exasperation.\n\n*Grid's attitude toward women is terrible,* Pon thought.\n\n*He has the emotional intelligence of a brick,* Regas agreed silently.\n\n*Poor Jishuka,* Zednos sighed internally. *Falling for someone this dense.*\n\nGrid, oblivious to the judgment raining down on him, got to work.\n\nThe phoenix materialized in a explosion of flame. Grid thrust the pavranium into the heart of the blaze, his hammer rising and falling in steady rhythm. Sparks flew. Molten gold dripped and reformed. Slowly, carefully, he attached the divine metal to Lifael's Spear.\n\nWhen the flames died, a small handle protruded from the spear's base. Grid could now grip and swing the divine weapon with his own hand.\n\nBut it wasn't finished.\n\n*To truly complete Lifael's Spear, I need the remaining fourteen pavranium.*\n\nThe handle needed to be longer, the balance perfected. Once he collected every piece, the weapon would be reborn. Its power would rival or surpass even Iyarugt's.\n\nGrid wiped sweat from his brow and turned to his party. \"Give me anything that needs repairs.\"\n\nThey handed over damaged equipment without hesitation. Grid examined each piece, calculating the work required.\n\nHis hammer sang against metal. Dozens of items cycled through his hands. His speed was several times faster than ordinary blacksmiths, his movements precise and economical. This was where Grid truly shone.\n\nThe hammer was his scepter. The anvil was his throne.\n\n\"Let's move out.\"\n\nAfter the maintenance was complete, Grid's party departed the 13th city. Their destination: the 14th city, followed by the 15th. They'd work their way through those two, then backtrack to the 12th and continue sequentially down to the first.\n\nThe prospect of facing more opponents like Elfin Stone weighed on them. But the party's morale held strong.\n\nGrid's increased strength and Yura's addition had shifted the balance. They could handle whatever came next.\n\nTheir confidence proved justified. The 14th and 15th city masters were mere barons, not earls. Compared to Elfin Stone, they fell like wheat before a scythe.\n\nVantner laughed as the Baron of the 14th City crumbled to ash. \"If vampires like Elfin Stone were common, the world would've been conquered by bloodsuckers centuries ago.\"\n\nThe party relaxed, finally understanding that the 13th city had been an outlier. Its difficulty had been exceptionally high.\n\nOnly Grid suffered.\n\nWhile his companions celebrated and joked, he ground his teeth through the relentless cycle of combat, looting, and repair work. His stamina drained. His mind dulled from exhaustion.\n\nBut he pressed on. The pavranium awaited."
}