{
  "id": 305,
  "title": "Chapter 305",
  "content": "# Chapter 305\n\n*No. Dammit.*\n\nPagma's Descendant could equip any item without meeting the requirements. That strength fueled his destructive power. Yet now, Iyarugt refused him.\n\nA voice scraped across Grid's mind like nails on iron.\n\n> **[Iyarugt speaks]**\n> \"An inferior demonkin? The demonic power I sense from you is pathetically weak. Low quality. You don't deserve to wield me.\"\n\n> **[You are rejected by Iyarugt.]**\n> **[You have failed to equip Iyarugt.]**\n\nGrid stared at the sword in his hands. A curse he could dispel. Status immunity handled that. But this? Pure rejection. Iyarugt didn't just refuse him. It denied his very existence.\n\nHis jaw clenched. \n\n*I never thought there'd be an item I couldn't wear.*\n\nThe path to upgrading a growth-type item was simple: use it constantly. But if he couldn't equip it, he couldn't grow it. The legendary rating he craved for Iyarugt sat just out of reach.\n\n*So I need to raise my demonic power?*\n\nThe logic was clear. Too little demonic power meant rejection. More demonic power meant acceptance. Grid's lip curled.\n\n*Like hell I will.*\n\nHigher demonic power meant one thing: a one-way trip to the underworld. He'd seen the system messages himself during his brief stint in hell.\n\n> **[The duration of Blackening is over.]**\n> **[Your demonic power is sealed. Your species has returned to human.]**\n> **[Ordinary humans cannot enter hell. You are being expelled.]**\n\nThe warning couldn't be clearer. Humans didn't belong in hell. If his demonic power grew strong enough to let him stay there permanently, he'd already crossed the line. Already become something else.\n\n*A demon.*\n\nCould he even function as a demon-type species? The penalties would be catastrophic. Reidan would reject him as lord. The Overgeared Guild would collapse. Worst of all, Irene and Khan might turn their backs on him.\n\nNo. He'd avoid that fate at any cost.\n\n*For now, I'll only use Iyarugt when Blackening is active.*\n\nBrief exposure would raise his item understanding over time. Once it hit 100%...\n\n*I'll use Legendary Blacksmith's Reconstruction.*\n\nA slow smile spread across his face. He'd rewrite the sword's very soul. Bend it to his will. Make himself the perfect master.\n\n*And I'm renaming you Yakult.*\n\nThe 200-won yogurt drink he'd loved since childhood. Easy to say. Way better than stumbling over \"Iyarugt\" every five seconds.\n\nGrid's grin turned wicked.\n\n\"Kukukuk...\"\n\nThe demon sword thought itself so mighty. Swordsmanship rivaling a great demon. Noble pride. \n\nHe'd grind it all into the dirt.\n\n***\n\nYura joined the expedition at the 14th city. Level 203.\n\nThe party eyed her with skepticism. Former 5th ranker, sure. Legendary class, absolutely. But that level? She'd be deadweight. A liability instead of an asset.\n\nShe proved them wrong within the first fight.\n\nThe Demon Slayer class devastated demonkin. Every vampire that crossed Yura's path learned that lesson the hard way.\n\n*Tatang! Tang tang!*\n\nMagic guns were finicky weapons. Created only in alchemy facilities, they demanded flawless control. The user had to shape raw magic power into a bullet, discharge it at precisely the right moment, maintain the proper flow rate. One mistake and the whole sequence collapsed.\n\nGrid wouldn't last five minutes with one. He'd fumble through a hundred failed attempts just to fire a single shot. Probably take three minutes per bullet if he got lucky.\n\nYura made it look effortless. Her fingers danced across the trigger, each motion precise. The control she'd honed as a black magician combined with raw natural talent. Even dedicated magic gunmen would've stopped to admire her technique.\n\n\"Kuak!\"\n\n\"Kiyaaak!\"\n\nThe pistol gleamed white against Yura's pale skin. Each magic bullet tore through inferior vampires like they were paper.\n\n\"What... what *is* this?\"\n\nA vampire staggered, disbelief written across its face. The human woman before it had raven-black hair pulled back in a high tail. Beauty that transcended species, the kind that made even creatures who viewed humans as cattle stop and stare. No divine power radiated from her.\n\nYet her attacks burned like holy fire.\n\nTheir black smoke forms offered no protection. The bullets pierced through, negating their ethereal defenses entirely.\n\n\"You! Woman!\" The vampire's voice cracked. \"What are you?\"\n\nHis kin died around him. Vampires, apex predators of the night, cowered before a human. A Korean woman, no less.\n\nPeak Sword's chest swelled with patriotic pride.\n\n\"Do you know Yura?!\"\n\nSomeone in the party groaned. \"Those are literally the only English words he knows.\"\n\n\"He doesn't even use them right,\" another muttered.\n\nThe party members exchanged long-suffering looks. Yura ignored the commentary, already lining up her next shot.\n\nThe Demon Slayer's passive skill, Purification, infused her magic bullets. She fired them through Demonkin Contempt.\n\n*Tatang! Tang tang!*\n\nMagic guns had one advantage: bullet velocity. Nearly impossible to dodge, unlike arrows. The trade-off? Abysmal fire rate.\n\nModern firearms used mechanical actions. Magic guns required reshaping magic power for every single shot. The refinement process created an inherent delay that no amount of skill could fully overcome.\n\n*Click.*\n\nYura's last bullet caught a vampire between the eyes. Her hands moved through the reload sequence, gathering magic power from her core.\n\n\"Damn human!\"\n\nThe surviving vampires rushed her position. Claws extended, gleaming with unholy light.\n\n\"This is bad!\"\n\nVantner, the party's sole tank, had his hands full protecting Zednos. The mage's wide-area spells painted a target on his back. Every vampire in range wanted a piece of him.\n\nNo way to peel off and help Yura.\n\n\"Yura!\"\n\nSomeone called her name desperately. Not Grid. He was off solo hunting, wrestling with Iyarugt and paying zero attention to anything else.\n\nPeak Sword sprinted toward the vampires.\n\n\"I'm coming! Hold on!\"\n\nHis concern was unnecessary. Legendary class. Combat-specialized legendary class.\n\n*Supak!*\n\nYura's magic gun vanished into her inventory. A sword appeared in her grip mid-motion. She activated Brilliance Sword and swept the blade in a wide arc.\n\nHoly light erupted along the edge. Vampire flesh sizzled and burned.\n\nPeak Sword skidded to a stop, jaw slack.\n\n\"You can use swordsmanship too?\"\n\nDemon Slayers didn't actually main the magic gun. They possessed Weapons Mastery, allowing proficiency with any weapon type. The class just specialized in firearms and one-handed swords through its active skill tree.\n\n\"Slaughtering small fry, are we?\"\n\nIntermediate vampires descended from the shadows. They'd watched their juniors get butchered. Now they moved in for revenge.\n\nYura's expression flickered. Juniors averaged mid-200s in level. Intermediates started at 280, minimum. The gap was too wide. Her attacks would barely scratch them.\n\n\"Eyes on me.\"\n\nJishuka's voice cut through the chaos. She stood twenty meters away, bow drawn.\n\n\"I'm your opponent.\"\n\n*Pepepeng!*\n\nArrows spiraled like drills, punching through vampire hearts with surgical precision. Jishuka linked fire arrows to her Dancing Arrows technique. The projectiles detonated in sequence.\n\n\"Don't get the wrong idea.\" Jishuka nocked another arrow. \"I'm just maintaining my experience rate.\"\n\nYura's smile was genuine.\n\n*I'm happy.*\n\nTalent and beauty had isolated her for years. Other women either envied her or tried to exploit her. Friendship remained an abstract concept. She'd never let anyone close.\n\nThe Overgeared members were different.\n\nThey matched her talent level. Treated her as an equal. No special treatment, no attempts to undermine her. For the first time, Yura understood the difference.\n\nBeing with people beat being alone. Every single time.\n\n*Joining Overgeared was the right choice.*\n\nOriginally, she'd joined for Grid. To leverage Overgeared's resources and reclaim her ranking. Personal interest factored in too. Grid was... unusual. He didn't fawn over her. Didn't shower her with attention. Sometimes he looked downright annoyed by her presence.\n\nThat indifference was magnetic. Not because she enjoyed being mistreated (probably not, anyway). Grid just didn't pressure her. Didn't expect anything. The first time she'd felt comfortable around a man.\n\nHis performance at the National Competition had sealed the deal. Watching him dominate opponents twenty levels higher had sparked something. The first real crush she'd ever experienced.\n\nBut now? She loved the guild itself.\n\n\"Time's up!\"\n\n*Chaaeng!*\n\nTwo days into their massacre of the 10th city, the boss appeared. A building's windows exploded outward. The True Blood Baron emerged from the debris, identical to the bosses from the 14th, 15th, 12th, and 11th cities.\n\n\"You dare wreak havoc in my domain?!\" The baron's magic power surged, painting the air crimson. \"Unforgivable!\"\n\n*Kuooooh!*\n\nBloody energy radiated in waves. The pressure was immense, far stronger than a standard dungeon boss.\n\nStill nothing compared to Elfin Stone.\n\nGrid's party had cut their teeth on that monster. Baron vampires were a joke by comparison.\n\n\"Blackening.\"\n\nGrid revealed his power immediately. The red sword in his grip pulsed. Dark energy coiled around him like smoke. He looked like death incarnate.\n\n\"K-keok! Why... why are humans so strong?\"\n\nThe boss of the 10th city dissolved into black smoke. A vampire ring clattered to the ground. The Overgeared members divided the loot.\n\n\"Good.\"\n\nGrid checked his item understanding. Iyarugt was approaching 20%. Painfully slow progress, but at least the number climbed.\n\nHe silently renewed his vow to rename the sword Yakult, then moved toward the cave.\n\nPavranium first. Quest later.\n\nHe didn't expect what waited for him inside.\n\nA familiar presence manifested in the cavern. White light coalesced into a vaguely human shape.\n\n> **[Pagma's Descendant! We finally meet!]**\n\nGrid blinked.\n\n*Huh?*\n\nBraham hadn't appeared in cities 11 through 15. Grid had honestly forgotten the great magician even existed.\n\n*Is he going to be pissed?*\n\nStealing pavranium instead of completing the quest. Braham had every right to be furious.\n\nGrid cleared his throat awkwardly.\n\n\"It's... been a while.\"\n\nBraham's response blindsided him.\n\n> **[Please help me!]**\n\nNot angry. Begging. Pleading.\n\nThe complete opposite of the arrogant mage Grid remembered. Something had changed. Something big.\n\nThe abandoned class quest was about to take a very different turn.\n\n---\n\n**Glossary of Common Korean Terms**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\n*Check out my Patreon for early access to unedited chapters and to unlock goals for bonus releases. Early access chapters update after the day's full release.*"
}