{
  "id": 306,
  "title": "Chapter 306",
  "content": "# Chapter 306\n\nBraham Eshwald.\n\nOne of the nine direct descendants of Shizo Beriache. He was one of the cleverest in the clan, and one day a question took root in his mind.\n\n*God Yatan gave us the Curse of Idleness because of our strength and ambition, but why?*\n\nGod Yatan harbored a destructive desire. He wished to bring ruin to all beings blessed by the goddess of light, Rebecca. Absolute strength and cruelty were necessary to accomplish this goal, and the vampires were the perfect species for such a task.\n\nVampires were powerful and could achieve God Yatan's wish. So why seal their power with the Curse of Idleness? Braham couldn't understand it.\n\nFurthermore.\n\n*Why wasn't any prohibition placed on the great demons?*\n\nIt stunk. Braham smelled something rotten beneath the surface and started digging deeper into the nature of the gods. Then, after 483 years of study, he discovered a truth. God Yatan's destructive instinct only activated in a certain cycle.\n\n*Once human desires reach their peak, chaos will descend upon the world.*\n\nIn other words, only when Goddess Rebecca could no longer control the world would God Yatan's destructive instincts be exercised.\n\n*God Yatan will emerge to destroy the world, then Goddess Rebecca will create a new world from the ashes.*\n\nYatan and Rebecca. The two gods who appeared to oppose each other were actually cooperating.\n\n\"Kukuk...\" Braham's laugh echoed through the empty chamber. \"We're just playthings in the hands of the gods.\"\n\nEven now, the creatures of Yatan and Rebecca hated and slaughtered each other. It was designed that way from the beginning. Yatan and Rebecca existed in balance to maintain this world.\n\nBraham felt a great sense of betrayal. His infinite reverence for Yatan vanished like smoke. He suddenly realized why Shizo Beriache, originally one of the great demons, had been expelled from hell into the human world.\n\n*Mother was like me.*\n\nThe clever Beriache would've known about the reality of Yatan. She questioned him and was cursed with the Curse of Idleness, then expelled from hell.\n\n*What about the other great demons?*\n\nDid they know the truth, or were they just obedient puppets?\n\n*No matter what.*\n\nThere was only one thing Braham wanted.\n\n*I will overcome the Curse of Idleness.*\n\nShizo Beriache was a great demon of predation. The vampires who inherited her blood possessed the same tendencies. Among them, Braham craved knowledge above all else. However, due to the Curse of Idleness, he slept most of the day and accumulating wisdom became nearly impossible.\n\n*There is deep meaning in the great god's curse.*\n\nHe must've cursed them to restrain their appetites. But what was the reality?\n\n*There is no god in the first place.*\n\nYatan. The omnipotent entity they worshipped as a god didn't exist. He was a passive mechanism that existed only to maintain the providence of the world. There was no reason to serve it or endure the current trials.\n\n*Yatan, I will overcome the curse you laid on us and remain faithful to my instincts.*\n\nHe would accumulate knowledge and become a perfect existence! On that day, Braham pledged to explore all the disciplines and magic of the world. Over hundreds of years, he built up his knowledge and devoted himself to magic research by using all types of species as his test subjects. Among them were his clan members.\n\nAnd this was the beginning of the worst situation.\n\n***\n\n\"Braham! I'll kill you!\"\n\nA vampire wept while clutching his lover's corpse. It was Elfin Stone, the 9th child of Shizo Beriache.\n\n\"Leah, you dare do this to her...! Leah!!!\"\n\nElfin Stone trembled with rage that his lover had been used for research. Braham regarded him coolly. \"Brother, do you fail to understand my inquiring mind even until the end? Don't you wonder about the source of my inquisitiveness?\"\n\n\"I don't understand! How can I understand your twisted behavior when studying magic, to the point of even sacrificing your clan members? You're just insane!\"\n\nBraham's eyes narrowed. \"...You're saying this as well?\"\n\nHe blamed the Curse of Idleness. They didn't question anything. They found everything tedious and only coped with the things directly in front of them.\n\n\"There is no value for our clan.\" Braham's voice was cold with certainty.\n\n\"Brethren, listen to me. You're worse than the humans you treat as livestock. You have no right to hold me back.\"\n\n\"Stop spouting such nonsense!\"\n\nElfin Stone activated **Blood Field** and summoned Iyarugt to attack Braham. But he was never a match from the beginning. Braham was a duke while Elfin Stone was merely an earl. The difference was insurmountable.\n\n\"Dammit...! Dammit! Brahammmm!\"\n\n\"Disgusting.\"\n\nThe sight of Elfin screaming and bleeding was both pathetic and amusing. Even as Elfin Stone faced death at the hands of his enemy, he couldn't endure the drowsiness. His eyes were closing.\n\n\"Braham.\"\n\nA woman appeared before the laughing Braham. Shizo Beriache.\n\nBraham's expression cracked. \"Mother...\"\n\nBeriache had been sleeping for hundreds of years after being directly cursed by Yatan. Why was she awake at this time?\n\n*She should've woken up in 50 years.*\n\nBraham's confusion deepened when he sensed something strange from Beriache.\n\n*I can't feel her vitality.*\n\nBeriache was dying. Why? She should have possessed eternal life.\n\n*That girl...!*\n\nBraham belatedly noticed the girl standing beside Beriache. A black-haired child who looked exactly like Beriache.\n\n\"Is this my 10th sibling?\"\n\nBraham's expression twisted. The magic power emanating from the girl far exceeded Beriache's own power.\n\n\"Mother! You gave birth to a being beyond yourself!\"\n\nBeriache's gaze was filled with frost. \"...You broke the taboo that clan members shouldn't be harmed, no matter what.\"\n\n\"Mother, that...\"\n\nBraham tried to explain, but closed his mouth. He knew his actions of sacrificing clan members for his greed wouldn't be forgiven. Beriache looked at him with hatred.\n\n\"I have loved you more than anyone.\"\n\nSilence.\n\nTears appeared in Braham's eyes. Beriache, who should be enjoying eternal life, now had wrinkles on her neck. All of this was due to that girl! Braham struck at his new sibling. And he failed to hit the girl, Marie Rose.\n\n\"Excuse me for doing this from the beginning.\"\n\nMarie Rose's voice was soft. Childlike.\n\nThe power of Marie Rose was absolute. Despite being a newborn, she defeated Braham who was the strongest of the clan.\n\n**Paduduk!**\n\nPain lanced through Braham's wrist. \"Ack...!\"\n\nBraham groaned through gritted teeth as he grabbed his shattered wrist. Beriache's hate-filled gaze didn't waver. She was merciless.\n\n\"I have warned all of you that our clan has a craving for predation, so an unimaginable catastrophe will occur if we hurt each other. You have killed many clan members while I slept, and now you want to harm your sibling in front of me? I will punish you to set an example!\"\n\nBraham's expression contorted.\n\nMarie Rose's small fangs pierced his neck and all the blood in his system was drained, causing unimaginable pain. On this day, Braham lost his eternal life. He was banished from the clan.\n\nAfter 100 years.\n\nBraham concealed himself as a human while studying magic and succeeded in overcoming the Curse of Idleness. But now he had a finite life. He needed to regain eternal life in order to accumulate more knowledge.\n\nBraham started to explore immortality magic, and in the process, he gained the title of great magician. In the end, he couldn't complete the magic of eternal life. But there was no need to despair. As the next best alternative, he completed resurrection magic.\n\n***\n\nBraham finished recalling the past and returned to reality. He stood before the human called Grid.\n\n[I asked you to make me the Vessel of the Soul. Then I will be resurrected. I will be able to repeat this resurrection several times in the future. But you said that you can't create the Vessel of the Soul because you can't receive God Yatan's blessing?]\n\nGrid shifted his weight. \"Yes. It's impossible, since I have a hostile relationship with the Yatan Church.\"\n\nBraham's voice echoed in Grid's mind.\n\n[If so, please give me permission to possess your body.]\n\n\"Possess...\" Grid blinked. \"What?\"\n\nThe word hung in the air. Possession! It meant that a ghost would be inside his body! Wasn't this the material of a third-rate horror movie?\n\nGrid's throat tightened. \"W-What if I don't want to?\"\n\nSupernatural phenomena made his skin crawl. Braham attempted to persuade him.\n\n[There is no need to worry about your body. The only thing I will do is fly to the Yatan Church to receive Yatan's blessing.]\n\n\"Will it be that easy?\" Suspicion colored Grid's tone.\n\nBraham answered without hesitation.\n\n[I can obliterate the Yatan Church, even if I was occupying the body of a five year old child.]\n\nIndeed, this was the confidence of a legendary great magician who survived fighting against the dragon Trauka.\n\n[I will give you all the pavranium I possess if you let me borrow your body for half a day. In addition, I will teach you one spell.]\n\nGrid frowned. \"Why does an already dead person want to be resurrected?\"\n\nBraham's answer was simple and concise.\n\n[I want to explore all the knowledge that exists in this world. I will become immortal!]\n\nThen a notification window materialized before Grid.\n\n> [The Second Class Quest: **Great Magician's Resurrection** has been updated.]\n>\n> **[Great Magician's Resurrection]**\n>\n> Great Magician Braham is insatiable. He has no intention of stopping his search for knowledge.\n>\n> It is part of his natural instincts, so he can't be condemned.\n>\n> **Quest Clear Conditions:** Accept Braham's soul and make a Vessel of the Soul out of the pavranium that has been blessed by God Yatan.\n>\n> **Quest Clear Reward:** Learn a magic spell. Acquire all the pavranium scattered throughout the continent.\n\n*The total number of pavranium was 28.*\n\nOut of that number, Grid currently owned 11 pieces of pavranium.\n\n*I need at least 18 pieces of pavranium to perfectly reproduce Lifael's Spear.*\n\nIf he obtained all the pavranium, he would have 10 pieces remaining, even after making Lifael's Spear. No, he didn't need to cling to Lifael's Spear. He should be able to create an even better item if he took advantage of all 28 pavranium. But the reward of the magic spell attracted Grid more than the pavranium itself.\n\n*Can I really learn magic as a blacksmith?*\n\nIt might be only one spell, but it was a spell taught by a great magician. Obviously the spell would be exceptional. Grid's pulse quickened. He accepted the changed quest without hesitation.\n\nGrid straightened. \"Okay! I will accept your request!\"\n\nAt the same time.\n\n[An excellent choice!]\n\nBraham's soul fragment roared and flew towards Grid.\n\n> [Braham is trying to enter your body. Would you like to accept?]\n\n\"Of course!\"\n\nAt the same time, Grid's body was surrounded by light.\n\n> [You have accepted the soul of the great magician, Braham.]\n>\n> [Your class will be changed from **Pagma's Descendant** to **Great Magician**.]\n>\n> [From now on, your body will move according to Braham's will.]\n\nGasps echoed through the chamber.\n\nThe party members watching the situation let out impressed sounds. Grid's status window was displaying something extraordinary after he accepted Braham's soul.\n\n**Grid (Great Magician)**\n\n**Lv. 545**\n\n**Health: 858,310**\n\n**Mana: 13,965,000**\n\nThe party information window didn't show detailed information such as attack power, magic power, defense, or skills list. However, they could extrapolate based on the level, health and mana alone. The white-haired, red-eyed Grid spoke to the open-mouthed party members.\n\n\"I am thankful to everybody.\" His voice sounded different. Older. More refined. \"The securing of the pavranium is now meaningless, so return to Reidan first.\"\n\n**Pahat!**\n\nGrid's body vanished with the light."
}