{
  "id": 308,
  "title": "Chapter 308",
  "content": "# Chapter 308\n\n\"Grid...?\"\n\nThe name escaped Tallos as a strangled sound. One Magic Missile. That's all it took. The ID hung above the white-haired man's head like an accusation.\n\nViolet's raid team froze. Cameras swiveled. Confusion rippled through the reporters.\n\n\"Is that actually Grid?\"\n\nEveryone knew Grid. The first legendary class. The man who'd clawed his way up from debt and failure. You'd have to be a toddler or senile not to recognize the name.\n\nViolet's people knew the story too. The grinding poverty. The Tzedakah absorption. Every ranker and bottom-feeder journalist had dissected Grid's life a hundred times over.\n\nWhich made this worse.\n\n*A spell?*\n\nSure, he'd used Fly before. But analysis had pegged that as boot-dependent magic. Equipment skill, not personal power. Now though? Grid wore nothing. Just the plain starter gear everyone spawned with.\n\nThat Magic Missile came from *him*.\n\n*A blacksmith casting magic?* One of the reporters nearly choked. *Unless...*\n\n*Second class.*\n\nThe Mongolian user broke that barrier first. Over the past eighteen months, the count had climbed past a hundred. Grid could be one of them.\n\n*Legendary class AND a second advancement?*\n\n*This is front-page material.*\n\nEvery camera locked onto Grid. Violet's raid became yesterday's news.\n\nViolet's jaw clenched. Millions of gold dumped into this raid. Cameras recording the humiliation. And now Grid waltzes in to steal the spotlight? \n\nShe barked something at the reporters about lawsuits, then wheeled on Grid.\n\n\"You know anything about raid etiquette, Grid?\" Her voice carried across the temple floor. \"Crashing someone's attempt without permission? That's worth criticism.\"\n\nViolet spoke like a man. Dressed like one too. Short hair, unadorned plate armor, a body built like a wall. Complicated reasons sat behind that choice.\n\nGrid descended through the hole in the ceiling. Rubble crunched under his feet. He looked down at Violet.\n\nA cold smile.\n\n\"Etiquette?\" His tone was ice. \"You think you can lecture a superior?\"\n\n\"What did you just—\"\n\nViolet's face went crimson. Speaking to a stranger like that? Calling himself *superior*? \n\n\"That's the most arrogant thing I've ever heard!\"\n\nGrid held legendary class status. Duke of a kingdom. Overgeared Guild Master. He represented too much to act this way. Violet felt her disappointment curdle into something uglier.\n\nGrid's thoughts matched hers.\n\n*Braham, you bastard.*\n\nThe vampire's soul puppeted Grid's body. Those words? All Braham.\n\n\"I didn't say that!\" Grid's protest echoed inside Braham's mind, unheard. Frustration mounted as his body walked toward Violet without permission.\n\nHer cheeks flushed. *Handsome?*\n\nGrid's face had always been plain. Decent enough with the right lighting and attitude, but nothing special. Now though...\n\nWhite skin matching white hair. Sharp jawline. Ruby-red eyes. The subtle shifts elevated everything, transforming ordinary into striking.\n\nViolet's heart stuttered despite her self-imposed distance from men. Even the reporters noticed.\n\n*How does a hair color change make him that good-looking?*\n\nOne whispered to another. *It's obvious, right?*\n\n*Plastic surgery.*\n\nThey nodded to each other, convinced. South Korea's reputation preceded itself. But they were wrong. Grid hadn't touched his face. He'd never complained about his looks. He was tough enough to wear scars with pride.\n\nThe change came from Braham's soul. Grid's appearance had partially merged with the vampire's. Like makeup for women or stage lighting for celebrities, Grid now wore power in his face itself.\n\n\"The rude one is you, not me.\" Braham's words dripped from Grid's mouth. \"I saved your raid. You should be grateful. Instead you dare speak to me this way.\"\n\n*Wow. Actually arrogant.*\n\nViolet's team and the reporters all made the same face. Violet trembled with rage. She wanted to challenge him to a duel. Right now. But her opponent led Overgeared. Her guild couldn't afford the fallout.\n\nShe clamped her mouth shut. Braham seemed pleased by that.\n\n\"Yes. Lower your tail. That's your place.\"\n\n*I'm so screwed.*\n\nGrid wanted to cry. Braham was manufacturing anti-fans by the second.\n\n*Every article is going to roast me alive.*\n\nFan club membership would tank. Personal attacks would flood in. Worst case? People would drag his parents into it. Huroi-style insults. The thought made Grid's stomach turn as his body moved without permission.\n\nBraham ignored Violet entirely. He faced Tallos.\n\n\"Where is Amoract's soul hiding?\"\n\nTallos had recovered during Grid's distraction. His wounds sealed. He blinked in confusion.\n\n\"What soul? Why ask me?\"\n\n\"Magic Missile.\"\n\n*Puok!*\n\n\"Keok!\" Tallos staggered. The spell punched through his chest again.\n\n*How?*\n\nTallos held fourth advancement black magician status. One of the ten great magicians on the continent. Magic power wrapped his body like armor. Weak spells shouldn't penetrate.\n\nYet Magic Missile carved through him like paper.\n\n\"What... what are you?\"\n\nTallos tried to heal. Grid fired another Magic Missile. This one took him in the thigh.\n\nHe dropped to his knees.\n\n*This is insane.*\n\nAmoract's chosen agent, crippled by Magic Missile? Unacceptable. Grid loaded another shot. Tallos finally understood how much danger he faced.\n\n\"Kuaack!\" His scream tore out as the spell pierced his heart. Blood sprayed. Grid's tone stayed casual.\n\n\"Just answer the question. Where is Amoract's soul?\"\n\n\"Ack...!\"\n\nThe world knew Tallos as Yatan's First Servant. They were wrong. Amoract held that title. The great demon of conflict. Only Yatan's servants knew the truth.\n\n*What is he? How can he be this strong? How does he know about Amoract?*\n\nGrid fired again. Tallos didn't answer fast enough.\n\n\"Kuaaaaak!\" Tallos crumpled. Pain was bad. Shame was worse.\n\nOne of the continent's ten great magicians. Yatan's First Servant to the public. And those Dominion Church dogs were *watching* as Magic Missile turned him into a joke.\n\nAbsolute disgrace.\n\nRage ignited. Tallos lashed out.\n\n\"I won't forgive you!\" His voice cracked. \"Death Fear!\"\n\n*Kyaaaak!*\n\nHundreds of evil spirits materialized behind Tallos. A shockwave erupted.\n\nYatan Church members. Violet's raid. Reporters from national networks.\n\nEveryone caught the blast. The spell didn't discriminate. They collapsed. Blood vessels turned black beneath skin. Screams filled the temple.\n\nGrid stood untouched. Tallos gaped but recovered fast. He chained the next cast.\n\n\"Dark Rage!\"\n\n*Kwa kwang!*\n\nBlack magic slammed into Grid. The spell could pierce basilisk hide. Tallos grinned but stayed alert. He layered more magic. The ground around Grid erupted. Hellfire scorched stone.\n\nFull power. Grid should be ash.\n\nHe wasn't.\n\n\"Shield?\" Tallos choked. \"Just Shield?\"\n\nThe lowest tier defense spell. It absorbed fixed damage. Simple. Basic. That basic spell had nullified four of his strongest black magics.\n\n\"This doesn't make sense.\"\n\nTwenty years. Tallos had served as Amoract's representative for two decades. Always maintained his dignity. Now this.\n\n\"You're a monster!\" Desperation crept into his voice. \"I can't match you. Just kill me quickly!\"\n\nGrid's expression didn't shift.\n\n\"Magic Missile.\"\n\n\"Kuaaaaak! Damn it!\" Tallos writhed. \"Just use Meteor! Kill me properly!\"\n\n\"Magic Missile.\"\n\n\"Kuheok! You cruel bastard!\"\n\nYatan's First Servant, killed by Magic Missile. The rumor would devastate the church's reputation. Tallos needed the white-haired man to use higher-tier magic. Something impressive.\n\nInstead, Magic Missile. Again and again. Tallos felt his sanity cracking.\n\nThe strongest black magician's mental fortitude crumbled fast.\n\n\"Please...\" His voice broke. \"Please stop with Magic Missile...\"\n\nHe was begging. Grid paused mid-cast.\n\n\"Where is Amoract's soul?\"\n\n\"Ludhadan Cave...\"\n\nMagic Missile proved more effective than any mental spell. Pride amplified its impact. Enough to shatter Tallos' loyalty to Amoract.\n\n\"Good. Your trivial life is the price for that answer.\"\n\nTallos begged again. Not for mercy. For something else.\n\n\"Please... kill me with advanced magic.\"\n\nBeing killed by Magic Missile was too humiliating. He couldn't let that stand. Grid looked at Tallos' desperate face.\n\nHe nodded.\n\n\"Fireball.\"\n\n\"You son of a—!\"\n\nFlames swallowed the curse. Heat rivaled hellfire itself. Tallos turned to ash.\n\n> [You have defeated Amoract's agent, Tallos.]\n> \n> [**2,620,090,770 experience** has been acquired.]\n> \n> [Your level has risen.]\n> \n> [A **Dark Rune** has been acquired.]\n\n*Wow.*\n\nGrid checked the status window. Braham remained at level 545. The level-up belonged to Grid, not the vampire.\n\n*This profit though.*\n\nThe Overgeared members would lose their minds. Grid gained a level and an unknown rune just for hosting Braham's soul. The unexpected windfall sent a thrill through him.\n\nReporters swarmed before he could process it.\n\n\"Did you get magician as your second class?\"\n\n\"Why is your Magic Missile so strong? That *was* Magic Missile, right?\"\n\n\"Your shield's defense was impossible! How high is your magic power?\"\n\n\"That fireball looked like actual hellfire! What's your secret?\"\n\nThey stared with naked envy. Grid's earlier arrogance? Already forgotten.\n\n---\n\n**Glossary of Common Korean Terms:**  \n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing the day's content."
}