{
  "id": 309,
  "title": "Chapter 309",
  "content": "# Chapter 309\n\n\"The Violet Guild is famous for their excellent raid skills. A month ago, they raided the Rotten Horned Rayon.\" The reporter leaned forward, mic extended. \"They couldn't compete with Tallos' strength, but you succeeded with just Magic Missile and Fireball. Please give us an explanation.\"\n\nThe questions kept coming. Grid's jaw tightened as some of them cut straight to the bone.\n\n*Rumors might spread that I'm a bugged user, or that S.A. Group is backing me behind the scenes.*\n\nBased on the experience gained, Tallos was far more powerful than Pascal. No user should be able to kill him alone, especially with basic magic. Grid watched the reporters exchange glances, their suspicion palpable.\n\nBraham seized control of Grid's mouth.\n\n\"I don't think you understand me.\"\n\nThe reporters leaned in.\n\n\"I am a legend. I am omnipotent. Trivial beings like you can never imagine, let alone understand me. This is normal.\"\n\n\"Wow.\"\n\nShocked murmurs rippled through the crowd. At this moment, Grid was beyond arrogant.\n\n*He's acting like some edgy teenager who thinks he has special powers!*\n\nGrid wanted to die. Braham was calling himself omnipotent with a serious expression, in front of dozens of cameras. Grid's hands curled into fists.\n\n*How embarrassing.*\n\nGrid used to act like that when he was younger. But at twenty-seven, he'd met Lauel and realized how cringe it all was. Now, at twenty-eight, Grid carried a deep stigma about being labeled that way again.\n\n*Braham, please act more normal for my sake!*\n\nHe was grateful for the level gain, but that was it. He had no idea how to clean up the mess Braham was creating. As Grid wrestled with his frustration, Braham cast Teleport and vanished, leaving the reporters behind.\n\n***\n\n\"Thirteen minutes ago in real time, Overgeared's guild master, Grid, destroyed the First Servant of Yatan with Magic Missiles and Fireball.\"\n\n\"Tallos, Yatan's First Servant, is a fourth advancement black magician. Even Violet's group failed the raid. Grid killed him with basic magic. His strength defies common sense...\"\n\n\"People worldwide are raising suspicions that Grid is a bugged player. S.A. Group has issued an official statement denying this. However, user suspicions persist. There's a conspiracy theory claiming some type of deal exists between Grid and S.A. Group.\"\n\nInternational media swarmed the Grid incident. Public opinion tilted negative. Most people questioned Grid's overwhelming strength. Speculation flooded SNS.\n\nThen experts from various fields stepped in to stabilize public opinion.\n\n\"Grid is likely doing a story-driven quest.\"\n\n\"Story-driven quest? Ah, you mean like the 'Bring Chocolate to the Mother Wolf' type?\"\n\n\"Correct. A typical quest that occurs only when the user meets certain conditions. A story-driven quest is often to 'experience something.' The classic example is 'Bring Chocolate to the Mother Wolf' that most of us experienced in the early days.\"\n\nBring Chocolate to the Mother Wolf. A quest acquired at level eight. The user who accepted it lost control of their body, transformed into a young wolf, and brought chocolate to the mother wolf. The user's role was simply to observe the wolf's story.\n\n\"Grid's appearance and tone differ from usual. The fact that he easily handled a named boss proves it isn't Grid controlling the body. He's likely experiencing something very special.\"\n\n\"That's right. But who is that special being?\"\n\nSouth Korea, the United States, France, Canada, Russia, China, Japan. International experts arrived at a common conclusion.\n\n\"Braham Eshwald.\"\n\n\"The legendary great magician.\"\n\nAfter that, portal sites worldwide became dominated by articles about Grid.\n\n**[The legendary blacksmith, Grid! He is experiencing what it's like to be a legendary great magician!]**\n\n**[Is a great magician the second class that Grid will acquire?]**\n\n**[The arrogance of a talented and handsome man is charming? Women worldwide are raving over white-haired Grid!]**\n\n**[Grid's arrogant way of talking is trending on SNS... It's likely to become a social problem.]**\n\n**[Grid's popularity in Japan is huge! Is this the advent of the 5th Korean wave?]**\n\n**[Grid's fan club membership has doubled in 3 hours... Advertisements are soaring.]**\n\n***\n\nGrid sighed.\n\n*It's probably a complete mess by now.*\n\nHe dreaded the aftermath of Braham's words.\n\n*I saw the reporters' faces. Their reactions were disgust.*\n\nHe could easily imagine the articles. Grid is delusional, Grid is arrogant, Grid is bugged, Grid is crazy. All types of malicious articles would spread across the Internet, and he'd gain millions of anti-fans.\n\n*I'm probably dominating the real-time search rankings...*\n\nHe was afraid to log out. Knowing his bad luck, he might get chased through the streets.\n\n*Should I hire bodyguards?*\n\nHow long would his suffering last? Grid had no idea of the actual situation and felt mounting frustration, while Braham scoffed as he moved through the Ludhadan Cave.\n\n*Amoract, you are as careful as Mother said.*\n\nThe level of the veil placed over the cave was considerable.\n\n*But it isn't at a level to mislead me.*\n\nGrid broke the silence.\n\n\"By the way, who is Amoract?\"\n\nWhy did Tallos need to hide behind a representative? Braham's answer was simple and concise.\n\n\"The great demon of conflict.\"\n\nGrid's eyes widened.\n\n\"Great demon...! The First Servant of Yatan is a great demon?\"\n\nThe unexpected answer shocked him completely.\n\n\"Surely you don't mean to fight a great demon right now?\"\n\n\"The Amoract here isn't in a perfect state. It's just a part of Amoract's soul, so there's no need to feel scared.\" Braham's voice carried absolute confidence. \"A soul fragment is helpless against me.\"\n\nA great demon wasn't his opponent. He was declaring that a great demon wasn't even a challenge.\n\n***\n\nThe deepest part of the dark cave opened into a large chamber. A white soul floated above an altar at the center.\n\nThe soul spoke first.\n\n\"You came.\"\n\nThe response sounded like it had been expecting Braham. Braham borrowed Grid's mouth.\n\n\"Amoract, you were aware that I would look for you.\"\n\n\"Of course. I know you need the blessing of the gods to shed your mortality.\"\n\n\"If my guess is correct, you're going to fulfill my demands?\"\n\n\"That's right.\"\n\nBraham laughed.\n\n\"Kukukuk, Marie Rose must be pretty annoying to Yatan.\"\n\nGrid's thoughts raced.\n\n*Marie Rose?*\n\nIt was a familiar name. A vampire duke who radiated absolute dignity. A chill ran down Grid's spine as he recalled her existence.\n\n*If she's somewhere in the vampire cities...*\n\nIt would've been impossible to obtain all the pavranium. He was fortunate that he'd accepted Braham's soul to complete the quest.\n\n\"God Yatan favors you, regardless of Marie Rose. Always remember this.\"\n\n\"He isn't a god.\"\n\nAmoract's sweet voice hardened.\n\n\"...Be careful with your mouth.\"\n\nIntimidation rolled off Amoract in waves, making Grid's chest tighten. Braham remained unaffected.\n\n\"Shouldn't you step foot on this land before trying to intimidate me?\"\n\n\"It isn't about intimidation, but manners.\"\n\n\"I won't show courtesy to Yatan. I don't serve him anymore.\"\n\nGrid's mind stuttered.\n\n*Anymore?*\n\nDid this mean Braham once served Yatan? Grid had questions, but this wasn't the time to resolve them. Braham ordered Grid.\n\n\"Take out the pavranium.\"\n\n> **[You have temporarily gained control of your body.]**\n\nThe notification appeared and Grid regained his freedom.\n\n*Now I got a little taste.*\n\nIt wasn't pleasant to surrender control of his body to others. Grid felt relief wash over him as he summoned Lifael's Spear. Braham commanded Amoract.\n\n\"Now give it Yatan's blessing.\"\n\n\"I don't like it but... Okay. This is the will of God Yatan.\"\n\nAmoract's white soul expanded, growing larger and larger. After a brief moment, a dark beam fell from the ceiling.\n\n*Chaaeng!*\n\nLifael's Spear trembled as the dark light struck it. Notification windows updated.\n\n> **[God Yatan's blessing has fallen on the pavranium.]**\n\n> **[Pavranium has gained the ability to increase magic power.]**\n\nGoddess Rebecca's blessing boosted recovery speed, God Dominion's blessing increased attack power, and God Judar's blessing increased defense. These blessings were always applied to Grid, who was the owner of the pavranium.\n\nGrid had expected a lot from God Yatan's blessing. The magic power buff disappointed him. Magic power wasn't very important since Grid couldn't use magic freely.\n\n*No, no.*\n\nGiven that he would learn one spell from Braham, it wasn't so bad that his magic power increased. Grid thought about it positively, while Braham felt thrilled. Their souls were assimilated, so Grid could sense his intense joy.\n\n\"Finally...! The time has finally come!\"\n\nThe resurrection he'd been desiring for hundreds of years. The excited Braham shouted.\n\n\"Now, Pagma's Descendant! Make the Vessel of the Soul!\"\n\nGrid nodded.\n\n\"Okay.\"\n\nBraham's dubious elements weren't important to Grid right now. He just wanted the enormous rewards from Braham.\n\n*Ttang! Ttang!*\n\nGrid stripped a small amount of pavranium from Lifael's Spear and crafted a small bowl. It was a bowl that seemed somewhat rough, but the maker's craftsmanship showed through.\n\nBraham laughed in triumph.\n\n\"Kukukuk! Kuahahaha!\"\n\nBraham's soul left Grid's body and moved to the Vessel of the Soul."
}