{
  "id": 31,
  "title": "Chapter 31",
  "content": "# Chapter 31\n\n**CLANG! CLANG!**\n\nGrid hammered away at the anvil, lost in the rhythm of raising his blacksmith skill. The smithy door creaked open.\n\n\"Khan, I heard the rumor.\" An old man shuffled inside. \"But you aren't drinking?\"\n\nKhan glanced up from organizing his tools. \"Not drinking? What are you saying?\"\n\nThe visitor's gaze swept over to Grid, dismissive. \"No, if you're sober, then why are you hanging out with this unimpressive newbie every day? Tsk tsk. At first glance, he looks like someone who is ignorant of the world.\"\n\n*This bastard.* Grid's jaw clenched. *Did he just call me an unimpressive newbie?*\n\nThe old man kept running his mouth. \"If you stopped drinking because of this person—\"\n\nGrid's knuckles whitened around the hammer handle. Rage spiked through his chest. Khan caught sight of the trembling hammer and cut his friend off.\n\n\"Hey, shut up. You're mistaken.\"\n\n\"Mistaken?\"\n\n\"Yes, mistaken.\" Khan waved a dismissive hand. \"That young man might have a garbage-like appearance, but you shouldn't judge a person from their outer appearance. He's actually a big person.\"\n\n*Garbage-like appearance?*\n\nGrid froze mid-swing.\n\n*Did Khan always think that about me?*\n\n**KWANG! KWANG!**\n\nBetrayal stung worse than he expected. He channeled his anger into the steel, hammering harder. Then his eyes drifted down to his beginner's tunic, the plain cloth worn thin at the elbows.\n\n*I leveled up from killing those gangsters, but I'm still only level 21.* His armor and weapon sat gathering dust in the warehouse. *Of course I look like crap.*\n\nNPCs judged users by three criteria: level, equipment, and reputation. Grid had none of those. He was wearing starter rags, barely scraped past the tutorial levels, and had zero public recognition.\n\n*Wait. What about the reputation from killing Veil's gang?*\n\nHe tuned back into the conversation.\n\n\"You don't believe it?\" Khan crossed his arms. \"Don't be deceived by his appearance. Watch his techniques closely. That isn't the normal skill for a blacksmith. Isn't it? And this is a secret, but this young man took care of Veil's gang alone.\"\n\n\"Uhuh! What nonsense are you talking?\" The friend shook his head. \"Yes, I admit that his blacksmithing technique is great now that I've seen it with my own eyes. The boy seems moderately good, unlike his appearance. But taking care of Veil's gang alone? Aren't they the fiercest outlaws in Winston? It's impossible! How could a blacksmith take them out alone?\"\n\n\"I saw it directly.\" Khan's voice carried the weight of certainty. \"Have you seen any of Veil's gang on the street today? Aren't they missing? It was all done by this young man.\"\n\n\"Huhu.\" The friend laughed. \"This friend should really drink less. If this is true, shouldn't his reputation have already spread?\"\n\nKhan clicked his tongue. \"Think about it. If rumors spread that this young man defeated Veil, the Mero Company wouldn't leave him alone. So why bother spreading it? There are no rumors because I was the only witness. Therefore, his reputation is still unknown.\"\n\n\"Well, you were the one who witnessed it.\" The old man squinted at Grid with renewed interest. \"Is that young man so great? Huhut, now that I'm looking closely, doesn't he seem rather dignified?\"\n\n*I see.* Grid returned to his work. *No rumors about defeating Veil means the reputation effect hasn't spread yet.*\n\n\"Khan! Are you here?\"\n\nA cluster of people pushed through the door. They clutched flyers in their hands. A middle-aged man thrust one toward Khan. \"Is this true?\"\n\nKhan scanned the contents. He nodded.\n\nThe crowd erupted into agitated murmurs. Grid edged closer, curiosity overriding his work. He peered over someone's shoulder at the flyer.\n\n*Interesting.*\n\n**[The Mero Company will compete with Blacksmith Khan in an item production game. The reason that we chose to do this is because we respect Khan as a human and admire his blacksmith skills. If the Mero Company loses to Khan in this game, our company will help Khan keep his smithy by paying off his debt. On the other hand, the smithy will get transferred to us if we win, but we will leave the operating rights to Khan. A coexistence with the residents of Winston is our ultimate goal. The date of the game will be announced in the near future, so please pay attention to it.]**\n\nGrid's lips curved into a smirk.\n\n*Heh. I'm not even the slightest bit nervous.* Confidence swelled in his chest. *No matter how skilled the blacksmith hired by the Mero Company is, I am Pagma's Descendant!*\n\nThe Legendary Blacksmith's Craftsmanship Skill set him apart from every other blacksmith in the game. Some random hired hand from the Mero Company? Even if they were advanced level, Grid would crush them. Legendary class versus advanced NPC? No contest.\n\n*This will be easy.*\n\nThe crowd around him buzzed with conflicting emotions.\n\n\"It is easy for the Mero Company to take Khan's smithy,\" someone reasoned. \"But they didn't just forcibly take it. Instead they asked for a fair game. They are giving Khan a job. According to their claim, they genuinely respect Khan.\"\n\n\"That's right.\" Another voice chimed in. \"Even if they win the game, they will allow Khan to operate the smithy? Then is the rumor that the Mero Company plans to create jobs for the residents true?\"\n\n\"This seems to be the case. Maybe the Mero Company isn't as bad as we thought. They really are trying to coexist with us.\"\n\nGrid paused his hammering.\n\n*The Mero Company...* He frowned. *They hired gangsters to threaten Khan, so I thought they were bad guys. But they are actually decent?* The logic followed. *Then why were the gangsters so arrogant? Was there an error in the command system?*\n\nHis vague hostility dissolved. The Mero Company had given him a quest worth 600 gold. Why bite the hand that fed him?\n\n*There is no need to think badly of them. Yes.*\n\nMost people in the smithy, Grid included, found themselves warming to the Mero Company. Khan did not share the sentiment.\n\n\"That's it. This is why the Mero Company asked for the game!\" Indignation twisted his weathered features. \"That Rabbit, he isn't an ordinary man!\"\n\nHe snatched the flyer.\n\n**CHWAAK!**\n\nThe paper tore in half. Khan turned on the crowd, reproach burning in his eyes.\n\n\"You forgot about all your humiliation and suffering just from seeing this piece of paper! The Mero Company is a villain who knew about Winston's development beforehand and used the information to monopolize our land. You were deprived of everything, becoming poor and hungry. What has the Mero Company done for us since then?\"\n\nSympathetic murmurs rippled through the gathering.\n\n\"That's right. The Mero Company is the enemy! Are we going to commit another mistake by being deceived by their tricks? Don't be nice to them! We will be stabbed in the back then fall to hell.\"\n\nThe affinity between Winston's residents and the Mero Company was beyond repair. Their grudge ran bone-deep.\n\n\"Excuse me.\"\n\nA hand rose from the middle of the crowd. All eyes turned to the speaker. Grid studied him.\n\n*A user.*\n\nNPCs had green names. This man's name hovered above his head in white. A normal player who hadn't committed any crimes.\n\nKhan addressed him. \"Young man, you aren't a resident of this village.\"\n\n\"My name is Huroi. I am an ordinary visitor who came to Winston for the first time.\"\n\n\"I see. Huroi, what question do you have?\"\n\n\"Yes. You might feel uncomfortable, but can you let me speak?\"\n\n\"Speak.\"\n\nGrid narrowed his eyes.\n\n*The NPCs are being favorable towards a stranger?* He assessed Huroi again. *Unlike me, this guy must be a high-level traveler, or he has high reputation on the continent.*\n\n\"According to the rumors I heard when I came here to Winston, the Mero Company knew about the development plan.\" Huroi's voice carried an orator's clarity. \"They approached you and bought land and commercial areas from those who didn't know about the development plan. Right after that, Winston made great strides in its development and the Mero Company received great benefits. Is this correct?\"\n\n\"That's right.\"\n\n\"Were you forced to sell the land to the Mero Company?\"\n\n\"No.\"\n\n\"Then are the Mero Company's actions towards you truly unscrupulous?\" Huroi spread his hands. \"Weren't you blinded by money when you sold your land and stores to the Mero Company? Weren't you trying to move your homes with the money you earned? But you didn't want to leave after you belatedly realized that Winston was going to be developed and the situation turned out like this. Ultimately, the ones you should blame aren't the Mero Company. It is your own ignorance and self-interest.\"\n\n\"What are you saying?\"\n\n\"You are clearly the Mero Company's crony!\"\n\nThe atmosphere flipped in an instant. Huroi didn't flinch.\n\n\"A company is formed to build wealth! The act of taking advantage of information to form a monopoly is natural for them. Many of you hate them, but there is no need to be enemies. Did they actually do anything wrong?\"\n\n\"This bastard is talking until the end!\"\n\n\"Should we shut his mouth?\"\n\nThe residents bristled. Some looked ready to throw punches. Huroi stood his ground.\n\n\"I'm not hired by the Mero Company! The reason I'm saying these words is for you. Everyone! Don't try to fight with the Mero Company, but coexist with them. That is the much wiser choice.\"\n\nThe anger in the room cooled by degrees. People actually listened. Huroi was persuading them.\n\nKhan spoke up. \"This young man is meddling in other people's business. What is your intention behind giving such advice?\"\n\nSuspicion hardened Khan's tone. He was convinced Huroi worked for the Mero Company.\n\n*Isn't it obvious?* Grid read the situation clearly. *He must have a compelling reason to speak up like this.*\n\nThe pieces fell into place. Huroi had received a quest from the Mero Company. If people were persuaded, his quest would succeed.\n\n*Most people have already been persuaded.* Grid's petty nature reared its head. *I absolutely can't allow this to happen. I should interfere!*\n\nDid he care whether the Mero Company was good or evil? Not remotely. So why did this bother him?\n\n*The misfortune of others is my happiness!*\n\nIt was that simple. That pathetic. Grid didn't want to watch another player succeed right in front of him. The thought of Huroi getting quest rewards made his skin crawl with jealousy.\n\n*I will make him fail.*"
}