{
  "id": 310,
  "title": "Chapter 310",
  "content": "# Chapter 310\n\nThe moment Braham's soul touched the Vessel of the Soul, blue light exploded through the cave.\n\nGrid stumbled back, one hand shielding his eyes. His heart hammered against his ribs.\n\n*With my own hands, I'm bringing back a legendary great magician.*\n\nBraham Eshwald. The man who built the foundation of modern magic. The Father of Magic himself. Every mage in the world studied techniques he'd pioneered three centuries ago.\n\nAnd Grid was about to resurrect him.\n\nA grin split his face. Pride swelled in his chest, unfamiliar and fierce.\n\n> [The soul fragments of Braham scattered across the continent are gathering in the Vessel of the Soul.]\n\nThe notification barely registered before the real show began.\n\n*Syuong! Syuuong!*\n\nDozens of blue souls streaked through the cave entrance. Grid's breath caught. They looked like shooting stars, brilliant trails of sapphire light carving through the darkness. Beautiful. Ethereal.\n\nHis gaze dropped to the bowl in his hands.\n\n*...I should've made it prettier.*\n\nThe thing was bright gold, sure. But the shape? A rice bowl. Just a plain rice bowl. And now Braham's soul fragments were pouring into it like...\n\n*Blue rice.*\n\nGrid's eye twitched. *I'm cooking the Father of Magic's soul like congee.*\n\nHeat crept up his neck. \"Sorry, Braham.\"\n\nHe meant it. Their souls had mingled during the crafting process. Grid had felt echoes of Braham's thoughts, fragments of his memories. Despite every warning bell in his head, despite knowing Braham was dangerous, he'd developed a rapport with the bastard.\n\nWhich made him completely unprepared for what happened next.\n\n> [Do you remember what I told you the first day we met?]\n\nBraham's voice resonated inside his skull. Grid flinched.\n\n\"Roughly.\"\n\n> [History claims Pagma died 100 years ago. But I told you Pagma died 300 years ago. Have you ever wondered why?]\n\n\"One of you is lying.\" Grid shifted his weight. The cave suddenly felt smaller. \"Probably you.\"\n\nHe'd found Wendy's diary in the Mysterious Forest. Pagma had appeared before her 140 years ago. The math didn't add up with Braham's version.\n\n> [No. There is no lie. Both statements are true. Pagma died 300 years ago, but he existed 100 years ago.]\n\n*What?*\n\nGrid's forehead creased. The words made no sense.\n\n> [I first met Pagma roughly 300 years ago. I was amazed. More than amazed. His blacksmithing transcended human limitation. Even I felt awe.]\n\nThe souls swirled faster in the bowl, casting dancing shadows across the cave walls.\n\n> [We became friends. I, who looked down on everyone, including my own kin. For the first and last time, I respected another being. We spent 10 years together. Braham's vast knowledge expressed through Pagma's techniques. We both evolved.]\n\nGrid listened, tension coiling in his shoulders.\n\n> [Thanks to Pagma, I delved deeper into the magic of eternal life. I succeeded in designing the Vessel of the Soul. But to produce it, I needed a mineral that transcended even adamantium. Only Pagma could create such a thing.]\n\n\"Pavranium.\"\n\n> [Correct. But I told you Pagma died of old age after making it, didn't I?]\n\n\"Yeah.\"\n\n> [I thought that's what happened.]\n\n\"Thought?\"\n\nThe word hung in the air like a blade.\n\nThe blue souls finished converging. The light shifted. Clear sea-blue twisted into ominous crimson.\n\n> [Pagma's Descendant, my soul is complete. Thanks to you.]\n\n\"Enough about Pagma.\" Grid's fingers tightened on Failure's hilt. \"Give me what you promised.\"\n\n> [But isn't it strange?]\n\n\"What?\"\n\n> [Can you resurrect someone with just a perfect soul? Where's the body?]\n\nGrid's blood turned to ice.\n\nHis eyes widened. *No.*\n\nBraham's soul shot toward him.\n\n> [Give me your lowly body!]\n\n\"Like hell!\"\n\nGrid ripped Failure from his inventory. The greatsword materialized in a flash of jade light. He swung.\n\nThe soul dodged. Impossibly fast. It circled him once, twice, toying with him.\n\n*The quest condition was to make the Vessel of the Soul! I made it! This should be cleared!*\n\nBut Braham was attacking him. Violating the system itself.\n\n*A bug? Is this a bug? I thought Satisfy was bug-free!*\n\nPanic clawed at his throat. Was he about to be the first player screwed over by a glitch?\n\n*Why does this shit always happen to me?!*\n\nGrid roared his frustration at the cave ceiling. Braham's soul darted past his guard.\n\nStraight into his chest.\n\n> [The Great Magician Braham is attempting to possess your body.]\n\n> [Your body is protected by the system. Braham's attempt has been neutralized.]\n\nRelief hit like a tidal wave. Grid sagged, gasping.\n\n*No bug. There's no bug. Thank god.*\n\n> [Didn't I warn you at the Red Sea? Be wary of anyone who can threaten you.]\n\n\"Don't lecture me after trying to stab me in the back, you bastard!\" Grid's knuckles whitened on Failure's hilt. \"You were going to steal the pavranium and bail on teaching me magic, weren't you?\"\n\n> [A misunderstanding. As you know, only you and Pagma can control pavranium. Without the Vessel, it's just a pretty rock in my hands. And teaching you magic? Easy. I'll fulfill my promise.]\n\nGrid's jaw worked. \"What?\"\n\n*He just tried to kill me. Personality disorder? Multiple personalities?*\n\n> [The quest 'Great Magician's Resurrection' has been cleared.]\n\n> [You have acquired 17 pieces of <span class=\"rarity-legendary\">Pavranium</span>.]\n\n> [You have learned the spell 'Magic Missile.']\n\n\"What?\"\n\nRelief warred with confusion. The quest was done. Seventeen pavranium. Great. But... Magic Missile?\n\nJoy curdled into rage.\n\n\"You... You!\"\n\nHis face burned. A legendary great magician. The Father of Magic. Had taught him the most basic spell in existence.\n\n> [Know your place. You stole my pavranium for a year and a half, but I'm in a good mood. I'll forgive you.]\n\nBraham's soul faded, arrogant to the last.\n\n\"Dammit! DAMMIT!\"\n\nGrid's roar echoed through the empty cave.\n\nOn the altar, Amoract's white flame flickered.\n\n*The Yatan Servants' Slaughterer. He has earned Braham's favor.*\n\nInteresting.\n\nThe flame dissipated. Amoract had failed to corrupt Yura, true. But he'd succeeded in creating a countermeasure against Marie Rose. His work in the human world was done.\n\n***\n\n\"In the end, it went as planned.\"\n\nLim Cheolho leaned back in his chair, eyes fixed on the monitors displaying Ludhadan Cave.\n\nBraham. What a contradiction.\n\nConsumed by the thirst for knowledge, he'd experimented on his own clan. He envied his disciple Mumud but never harmed him, content to steal credit for discoveries. He hated and missed the friend who'd betrayed him in equal measure.\n\nAnd now?\n\nHe'd tried to kill Grid. While also feeling favorable toward him.\n\nJust as their souls had grown close during the crafting process, Braham had developed a rapport with Grid.\n\n*Or perhaps he simply judged Grid worthy after witnessing Pagma's techniques.*\n\nBraham was impossible to predict. An imperfect existence torn between instinct and the humanity he'd acquired. Lim Cheolho had always been fascinated by how drastically Braham's personality had changed after losing eternal life and living as a mortal.\n\n\"A life spent lying to yourself and others, refusing to acknowledge your own transformation.\" Lim Cheolho's smile was sad. \"How lonely.\"\n\nTragic or not, Satisfy's story was unfolding according to plan. The users wouldn't notice the difference. But as an observer, watching the narrative progress was endlessly entertaining.\n\n***\n\nGrid sat alone in the cave.\n\n\"Magic Missile.\" His voice was flat. \"I'm a Magic Missile magician now.\"\n\nMagic Missile. The spell every mage learned at level 10. Basic. Inefficient. Against anyone with decent magic resistance, it wouldn't leave a scratch. The only advantage was the fast casting time.\n\n*If I use it right, I can distract enemies. Create openings.*\n\nAssuming their magic resistance wasn't too high.\n\n*Otherwise it's only good for hunting slimes.*\n\nHe was level 301. He wouldn't be hunting slimes anytime soon.\n\n\"Ugh. Whatever.\"\n\nGrid pulled up the skill information.\n\n**[Magic Missile (Enhanced) Lv. 1]**\n\n*A magic missile developed by the legendary great magician, who completely overturned the activation formula.*\n\n*It boasts tremendous power but consumes significant resources.*\n\n*Deals damage equal to twice your current magic power to the target.*\n\n*Ignores the enemy's magic resistance.*\n\n**Resource Consumption:** 400 Mana  \n**Skill Casting Time:** 1 second  \n**Skill Cooldown Time:** 5 seconds\n\n\"Four hundred mana? For Magic Missile?\"\n\nThat was more than Link. A beginner spell eating mana like a legendary skill?\n\n*What is this? Wait.*\n\nHe read it again. Slowly.\n\n*Damage equal to double my magic power? Ignores magic resistance?*\n\nWhat about a normal Magic Missile?\n\nGrid opened the guild chat.\n\n{Does anyone have info on Magic Missile?}\n\nSeveral magicians shared their skills.\n\n**[Magic Missile Lv. 10 (Master)]**\n\n*One of the most basic spells.*\n\n*Deals damage equivalent to 5% of your current magic power to the target.*\n\n**Resource Consumption:** 20 Mana  \n**Skill Casting Time:** 1 second  \n**Skill Cooldown Time:** 2 seconds\n\n\"Holy shit.\"\n\nNot an ordinary Magic Missile. A legendary version.\n\nHis magic power was low compared to actual mages. But as a trump card? This could work.\n\nGrid exhaled slowly. \"Can't hate you after all, old man.\"\n\nHis opinion of Braham was shifting. Their strange relationship might be over now.\n\nOr maybe it was just beginning."
}