{
  "id": 311,
  "title": "Chapter 311",
  "content": "# Chapter 311\n\n*Naive. No, a fool. Learn how to be more suspicious and vigilant.*\n\nBraham had no intention of taking Grid's body from the beginning. He needed to be resurrected in his own body, not somebody else's.\n\nThe reason he'd attempted to take Grid's body was simple. To make an alarm ring with Grid. It might seem threatening, but it was intended as a favor.\n\nWhy?\n\n*He's a person who makes me nervous, but he's also the benefactor who achieved my 300 year old wish.*\n\nIt was his way of expressing appreciation. Grid didn't know it.\n\nThe soul fragment flickered. **[Well, we might be enemies when next we meet.]**\n\nBraham's soul started moving. His destination was the Sword Grave, where his body lay sealed.\n\n***\n\nReidan was a city that aimed to be the next Talima. Therefore, Administrator Rabbit invested most of the budget into blacksmithing and alchemy development.\n\nBut it was funny. Currently, the most developed area in Reidan was agriculture. Fields spread out in all directions around the city.\n\nGrid returned after completing a quest he'd left alone for a year and a half. He looked around at the fields.\n\n*I think the scale has become bigger.*\n\nHe didn't know why, but Piaro had a passive skill that had a 100% chance of making the land fertile. Thanks to this, Reidan always enjoyed the pleasure of a good harvest, no matter what crops were grown. The agricultural products accounted for the largest portion of the items that Reidan exported.\n\n*It's rumored that this is an agricultural city.*\n\nA city with a legendary blacksmith had become an agricultural city? It was indeed ironic. Honestly, Grid didn't like it.\n\nThe agricultural section of Reidan was growing despite not having a big budget invested in it. He didn't know if he should be glad or sad. The confused Grid stopped in place at the rice fields. A scene captured his gaze.\n\n\"You can do it! A newcomer will arrive in one hour!\"\n\n\"Okay! Heok? Dammit! We've been waiting for a new guy!\"\n\nHeave ho, heave ho.\n\nFarmers were working hard, using various farming equipment. Users were mixed in among them?\n\n*What?*\n\nThe desert ecosystem had stabilized thanks to the activities of the Overgeared members, but the barrier of entry was still high. It was unthinkable to step foot in this place unless they were level 260+ users. In Reidan, it was difficult to find users other than the Overgeared members, and the residents were NPCs. In such a situation, why were users farming?\n\nGrid frowned. Piaro, leader of Overgeared Knights Division and commander in chief of Reidan, appeared in the fields. He started to lecture the hard working users.\n\n\"It isn't about the quality of the hand plow. More wrist...\"\n\n\"Isn't the ground too fine? This isn't the only way to plant seedlings. Brownie trees grow better in rough soil.\"\n\nGrid's mouth went dry.\n\n> **[A legendary farmer has been born!]**\n\nHe recalled the phrase he'd witnessed a few months ago. Grid was blank with shock for a moment, before shaking his head.\n\n\"No. Piaro dreams of being a sword saint, so he can't be a farmer. My Piaro isn't a farmer.\"\n\nHe decided, but he couldn't bring himself to check Piaro's details using the Great Lord's Sword.\n\n*I should ask about the Amethyst Shield next time.*\n\nHe didn't want to talk to Piaro while he was wearing a straw hat.\n\nTrudge trudge.\n\nGrid's footsteps were heavy as he ignored Piaro and moved away from the fields. On the other hand, 21 users were working in the fields under Piaro's direction.\n\n*Dammit. A 55th ranked magician has to be farming.*\n\n*I have to swing a hand plow instead of a sword.*\n\nThe 21 users caught by Piaro had a high level. Most of them were in the late 200s. They came to Reidan to join Overgeared, but unfortunately couldn't join the guild. It was because they were caught by a crazy farmer.\n\nThe crazy farmer was naturally Piaro.\n\nIn the past when he dreamed of becoming a sword saint, he enjoyed fighting with strong users and caught the ankles of high level users. After becoming a legendary farmer, he caught the users' ankles for another reason.\n\n\"I will develop Reidan into the best agricultural city.\"\n\nThe problem was that Administrator Rabbit didn't increase their budget. In particular, he was lacking manpower. Insufficient manpower? He had to make up the difference.\n\n\"Uhuh! That isn't how you use a hand plow!\"\n\nThe user sighed.\n\nThe users caught by Piaro could only sigh. However, the reason they stayed in the fields was because of the reward of the quest.\n\n> **[★ Hidden Quest ★ Fun and Enjoyable Training!]**\n>\n> Live with the farmer Piaro in Reidan. If you join him, you can grow significantly.\n>\n> **Quest Clear Conditions:** Live together with Piaro for three weeks.\n>\n> **Quest Clear Rewards:** All stats +10. The skill 'Farming' will be obtained.\n\nThe reward was low compared to the hidden quest that Kraugel and Damian received. However, that was just a story for the two of them. From a general point of view, the reward of +10 to all stats was tremendous.\n\n\"There is a crazy farmer in Reidan. He will fight you and knock you down. Don't run away. That's right. If you can endure the trials that will follow, you will be able to taste sweet fruit.\"\n\nA strange rumor started to circulate on the Internet. Most people thought it was a ghost story, but the seven guilds were different.\n\nZibal grabbed his forehead. \"Crazy farmer!\"\n\nReidan was still being guarded by him? The 2nd ranked player's forehead was still sore.\n\n***\n\nThe first person Grid looked for when he arrived in Reidan wasn't Irene or Khan. It wasn't Lauel or Rabbit either.\n\nLaella blinked. \"Eh? Grid?\"\n\nLaella. A beautiful British woman who was a world class idol.\n\nGrid was once her fan. Rather than her excellent vocal ability or appearance, Grid liked her because her body suited his tastes. Her breasts were very large. It was enough to be reminiscent of fruit.\n\nGrid stared.\n\nLaella's face turned red with embarrassment. \"What did you find me for?\"\n\nGrid regained his spirit at her reaction and explained his purpose.\n\n\"Hum hum, this time I learned magic. I want to accurately test its power.\"\n\nLaella was in charge of the magicians at Reidan. There was a facility for measuring magic power in the mage barracks that she was in charge of, and Grid wanted to use it.\n\n\"Magic?\"\n\nLaella's eyes widened. The blacksmith Grid could use magic?\n\n\"How can you use magic? Ah! You did a quest related to Braham. Did you learn a spell from Braham? What spell did he teach you?\"\n\nGrid replied to Laella without hiding anything.\n\n\"Magic Missile.\"\n\nLaella's face fell. \"Ah, yes.\"\n\n*Indeed, it would be hard to teach a blacksmith proper magic.* \n\nLaella couldn't hide her disappointment and led Grid to the training ground behind the barracks.\n\n\"Fireball!\"\n\n\"Ice Arrow!\"\n\nIt was the Ul Clan, who Grid had saved from destruction. They were gifted in magic and were training on one side of the training ground. Laella pointed to a silver scarecrow as Grid was observing the Ul Clan with a proud expression.\n\nThe scarecrow was produced by Reidan's alchemy facility. It was a type of magic sandbag that could set the magic resistance from 0 to 5,000.\n\nLaella gestured to the training dummy. \"First, set the magic resistance to zero.\"\n\nGrid stood in front of the scarecrow.\n\n\"I have set it up.\"\n\nGrid aimed at the scarecrow. \"Okay! Magic Missile!\"\n\nA white flash struck the scarecrow.\n\n> **[You have dealt 2,894 damage to the target.]**\n\nThe effects of various titles, Malacus' Cloak and the Black Quartz Earrings meant that he currently had **1,048** intelligence. The resulting magic power was **1,258**. The buff on the pavranium increased magic power by 15%, so Grid's final magic power was **1,447**.\n\nThe expected maximum damage of Magic Missile (Enhanced) was 2,894, and this was the result that emerged. Laella was startled.\n\n*Isn't this surprisingly powerful? Is he wearing items that amplify magic power?*\n\nA blacksmith didn't invest points in the intelligence stat. Laella thought that Grid had 400 intelligence at most. The damage that users could exercise with a Lv. 1 Magic Missile and 400 magic power was very small.\n\nGrid's Magic Missile was remarkably powerful. Grid spoke to the stunned Laella.\n\n\"Increase the scarecrow's magic resistance to the maximum.\"\n\nThe maximum was 5,000. Even most boss monsters didn't have this much magic resistance. Magic Missile would be completely ineffective against it.\n\nLaella shook her head. \"There will be no damage.\"\n\nGrid just urged her. \"Hurry.\"\n\n*It's a pointless experiment.*\n\nLaella thought that Grid was so excited about magic that rational judgment was impossible. She imagined Grid's look of disappointment as she set the scarecrow's magic resistance to 5,000. Then after a while.\n\n> **[You have dealt 2,894 damage to the target.]**\n\nLaella's jaw dropped. \"W-What?\"\n\nGrid's Magic Missile ignored 100% of the target's magic resistance. In short, it was a scam. Laella hiccuped with surprise, while Grid made a satisfied expression.\n\n*It isn't very efficient in hunting or raids.*\n\nIt was great against users whose maximum health was only 10,000. The activation time was one second and the cooldown time was five seconds. It was a spell that would be very useful in PvP.\n\nA dark smile appeared on Grid's face. Then a guest came to see him. It was a completely unexpected guest."
}