{
  "id": 312,
  "title": "Chapter 312",
  "content": "# Chapter 312\n\nThe test complete, Grid left the training grounds and made his way to Khan's smithy. The familiar clang of hammers against anvils echoed through the stone corridors long before he reached the workshop.\n\nThanks to Grid's support, Khan had climbed to Advanced Blacksmithing level 7. He'd grown into something more than the struggling craftsman from Winston. Now he stood at the center of a sprawling operation, supervising over eighty young blacksmiths while personally overseeing production of military supplies for Rabbit and the army.\n\nGrid pushed through the heavy oak doors. The heat hit him first, followed by the acrid smell of hot metal and coal smoke. Khan stood near the central forge, his sleeves rolled up, pointing out a flaw in a sword blade to a younger smith.\n\n\"You look younger.\"\n\nKhan turned. The lines around his eyes crinkled as he smiled. He did look better. The gray in his beard seemed less pronounced, his movements steadier.\n\n\"Spend your days with the young, you can't help but feel younger.\" Khan wiped his hands on his apron. \"This is all because of you. At the end of my life, I never imagined I'd know such blessings.\"\n\n\"I'm glad.\"\n\nGrid had known Khan since his invisible days in Winston. Back when debt collectors hounded him and every NPC treated him like trash, Khan had been different. That bond ran deep on both sides.\n\nKhan's expression grew serious. \"For the rest of my life, I'll work hard for you. I'll raise the blacksmiths of Reidan until the day I die.\"\n\n\"Don't talk like that.\" Grid's voice sharpened. \"You're still young and healthy. You have years left.\"\n\nHe glanced around the workshop. Every hammer had gone still. The other blacksmiths stood frozen at their stations, staring at him with wide eyes. *Right. The duke just walked in.*\n\n\"Keep working,\" Grid said. \"Don't mind me.\"\n\n\"Yes, my lord!\"\n\nThey bowed in unison, then scattered back to their forges. The hammering resumed, though Grid caught several nervous glances thrown his way.\n\nHe moved to stand beside Khan, watching the apprentices work. \"Two intermediate blacksmiths already?\"\n\n\"Three, actually. One just advanced yesterday.\"\n\nSix months. They'd only been training for six months. The growth rate was staggering.\n\nKhan tapped his hammer against his palm. \"The environment matters. They watch a legendary blacksmith work. They learn from two masters. Their talent has room to bloom.\"\n\n*He's right.* Talent without opportunity was just wasted potential. These smiths had access to techniques and guidance that most craftsmen would kill for.\n\n\"Then I'm counting on you, Khan.\" Grid met his friend's eyes. \"Stay healthy. Keep teaching them. Until every one of them becomes a craftsman.\"\n\nKhan was more than a colleague. He was the first real friend Grid had ever made. The thought of losing him twisted something in Grid's chest.\n\nKhan laughed. \"I understand. I'll survive stubbornly and raise ten thousand craftsmen.\"\n\n*A joke. But I want it to be real.*\n\n\"I'm looking forward to it.\"\n\n\"Hah. You want this old man to overdo it.\"\n\n\"You won't grow old. You'll still be hammering away at seventy.\"\n\n\"What, locked in a cage?\"\n\n\"Now that you mention it...\"\n\nA duke and a commoner, trading jokes like equals. The difference in their stations couldn't be measured. Yet here they stood, comfortable as old drinking buddies.\n\n*Our teacher really is incredible.*\n\nThe watching apprentices felt their respect for Khan deepen. Their hammers struck with renewed vigor.\n\nThe sound of Reidan's forges didn't stop that day.\n\n***\n\nGrid left the smithy with a spring in his step. Promising blacksmiths. Real talent. The future looked bright.\n\nIrene appeared in the courtyard, her face lighting up when she saw him.\n\n\"Husband!\"\n\nShe rushed forward. Grid caught her as she pressed herself against his chest, her arms wrapping around him. The affection was always open, freely given. For someone who'd spent most of his life unloved, it never stopped feeling precious.\n\n\"I'm glad you're back safely.\" Her voice was muffled against his shirt.\n\nThe scent of jasmine soap clung to her hair. Her skin was warm where it touched his arms.\n\n\"I missed you.\"\n\n\"I missed you too.\"\n\nHe kissed her forehead. The gesture felt natural now. *When did I become someone who does this?* The old Grid, the one drowning in debt and social incompetence, would have frozen up.\n\n\"Indeed...\"\n\nGrid glanced over Irene's head. Lauel stood a few paces away, covering half his face with one hand. His visible eye gleamed with something Grid could only describe as 'excessive interest.'\n\n\"I saw the news about your transformation, but witnessing it in person...\" Lauel paused dramatically. \"Now I'm certain.\"\n\nGrid stared at him. \"Certain of what?\"\n\nLauel's shoulders shook. Not quite a laugh, more like suppressed excitement. \"You must have been my only friend and rival in a past life. Angel Sylvanus.\"\n\n*...*\n\nThe white hair. Lauel had seen Grid's white-haired Braham form on the news and apparently added it to his delusional worldview. Grid was now part of whatever fantasy Lauel lived in.\n\n*When will this sickness be cured?*\n\nGrid ignored him and placed a hand on Irene's stomach. Slight roundness met his palm. \"Two more months until we can meet Gold.\"\n\nIrene giggled. \"I can't wait for that day.\"\n\nLauel's expression shifted. The delusion vanished, replaced by genuine alarm. \"Grid. You're not seriously planning to name your child Gold.\"\n\n\"What?\"\n\n\"The baby. Please tell me Gold is just a placeholder name.\"\n\n\"Of course it's temporary.\" Grid frowned. \"What kind of idiot would actually name their kid Gold?\"\n\nLauel's relief was visible. Good. Grid's naming sense was catastrophically bad. He needed to make sure...\n\n\"So what will you name the child after it's born?\"\n\nGrid's expression grew confident. \"I was thinking Grene. After Irene.\"\n\nSilence.\n\n\"Grene,\" Grid repeated, as if the name explained itself.\n\nLauel's eye twitched. *This is a joke. It has to be a joke.*\n\nBut Grid looked proud. And Irene...\n\n\"Oh, husband!\" She clasped her hands together. \"Grene is such a pretty name! It would suit a boy or a girl perfectly.\"\n\n*What is happening.*\n\nIrene's absolute faith in Grid's judgment was terrifying. She thought everything he suggested was brilliant. Grid's absurd dexterity stat had apparently infected real life, turning even his terrible ideas into treasures in her eyes.\n\nLauel said nothing. There was nothing to say.\n\n***\n\nGrid's office was quieter. Piaro stood at attention, his farming clothes somehow maintaining an aura of military discipline.\n\n\"What do you know about the Third Prince of the Saharan Empire?\"\n\nPiaro's expression didn't change, but his eyes sharpened. \"Third son of the deceased Empress Aria. Introverted, unlike his siblings. I only saw him a handful of times. Never spoke to him directly.\" He paused. \"Why do you ask?\"\n\nGrid pulled the Amethyst Shield from his inventory. Purple light gleamed off its polished surface as he set it on the desk.\n\nPiaro's eyes widened. \"How did you get that?\"\n\n\"Guardian of the Forest dropped it.\" Grid tapped the shield's rim. \"Apparently it was some sort of ceremonial object?\"\n\n\"A symbol passed down through generations of Red Knight captains.\"\n\n\"Is it special?\"\n\n\"No.\" Piaro shook his head. \"Just a fancy decoration. The actual defensive properties are mediocre.\"\n\n\"Then why is the Third Prince looking for it?\"\n\nPiaro's brow furrowed. \"The Third Prince? Looking for the shield?\"\n\n\"He's searching for several items. This is one of them.\"\n\n\"Hm.\" Piaro crossed his arms, thinking. \"Now that you mention it, I remember hearing about his interest in rituals. It was a hobby of his. Collecting ceremonial implements, studying old rites.\"\n\n\"What kind of rituals?\"\n\n\"No idea. But if he wants the Amethyst Shield, it's probably part of whatever he's researching.\"\n\n*Rituals.* Grid's mind turned over possibilities. Black magic? Summoning? Something worse?\n\n*This could be trouble.* Handing powerful ritual components to an imperial prince seemed unwise. *But if it's connected to a quest line, ignoring it completely would be stupid.*\n\nNo rush, though. He had other priorities.\n\nA whisper notification blinked in the corner of his vision.\n\n> [Whisper - Lauel: A guest has arrived.]\n\n*Guest?*\n\nAnyone capable of reaching Reidan was significant by default. For Lauel to bother him about it, the visitor had to be important.\n\n> [Whisper - Grid: Who?]\n\n> [Whisper - Lauel: Chris.]\n\n> [Whisper - Grid: Chris? Third on the unified rankings?]\n\n> [Whisper - Lauel: Yes.]\n\nChris. Master of the Giant Guild, one of the seven great guilds. Grid hadn't heard much about him since the National Competition and the Reinhardt invasion.\n\n*But Chris has a hostile relationship with the old Tzedakah Guild.*\n\nWhat would drive him to risk coming here?\n\nCuriosity piqued, Grid stood.\n\n> [Whisper - Grid: Bring him to the drawing room.]\n\n***\n\nThe Giant Guild had suffered after losing their territory in the golem invasion. Six months of struggle. Chris's reputation had taken a hit after his loss to Regas at the National Competition.\n\nBut they'd endured. More than that, they'd grown stronger. Chris had obtained a powerful second class. His combat ability had multiplied.\n\nOnly one problem remained.\n\nHe couldn't find a weapon worthy of his new strength.\n\nTwenty-four hours a day, he or his subordinates monitored the trading sites. The auction houses. Nothing appeared that met his requirements. The frustration gnawed at him. In a game like Satisfy, items mattered. Power without the right equipment was wasted potential.\n\nSo he came to Grid.\n\n\"Make me the strongest weapon.\"\n\nGrid studied the man across from him. Third on the unified rankings. They'd never met properly, only glimpses at events or on news broadcasts. The old conflict between Giant Guild and Tzedakah Guild was history Grid knew secondhand.\n\nPersonally? He had no grudge against Chris.\n\nBut the others did.\n\n\"Jishuka hates you.\" Grid leaned back in his chair. \"Why should I ignore my guild members' feelings to make you an item?\"\n\nThe advantage was his. Grid held a much higher position now. It was accidental, really. He hadn't planned to have the upper hand. But it worked beautifully.\n\nChris had to bow.\n\n\"I'll pay well.\" Chris's voice stayed level. \"Besides, the Tzedakah Guild doesn't truly hate me.\"\n\n\"Then why the feud?\"\n\n\"I picked the fight. They responded.\" Chris's jaw tightened. \"One-sided competition on my part.\"\n\nIn the previous game, L.T.S., the Giant Guild had always lost to Tzedakah. Always. The defeats had built into an obsession, a need to prove themselves. That competitiveness had carried into Satisfy.\n\nThe Tzedakah Guild, meanwhile, had barely noticed them. The victim clinging to a relationship the victor had forgotten.\n\n\"I'll verify that.\" Grid drummed his fingers on the armrest. \"Assuming it checks out, how much are you offering?\"\n\n\"Something more valuable than gold.\"\n\nChris reached into his inventory. A small crystal vial materialized in his palm. Purple liquid swirled inside.\n\nGrid's eyes locked onto it.\n\n> [**Agility Elixir**]\n> Rating: Legendary\n> Permanently increases Agility by 10 points.\n\n*Elixir.*\n\nEven after clearing five vampire cities, these were rare. Companies with bottomless wallets competed for them. Top rankers hoarded them. Supply was scarce. Prices were insane.\n\nAnd Grid needed them. Specifically, the agility elixir. His swordsmanship would only reach its full potential when his agility matched his strength. \n\nBy coincidence or design, Chris had brought exactly what he needed.\n\nGrid's mind raced. *This deal is too good to refuse.*\n\nBut complications existed. Chris might become an enemy of Overgeared. Strengthening a potential enemy was foolish.\n\n*But the reward is too valuable to pass up.*\n\nA slow smile spread across Grid's face. *Unless...*\n\nHis expression turned wicked as he stared at the elixir.\n\n*I have an idea.*\n\n---\n\n**Glossary of Common Korean Terms:**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}