{
  "id": 313,
  "title": "Chapter 313",
  "content": "# Chapter 313\n\nChris leaned back, fingers steepled. *Grid will accept the deal.*\n\nElixirs commanded absurd value in Satisfy. Among the hundreds of potions and medicines flooding the market, elixirs stood alone. Their effects were singular, irreplaceable.\n\n*A single dose can raise a stat by ten points.*\n\nThe equivalent of an entire level, compressed into a vial. Chris studied Grid's expression. *Who could refuse this?*\n\nNo one. Absolutely no one.\n\n\"Okay, I will make you a weapon.\"\n\nGrid's acceptance came without hesitation.\n\n\"Please make me the best weapon.\" Chris shifted forward, eyes locking on the blue greatsword strapped to Grid's back. \"Like that one.\"\n\nHe would walk away if Grid tried to pass off inferior work.\n\n\"Believe in me.\"\n\nGrid spoke with conviction. The elixir was valuable, yes, but this request carried something more. Pride. Recognition.\n\n*'Please make me the best weapon.'*\n\nThe first commission from outside his guild. As Overgeared's master and a legendary blacksmith, the weight of it settled over him like a mantle. This wouldn't be half-assed work.\n\n*I'll add this to the Grid set.*\n\nAfter the boots, a greatsword. He mentally catalogued his arsenal. <span class=\"rarity-legendary\">Failure</span>, the reproduction of <span class=\"rarity-unique\">Dainsleif</span>, the <span class=\"rarity-legendary\">Doppelganger's Greatsword</span>, <span class=\"rarity-legendary\">Lifael's Spear</span>, <span class=\"rarity-legendary\">Iyarugt</span>. Every blade that had served him well would inform this new creation.\n\n*A special option. Something unique.*\n\nGrid's smile turned calculating.\n\n***\n\n\"I can't see the Tzedakah Guild members anywhere.\"\n\n\"Hiding, probably. They heard we were coming.\"\n\nFive figures occupied Reidan Castle's garden. The captains of the Giant Guild had accompanied Grid here, expecting confrontation. Instead, they found emptiness.\n\n\"I wanted to see Regas.\" Mihara's disappointment colored his tone. \"It's been too long.\"\n\nThe magic swordsman ranked first in his class. Against Regas, his record stood at three draws and eleven losses. Humiliating. Today was supposed to add a win to that tally, but Regas was nowhere to be found.\n\n\"We didn't come here to fight.\" Zirkan's voice cut through the complaints. \"Suppress your emotions. Don't make trouble.\"\n\nThe swordsman ranked first in his category spoke with authority. He'd briefly lost his position to Ibellin, but reclaimed it quickly enough. The rookie had promise, true. Skill, even. But experience? That took time Ibellin hadn't spent yet.\n\n\"Sorry, sorry.\" Mihara raised his hands in surrender. \"Just saying. I'll behave.\"\n\nWild as he was, self-indulgent as he could be, Mihara deferred to Zirkan. They all did. Chris's teacher commanded respect that transcended rank.\n\n\"This castle, though.\" Pinky wrinkled her nose. \"There's nothing to see.\"\n\nReidan Castle sprawled before them, massive and graceless. No gardens worth mentioning. No ornamentation. Just stone and function.\n\n\"The population is small.\" Another captain gestured toward the empty streets beyond the walls.\n\nReidan qualified as a big city on paper. In reality? A ghost town. The desert's difficulty discouraged settlers. Accessibility remained abysmal.\n\n\"Development is much slower than we predicted.\"\n\n\"They barely have thirty members in Overgeared. They can't manage a city this size properly.\"\n\n\"The farming is doing well, isn't it?\"\n\n\"That just shows their incompetence.\" The speaker shook his head. \"A city this large, reduced to agriculture.\"\n\nCombat skills meant nothing without administrative ability. The Giant Guild captains reached silent consensus. Overgeared excelled at fighting. Everything else? Lacking.\n\nThey remained ignorant of the truth. The secret absorption of the Silver Knights Guild. The yellow mithril mine hidden somewhere in the endless dunes. \n\nBairan, a small city in the north of the Eternal Kingdom. Cork Island with its resource wealth. If these captains knew Overgeared's forces were split across three strategic locations...\n\nThey would be shocked by Overgeared's true power.\n\n\"I'm bored.\" Mihara stood abruptly. \"Going for a walk. Call me when Chris finishes.\"\n\n\"Don't cause any incidents.\"\n\n\"Okay, I understand. Who do you think I am?\"\n\nMihara's laughter rang out as he departed. He'd already dismissed the Overgeared members as beneath notice. Just a distraction to kill time.\n\n***\n\n\"Wow, there really is nothing to see. How is this a duchy?\"\n\nMihara's mood had soured completely. No Regas. No challenge. He craved stimulation, and Reidan offered only tedium.\n\nThen he stopped.\n\nAn old fountain caught his eye. More specifically, the pretty NPC maid tending flowers nearby.\n\n\"This is perfect for wasting time.\"\n\nHe approached.\n\n\"Hey.\" His hand shot out. \"Let me touch your body.\"\n\nQuest-givers earned respect. Everyone else? Disposable. Low-status NPCs barely qualified as people in most users' eyes. Humans always hurt each other. Extending protection to code and polygons? Impossible. This freedom was Satisfy's greatest asset and its biggest problem.\n\n\"Kyaaak!\"\n\nThe maid recoiled, water sloshing from her bucket. Horror twisted her features as this stranger groped her.\n\nMihara found her reaction funny.\n\n\"What are you screaming about? Isn't it just a small touch?\"\n\n\"Who are you?\"\n\nThe voice rumbled from behind, deep and controlled. Mihara turned.\n\nA middle-aged man stood there, gripping a hand plow. Farmer's clothes, farmer's tools. His nameplate read: Piaro. Just another NPC, like the maid.\n\n\"This is an agricultural city, so there are farmers everywhere.\" Mihara waved dismissively.\n\n\"Get lost.\"\n\n\"I asked who you were.\"\n\nInstead of retreating, Piaro stepped closer. Mihara ignored him. The maid's body demanded more attention than some field hand. He reached for her again.\n\n\"All of Reidan belongs to Duke Grid.\" Piaro's voice dropped even lower. \"Even the emperor of the Saharan Empire can't covet anything here.\"\n\nMihara frowned.\n\n\"This bastard is talking nonsense. I am busy touching this maid's... *Heok?*\"\n\nThe hand plow blurred toward his face.\n\nMihara's level and agility barely gave him enough warning. He triggered Haste, evading the tool by centimeters. Anger flooded through him.\n\n\"How dare a farmer threaten me?\"\n\n*Hwaruruk!*\n\nHe pulled out his flaming sword. At this point, the threat from a mere farmer had blurred his judgment. He would kill Piaro.\n\nFrom Piaro's viewpoint, the display was nothing.\n\n\"This is Reidan.\"\n\n*Teong!*\n\n\"What...!?\"\n\nMihara stared in astonishment. The farmer had thrown something. A seed. A tiny seed.\n\n\"You trash.\"\n\n*Teong!*\n\n\"Keook!\"\n\nThe projectile cracked against his forehead.\n\n> [You have suffered 9,150 damage.]\n\n*This doesn't make sense!*\n\n\"This is a place where a person like you isn't allowed.\"\n\n*Teong!*\n\n\"Kuaack!\"\n\nMihara shrieked. Another seed struck his heart, agony lancing through his avatar.\n\n*Will I be killed by a seed?*\n\nHe checked his health gauge. This had to be a nightmare. Seeds. The farmer was throwing seeds at the first-ranked magic swordsman. Tiny projectiles like sunflower seeds. He couldn't die to this.\n\nReality was relentless.\n\n> [You have died.]\n\nA fourth seed struck his forehead. Grey washed over his vision.\n\n*I won't touch an NPC's butt again!*\n\nThe NPC protection system had been strengthened. Drastically. Mihara logged out.\n\n***\n\n> **[Legendary Blacksmith's Creation Skill]**\n>\n> You can create three equipment item production methods every time the skill level of the 'Legendary Blacksmith's Craftsmanship Skill' goes up.\n>\n> Number of items that can be created at present: 12/18.\n>\n> * When items are produced using this skill, the name of the creator is automatically placed on the item.\n\nA long time had passed since crafting <span class=\"rarity-epic\">Grid's Boots</span>. Now Grid began designing again. Before creating the greatsword, he sketched the plan in his head. Tremendous prudence, compared to the days when he created items without any thought.\n\n*The worst thing about Failure is the excessive size.*\n\nBigger greatswords looked cool. That logic had driven him to design <span class=\"rarity-legendary\">Failure</span> at three meters long, but he'd experienced discomfort after using it. Recovery took too long. Terrain constantly constrained movement. The damn thing hit the floor constantly.\n\n*One meter forty centimeters is most suitable.*\n\nWidth should increase by four centimeters. One advantage of a greatsword was its suitability for defense.\n\n*More weight.*\n\n<span class=\"rarity-legendary\">Failure</span>'s biggest advantage was the blue orichalcum construction keeping it lightweight. Attack speed didn't decrease despite its size, but destructive power wasn't maximized. No weight behind the strikes.\n\n*Blue orichalcum and black iron mixed.*\n\nIncreasing the blue orichalcum content would maximize the blade's cutting power, while black iron would add necessary weight.\n\nGrid closed his eyes. His hands moved unconsciously, sketching shapes in the air as he visualized the new item. The young blacksmiths in the smithy couldn't understand his behavior.\n\n\"Why is he only doing that after coming to work?\"\n\n\"Is he taking a nap?\"\n\n\"What reason would he have for taking a nap? That is meditation. The duke is trying to figure out the type of weapon he will create before he begins.\"\n\n*Hoh.*\n\nAmong the blacksmiths sharing opinions, there were those with exceptional eyes. The two young men who'd become intermediate blacksmiths first. Khan's evaluation of them increased.\n\n*They are the children who will be a great force for Grid after me.*\n\nKhan had given a break to all the blacksmiths. He wanted to give them a chance to see Grid work. The young blacksmiths asked questions as they observed Grid's actions, allowing them to grow step by step.\n\n\"Now.\" Grid opened his eyes. \"Let's get started.\"\n\nHe used the Item Creation skill and designed Grid's Greatsword. Then he finally pulled out his hammer.\n\n*Ttang! Ttang!*\n\nThe young blacksmiths of Reidan watched every move the legendary blacksmith made.\n\n***\n\nThree days after Grid received the commission.\n\n> -It is completed.\n\nChris had been hunting monsters in the desert when Grid's whisper finally arrived. He headed straight toward Reidan, joy propelling him forward.\n\n\"Ohh...!\"\n\nChris was amazed as he received the item details. The weapon's performance exceeded expectations. Then his face stiffened after checking the options.\n\n**This item can only be repaired by the maker.**\n\n*This guy!*\n\nWasn't he very sly, unlike the rumors of his stupidity? Chris hadn't realized Grid had grown steadily.\n\n\"Is it a deal?\" Grid smiled.\n\nChris was very displeased. But the weapon's performance was so desirable that he inevitably nodded.\n\n\"I will... trade...\"\n\nThe moment sealed it. The third-ranked user and head of the Giant Guild fell slave to the power of items. He'd become someone who couldn't live without Grid."
}