{
  "id": 314,
  "title": "Chapter 314",
  "content": "# Chapter 314\n\nGrid had always judged items by a single metric: performance. Nothing else mattered.\n\nIt made sense. Items existed to boost stats and make life easier. Performance was everything. He'd never questioned that approach.\n\nUntil now.\n\n*This bastard might become my enemy.*\n\nThe thought gnawed at him. Chris wasn't a guildmate. He wasn't even an ally. Just a customer who might one day point that weapon at Grid's throat.\n\n*I'll be damned if I arm a future opponent with my best work.*\n\nBut refusing the deal wasn't an option. The contract was signed. Gold had changed hands. So Grid needed insurance—a way to chain Chris to him whether the man liked it or not.\n\n*Make the buyer dependent on the creator.*\n\nSimple. Brutal. Effective.\n\n*This item can only be repaired by the maker.*\n\nA slave contract hidden inside a weapon. If Chris ever turned on Grid, his precious sword would become worthless scrap metal. No repairs. No maintenance. Just a slow degradation into uselessness.\n\nGrid's lips curled. *I need to make it so complicated that only I can fix it.*\n\nThe design itself wouldn't be a problem. He was a Legendary blacksmith, after all. Braham's words echoed in his mind—legends were transcendent beings. They didn't build walls for themselves.\n\n\"I'll design something no one can copy,\" Grid muttered, channeling Braham's arrogant tone.\n\nHe activated Item Creation. The blueprint materialized in his mind's eye. No frills. No decorative flourishes. Pure function. He balanced performance against usage requirements, weighing every stat point, every percentage modifier.\n\n*Combine the strengths. Make it distinct. Follow the basics but push the limits.*\n\nSix hours later, sweat dripped from his chin onto the workshop floor.\n\n> [Grid's Greatsword' has been added to the list of item production methods!]\n\nGrid exhaled slowly. His fingers trembled as he reviewed the finished design.\n\n---\n\n**<span class=\"rarity-unique\">Grid's Greatsword</span>** → **<span class=\"rarity-legendary\">Grid's Greatsword</span>**  \n**Rating:** <span class=\"rarity-unique\">Unique</span> ~ <span class=\"rarity-legendary\">Legendary</span>\n\n**<span class=\"rarity-unique\">Unique</span> Rating Information:**  \nDurability: 575/575  \nAttack Power: 953~1,191  \nAttack Speed: -5%\n\n* Low probability of blocking enemy attacks.\n* Certain probability of activating **3 Joint Attacks**.\n* Slashing damage +20%.\n* Skill damage +10%.\n* Attack power +20% in darkness.\n* 6th consecutive hit on same target: guaranteed critical.\n\n**<span class=\"rarity-legendary\">Legendary</span> Rating Information:**  \nDurability: 840/840  \nAttack Power: 1,274~1,440  \nAttack Speed: -3%\n\n* Certain probability of blocking enemy attacks.\n* Certain probability of activating **3 Joint Attacks**.\n* Slashing damage +30%.\n* Skill damage +20%.\n* Attack power +20% in darkness.\n* 5th consecutive hit on same target: guaranteed critical.\n* Link a skill within 0.5 seconds of **3 Joint Attacks**: bonus damage.\n\n*A weapon designed by the legendary blacksmith Grid. Black iron concentrated in a hidden groove along the spine maximizes weight and momentum, while blue orichalcum edges on both sides sharpen the cutting edge. The balance is flawless, allowing the wielder to execute perfect swordsmanship.*\n\n**User Restriction:** Level 300+. **Strength 2,800+**. Advanced Sword Mastery Lv. 5+.  \n***This item can only be repaired by the maker.***  \n**Weight:** 1,540\n\n---\n\n\"Yes!\"\n\nGrid pumped his fist. Grid's Greatsword wasn't objectively superior to Failure—his +9 legendary blade still had better attack speed, higher maximum damage, and more durability. Both required Level 300.\n\nBut this new design was *better* in the ways that mattered.\n\n*Failure is too big. Too awkward. This one's properly sized.*\n\nMore importantly, Grid's Greatsword had a much higher minimum attack power. Maximum damage was flashy, but minimums determined consistent output. You always dealt at least that much damage. Combined with the slashing and skill damage bonuses, the total damage-per-second would be competitive.\n\nThe only downside was **3 Joint Attacks** instead of **5 Joint Attacks**. Grid had tried to replicate Failure's best features, but the system had resisted.\n\nHe shrugged. *Probably for the best. Five attacks would've made the requirements insane.*\n\nBesides, Grid's Greatsword had a secret. That deep groove running down the center wasn't decorative. It served a function—one that only Grid, the designer, understood.\n\nHe turned toward the furnace, already calculating materials.\n\nTwenty-nine blue orichalcum.  \nNinety-nine black iron.  \nOne thousand two hundred ninety iron ore.  \nThirty-two mithril.\n\nBlue orichalcum only dropped from the Guardian of the Forest. A raid boss that spawned once every three months. Most players would never own a single piece.\n\nGrid had twenty-nine.\n\n*Thank you, Jishuka.*\n\nWhile managing Bairan as its Lady, Jishuka had organized regular Guardian raids. Every piece of blue orichalcum went straight to Grid. The value was incalculable. He owed her more than he could repay.\n\nGrid began melting minerals. The young blacksmiths watched in silence, absorbing his perfect temperature control and his instinctive understanding of each material's properties.\n\n***\n\nTwo days.\n\nGrid hadn't slept. Hadn't logged out. He'd eaten nothing but dried meat and water while hunched over the forge.\n\nNow two greatswords lay before him on the workbench. Black metal with deep central grooves. Blades that caught the light with a subtle blue shimmer. The color harmony looked expensive—premium—like the weapon itself elevated the wielder's status just by existing.\n\nBut both were incomplete. No handles.\n\nGrid sighed.\n\nThe young blacksmiths exchanged confused glances.\n\n*Why's he hesitating?*\n\n*Is something wrong?*\n\nThey assumed Grid had some profound reason for delaying the final step. They were wrong.\n\nGrid was terrified.\n\n*What if both turn out Unique?*\n\nHe'd burned through nineteen blue orichalcum and forty-four black iron to create a single greatsword. Black iron was common enough—you could buy it with gold. But blue orichalcum? Nineteen pieces represented over a year of Jishuka's farming.\n\n*If I waste it all on Unique gear...*\n\nHis hands shook.\n\nThere was also the \"special event\" triggered by crafting a 10th legendary item. Grid knew penalties were coming. But he *needed* this to be Legendary. He couldn't avoid legendary crafts forever. Eventually, he'd have to face whatever the system threw at him.\n\n*Please...*\n\nHe gripped the hammer so hard his knuckles went white.\n\n*God, Buddha, Goddess Rebecca, God Yatan—I don't care who. Just give me this one thing!*\n\nPraying to Yatan, the God of Destruction. Grid was that desperate.\n\nHe attached the first handle.\n\n> [You have succeeded in making **<span class=\"rarity-legendary\">Grid's Greatsword (Legendary)</span>**!]\n> \n> [A legendary rated item was produced, so all stats have permanently risen by **+10** and reputation throughout the continent has risen by **+500**.]\n\nGrid's heart stopped. Then started again, faster.\n\nHe attached the second handle before his luck ran out.\n\n> [You have succeeded in making **<span class=\"rarity-legendary\">Grid's Greatsword (Legendary)</span>**!]\n> \n> [A legendary rated item was produced, so all stats have permanently risen by **+10** and reputation throughout the continent has risen by **+500**.]\n\n\"Ohh...! Ohhh!!\"\n\nThe blacksmiths stared, mouths hanging open. Khan wiped his eyes. The old man was crying—proud that his student had created something so magnificent.\n\nGrid barely heard them.\n\n> [You have proven your potential by making 10 legendary items.]\n> \n> [Now you are growing into a blacksmith comparable to Pagma.]\n> \n> [The penalty that occurs when an item's usage conditions aren't met has disappeared.]\n\n\"No more penalties!\"\n\nGrid's eyes went wide. The chains that had dragged him down since becoming Pagma's Descendant—gone. Just like that. He could equip anything he made without suffering stat reductions.\n\n*I'm free. I'm finally—*\n\n> [Your growth has deteriorated due to the blossoming of your potential.]\n> \n> [You won't acquire any additional stats in the future when making items with a <span class=\"rarity-unique\">Unique</span> rating.]\n\n\"You piece of shit!\"\n\nHe'd expected a penalty. Knowing it was coming didn't make it sting less.\n\n*From now on, only Legendary items give stats...*\n\nHis legendary production rate was abysmal. One year as Pagma's Descendant had yielded only eleven legendary items. Eleven. The math was depressing.\n\nGrid clenched his jaw. A few months ago, he would've spent days raging at the developers, cursing the game's balance, drowning in self-pity.\n\nNow? The frustration lasted maybe ten seconds.\n\n*...It's not that bad.*\n\nSure, his stat growth from crafting had been kneecapped. But the usage penalty was gone. That meant something huge.\n\n*I can finally go full overgeared.*\n\nNo potions. No skill spam. Just pure item dominance. Gear so powerful it didn't matter what class, level, or skills his opponent had.\n\nThe legend of being overgeared had officially begun.\n\n***\n\n\"I'll... accept the trade...\"\n\nChris stared at the legendary **<span class=\"rarity-legendary\">Grid's Greatsword</span>** stats. His throat worked. He tried to find a way out, a reason to refuse.\n\nThere wasn't one.\n\nThis was a slave contract. If Chris ever became Grid's enemy, his weapon would rot. No repairs. No maintenance. Grid controlled the item's lifespan, which meant he controlled Chris.\n\n\"Great. Let's work well together.\" Grid extended his hand, smiling.\n\n\"...\"\n\nChris looked at that smile and wondered—not for the first time—if this was a mistake.\n\nBut the sword. Level 314, and this was the best weapon he'd ever seen. Better than anything in the auction house. Better than guild master equipment. Better than anything short of raid boss drops.\n\n\"P-Please take care of me...\"\n\nHis handshake was limp. Defeated.\n\nGrid's eyes were calm. Confident. The anxiety and desperation that once defined him had burned away, replaced by something colder. Sharper.\n\n*The attitude of a legend,* Chris thought. *Just like Braham said.*\n\n---\n\n**Glossary of Common Korean Terms**  \nOG: Glossary Link  \nCurrent schedule: 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}