{
  "id": 315,
  "title": "Chapter 315",
  "content": "# Chapter 315\n\n> [Your agility has increased by 10.]\n\nGrid swallowed the elixir without ceremony. The liquid burned cold down his throat, and his muscles responded, fibers tightening beneath his skin. He flexed his fingers. Lighter. Faster.\n\n**Strength: 2,790**  \n**Agility: 1,756**\n\n*Still a thousand miles to go.*\n\nHe'd need 104 levels to balance those stats at a 1:1 ratio. The math alone made his head hurt. Tallos, Amoract's agent, that bastard had given him 2.6 billion experience. A mountain of points. One level.\n\n*One.*\n\n*Every level, the experience requirements balloon. No wonder no one's hit fourth advancement yet.*\n\nExcept maybe Kraugel. That freak sat at level 319, four levels above second place.\n\n*Monster. Probably does nothing but hunt.*\n\nGrid had never met the man. Never even saw him on broadcasts. But the numbers didn't lie. The 1st ranker's leveling ability existed in a different dimension.\n\n*Would be nice to chug agility elixirs like water.*\n\nA fantasy. Elixirs were rare as dragon's teeth. This deal with Chris was a once-in-a-lifetime fluke.\n\nGrid pulled up his guild interface. The Pavranium Expedition was still grinding through the vampire cities, their health bars a steady rhythm of damage and recovery. The Elfin Stone raid had gifted them all with temporary buffs.\n\n*Damn. Pon and Regas hit 308 already?*\n\nThe experience gain had to be obscene.\n\n*Time to get back to work.*\n\n> [Experience and item acquisition rate has increased by 5%. This effect only applies to the vampire cities. The time remaining is 25 days, 13 hours, 40 minutes and 15 seconds.]\n\nTwenty-five and a half days. If he hunted smart, kept the buff active, maybe he'd squeeze out three levels. An elixir if the goddess smiled on him.\n\nBut first, the smithy.\n\n***\n\n\"Item Creation.\"\n\n> [What item do you want to create?]\n\n\"Armor.\"\n\n> [What materials would you like to use?]\n\n\"Blue orichalcum and black iron.\"\n\n> [Please design the item.]\n\nThe blank blueprint materialized, a ghost of white lines hanging in the air. His seventh design. The movements came easier now, muscle memory guiding his hands through the interface.\n\nHe sketched plates, joints, coverage zones. After twenty minutes of adjustments, he had something that didn't look like trash. Time for the fun part.\n\n\"This armor can never be pierced. It won't get any scratches from a sword, and even a dragon's breath won't melt it.\"\n\n> [That isn't possible. There are limits on the level of material and design used.]\n\n\"...Yeah. Figured.\"\n\nThe item penalty was gone, sure. But his fever dream of 999,999,999 attack power weapons and impenetrable god-armor remained exactly that. A dream.\n\nHis **Legendary Blacksmith's Craftsmanship** skill sat at level 6, **Understanding of Gods' Weapons**. Blue orichalcum and black iron together could produce something marginally better than <span class=\"rarity-legendary\">Failure</span>. That sword had been created without usage restrictions, a pure expression of stats over practicality.\n\n*Pavranium changes the equation. But I'd need to design something on Lifael's Spear's level.*\n\nHis design skills weren't there. Not yet.\n\n*Better to use pavranium for secondary items. Need to find minerals that outclass blue orichalcum first.*\n\nGrid dismissed the blueprint and called up Minor's location. The minerals detector appeared in the smithy moments later, his young face already twisted in a scowl.\n\n\"Find and report on any minerals that are superior to blue orichalcum.\"\n\n\"Huh?\" Minor's frown deepened. \"Didn't you promise to let me live as a miner if you collected all the pavranium?\"\n\nThe boy's innate talent was detection, not excavation. But Minor dreamed bigger. He wanted to surpass Gis, become a legendary miner, rise to become the right hand of an emperor. And Grid kept crushing that dream under his boot.\n\nGrid rested a hand on Minor's thin shoulder. The kid was all bone and tension.\n\n\"Endure it a little longer. Don't you know that I am a legendary blacksmith? I sincerely hope that you will become a great miner and give strength to me. But not yet.\"\n\n\"Kuoh...!\" Minor's teeth ground together. His eyes held poison.\n\n*Kid's plotting betrayal.*\n\nGrid suppressed a sigh. Minor had talent, no question. The potential to become an excellent miner. But the **Great Lord's Sword** told the truth, could read an NPC's ceiling. Minor would never reach legendary. His dream was stillborn.\n\n*You're a detector. Accept it.*\n\nMinerals detection was rare. Grid had observed hundreds of NPCs across Winston, Bairan, and Reidan. Minor was the only one with the talent. If the boy grew into that role, embraced it, he'd become an irreplaceable asset.\n\n\"Hasn't your mother's health worsened in Bairan? I will talk to the lord of Bairan to give your mother the best treatment. Now Minor. If you want your mother to regain her health, go on an adventure. Find the best minerals. Fighting!\"\n\n\"Shit...! Shit! This evil person!\"\n\nMinor was fourteen. Grid had just shoved a knife into his softest spot and twisted. The kid fled, shoulders shaking.\n\n*It's for his own good.*\n\nHe believed that. A life as a master detector beat wasting years chasing an impossible dream.\n\nGrid opened a whisper to Euphemina.\n\n*How many of the Water Clan King's Tears did you obtain?*\n\n*Four.*\n\n*Oh, that is a lot more than I thought?*\n\n**Water Clan King's Tears**. Permanently imbued items with magic. The Water Clan's King only cried once every five months, tears rarer than phoenix down. Four in three months was absurd luck.\n\n*I was lucky. I got a special quest.*\n\n*Special quest? What is it?*\n\n*Hehe, I'll tell you later.*\n\n*She's excited.*\n\nHad to be a good one. Her text practically vibrated with smugness.\n\n*Yes, I'm looking forward to the good news. If you have any difficulties along the way, please feel free to contact me. First of all, place the tears in the guild's warehouse.*\n\nMinutes later, Grid retrieved the tears from storage. The vials glowed faint blue in his palm. He set up his portable furnace and began smelting pavranium.\n\n***\n\nChris couldn't stop grinning.\n\n*A legendary item maker. Really exists.*\n\nThe deal favored Grid, no question. But the item, **Grid's Greatsword**, was everything he'd hoped for and more. It transcended common sense. Better than Kraugel's <span class=\"rarity-legendary\">White Fang</span>. Better than Seuron's <span class=\"rarity-legendary\">Brutal Heavy Sword</span>.\n\n*Good until level 360, easy.*\n\nNot an exaggeration. The greatsword outclassed the level 320 <span class=\"rarity-unique\">Unique</span> rated weapon he'd pulled from a raid. His analysis said even level 350-360 weapons wouldn't match this beast.\n\n*No weapon worries for ten months.*\n\nBut.\n\n*If Grid and the Overgeared members are all armed like this...*\n\nThe power disparity was getting dangerous. Chris wanted a kingdom, wanted the title of king and all the wealth and authority that came with it. From that perspective, Grid was becoming a roadblock.\n\n*Can't let them grow unchecked.*\n\n\"Let's go.\"\n\nChris nodded to the Five Captains. They moved toward the gate as a unit. Then Chris stopped.\n\n\"Mihara?\"\n\n\"Haven't seen him since three days ago.\" One of the captains frowned. \"Said he was heading to Pedro first.\"\n\nMihara's capricious personality made sudden departures normal. Chris shrugged it off.\n\n\"That guy. Huh?\"\n\nThe fields outside Reidan stretched wide and flat. And there, blocking the road, stood a farmer.\n\n\"Who are you?\"\n\nAsellas, one of the Five Captains, stepped forward. The farmer held out five hoes.\n\n\"Clear the ground.\"\n\n\"What?\"\n\nInsanity. A farmer appeared out of nowhere, demanding they work his fields? Chris blinked. The absurdity rendered him speechless for three full seconds.\n\n\"Why should we help you?\"\n\nThe farmer's logic was simple.\n\n\"Your companion dared touch a maid of Duke Grid's. You failed to properly control your companion, so now you will help develop Reidan's agriculture.\"\n\n*Molested a maid?*\n\nChris's mind flashed to Mihara. The stupid brat's track record spoke for itself.\n\n*Always causing incidents.*\n\nChris sighed. Nodded.\n\n\"I understand what you want to say. I will punish the one who touched the maid. Don't be too angry and open the path.\"\n\nThis was theater. Had to be. A weak farmer making noise about Mihara's sin, hoping for acknowledgment. Chris could humor him.\n\n\"I have already punished him, so now you have to work in the fields.\"\n\nAsellas's voice rose, sharp with indignation.\n\n\"Why do you keep talking nonsense? This is a viscount of the Eternal Kingdom and master of the Giant Guild, Chris! You shouldn't even look him in the eyes, so how can you skip etiquette and even ask him to work in the fields?\"\n\nThe farmer, Piaro, looked at Asellas the way a man looks at an insect.\n\n\"I watched from afar, and you didn't show any politeness towards Duke Grid. I'm just following your rude behavior.\"\n\n\"Rude behavior...!\"\n\nEtiquette between users was flexible, not like the rigid hierarchies NPCs lived by. Chris and his captains bowing to Grid? Impossible. This farmer didn't understand reality.\n\n\"Get lost!\"\n\nAsellas shoved forward. His hand reached for the farmer's wrist.\n\n\"Eek?\"\n\nThe sky replaced the ground in Asellas's vision. Then the ground slammed into his back, driving the air from his lungs. He lay there, stunned.\n\n*What...?*\n\nChris stared. The Five Captains stared.\n\n*Reidan's monster farmer. Not a rumor.*\n\nThe stories were true. Chris felt a spike of excitement and drew **Grid's Greatsword**, the weight satisfying in his grip.\n\n\"You're the one who knocked down Zibal? Those skills, show them to me!\"\n\nThe seven-guild alliance had failed to take Reidan because of farmers. Unidentified, impossibly strong farmers. And this one had beaten the 2nd ranked Zibal.\n\nChris had a second class now. He was 3rd ranked. Stronger than Zibal had to be.\n\nHe rushed forward."
}