{
  "id": 316,
  "title": "Chapter 316",
  "content": "# Chapter 316\n\nTwo defining moments had etched Grid's image into the public consciousness: the 1st National Competition and Reinhardt's golem invasion. In both, he'd wielded a greatsword. Yet when players discussed greatsword mastery, Chris's name came up first, not Grid's.\n\nThe reason was simple. Grid crushed opponents with overwhelming skills and legendary gear. His swordsmanship itself? Competent at best. Even against the Red Knights, his technique had been merely adequate.\n\nChris, though? His greatsword work bordered on artistry.\n\n\"You're the one who took down Zibal?\" Chris hefted **Grid's Greatsword**, testing its weight. Blue light rippled along the blade. \"Show me what you've got.\"\n\nThe weapon felt *perfect* in his grip. Substantial. Well-balanced. Not particularly fast, but the pressure radiating from it made his skin prickle.\n\nHis passive skill, **Rule with Might's Path**, was already doing its work. Any enemy caught in his charge path would find their casting speed and agility sapped.\n\nPiaro hadn't moved.\n\n*He's frozen.* Chris's lips curled. *Scared already?*\n\nThe thought deflated his excitement. *This is the man who killed Zibal?*\n\nStill, the farmer's level wasn't low. Chris could sense that much. But his own level was higher. At level 314 with over 3,000 Strength, Rule with Might's Path hit like a truck.\n\nChris closed the distance. Piaro remained motionless, a statue in shabby clothes.\n\nThe greatsword fell.\n\n**CRACK.**\n\nThe strike was economical. No wasted motion. Wind exploded outward, and his target stumbled back.\n\n*Perfect!*\n\nThe greatsword's size and balance let Chris recover faster than usual. In hundreds of battles with dozens of greatswords, he'd never found a weapon this *right*. It fit his hands like it had been forged for him alone.\n\nPride toward Grid swelled in his chest.\n\n*Wait. Did I just kill him?*\n\nNPCs only had one life. That single, precious existence defined them as NPCs rather than users. Guilt wormed through Chris's satisfaction.\n\n\"Eh?\"\n\nChris had been admiring the blade. When he looked up, confusion wiped every other thought away.\n\nPiaro was fine. Completely unharmed.\n\nThe farmer clicked his tongue. \"One strike and you're already looking away? Arrogance taken to the extreme.\" He shook his head. \"Confidence matters, but it can poison you just as easily.\"\n\n*I felt the impact. I know I hit something.*\n\nChris's gaze dropped. A straw hat lay at Piaro's feet, sliced clean through the middle.\n\n\"A ninja...!\"\n\nLike most Westerners, Chris harbored romantic notions about ninjas. He'd studied them casually, enough to recognize the substitution technique. Body-swapping with objects.\n\n*An assassin-type hidden class NPC!* The pieces clicked into place. *No wonder Zibal died.*\n\nHis muscles tensed. *Throwing knives? Lightning-fast strikes? What's coming?*\n\nAs a warrior, Chris had dumped most of his points into Strength. His Agility sat at a pathetic 200. Reacting to high-speed attacks on reflex alone? Impossible.\n\n*So I won't rely on reflexes.*\n\nChris set his stance. Preparation and prediction could bridge the gap where raw speed failed.\n\nPiaro's expression brightened. \"Excellent.\"\n\nThe farmer reached for his weapon.\n\nChris's throat worked. *What will it be? A kusarigama? Kunai? Maybe a chain whip?*\n\nHe ran calculations. Different weapons demanded different counters.\n\nWhat Piaro pulled out shattered every prediction.\n\n\"A hand plow!\"\n\nThe farming tool gleamed with moisture, soil still clinging to its surface.\n\n\"That's not a hand plow!\" Chris's voice cracked. \"You're trying to trick me!\"\n\n\"I assure you, I'm not.\"\n\nWords were unnecessary.\n\nPiaro moved.\n\n*So fast!*\n\nThe \"ideal distance\" Chris had carefully maintained evaporated in a heartbeat. The hand plow swept toward him.\n\n\"You—!\"\n\nChris swung with everything he had. The greatsword would cleave through that ridiculous farm tool and the man wielding it.\n\n*Clang.*\n\n\"What?\"\n\nThe plow caught the greatsword's edge mid-swing. Not a block. A *deflection*. Chris's balance shattered. His torso pitched forward.\n\n*What the hell?*\n\nThe Giant Guild captains watching from a distance gaped. They couldn't parse what had just happened.\n\nBut Chris understood. So did Zirkan.\n\n*He baited me!*\n\nLarge weapons carried tremendous mass. To maximize their destructive power, a wielder had to commit fully, concentrating weight behind each blow. Chris followed that principle religiously.\n\nPiaro had exploited it. He'd identified the exact point where Chris focused the greatsword's momentum and struck there, destroying his center of gravity with surgical precision.\n\n*This is absurd!*\n\nChris's mind flashed to old Hong Kong martial arts films. Heroes deflecting swords with chopsticks.\n\nThe plow came again, using the rebound from the first strike to fuel the second. Chris jerked his shoulders up. The plow aimed for his throat found his shoulder instead.\n\n> **[You have suffered 12,300 damage.]**\n\n*From a farming tool?!*\n\nEven accounting for a critical hit, the damage was obscene. This farmer hit harder than named bosses.\n\nChris threw his weight forward, limiting Piaro's range by closing to grappling distance. He wrenched the greatsword back into position.\n\nThe blade moved with fluid economy, arcing toward Piaro's heart. Hundreds of thousands of battles had honed Chris's instincts. Cornered or not, he could threaten an opponent.\n\n\"Sowing.\"\n\nPiaro's lips quirked. A shallow cut opened on his chest. He scattered seeds at Chris's feet.\n\n*Seeds? In the middle of a fight?*\n\nUnderstanding dawned. *A trick. Of course. He's a ninja.*\n\nNinjas relied on deception and misdirection. Chris kept his focus on Piaro, dismissing the seeds as a feint.\n\nFatal mistake.\n\n\"What—?\"\n\nThe seeds *sprouted*. Roots exploded from the soil, coiling around his ankles and thighs like iron cables.\n\n\"What *is* this?\"\n\nPlants didn't grow from scattered seeds in seconds. The pressure crushing his legs defied everything Chris understood about the world.\n\nBut legendary skills operated outside normal logic.\n\nPiaro had walked away from the path of **Sword Saint** to become a farmer. The **Free Farming** techniques he'd developed rivaled historical legends in power.\n\nThe Piaro standing before Chris now was stronger than the one who'd sparred with Grid.\n\n\"You're the second strongest person I've encountered.\" Piaro's tone held genuine respect. \"Be proud of your potential.\"\n\n*Second?* Chris's thoughts raced. *Then who's first?*\n\n*Zibal.*\n\nThe realization carved into his pride. One level. Just one level separated him from Zibal. Chris had told himself he was stronger despite the gap.\n\nApparently not.\n\n\"**RAAAAGH!**\"\n\nChris bellowed and swung at the plants binding him. An energy blade erupted from his weapon, rocketing toward Piaro's chest.\n\n**Rule with Might Sword**. Ranged devastation.\n\nThe blade would punch clean through—\n\n\"Free Farming 4th Style, Plowing the Field.\"\n\nPiaro drew a plow and struck the earth. Soil erupted upward, forming a barrier that absorbed the energy blade completely.\n\n\"This is *ridiculous*!\"\n\nSatisfy had been live for exactly two years and two months. Chris had trained every single day, chasing the number one spot. He wore best-in-slot gear.\n\nAnd a *farmer* was dismantling him with *farming techniques*.\n\nSowing. Plant cultivation. Plowing.\n\n*I can't accept this!*\n\nChris wrestled his emotions back under control. Piaro had beaten Zibal. Zibal outleveled him. Thinking he could waltz in and win was naive.\n\nBut he couldn't let it end here.\n\n\"**KUAAAAH!**\"\n\n**Tyrant's Strength** flooded his muscles. His Strength stat spiked by 20%. The plants binding his legs *shredded*, torn apart by raw power.\n\nPiaro observed with a critical eye.\n\n*My Rapid Growth needs work.*\n\nFree Farming Style 1, **Sowing**, and Style 2, **Rapid Growth**. The plants lacked durability. The technique hadn't matured yet.\n\n*More time in the fields.*\n\nEnergy blades converged on Piaro from multiple angles. The hand plow blurred, deflecting every strike. Then it lashed out, seeking Chris's balance point again.\n\n*He's learning fast.*\n\nPiaro's eyebrows rose. Each time the plow connected with the greatsword, Chris recovered more efficiently.\n\n*Better than Kraugel was when we first met.*\n\nAcknowledgment flickered across Piaro's face. He accelerated, the plow becoming a whirlwind.\n\nChris's skill meant nothing. The farmer's mastery with agricultural tools was absolute.\n\nBut Chris's momentum didn't waver. Piaro's plow cracked against his ribs. He didn't retreat. Instead, he roared:\n\n\"I'm stronger than Zibal!\"\n\n**BOOOOM.**\n\nThe shout carried physical force. Like a lion's challenge. Farmers across the field clutched their ears. Users stumbled. The Giant Guild captains reeled.\n\n**Tyrant's Growl**.\n\n*Now!*\n\nNo one could resist Tyrant's Growl completely. Chris lunged at the momentarily dazed Piaro.\n\nThe ground trembled. An earthquake rippled outward with Piaro at the epicenter.\n\nChris, immune to his own skill's effects, grinned. **Tyrant's Advent** would—\n\n\"Hm.\"\n\nChris's smile died.\n\nPiaro stood balanced on rice stalks that had erupted from cracks in the shattered earth, serene as a monk in meditation.\n\n\"You've damaged the land.\" Piaro's voice carried mild disapproval. \"You'll need to help repair it.\"\n\n\"...?\"\n\n*Is he saying I have to... work?*\n\nBefore Chris could process the absurdity, rice stalks rained down.\n\nHe swung the greatsword defensively.\n\n> **[Grid's Greatsword durability decreased by 10.]**\n> **[Grid's Greatsword durability decreased by 11.]**\n\nHollow rice. Weightless plants.\n\nThe stalks struck with force beyond aura. Concepts made physical.\n\nChris collapsed. Grid's Greatsword clattered beside him, blade spiderwebbed with cracks.\n\n---\n\n\"Repair my greatsword.\"\n\n\"What?\"\n\nTwenty minutes after their parting, Chris stood in front of Grid again. He thrust the damaged weapon forward.\n\nGrid's frown deepened as he examined the blade. \"What did you *do*? Fight a dragon?\"\n\n*You bastard!*\n\nChris bit his tongue. This was Grid's fault. Piaro belonged to Grid. Therefore, Grid had orchestrated this humiliation.\n\n*Is this a power play? Showing who's superior?*\n\nThe rumors called Grid stupid. The man before him was anything but.\n\nGrid extended his hand. \"Three gold per durability point.\"\n\n\"*What*?\"\n\nTen times the normal repair rate.\n\nExtortion. Blatant, shameless extortion.\n\nChris couldn't refuse.\n\n*This demon...* He handed over 853 gold with shaking hands. *I can't make an enemy of him. Ever.*\n\nHe trudged back to the fields, where the five captains of the Giant Guild waited.\n\nThey had work to do.\n\n---\n\n**Glossary of Common Korean Terms**\n**OG:** [Glossary Link]\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and bonus content. Early access chapters update after daily releases conclude."
}