{
  "id": 317,
  "title": "Chapter 317",
  "content": "# Chapter 317\n\nA chorus of complaints echoed across the field.\n\n\"This is impossible. How do they expect four hundred people to work land this size?\" One user leaned on his hoe, wiping sweat from his brow. \"Look at the scale. We need ten times this many hands.\"\n\nAnother user stabbed his tool into the earth. \"If Reidan's supposed to be an agricultural city, where the hell are the actual farmers?\"\n\n\"Grid's cutting costs, that's where. I heard he's cheap.\"\n\n\"Cheap?\" The first user laughed bitterly. \"Kidnapping users and forcing them to farm? The man's a lunatic.\"\n\nThe twenty-one captured users had formed a habit of gathering to vent their frustrations about Grid. They'd all drawn the same conclusion: Piaro had abducted them on Grid's orders, turning free players into conscripted laborers.\n\nYet none of them had fled.\n\nThe hidden quest rewards were simply too valuable. Despite their grumbling, they didn't truly resent Grid. Most had come to Reidan specifically hoping to join Overgeared. They admired the man, even liked him.\n\nBut the work ground them down. Without an outlet for their complaints, they'd go mad. Grid's name became their pressure valve.\n\n\"Who's that?\" One user straightened, squinting across the field.\n\nIn the distance, Piaro approached with five figures trailing behind him.\n\n\"New recruits?\"\n\n\"Poor bastards.\"\n\nThe twenty-one users averaged level 270—the minimum needed to survive the desert crossing to Reidan. These newcomers would be similarly leveled. The users watching them felt genuine sympathy. Being dragged here like dogs to become farmers? What a waste.\n\nThen the newcomers drew close enough to recognize.\n\n\"Wait—\"\n\n\"That's—\"\n\nConfusion rippled through the group. The master of the Giant Guild. The Five Captains. All of them.\n\n\"No way!\"\n\nThe Giant Guild had taken heavy losses during the golem invasion, but their strength remained undeniable. They were elite. The Five Captains were third advancement users. Chris himself ranked 3rd on the unified rankings—a figure most players could only dream of reaching.\n\nAnd Piaro had captured them?\n\n*That crazy farmer is a monster.*\n\nThe users stared, stunned, as Piaro gestured toward his prisoners.\n\n\"These are your new fellow farmers. I hope you'll all get along.\"\n\n\"Fellow farmers?\" One captain's face flushed red. \"Who the hell do you—\"\n\n\"Shut it,\" Chris muttered.\n\nChris, the 3rd ranked user, leader of the Giant Guild, a viscount of the Eternal Kingdom, was being introduced as farm labor. The captains trembled with humiliation at Piaro's casual tone.\n\nBut Chris kept his composure. The opponent was stronger. Piaro could have killed them. Instead, he'd spared their lives and offered a hidden quest. Making a scene would be foolish.\n\nChris bowed to the other farmers. \"Let's work well together.\"\n\nThe Five Captains followed suit, heads lowered in defeat.\n\n\"We'll... work hard.\"\n\nThat day, Chris and the Five Captains joined the ranks of Piaro's so-called \"fun and exciting training.\"\n\nA rumor began circulating online: *The master of the Giant Guild and the Five Captains have become serfs of Grid.*\n\nIt was too absurd to believe. No one took it seriously.\n\n\"What kind of nonsense is this?\"\n\nGrid was more incredulous than anyone.\n\n***\n\nGrid had acquired twenty-seven pieces of pavranium for assisting with Braham's resurrection. Originally, there had been twenty-eight, but one had been transformed into the Vessel of the Soul and now belonged to Braham.\n\n*Losing one stings, but...*\n\nAll twenty-seven remaining pieces bore the blessings of four gods. As their master, Grid enjoyed a fifteen percent increase to attack power, defense, recovery, and magic power. For a legendary class exclusive item, the pavranium was borderline cheating.\n\n*Braham made it possible to get God Yatan's blessing. One piece is a fair price.*\n\nGrid had changed. Compared to his past self, he'd become almost generous. Just earlier, he'd reduced Chris's repair bill by two gold.\n\n*Two gold is two bowls of ramyun.*\n\nHe imagined Chris's gratitude. The man must feel tremendous affection now. Grid entertained visions of a future alliance with the Giant Guild, then turned his attention to the pavranium.\n\n*I can't make Lifael's Spear.*\n\nLifael's Spear was objectively the strongest weapon in existence. That was undeniable fact. Unfortunately, it was inefficient for Grid specifically. The spear didn't synergize with Pagma's Swordsmanship, and its divine power poisoned him when he used Blackening.\n\n*Grid's Greatsword, Failure, and Iyarugt are enough for weapons.*\n\nWhat about armor, then?\n\nHe wore Pagma's creations: the Holy Light Armor, Gloves, and Crown. As a set, their performance was outstanding. For footwear, he efficiently swapped between Grid's Boots and Braham's Boots depending on the situation.\n\nBut shields... he lacked a proper shield. Then again, wielding a greatsword didn't leave many opportunities to use one.\n\n*What could I make that isn't a weapon or armor?*\n\nPavranium had its own will. It prioritized Grid's safety above all else and moved autonomously. Allowing it freedom was far more efficient than binding it to his body. What item type would best utilize that freedom?\n\n*A symbol of freedom...*\n\n\"Snack.\"\n\nGrid blinked. \"...A snack. What?\"\n\nHe frowned. Who would interrupt his deep contemplation with such nonsense? He tracked the voice to the window sill, where a certain creature had been resting after a long hunt.\n\n\"Give me a snack! Now!\" Noe's tail swished imperiously. His tone demanded obedience.\n\n\"Have you lost your mind? You eat souls. Monster souls, human souls. Why do you need snacks?\"\n\n\"That's food! Snacks are different!\" The Memphis puffed his chest out.\n\n\"What idiot taught you about snacks...?\"\n\n\"Your wife!\"\n\nGrid went silent.\n\nThe word choice aside, Noe clearly meant Irene.\n\n*I heard she's been baking lately.*\n\nAs the daughter of an earl, Irene had never learned to cook or bake. After coming to Reidan, she'd taken up the hobby, wanting to bring Grid small joys through her own hands. The Overgeared members and soldiers had benefited greatly, enjoying her sweet confections. Apparently, Noe had too.\n\nGrid sighed. \"Fine. Take a nap and stop bothering me.\"\n\nHe dismissed Noe and returned to his thoughts.\n\n*An item that can move independently...*\n\n\"Teddy bear.\"\n\nGrid's eye twitched. \"...A teddy bear is—you again.\"\n\nHe glared at the source of the interruption. Randy stood nearby in her little girl form, smiling innocently.\n\n\"Lady Irene gave me a teddy bear!\" She held up the stuffed toy with both hands.\n\nGrid nodded curtly. \"Great. Go play with it.\"\n\n\"Okay!\"\n\nRandy skipped over to the window sill and settled beside Noe with her bear. Her play lasted approximately thirty seconds before Noe began batting at the toy, knocking it from her hands repeatedly.\n\nRandy's face crumpled. She began to cry.\n\n\"I'm losing my mind.\" Grid kicked them both out of the room.\n\nSilence returned. He exhaled slowly.\n\n*The item I should make with pavranium...*\n\n\"Please make farming equipment.\"\n\nGrid's expression twisted into something demonic. \"...Farming equipment.\"\n\nFarming equipment. Someone had just dumped ice water on his train of thought. He turned to find Piaro standing in the doorway, clothes stained with dirt.\n\nGrid could no longer hold back.\n\n\"Piaro. What is your job?\"\n\n\"I am the leader of the Overgeared Knights Division, the commander of Reidan, and a farmer.\" Piaro's voice held no hesitation.\n\n\"Doesn't one of those seem out of place?\"\n\n\"No.\"\n\nGrid stared at him, baffled.\n\n\"Why do you keep clinging to farming? Are you even doing your duties as knight captain and commander?\"\n\n\"Yes.\" Piaro met his gaze with quiet pride.\n\n\"Then I'm glad.\" Grid pinched the bridge of his nose. \"But what about becoming a Sword Saint? If your duties take all your time, shouldn't you quit farming and focus on swordsmanship?\"\n\nHe'd seen the system message that appeared to all Satisfy users: **[A legendary farmer has been born!]** The notification hadn't named Piaro specifically. Grid had been certain it referred to someone else.\n\nBut the evidence kept mounting. And now, his worst suspicion was confirmed.\n\n\"I've realized I am a farmer. Not a Sword Saint.\"\n\nGrid's jaw clenched.\n\nHe was no longer a fool. Piaro had devoted himself to farming. The rumors about farmers repelling the seven guilds' invasion made sense now. The users laboring in the fields. All of it pointed to one conclusion: Piaro was the legendary farmer.\n\nGrid simply refused to accept it.\n\nSword Saint Muller. He'd wanted Piaro to be recognized as the strongest legend through swordsmanship.\n\n\"Is it because your talent isn't enough?\" Grid's voice sharpened, probing for a reaction. \"Did you give up on reaching the pinnacle of the sword and settle for farming instead?\"\n\nPiaro understood Grid's expectations. He knew the disappointment his lord must feel. He would prove his worth. Prove that he was stronger now than he'd ever been as a great swordsman.\n\n\"Farming is the foundation of life. It is more valuable than anything else in this world. I simply chose the more valuable path.\"\n\n\"Women can harvest crops. You're not the only one capable of farming.\"\n\n\"But I am the only one who can master it.\"\n\n\"Master farming?\" Grid's laugh held an edge. \"To what end? A better harvest? That's trivial. With power, you can conquer territory. More land means more people, which means more food. Developing military strength to expand our borders is far more profitable.\"\n\n\"Mastering farming isn't merely about growing crops.\" Piaro's voice remained steady. \"Understanding nature grants me power. I am confident I am necessary to you, my lord.\"\n\n\"Really?\" Grid drew Failure from his inventory. \"Then prove it. Show me what power a farmer can possibly have.\"\n\nThis was exactly what Piaro had been hoping for. The reason he'd requested farming equipment in the first place.\n\n*I must earn my lord's acknowledgment.*\n\nHe would demonstrate the greatness of a farmer. Piaro drew his hand plow and plow. Grid armed himself with Failure and Grid's Greatsword.\n\n\"I'll return you to your true form!\" Grid's voice rang with determination. \"Your hands are meant to hold a sword, not dirt-stained farming tools!\"\n\nPiaro had lost his way. Grid would drag him back to the right path. He equipped the Slaughterer's Eye Patch and activated Blacksmith's Rage, intent on overwhelming Piaro through sheer force.\n\nPiaro's expression grew sad.\n\n*His natural talent is inferior to Kraugel's or Chris's.*\n\nGrid had made remarkable progress after defeating Pagma's Doppelganger, but his lord lacked fundamental skill. That growth had likely stalled since then.\n\n*He may feel frustrated after losing. But I believe he can overcome that, as he always has.*\n\nPiaro would prove his value first, relieving the burden on both of them. He read the trajectory of the blue greatsword swinging toward him, blocked it, then counterattacked while evading the dark blue blade that followed. In his mind, the outcome was already decided.\n\nBut Grid possessed a unique specialty: shattering common sense and destroying predictions.\n\n**CLANG!**\n\nPiaro's eyes widened.\n\nThe moment the blue greatsword collided with his hand plow, shock rippled through his arms."
}