{
  "id": 318,
  "title": "Chapter 318",
  "content": "# Chapter 318\n\nThe blue greatsword collided with the hand plow. Piaro's eyes widened.\n\n*Heavy!*\n\nGrid's swordsmanship was rough, unrefined. Yet his sheer strength and agility compensated, each blow hammering with brutal force.\n\n*How far has he come?*\n\nPiaro had taught Grid before. He knew better than anyone that Grid was dull-witted. Even with legendary skills, rapid growth should have been impossible.\n\nHe was wrong. Grid's progress matched the geniuses Piaro recognized: Regas and Ibellin.\n\n*Now!*\n\nThe Slaughterer's Eye Patch synergized with Grid's high insight. Red light flashed across his vision. He caught Piaro's moment of hesitation and twisted Failure, shaking the hand plow loose. The greatsword swept horizontal.\n\nChaaeng!\n\n\"Uh...!\"\n\nPiaro groaned. The shock rattled through his plow into his bones. Blacksmith's Rage combined with the pavranium buff pushed Grid's attack power beyond even Chris. His agility turned raw power into a storm.\n\nChaaeng! Jjang! Jjejeong!\n\nThree strikes landed before Chris could have swung twice. Piaro's eyes widened further. Grid was supposed to be below Chris' level.\n\nThe surprise faded quickly.\n\nGrid had one weakness. His understanding of swordsmanship was shallow. Chris forced opponents into predictable patterns through trajectory alone. Grid was just fast.\n\nPiaro shifted left, angling his hand plow toward Grid's shoulder. The strike targeted a weak point with surgical precision.\n\nA golden blade intercepted.\n\nPiaro blocked the counter-strike. His pulse quickened.\n\n*Indeed!*\n\nA legendary blacksmith. Grid covered his deficiencies with items. The golden blade stiffened after a single strike, though. Piaro dismissed the pavranium as a significant variable. A natural judgment, not carelessness.\n\nYet.\n\nWho was Grid? A legendary blacksmith. He transcended predictions through his items.\n\nPeeng!\n\n\"Heok?\"\n\nPiaro had been the strongest since becoming a great swordsman. Invincible. Rarely frightened. The stiffened golden blade launched Magic Missile.\n\n\"Ugh!\"\n\nCompletely unexpected. Magic from a blade. Grid leapt through the opening.\n\nChaaeng!\n\nGrid used the rebound to swing his second sword. A linked combo, smooth and practiced.\n\nPuok!\n\n\"...!\"\n\nBlood seeped down Piaro's chest. Minimal damage. His posture remained solid. Grid knew the man's durability and pressed forward without hesitation.\n\nA slash. A descending cut. Landing, then horizontal. He defended the counter with Failure and riposted with Grid's Greatsword. Five successful attacks. The fifth triggered the weapon's option.\n\n> [Critical!]\n> [You have dealt 22,900 damage to the target.]\n\n*Ridiculously durable.*\n\nGrid should have felt triumphant. Instead, surprise chilled him. Piaro's defense exceeded even Elfin Stone's, despite wearing simple farmer's clothes. His health had to be at least 300,000.\n\nAs a legendary farmer, Piaro possessed significantly higher stats than during his great swordsman days. Continuous training had pushed his level to 405. Thirty-eight levels higher than when Grid last observed him with the Great Lord's Sword.\n\nGrid was only level 301. The system's level-based damage reduction crippled his attacks by default.\n\nPiaro's voice carried warmth.\n\n\"I am proud of you.\"\n\nHe must have been training since struggling against Pagma's doppelganger.\n\n\"I must salute My Lord, who has done your best despite your lack of talent.\"\n\n> [Piaro's loyalty has soared to the peak.]\n> [The absolute trust in his lord has increased Piaro's willingness and opened up his potential. Piaro's stats will permanently increase by 10%.]\n\n\"Heok.\"\n\nGrid would normally celebrate such notifications.\n\nNot now.\n\n\"W-Wait a minute!\"\n\nPiaro should grow stronger *after* the battle. Grid opened his mouth.\n\n\"Free Farming 1st Style, Sowing.\"\n\nPa pa pa pat!\n\nPiaro scattered dozens of seeds.\n\nThe pavranium reacted instantly. Four of the twenty-seven pieces had been converted to blades infused with the Water Clan King's Tears. The remaining twenty-three remained in basic form, showing weak defense. They couldn't block all the seeds. Several stiffened under the barrage.\n\n> [You have suffered 9,320 damage.]\n\n\"This damn thing!\"\n\nA rice seed punched through the paralyzed pavranium and slammed into Grid. He screamed. In Patrian, a low-level user had died from a bone projectile. Now Grid stood in that same position.\n\n\"Free Farming 2nd Style, Rapid Growth.\"\n\nKwaduk! Kudududuk!\n\nThe seeds that struck pavranium or Grid began sprouting. Rice stalks shot upward at impossible speed.\n\n*What is this?*\n\nGrid's mind reeled as he watched rice grow from bare earth.\n\n\"This is power that only a legendary farmer can exert.\"\n\nPiaro's voice was steady. As a legendary farmer, he wasn't incompetent. He wanted acknowledgment. Grid couldn't give it. No matter how strong a legendary farmer might be, the image of a sword saint burned brighter in his mind.\n\n\"Pagma's Swordsmanship, Link!\"\n\nThe sword dance unfolded.\n\nPit! Pipipipipit!\n\nDozens of attacks shredded the rice plants. Grid and Piaro's eyes met.\n\n\"Pagma's Swordsmanship...!\"\n\n\"Free Farming!\"\n\nKuooooh!\n\nThe air around Grid turned heavy. Intense aura coalesced at Failure's edge, radiating lethal intent. Kill manifested.\n\nPiaro's response eclipsed it.\n\n\"6th Style! Flailing!\"\n\nThe plow vanished. A flail appeared, striking Grid's Greatsword mid-swing.\n\nPepeok! Bam bam bam!\n\n\"Heok?\"\n\nShock rippled through Grid. Kill's energy shattered under the flail's assault, dissipating into nothing.\n\n*This is crazy!*\n\nFlailing. One of his strongest skills, disabled by a farming technique. Worse still, the old flail Piaro wielded was a rare-rated farming tool Grid himself had crafted months ago. His own weapon was legendary.\n\n*Shit!*\n\nHe felt like grain under the flail. Piaro's skill wasn't just strong. It broke the enemy's spirit. Devastatingly effective.\n\n*He might be a farmer, but a legend is a legend. This is pretty amazi... No, no.*\n\nHe couldn't acknowledge Piaro as a farmer. Piaro should be a sword saint. Only that. Grid wrestled his confusion down and commanded the four pavranium blades containing Magic Missile.\n\n*Shoot from all directions!*\n\nThe pavranium obeyed instantly. They surrounded Piaro and fired simultaneously.\n\n*This basic magic isn't a threat to me!*\n\nPiaro had been caught off guard once. Not again.\n\nHe activated Free Farming's hidden technique: Natural State. The earth, air, trees, and all of nature lent him strength. His stats surged dramatically. Magic resistance rose with them.\n\nUseless.\n\nPepepepeng!\n\n\"Cough!\"\n\nMagic Missile (Enhanced) ignored magic resistance entirely. Despite Natural State, Piaro took heavy damage.\n\n*What is the strength of this magic?*\n\nPiaro had fought Earl Ashur, one of the continent's ten great magicians. Earl Ashur's magic paled in comparison to this speed and power.\n\n*The magic of an artifact transcends a great magician...!*\n\nHis lord was truly great. Sincere respect swelled in Piaro's chest.\n\nGrid was cursing.\n\n*Dammit.*\n\nThe Water Clan King's Tears from Euphemina allowed him to add magic to pavranium. A problem existed, though. Deploying Magic Missile through pavranium consumed Grid's mana.\n\nMalacus' Cloak and the Black Quartz Earrings boosted his intelligence to nearly 16,000 mana. The legendary skills drained too much. Using both Pagma's Swordsmanship and Magic Missile (Enhanced) simultaneously strained his resources.\n\nMeanwhile, Piaro grew stronger.\n\n*Natural State...*\n\nIt amplified stats like Braham's Magic Drain. An excellent legendary buff skill.\n\n*On the other hand, my Blacksmith's Rage...*\n\nBlacksmith's Rage was based on sympathizing with blacksmiths. Undeniably powerful, increasing attack damage and attack speed. But the duration was pathetically short. Level 5 lasted only thirty-five seconds. Piaro's Natural State and Braham's Magic Drain were objectively superior.\n\nPepeok! Bam bam bam!\n\n\"Ugh!\"\n\nWould Blacksmith's Rage ever evolve to match a proper legendary skill? The flail interrupted Grid's thoughts. He tried defending. Difficult. The flail was light, blindingly fast, its trajectory chaotic.\n\n*This is a joke...!*\n\nPiaro blurred across the field after activating Natural State. He dodged every Magic Missile the pavranium fired. Grid endured the one-sided beating.\n\n*If only I had two more hands...!*\n\nHe could resist Piaro's flail and reverse the situation with Item Combination.\n\n*Ah?*\n\nEpiphany struck.\n\n*Yes, hands!*\n\nThe hands of a legendary blacksmith. What if he could reproduce those dexterous hands with pavranium? Imagine it. Legendary blacksmith hands moving according to his will.\n\nDuring combat, he could wield multiple items simultaneously, maximizing their power. They could substitute for Item Combination's long activation time.\n\n*I can craft several items at once, increasing work efficiency!*\n\nIrene would be pleased too.\n\nGrid smiled, satisfaction warming him.\n\n\"Time! Wait! Stop! I said stop!\"\n\n\"...?\"\n\nNot admitting defeat. Just stopping. Piaro halted mid-swing. True loyalty.\n\nGrid shouted.\n\n\"Let's fight again tomorrow!\"\n\nToo careless today. Even as a farmer, Piaro was still a legend. Tomorrow, if Grid lost again despite full preparation...\n\n*At that time, I will respect your choice.*\n\nConfidence filled Grid's eyes. He felt assured despite failing to reduce Piaro's health by even one-tenth today. Absolute faith sustained him. Faith in his items.\n\nIn that moment, a legend of the new era began to evolve. He was catching up to the legends of the previous generation, preparing to surpass them.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule: 20 chapters a week.**\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}