{
  "id": 32,
  "title": "Chapter 32",
  "content": "# Chapter 32\n\n\"Hey, you...\"\n\nKhan's hand clamped down on my shoulder before I could disrupt Huroi.\n\n\"Leave it to me.\"\n\nI shot Khan a grateful look as he stepped forward. The old blacksmith nodded to Huroi.\n\n\"Your words are right. It would be good for our future to coexist with a large company.\"\n\n*What is he saying?*\n\nConfused murmurs rippled through the crowd. Khan, who held more resentment toward the Mero Company than anyone, had just sided with Huroi. Every eye locked onto the old blacksmith. He continued.\n\n\"If Winston didn't belong to Earl Steim, we would've chosen to coexist with the Mero Company as you advised.\"\n\nThe statement hung in the air, weighted with meaning. Huroi's brow furrowed.\n\n\"If it didn't belong to Earl Steim?\"\n\n\"Yes. The important thing is that this village belongs to Earl Steim. I don't know where you come from, but there is a local statute called the 'Rights of the People.' Earl Steim imposed this law himself because he treasures his subjects. One provision states: 'The residents of Earl Steim's territory have the right to be informed more quickly than anyone else about their area of residence.'\"\n\nKhan gestured toward the crowd.\n\n\"Have you heard about the pioneering age of the north? The climate is harsh. Monsters roam freely. Countless pioneers struggle every day. What happens when new land is pioneered?\"\n\nHuroi's eyes narrowed. \"By default, it will have a large impact on nearby cities and villages.\"\n\nKhan nodded with satisfaction.\n\n\"Exactly. Then what is responsible for Winston's current development? The roads were improved. Transportation was supplemented. Why? Because a new land was pioneered not far from here. Winston will be the bridge between this new land and the capital. Do you understand? The north is changing every moment. The people of the north might be damaged by these sudden changes.\"\n\nThe old blacksmith's voice hardened.\n\n\"This is the reason for the stipulation. Earl Steim's residents have the right to be informed about their area of residence sooner than anyone else. It allows people to prepare for sudden changes. We can minimize damage or maximize profits.\"\n\nUnderstanding dawned across Huroi's features. \"Winston's residents were supposed to benefit from the development, not the Mero Company. You suffered a loss. This is contrary to Earl Steim's will. You have the duty to fight against the Mero Company's tyranny, as well as the Winston lord who gave them the information instead of the Winston residents. Is my interpretation correct?\"\n\n\"That's right. We must not compromise with the Mero Company. It isn't for our benefit alone. As his people, we don't want to betray Earl Steim's will. We must accuse Winston's lord and the Mero Company, who are going against his wishes.\"\n\nA perfect justification. The crowd erupted. Cheers rang through the smithy. Every face burned with determination to confront the Mero Company.\n\nHuroi raised his voice above the din.\n\n\"The evil deeds of Winston's lord and the Mero Company must be reported to Earl Steim! But you are under the lord's supervision. You can't raise an appeal with Earl Steim directly. Leave it to me! I will do my duty and inform Earl Steim of the happenings in Winston! For Winston! For you! For the honor of Earl Steim, I will accuse Winston's lord!\"\n\nKhan bowed his head. \"Thank you. I will believe in you and wait.\"\n\n*Wait.* Something clicked in my mind. Huroi had just received a quest from Khan. But wasn't this strange? Usually, an NPC gave a user a quest. The user passively received it. However, this didn't feel passive at all. It felt like Huroi had induced Khan to give him the quest.\n\n*No way.*\n\nI hurried after Huroi as he left the smithy. \"Hey!\"\n\nHuroi turned. His expression had transformed into something cold and cynical, utterly inconsistent with his enthusiastic performance inside. For a moment, I thought I'd stopped the wrong person.\n\n\"Weren't you a folding screen in the corner? What do you want with me? I'm busy.\"\n\n*Folding screen in the corner?*\n\nRight. I looked like a complete beginner right now. Unless someone had an exceptionally kind nature, most users avoided beginners. Too many questions. Too much begging.\n\nI cut to the chase before Huroi could dismiss me.\n\n\"Didn't you come to this place because you received a quest from the Mero Company? Your original plan was to convince the Winston residents to work with them. But what is this development?\"\n\nHuroi's eyebrows rose. \"Hoh? You inferred that I have a quest from my actions? You're not a beginner, are you?\" He paused. \"Well, I just aimed for the larger benefit. Share the quest information.\"\n\n> [The player 'Huroi' wants to share the quest information. Would you like to accept?]\n\nI accepted. Huroi's quest information appeared.\n\n> **[For the Residents of Winston]**  \n> Difficulty: A  \n> Winston's residents have been greatly damaged by the selfish lord and the Mero Company.  \n> Originally, you were commissioned by the Mero Company. However, you couldn't turn away from the poor residents, so you betrayed your employer.  \n> Now you must avoid the Mero Company's pursuit and reach 'Frontier,' the capital of Earl Steim's territory. Be sure to arrive at Frontier and tell Earl Steim everything that is happening in Winston!  \n> Quest Clear Conditions: An audience with Earl Steim.  \n> Quest Reward: The title 'Apostle of Justice.' Affinity with the Winston residents will rise to the peak. Reputation in Winston will rise to the peak. Earl Steim's gift.  \n> *Apostle of Justice: The 'Courage' stat will be opened. **All stats +10**. The skill 'Unbreakable Justice' will be generated.  \n> Quest Failure: Level -1. Affinity with the Winston residents will decline. You can't enter Winston until the Winston lord is changed.\n\n\"W-What is this enormous compensation?\"\n\nMaximum reputation and affinity in a village meant cheap goods and access to hidden quests. A gift from a senior nobleman would be at least Epic rated. The new stat and skill from the title were priceless rarities.\n\nThis was definitely a hidden quest. Even better than mine.\n\n*My stomach hurts.*\n\nJealousy burned through me like acid. I felt dizzy. Frustrated. Meanwhile, Huroi smiled at me with smug satisfaction.\n\n\"Isn't it amazing? This is a hidden quest. I'm happy, since this is the first time I've seen one.\"\n\n*How annoying.* But pride kept me from showing it.\n\n\"Hmph? This is amazing? Hidden quests are no big deal! It isn't amazing. I don't feel envious of any of those rewards. I'm not envious!\"\n\nHuroi blinked. \"Ah, is that so?\"\n\n\"Yes. I'm not envious! So stop boasting about it and tell me what you did. If I'm not mistaken, you induced the NPC to give you the quest. Right?\"\n\nHuroi shrugged.\n\n\"You noticed quickly. Well, a lot of people know about it, so the information will spread soon. There's no value in keeping it secret. I received a hidden quest, so I'll tell you.\"\n\nWhat he said next shocked me.\n\n\"The degree of freedom in Satisfy is infinite. I received the quest by taking advantage of that freedom. I don't wait until NPCs give me quests. I try to speak words that will make the NPC give me the quest. Here's a simple example. If I say 'I am quick and diligent when it comes to deliveries' in front of a restaurant owner, it's highly likely that the restaurant owner will give me a delivery related quest.\"\n\n\"A-Amazing. I didn't know that until now. Has anyone else received a quest like this? If so, those who don't know how to play the game have received damages?\"\n\n\"Don't be discouraged. Unless you're an early player who has been playing Satisfy for a year, most users wouldn't have enough understanding of quests to apply this concept. Except for the early users, most people will be passive towards quests like you. You haven't received any large damages. Only a small number of early users have benefited from it. Well, this information has already started to appear on various sites, so soon everyone will know about it.\"\n\nMy face drained of color. Sweat broke out across my forehead.\n\n\"Hey, why are you pale all of a sudden? Why are you sweating?\"\n\nThe words came out as a whisper. \"I am one.\"\n\n\"What?\"\n\n\"I've been playing Satisfy for one year since it opened.\"\n\n\"What? Pff! Puhahaha!\" Huroi grabbed his belly. He laughed until tears fell. Then he raised his thumb, barely managing to stop. \"That is one of the funniest jokes I have ever heard. Isn't this a good gag? Ah, are you perhaps a comedian in real life? Do you want to be friends? Friends?\"\n\n\"Get lost.\"\n\nIt wasn't a joke. I really was an early user who had been playing Satisfy for one year. I'd even taken a leave of absence from school to play Satisfy. But I had no idea about such a tip. Did I ever obtain my own know-how while playing Satisfy for a year?\n\nNo. I relied on the mundane information that anyone could get from websites. My understanding of Satisfy was so low, I couldn't believe I was an early user.\n\n*I'm pathetic. I'm very ashamed of myself.*\n\nTears streamed down my face.\n\n\"Damn! Damnnnn! Daaaaammm~nnnnnn! Logout.\"\n\n\"H-Hey! What, why are you acting like this?\"\n\nHuroi stood baffled as I vanished.\n\n***\n\n\"What is with that person?\"\n\nHuroi stared at the spot where Grid had been standing. The Asian user had a good sense of humor. It would have been nice if they could be friends.\n\nA chuckle escaped his lips. Grid had declared himself an early user while not even knowing how to induce a quest.\n\n*Why did he feel the need to impersonate an early user? He truly has an unusual personality.*\n\nHuroi turned toward the town gates. \"Then, shall I go?\"\n\nThe encounter was just a passing moment. After meeting Grid, Huroi didn't feel anything special. Just a funny story that he dismissed lightly.\n\nBut the two men were already approaching the whirlpool of destiny."
}