{
  "id": 321,
  "title": "Chapter 321",
  "content": "# Chapter 321\n\n**The vacant lot in front of Khan's smithy.**\n\n\"I greet my Lord!\"\n\nPiaro arrived at the promised time. Grid's jaw tightened. The man stood before him in the same tattered clothes from yesterday, soil caked into the fabric, clutching that damned rusty hand plow.\n\nA farmer. A *poor* farmer.\n\nGrid stepped forward. \"You're the captain of the Overgeared Knights Division. Commander of Reidan. And you show up looking like this?\" His voice cut through the morning air. \"Some might interpret that as disloyalty.\"\n\nHe pushed, testing. Hoping Piaro would see reason.\n\nPiaro didn't flinch. \"I dress appropriately when performing my duties as commander. Right now, I'm a farmer.\" He gestured to himself. \"So I look like this.\"\n\n\"This damn obsession.\" Grid's hands curled into fists. \"I'm settling this today.\"\n\n\"There's nothing to settle.\" Piaro's tone remained calm. \"Isn't this the increase in power you wanted? As a farmer, I can exercise strength beyond what was possible before. I'm much stronger now than when I was a great swordsman.\" He met Grid's eyes. \"Please respect the path I've chosen.\"\n\n\"It's weaker than a Sword Saint!\" Grid's shout echoed off the smithy walls. \"Get rid of that farmer nonsense and become a Sword Saint!\"\n\nNo more words. Grid pulled out two weapons.\n\n> [The +9 Failure has been equipped.]\n\n> [The +8 Grid's Greatsword has been equipped.]\n\nThe plain greatsword from yesterday now radiated with the distinctive glow of a +8 enhancement. Grid had burned through every enhancement stone he'd stockpiled. A pity it hadn't reached +9.\n\n\"Today I'm different from yesterday!\" \n\nConfidence blazed in Grid's eyes. \n\nPiaro studied him, bewildered. *Why does he believe this?* \n\nYesterday's gap between them had been a chasm. Grid's skills couldn't have improved overnight. So where did this confidence come from?\n\n*He's the master of twenty thousand people. A legend.*\n\nWhich made arrogance even more dangerous. Arrogance created enemies. Invited danger. Piaro held different values from Braham. Out of loyalty, he decided Grid needed to be broken down and rebuilt properly.\n\n\"I'll show you my power today.\"\n\nThe moment Piaro armed himself with the hand plow and hoe, Grid exploded forward. He'd been waiting for it. Failure swept out, its reach extended by the massive blade.\n\n*Chaaeng!*\n\nPiaro's hand plow intercepted. He used the collision's force to slide back.\n\n*Kuooooh!*\n\nThe air around Grid began to boil. His black hair lifted. Stones rattled against the ground, then rose. Pagma's Swordsmanship, Transcend.\n\n> [Entering the transcendent mode.]\n\n> [Attack power is doubled. Your basic attacks will be converted to ranged attacks.]\n\n> [This effect will last for 30 seconds.]\n\n\"If you don't want to die, avoid this.\"\n\n*Kwa kwang! Kwa kwa kwa kwang!*\n\nGrid unleashed both greatswords in a relentless barrage. No breaks. No hesitation. Each swing generated powerful energy blades that tore through the air.\n\n*Hah.*\n\nPiaro's eyes widened slightly. Grid's momentum had shifted. Transcend carried devastating force.\n\n*He's different from yesterday.*\n\nYesterday, Grid had relied on pure swordsmanship and suffered for it. Today, he'd deployed Pagma's Swordsmanship from the opening move. A wise decision. Those legendary skills were Grid's only means of closing the gap between them.\n\n*But...*\n\nThe difference in their fundamentals remained too vast. Wisdom alone couldn't bridge that chasm.\n\n*Pepeng! Pepepepeng!*\n\nPiaro met the bombardment with his farming tools. Each collision between equipment and energy blade triggered an explosion. The energy blades dissipated. Not a scratch appeared on Piaro.\n\nYet to outside observers, Piaro seemed on the verge of defeat. He stood at the center of a maelstrom of explosions, wreathed in smoke and fire.\n\n\"This is impossible...\"\n\nChris stared from his vantage point in the distance. The Five Captains flanked him, equally stunned.\n\n\"That's complete devastation.\"\n\nGrid's use of Transcend was spectacular. Visually overwhelming. He seemed to be crushing Piaro beneath raw power.\n\n*Grid can easily fight someone we couldn't?*\n\n*Grid is strong!*\n\nThey'd thought reaching third advancement had elevated them beyond him. A mistake. Compared to a legendary class, they were still lacking. As they grew, Grid grew. Their pride crumbled like sand.\n\n\"Sowing.\"\n\nPiaro's voice cut through the explosions. Chris and the Five Captains leaned forward, confirming he was unharmed.\n\n*Of course! Piaro would never be defeated by Grid!*\n\n*Grid looked amazing, but there's no substance!*\n\nRelief flooded through them. They weren't inferior to Grid after all. As the Five Captains relaxed, seeds erupted from Piaro's position like bullets.\n\nPinky, the sole woman among the Five Captains, nodded to herself. \"This is the end for Grid.\"\n\nPiaro's seeds couldn't be blocked or avoided. Too fast. Too powerful. They struck unconditionally. A few days ago, those rice seeds had put her in critical condition. How could Grid possibly handle the technique?\n\nShe was certain.\n\nAnd arrogant.\n\nPinky based her conclusion on the assumption she was superior to Grid. Reality told a different story.\n\n\"Freely Move.\"\n\nA skill attached to the <span class=\"rarity-legendary\">Secret Hero</span> title. Limited range. One hour cooldown. But a supreme dashing technique that allowed him to evade all non-targeted attacks until he reached his destination.\n\nPiaro's Sowing was quick. Exquisite. But the seeds couldn't touch Grid without target-locking.\n\n\"...!\"\n\nPiaro's eyes widened. Grid displayed shocking swiftness as he weaved through the bullet-storm of rice seeds.\n\n\"Aren't I different from yesterday?\"\n\n*Puok!*\n\nGrid whispered to the startled Piaro and struck. Freely Move had carried him through the barrage. Now he was in range. Pagma's Swordsmanship, Pinnacle.\n\n\"This is impossible!\"\n\nShock rippled through the Five Captains. Piaro's shoulder split open. Blood welled from the wound. They couldn't process it.\n\n\"The opponent Chris couldn't even harm...\"\n\n\"He took a fatal wound!\"\n\nChris shook his head, snapping the stunned captains back to reality. \"No. Piaro is fine. This is Grid's limit.\"\n\nTruth.\n\nDespite the shoulder wound, Piaro's stance remained solid. Grid had landed a clean blow, but the level gap prevented a critical hit.\n\n*Chaaeng!*\n\nPiaro ignored the greatsword embedded in his shoulder. His hoe thrust forward.\n\n*I'll be hit!*\n\nGrid read the trajectory through the Slaughterer's Eye Patch and his Insight stat. He moved to defend. Grid's Greatsword shifted to intercept the hoe.\n\nThe attack contained a feint. It appeared to rush straight forward but curved to the side instead. Grid's defense met empty air.\n\n> [You have suffered 11,900 damage.]\n\n*This is insane!*\n\nGrid's face went white as the hoe connected with his ribs. He wore the most powerful armor set in existence. Yet a <span class=\"rarity-rare\">Rare rated</span> farming tool dealt that much damage? The hand plow whistled toward his forehead.\n\n\"This is the end!\"\n\nAsellas was certain this time. Days ago, Piaro's hand plow to the forehead had demolished him. \n\nAnother mistake. Grid possessed something Asellas lacked.\n\nThe power of items.\n\n*Jeeeong!*\n\n\"Ah!\"\n\nPiaro cried out in alarm. A shield materialized in front of Grid, intercepting the hand plow. The hand gripping that shield didn't belong to Grid.\n\n*A hand moving independently!*\n\nAnd it wielded equipment! Piaro's mind raced through the tactical implications. Grid laughed at his shaken opponent.\n\n\"Let me show you the power of items.\"\n\nGrid hurled Failure and Grid's Greatsword into the air.\n\n*What?*\n\nAbandoning weapons mid-combat? Chris and the Five Captains squinted, struggling to understand what was happening.\n\n\"E-Eh?\"\n\n\"What is this...?\"\n\nTwo more golden hands manifested. They snatched the greatswords from the air.\n\n\"Pay attention!\" Chris barked. This might be their only chance to glimpse Grid's true capabilities. They couldn't miss a single detail.\n\n\"Who are you?\"\n\n\"...!\"\n\nChris and the Five Captains flinched. A handsome man with blonde hair cascading to his waist had appeared. White armor. Blue cloak. An NPC.\n\n\"Who are you?\"\n\nChris's response came out harsh. An NPC had interrupted a critical moment.\n\nThe man's expression remained neutral. \"A captain of the Overgeared Knights Division.\"\n\n\"Overgeared Knights Division?\"\n\n\"Pfff!\"\n\nThe name struck them as ridiculous. Chris and the Five Captains laughed reflexively.\n\nThe blonde man's eyes hardened. \"Now you're sneering at my Lord's knights.\"\n\n*Suuk.*\n\nHe drew a one-handed sword. It resembled a compact version of Dainsleif.\n\n\"Who dares draw a sword in front of us?\"\n\n\"Everyone's looking down on us! Don't mock us just because we're covered in dirt!\"\n\nThe Five Captains armed themselves furiously.\n\nThey paid a harsh price.\n\n\"Red Sword.\"\n\n\"Keok.\"\n\n\"Ugh.\"\n\nAn instant. A crimson storm of light erupted. All the Five Captains save Zirkan bled from fresh wounds.\n\n\"There's more than one monster...!\"\n\nZirkan had barely defended against the attack. Pure luck. His eyes shook as the gap between himself and this stranger crystallized from a single exchange. The man noticed his survival and sighed.\n\n\"Many of my skills are sealed.\"\n\nHe'd once been the sole rival of a great swordsman. Shameful that he couldn't eliminate this weakling in one blow. He prepared to attack again.\n\n\"Look!\" Chris shouted.\n\n\"...\"\n\nChris was clever. His experience with Piaro had taught him exactly how to act humble when survival demanded it.\n\n\"We have orders from Piaro to work the rice fields! We're going now!\"\n\nWhat mattered more than pride? Their lives. Chris and the Five Captains fled.\n\nThe blonde man didn't pursue. His focus belonged elsewhere. The confrontation between his lord and his friend.\n\n*What is this?*\n\nAsmophel knew Piaro's strength better than anyone. Which made the scene before his eyes impossible. Four golden hands gripped three greatswords and one dagger.\n\n\"Blackening.\"\n\nDark magic swirled around his lord.\n\nAnd Piaro began to be pushed back.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}