{
  "id": 322,
  "title": "Chapter 322",
  "content": "# Chapter 322\n\nPiaro blocked Grid's attack.\n\n*Impossible.*\n\nTranscend had failed. Grid stared at the farmer standing motionless in the dirt, that damned hand plow still raised in defense. More than fifty energy blades had carved through the air in thirty seconds. All deflected.\n\n*His agility is higher than yesterday.*\n\n\"Truly amazing.\" Grid's pulse quickened. Having such a subordinate was a blessing. But the farmer class wasted Piaro's potential. *If he was a sword saint instead...*\n\n*I'll make you one today.*\n\nGrid surged forward, weaving between the scattered seeds littering the ground. He activated Pagma's Swordsmanship, Pinnacle. The skill could only be used once per hour.\n\n> [You have dealt 10,500 damage to the target.]\n\nGrid's jaw clenched. *Damn level system.* The hundred-level gap throttled his damage output. Piaro's defensive stats were too high. But despair didn't take root. *Items. I have the power of items.*\n\nThe hand plow swept toward his ribs. Grid raised his left arm.\n\n\"Number One!\"\n\nA golden hand materialized, gripping the <span class=\"rarity-legendary\">Perfect Divine Shield</span>. Metal shrieked against metal.\n\n**Claaaang!**\n\nPiaro's eyes widened.\n\nGrid grinned. \"Let me show you the power of items.\"\n\n> **[God Hand]**  \n> Rating: Unique (Growth)  \n> Durability: Infinite  \n> Dexterity: 814 | Strength: 813  \n>\n> *A hand made by the legendary blacksmith Grid, using the material pavranium that was made by the former legends Pagma and Braham. Since it reproduces Grid's hands, all items can be worn without restrictions.*\n>\n> *An item born from the intervention of three legends, it has the ability to transcend a divine item. However, steady learning is essential in order to open up its potential.*\n>\n> * The unique rated 'God Hand' only receives 30% of its master's strength and dexterity.\n> * The unique rated 'God Hand' isn't yet able to reproduce its master's skills. However, the skills possessed by items can be fully used. Buff skills will influence the master.\n> * 'God Hand' can learn blacksmithing, swordsmanship and shield techniques. Currently, the Blacksmith skill of God Hand is advanced level 1, while Sword Mastery and Shield Mastery are beginner level 2. Once the mastery reaches a certain level, the rating of God Hand will increase.\n> * Magic Missile (Enhanced) is attached. Due to the effect of the Water Clan King's Tears, this spell is reproduced with 100% of its power.\n> * Depending on the usage, it is easy to obtain the favor of the opposite sex.\n>\n> Conditions of Use: Grid.  \n> Weight: 21\n\nThe item was bound to Grid himself, not the Pagma's Descendant class. Its performance already met expectations, and the growth potential promised even more. *Might reach myth rating someday.* One regret nagged at him, though. *I could only make four.*\n\nFive would have been possible if he'd skipped the internal mechanisms. But pavranium consumption during full construction had been brutal.\n\nGrid dismissed the complaint. *Four more hands than anyone else.*\n\nHe tossed <span class=\"rarity-legendary\">Failure</span> and Grid's Greatsword into the air.\n\nPiaro stiffened. *Why would he discard his weapons?* The farmer's gaze jerked upward. Two more golden hands appeared, catching the falling blades. Blood drained from Piaro's face.\n\nGrid switched the Divine Shield for his <span class=\"rarity-unique\">Ideal Dagger</span>. \"Is it wise to look away?\"\n\nHe slashed downward. \"Cut!\"\n\n**Fwip! Fwipfwipfwip!**\n\nThe pavranium hands blurred through the air, fast as Memphis' wings. A normal person wouldn't even register the movement. Three God Hands converged on Piaro, greatswords and dagger whirling.\n\nAutonomous weapon-wielding hands. Fast. Overwhelming. And utterly clumsy with a blade. Piaro parried every strike with his hand plow alone, already angling the hoe toward Grid's throat.\n\n**Claaaang!**\n\nA chill crawled down Piaro's spine. *Another one!* The fourth golden hand struck from behind, wielding the jade-colored <span class=\"rarity-legendary\">Doppelganger's Greatsword</span>. Piaro twisted, blocking the ambush on pure instinct.\n\n*The God Hands can't defeat him.* Grid had seen enough. Piaro defended against simultaneous attacks from all four directions without breaking rhythm.\n\n*But they don't need to win.*\n\nThe God Hands forced Piaro's attention. Their swordsmanship was amateurish, but the weapons they wielded were all high-rated. Piaro couldn't ignore them. And in that divided focus, gaps appeared.\n\nGrid's skin paled to chalk-white. Black miasma erupted from his body.\n\n> [Your black magic power has increased.]  \n> [You don't have any black magic power. It will be replaced with demonic power.]  \n> [While Blackening is activated, your species will change to half-demon.]  \n> [As a half demon, your maximum health is reduced by 50%. Your attack power, magic power and agility will increase by 20% each.]  \n> [All attacks will be converted to the black magic attribute.]\n\nPiaro's expression flickered. *Demonic energy!* For a heartbeat, doubt surfaced. *My lord isn't human?* Then his eyes tracked to the earrings Grid wore, and understanding followed. Relief warred with distaste on the farmer's weathered face.\n\n\"This doesn't look good!\" Piaro said. Grid's eyes had turned completely black, the whites vanished. The transformation was grotesque.\n\nGrid rolled his shoulders. \"Don't read too much into it. Just another item effect.\"\n\nBlackening sharpened his aggression. *How far can I push him?* Pleasure coiled in Grid's chest. He gave the command.\n\nFour hands moved as one. The Ideal Dagger launched Wind Blast. <span class=\"rarity-legendary\">Failure</span> and the Doppelganger's Greatsword struck from opposite flanks. Grid's Greatsword plummeted from above.\n\n\"Where do you think you're going?\"\n\nPiaro deflected the assault without stepping back. The attacks were manageable. Predictable. But he couldn't afford to ignore any of them.\n\nGrid drew his sixth blade. \"Iyarugt.\"\n\nThe demonic sword materialized in his hand. Its red aura streaked through the air, painting crimson lines in his vision.\n\n**Clang!**\n\n*Impossible!* Piaro's feet slid backward. Grid's damage output had tripled. His speed nearly matched Piaro's own. And his swordsmanship had transformed from crude to competent.\n\n> [Due to the option effect of Iyarugt, Sword Mastery has increased by 5 levels.]  \n> [You don't have the Sword Mastery skill. Beginner Sword Mastery level 5 is created while wearing Iyarugt.]\n\nBeginner level 5 shouldn't matter. Three percent increased attack power and speed when wielding a sword. A negligible bonus. Except Grid's base stats were monstrous. Enhanced further by Blackening, that three percent became a landslide.\n\nAnd that wasn't Iyarugt's true strength.\n\n> [The strongest enemy I have met in centuries! Go and fight! Fight without stopping! Let me grow!]\n\nThe sword demon's soul howled in exultation. Red lines flooded Grid's vision, dozens of potential sword trajectories manifesting and dissolving in rapid succession. Grid followed the brightest path, his blade carving through optimal angles. Piaro was forced to retreat.\n\n*My lord!* Piaro's heart swelled. Since earning his title as a great swordsman, when had anyone pushed him onto the defensive? Never. Not once. Joy surged through him. Even greater joy that his opponent was Grid.\n\n\"Free Farming 4th Style!\" The hand plow was nearly destroyed. Piaro drew a proper plow from his back. \"Plow the Field!\"\n\n**KRAKOOOM!**\n\nThe earth bucked like a dying animal. Soil erupted in massive pillars, jagged and violent.\n\n\"Kuk!\" Grid threw himself backward, barely avoiding the stone spears. But the danger wasn't finished. Piaro scattered seeds across the freshly tilled soil. Thorny vines exploded from the ground, writhing toward Grid's legs. *Plowing into Sowing into Rapid Growth.* A perfect combo.\n\n\"God Hands!\"\n\nFour golden limbs blurred into motion, slashing through the encroaching thorns. But the vines regenerated faster than the hands could cut. Grid was running out of space.\n\n*No choice.* He activated Link, burning one of his most valuable skills just to survive. The thorns retreated. Piaro closed the distance in a single leap, sickle gleaming.\n\n\"Free Farming 5th Style, Harvest!\"\n\n**Shllk! Shllllk!**\n\nThe thorns separated from their roots. They surged toward Grid like a tsunami.\n\n> [You have suffered 9,100 damage.]  \n> [You have suffered 8,700 damage.]  \n> [You have suffered 8,930 damage.]\n\n\"Gah!\" Pain lanced through his torso. Getting killed by a farmer's sickle would be humiliating.\n\n> [Now!]\n\nIyarugt painted a new trajectory. A perfect opening as Piaro landed. But Grid was too slow to capitalize. The distance too great. He fired four Magic Missiles instead. The thorns intercepted every shot.\n\n> [What are you doing, incompetent bastard!]\n\nThe sword demon's frustration blazed through their connection.\n\n*Wait.* Grid remembered. *The Ideal Dagger.*\n\n\"Number Two!\"\n\nThe God Hand wielding the dagger activated its skill.\n\n> [Your evasion rate is increased by 30% and your agility doubled for 1 minute.]\n\n*This is why I keep it.* Double agility. The Ideal Dagger's attack power was mediocre at best, but the attached skill was priceless.\n\n\"Ohhhhhhh!\"\n\nGrid exploded forward along Iyarugt's red path. The speed defied physics. Piaro's eyes widened.\n\n**Thunk!**\n\nA crimson flash carved into Piaro's shoulder. Grid had aimed for the heart. The flail had knocked the strike off-course. Grid didn't flinch. *I'm faster than him now.*\n\n**Shlk!**\n\n> [You have dealt 3,900 damage to the target.]  \n> [You have dealt 3,790 damage to the target.]  \n> [You have succeeded in the 3rd combo!]  \n> [The amount of damage the target will receive will increase by 200% for 1 second!]\n\n*Now!*\n\nPower screamed through Iyarugt's edge. Grid roared the skill name. \"Kill!\"\n\n> [Critical!]  \n> [You have dealt 125,600 damage to the target.]\n\nPiaro's health bar plummeted to half.\n\n> [Piaro has realized what he is lacking. The level of his farming techniques have risen from this enlightenment!]  \n> [A hidden quest has been created.]\n\nA quest window materialized between them.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule: 20 chapters a week.**  \n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}