{
  "id": 324,
  "title": "Chapter 324",
  "content": "# Chapter 324\n\n\"Pagma's Swordsmanship, Transcended Link!\"\n\n**BOOM BOOM BOOM!**\n\nDozens of blue-black energy blades tore through the vampire ranks. The creatures hissed and cursed as the attacks ripped into them.\n\n\"Damn human!\"\n\n\"How ludicrous!\"\n\n\"Hiik!\"\n\nFifty vampires surged forward in a unified mass. Grid turned and ran.\n\n\"Hehehehe!\"\n\nOne vampire cackled at the sight. \"He's intimidated!\"\n\nThe vampires savored the hunt. They herded Grid like prey, driving him into a circle of fangs and claws.\n\nGrid's legs gave out. He collapsed to the ground, trembling as the vampires loomed over him. His shoulders shook. Tears welled in his eyes. The performance would've stirred protective instincts in any human observer.\n\nThe vampires had none.\n\n\"Eat!\"\n\nFifty mouths opened wide.\n\nA black blur dropped from above.\n\n\"Mrow!\"\n\nThe creature landed directly on a vampire's skull. Claws raked across the monster's forehead.\n\n\"KUAAAAAK!\"\n\nThe vampire reeled backward, clutching his face.\n\n\"What is it? What—?\"\n\nAnother vampire stared at the attacker. His eyes widened. \"Memphis...!\"\n\nNoe puffed out his chest and belly. \"That's right! The best demonic beast of hell!\"\n\n\"Why is a great demon's pet here?\" one vampire hissed.\n\n\"I'm not just a pet!\" Noe's wings flared.\n\n\"Get rid of it!\"\n\nThe vampires were demonkin themselves, but they'd been expelled from hell long ago. Any creature from that realm was an enemy. They abandoned Grid and lunged for the cat.\n\nFour white flashes punched through their chests.\n\n**Magic Missile.**\n\n\"Cough!\"\n\n\"Keook! How can Magic Missile deal so much damage?\"\n\nThe vampires whipped around. Four golden hands hovered in the air—each gripping a weapon. Greatswords. A dagger. The hands moved independently, radiating faint magical energy.\n\n\"What is that?\"\n\nOne vampire squinted at the bizarre constructs. Hands that moved on their own? Hands that cast magic? The golden constructs blurred forward before anyone could answer.\n\n**Clang! Clang!**\n\nThe swordsmanship was crude, but the speed compensated. And the weapons themselves hit like siege engines. Even a glancing blow left deep wounds.\n\n\"Kyaak!\"\n\nThe vampires scattered. Between the demonic beast and the floating hands, confusion turned to panic.\n\n\"Pagma's Swordsmanship, Wave.\"\n\n**BOOM!**\n\nEnergy rippled outward in concentric circles. A figure materialized in the center of the chaos, wielding a demonic sword wreathed in black-red light. The vampires didn't even have time to scream before dissolving into grey particles.\n\n\"I'm still scared,\" the figure said.\n\nGrid looked over at his doppelganger—Randy, still maintaining his copied form. She released the illusion a moment later, reverting to the appearance of a young girl. Tears streaked her face.\n\n\"I won't cry next time!\"\n\nGrid nodded. \"You did well.\"\n\n\"Praise me more!\"\n\nNoe puffed up again, demanding attention.\n\nWhile the three talked, the God Hands continued their assault on the remaining vampires.\n\n> [The Sword Mastery of 'God Hand' has increased to Beginner Level 6.]\n\nGrid grinned as the notification appeared. The God Hands' mastery climbed steadily with use. Their coordination had improved dramatically since the fight with Piaro. *Good. Very good.*\n\nNearby, the Overgeared members watched in silence.\n\n*This is a scam.*\n\n*It's outrageous.*\n\nThey'd reunited with Grid a week after the Elfin Stone raid. In just a few days, he'd become something incomparable. It wasn't a matter of skill or control anymore.\n\nFour golden hands. Noe. Randy. All of them moved in perfect synchronization around Grid, forming a mobile death zone. His hunting rate exceeded anything they could achieve. In the time it took Pon and Regas to kill two or three vampires, Grid slaughtered ten. That was average. At his peak, he wiped out a hundred at once.\n\nBeing overgeared was one thing. Having this many pets was something else entirely. His speed surpassed even the top-ranked necromancers. In forty-two days, Grid had gained four levels. The speed itself was impressive, but the buffs from the Elfin Stone raid and the experience potions from the Reputation Store had amplified his gains exponentially.\n\nRight. After his defeat at Piaro's hands, Grid had indulged in gambling again—fueled by desperation to grow stronger. He'd burned through all his reputation. The result? Three experience potions.\n\nGrid forced himself to think positively. *The high-value items have limited purchases anyway. If I only buy them when absolutely necessary, investing reputation into experience potions isn't a bad trade.* The draw system was still risky. If his luck turned sour, he could walk away with nothing.\n\n***\n\nGrid reached Level 305 and left the vampire cities. He'd decided to stay in Reidan for a while. Irene's due date was less than a month away, and he wanted to remain by her side.\n\nHe planned to use the time to fulfill his duties as lord and blacksmith.\n\n> **[Minerals Strengthening]**\n> \n> *Increase the hardness and strength of specified minerals, while lowering brittleness.*\n\nHardness measured the surface resistance. Strength measured force tolerance. Brittleness measured fragility under impact. Generally, hardness and strength correlated directly, but increased brittleness was a common side effect. Minerals Strengthening—acquired after completing the third class quest—could produce an ideal mineral by balancing all three properties.\n\n*It's not immediately useful, though.*\n\nThe skill had a steep time cost. Placing thirty grams of mineral in the strengthening frame required thirty days. A one-handed sword needed roughly four kilograms of material. At first, Grid had been disappointed.\n\nBut the more he thought about it, the more he wondered if Minerals Strengthening was a stepping stone to something greater. *Just like Pagma and Braham created pavranium, maybe one day I'll create my own mineral.*\n\nHe decided to stay optimistic. He placed a small amount of blue orichalcum into the frame. He'd considered using pavranium, but that would mean disassembling one of his God Hands—something he couldn't afford while trying to raise their ratings.\n\n> [30 days remaining.]\n\n\"No time acceleration function,\" Grid muttered.\n\nHe retrieved the thirty grams of enhanced blue orichalcum he'd placed in the frame before leaving for the vampire cities. It was noticeably harder than standard blue orichalcum.\n\n\"Guess I need to use this steadily.\"\n\nGrid stood in a corner of the smithy, examining the results, when a new notification appeared.\n\n> [Congratulations! The alchemy facilities in Reidan have reached Intermediate Level 4!]\n\nAdministrator Rabbit burst through the door. \"Duke Grid! The alchemy facilities finally reached Intermediate Level 4! If we maintain this pace, they'll reach Advanced level in one year and one month!\"\n\nOnce the facilities hit Advanced level, they'd be able to process yellow mithril fully. Random special options could be added to items. Production values would skyrocket.\n\nGrid's expression soured. \"One year and one month? I invested thirty million gold, and we still need to wait over a year?\"\n\n\"As you know, alchemy is neglected in all kingdoms,\" Rabbit said carefully. \"The field isn't systematically developed, and experts are rare. Development takes time. Your investment has accelerated progress beyond expectations. Please be patient.\"\n\nAdministrator Rabbit was competent. He'd turned Reidan from a ghost city into a profitable estate. Grid trusted him completely. Grid nodded, then checked the estate's status window. His brow furrowed.\n\n\"Wait. Why is agriculture our most profitable sector? The returns are ridiculously high compared to the investment. Is this all Piaro's doing?\"\n\nRabbit hesitated. \"...That's correct. Sir Piaro's ability as a farmer is... historic. Allowing him to remain a farmer was truly a wise decision.\"\n\nLauel, who'd been standing beside Grid, nodded in agreement. \"I agree completely. The man who once wanted Piaro to become a sword saint now appreciates him as a farmer. I never thought I'd see the day. It was a wise and charitable choice.\"\n\n*Charitable? Wise?*\n\nGrid said nothing. There'd been no deep meaning behind his decision to let Piaro stay a farmer. He'd simply lost the fight. But he couldn't bring himself to admit that to his subordinates.\n\n***\n\nShin Youngwoo's current account balance: **₩5,013,009,281**.\n\nEvery morning started the same way. Open the internet banking app. Stare at the number. Five billion won. No matter how many times he checked, it still felt like a dream. His eyes watered.\n\n\"One year ago, I was drowning in debt...!\" His voice cracked. \"Sob!\"\n\nWhy did this happen every morning?\n\nHe blew his nose. Pulled a tissue. Tossed it in the trash. Then he clasped his hands together.\n\n\"God, Buddha, spirits of heaven and earth. Please keep watching over me...\"\n\nHe prayed despite never donating to a church or temple. Then he wandered into the kitchen and brewed an espresso with the machine he'd bought last month. He took a sip, then handed it to Sehee as she emerged from her room.\n\n\"Here. Drink. Morning coffee.\"\n\nSehee eyed the cup. \"...Can I not drink it?\"\n\n\"What? Didn't you want to try it?\"\n\nYoungwoo had put genuine effort into the brew. Sehee sat down in front of the TV. \"Are you coming to my school festival?\"\n\nThe autumn festival at Young Ladies High School was three days away. The school was famous for its scale and its beautiful students. Plenty of ordinary people attended. Youngwoo recalled the text message Yerim had sent a few days ago. He shook his head.\n\n\"Yerim invited me, but I'm not going.\"\n\nBraham's actions had probably earned him millions of anti-fans. He was still too afraid to search his own name online. Going outside required a mask and constant vigilance.\n\n*Someone might try to kidnap me.*\n\nMost people enjoyed their wealth openly. Youngwoo was different. He cherished his safety even more now that he had money.\n\nSehee's face lit up. \"Good.\"\n\nShe hummed as she walked toward the bathroom. Grid sighed.\n\n\"She's ashamed of her brother...\"\n\nHe couldn't blame her. He'd spent decades acting pathetic before finally pulling his weight. Youngwoo stood and headed for the capsule. He'd soothe his heart by spending time with Irene and focusing on work.\n\nIn the empty living room, the TV continued broadcasting news about the festival.\n\n> *[It's been announced that actor Kim Doohyun will participate in the autumn festival at Young Ladies High School...]*\n\n***\n\n> **Glossary of Common Korean Terms:**\n> OG: Glossary Link\n> \n> **Current schedule:** 20 chapters a week.\n> \n> Check out my Patreon for early access to a certain number of unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing the day's chapters."
}