{
  "id": 325,
  "title": "Chapter 325",
  "content": "# Chapter 325\n\nKim Doohyun was thirty-one years old.\n\nThe South Korean actor possessed what casting directors called a \"warm presence.\" Three months ago, his role in the Hollywood film *The Diary of a Murderer* had catapulted him to international stardom. Since then, he'd filmed fifteen commercials. His popularity continued to climb.\n\nIn an advertising market dominated by Satisfy's top rankers, Doohyun's success gave hope to traditional actors everywhere.\n\nHis agency representative gripped the phone. \"You want to cancel a shoot to attend a *festival*? Doohyun, why are you being so stupid? Are you trying to cause a scandal?\"\n\nThe man tried to persuade him. It was useless.\n\nDoohyun stared out the window, his expression unreadable. When he spoke, his voice carried a strange finality. \"There are things more important than immediate profit and popularity. I'm attending the Young Ladies High School festival.\"\n\nThe representative's face darkened.\n\n\"Don't tell me the rumors are true.\"\n\n\"What rumors?\"\n\n\"That you're...\" The representative hesitated. \"There's talk you prey on high school girls.\"\n\nDoohyun said nothing. His reticent personality made him unwilling to dignify the question with a response.\n\nThe representative sighed. If a scandal broke involving a minor, Doohyun's career would be finished.\n\n***\n\nChris crossed his arms. \"I've come to have the sword repaired.\"\n\nThe master of the Giant Guild now visited Reidan frequently. The trips were tedious and time-consuming, but unavoidable. Grid was the only person capable of repairing <span class=\"rarity-legendary\">Grid's Greatsword</span>.\n\nGrid examined the weapon. \"It's not too damaged. You can hunt desert monsters on the way here. Experience and items, right?\"\n\n\"I won't deny it.\"\n\nChris hunted in the basilisk territory during his travels to and from Reidan. Desert basilisks typically moved in packs of three. Most rankers couldn't handle them solo. But Chris was third on the unified rankings.\n\nHis abilities and accumulated knowledge allowed him to hunt basilisks alone for tremendous profit. More importantly, Piaro was in Reidan. Every sparring session with the legendary farmer sharpened Chris's skills. Part of him wanted to relocate permanently.\n\nGrid set the greatsword on his workbench. \"Today I'll give you a discount of four gold. It's 599 gold.\"\n\nChris stared at him. The man spoke as if he hadn't been price-gouging from the start. It was infuriating. But it *was* slightly cheaper. Less than 600 gold.\n\n*No, it's still expensive. I shouldn't let myself be swayed.*\n\nChris forced himself to stay calm. His hands trembled as he counted out the repair fee. He turned to leave, then paused.\n\n\"The Blood Carnival's celebrity hunting has escalated recently. You should be careful.\"\n\nGrid looked up. \"Blood Carnival?\"\n\nThe Overgeared members frequently warned him about someone named Agnus. Grid assumed the Blood Carnival was connected.\n\n\"Is that Agnus's group?\"\n\nChris sighed. \"Your information network is pathetically weak, despite having Faker as a subordinate. Or do you just not care about current events? Agnus has no affiliation with the Blood Carnival. They're a collective of unofficial rankers.\"\n\n\"Are they strong?\"\n\n\"Not only strong, but bloodthirsty. If you become their target, you won't be safe. They're as dangerous as Agnus. So be careful. It would be inconvenient if you died while repairing my weapon.\"\n\nGrid nodded slowly. \"I'll keep it in mind.\"\n\nChris's tone wasn't kind. But he *was* doing Grid a favor. Grid smiled and walked him outside.\n\n\"Travel safely. And relax in the future. This isn't a historical drama. No need to be so formal.\"\n\n\"Understood. I don't talk like this because I enjoy it.\"\n\nChris said goodbye and went to find Piaro. He requested a sparring match, then asked, \"Is there a significant difference between my skills and Zibal's?\"\n\nAccording to rumors circulating among the seven great guilds, Zibal had been narrowly defeated by Piaro. Chris, meanwhile, couldn't land even a minor wound on the legendary farmer. The gap had to be enormous.\n\nPiaro tilted his head. \"Zibal? Who's that?\"\n\nChris's eyes widened. \"What?\"\n\nThe man didn't even remember Zibal's name?\n\n*Then does Piaro remember me?*\n\nChris felt a surge of frustration. He began walking away, shoulders slumped, when Piaro spoke again.\n\n\"I don't know who this Zibal is, so I can't compare him to you. But I can tell you one thing. You are the third strongest person I've seen recently. You should take great pride in that.\"\n\nChris froze. His eyes widened. Was he thrilled by Piaro's words? No. The feeling was unpleasant. Shocking.\n\n*Last time, I was second strongest.*\n\nHe wasn't mistaken. He'd definitely heard that on his first visit. Back then, he'd been second. Now he was third?\n\n\"I know you sparred with Duke Grid recently. Is Duke Grid stronger than me?\"\n\nPiaro nodded without hesitation. \"That's right.\"\n\nChris's jaw tightened. \"Then the other person stronger than me. Who's stronger between him and Duke Grid?\"\n\nPiaro considered the question. His expression grew uncomfortable.\n\n\"My Lord is not yet his opponent.\"\n\n\"I see.\"\n\n*Zibal, when did you become so strong?*\n\nChris was genuinely impressed.\n\n*He truly is ranked second. You must be the strongest after Kraugel and Agnus.*\n\nHis evaluation of Zibal rose daily. Zibal, unaware of this development, couldn't help feeling inexplicably pleased.\n\n***\n\nOne of the God Hands' greatest benefits was automatic hunting. If the hands remained within thirty meters of Grid when a monster died, Grid gained the experience without lifting a finger.\n\nGrid wanted to maximize this advantage.\n\n*Should I create a portable furnace?*\n\nHe could either limit blacksmithing to the smithy, or work while the God Hands hunted. Which was more efficient? Obviously the latter. He'd acquire experience and items through hunting while simultaneously crafting.\n\nIt could work in reverse, too. Grid could hunt while the God Hands produced items.\n\nHe shook his head in wonder. \"Am I a genius?\"\n\nHe wasn't joking. Grid was completely serious. He genuinely admired himself for conceiving such a brilliant plan.\n\n\"Let's try it.\"\n\nGrid activated **Item Creation** to design a portable furnace. The attempt succeeded. His knowledge as a legendary blacksmith meant he understood furnace construction perfectly. Producing the desired item was trivial.\n\n> [Blueprint: Portable Furnace has been acquired!]\n\n> [**Portable Furnace**]  \n> Rating: <span class=\"rarity-unique\">Unique</span>  \n> A furnace that can be used anywhere, provided there is sufficient firewood and adequate space.  \n> However, the small size prevents smelting large quantities of minerals simultaneously.  \n> * Item creation speed is 60% lower than when using a normal furnace.  \n> Weight: 7,390\n\n\"Perfect!\"\n\nGrid's excitement was palpable. The reduced speed was acceptable. Being able to smelt minerals and modify items anywhere was liberating. He felt like he'd sprouted wings.\n\nA massive grin split his face.\n\nGrid began crafting the portable furnace.\n\n***\n\n*Puuok! Puuok!*\n\n*Kyaack!*\n\n> [2,121,500 experience has been acquired.]\n\n> [2,287,000 experience has been acquired.]\n\n> [The Sword Mastery of 'God Hand' has increased to beginner level 7.]\n\n\"Kyong!\"\n\n\"Hang on!\"\n\n*Kuwek!*\n\n> [Your memphis Noe's level has risen to 190.]\n\n> [The level of the doppelganger Randy has risen to 126.]\n\n*Ttang! Ttang!*\n\n> [You have succeeded in making <span class=\"rarity-rare\">Mass Production Grid's Sword</span>!]\n\nAn absurd scene unfolded in the desert near Reidan Castle's walls. Grid sat at an anvil before a compact furnace, hammer rising and falling in steady rhythm. Four golden hands and two cats flew through the air around him, slaughtering monsters.\n\nThe four golden appendages were the God Hands. The two cats were Noe and Randy, who'd copied Noe's appearance. Grid actively utilized his hands and pets for hunting while earning profit through item production.\n\n\"The giant worm died and left a shell!\" Noe's voice rang out.\n\n\"I got the tongue of the desert toad!\" Randy called.\n\n\"Leave it there.\"\n\n*Ttang! Ttang!*\n\nGrid continued hammering. Loot accumulated in a growing mountain beside him. The hands, Noe, and Randy gathered drops from slain monsters. It was an astounding, ridiculous, utterly fraudulent sight. Grid earned experience and gold while sitting.\n\n\"Can Grid actually raise his level to fifth on the unified rankings like this?\"\n\n\"Setting aside Noe and Randy, now he has the hands as well? He could take a nap while the God Hands hunt and level up.\"\n\n\"It's basically a macro...\"\n\nThe legendary class exclusive items were truly exceptional. The Overgeared members felt waves of envy.\n\n***\n\nPeak Sword approached Grid. \"I heard Kim Doohyun decided to visit Ruby's school festival.\"\n\nGrid was distributing the <span class=\"rarity-rare\">Mass Production Grid Set</span> to Reidan's soldiers. Thanks to the hands, he crafted items and gained experience for free.\n\nGrid looked up, confused. \"Who is Kim Doohyun?\"\n\nPeak Sword stared at him. \"Wow. You don't know Kim Doohyun?\"\n\n\"I don't know. Who is he?\"\n\nPeak Sword exhaled slowly. \"His Hollywood movie ranked first at the North American and Korean box office for five consecutive weeks. He's the star of *The Diary of a Murderer*. The pride of Korean cinema. The Korean Patriotic Association awarded him two medals.\"\n\nGrid frowned. \"Did you give permission to hand out the medal?\"\n\n\"Why would permission be needed? It's based on individual achievement.\"\n\n\"I see. I didn't know, since I've never received one.\"\n\n\"Anyway, there's one area where Kim Doohyun is lacking.\"\n\n\"What?\"\n\n\"Two years ago, there was a rumor he was dating a minor. A seventeen-year-old idol.\"\n\n\"How old is Kim Doohyun?\"\n\n\"Thirty-one.\"\n\nGrid shrugged. \"Well, age doesn't matter when it comes to love...\" His face suddenly contorted. \"Wait. Don't tell me...\"\n\nAn ominous feeling washed over him.\n\nPeak Sword snapped his fingers. \"Exactly! Isn't Ruby beautiful? A girl completely different from you, praised as the second Yura. I'm worried Kim Doohyun might try to approach Ruby.\"\n\nGrid's expression darkened. He hoped his sister Sehee would meet a good man he could befriend. But he didn't want that man to be a celebrity. He'd encountered the ugly side of the entertainment industry during broadcasts after the National Competition.\n\n*A famous actor would have countless female admirers.*\n\nA playboy was one thing. But Grid couldn't tolerate a playboy flirting with his sister.\n\nHe stood abruptly. A glance at the time revealed the festival would start in two hours. Grid prepared to log out.\n\n\"That reminds me, I should be wary of the crowds at the festival.\"\n\nHow terrible would it be if anti-fans surrounded him?\n\nPeak Sword saw Grid's troubled expression and misunderstood.\n\n*Truly God Grid! As the protagonist of the fifth Korean Wave, his popularity is so overwhelming that attending alone would be a burden.*\n\nPeak Sword made a suggestion. \"I'll go with you! I'll act as your manager!\"\n\nGrid hesitated. He'd be more conspicuous traveling with Peak Sword.\n\n*But isn't it safer than going alone?*\n\nPeak Sword held a black belt in Taekwondo. His physique was intimidating. Grid decided he'd make an adequate bodyguard.\n\nHe nodded.\n\n***\n\n*I can finally meet Noe.*\n\nWorld star Kim Doohyun was a quiet man. People mistook him for a cold urbanite because of his taciturn nature. But the truth was different. Doohyun came from the countryside. He was warm-hearted and loved animals.\n\nThe rumor about him preying on schoolgirls was false. The idol who'd confessed to him had started that vicious lie.\n\n*I want to touch Noe's padded paws.*\n\nDoohyun liked all animals, but he especially loved cats. He thought cats were perfect. Their cute, unexpected charm never failed to make him smile. Among all cats, Noe stood at the apex. The gleaming black fur and luminous eyes, the small horns and tail. All of it was adorable. The pink paw pads and tiny wings on the creature's back were mesmerizing.\n\nThat was the truth.\n\nKim Doohyun was a fan of Noe. He ranked among the top ten members of the Noe fan cafe, which boasted nearly five million subscribers. His participation in cafe activities exceeded everyone else's.\n\nHe had only one wish. To see Noe in person and touch him. To fulfill this wish, he'd decided to attend the Young Ladies High School festival. The famous Saintess Ruby attended that school. Logic dictated he'd be able to meet her brother, Grid, there.\n\n*This is my chance to befriend Grid and see Noe.*\n\nThe problem was that the exact opposite of the world star's wish was about to occur.\n\n***\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}