{
  "id": 327,
  "title": "Chapter 327",
  "content": "# Chapter 327\n\nA collective gasp rippled through Young Ladies High School's festival grounds. \n\nWomen collapsed. First one, then ten, then dozens. Within minutes, hundreds lay sprawled across the courtyard, faces flushed crimson, chests heaving with ragged breaths. The festival staff scrambled through the chaos, checking pulses, calling for medics. But just as suddenly as it began, the phenomenon ended. The victims stirred, blinked, and sat up with dazed smiles.\n\nThe school administration had no choice. They deployed medical personnel and security to investigate.\n\nA junior staff member wiped sweat from his brow. \"The victims aren't filing complaints. Most of them said they felt... good.\"\n\nThe head of security stared at him. \"Good? They collapsed unconscious in the middle of a public event.\"\n\n\"I can't explain it either.\"\n\n\"At least we won't have lawsuits.\" The man exhaled slowly. \"The festival can continue.\"\n\n\"But we still need to find out what caused this.\" The junior staffer adjusted his glasses. \"There has to be a pattern. We'll review the CCTV footage.\"\n\nYoung Ladies High School prided itself on security. Cameras covered every public space, though the administration was careful to avoid invading student privacy in private areas.\n\n***\n\nThe security team huddled around a monitor. Footage scrolled across the screen.\n\n\"There!\" Someone jabbed a finger at the display.\n\nA man moved through the crowd. Sunglasses obscured half his face, a mask covered the rest. But his hands were visible. Long fingers, precise movements. Every time those fingers made contact with a woman's skin, she crumpled.\n\n\"What the hell is this?\"\n\n\"Chemical weapon. Has to be. Some type of contact agent.\"\n\n\"A North Korean operative?\"\n\nAn older guard shook his head. \"Stop being dramatic. It's clearly not a virus, you idiots.\"\n\nSilence.\n\n\"Regardless, we need to apprehend him before this escalates.\"\n\n\"No police.\" The head of security crossed his arms. \"Just a pervert with... unusual methods. Bringing in law enforcement will destroy the festival atmosphere.\"\n\nDozens of guards fanned out across the grounds. Their orders were simple: find the masked man and remove him quietly.\n\nYoungwoo remained blissfully unaware of the manhunt. He had Peak Sword as a shield, after all.\n\n***\n\n\"Pant... pant... This it?\" Peak Sword gasped.\n\nYoungwoo doubled over, gulping air. They'd sprinted through the festival grounds, weaving through crowds and dodging security. The haunted house loomed before them, a converted gymnasium draped in black cloth and fake cobwebs.\n\n*Shit.* \n\nPain lanced through Youngwoo's fingers. The joints ached. He'd been using the manual techniques nonstop for thirty minutes, and his hands were paying the price.\n\n*Reality isn't the game.*\n\nIn Satisfy, he could work his hands all night pleasuring Irene. The capsule translated intent into action, compensating for physical limitations. But here? Here he was just a man with sore fingers and questionable life choices.\n\nYoungwoo pulled out his phone and dialed Sehee.\n\n[The phone is turned off. Please leave a message after the tone...]\n\nOff. Yerim's phone was the same.\n\n*She hasn't seen my warnings.*\n\nThat was why he'd come. Hours of unanswered texts. Yerim's last message had been sent three hours ago. They were too busy with festival preparations to check their phones, which meant they had no idea about Kim Doohyun's true nature.\n\nYoungwoo's jaw clenched. *That's why I'm doing this in person.*\n\nHe hated the supernatural. Ghosts were terrifying. He'd encountered them in Satisfy, the blue souls of Khan's ancestors drifting through the cemetery. But that was different. Those were NPCs, pixels and code. This haunted house was supposedly run by high school girls. How scary could it be?\n\nHe turned to Peak Sword. Garlic and kimchi fumes wafted off the man after two kimchi ice cream cones.\n\n\"I'm going in to find Sehee. You stay here.\"\n\n\"I want to check it out.\" Peak Sword eyed the entrance with interest.\n\n\"We're not here to play tourist.\" Youngwoo jabbed a finger at him. \"What if those security guards show up while I'm inside? Someone needs to run interference.\"\n\n\"Ah... right!\" Peak Sword straightened. \"I'm your manager. That's my job. Enjoy yourself, not mine.\"\n\nHe planted himself at the entrance like a garlic-scented sentinel.\n\nYoungwoo paid the 9,000 won admission and stepped inside.\n\n***\n\n\"KUAAAAAAAH!\"\n\nThe scream tore from Youngwoo's throat before conscious thought could stop it. His heart hammered against his ribs. \n\nDolls. Dozens of them. Plastic faces smeared with gore, glass eyes reflecting the dim emergency lighting. They hung from the ceiling at eye level, swaying on invisible wires. Blood, realistic enough to smell like copper, dripped from their mouths.\n\n*This is bad.*\n\nCold sweat broke out across Youngwoo's back. This wasn't charming. This wasn't cute teenage girls playing at horror. The production values rivaled professional haunted attractions. Dim red lighting cast everything in hellish shadows. Sound effects, perfectly timed footsteps and whispers, echoed from hidden speakers. A child's laughter, distorted and wrong, drifted through the darkness.\n\n*Go back. Just turn around.*\n\nYoungwoo's feet refused to move forward. Every instinct screamed at him to retreat. But then he thought of Sehee, unaware of the danger, vulnerable to Kim Doohyun's predatory charm.\n\n\"How pathetic am I?\" Youngwoo muttered.\n\nHe came here for his sister. Was he really going to let fear win? He forced air into his lungs, steadied his nerves, and stepped deeper into the labyrinth. It was more courage than he'd shown in years.\n\n***\n\nYerim stood at the end of the haunted house's final corridor. Her costume left little to the imagination, white fabric clinging to curves, fake blood strategically placed.\n\n*Kyaaaack!*\n\nAnother scream from the entrance. Another customer who wouldn't make it to her station.\n\n*That's the problem.* Yerim sighed. *Too realistic.*\n\nTwo hours since opening. Not a single visitor had reached the final room. Everyone fled in terror long before making it through the full maze. Yerim was bored out of her mind.\n\n\"They really went overboard with the scary props.\"\n\nShe examined her reflection in a prop mirror. The costume was perfect. Sexy, dangerous, alluring. Wasted on an empty room.\n\n*Well, as long as I can show Youngwoo later.* \n\nThe thought made her smile. She pulled out her phone, the screen's glow illuminating her face in the darkness.\n\n\"Huh?\"\n\nNotifications flooded the display. Missed calls. Text messages. All from Youngwoo.\n\n\"Hehe.\"\n\n*He saw the photo I sent.* Yerim's heart fluttered. She opened the message thread.\n\n> What are you wearing?\n> \n> Is Sehee with you?\n> \n> Why is your phone off?\n> \n> Be careful of Kim Doohyun. That bastard might try something.\n\nWarmth spread through Yerim's chest. Youngwoo was worried about her. Boys had chased her before, dozens of them, but this was different. This was someone she actually cared about noticing her existence.\n\n*Dugun dugun.*\n\nHer pulse quickened. Fingers flying across the keyboard, she composed a reply.\n\n> You don't have to worry. I won't cheat even if he's a world star ♥ Sehee is doing the Sati...\n\n\"Finally.\"\n\nYerim's head snapped up.\n\nTwo hours and twenty-three minutes after opening. The first customer to reach the final room shuffled through the doorway. Yerim studied his approach, her lips curving into a smile that would make grown women jealous.\n\n\"Perfect timing.\"\n\n\"Ack!\" \n\nYoungwoo's legs buckled. Exhaustion from navigating the maze, combined with the shock of seeing Yerim's costume, was too much. He collapsed against the wall. Her beauty and charm matched his dexterity stat, perfectly calibrated to destroy his composure.\n\nThe compatibility was lethal.\n\n***\n\nYoung Ladies High School's second athletic field buzzed with activity. Normally reserved for sports teams, today it hosted thousands of spectators. The Satisfy fighting competition was about to begin.\n\n\"Is Doohyun competing?\"\n\n\"Announcer Lee Minjung is here too!\"\n\n\"I came to see Saintess Ruby!\"\n\n\"Sehee! Sehee! Sehee!\"\n\n\"Doohyun! Doohyun! Doohyun!\"\n\n\"Minjung! Minjung!\"\n\nPrincipal Lee Cheongsun surveyed the crowd with satisfaction. She'd recognized the marketing potential immediately. Shin Sehee, Kim Doohyun, Lee Minjung... all popular figures. Using them to promote the festival had drawn an unprecedented turnout. The principal felt a surge of pride.\n\nMeanwhile, Sehee studied the tournament bracket in the waiting room.\n\nSixteen participants. Celebrities from various fields: entertainment, sports, literature. All chosen for publicity rather than skill. The level disparity was absurd. Some were level 40 beginners. Others exceeded level 200. But balance didn't matter. This was exhibition, not serious competition.\n\n*My opponent is...*\n\nGo Jimyung. Baseball player. Former star of the KBO league, once South Korea's best hitter. Last year he'd started dating Reina from the girl group Farina. His performance had nosedived since then. Fans blamed the relationship, but he remained popular enough for appearances like this.\n\n*Fine by me.*\n\nGo Jimyung was level 187. Second highest in the tournament bracket. Sehee had no chance of winning. But she didn't care. She'd only agreed to participate because the school requested it. Being eliminated early meant less time wasted.\n\nShe didn't notice Go Jimyung watching her with predatory focus. Motivation burned in his eyes, fueled by Reina's words.\n\n\"There are death penalties in that game, right? Make sure you kill that Sehee girl in the tournament.\"\n\n*I don't understand why, but my goddess commands it.*\n\nThe tournament was supposed to use sparring mode. Health dropped to minimum, no actual death. But rules could be declined. If Sehee accepted sparring mode, he'd refuse. Then he'd kill her for real.\n\n*Kukukuk.*\n\nGo Jimyung was being manipulated by a woman with a rotten heart. His life was spiraling toward ruin, and he didn't even realize it.\n\n***\n\n*Something feels wrong.*\n\nYoungwoo arrived at the second athletic field wearing a festival mascot mask instead of sunglasses. Yerim and Peak Sword flanked him. Instinctive unease crawled up his spine.\n\n*It's Kim Doohyun.*\n\nHorror images filled Youngwoo's mind. That actor, that pretty-boy celebrity, flirting with Sehee at this exact moment. The thought made his skin crawl.\n\n---\n\n**Glossary of Common Korean Terms**\n\nOriginal glossary link.\n\nCurrent schedule: 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and to help reach goals for extra chapters. Early access chapters will be updated after daily releases are complete."
}