{
  "id": 328,
  "title": "Chapter 328",
  "content": "# Chapter 328\n\nReina. Leader of the girl group Farina. Two years ago, she'd fallen for Doohyun at first sight and confessed her feelings.\n\nThe result? Rejection. Cold, absolute rejection.\n\nShe'd received countless confessions before. None had ever turned her down. The shock shattered something inside her. Love curdled into resentment. Resentment festered into obsession.\n\nShe spread rumors that they were dating. Doohyun's image took a nosedive. The stigma of \"high school girl killer\" stuck to him like a brand, and Reina had been the one holding the iron.\n\n*Kim Doohyun.*\n\nLast year, fresh off her college entrance exams, Reina started dating Go Jimyung. But Doohyun still occupied her thoughts. In fact, she'd chosen Jimyung specifically to make Doohyun jealous.\n\nIt hadn't worked.\n\n*Do you think I'll let you flirt with other girls?*\n\nReina was preparing to do something insane. Again.\n\nShin Sehee. Pretty wasn't the right word. Beautiful. Gorgeous, even without makeup, in a way that made Reina's carefully applied cosmetics feel like a mask. And looks were just the beginning. Top grades in the entire country. A hidden class in Satisfy. Sister to the famous Grid.\n\nThe perfect daughter-in-law material.\n\nReina's conclusion was simple. Doohyun attended this festival to seduce Sehee. Why else would a world-class celebrity show up at a high school event? She had no intention of forgiving the girl.\n\nShe planned to use Go Jimyung to crush Sehee completely.\n\n***\n\n*I'm too late.*\n\nDoohyun burst into the fighting competition's waiting room just as Sehee's turn came up. She stood next to the two Satisfy capsules on stage, small and composed.\n\n*We'll talk after the match.*\n\nHe smiled despite himself. The image played out in his mind. Becoming friends with Sehee and Grid. Meeting Noe someday.\n\nThe smile died on his lips. Go Jimyung stood across from Sehee as her first opponent.\n\n*No. It can't be.*\n\nDoohyun knew Reina better than anyone. She wasn't normal. Was it really coincidence that her boyfriend participated in this festival and drew Sehee as his opponent?\n\nThe odds weren't good.\n\nDoohyun ran.\n\n***\n\n*Oh my. She's stunning.*\n\nAnnouncer Lee Minjung had built her career on skill and beauty. She knew exactly how to leverage both. But even she felt diminished standing near Sehee.\n\nBig eyes in a small face. Doll-like features. There was a reason the press called her Little Yura. It was an unusual, almost unsettling beauty.\n\nLee Minjung shook off the creeping inadequacy and raised her voice to the crowd.\n\n\"We're about to begin Young Ladies High School's Satisfy fighting competition! But first, let's hear from our participants!\"\n\nHer skills showed. She drew out the nervous Sehee, played up the excited Go Jimyung, and worked the audience into a frenzy. When the energy peaked, she finally announced the start.\n\n\"The first match begins now!\"\n\n\"Waaaahhhhh!\"\n\n\"Sehee, you can do it!\"\n\n\"Go Jimyung! Just like when you play baseball!\"\n\nThe crowd roared as both participants entered their capsules.\n\n***\n\n*Pahat!*\n\nRania Coast materialized around them.\n\nLight flashed across the designated competition stage before scattering like broken glass. The fragments caught the sea's reflection and illuminated the white robes of the beautiful girl who appeared.\n\nRuby. Shin Sehee.\n\n\"Hah. Hidden classes get fancy login effects.\" Go Jimyung pulled out a mace and approached. His voice dropped low. \"Both siblings got hidden classes. You connected to S.A. Group somehow? Give me an introduction.\"\n\nSehee didn't answer. She'd disliked Go Jimyung from the start. Something about him felt hostile. And those calculating eyes made her skin crawl.\n\nGo Jimyung's frown deepened. \"Not answering? Are you ashamed?\"\n\n\"Just start.\"\n\nSehee's tone was flat. She sent the sparring invitation.\n\nGo Jimyung refused it. \"Look how rude you are. Grid has the same personality. You're definitely siblings.\"\n\nSehee's eyes went cold.\n\n\"Are you insulting my family?\"\n\n\"I didn't say anything. Just told the truth!\"\n\n*Buuong.*\n\nGo Jimyung swung his mace with full force. The form was perfect. A top batter's swing. Sehee couldn't dodge.\n\nThe impact knocked blood from her mouth.\n\n> [You have suffered 1,880 damage.]\n\nSehee was only level 116. Studies took priority over the game. But the armor Grid crafted for her was Epic rated, its performance far beyond standard gear. She endured the attack from level 187 Go Jimyung without taking fatal damage.\n\nGo Jimyung's expression twisted further.\n\n\"What? That's all the blood you're spitting? Oh, right. Overgeared's little sister.\"\n\n\"Didn't you get my sparring application?\"\n\n\"Yeah. But you can't kill people in sparring mode.\"\n\n\"Can you afford the backlash? A famous baseball player ignoring the rules and killing a high school girl. The public will crucify you.\"\n\n\"I don't care about public opinion. I only care about pleasing my goddess. Besides, I'm retiring after this season. Not renewing my contract.\"\n\n\"You aren't even thirty yet. Seems early to retire.\"\n\n\"Kukukk! Does it? You know my annual salary after years bouncing between Korea and Japan? An average of 10.2 billion. 10.2 billion! Enough money that my sick brother never has to work again!\"\n\nThere was nothing left to say. Sehee sighed and activated Hope. The top-tier healing skill consumed 10% of her mana to restore 10 to 30% of her health.\n\n> [Your mana has fallen by 816 after using Hope.]\n> [2,005 health has been restored after using Hope.]\n\n*This won't be easy.*\n\nCelebrities inevitably had anti-fans. Grid had plenty of toxic ones. Sehee figured that explained Go Jimyung's hostility. She refused to lose to someone who hated her brother.\n\n*I won't let him win.*\n\n> [You have equipped the +7 Wooden Staff.]\n\nShe swung the class-exclusive weapon Grid had enhanced for her. Go Jimyung dodged the clumsy attack and laughed.\n\n\"Puhahat! What's that wooden stick? Did you steal it from my sick grandmother?\"\n\nHis mace descended. Warriors with blunt weapons weren't particularly agile. Sehee managed to respond. She raised the staff with both hands and blocked.\n\n\"Uh!\"\n\nThe strength gap was massive. Sehee's stats favored stamina and intelligence. Her strength was pathetic. A warning flashed.\n\n> [You have received a great shock, paralyzing both arms for one second.]\n\nOne second of paralysis in combat was fatal. The perfect window for a combo. But not for Sehee.\n\n> [You have resisted thanks to the effect of Upright Heart.]\n\nHer class passive saved her.\n\n*Chaeng! Chaaeng! Kwaang!*\n\n\"Huh?\"\n\nGo Jimyung's frown returned. The lower-leveled girl kept blocking his consecutive attacks.\n\n*That staff. Is it legendary?*\n\nThe material looked like ordinary wood, but white light surrounded it. Who would bother enhancing a common wooden staff to +7? It had to be unusual.\n\n*Grid made it.*\n\nA dark smile crept across Go Jimyung's face. Overgeared? He had gear too.\n\n\"Did I mention I'm rich? Think I'm wearing common items?\"\n\n*Hwaruruk!*\n\nHis mace erupted in flames. The majesty of a <span class=\"rarity-unique\">Unique rated weapon</span>.\n\n*Peeng! Pepeng!*\n\n\"Kyaaak!\"\n\nSehee wasn't used to PK. She screamed when her defense crumbled. The constant flames from Go Jimyung's mace burned. She used both healing skills, but with cooldowns of 1 minute 30 seconds and 3 minutes, she could only take damage.\n\nSehee's avatar darkened with burns. Go Jimyung savored his coming victory.\n\n***\n\nYoungwoo had always been foul-mouthed. Anyone who heard him couldn't help but wince. His cursing had gotten worse after befriending Huroi. Apparently the Orator was an effective teacher.\n\nThis went beyond cursing.\n\n\"This crazy bastard!\"\n\nYoungwoo shot up from his seat in the audience and bolted. He couldn't tolerate what he saw on the monitor. Go Jimyung's ID had turned red the moment he attacked Sehee. The confrontation wasn't in sparring mode. This was ordinary PK.\n\n\"Hey! You organizer bastards! What are you doing? Sehee's in danger!\"\n\nHe screamed behind the doll mask. At least no one knew who he was. Peak Sword tried to calm him down.\n\n\"Look backstage. Management is around Go Jimyung's capsule. They'll normalize the situation soon.\"\n\n\"Calm down?\"\n\nYoungwoo struck out. His worry for his sister temporarily overcame a taekwondo master's defenses.\n\n\"Oh!\"\n\nPeak Sword hit the ground as Youngwoo charged for the stage. Yerim watched him with rapt attention from inside her ghost costume.\n\n\"Cool.\"\n\nShe exhaled slowly, fascinated.\n\n\"I wonder if he's like this in bed.\"\n\n*Puok!*\n\nThe nearby men got instant nosebleeds. Yerim's innate power of seduction was excessive. Maybe she'd been a succubus in a past life.\n\n***\n\n\"I'll connect and mediate.\"\n\nBehind Sehee and Go Jimyung's capsules, Kim Doohyun and the organizers stood beside an extra capsule prepared for emergencies.\n\n\"A warning message has been delivered to Go Jimyung. He'll calm down soon and switch to sparring mode. Don't worry.\"\n\n\"He intentionally avoided the spar in the first place!\" Doohyun's voice cracked with fury. \"Let me connect directly!\"\n\nThe organizers were infuriating.\n\n\"Haha, what reason would Go Jimyung have to do that? Doohyun, please calm down. A third party entering the contest will disrupt the schedule. As you know, the VIP participants have tight schedules...\"\n\n\"Get lost!\"\n\n\"Ugh!\"\n\nDoohyun and the organizers flew backward. A man in a doll mask had charged between them with a drop kick.\n\n\"What are you doing?\"\n\n\"Me?\"\n\nThe unidentified man opened the capsule without permission and ripped off his mask. The organizers and Doohyun stared.\n\n\"G-Grid!\"\n\n\"Yeah. I'm Sehee's brother. Don't interfere.\" Youngwoo pointed at Doohyun. \"And you.\"\n\n\"Me?\"\n\nConfusion flickered across Doohyun's face. Youngwoo growled.\n\n\"Don't think you can create some dramatic scenario where you save Sehee like a white prince.\"\n\n\"What?\"\n\nDoohyun was baffled. Youngwoo climbed into the capsule and logged into Satisfy.\n\n> [Iris recognition complete.]\n> [User information verified.]\n> [User is not registered with this capsule. Checking capsule information...]\n> [S.A. Group approved event capsule. Capsule number 31F000B4C.]\n> [Login location forcefully designated as Rania Coast.]\n> [A legendary presence. Welcome!]\n\nFamiliar and unfamiliar notifications alternated.\n\n\"You.\"\n\n\"Heok!\"\n\n\"Brother?\"\n\nGrid, Sehee, and Go Jimyung faced each other. The burning mace stopped mid-swing toward Sehee. Go Jimyung's shock froze him in place.\n\n\"Grid! Why are you here?\"\n\n\"Go Jimyung.\" Grid's voice was cold. \"You're permanently banned from the Eternal Kingdom.\"\n\nSomeday he would be king of the Eternal Kingdom. He could make such declarations because of that future. Go Jimyung's teeth ground together.\n\n\"You're just the master of Overgeared! You don't have authority to say that!\"\n\n\"Just Overgeared?\"\n\nThis low-level punk treated Overgeared lightly? The most important element in the game was items. Item power was everything.\n\n\"Fine. I won't use items to beat you.\"\n\nGrid raised a single finger. Go Jimyung and the thousands watching were confused.\n\nThen it happened.\n\n\"Magic Missile.\"\n\n*Peeng!*\n\nA white flash shot from Grid's finger. It struck Go Jimyung in the heart. Blood erupted from his mouth.\n\n\"Keook!\"\n\n*How can Magic Missile do this much damage?*\n\nGo Jimyung couldn't believe it. Grid aimed at the staggered player again.\n\n\"Magic Missile.\"\n\n\"Kuaaaaak!\"\n\nWithin moments, the number one search term on portal sites became \"Magic Missile.\" The second wasn't Grid.\n\nIt was \"Grid's Magic Missile learning method.\""
}