{
  "id": 329,
  "title": "Chapter 329",
  "content": "# Chapter 329\n\nThe Young Ladies High School Satisfy fighting competition dominated the festival's attention. Sixteen celebrities from their respective fields would compete, and everyone wanted a glimpse of Saintess Ruby in action.\n\nTens of thousands watched the livestream.\n\n*Why is Go Jimyung's ID red?*\n\n*He's not in sparring mode.*\n\n*That bastard is trying to kill Sehee. Has he lost his mind?*\n\n*Dating Reina ruined him. He's been causing problems nonstop.*\n\n*What a waste. Should've found someone better. Where are the organizers? Why aren't they stopping this?*\n\n*That piece of trash is attacking our Saintess!*\n\nThe viewers weren't idiots. Go Jimyung's intent to maim Sehee was obvious. Yet the school did nothing. Condemnation flooded the comment sections, but words couldn't protect her. Without intervention, she would die from her injuries.\n\nThen he appeared.\n\n\"Magic Missile.\"\n\nGrid. One of Satisfy's legends materialized without warning and struck down Go Jimyung. Did anyone criticize him for breaking the rules?\n\nNot a single person.\n\nThe crowd erupted in cheers.\n\n\"Truly God Grid!\"\n\nPeak Sword grinned, his blood pumping with excitement. That Magic Missile launched from Grid's middle finger had crushed both body and spirit. The way Grid treated enemies with such ruthless finality made Peak Sword's chest swell with pride.\n\n*What a reliable bastard.*\n\nFive men in black suits approached. Their aggressive postures set Peak Sword's instincts on alert.\n\nPeak Sword straightened. \"What?\"\n\n\"You're under arrest for lewd conduct, including sexual assault,\" the lead guard announced.\n\n\"Sexual assault?\" Peak Sword's jaw dropped. \"Lewd conduct? Me?\"\n\n*What the hell are these idiots talking about?*\n\nPeak Sword shook his head. \"Are you even authorized to arrest people? You're not police.\"\n\n\"We're not police,\" the guard admitted. \"But we have authority to detain criminals on campus and transfer them to actual law enforcement.\"\n\n\"I'm not a criminal! What are you even accusing me of?\"\n\nThen the memory hit him. Moses parting the Red Sea. Except Grid had parted a crowd of schoolgirls.\n\nPeak Sword's face went pale. \"Oh, you've got to be kidding me.\"\n\nHe'd become Grid's scapegoat.\n\n*This is completely unfair.*\n\nThe truth was simple. Grid was the molester, not him. But Peak Sword couldn't betray a friend. His mouth refused to form the words.\n\n\"Grab him!\"\n\nThe hired security guards were professionals with impressive physiques and training. Peak Sword wanted to weep as they charged.\n\n*Why me? Why is it always me?*\n\n***\n\nGo Jimyung's mind reeled.\n\n*How? How did this happen?*\n\nGrid appeared from nowhere and two Magic Missiles left him on death's door? Go Jimyung collapsed as Grid loomed over him.\n\n\"You dared to beat up my sister?\" Grid's eyes blazed with fury. \"What kind of trash are you?\"\n\nMagic power gathered at Grid's fingertips. Go Jimyung's heart seized with terror. Was he afraid of dying? Of losing experience and items?\n\nNo. Money and time could recover those losses. Go Jimyung feared Reina's wrath. She'd asked this favor of him. Would she be disappointed? Would she dump him? The thought made his stomach drop.\n\n*Why did I agree to this?*\n\nHe needed to prevent his death. Any way possible.\n\n\"Stop!\" Go Jimyung shouted. \"You touch me and you'll regret it! I know gangsters!\"\n\n\"Gangsters?\"\n\nGrid flinched. Reality wasn't like the game. He couldn't easily dismiss that threat in the real world.\n\n*Lousy bastard.*\n\nGrid hesitated. Then his expression shifted as a memory surfaced. Beast Master Toon. He'd been with Overgeared since the Tzedakah Guild days. Wasn't he mafia? And wasn't he currently in Korea building something with the other guild members?\n\nA vicious smile spread across Grid's face.\n\n\"You know gangsters?\"\n\n\"Yes! Very cruel ones!\" Go Jimyung insisted.\n\n\"Worse than the Italian mafia?\"\n\n\"What? The mafia?\"\n\n\"The mafia.\" Grid's voice dripped with arrogance. \"My friend is in the mafia.\"\n\nGo Jimyung's eyes bulged.\n\n*This lunatic is bluffing!*\n\n\"If that's true, then kill me!\" Go Jimyung spat.\n\nGrid didn't hesitate.\n\n\"Magic Missile.\"\n\n*Peeng!*\n\n\"Guhk!\"\n\nThe white flash from Grid's middle finger pierced Go Jimyung's skull. Understanding dawned too late.\n\n*This psychopath actually has mafia connections.*\n\n> [You have died.]\n> \n> [You have lost 18.7% of your experience and the Flaming Mace (Unique).]\n\n***\n\n\"Aaaaargh!\"\n\nGo Jimyung burst from his capsule, chest heaving. The lost experience and items meant nothing. Reina's disappointment and his public humiliation consumed him. Killed in front of thousands using Magic Missile!\n\n\"I won't forgive you!\"\n\nGo Jimyung kicked his capsule. His eyes locked onto Grid's unit across the room. He charged.\n\n\"Shouldn't you show some restraint?\"\n\nGo Jimyung froze. \"You?\"\n\nHis face twisted with rage. Kim Doohyun. World star. Reina's old flame. This eyesore was blocking his path at the worst possible moment.\n\n\"Get lost unless you want to get hurt!\"\n\nGo Jimyung had been a star batter. His arms and shoulders were packed with muscle. Most people backed down when he used that threatening tone. Kim Doohyun remained still, expression blank.\n\nGo Jimyung cocked his fist.\n\nKim Doohyun's elbow slammed into his jaw.\n\n\"Huh?\"\n\nGo Jimyung's head snapped back. He hadn't even seen the movement.\n\n\"You—\"\n\n*Crash!*\n\nGo Jimyung stumbled. Kim Doohyun leaned close and whispered.\n\n\"Tell Reina this. I ignored her actions because she was young. But she's an adult now. Adults face consequences for their choices.\"\n\n\"Ghk...\"\n\nGo Jimyung had been king during his school days. Natural strength and athleticism made him untouchable. His professional debut continued that streak. He'd never experienced such humiliation.\n\n*You'll pay for this.*\n\nHis consciousness faded.\n\nGrid had been watching from inside his capsule. He scrambled out and rushed over.\n\n*He's actually knocked out!*\n\nGrid examined Go Jimyung's unconscious form, then kicked him for good measure. Satisfaction warmed his chest.\n\nGrid turned his glare on Kim Doohyun. \"Did you set up Go Jimyung so you could look cool in front of Sehee?\"\n\nUnderstanding flickered across Kim Doohyun's face.\n\n*He heard the high school girl killer rumors.*\n\n\"I came to the festival hoping to meet Sehee,\" Doohyun said flatly. \"So I could meet you.\"\n\n\"Me?\"\n\nGrid remained tense. Doohyun pulled out his smartphone, opened Noe's fan cafe, and showed Grid the screen.\n\n\"Look.\"\n\n\"Huh?\"\n\n*What is this?*\n\nGrid's suspicion wavered as he read the display. His eyes widened.\n\n**Member ID:** Noe's Slave  \n**Member Rating:** Best Member\n\n\"...Wow.\"\n\nGrid's brain short-circuited.\n\nDoohyun bowed low. \"Please accept me into Overgeared!\"\n\n\"Your level?\" Grid asked.\n\n\"I've been busy recently. Haven't had much time to play. Level 190.\"\n\n*Is that too low for Overgeared?*\n\nDoohyun's earnest expression was nothing like his usual cool celebrity image. Grid's anger evaporated, replaced by sympathy.\n\n*Level 190 is actually pretty decent.*\n\n\"Your class?\" Grid reconsidered. \"If you're production class, I'll definitely consider it.\"\n\n\"Not production. Pet Master. It's a unique class. Is that acceptable?\"\n\nGrid seized Doohyun's hands.\n\n\"Welcome!\"\n\n\"...\"\n\n***\n\n\"Less than a month left.\"\n\nThat's how long King Wiesbaden of the Eternal Kingdom had to live. Prince Ren's face darkened. He wasn't mourning his father's impending death. He feared the monsters dwelling in Reidan.\n\nThe golem invasion of Reinhardt remained vivid in Ren's memory. Duke Grid's words echoed.\n\n\"I, Grid, swear eternal loyalty to Your Majesty.\"\n\nLoyalty to King Wiesbaden. Not the royal family. That declaration was a sword pointed at the first prince's throat. Ren had lived in fear ever since.\n\n*I must strike first.*\n\nRen monitored Reidan constantly. Intelligence confirmed they maintained only 1,000 troops.\n\n*This opportunity won't come again.*\n\nHis mind made up, Ren hurried to his private chambers. The strongest warriors he'd recruited from across the continent assembled at his summons.\n\n\"Join my army,\" Ren commanded. \"We will conquer Reidan.\"\n\n\"We accept willingly.\"\n\nThe warriors answered without hesitation. Among them stood a grey-haired middle-aged man. His name was Hurent. The man who'd lost to Grid in the 1st National Competition in five seconds flat.\n\n> [Quest in Progress.]\n\nHurent checked the notification window and smiled.\n\n*Grid. I'll repay the humiliation you dealt me.*\n\nConfidence burned in Hurent's eyes."
}