{
  "id": 330,
  "title": "Chapter 330",
  "content": "# Chapter 330\n\nPrince Ren stood before his assembled commanders, his expression resolute. \"Duke Grid still hasn't learned of my father's illness. The proof of this is that Reidan's army is still weak, so we must strike against Reidan at this time.\" He paused, letting the weight of his words sink in. \"There won't be another chance.\"\n\nThe 1st Prince was well aware of how strong Grid and his subordinates were. He had witnessed their actions during the Reinhardt golem invasion firsthand. Nevertheless, he remained hostile to Grid. Ren knew that if he stayed still, he would be devoured. More importantly, he believed in the power of his warriors, including Hurent.\n\nHurent watched as the quest notification materialized before his eyes.\n\n> **[Prince of the Eternal Kingdom - Chapter IV]**\n>\n> **Difficulty:** Not measurable.\n>\n> 1st Prince Ren has seen the strength of aura and has absolute confidence in you. He believes that you are the only rival for Duke Grid.\n>\n> Advance to Reidan with Ren's army!\n>\n> Strike down hard on Duke Grid, who is making fun of the royal family!\n>\n> **Quest Clear Conditions:** Occupy Reidan.\n>\n> **Quest Clear Rewards:** Ren will be crowned king and you will gain the title of Merit King. If you establish a kingdom, special benefits will be given.\n>\n> **Quest Failure:** Unpredictable.\n>\n> [Would you like to accept the quest?]\n\nThe difficulty was impossible to measure. Quests with users as the target often couldn't predict the challenge or consequences. Hurent's lips curved into a smile. He nodded without hesitation.\n\n\"I am willing to help you.\"\n\n*Ten months.* Ten months since Grid had humiliated him in just five seconds. Ten months since the entire world had witnessed his defeat. The contempt he'd endured since then burned in his gut like acid.\n\n*I'm going to regain my honor with this quest.*\n\nMerit King? That was just a minor title. Hurent wanted to reclaim the title of the strongest, and he believed he was now qualified.\n\n*Grid, I will show you the true power of an aura master. It will be in front of the whole world!*\n\nHis efforts over the past ten months would cause a disaster.\n\n***\n\nAutumn painted Garosu-gil Road in shades of gold and crimson.\n\nYoungwoo sat across from Doohyun in the restaurant, flanked by Sehee and Yerim. The festival had ended, and they'd decided to grab a meal together. Youngwoo leaned forward, his curiosity piqued. \"What exactly is a pet master?\"\n\nDoohyun ordered their food before answering, his usual reserved demeanor softening slightly. \"You can look at it as an enhanced version of a monster tamer. I can train monsters to act as pets or temporarily take away another person's pet.\" He paused to let that sink in. \"I can also buff my pets and your pets.\"\n\n\"Buff fellow pets?\" Youngwoo's eyebrows shot up. Even the strongest buffer, Huroi, couldn't do this. Huroi could only give buffs to his own pet. \"Take away another person's pet?\"\n\n\"I can command them,\" Doohyun confirmed. \"The duration is a minimum of 15 seconds and it can go up to 50 seconds.\"\n\n\"Can the pets that you command use their skills?\"\n\n\"Yes.\"\n\nYoungwoo exhaled slowly. \"It's a scam.\"\n\nIt wasn't an exaggeration. Taking an enemy's pet and using their original abilities? It would consume the mana of the pet and hit the enemy. If the pet possessed a buffing skill, it could be used on allies. The tactical applications were endless.\n\nDoohyun's eyes brightened. \"But the real power of a pet master is something else.\"\n\nHe was speaking many words, unlike his usual self. Youngwoo initially wondered if it was due to the beautiful Sehee and Yerim, but Doohyun's gaze remained fixed on him. More precisely, his eyes sparkled with excitement about meeting Noe.\n\n\"Your true ability?\"\n\n\"I can check the details of the targeted pet.\" Doohyun gestured animatedly. \"It means I can quickly grasp the stats, skills, weaknesses and advantages of the pet. Also...\"\n\n*Also?*\n\nYoungwoo's eyes lit up. The better Overgeared became, the happier he was. He leaned forward, full of expectations for what Kim Doohyun called the ultimate advantage of a pet master.\n\nDoohyun's voice dropped to a reverent whisper. \"I have the pet beauty ability.\"\n\n\"...Beauty?\"\n\n\"Yes, so please introduce me to Noe.\" Doohyun clasped his hands together. \"If I can, I will make Noe more beautiful. I want to be Noe's private hairdresser!\"\n\nYoungwoo stared at him, speechless.\n\n*A unique hidden class was dreaming of being a hairdresser?* \n\nIt seemed like this new member also wasn't normal. Youngwoo recalled something Vantner had said about the Tzedakah Guild in the past: \"By the way, it looks like the people who joined the guild after Grid aren't normal. A crazy person attracts other crazy people.\"\n\n*Is it me?*\n\nYerim's voice pulled him from his thoughts. \"How about it? Is it delicious?\" She held some rolled pasta to his mouth.\n\nYoungwoo blinked in surprise, then answered honestly. \"Not so much. It is too salty so I would rather buy two cups of ramyun.\"\n\nYerim pouted. \"The food that a sexy woman like me is giving you isn't delicious?\"\n\n\"What sexy woman...? You aren't sexy.\"\n\n\"Aish, even with this?\" Yerim leaned forward provocatively.\n\n\"Hik! Don't do that in a public place!\" Youngwoo's face flushed red.\n\nDoohyun watched Youngwoo sitting between Yerim and Sehee, a realization dawning on him. *Grid, this person...*\n\nHe was the true high school girl killer.\n\nYerim glanced around the table as they neared the end of the meal. \"But where did Peak Sword go?\"\n\nUntil now, they had completely forgotten about him.\n\nYoungwoo shrugged. \"He's probably out there playing around.\"\n\nPeak Sword, who had received the stigma of a sexual harasser due to Youngwoo's antics, was currently being chased by security guards for the third consecutive hour.\n\n***\n\nGrid examined the <span class=\"rarity-epic\">Mass Production Grid Set</span> laid out before him. The set consisted of weapons, helmet, armor, gloves and shoes. The weapons included one-handed swords, spears, bows, and shields. He'd designed them with the intention of equipping the soldiers of Reidan. The performance was excellent, and the set effects were superior to other equipment of the same level.\n\nHowever, there was a problem. The level restriction was **160**. Reidan's soldiers were only level **133**, so the equipment couldn't be distributed immediately.\n\n*But the performance will go down if the level limit is lowered too much.*\n\nGrid drummed his fingers on his workbench, considering his options. After a moment, he summoned Piaro and Asmophel.\n\n***\n\nPiaro and Asmophel blinked in surprise after they came running at Grid's call.\n\nGrid sat in front of a portable furnace beside Reidan's outer walls, crafting items with focused intensity. Four golden hands hunted monsters near him, moving with lethal precision.\n\n*However, the level is still low.*\n\nPiaro assessed the situation with a tactical eye. The giant worms were very weak monsters by his and Asmophel's standards. They could cut the creatures down easily, and it would be the same if Duke Grid used a skill. But these golden hands?\n\nThe four hands joined forces, yet it took them more than four minutes to hunt a single giant worm. They couldn't seize the initiative when fighting. The sight of swords moving on their own was strange, certainly, but not particularly frightening upon closer inspection. The only point worth noting was their exceptional speed.\n\nStill, Piaro appreciated the potential of the golden hands.\n\n*They're much better than when I fought him. I'm looking forward to how they grow in the future.*\n\nGrid looked up from his work. \"How long does it take for the soldiers to gain one level?\"\n\nAsmophel answered promptly. \"Currently, it's five days.\"\n\n\"Wow...\" Grid's eyes widened.\n\nThe level up speed was much faster than expected. Considering that the Winston soldiers remained in the **80s** for several months, the soldiers of Reidan were raising their levels at a phenomenal rate. It was a glimpse of Piaro and Asmophel's outstanding training methods. These were men who had once been destined to serve as pillars of the empire.\n\nGrid did some quick mental math. \"Then the soldiers will reach level 160 in five months?\"\n\n\"That's right.\" Asmophel answered without hesitation, his confidence absolute.\n\nGrid couldn't help feeling greedy. \"Can you raise their level faster?\"\n\nAsmophel frowned slightly. \"The intensity of the training is already very high. If we overwork the soldiers, they might be injured and there will be many complaints.\"\n\nGrid waved off the concern. \"Does it matter as long as they don't die? And so what about complaints? A soldier needs to do this.\"\n\nHe had experience being a soldier in the South Korean army. High intensity training? As long as they didn't die, they would eventually adapt. And if they worked hard, they would be too tired to complain.\n\nPiaro met Asmophel's gaze, then turned back to Grid. \"Yes? Let's do it.\"\n\nAsmophel's shoulders sagged. \"...I understand.\"\n\nBoth men had sworn allegiance to Grid. They had an obligation to follow him, even if the command was difficult. The soldiers of Reidan were about to suffer.\n\n***\n\n\"Run! Roll! Gear up!\"\n\n\"Stab! Shoot! Cut! Chop!\"\n\nPiaro and Asmophel showed no mercy. The 1,000 soldiers of Reidan endured harsh training every day until their muscles screamed. Sweat soaked the training grounds. Men collapsed from exhaustion, only to be hauled back to their feet. The level up speed of the soldiers increased from **1.3 times** to **1.5 times**.\n\n> [The loyalty of Reidan's soldiers has dropped by 9.]\n\n> [Reidan's soldiers don't respect you.]\n\nGrid stared at the notifications.\n\nThe situation was serious from a ruler's point of view. If the loyalty of soldiers toward the lord was lowered, it was difficult to restore.\n\nBut Grid wasn't shaken.\n\n*Ttang! Ttang!*\n\nDay and night, Grid worked at his forge without rest. He produced the Mass Production Grid Set in quantities that would have seemed impossible. Grid knew that the soldiers' respect and loyalty would rise again the day the Grid set was distributed to them.\n\n***\n\nIrene's due date was in five days.\n\nMarquis Steim, one of the main powers of the Eternal Kingdom and ruler of the north, arrived in Reidan to be present for the birth of his grandchild.\n\nGrid went out to meet him personally. \"Welcome, father-in-law.\"\n\nMarquis Steim's face lit up with delight. \"Ohh! The duke came out to meet me, I'm so flattered!\"\n\nHis eyes swept across Reidan with barely concealed amazement. He had only known Reidan as a ghost town, but it had developed quickly after Grid became lord. The population was still only 20,000, but it was excellent compared to other cities in the Eternal Kingdom.\n\n*No, it was unchallenged when it came to agriculture.* Marquis Steim observed the verdant fields stretching into the desert. Even the Saharan Empire didn't have such a great agricultural city.\n\n*I'm amazed at the level of determination to develop an agricultural city in the middle of the desert!*\n\nIndeed, his son-in-law was great. Marquis Steim smiled proudly."
}