{
  "id": 331,
  "title": "Chapter 331",
  "content": "# Chapter 331\n\nIrene's bedroom.\n\n\"Father!\"\n\n\"My daughter!\"\n\nIrene and Marquis Steim embraced. Nine months had passed since their last meeting. Tears streamed down their faces as they checked each other for signs of illness or injury. Marquis Steim's nose ran freely as he wept.\n\n*My little girl.* She had followed him everywhere as a child. Now she carried a child of her own.\n\nThe Marquis wiped his eyes and turned toward Grid.\n\n\"I hope you will always love and cherish my daughter like you do now.\"\n\nGrid met his gaze without hesitation.\n\n\"I will love her more than I do now.\"\n\n> [The child in the belly has felt the true love of the couple, increasing all stats by 1.]\n\n*Finally.* Grid whispered words of love to Irene every day, but the baby had been silent for nearly a week. Five days remained until the due date. Perhaps this would be the last prenatal education.\n\n***\n\nOutside Irene's bedroom, the knights of both houses stood in formation. A young man's eyes suddenly narrowed. Laden, the finest talent in the north after Phoenix, shifted his stance.\n\n\"There are four people in the bedroom, not three. Does Duke Grid have a shadow?\"\n\n*Four people?*\n\nPiaro and Asmophel exchanged glances. They sensed only three presences. Duke Grid, Irene, and Marquis Steim.\n\n*This boy wants to show off.*\n\nAsmophel stepped forward.\n\n\"Did you say you are Laden? Are you certain enough to interrupt the duchess?\"\n\nIrene needed absolute stability. The consequences of bursting into her bedroom without cause would be severe. If no fourth person existed, both Duke Grid and Marquis Steim would be furious.\n\nPiaro's voice cut through the tension.\n\n\"You will take responsibility for this.\"\n\nLaden nodded.\n\n\"I will.\"\n\nPiaro knocked on the door.\n\n\"What's going on?\"\n\nGrid's voice carried through the wood. Piaro and Laden confirmed the response before both groups of knights filed into the bedroom.\n\nIrene's face flushed with displeasure at the sudden crowd. Grid's expression darkened.\n\n\"Why is it so loud?\"\n\nLaden stepped forward.\n\n\"There is a rat.\"\n\n\"What?\"\n\n*A rat?* Grid's confusion lasted only a moment. Laden drew his sword and began stabbing at the ceiling in rapid succession.\n\n\"...Gone.\"\n\n\"What?\"\n\n*This is a disaster.* Piaro pressed a hand to his forehead. Grid's face twisted with barely controlled anger.\n\nLaden bowed his head.\n\n\"A moment ago, I felt someone hiding on the ceiling. But they have vanished.\"\n\nGrid stared at him in disbelief. His Insight stat was 1,550. Even Faker couldn't approach within three meters without being detected.\n\n\"There was a rat hiding above me? If this is true, why didn't I notice?\"\n\nLaden said nothing. He simply lowered his head further and waited for punishment.\n\nGrid turned to Marquis Steim.\n\n\"Who is this person?\"\n\nThe Marquis coughed lightly.\n\n\"An outstanding young man. He's still young and sometimes makes mistakes. Please understand.\"\n\n\"Ah.\"\n\n*The Northern Nova, Laden.* Grid filed the name away. *A bluffer.*\n\n***\n\n*Impressive.*\n\nKasim, King of Shadows and the world's strongest assassin, melted into the darkness above the castle. For a young knight to detect him at all was remarkable.\n\n*Time births new talent.*\n\nThe Eternal Kingdom produced fewer geniuses than the Saharan Empire simply due to population. The Empire had ten times the people, which meant ten times the talent pool. This fact burned in Kasim's heart. His vengeance against the Empire would be more difficult if this pattern continued.\n\n*I'll need to be more careful.*\n\nSuruk.\n\nKasim disappeared into shadow.\n\n***\n\n\"My money.\"\n\nTtang! Ttang! Ttang!\n\nGrid stood in the smithy for the first time in days. Two anvils flanked him. Four golden hands hammered in perfect rhythm with his own strikes. The young blacksmiths working nearby stared in amazement.\n\nKhan approached.\n\n\"You look upset. What's wrong?\"\n\n\"Marquis Steim brought a young knight who irritated me.\"\n\n\"Huhu, giving you a bad impression. The young man is pitiful.\"\n\nGrid's jaw tightened.\n\n\"Irene is sensitive because of the child. I want to block his career path.\"\n\n\"That's a poor idea given your position. You've witnessed firsthand how persecuting the weak causes resentment.\"\n\n\"...You're right. I wasn't thinking.\"\n\n*Two years ago, I was weak too.* Grid remembered the terror of being crushed by those with power. Now that he possessed strength, his first instinct was to abuse it?\n\n*Pathetic.*\n\n\"Thank you. You're too good for me.\"\n\n\"Huhu, you are also very, very good.\"\n\n\"An old man should keep his dignity.\"\n\nGrid smiled and leaned his head against Khan's shoulder for a moment. Like a grandchild seeking comfort from his grandfather.\n\nThe young blacksmiths exchanged glances.\n\n*'These two are very close.'*\n\n*'A love that transcends status, gender, and even age?'*\n\n*'They should watch their mouths.'*\n\nTtang! Ttang!\n\nWhile misunderstanding deepened around them, the God Hands continued their work. They produced basic components for the Mass Production Set and delivered them to Grid, who reserved only the highest quality materials for his own hands.\n\n> [The skill level of God Hand's Blacksmithing has increased to Advanced Level 2.]\n\n> [The skill level of (Understanding of Gods' Weapons) Legendary Blacksmith's Craftsmanship Skill has increased to Level 7.]\n\n> [The number of times the Legendary Blacksmith's Creation skill can be used has increased by three. Number of items that can be created at present: 13/21.]\n\nGrid's growth continued.\n\n***\n\n\"Run!\"\n\n*How rotten!*\n\n\"Roll!\"\n\n*Damn!*\n\n\"Gear up!\"\n\n*Dammit!*\n\nReidan's training grounds baked under the sun. Thanks to the 'Will of Duke Grid,' the soldiers endured hell itself. They rolled across sand scorched by the sun, crawled through dirt, vaulted over spiked obstacles, and thrust their swords and spears until their arms screamed.\n\n*How long will this last?*\n\nThe question faded as pain consumed all thought. Their muscles tore and rebuilt themselves. Many wanted to surrender.\n\n\"The more you sweat, the safer your family!\"\n\n\"Do you want to return to the days of starvation? Then endure! Protect your home!\"\n\nPiaro and Asmophel's voices rang out whenever resolve weakened.\n\n*Yes, stand up!*\n\nHate filled the soldiers' eyes. *Wasn't it foolish to quit now?* They had endured this training for months with the goal of overcoming these trials. Still, exhaustion loosened their tongues.\n\n*'If I think about it, there isn't even a war. Why this torture?'*\n\n*'Duke Grid must be bullying us on purpose!'*\n\n*'Damn Duke Grid! Curse Reidan's sun! Fall on the road and break your nose!'*\n\n> [The loyalty of Reidan's soldiers has dropped by 7.]\n\n> [Rumors have spread that the soldiers of Reidan hate you.]\n\n\"Wow.\"\n\n*Loyalty could be raised at any time.* Grid had thought this when he ordered training to be gradually increased, not decreased. Now alarm bells rang in his head. They hated him? This went beyond simple resentment.\n\n*Time to give them a carrot.*\n\nGrid opened the roster of Reidan's soldiers. The list showed basic information for all 1,003 troops. Names, gender, level, and occupation. For detailed stats, skills, and unique stories, he would need the Great Lord's Sword.\n\n\"Eh?\"\n\nGrid's eyes widened as he sorted the list by level. One soldier had reached Level 150. Compared to the average range of 136 to 139, this growth rate was extraordinary.\n\n*What?*\n\nGrid summoned Piaro.\n\n\"You called?\"\n\nAfter Lauel and Rabbit, Piaro was Reidan's busiest man. Managing both fields and army left no room for rest. Yet unlike Lauel and Rabbit, whose faces showed constant exhaustion, Piaro's complexion remained vibrant. His stamina was simply too high to feel fatigue.\n\nGrid cut straight to the point.\n\n\"I checked the roster. Royman stands out. What happened? Did you give special training?\"\n\n\"Nothing. Asmophel and I instruct all soldiers the same.\"\n\n\"Then why is Royman's growth rate so different?\"\n\nPiaro crossed his arms.\n\n\"The difference between talent and motivation. Some soldiers follow the training schedule without thinking. Others actively work to maximize their growth.\"\n\n\"Can you give extra training to this soldier called Royman?\"\n\n\"You want Royman to grow faster?\"\n\n\"Yes, to at least Level 160.\"\n\n\"I understand. I had already planned to create a special group. I will focus my attention on Royman.\"\n\n\"Special group?\"\n\n*This sounds promising.* Grid's eyes lit up.\n\n*Overgeared Task Force?*\n\n\"Duke Grid! Irene has gone into labor!\"\n\n\"What?\"\n\n*The due date is two days away.* Grid abandoned the items on his anvil and sprinted toward the castle. Piaro followed.\n\nA notification window materialized before Grid's eyes.\n\n> [When the baby is born, do you want it to be a boy or a girl? Your answer will have a profound impact on the child's gender.]\n\nGrid answered without hesitation."
}