{
  "id": 333,
  "title": "Chapter 333",
  "content": "# Chapter 333\n\nPrince Ren's expedition to Reidan had to proceed in secret.\n\nSpreading the news would give Grid time to respond. Ren recruited his army by organizing small groups and moving them through the estates of allied nobles. The process consumed weeks, but Ren refused to rush.\n\nPrudence would be rewarded.\n\n***\n\nThe day before Grid's son, Lord, was born, a disturbance rippled through the fortified city of Patrian. Prince Ren arrived at the gates with seven thousand troops.\n\nEarl Ashur met him in the courtyard. The magician bowed low.\n\n\"I greet the prince.\"\n\nHe wielded the strength to control the balance of nations, yet he performed his duty as a loyal subject.\n\nPrince Ren shifted his weight. \"Earl, you don't need to do this. Get up. Please.\"\n\nEven a prince couldn't afford to antagonize a great magician. The same rule applied in the empire.\n\nEarl Ashur straightened. \"Why has the prince visited this place with an army?\"\n\nPrince Ren met his gaze without flinching. \"Unfortunately, the king's life won't last much longer. I feel it is my duty to ensure the stability of the kingdom and the royal family. I have decided to strike at Grid.\"\n\nEarl Ashur remained silent. He had heard the rumors about what Grid said at the rewards ceremony after the golem invasion. He understood the prince's feelings and position. But confusion gnawed at him. The wicked Grid held his son hostage. Bland might be in danger if Reidan was invaded.\n\nPrince Ren studied the worry etched across Ashur's face. \"I'm well aware of your situation. Your son Bland is being held hostage in Reidan, correct? Several months ago, Duke Grid exploited this weakness to force your cooperation.\"\n\nEarl Ashur's jaw tightened. He couldn't bring himself to admit the fact aloud. One of the continent's ten great magicians, in someone else's hands. The shame burned.\n\nPrince Ren leaned forward. \"I will defeat Duke Grid and rescue Sir Bland. Trust me and cooperate with me.\"\n\n\"Do you have a plan?\"\n\nPrince Ren was well aware of the strength of Grid's forces. So where did this confidence come from? Earl Ashur's curiosity sharpened as the prince gestured to several figures behind him. Commander Chucksley of the Royal Knights stepped forward, along with others, including Hurent.\n\nEarl Ashur's eyes widened.\n\n*Prince Ren had such a network?*\n\nRecently, Chucksley had made a name for himself by shooting down three flying birds with one arrow. The kingdom's influential figures were gathering under Ren's banner. Among them were users blessed by the gods, such as Hurent.\n\nTheir power was difficult for even Earl Ashur to gauge.\n\nRen continued. \"The ideal thing would be for you to personally join my army, but Duke Grid could hurt Bland. I can't ask that of you. Instead, I need a favor. Teleport three thousand of my soldiers to the Altes Mountains.\"\n\nAltes Mountains.\n\nStrictly speaking, it was Saharan Empire territory located west of Reidan. The exact opposite position from Patrian, which lay to the east.\n\nEarl Ashur's brow furrowed. \"A diversion?\"\n\n\"Precisely. Four thousand soldiers will cross the desert and draw Duke Grid's eyes, while three thousand attack from the rear.\"\n\nReidan had many excellent talents, but only one thousand soldiers. A diversion was highly likely to work. The logic was sound. However, Earl Ashur hesitated.\n\nTeleporting three thousand people?\n\nIt might be possible for the legendary Braham, but it strained the limits of Earl Ashur's abilities.\n\n*Two thousand soldiers might be possible.*\n\nHe would consume all his magic power at once and probably sustain a serious injury. It would be difficult to use magic for at least a fortnight.\n\nPrince Ren dropped to his knees. He looked up at Ashur while thousands of soldiers watched. \"I know this is an unreasonable demand. But please, for the royal family. No, for the sake of this kingdom and Sir Bland.\"\n\nThe prince of a kingdom. The heir to the throne was kneeling before an earl while his army observed. If Earl Ashur rejected this, his reputation would be destroyed. Earl Ashur realized the trap.\n\n*First Prince... He is quite sly, unlike his pure and decent appearance.*\n\nThe realization settled into place. This was how he acquired so many talents.\n\n*Yes, he will be able to deal with that evil Grid.*\n\nEarl Ashur laughed. The prince's cunning plan pleased him. He nodded. \"I understand. I will follow your will. However, my limited ability can only teleport two thousand troops.\"\n\nPrince Ren's face lit up. \"That alone is more than enough! Thank you!\"\n\nTears welled in the prince's eyes. Earl Ashur recognized the performance, but the soldiers were different.\n\nThey erupted into cheers.\n\n\"Waaaaahhhhh!\"\n\n\"Hooray for the First Prince!\"\n\n\"Hooray for Earl Ashur!\"\n\n> [The morale of the army has risen. The stats of all soldiers will increase by 5% and stamina consumption will decrease. This effect will continue as long as morale doesn't fall.]\n\nAn auspicious sign.\n\nHurent smiled at the notification window. \"The great magician who grabbed the ankles of the seven guilds is helping me. How about it, Bunny Bunny? Do you feel the difference between me and the seven guilds?\"\n\nHe would get revenge on Grid and erase his humiliation in front of the whole world. Hurent had brought Bunny Bunny, the best gaming BJ in the world, specifically for this purpose. Bunny Bunny raised his thumb while adjusting his camera.\n\n\"I must admit there is a clear difference.\"\n\nIn reality, this situation was Prince Ren's achievement, but Hurent ignored that. Hurent had the vision to recognize Prince Ren's skill and accept the quest. That was what mattered.\n\n***\n\nGrid examined the status window.\n\n**Name:** Karin  \n**Age:** 21 **Gender:** Female  \n**Occupation:** Soldier  \n\n**Title:** Royman  \n*A pseudonym used since she started pretending to be male. She really feels like a man, so her confidence increased and her strength increased by 5%. However, her charm is greatly reduced.*\n\n**Title:** New Star of the West  \n*A genius that represents the region. Her level and abilities will rise 20% faster than normal. In the 'desert' terrain, all stats will increase by 150%.*\n\n**Title:** Watched by a Legend  \n*She has attracted the attention of the legend Piaro. He has given her private lessons under the guise of military training. The rise in stats is very large and it is highly possible to acquire new skills.*\n\n**Strength:** 630 (▲) **Stamina:** 331 (▲)  \n**Agility:** 655 (▲) **Intelligence:** 99 (▲)  \n**Belief:** 10\n\n**Skills:** Beginner Bow Mastery (F), Beginner Shield Mastery (F), Intermediate Sword Mastery (D), Farming (B), Prestigious Pedigree (A), Life Saving Sword (S)\n\n*In the days when Reidan was called the second capital, Karin was born the daughter of Reidan's greatest warrior. She trained in swordsmanship for a long time and dreamed of becoming a knight like her brothers.*\n\n*But 10 years ago, Reidan became a desert, and her dreams were shattered. She lost her father to the monsters that constantly appeared, and her brothers disappeared in the vampire cities. Their status was unclear and her family fell.*\n\n*No, it is correct to say that all of Reidan fell. Since then, Karin has been living every day waiting for her brothers to return. She is truly grateful to Duke Grid for restoring Reidan and giving her time to wait for her brothers.*\n\n*She even abandoned her sex in order to do her best as a soldier.*\n\nGrid's hands trembled. \"It's really amazing.\"\n\nA named NPC with no limit on stat growth. It was very difficult to build relationships with these people. He'd heard it was more likely to win the lottery. Yet named NPCs kept appearing around Grid.\n\n*My luck is getting stronger.*\n\nGrid thought this, but it was hard to attribute it simply to luck. The answer was obvious when considering Grid's current status. A legendary blacksmith and duke of a kingdom. The number of people he commanded was still small, but he wielded unshakable power. Talent naturally gravitated toward power.\n\nGrid tilted his head. \"But to think she was a woman.\"\n\nShe was quite pretty. Her skin was rough and her hair short, but her thick lips and long eyelashes were attractive.\n\nPiaro frowned. \"Woman?\"\n\nHe expressed doubt at Grid's words. Woman? Royman? That excellent soldier? Ridiculous.\n\nGrid opened his mouth to explain to the disbelieving Piaro. \"Right? She is—\"\n\n\"Duke Grid!\" Royman fell to her knees. She looked up at Grid with mournful eyes. \"I am a man! My dream is to become a knight, then a soldier, becoming a good man at your side!\"\n\nGrid paused.\n\n*So please keep this a secret.*\n\nHe understood the implications.\n\nGrid waved his hand. \"It's a joke, a joke. Rather, I have a gift for you.\"\n\nHe opened his inventory.\n\nInside, thirty-one sets of <span class=\"rarity-epic\">Mass Production Grid Set</span> were listed by type. In fact, he had over a hundred sets, but they were left in the warehouse due to their weight. Everything in the warehouse was Normal to Rare rated.\n\nThe Grid sets in his inventory had an average <span class=\"rarity-epic\">Epic</span> rating.\n\nGrid pulled out a set. \"Now, take this.\"\n\nHe gave Royman a <span class=\"rarity-unique\">Unique</span> rated set with the highest completion.\n\nRoyman's eyes widened. \"U-Unbelievable.\"\n\nThe duke was personally giving her battle gear? Royman accepted the equipment with shaking hands. Grid looked at her tearful expression and gestured toward the barracks. \"Go ahead and put it on.\"\n\n\"Yes, yes!\" Royman clutched the Grid set to her chest and ran into the barracks.\n\nPiaro watched her go with a frown. \"That kid always changes his clothes secretly. It's one of his few shortcomings.\"\n\nGrid said nothing. He had heard that Piaro had no experience with dating. It seemed he didn't have a sense for women and couldn't distinguish a man from a woman. Grid kept his mouth shut. He never would've thought Royman was a girl if he hadn't checked her details.\n\nA moment later, footsteps pounded.\n\n\"This is amazing!\" Royman ran out wearing grey armor made of steel and black iron.\n\nGrid smiled. \"Is it good?\"\n\n\"Not good, it's great! I have never seen such great battle gear since I was born! Three times...! No, I feel four times stronger!\"\n\n\"That is being overgeared.\"\n\n\"Overgeared...!\" Royman's tone kept rising with excitement. \"I don't know what that means, but it's really amazing!\"\n\nThe pitch of her voice climbed higher. She couldn't hide her female tone and Piaro's frown deepened. He determined it was a top priority to raise Royman's masculinity.\n\nPiaro crossed his arms. \"If you are four times stronger, the intensity of your training should be increased by four times.\"\n\nRoyman's enthusiasm evaporated. \"Huh? A-Are you serious?\"\n\n\"Have I ever spoken in vain?\"\n\nShe was already working twice as hard as other soldiers and doing field work at dawn. Now she was going to get more training? By four times? Royman couldn't help feeling afraid. She resembled a frightened puppy.\n\nPiaro had no mercy.\n\nHe pointed toward the horizon. \"Jump! Run straight up Altes Mountains!\"\n\n\"A-Altes Mountains! It will take two days just getting there!\"\n\n\"We will be back by tomorrow morning!\"\n\n\"P-Piaro!\"\n\nPiaro was full of motivation. Royman's suffering began as she started to run. Anxiety flickered across Grid's face as he watched them move away.\n\n*Wait. Doesn't Royman have the Farming skill?*\n\nA bad thought crossed his mind.\n\n*Surely the special group doesn't have something to do with farming?*\n\nNo way. Grid shook his head and left.\n\n***\n\nAltes Mountains.\n\n**Pahat! Pa pa pa pa pak!**\n\nThousands of rays of light fell from the sky. Hurent and Bunny Bunny stood at the forefront of the two thousand troops that materialized.\n\nHurent grinned at the camera. \"The great Hurent's play. I want you to capture it clearly.\"\n\nBunny Bunny adjusted his lens. \"Hehe, please leave it to me.\"\n\nThe humiliated Hurent getting revenge on Grid. As long as he recorded this clearly and broadcast it, Bunny Bunny could become rich overnight.\n\n*I wish there would be many cool scenes.*\n\nHe wanted to capture the brilliant battlefield where strong players fought and skills ran rampant. It was Bunny Bunny's fervent desire.\n\nIn the distance, a spectacular sight appeared.\n\nNo.\n\nNot a battlefield.\n\nPiaro pulled out a hand plow from his inventory. \"I hope you can clear the fields here.\"\n\nRoyman stared at the farming tool. \"Piaro, why are you taking out a hand plow all of a sudden?\"\n\n\"This is part of the training. And while doing field work, take off your armor. Feel nature with your flesh.\"\n\nRoyman's shoulders slumped. \"...Yes.\"\n\nThe magnificent army of Hurent and Bunny Bunny appeared in the distance.\n\n***\n\n**Glossary of Common Korean Terms:**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}