{
  "id": 334,
  "title": "Chapter 334",
  "content": "# Chapter 334\n\nGrid watched Piaro guide Royman through a training stance. *The two of them work well together.*\n\nPiaro enjoyed teaching. Every member of the former Tzedakah Guild had trained under him at some point. Royman had the hunger to improve, the kind of drive that made students easy to mold. If they stayed together long enough, they'd become a terrifying combination.\n\n*Just don't turn him into another farmer.*\n\nGrid had invested a full Mass Production Grid set into Royman. <span class=\"rarity-unique\">Unique</span> rating, level 160 requirement. The equipment was perfect for rapid leveling. It was an investment. He needed Royman to exceed expectations.\n\n\"Duke.\" \n\nA voice pulled Grid from his thoughts. He turned to see Marquis Steim's knights approaching on the road to the castle.\n\n\"Where's my father-in-law?\"\n\nGrid glanced past them, searching for the Marquis. Laden stepped forward.\n\n\"The lord wishes to remain near the young nobleman.\" The knight's expression was carefully neutral. \"We must return north. The region is unstable right now. It cannot be left undefended.\"\n\n\"Wait.\" Grid frowned. \"If it's unstable, shouldn't he be there instead of here?\"\n\n\"We will go first and ensure stability. Even if My Lord remains absent.\" Laden's jaw tightened. \"I ask that you watch over him.\"\n\n*Father-in-law has loyal men.*\n\nGrid nodded. \"Fine. Take care of things. If you need reinforcements, contact Jude in Winston. He's an idiot, but he's strong. Unlike you.\"\n\n\"…I will remember. Thank you for your consideration.\"\n\nLaden and the knights bowed. They departed with a thousand soldiers, leaving behind five hundred elites to guard Marquis Steim.\n\nGrid watched them disappear into the heat haze. \"Abandoning his territory for a grandchild. Where's the dignity in that?\"\n\nBut he understood. Lord was perfect. Cute, smart, and precious beyond measure.\n\n*Lord, wait. Father is coming.*\n\nGrid quickened his pace. He needed to see his son. Behind him, Lauel's voice cut through the warm air.\n\n\"You know your work efficiency has dropped since Lord was born.\"\n\n\"Ugh.\"\n\nIt was true. Grid spent at least two hours every day playing with Lord. Item production had suffered. Hunting had suffered. Lauel smirked at Grid's silence.\n\n\"Your current state is fine.\"\n\n\"Eh?\" Grid blinked. He'd expected a lecture.\n\nLauel studied him. \"Learning to love someone is necessary. It will teach you to be generous.\"\n\nGrid was fundamentally simple. Narrow-minded. Lauel understood why.\n\n*He spent most of his life being despised by everyone around him.*\n\nGrid had low self-esteem despite his abilities. He struggled with people. According to the old Tzedakah members, he'd been worse in the past. Selfish. Jealous. Obsessed with himself.\n\nBut he'd changed. Irene and Khan had been at the center of that transformation. Receiving love. Giving love. The basic foundation of human connection had made Grid grow.\n\n\"You will rule millions eventually. They will pay taxes to you for the rest of their lives.\" Lauel's voice was serious. \"To become a wise king, you must first learn compassion.\"\n\n\"…\"\n\nAny normal user would have laughed. Love? Charity? A wise king? *This is just a game*, they would have said.\n\nGrid was different. Satisfy wasn't a simple game. It was as real as the outside world. Here, he'd found wealth, friends, a wife, and a child.\n\n\"I understand.\" Grid shifted his weight. \"But shouldn't we focus on the people rather than me? We can't even raise taxes properly.\"\n\n\"I will coordinate that with you.\" Lauel smiled. \"As you know, I have tyrannical qualities. Like you. We complement each other.\"\n\n\"Tyrannical… both of us…\"\n\nA chill ran down Grid's spine. He shook it off and kept walking.\n\n***\n\nReidan's desert radiated heat.\n\nPowerful monsters inhabited the sands. Prince Ren knew this. Yet his army marched without hesitation because he'd prepared countermeasures.\n\n\"That direction!\"\n\n\"Beyond there as well!\"\n\nRoyal Knights Captain Chucksley. The kingdom's finest archer, Ferrell. Two legendary fighters led small squads ahead of the main force. Their mission was simple. Eliminate threats before the army reached them. Royal monster scholars had mapped every creature in the region, marking their locations with precision.\n\n\"This is easy.\"\n\nSquads scattered in all directions from the central column. They killed everything in their path. The main army advanced through cleared ground.\n\nPrince Ren smiled and gestured to twenty assassins.\n\n\"Reach Reidan first. When the war begins and their defenses weaken, capture the duchess. Bring her to me.\" He paused. \"Or kill her.\"\n\n\"Yes!\"\n\nThe assassins vanished into the desert. Ren watched them go, confidence swelling in his chest. He raised his voice to the army.\n\n\"Faster! We must reach Reidan by tomorrow to coordinate with Hurent's arrival!\"\n\n\"Ohhhhhh!\"\n\nThe soldiers roared. Morale was high. The desert heat meant nothing to men who would soon crown a new king.\n\n***\n\nLaden rode at the head of a thousand northern soldiers. He climbed a sand dune and raised his hand, halting the march.\n\n*What is that?*\n\nHe urged his horse up the slope. The soldiers murmured appreciation at his smooth handling of the terrain. Then Laden crested the rise and saw them.\n\nThousands of soldiers. Marching west.\n\n\"That banner…\"\n\nLaden's blood went cold. A silver dragon with spread wings. The royal family of the Eternal Kingdom.\n\n*Why is the royal army in the west?*\n\nThey were heading toward Reidan.\n\n*Celebrating the young lord's birth?*\n\nThe scale was wrong. Too many troops for a celebration.\n\n*No. It can't be.*\n\nPrince Ren hated Duke Grid. Fear, really. A cornered rat would bite. Marquis Steim had been trying to mediate between them, to prevent exactly this kind of confrontation after King Wiesbaden's inevitable death.\n\n*All of the lord's efforts, wasted.*\n\n\"Why are northern troops in the west?\"\n\nLaden turned. Three hundred cavalry approached from behind. One of the royal squads clearing monsters. The elite unit known as Iron Wind. Their leader, Beida, was famous for dual spear mastery.\n\n\"I asked why northern troops are here.\"\n\nBeida rode closer. No hostility in his posture. They served the same kingdom. The northern soldiers relaxed.\n\nLaden saw the danger.\n\n\"Get down!\"\n\nHis shout cut through the air. The soldiers dropped flat. A spear whistled over their heads, thrown by Beida. It took the heads of three men who'd been too slow.\n\n\"H-Hik!\"\n\nSurvivors pissed themselves. The entire northern force went white with shock. Beida studied Laden.\n\n\"You have good eyes. What is your name?\"\n\n\"You talk too much.\" Laden's hand rested on his sword hilt. \"Like a coquettish woman.\"\n\n\"…!\"\n\nThe insult struck home. Beida's calm mask cracked, revealing the predator beneath.\n\n\"You!\" Beida's voice rose. \"I will cut off your arms and legs before asking again. Hiyah!\"\n\nHe charged. Speed beyond human limits carried him across the sand like wind. The northern troops trembled.\n\nLaden remained still.\n\n\"You killed Marquis Steim's soldiers.\" His voice was ice. \"I will repay that sin with your death.\"\n\n\"Bah!\"\n\nLaden's hand moved to his sheath. He watched Beida close the distance.\n\n\"You are still wet behind the ears!\"\n\nPuok!\n\nBeida's spear pierced sand where Laden had stood a heartbeat earlier. Laden sidestepped and cut low, aiming for the thigh.\n\nChaaeng!\n\nBeida blocked with his spear shaft. \"You are fast, but not strong… Kuk?\"\n\nHe looked down. Blood welled from his wrist.\n\n\"You…\"\n\n*Phoenix isn't the only dangerous knight in the north.*\n\nLaden struck. Beida went down, stunned and bleeding. Laden turned to the northern troops.\n\n\"Kill them all. Then return to Reidan.\"\n\nYesterday, they'd served the same king. That was yesterday. Laden knew Marquis Steim would stand with Duke Grid over Prince Ren. The decision was simple.\n\n***\n\nHurent descended from the mountain, mood soaring.\n\n*It won't be long now.*\n\nHis blood sang with anticipation. The five-second logout. He would erase that humiliation.\n\n*I will show him the true power of aura.*\n\nAura's greatest strengths were fixed damage and form manipulation. During the National Competition, he'd failed to properly utilize the form changes. Now, he'd mastered them.\n\nImagination made real. With this fraudulent power, Hurent believed he could crush anyone. Grid. Kraugel. The top rankers. Agnus. The hidden rankers.\n\nHe would overwhelm them all.\n\n\"Who are you?\"\n\nTwo farmers blocked the path as Hurent's two thousand troops emerged from the Altes Mountains onto the desert's edge. Hurent scowled and lashed out with aura. The farmers' eyes widened as the energy stretched like a whip toward their faces.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule: 20 chapters a week.**  \n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}