{
  "id": 336,
  "title": "Chapter 336",
  "content": "# Chapter 336\n\nGrid watched the maid fasten the fresh diaper. His chest swelled with pride.\n\n\"My grandson doesn't even cry during a diaper change.\" Marquis Steim leaned over the crib. \"A real man, just like his grandfather.\"\n\n\"Dexterous hands, though.\" Grid folded his arms. \"Those are from me. But he got Irene's looks, thank the gods. And the intelligence.\"\n\n\"Perfect.\" Steim straightened. \"The boy is perfect. God's finest work.\"\n\nGrid grinned. \"I respect any woman who can give birth to a son like this.\"\n\n\"And I admire any man who could father a woman as lovely as Irene.\"\n\nThe two lords laughed, their dignity forgotten. Irene stood by the window, lips pressed into a thin line. She didn't interrupt. Their joy was too genuine to smother.\n\n\"Lord is sleepy.\" She turned from the glass. \"We shouldn't disturb his nap.\"\n\nGrid deflated. \"I wanted to play a bit longer.\"\n\n\"Father is right.\" Marquis Steim rested a hand on Grid's shoulder. \"Sleep is crucial for growth. We can't interfere with that.\"\n\nGrid sighed. \"Fine.\"\n\nHe bent over the crib and kissed Lord's forehead. \"Sleep well.\"\n\nThe couple left their son with the nanny and departed with Marquis Steim.\n\n***\n\nMoments later, after the nanny dozed off, something moved in the darkness above.\n\nA shadow detached from the ceiling. No sound. No disturbance. The sleeping nanny and the knights stationed outside remained oblivious to the intrusion. Few on the continent could detect Kasim, the King of Shadows, when he chose stealth.\n\n*He's even cuter up close.*\n\nKasim had initially guarded Irene, but priorities had shifted. Most nobles valued their heirs above their spouses. Grid was no exception, so Kasim had adjusted his protection detail accordingly.\n\n*Once he grows up, he'll be drowning in women.*\n\nFor ten days now, Kasim had observed Lord. Never had he seen a newborn so beautiful and sharp. They shared no blood, yet watching the child brought him an unfamiliar contentment.\n\n*If it wasn't for the empire...*\n\nHe could have married a Nero woman. Had a child of his own. Lived a normal life.\n\nHis jaw clenched, teeth grinding.\n\nThe desire for revenge against the Saharan Empire flared hot in his chest. Then, without warning, Lord's eyes snapped open. The newborn baby detected him when the nanny and armed knights outside could not.\n\nKasim's breath caught.\n\n*His senses exceed ordinary people by miles.*\n\n\"Abu! Abu!\"\n\nLord stretched tiny arms toward him. A clear smile brightened his eyes. The infant was looking directly at Kasim.\n\n*Does he know I'm guarding him?*\n\nThis baby was the genuine article. Kasim, the continent's strongest living assassin, felt greed stir in his heart as he gazed at the transcendent genius before him.\n\n\"Little one.\" Kasim crouched beside the crib. \"Want to play with me every night from now on?\"\n\n\"Abu! Abu!\"\n\nThe baby's eyes shone like lanterns. It seemed like an affirmative answer. Kasim smiled, satisfaction warming his features. He retrieved a block and positioned it beside Lord.\n\n\"Throw this.\" He demonstrated, hurling a block across the room. It struck one of the dolls perched on the window frame.\n\n*Tok!*\n\nThe doll toppled. Lord laughed. But when the baby tried to replicate the throw, his arm strength fell short. The block clattered to the floor halfway to the window.\n\n\"Bubu! Bu!\"\n\nLord waved his arms in frustration. His pride appeared wounded that he couldn't match Kasim's feat. Kasim stared.\n\n*A newborn understands my words and is already competitive...!*\n\nMore than that:\n\n*His strength already surpasses most boys!*\n\nThe block Lord threw was light. Reaching the window required the arm strength of a fourteen-year-old. Yet Lord was merely days old. Kasim's enthusiasm ignited. This child's innate senses, this raw power!\n\n*I might be able to pass on the complete secret techniques Master left behind!*\n\nDoran and Kasim had lacked the necessary talent. They'd only mastered half their master's teachings.\n\n*But this child...!*\n\nLord Steim.\n\nIt was the day he met the first of his seven mentors.\n\n***\n\n\"Oh my!\"\n\nThe nanny jolted awake as if struck by lightning. The formerly tidy room now lay in chaos, blocks scattered across the floor.\n\n*Did the young Lord do this?*\n\nA newborn climbing from bed to play with toys? Impossible. The nanny knew this. Yet if someone had entered the room, the knights stationed outside would have raised the alarm and woken her. She was forced to suspect Lord.\n\nBut Lord slept peacefully, his form unchanged from when she'd last checked on him.\n\n*If Lord is asleep, then what happened?*\n\nGoosebumps prickled her skin. A ghost, perhaps. Meanwhile, Kasim clung to his position on the ceiling, equally shocked.\n\n*A newborn baby can fake sleep!*\n\nIncredible.\n\n***\n\nThe desert had transformed into farmland.\n\nSoldiers gaped as the scorching sand gave way to a golden wheat field.\n\n\"What... what is this?\"\n\n\"Am I dreaming?\"\n\nThe two thousand soldiers stood frozen, confusion rippling through their ranks.\n\n*What is this sudden scene?*\n\nBunny Bunny's face reddened with rage.\n\n\"What's the point of making a field? It's useless!\"\n\nHurent charged at Royman.\n\n\"Uh!\"\n\n*Clang!*\n\nRoyman barely deflected Hurent's strike. Blue light streaked toward her waist. Aura Impact, the technique that spawned a second blade to exploit defensive gaps.\n\n*This is the end!*\n\nRoyman braced for death. She squeezed her eyes shut as the aura blade closed the distance.\n\n\"There's only one life.\" A shadow fell over her. \"Fight to the end. Don't surrender so easily.\"\n\nPiaro stood between her and the attack, somehow abandoning his work in the wheat field to intercept.\n\n\"Sir Piaro...!\"\n\nRoyman stared at him, her life saved twice now. Longing filled her chest. But she couldn't hold his gaze for long. Embarrassment heated her cheeks and she ducked her head.\n\nA brief pause.\n\n\"I'm adding two hours of planting to your schedule.\"\n\n\"Heok.\"\n\nPiaro showed no mercy. He'd reduced Royman's sleep to three and a half hours. Then he turned to face Hurent, who smiled despite his blocked attack, relaxed and confident.\n\n\"I heard a crazy farmer guards Reidan.\" Hurent rolled his shoulders. \"I didn't expect it to be literal.\"\n\n\"You seem quite amused for someone who claims embarrassment.\"\n\n\"Of course I'm amused. If I defeat the farmer who stopped seven guilds from reaching Reidan, my reputation skyrockets.\"\n\n\"Don't speak of impossible things.\"\n\n\"We'll see about that. I know the long and short of it.\"\n\n\"You believe those two thousand soldiers give you an advantage.\"\n\n\"No.\" Hurent raised a hand. \"I only believe in myself.\"\n\n*Snap.*\n\nHurent's fingers cracked together. A signal for the soldiers to attack? Piaro tensed, but the soldiers didn't advance.\n\n*What?*\n\n\"Uh!\"\n\nRoyman gasped. Pain flared in her side, the spot where Hurent's aura blade had grazed her earlier.\n\n\"My aura left a mark.\"\n\n\"A mark?\"\n\n\"Yes. A mark where aura can manifest remotely.\" Hurent's smile widened. \"Imagine it. If I release aura from your lover's side, what happens to her? She's so fragile she'll break in half.\"\n\n\"...!\"\n\nPiaro's eyes widened. His expression darkened.\n\nHurent's satisfaction grew.\n\n\"Now, make your choice.\" His voice carried across the wheat field. \"Allow my army to advance, or I break your precious lover apart in front of you!\"\n\nConfidence radiated from Hurent's posture as he shouted.\n\n\"Can that mark be carved into the ground?\"\n\n\"Eh?\"\n\nWhat? The question held no tension, no fear. Hurent blinked in confusion, then nodded slowly.\n\n\"That's... correct. It's a technique with high versatility.\"\n\n\"Hoh.\"\n\nA smile crept across Piaro's face. Wicked. Dangerous.\n\n\"Won't this be useful for tilling the fields?\"\n\n\"What?\"\n\nTilling the fields? What nonsense was this? Hurent couldn't parse the words. He frowned. Piaro mirrored his earlier confidence.\n\n\"I'll give *you* a choice.\" Piaro's grip tightened on the hand plow. \"Work in the fields with me, or work in the fields after losing all two thousand soldiers.\"\n\n*Is he insane?*\n\nHurent held the advantage right now. This was like arguing with a wall. Then it clicked.\n\n*He's called a crazy farmer for a reason!*\n\nThis farmer truly lacked sanity. Hurent decided to demonstrate the reality of the situation. He triggered the skill.\n\n\"Kyaaak!\"\n\nRoyman collapsed, unable to bear the pain erupting from her waist. Blood already soaked her side. Piaro witnessed it and shouted.\n\n\"You've chosen, then!\"\n\n\"...Eh?\"\n\n\"Free Farming 8th Style. Polishing!\"\n\nThe reason Piaro had ignored Hurent to create the wheat field became clear. His enemy wasn't just Hurent. Piaro had been thinking about the bigger picture.\n\n*Boom! Boom-boom-boom!*\n\nAcross the wheat field, explosions erupted where the two thousand soldiers and Hurent stood. Each stalk of wheat detonated, transforming into a lethal bomb that devastated the entire area.\n\n\"What?\"\n\nHurent gaped as soldiers screamed and died around him. A ranged skill targeting two thousand people at once? This rivaled Meteor, a spell only legendary great magicians could cast.\n\n\"Don't tell me... a legendary...!\"\n\nPiaro closed the distance to the stunned Hurent. He swung his hand plow.\n\n*Thunk!*\n\n> **[You have suffered 15,500 damage.]**\n\n*Thunk!*\n\n> **[You have suffered 15,900 damage.]**\n\n*Thunk!*\n\n> **[You have suffered 16,100 damage.]**\n\n> **[You have suffered catastrophic damage in a short period! You are in critical condition!]**\n\n*This is insane!*\n\nWhat was this? The hand plow struck Hurent's forehead three times in rapid succession. He crumpled to his knees.\n\nBehind Piaro lay a mountain of corpses and a river of blood."
}