{
  "id": 338,
  "title": "Chapter 338",
  "content": "# Chapter 338\n\nLaden's lungs burned. Each breath scraped through his throat like sand. His legs trembled beneath him, threatening to buckle. He'd pushed past exhaustion an hour ago. Now he ran on pure desperation.\n\n*Just a little longer. Hold them until the marquis receives word.*\n\nThat singular thought kept him upright. Kept his sword raised.\n\nThen the horizon shifted. Dust clouds rose in the distance, and through the shimmer of desert heat, he saw them. Thousands. Five thousand soldiers marching under the royal banner.\n\nThe strength drained from Laden's limbs.\n\nChucksley's blade crashed against his guard. The impact drove Laden to his knees. Sand bit into his skin as Chucksley's boot pressed down on his shoulder.\n\n\"Bow to the prince!\"\n\n\"K-kuack...\"\n\nLaden's neck strained. He refused. He would not lower his head to his lord's enemy. Royal blood meant nothing. Future king meant nothing.\n\nChucksley seized a fistful of Laden's hair and wrenched his head down. Pain lanced through Laden's scalp. His vision filled with sand and boots.\n\nChucksley straightened, satisfied. He turned and bowed with theatrical precision. \"I greet the prince!\"\n\nPrince Ren dismounted with practiced grace. \"You suffered on the way here.\"\n\nHis gaze shifted to Laden. Cold appraisal flickered across the prince's features.\n\n\"You defeated Beida?\" Ren circled the kneeling knight slowly. \"Impressive, for your age. I'd heard Phoenix was the northern powerhouse, but perhaps that's ancient history.\"\n\nLaden said nothing. He kept his jaw locked, his eyes on the sand.\n\nChucksley's hand moved to his sword hilt. \"You should appreciate the prince's generosity!\"\n\n\"Shut your mouth.\" Laden spat blood into the sand. \"It isn't an honor.\"\n\nThe royal retainers surged forward. Chucksley's blade whispered from its sheath.\n\n\"Calm down.\"\n\nRen's voice cut through the tension. He surveyed the northern army. A thousand men, exhausted and bloodied. Fear etched into every face. They understood their position. Rebellion against the crown. Treason.\n\nDeath.\n\nThe prince's expression shifted. Warmth replaced calculation. A benevolent smile.\n\n\"You are people of the Eternal Kingdom. It is right to follow me, the rightful successor.\" He spread his hands in a gesture of clemency. \"Repent. Surrender. I will forgive your transgression.\"\n\nMurmurs rippled through the northern ranks. Men exchanged glances. The offer hung in the air like a lifeline. They were terrified. They wanted to live.\n\nLaden saw their resolve crumbling.\n\n\"The king abandoned us!\" His voice cracked, raw with desperation. \"The king gave up on the north! It was Marquis Steim who protected us. Marquis Steim who led us through the dark. We owe him everything. Our lives. Our loyalty.\"\n\nHe forced himself upright despite Chucksley's restraining hand.\n\n\"I will never surrender to you!\"\n\nThe northern soldiers straightened. Shame and pride warred across their faces. Hands tightened around weapon grips. They remembered. The endless winters. The monster raids. The barbarian invasions. They remembered who stood with them when the capital looked away.\n\nSteel rasped as blades left scabbards.\n\nRen's benevolent mask shattered. His lip curled.\n\n\"Everybody is so eager to die.\" Disgust dripped from his words. He turned to Chucksley. \"Kill those useless dogs.\"\n\n\"Yes!\"\n\nChucksley raised his sword. Sunlight gleamed along the edge.\n\nLaden didn't flinch. He met the blade with open eyes. Regret held no place in his heart. Better death than betrayal.\n\n*Duke Grid. Please. Protect my lord.*\n\nThe kingdom's hero would overcome this. Laden believed it. He closed his eyes.\n\n**Jeeong!**\n\nGolden light exploded across his vision. Heat washed over him. Metal shrieked against metal.\n\nLaden's eyes snapped open.\n\nA golden hand. Disembodied. Autonomous. It hovered before him, a greatsword clutched in its metallic fingers. The blade intercepted Chucksley's strike, deflecting it with contemptuous ease.\n\n\"What...?\" Chucksley stumbled back, eyes wide.\n\nThe golden hand whirled. Fluid. Precise. Impossibly fast. It drove Chucksley back three steps.\n\n\"What type of person?\" Chucksley's shout echoed across the battlefield.\n\nA voice answered from above. Calm. Unhurried. Almost bored.\n\n\"The duke.\"\n\nEvery head tilted skyward.\n\nA figure descended through the heat shimmer. Black hair. Red armor that caught the light like fresh blood. **Grid's Boots** carried him down with impossible slowness, defying gravity. A small crown rested on his head. The man surveyed the battlefield with the detached interest of a predator evaluating prey.\n\n\"Beggars move around in groups.\" Grid's voice carried across the sand. \"Foolish.\"\n\nHe wore arrogance like armor.\n\nThe royal army recoiled. Five thousand soldiers flinched from one man. The northern troops erupted in desperate hope.\n\n\"Grid!\"\n\n\"Duke Grid!\"\n\nThe atmosphere inverted. Terror became hope. Confidence became doubt.\n\n***\n\nBunny Bunny's legs screamed. The **Fast Boots** granted him triple movement speed, but the cost ravaged his stamina. Each step felt like the last. His endurance bar flickered red.\n\n*Almost there.*\n\nHe crested a dune. The battlefield sprawled below. Prince Ren's army. The surrounded northerners.\n\nRelief flooded through him. He toggled camera mode.\n\n**Peeng!**\n\nSomething massive shot overhead. The air displaced by its passage whipped sand across Bunny Bunny's face. He blinked, confused. A bird? This far from water?\n\nHe zoomed in.\n\nGrid.\n\nFlying.\n\n\"Of course.\" Bunny Bunny laughed despite his exhaustion.\n\nGrid had done this before. The National Competition. The Reinhardt siege. Always arriving at the perfect moment. Always when hope seemed lost. A hero's timing.\n\n*Why did I waste so much time hating this guy?*\n\nBunny Bunny had been an anti-fan. Like so many others, he'd dismissed Grid as \"overgeared.\" Too reliant on items. Not skilled enough to deserve his fame.\n\n*But items are part of the game.* Bunny Bunny glanced at his own boots. They'd carried him here. Without them, he'd have arrived hours too late. *Items matter. Power is power.*\n\nHis prejudice fell away like dead skin.\n\n\"Grid.\" Bunny Bunny positioned his camera. \"Show me what a hero looks like.\"\n\nThis footage would echo across the world.\n\n***\n\nThe **Great Lord's Sword** pulsed in Grid's grip. Information flooded his vision.\n\n> [Character Observation activated. Multiple targets detected.]\n\nNames. Levels. The battlefield laid bare.\n\n**[Chucksley Rokan]**  \nLevel: 313\n\n**[Ferrell Shaiva du Bon]**  \nLevel: 305\n\n**[Andu]**  \nLevel: 301\n\nThe royal knights. Then the common soldiers. Grid's **Insight** stat pushed the skill beyond its normal limitations, though the flood of data remained surface-level. No skills. No detailed stats. Just names and power.\n\n**[Laden]**  \nLevel: 258\n\nThe northern knights appeared in his awareness. Soldiers from both sides. Hundreds of data points.\n\n*Average level 130.* Grid processed the information. *Higher than expected.*\n\nThe royal army outleveled Winston's garrison by a significant margin. These weren't conscripts. Elite troops.\n\n*But Reidan's soldiers average 148.*\n\nGrid's smile turned predatory.\n\n*And after today? They'll hit 160.*\n\nHe dismissed the blade. **Braham's Boots** vanished from his feet, replaced instantly by **Grid's Boots**. The weight difference hit him like a hammer.\n\n> [The magic Fly is no longer available. Fly is stopped.]  \n> [You will fall.]\n\n**Kwaang!**\n\nGrid plummeted. Black iron boots struck sand. The impact crater spread outward, scattering soldiers like leaves. Grid straightened in a cloud of dust.\n\n\"D-Duke Grid!\"\n\nLaden stared, horror-struck. \"Why would you...?\"\n\n*He had the advantage in the air. Why descend into the enemy?*\n\nGrid fixed Laden with a contemptuous look. \"You are really weak.\"\n\n\"What?\"\n\n\"I've known since we first met. You're a braggart who can't fight properly.\"\n\nLaden's face went white.\n\nGrid ticked off points on his fingers. \"First meeting. You claimed there was a rat in Irene's bedroom. I searched. Nothing. Not even a fly.\"\n\n*That was... I was certain...*\n\n\"Second. Your level. The royal knights are over 300. You're 258. While everyone else hunted, you played.\"\n\nLaden's mouth worked soundlessly.\n\n\"Third. Results.\" Grid gestured at the battlefield. \"Royal forces? Fine. Northern army? Dying. The numbers don't lie. You're powerless.\"\n\nThe words cut deeper than any blade. Laden's chest constricted.\n\n*He's right. I'm useless. Lord Steim trusted me, and I...*\n\nShame consumed him.\n\nThe royal army exchanged bewildered glances.\n\n'He defeated Beida.'\n\n'He endured Chucksley's assault.'\n\n'And Grid calls him weak?'\n\nGrid's standards existed on a different scale entirely. The hero who'd crushed the golem invasion. Who'd slaughtered the Slaughterer. Who'd killed a Pope.\n\nFive thousand soldiers stepped back unconsciously.\n\nChucksley leveled his sword at Grid's throat. \"Plunging into enemy territory alone. You don't understand the situation.\"\n\nHis voice remained steady. A Great Swordsman. One of the continent's finest. He would not bow before reputation.\n\n\"During Reinhardt, I lacked the opportunity. I could only watch from afar.\"\n\nThe blade rose. \"But I've grown stronger since then.\"\n\nChucksley struck. The technique was flawless. Economy of motion. Perfect form. Unavoidable trajectory.\n\nBunny Bunny's breath caught in his throat.\n\n*Too fast. Grid can't...*\n\n**Jeeong!**\n\nA crimson blade materialized from darkness. **Iyarugt** met Chucksley's strike before Grid's body even twitched. The blood-red sword moved with serpent speed, deflecting the attack with casual precision.\n\nChucksley's eyes widened.\n\nGrid scoffed. \"Are you a fool? You think I was idle while you trained?\" His voice dripped mockery. \"I grew stronger too. You'll never catch up.\"\n\n\"Never... catch up?\" Chucksley hesitated, thrown by the unfamiliar slang.\n\nGrid didn't explain. **Iyarugt** became a crimson blur.\n\nOne hundred percent understanding. Complete mastery. The demon sword would paint this desert red.\n\n---\n\n**Glossary of Common Korean Terms:**  \nOG: Glossary Link\n\n**Current schedule:** 20 chapters a week\n\n*Check out my Patreon for early access to unedited chapters and goals for extra chapters. Early access content updates after daily chapter releases.*"
}