{
  "id": 339,
  "title": "Chapter 339",
  "content": "# Chapter 339\n\nDuring the pope candidates incident, Grid had gained something invaluable. He'd spent days dismantling and reconstructing <span class=\"rarity-mythic\">Lifael's Spear</span>, a myth-rated weapon, until his understanding reached 100%. The knowledge embedded itself in his bones. No amount of gold could buy what he'd learned by working with that divine artifact.\n\nNow, with <span class=\"rarity-unique\">Iyarugt</span> still sitting at Unique rating, raising his understanding came easy. Child's play compared to wrestling with Lifael's secrets.\n\nGrid smirked. \"Cry, Yakult.\"\n\n> [Iyarugt is the best sword of hell! You, don't replace my noble name just because you find it hard to pronounce!]\n\nThe sword's ego flared with indignation. It followed Grid's commands, sure, but the demon blade drew the line at being called some cheap probiotic drink. Grid didn't care. The sword would obey regardless of what he called it.\n\n> [Iyarugt has used **Blood Cry**.]\n> \n> [All targets within a 30m radius will lose their sense of balance for 1.5 seconds.]\n\n*Kiiing...*\n\nThe high-pitched wail tore through the air. Soldiers dropped like puppets with cut strings. Northern troops, royal army, Prince Ren, his escort knights. Blood Cry made no distinction between ally and enemy.\n\n\"Ugh!\" A knight crumpled, hands pressed to his ears.\n\nPrince Ren's knees buckled. His palms hit the sand. *This can't be happening.* He was the First Prince of the Eternal Kingdom. He'd never bowed to anyone except his father. Yet here he knelt, forced down by a skill.\n\nHis pride shattered like glass.\n\nThen he looked up. Comprehension dawned as he scanned the battlefield. Every knight, every soldier on both sides, they all knelt in the sand. Even Chucksley swayed, barely keeping his feet.\n\nOnly one man stood upright.\n\nGrid.\n\n*So this is the strength of a legend.* The realization hit Prince Ren like cold water. Fear coiled in his gut. If possible, he'd never cross paths with this man again. But that wasn't an option. Grid was an obstacle he had to overcome to claim the throne.\n\nWhile Prince Ren shivered in the sand, Grid frowned.\n\n\"What? You endured it?\"\n\nBlood Cry burned through mana like wildfire and had a brutal cooldown. The friendly fire made it dangerous to use in formation. But there stood Chucksley, shaking it off like he was a raid boss with status immunity.\n\nChucksley's jaw clenched. \"I won't fall from something like this!\"\n\nThe Royal Knight Commander surged forward. His mental fortitude was ironclad. He'd weathered Blood Cry through sheer willpower, and now his sword came in fast.\n\nThe trajectory was simple. Direct. Thanks to Iyarugt's guidance, Grid deflected it.\n\n*Chaaeng!*\n\nSteel met demonic blade. The impact kicked up a cloud of dust that swallowed them both. Grid locked eyes with his opponent through the haze. Chucksley looked calm, composed. Grid did not.\n\n*What is this guy?*\n\nHigh status resistance. Strange swordsmanship. It looked basic, textbook even, but the execution was flawless. Each strike carried weight that belied its simplicity.\n\n*This is a first.*\n\nGrid had trained with geniuses. Even Jude counted as a genius in his own bizarre way. Then there were the sword prodigies—Piaro, Ibellin. They all shared one trait: unpredictability. Unconventional techniques that threw opponents off balance.\n\nChucksley was the opposite. No wasted movement. No openings. Just fundamentals executed to perfection, eliminating variables.\n\nThis style was Grid's nightmare. All his tricks bounced off that textbook defense.\n\n*Chaaeng! Chaeng!*\n\n*Shit.*\n\nThe longer they crossed blades, the clearer it became. Grid had the speed advantage, but Chucksley never gave him room to use it.\n\n*I need to see his stats.*\n\nHe wanted to swap to the <span class=\"rarity-rare\">Great Lord's Sword</span> and pull up Chucksley's information. The man had to be a named NPC. But switching weapons now would leave him wide open.\n\n*Jjeejeeeong!*\n\nThat honest, brutally efficient blade pressed him back. Grid's offense stalled. He could only defend.\n\n\"That's it! You're doing well, Sir Chucksley!\" Prince Ren scrambled to his feet. Confidence flooded back as he watched the Royal Knight Commander dominate.\n\n\"Grid! This is the result of your pride and self-righteousness!\" The prince's voice cracked with excitement. *How stupid. Confronting 5,000 soldiers alone.*\n\nThe royal army owed Grid their thanks for his stupidity. Victory was certain now.\n\n\"Kill him! Kill Grid and march straight to Reidan!\"\n\nPrince Ren's war cry rang out. Three hundred meters away, Bunny Bunny cursed under his breath.\n\n*Dammit!*\n\nHis broadcast was falling apart. Hurent was supposed to be the protagonist, but that farmer had demolished him in seconds. Fine. He'd pivoted to Grid as the main character instead, but now...\n\n*Grid is losing to Chucksley!*\n\nThis wasn't the narrative he wanted. His viewers wanted to see Grid crush his enemies, not get overwhelmed by some NPC knight. Bunny Bunny stewed in frustration when a voice spoke next to his ear.\n\n\"The majority of the northern army seems to have survived. We made good time.\"\n\nBunny Bunny froze. He was a second advancement assassin. For someone to approach without him noticing, they had to be a top ranker.\n\nHe spun around. \"You...!\"\n\nSilver hair caught the desert sun. Lauel, master of beauty and tactical genius. One of the 10 Rookies who'd represented the US at the National Competition. Now one of Grid's closest advisors.\n\nCelebrity recognition warred with professional curiosity on Bunny Bunny's face. Lauel smiled.\n\n\"Interesting. I've only seen Bunny Bunny on broadcasts before.\" His eyes flicked to the camera. \"Are you live?\"\n\n\"N-No. I need to solve image rights issues first. This is just a recording.\" The older man stammered despite being seven years Lauel's senior. Age didn't matter. Power and wealth did.\n\n\"Good. You're not stupid, then.\" Lauel's smile didn't quite reach his eyes. \"Contact me before you start the broadcast. We need to discuss revenue distribution.\"\n\n\"Yes. I'll keep that in mind.\"\n\n\"Earl Lauel, the soldiers are ready.\" A blond man materialized behind the tactician.\n\nAsmophel. One thousand soldiers stood at attention behind him, discipline sharp enough to cut. Killing intent radiated from every warrior, yet they held formation with machine precision. Compared to them, the royal army looked like children playing war.\n\n*What the hell?*\n\nBunny Bunny's jaw went slack. He'd never imagined Grid could forge an army to this standard.\n\n*Grid is even great at building military forces!*\n\nThe more he discovered, the more Grid impressed him. But then why was the man fighting alone, on the verge of death in enemy territory? Bunny Bunny's gaze snapped back to the battlefield.\n\nGrid still dueled Chucksley. Neither showed wounds. Chucksley's superior technique met Grid's compensating speed. A stalemate.\n\nThe problem loomed behind Chucksley. Five thousand soldiers.\n\n*The moment they move...*\n\nThe balance would shatter. Grid would die. Sweat beaded on Bunny Bunny's forehead. \"Lauel, shouldn't you help Grid?\"\n\nLauel watched the dust-shrouded duel with relaxed interest. \"You don't understand Grid's capabilities.\"\n\n*What?*\n\n\"Grid's strength was never swordsmanship.\" Lauel spoke like he was discussing the weather. \"I don't know why he's playing around with sword techniques against that person, but I'm not worried. Knight Chucksley might be strong, but he doesn't compare to the enemies Grid has faced before.\" He glanced at his companion. \"Isn't that right, Sir Asmophel?\"\n\n\"The opponent's skill is still insufficient.\" Asmophel's tone carried absolute certainty.\n\n*Playing around? A great swordsman is lacking?*\n\nBunny Bunny thought they'd lost their minds. Then a scream split the air.\n\n\"Kuaaaack!\"\n\nThe broadcast veteran zoomed his camera in. His hands shook.\n\n\"This is impossible!\"\n\nChucksley, who'd dominated the entire fight, now had blood streaming from his chest.\n\n\"Now.\" Lauel's voice cut through the moment.\n\nAsmophel barked an order. \"Aim your bows!\"\n\nReidan's soldiers moved like water. They planted their feet in the sand, drew bows from their backs, nocked arrows, and pulled the strings taut. The entire sequence took three seconds.\n\n*What are they thinking?*\n\nThe distance had to be 300 meters. Too far. Even a lucky hit would arrive without enough force to matter.\n\nBut Bunny Bunny didn't know about the equipment. Khan's craftsmanship made these bows sing. Power and accuracy far beyond standard issue. And then Lauel added his own touch.\n\n\"Wind Dragon's Roar.\"\n\n*Kuoooooh!*\n\nWind howled across the desert from the west. A manufactured gale.\n\n\"Fire!\"\n\n*Papat! Pa pa pa pat!*\n\nOne thousand arrows launched as one. They rode the wind current, gaining speed. On the battlefield, Prince Ren's royal army watched Grid's duel, oblivious to the death raining down.\n\nArrows found flesh. Screams erupted. Bodies fell.\n\n\"Wow...\" Bunny Bunny's voice came out strangled.\n\nHe'd never seen anything like it. One thousand soldiers, simultaneously wreathed in the golden pillar of light that marked a level increase.\n\n---\n\n**Glossary of Common Korean Terms**\n\n**OG**: Glossary Link\n\n**Current Schedule**: 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day."
}