{
  "id": 340,
  "title": "Chapter 340",
  "content": "# Chapter 340\n\nTraining. Every damn day, training. Reidan's soldiers had long since stopped questioning why—now they simply endured. The hellish regimen ground them down, day after day, with no end in sight.\n\n*I know we need to be strong,* one soldier thought as he collapsed onto his cot. *To protect our homes. Our families. But this...*\n\n\"The baker used to serve in another garrison,\" someone muttered in the barracks. \"He says no army on the continent trains like this.\"\n\nA veteran infantryman spat. \"The rear guard is ready to mutiny. We're already beyond normal soldier standards.\"\n\n\"Beyond? We're doing special forces drills.\" Another voice, bitter with exhaustion. \"Scaling walls without ladders. What kind of madness is that?\"\n\n\"I'd take the walls over the giant worm training.\" A visible shudder. \"Climbing through sand pouring down like a waterfall—like a damn hamster on a wheel. Then those *things* appear...\"\n\n\"Why are we training archers to shoot birds? We're infantry.\"\n\n\"And the field work.\" Disgust dripped from the words. \"That's not training. That's exploitation.\"\n\n\"What is the Duke thinking?\"\n\nThey loved Grid. That wasn't an exaggeration. Duke Grid had saved them from starvation in a dying city. They would have laid down their lives for him without hesitation.\n\n*Would have.*\n\nAs the weeks of brutal training mounted, gratitude curdled into resentment. A natural phenomenon. The regimen Reidan's soldiers endured rivaled that of the Empire's Black Knights—the second strongest division on the continent. For ordinary soldiers, the mental and physical toll was staggering.\n\nYet they endured.\n\nBecause Piaro and Asmophel drove them forward. Two men who should have been pillars of an empire now forged them into something greater.\n\n---\n\n\"Prepare!\"\n\nA westerly wind swept across the desert. One thousand soldiers pulled back their bowstrings in perfect unison. Poisonous eyes, hardened by hell, locked onto distant targets.\n\nGrid fought alone on the dunes ahead.\n\n\"Loose!\"\n\n*Pak! Pa-pa-pa-pak!*\n\nA thousand arrows flew. Perfect form. Perfect release. The westerly wind carried them like a swarm of hornets.\n\n*Puk! Puuoooook!*\n\n\"Kyaak!\"\n\n\"Hik!\"\n\nKhan had reached **Advanced Blacksmithing Level 8**. As Albatino's descendant—Grid's friend and disciple—the bows and arrows he crafted transcended ordinary weapons.\n\nThe volley covered three hundred meters and shredded the royal army.\n\n\"Again!\"\n\nGolden pillars of light erupted around the soldiers as experience flooded in. Their **Strength**, **Stamina**, and **Agility** surged as they nocked new arrows.\n\nGrid's distant form filled their sights.\n\n*Duke Grid!*\n\n*This is why he pushed us so hard!*\n\n*He saw this coming!*\n\n*My Lord's foresight... I was a fool to doubt!*\n\nIn that moment, the soldiers of Reidan understood. Their resentment evaporated like morning dew. Loyalty burned in their chests.\n\n*He faces them alone to protect us!*\n\n*Truly great!*\n\n*I will serve him with my life!*\n\nThis was their first real battle since Jude's training began. High concentration sharpened their every movement.\n\n\"Loose!\"\n\n*Pak! Pa-pa-pa-pak!*\n\nAsmophel's command rang out. Another wave of death.\n\n*Puk! Puuoooook!*\n\n\"Ugh!\"\n\n\"Kuheok!\"\n\nThe soldiers grew stronger with each kill, levels rising in real time. Hundreds of royal troops fell, unable to withstand the onslaught.\n\n\"What... what *is* this?\"\n\nPrince Ren's composure shattered. His five thousand soldiers had focused entirely on Grid—and left themselves exposed. The shock hit him like a physical blow. One man held absolute power on this battlefield, and desperation clawed at Ren's throat.\n\n---\n\nFerrell, Chief Archer of the Eternal Kingdom, stared in disbelief.\n\n*No way. They can't all be archers.*\n\nA thousand soldiers. Accurate volleys at three hundred meters. That wasn't normal. Even talented recruits needed a decade of training to achieve such precision.\n\nYet here they were.\n\n*I thought Reidan was dying.*\n\nTwenty thousand residents. Grid had ruled for only sixteen months. Elite archers in sixteen months? Impossible. Ferrell had trained archers personally—he knew the timeline.\n\n*Wait.*\n\nAnother thought struck him.\n\n*What if they're all knights?*\n\nKnights learned archery as part of their training. Knight-level talent could achieve this in sixteen months.\n\n*That means...*\n\nHis breath caught.\n\n*Reidan is a gold mine of talent!*\n\nBut that made them a threat.\n\nFerrell drew his bow. The Thunder Bow—a family heirloom passed down through generations.\n\n\"I'll nip this in the bud.\"\n\n*Pachik! Pachichik!*\n\nThunder crackled along the string. He released. The arrow transformed into a lightning bolt.\n\n*Peeng!*\n\n*Pepepepeng!*\n\nThunder screamed across the sky. Multiple bolts chained together. Reidan's soldiers froze.\n\n\"What—?\"\n\n\"Incoming!\"\n\nThey'd endured hellish training. Faced death a hundred times in drills. But nothing had prepared them for this. Faces went pale as the lightning arrow descended.\n\nThen Asmophel appeared before them.\n\nHis red cloak snapped in the wind. He drew the longsword from his Red Knight days and moved his blade. The motion was like ink flowing across paper—calligraphy written in steel.\n\n*Pepepepeong!*\n\nThe thunder shattered against his sword.\n\n\"What?\"\n\nFerrell's hawk-sharp vision caught every detail. His arrow—destroyed by a blade. He'd never seen such a thing.\n\n*Even Captain Chucksley can't intercept my arrows head-on!*\n\nShock held him frozen for a heartbeat.\n\nThen his pride flared. \"Try this one!\"\n\nAn archer who couldn't hit was worthless. Ferrell was the kingdom's best. This arrow was several times faster, several times stronger.\n\n*Kwa-kwang!*\n\nThunder roared. The bolt streaked toward Asmophel's face.\n\nAsmophel's lips curved into a smile. His first real chance to prove his worth to Duke Grid. Until now, he'd only collected taxes and drilled soldiers.\n\nRed aura flared around his blade. He swatted the arrow aside and leaped from the sand dune.\n\n\"The enemy commander's head is mine!\"\n\n*Taack!*\n\nThen—\n\n\"That bow. I want it.\"\n\nGrid appeared in front of Ferrell first. His eyes gleamed with naked greed.\n\nBehind him, Asmophel nearly wept. \"My Lord! Please! Let me do *something*!\"\n\nHis plea drowned beneath the screams of thousands of panicked soldiers.\n\n*Puok!*\n\n\"Kuk...!\"\n\nFerrell's focus had been entirely on Asmophel. He'd assumed Grid was occupied with Chucksley. The surprise attack punched through his guard, and Grid didn't stop.\n\n> [Critical Hit!]\n> \n> [**Iyarugt's** option effect activated. Target's healing reduced by 50%.]\n> \n> [Critical Hit!]\n> \n> [**Iyarugt's** option effect activated. Target is **Bleeding** for 3 seconds.]\n> \n> [**3rd Combo achieved!**]\n> \n> [**Bleeding** effect maximized. Target receives 200% increased damage for 1 second.]\n\n*Now!*\n\nGrid's eyes shone. A named NPC with substantial health—perfect.\n\n\"**Pagma's Swordsmanship, Pinnacle.**\"\n\n*Seokeok!*\n\nThe technique descended. Blood fountained from Ferrell's chest, painting Grid's vision red. He raised his sword.\n\n> [**5th Combo achieved!**]\n> \n> [Target's reasoning destroyed for 0.3 seconds! **Hell Sword** available.]\n\nFerrell reeled, mind blank from the relentless assault.\n\n\"**Hell Sword.**\"\n\n*Kwajik!*\n\n*Pajijijijijik—!*\n\nDozens of crimson-black tendrils erupted from <span class=\"rarity-unique\">Iyarugt</span> and impaled Ferrell's chest.\n\nThe sight—\n\n\"Yes! Gorgeous! Perfect shot!\" Bunny Bunny's camera swept from sky to ground, capturing every angle. Grid dominating the battlefield. This footage would set the internet on fire.\n\nMeanwhile—\n\n\"Ferrell!\"\n\nChucksley had fallen for Grid's feint—a skill activation mid-clash. Rage flooded him as he saw Ferrell fall to a blindside attack.\n\n\"**Rising Sword!**\"\n\nAn irregular technique, appearing to surge from the earth itself. Chucksley was certain it would land.\n\nHe was wrong.\n\nGrid had been unable to finish Chucksley earlier because of the knight's textbook swordsmanship—no openings. But now Chucksley committed to a flashy technique, abandoning his defensive foundation.\n\n\"**Pagma's Swordsmanship, Kill.**\"\n\n*Peeeeeong!*\n\nBoth strikes connected. Grid took a hit to the chest. Chucksley's waist opened up. Grid's wound was worse—a potentially lethal area.\n\nChucksley surged forward.\n\n\"Ohhhh!\" Prince Ren and the royal troops roared.\n\n\"My Lord!\" Reidan's soldiers cried out in despair.\n\nEven Bunny Bunny's face darkened behind his camera.\n\nOnly one person smiled. Lauel looked at Grid and grinned.\n\n\"Gotcha.\"\n\nGrid's hand clamped around Chucksley's throat.\n\nLauel shrugged. \"My Lord's strength was never swordsmanship.\"\n\nThey both knew the truth. Grid wasn't a swordsman.\n\n\"It's being Overgeared.\"\n\nA critical wound? His legendary armor minimized the damage. Can't hit the enemy? Superior weapons maximize every blow.\n\n*Clink!*\n\n*Clink-clink.*\n\nFour golden hands materialized around the gasping Chucksley. Then white light flashed, stunning the entire battlefield.\n\n---\n\n**Glossary of Common Korean Terms**\n\n**OG:** [Glossary Link]\n\n**Current schedule:** 20 chapters a week.\n\n**Patreon:** Check out my Patreon for early access to unedited chapters and help achieve goals for extra releases!"
}