{
  "id": 343,
  "title": "Chapter 343",
  "content": "# Chapter 343\n\nThe power of a legend was truly great.\n\nDuke Grid had saved a thousand northern troops and pinned down five thousand royal soldiers. His strength was undeniable. Prince Ren watched the battlefield with something close to awe. Grid swept through the royal army with four golden hands orbiting him, and for a moment, Ren saw the incarnation of war itself.\n\nBut awe wasn't respect.\n\n*The important thing in war isn't just power. It's resources. Strategy.*\n\nWar wasn't confined to the battlefield. Those who saw the larger pattern, who understood how tactics spread like a web across the map, those were the ones who won. And in that sense, Grid was the worst kind of commander. A ruler charging alone into enemy lines? Ren's lips curled.\n\n*Fool.*\n\n*Grid, you'll regret this. You've walked straight into my trap.*\n\nAt any moment, a second force would strike Reidan from the rear. The Silver Dragons would capture the duke's wife. Then the initiative would belong entirely to Prince Ren. Grid would be isolated. Alone. The victory would unfold exactly as Ren had planned.\n\n*Your stamina won't last forever.*\n\nGrid's movements had already changed. He was slower now, covered in dust from deflecting soldiers, arrows, magic, and the surprise attacks of knights. His reactions had dulled.\n\n*Just a bit longer.*\n\nPrince Ren's smile widened as he watched Grid struggle. He could taste victory. He just needed to hold on.\n\n**Puk!**\n\n**Puuoooook!**\n\n\"Kuak!\"\n\n\"Heeok!\"\n\nA rain of arrows from Reidan's soldiers fell around Grid. The shafts punched through armor, dropping royal soldiers in clusters. Prince Ren frowned.\n\n*Are the arrows... stronger?*\n\nAt first, he dismissed it as imagination. Stress playing tricks on his mind. But the bodies kept piling up.\n\n*No. I wasn't mistaken.*\n\n**Puuoooook!**\n\n\"Kyaaak!\"\n\nThe casualties mounted. The attack power of Reidan's soldiers had clearly increased since the battle began.\n\n*What is this...?*\n\n\"The archery skills of the enemies are growing in real time!\" Chucksley shouted, riding up beside the prince. His weathered face was grim. \"If this continues, we won't be able to control the damage! We should have the knights keep Duke Grid in check while the soldiers defend against the arrows!\"\n\n\"No!\" Prince Ren's voice cracked. He cleared his throat. \"We can't do that!\"\n\nTraining one knight cost more than nurturing a thousand soldiers. Prince Ren needed to minimize knight casualties. The role of pinning Grid down belonged to expendable troops.\n\n*Just endure a little longer.*\n\nIt wouldn't be long now. Soon, an army would appear and slaughter the enemy archers from behind.\n\nHowever.\n\n\"Prince! The arrival time of the reinforcements has been exceeded!\"\n\nPrince Ren looked up at the sky. The sun hung low on the horizon, bleeding red into the desert. According to his plan, Hurent's group should have arrived by now to massacre the enemy. So why?\n\n*Why haven't they arrived?*\n\nHurent was comparable to Chucksley. Hurent and two thousand troops couldn't be delayed by mere monsters or bandits. Prince Ren's mind raced through possibilities, then stopped cold.\n\n*It can't be.*\n\nWhat if Grid had discovered the second force? What if he'd prepared an ambush?\n\n*Grid. A man with no formal education managed to read the battlefield?*\n\n*Does he have an innate talent for strategy?*\n\nThe thought unsettled him. Grid had anticipated the pincer movement and crushed it before it could develop. Then another messenger approached.\n\n\"Prince! I can't detect the Silver Dragons!\"\n\nPrince Ren's stomach dropped. \"What?\"\n\nThe Silver Dragons had magic power detectors implanted in their bodies. The purpose was thorough supervision, a safeguard against broken brainwashing and betrayal. Now the signal was gone.\n\nWhich meant death.\n\n*How?*\n\nPrince Ren had absolute confidence in the Silver Dragons. They were the strongest assassination group on the continent. Yet they'd failed to abduct one woman? He couldn't comprehend it.\n\n*Unless the duchess is protected by someone as strong as Grid... no.*\n\nThe memory surfaced. The Overgeared members who had assisted Grid during the Reinhardt golem invasion. Prince Ren's hands trembled.\n\n*Could the Silver Dragons defeat them?*\n\nGrid.\n\n*What the hell are you?*\n\n\"It's difficult to come back from this situation!\" Chucksley's voice cut through Ren's spiral of panic. \"We should change our strategy now!\"\n\n\"Why? What should we do?\"\n\n\"It's meaningless to buy time!\" Chucksley tightened his grip on his sword. \"We put all our strength into killing Duke Grid!\"\n\nIt was a signal.\n\nKnight Captain Chucksley and Deputy Captain Andu moved first. Fifty royal knights followed. Then thousands of soldiers rushed forward in a wave. An offensive that wasn't afraid of sacrifices.\n\nDust covered the area where Grid was standing.\n\n***\n\n*It's dirty.*\n\nThe average level of the enemy was only 130. Most rankers could slaughter these royal soldiers alone. But Grid couldn't afford to kill them. He had an obligation to preserve the experience for Reidan's soldiers.\n\nWhich made everything harder.\n\nHe had to subdue without killing. The constant regulation of his strength drained his stamina like a punctured waterskin.\n\n*Too many of them.*\n\nFive thousand enemies. When he faced them directly, they seemed endless. The soldiers of Reidan killed hundreds with their arrows, but nothing changed. When ten soldiers fell, countless others filled the gaps.\n\nThe attacks coming from all directions would have struck him multiple times without the God Hands intercepting.\n\n*War is never easy.*\n\nHe wanted to evolve Reidan's strength. To never suffer like this again. Grid exhaled roughly as dust swirled around him.\n\n\"Hit Duke Grid!\" someone shouted.\n\nGrid's eyes narrowed. Chucksley and the knights who had been guarding Prince Ren were charging. All of them, simultaneously. The soldiers built a defensive formation and ran alongside.\n\n*This is dangerous.*\n\nA whisper reached him.\n\n**-Pull out your power.**\n\nLauel's voice cut through the chaos. Grid hesitated, and Lauel pressed.\n\n**-You can't afford to let the soldiers attack any longer. Excessive greed will poison you. I'll let the soldiers know what they have to do. Go crazy.**\n\n**-Understood.**\n\nThere was no room to spare. Grid nodded and shifted into a stance suitable for sword dancing.\n\n\"Duke Grid!\"\n\nLaden and the northern troops rushed to protect him.\n\n\"It's too unreasonable! Leave it to me and avoid them!\"\n\nGrid studied Laden's expression. The young knight's face was set with grim determination. Ready to die. Grid understood why Marquis Steim valued him so highly.\n\n*His loyalty rivals Jude's.*\n\nNo. It exceeded Jude's. Jude didn't care about his life because he lacked the capacity for fear. But Laden was prepared to sacrifice everything despite understanding exactly what death meant.\n\n*Shame he doesn't have the skill to back it up.*\n\nGrid still hadn't seen Laden's true abilities. Meanwhile, Laden raised his sword at Chucksley.\n\n\"I won't let you pass!\"\n\n\"Newbie! Open the path!\" Chucksley's blade descended.\n\nSteel rang against steel in the air.\n\n\"Think about your body.\" Grid grabbed Laden's shoulder and pulled him back.\n\nLaden stumbled away from Chucksley's follow-up strike. Safe. But Grid now stood in the path of dozens of charging knights. The four God Hands were occupied with intercepting soldiers' attacks.\n\n\"Duke Grid!!\"\n\nLaden's voice cracked with panic. It was impossible for Grid to handle dozens of knights alone. The young knight feared the worst.\n\nGrid smiled.\n\n\"Cute guy.\"\n\nLaden blinked. *Is he smiling? Has he lost his mind?*\n\n\"Pagma's Swordsmanship.\" Grid's feet pressed into the desert sand, his stance reminiscent of military drill formations. \"**Restraint.**\"\n\n**Jeeeong!**\n\nThe air became heavy. Oppressive. A weight that crushed momentum.\n\n\"Umm...\"\n\nThe knights and soldiers around Grid faltered. Their charge broke like a wave against stone. Only one person pushed through. Chucksley overcame the oppression through sheer willpower and stabbed forward.\n\nHis sword didn't reach Grid.\n\n**Pahat!**\n\nSomething rose behind Grid. A perfect copy, moving to intercept Chucksley's blade. Doppelganger Randy had entered the battlefield.\n\n\"A clone...!\" Chucksley's eyes widened.\n\nCommon sense dictated that clones were illusions. Smoke and mirrors. But Grid's clone was solid. Real. Like facing another Grid entirely.\n\n\"Pagma's Descendant!\" Chucksley retreated half a step, his mind racing. \"Why do you have these techniques when you're a blacksmith?\"\n\n\"The power of pets.\"\n\n\"Power of pets?\"\n\nChucksley's concentration fractured. What did that even mean? Meanwhile, his swordsmanship overwhelmed Doppelganger Randy, who possessed only thirty percent of Grid's abilities. But he couldn't maintain focus forever.\n\n\"**Dragon's Stretching.**\"\n\nLauel's voice rang across the battlefield. The qigong master's third advancement class, Master of the Flow. Its single combat ability was inferior to specialized classes, but it existed for war. For changing climate and terrain.\n\n**Kurururu!**\n\nThe desert shook.\n\nThe earthquake rippled outward from Lauel's position. Sand poured in waves, swallowing royal troops whole.\n\n\"**Blackening.**\"\n\n**Kuwaaaaaang!**\n\nDarker than a starless night sky, Grid released his full power at the center of the chaos. Pagma's Swordsmanship erupted in sequence. Wave. Link. Kill. Transcend. Everything poured out without restraint. With support from Lauel, the northern troops, and Reidan's forces, the war ended quickly.\n\nThe northern army in the middle of the battlefield suffered heavy casualties. But it was a tremendous achievement for Reidan. Their soldiers were undamaged and had gained massive experience. A one-sided victory.\n\nYet Asmophel wasn't satisfied.\n\n\"Please give me a chance to do something...\" He stood at Grid's side, shoulders tense with anticipation. *I want to be seen by my Lord.*\n\nGrid turned to him. \"Asmophel! Recover the loot with the soldiers!\"\n\n\"...Yes.\"\n\nThis role again. Asmophel, who was once considered one of the two pillars of the Saharan Empire. The man Piaro acknowledged as an equal. His tears soaked into the battlefield sand.\n\n---\n\n**Glossary of Common Korean Terms**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}