{
  "id": 344,
  "title": "Chapter 344",
  "content": "# Chapter 344\n\nLauel watched Grid cut through the battlefield like a storm. His brow furrowed.\n\n*He's already tired.*\n\nGrid had played a significant role in the fighting, but Lauel wasn't satisfied. Honestly, it fell below expectations.\n\n*I wanted him to show that he wasn't lacking anything.*\n\nThe ability to read and respond to enemy movements. The ability to utilize terrain. The timing to use skills and take potions. The synergy of his items. The current Grid wasn't bad overall, but he wasn't at the level of the high rankers.\n\nThis wasn't meant to disparage him. The most appropriate assessment was neither the best nor the worst. Just... adequate.\n\n*It's more exciting to watch Yura fight. Grid is still lacking.*\n\nLauel catalogued the weaknesses. *First of all, he has poor control over his stamina and mana.* Grid needed to bear that in mind at all times. The power of legendary skills was excellent, but they devoured resources.\n\n*Every time he's in a crisis, he falls back on Wave and Restraint. It's a fatal weakness against anyone who can avoid non-targeted skills.*\n\nThat wasn't all.\n\n*And I don't know why he spams Magic Missile so much.*\n\nLauel drummed his fingers against his thigh.\n\n*The God Hands have mere artificial intelligence. There are attacks they can't cope with right now.* He pictured it clearly. *What if they're hit by a superior attack?*\n\nAmong the rankers, there were those called \"supreme.\" Kraugel and Agnus, for example. They shared something in common. A method to defeat them simply couldn't be found.\n\nThen what about Grid?\n\nThere were still too many gaps. As far as Lauel could see, Yura would surpass Grid as soon as she reached level 300.\n\n*For sure...*\n\nGrid was steadily growing and would continue to do so. Lauel trusted him. But he still couldn't help feeling worried. Every human had a limit, after all.\n\n*But.*\n\nHis lips quirked into a small smile.\n\n*It doesn't matter if Grid reaches the limits of his talent.*\n\nThe thought settled into certainty.\n\n*He can overcome it with items.*\n\nGrid possessed the skill to create legendary items. It was possible to create completely new types of equipment, making the possibilities endless.\n\n*I'll help you make more creative items than anyone can imagine.*\n\nLauel kept his gaze on the battlefield, directing soldiers with sharp, precise commands. Unlike his calm demeanor, his vision tracked the movements of Prince Ren with predatory focus.\n\n\"He's finally leaving the battlefield.\"\n\nThe knights blocked Grid. The northern troops and Reidan forces were busy dealing with the main army. No one noticed the enemy prince retreating. Lauel's smile widened.\n\n*This will make him easier to capture.*\n\nHe opened the list of Reidan's soldiers and sorted them by level. Then he designated thirteen names.\n\n\"Arm yourselves with this and follow me.\"\n\n\"Yes!\"\n\nThe soldiers Lauel selected had all reached level 160. The requirement for the <span class=\"rarity-uncommon\">Mass Production Grid Set</span>.\n\n***\n\n*Impossible! This is ridiculous!*\n\nPrince Ren's head throbbed like someone was driving nails into his skull. The moon shining down on the cold desert did nothing to cool the boiling heat behind his eyes.\n\n*Using raw power to overcome the difference in numbers and detecting all my strategies!*\n\nGrid.\n\nHe was far beyond what Prince Ren had assumed. A man who should never be made an enemy. Despite the loss of his royal dignity, he had to admit this.\n\nThe Patrian horses pounded through the desert sand. Prince Ren gripped the reins until his knuckles went white. Pain, anger, regret, and despair churned through his mind in waves. The defeat today might have completely destroyed the foundation of the First Prince.\n\nHe was drowning in frustration when a group appeared behind him.\n\nLauel and thirteen soldiers.\n\n\"Prince Ren!\" Lauel's voice cut through the night. \"If you don't want to die, surrender right now! Stop if you want to live!\"\n\nPrince Ren glanced back. \"Would you stop if you were me?\"\n\nHe scoffed at Lauel's nonsensical demand and spurred his horse faster. Lauel sighed and beckoned to the soldiers.\n\n\"Shoot.\"\n\n\"Huh?\"\n\nShoot a bow while riding a horse? The Reidan soldiers looked baffled. They were novices at horseback riding. Shooting while mounted was far beyond their current skill. Lauel shouted as they hesitated.\n\n\"Trust in the power of items!\"\n\n\"Items...!\"\n\nCommon NPCs didn't know the concept of being overgeared, but the soldiers of Reidan were different. Their superiors had drilled it into them. The philosophy of overwhelming strength through equipment. They pulled out their bows while their horses galloped forward.\n\nLauel did the same. A notification window materialized before him.\n\n> **[You have let go of the horse's reins! Danger! The risk of falling from the horse will increase by 60%!]**\n\n> **[The Mass Produced Grid's Gaiters have attached to the stirrups. The risk of falling has decreased significantly.]**\n\n*He made it properly!*\n\nElite soldiers possessed horseback riding skills. But training them to wield swords or shoot arrows on a running horse took considerable time. The desert terrain of Reidan made it even harder for beginners. Lauel had worried about this and made a request to Grid.\n\nSolve it with items.\n\nGrid's response had been the <span class=\"rarity-uncommon\">Mass Produced Grid's Gaiters</span>. Made in a form where the gaiters attached directly to the stirrups. There was the disadvantage of being uncomfortable when dismounting, but...\n\n*We'll get used to it!*\n\nKirik!\n\nOn running horses, Lauel and the thirteen soldiers drew back their bowstrings. Prince Ren twisted in his saddle, shock flashing across his face.\n\n*These soldiers learned the skill of fighting on horseback?*\n\nIt was difficult for even knights to master.\n\nA smile appeared on Lauel's face as he caught Prince Ren's expression.\n\n\"Reidan's soldiers!\" Lauel's voice rang out like a battle hymn. \"You are the loyal subordinates of Duke Grid! Place your anger in those sharp arrowheads! Send arrows of regret and despair toward the head of the enemy who dared invade Reidan!\"\n\nThe thirteen soldiers felt goosebumps crawl across their skin at Lauel's horrific shout. But they were soldiers who had endured Piaro and Asmophel's hell training. They steadied their minds and released their arrows with unwavering precision.\n\nPahat!\n\nPa pa pa pat!\n\n\"Protect the prince!\"\n\nPrince Ren's importance to the Eternal Kingdom was paramount. He was constantly guarded by members of the Silver Dragons. Daluka's Clothes deactivated. Five Silver Dragons following the prince revealed themselves, shattering the fourteen arrows with their daggers. The silver gleam in the darkness was razor-sharp.\n\n*They're strong!*\n\nPanic flickered across the soldiers' faces. Their skills weren't at the level to deal with high-level assassins.\n\nBut Lauel was still smiling.\n\n\"Noe!\"\n\nThe best demonic beast in hell. Throughout this war, he had been asleep on Lauel's chest. Grid had ordered him to escort Lauel.\n\n\"Nyang!\"\n\nA black cat with small demon wings burst into motion. His chubby body flew toward the assassins. Sharp claws extended.\n\n\"Nya nya nya nya nyang!\"\n\n\"Heok!\"\n\n\"Ugh!\"\n\n\"Keok!\"\n\nThe Silver Dragons were strong. It wasn't easy for Noe, who was only in the early 200s, to easily overpower them. Daggers flashed, focused on blocking Noe's attacks.\n\nHowever, Noe had a secret technique.\n\n\"Kyong!\"\n\nNoe's mouth stretched impossibly wide. The agility of the Silver Dragons vanished, swallowed whole by Noe.\n\nLauel focused qi at his fingertips. \"I'm much better compared to my previous life.\"\n\nDragon's Claws erupted from the ground. The weakened Silver Dragons took fatal wounds.\n\n\"U-Unbelievable!\"\n\nThe Silver Dragons were subdued so easily.\n\n*What is that crazy cat?*\n\nPrince Ren kicked his horse to greater speed. But Noe's movement speed far exceeded it after absorbing the Silver Dragons' agility.\n\nPeok!\n\n\"Ugh!\"\n\nThe cat's paw struck the back of Prince Ren's head. The prince tumbled from his horse. It was the shame of a lifetime.\n\n***\n\nThe Reidan army's barracks. First Prince Ren, who had abandoned his army and retreated, knelt among the captured soldiers.\n\n\"You guys dare?\" His voice cracked with rage. \"Don't you know who I am?\"\n\nRoyalty. Ren, who was first in the line of succession, recognized himself as a sacred presence. Wasn't it too insulting to be caught by common soldiers and dragged around like a dog? He would rather die than bear this shame.\n\nGrid read the anger and resentment filling those stubborn eyes. He scoffed.\n\n\"This totally crazy bastard.\"\n\n\"What...?\"\n\nHe might be a prisoner, but wasn't he still a prince of the Eternal Kingdom? He should be treated with a minimum of courtesy, not dragged around and forced to kneel like a dog.\n\n\"E-Ek?\" Prince Ren's eyes widened. \"Duke Grid! You! How can you say such words?\"\n\n\"It's easy.\" Grid stepped closer. \"Aren't you really crazy? First, you're the one who invaded my territory, but you want to blame me? What is this impertinent attitude?\"\n\n\"Don't talk nonsense!\"\n\nKwaduduk!\n\nPrince Ren coughed up blood. Something cracked. It felt like ribs breaking.\n\nGrid sighed. \"You don't know your mistake.\"\n\nThis was the temperament of the strong. They were accustomed to trampling on others and living their own way. They were unaware of their own faults.\n\n*It was the same with Lee Junho and Choi Chansung.*\n\nGrid had been bullied by them for years. He knew this pattern well.\n\n\"People like you don't change easily.\" He paused. \"It's the same for me.\"\n\nGrid's current personality was mostly shaped by what he'd experienced. He had been submissive and trampled on for most of his life. It gave him an obsession to repay any grudges. A tendency toward violence. His basic nature still hadn't changed, even with his life improving.\n\n\"Lower your eyes.\"\n\nPeeok!\n\nGrid didn't treat the other person in a special manner just because he was a prince. He forced Prince Ren to bow his head and made an immediate decision.\n\n\"You are sentenced to death.\"\n\nCommotion erupted in the surroundings. There was a captivity law in the West Continent. A common law that had lasted for hundreds of years. Prisoners couldn't be harmed if they were nobility or royalty. The fact that Grid would violate this law astonished Prince Ren and the royal army alike.\n\nLauel's whisper arrived in Grid's ear.\n\n*Hold on. If you kill Prince Ren, Reidan will become independent and have a completely hostile relationship with the Eternal Kingdom.*\n\n*Then let's be independent. Won't I be king anyway?*\n\n*It's premature. If Reidan becomes independent from Eternal right now, there's a possibility that Marquis Steim's northern territory will be taken while isolated. And Reidan is likely to become the empire's prey.*\n\n*Hmm.*\n\nGrid's understanding was low. But he paid attention to what the other person said.\n\n*I don't know... Then what should I do?*\n\n*Be magnanimous and spare him. Prince Ren is responsible for this war and he has completely lost his foundation. By sending him back alive, you can make him build up forces loyal to you. Kill two birds with one stone. More forces will support you and Reidan can establish a greater presence in the Eternal Kingdom.*\n\n*But I already declared that I wouldn't send the invaders back alive.*\n\n*I'm telling you to reverse the decision. You won't lose any dignity. No, many users will admire your wise choice.*\n\n*That... Really?*\n\nReversing the decision. Grid didn't particularly like it.\n\n*You aren't planning to stab me in the back later, right?*\n\n*It will never happen, as long as you are ruling above me.*\n\n*...I'll work hard, even if you're scary.*\n\n*Huhuhut!*\n\nThe smiling chuunibyou. Lauel's loyalty was unquestionable. Grid knew this better than anyone else."
}