{
  "id": 345,
  "title": "Chapter 345",
  "content": "# Chapter 345\n\nGrid listened to Lauel's whispered strategy through the guild chat, then nodded once.\n\n*I'm convinced.*\n\nThe black fury faded from his eyes, replaced by cold calculation. He'd learned this from watching Huroi and Lauel—think first, speak second. Grid turned his attention back to the prince.\n\n\"Prince Ren.\" His voice was flat. \"Let me ask you something. You invaded Reidan. That means something happened to the king, doesn't it?\"\n\n*Too clever.*\n\nRen felt the trap closing around him. Those black eyes seemed to pierce through every defense, reading every hidden motive. Hard to believe this man hadn't been born into nobility.\n\nThe prince swallowed. \"Yes. The king's life is ending. I had to eliminate you to secure my succession.\"\n\nRen's composure cracked. His face twisted with rage.\n\n\"You! If you'd just pledged loyalty to the *royal family* that day, not just the king, I wouldn't have needed such extreme measures!\"\n\nGrid watched the prince expose himself. Exactly as Lauel had planned.\n\nLauel's smile turned wicked. *Your 'extreme choice' just weakened the royal family and elevated Grid. Perfect.*\n\n*That bastard Lauel.*\n\nGrid felt goosebumps at his strategist's expression. Smart people were terrifying.\n\n\"Hrmm.\" Grid cleared his throat. \"As you said, I swore allegiance to the king.\"\n\nHe pushed down his anger, seeing the wider game now.\n\n\"I, Grid Reidan du Steim, have decided.\" He paused, letting the silence stretch. \"Prince Ren invaded my territory. Tried to destroy my foundation. But Prince Ren is also the king's successor, a pillar of the Eternal Kingdom. As the king's servant, I will forgive this transgression.\"\n\n\"...!\"\n\nThe prince's eyes widened. The entire royal army stood frozen in disbelief. The disrespect in Grid's tone was obvious, but that wasn't the point. *Forgiveness.* No accountability. No consequences. Such mercy was unprecedented.\n\n\"Just before, you sentenced me to death!\" Ren's voice cracked. \"Why would you suddenly absolve me? What are you scheming?\"\n\nGrid's expression flattened to stone.\n\n\"Why are you bitching when I'm giving you a break?\"\n\nHis true nature slipped out. Lauel pinched the bridge of his nose and glanced at Bunny Bunny, who immediately nodded. This part would need editing.\n\nGrid tried again. \"I'm letting it go. You're the successor to the king I swore to serve. To maintain my loyalty and prevent chaos in the Eternal Kingdom, I'm letting it go. You jerk.\"\n\n\"Why...?\" The prince's voice dropped to a whisper. \"Why would you make such a decision?\"\n\n*This man's heart is as wide as the sea.*\n\nGuilt crashed over Ren like a wave. *Whatever my reasons, I tried to destroy Duke Grid.*\n\nThe fact that he was being forgiven...\n\n\"I, First Prince Ren of the Eternal Kingdom, make this pledge.\" Emotion thickened his words. \"Duke Grid, you sacrificed yourself to forgive this sinner for the kingdom's sake. I will never forget this. I will spend the rest of my life repaying this debt.\"\n\n\"Don't stab me in the back.\"\n\nGrid rose from his seat. The thousand Reidan soldiers and five hundred surviving northern troops fell into formation on his flanks. A spectacular sight. This was a man at the peak of two billion players.\n\n*Everyone starts the game on equal terms.*\n\nYet while some players were still killing orcs in starter zones, Grid ruled as a duke with thousands of troops under his command. Bunny Bunny's eyes filled with envy as he watched.\n\n*Maybe he really is a good person.*\n\nBlackening had turned Grid's eyes completely black, draining the color from his face. The stark contrast created an illusion of handsomeness. He looked good on camera. Still, nothing compared to the white-haired version that had once made women worldwide swoon.\n\n\"I'm leaving now.\"\n\nBunny Bunny captured Grid's departing image with his camera. No regrets. The army withdrew from the barracks, marching back toward Reidan. The last thing Grid saw before turning away was Chucksley, standing among the surviving royal troops.\n\nThe great swordsman's eyes were wet.\n\n*A hero of the kingdom with such a wide range of skills.*\n\nDeep gratitude filled him that his prince had been spared.\n\n*I swear the Lokan family will honor you and yours forever.*\n\nIt should have been this way from the start. Grid was the kingdom's hero. But Prince Ren and Chucksley had forgotten that fact, consumed by their own paranoia. Now guilt settled heavy on their shoulders.\n\n***\n\n\"I'm thankful my life was spared, but...\" Prince Ren stared at the blood-soaked sand. \"It's bittersweet. I'm completely out of the line of succession now.\"\n\nFewer than a thousand royal troops remained. Out of seven thousand, over six thousand lost. Twenty-four Silver Dragons, thirty-nine knights, Ferrell, and Andu—all gone. This war had gutted the royal family's forces. He would face severe consequences. Pushed down the succession line. Probably disciplined. Possibly imprisoned.\n\n\"The blood of the royal family is more precious than any gem, Your Highness.\" Chucksley walked beside him. \"You kept your life. That's enough. And you confirmed Duke Grid's loyalty to the crown. That's worth something.\"\n\nPrince Ren felt grateful for Chucksley's steadfast service.\n\n\"Let's hurry. I need to be at Father's side when... when it's time.\"\n\nKing Wiesbaden had less than a week to live. Prince Ren's sin would be unforgivable if he wasn't there at the end. They quickened their pace across the desert, urgency driving each step.\n\nTwo figures materialized ahead of them.\n\nOne was Eternal's Second Prince, Aslan. The other wore concealing robes, face hidden.\n\n\"Aslan?\" Prince Ren stopped. \"Why are you here?\"\n\n\"I was certain you would be defeated, Brother.\" Aslan's voice was calm, measured. \"Did you really think seven thousand troops could defeat a legendary duke? A legend isn't someone who can be hurt by common soldiers. The royal family doesn't yet have the power to oppose Duke Grid.\"\n\n\"I'm sorry.\" Ren's shoulders slumped. \"I was overwhelmed by anxiety. I dealt a massive blow to the royal family.\"\n\n\"No. You don't need to apologize to me.\" Aslan stepped closer. \"Rather, I'm thankful. Why do you think I didn't stop you, despite foreseeing your defeat?\"\n\nAslan was normally reticent. He barely spoke, and when he did, he weighed every word ten times over. Ren might be his brother, but he'd rarely heard Aslan's voice in the last thirty years.\n\nBut now.\n\nNow Aslan spoke without hesitation, a provocative edge to his words. The content was disturbing.\n\nPrince Ren's expression twisted. \"Aslan, don't tell me you—\"\n\nA wide smile split Aslan's face.\n\n\"Did you notice? I *wanted* you to self-destruct. In that sense, the current result is disappointing. It would've been ideal if you'd lost your life to Duke Grid.\"\n\n\"Prince Aslan!\" Chucksley's voice cracked with shock. \"That's too much!\"\n\nChucksley had sworn allegiance to the royal family itself, not just to Prince Ren. He prayed for their collective well-being. He didn't want conflict between the princes. He stepped forward to calm the situation.\n\nAslan raised a hand. \"Sir Chucksley, come here. I will take my brother's life now. I hope you won't be swept away by it.\"\n\n\"What...!?\"\n\nChucksley couldn't believe his ears. His feet refused to move.\n\nAslan turned to the robed man. \"Please spare Sir Chucksley, if possible. He's a treasure of our kingdom.\"\n\nThe silent figure nodded.\n\n\"I understand.\"\n\n*Flap.*\n\nThe robed man threw his cloak skyward. Prince Ren looked away for a split second.\n\n*Teong!*\n\nThe man closed the distance in an instant, blade already moving toward Prince Ren's heart.\n\n\"You!\"\n\nChucksley lunged. His sword intercepted the strike aimed at his prince. But the man's technique was beyond anything Chucksley could counter. The blade slipped past his guard, cutting diagonally across Prince Ren's torso.\n\n\"Ke...heok!\"\n\nPrince Ren coughed blood. It splattered across his armor, then soaked into the cold desert sand below.\n\n\"Prince!!\"\n\n*He has to live!*\n\nChucksley rushed forward, desperate to reach Prince Ren, to apply first aid, to escape. The unidentified swordsman blocked his path.\n\n\"Who the hell are you?\"\n\n*A great swordsman.* One of the strongest on the continent. Yet here was someone who surpassed him? The man's voice was cold.\n\n\"I am called the Ninth Knight.\"\n\n\"...!\"\n\nChucksley studied him more carefully. Red armor. The symbol of the Red Knights.\n\n\"A Solo Number Knight!\"\n\nThe strongest warriors of the Saharan Empire, dominant for hundreds of years. Their reputation reached even the East Continent.\n\nBut!\n\n*I'm a great swordsman!*\n\nIf a Solo Number Knight was the empire's strongest, he was the continent's strongest swordsman. He should be their equal, at least.\n\n*Then why?*\n\nThe Ninth Knight shrugged. \"A mere hundred years ago, Great Swordsman wasn't the title for the strongest. Sword Saint was the peak.\"\n\n\"But no one's qualified for Sword Saint in the last century.\" Chucksley's grip tightened on his blade. \"A great swordsman appears once every twenty years.\"\n\n\"You might've thought yourself the strongest, but there are many born with the qualities of a Sword Saint. Relatively speaking, great swordsmen are common.\"\n\n\"You're also a great swordsman!\"\n\n\"Indeed. But I'm much closer to becoming a Sword Saint than you.\"\n\n*Puok!*\n\nThe strange Y-shaped blade deflected Chucksley's sword. It plunged into Prince Ren's heart.\n\n\"Your Highness!\"\n\nThe body in Chucksley's arms grew cold rapidly. He felt the life draining away, despair crushing his chest. Meanwhile, Prince Aslan and the Ninth Knight moved through the surviving soldiers like reapers.\n\n***\n\nTwenty Silver Dragons had originally come to kidnap Irene.\n\nThey'd been captured by a potato enthusiast who might be a swordsman, magician, or farmer. They'd expected execution. Instead, he'd shown mercy. Rather than taking their lives, he removed the magic power detectors controlling their bodies and minds.\n\n\"There must be a reason you wanted to do something so desperately.\" Bland's voice was gruff. \"Anyway, now you're free. I don't want to defile my body and soul by killing you.\"\n\nOrphans forced into assassination. Now granted freedom by a stranger whose name they didn't even know. The Silver Dragons felt something stir in their chests. Gratitude. Hope. But also uncertainty.\n\nThey had no place to go.\n\n\"We want to follow you with sincere hearts.\"\n\n\"...\"\n\nBland found them annoying. He didn't need weak assassins cluttering up his farm. But they might be useful to someone else.\n\n\"You're just a nuisance to me.\" He turned away, dismissive. \"However, if you want to do something useful, protect Duchess Irene.\"\n\n\"Yes!\"\n\nThe Silver Dragons moved immediately. Irene was in Lord's room at that moment. The domain of Kasim, king of shadows.\n\n\"Who are you?\"\n\n\"Heok!\"\n\nThe Silver Dragons froze. Someone whose presence they couldn't detect? Kasim studied the intruders with calculating eyes.\n\n\"Hoh, that's Daluka's breathing method.\" Interest flickered across his face. \"You're learning something interesting.\"\n\nLord Steim would be the continent's future.\n\nIt was the day the foundation of the strongest assassin group, the Overgeared Shadows, was laid.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}