{
  "id": 346,
  "title": "Chapter 346",
  "content": "# Chapter 346\n\nThe march back to Reidan exposed the gulf between the northern army and Reidan's forces. \n\nReidan's soldiers moved with steady breath, boots striking sand in rhythm. Behind them, the northern troops stumbled. Shoulders sagged. Faces pale. Men who'd fought beside them now looked ready to collapse.\n\nMental exhaustion from the sacrifices of war? \n\nNo.\n\nRaw statistics. The northern army held its reputation as one of the Eternal Kingdom's finest, but numbers didn't lie. Reidan's forces had survived hell training under Piaro and Asmophel. Higher levels. Strength and stamina that exceeded any regional standard. Their adaptation to terrain defied normal military doctrine.\n\nLaden watched them march. *I need to obtain their training methods.*\n\nGrid moved up the column toward Asmophel.\n\n\"You did well with the army training.\" Grid's voice carried genuine appreciation. \"Your work made this war easier.\"\n\nAsmophel's jaw tightened. \"You overpraise me, My Lord. I wasn't alone in the training.\"\n\n\"It's not overpraising.\" Grid gestured back at the exhausted northerners. \"Look at the difference between them and ours. Sky and earth. This war showed me what you're capable of.\" He paused. \"Piaro spends most days in his fields. You're a hundred times more reliable.\"\n\n\"My Lord!\"\n\nAsmophel's chest tightened. After joining Grid's service, he'd worked in shadows. No recognition. No glory. The fear of invisibility had gnawed at him daily. But Grid had been watching. Grid understood.\n\n\"I will work harder to achieve your goals!\"\n\n\"Good. Keep focusing on the army training.\"\n\n\"...What?\"\n\nThe words hit like cold water. Asmophel held the title of Head of Overgeared Knights Division 2. Knights Division leaders undertook high-level missions, not basic drill instruction. He'd been a pivotal figure in the Saharan Empire, the continent's dominant power.\n\n*He wants me to continue as a trainer?*\n\n*He still doesn't understand my true abilities.*\n\nFrustration coiled in Asmophel's gut. Before he could respond, Grid shifted topics.\n\n\"How much loot did we recover?\"\n\nAsmophel swallowed his anxiety. \"The royal army dropped 933 blades, 712 spears, 250 bows, 195 shields, and 141 armor pieces.\"\n\n\"That's all?\"\n\n\"Yes.\"\n\n\"Why so little?\"\n\n\"That...\" Asmophel blinked. \"Those are all the items the royal soldiers dropped.\"\n\n\"We had 4,000 casualties. Shouldn't that mean at least 4,000 drops?\"\n\nSilence.\n\nNPCs followed the same rules as monsters and users. Death didn't guarantee item drops. Grid knew this perfectly well, but the numbers still felt wrong. When Asmophel offered no response, Grid turned to Lauel.\n\n\"Lauel, what's our actual profit? You promised we'd sit on piles of money from the spoils. What happened? Did I expect too much?\"\n\nLauel pulled out a slate. \"Total of 2,090 normal rated level 130 equipment pieces. 141 normal rated armor. At minimum market value, that's 25,000 gold in profit.\" He glanced up. \"You're about to become a building owner. Are you seriously dismissing that amount of money?\"\n\n\"Wait, what?\"\n\n25,000 gold equated to roughly 30 million won. Half a day of fighting for that return.\n\n\"How is it that much?\"\n\n\"Level 130 normal rated weapons sell for at least 10 gold each. Armor goes for 30 gold. Quantity matters.\" Lauel tapped the slate. \"If you melt everything down and use it as raw material for new items, the profit margins increase even further.\"\n\nGrid's expression shifted. \"War is profitable.\"\n\n\"Indeed. War provides loot and establishes logistics chains. Very beneficial to the economy. The Empire has understood this for centuries.\"\n\n\"Should we fight wars constantly now?\"\n\n\"If only it were that simple.\" Lauel's smirk held an edge. \"That said, Reidan is optimized as a war base. Desert terrain. High monster spawn rates. Thanks to Piaro, we can produce food in massive quantities. When the time comes, this will prove invaluable.\"\n\nThe mention of that name twisted Grid's face.\n\n\"About Piaro.\" Grid's voice hardened. \"The man holding the commander's position didn't participate in this war. He left for Altes Mountain right before the fighting started. Used 'training one soldier' as an excuse. His timing is suspiciously convenient.\"\n\nWhat Grid didn't know: Piaro had annihilated Hurent's flanking force. He'd secured 850 prisoners... *farmers*. Piaro's contribution had been decisive, but Grid remained ignorant.\n\n---\n\n\"Your Highness! Your Highness!\"\n\nCold desert night. A man of noble blood died without leaving final words.\n\nChucksley clutched Prince Ren's corpse. Tears carved lines through the dust on his face. Aslan watched with an expression of benevolence that didn't reach his eyes.\n\n\"Sir Chucksley, your loyalty to the royal family reassures me.\" Aslan extended his hand. \"Now serve me until the day I die.\"\n\nChucksley stared at that offered hand.\n\nHe'd held no special affection for Prince Ren. His reverence had been distributed equally among all royals. But now, holding this cooling body, hostility burned in his chest. Aslan's cruelty, that unflinching gaze as he murdered his own brother, revolted something deep in Chucksley's core.\n\n*He's terrifying.*\n\nWorse, Chucksley's value had plummeted. He'd failed to protect his charge. The helplessness tasted like copper on his tongue.\n\nChucksley swallowed his fear, his rage, his despair. He bowed.\n\n\"I will follow.\"\n\nDuty demanded it. Whatever Aslan had become, service to the Eternal Kingdom's royal family superseded personal feelings.\n\nBut.\n\n*A man blinded by ambition, borrowing foreign power to murder his brother. I cannot give you true loyalty.*\n\nHe would perform his obligations. Nothing more. The heat of Chucksley's devotion cooled to ice. Prince Aslan, oblivious to the shift, smiled.\n\n\"Today is a fortunate day.\"\n\nPrince Aslan had been born two years too late to inherit the throne. He'd cursed that timing, hated the rotting life of a powerless prince. Now Prince Ren's stupidity had changed everything.\n\n\"Let us return. I will care for my brother, who was killed by Duke Grid.\"\n\n---\n\n**February 10th, Year 406 of the Eternal Kingdom.**  \n1st Prince Ren invaded Reidan with an army of 7,000 men.\n\n**February 17th, Year 406 of the Eternal Kingdom.**  \n13th King Wiesbaden died. 2nd Prince Aslan ascended the throne.\n\n**February 21st, Year 406 of the Eternal Kingdom.**  \n14th King Aslan made his declaration before the assembled court.\n\n\"Duke Grid killed the prince, but he bears no guilt. Prince Ren ignored Duke Grid's merits and invaded without justification. He was clearly in the wrong. Duke Grid acted in self-defense.\"\n\nThe pronouncement secured Grid's position. Despite being charged with regicide, his life continued unchanged. His status as one of the great lords of the Eternal Kingdom remained solid.\n\nLauel, however, felt the sting of failure.\n\n*In my original plan, Grid's position should have surpassed the royal family by now.*\n\nHe'd intended to exploit Prince Ren. Instead, someone had killed the prince before Lauel could spring his trap. The murderer's identity was obvious. King Aslan. But the matter couldn't be exposed. No concrete proof. No justification. Especially when King Aslan was publicly showing favor to Grid.\n\n*Clever.*\n\nBy taking this approach, Aslan constrained Grid's growth while appearing to befriend him. Simultaneously, the king had formed an alliance with the Empire, gaining access to economic and military resources.\n\n*Aslan showed explicit cooperation with the Empire immediately after his coronation. The imperial royal family backed his ascension. Aslan builds his foundation through imperial support. The Empire gains complete control over the Eternal Kingdom. Mutual benefit.*\n\nKing Aslan presented a genuine challenge. Rather than frustration, Lauel felt his pulse quicken.\n\n\"Kukuk...! King Aslan, well played. You're the first opponent to truly stimulate me. The folds of my brain are twitching with excitement.\"\n\nLauel raised one hand to cover half his face. He leaned against the window, fingers tracing the transparent glass.\n\n\"I can't wait. When tears fill this glass, they'll be yours, not mine.\"\n\n---\n\nWhile Lauel indulged in his dramatic musings, Grid was celebrating.\n\n\"King Aslan sent another gift? Hey, he's not bad! Haha! Much better than the previous king!\"\n\nThe war had provided substantial loot. King Aslan's gold treasures had made Reidan genuinely wealthy. This foundation would allow all 1,000 of Reidan's soldiers to equip the Mass Production Grid Set. True elite troops were being forged.\n\n---\n\n\"Huh?\"\n\nGrid had been busy crafting Mass Production Grid Sets with the four God Hands. He'd stepped out for a walk and some time with Lord. Now his eyes widened.\n\nThe fields swarmed with farmers. The numbers had exploded. Easily a thousand new workers.\n\n*Where did they all come from?*\n\nReidan suffered from chronic population shortages. How had this many people appeared?\n\nPiaro approached, expression serene.\n\n\"I picked them up by chance in the Altes Mountains.\"\n\nGrid stared.\n\n*Picked up people? In the mountains? More than 800 of them?*\n\nThe explanation was absurd. Yet Grid had seen Piaro bring the entire Ul Clan to Reidan before. This tracked with past behavior.\n\n\"There must be an ethnic minority living in the Altes Mountains. Very good. That explains why you weren't at the war.\"\n\nGrid had just classified soldiers of the Eternal Kingdom as a minority ethnic group.\n\n---\n\nRoyman had questions. She waited until Grid was occupied with Lord, then approached Piaro.\n\n\"Why didn't you tell the duke the truth? They're not a minority. They're people from the Eternal Kingdom, same as us.\"\n\nPiaro's gaze remained on the fields. \"I don't want the workforce taken into military service. This isn't deception. Farming is national power. In the end, I made this choice for the duke's benefit. I will train them in military exercises as well.\"\n\n\"I see!\"\n\nRoyman had witnessed Piaro's overwhelming capabilities. Everything he said sounded correct to her ears.\n\n---\n\n850 new farmers had joined Reidan. They worked the fields at dawn and received military training at night. Among them, Aura Master Hurent questioned his life choices.\n\n*What am I doing?*\n\nThe situation was confusing and embarrassing. Yet he couldn't deny his desire for the rewards promised by the **★Hidden Quest★ Fun and Exciting Training!**\n\nDay by day, Reidan grew stronger.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule:** 20 chapters a week.  \n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}