{
  "id": 347,
  "title": "Chapter 347",
  "content": "# Chapter 347\n\nThe typical profit structure for broadcast jockeys revolved around lunar balloons, the virtual goods viewers sent during streams. In reality, though, the main source of income came from advertising. Brands advertised themselves through the BJ's clothes or accessories. Banner ads appeared on screen, and video ads multiplied based on the number of playbacks.\n\nA BJ's advertising revenue exploded depending on viewer count and video plays. The popular ones raked in millions of won monthly.\n\nThe pinnacle of this was Bunny Bunny. After his spectacular comeback through the 'Seven Guilds Invasion of Reidan,' his average viewership hit 150,000. The audience came from every corner of the world. Once a broadcast started, lunar balloons flooded in. Advertising companies guaranteed him the best treatment possible.\n\nBunny Bunny cracked his knuckles. \"The new broadcast will raise my value even more.\"\n\n*Clack. Clack. Clack.*\n\nHe sat in front of his computer for three days straight. He ate his meals at the desk and reduced his sleep to the bare minimum. He concentrated on editing the footage, eyes strained behind thick glasses.\n\n\"Okay, very nice.\" Bunny Bunny nodded, pleased with the ten-hour video gradually taking shape.\n\nPrince Ren marching forward with resolve. A young knight struggling against the Great Swordsman Chucksley. Grid appearing at the dramatic moment to overpower Prince Ren's army. The Reidan soldiers turning the royal forces into walking experience farms. In the end, Prince Ren falling to his knees before Grid, who showed mercy and reigned over thousands of soldiers.\n\nAnd as a bonus, the farmer who crushed Hurent.\n\nThe war footage of the Reidan army versus the royal army was a blockbuster. There were plenty of spectacular and stimulating sights to enthrall the viewers. Thanks to Bunny Bunny's exceptional filming and editing techniques, nothing felt boring.\n\n*The finale is the highlight.*\n\nGrid looked down at the kneeling Prince Ren with a haughty attitude. The viewers would realize something when they watched Grid say 'I will forgive your sins.' They would understand that Grid was a clever person who looked to the future.\n\n*The ones who mock Grid for only using items will be shut down.*\n\nBunny Bunny liked Grid's character. He showed great dignity as a lord while displaying abrupt speeches and absolute force. He always appeared at dramatic moments and was perfectly suited to be a protagonist.\n\n*His appearance is also improving.*\n\nExercise had further refined Grid's physique. In particular, his sharp jawline was now visible. It was a subtle difference when looking at him in person, but different in video. Elements on screen could be changed significantly by minor factors.\n\n*I need to get closer to Grid in the future. More filming opportunities.*\n\nA notification chimed. Bunny Bunny was putting the final touches on the edit when an email arrived. It was from Lauel. Bunny Bunny narrowed his eyes as he read the contents.\n\n\"He's as thorough as rumored.\"\n\nLauel had two requirements. First, pay 40% of all Grid-related proceeds to Overgeared. Second, delete the scene where Grid allowed Prince Ren to live.\n\n*The profit distribution is more than twice the average.*\n\nStill, it was something he could afford. It was worth spending this much. But why delete the last scene that would imprint Grid's charisma onto the public?\n\nBunny Bunny worried about it for a long time before figuring out Lauel's intentions.\n\n*Grid was framed for killing Prince Ren.*\n\nIn such a situation, what if it spread that Grid released Prince Ren?\n\n*Some people might think that Grid stabbed Prince Ren in the back.*\n\nThe misunderstanding would be that Grid let Prince Ren leave alive, only to chase and assassinate him later.\n\n*The person who killed Prince Ren can't be specifically identified. The misunderstanding might be resolved if Grid tries to explain it.*\n\nHowever, it was a sensitive issue. The public might be indifferent to any clarification.\n\n*There's no need to create problems where there are none.*\n\nBunny Bunny was convinced. He started editing the video again.\n\nTwo days later, the nine-hour video of the war between Grid and Prince Ren was broadcast. The reaction was explosive, exceeding even Bunny Bunny's expectations.\n\n> -Wow. That knight called Laden has excellent skills. Not giving into the enemy until the end for his lord.\n>\n> -A Named NPC? Ordinary players like us can never meet them. ㅋ\n>\n> -Chucksley is the real thing. He's a Great Swordsman.\n>\n> -Ohh! Grid!\n>\n> -Crazy; Look at Grid;;;\n>\n> -Wow. I never thought he could match Chucksley. He's even giving Reidan's soldiers experience while dealing with Chucksley ㅋㅋ\n>\n> -I can't look away.\n>\n> -I felt it since he hit the Red Knight, but Grid has really improved his control skills.\n>\n> -I agree. There's no comparison to the National Competition or the golem invasion.\n>\n> -What are those golden hands? ;;\n>\n> -What Grid ㅋㅋㅋ Does he want to be a thousand-armed person in the future? ㅋㅋㅋㅋㅋ\n>\n> -Grid oppa has used Blackening.\n>\n> -I prefer the white version.\n\nIn the past, many people expressed dissatisfaction toward Grid. Some even showed hostility. They couldn't acknowledge Grid, who showed poor skills and only relied on items. But now it was different.\n\nPeople felt attracted to Grid. Over time, the users saw Grid growing and wanted to become like him someday.\n\n> -Eh?\n\nThe enthusiastic audience watching Bunny Bunny's broadcast became quiet. It was due to Hurent, who won Prince Ren's trust and led 2,000 troops. He repeatedly said he would repay his grudge while moving through the Altes Mountains.\n\n> -Farmers?\n\nThat's right. Farmers blocked their way. The viewers were disappointed.\n\n> -What's wrong with those farmers? ㄷㄷ\n>\n> -Blocking the front of an army. Do they want to commit suicide?\n>\n> -How poor. Pitiful.\n\nThat was the common belief. All the viewers were worried about the lives of the farmers. But what was the real scene? Two thousand soldiers defeated by a farmer using legendary wide area skills. They should have been worried about Hurent.\n\n*Thud.*\n\n\"Eek?\"\n\n*Thud.*\n\n\"Huk!\"\n\n*Thud.*\n\n\"Heeeok!\"\n\n\"...\"\n\nAt present, the number of viewers for Bunny Bunny's broadcast had reached 300,000. The first user to become a duke, Grid, and the prince of a kingdom were fighting. It was a hot topic that caused audience interest to explode.\n\nAs hundreds of thousands of viewers watched, Hurent was defeated by a farmer. He was hit in the forehead three times by a hand plow and became a rag. It was a shocking event that would cause waves beyond the legendary '5 second logout' incident.\n\nThe world was in an uproar. News related to Grid played unceasingly in South Korea as well as around the globe.\n\n> **Duke Grid Has the Strongest Soldiers!**\n>\n> **The Crazy Farmer of Reidan Wasn't a Rumor. He Actually Exists.**\n>\n> **Even the Farmers of Reidan Are Strong. What Is Reidan's Actual Strength?**\n\n\"This war hasn't revealed Duke Grid's real power. Jishuka, Regas, Pon, and the other Overgeared members didn't participate.\"\n\n\"Grid's actual power must be several times stronger than what was shown here.\"\n\nVarious media outlets and public opinion concentrated not just on Grid, but on Grid's forces. Numerous experts rated Grid's power as two or three times what was shown. But they didn't know. Two times? Three times? How laughable. After merging with the Silver Knights Guild and obtaining Yura, Grid was ten times stronger than what he showed in the war.\n\nEven now, Grid's strength was increasing by leaps and bounds.\n\n\"Let's build a temple for Goddess Rebecca in Reidan.\" Damian, the 14th Pope and the first user to acquire the status of pope, was trying to start his first foreign activity after stabilizing the church.\n\n***\n\nThe spacious fields of Reidan stretched out beneath a cloudless sky.\n\nHurent hadn't been able to stretch his back for hours already. There was no time to breathe, thanks to Piaro's thorough supervision.\n\n\"Don't bend your knees when bowing your back.\" Piaro circled him like a hawk.\n\nFurthermore, Piaro had too many unnecessary requirements. Hurent was exhausted. He couldn't bear it anymore.\n\n\"Don't bend my knees when bowing my waist? Isn't that too hard? It's complete torture!\"\n\n\"Hard work is the way you train your body. If it's easier, your body won't be trained and you might be hurt in the long run.\" Piaro tapped the ground with his hand plow for emphasis.\n\n\"...I see.\"\n\nHurent was confused. Wasn't he a prisoner? But he was being trained rather than treated as simple labor. In fact, the rewards for the **★Hidden Quest★ Fun and Exciting Training!** were of immense value.\n\n\"Why are you being so good to me? Do you plan to make me Grid's subordinate? It won't work. I will never be Grid's subordinate. My goal is to make Grid kneel within four seconds.\"\n\nPiaro explained calmly. \"In one week, I will be heading into Altes Mountain to do mass-scale land clearing. My goal is to train you as much as possible by then to make you the best labor force.\"\n\n\"...Dammit. I knew it. You wouldn't do this for no reason.\"\n\nHurent grumbled but followed Piaro's instructions. He couldn't help it when looking at the quest reward. The moment he was immersed in the rice planting, a new figure appeared.\n\n\"It's been a long time, Brother.\" A man with his face and name deeply covered by a straw hat arrived. He walked across the fields in a leisurely manner and gave a friendly greeting to Piaro.\n\n\"You have grown!\" Piaro straightened, his voice carrying genuine excitement.\n\n*I don't know who he is, but I feel sorry for him.* Hurent shook his head. Piaro was a crazy farmer who attacked people for no reason. The foolish man who greeted Piaro would be attacked next.\n\nPiaro's hand plow attacks were quick and irregular. Even an aura master couldn't match them. Hurent predicted that the man in the straw hat would have his forehead struck by the farming tool.\n\nHowever, the result was different from what he expected.\n\n*Clang!*\n\nA beautifully shining white sword easily blocked Piaro's hand plow.\n\n\"Heok.\" Hurent's jaw dropped.\n\nThat crazy farmer's hand plow could be blocked? Hurent was astonished. Piaro cried out, his eyes gleaming.\n\n\"You have far exceeded my past self!\"\n\nThere were only two people who had ever made Piaro feel thrilled. Pagma's Descendant Grid and White Swordsman Kraugel. That's right. The identity of the man in the straw hat was the 1st ranked user, Kraugel.\n\n\"I'm stuck at the last wall blocking my ultimate goal.\" Kraugel's voice was steady. \"I'm asking for a spar with you in order to break that wall.\"\n\nThe peak of two billion users. A unique existence who gobbled up all types of titles. He was trying to get ahead of everyone else.\n\nAnd on this day, it was the historic first meeting between Grid and Kraugel. It was a turning point for both men.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}