{
  "id": 348,
  "title": "Chapter 348",
  "content": "# Chapter 348\n\n\"I'm stuck at the last wall blocking my ultimate goal. I'm asking for a spar with you in order to break through.\"\n\nPiaro's eyes narrowed. \"The ultimate goal you seek.\" He paused, weighing his next words carefully. \"Could it be...?\"\n\n\"Becoming a Sword Saint.\" Kraugel's answer came without hesitation. \"That's right.\"\n\nA low chuckle escaped Piaro's lips.\n\nSword Saint. The title belonged to those who reached the absolute pinnacle of swordsmanship and transcended human limits through enlightenment. The last to bear that name was Muller, who single-handedly suppressed and sealed the great demons: Hell Gao, Drasion, Morax, Astaroth, and Purpu.\n\nA hundred years had passed since then. No one had achieved what Muller had. And now, here stood Kraugel, reaching toward heights that even Piaro himself had failed to attain.\n\n*He has the talent for it.*\n\nPiaro remembered their first meeting. Kraugel's raw potential had astonished him then. It surpassed even those who were lauded as the continent's strongest swordsmen. From the very beginning, Piaro had known. If anyone would one day eclipse him, it would be this man.\n\n*But still.*\n\nAn unfamiliar irritation coiled through his chest.\n\n*I never even glimpsed the threshold.*\n\nHis heartbeat accelerated. Blood rushed hot through his veins like molten lava. The fighting spirit he'd buried since becoming a farmer writhed back to life, wild and demanding.\n\n\"Are you qualified?\" Piaro's voice carried an edge of challenge.\n\nDid Kraugel truly possess what it took to achieve something beyond even a legend's grasp? \n\nKraugel met his gaze without flinching. \"Check for yourself.\"\n\nJust as Piaro had always been the strongest in his era, so too did Kraugel stand at the peak of his own. He was the summit above two billion users. His pride and passion burned bright, recognizing no one as his superior. To him, Piaro was both friend and mountain. Someone to respect. Someone to surpass.\n\n\"I will apply for a spar. Do you accept?\"\n\nPiaro nodded. \"Of course.\"\n\n> [Sword Saint]\n> \n> Difficulty: SSS\n> \n> Win against a legend.\n\nThe quest's simplicity belied its absurdity. Defeat a legend while not being one yourself? The very premise defied logic. And yet...\n\n*Interesting.*\n\nRather than despair or frustration, anticipation sparked through Kraugel. New challenges were fuel for his passion.\n\nNearby, Hurent stood frozen in disbelief. \n\n*Sword Saint? That's a class? It can't be!*\n\nOnly one other person had ever been confirmed as a Sword Saint candidate. Hurent stared at the man in the straw hat, hunger in his eyes. *I need to see this. I need to witness what a Sword Saint candidate can do.*\n\nHe slipped away from the field, following Piaro and Kraugel at a careful distance.\n\n***\n\n\"Stab!\"\n\n\"Hiyah!\"\n\n\"Cut!\"\n\n\"Hah!\"\n\n\"Chop!\"\n\n\"Hurrah!\"\n\nThe war ten days past had awakened something in Reidan's soldiers. Gone were the days of half-hearted complaints during training. They had felt the terror of battle, the fragility of life. They needed strength now. Strength to protect their families, their homes, their lovers and friends.\n\nPurpose drove them harder than any commander's orders ever could. Even without Asmophel's harsh discipline, the soldiers threw themselves into training with fanatical intensity, always demanding more.\n\nTheir resentment toward Grid had melted away, replaced by loyalty deeper than before. He had prepared them for invasion, danced magnificently across the battlefield, and gifted them the powerful Mass Produced Grid Set. The soldiers felt nothing but respect and gratitude.\n\n\"How about it, young lord?\" Asmophel gestured toward the training field with unmistakable pride. \"These brave men are Duke Grid's soldiers. Quite reliable, wouldn't you say?\"\n\nLord observed from Ruby's arms. His small face scrunched up.\n\n\"Abu... bububu.\"\n\n*What?*\n\nAsmophel blinked. The baby's expression was unmistakably... dismissive. As if he were saying, *The level of these soldiers is poor.*\n\n*Did the young lord just understand me? And respond?*\n\nMore than that, could an infant evaluate a soldier's combat prowess? For that matter, when did babies learn to sigh?\n\n*I must be imagining things.*\n\nConfusion swirled through Asmophel's mind. Ruby smiled gently at his bewilderment.\n\n\"My nephew isn't even a month old yet. How could he understand your words? Don't read too much into a baby's reactions.\"\n\n\"Right. Yes.\" Asmophel nodded slowly, trying to convince himself. *Just my imagination.*\n\nAt that moment, Lord's tiny finger pointed toward the magic tower.\n\n\"Oh my, do you want to see where the magicians are?\" Ruby cooed.\n\nLord nodded.\n\nAsmophel's blood ran cold.\n\n*He really does understand us!*\n\nThe rumors claimed Lord was a genius, but Asmophel had assumed they were exaggerations. Proud parents always thought their children exceptional. But this? Communicating with adults less than a month after birth?\n\n*There's no doubt. He'll become an outstanding scholar or magician in the future.*\n\nIt made sense, didn't it? Lord showed no interest in Reidan's soldiers because he lacked the eyes to see martial prowess. \n\n*He was born with intelligence, not the vision for combat.*\n\nAs this thought crystallized, Piaro approached.\n\n\"I need to use this place. Can you ask the soldiers to leave?\"\n\nAsmophel frowned. Piaro should have been working the fields at this hour. \"What for?\"\n\nPiaro indicated the man in the straw hat beside him. \"I'm going to spar with this friend.\"\n\nInterest flickered across Asmophel's face. He studied Kraugel for a moment, and his eyes widened slightly.\n\n*I can't measure his depth.*\n\nThat had only happened once before. With Piaro himself.\n\nAsmophel checked the training schedule and turned to the soldiers. \"Go run around the desert. Once.\"\n\nThe desert surrounding Reidan stretched for miles. It was an absurd order. Yet the soldiers' response came without hesitation.\n\n\"Yes, sir!\"\n\nThey would run until they dropped. This was the spirit of Reidan's soldiers now. They prepared immediately and departed the training grounds under the midday sun.\n\nThe vast field, built to accommodate thousands, now held only six people: Piaro, Kraugel, Asmophel, Ruby, Lord, and one uninvited guest.\n\nHurent thought he'd hidden well, but Asmophel had noticed him from the start. The commander approached the tree where Hurent lurked.\n\n\"Outsiders aren't permitted here.\"\n\nHurent jumped. He'd suppressed his aura as much as possible, yet this man detected him instantly? *This Asmophel is as much a monster as Piaro.*\n\n*Where does Grid find all these people?*\n\nHurent was a famous ranker, but his experience with named NPCs remained limited. The idea of recruiting them as subordinates had never even crossed his mind. Named NPCs wielded tremendous influence over Satisfy's world. Each possessed a distinct personality. Befriending them was nearly impossible.\n\n\"Aren't you leaving?\" Asmophel's voice cut through Hurent's admiration.\n\n\"Well...\" Hurent hesitated. He desperately wanted to observe the man in the straw hat. \"Can't I just watch? Just for a little while?\"\n\nAsmophel's gaze turned glacial. \"Why would I grant such a favor to an outsider?\"\n\nHe disliked repeating himself. Under that cold pressure, Hurent shrank back. Heat spread through his body.\n\n*I'm an Aura Master now. When did I become so timid?*\n\nAfter Grid crushed him in five seconds at the First National Competition, Hurent had hunted and trained obsessively. He'd elevated his aura to Unique rating. He'd believed himself the strongest, convinced he could defeat even the famous Kraugel and Agnus. His confidence had soared to the heavens.\n\nThen Piaro shattered it. A legendary farmer subdued him with three casual blows of a hand plow. The experience forced Hurent to question everything he thought he knew about strength.\n\n\"I'll leave.\" The words tasted like ash.\n\nFor the first time in his life, Hurent acted meek as a lamb. He swallowed his shame and departed the training ground, mind churning with questions. He'd always reigned supreme except for that one five-second humiliation. Why was he so weak here?\n\nThis Reidan. It was extraordinary. Like stepping into a twisted wonderland.\n\n***\n\nSaintess Ruby.\n\nGrid's younger sister. A high school student whose real goal was getting into a prestigious university. Game time was a luxury she couldn't afford. She logged in for perhaps thirty minutes a day. Even with her hidden class obtained alongside Yerim, her level remained low. She was the definition of a casual player.\n\nRecently, though, something had changed. Lord's birth had shifted her priorities. He might be just an NPC, a character in a game, but he was also her adorable nephew. Ruby found herself logging in for over an hour daily just to spend time with him.\n\nToday was no different. She held Lord in her arms, enjoying a peaceful moment. Lord basked in his beautiful aunt's presence, inhaling her soft, pleasant scent. But babies had their limits.\n\n\"Mmm.\" Lord yawned.\n\nNaptime.\n\n\"I should log out now.\" Ruby prepared to leave the training ground.\n\n**CLANG!**\n\nKraugel and Piaro's blades met.\n\n\"Abu?\"\n\nLord's drowsiness evaporated.\n\n\"Abu! Abuuu!\" He waved his short arms excitedly, blue eyes locked on the two combatants. His gaze shone with unprecedented intensity.\n\nAsmophel watched in astonishment.\n\n*The young lord!*\n\nHe didn't dismiss Reidan's soldiers as inadequate because he lacked the ability to perceive martial skill.\n\n*His standards are simply too high!*\n\nThe man in the straw hat wielded his sword against legendary Piaro. That clash captivated Lord's complete attention. Asmophel trembled, unable to fathom what kind of existence this child would grow into.\n\n\"Abuoo!\"\n\nLord's emotions swelled as he watched. Something within him stirred and grew. His infant instincts recognized a fundamental truth.\n\nOne of his future seven mentors stood before him.\n\n---\n\n**Glossary of Common Korean Terms**\n\n**OG**: Glossary Link\n\n**Current schedule**: 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}