{
  "id": 35,
  "title": "Chapter 35",
  "content": "# Chapter 35\n\n\"A legendary class at level 21?\" Yoon Sangmin stared at the data display. \"How is this even possible? His ability to avoid leveling is truly remarkable.\"\n\nHe didn't bother hiding his disdain. Shin Youngwoo's game history painted a clear picture: a young man with zero talent for gaming. Giving him a legendary class was like casting pearls before swine.\n\n*This person will never become a ranker. Not in his entire life.* Yoon Sangmin clenched his jaw. *Because of his interference, massive amounts of content regarding the legendary class are being consumed. Now he's about to waste another major game event.*\n\nDirector Yoon Sangmin was certain of it.\n\n*Poison. This person is deadly poison to Satisfy. We need to stop his account before he does more harm.*\n\nBut he lacked the authority to manage user accounts directly. The thought festered in silence. Yoon Sangmin swallowed his curse and turned to Yoon Nahee with a sharp look.\n\n\"Why does the quest have a 9% success rate? There's a 9% chance this person rescues Allunbatar?\" He shook his head. \"Nonsense. The real probability is 0%.\"\n\nThe other executives murmured agreement.\n\n\"The figure is obviously wrong.\"\n\n\"Exactly. The supercomputer Morpheus must be infected with a virus.\"\n\nThe quest was doomed. A level 21 user rescuing Allunbatar? Impossible. The publicity campaign had already concluded. Everyone shared the same grim assessment.\n\nEveryone except Lim Cheolho.\n\n*The protagonist of three major events in succession.* The chairman leaned back in his chair. *Since becoming a legendary class, he's crafted epic-rated arrows and received the class quest. I find myself oddly expectant toward this young man.*\n\nTo put it bluntly, Shin Youngwoo's incompetence defied common sense so thoroughly that predicting his actions became impossible. He created variables. Chaos. Entertainment.\n\nLim Cheolho smiled, regardless of the quest results. The other executives, including Park Eunhyuk and Yoon Sangmin, seethed.\n\n***\n\nI met Khan first. Before Huroi even showed up.\n\nI protected Khan's smithy. Paid for his medical treatment. I was his benefactor in every sense of the word.\n\nAnd Huroi? That bastard just talked to Khan for a few minutes.\n\n\"Then why?\"\n\nWhy did Khan hand him the massive 'For the Residents of Winston' quest? Meanwhile, I got a measly 600 gold reward.\n\n*Shouldn't he give me all the quests?*\n\nIf Khan knew how to repay favors, he would've passed everything to me. But no. The ungrateful bastard chose someone else.\n\n\"Khan should repay the favor.\" I poured another shot of shochu. \"Is he crazy? Do I need to act better around NPCs? Put on a performance?\"\n\nThe more I thought about it, the worse it felt. 'For the Residents of Winston' was a massive quest that would determine Winston's entire fate. Obviously Khan would give it to the person he trusted most.\n\nBut his choice was Huroi. Some stranger he'd never met before.\n\nThat meant I ranked lower than a complete stranger.\n\n\"Why is some random dog more credible than me?\" I grabbed the bottle. \"Ugh!\"\n\nThe street stall near my house smelled like grilled meat and desperation. I sat hunched over the counter, nursing my resentment with bitter shochu.\n\nMy usual limit was one and a half bottles. But tonight, disappointment in Khan and jealousy of that jerk drove me past three.\n\n\"Kuaaah!\"\n\nI emptied the third bottle. My heart still ached.\n\nThe more I thought about it, the more I hated Khan. I truly believed we'd become real friends during our time together. But Khan thought differently. Khan didn't trust me.\n\n\"Why? Why didn't he trust me?\" My voice cracked. \"Why give a good quest to that other guy instead? Damnnn!\"\n\nTomorrow it would rain for three days. No construction work. No reason to stay sober.\n\nI raised my hand. \"Lady.\"\n\nThe middle-aged woman cutting soondae flinched at my call. Her eyes flickered when they met mine.\n\n*Is my charm maximized by this lonely aura I'm emitting?*\n\nThe loneliness in my eyes could freeze Mount Everest. Looking at those quivering eyes, she seemed confused about being attracted to someone her son's age.\n\n*I'm such a sinful man.*\n\nI felt sorry for her, but I had no interest. Especially not in a married woman.\n\n*I can't break apart a family.*\n\nI cut to the chase before she developed expectations.\n\n\"One more bottle of shochu. Can I get a refill of the fish soup? Don't forget to add a piece of radish as a service.\"\n\nKwaang!\n\nThe woman slammed her knives into the chopping block. She pointed at me.\n\n\"You're really too much! I don't care about three bottles of shochu, but I already said no more fish soup refills after the ninth time!\" Her voice rose. \"And you ask for service every single time! The total value is more than what you're drinking. How can a young man have no shame?\"\n\n\"You're very inhospitable.\" I waved dismissively. \"At the very least, you should serve your customers fish soup. This world disappoints me. Just like Khan.\"\n\n\"What are you saying? I can't afford more free refills!\"\n\nShe was stubborn. My plan to fill my stomach with fish soup died.\n\n\"Time to say goodbye and return to cruel reality.\"\n\nI gave up and stood. The money went on the table. I mumbled a farewell and left the stall. Behind me, an angry voice echoed.\n\n\"Hey, young man! You're short 1,000 won! Give me 1,000 won!\"\n\nAh. I counted wrong because of the alcohol.\n\n*This is a chance to save 1,000 won.*\n\nIn the past, saving money never crossed my mind. But now, drowning in debt, conservation became unavoidable. As the number of thrifty young people grew, Korea's future would brighten. For my savings and Korea's future, I needed to avoid paying this 1,000 won.\n\n*No. No matter how drunk I am, I can't run away. Security cameras. Police station.*\n\nBeing arrested over 1,000 won would be shameful beyond measure.\n\nI turned around and handed her the bill.\n\n\"If I was a common person in modern society, I would've run away without paying. But I returned.\" I tried to smile. \"Isn't it wonderful?\"\n\n\"Don't most people act like this?\"\n\n\"You're not aware of the world. Do you know how many immoral people exist these days? People like me are rare!\"\n\n\"R-Really? I understand. Just go home. You're drunk.\"\n\n\"You don't understand! Do you know how bleak my heart is?\" I gestured broadly. \"You should pack some fish soup for a young man nice enough to pay 1,000 won in this chilly weather.\"\n\n\"...\"\n\nThe woman returned to her stall without another word. I waited for her to emerge with fish soup. Five minutes passed. Then ten.\n\n\"Haha.\" The laugh came out hollow. \"Once again, I've been betrayed. NPCs and people alike betray my faith!\"\n\nYes. This was a bitter world. I walked home, realizing I was alone.\n\n***\n\n\"You should contact me if you're returning late! Do you know what time it is?\"\n\nOne in the morning. Sehee sat in the living room, the TV flickering. Her expression was fierce.\n\n\"Have you been drinking until now? You don't have a girlfriend or friends.\" She crossed her arms. \"Don't tell me you were drinking alone. Aren't you embarrassed?\"\n\n\"Hey, you have school tomorrow. Why aren't you asleep yet?\"\n\n\"I was worried when someone who only spends time at work or in his capsule suddenly disappears.\" She looked away. \"It's strange!\"\n\n\"Are you concerned about me? You waited up this late?\"\n\n\"What? Who was waiting? I was just watching a fun TV program and couldn't sleep.\"\n\n\"Then why are you so mad? Your face is red. What did I do wrong?\"\n\n\"Whose face is red? That's ridiculous. I'm going to sleep now!\"\n\nKwang!\n\nSehee stormed into her room.\n\n\"Teenage girls are really difficult.\"\n\nHer loud voice had broken through my drunken haze. I became mad all over again about missing the 'For the Residents of Winston' quest.\n\n\"Damn. I'm going to sleep.\"\n\nSehee's door opened again. She approached and started nagging.\n\n\"You should brush your teeth and scrub your feet. You're drunk, so don't take a shower.\" She frowned. \"Well, I never expected you to shower anyway. You're not the type to shower every day.\"\n\n\"Aren't you sleeping?\"\n\n\"I'm going to drink water first.\"\n\n\"Then go drink water. Good night.\"\n\nSehee headed toward the kitchen while I stumbled into the bathroom.\n\n\"I'm not a child who needs to brush three times a day.\"\n\nI reached for my toothbrush, then stopped. My eyes kept closing.\n\n*I won't die if I don't brush for one day.*\n\nI washed my hands and left the bathroom. Straight to my room. Sehee's voice rose outside my door, but I ignored it and collapsed onto my bed.\n\nThe day was over.\n\n---\n\n**Glossary of Common Korean Terms**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week  \n\nCheck out my Patreon for early access to a certain number of unedited chapters and to achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}