{
  "id": 350,
  "title": "Chapter 350",
  "content": "# Chapter 350\n\nPiaro's hand moved to the farming tool at his side.\n\n\"Pounding Mortar.\"\n\nThe ground screamed. Not thunder. This was something worse, something deliberate and wrong. The air itself grew heavier as the shadow above expanded, swallowing the sun.\n\nKraugel's instincts shrieked at him to move. His body refused.\n\n*Unbelievable.*\n\nThe earth bucked beneath his feet. He looked up. A mortar the size of a manor house plummeted toward him, tearing through the air with a sound like the world splitting open.\n\nHe tried to scream. Nothing came out.\n\n***\n\n> [You have been hit by a lethal blow!]\n>\n> [The durability of the <span class=\"rarity-common\">Plain Straw Hat</span> has been completely lost and is permanently destroyed.]\n>\n> [The durability of the <span class=\"rarity-uncommon\">White Clouds Clothing</span> has decreased by 128.]\n>\n> [The durability of the <span class=\"rarity-uncommon\">White Clouds Footwear</span> has decreased by 150.]\n>\n> [The durability of the <span class=\"rarity-uncommon\">White Clouds Gloves</span> has decreased by 163. There is a risk of damage.]\n>\n> [The durability of the <span class=\"rarity-legendary\">White Fang</span> has decreased by 61.]\n>\n> [You won't die in sparring mode. Your health has fallen to a minimum, so sparring mode is finished!]\n\nThe mortar vanished like steam. Where it had struck, the training ground was a crater ten meters deep. Above, the sky was clear and cloudless. The shockwave from Pounding Mortar had torn them to shreds.\n\nKraugel lay flat on his back. His lips moved.\n\n*I lost.*\n\nNot because Piaro was over level 400. Levels were just numbers, a reflection of time invested and obstacles overcome. The truth was simpler.\n\n*I lost because I'm not good enough yet.*\n\nIf they fought tomorrow, next week, next month, the result would be identical. Piaro had transcended the swordsman who once relied purely on technique. He'd become something Grid's farmer had called a legend, something complete.\n\n*A wall I can't climb.*\n\n*Not yet.*\n\nHis straw hat disintegrated, revealing black hair and a face marked with fresh cuts. Blood trickled into one eye. Kraugel blinked it away and started laughing.\n\n\"Kuk... kukukuk.\"\n\nThe laughter built, echoing across the ruined training ground.\n\n\"Kuhahahaha!\"\n\nPure and unforced. The sound of a man who'd just found a new mountain to conquer.\n\n***\n\nRuby clutched Lord at the edge of the training grounds, fifty meters from where Piaro and Kraugel had been fighting. When the mortar fell, the world turned sideways.\n\nAsmophel was there before the shockwave hit. His arms wrapped around them both as the ground tried to shake them apart, his body a wall against the sandstorm that followed.\n\nRuby's ears rang. \"T-Thank you.\"\n\n\"Abuuuu!\" Lord wailed.\n\n\"This world might perish, but I will protect both of you.\" Asmophel's voice was flat, absolute.\n\nRuby's heart skipped. *Such loyalty.*\n\nLord, by contrast, showed zero interest in his savior. His tiny fists pushed against Ruby's chest until she loosened her grip. The moment his hands touched dirt, he started crawling.\n\n\"Abu! Abuuuu!\"\n\nToward the crater. Toward Kraugel.\n\nRuby lunged for him. \"Lord, wait—\"\n\nToo late. The baby moved like a hamster on stimulants, knees and elbows pumping with inhuman speed.\n\nPiaro wiped sweat from his brow. The technique had drained him more than expected, his stamina bar hovering at forty percent. Movement at the crater's edge caught his attention.\n\n*The young lord?*\n\nPiaro's pulse quickened. Lord had witnessed his strength, had seen what separated a legend from ordinary men. *He recognizes my skill. He wants me to teach him.*\n\nLord reached Piaro's feet and kept crawling.\n\nPast him.\n\nStraight toward Kraugel.\n\nThe wind picked up. A tumbleweed rolled by.\n\nPiaro's eye twitched.\n\n***\n\nKraugel sat up, ribs protesting, and found a baby crawling toward him with single-minded determination. He blinked. Once. Twice.\n\n*Am I hallucinating from head trauma?*\n\n\"Abu! Abuuuu! Bubu!\"\n\nLord reached him and stared up with eyes the color of the summer sky. Bright, piercing, utterly focused.\n\nKraugel didn't speak baby. But he understood the look.\n\n*Envy.*\n\nThe kid wanted what Kraugel had. Not items. Not stats.\n\nThe will to grow stronger.\n\n***\n\n> **[Thunder Bow]**\n>\n> **Rating:** <span class=\"rarity-uncommon\">Unique</span>  \n> **Durability:** 366/490  \n> **Attack Power:** 370~601\n>\n> * Arrows cannot be loaded.\n> * 100 mana will be consumed per attack.\n> * Generates the skill 'Penetrating Flash.'\n> * Firing speed +10%.\n>\n> *A heirloom of the Bon family in the Eternal Kingdom. The bowstring channels the user's mana to create arrows of pure lightning. Regular arrows turn to ash on contact.*\n>\n> **User Restriction:** Level 300+, **2,000 Agility**, Advanced Bow Mastery Lv. 5+.\n\nGrid turned the bow over in his hands. Viscount Ferrell's signature weapon. Half the archer population would kill for it.\n\n*Trash.*\n\nOne hundred mana per shot. Jishuka, the best archer in the world, had maybe four thousand mana. Forty shots before empty. The bow also had the durability of wet bread.\n\n*Attack power is decent, though.*\n\nHe dismissed the thought. For archers, the arrow mattered more than the bow. A fact this particular weapon ignored entirely.\n\n*Can't load arrows. What kind of bow can't use arrows?*\n\nGrid had only wanted it for one thing. He gripped the weapon by both ends and twisted. Wood splintered. Metal groaned. The bow came apart in his hands like a child's toy.\n\nThe four God Hands worked the bellows in perfect rhythm, maintaining the furnace at eighteen hundred degrees. Grid fed the bow's remains into the flames and waited.\n\n> [You have succeeded in refining the mineral!]\n>\n> [**3** pieces of <span class=\"rarity-rare\">Ure Stone</span> acquired.]\n\n> **[Ure Stone]**\n>\n> *A mineral that only manifests when the great demon Astaroth walks the mortal plane. Can imbue items with lightning properties. Demonic beasts find it delicious.*\n>\n> **Weight:** 5\n\nGrid read the description. Reread it.\n\n\"Feed it to a demonic beast?\"\n\nHe looked at the three purple-black stones in his palm, each worth at least fifty thousand gold on the open market.\n\n\"What kind of lunatic feeds minerals to a pet?\"\n\nNoe could starve. These were going into his next weapon.\n\nThe smithy shook.\n\nNot a tremor. A violent, sustained quake that sent finished blades clattering off display racks and knocked furnace doors open. Unattended flames belched upward, incinerating half-smelted ingots.\n\n\"Earthquake!\" someone yelled.\n\n\"Grab the minerals!\" Khan's voice cut through the panic.\n\nA hundred blacksmiths scrambled. Grid stood perfectly still, eyes narrowed.\n\n*Not an earthquake.*\n\nHis **Insight** stat painted the truth in his mind. Magnitude. Epicenter. Direction.\n\nSomeone was fighting. Someone strong enough to crack the earth.\n\n\"Khan.\" Grid's voice stopped the old blacksmith mid-step. \"Handle this.\"\n\nHe was already moving toward the door.\n\n***\n\nKraugel climbed to his feet, joints popping. His health bar was a sliver of red.\n\n\"Brother, you're incredible.\" He met Piaro's eyes. \"I learned more in five minutes than I have in five months. I mean that.\"\n\nPiaro's expression was unreadable.\n\n*This one will surpass me.*\n\nThe thought didn't sting. It was simply true. Piaro had spent decades chasing strength, and he recognized that hunger when he saw it. Kraugel had the same disease. The same refusal to accept limits.\n\n\"You will,\" Piaro said. \"Someday, you'll be stronger than me.\"\n\nThe baby had known. Lord had crawled to Kraugel, not Piaro, because even at three months old he understood who held the future.\n\nKraugel glanced down at the infant still gripping his pant leg.\n\n\"What's with this kid?\"\n\nA shadow fell across them both.\n\n\"My son.\"\n\nPiaro dropped to one knee. \"My Lord!\"\n\nAsmophel, ten meters away, did the same. \"I greet My Lord!\"\n\nKraugel's brain stalled. *Wait. What?*\n\nGrid scooped up Lord, who immediately started babbling and reaching for his father's face. The blacksmith's eyes flicked from Kraugel to the destroyed training ground to Piaro.\n\n\"What's the first-ranked user doing in my city?\"\n\nThe hostility was a physical thing, sharp enough to cut. Kraugel opened his mouth. Nothing came out.\n\nPiaro filled the silence.\n\n\"My Lord, this is Kraugel. A brother in arms. We haven't seen each other in some time, so I accepted his request for a spar.\" He gestured at the crater. \"The damage is my responsibility. I await your judgment.\"\n\nKraugel's chest tightened. *He's defending me.*\n\nThen Piaro's next words landed like a bucket of ice water.\n\n\"I will dispose of him according to your will.\"\n\n*Oh. Right. Not defending. Reporting.*\n\nGrid's stare could have melted steel."
}