{
  "id": 352,
  "title": "Chapter 352",
  "content": "# Chapter 352\n\nThe impact rattled Grid's bones as he slammed into the training ground floor. Dust erupted in a choking cloud around the crater his body carved into the earth.\n\nHe pushed himself upright, wincing. His health bar wasn't pretty, but it could've been worse. Much worse. The Holy Light Armor had triggered its damage reduction the instant Kraugel's kick connected, and Doran's Ring had restored a solid 13,000 health the moment he equipped it mid-flight.\n\nStill.\n\nGrid spat dirt and wiped blood from his lip. \"Should've saved the armor proc for a sword strike, not a kick.\"\n\n*Three times the healing. Wasted.*\n\n\"Isn't that right, Yakult?\"\n\nSilence.\n\nThe sword in his grip didn't respond. Iyarugt's presence retreated inward, sulking.\n\n\"What, no comeback?\" Grid rotated his shoulder, testing for breaks. \"You were useless against Piaro. Useless against Chucksley. Seeing a pattern here.\"\n\n[That is because my true power remains sealed!] The sword's voice exploded in his mind. [If I could demonstrate even half my original strength, these insects would be nothing!]\n\n\"Sure. Let's go with that.\"\n\nGrid wasn't entirely wrong to be harsh. Iyarugt sat at Unique rating. Once it climbed to Legendary, maybe the ego weapon would actually earn its keep.\n\n*But not today.*\n\nHe stood slowly, using the momentary reprieve to organize his thoughts. The battle-lust drained away, replaced by cold calculation. He couldn't rely on his immortality passive. Not here. Not against Kraugel.\n\n*This has to make me stronger.*\n\nGrid ran the numbers. *Blackening too early? No. Had to use it. Wouldn't have touched him otherwise.*\n\nThe skill consumed 50% of his maximum health in exchange for a 20% boost to damage, magic power, and agility. A double-edged blade. When the enemy landed a clean hit during Blackening, the damage multiplied into catastrophic territory.\n\n*The skill gap is too wide.* Kraugel dodged non-targeted skills like they were telegraphed days in advance, then countered during the recovery frames. *But our raw stats are closer than I expected.*\n\nThat surprised him. Grid had clawed through minus levels, stacked titles like a hoarder, and pumped stats with every crafted item. His stat total should've been untouchable.\n\nYet Kraugel matched him blow for blow.\n\n*Of course he does.* Grid's jaw tightened. *He's been rank one since the beginning.*\n\nFirst to everything. First to claim the game-breaking quests. First to acquire the overpowered titles. First to discover the hidden training methods. The advantages compounded into an insurmountable lead.\n\n*When I was level 80, struggling with basic smithing...* The memory tasted bitter. *Kraugel had already crossed level 240.*\n\nThe gap existed. Undeniable. Especially in combat technique, Kraugel stood in a different weight class.\n\n*And his gear.* White Fang alone rivaled Grid's legendary creations. The defense was lighter, sure, but that sword hit like a freight train.\n\n\"Still a long way to go,\" Grid muttered.\n\nThe thought of losing crept in.\n\nHis face twisted. Muscles bunched along his jaw, teeth grinding audibly. \n\n*No.*\n\nFor years, he'd been the loser. The untalented. The one who couldn't.\n\n*Not anymore.*\n\nHe'd overcome that gap through sheer, stubborn persistence. People could mock the idea all they wanted. Grid knew the truth. He'd earned Pagma's Descendant through blood, sweat, and refusing to quit when any sane person would've walked away.\n\n*I want this.*\n\nTo beat Kraugel. To topple the man praised as the sky above the sky. To prove that effort could match genius, that the title 'Legend' meant something beyond lucky class acquisition.\n\n*I want to be recognized.*\n\nBut wanting wasn't enough. Never had been.\n\n\"Round two.\"\n\nGrid's fingers moved through his inventory with practiced efficiency.\n\n> [<span class=\"item-grid-boots\">Grid's Boots</span> have been removed. Movement speed and evasion rate have been restored to normal.]\n\nFirst mistake, identified and corrected. The boots synergized with a greatsword's momentum. With Iyarugt's lighter, one-handed frame, they became an anchor dragging him down.\n\n> [<span class=\"item-brahams-boots\">Braham's Boots</span> have been equipped. Movement speed has increased by **10%**. Skill cooldown time will be reduced by **20%**.]\n\nThe legendary great magician's footwear settled onto his feet. Defense took a hit, but the utility made up for it. There was a reason Grid had never sold these.\n\n> [The spell 'Fly' has been used.]\n\nMagic ignited beneath him. Grid rocketed upward through the dust cloud, impossibly light, movements fluid in a way they hadn't been seconds ago.\n\n***\n\nAt the crater's edge, Kraugel gasped for air. Sweat stung his eyes.\n\nThen those eyes widened.\n\nThrough the settling dust, Grid rose. Flying. Health recovered. Aura sharpening around him like a whetted blade.\n\n*Is he even human?*\n\nThe question wasn't rhetorical. Kraugel's title collection read like a power fantasy wishlist. Sword Saint Candidate Stage 5. Virtuous Man of the West Continent. Pandea's Hero. Person who Creates Miracles. An endless string of 'First' achievements, each one representing a breakthrough that multiplied his strength.\n\nHis attack power existed in a tier most users would never witness, let alone survive.\n\nGrid had survived it. Repeatedly. And now he looked stronger than when the fight began.\n\n*Like a boss monster with adaptive phases.*\n\nKraugel's respect calcified into certainty. *He really is a legend.*\n\nThe community narrative played in Kraugel's head. Overgeared. Poor control. Coward hiding behind items and a broken class. Kraugel had watched the broadcasts, including Grid's clumsy speech at the papal candidacy. He'd absorbed the consensus.\n\nBut consensus was propaganda for the lazy. People grew. Grid had grown.\n\n*He hurt me.* That alone placed Grid in rarefied air. The number of players who'd landed meaningful damage on Kraugel could be counted on one hand.\n\n*He's not lacking in wit, either.* Grid fought smarter than his reputation suggested. *You don't stumble into a legendary class. You earn it.*\n\n\"I will sincerely pay my respects to my opponent.\" Kraugel raised White Fang. \"Meteor Sword.\"\n\nQi condensed in the air around him, each mote burning like a falling star. The skill he'd started earlier, interrupted by Blood Cry, roared to life.\n\nGrid began his counter. \"Pagma's Swordsmanship.\"\n\nThe sword dance initiated. Kraugel launched himself upward, trajectory calculated.\n\n*Predictable.* Grid possessed legendary skills and legendary items. Of course he'd trust them. Of course he'd meet Meteor Sword head-on, skill against skill.\n\n*That's your mistake.*\n\nMeteor Sword operated on multi-stage logic. Each successive strike hit harder than the last, damage scaling exponentially. Meeting it directly invited catastrophic punishment.\n\nThen Grid spoke a single word that shattered Kraugel's prediction.\n\n\"Transcend.\"\n\nThe atmosphere inverted. Kraugel's qi, mid-manifestation, warped as Grid drew it inward. The transcendent state bloomed around the blacksmith like a corona.\n\n*Second mistake.* Kraugel's thought remained clinical even as his strategy crumbled. *Engaging in direct skill exchange when I have superior control.*\n\n> [Entering the transcendent mode.]  \n> [Your attack power is doubled and your default attacks will turn into ranged attacks. This effect will last for **30 seconds**.]\n\nGrid didn't close the distance. He drifted backward through the air, Fly magic granting three-dimensional mobility. Space opened between them.\n\nThen he swung Iyarugt.\n\nA blade of black energy lanced forward, faster than Kraugel anticipated.\n\n> [You have suffered **10,700** damage.]\n\n\"Kugh!\" Blood erupted from Kraugel's mouth as the energy blade carved through his lighter armor. \n\n*Targeted skill.* The realization came with the pain. *Limited trajectory. Can't leverage my full control against...*\n\nAnother energy blade screamed toward him before the thought finished.\n\nKraugel hit the ground hard, rolled, came up moving. Three more blades already in flight, black death incarnate.\n\nHe threw himself sideways, activating a skill mid-dodge.\n\nWhite mist exploded from White Fang, blanketing the area in concealing clouds. Kraugel's form vanished into the haze.\n\nGrid's eyes narrowed. The Slaughterer's Eye Patch activated, overlaying trajectories and weak points across his vision. Combined with his Insight stat, the trick fell apart in seconds.\n\n*There.*\n\nGrid swung. Energy blades carved through the mist, tracking Kraugel's position with unnerving accuracy.\n\nExplosion after explosion rocked the training ground as the projectiles found their mark. Kraugel wove between them, impossibly fast, but Grid's concentration had sharpened to a razor's edge. He led the target, adjusted for reaction time, painted the area with destruction.\n\nOne blade clipped Kraugel's shoulder. Then another grazed his thigh.\n\n*This is different from Transcended Link.* Kraugel's mind raced through the data. He'd watched two of Grid's broadcasts. The only ranged attack had been Transcended Link, a burst skill. This was sustained pressure, a completely different tactical problem.\n\nThe rain of energy blades intensified. Kraugel adapted, reading the patterns, finding the gaps. His genius manifested as pure kinesthetic learning.\n\nThen the barrage stopped.\n\n*Duration expired.* Kraugel's legs coiled beneath him. He launched skyward, closing on Grid's airborne position.\n\nGrid smiled. The expression held no warmth.\n\n\"Fake.\"\n\nAnother blade materialized, point-blank range.\n\nTranscend lasted thirty seconds. Five remained on the clock.\n\nThe energy blade shrieked toward Kraugel's center mass. Airborne, his mobility options collapsed to near zero. Grid's smile widened.\n\n*Got you.*\n\nKraugel twisted. White Fang's flat reversed in his grip, slamming against empty air. The impact reversed his momentum, body rotating through an axis that shouldn't exist without flight magic.\n\nThe energy blade passed through space he'd occupied a heartbeat ago.\n\n*He dodged.* Grid's shock registered as a physical sensation, ice water down his spine. *In mid-air. Without flight. How?*\n\n\"Haaap!\"\n\nKraugel closed the final distance, White Fang descending in a perfect arc.\n\nThe legendary blade bit deep into Grid's chest. Blood sprayed.\n\nKraugel prepared the follow-up, already calculating the optimal combo chain.\n\nGrid spoke through gritted teeth. \"Third mistake.\"\n\nFour golden hands materialized.\n\nThe God Hands. Grid had used them for Magic Missiles. For wielding extra weapons. Simple applications.\n\n*This isn't simple.*\n\nThe hands blurred forward, speed eclipsing Grid's own swordsmanship by an order of magnitude. They clamped onto Kraugel's wrists and ankles with vice-like pressure.\n\nKraugel's eyes widened. *Caught.* He yanked against the grip, but the moment's hesitation created an opening.\n\nGrid's blade rose.\n\n\"Linked Kill.\"\n\nKraugel's mind screamed the counter. \"Super Sensitivity!\"\n\n> [The cooldown time of Super Sensitivity still isn't over.]\n\nTime crystallized. Kraugel saw his death approaching in high definition, saw every microsecond of the combo chain that would end him, and could do nothing.\n\nThe first strike punched through his guard.\n\n*Thud.*\n\nThe second followed before his body registered the first.\n\n*Thud. Thud. Thud.*\n\nKraugel's health bar evaporated. His body went limp in the God Hands' grip, then dissolved into gray particles as the system registered his defeat.\n\nGrid landed, breathing hard. Iyarugt thrummed with satisfied violence in his grip.\n\nBehind him, voices erupted. The Overgeared members had arrived, mouths hanging open, witnessing the impossible.\n\nJishuka stood frozen. Vantner's jaw worked soundlessly. Regas stared like he'd witnessed a magic trick he couldn't parse.\n\nIn Ruby's arms, Lord watched with eyes that gleamed like cut jewels. His small hands clapped together.\n\nThe perception locked into place in the child's developing mind, bedrock-solid and immovable.\n\n*Father is the strongest.*\n\nFor Lord Steim, future absolute power of the continent, the hierarchy of the world had been established.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**\n\n**Current schedule: 20 chapters a week.**\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}