{
  "id": 355,
  "title": "Chapter 355",
  "content": "# Chapter 355\n\nSeveral minutes of silence passed.\n\nVantner stared at the empty space where Kraugel had vanished, his jaw set. \"We should camp here until he logs back in.\"\n\nPon leaned forward. \"You thinking what I'm thinking? Soon as he appears, we grab him.\"\n\n\"Hell yes!\" Vantner slapped his thigh. \"We'll make him a slave of Overgeared!\"\n\n\"The 1st ranked user!\" someone else shouted. \"He'll join Overgeared!\"\n\nGrid's frown deepened as his guildmates descended into planning mode. \"Cut it out. Don't force it.\"\n\nJishuka's eyes widened.\n\n\"You want to miss the chance to recruit the best player in the world?\"\n\nThis wasn't like Grid at all. The man hoarded items like a dragon guarding treasure. By that same logic, he should be salivating over the prospect of adding Kraugel to his collection. The contradiction gnawed at her.\n\n*Does he have a personal grudge against Kraugel?*\n\nGrid turned to face the confused members of Overgeared. \"We can't build loyalty by kidnapping people.\"\n\nThere were exceptions. Lauel, for instance. But even that comparison fell apart under scrutiny. Lauel had been seduced by the promise of legendary items, drawn to Grid by a lust for power that aligned with what Overgeared offered. Kraugel was built differently. The man rejected organizations on principle, operated best as a lone wolf.\n\nForcing him into their ranks would be counterproductive at best.\n\n\"Besides, I already have the best colleagues.\" Grid's gaze swept across their faces. \"All of you. So stop obsessing over Kraugel.\"\n\nThe words carried no false modesty. Grid genuinely believed the people around him were enough to achieve anything. The absence of Kraugel barely registered as a loss. If anything, Grid had different plans for the 1st ranker.\n\n*Kraugel.*\n\nWalk your own path. Reach Sword Saint. Then, when we meet again...\n\n*Make me stronger.*\n\nThe spar had been educational in ways Grid was still processing. Kraugel's movements, his decision-making, the way he managed resources and exploited terrain. Every dodge, every strike, every tactical choice had burned itself into Grid's memory like a brand.\n\n*I can't replicate him overnight.*\n\nThat much was obvious. But Grid trusted in persistence. Keep working, keep grinding, and eventually he'd stand on equal footing with the genius. Maybe surpass him.\n\nThat's what this was. Rivalry. A stupid man challenging the peak? Some would laugh. Grid didn't care about eligibility or permission. He'd broken the sky above the sky once already. That achievement had forged something inside him sharper than the old arrogance he'd used to hide his inadequacy. This was pride. Real pride.\n\n***\n\nJishuka cornered Grid as they walked back toward the castle. \"Why didn't you call us when Prince Ren tried to invade Reidan?\"\n\nGrid blinked. \"You were busy with the vampire cities.\"\n\n\"That's not the point!\" Her voice rose. \"Do you know how insane it was to hear about the invasion from the news? Our territory was under attack, and I had to learn about it from a broadcast!\"\n\n\"Lauel handled it. There was no need to interrupt your hunting.\"\n\n\"You should call us regardless!\" Jishuka's fists clenched. \"What if something had gone wrong? What if you'd been in danger?\"\n\n\"...\"\n\nThe old Grid would've brushed it off. Made some flippant comment about summoning knights if things got bad. But that Grid was dead. The new version understood what Jishuka was actually saying beneath her anger.\n\n\"I'm sorry.\" Grid's tone softened, his eyes meeting hers. \"I didn't mean to leave you out. It wasn't about thinking you were useless or not trusting you. I was trying to help. But I see now that my choice upset you.\"\n\nThe apology landed cleanly.\n\nJishuka opened her mouth, then closed it. Words failed her.\n\n*He's getting harder to handle.*\n\nShe'd always been aware of Grid as a man. His flaws, his stupidity, his occasional childishness. Those qualities had made him feel young, accessible. But lately, especially since becoming a father, he'd been shedding those traits one by one. Responsibility had carved maturity into him like a sculptor revealing the statue hidden in marble.\n\nAnd she found herself attracted to this new version even more.\n\n*By the time he hits thirty, he'll be incredible.*\n\nThe thought of watching him grow into that potential made something warm bloom in her chest.\n\nLauel's approach interrupted her daze. He stopped in front of Grid, his expression unusually solemn.\n\n\"I'm sorry.\"\n\nGrid frowned. \"For what?\"\n\n\"I need to be honest.\" Lauel's gaze didn't waver. \"When I watched you fight Prince Ren's army, I still saw someone lacking. Someone who needed constant guidance. But today proved me wrong. You defeated Kraugel. The sky above the sky. I won't doubt your abilities again.\"\n\nTen months. Lauel had spent more than ten months following Grid in real time since the 1st National Competition. In all that time, the emotions in his eyes had never quite reached 'respect' or 'envy.' Strategy, yes. Calculation, certainly. But not genuine admiration.\n\nThat had changed.\n\n\"I, Lauel, will stop following you just for your items.\" His voice took on a theatrical quality that made Grid's skin crawl. \"From this day forward, I pledge my service with an honest and pure heart. This is the true oath of my soul, penetrating past and present, binding me to your destiny!\"\n\nGoosebumps erupted across Grid's arms.\n\nThe Overgeared members collectively cringed, their hands and feet shrinking as secondhand embarrassment washed over them. Most of them looked physically pained.\n\nHuroi alone stood with tears in his eyes, moved beyond words by the oath.\n\n***\n\nRewinding to the moment Grid had finished clearing Elfin Stone's vampire city.\n\n> [World Message: A user has been elected as Pope of the Rebecca Church!]\n\nJapan exploded.\n\nDamian. The exceptional paladin who'd clawed his way to 2nd in the rankings despite belonging to the garbage-tier Rebecca Church. He'd vanished from the leaderboards months ago, spawning theories about hidden classes and secret quests. Also, he was a hardcore otaku.\n\nAnd now he was Pope.\n\nThe Japanese gaming community lost its collective mind. The 1st National Competition had been a disaster for Japan, yielding zero medals and national humiliation. Damian's ascension felt like redemption, a savior rising from the ashes.\n\nNews stations scrambled to secure interviews.\n\n\"Damian! Congratulations on your election as Pope!\" The interviewer's enthusiasm bordered on manic. \"The entire nation is proud! Please, tell us how difficult the journey was. What trials did you overcome to achieve something so historic?\"\n\nThe Rebecca Church wielded serious political power. Pope-level authority meant even kings had to bow. Japanese players expected Damian to leverage this for their benefit, creating policies that would catapult Japan's Satisfy presence to new heights.\n\nThen Damian opened his mouth.\n\n\"I only became Pope thanks to Grid.\"\n\nThe interviewer's smile faltered. \"The legendary blacksmith Grid? We know there was a battle between Grid and the Red Knights during the candidate speeches. Is that the help you're referring to?\"\n\n\"It's more than that.\" Damian's expression was earnest to the point of pain. \"From beginning to end, I became Pope entirely because of Grid's assistance.\"\n\nGrid's popularity had been climbing steadily in Japan. The white-haired version of him that appeared during certain battles had spawned a massive fandom, enough to qualify as the 5th Korean Wave. But the Korean Wave had always been a niche phenomenon, embraced by a minority while the mainstream ignored it.\n\nThe extreme right-wing Japanese netizens, in particular, wanted nothing to do with Korean culture.\n\nDamian's constant praise of Grid, the man who'd crushed Japanese rankers at the National Competition, sparked immediate backlash.\n\nOnline forums ignited.\n\n\"Why is Damian crediting all his achievements to Grid?\"\n\n\"Doesn't he remember how much Grid humiliated us at the Competition?\"\n\n\"Grid is our enemy! He destroyed our rankers and was involved when the Sakura Guild attacked the Silver Knights!\"\n\n\"Damian must be Zainichi!\" The accusation spread like wildfire. \"No true Japanese would praise Korea's hero like this!\"\n\nThe conspiracy theories multiplied. Damian was secretly Korean. Damian was trying to improve Korea's image in Japan. Damian was a traitor.\n\nThe extreme right-wing propaganda machine worked overtime.\n\nDamian didn't flinch. He'd spent his life being mocked for his otaku hobbies. Internet hate was background noise.\n\nAnother interview, this time with a hostile anchor.\n\n\"Rumors are spreading that you're Korean, not Japanese. What's your response?\"\n\nDamian's expression remained flat. \"I'm a pure-blooded Japanese citizen.\"\n\n\"Yet you mention Grid in every single interview. You constantly portray Korea in a positive light. Many people question your intentions.\"\n\n\"I've never portrayed Korea in any particular light. I thanked Grid. Some people chose to misinterpret that.\"\n\nThe anchor leaned forward, aggressive. \"Your image is damaging our country. To fix this and prove your loyalty, why not build Rebecca Temples in Japanese territories?\"\n\n\"Temples require strict conditions to be built in specific areas. I can't just construct them because we share nationality.\"\n\n\"So you have no intention of helping Japan after becoming Pope?\"\n\n\"None.\" Damian's bluntness was refreshing. \"What does being Pope have to do with Japan? The position requires neutrality.\"\n\n\"I see.\" The anchor's smile was shark-like. \"Then what's your first official act as Pope?\"\n\n\"Building a Rebecca Temple in Reidan.\"\n\nThe anchor pounced. \"Wait. Didn't you just say strict conditions had to be met? Reidan's population is only 20,000. That doesn't meet the requirements. You claim neutrality, but you're blatantly favoring Grid!\"\n\nFuji TV. One of Japan's leading right-wing media outlets, with an anchor who represented the extreme faction. He'd structured this entire interview as an ambush, designed to corner Damian and force a retraction.\n\nA normal person might have buckled under pressure. Might have feared retaliation from the right-wing machine.\n\nDamian was not normal. Otaku convictions didn't bend easily.\n\n\"I'm not showing favoritism. I'm repaying a debt.\" His voice rose with passion. \"Grid saved me and the entire Rebecca Church! Goddess Rebecca herself gave me a divine message to repay his grace! Praise God Grid!\"\n\nThe anchor's face went blank.\n\n\"...\"\n\nAcross Japan, extreme right-wing netizens screamed at their screens.\n\n\"Crazy bastard!\"\n\nThe fury was instant and scorching. Japan had finally produced a figure of real power in Satisfy, and he refused to help his own people. Worse, he actively praised their Korean rival.\n\nIn dark corners of the internet, a terrible plan began to take shape."
}