{
  "id": 356,
  "title": "Chapter 356",
  "content": "# Chapter 356\n\nWhat was the terrible plan hatched by Japan's right-wing forces?\n\n\"We'll kill Damian. Show him fear and despair so he never speaks Grid's name again.\"\n\n\"Tame him. Use him to strengthen our guilds.\"\n\n\"Support our rankers for the next National Competition. Ten Rebecca healers per fighter. Who could stand against that?\"\n\nIn the name of patriotism, they plotted to dominate another person's life through force. A complete violation of human rights. A terrifying idea.\n\n*I want to step on Grid.*\n\nThat thought consumed them. Yet the Japanese right-wing forces had no intention of actually touching Grid. The Seven Guilds lacked the power to threaten him. They couldn't even if they wanted to.\n\nWeak to the strong. Strong against the weak. Like their mass protests against Korea contrasted with their small anti-China demonstrations, Japan's extreme right-wing forces chose what they believed was the wise path.\n\nGrid was the fundamental problem. They turned away from him. They aimed their arrow at the relatively weaker target instead.\n\nDamian.\n\nBut they overlooked something critical.\n\nDamian was never weak. He might have operated as an unofficial ranker for nearly a year, but he'd originally been a high ranker. The first person to obtain a unique hidden class. Now he'd become Pope.\n\nHe was definitely one of the strongest people.\n\nHowever, compared to Grid...\n\n***\n\nLauel maintained constant awareness of international affairs.\n\nCollecting information while playing Satisfy was a basic skill. Understanding each country's issues proved invaluable for intelligence gathering.\n\n\"What?\"\n\nEarly morning. Before accessing Satisfy, Lauel scanned overseas topics. His eyes widened at news from Japan.\n\n**[Pope Damian Announces Plan to Build Goddess Rebecca Temple in Reidan!!]**\n\n\"This idiot!\"\n\nLauel's expression twisted. He'd advised Damian multiple times. The cooperative relationship between Overgeared and the Rebecca Church needed to proceed discreetly.\n\nDuring Damian's campaign, Grid and Huroi had acted as carefully as possible. They'd tried helping Damian while avoiding attention. On the day of the papal candidate speeches, they'd accidentally appeared on air, but there was no question they'd been trying their best.\n\nNow Damian was destroying all that careful work.\n\n*Stop worshipping Grid!*\n\nThe more influential a religion, the less biased it should appear. Maintain neutrality. Treat everyone equally. Otherwise certain powers might collude to weaken the religion's authority.\n\nLauel immediately connected to Satisfy. His whisper found Damian instantly.\n\n**[Lauel]:** Why are you ignoring my advice? I told you repeatedly to keep your support for Grid and Overgeared secret.\n\n**[Damian]:** It couldn't be helped. Maintaining neutrality forever became impossible. Too much pressure inside and outside the game. I had to make a choice.\n\n**[Lauel]:** Inside the game? Apart from Japan's extreme right-wing groups, there's another force pressuring you?\n\n**[Damian]:** Yes. The Saharan Empire is trying to make the Rebecca Church their state religion.\n\nLauel's expression hardened.\n\nThe Saharan Empire, driven by nationalist ideology, attempting to claim the continent's largest religion as their state religion? The aftermath would be catastrophic. Serving Goddess Rebecca would be prohibited unless one belonged to the Empire.\n\nThe Saharan Empire was already the greatest power. Seventeen nations existed on the continent. All of them existed under the Empire's shadow.\n\n*The Saharan Empire.*\n\nThey'd grown arrogant. No enemies remained in their world.\n\n*If I intended to hand the Rebecca Church over to you, I wouldn't have made Damian Pope.*\n\nThe cynical Lauel pulled up a map of the West Continent. He examined several kingdoms bordering the Saharan Empire.\n\n***\n\n## Thorny Vine Forest\n\nOne of the roads connecting Reidan and the Saharan Empire. The place where the legend of Faker, the god of death, began.\n\n\"Isn't this where the Ice Flower Guild got wiped out by Faker?\"\n\nA guild member shifted his weight from foot to foot.\n\n\"You believe that ridiculous rumor? Ice Flower is one of the strongest guilds. Part of the Seven Guilds. How could Faker wipe them out alone?\"\n\n\"Exactly.\" Another voice chimed in. \"Bondre alone could handle Faker.\"\n\n\"Grid just spread exaggerated rumors to boost Overgeared's reputation. Pure bluff.\"\n\nOne hundred eighty players from Sakura, Japan's leading right-wing guild, concealed themselves throughout the forest. Their goal was simple.\n\nDamian.\n\nTheir first task: kidnap and detain the traitor heading for Reidan.\n\n\"We'll wait here.\" Yoshimura, the guild master, checked his bowstring. \"Make that traitor pay for betraying his country.\"\n\n\"Building a temple in Grid's territory. He must be Korean-blooded trash.\"\n\n\"Hey, suppress your killing intent.\" One of the officers gestured sharply. \"We can't kill the puppet we're trying to create.\"\n\nThe Sakura Guild members gritted their teeth. After some time, they witnessed a long procession entering the forest.\n\n\"Isn't it difficult? Do you want me to help?\"\n\n\"Your Holiness, please maintain your dignity.\"\n\n\"I don't care about dignity if it means ignoring struggling girls.\"\n\n\"...\"\n\n\"Come on now. Yes? Are you shy? Completely adorable. Let me pat your head like this.\"\n\n\"Kyaaak! Your Holiness! Not so hard!\"\n\nThe Sakura Guild members frowned. Pope Damian traveled with a procession of two hundred young girls? They'd heard he was an otaku, but a lolicon as well?\n\n\"Living his best life after becoming Pope.\"\n\n\"Bringing his harem on a journey!\"\n\n\"Think he's the Lorije Emperor or something?\"\n\nKkirik.\n\nYoshimura, master of the Sakura Guild, drew back his bowstring. The bow of the man who'd once been ranked 2nd among archers aimed precisely at Damian's heart.\n\n\"Eat this!\"\n\n*Piing.*\n\nThe shot flew. Yoshimura might have fallen to 4th place in the archer rankings, but few in the world possessed such bow skill. The arrow broke through gaps in the thorns. It struck precisely toward Damian's heart.\n\n\"What?\"\n\nYoshimura's eyes widened.\n\nThe two hundred girls in white clothing following Damian moved. Young girls aged ten to fifteen. They instantly produced spears, swords, and shields. They blocked Yoshimura's arrow.\n\n*Reading the arrow's position? Blocking it? An arrow shot by Yoshimura?*\n\n*Those kids are swinging blades bigger than their bodies?*\n\n*Their formation speed rivals trained soldiers!*\n\nThe Sakura Guild members couldn't process what unfolded before them. How could little girls display such talent and agile movement? It made no sense.\n\n\"...\"\n\nDeep in the quiet forest.\n\nThe Sakura members gaped from their hiding spots. The beautiful girls scanned the forest while gripping weapons. Damian stood at the center. A meaningful smile crossed his face.\n\n\"Trying to fight Rebecca's Daughters candidates. Foolish.\"\n\nThe eyes of the Sakura Guild members shook.\n\n*Rebecca's Daughters candidates!*\n\nThe Rebecca Church only selected girls born with divine ability and talent. Trained them secretly to become the strongest paladins capable of wielding the three divine artifacts. Those strongest paladins bore the title 'Rebecca's Daughters.'\n\nThese girls were the candidates?\n\n*Dammit! Aren't candidates secretly fostered in hidden temples? Why are they with Damian?*\n\n*These young girls are unbelievably strong!*\n\nThe confused Sakura Guild members prepared to retreat after realizing the situation. Then...\n\n\"Goddess' Eyes.\"\n\n*Pahat!*\n\nGolden light concentrated at Damian's fingertips. It spread outward across the area.\n\n> **[The Pope receives Goddess Rebecca's blessing.]**\n> \n> **[Goddess Rebecca detects all living things within 300 meters of you. Undead and demonkin will receive great damage.]**\n\n\"Exactly one hundred eighty people.\"\n\nDamian's eyes turned cold.\n\n\"I won't stain these girls' fine hands with blood. I'll handle this myself.\" His voice dropped. \"Goddess' Blessing.\"\n\n*Pahat!*\n\n*Pa pa pa pa pak!*\n\nSpectacular. Over two hundred green lights streaked through the dark forest, falling from the sky to strike Damian and the girls.\n\n> **[Goddess' Blessing increases you and your party members' stats by 10% for 5 minutes, negates one strike, and creates a shield absorbing 8,000 damage.]**\n\n\"Ack!\"\n\nThe Sakura Guild watching Damian flinched. The intensity of green light wrapping around Damian and the girls made them shine like beacons. Damian's gaze fixed on the location where most of them clustered.\n\n\"Goddess' Wrath.\"\n\n*Chiiiiiing!*\n\nTwo massive magic circles materialized, approximately three meters in diameter each. They formed rapidly behind Damian's back.\n\n*What's that?*\n\nThe Sakura Guild couldn't grasp Damian's actions. Natural. Among users, only Grid would recognize the Pope's skills.\n\n\"Die.\"\n\nDamian's declaration served as the signal.\n\n*Kuwaaaaaang!*\n\nLike anti-tank guns firing. Two enormous rays launched from the magic circles behind Damian's back. They moved in straight lines, swallowing everything in their path. Half the forest exploded into splinters and ash.\n\n> **[Party member Gigs has suffered 14,100 damage!]**\n> \n> **[Party member Kinji has suffered 15,500 damage!]**\n> \n> **[Party member Rokman has suffered 14,990 damage!]**\n> \n> **[Party member Yoshimura has suffered 12,100 damage!]**\n> \n> **[Party member Orochi has suffered 9,900 damage!]**\n> \n> **[Party member...]**\n> \n> **[Party...]**\n\n\"This is bullshit!\"\n\nThe Sakura Guild members' faces turned white. A few seconds to cast. Large area skill. Massive damage to dozens of guild members, all at least level 210. Complete scam.\n\n\"How? How can a user be this strong? Ridiculous! Unbalanced!\"\n\nDamian laughed.\n\n\"The Pope's tenure lasts one year. Shouldn't I exercise this much power? Your level is simply too low.\"\n\n\"We'd win if you weren't Pope!\"\n\n\"I know I'm Pope.\" Damian shrugged. \"You're stupid.\"\n\n\"I didn't know Popes were this strong! If you were weak, we could handle you easily!\"\n\nTruly unscrupulous. Damian sighed. He drew a sword. Then he threw off his white papal robes, revealing golden armor beneath. Beautiful engravings covered the breastplate: *'I love Isabel, Rin, and Luna.'*\n\n\"I don't need papal power for trash like you.\"\n\n*Teong!*\n\nDamian rushed toward Yoshimura, master of the Sakura Guild. Yoshimura fired an arrow calmly despite his surprise at the paladin's speed. Strong blow. The arrow struck the shield of light surrounding Damian and shattered against it.\n\n\"Just this much.\"\n\n\"...!\"\n\n*Seokeok!*\n\nExceptional skill.\n\nDamian displayed swordsmanship at a level Yoshimura's agility couldn't evade. He left the guild master wounded. Performance far beyond what the Sakura Guild had estimated for the first unique hidden class holder and current Pope.\n\nDamian might look foolish because he was an otaku. His ability, though, was legitimately formidable.\n\nHowever, compared to Grid...\n\n---\n\n**Glossary of Common Korean Terms:**\n\n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week\n\n*Check out my Patreon for early access to unedited chapters and to achieve goals for extra chapters. Early access chapters will be updated after I finish releasing the day's content.*"
}