{
  "id": 358,
  "title": "Chapter 358",
  "content": "# Chapter 358\n\n> [You have entered the first island.]\n\nThe first island was tiny. Barely a tenth the size of Yeouido Park. A handful of rock piles jutted from white sand, and that was it. Grid turned in a slow circle, scanning the barren landscape.\n\n\"Where's the challenge?\" His voice echoed across empty space.\n\nA notification flared before his eyes.\n\n> [A mission will be created.]\n>\n> **[First Island]**\n>\n> Survive for 20 minutes!\n>\n> First Clear Reward: 1 Challenger Point.\n>\n> [The mission will start 30 minutes from now.]\n\nGrid read the word 'survive' twice. *This is the archipelago where high-rankers come to die. What's coming that requires survival?*\n\nHis jaw tightened, but not from fear. The confrontation with Kraugel had changed something in him. Pride, maybe. Or stubbornness. Either way, panic felt wasteful. He focused on the reward instead.\n\n*Challenger Points. A new currency?* His mind jumped to the Reputation Store. *If there's a store here...*\n\nAnticipation cut through his caution. Grid activated Braham's Boots, invisible wings manifesting beneath his feet. The island shrank below him as he rose, a crude map forming in his head.\n\nFour magic circles. Large ones, carved into the sand at even intervals across the island.\n\n*Spawn points.* The conclusion came slowly. Grid's intelligence stat was nothing special, average at best, but pattern recognition was survival instinct. *Twenty minutes. Survive. Something's coming from those circles.*\n\nStill, he held the thought loosely. Assumptions killed.\n\nGrid dropped back to the rocks, boots crunching on stone. Minutes remained. He summoned the God Hands with a flick of will. Four golden constructs materialized, their metallic fingers flexing.\n\n\"Take these.\" He distributed his strongest weapons, then pointed at each magic circle in turn. \"Guard those. Kill anything that spawns.\"\n\nThe God Hands swung their blades in acknowledgment. The motion was stiff but precise.\n\nGrid settled onto a boulder to wait.\n\n> [The first island's mission has begun.]\n\n*Crack.*\n\n*Crack-crack-crack-crack.*\n\nThe magic circles erupted. Grid's grin was immediate and feral. *Called it.*\n\n**Kieeek!**\n\n**Kyaaack!**\n\nSpiders poured from the glowing runes. Not spiders. Sellobus. Chitinous bodies, each the size of a large dog, with legs that blurred as they moved. Grid recognized them instantly.\n\n*Haven't seen these in forever.* Level 200 spider-types. Low health, lower defense, but their speed and attack power had slaughtered countless players across the continent. Fast enough that human reaction time meant nothing.\n\nGrid could crush them in one hit now. But the God Hands couldn't.\n\nThe constructs had only thirty percent of his stats. Their Sword Mastery sat at Beginner Level 7. Even wielding top-tier weapons, each sellobus required three or four strikes to kill. Seconds that added up fast.\n\n*Too slow.* \n\nThe spawn rate tripled the God Hands' kill speed. Sellobus began breaking through the perimeter, mandibles clicking as they charged. Streams of venom arced through the air.\n\nGrid dove left. Poison hissed where he'd been standing. His health bar ticked down as a second spray caught his shoulder.\n\n\"Damn it.\" The damage was solid. Too solid. These weren't filler mobs.\n\n*Experience loss hurts, but I'm not dying here.*\n\nGrid planted his feet. **\"Transcended Link!\"** The skill name tore from his throat as Pagma's Swordsmanship flooded his muscles. His sword became a blur, twenty strikes manifesting in the span of a breath. Sellobus exploded into viscera.\n\nHe wiped ichor from his face and called reinforcements.\n\n\"Noe. Randy.\"\n\nTwin flashes of light. The demonic cat appeared first, wings fluttering.\n\n\"Snack time! Nyang!\" Noe's eyes gleamed with hunger.\n\nRandy materialized beside him, wearing Grid's face like an ill-fitting mask. \"Randy. Grid okay.\"\n\nGrid pointed east and north. \"Support those God Hands. I'll cover south and west.\"\n\n\"Nyang!\" Noe shot forward without hesitation.\n\nRandy hesitated. *He doesn't know cardinal directions.* Grid jabbed his finger more emphatically toward the north. The doppelganger's face brightened with understanding, and he sprinted after Noe.\n\nThe eastern and northern God Hands suddenly doubled their efficiency. Grid turned to his own sectors. He extended both hands, mana coalescing at his fingertips.\n\n**\"Magic Missile!\"**\n\nBolts of arcane force streaked left and right. Sellobus detonated on impact. The pressure on the southern and western God Hands eased immediately.\n\nNotifications erupted.\n\n> [You have killed a sellobus.]\n>\n> [612,000 experience has been distributed.]\n>\n> [Your pet Noe has acquired 204,000 experience.]\n>\n> [Your pet Randy has acquired 204,000 experience.]\n\n> [You have killed a sellobus.]\n>\n> [612,000 experience has been distributed.]\n\n> [Your pet Noe has acquired...]\n\nThe messages became a waterfall. Grid's eyes widened.\n\n\"Holy...\" Four kills per second. The math was obscene. Ten times faster than the vampire cities. The best hunting ground he knew, and this crushed it.\n\nThen the next notification appeared.\n\n> [The Sword Mastery of 'God Hand' has increased from Beginner Level 7 to Beginner Level 8.]\n\n> [The Sword Mastery of 'God Hand' has increased from Beginner Level 8 to Beginner Level 9.]\n\nGrid's hands trembled. The God Hands swung faster. Their strikes grew cleaner. Each level gained shaved milliseconds off their attacks. The sellobus cull rate spiked.\n\nTwenty times faster than the vampire cities now. Twenty.\n\n> [You have killed a sellobus.]\n>\n> [You have killed a sellobus.]\n>\n> [You have killed a sellobus.]\n\n> [The level of Noe has risen!]\n\n> [The level of Randy has risen!]\n\n> [The level of Randy has risen!]\n\n\"Yes!\" Grid couldn't contain it. He pumped his fist. \"This is insane! This is perfect!\"\n\nThe first island. The chokepoint that broke so many challengers. For Grid, it was paradise.\n\n***\n\n> [You have cleared the first island.]\n>\n> [You have acquired 1 Challenger Point for the mission success.]\n\n> **[Challenger Point]**\n>\n> Can be used to purchase items from the Challenger Store that exists somewhere in the Behen Archipelago.\n\nGrid stared at the final notification. \"Only twenty minutes?\"\n\nHe'd gained fifteen percent of a level. In twenty minutes. His chest ached with greed.\n\n*What if it was twenty hours? Twenty days?* The thought consumed him. He could camp this island. Farm it endlessly. Close the gap with Kraugel, maybe even surpass him.\n\nBut reality intruded. *I don't even know how to leave this place yet. And there are sixty-five more islands. Probably better hunting grounds ahead.*\n\nProbably. That word did a lot of work. Still, impatience would kill him faster than monsters. Grid forced himself to breathe. To think. He turned toward the newly manifested bridge stretching across black water.\n\nThe gate to the second island waited at the far end.\n\n***\n\n> [You have entered the second island.]\n\nThis one dwarfed the first. Ten times the size, easily. Dense jungle choked the lowlands, the roar of waterfalls echoing from somewhere within. Small mountains rose at opposite ends. Lakes glittered between the trees. Cave mouths dotted the cliffs.\n\nGrid scanned the chaos and immediately spotted something wrong.\n\n\"Treasure chests?\"\n\nTen golden boxes sat in a neat row against the rock wall behind the entry point. They gleamed like bait.\n\n*Too obvious. Has to be a trap.* He didn't move closer.\n\nThe notification answered before he could theorize further.\n\n> [A mission will be created.]\n\n> **[Second Island]**\n>\n> Open the locked treasure chests!\n>\n> There are 10 keys hidden throughout the island.\n>\n> It is important to find as many keys as possible, as each box has a different key.\n>\n> Time Limit: 3 days.\n>\n> First Clear Reward: 1 Challenger Point for every opened box.\n>\n> *If two or more boxes can't be opened within the specified time, you will be expelled from the island.*\n\n> [The mission will start 30 minutes from now.]\n\nGrid reread the objective. \"A scavenger hunt.\"\n\nThree days to find ten keys. The island was massive, the terrain hostile. Bushes, lakes, waterfalls, caves, sheer cliffs. Finding a small key in all that?\n\n*Like finding a needle in a desert.*\n\nBut Grid's expression didn't change. The smile stayed fixed on his face.\n\n***\n\n\"The second island has the highest failure rate.\"\n\nSticks gazed into the magic orb, his expectations carefully measured. The black-haired challenger had cleared the first island impressively, true. But the second island was a different beast entirely.\n\n\"Success requires high intelligence. Observation skills to piece together clues without missing a single detail.\" Sticks's eyes narrowed as the image sharpened. \"But look at him.\"\n\nThe challenger sat cross-legged before one of the magic circles. Resting. Wasting the thirty-minute preparation window.\n\n\"He's given up already.\" Disappointment colored the sage's voice.\n\nThen the mission timer hit zero. Sticks leaned forward, expecting to watch the challenger fumble through the jungle for three days before inevitable failure.\n\nWhat he saw instead stopped his breath.\n\n\"**Keok**!\" The sound ripped from his throat. His hands gripped the orb's base. \"Keok keok... No. *No.* Is he a legendary thief?\"\n\nThe challenger approached the ten chests. He held a single crude tool in his hand. Something metal, cylindrical, with wire protruding from one end.\n\nThe first lock clicked open.\n\nThen the second.\n\nThird.\n\nFourth.\n\nThe dexterity was inhuman. Each chest opened with mechanical precision, the locks surrendering as if they'd never been locked at all.\n\n\"The second island... in ten seconds...?\" Sticks's voice cracked. \"That's impossible.\"\n\nBut the notification in the orb proved otherwise.\n\n> [You have cleared the second island.]\n\nIt was a record that would never be broken. The moment when the continent's wisest sage was reduced to a stammering fool.\n\nOn that same day, Grid reached the ninth island.\n\nWhich meant Sticks was stunned into incoherence eight more times.\n\n---\n\n**Glossary of Common Korean Terms:**\n\nOG: Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}