{
  "id": 359,
  "title": "Chapter 359",
  "content": "# Chapter 359\n\n> [You have cleared the ninth island.]\n> [You have acquired 24 challenger points for the mission success.]\n\n*I have a total of 102 points.*\n\nGrid reached the ninth island at a blistering pace. His breathing remained steady. No exhaustion marked his features. The trial had proven trivial.\n\n\"Easier than expected.\"\n\nDeflation crept into his chest, but he strangled the impulse toward overconfidence. This was the Behen Archipelago. The place that had tested even Kraugel.\n\n*The difficulty will spike exponentially over the next few islands.*\n\nGrid steadied his pulse. He had no context for comparison. The endless monsters on the first island, the hidden keys on the second, capturing the escaped fox mice on the third, swallowing the raging fire on the fourth, surviving the blizzard on the fifth, passing through the poisonous sixth island, the seventh and eighth islands where powerful boss monsters had emerged...\n\nAnd now the ninth island, freshly conquered.\n\nFrom any objective measure, these trials were brutal. Grid simply existed as an anomaly. Even Kraugel had struggled on the first and second islands.\n\n> [Do you want to enter the 10th island?]\n\n\"Yes.\"\n\nThe gate swallowed him.\n\n***\n\nParis would host the 2nd National Competition in approximately two months.\n\nThe S.A. Group employees existed in a state of perpetual motion. They subsisted on convenience store meals and overtime. Their health deteriorated. The global festival demanded perfection in every microscopic detail.\n\n\"God, this is brutal.\"\n\nChairman Lim Cheolho collapsed into his office massage chair the moment he returned from Paris. Even his legendary passion had limits.\n\n\"Age catches everyone.\" He closed his eyes as the chair began its work. \"Doesn't matter how well you take care of yourself. Exhaustion comes faster now.\"\n\nThe mechanical nodes dug into his shoulders and spine. Relief spread through his muscles. When his breathing had normalized, he addressed the supercomputer.\n\n\"Morpheus. Status report on the five.\"\n\n*Them*. The five miracles. Grid and Kraugel included. People who generated results that defied even Morpheus's predictive algorithms. Lim Cheolho had developed an obsession with monitoring them.\n\nBefore departing for Paris, he'd issued standing orders. Morpheus's synthetic voice filled the office.\n\n[Kraugel and Grid have engaged in direct combat. Agnus has encountered Braham's soul. The remaining two continue standard leveling activities.]\n\n\"What?\"\n\nLim Cheolho's eyes snapped open. The Agnus-Braham meeting registered as background noise. That scenario had been mapped, predicted, scheduled. But Kraugel and Grid?\n\n\"Say that again. Kraugel and Grid fought? What were the circumstances?\"\n\n[Kraugel visited Reidan after acquiring access to the Sword Saint quest chain.]\n\n\"Jesus.\" Lim Cheolho sat upright. The massage chair protested with mechanical whirrs. \"He's already on the Sword Saint track?\"\n\nKraugel was a phenomenon. Perfect didn't capture it. The player existed in a state of transcendence. Even Morpheus struggled to map his decision trees.\n\n\"He'll obtain it, of course. The Sword Saint class.\"\n\nGrid posed no real obstacle. The legendary blacksmith had power, yes, but Kraugel dominated PvP like a law of physics.\n\n*Sword Saint. The apex of combat classes. How much stronger will he become?*\n\nLim Cheolho's mind raced with possibilities. Then Morpheus spoke.\n\n[Kraugel failed to obtain the Sword Saint class.]\n\nSilence.\n\n\"No.\" Lim Cheolho leaned forward. \"Don't tell me he lost. To Grid.\"\n\nHe understood Grid's strength better than Grid himself. The chairman's evaluations outstripped the player's wildest self-assessments. But Kraugel operated on a different plane. In PvP, he was absolute. Apart from Agnus, no player could match him in single combat.\n\nMorpheus continued its explanation.\n\n[Kraugel entered the confrontation in a compromised state. A critical skill remained on cooldown. His equipment had sustained damage. He chose not to equip several pieces for the engagement with Grid. These factors elevated Grid's probability of victory from 21.13% to 54.98%.]\n\n\"Grid's odds were already that high?\"\n\n[Analysis incorporated skill trees, equipment inventories, and accumulated combat data from both subjects. However, accuracy cannot be guaranteed. Kraugel has invalidated my predictions 185 times. Grid has done so 13 times.]\n\nHence the designation. Miraculous beings.\n\nA grin split Lim Cheolho's face. Laughter erupted from his chest.\n\n*Tonight calls for chicken and beer.*\n\nHe would feast while reviewing footage of the Kraugel-Grid duel. The privilege of being the world's wealthiest man.\n\n***\n\n> [You have entered the tenth island.]\n\nNot an island. A room.\n\nThe floor stretched outward, painted sterile white. Walls and ceiling matched. The dimensions defied measurement. Distance became abstract in the emptiness. Grid's face tightened as he surveyed the space.\n\n\"What is this?\"\n\nWhite pillars jutted from the floor at irregular intervals. Thin metal rods, perhaps 5cm wide and 2m tall. Each one tapered to a sharp point.\n\n\"Hundreds of them. No, thousands?\"\n\nA notification materialized.\n\n> [A mission will be created.]\n> \n> **[Tenth Island]**\n> \n> Avoid the lightning that will pour down like rain!\n> \n> The lightning cannot be defended against by any means. You can only evade.\n> \n> **Mission Success Conditions:** Reach the gate for the eleventh island.\n> \n> **First Clear Reward:** 30 Challenger Points.\n> \n> * You will instantly die if struck by lightning.\n> \n> [The mission will start in 30 minutes.]\n> \n> [The ceiling is opening.]\n\nA grinding roar echoed from above. Grid looked up. The white ceiling retracted like a lid. Dark clouds boiled in the exposed sky, gravid with electricity.\n\n*Lightning that ignores all defense.*\n\nThe storm would deliver instant death. Lightning moved faster than human perception. The mission appeared impossible. Only players with god-tier control could survive. Kraugel. Regas. Faker.\n\n\"The difficulty curve is steepening.\"\n\nTension coiled in Grid's chest for the first time. As anxiety mounted, his attention drifted back to the metal pillars.\n\n*They wouldn't place these here without purpose.*\n\nUnderstanding their function took priority. Grid approached the nearest rod.\n\n\"Legendary Blacksmith's Appraisal.\"\n\n> [The Legendary Blacksmith's Appraisal skill has been activated.]\n> \n> [The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\nA chime echoed in his skull.\n\n> **[Lightning Rod]**\n> \n> Durability: 1/20\n> \n> A metal rod with a pointed end that attracts and absorbs lightning.\n> \n> The durability is critically low due to severe damage. It will immediately turn to ash from a single lightning strike.\n> \n> Weight: 3\n> \n> [A hidden function does not exist.]\n> \n> [Your understanding of the Lightning Rod is now 100%.]\n> \n> [The 'Lightning Rod' production method has been acquired.]\n\n\"Lightning rods. I need to use these to avoid the strikes.\"\n\nGrid examined the placement pattern more carefully. Approximately 15 meters separated each rod on average. Players would need to chain dash skills perfectly, moving from one protective zone to the next during the brief windows between lightning strikes.\n\n*Can I do this?*\n\nHis control ability remained his weakest attribute. Grid stood motionless, running simulations. Then an idea crystallized.\n\n*Thank god I made this.*\n\nHe pulled the Portable Furnace from his inventory.\n\n***\n\nNine hundred and ninety players had challenged the Behen Archipelago to date. Over half were high rankers. The first and second islands had eliminated most of them. Only 392 had reached the tenth island.\n\nOf those 392, a mere 65 had passed.\n\nThe difficulty spike was exponential.\n\n\"Hah... hah...\"\n\nSweat dripped from Sticks' jaw as he collapsed onto the ground. His heart hammered against his ribs. Pain lanced through his chest. He forced his breathing to slow, then turned his attention back to the scrying orb.\n\n\"He won't pass this one.\"\n\nThe black-haired man had aggravated Sticks' condition too many times already. The sage couldn't help his negative assessment. Yes, the mysterious challenger possessed strange abilities. But the tenth island demanded divine control. Nothing else sufficed.\n\n*He can no longer depend on artifacts here.*\n\nCould that man traverse 2,000 meters while dodging lightning that struck three or four times per second? Sticks deemed it impossible. The assessment had foundation. The black-haired man, despite his exceptional physical capabilities, lacked perfect control over his own movements.\n\n\"Standard dodging will never work. Wait, what?\"\n\nConfusion creased Sticks' features. In the scrying orb's display, the man had withdrawn a portable furnace. Now he was lighting the bellows?\n\n\"What is he doing?\"\n\nNo 'portable blast furnace' existed in Sticks' extensive knowledge base. Only blacksmiths handled furnaces. They required specialized skill.\n\n\"And why...\"\n\nWhy deploy a furnace in this scenario?\n\n*Has he lost his mind?*\n\nNo. Insanity would be easier to process. Sticks' confusion intensified as the black-haired man raised the furnace temperature and began smelting iron ore.\n\n\"Impossible.\"\n\nSticks possessed vast knowledge as a sage. The weight of that knowledge made the current scene more shocking.\n\n\"That smelting technique?\"\n\nThe black-haired man demonstrated mastery that obliterated every concept of 'smelting' in Sticks' mental library. The iron liquefied instantly, purified to perfection.\n\n\"A legendary blacksmith!\"\n\nMagic when casting spells. A warrior when wielding the sword. Possession of countless artifacts. A thief's skill with locks. And now blacksmithing.\n\n\"What are you?\"\n\nA question mark manifested over Sticks' head, almost visible.\n\n*Clang! Clang!*\n\nThe mysterious man finished smelting and began hammering. Moments later...\n\n\"A lightning rod?\"\n\nCorrect. A metal rod materialized in the black-haired man's hands, similar in design to the rods protruding from the tenth island's floor. But the scale was massive. Seven meters in length.\n\n\"...\"\n\nSticks resolved not to be surprised again. The decision was tactical. Another shock might trigger a cardiac event.\n\nThunder cracked across the sky. The deluge began.\n\nThe black-haired man stood safe beneath his creation. Golden hands floated independently, gripping the oversized lightning rod. The man strolled forward like a nobleman beneath a parasol carried by attendants.\n\n\"Ugh... urk...\"\n\nSticks clutched his chest. He toppled sideways.\n\nThe image contrasted sharply with Grid's imposing appearance.\n\n***\n\n**Glossary of Common Korean Terms**\n\nOG: Glossary Link\n\nCurrent schedule: 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}