{
  "id": 36,
  "title": "Chapter 36",
  "content": "# Chapter 36\n\nThe moment I opened my eyes the next morning, I jacked into Satisfy and made straight for the smithy. Khan was already waiting. I didn't waste time with pleasantries.\n\n\"Why'd you give that job to a stranger like Huroi?\" I jabbed a finger in his direction. \"Am I worse than him? Huh? You should've left it to me!\"\n\nKhan blinked, confusion flickering across his weathered face. Then recognition dawned. \"Are you talking about the mission to tell Earl Steim about Winston?\"\n\n\"Yes!\" \n\nA low chuckle rumbled from Khan's chest. He shook his head slowly.\n\n\"You are definitely a great young man. Despite your youth, you have tremendous ability and a sense of justice and sacrifice...\"\n\n\"Huh?\" I stared at him. What the hell was he talking about?\n\n\"Aren't you willing to take a big risk for the residents of Winston?\" Khan continued, oblivious to my confusion. \"People you have no ties with?\"\n\n\"Eh? That wasn't what I—\"\n\n\"You don't have to say anything.\" Khan waved me off. \"You are too modest.\"\n\n*This old man completely misjudged me.* I opened my mouth, then closed it. No words came.\n\nKhan placed a weathered hand on my shoulder. The weight of it was solid, warm.\n\n\"I know you worry for Winston's residents, but how can I put you at risk? You are already precious to me.\" His voice cracked slightly. \"Just like a son. I can't ask you to do something so dangerous.\"\n\nHis eyes were disturbingly genuine. The kind of look my own father never gave me.\n\n\"The Mero Company knows you're close to me. They'll be watching you like hawks.\" Khan's grip tightened. \"If they see you trying to leave Winston, they won't stay idle. I couldn't stand the grief if you got hurt by them.\"\n\nMy throat constricted. *Shit.* Guilt wormed through my chest, cold and uncomfortable. I'd been so busy feeling sorry for myself that I'd completely misread the situation.\n\n\"Khan...\" I forced the words out. \"I didn't understand and thought you didn't trust me.\"\n\n\"How could that be?\" Khan's expression was almost hurt. \"I trust you more than anyone. Isn't that why I'm leaving the fate of the smithy to you?\"\n\n*Right.* My stomach twisted. *I'm an idiot.* I had no reason to doubt Khan in the first place. The old man had done nothing but support me since we met. I felt small, petty. Exactly what I was.\n\nKhan's voice shifted, taking on a fierce edge. \"You need to focus on the game! Show those Mero Company bastards what you're made of!\"\n\n\"The date is set?\"\n\n\"Two days.\" Khan nodded sharply. \"We need to hone your skills until they shine. Let's surprise everyone by polishing those legendary blacksmith techniques you've inherited!\"\n\nEnergy surged through me despite the guilt. *Money. This is about money. Focus on that.* \n\n\"I understand.\" I straightened. \"I'll win this game.\"\n\n\"Good spirit!\" Khan slapped my back hard enough to make me stumble. \"I might not have cutting-edge techniques, but the experience I've accumulated over a lifetime? That will help you. I'll give you everything I have!\"\n\n***\n\nKhan drove me like a man possessed. \n\nFor two days straight, I hammered, smelted, and tempered until my hands cramped even in-game. Khan watched every movement, correcting my posture, adjusting my grip on the hammer, pointing out wasted motion. \"Efficiency,\" he barked. \"Every second counts in competition. Cut that flourish. Tighten that angle.\"\n\nMy muscles learned. The motions became cleaner, faster. Unnecessary movements fell away.\n\n> [A <span class=\"rarity-rare\">Rare</span> rated item was produced, so all stats have permanently risen by **+2** and reputation throughout the continent has risen by **+30**.]\n\n> [An <span class=\"rarity-epic\">Epic</span> rated item was produced, so all stats have permanently risen by **+4** and reputation throughout the continent has risen by **+80**.]\n\n> [Your **Persistence** has risen.]\n\n> [Your **Dexterity** has risen.]\n\nThe stat gains felt good. Real progress, the kind I could measure. But there was a problem gnawing at me.\n\nMaterials. Or rather, the lack of them.\n\nKhan was broke. I was broke. Between us, we had nothing to buy premium ingredients. We had to work with the scraps piled in Khan's warehouse, and most of it was garbage. Iron of mediocre purity. Leather with thin patches. The Mero Company had been strangling Khan's supply lines for months.\n\n*Which means I'm making weak items.* I bit back a curse as I examined another finished sword. The stats were pathetic compared to what they could be with better materials. *Higher level items would give me better experience gains. This is going to be slow.*\n\nBut at least I could sell the Epic pieces to players and recoup some costs.\n\n**[Usable Iron Sword]**\n\n**Rating:** <span class=\"rarity-epic\">Epic</span>  \n**Durability:** 19/19 **Attack Power:** 35~40 **Attack Speed:** +2%  \n\n*A sword made by a craftsman with great skill and potential but lacking in experience and reputation.*\n\n*It is easy to use because it has a perfect balance of length and weight. The user can attack a little faster.*\n\n*The fact that this type of sword was made with meager materials is amazing.*\n\n**User Restriction:** Level 12 or higher. More than 30 Strength. Beginner Sword Mastery.\n\n**[Unexpectedly Comfortable Rat Leather Armor]**\n\n**Rating:** <span class=\"rarity-epic\">Epic</span>  \n**Durability:** 24/24 **Defense:** 22 **Movement Speed:** +3%  \n\n*An armor made of rat leather by a craftsman with great skills and potential, but lacks experience and reputation.*\n\n*It is designed and created so that the wearer won't be inconvenienced when moving. The wearer can move a little faster.*\n\n*The fact that this type of armor was made with meager materials is amazing.*\n\n**User Restriction:** Level 13 or higher. Beginner Leather Armor Mastery.\n\nI grimaced at the names. *Rat leather. How pathetic can you get?* But for level 12 or 13 players, this gear would be powerful. Better than anything they'd find in stores. If they had gold to spare, they'd want it.\n\n**[Legendary Blacksmith's Craftsmanship Skill]** Lv 1 (12.7%)  \n**[Legendary Blacksmith's Breath]** Lv 1 (8.9%)  \n\nMy jaw clenched. *When I made those Jaffa Arrows, I got 3.7% and 2% experience. Instantly.* This grind was slower. Much slower.\n\nBut I wasn't stupid. Progress was progress.\n\n*The Legendary Blacksmith's Craftsmanship Skill is still only level 1, but I can already do more than before.* My production speed had improved. The finished items were tighter, cleaner. If I could raise both the skill level and my Dexterity stat, my ability would skyrocket.\n\n*But realistically, leveling that skill is going to take forever.* I wiped sweat from my forehead. *The best thing I can do right now is pump Dexterity.*\n\nHigher Dexterity meant higher item quality. It was simple math. I pulled up my status window.\n\n\"Status window.\"\n\n**Name:** Grid  \n**Level:** 21 (5,350/16,700)  \n**Class:** Pagma's Descendant  \n\n* The probability of adding additional options when making items will increase.  \n* The probability of item enhancement will increase.  \n* All equipment items can be worn unconditionally. However, there is a penalty depending on the rating of the item.  \n\n**Title:** One who Became a Legend  \n\n* Abnormal conditions don't work well on you.  \n* You won't die when health is at the minimum.  \n* Easily acknowledged.  \n\n**Health:** 936/936 **Mana:** 177/177  \n\n**Strength:** 104 **Stamina:** 52 **Agility:** 96 **Intelligence:** 59  \n**Dexterity:** 99 **Persistence:** 60  \n**Composure:** 44 **Indomitable:** 50 **Dignity:** 44 **Insight:** 44  \n\n**Stat Points:** 130  \n**Weight:** 842/3,080  \n\nI stared at the number. 130 stat points. A massive reserve thanks to all the items I'd been churning out. My fingers itched to dump everything into Dexterity immediately.\n\n*But wait.* I forced myself to think. *If I go all-in on Dexterity, it'll boost my production for sure. Huge gains. But if I tunnel vision on one stat, I'll regret it later.*\n\nI needed balance. Sort of.\n\n*I already pumped Strength and Agility the other day. Those are fine for now.* My eyes drifted to Stamina. *But Stamina is pathetic. When I fought those gangsters, I was gassed out fast. More health and defense would help me not die.*\n\nDecision made. I started allocating points.\n\n> [You have invested 60 points in **Stamina**. Is this correct?]\n\n\"Yes.\"\n\n> [Once the points are invested, it can't be reversed. Do you want to proceed?]\n\n\"Yes.\"\n\n> [You have invested 70 points in **Dexterity**. Is this correct?]\n\n\"Yeah, do it.\"\n\n> [Once the points are invested, it can't be reversed. Do you want to proceed?]\n\n\"Stop asking me and just do it.\" I waved impatiently at the notification. \"Status window!\"\n\n**Name:** Grid  \n**Level:** 21 (5,350/16,700)  \n**Class:** Pagma's Descendant  \n\n* The probability of adding additional options when making items will increase.  \n* The probability of item enhancement will increase.  \n* All equipment items can be worn unconditionally. However, there is a penalty depending on the rating of the item.  \n\n**Title:** One who Became a Legend  \n\n* Abnormal conditions don't work well on you.  \n* You won't die when health is at the minimum.  \n* Easily acknowledged.  \n\n**Health:** 1,536/1,536 **Mana:** 177/177  \n\n**Strength:** 104 **Stamina:** 112 **Agility:** 96 **Intelligence:** 59  \n**Dexterity:** 169 **Persistence:** 60  \n**Composure:** 44 **Indomitable:** 50 **Dignity:** 44 **Insight:** 44  \n\n**Stat Points:** 0  \n**Weight:** 842/3,080  \n\nA grin split my face. \"Kukukuk!\"\n\n*This is insane.* Anyone who saw my stats would lose their minds. A level 21 character with stats like this? If I added up all my numbers, I was already beyond level 75. Just the four basic stats alone, Strength, Stamina, Agility, and Intelligence, put me close to level 40.\n\n*Production classes are broken for stat gains.* The realization hit me like cold water. Every production class got permanent stat boosts from making high-grade items. Not just blacksmiths. Anyone who took advantage of it could overcome the typical weaknesses of production jobs. Combat skills might be lacking, but overwhelming stats could compensate. \n\nThe catch? Labor. Endless, brutal labor.\n\n\"I was born for labor.\" I grabbed a piece of bread from my inventory and tore into it. \"My body is meant for this. I'll show everyone what labor can do.\"\n\nI dove back into production. No breaks. No distractions. Just the rhythm of hammer on steel, the hiss of quenching, the glow of the forge. My focus sharpened to a razor's edge. As my character grew stronger, I felt myself changing too. Mental fortitude building alongside the stats.\n\n> [A <span class=\"rarity-rare\">Rare</span> rated item was produced, so all stats have permanently risen by **+2** and reputation throughout the continent has risen by **+30**.]\n\n\"Kuhahahahaha!\" The laugh burst out of me, manic and real.\n\nThis feeling. This rush. It was completely different from hunting or questing as a warrior. *This* was power you could measure. Quantifiable growth.\n\n\"W-What...\" Khan's voice cracked behind me. I turned. His eyes were wide, disbelieving. \"Am I dreaming right now? How have you improved so much in such a short time?\"\n\nI couldn't exactly tell him *I dumped all my stats into Dexterity*, so I smirked. \"I'm not your average genius.\"\n\nKhan's face lit up like I'd just announced I was his real son.\n\n\"Yes, yes! I forgot you're Pagma's Descendant.\" He laughed, the sound rich with pride. \"I have a relationship with a legend reborn. I'll have no regrets when I die. Good! Should I push you even harder?\"\n\nOutside, rain hammered Winston's streets. The weather kept most people indoors, which meant I had no reason to log out except to sleep. I lived in the smithy. Ate in the smithy. My growth was relentless, steady, unstoppable.\n\nBy the time the competition day arrived, I was ready.\n\n***\n\nCurrently, three Epic classes existed in Satisfy. But aside from the most recent one, Blood Warrior, details were scarce. The first Epic class user's identity remained unknown. The second belonged to Agnus, 7th on the unified rankings.\n\nWhat were these classes? How did they work? Were the hidden two as powerful as Blood Warrior, or even stronger?\n\nPlayers speculated endlessly. Forums overflowed with theories. Broadcasters debated for hours. But without the owners revealing information, it was all guesswork.\n\nIn the Eternal Kingdom, near Frontier (Earl Steim's capital), there was a dungeon called Akero. The monsters there were so numerous and dangerous that even high-level users struggled to hunt alone.\n\n\"There are too many monsters.\" A beautiful blonde girl emerged from the dungeon entrance, slightly out of breath. She looked like a fairytale princess stepped into reality.\n\nMale users noticed immediately.\n\n\"Akero Dungeon is rough even for veterans.\" One man jogged over, trying to look casual. \"Want to join our party? We've got solid skills.\"\n\n\"No, join us!\" Another cut in. \"We know this dungeon inside and out. Best hunting speed around. You won't regret it.\"\n\n\"Forget them!\" A third player pushed forward. \"We'll give you all the good drops!\"\n\nThe girl's beauty was real, not cosmetic surgery via character creation. Satisfy's system reflected actual appearances, only allowing minor changes like hair color or tattoos. Beautiful characters meant beautiful players.\n\nHearts practically floated above the men's heads as they stared.\n\n*A rare beauty!*  \n*My ideal type!*\n\nThey were used to competing over pretty girls. This was routine.\n\nThe blonde tilted her head, a small smile playing on her lips. \"You really want me to join? Then prove yourselves. Hunt those monsters over there. I want to see which party is strongest.\"\n\n\"Tch. She's not that special.\" One of the female users rolled her eyes.\n\n\"Agreed. I'd be grateful not to carry dead weight.\" Another woman crossed her arms, glaring.\n\nThe male users, however, lit up with motivation.\n\n\"Ohhhhhh! Just watch! **Heat Wave! Fire Sword!**\"\n\n\"Beautiful lady, witness my power! **Swirling Frenzy!**\"\n\n\"Amateurs. Can you do this? **Steel Skin! One Point Break!**\"\n\n\"Your skills are all talk! **Thunderbolt!**\"\n\nThey charged. Skills erupted in a cacophony of magic.\n\n*Kwarurung! Kung kwang! Kwajik!*\n\nSwirling storms, crackling lightning, roaring flames. The dungeon walls shook. Monsters scattered in terror from the chaotic display.\n\nThe blonde girl watched calmly, ignoring the spectacle. Her focus was surgical.\n\n*That wind magic isn't bad compared to other kingdom magicians.* She activated her abnormally high Insight stat and triggered **Skill Observation**. The data streamed into her mind. She whispered under her breath.\n\n\"**Skill Duplication**.\"\n\n> [You have successfully duplicated '**Swirling Frenzy**' Lv.3.]\n\n> [The skill '**Swirling Frenzy**' Lv. 3 is available to use once. You can keep it permanently until it is used.]\n\n**[Swirling Frenzy]**  \n**Lv. 3**\n\n*Creates a vortex that deals 1,530~2,380 damage per second for five seconds. The agility of the target caught in the vortex will decrease by 80%.*\n\n**Skill Mana Cost:** 700  \n**Skill Cooldown Time:** 300 seconds\n\nThe girl's name was Euphemina. Her class: Duplicator.\n\nAs a Duplicator, she could instantly analyze and copy any skill used in her presence through **Skill Observation** and **Skill Duplication**. Whatever she copied, she could use once whenever she wanted. The limitation? She could only copy three skills per day.\n\nIt was still absurdly powerful.\n\n*I can get Piaro with this.* She turned away from the men, who were still showing off like peacocks. They didn't even notice her leaving.\n\nEuphemina moved quickly through the terrain, heading for Kesan Canyon. When she reached the end of the canyon, she found what she was looking for.\n\n\"There it is.\"\n\nA small cave, half-hidden by rock. She paused at the entrance and pulled up her quest window one more time, steeling herself for what lay inside."
}