{
  "id": 361,
  "title": "Chapter 361",
  "content": "# Chapter 361\n\n> [You have entered the 20th island.]\n\nGrid collapsed to his knees, chest heaving. Sweat plastered his hair to his forehead. His eyes burned from staring at monster patterns for hours without break.\n\nForty-five hours and nineteen minutes. That's how long he'd been trapped in this damned archipelago. Over fifteen hours in the real world. His bladder screamed. His stomach cramped. Every muscle in his body felt like it had been wrung out and left to dry.\n\n*Since the eleventh island, I've wasted so much time.*\n\nThe 11th through 19th islands had been pure grinding—hunting missions, raid bosses, waves of enemies. The kind of tedious, exhausting work that drained both mental stamina and patience. His level had climbed to 306, but the cost had been brutal.\n\n*I should finish this today.*\n\nThere was no time limit to the Behen Archipelago. No invisible clock forcing him to rush. He could log out, sleep properly, return tomorrow. His hand moved toward the menu.\n\nThen the sun died.\n\n\"What?\"\n\nShadow consumed the island. Not the gradual dimming of dusk, but a sudden, absolute eclipse. Grid's head snapped upward.\n\nThe sky had been replaced.\n\nA massive circle blotted out the sun—a grotesque disk of flesh and eyes. Tens of thousands of them. Maybe more. They blinked independently, pupils dilating and contracting in a hypnotic, nauseating rhythm. Blood vessels writhed across the surface like worms beneath skin. Each eyeball bulged obscenely, wet and glistening.\n\nGrid's stomach lurched. He pressed a fist to his mouth, swallowing bile.\n\n*What the hell is this mission?*\n\nThe notification window materialized, indifferent to his revulsion.\n\n> [A mission will be created.]\n> \n> [20th Island]\n> \n> Avoid the gaze of the Hell Moon!\n> \n> First Clear Reward: 130 Challenger Points.\n> \n> [The mission will start in 30 minutes.]\n\n*Hell Moon?*\n\nGrid stared at the abomination above him. He'd visited Hell before—walked its scorched earth, fought its beasts. But he'd never seen a moon like this. Then again, he'd been there during daylight hours. Who knew what horrors emerged at night?\n\n*I need to understand the objective.*\n\nHe forced himself to study the Hell Moon despite every instinct screaming at him to look away. Its eyes tracked across the island's surface in sweeping patterns, never blinking in unison.\n\n> [A helper fairy has appeared.]\n\nLight burst beside Grid's head. When the glare faded, a small fairy hovered there—maybe fifty centimeters tall, with delicate wings and an impish grin. His posture was formal, almost ceremonial, but mischief danced in his expression.\n\n\"Hello, Challenger.\"\n\nGrid squinted at the creature. \"Who are you?\"\n\nThe fairy pressed a tiny hand to his chest. \"I am Bini, a fairy of love and justice. Sage Sticks has asked me to assist challengers who reach this stage.\"\n\n\"Sticks asked you?\" Grid's brow furrowed. He'd assumed the trials were Sticks' design—tests to prove the worthiness of those seeking the East Continent. \"Wait. If Sticks didn't create the trials, who did?\"\n\n\"I don't know.\" Bini shrugged, wings fluttering. \"It was like this from the beginning.\"\n\n\"What's on the last island?\"\n\n\"I don't know that either. You can ask Sticks if you meet him.\"\n\nGrid's eye twitched. \"I thought you were a helper fairy. You're not very helpful.\"\n\n\"Nope, I'm sure that I will help!\" Bini produced a pair of spectacles from nowhere and perched them on his nose. \"My role is to help challengers overcome the trials. But I can't help just anyone! I only assist those who reach the 20th island by themselves! So please pay attention to me from now on!\"\n\nThe fairy adjusted his glasses with exaggerated importance. \"In order to escape the 20th island, you must avoid the Hell Moon's gaze. There is a theory that the Hell Moon has 66,666 eyes. There is no place on this island where at least one eye cannot see.\"\n\nGrid crossed his arms. \"Then how do I escape it?\"\n\n\"Pretend that you aren't a person.\"\n\n\"What?\"\n\nBini nodded enthusiastically. \"Pretend that you aren't a person!\"\n\n*Wait.* Grid's mind raced to Blackening—the skill that transformed him into a half-demon. \"What if I turn into a demon?\"\n\n\"Wow, a challenger has the power of Blackening? Indeed, you're someone who managed to get here!\" Bini clapped his tiny hands. \"But unfortunately, that is wrong. The Hell Moon is hostile to all living creatures, not just humans.\"\n\n\"Then from the beginning, you meant creatures, not people.\"\n\n\"Well, the Challenger is human, so I tried to explain it from your perspective. Hehet.\" The fairy giggled.\n\nGrid pinched the bridge of his nose. \"So how do I pretend to not be a creature?\"\n\n\"Stop.\"\n\n\"...What?\"\n\n\"The Hell Moon doesn't recognize any motionless being as a creature. Just stop when the Hell Moon's eyes are open. And exactly once every five seconds, when all of the Hell Moon's eyes close, you may slowly move one step forward.\"\n\n*Red light, green light?*\n\nGrid scanned the island. The landmass stretched far beyond his vision—easily two or three times the size of Yeouido. His throat went dry.\n\n\"Moving one step every five seconds...\" He turned back to Bini. \"Where is my destination?\"\n\nBini's grin widened. \"The other end of the island. The gate to the next island is there.\"\n\nSilence.\n\nGrid had been developing. Growing. His intelligence had increased. His emotional control had improved. He was becoming a better person.\n\nNone of that mattered right now.\n\n\"Are you crazy?\"\n\nGrid lunged forward and grabbed the fairy's diaper. Bini yelped as half his backside was exposed to the air.\n\n\"What are you doing?!\"\n\nGrid pulled the fairy close, their faces inches apart. \"Your method of helping me is to tell me that moving one step every five seconds is the best way to cross this island? You're not helping. You're mocking me.\"\n\nHe couldn't fathom how many days it would take. The mental stamina required. The concentration. And that was assuming no complications.\n\n*What happens if a monster attacks while I'm frozen?*\n\n\"Twelve hours!\" Bini squirmed in Grid's grip. \"In twelve hours, the sun will come up! Once the sun rises, the Hell Moon will hide itself!\"\n\nGrid's grip loosened slightly. \"I can only move one step every five seconds at night, but I can act freely during the day?\"\n\n\"That's right! Move during the day and endure the Hell Moon at night! You only have to suffer for a few days! It will be difficult with sleep deprivation, but it's possible!\"\n\n*The difficulty is too high.*\n\nFor the first time, Grid truly appreciated Kraugel's achievement. The man had reached the 30th island. How?\n\n*Wait. Could I use that?*\n\nThe second item he'd created after Failure. A specific piece of equipment designed for a specific purpose. Could he take advantage of it here?\n\nGrid released the diaper. Bini floated backward, adjusting his clothing with wounded dignity.\n\n\"Does the Hell Moon rely on senses other than sight?\"\n\n\"No.\" Bini's voice was small. Somewhere, Sticks was probably watching this humiliation. \"I have never heard of that.\"\n\n\"Is that so?\"\n\nA smile crept across Grid's face. Not a friendly smile. A dark, calculating expression that belonged to someone who'd just found a loophole in the rules.\n\nHe had a way to avoid the Hell Moon's gaze. But not now. He needed rest. Real rest. His body and mind were running on fumes.\n\n\"Log out.\"\n\n***\n\nYoungwoo stretched his arms overhead, vertebrae popping in a satisfying cascade. Morning sunlight streamed through the living room windows. The smell of coffee drifted from the kitchen.\n\n\"I got a call from Team Leader Do Minjun.\"\n\nSehee stood by the counter, phone in hand. She was already dressed for the day, hair pulled back in a neat ponytail.\n\n\"Team Leader Do Minjun?\" Youngwoo rubbed sleep from his eyes.\n\n\"She's with Saint Constructions,\" Sehee explained. \"The company handling your building. She called with an interim report. Said the construction is going well. She also mentioned you should visit the site. Apparently it's unusual for a client to never visit their own project.\"\n\nYoungwoo padded toward the coffee maker. \"Where would I find the time? I'm too busy with the game.\"\n\nSehee studied her brother with an expression he couldn't quite read. \"Shin Youngwoo, you've become very trusting of people lately. In the old days, you would've assumed they were cutting corners since you couldn't see them. You would've monitored the construction site twenty-four hours a day.\"\n\nHe poured himself a cup, considering. \"Saint Constructions is doing the work in my name. Besides, it was a company recommended by Yura. I don't have any concerns. Do you want to go visit with Mom and Dad?\"\n\n\"Yes, understood.\"\n\nSehee had always thought of her brother as someone who needed care. Someone to be managed and protected. But recently, that perception had shifted. Now she trusted him. Followed his judgment. Respected his decisions.\n\nWhy did she trust him? Was it the money? The celebrity status? No. Those were superficial changes. What had transformed was Youngwoo's fundamental nature.\n\n\"Kraugel.\" She set her phone down. \"I looked him up online. He's incredibly accomplished, isn't he?\"\n\n\"He's beyond just accomplished.\"\n\n\"Aren't you excited about competing against someone like that?\"\n\nYoungwoo met her eyes. \"There are no grounds for excitement. I probably would've lost if he and I had fought under the same conditions.\"\n\nSehee blinked.\n\nHumility? From her brother? The same brother who used to blame the world for every failure?\n\n\"...\"\n\nShe gave a bittersweet smile. Youngwoo's eyes had deepened. They held something she'd never seen there before—self-awareness, maybe. Or acceptance of his own limitations.\n\n*Why is he changing every day?*\n\nHer brother was growing. Evolving at a pace that left her struggling to keep up. Part of her felt proud. Part of her felt...distant. Like he was moving toward a horizon she couldn't quite see.\n\n\"I'll get dressed and have breakfast,\" Youngwoo said.\n\n***\n\nSticks drummed his fingers against his staff.\n\n*Tap. Tap tap.*\n\n\"When will he come?\"\n\nThe old sage understood the nature of users—those blessed or cursed by the gods to never truly die. He'd watched the black-haired man vanish from the 20th island mid-trial. A log-out, they called it. Temporary escape from the world.\n\nHis eyes, deep within the shadow of his hood, flickered with tension. Irritation. Anticipation. The magic orb before him showed only an empty island and the Hell Moon's patient vigil.\n\n\"Medicine. My medicine.\"\n\nSticks fumbled for the vial at his belt. His hands shook as he uncorked it and downed the contents—a homemade concoction, bitter and medicinal. He took a deep breath, willing his heart to slow.\n\n*Can he even break through the 20th island?*\n\nLogically, the odds were abysmal. In all the centuries the archipelago had existed, only one person had ever passed the 20th island. One. The trial demanded extreme patience. The wisdom to avoid monsters while remaining perfectly still. The mental fortitude to endure days of glacial progress.\n\n*Don't be disappointed. Empty your mind.*\n\nBut expectations crept in anyway. So far, the black-haired man had exceeded Sticks' every prediction. Shattered assumptions. Accomplished the supposedly impossible.\n\nThe magic orb flared.\n\n\"He's starting!\"\n\nSticks leaned forward. The Hell Moon's countless eyes opened in unison, bathing the island in their malevolent gaze. The red pupils swept across the terrain like search lights.\n\nThe black-haired man appeared.\n\nThen vanished.\n\n\"He's gone!\"\n\nSticks' staff clattered to the floor. It wasn't stealth—stealth magic left traces, distortions in the air. This was perfect invisibility. Complete erasure from perception.\n\n\"This isn't invisibility magic!\"\n\nHis sage's mind worked frantically, analyzing what he'd witnessed. Then understanding crashed over him like a wave.\n\n\"An invisibility cloak! A heritage from the altar of legends!\"\n\nOnly two such cloaks existed in recorded history. Legendary artifacts created by the master tailor Kruger two centuries ago. How did this man possess one? Who was he? What connections did he have?\n\n\"Uh...kuock!\"\n\nThe revelation fractured something in Sticks' mind. Shock overloaded his ancient nervous system.\n\n*Thump.*\n\nThe sage clutched his chest and toppled forward. His robes pooled around him as he hit the stone floor. With trembling fingers, he reached for another vial—medicine prescribed by a professional pharmacist for moments exactly like this.\n\nThe magic orb continued to display the 20th island, where an invisible challenger mocked the Hell Moon's thousand-fold gaze."
}