{
  "id": 362,
  "title": "Chapter 362",
  "content": "# Chapter 362\n\n> [Hooded Zip Up]\n> \n> Rating: <span class=\"rarity-unique\">Unique</span>\n> \n> Durability: 57/61 Defense: 10\n> \n> * Movement speed will increase by 30%.\n> * Wind resistance will increase by 20%.\n> \n> A cloak designed by a legendary blacksmith. However, the appearance is different from the normal look of a cloak.\n> \n> Thanks to the sylphid scales being used as the material, affinity with wind and movement speed will increase. You can hide while wearing it, but the stealth will be turned off when an enemy is attacked.\n> \n> Conditions of Use: None.\n> \n> Weight: 5\n\nGrid adjusted the hood over his face, feeling the impossibly light fabric settle around his shoulders. The biggest advantage of the Hooded Zip Up was its duration. His stealth activated the moment he wore it and remained active without draining a single point of mana. No magical energy signature meant no traceable aura. \n\nOf course, unlike an assassin's true Stealth skill, sharp-eyed opponents could still pierce the veil if they knew what to look for. Against those with exceptional perception, the cloak was just expensive fabric.\n\nBut on the 20th island, that weakness didn't matter.\n\nThe hell moon relied purely on sight. Grid surged forward, his movement speed amplified by the cloak's enchantment. Above him, the grotesque sphere of eyes swept the landscape in lazy arcs. Not one of those tens of thousands of pupils tracked his movement. He weaved between scattered monsters, their heads turning away as if he didn't exist.\n\nThe perfect counter. Grid broke through the 20th island without shedding a drop of blood.\n\n***\n\n> [You have entered the 21st island.]\n\nGrid stopped at the threshold, his chest tight with an emotion he couldn't quite name.\n\n*Amazing. It's really amazing.*\n\nBut he wasn't admiring himself. He was thinking of Kraugel.\n\nThe Sword Saint candidate had a normal class. No legendary skills. No access to every item type in existence like Pagma's Descendant granted. Yet somehow, he'd reached the 30th island. *How did he pass the hell moon without an invisibility cloak? What method did he use?*\n\n'He isn't only strong in battle and hunting.' Grid clenched his fist. 'Kraugel is an overwhelming monster in all respects.'\n\nAs he tried to imagine the strategy that would allow a normal swordsman to survive tens of thousands of watching eyes, Grid finally understood the weight behind Kraugel's titles. The Sky Above the Sky wasn't hyperbole.\n\n\"Challenger?\"\n\nBini's voice cut through his reverie. Grid blinked and looked around properly for the first time.\n\nFog. Thick, suffocating fog that turned the world into a wall of gray three feet from his face. He raised his hand. His fingers vanished into the murk at the wrist. A primal unease crawled up his spine, the same instinct that made children fear the dark.\n\nBini laughed at his expression.\n\n\"You are lucky. You won the Fog Island. You can pass the 21st island for free.\"\n\nGrid's head snapped toward the fairy. \"Fog Island?\"\n\n\"It is an island with a store.\"\n\n*A store...* Grid's pulse quickened. He thought about the challenger points accumulating in his status window.\n\n\"Are you talking about the Challenger Store?\"\n\n\"Yes. You can buy goods with challenger points.\" Bini adjusted his tiny spectacles, looking smug. \"The emergence of Fog Island is random. One extremely lucky person met it on the 10th island. One unlucky soul didn't see it despite reaching the 30th island.\"\n\n*That unlucky person is Kraugel.*\n\nGrid felt a strange sympathy. Someone in this world actually had worse luck than him. He cleared his throat. \"So, do you know where the store is located? I can't see in front of me because of this fog.\"\n\n\"It is anywhere you go. The store will naturally be waiting for you.\" Bini's grin widened. \"But it's only open for five minutes, so you'd better think in advance about what you'll buy.\"\n\n\"I don't know what it sells.\"\n\n\"Hehe, did you forget that I am the helper fairy?\" Bini puffed out his chest and pushed his glasses up again, a gesture Grid was beginning to recognize as the fairy's version of preening. \"I have already figured out most of the goods sold in the store.\"\n\n\"Ohu?\"\n\n*This person is actually helpful.*\n\nGrid's opinion of Bini rose several notches. The fairy cleared his throat importantly.\n\n\"There are four types of products. Teleportation scrolls to the East Continent, elixirs, various class change books, and skill books. The class change books range from normal to rare rated, while the skill books range from normal to unique rated.\"\n\nGrid's eyes widened.\n\nRare things that couldn't be bought with money. Items that would cause bidding wars in the tens of millions of gold. And they were just... sitting here in the fog, waiting.\n\n\"Among them, the East Continent portal scroll has the lowest value.\" Bini waved dismissively. \"Maybe it's sold because most challengers come here to find a way to move east? But you can get it for free when you meet Sticks.\"\n\n\"Kraugel got the scroll from Sticks?\" Grid asked. \"The person who reached the 30th island?\"\n\n\"That's right. But six other challengers met the store before the 10th island and purchased the portal scroll immediately. They didn't even try to challenge the later islands.\" Bini sniffed with disdain. \"Cowards.\"\n\n*It isn't cowardly. It's wise.* Grid suppressed a smile. *So there are seven users who have moved to the East Continent so far.*\n\nHe filed that information away and started walking. The fog swallowed his footsteps. After thirty seconds of blind stumbling, a gentle light bloomed ahead.\n\nA carriage materialized from the murk.\n\nIt was shaped like a pumpkin, all curved orange sides and a soft golden glow that pushed back the gray. Various goods lined the interior like a traveling merchant's display.\n\n\"That is the Challenger Store.\"\n\nGrid approached slowly. The hairs on his arms stood on end. Something about an unattended shop appearing in the fog struck him as deeply wrong on an instinctual level.\n\n\"Isn't there a store owner?\"\n\n\"No. It's an unattended store.\"\n\n\"Ah.\"\n\n*If there was an owner, I could've asked questions.* Grid stepped up to the carriage and began scanning the products. Information windows popped up with each glance.\n\n> [East Continent Movement Portal Scroll]\n> \n> You can go to the starting village of 'Pangea' on the East Continent.\n> \n> Weight: 0.1\n> \n> Price: 50 Challenger Points\n\n> [Elixir]\n> \n> A medicine that increases a certain stat by 10 points.\n> \n> Weight: 10\n> \n> Price: 250 Challenger Points\n\nGrid's breath caught. 'An elixir is so cheap!'\n\nAfter clearing 20 islands, he had exactly **901** challenger points. He could buy three elixirs that would sell for millions of gold on the open market. His hands actually trembled.\n\nThen his brain caught up. The people fortunate enough to find this carriage on the 10th island would have an average of 150 points. From a general challenger's perspective, the elixirs weren't cheap at all. The pricing wasn't kindness. It was calculated cruelty for everyone except anomalies like Grid.\n\nHe forced himself to move on to the other goods.\n\n> [Lightning Swordsman Class Change Book]\n> \n> Rating: <span class=\"rarity-rare\">Rare</span>\n> \n> You can change into a lightning swordsman.\n> \n> Weight: 100\n> \n> Price: 1,000 Challenger Points\n\n> [Explosion Sorcerer Class Change Book]\n> \n> Rating: <span class=\"rarity-rare\">Rare</span>\n> \n> You can change into an explosion sorcerer.\n> \n> Weight: 100\n> \n> Price: 1,000 Challenger Points\n\nGrid exhaled slowly. Rare rated hidden classes. A year ago, they would've sold for billions of won. Now their value had crashed. Players had learned the gap between 3rd advancement classes and rare rated classes was smaller than the hype suggested.\n\n*Bini said the classes only go up to rare rated.*\n\nDisappointment settled in his chest. Grid moved to the skill books, hoping for something better.\n\n> [Dash to Turn the Tables]\n> \n> Rating: <span class=\"rarity-rare\">Rare</span>\n> \n> Dashes to the target and deals damage proportional to the target's defense. They will be in a rigid state for 0.3 seconds.\n> \n> Conditions of Use: None.\n> \n> Price: 400 Challenger Points\n\n> [Blazing Short Rain]\n> \n> Rating: <span class=\"rarity-epic\">Epic</span>\n> \n> Causes a rain of fire for three seconds in the specified area. The damage dealt to the enemy is proportional to the caster's magic power and physical attack power.\n> \n> Conditions of Use: None.\n> \n> Price: 900 Challenger Points\n\n*Pass.*\n\nMost players would kill for rare and epic rated skills. But Grid had legendary skills. These were just a waste of points. Unique rated skills, however, were different.\n\nHe thought of Fulito, the 19th knight of the Red Knights. The man had dropped 'Aura Festival,' a unique rated skill book with outstanding performance. Grid coveted that tier of power.\n\n*Although Aura Festival is rotting in my warehouse.* He'd kept it in storage because it was a lesser version of Transcended Link. No reason to learn it himself. He was waiting for an opportunity to sell it at a high price.\n\n\"Eh?\"\n\nGrid froze. His eyes locked onto a skill near the bottom of the list. It wasn't hidden. Not rare, not epic, not unique.\n\nJust normal.\n\n> [Weapons Mastery]\n> \n> Rating: Normal\n> \n> Type: Passive\n> \n> The Weapons Mastery skill.\n> \n> Price: 6,000 Challenger Points\n\n*Weapons Mastery!*\n\nHis heartbeat thundered in his ears. Weapons Mastery was a skill that increased attack power and accuracy rate regardless of weapon type. Only a small number of combat specialized classes could obtain it. The strongest passive skill available to those few blessed classes.\n\nAnd this insane store was selling it.\n\n*I want it!*\n\nGreed, hot and sharp, flooded his veins. It was natural. Grid had the class feature that allowed him to equip all weapons. But he didn't have any mastery type skill. Every weapon felt slightly wrong in his hands, like wearing shoes a size too small. Now he could fix that fundamental limitation.\n\nThe problem was the price.\n\nGrid's jaw clenched. \"Why is a normal skill so expensive?\"\n\n\"Originally, passive skills are expensive.\" Bini floated closer, peering at the price tag. \"Among them, the Weapons Mastery skill is the most expensive.\"\n\n\"Shit.\"\n\nTime was ticking away. Grid checked the countdown timer in the corner of his vision and felt his irritation spike.\n\n\"If I miss this store now, does it mean I can't use it again?\"\n\n\"No. As I said earlier, Fog Island randomly emerges. It might appear again in the future.\" Bini tilted his head. \"But it isn't certain.\"\n\n*Then I'll wait for next time.*\n\nGrid stepped back from the carriage. He'd have to clear every other item to afford Weapons Mastery. The East Continent Portal Scroll was something he could get for free from Sticks anyway. Better to save his points.\n\nBini's eyes glowed like lanterns. \"I was afraid that you would buy the portal scroll and leave, but you truly are the challenger who broke through to the 20th island.\"\n\nGrid shrugged. \"It's a waste to buy something when I can get it for free.\"\n\n*Will I be able to collect 6,000 challenger points?* The number seemed astronomical. *Even if I fail this time...*\n\nHe would grow stronger and challenge it again. Grid turned away from the pumpkin carriage and let the gate pull him forward.\n\n***\n\n> [You have entered the 22nd island.]\n\n\"Come quickly.\"\n\nEnthusiasm burned in Grid's chest like a furnace. He barely waited for his feet to touch solid ground before scanning the island's structure, cataloging terrain and potential threats with the efficiency of long practice.\n\nBini materialized beside him. \"Up to the 25th island, it's a fight against time.\"\n\nA mission window appeared, proving the fairy's words.\n\n> [22nd Island]\n> \n> Wipe out the monsters!\n> \n> First Clear Reward: 162 Challenger Points\n\n\"Okay, I see.\"\n\nGrid didn't hesitate. The God Hands materialized in a flash of gold. Noe stretched his wings with a pleased yowl. Randy's form rippled into existence beside them. Grid drew Failure and charged into the first cluster of monsters.\n\nExperience poured in. Skill proficiency ticked upward with every swing. Challenger points accumulated like drops filling a bucket.\n\nFour days blurred together in a haze of blood and grinding.\n\nGrid killed thousands of monsters across three islands, his mind focused on a single number: **6,000**. Finally, exhausted but alive, he crossed the threshold onto the 25th island.\n\nSticks was waiting for him.\n\nThe sage stood at the center of the island, robed and hooded. But something was wrong. The figure swayed.\n\n\"You... You are Pagma's Descendant...\" Sticks' voice was thick, slurred. \"Even... Hell's strongest... Demonic beast... If it's you... Contaminated Hall of Fame... Arrived... Ugh! Kuk!\"\n\n\"...?\"\n\nSticks collapsed.\n\nGrid lunged forward on instinct, catching the sage before his head cracked against stone. The body in his arms was burning up, fever-hot even through thick robes. Sticks' breathing came in shallow, ragged gasps.\n\n*Something is wrong.*\n\nA terrible certainty settled over Grid. He knew how unlucky he was. Reality had a way of twisting the knife.\n\n> [A quest has been created.]\n\n> [Save Sticks!]\n> \n> ★ Hidden Quest ★\n> \n> Sticks' illness has worsened after watching your surprising performance.\n> \n> Fortunately, it can still be treated with medicine.\n> \n> After learning the method to prepare the medicine from Sticks, take care of him!\n> \n> Quest Acceptance Reward: 'Recipe: Elf's Miraculous Medicine' will be acquired.\n> \n> Quest Reward: Affinity with Sticks will rise to the maximum.\n> \n> Quest Failure: Sticks' Death.\n> \n> [Would you like to accept the quest?]\n\nGrid stared at the window. \"...No, why will he die if it can still be treated with medicine?\"\n\nThe logic didn't track. But it was a hidden quest, and the reward looked valuable. More importantly, Sticks couldn't be allowed to die. Grid thought as positively as possible and mentally accepted.\n\nHis hands moved automatically, lowering Sticks to a more comfortable position. The hood fell back.\n\nA young man's face emerged, beautiful in the way of statues, all sharp angles and perfect symmetry. Sweat plastered silver-white hair to his forehead. His ears tapered to elegant points.\n\n\"Elf...?\"\n\nGrid blinked. He'd played Satisfy for nearly two years and never seen an elf in person. Curiosity warred with a more immediate frustration.\n\n*Normally, shouldn't it be a female elf?*\n\nThe first elf he met was male. Now he had to nurse a man alone on an island with no one else around. Grid looked up at the empty sky and sighed.\n\nOnce again, reality was relentless. Movies and manhwa lied.\n\n***\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}