{
  "id": 364,
  "title": "Chapter 364",
  "content": "# Chapter 364\n\nAccording to Sticks, the Behen Archipelago was a beautiful and holy place until 200 years ago. It was praised as a sanctuary where former legends passed on their power to current legends. But that was a story of the past.\n\nNow the Behen Archipelago was transformed into a field of trials with all types of dangers. Who caused this? Sticks didn't know, despite his age. He vaguely guessed that he would find the answer if he reached the last island.\n\n\"I must find the answer. If the succession doesn't function properly, the legends of the current day won't be able to exercise their full strength.\"\n\n\"What does that have to do with you?\"\n\nSticks wasn't a legend. He wouldn't lose anything if the Hall of Fame failed to function.\n\n\"I don't know why you sacrificed 97 years because you want to purify this place. But I am thankful from my position.\"\n\nSticks smiled gently and explained his reason.\n\n\"The legends need their strength to protect the order of this world.\"\n\n\"The order of this world?\"\n\nIt was cloudy, but Grid got a rough feeling.\n\n\"You're doing this for everyone?\"\n\n\"Yes.\"\n\n\"It's a noble mission.\"\n\nIt wasn't a mockery. His son Lord, his beloved Irene, Khan, Piaro, Jude, Rabbit, and everyone else. Grid was aware of the precious world they lived in. He didn't know the specifics, but Sticks was sacrificing himself to protect the world.\n\nGrid stepped toward the gate. \"I will repay you for your hard work. Believe in me.\"\n\nHe crossed the threshold.\n\n> [You have entered the 30th island.]\n>\n> [Your level has dropped to level 1.]\n\n\"What?\"\n\nGrid doubted his eyes. His level had dropped to one? His cognitive ability couldn't figure this out.\n\n*What is this?*\n\nSticks sighed. \"Has your body changed? This is the reason why I couldn't break through here. There is a very powerful curse, so I can't draw out all my strength.\"\n\n\"...\"\n\nNo, wasn't it too much for a curse to bring him back to level one? Sticks continued to explain.\n\n\"It reproduces the nightmare of the challenger.\"\n\nThe 30th island. Nightmare.\n\n\"This island reproduces the greatest trial that the challenger has already experienced. In my case, I was confronted with Reiders in front of the world tree. My power was suppressed to what it used to be and I couldn't run away from Reiders. I can never break through the 30th island. I hope that the trials you experienced in the past aren't too heavy.\"\n\n\"...?\"\n\nA question mark appeared above Grid's head as he listened to Sticks.\n\n*Wasn't the greatest trial when I was looking for Pagma's Rare Book?*\n\nHis level and situation at that time should be reproduced, so why was he level one? What big ordeal could he experience at level one?\n\n*...Ah.*\n\nGrid looked around at the scenery of the island and frowned. The scene reproduced by the 30th island. He belatedly realized that it was the beginner area around the fortified city of Patrian.\n\n*I was killed dozens of times by the rabbits and bears.*\n\nIt was the moment when the black history he sealed off for his self-defense emerged again.\n\n***\n\n\"Piaro intervened.\"\n\nThe showdown between the 1st ranked Kraugel and legendary class Grid. Chairman Lim Cheolho watched the recorded video from beginning to end and was convinced by the results.\n\nHe tossed an empty beer can aside. \"But surely... I didn't know that Kraugel would challenge Piaro.\"\n\nKraugel's pride and challenging spirit was higher than predicted, as he chose the hard way by challenging the strongest. Lim Cheolho emptied a second beer can and laughed.\n\n\"I never imagined that Piaro would grow to that extent.\"\n\nIt wasn't enough to create a new legendary class, which was different from the nine legendary classes that were inherited. Piaro's current appearance was contradictory to the original plan. Originally, he was a key character prepared for the Empress Marie, Episode 3 storyline, as well as the people's alliance storyline.\n\nGrid was amazing, finding a character filled with hatred and vengeance and making him walk a new path.\n\n*Making an NPC his subordinate and actively utilizing him...*\n\nSatisfy was a game with a large degree of freedom. He didn't know if Grid did this on purpose from beginning to end.\n\n\"Um.\"\n\nChairman Lim Cheolho emptied his third can of beer and rose from his seat. It was to get a new can of beer out of the fridge. At that moment.\n\n> [Quest SH100B7 has been triggered.]\n\n\"...!\"\n\nChairman Lim Cheolho's eyes widened as he heard Morpheus' words.\n\n\"By whom?\"\n\nIn fact, it was a nonsensical question. Quest SH100B7. It was a quest activated when a legendary class user reached the 25th island of the Contaminated Behen Archipelago. At this point, there were only two legendary classes.\n\nGrid and Yura. But Yura's level was still too low.\n\n> [Grid.]\n\nLim Cheolho grimaced. \"Of course.\"\n\nGrid's current self couldn't clear the Contaminated Behen Archipelago quest.\n\n\"It is relatively easy to reach the 25th island using items...\"\n\nBut from the 30th island, a higher level of control was required. Most of the items wouldn't be applied, so Grid was at a disadvantage.\n\n\"It might be possible if Grid maintains his current growth and challenges it again in half a year. At present, isn't the quest clearance rate close to zero?\"\n\nMorpheus replied with an answer that surprised Lim Cheolho.\n\n> [Grid has an 88.19% chance of clearing the SH100B7 quest. The difficulty of his trials is very low.]\n\n\"...\"\n\nLim Cheolho ordered one more chicken. He was planning to monitor Grid in real time.\n\n***\n\n> **[30th Island]**\n>\n> The place and situation where you had the most deaths is 100% recreated.\n>\n> Overcome the trial and jump past your previous self!\n>\n> **Mission Clear Condition:** Gain three levels.\n>\n> **First Clear Reward:** 500 Challenger Points.\n>\n> [The mission will start 30 minutes from now.]\n\n*The space where I suffered the most deaths...*\n\nThus, the space reproduced was the novice area of Patrian. It was a reminder of how incompetent Grid was when he first started playing the virtual reality game.\n\nHop hop.\n\nBark bark. Bark bark bark!\n\nThere were rabbits in the forest, deer at the lake shore, and dogs playing with children. Sticks nervously observed the scenery of the peaceful forest and tilted his head.\n\n\"Why was this chosen as a trial?\"\n\nGrid was too embarrassed to explain to Sticks. It was too unfortunate to see that these rabbits and deer were comparable to a terrible dragon like Reiders. Therefore, Grid remained silent as he opened his status window.\n\n> **Name:** Grid\n>\n> **Class:** Beginner\n>\n> **Health:** 123 **Mana:** 15\n>\n> **Strength:** 6 **Stamina:** 7\n>\n> **Agility:** 4 **Intelligence:** 5\n>\n> **Skills Possessed:** None\n\n\"...\"\n\nThe situation was recreated 100%, so even his class and titles were reset. He was armed with equipment for beginners. Most of his hard earned items were disabled.\n\nSticks kept making a fuss.\n\n\"Where is this place? It's so common that it's difficult to tell. Is there a huge monster at the end of this forest? An ordeal given to Pagma's Descendant... Don't tell me you met a dragon? This... It's said that the difficulty of the 30th island has increased in proportion to the challenger's ability.\"\n\n\"...\"\n\nGrid didn't say anything. He ignored Sticks, walking out towards the rabbits grazing.\n\n*I will get revenge.*\n\nHe hadn't been able to adapt to virtual reality games yet. He couldn't move his fingers or toes at all, and his arms and legs moved separately from what he wanted.\n\n*The white rabbit who killed me with its front teeth, the black rabbit who slapped me with its hind legs, the grey rabbit that headbutted me to death!*\n\nHe would completely wash away his disgrace and write a new history!\n\nBuuong~\n\nGrid firmed up his heart and wielded his sword. The wooden sword flew at a very slow speed. It was a level that the hopping rabbits could avoid.\n\nGrid grimaced. Just a few minutes ago, he had 2,800 **Strength** and 1,800 **Agility**. It was difficult to adapt after it decreased to **6** and **4** points respectively. It was like regressing from a healthy adult to a newborn baby.\n\nGrid was embarrassed by the slow attack as the rabbit ran up to him. In the past, the grey rabbit had given Grid hell by hitting him a few times. But now its strikes couldn't hit Grid.\n\n*Deftly.*\n\nGrid used the footwork of Pagma's Swordsmanship, Link, to move to the left and evade the grey rabbit. They were skilled movements that an ordinary level 1 user wouldn't be able to show. It wasn't an exaggeration to say that it was like a level 60 user. It was enough to be listed in the Guinness Book of Records for movements that a level 1 beginner could show.\n\n\"Okay!\"\n\nGrid marvelled at his own ability. However, there was no time to rest. The rabbit started to realize that its attack was in vain and called its kin for a pincer attack.\n\n\"This...!\"\n\nGrid's face tensed for the first time. In the past, he would've allowed the rabbits' pincer attack. But now Grid was different.\n\n\"I...!\"\n\n*Teong!*\n\nGrid showed the highest concentration as he blocked the white rabbit's long, pointed front teeth with a wooden sword. At the same time, he aimed his fist.\n\n*Peeok!*\n\nThe white rabbit was in tears after being hit hard. The eyes of the black rabbit shone. The black rabbit's kick aimed at Grid's chest, who avoided it.\n\n*This ridiculous guy.*\n\nGrid scoffed and aimed his wooden sword.\n\n*Ppak!*\n\n*Jjik!*\n\nThe black rabbit's head was hit hard and it collapsed. Grid kicked it and roared.\n\n\"I am a legend!!!\"\n\nCurrently, Grid's performance was higher than his stats.\n\nIn no time, he had fully adapted to his **6 Strength** and **4 Agility**, and could freely manipulate his body to strike at the rabbit with the wooden sword.\n\nHe was the legend who killed several strong bosses, such as the Yatan Servants, Pope Drevigo, the Great Demon Hell Gao, Vampire Earl Elfin Stone, and who had experience fighting the legendary Piaro and 1st ranked Kraugel.\n\n*Peeok! Peok peok! Peeeeok!*\n\n> [You have defeated a white rabbit.]\n>\n> [**5 experience has been acquired.**]\n\n> [You have defeated a black rabbit.]\n>\n> [**5 experience has been acquired.**]\n\n...\n\n...\n\nGrid's fighting style became more sophisticated the more he fought. He beat the rabbits with a skill that was hard to believe for a level 1 user. But Sticks wasn't inspired as he watched from the side.\n\nAt the same time, in Reidan.\n\n\"Abubu! Abuoo~!\"\n\nLord, armed with the 'Baby Wooden Sword' made by his father Grid, was hunting a 'desert rabbit' that was twice as powerful as a normal rabbit. Lord caught the rabbit while crawling around on all fours. It was enough to raise the admiration of Piaro, who once dreamt of being a sword saint.\n\n*The young lord has an excellent talent in swordsmanship.*\n\nPerhaps, the ultimate genius wasn't Kraugel, as Piaro thought."
}