{
  "id": 365,
  "title": "Chapter 365",
  "content": "# Chapter 365\n\nFists hammered into fur. Grid's knuckles connected with another rabbit's skull—a wet crunch, then silence. His chest heaved. Every muscle screamed. The wooden sword had splintered three rabbits ago, leaving him with nothing but his bare hands and the fading dregs of his stamina.\n\nOne rabbit left.\n\nIt lunged. Grid twisted, felt claws rake across his shoulder, then drove his elbow down into its spine. The creature's legs buckled. He didn't give it time to recover—grabbed it by the ears and slammed its head into the dirt. Once. Twice. The third impact left it twitching.\n\n*Finally.*\n\nThe last rabbit's eyes rolled back, forming perfect X-shapes as it expired. Grid staggered upright, hands trembling. Something broke loose in his chest—not quite relief, not quite triumph. For over a year, these fucking rabbits had been his nightmare. Dozens of deaths. The taste of grass and blood in his mouth as he respawned, again and again, while other players asked why the hell he was dying to *rabbits*.\n\nBlack history he'd tried to bury. Now buried for real.\n\n\"Kuahahaha!\"\n\nThe laugh tore out of him before he could stop it. Grid straightened immediately, adjusting his posture. *You're a Duke now. Master of Overgeared. Act like it.* He forced the laugh deeper, tried to make it sound dignified and authoritative instead of hysterical with relief.\n\nSticks stared at him, face twisted in confusion.\n\n*One of the nine legends... Pagma's Descendant... is fighting rabbits?*\n\nNo. Impossible. Sticks shook his head, refusing to accept what he'd witnessed.\n\n\"Grid.\" He stepped forward. \"Stop joking around. We need to move.\"\n\nThis forest felt peaceful—too peaceful. Which meant something terrible waited at its heart.\n\n*I faced a gourmet dragon. What if Grid encounters a light dragon? A dark dragon?*\n\nThe rabbits were clearly a distraction. Grid was testing him, or warming up. Soon, the real battle would begin. The dragon battle.\n\nSticks opened his mouth to warn him.\n\nA pillar of golden light crashed down from the sky, engulfing Grid where he stood over the rabbit corpse, wooden sword raised high.\n\nLevel up.\n\nSticks' jaw went slack. \"D-Don't tell me...\" His voice came out strangled. \"Hunting *rabbits* was your biggest ordeal?\"\n\nThe words hung in the air. Grid turned away, face hot.\n\n\"Hum hum.\"\n\nHe had nothing to say. No defense. Just the notification window burning in his vision.\n\n> **[System Notification]**\n> You have leveled up.\n\n> **[System Notification]**\n> You have leveled up.\n\n> **[System Notification]**\n> You have leveled up.\n\n*Good.*\n\nLow-level stats were fragile. Every point mattered when your foundation was this weak.\n\n*First, bring Agility to 10.*\n\nThe rest would pile into Strength. Standard beginner distribution—maximize damage, hunt faster, level faster.\n\n> **[System Notification]**\n> **Agility** has increased by 1.\n\n> **[System Notification]**\n> **Agility** has increased by 1.\n\nThe stat points flowed into place. Grid dismissed the windows and scanned the forest.\n\n*Next: the deer.*\n\nThose thirsty bastards gathered at the lakeshore would be next.\n\nHe crept forward, movements careful and measured. Deer were a different beast than rabbits—literally. For a level 2 beginner, they were a genuine threat. Three times the health. Three times the attack power. Those hooves could cave in a skull.\n\nBut he wasn't some clueless newbie anymore.\n\n*I'm a legend.*\n\nGrid's courage swelled as he closed in on the nearest deer. He tracked its legs, watching for the telltale shift of weight before a kick. Maintained distance. Struck when it turned its head to drink.\n\nThe 30th Island—the nightmare stage that reproduced a challenger's worst trauma at 100% difficulty—\n\nKraugel, the 1st ranked user, had struggled here.\n\nGrid turned it into a tutorial.\n\n***\n\n> **[System Notification]**\n> Mission Complete.\n\n> **[System Notification]**\n> **500 Challenger Points** acquired.\n\n> **[System Notification]**\n> Your level has been restored.\n\nThe power rushed back in like a flood. Grid gasped, staggered, caught himself. His body felt incredible—light and dense at the same time, coiled with potential energy.\n\nLevel 306. Pagma's Descendant.\n\nHe flexed his fingers. Stretched out his hand and released a blade of wind with barely a thought. Jumped. The ground fell away, and he hung in the air for a heartbeat before landing in a perfect crouch.\n\nEvery muscle responded with surgical precision. Every nerve fired in perfect sync.\n\n*This is what I've become.*\n\nThe realization hit him broadside. When was the last time he'd truly felt the difference? How much had he grown without noticing?\n\n*I haven't been using my body properly. I need to pay more attention.*\n\nHe clenched his fist. Real-time growth. Real-time improvement.\n\n\"...Are you really Pagma's Descendant?\"\n\nSticks' voice cut through his contemplation. The disbelief was naked in his tone.\n\nGrid met his eyes. \"I'm dull-witted,\" he said. No shame in it. Just fact. \"Always was. Inferior to everyone around me. I've been through trials that geniuses would never experience, because I was too stupid to avoid them.\" His jaw tightened. \"Does that disqualify me from being a legend?\"\n\nPride burned in his chest. Not arrogance—*pride*. In himself. In what he'd overcome.\n\nSticks' expression shifted. He shook his head slowly. \"No. That's not what I meant.\" A pause. \"Actually... I think I respect you more now.\"\n\nA dull-witted person, reborn as a legend. That took more effort than any genius could comprehend.\n\nGrid's mouth quirked. He turned toward the gate leading to the 31st island. \"Let's go.\"\n\n***\n\n> **[System Notification]**\n> You have entered the 31st Island.\n\nSticks had never made it this far. His eyes widened as the landscape materialized around them.\n\n\"A city?\"\n\nBuildings lined the streets in neat rows—hundreds of them. Carriages clattered over cobblestones. Crowds surged through the market district. The architecture was distinctly Western, fortified and practical.\n\n*Where is this? Why would the Hall of Fame recreate an entire city?*\n\n\"Patrian,\" Grid said quietly. His voice had gone flat. \"The fortified city.\"\n\nSticks glanced at him. \"You recognize it?\"\n\n\"Lived here for a year. Level 1 to 80.\" Grid's jaw worked. \"But I don't understand why it's here. I didn't die much in Patrian. Maybe ten times, total.\"\n\n\"Ten times? In a *city*?\" Sticks blinked. \"Did you commit crimes?\"\n\n\"No.\" Grid's tone was defensive. \"I got hit by wagons. A flowerpot fell on my head from a third-story window. Gangs of thugs would jump me in alleys.\"\n\n\"...Your luck is truly something else.\"\n\nBefore Sticks could elaborate, the system windows appeared.\n\n> **[System Notification]**\n> Your level has been reduced to **23**.\n\n> **[Mission Details: 31st Island]**\n> \n> The location and circumstances of your most-failed quest have been recreated at 100% accuracy.\n> \n> Overcome your past trial. Surpass your former self.\n> \n> **Clear Condition:** Complete the quest you repeatedly failed.\n> \n> **First Clear Reward:** 600 Challenger Points\n> \n> **First Clear Reward 2:** Original quest rewards\n> \n> **Time Until Mission Start:** 30 minutes\n\n\"The quest I failed most?\"\n\nGrid frowned, rifling through memories. So many failures. Which one had he fucked up the most?\n\nA golden exclamation point materialized above a distant building. The quest window unfurled.\n\n> **[Quest: Participate in Reserve Forces Training]**\n> \n> **Difficulty:** Regular\n> \n> Patrian is a fortified city built to control the Gauss Kingdom's northern expansion.\n> \n> All players residing in Patrian are required to complete monthly military training as members of the reserve forces.\n> \n> Report to the training grounds and complete the required courses.\n> \n> **Clear Condition:** Achieve a passing grade in all training exercises.\n> \n> **Reward:** Dependent on final rank.\n\nGrid's face went pale. \"Ah. *This* quest.\"\n\nMonthly. Mandatory. Inescapable. Refuse, and you'd be locked in the barracks until you complied.\n\n*I never passed. Not once.*\n\nHow many times had he tried? Dozens? The training was designed to forge useful soldiers—practical combat drills that Patrian's military could actually deploy. The standards were high.\n\nToo high for him.\n\n*The training was brutal.*\n\nWeapons proficiency. Formation drills. Squad tactics. All of it beyond his capabilities.\n\n*There were others who failed too,* Grid reminded himself. *Hundreds of us.*\n\n(In reality, fewer than ten. But his memory was generous to his ego.)\n\n***\n\n> **[Status Window]**\n> \n> **Name:** Grid\n> \n> **Class:** Warrior\n> \n> **Level:** 23\n> \n> **Health:** 1,161 | **Mana:** 45\n> \n> **Strength:** 187 | **Stamina:** 40\n> \n> **Agility:** 22 | **Intelligence:** 15\n> \n> **Skills:**\n> - Beginner Sword Mastery Lv. 2\n> - Beginner Armor Mastery Lv. 2\n> - Charge Lv. 1\n> - Full Swing Lv. 1\n\nGrid stared at the numbers. His eye twitched.\n\n*This stat distribution is fucking ignorant.*\n\nEverything dumped into **Strength**. A pitiful amount of **Stamina**. **Agility** and **Intelligence** left to rot at base Warrior values.\n\n*No attack speed. No evasion. No mana.*\n\nHe could use **Charge** or **Full Swing** exactly once before running dry. After that? Swinging a sword like a caveman with a club.\n\nHis equipment was worse.\n\n> **[Blunt Greatsword]**\n> Attack Power: 32~71\n> Attack Speed: -3%\n\n> **[Old Skull Helmet]**\n> Defense: 2\n\n> **[Old Orc Armor]**\n> Defense: 13\n\n> **[Old Goblin Shoes]**\n> Defense: 2\n\n*Mismatched trash from different monster types.* \n\nGrid wanted to punch his past self in the face. No wonder he'd taken a full year to reach level 79. Not even 80. *Seventy-nine.*\n\n*Can I even clear this quest with these stats?*\n\nHe exhaled slowly. The training would cover weapons proficiency and sparring. He could handle swords decently now—years of experience had built muscle memory. Pon had taught him spear fundamentals. But archery...\n\n*No Bow Mastery. Base Agility. I'll be lucky to hit the target once.*\n\nAnd sparring with 45 mana? He'd get one skill off before becoming a sitting duck.\n\nSticks was staring at him, tension radiating from every line of his body. \"Is this trial truly that difficult?\" His voice rose. \"Don't tell me—it's a dragon, isn't it?!\"\n\nThe curse had left scars.\n\nGrid shook his head. \"Relax. No dragons when you're with me.\"\n\nHe rolled his shoulders, loosening tight muscles. \n\n*Believe in yourself.*\n\nSince becoming Pagma's Descendant, he'd faced horrors that would make normal users quit the game. Armies. Legends. Bosses designed for fifty-man raids.\n\nNow he just had to beat his past self.\n\n\"Let's go.\"\n\nGrid strode toward the training grounds, jaw set. The gate loomed ahead.\n\nA voice barked out before he'd taken three steps inside.\n\n\"There you are, **Blue Falcon**! Late again! Hurry up, you worthless bastard! Move faster than the dog you fight like!\"\n\nGrid froze.\n\n*Blue Falcon.*\n\nThe nickname hit him like a brick to the face—a humiliation he'd buried so deep, he'd convinced himself it never happened. His expression twisted into something demonic.\n\nThe training instructor. That old bastard who'd mocked him, degraded him, made every session a waking nightmare.\n\n*I had no experience back then. I was helpless.*\n\nGrid's fists clenched.\n\n*Not anymore.*\n\nHis eyes burned as he locked onto the instructor's weathered face.\n\n*I'm going to make you eat those words.*\n\n---\n\n**Glossary of Common Terms:**\n\n**OG:** [Glossary Link]\n\n**Current Release Schedule:** 20 chapters per week.\n\n**Patreon:** Early access to unedited chapters available. Goals unlock bonus chapters."
}