{
  "id": 366,
  "title": "Chapter 366",
  "content": "# Chapter 366\n\nGrid understood the value of military drills better than most. His mandatory service in the South Korean army had taught him that much.\n\nDrills weren't just about marching in formation. They created order from chaos, prevented costly mistakes in battle, unified troops under a single purpose, and above all, made an army controllable. Without them, you didn't have an army. You had a mob.\n\n\"The reason formations matter is simple,\" Instructor Kaesul lectured to the assembled reservists. \"Picture this: your shield bearers are cowering in the back while your archers charge the front lines. That's not a battle plan. That's suicide.\"\n\nThe instructor paced before them, hands clasped behind his back.\n\n\"Higher training levels mean faster formation speed. Faster formations mean higher survival rates. It's that simple.\"\n\nGrid absorbed every word, a faint smile touching his lips.\n\n*In the past, I never paid attention to any of this.*\n\nBack then, the military training system in Satisfy had seemed like a cruel joke. Reservists dragged to a training ground for classroom lectures? He'd spent the entire session half-asleep, muttering complaints about game design philosophy.\n\n\"Hey. Blue Falcon.\"\n\nInstructor Kaesul's voice cut through Grid's thoughts like a knife.\n\n\"Is my lecture putting you to sleep again?\"\n\nPatrian was a fortress city. Its training regimen reflected that reality, brutal and uncompromising. Players received no special treatment.\n\n\"Or have you already mastered everything I'm teaching?\" The instructor's tone could have frozen water. \"On your feet!\"\n\nGrid stood immediately. He knew better than to argue with an instructor. Absolute obedience was the fastest path to a passing grade, and right now, that was all that mattered.\n\n\"Attention! At ease! Right face!\"\n\nGrid executed each command crisply. The instructor's expression shifted from anger to something more calculating.\n\n\"I'll wipe that smirk off your face.\"\n\nWhat followed was a deliberate stress test. The instructor barked contradictory orders, mixing simple movements with complex maneuvers. Front, rear, right flank, about face. He varied the pace, trying to catch Grid in a mistake, waiting for the moment he could assign punishment duty.\n\nBut Grid didn't falter.\n\n*Thud!*\n\n*Thud, thud, thud, thud!*\n\nHis boots struck the ground in perfect rhythm. Each movement was precise, unhesitating. No wasted motion. No confusion.\n\n*What the hell?*\n\nInstructor Kaesul's certainty began to crack.\n\nBlue Falcon was infamous among the training staff. Lazy, weak, incompetent. The man had never passed a single evaluation. His stamina was pathetic, his motivation nonexistent. Yet here he stood, performing every command flawlessly despite his physical limitations. His focus was absolute.\n\nBut it wasn't just his performance. Something else had changed.\n\n*His eyes.*\n\nGrid had always looked half-dead, staring at the world through dull, listless eyes like some bottom-feeding fish. Now those same eyes were sharp, burning with concentrated will. The transformation was so complete that some of the assistant instructors actually took a step back when Grid's gaze swept past them.\n\n\"Ahem.\"\n\nThe instructor cleared his throat and stopped issuing commands. He'd been waiting for Grid to collapse, but it was clear that wouldn't happen.\n\n\"You've... mastered the basic drills.\" Kaesul avoided Grid's eyes. \"Seems you've been practicing. Return to formation.\"\n\n\"Sir, yes sir!\"\n\nGrid's response rang out sharp and clear as he rejoined the other reservists. \n\nTruthfully, the whole experience left a bitter taste. As the Duke of the Eternal Kingdom, being humiliated by a training instructor felt absurd. Being tested like some raw recruit was an insult to everything he'd accomplished.\n\nBut pride was a luxury he couldn't afford.\n\n*Right now, I'm just a level 23 warrior.*\n\nThis was the past. A trial. To clear the 31st island, he had to play by its rules, no matter how degrading.\n\n\"Testing begins now!\"\n\nThree hours of intensive drilling culminated in a formal evaluation. The results shocked everyone present.\n\nBlue Falcon Grid ranked first among all reservists. While others faltered or lost focus, Grid had executed every command with mechanical precision, following the instructor's directions without a single error.\n\n*Did he hit his head or something?*\n\nThe training staff exchanged bewildered glances. None of them had an explanation.\n\n***\n\nThe next phase was field engineering. Combat construction.\n\nThe reservists gathered at the base of the mountain behind the training ground, each issued a single entrenching tool.\n\n\"It's just digging holes.\"\n\n\"How hard can it be?\"\n\nThe other reservists treated the exercise like a joke, already planning how quickly they could finish and return to the barracks.\n\nGrid knew better.\n\n*A fighting position isn't just a hole in the ground.*\n\nProper entrenchment could mean the difference between life and death. Cover from enemy fire, protection for your squadmates, defensive advantages. Every factor mattered.\n\n*Location is everything.*\n\nHe surveyed the mountainside with a tactical eye. Most of the terrain was exposed or difficult to work with. Then he spotted it. A natural position between two sturdy trees, surrounded by dense bushes and hanging vines. The vegetation would provide concealment. The trees would serve as anchoring points.\n\nGrid approached the spot and began working.\n\nThe other reservists laughed.\n\n'Those roots and vines will slow him down.'\n\n'Digging through that mess will take forever.'\n\n'Typical Blue Falcon. All effort, no brains.'\n\nThey found their own spots on bare, easy ground and attacked the soil with furious energy. Dirt flew. Their shovels bit deep and fast, driven by the singular desire to finish this tedious task as quickly as possible.\n\nMeanwhile, Grid worked at a fraction of their pace.\n\n*Going too hard, too fast is how you burn out.*\n\nMore than a year of compulsory service in the Korean military had taught him about labor. Manual work was one of the few areas where Grid had actual expertise, hard-won through countless hours of punishment details and field exercises.\n\n*Digging is an upper body workout. It taxes the heart and shoulders.*\n\nIf you wanted to avoid collapsing from exhaustion, slow and steady always won.\n\n*Chunk.*\n\nHis grip was textbook perfect. Right hand on the handle, left hand on the shaft for leverage and control. His pace seemed glacial compared to the other reservists, but that only lasted about ten minutes.\n\nThen Grid's technique revealed its value.\n\nWhile the others slowed, muscles burning and breath coming in ragged gasps, Grid maintained his rhythm. His shovel rose and fell with metronomic consistency, three times faster than anyone else now that fatigue had set in.\n\n\"Hah... Overcoming poor physical stats with pure skill.\"\n\nThe instructors observing from a distance couldn't look away. Grid's entrenchment technique was textbook. Better than textbook. It was professional-grade work, the kind of efficiency you'd expect from a combat engineer, not a reservist who'd barely scraped by in previous evaluations.\n\nNaturally, Grid claimed first place in the field construction test.\n\n*Good.*\n\nGrid allowed himself a small smile. Every test passed was another humiliating memory from the original timeline erased. His pride, battered by the encounter with Kraugel, slowly began to rebuild itself.\n\n***\n\nWeapons proficiency testing.\n\nThe reservists stood in a line, having completed basic familiarization training with spears, swords, and bows. Before each of them stood a training dummy.\n\n\"First weapon: Spear!\" Instructor Kaesul's voice cracked like a whip.\n\nThe moment he spoke, colored dots materialized on each dummy's torso. Blue circles the size of a coin. Red and green targets the size of a fist. They blinked into existence randomly across the straw-filled bodies.\n\n\"You have three minutes. The colored targets will appear in random sequence. Blue targets are worth one point. Red targets are worth five points. Green targets are worth ten points. You need fifty points minimum to pass.\"\n\nIn the original timeline, Grid had never cleared this test.\n\nThe targets appeared and vanished too quickly, with no predictable pattern. Past-Grid, with his poor coordination and unfamiliarity with the spear, had flailed uselessly for three minutes before failing with a score in the teens.\n\nNow, everything was different.\n\n*Thud!*\n\nGrid shifted his right foot back into a proper stance and raised the spear. He'd hunted alongside Pon, the strongest spearman in Satisfy. He'd watched, absorbed, learned. Every movement, every technique.\n\nMore importantly, the current Grid possessed knowledge that transcended mere observation.\n\n*I understand the Gale Spear. I know what makes a divine weapon.*\n\nWhen you comprehended a weapon's fundamental structure, its purpose and design, you instinctively understood how to wield it.\n\n*Flash!*\n\nA blue dot materialized on the dummy's left shoulder.\n\n*Crack!*\n\n\"What the—!\"\n\nThe sharp report of wood striking straw made everyone's heads snap toward Grid. His spear had punched through the exact center of the blue target. The precision was inhuman. The other reservists stared in stunned disbelief, but Grid only frowned.\n\n*My agility is too low.*\n\nEven knowing the optimal strike path, his body couldn't execute it perfectly. The spear's velocity was inadequate. His thrust had aimed for dead center but drifted slightly left due to poor muscle control.\n\nGrid started to spiral into self-criticism before catching himself.\n\n*Kraugel wouldn't waste time on regrets.*\n\nKraugel would accept the limitations and overcome them through sheer determination. Complaining changed nothing. Adaptation was everything.\n\n*Focus. Use what you have. Stop wishing for what you don't.*\n\nGrid's concentration sharpened to a razor's edge.\n\n*Crack!*\n\nThe spear struck again. Another blue target, another perfect hit.\n\nInstructor Kaesul's jaw went slack. Once could be luck. Twice was something else entirely.\n\n*What is happening to Blue Falcon today?*\n\nThe man seemed possessed. Like his body had been taken over by someone else entirely.\n\n*Crack-crack-crack-crack!*\n\nOne minute and twenty-three seconds after the test began, Grid's scoreboard read 100 points.\n\n\"Impossible...\"\n\nThe instructor's face went pale. One hundred points in eighty-three seconds. Even the most talented knight apprentices in Patrian's history had never achieved such a score. It defied belief.\n\nA notification window appeared in Grid's vision.\n\n---\n\n> [You have set a new record in Patrian's Reserve Forces Training: Spear Proficiency Test!]\n> \n> [The <span class=\"rarity-rare\">Rare</span> skill 'Spear Shot' has been acquired as a hidden reward.]\n\n---\n\n**[Spear Shot Lv. 1]**\n\nThrow a spear to deal 600% physical damage to the target. The enemy will be knocked down.\n\n* Warning: The spear must be retrieved within 30 seconds or ownership will be lost.\n* Mana Consumption: 150\n* Cooldown Time: 1 minute\n\n---\n\n\"Whoa.\"\n\nGrid blinked at the completely unexpected reward.\n\nThe retrieval requirement was annoying, true. Throwing away your weapon in the middle of combat was generally a terrible idea. But compared to Pagma's Swordsmanship, this skill had a remarkably short cooldown. The damage coefficient was excellent. And most importantly, it gave him a mid-range attack option.\n\nA thought struck him like lightning.\n\n*If the spear test gave me a rare skill... what about the sword test? The archery test?*\n\nGrid's motivation, already burning hot, roared into an inferno."
}