{
  "id": 367,
  "title": "Chapter 367",
  "content": "# Chapter 367\n\n*Not bad to have a spear skill.*\n\nGrid eyed the notification. Spear Shot required throwing the weapon, which could be disastrous for most warriors. One fumble and they'd watch their primary armament sail into the distance. But Grid had the God Hands. Those golden constructs could retrieve anything he hurled. He'd make it work.\n\n\"Test complete!\"\n\nThe instructor's bark snapped Grid from his thoughts. Around him, the reservists lowered their spears and exhaled. The average score hovered at 50 points with a three-minute completion time. Barely passing. Four men had failed outright.\n\nGrid's 100-point score in one minute and twenty-three seconds stood out like blood on snow.\n\nInstructor Kaesul wiped his brow. \"Next is swordsmanship.\"\n\nThe man looked ill. Grid couldn't blame him. Watching Blue Falcon transform overnight into something competent probably violated several laws of nature. While Kaesul wrestled with his confusion, Grid followed the assistants to a row of fresh scarecrows.\n\nThese dummies had colored lines painted across them.\n\nThe instructor cleared his throat. \"Cut along the red line for 5 points. Stab it and lose 5. The green dot awards 5 points for stabbing, loses 5 for cutting. Blue lines are worth 10 if stabbed, minus 10 if cut. Pass threshold is 50 points in three minutes.\"\n\nGrid studied the pattern. More complex than the spear test. In the past, his greatsword had been useless here. Stabbing with a blade that size? Impossible. He'd barely scratched together any points from those three color-coded targets.\n\n*But that was before.*\n\nHe'd used Kill hundreds of times since becoming Pagma's Descendant. He could pierce targets with a greatsword now. The intersecting lines and dots looked trivial compared to tracking Piaro's farming techniques or Kraugel's bladework.\n\n\"G-Grid passed!\"\n\n100 points. 39 seconds.\n\nInstructor Kaesul's jaw went slack. The assistants stared.\n\n*He has the makings of a knight!*\n\n*Was he pretending to be incompetent this whole time?*\n\nThey couldn't understand why he'd acted so pathetic before. Regardless, they had to acknowledge the truth. Grid possessed exceptional qualities. \n\nGrid himself felt nothing. After fighting death knights, vampires, and Great Demons, demolishing a stationary scarecrow barely registered as exercise.\n\n> [You have set a new record in Patrian's Reserve Forces Training Swordsmanship Test!]\n>\n> [The rare skill 'Continuous Stab' has been acquired.]\n\n> **[Continuous Stab Lv. 1]**\n> \n> Quickly stab the target 5 times.\n> \n> Every stab that hits will deal 100%, 120%, 150%, 190%, and 240% of your attack power respectively.\n> \n> **Mana Consumption:** 300  \n> **Skill Cooldown Time:** 3 minutes\n\nA multi-hit skill. Enemies could block or evade, but against slower opponents it would be devastating. The escalating damage multiplier gave it explosive potential.\n\n*Weaker than Kill, though.*\n\nStill, it filled a gap. When Kill was on cooldown, this would serve nicely.\n\n*Good.*\n\nWhat used to be torture now dispensed rewards like candy. Grid had to resist the urge to laugh out loud.\n\n***\n\nTwang!\n\nGrid stood in line with the other reservists, a target ten meters ahead. The archery test.\n\n*50 points with 10 arrows.*\n\nThe target had concentric rings: 10 points, 8 points, 6 points, 4 points, 2 points. Tension crept into Grid's shoulders.\n\n*Last time, I couldn't hit it once.*\n\nHonesty forced him to admit his doubts. Without Bow Mastery, arrow accuracy scaled with agility. His agility wasn't terrible, but archery demanded precision.\n\n*However.*\n\nHe'd watched Jishuka shoot for over a year. He'd crafted hundreds of bows for her and Reidan's soldiers. He'd tested every single one.\n\n*I'm not a complete novice.*\n\nBelieve. He could do this.\n\n*Ten meters. Only ten meters. I can focus that much.*\n\nEvery time he'd made a bow, he'd tested it at 100 meters. Grid pulled a slow breath through his nose and locked his eyes on the center ring.\n\n*Acquire that rare skill.*\n\nThe distance was laughably short. If he concentrated, truly focused, he could manage it.\n\n\"Hmm?\"\n\nGrid started to mimic Jishuka's stance, then stopped. He plucked an arrow from the quiver and frowned.\n\n*Did a level 3 blacksmith make this?*\n\nThe shaft had a visible twist. The weight balance was garbage.\n\n*Training budget cuts exist in-game too, apparently.*\n\nThe shaft needed straightening. The arrowhead and fletching required proper weight distribution. An unbalanced arrow wouldn't fly true no matter how much force propelled it.\n\n*Heavy materials can compensate somewhat, but this is bottom-tier wood.*\n\nGrid had forged over 100,000 arrows as Pagma's Descendant. He'd lost the Legendary Blacksmith's Craftsmanship skill when Braham possessed him, but his eye for flaws remained sharp.\n\n*I can win even without item power.*\n\nHis eyes narrowed.\n\n\"Grid, what is it?\"\n\nInstructor Kaesul's tone had shifted. No more sneering. No 'Blue Falcon' slurs. Grid met his gaze directly. \"These arrows are defective. Can I inspect the ones you're holding?\"\n\n\"What?\"\n\nKaesul blinked rapidly.\n\n\"Listen. Arrow construction is simple enough that anyone can make them, but their flight doesn't depend solely on the arrow itself. A novice who knows nothing about proper balance will naturally produce poor results. If the arrows are problematic, I'll issue replacements.\"\n\nKaesul gestured. An assistant jogged over with a fresh bundle.\n\nThe new arrows were equally terrible.\n\n*Would be different with Bow Mastery.*\n\nGrid straightened. \"Let me handle the arrows myself.\"\n\n\"Christ, he's not even a blacksmith.\"\n\n\"Acting cocky after learning a couple skills.\"\n\nThe assistants grumbled. They were annoyed at Grid for disrupting the schedule. But Instructor Kaesul surprised everyone.\n\n\"Understood. Try it.\"\n\nKaesul had despised Grid not just for incompetence, but for the lazy, defeatist attitude that accompanied it. Whining. Making excuses. Hating everything.\n\nNow Grid radiated determination. The instructor wouldn't stomp on that fragile growth.\n\n\"Thank you.\"\n\nGrid stepped away from the line. While the other reservists fired their volleys, Grid knelt and began repairing arrows.\n\n*I'd prefer to shave the shaft thinner and flatten it.*\n\nWith zero dexterity, he couldn't rely on manual precision. Experience and theory would have to suffice.\n\n*Might snap the shaft. Forget fancy work. Focus on balance.*\n\nGrid found a stone roughly one-third the size of the arrowhead. He snapped thin branches from nearby brush and lashed them behind the arrowhead with thread pulled from his tunic.\n\n*Better.*\n\nThe arrows had been so light that wind resistance sent them tumbling. Now they had proper heft. Grid smiled and began plucking feathers from the fletching. Extreme measures to equalize the shaft's left and right sides.\n\n*Crude, but functional.*\n\nHe was adjusting the shaft's curve when a notification appeared.\n\n> [The options of the 'Reserve Troops' Arrow' have changed.]\n\n> **[Reserve Troops' Arrow]**\n> \n> **Attack Power:** 1~2  \n> **Accuracy:** +2\n> \n> Someone saw what was wrong with the arrow and fixed it.\n> \n> The workmanship is poor, but the performance of the arrows has improved. It will fly quite far when fired well.\n> \n> **Weight:** 0.01\n\n\"Now it's all on me.\"\n\nGrid notified an assistant and moved to the shooting range. He breathed deep, forcing his shoulders down.\n\nCreak!\n\nTension hummed through his frame, but his hands were steady. The bowstring pulled back.\n\n*Remember the performance tests.*\n\nHe replicated an expert archer's form. Posture he'd memorized watching Jishuka since the Malacus raid. For ten meters, this would be enough.\n\n*Now!*\n\nGrid held his breath. Aimed. Released.\n\nThwip!\n\nThe arrow sang free. It traced a shallow arc and punched into the target with a satisfying thud. 6 points. He'd aimed for center, but it had drifted right.\n\n*Adjust.*\n\nGrid compensated left on the second shot. But he'd rushed. Failed to account for wind direction. The breeze shifted and the arrow dropped early. Another 6 points. His chance at a rare skill was slipping.\n\nThe old Grid would have cursed. Thrown something.\n\n*It's fine.*\n\nGrid remained calm. The reservist training matched participants by level. The fifty men here were all around level 20, same as him. Most of them would struggle to land all ten arrows.\n\n*The record is set by level 20 reservists from previous sessions. Still possible.*\n\nHe wouldn't quit. This time Grid pushed his concentration to maximum. Read the wind. Felt its touch on his cheek.\n\nThunk!\n\n10 points. Once he'd nailed the mechanics, the rest came easily.\n\nThunk! Thunk! Thunk!\n\nGrid captured the rhythm. Eight consecutive bullseyes.\n\n\"Grid scores 92 points!\"\n\n> [You have set a new record in Patrian's Reserve Forces Training Archery Test!]\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}