{
  "id": 368,
  "title": "Chapter 368",
  "content": "# Chapter 368\n\n\"G-Grid scored 92 points!?\"\n\nThe reservists' voices echoed across the training ground.\n\n> [You have set a new record in Patrian's Reserve Forces Archery Test!]\n> \n> [Your understanding of archery, the bow, and arrows exceeds your current ability.]\n> \n> [An ability correction will be applied to the hidden compensation.]\n> \n> [The normal skill **Bow Mastery** has been acquired.]\n\nGrid's eyes widened as he read the notification.\n\n> [**Bow Mastery**]\n> \n> Rating: Beginner Lv. 1\n> \n> You can handle all types of bows.\n> \n> When equipped with a bow, attack power and hit rate increase by 4%. Critical hit probability increases in proportion to Agility.\n> \n> Current Critical Hit Probability Increase: 0%\n\n*Bow Mastery!*\n\nEvery archer knew the truth. Physical damage dealers fell into two categories: those with weapon mastery and those without. **Bow Mastery** boasted the highest attack and accuracy bonuses of any weapon skill. It was the foundation of an archer's power.\n\n*I never thought I'd actually get this.*\n\nGrid had range covered. Pagma's Swordsmanship gave him **Transcend** and **Transcended Link**. He had **Magic Missile** for emergencies. But those required mana. Cooldowns limited him.\n\n*A bow guarantees steady damage as long as I have arrows.*\n\nHe'd been following Piaro's example, pumping points into Agility whenever he could. **Bow Mastery** fit that build perfectly.\n\n*If I can stack this with Weapons Mastery...*\n\nThe thought made his fingers twitch. That combination would open up an entirely new dimension of combat.\n\n***\n\nThe level 23 version of Grid had garbage stats compared to his real body. But the other reservists? They averaged level 20. Grid dominated the rankings. In sparring matches, he crushed his opponents with mechanical precision.\n\n\"Top graduate: Grid!\"\n\nInstructor Kaesul's voice rang out across the courtyard. The assistants and reservists broke into applause. Over the past weeks, Grid had earned their respect through sheer competence.\n\n*Not as Pagma's Descendant.*\n\nThe recognition had come to 'Shin Youngwoo'. To the effort he'd poured into this simulated trial. Pride swelled in his chest as he walked toward the platform.\n\n> [You have taken first place in Patrian's Reserve Forces training!]\n> \n> [You have obtained the grand prize: **Senior Reserve Forces Citation**.]\n\n> [**Senior Reserve Forces Citation**]\n> \n> *You have become a role model for the Patrian reservists.*\n> \n> *I wish to thank you for your enthusiasm during training.*\n> \n> *—Earl Ashur*\n\n\"???\"\n\nGrid stared at the paper in his hands. His expression went flat.\n\n*That's it?*\n\nHe'd expected... more. Something substantial. Instructor Kaesul beamed at him.\n\n\"It's an honor to receive a citation from Earl Ashur, Lord of Patrian and one of the Ten Great Magicians. This is an heirloom you can pass down to your descendants.\"\n\n\"This is garbage. Where's the actual reward?\"\n\nThe words left Grid's mouth before he could stop them.\n\n> [Mission Success!]\n> \n> [You have cleared the 31st island.]\n> \n> [You have acquired 600 Challenger Points.]\n> \n> [Your level has returned to normal.]\n> \n> [The skills **Spear Shot**, **Continuous Stab**, and **Bow Mastery** have been acquired.]\n\n*Shaaaaah—*\n\nThe fortified city dissolved. Instructor Kaesul, the assistants, the reservists. The entire 31st island scattered like smoke in wind. Grid stood alone in empty space, still holding the citation.\n\nHe'd been about to rip it up.\n\n\"...It's not bad as a memento, I guess.\"\n\nThe first award he'd ever received in his life. His grudge against Earl Ashur had cooled over time. Grid slipped the paper into his inventory with surprising care.\n\n***\n\nReidan had transformed during Grid's absence.\n\nThe yellow mithril mine was operational. Grid's knights had returned from Winston, their levels surging from constant combat. They'd exterminated the monsters plaguing the area. Yellow mithril now flowed into Reidan's forges.\n\nThe fairy dust created from it revolutionized the city's alchemy. Reidan's alchemists had finally reached a level where they could integrate their craft with blacksmithing.\n\nThe Ul Clan's magical education bore fruit. Reidan now boasted 930 magicians. Princess Hwarin led them. Her unique passive skill increased party magic power by 30%. The magicians treated her like a living treasure.\n\nThe farming districts had expanded into the Altes Mountains. Food production would triple once the first harvest came in.\n\nLauel stared at the reports with bloodshot eyes.\n\n*We have a limited number of farmers. How did Piaro expand agriculture this far? He couldn't have done all that work alone.*\n\nLauel remained blissfully unaware that Aura Master Hurent and Pet Master Nyangmong were currently enslaved in Piaro's fields.\n\nConstruction had begun on a Rebecca Temple under Pope Damian's authority. The temple would provide city-wide blessings and train healers. Reidan's population growth would accelerate dramatically.\n\nThe Rebecca's Daughters candidates Damian brought were being \"integrated\" into Reidan. Piaro was training them. Not as paladins.\n\nAs farmers.\n\nLauel's eye twitched.\n\n\"This is excessive.\"\n\nDamian looked up from his paperwork.\n\n\"What is?\"\n\n\"Rebecca's Daughters are the absolute force of the Church.\" Lauel pinched the bridge of his nose. \"Without them, the Rebecca Church loses half its military power. The Elders Assembly won't accept you giving candidates to Grid. You'll get kicked out before your first term ends.\"\n\nThe Pope's authority was immense. If Damian could hold the position for life, Grid would have an unshakable pillar of support. Throwing that away for a few girls seemed idiotic.\n\nDamian's jaw set.\n\n\"I became Pope to prevent more Isabels. More Rins and Lunas.\" His voice dropped. \"You can't imagine the pain. Young girls locked in facilities, subjected to constant brainwashing, brutal training. Used as weapons their entire lives. I won't allow it to continue.\"\n\n\"Hrmm.\"\n\nLauel was a man who would use and slaughter players to achieve his goals. He couldn't understand Damian's empathy for NPCs. But he tried.\n\nGrid cared about NPCs like Irene. He had a child named Lord. As Grid's right hand, Lauel had a duty to accommodate this worldview.\n\n\"...I still don't understand you or Grid.\" Lauel sighed. \"But I respect it. I'll find a way to stabilize your position after this incident.\"\n\nRelief washed over Damian's face.\n\n\"Thank you!\"\n\n*Contact with the vampire cities is severed, and now this.* Lauel's dark circles deepened. *My workload keeps growing.*\n\n***\n\nThe islands in the 30s reproduced a challenger's worst failures. Past deaths. Failed quests. Traumatic defeats played out in perfect detail. For most rankers, who'd clawed their way to the top through skill and talent, the 30s were a nightmare gauntlet.\n\nGrid sailed through them.\n\nThe trials that once broke him? He crushed them with contemptuous ease.\n\n> [You have entered the 40th island.]\n> \n> [This is a save point. Do you wish to save your position?]\n> \n> [Position registered. When you next enter the Behen Archipelago, you will start from the 40th island.]\n\n\"Amazing. Truly wonderful.\"\n\nSticks kept praising him. The hidden sage had watched Grid fail to overcome his own past trials. Seeing Grid grow in real time impressed him deeply.\n\n\"What's the big deal about killing orcs and goblins?\"\n\nGrid smiled and checked the time.\n\n*I should rest.*\n\nOne month had passed since entering the Behen Archipelago. Longer than expected. Grid needed to manage his stamina carefully. After six hours of connection time, he'd log out to eat, exercise, and recover.\n\n***\n\n*The harvest from the 30s is substantial.*\n\nBeyond **Spear Shot**, **Continuous Stab**, and **Bow Mastery**, Grid had gained 7 points to Strength and Stamina, 5 to Agility and Intelligence.\n\nThe cumulative quest rewards equaled roughly two elixirs. What rewards awaited him on the remaining islands?\n\n*The Behen Archipelago is perfect for growth.*\n\nHe made a mental note.\n\n*I should use this as a training ground for guild members before it's cleansed.*\n\nThe Tzedakah Guild, Yura, Peak Sword. They all had the skill to reach the 20th island. If they could farm Challenger Points for elixirs, Overgeared would become exponentially stronger.\n\n*Ttiring~*\n\nA message notification lit up Shin Youngwoo's phone. He was jogging through the park near his apartment.\n\n**New Email Received**\n\n*Lauel's periodic report?*\n\nYoungwoo stopped mid-stride and opened the message.\n\n**Third Week of September**\n\n**Alchemy facility successfully synthesized fairy dust from yellow mithril.**\n\n* Prepare for alchemy-blacksmithing fusion upon Grid's return.\n\n**Magic unit established around Princess Hwarin of the Ul Clan. Piaro has expanded farming area to Altes Mountains...**\n\n**It is now Day 24 since the vampire expedition entered the 9th city. We have lost contact.**\n\n\"...!\"\n\nYoungwoo's expression hardened. A single name pierced his mind like a spike of ice.\n\nMarie Rose.\n\n*It can't be.*\n\nHe spun on his heel and sprinted back along the jogging course. His breathing turned ragged. Sweat poured down his face. But he didn't collapse.\n\n***\n\n**Glossary of Common Korean Terms:** [Link]\n\n**OG:** [Glossary Link]\n\n**Current schedule:** 20 chapters per week.\n\nCheck out my Patreon for early access to unedited chapters and support goals for bonus releases. Early access chapters update after the day's regular release schedule."
}