{
  "id": 369,
  "title": "Chapter 369",
  "content": "# Chapter 369\n\nMost gamers dreamed. Then reality broke them. Talent fell short. Money ran out. The dream died.\n\nGrid had been no different. But somewhere between the debt collectors and the capsule's humming darkness, he'd found something. **Pagma's Descendant**. A chance.\n\nAt first, he'd wanted to survive. Pay off the loans. Then he'd wanted respect. Recognition. Something to fill the hole where his self-worth should have been.\n\nNow?\n\nGrid stared at the party interface. Health bars flickering red. Distance readings spiking as his guild scattered across some godforsaken vampire castle.\n\n*I can't lose them.*\n\nThe thought tasted like iron.\n\n\"Login.\"\n\n***\n\n**Behen Archipelago, 40th Island**\n\nSticks set down his coconut. The blue liquid sloshed against carved wood as he studied Grid's face.\n\n\"You returned quickly this time.\"\n\nGrid cut through the pleasantries. \"Can you force entry into an instance dungeon?\"\n\nThe sage's eyebrow rose. \"The Behen Archipelago counts as one.\"\n\n\"I know.\" Grid's jaw worked. \"Can it be done?\"\n\n*No. That's what anyone would say.* But Grid had learned that 'impossible' in Satisfy often meant 'expensive' or 'hidden.' Sticks had solved problems before. The contaminated world tree. The entrance to hell itself.\n\nSticks was silent for three breaths. Then he nodded, slow and deliberate.\n\n\"One method exists.\" He held up two fingers. \"Twice per year. The success rate is poor.\"\n\n\"Try it.\"\n\n\"May I ask why?\"\n\nThe sage's eyes were calm. Clinical. Grid had saved him once. That bought goodwill, not blind loyalty.\n\nGrid met his gaze. \"There are people I need to protect.\"\n\nSomething in his expression must have convinced the sage. Sticks rose from his seat, dusting sand from his robes.\n\n\"Then we leave. Now.\"\n\nHe gestured toward the portal stone. \"Your problem takes priority. The archipelago's purification can wait.\"\n\nGrid was already moving.\n\n***\n\n**Vampire City (9th) - Main Castle**\n\nThe Overgeared expedition had been confident. Twelve elites. Pon, Regas, Faker, Jishuka, Yura, Huroi, Peak Sword, Vantner, Toban, Zednos, Ibellin, and Toon. They'd cleared the 10th city. Killed Elfin Stone. Grown strong on vampire blood and legendary drops.\n\nConfidence was a currency. The 9th city had bankrupted them.\n\n\"Lost at my age,\" Vantner muttered. His voice echoed down stone corridors that twisted like intestines. \"Fucking lost.\"\n\nThe castle sprawled. Larger than Reidan. Larger than sanity. Traps lined every hall. The labyrinth split the party like a butcher's cleaver, scattering them into the dark.\n\nPon and Vantner moved between pillars. Forest-thick. The stone was old, older than the kingdom, carved with faces that might have been screaming.\n\nThen, behind them, a woman laughed.\n\nBoth men whirled. Pon's spear blurred. Vantner's axes sang. They struck stone. The impact jarred up their wrists, bones grinding against sudden resistance.\n\n\"Damn it!\" Vantner's scalp flushed crimson. The color spread down his neck like spilled wine.\n\nPon snorted. \"You look like a boiled octopus.\"\n\n\"This isn't funny!\"\n\n\"Look in a mirror.\"\n\n\"You bastard—\"\n\nVantner lunged. His hand shot toward Pon's collar.\n\nAbove them, the ceiling whispered. \"Bored boys. Play with me.\"\n\nPon reacted on instinct. Still caught in Vantner's grip, he drove his spear upward. Vantner released him, axes already moving in a rising arc.\n\nThey both leapt.\n\nThe vampire baron, Ran, descended with gravity's blessing. Her nails caught torchlight as they raked across both men's chests. The **Rare** rated armor parted like silk.\n\n*Slash.*\n\nBlood welled. Hot. Immediate.\n\n\"Gah!\" Pon hit the ground rolling.\n\n\"Shit!\" Vantner stumbled back, one hand pressed to his sternum.\n\nRan's form dissolved into shadow. Only her voice remained, dripping honey and mockery. \"Silly brothers.\"\n\nVantner spat blood. \"We need Faker.\"\n\n\"Agreed.\" Pon wiped his spear clean on his leg. \"He could match her speed.\"\n\n\"That's what I said!\"\n\nBut Faker was elsewhere. Their strikes found empty air. Their health bars bled downward, one cut at a time. In the darkness, Ran's laughter was a living thing.\n\n***\n\n**First Floor - Grand Hall**\n\nThe vampire baron Mountain lived up to his name. Three meters of muscle wrapped in plate armor. His weapon, a slab of sharpened metal too large to be called a sword, rested against one pauldron.\n\nFaker circled him. Daggers drawn. His throwing knives lay scattered across the floor, each one bent or shattered against that impenetrable defense.\n\n*Impressive.*\n\nThe word tasted bitter. Faker's expression remained neutral, but inside, rare tension coiled. The gaps in Mountain's armor were too small. Too well-protected. The vampire didn't need to move fast. He just needed to be inevitable.\n\nMountain smiled. Slow. Patient. \"Did you think that toothpick would hurt me?\"\n\n***\n\n**Northern Corridor - First Floor**\n\n\"Worst possible situation.\" Jishuka nocked another arrow. Her fingers were steady. Her voice wasn't.\n\nThe corridor stretched north. Long. Straight. No cover. Vampire soldiers poured from both directions, boots hammering stone in synchronized rhythm.\n\nZednos stood at her back, staff glowing. \"We cannot let them close the distance.\"\n\n\"I know.\"\n\nArcher and mage. Glass cannons. In open ground, they could devastate armies. In a corridor with enemies at both ends? They were meat.\n\nJishuka's bowstring sang. Three arrows, perfectly spaced, punched through vampiric skulls. Behind her, Zednos's frost magic created a temporary wall. Ice crystals refracted torchlight into prismatic death.\n\nBut the vampires kept coming.\n\n\"Damn humans!\" The lead vampire's eyes burned crimson. He vaulted the ice wall. Two more followed.\n\nZednos cursed under his breath. \"Average level is 280. Twenty levels higher than the 10th city.\"\n\nJishuka's next arrow took the lead vampire in the throat. He stumbled. Didn't fall. The distance narrowed.\n\n\"Yeah.\" Her voice was flat. \"I noticed.\"\n\n***\n\n**Second Floor - Southern Wing**\n\nRegas checked the party interface again. Still nothing. The others were either dead or out of range.\n\n*Probably just out of range.*\n\nProbably.\n\n\"Everyone alright?\" Huroi's voice was too loud. Compensating.\n\nRegas, Huroi, Peak Sword, Toban, Ibellin, and Toon had been at the front. Pushing toward the second floor. Overconfident. Then they'd stepped on the wrong tile and the world had *lurched*. Teleportation trap.\n\nNow they were here. The others were... somewhere.\n\n\"Can't see their status.\" Ibellin's face was pale. \"No health bars. No location markers.\"\n\n\"They're in danger.\" Toban's grip tightened on his hammer.\n\nHuroi rounded on Regas. \"I told you to let Faker scout ahead! Why did you charge in?\"\n\nRegas's jaw clenched. \"I was motivated. I'm sorry.\"\n\nPeak Sword stepped between them. His voice cut through the rising argument like a blade. \"Blame later. First floor. Now.\"\n\nThe others fell silent. Peak Sword had led the Silver Knights Guild for years. When he dropped the friendly act, people listened.\n\nThey headed for the stairs.\n\nThree vampire barons blocked the way.\n\nPeak Sword's hand moved to his sword. The blade whispered free of its sheath. \"This place is something else.\"\n\nIn the 10th city, vampire barons had been rare. Mid-bosses. Here, they were common trash.\n\n\"**Draw Sword, Annihilate.**\"\n\nThe technique released a crescent of compressed air. It carved a line through stone and flesh alike.\n\nThe battle began.\n\n***\n\n**Ninth Floor - Western Tower**\n\nYura knelt. Blood dripped from her split lip, hitting marble with soft percussion. Her rifle lay three meters away, barrel bent at an angle that made it useless.\n\nShe was Level 247. Seven months to reach what took normal players two years. A **Legendary** class. Exclusive hunting grounds. Perfect conditions.\n\nStill not enough.\n\n\"Is this your limit?\"\n\nVampire Viscount Tiramet loomed over her. His shadow swallowed the torchlight. Magic power rolled off him in waves, thick enough to taste. Metallic. Ancient.\n\n\"I expected more.\" His voice carried genuine disappointment. \"Those dirty bullets made me nervous. But a **Demon Slayer** is only this much?\"\n\nYura looked up. Blood painted half her face crimson. \"You know about Demon Slayers?\"\n\n\"Impossible not to.\"\n\nTiramet swept his silver hair back. The motion revealed a scar across his forehead. Deep. Old. The flesh had healed wrong, leaving a canyon of tissue.\n\n\"That man gave me this.\"\n\nThe temperature dropped. Tiramet's killing intent crystallized in the air between them, visible as frost forming on Yura's eyelashes.\n\n\"Woman who inherited his power.\" The viscount smiled. His fangs were very white. \"Today, I will thoroughly break you.\"\n\nHe moved.\n\nYura rolled. The kick that would have caved in her skull struck marble instead. The floor cratered. Chips of stone peppered her back as she came up firing.\n\n*Crack!*\n\nPurification bullet. It caught Tiramet's spell mid-formation, the dark magic detonating prematurely.\n\nYura gained distance. Five meters. Ten. Her magic gun shifted to rifle mode, the barrel extending with mechanical precision.\n\n*Bang!*\n\nHeadshot. Perfect marksmanship. The bullet drilled through Tiramet's forehead, right above the old scar.\n\nBut Level 247 couldn't bridge the gap to a named Level 360 boss. The wound was shallow. Painful, but shallow.\n\n\"Gah! Girl!\"\n\nThe **Demon Slayer's** purification burned worse than the impact. Divine fire in a wound that couldn't heal properly. Tiramet's composure shattered.\n\n*Boom! Boom!*\n\nHe swung his hands like clubs. Black magic erupted from his palms, each blast forcing Yura back. The walls cracked. The floor buckled.\n\n\"I'll break you!\"\n\nHis kick came faster than thought. Aimed at her face. At her skull. At everything soft and breakable behind the bone.\n\nThe impact rang like a bell.\n\nTiramet stopped laughing. Confusion replaced certainty.\n\nA golden shield hovered in front of Yura's face. Seven interlocking discs of metal, impossibly bright in the dim tower.\n\n*What is this damn girl—?*\n\nThe thought died.\n\nA storm arrived. Blue-black energy blades, dozens of them, filled the air like angry hornets. They struck Tiramet from every angle. His defensive spell, hastily raised, cracked under the assault.\n\n> **[Critical Hit!]**\n> **[Bleeding Applied!]**\n> **[Defense Reduced by 30%!]**\n\nTiramet staggered backward. His chest was a ruin of cuts. Blood, true blood, not the decorative kind, ran down his torso.\n\n\"What bastard—\"\n\nFour golden hands shot from the darkness. They clamped onto his wrists and ankles with mechanical precision. Tiramet thrashed. His strength was superior, but the hands' dexterity made them impossible to dislodge. Fingers found pressure points. Joints. Weak spots in his defense.\n\nA gap opened. Three seconds. Maybe four.\n\nAbove Tiramet's head, a figure descended. Black hair. Red eyes. Armor that seemed to drink the light.\n\nGrid.\n\n\"**Pagma's Swordsmanship.**\"\n\nThe greatsword in his hands hummed. Not with sound. With promise.\n\n\"**Linked Kill.**\"\n\n***\n\n**Glossary of Common Korean Terms**  \n**OG:** [Glossary Link]\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}