{
  "id": 37,
  "title": "Chapter 37",
  "content": "Chapter 37\n\n> **[Traitor of the Red Knights]**\n> \n> **Difficulty: S**\n> \n> Piaro, a former colleague of Asmophel, has committed a terrible betrayal. Asmophel was wounded and vowed to take revenge on Piaro.\n> \n> However, Asmophel has become seriously ill afterward.\n> \n> In the end, Asmophel was forced to give up on his own revenge and asked you to get revenge for him.\n> \n> **Quest Clear Conditions:** Defeat Piaro who is hiding in Kesan Canyon.\n> \n> **Quest Clear Reward:** Title 'Agent of Revenge'\n> \n> * Agent of Revenge: The 'Cruelty' stat will be opened. Attack Power +100. Skill 'Murderous Impulse' will be generated.\n> \n> **Quest Failure:** Level -2. Asmophel's confidence will decline.\n\nEuphemina was currently level 190. She'd cleared one S-grade quest in the past, which meant she knew the terrible difficulty better than anyone.\n\n*Piaro. The strongest knight of the Saharan Empire.*\n\nAsmophel had explained Piaro's power in detail. His swordsmanship had reached the peak, and when he used his ultimate technique 'Fated to Perish', death was inevitable. Euphemina's throat tightened. She'd spent 63 days preparing for this quest, but fear still gnawed at her.\n\nShe exhaled slowly. \"I believe it. I can do it.\"\n\nHer fingers twitched. \"Skill window.\"\n\nEuphemina normally possessed only nine skills. For a level 190 user, it was an unbelievably poor skill tree. But her skill window now displayed a total of 50 skills, all of them top-class.\n\nThese were the skills Euphemina had prepared to clear the quest. She'd traveled across the continent for the past 62 days, hunting down top-ranked players and duplicating their abilities.\n\nOnly for today.\n\nShe cleared her mind and stepped into the cave. She was going to face Piaro alone, an enemy more powerful than any boss monster. Was it pride? No. It was proper confidence.\n\nShe was the first epic class in Satisfy. A fraudulent class that could duplicate other people's skills. The Duplicator. This was the identity of the first epic class that had appeared in the game.\n\n\"Someone sent by Asmophel?\"\n\nA voice echoed from the darkness deep in the cave. A notification window materialized.\n\n> [The eternal hermit Piaro has appeared.]\n> \n> [You are overwhelmed by Piaro's killing intent and the fear effect has been applied.]\n> \n> [The trap that Piaro installed is activated.]\n\n*Syu syu syu syu syuk!*\n\n*Chachachachang!*\n\nSharp spikes erupted from the ground beneath Euphemina's feet, teeth of stone rising like a shark's maw. Arrows whistled from the walls on both sides. Piaro materialized in front of her. Euphemina's hand shot up.\n\n\"Tartan!\"\n\nIt was the strongest defensive skill available, known only to Bump, the first-ranked guardian knight.\n\n*Kuooooh!*\n\nA massive steel giant appeared from nothing and wrapped around Euphemina's small frame. The arrows and spears clattered harmlessly against the construct. But Piaro's strike was different. His blade pierced through the giant's defense, the tip driving toward Euphemina's heart.\n\n\"Counter Barrier!\"\n\nShe reproduced the skill of Miared, the strongest assault knight.\n\n*Puok!*\n\nPiaro coughed blood. His body hurtled backward through the air. The damage Euphemina should have received reflected back onto him through Counter Barrier.\n\nPiaro twisted mid-flight, ignoring his wound. \"How dare you!\"\n\nEuphemina didn't hesitate.\n\n\"Swirling Frenzy!\"\n\n*Kwa kwa kwa kwang!*\n\nBefore Piaro could reach the ground, a violent storm engulfed him. With nothing to brace against, his body tumbled through the vortex. Euphemina knew he wouldn't die from this. She pressed her advantage.\n\n\"Scorching Heat Wave! Tyrant's Majesty! Mace of Light! Spear of Darkness! Prelude to Destruction!\"\n\nThe skills she'd gathered over 63 days unleashed in rapid succession. Attacks of different properties tore through the cave, collapsing the ceiling and burying Piaro under tons of debris.\n\n*Have I succeeded?*\n\nNo. There would be a quest clear notification.\n\nEuphemina's intelligence stat was very high, and she'd prepared advanced mana potions. But the barrage of top-level skills had drained her reserves.\n\n*I have to wait for the potion cooldown.*\n\nPiaro was still alive. She didn't know when a counterattack would erupt from beneath the rubble. Until then, she needed to recover her mana. Euphemina activated her flying magic to maintain distance.\n\nAs she rose into the sky, Piaro emerged from the wreckage. He was relatively unscathed despite a bombardment that would have annihilated an army of hundreds.\n\nPiaro's eyes locked onto her. \"Female. I recognize your strength and will do my best.\"\n\n*Taack!*\n\nHe jumped.\n\n*Peeng! Peeng!*\n\nPiaro bounded through the air in bursts, as if stepping on an invisible staircase. The distance between them vanished.\n\nA red light blazed from Piaro's sword. \"I'll give you an inevitable death!\"\n\nIt was the skill Asmophel had warned her about. Fated to Perish. Once activated, Euphemina wouldn't be able to avoid death. Her 63 days of preparation would be for nothing.\n\n*Pahat!*\n\nThe distance closed until they could hear each other's breathing. The potion cooldown was almost finished. Euphemina drank a mana potion and activated the spell she'd prepared to counter Fated to Perish.\n\n\"Nightmare Projection!\"\n\nThe sword rushing toward her stopped.\n\nEuphemina stared at Piaro and swallowed.\n\n*Kwarurung!*\n\nThe red blade that should have sliced through Euphemina carved the empty air dozens of times instead. He'd fallen completely into the hallucination. Piaro was now fighting against the most fearful nightmare in his world.\n\nHis voice rang out. \"You have come to me. Asmophellllll!\"\n\nThe flaming sword swung without stopping. The sky turned red as sunset. Euphemina prepared to launch another bombardment while Piaro was trapped.\n\nBut a variable appeared.\n\n> [You have reached your physical and mental limits after using an excessive amount of force during a short period of time.]\n> \n> [Your skills can't be used for a while.]\n> \n> [All stats have fallen by 50%.]\n\nEuphemina's eyes widened. \"What?! No way! My quest success was in sight!\"\n\nShe'd used too many top-level skills in too short a time, causing physical and mental stress. It was her first experience with this limitation, and she'd never anticipated it could happen.\n\nWhile she reeled, Piaro began escaping from his hallucinatory state.\n\n*This can't continue!*\n\nThe physical abilities of a Duplicator were minimal. With her skills blocked, she had no way to fight Piaro. Only one choice remained. Give up the quest.\n\nHer jaw clenched. \"Ugh!\"\n\nSixty-three days of effort, wasted. The quest had already failed, and dying here would only make things worse. Euphemina swallowed her tears and fled.\n\nShortly after, Piaro woke from his hallucination and realized Euphemina was gone.\n\nHe stared at the empty sky. \"Wicked female. I will surely repay today's disgrace.\"\n\n> [Quest failed!]\n> \n> [Your level has dropped by 2.]\n> \n> [You are now level 188.]\n> \n> [Asmophel's confidence in you has fallen.]\n\nEuphemina stared at the notification windows. She'd barely escaped from Piaro, and this was her reward. She'd tried her best for more than two months, and all her efforts had returned such a horrible outcome. The disappointment crushed her.\n\nShe slumped against a tree. \"It was a chance to get a new title after a long time.\"\n\nThe more titles, the better, because the effects overlapped. But gaining titles wasn't easy. Most came through quests, and quests which gave titles were rare. Despite being a top ranker, Euphemina only had two titles.\n\nHer fist hit the ground. \"Damn it.\"\n\nEuphemina couldn't suppress her disappointment. While anger still burned through her, a messenger from the Mero Company approached.\n\nThe messenger bowed slightly. \"Will you take a job, Miss Erina?\"\n\nDue to the nature of her class, Euphemina maintained multiple identities. Erina was the name she used when she copied an advanced NPC blacksmith and crafted an <span class=\"rarity-epic\">Epic</span> rated item.\n\n*Since they came with this name, is it a blacksmith-related quest?*\n\nHer guess was correct.\n\n> [The quest 'Item Production Game with the Mero Company!' has been created.]\n\n> **[Item Production Game!]**\n> \n> **Difficulty:** Unknown\n> \n> The world doesn't know your true identity.\n> \n> The Mero Company has approached you after hearing about your good blacksmith skills.\n> \n> They want you to participate in an item-making game held in Winston.\n> \n> The opponent is the successor of the reputable blacksmith, Khan, who was once famous in the north. The successor is a variable who can't be measured.\n> \n> **Quest Clear Conditions:** Win the item production game.\n> \n> **Quest Clear Reward:** 1,500 gold. Title 'Competitor.'\n> \n> * Competitor: Fighting spirit stat will be opened. Good luck stat will be opened. Skill 'Rolling Dice' will be generated.\n> \n> **Quest Failure:** Your relationship with the Mero Company will become the worst.\n> \n> [Would you like to accept the quest?]\n\nEuphemina's breath caught. *A title-giving quest!*\n\nShe'd just missed the chance to get a new title, only to receive a quest with a title reward immediately after. And it was a title that opened the good luck stat.\n\n*The good luck stat. I want it.*\n\nThe good luck stat was famous. The higher the good luck, the higher the probability of receiving beneficial effects in Satisfy. It ranged from finding money on the road to discovering hidden quests and treasures.\n\nAs the name suggested, it gave good luck to the user, so many people desperately wanted it. Euphemina was no exception.\n\n*I also wonder what the Rolling Dice skill is. Doesn't it sound interesting?*\n\nThe biggest disadvantage of being a Duplicator was the limited variety of skills available. Euphemina had a hunger for new abilities.\n\n*The reward is also 1,500 gold. Should I accept?*\n\nThe rewards were excellent. For Euphemina, this quest was an inevitable temptation. She'd just failed a quest, so she felt like recovering her losses. But she shouldn't rush.\n\n*The difficulty is unknown.*\n\nShe formed a hypothesis.\n\n*Khan's successor must be a blacksmith character whose level isn't public. Is that why the difficulty isn't determined?*\n\nThe theory seemed plausible.\n\n*Well, I don't have to worry too much. Does the difficulty of a production game matter in the first place?*\n\nNo blacksmith skills existed that Euphemina couldn't duplicate. If she participated in the production game, she could copy her opponent's blacksmith skill and compete at the same level. In other words, it was a game decided by luck.\n\nWhen competing with the same skill level, the luckier person would create a higher-rated item, and victory would follow.\n\n*If I'm lucky, I can easily clear the quest. On the other hand, I might fail if I'm unlucky.*\n\nIt was a quest where she couldn't guarantee success. The risk was real. But she coveted the rewards. Euphemina made her decision.\n\nShe met the messenger's eyes. \"The game. Leave it to me.\"\n\nThe game was established between Grid and Euphemina. If the world knew their identities, the competition would have been the hottest issue worldwide. A confrontation between an epic class and a legendary class. The attention would have been enormous.\n\nUnfortunately, the world still didn't know the identities of the two people. A significant battle was about to unfold in secret."
}