{
  "id": 370,
  "title": "Chapter 370",
  "content": "# Chapter 370\n\nElfin Stone ruled the 13th city as an earl. The masters of the tens? Viscounts. Yura knew what a viscount could do. She'd fought them before.\n\n*Five Overgeared elites. Minimum. That's what it takes to kill one.*\n\nMaybe if she finished all her class quests and pushed past level 300, she could solo them. Maybe. Not now. Yura shifted to pure defense, buying time. The others were scattered through the city, but they'd regroup. They always did.\n\nTiramet was different, though. Stronger than the other viscounts.\n\n*He fought a former Demon Slayer and survived.*\n\nThat meant something. A unique event. A named boss.\n\nThe blood magic hissed through the air.\n\n*Pepeng!*\n\n*Pepepepeng!*\n\nYura twisted, evading the first volley. But her options were shrinking. The kick came fast.\n\n*Can't dodge this.*\n\nShe'd lose a third of her health, maybe more. The trick was stopping the follow-up. Yura angled her body deliberately. If the kick landed, she'd fly back into the pillar. Use the impact to reset. Regain her stance.\n\nThen everything changed.\n\n*Syuk~*\n\n*Chaaeng!*\n\nA golden shield materialized between her and Tiramet's foot. Yura's eyes widened. She never looked surprised. Not anymore. But now?\n\n*Grid.*\n\nQuestions piled up in her mind. He was supposed to be in the Behen Archipelago. How did he get here? How did he enter the city? And why did he only appear when she needed him most?\n\n*I'm going to start depending on you if you keep this up.*\n\nEven her frustration looked beautiful.\n\n***\n\nTrue Blood vampires came in two varieties.\n\nNine children born directly from Shizo Beriache. And everyone else, made from their blood. Viscount Tiramet belonged to the first category. A direct descendant. At least three times stronger than the manufactured viscounts. Calling him a quasi-earl wasn't wrong.\n\nA human was threatening him?\n\nImpossible. Unless that human carried a legend's title.\n\nGrid's voice cut through the air. \"Pagma's Swordsmanship. Linked Kill.\"\n\n*Puk.*\n\n*Puk puk puk!*\n\nBlue-black energy blades punched through Tiramet's torso five times in rapid succession. The vampire screamed.\n\n\"Kuaaaaak!\"\n\nThe black-haired human who'd appeared from nowhere hit like a siege weapon.\n\nTiramet snarled. \"You!\"\n\nMagic power coiled around his hand. Transfusion magic lashed out, a non-targeted skill designed to drain health from everything in range.\n\n*Non-targeted skill.*\n\nGrid's eyes tracked the blood magic's trajectory. He yanked the greatsword free from Tiramet's chest, already moving. **Link's** footwork carried him clear of the magic. The timing was perfect. The <span class=\"rarity-unique\">Slaughterer's Eye Patch</span> fed him the information he needed.\n\n\"You rat bastard!\" Tiramet's fist blurred forward.\n\nBut Grid was faster. **Link's** steps were already complete.\n\n\"Link.\"\n\nA moment ago, Grid had targeted the chest instead of the head. Headshots dealt more damage. But he couldn't guarantee a hit on Tiramet's skull with his current skill. Not at 100% accuracy.\n\n**Link** was different. Wider range. Slashing instead of stabbing.\n\nGrid's blade carved through the space where Tiramet's face had been. \"This will hurt.\"\n\n*Pit!*\n\n*Pipipipipit!*\n\n\"Kuaaaaak!\"\n\nTiramet's face opened up in five places at once. The pain staggered him. He pulled out a trump card.\n\n\"Blood Tornado!\"\n\n*Kwa kwa kwa kwang!*\n\nMagic power spiraled around Tiramet like a living storm. Grid's feet left the ground.\n\n\"I'll kill you!\"\n\n*Kwa kwang!*\n\n*Kwa kwa kwa kwang!*\n\nFive blood missiles screamed toward Grid's airborne form.\n\n\"God Hands!\"\n\n*Syuok! Syuok!*\n\nTwo golden hands answered the call. They spread their palms wide, intercepting the missiles. Two exploded against them. The God Hands locked up, stiff. The remaining three missiles hammered into Grid's head and chest.\n\n*Pepepepeng!*\n\nGrid coughed blood. \"Cough!\"\n\nTiramet saw it and laughed. \"Kuhahat! You're strong for a human, I'll give you that! But there's a gap between us you can't cross! Your body is dry leaves! Mine is steel!\"\n\nTrue enough. But Tiramet was bleeding too. Half his health, gone. The human's damage output defied common sense.\n\n*But.*\n\nHe had vampire magic. Tiramet grinned, targeting both Grid and Yura with his next spell.\n\nGrid spoke first. \"My body is a stone.\"\n\nTiramet's grin died. The human had taken three Blood Missiles to the face and was still standing. Still fighting.\n\n\"Why is a human so durable...?\"\n\nGrid raised one hand. \"Magic Missile.\"\n\n*Jiing.*\n\n*Peeng!*\n\nThe spell punched through Tiramet's heart. **Magic Missile (Enhanced) Lv. 2.** The legendary variant Grid had mastered in the Behen Archipelago hit like a ballista bolt.\n\n*I was hit by a Magic Missile?*\n\nTiramet's mind reeled. Why was a magician this durable? Why was he so good with a sword? Before he could process it, Grid appeared above him, draining a health potion mid-flight.\n\n*Chaaeng!*\n\nThe blue-black greatsword fell like lightning. Momentum and mass behind the strike. Tiramet caught it with his left hand.\n\n\"This body won't fall for the same pattern twice!\"\n\nHis right hand shot out, clamping around Grid's throat. He drove Grid backward into a pillar.\n\n\"Blood Burn!\"\n\n*Peeng!*\n\nThe explosion engulfed Grid's body, slamming him into the stone.\n\nYura's face went pale. \"Grid!\"\n\nNo matter how good his items, his stats, his class... she'd forgotten for a second. Grid had fought Kraugel. He didn't go down that easily.\n\nGrid pushed himself upright. \"Already making me use Doran's ring.\"\n\nHis appearance was relatively intact. His expression, though? Irritated.\n\n*Still have a long way to go.*\n\nKraugel wouldn't have been caught by the neck. Not after the first attack was blocked.\n\n*He would've landed the first Linked Kill on the head.*\n\nWas Grid frustrated? Bitter about the gap between him and the best? No. He was aiming for the top now. Same as Kraugel. Same as Yura. Frustration was just noise.\n\n\"Let's start properly.\"\n\nTiramet blinked. \"This guy keeps speaking nonsense... Hah?\"\n\nThe vampire moved. Fast. Two golden hands materialized in the air where he'd been standing. They carried weapons. They could fly. Attack and defend independently.\n\n*Artifacts that can be used for offense and defense, moving by themselves...! This is big!*\n\n*Chaaeng! Chaeng!*\n\nThe God Hands' **Sword Mastery** had grown from beginner to intermediate during Grid's time in the Behen Archipelago. Constant use. Constant refinement. They wielded the <span class=\"rarity-unique\">Ideal Dagger</span> and the <span class=\"rarity-legendary\">Doppelganger's Greatsword</span>, firing **Magic Missiles** to pin Tiramet down.\n\nBut it wasn't enough to push him into a corner.\n\n\"What can you do with such shameful artifacts?\"\n\n*Jjejeong! Jjejejeok!*\n\nTiramet tracked their trajectories. Dodged. Closed the distance to Grid.\n\n\"Die!\"\n\n*Peeng!*\n\n**Blood Fire** erupted. Fire damage scaled to his maximum health. Grid walked through the flames and revealed his real power.\n\n\"Blackening.\"\n\n> [Your black magic power has increased.]\n\n> [You don't have any black magic power. It will be replaced with demonic power.]\n\n> [While Blackening is activated, your species will change to half-demon.]\n\n> [As a half-demon, your maximum health is reduced by 50%. Your attack power, magic power, and agility will increase by 20% each.]\n\n> [All attacks will be converted to the black magic attribute.]\n\n\"Quick Movements.\"\n\n> [The skill attached to the <span class=\"rarity-unique\">Ideal Dagger</span> equipped to the God Hand has been activated.]\n\n> [Your evasion rate is increased by 30% and your agility is doubled for 1 minute.]\n\n\"Blacksmith's Rage.\"\n\n> [Attack power will increase by 25% and attack speed will increase by 40% for 35 seconds.]\n\nThen.\n\n> [The items have successfully combined!]\n\n> [The combination time of **Failure** and **Iyarugt** will last 2 minutes.]\n\nGrid had only used two God Hands during the opening phase. Not to mock Tiramet. He'd recognized the vampire's strength. Before entering the fight, he'd activated **Item Combination** with the other two hands.\n\n*Clink!*\n\nThe two God Hands flew to Grid, delivering a new weapon. His boosted **Agility** let him slip past the **Blood Fire**. He issued commands to each hand.\n\n\"Open. Magic Missile.\"\n\n*Syu syu syu syu syuk!*\n\n*Pepepepeng!*\n\nThe hands scattered across the chamber, firing **Magic Missiles** from multiple angles. Tiramet couldn't dodge them all.\n\n\"This technique... Heok?\"\n\nTiramet deployed **Blood Shields** to intercept the missiles. The black-haired man... was he even human anymore? He was closing in.\n\n\"Fling Blood!\"\n\n\"Continuous Stab!\"\n\n*Puok!*\n\n*Jjejeong! Puk!*\n\n*Chaaeng! Jjejeong!*\n\nTiramet wasn't weak. **Fling Blood** boosted his stats. He blocked three of Grid's five attacks. Grid assessed the situation instantly. Five combos weren't happening here. He switched to **Blood Cry**.\n\n*Kakiing.*\n\nTiramet's eyes went wide. \"Kuk... No, that's Elfin Stone's!\"\n\nGrid saw the opening. **Pagma's Swordsmanship, Pinnacle** carved into Tiramet's shoulder. Iyarugt's power kicked in.\n\n> [The 3rd combo has been achieved!]\n\n> [The damage done to the target will increase by 200% for 1 second.]\n\n\"Kill.\"\n\n> [Critical!]\n\n\"Urgh...\"\n\nTiramet's face twisted. But he fought back anyway. Proving his strength. He wasn't Elfin Stone level, but he far exceeded the weakened Hell Gao. Grid anticipated the counter.\n\n\"Revolve.\"\n\nThe counterattack came on cue. Grid's timing was perfect.\n\n> [The 5th combo has been achieved!]\n\n> [The target's sense of reason has collapsed for 0.3 seconds.]\n\n> [The skill 'Hell Sword' can be linked.]\n\n0.3 seconds. Grid had trained for this.\n\n\"Hell Sword.\""
}