{
  "id": 371,
  "title": "Chapter 371",
  "content": "# Chapter 371\n\nHell Sword.\n\nThe conditional skill attached to Iyarugt packed devastating power—comparable to Pagma's Swordsmanship itself. By Grid's calculations, it even eclipsed the damage output of Kill at Level 4.\n\n> **[Hell Sword]**\n> Inflicts 2,400% physical attack power to the target.\n> Every time the target is hit, an additional 100% damage will be dealt.\n> Mana Consumption: 1,000\n> Skill Cooldown Time: 15 minutes.\n\n*Chiiiiing!*\n\nIyarugt fused with Failure.\n\n*Pachik! Pachichik!*\n\nBlack sparks erupted around the merged blade. A crescent arc traced through the air—bisection.\n\n*Sakak—!*\n\nGrid's strike cleaved Tiramet from crown to crotch. Twenty-four black rays materialized around the vampire, converging before he could scream. Grid's fingers twitched, commanding them.\n\n*One.*\n\n*Peng!*\n\n*Two.*\n\n*Pepeng!*\n\n*Three.*\n\n*Peeng!*\n\nHe adjusted their trajectories with minute finger movements. Only three of the twenty-four rays found their mark. The remaining twenty-one dissipated as the one-second window expired.\n\n*Too hard. I can't keep up with the command inputs—it's too complicated, too fast.*\n\nGrid grimaced. *Should've spent more time at PC cafes when I was younger instead of studying at that damn desk.*\n\nNotification windows flooded his peripheral vision.\n\n> [Critical Hit!]\n> [You have dealt 1,229,112 damage to the target.]\n> [Health has been absorbed due to the option effect of Iyarugt's Ring.]\n> [You have dealt 17,071 damage to the target.]\n> [You have dealt 17,071 damage to the target.]\n> [Critical Hit!]\n> [You have dealt 51,213 damage to the target.]\n> [The duration of Blacksmith's Rage is over.]\n\nHell Sword led into a devastating chain—Transcended Link, Linked Kill, Link, Kill, Pinnacle, Revolve. Grid had even burned Item Combination and Blackening. Everything. His full arsenal.\n\n*He has to be dead.*\n\nGrid had committed to annihilating Tiramet from the opening exchange. His mana sat at a pathetic thirty-three points after that storm of legendary skills. If the vampire survived, Grid would be reduced to a punching bag until his potions kicked in and his cooldowns reset.\n\nBut that wouldn't happen.\n\n*Hell Gao with one fire stone couldn't survive this combo...*\n\nGrid's expression went rigid. \"What?\"\n\n*Why isn't there a death notification?*\n\nNo messages about Tiramet's demise. No experience gained. No items dropped. Grid's grip tightened on his weapon.\n\nTiramet's mouth opened. His health bar was completely empty. \"...Ahh, yes. This is why Elfin Stone suffered.\"\n\n*What?*\n\nThe vampire's shredded body—torn like wet cloth—pulsed with gathering magic power. \"It's because his body is weak, unlike mine.\"\n\n\"Among my siblings, I am weak in magic.\" Tiramet's voice was conversational, almost bored. \"Unlike my other siblings, I can't use magic effectively. But instead...\"\n\nGrid's eyes widened.\n\nThe black magic coalesced around Tiramet, knitting flesh and bone. Within seconds, his body had completely regenerated.\n\n\"I have the ability to focus my magic power on regeneration.\" Tiramet's grin revealed elongated fangs. \"Perfect immortality.\"\n\n*Cheok!*\n\nThe vampire dropped into a fighting stance—poised, controlled, reminiscent of a martial artist. Like Regas. His posture radiated the intent of someone who refused to be caught off-guard again.\n\n\"For reference,\" Tiramet added, \"I become stronger every time I half die and revive.\"\n\n*Peeeong!*\n\nOne foot pivoted. His fist arced through the air, detonating magic power and wind pressure simultaneously—a fusion of magical and physical devastation.\n\n*This is a viscount?*\n\nHis speed had increased dramatically. Grid summoned the **God Hands** and shifted into active defense. He just needed to stall until his mana potions processed and his cooldowns finished.\n\nBut Tiramet's stats had skyrocketed. Without any skills available, Grid struggled.\n\n*Jjejeong! Jjeejeeeong!*\n\nEach kick and punch compressed the intervals between the **God Hands**' stiffness. Grid watched the window shrink, calculating. *They'll be neutralized soon.*\n\n*Bad. This is bad.*\n\nElfin Stone had relied on Blood Field—crowd control and magic. His physical prowess hadn't been exceptional, making him manageable for Grid, who could neutralize CC and shrug off most spells. Tiramet was the inverse. A fighter who specialized in physical combat. The worst possible matchup.\n\n*And that revival ability is bullshit.*\n\nGrid had been foolish to blow his strongest combo for a quick kill. If he hadn't grown since his early days, he'd be panicking right now.\n\n*Pepeng! Pepepepeng!*\n\nAs Grid's situation deteriorated, Tiramet's momentum surged. The vampire's fists and feet blurred, accelerating. Grid tried to block, but there was nowhere to retreat.\n\n\"I'm not a viscount because I'm weaker than Elfin Stone.\" Tiramet's voice dripped with condescension. \"I just don't want to be annoyed by the responsibilities.\"\n\n*Taack!*\n\nGrid raised the **Divine Shield**.\n\nTiramet used the barrier as a springboard, spinning like a drill as he descended. Magic concentrated at his toes generated a tornado—the surrounding air howled from the intense pressure.\n\n*No good.*\n\nGrid tried to evade, but escaping Tiramet proved impossible. Quick Movements had expired.\n\n\"Hahahahat!\" Tiramet's laugh was manic. \"Yes, you humans are best suited to being on the ground!\"\n\nThe vampire's heel hammered down on Grid's shoulders.\n\n*Kwaaaaang!*\n\nGrid's scream tore through the air. \"Kuaaaaak!\"\n\nTiramet seized Grid's head, whispering with grim satisfaction. \"I will break you from now on.\"\n\n*Chaaeng!*\n\nThe vampire's knee crushed into Grid's face.\n\n*Jjang!*\n\nA second blow.\n\n*Jjejejeok!*\n\nThree strikes in rapid succession.\n\nBlood sprayed. Yura screamed. \"Grid!\"\n\n***\n\n> [Mana has been consumed to refine the 'Extinction Bullet'.]\n> [Your magic gun doesn't support rifle mode. There is a very high probability of a misfire.]\n> [The Extinction Bullet has failed to launch properly.]\n> [The durability of the Emilfa Magic Gun has fallen by 95. It might be destroyed.]\n\n> [Mana has been consumed to use the 'Vindictive Sword'.]\n> [Your magic gun doesn't support bayonet mode. There is a very high probability that Vindictive Sword won't manifest.]\n> [Vindictive Sword has failed to be activated.]\n> [The durability of the Emilfa Magic Sword has fallen to 0 and it has been destroyed!]\n> [Destroyed items cannot be recovered!]\n\nDemon Slayer Yura still couldn't access her full strength. Her incomplete class quest played a role. Her stats hadn't reached third awakening—another factor.\n\nBut the critical issue was her level 180 magic engineering gun.\n\nMagic guns produced at alchemy facilities were fundamentally flawed. Human alchemists had only grasped the approximate working principles—they didn't understand the exact structure. True magic guns supporting pistol mode, rifle mode, and bayonet mode could only be forged by dwarves.\n\nAnd Yura was barred from progressing her class quest. She couldn't enter Talima, the dwarf city.\n\n\"Grid...!\"\n\nThe only man who'd ever stirred her heart. Yura's chest constricted as she watched him get trampled. Helplessness clawed at her.\n\n*Why are you doing this for me?*\n\nWhy sacrifice himself? Guilt and gratitude warred inside her.\n\n*I have to save him somehow.*\n\nShe'd tried her strongest skills, only to destroy her weapon. Yura scrambled to equip her secondary weapon—the level 120 Rianfa Magic Gun—and charged Tiramet. Gratitude, guilt, and pride fused together, propelling her forward.\n\n\"You have forgotten your opponent...!\"\n\nYura leveled the muzzle at Tiramet, then froze.\n\nGrid's voice reached her. \"Relax. I'm okay.\"\n\n\"...Grid?\"\n\nHis voice was too steady for someone dying in Tiramet's grip. And it came from the wrong direction.\n\nTiramet jerked his head up. \"A fake?\"\n\nCorrect.\n\nThe Grid in Tiramet's grasp was Randy, not the original. The real Grid plummeted from above, falling like a guillotine. Randy's new skill—acquired after hitting level 200 in the Behen Archipelago—'Change position with the copied target' had executed perfectly.\n\n\"These people swapped...!\"\n\nGrid's blade descended. \"Kill!\"\n\n*Puok!*\n\nIyarugt's tip punched through Tiramet's skull. \"Kuaaaaak!\"\n\nThe vampire's scream was visceral, but Grid's victory was far from assured. His mana remained depleted. His cooldowns hadn't fully reset.\n\nAnd worse—\n\n*What if I dump everything and he still doesn't die?*\n\nThat would be game over. True defeat.\n\n*There's a possibility this boss is unkillable until certain conditions are met.*\n\nGrid glanced at Yura. \"Let's run away.\"\n\nYura's response was immediate. Relief at Grid's survival cleared her mind, sharpening her tactical thinking. She'd identified the path to victory.\n\n\"There is a wound where he was hit by a former Demon Slayer.\" Her eyes narrowed. \"Why didn't it heal despite his overwhelming regeneration?\"\n\nThe answer lay in her class.\n\n\"Maybe I'm the only one who can kill him.\"\n\nApplause echoed from beyond the combat zone. Sticks emerged from the shadows, grinning at Yura. \"Correct conclusion.\"\n\nYura blinked at the elf. \"You...?\"\n\nIt was her first encounter with an elf. Confusion flickered across her face before realization dawned. \"Grid, did you manage to come here with his help?\"\n\nGrid nodded, keeping one eye on Tiramet. \"That's right. The hidden sage, Sticks.\"\n\nSticks produced a small box and extended it to Yura. \"This is the gun that Alex used in his youth.\"\n\nAlex—a former Demon Slayer and Sticks' close friend.\n\nGrid, barely maintaining his composure, blurted out, \"You don't have any items that Pagma used in his youth?\"\n\nSticks' reply was matter-of-fact. \"No. I wasn't close to Pagma.\"\n\nGrid's expression soured. *Unfair.*\n\n***\n\nDamian had been staying in Reidan for a month.\n\nHe was having the time of his life—not from watching the temple construction, though that was pleasant enough.\n\nLord Steim. Playing with Grid's son was pure joy.\n\nDamian beamed at the infant. \"You already understand the principles to manifesting divine power. Lord isn't just a genius, but a super genius.\"\n\n\"Bubu!\" Lord nodded with exaggerated pride as a warm ray of light flickered from his fingertips.\n\nThe light was feeble, barely visible. But considering he'd only been training for a month, Lord truly was a genius. He absorbed every lesson. Damian felt a profound sense of fulfillment.\n\n\"You can use divine power to protect your friends and easily deal with demonkin.\" Damian crouched to Lord's eye level. \"For example, vampires.\"\n\nDamian continued the lesson with genuine enthusiasm.\n\nIn the shadows, Kasim and the Silver Dragons assassins maintained their vigil, guarding Lord's back.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule: 20 chapters a week.**\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}