{
  "id": 372,
  "title": "Chapter 372",
  "content": "# Chapter 372\n\nRandy collapsed. The doppelganger wore Grid's face, but it didn't matter—Tiramet had seen through the deception. He hurled the slime-like creature to the ground with enough force to crack stone.\n\n> [Doppelganger Randy's health has fallen to 0.]\n> [Randy is forced to return to the pet inventory. You cannot summon it for the next 24 hours.]\n\n\"You will pay with your lives.\" Tiramet's voice was cold fury.\n\nThe ground exploded beneath him. He crossed the distance to Grid's group in a heartbeat—too fast for Yura or Sticks to track. Only Grid caught the motion in time to react.\n\nMetal shrieked. Grid blocked the strike with his combined Failure and Iyarugt, but the impact still drove him back two steps. Despite his legendary strength stat, raw force alone wasn't enough.\n\nTiramet twisted. His fist blurred toward Grid's temple.\n\n> [You have suffered 9,975 damage.]\n\nGrid grunted. His body smashed through the air, slamming into the wall behind him with bone-rattling force. The viscount's attacks were nightmares to counter—physical and magical damage woven together, the properties shifting mid-strike.\n\n*This isn't good.*\n\nTension coiled in Grid's chest. A year ago, he would've panicked. Now? He saw opportunity. Strong opponents were how legends were forged.\n\n*Kraugel could've beaten him.*\n\nGrid pushed himself upright. He wanted to prove he was closing the gap.\n\nWithout hesitation, he charged. Blood ran down his face, but his momentum never faltered.\n\n\"You bastard!\" Tiramet bellowed.\n\nGrid's greatsword carved through the viscount's guard, opening a nasty gash. Tiramet didn't dodge—he *chose* not to. His massive hand shot out, clamping around Grid's skull. Fangs gleamed.\n\n\"Magic Missile.\"\n\nWhite light punched between Tiramet's eyes. The God Hands materialized in the same instant, seizing the staggered vampire. Blood fountained from his neck as Iyarugt found flesh.\n\nTiramet's head pounded. *How is he maintaining his concentration?*\n\nThe first exchange should have broken him. The mounting pressure should have crushed his will. Why wasn't there any despair in those eyes? This human's mentality was fundamentally different.\n\n*Every other human realized I'm immortal and gave up.*\n\nTiramet didn't like it.\n\nHis eyes flared crimson. Magic erupted from his core, forcing Grid onto the defensive. Meanwhile, Yura examined the weapon in her hands.\n\n---\n\n**[Alex's Magic Engineering Gun]**\n\n**Rating:** <span class=\"rarity-unique\">Unique</span>\n\n**Durability:** 215/215\n\n**Modes:**\n\n* **Pistol:** Attack Power 419 | Mana Purification Rate +30%\n* **Rifle:** Attack Power 914 | Mana Purification Rate -20% | Firing Speed -50%\n* **Bayonet:** Attack Power 705 | Attack Speed +10% | Stabbing Attack +30%\n\n*Mode switching requires 5-second cooldown.*\n\nA magic weapon crafted by the dwarven master Milepeu, who taught Pagma before he ascended to legend. Contains the essence of dwarf technology.\n\n**Conditions:** Demon Slayer\n\n---\n\n*It's incredible.*\n\nYura's current guns only supported pistol mode. They lacked raw power and offered no mana purification bonuses. This weapon was leagues beyond.\n\nSticks watched her examine the gun. A smile crossed his weathered face. \"I have observed you carefully. This weapon can unleash your true potential.\"\n\nYura's brow furrowed. \"Why give me something so valuable without conditions? We only just met.\"\n\n\"You are Grid's companion.\"\n\nThe hidden piece clicked into place. Normally, a Demon Slayer would need to conquer the Behen Archipelago to the 25th island to obtain Alex's gun. An entire quest chain, skipped. All because she fought beside Grid.\n\n*Because of him.*\n\nMetal rang against metal. Grid and Tiramet clashed in a spray of sparks and blood. Yura's gaze lingered on the battle.\n\n*Like falling into a net.*\n\nShe couldn't escape. The thought should have terrified her—being so dependent on someone—but instead, she smiled. She raised the gun, sighting down the barrel at Tiramet's skull.\n\nThe mechanism hummed. Clicked.\n\n> [Alex's Gun will switch to Rifle Mode.]\n\nThe blue barrel extended. Mana flowed from Yura's core into the weapon, crystallizing into ammunition.\n\n\"Extinction.\"\n\nThe shot cracked like thunder.\n\n\"...!\"\n\nBeside her, Sticks' eyes widened. The speed at which she purified raw mana into a bullet—it rivaled Alex himself. Perhaps even surpassed him.\n\nThe explosion was catastrophic.\n\n\"Kuaack!\"\n\nHalf of Tiramet's face disintegrated. Blood and tissue sprayed across the floor, revealing bone beneath. Perfect accuracy. Devastating power.\n\nTiramet reeled. His hate-filled gaze snapped toward Yura.\n\nGrid didn't waste the opening.\n\n\"Linked Kill.\"\n\nHis greatsword hammered into Tiramet's ruined face. The viscount's scream died in his throat.\n\nThe blade rose and fell. Once. Twice. Three times. Grid's assault was relentless—two strikes missed, but four connected. Each one critical. The Holy Light Gloves triggered three times, multiplying the devastation.\n\nGrid pressed the advantage.\n\n\"Link!\"\n\n> [Link has risen to Level 6.]\n> [The power of Link will increase.]\n\nHis sword became a steel blur. Twenty strikes in the span of a heartbeat.\n\nDespite his catastrophic injuries, Tiramet blocked most of the attacks with his forearms. His reflexes were inhuman. But he wasn't fighting just Grid anymore. His focus on the swordsman left him exposed.\n\n\"Vindictive Sword.\"\n\nWhite light carved through the shadows. Yura had closed the distance using her Extinction Bullet momentum. Her aura blade struck true, opening another grievous wound.\n\n*She's powerful.*\n\nDemon Slayer. The class lived up to its name—every passive and active ability amplified against demonkin. Yura's level, stats, and equipment were all inferior to Grid's, yet she dealt fifty percent more damage to Tiramet than he could.\n\n\"Ugh!\"\n\nConfusion warred with rage in Tiramet's eyes. One of Beriache's nine direct descendants, forced on the defensive by two humans. The humiliation rivaled only his defeat at Alex's hands, a century and a half ago.\n\n*I need to retreat.*\n\nHis body dispersed into smoke. Pride be damned—survival came first.\n\nGrid and Yura had other plans.\n\n\"Pagma's Swordsmanship, Wave.\"\n\n> [Wave has risen to Level 5.]\n> [The power of Wave will increase.]\n\nEnergy rippled outward in concentric rings, slowing Tiramet's escape.\n\n\"Light of the End.\"\n\nGolden detonations lit up the cavern. Space itself seemed to shudder.\n\n\"This... w-what is...? Kuaaaaak!\"\n\nTiramet's legendary regeneration faltered. The Demon Slayer's skills neutralized his immortality. Fatal wounds that should have closed remained open, bleeding freely. His form began to fade, unraveling at the edges.\n\nHis screams echoed long after his body vanished.\n\n> [Vampire Viscount Tiramet is forced into hibernation after exhausting all his power.]\n> [You have gained 1,325,810,470 experience.]\n> [You have obtained Tiramet's Belt.]\n> [You have obtained Tiramet's Shoulderguards.]\n> [Your level has increased.]\n> [Tiramet's strength is engraved on the Rune of Darkness.]\n\nGrid's Legendary Blacksmith's Appraisal activated automatically.\n\n> [The blacksmith who became a legend possesses an excellent discerning eye. Hidden features in target items will be revealed.]\n\n---\n\n**[Tiramet's Shoulderguards]**\n\n**Rating:** <span class=\"rarity-unique\">Unique</span>\n\n**Defense:** 95 | **Health:** +3,000\n\n* Low probability of nullifying physical attacks.\n\nThe favored shoulderguards of Vampire Viscount Tiramet. Grants the wearer exceptional survival capacity.\n\n**User Restriction:** Level 320 or higher.\n\n**Weight:** 190\n\n---\n\n**[Tiramet's Belt]**\n\n**Rating:** <span class=\"rarity-epic\">Epic</span> (Growth)\n\n* Reduces damage received by 10%\n* **Stamina** +100\n\nA belt containing the unique magic power of Vampire Viscount Tiramet.\n\n**Weight:** 13\n\n> [This item has a hidden function.]\n> [Information about Tiramet's Belt has been updated.]\n\n* *If this belt reaches Legendary rating, the wearer can summon Vampire Viscount Tiramet.*\n\n---\n\n*Hah...*\n\nElfin Stone's ring could summon Elfin Stone. Tiramet's belt could summon Tiramet. If all items containing a vampire's unique mana followed this pattern, he could eventually build an army of vampire bosses as subordinates.\n\n*This is incredible.*\n\nThe thought of commanding powerhouses like Elfin Stone and Tiramet sent electricity through his veins.\n\nYura approached. She extended her hand.\n\n\"...Please.\"\n\n\"Of course.\" Grid nodded.\n\nShe wanted her share of the loot. He interpreted her gesture immediately, holding out Tiramet's belt.\n\n*A bit disappointing, but fair.*\n\nWithout Yura's help, Tiramet would have killed him. Besides, strengthening Yura meant strengthening Overgeared. It was natural to distribute items to her.\n\nBut Yura didn't take the belt.\n\n\"Not the items.\"\n\n\"...Then what?\"\n\nGrid's confusion must have shown on his face. Yura's cheeks flushed. She looked away.\n\n\"Hold my hand. As... as thanks for my hard work.\"\n\nHer voice was small. Shy.\n\nGrid blinked. Then he grasped her hand and shook it vigorously.\n\nSticks shook his head, sighing.\n\n---\n\n\"Mama! Ma!\"\n\nLord's sense of balance improved daily. A week ago, he'd taken his first steps. Now he toddled across the nursery without falling, reaching Irene with a triumphant giggle. She scooped him into her arms.\n\n\"My son, you are the very image of your great father.\"\n\n\"Wow.\"\n\nRuby watched from the corner, her expression complicated. Her brother had worn diapers until he was five. Comparing him to the prodigy Lord was... generous.\n\nBut some truths were better left buried. Ruby said nothing.\n\n---\n\n*Glossary of Common Korean Terms.*\n\n*OG: Glossary Link.*\n\n*Current schedule: 20 chapters a week.*\n\n*Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.*"
}