{
  "id": 373,
  "title": "Chapter 373",
  "content": "# Chapter 373\n\n*I haven't grown enough.*\n\nGrid's total health in his blackened state hovered just below 30,000. Tiramet could kill him in three or four hits. Yet Grid had endured. He blocked and dodged the attacks with predictable trajectories himself, relying on the God Hands and Randy only for the strikes too difficult to handle alone.\n\nHe assessed his control and his ability to leverage items. *There's still a long way to go.* The dissatisfaction gnawed at him. The enemies he would face in the future would only grow stronger.\n\n*Is there a definitive way to become stronger? No matter how much I improve my control, it's impossible to avoid every hit in battle.*\n\nWhat if he created an item specifically designed to receive damage?\n\n*A damage reflective item would be simple.* His thoughts raced. *Or armor with a black hole effect—something that drags attackers into another dimension.*\n\nThe fanciful ideas entertained him. For Grid, imagination was power itself. After all, he possessed the Item Creation skill. Satisfy contained countless items with functions he had yet to discover. His imagination meant infinite possibilities. Grid believed in his own potential. He grasped the Rune of Darkness.\n\n> **[Rune of Darkness]**\n> \n> **Bound Item**\n> \n> It is permanently preserved in your inventory. Trading, dropping, or destroying it is impossible.\n> \n> **Usage Effect:** Demonic power state will rise in exchange for its use.\n> \n> * Normal attacks and skill attacks will deal an additional 20% dark damage.\n> \n> **Unique Lasting Effect:** When dealing with named demonkin and demons, you can absorb unique attributes.\n> \n> * **Tiramet's Power:** If your health drops below 10%, health will be restored to 30% in an instant. Cooldown Time: 12 hours.\n\n*My survivability is getting higher.* Grid studied the rune, an idea crystallizing in his mind. *It would be ideal to become a pure tanker.*\n\nOvergeared boasted many damage dealers but few tankers. Only Vantner and Toban could be relied upon for that role. *If I become a tanker, the synergy with the guild will explode...*\n\nHe imagined himself clad in heavy armor, shield raised. Then his expression soured. *...Then Pagma's Swordsmanship becomes useless.*\n\nGrid possessed the strongest attack skills. Wasting that talent by becoming a pure tanker seemed foolish. But the more he considered it, the more nuanced the issue became.\n\n*No, can't I swap between item sets?* What if he maintained both an offensive set and a defensive set, switching between them as necessary? *It would be easier to cope with sudden situations like the Tiramet raid.*\n\nAs Grid concentrated, his appearance grew mature and gentle. Yura watched him, her gem-like eyes glistening with moisture.\n\n***\n\n\"It's dirty.\"\n\n\"It's been a long time.\"\n\nOn the east side of the castle's first floor, towering pillars spread out like a stone forest. Pon and Vantner's irritation soared. The tricks of Ran—the vampire baron who attacked through darkness and pillars—had worn their patience thin.\n\n\"The terrain is too much of a disadvantage. I'd rather break it all down.\"\n\nPon twisted the arm holding his spear. His muscles swelled as he gathered his strength.\n\n\"Crasher Spear.\"\n\nA deafening roar split the air. The attack destroyed everything in its path with power that would make even allies flinch. The spear cleaved from top to bottom, collapsing the towers. The shadow hiding behind the pillars came into view.\n\nVantner seized the opportunity.\n\n\"Sun Guard!\"\n\nHis shield blazed like the sun, driving away the darkness. The light rays burned so bright they resembled a nightclub's strobes. Ran no longer had a place to hide. She fired magic bullets at the two men.\n\n\"It isn't a big deal!\"\n\nThe magic was laughable compared to Elfin Stone's sorcery. Vantner blocked the magic bullets with his shield, while Pon flew through the dust cloud and aimed his spear. But Vantner charged ahead and interfered with Pon's path.\n\nPon staggered as Vantner's massive body collided with him. \"You damn pig!\"\n\nVantner also cried out. \"You idiot! There's a path in front of you. Why run towards me?\"\n\n\"Why do I need to explain every reason individually? You ignorant bastard.\"\n\nPon and Vantner growled at each other. Thanks to their discord, Ran passed through the crisis and escaped through the pillars in the rear that hadn't yet collapsed.\n\n*I'm glad their teamwork is a mess.* Ran thought with relief as she fired magic from behind a pillar.\n\nA red flash shattered the ceiling. Falling debris restrained Pon and Vantner's movements. Ran moved back through the darkness and aimed sharp nails at Pon's neck.\n\nThe blood-red nails pierced a hole in Pon's neck.\n\n\"Puhaha! You got hit!\"\n\nVantner laughed and taunted Pon. The journey of the two men was long and harsh.\n\n***\n\n> **[The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]**\n> \n> **[A hidden function doesn't exist.]**\n\nGrid appraised Alex's gun. The results disappointed him somewhat. He moved quickly with Yura, Sticks, and Bini.\n\n\"Over there is the closest.\"\n\nSticks borrowed the power of the earth and wind elementals to locate ongoing battles. He had also enabled Grid's entry into the vampire city. Helpful in many ways.\n\n*But he didn't give me an item...* Yura had received Alex's gun for free. Grid couldn't suppress a twinge of jealousy.\n\nGrid moved through the door Sticks indicated. His expression turned absurd. Yura, following behind, shared the same reaction.\n\n\"You useless octopus head!\"\n\n\"I would've died earlier if I wasn't a tanker!\"\n\n\"If you weren't there, the vampire baron would be dead!\"\n\n\"...\"\n\nEvidence of destruction littered the room. Dozens of pillars still stood, and Pon and Vantner were fighting each other in front of the enemy.\n\n\"Hohohohut!\"\n\n\"Kuk!\"\n\n\"How rotten!\"\n\nBecause they were grabbing each other's collars, Pon and Vantner weren't free. The two men allowed the female vampire to attack before she retreated behind the pillars. Anger flared in Grid's chest.\n\n\"I won't say anything about the personal relationship between you two. But...\"\n\nGrid strode forward and activated Pagma's Swordsmanship, Restraint. Ran, flying toward the new target like a moth to flame, stopped mid-air.\n\n*What?*\n\nRan's body broke into a sweat as Grid activated Pagma's Swordsmanship, Pinnacle, then followed up with Kill.\n\n\"Kyaaak!\"\n\nRan let out a terrible scream and rushed toward Pon and Vantner. She broke free from Restraint and attempted to hide in the darkness, but Yura didn't allow it.\n\n\"Purification Bullet.\"\n\nThe bullets made from blue mana turned Ran's body into a beehive.\n\n\"Linked Kill.\"\n\nGrid finished it cleanly.\n\n> **[Vampire Baron Ran has been destroyed.]**\n> \n> **[525,810,470 experience has been acquired.]**\n> \n> **[Two <span class=\"rarity-uncommon\">Blessed Weapon Enhancement Stones</span> have been acquired.]**\n> \n> **[Seven weapon enhancement stones have been acquired.]**\n> \n> **[Skillbook: <span class=\"rarity-rare\">Dark Fairy Tale</span> has been acquired.]**\n\nBlood poured out. Black smoke rose. Grid sent a sharp, intimidating look toward Pon and Vantner.\n\n\"In the future, fight at the appropriate time and place. Think about the pain your colleagues are going through while you unnecessarily waste time here.\"\n\nIt wasn't an exaggeration. Grid had rushed here from the Behen Archipelago for his colleagues. He couldn't tolerate Pon and Vantner ignoring their comrades because of personal feelings.\n\n\"...I'm sorry.\"\n\n\"I'll be careful in the future.\"\n\nPon and Vantner bowed and apologized. They understood why Grid was angry, acknowledged their mistakes, and recognized Grid as their leader. Grid reached out to the two men who couldn't lift their heads. Was it an offer to shake hands so they wouldn't be too discouraged? Pon and Vantner interpreted Grid's gesture this way.\n\n\"Lend me a spear.\"\n\n\"...?\"\n\nGrid made an unpredictable demand.\n\n***\n\nA large hall on the castle's first floor. Faker struggled in a space where chandeliers hung like ornaments.\n\nThe vampire baron, Mountain. He wore unusually heavy armor and wielded a heavy weapon. The ground shook with every movement, threatening Faker's balance.\n\nFaker's posture collapsed. His reaction slowed. He blocked the mace with his dagger. The recoil from the collision launched him into the air like a feather. Mountain reached out a hand.\n\n\"Blood Binding.\"\n\nBlood chains rose and surrounded Faker's body. But it was merely Faker's clone.\n\nThe chains exploded. The remnants of Faker's clone filled the air.\n\nFaker took advantage of his class's swiftness and appeared behind Mountain. He swung at Mountain's thick neck, aiming precisely at the gap in the armor joints.\n\nAs the hits accumulated, damage built up. The blows that had caused deadly wounds to Elfin Stone pierced Mountain's neck in succession. No emotion appeared in Faker's eyes as blood soaked his face.\n\n\"You rat bastard!\"\n\nMountain shook from the shock and released magic power in every direction. Faker flew back. A large axe hurtled at him as he tried to regain his balance mid-air.\n\n*I have to take this hit.* If he used Flash here, his mana and skill linkage would become twisted. Faker prepared for the impact.\n\n\"Spear Shot.\"\n\nA silver-white spear flew from the entrance and penetrated Mountain's head. The large axe's trajectory changed. Faker avoided it and turned his face toward the entrance.\n\n\"Thank you, Pon... Grid?\"\n\nHe never imagined Grid would be the one to save him. Grid waved at Faker, who displayed a rare look of shock.\n\n\"To be driven on the defensive, isn't this unlike you?\"\n\nFaker, who was often beside Grid, shrugged. \"...But with you, I can be extraordinary.\"\n\nIt was a signal.\n\n\"These damn humans!\"\n\nMountain's aggro shifted to Grid, and Grid handled it as always. With Grid blocking Mountain, Faker moved like he had wings on his back. Once Vantner and Yura stepped in, Mountain quickly became covered in wounds.\n\n\"My spear. My spear...\"\n\nPon busied himself reclaiming his weapon."
}