{
  "id": 374,
  "title": "Chapter 374",
  "content": "# Chapter 374\n\n> [Vampire Baron Mountain has been destroyed.]\n> [211,555,002 experience has been acquired.]\n> [Three Blessed Armor Enhancement Stones have been acquired.]\n> [Nine armor enhancement stones have been acquired.]\n> [**Skillbook: Skin Enhancement** has been acquired.]\n\nA vampire baron. A semi-boss grade monster that required 10 to 15 minutes when five Overgeared elites fought together. With Grid and Yura added to the mix, the raid speed tripled.\n\nPon stared at the dissipating corpse. \"Five minutes for a semi-boss...\"\n\nVantner's jaw hung slack. Faker said nothing.\n\nThe raw power on display rendered them speechless. Grid's combination of stats, items, and class was expected. But Yura's growth cut like a blade, sharp and dazzling.\n\nYura checked her gun's heat vent. \"Class and items.\"\n\nHer explanation landed flat and matter-of-fact. She was becoming overgeared too.\n\n***\n\nThe castle's first floor, northern corridor. Jishuka and Zednos stood isolated, vampires flanking them from both directions. Regas had triggered a teleportation trap, scattering the party like seeds in wind.\n\n\"Multi Shot.\" Jishuka's bowstring sang.\n\n\"Wind Wave.\" Zednos thrust his staff forward.\n\nArrows and magic filled the corridors, left and right, slowing the vampire advance. But the tide was endless. Their mana pools drained drop by drop.\n\nZednos grimaced. \"The respawn speed is absurd.\"\n\n\"Worst possible position.\" Jishuka nocked another arrow, sweat streaming down her temples.\n\nTheir stamina gauges flickered into dangerous territory. Breath came ragged and harsh.\n\n*Peeng! Pepeng!*\n\nBlood shots cut through the gaps in their defense. One struck Jishuka's shoulder as she reached for a fresh arrow. Her form buckled.\n\n\"Jishuka!\"\n\nZednos' cry echoed off stone walls as dozens of vampires surged forward.\n\n\"Wind Cutter! Wind Missile!\"\n\nHe abandoned all restraint. His only thought: protect Jishuka. Mana expenditure be damned. The immediate crisis passed.\n\n> [You have no mana.]\n> [Your mana potion cooldown time hasn't returned.]\n\n\"No...\" The blood drained from Zednos' face.\n\n\"Duck.\" Jishuka's voice cut through his panic.\n\nHe dropped without hesitation. Trust ran bone-deep between them.\n\n\"Phoenix Arrow.\"\n\n*Kwa kwa kwa kwang!*\n\nA massive firebird screamed over Zednos' prone form, transforming the right corridor into an inferno. Over fifty vampires burned. Jishuka hauled herself upright.\n\n\"Move. Now.\"\n\nZednos didn't budge.\n\n\"What are you doing?\" Jishuka snapped.\n\n\"Buying you time. Run.\"\n\nShe positioned herself between him and the left corridor's approaching swarm. Phoenix Arrow had gutted her speed, leaving her movements sluggish and heavy. Still, her arrows found their marks. Mithril and silver tips punched through vampire skulls.\n\nThe creatures kept coming. Headshots meant nothing. They closed the distance, claws extended.\n\n\"J-Jishuka...\" Zednos' voice cracked.\n\n\"Why aren't you moving? Find the others.\"\n\n\"...Fine.\"\n\nThe path Jishuka carved wouldn't stay open long. New vampires could materialize at any moment. Zednos forced his legs to cooperate, honoring her sacrifice.\n\n\"Jishuka, move.\"\n\n*Sururuk.*\n\nSomeone materialized between them where empty air had been. Grid, wrapped in his white hooded zip-up.\n\n\"Pagma's Swordsmanship, Transcended Link.\"\n\n*Pepepepeng!*\n\nBlue-black energy blades erupted outward. Dozens of vampires in Jishuka's corridor ceased to exist. More spawned immediately, but the respawn rate couldn't match Grid's overwhelming damage output.\n\n\"Grid!\"\n\nRelief crashed through Jishuka. She threw herself at him, skin slick with sweat, body pressing against his. The contact sent shockwaves through Grid's nervous system.\n\n*Ga... Ganadaramabasa...*\n\nSoft. Supple. His nose threatened mutiny. Yura arrived a moment later, witnessed the scene, and glanced down at her own chest.\n\n*I'm not small either.*\n\nSignificantly above average for Korean women. But Grid's preferences defied all reason.\n\n***\n\nThe vampire expedition's strike team cut through their opposition like a sharpened blade.\n\nRegas possessed overwhelming combat instinct. Peak Sword's techniques resisted prediction. Toon shifted between beast forms, adapting to any situation. Ibellin remained unrefined, but Piaro himself acknowledged the boy's potential. Toban, the 1st ranked paladin, acted as poison to vampire physiology. And Huroi, the 1st ranked orator, bent wills with words alone.\n\nThey operated as a singular weapon. Huroi and Toban drew aggro. Regas and Toon struck from the chaos. Peak Sword and Ibellin exploited every opening. Three vampire barons collapsed in minutes.\n\n> [A **Strength Elixir** has been acquired.]\n\n\"Wow.\"\n\n\"Seriously?\"\n\nTwo months of vampire city exploration. Tens of thousands of vampires slaughtered. Not a single elixir drop until now. The unexpected prize sparked genuine excitement before reality reasserted itself.\n\nPeak Sword straightened. \"No time to celebrate. Our people need us.\"\n\nThe expedition team was strong. But without Toban and Huroi anchoring the formation, stability crumbled. Peak Sword understood the tactical reality and pushed them forward.\n\n\"How have you been?\"\n\nGrid materialized before them.\n\n***\n\n\"Damn Regas.\" Vantner jabbed a finger at the martial artist. \"Suffered because of you.\"\n\nPon crossed his arms. \"Never scout ahead again.\"\n\n\"...I'm sorry.\" Regas' head dipped.\n\nHis recklessness had endangered everyone. The criticism landed fair and justified.\n\n\"I'll control myself better.\"\n\nThe genuine regret and repentance satisfied Pon and Vantner. They let it drop. Jishuka turned to Grid.\n\n\"How did you enter?\"\n\nVampire city entrances sealed after someone passed through. Entry during an active raid should have been impossible.\n\nGrid gestured. \"His power.\"\n\nAll eyes shifted to Sticks. An elf. The noble race, incarnation of beauty, guardian of the world's peace. Among them, the legendary high elf Sticks offered a polite nod.\n\n\"Hello. I am Sticks. I owe Grid my life.\"\n\n*Another named NPC...*\n\nGrid's network expanded like roots through soil. The Overgeared members cycled through shock and amazement. His ability to befriend named NPCs transcended the ordinary. Grid addressed the assembled guild.\n\n\"We're leaving.\"\n\n\"What?\"\n\nAlarm rippled through the ranks.\n\n\"Grid, we can clear this place.\" One member protested.\n\n\"First floor is done. Why retreat now?\" Another challenged.\n\nSeveral party members balked at the suggestion.\n\n\"I agree with Grid.\" Someone spoke up. \"Baron-grade vampires infest the first floor. Second floor could be crawling with viscounts.\"\n\n\"Tiramet was a viscount and he was only the first floor boss.\" Another voice joined. \"Marquis-grade vampires likely populate floors two and three.\"\n\n\"Worst case? Marie Rose appears. We can't handle her.\" A third added weight to Grid's position.\n\nThose Grid had rescued from danger sided with him immediately. Tension thickened the air. Grid smiled, slow and deliberate.\n\n\"Special training.\"\n\n\"Special training?\"\n\n\"There's a place called the Behen Archipelago. Entry limits to one person, but it's an instant dungeon. You can enter separately and proceed simultaneously.\"\n\nQuestions formed on every face. Grid explained his experiences in the archipelago, detailing the rewards and challenges. Color returned to the Overgeared members' expressions as understanding took root.\n\n***\n\nThe Sword Grave.\n\nHundreds of thousands of weapons pierced the hillside like metal grass. The legendary blacksmith Pagma had spent his final years here. But Agnus cared nothing for Pagma.\n\nThe legendary magician Braham. Securing his body. That was the goal.\n\n\"Nothing.\"\n\nRumors placed an ice wall somewhere in the Sword Grave, Braham's body sealed within. Nearly a month of searching had yielded exactly zero ice walls.\n\nAgnus leaned against a greatsword. \"Should've taken the soul.\"\n\nOne month ago, he'd encountered Braham's soul here. Let it slip through his fingers. The memory still triggered tremors.\n\n\"Didn't expect a soul to cast magic.\"\n\n*Takak. Takak takak!*\n\nHundreds of summoned skeletons scoured the hillside. They touched embedded swords, excavated soil, hunted for Braham's body. The search remained fruitless.\n\n\"Can't stay here forever.\"\n\nMonster density in the area kept his leveling pace acceptable. But one month stationary meant zero quest progression. Agnus pulled up his inventory, examining the Rune of Death.\n\n> **[Rune of Death]**\n> Bound Item\n> \n> Permanently preserved in your inventory. Trading, dropping, or destroying it is impossible.\n> \n> **Usage Effect:** Increases summon abilities in exchange for leadership stats.\n> * 20% increase to all summon stats.\n> \n> **Unique Lasting Effect:** Absorb unique characteristics from named corpses.\n> * **Blue Knight's Faith:** Creates shield absorbing 10,000 damage. Cooldown: 1 hour.\n> * **Bentao's Talisman:** Exchange health with target. Cooldown: 12 hours.\n> * **Tarant's Swordsmanship:** Generates Advanced Sword Mastery. Enables 'Bloodless' with sword weapons.\n> * **Mumud's Knowledge:** +15% magic casting speed. +30% mana regeneration.\n\nAccording to the original plan, Braham's trait should have been added to this list.\n\n*A legendary lich. That's what I wanted.*\n\nAgnus opened his whisper interface, targeting Veradin.\n\n*Where is the great demon Furfu's nest?*\n\nTime was equal currency. As Grid and Overgeared grew stronger, so did everyone else. The race never stopped.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}