{
  "id": 376,
  "title": "Chapter 376",
  "content": "# Chapter 376\n\n\"Pagma's Swordsmanship.\"\n\nA haze rippled outward from Grid's body. The air shimmered with faint crimson light as he fell into the stance of the first sword dance. The legendary class demonstrated absolute dominance.\n\n\"Transcended Link.\"\n\n**Kwa kwa kwa kwang!**\n\nTwenty red-black energy blades erupted in rapid succession, each strike heavy with killing intent. The barrage flooded toward Kraugel. Billions of viewers held their breath.\n\n*Sururuk.*\n\nKraugel slipped through the gaps with minimal motion. His body shifted by inches, never more. He closed the distance in two steps. The white sword in his hand traced a curved line toward Grid's throat.\n\n*Chaaeng!*\n\nGrid's blade snapped up to meet it. The camera shook from the impact. Steel screamed against steel. Then the feed cut to black and white.\n\n**2XX3.10.27**\n\nThe date burned across the screen. The opening video for the 2nd National Competition ended.\n\n> **[Community Response - Opening Video]**\n\n> User_7721: Great.\n\n> User_5534: It's cool, really cool.\n\n> User_9845: The opening of a game should taste like this.\n\n> User_2198: Something is bubbling up inside me. It's much cooler than the Demon Hero movies.\n\n> User_6612: Everybody has different tastes. I prefer the Demon Hero movies.\n\nPublic interest in the opening video burned hot. Among them, Korean netizens fixated on two figures standing beside the Overgeared members.\n\n> User_KR_4421: Yura and Peak Sword are in position with the Overgeared members.\n\n> User_KR_8833: When did they join Overgeared?\n\n> User_KR_5590: There is continuous breaking news.\n\n> User_KR_7712: Wow. I never imagined that Yura and Peak Sword would join Overgeared. Grid's forces seem truly unique.\n\n> User_KR_3309: It is likely that there are eight main guilds in Satisfy now, not seven. The existing seven guilds and Overgeared.\n\n> User_KR_6655: Isn't Peak Sword the master of the Silver Knights? Did the Silver Knights merge with Overgeared?\n\n> User_KR_4488: It's likely.\n\n> User_KR_9921: We can think of Overgeared as a Korean guild. Their master is Korean and most of the guild members are Korean.\n\n> User_KR_1134: Do you know Overgeared?\n\n> User_KR_7899: Yura and Jishuka are really pretty. I will have no other wishes in my life if I can meet them once.\n\n> User_KR_5521: No, it's absurd to get both of them. Choose one of the two.\n\n> User_KR_8844: He's even a couple in the game with Irene. I'm so envious.\n\n> User_KR_2267: People can get everything if they are successful in their field. I will try my best when it comes to writing comments on the Internet as well.\n\n> User_KR_9103: Then I guess I only have Satisfy from now on. I will be like Grid and buy an 800 million won car.\n\n> User_KR_4456: I've been only playing Satisfy since it opened, but I'm still level 250. I can't be Grid.\n\n> User_KR_7788: Fun. The users with levels above 250 should comment here.\n\nThe dignity of Grid and Overgeared communicated itself clearly to the Korean public. Lauel's intention, realized.\n\nHowever, contrary to Lauel's intentions, international netizens concentrated on something else entirely.\n\n> User_INT_6634: Wow. Kraugel will participate in the competition.\n\n> User_INT_8821: Yes. I thought he would stick to the mysterious concept for the rest of his life.\n\n> User_INT_3312: It isn't a mysterious concept. He just focuses on leveling up to the end.\n\n> User_INT_9957: I wonder why Kraugel is participating in the tournament?\n\n> User_INT_2245: Of course, he must covet the prizes.\n\n> User_INT_5598: Now that Grid's reputation is growing to a level that can threaten him, his pride means he has come to show the difference in skill.\n\n> User_INT_7701: Indeed. Kraugel is in a different class.\n\n> User_INT_4483: What are you saying? Grid has shown many times what he can achieve, their classes are too different.\n\n> User_INT_9924: What nonsense. Don't you see how easily Kraugel avoided Grid's skill? Kraugel is a wall. I don't mean to ignore Grid, but Kraugel is too great.\n\n> User_INT_6617: What are you saying? How do you know Kraugel managed to avoid Grid's skill? You can't distinguish between reality and directing.\n\n> User_INT_3390: You don't believe Kraugel's skills? In the old days, rankers shot videos of Kraugel hunting and his control ability exceeded common sense. Search on Mytube.\n\n> User_INT_8852: That video had over a billion hits.\n\n***\n\nLauel stared at the screen. His face twisted.\n\n\"Shit.\"\n\nPublic interest centered on Grid and Kraugel. Not Grid and Overgeared. The masses focused on individual glory, not the guild's collective strength. His initial intention, shattered.\n\n*It is because of Kraugel.*\n\nThe S.A. Group had listened to their request too easily. Now he understood why. They wanted this exact outcome.\n\n*This is bad.*\n\nThe opening video was a secondary problem. Lauel had planned to dominate the public consciousness by having Overgeared members win medals in every event. Now a variable called Kraugel threatened that entire strategy.\n\n*Considering Kraugel's inclinations, he is likely to participate in PvP, raid, and the siege.*\n\nGold medals in the three most popular events held tremendous value. However, as long as Kraugel existed, it was realistic for the Overgeared members to surrender those medals without contest.\n\n*No, not if it's Grid.*\n\nAccording to Grid himself, the reason he could win against Kraugel was because Kraugel wasn't in perfect condition. But Lauel believed otherwise.\n\n*The sky isn't untouchable.*\n\nSnow fell from it. Rain poured down. Thunder split it open. Typhoons tore through its fabric. Yet the sky itself never fell. Lauel knew that Kraugel shouldn't have been knocked down, even in an imperfect state. Grid breaking down the sky. It wasn't coincidence. It wasn't a miracle.\n\n*It is skill.*\n\n**Kwack!**\n\nLauel's fist slammed onto the desk. He pulled out a sheet of parchment and began composing a letter. The recipient was someone who could transform the worst crisis into an opportunity.\n\n***\n\nHao, the Genius at Fighting.\n\nMillions of Chinese citizens erupted in enthusiasm when he announced his intention to participate in the 2nd National Competition. He had skipped the first tournament entirely. Now they expected China to claim first place overall.\n\nHao himself felt differently.\n\n*Kraugel.*\n\nHis only object of reverence.\n\n*I didn't think you would participate in this tournament.*\n\nSweat beaded on Hao's forehead. His golden eyes stared at the screen, replaying that white sword cutting through space with surgical precision.\n\n*Can I play an active role against Kraugel?*\n\nNo. Hao knew the answer with absolute certainty. He would never reach that faraway sky. The distance between them was immeasurable.\n\nA homing pigeon descended toward him. The sender's seal bore Lauel's mark. Hao unrolled the letter.\n\n> [You didn't accept my friend request, so I can't send you a whisper. Thus, I had to send a letter.\n>\n> You are the first person to refuse the best of the 10 Rookies and the brains of Overgeared's request.\n>\n> This provocative attitude stimulated the other soul in my heart...]\n\nHao skimmed past the flowery nonsense. He found the main point buried in the third paragraph.\n\n> [Do you remember the promise that you made in the past? If my lord, Grid, breaks down the sky and becomes a new sky, you will spread your wings and fly into Grid's arms.]\n\nSilence.\n\nHao remembered it distinctly. The seven guilds had invaded Reidan and been crushed. Not by elite soldiers. By *farmers*. Hao had been forced to retreat. In exchange for his life, he received an offer to serve Grid.\n\nAt that time, Hao had replied that the only thing capable of holding a dragon was a sky. That sky, of course, was Kraugel. Grid would break Kraugel?\n\n\"It's impossible.\"\n\n**Kwajak!**\n\nThe letter crumpled in Hao's fist. He acknowledged Grid's skill. Grid possessed appropriate control and exceptional items. The current Grid ranked among the top players in the world. But compared to Kraugel?\n\n*Someone who can't overcome me won't be able to beat Kraugel.*\n\nThe more he considered it, the more absurd it became. Heat flooded Hao's chest when he thought about Kraugel.\n\n*It would be good to make them understand their target.*\n\nThe Overgeared Guild needed a lesson. He would teach them that the world was very narrow. Hao's golden eyes hardened with determination. He would prove it personally.\n\n***\n\nGrid and the Overgeared members escaped the 9th vampire city with Sage Sticks' assistance. They endured a chaotic day filled with media interviews and filming for the National Competition opening. Now they gathered in Reidan after a long absence.\n\n\"Ba! Baba!\"\n\nGrid froze.\n\n\"Heok.\"\n\nLord toddled forward on unsteady legs. His chubby arms reached out. Tears welled in Grid's eyes at the sight of his son.\n\n\"Is he calling me papa? Didn't you hear?\"\n\nExcitement radiated from Grid's entire body. The other Overgeared members showed little reaction. The reason became apparent immediately.\n\n\"Ba! Bababa!\"\n\nLord used the same title for everyone. Not just Grid. He waddled past his father and babbled the same sounds at Vantner.\n\nGrid's face turned pale. \"Heok. Surely you haven't forgotten your dad after not meeting for so long?\"\n\nLord shifted his gaze away from the man who couldn't hide his sadness. The infant's lips curved into a smile. Deliberate. Knowing.\n\nFrom the shadows, Kasim watched. His body shook.\n\n*A little baby is already teasing an adult.*\n\n***\n\nGrid left the bedroom after a long reunion with Irene. He observed the sleeping Lord with the <span class=\"rarity-rare\">Great Lord's Sword</span> and was astonished.\n\n> **[Character Observation]**\n>\n> **Name:** Lord Steim  \n> **Age:** 0 years  \n> **Gender:** Male  \n> **Occupation:** Young Nobleman\n>\n> **Title:** Grid's Son\n> * The son of a legendary blacksmith. He has inherited most of his father's abilities.\n>\n> **Title:** Genius of the Continent\n> * A genius that represents one continent. He overwhelms national geniuses, and his level and abilities will rise 60% faster than normal. In addition, he can acquire skills in a wide range of fields.\n> * However, there is a limit to the level and abilities that can be raised until he is 15 years old.\n>\n> **Title:** One who Will Become a Legend\n> * A person who will leave his name in history. There is an 80% chance of being immune to all status effects and illnesses. When attacked, if his health falls to 1 point, he will enter the immortal state for 2.5 seconds.\n>\n> **Level:** 3\n>\n> **Strength:** 40  \n> **Stamina:** 45  \n> **Agility:** 54  \n> **Intelligence:** 47  \n> **Dexterity:** 90  \n> **Charm:** 100  \n> **Dignity:** 17  \n> **Insight:** 80\n>\n> **Skills:** Beginner Blacksmith Skill (F), Beginner Weapons Mastery (C), Daluka's Methods (A+), Discerning Eyes (S), Overwhelming Charm (S), Lantier's Method (SS), Famous and Legendary Pedigree (SS).\n>\n> His mother is the successor of a noble family in the Eternal Kingdom and his father is a legend.\n>\n> He has inherited all of his parent's strengths, so his potential is outstanding. Teaching him will be inspiring.\n>\n> However, his talent and environment are so good that he is likely to become arrogant. Education will determine his history.\n\n*There is a title change and two more skills?*\n\nAccording to Irene, Lord had received constant discipline during the month when Grid was away. A slight increase in level and stats wasn't surprising. But why had 'Genius of Eternal' transformed into 'Genius of the Continent'?\n\nIt signified an increase in potential. There had to be a reason.\n\n*What on earth happened?*\n\nDaluka's Methods. Lantier's Method. The high ratings of the newly acquired skills sent Grid's mind racing. Lantier's Method especially. A massive SS grade rating. A legendary skill.\n\n*Who is the discipline teacher?*\n\nHow was he teaching to create a monster like this? This was completely...\n\n*A profit.*\n\nGrid sent a whisper to Rabbit. He instructed him to raise the discipline teacher's salary immediately.\n\nThe wages of the discipline teacher rose from minimum wage by one silver."
}