{
  "id": 377,
  "title": "Chapter 377",
  "content": "# Chapter 377\n\nFrance. The S.A. Group had spun up a temporary server for the opening video shoot, and now 224 players from 32 countries filled the staging area. The best of the best. Representatives of their nations. The elite of two billion Satisfy users.\n\nAnd standing among them, drawing every eye like a lodestone, was Kraugel.\n\nA young man shifted his weight, unable to stand still. \"Wow. Being able to see Kraugel in real life... I'm rewarded just for making ranker.\"\n\n\"He's so young.\" His companion stared openly, forgetting to blink. \"Not even thirty, and he's already at the peak. Two billion users, and he's number one.\"\n\nAnother ranker edged closer, lowering his voice. \"I've been a fan for years. Think we could bribe him into joining our guild?\"\n\n\"If bribes worked on him, he'd already be in one.\" The first man shook his head. \"Most of us here are probably fans.\"\n\nThe rankers understood Kraugel's greatness better than anyone. They'd all climbed the ladder. They knew how the experience curve turned vertical at higher levels, how every percentage point became a mountain to scale. For them, Kraugel wasn't just a genius.\n\nHe was transcendent. Beyond the realm they could reach.\n\nThe crowd buzzed with nervous energy. Rankers clustered in small groups, stealing glances. Most wanted to speak to him, to exchange even a single word with the legend. But no one moved. They gazed at him like children staring at a distant star, knowing it was beautiful but impossibly far away.\n\nEven Zibal hung back.\n\nThe leader of the Snake Guild clenched his fists at his sides. *I'm shrinking back.* Second on the unified rankings. Leader of one of the world's premier guilds. He'd failed against Overgeared, yes, but few could deny his strength. And yet here he stood, frozen, unable to approach.\n\nThen someone cut through the awkward atmosphere.\n\n\"Hello.\"\n\nGrid walked up to Kraugel and extended his hand. Around them, rankers exchanged knowing looks.\n\n*The Overgeared Guild is trying to cling to Kraugel.*\n\n*He'll be despised. Watch.*\n\nThey didn't know about the relationship between the two men. They expected contempt. Shame. A public rejection.\n\nThey were wrong.\n\nKraugel's expression warmed. He clasped Grid's hand. \"It has been a while.\"\n\nGrid smiled. \"Have you been well? I saw the rankings list. You've widened the gap with second place?\"\n\n\"This is all thanks to you.\" Kraugel's grip was firm. \"White Fang's performance has improved significantly. The hunting efficiency, the raid clearing speed. Thank you.\"\n\n\"I should be thanking you.\" Grid released his hand and fell into step beside him. \"Thanks to you, I was able to visit the Behen Archipelago and grow.\"\n\n\"Were you able to reach the thirtieth island?\"\n\nThe thirtieth island. The trials of the past, where even Kraugel had been eliminated. Grid's answer dropped like a stone into still water.\n\n\"I've just arrived at the fortieth island.\"\n\nKraugel's expression went blank. He stopped walking. Grid's abilities, he'd acknowledged them. Grid reaching an area before him made sense. But this frankly exceeded expectations. It felt like being struck in the back of the head with a hammer.\n\nBut the shock was... pleasant. Positive.\n\n*It's the first time I'm worse than anyone else.*\n\nInteresting. How many existences could drive him forward like this?\n\nGrid's smile turned enigmatic. He leaned in slightly. \"I didn't set a high record because I'm better than you. The trials of the Behen Archipelago are just suited for me.\"\n\n\"You don't need to be humble.\"\n\nThey walked side by side for a few more paces, then simultaneously stopped. Both had felt it. The presence of others trailing them, listening.\n\nGrid glanced around. \"There are many ears listening. Tell me the details next time.\"\n\nKraugel nodded. \"Wait.\"\n\nGrid's voice stopped him mid-turn.\n\n\"Have you seen the plan for the opening?\" Grid's gaze turned sharp, challenging. \"The last scene ends with me attacking you. I will do my best, so be careful not to die.\"\n\nCuriosity burned in Grid's chest. As his skills grew, who would prevail? Him or Kraugel? His eyes blazed with determination.\n\nKraugel met that gaze and smiled faintly. \"I'm looking forward to it.\"\n\n---\n\nAnd on that day, Grid learned.\n\n\"Pagma's Swordsmanship, **Transcended Link**.\"\n\n**Kwa kwa kwa kwang!**\n\nTwenty strikes. One of Grid's ultimate skills, unleashed at full power. Twenty separate attacks that should have overwhelmed any opponent.\n\nKraugel avoided them all.\n\nGrid didn't feel frustration. Just... clarity.\n\n*I still have a long way to go.*\n\nThe need to keep growing filled him with motivation. Across from him, Kraugel felt admiration rising.\n\n*The orbit is sharper.*\n\nDuring their spar two months ago—Satisfy time—Grid's **Transcended Link** had posed no real threat. The strikes had flown in straight lines toward their target, readable and easy to avoid.\n\nThis was different. The orbital paths weren't linear. Different directions mixed together, creating unpredictable angles. If the irregularity increased even more...\n\n*It will be very interesting.*\n\nAmong the players, few could truly challenge Kraugel. Most who tried were malicious, like Agnus. But Grid was different. Pure intentions. Clean motivation. The more time Kraugel spent with him, the more convinced he became that their rivalry would push him to develop further.\n\n*Also.*\n\nHe couldn't overlook the fact that Grid had surpassed him in the Behen Archipelago.\n\n**Chaaeng!**\n\nKraugel swung White Fang. Grid's sword rose to block. The impact verified Kraugel's determination.\n\n*I also need a new challenge.*\n\nHe would keep developing until the National Competition began. The promise formed in his mind just as the signal arrived—filming complete.\n\nZibal approached immediately, hand extended. \"Kraugel, it is nice to meet you. I am the second ranked Zibal. Just below you on the rankings.\"\n\nHe'd watched Kraugel talk so warmly with Grid. Surely the same courtesy would extend to him.\n\nKraugel looked at the offered hand. His expression turned apologetic. \"My mother is calling.\"\n\n\"...?\"\n\nIn front of more than two hundred rankers and a hundred S.A. Group officials, Kraugel stepped back from Zibal's hand.\n\n**Pahat!**\n\nHe logged out.\n\nChris burst into laughter somewhere in the crowd. Zibal's face burned.\n\n---\n\nA shabby housing complex squatted on the outskirts of Moscow, Russia. Among the crumbling buildings, one particular house belonged to Kraugel.\n\nKraugel—a Koryoin who'd grown up in poverty. Prejudice and discrimination had followed him like shadows throughout his life. Crisis after crisis. But his mother had been kind and wise, and her teachings had given him the strength to persevere. He'd entered a prestigious university. Found a good job.\n\nShe was a gigantic existence in his life. A debt he could never repay.\n\nRecently, his mother had grown thinner.\n\n**Pipipipipi!**\n\nThe emergency light on the capsule flashed red. Kraugel heard it and immediately logged out, stumbling from the pod. His feet carried him to his mother's bedroom before conscious thought could catch up.\n\nShe had Alzheimer's. An incurable disease that modern medicine couldn't touch. He'd invited the world's best medical staff with the money he'd earned. None of it had helped. His mother's condition didn't improve.\n\n\"My son!\" Her voice cracked with desperation. \"Where is my son?\"\n\nShe gazed at Kraugel with wild, unfocused eyes. Things flew from her hands—a lamp, a book, whatever she could reach. Rage and confusion twisted her features.\n\nKraugel crossed the room and wrapped his arms around her. \"Don't worry.\" His voice stayed gentle, controlled. \"Calm down. You will be able to meet your son soon.\"\n\nHe never smiled anymore.\n\nIn order to cure his mother's illness, he'd quit his job. Devoted himself entirely to Satisfy. The wealth he accumulated poured into treatments, experimental therapies, consultations with specialists across the globe. He believed that one day, his mother's warm touch would return. The recognition in her eyes. The gentle hand on his cheek.\n\nUntil then, he endured. Watched his mother with all his heart. Found what pleasure he could in Satisfy. Committed himself to everything completely, so the negative thoughts couldn't invade. Couldn't take root.\n\nCouldn't make him despair.\n\n---\n\n> 『 We have learned one thing from the fact that the Silver Knights Guild was absorbed into Overgeared. The Overgeared Guild has a total of three territories. Reidan, Bairan, and Cork Island. 』\n\n> 『 Isn't it unheard of for one guild to be running three territories? There is speculation that the Overgeared Guild is accumulating significant wealth. What do you think about this? 』\n\n> 『 Of course they're making a huge amount of money. Reidan is a large city. Bairan has hunting grounds spanning various level ranges. Cork Island is famous as a tourist attraction. They'll be collecting massive tax revenues every month. 』\n\n> 『 The Overgeared Guild's funding ability will evolve daily. At this moment, there are many reasons why so many players want to join Overgeared. 』\n\nThe opening video for the Second National Competition went live. The media, previously obsessed with Kraugel, shifted their attention. Grid. Overgeared. The new focus of their analysis.\n\nIt was because of the lack of concrete information on Kraugel. Thanks to Lauel's careful planning, the Overgeared Guild became a hot topic. Their popularity climbed daily.\n\nVantner snorted at the broadcast screen. \"There are too many fanciful stories. Overgeared is rich? Nonsense. We're living in poverty every day.\"\n\nAll the revenue poured into Reidan's development. The experts predicted wealth while the guild members actually suffered. It was almost funny.\n\nLauel leaned back in his chair, very satisfied. \"Reidan is so isolated that there's a lot of futile speculation. It's unlikely that anyone can guess the actual situation.\"\n\nAs Overgeared's reputation expanded, hostile forces would reduce. Talents would come swarming. Everything according to plan.\n\nRegas shifted forward. \"By the way, when are we departing for the Behen Archipelago?\"\n\nHe dreamed constantly of becoming stronger. Great enthusiasm toward the archipelago burned in him. Most of the Overgeared members felt the same.\n\nLauel rose from his seat. \"We will depart in an hour. Sticks will guide us.\"\n\n\"Grid?\"\n\n\"Grid will stay in Reidan for a few days.\" Lauel checked his notes. \"He wants to try combining blacksmithing and alchemy.\"\n\n\"Will combining alchemy and blacksmithing recreate the dwarves' unique techniques?\"\n\n\"That's a long story for later. For the moment, adding a unique option to an item is the limit.\"\n\nLauel believed that even one option might upset the battlefield.\n\n---\n\n> [<span class=\"rarity-epic\">Baby's Blacksmith's Hammer</span>]\n> \n> Rating: Epic\n> \n> Durability: 28/28   Attack Power: 10~12\n> \n> Odds of Making a Rare Rated Item: **+2%**\n> \n> Odds of Making an Epic Rated Item: **+1%**\n> \n> * **Dexterity +5**\n> \n> A hammer made of solid but light black stone.\n> \n> The legendary blacksmith Grid made it for his young son, so the focus is on making it easy to use.\n> \n> Conditions of Use: None\n> \n> Weight: 3\n\n\"Lord, you will be working with Papa for a while.\"\n\nIt was amusing, really. The son of a legendary blacksmith learning the techniques of a beginner blacksmith. During his stay in Reidan, Grid planned to train his son properly.\n\n\"Ba! Bababa!\"\n\nLord bounced with excitement. He really wanted to share this moment with his father.\n\n**Ttang! Ttang!**\n\n**Dung dung! Dung!**\n\nThe two hammers struck the anvil in uneven rhythm. Father and son, side by side. Kasim watched from the shadows, his covert skills and vigilance rising daily as he observed the strangely similar pair.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}