{
  "id": 378,
  "title": "Chapter 378",
  "content": "# Chapter 378\n\nSeventeen nations sprawled across the West Continent. Combined, their populations numbered in the billions. Among all those souls, Lord stood apart.\n\nHis learning speed defied reason. His capacity for growth transcended common sense. Yet even genius had its limits.\n\n*Dung! Dung dung!*\n\nLord's tiny hammer struck the mineral. Nothing changed. The metal refused to yield beneath the tool, indifferent to the will of the infant wielding it.\n\nGrid watched his son's face contort. Sweat beaded on Lord's forehead. The child's cheeks puffed out in frustration, creating an expression so endearing that Grid almost laughed.\n\n*Less than a hundred days old.* Grid ran his hand through Lord's dark hair, the same shade as his own. *Of course he can't shape metal yet. No matter how high his Dexterity, he has no experience. No strength.*\n\nGrid turned toward one of the smithy workers. \"Bring me clay.\"\n\n\"Yes!\"\n\nThe blacksmith sprinted to comply. Duke Grid's commands carried weight. Legendary blacksmith. Lord of Reidan. The man knew better than to hesitate.\n\n\"Abuuuu!\"\n\nLord's eyes tracked his father. Envy shone in that infant gaze. Grid handed over the clay, unaware of the determination crystallizing in his son's mind.\n\n*I need to learn how to speak. Soon.*\n\n\"You don't have to make anything useful right away.\" Grid kept his voice gentle. \"Hammer this to figure out the form.\"\n\n\"Bubu! Buuu!\"\n\nLord's protest came sharp and immediate. His pride wouldn't tolerate this.\n\n\"Bububu!\"\n\n*I'm not some toddler. I won't play with clay like a child.*\n\nGrid blinked at his son's vehemence. \"Do you have high pride like Irene?\" He clicked his tongue. Noble lineage bred noble arrogance.\n\nKhan approached, chuckling. \"Huhu, isn't it easy to teach the young lord?\"\n\n\"The child has my natural Dexterity.\" Grid gestured at the abandoned hammer. \"But as you can see, he's too young to refine minerals.\"\n\n\"It's natural. Genius doesn't mean everything.\" Khan's weathered face creased with amusement. \"The young lord won't be able to deal with fire and minerals until he's at least twelve years old. You have to teach him step by step.\"\n\n*Huff!*\n\nLord's eyes twitched. From the shadows, Kasim caught the reaction.\n\n*Lord is provoked.* The assassin had spent over two months as Lord's teacher. He understood the child's nature. Pride and commitment burned in equal measure within that small frame. Lord never retreated.\n\n\"Ba! Abubu!\"\n\nLord's clamor drew confused looks from Grid and Khan. They couldn't parse the meaning. Kasim understood perfectly.\n\n*Rather than twelve years, you'll become a blacksmith by age two?*\n\nWorry flickered across Kasim's features. *When will you practice Lantier's techniques, then?*\n\nLord's gaze found him. The infant's expression promised dedication. No disruption to the existing schedule.\n\n*Lord might actually do it.* Kasim didn't categorize Lord as merely gifted. The child transcended human limits entirely. His determination was no empty boast.\n\n\"What does he keep saying?\" Grid frowned.\n\nKhan smiled. \"Huhu, he is saying that he loves you.\"\n\n\"Haha, is that it, Lord?\" Grid's expression softened. \"I love you too.\"\n\n\"Ahh! Abuuuu!\"\n\nUnlike Kasim, Grid and Khan spent less time deciphering Lord's intent. They simply saw a cute child. From that day forward, Lord's special training began.\n\n***\n\nAlchemy divided into five broad categories.\n\nPotion production. Mineral enhancement. Enhancement stone creation. Special item crafting. Option addition.\n\nThe possibilities seemed limitless. Yet most kingdoms on the West Continent refused to fund alchemy facilities. The reason was simple.\n\nFailure rates rendered the discipline nearly worthless.\n\n> **[Reidan's Alchemy Facility]**\n>\n> Level: Intermediate 8\n>\n> * Superb quality health and mana recovery potions can be created.\n>   * Success rate: 36%\n>\n> * Advanced buff potions can be created.\n>   * Success rate: 14%\n>\n> * Lowest grade to low grade minerals can be upgraded.\n>   * Success rate: 14%\n>\n> * One option can be given to items.\n>   * Success rate: 1%\n\nGrid stared at the information window. One year. The Overgeared Guild had ruled Reidan for twelve months. They'd poured revenue from Raiden, Bairan, Cork Island, and individual member contributions into these facilities.\n\nThis was the result.\n\nHis expression went cold. \"I was expecting a lot from item options.\" The words came flat. \"What is this probability? Only 1%?\"\n\nRabbit stepped forward. \"As I said before, once the level reaches advanced, the probability will increase dramatically. But today I want to test—\"\n\n\"Dramatically?\" Grid's frown deepened. \"What percentage?\"\n\n\"Around 5%...\"\n\n\"What?\"\n\nThe value seemed absurd. Grid and his guild had invested a fortune for this? \"No wonder other kingdoms don't invest in alchemy facilities.\"\n\nHe'd been blinded by the goal. Making Reidan a second Talima had seemed worth any cost. Honestly, he didn't know anymore. It felt like a scam.\n\nRabbit's smile turned knowing. \"But Reidan has yellow mithril.\"\n\nYellow mithril. A mineral found only in the mines near Reidan. The raw material for fairy dust, which dramatically increased alchemy success rates. The foundation of Rabbit's entire development plan.\n\n\"I have prepared fairy dust.\" Rabbit gestured toward a workbench. \"Let my lord experience it.\"\n\n> **[Fairy Dust has been acquired.]**\n\n> **[Fairy Dust]**\n>\n> A powder made by refining yellow mithril at an alchemy facility.\n>\n> Increases the success rate of alchemy by 20%.\n>\n> Weight: 0.1\n\n*Twenty percent.*\n\nStill low. Grid wanted to turn back time, reclaim every coin invested in this facility.\n\nBut.\n\n*The probability did increase dramatically.*\n\nOther alchemists operated at single-digit success rates. Reidan could achieve at least 20%. Only Reidan, across the entire West Continent, could demonstrate alchemy's true value.\n\nThey'd entered territory other kingdoms couldn't even see. Grid forced himself toward optimism.\n\n\"Okay. I'll try it once.\" He crossed his arms. \"How valuable will an added option be?\"\n\n***\n\nSilverun was the best alchemist on the continent. He'd dedicated fifty years to the discipline. Fifty years of obscurity.\n\nAlchemy received no recognition. No funding. No environment to utilize his knowledge. He'd lived as an invisible man, acknowledged by no one. His talents remained dormant, waiting for an opportunity that never came.\n\nThen Rabbit arrived.\n\n\"Duke Grid of the Eternal Kingdom has heard rumors about you.\" The administrator's words had changed everything. \"He's personally sending you an invitation. Duke Grid doesn't doubt your alchemy skills. Why not spread your wings with his support?\"\n\nSilverun had lived in lonely poverty. Duke Grid became someone special. Someone worth serving. Silverun made a vow.\n\nFor Duke Grid's sake, he would show the value of alchemy to the world.\n\nGrid remained unaware of this devotion.\n\n\"I greet Duke Grid!\"\n\nReidan's alchemy facility hummed with activity. Silverun's greeting bordered on theatrical.\n\n*Who is this person?*\n\nRabbit leaned close. \"I picked him up for my lord.\"\n\nGrid felt the familiar sensation. Lauel. Rabbit. Smart subordinates made life convenient. He'd acquired another loyal follower without trying.\n\nHe extended his hand. \"Get up.\"\n\n\"Ohh! Ohh!\"\n\nSilverun trembled. The great duke acknowledged alchemy. Acknowledged him. He grasped Grid's hand with shaking fingers. \"It is so inspiring that the duke himself will visit here. I'm in tears.\"\n\nThe intensity was uncomfortable. Grid turned away from the tearful alchemist, surveying the facility instead.\n\n\"I want to give this sword a new option.\"\n\nHe drew <span class=\"rarity-unique\">Iyarugt</span>. The growth-type blade. An ego sword housing a demon's soul. Would alchemy even affect such a unique item?\n\nSilverun's response came confident. \"It's possible for me.\"\n\nHe possessed the best ability in this field. Doubt had no place in his mind.\n\n\"But you should know.\" Silverun's enthusiasm didn't dim his honesty. \"The level of options from intermediate alchemy ranges from F-grade minimum to A-grade maximum. And as you know, alchemy always carries failure risk.\"\n\n\"If it fails, will the item's inherent performance decrease?\" Grid's grip tightened on the hilt.\n\n\"No such thing.\"\n\n\"Let's try it.\"\n\n\"I will guide you.\"\n\nSilverun's chance to repay his benefactor had arrived. Enthusiasm filled him as he led Grid deeper into the facility. They entered a room crowded with equipment.\n\nSilverun placed <span class=\"rarity-unique\">Iyarugt</span> on a central altar. \"Then I will start.\"\n\n*Peeeeeong!*\n\nIntense blue light flooded the chamber. Within that radiance, a notification window materialized.\n\n> **[You are attempting to grant a new option to Iyarugt.]**\n\n> **[Congratulations! A new option has successfully been granted.]**\n\n*Ttiring~*\n\nGrid's face went blank as he read the result. \"What?\""
}