{
  "id": 379,
  "title": "Chapter 379",
  "content": "# Chapter 379\n\n> [You are attempting to grant a new option to Iyarugt.]\n\n> [Congratulations! A new option has successfully been granted.]\n\nGrid's pulse quickened as the notification materialized before his eyes.\n\n*It succeeded at once!*\n\nLuck had never been his ally. He'd lost every coin flip, every dice roll, every stupid lottery that crossed his path. If there was a 99% chance of success, he'd be the unlucky bastard in the 1% failure bracket. And now, somehow, he'd won a game with only a 21% success rate.\n\nThe thrill lasted exactly three seconds.\n\n> [The B-grade option 'Coolness' has been granted to Iyarugt.]\n\n\"What?\"\n\n> [Iyarugt has become even cooler.]\n\n*Ttiring~*\n\n> [+8 Iyarugt]\n>\n> Rating: Unique (Growth)\n>\n> Durability: 351/351    Attack Power: 793 + 365\n>\n> ...\n>\n> * The 'Coolness' option has been added with alchemy.\n\nGrid stared at the window.\n\n*What? Coolness?*\n\nHis mind spun. Out of every possible enhancement, every stat boost, every combat modifier in the alchemy table, the system gave him *coolness*? Of course things couldn't go smoothly. Not for him. Not ever.\n\n\"Unbelievable.\" Grid pressed his palm against his forehead. \"I can't believe this.\"\n\nSilverun's voice cut through his frustration like a bell.\n\n\"Ohh! The best B-grade option! 'Coolness' is beyond expectations!\"\n\nGrid's head snapped up. \"...?\"\n\n*Coolness is the best option?* He must have misheard.\n\n*If that's the best B-grade option, how terrible are the others?*\n\nThe more he learned about alchemy, the more he regretted every gold coin he'd dumped into it. His head throbbed. Rabbit, sensing the mood, offered a measured counterpoint.\n\n\"Coolness matters more than you think.\" The administrator's tone was calm, practical. \"Whether we're talking about people or objects, appearance builds favor. A good first impression opens doors.\"\n\nGrid's frown deepened, but he couldn't argue. Even in reality, people obsessed over appearances. Haircuts, designer clothes, plastic surgery costing hundreds of millions of won. All to increase perceived value. Humans were visual creatures. First impressions were rooted in aesthetics.\n\n*I guess that makes sense.*\n\nHe'd heard rumors about the <span class=\"rarity-unique\">Skin Maker</span> hidden class. That user made a fortune doing nothing but changing how items looked. No stat boosts. No hidden effects. Just pure cosmetics. And people paid through the nose for it.\n\nGrid examined Iyarugt with fresh eyes. A soft, crimson glow radiated from the blade's edge, smooth and hypnotic. It did look sharper. Sleeker. More refined than before.\n\n*Buuong. Buoong.*\n\nEach swing sent ripples of refracted light across the blade's surface, jewel-like and precise. When Grid wielded it, he looked... different. Better. Eyes would track this weapon during the National Competition. Cameras would linger on every stroke.\n\nBut still.\n\nIt wasn't enough.\n\n***\n\n\"Until the alchemy facility reaches advanced level, we'll stockpile fairy dust without using it.\"\n\n\"...Yeah.\" Grid's voice was flat.\n\nThe disappointment clung to him like smoke. Rabbit bowed, expression somewhere between apologetic and uncomfortable.\n\n\"Then I'll return to my duties.\"\n\n\"Right. Work hard.\"\n\nGrid watched the administrator leave, then turned toward the smithy. He needed weapons. Something to leverage Spear Shot. Something to activate Bow Mastery before he departed for the Behen Archipelago.\n\n*I'll make the same bow I crafted for Jishuka.* Simple. Efficient. Proven.\n\nFor the spear, he'd design something specifically weighted for throwing. Grid's mind began sketching blueprints in the air as he walked.\n\n***\n\n\"Create hand plow.\"\n\n> [The hand plow has been developed.]\n\n*Paaaat!*\n\nFifty hand plows erupted from the earth simultaneously across the newly opened fields near the Altes Mountains. These weren't ordinary farming tools. Each one shimmered with compressed aura, glowing faintly blue.\n\n*Pa pa pa pa pak!*\n\nThe aura plows tore into the soil in perfect synchronization. The ground churned. Dirt flew in coordinated arcs. It was the output of a hundred farmers condensed into a single man's technique.\n\nThis was the power of an Aura Master.\n\nHurent wiped sweat from his brow, watching the fields transform. He was supposed to hate this. Supposed to be focused on revenge against Grid, the man who'd humiliated him in five seconds flat during their last PvP encounter.\n\n*In the next 40 days.*\n\nThe 2nd National Competition loomed. As a representative of the United States, Hurent would face Grid again. This time, he'd win. This time, things would be different.\n\nBut there was a problem.\n\n\"My eyes don't deceive me.\" Piaro's voice cut through the rhythmic thudding of the plows. The farmer stood with arms crossed, silhouette dark against the sun. \"Your skills suit field work perfectly. Will you stay a little longer?\"\n\nLegendary Farmer Piaro. The man who'd essentially kidnapped Hurent and forced him into agricultural servitude. And yet, Hurent understood the value of hidden quests. His resentment melted like snow under summer heat.\n\nHurent cleared his throat. \"How much longer?\"\n\n\"Three months?\"\n\n\"Three months?!\" The words came out louder than intended.\n\nToo long. The National Competition was in 40 days. He had preparations. Training. Equipment upgrades.\n\n\"Can't it be one month?\"\n\nPiaro shook his head slowly, deliberately. \"If you're only staying a month, leave now. I intend to teach you a new skill suitable for farming. It cannot be mastered in one month.\"\n\nSilence.\n\nHurent stood at a crossroads. Leave Piaro immediately and chase revenge with his current strength, or stay here, grow stronger under the legendary farmer's tutelage, and *then* settle the score?\n\n\"Ummm...\"\n\nHe forced himself to think objectively. Could he beat Grid right now? In his current state?\n\n*Honestly? No guarantee.*\n\nThree months ago in Satisfy time, when he'd invaded Reidan with Prince Ren, he'd been certain of victory. That certainty was gone now. Piaro's words echoed in his memory.\n\n\"You're strong. But many are stronger. How do you compare to My Lord? Of course, My Lord is stronger than you.\"\n\nAt first, Hurent assumed it was bias. Loyalty warping Piaro's judgment. But after weeks of working alongside the man, he'd learned one critical truth: Piaro didn't speak empty words.\n\n*If I can't beat Grid now...*\n\nHe'd be humiliated again. Broadcasted to the entire world. Turned into another meme, another highlight reel of failure.\n\nIf that was the case...\n\n\"I'll help you.\" The words tasted bitter, but right.\n\nOpportunities would come. If not this year's National Competition, then next year's. Or the year after. He'd use that time to evolve <span class=\"rarity-rare\">Aura Master</span> into something legendary.\n\nPiaro's weathered face split into a grin. \"Good choice.\"\n\nFrom that day forward, Reidan's agricultural output accelerated at an unprecedented rate. Hurent adapted to farm life with surprising ease. He worked so diligently, threw himself so completely into the rhythm of planting and harvesting, that his vendetta against Grid gradually faded into background noise.\n\nRevenge could wait. The fields needed tending.\n\n***\n\nSeven figures occupied the war room.\n\nZibal of the Snake Guild. Chris of the Giant Guild. Seuron of the Golden Guild. Hao of the Hades Guild. Bondre of the Ice Flower Guild. Bubat of the Yak Guild. Ralph of the Zeraph Guild.\n\nThe leaders of the seven guilds. All ranked within the top 30 of the unified rankings. All confirmed participants of the 2nd National Competition.\n\nZibal leaned forward, knuckles pressed against the table. \"It's been nine months since we united to invade Reidan.\"\n\nNine months since their disgrace.\n\nOnce, the seven guilds had been objects of fear. Now they were punchlines. Jokes. The Overgeared Guild had eclipsed them completely, claiming the throne they'd once occupied.\n\n\"We must reclaim our honor in the National Competition.\"\n\nSeuron's brow furrowed. Doubt laced his tone. \"By smashing Overgeared? How, exactly?\"\n\nThe National Competition wasn't a guild war. Countries competed against countries. The Overgeared members were scattered across multiple nationalities. Targeting them specifically would be nearly impossible.\n\nZibal's smile didn't reach his eyes. \"Grid is the symbol of Overgeared. And Grid is Korean.\"\n\nHe paused, letting the implication settle.\n\n\"We thoroughly shatter South Korea.\"\n\nSymbols carried weight beyond their physical forms. If they trampled the Korean team, crushed them publicly and completely, it would prove the seven guilds still had teeth. It would drag Overgeared's reputation through the mud by proxy.\n\n\"The Overgeared Guild is no longer untouchable.\"\n\nZibal's confidence wasn't baseless. His inventory contained items crafted by Panmir, the 1st ranked blacksmith, using dwarf techniques. Performance-wise, they rivaled Grid's work.\n\n\"Let's combine our strength. Crush South Korea. Reclaim what we've lost.\"\n\nThe difference between being the best and being forgotten was measured in zeros on a bank statement. When the seven guilds ruled, these masters had earned fortunes. Prestige attracted wealth. Of course they missed those days.\n\nChris, silent until now, fixed Zibal with a flat stare. \"Since when are you our representative?\"\n\nThe seven guilds had never been unified. Not truly.\n\nThey checked each other. Clashed. Allied when convenient. Competed ruthlessly. At some point, Zibal had declared himself the architect of their alliance and taken the lead.\n\nChris hadn't agreed to that.\n\nZibal's laugh was quick, nervous. \"Representative? Me? I never thought of myself like that.\" He spread his hands, conciliatory. \"I see all of you as equals. Companions.\"\n\nThe guild masters were proud. Chris's comment could ignite tempers. Zibal needed to defuse the tension before the alliance fractured.\n\nChris scoffed. \"Who's your companion?\"\n\nHe rose from his chair. The movement was final.\n\n\"I never joined the seven guilds alliance. I didn't participate in the Reidan invasion.\" His voice cut through the room like a blade. \"Don't use the name 'Seven Guilds Alliance' in the future. The Giant Guild was never part of it.\"\n\nChris turned toward the door. The other guild masters exchanged glances but said nothing. Forcing Chris into the alliance would create more problems than it solved.\n\nBut Zibal thought differently.\n\nHe saw a variable that needed controlling. A wildcard better broken than left loose.\n\nZibal stepped into Chris's path. His smile sharpened.\n\n\"So the rumor about you joining Grid is true.\"\n\n\"Chris and Grid?\"\n\nThe previously silent guild masters stirred. Interest flickered across their faces.\n\nChris's frown deepened. \"I'm with Grid? What are you talking about?\"\n\n\"One of my men spotted you at a hunting ground.\" Zibal's tone was casual, venomous. \"The weapon you used looked exactly like one of Grid's creations.\"\n\nThe atmosphere in the room plummeted."
}