{
  "id": 38,
  "title": "Chapter 38",
  "content": "# Chapter 38\n\nWinston's Central Square sprawled before Grid, already thick with bodies. Today, the crowd had swelled even further—a sea of faces pressing toward the makeshift stage where two furnaces stood waiting.\n\nA cluster of residents huddled near the front, their weathered hands clasped together. \"I hope Grid can win and protect Khan's smithy,\" an older woman murmured to her neighbor. \"That smithy is the last pride we have left.\"\n\nThe man beside her nodded grimly. \"If it falls into the Mero Company's hands, our place in Winston disappears completely.\"\n\n\"Grid!\" someone shouted from the back. \"You can't lose!\"\n\nThe residents' prayers hung in the air like smoke. The users scattered throughout the square, however, wore expressions of mild curiosity at best.\n\nA warrior lounged against a fountain. \"An item production game?\" He yawned. \"Nothing else interesting today. Might as well watch for a bit.\"\n\nHis companion shrugged. \"If it's boring, we leave. Simple.\"\n\nMost users treated the event like background noise—something to kill time before the next dungeon run.\n\nTwo mages walked past, shaking their heads. \"It's funny when you think about it,\" one said. \"Blacksmiths making items. Why would anyone watch?\"\n\n\"Tedious as hell,\" the other agreed. \"Not like they'll craft anything better than Epic. I'm not even interested in the result.\"\n\n\"Epic?\" The first mage laughed. \"Rare would be impressive. I heard no famous blacksmiths are even participating.\"\n\n\"Then what's the point?\" His friend gestured dismissively. \"Why should we care who owns some random smithy? Let's go hunt instead.\"\n\nSeveral users peeled away from the square, their voices fading into the city's background hum.\n\nThen the host stepped onto the stage.\n\n\"Now!\" The administrator's voice boomed across the square. \"Let me introduce the main characters of this match. From the Mero Company—Erina! And Khan's successor—Grid!\"\n\n\"OHHHHHHH!\"\n\nA blonde girl climbed onto the stage. She wore a wide-brimmed hat pulled low, but it did nothing to hide the delicate curve of her jaw, the soft pink of her lips. Male users who had been edging toward the exits froze mid-step.\n\n\"Wow.\" Someone's weapon clattered to the cobblestones. \"She's... really pretty.\"\n\n\"Is this love at first sight?\"\n\n\"My ideal type...\"\n\nThe girl—Euphemina, though the crowd knew her as Erina—surveyed the sudden attention with amusement. She raised one hand in a graceful wave.\n\n\"Thank you for your support.\"\n\n\"OHHHHHHH!\"\n\nShe smiled. Just smiled. The effect was devastating. Male users stumbled over themselves, forming an instant fan club that rivaled the fervor of soldiers greeting a pop idol.\n\n\"Erina, fight!\"\n\n\"Erina, please win!\"\n\n\"Erina! Erina! Erina!\"\n\nGrid watched the spectacle unfold from the stage's opposite side. He sucked in a deep breath, squaring his shoulders. *Is it my turn next?*\n\nSimple logic dictated the outcome. Male users supported the female contestant. Therefore, female users would support him. Grid turned toward the women in the crowd and waved, letting what he imagined was a charming smile spread across his face.\n\nThe nearest female user recoiled. \"What is that guy doing?\" She grimaced. \"Ugh, I feel sick.\"\n\nHer friend covered her mouth. \"The bread I ate earlier... it's coming back up...\"\n\n\"He looks horrible...\"\n\nGrid's arm dropped to his side. *This dirty society that only cares about looks!* His jaw clenched. *You'd support me properly if I was handsome.*\n\nThe residents of Winston rallied, their voices cutting through his frustration. \"Grid! You have us!\" an old blacksmith called out. \"We're cheering for you. We believe in you! Be sure to win.\"\n\n\"Khan's successor, show off your skills!\"\n\n\"Grid's victory! Grid's victory! Grid's victory!\"\n\nThe chant built like a wave. Grid's chest swelled—then deflated as he followed their gazes. Every male resident, young and old, had their eyes locked on the blonde girl. Even Khan stood mesmerized, his jaw slightly slack.\n\n*If you're supporting me, why are your eyes glued to her?*\n\nGrid's hands balled into fists. *These bastards. I see your true nature now.*\n\nA blonde girl so seductive she'd charmed elderly NPCs. Standing next to her, Grid felt like a piece of dried squid—shriveled and unappealing.\n\nHe jabbed a finger in her direction. \"You. I'm going to win. Then I'll enjoy watching that pretty face twist in defeat!\"\n\nEuphemina's eyebrows rose. Genuine surprise flickered across her features. Every man she'd ever met had fallen over himself to please her. Yet this... this *specimen* in the skull helmet declared war like her appearance meant nothing.\n\n*Unless he's gay or blind, shouldn't all men worship my beauty?*\n\nPride straightened her spine. *Taste my beauty properly.*\n\nShe lifted the brim of her hat. The full force of her face—delicate features, luminous skin, eyes like cut sapphires—struck the crowd like a hammer blow.\n\nGrid's breath caught. *Looking at her like this... she really is pretty.* He squinted, analyzing. *Comparable to that wicked witch, Yura.*\n\nThe comparison took shape in his mind. Yura carried herself with elegant maturity, while this girl radiated youthful freshness. Different atmospheres, but both possessed transcendent beauty.\n\n*Is she human or a doll?*\n\nHis expression slackened. His eyes glazed. He forgot to close his mouth.\n\nEuphemina cataloged his reaction with satisfaction. *Yes, that's right.* A smirk tugged at her lips. *Once you see my face, you fall immediately. Now you'll follow me like a dog, just like all the others.*\n\nNo man in the world could resist her beauty. She knew this like she knew the sun rose in the east. Time to seal the victory.\n\n\"Grid?\" Her voice dropped to a honeyed purr. She tilted her head, half-moon eyes glittering. \"There's no need for hostility. We just met, haven't we? Perhaps we'll see each other again. In the future, we might develop a good relationship. So don't be upset. Let's get along.\"\n\nThe flirtation dripped from every syllable. Men in the front row swayed on their feet.\n\nGrid snorted. \"What? Develop a good relationship?\" He waved dismissively. \"Don't say such horrible things, kid.\"\n\nEuphemina's face flushed crimson. \"H-Horrible?\" Her voice cracked. \"Why wouldn't you want a good relationship with me?\" She took a step forward. \"And... *kid*?\"\n\n\"Yes!\" Grid crossed his arms. \"I don't want anything to do with a fox like you. Kid. Have you even graduated from high school? I have no interest in a little person like you. I'm not a lolicon.\" He jabbed his finger again. \"Do you think I'm such a slimy bastard? This is some tactic to break my concentration, but I won't fall for it.\"\n\nHis voice rang with absolute conviction. Grid had standards. Height: minimum 168cm. Chest: D cup, negotiable but preferred. Euphemina was undeniably pretty, but her 160cm frame and B-cup chest placed her firmly outside his ideal specifications.\n\nNo amount of facial beauty could bridge that gap.\n\n*Kid?* Euphemina stood frozen. *Fox?* The words echoed in her skull. *What is with this person?*\n\nThen rage ignited, burning through her shock. Shame—foreign, uncomfortable, *wrong*—coiled in her stomach. Her hands trembled.\n\n*More than anything else, I'm twenty years old!*\n\nShe wasn't some young girl. Her youthful appearance had always been a blessing, but hearing \"kid\" stabbed directly into her complex about her height.\n\n*I will disgrace you in front of all these people.*\n\nHer smile turned glacial. She glanced at Grid through lowered lashes. \"Since you don't realize my charm, are you gay?\" The words came out sweet as poisoned honey. \"Okay. I'll make you regret Mother Nature making you that way. Let's see who makes the better item.\" She stepped closer. \"I'm going to win.\"\n\n\"W-What?\" Grid's arms flailed. \"Gay? *I'm* gay? What the hell are you saying, you unlucky brat! I'm not gay!\"\n\n*Unlucky?* The word hit Euphemina like a slap. She staggered back half a step. Never—*never*—had a man called her unlucky. The ground tilted beneath her feet.\n\n\"U-Unlucky? *Me*?\" Her voice rose to a shriek. \"A trash-like man could never match me!\"\n\nGrid had insulted her first. From her perspective, he was clearly insane. The shame pressed against her chest until tears pricked her eyes. \"I want to say goodbye to you as quickly as possible!\" She whirled toward the furnaces. \"Start the game now!\"\n\n\"Fine!\" Grid was already moving, grabbing iron ore. \"Let's get started. I don't care about your one-sided cheering. I'll make you fail today!\"\n\nThe host hadn't announced anything, but Grid shoved ore into his furnace's open maw. Euphemina—who had crafted items before, who knew the rhythm of production—matched his pace, her own ore disappearing into flames.\n\n*Hwaruruk!*\n\nHeat erupted from both furnaces. The temperature spiked, waves of hot air rippling across the stage. Rage poured from the two competitors like a physical force.\n\nThe host scrambled to catch up with the chaos. \"The two contestants have started!\" He cleared his throat. \"I'll notify the crowd! The theme for this match is to craft a dagger. Whoever produces the higher quality dagger within the time limit wins!\"\n\nDaggers required less time than larger weapons. A skilled blacksmith could complete a quality dagger in two hours. The match allowed three hours—generous, but not wasteful.\n\n\"Erina, fight!\"\n\nMore users flooded into the square, drawn by the commotion. Euphemina's fan club metastasized like aggressive cancer, their roars drowning out the residents' support. Grid's cheering section vanished beneath the wave of male voices.\n\nHe stood alone behind enemy lines, sweat already beading on his forehead, hammer in hand."
}