{
  "id": 380,
  "title": "Chapter 380",
  "content": "# Chapter 380\n\n\"One of my men came across you in a hunting ground. The weapon you used at that time looks exactly like one of Grid's weapons.\"\n\nGrid's Greatsword. The temperature in the room seemed to drop. Chris shifted his weight.\n\n\"I will say it again. In this world, aren't there one or two items that resemble each other?\"\n\nChris turned toward the door, following his plan to leave. Zibal's hand clamped down on his shoulder.\n\n\"This isn't like you, Chris. Originally, wouldn't you be angry when receiving an unfair accusation like this? Are you just laughing because what I said was the truth?\"\n\n\"I've only ever responded in a gentlemanly manner.\"\n\nChris grabbed Zibal's wrist and shoved hard. The other man stumbled back a step. Years of physical labor had built Chris's strength to the point where Zibal couldn't match it.\n\n\"Don't push people with unfounded rumors.\"\n\nChris met Zibal's eyes without flinching. Even knowing that no one in this room stood with him, he held his ground. The dignity of the third ranked user. But Zibal was different. That crazy farmer had killed him in one blow, true, but his strength and influence among the users remained absolute. No matter how high Chris' charisma climbed, it had no effect on the man before him.\n\n\"If you're so confident, why don't you share the details of your weapon with us?\"\n\nZibal's smile was bright. Predatory.\n\n*He has nothing to lose.* The realization tightened Chris's jaw. If the weapon information connected to Grid, Zibal would be vindicated. If not, a simple apology would suffice.\n\nChris hesitated, then chose his words carefully.\n\n\"Please don't go overboard, Zibal. Who would reveal the information of their item?\"\n\nItems could be a person's strength or weakness. Always a variable. Disclosing a weapon's information meant exposing vulnerabilities. The masters of the seven guilds knew this better than anyone.\n\nThey shifted, trying to rein in Zibal.\n\n\"Zibal, please act moderately. Don't make trouble when you are already struggling with Overgeared and the Blood Carnival.\"\n\n\"Yes, why are you suddenly doing this to Chris?\"\n\nThe tide started to turn. Relief flickered across Chris's face.\n\n\"Do you use the same weapon as Grid?\"\n\nSeuron, master of the Golden Guild, rose from his seat. His combat-specialized unique class, Soul Predator, had been defeated by that crazy farmer during the Reidan invasion. But back then, Seuron hadn't fully adapted to his class.\n\nNow was different. Now he could fight both the temporary and full-time farmers.\n\n\"I don't want to obediently send away a person who might be the enemy of our alliance.\"\n\nSeuron raised his <span class=\"rarity-epic\">Brutal Heavy Sword</span>. After losing to the temporary farmer, he'd invested over 10 million gold to enhance it to +9. His finances had taken a beating, but the gap between +8 and +9 was worth every coin.\n\n\"Hey, Chris. Take out your weapon.\"\n\nSeuron's goal had always been number one. Aggressive by nature, he wouldn't pass up a chance to eliminate a competitor.\n\n\"You don't intend to bring it out obediently? Then I will make you take it out.\"\n\nFour spears materialized in the air flanking Seuron. The manifestation of Soul Spears. Each required a human or monster soul to summon. Seuron had accumulated the maximum through continuous hunting. He was at peak condition.\n\nThe spears launched forward, streaks of pale light cutting through the air. Too fast. Chris had invested most of his points in strength, not agility.\n\nTwo spears punched through his torso. Pain exploded across his ribs. Seuron closed the distance, <span class=\"rarity-epic\">Brutal Heavy Sword</span> raised, Soul Shackles manifesting around Chris's legs. The choice crystallized in Chris's mind.\n\n*Do I take out Grid's Greatsword, or use a secondary weapon?*\n\n*I can't deepen their suspicions.*\n\nHis guild would suffer if he turned these people into enemies. Chris reached for his backup weapon.\n\nSteel sang against steel.\n\n\"Hoh.\"\n\nSeuron's eyes widened. Chris had struck away the Soul Shackles and blocked his sword in one motion. The instant his weapon cleared the sheath.\n\n*His control is greater than the rumors suggested.*\n\nSlow, efficient movements. Maximum effect with minimal effort. Chris's greatsword technique was brilliant.\n\n\"But.\"\n\nHe wasn't Seuron's opponent.\n\nThe blade engaged with Chris's greatsword pulsed with violet light. Soul Transference. The reinforcement hit like a hammer.\n\nChris grunted, his strength suddenly meaningless. The enhanced attack power drove him back. One step. Two.\n\n*This game is truly about items.*\n\nThe realization cut deeper than Seuron's blade.\n\nSoul Arrows materialized above Chris's head. His eyes tracked their trajectories.\n\n*A combo. If these connect, I'll be stiffened.*\n\nTop rankers knew how to exploit stiffness. Chris braced for the onslaught.\n\nA chain whipped through the air, shattering the arrows before they struck. Hao stepped between them.\n\n\"Seuron, don't just do whatever you like.\"\n\nThe world had plenty of battle-hungry fools. Seuron wasn't unusual. But there were lines. Hao didn't understand why Zibal and Seuron wanted to make an enemy of someone like Chris.\n\n\"Hey Hao. Isn't Chris suspicious? Look at the weapon he brought out. It's complete rubbish! Do you think that is his real weapon? He's hiding it!\"\n\n\"Let's say Chris's weapon and Grid's weapon are the same. Is that solid proof that the two are colluding?\"\n\nSilence.\n\nHao's logic cut through the tension. Bubat shook his hand toward the two combatants.\n\n\"Let them play. It isn't bad to experience each other's ability ahead of the National Competition. Beneficial, even.\"\n\nSeuron's lips curled. He'd already concluded Chris was beneath him. Everyone in this room thought so. The fight had been brief, but Seuron had completely overwhelmed him.\n\nChris stepped back toward the door.\n\n\"I'm going if there isn't anything else.\"\n\n\"To think he is 3rd in the rankings. How pathetic.\"\n\nSeuron's laughter followed Chris out. No one in that room could imagine the truth. Chris had hidden his skills.\n\n*There will be many opportunities in the future.*\n\nThe best stage was only forty days away. Fighting spirit burned in Chris's eyes.\n\n***\n\nWeapons Mastery.\n\nThe ultimate mastery skill that gave extra damage no matter what weapon was equipped. But it wasn't a miracle. The bonus from Weapons Mastery ran lower than mastery skills optimized for a single weapon type.\n\nGrid was obsessed with raising Bow Mastery for this reason. If Weapons Mastery added 10% additional damage and Bow Mastery added 11%, the system would apply Bow Mastery when he used a bow. Not Weapons Mastery.\n\nEven if he learned Weapons Mastery later, Bow Mastery would remain useful.\n\n*If I can give items an option that quickly increases mastery skill experience...*\n\nHow good would that be? He wouldn't rely on the alchemy facility. Random options, low success rates. Unreliable.\n\n\"Khan.\"\n\nGrid sought out Khan's advice. The man was an advanced level 8 blacksmith. Beyond his technical excellence, decades of accumulated experience made him knowledgeable.\n\n\"Have you ever heard of an item that can quickly increase the experience of mastery skills?\"\n\nKhan's brow furrowed. His family had been blacksmiths for generations. Among his ancestors was Albatino, who'd inspired the legendary blacksmith Pagma. Khan sifted through decades of knowledge.\n\nFinally, he shook his head.\n\n\"I'm sorry. I don't know.\"\n\nGrid had always helped Khan. He wanted to repay that kindness. But now, when Grid needed him, he had nothing to offer. Khan's shoulders sagged. Then a thought struck him.\n\n\"Perhaps you should ask Piaro.\"\n\n\"Piaro?\"\n\n\"Yes. Shouldn't he know how to train in weapons more efficiently? If you listen to him, you might gain an idea about how to add it to an item.\"\n\nMaximum favorability paid dividends. Khan freely gave Grid advice. Enlightenment sparked in Grid's mind. He pulled Khan into a hug.\n\n\"Thank you!\"\n\n\"Haha! I'm happy to help!\"\n\nThe blacksmiths of Reidan barely glanced at the embrace. They'd seen it countless times. They looked away, not wanting to intrude on the relationship between Grid and Khan.\n\nLord stood in the corner, hammer frozen mid-swing.\n\n\"Abubu...?\"\n\nHe'd been working on his project, happy to hear his father's voice. But now question marks seemed to float above his head. His father was hugging someone who wasn't his mother. Lord couldn't understand.\n\nKasim emerged from the shadows, whispering to the boy.\n\n\"This is the friendship between men.\"\n\n\"Woo...\"\n\nLord liked the sound of that word. *Friendship.* He made a vow in his small heart. Someday, he would find wonderful friends of his own.\n\nLater, Lord would have the strongest colleagues."
}