{
  "id": 381,
  "title": "Chapter 381",
  "content": "# Chapter 381\n\nPiaro had lost everything once before.\n\nConspiracies. Betrayal. The destruction of all he'd built. He'd clawed his way back from that abyss for one reason: Grid. When sickness had consumed his heart, Grid pulled him forward. When misunderstanding threatened to destroy him, Grid reunited him with Asmophel.\n\nGrid wasn't just a lord. He was Piaro's lifelong benefactor.\n\nWhich raised an uncomfortable question: Why was Piaro training Grid's enemies?\n\nChris. Hurent. Both had stood against Grid. Training them felt like a betrayal, an insult his lord didn't deserve. Others might call it treachery.\n\nBut Piaro felt no guilt.\n\nHe'd learned to read people through bitter experience. Betrayal taught lessons that success never could. The Piaro who stood in these fields could see past facades into the truth beneath.\n\n*The boy's eyes don't lie. Every time I watch him, I see nothing but sincerity and drive.*\n\nIn the fields near the Altes Mountains, Piaro observed Hurent's progress. The young man attacked the soil with focused intensity, sweat streaming down his face despite the early hour.\n\nPiaro's weathered face creased into a satisfied smile.\n\nHurent burned with vengeance, yes. But it was the fire of wounded passion, not malice. The difference mattered. With proper guidance, that flame could forge something pure. Something worthy. Piaro could shape this raw intensity into a blade that would serve at Grid's right hand.\n\n*And his aura...* Piaro leaned against his hoe, studying the faint shimmer around Hurent's hands. *I never imagined such possibilities.*\n\nMost aura users focused purely on destructive force. Hurent's gift ran deeper. He could reshape his aura, mold it, adapt it to any situation. On the battlefield, such versatility would make him devastating. In the fields, he could multiply his efficiency tenfold.\n\n*I'll keep feeding him opportunities.* Piaro straightened, gripping his farming tool. *Everything for my lord.*\n\nHe meant every word.\n\n***\n\nThe journey from Reidan to the Altes Mountain fields normally required a full day.\n\nGrid made it in less than half.\n\nThe **movement speed buff** from **Braham's Boots** and **Quick Movements** from his **Ideal Dagger** transformed him into a blur across the desert sands. When he finally stopped to catch his breath, the transformation before him stole what little remained.\n\n\"A forest... in the middle of the desert.\"\n\nThe fields near Reidan remained relatively barren. But here, near the mountains, Piaro had achieved something miraculous. Half the cleared land had been converted to orchards. Young trees stood in neat rows, their branches still bare of fruit but thick with promise. In a few seasons, this would be a lush canopy providing shade and sustenance where only sand had existed before.\n\nGrid shook his head in wonder.\n\n\"Even for a legendary farmer, turning desert into forest...\"\n\nAccording to Administrator Rabbit's reports, Piaro commanded fewer than 500 workers. Yet with that modest force, he'd secured the human resources necessary to develop Reidan's agriculture from nothing. The man's efficiency bordered on supernatural.\n\nThen Grid's admiration curdled into horror.\n\n\"What the...\"\n\nTwo hundred young girls worked beneath the brutal sun. Most looked to be in their early teens. Their once-fair skin had darkened to deep bronze, and when Grid squinted, he could see calluses covering their small hands. This wasn't recent labor. These children had been working like this for weeks. Months, perhaps.\n\nRage built in Grid's chest.\n\n\"Making little girls into field serfs...\" He clenched his fists. \"I don't care how obsessed you are with farming, Piaro. This crosses a line.\"\n\nThe old Grid wouldn't have cared. Other people's misfortunes meant nothing to someone drowning in debt and desperation. But fatherhood had changed him. He had Lord now. A son who would grow up in this world. And Grid refused to build that world on the broken backs of children.\n\nHe started toward the fields.\n\nThe moment his boot touched tilled soil, everything changed.\n\n*Flash!*\n\nTwo hundred pairs of eyes snapped toward him in perfect unison. Farming tools vanished. In their place appeared swords, spears, and shields that definitely hadn't been there a moment before.\n\nGrid froze mid-step.\n\n*Wait. These aren't serfs at all.*\n\nLauel's last report surfaced in his memory. The **Rebecca's Daughters candidates**. Piaro had taken responsibility for their training. And for Piaro, all training began and ended in the fields.\n\nRelief washed over him. *Thank god. They're warrior trainees, not enslaved children.*\n\nThen the girls started talking.\n\n\"This is Reidan.\" A blonde girl leveled her spear at his chest. \"Territory of Duke Grid.\"\n\n\"Goddess Rebecca permits no invasion.\" A shield-bearer moved to flank him.\n\n\"We follow Piaro's teachings.\" More weapons tracked his movement. \"All intruders will be repelled.\"\n\nGrid blinked. \"Wait, I'm not—\"\n\nTwo hundred warriors charged.\n\n*Buuong.*\n\n*Syuk!*\n\n*Peeng!*\n\nSwords whistled through the air with textbook precision. Spears thrust at his vitals from impossible angles. Shields formed a moving wall that cut off his retreat. Grid barely dodged the opening salvo, his body moving on pure instinct.\n\nA smile crept across his face despite the danger.\n\n*Incredible.*\n\nThe **Rebecca's Daughters** represented the church's ultimate fighting force. But he'd always assumed their reputation came from divine blessings and sacred artifacts. He'd never imagined the candidates themselves possessed such raw skill. Every movement flowed with practiced efficiency. Their coordination suggested months of training together.\n\nThese weren't normal NPCs. Each girl had to be a named character with unique stats and growth potential.\n\n\"Your strength is impressive!\" Grid called out, deflecting a sword strike.\n\n\"But you won't advance another step!\" The speaker, a red-haired girl with fierce green eyes, redoubled her assault.\n\nTheir attacks meant nothing against his defenses. But their courage impressed him even more than their skill. They'd recognized him as an overwhelmingly stronger opponent within seconds. Lesser warriors would have fled. These girls pressed harder.\n\nGrid's heart swelled with pride.\n\n*Not for me. For them. For Reidan. For Overgeared.*\n\nHis farmers grew stronger with Piaro's guidance. His soldiers drilled under Asmophel's unforgiving eye. His alchemists experimented in state-of-the-art facilities. His territory expanded in power and prosperity every single day.\n\nAnd he hadn't done it alone. Every achievement represented the combined effort of dozens, hundreds of people working toward a shared dream.\n\n\"Let me help with your training.\" Grid drew **Iyarugt**. The demon sword's emergence transformed the battlefield.\n\nTwo hundred pairs of eyes went wide.\n\n*Beautiful!*\n\nThe **B-grade alchemy effect** called **Coolness** made the blade shimmer like captured starlight. Every movement sent cascades of prismatic light across the field. It didn't bewitch the mind like some enchantments, but it burned Grid's image into their memories with perfect clarity.\n\n\"**Pagma's Swordsmanship, Restraint.**\"\n\nGrid began his sword dance.\n\nLight bloomed around him like falling cherry blossoms. The **+600 Dignity** and **+800 Charm** from his **First Duke** title amplified the effect beyond reason. To young, impressionable girls experiencing their first real battle, he must have looked like a war god descended from the heavens.\n\nFootsteps approached from the orchard.\n\nPiaro emerged from between the trees, took one look at the scene, and clicked his tongue.\n\n\"Duke Grid.\" The farmer's voice dripped with disapproval. \"Seducing young girls with flashy swordplay...\"\n\n\"...\"\n\nGrid's protest died in his throat.\n\nThe misunderstanding would haunt him for weeks.\n\n***\n\n\"How do you raise weapon proficiency quickly?\"\n\nGrid sat cross-legged in the space between field and orchard. Two hundred girls formed a circle around him, close enough that their knees touched his. Piaro stood slightly apart, arms crossed over his chest.\n\nGrid continued, \"I know repetitive practice matters most. But I need a shortcut. Something I can build into a weapon's options.\"\n\n\"You want to forge weapons that accelerate skill growth.\" Piaro stroked his chin. \"Hrmm...\"\n\nThe question stumped him. Khan knew nothing about weapon techniques beyond basic theory. Piaro knew nothing about blacksmithing beyond what heat did to metal. The gap between their expertise created a blind spot neither could easily bridge.\n\nWhile Piaro pondered, the girls edged closer.\n\n\"Duke Grid, meeting you is an honor.\" The blonde spear-wielder from earlier smiled shyly.\n\n\"Thanks to you, Damian became Pope.\" Another girl nodded enthusiastically. \"Our church finally knows peace again.\"\n\n\"Goddess Rebecca has clearly blessed you.\" A third reached out as if to touch his armor, then pulled back at the last moment.\n\nGrid knew their history. The **Rebecca's Daughters candidates** spent five to ten years in secret facilities, subjected to conditioning that stripped away normal childhood development. They learned to fight, to obey, to sacrifice themselves without hesitation or question. Independent thought was trained out of them like a bad habit.\n\nDamian and Piaro had changed that.\n\nUnder their guidance, the candidates discovered what it meant to be human rather than weapons. They laughed. They questioned. They made choices for themselves. They'd transformed from perfect soldiers into teenage girls experiencing delayed adolescence all at once.\n\nWhich meant they were at exactly the right age for first crushes.\n\nAnd Grid checked every box: the hero who'd saved them from darkness, blessed by the goddess herself, radiating adult masculine charm. His tall frame and mature features made their hearts race in ways they barely understood.\n\nBut Grid had a younger sister. He understood exactly how fickle teenage affections could be.\n\n*Just like middle school girls.* He smiled and reached out to pat the nearest girl's head. \"Grow up healthy and strong. And please look after my son, Lord.\"\n\n\"Yes!\" The girl's face lit up like the sun breaking through clouds. \"We'll protect him with our lives, Duke Grid!\"\n\nThe others chorused their agreement.\n\nGrid had no idea what seeds he'd just planted. The promise would make Lord's life significantly more complicated than necessary. But for now, two hundred pretty girls simply beamed at him while Piaro reached his conclusion.\n\n\"Use weapons in poor condition.\" The farmer's eyes gleamed. \"Fighting with degraded equipment forces users to overcome greater difficulties. That accelerates proficiency growth. Could you build that principle into the production method?\"\n\n\"Hoh.\" Grid rubbed his jaw.\n\nA weapon that degraded intentionally during use? Creating artificial obstacles to force skill development?\n\n*...Am I really about to make garbage items on purpose?*\n\nThe legendary blacksmith prepared to troll the entire player base.\n\n***\n\nThe elite members of the **Overgeared Guild** gathered at the entrance to the **Behen Archipelago**.\n\nThe former **Tzedakah Guild** core stood together: Jishuka, Faker, Vantner, Pon, Regas, Zednos. Yura had traveled from her Yatan Church obligations. Lauel stepped away from administrative duties. Peak Sword abandoned his mining operations. Even Huroi managed to extract himself from whatever diplomatic disaster he'd been causing.\n\nThey shared a single purpose.\n\n\"Become stronger.\" Grid's strategy memo burned in each of their minds.\n\nClear as many islands as possible. Accumulate massive point totals. Buy every elixir and skillbook the **Challenger Store** offered. Grow powerful enough to stand beside Grid when the real battles began.\n\n*Pak!*\n\n*Pa pa pa pat!*\n\nOne by one, they stepped through the shimmering portal. The **Behen Archipelago** functioned as an instant dungeon with strict single-entry limits. Each member would face their trials alone.\n\n\"Hrmm.\" Lauel confirmed everyone's positions from his rear vantage point, then opened a whisper connection. *Are you absolutely certain you won't challenge the archipelago?*\n\nEuphemina's response came immediately. *Yes. My current quest demands my full attention.*\n\n*It must be significant.* Lauel's curiosity sparked. *May I ask about the details?*\n\n*Well...*\n\nEuphemina began to explain.\n\nA dark smile spread across Lauel's face as he listened.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG: Glossary Link.**\n\n**Current schedule: 20 chapters a week.**\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}