{
  "id": 382,
  "title": "Chapter 382",
  "content": "# Chapter 382\n\nGrid stared at the forge, weighing Khan and Piaro's advice.\n\n*I need to make a bow that's hard to handle.*\n\nThe logic was simple. The worse the conditions, the faster the skill proficiency would climb. He pulled up his list of production methods. Hundreds of entries scrolled past—commissions from the Overgeared members had piled up over time.\n\n\"Hrmm.\"\n\nJishuka had collected these bow recipes through painstaking effort. Grid scanned for the ones with the highest level requirements.\n\n*Fire attribute bows won't work for me.*\n\nHe lacked any fire-related skills. Bows that boosted elemental damage at the cost of base performance were out. He kept scrolling.\n\n*Greatbows are off the table too.*\n\nSlow draw speed. High accuracy. High attack power. That accuracy was the problem. He needed something that would fight him, not help him.\n\n*Low accuracy. That's the key.*\n\nGrid had spent his entire crafting career chasing perfection. He'd never deliberately made a failure. The reversal stirred something unexpected in his chest.\n\nA grin tugged at his mouth.\n\n*So this is why people troll.*\n\nHe understood it now—the perverse satisfaction of doing something wrong on purpose. Two production methods caught his eye.\n\n---\n\n**[Pattern: Angel Bow]**\n\n**Rating:** <span class=\"rarity-rare\">Rare</span> ~ <span class=\"rarity-unique\">Unique</span>\n\n<span class=\"rarity-rare\">**Rare Rating Information:**</span>  \n**Attack Power:** 230~249  \n**Firing Speed:** +13%  \n* When an arrow hits the target three times in a row, **150%** additional damage will be done.\n\n<span class=\"rarity-epic\">**Epic Rating Information:**</span>  \n**Attack Power:** 269~280  \n**Firing Speed:** +17%  \n* When an arrow hits the target three times in a row, **200%** additional damage will be done.  \n* There is a **10%** chance that the target will fall into the **'bewitched'** state.\n\n<span class=\"rarity-unique\">**Unique Rating Information:**</span>  \n**Attack Power:** 300~334  \n**Firing Speed:** +21%  \n* When an arrow hits the target three times in a row, **300%** additional damage will be done.  \n* There is a **20%** chance that the target will fall into the **'bewitched'** state.\n\n*A beautiful bow with both ends spread like the wings of an angel.*  \n*Every time an arrow is shot, white feathers blur the air, creating a deceptive afterimage.*\n\n**User Restriction:** Level 300 or higher. Advanced Bow Mastery level 2 or higher.\n\n---\n\n**[Pattern: Quick Fire Bow]**\n\n**Rating:** <span class=\"rarity-rare\">Rare</span> ~ <span class=\"rarity-unique\">Unique</span>\n\n<span class=\"rarity-rare\">**Rare Rating Information:**</span>  \n**Attack Power:** 210~228  \n**Firing Speed:** +16%  \n* Every time you shoot an arrow, the firing speed will increase by **1%**. This effect will only be applied up to **50%**.\n\n<span class=\"rarity-epic\">**Epic Rating Information:**</span>  \n**Attack Power:** 230~250  \n**Firing Speed:** +19%  \n* Every time you shoot an arrow, the firing speed will increase by **1%**. This effect will only be applied up to **55%**.\n\n<span class=\"rarity-unique\">**Unique Rating Information:**</span>  \n**Attack Power:** 253~280  \n**Firing Speed:** +25%  \n* Every time you shoot an arrow, the firing speed will increase by **1%**. This effect will only be applied up to **60%**.\n\n*A bow with a resilient bowstring.*  \n*Optimized for fast shooting.*\n\n**User Restriction:** Level 300 or higher. Advanced Bow Mastery level 2 or higher.\n\n---\n\n*The Quick Fire Bow.*\n\nThe faster he could fire, the faster the mastery would grow. Speed was the foundation. Grid settled in front of the furnace.\n\n**Hwaruruk!**\n\nA legendary blacksmith's instincts seized control. The temperature climbed to the ideal threshold without hesitation.\n\n**Ttang! Ttang!**\n\nHis hammer struck the glowing metal. Each blow landed with perfect force, perfect timing.\n\n\"Ohhh!\"\n\nOne of the young blacksmiths leaned forward, eyes wide.\n\n\"Duke Grid!\"\n\nAnother apprentice whispered the name like a prayer. They always watched Grid this way—reverent, hungry. But as the bow took shape, confusion rippled through the crowd.\n\n**Ttang! Ttang!**\n\nThe balance was wrong. Visibly, unmistakably wrong. The young blacksmiths exchanged glances. The bow looked terrible. But Grid was a legend. Surely there was a hidden brilliance they couldn't see. Like those modern paintings—random dots on canvas selling for millions. They nodded to themselves, clinging to faith.\n\nGrid lifted the finished bow.\n\n> **[The <span class=\"rarity-rare\">Extremely Disgraceful Quick Fire Bow</span> has been created.]**\n\n---\n\n**[<span class=\"rarity-rare\">Extremely Disgraceful Quick Fire Bow</span>]**\n\n**Rating:** <span class=\"rarity-rare\">Rare</span>  \n**Attack Power:** 30~183  \n**Firing Speed:** +5%  \n**Accuracy:** -80%  \n\n* It is unknown where the arrows will fly.\n\n*A bow made by the legendary blacksmith Grid.*  \n*The structure of the bow is sound, but the balance is catastrophically off. Power and accuracy have collapsed.*  \n*Arrows fired from this weapon may strike allies, enemies, or empty air with equal probability.*  \n*This is the stain of Grid's life.*\n\n**Conditions of Use:** None. It is advised not to use this weapon.\n\n---\n\n\"...\"\n\nGrid stared at the stats. His **Legendary Blacksmith's Craftsmanship Skill** was Level 7—*Understanding of Gods' Weapons*. Every item he made received at least a 20% stat boost beyond the base design.\n\nAnd yet.\n\n*This is garbage.*\n\nThe Quick Fire Bow had mutated into something monstrous. The power was laughable. The accuracy was suicidal.\n\n*Maybe I should ignore the recipe entirely.*\n\nFollowing a production method guaranteed results. Deviating from it invited chaos—unknown variables, unpredictable failures. But he didn't want to waste his **Item Creation** skill on a troll weapon.\n\n**Kwack!**\n\nHe grabbed his hammer again. This time, he nudged the balance slightly toward functional.\n\nThe result appeared.\n\n> **[The <span class=\"rarity-rare\">Strange Quick Fire Bow</span> has been created.]**\n\n---\n\n**[<span class=\"rarity-rare\">Strange Quick Fire Bow</span>]**\n\n**Rating:** <span class=\"rarity-rare\">Rare</span>  \n**Attack Power:** 160~181  \n**Firing Speed:** +12%  \n**Accuracy:** -60%  \n\n* Every time you shoot an arrow, the firing speed will increase by **0.5%**. This effect will only be applied up to **30%**.  \n* It is unknown where the arrows will fly.\n\n...\n\n**User Restriction:** Level 300 or higher. Advanced Bow Mastery level 2 or higher.\n\n---\n\n*Better. Slightly.*\n\nBut not enough. The accuracy was still abysmal, but at least it had the stacking fire-speed effect now. Still, a bow that could fire in random directions was unusable. Grid didn't want to become a team-killer. He exhaled slowly and started hammering again, this time with surgical precision.\n\nThe third bow emerged.\n\n> **[The <span class=\"rarity-rare\">Poor Quick Fire Bow</span> has been created.]**\n\n---\n\n**[<span class=\"rarity-rare\">Poor Quick Fire Bow</span>]**\n\n**Rating:** <span class=\"rarity-rare\">Rare</span>  \n**Attack Power:** 180~203  \n**Firing Speed:** +14%  \n**Accuracy:** -40%  \n\n* Every time you shoot an arrow, the firing speed will increase by **1%**. This effect will only be applied up to **40%**.  \n* The probability that the arrow will fly in an unintended direction is very high.  \n* If you hit the **'desired target,'** you will gain additional **Bow Mastery** experience.\n\n*A bow made by the legendary blacksmith Grid.*  \n*It's great—if you can actually hit the target.*\n\n**User Restriction:** Level 300 or higher. Advanced Bow Mastery level 2 or higher.\n\n---\n\n*There it is.*\n\nBonus mastery experience. The golden option. Grid's mouth curved into a satisfied smile.\n\n*A little more.*\n\nHe rolled his shoulders and lifted the hammer again. The furnace roared.\n\nOn the other side of the smithy, something else was happening.\n\n\"Abubu?\"\n\nLord toddled into the workshop, drawn by the sound of his father's hammering. He wanted recognition, wanted to be noticed. His eyes locked onto the pile of discarded bows near the furnace. He picked up the <span class=\"rarity-rare\">Extremely Disgraceful Quick Fire Bow</span> with both hands.\n\n\"Abubu!\"\n\n*Father's bows are amazing,* the child seemed to say.\n\nFrom the shadows, Kasim's voice whispered.\n\n\"Well done.\"\n\nThe King of Shadows crouched beside the boy, eyes gleaming.\n\n\"I should teach you archery as well.\"\n\nA bow made by a legendary blacksmith. It had to be precise. Easy to use. Kasim glanced at the weapon in Lord's hands.\n\n*Though... it does look strange.*\n\nDoubt flickered through his mind, but he dismissed it. He pulled an arrow from his belt and placed it in Lord's tiny grip.\n\n\"Now. Shoot an arrow.\"\n\n**Ttang! Ttang!**\n\nNo one else paid attention. Khan and the hundred apprentices watched Grid work. Grid himself was lost in his craft. There seemed to be no danger.\n\n\"Abuuuu!\"\n\nLord nodded vigorously. Kasim's chest swelled with pride. He demonstrated the stance, the grip, the draw.\n\nLord mimicked him.\n\n**Kiririk!**\n\nThe bowstring pulled taut.\n\n\"Good. Now. Release.\"\n\nKasim studied the boy's posture, his breathing. Everything looked perfect. He gave the signal.\n\n**Tatang!**\n\n\"...!\"\n\nKasim's eyes widened. The arrow left the bow. Lord had been aiming at the smithy wall. The arrow flew in the *opposite direction.*\n\n*This is impossible.*\n\nKasim was the strongest assassin on the continent. His agility was monstrous. His reflexes bordered on precognition. He'd dodged thousands of arrows in his career.\n\nHe couldn't dodge this one.\n\n**Puk!**\n\n\"Ugh.\"\n\nPain exploded in his left buttock. The arrow was buried deep. The trajectory had been incomprehensible—a curve that defied physics, sight, and reason.\n\nKasim's breath caught.\n\n*Could it be...?!*\n\nWas Lord the second coming of Povia, the legendary archer? The kind of genius who bent arrows through sheer will?\n\n\"Abu?\"\n\n> **[The beginner 'Bow Mastery' skill has been acquired.]**\n\nLord's eyes lit up. The arrow had struck Kasim—a target over **Level 360**. The experience gain was enormous.\n\n\"Abuuuu!\"\n\nThe child clutched the <span class=\"rarity-rare\">Extremely Disgraceful Quick Fire Bow</span> to his chest like a trophy.\n\n---\n\n***\n\n\"Everyone is amazing.\"\n\nSticks stood on the 40th island of the Behen Archipelago. His eyes shone as he watched the Overgeared members navigate the trials.\n\nAll of them had passed the 10th island. Every single one.\n\n\"All of Grid's subordinates are talented.\"\n\nPure talent alone? Any of these people could become legends. They possessed the raw ability to carve their names into history through sheer force of will.\n\nBut they served Grid.\n\n\"The more I see, the more incredible they become.\"\n\nGrid's shadow grew larger in Sticks' mind. Admiration welled up again, sharper than before.\n\n\"Wahh! Sticks! What should I do?\"\n\nBini the helper fairy fluttered in frantic circles, wings beating too fast.\n\nAs a helper fairy, Bini was supposed to guide challengers who reached the 20th island. But dozens had arrived *simultaneously.* The fairy's guidance system couldn't handle the load.\n\n\"Haha...\"\n\nSticks had no answer.\n\nThe fame of the Overgeared Guild was still rising. Even today.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**\n\nCurrent schedule: 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}