{
  "id": 383,
  "title": "Chapter 383",
  "content": "# Chapter 383\n\nThe key to rapid fire was the bow's resilience. That was why drake tendons were essential for crafting the Quick Fire Bow.\n\nDrakes. The strongest tameable pets in the game. Their combat power was exceptional, their intelligence high enough to make hunting them a nightmare. The population was sparse to begin with. Most players who found one chose to tame rather than kill.\n\nAll of this made drake tendons rare. Expensive. The market price sat at a minimum of 10,000 gold per tendon, despite the handful of users who could actually make use of them. Grid had money, sure. But burning through materials at that rate was reckless.\n\n*One bow. That's all I can afford.*\n\nGrid examined his creation.\n\n> **[<span class=\"rarity-epic\">Spiral Quick Fire Bow</span>]**\n> \n> **Rating:** Epic  \n> **Attack Power:** 215~249  \n> **Firing Speed:** +17%  \n> **Accuracy:** -30%\n> \n> * Every arrow fired increases firing speed by **1%**. This effect stacks up to **50%**.\n> * The arrow's trajectory is difficult to control.\n> * Hitting your desired target grants additional **Bow Mastery** experience.\n\nNot his best work. Honestly, it was mediocre. But it was the least broken of the five bows he'd managed to produce.\n\n*At least it speeds up mastery gains.*\n\nThat was the point. He'd train his archery by learning to control these wild shots.\n\n*So much to do before the competition.*\n\nHe needed to raise his new skills while pushing through the Behen Archipelago. Identify weaknesses. Forge new equipment. Forty days remained in the real world before the National Competition kicked off, and Grid planned to live inside his capsule.\n\nSatisfy was the only place where he mattered. The only place where he could prove anything.\n\n---\n\n『Which country will dominate the 2nd National Competition?』\n\nThe international news cycle had latched onto the question. The anchor gestured toward a panel of experts who leaned forward with the eagerness of sharks scenting blood.\n\n『The United States takes first. Their average participant level is the highest across all competing nations.』\n\nA woman in a sharp suit nodded. 『The US roster is stacked. Zibal, Asuka, Lauel, Box, Black Teddy. Hurent isn't competing this year, but their overall balance is still superior to everyone else.』\n\n『Lauel is a variable, though.』 A bespectacled analyst tapped his tablet. 『He's one of Grid's closest allies in Overgeared. During the competition, what's to stop him from helping South Korea instead of the United States?』\n\n『The Overgeared members aren't children.』 The first expert waved a dismissive hand. 『They understand compartmentalization. The National Competition is separate from guild politics.』\n\n『Besides, there's no need for concern.』 The woman in the suit leaned back. 『Helping rival nations is a rules violation. The penalties are severe. Lauel and every other Overgeared member know this. They won't risk it.』\n\nThe logic was sound. The Overgeared members would fight for their respective countries. Grid would face Lauel's tactical genius. He'd compete against Pon, Regas, Faker. All of them.\n\n『Who else are the contenders besides the United States?』\n\n『Canada and France have the next highest concentration of top rankers.』\n\n『What about South Korea?』 The analyst adjusted his glasses. 『They have Grid and Yura. Or Russia with Kraugel?』\n\n『The 2nd National Competition is fundamentally different from the first.』 The first expert shook his head. 『More events. New rules. A few star players can't carry an entire country anymore. South Korea will place top fifteen at best. Russia, top eighteen.』\n\n『Isn't that still generous for South Korea?』 The woman frowned. 『They have no rankers outside of Grid, Yura, and Peak Sword.』\n\n『On paper, yes. South Korea is a weak team.』 The analyst paused. 『But Yura is a variable. If the rumors about her unique hidden class are true...』\n\nIn the first National Competition, South Korea had been written off. The laughingstock. This time, the international community at least acknowledged they existed.\n\nKorean reactions were mixed.\n\n**-Why are they disrespecting South Korea? Did they forget we placed third last year?**\n\n**-Exactly. And last year Peak Sword didn't even compete.**\n\n**-Yura was just a normal class back then.**\n\n**-This year we have Peak Sword AND Yura with a hidden class. We're legitimate contenders.**\n\n**-Are the Patriotic Association trolls spamming the boards again?**\n\n**-Korea got third place last year because Grid was a monster. That's it.**\n\n**-Correct. South Korea is still weak in Satisfy. Grid won all three gold medals for us. The overall team strength is pathetic.**\n\n**-Grid can win three golds again this year, right? Of course. He's God Grid. But the problem is the golds are worth less this year. Last year had nine events. Now there are twenty-one.**\n\n**-Peak Sword? He's average tier in other countries.**\n\nThe skeptics outnumbered the believers. Most Koreans shared these pessimistic takes. Peak Sword's jaw clenched as he read them.\n\n\"This is so absurd I need to sit down.\"\n\nThe Patriotic Association headquarters in Seoul. Peak Sword had logged out, accessed the internet, and now his face twisted into something ugly.\n\n\"They're underestimating God Grid. Underestimating South Korea.\" His fist hit the desk. \"And what? I'm just average in other countries? Do these idiots know who Peak Sword is?\"\n\nHis blood boiled. He had to make South Korea win the 2nd National Competition.\n\n*...That's too ambitious.*\n\nPeak Sword forced himself to think realistically. Top ten. He'd aim for top ten. Step by step, Korea would rise in Satisfy's rankings.\n\nOne day.\n\nWhat Peak Sword and the rest of the world didn't realize yet was simple. This was just the beginning. The opening act of Grid and the Overgeared Guild's legend.\n\n---\n\nGrid. Grid. Grid. Grid. Grid. Grid. Grid.\n\nTurn on the TV and his name spilled out. The radio. Phones. Newspapers. Internet forums. Neighborhood gossip circles. The National Competition and Grid consumed every conversation in South Korea.\n\nIt drove Go Jimyung to the edge of sanity.\n\n\"Damn Grid!\"\n\nGo Jimyung played for the KBO League. He'd been South Korea's best hitter once. Then last year he'd started dating the leader of girl group Farina, and his performance cratered. Scandals piled up. Accidents followed.\n\nIt wasn't just team demotion. He was facing expulsion from the league entirely.\n\n\"Grid...!\"\n\nAt the Young Ladies High School Satisfy tournament, his girlfriend had begged him to defeat Ruby. He'd broken the rules, tried to kill her, and failed because Grid interfered. Everything spiraled from there. The public branded him garbage. His girlfriend dumped him.\n\nGo Jimyung blamed Grid for all of it. Classic deflection. Nothing was ever his fault.\n\n\"I won't forgive you.\"\n\nThe sound of knuckles cracking.\n\nGo Jimyung went to make a phone call. He needed to speak with the chief of Poisonous Wave, the gang that controlled Seoul's underworld.\n\n---\n\n\"We'll check on the building and sleep at Grandpa's house.\"\n\nYoungwoo's parents and sister headed out for a rare family outing. Youngwoo stayed behind. He had a National Competition to prepare for.\n\n\"Please stay healthy.\"\n\nThe moment his family left, Youngwoo dove back into his capsule. Someone was waiting for him inside Satisfy.\n\n---\n\n000-0 Street, XX Neighborhood, Geumcheon-gu.\n\nGrid's fame had turned the area into a tourist trap. People constantly tried to visit his home. The residents had complained until the district council declared it off-limits and stationed security.\n\nAs a result, the neighborhood transformed. Crime dropped. Property values rose. Grid's local popularity skyrocketed.\n\n\"Why does a slum like this have palace-level security?\"\n\nKang Cheolgyu handled drug distribution for Poisonous Wave. He was one of Seoul's \"Five Fingers,\" known for his vicious punching power. Go Jimyung was from his hometown, so accepting the job to cripple someone had been easy.\n\nActually reaching the target's house was the problem. Two hours of dodging patrols.\n\n\"I'm charging another 500 million won.\"\n\nKang Cheolgyu smiled, sly and greedy. His eyes locked onto the 800 million won car parked in front of the target's home.\n\n*Grid. Grid.*\n\nSo many Koreans worshipped Grid as a hero. Kang Cheolgyu thought it was pathetic. Their national hero was a gamer? He couldn't understand people who obsessed over a gaming competition.\n\n\"Drinking is better than gaming. Stupid people.\"\n\nKang Cheolgyu waited for Grid's door to open. He planned to strike the moment Grid stepped outside. One hour passed. Two hours. Three. Four. Five. Ten hours dragged by, but Grid's door remained shut.\n\n*What the hell?*\n\nGrid wasn't coming out? The autumn night turned cold. Kang Cheolgyu hated the cold. His face grew pale, stamina draining with every shivering breath.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}