{
  "id": 384,
  "title": "Chapter 384",
  "content": "# Chapter 384\n\n**\"Achoo!\"**\n\nKang Cheolgyu wiped his nose with the back of his hand. Thirteen hours. He'd been parked across from Grid's house since yesterday evening, and the autumn chill had settled deep into his bones. His breath misted in the pre-dawn air.\n\n*The car's still there.*\n\nHe shifted in his seat, trying to restore feeling to his legs. Kang Cheolgyu didn't understand people who stayed home. A house was for sleeping—eight hours tops. Anything more than that was a waste.\n\n*What the hell is he doing in there?*\n\nThe house itself was nothing special. Single story, maybe 25 pyeong if you counted the garden. Small. Grid lived alone in there, supposedly. The thought stirred something uncomfortable in Cheolgyu's chest.\n\n\"Poor bastard.\" The words came out before he could stop them.\n\nHe'd lost his parents young too. Spent years eating nothing but ramyun in a basement room so cold he could see his breath indoors. Looking at that modest house now, he saw himself. A younger version. Struggling. Alone.\n\n\"Wait.\" He frowned.\n\n*Doesn't Grid live with his family?*\n\nThe doubt crept in like the cold. Thirteen hours without movement. No lights. No signs of life.\n\n*Maybe...*\n\n*A robbery?*\n\nHis jaw tightened. Grid was his target—he needed Grid conscious and capable of feeling pain to collect his fee. If someone else had gotten to him first...\n\n\"Shit.\" He popped the car door open. \"Guess I'm playing hero.\"\n\nKang Cheolgyu had fists that could break bones, but his brain had never been his strong suit. He'd dropped out young, never developed the habit of thinking things through. The fact that he'd been watching this house for thirteen hours specifically because of the security system didn't occur to him as he approached the fence.\n\nNerves made people stupid. He was proof.\n\nHe grabbed the top rail and hauled himself up.\n\n**CHIRPPPPPPPP!**\n\nThe alarm shrieked through the quiet neighborhood. Motion sensors. Of course there were motion sensors.\n\n\"Fuck—\"\n\nCheolgyu dropped from the fence and spun to run. A figure blocked his path.\n\n\"A rat came here.\"\n\n\"What?\"\n\nThe man wore an eyepatch over his left eye. Western features—sharp nose, light green eye, short grey hair cropped close to his skull. Young. Dangerous.\n\n\"Who the hell are you?\"\n\nThe Westerner said something incomprehensible. Foreign. Then he hawked and spat at Cheolgyu's feet.\n\n\"Kyaaack—\" The glob of phlegm hit the pavement.\n\nThe one-eyed bastard stepped forward.\n\n\"Crazy son of a bitch.\" Cheolgyu's hands came up. \"You don't know who you're fucking with.\"\n\nChief of the Poisoned Wave gang. One of Seoul's Five Fingers. This foreigner had picked the wrong fight.\n\n\"You're gonna regret this.\"\n\nCheolgyu struck. Three-punch combo into a jab—textbook boxing, honed in a hundred street fights. Fast. Precise. Lethal.\n\nThe Westerner's right hand moved in a blur.\n\n**Block. Block. Block. Block.**\n\nEvery punch caught. Deflected. The foreigner's fingers closed around Cheolgyu's wrist like a vice.\n\n*This guy—*\n\n*He saw through it. All of it.*\n\nWorld-class. The Westerner moved like a world-class fighter. Cheolgyu's eyes widened.\n\nThe Westerner's leg came up.\n\n**Pakak!**\n\nPain exploded through Cheolgyu's left arm as he barely got it up in time. He yanked back, trying to free his trapped wrist. The grip didn't budge. Instead, the Westerner pulled him forward and drove a knee up.\n\n**Peeok!**\n\nCheolgyu's nose crunched. Blood poured hot down his face. The Westerner still held him. He raised his free hand to staunch the flow, but that wrist remained locked in place. No escape through strength. Had to be smarter.\n\nHe twisted his body and swung his elbow.\n\nThe Westerner shifted his head. The strike glanced off—barely grazed the scar cutting across his nose.\n\n*Not bad.*\n\nThe thought flickered through the Westerner's mind for a fraction of a second. Then it was gone. Cheolgyu's strength flagged, his face a mangled mess. The skill gap was too wide. This had stopped being a fight thirty seconds ago.\n\nNow it was just punishment.\n\n**Bam. Bam. Bam.**\n\nFist met flesh. Again. Again. Again. Cheolgyu's head snapped back with each impact. Blood sprayed. His legs buckled.\n\n**Bam. Bam.**\n\n\"You...\" Cheolgyu's split lips barely formed the words. \"Who... the hell...\"\n\nWhy was this happening? Why was this foreigner beating him to death in a quiet Seoul neighborhood?\n\nThe Westerner spoke, his Korean broken but clear.\n\n\"I'm Grid's bodyguard. Toon.\"\n\nBeast Master Toon. The man who'd dismantled the Italian mafia's power structure in a single night. The strongest Overgeared member in the real world. He'd come to South Korea at Yura's request.\n\n*\"You need funds to buy land here? If you want to move to Korea with the other guild members, I'll arrange housing. Just... please keep Grid safe.\"*\n\nGrid's safety. It wasn't just Yura's wish—it was the entire guild's. Without Grid, there was no Overgeared. Without Overgeared, they had nothing.\n\nFor Toon, an orphan who'd never known family, that bond meant everything.\n\n\"Touch Grid...\" Toon's single eye held the cold calculation of a predator. \"Kill.\"\n\nIce ran down Cheolgyu's spine.\n\n\"U-Understood!\" His hands came up, placating. \"I won't even step on his shadow! Never again!\"\n\n**Creak.**\n\nThe front door swung open.\n\nGrid stumbled out, blinking in the pre-dawn light. He'd been in the capsule for thirteen straight hours. The alarm had ripped him out of the game.\n\n\"What?\" He took in the scene. \"What's going on? Toon?\" His eyes widened. \"Why are you here? When did you get to Korea?\"\n\nToon. A beaten stranger. Grid's brain struggled to connect the dots.\n\nThree security company vehicles screeched to a halt at the curb.\n\n\"You're safe!\" The guards piled out, rushing to Grid. They weren't just doing their job—they were fans. \"Mr. Grid, are you okay?\"\n\n\"Uh...\" Grid glanced at Toon. \"Yeah, I'm fine.\"\n\nThe security team tackled Kang Cheolgyu to the ground and zip-tied his wrists. One of them made a call. When the police arrived and ran Cheolgyu's face through their database, they went pale.\n\nBy dawn, the news cycle had exploded.\n\n**[Grid Instrumental in Capture of Major Drug Trafficker]**\n\n**[Kang Cheolgyu, Head of Seoul Drug Ring, Apprehended by Grid and Associate Toon]**\n\n**[Seoul City to Award Honorary Citizenship to Grid and Toon]**\n\n**[National Police Agency Announces Commendation and Reward Money]**\n\n**[Blue House Considering Presidential Citation]**\n\n\"I just want to play the game.\" Grid stared at the notification on his phone.\n\nHonorary citizenship. Commendations. A potential presidential citation. He should've been honored. Instead, he just felt exhausted. Trips to City Hall. The police station. Press interviews with Toon, who could barely speak Korean.\n\n\"I don't have time for this.\"\n\n\"...\" Toon said nothing, but guilt flickered across his scarred face.\n\n***\n\n> **[You have entered the 40th island.]**\n\nGrid spent his limited time crafting. A spear for Lord. A bow. He checked his son's progress, kissed Irene goodbye, and returned to the Behen Archipelago. Sticks materialized as he arrived.\n\n\"You finally came.\"\n\n\"I'm starting the challenge immediately.\"\n\nGrid didn't ask about the other Overgeared members. He trusted them to handle their own progression. Right now, he needed to focus on his own growth. The clock was ticking.\n\n*The 2nd National Competition.*\n\nParis, France. The world stage. Grid had a role to play there, and failure wasn't an option.\n\n*Three gold medals. I have to win three.*\n\nThe adamantium reward was tempting, sure. But that was secondary. What mattered was the fifty million people watching from South Korea. His family. The trust they'd placed in him.\n\nGrid wouldn't let them down. Not this time. He felt the weight of responsibility settle across his shoulders—so different from the selfish desperation that had driven him during the first competition.\n\nHe exhaled slowly and stepped through the gate.\n\nDarkness. Then light.\n\nA bamboo forest spread before him, serene and still. Sunlight filtered through the canopy in golden shafts.\n\n> **[You have entered the 41st island.]**\n>\n> **[A mission will be created.]**\n>\n> **[41st Island]**\n>\n> **Fight with yourself and win.**\n>\n> **First Clear Compensation: You can raise the level of one skill.**\n\n*No challenger points?*\n\nHe dismissed the thought. A skill level-up was worth more anyway—his legendary skills took forever to raise naturally. This was actually a better reward.\n\n*A bonus stage.*\n\nThe meaning clicked into place. The 41st island wasn't about combat. It was about transcendence. Overcoming your past to reach a higher state. The Behen Archipelago had been designed to forge legends through constant growth.\n\nGrid scanned the bamboo grove, muscles tense.\n\n*What's waiting at the end of all this?*\n\n**Sururuk.**\n\nMovement. Grid spun.\n\nA figure stepped out from behind a bamboo stalk. Grid's face. Grid's armor. Four golden hands orbited the copy's shoulders.\n\n*The God Hands too?*\n\nThe clone had everything. Every item. Every skill. Grid's jaw clenched.\n\nThen the copy moved.\n\n\"**Pagma's Swordsmanship, Linked Kill Wave.**\"\n\n\"What?!\"\n\n---\n\n**Glossary of Common Korean Terms:** OG: Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}