{
  "id": 385,
  "title": "Chapter 385",
  "content": "# Chapter 385\n\n\"Pagma's Swordsmanship, Linked Kill Wave.\"\n\nGrid's chest tightened. The words shouldn't have been possible.\n\n*What the hell?*\n\nPagma's Swordsmanship devoured mana and locked skills behind brutal cooldowns. He'd compensated by fusing techniques—Link with Kill, Wave with Restraint. But the experiments had walls. Two skills maximum. Always two.\n\nThe clone had just used three.\n\n*I never pulled that off.*\n\nHis pride cracked. Confusion bled through the fissure. But confusion was a luxury he couldn't afford.\n\n*What else does it have?*\n\nLess than a second had elapsed. Grid's mind accelerated.\n\n*Level 2 Linked Kill weakens each strike but fires three to eight times in rapid succession.*\n\nAdd Wave to the equation?\n\n*No.*\n\nThe thought crawled up his spine like ice.\n\n*Kill, repeating in waves.*\n\nToo broken. The system wouldn't allow it. Grid tried to reject the logic, but his instincts screamed otherwise.\n\nKurururung!\n\nThe clone's blade carved patterns through empty air. The first Kill erupted.\n\nKwa kwa kwa kwang!\n\nRed afterimages—Kill's signature—bled into Wave's blue light. The energy spread omnidirectionally, a tsunami of cutting force. Each strike carried lethal intent. Each wave dragged at his movement speed like chains.\n\nGrid activated Fly and launched himself backward. The attacks pursued him.\n\n*Impossible.*\n\nThe sensation mirrored Piaro's techniques. Three of Pagma's Swordsmanship skills, woven together without seams. Perfect execution. This was what legendary techniques were supposed to feel like.\n\n*I need this.*\n\nAdmiration, shock, desperation—all three warred in his gut. Eight Kills bore down on him. The old Grid would've taken them full force before his neurons caught up. But things had changed.\n\n*I have Revolve.*\n\nThe skill cycled every two minutes. Using it first meant losing. If he absorbed and reflected the damage, the clone would mirror the technique and send it back amplified.\n\n*Not yet.*\n\nHe summoned four God Hands. They materialized between him and the oncoming strikes, golden barriers against annihilation. The clone's God Hands intercepted them mid-flight.\n\n*Damn it.*\n\nGrid's jaw clenched. The golden constructs clashed, neither side yielding ground. He reached for his pet inventory.\n\n*Randy. Switch places with me.*\n\nThe doppelganger's response came instantly. *Yes!*\n\nGuilt twisted Grid's stomach. Using Randy as a meat shield made him feel like trash. But the math was simple—a user's death meant experience loss and dropped items. A pet took a 24-hour lockout. From a pure numbers perspective, sacrificing Randy was the optimal play.\n\nSupak!\n\nRandy materialized, Grid's face and form reflected perfectly. Their positions swapped.\n\nPepepepeok!\n\nEight Kills slammed into Randy's body in rapid succession.\n\n\"Kyaaak!\"\n\nThe doppelganger's scream was Grid's voice, distorted by pain. Randy's form pixelated to grey ash. Something sharp lodged itself behind Grid's ribs.\n\n> [Doppelganger Randy's health has fallen to 0.]\n> [Randy is forced to return to the pet inventory. You can't summon it for the next 24 hours.]\n\nGrid's eyes hardened. The notification windows blurred at the edges of his vision.\n\n\"You!\"\n\nThe word scraped out of his throat. Randy and Kill collided in a final explosion, flame and force obscuring the clone. Grid charged through the smoke, Failure carving toward the copy's center mass. He unleashed Kill.\n\n*Come on. Use Revolve.*\n\nIf the clone countered with the defensive skill, Grid would answer with his Level 3 version—**160%** damage reflection. Neutralize the counterattack, inflict more damage. Win the exchange.\n\nThe clone ignored the bait.\n\nUnlike the mindless bots in cheap games, Grid's copy operated with named NPC-tier intelligence. It recognized that using Revolve first created a losing position.\n\nPuok!\n\nThe calculation was surgical. The clone accepted Kill's impact, judging it wouldn't die from a single heart strike. Ice water replaced Grid's blood.\n\nThe clone's feet moved the instant Kill connected.\n\n*Link's footwork.*\n\nKill required straight-line aggression. Link demanded curves. Grid knew evasion was possible by mixing their movement patterns. His clone knew it too.\n\nThe copy stepped backward—Kill's retreat. Then it cut left and right in Link's serpentine flow. Grid followed with Link, blade seeking the clone's exposed ribs.\n\nPit!\n\nPipipipipit!\n\nBlood sprayed in thin arcs. The clone's momentum didn't falter. Cold certainty settled over Grid's thoughts.\n\n*It activated a skill while taking Link's hits.*\n\n\"Pinnacle Kill.\"\n\nGrid's pupils contracted.\n\n*Fusion without using Link as the medium?*\n\nHis confusion spiked toward overload. But muscle memory—thousands of hours of combat compressed into reflexive action—took over. Grid twisted Link's trajectory mid-swing, trying to intercept the combined technique.\n\nBad idea. Link prioritized speed over raw power. Its cutting force couldn't match Kill's lethality, much less Pinnacle Kill's armor-ignoring penetration. Defending against their fusion with Link was suicide.\n\nChaaeng!\n\nPinnacle Kill crushed through Link's guard.\n\nPuok!\n\n> [You have suffered 59,300 damage.]\n\n\"Kuaaaak!\"\n\nThe scream tore out of Grid's chest. His vision whitened at the edges. A targeted skill merging Kill's destructive force with Pinnacle's trajectory manipulation. His defense might as well have been paper.\n\n> [You have lost more than half of your health in one blow! You will be stunned for three seconds!]\n> [Resisted with the passive effect of One who Became a Legend.]\n\nGrid's teeth ground together. He forced his body to move, summoning Wave to create distance. But a fundamental difference existed between him and his copy. When the clone unleashed Linked Kill Wave, Grid had scrambled for survival. The clone's priority was shutting down his counter-options.\n\nThe clone was better.\n\nPuok!\n\n\"Kuk...\"\n\nGrid's ankle exploded in white-hot pain. His stance collapsed. Wave's casting sequence shattered.\n\n*This bastard knows my weaknesses better than I do.*\n\nSelf-loathing burned in his throat. He was still incomplete. His ignorance let the clone abort his skill before it finished forming.\n\nSwaeek!\n\nIyarugt's red blade cut toward his throat. The clone had swapped from Grid's Greatsword after using its skills—proof of perfect item comprehension.\n\n\"Blackening.\"\n\nPeeng!\n\nBlack energy detonated outward, Grid at its epicenter. He slipped through the clone's attack pattern, confirming his stat surge. Blacksmith's Rage layered with Quick Movements. Then Linked Kill.\n\nThe speed left no room for interruption.\n\nPuok!\n\nPuk puk!\n\n> [You have dealt 35,300 damage to the target.]\n> [You have dealt 36,106 damage to the target.]\n\n*Got it clean.*\n\nGrid drove Failure forward, betting everything on this exchange. The moment the next Linked Kill strike was about to pierce flesh, he allowed himself to believe the 40th island was cleared.\n\nReality disagreed.\n\n> [The target has recovered 54,159 health.]\n\nDoran's Ring triggered—**50%** of incoming damage converted to health. Holy Light Armor stacked on top, **300%** health regeneration amplification. The clone's wounds closed as if they'd never existed. Then it activated Blacksmith's Rage and Quick Movements, evading the third Linked Kill with contemptuous ease.\n\n*Scam items.*\n\nThe combination was obscene. Had he been fighting with this level of advantage the whole time? Every opponent he'd crushed with these tools suddenly seemed pathetic.\n\n*Focus.*\n\nDoran's Ring operated on a 10-minute cooldown. Grid hadn't burned his own charge yet. He held one more card than the clone.\n\n*Still absurd.*\n\nThe clone could unveil more fusion techniques at any moment. Grid clicked his tongue and fired the remaining Linked Kill strikes. The clone responded with something he hadn't predicted.\n\nNo evasion. Instead—Revolve?\n\nJjejejeok!\n\n*Now!*\n\nSatisfaction flared through Grid's chest. He activated his counter.\n\n\"Revolve.\"\n\nJjeejeeeong!\n\nRevolve meeting Revolve. The textbook exchange. Grid's grin widened as Linked Kill's energy multiplied, amplified to overwhelming force. This would end it.\n\nThen—\n\n\"Pagma's Swordsmanship, Revolve.\"\n\nA second Grid materialized behind the clone. Doppelganger Randy, using Revolve to reflect the reflected energy.\n\n*It cloned my pet.*\n\n> [You have suffered fatal damage!]\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\nUnderstanding crashed through Grid's mind.\n\n*I lost.*\n\nNo path to victory remained. A smile crept across his face. Not the expression of a broken man. Something sharper. Hungrier.\n\n*Again.*\n\nBefore the National Competition arrived, he would consume everything. He would evolve.\n\n***\n\n**Glossary of Common Korean Terms**\nOG: Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}