{
  "id": 386,
  "title": "Chapter 386",
  "content": "# Chapter 386\n\n*I lost.*\n\nThe thought hit Grid like cold water. But instead of despair, something else stirred in his chest. A gnawing hunger.\n\n*This isn't the only chance. I have to surpass you. Surpass myself.*\n\nThe clone possessed 100% of his stats, skills, and items. A perfect mirror. And that mirror was teaching him something important.\n\n*If it can do it, so can I. I just need to figure out how.*\n\nKwack!\n\nGrid's fingers tightened around the grip of his greatsword. The Legendary passive's protection lasted five seconds. Five seconds of invulnerability. He had to use them. Linked Kill Wave. Pinnacle Kill. The combinations his clone had used to dismantle him. He could learn them. He had to.\n\nRight now, winning didn't matter. Dying didn't matter.\n\n\"Pagma's Swordsmanship, Link.\"\n\nCheook!\n\nGrid moved. His body flowed like water, feet gliding across the ground in tight circles. His black eyes sharpened to points. The familiar dance of Link carried him forward, momentum building with each rotation. For a moment, something shifted in his expression. Not quite confidence. Purpose, maybe. Desperation refined into focus.\n\nTeong!\n\nHe closed the distance. Grid's Greatsword swept horizontal. The motion of Kill. He'd done this a thousand times. Linked Kill. Now add Wave. Connect them. It should work.\n\n> [The cooldown time of Linked Kill hasn't returned.]\n\n> [The casting of Linked Kill is cancelled.]\n\n*Of course.*\n\nThe familiar sting of failure. Grid's jaw clenched. Wave and Linked Kill refused to mesh. The timing was wrong. The order was wrong. Something was fundamentally wrong with his understanding.\n\n*But the clone did it. If the clone can do it...*\n\nHe didn't have time to puzzle it out. Grid switched targets mid-swing. Pinnacle. Then Kill. Maybe Pinnacle Kill would work where the other combination failed.\n\nIt didn't.\n\nPinnacle triggered first. Kill never manifested. The blade descended with Pinnacle's force alone, carving deep into the clone's chest. The strike landed clean. Found the heart.\n\nSeokeok!\n\nBut the clone's health bar barely dipped. Doran's Ring pulsed green light. The Holy Light Armor shimmered. The wound closed.\n\n*Not enough. Come on. Attack me.*\n\nGrid needed his clone to make a mistake. Part of him hated losing. The experience loss would hurt. The items he might drop would hurt worse. And his pride... well, that would sting most of all. But he wasn't giving up. Not yet.\n\nThe moment the clone struck back, Grid would equip Doran's Ring. Recover his health. Turn the tables.\n\nExcept the clone was also Grid. It knew Grid better than Grid knew himself. And it understood that attacking an invincible target was pointless. Dangerous, even.\n\nSuuk.\n\n*You bastard!*\n\nThe clone ran.\n\nJust turned and sprinted across the battlefield. Kiting him. Wasting time. Grid's frustration mounted with each step. He chased, sword raised, unable to close the gap. The five seconds ticked down.\n\nRight before the immortal state ended...\n\nSnap!\n\nGrid grabbed a potion from his inventory. Super Health Recovery Potion. One of Reidan's premium products.\n\n> [15,000 health has been restored.]\n\nChaaeng! Chaeng!\n\nThe clone stopped running. Turned to face him. Iyarugt moved in precise arcs, deflecting every strike Grid threw. Perfect defense. The clone knew every pattern, every feint, every opening Grid might create. Because they were the same person.\n\nThen the immortality wore off.\n\nThe clone attacked.\n\nBlackening flooded the clone's body. Blacksmith's Rage activated. Quick Movements blurred its form. Grid had used those buffs first. Their durations expired for him just as the clone's were still running. Now Grid stood exposed, debuffed, slower. And the clone moved with kill intent.\n\nKill.\n\nThe technique Grid had tried to master moments ago. Now used against him. The greatsword fell like divine judgment.\n\nGrid's hand moved. Inventory. Doran's Ring.\n\n> [Doran's Ring has been equipped.]\n\nNot fast enough.\n\n> [You have suffered fatal damage!]\n\n> [You have died because health has dropped to 0.]\n\n> [You have lost 30.6% experience.]\n\n> [Mission failed!]\n\n> [Exiting the 41st island.]\n\n> [Moving to the last save point, the 40th island.]\n\nDarkness swallowed his vision. The black screen he hadn't seen in months. It wasn't as terrifying as it used to be. Just frustrating.\n\n***\n\n\"Are you okay?\"\n\nSticks' weathered face came into focus. The sage stood on the 40th island, concern etched in every wrinkle. He probably expected Grid to be devastated. The first defeat since entering the Behen Archipelago. A blow to the ego.\n\nBut Grid felt fine.\n\n\"Don't worry.\"\n\nHe managed a smile. Sticks looked skeptical.\n\n*At least I didn't lose any items.*\n\nThe experience loss hurt. 30.6% was brutal. His bar now sat at 2%. One more death and he'd lose a level. The setback made his teeth grind. But panic wouldn't help.\n\n*This is an opportunity.*\n\nHe might fail again. And again. But eventually, he'd crack the code. He'd beat the clone. And when he did, he'd be stronger for it.\n\n*I just need to figure out the trick.*\n\nTwenty-four hours. That's how long until Randy's cooldown reset. How long until his Legendary passive recharged. Grid couldn't challenge the 41st island again until then. He had time to prepare.\n\n*I need to understand Linked Kill Wave. And Pinnacle Kill.*\n\nThe combinations had worked for his clone. The order of activation wasn't wrong. He knew that much. So the problem lay elsewhere. Finding it was everything.\n\n\"Sigh.\"\n\nGrid exhaled slowly. Lowered himself to the ground. Cross-legged. Hands on his knees. He'd seen Regas do this before. Meditation. The concept seemed simple enough.\n\n*Focus. Think.*\n\nThe clone's movements. Every attack. Every combination. Grid replayed the battle in his mind. Frame by frame. Searching for the difference. What had his clone done that he couldn't?\n\n***\n\n\"Meditation is the act of transcending from the pain of the mind and returning to a pure state of mind, without any distortions. It is the best way to look at yourself, or to look at specific situations and find a solution.\"\n\nIn Reidan, Piaro sat before Lord Steim. The farmer had returned from the fields, soil still clinging to his clothes. Now he lectured the young boy on mental discipline.\n\n\"Meditation can also be used as a means to increase strength and stamina, and to reduce the cooldown of your skills. But humans are always self-centered. Meditation is a very challenging method of training that even the most famous knights find difficult. So young Lord, you don't need to practice it right away. It is sufficient to know the concept... Heok?\"\n\nPiaro's voice caught.\n\nLord. Grid and Irene's son. The boy had closed his eyes. His breathing slowed. Became rhythmic. Steady.\n\n*A perfect state of selflessness!*\n\nMana coiled around Lord's small frame. It moved with his breath. In and out. The boy's presence synchronized with the natural flow of energy in the air. Affecting it. Bending it.\n\nPiaro's chest tightened.\n\n*I only achieved Natural State after becoming a legend.*\n\nLord wasn't perfect yet. But he'd grasped the fundamentals. At his age. With no training. Some of the world's strongest warriors spent decades trying to reach this state. Many never did.\n\n*What will this child become?*\n\nPerhaps the only one capable of surpassing Muller. The Sword Saint. One of history's greatest legends.\n\n*He'll continue growing.*\n\nAnd in watching that growth, Piaro himself would gain new insights. New understanding. His heart burned with anticipation.\n\n***\n\n> [The skill 'Meditation' has been acquired!]\n\n> [Meditation]  \n> Increases health and mana regeneration rate by 50%, and stamina regeneration by 30%.  \n> Skill cooldown time will be reduced by 10%.  \n> Resource Consumption: None.  \n> Skill Activation Condition: Focus.  \n> * This isn't a skill that can be artificially invoked. It will activate automatically when your concentration is extremely high.\n\nIn Satisfy, certain skills emerged naturally. No quest. No teacher. Just the right conditions and the right state of mind. Meditation was one of them.\n\n*Good.*\n\nGrid acknowledged the notification. Then dismissed it. No celebration. No excitement. His focus remained absolute. The skill was useful. It would help. But right now, understanding his clone mattered more.\n\n*Think.*\n\nHe erased the notification from his thoughts. Returned to the memory of combat. Link. Kill. Wave. Pinnacle. His clone had used identical motions. The actions were the same.\n\n*But the results were different.*\n\nWhy? What separated success from failure?\n\n\"...Ah!\"\n\nFive hours had passed. Grid's eyes snapped open.\n\n*The timing.*\n\nThat was it. Linked Kill happened instantly. Link flowed into Kill without pause. But Linked Kill Wave... there had been a gap. A fraction of a second. Barely perceptible. But present.\n\nHe didn't know the exact interval. Not yet.\n\n*I'll figure it out.*\n\nGrid rose. Drew Grid's Greatsword. Took his stance. Link. Then Kill. With a slight delay between them. He executed the combination.\n\nLink triggered.\n\n*Gap's too long.*\n\nNo frustration. Just data. Grid adjusted. Shortened the interval. Tried again.\n\nFailure.\n\nAgain.\n\nFailure.\n\nAgain.\n\nThe timing had to be precise. Perfect. Threading a needle in the dark.\n\n*I'll keep trying until it works.*\n\nFailure wasn't shameful. Failure was information. Grid had lived his whole life failing. Debt. Jobs. Relationships. He understood failure intimately. And he understood that success was built on its corpse.\n\nHours blurred together. Grid attempted Linked Kill Wave over and over. Each failure refined his understanding. Each attempt brought him closer.\n\nSticks watched from a distance. A smile creased his ancient face.\n\n*Truly Pagma's Descendant.*\n\nPagma's Rare Book was legendary. Hidden. Nearly impossible to find. Yet Grid had found it. Sticks had suspected the young man possessed unusual tenacity. But witnessing it firsthand was different. Impressive.\n\nIn Sticks' eyes, Grid's future burned bright."
}