{
  "id": 387,
  "title": "Chapter 387",
  "content": "# Chapter 387\n\n> **[You have entered the 20th island.]**\n\nGrid stood on unfamiliar ground, checking his timer. Forty-five hours and nineteen minutes. That's how long it took him to punch through nineteen islands and arrive here. The versatile key he'd crafted had bypassed the treasure hunt mission entirely. The giant lightning rod had kept him safe from the thunderstorm stage. Other challengers wasted days on those obstacles.\n\nThe Overgeared members moved just as fast. Grid's intel from his previous 40th island run had given them the blueprint. They were right on his heels now, hitting the 20th island in record time.\n\n*The hell moon. We just need to avoid its gaze.*\n\nThey pulled out their invisibility cloaks in near-perfect synchronization. The fabric rippled as it bent light around their bodies, erasing their presence from the island. Above, the grotesque mass of eyes that was the hell moon rotated endlessly, searching. Finding nothing.\n\nGrid's strategy. Grid's items. Grid's victory.\n\n***\n\nThirty-nine days until the National Competition.\n\nKraugel stood motionless in his safe zone, weighing two impossible choices. He could re-challenge the Behen Archipelago. Skills and elixirs waited there, locked behind brutal trials. Or he could face Piaro again. Win that fight, and a legendary class would be his.\n\nEither path could make him unstoppable in the upcoming tournament.\n\n*Both paths will probably end in failure.*\n\nHis mental math was ruthless. Piaro? Thirty percent chance of victory. The Behen Archipelago? Even lower.\n\nThe 31st island haunted him. That cursed stage recreated past traumas at past power levels. It had dragged him back to sub-180, then thrown Great Demon Furfu at him. One of the demons that the Sword Saint Muller had defeated centuries ago.\n\n*Furfu.*\n\nKraugel had been confident back then. Arrogant, even. A great demon without a true body, possessing only an intermediate demon? Soloable. He'd been certain.\n\nReality had shattered that certainty. Three consecutive deaths. Furfu had chased him to the edges of the world, relentless and unkillable. If other players hadn't intervened, the death count would've been higher.\n\n*I can't clear the archipelago. Not as I am now.*\n\nThe admission tasted like bile. His thoughts drifted to Grid. The first player to ever defeat him. Grid had claimed to clear the 30th island, to overcome the trial of past nightmares.\n\n*That ability to transcend his own failures.*\n\nKraugel exhaled slowly and refocused. The East Continent. Exclusive White Swordsman items. Class-specific skills. Rapid leveling opportunities. The rewards weren't as flashy as legendary class changes or archipelago treasures, but they were guaranteed. Achievable.\n\n*I'll stay on the East Continent until the competition starts.*\n\nDecision made. He pulled the portal scroll from his inventory and activated it. Light consumed him.\n\n***\n\n\"This is bullshit.\"\n\nThe 41st island stretched out around Grid, featureless and flat. Three days of game time. That's how long he'd been attempting to fuse Linked Kill Wave with Pinnacle Kill. Three days of failure.\n\nThe timing was impossible. He'd tried every interval from 0.1 seconds to 3 seconds between activating Link and Kill. Nothing worked. The system kept spitting out Link by itself, or Linked Kill, but never the full Linked Kill Wave he needed as the foundation.\n\n*Three days.*\n\nFrustration coiled in his gut like a living thing. He'd given it everything. Maximum effort, maximum focus. And still, nothing. His fingers twitched with the urge to punch something.\n\n*But maybe it's not about timing between Link and Kill.*\n\nThat thought cut through the frustration like a blade. What if other conditions needed to be met first? Hidden triggers he hadn't identified?\n\n\"I need to fight the clone again.\"\n\nGrid knew the odds. He couldn't win. Not yet. But fear of failure was a poison that led to stagnation, and he refused to drink it.\n\nHe rolled his shoulders, loosening the tension. \"Let's go.\"\n\nThe gate pulsed with energy as he stepped through. Time to study his perfect copy. Time to decode Linked Kill Wave and Pinnacle Kill through observation and pain.\n\n***\n\n> **[You have entered the 41st island.]**\n> \n> **[A mission will be created.]**\n> \n> **[41st Island]**\n> \n> **Fight with yourself and win.**\n> \n> **First Clear Compensation: You can raise the level of one skill.**\n\nThe island was a disk of compressed dirt. No cover. No terrain advantages. Just flat ground stretching to a perfect circular edge.\n\nGrid's clone materialized ten meters away, an exact mirror down to the chipped edge on his helmet.\n\n\"Pagma's Swordsmanship.\"\n\nThe clone moved first. Identical to their last fight. Grid's muscles tensed.\n\n*Linked Kill Wave right out of the gate?*\n\nGrid locked his eyes on the clone's footwork. Every micro-adjustment of weight. Every shoulder rotation. He couldn't afford to blink.\n\n\"Transcended Link.\"\n\n*What?*\n\nGrid's brain stuttered. The clone had opened with a different skill. He recovered fast, shouting the same technique. \"Transcended Link!\"\n\nTwenty energy blades erupted from his position. Twenty more screamed toward him from the clone. The air between them became a meat grinder of condensed sword energy.\n\n**BOOM!**\n\nThe collision shook the island. Dust and pulverized earth fountained upward, creating an instant sandstorm. Grid squinted against the stinging particles.\n\n\"Kuk!\"\n\nHe backpedaled, vision compromised. The clone did the opposite. It charged straight into the sandstorm, eyes watering and bloodshot, but moving with absolute precision. <span class=\"rarity-rare\">Iyarugt</span> carved through the dust.\n\nGrid still had <span class=\"rarity-epic\">Grid's Greatsword</span> equipped. He couldn't read the demon sword's red trajectory lines.\n\n*Slash!*\n\nFire exploded across his thigh. Blood spattered the dirt. He swapped to his own Iyarugt, fingers fumbling.\n\n\"Wave.\"\n\nThe clone was already two steps ahead. It had switched back to Grid's Greatsword during Grid's weapon swap, and now the Wave skill erupted outward. Multiple impacts hammered Grid's body.\n\n*How is the weapon swap so fast?*\n\nGrid's mind raced even as pain signals flooded his nervous system. Swapping weapons required opening inventory, depositing the current item, selecting the new one, confirming. The process took him roughly two seconds. The clone had done it in under one.\n\n*Practice. It has to be practice.*\n\nHe forced optimism into his thoughts and surged forward with Iyarugt. The clone was using Grid's Greatsword now. That meant Grid had the advantage in this exchange. Iyarugt's red guidance lines showed him exactly where to strike.\n\n*Thud!*\n\nThe demon blade punched into the clone's ribs. Crimson light bloomed from the wound.\n\n*Keep the pressure on.*\n\nNo skills. Just raw bladework. Grid became a whirlwind of slashes, denying the clone any breathing room to activate techniques. It worked. The clone was forced into pure defense mode.\n\n*Clang! Clang!*\n\nIyarugt met Iyarugt. The demon swords screeched against each other, trailing bloody afterimages that hung in the air like spectral wounds.\n\n*Think. How do I create an opening?*\n\nGrid needed to break the stalemate, force the clone into a position where he could unleash a skill and regain control. While he calculated angles and timing, the clone raised one finger.\n\n\"Magic Missile.\"\n\n*Crack!*\n\n*Damn it!*\n\n**Magic Missile (Enhanced)** had a one-second cast time and only required a single finger gesture. The clone had fired it mid-sword exchange without breaking rhythm. Grid knew the technique was possible. The clone had simply thought of it first.\n\n*The AI is better at adapting than I am.*\n\nPain blossomed in his shoulder where the missile hit. The clone didn't waste the opening.\n\n\"Pagma's Swordsmanship.\"\n\nGrid watched through gritted teeth as the clone swapped weapons in a blur of motion. Grid's Greatsword materialized in its hands. The footwork of Link began.\n\nGrid tried to mirror it, calling his own greatsword. But the weapon swap ate precious fractions of a second. By the time Grid's Greatsword was in his hands, the clone had already completed Link's initial movements.\n\n*Shit.*\n\nGrid clenched his jaw, bracing for the impact. The pain would be legendary.\n\nExcept it didn't come.\n\nThe clone was still dancing.\n\n\"Kill.\"\n\nLink flowing into Kill.\n\n*Linked Kill!*\n\nRelief flooded Grid's system. If the clone had just used Link, Grid would've been destroyed. But the combination gave him time. Barely enough time.\n\n*Clack!*\n\nGrid yanked the <span class=\"rarity-legendary\">Perfect Divine Shield</span> from his inventory.\n\n\"Wave.\"\n\nGrid's eyes widened. *No.*\n\nThe clone merged Linked Kill with Wave. Linked Kill Wave. The fusion Grid had been struggling to master for three days.\n\n**RUMBLE!**\n\nEight separate waves of Kill energy materialized around the clone, converging on Grid's position like tidal forces made of blades.\n\n*I see it now!*\n\nUnderstanding crashed through Grid's mind. The secret was in the footwork. Before connecting each sword technique, the user had to step back. Reset their stance. Then flow into the next dance.\n\n*Finally. I can do this too.*\n\nHe committed every movement to memory. But observation time was over.\n\n*Whoosh! Whoosh! Whoosh!*\n\nEight Kills ripped through the air. Grid summoned Randy.\n\n\"Revolve!\"\n\n*Clang!*\n\nThe Doppelganger's Revolve technique created a vortex. The eight Kills were sucked in, spun around, and redirected back at the clone. The clone remained ice-cold calm. It summoned its own Randy, who executed an identical Revolve.\n\nWhile the two vortexes battled for supremacy, Grid's mind worked at maximum capacity. He internalized the precise timing. The exact moment to step back between Link and Kill. The specific rhythm needed to transition into Wave.\n\nHis feet moved. Step back. Ground the stance. Sword dance.\n\n**WHOOOOOM!**\n\nRaw power exploded outward from Grid's position. The unmistakable energy signature of Linked Kill Wave.\n\n*Yes!*\n\nJoy erupted in his chest. Then the doubled Kills, amplified by two Revolves, screamed toward him like artillery shells.\n\n**BOOM!**\n\nThe island shook. Dust geysered skyward. Massive damage? A failed technique? Grid crushed under his own inability?\n\nNo.\n\nGrid wasn't in crisis.\n\n\"Linked Kill Wave.\"\n\nThe clone spun, eyes searching. Grid had swapped positions with Randy using the doppelganger's Copy ability. He materialized at the clone's flank, already mid-technique. The best skill in his arsenal bloomed like a flower of annihilation.\n\n***\n\n**Glossary of Common Korean Terms:**\n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\n*Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.*"
}