{
  "id": 388,
  "title": "Chapter 388",
  "content": "# Chapter 388\n\n\"Linked Kill Wave.\"\n\nA thunderous crack split the air as Grid's blade ignited with power. The skill manifested like a physical force. Eight consecutive strikes of **Kill**, each woven through with the sweeping arc of **Wave**. The momentum was overwhelming. Legendary.\n\n> [The new skill fusion has succeeded.]\n>\n> [Your intelligence has increased by 10 due to the successful fusion of a new skill.]\n>\n> [Linked Kill Wave is added to the list of Pagma's Swordsmanship techniques.]\n\n> **[Linked Kill Wave]**\n>\n> Performs three sword dances simultaneously.\n>\n> Summons eight consecutive Kill attacks that inflict 1,500% attack power, chasing all objects within a 2m radius.\n>\n> The targets hit will have all speeds reduced by 50%.\n>\n> * This skill doesn't share a cooldown with Link, Kill, and Wave.\n>\n> Skill Mana Cost: 2,000\n>\n> Skill Cooldown Time: 20 minutes.\n\nA targeted skill dealing up to 12,000% damage. Single target or wide area, depending on the situation. The three-way fusion eclipsed the two-skill combinations by magnitudes. This was the power of a legend.\n\nThe violent storm of energy screamed toward the clone. Victory seemed inevitable.\n\nThen the clone moved.\n\n*Of course. It knows the same trick.*\n\nRandy materialized between the clone and the oncoming assault. Just as Grid had used the doppelganger defensively, so too could his mirror image.\n\n\"Kyaaak!\"\n\nThe copied Randy took the full brunt of **Linked Kill Wave**. Grey ash scattered where the doppelganger had stood.\n\nGrid's gaze snapped left, then right. His eyes darted behind him.\n\n*Where?*\n\nRandy's position-swap ability functioned like **Teleport**. The clone could emerge from any angle. Any blind spot. Grid activated the **Slaughterer's Eye Patch**, searching.\n\nA wave of malice crashed over him. Hatred. Killing intent. The air itself felt heavy with violence.\n\nThe clone was using **Kill**.\n\nGrid's mind raced. *Can't block this. Can't dodge.*\n\n\"Freely Move.\"\n\nThe skill from his **Secret Hero** title activated. A 200-meter range. One-hour cooldown. But it was a supreme evasion technique that negated all non-targeted attacks until he reached his destination.\n\nAir rushed past him.\n\nHe phased through the incoming strike and launched himself at the clone. \"Pinnacle.\"\n\nHis sword punched through the clone's chest. Blood sprayed.\n\nThe clone didn't flinch. **Pinnacle** carried the advantage of being targeted, guaranteed to land. But its power fell short of **Kill**. Against an opponent wearing Grid's full arsenal, it wasn't enough to secure a killing blow.\n\nSteel rang against steel.\n\nGrid caught the clone's counterattack on his blade. Equal stats. Equal equipment. In a head-on clash, neither could overwhelm the other. The duel became a test of precision and timing.\n\nTheir greatswords locked. Grid bared his teeth in a savage grin.\n\n\"Why don't you use Pinnacle Kill? Won't it be hard to beat me without that?\"\n\nSilence.\n\nThe clone said nothing. It was Grid, yet it wasn't. A puppet. An empty shell designed for a single purpose. To kill. No thoughts. No feelings. No words.\n\n\"Magic Missile.\"\n\n\"Magic Missile.\"\n\nThey spoke in unison. Through the crossed blades, they met each other's eyes and fired. The blue spheres collided between them, detonating. Both fighters flew backward from the impact.\n\n*This time we cast simultaneously.*\n\nA small victory. Before, Grid had been too slow. The clone had struck first, landing the spell unopposed. Progress.\n\nGolden light flared behind the clone's back.\n\nFour golden hands emerged, each clutching a weapon. The copied **God Hands**. The **Ideal Dagger**, the **Doppelganger's Greatsword**, **Failure**, and **Iyarugt**. Grid summoned his own in response.\n\nEight golden hands filled the space between them. Four behind Grid. Four behind the clone. Each wielding legendary armaments. The sight was absurd. A fraudulent existence by any normal standard.\n\n*How do I leverage the God Hands here?*\n\nGrid had hesitated to deploy them earlier for exactly this reason. What advantage could they provide when the clone could simply mirror the tactic? It would neutralize into a stalemate. Back to a one-on-one duel.\n\nThe clone moved.\n\nThe four golden hands began to spin. A circular formation. Each weapon lashing out in sequence, attacking Grid's **God Hands** with rhythmic precision. Rise. Strike. Fall. Rise. Strike. Fall. No gaps. No hesitation. The wheel formation was devastatingly effective.\n\nGrid's **God Hands** couldn't keep up. They were beaten back, neutralized, rendered useless.\n\n*This is possible!*\n\nGrid's commands to the **God Hands** were rudimentary. Attack. Defend. Wait. Occasionally he'd order them to grab something specific, but complex instructions were beyond him. The mental burden was too great. How could anyone maintain combat focus while micromanaging four independent weapons? It was impossible.\n\nBut the clone was different. Same stats. Same items. But optimized for battle. Its singular purpose, its entire existence, focused solely on killing Grid. Its concentration was absolute.\n\nThe clone's **God Hands** maintained their rotation without faltering. They struck Grid's hands with zero delay, triggering the stiffness effect in sequence, locking them down. Then the four golden weapons turned toward Grid himself.\n\nNot that they posed a real threat.\n\n*The wheel formation? Amusing.*\n\nThe **God Hands** only possessed **Intermediate Sword Mastery Level 2**. Grid deflected their attacks with minimal effort. But time was the enemy. While Grid dealt with the circling weapons, the clone closed the distance.\n\n\"Link.\"\n\nThe clone's greatsword became a blur. Multiple strikes. Rapid-fire.\n\nPain exploded across Grid's body. Blood misted the air. Only the intervention of his own **God Hands**, breaking free of their stiffness at the last moment, prevented catastrophic damage.\n\nGrid fired **Magic Missile** and backpedaled, reaching for a health potion. He never got the chance. The clone's **God Hands** swarmed him.\n\nSteel crashed against steel in rapid succession. Grid blocked. Parried. Deflected.\n\n*Strong.*\n\nThe gap in judgment and control was immense, even with identical stats and gear.\n\nA smile crept across Grid's face.\n\nHe was happy. There was still room to grow. Still higher peaks to climb.\n\n*I need to improve my control of the God Hands.*\n\nTwo revelations in one fight. A new skill fusion and a path to mastery of his golden weapons. Grid grinned and commanded his **God Hands** to grapple with the fakes. To lock them down.\n\nThe clone began the motions for **Pinnacle Kill**.\n\n*I have to watch.*\n\nGrid's concentration sharpened to a razor's edge.\n\nHis **God Hands** tightened their grip on the copied weapons. The command to 'hold' refined, more precise, more deliberate.\n\n\"Pinnacle.\"\n\nThe clone's sword began its arc.\n\n\"Pinnacle.\"\n\nGrid mirrored the movement with extreme focus.\n\n\"Kill.\"\n\nThe curved trajectory of **Pinnacle** snapped to a straight line. Grid matched it.\n\n\"Kill.\"\n\n> [The new skill fusion has succeeded.]\n>\n> [Your intelligence has increased by 10 due to the successful fusion of a new skill.]\n>\n> [Pinnacle Kill is added to the list of Pagma's Swordsmanship techniques.]\n\n> **[Pinnacle Kill]**\n>\n> Performs two sword dances simultaneously.\n>\n> Deals 2,000% of your attack power to a specified target.\n>\n> It changes the trajectory of the sword in the middle, making it hard to deal with.\n>\n> * This skill doesn't share a cooldown with Pinnacle and Kill.\n>\n> Skill Mana Cost: 2,000\n>\n> Health Consumed by Skill: 4,500\n>\n> Skill Cooldown Time: 5 minutes.\n\nTheir blades struck home simultaneously.\n\nBlood erupted from Grid's mouth and nose. Blood poured from the clone's mouth and nose. Half their health vanished in an instant. They raised their swords, making different calculations. The clone launched into **Linked Kill**. Grid summoned Noe to disrupt the assault.\n\n\"The best demonic beast of hell has emerged! Nyahahat!\"\n\nNoe's triumphant laugh cut short.\n\n**Linked Kill** slammed into the cat-shaped creature.\n\n\"Kyaak!\"\n\nEvery hair on Noe's body stood on end. He'd been enjoying his rest in the inventory. Now he was facing death within seconds of arrival. But Noe was a **memphis**. The greatest demonic beast of hell. Unmatched speed. And **Fluidization**, the skill that minimized physical damage.\n\nThe second strike of **Linked Kill** glanced off Noe's semi-liquid form. The cute demonic beast twisted away from the attack and opened his jaws wide.\n\n**Soul Ingestion**.\n\nThe most unreasonable skill in Noe's arsenal. It drained half the target's highest stat.\n\nNoe bit down on the clone.\n\n> [The effect of Soul Ingestion will increase your strength by 1,408 for the next minute.]\n\nPower surged through Grid's body. He'd been preparing to use **Linked Kill**, but he froze.\n\n*What if the clone can also summon Noe?*\n\nHis strength had temporarily spiked to 4,224. If the clone summoned its own Noe and used **Soul Ingestion** in return, the clone's strength would skyrocket. Grid visualized the scenario. The worst case. He couldn't commit to the attack.\n\n\"Stupid master! What nyang? Attack this guy! Nyang!\"\n\nNoe lunged at the clone, trying to compensate for his master's hesitation. Despite **Fluidization**, landing a fatal blow proved difficult. Grid heard Noe's frustrated cry and made his choice. He rushed forward.\n\n\"Linked Kill.\"\n\nThe strikes landed. Once. Twice. Three times. Four.\n\nThe clone didn't resist. It simply allowed the damage.\n\n*Why?*\n\nWhy didn't the clone summon Noe? Grid's confusion must have shown on his face. Sticks' voice cut through the battlefield, filled with admiration for the small creature.\n\n\"A memphis is the most perfect creature after a dragon, except for their personality. Even the mysterious Behen Archipelago can't reproduce a memphis.\"\n\nGrid exhaled.\n\n*If I'd known that earlier, I would've summoned Noe from the start.*\n\nThen again, maybe not. If he'd taken the easy path, he wouldn't have learned **Linked Kill Wave** or **Pinnacle Kill**. The struggle had forged new power. Grid allowed himself a small smile and retreated, opening the distance as much as possible."
}