{
  "id": 389,
  "title": "Chapter 389",
  "content": "# Chapter 389\n\nThe immortality passive lasted five seconds. Grid couldn't afford to trade blows during that window. He backpedaled, boots scraping against stone as he opened the gap between himself and the clone.\n\n*Once it ends, I'll strike. One clean hit to finish this.*\n\nRevenge. Sweet, simple revenge.\n\n*Frustrating, isn't it?*\n\nGrid's lips twisted into something ugly. The kind of smirk villains wore in bad movies. Then the clone sat down.\n\nGrid froze. *What?*\n\nThe clone lowered itself to the ground, legs crossing beneath it. Eyes sliding shut. Grid's confusion sharpened into alarm.\n\n*No. It can't be.*\n\nIce crawled down his spine. The clone's face, bloodless and drawn a moment before, was already filling with color.\n\n*Meditation!*\n\nThe skill activated when concentration peaked. Not something a person could trigger at will. But the clone was doing exactly that.\n\n*He can use it whenever he wants?*\n\nGrid's teeth clicked together. \"Damn it!\"\n\nHe activated Pagma's Swordsmanship, Transcend.\n\n**Kwa kwang! Kwa kwa kwa kwang!**\n\nEach swing of Grid's blade launched a crescent of compressed air. The energy blades screamed toward the clone. Three seconds. That was how long the sequence took. Three seconds for the clone to gulp down a super health recovery potion and rise to its feet.\n\nThe clone's sword moved. Transcend answered Transcend.\n\n**Pepepepeng!**\n\nEnergy blades collided midair. Most of Grid's attacks went wide. The clone's struck true.\n\n\"Ugh!\" Pain lanced across Grid's shoulder. His ribs. His thigh.\n\n*My accuracy is garbage compared to his.*\n\nThe clone fired while moving. Dodging. Weaving. A level of multitasking Grid couldn't match.\n\n*Launching attacks while evading. I can't do that.*\n\nGrid forced his breathing to steady. Panic wouldn't help.\n\n*The clone burned his immortality. Mine's still ready.*\n\nThat was an advantage. A real one. No reason to lose his nerve.\n\nGrid dismissed his greatsword. Iyarugt materialized in his grip, the bloodstone blade whispering strategy directly into his mind. The sword knew the best paths. It would compensate for his limitations.\n\n**Chaaeng! Chaeeeeeng!**\n\nSteel rang against steel. Grid pressed forward, trusting Iyarugt's guidance. For a handful of heartbeats, the duel felt even.\n\nThen the clone spoke.\n\n\"Pagma's Swordsmanship, Linked Kill.\"\n\n*No. Already?*\n\nMeditation didn't just restore resources. It reduced cooldowns.\n\n**Puk. Puk puk puk!**\n\nThe strikes came in a blur. Grid's God Hands lurched to intercept, but the clone's God Hands slammed them aside. Iyarugt guided Grid's parries, but not fast enough. Not precise enough.\n\nLinked Kill carved through his defenses.\n\n\"Kuuack!\"\n\nGrid's health bar plummeted. Doran's Ring pulsed, feeding him a trickle of recovery. Not enough. His vision flashed white as the immortality passive triggered.\n\nFive seconds of invulnerability. Grid lunged forward, murder in his eyes.\n\n\"You bastard!\"\n\nThe clone's feet left the ground.\n\nBraham's Boots. The Fly skill. Grid swapped his own footwear mid-stride, wings of invisible force unfurling from his heels. Too late. The clone was already a dozen meters away, and the gap widened with every second.\n\n\"Master, believe in me! Nyang!\"\n\nNoe blurred past Grid's shoulder, a black comet with stubby wings. The Memphis slashed at the clone, claws harder than tempered steel raking across the Holy Light Armor.\n\nSparks. Scratches. Nothing critical.\n\nThe armor held.\n\nThe second battle ended the same way as the first.\n\n> [You have suffered fatal damage!]\n\n> [You have died because health has dropped to 0.]\n\n> [You have lost 30.6% experience.]\n\n> [Your level has dropped to 305.]\n\n> [You have lost 10 stat points.]\n\n> [Mission failed!]\n\n> [Exiting the 41st island.]\n\n> [Moving to the last save point, the 40th island.]\n\n---\n\n\"Dammit!\"\n\nGrid's roar echoed across the 40th island. The level loss stung, but that wasn't what clawed at his pride.\n\n*I had Noe. The clone didn't.*\n\nAnd he'd still lost.\n\n\"Have strength, nyang.\" Noe patted Grid's shoulder with one paw. The gesture was small. Earnest.\n\n\"Wasn't Master originally weak and useless, nyang? Don't be frustrated by one or two losses, nyang!\"\n\nGrid stared at the cat.\n\nNoe measured strength against great demons. It was instinct for a beast born in hell. By that standard, Grid had always been pathetic.\n\n\"That isn't comforting at all.\"\n\nGrid was about to snap at Noe when a thought struck him. He turned to face the old man sitting cross-legged on a nearby rock.\n\n\"Sticks.\"\n\nThe sage opened one eye. \"Yes, Grid.\"\n\n\"Are you sure the 41st island can't reproduce a Memphis?\"\n\nSticks had explained it earlier. A Memphis ranked just below dragons. The Behen Archipelago couldn't replicate something that powerful.\n\nBut there was a hole in that logic.\n\n\"You said the archipelago can reproduce great demons and dragons. So why not a Memphis?\"\n\nSticks smiled. The expression was faint, carved into deep wrinkles. \"Good question.\"\n\nHe gestured toward the distant sea. \"The dragons and great demons reproduced here have something in common. Their bodies aren't complete.\"\n\nGrid frowned. \"Not complete?\"\n\n\"The great demons the archipelago copies were sealed by Sword Saint Muller. Weakened. Diminished.\" Sticks continued. \"The gourmet dragon that appeared during my trial wasn't a true clone. Dragons are ponderous creatures, bound by gravity and ritual. Reiders was an illusion. A fake.\"\n\nUnderstanding dawned. \"So the archipelago can only copy incomplete beings.\"\n\n\"Precisely.\"\n\n\"Then...\" Grid glanced at Noe. \"A weakened great demon or dragon is less dangerous than a Memphis?\"\n\n\"Perhaps. If the Memphis is an adult.\"\n\n\"Adult.\"\n\nGrid studied Noe. Round belly. Stubby wings. A single horn jutting from his forehead. He looked like a plush toy someone had glued accessories onto.\n\n*What would he look like fully grown?*\n\n\"Will he get as big as a dragon?\"\n\nSticks chuckled. \"No. There won't be much change in his appearance.\"\n\nRelief washed over Grid. \"Good.\"\n\nNoe's fan club existed because of his looks. Cute sold. Grid had plans for that. Fan meetings. Autograph signings. An excellent way to meet female fans and...\n\n*Not the time.*\n\nReality crashed back down.\n\nThe clone on the 41st island was too strong. Grid operated at half capacity while the clone exploited every advantage. There was no clear path to victory.\n\n*Unless my control improves drastically.*\n\nLearning never ended. He'd climb one mountain only to find a dozen more ahead, each peak occupied by someone mocking his struggle.\n\n*If I had talent like the Overgeared members...*\n\nThe geniuses adapted. Learned. Overcame. Their growth curves were vertical lines.\n\nGrid's was a gentle slope.\n\nPiaro had trained him personally. His guildmates offered constant advice. And he was still lacking.\n\nIt hurt. The knowledge that he had no talent.\n\nGrid stopped mid-thought.\n\n*Wait.*\n\nWhen had he become so obsessed with control?\n\n*Since meeting Piaro.*\n\nThat was when he'd realized control mattered. That raw stats wouldn't carry him forever. He'd thrown himself into practice. Drills. Repetition.\n\nBut was that the right path?\n\n*Even if I work as hard as them...*\n\nHe'd only reach twenty or thirty percent of their skill ceiling. The math didn't favor him.\n\n*I don't need to be obsessed with control.*\n\nWas he dull-witted? Maybe. But he was also Pagma's Descendant.\n\n*I'm a legendary blacksmith.*\n\nHe could craft any weapon. Use any equipment without restriction.\n\n*Return to the basics.*\n\nThe answer was items. It always had been.\n\nGrid's eyes lit up. He pulled the portable furnace from his inventory, along with hammers, tongs, and raw materials. His mind spun through possibilities.\n\n*To clear the 41st island...*\n\nHe couldn't just make something strong. If he forged a powerful weapon, the clone would use it too. That would only make things harder.\n\n*The item I need right now...*\n\nA gamble.\n\nPure talent couldn't overcome this trial. So Grid would appeal to the heavens.\n\n*My terrible luck. Let it curse the clone too.*\n\nHe thought of Euphemina. Her Rolling Dice skill generated random effects. Buffs. Debuffs. Chaos. If he could replicate that concept in an item...\n\n*Just wait, Clone.*\n\nVictory or defeat would hinge on fortune.\n\nHe only needed to win once.\n\n---\n\nBlood Carnival.\n\nThe guild's name was whispered in dark corners of message boards. A collection of unofficial rankers whose cruelty was legendary. Assassinations. Raid sabotage. Trade route ambushes. They moved for gold, and only gold.\n\nTheir victim list included dozens of top rankers.\n\nBehind a crimson veil, the guild master's smile was invisible but audible in their voice. \"There's a new request.\"\n\nSilence. The masked figures around the table leaned forward.\n\n\"Defeat Kraugel in the National Competition. The victor must display a specific company's logo on their gear during the match.\"\n\nMurmurs rippled through the room.\n\n\"Top-tier contract.\"\n\n\"Corporate sponsorship for advertising. The payout must be massive.\"\n\nKraugel was undefeated. A myth. If someone struck him down on the world stage with cameras broadcasting to every nation...\n\nThe publicity would be worth billions.\n\n\"Which event?\" someone asked.\n\n\"Any event where Kraugel loses will suffice. However, the pay triples if it happens in PvP.\"\n\n\"Then it has to be PvP.\"\n\n\"Is anyone participating in the National Competition?\"\n\nA figure stood. Confidence radiated from his posture. \"I am.\"\n\nThe guild master's veil shifted as they turned. \"Good. Make it memorable.\"\n\n---\n\n**Glossary of Common Korean Terms**: OG Glossary Link  \n**Current schedule**: 20 chapters a week  \n**Patreon**: Early access available"
}