{
  "id": 39,
  "title": "Chapter 39",
  "content": "# Chapter 39\n\nThe crowd roared for Euphemina. Grid's jaw clenched as their cheers washed over him. *They want to see me fail. Fine. I'll shove it down their throats.*\n\nHe finished smelting and grabbed his hammer. The steel rang out under his first strike.\n\n*Ttang! Ttang!*\n\nEuphemina's eyes widened. She glanced at her own furnace where the ore still bubbled. *Too fast. He's too far ahead.*\n\nOf course he was. She wasn't a blacksmith. She forced her breathing to steady. *Don't rush. Panic leads to mistakes.*\n\nBy the time she pulled the smelted steel from her furnace, Grid had already cycled through quenching and forging multiple times. She reached into her inventory and withdrew a hammer that had cost her a small fortune.\n\n> **[<span class=\"rarity-epic\">Blessed Blacksmith Hammer</span>]**\n>\n> Rating: Epic\n>\n> Durability: 299/300\n>\n> Attack Power: 50~70\n>\n> **Odds of Making a Rare Rated Item: +15%**\n>\n> **Odds of Making an Epic Rated Item: +5%**\n>\n> A hammer used by a prestigious blacksmith. It will assist the user in creating higher rated items.\n>\n> User Restriction: Level 150 or higher. More than **100 Strength**. Intermediate Blacksmith Skill.\n\n> [You can't equip it because you don't meet the item usage conditions.]\n\nHer strength was sufficient. Her level was high enough. But the intermediate blacksmith skill requirement blocked her. *Not for long.*\n\nShe turned toward Grid. His shoulders were hunched over the anvil, completely absorbed in his work. She activated Skill Observation.\n\n*If we both have the same blacksmith skill, the better tool wins.* She eyed Grid's hammer. Old. Battered. Pathetic compared to hers.\n\nVictory was certain.\n\nThen the notification window appeared.\n\n> [The level of Skill Observation is too low.]\n>\n> [You can't analyze the skill of the target.]\n\n\"What?\"\n\nHer Skill Observation was **Level 7**. She had analyzed third advancement NPCs without issue. An advanced blacksmith had only required **Level 5**. \n\n*This can't be right.* Her fingers trembled as she activated the skill again.\n\n> [The level of Skill Observation is too low.]\n>\n> [You can't analyze the skill of the target.]\n\n\"Skill Observation!\"\n\n> [The level of Skill Observation is too low.]\n>\n> [You can't analyze the skill of the target.]\n\nHer mana pool drained with each failed attempt. The same message mocked her every time.\n\n\"This is a bug. It has to be.\" She clenched her fists. \"Skill Observation!\"\n\n> [The level of Skill Observation is too low.]\n>\n> [You can't analyze the skill of the target.]\n\nThe color drained from her face.\n\n*No. He can't actually have advanced blacksmith skills.* The first ranked blacksmith in the entire game was only intermediate level. This nobody couldn't possibly surpass the rankings. Craftsmen were rare even among NPCs.\n\n*Unless...* \n\nHer stomach dropped. *Hidden class. He has a hidden class.*\n\nNothing else explained it. Production class rankings across the board topped out at intermediate. The most renowned NPC blacksmiths only reached advanced, and craftsmen were nearly mythical.\n\nFor an ordinary user to possess craftsman skills was impossible. *He's not ordinary. He has a blacksmith class above epic rating.*\n\nShe bit her lip. *Not rare. I can copy rare class skills with my epic class. This has to be epic minimum. But only Agnus, Katz, and I have epic classes. Unless...*\n\n*Unique class. When did a unique class even appear?*\n\nHer confidence shattered. She had accepted an unknown difficulty quest without proper preparation.\n\n*Competing against a unique class. I'm insane.*\n\nHer hands hung uselessly at her sides. *What now? I can't make an item without blacksmith skills. I know the theory, but the result will be garbage without the system assistance.*\n\n*Give up? Again?*\n\nFirst the Agent of Revenge quest. Now this. Her throat tightened.\n\nGrid's voice cut through her spiral. \"What's wrong? Frozen solid?\" He smirked at her. \"Jealous of my skills, are you?\"\n\nHeat flooded her face. Anger chased away the despair.\n\n*I won't lose to this arrogant fool!*\n\nShe needed blacksmith skills. Now. *Where can I find a blacksmith?* Her gaze swept across the crowd.\n\n*Wait.*\n\nShe turned and caught Rabbit's attention. He approached with cautious steps.\n\n\"Is there a problem?\"\n\nEuphemina leaned close and lowered her voice. \"Who taught Grid? His mentor. Bring them on stage and have them assist Grid with the dagger.\"\n\nRabbit's eyes narrowed. \"Why? Explain yourself.\"\n\nShe glanced away. \"It's personal. I can't say more. But this gives me a better chance to win.\"\n\n\"Hmm.\"\n\nRabbit stroked his chin. The game had started. Changing the rules now would cause an uproar. *But I have no alternatives.*\n\n\"I'll see what I can do.\"\n\nRabbit whispered to the host, who cleared his throat and shouted toward the audience.\n\n\"Mr. Khan! Come to the stage! Miss Erina wishes to add your strength to Grid's!\"\n\n\"What?\"\n\nGrid's hammer stopped mid-swing. The crowd erupted.\n\n\"Wait, Erina wants two against one?\"\n\n\"That Grid guy must be terrible! She's taking pity on him!\"\n\n\"She's saying they need to team up just to compete with her!\"\n\n\"Such confidence! What a woman!\"\n\nThe spectators surged with renewed adoration for Euphemina. She basked in their worship like a benevolent queen. Grid's face flushed red. His knuckles went white around the hammer handle.\n\n*That manipulative...*\n\nKhan climbed onto the stage and placed a hand on Grid's shoulder. \"Calm yourself. This is an opportunity. Let's work together as she requested.\"\n\nGrid jerked away. \"You think I'll lose to her?\"\n\n\"Of course not. I believe you can defeat anyone.\" Khan's voice was steady. \"You're Pagma's Descendant, aren't you?\"\n\n\"Then why go along with this?\"\n\n\"I respect you as a blacksmith. Working beside you would be an honor.\" Khan gestured at the anvil. \"My heart aches to stand idle while you fight for my smithy. This is a request. I won't burden you. Please, allow me this chance to defend my home alongside you.\"\n\nGrid's anger wavered. *He's sincere.*\n\n\"Fine. Together, we'll crush her in front of everyone.\"\n\n\"Yes!\"\n\nKhan's face lit up with joy at the prospect of working alongside Grid before such a crowd.\n\n\"I'll demonstrate my best skills as your assistant! Give the command.\"\n\nAs Khan prepared his tools, Euphemina activated Skill Observation.\n\n> [You have successfully analyzed 'Advanced Blacksmith's Craftsmanship' Lv.2.]\n\n*Perfect.* She smiled.\n\n\"Skill Duplication!\"\n\n> [You have successfully duplicated 'Advanced Blacksmith's Craftsmanship' Lv.2.]\n>\n> [The skill 'Advanced Blacksmith's Craftsmanship' Lv. 2 is available to use once. You can keep it permanently until it is used.]\n\n*The outcome depends on chance now.* Even if Grid had superior skills, randomness determined item ratings. And she had the <span class=\"rarity-epic\">Blessed Blacksmith Hammer</span>.\n\n*I still have a chance.*\n\nShe gripped the hammer and turned to her anvil. The metal waited."
}