{
  "id": 390,
  "title": "Chapter 390",
  "content": "# Chapter 390\n\nAmong unofficial rankers, who stood as the ultimate predator? Ask the masses and they'd say Grid. His achievements spoke for themselves.\n\nBut every world harbored its own immutable law: those who lurked in the shadows often eclipsed the famous. In Satisfy's darker corners prowled players far more dangerous than Grid.\n\nTarma was one such creature.\n\nA PKer since Satisfy's earliest days, Tarma had carved a bloody path through the game's history. His record spoke volumes. The crowning jewel of his career?\n\n\"Zibal. Second on the unified rankings.\" Tarma leaned back, arms crossed. \"Died screaming to me.\"\n\nTrue, every word. His PK skills were unmatched—the product of a hidden class designed purely for player killing. Even Kraugel, the reigning god of Satisfy, would bleed out if Tarma caught him alone.\n\n\"Tarma can handle this,\" one executive said.\n\n\"If he enters PvP, he'll cruise to the finals.\"\n\nThe Blood Carnival executives nodded to each other. Top rankers? Overgeared members? None of them could survive a one-on-one against Tarma in his element. Their confidence was well-placed.\n\n\"Though...\" Another executive scratched his jaw. \"Beating Kraugel in the finals is another matter entirely.\"\n\n\"Kraugel's special.\"\n\n\"He's not a genius. He's something beyond that. Only Agnus and the twins in our guild can—\"\n\n\"Shut the fuck up.\" Tarma's voice cut through the room like a blade. He turned to the veiled figure at the head of the table—the Blood Carnival's master. \"Tell the client this: I, Tarma, will kill Kraugel. Also, I want a bonus for every celebrity I slaughter in PvP.\"\n\n\"Understood.\"\n\nBehind his veil, the master smiled. They all did. Tarma's skills were that reliable.\n\n***\n\n> **[Legendary Blacksmith's Creation Skill]**\n>\n> You can create three equipment item production methods every time the skill level of 'Legendary Blacksmith's Craftsmanship Skill' increases.\n>\n> **Number of items that can be created at present: 13/21**\n>\n> *When items are produced using this skill, the name of the creator is automatically placed on the item.*\n\n\"Legendary Blacksmith's Creation.\"\n\nGrid activated the skill.\n\n*Ttiring.*\n\n> **[What item do you want to create?]**\n\n*I need something that relies purely on luck.* Grid drummed his fingers on his thigh. *Against that bastard clone, it's my only shot.*\n\nNot a sword. He was sick to death of making swords.\n\n*It's just a random item anyway. Something I'll barely use. Might as well make it fun.*\n\nBut the weapon couldn't be unwieldy. Low accuracy was off the table.\n\n*What's fun, different, and guaranteed to hit?*\n\nGrid thought back to his bout with Piaro. That cursed flail the farmer had used—a farming tool for threshing grain, with three or four long stems dangling from a pole. When Piaro swung it, the flexible stems made it impossible to predict the strike zones.\n\n*Hard to avoid.*\n\nA wicked smile crept across Grid's face.\n\n*That damn clone... I'll let you taste how dirty this feels.*\n\n\"I want to create a flail.\"\n\n\"What?\"\n\nSticks straightened from where he'd been observing. \"The Legendary Blacksmith's Creation is Pagma's trump card. Limited uses. You need a convincing reason to waste it on *farming equipment.*\"\n\nGrid felt heat rise to his face. *Because I want a high hit rate. And... because getting beaten by farming equipment will feel humiliating. The clone will hate it.*\n\nHe cleared his throat. \"I have my reasons.\"\n\nSticks' stare bored into him.\n\nGrid turned back to the system window.\n\n> **[Have you decided on a flail?]**\n\n*Yes.*\n\n> **[What materials would you like to use?]**\n\nGrid's mind drifted to the gift Silverun had pressed into his hands before he'd left Reidan for the Behen Archipelago—right after the alchemist had granted an option to Iyarugt.\n\n\"I heard you're heading somewhere dangerous.\" Silverun had shuffled closer, clutching a bottle filled with suspicious liquid. \"I'll pray for your safe return.\"\n\nGrid had eyed the bottle warily. \"What is this? Trying to poison me because I called alchemy useless?\"\n\n\"It's a mystery potion.\" Silverun's grin had been manic. \"I poured all my knowledge into it.\"\n\n\"Meaning?\"\n\n\"I have no idea what it does.\"\n\n\"*What?*\"\n\n\"A random effect triggers when used! That's the beauty of alchemy—the uncertainty! If you're in crisis, drink it. Who knows? The results might save you.\"\n\n*This man is insane.* Grid had lost all remaining faith in alchemy that day. He'd vowed never to use that liquid.\n\nNow, days later, he was betting everything on it.\n\n\"The materials are Silverun's Secret Remedy and black iron wood.\"\n\n> **[Have you decided?]**\n\n\"Yes.\"\n\n> **[Please design the item.]**\n\nA blank blueprint materialized before him. This was Grid's ninth item creation. His hands moved with practiced efficiency.\n\n*Piaro's flail is the ideal model.*\n\n*Suksak suksak.*\n\nThe design taking shape on the blueprint mirrored Piaro's weapon almost exactly. Time passed. Grid reviewed the final sketch, nodded, and pressed confirmation.\n\n> **[Have you decided? When you complete the blueprint, the number of available creation skill will decrease by one.]**\n\n\"I have.\"\n\n> **[A great work of art has been completed.]**\n>\n> **[One skill count has been consumed.]**\n>\n> **[Please describe the characteristics of the item.]**\n\nGrid paused. He knew from experience that flowery descriptions poisoned an item's potential. Keep it precise. Functional.\n\n\"Designed with black iron wood for excellent elasticity and attack power. Sharp edges like steel blades. Silverun's Secret Remedy is integrated, triggering a random effect with each strike.\"\n\n> **[It has been applied.]**\n\nThe blueprint shifted, refined by the system's compensation effect. The perfected design emerged moments later.\n\n*Perfect.*\n\nThe flexible pole measured 1.3 meters, with four stems dangling from the head—sharp and menacing as daggers. It looked more like farming equipment than a weapon, which only made Grid's grin wider.\n\n*The look on the clone's face when he gets beaten by a farming tool...*\n\n> **[Please name the item.]**\n\n\"Motley Flail.\"\n\n\"...Why?\" Sticks' voice dripped with disbelief.\n\nGrid ignored him. The completed item data appeared:\n\n> **[Motley Flail]**\n>\n> **Rating:** Unique ~ Legendary\n>\n> **Unique Rating Information:**\n>\n> **Durability:** 259/259 | **Attack Power:** 143~191\n>\n> * A special effect will occur every time the target is hit. The effect is unpredictable.\n> * Thrashing speed will increase by **150%**.\n> * There is no guarantee how the condition of the thrashed grain will change.\n>\n> **Legendary Rating Information:**\n>\n> **Durability:** 307/307 | **Attack Power:** 218~275\n>\n> * A special effect will occur every time the target is hit. The effect is unpredictable.\n> * Thrashing speed will increase by **200%**.\n> * There is no guarantee how the condition of the thrashed grain will change.\n>\n> *Farming equipment designed by Grid, who has been reborn as a legend.*\n>\n> *It's made of solid black iron wood and has excellent durability and attack power. It's at a level to be called a weapon.*\n>\n> *However, the effects can't be guaranteed due to the influence of Silverun's Secret Remedy. Use with caution. It is recommended that you don't use it.*\n>\n> **User Restriction:** Level 200 or higher.\n>\n> **Weight:** 109\n\n\"Black iron wood is expensive, but...\" Grid shrugged. \"Maybe I'll give it to Piaro as a gift.\"\n\n*If this works, Piaro's going to love—*\n\nGrid cut the thought short. No need to jinx it.\n\n***\n\nAfter creating the Motley Flail, Grid logged out for rest. When he returned, his condition was optimal.\n\n\"Please give me a legendary item.\"\n\nHe'd already produced ten legendary items, triggering the second special event. Now, additional stats only came from legendary crafts. Naturally, Grid hoped the flail would roll legendary rating.\n\n*And I wonder what happens at the third special event.*\n\nDuring his extended stay in Reidan, crafting over a thousand Mass Production Grid Sets, two legendary items had emerged by chance. Three more legendary items stood between him and the third milestone. Despite the risk of penalties, Grid craved that moment. The benefits would outweigh any drawback.\n\n*They always do.*\n\n\"Now then.\"\n\n*Ttang! Ttang! Ttang!*\n\nGrid was, at his core, a blacksmith. His expression grew more alive with each hammer strike against the anvil.\n\nSticks watched him work, unease coiling in his gut.\n\n*He has the composure of a legend, I'll give him that. But I don't trust this.*\n\nA legendary blacksmith crafting farming equipment. Named the *Motley Flail*, no less. Sticks shook his head. Grid had clearly given up on conquering the Behen Archipelago.\n\nHis heart sank at the thought."
}