{
  "id": 391,
  "title": "Chapter 391",
  "content": "# Chapter 391\n\nThe flail was a swinging tool. Stabbing or cutting with it? Impossible. That's why Grid chose black iron wood as the material.\n\n*Resilience is what matters for this type of weapon.*\n\nBlack iron wood was 'bent iron.' High rigidity, high elasticity. Typically used for spears, and expensive as hell. The rankers and knights of every kingdom needed spears made of black iron wood if they wanted to compete.\n\n*In other words, it's top-tier material.*\n\nBuying it had hurt his wallet. Still, Grid believed the finest materials were the only acceptable choice for his creations. He was a legendary blacksmith. How could he work with garbage?\n\n*The expenses, though. Damn.*\n\n**Ttang! Ttang!**\n\nGrid swallowed his bitterness and hammered the black iron wood into submission. First, a 1.3-meter pole. Then four long sticks attached to the end. The pole's width fit comfortably in his grip. The slender branches? Trimmed sharp and thin.\n\n*This feels right.*\n\nShaving. Combining. Repeating the process. Grid examined the shaped sticks and anticipated greatness. A legendary item, surely.\n\nBut the system disagreed.\n\n> [You have completed the production of the <span class=\"rarity-unique\">Motley Flail</span>.]\n\n> [<span class=\"rarity-unique\">Motley Flail</span>]\n> \n> Rating: Unique\n> \n> Durability: 259/259 | Attack Power: 143~191\n> \n> * A special effect will occur every time the target is hit. The effect is unpredictable.\n> \n> * Thrashing speed will increase by 150%.\n> \n> * There is no guarantee how the condition of the thrashed grain will change.\n> \n> Farming equipment designed by Grid, who has been reborn as a legend.\n> \n> Made of solid black iron wood, it boasts excellent durability and attack power. The quality approaches that of a weapon.\n> \n> However, the effects cannot be guaranteed due to the influence of Silverun's Secret Remedy. Use with caution. It is recommended that you do not use it.\n> \n> User Restriction: Level 200 or higher.\n> \n> Weight: 109\n\n\"...Shit. Just a little bit more.\"\n\nWould it kill the universe to grant his wishes once? Just once?\n\nSticks didn't notice Grid's frustration. \"That's a fine flail. Excellent farming equipment, it seems.\"\n\nThe sarcasm was obvious. *Why is he making farming tools?*\n\nGrid straightened. \"This isn't farming equipment. It's a weapon. I'm using this to break through the 41st island.\"\n\n\"A weapon?!\" Sticks's eyes widened in admiration.\n\nGrid's spirit was remarkable. Using a flail as a trump card? Sticks was a sage, after all. A wise man. He tried to understand Grid rather than dismiss him as eccentric.\n\n*There must be profound reasoning behind this.*\n\nThat didn't mean he felt confident about it, though.\n\nSticks watched Grid grab the hammer again.\n\n*I'll gift the Unique-rated one to Piaro.*\n\nOne more attempt.\n\n*I need a Legendary-rated flail!*\n\n**Ttang! Ttang!**\n\nGrid pledged himself to the forge and started on the spare black iron wood. He achieved the desired form. Added Silverun's Secret Remedy.\n\nThe result?\n\nAnother Unique-rated flail.\n\n\"...This fucking $%!#.\"\n\nIt had been ages since he'd cursed like this. His thinking power had expanded. His personality had matured. But his essence? Unchangeable. A year and a half since becoming Pagma's Descendant.\n\nOnly 12 legendary items in all that time.\n\nEven a saint would rage.\n\n*Why can't a legendary blacksmith make legendary items?*\n\nProbability-based bullshit. Grid recognized it once again and forced himself to calm down.\n\n*Okay. Breathe. I don't need a legendary flail to clear the 41st island.*\n\nTrue. Grid didn't want the flail for attack power. He only needed the random effect to create a reversal. A legendary rating would've been nice for the special event and stat boost, but obsession led to ruin.\n\n\"Time to practice.\"\n\nTwenty-one hours had passed creating and crafting the flail. Grid needed to master it in the next three hours, until the cooldown on his immortality reset and Noe and Randy returned.\n\n---\n\n**The 41st Island**\n\n\"Bring it on.\"\n\n\"...\"\n\nThe clone stared at Grid. It saw the flail in his hands and paused, puzzled. As an entity possessing 100% of Grid's abilities, it found the weapon choice... strange.\n\n> [<span class=\"rarity-unique\">Motley Flail</span>]\n> \n> ...\n\n\"...\"\n\nThe clone checked the flail's options. Its confusion deepened.\n\n*An inefficient weapon.*\n\nWhy would he choose this? The clone questioned it briefly, then dismissed the thought. The clone's purpose was singular: hurt Grid. Questioning the behavior of someone about to die was pointless.\n\n\"Pagma's Swordsmanship.\"\n\n**Teong!**\n\nThe clone surged forward. Its movement was dazzling, like butterfly wings. The precursor to Link.\n\n**Pit!**\n\n**Pipipipipit!**\n\nThe clone unleashed its assault. Sharp energy blades erupted from <span class=\"rarity-epic\">Grid's Greatsword</span>, slicing toward Grid. Twenty-four hours ago, Grid would have dodged and countered. But now? He'd regained his original judgment.\n\nThose swords flying at him?\n\n*I won't block them!*\n\n**Pepepepeok!**\n\nBlood misted around Grid's body as Link tore through him. Why didn't he defend? Simple: faster counterattack. Grid absorbed the enemy's strike and swung the flail.\n\n**Hwiririk!**\n\n\"...!\"\n\nThe clone's eyes widened. It had been hit. Grid's speed was incomparably faster than expected, throwing its calculations into disarray.\n\n**Peeok!**\n\nThe flail cracked across the clone's face. A sound like a bursting watermelon. Blood scattered, but the appearance was deceptive. The four thin sticks were sharp enough to trigger bleeding, but the actual damage? Low.\n\nBut damage wasn't the point.\n\n**Ssik!**\n\nGrid's mouth curved upward.\n\n\"Let's see what happens!\"\n\nThe <span class=\"rarity-unique\">Motley Flail</span> triggered a random effect on hit. Buff or debuff. The worst case? Buffing the target.\n\n*A debuff won't help much.*\n\nGrid knew. The clone was identical to him. Debuffs wouldn't have significant impact. Still, the reason Grid fought with the flail was simple: belief.\n\n*It'll have a definite effect, not a simple debuff...!*\n\nFor example: reducing the target's health to 1 point. Maxing out the weight gauge. These weren't classified as debuffs, so Grid's resistances wouldn't save him.\n\n> [The effect of the <span class=\"rarity-unique\">Motley Flail</span> is triggered!]\n\nThe flail activated immediately after striking the clone. A flash of light.\n\n> [The target's attack power will double for 10 seconds.]\n\n\"...\"\n\nGrid had prepared himself. An unlucky bastard like him, relying on random effects? The odds of a positive outcome were lottery-level. But even so, this was excessive.\n\n*If its attack power doubles...!*\n\nGrid backpedaled as the clone's greatsword moved.\n\n**Seokeok!**\n\n\"Kuak!\"\n\nA basic attack. The impact felt like a skill. Grid's eyes shook as devastating damage tore through his health bar. Still, he didn't forget to retaliate.\n\n> [The effect of the <span class=\"rarity-unique\">Motley Flail</span> is triggered!]\n> \n> [The target's maximum health will triple for 10 seconds.]\n\n> [The effect of the <span class=\"rarity-unique\">Motley Flail</span> is triggered!]\n> \n> [The target's skill damage will increase by 20% for 10 seconds.]\n\n> [The effect of the <span class=\"rarity-unique\">Motley Flail</span> is triggered!]\n> \n> [Grants a shield spell to the target.]\n\n> [The effect of the <span class=\"rarity-unique\">Motley Flail</span> is triggered!]\n> \n> [The target has been affected by the silence state.]\n> \n> [The target has resisted.]\n\n\"Ah, seriously!\"\n\nGrid's fury mounted as the battle dragged on.\n\n**Pisik.**\n\nThe clone sneered. The first emotion it had shown.\n\n\"You bastard...!\"\n\nGrid's teeth ground together. At a glance, it looked like he'd lost his reason. But reality was different. Grid had anticipated this. He was prepared to die a few more times. He kept striking the clone, activating the flail's effect over and over.\n\nThe clone, meanwhile, grew careless. The flail's effects continuously favored him. He stopped avoiding Grid's attacks, pressing his advantage instead.\n\n> [You have suffered fatal damage!]\n> \n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\nGrid's health bottomed out. He'd tried to generate more effects by speeding up his attacks with Blackening, Blacksmith's Rage, and Quick Movements, but it only helped the clone.\n\n*No choice. I'll have to get lucky on the next attempt.*\n\nGrid surrendered this round. He cleared his mind and wielded the flail. The clone didn't bother dodging anymore. The odds of the flail threatening him were like finding a needle in a desert. The clone's AI was impressively high, truly.\n\nThe concept of 'chance' meant nothing to it. The clone mocked him through action.\n\n**Peeok!**\n\n\"...!\"\n\nRight before Grid's immortality passive expired, the clone took a flail strike to the face. Grid was even more shocked than his opponent.\n\n> [The effect of the <span class=\"rarity-unique\">Motley Flail</span> is triggered!]\n> \n> [Change health values with the target.]\n\n\"...!\"\n\nThe clone's confusion was instant. It scrambled for a potion.\n\n\"Where do you think you're going?\"\n\nGrid smiled with savage satisfaction and kicked the clone's abdomen. The clone's health dropped to 1, triggering its immortality state.\n\n\"I can't miss this opportunity.\"\n\nGrid's declaration rang out. He summoned Noe and Randy.\n\nThe moment to end this long battle had arrived.\n\n---\n\n**Glossary of Common Korean Terms**\n\nOG: Glossary Link\n\nCurrent schedule: 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}