{
  "id": 392,
  "title": "Chapter 392",
  "content": "# Chapter 392\n\n*Really long...*\n\nGrid had been trapped on the 41st island for five days. Most players would have cut their losses the moment they acquired their new skills and moved on.\n\nThat was the rational choice. What player in this world could stomach repeated deaths? Maybe one in ten thousand. The higher the level, the more cautious players became—the more they had to lose.\n\nBut Grid wasn't wired like other people. He was obsessed with overcoming his inadequate talent. Persistent to a fault. For Grid, giving up was poison. That stubbornness, that refusal to quit, was the only reason he could stand beside geniuses.\n\nGrid wiped sweat from his brow. \"Well, it ended sooner than expected.\"\n\n*I didn't know the Motley Flail would be the key from the start.*\n\nHe'd braced himself for multiple deaths. A grinding war of attrition. Yet the best outcome had occurred in the very first fight.\n\n*Maybe God has a conscience after all.*\n\nWas the universe finally throwing him a bone after all the bad luck?\n\nGrid allowed himself a grin as he swapped to <span class=\"rarity-unique\">Grid's Greatsword</span> and approached the clone. The bastard was locked in the immortal state—five seconds of invulnerability. Grid stayed alert, wary of the **Meditation** passive, but he was grateful the clone had burned its trump card.\n\nHe raised his sword. \"**Pagma's Swordsmanship, Linked Kill Wave.**\"\n\n**KRAKOOM!**\n\nEight stormy energy blades erupted from Grid's sword and surged toward his duplicate. The clone had lost its immortal passive. It needed to press the advantage during these five seconds. Grid knew what was coming.\n\nThe clone mirrored his stance. \"**Pagma's Swordsmanship, Linked Kill Wave.**\"\n\n*Here it comes.*\n\nCompared to the best artificial intelligence, Grid's skill development was sluggish. Normally, executing **Linked Wave Kill** was beyond him—the technique still felt clumsy in his hands. But the power of prediction was a hell of a thing. Grid had anticipated the clone's move and succeeded in unleashing the skill simultaneously.\n\n**KRAKRAKOOM!**\n\nTwo storms of blade energy collided. The shockwave detonated between them like a bomb going off. The ground beneath Grid's feet bucked. Out at sea, the water churned into chaos.\n\nGrid's eyes widened. \"Noe! Randy!\"\n\n\"Nyaang!\"\n\n\"Yes!\"\n\nA tsunami was building—a wall of water that threatened to swallow the entire island. Noe's wings blurred as he shot toward the clone. Randy materialized beside him, activating **Link**. Noe opened his jaws wide, attempting to devour the clone's stats.\n\nThe clone wasn't slow.\n\n\"**Blackening. Blacksmith's Rage. Quick Movements.**\"\n\n**BOOM!**\n\nDark magic exploded outward from the clone's body. The concussive force sent Noe and Randy tumbling through the air. The clone's form blurred, closing the distance to Grid in an eyeblink.\n\n\"Kuk...!\"\n\nLightning-fast. Grid staggered backward as **Iyarugt** punched through his chest, the blade piercing his heart. If the tsunami hadn't crashed over both of them at that exact moment, the clone would have chained into a lethal combo.\n\n**CRASH!**\n\nThe wave slammed into Grid and the clone, dragging them both toward the island's edge. Grid was already moving. He swapped <span class=\"rarity-unique\">Grid's Boots</span> for <span class=\"rarity-unique\">Braham's Boots</span> and activated **Fly**, escaping the water's brutal grip.\n\n\"Heok... heok...\"\n\nGrid hovered above the churning sea, soaked to the bone. He laughed between gasps for air. Below him, the clone's face twisted with impatience. Less than two seconds remained on the immortality.\n\nThe clone's hands moved. \"**Magic Missile.**\"\n\n**PEWPEWPEWPEW!**\n\nFour fake **God Hands** materialized and launched glowing projectiles at Grid. Simultaneously, the clone activated **Transcended Link**. \n\nGrid responded with **Revolve**.\n\nThe clone hesitated. \n\n*Why would he use Revolve first when it's unconditionally disadvantageous?*\n\nConfusion flickered across the clone's face. It started to activate **Revolve** in response.\n\n**FLASH!**\n\n\"...!!\"\n\nA beam of light struck the clone from below. The bastard had been focused on the approaching **Transcended Link**, completely missing the real threat. The attack came from the sea—from the exact spot where the clone was hovering.\n\nA **Magic Missile** erupted from beneath the surface. The moment the tsunami had hit, Grid had left one of his **God Hands** submerged in the water. Waiting for this exact moment.\n\n\"Ack...!\"\n\nThe clone stumbled backward. Its face went pale. Blood leaked from the corner of its mouth. The AI clearly couldn't process what had just happened—using terrain, placing items, baiting with a flashy skill while the real attack came from an unexpected angle. \n\n*Ridiculous.*\n\nGrid closed the distance. \"Haven't I grown? It's all thanks to you. You've helped develop me quite a bit.\"\n\nHe drove <span class=\"rarity-unique\">Grid's Greatsword</span> through the clone's throat.\n\n\"Kuaaaaak!\"\n\nThe clone's scream echoed across the island as it dissolved into grey particles.\n\n> [System] You have won the fight against yourself!\n\n> [System] You have succeeded in clearing the 41st island!\n\n> [System] You have acquired 1 **Skill Level Point** from the mission clear reward.\n\nGrid's expression soured as he checked his status window. The 42nd island had cost him a staggering **61.2% experience**. His level had dropped to **305**. Recovering that much experience would take at least twenty days of grinding. The time loss was enormous.\n\nBut Grid didn't feel cheated. He'd gained **Linked Kill Wave** and **Pinnacle Kill**—two of the strongest skills in his arsenal. And the combat experience? Priceless.\n\n\"Very good.\"\n\n*This is strength that transcends level.*\n\nA sense of pride settled over Grid's features. A new notification appeared.\n\n> [System] You have overcome your limitations and have taken one step closer to being a legend.\n\n> [System] One of **Pagma's Descendant's** hidden pieces, **'Sealed Ability'**, has been acquired.\n\n> [System] The skill **'Blacksmith's Eyes'** has been acquired.\n\nGrid's pulse quickened. So far, he'd unlocked three hidden pieces. The first had granted him a **10% reduction in skill cooldown time** and the **Item Modification** skill. The second had given him **Item Combination**. The third, **Minerals Strengthening**.\n\n*It's been a while since the last one...*\n\n**Blacksmith's Eyes?** Grid pulled up the skill description.\n\n---\n\n**[Blacksmith's Eyes]**\n\nYou can see some of the abilities and options when looking at the target item. Limited to equipped items.\n\n* The closer the distance to the target item, the better the analytical power.\n\n---\n\n\"In short...\" Grid muttered. \"An item observation skill that works on equipment I don't own.\"\n\n*So I can see what armor and weapons the enemy is using?*\n\n\"...?\"\n\nGrid frowned. \n\n*What's the point of this skill? Why would I care about checking items?*\n\nHe stood there for a moment, processing. Then his eyes widened.\n\n\"Heok—isn't this broken?\"\n\n*This is a huge scam.*\n\nBeing able to see the details of an enemy's gear before a fight? He could identify trump cards hidden in their equipment before they used them. Exploit weaknesses. Counter their builds.\n\n\"Kuoh...\"\n\nGrid's fists clenched. His body trembled. He couldn't contain the surge of satisfaction rushing through him.\n\n\"I like it when Grid is happy,\" Randy said.\n\n\"Me too, nyang,\" Noe added.\n\nBoth of them were smiling. Grid reached down and stroked their heads. Nearby, Sticks watched the trio with an amused expression.\n\nThere was one fact Grid had completely overlooked. His clone had died in the **Blackening State**. The present Grid had no idea that this variable would provide a fun—and unexpectedly positive—environment for him later.\n\n---\n\n**[Skill Level Point]**\n\nIncreases the skill level of a specified skill by **100%**.\n\n---\n\n\"Hm.\"\n\n*Raise the level of any skill?*\n\nIt would be smart to raise the level of his most powerful fusion skills—**Linked Kill Wave**, **Pinnacle Kill**, **Transcended Link**, or **Linked Kill**. Unfortunately, fusion skills didn't have a level concept. They were so powerful the system already judged them as complete.\n\n*Better to raise the level of Kill, then.*\n\nGrid paused. \n\n*No, wait. Maybe not.*\n\nHe couldn't decide hastily.\n\n*It might be better to raise Legendary Blacksmith's Craftsmanship Skill.*\n\nThe choice felt too important to rush. Grid decided to save the skill point for later. \n\nSticks approached him. \"Do you want to move on to the next island?\"\n\nGrid nodded without hesitation. \"I will.\"\n\nThirty-six days remained until the National Competition. Grid planned to clear the entire Behen Archipelago before then. He quickened his pace.\n\n> [System] You have entered the 42nd island.\n\n> [System] You have entered the 43rd island.\n\n> [System] You have entered the...\n\nThe trials of overcoming himself seemed to have ended. The 42nd through 49th islands featured standard missions—monster hunting, boss raids.\n\n*This is comfortable.*\n\nThe monsters inhabiting the islands in the 40s weren't weak by any stretch. They were just laughably easy compared to fighting his own clone. Grid's momentum carried him straight through to the 50th island without breaking stride.\n\n---\n\nBraham, who had mastered magic while being a direct descendant of **Shizo Beriache**, had once been regarded as a legend. Close to claiming the title of the strongest. \n\nNow?\n\nAfter losing his body and becoming a soul, he was weak. Miserable. The glory of the past was nowhere to be found.\n\n*Dammit...! Dammit!*\n\nThe **1st Great Demon, Baal.** That monster's contractor was one of the few beings capable of fighting a dragon. And he caused Braham trouble every single time.\n\n*It can't happen again this time.*\n\nBraham had gone looking for his body sealed at the **Sword Grave**, only to be weakened by **Agnus**. The irritation of his soul losing strength gnawed at him. His thoughts turned to Grid.\n\n*Pagma's Descendant will be able to do it.*\n\nJust as **Pagma** had possessed the power of a great demon.\n\n**FLASH!**\n\nBraham's soul squeezed out every scrap of remaining magic power and triggered detection magic across the entire continent.\n\nHe was searching for Grid."
}