{
  "id": 393,
  "title": "Chapter 393",
  "content": "# Chapter 393\n\n\"Dammit!\"\n\nChris slammed his fist against the table. The 3rd ranked user's pride towered as high as the heavens themselves. How could it not? Among two billion players, only two stood above him. Low self-esteem would be the true anomaly.\n\nChris acknowledged his limits with exactly two people. Kraugel and Grid. Kraugel overwhelmed him with terrifying growth speed and impossible physical prowess. Grid possessed a legendary class beyond mortal craftsmanship.\n\nEveryone else fell below.\n\n*I can't believe Zibal jerked me around.*\n\nChris gritted his teeth. Zibal ranked one spot higher, true. The man had fought evenly with Piaro at the gathering. But objectively? Zibal excelled at politics, not combat. He belonged beneath Chris in raw strength.\n\nYet that same man had made a fool of him.\n\nThe memory burned. Zibal raising doubts at the seven guild summit. Chris's credibility crumbling before the other leaders. His pride had shattered like cheap glass. Only one remedy existed.\n\n*I need to crush him. Completely.*\n\nThe Giant Guild had once reigned supreme. Past tense. The Reinhardt golem invasion had gutted their strength. Now they ranked somewhere in the top three among the seven guilds. Maybe.\n\nA direct clash with the Snake Guild carried no guarantees. Worse, Zibal's allies would pile on. The entire Giant Guild risked isolation if Chris moved carelessly.\n\nOne option remained.\n\n*The National Competition.*\n\nAll seven guilds would gather there. Zibal. Seuron. The others who'd sided against him.\n\n*I'll trample every last one of them.*\n\nChris clenched his jaw hard enough to grind teeth. He was still one of the world's strongest, farmer defeat notwithstanding. His true weapon wasn't his level. Not his control. Not even his items.\n\nIt was **Tyrant**, his unique-rated second class.\n\nThat power would be his salvation.\n\n***\n\nSecond classes changed everything.\n\nHuroi understood this truth intimately. Before acquiring **Apostle of Justice's Partner**, his combat ability had been pathetic. An orator fought with words, not steel. Books made poor weapons. Every crisis had forced him to rely solely on his silver tongue.\n\n\"Hah... Hah...\"\n\nThe 31st island of the Behen Archipelago recreated past trials. Huroi's current nightmare? Being thrust back to level 73 with only his base orator class.\n\nThirteen grey-mane wolves circled him. Level 85. Vicious attack power. Blinding speed.\n\n*This is impossible.*\n\nHe had no sword. No second class skills. His stats were garbage.\n\n*How did My Lord overcome trials like these?*\n\nThe thought of Grid steadied Huroi's racing heart. His master had endured worse and emerged victorious. That fact alone proved Grid's greatness.\n\n*I pledged him my absolute loyalty. I won't bring shame to that oath.*\n\nHuroi straightened his spine. Courage flooded his veins. If words were his only weapon, then words would suffice.\n\n\"Your mother was a fox!\"\n\nThe wolves froze.\n\nTheir mother... a *fox*? The insult struck deep.\n\n\"Awooooo!\"\n\n*Bark! Bark bark!*\n\nRage consumed the pack. Huroi's **Spiteful Tongue** shredded their mental states, plunging them into shock.\n\n\"Your father had a yellow mane!\"\n\n\"You're nothing but dogs!\"\n\n\"I turned your ancestors into jerky!\"\n\nThe verbal assault descended into mudslinging so crude that any listener would cringe. But Huroi fought with everything he had.\n\n***\n\n\"Haha.\"\n\nOne month until the National Competition. Chairman Lim Cheolho finally had time to review the rankings after weeks buried in administrative work. He pulled up Grid's recorded footage from the 41st island.\n\nWas he impressed by Grid's growth? Not particularly. The Legendary Blacksmith's steady progress had become predictable. No, something else caught Lim Cheolho's attention.\n\nThe clone. Grid's clone had died while in the Blackening state. According to system protocols, it should have dissolved instantly.\n\nInstead, it had fallen into Hell.\n\n\"The clone became an independent entity, completely separate from Grid...\"\n\nLim Cheolho frowned. Had a bug slipped through?\n\nHe'd created Satisfy, true. But not alone. To build something this vast with minimal errors, he'd delegated core operations to the supercomputer Morpheus. The clone's persistence after Blackening ended troubled him.\n\nHe queried the system.\n\n> **[MORPHEUS]:** It isn't a bug. Z10B005 isn't a user. Therefore, he isn't subject to the rules of Blackening and Hell.\n\n\"Hrmm... This situation is very interesting.\"\n\nHell trembled at the arrival of Grid's clone. What changes would ripple through that realm? How would the clone evolve now that it existed independently?\n\nLim Cheolho's excitement built. He couldn't wait to see what unfolded.\n\n***\n\n> [You have entered the 50th island.]\n\n> [This is a save point. Would you like to register?]\n\n> [You have been registered. When you enter the Behen Archipelago later on, you will start from the 50th island.]\n\nGrid had tasted brutal adversity on the 41st island. Since then, he'd blazed through the next nine islands in record time. Victory brought no satisfaction.\n\n\"The mobs are over level 360.\"\n\nEach island raised the monster levels. The 49th island spawned enemies between 360 and 370. At least 55 levels above Grid. Their base stats were exceptional. Their defense frustrated him. Fighting five-on-one against such creatures would leave ordinary rankers speechless.\n\nGrid found it lacking.\n\n*The stronger they get, the slower I hunt.*\n\nHe pulled up his mental calculations. One month in reality. Ninety days in Satisfy. Could he reach the 66th island before the National Competition if this difficulty curve continued?\n\n*Doubtful.*\n\n\"I need Fog Island.\"\n\nGrid checked his accumulated challenger points. 18,851. Enough to purchase the Weapons Mastery skill book and fifty-one elixirs.\n\n*Fifty-one elixirs.*\n\nEquivalent to fifty-one levels worth of stats. With Weapons Mastery and those elixirs, the Behen Archipelago's monsters would fall far more easily.\n\n*I can finally balance strength and agility one-to-one.*\n\nPiaro's stat distribution. Grid remained convinced that copying the legendary farmer's build would unlock new heights of power.\n\n*I won't imitate anyone else. Only Piaro.*\n\nSince Satisfy's launch, Grid had met only three beings who truly awed him. Vampire Duke Marie Rose. Great Magician Braham. And Piaro. Logic dictated that mimicking Piaro's distribution would yield strength.\n\n\"Huhuhut!\"\n\n*Ttang! Ttang!*\n\nGrid hammered away at his damaged equipment, laughter spilling freely. He imagined reaching Fog Island. Claiming his hard-earned rewards. Ascending to new power.\n\nHe'd forgotten something crucial.\n\nHis wishes rarely manifested as intended.\n\n***\n\n> [You have entered the 51st island.]\n\n> [A mission will be created.]\n\n> **[51st Island]**  \n> Defeat 10 golden crowns in 20 minutes.  \n> First Clear Reward: 1,900 Challenger Points.\n\n*Golden crowns?*\n\nGrid had never encountered this monster type. The name itself was unfamiliar.\n\n\"What fresh hell is this?\"\n\nDespite his complaint, Grid's expression remained bright. Time attack missions played to his strengths. With his overwhelming attack power, speed clears were practically guaranteed.\n\n*Kkirik. Kik.*\n\nThe island was small, rock walls rising in every direction. Grid prepared to activate Fly and search for his targets. Then he paused.\n\nScratching sounds echoed from nearby.\n\nGrid drew the **<span class=\"rarity-legendary\">Blue-Black Grid's Greatsword</span>** and dropped into a combat stance.\n\n\"Kyak!\"\n\nA monster wearing a golden crown crashed down from the rock wall. Its massive club swung toward Grid's skull in the same motion.\n\n*Chaaeng!*\n\nGrid swept his greatsword horizontally, blocking the strike. He stepped forward into the monster's guard.\n\n*It hits like a truck.*\n\nThe impact rattled his bones. The damage was absurd for a basic attack. Nearly skill-level force. A clean hit would cost him at least 6,000 health.\n\n\"Doesn't matter.\"\n\nGrid had faced countless powerful enemies since becoming Pagma's Descendant. Common monsters like these? Trivial.\n\n\"Pagma's Swordsmanship.\"\n\n*Chaaeng!*\n\nHe deflected the club and closed the distance.\n\n\"Kill!\"\n\n*Puok!*\n\nThe greatsword pierced the monster's heart. Green, bumpy skin split around the golden crown on its head. Perfect accuracy.\n\n> [You have dealt 1 damage to the target.]\n\n\"What?\"\n\nGrid's eyes widened.\n\n\"Kyaooooh!\"\n\nThe golden crown counterattacked immediately.\n\n*Jjejeong! Jjejejeok!*\n\nConfusion would paralyze most players in this situation. Watching your strongest skills deal negligible damage tended to shatter confidence. But Grid possessed something valuable.\n\nExperience with the impossible.\n\n*I've dealt with worse.*\n\n*Jjeejeeeong!*\n\nThe greatsword and club collided with a piercing shriek. Grid grimaced at the ear-splitting sound but kept his composure. His mind raced, analyzing the situation.\n\n*Every monster has a weakness.*\n\nHe just needed to find it."
}