{
  "id": 394,
  "title": "Chapter 394",
  "content": "# Chapter 394\n\n*Kill only did 1 damage. This isn't just physical defense. They have resistance to physical attacks. The status resistance is also high.*\n\nGrid pulled up the skill window.\n\n> **[Kill Lv. 6 (57.1%)]**\n> \n> A killing sword that expresses hatred.\n> \n> Deals 1,800% of your attack power to a single target. There will be a bleeding and desperation effect.\n> \n> **Skill Usage Conditions:** Have a sword type weapon equipped.\n> \n> **Skill Mana Cost:** 1,000\n> \n> **Skill Stamina Consumption:** Consumes 20% of your stamina.\n> \n> **Skill Cooldown Time:** 380 seconds\n\nLike all skills, Kill grew stronger with each level. Resource consumption decreased. Cooldown shortened. Power increased. Against the level 360-370 monsters inhabiting the 40's islands, Grid's Kill deleted more than 60% of their health bars in a single strike.\n\nThe golden crown took 1 damage.\n\n*I need to confirm this.*\n\nThe creature raised its club overhead. Grid's mind raced even as he braced for impact.\n\n**Crack!**\n\n> **[You have suffered 6,360 damage.]**\n\n\"Ugh.\"\n\nThe blow rattled his teeth. One-tenth of his health, gone.\n\n*Can't underestimate these things.*\n\nAt level 300, strength granted 7 health per point. Stamina gave 25. Add the 6,000 from the <span class=\"rarity-legendary\">Holy Light Set</span>, 3,000 from the Man who has Touched Hell title, another 3,000 from <span class=\"rarity-epic\">Tiramet's Belt</span> and <span class=\"rarity-unique\">Tiramet's Shoulderguards</span>. Grid's total health pool sat at roughly 63,000.\n\nSix thousand damage from a basic attack.\n\n*Focus.*\n\nGrid advanced. He thrust Pinnacle toward the golden crown's center mass.\n\n> **[Pinnacle Lv. 3 (15.9%)]**\n> \n> A sword that expresses the essence of a warrior god.\n> \n> Deals 780% of your attack power to a single target. This skill will ignore 62% of the target's armor.\n> \n> **Skill Usage Conditions:** Have a sword type weapon equipped.\n> \n> **Skill Mana Cost:** 700\n> \n> **Skill Cooldown Time:** 143 seconds\n\n**Slash!**\n\nThe blade carved through the air. Momentum sufficient to bisect the creature. The wide chest split open.\n\n> **[You have dealt 1 damage to the target.]**\n\n*As I thought.*\n\nThis green bastard with its golden crown resisted physical attacks. Pinnacle ignored 62% of armor. It still dealt 1 damage.\n\n*Their weakness must be...*\n\nMagic. Basic Satisfy logic. Enemies immune to physical damage were vulnerable to magic. Those immune to magic crumbled to physical force. Party composition 101.\n\nWarriors hit hard but lacked spell power. Magicians hurled devastating spells but folded in melee. Synergy was mandatory.\n\nGrid, however, didn't need a party.\n\nNot because of his legendary class. Because of Braham.\n\n\"Magic Missile.\"\n\n> **[Magic Missile (Enhanced) Lv. 2 (37%)]**\n> \n> A magic missile developed by the legendary great magician who has completely overturned the activation formula.\n> \n> It boasts tremendous power, but consumes a lot of resources.\n> \n> It deals damage equal to twice your current magic power to the target. It also ignores the enemy's magic resistance.\n> \n> **Resource Consumption:** 380 Mana.\n> \n> **Skill Casting Time:** 1 second.\n> \n> **Skill Cooldown Time:** 4.8 seconds\n\n**Crack!**\n\nA lance of light punched through the golden crown's heart.\n\n*Good.*\n\nMagic Missile's greatest strength was speed. One second cast time. Grid smiled as the creature stumbled.\n\n> **[You have dealt 1 damage to the target.]**\n\n\"What?\"\n\nIt resisted physical **and** magic attacks?\n\nThe golden crown's club smashed into Grid's ribs.\n\n> **[You have suffered 6,160 damage.]**\n\n\"This really hurts.\"\n\nGrid wore the <span class=\"rarity-unique\">Slaughterer's Eye Patch</span>. His ability to read attack patterns was excellent. But the golden crown was level 380. Its physical capabilities dwarfed the level 305 Grid. The level difference penalty compounded the problem.\n\nGrid couldn't fully track the creature's movements. A second blow connected. A third. He stumbled backward.\n\n\"Kiyaaak!\"\n\nThe golden crown pressed its advantage. The club swung in a wide arc.\n\n**Crack!**\n\n*Damn monster.*\n\nSeventeen minutes and one second remained. He needed to kill 10 golden crowns in 20 minutes. He couldn't even kill one in three.\n\nGrid's jaw tightened.\n\n*Stay calm.*\n\nHe'd faced worse. Learned from every mistake.\n\n**Clang! Clang!**\n\nGrid parried the onslaught with measured precision.\n\n*Physical attacks don't work. Magic attacks don't work.*\n\nHow do you kill the unkillable?\n\n\"Ah!\"\n\nGrid blocked a strike aimed at his collarbone. Memory sparked.\n\n*Mimic!*\n\nMimics disguised themselves as treasure chests to ambush greedy adventurers. Their defining trait was the 'resist all damage' passive. Grid had encountered one, exactly once.\n\n*Every attack dealt 1 damage.*\n\nBut mimics weren't invincible. Their maximum health ranged from 10 to 120 depending on level. One damage per hit meant nothing against single-digit health pools. Just hit them repeatedly.\n\nThe golden crown was a mimic variant.\n\n*Low health. Just need volume.*\n\nGrid swapped <span class=\"rarity-legendary\">Grid's Greatsword</span> for <span class=\"rarity-legendary\">Iyarugt</span>. Attack speed over raw power. He activated Link.\n\n**Swish!**\n\n**Swish-swish-swish-swish-swish!**\n\n> **[Link Lv. 7 (61.2%)]**\n> \n> A dazzling sword dance that is like the wings of a butterfly.\n> \n> Deals 800% of your attack power to a single target.\n> \n> **Skill Usage Conditions:** Have a sword type weapon equipped.\n> \n> **Skill Mana Cost:** 300\n> \n> **Skill Cooldown Time:** 60 seconds\n\nLink's hit count scaled with attack speed. With <span class=\"rarity-legendary\">Iyarugt</span>, Grid could land 25 strikes.\n\n> **[You have dealt 1 damage to the target.]**\n> \n> **[You have dealt 1 damage to the target.]**\n> \n> **[You have dealt 1 damage to the target.]**\n\nThe rapid hits locked the golden crown in place. Continuous stiffness prevented movement. Grid capitalized with Continuous Stab, the skill from reserve training.\n\n**Thud!**\n\n**Thud-thud-thud!**\n\nFive stabs pierced the creature's torso. The God Hands orbited Grid's position, weapons flashing in coordinated assault.\n\n*Should be enough.*\n\nGrid believed the health bar had plummeted.\n\nHe checked.\n\n\"What.\"\n\nDespite his efforts and the God Hands' contributions, the golden crown's health bar remained full.\n\nThe golden crown wasn't a mimic.\n\n*Try something else.*\n\n**Crack!**\n\nThe club caught Grid's face mid-thought.\n\n**Boom!**\n\nPain exploded through his skull. Grid flew backward and slammed into a boulder.\n\n\"Kilkil!\"\n\nLaughter echoed above his head.\n\n*No.*\n\nGrid froze. He looked up slowly.\n\nThree more golden crowns perched on the rocks, staring down at him.\n\n*The worst.*\n\nOne golden crown was impossible. Now he faced four.\n\n*Going to die to trash mobs. Not even a boss.*\n\nIn the beginning, Grid died to rabbits. That felt like a lifetime ago. Since becoming Pagma's Descendant, death by common monster was unthinkable.\n\nThe psychological damage hit harder than the club.\n\n*There has to be a way.*\n\nThe three golden crowns leaped from their perch.\n\nFortunately, they lacked coordination. The God Hands intercepted separate attacks, buying Grid precious seconds to think.\n\nHe couldn't find an answer.\n\n*Should I just give up and die?*\n\nHe'd barely recovered the experience lost to the clone. Now he'd lose it again?\n\nUnacceptable.\n\n*Better to forfeit the mission and survive.*\n\nGrid prepared to summon Randy and Noe.\n\nA voice spoke in his mind.\n\n**[The name is golden crown. The body isn't the green monster. It's the crown on its head.]**\n\nGrid's hand froze.\n\n\"You?\"\n\nAn impossible presence manifested. Grid jerked his head toward the sky.\n\nA faint soul hovered in the air. Pale. Translucent.\n\nBraham's soul.\n\n**[Pagma's Descendant is playing around in the playground that Pagma made.]**\n\nBraham's voice, once infinite in power and confidence, sounded weak. Diminished.\n\n*He still hasn't found his body? What happened?*\n\nWhy was he here at all?\n\nQuestions flooded Grid's mind, but the golden crowns demanded his attention. He ducked under a club from the front, sidestepped another from behind, and slashed at the crown atop a green creature with <span class=\"rarity-legendary\">Iyarugt</span>.\n\n> **[You have dealt 5,900 damage to the target.]**\n\n*That's how you kill them.*\n\nThanks to Braham, Grid saw the path forward.\n\nBut the mission was still impossible. Twelve minutes and 59 seconds remained. He'd discovered their weakness, but killing 10 in that time frame was unrealistic.\n\nBraham's soul pulsed.\n\n**[Accept my soul once again. This time for longer than before.]**\n\nA notification appeared.\n\n> **[You have received a Hidden Quest.]**\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}