{
  "id": 395,
  "title": "Chapter 395",
  "content": "# Chapter 395\n\n*A playground made by Pagma?*\n\nGrid's brow furrowed. The Behen Archipelago—the Hall of Fame—had existed for ages, hadn't it? The timing didn't match up if Pagma had created it.\n\n*Wait.* His stomach churned. *Does he mean Pagma made the 'Contaminated' version?*\n\nThe pieces clicked together with sickening clarity. *In other words, the bastard who ruined the Behen Archipelago... is Pagma?*\n\nGrid's jaw clenched. Everything he'd learned about Pagma had filtered through Braham's biased lens. He didn't trust Braham completely—the vampire had his own agenda—but Grid had developed a grudging respect for the legendary blacksmith.\n\n\"And why the hell should I let you possess me again?\" Grid dodged a wild club swing, his greatsword deflecting another. \"Did you fail to recover your original body?\"\n\n*What kind of scam is this?* Braham had promised resurrection if Grid crafted the Vessel of the Soul. That was the deal.\n\n**CLANG! CRASH!**\n\nThe golden crowns' assault intensified while Grid tried to interrogate the soul fragment. Four of the parasitic monsters coordinated their attacks with disturbing precision. Grid parried desperately, boots scraping against stone as he gave ground. The God Hands—useless. Their **Beginner Sword Mastery** couldn't keep pace with level 380 monsters moving with this kind of coordination.\n\nBraham's voice echoed in his mind, condescending as always. *[The golden crown is a parasitic organism that commandeers other monsters as hosts. It has no limitations when controlling the body, which makes its overall combat effectiveness superior to monsters of equivalent level. Your current abilities are insufficient to overwhelm them. Accept my soul.]*\n\n\"Stop spouting orders like you own my body.\" Grid snarled, cleaving through a club that got too close. The weapon shattered, splinters raining down. \"You don't get to make demands. Answer my damn questions first.\"\n\n*Never again.* The memory of Braham's possession still made him cringe—the arrogant proclamations, the edgelord philosophy, all spilling from *Grid's* mouth while he sat helpless in his own skull. The humiliation alone was unbearable. Worse was the violation of losing bodily autonomy, reduced to a passenger in his own flesh.\n\n**FWOOM!**\n\nGrid activated **Pagma's Swordsmanship, Restraint**. The air thickened, an oppressive weight crushing down on the golden crowns. Their wild movements stuttered for three precious seconds.\n\nHe didn't waste the opening. \"**Magic Missile!**\"\n\nA translucent projectile materialized and shot toward the furthest golden crown. It struck dead center, detonating with a sharp crack. The host monster—some kind of ape—screamed as its ribcage crumpled inward.\n\nBut it didn't die.\n\n\"Kekekekek!\" The golden crown's laughter was shrill, manic.\n\n\"Tch!\" Grid's face twisted.\n\nBraham had called it. These parasites gave zero shits about their hosts' wellbeing.\n\nThe damaged ape lurched forward with movements that defied anatomy. Its arm rotated a full 360 degrees, wielding the club like a helicopter blade. Muscles tore audibly. The elbow joint shattered, jagged bone erupting through gray skin—and the crown *used the sharpened fragments as secondary weapons*, slashing at Grid's guard.\n\n*What the actual hell.* Grid's stomach turned. The wrongness of it all scraped against his instincts.\n\n*[Those trivial questions plaguing you—accept me, and the answers will follow naturally. You will also resolve this crisis with ease.]*\n\n> **[A quest has been created.]**\n\n> **[Legendary Great Magician]**  \n> **★ Hidden Quest ★**  \n> Braham has failed to recover his original body. He seeks refuge in a secure location to restore his depleted magic power, and has selected your body as that sanctuary.  \n> If you accept Braham's soul, you will gain formidable power.  \n> **Quest Acceptance Reward:** Affinity with Braham +50%. Acquire the legendary second class **'Legendary Great Magician'**.\n\n*Legendary... second class?*\n\nThe words hit Grid like a hammer to the skull. His vision swam. This was insane. Genuinely insane.\n\nA second class was already rare as hell. Since Huroi became the first to unlock one, the rumor mill said fewer than a hundred users had managed it. Most got Normal-rated classes. The number who'd scored anything higher? You could count them on one hand.\n\nA *legendary* second class? That was uncharted territory. Theoretical. The kind of thing that existed only in fever dreams and forum speculation.\n\nBut here it was. Dangling in front of him.\n\n*A legendary blacksmith AND a legendary great magician...* The possibilities cascaded through Grid's mind, each more intoxicating than the last. His hands trembled on **Failure's** hilt.\n\nSticks, who'd been silent this entire time, finally spoke up. His tone was grave. \"Grid, I don't know if you're aware, but Braham isn't human. He's a vampire—one of the nine direct descendants of Shizo Beriache. Don't be deceived simply because he's a legend. You may become his host, identical to those golden crown monsters.\"\n\nThe sage's words were earnest, almost pleading.\n\nGrid turned to stare at him. His expression was flat, unimpressed. \"Funny how the guy who stood around watching me get clubbed to death suddenly has advice.\"\n\nThe truth of Braham's nature didn't bother him. Vampire, human, whatever—Grid had seen too much shit to be hung up on someone's species. Braham had helped him. That counted for something.\n\nSticks flinched as if slapped. \"I'm called a sage, but my knowledge isn't omniscient. I had no information about the golden crowns, so I couldn't provide guidance. It wasn't malicious neglect.\"\n\n\"Relax. I'm not trying to guilt-trip you.\" Grid waved him off, already dismissing the conversation.\n\nHe summoned **Noe** and **Randy**, the black cat materializing with an indignant yowl and the doppelganger forming from shadow. Grid launched back into combat, dividing his attention between the golden crowns and Braham's hovering presence.\n\n\"Braham.\" Grid stabbed **Failure** through a crown's host, pinning it to the ground. \"If I accept your soul, will you hijack my body like last time?\"\n\n*Because if that's the case, fuck your legendary class.* No amount of power was worth becoming a meat puppet. Grid had grown paranoid—cautious in ways his past self never was. Every deal had a catch. Every gift had strings.\n\nBraham's response carried a note of... respect? *[No. Your flesh will remain yours if you accept me. I will not seize control of your body unless you explicitly desire it.]*\n\n\"So it's like... a mental connection?\" Grid bisected another golden crown. The host collapsed in two pieces, black ichor pooling. \"We'd be able to share thoughts? Communicate internally?\"\n\nIt sounded bizarre. Intimate in an uncomfortable way. Braham wasn't trustworthy enough to let him that close.\n\n*[Currently, I am severely weakened. If I establish a spiritual rapport with you, I risk being influenced—even absorbed—by your consciousness. True rapport is impossible unless I assume control of your body.]*\n\nGrid nodded slowly. That was... acceptable. \"How long are you staying?\"\n\n*[A minimum of one year.]*\n\n\"Give me a real answer. Maximum duration.\"\n\n*[...Four years.]*\n\nOne to four years. Satisfaction time, obviously. Meaning Grid would have this legendary second class temporarily, and then lose it.\n\nHis jaw tightened. *It's too short.*\n\nThe thought of suddenly losing that power one day made his chest ache. Wouldn't it be better to never have it at all? To avoid the withdrawal, the sudden weakness?\n\nBraham read his hesitation like an open book. *[Do you believe you'll gain nothing from me? You will learn all varieties of magic and accumulate my wisdom. Isn't that advantage enough?]*\n\nGrid exhaled through his nose. \"...Fine.\"\n\nThere was no logical reason to refuse. The benefits outweighed the risks.\n\nSticks tried one last time. \"Grid, you don't understand how vile the demonkin truly are—\"\n\n\"Demonkin, human, doesn't matter.\" Grid's voice was hard. Final. \"I want to get stronger.\"\n\nThe reason Grid still played Satisfy obsessively, despite having paid off his debt, was simple: he needed to prove his worth. To climb higher, further from the pathetic loser he'd been. Every victory was evidence. Every achievement was validation.\n\n*Three gold medals in the National Competition.* That was the goal. Grid wanted recognition—*needed* it—especially from the bastards who'd tormented him. Lee Junho. His school alumni. He wanted to shove his success in their faces.\n\nAnd for that, he had to surpass Kraugel.\n\n\"Braham, I'll accept your soul.\"\n\n*[A wise choice.]*\n\n**FLASH!**\n\nLight erupted from Grid's chest. Braham's soul compressed into a luminous orb, then plunged into him like a dagger. Warmth flooded his core, followed by cold, followed by something indescribable.\n\n> **[You have become one with Braham's soul.]**\n\n> **[The second class 'Legendary Great Magician' has been acquired.]**\n\n> **[You are the first player to achieve two legendary classes!]**\n\n> **[It is truly a great achievement!! The title 'Glimpsed the Myths' has been acquired!]**\n\n> **[Glimpsed the Myths]**  \n> The minimum qualification to raise your class rating to **'Myth'**.  \n> The title itself has no effect.\n\n*Myth...!*\n\nGrid's breath caught. Most players knew myth rating existed—the three divine artifacts of the Rebecca Church were proof. But reaching it as a *player*? That was supposed to be impossible.\n\n*Even Lauel didn't know this was achievable.* Pride swelled in Grid's chest. He'd discovered something before the smartest strategist in the game.\n\nAnother notification appeared.\n\n> **[You have learned all of Braham's magic.]**\n\n> **[It failed because of your low intelligence!]**\n\n> **[In order to master Braham's magic, you must raise your intelligence.]**\n\n> **[In order to provide Braham's soul with steady magic power and restore it, you must raise your intelligence.]**\n\n> **[6 stat points will be forcibly invested into Intelligence every time your level goes up.]**\n\n> **[The skill 'Assimilation' has been generated.]**\n\n> **[Assimilation]**  \n> Will awaken Braham's sleeping consciousness within your body and become one.  \n> At this time, your class will convert to **'Great Magician'** and control of your flesh will transfer to Braham.  \n> **Skill Duration:** 3 minutes  \n> **Skill Cooldown Time:** 10 days\n\n\"...What?\"\n\nGrid stared at the windows. His brain stalled, trying to process.\n\nHe'd acquired a legendary second class. So why did this feel like a scam?\n\nNo—it *looked* like a scam.\n\n\"Are you fucking kidding me?!\" The words exploded out of him, raw and furious.\n\nHe gained 10 stat points per level. Six of those would be *force-fed into Intelligence*? Grid's vision tinged red. Rage coursed through him, hot and acidic. His fist clenched so hard his knuckles went white.\n\nSticks stepped back, anxiety written across his elven features. \"Did Braham deceive you? I warned you—demonkin cannot be trusted.\"\n\nGrid bit back another curse. Sticks' bias against Braham was grating, the constant moralizing about elves' balance versus demonkin' destruction. He ignored the sage.\n\n*I wasn't deceived.* The bitter truth settled in Grid's gut like lead. *This is my fault for not asking about penalties.*\n\nHe'd fallen into the same trap as when he became Pagma's Descendant—accepting power without reading the fine print. That had cost him everything, dropping him to level 1.\n\nBut he didn't regret it. Not really. A legendary second class was priceless, even with restrictions. The possibility alone was worth the cost.\n\n\"First, I need to test Braham's strength.\" Grid checked the timer. Eight minutes, thirty-five seconds left to clear the 51st island. He needed ten golden crown kills.\n\nImpossible alone, even with Noe and Randy.\n\n*But with Braham's abilities?*\n\n\"**Assimilation.**\"\n\nThe transformation was immediate and unsettling. Grid's broad shoulders narrowed. His thick forearms became slender, almost delicate. His jawline sharpened to an elegant taper. Black hair bled white like snow, flowing down his back.\n\n\"...Kukuku, failing to catch such dogs?\" Braham's voice emerged from Grid's throat, dripping with contempt. \"I will incinerate them alongside this entire island.\"\n\nThe white-haired version of Grid. The one that drove female players wild and sparked the fifth Korean Wave in Japan.\n\n\"**Fireball.**\"\n\n> **[The magic isn't cast because your intelligence is too low.]**\n\nSilence.\n\nBraham's—Grid's?—expression froze.\n\nThe first time Grid had accepted Braham's soul, the vampire had been overflowing with magic power. Full reserves, ready to annihilate.\n\nBut now?\n\n*...Fuck. It's like this.*\n\nGrid wanted to cry. The hidden quest reward mocked him from every angle. Regret tasted like ash.\n\n***"
}