{
  "id": 396,
  "title": "Chapter 396",
  "content": "# Chapter 396\n\n**Behen Archipelago, 51st Island.**\n\nFour golden crowns hovered before the white-haired figure that housed Grid's soul.\n\n\"Fireball! Fireball! Fireball!\"\n\n> [The magic isn't cast because your intelligence is too low.]\n> [The magic isn't cast because your intelligence is too low.]\n> [The magic isn't cast...]\n\n\"...\"\n\nBraham tried again. The result was identical.\n\n\"How can this be?\" His voice dripped with contempt. \"How deficient is your brain that you can't even calculate the formula for Fireball?\"\n\n*My head isn't bad!*\n\nGrid's internal protest was reflexive. And technically true. If one measured competence by the intelligence stat alone, his head wasn't bad at all. Why? Malacus' Cloak boosted his intelligence by 200 points, and the Black Quartz Earrings added another 15%. That pushed him close to 1,200 intelligence.\n\nThe influence of items was profound. What other blacksmith in the world possessed over 1,000 intelligence? Hell, it wasn't just blacksmiths. Grid was currently level 305. Among level 305 users who weren't magicians or scholars, breaking 1,000 intelligence was virtually unheard of.\n\nBy that metric, Grid was smarter than average. Objectively speaking, when measured purely by the intelligence stat, Grid was intelligent.\n\nBut in Braham's eyes, he might as well have been drooling.\n\n\"What a fool.\"\n\nThe levels of Braham's magic broke down into ten distinct tiers. Countless variations existed within each tier. Grid's current intelligence, however, limited him to the weakest 10th level magic. Braham couldn't even cast Fireball, a 9th level spell? No. Braham's Fireball wasn't the standard version taught to apprentices. His was enhanced. The formula was exponentially more complex. Grid's brain simply lacked the processing power.\n\n\"Your intelligence is meant to overcome a crisis.\" Braham's lip curled. \"Instead, it's like I entered the body of a skunk.\"\n\n*W-What?*\n\nWhy did everything keep circling back to his inability to use magic? Grid's mind churned with indignation, but words wouldn't form properly.\n\nBraham continued without waiting for a response. \"Currently, most of my soul slumbers within your body. I am merely a fragment. I must borrow your brain and magic power to cast spells. But with your current status...\" He paused meaningfully. \"It's meaningless.\"\n\n*Eek!*\n\nRage flooded Grid's consciousness. He'd accepted Braham's soul to grow stronger. Instead, all he'd gained was a sharper sense of inadequacy. Truly, his life was cursed. There was no escaping it.\n\n*Then what's the point of accepting you?*\n\n\"Let's see.\"\n\nBraham merely nodded at Grid's agitation. That relaxed, almost bored attitude made Grid's blood boil hotter.\n\n*Dammit! What the hell is this?*\n\nGrid's mental cursing was interrupted.\n\n\"Kieeek!\"\n\n\"Kyaak!\"\n\nThe golden crowns' behavior shifted. They lunged. The white-haired figure's aura had changed, sure, but they'd judged him still easy prey. Grid wanted to weep.\n\n*Will I die like this?*\n\nAssimilation's duration had 2 minutes and 30 seconds remaining. This useless skill, where the miracle was apparently 1+1=0. He'd surrendered control of his body to Braham. Now he couldn't rely on his items, or Noe, or Randy.\n\nBraham sensed the fear bleeding through Grid's thoughts.\n\n\"I must look very funny to you.\"\n\nAmong legends, Braham stood apart. Unlike other legends of human origin, his abilities were overwhelming. He alone had elevated the science of magic to a new dimension.\n\n\"Do you think this body will be struck by *hybrids*?\"\n\n*...!*\n\nShock rippled through Grid. Braham's perception of the four rushing golden crowns was utterly different from his own.\n\n\"Magic Missile.\"\n\n**Peng!**\n\n**Pepepeng!**\n\nGreat magician. A **legendary** great magician existed on a different plane. The skill description for Magic Missile (Enhanced) listed a 5-second cooldown. Braham fired four with zero time gap.\n\n\"Kuwek!\"\n\nThe golden crowns were pierced with surgical precision. The monsters hesitated, reeling from the pain. Braham gave them no reprieve.\n\n\"Magic Missile.\"\n\n**Pepeng!**\n\n**Pepepepeng!**\n\nHe used only Magic Missiles. Yet the power was devastating. Braham was in assimilation state—meaning Grid's class was currently Great Magician. His Magic Missile qualified as 10th level magic. The power was incomparable to Grid's version.\n\nFinally.\n\n> [The golden crown has been defeated.]\n> [13,498,000 experience has been acquired.]\n> [The golden crown has been defeated.]\n> [13,498,000 experience has been acquired.]\n> [The golden crown...]\n\n...\n\nGolden crowns. Parasites that emitted light to lure monsters. They commandeered the lured monsters as hosts, displaying overwhelming combat power through this tactic. But they had one critical weakness.\n\nTheir own health was pitiful compared to monsters of equivalent level.\n\nJoy flooded Grid as he watched them crumble beneath the master-level Magic Missile bombardment.\n\n*This might actually work!*\n\nHe might actually clear the 51st island's mission.\n\n*7 minutes and 34 seconds until the mission ends.*\n\nAssimilation would terminate in 1 minute and 59 seconds. Could Braham eliminate 6 golden crowns in that window? Grid watched with mounting anticipation. Braham moved to fulfill those expectations. He cast Magic Detection (Enhanced) to pinpoint the remaining golden crowns scattered across the island. Then he fired Magic Missiles toward them.\n\n**Pepepepeng!**\n\n\"Kyaak!\"\n\n*Wow.*\n\nAdmiration flooded Grid again.\n\nWhen Grid attempted it, hitting four targets 50 meters away with Magic Missile was a struggle. Meanwhile, Braham struck golden crowns 200 meters distant with flawless accuracy.\n\n*Incredible.*\n\nSix golden crowns around the island took hits and converged on Braham's position. Grid trembled as he sensed the mission's imminent success.\n\n*Shit. My mana is gone.*\n\n\"...?\"\n\nAt level 300, every point in intelligence granted 6 mana. Grid had 1,193 intelligence. That gave him 7,158 mana. Master level Magic Missile (Enhanced) cost 350 mana. Master level Magic Detection (Enhanced) cost 2,000 mana. Braham wasn't joking.\n\nGrid stared at the six golden crowns bearing down on them.\n\n*A great magician can't even manage his mana properly?*\n\n\"It is the first time I've possessed such a meager mana pool.\" Braham's tone was matter-of-fact. \"I made a miscalculation.\"\n\n*Shit! Don't waste time making excuses. Drink a mana potion!*\n\nGrid's skills had absurd consumption rates. He always carried mana potions for that reason.\n\n**Click.**\n\nBraham identified the mana potions in Grid's inventory. He pulled one out. Not the advanced mana potion that cost 20 gold each. No. He grabbed one of the super mana potions produced by Reidan's alchemy facility—the ones that didn't even have a market price yet.\n\n*No, what are you...*\n\nAdvanced mana potions were already a luxury for Grid. The mana restored by an advanced potion exceeded Grid's total mana pool. The only reason Grid even carried advanced potions was that intermediate ones fell short. For Grid, who winced every time he consumed an advanced mana potion, watching Braham casually down a **super** mana potion was unbearable. He felt genuine hatred.\n\n*You...! What are you doing?*\n\nAn advanced mana potion cost more than a rotisserie chicken. But super mana potions? At least ten times that price. Braham shrugged at Grid's mental anguish.\n\n\"My palate has luxurious tastes.\"\n\n*What...? They all taste the same!*\n\nAnger and annoyance warred inside Grid's mind. While his regret deepened, Braham demonstrated his worth.\n\n\"Magic Missile. Magic Missile. Magic Missile.\"\n\nOne spell type. That was all. Thanks to this single-minded barrage, Grid cleared the 51st island safely.\n\n> [1,900 Challenger Points have been acquired.]\n> [The gate to the 52nd island is open.]\n> [Your level has risen.]\n> [As someone with a second class, you will receive a level up bonus. 12 stat points have been acquired.]\n> [Your level has risen.]\n> [The duration of Assimilation is over. Braham's soul will be asleep for 10 days.]\n\n\"...\"\n\nThe island was cleared easily. He'd reached level 306 thanks to Braham. Yet Grid couldn't feel any happiness.\n\nHe made a silent vow.\n\n*I shouldn't summon him in the future.*\n\nGrid suspected frequent encounters with Braham might actually kill him. But somewhere in the back of his mind, he was dimly aware of something else. Braham's affinity toward him was growing. His words, tone, and expressions were softer than in the past.\n\n*He'll gradually reveal Pagma's secrets.*\n\nGrid had gained solid insurance in the form of Braham. Despite the wasted super mana potion, his expression was bright. It was exactly 30 days in real time until the National Competition.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}