{
  "id": 397,
  "title": "Chapter 397",
  "content": "Chapter 397\n\n*It isn't a big loss if I think about it calmly.*\n\nGrid reviewed his situation. A typical player gained 10 stat points per level. Those with second classes, like himself, gained two additional points. Six of them were forcibly invested in intelligence, but that wasn't necessarily negative.\n\n*Intelligence increases my maximum mana. I'll be able to use more skills, and the power of my magic will increase.*\n\nMore importantly, it would boost the efficiency of his Assimilation skill. Giving control of his body to Braham was difficult, but the payoff was irresistible.\n\nThe proof glowed in his Magic List.\n\n> **Available Magic Spells that can be Learned**\n>\n> [Magic Detection (Enhanced) Lv. 1]\n> A magic detection spell developed by the legendary great magician who has completely overturned the activation formula.\n> Emits a large amount of mana in all directions, locating all living things in a radius of 10 meters.\n> The higher the magic level, the wider the detection range and the more information that can be seen.\n>\n> Resource Consumption: 3,000 Mana\n> Skill Casting Time: 6 seconds\n> Skill Cooldown Time: 10 minutes\n>\n> *If you use this spell three times in Great Magician mode, you will learn it.*\n\nGrid could acquire magic used by Braham during Assimilation. The unique spells of a legendary great magician, completely free. A complete scam. So broken that other players would weep with jealousy if they knew.\n\n*I want to learn more of Braham's magic. I need to raise my intelligence.*\n\nHis priority, though, was blacksmithing, then swordsmanship. If he let greed control him and dumped stat points into intelligence now, he'd regret it later.\n\n*A weak hybrid is the worst. Don't be impatient.*\n\nOf course, stat points weren't the only path to higher intelligence. He could wear items that boosted it: Malacus' Cloak, the Black Quartz Earrings. But crafting stat-boosting gear wasn't easy. If it were, Grid would have already made agility items to balance his stats at a 1:1 ratio with strength.\n\nGrid stared at his remaining 6 stat points. The temptation to invest them burned in his chest, but he closed the stat window.\n\n\"I'll try later. First, I need to finish the Behen Archipelago.\"\n\n***\n\nThe broadcast studio lights glared down on the stage. A massive monitor displayed eight event icons behind the director.\n\n『 There were a total of eight events in the 1st National Competition. 』\n\nThe director gestured to the screen. Boss raid. PvP. Pet marathon. Escape the labyrinth. Target processing. International siege. Various production events.\n\n『 Unlike the 1st National Competition's 17 participating countries, this time we have 32 nations. The scale and interest are naturally bigger. 』\n\n『 The S.A. Group determined that eight events couldn't showcase the players' full potential. There's also a limit to the spectacle we can provide viewers. 』\n\nThe icons on the monitor multiplied.\n\n『 The number of events has increased to 13. Many are non-combat focused, making the competition friendlier to various classes rather than just combat specialists. 』\n\n『 Still, the most popular event will be PvP, just like last year. 』\n\n『 The S.A. Group has announced changes to the PvP system. No more incidents like Grid vs Hurent's 3-second match, or Grid vs Bondre's 4-second match. 』\n\n『 PvP damage will be reduced by 50% compared to PvE. 』\n\n『 In other words, a skill dealing 100% damage to a monster will only deal 50% to another player. This will enhance strategic depth and allow viewers to watch longer, more spectacular matches. 』\n\n\"Hoh.\"\n\n\"They don't need to worry about Grid's destructiveness anymore.\"\n\n\"Or Chris's.\"\n\n\"The importance of control just skyrocketed.\"\n\n\"Tankers are the biggest winners here.\"\n\nThe faces of PvP participants brightened as they absorbed the news. Meanwhile, Korean netizens felt the opposite.\n\n*-Ah... One of Grid's gold medals just flew away.*\n\n*-Grid's strength is his powerful attacks. This is basically sealing it. Absurd;;*\n\n*-A patch completely aimed at Grid. Not fair.*\n\n*-Remember when Korea was a gaming powerhouse? They patched everything to balance Korean players. This reminds me of that era.*\n\n*-This is called a 'nerf.'*\n\n*-Wow, classic game terminology;;; my father used that word;;; how old is that term?*\n\n*-Now that Grid can't win PvP gold, Korea will never crack the top 10.*\n\n*-The S.A. Group is a traitor... Screwing their own country like this...*\n\n*-This is a global conspiracy. Only Koreans suffer.*\n\nForeigners dubbed it the 'Grid Nerf.'\n\nChina and Japan, Korea's rivals, celebrated openly.\n\n*-Ah, ah. A small nation like South Korea getting crushed by the world.*\n\n*-China will prove we're the best in Asia!*\n\n*-Best in Asia! China is the center of the world! Hao is participating, so victory is natural!*\n\n*-Don't make me laugh. Japan is superior to China.*\n\n*-China's only strength is tactics. Each country is limited to 7 participants in the National Competition.*\n\n*-In the end, Damian, Katz, and Yoshimura are Asia's best.*\n\n*-We'll see.*\n\nWhile the 50% PvP damage reduction shook the world...\n\n> [You have entered the 56th island.]\n\n\"Heok... Heok...\" Grid gasped for air. \"This is really too much. The difficulty rises exponentially with every island.\"\n\nThe main subject of global conversation was completely absorbed in the Behen Archipelago. Not because he was stoically ignoring the controversy. Grid simply had no time for anything except the game, sleep, and food.\n\nHe hadn't checked TV or the Internet. The Behen Archipelago's difficulty demanded his complete focus. Every moment was precious.\n\nGrid didn't know he'd been nerfed.\n\nThe world, however, misunderstood his silence.\n\n*-Grid is silent.*\n\n*-Yes. He didn't complain to the S.A. Group despite being nerfed. ㄷㄷ*\n\n*-If this happened to other rankers, they'd be accusing the S.A. Group in interviews worldwide;;*\n\n*-Common sense says you demand compensation.*\n\n*-Grid is seriously... A guy like this is cool.*\n\n*-Truly God Grid!*\n\n*-Old Internet stories paint Grid as trash, but those must be from anti-fans.*\n\n*-Absolutely. Grid is amazing.*\n\nThe spread of opinion was terrifying. Once favorable views of Grid emerged, Koreans and foreigners alike praised his attitude.\n\nWhite supremacists acknowledged him. Certain Middle Eastern terrorist groups supported Grid. An astonishing phenomenon.\n\nTwenty-two days before the National Competition, a South Korean talk show featured Grid as the topic.\n\nPeak Sword was the guest.\n\n『 Why isn't Grid reacting to this patch? To Grid, this nerf is a minor problem. He is like this: Nerf? Try it. No one can stop me. Why? I am God Grid! A healthy person from Korea! Do you know God Grid? Hooray South Korea! 』\n\n\"Dammit.\"\n\nBy the time Grid heard about it, things had spiraled out of control.\n\n*I should call the S.A. Group. 'Why do you patch a person? Aren't games supposed to be fair?'*\n\nBut he was too embarrassed to come forward now. Peak Sword's talk show declaration had trapped him.\n\nGrid dropped his head into his hands. \"Dammit...\"\n\n*Peak Sword. We've known each other for over a year. Does he still not understand my personality?*\n\nThe power of bias was terrifying.\n\n***\n\n\"Unfortunately, this is where I give up.\"\n\n\"This is my limit too.\"\n\n\"Same for everyone, it seems.\"\n\nThe Overgeared members challenging the Behen Archipelago hit a wall. The vast majority failed to pass the 31st island. They raised white flags. The worst trials of the past forced even famous geniuses to despair.\n\n\"How did Grid pass?\"\n\n\"How far has Grid developed...?\"\n\n\"We're on the same side, but he's still scary.\"\n\nThe 31st island's concept was cruel. The more genius a person, the greater the difficulty. Lauel understood this, but he didn't want to dampen the Overgeared members' admiration.\n\n*Their respect and affection towards Grid is growing stronger.*\n\nLauel suspected that on the 31st island, Grid had likely faced monsters like ogres.\n\n*In other words, the 31st island is a privilege for bad players.*\n\nExcept for Grid, the Overgeared members' failure at the 31st island was natural.\n\nHowever.\n\nLauel frowned. Yura, Jishuka, and Huroi had passed the 31st island. He found the results incomprehensible.\n\n---\n\nGlossary of Common Korean Terms.\nOG: Glossary Link.\nCurrent schedule: 20 chapters a week.\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}