{
  "id": 398,
  "title": "Chapter 398",
  "content": "# Chapter 398\n\nLauel frowned, processing the implications.\n\n*Huroi, I can understand. To some extent.*\n\nThe Orator class was garbage in combat. Whatever trials the man had faced in his past must have been trivial by comparison to his current strength. Overcoming the 31st island would have been simple after acquiring his second class.\n\n*But Yura and Jishuka? That's different.*\n\nBoth women were geniuses. The difficulty of their past trials would be catastrophic. So how had they cleared the 31st island?\n\n*Did they never struggle because they were always that good? If so...*\n\nLauel's lips twitched.\n\n*That would make them comparable to Grid himself.*\n\nWhile he entertained these absurd theories, the other Overgeared members were comparing their Fog Island purchases.\n\nFaker examined his inventory. \"Five agility elixirs. One rare skill book.\"\n\nVantner grinned, slapping his gut. \"Huhuhu, thirteen stamina elixirs for me. I'm becoming increasingly qualified as a tanker.\"\n\n\"Damn. You two hit the jackpot.\" Pon shook his head.\n\nZednos groaned. \"I found Fog Island too early. Only managed four elixirs.\"\n\n\"I reached the 31st island and never saw it at all.\" Regas's jaw tightened. \"Irritating.\"\n\n\"Same here...\"\n\nThe Fog Island system in the Behen Archipelago was pure luck. It appeared randomly, either too soon to be useful or too late to matter.\n\nJishuka's expression softened with concern. \"I'm worried about Grid.\"\n\n\"...Yeah.\"\n\nThe world believed Grid was blessed by fortune. The first Legendary class, the Pope Killer, the Slaughterer. People assumed he'd saved a nation in a past life to earn such favor.\n\nThe Overgeared members knew better. Grid's luck was abysmal. The question wasn't whether Lady Luck smiled on him. It was whether she'd abandoned him entirely.\n\n\"A legendary blacksmith cursed with bad luck.\" Pon's voice was hollow. \"Can't even make legendary items consistently.\"\n\nVantner winced. \"What if he clears the entire Behen Archipelago and Fog Island never appears again?\"\n\nSilence settled over the group.\n\nLauel closed his eyes. *Even if your luck fails you as always, keep your mental strength, My Lord.*\n\n***\n\nThe Behen Archipelago, 56th Island.\n\n\"What the hell is this?\"\n\nGrid's frown deepened as he surveyed the terrain. Two cave mouths yawned before him, dark and uninviting.\n\n*Why two instead of one?*\n\nDid he need to clear both? \n\n*The scale is insane.*\n\nThe 55th island had introduced level 400 monsters. If these massive caves were crawling with similar threats, Grid wouldn't survive the attempt.\n\n*The level difference will make every fight a slog...*\n\nEach island pushed the difficulty exponentially higher. Grid's confidence was eroding when the notification appeared.\n\n> [A mission will be created.]\n>\n> [56th Island]\n> Break through the labyrinth!\n>\n> First Clear Reward: 2,150 Challenger Points. Access to Treasure Island for 3 minutes.\n\n*Treasure Island!*\n\nGrid's posture straightened instantly, shoulders squaring.\n\n*Treasure Island. The name alone...*\n\nThe Behen Archipelago was a monument to legendary achievements. The most sacred ground on the continent. A hidden Treasure Island would be overflowing with wealth.\n\n*If I can find adamantium...*\n\nThe Holy Light Set he'd worn since raiding Pope Drevigo was crafted from the god mineral adamantium. With more of that material, Grid could forge equipment beyond anything he'd made before.\n\nGrid stepped forward. \"Alright. Let's do this.\"\n\nHis motivation reignited, he approached the cave entrances. His body locked up mid-stride.\n\n*What? I can't move?*\n\nThis wasn't a status condition. His limbs had simply frozen, as rigid as stone, while a choice materialized before him.\n\n> [Do you want to go to the left cave or the right cave?]\n\n*Ah. I see.*\n\nThe labyrinth had begun the moment he'd set foot on the island. He couldn't move in any direction except the two presented options.\n\n*No variables allowed.*\n\nGrid tried to turn his head toward Sticks. He wanted to ask the sage for advice on clearing labyrinths. His mouth wouldn't open.\n\n*Not just movement. My voice too...*\n\nSticks appeared equally frozen, standing as stiff as a statue.\n\n*This is going to be a problem.*\n\nGrid had zero experience with labyrinths. The complex structures and trap mechanics had always driven him away. In other words, he had no knowledge to draw on. The path ahead was completely dark.\n\n*In the end, I have to gamble.*\n\nGrid considered his options, then stepped forward. He chose the right cave.\n\nThe result made his blood run cold.\n\n*This is insane!*\n\nSix paths branched out before him the moment he crossed the threshold. Grid's jaw clenched.\n\n*I'll never clear this in time.*\n\nThe labyrinth was massive. At this rate, it would take weeks to navigate.\n\n*Maybe I won't finish before the National Competition starts...*\n\nThe worst-case scenario. He was trapped. But Grid had one trump card.\n\nHe spoke the word aloud. \"Assimilation.\"\n\nSururuk.\n\nGrid's hair bleached white. His eyes ignited with ruby light. He wasn't borrowing the wisdom of a sage. He was borrowing the wisdom of someone far greater. Grid was becoming more versatile with each passing day.\n\nBraham's voice emerged from Grid's mouth, amused. \"Hoh. You thought to exploit my wisdom this way.\"\n\nBraham activated **Magic Detection (Enhanced)** and walked confidently toward the path radiating the strongest, most malicious aura.\n\nAfter a moment, Braham dispatched the hidden monster and stood before a new crossroads. Then he spoke, addressing the soul fragment's host.\n\n\"The labyrinth doesn't want to release anyone who enters. The closer you get to the exit, the more danger you'll face. Use Magic Detection to move carefully.\"\n\nThe duration of Assimilation was three minutes. Braham delivered his advice, then retreated into dormancy.\n\nGrid's expression softened. *Thank you, Braham.*\n\nThe hint was invaluable. More than that, he'd learned new magic.\n\n> [**Magic Detection (Enhanced) Lv. 1**]\n> A magic detection spell developed by the legendary great magician, who completely overturned the activation formula.\n>\n> Emits a large amount of mana in all directions, locating all living things in a radius of 10 meters.\n>\n> The higher the magic level, the wider the detection range and the more information that can be seen.\n>\n> Resource Consumption: 3,000 Mana.\n> Skill Casting Time: 6 seconds.\n> Skill Cooldown Time: 10 minutes.\n\n*If I follow Braham's method...*\n\nPaaaat!\n\nGrid stood before eight diverging paths this time. He activated Magic Detection, the spell he'd learned through Assimilation. Mana rippled outward from his body in waves.\n\n*Got it!*\n\nThe strongest aura pulsed from the end of one path. A monster waited there. Grid was certain. He summoned the God Hands, Randy, and Noe, and entered battle at full strength.\n\n\"Hah... hah...\"\n\nThe labyrinth monsters ranged between level 400 and 410. The gap between them and Grid at level 306 was catastrophic. His attacks barely scratched their health bars, while each hit he took shaved massive chunks from his own.\n\nEvery encounter was a boss raid.\n\n*The monsters aren't even the real problem.*\n\nMagic Detection had a ten-minute cooldown. Braham's Boots reduced that to eight minutes due to the cooldown reduction effect. As a result, Grid could only move every eight minutes.\n\n*How long will it take to clear this entire labyrinth?*\n\nHis vision swam. Mental exhaustion clawed at him. But...\n\n*I'll continue.*\n\nLabor was familiar territory for Grid. His grim, unyielding mentality began to shine.\n\n***\n\nBubat, master of the Yak Guild and one of the Seven Great Guilds, was ranked 53rd on the unified rankings.\n\nIt couldn't compare to his peak at 25th, but nobody claimed he'd grown weaker. His bold decision-making and powerful crowd control skills had earned him the title of Satisfy's best initiator. Battlefields turned favorable the moment Bubat took the vanguard.\n\nHis nickname: Yak Who Promises Victory.\n\nBut during the last National Competition, Bubat had been helpless. He'd failed to live up to his reputation, disappointing everyone. Was it because he'd been in poor condition? No.\n\nIt was because he'd faced Yura and Grid back-to-back. Yura's physical abilities had shattered his CC chains. Grid had simply resisted all crowd control.\n\nBubat had been frustrated because it couldn't be helped.\n\nBubat clenched his fist. \"But I won't be the one feeling frustrated in this National Competition.\"\n\nAfter reaching level 300, he'd acquired multiple offensive skills. Unlike before, when he'd relied exclusively on crowd control, he now had proper attack power. More importantly, Bubat was fundamentally a tank.\n\nHe grinned savagely. \"The biggest beneficiary of the patch is me! Huhuhut!\"\n\nGrid's legendary skills? The 50% damage reduction meant Bubat could endure several blows. He'd drag it into a war of attrition and crush Grid with superior stamina.\n\nBubat raised his voice to the crowd. \"I'll repay the shame of the past while winning a gold medal for Turkey!\"\n\n\"Waaaaaaaah!\"\n\nThe Turkish fans roared their approval.\n\nAt that moment, across the globe, every participant harbored the same thought.\n\nThey could handle Grid now. One patch had turned an apex predator into a pushover."
}