{
  "id": 399,
  "title": "Chapter 399",
  "content": "# Chapter 399\n\nZibal leaned back in his chair, camera flashes reflecting off his teeth. Thousands had packed into the auditorium for this. The 2nd National Competition was the official topic. Grid was the real one.\n\n\"Grid?\" Zibal's smile thinned. \"Certainly, he's grown. The Eternal Kingdom war footage was impressive.\"\n\nA reporter in the front row raised his hand.\n\n\"In the past, Grid relied on items, skills, and raw stats. Now you're saying he's developed actual control?\"\n\nZibal nodded. \"Moderate control skills. Combined with his existing advantages, it shows he's been putting in effort. I admire that.\"\n\n\"You used the word 'moderate.'\" The reporter scribbled notes. \"Are you saying his control isn't at an amazing level?\"\n\n\"Well...\" Zibal glanced at the crowd. \"Isn't it good enough from the public's point of view?\"\n\nAnother voice cut in. \"So he hasn't reached high ranker standards yet. The patch will weaken Grid significantly in the National Competition. Your thoughts?\"\n\n\"Same opinion.\" Zibal spread his hands. \"Without his items and stats? Grid becomes very ordinary.\"\n\nAn older man near the back stood. His suit was rumpled, his notepad ancient.\n\n\"I have a question about that. Is Grid really weak? If his damage is halved, can't he just hit the opponent twice instead of once to achieve the same result?\"\n\nLaughter rippled through the room. Even Zibal chuckled. The question was painfully basic.\n\nZibal held up a hand, stifling the noise. \"Satisfy's stats aren't just attack power and health. There's also defense. For example, let's say my defense is 100 and Grid's attack power is 1,000. How much damage do I take from Grid's attack?\"\n\nThe old reporter frowned. \"Isn't it 900?\"\n\nThe man clearly didn't belong here. Some mishap must have dragged him to this conference. Zibal kept his expression patient.\n\n\"No, that's not how it works.\" Zibal's tone shifted, taking on a lecturing quality. \"A formula applies to defense. First, besides the defense visible in the stats window, every class has unique resistance that stacks with defense to reduce incoming damage.\"\n\n\"In other words...\" The reporter looked up from his notes. \"This patch reduces Grid's effective attack power by more than 50%?\"\n\n\"Correct.\"\n\n\"Then isn't this patch fatal to all players with low attack power, not just Grid? How will anyone deal damage?\"\n\nZibal tapped his temple, then his chest. \"You attack weak points. Be faster. Be more accurate.\"\n\nGrid didn't have that kind of skill. The old reporter finally seemed to understand. He sat down, pen scratching across paper.\n\nAnother hand shot up. \"Now that Grid's PvP influence has weakened, what's your prediction for South Korea's overall ranking?\"\n\n\"22nd.\" Zibal shrugged. \"Besides Yura, they don't have talent. She can't carry alone.\"\n\n\"What about Peak Sword?\"\n\n\"Peak Sword is excellent. But his attack mode is one massive strike. Powerful, yes. The delay after each swing, though? That's brutal. He's another victim of this patch. South Korea is tragic in many ways.\"\n\n\"Russia and Kraugel?\"\n\n\"Russia has solid participants. Kraugel is the only competitor I truly admire.\" Zibal's voice gained an edge of respect. \"Top 10, easily.\"\n\n\"The host nation, France?\"\n\n\"Top 5, minimum.\"\n\n\"The United States?\"\n\nZibal's smile returned, sharp and confident. \"First place. As always. In all areas.\"\n\n***\n\nBeijing hummed with controlled energy. The press conference room was packed, every seat filled, cameras positioned at perfect intervals.\n\nHao sat behind the microphone, expression neutral. His 16th ranking had held steady even as Overgeared members had torn through the unified rankings like a wildfire. China called him the miracle. The genius of fighting. Solo or team, his PvP stats were overwhelming.\n\nA reporter leaned forward. \"Hao. You didn't participate in the 1st National Competition held in South Korea last year. China was forced to settle for 7th place. Your decision to participate this year is to heal the disappointment of the Chinese people, correct?\"\n\n*I want to say it has nothing to do with the hearts of the people.* The thought flickered through Hao's mind. He was Chinese. He knew exactly what happened when you slipped up in front of these vultures. Kidnapping wasn't just a rumor.\n\nHao took a slow breath. He nodded.\n\n\"That's correct. Last year, personal circumstances prevented my participation. I deeply regretted it.\" He looked directly into the nearest camera. \"I swear before the spirit of the great Mao Zedong and China, I will lead our country to victory in this National Competition.\"\n\n\"Last year, Grid and South Korea interfered with China's rise and claimed 3rd place. Now that Grid has been nerfed, will you repay that disgrace?\"\n\n*Grid.*\n\nAccording to Lauel, Grid was someone beyond even Kraugel. Nonsense on the surface. But Lauel wasn't the type to exaggerate. Grid had something. Some hidden factor.\n\n*I can't say anything positive.*\n\nHao scanned the room. Every reporter stared at him with naked expectation. Their eyes demanded a specific answer.\n\nHe sighed. The words tasted like ash, but he spoke them anyway.\n\n\"Whether Grid is nerfed or not, he was never my opponent in the first place.\"\n\n\"Ohh!\"\n\nThe reporters got their soundbite. Pens flew across notepads. Camera shutters clicked in a mechanical symphony. Of course the great nation would triumph over the small one. That was the natural order.\n\nSnap. Snap snap.\n\nHao reached for his water glass. The cold liquid soothed his throat.\n\n*It isn't a lie.*\n\nOnly Kraugel was better than him. Hao's evaluation of his own skills ran high for good reason. During the Reidan invasion, he'd tied up multiple Overgeared members alone. That wasn't luck. That was skill.\n\n***\n\nParis wore its history like a crown. Ancient stone mixed with modern glass. The press conference room occupied a renovated theater, all velvet and gold trim.\n\nBondre sat at the center table, arms crossed. France had been a favorite in the 1st National Competition. Experts had predicted they'd beat even the United States. Then Grid had logged Bondre out in four seconds flat, and everything collapsed. France limped to second place.\n\nA reporter near the front stood. \"Bondre, you experienced a humiliating defeat after being logged out by Grid in just 4 seconds. Did that incident cause trauma? Will you be able to participate effectively in the National Competition?\"\n\nBondre's scoff cut through the air like a blade. \"Trauma? That's something that happens to hyenas like you. I am a beast of prey. I never shrink back.\"\n\n\"Your confidence is admirable. But isn't this patch fatal for you? Your Absolute Zero won't function properly.\"\n\nFrance was the host country. The entire nation hoped for victory. The public, however, didn't trust Bondre. Not after last year.\n\nBondre's expression twisted into something ugly and mocking. \"You still think Absolute Zero is my only skill?\"\n\nThe reporter blinked.\n\n\"A year has passed since the first National Competition. In that time, I've learned many powerful spells.\" Bondre leaned forward. \"An ice mystic specializes in defense and utility, not raw attack power. This patch is giving me wings.\"\n\nHis formality dropped. The words came faster, sharper. He jabbed a finger at the assembled media.\n\n\"Those uncivilized Koreans who eat dog meat, I will shatter them. Then your attitude towards me will change. I will lead France to victory.\"\n\n***\n\nOttawa's press room was smaller. More intimate. Chris sat alone at the table, no handlers flanking him.\n\n\"Last year, Canada was a strong candidate to win the National Competition. Instead, we experienced the shocking result of not even reaching the top 3.\"\n\nA reporter in a blue jacket leaned on the barrier. \"This year, the country hopes for different results. Chris, do you have the confidence to revive those expectations?\"\n\n*Please give a satisfying answer.* Chris read the plea in their eyes. He bowed his head.\n\n\"Last year, I was helpless. Lost to Zibal in the boss raid. Defeated by Bondre in the labyrinth breakthrough. Beaten by Regas in PvP.\" His voice stayed level, matter-of-fact. \"I want to use this opportunity to apologize again.\"\n\nChris shouldn't have to apologize. Last year, he'd been exceptional. Silver medal in boss raid. Silver in labyrinth breakthrough. Quarter-finals in PvP. He'd fought the world's best alone and survived.\n\n\"Lift your head!\"\n\n\"You're our hero!\"\n\nThe reporters' voices rose in unison. Chris slowly raised his eyes. Then he smiled at them.\n\n\"I'll show a better performance this year. I'm confident of winning against all opponents except Kraugel and Grid.\"\n\n\"G-Grid?\"\n\nThe reporters recoiled. Grid was a patch victim. Rankers and experts worldwide agreed he'd struggle to play a significant role in the National Competition. Why did Chris see Grid as superior?\n\n*Chris is also a victim of the patch, but...*\n\n*Chris has much higher greatsword skills. He's different from Grid.*\n\nChris watched the confusion play across their faces. Laughter bubbled up in his chest.\n\n*I can't easily beat Grid, who competed with the crazy farmer for so long.*\n\nThe world didn't know Grid's true value. The public opinion ridiculed Grid despite his achievements, all because of his supposedly normal control. Chris couldn't comprehend it.\n\nOf course, this didn't mean Chris had already accepted defeat.\n\nGrid and Kraugel. Both men would be difficult to beat. But Chris didn't think victory was impossible. That was the pride of the 3rd ranked user. The belief that separated rankers from legends.\n\nHe had a chance. He just had to seize it."
}