{
  "id": 4,
  "title": "Chapter 4",
  "content": "# Chapter 4\n\n*The minus level isn't a bug.*\n\nThe numbers in parentheses beside my level showed current experience and the amount needed to reach the next level. The existence of this experience figure meant I could still level up. In the worst case, I'd been terrified the system had broken me permanently.\n\n*At least it isn't bugged.*\n\nThe relief was thin. My level had been over 70. Now I sat lower than a fresh character someone created five minutes ago.\n\n*I have to endure this.*\n\nGrid clenched his jaw. It would take time, but he could grind the levels back. The only reason he wasn't screaming was the class description. He didn't understand \"item creation\" or what probability increases actually meant in practice, but it sounded valuable.\n\n*The enhancement odds will increase.*\n\nIn Satisfy, items enhanced up to +10. The enhancement stones cost a fortune. The higher the enhancement number and item rating, the lower the success chance dropped. Success meant +1. Failure meant -3. Anything at +6 or higher sold for exponential prices.\n\n*I don't know how much the probability rose, but there's money in this.*\n\nBoth class characteristics looked decent. The part that made his hands shake was the unconditional equip feature. No restrictions. That attribute alone could shatter game balance depending on the penalties.\n\n*Isn't this basically cheating?*\n\nMost equipment in Satisfy had usage conditions. Level requirements. Stat minimums. If a player didn't meet them, the item stayed locked in inventory. Those restrictions created the entire progression curve. But his class ignored that.\n\n*Does it actually work?*\n\nHe opened his inventory.\n\n> **[<span class=\"rarity-epic\">Mamon's Greatsword</span>]**\n> \n> **Rating:** Epic\n> \n> **Durability:** 88/204 | **Attack Power:** 178~301 | **Attack Speed:** -16%\n> \n> * Additional water damage will be added to all critical attacks.\n> \n> *This is the greatsword patronized by the guardian of Lake Pamian, Mamon. Due to the influence of the lake, this sword has the strong aura of water.*\n> \n> **Conditions of Use:** Level 65+, **Strength** 260+, **Stamina** 150+\n> \n> **Weight:** 1,050\n\n> **[<span class=\"rarity-rare\">Mengel's Plate Armor</span>]**\n> \n> **Rating:** Rare\n> \n> **Durability:** 51/180 | **Defense:** 165 | **Movement Speed:** -2%\n> \n> * **Strength** +10\n> \n> *This is a work made by the blacksmith Mengel in the fortified city of Patrian. The defense is improved and the weight lowered. The wearer of this work can feel Mengel's strong willpower that remained behind.*\n> \n> **Conditions of Use:** Level 60+, **Strength** 180+\n> \n> **Weight:** 1,203\n\nHis current stats met none of these requirements. A normal player couldn't equip either piece. Grid clicked on both items.\n\n> [Due to your class characteristics, you have equipped <span class=\"rarity-epic\">Mamon's Greatsword</span>.]\n> \n> [A penalty is applied because the item conditions aren't met.]\n> \n> [Attack power of <span class=\"rarity-epic\">Mamon's Greatsword</span> will decrease by **30%**. Only half of the option effects will be applied.]\n> \n> [The penalties will be reduced if your understanding of <span class=\"rarity-epic\">Mamon's Greatsword</span> increases.]\n\n> [Due to your class characteristics, you have equipped <span class=\"rarity-rare\">Mengel's Plate Armor</span>.]\n> \n> [A penalty is applied because the item conditions aren't met.]\n> \n> [Defense of <span class=\"rarity-rare\">Mengel's Plate Armor</span> will decrease by **20%**. Only half of the option effects will be applied.]\n> \n> [The penalties will be reduced if your understanding of <span class=\"rarity-rare\">Mengel's Plate Armor</span> increases.]\n\n\"Amazing.\"\n\nSatisfy rarely offered no-restriction items. The beginner gear came with zero conditions. The starter greatsword at level 1 had maybe 5~13 attack power. The starter armor had 7 defense.\n\nNow he wielded a weapon with 124 to 210 attack power. His armor boasted 132 defense. At level one.\n\n*I can recover fast.*\n\nThe attack power alone let him hunt level 20 monsters. The armor meant low-level creatures couldn't scratch him. He'd level at triple speed compared to normal users.\n\n*Rare items lose 20% of base stats. Epic items lose 30%. Half the effects apply.*\n\nThe penalties were almost nothing. Unique and Legendary items would hit harder, but this was already broken.\n\n\"This is a legendary class.\" His excitement stuttered. \"But what's understanding?\"\n\nHe'd missed the detail in his rush. Grid pulled up the explanation.\n\n> **[Item Understanding]**\n> \n> Pagma's Descendant can understand the materials and principles of items by using, disassembling, or repairing equipment. The higher the understanding level, the more efficiently one can handle the items. At **100%** understanding, you learn the production method for that item.\n\n\"Oh.\"\n\nHigher understanding meant lower penalties. *And I get the recipe?*\n\nNormal production users paid fortunes for recipes. They completed nightmare quest chains for a single pattern. He'd get them for free just by wearing the gear.\n\n*The repair skill is available. My durability is low. I'll fix these later.*\n\nThen he examined the title effects. Abnormal status effects decided most PvP fights. Confusion, stun, paralysis, any of them could flip a winning battle into a corpse run. His title reduced those chances. It also prevented death when health hit minimum, granting temporary immortality.\n\n*\"Easily acknowledged\" probably means NPCs will like me faster.*\n\n\"Puhuhut.\"\n\nHe couldn't stop the sound. The giggles bubbled up from his chest. Just the class and title alone put him leagues ahead of regular users. He was special now. This felt like real compensation for three months of hell.\n\n\"But...\"\n\nThe joy curdled in his stomach. He would've been happier selling the book.\n\n\"I could've paid off my creditors! Bought that foreign car!\"\n\nThe good feeling evaporated.\n\nGrid pounded the stone floor. \"Piece of shit Ashur!\"\n\nHe cursed the NPC who'd tricked him. Strung together every profanity he knew. Gradually, his pulse slowed. A new stat caught his eye.\n\n> **[Composure]**\n> \n> The probability of being affected by an abnormal state is lowered. Recovery from abnormal conditions is faster.\n> \n> * The higher the number, the higher the effect.\n> * Stat points cannot be distributed to this stat.\n\n> **[Indomitable]**\n> \n> Has a probability of invalidating a portion of incoming damage. The lower the health, the higher the probability.\n> \n> * The higher the number, the higher the effect.\n> * Stat points cannot be distributed to this stat.\n\n> **[Dignity]**\n> \n> Cannot be pushed down by others. Rare chance of making enemies submit.\n> \n> * The higher the number, the higher the effect.\n> * Stat points cannot be distributed to this stat.\n\n> **[Insight]**\n> \n> Discover the target. Predict risks.\n> \n> * The higher the number, the higher the probability.\n> * Stat points cannot be distributed to this stat.\n\nEvery stat had strong effects. *But how do I raise them if I can't assign points?*\n\nThe explanation looked impressive but might be useless in practice. He reached for the skills window.\n\n\"Aack!\"\n\nSomething touched his back. Grid's heart slammed into his ribs. He'd forgotten he was still in the Yatan Temple.\n\n\"What!\"\n\nHe spun and swung <span class=\"rarity-epic\">Mamon's Greatsword</span> on reflex. The man behind him dodged and raised both hands.\n\n\"Hey, calm down.\" The stranger's voice was dry. \"You trying to kill someone?\"\n\nThe man looked Caucasian, maybe mid-30s. Light leather armor. Agile build. Assassin class.\n\n*His finger poked my back.*\n\nA sword would've been fine. Screaming over a finger poke was embarrassing.\n\n\"What do you want?\"\n\nThe man shrugged. \"Pretty cold reception. Don't I deserve an apology after you tried to kill me?\"\n\nHis smile looked like a smirk. Grid hated people like this.\n\n*Speaking so casually at our first meeting.*\n\nThe man appeared older. Mid-30s at a glance. But Grid had learned appearances meant nothing in Satisfy. He'd called someone \"Brother\" once, only to discover they were seven years younger.\n\nThis bastard looked thirty-something but...\n\nGrid coughed. His fists trembled. He forced the shameful memory down. \"I'm sorry about that. But shouldn't you apologize for surprising me?\"\n\nThe man laughed and extended his hand. \"Young man, I called out to you. You were so deep in thought you didn't hear. That's why I poked you. My apologies.\"\n\nGrid ignored the handshake. \"Why did you call me?\"\n\nThe man scratched his head. \"As you know, Yatan Temples are filled with evil energy. Ordinary people get frightened after a few minutes. But I watched you. You've been fine this whole time. Even laughing to yourself.\" His eyes narrowed. \"You have real ability, don't you?\"\n\n*This is...*\n\nGrid checked the name above the man's head. The stranger's eyes gleamed.\n\n\"My name is Doran. I'm a shadow who secretly protects Earl Steim. I went on vacation for a day or two, and the Earl's daughter got kidnapped. I tracked her here. She's trapped in the basement of this temple.\" He leaned forward. \"Lend me your strength. I'll pay you for the job.\"\n\n\"I'm not...\"\n\nGrid had assumed the man was a user. But he was an NPC. The perfect AI made them indistinguishable sometimes. The name tag was green. Then the notification appeared.\n\n> **[Rescue the Earl's Esteemed Daughter]**\n> \n> **Difficulty:** S\n> \n> Irene, the only daughter of Earl Steim, is a beautiful and innocent virgin. The elders of Yatan kidnapped Irene to sacrifice her for her virgin blood.\n> \n> **Quest Clear Conditions:** Rescue Irene within one hour after accepting the quest.\n> \n> **Clear Reward:** 3,000 gold. Low probability of becoming the earl's son-in-law.\n> \n> * **Earl's Son-in-Law:** Nobility stat opens. All stats **+20**. Treated as a viscount after marriage. Power and honor rise. Access to noble social circles. Monthly salary. Potential shortcut to high-ranking official or lord.\n> \n> **Quest Failure:** Level **-2**\n> \n> [Would you like to accept the quest?]\n\nThis was insane."
}