{
  "id": 400,
  "title": "Chapter 400",
  "content": "# Chapter 400\n\n**Tokyo, Japan.**\n\nYoshimura stood beneath the glittering chandelier, its light catching on the sweat beading at his temples. He raised his fist.\n\n\"Yoshimura will make Japan the most powerful Asian country!\"\n\nThe declaration echoed through the press conference room. Among his countrymen, Yoshimura carried a bitter epithet: the Defeated General. His battle against Korea's Silver Knights Guild for Cork Island had been a massacre. Then came Damian, defeating him in front of the very right-wing extremists who'd branded the Pope a traitor.\n\nOnce, Yoshimura had been the 2nd ranked archer. Those days were gone. His peak had crumbled. Yet the Japanese still clung to him. His past achievements cast a long shadow, and expectations lingered like smoke. Japan simply lacked anyone better.\n\n\"Ohhhh!\"\n\n\"It truly is Yoshimura!\"\n\nThe reporters applauded his entrance. Cameras flashed. Then, silence. No questions came. No one moved toward him with microphones extended.\n\nThe press had no interest in a fallen star.\n\nTheir attention fixed on the figures flanking him. Damian sat to his left, Katz to his right. Yoshimura's jaw tightened. He cleared his throat twice and sat down, the leather chair creaking under him.\n\nA reporter moved first, approaching Katz.\n\n\"Katz, it's been ages since your last public appearance. What have you been doing?\"\n\nKatz leaned back, arms crossed. \"Bah, what a stupid question. Can't you tell by looking at the rankings? I've been leveling.\"\n\nThe son of the JIN conglomerate, Katz had grown up drowning in wealth. Everything he'd ever wanted had been his. The result: arrogance thick enough to choke on. Anti-fans around the world despised him.\n\nJapan did not.\n\nThe reason was simple. Katz was hope incarnate. The third Epic hidden class user. Blood Warrior Katz had spent the past year and a half doing nothing but hunting, chasing a single obsessive dream: becoming the 1st ranked user.\n\n\"You reached 19th on the unified rankings two weeks ago,\" another reporter said. \"Every media outlet in Japan reported your achievement.\"\n\n\"You must be happy,\" a third added. \"The first Japanese player in the top 20.\"\n\nKatz's expression soured. His fingers drummed against his bicep. Embarrassment crawled up his spine like ants. A year and a half ago, he'd stood before the world and promised to claim first place within six months.\n\nHe hadn't even broken into the single digits.\n\n19th out of two billion users was objectively extraordinary. For Katz, whose pride towered like a skyscraper, it was failure.\n\n\"What events do you plan to participate in?\" a reporter asked.\n\n\"Haven't decided.\"\n\n\"What are your expectations for Japan's ranking?\"\n\n\"How should I know?\"\n\nThe reporters exchanged glances. Katz's body language screamed *leave me alone*. They'd gotten their footage. That would suffice. The press turned to Damian.\n\n\"Pope Damian, you're known to have a special relationship with Grid. Will you be able to face him as an enemy in the National Competition?\"\n\nThe question carried weight beneath its surface. *Damian chose Grid over his country. Can he really betray that bond?* Yoshimura stiffened in his seat. Katz remained impassive. Damian smiled, broad and confident.\n\n\"I know how to distinguish between the two. In the National Competition, Grid is naturally my enemy.\"\n\n\"Ohh!\"\n\nQuestions erupted like a dam bursting.\n\n\"What events will you participate in?\"\n\n\"Any combat-related events are fine.\"\n\n\"You're confident in battle?\"\n\n\"Of course. I am really big.\" Damian grinned, patting his muscular chest.\n\n\"What are your expectations for Japan's ranking?\"\n\nDamian glanced sideways at Katz. \"At least top 10.\"\n\n\"Ohhh!\"\n\nTop 10 out of 32 countries. Likely the highest rank among Asian nations. The reporters' excitement intensified. Damian, who'd coldly rejected every overture from right-wing groups, was finally speaking favorably about Japan.\n\nThey were glad, once again, that a powerhouse like the Pope was Japanese.\n\nThen the right-wing media struck.\n\n\"Is there still no plan to build a Rebecca Temple in territories ruled by Japanese guilds?\"\n\n\"How about providing healers from the Rebecca Church to support Japanese rankers?\"\n\nQuestions unrelated to the competition flooded forward. Damian's smile faded. He sat in silence, trying to comprehend the psychology of extremists who demanded one-sided support simply because he shared their nationality.\n\n\"Tsk. I'm building a temple in Reidan,\" he said finally.\n\n\"You really must be a Korean,\" a right-wing reporter sneered.\n\nThe atmosphere curdled. Then a young reporter near the back raised her hand.\n\n\"What do you think about the balance patch?\"\n\nDamian's expression brightened. \"It's a patch designed to benefit me.\"\n\nStrong defense. Recovery skills. Phenomenal buffs. With the damage reduction patch, who could possibly harm him?\n\n\"At least in the National Competition, I am invincible.\"\n\n\"Waaaaahhhhh!\"\n\nJapan erupted. Expectations skyrocketed. Internet forums exploded with speculation. Could Damian win three gold medals?\n\nThen he added, \"Well, as long as I don't go against Grid.\"\n\nSilence.\n\n*Why?* Why did Damian praise Grid so excessively? The Japanese people, ignorant of the true depth of their relationship, didn't understand. More voices began to wonder if Damian was secretly Korean all along.\n\n***\n\n**Moscow, Russia.**\n\nThe press conference for the 2nd National Competition participants began. Reporters filled the hall, cameras ready.\n\nKraugel didn't attend.\n\n***\n\n**Seoul, South Korea.**\n\n\"Zibal doesn't know anything.\" Peak Sword leaned forward, hands planted on the table. \"If he meets God Grid in the same event, he'll eventually have to hand God Grid the gold medal.\"\n\nKang Daehan of the Korean Patriotic Association. Peak Sword in Satisfy. He sat before hundreds of reporters, practically vibrating with energy.\n\n\"And Hao?\" Peak Sword's voice rose. \"He doesn't seem Chinese with how rude he is. Whether God Grid is nerfed or not, Hao is no match for God Grid.\"\n\n\"Excuse me, Kang Daehan,\" a reporter interrupted. \"Why didn't Yura and Youngwoo attend this interview?\"\n\n\"Also!\"\n\nPeak Sword ignored the question entirely. Only 17 days remained until the National Competition. He was busy. Overwhelmed. But he'd made time for this press conference for one reason: to refute every ranker who'd spoken against Korea.\n\nHe slammed his hand on the table. The wood cracked.\n\n\"Bondre! The French player who called Koreans uncivilized because we eat dog meat!\" Spit flew from Peak Sword's mouth. \"The French eat foie gras, which is far more atrocious! A pot calling the kettle black! Bondre, I will make you feel ashamed, so be prepared! Understood? Hooray South Korea!\"\n\nThe reporters stared.\n\nThe National Competition press conference had transformed into a Korean Patriotic Association rally. The reporters found it absurd. Yet also endearing. Peak Sword made them feel better about the upcoming battles. South Korea was lucky to have such a passionate madman representing them.\n\n***\n\nWhile the world focused on the 2nd National Competition, Grid wandered the labyrinth.\n\n> [You have killed a cavalry knight.]\n> \n> [16,112,300 experience has been acquired.]\n\n*Heok... Heok... I'm going crazy.*\n\nTwo weeks. Two weeks of Satisfy time spent trapped in this lightless maze. Moving through the dark without knowing how close the exit was, his sanity fraying at the edges.\n\n*It might be different if the monsters were weak.*\n\nThe labyrinth spawned cavalry knights between level 400 and 420. Each one required at least three minutes to kill. They hit hard. A single blow stripped away a quarter of his health. Three or more at once? He had to burn his immortality passive just to survive.\n\n*If it wasn't for that passive, I'd be dead. Sent back to the 50th island.*\n\nJust imagining it made his stomach clench. Grid swallowed and cast magic.\n\n> [Magic Detection (Enhanced) Lv. 1 (93.1%)]\n> \n> [The cooldown time is 4 minutes and 42 seconds.]\n\n*Sigh.*\n\nSince entering the labyrinth, he'd used this skill so many times it was nearly level 2. Almost caught up to Magic Missile. The numbers told a story: countless castings, endless wandering. And still no exit.\n\nGrid sat down hard. His legs trembled from exhaustion. He'd try Meditation. Recover health, mana, stamina while waiting for Magic Detection's cooldown. But Meditation required extreme concentration, and his mind felt scattered like broken glass.\n\nTwo minutes later, he succeeded.\n\n> [Entering a meditative state.]\n> \n> [Health and mana regeneration rate increased by 50%. Stamina regeneration increased by 30%.]\n> \n> [Skill cooldown time reduced by 10%.]\n\n*Not bad.*\n\nWhen he'd first learned Meditation, success took over five minutes. Grid allowed himself a moment of satisfaction. He'd improved. His progress was measurable.\n\n*The God Hands' Sword Mastery has gone up considerably.*\n\nCompared to when he'd entered the Behen Archipelago, he'd grown significantly stronger. The path hadn't been wasted. Still...\n\n*When can I escape this labyrinth?*\n\nHe wanted to clear it before the National Competition. The deadline loomed. Grid stood, joints popping. Magic Detection should be ready. He approached the three paths ahead, darkness yawning from each tunnel.\n\n*Magic Detection.*\n\nPahat!\n\nMana poured out, searching for life. Grid focused on each path in turn. Then froze.\n\n*Eh?*\n\nNo signs of life. Anywhere. In any of the three paths.\n\nThis was a first.\n\n*What am I supposed to do?*\n\nAccording to Braham, the closer he got to the exit, the greater the danger. But all three paths were empty. No threats detected. Grid's confusion mounted.\n\n*Should I ask Braham for help again?*\n\nHe'd already used Assimilation three days ago during a major crisis. The cooldown wouldn't reset for at least six more days. Waiting meant wasting precious time. And...\n\n*In the first place...*\n\nEvery time he relied on Braham, he felt like he regressed. Like he was getting weaker instead of stronger.\n\n*I've been doing this alone so far.*\n\nHe could figure this out. Grid took a deep breath, forcing his exhausted brain to focus. Then clarity struck.\n\n*Perhaps?*\n\nEvery path he'd taken so far had monsters waiting. Every. Single. One. What if...\n\n*Maybe I've already passed the labyrinth?*\n\nThe exit could be right in front of him. But he couldn't go back after choosing a path. The risk paralyzed him. If he was wrong, he'd fall into a new labyrinth, lose progress, waste time.\n\n*It will produce a more valuable result than staying here.*\n\nIf his theory was wrong and he entered another labyrinth, he'd simply find the exit again. Grid gathered his courage, every muscle tense. He stepped into the middle path.\n\n> [You have succeeded in breaking through the labyrinth!]\n> \n> [You have acquired 2,150 Challenger Points for the mission success.]\n> \n> [You have entered Treasure Island (the 57th island)!!]\n> \n> [Escape from Treasure Island in the next three minutes.]\n\n\"Ohh! Ohhhhhh!\"\n\nJoy exploded through Grid's chest. Gold glittered everywhere. Treasures piled high. Mountains of wealth stretched before him, more beautiful than any sunrise.\n\n*Today's lunch is seafood jajang!*\n\nHe moved to summon Noe and Randy. They'd help gather everything in sight.\n\n> [Fog Island haunts this island.]\n\nThick fog rolled across Treasure Island, swallowing the gold from view. Everything vanished into white.\n\n\"Ah.\"\n\nTears streaked down Grid's face. Deep, bitter tears of regret."
}