{
  "id": 401,
  "title": "Chapter 401",
  "content": "# Chapter 401\n\n> [Fog Island haunts this island.]\n\nGrid's breath caught in his throat. The system notification hung in his vision like a cruel joke.\n\nHe'd spent months fantasizing about this moment. Challenger points burning a hole in his inventory, waiting for the golden carriage to materialize. But now?\n\nHis knees buckled.\n\nGrid collapsed onto the sand, mouth working open and closed like a beached fish. The thick fog rolled across the beach, swallowing the glittering piles of treasure one by one. Gold coins. Jeweled weapons. Ancient artifacts. All of it vanishing into white nothingness.\n\n\"Treasure!\" The word tore out of him, raw and broken. \"My treasure!\"\n\nHis fingers clawed at the sand. The 41st island had nearly killed him. That damned clone with his own skills turned against him. Then the golden crowns on the 51st, each one a nightmare of coordination and timing. The monsters in the fifties had been brutal, and that labyrinth...\n\n*If Fog Island had appeared back then...* \n\nThe thought made his chest tight. No golden crowns stealing his bonus stage. No trudging through that mind-numbing maze. Just the shop, right when he'd needed it most.\n\n\"Dammit!\"\n\nReality tasted like ash. Lady Luck had abandoned him. No—that implied she'd been there in the first place. Grid was cursed. Had to be. What other explanation was there for this kind of timing?\n\n\"Damn!\"\n\nThe tears came hot and bitter. A year ago, this would have destroyed him for days. He'd have logged out, crawled into bed, and drowned in self-pity until the pain dulled.\n\nBut something had changed.\n\nGrid dragged his sleeve across his face. His breathing steadied. The grief remained, sharp and acidic in his throat, but his mind... his mind was already moving.\n\n*The harder the island, the better the reward.*\n\nHe pushed himself to his feet. Hands still shaking, but functional.\n\nTake the 41st island. If Fog Island had spawned there instead of the clone, he'd never have learned Linked Kill Wave. Never discovered Pinnacle Kill. Those skills had fundamentally altered his combat capability.\n\n*Right. It's actually good it didn't appear on the 40th.*\n\nGrid rolled his shoulders, forcing his muscles to relax. Positive thinking. Lauel's voice echoed in his head, lecturing about probability and long-term strategy.\n\n\"It's enough.\" His voice steadied. \"I'll get what I need.\"\n\nThe fog swallowed him as he walked. Thick and cold against his skin, it muffled sound until even his footsteps seemed distant. Then—light. Warm and orange, cutting through the white.\n\nThe pumpkin carriage sat exactly where it should, impossibly cheerful.\n\nGrid's eyes scanned the inventory display. Thirteen class change books floated in glowing frames, price tags shimmering beneath each one.\n\n*Pass.*\n\n<span class=\"rarity-uncommon\">Explosion Sorcerer</span> for 1,000 points. <span class=\"rarity-uncommon\">Lightning Swordsman</span> for 1,000 points. The prices climbed all the way to 15,000 for the rarer options. With 31,001 challenger points burning in his account, Grid could afford any of them.\n\nBut why would he?\n\nThird advancement classes had shifted the entire meta. These rare hidden classes—once the dream of every player—were now lateral moves at best. Downgrades at worst.\n\n*Next.*\n\nForty-six skill books. Grid's attention sharpened.\n\n**Normal** to **Unique** ratings scattered across the display. Several of the <span class=\"rarity-unique\">Unique</span> active skills made his pulse quicken. Raw damage. Crowd control. Utility.\n\nBut he was a legend.\n\nPagma's Swordsmanship already eclipsed most Unique skills. Spending points on marginal upgrades would be wasteful. Unless...\n\nHis eyes locked onto a single entry.\n\n> [Skill Book: Weapons Mastery]\n> \n> **Rating:** Normal\n> \n> **Type:** Passive\n> \n> The Weapons Mastery skill is generated.\n> \n> **Price:** 6,000 Challenger Points.\n\nWeapons Mastery. The apex of combat passives. Every weapon type, every attack, amplified. Yes, the percentage gains were smaller than specialized masteries. Sword Mastery would boost blade damage more. Spear Mastery would do more for polearms.\n\nBut Grid could equip *anything*. Without restriction. Without penalty beyond his stats.\n\nThis was synergy.\n\n\"I have to learn this.\"\n\nHis finger moved without hesitation, confirming the purchase. Six thousand points evaporated from his total.\n\n> [Skill Book: Weapons Mastery has been acquired.]\n\n\"Okay.\"\n\nThe skill book materialized in his inventory, a leather-bound tome pulsing with potential. Grid exhaled slowly, feeling the weight of the decision settle into satisfaction. He'd wanted this skill for months.\n\n\"Learn it right—\" \n\nHe froze.\n\nAnother skill book had caught his attention while he navigated the menu. One he'd scrolled past without thinking, because it should have been impossible.\n\n*Magic Mastery.*\n\n> [Skill Book: Magic Mastery]\n> \n> **Rating:** Normal\n> \n> **Type:** Passive\n> \n> The Magic Mastery skill is generated.\n> \n> **Price:** 5,000 Challenger Points.\n\n\"Ummm...\"\n\nMagic Mastery increased magic power. Shortened casting time. Standard passive for any mage worth their salt. Except Grid wasn't a mage. Couldn't be a mage. His class locked him into production and swordsmanship, and his Intelligence was barely functional.\n\n*Normally, this would be worthless to me.*\n\nBut normal had stopped applying the moment Braham's soul fragment had forced its way into his consciousness. Assimilation. The great magician's memories, skills, and knowledge bleeding into Grid's mind whenever they merged.\n\n*I can learn magic now. Braham's magic.*\n\nMagic Missile (Enhanced) alone had proven its worth. Instant cast, ignores magic resistance, damage scaling off Intelligence. The enhanced version of Magic Detection had saved his life twice on the later islands. Even the lowest tier of Braham's spells outperformed what ordinary magicians could achieve.\n\n*This isn't optional. I need this.*\n\nHis cursor hovered over the purchase button.\n\nFive thousand challenger points. Twenty elixirs. Twenty permanent stat increases, each worth ten points. Four hundred total stats sacrificed for a passive that might not pay off for months.\n\nGrid's jaw clenched. He stared at his Intelligence stat: 771 base, 1,111 with equipment bonuses. Pathetic for a spellcaster. He gained six Intelligence per level naturally, which meant...\n\n*One hundred levels to gain six hundred Intelligence. Will I even learn Fireball before Braham's soul leaves?*\n\nBut Lauel's words cut through the doubt. *Don't optimize for today. Optimize for the end game.*\n\nForest, not trees.\n\nGrid took a breath. His finger pressed down.\n\n> [Skill Book: Magic Mastery has been acquired.]\n\nThe confirmation message mocked him with its cheerfulness. His point total dropped like a stone.\n\n**Remaining Challenger Points: 20,001**\n\n\"Ugh...\"\n\nThirty-one thousand to twenty thousand in seconds. His stomach lurched. All those hours, all those trials, watching his safety net shrink...\n\nBut.\n\n*It's not wasted.*\n\nThese skills would make him stronger. Simple as that. Regretting necessary investments was the mindset of someone who'd already lost. Grid forced his breathing steady and pulled up the elixir menu.\n\nThe list was mercifully straightforward.\n\n> [Strength Elixir]\n> \n> Permanently increases strength by 10 points.\n> \n> **Price:** 250 Challenger Points.\n\n> [Stamina Elixir]\n> \n> Permanently increases stamina by 10 points.\n> \n> **Price:** 250 Challenger Points.\n\n> [Agility Elixir]\n> \n> Permanently increases agility by 10 points.\n> \n> **Price:** 250 Challenger Points.\n\n> [Intelligence Elixir]\n> \n> Permanently increases intelligence by 10 points.\n> \n> **Price:** 250 Challenger Points.\n\nCommon sense said a blacksmith needed Stamina first, Strength second. Survivability and carrying capacity. The foundation of any crafter.\n\nGrid ignored common sense.\n\n*I need Agility.*\n\nPiaro's ratio haunted him. One-to-one, Strength to Agility, when the old man had been the continent's strongest swordsman. Grid had studied his own stat sheet until the numbers burned into his brain.\n\nHis status window flickered open.\n\n**Name:** Grid  \n**Level:** 306  \n**Class:** Pagma's Descendant  \n\n**Strength:** 2,830 (+160)  \n**Stamina:** 1,306 (+230)  \n**Agility:** 1,836 (+130)  \n**Intelligence:** 771 (+340)  \n**Dexterity:** 2,916 (+680)  \n**Persistence:** 1,102 (+130)\n\nStrength massively outpaced Agility. The gap yawned wider every time he checked. His attacks hit like freight trains, but his recovery time after each swing left openings. Enemies who couldn't match his raw power still dodged, countered, exploited the lag.\n\n\"All remaining points into Agility elixirs.\"\n\nTwenty thousand points. Eighty elixirs. Eight hundred Agility, equivalent to eighty levels of natural growth. Grid's cursor moved to the purchase button beneath the Agility elixir.\n\n> [A consumable item. Please enter the number you want to purchase.]\n\nHe smiled. Finally. Months of grinding, of suffering through the Behen Archipelago's sadistic difficulty curve, about to pay off in pure statistical power. His fingers moved to type '80'...\n\nAnd stopped.\n\n*Is this right?*\n\nBefore the clone fight, he wouldn't have hesitated. Dump everything into Agility, close the gap with Strength, become a faster killing machine. Simple. Effective.\n\nBut that was before Assimilation. Before Magic Mastery burning in his inventory. Before the realization that he could learn actual spells, not just swing swords at progressively larger health bars.\n\n*I gain six Intelligence per level naturally.*\n\nGrid did the math. One hundred levels meant six hundred Intelligence. Pitifully slow growth for a stat that gated his entire magical development. At this rate, Braham's soul would dissolve long before Grid learned anything beyond basic enhancements.\n\n*Stop being short-sighted. I'm not just aiming for legend. I'm aiming for myth.*\n\nLauel's philosophy. See the forest, not the trees. Plan for the endgame, not the next fight.\n\nGrid closed his eyes. Took a long, deliberate breath. When he opened them, his voice was steady.\n\n\"I will buy 40 Agility elixirs and 40 Intelligence elixirs.\"\n\nAll-rounder. The word carried stigma in gaming communities. Jack-of-all-trades, master of none. Mediocre. Forgettable.\n\nBut a *legendary* all-rounder?\n\nThat was something else entirely. Universal capability. No weaknesses to exploit. No situations where he'd be useless.\n\nGrid's eyes blazed with certainty. For once, doubt didn't claw at his decision.\n\n---\n\n> [You have learned Weapons Mastery.]\n\n> [Weapons Mastery Lv. 1]\n> \n> * When a weapon is equipped, attack power will increase by 2% and attack speed by 1%.\n\n> [You have learned Magic Mastery.]\n\n> [Magic Mastery Lv. 1]\n> \n> Increases magic power by 3% and reduces casting time by 1%.\n\n> [You have taken the Agility elixir.]\n> \n> [Agility has risen permanently by 400.]\n\n> [You have taken the Intelligence elixir.]\n> \n> [Intelligence has risen permanently by 400.]\n\nEight hundred stats. Two mastery skills. Grid felt the changes ripple through his body. Muscles responded faster. Thoughts came sharper. His hands moved through a practice swing and the motion felt *cleaner*, more efficient.\n\nPower sang in his veins.\n\n\"Let's speed this up.\"\n\nConfidence straightened his spine as he approached the gate to the 58th island. The portal's surface rippled like mercury, reflecting his face back at him. Determined. Hungry.\n\nThe 58th island materialized around him in a burst of light. Time attack hunting dungeon. Kill monsters, beat the clock. Simple concept, brutal execution.\n\nGrid tore through it.\n\nHis enhanced Agility made him a blur. Weapons Mastery amplified every strike. When physical attacks weren't enough, Magic Missile (Enhanced) blasted through magical defenses, the spell crackling with power boosted by his new Magic Mastery.\n\nThe monsters were level 400-plus. Elites that would have forced him to fight cautiously last week.\n\nNow they were experience.\n\nBoth mastery skills climbed steadily. Beginner-level passives gained experience quickly against high-level enemies. The gap in power meant every kill fed disproportionate growth into his skills.\n\nGrid watched the numbers rise and felt something warm in his chest. Not quite happiness. Not quite pride.\n\nGrowth. Pure, undeniable growth.\n\nHe was getting stronger.\n\n---"
}