{
  "id": 402,
  "title": "Chapter 402",
  "content": "# Chapter 402\n\nTwo months ago, the Overgeared members struggled in the vampire cities. Now, after surviving the Behen Archipelago's trials, they were slaughtering vampires like cattle. No bloodsucker short of Beriache's direct descendants could threaten them anymore.\n\nInside one of the vampire cities, the Overgeared members cut through their enemies without mercy.\n\n\"Kyaack!\"\n\n\"H-Hiik!\"\n\nLauel watched the last vampire dissolve into ash. His brow furrowed.\n\n\"Didn't any of you buy an East Continent Portal Scroll?\"\n\n\"Huh? Of course I did.\"\n\n\"Yeah. Got one after the elixirs and skill books.\"\n\nLauel spread his hands. \"Then why are you still here? Why aren't you exploring the East Continent?\"\n\nHe had sacrificed his own combat potential for the guild. The Flow Master class could manipulate weather and terrain, but his personal fighting power was garbage. While the others had ascended to monstrous heights, Lauel was stuck farming vampires like some scrub.\n\n\"I've been lagging behind for months, so I'm stuck hunting these bloodsuckers. But you lot?\" Lauel gestured at the carnage around them. \"You should be off having new adventures, not babysitting me.\"\n\nThe Overgeared members exchanged glances. Someone scratched the back of their head.\n\n\"Didn't we only learn about the Behen Archipelago because of Grid?\"\n\n\"Right. Without him, we'd still be clueless about the East Continent.\"\n\n\"It'd feel wrong to reach the East Continent before Grid does.\"\n\n\"Like we were stabbing him in the back.\"\n\nLauel's eyes widened. Something hot twisted in his chest. *These idiots. These wonderful idiots.*\n\n\"So you were maintaining loyalty to our lord.\" Lauel smiled. \"How admirable. Then let's stop this solo farming nonsense and party up with me.\"\n\n\"Eh?\"\n\n\"You're loyal to Grid, right? Show me some loyalty too.\"\n\n\"...\"\n\nParty hunting meant faster clears but split experience and loot. With limited monster spawns, it was technically inefficient. But none of the Overgeared members could refuse. They knew how hard Lauel worked for the guild. Harder than Grid himself, if they were honest.\n\n***\n\n> [Your level has risen.]\n>\n> [**Level 312**]\n>\n> [Six points have been forcibly invested into **Intelligence** due to the influence of your second class, <span class=\"rarity-legendary\">Legendary Great Magician</span>.]\n\nThe 59th island was hell incarnate. Monsters level 420 and higher swarmed in packs. Grid faced three or four enemies at once, each one 114 levels above him. A desperate situation for anyone. But Grid was thriving.\n\nThe 400 bonus points in **Agility** and **Intelligence** from his second class carried him. So did **Weapons Mastery** and **Magic Mastery**.\n\n> [**Weapons Mastery** has increased to beginner level 6.]\n>\n> [**Magic Mastery** has increased to beginner level 4.]\n>\n> [The **Sword Mastery** of 'God Hand' has increased to intermediate level 7.]\n>\n> [Your memphis Noe has reached level 202.]\n>\n> [Doppelganger Randy has reached level 161.]\n\n*It's brutal.* But the difficulty meant fast, steady growth. *If only I had more potions.*\n\nHe hadn't expected the Behen Archipelago to be this punishing. His potion supply had dried up halfway through.\n\nClang! Claaaaang!\n\nGrid parried a stone club the size of a tree trunk. Noe and Randy kept one monster occupied while Grid handled two more. Blue flames flickered around the nearest troll as Grid activated Blacksmith's Eyes.\n\n> [**Blacksmith's Eyes** (Lv. 1) has analyzed the target's equipment.]\n>\n> [You have discovered the function of the armor worn by the Troll Lord!]\n>\n> [**Time Worn Leather Vest**]\n>\n> Defense: ???\n>\n> Option 1: ???\n>\n> Option 2: ???\n>\n> Option 3: Reduce damage from stabbing attacks.\n\n*Ah. That's why.*\n\nKill and Link had felt off. The Troll Lord's vest was eating the damage.\n\nChaaeng!\n\nGrid's increased **Agility** let him swing Grid's Greatsword faster than before. He deflected the Troll Lord's axe and drove forward.\n\n\"Pagma's Swordsmanship, Pinnacle Kill.\"\n\nSquelch!\n\n> [You have dealt 90,300 damage to the target.]\n>\n> [You have lost 4,500 health due to the recoil of Pinnacle Kill.]\n\n\"KIYAAAAAAH!\"\n\nThe Troll Lord staggered. Blood sprayed from the wound in thick, yellow gouts. Grid backpedaled fast.\n\n\"Damn it.\"\n\n*Can't give a troll breathing room.* But the blood was the problem. Highly acidic. It fountained from every cut, forcing Grid to keep his distance or lose his face.\n\nCrack! Crackle!\n\nThe Troll Lord's wound sealed shut. It grinned at Grid. *You can't kill me.*\n\nGrid grinned back. \"You're not even a named boss.\"\n\nWhat had the four God Hands been doing this whole time?\n\n*Shwooooom!*\n\nThe Troll Lord's eyes bulged.\n\nFour golden hands emerged from a nearby cave. They tossed Grid a new weapon.\n\n\"Let me show you something. Item Combination.\"\n\n\"KUOOOOH!\"\n\nThe weapon was beautiful. A blue shark-shaped greatsword with red lights drifting around it like falling cherry blossoms. <span class=\"rarity-legendary\">Failure</span> and Iyarugt, fused into a transcendent blade.\n\n\"Pagma's Swordsmanship. Linked Kill Wave.\"\n\n*KWA KWA KWA KWA KWA KWA KWA!*\n\n\"Ki...! KIEEEEEEK!\"\n\n*So what if the blood is acidic? I'll just attack from range.*\n\nGrid laughed as the Troll Lord crumbled to gray ash. His laughter died fast. His skills were on cooldown. More monsters were converging on his position.\n\n***\n\n> [You have entered the 60th island.]\n>\n> [This is a save point. Register your progress?]\n>\n> [Registration complete. When you next enter the Behen Archipelago, you will begin from the 60th island.]\n\n\"Hah... hah... God, that was close.\"\n\nGrid collapsed onto the ground. He wanted to use Meditation to restore health and stamina, but he couldn't focus. His mind was too wired.\n\n*The new skill is a problem.*\n\nBlacksmith's Eyes required him to stare at a target's equipment for at least three seconds. Easy on paper. In combat? Nearly suicidal. His field of view narrowed. He missed incoming attacks. Left himself wide open.\n\nWorse, the item information windows cluttered his vision mid-fight. Like someone had plastered a GPS navigation menu over his car's windshield while he was doing 120 on the highway.\n\n*I'll adapt. Eventually.*\n\nGrid turned his attention to the immediate problem. The 60s islands. Could he even progress through them? The Behen Archipelago's difficulty spiked every ten islands. The 66th island was the end.\n\n*The islands from 60 onwards are going to be incomparably harder.*\n\nHe'd wanted to clear the Behen Archipelago before the National Competition. That dream was dead. Grid sighed. The cooldown on Assimilation ended. Braham's soul stirred awake.\n\n**[Challenge it first.]**\n\n\"Braham!\"\n\nGrid had grown dangerously dependent on Braham's advice. He perked up.\n\n\"You mean I can win if I try the Behen Archipelago?\"\n\nBraham laughed. It was not a kind sound.\n\n**[You're too arrogant. This is a playground Pagma built. You haven't reached his full capacity. You don't have the ability to clear this place. I want you to challenge it so you realize how weak you still are.]**\n\n\"I've been meaning to ask. What do you mean by a 'playground Pagma created'?\"\n\n**[Do you know about the original Behen Archipelago?]**\n\n\"I heard from Sticks. It was a Hall of Fame celebrating the achievements of legends. A training ground for current legends.\"\n\n**[Correct. It's also a shameful place for those hostile to legends.]**\n\n\"Those hostile to legends?\"\n\n**[Great demons. They saw an opportunity to destroy the Behen Archipelago, which connects legends across time. Pagma installed various gateways to prevent this.]**\n\nGrid frowned. \"A space created to block great demons...\"\n\nWait. Something didn't add up.\n\n\"How did Pagma make this space?\"\n\nPagma was a legendary blacksmith, not a god. He could install traps and mechanisms. But summoning monsters? Reproducing past trials? Cloning challengers? *That's magic territory.*\n\nBraham's next words made Grid's blood run cold.\n\n**[It's possible for a great demon.]**\n\n\"What?\"\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to achieve goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}