{
  "id": 403,
  "title": "Chapter 403",
  "content": "**Chapter 403**\n\n> [It's possible for a great demon.]\n\n\"What?\"\n\nPagma was a great demon? Ridiculous.\n\n*Wait.*\n\nGrid started to deny it, then stopped. He didn't know enough about Pagma to judge. And Braham's nature was odd too.\n\n*Braham is a vampire, not a human.*\n\nA legendary great magician was a demonkin. Why wouldn't a legendary blacksmith be one too?\n\n*But why isn't it mentioned in the legends?*\n\nBraham laughed at Grid's confusion.\n\n> [Aren't you an idiot, to take my words at face value?]\n\nGrid frowned. \"I've taken the intelligence elixirs. Why are you still calling me an idiot? What does that mean?\"\n\n> [To put it more accurately, Pagma is a human who accepted the power of a great demon.]\n\n\"He accepted the power of a great demon?\"\n\n> [Baal.]\n\n\"...!\"\n\nGrid flinched. Not because he understood the weight of Baal's name. It was Braham's anger. The emotion ran deep in Braham's soul like an abyss, slowly boiling over. Grid held Braham's soul, so he felt it too.\n\n> [Pagma was Baal's contractor.]\n\n\"...!\"\n\nAnother shock. Grid's eyes filled with questions. \"What is Baal's contractor?\"\n\n> [...Hah.]\n\nSouls could sigh. Grid learned something new.\n\n***\n\nThe 1st great demon, Baal. As the peak of the 33 demons, he reigned as the master of hell. He was the demon king in all but name. An absolute existence that even the dragons guarded against.\n\n> [He is more faithful to his demonic instincts than anyone else. He is proud, destructive, and does anything for pleasure. Planting seeds of chaos through contracts with humans entertains him.]\n\n\"Why did Pagma sign with such a terrible demon?\"\n\n> [Ironically, he had to borrow Baal's strength to protect the Behen Archipelago.]\n\n\"Huh?\"\n\nConfusing. Pagma wanted to protect the Behen Archipelago from the great demons, so he borrowed the power of a great demon?\n\n> [It's as you said. Baal likes taunting and deception.]\n\n\"So?\"\n\n> [It is irrelevant to Baal whether the target being deceived is a human or a great demon like himself.]\n\n\"...\"\n\nThe old Grid would've been frustrated, unable to understand. Now he was different. He interpreted Braham's remark properly.\n\n\"Baal wanted to enjoy the entertainment of protecting against great demons using the power of a great demon. So he signed a contract with Pagma?\"\n\n> [That's right.]\n\nBaal screwed over his own people. Grid couldn't understand. Braham laughed.\n\n> [Don't look at great demons with prejudice. Don't humans also betray and hurt their own people?]\n\n\"But isn't Baal the master of hell? The king of the great demons? A king sacrificing his servants just for entertainment...\" Grid paused. \"I guess there are some like that.\"\n\nPlenty of crazy people existed in the world. Grid defined Baal as a psychopath great demon and moved on.\n\n\"This is why the Behen Archipelago changed this way.\"\n\nAnother question surfaced. Why did Pagma leave the Behen Archipelago in this state? He protected it through a contract with a great demon, then the archipelago deteriorated and lost its original function. If Pagma truly wanted to protect the place, he would've restored it after repelling the great demons.\n\nBut he didn't.\n\n*Was there a chance the great demons would invade again?*\n\nOr maybe Pagma had no power left.\n\nGrid voiced his thoughts. \"What happened after Pagma contracted with the great demon to protect the Behen Archipelago? Did he die? Or is he still alive?\"\n\n> [Why do you think he is still alive?]\n\n\"He contracted with a great demon. Wouldn't his lifespan increase?\"\n\n> [That's a ridiculous notion. The reason demons contract with humans is to take their life force and soul.]\n\n\"Something's strange. Pagma lived for a long time, right? You said hundreds of years. Wasn't it because of his contract with the great demon?\"\n\n> [You are mistaken. Pagma made the contract with Baal 100 years ago, not 300.]\n\n\"...Ah!\"\n\nGrid recalled Sticks mentioning the Behen Archipelago being fine 200 years ago. A new question arose.\n\n\"Does that mean Pagma can live for hundreds of years, regardless of the contract?\"\n\nWhat was Pagma's identity?\n\n\"How can a human live that long?\"\n\n> [...]\n\nBraham fell silent. Anger filled him again. Grid's spine soaked with cold sweat before Braham finally spoke.\n\n> [The reason Pagma could live for hundreds of years, despite being human, was because my lifespan was taken.]\n\n\"What?\"\n\nThe words didn't make sense. Braham was a vampire. Unlike humans, they had lifespans close to infinity. There might be a way to transfer his lifespan. It wasn't strange for a non-human legendary great magician to do something beyond common sense.\n\nBut Braham said his lifespan was 'taken.'\n\n\"You didn't give it willingly? Weren't you and Pagma close friends?\"\n\n> [What if I was deceived and betrayed?]\n\n\"...\"\n\nGrid wanted to hear more. He was curious. Braham didn't want to talk anymore.\n\n> [Well, if you want to know more about Pagma, reach the last island. Move to the 61st island. Then after experiencing the difference between your skills and Pagma's, see if you can challenge it again.]\n\nWhat was on the islands in the 60s that made Braham so sure he couldn't overcome them? Braham spoke to the troubled Grid.\n\n> [It is your duty to break through this place, so don't think about giving up.]\n\n\"I won't give up, even if you hadn't said this. I'm just worried about how dangerous it might be.\"\n\n> [What do you have to fear with an immortal body? As I said repeatedly, challenge it once.]\n\nBraham was right. The Behen Archipelago was deeply related to Pagma. There was a high possibility a quest related to Pagma's Successor was hidden here. Grid felt a need to investigate the islands.\n\n\"Okay.\"\n\nGrid moved toward the gate of the 61st island with determination. Sticks, who had been watching silently, urgently called out.\n\n\"Braham is a demonkin. You must not be misled by him.\"\n\nGrid glanced back. \"I know elves and demonkin have a bad relationship. But shouldn't you cool your head? You're the one most desperate for the Behen Archipelago to be purified. I can get rewards, so I have to move forward.\"\n\n\"...\"\n\nThat's right. He wasn't someone who would be dazzled by Braham's existence.\n\nThe enlightened Sticks followed behind Grid.\n\n***\n\n> [You have entered the 61st island.]\n\n**Kuooooh!**\n\nAn island covered with fire. The lush forest was burning. The river running through it was an ominous red.\n\n> [The temperature is very high.]\n\n> [You are affected by the heat.]\n\n> [Health and stamina are being continuously consumed.]\n\n> [You have resisted.]\n\n*The legendary passive is broken.*\n\nSatisfy fully implemented the five senses. Users naturally felt heat and cold. Climate was sometimes a disaster. But Grid didn't feel it due to being Pagma's Successor. He maintained a proper body temperature and played in a much more pleasant environment than others.\n\n\"Pant... pant...\"\n\nUnlike Grid's refreshed face, Sticks was sweating profusely. He looked ready to collapse.\n\n\"If you're a sage, shouldn't you have a countermeasure for the heat?\"\n\nSticks wiped his brow. \"There are a few ways, but I don't have the materials...\"\n\n\"Can't you use magic?\"\n\n\"It's hard to use mana because of my illness...\"\n\n\"...\"\n\n*Please don't die.*\n\nGrid desired Sticks as a tutor for Lord. He prayed while moving forward.\n\n*There are no monsters or missions.*\n\nThe shape itself seemed different from the other islands.\n\nGrid crossed the blazing island, looking left and right. His attitude was more cautious than ever. He concentrated intensely, prepared for any sudden attacks. However, it was meaningless against a strong enemy that couldn't be defended against.\n\n**Step, step.**\n\nThe footsteps moving through the forest sounded relaxed and proud. The owner didn't seem to care that Grid discovered his position.\n\n*Who?*\n\nGrid turned his gaze in the direction of the footsteps. He frowned. He couldn't see anything through the smoke.\n\n*The smoke has thickened?*\n\n**Step, step.**\n\nThe footsteps were getting closer. Grid urgently pulled out his weapon and used **Magic Detection (Enhanced) Lv. 2**.\n\n> [No life has been detected.]\n\n*What?*\n\nNo life detected despite the footsteps? Grid felt baffled. He wielded Iyarugt in the direction the footsteps came from. But the smoke was darker than normal, and he couldn't see the target properly.\n\n**Puok!**\n\n> [You have suffered 50,040 damage.]\n\n\"Keook...!\"\n\nThe enemy had moved. The attack was supposed to be in front of him, but it turned in a flash and struck his back. Grid's eyes widened. He lost more than two-thirds of his health in one blow.\n\n> [That's right. It's Lantier.]\n\nBraham identified the enemy hidden in the smoke."
}