{
  "id": 404,
  "title": "Chapter 404",
  "content": "# Chapter 404\n\n\"Lantier?\"\n\nGrid frowned. The name tugged at something in the back of his mind, but the connection slipped away before he could grasp it. *Where have I heard that before?*\n\nHe summoned Noe and Randy with quick gestures. The God Hands scattered across the chamber, forming a defensive perimeter. Grid uncorked a potion and drank deeply, wiping his mouth with the back of his hand.\n\n\"Who is Lantier?\"\n\n[Lantier isn't an individual's name.]\n\nBraham's voice echoed through Grid's skull. Eclipse. The strongest and worst assassination group believed to have existed more than a thousand years ago.\n\n[Lantier is the name passed down to the leaders over generations. But there is only one Lantier that I know.]\n\nSuuuuoh.\n\nThe black smoke thickened, billowing up from the ground in oily tendrils. Grid raised his arm to shield his face as the murk swallowed the chamber whole. Through the choking darkness, Braham spoke again.\n\n[The legendary assassin.]\n\n\"What...?\"\n\nGrid's stomach dropped.\n\nPeeng!\n\nOne of the God Hands shot backward like a cannonball. It tumbled through the air, completely overwhelmed by the force of the blow. Grid's eyes widened. *The God Hands have never reacted like that before.* Whatever hit it possessed monstrous attack power.\n\n\"Kuk!\"\n\nGrid jerked his head to the side. A golden hand whistled past his ear, so close he felt the displaced air against his skin. Noe's fur bristled as he tracked the projectile's trajectory.\n\n\"Behind you! Nyang!\"\n\n*Again?*\n\nThe enemy had moved from front to back in an instant. No transition. No warning. *This bastard has some kind of teleportation skill.*\n\n\"Save me!\"\n\nThe God Hands converged on Grid's position in a blur of gold. They formed a barrier at his back just as another attack came.\n\nChaaeng!\n\nA dagger struck the clustered hands with the shriek of metal on metal. The shockwave cleared the smoke in a perfect sphere, and Grid finally saw his opponent.\n\n*Skeleton?*\n\nLantier wasn't human. The legendary assassin had become a walking corpse. Bones clattered as he moved, held together by some dark power Grid couldn't identify. The skeleton gripped a dagger in finger bones so thin they looked like they'd snap under pressure. Aquamarine light burned in the empty eye sockets, cold and malevolent.\n\n*Undead. That's why Magic Detection didn't work.*\n\n[No, the result would be the same even if Lantier was alive. It isn't easy to find Lantier when he doesn't want to be found.]\n\nBraham's tone carried a note of grim respect.\n\n[The basics of an assassin involve hiding. They erase their presence. Lantier was a top assassin who earned the title of legend. He doesn't just erase himself. He can deny his existence in the world.]\n\nGrid clenched his jaw. *Great. Just great.*\n\n[On the other hand, your Magic Detection is only at level 2. It's virtually impossible for you to find Lantier. Even more so when he's undead.]\n\nSururuk.\n\nThe skeleton melted back into the smoke. Grid activated the Slaughterer's Eye Patch and pushed his Insight to its limits, scanning desperately for any trace of movement. Nothing. Lantier had vanished as completely as if he'd never existed.\n\n\"Why is he an undead?\"\n\n[Baal's Contractor has the ability of a necromancer. Pagma found Lantier's body and turned him into a death knight.]\n\n\"Heok.\"\n\nGrid's throat tightened. *So Pagma was a legendary blacksmith, a great swordsman, AND a necromancer?*\n\n*It's a scam.*\n\nThe history books claimed Pagma had helped neutralize the invasion of the great demons alone. Grid felt a familiar despair crawling up his spine. *If the legendary assassin's death knight is on the 61st island...*\n\n*Then other legends will emerge on the 62nd through 66th islands.*\n\nThe gap between past legends and present ones yawned like a canyon. The old legends were complete, perfected over lifetimes of achievement. The current legends were still growing. Grid's level was low. His class quests remained unfinished.\n\n*How am I supposed to clear this place?*\n\nBraham's voice cut through his spiraling thoughts.\n\n[The undead legends are very weak compared to their complete state. On the other hand, you have me. If you rely on me and keep learning magic, one day you will be able to beat them.]\n\nGrid nodded slowly, trying to convince himself. \"That's right.\"\n\n*Pagma might be a legendary blacksmith and necromancer, but I'm a legendary blacksmith and magician. I'm qualified to become the strongest. I have the potential to overcome any trial. Just...*\n\n[I question if you can even learn Fireball.]\n\n\"...\"\n\nGrid's eye twitched. *This damned ghost.*\n\nBraham's whisper snapped him back to full alertness.\n\n[He's coming back.]\n\nThe God Hands scattered throughout the chamber suddenly jerked in unison, sensing the enemy's approach. Grid had spread them like a spider web, but now he realized the flaw in that strategy. *A spider web might hold a small bird, but it's easily torn by beasts.*\n\nSyuk!\n\nLantier's black cloak billowed as he materialized from the smoke. He weaved through the God Hands like water flowing around stones, dismissing each one with casual efficiency. Noe's claws raked across the cloak, but the fabric barely registered the damage. *High resistance,* Grid noted grimly.\n\nThe dagger came next. Grid's Slaughterer's Eye Patch activated, painting the attack's trajectory in his mind.\n\n*Okay! I read the orbit!*\n\nHis high Insight, the Eye Patch, and Iyarugt's guidance combined into perfect synergy. Grid twisted his body, and the dagger passed through empty air. Victory surged through him for half a heartbeat.\n\nPahat!\n\nLantier appeared behind him. The dagger descended toward Grid's exposed back.\n\n\"I'm not an idiot who will fall for the same trick three times!\"\n\nGrid had already activated Revolve. His footwork shifted, and Iyarugt moved with fluid precision to catch Lantier's strike. The impact rang out as Grid redirected the blow, dealing 50,000 damage back to his opponent.\n\n[This obvious tactic is a trap.]\n\nBraham's warning came too late.\n\nChaaeng!\n\nLantier flew backward from Iyarugt's counter. Grid smiled through the scattered red afterglow, satisfaction warming his chest. Then his eyes widened.\n\n*Fake?*\n\nLantier dissolved like smoke, the image dispersing into nothingness. The real assassin appeared at Grid's side. Pain exploded through Grid's ribs.\n\nPuok!\n\n> [You have been hit by a lethal blow!]\n\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\n\"Hah!\"\n\nGrid barked out a bitter laugh. *Two blows. It only took two blows to trigger my immortality passive.* The strength gap was absurd. Insurmountable.\n\n[You have inherited Pagma's power, but this is reality. As you are now, you can't even win against a creature made by Pagma.]\n\nBraham's words carried a deliberate weight. He wanted Grid to realize his own powerlessness. To understand that he needed to crave magic. To grow as a magician.\n\n*Why is he pushing this so hard?* Grid wondered distantly. *Does Braham want to resurrect himself faster by raising my intelligence?*\n\nThat was certainly part of it. But Grid suspected the real reason ran deeper. Braham believed magicians were simply superior to blacksmiths. He thought Grid would be better off growing as a mage.\n\nBut Grid was a blacksmith to his core. Even now, even bleeding and broken with five seconds of invulnerability ticking away, he analyzed the situation from a craftsman's perspective.\n\n*Lantier is strong for a reason. His basic abilities and skills are excellent, but he also has good items.*\n\nThe dagger gleamed with white light. Grid couldn't be certain, but it looked like adamantium. *If Pagma made that weapon in his prime, its attack power probably exceeds my Greatsword by a wide margin.*\n\n*The cloak has high defense too. I can't even imagine the armor underneath.*\n\nHis conclusion crystalized with absolute clarity.\n\n*To beat this place, I need stronger items.*\n\nUnlike Braham's intentions, Grid's desire as a blacksmith roared to life. He activated Blackening and threw himself at Lantier for the remaining five seconds. The result was, predictably, total failure. Lantier didn't allow Grid to land a single hit. Noe, Randy, and the God Hands were obsolete in the face of the legendary assassin's skill.\n\n> [You have died.]\n\n> [Returning to the 60th island.]\n\n***\n\n\"This game is truly about items.\"\n\nGrid sat on the 60th island, mind already racing ahead. Level, stats, skills, and magic growth were just the foundation. The real key to progression lay in equipment.\n\n*When I challenge the Behen Archipelago again, items are what I need to focus on.*\n\n*Let's assume the legends on the 62nd through 66th islands are also undead.*\n\nThe solution was obvious. He needed to craft items specifically designed to be deadly against the undead.\n\n*I also need to make items for Noe and Randy.*\n\nIn retrospect, Noe had always relied on his claws for combat. Randy used copied weapons. *They'd become so much stronger with proper equipment.*\n\n*As a bonus, I'll learn magic.*\n\nGrid's lips curved into a grin. Magic would be the icing on the cake.\n\n\"Kukukuk!\"\n\nHis laughter echoed across the empty island.\n\n[...]\n\nBraham's silence was thick with confusion and growing anger. Grid had tasted failure and frustration countless times before. This response was completely different from what Braham had predicted.\n\n*Has he lost his pride after the fight?*\n\nBraham knew nothing about human psychology. The absurd thought circled through his consciousness, stoking his fury.\n\n*He considers magic a bonus.*\n\n> [Braham's affinity has decreased by 2.]\n\nBraham's affinity for Grid fell to 68 points. If the two of them were opposite sexes, it would be high enough for marriage.\n\n***\n\nIt was a joyous day for Reidan.\n\nLord Grid returned after a long absence.\n\n\"Dear husband!\"\n\nIrene rushed out to the city's outskirts, her dress billowing behind her. She was the heir to the best family in the kingdom, lady of Bairan, and Grid's duchess. Still bright, still beautiful, still lovely.\n\n\"Irene.\"\n\n\"Dear husband!\"\n\nIrene had become more aggressive after giving birth to Lord. She threw propriety to the wind, ignoring the residents and soldiers watching as she embraced Grid and kissed him deeply. Heat crept up Grid's neck as Lauel's whisper invaded his thoughts.\n\n-In order to raise Reidan's fertility rate, you must set an example as the lord. Please share your hot love where people are watching.\n\nGrid's face burned. \"...\""
}