{
  "id": 405,
  "title": "Chapter 405",
  "content": "# Chapter 405\n\n> [Lauel's Message: In order to raise Reidan's fertility rate, you must set an example as the lord. Please share your hot love even more where people are watching.]\n\nGrid stared at the text hovering in his vision. Lauel meant to actively express positive affection. A simple example was to stroke her cheek or whisper loving words in her ears. He wanted to engrave the perception that this couple's relationship was beautiful and happy into the public consciousness.\n\nBut Grid misunderstood.\n\n*This guy has seen too many Japanese videos.*\n\nWhy would he share a hot love in front of everyone? Wasn't a hot love beyond kissing? Doing this act in the middle of the city, not the bedroom, and in front of more than 20,000 people? It was impossible unless he was a complete pervert. It was a completely crazy idea.\n\nGrid sent a message back, his lip curling.\n\n> [Grid: W-What is it?]\n\nLauel saw the contempt in Grid's eyes through the video feed and panicked. It was the day when the pure youth Lauel was labelled as a pervert.\n\nAnd on this day. Lauel was disappointed with Grid's uncooperative attitude and made a pledge.\n\n*I will take initiative for My Lord.*\n\nLauel's project to create a second generation had begun. It was at this time that the legendary 'Reidan's Female NPC Strategy' was written.\n\n***\n\nIt was only six days before the National Competition. Grid was supposed to leave for France in four days.\n\nBased on Satisfy's time dilation, Grid had 12 days to spare.\n\n*I must finish all the preparations.*\n\nThus, he hurriedly returned to Reidan. Now wasn't the time to be like this.\n\nGrid looked down at Irene, her dark hair splayed across the pillow. \"I love you, but I'm sorry. Please be satisfied with this today.\"\n\nTime was short. Grid saw Irene's nakedness after a long time and used his hand techniques. After a while.\n\nIrene's breathing slowed, her face flushed. \"...I love you, dear husband.\"\n\nGrid's **Dexterity** stat had long gone beyond the realm of a human. Grid satisfied Irene in a short amount of time and left for the smithy.\n\n***\n\nReidan's super large smithy loomed before him, the eight furnaces visible through the open doors.\n\nKhan and the young blacksmiths welcomed Grid, who had been missing for a few months. Grid observed Khan with the **Great Lord's Sword** and felt admiration.\n\n*Advanced level 8?*\n\nIn fact, Grid had thought Khan's blacksmithing skill would stagnate at advanced level 7. But in contrast to his expectations, Khan was steadily developing. The process of training talented young blacksmiths seemed to give Khan a new understanding.\n\nGrid approached the old man. \"Maybe you have a chance to become a craftsman?\"\n\nKhan chuckled, waving a gnarled hand. \"Huhu, you are overrating me.\"\n\nHistorically, only 10 blacksmith craftsmen had emerged. Khan didn't dare aim to be recognized as a craftsman. But Grid thought differently.\n\n*Khan is Albatino's descendant. He comes from a long bloodline of blacksmiths and has more passion than anyone. If I support him well, he can become a craftsman.*\n\nMaybe he would be reborn as a named NPC. Grid felt greedy as he headed towards the furnace located in the innermost area of the smithy. A typical furnace was always dirty, but Grid's was clean. It was thanks to Khan always cleaning it for him.\n\n*Really, I'm touched by that old man every time.*\n\nHis first friend, Khan. He prayed for the old man to live as long as possible. Grid's eyes were red as he started to prepare the firewood, while the young blacksmiths freaked out.\n\n\"Duke Grid! Let us do these menial tasks!\"\n\n\"It isn't your duty!\"\n\nIt was impressive. Two years ago in real time, he had been told by the old blacksmith in Bairan that he couldn't even cut firewood. Now he was in a position where he shouldn't be cutting them. He realized that he had become successful.\n\nGrid laughed and waved to the young blacksmiths. \"You can go and do your work. Today, I want to go back to my state of mind as a beginner.\"\n\nGrid thought that going through all the blacksmithing processes would improve his concentration. He prepared enough firewood and lit the furnace.\n\n*Tak! Tatak!*\n\nThe flames in the furnace started to slowly rise. Grid controlled the temperature of the flames and suddenly laughed.\n\n*If Braham saw this, he would be laughing at me.*\n\nHe would've argued that he could've raised the temperature of the flames instantly with magic power. But right now, Braham was silent. To be precise, he fell asleep just after using **Assimilation**.\n\nDid this mean that Grid used **Assimilation** recently? No. Grid hadn't use **Assimilation** during the past fortnight. The reason why Braham was exhausted and sleeping was due to what happened when Grid died on the 61st island some time ago.\n\n*I don't want to go to hell.*\n\nGrid had used **Blackening** against Lantier, and was in danger of falling into hell due to dying in the Blackening state. Braham said that if he fell into hell in this state, he would fall prey to the great demons. Therefore, he suppressed the dark gate trying to suck Grid into hell with magic.\n\nIn exchange, a message was added to Grid's current status window.\n\n> [Status Effect: Braham has 69 days, 9 hours, 3 minutes, and 15 seconds left to restore his magic power and wake up. You can't use the Assimilation skill until Braham wakes up.]\n\nBy the time 69 days passed in Satisfy time, the National Competition would be coming to an end. In other words, Grid had lost a powerful weapon in the National Competition. But Grid wasn't shaken. He believed he could play a role in the National Competition alone, without Braham's help.\n\n*I will make that belief come true.*\n\nHe needed items. He realized that there was a limit to developing his control. No matter how hard he tried, he couldn't be a genius like Kraugel and the Overgeared members. Therefore, he needed to make the best items.\n\n*Horse knight's helmet, troll lord's vest, crying ogre's gauntlets and golden crown's leggings.*\n\nIn addition, Lantier's cloak. Grid wanted to reproduce some of the items of the monsters he met in the latter half of the Behen Archipelago. It was because he needed new, more powerful armor.\n\n*The Holy Light set is really good. But...*\n\nThe **Holy Light Armor** had a high probability of resisting dark magic, increased the effectiveness of healing magic by 300%, and increased resistance to physical attacks. The **Holy Light Gloves** raised attack speed and accuracy, and had a low chance of activating the **5 Joint Attacks** skill. The **Holy Light Crown** raised his **Intelligence** and **Dignity** stats.\n\nOnce these three items were worn as a set, defense and health rose significantly. It was why Grid had been steadily using it since level 170. Yes, the Holy Light Set was very good.\n\n*If it was half a year to a year ago, I would still be able to call it a top-class armor.*\n\nBut not anymore. As the level of monsters and users increased, the value of the Holy Light set was falling. He was able to realize it after meeting Kraugel and experiencing the Behen Archipelago.\n\n*The problem is that the basic defense is too low.*\n\nIn particular, the crown and gloves had poor defense. It was almost defenseless. In the case of the **Holy Light Armor**, it wasn't bad, but the defense wasn't very high for armor. If there was no set effect, he wouldn't have used it from the beginning.\n\n*The 5 Joint Attacks of the gloves isn't too bad.*\n\nAt this point, the only advantage of the Holy Light Set was for healing or when facing magic. This thought became more widespread after dying from two of Lantier's blows.\n\n*I have to make an armor set for defense.*\n\nMonsters easily neutralized his attacks in the Behen Archipelago. He would gather the characteristics of the armor they were wearing.\n\n*First.*\n\nGrid confirmed that the furnace was at the right temperature and extracted the black iron and ogre blood.\n\n*Let's make the troll lord's breastplate.*\n\nFrom the time he became duke of Reidan until the present time, he'd earned around 147,000 gold from hunting and various quests. Of course, there was a separate sum that he invested into Reidan.\n\nIn any case, 147,000 gold was approximately 200 million won. Grid was planning to pour all of this gold into making items.\n\n*I will use the finest materials.*\n\nThe National Competition. It was the best stage of Satisfy that the entire world was paying attention to. Grid needed to invest enough to prove his worth on that stage. However, the concept of 'enough' wasn't understood properly by Grid.\n\nIn fact, 200 million wasn't a big sum. The rankers of various countries participating in the National Competition poured at least billions of won into upgrading items and skill books. Were they crazy?\n\nNot at all. This was a realistic amount. There were many sponsors attracted to the rankers participating in the National Competition, so money poured out abundantly. Of course, many companies offered to sponsor Grid.\n\nHowever, Grid refused. It was because the amount was too small. None of the companies set a high price on Grid, who had been nerfed. Most companies predicted that Grid would lose his events, so the average value they offered was 300 million. This was low compared to rankers like Chris and Zibal, who had been offered 12 times as much.\n\nGrid's pride was hurt and he had to refuse the offers. Someone might think he was stupid for kicking away 300 million because of his pride. But Grid thought differently.\n\n*I will get the best result.*\n\nCompanies that sponsored him would get astronomical results. Grid knew this fact, so accepting only 300 million won would make his stomach cramp with irritation.\n\nGrid vowed again. He would prove his worth to those who underestimated him and make them shed tears.\n\n***\n\n*Glossary of Common Korean Terms.*\n\n*OG: Glossary Link.*\n\n*Current schedule: 20 chapters a week.*\n\n*Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.*"
}