{
  "id": 406,
  "title": "Chapter 406",
  "content": "# Chapter 406\n\nScale armor.\n\nThe name told you everything. Several small iron plates laced onto leather straps, bound together with thick cloth or hide. The design allowed free movement, and the overlapping plates excelled at deflecting slashing strikes. Good resistance to cuts and stabs.\n\nBut compared to solid plate, the base defense was inferior. Worse, if an enemy targeted the gaps between the joined plates, a single thrust could prove fatal.\n\n*The gap between the plates. That's the real weakness.*\n\nGrid stared at the prototype sketches spread across the workbench. That weakness was why tankers avoided scale armor despite its classification as heavy armor. The advantages were obvious, but so were the limitations. Still, the troll lord's breastplate had given him an idea.\n\n*Multiple layers. If I stack the plates, I keep the flexibility but shore up the defense.*\n\nStandard scale armor used a single layer of joined plates. One good strike between them, and the protection failed completely. The troll lord's design had minimized that flaw with double-layered construction. Had no other blacksmith considered this?\n\nOf course they had. Every smith knew that adding layers increased protection. The reason they didn't do it was simple.\n\n*More iron means more weight. Too heavy, and you lose the mobility that makes scale armor worth wearing.*\n\nHeavy, movement-restricting scale armor defeated the entire purpose. If you were going to sacrifice mobility anyway, why not just wear full plate with superior defense?\n\n*But my items are different.*\n\nBlack iron. Two times harder than regular iron, three times lighter.\n\n*Thin plates. As thin as I can make them.*\n\nHe would create scale armor that remained light and mobile even with doubled or tripled layers. The technical challenge was immense. Smelting black iron was seven times harder than working regular iron. Even Khan, with Advanced Blacksmithing Level 8, couldn't smelt black iron thin enough to create hundreds of tiny scales.\n\nGrid was different. Legendary Blacksmith's Craftsmanship Level 7. Dexterity approaching 3,000. For him, working black iron felt no harder than how common smiths worked regular steel.\n\n*Time to prove why I'm a legend.*\n\nIn combat, he lacked many things compared to other legendary class users. He knew that. But as a blacksmith? He was the best. Period.\n\n*Ttang! Ttang!*\n\nThe hammer sang. The feel of mineral under his hands, the resistance of metal yielding to his will. Better than killing monsters. Better than gold. His concentration sharpened to a razor's edge as black iron met anvil.\n\n*The plates can't be too wide.*\n\nThe joints between plates provided scale armor's flexibility. Grid wanted narrow plates to maximize that characteristic. But smaller pieces meant exponentially more work.\n\nEspecially across three layers. Hundreds of tiny iron plates, each needing to be forged and fitted. Even with two full days of work, the task seemed impossible.\n\nGrid was a craftsman. Increased workload? Irrelevant. If better items required it, he would do it.\n\n*Ttang! Ttang!*\n\nSmall, thin pieces of black iron took shape under his hammer. The appearance, the size, the dark gleam. Like scales stripped from a black dragon.\n\n*Beautiful.*\n\n\"The scales are at least three times smaller than typical scale armor, but the detail work is exquisite.\" Khan watched from across the forge, arms crossed.\n\n\"He's already made over a hundred,\" one of the young smiths whispered. \"How many is the duke planning to forge?\"\n\n\"This would drive me mad,\" another admitted. \"The tedium alone...\"\n\nKhan and his apprentices observed in silence as Grid worked without pause.\n\n> [The Legendary Blacksmith's Patience skill has been activated.]\n\n> [Concentration, stamina and defense will rise to the extremes for one hour.]\n\n> [The Legendary Blacksmith's Breath skill has been activated.]\n\n> [The Legendary Blacksmith's Breath has increased the effectiveness of your production items.]\n\nRoosters crowed at dawn. Through the workshop window, the castle spires rose against the lightening sky. Grid never stopped.\n\n*Ttang! Ttang!*\n\nHis stamina stat carried him through the marathon session. One day bled into the next. Aside from meals and minimal sleep, the hammer never left his hand.\n\nTwo days later.\n\n> [You have successfully made the 'Scale Armor.']\n\n> [The structure is different from the 'Scale Armor' on your production list.]\n\n> [Analyzing the scale armor...]\n\n> [The function of your scale armor is phenomenal.]\n\n> [Scale Armor (Enhanced)]\n>\n> Scale armor modified by the legendary blacksmith Grid.\n>\n> Unlike conventional scale armor, it has a triple layer of iron plates.\n\nGrid blinked.\n\n\"...?\"\n\n> [<span class=\"rarity-legendary\">Scale Armor (Enhanced)</span>]\n>\n> Scale armor modified by the legendary blacksmith Grid.\n\nThe phrasing triggered a memory. Something familiar about those words. He couldn't place it at first, then recognition struck.\n\n> [Magic Missile (Enhanced)]\n>\n> A magic missile developed by the legendary great magician who has completely overturned the activation formula.\n\nBraham's magic. Just as Braham had deconstructed and improved existing spells, Grid could refine and enhance existing item concepts. For the first time, he truly understood what it meant to be a legendary blacksmith.\n\nNot just making items. *Evolving* them.\n\n> [Please decide the name of the item you have created.]\n\nThe system prompt appeared before displaying the final stats.\n\nGrid rubbed his jaw. Three layers of plates. The structure was the key innovation.\n\n*Three layers... like samgyeopsal.*\n\nThe Korean pork belly dish, with its three distinct layers of meat. A perfect comparison.\n\n\"Three Layers.\"\n\nHe said it without thinking.\n\n> [Have you decided on 'Three Layers?']\n\n\"Yes.\"\n\n> ['Three Layers' has been added to the list of item production methods!]\n\n> [<span class=\"rarity-legendary\">Three Layers</span> has been completed.]\n\n**<span class=\"rarity-legendary\">Three Layers</span>**\n\n**Rating:** Legendary  \n**Durability:** 721/721  \n**Defense:** 1,115\n\n* 30% reduction in damage from physical attacks.\n* 50% reduction in damage from stabbing attacks.\n* Passive skill 'Sword Breaker' will be generated.\n* **Strength** +50\n\nScale armor modified by the legendary blacksmith Grid.\n\nThe 621 small iron plates made by hand and joined into three layers ensures high defense without sacrificing mobility.\n\nEach iron plate features a small groove. If an enemy weapon strikes these grooves, there is a probability of the weapon being damaged.\n\nLike black dragon scales, these 621 plates shimmer whenever the wearer moves.\n\nOgre's blood strengthens the leather straps, slightly increasing the wearer's strength.\n\n**User Restriction:** Level 320 or higher. 1,500 strength. 1,830 stamina. Advanced Heavy Armor Mastery Level 5 or higher.\n\n**Weight:** 2,501\n\n> [A legendary rated item was produced, so all stats have permanently risen by +10 and reputation throughout the continent has risen by +500.]\n\n\"Wow.\"\n\nTwo and a half years. Not game time. Real time. Since becoming Pagma's Descendant, Grid had forged countless items. But only twelve had reached legendary rating. Even as a legendary blacksmith, his success rate remained brutally low.\n\nHe'd learned to manage expectations. To not hope for legendary outcomes. Hope led to disappointment, and disappointment bred mistakes.\n\nBut today, after months of grinding through the Behen Archipelago, he'd created a legendary item. The anticipation surged despite his best efforts to contain it.\n\n\"Finally...\" The word came out rough. \"Finally.\"\n\n*The heavens know my skills and heart.*\n\nGeniuses expected rewards for effort. For ordinary people, hard work often led nowhere. Especially for Grid. His entire life had been a lesson in unrewarded struggle.\n\nBut now the effort was bearing fruit. This was growth. Tangible, measurable progress.\n\n*Keep this momentum going.*\n\nGrid examined the armor with satisfaction. The <span class=\"rarity-legendary\">Holy Light Set</span> used adamantium, giving it superior options and durability. But the raw defense value of <span class=\"rarity-legendary\">Three Layers</span> exceeded even that legendary armor.\n\n\"Next. Helmet and leggings.\"\n\nThe balance patch for the National Competition. The nerf aimed directly at him. He could still see the headline floating in his mind's eye.\n\n*Grid's attack power, which is his biggest weapon, is suppressed.*\n\nHis lips curved into something that wasn't quite a smile.\n\n*I'm not just a damage dealer.*\n\nItems were flexible. An overgeared person could spec into any role. This National Competition would showcase attack power that defied the patch, backed by defense that would make him unkillable. A flawless damage dealer and tank. He would overturn every expectation.\n\n*Ttang! Ttang!*\n\nThe helmet took shape. Then the leggings. Gauntlets. Meanwhile, <span class=\"rarity-unique\">Lantier's Cloak</span> materialized through Item Creation, reconstructed from memory and understanding. Soon he would stand as the most overgeared player in Satisfy's history.\n\nMatchless. Unbreakable. Overwhelming.\n\n---\n\n**Glossary of Common Korean Terms**\n\n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}