{
  "id": 407,
  "title": "Chapter 407",
  "content": "**Chapter 407**\n\nA cloak. A coat that hung from the shoulders without sleeves. Most tailors handled these, given the typical materials: cloth and leather.\n\nBut blacksmiths made cloaks too. Natural, really. Any smith worth their hammer knew leather armor inside and out, which meant cloaks fell within their skillset.\n\nThe difference showed in the details. Tailor-made cloaks had better designs, more intricate options. Specialists in fabric and hide simply knew their craft. But a blacksmith's cloak? Superior base defense. Every time.\n\nGrid stared at the mental image of Lantier's Cloak as Noe trotted beside him on the road back to Reidan.\n\n*That cloak stopped my blade clean.*\n\nWhat kind of leather could shrug off Noe's claws without so much as a tear? He'd been chewing on that question for the entire journey, running through every type of hide he'd ever worked with as Pagma's Descendant. His mental catalog was extensive.\n\n*Nothing fits.*\n\nSure, some leathers were hard as stone. Excellent defense. Minotaur hide, blue griffin leather—both used in the best leather armor sets on the market. But for a cloak?\n\n*Too thick. Too heavy.*\n\nThe weight alone would be absurd. And despite being leather, they lacked the necessary softness. A cloak made from those materials wouldn't flow. It would hang like a wooden crate strapped to your shoulders. Completely impractical.\n\nSo what the hell was Lantier's Cloak made from?\n\n*Not cloth, that's for damn sure.*\n\nPagma had crafted the equipment for Lantier after the man became a death knight. And Pagma was a blacksmith, not a tailor. His skill with fabric would've been mediocre at best.\n\nGrid stopped walking.\n\n*Wait.*\n\nHe'd seen it up close on that island. The inside and outside of the cloak were different colors.\n\n*The outer layer was black.*\n\nBut the lining? Red.\n\n*He used two different leathers.*\n\nThe realization hit like a hammer strike. Pagma hadn't tried to find one miracle material. He'd layered two types to compensate for individual weaknesses while maximizing defense. Smart. Efficient.\n\nGrid started mentally sorting through leather types again, this time searching for combinations. Black leather was easy. Plenty of options. But red?\n\n*...Nothing.*\n\nThe closest thing was the pink leather from the lizard queen, and that was stretching it.\n\n*Way too rigid for an inner lining.*\n\nHe kicked at the sand in frustration. Over the past week, he'd finished his armor, helmet, and leggings without issue. But recreating Lantier's Cloak using the Legendary Blacksmith's Creation skill? That was proving to be a wall he couldn't punch through.\n\n***\n\nYura stood before the full-length mirror in her apartment. Her ebony hair fell straight past her shoulders instead of its usual practical length. The dress she'd chosen was short. Too short. It exposed her thighs and highlighted curves she normally kept hidden under jeans and simple shirts.\n\nHer reflection stared back. Confident eyes. Relaxed posture. The image of control.\n\n*I look ridiculous.*\n\nHeat crept up her neck and flooded her face. Pink spread across her pale skin like watercolor bleeding through paper.\n\n*This is so awkward.*\n\nShe tugged at the hem. It didn't budge. The fabric was designed to sit exactly where it was, and no amount of nervous fidgeting would change that. The thought of walking outside like this made her want to tear the dress off and burn it.\n\n*But.*\n\nToday she was meeting Grid. Shin Youngwoo. The first man who'd made her feel—\n\nShe cut that thought off.\n\n*He likes certain things. I can adapt.*\n\nThe real problem gnawed at her as she turned sideways. Grid's preferences were well-documented by the gossip networks. At least a D cup, supposedly.\n\nYura looked down.\n\n\"...\"\n\nShe reached for a padded bra, then stopped. Her hand fell to her side.\n\n*No. That's pathetic.*\n\nPride won out. She was already above average anyway.\n\nWhen she finally stepped outside, the reactions were immediate.\n\n\"Holy—\"\n\n\"Wow...\"\n\n\"I can die happy right now!\"\n\nMen of all ages stopped in their tracks. A few stood frozen on the sidewalk, staring. One elderly man pressed his hands together like he was praying.\n\nYura kept walking, eyes forward, face burning.\n\n***\n\n*Ding dong.*\n\nThree days until the National Competition started.\n\nYoungwoo heard the doorbell and groaned. He'd been up for thirty-six hours straight, fueled by coffee and stubborn obsession with a crafting problem that refused to solve itself.\n\n\"God Grid!\"\n\nThe voice was loud enough to rattle the windows.\n\nYoungwoo's eye twitched.\n\n*Peak Sword.*\n\nHe dragged himself to the door and opened it. Peak Sword stood on the doorstep, grinning like an idiot, radiating the kind of manic energy that only came from people who'd gotten a full night's sleep.\n\n\"You're as loud as ever.\"\n\nYoungwoo's voice was flat.\n\n\"Of course! I'm greeting God Grid, I have to be energetic!\"\n\n\"Yeah. Great.\"\n\nPeak Sword reminded him of Khan in that way. Infinite, unconditional affection for Grid, the character. The kind of loyalty you couldn't really be annoyed by, even when you wanted to be. Youngwoo sighed and waved him inside.\n\n\"Come on.\"\n\nHe shuffled toward the living room in faded blue house slippers and a green tracksuit that had seen better days. Peak Sword followed, then stopped.\n\n\"Whoa.\"\n\nYoungwoo glanced back.\n\n\"What?\"\n\n\"You've gotten... built.\"\n\nPeak Sword gestured at Youngwoo's shoulders, his legs.\n\n\"Last time I saw you, you were just jogging every morning. Now you look like you're actually training.\"\n\n\"I need to stay healthy if I want to focus on the game.\"\n\nYoungwoo grabbed a water bottle from the kitchen counter.\n\n\"Can't play if your body's falling apart. Virtual reality's exhausting.\"\n\n\"Good mindset. Very disciplined.\"\n\nPeak Sword nodded approvingly, then squinted.\n\n\"But what's with the dark circles? When's the last time you slept?\"\n\n\"I'm finishing up some items before the Competition.\"\n\nYoungwoo took a swig of water.\n\n\"Can't really afford to—\"\n\nHe stopped mid-sentence. His eyes locked onto something outside the window. Peak Sword's car was parked in the driveway. The paint job caught the afternoon light at an angle.\n\n*That color.*\n\n\"Pretty nice, right?\"\n\nPeak Sword puffed up with pride.\n\n\"It's a rare sports sedan. Cost me a fortune, but I figured it could stand side-by-side with your 13 series. You know, the 800 million won one.\"\n\n\"The paint...\"\n\nYoungwoo moved closer to the window.\n\n\"What about it?\"\n\n\"It's moonlight blue.\"\n\n\"Yeah, that's the official—\"\n\n\"Under sunlight it's blue. In shadow it's black.\"\n\nYoungwoo's hands clenched around the water bottle. Plastic crinkled.\n\n*That's it.*\n\nThe red leather for Lantier's Cloak. It wasn't red. Not inherently. It just looked red because of the environment it was in. The 61st island had been covered in flames, bathed in orange and red light. Any leather that changed color based on its surroundings would've appeared—\n\n\"I have to go.\"\n\nYoungwoo was already moving, heading for his capsule room.\n\n\"Wait, what?\"\n\nPeak Sword blinked.\n\n\"But the operational meeting? Today's the day we're supposed to plan strategies with the national team!\"\n\nYoungwoo was halfway down the hall.\n\n\"You guys can handle it!\"\n\n\"Yura's going to be disappointed...\"\n\nPeak Sword's voice was quieter now. He'd known Yura for years, watched her rise through the ranks, seen her maintain that perfect image of untouchable competence. But recently, after Overgeared formed, he'd noticed cracks in the armor. Small things. The way she paid attention when Grid's name came up. How she'd asked, casually, what Youngwoo liked.\n\n*She probably spent hours getting ready for today.*\n\nBut this was Grid. The man who broke the game's balance over his knee. The only Korean player who could legitimately compete for the number one spot globally.\n\nPeak Sword exhaled.\n\n\"...This is fine.\"\n\nHe pulled out his phone to text Yura.\n\n*God Grid's priorities will lift South Korea's status anyway. She'll understand.*\n\n***\n\n\"Youngwoo isn't coming?\"\n\nYura's voice was carefully neutral. Too neutral.\n\nPeak Sword winced.\n\n\"Yeah, he... something came up. With crafting. He said he had to finish some items before France.\"\n\n\"I see.\"\n\n\"...\"\n\nThey were sitting in the finest Korean restaurant in Gangnam. The private room had been reserved weeks in advance. Other members of the national team sat around the table, looking uncomfortable. None of them were stupid enough to miss the tension.\n\nYura stood abruptly.\n\n\"Excuse me for a moment.\"\n\nShe disappeared into the restroom. When she returned five minutes later, the short dress was gone. She'd changed into a white button-up shirt and jeans that she'd apparently had in her bag as a backup. The flowing hair was tied back in a practical ponytail.\n\nEvery man in the room felt a vague sense of guilt, despite having done nothing wrong.\n\nThe women, conversely, relaxed. The pressure of comparison had been lifted.\n\n***\n\n\"That's it! Why the hell didn't I think of this sooner?\"\n\nGrid stood in Reidan's massive smithy, staring at his item production list like it held the secrets of the universe. His focus zeroed in on one specific entry. The leather armor he'd made for Faker months ago.\n\n---\n\n> **<span class=\"rarity-epic\">Chameleon Armor</span>**  \n> *Rating: Epic ~ Legendary*\n\n> *Legendary Information:*  \n> **Durability:** 390/390  \n> **Defense:** 539  \n> • 35% reduction in damage from stabbing, cutting, and throwing attacks.  \n> • Normal chance of disrupting enemy vision.  \n> • *Stealth* skill effects increased.  \n> • Resistances adjust based on climate.  \n\n> *Armor crafted from chameleon lord hide. The leather possesses remarkable elasticity and shifts color and properties to match surrounding materials and environmental conditions.*\n\n---\n\nThe chameleon lord. Two meters tall. Muscular humanoid limbs. Its hide was resilient as hell, built to absorb physical attacks. And the color-shifting property was instant, a survival mechanism against predators.\n\n*That's how Lantier's Cloak survived Noe's claws and stayed intact in the flames.*\n\nGrid pulled up his notes on materials. The chameleon leather's high elasticity meant it could bond with other hides, creating synergy rather than conflict. And if he paired it with something naturally rigid for the outer layer...\n\n*Puri minotaur leather.*\n\nThe outer layer would be black, tough as iron. The inner lining would be chameleon hide, flexible and adaptive. The combination would give him defense, mobility, and environmental resistance all at once.\n\nHe activated Legendary Blacksmith's Creation.\n\nThe process took three hours. His hands moved on autopilot, layering materials, stitching with wire made from drake tendon, treating the leather with oils that would preserve flexibility without compromising durability.\n\nWhen the notification appeared, Grid's exhaustion evaporated.\n\n---\n\n> **<span class=\"rarity-legendary\">Lantier's Cloak</span>**  \n> *Rating: Unique ~ Legendary*\n\n> *Legendary Information:*  \n> **Durability:** 153/153  \n> **Defense:** 206  \n> • 20% reduction in damage from stabbing, cutting, and throwing attacks.  \n> • 10% probability of deflecting enemy attacks.  \n> • Resistances adjust based on climate.  \n\n> *Outer layer: puri minotaur leather. Inner lining: chameleon lord leather. The chameleon hide compensates for the minotaur leather's natural rigidity, creating a defensive cloak with exceptional blade resistance. Low probability of completely blocking enemy strikes.*  \n> *Note: Chameleon leather is not exposed externally, preventing stealth and vision disruption effects.*\n\n> **User Restriction:** Level 320+  \n> **Weight:** 690\n\n---\n\n\"Perfect.\"\n\nGrid held the cloak up. The black outer surface absorbed the forge light. When he flipped it, the inner lining shimmered with faint iridescence.\n\n*Every tank in Overgeared needs one of these.*\n\nTen hours until his flight to France.\n\nGrid laid the cloak aside and pulled up the schematic for his next project. His preparations for the National Competition were methodical. Complete.\n\nNothing would be left to chance.\n\n---\n\n*Glossary of Common Korean Terms.*  \n*OG: Glossary Link.*  \n*Current schedule: 20 chapters a week.*\n\n*Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.*"
}