{
  "id": 408,
  "title": "Chapter 408",
  "content": "# Chapter 408\n\n\"Nine hours?\"\n\nYoungwoo stared at Peak Sword from the passenger seat. The afternoon traffic crawled toward Incheon International Airport.\n\n\"We're not taking a boat. Why does a plane ride take that long?\"\n\nPeak Sword kept his eyes on the road. \"France is on the western edge of Europe. Nine hours is actually fast on a new aircraft. Older models take twelve.\"\n\n\"Damn.\"\n\nYoungwoo slumped against the window. *Nine hours. That's twenty-seven hours in Satisfy.* His jaw clenched. At his current level, twenty-seven hours of hunting would push his experience gauge by one and a half percent. He could finish Noe and Randy's equipment. He could spend time with Irene.\n\nAll of it, wasted. Trapped in a metal tube at thirty thousand feet.\n\n\"Why do we even need to gather in Paris?\" Youngwoo muttered. \"I can just log in from home.\"\n\nPeak Sword's grip on the wheel tightened. He fumbled with the dashboard controls, activating the self-driving system. The car's hum shifted to a steadier pitch as the AI took over.\n\n\"What's the real problem?\" Peak Sword turned toward him. \"Tell me what you're worried about. I'll fix it. Is it the food? I made a list of every Korean market and restaurant in Paris. Hell, I'll cook kimchi stew in front of the Eiffel Tower if you want.\"\n\n*This guy actually stops foreigners on the street to ask if they know kimchi.*\n\n\"Please don't do that.\" Youngwoo rubbed his temples. \"It's just... nine hours. I can't log in while we're flying.\"\n\n\"Ah.\" Peak Sword's expression brightened. \"That makes sense. You're always grinding.\" He snapped his fingers. \"We'll use Yura's private plane.\"\n\n\"Private plane?\"\n\n\"Yeah, it came up in yesterday's meeting. She's got Satisfy capsules installed. If you want to play during the flight, just ride with her.\"\n\nYoungwoo blinked. *She owns a private plane. With capsules.* Even with his ten billion won building under construction, the concept felt alien. *Exactly how rich is she?*\n\n\"How about it?\" Peak Sword glanced over. \"Want to take Yura's plane?\"\n\n\"I will.\"\n\n\"Perfect. I'll contact her now.\" Peak Sword pulled out his phone. \"Yura's going to be thrilled.\"\n\nYoungwoo didn't ask why she'd be happy. His head was too full of the National Competition. The chance to prove himself to everyone who dismissed him as a fraud, a pushover, a butcher who relied on items instead of skill.\n\nHe wanted it more than anything.\n\n***\n\n\"Welcome.\"\n\nYura stood at the top of the boarding stairs. She'd changed after Peak Sword's call. The short skirt replaced her usual practical attire. Her legs drew Youngwoo's attention before he could stop himself.\n\n*Really pretty.*\n\nEvery time he saw her, the reaction was the same. That timeless beauty that transcended race, made everything around her fade into background noise. Only Jishuka matched her. *No, Marie Rose too.* The vampire countess combined Yura's refined intelligence with Jishuka's raw magnetism. Even for an NPC, the perfection felt unreal.\n\nYura caught him staring. Her smile widened. *The outfit was the right choice.* She'd guessed his preferences correctly.\n\nThen her satisfaction shattered.\n\n\"Where's the capsule?\"\n\nThe question hung in the air.\n\nYura's cheeks burned. He'd glanced at her chest for a fraction of a second before asking. His priorities were painfully clear.\n\n***\n\nGrid exhaled as the virtual world materialized around him.\n\n*That was close.*\n\nHe'd known Yura was beautiful from TV appearances. But those clothes were different. New. The usual neat and professional Blood Witch had shown a side he'd never seen. His ideal type might be shifting without permission.\n\n*Get it together.* He hadn't rushed into the capsule out of indifference. The opposite. She'd been too pretty. He couldn't face her directly. Real women, not pixels and code, still short-circuited his brain.\n\n*Stop being an idiot. Yura wouldn't be interested in you.*\n\nHer positive attitude was partnership. Professional respect. Nothing more. He couldn't let himself misread the signals.\n\n*Why would someone like her be interested in me?*\n\nYura's ideal man was probably smart, charming, handsome, wealthy, well-connected. Someone from her world, not his. As Grid wrestled with his insecurity, a whisper notification blinked in his peripheral vision.\n\n**[Peak Sword]:** *Did you read the article from a month ago?*\n\n**[Grid]:** *Article?*\n\n**[Peak Sword]:** *About the participant reduction. It actually increases our medal chances.*\n\n**[Grid]:** *I was in the Behen Archipelago. Missed it. How?*\n\n**[Peak Sword]:** *The First Competition capped everyone at three events total, individual or team. The Second Competition removed the cap on team events.*\n\n**[Grid]:** *Team?*\n\n**[Peak Sword]:** *Boss raid, target processing, and siege. Rule changes let all participants from every country compete. That's why we had the strategy meeting yesterday.*\n\n*Interesting.* Grid's lips curved upward.\n\n**[Grid]:** *So if I win three individual golds and three team golds, South Korea takes the whole Competition?*\n\n**[Peak Sword]:** *Theoretically possible.*\n\n**[Peak Sword]:** *Not realistic though.*\n\nEven with Grid, Yura, and Peak Sword, South Korea was classified as weak. The other participants lagged behind in level and skill. Peak Sword himself had been gutted by the PvP patch. Team events would be brutal.\n\n**[Peak Sword]:** *Siege and target processing are probably losses. But the boss raid is different.*\n\nPeak Sword had watched Grid operate. The man's raid experience dwarfed most players. Hours upon hours of desperate combat against named bosses, field bosses, dungeon bosses. If anyone could clutch a raid victory, it was Grid.\n\n**[Peak Sword]:** *With proper support, I think we can take gold in the raid.*\n\nGrid frowned at the message.\n\n**[Grid]:** *I don't know the siege rules, but why not target processing? Can't we win that?*\n\nYura's magic gun excelled at long-range damage. Grid could fire Magic Missiles through the God Hands. Combined firepower should dominate a target shooting match. But Peak Sword saw a different picture.\n\n**[Peak Sword]:** *I can't protect you and Yura from enemy participants.*\n\n**[Grid]:** *Hrmm.*\n\n**[Peak Sword]:** *Sorry for dragging you down.*\n\nGrid's eyes narrowed. *That's not right.* Peak Sword was ridiculous sometimes, sure. Overbearing with his nationalism. But he was proud. Watching him shrink like this felt wrong.\n\n**[Grid]:** *Is the patch damage really that severe?*\n\nThe question came out sharper than intended.\n\nPeak Sword replied immediately, the honesty painful.\n\n**[Peak Sword]:** *It's my class concept. My base damage is way higher than other combat classes, but the delay after attacks is massive. If I can't kill with one strike, I get counterattacked and lose. If my damage is halved in the National Competition...*\n\nThe message ended there.\n\n*Damn.* Grid considered the problem. Minutes passed in silence.\n\n**[Grid]:** *Does attack speed affect the delay?*\n\n**[Peak Sword]:** *Higher attack speed reduces it. But my minimum weapon length is one meter fifty centimeters. Longswords have attack speed caps.*\n\n*That's just prejudice.*\n\nGrid remembered the Ideal Dagger. His match against Euphemina, the weapon he'd forged with agility and speed buffs baked into the steel. If those effects transferred to a longsword format, it could be a game changer. Not for a heavy greatsword, the weight and size would negate the concept. But a proper longsword? That could work.\n\n*I thought about it before.* He'd shelved the project. Armor production for the National Competition took priority, and his current weapons were strong enough. Iyarugt sat at eighty-three percent experience. The sword would probably hit legendary rating during the Competition, PvP experience scaling nearly as well as PvE.\n\n*Item Combination covers my offense.* But better to over-prepare than under-deliver. The Ideal Long Sword needed to move up the priority list.\n\n**[Grid]:** *I'll work on a sword during the flight to Paris.*\n\n**[Peak Sword]:** *A sword? For me?*\n\n**[Grid]:** *Don't misunderstand. It's not just for you. Now get me the materials I need.*\n\n**[Peak Sword]:** *Yes! I'll gather them right now!*\n\nPeak Sword wasn't like the other Overgeared members. They'd avoided asking Grid for upgrades before the Competition, knowing they might face him as enemies in individual events. Grid understood. Respected it, even. But Peak Sword was different. Minimum guarantee of being an ally in team events.\n\n\"Strengthen the same side first.\"\n\nGrid pulled up his mental crafting notes. Anyone who played games understood. You buff your party before the raid boss.\n\n***\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}