{
  "id": 409,
  "title": "Chapter 409",
  "content": "# Chapter 409\n\n## Paris, Charles de Gaulle International Airport\n\nOne of the busiest airports in Europe. Five hundred and thirty thousand planes landed and took off here every year. The terminal hummed with constant motion, a living organism of travelers and industry.\n\nThe Korean national team descended from Yura's private plane into Terminal 2E. \n\n\"Holy shit.\" Park Jonghwa's jaw went slack. \"How big is this place?\"\n\n\"Twice the size of Incheon.\" Peak Sword whistled low, studying the sprawling interior. \"Look at the map. It's an hour walk to the nearest exit.\"\n\nYura shouldered her bag with practiced ease. \"Don't worry. We'll take a bus.\"\n\nAs the 5th ranked player globally and one of the game's most recognizable faces, Yura had fielded invitations from dozens of countries. This marked her ninth trip to Paris. She moved through the terminal with the confidence of familiarity, leading the group on a twenty-minute trek to a bus stop.\n\nYoungwoo claimed the seat directly behind the driver. Old habits from his school days.\n\nHe exhaled slowly, watching the airport slide past the windows. \"At least we don't have to walk the whole way.\"\n\n\"This is just the shuttle.\" Yura settled into the seat beside him, close enough that her perfume cut through the recycled air. \"It takes us to the taxi stand. Then we catch a cab into the city.\"\n\n\"...\"\n\n*I'm never coming back here.*\n\nParis might be one of the world's premier tourist destinations, but Satisfy had rendered it obsolete. Why visit the Eiffel Tower when you could explore the Ivory Tower of Bairan? Why see the Seine when you'd sailed the Hebend River under two full moons?\n\nHe pressed his forehead against the cool glass.\n\nBeside him, Yura smiled. She studied Youngwoo's reflection in the window. His forearms had thickened over the past year, corded with lean muscle. The nervous boy who'd fumbled through their first meeting had been carved away, replaced by someone harder. Someone reliable.\n\n*Why is she sitting next to me when half the bus is empty?*\n\nThe question hit Youngwoo with delayed impact. He became suddenly, painfully aware of Yura's proximity. The soft fabric of her sleeve brushed his arm. Her profile was a study in elegant geometry: the straight line of her nose, the curve of her jaw, skin like fresh snow.\n\nHis pulse kicked up.\n\n*Calm. Stay calm.*\n\nHe clenched his fists in his lap, terrified that any movement might result in accidental contact. His palms were sweating.\n\n***\n\nForty minutes by taxi from Charles de Gaulle delivered them to the Shang X Lila Hotel.\n\nFive stars. Six hundred meters from the Eiffel Tower. The lobby stretched upward in a riot of baroque excess, all gold leaf and crystal chandeliers. Medieval opulence filtered through modern sensibilities. Guest rooms promised views of both the Tower and Montmartre.\n\nPark Jonghwa checked his phone, scrolling through the hotel's website. \"The restaurants here have Michelin stars.\"\n\n\"How much does this cost per night?\" someone asked.\n\n\"Cheapest rooms are two million won. Premium suites run thirty to forty million.\"\n\n\"Forty million won? For *one night*?\"\n\n\"Yes.\"\n\nSilence rippled through the Korean team.\n\nTwo hundred and twenty-four players had converged on Paris for the 2nd Satisfy National Competition. S.A. Group had booked them all into five-star accommodations for sixteen days. The world's wealthiest corporation, flexing.\n\n*Sehee would love this.*\n\nYoungwoo stood at the floor-to-ceiling window of his assigned room, watching the Eiffel Tower pierce the evening sky. His sister would have been squealing, taking a thousand photos, demanding they try every restaurant.\n\n*Next year. Starting next year, I'll bring her.*\n\nSehee was still in high school, grinding through exam prep with little time for Satisfy. Her level remained too low for competition eligibility. But she understood the value of what she'd stumbled into, that Saintess class. After she started university, after her schedule opened up...\n\nHe turned from the window and froze.\n\n\"What the hell is this?\"\n\nHis suitcase lay open on the bed. But instead of his usual training clothes and slip-on shoes, he found button-down shirts, dark jeans, leather shoes. Actual *style*.\n\n*She wants me to wear this?*\n\nFashion had died for Youngwoo years ago. He'd killed it himself, strangled it in the aftermath of his confession to Ahyoung. He'd dressed up for her, spent money he didn't have on clothes that were supposed to matter. She'd laughed. Not even cruel laughter, just casual dismissal.\n\nAfter that, he wore whatever was comfortable. Loose pants. Oversized shirts. Anything without a constricting collar.\n\n*Sehee, you...*\n\nShe'd asked so sweetly to pack his bags, claiming she wanted to help since he'd be gone so long. It had been a trap.\n\nYoungwoo showered, grumbling the entire time.\n\nThe clothes were organized into nineteen coordinated sets, each numbered. He selected Set 1. First day in Paris, first outfit. Simple logic.\n\nA note was pinned to the shirt.\n\n*[Roll your sleeves to your elbows and tuck the shirt in! Wear this watch!]*\n\n\"Her future husband is going to be exhausted.\"\n\nBut Youngwoo followed the instructions. Rolled sleeves. Tucked shirt. Watch clasped around his left wrist. He stood before the mirror.\n\nHis reflection caught him off guard.\n\n*I look... good?*\n\nThe old Youngwoo had been called ugly more times than he could count. High cheekbones, a prominent forehead, monolid eyes. His features had been sharp in an unfortunate way, giving him a perpetually nervous expression. Hunched shoulders. Rough skin. The total package of someone life had ground down.\n\nBut eighteen months had changed the equation. He'd gained weight, filled out his frame. Exercise had built actual muscle. His features had matured, and regular skincare had smoothed the rough edges.\n\nThe high forehead and filled cheeks now suggested Western features instead of malnutrition. Broad shoulders projected strength. His eyes, those unlucky monolids, had a hooded intensity that women apparently found attractive.\n\nSehee's styling had made it all work.\n\n*Knock knock.*\n\nThe sound jolted him from his narcissistic examination.\n\n\"Come in.\"\n\nPeak Sword entered, then stopped. \"Oh. You're actually dressed like a human for once.\"\n\nHe raised his thumb in approval.\n\nYoungwoo felt an absurd surge of pleasure. \"Let's go.\"\n\nThey descended to the ground floor, where the press conference was being held. The US, British, and Turkish teams had already claimed their seats.\n\n\"Grid!\" Regas waved from the British delegation, grinning wide.\n\nZibal, leading the US team, offered nothing. Not even a glance.\n\nBubat, the Turkish representative, stared. Just stared, unblinking, like Youngwoo was a puzzle he was trying to solve through sheer force of will.\n\n\"Huh?\" Youngwoo checked the nameplates, found his own name on the center seat. \"I'm the team leader?\"\n\n\"We voted at the meeting.\" Yura appeared beside him.\n\n\"Why would you—*Heok.*\"\n\nThe question died in his throat.\n\nYura had changed into a dress. Not just any dress. *The* dress, apparently designed by malicious divine intervention to destroy his concentration. Her hair was up, exposing the elegant line of her neck and collarbones. \n\n\"You're the strongest among us,\" Yura said, seemingly unaware she was committing assault with fashion. \"You're the master of Overgeared. Who else would represent us?\"\n\n*Do I even have leadership skills?*\n\nAs Overgeared's guildmaster, his primary activities involved crafting items and hunting. Leadership? That was Lauel's department.\n\nBut Yura's expression was earnest. She'd watched him during the Elfin Stone raid, seen how he'd coordinated their assault, how he'd minimized casualties through tactical positioning. She'd recognized something he hadn't seen in himself.\n\nShe wanted to cultivate that potential. The National Competition was the perfect crucible.\n\n\"I... Yeah. Okay.\"\n\nPeak Sword gave him a shove. \"Everyone's waiting, God Grid.\"\n\n\"Right.\"\n\nYoungwoo walked to the representative's seat. As he settled into the chair, something shifted in his posture. His spine straightened. His expression smoothed into neutrality.\n\nThe hundreds of journalists and staff in the conference hall felt it simultaneously. That wasn't the face of an anxious nobody. That was the face of someone accustomed to scrutiny.\n\n\"Apologies for the delay.\" Youngwoo's voice cut through the ambient noise. \"I'm Shin Youngwoo, also known as Grid. Korean team representative.\"\n\nMost people would wilt under such focused attention. The weight of hundreds of eyes, cameras, expectations. The old Youngwoo certainly would have. He'd barely been able to maintain eye contact with a single person, always staring at floors, at walls, at anything but human faces.\n\nSatisfy had beaten that weakness out of him.\n\nHe'd discovered his own value. Found confidence in achievement. Stood before crowds as Duke of Reidan, Hero of the Eternal Kingdom, leader of Overgeared. He commanded twenty thousand citizens and hundreds of guild members.\n\nHundreds of journalists? That was nothing.\n\n\"Is this live?\" Youngwoo scanned the cameras. \"Then I'd like to say hello to everyone watching.\"\n\nHis eyes were steady. His voice was level. The nervous wreck from the 1st National Competition might as well have been a different person.\n\nPeak Sword leaned back in his chair, grinning. \"This is why I follow you, God Grid.\"\n\nGenuine growth was rare. People changed slowly, grudgingly, backsliding at every opportunity. But Youngwoo had transformed himself through sheer necessity and stubborn effort.\n\nPeak Sword's respect was absolute.\n\n*Perfect.*\n\nYura studied Youngwoo's profile. The styling, the confidence, the maturity. Everything about this moment satisfied her on multiple levels.\n\nAcross South Korea, viewers watching the live broadcast reacted.\n\n\"Was Grid always this intense?\"\n\n\"Last year he seemed like a kid. Now...\"\n\n\"Did he get plastic surgery? He looks different.\"\n\n\"That's not surgery, you idiot. It's called 'stopped being poor and started taking care of yourself.' You should try looking in a mirror sometime.\"\n\n\"He's definitely been working out.\"\n\n\"A diamond in the rough.\"\n\nSatisfy transcended the boundaries of a simple game. It had become culture, economy, geopolitics. And South Korea's representative was Grid.\n\n*Ttiring~*\n\n*Ttiring~*\n\nSearch engine rankings refreshed in real-time. \"Shin Youngwoo\" climbed the trending lists.\n\nIn a small vegetable shop in Seoul, two people watched their TV with matching expressions of pride.\n\n\"Our son has become so dependable.\" Youngwoo's mother wiped her eyes. \"South Korea's representative for two consecutive years...\"\n\n\"We raised him well.\" His father nodded, voice thick. \"We raised him so well.\"\n\nThe National Competition hadn't even begun.\n\nYet Youngwoo had already seized the spotlight. Not as Grid, the legendary blacksmith. As Shin Youngwoo, the man.\n\nA foreign reporter shifted in his seat, expression souring. He raised his hand and prepared to throw verbal poison."
}