{
  "id": 41,
  "title": "Chapter 41",
  "content": "# Chapter 41\n\nValmont watched Grid being dragged away in chains. A smirk twisted his lips. \"A disgraceful person. Trying to beat me like this.\"\n\nHe turned to Rabbit, who stood silent beside him. \"How is it? He is arrested before the result came out, so there is no concern about losing public sentiment.\"\n\nRabbit's jaw tightened. \"That's right.\"\n\n*From the point of view of a company leader, Valmont's actions make sense.* Rabbit had worked for the Mero Company long enough to understand the calculus. In the past, he would have made the same move without hesitation. But now, something gnawed at him.\n\n*That youth called Grid.*\n\nThe memory of those gauntlets surfaced in his mind. A masterwork created in three hours. The craftsmanship was undeniable. *A blacksmith of that caliber might truly be the best on the continent.* To reach such heights at his age... the young man was a genius without equal.\n\n*He has tremendous growth potential.* Rabbit's merchant instincts thrummed beneath his skin. *If I could cooperate with that young man, I will be able to accumulate unmatched wealth.*\n\nEuphemina remained on stage, her fingers drumming against her thigh.\n\n*It is clear who the victor is.*\n\nShe had been confident after crafting the <span class=\"rarity-epic\">Dagger of Bewitchment</span>. It was an outstanding piece. Then Grid's work appeared on the display board, and her certainty shattered like glass. The difference in quality was stark. She had lost.\n\nAnd then Grid was arrested.\n\n*Exquisite timing.*\n\nThe whole spectacle left a sour taste in her mouth, but she couldn't afford to dwell on it. Euphemina descended the stage and approached Rabbit.\n\n\"The development was strange and the actual result might be different, but the crowd is convinced of my victory.\" She kept her voice level. \"Even though the game has been stopped, the crowd thinks I won. Isn't that alone sufficient to achieve the Mero Company's aim? So I want the reward.\"\n\nRabbit studied her for a moment, then nodded. \"It is as you said. I will keep the promise.\"\n\n> [Quest Success!]\n> \n> [1,500 gold has been acquired.]\n> \n> [Title 'Competitor' has been acquired.]\n> \n> [**Fighting Spirit** stat will be opened.]\n> \n> [**Good Luck** stat will be opened.]\n> \n> [The skill 'Rolling Dice' will be generated.]\n\nEuphemina's eyes widened as the notifications scrolled past. She pulled up the descriptions.\n\n---\n\n**[Fighting Spirit]**\n\nThe lower the health, the greater the attack power and mental state.\n\n* The higher the number, the higher the effect.\n* Stat points can't be distributed to this stat.\n\n---\n\n**[Good Luck]**\n\nThe likelihood of lucky phenomenon will increase.\n\n* The higher the number, the higher the effect.\n* Stat points can't be distributed to this stat.\n\n---\n\n**[Rolling Dice]**\n\nRoll a dice and a phenomenon will occur, depending on the number that is rolled.\n\n* If the target is yourself or an ally: There will be a beneficial effect if the number 4 or higher is rolled. There will be a harmful effect if the number rolled is 3 or lower.\n* If the target is an enemy: There will be a beneficial effect if the number 3 or lower is rolled. There will be a harmful effect if the number rolled is 4 or higher.\n\n---\n\n*A completely random skill?*\n\nFighting Spirit and Good Luck were excellent stats. The 'Agent of Revenge' quest faded from her mind for a moment. But Rolling Dice was... ambiguous. If she rolled well, it would be useful. If she rolled poorly, it could lead to disaster.\n\n*Still, if I increase my Good Luck stat, the probability of beneficial numbers should rise.* She allowed herself a small smile. *I'll be able to use it properly once the stat is higher.*\n\nEuphemina prepared to leave, then hesitated. \"By the way, why was that person captured?\"\n\n\"He was witnessed conversing with an enemy of Winston.\"\n\n\"They suspect he is an accomplice?\"\n\n\"Right.\"\n\n\"Oh.\"\n\nGrid had mocked her on stage. Part of her had wanted to beat him properly. Now he was in chains instead.\n\n*Thanks to that, I managed to clear the quest.* Lucky indeed. But regret pricked at her. *I wanted to know his identity.*\n\nIf he really possessed a unique class, knowing him could prove beneficial. She shook her head. *No, no. I don't want to see him again. Isn't his nature too horrible? I will just get more wrinkles if I get close to him.*\n\nShe turned to go. Rabbit's voice stopped her. \"You, in fact, you aren't a blacksmith, are you?\"\n\nEuphemina froze. Her pulse quickened. \"W-What are you suddenly saying? Didn't I make the dagger? How can I create something like that unless I'm a blacksmith?\"\n\n\"I noticed that Eria wasn't your real name.\" Rabbit's gaze dropped to her hands. \"In addition, I don't believe you are a blacksmith with those white, fine, delicate hands.\"\n\nHeat crept up her neck. Blacksmiths had scorched, calloused hands from working the forge. Her skin told a different story.\n\n\"In addition, the way you handled the bellows was very crude. Even a beginner blacksmith would be more skilled.\"\n\nShe said nothing.\n\n\"I noticed it more after you brought Khan to the stage, and then confirmed that you moved exactly like Khan.\" Rabbit tilted his head. \"Perhaps you are capable of duplicating the techniques of others.\"\n\nEuphemina could have denied it. Argued. Made excuses. But the prelude to a new quest hung in the air between them. \"So? What are you trying to say?\"\n\nRabbit cut to the chase. \"Will you help me? Go and rescue Grid.\"\n\n\"Huh? Why? Isn't he your enemy?\"\n\nRabbit shrugged. \"There is no eternity in front of money.\"\n\n\"I'm not sure what you're talking about.\"\n\nRabbit glanced around, then gestured for her to follow. He led her through winding alleys until they reached a secluded dead end. After checking that no one was nearby, he spoke.\n\n\"The Mero Company is greedy for maximum benefit from Winston, making it a ticking time bomb. It wouldn't be strange if Earl Steim received accusations against the Mero Company at any moment. In other words, there is a dark cloud in the Mero Company's future. It is time for me to leave it.\"\n\nHis eyes gleamed. \"As soon as I saw Grid's skills, I realized where my new job would be. Khan's smithy. I'll take a job at Khan's smithy. Then I will form a team with Grid. I will distribute Grid's works using my network of contacts and my business skills. If I assist Grid well, I believe that Grid and I alone can generate revenue equal to a small or medium business company.\"\n\n\"T-That much?\"\n\nEuphemina's breath caught. *One user has the potential to generate top-level profits?* The scale was staggering.\n\n*Who is the current first place merchant?* She searched her memory. *That's right, Beiga. He became first place three months ago. But I heard the scale of his company is so small that he isn't able to make a profit compared to the NPC merchants.*\n\nThe first ranked merchant couldn't even operate a small company properly. But Grid alone could generate that kind of revenue just by making items.\n\n*I know he doesn't have a regular class, but to think it is to this extent.*\n\nRabbit continued. \"These are the prerequisites to get a job at Khan's smithy. First, the fall of the Mero Company and Winston's lord. Second, makeover my image. Finally, the most important thing is to rescue Grid. If I can save Grid and cause the downfall of the Mero Company and Winston's lord at the same time, I will be able to appeal myself to Grid and the residents.\"\n\n\"So you need my help?\"\n\n\"Yes. I have been watching your abilities. They will be sufficient.\"\n\n> [Quest 'Help Rabbit's Job Seeking Plan' has been created.]\n> \n> **[Help Rabbit's Job Seeking Plan]**\n> \n> Difficulty: S\n> \n> Rabbit is uncertain about the future of the Mero Company. He predicts that the Mero Company will soon fall, but he would rather break it with his own hands so that he will get a new image.\n> \n> Help Rabbit rescue Grid and cause the downfall of the Mero Company and Winston's lord!\n> \n> Quest Clear Conditions: Rescue Grid trapped in the dungeon of Winston Castle. The fall of the Mero Company and Winston's lord.\n> \n> Quest Clear Reward: 5,000 gold. Affinity with Rabbit and the Winston residents will rise to the peak.\n> \n> Quest Failure: Level -2. Rabbit's death. All quests associated with Rabbit will be permanently destroyed.\n> \n> [Would you like to accept the quest?]\n\n*I can't believe it.*\n\nTitles. S-grade quests. They weren't supposed to appear this frequently. Yet here was another, linked directly to Grid. At minimum, it proved Grid held enormous significance in Winston.\n\n*Grid.* She weighed the thought carefully. *It is true that his nature is bad, but he has great abilities and presence. I think it would be wise to build up a relationship through this matter.*\n\n\"Okay. I'll do it.\"\n\n> [The quest has been accepted.]\n\nJust because a man wanted to switch jobs, the leader of a huge company and the lord of a territory were now in trouble.\n\n***\n\nResidents crowded into Khan's smithy. Worry lined their faces.\n\n\"The rumor that Huroi was caught while leaving Winston is true.\"\n\n\"Then the lord already knows what we entrusted to Huroi, right? It is a big deal. The surveillance will tighten and a second Huroi won't appear.\"\n\n\"We can't do anything now. Winston won't be able to escape from the grasp of the Mero Company.\"\n\nThe crowd murmured. Normally, Khan would be calming them. Now he stood silent, his thoughts elsewhere.\n\n*Grid.*\n\nHuroi had been arrested trying to reach Earl Steim. The Mero Company and Winston's lord wouldn't be foolish enough to release him. And considering how close Grid was to Khan and the other residents... Grid would likely suffer the same fate.\n\n*I can't let Grid rot in jail for the rest of his life.* Khan's hands curled into fists. *I must save him!*\n\nHe raised his voice above the crowd. \"We can't close our eyes to this injustice! We have to protect our future with our own hands! Grab our weapons! We will drive the lord and the Mero Company out of Winston!\""
}