{
  "id": 410,
  "title": "Chapter 410",
  "content": "# Chapter 410\n\nA reporter leaned forward, pressing the attack. \"Mr. Grid, you didn't fight back despite the one-sided damage caused by this patch. Are you admitting that it's reasonable for you to be nerfed?\"\n\nThe reporter's logic was clean. Last year, Grid had dominated due to his class and items. Not skill. The patch existed to eliminate that imbalance. Any reasonable person would accept it quietly.\n\nThe reporter interpreted Grid's silence as guilt.\n\nYoungwoo's jaw tightened. A year ago, he would have exploded. The insult to his pride would have ignited his temper like a match to gasoline. He would have snapped, shouted, made a scene.\n\nBut that version of Grid was dead.\n\nHe represented Overgeared now. South Korea. This press conference was broadcasting live to the entire world. Youngwoo inhaled slowly through his nose and studied the reporter. The man's ID badge displayed three lines of text: name, media outlet, country.\n\n*French.*\n\nFrance had been a top candidate in the 1st National Competition. They'd pinned their hopes on Bondre to bring home gold. Then Bondre met Youngwoo in PvP and lasted four seconds. Four. That humiliation had shattered France's championship dreams like a hammer through glass.\n\nThe antagonism hadn't faded. Youngwoo could see it in the reporter's eyes. Fear masked as aggression. Anxiety dressed up as journalism.\n\n*His self-esteem is in the gutter.*\n\nJust like mine used to be.\n\nUnderstanding brought calm. Youngwoo met the reporter's gaze and spoke in an even tone.\n\n\"Everyone seems to have misunderstood. I'm not a victim of this patch.\"\n\n\"Huh?\"\n\nThe French journalist's mouth fell open. Murmurs rippled through the crowd.\n\nA Chinese reporter stood, confusion written across his face. \"Mr. Grid, isn't your greatest strength your unbeatable attack power? This patch stripped that advantage. You'll be at a disadvantage in PvP. Compared to other rankers, your control is... relatively lacking.\"\n\n\"Why do you assume my strength is attack power?\"\n\n\"You logged out Hurent in five seconds. Bondre in four. Attack power is obviously your greatest asset.\"\n\n\"Hrmm.\"\n\nA smile curved Youngwoo's lips. Slow. Deliberate. The reporters exchanged glances, trying to decode its meaning. Yura, Peak Sword, and Regas understood immediately.\n\n*Ridicule.*\n\n*How absurd.*\n\n*The worst personality.*\n\nYoungwoo let the silence stretch. He enjoyed watching confusion spread through the press corps like blood through water. Then he spoke.\n\n\"You are pure.\"\n\n\"Yes?\"\n\nThe word hung in the air. That smile still played on his lips, sharp as a blade. Youngwoo locked eyes with the Chinese reporter, whose expression had curdled.\n\n\"What is the source of my strong attack power?\"\n\n\"Your items. Obviously.\"\n\n\"In other words, the power of items. That is the right answer.\"\n\n\"...?\"\n\nYoungwoo leaned forward. \"My strength isn't attack power. It's items. And items aren't just limited to weapons.\"\n\n\"...!\"\n\nThe Chinese reporter's eyes went wide. Understanding bloomed across his face like a bruise.\n\nYoungwoo turned away from the reporters. He looked directly into the camera, speaking to the millions watching worldwide.\n\n\"If I can't reproduce the strongest attack power because of the patch, I'll show the strongest defense instead. I will thoroughly use this patch to look much better than last year.\"\n\nThe nerf they aimed at him? He would walk through it like smoke.\n\n\"Pfft!\"\n\nLaughter erupted from the reporters. Youngwoo's declaration was comedy gold.\n\nOne reporter recovered enough to speak. \"The blacksmith class is known for low defense. Production classes have inherent limitations. A legendary blacksmith won't be much different.\"\n\nAnother chimed in. \"I've never seen you use defensive skills.\"\n\n\"Common sense says you can't tank through armor alone. Without defense skills, you're paper.\"\n\nA fourth voice. \"You might've overcome class limitations with items during the 1st National Competition, when everyone was second advancement. This year is different. Other participants have grown exponentially.\"\n\nThe final nail. \"Mr. Grid, you're too obsessed with items.\"\n\nThe reporters weren't wrong. They were Satisfy experts with legitimate analysis. The problem was simple.\n\nYoungwoo was not a case their expertise covered.\n\n\"You will see soon enough.\" Youngwoo's gaze swept across Zibal and Bubat with surgical contempt. \"I'll tell you this now, though. Every participant in this competition uses items. High rankers received massive sponsorship money. It would be irresponsible if they didn't have excellent equipment. Don't use bad items as an excuse later if you have any conscience.\"\n\nThe provocation landed like a slap.\n\nBubat's face flushed red. \"You're the one who relies on items! Don't speak nonsense! I bet you'll earn zero gold medals this year!\"\n\nZibal piled on. \"A person who only relies on items is lecturing us? I guess there isn't much talent in South Korea. There's a rumor that Yura disappeared from the rankings after obtaining a hidden class because she's worse than before. Well, I think it's good enough for South Korea to maintain a low profile in this competition.\"\n\nThe reporters pivoted away from Youngwoo. Their body language shifted. Dismissal. They'd stopped caring about South Korea.\n\nA Korean reporter stood, desperation in his voice. \"Grid, do you plan to participate in the blacksmith production competition? As a legendary blacksmith, you'll surely get a gold medal.\"\n\nThe reporter wanted to prove Korea could win something. Anything.\n\nThe international press read his intentions like a children's book. Their expressions hardened with disdain.\n\n\"A gold medal doesn't have the same value everywhere.\"\n\n\"Winning gold in an unpopular event isn't newsworthy.\"\n\n\"I suppose it counts toward the score. South Korea won't leave completely empty-handed.\"\n\n\"Actually, that's questionable too. Have you seen the items top-ranking blacksmiths produce lately? There's no guarantee Grid wins gold, legendary class or not.\"\n\n\"...\"\n\nThe Korean reporter's face turned scarlet with shame. The reaction was the opposite of what he'd expected.\n\nEveryone knew these facts, but most Koreans watching the broadcast felt their blood boil at the insult.\n\nYoungwoo felt his patience snap like a dried twig. He would give Korean citizens a thrill. He would enhance his image and Overgeared's reputation simultaneously.\n\n\"If I participate in the blacksmith competition, wouldn't that be too unfair?\"\n\n\"...?\"\n\nBlacksmiths competing in a blacksmith competition was natural. Basic. But unfair? Grid's arrogance had reached new heights. Just because he possessed a legendary class, he assumed all blacksmiths were beneath him. Self-assessment inflated beyond all reason.\n\nThe reporters frowned in unison.\n\nYoungwoo raised his hand. Five fingers extended toward the cameras.\n\n\"This is the minimum number of gold medals South Korea will win in this National Competition without me entering the blacksmith tournament. Expect it.\"\n\n\"What...?\"\n\nSilence crashed down like a fallen building. The audacity left everyone mute.\n\n***\n\n[Grid declares he will win at least 5 gold medals.]\n\n[Grid won't participate in the blacksmith competition. Can South Korea win any medals?]\n\n[The burden of representatives... South Korea will suffer disgrace due to Grid's arrogance.]\n\nMedia outlets worldwide ran Grid's declaration as their headline story. Meanwhile, articles about 2nd-ranked Zibal were buried in the back pages. Small. Insignificant.\n\n\"Grid, this bastard...\"\n\nZibal had been supposed to dominate the press conference. Grid's theatrics had stolen his spotlight. His ego throbbed like a broken tooth. He threw the newspapers aside, face burning red, and turned to the young man with silver hair who sat enjoying his tea.\n\n\"What do you think the five events are?\"\n\n\"Boss raid, target match, and siege.\"\n\n\"What? Team events?\"\n\n\"And all other combat-related individual events.\"\n\n\"...\"\n\nLauel took another sip of his expensive black tea. The chief of staff of Overgeared. Grid's closest aide. The person who understood Grid best.\n\nAlso American.\n\n\"I knew Grid was arrogant, but this...\" Zibal's voice dropped. \"Does he really believe he's the strongest?\"\n\nNo. Grid always thought he was lacking. That's what made him terrifying.\n\n*He's already broken through the sky above the sky.*\n\nLauel shook his head. \"Grid said that based on his actual skills.\"\n\n\"Seriously?\"\n\nZibal's tone dripped disbelief.\n\n\"How can you evaluate Grid's skills so highly? User stats are rising across the board. The value of items is decreasing. Why are you obsessed with Grid, who has nothing except items?\"\n\n\"Hahat!\"\n\nLauel laughed and swept his silver hair back. He covered half his face with one hand. Blue eyes gleamed through the gaps between his fingers.\n\n\"This is why I don't appreciate you, Zibal. Your eagerness to judge people and situations based on prejudice proves your limitations. Your brightest moment is now. Not the future.\"\n\nZibal's face turned crimson. He trembled, struggling to contain his rage. Lauel twisted the knife deeper.\n\n\"Tomorrow, in the target match, the US is aiming for silver.\"\n\n\"What?\"\n\nThe US winning gold in team events was natural. Their overall ability was unmatched when considering average level, equipment, and participant skills. Yet they were targeting silver?\n\nLauel continued speaking insanity. \"When I survey the competition with clear eyes, the gold medal winner is South Korea.\"\n\nKung!\n\nZibal's fist slammed into the table. He shot to his feet, glaring down at Lauel.\n\n\"I know you're loyal to Grid, but remember that your country is always your priority. You are Grid's enemy in the National Competition. Don't mislead your allies and sow confusion with careless words.\"\n\n\"I'll keep that in mind.\"\n\nLauel's smile was radiant. Refreshing. Like he'd just enjoyed a cool drink on a hot day.\n\nZibal fled before he could cave in Lauel's pretty face with his knuckles.\n\n***\n\nThe next day arrived.\n\nThe opening ceremony dwarfed the 1st National Competition in scale and spectacle. When it concluded, the first event began.\n\nTarget Processing Match.\n\nThe rules were simple.\n\nThe S.A. Group had designated twenty-one uninhabited islands for this National Competition. Representatives from thirty-two countries would compete on an island called Tira. Each representative needed to destroy small targets measuring 5cm in diameter that moved at 40 meters per second. Targets awarded points. Representatives could attack and eliminate each other.\n\nOne target equaled one point. Logging out another user gave no additional points. The first country to reach 400 points total would claim victory.\n\n『 Which country will be the first to reach 400 points in this match? 』\n\nWaaahhhhhhhh!\n\nHundreds of thousands of spectators packed the Stade de France National Stadium. The host's voice boomed through the speakers, stoking the energy. Among the roaring crowd, very few eyes tracked South Korea.\n\nDespite Grid's press conference declaration, almost no one predicted South Korea could medal in team events.\n\nBut the match told a different story from the start.\n\nPeng!\n\nPepepepeng!\n\nWhite flashes erupted from four golden hands blazing under the sun. The moment the starting signal fired, small targets exploded. The speed was unmatched. No other team came close.\n\n\"Stop him!\"\n\nRepresentatives from countries worldwide converged on Grid in a panic.\n\nGrid felt gratitude toward the enemies clustering around him like moths to flame.\n\n\"Linked Kill Wave.\"\n\nHe activated his strongest skill.\n\nSilence consumed the agitated Stade de France National Stadium. Absolute. Total.\n\n***\n\nGlossary of Common Korean Terms.  \nOG: Glossary Link.  \nCurrent schedule: 20 chapters a week.  \nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day."
}