{
  "id": 411,
  "title": "Chapter 411",
  "content": "# Chapter 411\n\nOne hour before the opening event, the Korean team huddled in their waiting room. Peak Sword leaned over a map of Tira, his finger jabbing at eleven marked locations.\n\n\"Target processing is going to be a bloodbath. All thirty-two countries crammed together.\" He traced a line across the terrain. \"Two hundred and twenty-four representatives split into teams. Enemies in every direction.\"\n\nPark Jonghwa squinted at the markings. \"Why hills and rivers?\"\n\nThe level 235 archer was 39 levels below the National Competition average, but he ranked fourth in the Korean lineup after the main trio. Known for bumming cigarettes and conveniently forgetting his wallet when friends invited him out, he still knew his way around a bow.\n\nPeak Sword straightened. \"The highlands are too exposed. Every team will see us. We won't last five minutes up there.\"\n\nHe swept his hand across the map's lower elevations. \"Teams that draw too much attention get swarmed. We need to secure defensive terrain first, then worry about targets.\"\n\nPark Jonghwa's frown deepened. \"The high ground gives us clean shots on targets and enemy teams. Why hide?\"\n\n\"Because we're not strong enough to hold it.\" Peak Sword's blunt assessment hung in the air. \"Grid and Yura aside, we're outmatched stat-wise. We need to play smart.\"\n\nPark Jonghwa's jaw tightened, but he kept his mouth shut. His pride stung, but arguing wouldn't change the numbers.\n\nKyunghoon, the level 233 tanker, nodded slowly. \"Hills and rivers are easier to fortify. Less competition than the peaks.\"\n\nSumin and Jinhee murmured agreement. The level 220 magician and level 191 tailor deferred to experience. Grid and Yura remained silent, so the decision defaulted to Peak Sword's strategy.\n\nPeak Sword tapped Area B. \"This spot's perfect. Deep forest, good cover. We sprint north at the opening bell, avoiding contact. Secure Point B, Jinhee sets up his defensive tent, and...\"\n\n\"Hold on.\"\n\nGrid's voice cut through the planning. Every head turned.\n\n\"Problem?\" Peak Sword met Grid's eyes.\n\nGrid and Yura had appointed him operations manager, but final authority rested with the captain. Grid's word was law.\n\n\"The plan sounded solid at first.\" Grid leaned forward. \"But the more I listen, the less sense it makes.\"\n\n\"What's wrong with it?\"\n\nPeak Sword genuinely couldn't follow Grid's logic.\n\nGrid spelled it out. \"We avoid fights, build a fort, then start shooting targets? That's how we win gold?\"\n\n\"Gold?\" Park Jonghwa blinked.\n\nKyunghoon, Sumin, and Jinhee exchanged glances. The weakest team in the competition, winning gold in a team event? *He's joking. He has to be joking.*\n\nBut Grid's expression remained stone serious.\n\n\"We need four hundred points to take first. Why waste time camping while everyone else racks up scores? Hit the targets from the start.\"\n\nPark Jonghwa's face darkened. \"You want to fight the entire field? That's suicide. You might be a monster, but the four of us aren't. Our stats can't handle one-on-one fights with these representatives. This is a team event. You need to account for our levels.\"\n\nPark Jonghwa prided himself on realistic thinking. He refused to entertain obviously stupid plans.\n\n\"The US team alone would wipe us out in seconds.\"\n\nGrid laughed. The sound wasn't friendly.\n\n\"Suicide? Wiped out in seconds?\" His eyes flashed. The temperature in the room dropped.\n\nPeak Sword and the others unconsciously stepped back.\n\nGrid's voice went cold. \"Sell yourself short if you want. Don't drag others down with you. Especially not me. I'm stronger than your tiny brain can possibly comprehend.\"\n\nHe turned to Peak Sword. \"Your plan. What's our best finish?\"\n\n\"Third place.\" Peak Sword met Grid's stare without flinching. \"With favorable terrain and your power combined with Yura's, bronze is achievable.\"\n\nBronze. Third out of thirty-two. Most Koreans would celebrate that result. But Grid's expression twisted with disgust.\n\n\"Bronze?\" He shook his head. \"We're winning gold. Yura destroys targets from the opening second. Everyone else protects her.\"\n\n\"But we'll be swarmed immediately...\" Kyunghoon started.\n\n\"The high rankers will tear through us,\" Sumin added.\n\nBy high rankers, they meant the top eighty. The ones who'd completed their third advancement.\n\nGrid's smile was all teeth. \"Don't worry. I'll burn them all.\"\n\n---\n\n\"Block South Korea! Block them now!\"\n\n\"Is he insane?\"\n\nThe target processing event exploded into chaos moments after the starting bell. Thirty-one teams watched each other like wolves circling a carcass, but South Korea ignored everyone. They just kept destroying targets.\n\nThe other countries pounced on the opportunity. South Korea made a perfect target to thin the competition.\n\n\"We're moving too.\" Grid grinned as representatives from multiple countries converged on the Korean position.\n\nZibal's hands clenched. *That bastard. I could end this right now.*\n\nLauel's hand landed on his shoulder. \"Why waste effort? Let the others handle Korea while we take the highlands. Focus on targets.\"\n\nZibal exhaled slowly. *He's right. Don't let Grid control my emotions.* He nodded, and the US team broke away from the pack.\n\nBritain, Russia, Canada, Italy, Brazil, Japan, and a dozen other countries made the same calculation. Smart teams didn't chase obvious bait.\n\nBut eleven countries took it. Turkey's Bubat and France's Bondre led the charge with savage grins. Seventy-seven representatives rushed toward Korea's seven.\n\nBubat's thoughts raced. *PvP damage is halved. Grid's ranged skills can't touch us from this distance.*\n\nBondre smirked. *Stupid Koreans. First team eliminated.*\n\nThe seventy-seven enemies charged like moths toward a flame. Grid watched them come and began his sword dance. The movements flowed with impossible grace, each step more refined than before.\n\n\"Linked Kill Wave.\"\n\n> **[Linked Kill Wave]**\n> Performs three sword dances simultaneously.\n> Summons eight consecutive Kill attacks that inflict 1,500% attack power, chasing all objects within a 2m radius.\n> Targets hit have all speeds reduced by 50%.\n> * This skill doesn't share a cooldown with Link, Kill, and Wave.\n> Skill Mana Cost: 2,000\n> Skill Cooldown Time: 20 minutes.\n\nThe air cracked. Eight streams of energy erupted from Grid's Greatsword, each one a guided missile locked on flesh.\n\n*That's not Transcended Link!*\n\n*It's different. Stronger!*\n\n*We're dead.*\n\nThe representatives scattered on instinct. Too late. Eight targets already fell within the skill's grip.\n\nThe energy twisted midair, bending like heat shimmer, chasing down bodies that couldn't outrun physics.\n\n> [You have suffered 31,300 damage.]\n> [You have become stunned from the massive blow.]\n\n> [You have suffered 34,100 damage.]\n> [You have died.]\n\n> [Frame Shield activated. Defense increased by 30% for 10 seconds.]\n> [You have suffered 19,500 damage.]\n\n> [Three Step Turn activated.]\n> [Evasion failed.]\n> [You have suffered 37,500 damage.]\n> [You have died.]\n\nBodies burst into light. The Stade de France fell silent. Hundreds of thousands of spectators sat frozen, watching the strongest representatives in the world dissolve into pixels.\n\n\"That's impossible.\" Someone's whisper carried in the dead air.\n\n*PvP damage is reduced by fifty percent. He one-shot rankers?*\n\nGrid's attack power transcended comprehension.\n\n*The patch did nothing!*\n\nThe entire system update had targeted Grid's dominance from last year's competition. And he'd just proved it worthless.\n\nBondre's whisper reached Bubat through party chat. \"Stay calm. Those were low two-hundreds. No third advancement. Most of them pure DPS with paper defense. He hit soft targets.\"\n\nBubat's breathing steadied. His grim smile returned. \"Nice ultimate skill, Grid. Too bad you wasted it on trash.\"\n\nGrid's laugh was ugly. \"You should realize you're trash too.\"\n\nThe masters of the seven guilds had tried to invade Reidan during his absence. Time to collect that debt.\n\n\"Pagma's Swordsmanship.\"\n\nGrid launched forward. His body became a blur. Bubat threw himself into a defensive stance.\n\nGrid ran past him.\n\n\"Fake. Dumbass.\"\n\n\"What?\" Bubat's head whipped around.\n\nGrid closed the distance to Bondre in three steps. The French magician's eyes lit up with vindication. *Four seconds! Four fucking seconds was all I got last year. Today I settle accounts!*\n\n\"Crying Ice Spears!\"\n\nBondre rocketed skyward, hands weaving patterns. Dozens of ice spears materialized above Grid's head and rained down like a frozen hurricane.\n\n\"Bondre, you piece of shit!\" Representatives from other countries screamed as the wide-area magic shredded friend and foe alike.\n\n> [You have dealt 8,900 damage to the target.]\n> [You have dealt 7,500 damage to the target.]\n> [You have dealt 6,200 damage to the target.]\n\nBondre's laughter echoed across the battlefield. \"Hahaha! Take it! Take it all!\"\n\nThe notification windows scrolled faster. Damage numbers climbing. *Grid's getting hammered. He's finished!*\n\nCrying Ice Spears was a channeled spell, lasting as long as Bondre's mana held. He could carpet bomb the entire zone.\n\nBut between the damage notifications, another message kept appearing.\n\n> [You have dealt 3,100 damage to the target.]\n> [The target has resisted the damage.]\n> [You have dealt 2,900 damage to the target.]\n> [The target has resisted the damage.]\n\n\"What?\" Bondre's eyes widened.\n\nOne person was shrugging off his magic. One person wasn't taking proper damage.\n\n\"Gridddd!\" Bondre's scream cracked.\n\n\"Fly. Kill.\"\n\nBlood exploded from Bondre's chest. His scream died. The ice spears turned red, their surface now slick with magician's blood.\n\nThe <span class=\"rarity-legendary\">Holy Light Set</span> had done its job. Magic resistance strong enough to make a mockery of France's strongest spell.\n\n---\n\n**Glossary of Common Korean Terms:**\n\n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week\n\n*Check out my Patreon for early access to unedited chapters and goals for extra chapters. Early access chapters update after daily releases finish.*"
}