{
  "id": 412,
  "title": "Chapter 412",
  "content": "# Chapter 412\n\n> [Ice Shield (Lv.8) has been used.]\n> \n> [Creates a shield that absorbs 10,000 (+11,532) damage.]\n> \n> [The shield will increase your physical defense by 30% and magic resistance by 20%, and will reflect back 30% of the damage as ice debris.]\n\nMagic proficiency demanded constant use. But mindless spamming accomplished nothing. Purpose drove growth.\n\nShield magic, for example, required absorbing actual enemy strikes. Therein lay the problem. Magicians possessed tissue-paper health and defenses to match. Allowing attacks contradicted the entire combat philosophy of the class. Distance was life. Spells maintained range. Enemies died before they could close the gap.\n\nMost magicians left their shield spells to rot at beginner levels. Bondre had chosen differently. Through deliberate, grinding effort, he'd raised Ice Shield to level eight. Two more levels and it would reach mastery. The achievement demanded abandoning every instinct the class possessed, standing firm against incoming damage, absorbing blow after blow with his shield.\n\nWhy endure such misery?\n\n*For him. For revenge.*\n\nGrid used Fly and his spell resistance to collapse distance in seconds. The textbook counter to any mage. But Bondre had faced Grid before. When Kill came screaming toward his skull, he didn't flinch. Ice Shield materialized. His lips shaped the words of an attack spell.\n\n*The shield will hold.*\n\nHe believed in those 21,000 absorption points. The National Competition's 50% PvP damage reduction made his barrier practically unbreakable.\n\nGrid shattered that certainty.\n\n*Crack.*\n\nThe sound of ice fracturing. Then impact.\n\n> [You have suffered 23,210 damage.]\n> \n> [21,532 damage has been absorbed.]\n> \n> [The target will receive 30% of the damage.]\n> \n> [You have dealt 6,963 damage to the target.]\n> \n> [Ice Shield is turned off.]\n\nBlood filled Bondre's mouth. He coughed, spraying crimson. \"N-No, this is crazy!\"\n\nThe numbers made no sense. Grid had taken the worst of it, true. But the *mental* damage belonged to Bondre.\n\n*Monster.*\n\nHis shield. Obliterated. *Despite* the damage reduction. What kind of attack power could do that? For a heartbeat, fear wormed through his chest.\n\nThen it died. He was Bondre. Peak of 41,000 ice mystics. National representative. Fear had no place here.\n\nMetal shrieked.\n\nBondre twisted sideways, barely dodging Grid's follow-up. The final syllables of his chant left his lips.\n\n\"Ice Dragon's Fury!\"\n\nThe earth convulsed. Cold detonated outward in waves. Massive ice pillars erupted from the ground, serpentine and deadly, jaws open toward Grid. Power. Speed. Range. The spell lacked nothing.\n\nFrost painted the forest white. The ground became permafrost in seconds. Ice pillars loomed. Grid stood motionless at their center, a statue carved from flesh.\n\nOverwhelmed. That's how it looked.\n\nThe French spectators erupted.\n\n\"Grid is stuck!\"\n\n\"There's no escape! Bondre is incredible! A genius!\"\n\n\"Last year he wasn't ready! Go Bondre! Destroy Grid!\"\n\n\"Bondre!! Bondre!! Bondre!!\"\n\nThe world watched. The world believed. Bondre had evolved beyond the man who fell to Grid's single strike last year. That narrative embedded itself in millions of minds.\n\nAcross the battlefield, the US team fought for highland control. Zibal paused to watch the ice pillars pierce the sky. He smiled.\n\n\"Bondre's power is absolute. Ice immobilizes. Victory becomes inevitable. S-grade magic completing means Grid is finished.\"\n\nSomeone snorted.\n\n\"Don't make me laugh.\"\n\nPon. Spanish team. Spear leveled at Zibal's throat.\n\n\"You can't measure Grid.\"\n\nZibal's lips curled. \"Baby small fry.\"\n\nTenth on the unified rankings. One of Overgeared's five pillars. Impressive credentials. But Zibal was second. Dominance should be natural.\n\nThen the spear moved.\n\n\"What?\"\n\nThe attack came from the front. Then it didn't. Mid-thrust, the trajectory warped sideways. Zibal's reflexes lagged a fraction of a second.\n\n*Thud.*\n\nSteel punched into his ribs. Air exploded from his lungs. The damage number appeared.\n\nShock rippled through him twice. Once from the hit. Once from the *magnitude*.\n\n*Why does it hurt this much?*\n\nElixirs. Top-tier equipment. Twenty level advantage. Every metric screamed that Pon's damage should barely register. The pain told a different story.\n\nWind magic deflected Pon's next strike. Lauel stepped forward.\n\n\"Zibal, I admit your strength. But overconfidence is suicide. Overgeared isn't what it was a year ago.\"\n\nTruth. The Reidan desert. Vampire cities. The Behen Archipelago. Each trial had forged the Overgeared members into something beyond normal progression curves.\n\nAnd Grid had outpaced them all.\n\n***\n\n> [A powerful frost has frozen your body. All speeds will decrease by 20%.]\n> \n> [You have resisted.]\n\n\"Revolve.\"\n\nGrid's sword became a vortex. The ice pillar dragons, for all their might, found their vectors reversed. Physics bent. The attack Bondre launched became the attack Bondre received.\n\nIce slammed into the caster.\n\n\"W-What? A counterattack!\"\n\nCounterattacks followed rules. Physical force met physical force. Magic countered magic. Grid just used raw swordwork to redirect S-grade elemental magic. And somehow amplified the damage beyond 100% of the original output.\n\nFraudulent. Broken. Impossible.\n\nBut Bondre's shock stemmed from something else. The skill itself was absurd, yes. Grid's *execution* was what stole his breath. Counterattacks demanded frame-perfect timing. Even among top rankers, few could manage them consistently in actual combat.\n\nYet Grid, the man notorious for mediocre control, had countered Bondre's magic with surgical precision.\n\n*What has he been doing this past year?*\n\nBlood soaked Bondre's robes. He met Grid's approaching gaze. Those dark eyes held something unfamiliar. Experience. Growth. The weight of trials Bondre couldn't begin to imagine.\n\n*I can't measure him.*\n\n{Bondre! We're coming!}\n\nHis team. They'd held back at his request for a one-on-one duel. Bondre's response came sharp and immediate.\n\n{No. Abandon me and retreat. Grid requires sacrifices. We can't afford them.}\n\n{What?}\n\nBondre sat in the top twenty. His pride matched his ranking. Most people, Bondre included, attributed last year's loss to carelessness rather than inferiority.\n\nThis moment rewrote that narrative. Grid stood *above* him. The French team, who knew Bondre's ego intimately, struggled to process his words.\n\n{I'll buy time. Run. Ignore the South Korean team. Focus on targets. Bronze medal is still achievable.}\n\nWhile Bondre coordinated the retreat, Grid's hand moved. The greatsword vanished. <span class=\"rarity-legendary\">Iyarugt</span> emerged in its place, scattering light like crushed rubies. Hundreds of thousands of eyes locked onto the blade's beauty. Cameras zoomed until the feed showed nothing but crimson radiance and the man who wielded it.\n\nGrid's voice cut through the chaos.\n\n\"Bondre, you've developed significantly compared to last year. I acknowledge your growth.\"\n\nNo mockery. No taunts. Bondre was one of the guild masters who'd *invaded Reidan*. The old Grid would have shredded him verbally. But this Grid held his tongue.\n\nImage management for the watching millions?\n\nSecondary concern. The primary reason was simpler. Grid genuinely acknowledged Bondre's skill. The work ethic. The improvement over twelve months. Putting that down felt wrong.\n\n\"You are strong. But I am stronger.\"\n\nBondre's laugh came harsh. \"Hat! You are ridiculous.\"\n\nIce barriers materialized. Layer upon layer. His team needed time. He would squeeze every drop of power from his reserves to buy it.\n\n\"It won't be so easy when we meet again next year.\"\n\nThe declaration echoed from behind crystalline walls. Grid nodded.\n\nThen charged.\n\n*Clang. Crack. Shatter.*\n\n<span class=\"rarity-legendary\">Iyarugt</span> carved through ice barriers like they were mist. Sharp ice arrows. Frozen spears. Nothing slowed Grid's advance. He didn't bother dodging. The projectiles simply broke against his armor as he closed the distance.\n\nThe <span class=\"rarity-legendary\">Holy Light Set</span>'s magic resistance was absurd. Combined with the 50% PvP damage reduction, Bondre's arsenal became an annoyance rather than a threat. His entire strategy dissolved into farce.\n\n『 B-Bondre, logout!! 』\n\nFrance's champion collapsed. The sight sent shockwaves through the French broadcast.\n\nGrid stood over the body.\n\n\"Next.\"\n\nNo time for celebration. Bondre's logout animation completed. Grid pivoted toward the South Korean team's position. They were struggling.\n\n\"Blackening.\"\n\n*Boom.*\n\nDemonic power exploded outward, carving a path. Grid's skin paled to porcelain. The contrast against his black hair drew screams from female viewers worldwide.\n\n***\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}