{
  "id": 413,
  "title": "Chapter 413",
  "content": "# Chapter 413\n\nThe broadcast booth went dead. Every station carrying the National Competition cut their commentary feeds within seconds of each other. What Grid had just done defied analysis. The hosts stared at their monitors, jaws slack, watching the replay of eight representatives collapsing in a single stroke.\n\nAn OGC announcer cleared his throat. His hand trembled as he adjusted his microphone.\n\n\"Satisfy implements a percentage-based damage mitigation system. The player's defense stat reduces incoming damage.\"\n\n\"For the National Competition, all PvP damage is reduced by an additional fifty percent,\" his co-host added.\n\nThe third commentator shuffled his notes. \"Our expert analysis predicted that effective PvP damage would land between thirty and thirty-five percent of base values after accounting for both the patch and player defense stats.\"\n\nA pause. The replay showed Grid moving through the French formation like a scythe through wheat.\n\n\"Grid just killed Bondre and eight other representatives in under ten seconds.\"\n\n\"His damage output exceeds the theoretical ceiling. The patch can't contain him. The defense formula appears to have an upper limit, and he's operating beyond it.\"\n\nAn analyst leaned into frame. \"It isn't purely about attack power. Watch how he counters Bondre's opening strike. That's a high ranker, eighth on the unified rankings. Grid read the movement, positioned himself perfectly, and punished the mistake. This isn't last year's Grid. His control has reached a different level entirely.\"\n\nThe hosts fell silent again. Somewhere in a studio in Seoul, an expert who'd predicted South Korea would finish last stared at his hands. God Grid. The nickname had seemed like arrogance when Grid first claimed it. Now it felt like prophecy.\n\n***\n\nBubat cracked his knuckles. The Turkish representative stood at the rear of the encirclement, watching Grid's massacre with a calm, almost satisfied expression.\n\n*As expected. The patch is working.*\n\nWhen Grid activated that new skill, Linked Kill Wave, Bubat had braced for total annihilation. The energy wave should have killed everyone it touched. Instead, only four died. Three suffered critical injuries. One walked away with minor wounds.\n\nStill devastating. Still traumatic. Few players on earth could sweep multiple national representatives with a single technique.\n\nBut Grid had accomplished worse last year. Transcended Link alone had crushed dozens of competitors. Compared to that performance, his power had clearly diminished.\n\n*He's vulnerable now.*\n\nBubat adjusted the straps on his armor. Blue metal plates caught the arena lights, each piece inscribed with ancient runes. The <span class=\"rarity-legendary\">Undefeated King's Battle Gear Set</span> sat heavy on his shoulders, but the weight felt right. Comfortable. Like destiny.\n\nMadra. The 9th King of the Lubana Kingdom. A man who had never tasted defeat. A warrior who held an entire kingdom safe through the strength of his body alone. The Saharan Empire in its absolute prime had broken itself against Madra's defense. The Lubana Kingdom stood unconquered until the day Madra died of old age.\n\n*The undefeated king who endured the onslaught of enemy knights alone.*\n\nBubat tightened his grip on his shield. The sacrifices required to obtain this armor had been immense. Gold. Time. Pride. He'd failed the quest three times before finally succeeding. Each failure had cost him two levels and a week locked out of the game.\n\nWorth it.\n\nHe broke into a run, his boots hammering the arena floor. Blue energy wings manifested from his back, spectral and radiant.\n\n\"I will stop you!\"\n\nBubat drew his weapon. <span class=\"rarity-unique\">Seres' Hammer</span> hummed in his fist, eager for combat.\n\n*Grid is trapped now.*\n\nFour players dead from Linked Kill Wave. The entire French contingent in full retreat after Bondre's elimination. But over sixty representatives still remained in the arena, and they'd formed a tight encirclement around the South Korean team. Grid's teammates were pinned down, taking damage, bleeding cooldowns to survive.\n\nGrid needed to break through immediately or his team would collapse.\n\nWhich meant Grid would be impatient. Reckless.\n\nPredictable.\n\nGrid's body erupted with black energy.\n\n\"**Blackening**.\"\n\nDemonic power flooded the arena. Grid's attack power surged. His maximum health dropped as the penalty took effect.\n\n*Perfect.*\n\nBubat grinned.\n\n\"Bring it on!\"\n\nHe activated his skill. The shout tore from his lungs, infused with crushing intent.\n\n> **[Taunting Shout] has been activated.**\n> **[The enemy will be provoked.]**\n\nCrusher. A rare hidden class specializing in formation destruction. Bubat's stats followed the typical tanker distribution, stamina over everything else, but the Crusher's true strength lay in its crowd control abilities. **Unconditional** allowed him to close gaps instantly. Once within three meters, he could chain stuns, staggers, and forced movements to tear apart enemy positioning.\n\nLast year, none of it had worked on Grid. The legendary class immunity to status effects had rendered Bubat's entire kit useless.\n\n*But now it's different.*\n\nAt level 310, Bubat had earned a skill that bypassed immunity. Originally designed to let crushers apply CC to raid bosses, the technique proved devastating against players with immunity effects.\n\nGrid's expression twisted.\n\n> **['Bubat' has taunted you.]**\n> **[You can't resist.]**\n\n***\n\n*Lauel was right.*\n\nGrid's feet carried him forward against his will. His body moved toward Bubat, drawn by the taunt effect like iron to a lodestone.\n\nLauel had warned him. For game balance purposes, skills that bypassed immunity would inevitably appear. Grid had laughed it off at the time. Now Lauel's concern manifested as cold reality.\n\n*It's the same logic as selling an 'absolute defense shield' in the cash shop, then selling a 'shield-breaker' item at a higher price six months later.*\n\nThe camera drones zoomed in on Grid's face. His jaw clenched. His eyes narrowed. Hundreds of millions of viewers watching the broadcast understood instantly that something had gone wrong.\n\nThe silent experts erupted.\n\n\"That armor Bubat is wearing! I recognize it from historical records!\"\n\n\"<span class=\"rarity-legendary\">Undefeated King Madra's Battle Gear Set</span>!\"\n\n\"Madra was called a legendary tanker. There are accounts stating he endured an assault by the entire Red Knights division alone!\"\n\n\"Bubat's defensive capability must be astronomical. Grid won't be able to break through.\"\n\n\"South Korea is finished.\"\n\nThe Korean viewers' chat exploded.\n\n*—Wait, I just looked up Undefeated King Madra. That's the exact same armor.*\n\n*—Best tanker class equipped with best armor... but God Grid will still win.*\n\n*—Most of Grid's major skills must be on cooldown. This might actually be dangerous.*\n\nIf that was the Korean reaction, the international audience was worse. Most viewers had already written Grid's obituary. Bubat was an immovable mountain. Grid would shatter against him.\n\nBut Grid's hands moved to his weapons.\n\n\"**Pagma's Swordsmanship**.\"\n\nThe taunt effect dragged him forward. He triggered two buffs simultaneously.\n\n\"**Blacksmith's Rage**. **Quick Movements**.\"\n\nHis body blurred.\n\n\"Haha! Try and hit me! You'll realize it's futile and despair!\"\n\nBubat raised his shield. He angled his body to present the smallest possible target area while maximizing coverage.\n\nGrid didn't hesitate. <span class=\"rarity-legendary\">Iyarugt</span> whispered guidance, drawing red lines through the air that only Grid could see. The Slaughterer's Eye Patch highlighted Bubat's weak points, glowing marks on joints and gaps in the armor.\n\n\"**Pinnacle**.\"\n\n> **[Pinnacle Lv. 4]**\n> A sword that expresses the essence of a warrior god.\n> Deals **800%** of your attack power to a single target.\n> Ignores **64%** of the target's armor.\n\nThe blade struck.\n\n*Seokeok!*\n\nBubat's eyes widened.\n\n\"...Eh?\"\n\n*How did Grid's attack speed just double?* The sword orbit curved mid-swing, impossible to predict. And more than anything else...\n\n> **[You have suffered 17,050 damage.]**\n\n*It hurts?*\n\nHis shield had done nothing. The legendary armor set, proof of his months of suffering, might as well have been cloth.\n\n\"U-Uhh?\"\n\nBubat stumbled backward. His brain refused to process what had just happened. The Crusher possessed the highest base defense values of any class in Satisfy. Combined with the <span class=\"rarity-legendary\">Undefeated King's Battle Gear Set</span>, his damage reduction should have been close to ninety percent.\n\nSo why did that attack hurt so much?\n\nHe swung his hammer, a desperate counterattack born of confusion and pain. Grid's body shifted. **Quick Movements** granted supernatural agility, and between Iyarugt's guidance and the Eye Patch's predictions, Grid could read Bubat's attack trajectory three different ways.\n\nBut Grid didn't even try to dodge.\n\nHe took the hammer strike directly on his armor.\n\n*Peeok!*\n\n> **[You have dealt 1,090 damage to the target.]**\n\nBubat's jaw went slack.\n\n\"...Eh?\"\n\nHis hammer was <span class=\"rarity-unique\">Unique</span>-rated. His **Strength** stat exceeded 2,000. How had that attack dealt barely four digits of damage?\n\n*What is this? This is a disaster.*\n\nGrid's defense had exceeded every prediction.\n\n*Don't tell me he's actually a tanker?*\n\nGrid's words from the press conference echoed in Bubat's memory.\n\n\"If I can't show the strongest attack power because of the patch, then I will demonstrate the strongest defense instead. I will use this patch to look far better than last year.\"\n\n*Damn it.*\n\nBubat had never considered it. Grid hadn't even equipped <span class=\"rarity-legendary\">Triple Layers</span> yet. This was just the <span class=\"rarity-legendary\">Holy Light Armor</span>, optimized for offense, not defense.\n\nGrid pointed a finger at Bubat's forehead.\n\n\"**Magic Missile**.\"\n\nThe spell had gained constant proficiency throughout Grid's time in the Behen Archipelago, but it still sat at level 2. The experience bar showed sixty percent. Legendary skills grew at an agonizing pace.\n\nThe damage, however, was anything but slow.\n\n**Magic Missile (Enhanced)** ignored the target's magic resistance completely. It dealt damage equal to twice Grid's current **Intelligence** stat. The <span class=\"rarity-legendary\">Holy Light Crown</span> alone boosted his **Intelligence** by 200. Elixirs added another 400.\n\nThe spell hit like a truck.\n\n*Peeng!*\n\n\"Ugh!\"\n\nBubat's head snapped back. His vision filled with blue sky and floating camera drones. Through his peripheral vision, he saw notification windows blooming around Grid like deadly flowers.\n\n> **[Critical!]**\n> **[The option effect of Iyarugt has caused the target to bleed.]**\n> **[The 3rd combo has been achieved!]**\n> **[The option effect of Iyarugt maximizes the bleeding of the target. Damage dealt to the target will increase by 200% for 1 second.]**\n\nGrid's blade moved during that one-second window.\n\n\"**Pinnacle Kill**.\"\n\n> **[Pinnacle Kill]**\n> An attack that ignores the target's defense completely and deals **2,000%** of your attack power.\n> * The sword can change orbit mid-swing, making it nearly impossible to counter.\n\n*Seokeok!*\n\n\"Kuaaaack!\"\n\nBubat had invested nearly every stat point into **Stamina**. His **Agility** barely reached three digits. In normal circumstances, this created no problems. Low agility meant some enemy attacks were difficult to dodge, but his defense was so high it didn't matter. He could simply endure.\n\nGrid's attacks shattered that logic.\n\nThey hurt. They struck faster than Bubat could process. And before he could even attempt a counterattack, Grid linked into **Hell Sword**.\n\nThe legendary skill attached to <span class=\"rarity-legendary\">Iyarugt</span> manifested as dozens of red-black energy stems that erupted from the ground to pierce Bubat's body.\n\nThe entire exchange lasted less than a minute.\n\nBubat's health bar emptied.\n\n***\n\n**Glossary of Common Korean Terms**\n\n**OG:** Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}