{
  "id": 414,
  "title": "Chapter 414",
  "content": "# Chapter 414\n\n> **[System Notice]**\n> **Bubat has been logged out!**\n\nCriticism flooded in as the Turkish representative died. The Turkish viewers erupted in outrage at his pathetic performance.\n\n*—There are a large number of allies, so why didn't he just tank while his team dealt the damage?*\n*—What kind of tanker challenges someone to a one-on-one duel?*\n*—Bubat has no solo experience. Seriously the worst.*\n*—Basically, Grid is the strongest. How did such a monster appear in a small, weak Satisfy country like South Korea? We've been crushed by them two years in a row.*\n*—This year, Turkey is going to rank lowest.*\n*—Won't Bubat lose his sponsors soon?*\n\nBubat couldn't raise his head in the logout room. The thought of returning to Turkey filled him with dread.\n\nMeanwhile, Grid remained on the battlefield, still processing the fight.\n\n*A massive passive skill.*\n\nHe'd calculated the damage of Pinnacle and determined that Pinnacle Kill would finish Bubat. But the fusion skill dealt far less damage than expected. Bubat likely possessed a passive that reduced incoming damage from powerful blows to a percentage of his maximum health.\n\n*If his armor hadn't been sealed, this would've taken much longer.*\n\nGrid had Blacksmith's Eyes. Three seconds of observation revealed an item's complete information. A double-edged sword. The information window could obstruct his view mid-combat.\n\nStill, the skill had taught him something valuable. Bubat's armor was currently sealed, unable to perform at full capability.\n\n*The Undefeated King.*\n\nWas Madra another of the nine legends? Grid's expression darkened as he moved. He'd spent longer than anticipated on Bondre and Bubat.\n\n*My luck is absolute garbage right now.*\n\nThere was one reason Grid wore the Holy Light set instead of his newly crafted equipment. Three Layers, Lantier's Cloak. all superior gear sat unused in his inventory. He'd gambled on triggering the 5 Joint Attacks option attached to the Holy Light Gloves. If it activated, he could deal five times the damage in one strike, ending fights instantly.\n\nExcept it hadn't activated. Since entering the Behen Archipelago, the probability seemed to have plummeted. His luck stat felt cursed.\n\n*Frustrating.*\n\nHe wanted to craft an item that increased luck.\n\n*...Wait. Isn't this better?*\n\nBetter than a natural lucky state. If he wore items that artificially boosted luck, he could increase the odds of producing higher-rated items during crafting. Grid mulled over the possibilities while moving to save the Korean team.\n\nHe showed no signs of panic despite his teammates being in crisis.\n\nWhy?\n\nHe believed in his companions.\n\nGrid had committed to this high-risk operation. Draw aggro immediately. Eliminate targets fast. Attract enemy attention. All predicated on his absolute trust in Yura and Peak Sword's abilities.\n\n***\n\nFour minutes after the match began.\n\nWhile Grid cut down Bondre and Bubat in succession, the Korean team struggled against the allied coalition.\n\n\"Fire Wall!\"\n\n\"Multi Shot!\"\n\nJonghwa the archer and Sumin the magician burned through their mana pools, throwing out skills to impede the enemy advance. Jinhee the tailor frantically erected a protective tent. Kyunghoon the tanker used every skill in his arsenal to slow the enemy charge.\n\nBut they were weak. At least forty levels below the other representatives. Endurance was impossible.\n\n\"Shit, when is Grid coming?\" Park Jonghwa snapped.\n\nHe'd hated this plan from the start. The complaint slipped out between arrow volleys. None of his attacks dropped a single enemy. His weak arrows couldn't penetrate their defenses.\n\n\"Ugh!\"\n\nCounterattacks shredded his health bar instead. It had already fallen to critical levels. Without the 50% PvP damage reduction patch, he'd be dead. Sumin gasped beside him.\n\n\"I'm out of mana...\"\n\n\"Shit! Jinhee! Is that tent done yet?\"\n\n\"S-Sorry. Three more minutes.\"\n\n\"This... Ugh!\"\n\n*Ku tang tang tang!*\n\nKyunghoon barely raised his shield in time. The impact sent him flying. Australia's leading ranker, Luca, stood where he'd been.\n\n\"Stop the senseless resistance.\" Luca's cold gaze swept over them. \"Aren't you just exhausting yourselves to buy time?\"\n\nLuca. Eightieth on the unified rankings. Third advancement class. The Korean team members couldn't match him. Park Jonghwa clenched his teeth in frustration.\n\n*The end.*\n\n\"Our goal is to win, not buy time.\"\n\nYura was scoring targets with her rifle while sheltered behind her teammates. Now, she moved to protect them instead. Luca looked at her and laughed.\n\n\"I wondered what hidden class you'd gotten after vanishing from the rankings.\" He smirked. \"But it's just a gunman?\"\n\n<span class=\"rarity-rare\">Gunman</span>, a hidden class. High attack range. Devastating firepower. The strongest physical damage dealer at long distance.\n\nBut the weaknesses were glaring. Low health. Low defense. Abysmal evasion rate. Lacking the utility arsenal of magicians. Once an enemy closed the gap, a gunman died.\n\nFor Luca, a gunman was prey.\n\n\"I don't like pretty Asian faces.\" He grinned and rushed forward. \"I'll enjoy trampling yours.\"\n\nLuca's speed was phenomenal. His defense and evasion let him slip past Yura's scattered shots, avoiding fatal damage.\n\n\"Yura!\"\n\nThe Korean team cried out in desperation. Every Korean viewer watching felt their hearts seize. They couldn't bear seeing their goddess trampled.\n\nDid their prayers reach the heavens?\n\nYura didn't panic. She sidestepped Luca's strike.\n\nAnd cut him.\n\nYes. *Cut* him.\n\nA gunman using a blade.\n\n\"W-What the hell?\" Luca's eyes widened as pain exploded across his torso.\n\n***\n\n\"Draw Sword.\"\n\nThe instant Peak Sword's hand touched his sheath, ten enemy representatives flinched backward. Peak Sword usually seemed like an idiot. On the battlefield, his presence transformed.\n\n\"Annihilate.\"\n\n*Flash!*\n\nThe world knew the story. During the Silver Knights' war with Japan's Sakura Guild over Cork Island, Peak Sword had cut down dozens. That legend reproduced itself before a global audience.\n\n*Seokeok!*\n\nPeak Sword felt pure ecstasy as he executed Draw Sword. The shortest distance. Sheath to strike point. The enemy couldn't perceive it.\n\n\"Eh...?\"\n\n*Kukukukukung!*\n\nA flash of light. Everyone in front of Peak Sword collapsed. The rankers felt cold dread crawl up their spines.\n\n> [You have suffered 13,520 damage.]\n\n> [You have suffered 12,144 damage.]\n\n> [You have suffered 9,050 damage.]\n\n> [You have suffered 8,600 damage...]\n\n\"Ugh!\"\n\n\"*Cough!*\"\n\nThe pain registered late.\n\n*How can a ranged skill deal this much damage...?*\n\nThe rankers reeled from the strike, disbelief written across their faces. Peak Sword, however, wasn't satisfied.\n\n*Damn. The patch effect is too strong.*\n\nHis class's sole advantage was devastating single-strike power, compensating for the long attack delay. One hit could cripple an enemy. But in the National Competition, Peak Sword couldn't exert his full strength. The core advantage of his class evaporated.\n\n\"Hit him!\"\n\n\"Let's go!\"\n\nThe wounded allied rankers charged Peak Sword. They knew his weakness. Peak Sword couldn't link attacks until the sword returned to its sheath. They aimed for that defenseless gap.\n\nBut Peak Sword's weapon was forged by a legendary blacksmith.\n\n---\n\n**<span class=\"rarity-unique\">Ideal Longsword</span>**\n\n**Rating:** Unique  \n**Durability:** 308/308  \n**Attack Power:** 680  \n**Attack Speed:** +21%\n\n* Generates the skill **'Wind Blast'**.\n* Generates the skill **'Quick Movements'**.\n\n**User Restriction:** Level 310 or higher. Advanced Sword Mastery Level 5 or higher.\n\n---\n\nDurability and attack power fell short of the Unique-rated Iyarugt. But it was undeniably one of the finest one-handed swords in existence. A longsword that maximized the advantages of Grid's Ideal Dagger design.\n\nThe perfect weapon for Peak Sword, whose attack speed determined life or death. And Grid had prepared another gift. A sheath.\n\n---\n\n**<span class=\"rarity-unique\">Peak Sword's Sheath</span>**\n\n* 20% increase in sword drawing speed.\n* 40% increase in sword recovery speed.\n\n---\n\nGrid had used one of the Water Clan King's Tears acquired by Euphemina in the Siren Kingdom. Combined with Zednos' wind magic, the sheath generated gusts of wind to accelerate Draw Sword. Simultaneously, a whirlwind pulled the sword back into its sheath.\n\n\"God Grid!\" Peak Sword's eyes watered. \"I'll become even more overgeared!\"\n\nThe rankers' faces drained of color.\n\n*That recovery speed...*\n\n*Ridiculously fast!*\n\nThey didn't retreat despite what they witnessed defying common sense. They couldn't retreat. It was already all or nothing with Peak Sword.\n\n\"Die!\"\n\n\"A weak Satisfy country like yours should collapse!\"\n\nWeapons stabbed toward Peak Sword from every angle.\n\n*Peeeeeong!*\n\nThe storm enveloped Peak Sword. Dazzling light erupted a second time.\n\n\"*Kuaack!*\"\n\nPeak Sword shuddered with pleasure as he confirmed the enemy screams and collapse.\n\n*This is the power of items!*\n\nOvercoming his class limitations through gear. Peak Sword trembled with excitement and awe.\n\nAt the same time, elsewhere on Tira Island...\n\n\"T-The sky above the sky...!\"\n\nWhile South Korea and the allied teams fought chaotically on one side of Tira, Kraugel was in full swing on another front.\n\n---\n\n**Glossary of Common Korean Terms:**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and to help achieve goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}