{
  "id": 415,
  "title": "Chapter 415",
  "content": "# Chapter 415\n\nThree mountains rose from Tira's terrain.\n\nThe highest peak reached 723 meters above sea level. The closest point to the sky. No better vantage existed for picking off targets circling overhead. The team that seized this position?\n\nThe United States. Inevitable. All seven US representatives had completed their third class advancement, each bearing a resume of top-tier achievements.\n\nFirst among the Ten Rookies. Genius among Geniuses. Grid's Brain. Even Lauel, with his collection of titles, ranked as merely *ordinary* among this roster. The American team was stacked with elite credentials.\n\n*That bastard Lauel.*\n\nPon clawed at the cliffside, his spear jammed into rock, legs dangling over empty air. Above him, the slope had collapsed into a roaring avalanche of stone and dirt. Lauel's doing.\n\nPon's fingers screamed. His grip was failing. If he fell from this height, the system would boot him from the match entirely.\n\nThe party chat erupted with panic.\n\n{Attack Zibal! Ugh!}\n\n{Can't! Zephyr keeps interrupting my casts!}\n\n{Dammit! Skull just flanked us!}\n\n{Another landslide from Lauel! Kuaaack!}\n\nPon hung isolated. His teammates were getting shredded. Spain fielded seven rankers, all strong individually. Against the United States, it meant nothing. America's average power level was simply overwhelming.\n\n*Lauel's always been sharp, but now he's terrifying.*\n\nBad matchup. Wrong bracket.\n\n*We're not getting a medal.*\n\nPon watched his colleagues vanish one by one, their avatars dissolving into logout particles. He ripped his spear free from the cliff face. As gravity took him, he channeled the last dregs of his mana into a single strike. Target: the back of Zibal's skull, visible at the mountain's peak.\n\n\"Coming with me, you bastard.\"\n\nLightning coiled around the crimson spear in his grip. The air crackled. Rail Spear charged, electromagnetic force preparing to launch the weapon faster than sound itself.\n\nThunder rolled across the mountainside. Light blazed in the shadows where so many had fought and fallen. By the time the sound registered, the spear had already closed ninety percent of the distance to Zibal's head.\n\nZibal's eyes went wide. \"What—\"\n\n\"Dragon Claws. Wind Dragon's Roar.\"\n\nLauel moved. He'd anticipated this. Predicted Pon's nature, his final spite. Two skills activated simultaneously, layered defenses rising to intercept.\n\nWind howled, slowing the Rail Spear's velocity. Stone erupted from the earth, forming a barrier against the weakened projectile.\n\nUseless.\n\nThe Rail Spear tore through wind like tissue paper. The stone barrier shattered on impact. Lauel's protection failed. The spear punched into Zibal's shoulder with a crack of breaking bone and the sizzle of lightning. He'd need time to recover.\n\n\"POOOOOON!\" Zibal's scream of rage echoed from the summit.\n\n\"Hahaha! HAT! HAHAHAT!\" Pon's laughter boomed from below as he plummeted, the sound cut short by system disconnect.\n\nThe battlefield intensified.\n\n---\n\n> [System Notice: Pon has been logged out! Spanish team eliminated!]\n\n『 Spain couldn't overcome the United States! 』 the commentator announced. 『 America's dominance in team events is absolute! I guarantee they're the strongest collaborative force in the competition! 』\n\nWhile teams battled at the starting zone, Korea struggling against the initial alliance assault, the Brazilian team had moved differently. Led by Jishuka, they'd ghosted through terrain features, reaching the northern forest's heart uncontested.\n\n\"Why waste energy fighting?\" Jishuka nocked another arrow. \"The objective is targets, not players.\"\n\nPepeng!\n\nPepepepeng!\n\nGodly archer. Her bowstring sang without pause, arrows finding marks in rapid succession. Flying targets exploded in the sky above.\n\nJishuka cycled through several more kills before addressing her teammates. \"Well? We're first, right?\"\n\n\"Obviously! Wait...\" A Brazilian ranker pulled up the scoreboard. His expression froze.\n\nSomething was wrong. Very wrong.\n\nJishuka's anxiety spiked when she saw him stiffen. She checked the display herself.\n\n**1st. South Korea - 41 points.**\n\n**2nd. Brazil - 23 points.**\n\n**3rd. United States - 18 points.**\n\n**4th. Russia - 11 points.**\n\n\"What... how?\"\n\nHow was Korea thriving? They'd been dogpiled from the opening seconds. Every team had focused fire on them. The numbers made no sense.\n\nThen understanding clicked, and Jishuka laughed despite herself.\n\n*The God Hands.*\n\nGrid was fighting the allied teams. Meanwhile, the God Hands were systematically destroying targets overhead. Simple constructs, easy to command remotely. Elegant efficiency.\n\n\"He's brilliant.\"\n\nShe hadn't understood Grid's strategy at the match start. Why immediately draw aggro? Why engage in combat while targets spawned? Now the depth of his planning became clear.\n\n*He made everyone forget about the God Hands. Used his presence as misdirection.*\n\nEven used Yura as bait. On the current battlefield, almost no one was tracking the golden constructs hunting in the sky. If South Korea held against the alliance assault long enough, they'd secure the medal easily.\n\nMost of the allied nations were weaker countries anyway. They'd never realistically medal. Korea's chances of surviving the barrage were high. Besides Grid, they had Yura. Peak Sword. Strong anchors.\n\n*Grid, you magnificent bastard. But I'm sorry. Gold is mine.*\n\nJishuka had only begun hunting after securing this position deep in the forest. She'd started late compared to the Korean team. Yet the gap was narrowing steadily.\n\nBrazil could focus entirely on targets. Korea had to split attention, fighting players while collecting points. The efficiency difference showed. Jishuka's archery skills were exceptional.\n\n*Settle for silver, Grid.*\n\nShe understood the difference between friendship and competition. No room for sentimentality here. She wanted respect. Recognition.\n\nKkirik!\n\nThe bowstring drew back. Jishuka felt a twinge of guilt as she aimed at another target. She'd win gold. Grow stronger. Claim the title of strongest woman. Her gaze sharpened, predatory and focused.\n\nThen her eyes wavered.\n\n\"I can't let you continue unchallenged.\"\n\nThe voice emerged from the dark forest, low and measured. Its owner materialized between the trees, moving like mist.\n\nJishuka and the Brazilian rankers went pale.\n\n\"The Sky Above the Sky...!\"\n\nKraugel. First ranked user. His hair, tied back at waist length, swayed as he moved. Beautiful eyes gleamed with cold purpose.\n\n\"Apologies. This is necessary.\"\n\nRussia needed first place overall. The condition of payment for the experimental drug treatment that might help his mother. The Russian government's research, cutting-edge medicine unavailable elsewhere. Kraugel had accepted these terms without hesitation.\n\nHe'd vowed to eliminate competitors. Dominate the field. Lead Russia to victory at any cost. His role in target processing was clear. Assassinate ranged dealers. Jishuka was his fifth victim.\n\nKraugel had operated in stealth while Grid drew attention. Four ranged dealers already eliminated, their teams never realizing the pattern until too late.\n\nJishuka's jaw set. \"You think I'm easy prey?\"\n\n*Can't believe he tracked me down.*\n\nShock. Frustration. Desperation. She channeled it all into her next action, bowstring snapping back.\n\nKkirik!\n\nThe weapon that had been aimed skyward pivoted toward Kraugel.\n\nPeeng!\n\nGodly archer. The arrow of a shooter who'd transcended human limitations left the string.\n\nKiiiing!\n\nPepepepeng!\n\nThe projectile rotated mid-flight, splitting into five arrows that exploded in a pattern blocking all escape vectors. Jishuka drew again while Kraugel navigated the blast radius, buying precious seconds.\n\n*Please let him be alone.*\n\nThey had a chance if she could coordinate with her team. Even against Kraugel, ranked 14th Jishuka could mount a credible threat. A pincer formation might work.\n\n*Maximum damage while they reposition.*\n\nPositive thinking. Strategic analysis. She was qualified to make these calculations.\n\nHer opponent was the Sky Above the Sky. The man who made even legends look ordinary.\n\nInnate talent and his Keen Senses passive let him slip through gaps in the explosion pattern that shouldn't have existed. Kraugel emerged from the blast with minimal damage, rushing straight at Jishuka through the smoke.\n\nHer composure cracked. \"Oh?\"\n\n*No one should walk out of that clean.*\n\nShe recovered fast, firing again.\n\nSwaeek!\n\nSharp arrows rained down on Kraugel's position.\n\nHe twisted. Arrows whistled past his body, missing by centimeters.\n\nThe arrows exploded anyway, trying to catch him in the blast. Kraugel activated White Light Steps, his movement blurring. He avoided it effortlessly while advancing through the Brazilian formation.\n\n\"Kuack!\"\n\n\"Eek!\"\n\n\"Hiik!\"\n\nKraugel's combat style wasn't as destructive as Grid or Chris. Not as flashy as Faker or Regas. But he possessed Grid and Chris's lethality, Faker's speed, and Regas's unpredictability in equal measure.\n\nLike water flowing downhill. Every action appeared natural, inevitable.\n\nJishuka fired continuously while watching him dismantle her team. \"...How did you lose to Grid?\"\n\nA few arrows tagged Kraugel, but he moved just enough to avoid fatal damage. Precision evasion. Calculated risk.\n\n*This is why they call him the Sky Above the Sky.*\n\nUnderstanding came from direct observation. The gulf between them was vast.\n\n---\n\n> [System Notice: Jishuka has been logged out! Brazilian team eliminated!]\n\n\"The world's wide. Strong people everywhere, right?\"\n\nGrid didn't know Pon had fallen. Didn't know Jishuka had been eliminated. Some of Overgeared's strongest members, knocked out in succession.\n\nThe eleven-nation alliance couldn't have imagined it either. The reality that they'd be crushed by a country considered weak in Satisfy.\n\nSouth Korea.\n\n\"M-Monster...\"\n\nThe last survivor dissolved into grey particles. All team members eliminated. Grid stood at the center, breathing hard but showing no serious injuries.\n\nHis appearance had transformed.\n\nArmor resembling black dragon scales covered his torso. Giant red gauntlets like an ogre's fists encased his hands. A cloak that shifted colors when it moved, black bleeding into crimson and back again. Gold-reinforced leg armor. A plate helmet with twin horns rising from the sides.\n\nArmed with his new equipment, Grid resembled an immovable mountain. The world watched, transfixed.\n\nHe looked like he'd never fall.\n\n---\n\n**End of Chapter**"
}