{
  "id": 417,
  "title": "Chapter 417",
  "content": "# Chapter 417\n\nGrid.\n\nLegendary class. The most infamous among the unofficial rankers. His name appeared in so many controversies that even casual players who barely touched Satisfy knew who he was.\n\nOpinion split down the middle. Either he was a lucky nobody who stumbled into a legendary class, or he possessed genuine talent to earn one. Praise and criticism followed him in equal measure, a rare distinction.\n\nYet both camps agreed on one thing. Grid was strong.\n\nTarma disagreed.\n\n*I'm stronger than some blacksmith.*\n\nHe'd watched Grid's combat footage multiple times. From a specialist's perspective, the man was lacking. All offense, zero defense. No crowd control skills to compensate for his glass cannon build.\n\n*Might impress the casuals.*\n\nTarma waved dismissively.\n\n\"Get lost, small fry. I don't have time to deal with you.\"\n\nPre-tournament predictions had written Grid off as a non-factor. Tarma's client shared that assessment. No bounty. No target. Killing him would waste energy. Better to send him packing.\n\nThe delivery, however, was the problem.\n\nGrid's eyes narrowed. \"What did you just call me? Get lost?\"\n\n\"Huh?\" Tarma blinked. \"What are you babbling about?\"\n\nThe slang didn't translate. Grid raised his middle finger.\n\n\"Eat this.\"\n\nSure, he'd mellowed toward his guild. But his nature hadn't changed that much. Confronted with someone like Tarma, the old Grid surfaced fast.\n\nTarma's face twisted. The veins in his neck bulged.\n\n*And he's standing exactly where Kraugel should be.* Grid's irritation spiked. *Missed my window for a perfect ambush because of this asshole.*\n\n\"You bastard...\" Tarma's voice dropped to a growl. \"Small fry, I'll give you the honor of dying by my glorious hands.\"\n\nThe world knew Faker as the strongest assassin. He'd single-handedly dismantled the Ice Flower Guild, one of the seven greats. But those in the know rated Tarma higher.\n\nThe unofficial ranker. Assassin Tarma. His exploits in the underworld eclipsed Faker's public achievements.\n\n***\n\n『 Tarma? Who's that? 』\n\n『 Let's see... Third advancement assassin. Greek representative. Class is Shadow Master. He's unofficial because his level isn't public. 』\n\nHundreds of cameras blanketed Tira Island, tracking every participant in real time. Broadcast stations could only show a fraction of the footage. Unknown players remained invisible to viewers. Tarma had been one of them.\n\nUntil now. Grid's rampage through the allied teams brought him face to face with Tarma, thrusting both into the global spotlight.\n\n> The chat exploded.\n\n—Tarma? Third advancement means he's at least as strong as the 80th ranker, minimum.\n\n—Never heard of him. Probably a grinder who only hunts.\n\nMost viewers drew a blank. International commentators too. But Satisfy's deeper circles knew the name well.\n\n『 Tarma is a notorious assassin. 』\n\n『 Rumor has it he's killed over a hundred rankers. Even 2nd-ranked Zibal fell to him. 』\n\n『 Ever heard of Blood Carnival? That dark gamer group? Tarma's one of their monsters. 』\n\n『 Some say Tarma's the real god of death, not Faker. 』\n\nThe experts' commentary sent shockwaves through the internet. Real-time search terms surged. Tarma. Blood Carnival.\n\n—Holy shit, first time hearing about Blood Carnival but they sound massive.\n\n—Wicked group. Are they like the Triads of Satisfy?\n\n—Thirteen kingdoms have bounties on Blood Carnival but nobody can find their base.\n\n—Wait, Tarma isn't just some random assassin;; Did Grid pick the wrong fight? Isn't this dangerous?\n\n—RIP Grid\n\nDozens of drones converged through the forest canopy, swarming Grid and Tarma's position. Proof the world was watching.\n\nTarma scratched his head. \"Hah, this is really...\"\n\n*Just here to kill Kraugel. Wanted to stay under the radar.* His scowl deepened. *Ruined because of this idiot.*\n\n\"After I kill you, every team's gonna be alert. Getting hassled by some nobody chick.\"\n\nHe pulled out a logo. The Lion Group. Top ten global corporation. Tarma's sponsor.\n\n\"Since the small fry's getting all this attention, might as well get paid.\"\n\nHe pinned the logo to his chest. Dark aura bled from his body as he drew two yellow daggers. PK-specialized weapons from Gaya, the sandy kingdom on the East Continent that most users hadn't even glimpsed.\n\n\"Strongest weapon on the continent. Makes your West Continent gear look like trash.\" His grin was vicious. \"Overgeared? That word describes *me*!\"\n\nShadows erupted. Ground, bushes, trees, rocks. Tarma's shadow spread like spilled ink, fracturing across every surface. The viewers gasped.\n\n\"The shadows are moving!\"\n\nTarma vanished into darkness. Flawless execution. The ultimate stealth technique. Comments flooded in. Experts and viewers worldwide marveled.\n\nGrid didn't.\n\nHe'd fought Kasim. The shadow assassin's methods were seared into his memory. The instant Tarma's shadow writhed, Grid activated **Magic Detection (Enhanced) Lv. 2**.\n\nThe spell normally suffered from long cast time. Couldn't track a real-time moving assassin with precision. But Grid's version wasn't normal. Legendary Great Magician Braham had developed it. Common sense didn't apply.\n\nFactor in Grid's high Insight. The **Slaughterer's Eye Patch**.\n\nPerfect disaster for Tarma.\n\n\"What?\"\n\nTarma materialized from the tree's shadow beside Grid. He lunged, intent on killing before detection.\n\nGrid's greatsword was already aimed at the emergence point.\n\n\"Linked Kill.\"\n\n*Thud!*\n\n*Crack! Crack! Crack!*\n\n\"...!\"\n\nAssassins traded health and defense for stealth and lethality. Weakest bodies among all damage dealers. How could one survive **Linked Kill**? Superior to **Linked Kill Wave** in pure attack power. Even dodging it was a miracle.\n\nTarma didn't get the chance to scream. He turned to gray light.\n\n***\n\n『 ...Wow. 』\n\nCommentators inhaled sharply. Experts sat in stunned silence. Real-time search rankings updated.\n\nNumber one: \"3 seconds.\"\n\nLast National Competition, Grid had logged out Hurent in five seconds. Bondre in four. Now he'd set a new record.\n\nCliche? Maybe. But the world was astonished regardless.\n\nFirst day of the National Competition. Grid was rewriting the narrative multiple times over.\n\n***\n\n*Strong bastard.*\n\nGrid had read Tarma's emergence point perfectly. Executed **Linked Kill**. But Tarma hadn't given up. Even in that fraction of a second, he'd counterattacked, slashing Grid's wrist.\n\n*Three thousand damage.*\n\nThe strike poisoned and paralyzed despite Grid's resistance. Tremendous power. If **Linked Kill** had only landed three strikes instead of the full combo, if he'd failed to one-shot Tarma...\n\n*Would've been dangerous.*\n\nGrid had developed the instinct to measure an opponent's capability from a single exchange. Countless battles against stronger enemies had forged that skill. He was becoming a genuine powerhouse.\n\n『 The US team is catching up to South Korea! 』\n\n『 Only three survivors left on the Korean side. Their speed's inevitably slowing. Is it possible they'll lose first place to the United States? 』\n\nGrid's stomach dropped. He checked the scoreboard. *Shit.*\n\nHe activated **Fly**, soaring toward the densest target concentration. **Wave** erupted from his blade. Dozens of targets exploded.\n\nHis mana bottomed out. Grid kept the **God Hands** working while he dropped to ground level. Korean viewers groaned in frustration. Ground-based target elimination was slower. South Korea only had one ranged damage dealer, Yura. The US was closing the gap fast. Russia and Canada weren't far behind.\n\nBut Grid was a legendary blacksmith. He could wield all weapons. He'd acquired **Weapons Mastery** in the Behen Archipelago.\n\nCommentators and viewers watched, dumbfounded, as he pulled out a bow.\n\n『 A bow? Why is he pulling out a bow? 』\n\n『 Don't tell me a blacksmith is trying to shoot... 』\n\nPagma was a legendary blacksmith *and* great swordsman. Everyone understood why Pagma's Descendant used a sword. Nobody imagined he could shoot a bow.\n\n***\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters update after I finish releasing the day's batch."
}