{
  "id": 418,
  "title": "Chapter 418",
  "content": "# Chapter 418\n\n> **[Spiral Quick Fire Bow]**  \n> **Rating:** <span class=\"rarity-epic\">Epic</span>  \n> **Attack Power:** 215~249  \n> **Firing Speed:** +17%  \n> **Accuracy:** -30%  \n> \n> * Every time you shoot an arrow, firing speed increases by 0.5%. This effect stacks up to 50%.\n> * Difficult to control arrow trajectory.\n> * Hitting the 'desired target' grants additional Bow Mastery experience.\n> \n> *A bow crafted by the legendary blacksmith Grid. The unusual structure makes predicting arrow trajectory nearly impossible. Accuracy is exceptionally poor.*\n\n*Kkirik.*\n\nGrid withdrew the bow from his inventory. The weapon he'd suffered to create. A notification materialized.\n\n> [The effect of Beginner Weapons Mastery Lv. 8 exceeds Beginner Bow Mastery Lv. 3.]  \n> [Passive skill Weapons Mastery is applied.]\n\n*Strange.* Grid had trained Bow Mastery far more recently than Weapons Mastery, yet the sword-focused skill had grown faster. The reason was obvious: his main weapon remained the blade. Weapons Mastery accumulated from any weapon type. Bow Mastery? Only from archery.\n\n*But every arrow I fire levels both. Eventually, they'll balance out. Then I'll see the real advantage.*\n\n*Paang!*\n\nMost users specialized. Combat classes picked one mastery. Blacksmiths possessed none at all. Yet here Grid stood, a blacksmith wielding Weapons Mastery, Bow Mastery, and Magic Mastery.\n\nHis potential was limitless.\n\n\"H-He's actually using a bow!\" someone shouted from the stands.\n\nThe arrow left Grid's string. It corkscrewed through the air, path impossible to predict. The cameras tracked its erratic flight. The world watched the legendary class reveal another facet.\n\nGrid's jaw tightened. *I'm not someone you can dismiss anymore.*\n\nA lifetime of being overlooked. Despised for lacking talent. Called worthless. But Satisfy had changed everything. In this world, he'd shattered every low expectation and claimed the summit.\n\n*Peeeeeong!*\n\n\"Grid scores a direct hit!\" The commentator's voice cracked with excitement.\n\n> [Firing speed increased by 1%.]  \n> [Arrow struck desired target. Additional Bow Mastery experience acquired.]\n\n*Kkirik.*\n\nGrid nocked another arrow, eyes cold and focused. South Korea's stagnant score began climbing.\n\n> [Your arrow missed.]  \n> [Your arrow missed.]  \n> [Your arrow...]\n\n\"Shit.\"\n\nHis luck bottomed out. The arrows veered wildly off course, as if magnetically repelled from their targets.\n\n\"The leaderboard's flipping! The United States overtakes South Korea!\"\n\n\"Russia and Canada closing the gap fast!\"\n\n\"Other nations are fully engaged now, but South Korea's down to three survivors. They'll keep hemorrhaging points.\"\n\n\"Regas and Seuron are *still* fighting each other. Sympathy to Britain and Argentina.\"\n\n\"And to China and Japan...\"\n\n*Is there nothing I can do?*\n\nFor the first time in months, doubt crept in. Grid had clawed his way forward for a full year. To fall short now, when it mattered most...\n\n*No. It's not over.*\n\nHe bit down, tasted copper. The bowstring kissed his reddened lips as he pulled back. Maximum focus. Then the battlefield shifted.\n\nThe US and Russian scores froze.\n\n---\n\n\"Shit! East cliff! Check the east!\" someone barked over comms.\n\n\"Wait, what? Why isn't my magic working?\"\n\n\"You haven't heard? Non-targeted skills don't touch him.\"\n\n\"I thought that was exaggerated.\"\n\n\"Exaggeration?\" A bitter laugh. \"Nothing about him is exaggerated. If anything, the stories don't go far enough.\"\n\nEconomics. Industry. Science. Culture. Military might. The United States dominated every field. The world's largest superpower, unchallenged.\n\nNaturally, they'd claimed supremacy in Satisfy as well. Yet now that supremacy trembled. One man caused it.\n\nThe sky above the sky.\n\n*Kraugel...*\n\nLauel's face twisted as he clung to the mountainside, surveying the chaos below.\n\n*My mistake.*\n\nHe'd been certain Kraugel would target Yura. The calculation seemed perfect: eliminate South Korea's second-strongest player, cripple their scoring potential.\n\n*We should've throttled our pace. Let Kraugel commit to South Korea before we overtook them.*\n\nBut they'd surged too fast. Overtaken South Korea's score before Kraugel engaged. Now the Russian had switched targets. Kraugel hunted gold. From his perspective, the leading nation was the obvious threat.\n\n\"Ugh... My health...\"\n\nThe 2nd National Competition enforced strict PvP rules. Damage reduced by 50%. No recovery or buff potions. No pet summons.\n\nPure combat ability. Extended viewing pleasure. All very logical.\n\nWhich meant Zibal still operated at partial capacity after Pon's Rail Spear had torn through him. Two-thirds health recovered. Nothing more.\n\nHow could they face Kraugel like this? Zibal shifted his weight, preparing to move.\n\nLauel's hand shot out. \"Recover more. Rush in now, you'll just get crippled worse.\"\n\n*Healers.* The thought burned. *So rare. So precious.* Another reason Pope Damian and the Rebecca Church held such value. If they could train healers, turn the Church into a complete ally...\n\nEven now, in crisis, Lauel strategized for Overgeared.\n\n\"Russia's pushing through the western path. Everyone except Skull, intercept. Skull and I will handle Kraugel on the east.\" Lauel's voice carried over the team channel.\n\nAmerican power was overwhelming. They'd steamrolled Spain. Russia should fall easily if Kraugel was pinned. Lauel believed it. He cast Dragon's Stretch.\n\nThe landslide roared down the mountainside.\n\nKraugel watched most US rankers peel away. He triggered White Light Steps, sidestepped the 8th-ranked Skull in a blur of motion, and materialized before Lauel.\n\n*Of course. He always decapitates first.*\n\nSmart people made priority targets. Lauel had predicted it. Why else station Zibal here?\n\n\"Zibal! Let's see if your hands can reach the sky!\"\n\nZibal vaulted upward. \"I'm ranked 2nd! I'm the only one qualified to crack that sky!\"\n\nHe'd dominated in hunts. Excelled in boss raids. But PvP? Unproven. He'd skipped the 1st National Competition's PvP events entirely. Time to correct the record. His PvP absence wasn't weakness. Just disinterest.\n\n\"Kraugelllllll!\"\n\nThe roar tore from his throat as he drew a grey rod. Panmir's ego weapon, forged with techniques learned from the dwarven city Talima.\n\n*Peeng!*\n\nOne meter of grey metal shot skyward, stretching to three meters in a heartbeat. The tip aimed for Kraugel's chest.\n\n*Suuk.*\n\nKraugel twisted aside.\n\n*Pakak!*\n\nThe rod's end bent ninety degrees mid-flight. Slammed into Kraugel's temple. The Russian's body tumbled from the cliff.\n\n*Kuuuuong.*\n\nDust erupted where he struck earth.\n\n\"...That's items for you.\" Lauel blinked. He'd never imagined Zibal capable of this.\n\nThe world convulsed.\n\n\"T-The sky above the sky! The sky!\"\n\n\"He fell! Zibal brought him down!\"\n\nThe assassinated-by-Tarma, three-second-logout memes had branded Zibal a joke. But he truly was 2nd rank. The rumors about his clash with Reidan's insane farmer? Not lies after all.\n\n\"Waaaahhhhh!\"\n\n\"Zibal! Zibal! Zibal!\"\n\nAmerican spectators stamped their feet. The Stade de France trembled.\n\nZibal thrust both fists skyward. \"I am Zibal! America's strongest!\"\n\nKraugel rose slowly. Dust sloughed from his shoulders. His condition looked poor. The injury from Zibal's rod? No. Kraugel's defense wasn't so pathetic that a single blow would cripple him.\n\nFatigue. Thirty minutes of target processing. Over ten nations eliminated single-handedly. Stamina bottomed out. Concentration wavering. Movements losing their inhuman precision.\n\n\"Unfortunate it's not Grid, but this chance...\" Lauel finished casting Dragon Stretch. Skull had scaled the cliff, positioned behind Kraugel.\n\n\"Just rest.\" Lauel extended his hand.\n\n*Kurururung!*\n\nThe earth beneath Kraugel's feet crumbled.\n\n\"Open Arms!\"\n\nSkull hammered Kraugel's back in a rapid combo.\n\n\"I'll wash away every stain on my reputation!\" Zibal's grey rod whipped toward Kraugel's skull.\n\nSweat poured down Kraugel's face like rain. But behind his exhaustion, something burned. The memory of his mother, sickness eating her alive. The single desire that fueled him: her recovery.\n\n\"Super Sensitivity.\"\n\n*Kakiing.*\n\nThe skill reserved for Great Swordsman title holders activated. Kraugel became a phantom between Zibal, Lauel, and Skull.\n\n*Seokeok!*\n\n*Peok!*\n\n*Kwang!*\n\nAmerica's finest shattered. Speed beyond optical tracking. Attacks that defied cognitive processing. Destructive force that rewrote definitions.\n\nIn this moment, Kraugel stood invincible. An absolute truth no one could deny.\n\nThe sky Grid yearned to reach stretched endlessly beyond sight.\n\n---\n\n**Glossary of Common Terms:**  \n**OG:** [Glossary Link]\n\n*Current schedule: 20 chapters per week.*\n\n*Check out my Patreon for early access to unedited chapters and support goals for bonus releases.*"
}