{
  "id": 419,
  "title": "Chapter 419",
  "content": "# Chapter 419\n\nThe broadcast feed exploded with commentary.\n\n*\"Skull and Lauel have been logged out!\"*\n\n*\"The survivors of the US team have started to retreat.\"*\n\n*\"It's a big matter that Kraugel alone tied up three rankers. Russia has the numerical superiority.\"*\n\n*\"Zibal survived, but his loss in power is severe. The United States seems to be getting further away from the medal.\"*\n\n*\"Who could've imagined that a strong champion like the United States would be knocked out? Amazing! Kraugel is really great!\"*\n\nSince Satisfy's opening, Kraugel had held first place on the unified rankings. The problem was his nature. He acted alone. Never appeared in public. The audience had no chance to witness his skills firsthand. They could only guess at his strength based on rumors from the few rankers who'd crossed his path.\n\nMost people assumed the nicknames were inflated. Exaggerations born from hearsay and myth-making.\n\nToday shattered that assumption.\n\nThe viewers saw Kraugel directly. They watched him dismantle three rankers with surgical precision.\n\nThe rumors weren't exaggerated. They weren't accurate *enough*.\n\nKraugel was something beyond their understanding.\n\n***\n\n\"So what if the trivial monkey is good at fighting?\"\n\nThe skinheads of Russia showed their teeth. Over the past century, they'd assaulted or killed over 100,000 Asians. The Koryoin were no exception. Koreans who'd acquired Russian citizenship and lived there for generations meant nothing to these men. They received only threats. Only contempt.\n\nIn 2005, a Koryoin Russian karate champion named Yakov Khan was murdered by skinheads. The incident made headlines for a week, then vanished.\n\n\"What are you doing? The competition isn't over yet.\"\n\nAlexander stood over him. Ranked 22nd overall. A skinhead who treated Kraugel as something less than human. He didn't cheer. Didn't honor. Didn't respect the man who'd just delivered Russia's victory. He looked at Kraugel the way someone looks at a trained dog.\n\nKraugel had led Russia to victory by defeating Jishuka, Skull, and Lauel. Now he couldn't even stand properly. His body trembled with exhaustion.\n\nAlexander leaned down. \"Shake it off and keep going. Don't you have to work hard to treat your mother's disease?\"\n\nSilence.\n\n\"What? You're not getting up?\"\n\nAlexander knew exactly why Kraugel was here. He exploited it thoroughly.\n\n\"Oh, I'm not feeling motivated anymore.\" Alexander stretched. \"I am tired of playing in the National Competition, so how about I quit and take a break?\"\n\n\"I'm sorry.\" Kraugel's voice was flat. \"I'll get up.\"\n\nHe caught Alexander's arm before the man could make good on his threat. His legs shook as he forced himself upright. Alexander pointed at the scoreboard with mock concern.\n\n\"While we were fighting the United States, South Korea took back the number one spot. If you don't want to miss out on the gold medal, you need to shatter them.\"\n\nKraugel stared at the numbers. \"I will do so.\"\n\nA new medicine existed that could treat his mother's disease. It would take at least two years before commercialization. Kraugel couldn't wait that long. He firmed his resolve and pushed the exhaustion down.\n\n***\n\nGrid checked the scoreboard. His jaw tightened.\n\n**1st. South Korea - 244 points.**  \n**2nd. Russia - 195 points.**  \n**3rd. United States - 167 points.**  \n**4th. Canada - 153 points.**  \n**5th. United Kingdom - 119 points.**\n\n*The score of the Russians has started to rise again.*\n\nThe battle between the US and Russia had ended in Russia's victory.\n\n\"As expected from Kraugel.\"\n\nThe average power of the United States was higher than Russia. The US lost due to one variable. Kraugel.\n\nYura and Peak Sword seemed surprised. Grid wasn't.\n\n*I can't play a more active role on this stage than Kraugel.*\n\nHe'd defeated Kraugel once before. Only because Kraugel wasn't in perfect condition. It was natural for Kraugel to achieve this. He was that strong.\n\nGrid exhaled slowly.\n\nSouth Korea had regained first place, but the situation wasn't good. His <span class=\"rarity-legendary\">God Hands</span> accumulated points slowly and steadily. Peak Sword was limited to close range. Yura consumed mana with every shot. Her target processing speed had dropped. The targets flying through the sky were too small, too fast.\n\n*It would be a great help if Park Jonghwa was still alive.*\n\nGrid calculated the odds. Russia and Canada would eventually overtake them.\n\n*The secret to how Russia is able to reach here.*\n\nThey weaponized Kraugel. He moved through Tira alone, eliminating every threat to Russia. Right now, the threat was South Korea.\n\nKraugel would need to move again for Russia to secure victory. South Korea would be his target.\n\n*Kraugel will soon attack.*\n\nGrid ran the scenario. What would happen if they fought?\n\n*South Korea will lose.*\n\nEven if Grid caught Kraugel's ankle, only Yura and Peak Sword could handle targets. Their scoring speed would crawl. Russia would catch up regardless.\n\n*If Yura and Peak Sword can confront Kraugel...*\n\nCounterproductive. Yura had grown quickly through the vampire cities and the Behen Archipelago, but she was still only level 260. Peak Sword wasn't Kraugel's opponent. Never had been. Grid could handle dozens of targets before his teammates were logged out. Then he'd be alone.\n\nThe result didn't change. South Korea would be defeated.\n\n*How to get first?*\n\nAn ordinary player would've abandoned the gold medal. Grid wasn't ordinary. Like Kraugel, he possessed destructive power that overturned common sense. He could do something.\n\n*What if I hit Russia?*\n\nYes. He didn't have to face Kraugel directly. While Kraugel ran here to confront Yura and Peak Sword, Grid would run there and smash the Russian team.\n\n*Afterwards, avoid Kraugel's pursuit and handle the targets with the God Hands.*\n\nCanada remained a problem. But Korea, Canada, and Russia weren't the only countries on the battlefield. Britain, Argentina, China, and Japan were still in relatively good condition. They were aiming for medals too. They would read the situation and keep Canada in check.\n\n\"Okay.\"\n\nMost of his skill cooldowns had returned. His mana had recovered enough. Grid made his decision and turned to Yura and Peak Sword.\n\n\"Stand out so that you will be Kraugel's target. When he attacks, escape as far as possible and buy time.\"\n\n\"Grid, don't tell me...\" Yura's eyes widened.\n\nShe was smart. Peak Sword had led a guild. They figured out his plan immediately.\n\n\"Are you going to strike Russia alone?\"\n\n\"It's too dangerous, even if you're God Grid!\" Peak Sword grabbed his arm. \"Russia didn't beat the United States just because of Kraugel. The average power of Russia is strong, especially Alexander!\"\n\n\"High risk, high return.\" Grid pulled his arm free. \"If we want the best result, I have to take this risk.\"\n\nHe entered the forest before they could argue further.\n\nPeak Sword stared at his back. \"It is high risk, not high list...\"\n\nKindergartens taught English these days. Shouldn't Grid know more? Peak Sword felt very good about his own English, despite his vocabulary being limited to 'Do you know?'\n\n***\n\n\"South Korea's scoring rate has slowed down?\"\n\n\"Is Kraugel already raiding Korea's base?\"\n\n\"No, Kraugel is tired. It will take him considerable time to reach the Korean base. Even if he reaches it, he won't pose a great threat to Grid.\"\n\n\"Then why is South Korea's score rising so slowly?\"\n\n\"Are they frightened of Kraugel?\"\n\n\"Well, there is Yura in the Korean team. She will quickly identify that she is Kraugel's next target.\"\n\n\"Cowards.\"\n\nThe Russian representatives stood on the mountain that was originally the US team's base. Their scoring speed was very fast. At least five times faster than South Korea. A reversal would happen soon.\n\nOne of the rankers turned to Alexander. \"Isn't it better not to bother Kraugel so much in the National Competition?\"\n\n\"I also agree.\" Another nodded. \"Kraugel is currently our largest power. It could backfire if you keep crushing his pride and morale.\"\n\nThe other Russians didn't know why Kraugel participated. They assumed he wanted a gold medal and rewards like themselves.\n\nAlexander snorted. \"Don't worry. He wants to win the championship for Russia more than anyone else. He will do his best to the end, even if he's treated as a dog.\"\n\nAlexander hated Kraugel. He felt honored to participate to make Russia great. He couldn't stand someone who participated for personal reasons. It made him want to crush Kraugel even more.\n\nThe Russian representatives chatted while handling targets.\n\n\"Are you harassing Kraugel? Hyenas bothering a lion?\"\n\nThe voice was familiar but wrong. Alexander and the other Russian rankers looked toward the sound.\n\n\"You...\"\n\n\"Grid?\"\n\nWhy was this bastard here? The Russian representatives figured it out quickly.\n\n\"Hoh, I see. You want to hit us while Kraugel hits South Korea?\"\n\nOne of them grinned.\n\n\"Planning to raid us alone, you're crazy. Didn't you just come here to die?\"\n\n\"You hit a couple of small fries and think you are so great?\"\n\n\"You aren't Kraugel. Did you call us hyenas and Kraugel a lion? Then you are a dog. A dog.\"\n\nGrid had been bullied throughout school. He hated harassment. He could guess Kraugel's position after hearing their conversation. His eyes sharpened.\n\n\"I'm a tiger, dumb bastards.\"\n\nThe sound of metal scraping metal filled the air as he activated <span class=\"system-skill\">Item Combination</span>. <span class=\"rarity-legendary\">Grid's Greatsword</span> and <span class=\"rarity-legendary\">Failure</span> merged. The weapon in his hands now possessed the highest attack power he could generate.\n\n\"Transcended Link.\" His voice was cold. \"Linked Kill Wave.\"\n\nThe bombardment struck the Russian team.\n\n*BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM!*\n\nEnergy blades tore through the air. More threatening than a storm. They destroyed the edge of the mountain peak. Lauel had caused a landslide by exploiting terrain. Grid caused a landslide using pure destructive power.\n\nThe Russian representatives screamed as the mountain collapsed beneath them.\n\n***\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule: 20 chapters a week.**\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}