{
  "id": 42,
  "title": "Chapter 42",
  "content": "# Chapter 42\n\nThe residents recoiled.\n\nA trembling voice broke the silence. \"A rebellion? You're suggesting we rebel?\"\n\nKhan slammed his palm against the workbench. \"Rebellion? The lord is the one rebelling! We serve Earl Steim. We're going against demons who joined hands to betray Earl Steim's will!\"\n\nThe words hung in the air. Around the smithy, faces shifted from fear to recognition. They had justification. A right to resist.\n\n\"I'll follow Khan!\" someone shouted.\n\nAn older man pushed forward. \"We can't drive out the lord ourselves, but our outrage will spread. The world will know something's wrong in Winston. Earl Steim will hear.\"\n\n\"Grid is locked up because of us,\" a woman said. \"We have to fight.\"\n\nMore voices joined. \"Fight!\"\n\nKhan moved to the warehouse door and yanked it open. Inside, rows of battle gear caught the lamplight. The equipment Grid had forged during his practice sessions. Mediocre materials, true, but leagues better than farming tools.\n\n\"Ohh!\"\n\nThe residents surged forward. Khan directed them, pointing to armor sets, distributing weapons.\n\n\"Head to the Mero Company!\" someone called.\n\n\"Yes! Grab Valmont!\"\n\nKhan raised a hand. \"If we attack the Mero Company, word reaches the lord in minutes. The castle will lock down.\"\n\n\"The castle first, then?\"\n\n\"Correct.\" Khan's jaw set. \"We enter before news spreads. Take the lord hostage, the soldiers freeze. The Mero Company falls apart on its own.\"\n\nA younger man stepped forward. \"The architect who designed the castle was my great-grandfather. I have the blueprint at home. Secret passages, weak points, everything we need.\"\n\n\"Ohh!\"\n\nHope kindled. The residents straightened. They weren't helpless. They could do this. Drive out the lord, reclaim Winston.\n\nGlass exploded inward.\n\n*Crash!*\n\nThe second-floor windows shattered. Soldiers poured through the openings, bows already nocked.\n\n\"Drop your weapons unless you want to die!\"\n\nArchers materialized across the upper floor, dozens of them. Bowstrings creaked as they drew back. Arrows aimed down at the crowd below.\n\nThe residents froze.\n\nValmont sauntered through the front door.\n\nHe laughed, his jowls shaking. \"I came to take over a smithy and stumbled into crushing a rebellion! Hahaha!\"\n\nThe fat beneath his chin wobbled with each guffaw.\n\nKhan's hands clenched. \"You framed Grid! Had him arrested so the game's outcome wouldn't be revealed!\"\n\nValmont shrugged, spreading his hands. \"The result is in question? Ridiculous. The Mero Company won completely. You saw my blacksmith's work. Even if we examined your dagger, you wouldn't surpass her. Ask anyone in that crowd. They'll agree. The Mero Company won, so this smithy belongs to the Mero Company.\"\n\n\"Liar!\" Khan spat. \"You noticed Grid's work was superior. You arrested him out of fear. Out of cowardice.\"\n\nValmont clicked his tongue. \"Blame the public's poor judgment if you must. Now throw down your weapons before we execute you for treason.\"\n\n\"Who listens to a merchant's commands?\"\n\n\"A problem that I'm a merchant?\" Valmont turned. \"Then follow Philipson's command, not mine. Philipson, these people are armed. That's treason, yes? Pacify them.\"\n\nPhilipson stepped forward and waved a hand. The soldiers above adjusted their aim.\n\n\"Surrender your weapons. Khan, you're under arrest as the rebellion's ringleader.\"\n\nThe residents seethed.\n\n\"Filthy bastard! You call yourself a knight? Valmont's dog! I don't listen to dogs!\"\n\nPhilipson glanced up. The soldiers released.\n\n*Thunk!*\n\n\"Kuaack!\"\n\n\"Hiik!\"\n\nA resident crumpled, an arrow in his shoulder.\n\nKhan's breath caught. \"Vicious bastards!\"\n\n\"The next volley aims for heads.\" Philipson's voice was flat. \"Drop your weapons or die.\"\n\nThe crowd hesitated. They held axes, hammers, makeshift weapons. But they were blacksmiths, farmers, shopkeeps. Not soldiers. Fighting meant dying for nothing.\n\n\"Ohhh...\"\n\n*Clang. Clatter. Clang.*\n\nWeapons hit the floor. Determination bled away. The residents sank to the ground, trembling.\n\nValmont watched them weep and threw his head back. \"Hahahaha! Fools! Dogs like you always resist uselessly! Understand this clearly. You exist to be ruled. Obey. Nothing more. Don't think about rebelling again.\"\n\nHe nodded to Philipson. \"Confiscate everything in this smithy. Arrest the ringleader, Khan.\"\n\n\"Yes.\"\n\nThe soldiers moved with practiced efficiency. Valmont leaned close to Philipson, lowering his voice. \"Philipson, the lord will reward us handsomely for stopping this before it spread. Let's drink tonight to celebrate. I'll arrange beauties and delicacies.\"\n\n\"Appreciated. We'll celebrate. But don't trouble yourself with the beauties.\"\n\nPhilipson's gaze lingered on the corner where the elderly and women huddled. Among them, a girl around fifteen years old. Already showing signs of the beauty she'd become.\n\nValmont followed the look and frowned. *Wanting a young girl. He's worse than me.*\n\n\"Huh? What did you say?\" Philipson turned. \"I didn't catch that.\"\n\n\"Nothing. Just talking to myself.\"\n\nWhile Valmont and Philipson imagined their rewards, the residents watched Khan being dragged away.\n\n\"What do we do now?\"\n\n\"What can we do? It's over. No one left to rely on in Winston.\"\n\n\"Should've left when we could. Now we're trapped here.\"\n\nKhan had been their last hope. Now he was bound for the dungeon. Hope died.\n\nThey needed a savior.\n\n***\n\nWinston Castle's dungeon.\n\nSilence.\n\nHow many days had passed? Light never came. Huroi felt himself dissolving into the darkness. Reality and virtual reality blurred into one endless nightmare.\n\n*Where is this? Why am I here? How do I escape this hell?*\n\nDeath would be preferable. In the real world, Huroi's EEG readings spiked erratically.\n\nThe atmosphere in the S.A. Mongolian branch was suffocating.\n\n\"The EEG is too unstable.\" A technician shook his head. \"We can't guarantee Allunbatar's health anymore. If we don't force logout now, he might need psychiatric care.\"\n\nThe experts recommended abandoning the quest.\n\nBranch Manager Park Eunhyuk disagreed.\n\n\"Allunbatar has endured forty-eight hours and ten minutes. We're past the point of PR. We can't waste his effort. One hour and fifty minutes remain. We watch until the end.\"\n\nNo forced logout. The executives' faces went pale.\n\n\"Satisfy will face criticism for creating a quest that endangers users. If we don't prioritize safety, the company takes a massive hit.\"\n\n\"The whole world will see Satisfy as dangerous. Service disruption is inevitable!\"\n\nPark Eunhyuk held firm. \"My decision stands. If anything goes wrong, I take full responsibility. I'll minimize damage to the company.\"\n\n\"Why go this far? The situation isn't encouraging. Grid's rescue probability is nine percent! Furthermore, Grid was arrested as Huroi's accomplice. Rather than rescuing Huroi, Grid will rot in the same cell. Force logout. Accept the quest failure.\"\n\nPark Eunhyuk's expression didn't change. \"Isn't Grid's arrest a positive development? They're close together in the dungeon now.\"\n\nThe executives stared.\n\n\"Grid is legendary class but low-level. His items and weapons are seized. How does he escape and rescue Huroi with just his body?\"\n\n\"It's decided. No further discussion.\"\n\nPark Eunhyuk dismissed them and returned to the monitors. The first showed forty-eight hours elapsed. One hundred ninety-two hours in-game. Huroi was breaking. On the second monitor, soldiers escorted Grid into Winston Castle.\n\n*Obviously, the situation is desperate. Huroi can't be rescued with Grid's strength alone. But something feels imminent.*\n\nSince the 'Wait' quest triggered, Park Eunhyuk had watched Grid continuously. Grid was greedy. His words were crude, his behavior reckless. Far from any movie hero, any Apostle of Justice.\n\nYet watching him, Park Eunhyuk's confidence grew.\n\nGrid tried. Always. He stood at furnaces for hours, hammering endlessly. He designed variations using identical materials. Mind and body in constant motion, never resting. He grumbled ceaselessly, but his actions told a different story.\n\nThen he'd produced that work. That incredible dagger in the production game.\n\n*A user created the first...*\n\nEven with the fraudulent Legendary Blacksmith's Craftsmanship skill, producing such an item so quickly defied explanation.\n\n*He might lack talent, but his spirit is exceptional. Worth believing in.*\n\nMovie heroes never surrendered, no matter the hardship. Heroes won in the end. Perhaps Grid deserved to be a hero too.\n\nPark Eunhyuk believed it."
}