{
  "id": 420,
  "title": "Chapter 420",
  "content": "# Chapter 420\n\nThe mountain couldn't withstand the force. Transcended Link detonated like a bomb, and the entire slope gave way.\n\nRubble poured down in a lethal hail. The Russians moved. Third advancement classes, all of them. They had the control to read Transcended Link's trajectory, the skill depth to counter Linked Kill Wave's pattern.\n\nStone shattered against hastily raised guards. Bodies twisted midair. They hit the ground hard but rolled through the impact, already repositioning. Not one of them took a killing blow.\n\n*Different breed,* Grid noted. The two second advancement users earlier had folded like paper. These four were another matter entirely.\n\nAlexander, ranked 22nd, caught his attention. The military student wore small shields on both wrists. When Linked Kill Wave crashed into him, he crossed his arms and the shields flared. The aura blade shattered against them like glass on steel.\n\nNot a tanker class. Some kind of technique negation.\n\n\"You're a monster, I'll give you that.\" Alexander flexed his hands, working feeling back into numbed fingers. \"Pure skill power? You might edge out Kraugel.\"\n\nHe paused.\n\n\"Everything else? You're below me.\"\n\nAlexander had been at last year's National Competition. He'd watched Grid dismantle Hurent, then Bondre, then claim the entire PvP bracket. It had stung. The realization that he couldn't beat this outsider had scraped against his pride like a knife.\n\nBut a year changed things.\n\n\"I advanced faster than most.\" Alexander rolled his shoulders. \"You got stronger. I got stronger *more*.\"\n\nGrid tilted his head slightly.\n\n\"I trained in the East Continent,\" Alexander continued. \"Cleared fifteen islands in the Behen Archipelago. Hit Fog Island on a lucky roll and bought every elixir I could carry. Spent six months in the East grinding quest chains you've never heard of.\"\n\nHe cracked his knuckles.\n\n\"I've got four hundred stat points over anyone else at my level. My aura hardens into offense and defense simultaneously. Think a yellow monkey like you can handle that?\"\n\nGrid laughed.\n\nAlexander's expression darkened. \"Something funny?\"\n\n\"In my experience, the ones who talk this much usually die in one hit.\" Grid shifted his weight, stance loose. \"I'm just wondering how many seconds you'll last.\"\n\nIt was blatant bait. Grid had read Alexander's temper in the first exchange and was dangling the hook.\n\nAlexander, surprisingly, didn't bite.\n\n\"Listen, monkey.\" His voice stayed level. \"You've been winning for a while. Feels good, I bet. But let me explain reality.\"\n\nThe world was vast. Two billion users played Satisfy.\n\n\"Why do you think only a handful of rankers show up to these competitions?\" Alexander spread his hands. \"You're strong. But there are thousands like you that the public has never seen.\"\n\nThe real monsters, the ones at Kraugel's level or beyond, they stayed hidden. They didn't need the exposure.\n\n\"They're not hungry anymore,\" Alexander said. \"No unfulfilled ambitions worth revealing their cards. They're *complete*. Already at the peak.\"\n\n\"Your point?\" Grid asked.\n\n\"The rankers in this competition? We're all B-class. Incomplete. Weak enough to need the validation of going public.\" Alexander's lips curled. \"So don't get cocky just because you beat a few of us.\"\n\n\"Huh.\" Grid considered that. The logic held water. He'd had reasons for entering the competition. Recognition. Adamantium. Promoting Overgeared. If he'd had none of those needs, he probably wouldn't have bothered.\n\nFaker hadn't shown up two years running.\n\nGrid nodded slowly. \"So Alexander, by your own ranking, you're B-class too. Thanks for the heads up before I put you down.\"\n\nAlexander snorted. \"Wrong. I'm A-class.\"\n\nHe was strong enough that competing was suboptimal. Exposing his capabilities was a tactical error. But he'd entered anyway.\n\n\"For my country's glory,\" Alexander said. \"Now you get to experience A-class power. Be the foundation Russia stands on.\"\n\nGrid's eyes widened.\n\nThe ground beneath his feet erupted.\n\nThorns of solidified aura burst upward, jagged and fast. Grid's Insight stat flared. The <span class=\"rarity-unique\">Slaughterer's Eye Patch</span> fed him data. He read the ground's distortion a split second before the eruption and *moved*.\n\nHis agility had jumped thirty percent during his time in the Behen Archipelago. His body responded like water, flowing between the thorns before they could skewer him.\n\nAlexander's eyes tracked the movement, wider than he'd expected.\n\n*There it is. Items, stats, skills. The trinity.*\n\nHe linked his next skill while the thought finished.\n\n\"Useless! Aura Explosion!\"\n\nThe thorns hardened further, then detonated. Shrapnel and concussive force hammered into Grid's position.\n\n> [You have dealt 680 damage to the target.]\n> \n> [You have dealt 599 damage to the target.]\n> \n> [You have dealt 605 damage to the target.]\n\n\"What?\"\n\nAlexander's confidence cracked. The damage was a fraction of what it should have been. Had Grid somehow gotten outside the blast radius? \n\nThe dust cleared.\n\nNo. Grid had tanked it. His defense was *absurd*.\n\n*Overgeared.* The word surfaced from memory. Grid's first public appearance, facing down a Yatan Servant with nothing but superior equipment and the audacity to name himself after it.\n\n*But even the best armor breaks eventually.*\n\nAlexander closed the distance. His twin swords screamed through the air, both edges aimed at Grid's throat. Without flight magic, most fighters would've been pinned.\n\nGrid had spent two years with Fly active. He moved through three dimensions now as naturally as walking. He brought his greatsword up, angled to catch both strikes.\n\n**CLANG. CLANG. CLANG.**\n\n\"How?\"\n\nGrid was using a greatsword. The attack speed should have been glacial. Instead, it was splitting the difference between a longsword and a heavy blade. Fast enough to be unpredictable. Heavy enough that each block rattled Alexander's bones.\n\nThe weight transfer was wrong, too.\n\nAlexander barely raised his shield in time. The greatsword crashed into it like a siege hammer. His feet left the ground. He slammed into the earth ten meters away, the impact driving the air from his lungs.\n\nGrid dove after him.\n\n\"Pagma's Swordsmanship.\"\n\nMid-air, no leverage, he activated Link.\n\n**Shink. Shink-shink-shink-shink.**\n\nThe greatsword blurred. Thirty black streaks materialized around Alexander's body, each one a compressed slash waiting to detonate. Grid expected the pattern. Alexander would try to create distance, use the terrain.\n\nBut Alexander was better than that.\n\nAura erupted from his body in a spiral. It formed a hardened shell, a tornado of compressed energy that solidified into a barrier.\n\nThe instant Grid's Link made contact, it shattered.\n\n**CRACK-CRACK-CRACK-CRACK.**\n\nHundreds of aura fragments scattered like shrapnel. Through the glittering debris, Grid and Alexander locked eyes.\n\nAlexander grinned.\n\n\"Louder than before! Aura Explosion!\"\n\nEvery fragment detonated simultaneously.\n\n**BOOM.**\n\nGrid grunted. His first sound of actual pain since the event started. Dozens of point-blank explosions, no way to avoid the damage.\n\n\"*That's* A-class power!\"\n\nAlexander surged forward. Left hand drove into Grid's sternum. Right hand angled the sword up, punching through Grid's guard toward his abdomen.\n\nNot weak strikes. Real commitment behind both.\n\nBut Grid's equipment was on another level.\n\n> [The Largest Gloves have reduced physical damage by 4%.]\n> \n> [The Shiny Gauntlets have reduced physical damage by 5%.]\n> \n> [The Heavy Helmet has reduced physical damage by 6%.]\n> \n> [<span class=\"rarity-legendary\">Lantier's Cloak</span> has reduced the damage of all stabbing and cutting attacks by 20%.]\n> \n> [<span class=\"rarity-legendary\">Triple Layers</span> has reduced physical damage by 4%.]\n> \n> [<span class=\"rarity-legendary\">Triple Layers</span> has reduced the damage of stabbing attacks by 50%.]\n> \n> [The enemy's sword is caught in the gap of Triple Layers. The skill 'Sword Breaker' is used.]\n> \n> [The target's weapon durability has dropped.]\n\n**SCREECH.**\n\nAlexander's sword caught in the layered scales of Grid's armor. The blade bent. Durability plummeted.\n\nHis face went white. \"What?\"\n\nIt was like attacking a named golem boss. Not a player. Not a person wearing armor. A walking siege fortification.\n\nGrid met his eyes. \"If you're A-class, what does that make me? S-class?\"\n\n*These damn items.*\n\nAlexander ripped his sword free and reset. His strongest skill. Exceed Sword. Every ounce of his hardened aura concentrated at the blade's point. It had defense penetration. It was made for exactly this scenario.\n\nHe thrust.\n\nGrid didn't dodge. Didn't try. The skill was too fast, and dodging would burn stamina he might need later. He just stood there and trusted his equipment.\n\nThe <span class=\"rarity-legendary\">Heavy Helmet</span>. The Largest Gloves. The Shiny Gauntlets. <span class=\"rarity-legendary\">Triple Layers</span>. <span class=\"rarity-legendary\">Lantier's Cloak</span>.\n\nThey paid back his faith in full.\n\n> [You have suffered 8,144 damage.]\n\n\"You're joking.\"\n\nHis strongest skill. Eight thousand damage. And his sword's durability dropped *again*.\n\nGrid's greatsword came around in a tight arc. Alexander tried to retreat, but Grid had activated the skill mid-swing. No time. No space.\n\nLinked Kill punched through Alexander's aura guard and found his heart.\n\n**Thud.**\n\n**Thud-thud-thud.**\n\nAlexander hardened his aura shield in desperation. It worked. The first strike of Linked Kill broke against it. \n\nBut Linked Kill struck a minimum of three times. Grid rolled high. Six impacts.\n\nThe second strike cracked the shield. The third shattered it. Four through six opened Alexander from sternum to pelvis.\n\nHe became gray light and pixels.\n\nSilence.\n\nThe Russian representatives stared. They'd expected Alexander to crush Grid. He was the second strongest after Kraugel. The result should have been a foregone conclusion.\n\nIt had been. Just not in the direction they'd anticipated.\n\nGrid turned to face them. \"Still think I'm a dog?\"\n\nThe Russian representatives shook their heads.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG: Glossary Link.**\n\nCurrent schedule: 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}