{
  "id": 421,
  "title": "Chapter 421",
  "content": "# Chapter 421\n\nGrid's strength wasn't natural—it was forged in legendary steel and divine artifacts. The power was enough to make him dangerous. His combo attacks were predictable in theory, but the sheer devastation of Transcended Link flowing into Linked Kill Wave forced even Russia's finest to give ground.\n\nOne of the third advancement users wiped sweat from his brow. *Alexander got crushed. I knew Grid's gear was strong, but this...*\n\nAnother clenched his jaw. *He's not Kraugel-level, but he's close to Night.*\n\n*The three of us aren't enough.*\n\nNight. The ghost who'd demolished Alexander at Russia's national PvP tournament. Watching Grid carve through their formation brought back that same suffocating pressure. The representatives exchanged glances while the third advancement users calculated odds.\n\n*Those two second advancement idiots couldn't dodge Transcended Link. They're rolling down the mountain now.*\n\n*Dead weight. If we die here, Kraugel and those two can't carry this alone.*\n\n*We negotiate.*\n\nGrid's boots crunched against stone as he approached. The Russians had seconds to decide.\n\n\"Alliance.\" The lead representative raised his hand. \"What do you say?\"\n\n\"You've lost half your squad already,\" another added. \"We stop killing each other, team up against everyone else. Together we're unstoppable.\"\n\n\"Split the gold and silver. Fair deal.\"\n\nThey expected Grid to jump at the offer. Korea's team was gutted. Only Grid, Yura, and Peak Sword remained. Kraugel would eliminate the latter two soon enough.\n\n*Grid will be alone.*\n\n*He'll fight like a cornered dog.*\n\n*Korea's finished if he dies here.*\n\n*He's not stupid. He won't throw this away.*\n\nThe logic was airtight.\n\n\"No.\"\n\nGrid's response landed like a slap. The Russians stared. Had the bastard gotten dumber? No. Over the past year, Grid had evolved. Not just his stats—his tactical sense had sharpened. Lauel's lessons had sunk in. He read the battlefield now.\n\n\"The second we team up, every other country still fighting will target us.\" Grid shifted his weight. \"They're all strong. A coordinated assault from multiple sides would be a problem.\"\n\nHe rolled his shoulders.\n\n\"I'll keep this simple. I'm going to kill you. Like I planned.\"\n\n\"Are you insane?\" One of the Russians took a step forward. \"Think this through! We combine strength instead of bleeding each other dry. That's basic strategy!\"\n\n\"Bleeding?\" Grid tilted his head. \"You think you can make me bleed?\"\n\n\"...\"\n\nThe representatives' expressions hardened.\n\n\"You actually believe you can take all three of us?\" Disbelief colored the man's voice. \"Alone?\"\n\n\"Doesn't seem that difficult.\" Grid shrugged.\n\nHe gripped the fused weapon—Grid's Greatsword + Failure. The combination's duration was ticking down, but while it lasted, the merged legendary-rated blades surpassed even sealed mythic gear. Current players had no frame of reference for this kind of power. And when he stacked Blackening and Blacksmith's Rage on top of it? The 50% PvP damage reduction became a joke.\n\n> [Rune of Darkness activated. Demonic power permanently increased by 10.]\n> [For one minute, normal attacks and skills deal an additional 20% shadow damage.]\n\n> [Blacksmith's Rage activated. Attack power increased by 25%. Attack speed increased by 40% for 35 seconds.]\n\n*Clang!*\n\nGrid exploded forward. The Russians muttered curses at his reckless charge and hurled weapons to disrupt his momentum.\n\n*Clang-clang-clang-clang!*\n\nTheir eyes went wide. Grid's black cloak billowed around him—projectiles either embedded in the fabric or ricocheted away harmlessly.\n\n*What the hell? Did you see that? What is that cloak?*\n\n*I've appraised legendary cloaks before. Nothing like this.*\n\n*Stay focused.*\n\nRight. Getting shocked by Grid's items was pointless. The man was the textbook definition of overgeared.\n\n*Doesn't matter how good his gear is. He has limits.*\n\nGrid's mechanical skill hovered around low-tier ranker level.\n\n*Exploit that.*\n\n*Whip!*\n\nAs Grid closed the distance, the Russians formed a triangle with him at the center. They rotated, weapons flashing, each attack flowing into the next. A coordinated assault leveraging three different weapon types. The pressure was constant. The damage accumulated.\n\nGrid understood the tactic. His year of brutal fights had honed his combat instincts.\n\n\"Pagma's Swordsmanship.\"\n\nHe moved with the skill instead of against it, feet sliding naturally across stone. The Russians' non-targeted attacks sliced through empty air.\n\n*Evasion tech?*\n\n*From Grid?*\n\nThey didn't know. Couldn't know how many hours Grid had bled to overcome stronger opponents. How much he'd evolved.\n\n\"Restraint.\"\n\nThe wide-area crowd control triggered instantly. The Russians froze mid-strike. Grid swapped Braham's Boots for Grid's Boots—the defense bonus in darkness amplified his destructive power in this shaded mountain pass. He swung.\n\nAcross the world, commentators erupted.\n\n**\"Pagma's Swordsmanship has an obvious weakness! You need footwork to activate it properly!\"**\n\n**\"Last year's competition, several rankers exploited this. They caught Grid mid-skill activation!\"**\n\n**\"But this year's Grid is different! He's moving while the skill channels! He's covered the weakness!\"**\n\n**\"Mastering weaknesses, refining technique... It's incredible! Grid is actually a prodigy!\"**\n\nTwo years. Grid had been in the public eye for two years. The world was finally seeing what he truly was.\n\nTop class. Legitimate top class.\n\n---\n\n*A monster was hiding on this tiny island.*\n\nThe Chinese representatives hadn't expected this. Japan was small. Insignificant. Yet Katz fought like a demon, his strength exceeding all projections. \n\nDamian was equally impressed. *He's above the average Overgeared member.*\n\nHao—\"Genius of Fighting\"—was China's apex predator. In a nation of 1.3 billion, his skill was unmatched. His control over chain weapons was surgical. Damian placed him on par with Overgeared's elite.\n\nThe surprise was this: *Katz matches him.*\n\n\"Blood Breath!\"\n\n\"Dragon Fear!\"\n\n*BOOM-BOOM-BOOM!*\n\nThe clash was cinematic. Each exchange of Hao versus Katz warped the terrain, craters blooming, stone cracking. Damian's wide-range protection spell shielded his teammates from the collateral damage.\n\n*Who wins this?*\n\nThe Chinese representatives stood confident, faith absolute in Hao's superiority. The Japanese sweated, worried Hao would break through.\n\nJapan moved first.\n\n\"Don't commit! Kite him!\"\n\nChina boasted Asia's strongest roster. Their average level exceeded Japan's by fifteen. Three third advancement classes. The moment Yoshimura and the Japanese representatives started losing ground—\n\n\"Stand and fight.\" Damian's voice cut through the chaos. \"Divine Protection. Incarnation of Light. Goddess' Blessing.\"\n\nHis buffs cascaded across the team.\n\n> [Divine Protection: Party defense increased by 20% for 3 minutes.]\n\n> [Incarnation of Light: Party attack power increased by 10% for 3 minutes.]\n\n> [Goddess' Blessing: Party stats increased by 10% for 5 minutes. Negates one attack. Creates a shield absorbing 8,000 damage.]\n\n\"...!\"\n\nThe effects rivaled a full priest's arsenal. Goddess' Protection in particular made the Japanese rankers' jaws drop.\n\nKatz's eyes gleamed. *So this is why he's Pope.*\n\nBlood Warrior's passive lifesteal gave Katz obscene sustain. Add Damian's buffs and healing? He could fight forever. Katz made a mental note—after the competition, he'd recruit Damian. Money solved most problems.\n\n\"Kuk...!\"\n\nHao grunted, struggling to adapt to Katz's sudden stat spike. Katz grinned, preparing to chain attacks.\n\n\"Shed Weapon.\"\n\n\"...!\"\n\nHao's control was flawless. He read Katz's sword trajectory, grasped the blade's orbit, and tore it from Katz's grip. The weapon clattered to stone.\n\n> [Your weapon 'Crave' has been disarmed!]\n> [This is a skill effect. You retain ownership. The item will return to your inventory in 12 seconds.]\n\n*My sword's gone?*\n\nIf he couldn't retrieve the blade before the timer expired, he'd fight barehanded. Hao struck—chest, shoulder—and triggered another skill.\n\n\"Shed Armor!\"\n\n\"Shit!\"\n\nHao's hand clamped onto Katz's chestplate. Katz felt the straps give way. Hao's sword punched through the gap, piercing cloth and flesh. The blade sank into Katz's abdomen.\n\n\"Cough...!\"\n\n*That's far enough.*\n\nHao wanted to finish it, but Damian's intervention was a risk. While Katz reeled, Hao retreated and scanned the battlefield.\n\n\"Ugh!\"\n\n\"Hiik!\"\n\nMost of the screams came from China. Japan was dominating.\n\n*The Pope...*\n\nThe fraudulent buffs were one thing. Damian also cycled offensive spells and heals with casual precision. The first Pope-class user flexed absurd versatility, standing relaxed like an old drunk watching a street brawl.\n\n*Japan's actually strong this year.*\n\nMedal contenders. Japan felt more dangerous than any nation Grid's Overgeared belonged to. Almost on par with Russia or the United States.\n\nA question formed.\n\n\"Why?\" Hao steadied his breathing. \"If you have this much power, why skip target processing? Why abandon a guaranteed medal?\"\n\nDamian's answer was matter-of-fact.\n\n\"Grid's in that event. Better to forfeit than fight, lose, and crush team morale.\"\n\n\"...?\"\n\nHao had never faced Grid directly. He'd only seen videos. He couldn't reconcile the hype.\n\nLauel and Damian—why did people he respected keep overestimating Grid?\n\n*Wait.*\n\nHao's confusion turned to shock. Russia's score—the team with Kraugel—had flatlined. \n\nKorea's score was climbing. Fast.\n\n---\n\n**Glossary of Common Korean Terms.**\n**OG: Glossary Link.**\n\n**Current schedule: 20 chapters a week.**\n\n**Check out my Patreon for early access to unedited chapters and to help unlock goals for extra chapters. Early access updates after daily releases complete.**"
}