{
  "id": 422,
  "title": "Chapter 422",
  "content": "# Chapter 422\n\nThe scoreboards told a story. Korea and Russia, first and second place, had both frozen at nearly the same instant. Hao stared at the numbers as realization crept over him.\n\n*They're fighting each other.*\n\nAny moment now, Russia's score would climb again while Korea's remained locked in place forever.\n\nHao believed this with absolute certainty.\n\nThe opposite happened.\n\n*No. It can't be.* His jaw tightened. *Don't tell me Grid defeated Kraugel?*\n\nLauel's words from the Reidan invasion echoed in his mind.\n\n\"Watch Grid's path. You will soon know that he is the only sky.\"\n\nAn obvious lie. Hao had snorted at the claim. But now—\n\n*What is this?*\n\nThe world tilted. His legs buckled, and he stumbled backward against a tree, barely catching himself. Dizziness washed through him in waves. The mental shock hit harder than any physical blow.\n\n*Kraugel.*\n\nThe only person who had ever made Hao feel frustrated. The only one who proved that no matter how hard Hao pushed himself, some heights remained unreachable. That impossibly high sky, now being torn down by someone else? By Grid?\n\nNot by him?\n\n\"I have to confirm it.\" He pushed off the tree, swaying. \"I must see it with my own eyes.\"\n\nNothing else mattered. Like a man possessed, Hao turned to flee the battlefield.\n\nDamian stepped into his path.\n\n\"I can't let you go.\" The pope planted his feet. \"If I do, people will misunderstand me again. This time, I might be called Chinese.\"\n\n\"You aren't qualified to decide whether I go or not.\"\n\nHao had no idea what the man was babbling about. He released his true power.\n\n**BOOM!**\n\nA shockwave of energy exploded outward.\n\n*Crack. Crack. Crack.*\n\nHao's muscles swelled rapidly. The skin across his chest, back, shoulders, abdomen, and thighs split apart. Not blood or flesh emerged from those fissures, but crimson scales.\n\n*Flap.*\n\nWings erupted from his back and spread wide, membranes stretching taut between dragon-like bones.\n\n*Snap. Crack.*\n\nTen black fingernails extended like blades. His pupils turned white, tinged with gold, freezing the hearts of anyone who met his gaze.\n\n**Grrrr.**\n\nHeat rolled from his mouth like flame. His features remained mostly human, but draconic elements had merged with his flesh. This was Half-Draconian Form, Level 2.\n\nHis strength, agility, health, and resistance increased by **15%**. He gained incomplete flight, fire manipulation, and stamina regeneration. The cost was most human skills became unusable, but the draconian form didn't rely on skills anyway.\n\nThis was the ultimate physical body. Secondary weapons and raw power. The transformation maximized everything.\n\n\"Get lost!\"\n\n**FWOOOOSH!**\n\nFire spewed from his mouth. Kraugel occupied a strange space in Hao's heart. Longing, almost pure in its intensity. He'd spent so long gazing at Kraugel, yearning to surpass him, that the desire had twisted into something like worship.\n\nKraugel didn't know Hao existed. But Hao's entire path through life had been shaped by chasing Kraugel's shadow. He'd entered this National Competition for one reason: because he'd heard Kraugel would be here.\n\n*Clang!*\n\nDamian raised his shield, deflecting the breath weapon. Hao closed the distance and slashed with razor-sharp claws.\n\n*Clang!*\n\nThe shield caught that too.\n\n*Whoosh.*\n\nBut flames wreathed Hao's body, and fire licked across Damian's armor. The pope barely flinched. As the first paladin of the Rebecca Church, holder of the unique Goddess' Agent class, and now the pope himself, Damian had received swordsmanship training from Piaro.\n\nHis skill with a blade matched Grid's level. His defense was overwhelming. The flames washed over him without effect.\n\n*Slash!*\n\nHe wasn't good enough to become a great swordsman, but his technique could match one.\n\nHao's eyes widened.\n\n*He's even skilled with a sword?*\n\nHao had assumed the pope was the ultimate priest, nothing like the paladins who wielded swords and blunt weapons. But Damian possessed everything. The various buff skills of a pope. Healing magic. Wide-area attacks. And a paladin's swordsmanship on top of it all.\n\nDamian was a fraudulent character with the potential to become the greatest pope in history. He was genuinely top-tier.\n\n*Clang!*\n\nThe moment Damian lunged forward, Hao spun to minimize damage and lashed out with a kick. He used the rebound to open distance, then whipped chains around Damian's wrists.\n\n*Clink. Clink.*\n\nThe chains tightened. Damian's wrists were bound, rendering his sword and shield useless. Hao watched confusion flicker across the pope's face and spread his wings as wide as they would go.\n\nOne powerful flap.\n\n*Whoosh!*\n\nHao's body accelerated like a lightning bolt. Damian's arms were pulled wide by the chains, forcing him into a crucified position. He couldn't dodge. Hao's claws aimed for his chest.\n\n\"Goddess' Wrath.\"\n\nDamian revealed the pope's true power.\n\n*Hummmmm.*\n\nTwo massive magic circles, roughly three meters in diameter, materialized behind Damian's back.\n\n**FLASH!**\n\nTwin pillars of light erupted from the circles and punched through Hao's body. The beams erased everything in their path, carving trenches through the earth. The momentum hurled Hao backward, and the chains binding Damian went slack.\n\nDamian freed his hands and wiped sweat from his forehead.\n\n\"If this was before I became pope, I wouldn't have been able to deal with you.\"\n\nHao snarled back.\n\n\"It's the same now that you're pope. I admit you're strong, but you can't beat me.\"\n\nWide-area magic had limits. More importantly, the National Competition reduced PvP damage to **50%**. Goddess' Wrath had only knocked him back.\n\nHao found his footing and charged again. He exploited the burst of acceleration from his wings, movements becoming a dazzling blur. He shredded through Damian's defenses with surgical precision, slipping past every counterattack.\n\nAs the battle dragged on, Damian suffered one-sided damage.\n\n\"You're really strong.\" Damian's admission was genuine.\n\nHe'd lost a third of his health. Hao's had regenerated. The man was truly powerful, his movements impossible to track.\n\n\"I'm going to show this skill to someone other than Grid.\"\n\nDamian sighed and activated the ultimate skill of the Goddess' Agent: Light's Blessing. The highest-tier buff, comparable to the pope's Goddess' Blessing.\n\n> **[Light's Blessing]**  \n> Increases defense, attack power, and accuracy of you and your party members by **80%** for **3 minutes**.\n\nThe skill was ridiculous. Its only downsides were a long cooldown and high mana cost. For a Goddess' Agent, with naturally low maximum mana, managing resources was critical.\n\nBut Damian was the pope now. His mana pool had increased at least tenfold. He could use this buff without strain.\n\n*Slash!*\n\n\"Kuk!\"\n\nDamian's sword suddenly found its mark. He read Hao's movements like the blade was magnetized to flesh. Hao's composure cracked.\n\n*A buff that dramatically increases hit rate!*\n\nHigh accuracy was the system's counter to control-based evasion. Rankers valued accuracy for exactly this reason. But items and skills that increased accuracy were vanishingly rare. Few rankers possessed enough to nullify Hao's evasion techniques.\n\nUntil now.\n\nDamian. Thanks to the buff, his damage and defense had skyrocketed too.\n\n*Clang! Clang!*\n\nThe flow reversed. Hao went on the defensive. Worse, the Japanese representatives had started overwhelming the Chinese side. Within moments, Hao stood alone as China's sole survivor.\n\nAll of Asia watched in shock.\n\n『 C-China! Asia's strongest country has been defeated by Japan! 』\n\n『 Damian's abilities are too great. He's fighting one-on-one with Hao without being pushed back. And he's multiplying his party's abilities several times with buffs. 』\n\n『 Could Japan cause the biggest upset of the tournament? 』\n\n『 It wouldn't be strange if Japan became this year's champion. 』\n\nThe stir created by Damian eclipsed even Grid's impact. Hao, moments before being logged out, asked one final question.\n\n\"Despite having this much power, why do you value Grid so much?\"\n\nDamian's answer was immediate.\n\n\"The one who made me who I am now is Grid.\"\n\nThe defeat of the fallen pope Drevigo. The conversion to Goddess' Agent. The defeat of pope candidate Pascal. All of it thanks to Grid.\n\nWith Damian's abilities alone, he would have remained limited to being the Rebecca Church's first paladin. Only because of Grid had Damian been able to grow and save Rebecca's Daughters.\n\n\"Grid is my god. It's natural that he's much greater than me.\"\n\n\"...\"\n\nHundreds of cameras were filming Damian at that moment, broadcasting his words to every country in real time. Whether they understood or not, Damian had just deified Grid in front of the entire world.\n\nThe world turned upside down.\n\nCuriosity and enthusiasm for Grid deepened to a fever pitch."
}