{
  "id": 423,
  "title": "Chapter 423",
  "content": "# Chapter 423\n\nBefore Grid raided Russia.\n\nAs Grid predicted, Kraugel targeted South Korea. Among the remaining countries, South Korea had the highest score. But he didn't intend to fight to kill. He planned to keep Korea in check by preventing them from concentrating on the target processing.\n\nKraugel wasn't in a perfect state. His stamina and mana reserves were spent. It was the same as just after his confrontation with Piaro. *What if I faced Grid now?*\n\nThe probability of defeat was more than 80%. Kraugel knew he wasn't invincible. And Grid was strong.\n\nKraugel stopped moving through the forest. In the sky above, golden hands holding weapons were handling the targets.\n\n*The God Hands.*\n\nSouth Korea's score was slowly but steadily rising. He looked around and confirmed there were no signs of Grid. He had to neutralize the God Hands.\n\nHis blade rang against metal.\n\n*Destroying them is impossible.*\n\nThe God Hands were ridiculously durable. After being struck by White Fang, causing them to stiffen for two or three seconds was the limit.\n\nThe God Hands' protection system activated. They started targeting Kraugel.\n\n*The Sword Mastery skill is attached?*\n\nThe God Hands had grown compared to when he faced them in Reidan. They were stronger and faster. Kraugel guessed that the God Hands could hunt level 200 monsters alone. They were really great items.\n\n*Will a sword saint have an item only for them?*\n\nKraugel imagined it as he avoided the attacks of the God Hands in a relaxed manner. It was like a professional boxer facing four elementary school children.\n\nOnce the God Hands were drawn to him, South Korea's score had completely stopped. Now Kraugel jumped with surprise. Russia had been increasing the gap from South Korea, only for their score to suddenly stop.\n\n*It can't be.*\n\nKraugel felt like he had been hit in the back of the head. It was clear that someone attacked Russia while he was away, and that someone was likely to be Grid.\n\n*Go back.*\n\nKraugel determined that it was impossible for Russia's representatives to deal with Grid. He turned to return.\n\nA sniper shot came from behind a huge rock, around 120 meters to the rear. A bullet made of magic power. Based on the direction of the sound and the wind, Kraugel predicted the point of impact. He moved his waist and avoided the magic bullet.\n\nThe tree behind Kraugel exploded. The shockwave caused his long ponytail to whip forward, revealing his face that was as beautiful as a sculpture.\n\n『 As expected from Kraugel! This is the control skill of the 1st ranked user! As long as it isn't a definitive attack, he can avoid almost all of it! 』\n\n『 I received some statistics just now. In this target processing match, Kraugel avoided a total of 502 out of 537 non-targeted skills. Heok, is this data wrong? 』\n\n『 He has gone beyond the realm of a human. 』\n\nThe former 5th ranked Yura. Despite her appearance and her hidden class, the world was only focused on Kraugel. Yura, one of the most popular women in the world, was only a supporting figure when placed next to Kraugel, the peak of two billion users.\n\n『 How long will Yura grab Kraugel's ankle? 』\n\n『 Currently, Kraugel is in a tired state. Since she was the 5th ranked user, shouldn't Yura be able to hold on for five minutes? 』\n\n『 No. Since the old days, Yura was vulnerable to close combat. She can only withstand for one minute. 』\n\nAs the commentators and experts speculated, Kraugel rushed towards Yura with White Fang. Kraugel was convinced that Yura was a gunman, so he focused on narrowing the distance. Yura planned to buy time while running away.\n\n*Fast.*\n\nKraugel's speed was much faster than expected. The actual speed of movement was similar to Yura, but Kraugel grasped the forest terrain in an instant and minimized his movements, making it more efficient.\n\nKraugel caught up to Yura. At this time, the God Hands had completely left Grid's sphere of influence. Therefore, they no longer targeted Kraugel and were forced to return to Grid's inventory.\n\nKraugel wielded White Fang without hesitation. Yura defended with Alex's Magic Engineering Gun in rifle mode and shuddered. Kraugel's white sword had gone over the top of the barrel and stabbed into her heart.\n\n\"Uh...!\" Yura gasped.\n\nA truth that everyone overlooked was that Kraugel's greatest strength wasn't his control skill, but his ridiculously high level. Due to the gap in level, there was a bonus to the attack power, defense resistance and accuracy.\n\nYura had just reached **level 260** and wasn't able to cope with Kraugel who was **level 343**. She suffered great damage. Kraugel was surprised by this.\n\n\"You, why is your level so low?\" he asked.\n\nYura was 5th on the unified rankings. Half a year ago, she had already crossed level 300. But looking at the damage that Yura received, she didn't seem to have experienced her third stats awakening yet. She was just a paper body, despite the excellent condition of her armor.\n\n*Why? What would make her level drop so drastically?*\n\nKraugel was feeling confused when Yura whispered in his ear.\n\n\"I believe that one day you will know why.\"\n\nKraugel hurriedly moved back. Yura's magic gun suddenly transformed into a sword. The barrel divided into four and a blue blade emerged.\n\nThe aim was Kraugel's face. The sword left a wound on his left eye, causing blood to flow.\n\nThe owner of the second legendary class, Yura. Like a flower blossoming, the blue light of the sword illuminated the strong will in her eyes. Kraugel's black eyes sank coldly while the commentators were extremely excited.\n\n『 Yura has dealt a wound to Kraugel! 』\n\n『 Yura's strength can't be ignored! 』\n\n『 What is Yura's weapon? How did the magic gun turn into a sword? 』\n\nGeneral magic engineering guns only supported rifle mode and pistol mode. But Yura's magic gun changed into a sword, making the commentators feel disbelief. The experts speculated.\n\n『 It's a magic engineering gun made by dwarves. 』\n\n『 It's likely that Yura has travelled to the dwarf city of Talima. 』\n\n『 However, this isn't a card that will upset the battlefield. 』\n\nYura was presumed to have obtained the gunman hidden class. She didn't possess the Sword Mastery skill. In the first place, swordsmanship was out of the question for a black magician. This was what the experts thought.\n\nSurprisingly, Yura's swordsmanship was at a good level. She fought back and directly received Kraugel's counterattacks. The spectacular effects that occurred when the two people crossed swords dazzled the viewers.\n\nBut this tense confrontation didn't last long. Yura's swordsmanship wasn't comparable to Kraugel, and above all, their level and stats difference was too great.\n\nAfter throwing away Yura's sword, Kraugel raised his sword vertically. He put his knee on Yura's shoulder and held the handle of his sword. It was the precursor of Jajinmori.\n\nYura kicked him in the chest and rushed away. Kraugel tried to hit her by throwing a secondary weapon. But at this time, he felt an intense energy from the rear.\n\nWhile Yura grabbed Kraugel's attention, Peak Sword aimed for a surprise attack from the rear.\n\n\"Draw Sword, Sudden.\"\n\nOnce Peak Sword's sword was pulled out, there was a sharp burst of energy and it suddenly flew at Kraugel. Fast. In the first place, drawing sword techniques weren't easy to avoid. Even Kraugel, with his keen senses and insight, wasn't able to avoid the skill that was used with perfect timing.\n\nThe sword penetrated Kraugel's chest. He coughed up blood.\n\n*Dangerous.*\n\nThe moment this thought crossed his mind, the figure of his mother appeared in front of him.\n\n*Stand up.*\n\nKraugel was at the last of his strength. Yura turned her weapon back into pistol mode and fired magic bullets at him.\n\nKraugel's body was consecutively hit by magic bullets. Peak Sword recovered his sword and prepared for his next attack. Then Kraugel used True Clouds. A blue cloud-like haze covered the area.\n\n*I can't see.*\n\nYura and Peak Sword were nervous because they couldn't see Kraugel within the clouds. They didn't know when and where Kraugel would appear to attack them. After 20 seconds, Kraugel didn't attack them and the clouds completely disappeared.\n\nHe had run away. The continuous battles had pushed Kraugel's stamina and mana to the depleted state. Kraugel decided to survive and maintain Russia's score, keeping the silver medal, rather than kill Yura and Peak Sword.\n\nThen 20 minutes later. South Korea scored 400 points and the target processing match was automatically stopped.\n\n***\n\n『 The 2nd Satisfy National Competition, there was an upset from the very first event! 』\n\n**The shocking drop of the United States and the rise of South Korea, Russia, and Japan.**\n\n**Zibal is weak, Kraugel is strong. The gap between the 1st and 2nd ranked users is like the difference between heaven and earth?**\n\n**The tearful struggle of Russia's only survivor, Kraugel. After keeping Canada in check, he won the silver medal.**\n\n**Grid, an attack power and defense that surpassed the nerf.**\n\n**(Review) Let's analyze Grid's items in depth.**\n\n**(Column) Maybe the real strongest person is Damian?**\n\n**The Rebecca Church's pope has deified Grid. I hope Goddess Rebecca's jealousy won't turn to Grid.**\n\n**Is Damian really Korean instead of Japanese?**\n\n**The collapse of China, which was proud of being Asia's strongest country.**\n\n**Greece and Britain fought the entire time, and couldn't even handle one target. The people of both countries are blaming Regas and Seuron.**\n\n**Canada's Vantner and Chris conflicted with each other, causing them to eventually miss the silver medal.**\n\n**Bondre and Bubat are people of the past.**\n\n**Tarma had zero presence. Are the rumors exaggerated, or is Grid too strong?**\n\n**(Column) The gap between second and third advancement classes is greater than expected.**\n\nAfter the opening day finished. There was a brief press conference and the players returned to their rooms.\n\nShang X Lila Hotel. The Korean representatives were gathered in Grid's room.\n\n\"Amazing! Amazing! Korea won the gold medal at a team event. No one would've imagined it!!\" Peak Sword shouted excitedly.\n\n\"This is all thanks to Grid, Yura, and Peak Sword,\" Kyunghook said.\n\n\"I'm sorry that we were no help to you,\" Sumin added.\n\nJinhee shook her head. \"Hah, we are useless. We were completely disruptive...\"\n\nKyunghook, Sumin, and Jinhee couldn't lift their heads. The proud people trembled from their helplessness. The atmosphere suddenly sank. Surprisingly, the one to encourage them wasn't Peak Sword.\n\nIt was Grid.\n\n\"No, this result is due to all of us. If all of you weren't present, we wouldn't have won the gold medal.\"\n\nGrid had been despised for incompetence his whole life. That's why he knew.\n\n\"There are no worthless people in the world. Everyone has their own personality and talent. Always have pride in yourself.\"\n\nAs soon as a human saw themselves as unnecessary, their lives would be at risk. Their self-esteem would collapse and they couldn't overcome misfortunes due to their misery. Just like the Grid of the past.\n\nThe smiling Grid. As the protagonist of the gold medal, he wasn't arrogant and shared his achievements with everyone. Yura felt that he had matured. It was interesting and pleasant to watch a man who was becoming an adult day by day."
}