{
  "id": 424,
  "title": "Chapter 424",
  "content": "# Chapter 424\n\nThe Ture Hotel housed representatives from Russia, Brazil, and Japan. In a restricted wing accessible only to National Competition athletes, rows of VR capsules gleamed under fluorescent lights.\n\nKraugel entered the room. 14 hours and 23 minutes remained until day two of the competition. Other representatives were exploring Paris or drowning themselves in alcohol. Kraugel walked past the empty capsules toward the one at the far end.\n\n*I need levels.*\n\nHis mother's face flashed through his mind. The Alzheimer's was progressing. Time was currency he couldn't afford to waste.\n\nHe reached for the capsule lid.\n\n\"So what if you play games until you die?\"\n\nKraugel stopped.\n\nAlexander stepped into his path. The Russian representative stood 190 centimeters tall with a build that screamed violence. His thick finger jabbed into Kraugel's chest.\n\n\"The sky above the sky? Stop fooling around.\" Another jab. \"Because of your incompetence, Russia missed the gold medal. You won't be able to fix your mother's illness.\"\n\nThe skinhead had blamed everything on Kraugel after Grid demolished the Russian team. In Alexander's worldview, anyone with yellow skin ranked below monkeys.\n\nKraugel's hand moved.\n\n*Crack.*\n\n\"Ugh!\"\n\nAlexander's wrist bent at an angle that made his face contort. Kraugel's grip crushed down like a vice.\n\n*How does a yellow skinned person have such power?*\n\nThe slender build had deceived him. Alexander tried to pull away. The grip tightened.\n\n\"I was forced to endure it on the opening day.\" Kraugel's voice carried the temperature of a winter grave. \"Not anymore.\"\n\nHe'd needed to observe team dynamics. Learn patterns. Alexander had taken the lead by default. That window had closed.\n\n\"You aren't in a position to say anything. I am the dominant one in this relationship.\"\n\nAlexander stared into Kraugel's black eyes. They resembled wells. Deep. Empty. Emotionless. Fear crawled up his spine despite himself.\n\n*This is just a yellow skinned person.*\n\nAlexander swung his other fist.\n\n\"This damn monkey hasn't grasped who you are going against!\"\n\nKraugel's head tilted six inches to the left.\n\n*Whoosh.*\n\nThe fist cut air.\n\n*Crack.*\n\nKraugel's counter punch landed. Alexander's nose crunched. His vision exploded into white stars. The floor rushed up to meet his back.\n\n*Thud.*\n\nBefore Alexander could process the impact, Kraugel's foot pressed against his throat.\n\n*Crunch.*\n\n\"Kek! Keeek!\"\n\nCartilage compressed. Alexander's vocal cords screamed. He clawed at the ankle pinning him down.\n\n\"I know people like you.\" Kraugel applied more pressure. \"You're a type of gangster who doesn't obey until you are trampled on. You decided that I couldn't be targeted in virtual reality, but reality is different. Isn't that right?\"\n\nThe weight increased. Alexander's face drained of color. Those empty eyes stared down at him without a flicker of remorse.\n\n*This guy... This guy is the real deal.*\n\nThe realization hit harder than the punch. Kraugel wasn't afraid of hurting people. Possibly worse.\n\nAlexander's hands slapped the floor.\n\n*Tap tap tap!*\n\nThe universal sign of surrender. Kraugel didn't move. He stood there, foot crushing windpipe, staring down in silence. Seconds stretched into eternity.\n\nAlexander's vision dimmed. Oxygen debt accumulated. He couldn't meet those bottomless eyes anymore.\n\nFinally, Kraugel stepped back.\n\nAlexander gasped. Wheezed. Scrambled backward on his elbows before finding his feet and running.\n\nKraugel walked to the capsule. His expression remained flat.\n\n*An eye for an eye, a tooth for a tooth.*\n\nRussia treated him as an eternal outsider. Trash like Alexander made that clear every day. But Russia held the only new medicine capable of treating his mother's Alzheimer's. Every other country that offered him immigration deals came up empty on pharmaceutical solutions.\n\nHe climbed into the capsule.\n\n*I need to lead Russia to victory.*\n\nThe lid closed.\n\n> [Scanning your body.]\n\n> [Recognize your iris.]\n\n> [Verifying the user's information.]\n\n> [The capsule protection system is working.]\n\n> [Log in to Satisfy.]\n\n*Chiiiiing!*\n\nHis consciousness dissolved into the game.\n\nIn the corner of the room, another capsule opened. Jishuka sat up. She'd logged in before Kraugel and heard the confrontation through the thin capsule walls before her own immersion completed.\n\n\"Kraugel had this story.\"\n\nShe pulled out her phone. Grid needed to know. Overgeared needed to know. She sprinted toward the Shang X Lila Hotel.\n\n***\n\n\"The combination of sweet and salty is very good.\"\n\n\"It melts in my mouth.\"\n\nThe Shang X Lila Hotel's restaurant boasted three Michelin stars. South Korea's representatives occupied a corner table, sampling courses that commanded astronomical prices.\n\nEven Peak Sword, who normally ate nothing but Korean food, had to acknowledge the skill.\n\n\"The cooking skills are great.\" He set down his fork. \"I want to try the kimchi stew made by the chef of this restaurant.\"\n\nThe table fell silent.\n\nPeak Sword continued eating, oblivious to the stares.\n\nGrid checked his watch for the third time.\n\n\"Why is the rate of service so slow when the amount of food is so small?\" He glared at his tiny appetizer plate. \"The restaurant owner is incredibly lazy.\"\n\nGrid had grown up on Korean delivery culture. Fifteen minutes from order to door. The French insisted on stretching meals across two to three hours. His frustration mounted with each passing minute.\n\n\"In this case, it would be better to just boil ramyun. Michelin is a waste of time.\"\n\n\"Um...\" Peak Sword leaned forward. \"I would like to try the soybean paste stew made by the chef of this restaurant...\"\n\nThe other representatives shared a look. Mental note made. Don't eat with Grid and Peak Sword tomorrow.\n\nYura smiled into her wine glass. Sitting at the same table as Grid filled her with a warmth that defied description. She could eat instant noodles three times a day for the rest of her life if Grid sat across from her.\n\n*This is enough.*\n\n\"You're this far from home, how about having a glass of wine?\"\n\nA youth with silver hair approached their table. His blue eyes caught the ambient light like gems. Lauel moved with the unconscious grace of nobility despite his casual attire. He held a bottle like an offering.\n\n\"This body of wine, like the blood that flowed in my body for thousands of years, is lavish and sublime.\" Lauel presented the Romane X with ceremony. Only 6,000 bottles produced annually. \"This red wine is the symbol of me, Lauel... It reflects my will to be in your heart forever.\"\n\nThe Korean representatives froze. Their faces paled. Secondhand embarrassment crushed down like a physical weight.\n\nYura maintained her composure through sheer force of will. Grid and Peak Sword remained completely unaffected.\n\n\"Okay, okay.\" Grid accepted the bottle.\n\nPeak Sword nodded. \"Do you know God Grid?\"\n\nLauel stared at them. Tens of thousands of dollars in wine. Completely wasted on an audience that didn't understand a word of his speech. He'd spent an hour crafting those lines.\n\n\"...\"\n\n\"Listen to my story!\"\n\nJishuka burst into the restaurant. She launched into a rapid explanation about Kraugel. English poured out in a breathless stream. Grid and Peak Sword exchanged confused looks. Only Yura and Lauel could follow the words.\n\nLauel glanced at Grid. He turned to Yura and Jishuka.\n\n\"For the moment, keep this a secret from Grid.\"\n\nGrid and Kraugel shared some type of connection. If Grid learned about Kraugel's circumstances, his focus might waver during the competition.\n\n\"I will fix this problem.\"\n\nThe path to recruiting Kraugel into Overgeared had just revealed itself. Lauel smiled. He headed back to his room to begin planning.\n\nThe next morning arrived.\n\nDay two of the National Competition began.\n\n---\n\n**Glossary of Common Korean Terms.**\n**OG: Glossary Link.**\n**Current schedule: 20 chapters a week.**\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}