{
  "id": 426,
  "title": "Chapter 426",
  "content": "# Chapter 426\n\nThe broadcast studio lights gleamed off the polished desk as the analysts leaned forward.\n\n\"This year's National Competition has reduced the number of participants per country.\"\n\nThe second commentator nodded. \"Thus, the siege system has been changed. Now that the siege is ahead of us, let's examine that new structure.\"\n\nSiege remained classified as a team event. All participants from 32 countries bore an obligation to compete. It would unfold in tournament format, matches determined by random draw.\n\n\"Up to here, it's identical to last year. However, several elements have been added.\" The first analyst tapped his notes. \"Every country receives 50 NPCs at level 300. The organizers intend to expand the siege's scale and diversify tactical options.\"\n\nHis colleague whistled low. \"Level 300 means third advancement NPCs. Their presence will dominate the battlefield given that only 47 of the 224 National Competition participants have reached third advancement themselves.\"\n\n\"Exactly. The key to this siege isn't individual strength. It's how effectively you deploy those NPCs.\"\n\nThe third analyst shuffled her papers. \"Whether they destroy enemies or capture the enemy castle, two countries have the highest probability of victory.\"\n\n\"The United States and Japan,\" the first commentator confirmed. \"The United States has Lauel's tactical genius. Japan has Damian's buffs.\"\n\n\"Doesn't Damian give Japan the edge?\" The second analyst gestured emphatically. \"What good is an outstanding strategy when Japanese NPCs receive Damian's buffs? They'll be overwhelming.\"\n\n\"We can't ignore Turkey's Bubat.\" The woman's voice carried certainty. \"Grid defeats him consistently in PvP, but Bubat's true strength manifests in large-scale battles. He might sweep the entire field.\"\n\n\"Canada deserves mention too.\" The first commentator pulled up footage. \"As the peak of guardian knights, Vantner commands wide-range taunts and the strongest tanking power. Combined with Chris' overwhelming damage output, they can neutralize enemy NPCs.\"\n\n\"These five countries are the top candidates.\"\n\n\"What about Russia and South Korea? They have Kraugel and Grid.\"\n\nLaughter rippled through the booth. \"That's impossible. Kraugel and Grid are undoubtedly the strongest individual players.\"\n\n\"But Russia and South Korea lack obvious buffers or strategists.\"\n\n\"If third advancement NPCs can tie down Kraugel and Grid, Russia and South Korea will collapse.\"\n\nThe analyst's tone turned dismissive. \"Particularly the South Korean players are weak. I think they'll struggle to even reach the round of 16.\"\n\n***\n\nThe second day of events finished. Yura and Jishuka arrived at Grid's room.\n\nThe purpose of their visit was pure, despite what dirty minds might imagine. They had each won gold medals. They wanted to celebrate with their favorite man. A good conversation with Grid, nothing more.\n\nBoth women lacked dating experience. They moved cautiously.\n\nGrid didn't misunderstand their visit. His first love, Ahyoung, had trampled his confidence in relationships. *Yura and Jishuka are just friends and colleagues.* He never imagined the world's greatest beauties and top talents might actually like him. He treated them as friends.\n\nHe sat on the couch watching TV with them, completely at ease. Grid even chewed on dried squid.\n\nYura wore a white dress cascading to her ankles, projecting innocent beauty. Jishuka wore a figure-revealing dress that emphasized her sensuality. They had maximized their charms to appeal to Grid. Now they gazed at him scratching his stomach in a t-shirt and shorts.\n\nThe uncomfortable atmosphere stretched.\n\nGrid spoke after being deeply absorbed in the news. \"No matter how I look at it, winning gold in the siege will be difficult.\"\n\nGrid knew Lauel and Damian's strengths better than anyone. He couldn't beat them in a siege. Jishuka leaned close, her chest pressing against Grid's forearm. \"Aren't you giving up too easily?\"\n\nGrid aimed for the top. To reign as an absolute existence. Jishuka thought Grid should fight with everything he had in any situation. Grid felt Jishuka's soft warmth and caught Yura's cold stare. He cleared his throat and chewed more dried squid.\n\n\"I've directly experienced Damian's buff. It's a complete scam. If it's applied to 50 third advancement NPCs...\"\n\nAdding wings to a tiger? No, worse. Creating a monster unit. The thought was terrible.\n\n\"Then Youngwoo, do you believe Japan will win the siege event?\" Yura's voice stayed level.\n\nGrid nodded. \"Japan or the United States.\"\n\nThe siege arena was Anterava Forest. Two massive castles faced each other across woodland. But this forest was enormous. Thorny roads that couldn't be cut. Misty roads where visibility vanished. Swampy roads that trapped travelers. Many zones were judged impossible to traverse. Only eight viable routes existed through the forest.\n\nA siege map with eight invasion paths to the enemy castle. Enough to make Lauel's strategies shine.\n\n*As long as the US and Japan don't meet early, it will happen like this.* Grid assumed the US and Japan would clash in the finals.\n\n\"Then what about South Korea?\" Jishuka studied Grid, who remained locked in thought.\n\nGrid's response came flat. \"As the experts said, we'd be lucky to reach the round of 16.\"\n\nYura didn't deny it. South Korea relied too heavily on Grid, but tying Grid down with third advancement NPCs wasn't difficult.\n\n\"Well, Brazil is the same.\" Jishuka's smile turned brittle.\n\nBrazil was classified as a minor country in Satisfy. Furthermore, Jishuka held a normal class and lacked Grid's potential.\n\nShe rose from the couch. She looked around Grid's room with curiosity and interest, trying to grasp his tastes and tendencies.\n\n\"Hehe, isn't this bed quite large? Not a bed for sleeping alone.\"\n\nShe had fought hard yesterday and today for her country's honor and Overgeared's glory. Jishuka was mentally and physically exhausted. She lay on Grid's bed without any ulterior motives. Then she literally fell asleep.\n\n\"Wow.\"\n\nSilence hung heavy.\n\nGrid looked embarrassed. Yura felt crisis closing in. *I might lose Grid to Jishuka.* She eventually lay on the bed as well. Grid ended up sleeping on the couch. Honestly, he wanted to enjoy the luxury of sleeping beside Yura and Jishuka. But he feared being reported as a sexual harasser.\n\n***\n\nShang X Lila Hotel, third floor hallway.\n\nOne man hid at the corridor entrance watching Grid's room. The United States representative and second-ranked user, Zibal.\n\n\"Ugh... In the end, he's going to sleep with both of them?\"\n\nZibal was a man. He particularly liked pretty girls. Like most men in the world, he felt instinctive attraction toward Yura and Jishuka. But they were tough. He never told anyone, but he'd actually been rejected.\n\nYet Grid. This person who seemed inferior was currently having a wild night with both women. Three hours had passed since Yura and Jishuka entered Grid's room. No one had emerged. Zibal couldn't understand why such exceptional women would fall for Grid.\n\n*You... You lucky bastard.*\n\nGrid had items in the game and boundless energy in reality? Zibal wallowed in envy when a hand touched his shoulder. He spun around in surprise. Lauel.\n\n\"I've been looking for you. I didn't expect you to be a voyeur.\"\n\n\"I'm not a voyeur! What do you take me for?\"\n\n\"Ah, calm down.\" Lauel waved dismissively. \"It doesn't matter what affliction troubles you. Come back to my room.\"\n\n\"Why?\"\n\n\"Why not? Are you planning to hide here all night outside Grid's room? Do you want to glimpse Yura and Jishuka's ankles? Kukuk.\"\n\n\"That's not it! Why should I go to your room?\"\n\n\"I'm holding an operational meeting to prepare for tomorrow's siege.\"\n\n\"Ah...!\"\n\nZibal had been blinded by jealousy, unable to make reasonable judgments. Lauel followed him into the elevator, thinking ahead.\n\n*The ideal siege flow tomorrow...* It included Japan's early elimination and a strong Russian showing. Lauel wanted to remove as much risk as possible before confronting Russia. The reason was simple. He hoped to use a gold medal as bait to recruit Kraugel into Overgeared.\n\nBut he worried whether Russia could perform well in this siege event. The Russian representatives' skills, including Kraugel's, exceeded his expectations. However, he wasn't certain they possessed tactical talent.\n\n*I'll feel sick if Russia meets Japan or Turkey early and gets eliminated.*\n\nAt this moment, even Lauel, who acknowledged and worshipped Grid as much as Huroi and Damian, didn't rate South Korea's chances highly. South Korea had little room to maneuver in the siege event.\n\n***\n\n\"The 2nd National Competition that the whole world watches! Day 3 has started!\"\n\n\"The siege is the only event today?\"\n\n\"Yes, it's tournament format and a team event, so it requires extended duration.\"\n\n\"At this moment, a representative from each country is climbing onto the stage.\"\n\n\"They're drawing lots to determine opponents.\"\n\n\"The representatives who draw the United States or Japan will receive their teammates' and countrymen's resentment. Haha!\"\n\nWho would have the golden touch? Who would draw disaster? The whole world watched monitors with anticipation. Then, after a while, the world's most cursed hand appeared. A character born with rotten luck.\n\nOf course.\n\n\"...Sorry.\" Grid's voice came flat.\n\nGrid picked the United States. The Korean people deflated. Grid started sweating."
}