{
  "id": 427,
  "title": "Chapter 427",
  "content": "# Chapter 427\n\n\"Heh, Grid pulled the A lot,\" one commentator said.\n\n\"The first match of the siege. Against the United States, no less,\" another added.\n\n\"Look at his expression. He's never sweated like this before.\"\n\n\"It's a rare sight. He doesn't have much confidence.\"\n\nThe siege broadcast's ratings climbed rapidly. Most viewers were having the time of their lives.\n\n*Didn't Yura and Jishuka sleep in Grid's room last night?*\n\n*I want to deny it, but the paparazzi caught them leaving his room this morning.*\n\n*He deserves punishment for being alone with the world's most beautiful women.*\n\n*The United States will trample him!*\n\n*Grid's misfortune is my happiness!*\n\nHundreds of millions of jealous men wanted to watch Grid collapse. The Korean audience, meanwhile, resigned themselves to reality.\n\n*Well, we'd struggle to medal in siege even without facing the U.S. immediately.*\n\n*Better to get eliminated early. Our players can rest and come back stronger tomorrow.*\n\n*Grid definitely spent too much energy last night.*\n\n*He drew the U.S. on purpose. Playing the long game.*\n\n*Truly God Grid.*\n\nWith early elimination confirmed, Korean citizens tried thinking positively. Grid did the same.\n\n*I'll finish quickly and hit the capsule room.*\n\nWhat if he focused on hunting while other rankers wasted time in the competition?\n\n*I can get ahead.*\n\nGrid thought only of the game. He had no interest in exploring Paris. Lauel approached.\n\n\"Think of this as war exercises.\"\n\n\"War exercises?\"\n\nLauel grinned.\n\n\"Isn't your ultimate goal to get rich, be the best, and earn recognition? To achieve that, you must become a king.\"\n\nThe first condition for kingship was lineage, but users had no lineage. What Grid needed was justification and vast territory. His destiny meant constant warfare to expand his holdings.\n\n\"Normally, war simulations require massive manpower and money. Overgeared can't afford that yet. But today we have a free simulation opportunity.\"\n\n\"...\"\n\n\"Do your best. I'll teach you strategy and tactics.\" Lauel paused. \"Well, if you're scared, you can surrender early. Accept your limits.\"\n\nLauel was the only Overgeared member who openly criticized Grid. He always pointed out Grid's faults, sometimes making him feel ashamed. The reason? He wanted Grid to grow. Right now was no different. Lauel spoke in a condescending tone, clearly provoking him.\n\nHe knew. The current Grid had lost his drive. Lauel couldn't stand idle.\n\n\"...\"\n\nThe old Grid would have felt resentful without understanding Lauel's intentions. But now things were different. He saw why Lauel was provoking him.\n\n\"Okay. Bring it on.\"\n\nHe'd been idle too long. Give up? That proved he'd lost himself lately.\n\n*Wake up.*\n\nGrid slapped both cheeks with his palms. His black eyes regained their light.\n\n*I'll give everything to win.*\n\nAs always.\n\n***\n\n\"You're babying Grid.\"\n\n\"Think I'll throw the match?\"\n\nThe American representatives overheard Lauel and Grid's conversation. Lauel shrugged at them.\n\n\"Don't worry. I'll fight at full strength for Grid's development.\"\n\nMore importantly, he had to win until they faced Russia. Lauel had no intention of losing to South Korea.\n\n*The variables Korea has are the <span class=\"rarity-legendary\">Ruler's Cloak</span> and the <span class=\"rarity-mythic\">Hooded Zip Up</span>.*\n\nLauel knew most of Grid and the Overgeared members' equipment. First, the <span class=\"rarity-legendary\">Ruler's Cloak</span>. Grid had acquired this legendary item when Reidan's Overgeared knights formed. Charge Command, Military Command, and Ruler's Voice were all cloak skills, creating a simple, efficient command system. If Grid leveraged it properly, he could efficiently control 50 NPCs and pose a moderate threat.\n\nNext was the <span class=\"rarity-mythic\">Hooded Zip Up</span>. Grid had crafted these invisibility cloaks from sylphid scales. Grid, Yura, and Peak Sword each owned one, so stealth tactics required vigilance.\n\n*Besides that.*\n\nHe needed to watch Grid's raw attack power. Yura hadn't grown enough to match the U.S. representatives outside hell. Peak Sword could only occupy one American. The other Korean representatives weren't worth consideration.\n\n\"Let's go.\"\n\nSouth Korea and the United States opened the siege event. Hundreds of thousands cheered as they entered the capsules.\n\n***\n\n> [You have entered Anterava Forest.]\n>\n> [You have 20 minutes before the siege starts. Please prepare during this time.]\n\n\"South Korea? Good for warming up.\"\n\n\"Can they even warm us up?\"\n\n\"Hahaha!\"\n\nThe United States team's mood had actually been terrible when Zibal drew the A lot. The siege event only revealed the map and basic rules. They faced tremendous pressure without information about the 50 NPCs, and they were expected to open the first match. They'd also worried about facing Japan immediately.\n\nThen Grid drew the A lot after Zibal. What a nice guy. The U.S. representatives relaxed. South Korea posed no threat. Their steps were light as they entered the castle with its low one-meter walls.\n\n\"Hoh, the rumored NPCs.\"\n\n\"Let's get a closer look.\"\n\nThe castle garden held 50 NPCs. Fifteen wore heavy armor and carried large shields. Twenty close-combat soldiers wore light armor and gripped sharp weapons. Ten archers and five magicians completed the force.\n\n\"Panmir, check their equipment status. We'll measure their stats through light sparring.\"\n\nZibal issued orders, then froze when he saw the NPCs' faces.\n\n\"Rather rude to demand inspection of our equipment and skills, isn't it?\" one NPC said.\n\n\"A disrespectful group arrived as reinforcements,\" another muttered.\n\n\"Do you even have skills? I don't trust you.\"\n\nThe NPCs' remarks left Zibal and the U.S. representatives baffled.\n\n*These NPCs aren't our subordinates.*\n\n*They're equal in status?*\n\n*We're playing NPC reinforcements?*\n\nA notification window appeared before the U.S. team.\n\n> [A joint quest has occurred.]\n>\n> [Siege War]\n>\n> **Level of Difficulty:** Not measurable.\n>\n> Two countries war for ownership of Anterava Forest.\n> You are a member of Kingdom A.\n> Cooperate closely with Kingdom A's knights to occupy Castle B and claim Anterava Forest.\n>\n> * This quest was specifically developed for the National Competition and isn't related to Satisfy's story. However, the NPCs understand Satisfy's worldview.\n>\n> **Victory Condition:** Take over Castle B or eliminate all Kingdom B troops.\n>\n> * Time limit is 2 hours. Without a victor, the country with the most survivors wins.\n> * Purely defensive play will cause NPC affinity to drop exponentially, leading to defeat.\n\n*This...*\n\nThey'd expected soldier-type NPCs. But allies? Completely different from their assumptions. Forming an absolute command structure would be difficult.\n\n\"Let's assault the enemy castle. Those seven follow our plan.\"\n\nThe NPCs started acting independently. Without command authority, any developed plans became useless. What should they do? The U.S. representatives scrambled before reaching an idea.\n\n\"Lauel, explain your strategy to the NPCs.\"\n\n\"Right. If they hear a solid plan, they'll understand and transfer command to you.\"\n\nTrue enough. However, whether explaining the plan would change NPC attitudes remained doubtful. Stupid NPCs might exist. Lauel asked his teammates.\n\n\"Who has dignity, leadership, or charm stats?\"\n\n*Ah!*\n\nThe team members grasped Lauel's intent. Among them, Zibal, Skull, and Zephyr stepped forward. Top rankers holding various titles, including nobility. They each had at least 300 points in **Dignity**. Zibal and Skull had additionally unlocked **Leadership** and **Charm**.\n\nLauel took the lead and addressed the NPCs.\n\n\"I am Lord Lauel. As an earl and hero of the Eternal Kingdom, we will not fail. Trust in my honor and status. Follow my commands in this war, and I guarantee victory.\"\n\nZibal, Skull, and Zephyr backed him up. More than half the NPCs exchanged glances and nodded.\n\n\"We'll trust you for now.\"\n\n\"But if you prove incompetent, we'll no longer follow orders. You'll follow ours instead.\"\n\n\"Understood.\"\n\nLauel and Zibal nodded without hesitation. Exactly 31 NPCs bowed to them. The remaining 19 watched silently. Still, enough for a functioning chain of command. With this positive development, Lauel began explaining his plan. The NPCs grew impressed and gradually trusted him.\n\nViewers worldwide watched the process in awe.\n\n*Wow, looked bad at first when I saw the NPC attitudes.*\n\n*The U.S. representatives have enormous dignity. Now the NPCs follow willingly.*\n\n*Lauel is first class.*\n\n*Doesn't Lauel have over 500 dignity?*\n\n*Dignity aside, the NPCs quickly bought into the plan. Lauel prepared a brilliant operation.*\n\nWhat about South Korea? As the U.S. representatives checked NPC equipment and skills, the screen switched to the Korean castle.\n\n\"Grid is the first user duke, so his dignity and charm stats likely exceed Lauel's.\"\n\n\"Unknown if other Korean representatives unlocked special stats like dignity.\"\n\n\"South Korea lacks a strategist like Lauel. We must worry whether Grid can persuade the NPCs. Wait, what?\"\n\n\"W-What is this?\"\n\nThe commentators gaped in shock. The viewers mirrored their reaction. Why? Grid wore a small crown as he walked forward.\n\n\"I will swear allegiance to you!\"\n\n\"Just say the word! I will follow you!\"\n\nThe 50 proud NPCs dropped to their knees! The world reeled in shock as Grid smiled.\n\n*Lauel, strategy skill doesn't matter.*\n\nGrid would demonstrate his unique value by shattering conventional logic with items. He gripped the Great Lord's Sword and issued an absurd command to the kneeling NPCs.\n\n\"Take off your equipment.\""
}