{
  "id": 428,
  "title": "Chapter 428",
  "content": "# Chapter 428\n\nSpecial stats could only be opened through specific quests, titles, positions, or classes. Unlike basic stats like strength, stamina, intelligence, and agility, players couldn't distribute points into them. Raising them was a slow, difficult grind.\n\nGrid was different.\n\nEvery time he created an item above a certain rating, all his stats increased. Titles like Apostle of Justice, Kingdom's Hero, and First Duke added more. Then there were the items. The <span class=\"rarity-legendary\">Holy Light Crown</span> boosted his intelligence by 300 and dignity by 200. The Great Lord's Sword granted 150 dignity, 150 insight, and 150 leadership.\n\nThe total? Grid currently possessed 2,000 dignity, 1,000 charm, and 300 leadership.\n\nThat wasn't all. Pagma's Descendant came with a built-in effect called 'Easily Acknowledged.' NPCs, especially those with sharp instincts, couldn't help but look up to him. A single glance into Grid's eyes revealed he was someone *important*.\n\nHis presence crushed the air around him. This was why Lauel often claimed Grid had the makings of a king.\n\nHowever.\n\n\"Take off your equipment.\" \n\nNo matter how imposing someone was, that command couldn't be swallowed easily. Strip down in the middle of a war camp? Maybe if their affinity was maxed out, but these 50 NPCs had no reason to trust Grid's bizarre order.\n\nIn the confused silence, Grid pulled the Ruler's Cloak over his shoulders.\n\n\"Take it off.\" His voice cut through the murmurs. \"If you want to win this war, trust me.\"\n\n\"...!\"\n\nThe words were the same. But this time, Grid's voice resonated through the castle walls. It carried weight that sent shivers down spines. This was the effect of Ruler's Voice, a passive skill attached to the cloak.\n\n\"I understand.\"\n\nSomething in Grid's tone made it feel like truth itself. Whatever he said seemed destined to become reality. The 50 NPCs felt an inexplicable trust bloom in their chests. They began removing their armor.\n\nGrid watched them while gripping the Great Lord's Sword.\n\n*The fastest way to make them stronger is enhancement.*\n\nAt first, he'd considered strengthening the NPCs' existing equipment. But the cost was staggering. These NPCs might be disposable. He couldn't afford excessive investment. Besides, he didn't have many enhancement stones to spare. He'd already used most of them enhancing the recently crafted <span class=\"rarity-legendary\">Triple Layers</span> for the National Competition.\n\nGrid shifted to plan B. Actually, plan B and C.\n\nMethod one was Legendary Blacksmith's Appraisal. He'd search for hidden features in their items and unlock them. Instant power boost.\n\n*Complete failure.*\n\nHe appraised every piece of equipment the 50 NPCs owned. Not a single hidden feature appeared. Method one, discarded.\n\nGrid's jaw tightened, but he didn't despair. He still had method two. Character Observation, courtesy of the Great Lord's Sword.\n\nLike this.\n\n> **Name:** Tron  \n> **Level:** 300  \n> **Class:** Heavy Armor Knight  \n> **Strength:** 1,610 | **Stamina:** 1,300  \n> **Agility:** 500 | **Intelligence:** 105  \n> **Possessed Skills:** Piercing, Charging, Three People Provocation, Shield Throw, Steel Skin, Intermediate Spear Mastery Lv. 3, Intermediate Shield Mastery Lv. 5  \n> **Unique Skills:** Increased Attack Power (Passive), Rotation Cut, Advanced Sword Mastery Lv. 5\n\n> **Name:** Cary  \n> **Level:** 300  \n> **Class:** Armored Sword Knight  \n> **Strength:** 1,500 | **Stamina:** 600  \n> **Agility:** 1,415 | **Intelligence:** 80  \n> **Possessed Skills:** Increase Aura Attack Power, Three Stage Cutting, Ascending Slash, Intermediate Sword Mastery Lv. 8  \n> **Unique Skills:** Multi Shot, Quick Shot, Advanced Bow Mastery Lv. 6\n\n\"Tron.\"\n\n\"Yes!\"\n\nGrid pointed at the spear in the knight's hands. \"Throw that away. Take Cary's sword instead. Cary, give him the sword. Pick up a bow.\"\n\n\"Huh?\" Cary blinked. \"Ah... Yes! Understood!\"\n\nEveryone had talents. Aptitudes. Skills they were born to master. But life didn't care about talent. Society forced people into roles they weren't suited for. Compromises. Dead-end jobs. NPCs were no different. Some wasted their potential due to circumstances. Others never discovered what they were truly capable of.\n\nGrid had learned this watching Reidan's soldiers and knights grow.\n\n\"How did he know?\"\n\n\"He saw my aptitude at a glance?\"\n\n\"There were no openings in the light armored division, so I had to learn shield techniques I hate...\"\n\n\"Grid just gave me what I always wanted.\"\n\n> [Affinity with Tron has increased by 20.]  \n> [Affinity with Cary has increased by 20.]  \n> [Affinity with Faiba has increased by 20...]\n\nThe notifications kept rolling. Gratitude flooded from the NPCs. Grid had seen through them. Identified their true talents. Redistributed weapons and roles to match. The NPCs stared at him, unable to look away. \n\nThe Korean representatives mirrored their awe.\n\n*How is this even possible?*\n\n*Grid keeps doing things that break common sense.*\n\n*He's on another level. Not like normal players at all.*\n\nWhile admiration rippled through the camp, Grid continued his inspection. Then his lips curled into a strange smile.\n\n\"Found someone interesting.\"\n\nHis sharp eyes locked onto an NPC standing among the mages. Lucky. The only one among the 50 NPCs with a special stat. The **good luck** stat, specifically. A stat Grid didn't possess despite having 14 different stats. Probably never would.\n\n\"You'll use this weapon.\"\n\n\"...?\"\n\nGrid tossed something to Lucky. Everyone's eyes widened. Confusion spread like wildfire. \n\n*What is Grid doing?*\n\nIt seemed like a joke. The weapon Grid handed to the *magician* Lucky was a flail.\n\n\"Why are you giving me farming equipment?\"\n\nLucky liked magic. He had zero interest in agriculture. Why was he being handed a farming tool in the middle of a war?\n\n*Is he saying I'm useless?*\n\nLucky's confusion twisted into hurt. His chest ached at the idea his existence was being denied.\n\n\"Take it.\"\n\nGrid's tone left no room for argument. He moved past the frozen mage and pointed at another NPC.\n\n\"Swan, follow me.\"\n\nThat strange smile returned. Swan's anxiety spiked as he was led into a tent.\n\n***\n\n『 What is he doing? 』\n\n『 I don't understand Grid's actions at all. 』\n\nThe National Competition commentators floundered. Why had Grid ordered the 50 NPCs to strip their equipment? Why swap items around like puzzle pieces?\n\n**-He's changing their roles?**  \n**-That's too absurd to be strategic.**  \n**-Why give a mage farming tools???**  \n**-This makes no sense...**\n\nAs viewer confusion mounted, a few sharp experts offered theories.\n\n『 Wait, I just remembered something. Grid's current sword looks similar to the Lord's Sword. Only a king or emperor can grant that item, and it displays detailed character information. 』\n\n『 So Grid is checking the NPCs' abilities and reassigning roles based on their stats? 』\n\n『 We can't confirm that. The Lord's Sword is rare. Very little information exists. Grid's sword has some visual differences too. 』\n\n『 Either way, one thing is certain. Giving a mage a farming tool is ridiculous. 』\n\n『 Haha... Ah, while we're talking, the battle between South Korea and the US is about to begin. 』\n\nThe 20-minute preparation window closed. The first match of the Siege event started.\n\n***\n\n**The US Team.**\n\nZibal and Lauel led the American representatives and their NPCs out of the castle. Zibal's gaze swept across the Anterava Forest before returning to the walls. The blacksmith Panmir stood there.\n\n\"Panmir, I'll ask one last time.\" Zibal crossed his arms. \"The NPCs' equipment is in good condition?\"\n\n\"How many times are you going to ask?\" Panmir's voice dripped with irritation. \"According to my inspection, they're armed with level 300 rare items. Durability is fine.\"\n\n\"Good. Focus on siege weapons from now on.\"\n\n\"I already know that. Stop nagging.\"\n\nPanmir, the 1st ranked blacksmith. He'd learned dwarven techniques. The result was versatility. Ego items, magic weapons, siege engines. He could craft them all. In his mind, he was superior to Grid.\n\n*Grid, please make it here. Then I'll crush you.*\n\nGrid stumbled into a legendary class by pure luck. Became the best blacksmith without any real effort. Panmir's hostility toward him was bottomless.\n\nHe turned to begin constructing siege weapons. Zibal looked at Skull. The 8th ranked player commanded eight NPCs and was heading to the position Lauel predicted Grid would appear.\n\n\"Will Grid really show up there?\"\n\n\"One hundred percent certain.\" Lauel adjusted his glasses.\n\n\"You must have a reason for being so confident.\" Zibal frowned. \"I'll trust your brain for now. But one problem. Do we really need this many people just to stall Grid? Even Skull is part of it...\"\n\nLauel's expression didn't change. \"If Grid uses Blackening, he's stronger than Kraugel before Super Sensitivity activates.\"\n\n\"To that extent?\" Zibal's eyebrows climbed. \"Even so, the duration is only around three minutes.\"\n\n\"We need Skull and eight third advancement classes to survive those three minutes.\"\n\n\"...\"\n\nZibal couldn't wrap his head around it. He was 2nd in the rankings. Even he'd struggle against Skull and that many third advancement NPCs. But he couldn't deny Lauel's assessment.\n\n\"Fine. I understand.\" Zibal turned. \"I'm moving out.\"\n\nHe vanished into the forest."
}