{
  "id": 429,
  "title": "Chapter 429",
  "content": "# Chapter 429\n\nEight paths carved through Anterava Forest.\n\nSome twisted like intestines, branching and reconnecting in deliberate confusion. Others bristled with obstacles, forcing attackers into killing grounds. Several narrowed to chokepoints where only a single file could pass. One route lay broad and inviting.\n\nDespite their varied nature, every path shared one unifying trait: they all converged on the enemy castle.\n\n*That's the problem.* Lauel studied the terrain map. *How do you defend eight approaches simultaneously while maintaining enough force to attack?*\n\nToo many variables. Too many potential disasters. Victory seemed impossible to guarantee.\n\nBut Lauel had learned something during his time with Grid. When military strength was equal, when terrain offered no advantage, the deciding factor became psychology. Understanding your opponent's nature mattered more than any tactical genius.\n\nAnd Lauel understood Grid perfectly.\n\n***\n\nThe central path cut straight through Anterava Forest.\n\nFlat terrain. Shortest distance to the enemy castle. Room for massed formations. The Korean team advanced along it in disciplined ranks. No point trying to outthink Lauel's strategic brilliance. Better to concentrate their power and end this quickly.\n\nLauel had anticipated exactly that.\n\n\"Welcome.\"\n\nThe Korean vanguard froze. From the forest flanks, American forces materialized like ghosts. Tankers snapped shields up, but...\n\n*Thwack! Thunk!*\n\nA storm of arrows descended. Spell-light flashed. Bodies crumpled.\n\n\"Gah!\"\n\n\"Shit!\"\n\nAmbush. The Americans had already loosed their volleys before the Koreans registered the threat. Arrows found gaps in armor. Magic burned through hastily raised defenses. Confusion rippled through the Korean formation.\n\n\"Hit them now!\" Zibal roared.\n\n*Crash!*\n\nAmerican tankers and damage dealers surged from concealment, slamming into the reeling Koreans. Zibal pressed forward, ready to crush South Korea beneath American boots.\n\nThen he noticed something wrong.\n\n*The NPCs.* Three Korean soldiers intercepted him, their movements crisp and coordinated. *Why are they so strong?*\n\nThe American and Korean NPC contingents should have been identical. Same levels, same equipment. But the Korean soldiers fought like veterans, absorbing the ambush and reforming ranks with minimal casualties.\n\n\"Tch.\" Zibal found himself pinned by the three NPCs while Korean mages launched counterattacks from the rear. Yura's magic bullets traced glowing arcs through the canopy. The American momentum stalled.\n\n\"Regroup!\" Peak Sword barked orders to the scattered Koreans.\n\nLauel stepped forward, smile playing across his lips. \"As expected from Grid. He made proper use of the Great Lord's Sword.\"\n\n*Great Lord's Sword?* Zibal's mind raced. He'd heard of the Lord's Sword, but this...\n\n*Is there a special version only dukes receive?*\n\nDread pooled in his gut.\n\nPeak Sword leveled his blade at Lauel. \"How were you so certain we'd take this route? What made you confident enough to commit your forces to this ambush?\"\n\n\"Before the siege began, I made a declaration to Grid.\" Lauel's voice carried across the battlefield. \"I told him I would demonstrate great strategies and tactics.\"\n\nHe emphasized that final word.\n\n\"I wanted to plant a bias. Make him believe Lauel would employ complicated maneuvers and clever schemes.\"\n\nThe Americans listened despite themselves.\n\n\"So Grid gave up predicting my movements. He decided to focus on speed instead.\"\n\nLauel couldn't have missed that forcing forward with overwhelming power was Grid's preferred method. His voice rose theatrically.\n\nPeak Sword's face drained of color. \"You wanted us to use this route.\"\n\n\"Correct.\"\n\n*Twang! Twang! Twang!*\n\nAmerican archers loosed another volley. This time the Korean rankers were ready. Shields angled to deflect. Arrows clattered harmlessly to the trampled earth.\n\nPeak Sword's confidence returned. \"You trying to shake our morale? You're outnumbered. We have ten more soldiers than you.\"\n\n\"Oh?\"\n\n\"You must have scattered defenders across the other paths. Spreading yourself thin just in case we didn't take your bait.\"\n\nLauel tilted his head. \"Is that what you think?\"\n\n\"You're in trouble now.\"\n\n\"Interesting.\" Lauel's expression never wavered. \"What makes you believe superior numbers guarantee victory on this route?\"\n\n\"Let's find out.\"\n\nGrid had redistributed NPC roles using **Character Observation** from the Great Lord's Sword. Each Korean soldier now operated at peak efficiency for their assigned task. But the level gap between American and Korean rankers remained stark. With powerhouses like Zibal leading the assault, ten extra soldiers meant nothing.\n\n*But...*\n\nPeak Sword's faith was absolute. Grid had separated from the main force, selecting a different route through the forest. Lauel's paranoia would have forced him to place at least a token defense on every path. Grid would tear through whatever skeleton crew guarded his chosen route and race for the American castle.\n\n*Until then, we hold.*\n\nGrid would shatter Lauel's elaborate scheme. They just had to endure.\n\nUnder Peak Sword's command, Korea formed a defensive wall. Lauel watched them dig in.\n\n\"There's one person missing from your formation.\"\n\nHe'd expected as much. No point twisting the knife. They were guildmates, after all. No need to crush their hopes with cruel words.\n\nNot yet.\n\n***\n\nThe southernmost path through Anterava Forest crawled like a broken spine. Narrow. Choked with obstacles. Longest route to the enemy castle by a significant margin.\n\nSkull led eight NPCs down that miserable trail. His orders were simple: intercept Grid. If Grid failed to appear, occupy the Korean castle as a secondary objective.\n\nBut Lauel had been adamant. *Grid will come this way.*\n\n*If victory isn't assured, you bet on psychology.* Skull respected Lauel's genius, but doubt gnawed at him. *Grid has flight magic. These obstacles won't slow him down much.*\n\n*What if Lauel's wrong?*\n\nThen America would be relying entirely on Panmir's defense. Skull's gut churned with anxiety. They moved at a crawl, spell-light pulsing as the mages maintained **Magic Detection**.\n\n\"Hah!\"\n\nSkull's forced laugh died in his throat. In the distance, unmistakable items gleamed. A helmet obscured the ID tag, but the silhouette...\n\n*Grid!*\n\n\"Enemy contact! Engage!\" Skull's shout echoed through the trees.\n\n\"Understood.\"\n\nThe NPCs drew weapons and charged. Mages hung back, conserving spells for emergencies. They unleashed only basic attack magic.\n\nIt was enough.\n\n*Clang! Crash!*\n\nThird advancement NPCs lived up to their reputation. Grid staggered under the coordinated assault, driven onto the defensive.\n\n\"Die!\" Skull spotted an opening and struck for Grid's neck.\n\n*Thunk!*\n\nOvergeared bastard. Grid's defense absorbed most of the impact, but Skull didn't panic. Grid was moving like shit, nothing like his performance in the target processing match. Sloppy. Desperate.\n\n*I could have handled him alone.*\n\nSkull rolled under a wild counterattack and launched a sweeping kick. Grid stumbled, then turned and ran. Toward the American castle.\n\n*Pathetic.*\n\nSkull gave chase, savoring the hunt.\n\n***\n\nThe center of Anterava Forest had become an abattoir.\n\n\"Hah... hah...\" Peak Sword gasped for air. \"They're solid.\"\n\n\"It's America.\" Yura's voice was tight with strain.\n\nKorea clung to their defensive position. Health bars flickered in the red. Stamina gauges scraped empty. The Americans had surrounded them in a tightening noose, but couldn't relax either. Korean NPCs had savaged the American soldiers during the initial clash.\n\nBut American rankers had tipped the scales. Zibal and his team fought like demons, gradually overwhelming the numerically superior Korean force through sheer skill.\n\n*How did the Great Lord's Sword create such a massive performance gap?* Zibal's envy was a living thing. *Overgeared Grid.*\n\nTime to end this.\n\n\"Finish them.\"\n\n*Shing!*\n\nAmerican weapons rose as one. Korean representatives braced for death.\n\n*We couldn't hold.* The thought burned. Despite Grid's NPC enhancements, they'd failed to buy him enough time. Shame and frustration warred in their chests.\n\nThe Americans stepped forward for the killing blow.\n\n*Crack!*\n\nA strange, almost cheerful sound echoed from the Korean formation. Like someone beating a rug. Wet and meaty.\n\n*What the hell?*\n\nBoth sides turned toward the noise. Confusion spread like wildfire.\n\nA magician stood over a fallen knight, repeatedly striking him with a flail.\n\nOn the same team.\n\nZibal's hand flew to his forehead. Phantom pain from old memories. *Farming equipment.*\n\n\"Finally.\"\n\nThe knight being beaten spoke, his voice muffled by cloth wrappings around his head. Unlike the other NPCs, no name tag floated above him.\n\n*What?*\n\nKorean eyes widened. The faceless knight's health bar, which had been flickering near death, suddenly filled to maximum.\n\nConfusion deepened. An awkward silence descended.\n\n\"Do you have any idea how terrible that was?\" The knight sat up, unwinding the cloth from his face. \"While all of you fought for your lives, I stood still getting beaten with a farming tool. Awful. I genuinely thought I was going to die.\"\n\n\"No...\" Breath caught in Korean throats.\n\nThe complaint continued as the name tag appeared above his head.\n\n\"Grid!\"\n\nThe truth detonated like a bomb.\n\nGrid had never intended to rush the American castle alone. Lauel had caught that plan and killed it. Even with strengthened NPCs via **Character Observation**, the Korean force couldn't overcome America's superior rankers.\n\nSo Grid had relied on his items instead.\n\nThe method was simple, if insane. Have Lucky continuously beat him with the **Motley Flail**. Resist the debuffs. Keep getting hit until the probability finally aligned and the best possible buffs triggered. A dangerous gambit that could have ended with a catastrophic effect like dropping his health or mana to a single point.\n\nBut normal tactics wouldn't beat America. So he'd taken the risk.\n\nAnd now, finally...\n\n> **[You have received a great blessing from the Motley Flail!]**\n>\n> **[All resources have recovered by 100%!]**\n>\n> **[Attack Power and Defense are doubled for 2 minutes!]**\n>\n> **[Accuracy is set to 100% for 2 minutes!]**\n>\n> **[Your next attack will be a guaranteed critical hit!]**\n\nGrid rose, shedding the borrowed NPC armor. \"Time to get serious.\"\n\nHe'd loaned his **Triple Layers** to Swan for this operation. Instead, he wore the **<span class=\"rarity-legendary\">Holy Light Set</span>**, **Grid's Boots**, and wielded **Iyarugt**. \n\nImmediately, he stacked buffs. **Blackening** shifted his species classification. **Blacksmith's Rage** surged through his muscles. **Quick Movements** sharpened his reflexes to inhuman speed.\n\nThen he unleashed **Pinnacle Kill**.\n\nZibal, mind still reeling from farming equipment trauma, failed to react.\n\n> **[CRITICAL HIT!]**\n>\n> **[The Holy Light Gloves' option effect is activated!]**\n>\n> **[Skill Generated: 5 Joint Attacks]**\n\nGrid stared at the cascade of notifications. The legendary gloves had finally triggered their rarest effect.\n\nFive strikes where there should have been one.\n\nZibal's health bar vanished. His body crumpled.\n\nAnother title was about to be etched into Zibal's profile. One that would haunt him forever.\n\n*Punching Bag.*"
}