{
  "id": 43,
  "title": "Chapter 43",
  "content": "# Chapter 43\n\n*These goddamn bastards.*\n\nThey'd arrested me before the quest could finish. Now I sat in an interrogation room deep inside Winston Castle, the stone walls reeking of mildew and old iron. An hour. A full fucking hour of this.\n\nThe middle-aged knight leaned across the scarred wooden table. \"Several people witnessed you talking to Huroi in front of Khan's smithy. Did you already know he was planning to contact Earl Steim?\"\n\n\"So what if I knew?\"\n\nHis jaw tightened. \"A resident of Winston entrusted Huroi with that task. Since you're close to the residents, don't you know who commissioned him?\"\n\n\"So what if I know?\"\n\n\"Then aren't you one of them?\"\n\n\"No?\" I let the word hang in the air between us. \"Are you stupid?\"\n\nThe knight's face flushed red.\n\nI'd made a **better** dagger than that girl Erina. The quest was mine, the victory **mine**, the 600 gold **mine**. But this arrest, this unlawful, corrupt, bullshit arrest had stolen it all. Thanks to these bastards, 720,000 won had evaporated into thin air.\n\nThe knight's voice dropped low, threatening. \"I don't think you know what position you're in. If you continue to be so carefree, you will regret it.\"\n\nSomething hot flared in my chest. \"Shut up, you rotten bastard. What are you, a comedian? I want your head on a pike. I have **no connection** with Huroi. Let me out. **Now**.\"\n\n*I knew what came next.* Torture. Prison. Maybe death. But I was fury incarnate, the living embodiment of rage. 720,000 won. Gone.\n\n*How many bowls of mackerel is 720,000 won?*\n\nThe anger poured out in a stream of venom. \"You ridiculous jerk! I'll remember every one of your ugly faces. One day I'm coming back to squeeze 600 gold out of each of you, so release me now before I窶能"\n\n\"Look at this guy!\" A younger knight shot to his feet. \"He keeps talking nonsense!\"\n\nLeo. The youngest knight in the room. His hand went to his sword hilt, knuckles white. I flinched, but the anger was a furnace, burning away fear.\n\n\"Kill me then, motherfucker.\"\n\n\"This rascal isn't scared until the end!\"\n\nLeo couldn't take it anymore. He rushed forward, blade singing as it left the scabbard. I squeezed my eyes shut.\n\n*Kill me.*\n\n*Do it.*\n\nIn this situation, death was the **better** option. If I died, I'd resurrect in the square. I couldn't stay trapped here. Better to lose the experience and respawn than rot in this hole.\n\n*Khan.*\n\nThe thought hit me like cold water. In the worst case, I wasn't the presumed winner, which meant the Mero Company would seize the smithy. Khan would die. My class quest would shatter into pieces.\n\n\"Kill me quickly, you son of a bitch!\"\n\nI couldn't log out. Had to die. Had to resurrect. Had to reach Khan.\n\nThe middle-aged knight caught Leo's wrist before the blade could fall. \"Hey, Leo, calm down.\" His voice was measured, almost bored. \"Aren't you aware? He has an immortal body. Killing him just releases him into the field.\"\n\n*Fuck.* Plan failed.\n\nI kept going, pushing Leo's buttons, hoping he'd lose control completely. \"Hey! You aren't going to kill me? You **can't** kill me? Are you scared? What kind of knight are you?\" I leaned forward against my restraints. \"You pathetic bastard, you probably can't even eat spicy food. You'll die a bachelor! When you die, you'll become a ghost. A pervert ghost who peeps at girls in the bath!\"\n\n\"Ugh... y-you...\"\n\nLeo's hands shook. The sword trembled. His lip caught between his teeth, blood welling up. One more push. Just one more窶能n\n\"This... oof? **Oof!**\"\n\nSomeone shoved a gag into my mouth, tying it tight behind my head.\n\n*These rotten, lousy bastards!*\n\nI glared murder at the middle-aged knight.\n\n\"You have no intention of admitting to any crime.\" His tone was conversational, clinical. \"You also have no intention of telling us who commissioned Huroi?\"\n\n\"**Oof oof!!**\"\n\n*If you want me to answer, take off the fucking gag!*\n\nThe knight nodded as if I'd responded properly. \"You really won't answer? Then I have no choice but to imprison you.\" He paused. \"But if you tell me who commissioned Huroi, you might be treated differently.\"\n\n*No. No no no.* Prison meant days. Weeks. Months, maybe. It wouldn't matter how many times I logged out and back in. The imprisonment would persist.\n\n*I can tell them.* The thought crystallized, cold and sharp. *If Khan gets arrested, I'll find a way to rescue him.*\n\nKhan was invaluable. In Satisfy and reality both, a precious friend. NPC or not, he was **friend**.\n\nBut a friend was just a friend.\n\nNo matter how important a friend was, **my life** was more important.\n\nThe decision settled in my gut like a stone.\n\n\"**Ooof! Oof!**\"\n\n*I'll tell you! I'll sell Khan out! Just release me!*\n\nThe knight nodded, misunderstanding completely. \"What a great guy. You won't sell out your friend, even facing prison?\" Something like respect flickered in his eyes. \"You might be weak, but your sense of justice is admirable.\"\n\n\"**Oof oof! Oooooup!**\"\n\n*What the hell are you talking about?! I'll tell you everything if you just remove this goddamn gag!*\n\nThe knight turned to the soldiers. \"Imprison him. Solitary confinement.\"\n\n*S-Solitary?!*\n\nPrison was bad enough, but **solitary?** Alone. No other prisoners. Nothing.\n\n\"**Oof! Ooooof!**\"\n\nI thrashed against the ropes, panic flooding my veins. The knights ignored me. Soldiers grabbed my arms, hauling me toward the door.\n\n*No. What the hell is happening? Imprisoned forever? What about Khan's smithy? Khan can't die. He CAN'T. And that stupid Huroi, why did you fail your quest and drag me down with you?*\n\nWe descended. Stone stairs spiraling down, down into darkness.\n\n> [The quest **'Apostle of Justice'** has been created.]\n\nThe system window blazed blue in my vision.\n\n> **[Apostle of Justice]**\n> \n> **Difficulty:** S\n> \n> Huroi, who attempted to inform Earl Steim about the corruption in Winston, has failed his mission and been captured.\n> \n> He has been locked in solitary confinement for a long time.\n> \n> You are the only one who knows Huroi's circumstances. You are the only one who can help.\n> \n> Rescue Huroi for the sake of justice.\n> \n> **Quest Clear Conditions:** After being trapped in the deepest dungeon, rescue Huroi within seven hours.\n> \n> **Quest Reward:** The title 'Apostle of Justice.' Affinity with Winston residents will rise to maximum. Reputation in Winston will rise to maximum. Create a linked quest with Huroi.\n> \n> * **Apostle of Justice:** The 'Courage' stat will be opened. All stats **+10**. The skill 'Unbreakable Justice' will be generated.\n> \n> **Quest Failure:** Level **-2**. The title 'Coward' will be generated.\n> \n> * **Coward:** Affinity with NPCs will decline. The probability of acquiring quests will decline. You will be despised by NPCs with a positive inclination.\n\n*The reward.* I recognized it. This was the same compensation Huroi had mentioned when he told me about the 'For the Residents of Winston' quest. A linked quest.\n\n*I'm greedy for that title.*\n\n**But.**\n\n*I have no intention of accepting this quest.*\n\nI was about to be locked in solitary confinement, and they expected me to rescue Huroi? Within **seven hours**? It was impossible. Unconditional failure.\n\n*What fool would accept this?*\n\nThe penalties burned in my mind. Level drop. The 'Coward' title. A junk status as bad as 'Noble Killer.' I could **never** accept.\n\nBut窶能n\n> [You cannot refuse this quest. Quest is in progress.]\n\n*Why?*\n\n**Why me?**\n\n\"**Oof! Ohh! Ohhhhhh! Ohhhh!**\"\n\nThe sounds tore from my throat, muffled by the gag. I nearly choked on my own spit, coughing and drooling through the cloth. One of the soldiers smacked me on the back, hard.\n\n\"This bastard! Can't you be quiet?\"\n\nHis companion laughed. \"Solitary confinement is scary, isn't it? Stupid fool. Should've talked when the knights gave you the chance. Why pretend to be tough when you're just afraid?\"\n\n\"**Oof! Ooof!**\"\n\n*It's not fair.* Fury and frustration warred in my chest. These soldiers, talking over me, misunderstanding everything.\n\n\"Ouch!\"\n\nThey shoved me forward. The cell was small, dark, reeking of human waste and despair. I stumbled, and they pushed me inside.\n\nThe gag stayed on.\n\nThe soldiers talked among themselves as if I wasn't there.\n\n\"Hey, should we release the gag?\"\n\n\"Leo said only at meals. Apparently this guy has quite a mouth. Leo will be tempted to kill him if we let him talk freely.\"\n\n\"Ah, I see.\"\n\n*What?!*\n\n\"**Oof! Ooof!**\"\n\n*Release the gag! Hey!*\n\nThe soldiers looked at me with something like pity.\n\n\"Wow, he's so desperate to talk that saliva is dripping everywhere.\"\n\n\"If we keep him gagged all day, his blood pressure might explode.\"\n\n\"This really is a punishment for him.\"\n\n\"**Ooof! Ooooof!**\"\n\n*Then release the damn rope!* The bindings cut into my wrists. My fingers tingled, going numb.\n\n**Kwang!**\n\nThe iron door slammed shut. Their footsteps echoed away into nothing.\n\n*They're really leaving.*\n\nBound. Gagged. Trapped in this reeking hole. And the clock was ticking. The Huroi rescue quest would fail if I just stood here.\n\n*My level...*\n\nThe 'Coward' title. I'd be branded a coward because I couldn't rescue Huroi from an impossible situation?\n\n\"**Ooof! Ooooof!**\"\n\nI shouted into the darkness. *Someone. Anyone. Help me.*\n\nSilence answered.\n\nMy muffled cries echoed in the deep, dismal basement, swallowed by stone.\n\n***\n\nTime crawled.\n\nThe quest timer at the top of my vision read **four hours remaining**. Three hours. Three hours rotting in this cell.\n\n*Shit. This rotten luck.*\n\nGood fortune and bad had followed me in equal measure recently. All that luck had been a precursor, building to this moment of absolute misfortune.\n\n*I forgot how unlucky I am. Wasn't vigilant enough.*\n\nIn 26 years of life, I'd never found a single 10 won coin on the sidewalk. Not **once**. Then somehow, I'd stumbled into a legendary class.\n\n*I want to punch Lady Luck in the face.*\n\nJust as the thought formed窶能n\n\"Grid! Grid!\"\n\nA woman's voice drifted down from above.\n\n*That voice.*\n\nFamiliar. Where had I heard it recently?\n\n*Ah.*\n\nErina. Her voice was as pretty as her face. *This damn unfair world.* Why was one person born with so many advantages? \n\n*No.* Now wasn't the time to lament cosmic injustice.\n\n*Why is she here?*\n\nThe question barely mattered. A surprising person had arrived, but she was my **only hope**. I had to accept her help.\n\n\"**Ooof! Ooooof! Oof! Oof!**\"\n\n*Here! I'm here!*\n\nThe gag muffled everything. My throat was raw.\n\nErina's voice echoed from the floor above. \"Grid! Where are you? Where is this man?\"\n\n\"**Ooooof!**\"\n\nThe sound came out hoarse, broken. She couldn't find me. The timer showed **two hours** remaining. In two hours, I had to escape **and** rescue Huroi.\n\n*What can I do?*\n\n*Fuck, I don't know!*\n\nI had to do **something**.\n\n\"**Ooof! Oof!**\"\n\n\"Grid!\"\n\n*Ah, finally...*\n\nErina appeared at the top of the stairs, her footsteps quick. She followed the sound of my voice, running down into the gloom. That unlucky girl looked like an angel descending. My appreciation for her skyrocketed.\n\nShe reached the bars, confirming the situation with wide eyes.\n\n\"I'll save you.\" She held up something wrapped in cloth. \"And I'll give you this dagger.\"\n\n\"**Oof! Ooof!**\"\n\nErina unwrapped a sheath made of minotaur horn. Inside gleamed the dagger I'd made during our competition.\n\nThe blade I'd thought lost forever."
}