{
  "id": 431,
  "title": "Chapter 431",
  "content": "# Chapter 431\n\nSwan possessed two unique skills: **Adaptation** and **Escape**.\n\n**Adaptation** increased his recovery speed from abnormal conditions, reduced terrain penalties, and lowered item usage requirements. **Escape** ensured he would never be caught by enemies or die in combat.\n\nGrid had seen the opportunity the moment he handed Swan the Great Lord's Sword. Lauel would predict his every move and prepare countermeasures. So Grid gave Swan the role he'd originally planned for himself: become the decoy. Make the enemy believe Swan was Grid. Force them to dance to Lauel's tune.\n\nThe gambit had worked. Swan wore Grid's Greatsword and Triple Layers. Skull's team took the bait. The US bought the deception completely and dropped their guard.\n\nGrid had waited, hidden, until the Motley Flail's random buff triggered. Then he'd struck.\n\nThey lost anyway.\n\n***\n\nThe NPCs gathered around Grid after the resurrection.\n\nSwan approached, head bowed. \"I'm sorry. I failed as bait.\"\n\nGrid studied Swan, then Lucky. His fingers twitched.\n\n*I want to take them to Reidan.*\n\nThird advancement NPCs. Nearly twice the level of his current soldiers. Many could fight Grid on even ground without buffs. Lucky possessed the Good Luck stat. Swan's skills would be invaluable for raids.\n\nBut they existed only for the National Competition. Temporary allies, nothing more.\n\nGrid shook his head. \"You did nothing wrong. I'm sorry I wasn't strong enough to carry us.\"\n\nSwan's eyes widened. Nobles never apologized. They shifted blame, protected their reputations, guarded their pride.\n\nBut Grid wasn't like other nobles.\n\nGrid clapped Swan's shoulder. \"We'll do better next time.\"\n\nSwan's chest swelled with something warm. *Respect.* \n\nGrid extended his hand.\n\n*He wants to shake hands?* Swan stared at the offered palm. *A noble... acknowledging someone like me...*\n\nSwan grasped Grid's hand.\n\n\"What are you doing?\"\n\n\"Huh?\"\n\nGrid's eyes narrowed. \"Are you planning to keep my items?\"\n\n\"Ah.\" Swan felt the killing intent radiating from Grid's grip. He scrambled to remove the borrowed equipment.\n\nGrid handed back Swan's gear.\n\nThey stood in silence, exchanging armor and weapons. Both wore identical expressions of regret.\n\n*Someday,* Swan thought. *We'll meet again.*\n\nNearby, Lucky stared at Grid with an unsettling intensity.\n\n*That feeling...* Lucky's fingers flexed around his flail. *When it hit his muscles. That perfect resistance.*\n\nGrid had awakened something in him. A new obsession.\n\nLucky's future promised to be... difficult.\n\n***\n\nEvery nation watching the South Korea versus United States match gained critical intelligence:\n\nFirst, NPCs possessed hidden abilities.\n\nSecond, NPCs could equip player-crafted items.\n\nThird, the eight paths were a trap. The center route was shortest and widest.\n\nWhy split forces when you could concentrate power on the most efficient path?\n\nThe revelation turned every subsequent siege into a brutal slugfest. Both teams charged down the center. Whoever won that clash won the match.\n\nStrategy still mattered. Item distribution. NPC loadouts. Tactical positioning. The competition remained fierce.\n\nBut the South Korea versus US match held the highest viewership.\n\nGrid had shattered his reputation as an \"ignorant overgeared\" fighter. He'd planned. Prepared. Lauel's genius had countered it all. Then Grid's raw destructive power had nearly pulled victory from defeat.\n\nMore compelling than any other match.\n\nGrid and Lauel's fame skyrocketed. The Overgeared Guild's recognition surged.\n\n***\n\nDay three of the National Competition.\n\nRound of 32. Round of 16. Quarterfinals.\n\nFour finalists remained:\n\nJapan, nicknamed the \"Strongest Army\" thanks to Damian's overwhelming divine support.\n\nRussia, carried by Kraugel's solo breakthrough to the enemy castle.\n\nThe United States, reigning champions.\n\nAnd Argentina.\n\nArgentina.\n\nNo one had predicted Argentina. Not even Argentinians. They were weak in Satisfy. They hadn't qualified for the first National Competition. Their prospects mirrored South Korea's: grim.\n\nYet they'd clawed into the top four.\n\nOne man made the difference.\n\nSeuron.\n\n***\n\nGrid sat in the reserved seating with the South Korean representatives. Yura and Peak Sword leaned forward, eyes locked on the arena floor.\n\nEvery player from every nation watched Seuron.\n\nHis presence commanded it. His strength rivaled Kraugel, Damian, Grid.\n\nPeak Sword whistled low. *This is what a pure combat class looks like.*\n\nSeuron's **Soul Predator** abilities exploited every corpse on the battlefield, enemy and ally alike, converting death into overwhelming power. Physical attack. Magic attack. Defense. Resistance. AOE. Crowd control.\n\nNo weaknesses.\n\n*Even God Grid might struggle against him.* The thought came unbidden, almost heretical to Peak Sword's Grid worship.\n\nBut Grid wasn't watching Seuron.\n\nHe studied Kraugel.\n\n*How does he even think to move like that?*\n\nKraugel dodged concentrated fire from dozens of NPCs while simultaneously carving through their formation. His path made no sense. Grid couldn't imagine it, much less replicate it.\n\n*Imagination.*\n\nThat had to be part of Kraugel's strength. He moved in ways others couldn't predict because he conceived of possibilities they never considered.\n\nBut didn't imagination require intelligence?\n\n*He's good at fighting AND smart?*\n\nGrid remembered hearing that smart people excelled at sports.\n\n\"This is very annoying.\" He slumped in his seat.\n\nA higher barrier than most people ever faced. The old Grid would have raged. Despaired at his own limitations.\n\n*But I'm not useless.*\n\nGrid had learned that much. Complaining about talent was worthless. Overcoming it brought results.\n\nHe focused harder on Kraugel's movements. Searching for weaknesses. Strategies. Ways to win.\n\nHis phone buzzed.\n\n*Sehee?*\n\nGrid checked the screen. Not family.\n\nComet Group.\n\nThe domestic company that had offered sponsorship before.\n\n> **From: Head of Public Relations Team, Yook Shihyun**\n> \n> Mr. Shin Youngwoo,\n> \n> We've been watching your National Competition performance with great interest. As a Korean citizen, I feel proud and grateful. If you're willing, can we revisit the contract we previously discussed? We'll do our best to meet your expectations. Please consider this positively.\n\nThree hundred million won. Significant money just for wearing their logo on his chest.\n\nBut Grid's value exceeded that sum.\n\nThis wasn't baseless pride. Zibal had secured 3.6 billion from Radidas, a world-class brand.\n\n*I should get at least one billion.*\n\n\"Why aren't you replying?\" Yura glanced at Grid's phone.\n\nGrid turned. Pink colored Yura's pale cheeks. She looked away, suddenly self-conscious under his stare.\n\nGrid didn't notice.\n\n\"I don't want to meet them. They don't understand my value.\"\n\nNot grudge. Simple economics. He was Overgeared's Guild Master. If he sold himself cheap, he devalued the entire guild.\n\nYura's expression turned serious. \"Youngwoo, you have about six billion in liquid assets, right?\"\n\n\"No. Around five billion.\"\n\nAdd the building completing next month, and his total assets reached fifteen billion. Massive for someone drowning in debt two years ago. He could eat without worrying about money. The thought still filled him with quiet wonder.\n\nYura's voice gentled. \"Youngwoo, five billion isn't as much as you think. High-end materials like adamantium or dragon scales cost billions. You'll need them eventually.\"\n\nPeak Sword nodded. \"New millionaires are born every day. Hundreds of rich kids in South Korea collect cars worth more than five billion. As average user levels rise, item values will skyrocket. You need capital to keep pace.\"\n\nThe message landed.\n\nIf he wanted to be a king, he couldn't afford complacency. He couldn't reject opportunities rolling to his doorstep.\n\n*They're right.*\n\nGrid typed his reply.\n\n**-4 billion.**"
}