{
  "id": 432,
  "title": "Chapter 432",
  "content": "# Chapter 432\n\nThe Super Bowl averaged just 100 million viewers, yet its advertising fees dwarfed those of the Olympics or World Cup. The reason? Concentration.\n\nUnlike the Olympics and World Cup, which served as global festivals, the Super Bowl catered exclusively to the US market. Companies could identify and target their audience with surgical precision. A single advertisement reached 100 million potential customers who shared similar cultural touchstones and purchasing habits. By 2030, it was standard for ad rates to exceed 250 million won per second.\n\nThe Olympics and World Cup, by contrast, attracted far more viewers but suffered from diluted impact. Companies had to produce multiple advertisements tailored to each country's interests, and the effectiveness remained limited. Viewers cared about different events, different athletes, different nations. The advertising value per viewer plummeted.\n\nWhen the first Satisfy National Competition launched, corporations assumed it would mirror the Olympics. High viewership, poor concentration, minimal return on investment. They held back on major advertising campaigns, choosing instead to sponsor individual participants much like Olympic athletes. The whole concept seemed absurd. Gamers as 'players'? Worth serious investment?\n\nThe results shattered expectations.\n\nThe Satisfy National Competition captured global attention despite featuring relatively few countries. Its advertising effectiveness surpassed even the Super Bowl. The individual players, in particular, generated massive influence.\n\nSports and games occupied fundamentally different psychological spaces. Watching athletes, viewers thought: *That's impressive.* Watching gamers, they thought: *I could do that.* The shift from admiration to aspiration created unprecedented immersion. Gamers' market value skyrocketed. For a top-tier player, companies wouldn't hesitate to invest billions of won.\n\nYet the 224 participants in the 2nd National Competition averaged just 500 million won in sponsorships. The market remained immature, poorly structured. Most Satisfy players had no grasp of their true worth. They were people who'd spent their lives gaming from home. Economic principles? Marketing leverage? Foreign concepts.\n\nThe corporations understood perfectly. They extracted maximum value while paying minimum compensation. Eventually, players would hire professional managers. Sponsorship rates would explode. Until that day arrived, companies intended to milk every drop of profit they could get away with.\n\nBut the window was closing. Players were waking up to their value. Grid's proposed fee of 4 billion won proved it.\n\n\"He came out surprisingly strong,\" Yoo Shihyun said, reviewing Grid's reply on her tablet.\n\nShe leaned back in her office chair. *This is because of Radidas.*\n\nRadidas sponsoring Zibal for 3.6 billion won had been the catalyst. Other players looked at that deal and started questioning their own contracts. By demanding 4 billion, Grid was declaring himself more valuable than Zibal.\n\n\"Well, it's appropriate.\"\n\nMore than appropriate. It was accurate. Sponsor Grid for 4 billion won, and the Comet Group would reap tens of billions in promotional value. Maybe hundreds of billions. Grid's global popularity climbed daily. He probably didn't even realize his true market worth.\n\nYoo Shihyun picked up her phone and dialed the president's direct line.\n\nTwenty minutes later, she'd secured approval for the perfect counteroffer: 10 billion won for a two-year contract. Grid's value would obviously surge before the 3rd National Competition. Locking him down now, while his price remained relatively cheap, was a tremendous opportunity. He'd accept. Who could refuse more than double their asking price?\n\n> **-Can I meet you now? I'm in Paris.**\n\nEven now, his value was climbing. Other companies would be circling. Yoo Shihyun typed out an urgent reply.\n\nGrid's answer came back: *Okay.*\n\n\"Perfect.\" \n\nYoo Shihyun stood and moved to the mirror mounted near her hotel room door. She adjusted her makeup, fixed her hair, smoothed her blouse. The first rule of sales was creating a positive emotional response.\n\n***\n\n\"Time to make money.\" Grid rose from his seat.\n\nThe semi-finals were just beginning.\n\nUnited States vs Japan.\nRussia vs Argentina.\n\nPeak Sword looked up from where he'd been analyzing team compositions. \"Aren't these matches important to watch?\"\n\n\"I can watch on TV.\"\n\nSitting in the audience meant staring at monitors anyway. He'd get the same experience from the massive 120-inch 3D screen in his hotel room.\n\nYura stood. \"I'll come with you.\"\n\nA business negotiation. She couldn't let Grid go alone.\n\n\"I can handle it.\" Grid grabbed his jacket.\n\nYura had managed his finances up to now. He'd learned by watching her. Time to put that education to use.\n\n\"If I keep depending on you, I'll never learn to stand on my own.\" He paused at the door, not quite meeting her eyes. \"Besides, you can't be with me forever, right?\"\n\n*We could be together forever.* The words caught in Yura's throat. By the time she opened her mouth, Grid had already left.\n\n***\n\nThe area surrounding the Eiffel Tower was typically a tourist nightmare, packed shoulder to shoulder with sightseers and hawkers. But with the National Competition in full swing, the streets stood nearly empty. The tournament's overwhelming popularity had drained the city. Only a handful of roadside cafés retained any customers.\n\nGrid spotted his contact immediately. Just one Asian woman sitting alone at the designated meeting spot.\n\n\"Team Leader Yoo Shihyun?\"\n\nThe woman looked up and smiled. \"Hello, Youngwoo. It's an honor to meet such a global star in person.\"\n\nShe extended a business card. Grid examined it before taking the seat across from her. Yoo Shihyun kept her expression pleasant, but inward surprise rippled through her. *A man completely unfazed by my appearance. How rare.*\n\nShe'd expected... well, if the rumors about him dating both Yura and Jishuka were true, shouldn't he show *some* reaction?\n\nYoo Shihyun launched into her prepared pitch. She outlined the Comet Group's market position, the benefits of their brand association, the doors their sponsorship would open.\n\nGrid cut her off mid-sentence. \"The conclusion.\"\n\nWould they meet his 4 billion won price? Yoo Shihyun's smile widened.\n\n\"I'm prepared to offer you 10 billion won for a two-year contract.\"\n\nGrid's face remained perfectly still. Not a flicker in his eyes, not a twitch at his mouth. Nothing like the reaction she'd anticipated.\n\n*He's completely calm after hearing 10 billion won?* Yoo Shihyun reconsidered her assessment. In-game, Grid played like a beast. Violent, aggressive, crushing enemies without mercy. But clearly, the real man possessed far more intelligence. She felt her professional interest shifting into something more possessive. *He has incredible potential.*\n\nMeanwhile, beneath his blank expression, Grid's mind raced. *10 billion?*\n\nTwo-year contract aside, it was far more than he'd dared request. Ten billion won. Some trust-fund brats might call that pocket change, might sneer that it was \"way less than Mom and Dad spent on my birthday mansion,\" but for Grid? It was staggering.\n\nEquivalent to four or five legendary items. He'd only managed to create thirteen legendary pieces since becoming Pagma's Descendant.\n\n*Isn't this basically free money?*\n\nGrid almost smiled. Then a thought intruded, courtesy of the year he'd spent absorbing Lauel's teachings. His strategic thinking had sharpened considerably.\n\n*Wait. My value is higher than I realized.*\n\nNothing came free in business. Corporations especially. She'd turned his 4 billion request into 10 billion without blinking. A two-year contract. *That means my value will probably exceed 10 billion by next year.*\n\nHe'd been burned before, chasing easy money. Grid took his time, thinking it through, before speaking.\n\n\"I'm confused.\"\n\nOf course he was confused. No company had ever valued him this highly. Yoo Shihyun's satisfaction showed on her face.\n\nGrid continued, \"I was hoping for 4 billion won per event. You're offering 10 billion for a two-year contract.\" He tilted his head. \"Is the Comet Group trying to scam me?\"\n\n\"What?\"\n\nThe question caught her completely off guard. But comprehension followed quickly. *You're the one trying to scam me.*\n\nThough strictly speaking, Grid had a point. The Comet Group *was* the one trying to scam him. Awkward silence stretched between them.\n\n*Ttiring~*\n\nGrid's phone chimed. Then again.\n\n*Ttiring.*\n\n*Ttiring.*\n\n*Ttiring.*\n\nThe notifications kept coming. Yoo Shihyun's unease showed as Grid checked the messages, then stood.\n\n\"One company that initially offered 3.5 billion won per event just agreed to my asking price of 4 billion.\"\n\nA complete lie. But Grid judged it realistic enough to be believable. Yoo Shihyun's voice turned desperate.\n\n\"4.1 billion. We'll give you 4.1 billion per event.\"\n\n\"Hah.\" Grid laughed quietly, finally understanding what it felt like to hold leverage.\n\n*So this is why top athletes earn over 100 billion won annually.*\n\nWas his worth less than theirs? Absolutely not. Virtual reality gaming had eclipsed traditional sports in popularity. Grid sat back down and signaled the waiter.\n\n\"4.2 billion.\" He ordered an espresso, then met Yoo Shihyun's eyes. \"You have until I finish this coffee to decide.\"\n\nYoo Shihyun stared at the tiny cup the waiter set down. An espresso. The serving size was barely two mouthfuls.\n\nShe grabbed her phone and speed-dialed the president."
}