{
  "id": 433,
  "title": "Chapter 433",
  "content": "# Chapter 433\n\nAmong the seven great guilds, the Golden Guild occupied the middle tier. Seuron commanded it. After acquiring the Soul Predator class, his strength had surged month by month. Now he stood within striking distance of the peak.\n\n\"Kukukuk!\"\n\nArgentina met Russia in the semi-finals. Seuron's pulse quickened at the matchup.\n\n\"Kraugel.\" He rolled the name across his tongue. \"I'm lucky. A chance to crush you in front of the world.\"\n\nArgentina had sat out the target processing match. No competent ranged dealers on the roster meant no shot at a medal. Seuron hadn't obsessed over it. He'd enjoyed himself. But this? This was different.\n\nOn a battlefield where a hundred bodies fought and died, souls would flood the air. Fresh fuel for his class. Seuron grinned. *In a duel, not yet. But here? On this field? I'll bury him.*\n\n\"Become the stepping stone for my legend!\"\n\nHe reached inside himself and pulled. Souls accumulated in his core compressed into beads. Soybean-sized spheres of jade light.\n\n*Suuuuok.*\n\nDozens of glittering orbs orbited his body. The effect rivaled Grid's Iyarugt for sheer beauty.\n\n\"Bang!\"\n\nSeuron thrust his finger forward like a child playing war. The beads whirled. They shot off in a hail of light. Target: Kraugel. The Russian representatives and NPCs clustering near their star went ignored. *Trivial. All of them.*\n\n*Tutututututung!*\n\nThe soul beads screamed forward at speeds no second advancement class could track. Machine gun fire made manifest. Then the impossible happened.\n\nKraugel dodged every single one.\n\nA zigzag sprint. Keen Senses, inhuman agility, and pure instinct fused into a miracle of movement. White Fang flashed.\n\n*Chaaeng!*\n\nSeuron raised his <span class=\"rarity-unique\">Brutal Heavy Sword</span>. The impact jarred his arms. *His stats. Level 400, at minimum. Maybe higher.*\n\nQuests. Titles. Possibly elixirs. The gap was ridiculous. Kraugel existed beyond common sense.\n\n*Peeok!*\n\nSeuron stumbled back. Kraugel flowed forward, pulling his sword free for a second strike. The critical hit came.\n\n*Pahat!*\n\nThe soul beads that had stopped mid-air reversed course. They swarmed Kraugel from behind, spreading like a spider's web. Kraugel's reaction lagged a fraction of a second. Too efficient a skill. He hadn't expected it.\n\nOne arm caught.\n\n> [Your right arm is temporarily restrained.]\n\n\"...\"\n\nKraugel's expressionless face twitched. Seuron's blade came in fast. Kraugel shifted White Fang to his left hand with inhuman speed.\n\nSeuron laughed. He dodged the counterattack and pressed his advantage.\n\n\"Kukuk, I will bind your soul!\"\n\nThe activation rang through his mind like a bell. The soul web latched onto Kraugel's body. It burrowed deeper. Found his soul. Seized temporary control.\n\n> [Your body is out of control for seven seconds!]\n\nKraugel's experience of reality fractured. He willed his left arm to move. His right foot responded. He tried his left foot. His right arm swung. His greatest weapon, his godly control, had been severed.\n\n*Seokeok!*\n\nSeuron summoned fourteen soul spears. He roared with everything in his chest.\n\n\"Taste this unbreakable power!\"\n\nNo lie. Since acquiring Soul Predator, he'd never lost. Only once. The Reidan raid. That temporary farmer. But that was a named NPC. Didn't count. \n\n*This is it. Victory.*\n\n\"You have certainly grown.\"\n\nKraugel's voice cut through the chaos. Even during their meeting at Reidan, he'd acknowledged Seuron. Now he dodged every soul spear raining toward him. His movements were fluid. Precise.\n\n*How?*\n\nSeuron's blood froze. The soul-controlled Kraugel moved exactly as before. No degradation. No confusion.\n\n*He adapted? Already?*\n\nWhite Fang punched through Seuron's neck. Seuron activated Soul Armor. The defense stacked. He killed nearby allies. Harvested their souls. Counterattacked.\n\nThe battle blazed. Two masters trading blows. Praise flooded in from across the world.\n\n***\n\n\"I'm going to lose my mind.\"\n\n*Brr!*\n\nGrid's body shook. He stumbled down the sidewalk, leaving the cafe behind. The jerkiness resembled a tap dance. The espresso's aftershock. His skull throbbed.\n\n\"Dammit...\"\n\nBitterness was his enemy. When colds hit, he choked down syrupy children's medicine. Coffee? Rotten water. Americans chugged it like it came from a bottle. Disgusting. He always ordered juice. Hot chocolate. Safe choices.\n\nSo why the espresso? Why drink poison? Because it worked. The contract. Perfect terms. All because he'd ordered that tiny cup. To make Yook Shihyun sweat.\n\n*Bluffing. Strategic planning. Can't just charge ahead anymore. Gotta think.*\n\nHis phone buzzed.\n\n> Please read the contract carefully. Read it several times until you completely understand it. Don't forget to record it.\n\n> God Grid! Isn't it amazing for a Korean to contract with a Korean company?\n\n> ♣ Go! ◆If you join ◆ ♣ ※You will get ☜☜a 1 million♨★cash bonus★\n\n> Team Leader Kim Minyoung.^^\n\nHe'd timed the messages perfectly. Asked Yura and Peak Sword to text him during the meeting. The spam? Pure chance. He'd skipped the spam blocker service. Two thousand won a month felt steep.\n\n*See? This is why you don't waste money.*\n\nNew enlightenment bloomed. From now on, regular jajangmyeon only. No more kanjajang.\n\n『 Oh my god...! The United States' castle was captured! 』\n\n『 Against everyone's expectations, Russia has won! 』\n\nThe noise erupted from a storefront TV. Grid stopped. Turned. Stared at the screen.\n\n*Russia won?*\n\nAgainst the United States. Grid's fists clenched. Heat flooded his chest. Kraugel had overcome them.\n\n*Kraugel...*\n\nWas he superior in every way? Grid couldn't accept it. He wouldn't diminish Kraugel. The man's talent and achievements spoke for themselves. But Lauel had beaten Grid. Lauel was normal class.\n\nCruel reality. Grid felt small. The self-esteem he'd clawed back together crumbled. Dust in his mouth.\n\n***\n\nDay three of the National Competition closed. The rankings refreshed.\n\n**1st. South Korea (2 gold)**\n\n**2nd. Russia (1 gold, 2 silver)**\n\n**3rd. United States (1 gold, 1 silver, 2 bronze)**\n\n**4th. Brazil (1 gold)**\n\n**Joint 5th. United Kingdom and France (1 silver)**\n\n**6th. Canada (2 bronze)**\n\n**7th. Japan (1 bronze)**\n\nThe standings defied expectations. The United States, Satisfy's dominant power, sat at third. Korea and Brazil shined. But the shock faded quickly. Sixteen events remained. Time would correct the anomaly. Strength would rise to the top.\n\nBy day fourteen, the predictions had stabilized.\n\n**1st. Russia (4 gold, 3 silver, 2 bronze)**\n\n**2nd. United States (4 gold, 2 silver, 4 bronze)**\n\n**3rd. Canada (3 gold, 3 silver, 3 bronze)**\n\n**4th. South Korea (2 gold)**\n\n**5th. Spain (1 gold, 2 silver)**\n\n**6th. Japan (1 gold, 2 bronze)**\n\n**7th. Brazil (1 gold)**\n\n**Joint 8th. United Kingdom, France (3 silver)**\n\n**Joint 9th. Argentina, China (2 bronze)**\n\n**10th. Turkey (1 bronze)**\n\nSouth Korea and Brazil had gone cold since day three. Not a single medal. The traditional powers climbed steadily. The gap between strong and weak had crystallized. Five events remained.\n\nThe question hung in the air: United States, Russia, or Canada?\n\nNo easy answer. The United States fielded top-class players across the board. Russia was slightly weaker overall, but they had Kraugel. The crown. The peak.\n\nCanada's Chris and Vantner had found their rhythm. Their synergy was monstrous. Any of the three could claim victory.\n\n『 We're forgetting something. Isn't there another country that could challenge? 』\n\nAnother candidate? Viewers around the world puzzled over the expert's words. Then the realization struck.\n\nGrid. The main culprit behind destroyed expectations hadn't competed in a single solo event yet.\n\n> Perhaps South Korea is another candidate to win?\n\n> At any rate, winning gold medals is the best thing to do in the National Competition. If Grid wins the gold medal in the raid event and his three solo events, Korea will win. ㅋㅋㅋㅋㅋ\n\n> Wow, that's right. If Grid wins four gold medals and Russia and the US don't win any, Korea will win.\n\n> But that's impossible. ㅡ_ㅡ;\n\nThe world knew Grid's power. Top-class. Undeniable. But the problem was simple. Many others occupied that tier. Kraugel of Russia. Chris of Canada. Damian of Japan. Seuron of Argentina. Pon of Spain. Regas of Britain. Zibal of the United States. All of them were monsters.\n\nCould Grid win four gold medals alone against specialists in each event? Impossible.\n\n『 What if... What if Grid really wins four gold medals and leads South Korea to victory? 』\n\n『 He will be a myth. 』\n\n『 But it's impossible. The peak of two billion users, Kraugel, is standing in his way. 』\n\n『 It's questionable if he can cross the mountain called Kraugel. In addition, Zibal might seem weak, but isn't he optimized for raids? There's less than a 10% chance that South Korea will defeat the US in the raid event. 』\n\nThe words piled up. The atmosphere shifted. South Korean viewers who'd been anticipating Grid's appearance felt the weight settle on their shoulders. Silence replaced excitement."
}