{
  "id": 434,
  "title": "Chapter 434",
  "content": "**\"I'm full.\"**\n\nThe words belonged to his mother. His mother, who raised him alone in a cold and foreign land. She went hungry every day, the skin of her belly pulled taut over bone. Yet she never missed one of her son's meals. Three times a day, without fail. She endured suffering Kraugel couldn't begin to fathom.\n\nAll he wanted was to repay her grace.\n\nBut the heavens refused him. They seemed determined to mock her, as if she'd been born for misery alone.\n\n***\n\nAfter the fourteenth day of the National Competition, the organizers granted the players two days of rest.\n\nA maintenance period. The competitors scattered to prepare for the final five events. Some hunted for new items or levels. Others cleared high-reward quests. A few focused on control drills through sparring.\n\nKraugel chose a different path. He entered a high-level dungeon alone and carved through monsters, gaining experience while the doctor's words looped through his mind.\n\n*Your mother's symptoms are worsening. If she doesn't receive the new medicine...*\n\nHe'd hospitalized his mother before the Competition and maintained constant contact with her physician. Every update brought worse news. Physical complications were stacking. She might have only a few years left.\n\n*...*\n\nThe only new drug capable of treating Alzheimer's. Kraugel needed to lead Russia to victory to obtain it. For that, he'd discarded his pride and conscience, agreeing to a dirty deal. During the Siege event, when Lauel offered him a spot in Overgeared in exchange for \"conceding\" the match, Kraugel couldn't refuse.\n\nBut the current trajectory wasn't ideal. With five events remaining, Russia's chances looked grim. They could only realistically aim for gold in PvP, while the US was positioned to sweep both the boss raid and blacksmithing events.\n\nUnless something unexpected happened, America would claim the championship.\n\n*There's hope if another country wins the boss raid or blacksmith event, but...*\n\nZibal's prowess in boss raids was unmatched, while Panmir stood as the best blacksmith after Grid. And Grid himself had declared he wouldn't participate in the smithing competition. The US gold medals in those two events were all but guaranteed.\n\nHad Heaven forsaken his mother?\n\nKraugel's despair deepened.\n\n***\n\nThe Overgeared members understood Grid's raid capability. Peak Sword had witnessed Grid soloing Hell Gao. After that came Vampire Earl Elfin Stone, Vampire Viscount Tiramet... Grid had felled countless named bosses.\n\nBut Zibal exceeded even that. Rumors put his named boss kill count approaching twenty. As Debirion's Envoy, he possessed a passive skill dealing bonus damage to monsters, along with a suite of powerful actives. Zibal was a true raid specialist.\n\n\"God Grid! Let's aim for silver!\" Peak Sword shouted.\n\nGrid was reviewing footage of Zibal's previous raids. Peak Sword read tension in his posture and tried to lift his spirits. Having failed to medal himself, 'Incompetent Peak Sword' could only offer moral support.\n\n*Ttiring~*\n\nAs they analyzed Zibal's techniques against various boss monsters, the phones of Grid and the Korean representatives rang simultaneously. A message from the Competition organizers.\n\n> [The information on the raid monster has been released. For more details, please check TV or Internet.]\n\nGrid read the message and terminated the video feed, switching the channel to Satisfy's news station. A middle-aged anchor was delivering breaking news.\n\n『The information about the boss monsters to be raided by thirty-two countries has been released. Let's take a look.』\n\nBreaking news demanded speed. The anchor rushed through his delivery to retain viewers, and the monster's information flashed across the screen.\n\n> **[Drake]**  \n> **Level: 420**  \n> \n> A flying monster with a small amount of dragon's blood.  \n> Their intelligence is greatly reduced compared to wyverns, but their combat power and breath attacks are overwhelmingly superior!  \n> They possess high status resistance, extreme physical defense, magic resistance, relatively high stamina, and can stay airborne infinitely.  \n> \n> **Drop items:** Drake's heart, drake leather, drake's fang, drake's bone.\n\n『Drakes are a high-tier monster that's never been successfully raided. This means no established strategy exists.』\n\n『So all teams start on equal footing?』\n\n『Correct. The organizers seem to have considered fairness.』\n\n『However, the players must be feeling desperate. To hunt a flying monster requires ranged damage dealers and magicians. But how many ranged DDs or mages can even damage a drake?』\n\n『Suppressing its flight is key to the raid. But how do you ground something with status resistance...?』\n\n『As a level four-hundred monster, you'd need third advancement characters to deal meaningful damage. I wonder how many countries can even succeed.』\n\n\"How do we kill that?\" someone muttered.\n\n\"Won't even the US struggle?\" another asked.\n\nThe South Korean representatives sagged in their seats. Yura and Peak Sword's expressions turned grim. Only seven people would face a flying boss, and South Korea only had Grid and Peak Sword above level 300. Everyone judged the raid impossible.\n\nGrid rose from his seat. \"I'll be in the capsule room for the next two days.\"\n\n\"Yeah, let's hunt.\" Peak Sword stood as well. \"I should gain at least one more level.\"\n\nDevising a strategy against this boss seemed pointless. The South Korean team was exhausted. They judged it better to give up early and prepare for other events. The sentiment was shared by representatives in other spaces.\n\nOnly the United States, Russia, Canada, and France seriously strategized against the drake.\n\n***\n\nThe National Competition's seventeenth day arrived.\n\nThe final team event—the boss raid. Global interest was overwhelming.\n\nA drake. People were excited for the chance to indirectly experience the power of boss monsters that were nearly impossible to encounter. The players' motivation had reversed from their initial despair. The organizers had announced that teams would keep any items the drakes dropped.\n\nIt was a desperate measure to prevent unmotivated performances from ruining the event. The result was remarkable. Representatives who'd grumbled \"How can we catch a drake?\" and planned to drop out early suddenly became engaged. They needed to succeed in the raid to claim the drake's materials.\n\nThe Korean team was no exception. The materials dropped by drakes were incomparable to anything currently available in Satisfy. Even split seven ways, the profit was enormous.\n\nPeak Sword shouted with tension, \"God Grid! Let's do our best! Even if we can't win a medal, we must fight to the end and make sure the drake dies!\"\n\nGrid remained calm. His composure made Yura uneasy.\n\n*Why?*\n\nThe Comet Group had promised Grid substantial money and elevated his value as a Satisfy gamer. Despite his pride and satisfaction, something had seemed off since he'd signed the contract. Did he have worries she didn't know about?\n\nRegardless of Yura's concern, the schedule proceeded.\n\n『All participants, proceed to the capsule room!』\n\nThe 244 participants from thirty-two countries moved to their assigned capsules and logged into Satisfy. The countries materialized in different maps, but identical drakes appeared before all of them.\n\n**Kurarararara!**\n\n> [The dragon's blood instills fear in all lesser beings!]\n> \n> [You will be in a rigid state for 10 seconds.]\n> \n> [All buffs are deactivated. Defense and resistance reduced by 50%. You will retreat from the enemy.]\n> \n> [You have temporarily lost your hearing from the drake's roar!]\n> \n> [All types of communication will be blocked for 1 minute and 30 seconds!]\n> \n> [Your body has been suppressed by the gust from the drake's wings!]\n> \n> [As long as the drake continues to flap its wings, all speeds will drop by 30%!]\n\nThe debuff duration varied depending on each player's level and resistance. Regardless, every team suffered. Players who'd pre-cast buff skills lost them before gaining any benefit.\n\n*The command system collapsed!*\n\nEven the United States was overwhelmed. The drake's roar blocked all forms of communication. No matter what anyone said, their teammates couldn't hear them. An unknown enemy.\n\nZibal grasped the situation quickly thanks to his extensive raid experience, but it was useless when he couldn't relay instructions to his team.\n\n\"Kuak!\"\n\n\"Ugh...!\"\n\nThe drake—over five meters in length—moved with speed that belied its massive size. It began devastating the US team. The world watched in shock.\n\n『The strongest US team is being trampled so easily...! Powerful! The drake is truly powerful!』\n\n『The thirty-percent slowness effect is brutal. Even Kraugel was hit. First priority should be stopping those wings...』\n\n『Ah! As you say that, Bondre of France used ice magic and froze one of the drake's wings!』\n\n『...It shattered instantly. The magic resistance is absurdly high.』\n\nThe atmosphere grew tense.\n\n\"Eh? Comet's new capsule is way better than other capsules! I can move so smoothly! Hey! This is amazing!\"\n\nThe Korean Grid started speaking loudly. Attention from commentators and viewers snapped to him. On the upper chest of Grid's <span class=\"rarity-legendary\">Triple Layers</span>, the Comet Group logo gleamed prominently. Yura flushed as she looked at Grid.\n\n*So that's it.*\n\nGrid had been uncomfortable these past few days because he was embarrassed about delivering this product placement.\n\n\"...\"\n\nYura watched Grid while viewers resented his blatant PPL for breaking their immersion. Grid was being condemned as a monster created by the age of materialism. Fortunately, the viewers' voices didn't reach him.\n\nGrid remained unshaken, concentrating on the raid. He pulled out a pole three meters long with an eighty-centimeter diameter, driving it deep into the ground. Then he hurled the trident attached to the pole by rope toward the drake. The **Spear Shot** skill he'd obtained from the Behen Archipelago.\n\n**Puok!**\n\nThe trident pierced the drake's hide. It tried to escape into the sky, but the rope connected to the pole pulled taut. The drake's flight was blocked.\n\nOnce again, the power of items.\n\nDuring the two-day rest period, Grid had designed tools specifically to neutralize flying monsters. He'd crafted several prototypes. Grid reached for his next item.\n\n---\n\n**TL Note:** From this point forward, all previous mentions of drakes will be changed to wyverns. Huroi's pet and the creatures used during the pet marathon are wyverns, not drakes."
}