{
  "id": 436,
  "title": "Chapter 436",
  "content": "The drake's roar split the air as Grid's blade connected again. Its tail lashed out in response.\n\nA sharp crack. The appendage slammed into Grid's ribs.\n\n\"Kuk!\" He coughed, tasting copper.\n\n*A dragon-type should rely on magic, shouldn't it?* \n\nEveryone knew dragons wielded devastating breath attacks. Grid had assumed drakes followed the same pattern. He'd been wrong. This creature's breath was pathetic compared to its physical strikes—the inverse of wyverns.\n\n*Damn. That first breath fooled me.*\n\nThe tail struck again. Six thousand health evaporated. His limbs locked up.\n\n> [Stunned]  \n> [Stiffened]\n\nNo one could solo raid a drake. Grid was certain of that. The first tail strike would paralyze any player, leaving them helpless for the killing blow.\n\nBut Grid wasn't any player.\n\n> [You have resisted.]\n\nThe stiffness vanished the instant it took hold. Grid surged forward as the drake retracted its tail, closing the gap. He drove his sword toward the creature's brow.\n\n\"Kill!\"\n\n> [Critical!]  \n> [You have dealt 635,900 damage to the target.]\n\nThe Efficient Hunting Sword lived up to its name. Every skill triggered a critical, the damage obscene. After weeks of fighting human opponents with the National Competition's fifty percent damage reduction strangling his output, this felt like breathing again.\n\nThe drake shrieked its confusion and belched flame. A pillar of fire roared toward Grid. The creature's posture relaxed, confident the human would cook.\n\nGrid walked through the inferno.\n\nLantier's Cloak rippled around him, its climate-adaptive resistances turning lethal heat into mild discomfort. He wrapped the fabric tighter and emerged from the flames, sword already moving.\n\n\"Pinnacle.\"\n\nThe drake's victory cry became a wail. It sounded like a dying infant.\n\n\"Wow... that's brutal,\" someone muttered among the Korean representatives.\n\n\"He keeps hitting the exact same spot. It's inhuman.\"\n\nThey understood the difficulty, though. Knew what it took to land strike after strike on an identical point while the target thrashed and dodged. Despite their words, they were impressed.\n\n*Everyone knows repeated strikes to the same location weaken defense and compound damage.*\n\n*But actually doing it against a moving target? Nearly impossible.*\n\nYet Grid made it look simple. It shattered the narrative that 'Grid has poor control.'\n\nPeak Sword launched himself into the air, arms spread wide. \"You finally understand? This is God Grid's skill!\"\n\nThe Overgeared members knew what others didn't. Grid had fought legendary NPC Piaro. He'd crossed blades with Kraugel, peak of two billion users. No matter how clumsy Grid started, that kind of pressure forged improvement. The problem was his items. They were so overwhelming that enemies died before Grid needed to demonstrate technique.\n\nThe drake was different. Strong enough to push him.\n\n\"Do you know God Griddddddd?\"\n\nPeak Sword's voice carried across the arena.\n\nGrid's eye twitched.\n\n*That person is really loud.*\n\nThe shout broke his concentration. During the Hell Gao raid, Peak Sword had been mercifully silent.\n\n*I should make him a pickaxe soon. Give him something to do during these events.*\n\nGrid checked the drake's health bar. Fifty percent. Seven minutes of relentless assault had carved away half its life. Compared to the team raids—the United States and Japan already at seventy percent—his progress seemed lacking.\n\nGrid wasn't worried. He wouldn't stop.\n\nThe drake's breath pattern shifted at half health, firing in rapid succession.\n\n*Can't get hit by these.*\n\nEven weakened, each breath dealt three to four thousand damage. The accumulation would become problematic. Grid focused, weaving between pillars of flame. Two years of flight practice let him maneuver through three dimensions like they were natural.\n\nThe problem was the cooldown. It dropped to zero.\n\nFlames erupted in staccato bursts. Grid twisted, spun, dove. Inevitably, one connected. He staggered mid-air.\n\nThe drake's tail was already moving. It crashed into Grid's face with surgical precision.\n\n> [Critical!]\n\nThe Korean representatives and commentators collectively winced. Grid was in trouble.\n\nGrid felt the chill of imminent pain. Then nothing. No impact registered.\n\nTiramet's Shoulderguards had activated their low-probability physical nullification.\n\nThe drake's strongest weapon became irrelevant.\n\nThe creature roared its confusion.\n\n*If I were that drake, I'd want to die,* one representative thought.\n\n*Same.*\n\n*I'd be cursing him right now.*\n\nGrid pressed the advantage. The tail was devastating and fast, but recovery left the drake exposed. He exploited that window ruthlessly.\n\nThe drake's health dipped below fifty percent. It screamed.\n\n> [The drake's survival instinct has kicked in!]  \n> [The drake's heart is beating faster!]  \n> [The drake's body is burning!]  \n> [The drake's defense and resistance drops, while its speed, attack power and magic power is greatly increased!]\n\nFlames wreathed the drake's body. It became a volcano suspended in sky. The pressure made Grid's chest tighten.\n\nThe creature closed the distance. Its speed exceeded Grid's two thousand agility. Even with the Slaughterer's Eye Patch, Grid barely tracked the movement. One wing-beat, and the drake's foreleg smashed into his nose.\n\n> [You have suffered 9,300 damage.]  \n> [You have suffered 1,710 damage.]\n\nPain flared through his skull. Despite Triple Layers' physical resistance and Tiramet's Belt's damage reduction, he'd lost a seventh of his health. The fire damage came as an afterthought.\n\n*Can't ignore the level difference.*\n\nGrid dismissed the drake's power as mere statistics. Other representatives would have been outraged. Flying monsters traded stats for aerial superiority—that was game balance. Yet this drake had superior attack, magic, defense, and resistance while maintaining flight advantage. Zibal had raided twenty named bosses and called it one of the strongest. The broadcast experts were labeling it unbalanced, a superior species that broke the game's rules.\n\nGrid disagreed.\n\nYatan Servants Malacus and Neberius. Pope Drevigo and candidate Pascal. Great Demon Hell Gao and Braham's golems. Vampire Earl Elfin Stone and Vampire Viscount Tiramet. Piaro and Kraugel.\n\nCompared to that rogues' gallery, the drake was ordinary. A top species? Mass-produced. Nothing like enemies where only one existed in the entire world.\n\nAnd Grid was the poster child of unbalanced.\n\n\"Blackening.\"\n\nHis skin bleached white. The whites of his eyes flooded black. Demonic energy coiled around him like smoke.\n\n> [Your black magic power has increased.]  \n> [You don't have any black magic power. It will be replaced with demonic power.]  \n> [While Blackening is activated, your species will change to half-demon.]  \n> [As a half demon, your maximum health is reduced by 50%. Your attack power, magic power and agility will increase by 20% each.]  \n> [All attacks will be converted to the black magic attribute.]\n\nThe drake had already carved away half his health. Since Blackening would cut his maximum health in half anyway, the timing was perfect.\n\n*From now on, I can't afford to get hit.*\n\nThe tail whipped toward him. Grid equipped Doran's Ring and activated Quick Movements, dodging through the gap. He aimed for the opening, but the drake launched a breath to block the counter.\n\nIt was learning.\n\nDespite inferior intelligence compared to wyverns, it wasn't stupid. The tail was no longer a weakness.\n\n*It's learning faster than me.*\n\nSeveral times faster. Grid was officially dumber than a monster.\n\nThe drake swung its foreleg. Small compared to its massive frame, but the strength was tremendous. Claws harder than steel moved with the speed of a professional boxer's jab.\n\nNot enough. Not against Grid with Blackening and Quick Movements active.\n\nHe slipped the attack using the Eye Patch's guidance and triggered Blacksmith's Rage. His attack power and speed spiked. He struck the drake's brow again.\n\nThe creature shrieked. The damage was significantly higher than before, its lowered defense and resistance compounding each strike. Blood poured from the wound.\n\nThe drake didn't retreat. It cried out in feral rage, launching breath and wing-beats simultaneously.\n\nFlames filled Grid's vision. The wind pressure from those massive wings caught him, slamming him downward.\n\nHe fell.\n\nThe drake descended, targeting his torso. A meteor aiming to crush him against the earth.\n\nEveryone watching sensed it. Grid would fail.\n\nWhich meant Grid would probably succeed. His specialty was overturning expectations."
}