{
  "id": 438,
  "title": "Chapter 438",
  "content": "**WHOOOM!**\n\nA massive spark tore through the darkness. Flames erupted across the drake's scales, surging like wildfire across its wounded body. The creature thrashed, its roar splitting the air.\n\n**ROAAAR!**\n\nEven diluted by generations of separation from true dragons, that sound carried weight. Pressure radiated outward in waves, the instinctive dominance of a superior species. A force meant to drive lesser beings to their knees.\n\nThe man facing the drake felt nothing.\n\nHe launched himself upward, blue greatsword cutting an arc through the smoke. No hesitation. No fear.\n\n**SHUNK.**\n\nThe blade carved through bone and scale in a single diagonal slash. The drake's skull split cleanly down the middle. Blood sprayed in arcing jets, igniting mid-air as flames spilled from the severed neck.\n\n**THUD.**\n\n**THUD.**\n\nChunks of drake flesh rained down around the black-haired warrior. He stood motionless as gore splattered across his shoulders, watching the corpse dissolve into grey ash. Only when the last particle faded did he turn toward the floating camera, his expression flat.\n\n\"Comet Group.\"\n\nTwo words. Nothing more.\n\nAcross the globe, hundreds of millions of viewers blinked at their screens. *What?* But it was enough. The name had been spoken. Algorithms would latch onto it, searches would spike, and whether through curiosity or confusion, the Comet Group would ride the wave of attention generated by those two syllables.\n\nIn a corporate boardroom halfway across the world, employees erupted from their chairs.\n\n\"He actually said it!\"\n\nThe chairman of Comet Group stared at the broadcast screen, trembling. Global brand recognition. Instant market penetration. All from two words spoken by the world's most-watched player. He wanted to marry his granddaughter off to this man on the spot.\n\nGrid's cold professionalism in remembering his Product Placement deal would be taught in business schools for years to come.\n\n***\n\nThe United States team's waiting room hummed with tension.\n\n\"Pure fucking luck!\"\n\nZibal slammed his fist on the table, his knuckles white as he rewound Grid's raid footage for the third time. He didn't blame the items anymore. Fine. Grid knew how to use his gear. That much was undeniable.\n\nBut the rest?\n\n\"Look at this!\" Zibal jabbed a finger at the frozen frame. \"Critical hit. Item option proc. Title effect trigger. *Everything* lined up perfectly in one strike!\"\n\nImpossible. That kind of convergence, where every variable aligned to maximum potential, happened once in ten thousand attempts. Lottery odds. Zibal's jaw worked as he stared at the screen.\n\n\"That bastard's got a god watching over him. He has to.\"\n\nLauel, standing near the wall, suppressed a smile. Zibal had no idea how spectacularly wrong he was. *If Grid had divine favor, every hammer swing would produce legendary items.*\n\nThe gap between legendary and unique ratings was staggering. Dozens of times the value, sometimes hundreds. And here was Grid, a **Legendary Blacksmith**, churning out unique and epic items while legendary successes remained agonizingly rare.\n\n*You'd think he nuked an orphanage in a past life.* Lauel's smile widened. *Or maybe you were a demon who ended the world. That would make us enemies, then and now.*\n\nThe thought amused him. Reincarnation. Karmic debt. Destiny binding them together across lifetimes.\n\nHis musing broke as the broadcast shifted.\n\n**『 Oh no! Thailand's given it everything, but they can't finish the raid! 』**\n\n**『 Of the 32 participating nations, only 23 have succeeded. 』**\n\nThe raid rankings scrolled across the screen. South Korea: 1st. United States: 2nd. Japan: 3rd.\n\nLauel noted with satisfaction that every country fielding an Overgeared member had cleared the drake. *Good. That means the drops are distributed among allies.* Yura would have claimed her share. Peak Sword would have secured something valuable. Synergy through strategic placement.\n\nHe straightened his jacket and headed for the press conference.\n\n***\n\nThe press room was a feeding frenzy.\n\n\"Did you manufacture the harpoon restraint system yourself?\"\n\n\"How did you conceptualize a secondary weapon of that scale? The ingenuity of using repair tools to bypass durability limitations is remarkable. Would you walk us through the production process?\"\n\n\"The God Hands! What are their stats? Can you disclose their item options?\"\n\n\"What's the attack power increase when combining both swords?\"\n\n\"The drake had 48% health remaining when you killed it. Analysts estimate you dealt approximately 20 million damage in that window. Can you confirm?\"\n\n\"High-rankers reported losing a quarter of their health per drake attack at the 50% threshold, but your health only dropped by a tenth. What are your defensive values? Your total HP?\"\n\n\"Blackening. That transformation. Is it an artifact ability?\"\n\nThree countries sat on the stage. Korea. The United States. Japan.\n\nEvery single question targeted Grid.\n\nThe reporters didn't even glance at the other representatives. The world's attention had crystallized into a singular focus, and Grid sat at its center, stone-faced, repeating the same phrase.\n\n\"No comment.\"\n\n\"No comment.\"\n\n\"No comment.\"\n\nA reporter near the front leaned forward. \"The team events have concluded. Four individual events remain. One of them is the Blacksmithing Production Game. Mr. Grid, you previously stated you would not participate. Does that declaration still stand?\"\n\nCameras swiveled. The Korean press corps held their breath.\n\n*If Grid swept all three individual golds, South Korea would claim first place overall.* It was basic math. Grid's presence in the blacksmithing event, where his legendary class gave him an overwhelming advantage, was the difference between victory and defeat.\n\nThe Korean reporters willed him to change his mind. *Say yes. Just say yes.*\n\nGrid's expression remained cold.\n\n\"I'm not participating in the blacksmith game.\"\n\nGroans rippled through the Korean section. One reporter looked ready to scream.\n\nThen Panmir, seated with the US delegation, spoke.\n\n\"Grid.\" The grey-haired blacksmith's voice cut through the murmurs. \"Are you avoiding me because you're afraid?\"\n\nThe room went silent.\n\n*You idiot.* The thought echoed simultaneously through the minds of every American representative and citizen watching. Panmir was *handing* Grid the gold medal. Why would you provoke him? Why would you drag him into an event he was skipping?\n\nBut Panmir's pride burned too hot for strategy.\n\nHe'd spent years honing his craft. Thousands of hours at the forge, perfecting technique, pushing the boundaries of what non-legendary blacksmiths could achieve. And this man, this **Grid**, had waltzed into a legendary class and ridden item quality to fame.\n\nPanmir leaned forward. \"If you're a man, prove it. Don't run away like last year.\"\n\nGrid's fingers drummed once on the table.\n\n\"I'll show the world what you really are,\" Panmir continued, his voice rising. \"A legend in name only.\"\n\nThe temperature in the room dropped.\n\nGrid turned. Slowly. His profile cut a sharp line against the stage lights, high nose and angular jaw catching the camera flashes in stark relief.\n\n**SNAP. SNAP. SNAP.**\n\nShutters fired in rapid succession.\n\nReporters leaned forward, pens hovering over notebooks. *This is it. This is the moment.*\n\nGrid's gaze locked onto Panmir.\n\n\"Let me show you the difference between you and me.\"\n\nThe room exploded. Voices overlapped, questions shouted over each other, reporters scrambling to capture quotes. The showdown the world wanted, excluding only the Americans, had been declared.\n\nLauel, seated among the US representatives, clenched a fist beneath the table. *Perfect.*\n\nHis eyes flicked toward the back of the room, where Kraugel stood alone against the wall.\n\n*Enjoy your victory, Kraugel. And the medicine that comes with it.*\n\n***\n\nThe blacksmith production game had a simple premise: forge a longsword.\n\nNot a masterwork. Not a legendary artifact. An ordinary **Level 300** blade. Every participant would receive identical production methods and materials.\n\nThis was precisely why Grid had wanted to avoid it.\n\n*It all comes down to luck.* The item rating generated from a standard blueprint ranged from Normal to Legendary, determined by invisible dice rolls during the crafting process. And Grid's luck stat was, historically, abysmal.\n\n> **[Ordinary Longsword]**  \n> **Rating:** Normal ~ Legendary\n\n\"If I produce a Normal item, I'll never hear the end of it.\"\n\nHis own custom designs, forged with **Legendary Blacksmith's Craftsmanship**, guaranteed minimum outputs of Epic or Unique. Standard blueprints started at Normal or Rare. The floor was lower. The risk was higher.\n\nGrid exhaled. *Get a grip.*\n\n*I've made over 3,000 longswords.* Muscle memory. Instinct. Longswords were balanced weapons with universal demand. He'd forged them in bulk for Reidan's army. One thousand soldiers initially, now pushing two thousand. Every one of them equipped with a blade from his hammer.\n\nHe could forge a longsword in his sleep.\n\n*I have the experience. I have the technique.* Grid's jaw set. *Time to prove it.*\n\nHe was a **Legendary Blacksmith**. That title wasn't decoration. He'd earned it through endless hours at the forge, compensating for bad luck with raw effort. His pride matched Panmir's, pound for pound.\n\n\"Login.\"\n\nGrid returned to the hotel and climbed into the capsule. The system interface flared to life around him.\n\n*First,* he thought, *let's see what the drake dropped.*"
}