{
  "id": 439,
  "title": "Chapter 439",
  "content": "A storm erupted the moment the press conference ended.\n\n\"Panmir, are you out of your mind?\" One representative surged forward. \"Why the hell did you do that?\"\n\nAnother slammed his palm on the table. \"We can kiss our championship goodbye. The US is going to miss first place because of idiots like you.\"\n\nThe US representatives gathered in a cramped conference room. The air felt suffocating. Every face turned toward Panmir with accusation in their eyes. Everyone except Lauel. Curses hung on lips, ready to spill.\n\nPanmir didn't shrink back. He didn't even look apologetic. His expression hardened.\n\n\"I've worked as a blacksmith since Satisfy launched.\" He met their stares without flinching. \"Every session, from login to logout, I hammer at my anvil.\"\n\nHe'd used the same materials and production methods as everyone else. But he'd researched. He'd refined techniques. He'd actually trained his skills over the years.\n\n\"Most people think crafting results depend purely on luck.\" Panmir shook his head. \"That's wrong. It depends on technique and devotion. Zibal, you know this. You've seen me invest eight hours to create just one item.\"\n\n*Grid takes at least twenty hours to make an item. Sometimes it's two days.*\n\nLauel kept the thought to himself. Only eight hours, and Panmir spoke like it was an eternity. \n\nZibal nodded slowly. \"I know. Your working time is twice as long as an ordinary blacksmith's.\"\n\n\"Why do you think that is?\"\n\n\"...?\"\n\nThe dissatisfied representatives leaned forward. Interest flickered across hostile faces. Panmir confirmed the shift in atmosphere before continuing.\n\n\"I stick to manual labor.\"\n\n\"Manual labor?\"\n\n\"Making an item is actually simple.\" Panmir gestured as he spoke. \"Open the design of what you want to make. Register the necessary materials. Click the 'Production' button, and the hammering starts automatically.\"\n\nMost blacksmiths worked this way. Depending on the item, completion took anywhere from five minutes to six hours. Too little time usually meant defective products. But investing more time didn't guarantee high ratings either. The average blacksmith spent about three hours per item.\n\n\"But I don't use the production system.\" Panmir's voice rang with conviction. \"I swing the hammer myself. I craft each item as best I can. That's manual labor.\"\n\n\"What's the benefit?\"\n\n\"The probability of high ratings and additional options increases.\" Panmir counted on his fingers. \"Most blacksmiths who do manual labor become rankers. It's not something just anyone can do. Concentrating and working for hours on a single item? It's harsh. It drains your stamina.\"\n\nHe paused, letting that sink in.\n\n\"Grid is Pagma's Descendant. From the moment he changed classes, he learned the finest blacksmithing skills. He just has to press the production button. He'll easily mass produce rare and epic items. If he's lucky, maybe unique and legendary ones too.\" Panmir's lip curled. \"What does he know about effort? He'll never know about manual labor. Even if he did, why would he bother when he can take the easy method?\"\n\nThis was his entire point.\n\n\"Grid only relies on luck. I'm different. In tomorrow's game, Grid will rely on luck while I show my technique.\"\n\nTomorrow, Grid would simply create top rated items by clicking the production button as usual. Maybe he'd make a legendary item. Meanwhile, no matter how much effort and skill Panmir used, he was stuck with epic and unique ratings.\n\nBut Panmir's confidence didn't waver. He believed the epic or unique item he made with all his effort would outperform the 'name only' legendary items that Grid would create.\n\nSkull, who'd been listening in silence, spoke up. \"In the end, Satisfy is a game. Obviously the dexterity stat and blacksmithing skill level have a big impact on the outcome. Systematically, there's more grounds for defeat than victory. I don't understand your confidence.\"\n\nPanmir laughed.\n\n\"My blacksmith skill is also advanced level six. I've reached intermediate level in the dwarf skills learned in Talima. The items I make have twelve percent better stats than what's listed in the production method.\"\n\nHe wasn't finished.\n\n\"My dexterity has been steadily increasing through manual work. It's approaching seventeen hundred. I assure you, my dexterity is much higher than Grid's. He doesn't make anything by hand.\"\n\n*Grid's dexterity is almost three thousand.*\n\nLauel suppressed a smile. Was this all? People always evaluated Grid using their own common sense.\n\n*We can't measure him.*\n\nGrid worked harder than all of them combined. Unless Panmir realized this, he would always be below Grid.\n\nLauel shrugged at the thought.\n\n***\n\n> **[Drake's Fang]**\n> \n> Classified as a class 2 metal, harder than any metal taken from human mines.\n> \n> It's bigger, less curved, lighter and more elastic than an elephant's ivory. It's less hard than a drake's claws, bones, and scales.\n> \n> Ideal as a material for a spear or bow.\n> \n> Weight: 100\n\n> **[Drake's Claw]**\n> \n> Classified as a class 2 metal, harder than any metal taken from human mines.\n> \n> A drake's claws are formed by several layers.\n> \n> Every five years, another layer grows. You can guess a drake's age through their claws.\n> \n> The hardest of all drake body parts. Ideal as a solid material for swords or spears.\n> \n> However, this makes it very difficult to smelt.\n> \n> Weight: 820\n\n> **[Drake's Scale]**\n> \n> Classified as a class 2 material, harder than any metal taken from human mines.\n> \n> Tough and elastic. Classified as leather rather than metal. Ideal as material for armor.\n> \n> Weight: 250\n\n> **[Drake's Bones]**\n> \n> Classified as a class 2 material, harder than any metal taken from human mines.\n> \n> The next hardest part after the claws.\n> \n> Used as armor material, but very brittle with a weak impact surface.\n> \n> Weight: 300\n\n> **[Drake's Heart]**\n> \n> A heart with a little bit of dragon's blood flowing in it.\n> \n> Generates an infinitely small amount of magic power and flames.\n> \n> Weight: 1,000\n\nMines existed in the human world. Logic dictated that mines existed in the god world and in hell too. That would explain how the god mineral adamantium could exist separately.\n\n\"It's a jackpot.\"\n\nGrid's expression brightened as he verified the information. Thanks to the two fangs, he could make the best bow and spear. For Grid, who had Bow Mastery and Spear Shot, bows and spears were excellent secondary weapons worth the investment.\n\n*I'll make a spear with the claws. I'll keep the scales and bones for now.*\n\nGrid had recently produced Triple Layers, the Largest Gloves, and Lantier's Cloak. He was satisfied with his defense. At the very least, he was confident no one in the National Competition had better armor. Making new armor now would be wasteful. If a day came when he required greater strength, he'd use the materials then.\n\nGrid held the drake's heart, eager to deal with new production methods.\n\nThis was the biggest reward from the raid. The heart produced infinite flames.\n\n*If I melt and attach this to a weapon, it'll add fire damage every time I attack. If I attach it to armor, it'll create fire to defend and attack enemies.*\n\nA shame there was only one. Why did a drake have only one heart? It'd be great if it had ten of them.\n\nKhan's smithy. Someone approached Grid as he stood before the furnace.\n\nLauel.\n\n\"I wish you victory in the production game.\"\n\nGrid snorted. \"Can't you tell the difference between business and personal matters? Why are you cheering for me?\"\n\nThe value of gold medals in the 2nd National Competition was astronomical. They received the best rewards for every gold medal won. As a simple example, adamantium was awarded to blacksmiths. Lauel should be praying for the US victory, for the sake of his own development.\n\n\"Well, you doing well will work out better for me in the end.\"\n\nHe swallowed down Kraugel's story again.\n\n\"Don't worry about it. Do your best. When making an item, please be sure to use manual labor.\"\n\n\"Manual labor?\" Grid frowned. \"Of course a blacksmith should use manual labor. How else do they make items? What are you saying?\"\n\n\"...?\"\n\nLauel's eyes widened. He thought for a moment before asking cautiously.\n\n\"Do you know about the production button?\"\n\n\"Production button?\" Grid blinked. \"What's that?\"\n\n\"...\"\n\nIndeed. The legendary blacksmith Grid seemed to be carrying a penalty he didn't know about. He didn't benefit from the production system. Grid had been Pagma's Descendant for over two years. He handcrafted everything individually, even if it was one arrow.\n\n*This is why he works for so long.*\n\nLauel glanced at Grid.\n\n\"What?\" Grid bristled. \"Why are you looking at me like that?\"\n\n\"Just...\" Lauel patted his shoulder. \"Have strength.\"\n\nGrid felt bad for some reason.\n\n***\n\nThe National Competition's seventeenth day.\n\nThe blacksmith production game was scheduled. A total of twenty-three participants. Originally, attention should have been divided between 1st ranked Panmir and 2nd ranked Stein. Now it was directed solely toward Grid.\n\nHow great was an item made by a legendary blacksmith? The items Grid made were limited and weren't circulated in the market. People's curiosity and expectations had reached their peak.\n\n> **[System Announcement]**\n> \n> The time limit to produce an item is 8 hours! Blacksmiths, please only use the production method and materials you were given!\n\nAdding additional materials or modifying the design was prohibited. This was a game to show pure skill under identical conditions.\n\n*Anyway, it's a game of luck.*\n\nGrid grumbled as he stood before the furnace. The other blacksmiths thought the same.\n\n*Grid, you're a legendary blacksmith who can easily make items. Your skills are fundamentally different from mine.*\n\n*Can you imagine doing physical labor like hammering for eight hours straight?*\n\n*We'll show you the power of manual work!*\n\nBefore the host announced the start of the match, the blacksmiths standing before their furnaces gripped hammers in their hands. They gazed at Grid with heated intensity.\n\nBut Grid wasn't conscious of their stares.\n\n*Make an item in eight hours? Why is the time limit so short? Isn't this bad?*\n\nGrid was more familiar with hard labor than anyone else. The other blacksmiths would be shocked if they knew what he was thinking."
}