{
  "id": 44,
  "title": "Chapter 44",
  "content": "# Chapter 44\n\nErina's face looked like something out of a painting. Soft features, clear skin, the kind of innocence that made you think angels might actually exist.\n\n*A really good girl.*\n\nGrid felt a small spark of hope flicker in his chest. Then she spoke.\n\n\"I have a condition instead.\"\n\nThe spark died.\n\n*Of course. Pretty face, rotten heart. Tale as old as time.*\n\n\"Oof! Oooof!\"\n\nGrid thrashed against his bindings. *This damn girl! Setting conditions when I'm tied up like a pig? If you came to rescue someone, just rescue them!*\n\nErina watched his muffled outrage with obvious amusement. A smile tugged at her lips.\n\n\"You'll listen to any conditions, so I'll talk quickly? Good. You're straightforward.\" She crossed her arms. \"You will make an orb for me. One that contains as much magic as possible. At minimum, the orb should match the performance of this dagger.\" She tapped the weapon at her belt. \"You can do that with your blacksmith skills, right?\"\n\n*Orb?*\n\nGrid had never created one before. He barely knew what an orb was. Some kind of magic item? Why would she ask him instead of a magician?\n\n*No. Not the time.*\n\nHe nodded frantically.\n\nErina's expression softened. \"Okay. The other condition is simple. You can never call me 'kid' again. My name is Euphemina. Just Euphemina. Understood?\"\n\nGrid's head stopped mid-nod.\n\n*Wait. Earlier she said Erina. Now Euphemina? Did she forget her own name? Or was it fake from the start?*\n\nWhatever. He nodded again.\n\nErina... no, Euphemina pulled out a key and unlocked the prison door. The iron hinges groaned. She stepped inside and removed the gag from his mouth.\n\n\"Puak!\"\n\nGrid gasped, air flooding his lungs. He wiped the saliva from his chin with his shoulder, then looked up at her.\n\n\"What's happening? Why did you come here to save me?\"\n\nEuphemina tossed the dagger toward him. It clattered on the stone floor near his feet.\n\n\"Better to talk once we escape, don't you think?\"\n\nThe moment she finished speaking, boots thundered on the stairwell. Dozens of them. Grid's stomach dropped.\n\n\"Hey, Ki... Euphemina.\" He caught himself. \"What is this? Didn't you take care of the soldiers?\"\n\n\"There are a lot of soldiers.\" She shrugged. \"I handled over a hundred, but more remain. You'll have a hard time escaping.\"\n\n\"Pfff!\"\n\nA laugh burst from Grid's throat before he could stop it. Euphemina's eyes narrowed.\n\n\"Why are you laughing?\"\n\n\"Because you said you took care of over a hundred soldiers. How can a blacksmith fight like that? Come on. You should bluff more moderately.\"\n\n\"I'm not a blacksmith.\"\n\n\"What?\"\n\nEuphemina turned to face him directly. Her deep blue eyes caught the torchlight. Beautiful, like polished sapphires. Still, she was just a kid. If she ate more and filled out, maybe she'd be attractive.\n\n*Wait, where am I looking?*\n\n\"Where are you looking?\" Euphemina covered her chest with both arms, frowning.\n\n\"I'm not interested in small breasts. Don't worry about it.\" Grid cleared his throat. \"You're not a blacksmith? What do you mean?\"\n\n\"I really dislike people like you.\" She grumbled under her breath, but continued. \"I have a special class. Duplicator. I pretended to be a blacksmith by copying Khan's skill. You're like me, right? You're not an ordinary blacksmith either?\"\n\n*Duplicator?*\n\nGrid had never heard of that class.\n\n\"A rare class?\"\n\nEuphemina's face flushed. \"It isn't rare! It's **epic**!\"\n\n\"What?!\"\n\n*One of Satisfy's three epic classes belongs to this kid?*\n\nThere was no reason for her to lie in this situation. If it was true...\n\n\"You thoroughly hid your identity. Why reveal it to me? And why now?\"\n\n\"**Because** of this situation.\" Euphemina gestured at the stairwell. The boots were getting closer. \"You have a hidden class too. I know everything. So stop pretending to be an ordinary blacksmith and fight with your real abilities. Otherwise you'll die here.\"\n\n\"I was planning on it.\"\n\nGrid nodded and gripped the dagger.\n\n> [Due to your class characteristics, you have equipped the Ideal Dagger.]\n\n> [This is an item you created. Your understanding is 100%.]\n\n> [In the case of items made by you, a penalty will be applied if you don't meet the item usage requirements, even if you have full understanding.]\n\n> [Attack power of the Ideal Dagger will decrease by 20%. Only half of the option effects will be applied.]\n\n**[Ideal Dagger]**  \nRating: <span class=\"rarity-unique\">Unique</span>  \nDurability: 168/168  \nAttack Power: 242~264  \nAttack Speed: **+11%**\n\n* There is a rare chance of instantaneously killing the target.\n* **Agility +20**\n* Generates skill 'Wind Blast'\n* Generates skill 'Quick Movements'\n\n*A dagger created by a craftsman with great skills and potential, but lacks experience and reputation. Made in collaboration with the renowned blacksmith Khan. Nothing special about the materials or method, but the craftsman's skill and cooperation with Khan created an ideal dagger.*\n\nUser Restriction: Level 180+, 450+ Agility, Advanced Dagger Mastery.\n\n*Even maximum understanding doesn't remove the penalty?!*\n\nGrid's jaw clenched.\n\n*This is deplorable. Absolutely deplorable.*\n\nHe flexed his fingers around the grip.\n\n*But only 20% penalty for a unique item? Could be worse.*\n\nEuphemina stared at him as he held the weapon.\n\n\"Is your real class in the assassin series? It requires 450 agility and Advanced Dagger Mastery.\" She tilted her head. \"But that's strange. How do you have blacksmith craftsmanship?\"\n\n*She must've seen the information when she picked it up.*\n\nGrid realized that was when she'd asked about the orb. Yet she wasn't greedy. She returned it to him instead of keeping it.\n\n*She's actually decent.*\n\nHe studied her face.\n\n*If it was me, I would've kept it. She's stupid. A kid who doesn't know how the world works.*\n\nThen another thought struck him.\n\n*Wait. She wants an orb as good as this dagger? Is she... is she going to pay for the materials? She's not expecting me to make it for free, right? Wicked girl.*\n\nNo. Too early to judge. He had time to figure out Euphemina.\n\n\"Wind Blast.\"\n\nGrid pointed the dagger at the rushing soldiers. A blade of wind shot forward, sharp as glass. Blood sprayed. Ten soldiers collapsed, clutching wounds that hadn't been there a second before. Euphemina whistled softly.\n\n\"A skill attached to an item displays this much power? Incredible.\"\n\n*This isn't even full power.*\n\nGrid grimaced. If he met the conditions, Wind Blast would be twice as strong.\n\n*Only half the option effect. What a waste.*\n\nHe pushed the thought aside and turned to Euphemina.\n\n\"I need to rescue someone.\"\n\n\"Hm? A person?\" She blinked. \"Oh, you mean Khan? I already freed him before coming here.\"\n\n\"Khan was captured too? Good. He's safe.\" Grid shook his head. \"But I'm not talking about Khan. I mean Huroi.\"\n\n\"Who?\"\n\nGrid explained briefly. Euphemina's expression soured with each word.\n\n\"I don't know that name.\"\n\nSilence.\n\n*She thinks she stepped in shit.*\n\nGrid could read it on her face. He didn't care. Only 1 hour and 50 minutes remained. He had to find Huroi in that time.\n\n*After I save that bastard, I'm going to yell at him. This is all his fault.*\n\nFury burned in his chest.\n\n\"Wahhhhh!\"\n\nThe soldiers charged in unison. Around thirty of them. Grid tensed, but Euphemina remained completely calm. Her expression didn't change as she raised one hand.\n\n\"Spear of Destruction.\"\n\n**Pachichik!**\n\nA dark red spark leaped from her fingertip. It expanded, forming a spear of crackling energy. The weapon shot forward.\n\n**Bam bam bam! Kwang!**\n\nThe spear pierced the first soldier, then the second, exploding through their bodies. All thirty turned to grey light in seconds. A spell that powerful, cast so casually. Was she on par with that witch Yura? How could she use it so easily?\n\n\"Hiccup!\"\n\nThe sound escaped Grid's throat before he could stop it.\n\n*What did I say to her earlier? I insulted her a lot, didn't I? Is she angry?*\n\nHe froze. Euphemina glanced at him.\n\n\"What? Don't you have to rescue Huroi?\"\n\n\"Y-Yes.\"\n\nThe word came out formal. Grid had been about to speak casually, but something made him reconsider.\n\n*Never call her a kid again. I'll make her orb. She's been patient so far. Don't offend her anymore.*\n\nHe made the decision and headed deeper underground.\n\n---\n\n**Glossary of Common Korean Terms**  \nOG: Glossary Link\n\n*Current schedule: 20 chapters a week.*\n\n*Check out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing the day's chapters.*"
}