{
  "id": 440,
  "title": "Chapter 440",
  "content": "> **[System]** The time limit to produce an item is 8 hours! Blacksmiths, please only use the production method and materials you were given!\n\nThe National Competition's 17th day. The blacksmith production game began.\n\nOriginally, this was a minor event. But after Grid announced his intention to participate, the situation reversed. It attracted attention comparable to the team events. The blacksmiths participating in the event felt gratitude towards Grid.\n\n*Thanks to Grid, our value has been raised.*\n\n*Thank you for sacrificing yourself for us!*\n\nWhat if the people watching around the world saw the brilliant work of advanced blacksmiths making an item better than a legendary blacksmith? The blacksmith's reputation would soar. Each item they produced would become a premium, its value skyrocketing.\n\nThe eyes of the blacksmiths heated up as they planned to make Grid a sacrifice. Most of them considered themselves 'craftsmen,' proud enough that they felt no fear towards Grid. Grid relied on his class. They had technique.\n\nGrid stared at the production method and materials common to all participants.\n\n---\n\n**[Production Method: Longsword]**\n\nRating: Normal ~ <span class=\"rarity-legendary\">Legendary</span>\n\nAn ordinary longsword.\n\nA distinct disadvantage is that anyone can use it easily and comfortably.\n\nUser Restriction: Level 300 or higher. Intermediate Sword Mastery level 7. 1,500 strength.\n\n---\n\nThe making of the longsword was plain and simple, without anything special. It was good that it was simple. Grid had produced thousands of longswords. He could make one with his eyes closed.\n\nBut Grid wasn't careless. The element that had the greatest effect on the result of an item was **luck**.\n\n*What if I carefully make this longsword?* There was a real possibility the result would be a normal sword due to his terrible luck. Grid had experienced this thousands of times already.\n\n*It would be different if I could change the production method.*\n\nGrid had accumulated experience and knowledge by making thousands of items. He used that experience and knowledge to alter production methods. Grid's true skill, the one no one else could replicate, was minimizing the disadvantages of a production method through his own interpretation and amplifying the advantages.\n\nBut this time, the rule was to follow the production method. Grid couldn't show off this skill.\n\nHis hands trembled.\n\n*This is the organizer's manipulation.*\n\nIt was clear the rule was made to purely control him. Because of that, the legendary blacksmith had to feel tension against blacksmiths who hadn't even reached the ranks of a craftsman.\n\nThe world was unfair.\n\n\"Hahh, shi...\" Grid barely suppressed his urge to curse. \"These evil people. Does it make sense to give a legendary blacksmith a penalty every time?\"\n\nA boy approached as fire started burning in the furnace. Pleasant-looking, with a bright smile.\n\nHis ID was Steng. He was 2nd on the blacksmith rankings.\n\n\"Grid, it's been a long time!\"\n\n\"I agree.\"\n\nIt was already 2 years. When Irene had just been appointed as ruler of Winston, Grid participated in the auction at the lord's castle and briefly met Steng.\n\n\"I was so surprised when I learned later that you were a legendary blacksmith! It's a truly delightful and glorious memory!\"\n\n\"I remember.\" Grid eyed him. \"Are you still training under the NPC?\"\n\nSteng was a very bright boy. His positive energy was overflowing, making Grid like him. Steng shook his head at Grid's question.\n\n\"I've been independent since last year. Now I'm operating a smithy alone.\"\n\n\"You're running a smithy alone?\"\n\n\"Yes!\" Steng's eyes lit up. \"I direct the production and circulation of items so I can provide consumers with quality items at a reasonable price. I'm also making a higher profit!\"\n\nIt wasn't going through an auction house or merchants, so there was less of a burden from sale commissions.\n\n*Is this good?*\n\nRunning a smithy was pleasurable in many ways for a blacksmith. If Grid hadn't joined up with the Tzedakah Guild, he might be running a smithy now.\n\n\"Do you make a lot of money?\"\n\nGrid estimated Steng was around 18 years old. Based on the fact that he was British, he might already have a license.\n\n*With these looks and driving a supercar, he can change lovers every week...*\n\nGrid had a bias towards good-looking people, making him feel envious. Steng scratched his head and shrugged.\n\n\"Hehet... I can support my grandmother and my sister on behalf of my deceased parents. I'm always happy and thankful for this fact.\"\n\n\"...\"\n\nSomehow, Grid felt like he hadn't grown up yet. As soon as he made a fortune and cleared his debts, Grid bought an 800 million won car. He coughed as the temperature of the furnace reached the ideal level. Steng watched Grid pouring in iron ore and clapped with admiration.\n\n\"Amazing! Your ability to adjust the fire is spectacular!\"\n\nApart from Grid, the other blacksmiths hadn't been able to start smelting iron ore yet. Adjusting the furnace to the desired temperature was simple and easy for him.\n\n*I think your skills are much worse than mine.*\n\nGrid clicked his tongue. Steng and the other blacksmiths weren't able to handle the fire as well as Panmir, the 1st ranked blacksmith who talked big at the press conference. Panmir was so sloppy he couldn't be compared to Khan.\n\n*This is the first ranked blacksmith.*\n\nIt was a disgrace to be nervous about dealing with someone with such low techniques. Grid shook his head and started to concentrate on smelting the iron ore. The impurities in the melted iron ore filtered out. The orange molten iron emerging from the furnace was brilliant and beautiful.\n\nThe eyes of the blacksmiths watching Grid widened.\n\n*How can he draw out molten iron with such high purity?*\n\n*So quickly...*\n\n*The power of his class!*\n\nThe blacksmiths admired and denied it. The reason for Grid's excellent smelting skill wasn't his experience and techniques, but a skill of his class.\n\nHowever, Steng thought differently as he watched from beside Grid.\n\n*This is Grid's pure talent!*\n\nGrid's movements were of the highest quality. Steng was 2nd on the blacksmith rankings, meaning he could recognize that such movements weren't possible by relying on the auto production system.\n\n*Grid is also doing manual labor!*\n\nSteng's enthusiasm grew. The legendary blacksmith was showing his true abilities, stimulating him. He wanted to do his best to compete with Grid and grow more from this experience.\n\n\"Grid! I look forward to going against you!\"\n\n\"In any case, it's a game of luck.\"\n\nSteng smiled cheerfully and also finished smelting his iron ore. Grid felt surprised by the skill that was different from Panmir and the other blacksmiths. He trembled as he once again felt the absurdity of the world.\n\n*This kid... A person who isn't a legendary blacksmith has such talent?*\n\nIt was also important to have innate talent. Life was also about talent.\n\n*How comfortable would I be if I had talent?*\n\nAs he recalled his past, Grid started hammering like crazy.\n\n**Chaaeng! Chaaeng!**\n\n\"...!\"\n\nSteng, who was making a frame for the sword shape prior to forging, froze. Grid didn't put the molten iron into the frame. Rather, he chilled it in water and started hammering at it on the anvil.\n\n*Going ahead with forging without the shape?*\n\nPouring the molten iron into the frame was important for the shape. No, it was an essential process. For a longsword like they were making now, the frame was required to balance the shape of the blade.\n\nYet Grid omitted that process. He just held it with tongs and started hammering at it.\n\n*What? Surely he hasn't given up on the game?*\n\nSteng lost concentration because of his agitation. He couldn't focus on the quality of his forging as he stared at Grid. It was because the shape wasn't made by the frame. Rather, the shape was gradually appearing under Grid's fingertips.\n\n\"Wow...\"\n\nGrid's skill transcended common sense. It was more amazing than any NPC Steng had met during his quests. Steng could indirectly guess how many items Grid had made in the meantime.\n\n*People have misunderstood!*\n\nWas it that easy to be the best in a field? It was impossible to be the best simply by luck. Thus, Steng couldn't understand or recognize the prejudice of those who dismissed Grid's abilities as luck simply because he was a legendary blacksmith.\n\nAnd he was sure of it at this moment.\n\nTo reach this place, Grid had been working harder than anyone else.\n\nAs Steng was feeling thrilled, Grid reheated the steel that was in the shape of a blade and kept forging. This was repeated a few times, increasing the strength of the steel. It was also done three times faster than ordinary blacksmiths.\n\n*Amazing... You're really amazing!*\n\nSteng was convinced.\n\n\"Grid, you are a genius who also puts effort in! I respect you!\"\n\n\"...?\"\n\n*A genius?*\n\nGrid scoffed. It was one of the silliest things he'd ever heard. Grid didn't know. From the moment he overcame his lacking talent, he had already crossed the wall of mediocrity.\n\n---\n\n\"Isn't this surprisingly interesting?\"\n\n\"It's exciting.\"\n\n8 hours of making items. People thought it would be boring. Nobody imagined it would be fine to watch blacksmiths hammering in front of a fire for 8 hours.\n\nBut the situation was different. Despite producing the same items with the same ingredients, the blacksmiths showed different methods of working. It was great to see them working up a sweat in front of hot flames.\n\nThe commentator's witty remarks during the work also made it engaging. They sat with friends, family, or lovers, and 8 hours passed in a flash.\n\n『 The participants have started to complete their items! 』\n\n『 Ohh...! Look at that glistening sword! Amazing! 』\n\nThe swords that the 23 blacksmiths made got a close-up in turn. The basic appearance was the same, but each sword was slightly different.\n\n『 Hey! The 1st ranked Panmir and 2nd ranked Steng have made <span class=\"rarity-mythic\">Unique</span> rated swords! The other blacksmiths also made <span class=\"rarity-epic\">Epic</span> rated or <span class=\"rarity-rare\">Rare</span> rated swords with added options... Eh? 』\n\nThe information of the swords was disclosed to the audience and viewers. The MC who entered the stadium and checked the longswords was confused.\n\n『 L-Legendary blacksmith Grid was the only one who made a Normal rated sword...? 』\n\n\"Normal?\"\n\nThe viewers doubted their ears as the camera zoomed in on Grid.\n\nWhether he knew it or not.\n\n\"Shit...\"\n\nGrid's expression twisted. He eventually couldn't resist cursing.\n\nThe world was in turmoil."
}