{
  "id": 442,
  "title": "Chapter 442",
  "content": "> [You are extremely concentrated and the Legendary Blacksmith's Patience skill has been activated.]\n> [Vitality, defense, and dexterity will rise by 200% for one hour.]\n> [The production of the 'Longsword' has been complete!]\n> [The skill level of (Understanding of Gods' Weapons) Legendary Blacksmith's Craftsmanship Skill has increased from level 7 to level 8!]\n> [The (Witness of God's Weapon) Legendary Blacksmith's Craftsmanship Skill Lv. 8 has increased the item's stats by 20%.]\n\nGrid's stomach dropped.\n\n*Wait. No. Not now.*\n\nThe Legendary Blacksmith's Breath activated far less frequently than Patience. The skill still had **0.2%** left before leveling. So why had it triggered?\n\nHis hands went cold. *This can't be...*\n\nWhat if the item he had to surrender carried a legendary rating? The thought sent ice through his veins.\n\n> [The Legendary Blacksmith's Breath Lv. 6 has been activated.]\n> [The Legendary Blacksmith's Breath Skill Lv. 6 has increased the item's stats by 8%.]\n> [The growth type item, 'Sealed Transcendent Long Sword' has been successfully produced!]\n> [As the first player to produce a growth type item, the title 'Person who has Reached the Absolute Truth of Battle Gear' has been acquired.]\n> [The title effect 'increased item experience gain' passive will always apply!]\n\n\"Ah...!\"\n\nThe sound tore out of him. An item greater than legendary. Gone. Just like that.\n\nGrid's vision blurred at the edges. It was the same sick vertigo as watching a lottery ticket with winning numbers slip through his fingers.\n\n\"...Ah!\"\n\nThe word came out strangled.\n\n***\n\nGrowth type items.\n\nThey became stronger with use. Experience accumulated through PvE and PvP, increasing the rank. Their base stats exceeded items of equivalent rating. Every rank increase brought dramatic stat gains. The items fell into two categories.\n\nFirst, items containing a specific soul. Each rank increase awakened skills or attributes the soul possessed in life. The number and power varied based on the soul's rating. Compatibility with the master was uncertain. A special story accompanied the soul, often hiding quests within.\n\nElfin Stone's Ring and Iyarugt from the Elfin Stone raid belonged to this type. Nobody yet knew their soul ratings.\n\nSecond, soulless items. One option added per rank increase. The options tailored themselves to the user rather than manifesting randomly. Higher ratings meant better compatibility. It functioned like class-specific equipment. More stable than souled items, but lacking dramatic power spikes.\n\nGrid's Sealed Transcendent Sword belonged to the second type.\n\n*The value is astronomical.*\n\nThe world held its breath.\n\nHundreds of thousands packed the Stade de France National Stadium. Millions watched through screens. Silence pressed down like a physical weight. Of all those people, 99.99% understood the concept of growth type items. But understanding and seeing were different things. The impact of Grid's creation hit like a shockwave.\n\n*Most players will never own one in their entire lives.*\n\n*Grid just made it with his own hands.*\n\nNot just a legendary blacksmith. Every footstep Grid left behind carved itself into legend.\n\nThe host's voice cut through the stillness.\n\n『 As announced, the screening criteria for this match is 'value.' 』\n\nThe screen displayed 23 swords produced by the competing blacksmiths.\n\n『 Value is measured by 'rating' and 'performance.' As you can see, Panmir and Steng produced the highest rated swords, while Panmir achieved the best performance. 』\n\nGrid's work went unmentioned. The logic was simple. Superior performance required higher ratings. Grid's growth type longsword carried a normal rating. Its current performance fell below Panmir's longsword.\n\nBut only for now.\n\nThe thirteen judges stirred.\n\n『 We must consider potential value. 』\n\n『 The item with the highest potential is Grid's longsword. 』\n\n『 Performance increases as rating climbs higher. 』\n\n『 Grid's longsword will inevitably surpass Panmir's longsword in performance. 』\n\n『 Furthermore, Panmir's longsword carries a disadvantage. Usage conditions have been added. 』\n\n『 Excellent performance, but increased usage conditions decrease both usefulness and overall value. 』\n\n『 Thus, the thirteen judges have decided that Grid's work is superior. 』\n\n『 We award the gold medal to Grid. 』\n\nNo backlash came. The logic left no room for argument.\n\n\"Waaahhhhhhhh!\"\n\nThousands of voices merged into a single roar. Celebration crashed over the stadium in waves. Even Panmir accepted defeat with a dignified nod.\n\nGrid wanted to throw the gold medal in the trash.\n\n\"I'd rather have my sword than some piece of metal.\"\n\nThis competition had taught him the secret. How to create a growth type item. Follow the existing production method, but impose power the method itself couldn't realize. Simple in theory. Hellish in practice.\n\nWhat happened when he crafted items normally? Even if he produced 1,000 or 10,000 pieces in the future, his cursed luck made the odds laughable.\n\n\"Dammit...! Give me my sword!\"\n\nDesperation clawed at his throat. He'd get that Sealed Transcendent Sword back from the host's hands. By force if necessary.\n\nFortunately, the mute option saved him. His words didn't broadcast.\n\n\"What is Grid saying?\"\n\n\"Doesn't he look angry at the host?\"\n\n\"Why can't we hear his voice?\"\n\nMurmurs rippled through the crowd. The strange atmosphere registered with those paying attention.\n\nDirector Yoon Sangmin of the S.A. Group approached with the French prime minister. Time for the medal ceremony.\n\n\"Ohh, Grid. Nice to meet you. I watched your performance well~\"\n\nThe French prime minister's Korean came out mangled but enthusiastic. Few people in the world would refuse a handshake from a high-ranking foreign politician.\n\nGrid didn't even look at him.\n\nHis eyes locked on the longsword. His fists clenched white-knuckled. Rage built like steam in a sealed kettle.\n\nDirector Yoon Sangmin leaned in close.\n\n\"Grid, your work will be displayed forever in the Hall of Fame. It will receive endless praise. Countless people will appreciate your creation and honor your achievement. Your value increases. Don't fixate on immediate benefits. Calm down.\"\n\nThe message came through clear. Rules were rules. Breaking them brought only damage.\n\nGrid recognized the warning for what it was. He swallowed his fury like broken glass.\n\n\"...Damn.\"\n\n\"...\"\n\n*Snap!*\n\n*Snap snap!*\n\nCameras captured the moment. The French prime minister, barely suppressing his displeasure, placed a gold medal around Grid's neck. Grid's expression could curdle milk.\n\nShouldn't a gold medalist be rejoicing? Grid's current appearance echoed Sohn Kichung at the Berlin Olympics.\n\nMiserable.\n\n***\n\n\"I'll surpass you in the next National Competition.\"\n\n\"Grid, I learned so much today! A valuable experience! If we get the chance, let's meet again!\"\n\n\"...\"\n\nThe words of the other blacksmiths, Panmir and Steng included, bounced off Grid's ears. He'd retreated deep into his own head.\n\n*Why am I so unlucky?*\n\nHe'd accepted long ago that luck wasn't his strong suit. But he'd never imagined this particular curse would drag at his heels for his entire life.\n\n*Why does it create a masterpiece only when I can't keep it?*\n\nWhy not during the thousand other times he'd stood at the forge? \n\n*Damn it all.*\n\n\"...Wait.\"\n\nGrid stopped mid-stride in the corridor. A smile crept across his face, unbidden.\n\n*If I keep resisting. If I keep giving my best. Maybe I can overcome even this rotten luck.*\n\nJust a trial. That's all this was. At this moment, understanding crystallized. He could overcome the ordeal heaven itself threw at him.\n\n*Fine. Let's see who wins.*\n\nHe'd be the one standing at the end. Just like always.\n\nGrid vowed to fight the heavens themselves. Time for mind control.\n\nHe forced himself to review the National Competition objectively.\n\n*I gained many things.*\n\nThe secret to crafting growth type items. Gold medals. The sword was a small sacrifice to obtain such precious knowledge. When he framed it that way, his mind settled.\n\n\"Interesting.\"\n\nThe same fact, seen from a different angle. Most people understood this instinctively. Grid only grasped it now, as maturity slowly infected his worldview.\n\nHe started humming as someone approached down the corridor.\n\nThe long National Competition was finally reaching its conclusion."
}