{
  "id": 443,
  "title": "Chapter 443",
  "content": "\"Grid!\"\n\nThe shout cut through the noise. Grid turned. Katz stood there, the Blood Warrior himself, fists clenched at his sides.\n\n*What the hell is he doing here?*\n\nGrid had no real connection to Katz. Not anymore. Back when he'd been nobody, just a beggar with calloused hands, he'd taken the Ideal Dagger to +6 and strutted to the market to show off. Instead, he'd found Katz casually inspecting a +8 weapon. The memory still made his jaw tighten.\n\n\"What do you want?\"\n\nGrid's tone was flat. Suspicious.\n\nKatz didn't waste time. \"Make me a growth type item. I'll pay whatever you ask.\"\n\n*Of course.* Grid almost laughed. *Diamond spoon through and through.*\n\nKatz came from money. Real money. The kind that could buy countries, not just gear. His father ran one of Japan's biggest conglomerates. Grid had heard the stories.\n\n\"Unfortunately, I'm not accepting production commissions.\"\n\nThat was half true. Grid wouldn't accept commissions from just anyone, and he sure as hell wouldn't prioritize someone like Katz. Growth type items were rare. The Overgeared members came first.\n\nKatz's face twisted. His jaw worked like he was chewing glass. \"Kuoh...\"\n\nGrid braced himself. He'd heard the rumors. Rogue. Trash. Arrogant. He expected threats, maybe a tantrum. Rich kids didn't handle rejection well.\n\nBut Katz surprised him.\n\nThe Blood Warrior inhaled slowly. His shoulders dropped. When he spoke again, his voice had changed. Quieter. Almost humble.\n\n\"What do I have to do to qualify for your items?\"\n\nGrid blinked. *Look at this guy.*\n\nKatz was desperate. That much was obvious now. The way he stood there, pride swallowed, waiting for an answer. He'd do anything to get what he wanted. Anything.\n\n*Can I use him?*\n\nThe thought arrived fully formed. Katz had value despite his shitty personality. High rank. Deep pockets. Connections in Japan. Lauel could make something of that.\n\nGrid made his decision.\n\n\"Go and ask Lauel.\"\n\nKatz frowned. \"Your chief of staff?\"\n\n\"Yes. If you want one of my items, fulfill Lauel's request. I'll make you something depending on his decision.\"\n\n*Lauel will know what to do with him.*\n\nKatz stood silent for a moment. Then he nodded once, sharp and controlled. \"I understand.\"\n\nHe turned and walked away. Grid watched him go, shoulders straight, fists still clenched. A bitter satisfaction curled in Grid's chest.\n\n*Two years ago, he wouldn't have even looked at me.*\n\nIt wasn't just Katz. Now that his blacksmithing abilities were public knowledge, more would come. Rankers. Guild masters. People who used to spit on him would grovel for his work.\n\n*I'm really a big shot now.*\n\nThe pride swelled hot in his throat. He'd made it. Actually fucking made it.\n\nBut Grid caught himself. He remembered the backlash after the first competition. The hate. The scrutiny.\n\n*Don't get cocky. Stay careful.*\n\nToo many eyes were watching. One mistake and they'd tear him apart all over again. He exhaled slowly and headed for the waiting room.\n\n***\n\n\"Congratulations.\"\n\nYura's voice was warm. She stood near the couch, arms crossed but smiling.\n\nPeak Sword pumped his fist. \"God Grid! I knew you'd do it!\"\n\nThe Korean team's waiting room felt smaller with their energy filling it. They were genuinely happy. Not because Grid's gold medal pushed South Korea closer to first place overall, though that helped. They were happy *for* him.\n\nGrid felt something unfamiliar catch in his throat. \"Thank you for always encouraging me.\"\n\nHis voice came out softer than intended. He sat heavily on the couch and leaned back.\n\nPeak Sword's smile faltered. *Why's God Grid acting weird? Did something happen?*\n\nThen it clicked. *The growth type item.* Grid had been forced to sell his creation. Watching it go to someone else had to sting. If Grid was mentally shaken, would he be able to perform in the pet marathon?\n\n*Shit. I need to fix this.*\n\n\"I'm going to close my eyes for a while.\"\n\nGrid lay back fully and shut his eyes. He wanted to log into Satisfy and check Noe's status window again, run the numbers one more time. But there wasn't time.\n\nTen minutes. That's all he got before the call came through. As a pet marathon participant, he was required to attend the press conference.\n\nGrid groaned. \"There are no breaks.\"\n\nYura shrugged. \"Time is limited. It can't be helped.\"\n\nThis was why most players avoided doing two events in one day. The mental strain alone could wreck you.\n\nPeak Sword watched Grid stand. The dark circles under his eyes were getting worse. \"You must be tired from hammering for eight hours. How about I go to the press conference instead?\"\n\nGrid shook his head. \"I don't know about Huroi, but making you my spokesperson...\"\n\n*Do you know?*\n\nThe memory of Peak Sword's last press conference appearance made Grid wince. Still, Peak Sword was marginally better than Huroi. Grid imagined the Orator verbally eviscerating reporters for thirty minutes straight.\n\n*Yeah. No.*\n\n\"I'll go.\"\n\n***\n\n\"Hoh... Grid said something like that?\"\n\nLauel sat in the audience section overlooking the pet marathon course. Katz stood beside him, stiff and uncomfortable. Lauel's smile widened.\n\n*Grid's learning how to handle people.*\n\nSending Katz directly to Lauel instead of dealing with him himself showed tactical thinking. Grid was delegating, using his position as leverage. That was growth.\n\n*He used to be so slow.*\n\nGrid had always been behind. Same opportunities as everyone else, worse results. But something had changed after the Behen Archipelago. His growth rate had accelerated dramatically.\n\nLauel's unique laugh bubbled up. \"Kukukuk, this is interesting.\"\n\nKatz's face went pale. His hands clenched.\n\n*Katz.*\n\nLauel assessed him clinically. S-class potential. Power, wealth, and connections in Japan's gaming industry. The personality was garbage, sure, but most of Overgeared's core members were weird anyway. Vantner was a naked berserker. Huroi insulted people for a living. Katz would fit right in.\n\n*Better to recruit him.*\n\nLauel tilted his head. \"I know you have the power to join guilds. Why haven't you?\"\n\nKatz's jaw set. \"I don't like being interfered with. I dislike rules.\"\n\n\"Wow.\" Peak Sword, sitting nearby, snorted. \"You would've fainted if you were born South Korean. Mandatory military service.\"\n\nKatz glared at him. \"I would've gotten out of it. No, why are you suddenly asking this?\"\n\nLauel's smile sharpened. \"Join the Overgeared Guild.\"\n\n\"You want me in Overgeared?\"\n\nKatz's face twisted like he'd bitten something rotten. \"I don't want to.\"\n\nThe refusal came instantly. Lauel had expected that. He just laughed.\n\n\"You don't have to if you don't want to.\" Lauel examined his fingernails. \"You'll never obtain Grid's items, though.\"\n\nKatz went very still. His eyes betrayed him, though. Hunger. Raw and obvious.\n\n*Of course he wants them.*\n\nKatz was aiming for first place in the rankings. He'd declared that goal two years ago, loud and public. But he'd failed. His skills weren't enough. His gear wasn't enough.\n\n*He has nothing to lose by joining.*\n\nLauel's confidence was absolute. He grinned, and the expression was pure Grid. Wicked. Calculating. \"Join Overgeared.\"\n\n*Become Grid's slave.*\n\nHe didn't say that part out loud.\n\n\"However, if you want to join Overgeared, you have to beat Grid in PvP.\"\n\nKatz's head snapped up. \"Beat Grid?\"\n\n\"Yes. You're able to defeat him.\" Lauel leaned forward. \"Your fighting style is a good match against Grid. How about it? If I tell you how to beat Grid, why don't you try it once?\"\n\nKatz stared at him. *Isn't Lauel the closest person to Grid?*\n\nWhy would Grid's chief of staff want Grid eliminated? But Katz didn't ask. He'd grown up watching friendships crumble under the weight of money and ambition. Betrayal wasn't shocking. It was expected.\n\nWhat Katz felt now was anger.\n\nHis fists shook. \"You'll teach me how to win against Grid? Stop talking nonsense! I can beat Grid with my own power even if you don't tell me!\"\n\nKatz wasn't the same person who'd first obtained the Blood Warrior class. He'd learned hard lessons since then. Money didn't solve everything. Talent had limits. He'd given up arrogance out of necessity, replaced it with cold realism.\n\nHis declaration that he could beat Grid wasn't bravado. It was calculated judgment.\n\n\"Okay. I'll beat Grid.\" Katz's voice dropped. \"In addition, I don't care how you use me. I'll do anything if it means getting Grid's items. However, if you use me and then stab me in the back, be prepared. I'll put my whole power into killing you in the game.\"\n\nLauel's grin widened. \"Huhuhut... Our agreement has been established.\"\n\nGoosebumps crawled up Katz's arms.\n\n***\n\nFifty-three people participated in the pet marathon. An average of 1.5 representatives per country. They sat in rows facing hundreds of reporters, cameras flashing like artillery fire.\n\n\"Grid has hell's best demonic beast, a memphis.\" One reporter leaned forward eagerly. \"In last year's National Competition, the memphis beat dozens of wyverns alone. It's the opinion of many people that Grid will win the pet marathon this year. What do you think?\"\n\nCould the other players compete? That's what everyone wanted to know. The crowd leaned in.\n\nThe players answered with practiced confidence.\n\n\"There's nothing perfect in Satisfy.\"\n\n\"We've already grasped Noe's weakness and figured out a strategy.\"\n\n\"Noe won't win Grid a gold medal!\"\n\nGrid sat at the end of the row, watching them shout and posture. His expression was flat. *Isn't this tiring?*\n\nThe pattern repeated every single event. Before the match started, everyone talked big. Confidence. Bravado. Then they lost.\n\n*Same shit, different day.*\n\n***\n\nThe pet marathon began thirty minutes after the press conference ended.\n\n\"Nyang!\"\n\nNoe materialized at Grid's side in a flash of dark smoke. He'd been eating well for a year, and it showed. His black fur gleamed like polished obsidian. His tongue was vivid pink. The pads on his feet looked impossibly soft.\n\nNoe's stomach protruded slightly as he struck a pose. \"The best demonic beast of hell has emerged! Nyang!\"\n\nHis ㅅ-shaped mouth opened wide in a complacent grin. The crowd erupted.\n\n\"Fearsome guy...\" One player summoning a wyvern shook his head in admiration. \"The level of cuteness increased so much that his level must've risen tremendously.\"\n\n\"He'll be a tough opponent.\"\n\nThe players eyed Noe warily. But their confidence didn't waver. Over the past year, they'd gathered information. They'd studied recordings of last year's competition frame by frame. They understood the memphis's weakness now.\n\nThey had counter-strategies prepared."
}