{
  "id": 444,
  "title": "Chapter 444",
  "content": "Fifty-three players had entered the pet marathon. Fifty-two of them were pet specialists. Their classes belonged to the monster tamer series, giving them an edge in understanding animal behavior and collecting field data that Grid lacked. They'd studied the Memphis. They'd developed a counter.\n\n*Even if it's called the best demonic beast of hell...*\n\n*In the end, a Memphis is just a cat monster.*\n\n*A cat monster has many weaknesses.*\n\nConfidence spread across their faces. After the wyverns, they began summoning additional pets. The choices were unexpected. Instead of powerful combat beasts, they called forth insects. Giant glow worms. Gold cockroaches. Light butterflies. Creatures with weak combat ability and low intelligence. The kind that most tamers avoided.\n\n\"What?\"\n\n\"Aren't they going to try their best?\"\n\nThe spectators stirred. To win the pet marathon, you needed combat ability, agility, and endurance. The pets had to reach the destination first while suppressing rivals. So why summon weak insect types? Confusion rippled through the crowd.\n\nThe experts, however, caught on immediately.\n\n『 The players understand the weakness of cat monsters. 』\n\n『 For viewers unfamiliar with the strategy, observe the common trait: each summoned pet produces its own light. 』\n\n『 Cats are sensitive to light. They possess an instinctive drive to chase moving illumination. 』\n\n『 The giant glow worms, gold cockroaches, and light butterflies will counter the Memphis. 』\n\nThe three monster types all emitted light. The worm-like giant glow worm, two meters long, produced a gentle glow from its tail. The gold cockroach flashed intense bursts of gold. The light butterfly's wings radiated a luminous shimmer. Beautiful lights designed to mesmerize prey.\n\nNoe's mouth twitched.\n\n\"Nyong. Nyong nyong.\"\n\nHis pupils dilated. A strange sound escaped him as he flattened against the floor, chubby rear in the air. He shook his backside left and right, transfixed by the glowing lights. He looked like a cat stalking a mouse.\n\n\"What are you doing?\"\n\nGrid stared at Noe's bizarre behavior. He urgently checked the status window.\n\n> **Status:** Committed\n> \n> *(I must catch these shiny things! Nyang! I was born into this world to hunt them! Nyang nyang!)*\n\n\"This is...\"\n\nGrid knew one weakness. The tail. He'd crafted a tail guard specifically for that vulnerability. But this blindside hit him hard. Grid's expression turned blank.\n\n『 The match begins! 』\n\nThe referee's shout rang out. A magic bead exploded. The signal fired. Wyverns at the starting line spread their wings and launched skyward. The other players closed in on Grid as they watched the wyverns disappear into the distance.\n\n\"How about it, Grid?\"\n\nA player smirked.\n\n\"Aren't we different from the last National Competition?\"\n\nLast year and this year were worlds apart. This year was professional. Last year's participants had wyverns, sure. But this year? Pet specialists. Unlike last year's amateurs, they possessed the tools to counter Noe.\n\n\"...\"\n\nGrid remained silent. The players read it as resignation.\n\n\"Well, you don't have to be ashamed. We're the best in our field.\"\n\nAnother player nodded. \"Yes, Grid. Don't bear bad feelings toward us. You couldn't beat us in this event from the start. No one will criticize you.\"\n\n\"...\"\n\nGrid's silence stretched.\n\n\"Nyong nyong. Nyong.\"\n\nNoe crept forward, stalking the lights. The players shrugged.\n\n\"Don't even think about resisting. Can't you only have three pets without a skill? And you can only summon two at a time, right?\"\n\n\"On the other hand, we can summon up to five simultaneously. Even if you call a wyvern-class pet, we'll summon something new and neutralize it.\"\n\nOne player laughed. \"Haha, you probably want to hold a sword and fight directly, but you can't. This is the pet marathon stage. You're not allowed to move. Just watch.\"\n\n\"Five at a time...\"\n\nGrid finally spoke. A meaningful smile crossed his face.\n\n\"Isn't it strange? If you can summon five pets, why are you only summoning two?\"\n\nNone of the players had called forth more than the wyvern and a single Noe counter. It was like an unspoken rule. Grid studied the players preparing to chase the drakes beyond the horizon.\n\n\"If you summon several pets at once, doesn't it get harder to control? Similar to how your control weakens when your wyvern flies further away.\"\n\n\"...\"\n\nThe players felt inward embarrassment. Grid spoke as if he'd just discovered common knowledge everyone already knew.\n\n\"Well, I guess you learned that by yourself...\"\n\nThey decided to ignore Grid and move quickly. Noe had been neutralized. They no longer viewed Grid as a threat. Victory was all that mattered now.\n\nThen it happened.\n\n\"Kyong!\"\n\nNoe, charging toward the giant glow worm, screamed in pain. Invisible threads spread like a fortress around the worm's body had caught him. The players saw Noe writhing and smiled with satisfaction.\n\n*That's it. Grid is completely contained.*\n\n*The real game begins now.*\n\nThey celebrated blocking the only variable. But they'd missed something. Grid's hidden hand.\n\n\"Come out, Randy.\"\n\nJeurereuk.\n\nBlack liquid poured from Grid's pet inventory at his command.\n\n*Slime?*\n\nThe players stared in confusion.\n\n\"What can you do with a slime?\"\n\n\"This is too shabby for a last hurrah.\"\n\nGrid wasn't a pet expert. He might've lucked into a Memphis through a raid or quest, but taming additional pets would be difficult. So he'd brought this slime. The players found it almost cute.\n\n\"Turn into me.\"\n\nGrid issued a bizarre command. The black liquid wriggled. Then it did something surprising. It transformed into Grid.\n\n\"It wasn't a slime, but a doppelganger?\"\n\n\"I've never heard of a black doppelganger.\"\n\nThe players looked impressed. Doppelgangers had versatile uses, but they were A-grade monsters. Difficult to tame unless you were a high-quality pet trainer. Grid's doppelganger seemed different from standard variants. That created some wariness.\n\n\"He has talent at scaring people.\"\n\n\"He truly deserves to be called God Grid. Very versatile.\"\n\nThey clapped. Curious, but not particularly tense. Doppelgangers didn't possess high combat ability. A doppelganger dominated as a pet had severely weakened stats. It could only copy 10% of its master's abilities. Even if Grid's was a named monster, it couldn't exceed 15% of his stats.\n\n*This isn't worth watching.*\n\nThe insect monsters they'd summoned could easily handle a doppelganger. Randy crushed that confidence.\n\n\"Pagma's Swordsmanship.\"\n\n\"...What?!\"\n\nThe doppelganger could copy skills? Legendary rated skills? The players finally grasped the severity of the situation. They frantically tried to summon new pets.\n\n\"Wave.\"\n\nKwa kwa kwa kwang!\n\nWaves of energy erupted outward, slamming into dozens of giant glow worms, gold cockroaches, and light butterflies.\n\n\"The level of those hastily obtained as a countermeasure for Noe wouldn't be high.\"\n\nGrid watched dozens of ash pillars rise toward the sky.\n\n\"I'm sorry, but I'm going to take the gold medal.\"\n\nGrid had been aware for a long time. He needed to be careful with his words to maintain his prestige as master of Overgeared and lord of Reidan. He didn't speak lightly. That's why at the press conference before the National Competition, when he'd declared 'South Korea would win at least five gold medals,' he'd already been certain of victory in the pet marathon.\n\n\"Catch them, Noe.\"\n\n\"Nyang!\"\n\nNoe recovered his spirit and moved with energy. His speed completely exceeded the wyverns as he followed their flight path.\n\n\"Shit! Stop him!\"\n\nThe players summoned all their battle pets at once, trying to intercept Noe. For this moment, they allied.\n\nGrid's voice remained calm.\n\n\"I'll leave it to you, Randy.\"\n\n\"Believe in me.\"\n\nClink!\n\nRandy had copied Pagma's appearance and defeated Grid eighty-two times in the past. When he reached level 240, the **Copy** skill strengthened. The strongest doppelganger slowly regained his former power. Now he faced dozens of pets alone. The world held its breath.\n\nGrid's legend was being written."
}