{
  "id": 445,
  "title": "Chapter 445",
  "content": "Randy's original Copy skill allowed him to replicate **30%** of his master's stats and two random skills. But at level **240**, Randy evolved. He could now copy **35%** of Grid's stats and three skills. The skill levels didn't matter.\n\n*Won't he be able to copy me perfectly someday?*\n\nGrid considered the possibilities. It wasn't baseless optimism. He'd learned that ordinary doppelgangers couldn't copy legendary skills. Randy had been different from the start, the moment he first mimicked Pagma's appearance.\n\n\"Pagma's Swordsmanship.\"\n\nPets were classified as monsters. Grid equipped the <span class=\"rarity-legendary\">Efficient Hunting Sword</span> before summoning Randy. Its bonus damage against monsters would turn Randy into a weapon.\n\nRandy materialized in Grid's image. He gripped the copied sword and tore through the enemy pets. The wyverns were stronger, but these creatures were fodder.\n\n\"Link.\"\n\n*Pit!*\n\n*Pipipipipit!*\n\n\"Kyaak!\"\n\n\"Kuwek!\"\n\nDozens of pets fell to Randy's blade. They couldn't withstand his assault.\n\n\"Kuwaaaah~!\"\n\nA massive two-headed hippopotamus charged forward, its bulk slamming into Randy's legs. The creature absorbed Randy's strike with hide like armor, then used its 3.5-ton weight as a bludgeon.\n\n*Kuuong!*\n\n\"Uh...!\"\n\nBlood spilled from Randy's mouth. Even the copied <span class=\"rarity-legendary\">Triple Layers</span> couldn't fully protect him. A quarter of his health vanished, pain twisting his features.\n\n*I'm sorry.*\n\nGrid knew Randy's story. The loneliness. The century of waiting. He wanted Randy to find happiness. But the world didn't work that way. Every crisis Grid faced, Randy bled for him. Especially after Randy learned to swap positions. Grid used him like a shield more and more.\n\nGuilt stirred in Grid's chest. Then stopped.\n\n*Happiness is victory.*\n\nRandy needed strength to win. To survive. Grid would make him stronger, and through that strength, Randy would seize happiness with his own hands. That's what pets were for. Growing stronger.\n\n*I'll keep pushing you.*\n\nRandy shivered, as if sensing Grid's intent. He dodged the hippo's second charge and activated Revolve. The counterattack landed perfectly. Belatra, the American master of the hippo, gasped.\n\n\"He pierced Jeep's hide in one blow!\"\n\nJeep ranked in the top three for defensive power among large monsters. A tank-type pet, level **210**, fed premium food and raised with care. Yet a third of his health disappeared in a single exchange.\n\n\"What the hell *is* this doppelganger?\"\n\nWhile Belatra froze, Randy identified the weakness. Long body. Short legs. He circled to the hippo's blind spot and struck.\n\n\"Kuwaaang!\"\n\nThe hippo wailed. The commentators erupted.\n\n『 A pet using counterattacks! Grid's doppelganger must have NPC-level artificial intelligence! 』\n\n『 Absolutely. Grid isn't just overgeared... his pets are, well, they're remarkable. 』\n\n『 Truly elite! 』\n\nThe previous National Competition saw Grid win three gold medals alone, pushing South Korea to second place. Most believed he couldn't repeat that feat. But now? Now Grid was shattering expectations.\n\nNoe's demon wings spread wide, his chubby legs and tail propelling him forward. The commentators speculated he was flying faster than any monster in the marathon, closing on the wyverns.\n\n『 Could Grid actually become a myth? 』\n\nEveryone thought it impossible. Not anymore. If Grid won gold in the pet marathon, that would be four gold medals by himself. South Korea would rise from third to first. One man carrying an entire nation.\n\nA record worth immortalizing.\n\n『 Wait... could Grid even take gold in PvP? 』\n\n『 Haha, then Korea's first place would be locked in? 』\n\n『 Haha, impossible. Kraugel's participating in PvP. 』\n\n『 True. Even Grid can't beat the sky above the sky. 』\n\nThe commentators laughed. Randy and the pets continued their battle.\n\n\"Shit! We're burning everything!\"\n\nDespite their alliance, the other players couldn't bring Randy down. Panic set in. They summoned fresh pets to overwhelm him. Randy's momentum faltered after burning through stamina and cooldowns to kill the hippo.\n\nThe monster tamers commanded beasts they'd spent months taming. Randy was Grid's pet, high-leveled and dangerous, but fifty-two enemies were fifty-two enemies.\n\n*Chaaeng! Chaeng!*\n\nRandy retreated, unable to counter. Wounds accumulated across his body, slowing him. The crowd and viewers erupted in boos.\n\n\"They're ganging up on one player! Why isn't the referee stopping this?\"\n\n\"It's disgusting. No matter how strong Grid is, fifty-two people focusing on him—\"\n\n\"Grid and Overgeared fought fair when they faced each other. What about these bastards? Where's their honor?\"\n\n\"Right? Grid and Overgeared are competing for their nation's pride. That's what this tournament is for.\"\n\n\"Completely different from the Seven Guilds.\"\n\n\"Hey, you bastards! Fight properly! This isn't a pet marathon, it's a Grid raid!\"\n\nPublic outrage surged. Internet forums exploded. The referee moved to intervene.\n\n\"It doesn't matter now.\"\n\nGrid spoke quietly while the world raged. The commentators screamed.\n\n『 Noe has caught the wyverns! 』\n\n『 Despite starting five minutes late! A memphis truly is hell's greatest demonic beast! 』\n\n『 The players made a critical mistake. They were so obsessed with Randy, they summoned too many pets. They couldn't manage the wyverns in the distance. The wyverns lost formation. 』\n\n『 Noe seized the opening! 』\n\n『 Ah! Noe just devoured the wyverns' souls! Look at that acceleration! He's even faster than before! 』\n\nThe debate ended. Grid won the pet marathon. Fifty-two specialists crushed by two pets. Grid's creatures were something else.\n\n***\n\n**1st. South Korea (5 gold)**  \n**2nd. United States (4 gold, 4 silver, 5 bronze)**  \n**3rd. Russia (4 gold, 3 silver, 2 bronze)**  \n**4th. Canada (3 gold, 3 silver, 3 bronze)**  \n**5th. Spain (1 gold, 2 silver, 1 bronze)**  \n**6th. Japan (1 gold, 3 bronze)**  \n**7th. Brazil (1 gold)**  \n**8th. United Kingdom (4 silver)**  \n**9th. France (3 silver)**  \n**Joint 10th. Argentina, China (2 bronze)**  \n**12th. Turkey (1 bronze)**\n\n\"...\"\n\nKraugel's chest tightened as he reviewed the rankings. Grid had swept the blacksmithing game and pet marathon. Both events the US expected to dominate.\n\n*Grid, you are certainly great.*\n\nHow many could prove themselves the best in multiple fields? Grid was special. Unique in countless ways. Combat, blacksmithing, item utilization, pets. All elite.\n\nRespect swelled in Kraugel's chest. The fourth time he'd felt this toward another player. But he couldn't lose himself in admiration. Kraugel needed composure. Russia needed first place. His mother needed the medicine. He had to win gold in PvP. Even if he respected Grid, he couldn't show mercy when they met.\n\n\"I must win this time.\"\n\nTwo events remained. The individual carriage transport and PvP. The US had no more chances at gold. South Korea and Russia could both claim PvP gold, determining first place overall.\n\n\"Sigh.\"\n\nKraugel exhaled slowly. He began reviewing everything Grid had shown this competition. Surveys predicted Kraugel would dominate PvP with **92.3%** confidence. Three days remained."
}