{
  "id": 446,
  "title": "Chapter 446",
  "content": "\"Dammit!\"\n\nThe table shrieked across the floor. Zibal's boot connected again, sending it careening into the door frame. Wood splintered. The table collapsed in a heap of broken legs and shattered veneer. Hours of gym work translated into raw, destructive force.\n\nZibal stood over the wreckage, chest heaving. \"The United States... We lost first place.\"\n\nFor two centuries, America had led. Twenty-five Olympic golds. Dominance across every field of competition. The Satisfy National Competition should have been no different. The American people expected it. The players expected it. Victory was a foregone conclusion.\n\nBut one man changed everything.\n\n\"That crazy monster...\"\n\nZibal dragged both hands down his face. He'd stopped underestimating Grid after last year. Acknowledged the man's skill. Respected his growth. But this? This was beyond comprehension.\n\n\"Pure luck. Has to be.\" The words tasted like ash in his mouth.\n\nHe couldn't even convince himself. Zibal's shoulders sagged. A long breath escaped him. \"What has he been doing for an entire year? What kind of training creates... that?\"\n\nGrid had erased every weakness from the previous competition. Turned his strengths into weapons that dominated the arena. One year. Just one year for growth that should have been impossible.\n\n\"Was he always a genius?\" Zibal looked toward Lauel. \"Did he just... live carelessly before? Wasted his potential until recently?\"\n\nLauel kept his expression neutral. *The world misunderstands Grid entirely.*\n\nGrid wasn't a natural genius. He was a genius of effort. Of relentless, grinding work. But Lauel said nothing. He enjoyed watching Grid's star rise, enjoyed seeing the legend solidify in real time.\n\nZibal's rage found a new target. His eyes cut toward Panmir's empty chair.\n\n*That bastard. This is his fault.*\n\nIf Panmir hadn't provoked Grid. If he'd kept his mouth shut, Grid never would have entered the blacksmith production game. The U.S. would have secured first place. Clean. Simple. Instead, Panmir's ego had gutted their lead.\n\nZibal wanted to scream at him. Blame him for everything. But he couldn't. The Snake Guild needed Panmir. The blacksmith's value to the guild exceeded his value as a representative.\n\n\"Hah...\" Zibal forced air through his teeth. He bore responsibility too. The raid event. His loss. His failure.\n\nHe steadied himself. Looked at Lauel. \"Carriage transporting. Do we have a chance at gold?\"\n\nLauel shook his head. \"The event requires high eloquence or charm to keep the mercenary NPCs loyal. Zephyr is a master of deception, but he can't maintain it long enough. Silver medal at best.\"\n\nThe gold would go to a country with a merchant or orator. Grid could have swept it easily with his absurd charm stat.\n\n\"What about PvP?\" Zibal asked.\n\nLauel shrugged. \"I know Skull's strength. I've relied on him for critical roles during the siege. But he's not on the level of Grid and Kraugel.\"\n\n\"...\"\n\nZibal ground his teeth. The medal count mocked him. First place South Korea had five golds. Third place Russia had four golds, three silvers, three bronzes. The United States? Four golds, four silvers, five bronzes. On paper, America dominated in total medals.\n\nBut they'd lose the competition over one gold medal. One.\n\n\"If we could just win one more gold...\"\n\nThe media would eviscerate them. Last year, Zibal had led the U.S. to first place and still faced criticism for losing several golds to Grid. This year? Losing first place entirely? The backlash would be catastrophic.\n\nSkull spoke up from across the room. \"PvP isn't decided yet. Grid and Kraugel might face each other in the opening rounds. I might break one of them before they meet.\" He crossed his arms. \"I don't like giving up the championship before we've even fought.\"\n\nThe United States was the strongest nation. Their representatives were the best in their fields. Skull knew he fell short of Grid and Kraugel, but he'd never considered himself weak.\n\n\"I'm sorry, Skull.\" Zibal stood and offered his hand. \"I trust you.\"\n\nSkull walked past the extended hand without a glance.\n\n\"...\"\n\nZibal watched him go. The second-ranked player, reduced to a punching bag.\n\n***\n\n『 Spain is favored to win the carriage transporting event. First place in the overall rankings will be determined by PvP. 』\n\nThe National Competition schedule had been public for three months. After the pet marathon, a three-day break. Officially for player recovery. In reality? The French government wanted to milk tourism revenue, and broadcasters wanted extended advertising opportunities.\n\nCapitalism at its finest. And Grid, who rode that capitalist wave better than anyone, was finishing a call with Yook Shihyun from Comet Group.\n\n\"Then I'll ask you to perform well in the next event,\" she said.\n\n\"Only if you make the deposit.\"\n\n\"We've thoroughly calculated everything. I'll be in touch.\" Her laugh carried a flirtatious edge before the line went dead.\n\nYook Shihyun was young, influential, wealthy. Grid would make an ideal partner. She'd been calling him, arranging meetings, working extra hard to catch his attention. Wishful thinking.\n\n\"Pretty, charming, and competent\" wasn't enough. Grid was surrounded by women who outclassed her in every category. Yura. Jishuka. Irene. Grid's standards had been warped by proximity to exceptional women. They needed at least a D-cup minimum—\n\nGrid logged into Satisfy and checked Assimilation's status.\n\n> **[Assimilation]**\n>\n> Awakens Braham's sleeping consciousness and merges it with your body.\n>\n> Your class converts to 'Great Magician.' Control of your body transfers to Braham.\n>\n> **Skill Duration:** 3 minutes\n>\n> **Skill Cooldown:** 9 days, 13 hours, 7 minutes, 5 seconds\n\nThe normal cooldown was ten days. But closing the door to Hell had damaged Braham's soul, extending the cooldown by over eighty days. Grid hadn't been able to use it during the entire National Competition.\n\n*If the carriage event or PvP rounds drag out, I might have it for the finals.*\n\nHe didn't want to face Kraugel before the finals. Whether his prayers would be answered remained to be seen. Even if he reached the finals, the cooldown might not finish in time.\n\nGrid pulled out his hammer and repaired his equipment to perfect condition. He left the smithy.\n\nInstead of seeking out Irene as usual, he headed straight for the fields. Piaro stood among thousands of farmers.\n\n\"What grows when you plant beans?\" Piaro demanded.\n\n\"Beans!\" the farmers chorused.\n\n\"Pathetic! You still haven't seen the peak of agriculture!\" Piaro gestured sharply. \"How many times must I tell you? A real farmer grows beans and red beans simultaneously!\"\n\n\"Piaro, how can we possibly achieve that peak?\"\n\n\"You want both crops from the same field?\"\n\n\"You've moved hand plows a hundred thousand times daily and still haven't gained enlightenment...\" Piaro shook his head. \"It reminds me of someone.\"\n\n\"...\"\n\nGrid ignored the conversation and studied the farmers. They had sleek muscle wrapped tight beneath their clothes like armor. Bronze skin. Fierce eyes. They looked like warriors, not field workers. The former soldiers of Prince Ren, the ones Piaro had recruited from the Altes Mountains, had become full knights.\n\n*Insane.*\n\nWhat kind of hellish training had Piaro put them through? Grid admired Reidan's farmers. They'd grown stronger than the empire's elite soldiers. He approached Piaro.\n\nPiaro had already sensed his presence. He bowed. \"You're busier than anyone else. Why visit the fields?\"\n\nGrid got straight to the point. \"Am I still weaker than Kraugel?\"\n\n\"Yes.\"\n\nNo hesitation. No softening the blow. Grid had expected nothing less.\n\n*I'm a fool.*\n\nPiaro hadn't changed despite their master-subordinate relationship. Always honest. Always loyal. He didn't flatter his lord with convenient lies.\n\n\"Dammit... Fine. I understand.\"\n\nGrid had come seeking courage before the PvP event. Instead, he'd received cold reality. His steps were heavy as he turned away from the fields. Piaro remained bowing until Grid disappeared from view.\n\nThen he muttered, \"However, if you two fight, My Lord can win.\"\n\nKraugel was strong because of his mind and senses. He anticipated everything during battle. Predicted enemy behavior. Responded faster than humanly possible. But what if he couldn't predict Grid? Grid's combat style leveraged his items in ways even Piaro couldn't fully understand.\n\nSo why hadn't Piaro told Grid this?\n\nSimple. Grid hadn't asked who would win in a fight. He'd asked who was stronger. Without items, Kraugel's pure strength exceeded Grid's by a significant margin.\n\n\"Back to the rice paddies.\" Piaro gathered his farming tools.\n\nHe was Piaro. A farmer now."
}