{
  "id": 447,
  "title": "Chapter 447",
  "content": "# Chapter [Number]: Preparation and Confrontation\n\n\"Kieeeek!\"\n\n> [A junior vampire was destroyed.]\n> [4,901,000 experience has been acquired.]\n> [An intermediate vampire was destroyed.]\n> [6,954,300 experience has been acquired.]\n> [One deluxe magic stone has been acquired.]\n\nThree days until PvP. Nine days in Satisfy time. Grid planned to spend them hunting, stimulating his combat senses while raising <span class=\"rarity-unique\">Iyarugt's</span> experience. But it wasn't easy.\n\nHe opened the sword's information window.\n\n> [Iyarugt]\n> Rating: Unique (Growth)\n> Experience: 85.98%\n\nGrid frowned. *The experience gain isn't very good.*\n\nHe'd killed 40 junior vampires and 25 intermediate vampires, but the rate of experience increase was only 0.01%. The vampire cities were limited in the number of monsters. The vampires had excellent survival ability. The speed of hunting was slower. It all made Grid nervous. He wondered if he could raise <span class=\"rarity-unique\">Iyarugt's</span> rating in nine days.\n\n*I would rather fight against other rankers to quickly gain experience. Um... Are there any better hunting grounds around here?*\n\nHe missed the islands in the 50s on the Behen Archipelago where high-level monsters were scattered. But Grid's current save point was the 60th island. It was pointless to go to the Behen Archipelago because he couldn't move past the 61st island.\n\nGrid sighed. \"Information is really important.\"\n\nHe would've been able to overcome this shortage of hunting grounds if he had excellent information. If he knew this, he would've made efforts to gather information.\n\n\"Ah?\"\n\nGrid was smacking his lips together with regret when he recalled a conversation he had with Lauel a few months ago.\n\n*Now that Reidan has the basic facilities, we are planning to install special facilities.*\n\n*Special facilities?*\n\n*Now that we have the minimum infrastructure and an army by raising agriculture, industrial, and academic facilities to a certain level, we must focus on collecting and exchanging information. First of all, we are going to set up a foreign department and assassin organization. In addition, there will be an adventurer's guild where we can buy information from adventurer NPCs and players.*\n\n*Um, I see... You are quite busy. I believe you will do it well.*\n\nGrid stopped mid-step. \"This is really...\"\n\nAt the time, he didn't know the importance of information and laughed at Lauel's words. But now he realized the importance of information, allowing him to know how excellent Lauel's foresight was.\n\n*Lauel, if it wasn't for you, I would've given up by now.*\n\nHe wouldn't have been able to lead Reidan properly, making it decay and eventually giving up. Grid, who was once again grateful for Lauel's existence, deliberately allowed the vampire to attack his side. He counterattacked with <span class=\"rarity-unique\">Iyarugt</span>.\n\n> [Critical!]\n> [You have dealt 79,900 damage to the target.]\n> [You have absorbed 9,588 health due to the option effect of Elfin Stone's Ring (Epic).]\n\nWhat was one of the most important things in hunting? Was it the overwhelming attack power that could deal with the monsters? Was it the defense that could withstand the monsters' onslaught? No. No matter how high these two were, it was meaningless if the duration was short.\n\nOne of the most important parts of hunting was the endurance in combat. It was easier to hunt for a long time because of this endurance. Potions were a necessity for hunting. In general, players had to hunt while waiting for the cooldown of the potions, making it very tiring.\n\nHowever, Grid was different. Grid had <span class=\"rarity-unique\">Doran's Ring</span> that could restore damage, as well as <span class=\"rarity-epic\">Elfin Stone's Ring</span>, which had a bloodsucking effect every 12 seconds. He also had the most efficient potions from Reidan's alchemy facility, giving him the battle duration of a healer. No, he was probably as good as someone else. It was comparable to Blood Warrior Katz.\n\n*I would like to raise the rating of Elfin Stone's Ring.*\n\n<span class=\"rarity-epic\">Elfin Stone's Ring</span> didn't gain as much experience as <span class=\"rarity-unique\">Iyarugt</span>. The effect only occurred once every 12 seconds, so the experience was limited. Similarly, <span class=\"rarity-epic\">Tiramet's Belt</span> only accumulated experience when it was attacked, due to the nature of armor.\n\n*Still, if I compare the item experience rate to the rate before getting the buff, it's definitely faster.*\n\nIt felt 1.5 times faster? But it was still lacking. Grid was immersed in hunting and eventually left the vampire city. Then he sent a whisper to Lauel.\n\n\"Do you have information about any good hunting grounds?\"\n\nLauel's voice came through the whisper connection. \"No.\"\n\nHe answered emphatically.\n\nGrid paused. \"I see. Well, getting new information isn't that easy. I understand.\"\n\nIn the end, Grid was forced back into the vampire city. Meanwhile, Lauel apologized several times to Grid in his heart.\n\n*In fact, I got a new update about a hunting ground that is better than the vampire cities a while ago...*\n\nHe couldn't say it yet. Lauel didn't want Grid to grow. Why? Lauel was hoping Kraugel would win in PvP.\n\n*I can create any variables that will stop Kraugel from joining our team. Grid, this result is for you. Please forgive me.*\n\nIt was justified, but deceiving his master weighed on his heart.\n\nLauel sighed heavily. He covered half of his face with his hand and leaned against the wall.\n\n\"Alas, the greed of the loyalist is a terrible and beautiful thing...! But the tears of blood that I am shedding are for Grid. I can tolerate this pain forever...!\"\n\nThe hands and feet of the maids passing by Lauel curled in disgust. The road to the production of Lauel's 'Reidan Female NPCs Strategy' was long and tough.\n\n***\n\nThe OGC announcers reviewed the competition standings.\n\n\"Today I'll take a look at the top candidates to win the National Competition. First, the United States. They have the largest number of medals and there are two events remaining. Unfortunately, it will be difficult for them to obtain a gold medal.\"\n\nHis co-host nodded. \"It's a pity. If they could just win one more gold medal, the US obtaining 1st on the rankings would become a fact. But this isn't possible...\"\n\n\"Still, I think they have shown the dignity of the champion of the 1st National Competition. The United States is the only one out of the 32 participating countries to reach the top in all events.\"\n\n\"But it isn't meaningful. Isn't a gold medal the best result? Look at South Korea.\"\n\n\"They have five medals... All five are gold medals...\"\n\n\"It's truly an unusual record. It's a country specialized in some events.\"\n\n\"Isn't it more appropriate to see it as 'Grid' rather than a country? Grid alone won four of the five gold medals.\"\n\n\"Yura picked up a gold medal in hell running, but she tends to be overshadowed by Grid. To be honest, I can call it a one-man team.\"\n\n\"Grid is really great. He's full of surprises every time he appears in public. But can he play an active role in PvP?\"\n\n\"It isn't possible because there is Kraugel, who is first in the overall rankings.\"\n\n\"Grid is more versatile than Kraugel, but in the end, he's evaluated as weaker than Kraugel. Let's look at the survey on the Satisfy website. 92.3% of the 280 million respondents stated that Kraugel would win.\"\n\n\"Of the 280 million people, around 260 million are expecting Grid to lose?\"\n\n\"That's right. Kraugel is the peak of two billion users and is called the sky above the sky. It's natural for him to overwhelm Grid.\"\n\nThe first announcer turned to the panel. \"Invited experts, do you think that Grid will be defeated by Kraugel?\"\n\nOne expert shifted in his seat. \"Grid is difficult to predict, making me reluctant to say anything, but I'm also expecting Kraugel's victory.\"\n\nA second expert leaned forward. \"Looking at the two people's combat records in this competition, it's obvious that Kraugel is far superior.\"\n\nA third chimed in. \"Grid dominates in attack, defense, and health, but Kraugel can neutralize most of that. Meanwhile, Grid can't neutralize Kraugel's advantages...\"\n\nThe final expert smiled knowingly. \"Um... You will see why Kraugel is called a god.\"\n\nThe players, including Grid, were connected to Satisfy to prepare for the last event. The international stations broadcasted special programs every day talking about the confrontation between Grid and Kraugel. Indeed, numerous broadcasters and experts analyzed Grid and Kraugel. Based on this, the likelihood of Kraugel winning in a confrontation between the two people was over 90%.\n\nDid this indicate that Grid was weak? No, that wasn't it. Grid's strength had been well proven and everyone in the world admitted this. However, the opponent was too bad.\n\nThe sky above the sky, Kraugel. A unique presence that was like an insurmountable mountain. Even the Overgeared members determined that it would be hard for Grid to win.\n\n*In the Reidan match, Kraugel was tired and not at full strength.*\n\n*His ultimate skill was on cooldown.*\n\nBut.\n\n*We couldn't have won against the weakened Kraugel.*\n\n*It was only Grid who could win.*\n\n*Grid, have strength.*\n\n*Beat everyone's predictions!*\n\nGrid, who wanted to raise <span class=\"rarity-unique\">Iyarugt's</span> rating. Kraugel analyzed Grid's power and prepared dozens of strategies in order to block all variables. In addition to them, strong users such as Damian, Pon, Regas, Seuron, Chris, Katz, Hao, and Tarma thoroughly prepared for the PvP.\n\nAs expected, the winner of the carriage transportation was Spain and the PvP opening ceremony was held afterwards.\n\nThe announcer's voice boomed across the stadium. \"First, the lots will be drawn! The 64 participants of PvP are going on the stage!\"\n\nJust like the siege, the opponents they would be facing was decided by drawing lots. This was for the sake of fairness, but Grid couldn't help feeling anxiety.\n\n*What if I face Kraugel in round one?*\n\nGrid feared his own bad luck. He nervously gulped and firmed up his heart. He vowed to overcome his own bad luck.\n\n*Go.*\n\nGrid's eyes sharpened and he climbed onto the stage with the other players.\n\nKraugel approached him. \"Why didn't you participate in the carriage transportation? You should have high charm as a duke, and then you would've won the gold medal in that event.\"\n\nGrid's answer was simple. \"I wanted to fight you again. This time, in equal conditions.\"\n\nThere was a reason Grid declared that 'South Korea' would win at least five gold medals in the press conference before the National Competition. He didn't mention six gold medals because he thought he would be defeated in PvP. That's right. Grid planned to participate in PvP from the beginning.\n\nHe intended to lead South Korea to the championship, win gold medals and receive big rewards.\n\nGrid met Kraugel's eyes. \"The fight with you is enough to sacrifice them.\"\n\nFighting with someone superior. Grid believed that this would be a stepping stone to help him grow leaps and bounds from the past. No, it didn't matter. Grid just wanted to compete with Kraugel.\n\n\"I am also dreaming high. How high is the sky that I am going to break?\"\n\nKraugel was silent.\n\nThe flower of the National Competition, the PvP event. With hundreds of millions of viewers watching in real time, Grid and Kraugel faced each other on the stage.\n\n\"Waaaaaaaaah!\"\n\n\"Grid! Grid!\"\n\n\"The sky above the sky! The sky above the sky! The sky above the sky!\"\n\nThe two people were driving the entire world into a crucible of excitement."
}