{
  "id": 45,
  "title": "Chapter 45",
  "content": "# Chapter 45\n\nThe air in Winston Castle's dungeon tasted of mildew and old iron. I'd been rotting in a solitary cell on the third underground floor until Euphemina showed up, and now we were hunting for Huroi in this gods-forsaken maze.\n\nI kicked at a loose stone. \"Damn it! I've searched everywhere. Where the hell is that bastard Huroi?\"\n\n\"He's not on this floor.\" Euphemina examined a junction ahead. \"We need to go deeper.\"\n\n\"What?\" My stomach dropped. \"The third floor isn't the bottom?\"\n\n\"There are four floors total. According to my source.\"\n\nI wiped sweat from my forehead. *One hour and ten minutes left.* The timer burned in my peripheral vision like hot coals. If I didn't find Huroi in time, the penalty would be catastrophic. But this dungeon stretched on like a stone labyrinth, corridors twisting into darkness, passages doubling back on themselves.\n\n\"Are you absolutely sure there's a fourth floor?\" I tried to keep the whine out of my voice. \"Maybe Huroi's on the second floor. Or the first...\"\n\n\"I swept the first and second floors looking for you. No prisoner called Huroi.\" Euphemina's boots clicked against stone. \"The fourth floor exists. My source is reliable.\"\n\n\"Then where are the damn stairs?\"\n\n\"Stop whining.\" She didn't look back. \"You're annoying me.\"\n\n\"...Right. Sorry.\"\n\n*Fifty minutes remaining.*\n\nSoldiers' footsteps echoed from somewhere above. Torchlight flickered across rough-hewn walls. And everywhere, the dungeon's ridiculous traps waited like bad jokes.\n\n*At least the traps are obvious.*\n\nRock surrounded us. Floors, walls, ceiling—all stone. No sunlight reached this deep. Nothing green could survive here. Which made the patches of grass and flowers growing from the floor absolutely absurd. Bread and fruit dangled from the ceiling on visible wires. Quality weapons hung on the walls at eye level, gleaming in the torchlight.\n\n*Even a child could spot these.*\n\n\"Duck.\"\n\n\"Huh—\" I threw myself down. Arrows whistled over my back, close enough to ruffle my hair. They struck the wall behind me with meaty thunks.\n\nMy heart hammered. \"What the—I almost died!\"\n\nEuphemina shoved me from behind. I stumbled forward, arms windmilling, and a spear thrust up from the floor where I'd been standing. The point stopped inches from where my groin would have been.\n\nCold sweat soaked my back. \"What the hell is wrong with you?!\"\n\n\"Sorry.\" She examined a handful of colorful flowers. \"I accidentally activated a trap.\"\n\n*This woman is insane.*\n\nI bit down on the words trying to claw their way out. *Patience. Be patient.* Euphemina moved like water in combat—as dangerous as Blood Witch Yura. An Epic class holder. One of only three in the entire game. And I needed her to rescue Huroi. My strength alone wouldn't be enough.\n\n\"Just... be careful.\" I forced the words through gritted teeth. \"I don't have defensive magic.\"\n\n\"Yes, yes. Sorry.\" Her tone could freeze water.\n\n*She almost killed me and she sounds bored.*\n\nEuphemina's gaze drifted upward. A bunch of bananas hung from the ceiling on an obvious wire trigger.\n\n*She's not—she wouldn't—*\n\nShe jumped, fingers closing around a banana.\n\n*No!*\n\n**Crack.**\n\nThe floor beneath my feet disintegrated. I threw myself sideways, rolling through dust and debris as stone collapsed into darkness.\n\n\"Are you serious right now?!\" I couldn't hold it in anymore. \"Why are you eating bananas?!\"\n\nShe chewed thoughtfully. \"Because there was a banana in front of me.\" She swallowed. \"Simple.\"\n\n\"It's common sense! Bananas don't grow in dungeons. It's obviously a trap!\"\n\n\"Why can't it be for the guards?\" She peeled another section. \"They patrol down here. They get hungry.\"\n\nMy eye twitched.\n\n\"You're such a negative person.\" She sighed like she pitied me. \"I bet you don't have any friends.\"\n\nSilence hung between us, thick as the dungeon air.\n\n*She's furious.* The realization hit like cold water. Euphemina had come to rescue me because her quest demanded it. But Huroi? He meant nothing to her. These \"accidents\" weren't accidents at all. She was deliberately triggering traps to show her displeasure.\n\n*Of course. Beautiful women always have tempers.* They grew up as princesses, never hearing the word \"no.\"\n\n*But Ahyoung isn't like that.* The thought of my ideal love cleansed my mind like spring water. *Ahyoung is beautiful AND kind.*\n\n\"I miss Ahyoung...\"\n\n\"Over here! I found them!\"\n\nThe daydream shattered. Soldiers poured from both ends of the corridor—twenty, thirty, fifty men in chainmail and boiled leather.\n\nI sighed. \"They just keep coming. This is getting old.\"\n\n\"You mean *I* keep dealing with them.\" Euphemina's voice could cut glass. \"While you watch. Or run. You have the nerve to complain when you're not doing anything? Look at that dagger. You should be fighting.\"\n\n\"Fighting? Me?\" I gestured at myself. \"I can't.\"\n\n\"Why not?\"\n\n\"I don't have any armor.\"\n\n\"...\"\n\nThe prison rags I wore offered zero defense. Less than zero. Fighting in these clothes would be suicide. Euphemina was supposed to handle combat so I could focus on finding Huroi. That was the logical division of labor.\n\n\"Even without armor, you could handle a few soldiers.\"\n\n\"No. I'm not as strong as you think.\" I patted her shoulder and moved toward the trap-hole she'd created earlier. \"I'll find Huroi. You keep these guys busy.\"\n\n\"What?\" Her eyes widened. \"Wait—\"\n\n\"Good luck!\"\n\nI jumped into the darkness.\n\nThe world spun. Stone walls blurred past.\n\n**Thud. Crack. Crunch.**\n\n> [You have fallen from a high place.]  \n> [You have suffered 200 damage.]\n\nPain lanced through my legs and back. I rolled to my feet, coughing dust. Above, flashes of magic lit the hole—red, blue, green. Soldiers screamed. Steel rang on steel.\n\n\"Perfect.\" I dusted off my prison rags. \"Keep fighting, Euphemina. You're doing great.\"\n\nThe louder the battle, the more it would draw defenders to the third floor. Which meant the fourth floor would be lightly guarded. Basic tactics.\n\n*I'm surprisingly clever sometimes.*\n\nDid I feel guilty leaving her to fight alone? Not remotely. My conscience had died years ago, probably around the time the loan sharks started calling. If using someone benefited me, I used them. Simple math.\n\nWas I worried about her? Please. She was the first Epic class—an overpowered monster who cast high-tier magic without chanting. She could survive an army. A few dozen soldiers and knights were nothing.\n\nI turned away from the sounds of battle and melted into the fourth floor's shadows.\n\n*Hang on, Huroi. I'm coming.*"
}