{
  "id": 450,
  "title": "Chapter 450",
  "content": "Grid's voice cut through the arena. \"I will take one hour. I will knock you out shortly before the time limit.\"\n\nHao's eyes widened.\n\nThe declaration was strange. Grid always proclaimed he would crush his enemies instantly. The commentators shifted in their seats. The viewers leaned closer to their screens.\n\n*Grid has a high appreciation for Hao's skills.*\n\nThe realization rippled through the crowd like a stone thrown into still water.\n\n*Of course he does. Hao's control skills have received the ultimate evaluation of society.*\n\nThe miracle of the continent. The genius of fighting. People spoke his name in the same breath as Kraugel, no higher praise existed.\n\n*Kraugel is the peak, but Hao stands just below. Grid's control has grown to match a high ranker, but it's still less than Hao's.*\n\n*And Hao has that skill. The one that strips weapons and armor. Grid's biggest strength, useless.*\n\n*The worst matchup. Grid has no luck.*\n\nNo one forgot Grid was a strong champion. But champions bled. Champions lost. Every candidate carried weaknesses like scars. Hao happened to be Grid's. The viewers watched with pity creasing their faces.\n\nHao's lips curled into a smile. \"Do you think you can hold onto me for one hour? You will even knock me down?\" He laughed, sharp and cutting. \"Don't speak impossible words. You will soon realize the reality.\"\n\nGrid blinked. His eyes went round, or tried to. The muscles around them seemed frozen, stiff.\n\n*What?*\n\nHao stared. The audience tilted their heads.\n\nGrid's mouth opened. \"Hey! Just released by the Comet Group! A diamond studded top of the line sound system installed on the capsule! Wonderful!\" His face flushed red. \"I can clearly hear Hao's voice and the sound of his breathing! It is just like talking in real life! Hey! This is amazing! I must buy it!\"\n\nSilence.\n\nGrid had just delivered a product placement advertisement. He stuttered through it, red-faced and sweating, but forced every word out like pulling teeth. A lesson for children and teenagers watching the National Competition. Making money was hard work.\n\nHao's face twisted. \"Grabbing some advertising fees because it's obvious you are going to lose.\"\n\n*This shameful bastard who only cares about money is going to beat Kraugel?*\n\nLauel's insane claim echoed in his skull. Anger flooded hot through Hao's veins.\n\n*I will step on him.*\n\nHao knew Grid was strong. But not Kraugel strong. Not Hao strong. His pride was justified. Who was Hao? The monster who had tied up fifteen Overgeared members alone for five minutes. Lauel himself had been amazed, had tried to recruit him.\n\nHao's voice rose. \"You absolutely can't crack the sky. I will smash you before you reach it!\"\n\nThe host's shout tore through the arena. **\"The last match of the 1st round! Grid vs Hao, the match will start now! It has started!\"**\n\nTaack!\n\nHao exploded forward. A straight charge. Simple. Grid could handle simple. The Slaughterer's Eye Patch fed him data. Iyarugt hummed in his grip. His insight mapped Hao's trajectory, calculated the point of impact.\n\nGrid moved to intercept.\n\nThen Hao's sword split into three.\n\n*What?*\n\nThree blades, three paths, three possible deaths. Which one was real?\n\nSeokeok!\n\nSteel kissed Grid's waist. Blood welled.\n\n*Unbelievable!*\n\n> [You have suffered 2,900 damage.]\n\nHao's passive. It ignored portions of defense, carved through even Grid's layered protection. Hao caught Grid's expression and smiled.\n\n\"It must be bad.\"\n\nGrid said nothing. His eyes stayed locked on the notification windows floating in his vision. Shock rippled across his features.\n\nThe damage itself? Not the problem. Three thousand points. High, yes. Triple Layers and his helmet cut physical damage, but Hao hit hard regardless. Yet Grid's health pool stretched near seventy thousand. Honestly, it barely qualified as a tickle.\n\nSo why the shock?\n\n> [The experience of Tiramet's Belt has increased by 0.1%!]\n\n*Jackpot!*\n\nJoy trembled through Grid's body. Tiramet's Belt, growth type item, epic rated. It needed to be hit to gain experience. Fighting vampires, it took one hundred strikes to earn 0.1%. One hundred.\n\nHao's single attack just matched that. Comparable to when Grid had fought the drake.\n\n*His attack power is high.*\n\nGrid's heart hammered with excitement at Hao's work.\n\n*I might be able to increase the belt's rating in this round!*\n\nTwo reasons existed for Grid's plan to drag the fight to an hour. First, buy time for Assimilation's cooldown to expire. Second, maximize experience for Iyarugt, <span class=\"rarity-epic\">Elfin Stone's Ring</span>, and <span class=\"rarity-epic\">Tiramet's Belt</span>. He had not expected the experience to accumulate so quickly.\n\n*The class is different.*\n\nGrid acknowledged it. Bondre and Alexander had not provided this much experience per hit. Hao operated on another level.\n\nIyarugt confirmed it. The sword spoke for the first time since the duels with Piaro and Kraugel.\n\n[This person's attacks are very good. They are difficult to predict.]\n\n*I feel it every time. You are really useless when fighting strong opponents.*\n\n[Eek! It can't be helped! I can't exert my power in this sealed form!]\n\nPride bristled through Iyarugt's voice. Hell's best swordsman, reduced to this. The blade emitted petals of bloody light, a beautiful crimson cascade that dazzled Hao and the viewers.\n\nHao's eyes narrowed. \"That sword is too much for you.\"\n\nGrid glanced at Iyarugt. \"This guy is so cool because of me.\"\n\nHe had dumped a mountain of gold into the alchemy facilities. The result? The 'Coolness' option. Grid shuddered at the memory of that terrible outcome.\n\n\"How long are you going to rest? Come...\"\n\nHao moved mid-sentence. A zigzag approach, fast and aggressive. He stabbed.\n\nThis path was simple compared to the earlier illusion. Grid blocked easily.\n\nChaaeng!\n\nThe swords collided.\n\nChwaruruk!\n\nHao's chain whipped around Grid's waist like a striking serpent. Aimed to freeze Grid's movement for a critical instant.\n\nGrid's teeth clenched. Resistance to abnormal statuses did not cover physical restraints. His body jerked forward. Hao's sword stabbed twice in rapid succession.\n\n> [You have suffered 2,830 damage.]\n> [You have suffered 2,910 damage.]\n> [The experience of Tiramet's Belt has increased by 0.2%!]\n\nGrid grunted. \"Kuah! It's true.\"\n\nGood that his item experience climbed. Uncomfortable to be hit so one-sidedly. The damage accumulation pressed against him like gathering storm clouds.\n\n*Very strong.*\n\nThe defense-ignoring passive reduced Triple Layers' effectiveness. Perhaps Hao possessed another passive, one that boosted PvP damage. Grid's frown deepened as he ripped the chains free and launched a counterattack. A straight thrust, narrow orbit, impossible to dodge.\n\nThe shortest path between two points threatened Hao's throat.\n\nHao blocked it easily.\n\nThen felt the problem.\n\nKkirik! Kkikikik!\n\n*What is this?*\n\nAn ogre's weight crushing down. Grid's monstrous strength pressed through Iyarugt's edge. Hao could not bear the weight.\n\nChwaruruk!\n\nHao winced, stepped back, threw his chain again.\n\nGrid had rich battle experience. Being hit by the same pattern twice was unlikely. The moment Hao's chain left his hand, Grid shifted left. The iron links whistled past his ear.\n\nHao was off balance. No time to recover. No chance to counterattack.\n\nGrid seized the opening. Pagma's Swordsmanship, Kill.\n\n*Let's increase Yakult's experience!*\n\nKuooooh!\n\nThe blade filled with killing intent. A sword born from hatred itself. Hao's throat worked, swallowing hard against the fearsome energy radiating from Grid's strike. He moved desperately.\n\n*I can't allow it to happen!*\n\nHalf-draconian Hao lacked a deep pool of active skills, but passives saturated his build. Increased PvP attack and defense. Partial defense penetration. Damage mitigation. Fast recovery. A body optimized for combat. In player battles, he could deal over ten thousand damage per strike. Sometimes he deliberately ate attacks to set up devastating counters.\n\nBut Grid's attack power was too burdensome. The image of other rankers dying in one blow flashed through Hao's mind. His hands moved in a blur.\n\nTeook!\n\nPerfect timing. Hao's fingers caught Iyarugt mid-swing and twisted.\n\n> [Iyarugt has been unequipped!]\n> [This is the result of a skill. You won't lose ownership of the item. In 12 seconds, the item will return to your inventory.]\n\nWeapon Shed. A secret technique requiring precision down to the millimeter. The perfect spot marked, the perfect moment executed. Harder than any counterattack. One of the highest difficulty skills in existence.\n\nIyarugt clattered to the ground.\n\nHao surged forward. \"Haaap!\"\n\nDragon's Breath ignited. His sword stabbed toward Grid's heart. Grid stood empty-handed. No weapon to block. Too fast to dodge. Hao's confidence surged.\n\n*It doesn't matter if he uses the God Hands.*\n\nHao was ready. Chains prepared to constrain them. In this situation, Grid's only option was Magic Missile. Hao just needed to avoid that and...\n\n\"What?\"\n\nHao's confident smile shattered into shock.\n\nJeeeong!\n\nFrom what gap had he pulled it? A blue-black sword appeared in Grid's grip, materializing as if summoned from shadow itself. The blade intercepted Hao's thrust.\n\nThe camera zoomed in on Hao's widening eyes. His gaze shook like leaves in a storm."
}