{
  "id": 451,
  "title": "Chapter 451",
  "content": "Hao's eyes darted between Grid's empty hands and the discarded greatsword at his feet. The blade materialized in Grid's grip too fast. Impossibly fast.\n\n*This doesn't make sense.* Hao leapt backward, boots scraping against stone as he opened distance between them. His pulse hammered in his throat. *I can't fight if my judgment's compromised.*\n\nTwenty meters. Thirty. Only when the gap felt safe did he allow himself to think.\n\n*One second. He swapped weapons in one second.*\n\nThe mechanics were simple enough. Open inventory, reach into the translucent window that manifested in the air, focus on the desired item. Even for top rankers, the sequence took two and a half seconds minimum. One second to access the inventory window. Another one-point-five to clearly visualize the item you wanted. Players with exceptional focus could compress it to two seconds, but one?\n\nPhysically impossible.\n\nYet Grid had done it.\n\n*What trick did he use?* Hao's jaw clenched. The question scraped against something uncomfortable in his mind.\n\n\"A bug?\" The word came out before he could stop it.\n\nAnyone who knew Satisfy would have laughed. Since launch, the game had never experienced a single exploitable glitch. The system was perfect. Absolute.\n\nGrid met his uncertain stare with eyes like still water. A smile tugged at his lips.\n\n\"I've been stupid since I was young.\"\n\nThe confession hung in the air, casual as breathing.\n\n\"No matter how hard I studied, I couldn't keep up with others. Couldn't even maintain average scores.\" Grid's voice carried no self-pity, just flat honesty. \"Subjects with formulas? Math? Physics? Thirty points if I was lucky. Sometimes I'd get zero.\"\n\nHe kicked at the dirt.\n\n\"So I obsessed over simple memorization. Every day. Memorize, memorize, memorize...\" A dry chuckle. \"Got me to eighty points in rote subjects. Enough to scrape into university. The kind where money talks louder than grades.\"\n\nThe crowd's murmur died to silence. Cameras zoomed in.\n\n\"University classes destroyed me. I couldn't follow them at all.\" Grid's hand flexed around Iyarugt's hilt. \"Then virtual reality dropped. I threw myself at it. Committed everything.\"\n\nHao's confusion deepened. Where was this going?\n\n\"But my lack of talent followed me into the game.\" Grid's smile turned rueful. \"I played Satisfy all day, every day. Never reached average. Instead of making money, I drowned in debt.\"\n\nHe gestured vaguely at the arena around them.\n\n\"I was stupid, so I kept hunting the same monsters. While others killed ten or twenty of something before moving on, I killed thousands. Thousands of the same mob.\" The words came faster now, tinged with old frustration. \"What did it matter? My level stagnated. My gear stayed trash. Couldn't afford the capsule rental, so I went back to construction.\"\n\nGrid's knuckles whitened on the sword.\n\n\"I tried hard at first. Put in the effort. But I couldn't learn skills. My comprehension was too low.\" He shook his head. \"So I focused on simple tasks. Shoveling. Carrying materials. Cleaning. The jobs nobody else wanted.\"\n\nThe massive stadium screens captured every micro-expression on his face.\n\n\"I was always bored.\"\n\nThree words. They carried the weight of years.\n\n\"Study. Gaming. Work. I could only handle simple tasks. It made me ashamed. Made me hate every moment.\" Grid's eyes hardened. \"But I didn't give up. I complained about my talent, sure. But all I wanted was to be average. To stop being ignored.\"\n\nHao's breath caught. Understanding crept up his spine like ice water.\n\n\"The result?\" Grid's voice dropped. \"Indomitable tenacity. Once I set a goal, I focus on it. I don't give up. Ever.\" He tapped his temple. \"My concentration got disciplined. Forged. Every time I make an item, I hammer for hours. When trials come, I don't break.\"\n\nThe smile returned, sharper now.\n\n\"Therefore, I think my concentration is better than others.\"\n\nThe casual delivery belied the truth. Grid's focus had transcended human limits. He'd trained himself to summon the inventory and visualize the desired item simultaneously. The mental processing happened in parallel, not sequence. And he could do it mid-combat, while tracking an opponent's movements, calculating distances, managing cooldowns.\n\nIt had started in the Behen Archipelago. Fighting his clone. Watching it swap equipment with fluid efficiency. He'd practiced ever since, burning the muscle memory into his mind until it became instinct.\n\n\"Well.\" Grid shrugged. \"This is the power of effort.\"\n\n\"...?\" Hao's mouth opened. Closed. The explanation made no sense. Because he was an idiot, he tried hard, so he gained superhuman concentration?\n\n*That's not an idiot.* The realization hit like a hammer. *That's a genius.*\n\nFew people could overcome their limitations through effort alone. The discipline required, the mental fortitude... Hao stared at Grid with new eyes. And Grid, frustratingly, was looking directly at the nearest camera.\n\n\"Indeed, the diamond class capsule from the Comet Group is great.\" His tone shifted to advertisement-perfect enthusiasm. \"As soon as I thought about it, all systems reacted. The inventory opened immediately. I escaped that crisis thanks to this excellent product.\"\n\n\"...\" \n\nPPL. Product placement. Now?\n\n*You've got to be kidding me!*\n\nHao's killing intent surged back to life. Grid bent down, scooped Iyarugt from the ground, and straightened with the demonic blade gleaming red in his grip.\n\n\"Yes.\" Hao's voice came out tight. \"It doesn't matter if you're an idiot or a genius. I'll be the winner regardless! Let me show you my real skills!\"\n\n*Jjejeok!*\n\nHis skin split. The sound was wet, organic. Red scales pushed through the tears in a cascade of crimson. Flesh parted like ripping cloth as his body restructured itself. Massive wings erupted from his back, bone and membrane unfurling with audible cracks.\n\nThe crowd roared.\n\n> **『 The draconian transformation! Hao's bringing out his true power! 』**\n\n> **『 In this state, he defeated Katz and fought Damian to a standstill. Grid's in serious danger. 』**\n\nHao's eyes flooded with molten gold. Fangs extended from his gums. He opened his mouth and exhaled.\n\nFire screamed toward Grid.\n\n*Peeng!*\n\nGrid twisted, the flames scorching past his shoulder. Triple Layers could reduce physical damage, but breath weapons carried pure magic power. No defense against that.\n\n\"How long can you last?\"\n\nHao's wings beat once. The force launched him forward like a missile. Grid was still bent backward from the dodge. Vulnerable. Hao's hands blurred, claws extended, and he struck.\n\n*Jjejeong! Jjejejeok!*\n\nMetal shrieked. His claws had replaced his weapon for a reason. Draconian claws outperformed most blades. Each swipe carved into Triple Layers with savage precision.\n\n> [You have suffered 3,230 damage.]\n\n> [You have suffered 3,260 damage.]\n\n> [The experience of Tiramet's Belt has increased by 0.3%!]\n\n*Amazing!*\n\nGrid's grin widened. When had he last felt this thrilled? The hits kept coming, and each one made his blood sing. In the stands, confusion rippled through the audience. The commentators exchanged worried glances.\n\n*He's smiling. While getting torn apart, he's smiling.*\n\nWas Grid a masochist? There had been that incident during the Siege event, taking the flail to the face. The speculation intensified.\n\n\"Can you feel the difference?\" Hao's shout carried over the clash of combat.\n\nEach landed blow confirmed it. The class difference between them was like earth and sky. Grid's health had already dropped to half. Without a weapon slowing his attacks, Hao's speed was overwhelming. Grid's HP bar drained faster with every passing second.\n\n*Chwaack!*\n\n\"...!\"\n\nHao's claws bit deep into Grid's chest. A critical hit. Blood sprayed. But the one who froze in shock wasn't Grid.\n\nHis claws wouldn't move.\n\n> [The draconian's claws have been bound to this armor!]\n\n> [The draconian's claws have been forcibly pulled out!]\n\n> [The durability of the draconian's claws has decreased by 3!]\n\n*How is that possible?!*\n\nDraconian claws had a durability of ten. They couldn't be repaired. If they broke, it took a full day for them to regrow. But Hao had never lost even a single point of durability before. His claws were harder than most weapons. He'd fought golems, struck legendary-grade equipment, and they'd never so much as chipped.\n\n*This armor is ridiculous.*\n\nHao wrenched himself free, spinning in midair. His heel snapped out, catching Grid's jaw with surgical precision. Grid's head rocked back. His health gauge plummeted to one-third.\n\n*He's going to use them now. The God Hands. Blackening.* Hao pressed the advantage, unleashing a storm of fire and claws.\n\nGrid didn't counterattack. He blocked. Dodged. Failed to dodge. Most of Hao's strikes connected, a testament to the Chinese player's control. This wasn't even close. The commentators shifted uncomfortably.\n\n> **『 We knew Hao countered Grid, but this... 』**\n\n> **『 The level difference is more extreme than expected. 』**\n\n> **『 Grid's just trying to survive. 』**\n\n\"Blackening!\"\n\n*Peeok!*\n\nHao's fist crunched into Grid's ribs.\n\n\"Use it!\"\n\n*Peeeeok!*\n\nHis knee drove into Grid's stomach.\n\n\"It won't work!\"\n\n*Kwa kwang!*\n\nAnother hit. Another. The violence was one-sided, methodical. Grid's health dropped to a quarter. Hao's confidence swelled with each successful strike.\n\n\"This is the end.\"\n\nTwenty minutes had elapsed since the match began. He'd promised to finish Grid in ten. Hao felt a flicker of regret. *What can I do? His defense and health pool are absurd.* But it was over now. Time for the finishing blow.\n\n\"Dragon Claws.\"\n\n*Kiiing.*\n\nMagic surged through Hao's hands. His claws elongated, gleaming with deadly light. Hardness increased. Sharpness magnified. For this brief window, they matched the claws of a true dragon.\n\n\"Die!\"\n\nThe attack came from left to right, a horizontal slash designed to bisect. Hao's claws tore through the air. Grid stepped backward, sword rising in a half-moon arc.\n\nPagma's Swordsmanship, Revolve.\n\nThe commentators saw it as desperation. A last, futile gesture from a man who'd been dominated for twenty minutes straight. The viewers didn't expect it to work.\n\nBut ice flooded Hao's veins.\n\nThe timing was perfect.\n\n*Jjeejeeeong!*\n\n\"Kuaaaaack!\"\n\nHao's scream ripped through the arena. Blood sprayed from his chest in a crimson arc.\n\n> [Critical!]\n\n> [You have dealt 25,600 damage to the target.]\n\n> [You have recovered 1,280 health thanks to <span class=\"rarity-epic\">Elfin Stone's Ring</span>!]\n\nOne strike. Hao's health halved. Grid's health climbed back up. The reversal was instant, brutal, shocking.\n\nHao threw his chain in desperation. Grid flowed backward, Lantier's Cloak sweeping up to intercept the metal links. Behind the cloak's cover, Grid's hand moved with practiced efficiency, swapping rings.\n\nWhen he lowered the cloak, Doran's Ring sat on his finger.\n\n\"The next forty minutes.\" Grid's smile was predatory. \"Can you endure?\"\n\n\"You bastard...!\"\n\n*Counterattack skills have long cooldowns. Most users only have one.* Hao's mind raced. *Dragon Claws is still active. I can still win this.*\n\nHis claws flashed toward Grid's face.\n\n> [Critical!]\n\n> [You have dealt 12,590 damage to the target.]\n\n*Yes!*\n\nGrid's defense had dropped. The damage output confirmed it. This was his chance. Victory was still possible. Hao's lips curved into a satisfied smile.\n\nIt died instantly.\n\n> [The target has recovered 18,885 health.]\n\n\"What?\" Hao stumbled backward, face pale as a corpse.\n\nWhat kind of effect was that? Grid watched him retreat and lifted Lantier's Cloak, revealing what lay beneath. Not Triple Layers. The Holy Light Armor gleamed in the stadium lights, its legendary options including a 300% boost to all recovery effects.\n\n\"Come again.\"\n\nThe Holy Light Armor vanished, replaced by Triple Layers once more. Grid stood there, health nearly restored, waiting.\n\nHao looked at him. Looked at his own depleted health bar. Looked at the timer showing forty minutes remaining.\n\nThe math was simple. The conclusion unavoidable.\n\n\"I give up.\"\n\nThe declaration hit like a thunderclap. Silence crashed over the stadium. One-point-four billion Chinese citizens sat frozen in disbelief, convinced they'd misheard.\n\nBut one person was more shocked than all of China combined.\n\n\"Why?\"\n\nGrid's voice cracked with genuine confusion.\n\n\"There are still forty minutes left! Why?!!\"\n\nThe camera zoomed in on his face. The expression was unmistakable. Not triumph. Not satisfaction.\n\nDisappointment.\n\nRaw, unfiltered disappointment.\n\nOn this day, one of Grid's hidden sides was exposed to the world.\n\nIt didn't bode well."
}