{
  "id": 452,
  "title": "Chapter 452",
  "content": "*He can restore 150% of the damage done?*\n\n*It must be a one-time thing.*\n\nEyes across the world locked onto Grid. Players mid-match in their own PvP brackets. Healers watching from home. Analysts scribbling notes in dimly lit rooms. \n\nGrid—the blacksmith who combined legendary craftsmanship with raw combat power, the guild master who commanded an army of elites. He remained an unknown quantity. Countless players had tried to measure him, to find the ceiling of his strength. This match was their chance. Every movement, every skill, every weakness laid bare for study.\n\nEspecially Kraugel.\n\n*Grid...*\n\nThe Russian champion sat alone in the preparation area, hands clasped between his knees. If he thought only of his mother, he would pray for Grid to fall before the finals. The logical choice. The safe path.\n\nBut his heart demanded otherwise. It craved the clash. The test of blade against blade, skill against skill. To fight Grid. To grow through that crucible.\n\n*...Selfish greed.*\n\nKraugel stood. He crushed the yearning down into some dark corner of his chest and left the waiting room. The second round began in thirty minutes.\n\n***\n\n\"Booooo!\"\n\n\"**Boooooo!**\"\n\nThe stadium shook with jeers. Somewhere in the French crowd, a voice shouted in perfectly accented Mandarin.\n\n\"**Ni chi fan le ma!**\"\n\nDefinitely Korean. \n\nThe crowd's fury toward Hao was palpable. Plastic bottles arced through the air. Paper cups. A shoe.\n\n\"**Why did you give up!?**\"\n\nGrid stormed past the host—ignored the microphone thrust in his face—and marched straight for the Chinese player. Hao had beaten him bloody for twenty minutes. *Twenty minutes* of getting slapped around like a training dummy. And then what? Surrender?\n\nIt didn't feel like victory. It felt like theft.\n\nWorse, Grid had been counting on that fight. Every second extended meant shorter cooldowns. More item experience. Growth.\n\n*Crack.*\n\nA plastic bottle bounced off Hao's temple. The Chinese player turned. His eyes held no rage, no bitterness, no regret. Just crystalline clarity.\n\n\"It's foolish to cling to a losing fight.\"\n\nGrid stopped mid-stride.\n\nHao's expression remained neutral. \"If this were a spar, I would have fought to the last second. I would have *learned.*\" He gestured toward the cameras lining the arena walls. \"But this is the National Competition. Everyone is watching. Analyzing. Revealing all my techniques here? That's a liability I can't afford.\"\n\nHe bowed—sharp, precise. Not mocking. Genuine.\n\n\"I fought you for twenty minutes. My mistake was in my initial attitude. I'm ashamed I didn't recognize your strength.\"\n\nHao straightened. Met Grid's eyes.\n\n\"I am in awe of you.\"\n\nGrid frowned. *Dull-witted.* That's what he'd called himself. That's what everyone knew.\n\nHao had reviewed everything. Every public match. Every interview. The climb from zero to legend. And he understood.\n\n*Hard work.* That was Grid's weapon. Not innate talent like the others. Not natural genius.\n\n\"...You are special.\"\n\nSomething ignited in Hao's chest—a competitive flame he'd only felt once before. Since Kraugel. But Grid was Kraugel's opposite.\n\n*Kraugel was born in the sky.*\n\nGrid was a tower. Brick by brick. Stone by stone. Climbing toward that same infinite ceiling through sheer, bloody-minded persistence.\n\nHao couldn't help but respect it.\n\nBut one thing worried him.\n\n\"Don't let it fall.\"\n\nTowers collapsed. The higher they climbed, the more catastrophic the fall. If Grid encountered a disaster that effort alone couldn't overcome—if his foundation cracked—would he recover? Or would he shatter?\n\n*Who am I even worried about right now?*\n\nHao smiled. Turned his back.\n\n\"If Grid breaks through the sky...\" He spoke just loud enough for Grid to hear. \"I'll serve under him.\"\n\nLauel's words. Once offensive. Now? They rang true.\n\n***\n\nThirty-two fighters remained for the second round. The strongest candidates advanced: Russia's Kraugel. Canada's Chris. Japan's Damian and Katz. America's Skull. Spain's Pon. Britain's Regas.\n\n『 And Korea's Grid. 』\n\n『 I still can't believe China's Hao forfeited in round one. A *forfeit*. That's unprecedented. 』\n\n『 Grid's recovery transcended Hao's expectations. No matter how much damage he took, the man kept getting back up like an undead. His attack power even *increased.* 』\n\n『 But still—Hao gave up too easily. Maybe his stamina couldn't keep pace. 』\n\nThe matches began. Standard fare, mostly. Each favorite dismantled their opponent with practiced efficiency.\n\nKraugel won without taking a single hit. Skull fought with grim determination, carrying America's hopes on his shoulders. Katz luxuriated in his own power, drunk on the taste of it. Pon advanced while dreaming of becoming the continent's greatest spearman.\n\nThe ratings began to dip. No surprises. No upsets.\n\nThen—\n\n『 It's finally here! 』\n\n『 The fifteenth match of round two! 』\n\n\"**WAAAAAHHHHHHH!**\"\n\nThe Stade de France *erupted.* The quiet murmur transformed into a deafening roar. International broadcast ratings spiked across every network.\n\n『 The match everyone's been waiting for! 』\n\n『 Damian and Regas! Regas and Damian! 』\n\nDamian—the first user Pope. Master of sword and divine magic. Tank, buffer, healer wrapped into one perfect package. Combat balance so refined it rivaled Kraugel and Grid themselves.\n\nRegas—the strongest martial artist since the Tzedakah Guild days. Idol of every fist-fighter in the world. The only player to achieve the **Asura** third advancement class.\n\n『 The Asura class is genuinely nightmarish to fight. 』\n\n『 Highest difficulty among third advancement classes. Some players would rather hunt for hidden classes than attempt the Asura quest chain. 』\n\n『 There's speculation the fourth advancement links to a hidden class. That's why so many martial artists are stuck grinding that quest instead of taking easier promotions. 』\n\n『 The power output is insane, though... Each strike has abnormally high accuracy, and combo damage stacks infinitely. 』\n\n『 Plus bonus lightning damage on every hit during combat. 』\n\n『 But can he even *land* a combo on Damian...? 』\n\nNo one could predict the winner.\n\nOnstage, the two men faced each other.\n\n\"Feels strange to meet you in a place like this.\" Regas grinned.\n\n\"Yes.\" Damian returned the smile.\n\nGood friends. Outside the arena, they shared drinks and jokes. Damian appreciated that Regas never mocked his otaku tendencies. Regas was simply friendly to everyone.\n\nBut the moment the starting bell rang, their eyes changed.\n\n\"**Divine Protection. Incarnation of Light. Goddess' Blessing.**\"\n\nDamian layered buffs immediately—attack power, defense, all stats amplified. He raised his shield. Dealing with Regas unbuffed was suicide.\n\n\"**Great! Hahat!**\"\n\nGold and silver aura wrapped around Damian like a second skin, radiant and blinding. Regas found no gap.\n\nSo he charged anyway.\n\nIn the waiting room, Kraugel leaned forward.\n\n*Too hasty.*\n\nWhen an opponent buffed, you stalled. You waited for the effects to expire. *Especially* against someone like Damian. Even Kraugel hesitated to engage a fully buffed Pope.\n\nAs predicted, Regas ate the counterattack. Damian's shield absorbed the impact, then his sword lashed out—fast, precise, surgical. Regas' Asura defenses, notoriously weak, crumbled under the assault.\n\n*...It can't be.*\n\nBut Regas didn't retreat. He pressed forward, taking hits deliberately, letting his health bar plummet. And his attack speed was increasing. Slowly. Imperceptibly.\n\nOnly Kraugel noticed.\n\nEven Damian missed it. Until—\n\n\"**Cough!**\"\n\nRegas' fist buried itself in Damian's stomach. The Pope folded. His face met Regas' rising knee.\n\n\"**Kkuk!**\"\n\nThe second hit hurt more than the first. The third would hurt more than the second.\n\n*Can't let him complete a combo—!*\n\nDamian raised his shield—perfect timing, perfect angle to intercept Regas' fist.\n\n*Crack!*\n\n\"**Keok!**\"\n\nBlood spattered the mat. Regas' *kick* had slipped past the shield.\n\n*When did he kick—?*\n\nArms and legs moving independently. No telegraph. No delay.\n\nThe crowd roared.\n\n『 Regas—who defeated third-ranked Chris last year and pushed Grid to the limit—he's *evolved*! 』\n\n『 Control skills comparable to Hao. He's transcended the boundaries of the martial artist class. Incredible. 』\n\nWould Regas take it?\n\nHis next strike cracked against Damian's chin.\n\n\"**Wow...**\"\n\nEach combo stacked damage multiplicatively. Damian's health bar hemorrhaged green. \n\nBut Damian was a Pope.\n\n\"**Goddess' Breath.**\"\n\nAn absolute heal. The strongest recovery skill in the game—full restoration for the caster, seventy percent for the party.\n\n\"**Goddess' Protection.**\"\n\n*Peeeeeong!*\n\nA translucent golden shield materialized. It ate Regas' next attack completely, shattering the combo chain.\n\nThen Damian went on the offensive.\n\n\"**Goddess' Wrath.**\"\n\n*Puaaaaaaaah!*\n\nTwin magic circles—each three meters wide—materialized in the air. Beams of pure white light lanced down.\n\n***\n\n『 The winner is Damian!! 』\n\nThe match had lasted thirty-one minutes and twenty seconds. Both fighters had pushed past their limits. The crowd sat stunned, barely breathing. The commentators fumbled for words to capture what they'd just witnessed.\n\nFor a long moment, silence reigned. The host spoke onstage, but no one processed the words.\n\nThen—\n\n\"Grid and Chris.\"\n\nTwo names. The crowd snapped back to attention.\n\nThe real show was about to begin."
}