{
  "id": 453,
  "title": "Chapter 453",
  "content": "The broadcast commentary scrolled across screens worldwide.\n\n『 I must admit Chris holds the highest name value. But he lost to Regas in last year's National Competition. I don't think he's Grid's opponent. 』\n\n『 This year's Chris is different from last year's version. At this point, Chris is stronger than Regas. Regas couldn't beat Seuron, while Chris won. 』\n\n『 Over the past year, Chris seems to have pushed his offensive power to the absolute limit. If anyone can crush Grid and Damian's powerful defense, it's Chris. 』\n\n『 His strength is clear, as well as his weakness. Chris would have invested most of his stats into **Strength** to increase attack power, making his health very low. He won't withstand Grid's attacks. He needs to knock down Grid before he falls first. 』\n\n『 Putting aside the **Strength** stat, doesn't the **Stamina** stat also increase health? Chris is third on the unified rankings. He should have survival skills from accumulated know-how and knowledge. Chris's ability with the greatsword is also unparalleled. 』\n\nWho would win if Grid and Chris fought? The commentators and experts couldn't easily predict the outcome. International broadcasters used real-time ARS to make money. The betting odds settled at 6:4 in Grid's favor.\n\nOn the stage, Grid and Chris waged a fierce war of nerves.\n\nChris studied his opponent's weapon. \"You enhanced that weapon to +9. Don't you have good luck?\"\n\n\"It's the power of money, rather than luck.\" Grid shifted his grip on Iyarugt. \"Haven't you made a lot of money from the Comet Group? Why didn't you enhance your weapon before the match started? Grid's Greatsword seems much better than the one-handed sword you're using now.\"\n\nChris's jaw tightened. \"It isn't a problem that can be solved by pouring in money.\"\n\n*For fuck's sake.* Grid's expression remained neutral. *For me, Grid's Greatsword is a cursed weapon. I put my name on it, making the enhancement probability absolute shit.* He made a mental note to rename the entire Grid Set.\n\n*Well, I enhanced Iyarugt to +9. Let's be satisfied with that.*\n\nIyarugt had been enhanced to +9 in preparation for the National Competition and showed off powerful performance. The problem was that it remained insufficient compared to the legendary rated Grid's Greatsword.\n\n*+9 Grid's Greatsword.*\n\nThe base attack power of 1,440 would reach 2,500 at +9. It could block enemy attacks, trigger **3 Joint Attacks**, deal 30% increased cutting damage, 20% increased skill damage, gain increased attack power in darkness, activate a critical hit after landing five consecutive strikes, and if a skill connected within 0.5 seconds after **3 Joint Attacks**, it dealt additional damage.\n\nA weapon with brilliant, overwhelming options. How much would it hurt? A chill crawled down Grid's spine.\n\n*Not even Triple Layers can endure that.*\n\nTriple Layers couldn't exploit gaps against a greatsword. The blade was too wide and thick. The barbs in the gaps wouldn't catch.\n\n*This time, I'll abandon the idea of raising the belt's experience.*\n\nGrid decided to fight aggressively and minimize damage. He would focus on acquiring experience for just Iyarugt and Elfin Stone's Ring.\n\nThe host announced the start of the match.\n\nGrid moved immediately. He activated **Link** to exploit the greatsword's slow speed, maximizing Iyarugt's quick attack tempo. Chris would have no way to cope.\n\nPit!\n\nPipipipipit!\n\nDozens of energy blades manifested and shot toward Chris. Grid pictured his opponent shedding blood.\n\nThat didn't happen.\n\n\"Huup!\"\n\nChris swung his greatsword in a circle and deflected every strike. The blade traced the shortest path while covering maximum range, compensating for the weapon's slow speed.\n\nGrid clicked his tongue. *Perfect technique.*\n\nHe felt envy watching Chris throughout the National Competition. Grid had treated his greatsword as his main weapon before acquiring Iyarugt. He cherished Chris's swordsmanship.\n\n*I want to be like that. I will become like that.*\n\nHe didn't know how many times he'd thought this.\n\nChaaeng!\n\nChris deflected the dozens of strands of **Link** and counterattacked, striking with the greatsword. Iyarugt blocked it, but the force pushed Grid back.\n\n*This bastard. Don't tell me.*\n\nWas Chris's **Strength** higher than Grid's? An unpleasant experience. Grid always had the edge in **Strength**.\n\nJjejeong!\n\nJjeejeeeong!\n\nChris continued the momentum. He repeatedly twisted his waist and linked a second, third, fourth and fifth attack. Each collision generated repulsive force that slightly increased Chris's attack speed. Every time Grid defended against strikes coming from left and right, shock waves forced him backward.\n\n> [The durability of Iyarugt has decreased by 4!]\n\n> [The experience of Iyarugt has increased by 0.1%!]\n\nThe notification windows appeared, but Grid felt no satisfaction. It was impossible to confront Chris's successive attacks.\n\nJjejeong!\n\nGrid couldn't bear the weight of Chris's attack and bounced back. Chris's greatsword was already heading toward him at a right angle.\n\nSeokeok!\n\nGrid's chest was cut from bottom to top.\n\n> [You have suffered 4,977 damage.]\n\n*Isn't he better than expected?*\n\nHe'd expected Chris's attack power to be one step higher than Hao's. But not this much. Chris dealt 5,000 damage in one basic blow. Like a boss monster.\n\nGrid maintained his composure. \"Magic Missile.\"\n\nFour God Hands summoned and fired Magic Missiles simultaneously.\n\nKwa kwa kwa kwang!\n\nGrid aimed at the gap while Chris's body absorbed the hits and used **Kill's** footwork. Chris didn't block or avoid.\n\nChris's choice was hitting back.\n\n\"**100 ton Sword**!\"\n\n*This skill!*\n\nKwa kwa kwa kwang!\n\nPuok!\n\nAs Chris used his skill, Grid's **Kill** touched his chest. Grid suffered 10,000 damage. Chris suffered 17,000 damage. Grid's skill damage was higher, but Chris's weapon was stronger. The difference came from their defense. Grid also recovered slightly thanks to <span class=\"rarity-epic\">Elfin Stone's Ring</span>.\n\nHowever, Chris didn't shrink back. He aimed his greatsword toward Grid's tattered chest again. Grid decided confronting head-on was suicide. He defended with the God Hands and used **Pinnacle** in the gap.\n\nThis was a mistake.\n\nChris's second class, **Tyrant**, had multiple ways to boost his **Strength** stat. One of which was absorbing some of the **Strength** stats of all beings in a 5 meter radius.\n\n\"Hufff!\"\n\nThe <span class=\"rarity-unique\">God Hands</span> received 30% of their master's **Strength** and **Dexterity**. Chris took away the **Strength** of the God Hands and Grid, sweeping his greatsword through the battlefield.\n\nJjeejeeeong!\n\nThe four God Hands stiffened under Chris's blow. Just before Grid completed **Pinnacle**, Chris's greatsword struck him.\n\n> [You have been hit by a lethal blow!]\n\n> [The skill Pinnacle has been cancelled!]\n\n> [You have suffered 8,900 damage.]\n\n*Crazy!*\n\nIt became more painful. Grid was shocked again by Chris's insane attack power and used **Revolve** for Chris's next strike. The effect was minimal. Chris struck through the reflected **Revolve** and avoided a fatal blow.\n\n*What was that? He thought to use the momentum?*\n\nSsik.\n\nChris smiled. Grid realized something.\n\n*A fake!*\n\nJjejeong! Jjang!\n\nKwang!\n\nChris's onslaught was intimidating. Grid rushed to defend with Iyarugt. The red-black and blue-black lights intertwined, causing explosive effects that made the viewers feel ecstatic.\n\n\"Grid is being pushed?\"\n\n\"It doesn't look like Grid can endure. Chris's attack power is so high that an average player would stiffen every time they defended.\"\n\n\"Then it's safe to say Chris's attacks have a 100% chance of inducing an abnormal status?\"\n\n\"Really strong. He was strong from the beginning, but now more than ever.\"\n\n\"Was he hiding his skills?\"\n\nThe spectators and viewers belatedly realized Grid could be defeated.\n\n*This is enough.*\n\nThe difference in **Strength** and weapon attack power meant Grid would keep being pushed back. This couldn't continue. He pulled out a means to overturn the situation. Blackening? That wasn't enough.\n\nTeong!\n\nGrid recalled Iyarugt after clashing with Chris's greatsword and pulled out <span class=\"rarity-legendary\">+9 Failure</span>. A lightning fast item swap.\n\nChris's eyes widened. \"What are you doing, Grid? Pulling out a weapon used in the National Competition last year! Surely you aren't giving up?\"\n\nChris didn't stop attacking despite his misunderstanding. The number of attacks increased and Chris was about to invoke the **Tyrant's Pleasure** passive.\n\nGrid blocked the incoming strike.\n\nKwa kwang!\n\nThe collision between the shark-like <span class=\"rarity-legendary\">+9 Failure</span> and the +9 Grid's Greatsword.\n\n\"...!\"\n\nChris was pushed back. Grid stayed firmly in place while Chris shook slightly. A completely reversed situation.\n\nGrid laughed at Chris's disbelieving expression. \"It's too bad for you, but Failure is the strongest.\"\n\nThe <span class=\"rarity-legendary\">+9 Failure</span> had a maximum attack power of **3,682**. At least **1,000** points higher than the +9 Grid's Greatsword."
}