{
  "id": 455,
  "title": "Chapter 455",
  "content": "---\n\n> *Wow... To think that someone could win over Chris with strength... I get serious goosebumps when looking at Grid.*\n\n> *Truly God Grid. He had the worst luck, but still advanced to the 3rd round.*\n\n> *He's on a different level. He's the first and only one to obtain a legendary class.*\n\n> *Isn't it funny when you think about it? He was beaten up, but won...*\n\n> *Really. I think he was hit more often than he dealt damage. In particular, he barely managed to hit Hao.*\n\n> *Grid looks like the loser...*\n\n> *What if?*\n\n> *If Grid really wins gold in PvP, South Korea will be first in the rankings.*\n\nNo matter his appearance, Grid was actually a winner. A festival atmosphere swept through South Korea. Who would've imagined that one of the weakest countries in Satisfy could possibly claim first in the rankings? It was thanks to Grid, who caused the people of South Korea to go wild.\n\n\"God Grid! God Grid! God Grid!\"\n\nThe chant echoed through homes across the nation. Various media outlets praised Grid's activities. People gathered to talk about Grid. Even top stars representing South Korea supported him on their social media. The membership of Grid's fan club exceeded Noe's fan club for the first time since its establishment.\n\nIt was a level of popularity equivalent to Park Chanho, Park Seri, Park Jisung, and Kim Yuna, athletes who had raised the status of the country in the past and received great love and respect from the people.\n\n\"Our Youngwoo is great!\"\n\nGrid's parents fielded congratulatory calls from cousins and acquaintances. They felt proud of their son, who could reach his current position with his own strength.\n\nHowever, Grid wasn't excited. The attitude of the press could easily change at any time, and the mindset of the public changed accordingly. Grid already knew this through experience. Wasn't it during the blacksmithing game? The Korean media criticized him as soon as Grid made a normal item.\n\n*The reaction of the people is meaningless.*\n\nGrid didn't want short-lived popularity. His goal was to achieve a more complete and steadfast reputation. Shin Youngwoo wanted to make sure that nobody could ever ignore him again.\n\n*In order to achieve that wish...*\n\nHe needed to win in PvP. It was the fastest way.\n\n***\n\nThe 3rd round.\n\nThere were no surprises regarding the results of the first to sixth matches. Kraugel won in the first match and Skull won in the third match as experts predicted. But no one could easily predict the winner of the seventh match.\n\nPon vs Katz.\n\nThe strongest players representing Spain and Japan! Pon was always mentioned as top three in Overgeared, while Katz was a Blood Warrior and showed great strength. It was difficult to say who was stronger.\n\n*I will fight Grid.*\n\nPon gazed at Katz with wild eyes. He resembled Regas. He pursued the ultimate peak, and wouldn't allow anything irrational to interfere in the process. A man who wanted fair growth, fights, and results. It was the reason why Lauel didn't tell Pon about his plans to recruit Kraugel. If Pon knew Lauel's plan, he would've been uncooperative and mad.\n\n*Pon, please lose to Katz.*\n\nIn the end, Lauel could only hope.\n\n*Please don't let Katz be defeated.*\n\nPon wasn't capable of beating Grid. No, not just him, but all of the Overgeared members. Grid was a person who constantly made items that could minimize the disadvantages of the Overgeared members. Therefore, he clearly grasped their strength and weaknesses! If Pon won against Katz and advanced to the fourth round, Grid was sure to advance to the semi-finals.\n\nThus, Lauel hoped for Katz to win.\n\n*Katz is the one who has a chance against Grid.*\n\nOther people didn't know it, but Lauel knew. The reason why Grid had allowed a large number of hits during his matches!\n\n*The reason...*\n\nHe wanted to increase the level of his items.\n\n*This is an opportunity for Katz.*\n\nA Blood Warrior became more powerful as more blood was shed. If Grid was fatally wounded and Katz survived the immortal passive...!\n\n> [System] The 7th match of the 3rd round! Pon against Katz! Katz against Pon! It has started!\n\nLauel watched as Pon and Katz climbed onto the stage. It was only when 'riding' that Pon could reveal the true power of a spear knight. Katz watched Pon's hair blowing as he rode a white horse.\n\n*The Overgeared members are handsome or beautiful.*\n\nThere were exceptions such as Grid, Vantner, and Toon, but the proportion of beautiful people was very high. It was enough to make him wonder if the guild members were accepted due to their face.\n\n*...Should I get plastic surgery?*\n\nKatz was seriously hoping to join Overgeared. The reason was simple. He also wanted items. But he needed to prove himself before joining Overgeared.\n\n*My own strength!*\n\nKwarururung!\n\nHundreds of blood vessels started appearing on Katz's plain sword. The Blood Warrior's vampire sword revealed its disgusting appearance. Katz was surrounded by a bloody light.\n\n*I have to be careful with Mach Spear and Rail Spear.*\n\nLauel had told Katz the strategy for Pon as well as Grid. Katz himself repeatedly studied Pon's combat videos dozens of times.\n\n*It is impossible to react when those two skills are activated. But it's easy to tell, since they use a unique motion. I can aim for that gap and strike.*\n\nHis first priority was to increase his stats. Katz stepped forward.\n\nPajik!\n\n\"Rail Spear!\"\n\n\"...!\"\n\nPon immediately triggered his strongest skill. It was without any preparatory actions!\n\nKwa kwa kwa kwang!\n\n\"Kuack!\"\n\nKatz felt confused as he was struck in the heart and received a fatal wound. He was in a 'stunned' condition and the metal shock was too great. Pon explained.\n\n\"The power of items.\"\n\n**[Pon's Draw]**\n\nPon was helpless during the Tiramet raid. It was a special one-time use spear that he commissioned from Grid to overcome his weakness. It had less attack power and durability than a normal spear, but it was easy to use and maximized the passive skill 'Shortening the skill motion when riding' of a spear knight.\n\nThe biggest disadvantage was that it was a one-time consumable. The necessary materials were also difficult to obtain, making it virtually impossible to make several. This was the first time Pon used the item.\n\nChing!\n\nIn the wake of Rail Spear, Pon took out a new spear and rushed over. He ran on the stage and aimed Mach Spear at Katz's neck, who was still in the stunned state. In order to maximize the characteristics of a Blood Warrior, Katz didn't wear heavy armor and turned to grey.\n\n> [System] K-Katz has been logged out!\n\n\"Waaaaaaaaaaah!\"\n\nThe crowd erupted.\n\nFive seconds. Pon secured a win in only five seconds. The combination of the overwhelming attack power of a spear knight and Grid's item led to an unexpected variable. Hao, who was well aware of Katz's strength after facing him in the target processing event, couldn't help feeling appalled.\n\n*The Overgeared Guild... Crazy.*\n\nThe reason Pon could win so easily was that he pulled out a trump card. It wouldn't work so easily on players in the future. Pon had exposed a large amount of his power to win this showdown. The resulting storm could someday grab Pon by the ankle.\n\n*Was it worth it to win this match? He can't win a gold medal anyway.*\n\nNo matter what the users thought, the atmosphere of the National Competition increased because of this confrontation. The heat of the Stade de France National Stadium rose like an active volcano.\n\n> [Announcer] A shocking result!!\n\n> [Announcer] It reminds me of Grid from last year!\n\nLauel gritted his teeth as the host's excited voices were heard.\n\n*Making an item like that and not reporting it to me... No, he kept it a secret because it's such an item.*\n\nIt was a good move.\n\n*Now the only one left is Damian...*\n\nIf Damian lost, Grid would meet Kraugel in the finals. If Grid won, the plan to recruit Kraugel was useless. Lauel's sacrifice of one gold medal would be in vain. Grid and Damian walked onstage as Lauel nervously bit at his fingernails. The host interviewed the players to further enhance the atmosphere.\n\n\"Damian, countless people have predicted your victory. Do you have confidence?\"\n\nPeople were aware that Grid had the special Blackening skill. Blackening was a skill that transformed a player into having a dark attribute. It was natural to be vulnerable to Damian, who had the ultimate divine power. However, Damian's answer was unexpected.\n\n\"Of course, I'm not confident.\"\n\n\"...?\"\n\nThe host stared.\n\nDamian's absurd remarks didn't end there.\n\n\"Grid is the one who beat Pope Drevigo and Pope Candidate Pascal in a one-man raid! Grid is completely a pope killer, a pope killer! A new pope like me isn't his opponent!\"\n\n\"...Huh?\"\n\nThe host and viewers doubted their ears. The fact that Grid raided Pascal was something that many people could guess. But to raid him alone? No, the problem wasn't the pope candidate. Former Pope Drevigo! The existence who killed the ruler of tens of millions of followers was Grid?\n\nGrid had been completely obscure at the time, so this was a very shocking truth.\n\n\"Grid is an onion...\"\n\nSomeone muttered. There was nothing more suitable to describe Grid."
}