{
  "id": 456,
  "title": "Chapter 456",
  "content": "The US representatives clustered around Skull. One of them shook his head.\n\n\"It's ridiculous.\"\n\nThe others started to deny Damian's words. A low murmur spread through their group.\n\n\"Grid raided the pope alone a year and eight months ago? That doesn't track.\"\n\nAnother representative crossed his arms. \"Back then, rankers would've just gotten their second class.\"\n\n\"Grid would've been around level 200. He wouldn't have had the specs to solo a named boss.\"\n\nThe logic seemed sound. The Tzedakah Guild had just finished raiding Malacus around that time, making their name. If Grid was part of that guild, the pope raid was probably a group effort.\n\nOne of them gestured dismissively. \"Damian is a lunatic who calls Grid a 'god.' Half the things he says are bluffs and exaggerations.\"\n\n\"Agreed.\"\n\nThe representatives continued to deny reality. A level 200 user soloing a pope? Impossible. But Zibal stood apart from the group, his expression thoughtful.\n\n*It's possible.* He ran the numbers in his head. *The pope is a priest. High level, sure, but low combat ability. Low defense. A humanoid boss with weak health pools.*\n\nThe logic continued. *Grid's items are insane. That attack power could overwhelm the pope's heals. Kill him outright.* He paused. *But only in a one-on-one situation.*\n\nThe US representatives kept buzzing with their theories.\n\nLauel watched them from a distance. *Stupid.* A proud expression crossed his face.\n\n*Grid was exactly level 150 when he raided the pope. He told me himself.* The memory was vivid. *What level 200?* \n\nHe acknowledged the facts internally. *Sure, Grid had Damian's buff. But that's not the point. He fought the pope alone.*\n\nWarmth spread through his chest. *Grid is the best.*\n\nEvery unique feat. Every step forward. Lauel felt the same thrill each time.\n\n*I want you to win.* His loyalty demanded it. As Grid's vassal, as his fan, he wanted to see Grid collapse the sky above the sky, eclipse every star in the world.\n\nBut Lauel was also a politician. His fingers drummed against his thigh. Reason warred with emotion. For the Overgeared Guild's glory, for Grid's ultimate future, his logical mind whispered a different prayer.\n\n*Please lose.* The thought tasted bitter.\n\nNo one won forever. Everyone tasted frustration. That was life's design.\n\n*If you're going to taste it anyway, better now than later.* The reasoning was cold, calculated. *If Kraugel joins us, we'll be unstoppable.*\n\nThe seven guilds? The hidden forces like Blood Carnival? They would crumble. The Overgeared Guild could challenge the vampire cities, the East Continent, hell itself, dragon lairs, even the Saharan Empire.\n\nThe vision crystallized in his mind. Grid wearing the crown of the first user king. Kraugel at his right hand. The Overgeared members arrayed behind them. A perfect composition leading to a perfect future.\n\n\"Please.\" The word slipped out, barely audible. \"Please.\"\n\nLauel crushed his personal feelings under the weight of reason. He could do this because he knew Grid. Frustration was just another stepping stone. Grid would use it, forge himself stronger. Lauel's trust was absolute.\n\n***\n\nThe revelation rippled through the crowd. The mysterious figure who killed Pope Drevigo and fractured the Rebecca Church was Grid? Suspicion and excitement tangled together in the spectators' faces. Their eyes tracked Grid with something approaching reverence.\n\nThe host seized the inflamed atmosphere.\n\n\"Player Grid!\"\n\nQuestions poured out in a torrent.\n\n\"Did you really raid Drevigo? Is that how you met Damian? What were the circumstances? What kind of person was Drevigo? What items did he drop?\"\n\nGrid ignored him. No obligation to answer. His focus had already shifted entirely to Damian.\n\n*Damian.*\n\nSince their first meeting, those eyes had tracked him. Grid didn't mind. Damian always smiled, always spoke from his heart. Four years older, but somehow Grid felt like the elder watching a younger brother.\n\n\"Damian.\"\n\n\"Yes!\" Damian's face lit up. He responded instantly.\n\nIf Grid asked him to surrender, he would. Right now. Without hesitation. But Grid didn't want an easy victory.\n\n\"Do your best.\"\n\nGrid understood his limits better than anyone. He wasn't ready to challenge Kraugel. Not yet. He needed to grow, and Damian was strong enough to force that growth. Damian might underestimate himself, but Grid saw his strength clearly.\n\nDamian reminded him of Kraugel. That insane buff raising accuracy by 80 percent. Making attacks impossible to evade or block.\n\nDamian's eyes shone like lanterns. \"I will challenge you with all my heart!\"\n\nHis confidence in Grid was absolute. He knew he couldn't win. But he would give everything.\n\n\"Divine Protection, Incarnation of Light, Goddess' Blessing, Light's Blessing, and Divine Favor.\"\n\nThe skills unique to the Goddess' Agent class. To the pope position. The names were plain, almost priest-like. But the power was absolute.\n\n*Flash!*\n\n*Flash flash!*\n\nGreen, white, and golden light erupted in pillars around Damian. His attack climbed. His defense hardened. His accuracy sharpened to inhuman levels. A damage-negating shield shimmered into existence. Duration: three minutes.\n\n\"I can only show a pope's majesty for three minutes.\" Damian's smile was self-deprecating. \"I still can't reach your toes.\"\n\nGrid grasped his greatsword. The weapon carried an option to boost skill damage. He activated the Rune of Darkness socketed in its center.\n\n\"You keep disappointing me when you say that.\"\n\n> [The Rune of Darkness effect is activated. Demonic power has permanently increased by 10. For one minute, 20% additional shadow damage will be added to normal attacks and skills.]\n\n\"Blackening.\"\n\n> [Your black magic power has increased.]\n>\n> [You don't have any black magic power. It will be replaced with demonic power.]\n>\n> [While Blackening is activated, your species will change to half-demon.]\n>\n> [As a half demon, your maximum health is reduced by 50%. Your attack power, magic power and agility will increase by 20% each.]\n>\n> [All attacks will be converted to the black magic attribute.]\n\n*Kuoooooh!*\n\nOminous black energy writhed around Grid's frame. Lantier's Cloak bled to black.\n\n\"Blacksmith's Rage and Quick Movements.\"\n\n*Peeng!*\n\nGrid's skin bleached white from Blackening. One instant he stood across the arena. The next, he materialized directly in front of Damian.\n\n\"Continuous Stab.\"\n\n*Peng!*\n\n*Pepepeng!*\n\nA rare skill from the reservist training in the Behen Archipelago. Grid used the multi-hit attack to strip away Damian's one-time negation shield. But Damian was fully buffed.\n\nHe reacted perfectly. The square shield snapped up, intercepting every strike. Light flared from the shield's edge. Damian's swordsmanship, developed through field work under Piaro's guidance, manifested.\n\n*Puok!*\n\n> [You have suffered 9,900 damage.]\n\nThe blade punched into Grid's stomach. Terrible damage. Damian's ultimate divine power combined with his attack buff. It hurt.\n\nBut Grid stayed calm. His counter targeted Damian's exposed right wrist beyond the shield. Link unfolded. He had used it hundreds, thousands of times. His footwork compressed into minimal space.\n\n*Pipipipipit!*\n\n*Jjeejeeeong!*\n\n*Seokeok!*\n\n> [Goddess' Protection has invalidated the enemy's attack.]\n>\n> [The absolute shield has disappeared.]\n\n\"As expected from Grid!\" Admiration colored Damian's voice.\n\nHe had blocked all Link strikes except one. Grid confirmed the green light's disappearance around Damian. He prepared Pinnacle Kill. It could pierce Damian's high defense.\n\nThen a question surfaced.\n\n*Why use the shield in advance?*\n\nIf he were Damian, he would time it perfectly. Use it to neutralize a critical skill. Why waste it early? Grid cancelled Pinnacle Kill. He moved. Damian counterattacked with the shield and shouted through a smile.\n\n\"As expected from Grid! You didn't take the bait! Goddess' Wrath!\"\n\n*Kwa kwa kwa kwang!*\n\nTheir swords clashed. Behind Damian, two magic circles materialized. White flashes erupted, targeting Grid. He was occupied exchanging blows. The attacks would connect.\n\nBut the God Hands moved.\n\n*Pepeng!*\n\nTwo God Hands locked rigid, intercepting the white flashes. The other two fired Magic Missiles into Damian's wrist. His sword stuttered, momentum broken. Grid exploited the gap with Pinnacle.\n\n*Seokeok!*\n\n\"Kuk!\"\n\nThe blow caught Damian's face. Blood sprayed into his eyes. Blindness status activated.\n\n*Jjejeong!*\n\n*Jjeejeeeong!*\n\nThe blindness only lasted two seconds. Two seconds. Damian raised his shield, hiding behind it like a turtle in its shell. Grid moved to his rear. He used the repulsive force from blocking an attack to reposition. The shield lifted. He struck with Kill. Accurately.\n\nThe commentators across international broadcasting stations fell silent. Grid and Damian in full buff state moved too fast. Few could track the battle process. Fewer still could explain it in real time."
}