{
  "id": 457,
  "title": "Chapter 457",
  "content": "Satisfy's history was still short. Less than two years had passed since e-sports established itself as the most popular culture in the world. The commentators at broadcasting stations in each country lacked experience. There were inevitable limits to their ability.\n\nThe chat exploded with complaints.\n\n*What are the commentators doing? Why aren't they explaining the battle?*\n\n*Really dumb haha. They should take care of their paycheck.*\n\n*Hah. Grid and Damian are so fast that I can't follow them with my eyes. The screen is switching too swiftly.*\n\n*Once the game is finished, the video will be replayed in slow motion...*\n\nViewers around the world voiced their frustration. The commentators could only close their mouths in silence, unable to keep up.\n\nThen a comment appeared on the Internet.\n\n*Korea's OGC Channel is giving correct commentary.*\n\nOGC was the world's first gaming specialty channel. It had a history as an authentic e-sports broadcasting company. The rich experience and professionalism of their commentators couldn't be compared to those from other stations. Viewers from all over the world started flowing to OGC's Internet channel.\n\nThey witnessed an unexpected person. Peak Sword. On the OGC channel, the local ranker was acting as a guest commentator.\n\nPeak Sword leaned forward, his voice rising with excitement. \"Did you see how God Grid's exquisite skill induced Damian's blindness? But the even more impressive thing was his ability to control the God Hands just previously! I'm sure you know how difficult it is to give four different commands to the God Hands while fighting! This is the class of God Grid! Do you know God Grid?\"\n\nThe other commentators sat in awkward silence.\n\nAs expected from a ranker. Peak Sword could accurately grasp and explain the contents of the battle, relieving the thirst of viewers. However, they had to suffer through his terribly biased commentary.\n\n***\n\n\"Kill.\"\n\n*Puok!*\n\nGrid's strike penetrated straight through Damian's full plate armor. Damian's eyes widened as the damage number appeared.\n\n> [You have suffered 16,000 damage.]\n\nDamian coughed, blood flecking his lips. \"As expected from Grid...! That's amazing!\"\n\nHe confirmed his health gauge as soon as the blindness disappeared.\n\n*One quarter of my health disappeared with that blow.*\n\nThe unique class Goddess' Agent was strictly classified as a tanker. By default, it boasted high defense and health, especially when the full buff state and additional defense were added. This was the first time Damian had experienced receiving more than 10,000 damage from a user.\n\n*Right now, only 50% of PvP damage is applied.*\n\nHe was convinced by the damage because the opponent was Grid. Damian laughed and used a healing skill. It wasn't Goddess' Breath, which restored 100% of his health, but Pope's Charity. He only recovered 5,000 health, but this alone was enough to put a strain on Grid.\n\n*There is only Pinnacle Kill.*\n\nGrid was in full buff state. When armed with **Grid's Greatsword**, he was confident that he could kill a few high rankers with one blow. It didn't matter if PvP damage had been reduced to 50%. He only dealt 16,000 damage? Damian's extraordinarily high defense and healing with a short casting time made him frustrated.\n\n*A unique battle duration.*\n\nGrid's odds might be lowered if they fought for a long time. It was wise to make quick decisions. But there was one thing he had to consider.\n\n*Why did he consume the shield in advance?*\n\nHow could the skill that would definitely protect Damian's life be consumed so meaninglessly? Grid couldn't guess what Damian's intentions were. He just instinctively sensed danger based on his cumulative combat experience.\n\n*Chaaeng!*\n\n*Chaaeng!*\n\nIt was two seconds or so. The four God Hands were bothering Damian while Grid thought. Each of them was armed with a sword. Damian blocked everything with his shield, but it wasn't meaningless.\n\n> [The **Sword Mastery** of 'God Hand' has risen!]\n\n> [The experience of **Iyarugt** has increased by 0.1%!]\n\n*I want a long battle.*\n\nDamian's defense abilities were excellent, increasing the experience of the God Hands and Iyarugt. If they fought for a full hour, he might have a chance for Iyarugt's experience to reach 99%. But Grid shook his head.\n\n*It's dangerous.*\n\nWhat if he lost to Damian because he wanted to raise his item rating? He wouldn't be able to fight against Kraugel. His goal.\n\n*Pepeng! Peng!*\n\nThe battle was entering a new phase. Damian noted that Grid had a high level of physical defense and started to aggressively use magic.\n\n\"Holy Cross!\"\n\nDamian was originally a paladin, so he didn't have a lot of magic. Apart from Goddess' Wrath, he only had a few basic magic spells. But that alone was sufficient to threaten Grid in the Blackening state. The pope's absolute divine power burned at Grid.\n\n> [You have suffered 4,100 damage.]\n\n> [You have suffered 3,990 damage.]\n\n\"Ack...!\"\n\nA burning pain! Grid swung his greatsword after being hit by the magic. It was once again easily blocked with Damian's shield. However, it wasn't bad for Grid. In return for defending against Grid's attack, it allowed the God Hand's strikes to go through!\n\nDamian groaned as his side was hit. \"Uhhhh...\"\n\nThe God Hands had much lower attack power than Grid, but they were armed with the best items, such as <span class=\"rarity-legendary\">Failure</span> and **Iyarugt**. They dealt excellent damage. Damian couldn't ignore the God Hands.\n\n*There is a reason why Chris died from the God Hands.*\n\nDamian was convinced and used Pope's Charity when the cooldown ended. Then he became confused.\n\n> [2,500 health has been restored.]\n\n\"Ah?\"\n\nThe healing amount was halved. It was due to Iyarugt that one of the God Hands was using. One of Iyarugt's basic options was to 'reduce the target's healing ability by 50% when attacked,' and this was fatal for Damian.\n\n\"Pagma's Swordsmanship, Wave.\"\n\n*Kurururung!*\n\nAs Damian felt confused, Grid used the footwork of Wave! Damian was hit and his speed slowed down. For Damian, who was slower than Grid from the start, the slowdown debuff was very painful. Grid's Greatsword moved in a big line. It wasn't a profound sword and there was no reason to be excited.\n\nDamian failed to defend and tried to counterattack, but he was too slow. \"Ku...ock!\"\n\nGrid avoided the sword and struck again. Blood rose like a fountain at every spot where the blue black sword moved. Damian kept bleeding. At this point, Grid's Rune of Darkness activation only had 10 seconds left.\n\nGrid's jaw clenched. \"Pagma's Swordsmanship.\"\n\nHe couldn't be passive because he feared the opponent. Grid knew that he needed to sacrifice something to achieve any result.\n\n*Kwadududuk!*\n\nGrid twisted his arm in a bizarre direction and used a skill.\n\n\"Pinnacle Kill.\"\n\nThe ultimate cutting skill. It boasted 100% accuracy and the option to ignore defense. The moment that the most powerful skill penetrated Damian's body.\n\n\"Sacred and Inviolable!\"\n\nThere was a sharp flash of light around Damian's body and Grid instantly became a rag. It was the effect of a reflection skill.\n\n> [You have dealt 40,600 damage to the target.]\n\n> [The target has reflected the attack!]\n\n> [You have suffered 31,050 damage.]\n\nReflection skills were different from counterattack skills. Counterattacking returned the attack to the enemy, on the premise of completely protecting the user. On the other hand, reflection skills were triggered when an enemy's attack hit. The person had to take the damage, so it wasn't compatible with counterattack skills. However, the advantage was that the difficulty was much lower.\n\n\"Kuack!\"\n\n\"Keok!\"\n\nGrid and Damian screamed at the same time. Both were wounded and their health gauges fell sharply. In particular, Grid was on the brink of death. He had less than 100 health left. It was like a miracle that he survived!\n\n*Wow, Grid survived that.*\n\n*He has good luck!*\n\nIt was extremely rare for anyone to know about Grid's immortal passive. It was only the Overgeared members and Kraugel. The viewers thought that Grid's survival was purely based on luck. But what was the truth?\n\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\nGrid's eyes blazed. \"Ohhhhhh!\"\n\nDamian raised his square shield. \"Goddess' Breath.\"\n\nGrid decided to fight during the five second window, while Damian set up a square shield and used Heal to slow down his momentum.\n\n> [50% of your health has been restored immediately.]\n\n\"This...\"\n\nThe one who spoke was Damian, not Grid. Originally, Goddess' Breath restored 100% of his health, but this was halved due to Iyarugt.\n\n*Dangerous!*\n\n*Jjejeong!*\n\nThe momentum behind Grid's greatsword was terrifying. Damian had no reason to meet it face to face, so he used magic.\n\n*Damian will win!*\n\nEveryone in the world was convinced, except for Kraugel and the Overgeared members. It was natural. Grid's health was currently at the bottom! It was obvious he would die when hit by magic and Damian would be the winner. But the result was different from what everyone expected.\n\n*Eh?*\n\n*Why isn't he dead?*\n\n*Pepepepeng!*\n\nGrid flew into the air and pierced through Damian's magic. He didn't die and his sword pierced Damian's heart.\n\n*Puok!*\n\nDamian's eyes widened. \"Indeed...\"\n\nThe second blow.\n\n\"You...\"\n\nThe third blow.\n\n\"...Are a god.\"\n\n*Puok!*\n\nThe fourth blow. It was Linked Kill. Damian had all his abilities returned to normal due to the duration of the buffs being over. He couldn't withstand Linked Kill and turned to grey. His last appearance of giving a thumbs up to Grid gave a strong impression to the Korean people.\n\nGrid was left alone on stage. \"Good work.\"\n\nHe landed on the ground and paid homage to Damian. There was a notification window that the rating of Tiramet's Belt had increased."
}