{
  "id": 46,
  "title": "Chapter 46",
  "content": "# Chapter 46\n\nGrid wiped sweat from his brow. *Duplicator.*\n\nBlood Witch Yura. First ranked in South Korea. Fifth on the unified rankings. She stood above two billion users, and even *she* had to chant lengthy spells to unleash great magic. But Euphemina claimed to be a Duplicator. She could fire off devastating spells without a single word.\n\n*A magician class that copies other people's skills. Epic rated, sure, but this is fucking broken. How is this balanced?*\n\nHe knew magicians. Their versatility was decent. Utility spells for various situations. But their real strength lay in raw destructive power. A warrior could carve through dozens of enemies with blade and spear. A magician could erase an army with a single spell. That kind of firepower came with a price, though. Every spell required a chant. The stronger the magic, the longer the incantation. That vulnerability defined the class.\n\nEuphemina ignored that rule entirely. She could chain-cast without pause. The magician's fatal weakness didn't exist for her.\n\nGrid ran his fingers through his hair. *So a Duplicator copies any skill type and casts spells with zero penalty. That's just... I don't even...*\n\nHis head hurt thinking about it. The class defied logic. She could even learn Advanced Blacksmith's Craftsmanship.\n\n\"Screw it.\" Grid shook his head. \"It's a fraud class. That's all.\"\n\nHe stopped trying to understand and focused on finding Huroi. Analyzing Euphemina's advantages only made him feel worse about his own situation.\n\n***\n\nEuphemina stood alone among the soldiers.\n\n\"That shameless bastard.\"\n\nGrid had run. Just abandoned her in this reeking dungeon. She'd come here to rescue him. Accepted Rabbit's quest. Retrieved his <span class=\"rarity-unique\">Unique</span> dagger when he lost it. Returned it to him like some helpful NPC. All to maintain a good relationship. All so he'd craft that <span class=\"rarity-unique\">Unique</span> orb she needed.\n\nAnd this was her reward. He'd used her power to clear his quest, then left her as bait.\n\n\"I understand the tactic.\" Her voice dropped to a whisper. \"One person draws aggro while the other completes the objective. Basic strategy. But...\"\n\nHer anger simmered.\n\n\"He dared use *me* as bait?\" The words came out sharp. \"Without my help, he'd still be rotting in that cell. That <span class=\"rarity-unique\">Unique</span> dagger would be gone. And this is how he repays me?\"\n\nThe temperature plummeted. Frost crept across the stone floor.\n\n\"W-What's happening?\"\n\n\"She's a magician! Don't let her cast!\"\n\nThe soldiers felt their armor grow cold. Ice crystalized on metal. They charged, but their boots stuck to frozen puddles.\n\nToo late.\n\n\"Frost Queen's Breath.\"\n\nThe air crystallized. A blizzard erupted in the enclosed space. Soldiers screamed as ice climbed their legs. It spread upward. Knees. Waist. Chest. Their shouts cut off as frost sealed their mouths. Within seconds, fifty men became statues. Their faces locked in expressions of terror.\n\nEuphemina trembled. Not from cold.\n\n\"Grid.\" She stared at the frozen soldiers. \"If you hadn't promised that orb, I would hunt you down.\"\n\nShe'd prepared dozens of duplicated spells to handle Piaro. Eleven remained. Meanwhile, soldiers kept coming. An endless stream. Like products rolling off an assembly line.\n\nAnd the knights. Five knights served Winston's lord. She hadn't encountered a single one yet. They were out there. Waiting.\n\n*Can I kill five knights and infinite soldiers with eleven spells?*\n\nThe answer was no. NPC knights started at level 180 minimum. Euphemina was skilled, but those odds were suicide.\n\nShe exhaled slowly. Regret tasted bitter. She'd been blinded by quest rewards and the prospect of Grid's friendship. Now the water had spilled. She couldn't abandon the quest.\n\nBoots echoed in the corridor. More soldiers.\n\n\"Wait. Weren't there two intruders?\"\n\n\"Yeah. Intel said Grid and the woman were working together. But I only see her.\"\n\n\"Grid went a different route!\"\n\n\"He's after Huroi! The bastard dropped to the fourth floor. Split the force. Half stays here. Half hunts Grid.\"\n\nThe soldiers confirmed she was alone. Then they divided with practiced efficiency. She'd noticed it before. These northern troops were disciplined. Even the low-level grunts adapted quickly. Proof of rigorous training. Weak stats didn't mean easy kills.\n\nEuphemina focused.\n\n\"Demon King's Tail...\" She paused. *No. Fire magic in these tight corridors would cook me too.* \"Sword of Light.\"\n\nWhite radiance materialized overhead. A blade of pure luminescence. She pointed at the soldiers pursuing Grid.\n\nThe sword swept through them. Bodies fell in pieces. Blood painted the walls. Euphemina followed up with another spell. The remaining soldiers collapsed.\n\nNine spells left. She wanted to conserve power, but reinforcements were already coming.\n\n*This is bad. Worst case, I'll need Rolling Dice.*\n\nRolling Dice gave random effects. Good luck meant a game-changer. Bad luck meant disaster. She'd wanted to wait until her luck stat was higher, but options were running out.\n\nFirst priority was killing the knights while Grid rescued Huroi.\n\n\"The problem is he's completely untrustworthy.\"\n\nA cold certainty settled in her gut. Grid would run. He'd save Huroi and abandon her to die.\n\n*Can I trust garbage like him? If he has even a shred of conscience...*\n\nShe tried to think positively.\n\n\"Who am I kidding?\" The words came out choked. \"That bastard has no conscience! What do I do?\"\n\nEuphemina wanted to cry. If she could turn back time, she'd refuse Rabbit's quest without hesitation.\n\n***\n\nThe fourth floor's deepest solitary cell.\n\n\"Uhhh... nngh...\"\n\nHuroi had reached his limit. He couldn't smell the rotten water anymore. Couldn't hear. Couldn't see. Trapped in a space barely wider than his shoulders, darkness had consumed everything. He'd forgotten where he was. Why he was here. Even his own name had started to slip away.\n\nFifty hours real time. Two hundred hours in Satisfy. Alone in the black.\n\n\"Kuohh... Kuaaaah!\"\n\nHis scream echoed through the dungeon.\n\nGrid heard it.\n\n*Huroi?*\n\nThe voice was familiar but distorted. Pain-soaked. Grid recognized it anyway. Those screams came from the end of the corridor.\n\n\"Hang on!\" Grid ran forward. \"You damn bastard. You're going to pay me back for every second of this suffering.\"\n\nOnce this quest cleared, he'd punch Huroi two hundred times. Minimum. His boots pounded stone.\n\nThen he stopped.\n\n\"I've been waiting.\"\n\nLeo stood in the corridor. The young knight Grid had insulted during interrogation. He blocked the path completely.\n\n\"What?\" Grid's eyes widened. \"Bachelor Ghost? Why are you here?\"\n\nHe'd predicted most knights and soldiers would guard the third floor or the exits. A knight on the fourth floor made no sense.\n\n\"Who are you calling Bachelor Ghost?\" Leo's face flushed red. \"Weren't you allied with Huroi? I expected you wouldn't escape alone. I knew you'd come for him. So I waited here.\"\n\n*Damn it. I only spoke to Huroi a few times. These NPCs are too smart.*\n\nGrid scanned the corridor. Just Leo. No soldiers.\n\nLeo noticed and laughed.\n\n\"Looking for backup?\" He sneered. \"You think I need soldiers for trash like you? I'm more than enough to tear you apart. Grid! You'll pay for that insult!\"\n\nThe knight's expression radiated satisfaction. He'd been nursing this grudge for hours. Grid mentally kicked himself.\n\n*I made him psychotic with rage. If I'd known, I would've kept my mouth shut.*\n\nAnother lesson learned too late. Don't provoke people. Regret always came after the consequences.\n\nLeo's blue cloak snapped behind him as he charged.\n\nGrid activated his skills.\n\n\"Blacksmith's Rage. Quick Movements.\"\n\n> [<span class=\"rarity-rare\">Blacksmith's Rage</span> has been activated.]  \n> [Your attack power will increase by **15%** and attack speed by **30%** for 20 seconds.]\n\n> [<span class=\"rarity-rare\">Quick Movements</span> has been activated.]  \n> [Your **Agility** and evasion rate will increase significantly for 1 minute.]\n\n---\n\n*Glossary of Common Korean Terms:*  \n*OG: Glossary Link.*\n\n*Current schedule: 20 chapters a week.*\n\n*Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.*"
}