{
  "id": 460,
  "title": "Chapter 460",
  "content": "Grid stepped forward. His voice cut through the stadium.\n\n\"I will obtain the title of the strongest.\"\n\nThe Stade de France erupted. Sixty thousand throats roared at once. The sound hit like a physical wave.\n\n\"Grid! Grid! Grid!\"\n\n\"Does he think he can beat Kraugel?\"\n\n\"Arrogant bastard!\"\n\nThe cheers were outnumbered. Jeers drowned them out. Kraugel's faithful packed the stands—millions more watched the broadcast. He was the untouchable peak. The genius no one dared envy. He stood alone in a category the world had invented just for him.\n\nObjectively, Grid was outmatched. Everyone knew it. The man didn't understand what he'd challenged. The crowd noise swelled into chaos.\n\nKraugel spoke.\n\n\"This time, I won't lose.\" His jaw tightened. \"No. I can never lose.\"\n\nSilence dropped like a guillotine blade.\n\nThe stadium held its breath. Sixty thousand people froze.\n\n*This time I won't lose?*\n\n*This time?*\n\n*It can't be.*\n\nThe implication hung in the air, impossible to dismiss. Kraugel had already lost to Grid. When? How? The questions had no time to form answers.\n\nThe system notification materialized.\n\n> [The match will now begin.]\n\nNo fanfare. No host announcement. Just cold text.\n\nGrid moved. His heart hammered against his ribs. *Pagma's Swordsmanship.*\n\n\"White Light Steps.\" Kraugel's expression hardened into something grim.\n\nThey exploded into motion simultaneously. Grid's footwork painted crimson trails across the stage—each step a brushstroke of blood-red light. Kraugel moved differently. Elegant. Economical. He blurred at the edges and vanished.\n\nThe skill was called White Light Steps. It boosted movement speed, enhanced terrain adaptation, functioned as both dash and dodge depending on mastery. Under direct sunlight or moonlight, it granted stealth.\n\nThe sun blazed overhead. Kraugel's element.\n\n\"He disappeared!\"\n\n\"Where did he go?\"\n\nThe spectators leaned forward in their seats. Eyes scanned the empty space where Kraugel had been. Any second now, he'd materialize behind Grid. One strike. That's all it would take.\n\nGrid began his sword dance. The words left his lips between flowing movements.\n\n\"Magic Detection. Link.\"\n\nNot the standard spell. Braham's version—rewritten from first principles. Casting time minimized. Effect maximized. Kraugel's position snapped into Grid's awareness like a compass finding north.\n\nDozens of energy blades screamed through the air.\n\nThe ambush failed. Kraugel pivoted to defense.\n\n*Chaeng!*\n\n*Chaeeeeeng!*\n\nFast. Brutal. <span class=\"rarity-unique\">Iyarugt</span>'s crimson glow clashed with <span class=\"rarity-legendary\">White Fang</span>'s pale luminescence. They traded blows multiple times per second. The collision birthed a storm of steel and light. Sparks showered the stage, scorching the synthetic surface. The display mesmerized the crowd—two masters at the absolute peak of their craft.\n\nThe commentators fell silent. Even Peak Sword of OGC couldn't track the movements.\n\nJishuka's eyes darted between the fighters. *This is crazy.* As the godly archer with maxed Agility and Hawk Eyes, only she could follow them. Barely. If either turned on her, she'd be dead before the counterattack formed in her mind.\n\n\"It isn't just fast.\" She spoke to herself, awed. \"The sword's orbits keep changing...\"\n\nKraugel earned his nickname honestly. Godly Control—a title reserved for those who transcended human limitations. But Grid? When had Grid reached this level?\n\n*Did he grow again during this competition?* Jishuka's mind reeled. *He faced the strongest PvP fighters in the world and came out stronger.*\n\n*Jjejeong!*\n\nThe final strike of **Link** launched both fighters backward. They slid to opposite ends of the stage. Their gazes locked.\n\nKraugel felt only admiration. *He's incomparably stronger than before.*\n\nGrid's thoughts were less serene. *Crazy... He blocked that skill like it was nothing?* Kraugel hadn't just defended. He'd redirected each strike of **Link**, weakening the trajectory, turning Grid's own momentum against him.\n\n*Is this even human?*\n\nThe comparison clicked into place. Piaro—in his prime as a Great Swordsman—had fought Kraugel in Reidan. Piaro had called him \"a genius eligible to become a Sword Saint.\" No surprise there.\n\n*I can never win a pure physical fight.* Grid's strategy shifted. *Need to use crowd control.*\n\nThe **God Hands** materialized as Grid activated **Restraint**. The plan was simple. The floating hands would occupy Kraugel while Grid completed the skill's casting sequence. It worked. The **God Hands** wielded their weapons and fired **Magic Missiles**. Kraugel wasted precious seconds dealing with them—approximately 1.5.\n\n**Restraint** completed.\n\nThen a ring on Kraugel's hand flared with light.\n\n> [The target has resisted the 'overwhelmed' effect!]\n\nGrid's jaw clenched. \"Items!\"\n\nOf course. Overgeared wasn't a Legendary Class exclusive to Grid. Kraugel had run more raids, cleared more dungeons, survived more impossible quests than anyone. His equipment collection included dozens of resistance accessories.\n\nKraugel closed the distance. <span class=\"rarity-legendary\">White Fang</span> came in low, angled toward Grid's heart. The **Heart Selection** passive activated—guaranteeing the strike would hit a vital point. But Grid had counters. The <span class=\"rarity-unique\">Slaughterer's Eye Patch</span> showed him the trajectory. <span class=\"rarity-unique\">Iyarugt</span> moved to intercept.\n\n*Jjejeong!*\n\nThe blades met again.\n\n> [The experience of Iyarugt has increased by 0.1%!]\n\nGrid gasped. *Just one exchange gave that much experience?* The quality of Kraugel's swordsmanship factored in, yes. But the level gap between them played a larger role.\n\n*Anyway, thank you!* His mind raced. *If I can hold out, maybe Iyarugt will rank up mid-fight. Then I can turn this around—*\n\n> [You have suffered 2,100 damage.]\n\nPain lanced through his side. Grid's eyes widened. *When did he—?*\n\nA dagger. Kraugel had drawn a second blade—this one engraved with a dragon's tail motif. Now he fought with <span class=\"rarity-legendary\">White Fang</span> in his right hand, the dagger in his left.\n\n*Jjejeong!*\n\n*Jjeejeeeong!*\n\n\"Kuh—\" Grid bit back the grunt of pain.\n\nThe dual-wielding style transformed Kraugel's offense. The gap between strikes vanished. The sword paths became labyrinthine. Attacks came from angles more irregular than Regas's Taekwondo combinations.\n\nGrid couldn't keep up. He started taking hits.\n\n> [You have suffered 1,950 damage.]\n> [You have suffered 5,130 damage.]\n\nThe dagger damage was manageable. <span class=\"rarity-epic\">Tiramet's Belt</span> had recently increased in rating. And Grid wore <span class=\"rarity-legendary\">Triple Layers</span>—the strongest armor in existence.\n\n<span class=\"rarity-legendary\">White Fang</span> was the problem.\n\nGrid knew that sword intimately. <span class=\"rarity-legendary\">+9 True White Fang</span>. If Kraugel landed three consecutive hits, the combo would cripple Grid. He tried to interrupt the chain. Failed.\n\n> [You have suffered 4,900 damage.]\n> [Your weakness is exposed!]\n> [Doran's Ring has been equipped.]\n> [You were hit by a sharp cut and suffered 12,900 damage!]\n> [Health has been absorbed due to the option effect of Doran's Ring.]\n\nBlood sprayed. Grid coughed, crimson flecking his lips. The wounds multiplied across his body.\n\nThe crowd's murmur built into a wave.\n\n\"The battle turned one-sided so fast...\"\n\n\"Grid's better than I expected, but it's over now.\"\n\n\"Of course! The sky above the sky won't fall to some upstart!\"\n\nStrength was always relative. Grid had demonstrated excellence throughout the competition. But standing before the peak, he looked diminished. Ordinary.\n\nThey were wrong. The crowd kept forgetting. Grid couldn't be measured by normal standards.\n\n\"Haaap!\"\n\nGrid took another strike deliberately. His hand shot upward. One of the **God Hands** flew to meet his grasp and placed <span class=\"rarity-legendary\">Grid's Greatsword</span> into his grip.\n\n> [The +8 Grid's Greatsword has been equipped as a secondary weapon.]\n> [Only 50% of the weapon's attack power is applied due to the double wielding penalty.]\n> [Grid's Greatsword has increased attack power by 30% and skill damage by 20%.]\n\nGrid knew dual-wielding too. <span class=\"rarity-unique\">Iyarugt</span> in his right hand. <span class=\"rarity-legendary\">Grid's Greatsword</span> in his left. He met Kraugel's two-blade style with his own.\n\nKraugel's eyes narrowed. *This attack speed... with a greatsword?*\n\nHow high was Grid's Agility? And that blue-black blade—it didn't suffer the normal attack speed penalty at all.\n\n*Jjejeong!*\n\nThe force of Grid's assault lifted Kraugel off his feet. Strength won out over technique. Kraugel's body flew backward, his control momentarily lost.\n\nGrid saw the opening. **Pagma's Swordsmanship, Pinnacle Kill.**\n\nThe targeted skill. Unavoidable once activated. Kraugel recognized the technique—he'd analyzed its properties. Defense was meaningless against its armor-penetrating power. A counterattack was his only option.\n\n*I can't let this land.* The attack power was too high. Kraugel's counter skill was ordinary—it wouldn't overcome **Pinnacle Kill**'s momentum. *Should I use Super Sensitivity?* He hesitated. This fight would go long. Wasting his trump card now could cost him the match.\n\nHis decision came in a fraction of a second. A close-range kick.\n\n\"Jajinmori.\"\n\n*Peeeeeong!*\n\nThe charged strike slammed into Grid's abdomen with perfect precision. But Grid didn't budge. **Pinnacle Kill** continued its execution.\n\nKraugel's expression twisted. A **God Hand** had blocked the kick at the last instant.\n\n*Seokeok!*\n\nThe empowered stab punched through Kraugel's abdomen.\n\n*Puok!*\n\nBlood erupted skyward. Red droplets fell like rain.\n\nThe world held its breath."
}