{
  "id": 461,
  "title": "Chapter 461",
  "content": "*It was predicted.*\n\nJajinmori was a kick used without preliminary actions. It hit the target at close range, impossible for the opponent to see and respond. But Grid perfectly blocked it with the God Hand. It was clear he had accounted for the timing of an action performed only once in public before.\n\n*That is enough.*\n\nKraugel appreciated Grid more than anyone else. Even more than Lauel, Damian, and Peak Sword. But now it seemed he had undervalued him. Grid's true abilities surpassed Kraugel's assumed range.\n\n*An incredible growth rate. Is this due to special training with Piaro?*\n\nKraugel couldn't imagine Grid had reached the 60th island of the Behen Archipelago. He raised his rating of Grid to a new level.\n\n*He can't be estimated.*\n\nKraugel had already prepared a number of contingencies. He searched for the best method in real time.\n\n**Duk.**\n\n**Duduk.**\n\nBlood dripped from Kraugel's abdomen. Red and wet drops fell on the stage where signs of destruction remained. The metallic scent hung in the air.\n\n\"T-This is impossible...\"\n\n\"Kraugel was wounded...?\"\n\nThe crowd reacted as if the sky had fallen. The sky above the sky. The high sky that no one could reach. Had he ever been hurt in a one-on-one match? No. It was common sense that Kraugel was invincible. However, Grid destroyed it at this moment. Their common sense shattered.\n\n『 When Kraugel said he lost to Grid... It was true? 』\n\n『 That's impossible. It's impossible for Kraugel to lose in a one-on-one match. In the first place, isn't he a monster that doesn't get hit by non-targeted skills? It's impossible for anyone to beat him. 』\n\n『 Grid succeeded with a targeted skill, but the battle situation will soon change again. It will become favorable towards Kraugel! 』\n\nThe people of the world still believed in Kraugel's victory, but Grid was different. He found hope that he could win. He recovered the greatsword buried in Kraugel's abdomen and at the same time, linked another attack with Iyarugt. Grid's face twisted with desire for victory.\n\nHowever, reality wasn't that easy.\n\nKraugel's voice cut through the arena. \"Mole Ascension.\"\n\nHe was over 40 levels higher than Grid. In addition, he possessed more than 15 titles that exerted all types of effects. He wouldn't collapse because of one hit from Pinnacle Kill. He avoided Grid's attack while a beam shot upwards from White Fang. Iyarugt and Grid's Greatsword crossed in an X to try and defend, but Kraugel interfered by stabbing the dagger in that gap.\n\n**Seokeok!**\n\n\"Kup...!\"\n\nGrid's jaw snapped back. He resisted the 'fainting' status through sheer will. Then he used Pagma's Swordsmanship, Pinnacle. During the process, Kraugel's dagger stabbed twice into his side, but he ignored it. He was convinced he could take the lead in the battle by accumulating damage with Pinnacle Kill and now Pinnacle. However, the destructive power of Pinnacle was different from Pinnacle Kill, and Kraugel was able to counter.\n\n\"Tearing the Sky.\"\n\nTearing the Sky was one of the White Swordsman's ultimate moves. The fatal disadvantage was its mana consumption, but it was a counterattack skill that exerted high power by ignoring a certain percentage of the target's defense.\n\n**Kwajajajajak!**\n\nHuge beast claws carved into the sky where Grid stood. The aura of Pinnacle shattered and the durability of Iyarugt and Grid's Greatsword took damage. Five rows of blood appeared on Grid's chest.\n\n\"Kuaaaak!\"\n\nGrid let out a rare loud scream. His defense was so high that he rarely felt pain. However, the damage suffered from the +9 True White Fang's counterattack was enormous. Now almost all his defense was ignored and the pain tore through him like fire.\n\nThen Kraugel's kick slammed into Grid's face.\n\n**Peeng!**\n\nThere was a sound like a balloon popping. Fortunately, Grid's face was unharmed. It was impossible to damage Grid with a generic kick, even if it was Kraugel. However, he successfully used Grid's face as a foothold to gain a favorable position. His black robe flapped and Kraugel rose in the air, an intense light shining around White Fang.\n\nIt was the precursor to a certain skill that Grid remembered.\n\n*Meteor Sword!*\n\n**Kuooooooh!**\n\nKraugel used White Light Steps to shoot towards the ground. A gigantic momentum like a meteor falling was created, and a deep pit formed in the 10m area of the stage around Grid. Grid struggled to try and stand upright.\n\n*Magic Detection is still on cooldown...!*\n\nGrid missed Kraugel's position because of the cloaking effect of White Light Steps and eventually used Revolve. Then he invoked Blood Cry.\n\n**Kiiiing.**\n\nIyarugt cried out enthusiastically. In the past, it was a balance loss inducing skill that was able to cancel out Kraugel's Meteor Sword in Reidan. One of Kraugel's rings shone.\n\n**Peeng!**\n\nIt was a ring with the effect of 'awakening.' It burst and restored the wearer's mind. Thanks to it, Kraugel was able to get rid of the tinnitus in his ear and safely complete Meteor Sword.\n\n**Jjeejeeeong!**\n\n\"Kuaaaaak!\"\n\nIt was thanks to the items that boasted the best defense, Lantier's Cloak and Triple Layers, that his life was saved. The power of the enemy's sword, which dealt damage equal to the target's defense plus fixed damage, inflicted a serious wound on Grid.\n\n**Tak.**\n\nUnlike his fierce momentum, Kraugel landed lightly and threw the dagger to one side. It was towards the four God Hands in the distance, hammering in front of a small blast furnace. A notification window popped up in front of Grid.\n\n> [The skill Item Combination has been cancelled!]\n\n*Dammit!*\n\nIt was a difficult skill to use in practice. Grid had one third of his health remaining and stood at the crossroad of choice.\n\n*I can't use Blackening either.*\n\nHis stats would rise with Blackening and he would be able to fight evenly with Kraugel. But he hesitated. It was because Iyarugt's experience was at 99%.\n\n*I can raise the rating if I endure the next 50 or so attacks.*\n\nIf he lowered his health with Blackening, it would be harder to hold on. He didn't want one of them to die before Iyarugt's rating increased. Of course, it was Grid who was likely to die.\n\n*Endure first.*\n\nHe made up his mind and put Grid's Greatsword into the inventory. He wasn't confident enough to concentrate on dual wielding while facing Kraugel.\n\n*Does he have a way?*\n\nKraugel felt alert because Grid didn't use Blackening. The health that had decreased due to Pinnacle Kill was slowly recovering due to the effect of the title 'Troll King's Curse.' He believed that time was on his side, but became nervous due to Grid's attitude.\n\n*I don't think I should drag out the time.*\n\nHe couldn't make a hasty decision just because he wanted to free his mother from pain as soon as possible. At this time, Kraugel analyzed the situation more calmly and carefully than before. Thus, he believed in his own judgment.\n\n*Fast paced!*\n\n**Kurururung!**\n\nThere was the sound of thunder from the clear sky and the earth began to surge. The stage that Kraugel and Grid stood on shook violently, tilting and partially collapsing. The commentators shouted simultaneously.\n\n『 This...! 』\n\n『 This is the precursor to the wide-range skill that Kraugel used to defeat Tarma! 』\n\nHeaven and Earth Rupture. It was the unique rated skill that Kraugel learned from the East Continent prior to the National Competition. It wasn't lacking in terms of range or power. It was the strongest attack that dominated the sky and earth.\n\nKraugel spoke the name. \"Heaven and Earth Rupture.\"\n\n**Kwa kwa kwa kwang!**\n\nFrom the sky, heavy lightning bolts rained down and lava rose from cracks in the ground. There seemed to be no way to escape, meaning Grid would be hit hard. The Russian citizens cheered.\n\n\"Kraugel won!\"\n\n\"Russia is first!\"\n\nOn the other hand, the Korean people were frustrated.\n\n\"How to avoid a skill like that...?\"\n\n\"It seems like the world is tilting...\"\n\nIt was the moment when the audience ratings of the National Competition reached its peak!\n\n> [The effect of the title 'Secret Hero' has been used.]\n> [You have dispersed the consciousness of the enemies.]\n\nThe aggro was turned off.\n\n> [The skill 'Influence' has been activated. This effect will last for 10 seconds.]\n> [Reduces the defense of all enemies within 50m of you by 50%.]\n> [The skill 'Freely Move' can be used once.]\n\nIt was a high level dash skill that avoided all attacks until it reached the 'desired target' within 200 meters.\n\n**Peeeeeong!**\n\nGrid used Quick Movements and ran like a lightning bolt. His movement speed was so fast that it left a long afterglow. It wasn't a straight movement. Grid moved from side to side, avoiding the lightning and lava that were in his way.\n\n\"...!\"\n\nIt was like looking at Kraugel. The crowd and viewers were speechless at Grid's phenomenal control.\n\nGrid's voice cut through the chaos. \"Blackening. Blacksmith's Rage. And Linked Kill.\"\n\nLasting 50 blows against Kraugel? It was crazy. Now he needed to win!\n\n**Peeng!**\n\nGrid made a decision and swung Iyarugt once.\n\n**Pepeng!**\n\nThe second blow.\n\n**Pepepeng!**\n\nThe third blow. Kraugel stabbed forward in order to break it. But it was useless. Grid's attack speed was too fast for him to handle and the God Hands also pincer attacked him. This made Kraugel collapse in the process of dodging.\n\n*Too late...!*\n\n**Peeeeeong!**\n\nIn the end, the fourth blow of Linked Kill precisely struck Kraugel. Kraugel chose to give up avoidance and blocked. Of course, it wasn't possible to completely stop it. However, he used Eagle's Descent and pressed down on Iyarugt in order to minimize the damage. However, due to the high attack power from Grid's buffed state, Eagle's Descent couldn't stop Iyarugt's momentum.\n\n**Puoook!**\n\nKraugel's chest was struck! He had one fifth of his health left, and straightened his staggering posture. Subsequently, White Fang moved upwards in a diagonal manner.\n\n**Chaaeng!**\n\nGrid blocked it and counterattacked. Kraugel also blocked it and repeated a counterattack.\n\n**Chaaeng!**\n\n**Chaeeeeeng!**\n\nThe bodies of the two men gradually rose into the sky as they exchanged blows. It was a phenomenon caused by not resisting the repulsive force that occurred whenever the two swords collided.\n\n\"...\"\n\nThey knew that Kraugel was strong. But this strong? In addition, how was Grid able to pull out Kraugel's full power?\n\nThe rankers in the National Competition started to feel the level difference.\n\n*We... We haven't even experienced half of their abilities.*\n\nAn entirely different class. The sky called Kraugel was much higher than they thought, and Grid was an impregnable tower, not one that would collapse."
}