{
  "id": 462,
  "title": "Chapter 462",
  "content": "*CLANG!*\n\n*CLANG!*\n\nGrid and Kraugel's bodies launched skyward. Blood and sweat sprayed from their frames, droplets catching the light like scattered stars.\n\n*His attack power is too strong.*\n\nKraugel forced himself through another exchange with Grid, who was operating at full buff capacity. Each collision sent shockwaves down his blade. He twisted his wrist, redirecting the destructive force along his sword's edge. His stamina plummeted. Pain lanced through his joints.\n\nBut the physical strain was nothing compared to the mental weight. One mistake. One lapse in concentration. If Grid's blade connected cleanly, it was over. His mother would continue to suffer. The thought carved into Kraugel's focus like a chisel on stone.\n\n*I have to win.*\n\nKraugel's mind sharpened beyond human limits. Keen Senses flared to maximum output. He parried Iyarugt with White Fang, then drove his dagger into the exposed gap.\n\n*Thunk!*\n\n*Clang!*\n\n*Thunk!*\n\n*CLANG!*\n\nWounds accumulated across Grid's body. Blood splattered across the mask covering his face in intermittent streaks.\n\n*Unbelievable.*\n\nGrid pressed forward despite his mounting injuries. He held every advantage. Attack power, attack speed, stamina. So why was he the only one bleeding? The Slaughterer's Eye Patch showed him optimal strike paths. Iyarugt guided his blade to perfect angles. Yet Kraugel's body remained untouched. Like trying to grab smoke.\n\n*This is what the sky looks like.*\n\nAn unreachable height. The old Grid would have drowned in resentment. Would have cursed his lack of natural talent. Would have raged against the unfairness. But Grid had changed. The inferiority complex that once defined him was gone. In its place, something hotter burned.\n\n*When I knock you down...*\n\nDefeating Kraugel would prove everything. \n\n*I'll claim the title of strongest!*\n\nHis limitations didn't matter. This was his chance to demonstrate that effort counted for something.\n\n\"I!\"\n\n*CRACK!*\n\n\"Will! Win!\"\n\n*Thunk!*\n\nGrid roared to fuel his own fighting spirit. The battlefield answered him with cruelty. Kraugel's dagger punched into his side again. At OGC Station, where viewership had peaked, the commentators' voices fell.\n\n『 It's almost over. 』\n\n『 Grid achieved something remarkable. The Korean people won't forget what he gave them. A dream we thought impossible. 』\n\n『 Absolutely. Grid transformed our reputation in Satisfy. From laughingstock to contenders for first place on the rankings. That legacy is eternal. 』\n\n『 Grid loses today. But no one should condemn him for it. He fought with everything he had. 』\n\nYoung Korean players watching the broadcast felt fire ignite in their chests.\n\n\"I want to be as strong as Grid.\"\n\n\"I'll stand beside him at the next National Competition.\"\n\nThe desire to reach Grid's level consumed them. Just as Grid looked up at Kraugel with awe and envy, countless youths now gazed at Grid the same way. The former fool nobody acknowledged. The man who refused to quit.\n\n『 God Grid isn't losing this. 』\n\nAmong the chorus predicting Grid's defeat, a few voices dissented. OGC's guest commentator, Peak Sword, chief among them.\n\n『 God Grid already beat Kraugel once before. And it wasn't just Kraugel. He's always faced stronger opponents alone and won. This time is no different. I guarantee it! 』\n\nPeak Sword's conviction spread.\n\n\"Our son will win!\"\n\nSehee clasped her parents' hands. They prayed together in silence.\n\n\"I'm betting 100,000 gold on Grid!\"\n\n\"One million gold!\"\n\n\"All in!\"\n\n\"Are you people insane? We can't actually bet on Grid.\"\n\nThe Overgeared members shouted over each other.\n\n\"We used to mock you. Harass you. That's over now. You probably won't forgive us, but we acknowledge you, Shin Youngwoo. We're cheering for you. So please... win!\"\n\nThe 45th graduating class of Heroes High School watched with clenched fists.\n\n\"Youngwoo, don't lose!\"\n\nYerim's voice cut through the noise.\n\nEveryone who witnessed Grid's transformation believed. They refused to accept that his efforts meant nothing. But reality doesn't bend to faith or wishes.\n\n*Crack!*\n\nGrid took consecutive dagger strikes. White Fang pierced his throat.\n\n\"Ah...\"\n\nThis was the end. The crowd erupted for Kraugel. Those hoping for a miracle fell silent. On the stands, Lauel squeezed his eyes shut. He wanted Kraugel to win, yes. But watching Grid fall hurt more than he'd anticipated.\n\n『 Wait! Grid still has hope! Remember the Damian match. He possesses a one-time immortal passive skill! 』\n\nDuring his battle with Damian, Grid had survived a fatal spell despite critical health. The commentators had theorized about his legendary immortality passive ever since. At that moment, a notification materialized before Grid's eyes.\n\n> [The effect of **Evil Spirit's Bloody Tears** is activated. Your attack power will increase by **50%** for 5 seconds.]\n\nEvery strike Kraugel landed had painted Grid's mask redder. Now the Slaughterer's Mask was completely drenched in crimson. Exactly as planned.\n\n\"Haaap!\"\n\n*CRACK!*\n\n\"Hup!\"\n\nThe sudden spike in Grid's attack power caught Kraugel off guard. Their blades met. White Fang's durability cratered. The impact numbed Kraugel's right arm. An overwhelming gap in raw strength appeared from nowhere. Kraugel's eyes widened as gravity dragged him earthward.\n\n*A berserk skill?*\n\nPower increasing as health declined. But Grid was a blacksmith. How did he possess berserker abilities? The answer was obvious. Items. Always items.\n\n\"Agh!\"\n\nThe God Hands swarmed Kraugel as he fell, hammering him with golden strikes. Pain exploded across his body. His vision darkened. Then Grid appeared, radiating a different energy entirely.\n\n\"Pagma's Swordsmanship!\"\n\n\"Super Sensitivity!\"\n\n\"Linked Wave Kill!\"\n\n*BOOM! BOOM! BOOM! BOOM!*\n\nA crimson tsunami of energy blades crashed down. Each one carried enough force to qualify as a natural disaster.\n\n*If even one connects, I'm finished.*\n\nKraugel calculated rapidly. He had seconds after activating Super Sensitivity to win. The key was landing his final strike immediately after Grid's passive ended.\n\n*Swish.*\n\nKraugel threaded between the bombardment and created distance. The energy blades pursued him relentlessly. His movements as he used the terrain to deflect them bordered on supernatural. But Grid fought like a rabid animal. Immortality meant he could ignore incoming damage. He closed the gap in an instant.\n\nKraugel had no choice. He had to attack.\n\n*Whoosh.*\n\nA bloody light streaked past Kraugel's nose by a hair's breadth. Super Sensitivity saved him. He retaliated, twin strikes aimed at Grid's eyes to inflict blindness.\n\n*Crack!*\n\nWhite light flashed toward Grid's tear ducts. The immortality passive had three seconds remaining. Super Sensitivity had four.\n\n*CLANG!*\n\nThe God Hands intercepted Kraugel's attack, protecting their master.\n\n2.5 seconds. 3.5 seconds.\n\n\"Wave.\"\n\nGrid pressed forward with his sword skill. Kraugel escaped again.\n\n2 seconds. 3 seconds.\n\n*CRACK!*\n\nDistance opened between them as Kraugel vaulted off the God Hands as stepping stones.\n\n\"Huraah!\"\n\nGrid anticipated the retreat. He hurled a spear.\n\n*Thunk!*\n\n\"Kuk!\"\n\nThe weapon punched through Kraugel's shoulder. He'd overlooked that skill. His face went ashen. Grid's health ticked upward from Elfin Stone's Ring lifesteal effect.\n\n1 second. 2 seconds.\n\nNow.\n\n*Dash!*\n\nKraugel reversed direction, charging straight at Grid. Magic Missiles from the God Hands missed him completely. He reached Grid in a blur of motion. White Light Steps combined with Super Sensitivity.\n\n*Finally.*\n\nThis brutal fight was over. Kraugel could see his mother's face. She was smiling.\n\n*Swish!*\n\nHope flooded Kraugel's chest. His blade drove toward Grid's exposed neck.\n\n> [Braham's soul, which lost a great deal of power from closing the hell door, has woken up from his sleep!]\n\n> [The cooldown time of **Assimilation** is over!]\n\n\"Assimilation!\"\n\nGrid activated his final trump card. His hair bleached white. His eyes sharpened to predatory focus. Female viewers around the globe felt their hearts skip. Kraugel's heart plummeted into his stomach.\n\n\"Shield.\"\n\n*CRACK!*\n\nA translucent barrier materialized, blocking Kraugel's sword. Grid, wearing Braham's appearance, smirked as shock and despair warped Kraugel's expression.\n\n\"This is talent bestowed by the heavens. But you're still young.\"\n\n*Crackle!*\n\nSparks gathered at Grid's fingertips.\n\n*Clang!*\n\nKraugel released White Fang. He pressed both palms against the shield encasing Grid.\n\n\"Crying Tiger.\"\n\n\"...!\"\n\n*BOOM!*\n\nIntangible energy pierced through the barrier and punched into Grid's chest. Simultaneously, flames erupted from Grid's hand, engulfing Kraugel's body.\n\n\"Impossible.\"\n\n\"Who won?\"\n\nBoth fighters turned gray at almost the same instant. The world descended into chaos. Sky or impregnable tower? The victor remained uncertain until replay confirmed it. But Grid and Kraugel already knew.\n\n\"Mother...\"\n\nKraugel's body trembled. Tears streamed down his face."
}