{
  "id": 463,
  "title": "Chapter 463",
  "content": "> [The duration of immortality is over.]\n\nThe notification window flared as Kraugel drove White Fang toward Grid's exposed throat. Grid's vision tunneled. Another notification cut through the haze.\n\n> [Braham's soul, which lost a great deal of power from closing the hell door, has woken up from his sleep!]\n\n> [The cooldown time of Assimilation is over!]\n\nGrid seized the thread of consciousness slipping away. \"Shield.\"\n\n*Jjeejeeeong!*\n\nThe world inverted. His hair bleached white as Braham's presence flooded his body. A translucent barrier snapped into existence, deflecting Kraugel's blade with a metallic shriek. Grid's pulse hammered in his ears.\n\n*I can win this.*\n\nBraham's voice cut across his thoughts. \"This is a talent from the heavens. But you are still young.\"\n\n*Stop talking and cast something!*\n\nGrid's silent scream went unheard. Braham flexed the borrowed body's fingers, admiring the shield's construction. He believed in its integrity. Believed it absolute. A sphere of raw flame coalesced in his palm, formless and crackling. Not a structured spell. Just magic power transmuted to heat. Grid's mana reserves scraped bottom, the well nearly dry.\n\n*Well, this is enough.*\n\nBraham studied the opponent. The man was battered, faltering. A simple attack would suffice. His lips curved.\n\n*Tak.*\n\nKraugel's palm pressed against the shield's surface. The motion echoed something Grid recognized. Regas. Weight manipulation. Rotational force converted to impact.\n\n*Don't tell me...*\n\nGrid and Braham both tensed.\n\n\"Crying Tiger.\"\n\n*Peeng!*\n\nIntangible force punched through the barrier like it was silk. The blow hammered Grid's sternum. Not devastating. Not overwhelming. But Grid had clawed back only 400 health from Spear Shot's effect and Elfin Stone's Ring. The margins were too thin. His knees buckled. The world went dark.\n\nIn his final moment, Grid saw flames engulf Kraugel's body.\n\n***\n\nUnease had stalked Kraugel throughout the entire duel. The question gnawed at him with every exchanged blow.\n\n*Would I lose?*\n\nThe thought was foreign. Alien. He was Kraugel. First on the unified rankings. And yet Grid dragged doubt from the depths where it shouldn't exist.\n\n*If I fail here, Mother...*\n\nAres, the battlefield tactician. The Black and White sisters. Agnus, Baal's Contractor. Grid stood shoulder to shoulder with the four figures at the center of Satisfy's narrative. Perhaps surpassed them in potential. Especially at the end.\n\n\"Assimilation.\"\n\nKraugel's blood turned cold. Grid's hair bleached white. Blackening's aura dissolved. Kraugel had witnessed this transformation once before. Grid in this state had vaporized Yatan's First Servant with Fireball. A quest-specific power, or so he'd assumed. But Grid could summon it in PvP?\n\nThe realization struck like a blade between ribs. He'd miscalculated. Catastrophically.\n\nBut Crying Tiger landed first. The margin was a razor's width. If Grid had unleashed the spell immediately instead of trusting the shield's defense, the outcome would have inverted.\n\n> [You have won a battle against a legend.]\n\n> [The legendary class, Sword Saint has been obtained.]\n\n> [Your level has dropped down to level 1.]\n\n\"Mother...\"\n\nThe dam broke. Emotion surged through the cracks in his control. He could free her. End her suffering. Repay decades of love with something tangible. Hear her call him 'Son' again without the weight of desperation beneath it.\n\nKraugel's shoulders shook. Tears carved hot tracks down his face. Joy. Pure and unfiltered.\n\n***\n\nThe replay dissected the final exchange frame by frame. Grid had died first. By 0.1 seconds.\n\n『 A tenth of a second. That's all it took to rewrite the fates of two nations, two legends. 』\n\nThe announcer's voice carried through the stadium.\n\n『 The winner is Kraugel! Russia takes first in the overall rankings! 』\n\n『 Heartbreaking for Grid and South Korea. If his magic had fired a tenth of a second faster, they'd be celebrating gold. 』\n\nThe crowd roared. Analysts dissected the match. Grid had lost, but no one dared call him a loser. Not after what they'd witnessed.\n\n『 Kraugel no longer owns the title of 'the sky' alone. 』\n\n『 Agreed. Grid deserves to stand beside him. 』\n\n『 As of this moment, Satisfy has two suns. 』\n\nCommentators across networks echoed the sentiment. The global audience nodded. Grid stood apart from their praise, removed.\n\n*In the end, I lost.*\n\nThe title remained out of reach. But frustration didn't claw at him. Instead, something else bloomed. Satisfaction. The gap between him and Kraugel had narrowed. Measurably. Undeniably.\n\n*Next time.*\n\nNext time would be different. Next time, he'd claim the crown. Grid's grin felt sharp as he watched Kraugel across the arena.\n\n*Is he that happy about beating me?*\n\nKraugel clutched his chest, tears streaming. Grid completely misread the emotion behind them.\n\n*Crying because he won...*\n\n*Huhuhut!*\n\nPride swelled in Grid's chest despite the loss.\n\n***\n\nThe final rankings materialized:\n\n**1st. Russia** (5 gold, 3 silver, 2 bronze)  \n**2nd. South Korea** (5 gold, 1 silver)  \n**3rd. United States** (4 gold, 4 silver, 6 bronze)  \n**4th. Canada** (3 gold, 3 silver, 3 bronze)  \n**5th. Spain** (1 gold, 2 silver, 1 bronze)  \n**6th. Japan** (1 gold, 3 bronze)  \n**7th. Brazil** (1 gold)  \n**8th. United Kingdom** (4 silver)  \n**9th. France** (3 silver)  \n**Joint 10th. Argentina, China** (2 bronze)  \n**12th. Turkey** (1 bronze)\n\nThe United States and Canada had tumbled from their projected dominance to third and fourth. Few had predicted South Korea's meteoric rise to second place. The weakest team on paper had defied every expectation.\n\n『 South Korea's case is unprecedented. Grid alone earned five of their six medals. 』\n\n『 Four gold, one silver. 』\n\n『 If we're naming an MVP, Grid is the only choice. 』\n\nKraugel's performance had been stellar. Comparable in impact. But Grid's medal count spoke for itself. The MVP title was his by any objective measure.\n\n***\n\nThe 2nd Satisfy National Competition drew to a close. Paris had hosted the month-long festival with grandeur befitting its importance. Participants from across the globe gathered on stage for the closing ceremony. Cameras found Grid immediately. Analysts coined new titles.\n\n*A new peak. The second sun.*\n\nThe media swarmed. Reporters, many of them attractive women, angled for interviews about his white-haired transformation. Yura's elbow jabbed his ribs.\n\n\"You're drooling.\"\n\n\"Heok.\"\n\nThe world was watching. And Grid was *drooling*. On global television.\n\n*Why is there D cup...!?*\n\nMonths of careful image management evaporated. Heat crawled up Grid's neck. His face burned. Yura produced a handkerchief and dabbed at his mouth with exaggerated care.\n\nSilence stretched.\n\nShe was doing this deliberately. The crowd and international players stared at Grid with naked envy.\n\nGrid found his voice. \"People are misunderstanding because you keep acting like this. Act moderately, or I will start thinking that you like me.\"\n\nYura's lips twitched. The opening was perfect. She could confess. Tell him the truth. But the words lodged in her throat. She'd rejected countless confessions over the years. Never delivered one herself. The vulnerability felt foreign. Terrifying.\n\nPeak Sword laughed nearby. \"It's very lively.\"\n\nHe watched them like a benevolent uncle observing children. Amusing. Frustrating. For the record, Peak Sword had also never had a relationship. While the two of them continued their awkward dance, Chairman Lim Cheolho climbed onto the stage.\n\nHis gaze lingered on Grid for a moment. Unreadable. He turned to the cameras.\n\n\"Hello. I am the developer and operator of Satisfy, Lim Cheolho. I would like to thank all the staff and players who have worked hard for this competition. Now, I will deliver happy news to all the people watching.\"\n\nLim Cheolho's announcement came in two parts:\n\nFirst, every player in Satisfy would receive a **10% experience buff** to commemorate the National Competition.\n\nSecond, additional buffs would be awarded based on a player's country's ranking.\n\nSome voices cried foul. Too much advantage given to the victors. But the S.A. Group's intent was transparent. Raise the stakes. Make the 3rd and 4th competitions even larger spectacles. The benefits needed to match the incentive.\n\nKorean players now enjoyed a **27% increase** to experience and item acquisition rates for the next two weeks. Grid's victories had gifted them rapid growth. He'd become a national hero in truth, not just ceremony.\n\nGrid's personal rewards were staggering. Four <span class=\"rarity-mythic\">adamantium</span> ingots. One <span class=\"rarity-legendary\">bloodstone</span>. The blacksmith's haul from four gold medals and one silver. Beyond that, 20 billion won had appeared in his bank account. Advertising fees from the Comet Group.\n\nThen reality struck.\n\nAutumn would pass. Next year's comprehensive income tax would arrive. A **38% tax bomb** on earnings this massive. Grid's eyes stung.\n\n*The taxes will help the country develop,* he told himself.\n\nThe lie didn't ease the pain. Billions of won, gone. Would his hair start falling out again?\n\nLauel approached as Grid spiraled into financial anxiety.\n\n\"I have something to say to you.\"\n\nGrid blinked. \"...?\"\n\n***\n\n\"Hee. This is the kingdom of the Water Clan that I heard about. A pretty place?\"\n\nThe speaker's voice dripped with mockery.\n\n\"It makes me furious.\"\n\n\"Hihit! Yihihihit!\"\n\nSiren. The Water Clan kingdom hidden beneath the waves. Duplicator Euphemina had called it home for several months now. She'd known visitors would come eventually.\n\nShe hadn't expected them this soon."
}