{
  "id": 464,
  "title": "Chapter 464",
  "content": "\"What did you want to talk to me about?\"\n\nAfter the closing ceremony, the Overgeared members gathered at a restaurant near the Eiffel Tower. The table stretched long enough to accommodate the multinational crew. Their skin tones varied from pale to dark, eyes every shade from blue to black, but the easy laughter and shared bottles of wine spoke to something deeper than appearances.\n\n\"Baldy.\"\n\nVantner's fork clattered against his plate. \"Shut up! I'm not bald, I shaved!\"\n\nPon grinned, raising his glass in mock salute.\n\nLauel cleared his throat. The surrounding chatter died. \"I have brought Kraugel into Overgeared.\"\n\nSilence. Then Regas leaned forward, forearms on the table. \"The sky above the sky will join Overgeared?\"\n\n\"How?\" Pon set down his drink.\n\nGrid blinked. He hadn't known about this either. Lauel straightened in his chair, addressing those who'd been left out of the loop.\n\n\"...That is what happened. Thus, we have the right to recruit Kraugel.\"\n\nThe explanation took several minutes. Lauel laid out the details without embellishment, his posture rigid with confidence. He expected celebration. Gratitude. Instead, Grid's jaw tightened. He drained his beer in one long pull, then set the glass down with a quiet thunk.\n\n\"Don't recruit Kraugel.\"\n\n\"...Huh?\"\n\nLauel's mouth opened. Closed. Around the table, confusion rippled outward. Why reject the best power in the game?\n\n\"We must recruit Kraugel!\" Lauel's voice rose. \"Kraugel's blood will flow through the arteries of Overgeared! The Overgeared Guild will be stronger than ever...\"\n\nGrid cut him off. \"Can you force someone to become our colleague?\"\n\nPon nodded slowly. \"Kraugel is the type of person who has always played the game by himself.\" He gestured with one hand. \"Doesn't everyone know that he hates belonging to a group? Can we obtain his true heart if we recruit him like this? There might be a crack in the relationship, which could be dangerous one day.\"\n\n\"People change.\" Lauel's knuckles whitened around his fork. \"Look at us now. The reason we became colleagues wasn't pure. We joined because there was something we wanted. In the course of fulfilling it, our hearts opened and we became true co-workers. The same is true for Kraugel. He might rebel right now, but someday...\"\n\n\"No, it's okay.\" Grid's voice held no room for argument. \"Not only is he an existence that shouldn't be caged, we aren't weak enough that we should be obsessed with him.\"\n\nKraugel had reached the peak by walking alone. That path suited him. Forcing him into a guild framework would break what made him dangerous. *Aren't there so many examples in RPGs? The terrifying enemy boss joins your party and suddenly can't kill a fucking slime.*\n\n\"Those are just assumptions!\"\n\nLauel's frustration bled through every syllable. The other members shifted in their seats. This was their chance to recruit the strongest player in the world, and internal opposition threatened to kill it. Lauel's jaw worked, his hands trembling slightly.\n\nGrid met his eyes. \"Lauel, I lost to Kraugel.\"\n\nThe admission hung in the air.\n\n\"Some people might laugh, but I think of myself as Kraugel's rival. I want to continue competing until I someday surpass him.\"\n\n*I see.* Lauel's anger drained away. *I can never fathom Grid's mind.*\n\nHaving someone you couldn't defeat serving under you. The discomfort. The blow to pride. Lauel exhaled through his nose.\n\n\"I understand... I won't make the deal with Kraugel.\"\n\nGrid frowned. \"Why not?\"\n\n\"...Didn't you say not to recruit him?\"\n\nGrid's expression shifted. Something calculating entered his eyes. \"Not recruiting him doesn't mean we can't make a deal.\"\n\n***\n\nThe media moved on. New scandals replaced the National Competition headlines. But one story refused to die: Kraugel's name vanishing from the ranker list. Reporters swarmed. Kraugel fled to the Russian players' private jet, pursued by cameras and shouted questions.\n\n*Lauel said he would contact me in 30 minutes.*\n\nHe could log in for a while. Kraugel settled into the capsule installed in the plane's cabin. The familiar blue light washed over him as Satisfy loaded.\n\nHe opened his status window.\n\n> **Name:** Kraugel  \n> **Level:** 1  \n> **Class:** Sword Saint  \n> **Title:** One who Became a Legend  \n> **Title:** East Continent's Pioneer  \n> **Title:** Troll King's...  \n> \n> **Health:** 1,485/1,485  \n> **Mana:** 100/100  \n> \n> **Strength:** 50 (+120)  \n> **Stamina:** 15 (+50)  \n> **Agility:** 30 (+60)  \n> **Intelligence:** 10 (+10)  \n> **Composure:** 10  \n> **Indomitable:** 10  \n> **Dignity:** 10  \n> **Insight:** 10 (+40)  \n> **Regeneration:** 30  \n> **Super Sensitivity:** 0.1\n\n*Beyond imagination.*\n\nHis level had crashed to 1. Skills and stats he'd spent thousands of hours cultivating, reset. But the Sword Saint class compensated. The titles remained. The base abilities were extraordinary. Russia's 30% experience buff from first place would accelerate his recovery. And Super Sensitivity, transformed from an active skill into a trainable stat.\n\n*A passive I can develop without limits.*\n\nWeaker in the short term. Potentially godlike later. If he maxed out the stat, he could exist in a permanent state of Super Sensitivity. The performance ceiling might be lower than the original active version, but the floor was higher.\n\nA voice penetrated the capsule. \"Kraugel! Can you come out for a while?\"\n\nAlexander. The nationalist skinhead who'd once sneered at Kraugel now acted like a loyal hound. All because Kraugel had dragged Russia to first place.\n\n\"What?\"\n\n\"That monkey...\" Alexander caught himself. \"No, a Korean person said he wanted to meet you.\"\n\n\"Who?\"\n\n\"G-Grid. Why did he come after losing to you in PvP? What should I do? Should I send him back?\"\n\n\"No, wait.\"\n\nKraugel logged out immediately. *Lauel told him the story.* Grid had learned the truth. He'd come to collect his vow of allegiance. Every group had a hierarchy. Kraugel's mouth twisted as he emerged from the capsule.\n\nThen he froze.\n\n\"Ugh...!\"\n\n\"Hnng~~\"\n\nNear the airplane's entrance, massive Russian players collapsed. One after another, they crumpled like puppets with cut strings. The reason wasn't immediately clear, but each time Grid's fingers brushed their bodies, they folded.\n\n\"H-Huaaat~~!\"\n\nAnother Russia player made a sound that belonged in a bedroom. His face flushed scarlet as he looked down at himself, then away.\n\n*Omitted.*\n\n\"W-What the hell is he doing?\"\n\nAlexander pressed himself behind Kraugel despite outweighing him by forty pounds. He stared at Grid like a man facing a demon. Grid was giving ecstasy to grown men with a single finger.\n\n\"Hello?\"\n\nGrid spotted Kraugel. Kraugel removed his translator and switched to Korean.\n\n\"It's good to see you. It's only been two hours.\"\n\n\"Isn't your Korean quite good?\"\n\n\"I can't be poor at my native language.\"\n\n\"Hrmm...\"\n\nGrid pulled off his own translator. His eyes narrowed as he studied Kraugel. The frame was right, but the features were delicate. Too delicate. Long eyelashes. Smooth skin. Grid's brow furrowed.\n\n\"Friends.\"\n\n\"...What?\"\n\nKraugel had expected demands. A command to join Overgeared. This threw him completely off balance. Grid closed the distance and held out his hand.\n\n\"Let's help each other when it's difficult. In the future, you don't have to fight alone like this.\"\n\n*There are limitations to being alone.* Grid had learned that the hard way. One day, Kraugel would need help. Grid would be there.\n\n\"I'm not inviting you to join the guild. We'll just help each other when it's needed.\"\n\n\"...Why?\" Kraugel stared at the offered hand. \"Why are you treating me so good?\"\n\nGrid could force him. His position gave him that power. Why offer this instead?\n\nGrid's answer came simply. \"I need a competitor in the future. I want your development. If I fight against you as you become stronger, I will also develop.\" He shrugged. \"In the first place, I'm already satisfied with having Piaro in the guild.\"\n\nSilence.\n\nThe Grid standing before him bore no resemblance to the desperate man Kraugel had met in Reidan. No shadows haunted his face. His eyes held certainty. His posture radiated quiet strength. Kraugel felt something tighten in his chest. He gripped Grid's calloused hand.\n\n\"I'm glad.\"\n\n*I will run whenever you call me. And thank you.*\n\nThe words stayed locked in his throat. Grid would understand without them. And Grid did understand.\n\n\"Thanking me? Promise me one thing. Every time I call, run over.\" Grid's grip tightened. \"You are able to treat your mother's illness thanks to Lauel. Shouldn't you return the favor?\"\n\n\"...I understand.\"\n\n*What kind of friendship is this?* Kraugel felt genuine concern as Grid clapped him on the shoulder.\n\n\"Once your mother recovers, come to South Korea to play. I'll show you around.\"\n\n\"...Yes.\"\n\n*Thank you.* Kraugel smiled. It transformed his face into something genuinely beautiful. He longed for the health and well-being of all mothers in the world.\n\nOn this day, the players who participated in the National Competition departed for their home countries. New adventures waited for them."
}