{
  "id": 466,
  "title": "Chapter 466",
  "content": "**Empress Marie.**\n\nThe mother of the 4th Prince carried ambition like a blade. She would place her son on the imperial throne, no matter the cost. After Empress Aria's death, she'd captivated the emperor's heart and bent the nobility to her will. The Red Knights became her weapon.\n\nOnce, critics had dismissed them as weaker than their predecessors. No longer. Under the enlightened Sword Duke Limit, each knight wielded the power of a great swordsman. The modern Red Knights had surpassed the legends of old.\n\nMarie's position had grown accordingly. Whatever her true motives, she'd trained the Red Knights into something formidable. The emperor favored her for it.\n\nShe should have been content.\n\nShe wasn't.\n\nThe Five Pillars had changed everything. The emperor recognized the Red Knights as 'usable tiles' again. Tasks piled up. Orders multiplied. Her armed forces developed frequent gaps in their ranks.\n\n*Juander. I know you love me, but I cannot control you.*\n\nHe ruled an empire for a reason. His heart could be swayed, but never fully conquered. No matter how she maneuvered, she couldn't pin him beneath her thumb. When Asmophel vanished, kidnapped by unknown hands, the sense of crisis sharpened into instinct.\n\nShe created a new group. Secret. Loyal only to her. Beyond the emperor's reach, beyond the nobles' influence.\n\nDogs that answered to no one else.\n\n***\n\nOnce every four months, two full moons overlapped in the night sky. When the coastal waters of Brinichi experienced low tide, a secret path revealed itself. A purple road leading into the deep abyss. It headed toward Siren. Originally, Siren could only be entered during this astronomical alignment.\n\nThat changed when Euphemina liberated it. Players found new routes. Now anyone could visit at any time.\n\n\"Is it really down there?\"\n\nRab. Two hours by wyvern from Reidan's desert. Katz swallowed hard as he stared at the gigantic whirlpool swirling below. They expected him to fly *into* that?\n\n\"If we fall, we're dead. One hundred percent.\"\n\n*Are they trying to kill me?* Katz didn't trust his new teammates. He'd grown up in an environment where trust was a liability. He'd fought his own blood siblings for succession rights.\n\nTrust didn't come easily.\n\n\"I don't know why you're so timid.\"\n\nPeak Sword, descendant of independence fighters, hated the casual racism that rolled off Alexander's tongue. Katz didn't react to his sharp tone. He hadn't forgotten his own mistake, criticizing Koreans in the past. Selfish he might be, but he owned his failures.\n\n\"I understand why you hate me. I want to apologize for my attitude back then.\"\n\nPeak Sword blinked. \"...Eh?\"\n\n*This isn't the Katz I know.* The bastard from the past wouldn't have shown this mild attitude.\n\n*Maybe he's not such a bad guy after all?*\n\nWhile Peak Sword hesitated, Katz kicked his ass.\n\n\"Why aren't you apologizing?\"\n\n\"Ah, you piece of—!\"\n\nPeak Sword tumbled into the whirlpool. Katz leaned over to check if he'd died. Pon and Regas laughed. Huroi watched the four lunatics and reconsidered his life choices.\n\n*Normal people are rare in Overgeared. I should stay alert so Grid isn't damaged.*\n\nHuroi specialized in trash-talking people's parents. Objectively, he was probably the worst person in the guild.\n\n***\n\nThe Water Clan resembled humans in most ways. Gills marked their shoulders and arms. Scales glittered on their thighs. Easy to mistake them for humans adapted to aquatic life.\n\nTheir **strength** and **magic power** eclipsed normal humans by multiples. High development potential. If not for fatal weaknesses (low fertility, short lifespans on land), they would have built a civilization surpassing humanity.\n\n\"I found a means of harnessing the magic power accumulated in their hearts. Go to Siren now. Obtain as many hearts as possible. No. Take them all.\"\n\nWhite ranked among Blood Carnival's best. Half a year ago, she'd joined the Rose Knights serving Empress Marie. Loyalty came easy when someone satisfied your desires the way Marie did.\n\n\"It's bad luck not being pretty.\"\n\nWhite surveyed Siren, replaying Marie's explanation. The beautiful underwater kingdom stretched before her. At its center, a sand castle rose like a monument to architectural madness.\n\nEscente laughed at the fleeing water clan. Bodies piled up in their wake.\n\n\"Beauty is rare. Do the water clan think they're stupid fish? Why build a castle from sand?\"\n\nEscente belonged to Blood Carnival like White, but served no master beyond himself. He'd joined this expedition because White shared the quest.\n\n\"One heart equals 80 gold. A hundred hearts converts to 7,000 dollars.\"\n\n\"A thousand hearts? Seventy thousand dollars!\" His grin widened. \"This isn't a triple S quest. It's a fucking gold mine!\"\n\nThirty Blood Carnival members had answered White's call. One third of their entire organization. Each specialized in combat and slaughter. Their collective strength defied imagination.\n\nMercenaries and allies swelled their ranks to nearly a thousand. Average **level 233**. The seven great guilds? Overgeared? Those groups couldn't touch them. Blood Carnival's pride matched their power.\n\nThe water clan soldiers, unused to war, died like livestock.\n\n*Seokeok!*\n\nSiren City ran red.\n\nEscente killed an elderly man cowering in an alley. Two soldiers rushed him. He cut them down in quick succession.\n\n\"Easy! Too easy! Their levels are pathetic! I'll catch a million of them instead of a thousand!\"\n\nThe citizens averaged **level 100**. Soldiers hovered around **level 180**. Water attribute magic added a variable, but they'd prepared for that. Resistance items negated most of the threat.\n\nThe Water Clan were weak prey worth 80 gold each.\n\nBlood Carnival's army reveled in the slaughter. The city's beautiful water and sand architecture became stained crimson within minutes.\n\n3rd Prince Gulong arrived too late. \"Wicked humans!\"\n\nThe water clan weren't aggressive by nature. They knew satisfaction, felt contentment. Humanity's casual cruelty (deception, theft, murder) disgusted them.\n\n\"Why?\" Gulong's voice cracked. \"Why invade the ocean depths to slaughter us? Even the women and children who cannot resist?\"\n\nHis scimitar struck at Escente. Surprise flashed across Escente's face as he blocked. After the blade exchange, Gulong lunged forward. His rock-hard shoulder slammed into Escente's chest. Not just a fighter. A warrior with tactical awareness.\n\n\"Ugh.\"\n\nEscente flew backward but recovered immediately. His expression twisted ugly.\n\n\"Does it mean anything to catch a fish? Damn fish!\"\n\n\"Disgraceful!\"\n\nProvoked, Gulong's movements became more aggressive. Faster. Stronger. Gaps appeared in his defense. Escente's shield caught him. A strike to the jaw.\n\n\"Aha! Easy to exploit a stupid bastard!\"\n\nGulong was a named NPC. Worth at least 100,000 gold. Greed sharpened Escente's focus. He pressed the attack.\n\nGulong proved stronger than expected. The third advancement class couldn't break him down. The tide shifted. Escente found himself on the defensive.\n\n\"Somebody help!\"\n\nHe realized too late. No one moved to assist. Blood Carnival shared information, nothing more. The minimum rules prevented backstabbing, but cooperation? That wasn't part of the arrangement.\n\n\"Block with your shield before you die! That's what greed gets you!\"\n\n\"Look at that pathetic form!\"\n\nHis companions mocked him.\n\n*Son of a bitch.*\n\nAfter surviving this, Escente would pass the aggro to them. But Gulong gave no openings. At least three third advancement classes would need to coordinate to bring him down.\n\n*Why am I facing this monster?*\n\nTwenty-seven hearts collected. Only 2,160 gold earned. Death would mean a catastrophic loss.\n\n*I'm ruined.*\n\nThen the screaming intensified.\n\n\"Kyaaack!\"\n\n\"Mother! Father!\"\n\nBlood Carnival accelerated the massacre. They broke into locked houses. Killed everyone hiding inside. Gender didn't matter. Age didn't matter. Screaming women. Crying children. Pain and sadness held no meaning for people who'd accepted this quest.\n\n\"Stop! Stop right now!\"\n\nGulong couldn't watch innocents butchered. Escente's sword punched into his side.\n\n\"Hahat! Looking away during battle!\"\n\n\"Ugh!\"\n\nThe situation was desperate. Gulong's soldiers outnumbered the humans ten to one, but strength mattered more than numbers. One of the water clan's strongest warriors remained trapped by a single human.\n\n*Brother!*\n\n1st Prince Paong was isolated, surrounded. In crisis. Had the prophet Miong been right? Had god abandoned them?\n\nGulong closed his eyes, waiting for the killing blow.\n\n*Kwajajajak!*\n\nLightning struck from above. It hammered into Escente's skull. The unexpected hit ignored **defense**. Stunned, Escente turned toward the source.\n\nA man stood there.\n\n\"A beautiful river of blood.\"\n\nHis smile carried madness. The ID read **Katz**. Compared to Escente and the other Blood Carnival members, he seemed the most unhinged.\n\n\"Blood Warrior?\"\n\n*Kuoooooh!*\n\nBlood rose from the battlefield. The water clan's crimson life essence floated skyward. A strange, cruel, beautiful sight that held the eye captive."
}