{
  "id": 467,
  "title": "Chapter 467",
  "content": "A transparent outer wall encased Siren, the deep sea beyond inspiring awe in those who gazed upon it. Yet the figure standing amid the carnage commanded more attention than any vista.\n\nEscente's stunned state lasted barely a second. He yanked a potion from his inventory and downed it. \"Blood Warrior? What the hell are you doing here?\"\n\nKatz' lip curled. \"You think a nobody like you deserves an explanation?\" He stepped over a corpse, boots squelching in blood. \"Who are you, anyway?\"\n\n\"Are you insane?\" Escente's hand went to his weapon. \"Why attack someone you don't even know?\"\n\n*Wait.* Realization dawned on Escente's face. \"I get it now. You're here for the money.\"\n\nSiren lacked proper hunting grounds and worthwhile quests. The kind of place even level 100 users avoided. Which meant only one reason would bring a high ranker here.\n\n\"White hired you too, didn't she?\" Escente's confidence returned. \"You're here to hunt the Water Clan!\"\n\nThey should be allies, then. So why had Katz attacked him?\n\n\"You greedy bastard.\" Escente spat blood. \"You want the entire bounty for yourself.\"\n\nKatz tilted his head, expression almost amused. \"Me? Working for money?\" His laugh was sharp. \"That's adorable.\"\n\n*Oh. Right.* Escente remembered who he was dealing with. The second son of the JIN conglomerate. A man who probably spent more on breakfast than most players earned in a month.\n\n\"Then why...\" Escente's eyes widened. \"You're here for them?\"\n\n\"Exactly.\" Katz smiled, and there was nothing pleasant in it. \"I'm here for the Water Clan. As Grid's subordinate.\"\n\n\"His what?\"\n\nThe blood pooling around Katz' feet began to move.\n\nIt rose like serpents given life, weaving through the air faster than thought. Escente threw himself sideways. The blood lashes carved trenches in the stone where he'd stood.\n\n*Too easy.* \n\nThe trajectories were simple. Straight lines, right angles, nothing complex. Escente dodged again, rolled, came up running. He found himself near his scattered allies, all scrambling to regroup.\n\n*Wait. This is too easy.*\n\nAres, Seuron, Katz. The three names whispered on every battlefield. Blood Warrior earned his reputation in places where violence painted the ground red. Where Katz could truly work.\n\n*No. No, no, no...*\n\nThe blood hadn't been trying to hit him. It had been herding him.\n\nThe explosion swallowed Escente's scream.\n\nKatz walked through the smoke, sword drawn. Blood Carnival members writhed on the ground, armor melted, skin blistered. Their army fared no better. He hummed something tuneless as he moved among them, blade rising and falling.\n\n\"We appreciate the assistance.\" Gulong, the Water Clan's 3rd Prince, watched Katz work. \"But that expression. Do you enjoy this? Killing other people?\"\n\nKatz opened his mouth to dismiss the question. Then stopped.\n\n*Grid respects NPCs.* The thought felt foreign. *Grid married one.*\n\nIf he was truly part of Overgeared now, he needed to consider how his actions reflected on the guild. He turned to face Gulong.\n\n\"Of course.\" Katz cleaned his blade on a corpse. \"What's more entertaining than combat? Than watching your enemy's last breath?\"\n\nGulong's face went pale. The Water Clan soldiers behind him took an involuntary step back.\n\nThe distance between their peoples widened in that moment, trust eroding like sand before the tide. Katz returned to his work, unaware of the damage his honesty had caused.\n\n***\n\nEuphemina looked like she belonged in a cathedral, not a battlefield. Delicate features, red eyes that seemed too innocent for the violence they'd witnessed. Most players barely knew her name despite her position as one of Overgeared's core members. She avoided publicity, conducted no interviews, maintained no social media presence.\n\nBut those who fought beside her understood. The Duplicator class turned her into whatever the situation demanded. With the right skills copied, even Grid watched his step around her. She'd matched Faker once. Traded blows with Piaro and walked away.\n\nSix months of preparation had brought her to peak condition. A hidden quest from the prophet Miong had provided access to countless high-ranked players. She'd copied their techniques, absorbed their strengths, forged herself into a weapon without equal.\n\nYet the woman called Black was making her work for it.\n\n*Too fast.* Euphemina lost track of her opponent's movements for the third time. Non-targeted skills were useless. She invoked **Giant's Embrace**, and a translucent barrier absorbed the slash meant for her throat.\n\n\"**Fire Hell!**\"\n\nPillars of flame erupted in an eight-meter radius. Black's silhouette twisted in the inferno, trying to escape. Too late.\n\nEuphemina's next spell was already forming. \"**Storm Gravity Field!**\"\n\nThe air itself became hostile. Black's body slammed into the ground with the sound of breaking stone. The gravity field multiplied weight by orders of magnitude, and Black's laugh turned into a wet gurgle as the pressure mounted. Fire arrows pierced the storm, each one finding flesh.\n\nBlack's body dispersed into grey ash.\n\n*Five minutes, thirty-one seconds.* Euphemina mentally catalogued the engagement. *Eight skills expended.*\n\nShe puffed out her cheeks slightly, annoyed at the resource expenditure. Black had been good. Overgeared-level good. Where had someone like that been hiding?\n\n\"That tickled!\" \n\nEuphemina's blood went cold.\n\nBlack stood three meters away, grinning. No wounds. No ash. The same nameplate, the same ID.\n\n*Impossible.* Euphemina had watched her die. Had seen the grey particles that marked player death in Satisfy. But twins couldn't share IDs, and no resurrection skill worked that fast.\n\nBlack giggled, a sound like breaking glass. \"Such a pretty girl! Why haven't I seen you before? I need to tell my sister about you!\"\n\nEuphemina's hands were already moving through the motions of her next spell, but her mind was racing. She'd only felt this type of wrongness once before.\n\nWhen she'd first met Grid.\n\n***\n\nExplosions rippled through Siren like hammer blows against an anvil. Fifteen minutes had transformed a thousand years of peace into a charnel house. Buildings collapsed. Water Clan citizens lay in spreading pools of their own blood. The invaders moved through it all with the efficiency of practiced slaughter.\n\n\"Stop!\" First Prince Paong's voice cracked. \"Please! I'm begging you!\"\n\nHe was one of the Water Clan's finest warriors, trained since childhood in spear and magic. None of it mattered. The power gap yawned like a chasm, and his people were being pushed into it one by one.\n\nA young knight who'd shared his lessons fell, throat opened. One of his teachers, a magician who'd taught him to read the currents, took a sword through the chest. \n\n\"You're monsters!\" Paong positioned himself between White and a group of civilians. \"Demons wearing human skin!\"\n\nWhite's laugh was surprisingly light. \"Fools.\"\n\n\"You're the devil!\"\n\nPaong charged. If he could kill their leader, maybe the assault would falter. Maybe his people would have a chance.\n\nWhite's belly stopped his spear mid-thrust.\n\nHer forearm caught him across the face hard enough to rattle teeth. Two tons of mass behind the blow, and she knew exactly how to leverage every kilogram.\n\nPaong staggered. *How?* She wasn't even armed. Just her fists and that massive frame, yet she fought like...\n\n\"I should thank you.\" White smiled, the expression at odds with the violence in her hands. \"For not calling me a pig.\"\n\nShe blew him a kiss. Paong felt his stomach turn.\n\n\"What's that look?\" White's smile curdled. \"You think I'm disgusting too? Fat and ugly?\"\n\nHer fist found his face again.\n\n*How is she this strong?* Paong's world narrowed to pain and confusion. Then another voice cut through the chaos.\n\n\"You know how to use your weight.\"\n\nThe voice was clear, free of the malice that colored most of the invaders. Its owner, a lean man with dark hair, approached with an extended hand.\n\nPaong's spear came up to guard. Every human here was an enemy. Every one of them had blood on their hands.\n\n\"Why?\" The man's eyes, which had seemed gentle, hardened into something sharp. \"Why do they have to suffer like this?\"\n\nHe turned that gaze on White.\n\n\"Don't look at me that way!\" White's bulk shifted as she took a fighting stance. \"There's nothing wrong with being fat! Some people gain weight from water!\"\n\nHer fist met Regas' in a thunderclap of colliding force.\n\nIn that instant, Regas understood. *I can't beat her.*\n\n***\n\n\"Question.\" Toon hefted another box up the stairs, following Grid into the building.\n\n\"Yeah?\" Grid adjusted his grip on the furniture he was carrying.\n\n\"Why are you doing this yourself? Moving companies exist.\"\n\n\"Money.\" Grid grunted as he navigated a corner. \"Labor's expensive these days.\"\n\nToon stopped on the landing. \"You could earn more playing Satisfy for an hour than this entire move costs.\"\n\nGrid's face went through several expressions. Confusion. Understanding. Horror.\n\n\"Dammit!\" He nearly dropped what he was carrying. \"I've been poor for so long, my brain doesn't work right anymore!\"\n\nGrid looked like he might cry. Toon handed him a booklet. The instruction manual for the diamond capsule Comet Group had provided.\n\n\"I'll finish up here. Go play.\"\n\n\"Yeah. Thanks.\" Grid disappeared into his room like a man fleeing a crime scene.\n\nToon shook his head and pulled out his phone. During the move, he'd seen Grid's old capsule. The entry-level model from Satisfy's launch. The one with the worst synchronization rate in the market. \n\nThe diamond capsule cost one hundred fifty times as much. The performance difference was staggering. Even the intermediate models used in the National Competition couldn't compare.\n\n\"Items really do make the player.\" Toon dialed the moving company as Grid's new capsule hummed to life in the next room."
}