{
  "id": 469,
  "title": "Chapter 469",
  "content": "Grid's whisper chimed in his ear.\n\n*Grid, come to Siren right now.*\n\nHe blinked at the sudden command. \"Why Siren?\"\n\n*The enemy has invaded. There are approximately 1,000 of them. Of those, 30 are third advancement users and one is a sun-grade. In other words, a person on a similar level to you.*\n\nSun-grade. The classification sat heavy in Grid's mind. His lips curved into a smile, but his eyes didn't match.\n\n\"The invasion is a month earlier than scheduled.\" Grid equipped Braham's Boots. \"Okay, I'll go right now.\"\n\nThe reunion with Irene and Lord would have to wait. It wasn't something that couldn't be postponed. His guildmates bleeding out in Siren, though? That was different.\n\n*Currently, whispering seems to be restricted within Siren,* Lauel continued. *Communication with the advance team is intermittently interrupted. If you can't whisper me on the way, don't panic and go straight to Siren. I will go ahead and clean the path for you to step on.*\n\nGrid's jaw tightened. \"Yeah. Please protect as many of the water clan as possible.\"\n\n*Your wish will become reality...*\n\nThe urge to block Lauel's whisper surged through Grid's hands. *Why does he always have to say it like that?*\n\nStill, Lauel's theatrics aside, the reasoning was sound. Overgeared wasn't throwing resources at Euphemina's personal quest out of pure altruism. Yes, she'd earned their support. But the water clan alliance offered expansion opportunities, and those tears from their king were worth the investment. To secure the best position in that alliance, Siren needed to survive this invasion with minimal casualties. They needed to be heroes.\n\nGrid launched into the air.\n\n\"Father!\"\n\nThe shout stopped him mid-flight. Grid twisted, spotting the small figure below.\n\n*Lord.*\n\nTime was critical, but ignoring his son? Grid descended and scooped the boy up. The weight felt real, solid. Lord was virtual, sure, but he was also Grid's child. Born from the woman he loved.\n\n\"Where are you going?\" Lord's voice carried a tremor. \"Father is busy every day and Lord and Mother are worried!\"\n\nMonths. It had been months from Lord's perspective. The boy had learned quickly, his genius showing. Too quickly.\n\n\"I want to play with Father! I can make a knife like Father!\"\n\n\"Haha, is that so?\" Grid ruffled the black hair. \"I am looking forward to it. I will finish this quickly so that I can see my son's work. Until then, listen to what your mother says.\"\n\n\"...Yes.\"\n\nThe boy understood. He'd studied with Sage Sticks, learned about his father's position as duke, knew the demands on Grid's time. But understanding didn't stop the tears welling in those big eyes.\n\nGrid wiped his son's cheek.\n\nThen he noticed them.\n\nDozens of girls stood behind Lord. Young, beautiful, faces flushed with shyness. The Rebecca's Daughters candidates.\n\n*They should be working in the fields with Piaro. Why are they following Lord?*\n\nLord caught his expression and brightened. He pointed at the nearest girl. \"This sister is Epona. My first lover.\"\n\n\"First?\"\n\nLord's tears vanished completely. He pointed to another. \"This sister is Arna. My second lover.\"\n\n\"...\"\n\nThe list kept going. Twenty. Lord had over twenty lovers.\n\n\"Heok...\"\n\nGrid had married Irene at thirty without a single girlfriend. His son, not even two years old, had a harem.\n\n*Is he confusing 'friend' and 'lover'?*\n\nBut no. Lord was a genius. He knew the words he was using.\n\nThe girl called Epona stepped forward, blushing. \"Duke Grid, you told us to look after Lord well...\"\n\nThe memory surfaced. Grid's first meeting with the candidates. Standing in the fields, he'd said it casually.\n\n\"Please grow up healthy and pretty, and look after my son Lord.\"\n\nGrid's tongue clicked against his teeth.\n\n*My words at that time gave Lord a harem?*\n\nTwo hundred candidates. Two hundred. Grid felt a spike of resentment toward his own father.\n\n*Ah! Father! Why weren't you like me? Why didn't you introduce a single girl to your son?*\n\n\"Father?\" Lord's worried voice cut through his thoughts.\n\nGrid gripped the boy's hand. \"Yes, it is better to be a playboy than a lifelong solo like me. Just look at Peak Sword.\" He nodded seriously. \"It's wonderful, Lord. But please take care of yourself. Your essential parts can be ruined if you aren't careful.\"\n\n\"Huh? Essential parts? What's that?\"\n\n\"That... I don't know because I haven't experienced it.\"\n\nLord would learn through experience. The best golden spoon indeed. Grid pulled his son into one last hug, then launched skyward.\n\n***\n\nIn Lord's shadow, Kasim released the breath he'd been holding.\n\n*Duke Grid... He's completely different from a few months ago.*\n\nGentler expression, softer tone. But sharper underneath. Those laughing eyes had triggered a survival instinct in Kasim, made him freeze for minutes.\n\n*Doran, now I can see why you gave your ring to Duke Grid.*\n\nDoran's judgment had always been excellent. He'd recognized Grid's potential from the start.\n\n*Duke Grid, I will punish all the enemies who threaten your precious people. Please rest assured and continue to grow. Then destroy the empire with your own hands and pay back my clan's grudge.*\n\n***\n\n\"I don't know if I'm a farmer or not.\"\n\n\"Me too. But who cares as long as I get stronger?\"\n\n\"That's true. But I don't want to fight with farming equipment in a war. I'm tired of rainbow potatoes...\"\n\n\"Heok. Don't say that when Bland is right in front of you. The potato addict will definitely be angry if he hears it.\"\n\nThe knights and soldiers trudged from the training grounds toward the fields. Morning combat drills done, afternoon 'training' awaited. Farming. They were farming.\n\nAsmophel led them, sending sympathetic looks to those questioning their identity. Then he stood face to face with Piaro.\n\nThe farmer smiled. \"You've gone through a lot of trouble since dawn, Captain of the Overgeared Magic Knights.\"\n\n\"Now you will suffer, Captain of the Overgeared Knights.\"\n\nBest friends. They'd once been enemies, poisoned by a wicked woman's schemes. Many trials later, their bond was stronger than ever. All thanks to Duke Grid. Piaro and Asmophel, the former Pillars of Saharan, now followed Grid with loyalty from their hearts.\n\nWhere was their lord now?\n\n\"Piaro!\"\n\nThe voice came from above. Low, weighted. Grid.\n\n\"My Lord!\"\n\nAsmophel was glad to see Grid, but also stung. *Was he looking for Piaro?*\n\n\"Hello? Asmophel, it has been a long time. Your efforts are always appreciated.\"\n\nGrid descended, landing beside them. Thousands of soldiers and knights dropped to their knees.\n\n\"Eternal's savior! Reidan's sun! We greet the great Duke Grid!\"\n\nThe chorus hit Grid's chest. Four thousand soldiers now. Eight knights, all trained by Piaro.\n\n*I am really happy.*\n\nThree years ago, he'd been pathetic. Now he ruled tens of thousands. It wouldn't be believed if he went back in time.\n\n*Should I write an autobiography later on?*\n\n'The Myth of Overgeared.' Fifty volumes, minimum.\n\n\"My Lord, are you going to join Earl Lauel's army?\" Piaro's concern was evident.\n\nGrid nodded, summoning the Great Lord's Sword and Noe. \"That's right. I need to borrow some of your stats because I'm in a hurry.\"\n\nHe used Character Observation on Piaro. Good growth. Then he checked Asmophel's status window.\n\n\"...Huge?\"\n\nMagnificent Sword Asmophel. Once Piaro's only equal. Two years in Reidan had restored his former condition.\n\n\"Asmophel! You're a great person!\"\n\n\"My Lord...!\"\n\nHis worth was finally recognized. Asmophel's chest swelled.\n\n\"It is you, nyong!\" \n\nNoe, perched on Grid's shoulder, suddenly lunged forward and swallowed Asmophel whole.\n\n\"High agility is complete! Okay! Thank you! I will be able to arrive much faster thanks to you!\"\n\n\"M-My Lord...?\"\n\nAsmophel stood there, dripping with Noe's saliva, staring at Grid's rapidly disappearing form.\n\n*Once again.*\n\nHe'd been one of the strongest in the Saharan Empire. He'd been powerful, prestigious. And once again, he was just a stat battery.\n\nAsmophel's jaw set. \"Piaro... I can't forgive myself for using the pretense of a drug addiction and broken heart to be lazy. Please help me. Train me starting from today!\"\n\nPiaro's face flushed. \"Good! First, the hoe!\"\n\n\"...Me too?\"\n\nAsmophel had been the most powerful person in the empire. He was a prestigious noble.\n\nNow he held a hoe."
}