{
  "id": 47,
  "title": "Chapter 47",
  "content": "# Chapter 47\n\nThe scrape of boots on stone announced Leo's charge. \n\nGrid tried to backpedal. His boot caught on loose rubble. *Shit.* Leo was already there, closing the distance with movements Grid's eyes could barely track.\n\n\"What—\"\n\nLeo's blade came down in a vicious arc.\n\nMetal shrieked against metal. Grid jerked the dagger up on pure instinct. The impact traveled through his wrist like a lightning bolt. His shoulder screamed. His fingers went numb. The right arm hung useless at his side, but Grid was still breathing.\n\n*I wouldn't have seen that coming at all without the Ideal Dagger.*\n\nThe truth of it settled cold in his gut. The Quick Movements skill had doubled his agility. The dagger itself added another 20 points. Then the stat boost from crafting a Unique item—twelve points across the board. Grid's combined agility hovered near 250. Just barely enough to register Leo's attack before it split his skull.\n\nLeo's eyes narrowed. Confusion flickered across his face.\n\n\"You blocked that? Aren't you supposed to be a blacksmith?\"\n\nThe knight adjusted his stance. Grid recognized the shift. This was Winston's golden boy, the so-called 'Northern Nova' whose name echoed through every tavern in the north. An ordinary blacksmith blocking even one strike? Impossible. Even a lucky one.\n\nLeo's expression hardened.\n\n\"You're not ordinary. The interrogation was an act.\" His knuckles whitened on the sword grip. \"Fine. I'll acknowledge your skill and stop holding back.\"\n\nRed flames erupted along the longsword's edge.\n\nGrid's stomach dropped. *A magic sword? Why does someone this strong need—* The thought fragmented into panic. *This is bullshit!*\n\nTwenty-five minutes. That's all he had to save Huroi. Could he defeat a knight wielding a magic sword in twenty-five minutes? \n\nNo.\n\nHe'd be dead in one.\n\nGrid's mind raced through scenarios. Each ended with his corpse cooling on the dungeon floor.\n\n*I have to run.* The logic was simple. Stay and die like a dog. Fail the quest. Running was the only option. *But how?*\n\nKnights were faster. Their stats transcended his pathetic numbers. If he had a skill that inflicted status effects, maybe. Paralysis. Blind. Confusion. Anything. But he was a blacksmith. His skill list was production garbage and a few sword techniques he could barely execute.\n\nThe calculation finished. Grid was going to die here.\n\nThen the world exploded.\n\nThe blast originated from Leo's position. A wall of force and heat slammed into Grid like the fist of an angry god. He threw himself flat, arms over his head. The shockwave rolled over him anyway. Dust and debris peppered his back. The heat seared through his armor.\n\n> [You have suffered 17,300 damage.]\n\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\nOne hit point. Grid existed at the knife's edge between life and death.\n\nThe explosions ceased. Silence rushed back into the void, broken only by the settling of debris and the ringing in Grid's ears.\n\n\"Ugh... what the hell just happened...\"\n\nGrid pushed himself upright. His hands shook as he fumbled for a health potion. The liquid burned down his throat. He turned toward where Leo had been standing.\n\nThe knight was down.\n\n\"Cough! Cough!\"\n\nBlood spattered from Leo's lips. The majestic silver armor hung in twisted fragments. Burns covered exposed skin. Third-degree, by the look of them. That Leo was still breathing qualified as a medical miracle.\n\n*What the hell?*\n\nGrid's first thought was Euphemina. She'd appeared and hit Leo with some devastating magic. He scanned the chamber. Empty. Just him and the dying knight. No sign of the mage anywhere.\n\nHis gaze dropped to Leo's sword. Or what remained of it. The blade had shattered into a dozen pieces. The metal still glowed cherry-red. The blast pattern radiated outward from the weapon itself, as if the explosion had originated there.\n\n\"No way...\"\n\nGrid's mind clicked through the facts. Underground chamber. No ventilation. The ceiling collapse from Euphemina's earlier trap had filled the air with pulverized stone. Fine particulate matter, hanging suspended. Then Leo had ignited his magic sword in an enclosed space full of—\n\nThe chemistry lesson from high school surfaced unbidden. Mr. Kim droning on about dust explosions. Coal mines. Grain silos. Anywhere combustible particles concentrated in the air. Add heat, add pressure, and the whole thing went up like a bomb.\n\n\"Ha!\" Grid's laugh started small. Then it built. \"What? That's it? That's actually it?\" The absurdity overwhelmed him. Hysteria bubbled up. \"Pfff! Puhahahahat!\"\n\nHe'd been ready to die. To fail. To lose everything because a knight with a magic sword was simply too much. And instead, Leo had accidentally triggered a dust explosion and blown himself halfway to hell.\n\nSometimes being lucky was the same as being good.\n\n\"Uhh... you...\" Leo's voice came out wet and strained. \"What did you do?\"\n\nGrid stopped laughing. He turned to face the fallen knight. Time to commit to the bit. He arranged his expression into something he hoped looked cool and mysterious.\n\n\"This? Just a difference in skill.\" Grid kept his voice level. Confident. \"I moved so fast your eyes couldn't track me. Made your sword explode. That's why you're about to die.\"\n\n\"W-What?\" Leo's eyes widened. Blood bubbled at the corner of his mouth. \"That's possible? You... who are you?\"\n\nGrid positioned the dagger over Leo's heart. The tip pressed against burned flesh. \n\n\"I'm Pagma's Descendant.\" He pushed. \"Die knowing you lost to a better man.\"\n\nThe blade punched through skin and muscle. Found the space between ribs. Slid home into the ventricle.\n\n\"Kwaaaack!\"\n\nLeo dissolved into grey particles. A cascade of system notifications erupted across Grid's vision.\n\n> [You have defeated Winston's knight, Leo.]\n\n> [The title 'Knight Slayer' has been acquired.]\n\n> [8 **gold** has been acquired.]\n\n> [The prison key has been acquired.]\n\n> [432,000 experience has been acquired.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [Your level...]\n\nThe numbers kept scrolling. Leo had been level 188. Grid watched his own level rocket from 21 to 45 in the span of ten seconds. The experience bar filled and reset six times.\n\nA new window appeared.\n\n> **[Knight Slayer]**\n> **Stamina** +100\n> **Strength** +30\n\n\"Ohhhhhhhh!!!!\"\n\nGrid's shout echoed through the chamber. Knight Slayer was supposed to be an easy title. Kill a knight, get the reward. Except killing a knight required actual skill. High-level users could manage it. Not some debt-ridden level 21 production class who'd gotten his warrior character deleted by loan sharks.\n\n*I have the Knight Slayer title. Me. The same title high-rankers wear like a badge.*\n\nHe'd never even dreamed of it back when he'd played warrior. Now he had it at level 45.\n\nGrid forced himself to move. Time was burning. He ran for the end of the corridor where Huroi's voice had come from earlier.\n\n\"Huroi! I'm here!\"\n\nThe key slid into the lock. The mechanism turned with a satisfying click.\n\n\"Ugh!\"\n\nThe smell hit him like a physical force. Unwashed bodies. Human waste. The sickly-sweet rot of infection. Grid's eyes watered.\n\nHuroi sat in the corner. Except 'sat' was generous. The man was a skeleton wrapped in skin. Sunken cheeks. Hollow eyes. Ribs visible through torn clothing.\n\n\"What the...\" Grid stared. \"You're Huroi, right? What happened to you? What have you been doing?\"\n\nThe original plan—slap Huroi 200 times for getting captured—evaporated. The man looked like a corpse already. One good slap might actually kill him.\n\n*If he dies from a slap, they'll mark me as a murderer. Player Killer status. No thanks.*\n\n\"...You?\"\n\nHuroi's eyelids cracked open. Recognition dawned slowly, like sunrise through thick fog. Memory reassembled behind his eyes. Who he was. Where he was. What quest had led him here.\n\n\"You... my savior...\" Huroi's voice barely qualified as a whisper. \"Thank you... thank you...\"\n\n> [Quest success!]\n\n> [Title 'Apostle of Justice' has been acquired.]\n\n> [The **Courage** stat has opened.]\n\n> [All stats have increased by 10.]\n\n> [The skill 'Unbreakable Justice' has been generated.]\n\n> [Your reputation in Winston has reached the peak. In the future, the Winston residents will show you the best hospitality.]\n\n> [Affinity with the Winston residents has risen to the maximum. In the future, the Winston residents will share things with you.]\n\nHuroi's own notifications appeared. Grid couldn't see them, but he watched the man's expression transform. Tears cut tracks through the grime on Huroi's face.\n\n> [Quest success!]\n\n> [The second class 'Apostle of Justice's Partner' has been acquired.]\n\n> [The **Courage** stat has opened.]\n\n> [When you are with the Apostle of Justice, all stats will increase by 20%.]\n\n> [The skill 'Unbreakable Justice' has been generated.]\n\n> [The skill 'Sacrifice for Justice' has been generated.]\n\n> [Title 'One who Overcomes Hardships' has been acquired.]\n\n> [**Indomitable** stat has opened.]\n\n> [The skill 'Strong Will' has been generated.]\n\n> [Congratulations! You are the first to obtain a second class in Satisfy. If you wish, your achievements will last for a long time in Satisfy.]\n\n\"Ah...!\"\n\nThe tears came harder. Huroi shook with silent sobs. The hellish ordeal had paid off. Second class. First in all of Satisfy.\n\nHe used what little strength remained to rise. His legs trembled. He dropped to his knees in front of Grid.\n\n\"Grid, I didn't understand when we met. But clearly, we share a destined relationship.\" Huroi's voice gained strength. Conviction. \"My savior, Grid! I, Allunbatar, descendant of the Blue Wolf, will follow you for the rest of my life as the Apostle of Justice's Partner!\"\n\n*What the hell is this guy talking about?*\n\nGrid stood there, confused. Huroi looked half-dead and completely insane. But the man's eyes burned with genuine fervor. This wasn't an act.\n\nA few days ago, Huroi had dismissed Grid as beneath notice. Now he was pledging eternal loyalty. The quest rewards must have been extraordinary.\n\nGrid didn't understand it. But he'd take it.\n\nThe relationship between the two men began in earnest.\n\n---\n\n**Glossary of Common Korean Terms**\nOG: Glossary Link\n\n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}