{
  "id": 470,
  "title": "Chapter 470",
  "content": "The instant Overgeared's vanguard crossed into Siren, Lauel thrust his palm forward.\n\n\"Wind Dragon's Breath.\"\n\nA cyclone tore through the ruined streets. Arrows and spells scattered like dandelion seeds, their trajectories obliterated. Lauel's eyes swept across the shattered buildings, the rubble still smoking.\n\n\"Quite the reception.\" He gestured toward the destroyed storefronts. \"Let's not level the entire district.\"\n\nA Blood Carnival assassin stepped from behind a collapsed wall, confusion bleeding through his mask. \"How did you—did someone leak our ambush?\"\n\nLauel swept his hair back, the motion almost theatrical. *As if I'd waste time planting moles in your organization.*\n\nThe truth was simpler. Overgeared had come to support Euphemina after the Reinhardt golem invasion—she'd earned that loyalty. Blood Carnival's involvement was unexpected, but their strategy was transparent. Block the entrance. Kill anyone who enters. Standard guerrilla doctrine.\n\nStandard and ineffective.\n\n\"I wouldn't be Overgeared's chief of staff if I couldn't read third-rate tactics.\" Lauel's gaze dropped to the pendants hanging from the assassins' necks. <span class=\"rarity-rare\">Chaos Field</span>. Ten-meter whisper suppression, no ally discrimination. Cheap. Common among assassin units.\n\n*That's why communications with Euphemina cut out.*\n\nThe pendants cost roughly 500 million won each—pocket change for Blood Carnival's leadership, but too expensive to equip a thousand troops. Which meant only their elite wore them. Thirty third-advancement users, maybe.\n\n*Euphemina's fighting them right now.*\n\n\"Hurry.\" Lauel broke into a sprint.\n\nAn arrow screamed past his shoulder before he'd taken three steps. The Blood Carnival members froze mid-breath, shields rising.\n\nUseless.\n\n*Ppepeng! Peng!*\n\nJishuka's arrows bent mid-flight, curving like serpents through the air. They punched through gaps in armor—armpits, throats, the soft flesh behind knees. Blood misted. Bodies dropped.\n\nToban charged. Ibellin was half a step behind. The other Overgeared members followed, and the street became a slaughterhouse.\n\n***\n\n\"Pant... pant...\" Regas spat blood. \"This isn't easy.\"\n\n\"Agreed.\" Toban blocked another volley of arrows with his shield, wood splintering.\n\nThey'd been trying to link up with Euphemina for the past hour. Failed. The city was a maze of ambush points, and Blood Carnival had positioned forces at every intersection. Kill five enemies, ten more appeared. The archers and mages were the worst—constant pressure from range while they tried to protect the Water Clan civilians.\n\n\"No end to them.\" Regas wiped sweat from his eyes. \"My stamina's dropping.\"\n\n\"Regas won't last much longer...\"\n\n\"Can't even send a whisper to coordinate.\" \n\n\"Kuoong...\"\n\nFresh enemies poured from a side alley. Twenty, maybe thirty. Mid-200s level range. In a fair duel, Pon's group could shred them one-on-one in seconds. But fairness wasn't on the menu tonight. Skills drained. Stamina evaporated. Concentration fractured under the relentless assault. They weren't Kraugel—they couldn't dodge everything. Health bars bled red.\n\nThe mission parameters made it worse. *If we could just kill everyone, fine. But we need to protect the Water Clan AND find Euphemina.* No room for reckless aggression.\n\n\"We need a defensive position.\" Peak Sword scanned the battlefield, years of guild leadership sharpening his tactical eye. Lauel had appointed him vanguard leader for exactly this reason. \"Pon, Huroi—move the civilians to that warehouse. I'll hold the line.\"\n\nHe drew his blade.\n\n\"Draw Sword, Annihilate.\"\n\nSteel sang. Light flashed. Two enemies collapsed, throats opened. A third clutched his bisected torso as his organs spilled.\n\nBut the skill cost mana. The cooldown was brutal.\n\n*Puok!*\n\nPain exploded across Peak Sword's ribs. He stumbled, catching himself on one knee. A scimitar dripped red.\n\n*When I was resheathing—*\n\n\"Damn bastard using dirty tricks!\" Peak Sword glared at his attacker.\n\n\"Blame your incompetence for not watching the battlefield.\" The man twirled his scimitar. Korean accent. \"Should've kept your head on a swivel.\"\n\n\"W-What?\"\n\n**Incompetence.**\n\nThe word stabbed deeper than the blade. Peak Sword's hands trembled. That nickname—the one the forums branded him with after the National Competition. The stain that wouldn't wash out.\n\n\"Dammit! I'll show you who's incompetent!\"\n\nPeak Sword lunged. His opponent sidestepped with insulting ease.\n\n\"Matdashi.\" The man's ID floated above his head. \"Third advancement. Surprised there was another Korean with some skill?\"\n\n\"Then why hide?\" Peak Sword swung again, missed again. \"Participate in the National Competition! Raise our country's status!\"\n\n\"Democratic country. My freedom.\" Matdashi deflected the next strike, then cut Peak Sword across the shoulder. \"Unlike Grid, I don't need the world's approval.\"\n\n\"Traitor...!\"\n\nBut the words came out weak. Peak Sword's fighting style was neutered without his sheath. Quick Draw Swordsman—specialized in that single devastating moment of unsheathing. Without it, his Sword Mastery was garbage. He couldn't match Matdashi in a sustained duel.\n\n*Shit.* Peak Sword backpedaled, eating another cut. *Caught right after Draw Sword went on cooldown.*\n\nPon was occupied. Huroi was occupied. No help coming.\n\n*I'm going to die to some nobody assassin while my guildmates watch—*\n\n\"Hah. How weak.\"\n\nNew voice. Cold. Arrogant.\n\n*Kurururung!*\n\nA pillar of blood erupted from the cobblestones, swallowing Matdashi whole. \n\n> [You have suffered 21,500 damage.]\n>\n> [The terrible smell of blood has caused dizziness. Skill casting time is increased by 20% and resistance is decreased by 20%.]\n>\n> [Sticky blood has crept into the gaps in your armor. Your armor won't move properly. Defense is reduced by 10% and movement speed has slowed.]\n>\n> [Your sword is covered in specks of blood. The blade is weakened and attack power is reduced by 10%.]\n\n*What—*\n\nDebuffs weren't supposed to deal damage. That was basic game logic. But this pillar hit like a boss's ultimate. And the debuffs—four stacking penalties that crippled every stat.\n\n*Monster.*\n\nMatdashi spun, searching for the caster. His eyes widened.\n\n\"Blood Warrior?\" \n\nKatz stood atop a pile of rubble, blood still dripping from his outstretched hand. \"Don't call me that anymore. Your organization's name drags mine down.\"\n\nHe dropped to street level. \"I joined Overgeared. I have a duty to impress Grid.\"\n\nPeak Sword blinked. \"You joined...?\"\n\n\"Call me Grid's servant from now on.\"\n\n\"Servant...!\" \n\n*What the hell is happening?*\n\nMatdashi didn't wait for clarification. He bolted.\n\n\"Running?\" Katz smiled. \"Smart. Pride's useless for people like you.\"\n\n*Grid's servant?* Peak Sword's brain stalled. *Did he just say—*\n\n\"Blood of One Thousand People.\" Katz raised both hands. \"This will hurt.\"\n\nThe blood on the ground—from dead enemies, from injured allies—rose like a tidal wave. It formed a spear the size of a telephone pole and lanced through Matdashi's spine. The man's scream cut short as his body burst.\n\nInstant kill. Third advancement user. Deleted.\n\n\"Wow...\" Peak Sword stared.\n\n*Is he stronger than Kraugel right now? Than Grid?*\n\nKatz turned to him. \"Tell Grid what just happened. Exactly as you saw it.\"\n\nPeak Sword nodded slowly.\n\n***\n\nBlonde hair clung to Euphemina's face, plastered by sweat. Her chest heaved. Every breath felt like lifting stones.\n\n*Hah... hah...*\n\nStamina: zero. She'd burned everything fighting Black's second resurrection. Her third resurrection. *Fourth?* Euphemina had lost count. The Duplicator class gave her versatility—copy any skill, use any magic. But her base stats suffered. Low stamina. Low endurance.\n\nNow she was empty.\n\n\"Hiit! Yihihihit!\"\n\nBlack bounced on her toes, breasts jiggling obscenely. Her frog-like features split into a grin as her tongue lolled out.\n\n\"Did I win? Hithit!\"\n\n\"Complete scam.\" Euphemina spat. \"How many resurrections do you have?\"\n\nSkill Observation couldn't measure it. Black's abilities remained a black box.\n\n*Can't endure anymore.*\n\nQuest: failed. Eight months in Siren—wasted. All that effort, all those carefully laid plans, gone. And worse, her guildmates had come to help. Lauel. Jishuka. Pon. Regas. They'd risked their lives.\n\n*I can't repay them. I hate owing debts.*\n\nBlack skipped closer, claws extended. \"Hiit! Hihit! My~ turn~ to~ kill~?\"\n\n\"...Hah.\"\n\nThe copied skills sat in Euphemina's mental inventory, useless without stamina to fuel them. She closed her eyes.\n\n\"Kill me quickly.\"\n\n\"You shouldn't give up.\"\n\n*Different voice.*\n\n\"...Hiit?\"\n\nBlack froze mid-lunge. Her body locked, muscles seizing against her will. Euphemina recognized the sensation instantly.\n\n*Restraint!*\n\nThen **Kill** struck Black like a guillotine blade—one clean slash across the throat, arterial spray painting the wall red."
}