{
  "id": 471,
  "title": "Chapter 471",
  "content": "Pets had different ratings. Of course, the higher the rating, the more valuable the pet.\n\nHow was this value calculated? Stats? Skills? Yes, but appearance mattered too. A pretty, cute pet rated higher than an ugly one. Yet intelligence trumped both abilities and looks.\n\nPets that only understood basic commands (attack, defend, move) remained low-rated despite excellent stats or good looks. They were difficult to use effectively. Intelligent pets were different.\n\nThey understood their master's words *and* thoughts, carrying out complex orders. This gave them higher ratings even with lower stats. Much more useful than their dim-witted cousins. This was why wyverns reigned as the 'best pet' for years.\n\nWyverns had high stats and enough intelligence to understand their master's intent. They always did their best to achieve their master's purpose, proving invaluable to players. The value of wyverns was high enough that players worldwide dreamt of mastering one.\n\nBut now, people didn't call wyverns the best. Pets more excellent than wyverns had emerged. Noe and Randy. Both belonged to Grid.\n\n\"Nyahahat! Master told me to help! Nyang!\"\n\nNoe flew on small wings. Regas' face brightened at the sight.\n\n\"Noe...! Thank you!\" He was facing a martial artist who freely used her massive weight while fighting. Asura Regas was the only one capable of going against her, and even he had reached his limits. Just moments from death, relief flooded through him.\n\nNoe placed his pink soles on Regas' wounded shoulders. \"The strongest demonic beast in hell isn't someone who will help humans. Nyang! But Master told me to help you! Nyang!\"\n\n\"Hahat, you are a good kid who listens to your master.\" Regas stroked his chin.\n\n\"Nyahahat!\" Noe danced at the praise.\n\n\"Take away her stats.\"\n\n\"I understand! Nyang!\"\n\nNormally, a pet's skill activation required their master's command. They couldn't use skills without orders. But Noe possessed intelligence enough to communicate with players. He judged situations himself and acted accordingly.\n\nNoe flew toward White. He opened his mouth wide, planning to swallow her in one go. White stepped back with brilliant control, avoiding his gaping maw. She raised one finger and stabbed Noe's throat with surgical precision.\n\nNoe's eyes widened. He fell to the floor.\n\n\"Ah... Hurts nyong.\"\n\n\"...\"\n\nDark clouds filled Regas' face once more.\n\n***\n\n> [You have been overwhelmed by an enormous energy.]\n>\n> [Resistance has failed. Retreating from the source of the energy.]\n>\n> [You have suffered 34,720 damage.]\n\nBlack's laughing face hardened for the first time in the entire fight against Euphemina. Surprise jolted through her.\n\n*Hi...ik?*\n\nAlmost 35,000 health consumed. From just one attack. It had pierced through all her <span class=\"rarity-legendary\">legendary rated items</span>.\n\n*Who?*\n\nA blue-black greatsword penetrated her chest. Black stared at the man with trembling eyes.\n\n*Grid...!*\n\nThat's right. Few could deal this much damage to her. Black recalled that Grid led Overgeared and swung her arms. Quick but exquisite. The sharp line of her tachi aimed at Grid's face.\n\n*Suuk.*\n\nGrid retrieved his greatsword and withdrew. Surprise flickered through him that Black remained relatively fine after taking Kill.\n\n\"Your leather armor is quite durable... Eh?\"\n\n*Shake.*\n\nGrid blinked. \"...Shaking?\"\n\n*Was it bigger than Jishuka's?*\n\nThe armor design was a bikini.\n\n*Completely my taste.*\n\nInstinct was a force that couldn't be denied. Grid became dazed by certain parts of Black's body.\n\n\"Recover your mind!\" Euphemina shouted urgently.\n\nWas it jealousy that increased her accent? Euphemina denied it. She believed her accent thickened from worry about Grid. Natural worry. Every moment was crucial in battle. Losing judgment for one second created a gap the enemy could exploit. Moreover, 0.1 seconds mattered in battles between strong opponents. How could Grid stay safe when he lost concentration?\n\n\"Hihit!\"\n\nBlack laughed and used Screw Sword. The attack reduced healing effects on the target and damaged items (decreasing item performance). Intimidating effects that forced worry. Black's specialty was using footwork to control her opponent's rear.\n\n*Jjejejeok!*\n\nBlack moved. The confused Grid barely blocked. Black appeared behind Grid in the gap and linked a new strike.\n\n\"Grid!\" Euphemina's voice echoed through the deserted area of Siren. She was worried, but Grid remained calm. \n\n*An attack I can't react to? It's fine.*\n\n*Puok!*\n\nBlack's tachi pierced Grid's back. Pierce Sword. The skill drove deeply into the target's body, inducing a definite critical hit. Very high damage coefficient. Normal people couldn't endure this attack. \n\nBut Grid was fine.\n\n\"Hi...?\"\n\n*It didn't even do 10,000 damage?* \n\nBlack was surprised by Grid's abnormally high defense. She tried to reclaim her sword. However, the barbs in Grid's armor held tight, greatly decreasing the durability of her weapon. A flash of bloody light struck Black's body.\n\nGrid swapped to Iyarugt. His attack speed was slightly faster than the National Competition. Black had close to 3,000 agility, yet even she felt astonished by Grid's speed. She hurriedly raised the small shield on her left wrist.\n\n*Jjeejeeeong!*\n\n\"...!\"\n\nBlack's body shook after colliding with Iyarugt. Her strength and stamina stats were relatively low. She couldn't withstand Grid's overwhelming attack power. Her upper body tilted. Black fell to the ground. \n\nGrid pursued as she drew back, preparing to link another attack. Black had already restored her posture, avoiding the strike. Like an acrobat.\n\n\"Hihit!\"\n\nBlack didn't shrink back despite facing the runner-up in the National Competition's PvP event. She laughed at Grid. *I have the advantage in agility and control.* Confidence radiated from her. However, physical abilities weren't the only important factor in combat.\n\n\"The power of items.\" Grid spoke calmly.\n\n\"...!\"\n\nBlack's dark eyes shook. Something cool and solid came flying, restraining her wrists and ankles. The famous God Hands.\n\n\"Hiik!\"\n\nGrid whispered to the struggling Black. \"I don't see a woman.\"\n\nThis was a gender equal society.\n\n*Puk!*\n\nIyarugt stabbed Black's body.\n\n\"Hiik! Hik! Kyaak!\"\n\nBlack had already suffered great damage from Kill. She died after allowing a few more hits.\n\n\"Well.\" Grid felt disappointed at not getting to see Black's large chest anymore. He stretched out a hand toward Euphemina. \"You endured well.\"\n\nEuphemina's eyes were bigger than usual. \"You... Haven't you become stronger?\"\n\n\"It turned out this way.\"\n\nGrid didn't say it, but he had suffered many trials while Euphemina was away. Battles against vampires Earl Elfin Stone and Baron Tiramet improved his combat skills. His intelligence was forced to develop in the Behen Archipelago. He overcame his own limitations.\n\nThe peak was the National Competition. Grid saw and learned much from fighting the strongest people representing each country. In particular, he made another breakthrough during the confrontation with Kraugel.\n\n\"By the way, that girl called Black isn't your opponent. How did you end up in danger?\" Grid's eyes were quite discerning compared to the old days.\n\nEuphemina laughed. \"She is like a cockroach. She has resurrected three times already. I became disadvantaged as more time passed.\"\n\n\"Resurrected? She dies and comes back again?\"\n\n\"Yes, I don't know if it is a class specific skill or the effect of an item...\"\n\nEuphemina's face hardened as she spoke.\n\n\"Hiit! Yihihihit!\"\n\nBlack. She appeared once again with a perfectly fine appearance.\n\n\"Heok.\" Euphemina started to explain her thoughts to the dumbfounded Grid. \"It doesn't seem to be a skill with a limited number of uses. If the resurrections were limited, she wouldn't come at me so hard.\"\n\n\"Right.\"\n\n\"But it doesn't fit that such a fraudulent resurrection skill wouldn't have penalties. Perhaps the Black in front of us is just a renewable clone and the real body is hiding somewhere else. But I refuse to believe there's such a strong clone.\"\n\n\"Um... It's plausible. I will set up video shooting mode.\" Grid pulled up his interface.\n\n\"Oh my.\" Euphemina smiled. \n\nGrid's action of recording fights against strong opponents showed he was much wiser than before.\n\n*It will be replayed a few times.*\n\nHe was always ready to study. Euphemina was feeling glad when she suddenly frowned.\n\n\"Hehe.\"\n\nShe belatedly noticed that Grid's gaze was fixed on Black's chest.\n\n\"It's low-grade.\" Euphemina muttered while looking at her own chest. \n\nThen Black used 'magic.'\n\n\"What's this...?\" Euphemina watched the flying flames and fell into confusion. *Wasn't Black an assassin class? Then how can she use magic?*\n\n\"Don't tell me, it's possible to change classes?\" Euphemina panicked.\n\n\"Aha, my physical resistance is high, so you're trying magic?\" Grid swapped his armor to the <span class=\"rarity-legendary\">Holy Light set</span>. He took Black's magic head-on. A way to show off his overwhelming power difference. \n\nThe effect was large. Black confirmed that Grid had only lost as much health as a rat dropping and lost control."
}