{
  "id": 472,
  "title": "Chapter 472",
  "content": "Black's frog-like features twisted into a nervous grin. \"How many spare items do you carry?\"\n\nGrid's expression didn't shift. \"More than you have lives.\"\n\nThe truth was simpler. If she had infinite resurrections, he'd kill her infinite times. Every death fed experience to his gear. Two birds, one stone.\n\nBlack's grin faltered. Every other player had retreated from her endless revivals. This bastard wanted to *test the limits*. Kraugel was skilled, calculated. Grid was raw ignorance wielded like a cudgel, and somehow that made him worse.\n\nShe laughed. A sharp, brittle sound.\n\nThen she ran.\n\nPride could wait. Survival came first.\n\nFire erupted between them, a roaring wall that devoured sight and oxygen. Black shot upward through the flames, wings of magic carrying her over Siren's broken corpse.\n\nGrid flew through the inferno after her.\n\nThe Holy Light Armor shrugged off the heat. Small price for momentum. He closed the distance while Siren's devastation unrolled beneath them, buildings collapsed like kicked anthills.\n\n*Pop. Pop-pop-pop.*\n\nBlack twisted mid-flight, hurling sparks over her shoulder. They splashed against Grid's armor. He ignored them.\n\n\"Your flames are garbage.\" He accelerated. \"Laella's were better.\"\n\nBlack's speed dropped. The assassin's grace she'd worn before was gone, stripped away with the class change. Different stats for different roles. Grid used Blacksmith's Eyes, analyzing her gear through the backdraft.\n\n*The wand and robe are high-tier. But no resurrection items. No class-change relics.*\n\nWhich meant the abilities came from the class itself. Or possibly a title, though that seemed unlikely. Resurrection and class-swapping on a title? Too broken, even for Satisfy.\n\n*She's legendary. Has to be.*\n\nA legendary class that could die four times and change roles at will.\n\n*Complete horseshit.*\n\nEven with penalties, it was obscene. Just like Pagma's Descendant.\n\n\"Pinnacle.\"\n\nThe distance collapsed. Black conjured a shield. Translucent, shimmering. Grid's blade carved through it like wet paper. Pinnacle ignored sixty percent of her defenses. Iyarugt's combo logic did the rest.\n\nBlack's chest split open. She crumbled into grey particles.\n\nGrid's hands moved, already casting. \"Magic Detection.\"\n\n> [**Resource Consumption:** 2,000 Mana]\n\nThe spell radiated outward, thirteen meters of perfect awareness. Expensive, but worth it. Euphemina's theory about clones rattled in his head as he sorted through the signatures.\n\n*Water Clan. Water Clan. Water Clan.*\n\nDying. All of them dying. The innocents Black had slaughtered bled out in Grid's mental map like guttering candles.\n\nHis jaw tightened.\n\nThen there. A new signature. Moving away from Black's last position.\n\n> **Name:** ???  \n> **Level:** ???  \n> **Class:** ???  \n> **Race:** Human  \n> **Status:** Player\n\n\"Gotcha.\"\n\nThe spell was only level two. Limited information. But the location was enough.\n\n\"Quick Movements.\"\n\nThe skill ignited. His agility spiked. The ruined city blurred into streaks of color as Grid *moved*, crossing the space in seconds. Up became down. The drowned streets were skies; floating debris, clouds.\n\nAhead. A figure. Using rubble for cover, thin as famine.\n\nGrid dropped through the water, landing in a crouch.\n\nThe woman had no curves, no softness. Her face was a skull wrapped in parchment. Protruding front teeth. Arms like winter branches. A baggy black dress that emphasized the skeletal frame beneath.\n\n*This is Black.*\n\nThe ID confirmed it. The features matched, even if the body didn't.\n\n*How many people has she killed?*\n\nGrid descended. Fast.\n\nBlack whirled, eyes wide. \"How did you—?\"\n\nGrid blocked the narrow alley. \"You going to explain those abilities?\"\n\nShe was an Illusionist. That much was clear now. Turn illusions real. Give them resurrection mechanics. Play god with disposable puppets. Euphemina had fought a copy.\n\nBlack scrambled backward, hands clutching her chest. \"W-Who would explain anything to a pervert?!\"\n\nGrid blinked. \"What?\"\n\n\"You're staring!\"\n\n\"I'm not.\" He glanced down, then back up. \"That chest doesn't interest me.\"\n\nBlack's face went crimson. \"Don't mock my body!\"\n\n\"I wasn't.\"\n\nHe recognized the look in her eyes. The hunched shoulders. The defensive snarl. Inferiority carved so deep it shaped every interaction.\n\n*Like looking in a mirror.*\n\nThe old mirror. The one he'd shattered.\n\nGrid hesitated. Not out of mercy. He wasn't soft enough to spare an enemy, especially one who'd tried to kill Euphemina. Black needed to learn that messing with Overgeared came with consequences. Needed to understand the cost.\n\nBut he was curious.\n\n\"What's your class?\" Grid asked. \"Legendary, right?\"\n\nBlack's jaw clenched. \"...\"\n\n\"I know you won't tell me.\" Grid shrugged. \"I'll figure it out when we fight.\"\n\nShe couldn't just die. Not with her infamy this high. Death meant a guaranteed item drop from her inventory, and she carried *everything*. Gear for every possible illusion configuration.\n\n*Illusion Manifestation!*\n\nThe remaining mana drained. A new figure shimmered into existence.\n\n> [The number of illusions created today has exceeded 5.]  \n> [The price of the sacrifice has grown. Your level has dropped by 1.]\n\nBlack's teeth ground together. One level. Gone. The penalty escalated with overuse, but she'd only hit this threshold twice. Once against Kraugel. Now against Grid.\n\n*Two monsters like White. Both men.*\n\nThe new illusion coalesced. A woman this time. Tall, elegant. Black's ideal. Same total stats, but redistributed. Extreme stamina and strength. A magic swordsman build designed to counter Grid's kit.\n\nBlack's voice cracked. \"How about this?! Attack power and magic combined! Your armor means nothing!\"\n\nHoly Light set or Triple Layers? Black forced the choice.\n\nGrid snorted. \"Are you stupid?\"\n\nHe swapped the Holy Light Armor for Triple Layers. Kept the gloves and crown. Medium physical defense, medium magic resist. The worst outcome for Black's plan.\n\nBlack stared. No words came.\n\n*It's over.*\n\nLinked Kill Wave shredded the illusion. Pinnacle Kill finished it. Black wasn't weak. Stronger than most National Competition participants. But the Diamond Capsule's sync rate erased that gap. Grid's attacks moved like thought made flesh.\n\nThe food chain had a top. Black learned it firsthand. The beast above her was Grid, and he was hungry.\n\n> [The player **Black** has been killed!]  \n> [The punishment of the wicked person has increased your reputation by 2,000!]  \n> [**Iyarugt** has grown from Unique to Legendary rating!]  \n> [The information about **Iyarugt** has been updated.]\n\n\"Yes!\"\n\nAt the PvP finals, Iyarugt's experience had stalled at 99.98%. Finally, it evolved. The blade shuddered in Grid's grip, its bloody light intensifying to something almost beautiful.\n\nThen he saw it.\n\nA ring. Glinting where Black's body had dissolved.\n\n\"Been a while since I looted a player drop.\"\n\nHis heart kicked into a faster rhythm. Black was legendary class. The drop could be anything. Could be *incredible*.\n\n*Don't.*\n\nGrid forced himself to breathe.\n\n*Don't expect anything.*\n\nWhen had expectations ever worked out?\n\n*It's probably garbage.*\n\nHe picked up the ring. Checked the stats.\n\nFroze.\n\n\"This is...\"\n\nHis hands trembled.\n\n\"Profit!\" Grid's voice cracked. \"It's pure profit!\"\n\nThe rush hit him like lightning. This was why he played. This exact moment."
}