{
  "id": 473,
  "title": "Chapter 473",
  "content": "> [<span class=\"rarity-legendary\">Ring of Absurdity</span>]\n> **Rating:** Legendary\n> **Durability:** 7/10\n> * Reduces the resources consumed by magic or a skill by half.\n> * Mana recovery rate will double.\n> \n> An artifact produced by the great magician Pauld.\n> A masterpiece born by chance, it displays the effect of ignoring ideas.\n> **Conditions of Use:** None.\n\nBraham's voice stirred within Grid's skull. 'Hoh, this is great. Pauld did well in his last years.'\n\nA rare flicker of interest from the ancient magician. Grid latched onto the unfamiliar name.\n\n\"Pauld?\"\n\n'Don't you know Eternal Benevolent Pauld? That's the name that most people know.'\n\n\"I wouldn't ask if I knew.\"\n\nThe ghost made a sound somewhere between a scoff and a sigh. '...Hrmm... Indeed, a blacksmith can't be blamed for not knowing the history of a magician. Pauld was a poor boy. He was born in the same era as me and never reached the top in his lifetime. Well, he's a tragic figure. He had some moderate achievements, but it was lacking compared to me.'\n\n\"I'm sure.\"\n\nGrid had learned to tolerate Braham's endless self-praise. He turned the ring over in his palm, studying the inner band. Tiny characters, etched with precision, formed patterns he couldn't decipher. A normal observer might have marveled at the delicate craftsmanship. With **3,000 Dexterity**, Grid saw only functional engraving.\n\n\"The effect of the artifact is due to these small characters?\"\n\n'That's right.'\n\n\"It's a real jackpot.\"\n\n*A resource reduction artifact.* Grid's hands trembled slightly as he processed what he held. These weren't simple mana reducers. Resources meant everything. Health, vitality, mana. Even the specialized gauges like fighting spirit that accumulated during combat and fueled ultimate skills. This ring cut all of it in half.\n\n*This is truly absurd.*\n\nThe market for such items existed in the realm of myth. Grid knew the stories. An artifact that reduced consumption by a mere twenty percent had appeared at auction once. Three billion won. Some anonymous player with money to burn had claimed it, and the ranker community had salivated over it for months. Twenty percent had been worth three billion.\n\nThis ring cut consumption by half. Plus doubled mana recovery.\n\n*If this hit the auction house...* Grid's mind conjured images of wealthy players trampling each other in a feeding frenzy. The value couldn't even be measured in currency anymore.\n\n\"Amazing... A serious jackpot...\"\n\nHis body shook. Not from cold. From pure greed and disbelief mixed together. Moisture gathered at the corners of his eyes. The last time he'd felt this level of financial euphoria was when the Comet Group sponsorship had dumped more gold into his account than expected.\n\n*Should I just become a professional bounty hunter? Focus entirely on hunting PKers?*\n\nThe thought wasn't entirely a joke. Grid filed it away as he turned his attention back to Iyarugt. The sword still floated in midair, storm-like energy crackling across its surface. The evolution process needed more time.\n\n*Good thing this didn't happen during the fight with Kraugel.* Grid forced optimism into his thoughts. The notification window materialized.\n\n> [The growth of Iyarugt has been completed!]\n\n\"Ohh...!\"\n\nIyarugt descended. Slowly. The blade stopped at eye level, hovering before him. The transparent red light had deepened, become richer. More brilliant than any red diamond, more beautiful than the finest jewel. The black handle rippled like waves frozen in obsidian.\n\nThe sword's overall design had refined itself. More stylish. Feminine, even. Beauty married to raw, oppressive power.\n\n*How much better is the performance?*\n\nGrid's heart hammered against his ribs as the window appeared.\n\n> [Iyarugt's unique skills and attributes are opened!]\n> [The information about Iyarugt has been updated.]\n\nA chime rang in his ears.\n\n> [<span class=\"rarity-legendary\">Iyarugt</span>]\n> **Rating:** Legendary (Growth)\n> **Durability:** 522/522 \n> **Attack Power:** 1,293\n>\n> * **Sword Mastery Level +7**.\n> * The skill 'Blood Cry' is generated.\n> * The skill 'Summon Sword Demon Iyarugt' has been generated.\n> * Decreases the healing ability of the target by 70% when they are hit.\n> * A critical strike will cause a bleeding status that will last for 5 seconds. The bleeding damage will be proportional to your attack power.\n> * The target's bleeding effect will be maximized when three combos are achieved. The damage done to the target will increase by 300% for 2 seconds.\n> * When five combos are achieved, the target's thinking ability will be destroyed for 0.3 seconds. At this time, you can link the skill 'Hell Sword.' 'Sword Demon's Senses' will be activated, making evasion rate extremely high for 5 seconds.\n> * Iyarugt's sensory effects aren't activated when Sword Demon's Senses is used.\n>\n> **Conditions of Use:** A person chosen by Iyarugt.\n\n\"Heok.\"\n\nFive hundred points. The basic attack power had jumped by a staggering five hundred points. Numbers that rivaled his <span class=\"rarity-legendary\">Grid's Greatsword</span>. Of course, the comparison wasn't perfect. One-handed swords swung faster than greatswords. Grid's Greatsword boasted a higher maximum damage ceiling. But the base power was there, and every option effect had scaled upward alongside it. Between Iyarugt and <span class=\"rarity-legendary\">Failure</span>, he now wielded two weapons that could compete for the title of best in existence.\n\n*What is today?*\n\nIyarugt had exceeded his expectations. The ring had fallen into his lap like a gift from a drunk god. He wanted more days like this.\n\n*Maybe...*\n\nA chill ran down his spine. *Is this a sign that bad luck is coming?*\n\n\"Crazy.\"\n\n*How big is the disaster heading my way?* Grid's paranoia spiked just as light flashed in his peripheral vision. He jerked his head up. Siren's central district. An explosion tore through the air, followed by shouts.\n\nThe place where Regas was fighting White.\n\n*Regas...!*\n\nAt least a thousand enemies. Thirty third advancement classes mixed in. Grid broke into a sprint. He'd made a promise. No sacrificing his comrades.\n\n***\n\nWhite stared at the party notification.\n\n*Black died?*\n\n\"Who...? Who dares beat up my sister!?\"\n\nLeveling an illusionist was torture. Black's combat ability was garbage. She relied on clones to hunt, and when those clones died, Black's experience plummeted. Every death mattered. Every level was precious.\n\nWorse, Black's infamy sat at maximum. Ninety-nine percent chance of dropping items on death. At minimum, a <span class=\"rarity-unique\">unique-rated</span> piece would fall. For Black, who constantly bought equipment to arm her clones, this death was catastrophic.\n\n\"I will kill you!\"\n\nThe quest didn't matter anymore. Ten thousand water clan dead, a hundred thousand. None of it compared to Black's lost level. Rage burned through White's veins as she bellowed at her guild members and their assembled forces.\n\n\"Kill the water clan later! Find all the Overgeared members and wipe them out!\"\n\nBlood Carnival had no hierarchy. Even the master didn't issue commands. Guild members operated on commissions, quest exchanges. But this was different. This was emergency.\n\nThe Overgeared members had gone wild. Blood Carnival's forces converged on White's position. Soldiers and mercenaries closed in from all sides. Regas and Noe found themselves encircled by nearly a thousand bodies.\n\n\"Kyaak! What is this, nyong!?\"\n\nNoe's eyes bulged. The cat who'd once mistaken a wyvern for a dragon, who claimed to be hell's greatest demonic beast while fearing death above all else. His fur stood on end. Regas scooped him up.\n\n\"Don't worry. I will protect you.\"\n\n\"Nyoong... How dare a human look so cool, nyang.\"\n\nNoe's eyes gleamed as he stared up at Regas.\n\n\"Regas!\"\n\nLauel's shout came too late. Huroi, Peak Sword, Pon, the rest of the Overgeared members. They poured in behind him.\n\n\"Hold on a little longer!\"\n\nLauel threw out Sky Dragon's Tears. Rain and lightning answered his call. Zednos and Laella launched their spells rapid-fire. Jishuka's arrows streaked through the air. Pon and Peak Sword crashed into the enemy lines with Huroi's buffs layered on and Toban holding aggro at the front.\n\nToo late. Regas had fought alone for too long. He had nothing left.\n\n\"Goodbye Noe.\"\n\nBlood and sweat painted his face. Regas smiled anyway, teeth flashing white. He stroked Noe's fur gently. Then he threw the cat into the air with the last of his strength. Noe sailed clear of the battlefield, safe.\n\nThe demonic beast spotted something. \"Master! Nyang!\"\n\n\"Freely Move.\"\n\nThe skill tore Grid across the battlefield in an instant. All non-targeted attacks phased through him like mist. He materialized at Regas' side. His voice came out flat. Angry.\n\n\"Summon Knights. Faker, Vantner, Toon, Asmophel.\"\n\n\"You! The bastard who killed my sister! Gridddd!\"\n\nWhite had been mid-swing toward Regas. She pivoted, locked onto Grid instead. Grid met her charge and spoke the final name.\n\n\"And Piaro.\"\n\n\"...!!\"\n\nFive golden pillars slammed down around Grid. Light faded. Five figures stood in its wake. The last was a middle-aged man in filthy work clothes, hand plow gripped in callused fingers.\n\nHe collided with White.\n\n*Kuaaaaang!*\n\n\"...Heok?\"\n\n*A farmer? Where did a farmer come from?* White's thoughts scrambled. *How did he hit my weak spot?*\n\n\"T-This disgrace...\"\n\nShe clutched her forehead where the plow had struck. The damage was wrong. Too high. Even accounting for her vulnerability, a farming implement shouldn't hit that hard. The farmer closed in, weapon shifting.\n\nA sickle.\n\n\"You, do you want to work with me in the fields? It will help you lose weight.\"\n\n\"What nonsense are you saying?\"\n\nWhite ripped the plow from her skull with a wet sound. She threw herself forward. Two hundred kilograms of mass concentrated into a single strike, force enough to crush bone. Regas couldn't have tanked this head-on.\n\nPiaro wasn't Regas. Lauel could call White sun-grade all he wanted. Her level fell short of the legendary farmer.\n\n*Puk!*\n\nThe sickle bit deep. White screamed."
}