{
  "id": 474,
  "title": "Chapter 474",
  "content": "\"U... Ugh...\"\n\nWhite staggered back, pain lancing through her ribs. *Twice. Attacked twice in the same damn spot. By a farmer.*\n\n\"You.\" She steadied herself, boots scraping against dirt. \"What is your identity?\"\n\nWhite had always prided herself on being the strongest player. The man standing before her, wielding a farming implement like a weapon, was a traumatic existence. She couldn't accept this. Not from some ordinary farmer.\n\nBut Piaro didn't consider himself ordinary.\n\n\"I am a great farmer who serves Duke Grid.\"\n\n\"Great...\" White's voice cracked. \"Farmer!\"\n\n\"That's right.\"\n\n\"Right...\" She blinked. \"Eh? What? It just means a farmer in the end!\"\n\n\"Is that so?\"\n\n*This is nonsense! Is he crazy?*\n\nSomething in her gut screamed to retreat. White stepped back, turning to call for help from her colleagues. Then a memory surfaced, unbidden.\n\n*The Seven Guilds invaded Reidan and were repelled by farmers.*\n\nBrief news. So absurd she'd dismissed it. She hadn't been interested in the Seven Guilds anyway.\n\n*I couldn't remember.* Her breath quickened. *Were they really defeated by a farmer? Is this man a real farmer?*\n\nIt was possible.\n\nWhich meant there was a bigger problem.\n\n*Are all of Reidan's farmers this strong?*\n\nReidan. Grid's territory. If even a farmer possessed this level of power, how much stronger were the soldiers?\n\n*It doesn't make sense!*\n\nPiaro's voice cut through her spiraling thoughts. \"Plant seeds in the ground with me. You have enough talent. It will help you lose weight.\"\n\nWhite's eyes widened.\n\n\"You should be glad to hear that you have a talent in farming!\"\n\nRage detonated in her chest.\n\n\"I'll kill you! Kill! Kill!\" She jabbed a finger at him. \"Why are you calling a perfectly fine person a pig? Hey, Mister! Would you call me a pig if I was a man? You, right now, this is sexual harassment caused by gender discrimination! I'll kill you!\"\n\n\"Huh?\" Piaro made a puzzled expression. \"I have never said you were a pig?\"\n\nSexual harassment caused by sexual discrimination? What did that mean? The words made no sense to him.\n\nWhite spun toward her allies. \"What are you doing? First of all, join me in killing this crazy old man...\" She froze. \"Heok?\"\n\nThe battlefield sprawled before her. A thousand Blood Carnival members being slaughtered by less than twenty enemies. Grid's summoned knights moved through the chaos like reapers.\n\n\"Go if you can pass me! Puhahat!\" Vantner's voice boomed across the field.\n\n\"Shit.\"\n\n\"This is too hard! How can we get through this?\"\n\nDozens tangled with the bald berserker alone.\n\n\"Kuhahahahat!\"\n\n\"Aaaagh!\"\n\n\"Kuak!\"\n\nToon's bestial form crashed through clusters of players. Five, six at a time went down beneath his claws.\n\n\"...\"\n\n\"Heok...\"\n\n\"Ugh...\"\n\nFaker appeared. Disappeared. Appeared again. Each time, someone died without understanding why. And above all others, there was the swordsman.\n\n\"Spark Sword.\"\n\n\"Kyak!\"\n\n\"Keook!\"\n\nThe NPC called Asmophel swung his blade. An ally's head tumbled free. His skill matched a knight commander, but wasn't Reidan a city where the farmers were strong? He was probably just a soldier.\n\n\"A soldier is so strong...!\" White breathed.\n\n\"...?\" Asmophel's head turned sharply, doubt written across his features.\n\n\"Eeit!\" White clenched her fists.\n\nThere was no chance of winning. The Overgeared members outclassed Blood Carnival. Two overwhelming NPCs. Numbers meant nothing against these monsters. White made her decision and launched herself toward Grid. Take the enemy's leader as a hostage. Reverse the situation.\n\nPiaro moved to intercept, but she'd expected that. White triggered her skill.\n\n\"Rising Body Fat!\"\n\n> [The amount of fat in your body has temporarily increased by 10 times.]\n> [Invalidates the enemy's attack for this duration and can fly to any target within 10 meters.]\n\n*Puk!*\n\n\"Huh?\" Piaro struck White's back with his hand plow.\n\nThe sound was wrong. Hard instead of soft. A subtle difference, but enough to create a sense of wrongness. The hand plow rebounded, and the generated elasticity sent Piaro flying backward.\n\n\"Gridddd!\" With the obstruction removed, White charged forward like an enraged boar.\n\nShe used the elasticity in her feet to propel her bulging mass forward. The sight should have been comical. It wasn't. It was terrifying.\n\nGrid didn't flinch.\n\n*Physical attacks bounce off?* He glanced at Piaro, who was recovering his stance.\n\n\"God Hands. Use Magic Missile.\"\n\n*Piing.*\n\n*Piiing! Pipipipiping!*\n\nThe four God Hands rose behind Grid, firing white flashes in rapid succession. Thanks to the Ring of Absurdity, Magic Missile consumed half the usual resources.\n\n*Magic Missile?* White nearly laughed. *The lowest grade magic isn't a threat.*\n\n*Peng!*\n\n*Pepepepeng!*\n\n\"Uck...!\" White's face contorted with each impact.\n\n*It hurts?*\n\nOf course it hurt. Magic Missile (Enhanced) attached to the God Hands using the Water Clan King's Tears reflected Grid's intelligence. Furthermore, Magic Missile had reached level three after steady use in the National Competition.\n\nMagic Missile (Enhanced) Level 3 completely ignored magic resistance and dealt 120% of Grid's intelligence as damage. Accounting for the forty intelligence elixirs from the Behen Archipelago, that meant 120% of 1,171 intelligence.\n\n> [You have suffered 2,576 damage.]\n> [You have suffered 2,576 damage.]\n> [You have suffered 2,576 damage.]\n> [You have suffered 2,576 damage.]\n\n\"Waaaaah!\"\n\nThe damage was absurd. White gulped down a potion as she descended toward Grid's head. But her massive body couldn't reach him. Grid had already activated Braham's Boots, using Fly to ascend. The moment she would have struck ground, he rose into the sky.\n\n\"Magic Missile. Magic Missile. Magic Missile. Magic Missile. Magic Missile.\"\n\n*Pepeng!*\n\n*Pepepepeok!*\n\nThe four God Hands and Grid unleashed a magical bombardment.\n\n*White specializes in physical resistance,* Grid thought.\n\nAsura Regas had competed against Damian in a full buff state. His offensive power made even Grid wary. Yet White had easily defeated him, then survived three attacks from Piaro. One had bounced off entirely. She possessed strong defense and the ability to neutralize physical attacks.\n\n\"Then it's a magical bombardment.\"\n\n*Pepeng!*\n\n*Pepepepeok!*\n\n\"Kuaaaaak!\"\n\nGrid hovered with an emotionless face, firing five Magic Missiles per second. It was comparable to existing magician rankers. An overwhelming force that blacksmiths shouldn't be able to exert. This power was fatal to White, who was vulnerable to magic.\n\n\"You lousy bastard...!\" White equipped accessories that increased magic resistance. \"If you're a man, come down and fight fairly!\"\n\nGrid replied sarcastically, \"Eh? I should fight fairly simply because I'm a man? Isn't that completely sexist?\"\n\n*What is this guy?*\n\nBlood Carnival had plenty of bad people, spiteful people, and crazy people. But there was no one more obnoxious than Grid. Two consecutive years in the National Competition and leader of a great guild. White rushed forward again, trying to reach him.\n\nOf course, it wasn't a wild rush. White was the strongest. She calculated the timing and trajectory of Grid's Magic Missile and leapt with perfect timing.\n\n\"How dare you?\" The crazy farmer chased after her, swinging his flail.\n\n\"Hit!\"\n\n\"Kyaaak!\" White's wrath soared as the flail struck her back.\n\n\"You cowardly wretch! 2 against 1?\"\n\n\"How is it cowardly on a battlefield?\" Grid shrugged and laughed.\n\nBut he didn't interfere with Piaro. The farmer faced White alone. Was it to be fair? No. Grid was filled with a great desire to kill all of Blood Carnival's third advancement users and obtain their items. He didn't want to waste time on the relatively strong White.\n\n\"Piaro, the item that drops when she dies...\" Grid paused. \"No, give me all the loot.\"\n\n\"Yes, My Lord!\"\n\nThe \"she\" was obviously referring to White.\n\n\"Who will be the one who dies?\" White snarled.\n\nMaking fun of her? She used her ultimate move to overturn the situation.\n\n\"Fat Burning!\"\n\n*Chiiiik!*\n\nSmoke rose from her body, which was over 200kg. White's fat burned away.\n\n\"Hoh?\" Piaro watched with interest.\n\n\"Wow.\" The Overgeared members, including Grid, stared in astonishment.\n\nWhite's obese frame became slender. Long arms and legs, a tight waist, full curves, large breasts. The face was an immense beauty. Somewhat lacking compared to world-class beauties like Yura and Jishuka, but still stunning. White had won the genetic lottery.\n\n\"Even Kraugel hasn't seen this appearance of mine. Realize the honor.\" White kicked toward Piaro with tremendous power and torque.\n\n*Will he try to avoid it?*\n\nIn the blink of an eye, White tried to predict Piaro's response.\n\n\"Fated to Perish.\"\n\n*Puk!*\n\n> [You have died.]\n\n\"...?\"\n\nOne blow from the hand plow.\n\nThe Blood Carnival members and soldiers fell into confusion as White collapsed.\n\n\"Kill everyone and take their loot!\" Grid's command rang through the battlefield."
}