{
  "id": 475,
  "title": "Chapter 475",
  "content": "Had they ever been hunted? If someone asked them this, the Blood Carnival members would answer 'NO.' They had always reigned at the top of the food chain. At least, until yesterday.\n\n\"Pant... Pant...!\" \n\nMarty's face was white with terror. His hands shook as he stumbled over debris. He'd accumulated a lot of infamy over the years, and now he'd met enemies stronger than him.\n\n*I have to somehow escape.*\n\nThe loss of items terrified him more than the experience loss. The gear he currently possessed was worth half a year's earnings. If he died here, it would all be gone.\n\nA boy swordsman called Ibellin shifted his stance ahead. The mercenaries Marty had hired for an expensive sum approached from the flanks. Ibellin turned his gaze toward an arrow coming from the rear.\n\n*Now!*\n\nMarty measured the timing and threw the bomb. It was homemade, its power greater than single-target A-grade magic. He'd raised his passive skill 'Intermediate Bomb Throwing' to level 9. The throwing speed and accuracy were excellent.\n\nPeeeeeong!\n\nThe bomb exploded where Ibellin was standing. The force of the blast couldn't be ignored. Beyond the transparent wall surrounding Siren, the waves surged.\n\n*Perfect!*\n\nHe did it properly. Ibellin would definitely fall into a stunned state from that damage.\n\n*Should I finish it off?* \n\nMarty considered for a moment. \n\n*No. I shouldn't waste time on a kid.*\n\nWasting time meant he could be targeted by other Overgeared members. Marty decided to flee. He took two steps.\n\n\"It hurts.\" \n\nIbellin's voice came from right next to him.\n\n\"Don't you have a great deal of attack power?\"\n\n*This bastard...!*\n\nHe resisted the stunned state from the bomb and instantly caught up? Marty observed the accessories Ibellin was wearing and spat out a small bomb that had been inserted between his molars. It was the size of a bean. It shot accurately at Ibellin's face. But before it hit—\n\nPuok!\n\nIbellin's flamberge was faster. It pierced Marty's brow.\n\n\"Kuk...! Shit!\"\n\nMarty was vulnerable at close range. He was going to die like this.\n\n*But I won't die alone!* \n\nMarty smiled with satisfaction. \n\n*The bomb I spat will soon approach... What?*\n\nHis expression twisted. The small bomb that he launched earlier. He witnessed it split in half on the ground.\n\n*He stabbed me at the same time as cutting the bomb in half?*\n\nPuk! Puk puk!\n\nIbellin's flamberge pierced Marty again. The pain was terrible. Marty cried out.\n\n\"This kid...! You're only playing games without attending school! Why is your control so good...? Cough! Cough!\"\n\nIbellin slashed lightly at Marty's neck.\n\n\"Ah really. Don't you know that kids are originally good at playing games? And I'm now 18 years old.\"\n\nMarty died. Ibellin checked the details of the paper he dropped and scratched his head.\n\n\"Unique rated bomb recipe... This is fairly expensive... Hrmm... I will give it to the alchemy facility.\"\n\nA boy with the aspiration to go beyond Kraugel and become the ultimate swordsman. He was one of the 10 Rookies and was growing steadily. It was as a member of Overgeared.\n\n***\n\nKnox stared at the battlefield. His face was blank.\n\n\"Hey, does this make sense?\"\n\nThe mercenaries he hired were nothing more than sandbags in front of the Overgeared members.\n\n\"Why are the numbers like this?\"\n\nThe army of 1,000 had decreased to less than 700. Scott stood beside him.\n\n\"Katz is present. At least 100 people died because of him.\"\n\n\"Katz? Blood Warrior?\"\n\n\"Yes.\"\n\n\"Why is he here?\"\n\n\"It seems like he's joined Overgeared.\"\n\nKnox exhaled.\n\n\"Hah... Scary, scary.\"\n\nIt was difficult to predict the scale that Overgeared would grow to. In particular, the power of the rumored farmer was beyond imagination. There was also the NPC called Asmophel.\n\n\"Wouldn't it be better to talk to Master and persuade him to step on them early? It will be hard to keep them in check later.\"\n\nScott shook his head.\n\n\"Brother doesn't want that. Guild wars are a form of extreme warfare, so it is more efficient to conquer NPCs and tax them.\"\n\n\"Right... As the Overgeared Guild is growing stronger, so are we. Well, we don't have to be scared. Obtaining named NPCs is becoming a trend.\"\n\n\"Yes, a farmer is a peasant without much room to grow. We don't need to fret. Once the scale of the fight expands to a war, we will be victorious.\"\n\nScott and Knox served Ares, the ruler of the battlefield who was aiming at becoming the 'emperor.' The reason they accompanied Blood Carnival was to keep a close eye on the rumored White and Black sisters.\n\n\"Now that we're well aware of their skills, they no longer matter. We should go back to Brother now.\"\n\nKnox hesitated.\n\n\"Wait. Can't we fight a few members of Overgeared? I'd like to fight that person called Faker.\"\n\n\"Grid, Piaro, and Asmophel. The three of them are dangerous. We should get out while we can. It's possible that the person called Lauel can block all paths of retreat.\"\n\nKnox grimaced.\n\n\"Keok, I understand.\"\n\nScott and Knox hastened to leave. They suppressed the water clan soldiers who tried to block them, but didn't kill any. Meaningless killing wasn't the path they pursued.\n\n***\n\nLaella cast her spell.\n\n\"Fire Shield!\"\n\nVantner stood in front of her, protecting her position. As the first ranked fire magician and the one in charge of Reidan's magic tower, she saw a wind blade flying toward her and hastily used defensive magic.\n\nPeeng!\n\nThere was a shockwave as two spells collided. A woman appeared beyond the flames. Her ID read Maika.\n\n\"Hehe, it's pathetic to see a global idol playing games. What are you doing? Shouldn't you be singing songs for your fans?\"\n\nLaella replied calmly.\n\n\"This isn't just a game. Satisfy is just as fun and precious as reality. Of course, that doesn't mean I'm neglecting my fans. I refrain from appearing on air, but am steadily holding my concerts. Ah, I will be releasing a new song January of next year. Please look forward to it.\"\n\nMaika became angry when her taunt failed.\n\n\"Bah! Who said I was your fan?\"\n\nShe cast a tornado spell. She planned to break through Laella, who seemed relatively easy among the Overgeared members, and leave the battlefield. But Laella wasn't an opponent easily dismissed. She might seem weak among the Overgeared members, but the title of 1st ranked fire magician couldn't be won by just anyone.\n\nPepepepeng!\n\nLaella read the flow of the tornado and shot five arrows at the same time.\n\n*This is impossible!*\n\nMaika was astonished. Laella used the direction of the wind to increase the force behind her fire arrows. Wind and fire could be used to complement each other depending on their use. Maika was pushed back by this.\n\n\"Kyaaaaak!\"\n\nMaika screamed as she was swept up by the flames.\n\nJishuka looked at Laella from above while killing enemies.\n\n\"You don't need my help. You have grown, my Laella.\"\n\nZednos, the 1st ranked wind magician, puffed up his chest proudly.\n\n\"Laella has been sparring with me every day. It's a piece of cake for her to deal with wind magic.\"\n\nJishuka smiled.\n\n\"Piece of cake? Isn't that something Peak Sword says?\"\n\n\"I've often heard him say it... I was naturally influenced.\"\n\n\"Hahat.\"\n\nA relaxed conversation. Someone might misunderstand it as taking place between friends enjoying teatime. However, this was the battlefield filled with blood and screams. Jishuka and Zednos had killed over 100 enemies while laughing and talking.\n\n*Huge firepower.*\n\nGrid searched for prey using Fly in the sky above. He watched Jishuka and Zednos work. In particular, he admired Jishuka's attack power every time. He couldn't deny that archers were the class with the strongest physical damage.\n\nHis eyes shone.\n\n\"I found you.\"\n\nApproximately 50 meters away from the battlefield, a rodent moved through thick seaweed. The ID was extremely red, suggesting he was a third advancement user of Blood Carnival.\n\nGrid was blinded by greed.\n\n\"Give me your item!\"\n\nHe started firing at random. He used **Transcend**, making his ranged attacks extremely powerful.\n\nKwa kwa kwa kwang!\n\nA heavy bombardment of energy blades shattered the ground. Garuda, who was moving through the overgrown seaweed, barely managed to overcome the crisis by using a defensive skill. No, he thought he was safe.\n\n*When...?*\n\nGrid kept swinging the sword like crazy in the sky. How long was he going to keep shooting the energy blades?\n\n*Is his mana infinite...?*\n\nGaruda couldn't even imagine that this was an 'autoattack' skill. He hoped the bombardment would be over. An unexpected person near him saw the opportunity and waited.\n\n*Damn Grid!*\n\nThe person with a hostile attitude to Grid was Tarma. The assassin who participated in the National Competition to assassinate Kraugel, only to be smashed by Grid and Kraugel in a row.\n\n*It's your fault that I was disgraced!*\n\nDuring target processing, Tarma had a chance to assassinate Kraugel. But he was interrupted by Grid and killed in a matter of seconds. The shock to his spirit was enormous.\n\n*After that, I eventually lost to Kraugel...!*\n\nHis colleagues kept teasing him. His face turned red and his heart was empty when he watched the 'Tarma 2 seconds' video floating around on the Internet. He wanted to hide in a mouse hole.\n\n*I will get revenge!*\n\nTarma calmed his heart and looked for an opportunity. He seized the moment when Garuda died and Grid was picking up the item. It was complete carelessness!\n\n*Go!*\n\nSururuk.\n\nTarma moved without a sound and took control of Grid's rear. His dagger aimed for Grid's neck.\n\n> [You have died.]\n\n*What?*\n\nHe was dead?\n\n*Why?*\n\nWhen? By who? What was this? As the confused Tarma's vision turned grey, the name 'Faker' could be seen.\n\nGrid was shocked when picking up the shoes that Garuda dropped.\n\n\"Huh? What's this?\"\n\nHe found another new item behind him. Euphemina ran up to him.\n\n\"The situation is roughly finished. An audience with the water clan's king... Do you want to go see him with me?\"\n\nGrid nodded.\n\n\"Hrmm, I will see him.\"\n\nMost of the third advancement Blood Carnival members had died or disappeared. Only the mercenaries remained on the battlefield. Grid was guided by Euphemina and headed to the royal palace."
}