{
  "id": 476,
  "title": "Chapter 476",
  "content": "The war hadn't ended.\n\nFive hundred Blood Carnival soldiers still stood, backs against the wall. Desperation fueled their resistance.\n\nA warrior kicked the corpse of his fallen comrade aside. \"We have to survive!\"\n\n*If I die here, I lose everything.* Items. Experience. Progress.\n\n\"Don't retreat!\" another shouted. \"Push through them!\"\n\n\"Less than twenty enemies left! Grind down their stamina!\"\n\nThe cornered soldiers rallied. Fear transformed into fury. Even the Overgeared members felt the weight of the numbers pressing against them.\n\nGrid descended from the sky. His boots touched stone without sound.\n\n\"Lauel. Euphemina. Come with me to meet the Water Clan King.\"\n\nLauel's jaw tightened. \"Now? The battle's still—\"\n\n\"Maxong only leaves his bedroom once every three days,\" Euphemina said. She brushed dust from her sleeve. \"This is that window. Miss it, and we wait another three days. The system blocks bedroom invasions otherwise.\"\n\nLauel's frown deepened. \"The king hides in his room all day? While his kingdom burns?\"\n\n\"He lost his mind when the princess died. It's been years since he cared about anything.\"\n\n\"Pathetic.\" Lauel spat the word. \"A man without the qualities of a king sits on the throne while his people suffer.\"\n\nThree days. Too long. Too much work left undone. Lauel weighed the risks. Their guildmates were exhausted. Six third advancement users still fought in the Blood Carnival ranks.\n\n*Can they hold?*\n\nGrid's hand landed on Lauel's shoulder.\n\n\"No need to worry. Piaro and Asmophel are here.\"\n\n\"I know they're strong. Piaro's worth a thousand soldiers. Asmophel matches our best members.\" Lauel gestured toward the battlefield. Blood slicked the stones. \"But our people are tired. Can they hold until Piaro finishes mopping up?\"\n\nThe worry was genuine. Reasonable. Grid studied Lauel's face. Once, Lauel would have sacrificed anyone to achieve his goals. That ruthless calculus had defined him.\n\n*But you're changing. Just like me.*\n\nGrid patted Lauel's head. The gesture was warm, almost paternal.\n\n\"Trust me. Asmophel's not what you think.\"\n\nGrid had underestimated the man until recently. The Great Lord's Sword revealed hidden truths. Asmophel's stats, his potential—Grid had placed him near the top Overgeared rankers.\n\nEven that was too low.\n\n\"He's right next to Piaro in skill.\"\n\nGrid's skin prickled at the memory. Asmophel's unique characteristics still haunted him: **Great Talent Matures Late** and **Determination of the Number Two**.\n\n*Kraugel will someday surpass Piaro. Asmophel might do the same.*\n\n***\n\nSteel rang against steel. Blood sprayed.\n\n\"Impossible! One soldier—this strong?!\"\n\nAsmophel's blade punched through a ribcage. He withdrew it with clinical efficiency. \"I'm not a soldier. I'm the captain of the Overgeared Magic Knights Division, serving Duke Grid directly—\"\n\n\"Urk! Killed by a soldier? How shameful!\"\n\n\"...\"\n\nAsmophel had once been the second greatest swordsman after Piaro. The Saharan Empire had called him their pillar. But never had he felt this frustrated.\n\nThat woman White had called him a soldier. Now everyone treated him like rank-and-file infantry.\n\nHis corrections meant nothing.\n\n\"A farmer and a soldier!\" A Blood Carnival assassin backflipped away from Asmophel's thrust. \"What kind of monsters does Grid train in Reidan?!\"\n\n\"I'm not a soldier, I'm the—\"\n\n\"How does that bastard Grid raise his troops?\" The assassin's eyes were wild. \"I'm never going near Reidan again!\"\n\n\"...\"\n\nSince joining Duke Grid's service, Asmophel had barely seen action. No opportunities to demonstrate his worth. No stage to prove his value.\n\nThis battle was different. The perfect chance.\n\n*I need Duke Grid to see me. To acknowledge me.*\n\nBut no matter how many enemies he cut down, they called him 'soldier.' Nothing more.\n\n*What if My Lord thinks I'm just common infantry?*\n\nHis blade opened a throat. Reversed. Blocked a desperate counterattack. Pivoted. His knee shattered a second attacker's jaw.\n\nThe second advancement users fell like wheat before a scythe. Their controlled attacks, their practiced techniques—Asmophel read them all. He moved through gaps they didn't know existed.\n\nThe Overgeared members watched in awe.\n\n\"Asmophel was this strong?\"\n\nJishuka nocked another arrow. \"I thought he just ran drills at the barracks.\"\n\n\"He's incredible.\" Pon's spear deflected an incoming sword. \"Like Faker's speed with Peak Sword's damage. No long cooldowns.\"\n\n\"He's comparable to Piaro.\" Vantner slammed his shield into an enemy's face. \"Maybe even Grid and Kraugel.\"\n\n\"...But they're all calling him a soldier.\"\n\nLaughter rippled through the Overgeared ranks. The tension broke. The tide shifted.\n\n***\n\n\"Siren is a well.\"\n\nEuphemina's words echoed in the corridor. Stone walls pressed close on either side. Bioluminescent algae cast everything in pale blue light.\n\n\"A kingdom of two hundred thousand people. No trade with the surface. No knowledge of the outside world.\" She glanced at Grid. \"Most water clan are narrow-minded and lazy. Their worldview doesn't extend past these walls. Those who crave development or change? Rare. King Maxong is the same. Most citizens don't even care if he rules or not.\"\n\nLauel's expression darkened. \"Isolation created stagnation. Stagnation bred an incompetent king. The whole kingdom is mixed up.\"\n\nEuphemina blinked. \"Mixed... up?\"\n\nThe phrase hadn't translated into Satisfy's official language.\n\nGrid tilted his head. \"When did you learn that saying?\"\n\n\"I've been studying Korean. To understand you properly.\" Lauel's tone was matter-of-fact. \"It's a scientific language. Easy to parse. Combined with the knowledge from my first life, I mastered it in four days.\"\n\n\"Four days.\"\n\n\"Learning everyday phrases conveys meaning more efficiently. I also know 'Eumgunjin.' That describes my current state.\" Lauel adjusted his robe. \"Strict, hardworking, sincere.\"\n\n*Is he planning to immigrate?*\n\nGrid remembered the first National Competition. Lauel hadn't been part of Overgeared yet. He'd missed the chance to buy property near Grid's building in Seoul. But here he was, the first to master Korean.\n\nLauel turned to Euphemina. \"Maxong mourns his dead princess. But there are three other princes. What about them?\"\n\n\"Second Prince Nuong is extremely lazy. He expends minimal energy to eat and sleep.\" Euphemina counted on her fingers. \"First Prince Paong and Third Prince Gulong are different. Diligent. They have radical ideas compared to typical water clan. But they're still limited by their upbringing. They want to isolate Siren from humans again, not reform it.\"\n\n\"Better than their father, at least.\" Lauel nodded slowly. \"I understand their perspective. From their position, why would they trust greedy humans?\"\n\nHe fell silent. His eyes unfocused.\n\n*What's he scheming now?*\n\nGrid and Euphemina exchanged glances. Before either could ask—\n\n\"Let's change the king.\"\n\nThe words hung in the air like a thrown knife.\n\n***\n\nSiren's thirty-fifth king sat on a throne carved from a single massive pearl.\n\nMaxong had inherited the crown by birthright. Eldest son. Nothing more. Like most kings, he'd done little for his kingdom beyond enjoying the privileges of his station.\n\nHis eyes were dead. Flat and grey, like a fish three days past fresh.\n\n\"You saved Siren from destruction.\" His voice carried no inflection. \"I thank you on behalf of the people. Seek out the prophet Miong for your reward.\"\n\nGrid's hands curled into fists. Euphemina had warned him, but this was worse than expected.\n\nLauel stepped forward, opening his mouth to advise—\n\n\"Get your ass out of that chair.\"\n\nLauel's mouth snapped shut.\n\nGrid's gaze pinned Maxong to his throne. \"Stand up. Walk down here. Then bow your head and thank me properly for saving your people and your pathetic royal family.\"\n\nSilence.\n\nMaxong stared. He'd been a prince from birth, then a king. No one had ever spoken to him like this. The palace guards lining the walls gaped. The situation was too surreal to process.\n\nGrid waited three heartbeats.\n\n\"Come down.\"\n\nHe'd wanted an alliance. Mutual trade. Military cooperation. Benefits for both sides. But watching this empty shell of a man sit on a throne he didn't deserve?\n\n*This kingdom has no value under his rule.*\n\nGrid's ambitions had evolved. Money had been enough once. Just enough to pay his debts, take care of his family.\n\nNot anymore.\n\nAs the master of Overgeared—a guild gathering the strongest in every field—he needed to be more. The best. Someone without shortcomings.\n\nIt was natural. Expected. In PvP-focused games, players dreamed of reaching the top.\n\nGrid had earned the right to those dreams.\n\n\"The king of Siren will serve me from now on.\" His voice cut through the throne room. \"Refuse, and I'll take what I want by force.\"\n\nMaxong's dead eyes finally showed something. Confusion. Disbelief.\n\nLauel smiled.\n\n*He's learning to seize opportunities without prompting.*\n\nSiren's people were simple. Its geography made it easy to defend. The kingdom would be valuable with proper management. Even if acquiring it required bloodshed.\n\n*Grid's evolving faster than I expected.*\n\nThe thought filled Lauel with satisfaction."
}