{
  "id": 477,
  "title": "Chapter 477",
  "content": "\"I am the king of Siren.\" The voice rumbled from the throne. \"I am the sea. I embrace and swallow everything just by existing. Something like this...\" \n\nMaxong rose. Over two meters tall, his aquamarine scales caught the light as muscle shifted beneath them. His expression, frozen in grief since his daughter's death, finally changed. What surfaced was raw anger.\n\n\"You dare spit at the king?\" His voice dropped to a growl. \"Have you never felt the terror of the sea?\"\n\n*Kwaang!*\n\nThe white jade throne cracked as he stood. The pearl chamber shook.\n\n\"I will serve no one! I alone am worthy of honor!\"\n\nThe words carried weight. Literal, crushing weight. Soldiers grabbed their ears as blood ran between their fingers. Euphemina stumbled. Lauel went to one knee.\n\n> [Maxong has cast 'Wrath of the Water Clan's King.']\n>\n> [In the voice of the chosen king, there is a dignity of the sea that the perpetrator can't withstand!]\n>\n> [Resistance to the water attribute has dropped by 50%!]\n>\n> [You are injured! Health will consistently be consumed.]\n>\n> [Your sense of balance is off and all speeds will drop by 20%.]\n>\n> [Skill and magic cooldown time will be increased by 20%.]\n>\n> [You have fallen into the 'fear' state!]\n>\n> [You have fallen into the 'confused' state!]\n>\n> [You have resisted.]\n>\n> [A tsunami is coming!]\n\n*Kuwaaaaaang!*\n\nMana coiled around Maxong like serpents. It condensed, then exploded outward as a wall of water. Grid's breath caught.\n\n*This is the first time I've seen water magic this strong.*\n\nHe couldn't dodge. The tsunami was too wide, too fast. And behind him stood Euphemina and Lauel.\n\n*I have to protect them.*\n\nGrid swapped to the Holy Light set mid-step. The God Hands materialized around him. He yanked the Divine Shield from his inventory and planted himself between his guildmates and oblivion.\n\n\"Root Curtain!\" Euphemina's hands moved through the casting motions.\n\nVines erupted from the stone floor. They wove together in an instant, forming a living barrier. The tsunami crashed into them. The vines drank deep, swelling with stolen water. In seconds, the luxurious throne room transformed into a wild forest.\n\nGrid blinked. \"Wow. You actually stopped it.\"\n\nEuphemina met his gaze, her expression calm. \"I'm always ready. I can always prevent the worst from happening.\" She flicked her fingers, sharing the quest window.\n\n> [The hidden quest 'Water Clan King's Fury' has been created!]\n>\n> **[Water Clan King's Fury]**\n>\n> ★ A hidden linked quest with the Hidden Quest 'Upcoming Destruction' ★ (A maximum of 5 people can participate)\n>\n> Five years ago, Maxong lost his beloved daughter Ohong. His ears, eyes, and mind are closed, as he misses Princess Ohong. Now his closed mind is released because of extreme anger.\n>\n> Suppress Maxong, the powerful water clan king! If you defeat him, who has never lost since he was born, he will be shocked and awaken. His eyes will be drawn back to reality and he might become a wise king.\n>\n> **Quest Clear Condition:** Reduces Maxong's maximum health by 90%.\n>\n> **Quest Failure Condition:** Maxong's death, or the destruction of the quest facilitator.\n>\n> **Quest Clear Rewards:** Maxong's awakening. Become Maxong's benefactor. Speed up the development of Siren.\n\n*A hidden quest.*\n\nGrid read it twice. Satisfy was full of quests, thousands of them, but linked quests were special. Complete one, trigger another through the right actions. The rewards for linked quests were always substantial. A hidden linked quest, though? That was gold.\n\n\"The reward is just Maxong's awakening?\" Grid frowned. \"Why so simple?\"\n\n\"This is evidence that Maxong is a huge part of Satisfy.\" Euphemina gestured at the notification. \"Maybe this is a golden opportunity to obtain a named NPC as great as Piaro.\"\n\nLauel finally shook off the status effects. He wiped blood from his ear. \"A rare hidden quest. We must succeed.\"\n\nHis voice was steady, but Grid caught the tension underneath.\n\n*It will be difficult.* Lauel's mind raced. *This hidden linked quest that was unintentionally generated... the clearance difficulty is insane.*\n\n*A quest that only triggers when someone clears 'Upcoming Destruction' and then angers Maxong.* The starting conditions alone were absurd. And Grid had stumbled into it by igniting an NPC's raw emotions.\n\n*The difficulty is the worst.* Lauel clenched his fists. *Fighting a king while the city is under siege doesn't make sense.*\n\nIn reality, a king was just a political leader. In Satisfy, a king was a named NPC. And most named NPCs were monsters. Exceptions existed, but Maxong wasn't one of them. As the representative of an entire species, his power would transcend common sense. That first attack proved it.\n\n\"It would be nice if Faker was here instead of me.\" Lauel's admission was quiet. \"I'm sorry for our colleagues outside, but you should call Piaro and Asmophel.\"\n\nHe hated himself for saying it. Hated that he had to suggest sacrificing their allies for optimal results. Grid's answer was immediate.\n\n\"I don't want to.\"\n\nLauel's head snapped up.\n\nGrid's jaw was set. \"I don't want to feel the helplessness and guilt I experienced during the Elfin Stone raid. That's why I've been working harder.\"\n\nHe squared his shoulders. The Holy Light Armor gleamed.\n\n\"I've become stronger. It's time to show the fruits of my hard work.\" Grid met Maxong's furious gaze across the vine-choked chamber. \"I will catch Maxong without the help of Piaro and Asmophel.\"\n\n\"Grid...!\"\n\nLauel's face went pale. *It's impossible.*\n\n*Teong!*\n\nMaxong launched from his position. The speed was unreal for someone built like a brick wall. Euphemina and Lauel couldn't track the movement. Only Grid managed to react.\n\n*Jeeeong!*\n\n\"Ack!\" \n\nIyarugt met Maxong's right elbow. The impact sent Grid skidding back a step. The vibration rattled his bones.\n\n*His physical power surpasses Chris.*\n\n*Peeeeeong!*\n\n\"Kuak!\"\n\nA water column erupted from Maxong's palm. It slammed into Grid's chest.\n\n> **[-7,800 HP!]**\n\nAnd that was while wearing the Holy Light set. Maxong's magic power was double that of a drake. But Grid had grown tougher. He weathered the attack, and the God Hands struck back.\n\n*Puk!*\n\n*Puuok!*\n\nThe **+9 Failure**. The **+8 Grid's Greatsword**. The **+8 Doppelganger's Greatsword**. The **+7 Ideal Long Sword**. All four weapons pierced Maxong's chest and waist simultaneously.\n\nMaxong's body jerked. He gritted his teeth against the pain. But he didn't slow down.\n\n*Kwarurung!*\n\nThunder filled Grid's ears. Maxong was already in front of him. When had he moved?\n\n*Peeok!*\n\n> **[-5,900 HP!]**\n\nA scaled foot caught Grid in the ribs. He crashed through the vines, splinters of wood raining down.\n\n\"How dare you!\"\n\nLauel thrust his hands forward. \"Dragon's Claws!\"\n\nStone pillars erupted beneath Maxong's feet, aiming for his throat. Maxong summoned blue water without looking, dissolving the stone on contact. Lauel didn't panic. From the start, his role was distraction.\n\n\"Tree Giant's Hug!\"\n\nWhile Grid and Lauel held Maxong's attention, Euphemina completed her second S-grade spell. She'd chosen wood attribute magic specifically for this underwater kingdom. High resistance to water attacks.\n\n*Kudududuk!*\n\n\"Huup!\"\n\nThe vine forest twisted. It formed the shape of a giant, arms wrapping around Maxong's torso. The grip tightened, constricting, trying to tear him apart from sheer pressure. Maxong grunted.\n\nGrid rushed in. Iyarugt's aura flared with killing intent.\n\n\"Kill!\"\n\n*Puoook!*\n\n\"Kuaaaaak!\"\n\nThe legendary-rated Iyarugt was faster now. Sharper. Grid wore the Slaughterer's Eye Patch, and the weak points lit up like targets. He drove Iyarugt into Maxong's clavicle with surgical precision. Maxong's scream echoed.\n\nGrid rotated, withdrawing the blade. He fired Magic Missiles point-blank while his footwork shifted. Pinnacle Kill linked seamlessly.\n\n> **[Critical!]**\n>\n> **[You have dealt 455,000 damage to the target.]**\n\nGrid's health dropped as payment for Pinnacle Kill. He transitioned into Link, raising a defensive posture. Iyarugt's combo system activated. The vines shattered as Maxong broke free.\n\n*Jjejejeok!*\n\nFists and a kick, top and bottom. Grid blocked with Iyarugt and the God Hands.\n\n*Pepepeng!*\n\nWater bombs slipped through his guard. Grid coughed blood, his chest burning.\n\n*Shit. Why isn't 5 Joint Attacks activating these days?*\n\nThe ultimate option on the Holy Light Gloves had saved him countless times before. During the last raid, it had turned the tide. During the National Competition, it had vanished. Now, when he needed it most, nothing.\n\n*I've been earning money lately. Is this the bad luck I get in return?*\n\nDamn Lady Luck. Grid gritted his teeth and pressed the attack.\n\n*Pepeng!*\n\n*Kwa kwa kwa kwang!*\n\nMaxong focused entirely on Grid, weaving through Lauel and Euphemina's spells like they were standing still. Grid stared into those blue eyes, filled with rage, and something clicked. He laughed. The sound was bitter.\n\n*Son of a bitch.*\n\nThe absurdity of it all hit him. Rewarding the heroes who defended Siren? \n\n*Maxong was never even interested in Siren.*\n\n\"Shit! You unscrupulous old man!\" Grid's voice cracked with fury. \"You don't deserve to be a king!\"\n\nRage boiled in his chest. He wanted to make Maxong understand. But the Water Clan King's strength matched Elfin Stone's. Maybe exceeded it. Three people couldn't raid this monster. Not cleanly.\n\nGrid pulled out every card he had.\n\nFirst, Noe and Randy materialized beside him.\n\n\"Summon Knight! Jude!\"\n\nWinston's first defender appeared in a flash of light.\n\n\"Summon Demon, Iyarugt.\"\n\nFinally, he called forth the one who shouldn't exist.\n\nGrid's strategy had always been quality through items. Now he would show them quantity."
}