{
  "id": 478,
  "title": "Chapter 478",
  "content": "# Chapter: The Sword Demon Emerges\n\n> [Summoning Sword Demon Iyarugt!]\n\nThe skill activated.\n\nA thunderous roar erupted from the blade. Iyarugt convulsed in Grid's grip, spitting crimson light in every direction. The force was staggering. Grid's fingers went numb.\n\n\"Ugh...!\" He tightened his hold. \"You disgraceful bastard!\"\n\nThe sword bucked like a wild animal. Grid's grip failed. Iyarugt tore free and launched itself skyward, spinning end over end. The translucent red of smelted bloodstone darkened, deepening into something blacker than the night sea.\n\n\"Beautiful...\" Euphemina breathed.\n\nThe ancient golden script carved into Iyarugt's blackened surface glowed with otherworldly light. Grid forgot his anger. Even Lauel stopped calculating. Maxong's eyes widened despite himself.\n\nThe blade hung suspended in the air. Its violent trembling ceased. The light dimmed. Silence crashed down like a wave.\n\nGrid held his breath.\n\nTime stretched. Seconds felt like hours.\n\nA crimson bead burst from Iyarugt's core. It pulsed once. Twice. Hell's greatest swordsman. A Sword Demon. The only rival Great Demon Zepar ever acknowledged. The soul of Iyarugt, bearer of countless titles, materialized in the mortal world.\n\n*Hoh... This is great.*\n\nBraham stirred within Grid's consciousness. The ancient mage's interest sharpened into genuine admiration. If even Braham was impressed, this presence was no joke. Grid's anticipation warred with his nerves.\n\nThe red bead expanded. Light radiated outward like scattered starlight, coalescing into something solid. A shape took form.\n\nAn old man. Hunched. Burning.\n\nBlood-colored flames wreathed his body. White hair. Horns jutting from his brow like twin daggers. Muscles corded beneath age-spotted skin. Eyes sharp as broken glass.\n\nHell's greatest swordsman. Iyarugt. Born a lesser demon, he transcended his origins through nothing but the sword. Marbas, one of Hell's major powers, once said of him: *'One who can change the order of the great demons.'*\n\n\"...Sweet.\"\n\nIyarugt inhaled. Three hundred years since his last breath. The air of Siren filled his lungs, crisp and clean. Every cell in his reconstructed body sang.\n\n***\n\n*\"Isn't this unbelievable?\"*\n\nKing Maxong stared. The demon's energy was wrong. Too dense. Too heavy. A hazy warning prickled down his spine.\n\n*Is this the power of a great demon?*\n\nSiren's isolation had its limits. Knowledge of Hell and its hierarchies had filtered in over the centuries. Maxong had studied what he could. The 33 great demons were supposed to be mythical nightmares. This old man matched every description.\n\n*How can a human summon a great demon? Aren't they enemies?*\n\nHis knowledge had gaps. Critical ones. Maxong didn't know the true depth of a great demon's power. He didn't know about contracts between humans and demonkin.\n\n\"Haha...\"\n\nMaxong laughed, but the sound was hollow. His gaze swept across the battlefield. The black cat perched on Grid's shoulder. The small human girl clutching Grid's wrist.\n\n*They're also creatures from Hell...*\n\nThe creatures radiated considerable power. Grid, who possessed beings that should never leave the underworld, was clearly no ordinary human. But Maxong's attention snagged on something else entirely.\n\nA different human male. One of Grid's four summons.\n\n*What is that human?*\n\nConfidence rolled off the man in waves. It matched Maxong's own. Of all four beings Grid had summoned, this naked human unsettled him most. More than the great demon.\n\nThe reason was simple.\n\n\"Why is he naked?\"\n\n\"...\"\n\nGrid had summoned Knight Jude. Who was, indeed, completely nude. Perfect musculature on full display.\n\n\"Kyaaak!\"\n\nEuphemina whipped her head around, face burning. Her wide eyes, however, kept sneaking appreciative glances.\n\n\"Keo...?\"\n\nGrid and Lauel both stared. Neither could produce words. The awkward silence stretched.\n\n\"Why are you naked?\" Grid finally exploded.\n\nJude stood without a hint of shame. \"Jude. After training. Bath.\"\n\nHe'd answered the summons mid-bath.\n\n\"This is absurd.\"\n\nThe game's realism was the problem. Every NPC had emotions. Routines. They bathed daily. This was the result.\n\n\"Why didn't you grab your weapons and armor before answering?\"\n\n\"My Lord. Called. I come.\"\n\n\"That's... inspiring loyalty, I guess.\"\n\nPlayers had inventories. NPCs didn't. The naked Jude standing before them was in a true 'no items' state. A level 300+ knight, reduced to zero combat effectiveness.\n\n*What should I do?*\n\nJude was useless like this. Worse, he was vulnerable. Grid opened his mouth to speak.\n\n\"Demon. Kill.\"\n\n**Crack!**\n\nJude's fist collided with someone's face. Not Maxong. The elderly man wreathed in demonic flames. Sword Demon Iyarugt.\n\nIyarugt's head snapped back.\n\nHell's greatest swordsman, defeated only by Great Demon Zepar himself, had just been punched by a naked human. A naked human he'd assumed was an ally.\n\n\"You are fearless.\"\n\nIyarugt inhaled slowly. Three hundred years of anticipation. The sweet air. The freedom. All of it shattered by a fist to the face. Rage kindled in his ancient eyes. He marked Jude as an enemy.\n\nThe demonic sword Iyarugt trembled. It abandoned Grid's hand and flew to its namesake. The blade slapped into Iyarugt's palm with the sound of a thunderclap.\n\n\"Stop!\" Grid shouted.\n\nThe sword ignored him. Now legendary-rated, Iyarugt had recovered some of its former glory. Its pride wouldn't allow obedience.\n\n**Slash!**\n\n\"Ugh.\"\n\nThe blood-red blade carved across Jude's bare chest. His health gauge plummeted 40%. Grid's stomach dropped.\n\n*What is this damage...?*\n\nJude was naked, but his base stats were monstrous. Strength. Stamina. His natural defense was nothing to scoff at. Yet Iyarugt had dealt devastating damage with a single basic attack. Equivalent to Grid using +9 Failure.\n\n\"Jude. It hurts. Endure. Kill. Demon.\"\n\nJude staggered forward. The wound didn't slow him. He locked onto Iyarugt like a missile seeking its target.\n\nIyarugt blinked. Five hundred years of life. Three hundred years as a soul. He'd never encountered someone this stupid. No. This wasn't stupidity. This was something else entirely.\n\n\"Fearless fool...! Do you have ten lives? Even a hydra couldn't land a hit on me!\"\n\nIyarugt swung again. Grid moved faster.\n\n\"Jude!\"\n\nHis first knight. Handpicked from the ranks. Trained personally. Grid couldn't watch Jude die. Especially not to an ally.\n\nJude froze at Grid's voice. Then his hands blurred. He caught the sword mid-swing, bare palm against sharp edge, and ripped it from Iyarugt's grasp. The perfect chain of *I Have No Idea* passive and Weapon Capture skill.\n\n\"Heok?\"\n\nIyarugt's composure cracked. His attacks had been dodged before. But no one, in all his centuries, had stolen his sword barehanded.\n\nA Sword Demon. Disarmed.\n\n*This guy is actually dangerous!*\n\nGrid closed the distance. \"You aren't enemies. From now on, anyone who attacks an ally will be severely punished.\"\n\n\"Daring to command me...\" Iyarugt's voice was ice.\n\n\"Yes.\" Jude nodded blankly.\n\nWhy had he been fighting the old man? Jude couldn't remember. His intelligence cap was 20.\n\nMaxong had been watching this circus with mounting disbelief. He couldn't contain himself any longer.\n\n\"What are you doing?\"\n\nThe enemies were bickering in front of him. Unforgivable. He'd wanted to strike while they fought each other, but such a cowardly tactic was beneath a king.\n\n\"Daring to ignore this king! Receive your punishment!\"\n\nMaxong activated Water Clan King's Fury. The tsunami surged forward. Iyarugt glared at Jude. Jude did nothing. Euphemina was still distracted by Jude's anatomy. Lauel watched the absurd scene with glazed eyes.\n\n\"First of all, make the loud one shut up.\"\n\n\"Good idea.\"\n\nEveryone turned toward Maxong as one. Ultimate skills activated simultaneously.\n\n**Boom!**\n\nLauel's thunderbolt struck Maxong dead center, interrupting his charge. Euphemina's spell detonated a heartbeat later, tearing into his scales. Lauel, the best of the 10 Rookies. Euphemina, the first epic hidden class. Both overgeared. Together, they were a threat even Maxong couldn't ignore.\n\nBut Maxong was tough. Experienced. He covered his vitals with hardened scales and countered. His first target: the naked human.\n\nSmart battlefield tactics. Eliminate the weakest link first.\n\nWrong judgment.\n\nJude wasn't weak. He possessed the SS-grade unique skill *I Have No Idea*. Why such a high rating? Even Grid didn't know. But high ratings meant definite effects.\n\nJude had no thoughts. Therefore, he had no hesitation. He charged directly into the water column meant to crush him and grabbed Maxong's face with both hands.\n\nJude's strength stat exceeded 2,000. Far beyond any normal soldier. Still not enough to threaten Maxong.\n\nMaxong barely felt the pressure on his skull. Like a fly landing on his cheek. The problem was his vision. Completely blocked.\n\n\"Sublime Sword.\"\n\n**Thunk!**\n\nIyarugt's blade punched through Maxong's chest. Straight through the heart. Maxong convulsed as massive damage registered.\n\n\"It smells good! Nyang!\"\n\nNoe perked up at the fishy scent of Water Clan blood. His jaws opened impossibly wide. He swallowed Maxong whole.\n\nGrid felt the surge instantly. Soul Ingestion flooded him with stolen strength. He and Randy activated Linked Kill in perfect synchronization.\n\n\"Kuaaaack!\"\n\nMaxong's scream echoed across Siren."
}