{
  "id": 479,
  "title": "Chapter 479",
  "content": "Noe's jaw unhinged. Soul Ingestion flared.\n\n> [The memphis Noe has taken away half of Maxong's strength.]\n> \n> [Your strength will increase by 2,511 for 3 seconds!]\n\nGrid's breath caught in his throat. *Over five thousand strength. And if he's throwing both physical and magical attacks... his Intelligence must be just as high.* The numbers were staggering. Terrifying, even. But in that moment, as Grid's muscles surged with stolen power, the fear shifted. Maxong's eyes widened.\n\n\"Blacksmith's Rage.\" Grid's voice was cold. \"Blackening.\"\n\nThe buffs stacked. His body darkened. Then he unleashed Linked Kill with every ounce of amplified strength.\n\n> [Critical!]\n> \n> [The effect of the title 'Death in One Shot!' has been activated, adding 30% critical damage!]\n> \n> [The weak spot has been attacked! Further damage will be dealt!!]\n> \n> [You have dealt 4,230,400 damage to the target.]\n> \n> [Critical!]\n> \n> [The effect of the title 'Death in One Shot!' has been activated, adding 30% critical damage!]\n> \n> [You have dealt 3,500,100 damage to the target.]\n> \n> [You have dealt 1,691,600 damage to the target.]\n> \n> [You have dealt 1,590,400 damage to the target.]\n\nFour strikes. Two crits. Over ten million damage carved through Maxong's defenses.\n\n\"Kuaaaaak!\" The Water Clan King's scream echoed as Randy's own Linked Kill tore into him.\n\nEuphemina tensed. Lauel's hand twitched toward a spell. *Are we killing him?*\n\nGrid didn't flinch. *He'll survive.*\n\nThe pet window showed Iyarugt's Sublime Sword hitting harder than Pinnacle Kill. That technique had only stripped twenty percent of Maxong's health. This combo, for all its massive damage, had carved away ten percent at most.\n\n*Close to a hundred million health. Named NPCs... the gap is insane.*\n\nMaxong was still very much alive.\n\nKwajak!\n\n\"Kyak!\"\n\nA water pillar erupted. Randy took it full in the chest. The stun locked her down. A second pillar followed.\n\n> ['Doppelganger of the Mysterious Forest' Randy has been fatally wounded!]\n> \n> [Randy's transformation has been lifted.]\n\n\"Randy!\" Grid barked her name, but Maxong was already on him. Water sprayed. A scaled shin whipped toward his face.\n\n*Dodge?* \n\nNo. His stolen strength still eclipsed Maxong's. Grid swung back.\n\nChaaeng!\n\nMetal screamed against jade scales. Maxong's face twisted. Pain lanced up his leg.\n\n*My strength. It's weakened. That black creature...* He snarled, mind racing. *What did it steal from me?*\n\nGrid didn't give him time to think. Linked Kill Wave roared to life. *Burn through his health. Now. Before the buff ends.*\n\nKwa kwa kwa kwang!\n\n\"Disgraceful wretch!\" Maxong threw out his hands. Dozens of water droplets materialized. Each the size of a watermelon. They collided with the storm of energy blades.\n\n> [You have suffered 920,330 reflective damage!]\n> \n> [You have suffered 899,100 reflective damage!]\n> \n> [You have suffered 918,555 reflective damage!]\n> \n> [You have suffered 905,700 reflective dam...]\n> \n> ...\n> \n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\n\"Kuaack!\" Grid's health bottomed out. The pain was blinding.\n\n*Reflection. Like Elfin Stone's Blood Field.*\n\n\"Grid!\" Euphemina's shout was distant.\n\n\"My Lord!\" Lauel's voice cracked with panic.\n\nThey saw it now. The water droplets formed an impenetrable wall, each one a landmine of reflected damage. To reach Grid meant death.\n\n*Inducement magic.* Euphemina's mind raced through her skills. *Something. Anything.*\n\n\"Jude. Seek. My Lord.\"\n\nThe naked knight ran. No hesitation. No fear. Pure action.\n\nPepeng!\n\nPepepepeng!\n\nHe crashed through the water droplets barehanded. Each impact detonated against his skin. He didn't care. *Lord's safety. Only that matters.*\n\nLauel's eyes widened. *They're fragile!*\n\nOf course. The reflection was monstrous, but the droplets themselves shattered from a single punch. A fatal blind spot.\n\nPepepepeong!\n\nLauel and Euphemina tore through the barrier with weak attacks. Minimal damage meant minimal reflection. They carved a path, spells building in their hands. Ahead, Jude barreled toward the clash between Grid and Maxong.\n\n\"Jude. Help.\"\n\n\"You idiot!\" Grid's immortal state was a countdown. Five seconds. No death penalty. He'd been planning to go berserk, then swap to the <span class=\"rarity-legendary\">Holy Light Armor</span> and <span class=\"rarity-unique\">Doran's Ring</span> at the last instant.\n\nBut Jude was unarmored. No items. His health and defense were paper. *He'll die.*\n\nGrid lunged forward, putting himself between Maxong and the approaching knight.\n\n\"This one matters to you!\" Maxong's eyes gleamed. The crisis was over. He extended his hand toward Grid's exposed back. A water pillar formed.\n\n> [The duration of immortality is over.]\n\n\"Shit.\" The timing was surgical. Too tight for Assimilation. The God Hands were out of range. Euphemina and Lauel's spells weren't ready.\n\n*I'm dead.*\n\n\"You must live!\" Grid hurled Jude to the ground, covering him with his own body. *At least keep him out of the blast radius.*\n\n\"Bah. I hate humans, but you... you're tolerable.\"\n\nIyarugt's voice cut through the chaos. The old man had been watching. Calculating. *Not betrayal. Analysis. Finding weaknesses.* Grid's death served no purpose. Iyarugt needed his master alive. Zepar wasn't going to kill himself.\n\nPepeng!\n\nThe blade flashed. Maxong's water pillar shattered.\n\n\"Demon!\" Fury twisted Maxong's face. His fist rocketed toward Iyarugt.\n\nThe old man bent backward like a reed. The punch whistled past. Iyarugt stepped in, sword tracing a perfect half-moon. Hell Moon Cut.\n\n\"Keeoook!\" Blood erupted from Maxong's chest. The Water Clan King collapsed to his knees.\n\nTwin spells detonated. Euphemina and Lauel struck in unison.\n\nGrid rose. The God Hands had been busy. A portable furnace blazed before them. Their hammers rang in perfect rhythm. Item Combination.\n\n\"Pagma's Swordsmanship!\"\n\nKakiing.\n\nThe <span class=\"rarity-legendary\">+9 Failure</span> and <span class=\"rarity-unique\">+8 Ideal Longsword</span> fused. A transcendent edge materialized.\n\n\"Kill!\"\n\nPuoook!\n\nThe blade punched through Maxong's ravaged chest.\n\n> [You have won the fight against the king of the water clan, Maxong!]\n> \n> [Maxong has received a great mental shock after being defeated. This is the momentum needed to awaken Maxong's spirit and mind. He will take a step back and look at himself.]\n> \n> [The hidden linked quest 'Water Clan King's Fury' has been cleared!]\n> \n> [The information about Sword Demon Iyarugt has been updated.]\n> \n> [The information about Jude has been updated.]\n\nGrid blinked. New windows flooded his vision.\n\n> **Name:** Iyarugt  \n> **Age:** ?? **Gender:** Male  \n> **Species:** Horned Demon  \n> **Title:** Best Swordsman of Hell  \n> * When sword type weapons are used, the attack power is doubled. There is a 100% chance of a critical strike when hitting a weak point. Evasion rate will increase by 50%.  \n> \n> **Strength:** 3,503 (▼) **Stamina:** 1,090 (▼)  \n> **Agility:** 3,201 (▼) **Intelligence:** 330 (▼)  \n> \n> **Skills:** Swordsman's Eyes (S), One Way of Life (SS-), Sword Dance Explosion (SS), Volcanic Circulation (SS), Hell Moon Cut (SS), Sublime Sword (SS+).  \n> \n> A horned demon classified as a lower demon.  \n> \n> As a result of training in swordsmanship without giving up, he became the strongest swordsman of hell. But he failed to overcome the limit of his birth and was defeated in a battle with the great demon Zepar and died.  \n> \n> After that, his soul was cursed and attached to a sword.  \n> \n> * By winning in a battle against the strong, he can regain a feeling of life. Repeating this a few more times can recover all of his skills (1/10)  \n> * Must win against an opponent who is recognized as an 'enemy.'  \n> * Iyarugt has a strong camaraderie that will develop into liking towards you.\n\n> **Name:** Jude  \n> **Age:** 30 **Gender:** Male  \n> **Race:** Human  \n> **Title:** Grid's Knight  \n> * If he is with Grid, he will only look at Grid.  \n> \n> **Level:** 303  \n> \n> **Strength:** 2,080/2,380 **Stamina:** 908/1,108  \n> **Agility:** 330/430 **Intelligence:** 20/20  \n> \n> **Skills:** Advanced Sword Mastery (A), Snatch the Enemy's Weapon and Use it as a Weapon (S), Silence (A), I have no Idea (SS-).  \n> \n> A rare fool born in Winston. When it comes to strength, he doesn't fall behind anyone. He is a natural warrior who doesn't know fear.  \n> \n> His brain is less evolved, but since becoming Grid's knight, he had steadily grown to become the best warrior.  \n> \n> * His body has exceeded the limit by experiencing a battle with the strong. Maximum strength, stamina and agility has increased (1/20)  \n> * Must win against an opponent who is recognized as an 'enemy.'\n\nGrid stared at Jude's stat window. *One out of twenty. If he keeps fighting bosses, he could become a Named NPC.*\n\nThe thought was tempting. Then the risk hit him. *But he'll die long before that happens.*\n\nHow was he supposed to manage this? Jude was too reckless. Too loyal. Too stupid to know when to retreat.\n\nGrid pulled a blacksmith's outfit from his inventory and tossed it to the naked knight.\n\n\"Thank you.\" Jude caught the clothes.\n\n\"Ah.\" A small sound escaped Euphemina. She felt something. Regret? Disappointment? Her eyes widened at her own reaction. She shook her head sharply."
}