{
  "id": 48,
  "title": "Chapter 48",
  "content": "# Chapter 48\n\nDuplicator. A hidden class that analyzed the skills of others, duplicated them, and used them without restriction. Depending on what skills a Duplicator copied, they could enjoy nearly limitless benefits. Tank. DPS. Support. Healer. The class could become anything.\n\nIn raw versatility, it was the most effective class in all of Satisfy.\n\nCombat was where Duplicators truly shined. With the right skill combination, a single user could solo boss raids, become an unstoppable assassin, or hold off entire armies alone. The class came closer than any other to claiming the title of \"strongest.\"\n\nBut fatal flaws counterbalanced that power.\n\nFirst: only three skills could be duplicated per day. Second: each duplicated skill had a single use. Third: the class came with only nine basic skills, none of them combat-oriented. Fourth: Duplicators possessed the base physical stats of a magician.\n\nTranslation? Euphemina was strongest when she had a full arsenal of copied skills. She was weakest when her reserves ran dry.\n\nRight now, she had nothing left.\n\n\"I'm screwed.\" Euphemina's complexion drained of color.\n\nGrid had ascended to the fourth floor, leaving her alone on the third. She'd cut down hundreds of soldiers during his absence, burning through her skill reserves in exchange. To be precise, she had three fire spells remaining. But she couldn't use them. Fire magic in an enclosed stone dungeon meant one thing: explosion. Collapse. Burial.\n\nFour knights emerged from the stairwell as if they'd been waiting for this exact moment. They fanned out, surrounding her.\n\n*Perfect.*\n\nNo sign of Grid returning. That massive explosion on the fourth floor suggested the worst. Maybe he'd died. Maybe he'd rescued Huroi and escaped the prison entirely, leaving her to rot.\n\nThe knights leveled their swords at her. Euphemina stood motionless, like her soul had already fled her body.\n\n\"You slaughtered five hundred soldiers.\" The lead knight's voice carried a thread of awe. \"Alone. Are you a Great Magician?\"\n\nFortunately, none of them dared attack. They'd witnessed the carnage. Natural fear held them back.\n\nThe standoff didn't last.\n\n\"The only troops left in the castle are the lord's personal bodyguards,\" one knight muttered. \"There's no one blocking the exits. That blacksmith might escape while we're stuck here.\"\n\n\"Is that even possible?\" Another knight scoffed. \"Leo went to the fourth floor. The Northern Nova will have caught him by now. Grid's probably already dead.\"\n\n\"The lord's comfort is at stake.\" The lead knight's jaw tightened. \"We guard against the worst possibilities. Always.\"\n\n\"Right.\" The fourth knight sighed. \"Then let's finish this. I know it's dishonorable, but... four against one.\"\n\nThe knights rushed her simultaneously.\n\nEuphemina's hand moved.\n\n*I can't just stand here.*\n\nShe pulled out a gold dice. The **Rolling Dice** skill, won from Grid during their smithing duel. A last resort.\n\n> **[Rolling Dice]**\n> Roll a dice to trigger a random phenomenon based on the result.\n> \n> * **Targeting yourself or an ally:** 4 or higher creates a beneficial effect. 3 or lower creates a harmful effect.\n> * **Targeting an enemy:** 3 or lower creates a beneficial effect. 4 or higher creates a harmful effect.\n> \n> **Skill Mana Cost:** 1,000  \n> **Skill Cooldown Time:** 3,000 seconds\n\nWhat if the dice made everything worse?\n\n*If it goes badly, I'll use the fire magic.* Euphemina's jaw set. *I'm not dying alone.*\n\nShe glared at the empty stairwell. Still no sign of Grid.\n\n*When I survive this, I'm making him pay. Horribly.*\n\n\"These knights ganging up on a weak...\" A familiar voice echoed from the stairwell. \"No, wait. This woman isn't weak. Still. You're no better than gangsters.\"\n\n\"G...Grid?\" Euphemina's head snapped toward the sound.\n\nGrid stood at the base of the stairs. Huroi limped beside him.\n\n\"Ah...!\" Relief flooded Euphemina's chest. She'd thought Grid was human trash without a shred of loyalty. But he'd actually come back. He'd kept his promise.\n\n*Really pretty.*\n\nGrid's heart pounded. Euphemina's smile bloomed like a flower in full sunlight, radiant and pure.\n\n*Don't be fooled by appearances,* he lectured himself. *Beautiful outside, rotten inside. Calm down, you damn heart.*\n\nThe knights struggled to maintain composure.\n\n\"How are you here?\" One of them stared. \"Leo, the Northern Nova, was killed by the likes of you?\"\n\n\"I don't know who this Northern Nova is.\" Grid's grin was sharp. \"But that young brat called Leo was easy to handle. One. Against. One. I killed him. Huhuhut!\"\n\n\"You...!\"\n\nThe knights' faces twisted with rage. Grid felt no fear. He had insurance.\n\n\"Yes, you're angry. So what?\" Grid spread his hands. \"Do you think any of you can touch me?\"\n\n\"Ugh!\"\n\nThe knights flinched backward. If Grid had destroyed Leo, he wasn't someone to underestimate. They'd been off guard because he looked like trash, but appearance meant nothing.\n\nEuphemina watched the knights retreat in amazement.\n\n*He made them back off with just words...* Her eyes widened. *How high is his level?*\n\nMonsters and NPCs instinctively shrank from opponents thirty or more levels above them. She assumed Grid must vastly outlevel these knights.\n\nGrid kept talking as he advanced. \"Hey. If you don't want to die a dog's death like Leo, get out of the way. This is your only chance.\"\n\n\"This bastard...!\" One knight started forward. His companions grabbed him.\n\n\"Don't fall for provocation.\" The lead knight's voice was tight. \"I know your skills. You can't face him alone. It's a trap.\"\n\n\"Aren't you overreacting?\" The aggressive knight shook them off. \"Think calmly. That bastard's class is blacksmith! Blacksmiths can't be that strong!\"\n\n\"But Leo hasn't returned.\" The lead knight's eyes never left Grid. \"I can't tell if he's acting or not. Either way, he's dangerous.\"\n\n\"Kuoh...!\"\n\nThe knights were tense, overthinking, second-guessing. Grid continued his slow advance. With every step forward, the knights retreated one step back.\n\nHuroi watched in awe.\n\n*Truly amazing.* His eyes gleamed. *Grid's appearance might seem insignificant, but he's actually a tremendous high-level user. The other day I saw him in the smithy and treated him like a comedian. I'm ashamed of my judgment.*\n\nEuphemina. Huroi. The knights. Everyone had completely misunderstood Grid.\n\nMeanwhile, Grid smiled with satisfaction.\n\n*With Euphemina's skills, can't she wipe out these knights anytime?*\n\nThat was Grid's secret. The reason for his confidence. Euphemina could handle all of them. He had no doubts.\n\n*Thump. Thump.*\n\nGrid kept moving. The knights backed toward the stairs leading to the second floor. Anxiety built with every retreating step.\n\nThen they stopped.\n\n*What are we doing?* One knight's shame burned. *We're honorable knights. Why are we scared of an escaped prisoner? This is humiliating.*\n\n*This might harm the lord.* Another knight gripped his sword tighter. *I have to defend this place. For the lord.*\n\n*He isn't a simple blacksmith if he killed Leo.* The third knight's pride flared. *It's a matter of honor now. I won't back up anymore.*\n\n*Leo was alone. There are four of us.* The fourth knight's jaw set. *We can't lose.*\n\nThe knights stopped retreating. Grid stopped as well.\n\n\"What?\" Grid raised an eyebrow. \"You want to fight? Won't you regret this?\"\n\nThe knights raised their swords. \"We will fight! We can't tolerate letting a criminal escape!\"\n\n\"I'm not a criminal, you crazy bastards.\"\n\nReal irritation spiked through Grid's chest. He'd been unfairly framed in the first place. He should have won the prize from the blacksmith competition. Instead, he'd been dragged to prison and made to suffer.\n\nGrid turned and shouted. \"Euphemina! Show these guys! Use your magic!\"\n\nEuphemina made a surprised expression. \"Right now, it's a little... Can't you handle this directly?\"\n\n\"What? It's impossible.\"\n\n\"Stop joking.\" Euphemina frowned. \"Can't you beat them with your skills?\"\n\n\"What are you saying? You should be fighting, not me.\"\n\n\"No. Why are you refusing to fight now?\"\n\nGrid stared at her. \"I can't win against them.\"\n\n\"Don't lie!\" Euphemina's voice rose. \"You defeated the Northern Nova by yourself!\"\n\n\"No, that isn't...\"\n\nThe conversation derailed. Grid and Euphemina's faces gradually stiffened. The knights lost their hesitation and attacked.\n\n\"Dammit!\"\n\nLike teleportation. Knight Rupert activated **Dash** and closed the distance instantly, sword aimed for Grid's throat. Grid was caught completely off guard. The blade would pierce him.\n\nHuroi shoved Grid aside and took the blow.\n\n\"......!\"\n\nEveryone expected Huroi to die. He was already in bad condition, wearing no armor. An unarmed orator against a knight's sword.\n\nThen something strange happened.\n\n\"What is this...? Urghh!\" Rupert gasped.\n\nHis sword, which should have pierced Huroi's abdomen, stopped. Like stabbing steel. Rupert's wrist broke. Huroi stood unharmed.\n\nThe attacker was injured. The victim was fine.\n\n\"What is with that guy?\" Euphemina asked in confusion. \"Why can't the knight's sword pierce him?\"\n\nGrid shook his head. \"I don't know.\"\n\n\"Why are you answering so uncertainly?\" Euphemina glared. \"Why are you running around to save someone you don't even know? Stop joking and tell me the truth!\"\n\n\"No, I really don't know.\"\n\nHigh-level martial artists possessed a defense skill called **Impenetrable Skin**. But even that couldn't block a knight's sword with bare flesh. Huroi clearly had some defensive ability beyond ordinary skills.\n\nHuroi spoke into the silence. \"I'll tie up their feet. You two should use this gap to escape.\"\n\nThe reason Huroi could block the knight's attack with his body came from a title skill: **One who Overcomes Hardships**.\n\n> **[Strong Will]**  \n> Resist any attack for 10 seconds after activation.  \n> **Skill Mana Cost:** 200  \n> **Skill Cooldown Time:** 9,000 seconds\n\nA 2.5-hour cooldown. But the performance was priceless. A skill acquired after enduring and overcoming a hellish trial. Grid had saved him from that hell. Huroi had already vowed to repay this debt for the rest of his life.\n\nHe would sacrifice himself for Grid. Buy time for Grid to escape safely.\n\n\"Huroi...\" An ordinary person would hesitate to abandon a companion.\n\nBut Grid simply said, \"Buy as much time as possible.\"\n\n\"See you next time.\" Euphemina waved.\n\nNeither of them were emotional people. They immediately fled. Huroi remained alone.\n\n\"This...!\"\n\nThe knights tried to chase. Huroi blocked the stairwell. His expression hardened with determination to protect Grid.\n\n\"I have no intention of letting you leave, you #*&!($#@.\" Huroi's mouth opened. \"This damn [email protected]$#.\"\n\n\"......?\"\n\nWords that couldn't be repeated in polite company poured from the orator's mouth. The knights suffered profound psychological damage. Huroi's abuse exceeded anything they'd ever heard.\n\nThis was **Spiteful Tongue**. Huroi attacked while the knights reeled, their stats debuffed and their minds confused.\n\n\"**Unbreakable Justice!**\"\n\nOne of two skills from his second class, **Apostle of Justice's Partner**. His ultimate attack skill, dealing **320%** of his attack power.\n\n*Peeeong!*\n\nHuroi's fist struck Rupert's face. The shockwave reached the knights standing nearby. A massive impact echoed through the underground prison. The knights screamed reflexively.\n\n\"Kkack!\"\n\nBut it was only reflex.\n\n\"...Huh?\" The knights blinked.\n\nThey felt no pain. A natural result. An orator possessed poor physical stats. Huroi currently wore no weapon. A **320%** increase to an orator's damage still wasn't enough to harm armored knights. The gap was too wide.\n\nHuroi accepted it calmly. \"As expected. This skill is useless to the current me.\"\n\n\"......\"\n\nIt took only minutes for the knights to capture Huroi and lock him in solitary confinement again.\n\nHuroi didn't care. He hadn't been able to log out for fifty real-time hours. Exhaustion weighed on his bones. He wanted to log out. Rest.\n\nThe quest was cleared. No penalty for logging out.\n\n*Based on this situation, it'll be over for Winston's lord soon.* Huroi closed his eyes. *I can escape from prison after I get some sleep and log back in.*\n\n*Grid, I wish you good fortune.*\n\nHuroi logged out.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing the day's chapters."
}