{
  "id": 480,
  "title": "Chapter 480",
  "content": "During the unexpected battle between Grid's party and Maxong, the Blood Carnival members outside the palace had been annihilated. The water clan and Overgeared had worked together to ensure total victory.\n\nJishuka crouched over a pile of gear, sorting through the spoils. \"Plenty of high-value equipment here. Look at these PvP modifiers. You don't find these easily.\"\n\nZednos examined a bracer. \"Makes sense. They specialized in player-killing. Though most of it has level requirements too low for us.\"\n\n\"The Silver Knights are still in the 200s, aren't they?\" Pon hefted a bloodstained spear. \"Sell it to them at a discount.\"\n\nFaker materialized from a shadow. \"Show Grid first. He might extract production methods.\"\n\n\"Obviously.\" Jishuka nodded.\n\nThe Blood Carnival members had accumulated massive infamy over their careers. That translated to mountains of dropped loot. Most was trash, but several pieces shone with genuine quality.\n\nFootsteps splashed through puddles of seawater. 1st Prince Paong and 3rd Prince Gulong approached, their faces wet with more than the ocean's spray.\n\nPaong dropped to his knees. \"Thank you. Truly, thank you.\"\n\nGulong's voice cracked. \"You saved our kingdom. Our people. Children, parents, lovers, the elderly. All of them live because of you.\" His head touched the ground. \"Thank you.\"\n\nThe princes prostrated themselves repeatedly, tears streaming down their scaled cheeks. Around them, reunions unfolded across the palace courtyard. Children sobbed in their parents' arms. Lovers embraced desperately. The elderly wept that they hadn't died instead of the young. Those who found no one stood alone, hollow-eyed.\n\nPaong raised his head. \"Our water clan will repay this debt.\"\n\n\"We swear it on our honor as princes,\" Gulong added.\n\nThe Overgeared members watched the survivors with complicated expressions. Pride warred with grief. They had saved many, but not all. The weight of those lost lives hung heavy.\n\nKatz clicked his tongue.\n\n*Just dead NPCs.*\n\nHe wasn't being cruel. Most players shared his view. NPCs were algorithms wearing human faces. They bled and wept and screamed, but they weren't real. Feeling genuine empathy for them was rare.\n\nThe Overgeared members were different. Grid's influence ran deep through the guild. Whether that was strength or weakness remained unclear.\n\n\"Come to the palace!\" Paong gestured enthusiastically. \"A grand banquet awaits you!\"\n\n\"Your lord must be speaking with our father by now.\" Gulong smiled. \"Let's join them.\"\n\nThe princes led them toward the palace. Jishuka took point. Piaro and Asmophel flanked her, alert despite the friendly atmosphere.\n\nThey stopped at the palace entrance.\n\nRubble littered the courtyard. Scorch marks blackened the walls. At the center of the devastation lay King Maxong, collapsed in a pool of his own blood. The signs of brutal combat were unmistakable.\n\n\"Your Majesty!\" Paong sprinted forward.\n\n\"Father!\" Gulong's cry was raw with horror.\n\nThe princes skidded to their knees beside Maxong, supporting his battered body. They turned on Grid's party, eyes burning with betrayal.\n\n\"You monsters!\" Paong's voice shook. \"You pretended to help while plotting against His Majesty!\"\n\n\"We trusted you!\" Gulong's fists clenched. \"I thanked you with my whole heart!\"\n\nThe Overgeared members stood frozen. Confusion rippled through their ranks. None of them understood what had happened here.\n\nJishuka stepped forward. \"What's going on?\"\n\nGrid opened his mouth to explain.\n\nMaxong spoke first.\n\n\"I'm fine.\"\n\nThe king pushed his sons' hands away and knelt before Grid. The Water Clan's ruler prostrated himself before a human. In front of his subjects. In front of everyone.\n\nChaos erupted. The princes stared in shock. Soldiers murmured frantically. The Overgeared members exchanged bewildered glances. The noise swelled into a roar.\n\nGrid remained silent. He met Maxong's gaze and waited.\n\nMaxong bowed until his forehead touched the ground. \"Human. During our battle, I realized why you were angry. You sacrificed yourself for a single companion. You cannot accept a king who is arrogant and neglects his people.\"\n\nThe words hung in the air.\n\n\"You're right. I'm not qualified to be king.\" Maxong's voice carried across the courtyard. \"A king should cherish his people as children. I failed them.\"\n\nHe had used his daughter's death as an excuse. He had turned away from those who needed him most. Looking back now, the truth was inescapable. He was the worst kind of ruler. Shame for his people mixed with guilt toward his sons.\n\n\"My daughter, who sleeps in the deep abyss, would weep to see such a pathetic father.\" Maxong looked up at Grid with something approaching reverence. \"Despite being human, you command creatures and demons. You value one life more than your own. That is the mark of a true king.\"\n\nPower resonated in the king's voice. Each word sent mana rippling outward in blue waves.\n\nThe waves wrapped around Grid like silk. His racing heart steadied. The tension in his muscles unwound.\n\n\"I feel deep respect for you.\" Maxong's tone was formal, ceremonial. \"I hope my sons will observe and learn from you. That they'll become good kings, unlike their foolish father. I hope Siren, which has stagnated and proven helpless, will develop and grow strong.\"\n\nA wish. A prayer.\n\n\"Teach and guide Siren's royal family. We will follow you truly.\"\n\nThe Overgeared members shivered as one. Piaro and Asmophel stood rigid with shock. The king of another species had pledged allegiance to their lord. The magnitude of that honor struck them like a physical blow.\n\nGrid struggled to control his expression. He took several deep breaths. Then he reached down and raised Maxong to his feet. He extended his hand.\n\n\"A king should never feel ashamed.\"\n\nThe words weren't just for Maxong. Everyone gathered here believed in Grid. The Overgeared members. Piaro. Asmophel. Jude. Even Noe and Randy. They had all sworn to follow him.\n\n*I won't disappoint them. I won't waste their faith.*\n\nThe foundation had been laid on a desire for recognition, not glory. The selfish but honest Grid's path to kingship had begun.\n\n***\n\n> [The Overgeared Guild has concluded an alliance treaty with Siren of the Water Clan Kingdom.]\n\n> [The Overgeared Guild and Siren will interact in all areas including military, literature, magic, commerce, and religion.]\n\n> [Over the next two years, the Overgeared Guild will support Siren by giving 100,000 gold per month for development. After two years, the Overgeared Guild will receive 20% of Siren's monthly proceeds.]\n\n> [The Overgeared Guild has the right to assemble soldiers in Siren at any time for defense. Siren's army movements require Master Grid's permission.]\n\n> [If Grid acquires the status of king, Siren will be incorporated into his territory. Until then, Siren will not betray Grid.]\n\nLauel's treaty reached all Overgeared members scattered across the continent. Reidan. Winston. Bairan. Cork Island. Nearly three hundred members received the notification simultaneously.\n\nMorale erupted.\n\n\"This isn't an alliance. Grid basically owns Siren outright.\" A former Silver Knights member laughed in disbelief.\n\n\"Our forces just expanded exponentially.\" Another player punched the air. \"God Grid is incredible.\"\n\n\"Joining Overgeared was the best decision we ever made!\"\n\nThe so-called Seven Guilds each controlled one territory. Most of the thousands of guilds in Satisfy controlled nothing. Overgeared? Three territories already, plus Winston through Irene. Now an entire kingdom of a different species had submitted.\n\nBeyond that, they maintained a full alliance with Earl Steim, one of the Eternal Kingdom's greatest nobles. Two years after formation, Overgeared had achieved growth that qualified them as the continent's premier guild.\n\nFormer Silver Knights members marveled at Grid's political acumen.\n\n\"He married Irene and became the best family's son-in-law.\"\n\n\"He absorbed the Tzedakah Guild whole.\"\n\n\"He developed his estate by recruiting talented individuals.\"\n\n\"Now the Water Clan Kingdom.\"\n\nGod Grid. South Korea's pride. They analyzed and praised him endlessly. Across the continent, Overgeared members danced and celebrated.\n\nPlayers who witnessed the revelry spread rumors that \"the crazy people in Overgeared are multiplying.\"\n\nBlood Carnival members heard those rumors and shuddered.\n\n\"More crazy people?\"\n\n\"There are already too many crazy ones.\"\n\n\"Better to avoid Overgeared entirely.\"\n\nBlood Warrior Katz. Beast Man Toon. Bald Vantner. The foul-mouthed Huroi. The Blood Carnival members trembled remembering the unhinged Overgeared crew. Even villains had their limits.\n\nNot all Blood Carnival members cowered, though. The White and Black sisters burned with determination.\n\n\"The result would've been different if we'd fought together!\" White slammed her fist on the table.\n\n\"Give us a chance for revenge!\" Black leaned forward. \"Lend us your strength.\"\n\nThey petitioned the Blood Carnival master.\n\nHe rejected them flatly.\n\n\"We were partners for mutual benefit. Nothing more. Charity isn't our business model.\"\n\n\"We'll pay!\" White's voice rose. \"Name your price. Just ask for volunteers to raid Reidan!\"\n\n\"Have you forgotten our absolute rule?\" The master's tone was cold. \"We don't accept contracts with low success rates.\"\n\n\"Damn it!\"\n\nThe master made his judgment.\n\n*Not yet.*\n\nGrowth wasn't infinite. Everything had limits. Overgeared was surging now, but stagnation would come. The legendary farmer who seemed invincible now would eventually become ordinary.\n\n*Piaro. I need to find and recruit named NPCs comparable to him.*\n\nFor his own sake.\n\n***\n\nPiaro stood on Siren's sandy shore. \"I would like to farm here.\"\n\nLauel blinked. \"What crop grows where the ground is sand instead of soil? Farming here is impossible.\"\n\n\"No.\" Piaro's voice was absolute. \"Farming is the source of everything. There are no limits to farming. I will prove it. I'll raise crops that can only grow in Siren and strengthen my lord's position. Please grant me permission.\"\n\nGrid knew Piaro's stubbornness better than anyone. He also had absolute faith in the man. Piaro was a legend, closer to being a complete legend than Grid himself. In his field, nothing was impossible.\n\n\"I look forward to it.\"\n\n\"My Lord!\" Lauel turned to Grid urgently. \"If Piaro leaves, who will guard Reidan?\"\n\nPiaro's power was irreplaceable. Without him, Lauel would have to overhaul their defensive strategy. The workload would multiply exponentially. Grid heard Lauel's protest and looked at Asmophel.\n\n\"Our soldiers will fill Piaro's empty seat.\"\n\nAsmophel flinched.\n\nHe didn't understand jokes. He took everything literally. Grid had meant to praise him as Piaro's substitute, but Asmophel only heard one word.\n\n*Soldier.*\n\n*My lord only trusts me at the level of a common soldier!*\n\nIf that was the case, then...\n\n*I'll start from the beginning!*\n\nHe would truly become a soldier.\n\n*I'll build my skills from the ground up!*\n\nAsmophel's **Determination of the Number Two** skill activated successfully. The moment that would later shock the world had arrived.\n\nThe legend of a soldier was born."
}