{
  "id": 481,
  "title": "Chapter 481",
  "content": "\"May the sea god protect you.\"\n\nMaxong stood at the palace gates as Grid and the Overgeared members departed. Behind him, the princes formed a silent line. Hundreds of soldiers filled the courtyard, their spears held vertical in salute. Their king had nearly died, and the weight of that failure hung heavy in their rigid postures.\n\nGrid glanced back at the scene.\n\n*Who the hell is Maxong?* The question gnawed at him. *A man who turned away while his kingdom burned. While his people died.* \n\nThe water clan soldiers maintained their formation, unwavering. Absolute loyalty etched in every expressionless face.\n\n*He doesn't deserve this.* Grid's jaw tightened. *They worship him just because he wears a crown? Even after he abandoned them?*\n\nThe water clan's passivity suddenly made sense. It wasn't culture. It was stupidity.\n\n\"But it's good from the position of a ruler.\" Lauel materialized at Grid's elbow. His voice was barely a murmur. \"The more loyal and stupid the people are, the more beneficial it is to the king. It's really lucky that we obtained Siren.\"\n\nGrid said nothing.\n\nLauel's words carried the cold logic of a tactician. Some would call it cruel. Grid didn't. He understood greed. He understood pragmatism. But cleverness whispered a different truth.\n\n\"Isn't it better in the long run if the people are smarter?\" Grid kept his eyes forward. \"A strong kingdom fills the king's stomach better than a weak one.\"\n\nRuling intelligent subjects would be exhausting. No question. But nothing worth doing was easy.\n\n\"Haha!\" Lauel's laugh cracked the tension. Not mockery. Genuine amusement. \"That's correct. In fact, I think the same as you.\"\n\n*He's testing me.* Grid realized.\n\nLauel studied Grid's profile with renewed interest. The man beside him wasn't the same pushover who'd stumbled into Winston months ago. That Grid would have taken the easy answer. Chosen the path of least resistance.\n\n*When did he grow up?* Lauel felt something like pride. *Forget Kraugel. We don't need him.*\n\nThe Overgeared Guild had its own monster.\n\n\"My Lord.\"\n\nPiaro's approach cut through Lauel's thoughts. The former Red Knight dropped to one knee, fist pressed to chest.\n\n\"My body might be far away from My Lord, but don't forget that my heart is always with you.\" His voice carried the weight of an oath. \"Please call me whenever you need me. I will run over right away, no matter when or where I am.\"\n\n\"Understood.\" Grid's hand found Piaro's shoulder. \"Please look after Siren.\"\n\n\"Yes.\" Piaro reached into his coat. \"And this...\"\n\nBlack fabric emerged from his inventory. Tights. The kind that stretched from waist to ankle, form-fitting and sleek. Assassin's gear. Or martial artists'. Maybe archers'.\n\nGrid stared at the garment. \"This?\"\n\n\"Loot from White's corpse.\"\n\n*White.* The name hit like a hammer. Sun-grade. Kraugel's equal, according to Lauel. The woman had been a nightmare, and only Piaro's instant-kill technique had saved them from a prolonged bloodbath.\n\n*What kind of item does someone like that drop?*\n\nGrid's pulse quickened. He pulled up the interface.\n\n*Legendary Blacksmith's Appraisal.*\n\n> [System Notice]  \n> The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.\n\n> [System Notice]  \n> You cannot fully understand the features.\n\nThe item window bloomed into view:\n\n---\n\n<span class=\"rarity-legendary\">**Kruger's Pants**</span>\n\n**Rating:** Legendary (Set)  \n**Durability:** Infinite  \n**Defense:** 430\n\n**Effects:**\n* Reduces damage received by 40%.\n* Agility +10%\n* Jumping ability +40%\n* All lower body skills +20%\n* **Set Effect:** ???\n\n*A masterpiece made by the legendary tailor Kruger. It boasts an infinite stretch and will never tear.*\n\n**Conditions of Use:** None  \n**Weight:** 350\n\n---\n\n\"Heok.\"\n\nThe numbers stole Grid's breath. Not damage reduction by type. Not \"physical\" or \"cutting\" or \"magic.\" Just *damage*. Forty percent. Universal. Unconditional.\n\n*And infinite durability...*\n\nHis Appraisal skill couldn't identify the material. That, combined with Kruger's name attached to it, pointed to one conclusion.\n\n*Fabric on par with pavranium.* A miracle substance woven by a legend.\n\n*This is insane.*\n\nBut useless to him.\n\nThe defense stat was garbage compared to his heavy plate. Grid's combat style relied on face-tanking, on turning himself into an immovable wall. These tights would shatter that foundation.\n\n*Kraugel could make this work.* The thought tasted bitter. *But I can't.*\n\nThree faces surfaced in his mind. Jishuka. Faker. Regas.\n\n*Which one do I sell it to?*\n\nAn auction would spark a bidding war. That would breed resentment. Jealousy. The kind of poison that could fracture a guild.\n\n*I can't let that happen.*\n\nSo personal sale it was. But to whom?\n\nJishuka. The world's most beautiful woman, who might actually like him back. Faker. Silent, loyal, the invisible shield that protected them all. Regas. The good-hearted friend who'd believed in Grid from day one.\n\n\"Shit.\"\n\nAll three were invaluable. Choosing favorites felt wrong.\n\n*This isn't how a leader thinks.* Grid forced sentiment aside. *Efficiency matters more than feelings.*\n\nHe ran the analysis.\n\n*Jishuka's out.* Not because of modesty. Because archers had one lower body skill. One. A dashing kick. The 20% bonus would be wasted. Regas and Faker, by contrast, built their entire fighting styles around leg-based techniques.\n\n*Between those two...*\n\nRegas needed to take damage. His Fighting Spirit gauge filled in proportion to hits received. Too much defense would cripple his resource generation.\n\nFaker, though. An assassin. Agility-scaling damage. A playstyle predicated on *not* getting hit. High defense as insurance, not hindrance. And that jump bonus would make him untouchable.\n\n*Faker gets it.*\n\nDecision made.\n\nEuphemina's spell reached completion.\n\n\"Mass Teleport!\"\n\nWhite light swallowed the world.\n\n**Pak!**\n\n**Pa pa pa pa pak!**\n\nReality reassembled itself. Reidan's familiar sandstone walls materialized around them. The entire Overgeared party stood in the courtyard. Euphemina beside them. Her contract was fulfilled. Maxong's tears secured. No reason to stay in Siren.\n\n\"Ah...\"\n\nBack in the water kingdom, Piaro stood alone in the empty palace. His eyes widened.\n\n*Hurent.* The Aura Master. Still in Reidan.\n\n\"Well...\" Piaro's shoulders sagged. \"He isn't a kid, so he will behave well.\"\n\n***\n\n\"Dear husband!\"\n\nIrene's voice rang through the castle entrance.\n\nGrid's mental checklist was brutal. Appraise every item from Siren for hidden features. Learn production methods. Design new gear with the adamantium from the National Competition. Establish dominance over Iyarugt. Grind experience before South Korea's buff expired.\n\nNo time. Too much to do.\n\nBut family came first.\n\nHe crossed the hall to meet Irene.\n\n\"I'm glad you weren't too lonely. Lord kept you company.\"\n\nIrene's expression soured. She pressed herself into Grid's embrace, but her tone carried an edge.\n\n\"Lord is Lord. You are you.\" Her fingers curled into his shirt. \"Both of you are equally important. I'm happy just seeing Lord, but with you, dear husband...\"\n\nHer pale cheeks flushed crimson.\n\n\"That... That...\"\n\nThe words died on her tongue. Her blue eyes darted everywhere except Grid's face.\n\n*She's thinking something shameful.* Grid felt a smile tugging at his lips.\n\nThe diamond class capsule's true potential was about to be realized.\n\n\"It would be nice to have a second child.\" Grid scooped Irene into his arms. Confidence radiated from every movement.\n\n\"Kyaaak~\"\n\nShe buried her face in his chest. The picture of innocence. A shy bride.\n\nThat facade lasted until the bedroom door closed.\n\nWhat happened after required no narration.\n\n***\n\nEuphemina stared at the spellbook in her hands.\n\nDuplicator. A class with brutal limitations. She couldn't choose which skills to copy. Copied skills vanished after one use. Her combat endurance was pathetic.\n\n*If I could just learn magic normally.* The familiar resentment surfaced. *Anything to break past this ceiling.*\n\nBut that was yesterday's frustration.\n\nMumud's Spellbook changed everything."
}