{
  "id": 482,
  "title": "Chapter 482",
  "content": "Faker examined the item window Grid had opened before him. His eyes tracked across the stats of Kruger's Pants. He closed the window.\n\n\"I don't want it.\"\n\nGrid's mouth fell open. \"Why? Why don't you want this? I thought you would be jumping with joy.\"\n\n\"It's too good.\" Faker's voice was quiet. Measured. \"Grid, you tend to give too much to us.\"\n\nGrid's brow furrowed. *What the hell is he talking about?*\n\n\"How many of the two billion users can wear items made by a legendary blacksmith?\" Faker continued. \"It's only the Overgeared Guild. We're always thankful to you, and that's why I want to return the favor. I can't keep demanding things from you.\"\n\nGrid's jaw tightened. \"What are you saying? When have I ever made free items for you? You're a customer who buys items from me for a reasonable price. I'm not doing you favors.\"\n\nHe gestured sharply, cutting through the air between them. The Overgeared members provided the necessary materials and methods. Grid learned production techniques for free. He earned money by selling the finished products to his colleagues. Anyone with half a brain could see that Grid benefited.\n\n\"Thanks to your steady commissions, I was able to produce more items and build up my skills. I even make money while doing it.\" Grid's voice rose. \"This time as well. I'm selling this to you, not giving it for free. Isn't it a reasonable price?\"\n\nFaker shook his head. \"You don't know your own value.\"\n\nThe words hung in the air.\n\n\"There are many rich people in the world,\" Faker said. \"The items made by Grid are more expensive than the Overgeared members can afford, but the wealthy would be willing to buy them. Yet they never get a chance. You're so busy that you barely have enough time to produce items for the Overgeared members. You're pouring all the opportunity costs into us.\"\n\nHis expression was somber. \"Faker and the others always felt sorry.\"\n\n\"In fact, you can earn a much larger amount of money. But you're tied to the guild...\"\n\n\"Bullshit.\" Grid's face darkened. He stepped forward. \"Tied to the guild? It's nonsense. I'm the one who made Overgeared. I'm thankful that you accepted my invitation.\"\n\n\"Aren't we seeing greater benefits as a result?\" Faker pressed. \"So I won't buy the pants. You should use it.\"\n\n*At the very least, don't concede such a good item.*\n\nGrid's shoulders lifted and dropped. \"I know what you mean, but the options of the tights will have no effect on me.\"\n\nRise in agility. Rise in jumping ability. Increase the power of lower body skills. The effects came from the tights being light and comfortable. Overlapping them with heavy armor would cause the effects to disappear. Satisfy pursued realism in these mechanics. It increased immersion, but it was tiring.\n\n\"However, isn't the defense applied?\" Faker asked.\n\n\"No, dammit. It's too tight.\" Grid grimaced. \"Cutting my blood off just for a bit more defense? In the first place, I can simply make something layered that only increases defense.\"\n\nThe layered defense effect used in Triple Layers was just as good.\n\nSilence stretched between them.\n\n\"Don't be stubborn,\" Grid said. His voice softened. \"And don't forget. The favors I'm doing all of you are because of Overgeared. The thing you can do for me is become stronger. Don't give me something useless.\"\n\nFaker's lips curved upward. It was a rare smile. His mixed Eastern and Western features seemed to glow with an inner light.\n\n*Really handsome.*\n\nGrid's thoughts soured. Why were all the Overgeared members so handsome? Honestly, Grid was too shabby compared to them. What if they immigrated to South Korea and went out every day? He was glad to have them as friends. But he could also feel depressed.\n\n*I should recruit new guild members that are uglier than me. Yes, they should be like Uncle Vantner.*\n\nGrid had no idea how attractive his masculine looks actually were. He was spiraling into distress when Faker spoke hesitantly.\n\n\"That... Can I pay by installments?\"\n\nGrid blinked.\n\nKruger's Pants were worth around 6 billion gold. Burdensome to pay all at once. Grid exhaled through his nose. \"I understand. But just so you know, I'm not selling it at an expensive price. There are no conditions of use, so I can sell it to much wealthier people.\"\n\n\"I'm well aware.\"\n\nIn fact, it wasn't cheap. Faker felt gratitude again that Grid didn't require interest on the installment payments.\n\n*I will become stronger in order to repay the favor.*\n\nIt didn't matter who the opponent was. He wouldn't allow even Kraugel to threaten Grid and the Overgeared Guild. Daring to go against Kraugel? Somebody might laugh and call it arrogance. But Grid and the Overgeared members knew Faker's true value.\n\nIn the darkness, his power was equal to or greater than Grid's. If Euphemina was the hidden gem of Overgeared, Faker was the invisible pillar supporting it. In order to be faithful to his role, Faker was obliged to be stronger than anyone else.\n\n***\n\nEuphemina's room faced Grid's bedroom. After returning from unburdening her heart with her colleagues, her expression had turned serious. She stared at the ancient tome in her hands.\n\n> [Mumud's Spellbook]\n> \n> Rating: ??\n> \n> The old spellbook containing the magic of the genius magician Mumud.\n> \n> Usage Effects: ??\n> \n> Conditions of Use: ??\n> \n> Weight: 10\n\n*The rating is unknown.*\n\nShe turned the book over in her hands. Spellbooks typically followed the rating of the magic they contained. A spellbook containing A-grade magic Fire Storm was rated A. Spellbooks were divided from D to S ranks. Then what about an unknown rating?\n\n*Is it not acquiring a single magic?*\n\nPerhaps there were multiple spells with different ratings, making the rating of the spellbook unknown.\n\n*In any case, this is a spellbook that teaches magic.*\n\nThen there was a problem. Euphemina wasn't a magician. She could copy magic, but she had no talent to learn it.\n\n*The spellbook might explode.*\n\nIn fact, Euphemina wanted to sell this to Zednos or Laella. She judged that it was more stable in many ways. But Grid had stopped that idea. The spellbook couldn't be judged using the Legendary Blacksmith's Appraisal. Grid guessed that the spellbook had more value than a legendary class change book.\n\nHis words echoed in her memory. \"Braham said this. Mumud was even more of a genius than him, making Braham feel afraid and wary. In other words, he had talent beyond a legendary magician. What if you sell the spellbook and then find out its real value afterwards? You might regret it too much. Don't play the game cautiously and just try it out. You might be worried that the spellbook will disappear without an effect, but you will regret it less than giving it to others.\"\n\n*Grid is right.*\n\nEuphemina was one of the few people in Overgeared who didn't know Grid's nature. She misunderstood Grid as a great figure even when he was a dunce. For Euphemina, Grid was a target of envy. This was why she engraved his advice in her heart.\n\n\"Yes, I must learn it.\"\n\nShe didn't delay. Euphemina opened Mumud's Spellbook.\n\n> [Mumud's Spellbook has been read.]\n> \n> [Mumud's magical knowledge is flowing into your brain.]\n> \n> [Your intelligence stat is less than 5,000. You are unable to accept the new knowledge. Failed to acquire the knowledge...]\n\nHer breath caught. The words blurred before her eyes.\n\n> [You are under the title effect of 'Defender of Siren.' Mumud's knowledge favors you. The knowledge is reorganized to make it easier to understand.]\n> \n> [You have completed the acquisition of new knowledge.]\n> \n> [Mumud's Magic Tree has opened.]\n> \n> [Your constitution isn't suitable to acquire Mumud's fire attribute magic.]\n> \n> [Your constitution isn't suitable to acquire Mumud's wood attribute magic.]\n> \n> [Your constitution isn't suitable to acquire Mumud's earth attribute magic.]\n> \n> [You have learned Mumud's water attribute magic.]\n> \n> [You have learned Mumud's no attribute magic.]\n\n> **[Mumud's Water Attribute Magic]**\n> \n> Rating: <span class=\"rarity-legendary\">Legendary (Growth)</span>\n> \n> Stage 1: You can turn magic power into water and ice, which you can use for your own purposes. Casting time and cooldown time will differ depending on the form of magic. Research will be needed in order for it to be used more efficiently.\n\n> **[Mumud's No Attribute Magic]**\n> \n> Rating: <span class=\"rarity-legendary\">Legendary (Growth)</span>\n> \n> Stage 1: The 'Ignore 30% of magic defense' effect will be applied to your magic power.\n\n> [The hidden quest 'Mumud's Soul Liberation' has been created.]\n\n> **[Mumud's Soul Liberation]**\n> \n> ★ Hidden Quest ★\n> \n> During his life.\n> \n> As a disciple of the legendary great magician Braham, Mumud excelled as a genius. But genius is short-lived. His heart had been weak since he was born and he would die before he turned 30. He didn't reveal his illness to anyone and devoted himself to researching and creating a magic system that anyone could easily use. It was his achievement as a magician. This allowed Mumud to feel satisfied with his life.\n> \n> It might be a short life, but he was happy and felt fulfilled at contributing to the development of the world. He could humbly accept death. But it was only for a moment. His achievement was taken away by his master Braham, causing him great shock. Mumud burned with anger and vowed to get revenge on Braham. He would create a new magic formula that transcended Braham, leading him to Siren to obtain a powerful orb.\n> \n> However, he didn't carry out his revenge. His life was too short. He would rather spend it on happiness instead of revenge. He fell in love with a water clan woman he met in Siren and happily closed his eyes.\n> \n> But he is suffering even after death. His body was taken away by Baal's Contractor and used to commit acts of slaughter that goes against his soul's will.\n> \n> You have saved the Siren that Mumud loved and know Mumud's story. Use this newly obtained strength to release Mumud's crying soul.\n> \n> Quest Clear Conditions: Destroy Mumud's lich that is in the hands of Baal's Contractor '????' and liberate the soul.\n> \n> Quest Success Reward: The growth type legendary class 'Mumud's Descendant' will be acquired. All of Mumud's magic will be opened.\n> \n> Quest Failure Condition: None.\n\n\"W-What is this?\"\n\nEuphemina's voice came out strangled. Her hands trembled around the spellbook. The value of Mumud's Spellbook far exceeded her imagination. She had suffered for a long time in Siren for Grid and Overgeared. Now she was rewarded with new wings. An opportunity to be extraordinary.\n\nThe power of Overgeared had greatly increased."
}