{
  "id": 483,
  "title": "Chapter 483",
  "content": "\"Grid!\"\n\nHe looked up from the anvil. Euphemina stood in the doorway of Khan's smithy, breathless.\n\n\"What's wrong?\"\n\nA thought flickered through his mind. *Did Mumud's Spellbook work?* But Grid killed the hope before it could take root. Disappointment was worse than low expectations. He'd learned that lesson the hard way.\n\nEuphemina crossed the distance between them in three strides and threw her arms around his chest.\n\nGrid froze. \"H-Hey. What are you doing?\"\n\nMarriage hadn't made him comfortable with women. Irene was different. Irene was his wife. But this? He grabbed Euphemina's shoulders and pushed her back. She clung tighter.\n\n\"Thank you.\" Her voice cracked. \"Thank you so much.\"\n\nThe tension bled out of his shoulders. \"...Ah.\"\n\nShe was crying. Grid let his hand settle on her blonde hair, awkward but genuine. \"You don't need to thank me. Congratulations.\"\n\nEuphemina leaned into the touch. His hand was large and warm. Solid. Like the brother she'd never had.\n\n\"Heok?\"\n\nGrid's spine went rigid. Lord stood in the doorway, watching them with wide, curious eyes.\n\n\"S-Since when have you been standing there?\"\n\n*This looks bad. This looks really bad.*\n\nLord tilted his head. \"I saw Father hug the pretty sister.\"\n\n\"I didn't hug her!\" Grid's voice pitched too high. He shoved Euphemina away and crossed to Lord in two steps, dropping to one knee. He leaned in close. \"D-Don't tell your mother about this.\"\n\nLord's face split into a brilliant smile. \"The beautiful sister is Father's lover!\"\n\n\"What? No. No, that's not—\"\n\n*Oh god. He's going to tell Irene I'm cheating. She'll kill me. She'll actually kill me.*\n\nEuphemina crouched beside them. \"Lord, listen. This sister isn't your father's lover. I'm your—\"\n\n\"First lover? Second lover?\" Lord's eyes shone. \"Father is so cool!\"\n\n\"Cool?\" Grid's voice came out strangled. \"Lord, you can't think adultery is cool.\"\n\nBut Lord was already gone, lost in whatever fantasy a four-year-old genius constructed about romantic intrigue. Grid pressed a hand to his face.\n\n*I don't know who will marry you.* The thought carried a mix of pity and dread. *Your future wife doesn't stand a chance.*\n\n***\n\n\"This is incredible.\"\n\nGrid stared at the quest window Euphemina had shared. A legendary-rated growth class. He'd combined Pagma's techniques with Braham's magic and only glimpsed the myth rating. But Mumud's Descendant could reach it naturally.\n\n*Mumud was a genius on Lord's level?*\n\nEven Braham had feared him.\n\nBraham's voice cut through his thoughts, dripping with condescension. *There's nothing surprising about it. If Mumud had lived longer, he would have surpassed Muller.*\n\n*...*\n\nSword Saint Muller. The man who sealed the Great Demons. And Mumud could have exceeded him.\n\n*She's getting the best class.* The thought carried no envy, only satisfaction. A stronger Euphemina meant a stronger Overgeared.\n\n*You have no guts,* Braham sneered.\n\n*Better than being petty enough to resent my own allies.*\n\n*Nonsense.* Braham's voice went quiet for a moment. *Even if she becomes Mumud's Successor, she won't surpass you.*\n\nBut he didn't say it aloud. Admitting Grid's potential would mean acknowledging his own fading relevance.\n\n\"Congratulations, Euphemina.\"\n\nShe ducked her head, smiling. \"I want to help you more. To be someone you can rely on.\"\n\n*Che. Playing around,* Braham muttered.\n\nThen his tone sharpened. *You're overlooking something critical. How strong is Baal's Contractor? Even Sword Saint Muller couldn't match Pagma when he wielded Baal's power. Fighting Baal's Contractor to free Mumud's soul is nearly impossible.*\n\n*You talk too much.*\n\nBut the words stuck. Baal's Contractor. The person who'd made a pact with the First Great Demon. Pagma had been the previous contractor, according to what he'd learned in the Behen Archipelago.\n\n*Pagma's dead. Who holds the contract now?*\n\n*Your subordinates know him.*\n\n\"Eh?\" The sound escaped before Grid could stop it.\n\nEuphemina looked up. \"What's wrong?\"\n\n\"Do you know who Baal's Contractor is?\"\n\n\"No. I've never heard of them.\"\n\n\"Hrmm.\"\n\nHell and demons were obscure knowledge. Most players wouldn't have encountered it. Grid opened the guild chat.\n\n> **[Grid]:** Do you know who Baal's Contractor is?\n\n> **[Vantner]:** I don't know.\n\n> **[Pon]:** What is that?\n\nNo one answered. Grid scowled. *The kids don't know. You lied to me?*\n\n*Change the question,* Braham said. *Ask them about the necromancer they met in the vampire city.*\n\n*Vampire city?*\n\nGrid didn't know that Lauel, Jishuka, Pon, and the others had encountered someone there. He typed again.\n\n> **[Grid]:** Did anyone see a necromancer in the vampire cities?\n\nThe chat went silent.\n\n> **[Grid]:** Did no one see a necromancer?\n\n> **[Lauel]:** Master, where are you?\n\nFive minutes later, Lauel burst into the smithy. His face was pale. \"Why are you asking about Baal's Contractor?\"\n\nEuphemina shared the quest window. Lauel read it once. Twice. His expression cycled through awe, calculation, and something close to despair.\n\n\"Unbelievable. A growth class starting at legendary rating.\" His voice went flat. \"But clearing this quest means becoming hostile to Agnus.\"\n\n*Is this fate's joke? My karma dragging Grid and the others down?*\n\n\"Why do you look worried instead of happy?\" Grid crossed his arms. \"Who is Baal's Contractor that scares you this much?\"\n\nLauel exhaled slowly. \"It's Agnus.\"\n\n\"Agnus?\"\n\nGrid knew the name. Fifth on the unified rankings after Kraugel and Yura vacated their spots. One of the three Epic class holders alongside Katz and Euphemina. Yura had mentioned him once during her black magician days. He was stronger than she'd ever been.\n\n\"That's significant,\" Grid said. \"But not insurmountable. Overgeared isn't weak. We find him. We kill him. Simple.\"\n\nAttacking an innocent player for a quest. Morally questionable. Grid acknowledged that. But he didn't hesitate. Kings couldn't always be just. He'd make enemies. He'd already made peace with it.\n\nLauel raised a hand. \"It's too early to go after Agnus. He's not alone. Dozens of players worship him. Rumors say several small and medium guilds have pledged loyalty. Fighting him means war, and we can't afford that.\"\n\nAslan and the Eternal Kingdom were already watching. Any major conflict would draw their attention.\n\n\"We'll become targets if we start a war now.\"\n\n\"You're being too passive.\" Grid's jaw tightened. \"If Euphemina becomes Mumud's Descendant, our strength increases dramatically. We level her fast, crush Eternal's forces and Agnus simultaneously.\"\n\n\"Your premise is flawed.\" Lauel's voice stayed level, patient. \"Agnus is strong. Victory isn't guaranteed. If we attack him and Euphemina's class change fails, our territories burn.\"\n\n\"You're saying we can't kill one player if Overgeared's elites work together?\"\n\n\"Agnus has transcended the category of a player.\"\n\nWhen they'd encountered him in the vampire city, he'd been accompanied by a lich and death knight. While others competed in the National Competition, Agnus had been leveling. Constantly. Obsessively.\n\n\"Forgive me for saying this, but in pure combat capability, he's several times stronger than you. And we can't deploy all of Overgeared's main forces. Domestic affairs suffered during Siren. Everyone has duties. And you need to level up. You can't afford to fall behind.\"\n\nGrid's frown deepened. He trusted Lauel's advice above anyone else's, but—\n\n*Several times stronger than me?*\n\nBraham had said fighting Baal's Contractor was impossible. But Braham was Braham. Lauel was Lauel. And Lauel didn't know all the facts. The assessment bruised Grid's ego, but Lauel pressed on without mercy.\n\n\"Agnus is a psycho. Literally. Going against him means suffering for the rest of our lives. Honestly, I was hoping Overgeared would never cross paths with him.\" He paused. \"But we can't avoid it now. First, let's clean up our affairs with the Eternal Kingdom. Consolidate our power. Then I'll make a detailed plan.\"\n\nGrid's shoulders sagged. \"Understood.\"\n\nHe'd made Lauel his proxy for a reason. Refusing his advice without cause would be foolish.\n\nEuphemina stood. \"I'll get used to the new magic. Strengthen myself. In the end, this is my quest. I'll become strong enough to handle it alone.\"\n\nShe bowed and left for the magic tower to study the knowledge she'd been given. Lauel departed soon after to handle administrative work.\n\nGrid stood alone before the furnace. For someone who'd only ever measured himself against Kraugel, Agnus's existence was a shock.\n\n\"Several times stronger than me? Someone who's transcended the category of a player?\"\n\nHe'd prove them wrong. Grid pulled the god mineral adamantium from his inventory. A reward from the National Competition. What could he forge to close the gap? He'd been considering options, but now his focus sharpened to a razor's edge.\n\nHe would create something greater than anything before."
}