{
  "id": 484,
  "title": "Chapter 484",
  "content": "**[Adamantium]**  \nA mineral that could only be collected in the world of the gods, Asgard. It possesses the strength, hardness, and brittleness desired by manufacturers, though not without limits. It sits close to perfection, yet the strong divine power woven through its structure demands careful handling.  \n**Smelting Conditions:** Advanced Blacksmithing Level 7.  \n**Weight:** 30\n\nGrid turned the ingot over in his hands. The metal gleamed with an otherworldly sheen.\n\nBraham's voice stirred in his mind. *Hoh. Adamantium. Apart from pavranium, this could be called the best mineral, alongside bloodstones.* A pause. *What are you planning to make with this?*\n\n\"A weapon.\"\n\n*A weapon?*\n\nGrid had originally planned to reinforce his defense. If he sacrificed the adamantium to the Holy Light Set, classified as light armor due to its low weight, he could cover his lacking physical defense without compromising its inherent performance. The need to swap to Triple Layers would disappear. He could demonstrate ideal tanking ability even when fighting opponents with both physical and magical attacks.\n\nBut somewhere along the way, his thinking had shifted.\n\n*Looking back, there's no need to obsess over defense.*\n\nFor now, Triple Layers and the Holy Light set were enough. Triple Layers, the Largest Gloves, the Horned Helmet, Lantier's Cloak... all designed to withstand the legendary assassin's attack power. Was there any enemy likely to hit harder than Lantier right now?\n\nThe realization settled in his chest. His defense had one weak spot, but it wasn't critical.\n\n*The armor swap. But strong opponents with both physical and magic attacks are rare.*\n\nBesides, he had the immortal passive. He could endure. What he needed more urgently was a powerful attack to knock enemies down before they could exploit that gap.\n\n*Iyarugt's attack power increased at legendary rating, but there's still a gap.*\n\nGrid lost ownership of Iyarugt when he summoned the Sword Demon. The blade functioned more efficiently as a summoning tool now than as a weapon. He needed something to replace Iyarugt in direct combat.\n\nBut that created another problem.\n\nBlackening.\n\nIf he forged a weapon using adamantium, which contained strong divine power, would he even be able to activate Blackening? He'd already experienced the answer with Lifael's Spear. Divine and demonic power clashed violently. The penalties were severe. Unstable.\n\n*What will you do?*\n\nBraham had glimpsed Grid's internal struggle. How would this blacksmith overcome the reaction between Blackening and divine power? The great magician leaned forward, curious.\n\n*At best, there might be a chance if you fuse it with bloodstone.*\n\nThe bloodstone's demonic energy could suppress adamantium's divine power. Grid had considered this path. But abandoning divine power entirely felt wrong. Divine power dealt catastrophic damage to demonkin and the undead.\n\n*There are death knights in the Behen Archipelago. And Agnus has a lich and death knight too.*\n\nThrowing away adamantium's divine power in this situation would be idiotic. There had to be another way. A method for Blackening and adamantium to coexist.\n\nGrid knocked the problem around in his head from different angles.\n\nThen it hit him.\n\n\"The weapon.\" He spoke aloud. \"Is there any need for me to use it directly?\"\n\n*...?*\n\nBraham processed the question. Not using the weapon himself? Most people wouldn't grasp Grid's meaning immediately.\n\nBut Braham caught on fast.\n\n*You intend to make a weapon for the God Hands?*\n\n\"Bingo.\" Grid planned to actively leverage the God Hands. \"A weapon forged from adamantium. If the God Hands wield it, Blackening won't interfere.\"\n\n*Certainly... an interesting idea.*\n\nBraham's tone shifted, skeptical now.\n\n*Pavranium is incredible, but it has limits. The God Hands possess weaker swordsmanship. What if they can't threaten the enemy even with a superior weapon?*\n\nValid point. The God Hands were surplus power at best. They hadn't posed a major threat to Kraugel during the National Competition. It wasn't just Kraugel either. Once opponents reached a certain threshold, the God Hands got blocked.\n\n\"That's exactly why I plan to make weapons specifically for them.\"\n\nGrid had thought about this during the Kraugel fight. What if he crafted a powerful weapon that would *guarantee hits* on the enemy and gave it to the God Hands? They would no longer be surplus power. Their effectiveness in battle would become absolute.\n\n\"The enemy will have to guard against both me and the God Hands simultaneously. Their mental focus and stamina will drain fast.\"\n\n*I understand your intentions. But is there a weapon that guarantees hits on the enemy?*\n\nSwords, bows, guns. No matter how high the accuracy rating, nothing provided absolute certainty. Non-targeted attacks could be dodged.\n\n*In other words, you need a targeted attack that can't be avoided.*\n\nGrid's lips curved into a knowing smile. He asked Braham a question.\n\n\"Isn't it possible with your abilities?\"\n\nMagic Detection (Enhanced) revealed the location of enemies.\n\n\"What if you transform that spell into a passive form? Then attach it to the weapon itself?\"\n\nTargets moving too fast to track with the naked eye, or dazzling movements designed to mislead perception, would become irrelevant. Magic Detection (Enhanced) possessed the property of tracking the captured target's mana signature to the bitter end.\n\n*The weapon would move in the direction indicated by Magic Detection.*\n\nThe system would guarantee high accuracy. Grid could see it clearly.\n\nThere were drawbacks, of course. Magic Detection only located and tracked mana. It had zero judgment capability and couldn't detect danger. If a person wielded the weapon while moving in the direction Magic Detection indicated, they could walk straight into a crisis. Become subjected to bombardment, traps, ambushes.\n\nBut the God Hands were different. Infinite durability. Any damage they suffered wasn't transferred to Grid.\n\n\"How about it? This could work, right? But only if you cooperate with me.\"\n\n*You...*\n\nBraham had only wanted to observe what type of weapon Grid would produce. Now he was being asked to participate? He held high regard for Grid, but he wasn't tolerant enough to accept unconditional demands. The idea of being used stirred displeasure in him. He opened his mouth to refuse.\n\n\"It's fine if you can't.\" Grid waved a hand dismissively. \"Transforming magic isn't easy.\"\n\nThe provocation landed.\n\n*Who says I can't do it? It's a trivial task for me!*\n\nBraham's towering pride made him easy prey for such tactics. It wasn't stupidity. Just personality.\n\n*Damn it.*\n\nGrid asked the flustered great magician, \"I need your power. Please lend it to me.\"\n\n*Why should I...?*\n\n\"Aren't you curious? How powerful will a weapon become when you combine the abilities of a legendary great magician and a legendary blacksmith? Everyone in the world would be stunned.\"\n\n*...Ahem.*\n\nHe was curious. Working with Grid did seem entertaining.\n\n*I might produce something far beyond expectations, like with pavranium. It would give me much to research.*\n\nMemories surfaced. Creating pavranium with Pagma. His emotions tangled, grew complicated. Braham felt afraid that this moment with Grid might be enjoyable, but one day he would be abandoned again.\n\n*Hah.* He had no words. Only bitter laughter. *I... the great magician Braham... afraid of being abandoned.*\n\nHe'd grown fond of Grid at some point. The pain when Grid had betrayed him still cut deep.\n\n*More than anything, I've grown weak.*\n\nHis soul had existed too long without flesh. Without a center, his heart had softened. Perhaps he was simply too old.\n\n*Why should I bother starting over?*\n\nThe times were changing rapidly. A new generation spread their wings. Eventually, the legends of the past would become obsolete. Once Braham resurrected, enjoying his former glory would prove difficult. More likely, he would just suffer disgrace.\n\n*Even if that doesn't happen, Marie Rose and the great demons will threaten me. Now is the time to let go.*\n\nBraham struggled to conceal his deteriorating resolve, convinced Grid couldn't hear his inner turmoil. But they'd been together too long. Despite Braham's efforts, Grid read his heart.\n\n\"Why would you leave?\" Grid said. \"You can't abandon me until you've taught me magic.\"\n\n*...Indeed.*\n\nSomething clicked for Braham. Grid was different from Pagma. Pagma had pursued power out of duty, always striving for \"peace in the world.\" That relentless drive made him capable of severing small connections without hesitation. Meanwhile, Grid's vessel was smaller. Justice? He'd discarded it, working only for himself and those close to him.\n\nAnd because of that...\n\n*This person won't betray me.*\n\nJoy flickered in Braham's essence. He spoke in a cold voice to hide it.\n\n*Learning all my magic before you die is impossible. If you truly want to learn magic, you can never betray me. Understood?*\n\nGrid laughed at Braham's words and shrugged.\n\n\"Well, I guess so.\"\n\nGrid had built a friendship with a strange companion.\n\nMeanwhile, from a corner of the smithy, someone was watching.\n\nKhan stood there, tears glistening in his eyes.\n\n\"Now he's talking to himself...\" The old blacksmith's voice cracked. \"His illness has worsened.\"\n\nKhan misunderstood completely. Image control mattered.\n\n***\n\n\"Legendary Blacksmith's Creation Skill.\"\n\n> **[Legendary Blacksmith's Creation Skill]**  \n> You can create three equipment item production methods every time the skill level of 'Legendary Blacksmith's Craftsmanship Skill' increases.  \n> **Number of items that can be created at present:** 11/24  \n> *When items are produced using this skill, the creator's name is automatically inscribed on the item.*\n\nThe moment Grid activated the skill, a loud chime echoed.\n\n> **[What item do you want to create?]**\n\nHe'd already decided. Grid answered without hesitation.\n\n\"A hammer. I'll make a hammer.\""
}