{
  "id": 485,
  "title": "Chapter 485",
  "content": "**CHAPTER [NUMBER] - THE HAMMER OF CREATION**\n\n\"Hammer?\"\n\nGrid's declaration hung in the air. Braham's presence stirred within his consciousness, radiating confusion.\n\n*I expected you to create a sword. Your primary weapon has always been a blade. Why a hammer?*\n\nGrid flexed his fingers, examining the translucent blueprint materializing before him. \"First of all, blunt weapons have high accuracy.\"\n\n*How so?*\n\n\"A blunt weapon can strike the enemy from any angle. There's no need to align the edge like a sword or spear. It's easier to use, and the system guarantees better accuracy.\"\n\n*Certainly, that fits your purpose of making a weapon with high hit rate. But aren't there obvious limitations to weapons that are so simple to wield?*\n\nBraham's skepticism bled through the mental link. Grid could almost see the ancient magician's frown.\n\n*A blunt weapon is subject to inertia because its center of gravity sits on one side. Yes, this maximizes power, but opportunities to leverage that power are rare. During the constant exchange of attacking, evading, and counterattacking, weapons with weight focused on one side often become a liability. Especially against skilled opponents.*\n\nThe vampire's lecture continued in Grid's mind, each word measured and precise.\n\n*It's difficult to find opportunities to use the weight, and you risk losing your center of gravity. The balance is fundamentally flawed. Consider why most combatants prefer swords. The sword achieves perfection in all aspects of offense and defense...*\n\n\"Hey.\" Grid interrupted the mental monologue. \"You know a lot about weapons for a magician.\"\n\n*I collected all knowledge.*\n\nThe pride in that statement was palpable. Grid suppressed a smirk.\n\n\"That's right. A blunt weapon has many disadvantages. Compared to commonly used weapons like swords and spears, the balance is poor. Above all, the attack power is inconsistent.\"\n\n*Inconsistent?*\n\n\"Most people think a blunt weapon hits harder than a sword. Systematically, the maximum attack power is much higher. But that's the *maximum*. In other words, that's only true when the weight is used perfectly.\"\n\nGrid paced as he spoke, his thoughts crystallizing into words.\n\n\"A blunt weapon has the advantage of hitting enemies from all sides, but it can't stab or cut. Of course, you could attach a blade, but that weakens the unique advantage of the blunt weapon. It means dealing a fatal blow to high-defense enemies becomes difficult. The probability of applying minimum attack power rather than maximum is overwhelmingly high.\"\n\n*Then why...*\n\n\"Don't forget.\" Grid's voice carried quiet confidence. \"I'm a legendary blacksmith, and the God Hands are artifacts literally modeled after my own hands.\"\n\nHe held up his calloused palms, the evidence of countless hours at the forge.\n\n\"For a blacksmith, hammers are the best tool. I can see the pros and cons of a hammer better than anyone. It's the ideal weapon for the God Hands.\"\n\n*But you won't use it yourself.*\n\n\"Of course not. In terms of balance, a sword is much better for me. Especially when fighting someone of equal ability, using a blunt weapon would be suicide.\" Grid dismissed the concern with a wave. \"But I'm making this for the God Hands specifically. They have infinite durability. They don't need to fear counterattacks. They can ignore whatever the enemy is doing and just hit.\"\n\nThe strategy clicked into place like gears meshing together. Grid's eyes gleamed.\n\n\"Also, I want to improve the efficiency of Item Combination. The skill is difficult to use in actual combat. I need a hammer that not only boasts a high accuracy rate, but also shortens the casting time of Item Combination.\"\n\n*Hrmm.*\n\nBraham's presence receded, offering no further argument. No room for disagreement remained.\n\nGrid turned his full attention to the notification window hovering before him.\n\n> [You have decided to create a hammer. What materials would you like to use?]\n\n\"Adamantium, drake's fangs, Water Clan King's Tears, and ogre tendons.\"\n\n> [Have you decided?]\n\n\"Yes.\"\n\n> [Please design the item.]\n\nA blank blueprint materialized in front of Grid. This was already his fourteenth item creation. His hands moved with practiced confidence, guided by experience and his absurdly high dexterity stat. He didn't rush. Slow and careful. Methodical.\n\n*The handle is made from drake's fangs.*\n\nThe handle's role was crucial. It determined whether a tool could achieve its best performance. A hammer, in particular, was used for striking hard objects. Every impact generated a repulsive force that tired the user.\n\nHowever, those disadvantages could be eliminated if the handle absorbed the shock. Drake's fang was hard and resilient. The repulsive force would dissipate through the material. Drake's fang was commonly used for spears. It was bound to be robust, considering how difficult it was to obtain.\n\n\"Not too large.\"\n\nGrid murmured the words like a mantra, his hand sketching precise measurements. The God Hands needed the right size to swing it effectively. He set the handle to the fairly short length of fifteen centimeters.\n\n\"Heavy is good.\"\n\nIncreasing the weight would naturally increase the power. There was the disadvantage of raising the strength requirement, but it didn't affect Grid or the God Hands, who could use all items regardless of restrictions. Grid set the dimensions at fifteen centimeters in length and thirty centimeters in width. The handle was short, while the metal plates seemed extremely large and lacking in efficiency.\n\nHowever, since the size was so big, missing the target would be nearly impossible. This was exactly what Grid intended.\n\n*I need to add some utility.*\n\nAt the bottom of the handle, there would be a red cord made of ogre's tendon. The user could loop a finger through it to throw the hammer. Depending on the situation, it could fly like a meteor.\n\n*In order to shorten the item combination process, I'll add an option to increase refining speed. I can increase the thermal conductivity.*\n\nTime became meaningless. Darkness crept across the window as he focused on drawing. Grid had always been nocturnal when playing games. He found that night increased his concentration. His hand movements became more delicate. The quality of the drawing climbed higher.\n\nTwo hours passed.\n\nGrid examined the final design, satisfaction warming his chest. He pressed the confirmation button.\n\n> [Have you decided? When you complete the blueprint, the number of available creation skill uses will decrease by one.]\n\nGrid didn't hesitate.\n\n\"I have decided.\"\n\nHe had plans to create two items today. One was a hammer for the God Hands. The other was a sword for himself. If he used the materials obtained from the drake raid, he was confident about making a blade comparable to Iyarugt.\n\n> [The blueprint has been completed.]\n> [One skill count has been consumed.]\n> [Please describe the characteristics of the item.]\n\nFanciful descriptions weren't good. The actual description must accurately portray the item's functions while enhancing the quality. Grid drew a deep breath and began to speak with careful precision.\n\n\"The main material that makes up the metal plates is the god mineral adamantium. Apart from pavranium, it can destroy any other material once struck repeatedly. Compared to the size of the plates, the handle is relatively short, requiring less force when swinging. It also has a higher hit rate. Structurally, it is easy to use with one hand and speeds up the refining of items. In addition, the Tears of the Water Clan King mean a new spell can be attached.\"\n\n> [Analyzing.]\n\n*Chiing.*\n\nThe design Grid drew erased itself and another image appeared. The skill compensation effect was working.\n\n> [The blueprint has been completed.]\n\n*Okay!*\n\nGrid verified the perfectly completed design, delight surging through him. A hammer that could be wielded with one hand. The gold, shiny, thick, and sharp metal plates that formed the head gave off a foreboding aura. It looked like it could shatter an ogre's skull in one blow. The black handle with the red cord was full of elegance.\n\nBraham noticed the name 'Grid' inscribed on the bottom of the golden hammer. Rare admiration flickered through his consciousness.\n\n*Great.* \n\nThe mix of gold and black always looked good. It was luxurious and full of dignity. The colors matched Braham's taste perfectly. \n\n*The harmony of the appearance and colors gives off a considerable amount of awe. It is enough to instill fear in enemies. Now it just needs a name.*\n\n\"The name...\"\n\nThe notification window requested a name. Grid pondered for a moment, then made a decision.\n\n\"Adamantium Hammer?\"\n\n*...*\n\nBraham finally grasped the full extent of Grid's poor naming ability. He didn't want this amazing looking golden hammer to bear such a cheap name.\n\n*The perfection of a work isn't determined solely by its power and appearance. The name should be classy.*\n\n\"Then Adamantium Hammer.\"\n\nGrid nodded to himself, pleased. He meant it.\n\n*Sigh.*\n\nNo answer came. Braham had given up when Lauel suddenly appeared in the smithy doorway, hurrying forward.\n\n\"How about Mjolnir?\"\n\nGrid blinked. \"What?\"\n\n\"Myol-nir.\" Lauel enunciated carefully. \"It's a hammer used by Thor. It's consistent with the hammer you created in many ways. It has a relatively short handle and can be thrown.\"\n\nTrue, it didn't have the ability to return when thrown, but Grid's hammer was comparable to Mjolnir when it came to smashing and destroying.\n\n\"Oh.\" Interest sparked in Grid's eyes. The name Mjolnir settled well in his mind. Then confusion replaced interest. \"Wait. Why are you here? How long have you been here?\"\n\n\"That...\" Lauel made an awkward expression, rubbing the back of his neck. \"All of a sudden, Khan came running to me and said you seemed crazy. He was worried about your state and asked me to check on you. Then I arrived here and watched your process of creating an item.\"\n\n\"Seemed crazy?\"\n\nWhat was this? Grid turned his gaze toward Khan. The old blacksmith's eyes were red and swollen, as if he had been crying. Those bloodshot eyes met Grid's gaze.\n\nKhan shouted, voice cracking. \"I was watching and you kept talking to yourself! Wouldn't you be worried if I was talking to someone in a place where I was alone? I thought you had gone crazy! I was really worried!\"\n\n\"...\"\n\nGrid vowed to use caution when he talked to Braham in the future. \n\n> [Please decide the name of the item you have created.]\n\nThe system demanded again. Heartless, rushing a person like this. Grid clicked his tongue.\n\n\"Mjolnir.\"\n\n> [Have you decided on Mjolnir?]\n\n\"Yes.\"\n\n> [An item called 'Mjolnir' already exists. A separate model name will be attached to distinguish between them.]\n> [The item creation has been completed.]\n\nThe information window bloomed before Grid's eyes, data streaming across his vision.\n\n**[<span class=\"rarity-legendary\">Mjolnir - Human World Version</span>]**\n\n**Rating:** Unique to Legendary (Growth)\n\n**Unique Rating Information:**\n\n**Durability:** 610/610\n**Attack Power:** 660 to 1,090\n\n* Accuracy **+20%**.\n* Acceleration will rise when thrown.\n* Every time the target is hit, there's a high probability of causing **0.1 second** of stiffness.\n* The durability of any objects hit will fall (except your own items).\n* **1,990** fixed damage will be dealt to demonkin and the undead.\n* There is a chance to induce the 'fear' state in those who recognize it as an enemy.\n* The workmanship speed of blacksmith related skills will slightly increase.\n\n**Legendary Rating Information:**\n\n**Durability:** 689/689\n**Attack Power:** 790 to 1,400\n\n* Accuracy **+35%**.\n* Acceleration will rise when thrown.\n* Every time the target is hit, it will cause a **0.1 second** stiffness state.\n* The durability of any objects hit will fall.\n* **2,400** fixed damage will be dealt to demonkin and the undead.\n* There is a high chance to induce the 'fear' state in those who recognize it as an enemy.\n* The workmanship speed of blacksmith related skills will rapidly increase.\n\n*A tool that the legendary blacksmith Grid made from the god mineral adamantium. It is an all-purpose hammer that can exert absolute power when it comes to destruction and creation. The huge metal plates give off a considerable amount of foreboding. It can easily hit the target and cause fear.*\n\n*It is a weapon that can be compared to the divine weapon Mjolnir depending on the growth.*\n\n**Magic Currently Attached:** None\n\n**User Restriction:** Level 350 or higher. **3,000** or more strength. More than **3,500** dexterity.\n\n**Weight:** 4,900\n\n\"...Amazing.\"\n\nPerfect. More than he expected. It could possibly grow to the myth rating, making it the ultimate weapon. He noticed the dexterity requirement attached to the conditions of use. It was a result caused by optimizing the design for Grid and the God Hand's capabilities.\n\n*It's still okay.*\n\nThe weapon was originally made to climb to the highest position. He had no intention of selling or sharing it with others.\n\n\"How about it? Is it well made?\"\n\nLauel asked, noticing the satisfaction radiating from Grid's expression.\n\n*It's more balanced than Failure?*\n\nAnticipation flooded Lauel. Grid shared the information window with him.\n\n\"Heok...\"\n\nA masterpiece created by the legendary blacksmith using god mineral. Lauel was speechless as he saw that the performance of the item far exceeded his expectations. \n\nGrid met Lauel's astonished gaze, his voice carrying absolute conviction. \"Agnus? How long can he remain stronger than me?\"\n\nThe more items Grid created, the stronger he became.\n\n\"I am the strongest.\"\n\nLauel didn't doubt Grid's assertion for a moment. He felt only infinite trust. \n\nMeanwhile, Braham was comparing Grid to Pagma.\n\n*Creating the best battle gear.* A legendary blacksmith indeed had infinite potential. *If my magic power is added, there will be no limit to his growth.*\n\nBraham thought about it. Pagma had easily betrayed and killed him just because he was a vampire. Ironically, in the end, Pagma had to make a deal with a great demon for the peace of the world.\n\n*Pagma, I will help Grid.* The thought crystallized into resolve. *Grid will be reborn as someone stronger than you, who contracted with Baal. Watch from hell and feel regret. You shouldn't have betrayed me and chosen Baal.*"
}