{
  "id": 486,
  "title": "Chapter 486",
  "content": "The ring of hammer on anvil echoed through the smithy, relentless and rhythmic. Grid's hands moved with precision, each strike deliberate. Ten days had passed. Ten nights. The furnace blazed without respite, and neither did he.\n\nBraham watched from his spectral perch, fascinated despite himself.\n\n*This man's concentration...* The thought came unbidden. *It defies reason.*\n\nHe had seen Pagma forge the pavranium with single-minded determination. He had watched Mumud lose himself in magical research for weeks at a time. Grid's intensity matched them both.\n\n*A genius of effort,* Braham mused, the admission reluctant. Grid lacked the raw talent that had defined Mumud and Pagma. By any measure, he should not be compared to such prodigies. Yet his willpower, his stubborn refusal to accept anything less than perfection, bridged that gap. *Effort is its own gift. Though talent would accelerate his growth considerably.*\n\nThe contradiction amused and saddened Braham in equal measure. He clicked his tongue.\n\n\"Shit.\" Grid's voice cut through the rhythmic hammering. \"Another failure.\"\n\nThe unique-rated Mjolnir went back into the furnace. Grid was exploiting the extraordinary durability of adamantium and drake fangs. He would destroy and remake the hammer as many times as necessary until it emerged legendary.\n\n*He's starting over? Again?*\n\nBraham had lost count of the attempts. This could continue for months. The realization settled over him like a weight. Grid's determination wasn't admirable. It was terrifying.\n\n***\n\n\"Grid is still in the smithy?\" Jishuka's voice carried concern.\n\nTwo weeks had passed since Grid locked himself away.\n\n\"He should be hunting,\" one of the newer Overgeared members complained. \"The experience buff won't last forever. Why waste it crafting?\"\n\n\"Exactly. He has enough weapons already. This makes no sense.\"\n\nThe veterans exchanged knowing glances. Jishuka, Lauel, Regas, Pon, Ibellin. Those who understood excellence recognized what drove Grid.\n\n\"He needs to solve the problem first,\" Lauel said quietly.\n\nRegas nodded. \"Rationally, he knows it's inefficient.\"\n\n\"But satisfaction matters more than efficiency,\" Pon added.\n\nIbellin smiled faintly. \"His motivation burns until the problem is solved. That's who he is.\"\n\nThe others fell silent.\n\nThe line between genius and obsession was razor-thin.\n\n***\n\nIn the abyss, Iyarugt's soul churned with displeasure. His power had returned, partially. Yet Grid refused to summon him. The frustration gnawed like hunger.\n\n*When we meet again, I'll remind him of his place.*\n\nDemonkin followed one law: survival of the fittest. Some were born strong. From Iyarugt's perspective, serving someone weaker defied natural order.\n\n*I'll make our relationship clear. Once he understands the gap between us, he'll serve me instead.*\n\nGrid would become his hunting dog, fetching prey to restore Iyarugt's former glory. And then.\n\n*I'll destroy Zepar.*\n\nThe 29th great demon. Zepar, who had dismissed his swordsmanship with contempt. Who had sealed his soul through cowardice. Three hundred years of rage crystallized into a single burning purpose.\n\nA growl built in Iyarugt's throat, formless but potent. Killing intent radiated through the void.\n\nThen: \"Come, Iyarugt.\"\n\nGrid's voice. How long had it been?\n\n*Finally.*\n\nLight split the darkness. Iyarugt surged toward it.\n\nThe air tasted sweet in his lungs. Liberation, after so long confined.\n\n\"Why do you say the same thing every time you appear?\" Grid's voice was flat. \"Isn't this concept getting boring?\"\n\nGrey hair materialized first, then a lean form. Iyarugt seized his blood-red sword and sneered.\n\n\"Amusing. A weakling stares at me without fear.\"\n\nTime to correct that mistake. He leveled his blade at Grid.\n\n\"Kneel. Understand the difference between us.\"\n\nSilence.\n\n\"You're corny,\" Grid said.\n\nIyarugt's roar shook the air. \"I guess that's your answer!\"\n\nHis demonic sword lanced toward Grid's thigh. Grid moved to intercept, wielding a black longsword Iyarugt had never seen. New, perhaps. It didn't matter. Grid's skills were leagues below his own.\n\n*This will be easy.*\n\nIyarugt's wrist twisted fractionally. The bloody blade veered from Grid's thigh to his jaw, snake-quick. No one could react to such a feint.\n\nThe demon smiled.\n\nMetal sang.\n\n\"What?\"\n\nGrid's black sword had split in two. One blade caught Iyarugt's strike. The other carved into his thigh.\n\n\"Separating blades? Cheap tricks!\" Iyarugt's sword met Grid's with the force of Sublime Sword behind it.\n\nFour golden shapes blurred from every angle.\n\nHammers swung. Massive, radiant, impossibly fast. Iyarugt flinched. He parried one, barely deflected another. His eyes, which saw the optimal sword path, struggled.\n\n*Can I block them all?* The golden hammers came from impossible angles. *There's no room to dodge!*\n\nHe tried footwork, desperate to create distance. Useless.\n\nOne hammer crashed into his skull. Then another. Another.\n\n\"Cough!\"\n\nDivine power seared through him. His vision blurred. Grid's black sword punched through his heart.\n\n\"Shall we try again tomorrow?\" Grid whispered.\n\n***\n\n*What... what just happened?*\n\nIyarugt floated in the abyss again, consciousness slowly returning.\n\n*Why?*\n\nThose hammers. Unavoidable, relentless.\n\n*What were they?*\n\nHis soul churned with confusion and something uncomfortably close to fear.\n\n***\n\n*Wonderful. The weapon exceeds expectations.*\n\nBraham observed Grid's satisfied expression. Iyarugt was an ancient demon, a ghost like Braham himself. His body and presence were mere illusions, his magical power a guttering candle. Weak. Unimpressive.\n\nYet Iyarugt was formidable.\n\nDespite being incorporeal, he fought with strength rivaling a true blood baron. Braham had witnessed his swordsmanship against Maxong. He'd assumed Iyarugt fell short of great demon status, but the skill was undeniable.\n\nAnd Grid had crushed him.\n\nInstantly.\n\n\"Kuaaaaak!\" Iyarugt's scream cut short as he dissolved back into the sword.\n\nMjolnir's accuracy and attack power were devastating. Iyarugt had no defense against the hammers' pursuit. Grid smiled, turning to Braham.\n\n\"This is thanks to you.\"\n\nBraham's variant of Magic Detection (Enhanced) had made the difference. The detection range narrowed to less than one meter, but the pursuit capability strengthened dramatically. He'd converted it to a passive effect embedded in Mjolnir itself. The hammer's accuracy increased by 50%, stacking with the legendary rating's innate 85% bonus.\n\nThe result was surgical precision.\n\n\"However, the power isn't optimal.\" Grid frowned. \"Maximum damage rarely manifests. That's the limitation.\"\n\nBlunt weapons suffered from this inherent flaw. High maximum attack power meant little when minimum damage triggered more frequently.\n\n*Wait.* Braham considered. *Iyarugt couldn't ignore it.*\n\n\"That's because Iyarugt's body is weak,\" Braham said. \"Not because of Mjolnir's attack power.\"\n\nThe Sword Demon's form was composed of soul and magic power. He could only manifest once every 24 hours, for a maximum of ten minutes. His health capped at 10,000. His defense was negligible.\n\nThree or four of Grid's strikes would banish him. Yet Grid valued Iyarugt highly. Hunting, raids, PvP—the demon excelled in all scenarios. His overwhelming offense compensated for fragility. His sophisticated swordsmanship prevented counterattacks.\n\n*A perfect inferior copy of Kraugel,* Grid thought. *For now.*\n\nOnce Iyarugt recovered more of his original power, he might surpass Kraugel. Grid needed to tame him while he remained manageable.\n\n\"Mjolnir counters him perfectly,\" Grid said. \"But this deserves credit too.\"\n\nHe raised his left hand. The black longsword caught the light, or rather, absorbed it. From pommel to tip, it was uniformly dark. Handle and blade blurred together, indistinguishable. Like a sword carved from coal.\n\nExcept it was flawless.\n\n> [Sword Ghost]\n> \n> Rating: Legendary\n> \n> Durability: 1,109/1,110  \n> Attack Power: 1,836\n> \n> * Can be separated into small and large pieces.\n> * When separated, the small piece will have 930 attack power and the large piece will have 1,480 attack power.\n> * For every attack that hits the same target, 10% attack power will accumulate (up to 100%).\n> * The skill 'Strike' is generated.\n> \n> A sword made by the legendary blacksmith Grid. It is designed to exert maximum attack power.\n> \n> The materials are drake fangs, claws, bones, and scales. The black sword is a compressed drake.\n> \n> There are two knobs: one in the middle of the blade, one at the bottom, made of drake fangs. Turning the center knob separates the pieces. Striking an enemy with these knobs deals severe psychological damage.\n> \n> Since the surface is entirely black and the circumference of the blade matches the knobs, distinguishing them with the naked eye is nearly impossible.\n> \n> User Restriction: Level 360 or higher. Advanced Sword Mastery level 7. More than 2,500 strength. More than 3,000 dexterity.\n> \n> Weight: 4,390\n\nIyarugt was the Sword Demon. So Grid had named this blade Sword Ghost, a weapon forged to counter its namesake. Every drake material went into its construction. Fangs, claws, bones, scales—components superior to any mineral in the human world. He'd even used scales originally intended for armor.\n\nThe result justified the sacrifice. Though classified as a one-handed sword, it boasted higher durability and attack power than Mjolnir. A true masterwork.\n\n\"The separation ability created openings in Iyarugt's defense,\" Grid explained. \"Mjolnir became effective because Sword Ghost set up the strikes.\"\n\nKraugel's performance in the National Competition had inspired the design. Twenty-nine days of relentless crafting had produced this breakthrough.\n\nGrid sheathed the blade. \"Now I need enhancement stones.\"\n\nHe headed for the auction house."
}