{
  "id": 487,
  "title": "Chapter 487",
  "content": "Grid purchased enhancement stones at the auction house and returned to Khan's smithy. He pulled the stones from his inventory, their weight settling in his palm like lead.\n\n*This time it's enhancement?* Braham's voice echoed in his skull.\n\nGrid nodded. \"Yes, it's a natural process.\"\n\nThe higher the enhancement value, the higher the item's basic stats and options. The concept was required. The problem was that the odds were absolute shit.\n\n*Indeed, enhancing a weapon will be easy for you. Pagma was the master of enhancement and you have inherited his skills.*\n\nGrid's eye twitched. For him, enhancing weapons was *never* easy. The passive skill 'Increases the probability of item enhancement' was applied, but there was no doubt Grid had no luck.\n\nHe kicked at the dirt floor. \"Braham, you have a funny way of looking at the world. How can something be easy in this dirty world? In particular, enhancement isn't a process that can succeed with effort, only good luck...\" Grid exhaled slowly. \"I only have a few enhancement stones in the first place.\"\n\nThe price of enhancement stones had started to skyrocket half a year ago. Currently at 250 gold per stone. When converted to Korean money, it would be around 300,000 won. Blessed enhancement stones were 10 times more expensive. Grid had earned close to 20 billion won in revenue from the National Competition, but it was still a lot of pressure to freely use the enhancement stones.\n\nGrid glared at the ceiling. \"The game company is crazy...\"\n\nEnhancement stones were originally expensive. Since the early days of the server, they had been traded at 100 gold per stone. At the time, the player resistance wasn't a joke. The players with no money urged the S.A. Group to increase the probability of enhancement stones dropping, otherwise they would never be able to use the enhancement system.\n\nBut the S.A. Group was immovable. They didn't modify the probability of dropping enhancement stones. The result was the current situation. As the number of high level players increased, the demand for enhancement stones increased. However, the supply remained unchanged.\n\n*Most high level players invest a lot of money into the game.*\n\nIt was a world where a person could earn money by sitting at home and playing games. In particular, high level players earned tens to hundreds of millions of won per month even if they only live broadcasted on the Internet. It was thanks to the viewers who sent them donations in order to cheer them on or to feel envious about a level they couldn't reach. Thanks to this, the high level players were very passionate about the game. They worked hard to gain more viewers and invested a lot of money into the game.\n\nGrid clenched his fist. \"It's because of people like them that the price of the enhancement stones is like this... Shit, it is really too much. Ordinary players like me are bending our backs because of you.\"\n\nGrid's fundamental problem was ignoring and blaming others. This time, he swallowed his tears as he purchased 50 enhancement stones and 10 blessed enhancement stones. Then he prayed.\n\n*My goal is to have Sword Ghost and the four Mjolnirs reach at least +8.*\n\nThere was an almost 100% success rate up to +5. But from +6 onwards, the probability of enhancement failure was very high. If it failed, the enhancement value would fall. In particular, when using general enhancement stones, failing an enhancement could lead it to fall by three or more values. That's why it wasn't easy to see +7 or higher items. People with money used blessed weapon enhancement stones to reduce the failure penalty as much as possible, but an average person couldn't.\n\n> **[Blessed Weapon Enhancement Stones]**\n>\n> A magic stone used to enhance weapons.\n> \n> Successful enhancement of a weapon will increase the enhancement value by +1~+3.\n> \n> Failed enhancement of a weapon will decrease the enhancement value by -1.\n> \n> Weight: 20\n\nGrid exhaled slowly. \"Sigh... Okay.\"\n\nHe had prepared enough materials. Now it was time to test his luck. Really. Effort wasn't necessary for the enhancement system. He only prayed for good luck.\n\n\"Reach +8 at once.\" \n\nAfter enhancing Sword Ghost and the four Mjolnirs to +5, he planned to use the blessed enhancement stones to make them reach +8 at once. Grid rolled his shoulders.\n\n\"I will begin!\"\n\nGrid was motivated and started to enhance the five weapons. Fortunately, he reached +5 for each weapon without failing and looked at the options.\n\n*The option values have stayed the same.*\n\nSome items had option values that increased at +1, while others would only increase after +7. Most of the higher rated items had a fixed numerical value for their options. The basic stats only increased until at least +8, where some option values might increase.\n\nGrid grumbled under his breath. \"It is for the balance, balance, balance.\"\n\nHe desperately pulled out a blessed enhancement stone.\n\n\"Please... Please!\"\n\n*Enhance it by +3 at once!* \n\nGrid prayed to all the gods in the world as he applied the blessed weapon enhancement stone to Sword Ghost first.\n\n> [You have used the blessed weapon enhancement stone on the +5 Sword Ghost.]\n>\n> *Ttiring!*\n>\n> [You have succeeded in enhancing it by +1.]\n>\n> [The +6 Sword Ghost has been completed.]\n\n\"Eh?\"\n\nWhat was this?\n\nGrid blinked rapidly. \"Is this a lie?\"\n\nTo be honest, Grid was planning to use the weapon only if it reached +7. But +6? The blessed enhancement stone that cost roughly 3 million won only did a +1 enhancement? Did this make sense?\n\n\"It's really too much... This is the same as using regular enhancement stones.\"\n\nGrid started shaking. He was very upset. He never imagined that he would face such an unlucky situation from the beginning.\n\n*What?*\n\nGrid sat down and stared at the wall. He was stunned at the 3 million won that flew away. Then Braham provoked him.\n\n*Are you going to give up just because you failed in the weapon enhancement once? Pathetic. How could you get enhanced battle gear with such weak mentality?*\n\nGrid's jaw tightened. \"...Yes, you are right. I can't give up! I still have 9 blessed enhancement stones remaining!\"\n\nGrid was stimulated by Braham and rose from his spot. Then he immediately used one of the blessed enhancement stones on the +5 Mjolnir.\n\n> *Ttiring!*\n>\n> [You have succeeded in enhancing it by +1.]\n\n\"This is really XXX.\"\n\nIn the end, Grid started cursing. It was the moment when his dirty personality that had been sealed for a while was revealed.\n\nGrid slammed his fist on the workbench. \"Does this make sense? Eh? You damn [email protected]#!! %## game makers! Oh!\"\n\nWhat did players want when playing the game? They hoped for a legitimate system where they would be rewarded for trying hard. But the damn game company introduced a system of probability, frustrating the users who relied on effort.\n\n*If you obtain a lot of enhancement stones and keep challenging, you can reach the +10 enhancement~*\n\nHe seemed to hear Chairman Lim Cheolho's voice in the distance.\n\n\"Damn luck-based system...!\"\n\nHe had failed in two consecutive tries. It was obvious that Grid would be angry after losing 6 million won in cash in the blink of an eye. Anyone would've been furious. It was enough to make him tearful. However, Braham was an NPC and 100% couldn't understand Grid.\n\n*You still have a lot of enhancement stones remaining. Why are you so agitated about just two failures?*\n\nGrid wiped his face. \"...You are right. Yes, it's only two times.\"\n\nHe still had 8 blessed enhancement stones remaining. Grid took deep breaths and barely calmed down. Then he used the third blessed enhancement stone on the Mjolnir.\n\n> *Ttiring!*\n>\n> [You have succeeded in enhancing it by +1.]\n\n\"...?\"\n\nThree +1 enhancements in a row?\n\n*Flop!*\n\nGrid was shocked by the unbelievable result and sat down. He stared into the air again for a while. Braham told him, *Aren't you dreaming high? The process of reaching the top is much harder than enhancement. You will experience numerous ordeals. Do you think you can achieve this dream if you give in to frustration?*\n\nGrid's hands trembled. \"That's right... Braham is right...\" \n\nIn order to be the best, he must have the best mentality. He couldn't be shaken so easily. \n\n\"I'm okay...! I'm okay!\"\n\nGrid shouted like it was a spell and once again used the blessed enhancement stone. The result was okay this time.\n\n> [You have used the blessed weapon enhancement stone on the +5 Mjolnir (3).]\n>\n> *Ttiring!*\n>\n> [You have succeeded in enhancing it by +2.]\n>\n> [The +7 Mjolnir (3) has been completed.]\n\n\"Good...!\"\n\nHe was overcoming it. He was prepared to use all 10 blessed enhancement stones.\n\nGrid's voice rose to a shout. \"I am rich!\"\n\nHe would overcome his dirty luck with money! If necessary, he would continue to buy enhancement stones and enhance the items! Grid shouted while feeling angry at the company who created this mess. He used the last five enhancement stones.\n\n*It was +1 and +2, now it will be +3!*\n\nHe was hoping to see the ideal result.\n\n> [You have succeeded in enhancing it by +1.]\n\n\"Kuaaah!\"\n\nGrid's eyes widened. A strong mentality?\n\nHe grabbed the stone and hurled it at the wall. \"Bullshit! Give it to me!\"\n\nGrid was completely hysterical! He had successive +6 Sword Ghost and three +6 Mjolnirs. Continuously without stopping! The result was amazing!\n\n> [You have failed to enhance the +6 Sword Ghost. The enhancement level has fallen by 1 to the +5 Sword Ghost.]\n>\n> [You have failed to enhance the +6 Mjolnir (1). The enhancement level has fallen by 1 to the +5 Mjolnir (1).]\n>\n> [You have failed to enhance the +6 Mjolnir (2). The enhancement level has fallen by 1 to the +5 Mjolnir (2).]\n>\n> [You have failed to enhance the +6 Mjolnir (4). The enhancement level has fallen by 1 to the +5 Mjolnir (4).]\n\nGrid started laughing. \"Hah! Hahahahat! Yes! Let's see who will win!\"\n\nNow he didn't swear. Only dumbfounded laughter emerged.\n\n\"Kuahahaha!\"\n\nGrid started laughing like crazy as he used the blessed enhancement stone on the +7 Mjolnir (3). He knew with his head that he shouldn't do this, but his hand couldn't stop. He wanted to somehow make up for the loss. This was why gambling was so scary. Lottery games and other gambling content made normal people go crazy. It wasn't a system that the bad luck Grid could use.\n\n> [You have used the blessed weapon enhancement stone on the +7 Mjolnir (3).]\n>\n> *Ttiring!*\n>\n> [You have succeeded in enhancing it by +3.]\n>\n> [The +10 Mjolnir (3) has been completed.]\n>\n> [Congratulations! You are the first player to gain the ultimate weapon!!]\n>\n> [The title 'Uncommonly Lucky Person' has been acquired!]\n>\n> [The special stat 'good luck' is opened!]\n\n\"...???\"\n\nIt was a result he never expected. Grid's body stiffened like a stone statue.\n\n\"This... Is it a dream?\"\n\nHe couldn't even pinch his cheek because he was afraid it would break the dream. Braham applauded his achievement.\n\n*You achieved the ultimate enhancement. You are truly Pagma's Descendant.*\n\nThat's right. It wasn't a dream."
}