{
  "id": 489,
  "title": "Chapter 489",
  "content": "Seoul housed the headquarters of S.A. Group.\n\nThe operations team monitoring Grid erupted in celebration.\n\n\"Whoa! Grid finally did it!\" An analyst pumped his fist.\n\n\"Yes, all the Mjolnir are legendary rated!\" His colleague leaned forward, grinning at the screen.\n\n\"It's a human victory!\"\n\nFor ten days in real time, S.A. Group had been fixated on one thing. They'd watched Grid's item production. Grid created the golden hammer Mjolnir using the Legendary Blacksmith's Creation skill, and it had become a hot topic. Twenty-nine days of game time spent chasing legendary ratings.\n\n\"Hey, I never thought he would accomplish it.\" One of the analysts shook his head.\n\n\"The power of obsession.\" Another stretched back in his chair. \"He destroyed items that took an average of twenty-two hours to make, then did it all over again. I could never do what Grid did.\"\n\n\"Right. It isn't just hammering for twenty-two hours. You have to work with extreme concentration. Is it easy to repeat this dozens of times?\"\n\n\"It's great. I would've given up after the third or fourth time.\" The first analyst tapped his desk. \"Think about it. What if after making an item all day, it isn't legendary rated? The frustration would be huge and crush my mentality. But Grid managed it.\"\n\n\"Hrmm...\" The team leader frowned at her monitor. \"What is the special event that Pagma's Descendant will experience when they make the fifteenth legendary item?\"\n\nThe tenth legendary item removed the item penalties. Obviously, even greater benefits would come at the fifteenth. But they didn't know what.\n\n\"Only Grid and the 1st Development Team knows.\"\n\nThe team leader of the 1st Development Team was Lim Cheolho. His team developed the pivotal settings and stories of Satisfy. Therefore, all the legendary classes except for growth types were produced by this team.\n\n\"Kung...\" The analyst groaned. \"I would ask them but they won't reveal anything. Shit, I'm really curious. Can we only continue to monitor him?\"\n\nOn the screens, Grid was beating Iyarugt inside the game. The operating team admired the power of Mjolnir's high accuracy. Then they clicked their tongues.\n\n\"Grid is going to suffer again.\"\n\nGrid was buying a large amount of enhancement stones from the auction house. The operating team shook their heads. His finger trembled every time he pressed the BUY button.\n\n*This time, Grid will explode.*\n\nIt was natural. Grid had no luck. As usual, he would continue to fail. It would reach the point where S.A. Group talked about raising the probability. Team Leader Yoon Nahee shrugged. \"Hey, we don't know yet. Grid made more than twenty billion won in the National Competition. Would he curse like his old self after a few enhancement failures?\"\n\nAfter a while.\n\n\"...Still the same.\"\n\n\"...\"\n\nIn the video, Grid was half crazy. His anger soared into the sky due to the consecutive enhancement failures. Curses started to fall from his mouth.\n\n\"How pitiful...\"\n\nThe operating team used to enjoy Grid's misfortune in the past, but not now. Now Grid was the pride of South Korea. The honest opinion of the operating team was that they hoped for Grid to keep raising South Korea's stature in the National Competitions. In their minds, they wanted to help Grid directly.\n\nHowever, S.A. Group weren't allowed to intervene in the game in principle. It was impossible systematically as well. Not even Chairman Lim Cheolho could do it. All control was placed in the hands of the supercomputer Morpheus to prevent unintentional manipulation.\n\n\"Eh?\"\n\n\"Ah, it's a complete failure.\"\n\nThe operating team members were saddened. The +6 items failed in succession. Now Grid was trying to enhance the +7 Mjolnir. There was a 99.9% chance of failure when enhancing a +7 weapon. The team members expected that Grid's Mjolnir would drop to +6. But what was the truth?\n\n\"Huh...?\"\n\nThe operating team members sat stunned. Inside the game, Grid was cheering. At this moment, the monitors of the operating team as well as the development teams started flashing red. The signal indicated a major issue had occurred in the game.\n\n> [The ultimate enhancement item has appeared in the game. The ultimate enhancement item has appeared in the game. The player who succeeded in the ultimate enhancement is 'Grid.']\n\n***\n\nThere were a total of fifteen vampire cities. But the Overgeared members only succeeded in clearing seven. There was a possibility that the strongest vampire called Marie Rose would appear in cities 1 through 8. However, the situation had changed. With Braham's help, Grid could figure out the exact location of Marie Rose.\n\n\"She's in the 2nd city?\"\n\n*Yes, there's no possibility of her appearing in another city.*\n\n\"Okay. Then I will start from the 8th city in an orderly manner.\"\n\nSouth Korea was ranked second overall in the National Competition. Their players received a 27% experience buff for a fortnight. The whole nation benefited from Grid's actions. But Grid had gone to Siren and was then focused on making items. He didn't see any benefits from the buff. He hadn't been able to hunt once. Now there were only two days remaining for the buff. He thought it was a waste.\n\n\"Well, I would've chosen this result.\" \n\nGrid had made four legendary rated Mjolnirs, and one of them was the ultimate enhanced weapon. He felt positive. There were no regrets about his choice. It was natural since the results were good. Grid crossed the desert and reached the entrance of the 7th city. Then he checked the rankings window.\n\nAfter the National Competition, the rankings had gone through a big upheaval.\n\n1st. Chris.\n2nd. Mando.\n3rd. Red\n4th. Agnus.\n5th. Fang.\n\n*Who are Red and Fang?*\n\nZibal had recently disappeared from the rankings. It was estimated that he had acquired a hidden class. The 1st ranked Kraugel and 2nd ranked Zibal had disappeared. Chris naturally took the first place. Mando, the previous 4th, was in second place and Agnus in fourth place.\n\nGrid didn't know who Red and Fang were.\n\n*Unofficial rankers?*\n\nThere were many unofficial rankers high enough to threaten the existing rankings. Grid was one of them. No, he wasn't one of them.\n\n*Right now, my level isn't even in the top sixty.*\n\nWhile he stayed in the smithy, the rankers were enjoying the experience buffs of their country and raising their levels. The gap had widened considerably. Yet Grid judged that there was no problem. No, he saw this as a good situation.\n\n\"It's time to show off.\"\n\nIt was natural to aim for the number one spot. In addition, Grid wanted to show his process to the whole world.\n\n\"Ranking registration.\"\n\n> [Disabling the informal ranking will reveal your level to all players. Is it okay?]\n\n\"Of course it's fine.\"\n\nGrid checked the +7 Sword Ghost, the three +7 Mjolnirs and the +10 Mjolnir before entering the 7th city.\n\n***\n\n\"Eh?\"\n\n\"Grid! Grid registered in the rankings!\"\n\nGrid turning off his unofficial ranking became a hot topic in the world. The international media and players started to show a high interest in Grid.\n\n\"Why would he register in the rankings?\"\n\n\"He wants to brag about the level he reached from the buff.\"\n\n\"Isn't his level surprisingly low? It's only 306.\"\n\n\"Only seventy-sixth rank... I guess his levelling ability is bad.\"\n\nGaming skills naturally included the levelling ability. People couldn't deny Grid's strength, but his overall rating lowered due to his level. In particular, the netizens who were envious of those better than them started to pay attention to Grid.\n\n**-If I was Grid, I would be the 1st ranked player by now. ㅉㅉ**\n\n**-He's weak in games ㅋㅋ Only relying on items.**\n\n**-No, is that right? How can a person who can't play the game get five medals in the National Competition?**\n\n**-Then why is Grid's level so low?**\n\n**-I guess he was too busy to hunt.**\n\n**-Bullshit. The most basic content of a game is hunting, but he can't hunt because he is too busy. ㅋㅋㅋ Grid just can't play games.**\n\nDidn't Grid foresee this situation? Why did he bother registering on the rankings now when he would be targeted?\n\n\"Why is Grid doing this? Did he eat something bad?\" Vantner scratched his bald head.\n\nLauel laughed at Vantner's words. \"He's trying to make an impact.\"\n\n\"...?\"\n\nVantner couldn't imagine that Grid, who was only level 306, was aiming for the top of the rankings. 99.9% of the world couldn't imagine it. But those who knew Grid's capabilities and potential realized Grid's intent. One of them was Kraugel.\n\n\"This is a problem.\"\n\nAfter his mother's health improved, Kraugel was once again able to enjoy the game with a pure heart. He laughed as he tried to regain the throne of the first ranked user. Well, it seemed like it was going to be difficult to regain the throne. Then he received a whisper from Hao.\n\n**-Kraugel, are you still in Paonel Swamp? Do you want potions?**\n\nAfter the National Competition, Kraugel unintentionally formed a force. Hao, Alexander, and numerous high rankers followed him. No, it happened because Kraugel's personality changed. The old Kraugel would've stopped people from approaching him, but he couldn't do that anymore. It was due to Grid's influence. Kraugel watched Grid playing and enjoying the game with his colleagues. His thinking gradually changed.\n\n\"What? This weak expression? Isn't it out of place?\"\n\nIt happened when Kraugel smiled pleasantly. He was about to reply to Hao's whisper. A man with a haircut similar to a soldier appeared before Kraugel.\n\n\"You haven't reached level 120 yet? This is a good opportunity. I will kill you often in the future.\"\n\n\"Luck...!\"\n\nKraugel was upset. He never imagined that he would encounter one of the war god's soldiers in this low level hunting ground.\n\n\"Haha, the sky Kraugel can make this expression?\" Luck laughed like it was funny. He moved.\n\nPeeok!\n\nIt was in an instant. Luck's fist struck Kraugel's face. Nine-tenths of Kraugel's health gauge disappeared in one blow."
}