{
  "id": 49,
  "title": "Chapter 49",
  "content": "# Chapter 49\n\nGrid and Euphemina fled through the dungeon corridors, their footsteps echoing behind them. Euphemina's memorization of the first and second floors paid off. They reached the surface without a single wrong turn.\n\nSunlight hit Grid's face. He squinted against the brightness, then stumbled forward onto the lawn outside the tower entrance. The blue sky stretched overhead. Green grass crushed beneath his boots.\n\n\"Hahahahat! We escaped the castle!\"\n\nHe threw his arms wide. The tower entrance sat between two watchtowers on the eastern wall. Guards stood in those towers. Euphemina glanced up at the silhouettes above them.\n\n\"Be quiet. We are still in the middle of enemy territory.\"\n\nGrid didn't hear her. He was already lying flat on the grass.\n\n\"Kya! Look at this clean air!\" He rolled onto his back. \"The humid air in the dungeon was so bad! I thought my lungs were rotting away.\" Another roll brought him face-down into the grass. He inhaled deeply. \"Air is important! I finally understand why city people are so excited about the air in the countryside!\"\n\n*He's completely out of control.*\n\nEuphemina pressed her fingers against her temple. Most of the soldiers were defeated, yes. But the lord's bodyguards remained. They weren't knights, but they were far stronger than ordinary soldiers. She had no desire to face them. Not when they could delay her long enough for those knights to emerge from the dungeon.\n\n\"Hey Grid.\" She kept her voice level. \"We need to leave this place as secretly and quietly as possible, so be a bit more quiet.\"\n\n\"Hah! The smell of the grass is so clear and refreshing!\" Grid buried his face deeper into the lawn. \"The nice scent of pine needles!\"\n\n\"......\"\n\nHer eye twitched. She counted to three. He kept sniffing the grass like a dog. She counted to five. He rolled again.\n\nEuphemina strode forward and grabbed his collar. She yanked him upright and shoved her mouth against his ear.\n\n\"You! Didn't I tell you to be quiet? Don't you have a brain? We are in the middle of enemy territory! We should be running away from this dangerous territory, so why are you making noise while rolling around!!! Yes?\"\n\n\"Aaaagh!\"\n\nGrid clapped his hands over his ears. His eyes watered. He scrambled backward, twisting to break free from her grip.\n\n\"You, don't embarrass me anymore by acting like a fool.\" Euphemina released him with a shove. \"Don't you want to leave this damn place? So do it properly. If you act so stupidly again, I really will kill you.\"\n\nShe knew Grid's class rating exceeded hers. He wasn't weak. But watching him roll around like a child made her blood boil.\n\nGrid rubbed his ear. *She's actually going to kill me.* He opened his mouth to apologize, then froze. His gaze shifted to the right.\n\n\"There... are they enemies?\"\n\nSomething in his voice made Euphemina turn. Her stomach dropped. Sixteen bodyguards in full plate armor approached in formation. Their movements were synchronized. Professional.\n\nChaeeeeeng!\n\nSunlight flashed off their drawn swords. Sixteen points of light danced across the castle walls.\n\nGrid scowled at her. \"Look what this angry girl did... You caused such a big fuss that the enemies emerged.\"\n\n\"This is because you were loud first!\"\n\nEuphemina's hand drifted toward her weapon. Grid went pale.\n\n\"S-Sorry, I was wrong. It was a slip of the tongue.\"\n\n*What type of concept is he trying? Why does he keep acting afraid of me?*\n\nEuphemina replayed their encounters in her mind. Grid had defeated the Northern Nova in single combat. He'd overwhelmed four knights with his presence alone. She hadn't seen him fight directly, but the evidence was clear. Grid was strong. The type of man who shouldn't fear anything in Satisfy.\n\nHer eyes narrowed. *This guy is playing with me.*\n\nThe humiliation from their first meeting burned fresh in her memory. He'd looked right through her beauty at the item production game. Worse, he'd called her kid. Fox. And now he blamed her for his mistakes?\n\n*I want to forget this man exists.*\n\nA figure pushed through the bodyguards. Middle-aged, draped in silver and gold cloth. Baron Lowe's face was flushed red.\n\n\"To have reached here... did you get rid of all the soldiers and knights? Ha...hahaha! I can't believe it!\"\n\nHis laughter cracked. Hysteria leaked through. He'd lost his entire army to one intruder and one escaped prisoner.\n\n\"The people can't be controlled without the army.\" Baron Lowe's hands trembled at his sides. \"Now I have no way of stopping people from going to Earl Steim. Thus, Earl Steim will find out about my actions and my life is ruined.\"\n\nHis face twisted. Rage replaced hysteria. He jabbed a finger at Grid and Euphemina.\n\n\"Catch them! Tear apart all their limbs and make it so that they can't close their eyes!\"\n\nThe sixteen bodyguards moved. Their formation was tight enough to challenge a knight. It didn't matter.\n\n\"Demon King's Tail Fire.\"\n\n\"Ack?!\"\n\nThe bodyguards groaned in unison. Their armor began to glow. Red spread across the metal plates. Then blue.\n\nHwaruruk!\n\nBlue flames erupted from each body. The fire climbed higher, consuming flesh and metal alike.\n\n\"Aaaagh!\"\n\n\"W-What is this...? Kuack!\"\n\nThe screaming stopped quickly. Ashes drifted across the lawn where sixteen men had stood.\n\n\"Wow.\"\n\n\"T-This is ridiculous...\"\n\nGrid and Baron Lowe stared at the ash piles. Their faces matched, pale and slack with shock. Euphemina smiled. The tension in her shoulders finally eased.\n\n*Indeed, the lord's guards are very strong. Their experience is pretty good.*\n\nGrid watched her smile. *I need to avoid this evil girl...*\n\nBaron Lowe's thoughts ran parallel. *Demon. She is a demon.*\n\nEuphemina walked over to Baron Lowe. She grabbed his collar and bound his wrists with rope from her inventory. He stumbled behind her like a dog on a leash as she dragged him toward the castle exit.\n\n*I must never touch this woman again.* Grid followed at a safe distance. *I won't be able to survive if I do.*\n\nThe knights never emerged from the dungeon. Perhaps Huroi had kept them busy. They crossed the castle grounds without incident and reached the main gate.\n\nA man waited outside with ten companions. Rabbit. His arms were folded across his chest.\n\nBaron Lowe's face brightened. \"Ohh! Aren't you Rabbit? You heard the news and came to rescue me!\"\n\n*This... are they soldiers from the Mero Company?*\n\nGrid's hand moved toward his weapon. Euphemina strode past him toward Rabbit. She looked over his companions.\n\n\"These are the people you mentioned earlier?\"\n\nRabbit nodded. \"That's correct. They originally followed Valmont but became disappointed with his brutality. They won't hold you back.\"\n\n\"They do look strong. Great. I can count on them.\"\n\nThe conversation was casual. Familiar.\n\n*Why are the two of them so close?* Grid's mind raced. *Wait, wasn't Euphemina hired by the Mero Company in the first place? Then why? Maybe Euphemina saving me was a trap!*\n\nThe logic assembled itself in his paranoid mind. Winston's lord and the Mero Company were allied. Euphemina was hired by the Mero Company. Therefore, Euphemina was the lord's ally. Therefore, Euphemina was his enemy.\n\nNever mind that she'd killed the lord's soldiers. Never mind that she was dragging Baron Lowe around like a prisoner. Never mind that she'd returned Grid's unique dagger instead of selling it. Grid's anxiety drowned rational thought.\n\n*It is the end... I really can't easily trust a black-bellied animal like her! I showed her some goodwill, only to be duped!*\n\nHistorical dramas flashed through his memory. Betrayals. Plots. He clenched his jaw.\n\n*I won't obediently let her kill me. I wanted to be more careful about my stat distribution, but it can't be helped.* \n\n\"Status window.\"\n\nThe translucent screen materialized before him.\n\n> **Name:** Grid  \n> **Level:** 45 (3,400/238,000)  \n> **Class:** Pagma's Descendant  \n> * The probability of adding additional options when making items will increase.  \n> * The probably of item enhancement will increase.  \n> * All equipment items can be worn unconditionally. However, there is a penalty depending on the rating of the item.\n> \n> **Title:** One who Became a Legend  \n> * Abnormal conditions don't work well on you.  \n> * You won't die when health is at the minimum.  \n> * Easily acknowledged.\n> \n> **Title:** First Unique Item Maker  \n> * Dexterity +200\n> \n> **Title:** Knight Slayer  \n> * Stamina +100  \n> * Strength +30\n> \n> **Title:** Apostle of Justice  \n> * All stats +10  \n> * The Apostle of Justice's bravery is unmatched.\n> \n> **Health:** 2,964/2,964 **Mana:** 243/243  \n> **Strength:** 166 **Stamina:** 244 **Agility:** 118 **Intelligence:** 91  \n> **Dexterity:** 391 **Persistence:** 82  \n> **Composure:** 66 **Indomitable:** 74 **Dignity:** 66 **Insight:** 66  \n> **Courage:** 10  \n> \n> **Stat Points:** 240  \n> **Weight:** 842/4,960"
}