{
  "id": 490,
  "title": "Chapter 490",
  "content": "> [You have suffered fatal damage!]\n> [You have become 'stunned'.]\n> [You have resisted.]\n\nPain lanced through Kraugel's body. Nine-tenths of his health vanished in a single strike. He bit down on a grunt and threw himself backward. His boots scraped across stone.\n\nLuck didn't follow. He stood there, hands loose at his sides, watching.\n\n\"Level reset and stun resistance.\" Luck tilted his head. \"Did you obtain a legendary class? In particular, it's likely to be the first tier **Sword Saint**. Oh my, I need to tell Brother Ares to grow to the legendary rating quickly.\"\n\nThe top players performed more quests than regular users. Their information networks ran deep. The Ares Guild specialized in city invasions and conquest, which gave them access to old literature most players never saw. They'd already pieced together the mechanics of legendary classes.\n\nLuck clicked his tongue. \"Well, it was somewhat expected. Still, it's shocking that the immortal passive wasn't activated. Did you collect around 20 titles?\"\n\nEven accounting for titles that boosted health and defense, the math didn't add up. Luck was level 335. Kraugel had barely crossed level 100. The fact that a single punch hadn't killed him was absurd.\n\nKraugel's face smoothed into an expressionless mask. \"I'm not weak enough to fall because of a swordsman's punch. You have to pull out a sword to knock me down.\"\n\n\"Hahat, now you feel like Kraugel.\" Luck grinned. \"That's right. Kraugel is prideful. It's because of this that people call you the sky above the sky. Do you know why I came?\"\n\n\"It is funny to ask me that after attacking randomly. Don't you want my head?\"\n\n\"Yes, I am going to take your head. Not just this time, but hundreds of times.\"\n\nKraugel's eyes tracked the terrain. He catalogued exits, sight lines, terrain features. *There's no way other than to use that rock.* A single outcropping rose from the center of the swamp. Eleven meters away. If he could reach it using **White Light Steps**, he might escape. Movement speed dropped by 90% in swamp terrain. Once he made it across, Luck wouldn't be able to follow.\n\nThe problem was distance. Two consecutive uses of **White Light Steps** would cover it. But his mana pool was pathetic at this level. Not enough for two activations.\n\n*I need to take a mana potion the moment I use the first White Light Steps.* \n\nPulling an item from inventory mid-air while executing footwork. Among the top ten players, only four could manage it. But Kraugel had to do it in 0.7 seconds. Any slower and he'd drop into the swamp between the first and second dash.\n\nLuck sighed. \"I'm sorry. This is cowardly. Trying to keep you in check when you're weakened. It's truly shameful.\"\n\nKraugel said nothing.\n\n\"But you must understand my side. I can't just sit back and watch you become a threat to Ares. Three months. Endure it for three months. I will kill you for only three months.\"\n\nThree months of constant harassment. No hunting. No leveling. It wasn't unusual. Organizations specialized in crushing high-value targets. When Kraugel first rose in the rankings, multiple guilds had tried to kill him before he became unstoppable.\n\nBack then, Kraugel had been stronger than anyone. He'd crushed them all. But now he was weak. In time, he'd surpass his former self. Right now, though, he was only level 109. Compared to Grid's year-long crawl to level 89, Kraugel had blitzed through to 109 in a fortnight. But that didn't matter when someone like Luck was standing over him.\n\n\"What? There isn't any shaking at all? Haven't you thought about begging?\"\n\nLuck squinted at Kraugel's unchanging expression.\n\nKraugel asked, \"Are there any tigers who would shake because a dog is barking?\"\n\nLuck's face twisted.\n\nKraugel moved.\n\nHe activated **White Light Steps**. His foot slammed into the ground. The skill angled him toward a shaft of sunlight breaking through the canopy. At the same instant, he triggered **Stealth**. One second of invisibility. It was enough.\n\n\"What—\" Luck jerked his head around, scanning.\n\nKraugel ripped a mana potion from his inventory. He drank as he fell. The liquid burned down his throat. His mana bar spiked. He activated **White Light Steps** again mid-air.\n\n*Swaeeeek!*\n\nHe shot across the swamp. The rock loomed ahead. His boot reached for the stone surface when Luck's voice cut through the air.\n\n\"Oh my, amazing. I should've expected this much.\"\n\nSteel rang. Luck's sword cleared its sheath. Red aura stretched out in a blade of light, racing toward Kraugel.\n\n*Kwa kwa kwa kwang!*\n\nThe swamp erupted. Water geysered where the aura passed. If the depth had been any greater, a tidal wave would have formed.\n\nKraugel threw himself backward. The aura hissed past the tip of his nose. Behind him, a tree exploded into splinters.\n\nThe rock shattered.\n\nFragments tumbled through the air.\n\n\"Hahat!\"\n\nLuck's laugh echoed across the water.\n\nBut Kraugel didn't fall. His stats were inferior. His level was a joke. But his control transcended the system. His boot caught a spinning fragment. Then another. He ran across the falling stones like stairs, each step launching him forward until his feet hit solid ground on the far side.\n\n\"What?\" Luck stared.\n\nKraugel turned. He put distance between himself and the swamp. \"Once I recover my strength, I will surely repay today's debt.\"\n\n\"Eek!\"\n\nLuck fired another aura blade.\n\nKraugel triggered **Super Sensitivity**. The world slowed. He read the aura's trajectory like text on a page. He sidestepped. The energy screamed past him. He was already gone.\n\n\"Damn! Where can I learn how to do that?\"\n\nLuck's scream faded behind him.\n\n***\n\nKraugel stopped running once the swamp was kilometers behind. He pulled up his status window.\n\n*Too dangerous.*\n\nHis **stamina** bar was nearly empty. Red digits blinked at the edge of his vision. This was the reality of low levels. No margin for error.\n\n*It can't be helped.*\n\nHe initiated logout.\n\nThe sky above the sky, running away. Some people might be shocked. Kraugel didn't care. Unlike what people thought, he wasn't invincible. He'd been defeated before. He'd run away before. Usually from NPCs and monsters. He'd only lost to a player once.\n\n***\n\nThe capsule hissed open. Kraugel blinked against the light of his apartment. Morning sun streamed through the windows. He climbed out. His muscles ached from the tension, even though his real body had been lying still.\n\nHe walked to the kitchen and stopped.\n\n\"Mother? You woke up early.\"\n\nHis mother stood at the stove, stirring something in a pot. She turned. Her smile was warm enough to melt ice.\n\n\"I want to cook the son I love breakfast.\"\n\nKraugel swallowed. \"Leave this to the housekeeper. Why are you doing this yourself?\"\n\n\"Because I want to.\"\n\nHe nodded slowly. \"Thank you.\"\n\n*Thank you, thank you again.* She was fighting her illness. Every day was a battle. And Grid. The Overgeared members praying for her recovery. Kraugel owed them all.\n\nWhich made him think of Grid.\n\n*If Ares' forces continue expanding this way, they'll clash in a year.*\n\nOvergeared was the strongest guild. But Ares wasn't a guild. It was an army. Systematic. Disciplined. Powerful soldiers with unified tactics. Ares himself had a wide-area buff passive that functioned on battlefields, a fraudulent power that tilted entire wars. And subordinates like Luck and Scott had threatened Kraugel in the past.\n\n*Luck is a level below Scott, but he has that passive.*\n\n**Unconditional Counterattack**. An absolute skill. One hundred percent chance to counter any hit. Unavoidable. It would shred the Overgeared members, who relied on overwhelming attack power.\n\n*In the end, I must grow quickly.*\n\nKraugel felt sorry. He had no intention of joining Overgeared. But that didn't mean he couldn't help. He could contain Ares' forces. Kraugel made a vow. Ares' **Plundering** skill would never target Grid or Overgeared.\n\n*Before that, my position is a problem.*\n\nHis mother set a bowl in front of him. Steam rose from the stew. Kraugel lifted a spoonful to his mouth.\n\n*Mother's taste. It's still the same.*\n\nHe blinked. Looked at his mother.\n\n\"Mother, you should really leave the meals to the housekeeper.\"\n\nShe had no talent for cooking.\n\n***\n\nLuck dragged himself out of the swamp. Mud caked his boots. He scanned the forest. *Kraugel's agility and stamina are low. He can't have gotten far.* He started searching.\n\nNo trail. No footprints. Nothing.\n\n\"It seems like he logged out, but I can't figure out the location. Erasing all traces, isn't this at the level of an assassin?\"\n\nNo. There was nothing impossible for Kraugel. He was too universal.\n\n*Nevertheless, Kraugel is dangerous. We can't leave him alone. But it will be hard to keep him in check with me alone. I need more people.*\n\nWhy was Luck doing this? Because he'd learned the hard way. In the past, Ares invaded a small town. Kraugel received a defense quest. Grabbed their ankles. Luck realized then that power was dangerous simply by existing.\n\nSo Luck wanted to stop Kraugel from recovering. At minimum, slow him down. All for the sake of the Ares Empire.\n\n***\n\nJapan.\n\nDamian sat across from a reporter. Lights glared in his face. He normally refused interviews. Today was different. The topic involved Grid.\n\nThe reporter leaned forward. \"Why do you think Grid registered in the rankings now?\"\n\n\"It's proof. Grid is going to prove that his leveling speed is faster than others and show his greatness.\"\n\n\"Does it make sense to say that Grid's leveling speed is fast?\"\n\nThe reporter tapped his tablet. \"According to the report of an anonymous Korean player who partied with Grid at the siege, Grid was level 306 during the 2nd National Competition. It has been 16 days since then. His level is still 306. Doesn't this prove his leveling speed is bad?\"\n\nKorea was ranked second in the competition. They'd earned a massive 27% experience buff. New hunting grounds for level 300 players had opened across the continent. In that environment, Grid hadn't gained one level in 45 days of game time. Most players would gain at least three levels in that period.\n\nDamian asked, \"Isn't Grid currently level 307?\"\n\n\"Huh?\" The reporter blinked. \"Wasn't it 306 this morning? Ah, he must've accumulated a lot of experience before registering in the rankings. It explains why his level went up in just half a day.\"\n\nThe reporter nodded to himself, satisfied with his own interpretation.\n\nDamian hummed. \"You want to deny Grid's greatness, but I will tell you one truth.\"\n\n\"Truth?\"\n\n\"The 1st place in the rankings will be occupied by Grid.\"\n\n\"Ah, yes.\"\n\nThat evening, Damian's interview hit the internet. Japanese websites exploded. Damian was accused of being a Grid otaku who didn't know the world."
}