{
  "id": 491,
  "title": "Chapter 491",
  "content": "Grid jabbed his finger at the golden hands floating before him. \"Understood? First, Number 1 must attack no matter what. You attack the enemy and lock them down for 0.3 seconds. Certain victory! Got it?\"\n\nHe had numbered every God Hand to tell them apart and speed up commands. The one wielding the <span class=\"rarity-legendary\">+10 Mjolnir</span> was Number 1. The so-called Captain waved its finger in acknowledgment. \n\nIts middle finger.\n\nGrid's jaw tightened. He knew the God Hands had no malice, so he let it pass.\n\n\"Number 2, 3, and 4, you hit the target after Number 1. One after another. Just keep hitting. Infinite stiffness! Clear? This is standard procedure against strong enemies.\"\n\nThe God Hands equipped with the <span class=\"rarity-legendary\">+7 Mjolnirs</span> were 2, 3, and 4. The soldiers responded with their own fingers. Also the middle ones. Grid watched them repeatedly bend and straighten their middle fingers. His temper frayed.\n\n\"If it's going to be like this...\"\n\n*They need better education.* Grid set a new rule: use only against enemies. He taught the God Hands to taunt targets with that specific finger. His petty nature was showing.\n\nBraham broke the silence. *Why attack the 7th city? You haven't cleared the 9th or 8th yet.*\n\n\"Don't you know the 9th city has three floors? Tiramet was just the first floor boss. There's clearly more True Blood vampires on the second and third floors. Not something I can solo. I'm saving it for when my colleagues can help.\"\n\n*The 9th city was once a fortress. More troops than other cities. They're trivial, but...* Braham paused. *Then the 8th city?*\n\n\"I'll start here, then move to the 8th. Is there some rule that says I have to clear them in order?\"\n\nGrid had chosen the 7th city for a simple reason. Lucky number seven.\n\n\"I feel like I can hit the jackpot here.\"\n\n*That's your reasoning?*\n\nGrid believed in his intuition. *I'm the lucky bastard who got a +10 weapon!* Right now, he was convinced he was a symbol of good fortune instead of the disaster everyone claimed. He burned with enthusiasm as he entered the city.\n\nDarkness. Silence.\n\n**Kuoooooh!!**\n\nThirteen large buildings loomed ahead. Only the cries of birds echoed through the ruins. Each structure looked large enough to house at least five hundred sleeping vampires. Grid pulled up his status window again.\n\n---\n\n> **Name:** Grid  \n> **Level:** 307  \n> **Class:** Pagma's Descendant  \n> **Title:** One who Became a Legend  \n> ...  \n> **Strength:** 2,880 (+160)  \n> **Stamina:** 1,356 (+230)  \n> **Agility:** 2,286 (+130)  \n> **Intelligence:** 1,227 (+340)  \n> **Dexterity:** 3,008 (+680)  \n> **Persistence:** 1,182 (+130)  \n> **Composure:** 768 (+130)  \n> **Indomitable:** 1,023 (+240)  \n> **Dignity:** 1,676 (+130)  \n> **Insight:** 1,516 (+130)  \n> **Courage:** 712 (+130)  \n> **Demonic Power:** 850  \n> **Good Luck:** 1  \n> **Stat Points:** 10\n\n---\n\n\"Huhuhut!\"\n\nThanks to <span class=\"rarity-legendary\">Sword Ghost</span> and the four <span class=\"rarity-legendary\">Mjolnirs</span> all being legendary rating, his stats had jumped by 50 each. The belatedly opened **Good Luck** stat hadn't benefited yet, but that didn't bother him.\n\n*Where should I put these points?*\n\nHe wanted to laugh every time he saw the **Good Luck** stat.\n\n---\n\n> **[Good Luck]**  \n> The likelihood of lucky phenomena will increase.  \n> * The higher the number, the higher the effect.  \n> * Stat points can't be distributed to this stat.\n\n---\n\nLucky phenomena probably meant things like critical hit rate, dodge chance, better item drops, or higher enhancement success rates. Grid felt invincible.\n\n*I'll become the master of combat, luck, and enhancement in the future!*\n\nHe believed this with just 1 point in **Good Luck**. His chest swelled with confidence.\n\nBraham interrupted his fantasy. *Why don't you raise your intelligence?*\n\nThe remaining stat points were irritating Braham.\n\n\"Hrmm...\"\n\nGrid was still torn. Should he balance **Strength** and **Agility** at a 1:1 ratio to become a more devastating swordsman? Or invest the points into **Intelligence** to learn new magic from Braham?\n\n*Isn't it obvious? Raise intelligence. You should learn my great magic first.* Braham had read Grid's hesitation.\n\nNormally, Grid would have ignored him. This time felt different.\n\n*Certainly...*\n\nSince obtaining the four Mjolnirs, Grid could theoretically chain infinite stiffness. The desperate need for high-level swordsmanship had lessened. Magic could make him more versatile.\n\n*I don't know.*\n\nStat distribution couldn't be reversed. Plus, Braham's magic was uncertain. His **Intelligence** needed to reach at least 2,000 to learn even basic spells. He couldn't commit that much.\n\n\"Intelligence or agility... I'll think about which one to raise later.\"\n\nShould he be a blacksmith swordsman or a magic swordsman blacksmith? He would decide after accumulating more combat experience.\n\nGrid approached the nearest building. Blue moonlight streamed through the cracked ceiling. Hundreds of coffins sat scattered across the floor. Vampires slept inside them. Waking them one by one would make hunting easier, but that was impossible. The vampires woke up the instant they heard noise. Besides, Grid had no intention of hunting leisurely. Fast hunting was the only shortcut to a massive level spike.\n\n\"Okay, let's begin.\"\n\nGrid drew a deep breath and signaled the God Hands.\n\n*Start!*\n\nBraham leaned forward mentally. How overwhelming would Grid be when slaughtering vampires with enhanced weapons? The atmosphere grew solemn.\n\nGrid took action.\n\n\"Item!\"\n\n*...?*\n\n\"Combi!\"\n\n*...??*\n\n\"Nation!\"\n\n*...???*\n\n**Ttang!**\n\n**Ttang! Ttang!**\n\n*...*\n\nGrid suddenly squatted in front of the vampire coffins. He pulled out the portable furnace and started hammering with the God Hands. The serious atmosphere evaporated like water on hot steel. Sitting down alone in enemy territory?\n\n*This person really isn't sane...*\n\nIt was a moment of misunderstanding. Braham didn't know about Item Combination yet. The <span class=\"rarity-legendary\">+9 Failure</span>, which had been Grid's best weapon just three days ago, and the <span class=\"rarity-legendary\">+7 Sword Ghost</span> were reborn at his fingertips. A blue-black blade shaped like a shark. It wasn't stylish, but the power was fearsome.\n\n\"Pagma's Swordsmanship.\"\n\n**Suuuk.**\n\nUnder the moonlight, Grid moved with deliberate grace and performed an advanced sword dance. His eyes shone in the darkness, sharp and steady.\n\n\"Linked Wave Kill.\"\n\n**Kwa kwa kwa kwa kwa kwa kwa kwa!**\n\nBlue and black energies tangled together. A violent explosion shook the earth as energy waves rippled in all directions, blanketing the vampires sleeping in their coffins.\n\n---\n\n> [A junior vampire has been destroyed.]  \n> [A junior vampire has been destroyed.]  \n> [4,931,000 experience has been acquired.]  \n> [4,915,500 experience has been acquired.]  \n> [An intermediate vampire has been destroyed.]  \n> [An intermediate vampire has been destroyed.]  \n> [7,054,300 experience has been acquired.]  \n> [6,998,000 experience has been acquired.]\n\n---\n\nVampires enjoying their sleep inside the coffins died. Dozens screamed without knowing why. Linked Kill Wave only unleashed a total of 8 Kills, but Grid used the explosion to cause massive splash damage. He watched his experience gauge fill rapidly.\n\n\"Good! It's the start of my giant level up!\"\n\n*...Fairly good.*\n\nBraham felt a flicker of admiration. For vampires, coffins weren't just beds. They were protective tools. To ensure their safety during sleep, the coffins had high durability and granted the vampires increased defense. Yet Grid killed the sleeping vampires through the coffin anyway. Braham realized the combination of weapons and Pagma's Swordsmanship was more powerful than he had calculated.\n\nMeanwhile.\n\n\"How dare a human do this?\"\n\n\"Our kinsmen!!\"\n\n\"Rotten bastard! Attacking sleeping vampires!\"\n\nThe vampires woke at the noise. They saw the carnage and erupted with rage. Sharp fangs flooded toward Grid. A True Blood vampire led the charge. He was a noble. Baron-grade True Blood vampire, Kri. His overall stats were weak, but he possessed a massive **5,000 Agility**.\n\n\"Insignificant human! I will kill you when you're unaware!\"\n\n**Peeng!**\n\nKri used a vampire's unique blood magic to boost his speed. He moved so fast that Grid couldn't track him with his eyes. He closed the distance instantly and swung nails sharper than knives. \n\nThe God Hand holding the <span class=\"rarity-legendary\">+10 Mjolnir</span> swung at him.\n\n\"Bah! Slow!\"\n\nKri tilted his head slightly to the side. From his perspective, he was dodging the sluggish God Hand easily. The result was different from what he intended. The Magic Detection (Enhanced) attached to the Mjolnir pursued him stubbornly.\n\n**Peeok!**\n\n\"Keok?\"\n\nJust before his nails pierced Grid's heart, Kri coughed blood and froze. The large golden hammer had struck his back with perfect accuracy.\n\n*W-What is this?*\n\nDidn't he dodge it?\n\n*Why couldn't I avoid such a slow attack?*\n\nKri's confusion lasted half a second. The rest of the God Hands holding the <span class=\"rarity-legendary\">+7 Mjolnirs</span> hit him in succession.\n\n**Peok! Peok! Peok! Peok! Peok!**\n\n\"Ugh! Eek! Keok! Eek! Ugh!\"\n\n---\n\n> [The Ultimate Enhanced Mjolnir has hit the target. The target will become rigid for 0.3 seconds. The target is a demonkin. Further damage is applied.]  \n> [The +7 Mjolnir has hit the target. The target will become rigid for 0.1 seconds. The target is a demonkin. Further damage is applied.]  \n> [The +7 Mjolnir has hit the target. The target will become rigid for 0.1 seconds. The target is a demonkin. Further damage is applied.]  \n> [The target will become rigid for 0.1 sec...]  \n> [The target will become rigid for 0.3 sec...]\n\n---\n\nPerfect. Infinite stiffness. Grid aimed at Kri, who was bleeding from the continuous hammering.\n\n\"Linked Kill.\"\n\n**Puk.**\n\n**Puk puk puk!**\n\n\"...!\"\n\nKri had been jerking his head left and right while getting pummeled by the hammers. A powerful stab penetrated his heart. He couldn't even scream as he died. The cumulative damage from Mjolnir was too great.\n\n---\n\n> [The Vampire Baron Kri has been destroyed.]  \n> [180,909,300 experience has been acquired.]  \n> [The <span class=\"rarity-legendary\">Vampire's Pajamas</span> has been acquired!]\n\n---\n\n*Pajamas?*\n\nGrid had no time to check the item information. The moment the True Blood vampire died, the enraged vampires launched their assault. Grid used Pagma's Swordsmanship, Wave, to strike all the vampires around him and buy time. The God Hands closed in during the gap.\n\n\"Kek!\"\n\n\"Eek!\"\n\n\"Ack!\"\n\nThe vampires became rigid whenever a golden hammer full of divine power struck them. The stiffness effect cancelled offensive motions and skill casting. Under the protection of the Mjolnirs, Grid had an absolute zone of safety around him. An absolute domain where no counterattacks were possible. The efficiency was monstrous. The God Hands consumed no resources. There was no skill cooldown.\n\nThe current Grid was unbeatable in close combat. He slaughtered all the vampires in the 7th city at a rapid pace. It was an ignorant and cruel method of killing with hammers.\n\n---\n\n\"Eh...?\"\n\n\"W-What?\"\n\nThe South Korean media and Internet communities around the world descended into chaos. Grid was level 307 last night. Now he was level 309."
}