{
  "id": 493,
  "title": "Chapter 493",
  "content": "\"Ah, so that's how it is.\"\n\nThe secret behind Grid's leveling speed was the experience buff potion obtained from the Reputation Store. The moment all his potions ran out, his leveling pace would return to normal. By most estimates, that moment was fast approaching. The so-called 'drawing game' had less than a 1% chance of awarding an experience buff potion, making them nearly impossible to stockpile. Grid's supply was finite.\n\nReaders who stumbled across these articles felt a wave of relief. The mystery of Grid's absurd leveling speed was finally solved. After the initial relief, however, came a sense of betrayal.\n\n*-It's good that it's not a bug. The game really is balanced. And God Grid is just a bit ahead.*\n\n*-What ahead? He's just relying on potions in the end.*\n\n*-Class, items, and now potions -_-;; He really only depends on systems.*\n\n*-Based on the article's content, Grid's leveling speed is terrible without the experience buff potions.*\n\n*-He was level 306 during the National Competition and still the same two weeks later.*\n\n*-Without the potions, Grid's ranking would be much lower.*\n\n*-Grid is relying on potions and taking positions away from poor rankers.*\n\n*-Right now it might be unfair, but don't the rankers also have access to the Reputation Store? They can rise too if they obtain experience buff potions like Grid.*\n\n*-Grid will be pushed out of the top 100 rankings ㅋㅋㅋ*\n\n*-Grid might not even be in the top one billion. ㅎㅎ He has an inferiority complex when looking at people better than him. His standards are really low.*\n\n*-In the first place, why is Grid obsessed with the rankings? Didn't he almost beat Kraugel?*\n\n*-No. I would be obsessed with the rankings if I was Grid. No matter how strong you are, what does it matter if you aren't ranked?*\n\n*-Rather than such a simple reason, I think there's significance to being 1st ranked. After fighting so well in the National Competition, he eventually lost to Kraugel. I think he wants to win in the rankings.*\n\n*-He is human garbage ㅋㅋ Trying to take the crown when Kraugel is absent.*\n\n*-I just got goosebumps. Right now, most of the people blaming Grid or talking sarcastically are Koreans.*\n\n*-It seems that the country has forgotten they got the experience buff thanks to Grid being active in the National Competition. Koreans are truly...*\n\n*-Kek? Who knows if Grid fought for South Korea? Grid was purely trying to get rewards and the experience buff. ㅎㅎ*\n\n*-Look at you. Really disgusting.*\n\n*-Don't misunderstand. It isn't all Koreans saying this, just a small number of Korean netizens. What country doesn't have jerks?*\n\nThe Satisfy communities buzzed with Grid's name. Someone stared at the internet, rage building in their chest. Was it the Grid-worshipping Damian? No. Damian had been drowning in Rebecca Church events lately. He had no time for the internet. Then was it the Grid-worshipping Lauel? No. Lauel was buried under Siren-related tasks and didn't care about the internet.\n\nThen who was furious? Sehee. Grid's little sister.\n\n\"Unscrupulous people...\"\n\nSehee understood the nature of netizens. Their cruelty, their mockery. But she couldn't accept it when the target was her brother. He'd raised South Korea's honor, yet their attitude flipped the moment the National Competition ended? Sehee hated and resented the netizens who always treated people like garbage.\n\n\"Of course, I know only some people are like that.\"\n\nStill, it was enough to hurt the person involved. In fact, right now her brother was...\n\n\"Why do I like pork more than beef?\"\n\nGrid finally emerged from the capsule after hunting all day. Sehee's worry deepened as she watched him stuff sizzling pork into his mouth without pause.\n\n*How much stress is he under to binge eat like this?*\n\nHer brother looked like a toad, his cheeks bulging with food. Sehee made a decision.\n\n\"Brother.\"\n\n\"Yum yum. Huh?\"\n\n\"I'll help you.\"\n\n\"Gulp. What?\"\n\n\"Your hunting.\"\n\n\"...?\"\n\nSehee had her CSATs right in front of her. University entrance exams. She should be studying. Why did she suddenly want to help him hunt? Unlike Sehee's worries, Grid was confused. He had no idea about the internet firestorm.\n\n\"Don't you need to study?\"\n\n\"I'm smart. I can get into any university I want without studying any more.\"\n\nShe said this, but Grid knew better. He knew how hard Sehee had been studying her whole life. The source of her confidence wasn't arrogance about her brain, but pride in her effort. He didn't want that effort to go to waste.\n\n\"Cut it out. Don't interfere when I'm in a critical period for raising my level.\"\n\n\"...\"\n\nSehee's heart warmed. He was someone more angry and irritable than anyone she knew. Yet here he was, mature and self-reliant, trying to solve everything alone. It was wonderful and sad at the same time. If he had a girlfriend to rely on...\n\n*What a pity...*\n\nFor her brother who didn't have a girlfriend despite his power and status, she would work hard. Sehee steeled her resolve.\n\n\"No. For me, family is more important than university.\"\n\nDuring the time when her brother was unemployed, she'd made entering a good university her top priority. She'd had to be able to take care of him. But not anymore. She didn't have to be his nest. Now he was the nest, and she had an obligation to protect it until she was independent.\n\n\"I'll show you the power of a Saintess.\"\n\n\"...?\" *What is this?* \"Gulp.\"\n\nGrid couldn't help swallowing his saliva as he saw the determination burning in Sehee's eyes.\n\n***\n\nGrid's plan to attack the 7th city was virtually a failure. He'd beaten the city boss, but it took six hours longer than planned. His leveling speed had slowed to a crawl. Of course, Braham was to blame.\n\n\"If you hadn't destroyed the building...\"\n\n*...*\n\nUnder normal circumstances, Braham would've laughed or become angry at Grid. But he wasn't bold enough to do that after witnessing what Grid had endured while fleeing from thousands of vampires. No, he was brazen enough to do it, just not to Grid. He actually liked Grid.\n\n\"Sigh, truly a troll.\"\n\nWasn't it Braham's fault that he'd been defeated by Kraugel in the National Competition? The fact that Kraugel could treat his mother's illness was good, but Grid couldn't deny Braham's role in his loss.\n\n\"Troll. Troll. Troll.\"\n\nBraham questioned him.\n\n*Troll? Why am I a troll?*\n\nBraham didn't know the meaning of internet trolling. Grid laughed as he recalled the troll monsters.\n\n\"You're slow. You fool.\"\n\n*Do it moderately!*\n\nBraham could no longer tolerate it. If he'd had a body, he would've angrily pulled Grid's hair. While the two argued, they arrived at the entrance of the 8th city. People were waiting to welcome them. Saintess Sehee (Ruby) and Saintess' Knight Yerim (Sexy Schoolgirl).\n\n\"Youngwoo!\"\n\n*This is a high school student?* Yerim, radiating an enchanting atmosphere, came running toward Grid.\n\n\"Ummm...\"\n\nGrid had always seen Yerim as just a 'kid,' but that perception shattered. He could feel that Yerim was a woman. The cause was obvious. The detailed description will be omitted. While Grid reeled from the shock, Braham flinched when he observed Sehee and Yerim.\n\n*What? What is this divine power these girls possess?*\n\n*Be careful how you speak. One of them is my little sister.*\n\n*...What are these women? They aren't Rebecca's Daughters, so why do they have such strong divine power? Furthermore, the shape of this divine power...*\n\nGrid replied to the nervous Braham.\n\n*They're a Saintess and a Saintess' Knight.*\n\n*Saintess!*\n\nBraham was beyond shocked. It was an unexpected reaction for Grid.\n\n*What is it? Is being a Saintess that surprising?*\n\n*Saintess...!*\n\nThe moment Braham wanted to explain, Sehee barely pried Yerim off Grid and urged them forward.\n\n\"Let's go hunting.\"\n\n\"Eh? Ah, yes.\"\n\nGrid, Sehee, and Yerim formed a party immediately before entering the 8th city. Grid's eyes widened when he saw their levels in the party information window.\n\n\"Level 180? Why is it so high? Don't you only play on the weekends?\"\n\n\"Huh? Isn't it easy to raise your level? Of course, it would be difficult to raise it to your level.\"\n\n\"...?\"\n\nIn the past, Grid had only reached level 80 in a year despite spending most of his time playing the game. Ruby and Sexy Schoolgirl barely knew the game and didn't spend much time playing, so their leveling speed gave him a huge shock. Yerim linked her arm with his.\n\n\"Let's go! You have to get on the bus!\"\n\nBus. In online games, it meant high-level players helping low-level players raise their level. The situation felt reversed, but Grid thought it was an appropriate term. When Grid, Sehee, and Yerim were in a party, Grid would monopolize most of the experience from the monsters. It was due to the difference in levels.\n\nSehee and Yerim knew this. They'd joined this party purely to help Grid.\n\n***\n\nPeople learned the secret to Grid's leveling speed thanks to Panda Dagger's analysis. Grid's leveling speed would drop little by little. This was calculated roughly from Grid's reputation and how many experience buff potions he would've obtained.\n\n\"Grid was gaining two levels per day until yesterday.\"\n\n\"Starting today, it might be hard to gain one level.\"\n\n\"Soon his ranking will fall.\"\n\nEveryone was certain. However, the result was different from expectations.\n\n> **[(Breaking News) Grid gained three levels today!]**\n\n\"...??\"\n\nPanda Dagger's reputation as the best hunting expert fell through the floor. No, it crashed into the underworld. Accusations from all over the world poured toward him, and even the Chinese called him an embarrassment. Experts in other fields saw it and clicked their tongues.\n\n\"Yes, you're analyzing Grid.\"\n\nThey'd learned from experience not to apply common sense to Grid.\n\n***\n\n\"Bah, you were negative toward Grid, and in the end, you suffered like this.\"\n\nOne person had been interested in this matter from the beginning and kept watch. He laughed at Panda Dagger. That person was punching bag... No, it was the former 2nd ranked Zibal. He was a true hunting expert, unlike the theory-poor Panda Dagger, and he understood Grid's hunting speed.\n\n*However, it's on the premise that two high-level priests are hired.*\n\nWas it that easy to hire a senior priest from the Rebecca Church? Enormous achievements and money were required just to have the qualifications to hire one. Not even Zibal had achieved it.\n\n*But it's possible for Grid.*\n\nZibal envied Grid. But he wasn't jealous. He focused on his own path. He was confident after gaining a new power. He wouldn't worry. He was looking toward the distant future."
}