{
  "id": 494,
  "title": "Chapter 494",
  "content": "> [You have entered the Vampire's Underground City (8).]\n> [The entrance of the dungeon is blocked. Contact with the outside world will be blocked.]\n> [You can't escape the dungeon until you have died or kill the dungeon boss.]\n\nSehee's eyes widened as she read the system message. \"This is the instant dungeon I've only heard about.\"\n\nYerim glanced around the enclosed space. \"A completely separate space, not tied to anywhere else?\" She grinned. \"I'm glad there will be no other people around.\"\n\n\"There are no men to feel inspired by...\" Yerim's voice turned playful as she leaned closer to Grid. \"Well, it's nice that I won't be disturbed on my date with Youngwoo.\"\n\nGrid tensed at their excitement. *They reached level 180 without entering an instant dungeon?* He frowned. \"Have you done a proper raid?\"\n\nSehee shrugged. \"Our gameplay time was too short. We had to avoid content that required investing a lot of time.\"\n\nYerim smiled. \"I'm glad the first experience is with you. Another first time...\"\n\nGrid raised an eyebrow. \"Yes, I will teach you how to drink next year.\"\n\nYerim's face flushed. \"Ah, that isn't the first time I am talking about.\"\n\nGrid waved dismissively. \"Yes, yes.\"\n\n\"Oof! Oof oof!!\" Yerim stomped her feet and waved her arms after Sehee clamped a hand over her mouth.\n\nGrid couldn't help laughing as he watched them. *It's nice to see they are getting along. I hope they keep this innocence.*\n\n*Idiot.*\n\nGrid stiffened. *What?*\n\nThe insult came out of nowhere. Braham's voice echoed in his mind, and Grid's jaw clenched.\n\nSehee barely managed to calm Yerim down. \"By the way, isn't it very dark?\"\n\nThe city received no light. She couldn't see inside it. In this state, they would be defenseless against monster attacks. Sehee considered using light magic before Grid spoke.\n\nGrid kept his voice low. \"Over time, you will gradually adapt to the darkness. It's easy to become the target of monsters if we turn on the light. It is better to go slowly.\"\n\nSehee nodded. \"I see.\"\n\nBoth girls looked at Grid with admiration, their eyes shining like lanterns in the gloom. The weight of their expectations pressed down on him.\n\n*I'm nervous.* Grid swallowed. *Making a mistake in front of my sister... I have to maintain my pride as the older brother.* He reached out mentally. *Braham, please support me well. Understood?*\n\nSilence.\n\nBraham had been less talkative since entering the city, as if hiding his existence.\n\n*I don't want to scold you. Why are you acting like this?*\n\nBraham had seemed surprised to learn that Sehee was a Saintess. Did he have bad memories involving one?\n\n*Indeed, in the first place, the name of a Saintess is fatal for demonkin.*\n\nGrid moved forward. The monsters that appeared before reaching the city were vampire familiars. Ordinarily, he would move without hesitation. But now, with Sehee and Yerim in tow, he needed to keep them out of danger. Grid slowed his pace, moving as carefully as possible.\n\nSilence stretched between them. Grid led the way while Sehee and Yerim followed without a word. The atmosphere grew heavy, tense. Both girls saw the serious set of Grid's shoulders and understood.\n\nSehee's expression turned grim. *That's right. The monsters here are at least level 300.*\n\nYerim bit her lip. *We might be holding him back rather than helping him. We have to be careful not to be a burden.*\n\nThey controlled their excitement, avoiding anything that would be a nuisance. Both girls matched Grid's cautious focus.\n\nTime crawled forward. As their eyes adjusted to the darkness, the structure of the city came into view.\n\nKyaooooh!\n\nBig-toothed wolves burst from the shadows, their timing perfect. Sehee and Yerim were caught completely off guard. Even some level 300 rankers would panic.\n\nSehee hurriedly raised the <span class=\"rarity-rare\">+7 Wooden Staff</span>. \"Ah...!\"\n\nYerim immediately triggered her skill. \"Sacrifice for Saintess!\"\n\nTheir actions were meaningless. Grid moved much faster.\n\nSeokeok!\n\nPuok!\n\nPeok!\n\nKyaooooh!\n\nPagma's Swordsmanship Level 3. When deactivated, it increased Grid's attack power by 32%, critical attack chance by 22%, and critical damage by 15%. When activated, it allowed skills like Kill, Link, and Transcend.\n\nGrid's swordsmanship was extremely powerful even deactivated. A disaster for targets he judged too weak for active skills. The wolf lunging at Sehee met his blade, and its health plummeted. The pack scattered, fleeing.\n\nGrid didn't miss the experience. The God Hands chased them down and finished them off.\n\nBam bam bam!\n\nThe golden hammers crushed the wolves' skulls like a garlic mill. Blood and bone sprayed. The sight was cruel, overwhelming.\n\nSehee's eyes widened. \"Amazing!\"\n\nYerim beamed. \"A strong monster defeated so easily! So cool!\"\n\nGrid shrugged. \"They're pretty weak. They're the familiars of the weakest vampires living in the city.\"\n\nThe real fight came after entering the city.\n\nGrid glanced back at them. \"I will protect you. Don't fall too far behind. Stick together and follow me.\"\n\nSehee and Yerim's expressions stiffened simultaneously. They realized they were already a burden to Grid. Unacceptable. They came here to help him, not interfere.\n\nSehee straightened. \"No. You just need to look ahead.\"\n\nYerim's voice was firm. \"We will take care of ourselves. You just need to hunt.\"\n\nThey weren't weak people who couldn't understand the situation. Sehee had the passive skill Upright Heart, blocking access to demonkin and undead. Saintess' Knight Yerim had strong attacks to hold off enemies. At the very least, they could protect themselves.\n\nBesides.\n\nSehee raised her staff. \"The vampires won't be able to pay attention to us. Holy Weapon. Holy Impact. Holy Armor. Holy Explosion.\"\n\n> [Divine damage has been added to party leader 'Grid.' This will last for 5 minutes.]\n> [Divine splash damage is applied every time party leader 'Grid' attacks. This will last for 3 minutes.]\n> [Additional defense against evil will be added to party leader 'Grid.' This will last for 5 minutes.]\n> [There will be an explosion of divine fire every time party leader 'Grid' attacks. This will last for 2 minutes.]\n\n*Splash damage? Explode?*\n\nThe effects differed from Huroi's buffs in several ways.\n\n*Well... I can't expect much.*\n\nSehee was only level 180. An excellent healer due to percentage healing, but as a buffer? He kept his expectations low. The additional bonus damage in his status window showed only 500. A fixed 500 damage to undead and demonkin per attack. Cumulative damage added up, but it lacked dramatic impact. Honestly pathetic compared to the 3,800 divine damage of the <span class=\"rarity-legendary\">+10 Mjolnir</span>.\n\nBut he wasn't disappointed. Just grateful that his sister thought of him and worked hard.\n\nGrid entered the city. \"Then I'm starting.\"\n\nHe stood before a building resembling a cathedral. Around 400 coffins filled the interior. Fewer than the 7th city's buildings, which held at least 500 coffins.\n\n*This is better.* Too many vampires made it difficult to protect his sister.\n\nGrid acted without hesitation. \"Pagma's Swordsmanship.\"\n\nTo reduce as many vampires as possible while they slept, he used Linked Kill Wave.\n\nKwa kwa kwa kwang!\n\nThe vampires sleeping in their coffins received a storm of damage. Many died. The others woke and flew at Grid.\n\nGrid brandished his sword as usual. Then stopped.\n\n> [You have dealt 6,730 damage to a junior vampire.]\n> [The effect of Holy Impact deals an additional 500 damage to all 'evil' targets within 5 meters of the target hit.]\n\n\"Eh...?\"\n\nSplash damage typically had a narrow range. Natural balance. Convenient wide area damage attacking multiple enemies without loss? A complete scam. The balance would collapse.\n\nSehee's Holy Impact could collapse that balance. Currently, she only added 500 holy damage. But if she raised the skill level to deal damage in the thousands?\n\n*Dealing wide area damage with every hit? It's crazy. Really crazy.*\n\nA vampire approached while Grid processed this. Its claws raked across him.\n\nPuok!\n\n> [You have suffered 3,300 damage.]\n> [The target that attacked is evil. Holy Explosion will return half of the damage received.]\n\nPeeng!\n\nThe vampire who attacked Grid suffered a sudden explosion of light. \"Kyaak!\"\n\nGrid stood unharmed.\n\n> [Saintess Ruby has restored your health.]\n\n*This is a scam.*\n\nNot because she was his sister. Objectively, he'd been mistaken about Saintess Sehee's value. Badly mistaken.\n\n> [Saintess Ruby has used Holy Weapon and Holy Impact on the God Hand (1).]\n> [The God Hand (1) has attacked a junior vampire.]\n> [The effect of the Ultimate Enhanced Mjolnir has dealt 3,800 divine damage to the target.]\n> [The effect of Holy Weapon has dealt 500 divine damage to the target.]\n> [The effect of Holy Impact deals an additional 3,800 + 500 damage to all 'evil' targets within 5 meters of the target hit.]\n\n\"...Hiccup!\"\n\nThe result of adding a Saintess's power to the God Hands was devastating. Remarkable enough to break the common sense of 'common sense destroyer' Grid. He hiccupped in surprise.\n\nPeng!\n\nPepepepeng!\n\nOnce Holy Weapon and Holy Impact were granted to the God Hands, they ran wild, slaying vampires. Grid's hunting speed became at least six times faster in that moment."
}