{
  "id": 495,
  "title": "Chapter 495",
  "content": "Grid watched the hammers swing through the air. *Unconditional wide-area divine damage. Perfect.*\n\nHoly Weapon tagged every strike with 500 points of pure divine energy. But Holy Impact took it further. One hundred percent of that divine power splashed out in a five-meter radius, burning every evil target it touched. The math was brutal. Every time Mjolnir crushed a vampire's skull, four to nine more caught fire from the divine radiation alone. One blow, multiple casualties.\n\nThe system had restrictions, of course. Targets needed to register as evil. The wielder needed divine power coursing through their veins. Grid checked both boxes. So did the vampire city. So did Mjolnir.\n\nEverything aligned.\n\n\"Kyaak!\"\n\n\"Kuaaaak!\"\n\nKwang!\n\nKwa kwa kwang!\n\nWhite light erupted with each hammer swing. The vampires screamed. Their confusion tasted like copper on Grid's tongue.\n\n\"What is this...?\"\n\n\"There's no access!\"\n\nThree invaders versus four hundred vampires. The numbers should have buried Grid and his companions under a tide of fangs and claws. But the vampires couldn't coordinate. Every time one fell, their neighbors dropped in sympathetic agony. Blood pooled. Formation crumbled. The math refused to work in their favor.\n\nThe true blood vampire Tigol hung back. Her gaze locked on Sehee.\n\n*That human is the problem. Easily solved.*\n\nIf approaching was difficult, attack from range. Simple tactics for simple problems.\n\nPachichik!\n\nA sphere of blood condensed in the air. It shot toward Sehee.\n\nPeeng!\n\nThe projectile moved like a bullet. One moment it materialized behind enemy lines. The next it was three feet from Sehee's face. The girl's eyes widened, but fear didn't touch her features. She trusted Yerim.\n\n\"Yap!\"\n\nYerim threw herself into the path. The blood sphere slammed into a brilliant silver shield. Grid's craftsmanship. An improved Divine Shield with exceptional magical resistance layered into every inch. But the true blood vampires in the 8th city averaged level 350.\n\nYerim was barely level 180.\n\n> [The attack has exceeded the damage absorption ability of the <span class=\"rarity-rare\">Small Divine Shield</span>!]\n>\n> [Only 5,800 damage has been absorbed!]\n>\n> [The durability of the <span class=\"rarity-rare\">Little Divine Shield</span> has dropped to 190!]\n>\n> [Lofty Will has been activated. You have avoided death.]\n>\n> [You have suffered 13,050 damage.]\n>\n> [You have received a lot of damage with one blow and have fallen into the 'stunned' state.]\n\n\"Ugh.\"\n\nPain lanced through Yerim's body. Less than one-tenth of her health remained. The high-level hunting ground was chewing them up. She tried to move, tried to keep Sehee protected, but Youngwoo was drowning in vampires on the other side of the room. He couldn't help.\n\n*I must...*\n\n\"Ignorant human girl! Receive my magic!\"\n\nTigol's fury manifested as two blood spheres this time. Both tracked toward Sehee.\n\n*No...!*\n\nA Saintess wasn't invincible. Buffs, heals, support. Those were her strengths. Defense was her weakness. The Saintess' Knight covered that gap. But Yerim was stunned. Paralyzed. Useless.\n\nSehee had burned her mana buffing Grid and the God Hands. Her pool sat at zero. Discipline could cleanse status effects. Hope could restore health. Neither skill would answer her call without mana. Both girls faced death. Their inexperience showed like an open wound.\n\n\"Why did you use so much mana? You should always leave some behind to handle emergencies.\"\n\nThe blood spheres closed the distance. Sehee squeezed her eyes shut. Yerim did the same.\n\nGrid's voice cut through their panic.\n\n\"Oppa!\"\n\nTheir eyes snapped open.\n\nPepepepeng!\n\nGrid stood between them and the attack. The blood spheres detonated against his armor.\n\n\"No!\"\n\nHe took the hit. Protected them. Blood misted from the impact site. The explosion painted his armor red. Guilt and helplessness crashed over both girls like a physical weight.\n\nGrid's hand settled on Sehee's head. Then Yerim's. The gesture was gentle despite the violence still raging around them.\n\n\"Don't worry. This much isn't anything to be afraid of.\"\n\nThe Holy Light set minimized magic damage across every piece. Two blood spheres from a true blood vampire. Fifteen thousand health gone. Grid drank a potion. The liquid burned down his throat and knitted flesh back together. His sword came up. The tip aimed at Tigol floating near the ceiling.\n\nTranscended Link activated.\n\nKwa kwa kwa kwang!\n\nTen black energy swords, each dealing one hundred fifty percent of Grid's attack power, carved through the air.\n\n\"You...!\"\n\nSweat beaded on Tigol's forehead. But she smiled. She might not be a direct descendant, but noble blood ran through her veins. Humans couldn't defeat her. She summoned a shield of blood. Let the fusion skill come.\n\nKwa kwa kwa kwang!\n\nThe building shook. Noe stumbled. Randy stumbled. The vampires trying to swarm Grid's position lost their footing. The collision had weight. Force. Consequence.\n\nTigol emerged unscathed. Her blood shield had completely neutralized Transcended Link.\n\n*Higher difficulty than the 7th city?*\n\nGrid hadn't expected a true blood vampire to match his fusion skill. But nervousness didn't touch him. This was interesting.\n\n*Will she give more experience?*\n\nHis smile crept wider.\n\nTigol's fury boiled over.\n\n\"Human! Know your position!\"\n\nThree blood spheres this time. They condensed in the air. Prepared to launch.\n\nThey exploded before leaving her control.\n\nAn old man stood hunched behind her. Iyarugt had appeared and cut. Simple. Effective.\n\n\"Kuock! N-No...?\"\n\n*How did he reach me?*\n\nTigol stared at Iyarugt. Her expression twisted with incomprehension. Iyarugt didn't return the look. To him, Tigol registered as something beneath notice. Weeds to be stepped on.\n\n\"Damn bastard. Summoning me just to kill these things.\"\n\nGrid ignored the grumbling demon. He barked orders to Noe, Randy, and the God Hands.\n\n\"Stay here and kill the remnants with Iyarugt.\"\n\n\"Nyang!\"\n\n\"Yes!\"\n\nNoe chirped. Randy confirmed. Grid headed for the exit with Sehee and Yerim in tow. The next building awaited. Behind them, experience notifications ticked upward with each vampire death.\n\n***\n\n\"W-What is going on?\"\n\nThe experience buff for Korean players had expired yesterday. Grid's leveling should have slowed. Instead, it accelerated. Level 314. The entrance to the top 40 rankings. The world watched with astonishment bleeding into doubt.\n\nWhere was he hunting? With whom? How was this speed even possible?\n\nSome wanted answers badly enough to go looking.\n\n***\n\n\"This is Grid's building.\"\n\n\"Doesn't it cost 10 billion won?\"\n\n\"Having a building like this at a young age. I'm envious.\"\n\n\"I feel respect rather than envy. This is a product of Grid's efforts. I should've worked harder in my youth.\"\n\nSeoul's outskirts. A black luxury sedan stopped in front of a seven-story structure. Modern architecture. Contemporary lines. Nothing spectacular about the structure itself, but the blue exterior carried a sophisticated polish.\n\n\"Hrmm.\"\n\nThe car's occupants emerged. Director Lee Gookrae from OGC Station. PD Park Jongsoo beside him. They studied the building.\n\n\"Are you certain Grid is inside?\"\n\nPark Jongsoo consulted his notes. \"Yes, it is certain. According to the testimony of the tenants, he hasn't gone out in recent days.\"\n\n\"Indeed... He's too busy raising his level.\"\n\nDirector Lee nodded. \"Okay, let's give it a try.\"\n\nThey entered the building. The elevator beckoned. They needed the penthouse where Grid resided. The button panel stopped them cold.\n\n\"What? The buttons end at the 5th floor? What about the 6th floor?\"\n\nPark Jongsoo frowned. \"Maybe the owner has a separate elevator.\"\n\nGrid was a celebrity. Privacy mattered. Basic security.\n\n\"Kung... We should've gone to the guardhouse.\"\n\n\"It would be much more difficult to speak to Grid if we have to go through the guardhouse. We tried calling for three days, but there was no answer.\"\n\nLee Gookrae sighed. \"Ah... Yes, let's use the stairs on the 5th floor.\"\n\nThey pressed the button. The elevator climbed. Stopped.\n\nDding~\n\n\"...Um?\"\n\nBlack marble covered the floor. The walls. The ceiling soared overhead, chandeliers glittering like captured stars. It looked like a luxury hotel entrance.\n\n\"It's quite well built...\"\n\n\"It seems like solid contractors built this.\"\n\nPark Jongsoo turned in a slow circle. \"By the way, where are the stairs to the 6th floor?\"\n\nNo exit signs marked the hall. Just six doors. Presumably officetels.\n\n\"Isn't this a violation of the building codes?\"\n\nThe words barely left Director Lee's mouth when the innermost door opened. A foreign man stepped through. Grey hair. Large muscles. He moved like a mixed martial arts fighter. Like a leopard. The impression was fierce. Dirty.\n\n\"Who are you?\"\n\nHe chewed gum while speaking. \"Why was there no contact from the guardhouse?\"\n\nSomething about him seemed familiar. PD Park recognized him first.\n\n\"Toon!\"\n\n\"Toon? Ah! The Beast Master of Overgeared!\"\n\nItalian mafia in reality. Why was he here?\n\n\"What do you want?\"\n\nToon's glance cut like a blade.\n\n\"Gulp.\"\n\nDirector Lee and PD Park swallowed in unison. The look in Toon's eyes pressed down on them. Their knees weakened.\n\nShake.\n\nDirector Lee's hands trembled as he extracted a business card.\n\n\"I am a director of OGC Station, Lee Gookrae. We came to meet Shin Youngwoo to discuss broadcast related matters. Can we meet Shin Youngwoo?\"\n\nUnderstanding dawned. Toon was Grid's security. The entire 5th floor rented out to stay close to his charge.\n\n*This seems much safer...*\n\nThe security operated on a different scale entirely.\n\nToon paused. He opened one of the six doors. Then unlocked another door that appeared behind it. The emergency staircase leading upward came into view.\n\n\"Go up.\"\n\nHe jerked his chin toward the stairs. \"Bunny Bunny is already there.\"\n\n\"Bunny Bunny!\"\n\nThe world's leading streamer. More influence than most TV stations. He'd come to South Korea?\n\n*He got to meet Grid?*\n\nThe player might be stolen. Director Lee and PD Park sprinted up the stairs."
}