{
  "id": 496,
  "title": "Chapter 496",
  "content": "\"Not the sixth floor.\"\n\nThe sixth floor housed Grid's family. He'd mentioned it in a magazine interview—his own space was the penthouse above.\n\n\"I know.\" The producer adjusted his collar. \"I've followed all of Grid's interviews. I'm a fan myself.\"\n\nDirector Lee Gookrae chuckled. \"These days, who isn't?\"\n\nThey bypassed the sixth floor and climbed to the seventh. The stairwell door opened onto a rooftop garden that stole their breath. A manicured lawn stretched before them, emerald-green and impossibly perfect for this height. Koi drifted through a small pond, their scales catching the sunlight. Near the water's edge sat a table crafted from dark hardwood, its grain rich and deep. Flowers swayed in the breeze—not the cheap decorative kind, but exotic specimens that must have cost a fortune to maintain this high up.\n\nBeyond the garden stood a glass-walled structure. Grid's penthouse.\n\n\"Christ.\" PD Park Jongsoo wiped his forehead. \"This is something else.\"\n\nDirector Lee Gookrae couldn't look away from the pond. \"Maybe in my next life.\"\n\n*Emerging chaebol,* the experts called Grid. *A one-man conglomerate.* Looking at this place, Lee Gookrae believed it. They were still drinking in the view when footsteps approached across the lawn.\n\n\"Welcome.\"\n\nLee Gookrae's head snapped up. His stomach dropped.\n\nBlack hair fell past her shoulders, stark against porcelain skin. Her eyes were the kind of deep brown that made you forget what you were saying—lakes you could drown in. She wore a simple white blouse and black skirt, but the effect was anything but simple. The intelligent set of her jaw mixed with something undeniably sensual in the way she moved.\n\nThe rooftop garden became background noise.\n\nYura. The most beautiful woman in the world.\n\nPark Jongsoo made a strangled sound beside him. Lee Gookrae recovered first—twenty years of marriage had built some immunity.\n\n\"Why are you here?\"\n\nThe question came out sharper than intended. Yura had visited OGC Station before, always in Grid's orbit, always driving up his market value. His pulse quickened. *What's her angle this time?*\n\nYura's smile was knowing. \"Is it so strange? Can't you guess the relationship between Youngwoo and me?\"\n\n\"Ah.\" Understanding crashed over him.\n\n*Lovers.*\n\nPark Jongsoo made another noise. Lee Gookrae felt a stab of envy so pure it shocked him. *Wealth, fame, and her.* Twenty years of happy marriage couldn't fully inoculate him against that combination.\n\nPark Jongsoo's internal monologue was probably less charitable. The man was single and looked like he'd been gut-punched.\n\n*Next life, I'm coming back as Grid.*\n\nYura's smile faltered for just a moment—a micro-expression that vanished before Lee Gookrae could parse it. She turned toward the garden table.\n\n*If only,* she thought. The reality was far less romantic. *Property manager. That's what I am.*\n\nShe pushed the thought down and gestured to the chairs. \"Please, sit.\"\n\nThe small water wheel beside the pond clicked rhythmically as they settled in. *Tak. Tak. Tak.*\n\n\"You want to broadcast Youngwoo's hunting?\" Yura didn't waste time on pleasantries.\n\n\"Yes.\"\n\n\"Twenty billion won. Non-exclusive—you'll share broadcast rights with Bunny Bunny's private channel.\"\n\nPark Jongsoo's chair scraped. \"What?\"\n\n*Twenty billion for hunting footage? Not even exclusive?* Heat flushed his neck. This was insulting. A complete mockery of standard industry practice.\n\nLee Gookrae's expression remained neutral. \"I understand. I'll prepare the contract.\"\n\n\"Director?\" Park Jongsoo barely kept his voice level. *Has he lost his mind?*\n\nLee Gookrae sighed. \"No discount?\"\n\n*Of course not.* The truth was, OGC had come prepared to write a blank check for exclusive rights. Grid's leveling methods were the subject of global speculation. An exclusive behind-the-scenes broadcast would skyrocket their brand recognition and generate advertising revenue that made twenty billion look modest.\n\nSharing rights with Bunny Bunny was an annoyance, not a deal-breaker.\n\nBut Lee Gookrae had something else on his mind.\n\n\"Last year, we paid five billion for the Vatican footage—Grid fighting that Red Knight.\" He leaned forward. \"You told me we'd be rewarded for that relationship. That you and Youngwoo would actively work with OGC. So what happened? You've refused every proposal since. That stings.\"\n\nYura's expression didn't change, but something cooled in her eyes.\n\n\"Simple,\" Lee Gookrae continued. \"I want this deal to be the start of something ongoing. When OGC calls, I want you to pick up.\"\n\n\"Create a program worth my time,\" Yura said. \"Then we'll talk.\"\n\n*Worth her time.* The implication hung in the air: *Your current offerings are beneath me.*\n\nLee Gookrae felt his professional pride bristle. OGC was the premier gaming broadcast network in the world. Park Jongsoo's jaw was clenched so tight it looked painful.\n\n\"Understood.\" Lee Gookrae's voice was steady. \"I'll create something worthy. A program you'll want to be part of.\"\n\nYura's smile returned. \"I look forward to it.\"\n\n*One year later, that promise would birth the programs that dominated Korean and global viewership.*\n\n***\n\n\"Are you kidding me right now?\" Bunny Bunny's voice cracked with disbelief. \"I flew from the States for this. You can't even get him to say hello?\"\n\nThe world's top gaming broadcaster had crossed an ocean to sign the contract he'd been chasing for months. Hunting footage of Grid—exclusive access to the biggest mystery in Satisfy. He should be ecstatic.\n\nInstead, he was pacing Yura's office like a caged animal.\n\n\"This is insane. The man won't even show his face!\"\n\nYura didn't look up from her tablet. \"Can you think like a ranker for one second? These people sacrifice meals and sleep for the game. I wouldn't interrupt Youngwoo's session if the President showed up at the door.\"\n\nThe words came out more bitter than she'd intended. *Because I'm in the same boat as you, aren't I?* She donated her time managing Grid's affairs—scheduling, negotiations, damage control. And for what? The man couldn't spare ten minutes for coffee.\n\nHer throat tightened. *When did I become someone who gets treated like this?*\n\nPride stung worse than loneliness.\n\nBunny Bunny stopped pacing. \"Did your face just... are you pouting?\"\n\n\"What?\"\n\n\"I've never seen you make that expression before.\"\n\nYura touched her cheek. \"That makes two of us.\"\n\n*These feelings.* She didn't have a name for them yet. They were unfamiliar territory—frustrating and exhilarating in equal measure. Like standing at the edge of something vast and unmapped.\n\nHer smile, when it came, was genuine. Radiant, even.\n\nBunny Bunny blinked. \"Wow.\"\n\n***\n\n\"Overgeared Two.\"\n\nVantner said the name like he was tasting something sour. \"People laughed at that name, you know.\"\n\nLauel didn't look up from his map. \"And yet the members don't complain. It's better than 'Overgeared Workforce.'\"\n\nThe merged guild—Silver Knights folded into their secondary roster—had crossed a threshold. Average level 200. For a guild heavy with production classes, that was exceptional. It meant coordinated party hunts were working. It meant their crafters would soon output equipment that could change battlefields.\n\nLauel wanted to commemorate the milestone properly.\n\n\"How do we celebrate?\" Vantner sprawled in his chair.\n\n\"We fight.\" Lauel's finger traced a line on the map. \"We win. We share victory.\"\n\nThe guild had started small—elite members only, focused and deadly. Time and growth had softened that image. People saw them as a social club now. A community.\n\n*Big mistake.*\n\nThey were always meant to be conquerors. Grid was their king, and kings required empires.\n\nWar was in their blood.\n\n\"Grid's still in the vampire cities.\" Vantner frowned. \"Isn't this bad timing?\"\n\n\"It's perfect timing.\"\n\nThe world's eyes were on Grid. Every major news outlet, every gaming channel, millions of players—all focused on one man. Meanwhile, Overgeared could move armies in the shadows.\n\nLauel tapped the map. \"Patrian. Fortified city on the northern border. The gateway between Bairan and the west.\"\n\n\"Everyone knows Aslan's been cutting us off up north,\" Regas said.\n\n\"Slowly.\" Lauel's smile was sharp. \"Incrementally. A tax hike here, a closed road there. Always with plausible excuses. He sends gifts to Reidan while he builds a noose around Bairan.\"\n\nVantner leaned forward. \"So we're done playing nice?\"\n\n\"Bairan will be isolated soon. When that happens, Aslan shows his real face. We need Patrian before that—secure the supply line, connect our territories.\"\n\n\"What about the backlash?\" Pon asked. \"Aslan will send troops to Bairan the second we move on Patrian. We'll lose the north and be trapped in the west.\"\n\nLauel patted Vantner's bald head. The big man scowled.\n\n\"Foolish Vantner. Did you forget Grid's father-in-law controls the north? Marquis Steim will keep Aslan in check. Our real problem is players, not NPC armies.\"\n\nThe moment Overgeared attacked Patrian, the system would flag them as hostile to the Eternal Kingdom. Every player with kingdom affiliation would receive defense quests. Thousands of users would descend on Patrian like locusts.\n\n\"So we delay the quest trigger,\" Lauel continued. \"And the best way to keep players distracted is—\"\n\n\"Grid's broadcast,\" Jishuka finished.\n\n\"Exactly. We time the invasion for when the hunting footage airs. Viewership will rival the National Competition. Billions want to know how Grid levels so fast. Satisfy's player count will tank when that broadcast starts.\"\n\nLauel's hand swept across the map. \"We march in secret. Take Patrian while it's empty. By the time players realize what's happening, we'll control the city. Understand now, ignorant Vantner?\"\n\nHe covered half his face with one hand, grinning through his fingers.\n\nVantner groaned. \"The chunni act again?\"\n\nBut Lauel wasn't listening. He was already in character, lost in his delusions of grandeur.\n\n*Let them laugh,* he thought. *Soon they'll understand.*"
}