{
  "id": 497,
  "title": "Chapter 497",
  "content": "> [An intermediate vampire was destroyed.]\n> [A senior vampire was destroyed.]\n> [A senior vampire was destroyed...]\n> [The title 'Vampire Slaughterer' has been obtained!]\n> [1,000 fixed damage will be dealt every time you attack a vampire!]\n\n\"Wow!\" Grid's voice cracked. \"Heok! Wah! Woohoo!\"\n\nEach exclamation burst out involuntarily. The synergy between the God Hands, his items, and the Saintess kept surprising him in ways he couldn't process.\n\nStep.\n\nA single footfall from Grid.\n\n*Peeeeok!*\n\n**Kwa kwa kwa kwang!**\n\nThe God Hands, empowered by Holy Weapon and Holy Impact, hammered four vampires with the Mjolnirs. The splash damage caught dozens of others. Grid only had to walk for scores of vampires to collapse around him.\n\n*Crazy. This is actually insane. It's a scam.*\n\nHunting felt effortless. The thrill turned to unease in Grid's chest.\n\n*...Will I get banned?*\n\nCreating an illegal macro called the God Hands...\n\n\"Hah.\" Grid shook his head. \"I'm paranoid.\"\n\nThe God Hands performed so well that guilt crept in. Items that could equip gear, move independently, and slaughter monsters. They didn't even have stamina limitations. *Were there better items in the entire world?*\n\n\"How did you even think to create such items?\" Yerim clapped her hands. \"Completely amazing! So cool!\"\n\nGrid didn't lift a finger. Noe, Randy, and the God Hands massacred the vampires while he observed. He resembled the overpowered protagonists from action films. Watching him was genuinely thrilling. \n\nSehee's assessment differed.\n\n\"It looks more like those Chinese workshops from the news...\"\n\nGrid's eyes widened. Chinese workshop. Sweatshops where people gathered en masse for infinite hunting, using pets to grind gold for real-world profit.\n\n\"...Right.\" Grid sat down abruptly. \"Taking a break.\"\n\nHe ignored Sehee's comparison and focused on recovering his fallen stamina. Noe, Randy, and the God Hands continued their slaughter during his rest.\n\n> [An intermediate vampire was destroyed.]\n> [Experience has been acquired.]\n> [An intermediate vampire was destroyed.]\n> [Experience has been acquir...]\n\nJoy flooded Grid as his experience bar climbed during his break.\n\n\"Feels like I've achieved an old dream...\"\n\n\"What dream?\" Yerim asked.\n\nSehee answered before Grid could open his mouth.\n\n\"Vice president.\"\n\nEarning money by exploiting employees who did all the work, then spending freely. Grid had dreamed of exactly that life.\n\n\"I'm ashamed thinking about it now...\" Grid scratched his cheek. His hand dropped. \"My dreams have changed since then.\"\n\nAs his life improved, his mindset expanded. His worldview shifted incrementally. He didn't want to exploit the weak anymore. Sometimes he felt compelled to help. Recently, he'd even donated 3,300 won to a charity program on Uni X.\n\n*Wonder if I'll make it to Heaven.*\n\nGrid smirked at his own thought. Sehee interrupted it.\n\n\"Is the last boss in that building?\"\n\nOnly seven buildings existed in the 8th vampire city. The number of vampires sleeping in each structure was small, making it substantially more compact than the other cities. However, the total experience yield remained comparable. The average vampire level here exceeded the other cities. Grid could only assume the 8th city's boss was a high noble.\n\n\"Correct. Only the boss remains.\" Grid confirmed his stamina had recovered and stood. He turned to Sehee and Yerim. \"From here, I go alone.\"\n\nIf the boss was a baron or viscount, he could raid it solo. He was strong now. But earls or higher were uncertain. Direct descendants were especially dangerous. Sehee and Yerim couldn't die here. \n\nSehee and Yerim exchanged glances, doubt plain on their faces.\n\n\"Won't we die anyway if you fail the raid?\"\n\n\"This is a dungeon we can only escape if the boss dies or we do. To increase our survival chances, shouldn't we fight together?\"\n\n\"You're...\" Grid paused. \"Right.\"\n\nTheir logic held. Grid opened the door of the final building with Sehee and Yerim flanking him. Randy, Noe, and the God Hands returned to his side after clearing the vampire remnants.\n\n*I'll succeed.*\n\nHe was stronger than ever before. He felt confident facing even prime Kraugel. Grid's confidence ignited as he stepped forward.\n\n> [The owner of the 8th city, Vampire Viscount Latina has appeared.]\n\nAt the end of a red-carpeted hallway, a dark-haired woman occupied a throne. Beauty radiated from her features, but ice-cold skin and blue lips twisted the image into something bizarre.\n\n\"Oh my.\" Latina's red eyes gleamed. \"Humans? Prey has arrived after such a long time.\"\n\nShe smiled. Her hand waved once.\n\n**Kuduk!**\n\n**Kudududuk!**\n\nThe ground split. Zombies emerged from the cracks.\n\n*Clack! Clack clack!*\n\nSkeleton joints produced grotesque sounds as they advanced. Zombies staggered forward, hollow eyes staring. Roughly a thousand undead filled the hall.\n\n\"What the hell...?\"\n\nA vampire necromancer? Grid recoiled from the zombies' nauseating stench. Braham's voice cut through his shock.\n\n*'Latina is one of the nine direct children born from my mother.'*\n\n\"...\"\n\nThe worst possible scenario. Grid's heart plummeted.\n\n> [The vampire viscount Latina has released a sweet magic power.]\n> [You have become confused.]\n> [Your spirit can't endure it. Mana regeneration rate will decrease by 80% and magic resistance by 50%. There is a chance that skills will fail to activate.]\n> [Your arms and legs don't have any strength.]\n> [Attack power will decrease by 50% and all speeds will decrease by 30%.]\n> [You have resisted.]\n\n*The girls!*\n\nGrid whipped around. Fear for Sehee and Yerim gripped him. How confusing and terrifying would the sight of creepy skeletons and zombies be for them? \n\nBut Sehee and Yerim were fine. No. They were excited.\n\n\"They're undead.\"\n\n\"The skeletons are cute.\"\n\n\"...?\"\n\nThey didn't flinch despite seeing a thousand skeletons and zombies? The pressure didn't affect them at all? Both Grid and Latina froze in confusion.\n\n\"Light of Repentance.\"\n\n*Swaaaah!*\n\nSehee clasped her hands together in prayer. Light poured from her body and cleansed the entire area. The skeletons and zombies were engulfed by warm radiance. They fell to their knees, shedding tears before crumbling to ash.\n\n> [You have killed a monster by yourself.]\n> [The level difference with your party members is ignored and you will receive 100% of the experience.]\n> [Your level has risen.]\n> [Your level has risen.]\n\n\"...?\"\n\nThe undead were at least level 250. She made a thousand undead kneel and destroyed dozens with a single prayer? Grid's mind reeled at Sehee's absurd power. \n\nYerim proved equally formidable. She layered divine buffs on herself and demolished the undead Sehee had weakened.\n\n\"Wow...\"\n\nGrid lost his capacity for words. Braham's trembling voice whispered in his ear.\n\n*'The Saintess can destroy even the souls of great demons. Trivial undead cannot raise their heads before her.'*\n\n\"Ah...\"\n\nA pattern connected in Grid's mind. Braham, Iyarugt, and the great demon Hell Gao shared a commonality. Even after death destroyed their bodies, their souls persisted.\n\n*So demonkin souls are immortal?*\n\nOnly the Saintess could annihilate souls. Thrills ran through Grid as he realized Sehee's value far exceeded his estimates.\n\n*'Latina is unfortunate.'*\n\nBraham pitied his sister.\n\n***\n\n*What is this?*\n\nLatina was one of nine children born directly from Shizo Beriache. She held a lowly title because she avoided tedious responsibilities, but her power was absolute. Particularly, she alone among her siblings could command the dead, resembling the authority of Baal, the first great demon. Pride filled her existence. Until Marie Rose appeared, she believed herself capable of reigning over all vampires.\n\nThe great Latina now felt embarrassment because of humans. Humans. A prey species for vampires.\n\n*Originally, they should have collapsed at my mere presence...*\n\nOne male and two females. They weren't ordinary. Rather than kneeling before her tremendous magic power, they stood upright. They even made the dead kneel. The situation defied comprehension.\n\n*No. I've heard some humans possess strength.*\n\nHundreds of years ago, scandalous individuals praised as legends existed. She'd never witnessed them directly, but perhaps these humans belonged to that class.\n\n*Irrelevant.*\n\n**Ssik!**\n\nLatina grinned wickedly and commanded the dead.\n\n\"Rise and fight!\"\n\n*Kikik! Kik!*\n\n*Kuwaaah!*\n\nThe kneeling skeletons and zombies slowly raised themselves. Latina increased the magic power flowing to the undead. The Saintess's low-level power ceased functioning.\n\n\"Hohoho! Much better!\" Latina seized the momentum. \"Kill them all!\"\n\n*Creak. Kik!*\n\n*Kuwaaah!*\n\nThe skeletons and zombies surged toward Grid.\n\n\"We're still not helpful, I guess.\" Sehee sighed. \"Stay strong. Holy Weapon. Holy Impact.\"\n\n*Shaaaaaah—*\n\nWhite light enveloped the God Hands floating beside Grid.\n\n*Peok!*\n\n*Peok peok peok!*\n\n**Kwa kwa kwa kwang!**\n\nThe buffed God Hands began pulverizing the undead with Mjolnir. Bone fragments and rotting flesh scattered across the hall. Latina's mouth fell open.\n\n\"Why is it so effortless?\"\n\nNone of this made sense. Latina's gaze suddenly fixed on the human male. He appeared to control the floating golden hands.\n\n*It's irritating, but I must intervene directly.*\n\nLatina made her decision and launched herself toward Grid. Her body transformed to smoke. She approached Grid soundlessly, stabbing her sharp nails toward his throat. \n\nBut Grid's Sword Ghost was faster than her claws.\n\n\"The bait was taken.\"\n\nGrid laughed at Latina's shocked expression. His hair turned white. He placed his hand on the defenseless vampire's face and fired a Fireball at point-blank range."
}