{
  "id": 498,
  "title": "Chapter 498",
  "content": "The notification windows blazed across Grid's vision as Braham's magic tore into Latina.\n\n> [You have dealt 205,000 damage to the target.]\n> [20,500 fire damage will be dealt per second for 13 seconds.]\n> [The magic has been fired at close range. The explosion effect of Fireball is maximized.]\n> [You have dealt 410,000 damage to the target.]\n> [The blow has caused bleeding (large) in the target's affected area.]\n> [The target has resisted.]\n> [The target has been affected by the 'confused' state.]\n> [The target has resisted.]\n\nLatina staggered. The mental shock struck deeper than the physical wounds.\n\n*What? This guy with weak magic power...!?*\n\nThe direct descendants of Beriache possessed inherent magical might that dwarfed human magicians. Among them, Latina's power stood exceptional. The humans called \"great magicians\" were insects before her. Yet this human—this weakling—had just struck her with magic that *should not exist*.\n\nImpossible.\n\nBut Grid had done it. With a mere 2,000 intelligence. The secret lay not in Grid's power but in Braham's mastery—pure magic so refined it transcended ordinary limits. The white-haired Grid trembled.\n\n\"My magic deals such terrible damage in this stupid body.\" Braham's voice dripped with frustration. \"This is the limit.\"\n\nLatina's eyes widened.\n\n*This tone...*\n\nThe arrogant expression. Those predatory eyes. The impression of magic power itself had transformed, raising goosebumps along her arms. Above all—those dark red eyes.\n\n\"No way. You are—\"\n\nShe withdrew, blood draining from her face.\n\nThe white-haired Grid smiled.\n\n\"It has been a while.\"\n\n\"Braham!\" Latina's shriek echoed through the chamber.\n\nThere had been ten direct descendants, not nine. But the vampires never spoke of the tenth. Braham Eshwald—the lunatic who'd been exiled. The name they wished forgotten.\n\nLatina's voice shook. \"You... What are you doing here?\"\n\nBraham had called their clan a 'lazy and useless race' and sought to destroy it. Countless clan members had died by his hand, including Elfin Stone's fiancée. Latina loathed him. Feared him. Now Braham watched her shrieking form and laughed.\n\n\"Can't you see this face?\" He gestured to Grid's borrowed body. \"Right now, I'm borrowing it. This face isn't mine. Otherwise, how could you forget your brother's face?\"\n\n\"Shut up!\" Latina's hands clenched into fists. \"Don't joke around with that filthy mouth!\"\n\nThe more frightened the beast, the louder its bark. Latina's survival instinct kicked in. She summoned new undead—these on a different dimension from the previous skeletons and zombies. Over two hundred skeleton warriors, skeleton mages, and ghouls rose simultaneously from the ground.\n\nLeading them was a death knight—an imposing skeleton in black armor, wielding a burning sword.\n\n*This looks serious.* Grid's concern spiked. *Isn't it dangerous?*\n\nSehee and Yerim shrank back.\n\nA message appeared in the party chat.\n\n**—I can't do anything to the senior undead because my level is low. I will support you with buffs and heals as much as possible.**\n\nBraham's response was cold. \"I don't need help.\"\n\nSehee blinked. Was this her brother? His tone had completely shifted. His appearance too—the manly look had transformed into a pretty face straight out of a manhwa. The rumor was that the white-haired Grid was a completely different entity from the original. Now she believed it.\n\nBraham glanced at the confused Sehee.\n\n*I can't feel it yet. She is still beginning.*\n\nPerhaps it wouldn't be bad to demonstrate his power. The Saintess—a unique being capable of destroying him. Better to establish dominance now than suffer later. He spoke to Grid internally.\n\n*Manipulate the God Hands. Move according to my intentions.*\n\nBraham requesting cooperation? The opponent must truly be formidable. Grid felt tension coil in his gut.\n\n*Believe in me.*\n\nBraham hesitated. For reasons he couldn't articulate, trusting Grid felt... difficult.\n\n\"Advance to the beat!\"\n\n**Kurung! Kung. Kurururung.**\n\nLatina's magic power roared like thunder, refined into a melody.\n\n> [The stats of Latina's summoned undead has risen. The movement speed will greatly increase.]\n> [The stats of all living creatures will fall.]\n> [You have resisted.]\n\n\"Kihihit!\"\n\nThe strengthened undead surged forward. Their greatest weakness—slow movement—had been overcome. They surrounded Grid's party with terrifying speed.\n\nThe white-haired Grid didn't look back at Sehee and Yerim. Not because he didn't care. He knew his obligation to protect them. But looking back was a luxury. His goal was simple: win before they fell into danger.\n\nBraham pointed at the death knight leading the charge. \"Hit it at once!\"\n\n*Understood!*\n\nGrid relayed orders to Noe and Randy. They converged with the God Hands on the single death knight in a devastating assault.\n\n> [Your pet 'Noe' has attacked Death Knight Buratan.]\n> [Scratch has dealt 8,300 damage to the target.]\n> \n> [Your pet 'Randy' has attacked Death Knight Buratan.]\n> [Pagma's Swordsmanship, Linked Kill has dealt 36,000 damage to the target.]\n> \n> [God Hand (1) has attacked Death Knight Buratan.]\n> [You have dealt 2,500 damage to the target.]\n> [The effect of the Ultimate Enhanced Mjolnir has dealt 3,800 divine damage to the target.]\n> [The effect of <span class=\"rarity-epic\">Holy Weapon</span> has dealt 500 divine damage to the target.]\n> [The effect of <span class=\"rarity-epic\">Holy Impact</span> deals an additional 3,800 + 500 damage to all 'evil' targets within 5 meters of the target hit.]\n> \n> [The God Hand (2)...]\n> [The God Hand (3)...]\n> [The God Hand (4)...]\n> \n> [The effect of <span class=\"rarity-epic\">Holy Impact</span> deals an additional 2,700 + 500 damage to all 'evil' targets within 5 meters of the target hit.]\n> \n> [Your pets 'Noe' and 'Randy' have been affected by Holy Impact and suffered 13,900 damage.]\n\n\"Nyang! It hurts!\" Noe's cry pierced the air.\n\n\"H-Hurts...\" Randy's voice wavered.\n\nGrid's stomach dropped.\n\n*Shit.*\n\nNoe and Randy were creatures—classified as evil. The divine power had struck them down alongside the death knight. He'd overlooked their proximity to the God Hands. Guilt stabbed through him as they struggled.\n\n\"Is stupidity a difficult disease to fix?\" Braham's scoff cut through Grid's self-recrimination.\n\nHe cast magic, concentrating the explosion where successive Holy Impacts had softened the battlefield. The spell targeted Death Knight Buratan with surgical precision. Nothing special—Braham's current options with Grid's magic power were limited.\n\nOnce again: Fireball (Enhanced).\n\nBut this Fireball differed from the previous cast. Braham's enhanced version carried an explosive payload.\n\n**Ku kwa kwa kwa kwa! Ku kwa kwa kwa kwa!**\n\nThe maximized explosion detonated at the point of impact. A shockwave rippled outward. The undead's movement speed plummeted. Even Latina shook.\n\nIn that brief window, Braham calculated the angle of her upper body's recoil and fired Magic Missile (Enhanced) with zero time lag.\n\nContinue. Continue. Continue. He fired until mana depletion.\n\n**Peng!**\n\n**Pepepepeong!**\n\n\"Ugh! Kiyaaaaaak!\"\n\nThe terror of Braham's basic spells—the mastered versions—lay in their instant cast. Latina's shield evaporated. Her health plummeted. Braham's voice was ice.\n\n\"This is the end of your laziness.\" A lazy person never developed. They fell behind and became prey. \"This path leads only to our clan's decline.\"\n\nIf destruction was inevitable...\n\n\"Become my food.\"\n\n> [You have no mana.]\n> [You have failed to activate Magic Missile (Enhanced).]\n\nThe notification flashed. Grid's hair and eyes turned black as he closed the distance to Latina. The undead meant to protect her lay scattered across the floor—casualties of Holy Impact and Fireball's explosive synergy. The death knight and sturdier undead rushed to intercept.\n\nToo late.\n\nGrid downed a mana potion from Reidan's alchemy facility and initiated a sword dance.\n\n\"Open Rune of Darkness. Blackening. Blacksmith's Rage. Quick Movements. Pagma's Swordsmanship.\"\n\n\"You! Brahammmm!\"\n\nTears streamed down Latina's face as Holy Weapon, Holy Impact, and Pinnacle Kill hammered into her. She counterattacked in desperation, piercing Grid's chest with nails wreathed in blood magic.\n\n> [You have suffered 133,300 damage.]\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n> [The target that attacked is evil. Holy Explosion will return half of the damage received.]\n\nLatina's attack had been suicidal—prepared to die to kill the enemy. But the reflection damage carved into her instead. She was a direct descendant. Death didn't come easily.\n\n\"Life Drain... Heok?\"\n\nShe attempted to reverse the battlefield by draining Grid's health. Shock froze her.\n\n*This guy doesn't have any health?*\n\nHow was he still moving?\n\n\"You! Are you a zombie?\"\n\n\"Linked Kill Wave. Linked Kill. Transcended Link. Kill. Link. Pinnacle. Wave. Transcend.\"\n\nGrid attacked through his five-second immortal state. He disregarded Latina's efforts entirely, unleashing Pagma's Swordsmanship in a relentless storm. Brilliant skill effects wrapped around both combatants, forcing Sehee and Yerim to watch a battle on a dimension beyond their comprehension.\n\nThen the notification windows cascaded.\n\n> [Owner of the 8th city, Vampire Viscount Latina is forced to sleep after exhausting all her powers.]\n> \n> [The level of party leader 'Grid' has risen!]\n> \n> [The party leader 'Grid' has acquired <span class=\"rarity-epic\">Latina's Necklace</span>.]\n> [The party leader 'Grid' has acquired the <span class=\"rarity-legendary\">Direct Vampire's Pajamas</span>.]\n> [The party leader 'Grid' has acquired 3 <span class=\"rarity-uncommon\">blessed weapon enhancement stones</span>.]\n> [The party leader 'Grid' has acquired 5 <span class=\"rarity-uncommon\">blessed armor enhancement stones</span>.]\n\nSehee and Yerim saw these messages. The following windows appeared only for Grid.\n\n> [Latina's strength is engraved on the Rune of Darkness.]\n> \n> [You have sealed three of Shizo Beriache's direct line. The title 'Qualification of a Blood King' has been acquired.]\n> \n> **[Qualification of a Blood King]**\n> \n> *It is the qualification to be the king of all the direct descendants.*\n> \n> *You will give a sense of pressure to ordinary vampires. The abilities of general vampires fighting against you will decrease by 10%.*\n> \n> *You will give a sense of hostility to true blood vampires. The abilities of all true blood vampires fighting against you will increase by 10%.*\n> \n> *Direct vampires will be interested in you. The chances of meeting a direct descendant will increase. Gaining favorability with direct descendants will be relatively easy.*\n\nGrid frowned. Qualification of a Blood King. The name sounded cool. The effect was... uncertain.\n\n*Is this good or bad?*\n\nBraham's response dripped with disdain. *It's naturally bad. Why do you want to become friendly with such trash? I am the only worthy vampire friend.*\n\n*...What?*\n\nWhy was he so sensitive? Grid couldn't understand Braham's sulking."
}