{
  "id": 499,
  "title": "Chapter 499",
  "content": "Grid ignored the uncooperative Braham. He weighed his options.\n\n\"I think it's good.\"\n\nThe probability of encountering true blood vampires remained low. For every 200 to 300 common vampires, only one or two true bloods emerged. Most of Grid's experience came from slaughtering the weaker strain.\n\n*A 10% drop in an ordinary vampire's stats means faster hunting. Faster leveling.*\n\nThe Qualification of a Blood King title carried obvious merit. The 10% stat increase for true blood vampires created problems, certainly. Strong enemies would grow stronger.\n\n*But right now, I have Mjolnir. I have my sister.*\n\nHe was nearly invincible in the vampire cities. The power creep among true bloods posed no immediate threat.\n\n*Meeting a true blood above earl rank changes everything.*\n\nStill, even among true bloods, those without direct descendant bloodlines rarely achieved such heights. Grid dismissed his anxiety and examined the newly updated Rune of Darkness.\n\n> [Rune of Darkness]\n> \n> Bound Item.\n> \n> Permanently preserved in your inventory. Trading, dropping, or destroying it is impossible.\n> \n> **Usage Effect:** Demonic power state will rise in exchange for its use.\n> \n> * Normal attacks and skill attacks deal an additional **20% dark damage**.\n> \n> **Unique Lasting Effect:** When dealing with named demonkin and demons, you can absorb unique attributes.\n> \n> * **Tiramet's Power:** If your health drops below **10%**, health will be restored to **30%** instantly. Cooldown: **12 hours**.\n> \n> * **Latina's Power:** Generates the skill **'Can you Become the King of the Dead?'**\n\nGrid's frown deepened. \"What the hell is this skill name?\"\n\nThe phrasing reeked of mediocrity. B-grade trash.\n\n*No. A skill from defeating a direct descendant can't be garbage.*\n\nIt had to be powerful. Noble. Grid wrestled his doubts into submission and opened the skill description.\n\n> [Can you Become the King of the Dead?]\n> \n> Summon **'Growth-type Skeletons'** that gain **five stat points** per level.\n> \n> The skeletons start at **Level 1**.\n> \n> Basic stats: **3 Strength**, **3 Stamina**, **3 Agility**, **1 Intelligence**.\n> \n> **Skill Mana Cost:** 3,000\n> \n> **Duration:** Until summoning is released or skeletons are destroyed.\n> \n> **Cooldown:** None.\n\n\"Shit.\"\n\nLevel one skeletons. No skill progression. Just this.\n\n*Garbage. The mana cost is insane.*\n\nMost summoning skills scaled with the caster's stats and abilities. Necromancers, for example, relied on their Summon Skeleton and Skeleton Enhancement skills, plus their Domination stat. Higher mastery meant stronger summons from the start. No need to babysit weak minions through early levels.\n\nThis damned skill forced him to raise skeletons from scratch.\n\n*A skill this worthless exists?*\n\nThe name implied growth potential. Perhaps they could reach high levels eventually. But they were still skeletons. Slow, brittle, pathetic. Five stat points per level meant glacial progression. The base stats were a joke.\n\nGrid sighed. \"I'd rather summon a death knight.\"\n\nWhy suffer through raising these things? To level them, he'd need to waste time at novice training grounds.\n\n*I'm abandoning this skill.*\n\nHe moved on, activating his Legendary Blacksmith's Appraisal on another drop.\n\n> [The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\n> [You have discovered a hidden feature in the item!]\n\n> [<span class=\"rarity-epic\">Latina's Necklace</span>]\n> \n> Rating: Epic (Growth)\n> \n> **Intelligence +300**\n> \n> The favorite necklace of Latina, one of Beriache's direct descendants.\n> \n> Raises stats of undead pets by **20%**.\n> \n> * If this necklace grows to legendary rating, the wearer can summon Vampire Viscount Latina.\n> \n> **User Restriction:** Level 320 or higher.\n> \n> **Weight:** 10\n\nGrid clutched his head. \"I'm going insane.\"\n\nA necromancer's item. Pure and simple.\n\n*Why do I keep getting useless garbage?*\n\nHe could auction it for tens of billions of won. But selling carried risks. If Agnus got his hands on it, the consequences would be catastrophic. Better to avoid creating future enemies.\n\n*Use it myself. Don't sell.*\n\nThe base stats weren't terrible. Three hundred intelligence.\n\n*More mana for Braham's spells. That's useful.*\n\nAt epic rating, it already granted significant power. Upon reaching legendary, the intelligence bonus could hit a thousand.\n\n*Fine. I'll use it. I can buff the skeletons too.*\n\nHis build sprawled in more directions each day, but why refuse a path to strength? Grid decided to test Can you Become the King of the Dead. He needed to assess the skeletons' actual capabilities.\n\n\"Summon Skeletons!\"\n\n> [The <span class=\"rarity-legendary\">Ring of Absurdity</span> has reduced resource consumption by 50%. **1,500 mana** has been consumed.]\n\n*Clack.*\n\n*Clack clack clack clack!*\n\nTwo skeletons materialized beside Grid. They wobbled side to side, bones rattling against each other in an escalating cacophony that grated on his nerves.\n\n\"Shut up.\"\n\nThe summons were pathetic specimens. Their appearance alone inspired disgust. Yellowish bones, cracked skulls. The structural integrity looked nonexistent.\n\nGrid clicked his tongue. \"You need more calcium.\"\n\n*Clack clack! Clack!*\n\nDespite his harsh words, the skeletons raised their jaws as if pleased.\n\n*Right. No intelligence.*\n\nUndead possessed no emotions or cognition. Only death knights and liches achieved true awareness.\n\n\"You'll never understand a word I say.\"\n\nHe pulled up their status windows.\n\n> [Overgeared Skeleton (1)]\n> \n> **Lv.** 1\n> \n> **Health:** 45/45 **Mana:** 3\n> \n> **Strength:** 3\n> **Stamina:** 3\n> **Agility:** 3\n> **Intelligence:** 1\n> \n> **Items Worn:** None\n> **Skills Possessed:** None\n\n\"This is highway robbery.\"\n\nStandard necromancer skeletons came with rusted longswords at minimum. His arrived naked.\n\n\"I have to equip you myself?\"\n\nGrid paused.\n\n*What if I forge items specifically for them?*\n\nThe concept crystallized. Overgeared skeletons.\n\n*That could work.*\n\nReal potential existed there.\n\n*Factor in Latina's Necklace buff...*\n\nSkeleton generals or death knights remained pipe dreams, but skeleton warriors seemed achievable. Grid regarded his summons with newfound warmth.\n\n\"You're Overgeared Skeleton One.\" He pointed at the second. \"You're Overgeared Skeleton Two.\"\n\n*Clack clack!*\n\n*Clack!*\n\nBoth skeletons nodded.\n\n*Are they happy about the names?*\n\nImpossible. They had no emotions.\n\n\"Brother?\"\n\nSehee and Yerim approached. They handed over the blessed enhancement stones, eyes drawn to the skeletons.\n\n\"These are yours?\" Sehee asked.\n\nYerim crouched down. \"They're adorable! Look at those eye sockets. Like little half-moons. Aren't they precious?\"\n\n\"Those are empty sockets, not cute.\" Grid froze. \"Wait. What happened?\"\n\nSehee's staff had lost its glow. The Wooden Staff he'd painstakingly enhanced to +9 no longer radiated the telltale white shimmer that marked successful upgrades.\n\n\"Where's the enhancement aura?\"\n\nA +9 weapon should shine brilliantly. Sehee's staff looked unenhanced.\n\n*Don't tell me...*\n\nSehee delivered the news with crushing nonchalance.\n\n\"I failed the enhancement.\"\n\nSilence.\n\n\"Two weeks ago, it dropped to +7. Then I used the blessed stone you gave me and it fell to +6.\" She shrugged. \"Enhancement's really hard, huh?\"\n\nGrid said nothing.\n\n***\n\nThe party left the 8th city and stopped in the desert. They needed to plan their next move. Grid wanted to push straight for the 6th city, but circumstances intervened.\n\nSehee yawned. \"I'm logging out. School tomorrow.\"\n\n\"It's already 2 a.m.\" Yerim stretched. \"I need to sleep by 10 p.m. for proper development.\"\n\nGrid waved them off. \"Go. Thanks for today.\"\n\n\"See you tomorrow!\"\n\nThey vanished. The sudden quiet felt oppressive.\n\n\"The cute kids left.\"\n\nShould he log out early? Grid's expression turned sly as he examined Latina's final drop.\n\n> [<span class=\"rarity-legendary\">Direct Vampire's Pajamas</span>]\n> \n> Rating: Legendary\n> \n> A short, white nightgown.\n> \n> The skin shines through when worn. Use caution.\n> \n> **Conditions of Use:** None.\n> \n> **Weight:** 30\n\nHe grinned.\n\nThe Direct Vampire's Pajamas. Performance unknown. But the design? Latina's sleepwear had been devastatingly provocative.\n\n*Irene would look incredible in this.*\n\nThe mental image stirred possibilities. Ten more children didn't seem unreasonable.\n\nA whisper interrupted his scheming. Lauel.\n\n*Grid, I've finalized everything with the broadcasting station. Schedule's locked in.*\n\nGrid blinked. *OGC and Bunny Bunny approached first, like you predicted?*\n\n*Of course. No need to marvel at my brilliance. This is routine work.*\n\n*Right. What's the contract look like?*\n\n*Yura did excellent work. Review it later.*\n\n*Got it. Brief me on tomorrow's shooting schedule and future plans.*\n\n*Nothing's changed. Your hunt gets broadcast worldwide. While you hold everyone's attention, the Overgeared Guild moves on Patrian.*\n\nGrid frowned. *Is that safe? Patrian has Great Magician Ashur.*\n\nSatisfy scaled NPC levels to match rising user averages. Earl Ashur likely possessed his fourth advancement by now. His power would have grown exponentially. The Overgeared members might not survive.\n\nLauel's whisper carried absolute confidence.\n\n*I have a plan. Don't worry. Just enjoy your hunt.*"
}