{
  "id": 5,
  "title": "Chapter 5",
  "content": "# Chapter 5\n\nThe quest window hovered before me like a death sentence. The rewards? Spectacular. The problem? Everything else.\n\n*This reward is actually good.*\n\n3,000 gold translated to 3,600,000 won. That was forty days of backbreaking labor at the construction site. But the real prize was the title itself.\n\n'Earl's Son-in-Law.' All stats plus twenty.\n\nI counted them off mentally: Strength, Stamina, Agility, Intelligence, Dexterity, Composure, Indomitable, Dignity, Insight. Nine total. Add Nobility, and that made ten.\n\nTwenty points across ten stats. Two hundred stat points. The equivalent of twenty levels, since each level granted ten points. And a beautiful noblewoman as my wife on top of that.\n\n*The path forward is clear. But...*\n\nThere was a reason the rewards glittered so brightly.\n\nS-grade difficulty.\n\n*Earl Ashur's Fury was S-grade too.*\n\nI'd been level 79 when I took that quest. Died repeatedly. Dropped to level 73. Spent three months on it. Three months of my life, gone.\n\nI was currently level negative one. Accepting an S-grade quest with a time limit would be suicide.\n\n*And if I fail, I drop two more levels.*\n\nMy body trembled. Rage and fear warred in my chest at the thought of hitting level negative three.\n\n*But why the hell is it S-grade again?*\n\nS-grade quests weren't common. Even top rankers over level 200 could count their S-grade quests on one hand. I was level negative one. A debt-ridden failure wearing a skull helmet.\n\nDoran's words echoed in my memory.\n\n'As you know, the Yatan Temple is filled with evil energy. Ordinary people will become afraid if they stay here for a while. But I observed you, and you are fine despite all the time that passed. In addition, you can even manage to laugh alone. You, don't you actually have great abilities?'\n\nThe hint was obvious now. The quest triggered based on time spent in the temple without falling into the 'fear' state. My title and Composure stat kept me immune to abnormal conditions.\n\nWas that good? Was I happy about it?\n\n*If this becomes a forced quest, I'm screwed. This game is trying to make me quit.*\n\nI met Doran's desperate gaze.\n\n\"I can't do it. Ask someone else.\"\n\n> [The quest was refused.]\n\nDoran didn't move. His knuckles whitened around his sword hilt.\n\n\"You are the only unusual person, so please help me. A precious person's life is involved!\"\n\n> [Doran is desperate. Do you understand his sad circumstances and accept the quest?]\n\nThe notification window had lost its mind. Did the system think I was in a position to save anyone?\n\nI swiped the window away. \"You're mistaken. I'm weak and incompetent. I can't help you. Handle it yourself.\"\n\n> [The quest was refused.]\n\n\"As you know, the believers of Yatan use powerful black magic! I can't rescue the young lady from them alone! Please don't turn away, lend me your strength!\"\n\n> [Doran hasn't given up. Would you like to accept the quest?]\n\nI clenched my jaw. \"No. I don't have the ability...\"\n\n> [The quest was refused.]\n\n\"You are too modest! Don't you know that the power to ignore their fear isn't common?\"\n\n> [Doran can only depend on you. Would you like to accept the quest?]\n\nSome NPCs were programmed like this. Persistent. Desperate. I understood Doran's situation. If he returned without his master's daughter, his head would roll.\n\nBut what about me? What happened when I failed and dropped another two levels?\n\nWhy should I suffer for a complete stranger? I was more important than Doran. More importantly, I genuinely lacked the ability to help.\n\n\"Please help! I am begging you!\"\n\nDoran dropped to his knees.\n\nI stared down at him. Every word I'd spoken went in one ear and out the other. He thought I was lying.\n\n*Probably the latter. Is staying in the Yatan Temple without feeling fear really so impressive? I haven't been here before. I don't even know what I'm supposed to feel.*\n\nI straightened my shoulders and tried once more, forcing sincerity into my voice.\n\n\"I'm really sorry, but I truly don't have the strength to help you. Don't waste your time on me. Call the earl and ask for his help.\"\n\n> [The quest was refused.]\n\n\"Every hour is urgent! The young lady's life might be in danger while I go to ask the earl for help! You are the only person I can rely on! This is a request!\"\n\n> [Doran is hoping for a helping hand. Would you like to accept the quest?]\n\nMy patience snapped.\n\n\"Ah, this is frustrating! You really need my help? I don't want to look at you anymore, so go away!\"\n\n\"Please give mercy for the sake of her life!\"\n\n\"What? No! Damn it.\" I turned my back. \"Yes, I should leave. I'm going now!\"\n\nI refused the quest and pivoted away from Doran. The quest would drop my level by two. I needed to avoid it. My legs, however, moved like they were wading through mud. I was 200% over the weight limit. My movement speed was reduced by 100%.\n\nDoran watched me shuffle forward at a turtle's pace. Tears welled in his eyes.\n\n\"You act so intimidatingly, but you are actually conflicted... You really do want to help me...\"\n\n*What?*\n\n\"Stop feeling conflicted and help me!\"\n\n> [Doran feels hope again. Would you like to accept the quest?]\n\n\"Bullshit! I won't help!\"\n\n> [The quest was refused.]\n\nI ignored him and quickened my pace. Or tried to. My speed remained glacial. Doran's misunderstanding deepened.\n\n\"Maybe you're conflicted because your life is busy, but the life of a person is more important! This is a request!!\"\n\n\"I can't! It isn't possible!\"\n\n\"Don't deceive yourself! In fact, you are suffering as well! You can't leave this place immediately, which is why there is such hesitation in your step!\"\n\n\"There is no hesitation! I'm not walking slowly! My baggage is heavy, that's all!\"\n\nDoran chased after me. My pathetic speed couldn't shake him.\n\n> [Would you like to accept the quest?]\n\n> [Would you like to accept the quest?]\n\n> [Would you like...]\n\n*This stupid bastard!*\n\nThe notification windows multiplied no matter how many times I refused. I needed to make a drastic decision.\n\n*I can't continue like this. I have to refuse him, even if it creates a hostile relationship. He isn't an NPC I need. Having him as an enemy won't hurt.*\n\nI drew Mamon's greatsword. The weight settled in my hands as I glared at Doran.\n\n\"I definitely can't help you. If you don't get away right now, I'm prepared to hurt you.\"\n\nDoran read the atmosphere. He stepped back. His mouth opened slowly.\n\n\"I really wish you would help me...\"\n\n> [Doran is asking for the last time. Would you like to accept the quest?]\n\nSwipe!\n\nHow many times did I have to dismiss this damned notification?\n\n\"I won't help! Even if I could help, I don't want to! I won't help!\"\n\nMy stress peaked. I could no longer suppress my anger. I yelled and swung Mamon's greatsword, expressing my intent to never speak to Doran again.\n\nThen...\n\n*Kwajak!*\n\n\"Kaaack!\"\n\nThe sensation of hitting something transmitted through my fingertips. A scream rang out simultaneously. I turned my gaze to the side of the greatsword.\n\nA believer wearing the robe of Yatan had collapsed. Mamon's greatsword jutted from his neck. An ominous chill crawled down my spine.\n\n\"I was aiming at the crazy guy, so why did the person next to him...\"\n\nI stared at the dying believer. A new notification window appeared.\n\n> [Your relationship with the Yatan Church has become hostile.]\n\n> [You won't be able to receive Yatan's blessings.]\n\n> [The followers of Yatan will try to kill you when they find you.]\n\nThe atmosphere of the temple shifted. Dozens of Yatan believers surrounded me. Doran sprang to his feet. He placed a hand on my shoulder.\n\n\"Thank you!!\"\n\n\"What?\"\n\n> [**Rescue the Earl's Esteemed Daughter**]\n>\n> **Difficulty:** S\n>\n> Irene, the only daughter of Earl Steim, is a beautiful and innocent virgin. The elders of Yatan had kidnapped Irene in order to sacrifice her for her virgin blood.\n>\n> You can't tolerate the evil deeds of Yatan's followers. You must surely rescue Irene.\n>\n> **Quest Clear Conditions:** Rescue Irene within one hour after accepting the quest.\n>\n> **Clear Reward:** 3,000 gold, a low probability of becoming the earl's son-in-law.\n>\n> * **Earl's son-in-law:** Nobility stat will open, all stats +20. You will be treated as a viscount after marrying the earl's esteemed daughter. Power and honor will rise. You can advance into the social circle of the nobles. You will receive a monthly salary. This can be a shortcut to becoming a high-ranking official or lord.\n>\n> **Quest Failure:** Level -2.\n\n> [The quest has been accepted.]\n\n\"Wow.\"\n\nDue to my hostile relationship with the Yatan Church, the quest had been forced upon me.\n\n\"Huhuhu...\"\n\nSome might call this unlucky. They'd be wrong. This transcended bad luck.\n\n*Failure once again... it'll be level negative three.*\n\nI had no luck. Perhaps I'd sold out my country in a previous life.\n\n\"Who dares hurt Yatan's believers! Aren't you afraid of the curse of God Yatan?\"\n\n\"God Yatan is almighty! God Yatan has already noticed your sin! You won't be safe for the rest of your life!\"\n\n\"You will pay a heavy price for your blasphemy!\"\n\nThe angry voices of the Yatan followers clamored around me. Their crazed eyes burned with absolute hostility.\n\n*Will I die now?*\n\nThe followers of Yatan were black magicians. Black magicians specialized in curses. They were difficult to deal with."
}