{
  "id": 50,
  "title": "Chapter 50",
  "content": "# Chapter 50\n\nGrid's status window sprawled before him, a mess of numbers that should have filled him with pride. Level 45. Stats comparable to someone in the mid-200s. Six rare stats: **Persistence**, **Composure**, **Indomitable**, **Dignity**, **Insight**, and **Courage**. Four titles clutched to his chest like lottery tickets.\n\nThe math said he was strong. The game said he was legendary.\n\nGrid stared at the numbers and felt only the familiar weight of inadequacy pressing on his sternum.\n\n*I hammered until my hands went numb. Trained like a dog. Completed quests that should have killed me three times over. And this is it?* He clenched his jaw. *I fought a knight one-on-one at level 21. A knight. And my reward is... this?*\n\nThe bitterness coated his tongue like old pennies.\n\n*By now all my stats should be at 300. What kind of legendary class is this? Euphemina has an epic class and she can use every type of magic without chanting. She doesn't even need to speak. Just waves her hand and boom, instant spell.*\n\nGrid's eyes slid toward Euphemina. She wore a magician's robe that probably cost more than his rent. Rabbit stood beside her in chain mail, gripping a one-handed sword that gleamed with expense. His subordinates held an arsenal: spears, swords, bows.\n\n*They're not heavily armored.* Grid's mind shifted into survival mode, the same animal calculation that kept him alive in the slums. *If I pump attack power, I can handle them. But I'm not wearing armor right now. Need stamina. Need defense. Agility's covered with the Ideal Dagger...*\n\nHis fingers moved through the interface without hesitation.\n\n*150 points in **Strength**. 90 in **Stamina**.*\n\nThe logical part of his brain screamed at him. As a blacksmith, **Dexterity** was the smart investment. Higher dexterity meant better items, which meant better sales, which meant paying off his suffocating debt faster. But Grid had never been good at listening to the logical part of his brain.\n\n*I was born a warrior.* The thought felt like justification. *And dexterity increases naturally when I craft. I don't need to waste points on it.*\n\nBesides, that 'First Unique Item Maker' title from beating Euphemina had already stuffed 200 points into dexterity. The memory of that victory still tasted sweet.\n\nThe system notification materialized.\n\n> [You have invested 150 points in **Strength**. Is this correct?]\n\n\"Yes.\"\n\n> [Once the points are invested, it cannot be reversed. Do you want to proceed?]\n\n\"Yes.\"\n\n> [You have invested 90 points in **Stamina**. Is this correct?]\n\n\"That's right.\" Grid waved his hand at the screen. \"No need to ask. Just do it.\"\n\n> [Your changed stats will be applied.]\n\nHis **Strength** climbed to 316. **Stamina** settled at 334. The numbers glowed briefly before fading into permanence.\n\nFor context, the average blacksmith user sat at 80 **Strength** and 100 **Stamina**. Grid's numbers were obscene.\n\nBut comparing to blacksmiths was missing the point. The real measure was combat classes.\n\nA level 45 warrior averaged 210 **Strength** and 100 **Stamina**. Defense-focused builds ran 100 **Strength**, 230 **Stamina**. Speed builds hovered around 120 **Strength**, 80 **Stamina**. Most importantly, a typical level 45 combat class possessed fewer than 500 total stat points.\n\nGrid's stats weren't just good. They were overwhelming.\n\nHe had no idea.\n\nFrom the moment he'd stumbled into this legendary class, Grid had collided with the strong. Earl Ashur and his knights. Doran. Yura. Leo. Euphemina. An endless parade of people who made him feel small. So he assumed he was weak. He assumed everyone else was like them.\n\nBut the truth was simpler. With the <span class=\"rarity-unique\">Ideal Dagger</span> equipped, Grid could flatten a level 100 combat class without breaking a sweat.\n\nGrid's muscles tensed as he prepared to strike. Euphemina first, then Rabbit.\n\n\"Hey, Rabbit!\" Baron Lowe's voice cracked across the chamber. \"Why are you talking to that evil girl? I need you to save me!\"\n\nRabbit's head turned. His expression remained flat as parchment. \"You still haven't grasped the situation?\"\n\nBaron Lowe blinked.\n\nRabbit's lips barely moved. \"I didn't come here to help you. I'm the one who hired Euphemina to break into your castle in the first place.\"\n\n\"What?\"\n\n\"Eh?\"\n\nBaron Lowe and Grid spoke simultaneously, their voices colliding in the stale dungeon air.\n\nRabbit dropped the next words like stones into still water. \"I don't belong to the Mero Company anymore.\"\n\nBaron Lowe's face drained of color. \"What does that...\"\n\n\"Valmont is becoming increasingly oppressive.\" Rabbit's tone remained clinical, detached. \"Ever since he took control of Winston's trade with your help, he's been impossible. The man can't read the mood in the village. He will fall soon. I decided to leave before the Mero Company collapses completely.\"\n\nRabbit's eyes fixed on the baron. \"Today, I'm here to punish you and Valmont.\"\n\nBaron Lowe's face flushed crimson. \"You!\" Spittle flew from his lips. \"You're just a traitor! What right do you have to punish us? You're a merchant, not an apostle of justice!\"\n\n\"You're correct. I am a merchant.\" Rabbit's hand rose, finger extended. \"That's why I only move for profit. I have no sense of justice. That's why I want to kill you and Valmont.\"\n\nHe pointed directly at Grid.\n\nGrid's brain stuttered. \"Eh? Me?\"\n\nRabbit bowed. The motion was precise, rehearsed. \"I'm glad you're safe, Grid. It was correct to leave this to Euphemina.\"\n\n\"What is this?\" Grid's hands spread helplessly. \"Why did you betray the Mero Company?\"\n\nRabbit straightened. A smile ghosted across his features. \"I saw your blacksmithing and realized a new future.\"\n\n\"New future?\"\n\n\"Grid.\" Rabbit stepped closer. \"You know it yourself. Your potential is excellent. Your work will one day be traded among people at high prices. You'll make a substantial amount of money.\"\n\nHe paused. \"However, it's hard to do business as an individual. There will be limitations to your earnings. So I'd like to work with you. I'll provide my experience as a merchant and the network I've built. I'll ensure many people can use your work, from the Eternal Kingdom to other kingdoms.\"\n\nRabbit's voice took on an edge of hunger. \"We'll make the best smithy. Profits comparable to a small or medium-sized company. If you and I join forces, we can clearly succeed.\"\n\nHis eyes gleamed. \"But for me to work with you, I need to reform my image. I need to appeal to you and the residents of Winston. That's why I rescued you. That's why I prepared the means to take down the Mero Company and Winston's lord.\"\n\nGrid's mouth worked silently for a moment. \"So... you betrayed the Mero Company because you want to work with me? You sent Euphemina to rescue me?\"\n\n\"That's right.\"\n\n\"It's appreciated.\" Grid's brow furrowed. \"But why do you need the liking of Winston's residents?\"\n\n\"Our business will start at Khan's smithy.\" Rabbit gestured as if sketching a map. \"It has geographical advantages. Khan's smithy is the ideal base. Which means I need to get a job there. But how can I get a job when I'm blamed by Winston's residents?\"\n\n\"Ahh.\" Understanding dawned slowly. \"I see. How exactly do you plan to do business?\"\n\nEuphemina's voice cut through the exchange. \"Do you have enough time to spare?\" She tapped her foot. \"We're in a hurry.\"\n\n\"Yes, I understand.\" Rabbit turned back to Grid. \"I'm afraid the detailed explanation needs to wait for our next meeting. For now, you only need to know one thing.\" He bowed again. \"I will make you rich. Now I'm going.\"\n\nRabbit spun on his heel and strode toward the exit, his subordinates falling in behind him.\n\nGrid stood frozen, confusion buzzing in his skull. The man who'd been his enemy was now talking about business partnerships. The whiplash made his head hurt.\n\n*Can't be helped.* He rubbed his temples. *I'm tired. My head isn't working properly. Need to log out and take a break.*\n\n\"Hey, Grid.\" Euphemina's voice stopped him mid-turn. \"Did you forget something?\"\n\nGrid's shoulders tensed. *This girl only saved me because of a quest. Why is she acting so condescending?* But the thought felt hollow. *Well... she did rescue me. And she gave me back my unique dagger.*\n\nWithout Euphemina, he would have failed the quest to rescue Huroi. The debt was real.\n\nGrid turned and dipped his head. \"Thank you again.\"\n\nEuphemina's eyes narrowed. \"Did you think I called you just to hear that?\" Her arms crossed. \"Surely you haven't forgotten?\"\n\n\"What?\"\n\n\"You promised to make me a unique rated orb.\"\n\nGrid's blood turned to slush. \"H-How could I forget?\" The lie came automatically. \"Of course I remember.\"\n\nHe had absolutely forgotten. The image of Euphemina killing him for breaking his promise flashed through his mind with vivid clarity.\n\n\"I'll make it for you.\" Grid forced his voice steady. \"But I need a method for making orbs. Naturally, I'll also need the materials.\"\n\nHe was sincere. Not because he wanted to repay Euphemina for her help. That thought never crossed his mind.\n\n*This is a perfect chance to learn another production method for free!* The realization made his pulse quicken. *And every time I make an item, my production skills increase. Why not raise my skill level using her materials?*\n\n\"I understand.\" Euphemina nodded once. \"I'll contact you when I obtain them.\"\n\nShe vanished through the doorway without ceremony.\n\nGrid stood alone in the dungeon's stale air. His thoughts circled like sharks.\n\n*If I join hands with Rabbit... can I really become a blacksmith who earns like a small business company?*\n\nHe already knew his class was lucrative. With enough effort, he could eliminate his debt someday. Maybe even buy a foreign car. But the future Rabbit described was different. Bigger.\n\nThe revenue from converting small amounts of gold into cash was nothing compared to a company's income. If he could earn that much as a blacksmith...\n\n*A foreign car would be nothing. I could live in a mansion. Have multiple foreign cars.* His breathing quickened. *If I have that much financial power, Ahyoung will be attracted to me!*\n\nHis whole body trembled with anticipation.\n\n***\n\nOutside the dungeon, Rabbit walked beside Euphemina through the cool night air.\n\n\"Grid seems afraid of you.\" Rabbit glanced sideways at her. \"Did something happen?\"\n\n\"What?\" Euphemina laughed, the sound sharp and clear. \"Does it make sense that he's afraid of me?\"\n\nShe shook her head. \"Grid is the one who defeated the knight called the Northern Nova. He overwhelmed four knights with just his presence. Does such a mighty person fear anything in this world?\" Her smile widened. \"That guy is just playing with me. He isn't actually afraid.\"\n\nRabbit stopped walking. \"Wait. What did you say just now?\" He turned to face her fully. \"Grid has the power to overcome a knight?\"\n\n\"Yes.\"\n\n\"Isn't Grid a blacksmith?\"\n\n\"Yes.\" Euphemina's eyes gleamed in the darkness. \"He certainly is a blacksmith. But he's also strong. I don't know what his identity is.\"\n\nSilence stretched between them.\n\nA blacksmith who could create unique items. A blacksmith who was strong. The pieces clicked together in Rabbit's mind.\n\n*Perhaps he is...*\n\nThe legendary blacksmith. Pagma. Most people only knew him as a great craftsman. But Rabbit had searched through related documents and discovered the truth. Pagma wasn't exactly a blacksmith.\n\n*If he inherited Pagma's skills... he's not only an excellent blacksmith but also possesses excellent combat ability.* Rabbit's heart hammered against his ribs. *Is Grid Pagma's Descendant? That's right. It's the most likely option.*\n\nHe'd never imagined his chosen business partner would be a legend's descendant.\n\nJoy flooded through him, vast and wordless.\n\n*I'm lucky. This is an opportunity to sell works that contain Pagma's soul.*\n\nIf he worked with Pagma's Descendant, profits equivalent to a massive business company were possible. Rabbit felt light, buoyant. He quickened his pace toward the Mero Company headquarters.\n\n***\n\n\"R-Rabbit! You bastard!\"\n\nValmont and Philipson, still oblivious to the castle's collapse and invasion, were caught completely by surprise.\n\nPhilipson died first. Euphemina's fury over the kidnapped young girl manifested in brutal efficiency.\n\nValmont and Baron Lowe were dragged to Frontier and executed by Earl Steim's order.\n\nBut variables exist in every plan.\n\nEarl Steim's voice carried the weight of stone. \"It's obvious that Rabbit saved the Winston residents from crisis. However, he has noticeably been the Mero Company's second-in-command for a long time. Rabbit could be considered a felon for persecuting Winston's residents.\"\n\nThe earl's eyes were cold. \"I sentence him to 10 years in prison.\"\n\nRabbit's jaw clenched. He'd overlooked that Earl Steim was a stern figure. He'd expected forgiveness in recognition of his contribution to the Mero Company's downfall. The sentence landed like a hammer.\n\nRabbit was unhappy. But the earl's decision was absolute.\n\nHe forced his expression smooth as they led him toward the cells. \"I've formed a relationship with Mr. Grid.\" The words tasted like consolation. \"It's regretful. But he recognizes my merits. I should just be glad about that.\"\n\nRabbit smiled as prison bars closed behind him. He was satisfied to decorate even one page of a future legend's biography.\n\n***\n\nWinston entered a new era.\n\nThe village upgraded to a city. The new lord, dispatched by Earl Steim, distributed exclusive merchandise to residents and reimbursed their heavy debts.\n\nThe residents of Winston began talking about heroes.\n\n\"Do you know the person called Rabbit?\" An old woman leaned close to her neighbor. \"Originally, he was the second highest ranked person in the Mero Company. But he couldn't tolerate Valmont and Baron Lowe's evil. He led to their downfall. He's currently in prison, but he's the reason we can live like this now.\"\n\n\"Do you know the most beautiful woman in the world?\" A merchant spoke to travelers at the tavern. \"Her heart is as beautiful as her face. She ran alone into the castle to save Winston's residents. She's the protagonist who brought Winston peace.\"\n\n\"There was a young blacksmith.\" An elderly man's voice cracked with emotion. \"The young man had a strong sense of justice. He fought valiantly to protect Winston's residents from the Mero Company and Baron Lowe. He tried to protect Khan's smithy. He jumped into the dungeon to rescue the man arrested for trying to reach Earl Steim.\"\n\nThe old man's eyes glistened. \"I'm over 80 years old this year. That man is young enough to be my grandchild. But I respect him regardless of his age. Such a just and courageous person is rare.\"\n\nRabbit. The beauty. The young blacksmith.\n\nTravelers who came to Winston were exposed to stories of the three from every resident. Evidence that their reputation had reached its peak in Winston.\n\nIrene, Winston's new lady, showed great interest in the beauty and the young blacksmith.\n\nShe stood at her window, gazing out at the city. \"Their merits should be recognized.\" Her fingers drummed against the sill. \"I'd like to meet them as soon as possible.\""
}