{
  "id": 500,
  "title": "Chapter 500",
  "content": "One year and three months in real time equaled three years and nine months in Satisfy. That was how long Lauel had served Grid. From the moment he first recognized Grid's potential until now, he had worked harder for Overgeared than anyone else.\n\nLike any Satisfy player, he'd once dreamt of greatness. To be the architect behind a kingdom's rise.\n\n*It's been so long...*\n\nThe journey was difficult. Painful, even. But those hardships made the victories sweeter. Grid and the Overgeared members. His colleagues. They'd weathered countless crises together. Grid naming the guild 'Overgeared' (which somehow happened three separate times), the political upheavals, the wars. Yet through it all, the sense of accomplishment never faded.\n\n\"...\"\n\nLauel opened his eyes in his office, a satisfied smile crossing his face after finishing his whisper to Grid. Faker stood before him. Silent as always, having materialized without warning. By now, Lauel had grown accustomed to these sudden appearances.\n\n\"Have the scouts reported back?\" Lauel asked.\n\nThe soldiers of Reidan were exceptional. Trained by Piaro and Asmophel, former pillars of the Saharan Empire, they possessed levels and capabilities far beyond ordinary troops of equivalent rank. Add Grid's equipment to the equation, and Reidan's military force became truly elite. Among them were scouts trained personally by Faker, masters of stealth and rapid reconnaissance.\n\nFaker's response did not disappoint.\n\n\"I've obtained the layout of Patrian.\"\n\n\"Excellent!\" \n\nColor rushed to Lauel's cheeks. He leaned forward, eager for the full report, but Faker's expression remained grave.\n\n\"Should we really expose Grid's power like this?\"\n\nThe battle would be easier, but once they broadcast Grid's hunting capabilities, every hostile force would study the footage. Develop countermeasures.\n\n*He's right.* \n\nFaker rarely voiced his concerns. He operated in silence, observing from the shadows. But beneath that quiet exterior lived the same loyalty that drove all of Overgeared's core members. Not mere duty. Something deeper. Friendship. Affection.\n\n*He's watched over Grid even longer than I have.*\n\nLauel's smile returned, confident this time.\n\n\"You don't need to worry about the world learning Grid's full capabilities.\"\n\nGrid's greatest strength wasn't any single skill or item. It was flexibility. He created equipment tailored to every situation, every opponent. \n\n\"The Grid they see today won't be the same Grid they face tomorrow.\" Lauel spread his hands. \"The world will never measure him completely. By the time someone analyzes his current weaknesses, he'll have already evolved. New items. New abilities. Always changing.\"\n\n***\n\nBland de Ian chewed his potato slowly.\n\nThe only son of Earl Ashur, one of the ten Great Magicians on the continent. Three years had passed since Grid took him hostage. Three years of unexpected education under Piaro's guidance. He'd mastered every farming implement, learned to channel mana through soil and seed. His natural talent for magic, inherited from his father, combined with his swordsmanship and Piaro's agricultural techniques had created something entirely new.\n\nPeople called him the 'Magic Swordsman of the Field.'\n\nHe was formidable. In the fields, at least.\n\n\"Have you reflected on your time in Reidan?\" \n\nLauel's voice interrupted the farmers' snack break. Bland looked up, dirt smudged across his expensive bloodline, potato bulging in his cheek.\n\n\"Reflected on my life as a hostage, you mean?\" The words came out cynical.\n\n\"No. We've never treated you as a hostage.\"\n\n\"...\"\n\n\"You've been respected. Allowed freedom. So I'll ask again. How has your life in Reidan been?\"\n\nSilence stretched between them. Bland swallowed his potato.\n\nLauel spoke truth. After that first day of mandatory fieldwork, no one had forced Bland to do anything. No guards followed him. No restrictions bound him. Bland could have escaped dozens of times. But he hadn't. He'd stayed, and the reason was embarrassingly simple.\n\nHe was comfortable here.\n\nGrowing up as a prestigious heir, the son of a Great Magician, expectations and prejudice had been his constant companions. But in Reidan, as an ordinary farmer, he'd found something precious. The Overgeared members and Reidan's citizens treated him like anyone else. No different. No special.\n\n\"It's... not terrible.\" Bland looked away, cheeks still full.\n\n\"What if Earl Ashur could live here with you?\"\n\n\"...!\"\n\nThe potato nearly lodged in Bland's throat. His eyes widened, then narrowed with fury.\n\n\"Earl Lauel! What are you saying? Don't tell me you're—\"\n\nPrince Ren had declared war on Duke Grid. Prince Aslan killed Ren and seized the throne. Bland knew the truth the world didn't. Living in Reidan, he couldn't avoid such knowledge. He'd seen this coming. King Aslan viewed Reidan, which possessed dangerous truths, as a threat. Eventually, Reidan would break from the Eternal Kingdom. His father would be caught in that storm.\n\nBut not this soon. Not this fast.\n\n\"You're planning to rebel against the royal family! To threaten Patrian!\" Anxiety for his father sharpened every word.\n\nLauel raised two fingers.\n\n\"Two corrections to your statement.\" His voice remained calm. \"First, yes, we're hostile to the Eternal Kingdom. But we're not rebels. Duke Grid swore allegiance to King Wiesbaden. When the King died, our oath died with him. We no longer belong to the Eternal Kingdom. Therefore, hostility does not equal rebellion.\"\n\n\"...\"\n\nSophistry. But politics always was. Even the thinnest justification could be spun into legitimacy. Bland couldn't argue, and Lauel pressed on.\n\n\"Second, I have no intention of threatening Patrian. How could we threaten one of the most fortified cities in Eternal, ruled by Earl Ashur, one of the ten Great Magicians?\" Lauel's eyes gleamed. \"We want to embrace it. And I need your help to do that.\"\n\n\"You want me to persuade my father? He'd never abandon the Eternal Kingdom for Duke Grid!\"\n\nThe Ashur family had served Eternal's royal line for generations. Loyalty ran in their blood. Earl Ashur would never betray that legacy. Bland was certain.\n\nLauel's expression suggested he thought otherwise.\n\n\"Prince Ren should be on that throne, not Prince Aslan. But Aslan borrowed power from a foreign nation and murdered his brother. That's an unforgivable sin. The current royal family is illegitimate.\" Lauel leaned closer. \"Earl Ashur has no reason to serve false kings.\"\n\n\"...\"\n\nBland's hands trembled. \n\n\"The pure, honest Bland who loves potatoes...\" Lauel's voice dropped to a whisper. \"If you don't want your father serving as a puppet to usurpers, you should come with me. Tell him the truth. I'll protect you, even if the journey proves dangerous.\"\n\nBland's fingers curled into fists. Every muscle in his body contracted. Sweat rolled down his spine. He'd never felt this sensation before. This weight. After a moment, he nodded, forcing his breathing to steady.\n\n\"I understand.\" The words came quietly. \"I'd like my father to taste the rainbow potato too.\"\n\nHis father had dedicated his entire life to the country out of generational obligation. Perhaps it was time to show him there were other pleasures in life. Other paths worth walking.\n\nLauel smiled with satisfaction, then turned his gaze skyward. Toward Gauss.\n\n*I've prepared the fishing rod. Now I need the bait.*\n\n***\n\n\"By order of Earl Lauel!\"\n\n\"We deploy in four hours!\"\n\nReidan had nine knights. Jude, who'd served Grid longest, and eight younger talents raised by Piaro and Asmophel. The younger knights possessed impressive skills. Their swordsmanship, agricultural knowledge, and tactical abilities marked them as future elites. Not yet a match for the Red Knights, but far superior to the Black Knights. With continued training under Piaro and Asmophel, they might one day reach that legendary standard.\n\nNow they ran through the barracks, checking on the soldiers, confusion evident in every movement.\n\n\"Where's the commander?\"\n\n\"He didn't show up again today?\"\n\nEver since the journey to Siren, Commander Asmophel had been acting strange. For several days he'd seemed distant, preoccupied. Then, a month ago, he'd vanished entirely. None of the knights had seen him anywhere in Reidan. They'd asked the Overgeared nobles, including Lauel, about Asmophel's whereabouts. The only answer they received was \"don't worry.\"\n\nBut how could they not worry? Asmophel was strong, clever, capable of handling himself. They understood that. But to disappear before a campaign? Commander Piaro was still in Siren. If Asmophel wasn't here, who would lead the army?\n\nThe eight young knights turned their attention to Jude, who stood quietly off to one side.\n\n\"Will he command in Asmophel's place?\"\n\n\"I heard he's served Duke Grid for years. Must have plenty of accomplishments.\"\n\n\"But is he capable enough to replace Asmophel?\"\n\n\"Duke Grid chose him personally. Of course he's skilled. He's been Winston's protector for a long time.\"\n\nAfter debating among themselves, the young knights approached Jude.\n\n\"Sir Jude, the soldiers are ready. We can deploy at any time.\"\n\n\"What are your orders?\"\n\n\"...\"\n\nJude's silence stretched. He stared at the assembled soldiers, his expression so solemn that the young knights found themselves swallowing nervously.\n\n*Did we make a mistake?*\n\n*Did we deploy the soldiers incorrectly?*\n\nTension built as Jude remained motionless. Finally, after what felt like an eternity, he spoke.\n\n\"We. Go. Where?\"\n\n\"...?\"\n\n*Is this a joke?*\n\nThe young knights didn't yet understand the reality of their senior knight.\n\nMeanwhile, among the three thousand soldiers of Reidan standing in formation before Jude and the eight knights, one soldier watched with especially sharp eyes.\n\n*I'm still not strong enough. Unless I start from the bottom as a common soldier, building achievements and experience through merit alone, Duke Grid won't recognize me. I'll never reach higher ground.* The soldier's jaw clenched with determination. *I'll give everything I have.*\n\nThe identity of this particular soldier was, remarkably, Commander Asmophel himself."
}