{
  "id": 501,
  "title": "Chapter 501",
  "content": "Grid raised his hand toward the shifting dunes. \"Let's go! Overgeared Skeletons!\"\n\n*Clack!* *Clack clack clack!*\n\nTwo skeletal figures materialized in the sand behind him, their bones rattling as they lurched forward. Grid wiped sweat from his brow and started across Reidan's desert, his black hair whipping in the wind.\n\n*Hwiiiing~~~~~~~*\n\nThe desert wind howled. Grid squeezed his eyes shut as grit blasted into his face. \"Ah!\" He spat sand from his mouth, grimacing at the taste.\n\nBehind him, the skeletons stumbled forward, oblivious. Their hollow eye sockets held no awareness of the storm.\n\n*Clack!*\n\n*Clack clack!* *Clack!*\n\nThe wind intensified. One skeleton's arm twisted backward with a grinding crunch. The other's leg bent at an impossible angle. They moved like drunken marionettes, limbs separating from joints, bones scattering across the sand.\n\n> [The Overgeared Skeletons have suffered catastrophic damage!]  \n> [Overgeared Skeleton (1) has returned to the soil.]  \n> [Overgeared Skeleton (2) has returned to the soil.]  \n> [The Overgeared Skeletons won't lose experience.]\n\nGrid stared at the pile of bones behind him.\n\n*This can't be happening.*\n\nAfter capturing the 8th vampire city, he'd planned to train his new summons on the weakest prey in the desert. Young scorpions barely qualified as monsters at level 20 to 30. They existed as food for actual threats. With proper support, even garbage-tier skeletons should have been able to grind experience off them.\n\nThe wind had other ideas.\n\n\"Wow.\" Grid kicked at a skull fragment. \"Seriously trash.\"\n\nMost undead suffered from weak durability. Shattered bones meant reduced combat ability. But the Overgeared Skeletons existed in a category beyond mere fragility. Their stats were so abysmal that a stiff breeze qualified as a lethal threat. In his entire career battling the undead, Grid had never encountered summons this pathetic.\n\nHe pulled up the skill description again, reading the reward text. *The power obtained from defeating a direct descendant...*\n\nHigh growth potential. The words mocked him from the screen. Sure, these skeletons might eventually become powerful. But even at maximum level, would they compare to a death knight? Was the investment worth it?\n\n*Wait.*\n\nGrid scrolled through the skill details again. The experience loss immunity caught his eye. Unlike normal summons, these skeletons didn't suffer penalties for death. They simply died and could be resummoned. If he spent enough time grinding with them, their levels would eventually climb.\n\nGrid turned back toward Reidan's walls, visible in the distance. \"I should hunt rabbits when I return.\"\n\nHe opened his menu and selected logout. Sleep deprivation had caught up with him after two days of constant dungeon diving. His head throbbed and his eyes felt like sandpaper.\n\nThe desert faded to black.\n\n***\n\nLauel's fingers flew across the keyboard at his desk, working through the night while Grid slept. The other Overgeared members had stopped commenting on their chief of staff's inhuman work schedule. Some found it inspiring. Others just felt guilty.\n\nHe pulled up a map of the northern continent, focusing on the border between two kingdoms. The Gauss Kingdom occupied the northernmost territory, its southern border pressed against the Eternal Kingdom. Geography had cursed both nations. To reach the continent's center, Gauss needed to pass through Eternal. To reach the sea, Eternal needed to pass through Gauss. Trade between them bled gold through punitive tariffs, but Gauss suffered more. The Eternal Kingdom could at least access the continent's heart without paying tribute.\n\nLauel smiled. Resentment made people predictable.\n\nIn the fortified city of Borneo, Marquis Valtin stood at his window and glared north toward Patrian. His jaw clenched.\n\n\"If it wasn't for Earl Ashur!\"\n\nThe marquis had defended Borneo for decades, just as his father and grandfather had before him. The fortified city existed for one purpose: to stand against Patrian, Eternal's northern fortress. Historically, the two cities had clashed hundreds of times. Blood had soaked the fields between them.\n\nBut the battles had stopped years ago. One man had ended the conflict through overwhelming force. Earl Ashur, one of the ten great magicians on the continent, ruled Patrian now. What did it matter how well trained Valtin's army was? Magic could burn ten thousand soldiers to ash before they crossed the field.\n\nValtin's hand tightened on the windowsill. \"I should've learned magic when I was young.\"\n\nInstead, he'd chosen the sword. A mistake he'd regretted for years.\n\nA knock interrupted his brooding.\n\n\"A guest from the Eternal Kingdom has come to see you.\"\n\nValtin straightened and smoothed his uniform. \"Hrmm.\"\n\nGauss and Eternal might be rivals, but diplomacy required civility. Neighboring kingdoms maintained surface-level courtesy even when they despised each other. Anyone traveling from Eternal to Gauss needed to pass through Borneo, which meant Valtin regularly hosted nobles and merchants from the south.\n\nHe arranged his face into a professional smile. \"Come in.\"\n\nThe door opened. A young man with silver hair entered, moving with careful precision. He looked barely old enough to shave.\n\n*A boy?*\n\nValtin blinked but kept his expression neutral. \"Welcome to Borneo.\" He gestured to a chair. \"What should I call you?\"\n\nThe silver-haired visitor bowed. \"I am Earl Lauel of Eternal. I come on behalf of Duke Grid of Reidan.\"\n\nValtin's eyes narrowed. *Ah.*\n\nHe knew those names. Everyone on the continent knew those names. A few years ago, Grid and Lauel had saved Reinhardt from a golem invasion. The Eternal Kingdom had hailed them as heroes. Valtin had followed the story with interest, keeping detailed notes on these powerful users.\n\nBut the story had taken a darker turn recently. Grid had killed Prince Ren, the first in line for Eternal's throne. The official narrative claimed it was murder. The relationship between Reidan and the royal family had shattered. Isolation seemed inevitable.\n\n*So they've come here.*\n\nAnticipation coiled in Valtin's chest. He suppressed it ruthlessly and extended his hand. \"You're the famous Earl Lauel? Huhu, we have heard of you even in the Gauss Kingdom. It's an honor to meet you.\"\n\nLauel shook the offered hand with both of his, showing deference. \"It's an honor to meet Marquis Valtin, the lion of Gauss.\" He released the handshake and smiled. \"Isn't even Earl Ashur, one of the great magicians on the continent, afraid of you?\"\n\n\"Hahahat! I guess so!\"\n\nWarmth flooded through Valtin's chest. The flattery struck perfectly at his inferiority complex. Better still, the young earl wasn't lying. Valtin had spent decades mastering defensive warfare. No one defended fortified positions better than him. The only reason Earl Ashur hadn't invaded Borneo was because the casualties would be unacceptable.\n\nValtin settled into his chair, feeling generous. \"Why did you come here?\"\n\nLauel's expression turned grave. \"Eternal's royal family is making Reidan impoverished. Duke Grid can no longer endure it and has decided to become independent from Eternal.\"\n\n*There it is.*\n\nThe information aligned with everything Valtin knew. Grid had only sworn allegiance to the previous king, Wiesbaden. The current king had framed Grid for Prince Ren's death. Bad blood between them was common knowledge across the continent.\n\nValtin leaned forward. \"I'm listening.\"\n\n\"Duke Grid needs Marquis Steim's help to become completely independent.\" Lauel pulled out a document. \"In order to connect the north and west, Duke Grid made a plan to invade and occupy Patrian.\"\n\nValtin's heart hammered against his ribs. He kept his face neutral, but excitement blazed through his veins. Patrian. His nemesis. The prize that Earl Ashur had denied him for years.\n\nLauel continued without waiting for a response. \"As you know, Reidan is a desolate land. The population is less than 20,000 and the troops are few. The quality of the soldiers is low. We can't occupy Patrian with just our strength.\"\n\nThe young earl bowed deeply, his forehead nearly touching the desk.\n\n\"So Marquis Valtin, please help us. Send the powerful soldiers of Borneo as reinforcements and help us occupy Patrian.\"\n\nDesperation dripped from every word. Valtin watched Lauel's bent head and suppressed a smile. The boy was begging. Good.\n\n\"What will the Gauss Kingdom get in return for helping Duke Grid?\"\n\nLauel straightened and placed a thick contract on the desk. \"If the occupation of Patrian succeeds, the north and west of Eternal will be connected and ruled by Duke Grid.\" He slid the document forward. \"Duke Grid has promised to remove all tariffs, as well as give a monthly tribute to the Gauss Kingdom. The details are contained in this agreement.\"\n\nValtin picked up the contract. His eyes widened as he read. The terms were extraordinary. Free trade. Monthly gold shipments. Military access. Everything Gauss needed to dominate the northern trade routes.\n\nIt was too good.\n\n\"Hrmm.\" Valtin set the contract down and studied Lauel's face. \"I know that Duke Grid is Marquis Steim's son-in-law. Marquis Steim rules the north. Why don't you borrow his power to occupy Patrian instead of coming to me?\"\n\nLauel's jaw tightened. \"King Aslan is blocking all communications with the north. There's no way to contact Marquis Steim. Duke Grid has become obsessed with breaking through at Patrian.\"\n\nThe answer made sense. Valtin nodded slowly. \"Okay, I understand.\" He tapped the contract. \"However, Duke Grid needs to handle Earl Ashur. We want to avoid losing as many troops as possible.\"\n\n\"Of course. Believe in us.\" Lauel met his eyes. \"I'm sure that you're aware of our skills.\"\n\nKingdom's Heroes. Valtin had read the reports. Grid's combat ability was legendary. If anyone could occupy Earl Ashur's attention long enough for an army to breach Patrian, it was him.\n\nValtin stood and extended his hand again. \"Okay, I will send the army.\"\n\nHis soldiers were elite, trained constantly, and hungry for war. They'd been stationed at Borneo for years with nothing to do but drill. This expedition would satisfy that thirst.\n\n*And if it succeeds...*\n\nThe glory would be his as much as Grid's.\n\nThe first thing Valtin did after Lauel left was draft a letter to the Gauss royal family. He explained the opportunity, outlined the terms, and requested permission to mobilize. While waiting for the response, he reorganized his garrison and selected the troops for deployment.\n\nThree days later, ten thousand soldiers marched south toward Patrian with Lauel riding at the front.\n\n***\n\nReidan fielded four thousand troops total. Three thousand had joined this expedition. If they failed, the city's defenses would crumble. A single determined attack could end everything.\n\nThe Overgeared members marched in the rear guard, protecting the supply wagons, and felt no anxiety. Most of the guild had joined this operation. Only Grid remained behind in Reidan. With this much force and talent, defeat seemed impossible.\n\nBlood Warrior Katz alone could turn battles. His presence radiated confidence through the ranks.\n\nToban frowned and studied the marching soldiers ahead. \"But why is the marching speed so fast?\"\n\nThe other members glanced at each other. The army had been pushing hard since departure, maintaining a pace that should have exhausted troops crossing a desert. Reidan's soldiers had adapted to the heat and sand, but this seemed excessive.\n\nToban waved off their concerns. \"Commander Asmophel must have a reason. His strategies are above ours. We just have to believe in him.\"\n\n\"Hmm, indeed.\"\n\nThe others nodded and returned their attention to watching for giant worms. The massive creatures occasionally attacked supply lines in the deep desert. Their role was to prevent that.\n\nNone of them knew that Asmophel wasn't with the army. They'd never seen the man at the front leading this rapid advance. They assumed the figure in commander's armor was the legendary strategist.\n\nAt the head of the column, Jude raised his fist and pointed north. His face was blank, his thoughts simpler than a child's. He possessed a maximum intelligence of twenty.\n\n\"Go. Destination. Patrian.\"\n\nThe army followed their oblivious commander toward war."
}