{
  "id": 502,
  "title": "Chapter 502",
  "content": "『 **The first legendary class! The first person to become a duke! The holder with the most medals in the National Competition! The master of the Overgeared Guild! The name of this brilliant person is Grid!!** What's the secret behind his level up that surged him forward **33 positions** in the rankings? Are you curious? Do you want to know? Yes! I'll tell you everything! In just moments, Grid's hunting video will be revealed on OGC Station! A live broadcast! You can watch it on TV, the Internet, or on the radio! Tune in to the OGC channel!! 』\n\nOGC poured everything into this broadcast. They gambled all their capital on advertising because they were certain it would succeed. As a result, OGC's ads flooded dozens of countries across the Internet, TV, newspapers, and magazines.\n\nIt was the right call. The response was massive. OGC's Internet channel buckled under the traffic, and within hours, OGC had already recouped more than they'd invested. The office buzzed with celebration.\n\nA producer slammed his desk. \"This is incredible! Way beyond projections!\"\n\n\"Of course it's succeeding.\" The marketing director grinned. \"We've got viewer numbers comparable to the National Competition.\"\n\n\"One billion views will seem quaint in a few days,\" someone else added.\n\n\"Even Bunny Bunny's private channel pulled millions.\"\n\n\"This is Grid's power. God Grid lives up to the name.\"\n\nDirector Lee crossed his arms, nodding. \"Everyone wants to know where Grid is hunting and how he's leveling so fast.\"\n\n\"They're dreaming of stealing his secrets. Hoping to become rankers themselves.\"\n\n\"Then let's give them a perfect broadcast!\" The producer stood, energized. \"This is OGC's chance to dominate the global market!\"\n\nShortly after, the live broadcast of Grid's hunting began. The viewer count climbed relentlessly. Meanwhile, Satisfy's active user count plummeted. It was almost identical to the National Competition metrics.\n\nExactly as Lauel had intended.\n\n***\n\n\"Move. Move. Move.\"\n\nCommander Jude led Reidan's army from the front. Their pace was brutal. They crossed the scorching desert at nearly a dead run. The soldiers felt death closing in. The merciless sun hammered down on them. The sand beneath their boots shimmered with heat. Armed with heavy plate and weapons, they marched without rest, boots pounding sand.\n\nHell. Pure hell. The field work under Piaro and Asmophel's education hadn't been this punishing.\n\nA soldier gasped, voice cracking. \"Pant... pant! Th-thirsty! Just... give me a break to drink water. Please.\"\n\n\"Pant pant! We're going to die out here!\"\n\nAnother man stared into the distance, eyes unfocused. \"Hah... I see my dog. The one that died last year... she's in the haze over there. Calling me over.\"\n\n\"Hallucinating a dog instead of a woman.\" Someone wheezed a bitter laugh. \"Never experienced love, have you?\"\n\nThey'd reached their limit. Sweat soaked every inch of cloth beneath their armor. Several soldiers swayed, on the verge of collapse. Some fantasized about killing someone. Others longed for home. Most just wept silently.\n\nThe eight young knights, handpicked and trained by Piaro and Asmophel, rode alongside the column. They tried to mask their own exhaustion, but even they were suffering.\n\n*An army that can't maintain formation has lost its purpose.*\n\n*They still have stamina, but morale has cratered.*\n\n*Unbelievable. At this rate, we'll have deserters. The army will collapse before we even engage the enemy.*\n\n*And these are Reidan's elites.*\n\nFinally, the knights couldn't hold back any longer. One rode up to Jude.\n\n\"Commander Jude.\" The young knight chose his words carefully. \"Can I ask why we're maintaining such a brutal pace?\"\n\nAnother knight nodded. \"There's plenty of time before we're due to reach Earl Lauel's rendezvous point. We don't need to hurry. The soldiers' morale has dropped, their stamina is...\"\n\nJude had served as Grid's knight for five years. Rumor said Grid himself had specifically chosen him. Reidan had been a wasteland turned to desert when Grid arrived. He was the great hero who saved their abandoned home. Naturally, the young knights envied Jude, who'd stood beside Grid for five years. They didn't dare doubt his abilities. They believed in him. Followed him.\n\nBut now, doubt crept in. Jude's command style was too blunt. Illogical. Inefficient. *Maybe Jude is weak when it comes to tactics?*\n\nJude answered without breaking stride. He kept moving forward.\n\n\"Meeting point. Quickly. Quickly. My Lord. He said. Quickly.\"\n\n\"...What?\"\n\nThe young knights froze. *A battlefield where they'll risk their lives... and he calls it a meeting place?* A chill ran through them.\n\n*For him, the battlefield is just...*\n\n*...a place where he meets friends?*\n\n*Incredible. This is the mindset of a veteran who's stood beside the great hero for years.*\n\n\"Wait, what?\"\n\nThe young knights suddenly pulled up short. The temperature spiked. The desert ahead erupted into flame. A wall of fire blocked the path.\n\n\"The desert is burning!\"\n\n\"Stop! Everyone stop!\"\n\nPanic spread. They had no idea what was happening. The desert itself was aflame, a barrier between them and Patrian. No rational commander would order soldiers into that inferno. The young knights frantically signaled the halt.\n\nBut Jude didn't stop. He charged straight into the raging fire without hesitation.\n\n\"What are you doing?!\"\n\n\"Please, stop!\"\n\nThe young knights screamed. Too late. While they'd been managing the troops, Jude had already plunged into the flames.\n\n\"He's insane!\"\n\nThe young knights went pale.\n\n*Swaaaah!*\n\nThe flames that swallowed Jude faded like smoke. Where the fire had raged, a pristine oasis now shimmered. Crystal-clear water. The 3,000 soldiers of Reidan stood frozen, jaws slack.\n\n\"The fire was an illusion! Earl Ashur set a trap!\"\n\n\"Commander Jude saw through it!\"\n\n\"Incredible! Absolutely incredible!\"\n\nJude was already waist-deep in the oasis. He'd plunged through a sea of fire only to find cool relief. He smiled.\n\n\"Water. Good. Clear. Jude. Thirsty. Drink.\"\n\n\"Waaahhhhhhhh!\"\n\nReidan's troops erupted. Morale skyrocketed. Exhaustion evaporated. The young knights stared at Jude in awe.\n\n*He knew about the oasis in advance? He's beyond thorough.*\n\n*Earl Ashur was aware of Reidan's rebellion. He designed this to delay us.*\n\n*Commander Jude operates on a completely different level. He truly is Duke Grid's knight.*\n\nIn that moment, the young knights and 3,000 troops placed absolute trust in Jude.\n\n> **[You have acquired the title: Trusted Commander]**\n>\n> **The physical strength and defense of troops under your command will increase. Stamina consumption rate will decrease.**\n\n***\n\n\"This is remarkable.\"\n\n\"Truly, this is the work of Asmophel.\"\n\n\"No wonder they called him one of the pillars of the empire.\"\n\nAt the rear of the 3,000-man column, the Overgeared members escorted the supply convoy. Their pace was naturally slower. Moving wagons couldn't match the marching speed of the main force. The Overgeared members had harbored doubts.\n\nAsmophel was completely ignoring food transportation, one of the most critical logistics. They'd suspected him of incompetence. However, those doubts evaporated quickly. The vibration and dust kicked up by 3,000 marching soldiers was massive. The disturbance transmitted underground, suppressing the giant worms' emergence patterns.\n\n*He's preventing the giant worms from surfacing? It's a strategy that fully exploits their behavioral characteristics.*\n\n*Because of this, the rear guard and supply train are perfectly safe.*\n\n*He led exhausted soldiers straight to an oasis and secured an immediate rest point.*\n\n*He mapped the oasis location in advance?*\n\nLauel's genius was undeniable. He'd accurately assessed Asmophel's talents and boldly entrusted him with 3,000 soldiers. The Overgeared members felt confident about the future.\n\n***\n\nIn the fortified city of Patrian, Earl Ashur sensed the shift.\n\nAdventurers had begun vanishing from the streets. An oppressive silence dominated the city. Worse, one of the traps he'd placed on the road between Reidan and Patrian had been destroyed.\n\n*Is Grid finally moving?*\n\nOf course Grid would invade Patrian. Grid had killed Prince Ren, who'd raised a blade against him. That was tantamount to declaring war on the Eternal Kingdom itself. Earl Ashur had prepared accordingly. He'd fortified Patrian thoroughly. It was the only route Grid could use to advance north. The illusory sea of fire was just one defensive measure.\n\n*It was broken so easily... but I can still stop him.*\n\nEarl Ashur understood Grid's strength firsthand. He'd witnessed it directly. But circumstances had changed. Back then, he'd been careless facing Grid. Confused by the beggar-like swordsman accompanying him. Now he'd analyzed Grid's capabilities. He was fully prepared. Confident he could defeat him.\n\nAfter all, magicians demonstrated overwhelming firepower in warfare. The terrain favored his position. There was no scenario where Patrian would fall.\n\n*There is one variable.*\n\nHis son Bland, currently held hostage. His wife's only remaining flesh and blood.\n\n*Can I turn away from him?*\n\nHis family had served Eternal's royal house for generations. From a pragmatic standpoint, the kingdom took precedence over family.\n\n*Father, Grandfather, Great-grandfather... they all would have chosen the kingdom.*\n\nYes, he knew. Children could be replaced. The kingdom could not.\n\n*I know.*\n\nHis heart felt torn. He hated the role of guardian he'd inherited at birth. Nothing was sadder than abandoning the person he loved most in this world.\n\n*Bland... if this foolish father drives you to your death, I'll follow. But only after I've razed Reidan to ash.*\n\nEarl Ashur stared out the window, eyes hollow. Footsteps approached from behind.\n\n\"I understand your grief.\"\n\nA man cloaked in a robe. He'd been staying in Patrian for months now. His identity remained unknown to Earl Ashur. The man was sent by King Aslan. Earl Ashur wasn't in the mood and glared at the robed figure.\n\n\"Are you finally going to prove your worth?\"\n\nKing Aslan had called this robed man the \"trump card\" that would defend Patrian against Duke Grid's assault. Earl Ashur knew the man possessed considerable skill. But that didn't improve his mood. He didn't want someone of unknown identity lurking nearby. The robed man bowed respectfully despite Earl Ashur's hostility.\n\n\"I will rescue your son. Trust me.\"\n\n\"What?\"\n\nThe robed man's absurd declaration hung in the air. As he bent forward, the robe shifted. A blade became visible. Strangely forked into a Y-shape. It was the sword that had killed Prince Ren on a cold desert night the previous year.\n\nThe Solo Number Knight had emerged. The man who'd defeated Great Swordsman Chucksley."
}