{
  "id": 503,
  "title": "Chapter 503",
  "content": "> [You have entered the Vampire's Underground City (8).]\n> [The entrance of the dungeon is blocked. Contact with the outside world will be blocked.]\n> [You can't escape the dungeon until you have died or kill the dungeon boss.]\n\n*Right here.*\n\n*This is where Grid leveled so fast.*\n\n*The 8th city. Does that mean Reidan has seven more like this?*\n\n*A territory with eight instant dungeons. The value is astronomical. This is why Overgeared dominates the rankings.*\n\nThe world's best gaming streamer Bunny Bunny and the OGC Station shooting crew entered the dungeon to film Grid's hunting broadcast. Darkness swallowed them whole.\n\n\"Huh? Isn't it too dark?\"\n\n\"I can't see anything.\"\n\n\"Turn on the lights!\"\n\nThe crew fumbled for their equipment. Portable lamps flared to life, cutting through the black. The light revealed not ancient stone architecture, but fifty pairs of glowing eyes. Wolves. Bats. Fangs and claws.\n\n\"Heok?\"\n\n\"Large-toothed wolves! Red-eyed bats!\"\n\nLevel 270 monsters at minimum. Dozens of them, stalking closer in the flickering light. The shooting staff stumbled backward, but Bunny Bunny's professional instincts kicked in.\n\n\"Viewers, look at this!\" His voice pitched higher. \"A massive swarm of high-level creatures! We're going to be wiped out! Will we die before revealing Grid's leveling secrets?\"\n\nThe chat exploded. Tension crackled through the broadcast.\n\n\"Pagma's Swordsmanship.\"\n\nGrid moved. The diamond capsule had transformed his coordination, smoothing out the rough edges of his technique. His cloak billowed as he accelerated, energy gathering around his blade.\n\n\"Transcend.\"\n\n**Kwaaaaang!**\n\nThe shockwave lifted stones from the ground. They hung suspended in the air, gravity forgotten. Grid's eyes sharpened beneath his black hair. His sword blurred.\n\n*Pepeng!*\n\n*Pepepepeok!*\n\nEnergy blades erupted from each swing. Bats fell from the air in pieces. Wolves collapsed mid-leap, bisected cleanly. Fifty monsters. Five seconds.\n\n\"Wow.\"\n\n\"That's... incredible.\"\n\nThe crew stared, mouths slack. They knew Grid ranked among Satisfy's elite, but witnessing it firsthand was different. The sheer efficiency. The casual brutality. Grid turned to face them, expression flat.\n\n\"Next time you act recklessly and endanger yourselves, I won't intervene.\"\n\n\"Ah! Yes! I'm sorry!\" The crew bowed hastily.\n\nBunny Bunny, however, leaned closer with a streamer's shamelessness. \"Those monsters were vampire familiars, right? So you level by farming familiars until the boss appears?\"\n\nGrid's brow furrowed. \"Familiars?\"\n\n\"Huh? Yes. Of course.\"\n\n\"I hunt vampires.\"\n\n\"...What?\"\n\nVampires belonged to a senior species. At equivalent levels, they outclassed standard monsters by orders of magnitude. Physical power, magic, intelligence—the complete package. Most players avoided them. Too dangerous. Too unpredictable.\n\nYet Grid said it so simply. *I hunt vampires.*\n\nBunny Bunny turned to his camera, face cycling through confusion and excitement.\n\n\"Did you hear that? Grid hunts vampires directly! Maybe today we'll witness the incredible scene where a player takes on three, maybe four vampires simultaneously!\" His voice cut off. \"**Heok!**\"\n\nThe color drained from his face.\n\nBuildings rose throughout the underground city. Grid stood before them now, facing not dozens but **hundreds** of coffins. Bunny Bunny had never seen this many vampire lairs in one location.\n\nOGC announcer Park Shinye spoke carefully through the broadcast. \"Perhaps Grid will level by methodically breaking each coffin one at a time—**Kyaack!**\"\n\nHer shriek echoed across the channel.\n\n\"Linked Kill Wave.\"\n\nThe madman used a wide-area skill. Every coffin in range shattered simultaneously. Hundreds of vampires jerked awake, eyes blazing crimson in the darkness.\n\n**—Wow, boss-tier crazy ㅋㅋ**\n\n**—The shooting team is dead!**\n\n**—Beautiful ㅋㅋㅋㅋㅋ**\n\nViewers across the nation forgot about their chicken. Every action Grid took was mesmerizing. The immersion was absolute. Yet a creeping despair settled over the chat. \n\nGrid's leveling secret? Even if they learned it, replicating it was impossible.\n\n---\n\nNear Patrian.\n\n*Rabble.*\n\nMarquis Valtin watched Reidan's army with barely concealed disdain. The soldiers looked pathetic. Sweat drenched their uniforms. They panted like dogs on a summer afternoon, gasping for air after crossing the desert.\n\n*No proper training.*\n\nExhausted from a simple march? Their stamina was abysmal. Truly pitiful.\n\n*Of course. They probably can't afford regular drills.*\n\nReidan's circumstances were common knowledge. Desertification. Poverty. Starvation. How could such a territory maintain a properly conditioned military? The weakness was inevitable.\n\n*Still, assembling three thousand is impressive.*\n\nTwenty thousand residents. Three thousand soldiers. Every able-bodied young man must have answered the call.\n\n*If we lose today, Reidan is finished.*\n\nA scoff escaped his lips. Meanwhile, Lauel communicated through guild chat.\n\n**&Jishuka:** We arrived half a day early but still barely made it?\n\n**&Toban:** How did you time this so perfectly?\n\n**&Lauel:** I calculated that Jude would overwork the troops. Factored that in when I scheduled the meeting with Marquis Valtin. Lucky it worked out.\n\n**&Pon:** Wait. Jude? Why Jude?\n\n**&Lauel:** Don't tell me you haven't figured it out yet. Jude is commanding Reidan's forces. I gave Asmophel permission to operate independently.\n\n**&Vantner:** What. Jude is the commander?\n\n**&Ibellin:** Lauel. Are you insane? What kind of idiot puts Jude in command of an army? You should've given it to Jishuka or Peak Sword.\n\n**&Lauel:** What else does a march commander do besides direct movement? It's a simple task even Jude can handle. Besides, I don't want Overgeared members at the front where Marquis Valtin can see them. If he spots obviously talented individuals, he might grow suspicious.\n\nConvoy escort had been the crucial assignment during the march.\n\nMarquis Valtin's attention fixed on Jude.\n\n*Remarkable. Like an ogre.*\n\nMuscles harder than stone rippled across the man's frame. Indeed, someone hailed as the hero of the Eternal Kingdom would possess such overwhelming physique.\n\nThe Marquis nodded to himself. He believed Jude was Grid.\n\n*He's just staring forward?*\n\nGrid (Jude) gazed straight ahead, not even acknowledging Marquis Valtin's arrival with his ten-thousand-strong army. His eyes held a hollow quality. Vacant. The Marquis couldn't read what thoughts moved behind them. Almost like the man heard nothing at all.\n\n*Abnormal. Yet striking.*\n\nAdmiration flickered through Valtin's chest.\n\n\"The small fries are here.\"\n\nTwenty meters above, a figure appeared on Patrian's walls. His mere presence radiated oppression. Both Reidan and Borneo soldiers felt despair sink into their bones.\n\n**Kurururung!**\n\nThunder rolled overhead. Rain began to fall. Lightning flashed, illuminating the ghost-pale face of the speaker. Earl Ashur. Fifty years old and still beautiful, he opened his mouth.\n\n\"I anticipated Reidan's revolt, but never imagined it would coincide with Marquis Valtin's march. You are fools who know nothing of honor.\"\n\nMarquis Valtin laughed, loud and confident.\n\n\"Your tough talk hasn't changed, Ashur! But your provocations won't work today!\"\n\nHis confidence was genuine. Normally, Earl Ashur terrified him. But Grid stood at his side now.\n\n*Grid and Reidan's forces will occupy him. My troops can march straight into Patrian unopposed.*\n\nAs reinforcements, he didn't need to sacrifice his own men.\n\n*Ssik!*\n\nLauel stepped forward, cutting through Valtin's internal gloating. He spoke politely toward the walls. \"I am Lauel, serving under Duke Grid. It is an honor to meet one of the continent's ten great magicians.\"\n\nThe fishing rod. The bait. Lauel cast his line.\n\n\"As you know, we have secured Bland.\"\n\nLauel gestured. From among the eight young knights, Bland stepped forward.\n\n\"Father...\"\n\n\"Bland!\"\n\nEarl Ashur's eyes widened. Shock rippled across his features. Lauel seized the opening.\n\n\"The one who murdered First Prince Ren was not Duke Grid, but King Aslan. He killed his own brother and framed Duke Grid for the crime. Bland will testify to the truth.\"\n\n\"What...?\"\n\nConfusion clouded Earl Ashur's face. Lauel pressed his advantage.\n\n\"You have no obligation to serve a royal family that lost its legitimacy. Join Duke Grid. He will dispose of the false king who deceived you and grant you greater honor and power than before...\" A groan cut off his words. \"**Urgh.**\"\n\nPain exploded through Lauel's chest. He stumbled. A dagger protruded from between his ribs, having flown silently through the air to pierce him.\n\n\"What?\"\n\n\"Protect Earl Lauel!\"\n\nThe eight knights rushed forward, surrounding Lauel and Bland. Something dropped from the high walls. A figure in a robe. The 9th Knight of the Saharan Empire's Red Knights. A Solo Number Knight capable of destroying a city single-handedly. He drew a strange Y-shaped blade. The weapon moved with lightning speed.\n\n**Chaeeeeeng!**\n\n\"Ugh.\"\n\n\"Keok.\"\n\nEight young knights, trained personally by Piaro and Asmophel, fell in an instant. They couldn't track the robed man's sword. Serious injuries carved through armor and flesh. They barely survived.\n\n\"E-Earl Lauel!\"\n\nTheir screams tore through the rain.\n\nLauel lay paralyzed, the dagger's poison spreading through his veins. The robed man closed the distance in a heartbeat. His blade rose for the killing stroke.\n\n\"Fast!\"\n\nThe Overgeared members charging from the army's rear felt shock freeze their blood. The swordsmanship was transcendent. Even Faker, Pon, and Regas tensed, recognizing a superior technique.\n\nLauel faced his executioner.\n\n*I'm dead.*\n\nThe realization struck him cold. He'd never anticipated such a monster hiding in Patrian.\n\n*Why am I always weak when variables appear?*\n\nHe cursed his inadequacy. Closed his eyes.\n\n**Chaaeng!**\n\nA pebble shot from Reidan's ranks. It intercepted the Y-shaped blade mid-swing, deflecting the killing blow.\n\n\"?!\"\n\nThe Solo Number Knight froze. A man hiding among the common soldiers. Ice crawled down the knight's spine."
}