{
  "id": 504,
  "title": "Chapter 504",
  "content": "Nineteen seconds.\n\nThat was all it took for the solo number knight to vault the wall, carve through eight guards, and reach Lauel's throat.\n\nThe Y-shaped blade flashed toward exposed flesh. Fast—too fast for a counter.\n\nA pebble whistled through the air.\n\nMetal rang against stone. The sword stopped dead, inches from Lauel's neck.\n\nNautilus, 9th of the Red Knights, stared at the deflected blade. *Impossible.* His arm still vibrated from the impact. A solo number knight—one of the nine strongest warriors on the continent, men who'd surpassed even Piaro himself by achieving the rank of Great Swordsman. And someone had just stopped his strike with a rock.\n\n*Who?*\n\nHis mind raced through possibilities. *A person who can throw a stone like that... in this backwater kingdom?*\n\n*Duke Grid?* No. Nautilus had studied the man during the war with Prince Ren, dissected his every movement. Strong, yes, but levels below a Red Knight. Grid would never reach this threshold, not in ten lifetimes of training.\n\n*Piaro?* The traitor's last known location was the Eternal Kingdom. But even in his prime, Piaro couldn't have done this. And now, rusted and broken? Impossible.\n\n*Then who—*\n\nA voice cut through his confusion.\n\n\"Lauel. Protect.\"\n\nJude materialized from the press of bodies. The +8 Dainsleif fell like black lightning.\n\nNautilus raised his blade. Steel screamed against steel.\n\nThe impact rattled his bones. *What is this strength?*\n\nNot mere muscle. This man wielded force like a weapon itself, multiplying his power through pure technique.\n\nThe second blow came. The third. Nautilus read the pattern now—reckless, animalistic. No defense. No self-preservation.\n\n*He doesn't fear death.* The realization chilled him. *Like he has ten lives to burn.*\n\nEach swing came with the commitment of a man already dead, willing to trade wounds for kills. Worse than fighting a skilled warrior. This was fighting a rabid beast.\n\n*Durima?* The clan that raised human weapons, puppets carved into killers.\n\nBut even Durima had limits.\n\nNautilus found his center again. He dropped low beneath a diagonal slash, then drove upward.\n\nWhite aura erupted from his blade. The tip punched through Jude's chest, blood spraying hot across Nautilus' face. He sprang into the air, sword already rotating for the follow-up strike into Jude's shoulder.\n\n\"Ouch.\" Jude blinked. \"It hurts.\"\n\n\"Jude!\" Voices from the rear ranks, desperate. The Overgeared members struggled through the packed formation. Faker ghosted over helmets and shoulders, the fastest, but still too far.\n\nNautilus aimed for the skull. \"This is the end.\"\n\nStone met steel again.\n\n*Impossible!*\n\nHis blood turned to ice water. Nautilus twisted toward the wall, where Earl Ashur watched from above.\n\n\"Command the army to attack!\" His voice cracked with urgency. \"I will rescue Bland in that gap!\"\n\n*Don't listen to Lauel. End this war now.* Fear clawed at him—not of injury or defeat, but of the phantom that could throw stones like crossbow bolts.\n\nOn the wall, Earl Ashur processed the demand. A clever man, he thought before acting.\n\n*What does Grid gain from Prince Ren's death?*\n\nNothing. But King Aslan gained a throne.\n\nLauel's accusation echoed in his mind. *Was Grid truly framed?*\n\n*And Bland...*\n\nA hostage subjected to Reidan's dungeons. How much pain could break a man's truth? How many threats would twist testimony into lies?\n\n*I need Bland safe first. Secure him, then find the truth.*\n\nHis decision crystallized.\n\n\"Shoot!\"\n\nTwo thousand bows sang in unison. The archers of Patrian—the Heart of Eternal—proved their reputation. Arrows arced high, blotting out the sun in a perfect curve.\n\nThen Earl Ashur's magic touched them.\n\nEvery shaft ignited. Every trajectory accelerated. Fire-wreathed death streaked downward like a meteor storm.\n\nThe Reidan lines buckled with panic.\n\n\"Hiik—Block!\"\n\n\"Shields up!\"\n\n\"You want to see your families again? Move!\"\n\nSurvival instinct sharpened them. Months of brutal training paid off. Rows snapped into formation. Shields locked overhead. Most arrows shattered against iron.\n\nMost.\n\n\"Ack!\"\n\n\"Ugh!\"\n\nProjectiles found gaps. Men fell, some dead before they hit the ground, others crippled forever.\n\n\"Leo! Franc!\"\n\nGrief turned to terror. Shields rattled as the next volley approached.\n\nMetal shrieked. Bodies thudded. Screams tore the air.\n\nAsmophel held a shield with soldiers pressed around him on all sides. Arrows hammered the formation like hail.\n\n*This is what they see.* The thought struck him like a blow. *This is what I commanded men into.*\n\nBorn noble. Given officer rank immediately upon enlistment. He'd led with care, minimized casualties, prided himself on strategy that preserved lives. But he'd never stood where they stood. Never felt the gut-deep terror of being the weakest piece on the board, where a single arrow meant death.\n\n*For them, the war doesn't matter. The glory, the pay, the cause—none of it matters.*\n\nOnly survival. Only the next breath.\n\nA shield slammed into his face. His nose crunched, blood flooding his mouth. Beyond the overlapping iron, a boulder tumbled through the air—catapult fire.\n\n\"Uwaaaack!\"\n\n\"R-Run!\"\n\nThe formation dissolved. Men shoved and trampled each other in blind panic, Asmophel included.\n\nA thought crystallized through the chaos. *I've experienced nothing. Nothing of what they endure.*\n\n*Grid... he called me a soldier to teach me this.*\n\nThe truth of it settled into his bones. Grid hadn't invited him for this purpose—but intention didn't matter. The lesson landed anyway.\n\n*I'll become a commander who knows their hearts. I'll never spend lives cheaply. I'll find strategies that win wars without filling mass graves.*\n\nFirst, though.\n\n*I have to be a soldier.*\n\nHe seized a spear. Aimed. Threw.\n\nThe boulder shattered mid-flight, raining harmless rubble.\n\n[Asmophel has acquired a new skill.]\n\n[Asmophel has acquired a new skill.]\n\n[Asmophel has acquired a new title.]\n\n***\n\n\"Why won't they die?\"\n\n\"I'm hitting them—why won't they fall?\"\n\nMorale bled from the Patrian archers. Arrow after arrow struck home, but the Reidan lines barely thinned.\n\n\"They're wearing knight-grade armor. All of them.\" Disbelief colored the observation. \"Is Reidan that wealthy?\"\n\n\"A desert city? Impossible. Their lord must care for them. Duke Grid actually equips his soldiers properly.\"\n\n\"What a master... I envy those men...\"\n\nEarl Ashur felt the shift like a physical weight. *I must reverse this.*\n\nBelow, Borneo's army pressed the gate while Reidan's shields held the line.\n\nBOOM.\n\nBOOM.\n\nThe walls shuddered. Soldiers flinched with each impact of the siege weapons.\n\nEarl Ashur stepped forward. Magic would turn the tide. Magic always did.\n\n\"Behold the majesty of the ten Great Magicians!\"\n\nThunder rumbled without clouds. The air shimmered with gathering heat—Fire Storm, a spell that burned armies to ash.\n\nLauel shook off his paralysis. \"What are you doing? Stop your father!\"\n\nBland stared at him. \"I can move freely?\"\n\n\"Have I ever blocked your freedom?\"\n\nSilence hung between them for a heartbeat.\n\nThen Bland shot skyward on wings of magic, shouting as he closed the distance. \"Father! Listen to Earl Lauel!\"\n\nEarl Ashur's concentration fractured. His son, the hostage, flying untethered across the battlefield.\n\n*Perhaps...! Could it be?!*\n\nThe spell collapsed. Magic dissipated harmlessly.\n\nLauel called up from below. \"King Aslan murdered Prince Ren and framed Duke Grid. If this is true, will you abandon the Eternal Kingdom and serve Duke Grid?\"\n\n\"I can feel betrayed by Eternal. But I won't serve an incompetent man.\"\n\nLauel's smile could cut glass. \"So you'll serve Grid if he proves capable? Excellent. Let me demonstrate his capabilities immediately.\"\n\nEarl Ashur frowned at the prediction in those words.\n\n\"The fortified city of Borneo,\" Lauel declared, \"unconquered for hundreds of years by Eternal, will now fall.\"\n\nThe Overgeared members hidden in the rear struck.\n\nMagic and skills detonated through Borneo's ranks. Ten thousand soldiers reeled in sudden chaos.\n\n\"W-What is this?!\"\n\nMarquis Valtin stumbled. Earl Ashur's eyes widened.\n\nLauel spoke into their shock. \"Both the Eternal Kingdom and Gauss Kingdom will belong to Duke Grid.\"\n\nEarl Ashur's hands trembled.\n\n\"Earl Ashur!\" Nautilus' voice cracked across the battlefield. He'd broken free from Regas, Pon, and Faker, bloodied but mobile. \"Don't be deceived! He's lying!\"\n\nHe launched himself at Lauel, a black streak of violence. Soldiers died in his wake, bodies spinning like chaff.\n\nThe blade descended.\n\nA spear intercepted it.\n\nNautilus stared at the common soldier who'd blocked a Red Knight's strike. \"Who are you?\"\n\nThe soldier leveled his spear.\n\n\"Private Ars.\""
}