{
  "id": 505,
  "title": "Chapter 505",
  "content": "\"Private?\"\n\nNautilus froze. He shook his head and tried again, enunciating each word.\n\n\"You're a soldier in the army?\"\n\nThe man in the helmet had called himself Ars. Through the visor's narrow slit, only his eyes were visible. He shook his head.\n\n\"No.\"\n\n*That's right. I must have misheard.*\n\n\"I'm a *private*. Not just a soldier.\"\n\nNautilus's jaw clenched. \"You bastard. Are you mocking me?\"\n\nThe distinction meant nothing. What mattered was the claim itself. A common soldier strong enough to deflect the blade of the 9th ranked Red Knight? In forty-one years, Nautilus had never witnessed such a thing.\n\n\"You're lying.\" He leveled his sword. \"You're the one who blocked my attacks twice before. Show your real face.\"\n\nNautilus punctuated the demand by hurling a dagger. The same poisoned blade that had paralyzed Lauel earlier. Private Ars traced a circle with his spear, deflecting it effortlessly.\n\nAsmophel clicked his tongue behind the helmet. \"You want to lecture me about honor? How shameless.\"\n\nHis trained eye identified the truth immediately. This robed man was a knight. One who had studied the Saharan Empire's swordsmanship. In the old days, a Red Knight would never stoop to concealed throwing weapons. Such tactics were beneath them.\n\n*The Red Knights have become corrupt.*\n\nThe thought tasted bitter.\n\n*No. They're not the same organization anymore.*\n\nAll the true knights, the ones who embodied chivalry, had been eliminated. Framed by Empress Marie. Dead or scattered. What remained wore the same red but possessed none of the spirit.\n\n*Marie.*\n\nThat cursed woman who had murdered their families and destroyed their brotherhood.\n\n*When Grid conquers the Saharan Empire, I'll take everything back. I'll... wait.*\n\nHe caught himself mid-thought.\n\n*I'm Private Ars right now.*\n\nA private didn't concern himself with empresses. Most ordinary soldiers in the world didn't even know the empress's face or name. Asmophel exhaled slowly, steadying himself in the role as Nautilus charged.\n\n\"You dare lose focus in front of me!\"\n\n*Syuk! Syuk!*\n\nThe Y-shaped blade came from two angles at once. Each prong targeted lethal points: heart, throat, eyes. Sand kicked up by the assault split cleanly with every pass.\n\n*Impressive skill.*\n\nFrom the sidelines, Regas, Pon, and Faker observed with mounting awe. The robed NPC had to be level 400 minimum. Fourth advancement class. That kind of power dwarfed their own capabilities. But what shocked them wasn't the robed man.\n\nIt was the soldier.\n\n*Why is a private this strong?*\n\nThe soldier was actually handling the robed man better. The three stood frozen until Lauel's voice snapped them out of it.\n\n\"How long are you planning to stand there? Go help the guild members destroy Borneo's army!\"\n\n\"Y-Yes!\"\n\nThe most threatening presence on the battlefield was being contained by a common foot soldier. They could focus on their roles without worry.\n\n\"Wait, who *is* that private?\" Regas muttered.\n\n\"Ars,\" Pon said.\n\n\"Okay, but who the hell is Ars?\"\n\nFaker shrugged. \"No idea.\"\n\n\"Where does Grid keep finding these named NPCs?\"\n\n\"Doesn't matter. Grid's incredible.\"\n\nThe three separated, each harboring the same misconception. Meanwhile, the clash between Nautilus and Asmophel intensified.\n\n*Chaeng!*\n\nNautilus's sword moved at blistering speed. Asmophel anchored his defense with the spear's superior reach. The exchange looked even, which was precisely why Nautilus felt insulted.\n\n\"What are you?\" Spittle flew from his lips. \"Who the hell are you really? Why is someone of your caliber hiding in this backwater kingdom?\"\n\n\"Private Ars of Reidan.\"\n\n\"Stop repeating the same bullshit! You're too strong to be a soldier! Tell me your real identity!\"\n\n\"I already did. Any soldier in Reidan can reach this level if they learn Reidan's Spearsmanship properly.\"\n\nReidan's Spearsmanship. The combat style Asmophel had developed alongside Piaro after extensive collaboration. It synthesized the merits of the 'Imperial Spearsmanship Style,' a technique reserved for the handful of knights recognized by the Saharan Empire's court. Every soldier in Reidan trained in it.\n\nOf course, the difficulty was brutal. Not a single trooper had mastered it yet. Except Asmophel, who understood it completely.\n\n\"Reidan's Spearsmanship, Second Form.\"\n\nHe shifted his stance. \"Dragon's Tail.\"\n\n*Paeng!*\n\nThe spear carved a sharp arc. A sonic wave hammered Nautilus's inner ear.\n\n\"What—?\"\n\nHis balance shattered. Nautilus barely raised his guard in time, deflecting the thrust aimed at his chest. Then his eyes widened. The spear in contact with his sword *bent*. The shaft curved around the blade, and the tip lunged for his throat.\n\n*This is bad!*\n\n*Puok!*\n\n\"Kgh!\"\n\nBlood spurted from the shallow puncture. Nautilus twisted immediately, launching a counter based on predicted movement. Asmophel sidestepped it casually.\n\n\"You're dancing in the palm of my hand.\"\n\n\"Ugh.\"\n\nAsk any passerby to name the strongest knights on the continent, and they would say the Red Knights. Among those Red Knights, Nautilus ranked ninth. In his own estimation, only around thirty people on the continent could defeat him. Yet here he was, being overpowered by a Reidan private.\n\nA *private*.\n\n\"How? Why is someone like you...?\"\n\nThis was serious. He couldn't bear the stigma: 'Solo Number Knight defeated by a common soldier.' It was absurd. Nautilus decided to flee. He activated Aura Rage, erupting his aura in all directions to create a sandstorm that would obscure Asmophel's vision.\n\n*I'll use this gap to escape.*\n\nHe believed the storm would blind his opponent. He turned and bolted.\n\n\"How strange.\"\n\nThe voice came from directly above his head.\n\n\"A Red Knight shouldn't show his back. The old Red Knights had an instinct. When they met a stronger opponent, they would push beyond their limits, not flee. Yet here you are, running.\"\n\n*How did he escape from my Aura Rage bombardment?*\n\nA chill raced down Nautilus's spine as Asmophel's spear descended in a flurry.\n\n*Papang! Papapapang!*\n\nOnce. Twice. Three, four, ten times. The strikes didn't stop.\n\n*Continue, continue, continue!*\n\n*Puuook!*\n\n\"Kuaak! Shit! *Shit!*\"\n\nNautilus tried to weather the ruthless assault, but Asmophel was too fast. No matter how he twisted or blocked, the spear found him.\n\n\"Reidan's Spearsmanship, Third Form.\"\n\n*Kururu!*\n\nThe spear piercing Nautilus's body became wrapped in a golden radiance. The prelude to the peak technique of Reidan's Spearsmanship: Splitting the Seven Seas.\n\n\"Golden aura? This is *ridiculous!*\"\n\nNautilus's face drained of color. He had feared exposing his identity, so he'd refused to wear the Red Armor, the signature protection of the Red Knights. Now that precaution felt like the worst mistake of his life.\n\n*Puok!*\n\nThe golden spear split Nautilus's chest in half.\n\n\"Kuaaaack!\"\n\nCatastrophic damage. He collapsed, his body trembling. A thought surfaced too late.\n\n*Of course. The best spearman on the continent.*\n\nKirinus. That monster must have been hiding among Reidan's soldiers all along.\n\n*If I'd worn the Red Armor, I might have had a chance. What a waste.*\n\nHis body dissolved into grey particles. He never learned the truth. Asmophel wasn't Kirinus. And his swordsmanship far exceeded his skill with a spear.\n\n---\n\n\"Whoa...\"\n\n\"That was amazing.\"\n\nThe soldiers of Reidan had just witnessed how an ordinary private(?) annihilated an enemy commander. Hope surged in their chests. If they kept working hard on Reidan's Spearsmanship, could they one day become as strong as Private Ars? The morale boost was immediate. Lauel capitalized on the moment with a timely order.\n\n\"Full assault! Charge Borneo's lines! And I'm promoting Private Ars to Private First Class effective immediately!\"\n\n\"*Raaaaaah!*\"\n\nThe reward seemed modest given that Ars had just defeated an unstoppable foe. But such was the unfortunate reality for common soldiers. A Private First Class who could perform the role of fifty men was cause for celebration.\n\n*If I earn achievements like Ars, I can advance too!*\n\nThe soldiers of Reidan burned with desire and surged forward against Borneo. After a while, as the battle moved away from the rear lines, Lauel whispered to Ars.\n\n\"I never dreamed you were Asmophel.\"\n\n\"I'm Private Ars.\"\n\nAsmophel attempted to maintain the facade, but he couldn't deceive Lauel's eyes.\n\n\"Hehe, you don't need to hide from me. I can guess your reasoning. You became a soldier to inspire the troops, to lead by example so they'll train harder, right? Always thinking about developing the army. Truly the mark of a great commander. You're as difficult to fully grasp as Grid and Piaro.\" He chuckled. \"Kukuk.\"\n\n\"...?\"\n\nLauel's interpretation left Asmophel baffled. He tried to correct the misunderstanding by repeating himself.\n\n\"I'm Private Ars.\"\n\n\"Haha! Understood. Please continue acting as a soldier. Private First Class Ars.\"\n\nAsmophel spoke again, slowly and deliberately. \"I'm *Private* Ars.\"\n\nLauel's smile faltered. \"...Do you have a fetish for being a private?\"\n\n\"I need to start from the beginning, not skip ahead to Private First Class.\"\n\nHe wanted to experience everything about being a soldier. Every rank, every hardship. Therefore, he refused the promotion. Lauel's eyes gleamed with sudden understanding.\n\n*Perfect. I can reduce our payroll expenses.*\n\nThere was a significant salary difference between a private and a private first class. Since Asmophel already drew wages as captain of the Overgeared Magic Knights Division, paying him an additional first-class stipend was wasteful.\n\n\"It's good that Ars has this... private obsession.\"\n\n---\n\nThe Saharan Empire's Solo Number Knight, killed by a soldier of Reidan. Unfortunately, this news was quietly buried. No one except King Aslan and Asmophel knew that Nautilus had been a Solo Number Knight in the first place.\n\nThe next day, at dawn, the long and intense battle finally ended. Borneo's ten thousand troops were defeated by Reidan's three thousand. The Overgeared members had been instrumental, but the crucial difference between the Borneo and Reidan soldiers came down to equipment. Borneo's troops couldn't contend with the Mass Production Grid Set that one in every ten Reidan soldiers wore. Legendary craftsmanship, mass-produced. Combined with the contributions of Private Ars, victory was inevitable.\n\nAt the same time, in the vampire city:\n\n\"Vampires are simple to handle once you know the trick. Just have the God Hands beat them with Mjolnir. See? Easy, right? You viewers can try this method too.\"\n\n\"...\"\n\nGrid was unintentionally trolling viewers around the world. It wasn't deliberate, but it was unavoidable. The audience stared at their screens in bewildered silence."
}