{
  "id": 506,
  "title": "Chapter 506",
  "content": "**The Broadcast Revelation**\n\nThe secret was out: Grid used the God Hands wielding Mjolnir to hunt vampires for experience. The chat exploded with reactions.\n\n*—What am I supposed to do if I don't have God Hands and Mjolnir?*\n\n*—Just buy a hammer with divine power.*\n\n*—Even with a divine hammer, you think vampires will die that easily?*\n\n*—It only works with the God Hands.*\n\nSome viewers took Grid's method seriously. Others laughed it off as impossible to replicate.\n\n*—Are you kidding me? I wasted time watching this broadcast hoping to learn Grid's leveling secret. I got nothing.*\n\n*—Tsk. I could've been grinding instead of watching this.*\n\nGrumbles rippled through the chat, but few viewers openly criticized Grid. He'd never promised to reveal his secrets. He didn't owe anyone an explanation. Most of the audience remained grateful he'd even appeared on air to address their questions. Grid might be mocked, but his popularity was undeniable.\n\nStill, OGC Announcer Park Shinye felt uneasy.\n\n*How to hunt like Grid.* She worried ordinary players couldn't replicate his methods. The ratings might tank. During the advertising break, she cornered him.\n\n\"Youngwoo, don't you think you should take this more seriously?\" Her tone carried an edge of reproach. \"You should be working harder to satisfy the viewers.\"\n\nGrid blinked from where he sat resting. \"Serious attitude?\"\n\nConfusion creased his features. \"Aren't I being serious?\"\n\nHis job was to show viewers how he hunted. He'd done exactly that. What was the problem?\n\nPark Shinye sighed. \"You need to make the viewers feel their time is worthwhile. For example, when you catch a vampire, explain its weaknesses in detail—\"\n\nGrid's expression darkened. \"Why should I?\"\n\nDid he need to be that accommodating? If OGC had requested that kind of performance from the start, he would've declined the appearance entirely. Park Shinye's demands went beyond the contract, and his irritation showed.\n\nShe bristled at his reaction. \"Youngwoo, you're not behaving like a professional. I heard you received twenty billion won for this broadcast. Shouldn't you at least be aware of what that money represents?\"\n\n\"The value?\" Grid's eyes narrowed. \"I think I've earned it.\"\n\nHe understood perfectly well that broadcasting stations weren't charities. OGC had already raked in far more than twenty billion won in revenue from this broadcast alone.\n\n\"Shinye, what are you doing?\" One of the OGC staff members moved toward her.\n\n\"Relax. Don't make a scene.\" Another tried to intervene.\n\nBut before anyone could defuse the situation—\n\n\"The smell of humans!\"\n\n\"Delicious. Prey has arrived after so long.\"\n\nThe vampires sensed the commotion. Drawn by the noise and argument, they swarmed toward Grid's party.\n\n\"They're back again.\"\n\n\"Pull back to the rear.\"\n\nThe broadcasting staff had grown comfortable around the vampires. Initially terrified, they now remained calm, confident Grid could handle the monsters effortlessly.\n\nHowever—\n\n\"W-What are you doing?\"\n\nGrid didn't stand. Despite the vampires closing in, he simply sat. Waiting.\n\nThe staff noticed the strangeness too late. Panic spread like wildfire.\n\nPark Shinye's voice cracked with urgency. \"Youngwoo! Get rid of the vampires! We'll all die!\"\n\nHer shouts meant nothing.\n\nGrid remained motionless until the end. The vampires fell upon the staff.\n\n\"Kyaaak!\"\n\nPark Shinye's bright clothing made her the first target. A vampire's claws pierced her chest. Fangs sank into her throat. She died instantly, blood pooling beneath her crumpled form.\n\nThen Grid stood.\n\n\"Phew. Good riddance.\"\n\nA smile of pure satisfaction spread across his face as he directed the God Hands. The golden constructs surged forward, hammers falling with brutal precision. Vampire skulls cracked like eggshells.\n\nBunny Bunny swallowed hard, watching Grid orchestrate the slaughter.\n\n*I should be careful.*\n\nHe'd known for a while, but Grid didn't have a kind personality. The man treated those around him well enough—he wasn't overtly rude—but he was never truly nice. Never innocent. It was crucial not to forget that.\n\n---\n\n**The Fortified City of Patrian**\n\n\"You lowly, wicked man!\" Marquis Valtin strained against his bonds, face purple with rage. \"Stabbing your allies in the back! You have no honor, no decency! When the world learns of today's betrayal, Duke Grid's reputation will crumble to dust!\"\n\nLauel stood before the bound marquis, expression unreadable.\n\nAttacking allies mid-war defied common sense. Such incidents were vanishingly rare across the entire continent. Marquis Valtin believed Lauel to be the worst kind of person.\n\nLauel acknowledged this assessment. \"Indeed. If this becomes public, I'll be branded the worst trash. Grid's credibility will collapse. No one will trust Reidan again. We'll be isolated—economically, militarily, diplomatically.\"\n\n\"Then you understand!\" Valtin's eyes blazed with vindication. \"Only ruin awaits you! You were blinded by immediate gain and made an irreversible mistake! You have no future!\"\n\nSilence stretched between them.\n\nLauel couldn't refute the words. The Overgeared members shifted uncomfortably.\n\n\"Isn't this situation serious?\"\n\n\"Very serious. Other powers won't let this slide. Trust is the foundation of alliances. The repercussions will be massive.\"\n\n\"What do we do now?\"\n\n\"Like Valtin says, the future won't be smooth.\"\n\n\"Then we should cover this up. Stop the world from learning we betrayed Borneo.\"\n\n\"How do you conceal an incident witnessed by tens of thousands?\"\n\n\"Then... are we ruined?\"\n\nA satisfied smile crept across Marquis Valtin's face as he watched the Overgeared members squirm.\n\n\"Release me and my army immediately. Consider it an opportunity to salvage your mistake.\"\n\nCommon law prohibited executing captured enemy nobles. They were ransomed for coin. Liberation was typically delayed as long as possible, but Marquis Valtin felt certain of his position.\n\n*They have to release me now.*\n\nThey'd want to escape this disaster. But it was too late. *You will never be forgiven!* Once he returned to Gauss, he'd petition the king directly. Urge an alliance with Eternal.\n\n*I'll forge an alliance with Eternal and punish every last one of you.*\n\nLauel offered an awkward smile. \"I'm sorry, but I can't release you. Now that I've done this, regaining lost trust is impossible. I can't risk freeing you when you'll become an even greater enemy in the future.\"\n\n\"What are you saying?\" Valtin's voice rose. \"Don't you know the common law forbids killing captive nobles?\"\n\n\"I'm aware.\" Lauel's smile didn't reach his eyes. \"So I'll manipulate the truth. Let's see... Marquis Valtin was struck by an arrow on the battlefield and died.\"\n\n\"Don't make me laugh! Three thousand Borneo soldiers survived as my witnesses! My soldiers will testify that you executed me!\"\n\nBorneo had surrendered late in the afternoon, leaving three thousand troops alive. Behind the bound marquis, they knelt in rows, disarmed and defeated. Lauel tilted his head as if confused by Valtin's confident words.\n\n\"Three thousand soldiers? All ten thousand Borneo troops were wiped out in the war.\"\n\n\"What...?\"\n\nMarquis Valtin's heart plummeted. The Overgeared members recoiled in shock.\n\n\"L-Lauel, you mean to kill them all?\"\n\nLauel nodded as if discussing something trivial. \"Yes.\"\n\n\"What?\"\n\nNPCs or not, they were still alive. Three thousand lives! Slaughtering three thousand soldiers who'd already surrendered—it was monstrous. Lauel met the horrified stares of some Overgeared members with indifference.\n\n\"Power cannot be gained without evil. Those who cling to justice are always the ones who suffer damage.\"\n\nThe words hung in the air like a death sentence.\n\n\"Execute all 3,153 Borneo soldiers, including Marquis Valtin. Reidan's soldiers will carry out the executions. Raise the soldiers' levels.\"\n\nSome would call him a demon. Some would refuse to look at him. But Lauel didn't care. He hadn't joined Overgeared to play games.\n\nMarquis Valtin's body shook as he stared into that emotionless face. \"You think you can cover the sky itself?! The evil you commit today will be revealed, and it will lead to Duke Grid's destruction!\"\n\nLauel laughed, imagination already painting the future.\n\n\"No. Duke Grid will be extraordinary. I will block and overcome everything in his way, no matter the trials.\"\n\nHe'd foreseen this outcome when planning the Borneo takeover to acquire Earl Ashur. Overgeared's fate was isolation. But it was inevitable for his plan. If they hadn't allied with Borneo and taken Patrian independently, they'd still be branded as 'traitors who betrayed the kingdom.'\n\n*Since isolation is unavoidable regardless, we might as well maximize the benefits.*\n\nIndependence. Overgeared's power, his own intellect, and the forces of Marquis Steim and Earl Ashur would be their foundation.\n\n*It doesn't matter if other kingdoms refuse to acknowledge us and remain hostile.*\n\nThey'd break through with pure force.\n\nLauel made this pledge as Marquis Valtin and 3,153 Borneo troops were executed. Blood soaked the courtyard. Screams faded into silence.\n\nThen the notifications arrived.\n\n> [You have caused a massacre using the pretext of war. You have become an object of hatred to countless people. However, you will also gain fanatic followers.]\n\n> [The title **'Wise Villain'** has been acquired!]\n\n> [The **Political Power** stat will be opened due to the title effect.]\n\n> [Political Power has increased by 500.]\n\n> [Attack Power and Magic Power will slightly increase due to the title effect.]\n\n> [You have gained the skill **'Madness'** as a result of the title effect.]\n\n> [You have gained the skill **'Harsh Tax Levy'** as a result of the title effect.]\n\n> [You have gained the skill **'Merciless Commands'** as a result of the title effect.]\n\n\"This... this...\" Lauel stared at the notifications. \"I've received great power at the cost of sorrowful slaughter. Look forward to the future of the dark shadow Lauel, who will bear the darkness for Overgeared...\"\n\nThe Overgeared members exchanged worried glances.\n\nLauel's illness was getting worse."
}