{
  "id": 507,
  "title": "Chapter 507",
  "content": "\"Now I see.\"\n\nEarl Ashur's eyes narrowed as Lauel methodically executed the Borneo prisoners, one after another. Blood pooled in the courtyard.\n\n*The reason the greedy fool Grid holds power.* Earl Ashur studied the young tactician. *This man.*\n\nLauel had used the Borneo alliance as a smokescreen to seize Patrian. Ruthless. Brilliant. The kind of calculated cruelty that separated amateurs from professionals.\n\n*Without this person, Grid would still be nothing.*\n\nEarl Ashur dismissed the thought as soon as it formed. Bland's voice cut through his reverie.\n\n\"Father.\" Bland's tone carried quiet respect. \"Duke Grid isn't incompetent. Earl Lauel's achievements are significant, yes. But his strategies only work because Duke Grid executes them.\"\n\nEarl Ashur turned to his son. Two years since they'd last spoken, and something had changed. The bitterness was gone. Bland acknowledged Grid now? The same man who'd stolen Irene from him?\n\n*No grudges in his eyes. What did Grid do to him?*\n\n\"Bland.\" Earl Ashur's voice dropped. \"What torture did you endure?\"\n\nBland smiled. Actually smiled, the expression lighting his entire face.\n\n\"Father, it's nothing like you're imagining. Life in Reidan has been...\" He paused, searching for words. \"Good.\"\n\nEarl Ashur stared. His son, who'd lost his mother and brother, who'd watched Irene marry another man, could smile like this?\n\n\"What life in Reidan could possibly make you look like that?\"\n\n\"Fieldwork.\"\n\nSilence.\n\n\"What?\"\n\n\"I eat potatoes every day.\"\n\n\"What?!\" Earl Ashur surged forward. His son, a noble of the Eternal Kingdom, forced into serf labor? Fed like livestock? \"Bland! You've lost your mind!\"\n\nHe pulled his son into an embrace, clutching him tight. \"I'm sorry. Your father failed you.\" His voice cracked. \"This is my fault.\"\n\nBland pressed something warm into his father's hand. A boiled potato, its skin shimmering with rainbow hues.\n\n\"Stop talking. Eat this.\" Bland's tone was firm. \"Your assumptions will die the moment it touches your tongue.\"\n\nEarl Ashur stared at the potato. *My son wants me to eat pig slop.*\n\nBland's patience snapped. He shoved the potato into his father's mouth.\n\n\"Heok!\"\n\nThe taste exploded across Earl Ashur's senses.\n\n*What is this?*\n\nSweet. Salty. Spicy. Sour. Refreshing. Every flavor collapsed into a single point of perfection, the sensation comparable to breaking through to a new mana circle. His entire worldview shifted.\n\n\"Isn't it delicious?\" Bland's eyes gleamed.\n\n\"Delicious?\" Earl Ashur grabbed his son's shoulders. \"How dare you call this mere deliciousness! This is divine! The food of gods!\"\n\nBland's grin widened. Blood truly ran thick. Another potato convert was born.\n\n***\n\n\"Will you serve Duke Grid?\"\n\nLauel stood over the aftermath, the executed prisoners behind him. Earl Ashur chewed thoughtfully on another rainbow potato.\n\n\"What's your plan?\" Earl Ashur swallowed. \"Duke Grid will face hostility from both Eternal and Gauss. A pincer attack from two kingdoms. Even with Marquis Steim's backing, the odds are grim.\"\n\nLauel raised three fingers.\n\n\"You're overlooking something. We won't just face Eternal and Gauss.\" He paused. \"The Saharan Empire is our third enemy.\"\n\n\"The Empire?\" Earl Ashur's hand stilled. The Saharan Empire ruled the continent through overwhelming force. Over one million soldiers. Nearly three thousand knights. Multiple great magicians of Earl Ashur's caliber or better. \"You're courting extinction.\"\n\n\"The Saharan Empire backs King Aslan.\"\n\nLauel's tone carried absolute certainty. He'd identified the connection shortly after Aslan's coronation. The circumstantial evidence was overwhelming.\n\nEarl Ashur's brow furrowed. *Recently, policy shifts favoring the Empire. Small changes. Negligible.* He nodded slowly. \"The relationship is changing. I dismissed it as trivial.\"\n\n\"Murky waters,\" Lauel agreed.\n\n\"So what future does Duke Grid have?\" Earl Ashur bit into the potato again. \"Why would I serve a man destined for a dog's death?\"\n\n\"No need for concern. The Empire's forces are scattered. Insurgents in the south have tied down their armies. They can't afford northern entanglements for at least two years.\" Lauel's smile turned cold. \"Besides, King Aslan won't request Imperial support.\"\n\n\"Why not?\"\n\n\"Pride.\" Lauel said the word like a weapon. \"Eternal maintains autonomy despite paying tribute. If nobles learn Aslan bought his crown with Imperial favors? His legitimacy crumbles. Prince Ren's faction emerges from the shadows.\"\n\nEarl Ashur studied the younger man. \"You read continental politics like a gameboard.\"\n\n\"This is basic strategy.\"\n\n\"Most can't afford such vision.\"\n\nEarl Ashur was silent for a long moment. He had no home in Eternal anymore. His power base was too fragmented to stand alone.\n\n\"Fine. I'll serve Duke Grid.\" He met Lauel's eyes. \"But I expect appropriate compensation.\"\n\n\"Fair. You're one of the Ten Great Magicians.\" Lauel's friendly smile didn't reach his eyes. His next words came soft as silk over steel. \"Remember. Your only mission is serving Duke Grid. A blade to his throat is unacceptable.\"\n\n\"I understand.\"\n\n*How much has Grid grown to inspire this loyalty?*\n\nEarl Ashur's grudge had evaporated the moment he saw Bland's health and happiness. Now curiosity replaced it.\n\n\"Where is Duke Grid now?\"\n\nThe war for Patrian would determine Reidan's fate. Yet Grid hadn't appeared once during the fighting. How could a duke abandon such a critical moment?\n\n\"Duke Grid is currently hunting.\"\n\nEarl Ashur blinked. Then understanding dawned. *Of course. He hunts alone to defend his territory from greater threats.*\n\n\"Something like that.\"\n\nLauel allowed the misunderstanding to stand. Grid's growth was their absolute weapon. The stronger Grid became, the stronger Overgeared became. But there was no need to explain the full picture.\n\nLauel's expression warmed as he sent a whisper to Faker.\n\n> -The northern road is open. Go to Marquis Steim as scheduled. Tell him about Grid's independence.\n\nWhen Marquis Steim pledged his service to Grid, the next phase would begin.\n\n> -We will make Grid a king.\n\nThe timing was problematic. A kingdom surrounded on three sides by Eternal, Gauss, and the Saharan Empire would struggle. Worst case, it could collapse quickly. But Lauel didn't care. Only one thing mattered.\n\nHe wanted Grid to claim the title of **First King**.\n\n*I can't let Ares take it.*\n\nA legendary rated title, without question. The effects would eclipse **Kingdom's Hero** by orders of magnitude.\n\n***\n\n\"Patrian has fallen?\"\n\nThe messenger's words echoed through the throne room of Reinhardt, capital of the Eternal Kingdom.\n\n\"Not just fallen. Earl Ashur has betrayed us. He serves Duke Grid now.\"\n\nKing Aslan's legs gave out. He collapsed into his throne, staring at nothing.\n\n\"The knight I sent to Earl Ashur. Where is he?\"\n\n\"Killed in battle.\" The messenger swallowed. \"By a common soldier of Reidan.\"\n\nThe assembled nobles' stares burned into Aslan. *Why send a knight weaker than a foot soldier as reinforcement?*\n\n*A soldier defeated a Solo Number Knight?*\n\nImpossible. The report had to be wrong. King Aslan grasped for explanation.\n\n*Duke Grid discovered Nautilus was a Red Knight. He dealt with it personally.*\n\nGrid must have disguised himself as a soldier to eliminate the Red Knight without drawing attention.\n\n*The Empire can't admit Nautilus was a Solo Number Knight. They can't make this incident public.*\n\nHow could the Empire announce one of their elite knights died to a common soldier? No. To avoid humiliation, Nautilus would remain unacknowledged.\n\n*Duke Grid.*\n\nMore cunning and dangerous than Aslan had imagined. King Aslan's assumptions were entirely wrong. Grid hadn't been involved in this incident at all. In fact, Grid might not participate in any future wars. Lauel was counting on Grid's infinite growth potential. Whether Overgeared members fought wars or established kingdoms, Lauel wanted Grid focused entirely on solo progression.\n\n*Like Agnus.*\n\nAgnus commanded a guild of ranked necromancers. He played solo while his forces won glory in his name. Why couldn't Grid do the same? Lauel viewed Veradin, Agnus's chief of staff, as his rival. He aimed to give Grid more comfort and glory than Agnus ever achieved.\n\nThe **Grid: Emperor of the World** project had begun."
}