{
  "id": 508,
  "title": "Chapter 508",
  "content": "After annihilating Borneo's army and absorbing Patrian, Lauel spread a map of the Eternal Kingdom across the war table. His fingers traced the connected territories.\n\n\"By conquering Patrian, we've succeeded in connecting the north and west completely.\" He tapped three points in sequence. \"From now on, we'll use northern resources to defend against three fronts. The empire's invasion at Reidan. The Eternal Kingdom's invasion at Patrian. The Gauss Kingdom's invasion at Borneo.\"\n\nReidan, Patrian, and Borneo formed a triangular defense zone. Dispersing their troops created obvious disadvantages, but the strategic advantage was undeniable. No need to worry about their rear.\n\n*Looking at the current situation, we'll be able to hold on for the next two years. If we hold on, there's a chance to counterattack.*\n\nThe problem was Cork Island, separated from the southern part of the Eternal Kingdom by the sea. Impossible to protect. Lauel exhaled slowly.\n\n\"Give up Cork Island.\" He met the eyes of each guild officer. \"Please have all members residing there return to Reidan.\"\n\nPeak Sword slammed his fist on the table. \"Cork Island is the territory that the Silver Knights Guild won after a fierce battle! We can't give it up so easily!\"\n\nToban shifted in his seat. \"Cork Island has high profit as a tourist destination and twenty-three mines. It's the territory with the highest value. It's hard to obediently give it up.\"\n\nLauel's expression remained neutral. \"But what can we do? It's impossible to spare resources and forces for Cork Island.\"\n\nHe felt regret. It would be a lingering regret. But he needed to make a realistic decision. He couldn't be emotional like Peak Sword or express an opinion without a solution like Toban. Lauel carried the responsibility of being Grid's representative.\n\n\"Cork Island won't last long against an offensive from Eternal. Better to not be obsessed with it and give it up instead of receiving huge damages.\"\n\nLauel showed objective judgment, but Peak Sword stood abruptly.\n\n\"I will go to Cork Island.\" His voice cut through the room. \"I'll protect it for as long as I can. Just give me permission to take ten guild members from the Silver Knights. I'm well aware of the lacking manpower, but please do me this favor. I will make sure that you benefit from this.\"\n\nLauel studied Peak Sword's face. Peak Sword's skills ranked among the top in Overgeared. He didn't perform well in the National Competition, true. However, it was inevitable due to the nature of his class. Looking at simple combat ability, he was just below Regas and Pon, and his leadership surpassed theirs both.\n\n\"If you have the Silver Knights members, you will be able to extend the time it takes for Cork Island to be occupied.\"\n\nThe limit was probably one or two months. The resources and taxes from those two months would certainly help Overgeared. But Lauel thought the damage outweighed the benefits.\n\n\"Peak Sword, Cork Island doesn't have any monsters suitable for third advancement classes to hunt.\" Lauel leaned forward. \"Your growth during your stay there will be stagnant. In the long run, this will be a huge loss of power for Overgeared. Thus, I can't send you...\"\n\n\"No, I can grow without hunting.\" Peak Sword interrupted Lauel's words with a hoe. No, a pickaxe. He held it up. \"I will stay in the mines when I'm not defending the island.\"\n\nSteady labor would raise his mining skill as well as his stats. He would become stronger little by little. They could also obtain ores there.\n\n\"Cork Island is a special territory for me. It resembles Dokdo.\" Peak Sword's grip tightened on the pickaxe. \"So Lauel, please send me to Cork Island. I will protect it as long as possible.\"\n\nHe was prepared to die many times. One month, two months. No, he would secure funds for Overgeared by defending Cork Island for three or four months. Lauel finally gave up when he saw the flames burning in Peak Sword's eyes.\n\n\"I understand.\" He allowed himself a small smile. \"Your stubbornness is comparable to Grid's and I can't break it.\"\n\nWere all Korean people like this? Lauel laughed at the thought. A gentle smile that couldn't be seen when confronting the enemy spread across his face.\n\n\"Peak Sword, I will believe in you.\"\n\nLauel personally liked Peak Sword. A person with persistence and a noble mind, he closely resembled Grid.\n\n\"Stay as long as possible on Cork Island.\"\n\nPeak Sword respectfully rose from his seat.\n\n\"I will hold it and collect resources for the guild warehouse.\"\n\nPeak Sword moved quickly. He left Borneo for Cork Island on that day. He had ten elite members of the Silver Knights with him. There was a pickaxe in the corner of their inventories.\n\nAfter that, Lauel dispersed the Overgeared members between Reidan, Patrian, and Borneo, telling them their top priorities.\n\n\"Always be prepared for war and concentrate on leveling up. Spend all the assets you've collected on potions and just keep hunting.\"\n\nLauel would stay in Reidan. He placed the safety of Duchess Irene and Lord as his top priority.\n\n***\n\n\"Finally, it's starting.\"\n\nKing of Shadows, Kasim. Immediately after Lord was born, Kasim stayed by his side and taught him Lantier's techniques. Therefore, he heard when Reidan became hostile to the Saharan Empire. He looked at the residents and soldiers of Reidan preparing for war.\n\n\"Don't be afraid. My shadows will embrace you.\"\n\nThe Nero had been destroyed by the empire. As the last survivor of the Nero, Kasim's hatred for the empire was great. Lord spoke to the man burning with the desire for vengeance.\n\n\"Teacher, control your breathing. Assassins must manage their emotions.\"\n\n\"Hah...\" Kasim exhaled slowly. \"Haha, yes. I made a big mistake because I'm still lacking.\"\n\nKasim controlled his heart and was thrilled to see how Lord was growing.\n\n*Sururuk.*\n\nKasim disappeared into the darkness.\n\n\"Young Nobleman Lord, it's time to study.\"\n\nSticks visited Lord. Lord's response wasn't good.\n\n\"Are we studying great demons today?\"\n\n\"Yes, the great demons are the enemies of all species on this earth. It's natural for you to acquire information about the great demons in advance, since you will be ruling over many humans in the future.\"\n\n\"I don't like great demons.\"\n\nLord, who had advised Kasim just a while ago to manage his emotions, wasn't controlling his emotions at all. He pouted and started complaining. Even a continent-level genius couldn't control his emotions when he was still under four years old.\n\n\"I hate talking about great demons. It's scary.\" Lord looked up with wide eyes. \"Let's study something else. Yes? Teacher?\"\n\nLord's innocent facial features combined with his begging eyes. The child had a lovely appearance that combined the merits of his mother and father, causing Sticks to feel a strong pain in his heart.\n\n*Ugh... So cute.*\n\nMaybe it was because he almost died from a heart attack previously. Sticks breathed roughly to ease the pain of his heart and stroked Lord's head.\n\n\"Young Nobleman Lord, you have to learn it because you hate it.\"\n\nIt was somewhat philosophical. Grid wouldn't have understood what it meant, but his young son did. He focused his mind on Sticks' lecture.\n\n> [You have gained new knowledge. You have acquired the ability to detect weaknesses in some low-grade demonkin.]\n\n> [You have gained new knowledge. Dark magic evasion and defense has increased.]\n\nSticks' vast knowledge was gradually passed down to Lord. The combination of a genius student and a mentor with close to infinite knowledge was producing great results.\n\n***\n\n\"Why is Bunny Bunny broadcasting with OGC? Where did Park Shinye go?\"\n\nAfter the end of the advertising break, the broadcast of Grid's hunt resumed and the viewers were confused. It was because OGC's announcer, Park Shinye, disappeared without a trace. What happened during the ten minutes when ads were playing? The viewers questioned it and Park Shinye felt confident.\n\n*Grid, don't you know how popular I am?*\n\nAs an announcer representing OGC, she had countless fans. After the truth was revealed, her fans would accuse Grid. She was confident that Grid would lose some popularity. Unfortunately, people's concerns about her didn't last long. Finally, the final boss of the vampire city appeared. Everyone's attention focused on Grid and the boss. From the beginning, Park Shinye's existence was infinitely weak in front of Grid.\n\n\"Kukukuk! I am a true blood kindred! Vampire Viscount Steg!\"\n\nThe vampire descended with a bloody energy around him. His force wasn't a joke. An overwhelming feeling was being emitted by his shining eyes and dark trident. This was the dignity of a king. He seemed much stronger than the drake that appeared in the National Competition. It seemed impossible for Grid to raid him alone. But Grid was stronger than he was during the National Competition and he had something that made the vampires much weaker than drakes.\n\n**Peok! Peok peok peok!**\n\n\"Heeeeeok!\"\n\nThe God Hands wielded Mjolnir and caused infinite stiffness! Steg wasn't able to resist and died, while Grid gave advice to the viewers.\n\n\"A sub-boss can't resist CC with a short duration like stiffness. It's simple to raid them after causing infinite stiffness.\"\n\nThe viewers started to become heated. Grid, Bunny Bunny, and the OGC staff succeeded in leaving the vampire city. At this moment, Grid's hunting broadcast stopped. Grid reached level 317 and turned to a new hunting ground.\n\n*The East Continent.*\n\nHe was planning to follow the footsteps of Kraugel, who had held the number one ranking with his overwhelming leveling speed. His ultimate goal was to get ahead.\n\n*I will make you go after me.*\n\nGrid's motivation shot up. He always set a new goal so that he wouldn't become stagnant."
}