{
  "id": 509,
  "title": "Chapter 509",
  "content": "*Snore... snore...*\n\nLord practiced his assassin skills every morning and every night. Nobody knew this fact. Kasim's presence itself was a secret.\n\n\"Uhuh! Young Nobleman Lord, are you sleeping in class?\"\n\nSticks smiled bitterly as Lord started dozing off during the second half of the lecture. He didn't know that Lord had been training all of last night and this morning.\n\n*He might be a genius that represents the continent, but he's still a child. He's lacking concentration and stamina.*\n\nSticks didn't intend to reduce the lecture time, despite knowing this. He wanted to teach Lord more and more.\n\n\"Young Nobleman, if you feel tired then let's take a break for an hour before continuing the lessons. Rest your eyes for a moment.\"\n\n\"Uhhh... Yes.\"\n\nLord answered sleepily. He headed out into the beautiful garden where petals swayed in the breeze. It was a garden that existed due to the past activities of the Overgeared members.\n\n\"Oh my? Lord, did today's class end early?\"\n\n\"Kyaaah! I'm happy! We can play a lot today!\"\n\nThere were dozens of girls waiting for Lord in the garden. They were girls more beautiful than the flowers, each with a different personality.\n\n\"Ohh... It isn't over. A quick break. I'm going to sleep.\"\n\nLord yawned, headed into a girl's arms, and fell asleep straight away. The girls loved this cute and loveable Lord.\n\n\"Kukuk, so cute.\"\n\n\"Sleep well and grow up quickly, our Lord.\"\n\nSome girls poked Lord's cheeks, others kissed him, and some hugged him. There were also girls who stroked his head. They were the Rebecca's Daughters candidates. They were Lord's girlfriends.\n\n\"Hah.\"\n\nVantner found Lord sleeping in the girls' arms and blinked.\n\n*I'm envious!*\n\nHe never thought that a child of Grid would be so beautiful and have so many pretty girls. Vantner angrily poked Lord in the side with a branch and ran away. After a while, he was caught by the girls chasing after him and beaten up.\n\n\"Any actions that threaten Lord are unforgivable, even if you're a member of Overgeared.\"\n\n\"Duke Grid himself asked this of us! We will take good care of Lord!\"\n\n\"...\"\n\nVantner, who failed in his 103rd blind date a few days ago, was miserable in both mind and body. He was frustrated for a while and belatedly realized something.\n\n*Why are these kids so scary?*\n\nVantner had overlooked it, but the girls were strong. In the first place, they were taken to be Rebecca's Daughters because they were talented. Then after coming to Reidan, they received Piaro's training. The power of Reidan was much stronger than that of Overgeared.\n\nOne of the people who contributed to this rising power was Aura Master Hurent.\n\nPiaro hadn't come again today. One day, Piaro had suddenly disappeared. Hurent had been disguised as an unnamed serf and trained by Piaro for several months already. He was in a bad mood after Piaro disappeared.\n\n*Where did that guy suddenly disappear to?*\n\nHe wanted to ask people, but felt reluctant. He was worried that he would be thrown out by the Overgeared members if he was discovered. Hurent covered his face even more with the straw hat he received from Piaro and eventually started his field work again.\n\n*Come back soon. Until then, the fields that you cherish... No, I will defend these training grounds.*\n\nHurent followed the field work techniques that Piaro taught him in order to become stronger. At first, he thought of Piaro as an enemy. After the great teachings, he truly considered Piaro as a true benefactor and teacher. His desire for vengeance against Grid had disappeared a long time ago.\n\nIt wasn't Grid's fault that he was disgraced after being defeated by Grid in five seconds. The result occurred because he was weak. He should focus on himself rather than feeling resentment towards Grid. However, if the opportunity came, he wanted to fight against Grid again. He would prove his strength.\n\nIt was a pure desire, different from his previous grudges.\n\n***\n\n> **[(Breaking News) Overgeared Guild captured Patrian and Borneo!]**\n\nThe world was overturned. Patrian and Borneo. Few players knew the names of the territories in small kingdoms. But they were clearly strategically important points when looking at a map. The Overgeared Guild swallowed these territories in two days. The amazing fact was that it occurred when Grid was on air.\n\n*I didn't know the power of Overgeared was this much. Taking two new territories without Grid... It was only one a few days ago. Isn't the master of Patrian one of the 10 great magicians, Earl Ashur?*\n\n*It was possible because there was no Grid. There was a small number of players inside Patrian and Borneo because everyone was busy watching Grid. This meant Overgeared had relatively easy access to the two territories. In other words, it was an important empty fort.*\n\n*It's a strategy that Lauel devised. He truly is a genius... It clearly shows the role of Overgeared's brain.*\n\n*It isn't just Lauel. There are many famous people in Overgeared. I appreciate Grid's ability to gather so many individuals that are hard to control and managing them.*\n\n*I don't think Grid is lacking anything. He has high level combat ability, unique blacksmith skills, raid and hunting ability, the charm to attract talent, and the wisdom to use that talent in the right places. As for the leadership that raised the guild to be the best... Isn't this a perfect human being?*\n\n*Having a charm that attracts people means his personality is also good... Actually, he's probably a very kind person. There's a reason why Grid is loved by the world's top beauties like Yura and Jishuka.*\n\nPeople's misunderstandings deepened every day. They talked about a perfect person called Grid. And the experts started debating.\n\n*Grid will probably become the first king.*\n\n*It's likely. It is unclear how many territories are owned by third parties, but Overgeared has Reidan, Bairan, Cork, Patrian, and Borneo. The combined size is enormous. Maybe Grid will soon be eligible to be king.*\n\nSatisfy's opening phase. Players, like NPCs, could become nobles and even royalty. In order to build up wealth, power, honor, and to reach a high status, the players worked tirelessly. As a result, many rankers had succeeded in becoming nobles. However, no one had yet become qualified to be a king. This was the first time that the media used 'First King' for a particular player.\n\nOf course, the shockwave was large. Many refuted it.\n\n*Do you think a kingdom can be built just based on territory? The most important thing is the workforce, the workforce.*\n\n*The Overgeared members are only in the hundreds. They're lacking the talent to build and manage a country.*\n\n*No. Personnel can be filled up with NPCs.*\n\n*Are competent NPCs that common? I assure you, the construction of a country for a player is only possible after at least three years. In addition, the player is likely to be someone other than Grid.*\n\n*Who is that?*\n\n*God of War Ares. He's an unofficial ranker and his activities are limited to wars, so few people know about him... His ability in war and politics will surely overwhelm Grid's.*\n\n***\n\n\"You've grown since I last saw you.\"\n\nOriginally, Grid always looked for Irene first when he returned to Reidan. But right now, Lord was a priority. His love for Irene strengthened his love for Lord.\n\n\"The more I look, the prettier he is.\"\n\nAll parents said their children were cute, but Lord was really beautiful. He had Irene's white skin, oval-shaped face, and big blue eyes. He resembled Grid in his high nose and sharp eyes.\n\nThese features harmoniously intertwined to create a perfect young man.\n\n\"Huhuhut... It's like my childhood...\"\n\nGrid looked at the past and stroked the hair of the sleeping Lord.\n\n\"Please always continue to grow up healthy.\"\n\n*Don't suffer misfortune and always be happy. Don't get upset when meeting someone strong. Become the pride of my love, Irene.*\n\nGrid made a gentle expression and confirmed Lord's status window out of habit.\n\n---\n\n**Name:** Lord Steim  \n**Age:** 3 years old  \n**Gender:** Male  \n**Occupation:** Young Nobleman\n\n**Title: Grid's Son**  \nThe son of a legendary blacksmith. He has inherited most of his father's abilities.\n\n**Title: Genius of the West Continent**  \nA genius that represents one continent. He overwhelms national geniuses, and his level and abilities will rise **60%** faster than normal. In addition, he can acquire skills in a wide range of fields.  \nHowever, there is a limit to the level and abilities that can be raised until he is 15 years old.\n\n**Title: One who Will Become a Legend**  \nA person who will leave his name in history. There is an **80%** chance of being immune to all status effects and illnesses. When attacked, if his health falls to 1 point, he will enter the immortal state for **2.5 seconds**.\n\n**Level:** 15\n\n**Strength:** 87 | **Stamina:** 70  \n**Agility:** 109 | **Intelligence:** 87  \n**Dexterity:** 150 | **Charm:** 100  \n**Dignity:** 17 | **Insight:** 80\n\n**Skills:** Beginner Bow Mastery (F), Beginner Blacksmith Skill (F), Beginner Weapons Mastery (C), Daluka's Methods (A+), Discerning Eyes (S), Overwhelming Charm (S), Lantier's Methods (SS), Famous and Legendary Pedigree (SS).\n\nHis mother is the successor of a noble family in the Eternal Kingdom and his father is a legend.\n\nHe has inherited all of his parent's strengths, so his potential is outstanding. Teaching him will be inspiring.\n\nRecently, the discipline has been effective and he has learned humility. His heart is being tempered by the love from females.\n\n---\n\n\"Eh...?\"\n\nLantier's Methods. Previously, Grid hadn't known what it was when he discovered it, but now he knew. Lantier. The name of the legendary assassin Grid met in the Behen Archipelago.\n\n*How does Lord have Lantier's power...?*\n\nNo matter how much of a genius Lord was, there was no way he could learn the power of a legend on his own. Someone had to intervene with Lord's teachings. The problem was that person's identity. Who would give Lord such strength, and what were their intentions?\n\nGrid lost his smile as his eyes shone fiercely. He maximized his senses and caught something."
}