{
  "id": 510,
  "title": "Chapter 510",
  "content": "The ceiling felt wrong.\n\nGrid tightened his grip on Lord's blanket. His senses had sharpened since the boy's birth—every dungeon in the Behen Archipelago, every fight in the National Competition, every raid had honed his instincts to a razor's edge. The vampire cities had pushed him past human limits. Now his body read threats the way a blacksmith read metal. Temperature. Weight. Pressure.\n\nSomething was breathing up there.\n\n*Magic Detection.*\n\nLight flared through Lord's bedroom. The spell mapped every surface, every shadow. There. A shape pressed flat against the ceiling, coiled like a viper.\n\n\"How dare you.\"\n\nGrid ripped Iyarugt from his inventory. The Sword Ghost materialized in his off-hand, both blades tracking the presence. He thrust upward.\n\nEmpty air.\n\n*Gone? Already?*\n\nHis blood went cold. That reaction speed was inhuman. Whoever had been hiding in his son's room, watching Lord sleep, was a professional. The kind who made corpses, not mistakes.\n\n\"Shit!\"\n\nGrid scooped Lord into his arms. The boy didn't stir, exhausted from his training regimen. Good. He needed to stay asleep. Needed to stay safe. Grid pivoted toward the ceiling and unleashed Wave.\n\nEnergy erupted from Iyarugt in a cascading arc. The wave of force obliterated the plaster, splintered the wooden beams, sent debris raining down. Through the dust, Grid spotted the intruder. Black clothes. Face wrapped in a turban. Moving through shadows like water through cracks.\n\n*Shadow Move.*\n\nThe figure vanished into the darkness cast by falling rubble. Grid's eye patch flared. The Slaughterer's vision cut through the gloom, tracking the intruder's path to a new position behind a collapsed beam.\n\nGrid was already moving. Kill surged through his blade as he struck. The black sword carved a line of killing intent through the air, straight for the intruder's heart.\n\nFour golden shapes blurred into position. The God Hands materialized around the intruder, boxing him in. Their hammers gleamed.\n\n*Trapped.*\n\nThe intruder froze. His voice came out tight. \"Shadow Soldiers!\"\n\nEvery shadow in the bedroom responded. They peeled away from the walls, the furniture, the floor. Sixty-seven shapes formed—some human-sized, others no bigger than dogs. All of them moved in perfect sync. They created a barrier of writhing darkness around their master.\n\nGrid's Kill slammed into the wall of shadows. The God Hands followed, hammers whistling through the air. The shadows absorbed the impacts, rippling like disturbed water.\n\nThen they attacked.\n\nSpears of pure darkness launched from every shadow soldier simultaneously. The volley hammered into the God Hands.\n\n> [God Hand (1) has stiffened.]\n> [God Hand (2) has stiffened.]\n> [God Hand (3) has stiffened.]\n> [God Hand (4) has stiffened.]\n\nThe notifications kept scrolling. Each God Hand locked in place, stunned by the precision strikes.\n\n\"Crazy.\"\n\nGrid shifted Lord to one arm and raised Iyarugt. The intruder moved like a nightmare made real. His control over shadows was absolute. Movement. Defense. Offense. Every technique flowed seamlessly into the next. Grid had fought Tarma, the National Competition assassin. This man made Tarma look like a child with a kitchen knife.\n\n*Who the hell is this?*\n\nThen it clicked. The shadow techniques. The turban hiding the face. The sheer skill level.\n\n*King of Shadows.*\n\nKasim.\n\n*That bastard. He's back to finish what he started.*\n\nYears ago in Winston, an assassin named Shay had hired Kasim to kill Grid. Huroi and Euphemina had driven him off. But assassins didn't forget contracts. They waited. They prepared.\n\nGrid clenched his jaw. \"Noe! Randy!\"\n\nHis pets materialized. Grid poured everything into Linked Kill Wave. The fusion skill tore through Lord's bedroom. Eight consecutive strikes, each dealing his maximum damage output. The walls exploded outward. Reidan Castle trembled on its foundations.\n\nNone of it touched Kasim. The assassin flowed through shadows like smoke, emerging behind Grid with barely a sound.\n\n\"Duke Grid, please calm down first and let me spea—\"\n\n\"Where are you going?\"\n\nRandy stepped out of Grid's shadow. The doppelganger mimicked Grid's stance perfectly, launching Link at Kasim's exposed back.\n\n\"Kyong!\"\n\nNoe's jaws gaped wide. The memphis lunged, ready to swallow the assassin whole. The God Hands recovered from their stun and charged, Mjolnirs raised.\n\nKasim's voice turned sharp. \"Greed.\"\n\nEvery shadow in the room rushed toward a single point. The darkness condensed into something that bent light, that pulled at Grid's vision like a wound in reality. For three seconds, the black hole consumed everything. Randy. Noe. The God Hands. Furniture. Debris. All of it vanished into the void.\n\nGrid stood alone, Lord clutched against his chest. His boots scraped against the floor as the pull tugged at him.\n\nThen it released. Everything spilled back out in a rush of displaced air.\n\n\"Duke Grid!\" Kasim's hands were raised, empty. \"I'm not an enemy!\"\n\n\"Not an enemy?\" Grid kept his blade up.\n\n\"I want to become your ally!\"\n\n\"Ally? You?\"\n\n\"Uhhh...\"\n\nLord's eyes fluttered open. The boy blinked at the destroyed room, at the man in the turban, at Grid's raised sword. Then he smiled.\n\n\"Teacher!\"\n\nGrid stared at his son. \"Teacher?\"\n\n\"Ah! Father!\" Lord seemed to notice Grid's arms around him for the first time. He hugged back, squeezing tight.\n\nNoe shook debris from his fur. His tail lashed in irritation. \"I suffered needlessly. If only you talked and resolved it from the beginning, nyang.\"\n\nThe memphis padded over to a corner and curled up. He was losing his edge. Too much time in the human world. Too much peace. A demonic beast of hell shouldn't crave naps over slaughter.\n\n***\n\n\"There was a story like this.\"\n\nGrid sat across from Kasim at the war room table. Lord had gone back to bed, escorted by Irene. The castle staff were already repairing the damage. Grid listened.\n\nKasim's voice was quiet, measured. He spoke of the Nero people. Their destruction by the Saharan Empire. His survival. The bounty on his head. His partnership with Doran. How he'd watched Grid from the shadows, evaluating. Protecting.\n\n\"I guarded Lady Irene during her pregnancy,\" Kasim said. \"And Lord after his birth. He has talent. I began teaching him what I could.\"\n\nGrid let the silence stretch. His anger had cooled during the story, replaced by calculation. Kasim had been protecting his family. Lord called him teacher. The boy didn't lie.\n\n\"Thank you.\"\n\nKasim inclined his head slightly.\n\nGrid continued. \"Our first meeting was a disaster. But that's past. You've protected my wife and son. I'm not so petty that I can't recognize that.\" He leaned forward. \"I'm also not stupid enough to let you walk away. You're the strongest assassin alive. The only one who knows Lantier's techniques. I want you. And I can give you what you want.\"\n\nKasim's eyes narrowed above the turban. \"What do you think I want?\"\n\n\"Revenge.\" Grid's voice was flat. \"Against the Saharan Empire. For the Nero.\"\n\nThe assassin said nothing.\n\n\"I'm going to war with the empire eventually,\" Grid said. \"For Piaro. For Asmophel. For my own reasons. It won't be easy. Might be impossible. But I'll do it anyway.\" He met Kasim's gaze and held it. \"You saw the possibility when you watched me. So believe in me. Serve me.\"\n\nKasim stood. He moved around the table and knelt.\n\n\"I am grateful.\" His hand pressed over his heart. \"I will be your shadow.\"\n\n> [King of Shadows **Kasim** has become your knight!]\n> [**Kasim** has become a member of Reidan!]\n> [**Charm** has increased by **100**!]\n\n*Perfect.*\n\nGrid helped Kasim to his feet. \"I want you to keep protecting my family. And I need you to build me an assassin group. Can you do that?\"\n\n\"The remnants of the Silver Dragons are here,\" Kasim said. \"They're learning Daluka's Methods. They'll be sufficient.\"\n\n\"Good.\" Grid nodded. \"From now on, you're the leader of the Overgeared Shadows.\"\n\n\"...Yes.\"\n\nKasim's tone suggested he had opinions about the name. He kept them to himself. Smart man.\n\nGrid pulled out the Great Lord's Sword. He activated Character Observation.\n\n---\n\n**Name:** Kasim  \n**Age:** 36 / **Gender:** Male  \n**Occupation:** Leader of Overgeared Shadows  \n\n**Title:** Last of the Nero Clan  \n*The Nero have dark skin, making it easier to assimilate into darkness. As the only survivor, Kasim gains a large bonus effect when using Stealth. However, some throwing weapon power is reduced due to his elongated arms.*\n\n**Title:** King of Shadows  \n*Maximizes the effects and power of shadow techniques.*\n\n**Title:** Disciple of Lantier  \n*Knows the theories of Lantier's techniques. Lacks the talent to learn them personally.*\n\n**Level:** 401  \n\n**Strength:** 2,107  \n**Stamina:** 1,158  \n**Agility:** 4,409  \n**Intelligence:** 933  \n**Persistence:** 3,550  \n\n**Skills:** Trap Installation (A), Daluka's Methods (A+), Evolved Body Techniques (A), Evolving Techniques (A), Evolved Sword Techniques (A), Evolved Throwing Technique (S), Evolved Assassination (S), Nero's Stealth Techniques (S), Ultimate Shadow Technique (S+), Lantier's Methods Knowledge (SS)\n\n---\n\nThe stats told the story. Only one special stat—Persistence—but the value was absurd. Higher than Grid's own. This man didn't know how to quit. His strength and agility put him on par with Asmophel in direct combat.\n\n*And in shadows? He's equal to Piaro.*\n\nGrid dismissed the status window. He felt like he'd just acquired an army."
}