{
  "id": 512,
  "title": "Chapter 512",
  "content": "Grid's steps slowed as he approached the city gates. The walls stretched endlessly in both directions, vanishing into heat shimmer and crowded streets. He'd expected a village. Something modest and tucked away, befitting a 'starting zone.'\n\n*This is twice the size of Reidan.*\n\nThe population density alone made his city look like a frontier outpost. Everywhere he looked, people filled the streets in a constant tide of movement. His fingers twitched. *The tax revenue here must be insane.* He owned desert ruins and fortified border towns. Places that bled money instead of generating it. The envy sat bitter in his mouth.\n\nHe pushed deeper into Pangea, scanning the crowds. The ethnic diversity caught him off guard. He'd imagined the East Continent as purely Oriental. Black hair, black eyes, architecture straight from historical Korea. Instead, the streets presented a chaotic blend. Oriental faces mingled with Western features and Middle Eastern complexions. A Korean-style building with curved eaves stood beside a structure that could've been lifted from a European cathedral. Across the street, a mansion displayed ornate Middle Eastern tilework.\n\n\"Wow.\" Grid stopped at a corner, taking in the collision of cultures. \"This is very...\"\n\n*I should get jjamppong for lunch.* The thought came unbidden. Some small part of him deflated. He'd wanted that mysterious Eastern atmosphere. The kind you saw in old martial arts films.\n\nHe shook his head. *Actually, this works better. Western players won't stick out like targets.*\n\nPangea served as the gateway. Of course they'd design it to accommodate all visitors from the West Continent. The pure Oriental kingdoms probably existed deeper inland, away from the cultural crossroads.\n\n*Somewhere out there.*\n\nGrid spent hours walking the streets. He watched merchant interactions. Studied how guards conducted themselves. Noted which gestures caused offense and which opened doors. This wasn't the old Grid who charged in without thinking. Every observation served a purpose. Adaptation required understanding.\n\n*Nothing too different from home. Just... variants.* He'd seen enough. Time to find a smithy.\n\nAn elderly man with a substantial belly waddled past. Grid moved to intercept.\n\n\"Esteemed elder, excuse me.\" He kept his tone respectful. \"Can I ask a question?\"\n\nThe old man, labeled Pao Woo in Grid's vision, turned with the patient expression of someone accustomed to giving directions.\n\n\"Where is the smithy?\"\n\nPao Woo's eyes performed a quick assessment. \"Is this your first time in Pangea?\"\n\n\"Yes.\" Grid kept his answer simple. \"I came from far away.\"\n\nHe didn't mention the West Continent. The political climate here remained unknown. Better to stay vague. His old self would've announced his origin proudly and dealt with consequences later. Growth meant learning caution.\n\nPao Woo smiled, gesturing toward the city center. \"Ahh, I see. There should be one or two smithies over there...\"\n\nHe oriented his directions from the central square. \"There is the White Hammer smithy on the east road, the Black Anvil smithy on the west road, the Red Tongs smithy on the south road, and the Blue Flames smithy on the north road. They are the most famous smithies in Pangea. If you visit one of them, you will surely be able to buy something that suits you.\"\n\nGrid's interest sharpened. \"Are there many blacksmiths working there?\"\n\n\"A moderate amount. At least 100.\"\n\nThe number made sense. Pangea's population required more than weapons and armor. Kitchen knives, farming tools, construction materials, household items. The production demand in a city this size must be staggering. Western territories typically limited smithy numbers to prevent economic power from challenging the local lord.\n\n\"Thank you.\" Grid bowed slightly to the kind elder and headed east.\n\nThe White Hammer smithy sat only five minutes away. Proximity made the choice for him.\n\n***\n\n> [You have entered the White Hammer smithy.]\n\n> [The blacksmiths of the East Continent have a different viewpoint from those of the West Continent. The effect of Pagma's Descendant won't work.]\n\nGrid frowned at the notification. Back west, intermediate blacksmiths favored him on sight. Advanced blacksmiths practically worshipped him. They recognized his skill through subtle tells. The calluses on his hands. How he moved through a workspace. The way he evaluated metal. Eastern smiths apparently lacked that discerning eye.\n\n*Disappointing.*\n\nNot because of the treatment. Grid had suffered worse than being ignored. The real concern ran deeper. *If they can't recognize quality, maybe they lack the skill to teach me anything.*\n\nThe entire trip east might yield nothing. He'd come hoping to expand his techniques, but perhaps the gap wasn't as large as he'd hoped.\n\n*Focus on leveling and title acquisition instead.*\n\nHe started to turn toward the exit.\n\nTTAAANG!\n\nThe sound of hammer on metal stopped him mid-step. Crystal clear. Perfect resonance. Grid's head snapped toward the workshop floor. *Wait.*\n\nTtang! Ttang! Ttang!\n\nHWARURUK!\n\nPuok. Puok.\n\nCHIIIIK!\n\nTen blacksmiths worked in synchronized chaos around a central furnace. One sat at an anvil, hammer rising and falling in controlled strikes. Another quenched heated metal, steam billowing. A third manned the bellows in steady rhythm. Grid's trained eye catalogued their movements, their postures, the way they handled their tools.\n\n*Advanced level. All of them.*\n\nThe realization hit like cold water. Eastern smiths didn't recognize his greatness because they operated under different principles. Not inferior. Different. Their techniques diverged from Western methodology entirely.\n\n*No. Not different. Superior.*\n\nHe watched them layer metal, folding it repeatedly in the forging process. Each fold required immense physical strength, inhuman patience, and surgical precision. Western smiths avoided this labor-intensive approach. They chose easier paths. Faster completion times. Grid had been guilty of the same shortcuts.\n\n*This is a better professional mindset.* His eyes tracked every detail. *Is it the competition? With so many smiths in one city, only the dedicated survive.*\n\nThe equipment caught his attention next. When working iron, they used iron hammers. Switching to mithril, they changed to mithril tools. Each metal received treatment from matching materials. It preserved the metal's nature. Increased forging efficiency.\n\n*Why didn't I think of that?*\n\nGrid leaned closer, studying the quenching process. *What's that liquid they're adding to the water?*\n\nSo much to learn. He'd been arrogant, assuming Western techniques represented the peak. His fingers itched to ask questions, to observe for hours, to—\n\n\"Do you want to learn blacksmithing from us?\"\n\nGrid straightened. A man approached from his left. Dark skin. Thick lips reminiscent of African heritage. Neck muscles so developed they matched Grid's thigh circumference in thickness. The name **White** floated above his head.\n\nThe man's expression radiated gentle condescension. \"Well, it's wonderful that you want to learn, as long as you are prepared to work. But I have many people like you come here every day. I can't accept just anyone. If you want to learn our techniques, you must first prove that you are qualified.\"\n\nGrid raised a hand. \"No, I just want to briefly tour...\"\n\nWhite shoved an axe into Grid's grip before he could finish. A notification materialized.\n\n> **[A quest has been created.]**\n\n> **[Chop Firewood!]**\n> Difficulty: ???\n> White, the owner of the White Hammer smithy wants to test you.\n> Bring back two 100 year old White Trees at the forest in the north of Pangea.\n> Quest Clear Conditions: Cut down two 100 year old White Trees.\n> Quest Clear Rewards: 12% experience. Get a job as an apprentice at the White Hammer smithy.\n> Quest Failure Condition: None.\n\n*Is this a joke?*\n\nGrid's eyes narrowed at the quest text. He was level 317. This man expected him to chop firewood. The reward listed an apprentice position. Someone actually thought they could make a legendary blacksmith into an apprentice.\n\n*There's knowledge here, sure. But not enough to justify wasting time on manual labor.*\n\nHis techniques already surpassed theirs. He could absorb new concepts and approaches by observation. The actual execution? He'd mastered that years ago. This quest screamed beginner content. Probably designed for new Eastern Continent players starting their crafting journey.\n\nHe prepared to refuse.\n\nThen his eyes caught on the experience reward again.\n\n*12%.*\n\nGrid did the math. At level 317, that equaled roughly 500 lesser vampires. Five hundred kills condensed into chopping two trees. The system didn't lie. Ever. His pulse quickened.\n\n\"Really?\" He looked up sharply. \"I just need to cut down two trees?\"\n\nWhite nodded. \"Yes.\"\n\nGrid's face split into a grin. \"Then I will go!\"\n\n*Paradise. The East Continent is paradise.*\n\nHe hefted the axe and sprinted toward the northern exit. The quest marker glowed on his mental map. Behind him, White watched the enthusiastic figure vanish into the city crowds.\n\nAnother blacksmith approached White's shoulder. \"Do you really think he can cut down a 100 year old White Tree?\"\n\nThe trees earned their alternate name, Daoism Trees, through reputation. Hard as iron. Fierce as active volcanoes. Famous woodcutters couldn't nick the bark. Powerful shamans couldn't suppress the internal fire. In theory, burning them produced perfect flames for smithing. In practice, harvesting them proved impossible. Anyone dreaming of blacksmithing learned this as foundational knowledge.\n\nThat young man with the black eyes clearly lacked basic education. Probably never studied smithing at all.\n\nWhite shook his head. \"There are a lot of rabble coming in recent years.\"\n\nHe returned to his station and raised his voice. \"Hey you! Focus more! We have to win this year's competition!\""
}