{
  "id": 513,
  "title": "Chapter 513",
  "content": "\"Damn.\" Grid wiped sweat from his brow, his breathing labored.\n\nThe East Continent's crushing gravity punished every step. His stamina drained twice as fast, his movements sluggish, as if iron weights hung from his limbs. An hour of running from Pangea's center to the White Tree Forest had left him gasping—a journey that would've taken eighty minutes on the West Continent without breaking a sweat.\n\n*If I flew, this would be easier.* Grid glanced at the sky, then dismissed the thought. *But something might notice me. No unnecessary risks.*\n\nHe allowed himself a small, satisfied smirk. *Look at me, thinking ahead. I'm getting smarter!*\n\nCresting a hill, he spotted his destination below. The white forest sprawled within the city's boundaries—roughly a thousand trees packed together, their pale leaves shimmering like fresh snowfall. From this distance, the grove resembled a sea of cotton nestled among traditional Korean-style houses with curved tile roofs.\n\n*It's actually beautiful.* Grid paused to appreciate the scene. *Like something from those historical dramas. Makes me want to sit down with some kimchi and soju...*\n\nHis mouth watered at the thought. A quick logout, a few drinks, maybe some grilled pork belly—\n\n*No.* He shook his head firmly. Playing Satisfy drunk was suicide. Too many players had woken up hungover to discover they'd blown millions enhancing their equipment in an alcohol-fueled haze. If he wanted to stay at the top, alcohol was off-limits during game time.\n\n\"Eat, exercise, build stamina...\" Grid muttered, mentally scheduling his breaks. \"Then log back in with a clear head.\"\n\nSteeling himself, he descended into the forest.\n\nWhite phosphorus trees surrounded him, their ivory bark smooth as porcelain. Grid approached the nearest specimen—about five meters tall—and pressed his palm against the trunk.\n\n*A hundred-year-old tree? Let's see how old you really are.*\n\n\"Legendary Blacksmith's Appraisal.\"\n\n> **[White Phosphorus Tree]**\n> **Status:** Very healthy  \n> **Age:** 607 years  \n> \n> It is assumed that the origin of this tree is Shangri-La.  \n> It is often called the Daoism Tree and is the national wood of Hwan Kingdom.  \n> The trunk and branches extend straight towards the sky.  \n> The hardness of this tree, which symbolizes high dignity and elegance, is comparable to dragon iron.\n\n\"Six hundred years?\" Grid's eyes widened. \"And what the hell is dragon iron?\"\n\nThe mention of Shangri-La and Daoism didn't surprise him—he'd encountered the Daoist class before. But dragon iron was new.\n\n*Must be a local mineral.* His curiosity stirred. *Something unique to the East Continent.*\n\nThe implications excited him. Different environments meant different materials. Different materials meant new items to craft, new possibilities to explore. His mind raced with potential designs, gear combinations he'd never considered.\n\n*My options just expanded.*\n\nHumming softly, Grid moved through the grove, appraising tree after tree. Each scan revealed the same pattern.\n\n\"They're all ancient.\" He frowned. \"Most are over five hundred years old. Some are over a thousand.\"\n\n*A hundred-year-old tree? What a joke.* The quest suddenly seemed less straightforward. These weren't saplings—they were living monuments, older than kingdoms.\n\nFor a moment, he hesitated. Cutting down centuries-old trees felt... wrong somehow.\n\nThen he shrugged. *It's just a quest. And it's worth twelve percent experience.*\n\nHe selected his targets carefully: a 103-year-old specimen and its 106-year-old neighbor. The youngest trees in the entire forest. Grid pulled the quest axe from his inventory.\n\n> **[White's Axe]**  \n> Rating: **<span class=\"normal\">Normal</span>**  \n> **Durability:** 150/150  \n> **Attack Power:** 53  \n> \n> An axe made by the owner of the White Hammer smithy, White. It boasts great durability, allowing more trees to be cut down.  \n> It is highly popular among the nearby woodcutters.  \n> \n> **Conditions of Use:** None.  \n> **Weight:** 109\n\nGrid tested the axe's weight, nodding approval. No special options, but solid durability and decent attack power for a restriction-free tool. On the West Continent, novice players would buy this as a beginner weapon.\n\n*Like something Khan would make.* He studied the craftsmanship. *White looks mid-thirties. If he's already this skilled as a regular NPC—not even a Named one—the East Continent blacksmiths must be leagues ahead.*\n\nIt made sense. The West Continent's guild system limited how many blacksmiths could operate in each territory, creating artificial scarcity. The East Continent had no such restrictions. More smiths meant fiercer competition, which bred innovation and skill.\n\n*Which means better equipment for soldiers.* Grid's tactical mind turned. *East Continent armies probably outclass Western ones.*\n\nHe smirked. *Well, not MY soldiers. Reidan's troops have a legendary blacksmith equipping them. We're the real Overgeared.*\n\nPride swelling, Grid activated Latina's Power.\n\n\"Can You Become the King of the Dead?\"\n\nTwo skeletons materialized, their half-moon axes gleaming. Overgeared Skeleton One and Two stood at attention.\n\nGrid handed the quest axe to Skeleton One, then sat cross-legged against a nearby tree. \"I'll recover stamina while you work. Even you two idiots should manage basic woodcutting.\"\n\nClack clack! Clack!\n\nSkeleton One gripped the axe with bony hands, wound up, and swung with all its might.\n\n*Peok!*\n\nThe impact rang through the forest.\n\nGrid blinked.\n\nSkeleton One's eye sockets widened impossibly. Its entire frame twisted, bones grinding against each other with an agonized screech.\n\n*What the—?*\n\n> **[Overgeared Skeleton One has suffered catastrophic damage!]**\n> **[Overgeared Skeleton One has returned to the soil.]**\n\nThe skeleton crumbled into dust. The white phosphorus tree stood unmarked, not even a scratch on its pristine bark.\n\n\"You've got to be kidding me.\" Grid stared at the pile of bones. *It couldn't even survive the recoil from hitting a tree?*\n\nHe clicked his tongue, gesturing to the remaining summon. \"Skeleton Two, please tell me you're less pathetic.\"\n\nIn his mind, he was already planning their builds. *Fine. Skeleton One gets intelligence points—make it a mage. Skeleton Two will be a warrior.*\n\nThen he remembered. They were identical. Same level. Same stats.\n\nSkeleton Two raised the axe.\n\n*Kaaang!*\n\nClack! Claack! Clack clack!\n\nThe second skeleton shattered just like the first, bones scattering across the forest floor.\n\n\"This is insane.\"\n\nGrid sat frozen, staring at the dust where his summons had been. Then anger surged. He snatched up White's Axe.\n\n\"Useless pieces of shit!\"\n\n*Can't even cut down a goddamn tree!*\n\nTaking a deep breath, Grid positioned himself before the white phosphorus tree. He adjusted his grip, set his stance, and swung.\n\n*Chaaeng!*\n\n> **[The durability of White's Axe has decreased by 37.]**  \n> **[There is strong pain in your wrist. You are temporarily paralyzed.]**  \n> **[You have resisted.]**  \n> **[Health has decreased by 1,700.]**  \n> **[You were unable to damage the white phosphorus tree.]**\n\n\"Guh!\" The shock raced up Grid's arm. He stumbled back, his wrist throbbing.\n\n*At least steel-grade hardness.* He stared at the tree with new respect. *Dragon iron comparison wasn't an exaggeration.*\n\nUnderstanding dawned. *That's why a woodcutting quest gives twelve percent experience. It's not about finding the tree—it's about actually cutting it down.*\n\n*Most blacksmiths would fail this automatically.* Grid's jaw set with determination. *But I'm not most blacksmiths.*\n\nHe sheathed White's Axe and drew **+9 Failure**, gripping the blue greatsword with both hands.\n\n\"Never thought I'd need to cut a tree with a sword.\"\n\n*Kkuok.*\n\nGrid's stance shifted. White leaves drifted around him like snow as he began to move.\n\n*Step.*\n\nHis sword traced elegant arcs through the air—Pagma's Swordsmanship taking form. Grid's body flowed through the practiced motions of Link, each movement building momentum.\n\n\"**Link!**\"\n\n*Pit! Pipipipipit!*\n\nDozens of energy blades hammered the tree in rapid succession.\n\n> **[The durability of +9 Failure has decreased by 4.]**  \n> **[The durability of +9 Failure has decreased by 5.]**  \n> **[The durability of +9 Failure has decreased by 4.]**  \n> **[There is strong pain in your wrist. You are temporarily paralyzed.]**  \n> **[There is strong pain in your shoulder...]**  \n> **[You have resisted.]**  \n> **[Resisted...]**  \n> **[Health has decreased by 1,801.]**  \n> **[Health has decreased by 1,730.]**  \n> **[Health has decreased by 1,695.]**  \n> **[You were unable to damage the white phosphorus tree.]**\n\n\"What?!\"\n\nNot a single scratch. Link—a legendary-rated skill—had failed completely.\n\n*How hard IS this thing?!*\n\nGrid's competitive spirit ignited. \"Fine! Let's see who breaks first!\"\n\nHis earlier mockery of the skeletons suddenly felt hollow. *I called them incompetent, but this tree was impossible for them from the start.* He sent a silent apology to his shattered summons.\n\nThen Grid moved, power coalescing in his blade. This time, he unleashed Pinnacle Kill—one of the strongest fusion techniques in his arsenal.\n\n*Seokeok!*\n\nThe tree cracked.\n\n\"What—?!\"\n\n*Puaaaaaaaah!*\n\nBlinding light erupted from the damaged trunk. Grid threw up his arms as the explosion engulfed him.\n\n> **[You have inflicted grievous damage to the white phosphorus tree!]**  \n> **[The white phosphorus tree has exploded from the shock!]**  \n> **[You have suffered fatal damage!]**  \n> **[A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]**\n\n*Kurururung...*\n\nThe entire forest seemed to shudder. Grid collapsed to one knee, his armor scorched and health at the bare minimum. Around him, the other white trees swayed as if in mourning.\n\nSilence fell.\n\nGrid stared at the destruction, at the smoldering crater where the tree had been. Then he started laughing—a disbelieving, slightly hysterical sound.\n\n\"Oh my god.\" He couldn't stop. \"My immortality passive... triggered... while cutting down a tree?!\"\n\nIt was absurd. Completely ridiculous. He'd faced dragons, demons, and legendary warriors without activating that skill. But a tree? A *tree* had nearly killed him?\n\nAt his feet, fragments of white phosphorus wood lay scattered. Pieces sheared off by Pinnacle Kill before the explosion.\n\nGrid's laughter faded. He picked up one of the fragments, turning it over in his hand. Even broken, it felt impossibly dense.\n\n*This material...* His blacksmith's instinct stirred. *If I can work with this...*\n\nThe quest had just gotten interesting."
}