{
  "id": 514,
  "title": "Chapter 514",
  "content": "**Chapter: The White Phosphorus Solution**\n\n*\"This isn't the time to lose your mind.\"* Braham's voice cut through Grid's panic. *\"Your **Immortal** passive only lasts five seconds.\"*\n\nFive seconds. More valuable than diamonds, more precious than gold. Grid had to make every instant count.\n\n\"Thank you.\"\n\nBraham's words snapped him back to focus. Grid immediately moved to test his theory.\n\n*Clang! Crack!*\n\nHe stabbed and slashed at the damaged white phosphorus tree, confirming his suspicion—the tree remained impossibly hard, but no explosion followed. The fragments that had fallen earlier sat inert on the ground.\n\n*So it won't explode once damaged. Just like dead wood.*\n\nIf the white phosphorus tree would burn without detonating, it could actually serve as firewood.\n\n*But why would anyone use such rare material for fuel? There must be some special property...*\n\nGrid kept moving, refusing to waste his invulnerability. He activated **Kill**.\n\n*Clang!*\n\n> [The durability of **+9 Failure** has decreased by 6.]\n> [Severe impact detected. Temporary paralysis inflicted.]\n> [You have resisted.]\n> [**Immortal** state is active. No health lost.]\n> [You failed to damage the white phosphorus tree.]\n\n\"Tch. **Kill** doesn't work.\"\n\nThe tree's defense was extraordinary. If even **Kill** couldn't scratch it, he'd need a skill that ignored defense entirely.\n\n\"What about this?\"\n\n*Slash!*\n\nGrid activated **Pinnacle**. **Failure** carved across the trunk.\n\n> [You have damaged the white phosphorus tree.]\n> [The bark of the white phosphorus tree spews flames!]\n\nUnlike **Pinnacle Kill**, **Pinnacle** alone lacked the raw power to completely bypass defense. The tree didn't explode—only a single fragment fell.\n\n*This is better...*\n\n*Whoosh!*\n\nFlames erupted from the scarred bark, distorting the air with their heat. The fire lashed out like fangs, but Grid stood motionless within the inferno. His **Immortal** state absorbed everything.\n\nWhen the flames died down, he stepped back from the now-quiet tree.\n\n\"**Pinnacle** is the only option.\"\n\n**Pinnacle Kill** was too powerful—the resulting explosion created a four-meter blast radius that even he struggled to avoid. But **Pinnacle** alone only triggered a limited flame burst. With the **Slaughterer's Eye Patch** and **Quick Movements**, he could dodge it.\n\n*\"Why not try **Magic Missile**?\"* Braham suggested.\n\nGrid retreated as his **Immortal** duration expired. \"Won't **Magic Missile** just punch through? That's not exactly logging.\"\n\n*\"Aim at the branches. **Pinnacle** only cuts one at a time—**Magic Missile** should be faster.\"*\n\n\"The **Magic Missile** I cast is pathetic, though.\"\n\nHe doubted his version could even scratch the tree, defense-ignoring properties or not.\n\n*\"Try it instead of whining.\"*\n\n\"Fine...\"\n\nGrid targeted the thinnest branch and cast **Magic Missile**.\n\n*Pop!*\n\n\"...\"\n\nAs expected, his **Magic Missile** left no mark whatsoever. Grid grimaced.\n\n\"**Pinnacle** it is.\"\n\nWith a two-minute cooldown, he could harvest one branch every two minutes.\n\n*This will take all day. For twelve percent experience? I'd get better returns farming vampire cities.*\n\nGrid frowned, weighing his options.\n\n*Should I use **Assimilation**?*\n\nBraham's mastery of **Magic Missile** would make short work of this task.\n\n*...But no.*\n\nBorrowing a legendary great magician's power just to chop firewood felt absurd. More importantly, he didn't know what dangers lurked in the East Continent. Burning his trump card on a logging quest seemed reckless.\n\n*\"Grid, can't I help? It's been so long since I've seen the outside—\"*\n\nGrid ignored the plea. \"Now!\"\n\nThe **Pinnacle** cooldown reset. He struck again.\n\n*Slash! Whoosh!*\n\nFlames burst forth as the branch fell. Grid tracked their trajectory with the **Slaughterer's Eye Patch**, but the fire moved too fast.\n\n*Damn it.*\n\nHe activated **Quick Movements**, narrowly dodging the worst of the blast.\n\n\"Whew...\"\n\nGrid retrieved the fallen branch, teeth clenched. A legendary blacksmith and a duke, reduced to struggling with firewood. Tears threatened to fall.\n\n\"This quest is completely twisted. That damn White—\" Grid paused mid-complaint. \"Wait.\"\n\nAn idea struck him.\n\n\"The White Hammer smithy uses iron hammers for iron and mithril hammers for mithril, right?\"\n\nHis thoughts crystallized around a single word.\n\n*Diamond.*\n\nOnly a diamond could cut another diamond. Many things could destroy diamonds, but precision cutting required another diamond.\n\n*What if the white phosphorus tree follows the same principle?*\n\nGrid didn't hesitate. He gathered the scattered fragments and examined them with a blacksmith's eye.\n\n*Forging and tempering are possible. But refining? There must be a preparatory process...*\n\nHe focused, dreaming of growth, refusing to let anxiety cloud his judgment. After several minutes of analysis, Grid smiled.\n\n\"Alright. Let's try it.\"\n\nHe opened his production method list and selected the axe category, pulling up the **Woodcutting Axe** pattern.\n\n> **[Woodcutting Axe]**\n> **Rating:** Normal ~ Legendary\n>\n> An axe optimized for felling trees.\n> Every woodcutter's dream tool.\n>\n> **Conditions of Use:** Woodcutter Level 100+, Beginner Woodcutting Technique Level 7\n\nThis was a matter of pride now. As a legendary blacksmith, he refused to be defeated by firewood. Grid's eyes blazed with determination as he retrieved his portable furnace.\n\n*\"Whatever you're planning, summon the Overgeared Skeletons regularly,\"* Braham advised.\n\n\"Why those trash mobs?\"\n\n*\"By observing you, they might learn new skills or magic.\"*\n\nGrid's eyes widened. \"What? The skeletons can *learn*?\"\n\nIf that were true, necromancers were beyond broken.\n\n*\"No, common skeletons lack that capacity. But your Overgeared Skeletons possess intelligence. They're recognized as unique entities and can be resummoned after destruction—similar to death knights or liches.\"*\n\n\"Their intelligence is in the single digits...\"\n\n*\"Just try it. They might pick up low-level skills or magic.\"*\n\n\"Hmm... I suppose it costs me nothing. Even trash can be useful with the right abilities.\"\n\nGrid had overlooked one crucial detail: Braham considered most abilities in existence to be \"low-level.\"\n\n---\n\n**White Hammer Smithy**\n\n\"Damn it! This won't work! I need more heat!\"\n\nWhite and his nine blacksmiths worked in frustrated desperation. Every year, Pangea's lord held a blacksmithing competition—the winner would supply the army's equipment for the entire year. For five years, the White Hammer smithy had fallen short, their craftsmanship trailing behind the other major forges.\n\n\"Looking at the final product's stats, we have no chance this year...\"\n\n\"We haven't won since Master died five years ago...\"\n\nThe White Hammer blacksmiths' true mentor had been White's father, Dawhite. Since his death, the smithy had declined steadily. Some whispered they no longer deserved to be counted among the Four Great Smithies.\n\nDespite White's best efforts.\n\nWhite trembled with suppressed emotion.\n\n*It's my fault. I didn't heed Father's teachings. I neglected the bellows.*\n\nWhite had believed forging technique determined quality. As heir to the White Hammer legacy, he'd focused obsessively on hammer work, ignoring the bellows. In his arrogance, he'd failed to understand that a single degree difference in flame temperature could dramatically affect an item's final performance.\n\n\"The flames... if only I could make them hotter...\"\n\nWhite and his blacksmiths bowed their heads in defeat.\n\n\"I've come to deliver firewood.\"\n\nEvery head snapped up.\n\n\"Firewood?\"\n\nThe blacksmiths exchanged confused glances.\n\n\"We already took delivery at dawn. What's this about?\"\n\nThe black-haired stranger wasn't one of their regular woodcutters.\n\nBut White's reaction eclipsed everyone else's confusion.\n\n\"Firewood... you brought it?\"\n\nWhite looked more shocked than the day he'd discovered his wife's affair."
}