{
  "id": 515,
  "title": "Chapter 515",
  "content": "**[Daoist Woodcutting Axe]**\n**Rating:** Legendary  \n**Durability:** 1,000/1,000 **Attack Power:** 310  \n* Emits strong flames every time durability is lost.  \n* Easily cuts the white phosphorus tree.  \n* Influences the flames of the white phosphorus tree.  \n\n*An axe resembling those used by the daoists in Shangri-La.*\n\n*It originally is something that can't exist in the human world, but Legendary Blacksmith Grid broke the rules by producing it. There was no malice, nor was it a fluke. This is the result of Grid devising the ideal form and is purely from his abilities.*\n\n*The Daoist Axe produced by Grid has a much better effect than usual daoist axes.*\n\n**Conditions of Use:** Daoist  \n**Weight:** 410\n\n> [A legendary rated item was produced, so all stats have permanently risen by **+10** and reputation throughout the continent has risen by **+500**.]\n\n> [There is a beneficial effect from producing the highest quality. The **good luck stat** has increased by **5**.]\n\nA special legendary item—the system had even attached a 'beneficial effect' notification. Grid's chest swelled with satisfaction. He'd felt lacking in intelligence and good luck for so long. This was like rain after a drought.\n\n\"Sixteen good luck! *Nice!*\"\n\nOf all the special stats, good luck was the hardest to raise. Stat points couldn't be distributed to it directly, and 'beneficial effects' triggered purely at random. Even title bonuses didn't apply to it. Now, in one stroke, his good luck had jumped by fifteen points—from one to sixteen.\n\n\"Amazing... This is *really* amazing.\"\n\nWhat if he could keep raising it like this?\n\n*There'll be a day when I have a 100% chance of making legendary items!*\n\nIt would be like winning the lottery jackpot every single time. Grid was already counting his chickens before they hatched, grinning as he ran his fingers along the axe's smooth surface.\n\n\"This is really, *really* well made.\"\n\nAn axe crafted entirely from white phosphorus wood—from the handle to the blade itself. He'd hesitated for a moment about using the white phosphorus wood for the handle, but it had been the right choice.\n\n*I learned so much as soon as I came to the East Continent.*\n\nHe'd learned how to exploit the properties of minerals from the White Hammer smithy, and White's quest had taught him about the existence and characteristics of the white phosphorus tree. In retrospect, White wasn't a bad person at all.\n\n*He was giving me a trial. Maybe he instinctively recognized my skill from the beginning.*\n\nGrid felt ashamed for cursing White all day.\n\n*Of course. There are no blacksmiths who are bad people. He's as good as Khan.*\n\nWhatever the process, the result was excellent. During the ordeal, Grid's dislike for White had transformed into genuine respect. It was easy to be magnanimous when things worked out.\n\n*Lululala~*\n\nHumming cheerfully, Grid finished chopping the firewood and made his way back to the White Hammer smithy. He pushed through the entrance with a broad smile.\n\n\"I've come to deliver firewood!\"\n\nWhy was Grid so excited?\n\n> [A special thing has happened after making the 20th legendary item!]\n\nThat short notification had appeared the moment he'd produced the white phosphorus axe. It was the biggest reason behind his soaring mood.\n\n***\n\n*Who?*\n\nThe black-haired man delivering firewood. White didn't recognize him at first. As the owner of one of Pangea's four great smithies, he couldn't possibly remember every wanderer who passed through.\n\n*When did I see him?*\n\nThose wild eyes, intense as a hawk's. White had seen them somewhere before.\n\n*Ah!*\n\nWhite stared at the black-haired man in silence, then started. This morning. Someone who'd dreamed of becoming a blacksmith but lacked any knowledge—he'd left to cut down the white phosphorus tree. This young man was that very person.\n\n*What?*\n\nHe couldn't have actually cut down the white phosphorus tree, could he? White nearly laughed at the absurdity.\n\n*That's impossible.*\n\nThe white phosphorus tree was as hard as dragon iron. *Cut it down?* Impossible, unless the best warriors in the Hwan Kingdom assembled. There was a reason thousand-year-old white phosphorus trees still stood.\n\n\"You're the friend from this morning.\" White's voice carried a hint of amusement. \"You're aware I don't want ordinary firewood, right?\"\n\n\"Of course. I'm well aware.\" Grid beamed. \"This is *very* remarkable firewood.\"\n\nWhite thought it was ridiculous.\n\n\"Yes, it isn't firewood that anyone can obtain.\"\n\n*So he's saying he came to deliver firewood?*\n\nWhite's eyes narrowed. *Did this man paint oak wood white?*\n\nHe wouldn't be deceived by such a cheap trick. Grid grinned at White and raised a thumb.\n\n\"Amazing. Did you see my skills with one glance and give me a hard task? You knew it from the beginning—I'm able to chop down the white phosphorus tree.\"\n\n\"...?\"\n\nWhite couldn't parse this nonsense. They were talking face-to-face, but somehow couldn't establish communication. White remained in the shade, only his dark skin visible in the dim light. Grid pulled out the white phosphorus wood.\n\n\"I learned many things thanks to you. Here.\" He held it out. \"It's what you requested.\"\n\n*This isn't an ordinary trickster.*\n\nThis was a classic con artist's technique—use ambiguous or distracting words to lower a person's guard.\n\n*Hmm. It won't work on me.*\n\nWhite had never trusted anyone since his wife's betrayal. Convinced that Grid was a scammer, he examined the firewood with suspicious eyes.\n\n*Trying to trick me by painting oak wood white... Huh? *Huooook!*\n\nWhite's face darkened. He stared at the firewood with disbelief, then began sorting through the pieces one by one. With each examination, his shock deepened.\n\n*T-This is really white phosphorus wood?*\n\nHe was certain. There was no doubt. And that meant—\n\n*H-He really cut down the white phosphorus tree?*\n\nThe white phosphorus tree wasn't difficult to cut down merely because of its hardness. The tree's nature was to emit flames the instant it was wounded. Even if someone managed to cut through it, death awaited them in a wall of fire.\n\nObtaining firewood from a living white phosphorus tree should be impossible. Yet this black-haired youth standing before White—to be honest, White hadn't even caught his name—this unknown young man had done exactly that.\n\n*...It can't be!*\n\nThe astonished White arrived at a conclusion. Perhaps this man before him...\n\n*A legendary woodcutter!*\n\nOne who could handle golden and silver axes!\n\n*Once a person reaches the peak in one field, they become a daoist! Is this a daoist who's about to ascend to Shangri-La?*\n\nYes, it was White's own mistake to think this young man was interested in becoming an apprentice blacksmith. In reality, he wasn't a blacksmith at all, but a great woodcutter.\n\n*Ahh...! Who knew my smithy would have such a person helping us?*\n\nPerhaps his father had made a deal with this person to aid the White Hammer smithy. He must have remembered the old ties and rushed over.\n\n\"Thank you! I really appreciate it!\"\n\nCaught in a grand misunderstanding, White bowed deeply to Grid. \n\nGrid's expression stiffened at the sudden bow.\n\n\"...Thanking me like this—does that mean you didn't expect it?\" His eyes narrowed dangerously. \"Don't tell me you're trying to *decrease the value*?\"\n\nGrid's voice dropped low as he spoke, heavy with threat. The implication was clear: what would happen if White tried to shortchange him on the reward?\n\n*Ohh! This pressure!* \n\nWhite felt a thrill run through him as he looked at Grid. \n\n*This is really a daoist. In fact, he doesn't need a reward. But I'll feel burdened if he helps me without receiving anything in return.*\n\nThe heart was like the sea—deep and unfathomable. White felt genuinely moved.\n\n\"No way. Of course I'll give the appropriate rewards.\"\n\n*Ttiring~*\n\nA notification window flashed before Grid's eyes.\n\n> [The quest difficulty of 'Chop Firewood!' has been revealed.]  \n> [The quest difficulty of 'Chop Firewood!' is **SS+**.]  \n> [The clearance compensation for Chop Firewood! has changed.]  \n> [The character experience and experience of all skills will increase by **40%**.]  \n> [**Legendary Blacksmith's Breath** is now **Lv. 7**.]  \n> [**Blacksmith's Rage** is now **Lv. 7**.]  \n> [The level of **Pagma's Swordsmanship, Link**, is now **Lv. 8**.]  \n> [The level of **Pagma's Swordsmanship, Kill**, is now **Lv. 7**.]  \n> [The level of **Pagma's Swordsmanship, Wave**, is now **Lv. 6**.]  \n> [The level of **Pagma's Swordsmanship, Pinnacle**, is now **Lv. 6**.]  \n> [The level of **Pagma's Swordsmanship, Restraint**, is now **Lv. 4**.]  \n> [The level of **Pagma's Swordsmanship, Transcend**, is now **Lv. 4**.]  \n> [The affinity with White, the master of the White Hammer smithy, has reached the **peak**!]  \n> [In the future, you can buy all items in the White Hammer smithy at a **20% cheaper price**. The goods you sell will be bought for a **20% higher price**.]\n\n\"...Wow.\"\n\nThe quest had been truly difficult. An **SS+** quest—that confirmed it.\n\n*No, wait... what would constitute an SSS quest?*\n\nGrid suspected he was probably the only player capable of clearing the white phosphorus tree logging quest. One out of two billion users. Considering that difficulty, forty percent character experience and skill experience felt... insufficient. At the very least, he should have gained a full level. Grid felt a twinge of regret.\n\nWhite looked at him and asked carefully, \"Perhaps... What is your name?\"\n\n\"...\" This man didn't even know his name? \"Grid.\"\n\nGrid replied with an incredulous expression. White seized both his hands.\n\n\"Do you know about the famous battlegear production competition of Pangea?\"\n\n*Battlegear production competition?*\n\nGrid didn't know. Before he could answer, White shouted enthusiastically.\n\n\"Grid! Please come watch the competition! In order to repay your hard work, the White Hammer smithy will *definitely* win this year!\"\n\n\"Oh...\"\n\nGrid's mouth curved upward. He couldn't resist an opportunity to observe the skills of the East Continent's blacksmiths.\n\n\"When is the competition?\"\n\n\"In three days.\"\n\n*Okay.*\n\nHe could spend three days adjusting to the hunting grounds near Pangea and return with loot to sell. Grid made his decision and nodded.\n\n\"I understand. I'll expect to see something good in three days.\""
}