{
  "id": 516,
  "title": "Chapter 516",
  "content": "\"Then I'm going.\"\n\nGrid stepped out of the smithy and immediately pulled up his menu. He set an alarm for three days from now. The battlegear production competition. He couldn't afford to miss it.\n\n*I have to be there.*\n\nWhite had mentioned the blacksmiths competing possessed genuine skill.\n\n*Black Anvil specializes in tanning. Red Tongs in quenching. Blue Flames in furnace work.*\n\nJust like White Hammer's mastery of forging.\n\n*This is a chance to learn.*\n\nGrid had inherited Pagma's techniques, but his practical experience remained shallow. These Eastern blacksmiths had spent decades refining their craft. He expected to absorb something valuable from watching them work.\n\n*Legendary class or not, I can't get complacent.*\n\nThe thought warmed him. He would humble himself before lesser talents if it meant climbing higher. His chest swelled as he strode through the streets with exaggerated confidence.\n\n\"Hmm?\"\n\nGrid had received information about a monster community north of Pangea. He'd been heading toward the north gate when a familiar name stopped him cold.\n\n\"Try it once! Just one bite of our orc cream pie will have your juices flowing!\" The vendor's voice cut through the street noise. \"The combination of fragrant orc fat and refreshing cream is perfect! It's a dish that Pangea's little hero, Kraugel, admired for being delicious!\"\n\n*Kraugel? Pangea's little hero?*\n\nThe same Kraugel Grid knew?\n\n*Of course it is.*\n\nKraugel was ranked first for a reason. The man created a sensation wherever he went. His strength, his leveling speed, his quest completion rate. All of it legendary.\n\n\"His name echoes through every village and city he visits...\"\n\nIt wasn't just player gossip either. Grid's smile turned bitter as he approached the middle-aged chef.\n\n\"One orc cream pie.\"\n\nHe was curious what had earned Kraugel's praise. More than that, he wanted to understand what the man had accomplished here.\n\n*Why 'little hero'?*\n\nGrid paid a silver coin without thinking too hard about the 'orc' prefix. He assumed it was just a name. The pie appeared at the counter. Orange cream filling, golden crust. The pastry looked crisp on the outside, the interior moist.\n\n\"Ohu.\"\n\nGrid thought one silver was reasonable as he took a bite. His face twisted.\n\n*A dog wouldn't eat this.*\n\nThe cream tasted sour, like vinegar. It lacked any hint of fruit. The texture was grainy and stuck to his tongue. The meat inside was tough and rubbery. Crisp outside, moist inside? More like burnt outside, poison inside.\n\n*How is this food?*\n\nThe oxygen consumed by this chef was wasted. The chef approached with an eager expression.\n\n\"How is it? Delicious?\"\n\n\"...\"\n\nWas he serious? Grid kept his mouth shut. The chef, Idan, continued without shame. \"Did you know Kraugel ate four of these pies? They are really delicious!\"\n\n\"Is that true?\"\n\n\"Yes, hundreds of people witnessed it.\"\n\n\"Crazy...\"\n\nGrid felt a flash of sympathy. What kind of tasteless food had Kraugel grown up eating that he'd praise this garbage? Grid turned back to Idan. He'd lost a silver. He intended to extract every scrap of value from this interaction.\n\n\"Who is Kraugel? What did he do to be called a little hero?\"\n\n\"Ah, you're an outsider.\" Idan nodded knowingly. \"I could tell you didn't recognize the quality of my pie.\"\n\n*I recognize it.*\n\nGrid bit down on the words before they could escape.\n\n\"Pangea was originally a rich and peaceful city for hundreds of years. But two years ago, that peace ended. Our great lord fell ill and his aide, Arube, was appointed as temporary lord.\"\n\n\"Then Arube was corrupt and Kraugel defeated him?\"\n\n\"Hat... Hum hum, similar but different.\" Idan raised a hand. \"Excuse me, this person. Please listen to everything I have to say first. I want to talk.\"\n\nIdan clearly had a lot to say.\n\n\"Anyway, the story is as you predicted until the middle. Arube, who was famous for his good behavior, became a tyrant after his appointment. He came out from time to time to harass women, took land from farmers using flimsy excuses, and raised taxes.\"\n\nToo obvious. Grid's attention drifted until Idan's story took a turn.\n\n\"One day, monsters started to infest the areas near Pangea. Pangea, where monsters had never appeared for hundreds of years!\"\n\n\"The monster habitat in the north?\"\n\n\"Right, right. They were terrifying. The monsters moved systematically like an army and dealt tremendous damage to Pangea. People grumbled and hated the monsters that seemed to fall from the sky. We couldn't resist them and were trampled helplessly.\"\n\n\"Then Kraugel appeared?\"\n\n\"Yes! Our little hero appeared! As if he fell from the sky, he appeared and took down one or two monsters.\"\n\n*One or two? The sky above the sky?*\n\nGrid had expected something more dramatic. The story seemed oddly understated.\n\n*Usually heroic tales are exaggerated... Ah.*\n\nUnderstanding clicked into place.\n\n*The monsters on the East Continent are extremely strong.*\n\nThe monsters that invaded Pangea. Even Kraugel could barely handle one or two at a time. That's what the chef was saying.\n\n\"Despite Kraugel's presence, Pangea couldn't escape the crisis. The monsters were too strong. The cavalry and strategies that Pangea is proud of didn't work...\" Idan's voice dropped. \"Yes, it was like someone was directing them to attack Pangea.\"\n\n\"Arube?\"\n\n\"Huh?\" Idan blinked with admiration. \"How are you able to infer the story so easily and accurately? Are you perhaps a detective? Can you find the puppy that disappeared from my house?\"\n\n\"...\"\n\nThis was exhausting. Grid remained silent until Idan returned to the point.\n\n\"Yes, the monsters were controlled by Arube. More than 2,000 monsters controlled by one person. Isn't it truly amazing? Arube was just an ordinary civilian before this!\"\n\n\"Wow. Amazing.\"\n\nThe story was so predictable it hurt. Grid felt irritated. He'd eaten terrible food and wasted time for this.\n\n\"In fact, there was a reversal here. Arube wasn't Arube. It was a wicked daoist who killed Arube, disguised himself, and then tried to destroy Pangea.\"\n\n*Finally, the actual story.*\n\nAt least things were clearer now. The daoist priests of the East Continent operated on a completely different level than Western magicians.\n\n*A legendary great magician wouldn't be able to control 2,000 monsters like that, right?*\n\n*Correct. Impossible even for a taming master. Not all of them are strong, but remain vigilant.*\n\n*Got it.*\n\nGrid rose from his seat after Braham's answer. Idan blocked his path.\n\n\"That's why. Find traces of the great hero who helped kill the evil daoist priest that the little hero Kraugel couldn't defeat alone.\"\n\nA quest? Grid had barely formed the thought when a window materialized.\n\n> **[Find the Traces of the Great Hero!]**\n>\n> **Difficulty: A**\n>\n> The evil daoist priest revealed his identity. The small hero Kraugel fought with him and tasted despair. Pangea seemed to be on the verge of destruction.\n>\n> But then a mysterious hero appeared. Later, the people of Pangea praised him as the great hero. The hero instantly defeated the evil daoist priest and saved Pangea from the crisis, but he didn't disclose his identity and left. This made the residents of Pangea feel sorry. They have a strong desire to find the great hero and give thanks.\n>\n> In particular, chef Idan has a duty to find the great hero. It is to regain the frying pan that was passed down through the family's chefs for generations.\n>\n> **Quest Clear Conditions:** Find the frying pan somewhere in the monster community.\n>\n> **Quest Clear Reward:** Free lifetime use of Idan's restaurant. 30% character experience.\n>\n> **Quest Failure:** Idan, who is famous for his mouth, will talk about your faults all over Pangea.\n\n\"The place where the great hero was last seen was the north! But it has long been famous for wild beasts and since the monsters arrived, it's hard for me to head there directly.\" Idan gestured dramatically. \"Please find the great hero's trail and get my frying pan back!\"\n\n\"...Ah.\"\n\nIt wasn't a bad quest. Grid planned to hunt in the north anyway. Finding a frying pan while grinding experience seemed reasonable. If he succeeded, he'd receive 30% experience for free. The only disagreeable part was the lifetime pass to Idan's restaurant.\n\n*I don't have to actually eat there, so there's no reason to refuse.*\n\nGrid nodded.\n\n\"I understand. It's very hard, dangerous, and troublesome, but I will do my best.\" He paused. \"But I have one question. What is the correlation between the great hero and the frying pan?\"\n\nIdan gritted his teeth.\n\n\"When he appeared... I was cooking in the kitchen and ran out onto the street with my frying pan. Then I bumped into that hero. He took my frying pan and beat the evil daoist priest with it.\"\n\n\"...He beat the daoist priest with a frying pan?\"\n\n\"Yes! It was incredible when the hero struck him with my frying pan! Wonderful and invigorating!\" Idan's expression soured. \"But what? He left without returning what he borrowed! He left with my frying pan!\"\n\n\"...\"\n\n\"For a chef, a frying pan is like the soul! It's like that hero stole my soul! Then he threw it away somewhere without a thought!\"\n\nToo many words. Just listening to the high-pitched voice was exhausting. Grid quickly left the restaurant and headed straight for the north gate."
}