{
  "id": 518,
  "title": "Chapter 518",
  "content": "> [You have defeated a big poisonous rat.]\n> [35,970,411 experience has been acquired.]\n> [A big poisonous rat's gallbladder has been acquired.]\n> [The big poisonous rat's leather has been acquired.]\n\n> [You have defeated a male big poisonous rat.]\n> [21,899,050 experience has been acquired.]\n\nGrid wiped the blood from his blade. The \"hamsters,\" as he'd taken to calling them, clustered near the starter village like vermin. Bottom-feeders in the food chain, probably. Yet the experience they provided was obscene. The females gave seven times what junior vampires offered, five times that of intermediate vampires, and triple the yield of senior vampires.\n\n*Only the males have the gender label. Less experience, too.* Grid studied the corpses. *Matriarchal society?*\n\nEven calling it \"less\" was a joke. The males still paid out double what a senior vampire was worth.\n\n*Kraugel hunted these things before his third advancement.* Grid's jaw tightened. *Even slowly, he managed it.*\n\nIf the rats didn't have that poisoning and confusion breath, Grid would chalk it up to pure skill. Kraugel's technique could overcome raw physical advantages. But the abnormal states were the real problem.\n\n*How did he handle the debuffs?*\n\nDetoxification potions had a ten-second cooldown. Confusion? No potion existed for that. Meanwhile, these things spewed their toxic breath constantly throughout combat.\n\n*Status resistance accessories, maybe.* Grid frowned. *But would he have had those back then?*\n\nA absurd thought crossed his mind. *Did he just... block his nose?*\n\nGrid pinched his nostrils shut experimentally. The stench still wormed its way through, thick and putrid in the back of his throat.\n\n\"Ugh.\"\n\nHe staggered out of the tent, stomach churning. Braham's presence stirred in the back of his mind, radiating smug contempt.\n\n'Did you forget what the chef of Pangea said? The monster community formed here after Pangea was invaded.'\n\nGrid spat to clear the taste from his mouth.\n\n'The rats were likely defeated during the invasion and settled here afterwards,' Braham continued. 'They weren't born near the village. Don't assume these big poisonous rats are the weakest monsters on the East Continent.'\n\n\"Yeah... you're right.\"\n\nThe logic tracked. Thirty-one people had reached the East Continent in three years since Satisfy's launch. The content here had to be leagues above the West Continent. But Satisfy valued balance. If the continents ever opened trade routes, the gap couldn't be insurmountable.\n\n*These hamsters can't be the baseline.* Grid straightened. *If they were, it would mean every soldier on this continent could match them. That makes no sense.*\n\n\"Whatever.\" He rolled his shoulders. \"I came here to beat them. That's all that matters.\"\n\nGrid pulled up the item descriptions.\n\n---\n\n**[Big Poisonous Rat's Gallbladder]**\nA gallbladder filled with poison.\n\nUpon consumption, inflicts poisoning for 10 minutes and triggers multiple debuffs.\nHowever, permanently increases poisoning and confusion tolerance by **0.03%** afterwards.\n\nWeight: 1\n\n---\n\n**[Big Poisonous Rat's Leather]**\nSmelly and tough leather.\n\nDifficult to use due to the persistent odor.\n\nWeight: 30\n\n---\n\n\"Wow.\"\n\nGrid's eyes widened. He'd never seen an item that permanently boosted resistance to abnormal states before.\n\n*Rich players will pay through the nose for these gallbladders.*\n\nHis status condition immunity made resistance items worthless to him. But for the other two billion users? Status effects were an eternal problem. Everyone needed to raise their resistances.\n\n*This would fetch at least a million won.* Grid closed the item window. *But I'm not listing it.*\n\nPutting it on the auction house meant strengthening potential rivals. Better to keep it in-house.\n\n*Stockpile them. Sell to guild members only.*\n\nNot for free, of course. Grid approached another tent and peered inside. Two more hamsters, curled together in sleep.\n\n\"Another couple?\"\n\nComplex emotions churned in his chest. *Do I have to hunt couples every time?*\n\nHe was destroying families. Grid hesitated, then shook his head. NPCs deserved consideration. Monsters? That way lay madness.\n\nHe steeled himself and split the +7 Sword Ghost into its twin forms. The blade separated into a longsword and shortsword with a metallic whisper. Grid activated Pagma's Swordsmanship, Transcend. His arms blurred.\n\n**Peng!**\n\n**Pepepepeong!**\n\nEnergy blades erupted from the longsword, each strike heavy with destructive force. The shortsword's projections were smaller, stealthier. Grid bombarded the tent without creating much disturbance. The surrounding hamsters slept on, oblivious.\n\n\"Muoong! It hurts!\"\n\n\"Human! Kill! Muong!\"\n\nThe couple woke to carnage, their nest shredded around them. Rage contorted their features. They snatched up tridents and charged.\n\nThey didn't make it far. The God Hands materialized, four golden constructs wielding Mjolnir.\n\n**Peok!**\n\n**Peok peok peok!**\n\n\"Muong! Muong! Muong!\"\n\nThe hammers struck in perfect alternation, left to right, an endless chain of impacts. The hamsters locked into infinite stiffness, bodies jerking with each blow. Their health bars plummeted. Grid stepped in for the killing strikes.\n\n> [You have defeated a big poisonous rat.]\n> [33,842,391 experience has been acquired.]\n> [A big poisonous rat's gallbladder has been acquired.]\n\n\"The drop rate is surprisingly high.\"\n\nGrid paused. No, that was wrong. An item granting permanent resistance increases couldn't have a high drop rate. It defied game balance.\n\n\"Not high drop rate.\" He nodded to himself. \"Just my **Good Luck** stat at work.\"\n\nSixteen points. Grid placed enormous significance on those sixteen points. Objectively, it meant nothing. Jude had twenty intelligence, and look how that turned out. But Grid couldn't help the warm feeling in his chest. Good luck. After years of having none, he'd finally earned some.\n\n\"The hunting pattern is simple enough.\" Grid moved toward the next tent. \"Stun them with the God Hands while they sleep, then finish it. Easy.\"\n\nThe wide spacing between tents played in his favor. As long as he didn't make too much noise, he'd be fine. Grid smiled with grim satisfaction as he located the next couple.\n\nAnd the next.\n\nAnd the next.\n\n*Dammit.*\n\nGrid's hands stilled as the dying hamsters reached for each other, paws intertwining in their final moments. This was brutal work. If a title existed for \"Couple Slaughterer,\" he'd probably earned it by now.\n\n'Are you feeling compassion for creatures?' Braham's voice dripped with scorn. 'That is a severe weakness.'\n\n\"They look cute, don't they?\" Grid's voice came out rougher than intended. \"Loving each other like that. Monster or not.\"\n\nHe didn't understand why the game forced him to hunt couples specifically. Some psychopath on the development team had a twisted sense of humor.\n\n\"Alright. Outskirts cleared.\"\n\nFive hundred tents sprawled across the area, packed with hamsters. He'd worked the perimeter methodically, tent by tent. Now he pressed deeper. The circular formation meant the tents grew denser toward the center. One mistake and he'd aggro four rats at once.\n\n\"Not the worst problem to have.\"\n\nThe hamsters gave experience comparable to true blood vampires, but their overall combat ability fell short. True bloods varied by level, of course. Grid was thinking of the average ones. And if true bloods weren't a threat, then multiple vampires simultaneously weren't an issue either.\n\n\"I need to thin their numbers before nap time ends.\" Grid flexed his fingers. \"Time to get serious.\"\n\n**Suuuk.**\n\nFour golden hands materialized behind him. Grid felt the mana regeneration rate increase, fifty percent faster than normal. He gestured.\n\n\"Fire.\"\n\n**Pepepepeok!**\n\nMagic Missiles rained down on the sleeping hamsters.\n\n**Taack!**\n\nGrid charged with the God Hands flanking him. The hamsters scrambled to defend, to counterattack. The synergy between God Hands and Mjolnirs crushed their efforts.\n\n\"Revolve.\"\n\n**Jjeejeeeong!**\n\nThe vampire cities had honed Grid's combat efficiency. Rather than using the God Hands purely for defense, he handled enemy attacks directly while the constructs swung Mjolnir in continuous assault. Once the target entered stiffness?\n\n\"Linked Kill.\"\n\n**Puok! Puk! Puk puk!**\n\nExecution.\n\n\"Good.\"\n\nFour hamsters down. Two couples erased. Grid moved through the wreckage, collecting drops with practiced ease.\n\n\"Hm?\"\n\nSomething caught his eye in the corner of the tent. Familiar. Jarringly modern. A frying pan.\n\nGrid blinked. He picked it up and pulled up the item information.\n\n\"You've got to be kidding me...\""
}