{
  "id": 52,
  "title": "Chapter 52",
  "content": "# Chapter 52\n\nThe letter's contents might as well have been written in a foreign language. Grid stared at the parchment, his brain refusing to process the words. \"Where is Rabbit now?\"\n\nKhan's voice was careful. \"Earl Steim sentenced him to ten years in prison.\"\n\n\"What?\" Grid's head snapped up. \"Why? Rabbit *saved* Winston.\"\n\n\"He did.\" Khan's weathered hands folded together. \"But the crisis existed because of the Mero Company in the first place. The Earl believes that repentance alone cannot wash away such sins.\"\n\nThe room tilted. Grid's carefully constructed plans—the promises, the future wealth—crumbled like sand.\n\n\"Shit.\" He pressed his palms against his eyes. *That bastard. He said he'd make me rich. Now he's rotting in a cell?*\n\nKhan's hand settled on Grid's shoulder, the touch gentle. \"I understand your sadness. Seeing the man who rescued you now imprisoned must be difficult. But you survived. That's what matters.\"\n\nGrid lowered his hands. \"No, I—\" He caught himself. *I don't actually care about Rabbit. I care about the money.* \"I mean, I heard you were arrested too. Are you alright?\"\n\nThe old man's eyes crinkled. \"You're worried about me? Even after being framed, insulted, dragged through the mud?\" He shook his head, a tremor running through his voice. \"Your heart truly is vast.\"\n\nBefore Grid could respond, Khan's face crumpled. Tears welled up, spilling down weathered cheeks. \"I heard what happened in the interrogation room. Surrounded by knights, your mouth gagged, and still you refused to betray me.\"\n\n*Oh.* The memory surfaced—the cloth stuffed between his teeth, the knights demanding answers. Grid had *tried* to give up Khan as Huroi's patron. The gag had made speech impossible.\n\n\"Well...\" Grid scratched his neck. \"I couldn't exactly sell you out.\"\n\n\"Even under torture!\" Khan grabbed Grid's hands. \"Grid, I've made my decision. I'm entrusting everything to you.\"\n\n\"What?\"\n\n\"This smithy.\"\n\nThe words hung in the air. Grid's mouth opened, closed. *No. He can't mean—*\n\n\"Hold on. What?\"\n\nKhan's smile was radiant despite the tears. \"From the moment you disguised yourself as my successor to fight the Mero Company, I knew. You are my true heir. This smithy—it will be yours.\"\n\n\"You're joking.\" Grid's voice came out flat. He'd heard of users receiving positions, titles, honorary ranks. But inheriting a *business*? Ownership of property? \"That's impossible.\"\n\n\"Have I ever lied to you?\" Khan gestured around the workshop. \"I have no children left. Soon, I'll be too old to lift a hammer. Would you have this place, seven generations of my family's legacy, simply vanish?\" He gripped Grid's shoulders. \"You are Pagma's Descendant. You have a good heart. My ancestors would rejoice. And my son... my son is dead.\"\n\nThe light faded from Khan's face. The grief was real, raw, and it clawed at something in Grid's chest.\n\nBut Grid was a debt-ridden bastard with trust issues.\n\n\"Prove it.\" He met Khan's eyes. \"Write a contract. Legally binding. Then I'll believe you.\"\n\n\"...\"\n\nKhan's gaze held steady for a long moment. Then, slowly, he nodded.\n\n---\n\nFive minutes later, Grid held a parchment stamped with Khan's seal. The system chimed.\n\n> **[You have obtained the position 'Smithy's Successor']**\n> \n> **[Smithy's Successor]**  \n> You possess the same authority as the owner within Khan's Smithy.\n\nGrid pinched his cheek. Hard. The sting shot through his face, sharp and undeniable.\n\n*Not a dream.*\n\n\"This is real.\" His voice cracked. \"This is actually—HAHAHA! Yes! YESSS!\" He spun in place, arms thrust skyward. \"Holy shit, I own a building! A two-story building in a fantasy world, but still!\"\n\nKhan watched the display with paternal affection. \"I'm glad you're happy. You'll lead this smithy to greatness.\"\n\n\"Damn right I will.\" Grid's grin could have split his face. \"Let's get to work. We're going to make items so good that people will *beg* to shop here.\"\n\n\"That's the spirit!\"\n\nFor the next week, Grid became a machine. Morning to afternoon—labor jobs in the real world. Night until dawn—Satisfy, hammering metal until his arms ached. Four hours of sleep. Repeat.\n\n\"I'm basically a corporate slave again,\" he muttered during a particularly brutal foundation-digging shift. \"Except now I enslave myself. Voluntarily.\"\n\nBut the money accumulated. The stats ticked upward. **Dexterity**, **Stamina**, **Strength**—all rising with each item crafted, each stone hauled.\n\nIt hurt. He endured.\n\n---\n\n**[Tzedakah Guild Chat]**\n\nThe Tzedakah Guild fielded only seventeen members. Seventeen elites scattered across the rankings, bound together by shared history and Jishuka's iron will.\n\nJishuka opened the auction house interface for the hundredth time that week. The obsession had started two months ago with a single purchase: **Special Jaffa Arrows**. \n\nNinety-nine arrows. Double the power of standard jaffa ammunition, with a chance to ignore defense entirely. She'd burned through them in three days, exhilarating in the way they punched through armor like paper.\n\nThen... nothing. The mysterious blacksmith never listed more.\n\n*Why only ninety-nine?* Blacksmiths produced in bulk—hundreds, thousands of arrows at a time. So where were the rest?\n\n*Another guild got to them first.* The thought made her jaw clench. *Someone's monopolizing the supply.*\n\n\"It's Jishuka!\"\n\n\"God, look at that body.\"\n\n\"Think she'd go out with me?\"\n\n\"Dude, she'd break you in half.\"\n\nThe auction house crowd thickened. Men—always men—pressed closer, eyes roving over her tanned skin and curves. Jishuka's half-lidded gaze swept across them, cold as winter.\n\n\"Move.\"\n\nThe word dropped like a stone. The crowd parted.\n\nShe activated the guild chat once she'd escaped to a side street.\n\n**{If you don't find that blacksmith within a month, you're all going into hell training.}** - Jishuka\n\n**{Ohh! I volunteer!}** - Regas\n\n**{Regas, shut up. You don't know what you're asking for.}** - Pon\n\n**{Captain, be realistic. Do you know how many users play Satisfy? Finding one blacksmith with no name, no location? Impossible.}** - Vantner\n\n**{Can't be done.}** - Zednos\n\n**{...I have to agree...}** - Faker\n\nJishuka's fingers tightened around her phone.\n\n**{We're seventeen people. Elites. We don't have the luxury of numbers, so we need quality. We need better gear than everyone else to stay on top. That means we NEED this blacksmith. So find them.}**\n\nA pause. Then:\n\n**{Understood, Captain. I'll handle it.}** - Faker\n\n**{Bet time! 100 gold per person, winner takes all!}** - Pon\n\n**{1,600 gold if I win? I'm in!}** - Ibellin\n\nJishuka rarely asked for anything. When she did, it meant the situation was critical. The guild understood.\n\n**{...But I wanted to train...}** - Regas\n\n**{Where are you right now? ^^}** - Jishuka\n\nThe chat went silent.\n\n*Captain used an emoticon.*\n\n*Regas is dead.*\n\n> **[Vantner has logged in.]**\n\n**{Welcome back, sleeping beauty.}** - Pon\n\n**{Seven hours of sleep? Lazy bastard. You'll lose your rank.}** - Zednos\n\n**{I was researching something online. You guys heard about Winston Village?}** - Vantner\n\n**{North of the Eternal Kingdom? Yeah, I passed through once.}** - Ibellin\n\n**{Why?}** - Jishuka\n\n**{There was an item production competition there. One of the contestants made an Epic-rated dagger in three hours.}**\n\nThe chat exploded.\n\n**{A USER made that?!}**\n\n**{That's our blacksmith!}**\n\n**{We found them!}**\n\nJishuka's heart kicked into overdrive. An Epic item in three hours wasn't just rare—it was *unprecedented*. Even Panmir, the first-ranked blacksmith, couldn't manage that.\n\n**{Everyone to Winston. NOW. We focus all efforts there.}** - Jishuka\n\n**{On it!}** - Pon\n\n**{Three days travel for me.}** - Zednos\n\n**{A week.}** - Ibellin\n\n**{Whoever arrives last is getting penalty training. Regas, if you're not there in half a day, I'll kill you myself. ^^}** - Jishuka\n\n**{CAPTAIN! I'm in the Burns Principality! Two days on horseback, minimum!}**\n\n**{Then don't use a horse. Run.}**\n\n**{...Run? For two days straight?}**\n\n**{Half a day. Or I *will* kill you.}**\n\n**{...Yes, ma'am.}**\n\nThe Tzedakah Guild mobilized. Seventeen scattered points on the map began converging toward a single destination.\n\nWinston.\n\n---\n\n*[Glossary of Common Korean Terms]*  \n*OG: Glossary Link*  \n*Current schedule: 20 chapters a week.*\n\n*Check out my Patreon for early access to unedited chapters and to help unlock bonus chapter goals. Early access content updates after daily releases are complete.*"
}