{
  "id": 520,
  "title": "Chapter 520",
  "content": "> **[Assimilation has been used.]**\n> \n> **[You have become one with Braham's soul. Control of your body has been given to Braham.]**\n> \n> **[Your class will be changed from Pagma's Descendant to Legendary Great Magician.]**\n> \n> **[Braham is searching for intelligence related items.]**\n> \n> **[Malacus' Cloak has been equipped.]**\n> \n> **[The Holy Light Crown has been equipped.]**\n> \n> **[There are no wearable items.]**\n\nA chill rippled across Grid's skin.\n\nThe moment Assimilation activated, his angular jaw softened. The sculpted muscle in his shoulders and forearms melted away, replaced by a leaner frame. White hair spilled down beneath the crown, stark against pale skin. Ruby eyes gleamed where brown once sat, creating an aura that was both haunting and beautiful.\n\nBraham had emerged.\n\nThe legendary great magician who was once a vampire laughed, his voice dripping with arrogance. \"I never thought this body would be used to exterminate *rats*. How refreshing.\"\n\nThree seconds into the transformation, Grid's thoughts hammered against the inside of his own skull. *Come on, use magic! Don't waste Assimilation again and screw around!*\n\n\"You're a legend.\" Braham clicked his tongue. \"Don't fret like the other lowly creatures.\"\n\nHe waved his hand. A master level **Magic Missile (Enhanced)** materialized, crackling with compressed mana as it orbited his body. Grid's consciousness reeled.\n\n*How are you doing that?*\n\nMagic Missile launched the instant you cast it. It flew straight to the target. You couldn't just... suspend it in midair. That violated every law Grid understood.\n\nSparks danced around Braham's form. The ball of explosive mana hovered beside him, defying physics. Braham's answer dripped with casual superiority.\n\n\"It's Alarm.\"\n\n*What? Alarm?*\n\n\"Alarm is something that rings without limit,\" Braham said. \"It isn't simply noise.\"\n\n*...?*\n\n\"The Alarm spell rings at specified times and in specified situations. Therefore, Alarm is inherently timer magic. I merely strengthened it.\"\n\n*I don't understand what you're saying. What does that have to do with stopping Magic Missile?*\n\n\"Before casting the magic, I input a command: 'Activate when the alarm rings.' Think of it like the ticking time bombs that dwarves craft.\"\n\n*Ticking time bomb?*\n\nThe example clicked. Grid's understanding crystallized just as a bestial voice shattered the moment.\n\n\"Squeeeak! Human! You dare invade the queen's castle! Squeeeak!\"\n\nThe intermediate boss of the monster community, the Strong Male Rat, charged. Its black eyes locked onto the white-haired magician. Braham let mana swirl around him, utterly unconcerned. The big poisonous rats were clever, yes, but they were a physical species. No magicians. No shamans. The community structure proved it.\n\n\"Squeeaaak!\"\n\nWild-eyed and frothing, the Strong Male Rat closed the distance. Its trident stabbed forward. Braham didn't move.\n\n*Beep. Beep. Beep.*\n\nThe Magic Missile emitted a sharp warning.\n\n*BOOM!*\n\nThe explosion caught the rat mid-lunge. It flew backward without even a scream.\n\n\"Watch.\"\n\nBraham raised his hand. Six Magic Missiles materialized simultaneously around him. The display was a perfect fusion of master level magic and the legendary great magician's passive abilities.\n\n*Bang!*\n\n*BANG! BANG! BANGBANGBANG!*\n\n*Wow...* Grid's thoughts were pure awe.\n\nThe white mana spheres looked like captured moonlight, orbiting Braham's form. They shimmered with an ethereal beauty that Grid, despite having no artistic sense whatsoever, could recognize. He switched to observer mode and snapped a screenshot.\n\n*I should make this my phone wallpaper.*\n\nNot that anyone else would ever see it.\n\n\"G-Grrreeak...! Cowardly human!\"\n\nHow could the Strong Male Rat tolerate such humiliation before the Queen? Shame and fury burned through the creature. It charged again, its speed matching Grid's own. The trident radiated power that exceeded Grid's strength.\n\n*At least level 400?*\n\nThe intermediate boss was terrifyingly strong. Which meant the Queen Rat would be... Grid felt ice crawl down his spine.\n\n*Beep. Beep. Beep.*\n\n*Beepbeepbeepbeepbeep.*\n\nAll six Magic Missiles began their countdown. And then...\n\n*CRACK!*\n\n*CRACKCRACKCRACKCRACK!*\n\nOne pierced the rat's chest. Two slammed into its ribs. One each shattered the elbows. The final missile drilled straight between its eyes with surgical precision. Blood sprayed. The creature collapsed without a sound. Braham's laugh was cold mockery.\n\n\"This is one application of the Alarm spell. Predict when and how the enemy will move. Set the timer. Assign it to an attack spell. Then your magic strikes the enemy at the perfect moment. With minimal mana expenditure, you can replicate the power of the God Hands.\"\n\n*...*\n\nGrid understood the concept. But anticipating an opponent's actions in real time during combat, setting precise timers for Alarm spells, calculating attack trajectories? That was impossible unless you were Braham. The great magician sensed Grid's doubt.\n\n\"There's an easier application.\"\n\n*Thud.*\n\nBraham's boot connected with the rat's ribs, sending it sprawling. He stepped back. Six more Magic Missiles blossomed into existence. Four of them shot forward as the rat scrambled upright.\n\n\"I won't tolerate this anymore! Squeeeak!\"\n\nThe rat's trident swept in a brutal arc.\n\n*BOOM BOOM BOOM BOOM!*\n\nThe powerful strike obliterated all four missiles.\n\n*Hisss.*\n\nThe rat's whiskers twitched with satisfaction. But in the instant it took to swing the trident, the remaining two missiles had already struck. Along with six fresh ones Braham had conjured.\n\n*CRACKCRACKCRACKCRACK!*\n\n\"Squeeeeeak!\"\n\nThe barrage sent the rat tumbling across the chamber floor. Braham shrugged.\n\n\"It's far simpler to exploit the enemy's attacks this way. The effectiveness is quite satisfactory. Alarm magic will serve you well.\"\n\nGrid's current level of Magic Missile was still low. The cooldown was slower than the master version, which meant firing two or more simultaneously was impossible under normal conditions. But with the Alarm spell... Grid could summon multiple Magic Missiles in sequence.\n\n*Keep in mind that Alarm can only be attached to magic itself.* Braham's thoughts filtered through their connection. *The distance is also limited. Particularly at Level 1, the restrictions are severe. Well, you'll discover the nuances through practice.*\n\n*Doesn't the description say I can use it anywhere?*\n\n\"That describes the magic itself. Once learned, the level-specific details will clarify.\"\n\n*Um...*\n\nCould he really master this? Braham offered encouragement to the uncertain Grid.\n\n\"In truth, exploiting Alarm is quite simple.\"\n\n\"Squeeeeeak!\"\n\nThe battered rat surged upright. Braham regarded the creature with detached interest, then raised one finger. He snapped.\n\nAnd...\n\n*Wiiiiiiiiing!*\n\n\"Kyaaaak!\"\n\nA high-pitched whine erupted directly beside the rat's ear. The eardrum ruptured. Blood streamed from its nose as it collapsed, the 'forced balance loss' status effect taking hold. No resistance. Even a legendary's passive couldn't prevent it.\n\n*Making the alarm ring from his body...?*\n\nThis was complete devastation. Perfect disruption. Braham's voice carried a note of reluctant honesty as Grid marveled.\n\n\"Well, to be fair, this requires Alarm at master level. Level 1 should perform... like this.\"\n\n*Snap!*\n\nBraham's fingers met again.\n\n*Pip pip pip pip pip!*\n\nThe alarm shrieked beside the male rat's ear. Braham fired Magic Missile at the completely defenseless target. His white teeth flashed in a predatory grin.\n\n\"Is this sufficient for you?\"\n\nPride radiated from every syllable. Braham was showing off his creation. Grid couldn't deny the results.\n\n*Amazing... Absolutely amazing.*\n\nThis was huge. Legendary rated magic.\n\n> **[You have destroyed the Strong Male Rat!]**\n> \n> **[205,700,890 experience has been acquired.]**\n> \n> **[The Strong Male Rat's Gallbladder has been acquired.]**\n> \n> **[The Strong Male Rat's Heart has been acquired.]**\n> \n> **[5 blessed weapon enhancement stones have been acquired.]**\n> \n> **[4 blessed armor enhancement stones have been acquired.]**\n> \n> **[Congratulations! You have learned Alarm (Enhanced)!]**\n\n> **[The duration of Assimilation is over.]**\n> \n> **[You have regained control of your flesh.]**\n> \n> **[Braham's soul has temporarily dimmed.]**\n\n\"...Huh?\"\n\nAlready? Three minutes? Grid's hair bled back to black. He'd fallen asleep in class faster than this. Three minutes of actual focus was his absolute limit back then. Irritation surged through him, but only for a moment.\n\nReality crashed down.\n\nThe Queen Rat loomed before him, massive and utterly unscathed. Not a single scratch marred her hide.\n\n\"Human.\" Her voice was quiet venom. \"You killed my husband.\"\n\n\"...Ah.\"\n\n*Damn you, Braham.* Couldn't the bastard have killed the queen first? Grid checked his mana bar. Empty. He summoned the God Hands to intercept the queen's advance, then bolted.\n\nFirst priority: survive long enough to chug two mana potions."
}