{
  "id": 521,
  "title": "Chapter 521",
  "content": "> [You have taken a high grade mana potion.]\n\n\"Shit.\"\n\nGrid's mana bar filled halfway. The alchemy facility in Reidan produced superior mana potions, but the high grade version was all he'd brought. One superior potion would restore his full mana pool. This inferior substitute required two doses.\n\n*That damned Rabbit.*\n\nBefore departing for the East Continent, Grid had requested a full stock. Rabbit couldn't meet his eyes.\n\n\"The potions we accumulated over the last few months were depleted during the war. The Overgeared members burned through our entire supply. I'm sorry.\"\n\nDamn alchemy. Grid questioned the facility's value ever since the 'coolness' option had been applied to Iyarugt. Reidan's economy had recovered and was growing, but Rabbit maintained his obsession with the science. \n\n*Little effectiveness. Nothing but wasted gold.*\n\nStill, higher alchemy levels unlocked more option types for items. Eventually, they could produce enhancement stones. Grid had already poured mountains of gold into the facility. Stopping now would waste everything. He could only hope future returns justified the investment.\n\nA deafening squeak split the air.\n\nThe outraged Queen Rat kept pace behind him. Grid ran with all his strength, but the distance narrowed with each stride. He stopped overthinking and summoned the God Hands.\n\n\"Buy me some time.\"\n\nThe level difference between the hamster couples averaged twenty levels. Females always outranked their mates. If the Queen Rat sat at least level 420, Grid couldn't risk a direct confrontation. He planned to use his newly acquired Alarm spell to engineer a favorable situation.\n\nBOOM.\n\nBOOM. BOOM.\n\nThe ground shook with each step. Grid couldn't fathom how the creature carried such weight on wrists and ankles thinner than his own.\n\n*This monster.*\n\nThe possibility of being overwhelmed drove him to command the God Hands forward. The first hand swung the Ultimate Enhanced Mjolnir at the Queen Rat's skull. The precursor to infinite stiffness. The hammer boasted a 100% accuracy rate.\n\nCRACK.\n\n> [The Ultimate Enhanced Mjolnir has caused the target to stiffen for 0.15 seconds.]\n\n*What?*\n\nThe hammer should have caused 0.3 seconds of stiffness. Why only 0.15?\n\n*Fifty percent resistance to status conditions? Or is it the level difference?*\n\nA chill crawled down Grid's spine. The Queen Rat recovered and blocked the other God Hands with her trident. Then her red eyes flared as she struck back.\n\n> [God Hand (1) has received a strong shock and has become stiff.]\n\n*Dammit.*\n\n0.15 seconds. Too short. The infinite stiffness combo required more time than that. The Queen Rat would recover before the other God Hands could link their attacks.\n\nThe creature forced all the God Hands into stiffness. Then she hurled her trident.\n\nSHRIEEEEK.\n\nIt flew like a fighter jet. The trident tore through the atmosphere like a missile. Grid's body moved on instinct.\n\n\"Pagma's Swordsmanship.\"\n\nHe had to run. He had to wait for the potion cooldown. How could he leverage Alarm to bring down this monster? His mind raced as he used Revolve to cope with the projectile.\n\nCLANG.\n\nRotating light met steel.\n\nTHUNK.\n\n> [You have dealt 190,300 damage to the target.]\n\nRevolve redirected the trident. It pierced the Queen Rat's chest. She took 200,000 damage in one blow without slowing.\n\nShe yanked the weapon free and charged again. Grid identified a pattern.\n\n*She throws the trident unconditionally once we reach a certain distance.*\n\nIf he knew it in advance, the attack became manageable.\n\nWHOOOOOM.\n\nThe trident howled like a living thing. Grid confirmed the potion cooldown had reset. He drank. Blackening and Quick Movements activated together.\n\nFLASH.\n\nGrid vanished an instant before the trident arrived. Only the residue of demonic power remained.\n\nThe Queen Rat searched the area. But Grid wasn't easy to find. He'd equipped the Hooded Zip Up the moment he escaped. The Queen Rat would locate him within seconds. Grid needed to finish this now.\n\n\"Pagma's Swordsmanship.\"\n\nGrid appeared from empty air above the Queen Rat's head.\n\nThe creature's head snapped up. She'd pinpointed his position using her hearing alone. Her reaction speed defied reason. She avoided Pinnacle and prepared to counterattack. Then hesitated. The God Hands had recovered. Four Mjolnirs aimed at her skull.\n\n*If I kill that human, it ends.*\n\nThe Queen Rat decided. The hesitation lasted only a moment. She ignored the God Hands' attacks and swung her tail at the enemy who'd murdered her husband.\n\nCRACK.\n\nSharp as a bee's stinger, the tail struck Grid's face. In return, the Queen Rat allowed hits from all four Mjolnirs. She stiffened for a total of 0.3 seconds.\n\nThen Grid flew backward from the tail strike. His body flickered and became Randy.\n\n\"Pagma's Swordsmanship.\"\n\nThe voice of the *real* Grid echoed from behind the stiffened Queen Rat.\n\nThe creature's eyes bulged. She looked exactly like a hamster. Honestly, the expression was cute. Grid wasn't deceived by outward appearances. He drove the combo home.\n\n\"Linked Kill!\"\n\nToo late. The 0.3 seconds of stiffness was too brief. The Queen Rat broke free and avoided the God Hands' next wave. She whirled to counter the human's attack.\n\nBut nothing stood behind her. Didn't she clearly hear the human using a skill there? Why was the space empty?\n\n\"Linked Kill Wave.\"\n\nGrid's voice rang from the sky. That's right. The real Grid floated above. The voice she'd heard behind her was merely a recording created with the Alarm spell. As soon as he'd learned the new magic, Grid had applied it in combat.\n\nKRA-KRA-KRA-KRA-KRA.\n\nBlack energy blades bombarded the Queen Rat.\n\nShe screamed. The God Hands pressed their advantage. Grid took another mana potion. He accumulated Magic Missiles.\n\n*Magic Missile. Magic Missile. Magic Missile.*\n\nMagic Missile (Enhanced) Lv. 3 could be cast once per second. He summoned each instance as the cooldown reset and attached the Alarm spell to every cast.\n\nThe result was spectacular.\n\nHUMMMMM.\n\nGrid floated in the sky like a miniature sun. Lumps of white mana orbited his body.\n\n\"Pagma's Swordsmanship.\"\n\nBy now, the Queen Rat had learned the pattern. Amidst the bombardment of energy blades and hammers, she caught Grid speaking a skill name. She activated Maintain Dignity, the privilege of the queen who led the big poisonous rats.\n\nBOOM.\n\nMaintain Dignity was a one-time override threat skill possessed by certain species leaders. The effect was absolute. Energy erupted from the Queen Rat. The God Hands stiffened. The creature charged.\n\nShe screamed. This time, she intended to kill her husband's murderer. But once again, she went hungry. The real Grid remained in the sky. The voice she'd heard was another fake created by the Alarm spell.\n\n\"This magic is broken. Right?\"\n\nGrid laughed from above. He mocked the Queen Rat. Her rage skyrocketed.\n\n\"Where are you looking?\"\n\nNoe materialized behind the Queen Rat. He swallowed her whole. Soul Ingestion activated. The Queen Rat's highest stat plummeted.\n\n\"Sublime Sword.\"\n\nThe Queen Rat reappeared, fur slick with saliva. A demon stood before her. A white-haired old demon.\n\nSLASH.\n\nA swordsman who had threatened even Great Demons. The Sublime Sword pierced the Queen Rat's chest. She screamed as massive damage shredded her health bar.\n\nGrid descended from the sky. He fired fifty Magic Missiles alongside Pagma's Swordsmanship, Pinnacle Kill.\n\nBOOOOOOM.\n\nThe center of the monster community that had terrorized Pangea for two years collapsed. An extraordinary accomplishment achieved by a single man passing through the East Continent."
}