{
  "id": 522,
  "title": "Chapter 522",
  "content": "> [The <span class=\"epic\">+8 Holy Light Gloves</span>' option effect is activated, causing the skill '5 Joint Attacks' to be generated!]\n> \n> [The <span class=\"legendary\">+9 Failure</span>'s option effect is activated, causing the skill '5 Joint Attacks' to be generated!]\n> \n> [The <span class=\"legendary\">+9 Failure</span>'s option effect is activated, causing the skill 'Bisect' to be used!]\n> \n> [Pinnacle Kill has completely ignored the target's attack!]\n> \n> [**Critical Hit!**]\n> \n> [The effect of the title 'Death in One Shot!' has been activated, adding **30%** critical damage!]\n> \n> [The weak spot has been attacked! Additional damage dealt!]\n> \n> [Magic Missile has pierced the target.]\n> \n> [Magic Missile has pierced the target.]\n> \n> [Magic Missile...]\n> \n> ...\n> \n> [You have dealt **23,230,470** damage to the target.]\n> \n> [You have set a new highest damage record!]\n> \n> [The effectiveness of the title 'Death in One Shot!' has increased. Critical damage will increase by **10%**!]\n> \n> [You are establishing unparalleled damage achievements. The protection of War God Zeratul has slightly increased **attack power**, **defense**, and **penetration power**.]\n> \n> [The blessings of God Dominion and War God Zeratul have combined to grant the hidden passive skill 'God's Command'!]\n> \n> **[God's Command]**\n> \n> **Rating:** <span class=\"myth\">SSS</span>\n> \n> *The ultimate passive attack skill, born from the union of domain and divine authority.*\n> \n> *When using an attack skill, there is a **50%** chance to reset the cooldown. Skills reset and reused within 3 seconds consume no resources.*\n\n\"Ugh...!\"\n\nThe avalanche of notification windows threatened to overwhelm him. Grid vaguely registered that the messages contained good news, but there was no time to parse the details. The situation remained desperate.\n\n*Damn it!*\n\nForty minutes. He'd been navigating the monster community for what felt like an eternity. Then he'd burned through his stamina dodging the Queen Rat's relentless attacks while linking Alarm to Magic Missile, leveraging every advantage the spell combination offered. And despite all that—\n\n*What kind of insane health pool is this?*\n\nHis unease had started the moment he'd seen Noe's stolen stat: **Stamina**. The Queen Rat was the perfect tank-type boss, and even Grid's devastating assault had barely scratched her. Two-thirds of her health remained. A monster with absurdly high durability.\n\n\"Hah... hah... What the hell am I supposed to do about this rat?\" Grid gasped between ragged breaths.\n\nHis stamina gauge flashed an urgent crimson. A warning that if he didn't rest *immediately*, he'd collapse into total incapacitation. But how could he rest? A boss monster loomed directly before him, battered but far from beaten.\n\n\"Noe, can you carry me? Get me out of here?\"\n\n\"Nyahahat! I am the best demonic beast of hell! But Master, I'm too small to carry you... nyang.\"\n\n\"Kuk.\"\n\nMemphis—the so-called best demonic beast of hell. Grid had never once envied another player's companion since acquiring Noe. Until this exact moment.\n\n*If I had a wyvern, I could've escaped by now.*\n\nThe Queen Rat couldn't fly. If he'd had even a sliver more stamina, Grid could've used Fly and gotten away. \n\n*Mana isn't the problem.*\n\nPotions could restore mana, but stamina? That only recovered naturally, over time.\n\n*I still haven't learned proper stamina management.*\n\nThere was always something new to master. While Grid brooded over his shortcomings—\n\n\"Muoong... Hu...man... Enemy... of my clan...\"\n\nThe Queen Rat twitched on the ground, then began to rise. Her once-smooth, lustrous fur was now matted with sweat, blood, and grime. Yet her presence felt *stronger* than before. Her eyes blazed with the singular desire to tear Grid limb from limb.\n\n\"Human...! You are weakened! Myaang!\"\n\n*Thump. Thump. Thump. Thump.*\n\nGrid's expression darkened as the Queen Rat charged, each thunderous footfall shaking the earth.\n\n*Dodging is impossible. I'll have to fight in the Immortal State.*\n\nBut this wasn't an opponent he could defeat in five seconds. Victory seemed like a distant dream. Still—\n\n*Kkuok!*\n\nGrid tightened his grip on Failure. Magic Missiles materialized around him, and he set Alarm in place. The raid might fail, but he was determined to give it everything until the very end. So what if he failed? This was about getting stronger. He'd extract every scrap of information about the Queen Rat and use it as fuel for next time.\n\n*If today's raid fails, the next one will be different!*\n\nIt was in this moment that Grid's unique tenacity revealed itself.\n\n> [The Legendary Blacksmith's Patience skill has been activated.]\n> \n> [**Concentration**, **stamina**, and **defense** will rise to their extremes for one hour.]\n\nA skill with brutal activation conditions. Since becoming Pagma's Descendant, he'd triggered it fewer than ten times—usually when deeply focused on crafting, when all fatigue would suddenly vanish. Now, Legendary Blacksmith's Patience refilled Grid's flashing stamina gauge to the brim.\n\n\"Ah... really...\"\n\nA fierce grin split Grid's face as he felt his body grow light again.\n\n\"This feels like fate. Go, God Hands!\"\n\nIt felt like he'd been born with the singular mission to exterminate the poisonous rats. As though, in this instant, he'd become the protagonist of the world itself. Grid identified a gap in the Queen Rat's defenses—she'd lost momentum after being hammered by Mjolnir. He slid into the opening stance of a sword dance.\n\n\"Pagma's Swordsmanship!\"\n\n\"Myaang!\"\n\n\"**Linked Kill!**\"\n\n*Jjejeong!*\n\n*Jjeejeeeong!*\n\nThe Queen Rat had planned to crush Grid beneath her weight. The instant before her massive paw could cave in his skull, Grid countered with a blistering series of strikes.\n\n> [The hidden passive 'God's Command' has reset the cooldown of Linked Kill.]\n\n\"...Huh? Hidden passive?\"\n\nGrid realized this was the skill he'd acquired moments ago—the one he hadn't had time to examine! Confusion flickered through his mind, but he didn't waste a single second. He unleashed Linked Kill on the Queen Rat again as she reeled from the pain.\n\n*Jjeejeeeong!*\n\n\"Muaaaaang!\"\n\nLinked Kill lacked defense-penetration effects, but it boasted explosive raw damage. Unless the target possessed extraordinarily high defense, Linked Kill would outpace even Pinnacle Kill. And this devastating attack had now struck *twice* in rapid succession. The Queen Rat's momentum shattered.\n\n\"This male... is so strong!\"\n\nThe Queen Rat recoiled, dismayed to discover that Grid had been hiding his true power. Meanwhile, the God Hands never ceased their assault, hammering and slashing in perfect coordination, inducing repeated stiffness to prevent any damage from reaching Grid.\n\n\"Myaaaaaang!\"\n\n*Peeng!*\n\nThe Queen Rat burst through the bombardment of swords and hammers. A powerful shockwave scattered Grid and the God Hands across the battlefield.\n\n\"Shit...! Don't be fooled by the appearance—this thing's a monster!\"\n\nGrid and the God Hands were separated. It wasn't an exaggeration to say his effective defense had been cut in *half* without their protection. The Queen Rat closed the distance in a heartbeat and swung her trident at Grid.\n\n*Chaaeng!*\n\n*Chaeeeeeng!*\n\nGrid switched to Sword Ghost and desperately parried the onslaught. But the fundamental level gap made proper defense impossible.\n\n*Puok!*\n\nHe could no longer withstand the force. The trident's prongs stabbed into his side.\n\n*Pepeok!*\n\nHe misjudged the unusual trajectory of her tail—it cracked against his cheek like a whip. A flashy kick followed, slamming into his chin and snapping his head back.\n\n\"Kuk...ack!\"\n\nGrid allowed successive hits, his health draining away until he fell into the Immortal State. Five seconds. That's all he had left. If he couldn't finish the Queen Rat in that time, the worst would happen. But Grid refused to assume failure. That's why he didn't recall the distant God Hands.\n\n> [You have succeeded in combining <span class=\"legendary\">+9 Failure</span> and <span class=\"legendary\">+9 Iyarugt</span>!]\n\nMjolnir was a hammer. The God Hands were a blacksmith's tools. Those hands grasped the hammer and completed Item Combination before the portable furnace and anvil.\n\n*Peeok!*\n\n*Pakak!*\n\nIn his Immortal State, Grid ignored the Queen Rat's attacks and focused on the finished product resting on the anvil. He sidestepped the trident's thrust and commanded the God Hands.\n\n\"Throw Mjolnir! Item Transformation—Lifael's Spear!\"\n\n*Pepepepeok!*\n\nThe thrown Mjolnir, accelerated by the skill's additional effect, smashed into the Queen Rat. Grid used that window to sprint to the portable furnace and seize the combined weapon.\n\n\"Pagma's Swordsmanship.\"\n\nGrid activated Blacksmith's Rage and began a sword dance. Beside him, twenty Magic Missiles and the four God Hands—now transformed into Lifael's Spear (Reproduction)—all trained their aim on the Queen Rat.\n\n\"**Linked Kill Wave.**\"\n\n*Ku-kwa-kwa-kwa-kwa! Ku-kwa-kwa-kwa-kwa!*\n\nBlue and crimson energy blades, twenty streaks of white light, and four golden spears converged on the Queen Rat in a devastating barrage. But it wasn't over.\n\n> [The hidden passive 'God's Command' has reset the cooldown of Linked Kill Wave.]\n\n\"**Linked Kill Wave!**\"\n\nA second storm of energy blades erupted.\n\n\"Muaaaaang!\"\n\nThe Queen Rat tried to mount a defense, but she was too late. The 0.3 seconds of stiffness inflicted by the earlier Mjolnir throw proved fatal.\n\n*Kuwaaaaang!*\n\nThe central area of the monster community erupted in a massive explosion.\n\n> [The ruler of the Big Poisonous Rat community, the **Queen Rat**, has been defeated!]\n> \n> [The first gateway in northern Pangea has been cleared!]\n> \n> [The title **'Pangea's New Star'** has been acquired!]\n> \n> [**Queen Rat's Walnut** has been acquired.]\n> \n> [**Queen Rat's Fur** has been acquired.]\n> \n> [**5 Blessed Weapon Enhancement Stones** have been acquired.]\n> \n> [**4 Blessed Armor Enhancement Stones** have been acquired.]\n> \n> [**Idan's Frying Pan** has been acquired.]\n> \n> [Your level has risen!]\n\n\"Hah... hah...\"\n\nHe'd turned things around in the raid's second half and clinched victory. All his stamina drained away in an instant, and he couldn't bear it any longer—Grid collapsed onto the ground. The struggle was over. Now he checked the titles and rewards he'd acquired, and joy spread across his face."
}