{
  "id": 530,
  "title": "Chapter 530",
  "content": "# Chapter: The Pangean Forge\n\n---\n\n\"What benefits will the winner receive from this competition?\"\n\nWhite's expression brightened slightly. \"We'll secure exclusive rights to supply battle gear to Lord Han Seokbong for an entire year. Beyond that, the lord will recommend our smithy to every tourist and traveler passing through Pangea. The revenue alone...\" He shook his head in wonder. \"It would be tremendous.\"\n\nGrid nodded slowly. Pangea was twice the size of Reidan, the second-largest city in the Eternal Kingdom. Unlike Reidan's desert isolation, Pangea teemed with constant foot traffic—merchants, adventurers, pilgrims, all flowing through its gates like a river that never ran dry. The smithy that claimed victory in this competition wouldn't just earn wealth. They would earn *legend*.\n\n*To be crowned the finest blacksmith in all of Pangea...* It was the dream that burned in the heart of every smith who worked these forges.\n\nBut Grid could see something deeper flickering in White's eyes. Something personal.\n\n\"And there's more,\" White said quietly. \"The winner earns the right to enter the dungeon beneath the lord's castle.\"\n\n\"The castle has a dungeon?\"\n\nGrid's interest sharpened immediately. He'd heard of such places before—Chris's territory housed a vampire boss in its underground labyrinth, and the man had amassed a small fortune in elixirs from repeated raids. Grid's own territories, by contrast, had no such hidden depths to explore.\n\n*Castle dungeons are supposed to be goldmines for rare materials and unique items...*\n\nHe could already picture Lauel's grand vision: conquering every castle on the West Continent, monopolizing their dungeons, turning them into Overgeared resource farms. The plan was ambitious. Perhaps *too* ambitious.\n\n*Not feasible. Not yet, anyway.*\n\nGrid pushed aside his territorial greed and focused on the man before him. \"What's inside Pangea's dungeon?\"\n\nWhite's jaw tightened. \"Armored needles.\"\n\n\"Armored needles?\"\n\n\"The creatures that killed my father.\" White's voice dropped to barely above a whisper. \"Monsters that produce something all blacksmiths dream of obtaining—the Silver Thread.\"\n\n*Silver thread?*\n\nThe name sounded deceptively simple. But if it were truly ordinary silver thread, the blacksmiths of Pangea wouldn't speak of it with such reverence.\n\n\"It's not like normal silver thread, is it?\"\n\nWhite shook his head slowly. \"The armored needles wear silver armor that gradually melts from contact with their corrupted blood. Over years—decades, even—the melted silver hardens into thread through a process no smith can replicate. The result is a material that never breaks and possesses... mysterious properties.\"\n\nGrid's eyes narrowed. \"Your father was killed trying to obtain this thread?\"\n\n\"Yes.\" White's fists clenched at his sides. \"Several years ago, he won the competition. He entered the dungeon with the lord's troops—they make regular expeditions down there. But something went wrong. An armored needle...\" He couldn't finish the sentence.\n\nGrid studied the young blacksmith carefully. White was afraid—that much was obvious from the tension in his shoulders, the way his gaze kept drifting to the floor. But beneath the fear, something else burned. Anger. Determination. *Greed.*\n\n\"I will recreate the Red Phoenix Bow,\" White declared, his voice gaining strength with each word. \"I will win this competition. I will gain access to that dungeon and the lord's resources. And I will sweep away every last one of those armored needles.\" His eyes blazed. \"I'll use their Silver Thread to make the White Hammer Smithy the greatest forge in Pangea. That was my father's dream. Now it's mine.\"\n\n\"...\"\n\nThe warmth that spread through Grid's chest surprised him. He looked at White with new eyes—seeing not just another NPC blacksmith, but a kindred spirit. Someone who understood what it meant to chase an impossible dream.\n\n*A blacksmith with this much passion... I can't just walk away.*\n\nThe system agreed.\n\nA notification window materialized in Grid's vision, accompanied by the familiar chime of a new quest.\n\n---\n\n> **[A Quest Has Been Created!]**\n>  \n> **[Win the Smithy Competition!]**\n>  \n> **Difficulty:** SSS\n>  \n> You are the successor of Pagma's techniques and will. You carry his humanitarian ideology—the belief that blacksmithing should benefit all people, lifting them up rather than exploiting them.\n>  \n> You are moved by White's determination to honor his father's memory and elevate the White Hammer Smithy to greatness. Help him achieve victory in the smithy competition!\n>  \n> When the White Hammer Smithy is crowned Pangea's finest forge, you will gain an invaluable ally in this city.\n>  \n> **Quest Clear Conditions:** Produce a Unique-rated or higher Restored Red Phoenix Bow.\n>  \n> **Quest Rewards:**  \n> • White's affinity will reach MAX.  \n> • Lord Han Seokbong's affinity will increase by 30~80 points.  \n> • Additional rewards will be granted based on your affinity with the lord.  \n> • Access rights to Pangea Castle's dungeon.  \n> • Level +1\n>  \n> **Quest Failure:**  \n> • White's affinity will decrease dramatically.  \n> • Your reputation in Pangea will plummet.\n\n---\n\n*Perfect.*\n\nGrid's desire to participate in the competition crystallized into certainty. He had justification, proper motivation, and tangible rewards waiting at the finish line. There was no reason to refuse.\n\nThe notification window presented him with two options: **YES** or **NO**.\n\nGrid selected **YES** without hesitation.\n\n\"Listen, Grid.\" White's voice pulled him back to the present moment. The young blacksmith looked simultaneously hopeful and embarrassed. \"I need to be honest with you about something. I'm not... I'm not confident I can handle the white phosphorus wood properly. It gives me better heat than I've ever had before, but I can't completely control it. The flames are too intense, too wild.\"\n\nHe paused, clearly struggling with what he wanted to say next.\n\n\"You're a legendary woodcutter. That means you must specialize in firewood, right? Understanding wood, what makes it burn hot or slow, how to coax the best flames from different materials...\" White met Grid's eyes. \"I know it's shameful to ask, but... would you participate in this competition as a member of my smithy? As my assistant?\"\n\n\"...\"\n\n*A legendary blacksmith mistaken for a woodcutter?*\n\nGrid felt a flash of embarrassment at how completely White had misread the situation. This wasn't how he'd expected things to develop at all. But honestly? It didn't matter. The quest was already accepted. The path forward was clear.\n\n\"I understand,\" Grid said simply. \"I'll help you.\"\n\n\"Oh...! Oh!\" White's face lit up like a furnace catching fresh air. \"Thank you! I truly appreciate this!\"\n\nGrid allowed himself a small, knowing smile.\n\n*Of course, a legendary blacksmith is also excellent with the bellows.* He'd spent countless hours managing forge fires, learning the subtle art of temperature control, understanding how different materials responded to heat. *Handling fire isn't difficult for me.*\n\nThe key was simply getting his foot in the door.\n\n*I just need to participate in the competition, no matter what role I'm playing.*\n\nAnd once the competition began?\n\n*I'll take the lead.*\n\n---\n\n## Lord Han Seokbong's Burden\n\n\"Damn it all.\"\n\nHan Seokbong stood alone in the castle's tomb room, staring at the white jade tombstone that should have held the Red Phoenix Bow. The absence of the divine weapon weighed on him like a physical thing—pressing down on his shoulders, constricting his chest, making every breath slightly more difficult than the last.\n\nHe was the descendant of a fallen noble family. His childhood had been marked by poverty and hunger, by watching his mother work herself to exhaustion just to keep them fed. But that same mother had been wise beyond measure. She'd taught him to read, to think, to see the patterns others missed. Thanks to her guidance, he'd risen from nothing to become a civil servant, then climbed the ranks through merit and intelligence rather than birthright.\n\nHan Seokbong had been appointed as an advisor to the King of the Cho Kingdom. The policies he'd developed had strengthened the kingdom's economy, stabilized its borders, made it prosperous. At fifty years old, he'd been rewarded with the lordship of Pangea—the jewel of the south, a city that represented everything the Cho Kingdom could achieve.\n\nHe'd been hailed as a hero who restored his family name. A role model for commoners everywhere. A national treasure.\n\nAnd now, in his stewardship, Pangea's greatest treasure had been stolen.\n\n\"In the end, the yangbans of the Hwan Kingdom have moved.\" His voice echoed in the empty tomb room, bitter and frustrated.\n\nThe Four Divine Treasures—artifacts containing the power of gods themselves:\n\nThe **Blue Dragon Dao** in the eastern Kaya Kingdom.  \nThe **White Tiger Spear** in the western Pa Kingdom.  \nThe **Red Phoenix Bow** in the southern Cho Kingdom.  \nThe **Black Tortoise Jewel** in the northern Xing Kingdom.\n\nThe Hwan Kingdom had bestowed these treasures upon the four kingdoms generations ago, with a single command: *Protect them well.* They were more than weapons. They were symbols of divine favor, proof that the Hwan Kingdom's immortal yangbans looked upon these mortal kingdoms with approval.\n\nAnd now the Cho Kingdom had *lost* theirs. On Han Seokbong's watch.\n\n*The yangban gave me half a year...*\n\nIf he couldn't recover the Red Phoenix Bow within six months, his own safety would be the least of his concerns. The Cho Kingdom maintained extensive trade relations with the Hwan Kingdom. If the yangbans decided to impose sanctions—restrict trade, withdraw protection, withhold resources—the kingdom would be paralyzed within a year. Its status would plummet. Its people would suffer.\n\n\"Ha!\" The bitter laugh escaped before he could stop it.\n\nResentment churned in his gut. Three years ago, an unidentified Daoist—some evil cultivator in tattered robes—had invaded Pangea and stolen the Red Phoenix Bow right from under their noses. *Why did this have to happen to the Cho Kingdom? What did we do to deserve this?*\n\nIf the Cho Kingdom weakened, the northern Xing Kingdom stood to gain the most. They were rivals in trade, competitors for influence with the central Hwan Kingdom. But would Xing really orchestrate something this dangerous? The Four Divine Treasures weren't just symbols—they were safeguards. Protective wards against greater threats. Anyone who understood their true purpose would never risk destabilizing the system.\n\n*Unless the enemy is within.*\n\nThe thought sent ice through Han Seokbong's veins. If this was an internal plot, there were only a few candidates who would benefit from weakening the Cho King's position.\n\n*Seok Hyungong.*\n\nThe king's younger brother. A man with ambition but little cunning, support but not enough to make a real move for the throne. It was possible, but...\n\n*He isn't bold enough. His power base is too weak to risk something this extreme.*\n\nIn the worst-case scenario...\n\n*Maybe someone discovered what the Red Phoenix Bow truly is and desired its power for themselves.*\n\nIf that were true, they wouldn't stop with one treasure. The Blue Dragon Dao, the White Tiger Spear, the Black Tortoise Jewel—all of them would be targets. The entire continent could descend into chaos as various factions scrambled to claim divine power for themselves.\n\n*No. This isn't something I should worry about right now.*\n\nHan Seokbong forced himself to take a deep breath, centering his thoughts. If the situation escalated to continent-wide catastrophe, the yangbans themselves would intervene. The immortals of the Hwan Kingdom didn't involve themselves in mortal affairs often, but when the balance of power truly threatened to collapse...\n\n*Perhaps they'll handle the larger conspiracy. My job is simpler.*\n\nHe just needed to recover the Red Phoenix Bow.\n\nBut three years of searching had yielded nothing. The monster communities growing in the northern mountains had severed many of Pangea's communication routes with the outside world. Tracking the weapon beyond the city's borders was nearly impossible without mounting a full military expedition—which would only advertise their weakness to neighboring kingdoms.\n\nA more realistic solution had presented itself: *Create a new treasure to replace the Red Phoenix Bow.*\n\nIt wasn't ideal. A reproduction could never match the original's divine potency. But if he could present the yangbans with a convincing replica, something that demonstrated Pangea's blacksmithing excellence and the Cho Kingdom's commitment to its sacred duty... perhaps it would buy more time. Perhaps it would be enough to avoid catastrophe.\n\nThat's why he'd placed his hopes in the blacksmiths of Pangea.\n\n\"Please...\" Han Seokbong pressed his palms together, staring at the empty space where the Red Phoenix Bow should rest. \"I hope one of you will successfully recreate it this year.\"\n\nThe white jade tombstone gleamed in the candlelight, silent and accusatory.\n\n\"Your face grows more anxious with each passing day.\"\n\nThe familiar voice made Han Seokbong's head snap up. An old woman shuffled into the tomb room, leaning heavily on a wooden cane. Her eyes, though clouded with age, still held the sharp intelligence that had guided him through every crisis of his life.\n\n\"Won't all this meaningless anxiety poison your spirit, my son?\"\n\n\"Mother!\" Han Seokbong rushed forward, grasping her arm to steady her. Worry flooded through him. She was eighty years old now, frail and weathered. The stairs leading down to this tomb were steep and treacherous. \"Your knees—you shouldn't be walking all the way down here. What if you fell?\"\n\nHis mother waved off his concern with a dismissive gesture. In her other hand, she carried a writing brush—the same one she'd given him when he was a boy first learning his letters.\n\n\"Your mother is still healthy enough, so don't fret over me.\" She pressed the brush into his palm, her grip surprisingly firm. \"Don't forget—you must always maintain your calm. A lord who panics makes poor decisions. Train your mind as diligently as you train your body.\" She sighed, the sound heavy with years of hard-won wisdom. \"Come. Sit.\"\n\nHan Seokbong watched as his mother moved around the tomb room, methodically extinguishing each candle placed around the white jade tombstone. Darkness gradually swallowed the space until only the faint moonlight filtering through a high window remained.\n\nWhen the last candle guttered out, she settled onto a cushion and produced a wooden board and a rice cake.\n\n\"I will slice rice cakes while you practice your calligraphy.\" Her voice was gentle but firm—the tone that had guided him through childhood nightmares and adult crises alike. \"Calm yourself, Seokbong. Clear your mind.\"\n\n\"Yes... I understand, Mother.\"\n\nShe'd always been by his side. Whenever confusion clouded his thoughts or anxiety threatened to overwhelm him, she would appear with this same ritual. The brush. The darkness. The quiet discipline of forming characters he couldn't properly see.\n\n*Writing in darkness clears my mind,* Han Seokbong reminded himself. *The imperfect strokes force me to feel rather than think, to trust my training rather than my fears.*\n\nHe smiled—the first genuine expression he'd managed in days—and began to write. In the darkness, his handwriting was crude, the characters wobbly and uneven. But that was the point. Perfection wasn't the goal. *Peace* was the goal.\n\nThe soft sound of his brush on paper filled the tomb room, accompanied by the rhythmic scraping of his mother's knife against the wooden board.\n\nThen—\n\n\"Ah!\"\n\nA sharp intake of breath. Han Seokbong's head jerked up.\n\nHis mother held her finger to the candlelight that had somehow re-lit itself, examining a thin line of blood welling from a small cut. It wasn't serious—she'd cut herself while slicing rice cakes countless times over the years. Just a minor accident, easily dismissed.\n\nBut something about the moment felt weighted with meaning, as though the universe itself had marked this small injury as significant.\n\nHan Seokbong pushed the thought aside and returned to his calligraphy, trying to recapture the calm that had briefly settled over his spirit.\n\n---\n\n## Blue Flames and Barbed Words\n\nOne hour before the competition.\n\nThe blacksmiths of the White Hammer Smithy worked in tense silence, carefully gathering and organizing the materials they'd need for the upcoming contest. White moved among them, double-checking supplies, offering quiet words of encouragement to the younger apprentices whose hands trembled with nervousness.\n\nThen the door to their preparation room slammed open.\n\n\"Well, well! Who do we have here?\" The voice was loud, deliberately cheerful, and edged with mockery. \"Isn't it Dark White from the White Hammer Smithy?\"\n\nEnoch strode into the room as though he owned it. He was a middle-aged man with a kind face—soft features, laugh lines around his eyes, the sort of appearance that suggested warmth and grandfatherly wisdom. But his tone shattered any illusion of kindness.\n\n\"The White Hammer Smithy has been disgraced for three years running, and you won't be winning again this year either.\" Enoch's smile widened, sharp as a knife. \"Are you at least enjoying this last little bit of fun before your inevitable failure?\"\n\nWhite's jaw clenched, but he said nothing.\n\n\"You know,\" Enoch continued, circling the room like a predator savoring wounded prey, \"your father would be so disappointed. The White Hammer Smithy will soon collapse entirely—all because a blacksmith who can't even handle *fire properly* was made the successor.\" He clicked his tongue in mock sympathy. \"Such a waste.\"\n\n\"...\"\n\nWhite's hands curled into fists at his sides. Rage burned through his chest, hot and immediate, demanding release. But he forced himself to remain still, to keep his expression neutral.\n\n*Enoch isn't wrong,* he thought bitterly. *I haven't won in three years. I can't control the white phosphorus flames. If I lose my temper now, I'll only give him more ammunition.*\n\n*I'm sorry, Father. I'm such a terrible son.*\n\nHis fingernails bit into his palms.\n\n*Crack.*\n\nThe skin split. Blood welled between his fingers, dripping onto the floor.\n\n\"A blacksmith should cherish his hands.\"\n\nGrid stepped forward from where he'd been observing silently in the corner. His voice was calm, matter-of-fact, but something in his tone made Enoch's smug expression falter.\n\nGrid produced a simple cloth bandage—the kind beginners kept in their inventory for minor injuries—and held it out to White. Then he turned to face Enoch fully.\n\n\"Are you good at handling fire?\"\n\nEnoch stared at him for a moment, then burst out laughing.\n\n\"What's this? I've never seen you before. Who are you?\" His laughter had an ugly edge now. \"Some nobody dares to interrupt a conversation between adults? Is this your concept? Playing the mysterious defender?\"\n\n\"What adult?\" Grid's expression didn't change. \"There's only a ten-year age gap between us. That hardly makes you my elder.\"\n\n\"Ha!\" Enoch's face reddened. \"The level of the White Hammer Smithy really has hit rock bottom if they're recruiting rude newcomers who don't understand basic respect. I don't appreciate this kind of—\" He waved his hand dismissively. \"Tsk, tsk. Truly pathetic. All the talented blacksmiths are gathering at *my* smithy, while you're stuck with... whatever *this* is.\" He gestured at Grid as though he were examining something unpleasant on the bottom of his shoe. \"Well, this year's winner is already decided. Let's celebrate my victory in advance! Hahaha!\"\n\n*What a clown.*\n\nGrid studied Enoch with mild disgust. The man had walked all the way to another smithy's preparation room just to talk trash and feel superior. *A complete petty gangster.* This was exactly the type of person Grid despised—someone who derived pleasure from kicking others when they were down.\n\n\"I'll have to beat you first.\"\n\nThe words came out casual, almost conversational. But they hung in the air like a challenge carved in steel.\n\nEnoch's laughter cut off abruptly. \"What did you just—\"\n\n\"You heard me.\"\n\nA *woodcutter*—a nobody who specialized in chopping trees—had just declared war on the master of the Blue Flames Smithy, the favorite to win the competition.\n\nWhite didn't hear the exchange. He was too focused on wrapping the bandage around his bleeding hand, trying to swallow the anger and shame churning in his gut.\n\nBut Grid had heard himself perfectly.\n\nAnd he meant every word."
}