{
  "id": 531,
  "title": "Chapter 531",
  "content": "\"Leader...\"\n\nThe blacksmiths of the White Hammer smithy called out to their master, but White didn't respond. He sat hunched to one side, head bowed low, shoulders trembling with shame. Enoch's mocking laughter still echoed in his ears. His craftsmen exchanged worried glances, but the humiliated White turned away from their concern.\n\nGrid approached with a frown creasing his brow.\n\n\"Is there time to be doing this?\"\n\n\"...?\" White's head lifted slightly.\n\n\"If you're upset, pay it back.\" Grid's voice was sharp, cutting through White's self-pity. \"There's no time to be absentminded. Do your best with your skills.\"\n\nGrid had nothing but contempt for bullies. He'd once been the one ignored and despised, trampled underfoot by people who thought themselves superior. That shared experience let him understand what burned in White's chest right now. And his **Blacksmith's Affection** passive only amplified that desire to help.\n\n\"If you don't like that feeling gnawing at you, blow it away.\" Grid extended his hand. \"Now pull it out—the design of the Red Phoenix Bow you've been envisioning.\"\n\n\"Huh? U-Understood.\"\n\nWhite's hands moved automatically, reaching for the precious design. He'd only asked Grid to help with the bellows—a simple task requiring no knowledge of their carefully guarded blueprints. This design represented three years of work, countless trials and errors by the entire White Hammer team. It shouldn't be shown to just anyone.\n\nBut White was in a daze. His fingers handed over the rolled parchment without resistance.\n\n> **[The Red Phoenix Bow (Reproduction: White Hammer Version) design has been acquired.]**\n\n> **[Red Phoenix Bow (Reproduction: White Hammer Version)]**  \n> **Rating:** Normal ~ Epic  \n>  \n> **Normal Rating Information:**  \n> ...  \n> ...  \n>  \n> **Rare Rating Information:**  \n> ...  \n> ...  \n>  \n> **Epic Rating Information:**  \n> ...  \n> ...\n\nGrid's eyes scanned the specifications rapidly. One meter twenty centimeters in length—slightly larger than a short bow, much smaller than a longbow. The bow was divided into three major components: Hwangpyeong Mountain bamboo formed the central riser, while both limbs utilized mulberry wood. Grid studied the design and accompanying technical notes before looking up.\n\n\"What are the characteristics of Hwangpyeong Mountain bamboo and mulberry wood?\"\n\n\"Hwangpyeong Mountain bamboo contains exceptionally dense fiber, while mulberry wood balances softness with strength.\" White answered automatically, still somewhat dazed.\n\n\"In other words, you chose materials that maximize elasticity?\"\n\n\"Huh? Oh, that's right. It won't break easily under tension and provides the power to fire arrows.\" White's confusion deepened. *Shouldn't a woodcutter already know all this?*\n\nGrid ignored the blacksmith's puzzled expression and activated his legendary appraisal skills, scanning the listed materials more thoroughly.\n\n*Certainly, both the bamboo and mulberry wood are of the best quality.*\n\nNothing on the West Continent compared. The trees of the East Continent possessed superior characteristics in every measurable way.\n\n*Is it because they grow in an environment saturated with mana?*\n\nGood. Obviously good.\n\n*But...*\n\nGrid's brow furrowed as a problem revealed itself. Based on the name alone, the Red Phoenix Bow possessed fire attributes. No matter how outstanding the bamboo and mulberry's performance, could they truly sustain the intense heat of sustained flames? He moved to the next section of the design, seeking the answer.\n\nThe exterior of the bow was wrapped with fireproof leather.\n\n\"What is that red leather?\"\n\n\"Rascal Leather. It doesn't burn even when engulfed in flames—very solid and highly resistant to fire damage.\"\n\n\"...Hrmm.\"\n\nThat solved one concern. But the most critical question remained: how did they plan to summon the fire itself? Grid's anticipation built as he confirmed the final section of the drawing—only to deflate like a punctured waterskin. They'd simply embedded a fire stone.\n\n*What are you doing?*\n\nBefore he realized it, Grid's hands had crumpled the design. White stared at him with a disbelieving expression, eyes wide with shock at seeing three years of work being wadded up like trash. Grid caught himself and quickly smoothed out the parchment again.\n\n\"This won't do.\"\n\nFire stone? It might be a rare ore, but Grid could find it anywhere on the West Continent. He'd used it as a production material dozens of times.\n\n*It might work with an iron bow or a composite bow, but a simple wood construction can't bear the weight of the fire stone. The balance would be completely off. And if you reduce the fire stone's size to compensate, the firepower weakens proportionally.*\n\nIf a bow was made according to this design, it wouldn't deserve to be called the Red Phoenix Bow.\n\n*The answer is definitely the white phosphorus wood. I'm certain of it.*\n\nThe problem was Grid's incomplete knowledge of the original Red Phoenix Bow's exact form and characteristics. But White could fill in those gaps.\n\n\"White, you've seen the Red Phoenix Bow before, right?\"\n\n\"Of course.\" White's tone cooled noticeably. \"It's the treasure of my hometown. I've seen it many times from a distance—the lord displays the Red Phoenix Bow during major festivals and ceremonies.\"\n\nThe warmth in White's eyes when looking at Grid had faded. He didn't appreciate his three-year design being crumpled like wastepaper, and his affinity dropped accordingly. Grid barely noticed. There would be plenty of chances to make amends later.\n\n\"Is this design based on the Red Phoenix Bow you saw?\"\n\n\"Yes... However, the original Red Phoenix Bow wasn't covered with leather. It was made entirely of wood...\" White's voice carried a defensive edge. \"This is the result of trying to copy its form as closely as possible with available materials.\"\n\n\"Was the Red Phoenix Bow's color white?\"\n\n\"Huh, how did you—?\" White's eyes widened. \"That's right. The Red Phoenix Bow was pure white...\"\n\n*That's all I needed.*\n\nGrid no longer hesitated. He immediately took action.\n\n\"**Item Creation**.\"\n\n> **[What item do you want to create?]**\n\n\"A bow.\"\n\n> **[What materials would you like to use?]**\n\n\"White pho.... No, wait.\"\n\nGrid paused, reconsidering. White phosphorus wood was comparable to dragon iron in hardness—stronger than steel, but with relatively weak elasticity. White's design was based on the Red Phoenix Bow he'd observed, and it emphasized the resilient, flexible properties typical of wooden bows. If the original Red Phoenix Bow truly prioritized resilience as White interpreted, then white phosphorus wood shouldn't be the main material at all.\n\n*But what if White misinterpreted what he saw?*\n\nThen the entire calculation changed. Grid chose to trust his own intuition. This wasn't arrogance—it was the pride earned by becoming a **Legendary Blacksmith**.\n\n\"I will use white phosphorus wood as the material.\"\n\nThe decision was made.\n\n***\n\n\"What is he doing?\"\n\n\"Let's watch.\"\n\nThe White Hammer blacksmiths exchanged confused glances. The woodcutter Grid had suddenly started interrogating White about the Red Phoenix Bow's specifications. Now he'd retreated to squat in a corner, drawing something in the air with intense focus. One blacksmith cried out with sudden alarm.\n\n\"Don't tell me! He's copying the design we spent three years and countless trials completing!\"\n\n\"Haha, don't be ridiculous.\"\n\n\"That's nonsense.\"\n\nGrid couldn't be a design thief. Surely no thief would blatantly copy blueprints right in front of the original creators?\n\n\"He'd deliberately go somewhere dark and hidden... Wait.\" The blacksmith's eyes narrowed. \"Unless he's so brazen he thinks we won't notice?\"\n\nSuspicion rippled through the group. Several blacksmiths straightened, hostility gathering in their postures. White raised a hand, restraining those who'd begun moving toward Grid.\n\n\"You shouldn't judge a person so casually.\"\n\nWhite's words carried the weight of recent experience. Just days ago, hadn't he done exactly that? Seen only fragments of Grid and judged him harshly? White had dismissed Grid as an unscrupulous person dreaming of becoming a blacksmith without understanding the craft.\n\n*I didn't realize he was such a distinguished person. Hrmm...*\n\nBut now things were different. What was Grid actually doing while squatting in that corner? Maybe he really was stealing their design as his fellow blacksmiths suggested?\n\n*No, he wouldn't steal so openly... would he?*\n\nWorry gnawed at White. Memories of humanity's darker impulses surfaced. He approached Grid cautiously, peering over the man's shoulder at what he was drawing in the air with the system interface—and froze.\n\nWhite's body jerked like he'd been struck by lightning, actually jumping like a startled rabbit. The design Grid was constructing before his eyes... it was the Red Phoenix Bow. Not just any interpretation, but a far more complete and refined design than what White had envisioned over three years of obsessive work.\n\n\"N-No, how can this be...?\" White's voice cracked. \"How can a woodcutter do such a thing?\"\n\nWhite still misunderstood Grid's true nature. Grid simply laughed as he confirmed the information of his completed design.\n\n> **[Red Phoenix Bow (Reproduction)]**  \n> **Rating:** Epic ~ Legendary  \n>  \n> **Epic Rating Information:**  \n> ...  \n> ...  \n>  \n> **Unique Rating Information:**  \n> ...  \n> ...  \n>  \n> **Legendary Rating Information:**  \n> ...  \n> ...  \n>  \n> *The treasure of Pangea reproduced by a legendary blacksmith. Its value can compete with the original.*\n\n*Perfect.*\n\nNow everything depended on the actual rating of the Red Phoenix Bow he'd produce during the competition. Grid addressed the stunned White without looking up.\n\n\"You said the competition time was eight hours?\"\n\nWhite replied with a dazed, almost dreamlike expression.\n\n\"Ah... Yes, that's correct. It's excessively long for crafting a bow, but this is the competition to reproduce Pangea's greatest treasure, so...\"\n\n*This is going to be tight.*\n\nThe time constraint was severe. For Grid, who normally spent one or two full days crafting a bow of this caliber, eight hours was nothing—barely enough time to achieve quality work.\n\n*I'll have to use it wisely.*\n\nThen again, he possessed a new trump card—the power he'd obtained from creating his twentieth legendary item.\n\n*Item Upgrade!*\n\nGrid felt confident he could easily clear the quest with this ability, even if he couldn't achieve a perfect reproduction of the Red Phoenix Bow. He checked the time remaining and rose to his feet, joints popping from the extended crouch.\n\n\"Then let's depart.\"\n\n***\n\n\"The White Hammer blacksmiths are entering!\"\n\n\"Boo! Boooooo!\"\n\nThe White Hammer team entered the massive stadium with Grid striding at the front—not White. The spectators erupted in jeers and catcalls, their disappointment from three consecutive losses still fresh. White and his blacksmiths shrank back from the wall of sound, shoulders hunching defensively.\n\nGrid enjoyed every second of it.\n\n*More.*\n\nIgnore him more.\n\n*The more you underestimate us, the more dramatic the reversal will be.*\n\nGrid's grin widened, teeth flashing in the bright stadium lights. The blacksmiths from rival smithies crowded on the competition stage, pointing and laughing among themselves.\n\n\"Who is that person?\"\n\n\"First time I've seen him... must be new.\"\n\n\"Why is a newcomer leading instead of White?\"\n\n\"White's probably too embarrassed and is using the new guy as a shield.\"\n\n\"Pathetic to the very end.\"\n\nThe tens of thousands of spectators filling the stadium seats. The hundreds of blacksmiths gathered on the competition floor. Not one of them had any idea that this \"newbie\" would soon cause an upheaval.\n\nIt was the first step of Grid's legend on the East Continent."
}