{
  "id": 532,
  "title": "Chapter 532",
  "content": "# Chapter [X]\n\n**[Continued from previous chapter]**\n\n\"U-um...\"\n\nWhite and the other blacksmiths from the White Hammer smithy exchanged confused glances. Why was a woodcutter being asked to control the flames in front of everyone?\n\n*I want to tell him to stand back, but...*\n\n*He's the great person who designed the Red Phoenix Bow!*\n\n*Who the hell is he?*\n\n*Maybe it's as Leader White said...*\n\n*He might be a distinguished person...*\n\n*He's someone who cut down that white phosphorus tree.*\n\nThe White Hammer blacksmiths murmured amongst themselves as they climbed onto the stage.\n\n\"**BOOOOOO!**\"\n\n\"White is a coward! All the other blacksmiths are standing at the forefront—why do you have a newcomer in front of you?\"\n\n\"Isn't it shameful to hide behind another person?\"\n\nThe crowd's booing intensified. Enoch, the leader of the Blue Flames smithy, sauntered over to White with a smirk plastered across his face.\n\n\"You dare to participate in the competition again?\" Enoch's voice dripped with mockery. \"In any case, the result will be the same as the last three years. Isn't that right? For. Ever. Lo. Ser. Friend.\"\n\n\"...\" White didn't respond. Enoch was the type who thrived on ridiculing others and watching their reactions. *He'll go away if I ignore him.*\n\nBut Enoch was persistent.\n\n\"I really can't understand you,\" Enoch continued, circling White like a predator. \"You dare to risk the White Hammer smithy's reputation by confronting me when you don't have the talent. Ah, no—didn't the reputation of the White Hammer smithy already fall to the bottom after your father died? It was the day he *foolishly* died to the armored needle.\"\n\n\"You!\" White's hands clenched into fists.\n\n\"Kukuk! It turns out to be like father, like son!\"\n\nEnoch was crossing the line. White could no longer tolerate it. The moment he became angry enough to punch Enoch in the face, something interrupted him.\n\n\"Bark, bark. Bark.\" Grid's voice cut through the tension like a knife. \"It's the sound of a dog barking nonsense.\"\n\n\"...?\" Enoch turned, his expression shifting from pleasure to shock.\n\nBoth men simultaneously turned their gazes toward the source of the voice. They found a black-haired man with sharp eyes—the unidentified newcomer of the White Hammer smithy.\n\nGrid scoffed at Enoch. \"You're a crazy dog. Just wait a minute. There's no need to bother Master White. I'll smash you myself.\"\n\n\"*Master* White?\" Both White and Enoch spoke at the same time.\n\nWhite was stunned. Enoch laughed loudly, his voice echoing across the stage.\n\n\"You're really crazy!\" Enoch clutched his sides. \"White! You don't know your place and actually dare to be a teacher? A person with poor talent teaching someone else? Puhat! Puhahat! Oh, my stomach! If the other blacksmiths hear this, they'll be laughing for days!\"\n\n\"Ugh...!\" White's face turned red. His dark skin made it hard to see, but his embarrassment was palpable. *There's nothing wrong with what Enoch said...*\n\n\"...\" White had spent the past three years as a loser. He'd lost his self-esteem entirely. His head bowed involuntarily.\n\n\"Raise your head,\" Grid commanded, his voice firm. \"Don't get used to seeing the ground.\"\n\nGrid stared at White, and in that moment, he was reminded of his past self. The Grid who'd been trampled, mocked, and defeated.\n\n\"Today, the White Hammer smithy that you and your father love will win the competition.\"\n\n*Tap.*\n\nGrid's finger pressed against White's chest. White noticed the hard calluses on those thick fingers.\n\n*Blacksmith hands?*\n\nWhite belatedly realized Grid's true identity. His eyes widened as Grid confirmed it.\n\n\"You will be the best smithy in Pangea.\"\n\nToday's victory would be achieved through Grid's help, but not the future ones. White was someone Grid had used **Blacksmith's Affection** on. His blacksmith skill level was destined to rise the moment his affinity reached maximum.\n\n---\n\n\"Enoch is becoming more and more distorted,\" one of the older blacksmiths muttered from the sidelines.\n\n\"It's because he respected Dawhite more than anyone else. He was disappointed when Dawhite chose White as a successor, despite the boy not being able to support the smithy.\"\n\n\"Looking at it objectively, the pitiful one isn't White, but Enoch. Well, that doesn't excuse his twisted personality.\"\n\n\"Ignore him. Enoch and White aren't people we need to worry about.\"\n\nEnoch had excellent skills and a twisted personality. White was born with unique talent but had been lazy in his youth. From the perspective of the skilled and experienced leaders of the Black Anvil and Red Tongs smithies, they were both inexperienced.\n\n\"Hrmm, yes. We need to focus on the competition,\" the Black Anvil leader said, stroking his beard.\n\n\"Last year, I was careless and lost the title to Enoch,\" the Red Tongs leader replied.\n\n\"This year, the title returns to one of us.\"\n\nThe Black Anvil and Red Tongs leaders acknowledged each other as the true opponents. The appearance of the two best blacksmiths in Pangea excited the audience.\n\n\"Beoksan! La Hochul! Have a great match this year!\"\n\n\"Make the national treasure! Fighting!\"\n\n\"The firepower of last year's Red Phoenix Bow was too weak! This year, make it burn with proper heat!\"\n\n\"**WAAAHHHHH!**\"\n\nIt was a starkly different atmosphere. The White Hammer smithy received boos and criticism, while the Black Anvil and Red Tongs smithies were showered with cheers. White was used to it, but the sting never truly faded. He bowed deeply to Grid.\n\n\"First of all, I'm ashamed and sorry for being unable to recognize you as a blacksmith. And thank you very much. You stopped me from doing something I would regret.\"\n\n\"There's no need to thank me—\" Grid started, then suddenly stopped himself.\n\n*This is the East Continent, not the West Continent. In this place, I'm an ordinary person, not a noble or the leader of Overgeared. There's no need to consider my social status. I can act according to my personality.*\n\nGrid changed what he was going to say.\n\n\"Yes, you should feel deep appreciation.\" He grinned.\n\nWhite couldn't help but ask, \"Why? Why are you helping me?\"\n\nGrid's answer was simple.\n\n\"Of course, it's for me. I have to stay here in Pangea for the moment. It'll be helpful if I can obtain someone's favor.\"\n\n\"...Why did you choose me?\"\n\n\"...\" Grid was caught off guard by the question.\n\n*Why did I come to the White Hammer smithy and help White?* There was no grand reason. He'd run into White because the White Hammer smithy was the closest. Then he'd received the quest, and the situation had snowballed from there.\n\nBut White was full of expectations. He'd been criticized after losing his father, living in failure's shadow—only for Grid to suddenly appear. White wanted to be special for Grid. *Until now, I've lived a poor life. But am I actually qualified to be the protagonist of my own story? Didn't the heavens drop Grid in front of me?*\n\nGrid looked at White's eyes, shining like lanterns in the darkness, and smiled. It was a smile filled with genuine warmth, not deception.\n\n\"You are special.\"\n\n*What if someone like me had appeared before my past self?* Grid projected his former struggles onto White.\n\n\"Only you are entitled to receive help from me. That's why I looked for you.\"\n\n\"Only... me...\" White's heart began to pound.\n\nThis was an unidentified blacksmith who'd completed the design of the Red Phoenix Bow in a short amount of time—a special existence that couldn't be measured. White felt his self-esteem begin to stir again, rising from the ashes of three years of failure.\n\nBut one concern weighed on his mind.\n\n*Even if the White Hammer smithy wins this competition, it won't be through our skills.* White was grateful for the help, but winning through another person's hands felt hollow.\n\n*What if I'm not qualified after winning the competition?* He would lose even the glory of the past that he wasn't worthy of.\n\n\"Thank you... I really appreciate it. But... I think it would be better not to receive your help in this competition.\"\n\nGrid looked at the struggling White and shook his head with a knowing grin.\n\n\"Don't think about complicated things and just accept. Didn't I say it? You're special. After the competition, you'll be qualified to be the winner.\"\n\n---\n\nThe number of times **Legendary Blacksmith's Creation** could be used increased by three every time the skill level of **Legendary Blacksmith's Craftsmanship** increased. Most skills were mastered at level 10. Grid's current skill level meant he could use Creation a total of thirty times.\n\n*I need to use the Legendary Blacksmith's Creation skill cautiously.* If he used it carelessly even once, he'd regret it for the rest of his life. Grid had used the Creation skill on the Red Phoenix Bow after careful consideration.\n\n*I definitely think it's worth it.*\n\nGrid lined up with the White Hammer blacksmiths and listened to the host announce the start of the competition. It was the ultimate joy to see a completed Red Phoenix Bow design in his mind's eye.\n\n*This is a bow for Jishuka.*\n\nIf he could arm thousands of soldiers with it in the future...\n\n*I'll be invincible.*\n\nGrid looked at the completed Red Phoenix Bow design one last time, then pulled something from his inventory. White wood. The white phosphorus wood.\n\n\"What...?\"\n\nThe tens of thousands of spectators and hundreds of blacksmiths all felt confusion ripple through the crowd.\n\n\"G-Grid...\" White's voice trembled with nerves.\n\nGrid had quickly attracted the attention of countless people. White couldn't help feeling anxious. However, Grid had been the center of attention numerous times since becoming Pagma's Descendant. He was used to it. He didn't feel nervous at all.\n\n\"Now,\" Grid declared, his voice carrying across the stadium, \"I shall begin.\""
}