{
  "id": 543,
  "title": "Chapter 543",
  "content": "# [Location of the Red Phoenix Bow]\n\n**Difficulty Level: SS**\n\n> Arube, believed murdered by the Master Daoist Priest, was actually alive.\n> \n> Arube belongs to a group commanded by the Master Daoist Priest.\n> \n> The monsters were summoned by the Master Priest, and now Pangea is isolated.\n> \n> Arube is planning to occupy Pangea with his fully controlled army of armored needles.\n> \n> Find the whereabouts of the Red Phoenix Bow stolen by Arube and the Master Daoist Priest!\n> \n> Arube has a strong desire to survive and will provide valuable information if captured alive!\n> \n> **Quest Clear Conditions:** The capture or death of Arube.\n> \n> **Quest Clear Rewards:**\n> \n> 1. Successfully capture Arube - Experience increased by 30%, quest chain continues to next stage.\n> 2. Arube's death - Gain two levels, quest chain ends permanently.\n\n*Amazing...*\n\nShortly after the poison coursed through his veins, Grid's heart raced as he reviewed the newly triggered quest. The entire chain had unfolded because of his actions—meeting Idan and completing the 'Find the Traces of the Great Hero!' quest, building a relationship with White and winning the blacksmithing competition, then venturing into the dungeon where he'd unexpectedly discovered the trapped treasure chest.\n\nThe 'Location of the Red Phoenix Bow' quest was the culmination of every decision he'd made. If he completed the linked quest chain, he could acquire the original Red Phoenix Bow—the strongest bow currently in existence.\n\n*Of course, my reproduction surpassed the original's specifications,* Grid thought. *But there are inherent limitations.*\n\nA reproduction could never exceed <span class=\"legendary\">Legendary</span> rating. The original Red Phoenix Bow, however, had a minimum rating of <span class=\"legendary\">Legendary</span>—and could potentially transcend even that. The system's absolute hierarchy ensured that no reproduction could truly match its source material.\n\nEven if—against all odds—the original proved statistically weaker than his reproduction, it still possessed something invaluable: the Red Phoenix Breath.\n\n> **[Red Phoenix's Breath]**\n>\n> A blessing of the Red Phoenix.\n>\n> Fire resistance increased by 30%.\n>\n> Can be infused into items to imbue them with the Red Phoenix's powerful aura.\n>\n> Can only be attached to items with a strong fire attribute.\n>\n> Weight: 2\n\nGrid had earned one as a reward for restoring the Red Phoenix Bow. If he obtained the original, he'd have a second. His fire resistance would reach 60% from possession alone, and if he used both as crafting materials, he could double the Red Phoenix Bow's power.\n\nHe knew how devastating that weapon could be. No one who hadn't wielded it could truly understand.\n\n\"Kugh...! Heh... heheheh!\"\n\nGrid's quiet laughter was almost manic as he sprang into action. Arube had appeared with his armored needles, taunting Sua and the Red Phoenix members with smug confidence.\n\n\"Item Combination.\"\n\n*Clang! Clang! Clang!*\n\nGrid summoned his portable furnace and began working immediately. The God Hands moved in perfect synchronization. Flames roared to life, fueled by white phosphorus wood. He laid Failure and Grid's Greatsword side by side on the anvil, striking them with rhythmic precision. The four Mjolnirs increased his blacksmithing speed exponentially, accelerating the Item Combination process.\n\n\"Is he insane? Hammering away without a care in the world... Has he lost his mind?\"\n\nArube finally noticed Grid and cursed in disbelief.\n\n\"Linked Kill Wave.\"\n\nGrid swung the combined weapon—Failure + Grid's Greatsword.\n\n*Kwa-kwa-kwa-kwa-kwa-kwa-kwa-kwa!*\n\nNamed NPCs were powerful adversaries. Arube, with his ability to control armored needles, would be even more formidable than the monsters he commanded. Grid calculated rapidly as the storm of sword energy engulfed his target.\n\n*Controlling undead means he must have a necromancer-type class. Even as a named NPC, he can't escape the class's inherent weaknesses—low defense and health. If 3 Joint Attacks activates or I land a critical hit, I need to follow up with Transcended Link after Linked Kill Wave to maintain control.*\n\nIf he chained it into Pinnacle Kill, there was a risk of killing Arube outright. Failure boasted the highest attack power of any weapon he possessed. Grid's Greatsword, while weaker in raw damage, added 20% skill damage. The combined power of these two greatswords was devastating.\n\nGrid would need to exercise restraint.\n\n\"Uh... *Uwaaaack!*\"\n\n*Pe-pe-pe-pe-pok!*\n\nGrid's smile widened as Arube's screams echoed through the chamber, each strike of Linked Kill Wave connecting with brutal efficiency.\n\n*I'll clear this SS grade quest in no time,* he thought triumphantly.\n\nHe activated Transcended Link, preparing to strike Arube again—\n\nThen froze like a statue.\n\n\"...Huh?\"\n\nArube's health gauge...\n\n\"It's... gone?\"\n\n*Gone.*\n\nGrid's mind flashed back to his university days—to that brutal winter when the boiler had been shut off because he'd spent his living expenses on gaming fees.\n\n*Why?*\n\nHe was a necromancer, yes, but how could his defense and health be *this* pathetically low? Confusion clouded Grid's thoughts.\n\n\"Uhhh...\"\n\n> [Arube has died.]\n\nArube's health had been completely depleted by Linked Kill Wave. His body dissolved into grey particles.\n\nNotification windows cascaded before Grid's eyes.\n\n> [Necromancer Arube has been defeated.]\n>\n> [89,005,310 experience acquired.]\n>\n> [Unknown Mark obtained.]\n>\n> [Arube's Ring acquired.]\n>\n> [The quest 'Location of the Red Phoenix Bow' has been terminated. All linked quests have been destroyed.]\n>\n> [Two levels gained from quest reward.]\n>\n> [Second class bonus applied. 24 stat points acquired.]\n>\n> [12 points have been forcibly invested into **Intelligence** due to the influence of the second class, Legendary Great Magician.]\n\n\"...Ah!\"\n\n*Thump.*\n\nGrid collapsed to a sitting position, exhaling heavily. The Red Phoenix Breath dwelling within the original Red Phoenix Bow—the only clue to that precious treasure's whereabouts—was now lost forever. His mental state felt bruised, battered.\n\nThe Red Phoenix members approached the dejected Grid.\n\n\"You've punished the villain who threatened Lady Sua and Pangea! You're the hero and savior of our kingdom!\"\n\n\"Grid! Please tell us if you encounter any trouble in the future! I'll endure any hardship for your sake!\"\n\n\"...\"\n\nHis affinity with the Red Phoenix members had skyrocketed. But Grid felt no satisfaction whatsoever. He turned to Sua with a blank expression.\n\n\"Necromancers... they have inherently weak bodies and stamina?\"\n\n\"That's correct. They're as fragile as children. But normally, they don't allow anyone close enough to strike them—they summon creatures far stronger than themselves for protection.\"\n\n\"...I see.\"\n\n\"Pangea's Duke of Virtue identified Arube's weakness precisely. Arube didn't anticipate a blacksmith attacking him and couldn't react in time.\"\n\n\"...Mm.\"\n\nGrid forced himself to shake off the gloomy mood. The unexpected quest hadn't yielded the optimal result, but he couldn't wallow in frustration forever.\n\n*Think positively.*\n\nHe'd gained two levels from defeating Arube. Additionally, he'd obtained the Unknown Mark and Arube's Ring—rewards he wouldn't have received if he'd captured Arube alive.\n\n*These are rewards from an SS grade quest. It's entirely possible they have tremendous value.*\n\nPerhaps their worth exceeded even the original Red Phoenix Bow. *Probably not,* he admitted internally. Still, Grid clung to that hope and prepared to use the Legendary Blacksmith's Appraisal skill to examine the Unknown Mark and Arube's Ring.\n\n*Pe-pe-pe-peng!*\n\nThe battle between the God Hands—transformed into copies of Failure—and the armored needles was intensifying. Initially, the God Hands had overwhelmed the creatures with their superior power. But gradually, the silver threads had turned the tide. Now the armored needles were advancing on Grid and the Red Phoenix members.\n\n\"First, I need to deal with these things.\"\n\nGrid postponed his appraisal and fixed the armored needles with a fierce glare. He had convenient targets to vent his frustration on.\n\n*I'll exterminate every last one before leaving this dungeon.*\n\nBesides, it was almost time to eat at Idan's restaurant. Grid wanted to grow stronger, but his spirit suffered tremendously every time he endured Idan's cooking. It was agonizing, brutal work. His motivation burned hot for multiple reasons.\n\nSua's pale face flushed as she watched him.\n\n\"Wow... You never run out of energy.\"\n\n\"...?\"\n\nWhy was Sua's face suddenly red? Grid didn't want to know. No—he was *afraid* to know. He sensed that understanding her thoughts would corrupt him somehow.\n\n***\n\nImmediately after seizing the fortified city of Patrian and securing Earl Ashur's allegiance, the Eternal Kingdom declared Grid a traitor. He was stripped of all authority and status within the kingdom, and his territories were marked for reclamation.\n\nThe first target was naturally Cork Island. The Eternal Kingdom's strategists judged it the easiest to recapture since it was separated from Reidan, Patrian, and Borneo by considerable distance.\n\nBut reality had proven otherwise. Two naval divisions had already failed to occupy Cork Island.\n\nAdmiral Lebuck was losing his mind after receiving the latest reports.\n\n\"The distance between Reidan and Cork Island is at least fifteen days by forced march, with kingdom fortresses positioned along every major route. It should be impossible for the rebels to reinforce Cork Island. So how is Cork Island repelling our offensive?\"\n\n\"The land is abundant—food supplies are adequate. The rebels stationed elite troops in advance. As an island fortress, they anticipated naval assault.\"\n\nThe explanation was logical. Lebuck made his decision.\n\n\"We need to change our approach.\"\n\n*Tak.*\n\nLebuck's finger stabbed at the northern coast of Cork Island on the map spread before him. Cork Island had originally been Eternal Kingdom territory—Lebuck knew every detail of its geography.\n\n\"Once night falls, deploy the diving rats to this location.\"\n\nDiving rats. Their official unit designation was R77—the Eternal Kingdom Navy's special operations force. Tonight, they would dive beneath the waves, approach Cork Island's perimeter undetected, navigate the secret tunnels through the island's mines, and infiltrate Cork Castle from within.\n\n\"Decapitate the rebel leadership. When the fortress falls into chaos, our fleet will strike.\"\n\nThe rebels had controlled Cork Island for only a few years. The likelihood of them discovering the secret tunnels that existed within Cork Island's mines was negligible.\n\n\"Tomorrow, Cork Island returns to the Eternal Kingdom.\"\n\nIt was a winning strategy, achievable only through intimate knowledge of Cork Island's geography. Lebuck brimmed with confidence."
}