{
  "id": 546,
  "title": "Chapter 546",
  "content": "**Capture or kill Arube?**\n\nIf a hundred players received the 'Location of the Red Phoenix Bow' quest, every single one would choose to capture Arube. The logic was obvious—capturing him meant winning the Red Phoenix Bow, one of the strongest battle gear pieces in existence. No one in their right mind would sacrifice that reward for a mere level increase.\n\n*...I'm a complete idiot.*\n\nHow many of Satisfy's two billion users could claim that being too powerful was actually a problem? Grid had accidentally killed Arube. He'd gained two levels and the man's items, but satisfaction eluded him.\n\n\"Damn it.\"\n\nHis shoulders sagged as he activated Legendary Blacksmith's Appraisal on the Unknown Mark and Arube's Ring. He kept his expectations low—these items wouldn't have appeared unless Arube died, which suggested they probably weren't spectacular.\n\n\"Still, he was a named NPC, so they shouldn't be complete garbage... What?\"\n\nGrid froze mid-step, his body going rigid as he read the appraisal results.\n\n> [The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\n> [Unknown Mark]\n> \n> A black sun mark.\n> The usage is unknown.\n\n> [You have discovered a hidden feature in the item!]\n\n> [Mark of Evolution]\n> \n> Rating: Unique\n> \n> A functional marker developed by an alchemy facility.\n> \n> If this mark is attached to your body, one of your **strength**, **agility**, **stamina**, or **intelligence** stats will increase by 200.\n> \n> User Restriction: Level 200 or higher.\n> Weight: 0\n\n\"What the hell...\"\n\nAn item that boosted stats when attached to the body? By *two hundred points?*\n\n\"This is incredible!\"\n\nThe mark wasn't trash at all—it had tremendous value. But what excited Grid even more than the item itself was what it represented. The possibilities of alchemy stretched before him like an open road.\n\n*Could Reidan's alchemy facility eventually produce these marks? Rabbit, please don't let me down.*\n\nHe offered a silent prayer for his administrator's success before examining Arube's Ring. His enthusiasm dimmed.\n\n> [Arube's Ring]\n> \n> Rating: Unique\n> \n> A ring completed after many experiments by Arube, who sought to harness the abilities of the armored needles.\n> \n> When worn, five or fewer strands of silver thread can be twisted together into the desired shape.\n> \n> Conditions of Use: None.\n> Weight: 4\n\n\"...\"\n\nThe silver thread's item description specified that at least **2,500 Dexterity** was required to control five or fewer strands. In other words, Arube's Ring boosted the wearer's dexterity to that threshold. For Grid, whose dexterity already exceeded 3,700, it was worthless.\n\n\"Great. Just great.\"\n\nGrid grumbled under his breath. Any ordinary player would be ecstatic about Arube's Ring—he was simply the only person who could freely manipulate silver thread without it. From an objective standpoint, these two items rivaled the Red Phoenix Bow in value. The problem was that Grid couldn't fully benefit from them.\n\n\"...Wait. Actually, maybe I can use this.\"\n\nThe Overgeared Skeletons came to mind—those rare undead that could equip items, unlike normal skeleton summons. What would happen if they wore Arube's Ring?\n\n*They could provide actual combat support.*\n\nSilver thread's applications were limitless. If the Overgeared Skeletons could use it to entangle enemies' legs, even temporarily, it would prove invaluable. The thread's random damage had no level-based restrictions—level 1 skeletons wielding it might damage level 100 monsters.\n\nSure, the minimum damage was only 100, and that result could appear 999 out of 1,000 times. Still, his expectations for the skeletons rose dramatically.\n\n\"Heh...\"\n\nGrid couldn't suppress his grin. Joy bubbled through him like champagne. Riding this momentum, he retrieved the Mark of Evolution to increase his stats. He wanted either **Intelligence** or **Agility**—agility would balance his strength ratio, while intelligence would unlock more of Braham's magic.\n\n*Stamina wouldn't be bad either. More health and defense means better survivability. I could use Blackening more often.*\n\nAnything but **Strength**. That stat was already overflowing.\n\n*There's a 75% chance of getting what I want.*\n\nOnly a 25% chance of bad luck. Grid trusted in probability as he placed the black sun mark on the back of his hand.\n\n*Tsssss!*\n\n\"Ngh.\"\n\nA stinging sensation made him wince, but his smile remained. Agility, stamina, or intelligence.\n\n*Which of the three will it be?*\n\n> [The Mark of Evolution has been placed.]\n\n> [**Strength** has risen by 200.]\n\n\"...You've got to be kidding me.\"\n\nHis smile vanished instantly. A 75% chance of getting what he wanted, a 25% chance of failure—and this happened?\n\n\"Why the hell would it be the 25%?\"\n\nGrid was now convinced that some demon had invented probability.\n\n\"Can I even reverse this?\"\n\n**Strength** was ideal for physical damage dealers—it boosted attack power and provided some health. But Grid knew he'd be far more effective with a 1:1 **Strength** to **Agility** ratio. Widening that gap further would hurt his combat efficiency.\n\n\"Damn it... Intelligence would've been so much better.\"\n\nWhat blacksmith in their right mind prioritized **Intelligence**? This was absurd. Grid closed his eyes, took a deep breath, and examined the mark's information to check if he could reapply it.\n\n> [Mark of Evolution]\n> \n> Status: Strength.\n> \n> 200 **Strength** is added.\n> \n> You can try changing the stat.\n> \n> However, changing the stats will cause one of your stats to permanently drop by 5.\n\n\"...\"\n\nLose 5 stat points permanently. A brutal penalty—half the value of an elixir, equivalent to at least five of Idan's dishes. And Idan's food didn't even guarantee stat increases every time.\n\n*Why does it have to be like this?*\n\nSweat trickled down Grid's back as he wrestled with the decision. Accept the inefficient **Strength** increase? Or sacrifice 5 stat points for a more impactful boost? His deliberation lasted mere seconds.\n\n*Anything except Strength. It's worth the cost.*\n\nThe odds were still 75%. Plus, Grid possessed an unusually diverse stat pool—**Strength**, **Stamina**, **Intelligence**, **Agility**, **Persistence**, **Composure**, **Indomitable**, **Dignity**, **Insight**, **Courage**, **Charm**, **Demonic Power**, **Good Luck**—far more variety than most players. Gaining 200 points in a useful stat in exchange for losing 5 elsewhere was a bargain.\n\n*Especially if I lose points from Composure or Demonic Power.*\n\n**Composure** reduced abnormal status effects and accelerated recovery—fairly useless for someone with status immunity like Grid. As for **Demonic Power**, he dreaded what would happen if that stat climbed too high.\n\nGrid prayed fervently—*let me gain Agility or Intelligence by sacrificing one of those two stats!*\n\n\"Change mark.\"\n\n> [The location of the mark can be reset.]\n\n*Pop!*\n\nThe black sun mark lifted from his hand, hovering in the air. Someone concerned with appearances might attach it to their chest or neck. Grid couldn't care less about aesthetics.\n\n*Wouldn't sticking it on my head increase the chance of raising Intelligence?*\n\nFollowing this bizarre logic, Grid pressed the mark to the center of his forehead.\n\n> [The Mark of Evolution is being reconfigured.]\n\n> [5 **Good Luck** stats have disappeared.]\n\n> [**Strength** has risen by 200.]\n\n\"Are you *serious?!*\"\n\nHe'd lost his most precious **Good Luck** stat, and **Strength** increased *again?* Grid's composure shattered. Without thinking, he ripped the mark from his forehead and slapped it onto his chest, just below his collarbone. The dark sun mark visible through his collar actually looked decent.\n\n> [The Mark of Evolution is being reconfigured.]\n\n> [5 **Good Luck** stats have disappeared.]\n\n> [**Stamina** has risen by 200.]\n\n\"...\"\n\nAt level 300, each point of **Stamina** provided 25 health and 0.9 defense. The 200-point increase gave Grid an extra 5,000 health and solid defense—certainly not bad. Still, it paled compared to **Agility**, which would dramatically improve his combat ability, or **Intelligence**, which would unlock new magic.\n\nGrid felt a twinge of disappointment, but what could he do?\n\n\"I guess... I should be satisfied with this.\"\n\nHe was too terrified to try again. After losing 10 points of **Good Luck**, Grid trudged toward Idan's restaurant like a beaten dog.\n\n***\n\n\"You're here!\"\n\nAs usual, the restaurant stood empty.\n\nIdan greeted Grid from his seat, his demeanor completely different from their last meeting.\n\n\"You're a blacksmith? I was overjoyed when I heard you won the championship!\"\n\n\"Idan...\"\n\nHe was happy Grid won? After the emotional devastation of losing his **Good Luck** stat, the warmth touched something in Grid's chest. Despite being an eccentric chef, Idan's genuine pleasure was—\n\n\"Hahaha! If I announce that the smithy competition winner frequents my restaurant, customers will flood through the door!\"\n\n\"...Just give me food.\"\n\nGrid slumped into a chair. Yang Fei approached with her usual expressionless face and set down a cup of citron tea.\n\n\"Today's tea is complimentary. I'm just a poor girl, but I want to congratulate you on your victory. Though I'll have to skip dinner tonight.\"\n\nHer expression remained completely neutral despite the self-deprecating words. Grid knew Yang Fei supported her siblings and felt a pang of guilt. But he didn't refuse the free service.\n\n*I'll give her a proper salary when I bring her to the West Continent anyway.*\n\nGrid rationalized his acceptance and savored the tea. Yang Fei watched him for a moment, then carefully lifted her skirt.\n\n\"Um... Today my thighs are stiff.\"\n\nHer pale face flushed crimson. Yang Fei was clearly mortified—she knew perfectly well that Grid's \"massage\" wasn't simply a massage.\n\n*This girl...*\n\nHer proactive approach caught him off guard. Would Sua be the same way?\n\n*Are East Continent women just... different?*\n\nGrid kneaded Yang Fei's pale thighs with skilled fingers, feeling the soft flesh yield beneath his touch.\n\n\"Ngh.\"\n\nYang Fei's legs buckled, and she sank onto the bench. Grid found her reddened ears endearing and began working more earnestly.\n\n> [Affinity with Yang Fei has risen.]\n\n> [Affinity with Yang Fei has risen.]\n\n> [**Dexterity** has increased by 1.]\n\nGrid thought to himself, with complete seriousness, that he'd never starve as long as he had these fingers."
}