{
  "id": 548,
  "title": "Chapter 548",
  "content": "# Reclaim Borneo\n\n> **[Reclaim Borneo]**\n> \n> **Difficulty:** Varies based on competency.\n> \n> Borneo has been captured by the Overgeared Guild.\n> \n> Borneo is a fortified city on the border of the Eternal Kingdom and serves as a vital defensive stronghold for the Gauss Kingdom.\n> \n> King Cactus commands you:\n> \n> Retake Borneo and annihilate the malicious invaders who dared violate the sovereignty of the Gauss Kingdom. Those who prove their loyalty shall be justly rewarded!\n> \n> **User Restriction:** Level 130 or higher.\n> \n> **Victory Conditions:** Recapture Borneo within three days before food supplies run out.\n> \n> **Victory Rewards:** +1 Level. +10% experience gain to all skills. One <span class=\"unique\">Unique-rated weapon</span> and one <span class=\"epic\">Epic-rated armor</span>.\n> \n> *Additional compensation will be awarded for defeating NPCs or players belonging to Overgeared.*\n\n\"This is incredible. The rewards rival that SS-grade quest I saw broadcasted.\"\n\n\"It's a war zone, though. I'd love those rewards, but with Overgeared members running rampant? No thanks.\"\n\n\"Well, there's no such thing as a quest with a 100% success rate.\"\n\nThe Gauss Kingdom occupied an awkward position. Blocked from the central continent by the Eternal Kingdom, Gauss remained more frontier outpost than true nation—a kingdom for casual players seeking a low-stakes experience. Few serious users bothered establishing themselves here.\n\nBut the Overgeared Guild numbered fewer than 400 members. Combined with their auxiliary forces, they fielded a mere 6,000 troops total. Meanwhile, over 210,000 Gauss Kingdom players exceeded level 130. Even if only one-tenth participated, they'd still outnumber Overgeared two-to-one. Intelligence reports confirmed fewer than 1,000 Overgeared troops stationed at Borneo specifically. The three-day food restriction posed no real obstacle.\n\n*'Light users dominate Gauss. Quest participation rates will be low.'*\n\n*'Still... the numbers overwhelmingly favor us.'*\n\nGauss players believed retaking Borneo would be straightforward—a simple matter of rolling over the defenders like a bulldozer.\n\nReality proved otherwise.\n\n*Puk! Puuoooook!*\n\n\"Keok!\"\n\n\"Kyaak!\"\n\nFortified cities earned their designation for good reason. Borneo in particular had been engineered with Great Magician Ashur as the hypothetical enemy. Solid walls neutralized magical bombardment. The fortress shrugged off Gauss Kingdom's arcane artillery as if swatting flies.\n\nThen there were the archers.\n\n**Level 180** NPC archers lined the ramparts—a testament to Overgeared's investment in military infrastructure. Yet the soldiers' levels weren't even the core issue. A more fundamental problem revealed itself as battle progressed.\n\nThe Gauss players finally understood why the guild bore its name.\n\n\"Crazy...! The soldiers' attack power is absurd! Kuaaaak!\"\n\nArrows from Gauss players and soldiers bounced harmlessly off Overgeared troops' armor. Meanwhile, Overgeared arrows pierced their defenses like hot knives through butter. The sheer quality of equipment was preposterous—gear that ordinarily would never be standard-issue for common soldiers.\n\nEven the Saharan Empire couldn't match this. Mass-producing such equipment required not only enormous capital, but also blacksmiths with extraordinary skill.\n\n\"This is Grid's power...!\"\n\nGauss players felt haunted. Grid himself hadn't appeared on the battlefield, yet his presence loomed over everything.\n\n\"Shoot! Keep firing!\"\n\nOvergeared soldiers maintained relentless volleys. Under Piaro and Asmophel's rigorous training, these elite troops had honed their skills and stamina to razor sharpness. They'd learned courage from Jude, archery from Jishuka. Fear held no sway over them as they aimed jaffa-tipped arrows at the enemy. Combined with Grid's Bow design, they demonstrated overwhelming offensive power. Their projectiles punched through shields, helmets, and armor without pause.\n\nGauss soldiers couldn't reach Borneo's walls. Rivers of blood seized ankles like sucking swamps, transforming the battlefield into a charnel house. Numerical superiority evaporated under the onslaught.\n\n\"Kukukuk! Kuhahahahat!\"\n\nLaughter rang across the killing field. The crimson rivers responded, writhing with unnatural life.\n\nBlood Warrior Katz had entered the stage—a class that approached legendary power when surrounded by sufficient carnage.\n\n\"Be grateful your worthless blood serves me. **Blood Lane**.\"\n\n*Kuooooooh!*\n\nBlood from the battlefield began rising skyward, defying gravity like reverse rainfall. The red 'rain' ascended, causing Gauss soldiers to freeze in superstitious terror.\n\n\"Kukukuk! You'll all die here today.\"\n\n*Swaaaaaah!*\n\nWith Katz's declaration, the airborne blood plummeted onto the Gauss forces. Chaos erupted. Soldiers' screams echoed endlessly as the blood they shed became Katz's weapons, multiplying casualties. The nightmare fed upon itself in an infinite loop.\n\n\"Kukuk! Kuhahahahahat!\"\n\nUnlike the Eternal Kingdom—which had to disperse forces between Bairan and Patrian—Gauss Kingdom concentrated everything on Borneo. Unfortunately for them, they'd encountered a blood demon. Their vanguard crumbled.\n\nBut these were merely scouts. The second wave would arrive in two days with superior numbers and quality. More concerning was Soul Predator Seuron's inclusion in that force—an existence who, like Katz, wielded absolute power on large-scale battlefields.\n\n\"I have to repay Grid.\"\n\n*Pepepepeng!*\n\nSeuron manifested dozens of soul spears by capturing the spirits of the fallen, then massacred Overgeared soldiers on the ramparts.\n\n\"That Lauel... He told me to hold out for at least four days?\"\n\nThe smile had vanished from Katz's face.\n\n---\n\n\"Do you see?! This is the largest war since Satisfy launched!\"\n\nThousands of soldiers and NPCs killing and dying. Aerial footage of the carnage broadcast scenes more fierce and exhilarating than any raid ever recorded. Rather than recoiling from the horrors, viewers' blood boiled with excitement.\n\nConsider it! What other game in existence could recreate warfare on this scale? Before Satisfy, the MMORPG L.T.S. had accommodated a mere 2,000 participants in its largest battles.\n\n—*Patrian Fortress is insane... 15,000 people fighting there;;*\n\n—*Borneo has 20,000 ㅋㅋ*\n\n—*Lim Cheolho said it repeatedly.*\n\n—*Satisfy isn't a game—it's another world. Therefore, no limitations exist.*\n\n—*Virtual reality implementation shouldn't even be possible. Lim Cheolho must be an alien.*\n\nViewers seethed with excitement, grateful to be born in an era that allowed them to experience Satisfy. They envied the Overgeared members commanding thousands, struggling for supremacy. They longed to stand beside them.\n\nThen—\n\n—*Why isn't Grid visible?*\n\n—*I saw he gained two levels in a few hours the other day. Either it's a bug or he's on some major quest.*\n\n—*Wow... leaving guild members alone on the battlefield while power-leveling ㅡㅡ;;*\n\n—*Or maybe something went wrong?*\n\nPublic opinion spiraled wildly.\n\nAs the Overgeared Guild gradually weakened on the war's third day, speculation about Grid's absence ran rampant. Grid was trash. Grid quit Satisfy. Grid got kicked from Overgeared. Traffic accident. Etc.\n\nMost conclusions were baseless leaps. The media behaved similarly. Second and third-tier outlets prioritized attention-grabbing over factual reporting, publishing speculative articles without verification.\n\n**『I suspect Grid is trapped somewhere.』**\n\n**『Wasn't there an accident in Gangnam's XX District where a supercar hit a pole? Rumors suggest Grid owned that vehicle...』**\n\n**『Grid probably fled. The Overgeared Guild currently blocks enemies by emphasizing individual strength, but how long can this last? The guild will collapse within a day or two. They'll lose all troops and territories, going bankrupt. Grid undoubtedly knows there's no hope and abandoned everyone...』**\n\nMedia thrived on aggravation. They poked at everything, manufacturing scandals and broadcasting them worldwide. The defense of Overgeared's three territories commanded global interest, and related broadcasts secured astronomical ratings.\n\nThen—\n\n『Everyone, can you hear me?』\n\nAt Patrian, the fortified city—\n\nThe world's premiere gaming streamer Bunny Bunny appeared on a wyvern.\n\n*Lalalalala~*\n\nThe most powerful and brilliant fire wyvern. As he shouted and the mount unleashed its breath, everyone struggling on the battlefield—and every broadcasting camera—naturally focused on him. Satisfied, Bunny Bunny opened his mouth. His voice amplified across the entire battlefield.\n\n『This is a message from Grid! I will kill anyone who hasn't retreated when I arrive in one minute!』\n\n\"...\"\n\nAnyone participating in war accepted death as possibility. A mere threat wouldn't trigger mass retreat.\n\n\"Hah, that's hilarious.\"\n\n\"Arrogant bastard! If he can kill us, let him come try!\"\n\n\"Kill me! I'll just resurrect and return!\"\n\nEternal Kingdom players didn't flinch. Common knowledge held that even exceptional individuals couldn't overturn wars through personal power alone. Just look at Jishuka—she'd massacred thousands since the war began, yet now her momentum flagged. Exhaustion depleted her stamina; her arrow volleys had decreased significantly.\n\nGrid would be no different. Everyone assumed this.\n\nBunny Bunny laughed merrily atop his wyvern.\n\n*'Good, good. This wouldn't make compelling content if they retreated easily.'*\n\nLet them endure. Then Grid would slaughter them, boosting viewership exponentially. Bunny Bunny began his countdown.\n\n『You have 30 seconds.』\n\n\"Bah! Let him come!\"\n\n『20 seconds.』\n\n\"How can Grid handle all of us alone?\"\n\n『10 seconds.』\n\n9 seconds. 8 seconds. 7 seconds. 6 seconds...\n\nSilence fell over the battlefield at 5 seconds. Eternal players who'd been boasting moments ago swallowed hard. They harbored no doubt about handling Grid, but heavy sacrifices were inevitable.\n\nFinally—\n\n『0 seconds! Now God Grid will emerge!』\n\nThe instant Bunny Bunny announced Grid's appearance, viewership for his stream and all related broadcasts peaked. Expectations soared. Grid would descend like a hurricane and annihilate his enemies!\n\nHowever—\n\n\"...He's not coming?\"\n\n『...』\n\nGrid didn't appear. Bunny Bunny had become the boy who cried wolf.\n\nMeanwhile, in Pangea on the East Continent—\n\n\"How do I get back?\"\n\nGrid's frustration mounted as he realized he had no method of returning to the West Continent."
}