{
  "id": 549,
  "title": "Chapter 549",
  "content": "# Return Scrolls\n\nA return scroll.\n\nAn everyday necessity for anyone who played Satisfy. Meet certain conditions, and the scroll would transport you to your designated return point—the same location you'd respawn after death. Grid carried them as a matter of routine, just like everyone else.\n\nHis resurrection point was set to Reidan. Not long ago, he'd considered changing it to Pangea. Then he'd stopped, realizing that would sever his path back to Reidan. After all, Grid had assumed he could return to Reidan—to the West Continent itself—whenever he activated a return scroll.\n\nFrom his perspective, it made perfect sense.\n\nThat conviction now filled him with dread.\n\n> [The Return Scroll doesn't work. Intercontinental movement isn't possible with the formula inscribed on this scroll.]\n\n\"...What?\"\n\nIntercontinental movement was *impossible*? The notification alone was enough to rattle him.\n\n\"Wait... hold on.\"\n\nGrid's expression went blank. A single phrase echoed through his mind, over and over.\n\n*Shit!*\n\nOne day ago in the real world—three days in game time—Grid had called Bunny Bunny with instructions. He would return to the West Continent the moment he cleared a certain quest. Bunny Bunny would announce his return to the world at the appointed time. Every eye would turn toward him. As always, Grid would make his entrance at the perfect dramatic moment and leave the world in awe.\n\nThe promised time had arrived. Grid had completed the **Subjugate the Armored Needles (2)** quest and acquired five additional strands of silver thread. He was completely prepared to make his move on the world stage—to condemn the enemies who dared invade his territory and threaten his precious comrades.\n\nBut now?\n\n\"The return scroll doesn't work!\"\n\nSweat beaded on Grid's forehead. Inside his consciousness, Braham's irritation flared.\n\n*'How did you even reach the East Continent? Wasn't it with an intercontinental movement scroll? Obviously, you'd need another intercontinental movement scroll to return.'*\n\n\"...Intercontinental movement scroll? Where the hell do I get one of those?\"\n\n*'From the sage who gave you the scroll to the East Continent in the first place.'*\n\n\"...\"\n\nGrid's mind flashed back to that moment—when he'd received the East Continent Movement Scroll from Sticks. He remembered the shock on Sticks' face when Grid had torn the scroll open and activated it immediately upon receiving it.\n\nNow he understood why.\n\n*'He was stunned because I left without taking a return scroll back to the West Continent...'*\n\n*'...'*\n\n\"...\"\n\nThere was nothing more to say. Grid sighed, resenting his own impatience.\n\n*'I need to stay calm and cautious instead of making these constant mistakes...!'*\n\nWhat a pathetic fool he was! Grid tugged at his hair in frustration. Then Braham spoke up.\n\n*'It's true that you're pathetic, but must you blame yourself so harshly? Anyone can make a mistake—unless they're a dragon or a god. Even great demons and geniuses aren't exempt.'*\n\n\"...Are you trying to *comfort* me right now?\"\n\nBraham—whose ego reached the heavens—was offering comfort? Grid doubted his own ears. Braham's voice rose defensively.\n\n*'W-What?! That's not it! Instead of wallowing in self-defeat, find a way out of this situation! It's frustrating to watch!'*\n\n\"Ah, right... I don't have time for this.\"\n\nNow wasn't the moment to lose himself in despair. Overgeared was limited in numbers while their enemies were endless. The Overgeared members would eventually reach their breaking point and lose all their territory. Grid had to find a way back to the West Continent—and fast.\n\nThe solution came to him quickly. In fact, it wasn't difficult.\n\n\"A simple phone call should do it.\"\n\nCommunication between the East and West Continents was blocked. Grid couldn't send whispers to players on the West Continent, and even his **Summoning Knights** skill was restricted. He logged out and placed an international call to Lauel.\n\n—*Master, I'm honored by your call. However, I'm still in-game and quite occupied. I genuinely don't have a spare moment.*\n\n\"...\"\n\n—*I won't forget today's failure until my life ends and my bones turn to dust. I'll carry this shame for the rest of my days.*\n\nLauel had worked hard to learn Korean, but his dramatic phrasing still came out absurd. Grid's brow furrowed.\n\n\"If you're that busy, I'll make this quick. Get a West Continent Movement Scroll from Sticks and come pick me up.\"\n\n—*Huh? Don't tell me you left for the East Continent without a return scroll?*\n\n\"I did.\"\n\n—*Kuku...! Oh my. Oh my. You truly are remarkable, Master. It takes someone special to escape the worthless prison we call common sense.*\n\n\"...Just hang up, log back in, and come get me.\"\n\n—*I'm sorry, but that's impossible.*\n\n\"What? Ah, I guess that makes sense—you're in the middle of a war. If you're too busy, send someone else.\"\n\n—*No. I'm your servant. I won't disobey your orders under any circumstances. The issue is that reaching the East Continent is impossible because Sticks isn't available.*\n\nWhat was he talking about?\n\n\"What do you mean he's not available? Where is Sticks?\"\n\n—*Sticks possesses not only vast knowledge but exceptional magical ability. I've asked him to handle several critical tasks.*\n\n\"What tasks?\"\n\n—*I've ordered him to take command of the Ul Clan—including Princess Hwarin—and lead them in an assault on the Eternal army's rear. After that, he's to proceed to Siren.*\n\nThe Ul Clan. A minority race Grid had rescued from the Empire in the past. They possessed exceptional magical talent, especially the royal family. If Sticks led them, their abilities would reach new heights. Grid grasped half of Lauel's strategy, but the other half eluded him.\n\n\"Why send them to Siren afterward?\"\n\n—*To summon someone who's currently farming in the sea.*\n\nThere was only one person Grid knew who would farm in the ocean.\n\n\"Piaro?\"\n\n—*Correct.*\n\nOne of the fundamental differences between players and NPCs was the ability to whisper. NPCs couldn't use that function. To communicate with them required old-fashioned methods—letters or magic communication devices. Siren wasn't a developed city with advanced infrastructure. Grid immediately understood why Lauel had sent Sticks to fetch Piaro personally.\n\n\"The most efficient approach would be for Sticks to use teleportation and bring Piaro back as quickly as possible... but won't that leave Siren vulnerable if Piaro abandons his post?\"\n\nGrid had stationed Piaro in Siren for more than just farming. His primary purpose was protecting the city from Blood Carnival. Lauel's distinctive laugh echoed through the phone.\n\n—*Kuk...! Kukuk! You're becoming softer, aren't you? Master, let me remind you *why* we need to protect Siren.*\n\n\"To honor the treaty...\"\n\n—*Sorry to interrupt, but why did we form an alliance with Siren in the first place?*\n\n\"For the sake of our development.\"\n\n—*Exactly. How can we prioritize Siren when we're on the verge of destruction ourselves?*\n\n\"...\"\n\n—*We can't afford to worry about Siren's wellbeing right now. The Water Clan of Siren will join this war to assist us. Just as we have an obligation to protect their territory, they have an obligation to defend ours.*\n\nHe was right. But mobilizing the Water Clan when they still hadn't recovered from their previous war seemed incredibly harsh. The more troubling aspect, though...\n\n\"Lauel, you've been planning to provoke hostilities with Eternal long before we ever allied with Siren, haven't you? Doesn't that make Siren a victim from the start?\"\n\n—*I can't agree with that assessment. I'm not treating them as expendable arrows—they'll function as a proper army. Human casualties will be far higher than theirs. Besides, there's no guarantee Blood Carnival will target Siren again.*\n\n\"Hmm... I suppose so.\"\n\nGrid couldn't denounce or refute Lauel's logic. He'd granted Lauel full authority precisely because he trusted him. From the perspective of protecting Overgeared, Lauel's plans and strategies were justified. Lauel prepared to disconnect.\n\n—*I've been away for four minutes. This will create confusion in the command structure. I need to return to the game immediately.*\n\n\"Understood. You've done well. Please send Sticks to me as soon as possible. Tell him to meet me at the White Hammer smithy in Pangea.\"\n\n—*Yes. He'll probably arrive in five days.*\n\nThe call ended.\n\nThe conclusion?\n\n\"Bunny Bunny... I'm sorry for making you a liar...\"\n\nGrid's triumphant return to the West Continent had failed. The current Grid possessed no means of helping his comrades, who were facing the greatest crisis since Overgeared's founding. Anxiety gnawed at him.\n\n\"Stay calm. Stay careful.\"\n\nGrid steadied his mind as much as possible.\n\nFirst, he connected to the Internet and studied war footage, analyzing his teammates' equipment from a blacksmith's perspective.\n\n*'Yura changed her main weapon—that's good. I can finally craft something proper for her. Pon is still wearing the armor I made five months ago? His luck isn't as terrible as mine used to be, but it's not great either. Regas will soon exceed the durability limits on those gauntlets—he keeps blocking attacks with his bare hands...'*\n\nOverall, the Overgeared members' equipment was in poor condition. The result of Grid focusing on personal growth for too long.\n\n\"Among them, the one in most urgent need of new equipment is...\"\n\nGrid watched footage from the Patrian battlefield. In the video, a beautiful woman with golden skin struggled against overwhelming odds. Grid examined the bow she wielded with a critical eye.\n\n\"Jishuka, I'll start with you.\"\n\n*Tap. Tap.*\n\nGrid stood. He entered his capsule and logged into Satisfy, heading straight for the White Hammer smithy. The blacksmiths there greeted the hero who'd helped them win the competition with enthusiasm. They possessed everything Grid needed to forge a masterpiece.\n\n*Ttang! Ttang!*\n\nThe furnace devoured white phosphorus wood, flames roaring to peak intensity. Grid crouched before the searing heat, hammer rising and falling against the anvil without pause. His target: the Red Phoenix Breath, which gleamed like a perfect ruby.\n\n*'This can be integrated into an item...'*\n\nGrid believed it was possible to refine the ruby, making it burn even more intensely. The stronger the breath, the more powerful the Red Phoenix Bow would become. With that in mind, Grid attempted to smelt the Red Phoenix Breath itself.\n\nBut the breath was the very essence of the Red Phoenix—a divine creature. Handling it completely, even with legendary techniques, proved extraordinarily difficult. This smelting operation was the hardest challenge Grid had faced since becoming Pagma's Descendant. He spent at least four days hammering relentlessly at the anvil.\n\nAny ordinary person would have reached the limits of their patience long ago.\n\nBut Grid brimmed with fierce ambition.\n\n*'It's an honor to work with materials this exceptional.'*\n\n*Ttang! Ttang!*\n\nThe rhythmic sound of Grid's hammer returned the atmosphere of the White Hammer smithy to its absolute peak."
}