{
  "id": 55,
  "title": "Chapter 55",
  "content": "# Chapter 55\n\nI spent the entire last month locked in Khan's smithy. Every login, every logout—nothing existed beyond these four walls and the heat of the forge. The repetitive clang of hammer on metal became my heartbeat. Somewhere in that monotony, patterns emerged. Truths I'd only half-grasped before crystallized into certainty.\n\nFirst: grinding the same item over and over was a dead end. The skill experience crawled when I stuck to one thing. Variety mattered. Different items, different gains.\n\nSecond: better materials meant better odds. Two iron swords from the same recipe, but the one forged with premium metal had a real shot at <span class=\"rarity-rare\">Rare</span> rating. The garbage-tier ore? Normal. Always normal.\n\nThird: time investment counted. Even with identical materials and methods, the pieces I obsessed over—the ones I poured hours into—those climbed higher up the rating ladder.\n\n*Three hours for that Unique dagger. Three goddamn hours. And I got lucky.*\n\nIf I wanted anything above <span class=\"rarity-rare\">Rare</span>, I needed at least thirty minutes minimum. My daily output was pitiful. Stats wouldn't come easy.\n\nFourth: **Stamina** mattered as much as **Strength** and **Dexterity**. The anvil didn't care about my class. The hammer was heavy. The ores were heavier. Working efficiently meant muscle. Not burning out after two hours meant endurance.\n\nAt least my inflated **Strength** and **Stamina** finally served a purpose.\n\nKhan wiped sweat from his brow, leaning against the workbench. \"Pant... pant... aren't you still young? You shouldn't be this tireless.\"\n\nWhile the old man rested between each piece, I kept going. No breaks. Just production. Seventy-three items in thirty days. More than two per day, on average. Eleven came out <span class=\"rarity-rare\">Rare</span>. Three hit <span class=\"rarity-epic\">Epic</span>.\n\nTotal stat gain: **+34** points across the board.\n\nI had eleven stats now. **Strength**, **Stamina**, **Agility**, **Intelligence**, **Dexterity**, **Persistence**, **Composure**, **Indomitable**, **Dignity**, **Insight**, **Courage**. Thirty-four points times eleven stats equals three hundred seventy-four total points. Equivalent to thirty-seven levels.\n\nAnd I was pissed.\n\n*Seventy-three items. Minimum six hours each. The best materials I could afford. Not one Unique. Not one Legendary. What the hell is this?*\n\nThree <span class=\"rarity-epic\">Epic</span> pieces felt like a slap in the face. Every time I started a new project, I prayed. *Please. Just one Unique. One.* The system answered with a parade of Normals. Disappointment became routine. Anger simmered beneath every failed craft.\n\nThe only silver lining was skill progression.\n\n---\n\n> **[Legendary Blacksmith's Craftsmanship Skill]**\n> \n> **Lv. 2**\n> \n> Produce equipment items that you know how to make.\n> \n> You can create production methods for new items with the 'Legendary Blacksmith's Creation' skill.\n> \n> There is a certain probability of producing <span class=\"rarity-rare\">rare</span> ~ <span class=\"rarity-epic\">epic</span> rated items.\n> \n> There is a rare probability of creating <span class=\"rarity-unique\">unique</span> rated items.\n> \n> There is a very rare probability of creating <span class=\"rarity-legendary\">legendary</span> rated items.\n> \n> All stats of a production item will increase by **12%**.\n> \n> * When <span class=\"rarity-rare\">rare</span> rated items are produced, all stats will permanently rise by **+2** and reputation throughout the continent will rise by **+30**.\n> * When <span class=\"rarity-epic\">epic</span> rated items are produced, all stats will permanently rise by **+4** and reputation throughout the continent will rise by **+80**.\n> * When <span class=\"rarity-unique\">unique</span> rated items are produced, all stats will permanently rise by **+12** and reputation throughout the continent will rise by **+300**.\n> * When <span class=\"rarity-legendary\">legendary</span> rated items are produced, all stats will permanently rise by **+25** and reputation throughout the continent will rise by **+1,000**.\n> * Something special will occur with every five <span class=\"rarity-legendary\">legendary</span> items created.\n\n---\n\n> **[Legendary Blacksmith's Creation Skill]**\n> \n> You can create three equipment item production methods every time the skill level of the 'Legendary Blacksmith's Craftsmanship Skill' goes up.\n> \n> Number of items that can be created at present: **5/6**.\n> \n> * When items are produced using this skill, the name of the creator is automatically placed on the item.\n\n---\n\n> **[Legendary Blacksmith's Breath]**\n> \n> **Lv. 2**\n> \n> When you are concentrating on making an item, the will of Pagma's Descendant will fill the production item.\n> \n> All stats of a production item will increase by **7%**.\n> \n> There is a rare chance of giving special features to your production items.\n\n---\n\nBeyond the skill levels, I'd accumulated something more valuable. Khan was racing against retirement. Every day, he handed me a new production method. No quests. No hoops to jump through. Just knowledge, freely given.\n\nMost players had to grovel through fetch quests for a single recipe. I'd banked dozens.\n\nI pulled the leather-bound volume from my inventory. **List of Items Production Methods**. The table of contents had swollen. <span class=\"rarity-legendary\">Failure</span>. The Jaffa Arrows from Bairan. Khan's entire catalogue.\n\n*Back in Bairan, I only had four recipes. Axe, pickaxe, Jaffa Arrow, Failure.*\n\nMy thoughts drifted to Euphemina.\n\n*Where the hell is she? Didn't she need that orb?*\n\nShe'd mentioned wanting me to craft one. If she was serious, she'd bring the production method herself. The best materials. Free recipe, free resources.\n\nThen reality kicked in.\n\n\"Wait.\" My stomach dropped. \"What if... what if I only get one shot?\"\n\n*What if she brings me everything, I spend six hours sweating over it, and out pops a Normal-rated piece of garbage?*\n\nWould she kill me? No. Worse. She'd lock me in a basement somewhere and force me to remake it. Over and over. Forever.\n\nI remembered her face during the Bairan raid. That manic grin as she burned the lord's bodyguards alive.\n\n*What would she do to me?*\n\nThe hope curdled into dread. I stopped waiting. I started praying she'd forget about me entirely. My hands trembled.\n\nThe smithy door creaked open.\n\n\"Hiik! E-Euphemina?!\"\n\n*A tiger comes when you speak of it.* The old saying echoed in my skull. I'd just been thinking about her. Of course she'd appear now.\n\nTwo figures stepped inside. Not Euphemina. Men. High-level, judging by their gear. Their movements had that lazy confidence of users who'd seen combat.\n\nThe taller one scanned the workshop. \"Is this Khan's smithy?\"\n\nKhan set down his tools. \"I am Khan. Why are you looking for me?\"\n\n\"You competed in that item production game a month ago, right? Against a traveler named Erina?\"\n\n\"That's right.\"\n\n\"Is she really a blacksmith?\" The man leaned forward. \"Did you actually watch her make the item? With your own eyes?\"\n\nKhan frowned. \"Strange question. Of course she's a blacksmith. The Mero Company hired her for the game. I witnessed her skills firsthand. Exceptional work. Now, who are you? Why the interrogation?\"\n\nThey ignored him. Turned to each other and muttered something I couldn't hear. Then the taller one rounded back on Khan.\n\n\"The Mero Company was the only organization involved, correct? No chance of others pulling strings?\"\n\n\"Cough!\"\n\nDispleasure crept across Khan's weathered face. He'd been cordial—they were young, like his son would've been. But they kept steamrolling over him. Treating his answers like obstacles.\n\nThe shorter one stepped closer. \"Why the hesitation? If you know something, spit it out. Don't waste our time.\"\n\nIt sounded like a threat.\n\nMy blood went hot.\n\nThis was Khan's smithy. His home. These assholes were guests. What gave them the right to bark demands?\n\nThey talked down to him like he was furniture. An old man who deserved basic respect, reduced to an inconvenient NPC. Users pulled this crap all the time. NPCs weren't real to them. Just code. Artificial intelligences running scripts.\n\nBut I knew better. Khan had memories. He grieved his son. He got angry. He laughed. He was real enough to matter.\n\nI stepped between them and Khan. \"Hey. What's with the attitude? What gives you the right to threaten him?\"\n\nThey looked me over. Took in my soot-stained clothes, my beginner's hammer. One of them laughed.\n\n\"Who's this? Where'd he crawl out from?\"\n\n*What?*\n\n\"When did I get here? I work here, you idiot. Why are you stomping into someone else's shop acting like you own the place? Is this your business?\"\n\n\"Arrogant?\" The taller one smirked. \"We're asking for cooperation.\"\n\n\"Is that how you cooperate? By being a prick?\"\n\n\"Hah. Should we have brought orange juice and flowers?\"\n\nI hated people like this. Their gear screamed ranker—probably close to level 200. But their expressions screamed punchable.\n\nThe shorter one raised a hand. \"Don't get heated over a beginner.\"\n\n\"Sigh. Fine. You're right.\" The tall one rolled his shoulders, forcing calm. \"Damn nerves are shot after Faker got jumped. Look, beginner blacksmith, we're hunting for that woman. We're in a hurry. Got rude with the NPC. My bad. Apology accepted? Good. Now move.\"\n\n\"Apologize to Khan. Not me.\"\n\nSilence.\n\nThey turned away from me like I'd stopped existing. The tall one zeroed in on Khan again.\n\n\"Khan. Answer the question. Is Erina connected to any organization besides the Mero Company?\"\n\nKhan shifted. Moved in front of me like a shield. \"I—\""
}