{
  "id": 550,
  "title": "Chapter 550",
  "content": "# Chapter: The War Expands\n\nHurent stood in the vast wheat fields of Reidan, his arms crossed and his jaw tight as he stared toward the horizon. The Aura Master had been waiting for Piaro to return from his duties, but news of the massive war engulfing the Overgeared Kingdom had derailed everything. \n\n*This is bad.* \n\nThe report had struck like a lightning bolt. The training grounds he'd cultivated—these very fields—could be reduced to ash if the conflict spread here. \n\n\"They've been preparing for weeks...\" Hurent muttered, piecing together the frantic activity he'd witnessed. \"All of it was for war.\"\n\nAfter his failed invasion attempt, Piaro had shown him mercy. More than that—the legendary farmer had taught him to farm, to understand himself through the rhythm of cultivation and growth. The training method had proven invaluable. Pride swelled in Hurent's chest whenever green shoots emerged from the soil he'd tilled, and his heart raced when he saw people savoring the fruits of his labor.\n\nHe shook his head violently. \"No. That's not it.\"\n\nWhy was he thinking like this? Hurent forced the sentiment down, but the truth remained: these fields were his training grounds now, and he wanted to preserve them. Protecting them would be the best way to repay Piaro's trust.\n\nBut how?\n\nThe answer crystallized immediately. \"I have no choice but to fight.\"\n\nHurent unrolled a map of the Eternal Kingdom, tracing the key locations with his finger—Reinhardt to the east, Bairan to the north, Patrian to the south, and Reidan to the west.\n\n*They have to pass through Patrian to advance from Reinhardt to Reidan.* \n\nMountains and hills boxed in the region, creating natural barriers. The only viable path between Reidan and Reinhardt ran directly through Patrian.\n\n*This terrain was deliberately designed.*\n\nThe strategic picture became clear. West of Reidan lay the Saharan Empire. South of Patrian sat the Gauss Kingdom. Patrian was positioned as a chokepoint—a fortress meant to intercept invasions from either foreign power.\n\n*A natural fortress, now in Grid's hands.*\n\nThat had to sting. For the Eternal Kingdom to eliminate their \"rebel\" Grid, they'd need to reclaim Patrian. But assaulting a fortress built to withstand two nations simultaneously? That would be a nightmare.\n\n*They'll concentrate on Bairan.*\n\nThe optimal strategy would be attacking Patrian from both north and east, which required controlling Bairan first. Hurent felt certain that Eternal's top priority would be capturing that northern city.\n\n\"Then I'll defend Bairan.\"\n\nThe decision made, Hurent set off immediately. He'd once dreamed of becoming a Sword Saint, but after awakening to the true power of aura, he'd chosen a different ultimate path. The Aura Master who'd been humiliated at the 1st National Competition no longer existed. This version of Hurent was incomparably stronger.\n\nAnd now, he was moving to fight for Overgeared.\n\nIt was a variable that even the genius Lauel hadn't anticipated.\n\n---\n\n## Cork Island\n\nThe Eternal Kingdom's navy had deployed their elite R77 unit through a secret tunnel to infiltrate Cork Island. The plan was elegant: assassinate the enemy commander, paralyze the command structure, and give the navy a foothold for an easy victory.\n\nBut four hours past the scheduled signal time, the atmosphere aboard the flagship had soured.\n\nCork Island sat in uncomfortable silence before them, its coastal fortifications dark and still.\n\n\"Did they fail?\" Navy Admiral Lebuck finally voiced the question hanging over the bridge.\n\nHis staff officers flinched, then rushed to offer reassurances.\n\n\"Only four days ago, the King himself was the only one who knew about that tunnel. It's impossible for the rebels to have detected R77's infiltration.\"\n\n\"We confirmed R77 landed successfully. They're executing the mission on schedule—there are just variables causing delays.\"\n\nLebuck's frown deepened. \"Isn't it possible they were caught after landing?\"\n\n\"Admiral, R77's stealth capabilities are unmatched in our navy. Discovery is highly unlikely.\"\n\n\"We need to be patient. Good news will come.\"\n\n\"...Hmm.\"\n\nLebuck decided not to worry further. Given R77's elite training and the secret tunnel's advantage, the probability of mission failure approached zero.\n\nThen his faith was rewarded.\n\n*Peeeeeong!*\n\n\"There!\"\n\nA blue signal flare erupted over Cork Island—the prearranged color indicating the enemy leader had been eliminated.\n\nThey could advance.\n\n\"Don't damage the island—it's about to be our property again!\" Lebuck's voice boomed across the fleet. \"Cease long-range bombardment and move in! Land forces and demonstrate our full strength!\"\n\nWith their commander dead, enemy resistance would crumble. The artillery and magic fire from the coastal fortifications barely qualified as a threat—the desperate flailing of a broken defense.\n\n\"Full landing!\"\n\n\"Assault! Assault!!\"\n\nThe navy's ships surged toward the coast. Soldiers poured onto the beaches in waves, their morale sky-high with the certainty of victory.\n\nFrom the fortress walls, Peak Sword watched them come. A grin split his face.\n\n\"So the blue signal you described was accurate. I'll admit, I had my doubts.\"\n\nBeside him, Soldier stood at attention. \"I've committed myself to Overgeared. I have no reason to lie.\"\n\n\"That's the right attitude. Maintain it for the rest of your life, and learn from God Grid.\"\n\n\"Thank you for giving me this chance.\"\n\nSoldier—the very man Peak Sword had killed two nights prior. Upon resurrection, he'd come straight to Cork Island to pledge his loyalty. Why would he risk his naval career on such a gamble?\n\nBecause he'd recognized there was no future in the Eternal Kingdom.\n\nThe moment he'd infiltrated through that \"secret\" tunnel and found Peak Sword waiting at the exit, Soldier understood. Overgeared's intelligence network surpassed Eternal's by orders of magnitude. The winner of this war was already decided—not Eternal, but Overgeared. And immediately after, Overgeared would evolve into a sovereign nation.\n\n*A perfect opportunity to become a founding contributor. The chance fell from the sky.*\n\nSoldier would rise in this new country.\n\nPeak Sword, meanwhile, felt his own excitement building.\n\n*I waited until my stamina fully recovered before launching the signal, and now the entire enemy navy is landing right at my feet. Could I actually...*\n\nCould he exceed everyone's expectations and successfully defend Cork Island?\n\nThis was going to be a jackpot.\n\n---\n\n## Borneo\n\n\"Hoh?\"\n\nThe second Gauss army that appeared to reclaim Borneo included a new arrival: Seuron. The 7th-ranked player unleashed Soul Spears at the Overgeared troops manning the walls, then paused in genuine surprise.\n\nThe archers he'd expected to obliterate... were still standing?\n\n*Twenty percent health remaining?*\n\nLike any RPG, Satisfy displayed a stark power disparity based on level differences. A level 100-200 user surviving a skill attack from a level 300 player should be virtually impossible. Katz had used precisely this fact to massacre the Gauss forces during the siege.\n\nObjectively, Seuron's attack power exceeded even Katz's. Yet the Overgeared soldiers hadn't died. How? Seuron's unique class specialized in combat, with skill damage coefficients that dwarfed normal abilities. But these common soldiers had survived?\n\n\"How is this possible?\"\n\n\"If the soldiers' bodies are this durable, how strong are the knights?\"\n\nThe Gauss players buzzed with nervous speculation. Their fear of the Overgeared forces began spiraling out of control.\n\nBut Seuron was delighted.\n\n*Truly the Overgeared Guild... Even their soldiers are overgeared.*\n\nSeuron didn't belong to the Gauss Kingdom. He had no obligation to enter this war and wouldn't receive any rewards from it. He'd come solely to repay Grid for his humiliations during the Reidan invasion and National Competition—to inflict damage on Grid's prized forces.\n\n*Grid, I wonder how you raised your soldiers so well.*\n\nFresh motivation surged through him. If he slaughtered Grid's troops and stripped them of their equipment, Grid's rage would be spectacular to witness.\n\n\"That Grid would lose his mind, wouldn't he?\" Seuron grinned. \"Let's play.\"\n\n*Seokeok!*\n\nSeuron drew his weapon—the **+9 Wisdom Sword**, a one-handed blade that simultaneously boosted both strength and intelligence. He'd wielded it to devastating effect during the 2nd National Competition. The sword rivaled Grid's productions and matched the quality of Kraugel's True White Fang.\n\nMore importantly, Seuron possessed a passive skill: every strike against a person or monster with his weapon absorbed a fragment of the target's soul, incrementally increasing the weapon's power.\n\n\"Kuaaaaak!\"\n\n\"W-What is this?! Keeok!\"\n\nGauss players and soldiers fell screaming. They died in confusion, unable to comprehend why their supposed ally was cutting them down.\n\n*Seokeok!*\n\n*Puk puk! Puok!*\n\nSeuron's blade flashed in a crimson arc. Gauss soldiers and players collapsed into grey light one after another. The battlefield froze in shock at the unexpected slaughter.\n\n—*What the hell is Seuron doing?*\n\n—*Why is he killing his own allies when he's supposed to be fighting Overgeared?*\n\nThe term \"allies\" wasn't even accurate. Seuron belonged to no kingdom. Technically, he was a third party with no stake in this war. He'd only entered based on a personal grudge, not to serve Gauss.\n\n\"S-Seuron, you bastard! Kuaack!\"\n\n7th on the unified rankings. A unique class specialized in combat. Equipped with powerful items. His surprise attack caught the Gauss army completely unprepared. Soldiers and players fell helplessly before his blade. Seuron laughed at the Gauss players staring at him with fury and bewilderment.\n\n\"Weak people like you should be honored—you get to help me grow stronger.\"\n\n*Paang!*\n\n*Papapapang!*\n\nThe Wisdom Sword resonated with power. Seuron harvested the souls from the corpses littering the battlefield and formed soul spears—the same technique as before, but this time the magic damage had increased significantly.\n\n*Pepepepeok!*\n\nThe soul spears hammered into the Overgeared archers on the walls once more. The barrage was far more intense than his first volley. The vast majority of viewers watching the war broadcasts expected the archer line to collapse.\n\nBut Katz overturned their predictions.\n\n\"Blood Shield.\"\n\n*Kuwaaaaaang!*\n\nJust as Seuron seized souls from corpses, Katz claimed their blood. Crimson barriers materialized in the air, intercepting the soul bombardment in a cacophony of impacts. \n\nTwo forces that excelled at battlefield exploitation had clashed—the Soul Predator and the Blood Warrior.\n\nWho would win? The world leaned forward with anticipation, expecting a spectacular duel.\n\nThen Seuron dismissed Katz entirely.\n\n\"An epic class can't compare to mine. You're several tiers below me. Isn't that obvious?\"\n\n\"...What?\"\n\nKatz had been on edge since Seuron's appearance. He'd spent three days obstructing tens of thousands of soldiers, and exhaustion weighed on him like iron chains. Now he faced an opponent he couldn't match.\n\nYes, Katz had acknowledged Seuron as a genuine threat.\n\nBut Seuron was dismissing *him*?\n\nThat stung Katz's pride—the pride he was famous for.\n\nHe ground his teeth together, temper flaring. \"You beggar.\"\n\n\"What? Beggar?\"\n\nA high ranker, called a beggar? Seuron laughed, certain he'd misheard.\n\n\"Calling me a beggar... What are you, a kindergartener?\" Seuron snorted. \"That's the best insult you—\"\n\nKatz looked down from the wall and opened his mouth. His voice carried across the entire battlefield, amplified by the game's proximity chat.\n\n\"I will give one billion yen to anyone who injures that beggar's body. One hundred billion yen to whoever kills him.\"\n\n\"...?\"\n\nOne billion yen? One hundred billion yen?\n\nIf anyone else had made such a declaration, every listener would have laughed. But this was Katz—son of one of Japan's top conglomerates. His family's assets ranked in the global top ten. Even oil-rich Middle Eastern princes envied his wealth. When those numbers came from *his* mouth, the weight was immeasurable.\n\n—*I'm logging in right now.*\n\n—*LF party to hunt Seuron.*\n\nThe war broadcast ratings plummeted as viewers abandoned the streams to access the game. The battlefield itself erupted in similar chaos. Gauss players, already hostile to Seuron after his betrayal, turned their weapons on him.\n\nSeuron tensed as the enormous mob closed in.\n\n\"You crazy bastard...!\"\n\nCold sweat beaded on Seuron's forehead. From the walls, Katz watched with a savage grin.\n\n\"You should understand—you're nothing in front of money.\"\n\nSome problems that overgeared equipment couldn't solve, money could handle just fine."
}