{
  "id": 551,
  "title": "Chapter 551",
  "content": "# Borneo\n\nThe Gauss players' eyes gleamed with avarice.\n\n*Nine million dollars just for landing a hit?*\n\n*Nine hundred million for the kill...!*\n\nHow many chances did ordinary people get at wealth like this? Few enough that most would never see one. Katz's offer seized them by the throat.\n\n*Money!*\n\n*I'll be rich!*\n\nMoney. Money. Money. Capitalism bred monsters—and Katz found the phenomenon utterly delightful.\n\n\"Seuron, would you mind taking a hit for me?\"\n\n\"Better yet, just die. Please?\"\n\nThe Gauss players' expressions shifted. Bloodlust surfaced—directed at a high ranker they'd normally avoid at all costs. Seuron became prey, a chicken trapped in a coop. Surrounded on all sides, he swallowed hard.\n\n\"You actually believe him? Are you all idiots?\"\n\nThe Gauss forces averaged level 100, not a ranker among them. If Seuron stood behind fortifications like Katz did, he wouldn't care about their numbers. But he wasn't like Katz. He stood alone in enemy territory—isolated among thousands. Even the Soul Predator couldn't help tensing.\n\nSeuron kept his expression neutral. \"This isn't ninety thousand or nine hundred thousand. Nine million. Nine hundred million. You think he'll actually pay?\"\n\nBillions of won. No matter how wealthy someone was, spending that much to hunt one person in a game? A bluff. Had to be. Doubt rippled through the crowd.\n\n\"That's a lot of money. Can Katz really afford that much?\"\n\n\"If it were a realistic amount, I'd believe it...\"\n\nEnough money to change your life—from a single injury to Seuron! The extraordinary condition caught Katz by the ankle. The Gauss players wavered, and Seuron's tension eased.\n\n\"Kuhaha! Kuahahaha!\" Katz's shoulders shook with laughter atop the wall. \"People are hilarious. You can't imagine it, so you deny it? Your imaginations are *pathetic*.\"\n\nWas that their only problem? He'd adjust the level.\n\n\"Let me correct the amount. One hundred million yen for anyone who injures Seuron. Ten billion yen for whoever kills him. I promise in the name of the JIN Group. Believe me now?\"\n\nPeople didn't understand how terrifying madmen with money were. Why? Because madmen with money were *rare*.\n\n\"What are you waiting for?\" Katz's eyes turned cold. \"Want to make money? Kill that beggar.\"\n\nThe spark ignited.\n\n\"*Charge!*\"\n\nThe Gauss army surged forward. Katz's incentives eclipsed the quest rewards. Seuron recoiled, his roar tearing from his throat.\n\n\"Shit...! Damn it! *Overgeared!*\"\n\nThe Overgeared Guild haunted him. A farmer had killed him during Reidan's invasion. At the National Competition, Grid's equipment had rendered him ineffective. The Overgeared Guild had stained his life. He wanted to crush them, erase his shame.\n\nAnd now he was being trampled by the power of *money*? Fate kept tying him to those Overgeared bastards. It drove him mad.\n\n\"You think you can scratch me?\"\n\n\"Kill him! Kill Seuron!\"\n\n\"We don't have strong fighters—hit him together! One hit means big money!\"\n\n\"He's mine!\"\n\nEnraged Seuron clashed with money-drunk Gauss players. From the walls, Katz savored the chaos. The power of money turned enemies into allies and shook the world itself.\n\n---\n\nBairan's siege followed a unique pattern—the first where besieged and besieger had completely reversed roles.\n\n*Creeeak!*\n\nBairan's gate opened once more.\n\n\"Not again!\"\n\n\"Fall back! Use the soldiers as shields!\"\n\nEternal's players retreated. Their formation collapsed instantly. Players and NPCs tangled into a mess, paralyzing the command system. The battlefield descended into chaos.\n\nAt that moment—\n\n\"I'll show you my spirit today.\"\n\nPon charged through the gate astride a white horse and hurled his spear. **Rail Spear**.\n\n*Boom! Boom! Boom! Boom!*\n\nThe lightning spear tore through Eternal's army like a storm. Hundreds of soldiers and players burst into grey light.\n\n\"Hyah!\"\n\nPon drew another spear and rode out. He shattered the broken formation, his spear reaping lives. Soldiers fell in a one-sided slaughter, the power difference overwhelming. But the massacre didn't last.\n\nOne hundred. Pon cut down exactly one hundred before retrieving his spear and retreating.\n\n\"Fools! I told you not to break formation!\"\n\n\"Reform ranks! The enemy's next attack is coming!\"\n\nThe commanders confirmed Pon's withdrawal and barked orders. They wanted the late-arriving siege weapons escorted forward. But time was too tight. The players complicated matters further. Bairan's forces averaged level 140—mostly low-level users without military training. Despite the commanders' best efforts, the formations reformed too slowly.\n\nIn that gap, Yura emerged from the gate.\n\n\"Can't let you use those siege weapons.\"\n\n*Fwoosh!*\n\nA Demon Slayer accumulated black magic power with each demonkin slain. She could spend this resource on special skills. One was black magic—Yura's specialty when she'd ranked first among black magicians. She summoned dark spheres and bombarded the soldiers escorting the siege weapons. Her target was the siege weapons themselves. No one could stop her.\n\nEternal's elite soldiers were only level 180. Their abilities meant nothing against Yura's agility and aggression. They fell into helplessness.\n\n*Crash!*\n\n\"Damn it! How long will we let her rampage?\"\n\nEternal's players realized the gravity of the situation as siege weapons collapsed. They steeled themselves and focused fire on Yura. Arrows and spells flew as they desperately cleared their quest. Their levels averaged lower than the soldiers, but Yura was exhausted from five days of war.\n\n*Thud! Thud! Thud!*\n\n\"Ugh.\"\n\nAttacks began connecting. Yura had left the castle to fight, pushing her physical and mental limits. The good news—Eternal's players were weak. The level and equipment gap was severe enough that she avoided serious injury. After barely enduring the enemy assault and defeating her quota of one hundred, she retreated.\n\n*Thoom!*\n\nShe collapsed as soon as the gate closed. Yura sank down, gasping and drenched in sweat. Pon approached.\n\n\"Supplies are running out. The archers on the wall are low on arrows and potions. We might only last two more days.\"\n\nYura, Toon, and the other skilled Overgeared members concentrated in Bairan had alternated sorties to defend the castle without troop losses. But it couldn't last forever. Insufficient rest slowed their stamina recovery. Item durability hit rock bottom. Potions dwindled.\n\nDesperate circumstances for Bairan. But Yura refused to surrender.\n\n\"I will... I'll definitely hold it. If Bairan falls, Patrian's in danger.\"\n\nHow much longer? Yura, Pon, Toon, and the Overgeared members risked their lives, but they couldn't hold more than two days. Without reinforcements, Bairan was finished.\n\n---\n\n*Clang! Clang!*\n\n\"Kieek! Kieeeek!\"\n\n*Thunk.*\n\n\"*Kiiiiik!*\"\n\nRed Sun Forest. Korean players knew it as the Hypnotic Forest—a place of strange sights. Dubrick racers, nimble creatures deemed unhuntable due to their species traits, were being slaughtered by a single swordsman.\n\n*Slash!*\n\n*Screech!*\n\nUnavoidable speed. The white sword in Kraugel's hand intercepted dubrick racers three times faster than humans. Monsters sixty levels above him died. He wiped sweat from skin as flawless as a woman's and tucked hair behind his ears, revealing a high nose and deep eyes. The man was handsome enough to capture hearts regardless of gender.\n\n\"Kraugel.\"\n\nHao appeared at Kraugel's side. After discovering Ares' men were targeting Kraugel, he'd stayed close for protection. Now he asked, anxiety evident.\n\n\"Are you sure it's okay not to help Overgeared?\"\n\nKraugel held great affection for Overgeared. He couldn't hide his impatience as he monitored their war situation in real time. He seemed to want to help. Yet Kraugel continued hunting instead of heading to the Eternal Kingdom.\n\n\"Please tell me if something's stopping you. I'll help.\"\n\nKraugel had grown familiar enough with Hao to read his heart. He smiled bitterly. \"Grid wouldn't want my help.\"\n\n\"Why?\"\n\n\"We're rivals before we're friends.\"\n\n---\n\nPangea, the East Continent.\n\n\"Today's the third day...\"\n\n*Clang! Clang! Clang!*\n\nThe White Hammer blacksmiths shifted uneasily. Grid had hammered continuously for three days. Could a person endure that without rest? Forging especially demanded tremendous stamina. They worried about his health.\n\n\"Captain White, what if Grid collapses? Shouldn't he rest?\"\n\nWhite shook his head at the concerned question. He showed signs of weariness too—the aftermath of watching Grid work sleeplessly for three days.\n\n\"Don't disturb the Duke of Virtue's concentration.\"\n\nGrid was a craftsman. Once he poured his soul into creating an item, he wouldn't stop for food or rest. The work mattered most. White understood—he'd grown up watching his father. He had no intention of disturbing Grid.\n\nA wise choice.\n\nWith White's support, Grid maintained focus and successfully smelted the Red Phoenix Breath a day ahead of schedule.\n\n\"Now... now the real work begins.\"\n\n*Whoooosh!*\n\nGrid raised the furnace's temperature. **Legendary Blacksmith's Patience** activated for the fourth time, reducing his fatigue.\n\n*Clang! Clang! Clang!*\n\nGrid began forging the Red Phoenix Bow. He felt it vaguely.\n\n*The finest masterpiece will be born.*\n\nWell-founded confidence."
}