{
  "id": 553,
  "title": "Chapter 553",
  "content": "\"Ugh!\"\n\n\"Guh...\"\n\nThe Overgeared members had their faces driven deep into the ground. Following the air damage, they collapsed into a stunned state. The crisis was far from over—Bubat intended to finish them off completely.\n\n*Crack!*\n\n*CRACK!*\n\nBubat's one-handed hammer slammed into the backs of the Overgeared members without hesitation. Brutal strikes without a trace of mercy.\n\n\"Gorose! Han Woochan!\" Regas' eyes went wide as his comrades died before him. *They fought together for an entire week!* And now they were being slaughtered by Bubat—a third party who had no stake in this war!\n\n\"You bastard! I'll never forgive you!\" Regas roared.\n\n*Crackle!*\n\nRegas kicked off the ground. Among the third advancement classes, his Asura ranked among the most difficult to master. Intense lightning power coiled around his body.\n\n\"Ahhh!\"\n\n*I can't get close!*\n\nThe Eternal soldiers caught in Regas' explosive charge felt their skin tear and burn. They scrambled to widen the distance. This was the precursor to the Asura's ultimate skill, *Send to Hell*. Regas had entered a cold rage. He'd decided that Bubat—the greatest threat—had to be eliminated first, and he needed to prevent enemy forces from interfering. So he chose to open with *Send to Hell*.\n\n\"*Haaaaah!*\"\n\n*BOOM!*\n\nThe instant Regas kicked forward like a bolt of lightning—\n\n*What?*\n\nSurprise flickered through Regas. Every enemy he'd faced so far had tried to evade his ultimate move. Bubat, however, made no attempt to dodge. He crossed his arms and blocked Regas' kick head-on. The cost was severe.\n\n*CRACK-CRACK-CRACK!*\n\n*THOOM.*\n\nBubat's arms twisted at unnatural angles from receiving Regas' kick, and the ground beneath him collapsed as if an excavator had torn through it. The devastating attack power of *Send to Hell* was on full display. And yet—incredibly—Bubat remained standing!\n\n\"...!\"\n\nRegas' composure shattered.\n\n\"*Cough!*\" Bubat clenched his teeth against the pain. He ignored the warning windows flashing about damage and bone fractures as he grinned. \"Have you forgotten? Even Grid can't kill me in one blow.\"\n\nBubat's hidden class *Crusher* possessed a passive skill that *ignored damage beyond a certain threshold*. Bubat was convinced that even a dragon's breath couldn't kill him in a single strike. Moreover, a Crusher specialized in close-range crowd control, charging attacks, and terrain destruction. That was why Bubat hadn't fled from Regas. Rather than worrying about his broken arms, Bubat wrapped both legs around Regas' neck.\n\n\"Let me return the favor!\"\n\n*WHAM-WHAM-WHAM!*\n\nRegas' body spun 180 degrees, and his head slammed into the ground.\n\n\"*Gah!*\"\n\nDirt and stones jammed into his eyes, nose, and mouth. At the same time, Regas experienced crushing pain that made him see stars. Stunned. Bubat wrapped his broken arms around Regas' back and continued pounding him into the earth.\n\n\"Kekeke!Ahahaha! Your brain must be fried from fighting for days straight!\"\n\nA Crusher was the perfect counter to a martial artist. Furthermore, many of Regas' skills were on cooldown from wiping out Eternal's army. Bubat knew this and had timed his strike perfectly.\n\n*CRASH! CRASH! CRASH!*\n\nBubat kept slamming Regas' head into the ground.\n\n> [You have suffered 3,900 damage.]\n> \n> [You have suffered 4,030 damage.]\n> \n> [You cannot regain your mental state.]\n> \n> [Your body is restrained. It is difficult to move.]\n> \n> [You have suffered 3,980 damage...]\n\n...\n\nWarning windows continuously filled his field of vision. Regas was acutely aware of the serious crisis he faced.\n\n*I'm going to die.*\n\nThe martial artist class prioritized offense over defense. Victory had been decided the moment Bubat caught him and rendered him helpless.\n\n\"Regas! Hold on! We're coming!\" The Overgeared members desperately tried to rescue Regas, but the Yak Guild appeared in the opening created by Bubat's air crowd control. The Overgeared members found themselves surrounded by Yak members, unable to reach Regas. It was difficult enough just to stay alive. Bubat felt a surge of delight when he confirmed Regas' health had dropped to one-third.\n\n*Finally! I can get revenge on Overgeared!*\n\nBubat had originally enjoyed an excellent reputation for being undefeated in combat. But he'd been defeated by Grid repeatedly in the National Competition, and his reputation had plummeted. He wanted to display a magnificent performance in this war—broadcast across the entire world. After overwhelming Regas, he would break down the fortress walls with the army and claim the heads of Jishuka and Euphemina.\n\n*Then I'll intercept Grid when he inevitably appears and kill him!*\n\nHe would reclaim past glory! Bubat savored the fantasy.\n\n*Whoosh!*\n\nAn arrow flew toward him. Or rather, it stopped just before piercing him. Bubat was protected by Jeff and Ralph. Jeff blocked Jishuka's arrow with a sphere of water.\n\n\"Don't you know that projectiles are powerless before me?\" Jeff asked. Like Lauel, Jeff was a qigong master. But his combat ability far exceeded Lauel's. Lauel specialized in climate and terrain manipulation as a Flow Master. Jeff's third advancement class, however, was *Defying the Natural Order*—he possessed numerous skills excellent for direct combat. For example, he could neutralize projectiles like arrows.\n\n\"Allow me to return this.\"\n\n*BANG!*\n\nThe water droplet—or rather, Jishuka's arrow trapped within the water droplet—shot back toward its origin. Naturally, it targeted Jishuka on the castle walls. It maintained the same velocity and attack power.\n\n\"That bastard,\" Jishuka muttered.\n\nDaring to return her own arrow? Jishuka's pride as the finest archer on the continent was pricked, and she frowned.\n\n*CRACK!*\n\nShe shot down the returning arrow with another and turned her gaze toward Regas, still trapped in Bubat's grasp.\n\n*I'm sorry. I can't help you.*\n\nThe magicians were desperately blocking attacks from the catapults while the soldiers repelled those scaling the walls. Jishuka was currently the only one who could assist Regas. However, her stamina had reached its limits. Using a skill was impossible. Rescuing Regas from Bubat, Jeff, and Ralph with simple archery would also prove extremely difficult. They were among the strongest rankers. Few people could easily neutralize them.\n\n*One of those people is Grid...*\n\nGrid naturally entered her thoughts. It felt strange when she reflected on their first meeting. Jishuka had never imagined she would rely on him so heavily. Initially, she'd thought him nothing more than an idiot. But since then, he'd carved a clear mark on her heart.\n\nIt couldn't be helped. When she'd discovered he was Pagma's Descendant—the very person she'd been searching for. When he'd first crafted an item for her. When he'd appeared during crises and saved her. Grid was always special and intense. Almost like a drug...\n\n\"...Oh my, what am I doing?\"\n\nThis was a *war*. The screams of her comrades and soldiers never ceased, and the tide of enemies crossing the walls showed no signs of diminishing. It was absurd that she was daydreaming about Grid in the middle of this carnage.\n\n*I'm exhausted.*\n\nThe realization struck her. There was no hope in this war. The enemies were stronger than Lauel had anticipated. Overgeared's forces were too weak.\n\n\"Well, we can start over if we lose everything.\" Becoming frustrated and surrendering didn't suit her nature. Jishuka steeled her resolve and pulled a new arrow from her inventory.\n\n\"I don't think you'll lose everything.\"\n\n\"...\"\n\nThe battlefield was filled with the cacophony of magic and clashing weapons. It was so deafening that speaking to the person beside you was nearly impossible. Then why did she hear that voice so clearly?\n\n\"Grid...\"\n\nJishuka turned her gaze toward the source of the voice. Her face lit up like the sun—radiant, warm, and beautiful.\n\nAbove her. Grid floated in the sky, smiling like a mischievous goblin.\n\n\"Everyone has worked hard.\"\n\n*Whiiiirrr!*\n\nDozens of white spheres rotated around Grid as he surveyed the battlefield. Each sphere contained a powerful aura.\n\n\"What is that?\"\n\nAcross the battlefield, soldiers began murmuring as they discovered the white spheres in the sky. *Are those... multiple small moons?*\n\n\"...Huh?\"\n\nThe Eternal soldiers, unfamiliar with this phenomenon, began speculating. A black-haired man floating among spheres of white light. He was once Eternal's hero—now a rebel. Duke Grid.\n\n\"E-Evade!\"\n\n\"Run!\"\n\nGrid wouldn't create such a spectacle without meaning. The Eternal commanders hurriedly shouted warnings, but it was too late. The white spheres around Grid began firing across the battlefield. They rained down like a storm.\n\nA reversal in the war?\n\n\"Annihilate them all,\" Grid declared.\n\nThis was what those words meant.\n\n*BOOM!*\n\n*BA-BOOM-BOOM-BOOM!*\n\nHundreds of grey pillars erupted simultaneously across the battlefield. Grid descended beside Jishuka and handed her a bow.\n\n\"Congratulations on becoming truly Overgeared, Jishuka.\""
}