{
  "id": 554,
  "title": "Chapter 554",
  "content": "*Kwa kwa kwa kwa kwa!*\n\nDozens of white spheres materialized around Grid's hovering form, their luminescence cutting through the smoke-choked air. The orbs pulsed once—then scattered across the battlefield like falling stars.\n\n\"What the hell is that?\"\n\nWide-area magic on this scale was unprecedented. Before the Eternal Kingdom players could process what they were seeing, someone's voice cracked across the confusion.\n\n\"Magic Missile! Those are Magic Missiles!\"\n\nMagic Missile—the most basic spell in any mage's repertoire. Short cooldown, instant cast, negligible mana consumption. The tradeoffs were obvious: minimal damage, single-target only. \n\nExcept Grid had already proven during the National Competition that his Magic Missiles were anything but ordinary. His version had hurt high rankers.\n\n\"They're targeting us!\"\n\n\"Move! Get out of—\"\n\nPanic rippled through the Eternal ranks. Soldiers scattered in every direction, but tens of thousands of bodies packed into a confined space left nowhere to run. The stampede became its own casualty event—players trampled underfoot, their health bars draining to nothing before dissolving into grey light.\n\n*Peeng!*\n\n*Pepepepeng!*\n\nThe first wave claimed hundreds.\n\n*Kuwaaaaaang!*\n\nGrid's Magic Missile bombardment slammed into the earth. But not where the fleeing soldiers had expected. The piercing white flashes didn't rain down on exposed backs or unguarded heads.\n\nThey struck shield walls. Siege weapon emplacements. The hill where Eternal's archers had taken position. The magic corps maintaining their mana regeneration formation.\n\nEvery target Grid's missiles hit *exploded*. Fortified positions collapsed. Soldiers and players alike vanished in expanding clouds of debris and flame.\n\nBubat stared at the devastation, his expression hardening. \"What the hell *is* this bastard?\"\n\nStoring Magic Missiles mid-cast, then releasing them all simultaneously in a coordinated strike?\n\n\"This is ridiculously overgeared!\"\n\nIt had to be artifacts. That was the only explanation that made sense. Blacksmith Grid wielding magic? Obviously some legendary item was doing the heavy lifting.\n\nThe voices of his Yak Guild members filtered through Bubat's thoughts:\n\n\"He deliberately triggered explosions by hitting the magic wards?\"\n\n\"And destroyed siege weapons while killing the operators...\"\n\n\"Since when does Grid fight this cleverly?\"\n\nMagic Missile was single-target magic—penetration-based with zero splash damage. Everyone knew that. But that assumption broke down when the missiles struck equipment or volatile materials.\n\nJeff shot his guild members a withering look. \"What's *clever* about basic tactics? Middle schoolers could figure this out.\"\n\nThey all knew Grid was strong. But his strength came from items, not skill.\n\n\"Don't let them psych you out just because you're overestimating his abilities.\"\n\nJeff glanced toward Bubat. \"Finish off Regas while he's vulnerable.\"\n\nThe target was still pinned, half-buried in the crater. They couldn't afford to give him time to recover.\n\nBubat nodded, raising his hammer—\n\n*Kiiiiiiing!*\n\nAn unknown sound resonated across the battlefield. Heat washed over them in a suffocating wave.\n\n\"What...?\"\n\nBubat, Jeff, and Ralph broke into simultaneous cold sweats, their faces draining of color. Above them, filling their trembling vision, was a *firebird*.\n\nMassive. Radiant. Wreathed in flames.\n\n***\n\n\"Congratulations on truly becoming overgeared, Jishuka.\"\n\n> [Ownership of the Red Phoenix Bow has been transferred.]\n\n\"Truly overgeared?\" \n\nJishuka blinked at the notification, confusion flickering across her features. Overgeared was overgeared—what did \"truly\" mean?\n\nThen her skin prickled with sudden realization. *'Don't tell me...'*\n\nCould it be the item she'd been dreaming about since joining the guild? The bow Grid pressed into her hands radiated heat, its surface rippling with flame-like patterns etched into orange-red wood.\n\n\"Is this... a legendary bow?\"\n\nGrid's success rate for creating legendary items was microscopic. Comparable to the drop rate of legendary items from named bosses. Even within Overgeared, legendary equipment remained vanishingly rare. Jishuka herself had never owned one.\n\nGrid's lips curved into a knowing smile. \"Why don't you check?\"\n\n*Dugun dugun.*\n\nAfter Grid's dramatic entrance, Jishuka's already racing heart accelerated further. Anticipation thrummed through her veins as she pulled up the weapon's information window.\n\nShe froze.\n\nBecame a statue.\n\n\"Eh?\"\n\nWhat was this rating?\n\n\"Legendary... No?\"\n\n> **[Red Phoenix Bow]**\n> \n> **Rating:** Myth  \n> **Durability:** 1,203/1,203  \n> **Attack Power:** 3,190\n> \n> * Accuracy increased by **60%**.\n> * Firing speed increased by **80%**.\n> * Fire resistance increased by **50%**.\n> * Fire attribute skill damage increased by **30%**.\n> * Fire attribute skill cooldowns reduced by **20%**.\n> * Causes splash damage equal to **12%** of total attack power to all targets within a **1-meter radius**. Allied guild members in splash range are healed instead.\n> * Arrows contain flames. Adds **4,000** fixed fire damage to normal attacks and inflicts burn. Splash damage does not affect the user. Critical hits double the fixed damage.\n> * Maintaining bowstring draw for **3+ seconds** creates a protective shield that resists at least one status condition. **2-minute cooldown**. Very low chance to apply to party members.\n> * Each arrow fired has a chance to restore **1,000 health**.\n> * Skill **'Fly Up!'** generated.\n> * Passive skill **'Incarnation of Fire'** generated.\n> \n> *A bow that transcends legend to reach myth.*\n> \n> *The owner of this bow will leave countless achievements and become the subject of hymns sung by future generations.*\n> \n> *Created by Blacksmith Grid, who has surpassed his own limits.*\n> \n> *Structurally perfect with the ideal form of a bow. Shoot faster, farther, and with greater force.*\n> \n> *The breath of the Red Phoenix bestows a mythical blessing upon the wielder.*\n> \n> **Conditions of Use:** Top three in the archer unified rankings.  \n> **Weight:** 930\n\n> **[Fly Up! Lv. 1]**  \n> Summons a copy of the Red Phoenix.\n> \n> The clone deals fire damage equal to **800%** of total attack power to all enemies visible in the summoner's field of view.\n> \n> * Skills attached to myth-rated items can be upgraded.\n> \n> **Mana Consumption:** 2,000  \n> **Cooldown Time:** 12 hours\n\n> **[Incarnation of Fire Lv. 1]**  \n> A persistent passive.\n> \n> Your body approaches immortality through the Red Phoenix's favor.\n> \n> Health recovery and stamina recovery increased by **90%**. Stamina never drops below **5**.\n> \n> * Skills attached to myth-rated items can be upgraded.\n\n\"U-Uh?\"\n\nJishuka was well-educated, an avid reader with excellent reading comprehension. She processed complex information quickly. She read the Red Phoenix Bow's description three times in rapid succession.\n\n\"Is this a dream?\"\n\n\"...\"\n\nGrid understood her bewilderment. He'd crafted several weapons that ranked among the strongest in existence, but this bow was something else entirely. The ultimate archer weapon. Few people could immediately accept such overwhelming performance.\n\n\"It isn't a dream.\"\n\n\"It isn't... a dream?\"\n\nReality finally penetrated the shock. Jishuka took several stumbling steps toward Grid, closing the distance between them. She pressed her forehead against his chest.\n\n\"Thank you for your efforts, Grid.\" \n\nShe'd been watching him for years now. She knew the grueling work that went into each item—the failures, the persistence, the obsessive refinement.\n\n\"You fought and studied so hard on the East Continent.\"\n\n*Dugeun. Dugeun. Dugeun.*\n\nJishuka listened to Grid's heartbeat, a warm smile touching her lips.\n\n*Gulp.*\n\nHeat crept up Grid's neck. The world's greatest beauty—a woman who matched his taste perfectly—had her face buried in his chest. He wanted to savor this moment, but—\n\n\"Save Regas first.\"\n\n*Kkirik!*\n\nJishuka pulled back sharply, the Red Phoenix Bow already in her hands. She nocked a jaffa arrow and drew the string taut.\n\n*Hwaruruk!*\n\nFlames erupted along the arrow's shaft. The entire battlefield spread out before her eyes.\n\n\"Fly Up!\"\n\nThe instant Jishuka's voice rang out from the walls—\n\n*Kiiiiiiing!*\n\nThe cry of the Red Phoenix echoed across the battlefield.\n\n*Kurururururuk!*\n\nThe sky turned black with smoke. Hundreds—no, *thousands*—of fireballs materialized from nothing, raining down like a cataclysm made manifest. An overwhelming force that made even Grid, the weapon's creator, feel a frisson of fear.\n\n***\n\n*Kurururung!*\n\n\"Pant... pant...\"\n\n\"What... what *is* this?\"\n\nBubat, Jeff, Ralph, and the hundreds of guild members under their command stood transfixed, expressions slack with disbelief. A firebird had appeared in the sky and generated thousands of fireballs with a single flap of its wings.\n\nWas this a dream? Reality?\n\nThe distinction ceased to matter.\n\nThousands of fireballs poured from the firebird's wings, obliterating sections of the battlefield in real-time.\n\n\"What magic is this?!\"\n\nConfusion peaked among Bubat's party, but they weren't amateurs. Training took over. They moved with practiced efficiency through the chaos—activating defensive skills, triggering evasion abilities, intercepting fireballs before they connected.\n\n\"Each fireball only targets once! Block the first hit and you're clear!\"\n\n*Kwa kwang!*\n\n*Pepeng!*\n\n*Kurururung!*\n\nMagic and skills of every description lit up the field, creating a spectacle that had the spectators riveted. Bubat's group barely survived the onslaught.\n\n\"Heok... heok... heok?\"\n\nThey'd blocked the bombardment. Then they looked around, and the color drained from their faces.\n\nEternal Kingdom's players and soldiers—close to **20,000** of them—burned and died in a single attack. For those with levels in the mid-100s, the fireball bombardment had been nothing less than apocalyptic.\n\n\"Unbelievable...\"\n\n\"Who has magic this absurdly powerful... don't tell me—\"\n\nNo class could sweep up thousands of people in one attack. Not even monsters like Kraugel, Agnus, or Grid could manage that. Which meant—\n\n\"Earl Ashur!\" Bubat's eyes widened. \"The Great Magician on Grid's side finally showed himself!\"\n\n\"Shit! Fall back! Max out magic resistance!\"\n\nThe Yak Guild members immediately began swapping armor and accessories. Jeff and Ralph's guilds followed suit.\n\nIt was the wrong call.\n\n*Piing.*\n\nA fire arrow streaked from Patrian's walls.\n\n\"Jishuka!\"\n\nBubat spotted the incoming projectile too late. That stubborn woman was as persistent as a cockroach. But what could a single arrow possibly accomplish after that apocalyptic spell?\n\n\"Don't be ridiculous—stay down!\"\n\nBubat was frustrated by Grid and Earl Ashur. Angry about missing his chance to kill Regas. Jishuka's arrow felt like nothing more than an irritating gnat.\n\n*Peeng!*\n\n\"You think one arrow will stop me?!\"\n\nBubat raised the small shield attached to his wrist, intercepting the arrow without bothering to activate defensive skills. A Crusher was fundamentally a tank—high health, defense, and resistances across the board. He was equipped with the Undefeated King's gear, for god's sake. One arrow couldn't possibly—\n\n> [You have suffered **7,390 damage**.]\n> \n> [The struck area has begun to burn! You will lose **2,500 health** per second for **12 seconds**.]\n\n\"*Kuaaaaack!*\"\n\nBubat's scream tore across the battlefield. The arrow had exploded on impact with his shield, engulfing his body in searing flames.\n\n*'This damn girl! She recovered enough stamina to use her skill!'*\n\nJishuka smiled brightly at Bubat as he frantically dug through his inventory for burn salves.\n\n\"That was a normal attack.\"\n\n\"*What?*\""
}