{
  "id": 555,
  "title": "Chapter 555",
  "content": "# Chapter [#]\n\n\"That was a normal attack.\"\n\n\"What?\"\n\n*A normal attack?* Bubat had pride as a tanker. If a defense power ranking existed, he was confident he'd place in the top fifty. Yet a normal attack dealt nearly ten thousand damage?\n\n\"Nonsense!\"\n\nJishuka's arrow had carried immense fire damage and splash damage. *But a normal attack with such devastating features? Impossible.* Even Kraugel, wielder of the legendary Sword Saint class, couldn't pull off something like this with basic attacks. This had to be a skill.\n\n\"Do you think I'm a fool?\"\n\nBubat's face contorted, flushed red with pain and fury. The thought that Jishuka was mocking him made his blood boil. His guild members immediately grabbed him before he could charge the walls.\n\n\"We need to retreat!\"\n\n\"Don't fall for such obvious provocation!\"\n\n\"Kuoh...!\"\n\nBubat barely suppressed his rage. He remembered—if he delayed any longer, he'd die.\n\n\"Jishuka! I'm not running because I'm afraid of you! You know that! In a one-on-one fight, you'd be planted in the ground right next to Regas!\"\n\nBubat had joined this war knowing the Overgeared Guild would struggle against superior numbers. The reason he'd easily defeated Regas was by leveraging that numerical advantage. Now that the tide was turning against him, retreat was the only option.\n\nStill, he couldn't help but overreact to Jishuka. That was because of what had happened in the past.\n\nFour months after Satisfy's launch, Grid had still been level forty while Bubat had reached level one hundred and was attempting his class quest. The objective: hunt one hundred twin trolls alone within a week. Back then, before becoming a Crusher, he'd still been an ordinary tanker. He'd sought out the twin troll spawning grounds with determination.\n\nBut when he arrived, not a single twin troll remained. Jishuka had swept through the hunting grounds and slaughtered them all. Three hundred twin trolls, gone—and they took a full week to respawn. For someone with his weak offensive power, the probability of completing the quest in time had plummeted. Fury had consumed him.\n\nSo he'd made a decision. *Kill Jishuka and secure the hunting ground.* Why didn't he explain the situation and ask her to concede? His pride as a ranker wouldn't allow it. Besides, Bubat believed Satisfy's PK system existed for exactly this reason.\n\nThe result? He'd fought and died. Without his class advancement complete, he'd been no match for Jishuka, who'd already completed hers. Her arrows had torn him apart. Not in one hit—in nine.\n\nJishuka hadn't forgiven the sneak attack. She'd remained at the twin troll hunting grounds, hunting him down repeatedly. Bubat received two death penalties over four days and lost access to the game entirely. He'd naturally failed the class quest. Failure meant waiting another ten days before he could attempt it again.\n\n*That damn woman.*\n\nHe'd lost a fortnight because of Jishuka. In Satisfy's early days, losing two weeks was catastrophic—his name had vanished from the rankings entirely for a time. Even now, the memory made him tremble. His chest ached where her nine arrows had struck.\n\n*Just wait. I'll get my revenge someday.*\n\nKwaduduk!\n\nBubat turned his back on Patrian's walls. Despite the ghosts of his past and the pride that still gnawed at him, survival took priority. As he fled, Jishuka's voice rang out behind him.\n\n\"Where do you think you're going?\"\n\nPaang!\n\nAnother fire arrow streaked through the air. Jishuka's voice followed, light and confident.\n\n\"That's the second shot!\"\n\nThis time, Bubat activated Iron Wall—his ultimate defensive skill that reduced all incoming damage by half. However...\n\nPeeeeeong!\n\nHis face went pale as he raised the small shield on his wrist to intercept the arrow.\n\n> **[You have suffered 5,695 damage.]**\n>\n> **[The struck area has begun to burn! You will lose 2,500 health per second for 12 seconds.]**\n\n\"Ugh!\"\n\n*Why is the damage reduction so minimal?* He gritted his teeth against the burning pain. *Don't tell me it's fixed damage?*\n\nAnd why did every hit inflict such devastating burns? *How high is the fire damage proc rate?*\n\nNot to mention the splash damage...\n\nThis had to be an incredibly powerful attack skill. Naturally, the cooldown must be lengthy. No—Jishuka's stamina should be at its limit. She might have recovered slightly, but using a skill twice in succession should have depleted it again. Bubat frantically pulled out burn medicine and screamed at his guild members.\n\n\"Don't slack off! Keep retreating! There's no reason to delay any longer!\"\n\nThey were already exhausted from when Earl Ashur and Grid had appeared. They needed to flee before becoming the next targets. Bubat ignored Jishuka and hastened his retreat with his guild.\n\nPaang!\n\nPapapapang!\n\nContinuous sounds echoed from Patrian's walls. Bubat felt his stomach drop.\n\n*Again?*\n\nThe distinct whistle of flying arrows—not just one or two, but at least ten. What other archer could fire arrows from walls four hundred meters away? As far as he knew, only Jishuka possessed that range.\n\n\"Don't tell me—!\"\n\nBubat whipped his head around. His heart sank. Ten arrows identical to the ones that had dealt such devastating damage were already in flight, streaking toward his forces.\n\n\"This is crazy!\"\n\n*She's using skills continuously?* His mind raced. *Isn't her stamina depleted? Why is the cooldown on such a powerful skill so short?*\n\nUnless... *Is this the ultimate skill of an archer?*\n\nIf so, it was absolutely broken. Bubat cried out urgently, \"Scatter!\"\n\nIf they remained clustered together, the splash damage would annihilate them. As Bubat anxiously activated another defensive skill, Jeff laughed.\n\n\"Have you forgotten?\"\n\nThe third advancement class of a qigong master possessed a unique ability—they could restrain flying projectiles and return them to the opponent. It was a perfect counter to an archer's skills: Qi Barrier, which rendered an enemy's ranged attacks ineffective. One of the ultimate skills of Defying the Natural Order.\n\n\"Don't worry about your backs. Just retreat.\"\n\nJeff laughed in a relaxed manner, consuming a massive amount of mana to manifest the barrier. He didn't doubt for a second—the barrier would destroy Jishuka's attack and crush her spirit. But reality was the exact opposite. It wasn't Jishuka who felt despair.\n\nIt was Jeff.\n\n\"Heok?\"\n\nThe fire arrows struck the barrier. Rather than being extinguished or deflected, they passed through without any resistance whatsoever.\n\n\"These... aren't skills!\"\n\nJeff's face went slack with disbelief. Meanwhile, Bubat and the other guild members had placed their faith entirely in Jeff's barrier.\n\nKwa kwa kwa kwa kwa kwa kwa kwa!\n\nThe fire arrows slammed into the clustered forces. Explosions erupted in rapid succession, engulfing them in flames.\n\n\"Kuaaaaak!\"\n\nThis was after enduring the bombardment of thousands of fireballs. Even on the now relatively quiet battlefield, fresh screams echoed as new casualties mounted.\n\n\"You bastard! Why didn't you block it?!\"\n\nBubat grabbed Jeff by the collar after confirming several guild members had been grievously injured. He knew Jeff's abilities—he'd expected Jeff to easily block Jishuka's skill. Yet the attack had passed straight through. *Is he an Overgeared spy?*\n\nJeff hastily explained to the enraged Bubat. \"These aren't skills... The barrier can't block them.\"\n\n\"Not skills? Then what the hell are they?\"\n\n\"Normal attacks.\"\n\n\"Eek! What nonsense—huh? Heok?\"\n\nBubat's eyes widened even as his grip tightened on Jeff's collar. More fire arrows were raining down from Patrian's walls. This time, more than ten.\n\n\"No! What kind of skill has such a short cooldown?!\"\n\n*Why does such a devastating skill have barely any downtime?*\n\nThe fire arrows reached them.\n\nKwa kwa kwa kwa kwa kwa kwa kwa!\n\nAnother series of powerful explosions rocked the battlefield. The area where Bubat had been standing transformed into a sea of fire.\n\n***\n\nJishuka had perfect compatibility with the Red Phoenix Bow. She'd become incomparably stronger than before. She laughed as she fired arrow after arrow, and Grid watched her with a warm expression. His usually sharp, threatening eyes seemed endlessly gentle today.\n\n*It's the first time I've seen her so delighted.*\n\nIn truth, Grid had always kept Jishuka in the back of his mind—ever since she'd listened to him and handed over the Tzedakah Guild. He'd felt a desperate desire to repay her for that trust. However, opportunities to properly compensate her had been scarce. The rating was often disappointingly low whenever he crafted items for her.\n\n*I've never managed to make a legendary-rated bow for her.*\n\nBut this time, he'd gifted her a myth-rated bow. Grid was proud that he'd finally repaid the favor and sacrifices she'd given him.\n\n*Honestly, I wanted to use it myself.*\n\nThere were harsh limits to Grid's archery. The restricted range of his arrows was especially fatal. On the other hand, Jishuka possessed numerous exclusive skills to enhance archery's power. She could draw out the Red Phoenix Bow's full potential. It was better to entrust it to her. The stronger she became, the stronger Overgeared would be—and the more Grid would benefit in return.\n\nKwa kwang!\n\nKwa kwa kwa kwang!\n\nJishuka devastated the battlefield with the bow. Grid felt reassured watching her—she would play an active role in countless wars to come. Creating a myth-rated item had been worth every effort.\n\n*This...*\n\nJishuka belatedly realized Grid was watching her and blushed. She'd been so fascinated by the Red Phoenix Bow's power that she'd forgotten he was standing beside her.\n\n*Would he... like a woman who smiles when killing people?*\n\nBubat's forces were being annihilated. Jishuka bowed her head, troubled by the thought. Grid reached out and stroked her hair.\n\n\"You're amazing. You're literally a weapon of mass destruction.\"\n\n\"Weapon of mass destruction...\"\n\n*He called me a weapon of mass destruction.* Her favorite man had called her a weapon. Jishuka's emotions became even more tangled. Grid extended his hand toward her.\n\n\"...?\"\n\n*What's this?* Jishuka looked at Grid's large, thick hand and felt anticipation surge through her chest.\n\n*Is he asking me to hold his hand? Does Grid like me?*\n\nHer imagination ran wild as she reached out to place her hand in his. Grid pulled back his hand in a startled manner.\n\n\"No, I'm asking for payment. For the bow.\"\n\n\"...Ah.\"\n\n*Right. It needs to be calculated.* Jishuka's eyes darkened. There was no way to determine the true value of the Red Phoenix Bow. Any price would be insufficient. After wrestling with the problem, she finally spoke.\n\n\"Shall we... get married? If we marry, all my assets will become yours.\"\n\n\"...\" Grid shook his head and gave a dry laugh. \"That's a funny joke.\"\n\nHe turned and signaled to Sticks. \"Let's head to Bairan first.\""
}