{
  "id": 556,
  "title": "Chapter 556",
  "content": "\"Let's go to Bairan first.\"\n\n\"Is Jishuka coming with us?\"\n\nMass Teleport was an intricate spell. Each casting required drawing a unique magic circle—its form changing based on the number of travelers and destination coordinates. That's why Sticks asked before beginning.\n\n\"No, just the two of us,\" Grid replied.\n\nThe logic was simple: defending Bairan meant defending Patrian. And Patrian was the priority. With the enemy offensive still underway, Jishuka couldn't be spared. She understood this better than anyone.\n\n*I can't go with him...*\n\nBut she refused to waste the power he'd given her. Jishuka wanted to be useful to Grid. She waved him off.\n\n\"Leave it to me. I'll take care of Patrian.\" Her smile was bright. \"Let's settle accounts next time.\"\n\n\"Yeah.\" Grid's answering smile carried genuine relief.\n\n*I almost jumped to conclusions again.*\n\nOnce upon a time, Grid had been the master of premature assumptions. Every woman who looked at him, every casual conversation—he'd mistaken them all for romantic interest. He'd cared too much about the opposite sex, reading desire into the smallest gesture.\n\nBut the incident with Ahyoung had taught him better. Love required reasonable foundation. From that perspective, the world's most beautiful woman couldn't possibly be sincere in her proposal. It was only natural—Jishuka surely had countless competent, handsome, personable men pursuing her. She couldn't actually like *him*.\n\n*Why would a woman like her propose first anyway?*\n\nHe'd almost taken the joke seriously. The thought alone gave him goosebumps as memories of Ahyoung surfaced.\n\n*I nearly misunderstood again.*\n\nHe'd finally matured into a man who could read the room! Pride in his growth warmed Grid as white light enveloped him.\n\nThe moment he vanished, Jishuka's composure crumbled. Her face burned scarlet.\n\n\"He... rejected me.\"\n\nHow many women in the world had experienced rejection after proposing to a man? Her chest ached. Shame flooded through her. She'd liked a man for the first time in her life, and he'd turned her down!\n\n\"Fool,\" she whispered to herself.\n\nThe real problem was proposing before they'd even started dating. He probably thought she was some strange, desperate woman. Mortification colored her cheeks deeper red.\n\n\"*Hing*...\"\n\nTears pricked her eyes as she sniffled—so unlike her usual confident self. The solo archer, reduced to a shrinking violet by the opposite sex.\n\nMeanwhile, on the battlefield below the walls...\n\n\"Did everybody forget about me?\"\n\nRegas finally extracted himself from the ground where he'd been lodged. His dejection was palpable.\n\n***\n\n**Gangnam, Seoul.**\n\nIn a luxury mansion valued at over five billion won, Yura sat in the expansive garden overlooking the Han River. Sunlight kissed her porcelain skin, making it seem to glow.\n\n*My body feels like lead.*\n\nFor days, Yura had pushed her game access to the daily limit, helping defend Bairan from the enemy offensive. Every minute offline was a minute the defense might crumble. The result? Crushing fatigue.\n\nHer sleep schedule had collapsed. She wasn't eating or exercising properly. Worst of all, she couldn't see an end in sight. Intelligence suggested the Eternal Kingdom could mobilize approximately 500,000 soldiers. With complete food distribution routes, they could sustain an assault of 100,000 troops at once on Bairan.\n\nCould she hold on?\n\nYura shook her head.\n\n*I have to hold on.*\n\nShe was fighting for Grid. They couldn't lose now—not after everything. Steadying her resolve, she checked the time. Thirty minutes until she could log back in.\n\nShe headed inside, flicking on the TV before beginning to undress for a shower. Her flawless white skin was truly... [censored].\n\n**『Breaking news. The Eternal army invading Patrian has been driven back.』**\n\nHalfway to the bathroom, Yura froze at the broadcast.\n\nPatrian had superior defensive features compared to Bairan. The soldiers attacking it were also lower level than those assaulting Bairan.\n\nBut even so, success shouldn't have been easy. At least 20,000 Eternal soldiers had attacked Patrian, including guilds led by Bubat, Jeff, and Ralph. Yet Patrian had driven Eternal to the brink of collapse?\n\n*How?*\n\nThe TV began showing combat footage, answering her question and that of viewers everywhere.\n\n**『As you can see, the primary strike came from Reidan's mage unit, devastating Eternal's siege weapons. Since then, the offensive weakened considerably.』**\n\n**『The mage unit consists of a rare species, uncommon on the West Continent. Notice their unique skin coloration and tattoos.』**\n\n**『According to Satisfy researchers, they're an ethnic minority called the Ul Clan—naturally gifted in magic.』**\n\n**『Why would the Ul Clan be with Overgeared?』**\n\n**『The Ul Clan suffered destruction at the Saharan Empire's hands. Having lost their homeland, it seems Grid rescued them at an opportune moment.』**\n\n**『Hah... Grid's ability to attract and manage NPCs is truly exceptional.』**\n\n**『He seems to raise NPC affinity effortlessly. At this point, it's fair to argue this ability stems from his class or titles.』**\n\nThe footage showed the Ul Clan materializing via Mass Teleport. They bombarded siege weapons at the Eternal army's rear before vanishing again through Mass Teleport.\n\n**『Even for a magically-inclined species, using Mass Teleport freely is remarkable. Only a handful of players and great magicians can manage it currently.』**\n\n**『No, look closer—the Ul Clan aren't casting Mass Teleport. See that figure beginning the spell while the Ul Clan attack? Focus there.』**\n\nThe camera zoomed in, revealing Sage Sticks. The experts' surprise was audible.\n\n**『An elf...! Grid is friends with an elf!』**\n\nSatisfy's storyline was still in its early stages. Other species remained incredibly rare—most of the two billion users had never encountered one. Yet Grid had already befriended an elf!\n\n**『Grid's affinity apparently extends even to other species. Truly amazing.』**\n\n**『God Grid indeed...』**\n\n**『Though I admit, I'm disappointed it's a male elf instead of female.』**\n\nSome experts' admiration devolved into nonsense, but it didn't matter. That nonsense reflected most male viewers' hearts!\n\n**『Ahem. In any case, the mage unit bought Patrian's Overgeared members breathing room. However, crisis soon followed. Bubat, Jeff, and Ralph had been observing—now they moved.』**\n\nThe footage shifted to Bubat's group. Though Regas was exhausted, Bubat's group overwhelmed him with ease. Jeff and Ralph carved through Overgeared members, displaying high ranker dignity.\n\nBut only for a moment.\n\n**『Most viewers probably expected Patrian's fall at this point. The Overgeared members faced desperation. But then Grid appeared.』**\n\nThe dignity Bubat, Jeff, and Ralph had displayed? It shattered the instant Grid emerged. He fired dozens of Magic Missiles simultaneously, showcasing his majesty as he devastated the army.\n\n\"Amazing...\" Yura's jewel-like eyes glittered as she watched.\n\n**『Now he's handing over a bow.』**\n\nYura and viewers worldwide witnessed the incredible sight: Grid presenting Jishuka with a bow. Then a firebird rose into the sky. The battlefield transformed into a sea of flames. Bubat, Jeff, and Ralph were helpless before Jishuka's arrows.\n\n\"That bow... What's its rating?\"\n\nAn unidentified bow that elevated its user to legendary status. Its performance was unusual even compared to conventional legendary weapons. The experts offered cautious speculation.\n\n**『It's extraordinary power, even accounting for compatibility between bow and Jishuka. Particularly, those wide-area effects are devastating in warfare. My guess? Quest-only item.』**\n\nQuest-only items—indispensable for completing specific quests. Sometimes they possessed transcendent functions necessary for quest completion.\n\n**『In other words, the Overgeared Guild has a quest to defend against Eternal's offensive. During that quest, Grid obtained a powerful bow to counter the enemy, transforming Jishuka into the incarnation of a fire god.』**\n\n**『I concur. This explains why Grid was absent during the earlier stages of the war.』**\n\n**『Isn't this promising? Can the Overgeared Guild prevent the Eternal invasion?』**\n\n**『Unlikely. One item can't win a war. Once Eternal secures steady food supplies and begins artillery bombardment, all Overgeared territories will fall quickly.』**\n\n**『But the Overgeared Guild will gain tremendous reputation despite losing territory. The prestige of a single guild that fought fiercely against a kingdom—they'll become Satisfy legends. That should suffice.』**\n\nThe experts offered their usual speculation—rational guesses based on conventional wisdom. The problem? Grid's abilities defied convention. Unfortunately for the experts, their speculation was completely wrong.\n\n***\n\n\"Baron Duka and Earl Carrion have joined!\"\n\n\"Marquis Bela and Earl Red have joined!\"\n\nA full 100,000 troops had gathered near Bairan, assembled through the leadership of nobles loyal to the king. Chief Commander Duke Lucilliv smiled with satisfaction.\n\n\"Thanks to our advance forces, the rebels are already exhausted. Today we occupy Bairan and put Patrian in our grasp!\"\n\n\"For Eternal!\"\n\n\"For King Aslan!\"\n\n\"**Waaahhhhhhhh!**\"\n\nMorale among the 100,000 soldiers surged. The endless procession was spectacular. Beasts and monsters scattered before the powerful march.\n\n\"Soon the war ends and peace returns.\"\n\nSoldiers from various territories wore bright expressions. Grid—once a hero of the kingdom, now a rebel disloyal to the royal family. The soldiers were pleased that the man who'd thrown the kingdom into turmoil would finally be punished, restoring peace. They approached it like a picnic rather than a battlefield.\n\nOnly one soldier wore a dark expression. A new recruit from Partu.\n\n\"Hey, Ars. Nervous?\"\n\n\"...\"\n\n\"Haha, that's natural—your first war. But don't worry. There are 100,000 of us. The rebels will be destroyed. The war will end quickly.\"\n\nThe senior soldiers from Partu harbored some unease. Before the war, all young people in the territory—even beggars whose identities couldn't be verified—had been conscripted, turning military discipline into chaos. Not just Partu's territory, but others as well.\n\nArmy size wasn't always advantageous. But what did it matter? Numbers would overwhelm the rebels.\n\n\"The rebels can never endure an endlessly pressing army.\"\n\nArs listened quietly to the senior soldiers' words before murmuring.\n\n\"Unless the command system collapses.\"\n\nHis gaze fixed on Duke Lucilliv's back. The leader of the 100,000 troops remained oblivious to that calculating stare.\n\nMeanwhile, in Bairan...\n\n\"100,000 troops advancing from Partu's direction.\"\n\n\"What? 100,000?\"\n\nMadness. Sweat and blood-streaked faces of Pon and the Overgeared members filled with frustration and despair.\n\n\"They mobilized such a large army already? Was Lauel's estimate wrong?\"\n\nLauel had said Eternal's army and transportation system had blind spots. He'd predicted they couldn't operate a 100,000-strong force for at least two weeks. But he was wrong. Eternal's military system was better organized than Lauel's analysis suggested.\n\n\"Lauel's been making too many mistakes lately.\"\n\n\"He's managing the guild and all territories alone. He's too busy to be perfect.\"\n\n\"Can't be helped, even with genius. Anyway, we can't hold much longer. We should retreat. Join up with Patrian.\"\n\nThe Overgeared members couldn't help thinking: How much better would things be if Asmophel were here? If that strategic master led the army...\n\n*...Damn. There's hope even while he plays at being a soldier.*\n\nSomewhere in Overgeared territory, Private Ars was making a difference. That's how Overgeared had withstood the offensive until now. Pon believed it.\n\n***\n\n**—It's over. The members can't hold any longer. I'm joining the war.**\n\nIn Reidan, Lauel heard the whisper and rose from his seat.\n\n*Piaro and the Water Clan have arrived.*\n\nOver the past week, Lauel had scattered personnel throughout Eternal territory, gathering complete intelligence on the kingdom's military movements.\n\n*I think I'm developing hair loss.*\n\nThe stress was so intense he'd started losing hair in reality. Each time he ran fingers through it, strands came loose. But this wasn't the time to fear baldness. It was time to move—time to complete the project to make Grid a king.\n\n\"Before I leave, I need to ask this of you, Kasim. Please handle this in preparation for the Empire's raid.\"\n\nBefore directly commanding the army, Lauel summoned Kasim and issued orders.\n\nKasim felt admiration as he heard the plan. \"Remarkable. I understand.\""
}