{
  "id": 557,
  "title": "Chapter 557",
  "content": "*Duke Lucilliv... What a pretentious fool.*\n\nPrivate Ars surveyed the procession of one hundred thousand Eternal soldiers stretching across the horizon. At the column's head, golden armor gleamed brilliant in the sunlight—a calculated display meant to inspire awe. The relentless thunder of war drums shook the very sky, announcing the advance of what should have been an overwhelming force.\n\nTo the untrained eye, it would seem magnificent.\n\nBut Ars, marching among the vanguard with his unusually bright blond hair catching the sun, saw through the pageantry with a cynical eye. Beyond the golden-armored elite, the truth revealed itself: worn leather armor, uneven footfalls poorly masked by the drumbeat's rhythm. More than half of these hundred thousand weren't professional soldiers—they were rabble who'd barely completed basic training, if that.\n\n\"How rotten is this?\" muttered a conscript nearby. \"Why should we die in some squabble between nobles?\"\n\n\"What kind of noble attacks his own king?\" another replied. \"Shouldn't the people obey their ruler?\"\n\n\"What does it matter who betrays whom if we starve to death first?\"\n\nThe lowest class. Always poor. Always hungry. Uneducated, with no concept of patriotism beyond their next meal. Their sole purpose: survival.\n\n\"God... who'll care for my family without me?\" A middle-aged man's voice cracked. \"My wife's pregnant, caring for the children alone...\"\n\n\"Wearing armor and carrying a spear at my age...\" An elderly laborer wheezed. \"It's killing me...\"\n\nThe ordinary people—those who'd labored their entire lives for family—now marched toward death.\n\n\"I-I want to see my mother.\" A boy's sob barely rose above the drums. \"I'm so scared.\"\n\n\"My legs... I can't walk anymore.\"\n\nYoung boys who'd never seen their sixteenth year comprised more than half the hundred thousand. And every single one of these exhausted, terrified souls served a singular purpose: to die.\n\nThe vanguard would march for two days to reach Bairan. There, they'd swap positions with the golden-armored elite and stand at the front lines—the first to fall.\n\n*But at this rate, they'll be useless,* Ars thought darkly.\n\nThe golden armor that flashed so brilliantly in the sun burned their eyes. The constant drumming amplified fear rather than courage. Their mental state would collapse before they ever reached Bairan.\n\nYet Duke Lucilliv remained oblivious.\n\nThe position of common soldiers wasn't something nobles understood. They couldn't conceive that their \"marvelous\" march might crush morale rather than build it. In their world, the rabble should be grateful just to receive food and purpose.\n\nIt wasn't incompetence, exactly. Just a very aristocratic way of thinking.\n\n*Was I the same, once?* Ars barely managed to chew the rock-hard barley bread.\n\n*Well. There'll be mass desertion at the next campsite.*\n\nThen his first opportunity would come.\n\n***\n\nTwo giants dominated the political landscape of the Eternal Kingdom: Marquis Steim and Duke Lucilliv.\n\nMarquis Steim had pioneered the barren north, transforming wasteland into prosperity. Duke Lucilliv, by contrast, knew how to leverage his noble lineage. Through sheer political influence, he'd gathered the powerful armies of Baron Duka, Earl Red, Earl Carrion, and Marquis Bera under a single banner—a feat Prince Aslan, seated on the throne in place of the dead Prince Ren, could never accomplish.\n\nThese were masters of great territories throughout Eternal. Skilled swordsmen. Commanders of vast forces.\n\n\"The Duke himself leads the army.\" Inside Duke Lucilliv's command tent, Earl Red gazed with genuine admiration at the two thousand golden-armored soldiers and five thousand cavalry assembled. \"Magnificent.\"\n\nIt wasn't flattery. He truly found the golden vanguard wonderful.\n\nMarquis Bera, however, frowned. \"You must have spent considerable coin plating that armor... isn't it wasteful? We could take Bairan and Patrian with a normal advance.\"\n\nDuke Lucilliv sipped his wine, shoulders shaking with barely suppressed mirth. \"Marquis Bera, your thinking is far too small. Plating?\" He gestured grandly. \"My soldiers wear **pure gold armor**. An army led by Duke Lucilliv cannot be ordinary. Isn't that right?\"\n\n\"...Pure gold?\" Marquis Bera's eyes widened.\n\nEvery noble present, including Bera, stared in amazement. The golden soldiers at the procession's head numbered at least ten thousand. All wearing pure gold armor? The cost must have been astronomical.\n\nLucilliv basked in their attention. \"Of course, the armor is merely decorative. The defense is terrible—I lacked sufficient gold to make it thick enough.\"\n\n\"Duke...\" Marquis Bera chose his words carefully. \"Will your soldiers survive enemy attacks?\"\n\n\"Why would my soldiers be in danger?\" Lucilliv waved dismissively. \"Won't the thousands of other troops finish this war in an instant? My soldiers won't even need to engage.\"\n\nThe other nobles nodded along. Their goal was establishing great merit in this war. Shame would follow if they didn't participate actively. They'd planned to occupy the rebel bases swiftly by directing their own forces.\n\n\"Precisely,\" Earl Red agreed. \"We'll trample these rebels with our troops. Duke Lucilliv's soldiers will boost our army's morale tremendously.\"\n\n\"Haha! Exactly my intention!\" Lucilliv beamed. \"I'm making this war more advantageous by raising allied morale!\"\n\n\"Indeed, the Duke's wisdom is exceptional.\"\n\nFrom their perspective, Duke Lucilliv's strategy seemed sound. More than half the hundred thousand soldiers were rabble, true—but that didn't diminish their value. They'd serve as vanguard sacrifices, exhausting Earl Ashur's magic, which they considered the greatest threat. Raising morale among troops facing massive arrow volleys was essential.\n\nBut they overlooked one critical detail.\n\nDuke Lucilliv had funded those ten thousand gold armor sets by embezzling from supply funds. The hundred thousand soldiers carried only fourteen days' worth of rations—most of it three-month-old refuse Lucilliv had sold at inflated prices.\n\nThis proved crucial in cultivating insecurity. After exhausting marches, the soldiers' complaints soared when they received their pitiful meals. Forcibly conscripted, denied even proper food...\n\n\"Duke! Troops are deserting!\" A knight burst into the tent.\n\nDuke Lucilliv blinked. \"Why?\"\n\nThis was a glorious opportunity to fight for their kingdom. Why desert?\n\nMarquis Bera answered on Lucilliv's behalf. \"Capture and execute every deserter! Show the soldiers the terrible price of abandonment!\"\n\n\"Yes, my lord!\"\n\nThe knights departed immediately. In total, 1,831 soldiers were captured during their escape attempt and executed. Lower-class citizens, forcibly conscripted. They begged for mercy as they died.\n\nSenior soldiers from the Partu contingent approached one soldier watching quietly from the ranks.\n\n\"Don't even think about escaping,\" the first warned. \"At least Partu treats its soldiers reasonably. You should be grateful.\"\n\n\"If you run, you'll die like that,\" another added, jerking his thumb toward the execution site. \"Stay until the end if you want to live.\"\n\n\"Aren't you happier chewing dry bread here than freezing on the streets?\"\n\n\"Private Ars. Understood?\"\n\nArs's gaze remained fixed on Duke Lucilliv's tent.\n\n*The Duke didn't move. No gaps in his guard.*\n\nDuke Lucilliv's guards were levels below the Empire's Black Knights, but they numbered too many. Worse, the other nobles surrounding the Duke could exercise considerable power themselves. Ars couldn't attack blindly.\n\n*I'll wait for the next opportunity.*\n\nToday's incident had firmly planted fear and insecurity in the soldiers' hearts. Morale had plummeted catastrophically. Ars expected even more desertion attempts tomorrow.\n\nMore chances would come.\n\n***\n\nBairan teetered on the edge of catastrophe.\n\nEnemy forces pressed against every gate. The arrows fired by Overgeared members no longer flew with the speed and strength they'd shown at the battle's start.\n\n\"Your parents are suffering from poor circulation!\" Huroi's voice cracked as he shouted. \"Go home and blow on your parents' hands and feet!\"\n\nHis cries no longer disturbed the enemy effectively. As Eternal's forces dwindled to ten thousand, retreat became impossible—they'd begun damaging Bairan's gates and walls with desperate ferocity.\n\n\"This is bad.\" \n\n**Kuuong! Kung!**\n\nThe siege weapons hammered relentlessly. Gate durability plummeted with each strike. The moment her connection time limit expired, Yura logged back in and felt anxiety seize her chest.\n\n\"It's over the moment we let them inside.\"\n\nCould Yura and the Overgeared members handle thousands of enemies flooding through broken gates? The invaders would slaughter Overgeared soldiers and trample everything in Bairan.\n\n\"Damn it...\" Pon gritted his teeth. \"I want to sortie and break their momentum. But if I open the gates now, they'll just pour in.\"\n\nHis stamina hovered near depletion. If he left the castle's protection, he wouldn't be able to use any skills.\n\nIn this desperate moment, both Yura and Pon received a whisper from Lauel.\n\n—*Lead the remaining troops and retreat to Patrian.*\n\nPon's response came sharp and immediate.\n\n—*What about the people?*\n\n—*In the end, Bairan's people are still Eternal citizens. Why would the army bother killing non-combatants? Retreat with confidence.*\n\n—*They serve the rebel Grid. Are you certain they won't be massacred?*\n\n—*The enemy will be too busy looting and celebrating their victory. But what choice do we have? We can't lose soldiers we've worked so hard to train.*\n\n—*You...!* Fury crackled through Pon's mental voice. *Can you so easily abandon people who believed in and served Grid?*\n\nBairan had originally been Tzedakah Guild territory. Pon and his guild had spent years alongside these people. Abandoning them wasn't \"easy\" at all.\n\nLauel recognized this, but they were at war. Individual sentiment couldn't dictate strategy.\n\n—*Would you sacrifice tens of thousands in Reidan to protect thousands here? Shouldn't you think more calmly?*\n\n—*Kuack!*\n\nPon's teeth ground together. His mind understood Lauel's logic. His heart revolted against it. Words he shouldn't say burst free:\n\n—*This is because **you're** incompetent! What happened to \"We'll endure their offensive\"? \"They can't organize a hundred thousand troops for long\"? Stop spouting nonsense! Everything you predicted was **wrong!** You incompetent—*\n\nHis voice faltered. Shrank. Pon realized his mistake too late.\n\nWho was Lauel?\n\nSomeone who worked harder than anyone else for Overgeared. Who carried the heaviest burdens alone—burdens they'd all placed on his shoulders. Burdens they hadn't helped him bear nearly enough. And now Pon blamed him when circumstances turned dire?\n\n—*...I'm sorry.*\n\nThe apology came from deep in Pon's chest. Sincere. Pained. Because it was Lauel.\n\n—*No. I'm the one who should apologize.* Lauel's mental voice carried quiet weight. *In fact, I've been deceiving you.*\n\n—*...What?*\n\n—*To fool your enemies, you must first fool your allies. I kept a plan secret, hoping you'd all fight more fiercely without knowing.*\n\nWhat was Lauel saying? Pon couldn't process it.\n\n—*Right now, I'm marching on Reinhardt.*\n\n—*What...!*\n\nReinhardt. The Eternal Kingdom's capital. With most troops deployed to Bairan and Patrian, it stood nearly defenseless. Lauel was leading his army straight to the heart.\n\n—*This war will end soon.*\n\n***\n\nAt the same time, in a mysterious place shrouded in shadow, Sticks coughed blood. His face had gone deathly pale.\n\nGrid watched with deep concern.\n\n*Of all the timing for a heart attack...*\n\nDozens of minutes ago, Mass Teleport had activated at Patrian. The gourmet dragon Reiders's curse struck Sticks at precisely the wrong moment—he'd failed to manage his mana properly. The spell destabilized, and Grid and Sticks materialized... somewhere else entirely.\n\n*A place where whispers don't work.*\n\nThey'd fallen into a strange location. An instant dungeon where visibility barely extended beyond arm's reach. What was happening at Bairan? To Yura and the others? Grid's nerves screamed with anxiety, but he couldn't express his frustration to Sticks. \n\nInstead, he waited quietly while Sticks took his medicine and fought to recover.\n\n*Is this the bad luck that comes from creating a myth-rated bow?*\n\nGrid desperately wanted to punch that gourmet dragon right in its smug stomach."
}