{
  "id": 558,
  "title": "Chapter 558",
  "content": "**Cough! Cough!**\n\nSticks doubled over, hand pressed to his chest as another fit wracked his body. When he finally looked up, his face was pale as death.\n\n\"I-I'm truly sorry,\" he wheezed. \"In this situation... I don't want to be a burden.\"\n\nDespite appearing on death's door, the high elf's concern was for Overgeared rather than himself. Grid appreciated that—it was exactly the kind of loyalty he valued.\n\n*I pushed him too hard with all those Mass Teleports...*\n\nThere was no point in frustration. Grid wasn't in any position to worry about Sticks' condition, yet he couldn't help the pang of guilt and concern that twisted in his chest. He forced his expression into something benevolent, masking his anxiety with a smile.\n\n\"Don't worry about us. Just focus on recovering.\" Grid's voice was warm. \"You need to live a long and healthy life to pass all your knowledge on to my son.\"\n\n\"G-Grid...\"\n\nSticks' voice trembled. His pointed ears—the unmistakable mark of a high elf—actually quivered! Color flooded his beautiful face as emotion overwhelmed him. Grid assumed Sticks was touched by his concern for the elf's longevity.\n\nHe was wrong.\n\n\"Only wanting me to give knowledge to young Lord Steim...\" Sticks' eyes widened in sudden panic. \"Does that mean you want me to live a *short* life? Huh? Do you want me to die early? I don't want to...\"\n\n\"...\"\n\nGrid's benevolent smile froze on his face.\n\nAs a high elf, Sticks possessed an almost obsessive attachment to life. At **983 years old**, he'd cultivated quite the survival instinct. An awkward silence stretched between them before Sticks suddenly stiffened.\n\n*This powerful magic energy! Don't tell me—!*\n\nThe elf's self-preservation instincts kicked into overdrive. He needed to recover. He needed to *escape*. Sticks began frantically channeling his remaining strength toward healing.\n\nMeanwhile, Braham's soul roiled with unease inside Grid's consciousness.\n\n*'If this pathetic elf doesn't recover soon, Grid will die.'*\n\nGrid never should have come to this cursed place. Braham's whisper echoed through Grid's mind, urgent and sharp.\n\n*'That elf will recover quickly enough. Don't waste time—start gathering Magic Missiles with Alarm magic attached.'*\n\nGrid gave a slight nod.\n\n\"I'll do that.\"\n\nHe was deeply unsettled by this location. His high **Insight** stat screamed warnings about something lurking in the depths of that oppressive darkness.\n\n*My pride is hurt,* Grid thought bitterly. *After trying so hard, I'm still this weak.*\n\nThe realization stung, but he channeled the frustration into action. Grid cast Magic Missile after Magic Missile, layering each one with Alarm magic. His mana potion supply dwindled at an alarming rate—each loss physically painful to his thrifty soul—but this wasn't the time to pinch pennies.\n\nAn hour later, they departed for Bairan.\n\n---\n\n**BOOM! BOOM!**\n\n**KRA-KA-KA-KRAAASH!**\n\n\"Ohhhhh!\"\n\n\"Finally!\"\n\nBairan's southern gate, battered by a week of relentless bombardment from siege weapons, finally gave way. The structure collapsed in a thunderous cascade of stone and splintered wood. Eternal's soldiers erupted in cheers. The players, especially, roared with triumph.\n\nOver the past week of brutal combat, most of them had died multiple times. The experience loss had been severe. Some had dropped expensive equipment. The fierce counterattacks from Overgeared members had brought them nothing but pain and frustration.\n\nBut that frustration ended today. Now it was time to reap their rewards for all the sacrifices they'd made!\n\n\"Forward! Open fire!\"\n\n\"Enter Bairan! Crush the Overgeared members first!\"\n\n\"Waaahhhhhhhh!\"\n\nThe players' quest objective was simple: occupy Bairan. Success would grant rewards equivalent to an **SS-grade quest**—enough to change an ordinary player's entire life. Their momentum surged like a tidal wave. Additional rewards awaited those who defeated Overgeared members or soldiers. As they poured into Bairan, they scrambled up the walls and fell upon the Overgeared archers.\n\n\"You damn scum! I lost *levels* because of you! Get lost!\"\n\n\"Revenge!\"\n\n\"Kuak!\"\n\nThe Overgeared soldiers, equipped with Grid Set items, were formidable opponents. Players of equal level couldn't defeat them in one-on-one combat. Even at identical levels, Overgeared soldiers outclassed Eternal's players.\n\nHowever, the defenders were exhausted. Their numbers were too few.\n\nWave after wave of enemies crashed against them. The Overgeared soldiers wielded **Grid's Dagger (Entry Level)**, desperately trying to protect themselves, but the situation was unsustainable. One by one, they dissolved into grey light. \n\nThe Overgeared members watching this seethed with rage. How much time had they invested in those soldiers? How much *gold*?\n\n\"You didn't even attend your own mother's funeral for this!\"\n\nHuroi's anguished cry rang across the battlefield as he drew a longsword—Grid's Longsword, constantly upgraded since their days in Winston. \n\nThe attacking players burst into laughter.\n\n\"An Orator is holding a sword?\"\n\n\"There's no way he can even use it!\"\n\nOrators were notoriously terrible in close combat—among the weakest classes for melee fighting. The players didn't even hesitate, treating the sword in Huroi's hands as mere decoration.\n\nThey'd forgotten about second classes.\n\nAs the **Apostle of Justice's Partner**, Huroi could wield a sword.\n\n*Chaeng!*\n\n*Seokeok!*\n\n*Chaaeng!*\n\n*Puuok!*\n\n\"Keok!\"\n\n\"Heeok!\"\n\nEach swing of Huroi's blade dropped a player. Shock rippled through their ranks.\n\n\"How can an Orator use a sword?!\"\n\n\"It's a second class!\"\n\nThe realization came too late.\n\n\"Descend, Bah! **Lord of the Skies above the Grasslands!**\"\n\nHuroi's voice, thick with excitement, echoed across the battlefield.\n\n**Kiyaaaaaah!**\n\n\"...!\"\n\nA dazzling flash split the sky. An enormous wyvern materialized—and not just any wyvern, but a red one! The strongest fire-attribute variant!\n\n**Kurururu!**\n\nThe red wyvern unleashed its breath. Fifty Eternal players were engulfed in flames.\n\n\"Aaaagh!\"\n\n\"H-Hik!\"\n\nTerror gripped them as fire consumed their bodies. Lower-level players couldn't withstand the damage and perished instantly.\n\n\"T-This...\"\n\nHow was he this strong?\n\n\"I thought he was all talk!\"\n\n---\n\nAt the southern wall, Huroi stood alone—the only Overgeared member defending this position.\n\nThe players had assumed they could easily overrun it. Reality proved far more terrible. Unlike Yura and Pon, Huroi hadn't been on the front lines constantly. His stamina remained high. More importantly, he was one of only **one hundred people** who owned a wyvern.\n\nStrong. Devastatingly strong.\n\nThe southern wall became hell for Eternal.\n\n\"I am the descendant of the great blue wolf!\"\n\n*Seokeok! Puk!*\n\n**Kwarururung!**\n\nMounted on his wyvern, Huroi rained fire on Eternal's players. Dozens of cameras captured the moment as he proclaimed to the entire world:\n\n\"I am Grid's first servant!\"\n\n\"Ser...!\"\n\n\"...vant!\"\n\nA top-ranked player was merely Grid's *servant*! Stunned Eternal soldiers were swept away by flames before they could fully process this revelation.\n\n---\n\nAt the eastern wall, Pon watched Huroi's performance with frank admiration.\n\n\"He's fighting incredibly well.\"\n\nThe reason Pon had placed such a small unit at the south wall was his faith in Huroi's strength. Now that faith had been validated.\n\n\"Huroi is top-class, no question,\" Pon murmured.\n\nEuphemina and Huroi—the two who'd been with Grid from the very beginning. Unlike other Overgeared members, they rarely appeared in public. Yet they possessed the highest combat power and versatility among the entire guild. There was a reason they'd joined Grid from the start.\n\n*Grid has a talent for recognizing people,* Pon thought.\n\nThe other Overgeared members interrupted his musings.\n\n\"The gates are collapsing. We'll be overrun soon.\"\n\n\"Let's retreat while Huroi buys us time.\"\n\nIt was time to flee through the north gate that Yura had secured. Huroi could escape at any moment on his wyvern.\n\n\"Yes, let's move. Order a full retreat,\" Pon decided.\n\nHe was concerned about Bairan's residents, but he had to trust Lauel's plan. The residents were fundamentally Eternal's people. The Eternal army wouldn't slaughter them.\n\n\"Full retreat!\"\n\n\"Everyone to the north gate!\"\n\nThe Overgeared members moved with disciplined efficiency. They quickly commanded the soldiers and archers on the walls, directing them toward the north gate. The northern wall already contained Overgeared's elite forces, including Yura, who'd opened their escape route.\n\nHowever, Eternal didn't simply watch them go.\n\nEternal knights rushed to intercept them at the north. Magic and arrows poured from all directions, pinning down the retreating Overgeared forces. The knights attacked, inflicting heavy casualties.\n\n\"Shit!\"\n\nHandling knights was no easy task unless you were Grid himself. With their stamina depleted, the Overgeared members couldn't use skills and were caught in the enemy's net.\n\n\"**(#%$/@!P$#~*$!%##((:*!!!!**\"\n\nHigh in the sky, Huroi's voice boomed across the battlefield. His curses spread like poison through Eternal's ranks—the moment when an Orator's skills truly activated.\n\n\"That... wicked person!\"\n\n\"How dare you insult my dead ancestors!\"\n\n\"Do you have no parents?!\"\n\nAs Eternal's army converged on Huroi in outrage, broadcasters around the world scrambled desperately to censor his tirade.\n\n\"Now!\"\n\nThe Overgeared members seized their opening and pushed forward. They secured their retreat and withdrew from Bairan.\n\n---\n\n**> The Overgeared Guild has abandoned Bairan.**\n\n『 There were limits from the beginning. They would've been annihilated if they'd persisted any longer. 』\n\n『 Bairan is just the beginning. Eternal has secured the route to attack Patrian by occupying Bairan. Now they can launch a full offensive, and the Overgeared Guild won't be able to withstand it. They'll lose Patrian and Reidan sequentially. 』\n\n『 It's only a matter of time before all Overgeared territories fall. 』\n\n『 This is the aftermath of expanding too hastily. They couldn't avoid economic and diplomatic catastrophe. The Overgeared Guild will have to lie low like dead rats for at least a year. 』\n\nBairan had been the stage for intense warfare over the past week. Now Eternal's flags pierced the ruined walls like victory banners. With Bairan once again under Eternal Kingdom control, thousands of players who'd participated in the occupation were bathed in golden pillars of light—the unmistakable symbol of leveling up. The experience gains had been enormous, raising both levels and skills. They rejoiced over the epic and unique-rated items they'd received.\n\nThe commentators analyzing the war predicted future developments.\n\n『 Eternal's players have grown exponentially stronger in an instant. They're benefiting from the Overgeared Guild's rebellion. 』\n\n『 The King of Eternal is still young. Opportunities are everywhere. With their growing military power, they'll soon invade the Gauss Kingdom and expand their territory. 』\n\n『 The future of the West Continent might... Eh? What's this? 』\n\nThe commentators' voices trailed off in confusion.\n\n**Duong! Duong!**\n\n**Kung! Kung! Kung!**\n\nThe thunderous march of a hundred thousand soldiers! The rhythmic pounding of war drums! A procession clad in gleaming golden armor advanced on Bairan. The commentators had covered countless events in Satisfy, but this was the first time they'd been struck speechless.\n\n『 Eternal's army...! 』\n\n『 This is massive! This enormous force will soon advance on Patrian! 』\n\nExcitement flooded the commentators' voices. They couldn't help it—witnessing a hundred-thousand-strong army for the first time was overwhelming. The viewers felt the same way, gaining a visceral understanding of what true war looked like, of just how powerful a single kingdom could be.\n\nThanks to this spectacle, viewership for Bairan's battle skyrocketed.\n\nHowever, the broadcasting stations soon found themselves cutting away with tears in their eyes.\n\nWhy? Because Duke Lucilliv, commander-in-chief of the hundred-thousand-strong army, was attempting something unconscionable. After gathering thousands of Bairan's residents in the city center, he'd forced them into a line—with bows aimed directly at them.\n\n『 S-Surely he isn't going to execute so many people? 』\n\n『 They're just ordinary civilians. Their lord rebelled—why should *they* be held responsible and put to death? 』\n\n『 This is absolutely terrible. 』\n\nDiscomfort rippled through commentators and viewers alike. The Bairan residents were going to be executed simply for being Grid's people. No one could bear to watch as people—young and old alike—wept in terror, facing a wall of drawn bows. The broadcasters realized this wasn't suitable for younger viewers and prepared to cut the feed.\n\n**Pahat.**\n\nLight flashed across the sky.\n\nA figure materialized, surrounded by hundreds of white spheres. The breeze caught his black hair, revealing sharp, determined eyes.\n\n\"Grid!\"\n\nYes—Grid himself had appeared before a hundred thousand soldiers! The master of this rebellion stood before Eternal's entire army! Duke Lucilliv froze for a heartbeat before bellowing:\n\n\"Capture him!\"\n\n**> The quest 'Fight the Rebel Leader' has been created!**\n\nThe Eternal players received a new quest notification.\n\nGrid glanced around, then broke into a nervous sweat.\n\n\"Uh... why isn't anyone here...?\"\n\nThe timing of his dramatic entrance couldn't have been worse."
}