{
  "id": 559,
  "title": "Chapter 559",
  "content": "# Chapter: Massacre at Bairan's Heart\n\nThe center of Bairan had become an execution ground.\n\nOver nine thousand residents knelt in bound rows, their faces pale with terror as Duke Lucilliv's voice rang across the square.\n\n\"You remained here even after Bairan fell to rebel hands. That alone condemns you.\" His words carried the weight of a judge pronouncing sentence. \"Your taxes fed the rebels. Your labor sustained them. You stand complicit against the royal family.\"\n\nThe proclamation stripped them of their citizenship in a single breath.\n\nDuke Lucilliv's gaze swept over the masses without a trace of mercy. \"They have forfeited the right to live on Eternal's soil. Execute them. Wipe out every generation. Tear down the graves of their ancestors.\"\n\n\"...!\"\n\nThe injustice of it stole their breath. A few brave souls tried to plead for clemency, but senior magicians silenced them with spellwork before the first word could escape their lips.\n\n\"Hngh...! Mmph!\"\n\n*They can't even let us speak?* Desperation flooded their eyes. Parents wanted to beg for their children. Children wanted to save their elders. But Duke Lucilliv's hand fell like an executioner's blade.\n\n\"Kill them.\"\n\n\"Mmph! Mmph!\"\n\nThe residents thrashed against their bonds, but the ropes held firm. Soldiers forced them still as archers drew their bowstrings taut.\n\n\"This can't be happening...\"\n\nMore than half the hundred-thousand-strong army consisted of conscripts. They trembled as they witnessed the nightmare unfolding before them.\n\n\"They're really going to slaughter everyone?\"\n\n\"This is madness... How are they guilty? Wasn't it the kingdom's incompetence that lost this land in the first place? Why blame the people?\"\n\n\"Death for simply being here when rebels arrived? Even children too young to understand!\"\n\nThe realization struck them like a hammer blow—their commander cared nothing for civilian lives. Morale plummeted. The common soldiers, already pushed to their limits by the grueling march from Partu, lost what little faith remained in their leadership. Physical exhaustion met spiritual collapse.\n\n*From this point forward, only fear will keep them in line,* Asmophel thought, his expression grim beneath his disguise as Private Ars.\n\n*There'll be more deserters tonight.* The number who'd fled on the march from Partu approached six thousand. It would soon exceed ten thousand. Asmophel's gaze fixed on Duke Lucilliv's back.\n\n*An opportunity will present itself soon.*\n\nDuke Lucilliv had vulnerabilities he didn't recognize. The command structure would fracture under this brutality, creating chaos. If the duke exposed a weakness in that confusion... But the man prioritized his own safety above all else. Three hundred guards and ten senior magicians formed a constant shield around him, making assassination nearly impossible.\n\n*If I can't find an opening, I'll charge the front lines.*\n\nHe didn't fear sacrificing his life for his master. Grid had saved him when he had nothing left to live for. His life belonged to his lord now.\n\n*I'll entrust my vengeance against the emperor to Piaro.*\n\nA bittersweet smile touched his lips—\n\n*Paaaat!*\n\nLight blazed across the sky. Grid materialized above the square.\n\n\"M-My Lord...?\"\n\nShock coursed through Asmophel, hidden among the ranks as Private Ars from Partu.\n\n*Why is My Lord here?* The troops defending Bairan had already retreated! Why would Grid return alone?\n\n*Unless...*\n\n*He came to save the people left behind?*\n\n\"Unbelievable...\"\n\nOne lord. One hundred thousand soldiers. Grid stood between them for the sake of his people. Heat surged through Asmophel's chest as he gazed skyward.\n\n\"I want to witness the kingdom My Lord will build.\"\n\nA king who valued his people above his own survival. It defied logic. The king was irreplaceable, yet he risked death for commoners? During his days as a noble, Asmophel would have mocked such foolishness.\n\nBut that was before he'd lived as a common soldier. Now, from that perspective, his heart sang a different tune. Grid looked magnificent. What kind of kingdom would such a man create? Asmophel burned to know.\n\n*I will protect you. I'll be the sword that enforces your will and upholds your faith.*\n\n*Kkuok!*\n\nAsmophel's hands trembled around his spear shaft. As magical bombardments began raining down on Grid, he started moving through the hundred-thousand-strong army.\n\n***\n\n\"Huh?\"\n\nGrid blinked in confusion when he arrived in Bairan with Sticks via Mass Teleport. The familiar faces were gone. An enemy army filled the city instead.\n\n\"Where is everyone...?\"\n\nHis gaze caught on golden banners planted atop the walls, flying Eternal's colors. Soldiers in gleaming armor swarmed the streets below.\n\n\"...You? Shit.\"\n\nGrid's expression darkened. For a moment, panic seized him.\n\n\"Are they dead?\"\n\nThese bastards had stolen his territory! Had they killed his people, his soldiers? Rage threatened to consume him. Beside him, Sticks—exhausted from casting Mass Teleport repeatedly—hastily intervened.\n\n\"Hah... Hah... Grid, calm yourself. Do you truly believe your soldiers and knights would fall so easily?\"\n\nThey stood in the heart of enemy territory. Soldiers surrounded them like grains of sand in a desert. If Grid lost control and acted on emotion, death was certain. Sticks's reminder brought Grid back to his senses. He opened the guild chat.\n\n**@Grid:** What happened to our forces defending Bairan?\n\n**@Pon:** We couldn't hold it. Had to retreat. Sorry we lost the city, Grid. We'll take it back, I promise.\n\n**@Ibellin:** Brother Grid! Why are you back so soon? I thought you were staying on the East Continent?\n\n**@Vantner:** The bow you gave Jishuka is incredible! Absolutely phenomenal!\n\n\"Phew...\"\n\nRelief washed through Grid at Pon's response. He'd feared the worst—total annihilation of his forces.\n\n\"Let's go. It was a strategic withdrawal.\"\n\nThe enemy numbers were staggering. Grid had never seen such a massive army, not even on television. Fighting them alone seemed impossible.\n\n\"...?\"\n\nThen Grid noticed the Bairan residents. Every man, woman, and child bound in rows. Condemned to death. He followed the trajectory of the archers' aim.\n\n*Flinch.*\n\nGrid froze.\n\nSmith, who'd taught him to craft Jaffa arrows. The young men he'd repaired walls alongside after repelling the Yatan Church invasion. The girl who'd given him fruit. The elders who'd shared their stories. People he'd bonded with during his early days—all of them here.\n\n*They're going to be killed?*\n\nFury erupted within him. Grid valued his bonds above all else. Eternal trying to 'steal' what belonged to him was unforgivable.\n\n\"Grid?\"\n\nEnemy archers and magicians began their assault. Sticks conjured a shield spell, his expression uneasy as attacks filled the sky. Grid's face had turned grave.\n\n\"Sticks, head to Patrian first.\"\n\nIndeed.\n\n\"You can't seriously mean to fight such a massive army alone? It's out of the question. There are one hundred thousand enemies. I know you're strong, but facing that many is suicide...\"\n\n\"Would it not be shameful to retreat now? I'm the leader of Overgeared. If I run when I meet the enemy, it disgraces my comrades who fought for me.\"\n\nGrid was acutely aware of broadcasting cameras from around the world focused on him.\n\n*Watch this.*\n\nHis power had grown exponentially since the 2nd National Competition. Had he closed the gap to the world's best? This was the perfect opportunity to let people evaluate his strength. Besides, he was curious himself. Could he make a difference in a one-versus-hundred-thousand battle?\n\n*Twenty minutes until the Magic Missile alarms trigger.*\n\nHe'd fight with everything he had until then.\n\n*Top priority: secure the civilians' escape.*\n\nBraham's whisper echoed in his mind.\n\n*Do you comprehend? For a legend, numbers are meaningless. A legend doesn't fear one million enemies, let alone one hundred thousand. In other words, if you and I combine our power, these hundred thousand soldiers... Well, cooperation isn't strictly necessary.*\n\nOnly transcendent beings could challenge transcendent beings. A handful existed at that level. Grid nodded, grinning.\n\n*I'll assess the situation and summon you if needed.*\n\n*Bah. Very well, if you insist.*\n\nGrid confirmed Braham's answer, his eyes hardening with determination.\n\n*This is my chance to measure the gap between me and the previous legends.*\n\nLantier on the Behen Archipelago came to mind first.\n\n\"I'll measure myself against this army, then challenge him again!\"\n\n*Chiiiiing!*\n\nHundreds of white spheres materialized around Grid's body. His first objective: eliminate the archers targeting Bairan's residents.\n\n\"**Pagma's Swordsmanship, Transcend.**\"\n\n> **[Attack power is doubled. Your basic attacks will be converted to ranged attacks. This effect will last for 30 seconds.]**\n\n\"Normal attacks will suffice.\"\n\n*Kwa kwang!*\n\n*Kwa kwa kwa kwa kwa kwa kwa kwa!*\n\nGrid separated Sword Ghost into its two components and swung both arms in a relentless blur. Seven to eight energy blades per second rained from the sky onto the Eternal archers.\n\n\"Kuaaaack!\"\n\nChaos erupted instantly. Hundreds of soldiers fell dead. The firepower was devastating!\n\n\"Eek! Dispel his flight magic!\"\n\nMarquis Bera's shout rang out urgently. A magician from his territory immediately cast the counterspell—affecting the mana circuits of all spellcasters in range, severing access to Fly. Yet the magic failed to ground Grid. He flew using Braham's Boots, not his own magical power.\n\n\"No! The spell didn't work?\"\n\n\"It's a magic artifact!\"\n\nPanic spread among the magicians as their difficult spell was wasted. But a hundred thousand soldiers provided overwhelming redundancy. While the mages floundered, others attacked.\n\n\"Shoot! Keep shooting!\"\n\nElite soldiers converged from multiple directions. They shattered Sticks's shield with concentrated arrow and spell fire, then focused everything on Grid. Fully exposed in the air, Grid became an easy target.\n\n*Being hit while airborne is deadly.*\n\nAfter absorbing several magical bombardments, Grid swapped boots and descended. Then surprise struck him. He'd deliberately landed in a narrow gap between buildings, yet enemies already filled all four sides.\n\n\"Die!\"\n\nThe Eternal soldiers surged forward. Their massive numbers made them forget Grid's power, lending them false courage.\n\n\"Hiyaaaah!\"\n\nTen soldiers thrust their spears forward simultaneously from directly ahead. Viewers worldwide wondered how Grid would respond.\n\n—*Impossible to counterattack all ten.*\n\n—*He'll probably wipe them with a skill. But that drains stamina.*\n\n—*How many will Grid kill total?*\n\n—*The Eternal soldiers average level 160... at least 5,000 casualties, I'd guess.*\n\nIt happened in the time it took viewers to type a single sentence.\n\n\"Get lost.\"\n\nGrid drew Failure and swung once. Just once. A normal attack.\n\n*Jjeejeeeong!*\n\n\"Kuaaaak!\"\n\nAll ten Eternal spearmen were struck down. Dead.\n\n—*...*\n\n—*...*\n\nChat windows across internet broadcasting sites went silent, as if the connection had lagged.\n\n\"This is fun.\"\n\nWhile the world held its breath, Grid laughed. Excitement flooded him knowing the entire planet watched. Yet he didn't grow careless. Among the hundred thousand troops lurked elite knights and powerful magicians. He maintained constant vigilance.\n\nMeanwhile, elsewhere on the battlefield, a group of third-advancement soldiers came under assault—from a single private."
}