{
  "id": 56,
  "title": "Chapter 56",
  "content": "# Chapter 56\n\nThe two men turned to Khan. One of them spoke.\n\n\"Didn't you team up with your successor for the competition? He must have noticed something about Erina.\"\n\nKhan shook his head. \"I couldn't say.\"\n\nGrid kept his face neutral. *These idiots can't even figure out I'm Khan's successor.* They probably assumed some beginner loitering around a smithy couldn't possibly be the heir to a prestigious blacksmith's legacy.\n\nThe interrogator's jaw tightened. Whether frustrated by the lack of information or simply dismissive of an old NPC, the men left without another word.\n\nGrid pulled salt from his inventory and scattered it across the smithy entrance.\n\n\"Good riddance. Don't come back.\"\n\nKhan scratched his head. \"Shouldn't you be using coarse salt for that?\"\n\n\"Right.\" Grid cleared his throat. \"Let's get back to work.\"\n\nHe turned toward the furnace. Khan's voice stopped him.\n\n\"Are you going to work today without resting?\"\n\n\"Of course.\"\n\n\"The more I watch you, the more impressed I am. You already have excellent skills, but you aren't satisfied. You keep pushing yourself.\"\n\n*Excellent skills.* Grid suppressed a bitter laugh. If his skills were truly excellent, he would have created at least one <span class=\"rarity-unique\">Unique</span> or <span class=\"rarity-legendary\">Legendary</span> item among the seventy-three pieces he'd crafted. Instead, he'd managed a pathetic three <span class=\"rarity-epic\">Epic</span> ratings and nothing higher.\n\n*Still lacking. Need to raise my skill level. Make real money. Show my parents I'm not worthless.*\n\nThe problem was time. He had so little of it.\n\n*Clang. Clang.*\n\nGrid concentrated on the work. Khan settled at the counter, selling Grid's creations to the steady stream of customers. It was a beautiful system. Other production-class users would turn green with envy if they knew.\n\nMost crafters had three options for selling their work. First, open a street stall and deal with customers directly. That meant wasting hours waiting for buyers, then suffering through endless haggling. Second, use the auction house. Convenient, but the fees ate into profits. Third, post items on cash transaction sites. Same problem with fees.\n\nEvery method cost either time or money.\n\nGrid's arrangement was different. Khan handled all sales. No waiting. No haggling. No commission fees. Grid just made the items, and Khan sold them and handed over the proceeds.\n\n*If I keep producing two items per day, I'll get rich eventually.*\n\n\"Still waiting!\" Grid slammed his hammer down. \"This is garbage. No, this is bullshit. Does this make sense? I'm a legendary class. Why can't I make a legendary item?\"\n\n***\n\nS.A. Group Headquarters, Operations Team.\n\nAn employee opened the latest customer service email.\n\n**Subject: Look and you will see.**\n\n**Contents: If you look at my information, you can see I'm a legendary blacksmith. So why can't I make any legendary items? If I'm a legendary blacksmith, isn't it normal for me to make legendary items? No, I didn't do anything else for a month and made 73 items, but there were no legendary items at all. Yes? I didn't create a single unique item and only made three epic items, so isn't this manipulation? Yes? You're probably manipulating this, right? Huh? Right? Ah, look. This is really... Do you want me to snap? Should I come there? Eh? The materials and production method are good, so isn't this manipulation, you bastards?**\n\nThe employee stared at the screen. \"What manipulation? He should raise his level first.\"\n\nA level 10 user and a level 100 user could have identical Dexterity stats and skill levels. The level 100 user would still produce higher-rated items more often. The creator's level directly influenced item quality. Every production-class player knew this.\n\nApparently, not this legendary class holder.\n\nThe employee sighed. Several coworkers gathered around the screen.\n\n\"It's painful to see that class wasted on him.\"\n\n\"If the email's accurate, he's genuinely unlucky.\" Another employee leaned closer. \"With Legendary Blacksmith's Craftsmanship, only three epic items from seventy-three attempts? Unique and legendary items have low base chances, sure, but epic items have fixed probability thresholds. He really does seem cursed.\"\n\nMurmurs of sympathy rippled through the group.\n\n\"Bad luck personified.\"\n\n\"No wonder he thinks it's rigged.\"\n\n\"If we could actually intervene, I'd boost his rates out of pity.\"\n\nFrom that day forward, Grid became famous among the game operators for his terrible luck.\n\n***\n\nSeventy-three items. All weapons and armor with level 60 restrictions. Total sales revenue of 1,590 gold. Net profit after materials: 1,079 gold.\n\nGrid converted the numbers in his head. 1,294,800 won in cash.\n\nFive to six hours of gameplay per day had earned him roughly 1.3 million won in a month. If he quit the labor office, he could triple that income. And if he ever managed to craft a <span class=\"rarity-unique\">Unique</span> or <span class=\"rarity-legendary\">Legendary</span> item, he could pull in tens of millions of won.\n\nBut his parents didn't agree. They knew the statistics. Most people lost money trying to monetize games. Grid had been playing for over a year and still hadn't escaped his debt.\n\nIn their eyes, and in society's eyes, he remained a credit risk. His parents' refusal overlapped with the first and second financial institutions that had rejected his loan applications.\n\n*Should I sell the Ideal Dagger? No. Not yet.*\n\nThe <span class=\"rarity-unique\">Ideal Dagger</span> could serve as proof to his parents that Satisfy was viable income. But he couldn't sell it. Not now.\n\nThe dagger required Advanced Dagger Mastery as a passive skill. Current top rankers in each class only possessed intermediate-level masteries. If Grid listed the dagger on trading sites now, only merchants thinking about future profits would bid. They'd lowball him mercilessly. He needed to wait.\n\nFour in the morning.\n\nGrid stared at the ceiling, dreading the labor office. *Do I have to live like this forever?*\n\nFour in the morning. Most people were still dreaming. But Grid would work until six in the evening for 90,000 won per day, destroying his body in the process. He could endure it when manual labor was his only income source. Things were different now.\n\nHe made more money playing the game than breaking his back at construction sites. Going to the labor office was a waste of time.\n\n\"Shit.\" He sat up. \"I want a unique or legendary item. Or enough epic items to convince my parents I'm profitable. God, I feel angry the moment I wake up.\"\n\nHe needed air. Grid pushed himself up and headed for the door.\n\nA flyer jutted from the newspaper slot.\n\n**[September 10th! Grand Opening!**\n**The Best Capsule Room in Seoul!**\n**150 Top-of-the-Line Capsules!**\n**Full Café Facilities!**\n**Delicious Food from 5-Star Hotel Chefs!**\n**Beautiful Staff!**\n*** Please don't ask employees for their phone numbers.**\n**September 10th ONLY! Sign up today and receive a LIFETIME 30% DISCOUNT!]**\n\nGrid's pulse quickened. A lifetime discount on capsule room fees? Standard rate was 6,000 won per hour. With a thirty percent discount...\n\n\"This is it.\"\n\nAn idea crystallized in his mind. He spun back toward his room, yanked on his work clothes, and headed for the door.\n\nHis mother appeared in the hallway, blinking. \"Your work clothes? Are you leaving already? It's only 4:10.\"\n\nGrid nodded vigorously. \"That's right! Going to work!\"\n\n\"Why are you so energetic?\"\n\n\"Because I'm young! Mother, Father, I'm heading out early today!\"\n\n\"Youngwoo, are you feeling all right?\"\n\n\"I'm worried about him.\"\n\nGrid left the house while his parents exchanged concerned glances. Today was September 10th. He made his way through the pre-dawn streets, searching for the newly opened capsule room. Colorful banners hung outside a building, announcing the grand opening.\n\n\"This is my new job starting today.\"\n\nHe was quitting manual labor. From now on, he'd play Satisfy from the moment he woke until he collapsed. Mornings and afternoons in the capsule room. Evenings and nights at home.\n\n*Now I can work harder making items.*\n\n***\n\nRecently, Khan's smithy had become a source of interest among users.\n\nAmong the items sold there, certain level 60 equipment pieces stood out. They were crafted by someone with obvious talent and potential, but lacking experience and reputation. The equipment had roughly twenty percent better performance than standard items. Even the Normal-rated pieces compared favorably to <span class=\"rarity-rare\">Rare</span>-rated equivalents at the same level.\n\nUsers called them the \"Unknown Craftsman Series.\" They were expensive, but performance justified the cost. Players couldn't live without them.\n\nUsers visited Khan's smithy daily.\n\n\"Did the unknown craftsman make any more items?\"\n\n\"I'll buy everything he made! Name your price!\"\n\n\"Give me his name. I want to commission him personally. Where can I meet him?\"\n\nThe users wanted items from the unknown craftsman. They wanted to know his identity.\n\nKhan never answered. Grid made a limited number of items due to time constraints. He didn't want others to know who he was.\n\n*Clang. Clang.*\n\nThe crowd at the counter never imagined that the beginner user hammering away at the furnace behind Khan was the craftsman they sought."
}