{
  "id": 560,
  "title": "Chapter 560",
  "content": "Blood painted the cobblestones beneath the blazing sun, each scream echoing across the central square. Grid's bizarre half-mask—frozen between laughter and tears—gave nothing away as his shark-shaped blue greatsword carved through armor and flesh. Each half-circle swing claimed ten lives. Twenty when he completed the full moon arc.\n\n\"The rumors about his swordsmanship being strong... they weren't exaggerated,\" Baron Duka muttered from his perch atop the clock tower.\n\nGrid's reputation as a swordsman was well established. But there was something the Baron couldn't quite identify.\n\n\"What are those white spheres circling him?\"\n\nBaron Duka—one of the great swordsmen who had emerged after Chucksley—leaned forward, squinting at the spectacle below. Duke Lucilliv had already promised him an earldom for his service in this war. If he personally took Grid's head? A marquis title would be his.\n\nHis deputy stepped closer. \"According to the magicians' analysis, they're Magic Missiles. Likely sustained through an artifact, similar to how Fly magic operates.\"\n\n\"Interesting... Magic Missiles held in reserve rather than immediately launched.\"\n\nBaron Duka counted them. One hundred and thirteen white spheres orbited Grid's position. The purpose was obvious—a defensive measure. Grid was keeping them ready to unleash when crisis struck.\n\n*And then there are the four golden hands...*\n\nBaron Duka's gaze tracked the God Hands guarding Grid's flanks, each one wielding a hammer. What amazed him was their lethality—every swing from those floating hands claimed another soldier's life.\n\n*Strong.*\n\nThe perfect synthesis of masterful swordsmanship and overwhelming artifacts. This was the power of a legend.\n\n*Perhaps if he wielded ordinary weapons, things would be different. But even then, I wouldn't dare face him alone.*\n\nStill, Baron Duka felt no fear. One hundred thousand troops surrounded Grid below. Eventually, the man would tire. He couldn't possibly block every attack—already, Grid was accumulating wounds from the magicians and archers positioned throughout the square.\n\n*Give it a few more hours. He'll be exhausted.*\n\nThen Baron Duka would descend with his knights and claim an easy victory.\n\n\"Hmm?\"\n\nA wicked smile crossed the Baron's face, only to freeze at the sound of footsteps ascending the stairs.\n\n*Step. Step.*\n\nBaron Duka had claimed the clock tower's sixth floor specifically for its vantage point, with strict orders that no one else was permitted above. So who would dare—\n\n*Marquis Bera?*\n\nNo one else had the authority. Baron Duka naturally assumed the footsteps belonged to a fellow noble. \n\nHe was wrong.\n\nThe figure that emerged wore simple leather armor—a conscripted private of the lowest rank.\n\n*How did a common soldier reach this position?*\n\nThe deputy moved forward on Baron Duka's behalf. \"Abandoning your post during battle is a court-martial offense. What unit are you with? No—why are you even here?\"\n\nThe soldier—identified as Private Ars—raised his spear in response. \"I serve under Grid. I came here today to claim Baron Duka's head.\"\n\n\"...?\"\n\n*Did he just hear a dog barking?*\n\nThe absurdity of the declaration left both Baron Duka and his deputy momentarily stunned.\n\n\"Haha.\"\n\nBaron Duka's laugh held no mirth. His deputy gave voice to their true feelings.\n\n\"You're insane.\"\n\nThe deputy's expression twisted with rage as he drew his sword without hesitation. \"A spy for Grid! I'll have your head!\"\n\nAs a master swordsman himself, the deputy could easily dispatch a single soldier.\n\n*Seokeok!*\n\nThe blade flashed toward Ars' neck with lethal precision. In an instant, the deputy's sword reached its target. He didn't even bother to watch—the soldier would die without realizing his head had left his shoulders.\n\nBut something felt wrong.\n\n*Wait—*\n\nWhere was the soldier whose head should have been severed? And why was the deputy's perspective tilting toward the ground?\n\n*Thud.*\n\nThe deputy's head hit the stone floor. He'd died without realizing it had been his own neck that was cut.\n\n\"...What are you really?\" Baron Duka's voice went cold.\n\nGrid's subordinate had moved faster than the eye could follow, using his spear to sever the deputy's head in a single stroke. Baron Duka stared at the scattered ashes of his second-in-command, then at the blood-slicked spear.\n\nArs retrieved the fallen sword. \"I am Grid's soldier.\"\n\n\"Nonsense!\"\n\nNo lowly soldier possessed the skill to make a great swordsman nervous! Killing intent blazed in Baron Duka's eyes as his blade shot toward Ars with a dual strike—two simultaneous cuts from left and right, no time gap between them.\n\n*Chaaeng!*\n\nArs angled his spear to intercept both strikes at once and laughed. \"Your swordsmanship is poor compared to other great swordsmen.\"\n\nBaron Duka had only recently achieved his rank. Compared to someone like Piaro during his prime with the Empire, the gap was vast. Ars had been growing steadily under Grid's command, and Baron Duka simply wasn't his match. The chill of realization crept up the Baron's spine.\n\n\"You are...! Kirinus!\"\n\nThe continent's finest spearman served Grid?\n\n\"Reidan's Spearsmanship, Third Style.\" Ars' voice rang out. \"Splitting the Seven Seas.\"\n\n*Peeeeeong!*\n\nGolden light erupted as Baron Duka's sword was deflected aside. The spear thrust forward in a perfect line—the same technique that even Nautilus of the Red Knights couldn't withstand. Baron Duka never stood a chance.\n\n\"Kuaaaack!\"\n\nThe golden flash consumed him, and he vanished into scattered light. Ars finished his mission and descended the clock tower. His next target: Earl Carrion, who had achieved the rank of great swordsman one step before Baron Duka. Ars would eliminate anyone who posed a threat to Grid.\n\n***\n\n*This is easier than I expected. Is it still too early to tell?*\n\nDeath in the game wasn't the same as death in reality—it wasn't a complete ending. Yet users feared it more than anything else. The terror of losing levels and hard-earned equipment drove that fear home.\n\nYes, Grid understood he looked insane, plunging alone into one hundred thousand troops. But his initial fear had evaporated in the heat of battle. As he displayed his overwhelming power, fear transformed into exhilaration.\n\n> **[Critical!]**\n> **[The +9 Failure's option effect is activated, causing the skill '5 Joint Attacks' to be generated!]**\n> **[You have dealt 155,900 damage to the target.]**\n> **[You have dealt 149,540 damage to the target.]**\n> **[You have dealt...]**\n\nThe general soldiers' levels, stats, and equipment were pathetic compared to Grid's. His basic attacks dealt skill-level damage—every soldier within range died in a single blow.\n\n\"Magic Missile.\"\n\nGrid conserved his stamina by refraining from skill usage. Magic Missile consumed no stamina since it was the lowest-tier spell, and with his increased maximum mana, the cost was negligible. Besides, he wanted to raise his Magic Mastery level acquired from the Behen Archipelago.\n\n\"You monster!\"\n\n\"Die!\"\n\n*Puk! Puuok!*\n\nGrid wasn't Kraugel. He possessed ranker-level control, but that didn't make him a god. He couldn't completely block every soldier's attack. But it didn't matter.\n\n> **[You have suffered 230 damage.]**\n> **[You have suffered 155 damage.]**\n\n\"Good, good. You're doing very well. Hit me more.\"\n\nThe benefits of receiving damage from multiple sources simultaneously were significant.\n\n> **[Weapons Mastery has risen to Lv. 5.]**\n> **[The experience of Tiramet's Belt (Unique) has increased by 0.01%!]**\n\nHis skill proficiency and item experience climbed at a tremendous rate. Grid was growing stronger in real time.\n\n*If this continues, Weapons Mastery might gain another level today. Tiramet's Belt could reach thirty percent experience.*\n\nWeapons Mastery passively increased his attack power and speed regardless of weapon type. Magic Mastery enhanced his magical damage. Tiramet's Belt reduced incoming damage and—if it reached legendary rating—would allow him to summon the vampire Tiramet.\n\nGrid savored his progression. It helped reduce the stress of his demonic power stat rising with each kill. In this moment, he perceived the battlefield as nothing more than a workplace. No tension. Why?\n\n*None of them are a match for me.*\n\nOne hundred thousand troops. The number was literally just that—a number. Not a single enemy here could threaten Grid.\n\n*Are there no knights?*\n\nBraham's voice echoed in his mind. *'The enemy is waiting for you to tire. Then they'll commit their true strength.'*\n\n*'I know.'*\n\nHe needed to remain vigilant. Grid steadied his thoughts and observed the soldiers rushing forward with shields raised.\n\n*Now they're using tactics?*\n\nShields in front to block Grid's sword while spearmen attacked from behind. Duke Lucilliv was employing basic but efficient tactics to pressure Grid—a means to reduce troop losses while accelerating Grid's stamina consumption. But what if Grid simply pierced through?\n\n\"You think these cheap shields can stop my sword?\"\n\n*Seokeok!*\n\nGrid felt no burden from the shields. To the watching crowd, the soldiers with their large shields appeared formidable. But Grid slashed through them without hesitation.\n\n\"Kuaaaack!\"\n\nHis blade pierced shield and armor alike, killing the soldiers in one strike.\n\n\"H-heok.\"\n\nThe spearmen who'd trusted in the shields panicked. Their upper bodies lay exposed as Grid rotated, cutting them down.\n\n*Seokeok!*\n\n\"...!\"\n\nAn overwhelming assault that rendered the shield-and-spear combination useless! The morale of the Eternal Kingdom army plummeted as they witnessed the massacre.\n\n> **[The morale of the soldiers is at the bottom. The soldiers' attack and defense will drop by 20% and their recovery speed is reduced.]**\n\n\"Wow...\"\n\nThe Eternal Kingdom players stared at the warning windows appearing before them, shocked. They couldn't find an opening to attack Grid. They'd coveted the rewards for the 'Fight the Rebel Leader' quest, but could they actually claim them? More likely, Grid would simply kill them all.\n\nGrid's momentum soared.\n\n*Pepepepeok!*\n\nThen the magic bombardment began from the rooftops of two-story houses surrounding the central square. Duke Lucilliv had used the shield infantry to occupy Grid's attention, creating this gap for his magicians.\n\n> **[You have suffered 2,200 damage.]**\n> **[You have suffered 930 damage.]**\n> **[You have suffered 1,660 damage.]**\n> **[You have suffered 3,490...]**\n\n\"Ugh.\"\n\nFor the first time, Grid's expression tensed. The magical damage proved burdensome since he wore Triple Layers instead of the Holy Light Set. The bombardment rained down from all directions—difficult to avoid or block. Should he swap to the Holy Light Set? No, that would be meaningless. The damage from arrows would simply increase instead.\n\nThe viewers' reactions updated in real time.\n\n—*Crazy;; Hundreds of spells are pouring down. That's a massive hit.*\n\n—*The Overgeared members wouldn't survive that. ㅡㅡ; This looks really dangerous.*\n\n—*A reversal... Grid's finished.*\n\n—*5,000 kills is nonsense. ㅋㅋ He couldn't even kill 2,000. ㅋㅋ Kraugel would've killed way more. ㅋㅋ*\n\n*Pepepepeok!*\n\nAmidst the magical bombardment, Grid's voice cut through the chaos.\n\n\"Item Transformation.\"\n\nTwo of the God Hands protecting him shifted form, transforming into a bow. The Red Phoenix Bow. One bow was gripped by two God Hands while Grid himself held the other.\n\n\"Fly Up!\"\n\n*Kiiiiiiing!*\n\nAbove Bairan Castle, two crimson phoenixes blazed into existence across the sky."
}