{
  "id": 561,
  "title": "Chapter 561",
  "content": "**Item Transformation**\n\n> **[Item Transformation]**\n>\n> A skill triggered when possessing the **legendary mineral 'pavranium.'**\n>\n> Transforms pavranium into the shape and performance of a specific item.\n>\n> * Can only transform into items the user has learned how to craft.\n> * **Duration:** 3 minutes. After transformation ends, pavranium reverts to its original form.\n> * **Mana Cost:** None\n> * **Cooldown:** 6 hours\n\nThis was the power Grid obtained after creating his fifteenth legendary item—a skill that maximized pavranium's potential. He'd previously used it to reproduce the <span class=\"myth\">Myth-rated</span> Lifael's Spear. Now he channeled it toward the Red Phoenix Bow.\n\nPagma's Descendant possessed fewer wide-area skills than other combat classes. The Red Phoenix Bow would help overcome that shortcoming. Of course, perfectly reproducing the <span class=\"myth\">Myth-rated</span> Red Phoenix Bow remained impossible—that version required the Red Phoenix's Breath as a prerequisite. As the essence of a god, pavranium couldn't replicate it.\n\nInstead, Grid reproduced the <span class=\"legendary\">Legendary-rated</span> version he'd gifted to Han Seokbong.\n\n\"Fly Up!\"\n\n> **[Fly Up!]**\n>\n> Summons a copy of the Red Phoenix.\n>\n> The Red Phoenix's clone deals **fire attribute damage** to all targets within **300 meters** of the summoning point.\n>\n> **Damage:** 600% of the summoner's total attack power\n> **Mana Cost:** 3,000\n> **Cooldown:** 24 hours\n\nCompared to the <span class=\"myth\">Myth-rated</span> bow's version of Fly Up!, this effect seemed pathetically weak. The attack range was the critical difference. While the <span class=\"myth\">Myth-rated</span> Red Phoenix Bow struck all enemies within the player's field of vision, the <span class=\"legendary\">Legendary-rated</span> version capped out at three hundred meters.\n\nYet three hundred meters wasn't exactly small. Wide-area skills with such extensive range were actually quite rare. Grid didn't need the <span class=\"myth\">Myth-rated</span> version—this <span class=\"legendary\">Legendary-rated</span> Fly Up! would suffice as a superb area-of-effect skill.\n\nBesides, the <span class=\"myth\">Myth-rated</span> version had its own limitations. When the user's field of view was restricted, its full potential couldn't be unleashed. In terms of reliability and efficiency, the <span class=\"legendary\">Legendary-rated</span> version held the advantage. The only downside? It attacked all targets within range indiscriminately, unable to distinguish friend from foe.\n\nBut right now, only enemies surrounded him—everyone except Bairan's inhabitants.\n\n\"Fly Up!\"\n\n*Kiiiiiiii—!*\n\nWhite phosphorus arrows launched simultaneously from Grid and the God Hands, rocketing skyward from their Red Phoenix Bows. The cries of massive birds echoed throughout Bairan as two red phoenixes materialized—flame-wreathed avians the size of houses. They blocked out the sun.\n\nThe Eternal soldiers descended into panic.\n\n\"Phoenixes!\"\n\n\"Grid summoned them!\"\n\n*There's no limit to his power!*\n\n*Flap.*\n\nThe phoenixes beat their wings. Flames cascaded toward the earth like a deadly waterfall.\n\nDuke Lucilliv sensed the danger and screamed at his soldiers. \"Spread out!\"\n\nHe meant to minimize casualties. But their overwhelming numbers became a liability. Bairan was packed with Eternal soldiers—too crowded to allow proper escape. Before they could move more than a few steps, bodies collided, feet tangled, and men collapsed. The fireball bombardment commenced while they remained trapped in the streets, completely defenseless.\n\n*Pepepepeok!*\n\n\"Aaaaack!\"\n\nOnly the survivors could scream. Those directly burned by the flames couldn't even manage that much—they simply turned to ash. Thousands of soldiers became targets for the falling fireballs, an overwhelming spectacle that left spectators sweating in horror.\n\n\"Even the magicians...!\"\n\nFrom his position on the walls, Duke Lucilliv felt anxiety clawing at his chest. Against Grid, numbers meant nothing. The battlefield had been devastated. The bulk of his soldiers were lost. The magician casualties, in particular, forced his hand.\n\n\"Send out the knights! Continuing like this will only increase our losses!\"\n\n\"Waaahhhhhhhh!\"\n\nThe real battle finally began. Around five thousand knights—all in the mid-200 levels—assaulted Grid's position.\n\nDuke Lucilliv laughed. \"They're different from common soldiers!\"\n\nLosing knights hurt, true. However, Grid's death was the ultimate objective of this war. Resources had to be devoted to eliminating him.\n\n*The curse doesn't discriminate—even creatures of the gods can't escape it.*\n\nHe'd prepared a special curse, one that only affected immortal beings. An atrocious curse capable of tripling a player's death penalty and inflicting catastrophic damage.\n\nGrid observed Duke Lucilliv's confidence, then released the Red Phoenix Bow transformation. He immediately transformed his other two God Hands into Red Phoenix Bows.\n\n\"Did you forget I have two more? Fly Up!\"\n\n*Kiiiiiiii—!*\n\nGrid fired. Two more firebirds materialized in the sky.\n\n\"Heok!\"\n\n\"This doesn't make sense!\"\n\nThe five thousand knights charging toward Grid scrambled to a halt. Witnessing such a devastating skill used twice in rapid succession felt like a nightmare.\n\n\"A-Avoid it!\"\n\nKnights fled between the soldiers, using them as human shields to protect their lives. But Fly Up! attacked all targets within its designated range. Using people as shields was meaningless.\n\n*Kurururung!*\n\nFireballs rained down like judgment from the heavens.\n\n\"Kuaaaack!\"\n\nKnights struck by burning projectiles screamed in agony. Yet knights earned their titles for good reason—most didn't die from the initial blow. The vast majority clung to life, barely surviving.\n\nBut then—\n\n> **[The hidden passive 'God's Command' has reset the cooldown of Fly Up! If reused within three seconds, no resources will be consumed.]**\n\n\"Still one more remaining.\"\n\n*Kiiiiiiii—!*\n\nAnother red phoenix appeared.\n\nThe knights couldn't comprehend it. \"This is impossible!\"\n\nTheir cry carried equal parts misery and denial. Fireballs turned them to ash. In that moment, the proud knights of the Eternal Kingdom were annihilated. Duke Lucilliv stood stunned as his main forces evaporated uselessly.\n\n\"T-This doesn't make sense...!\"\n\nEven a great magician couldn't cast large-scale spells consecutively. Grid's power seemed infinite. Doubt and fear flooded Duke Lucilliv's mind. *Could he truly lose a hundred thousand troops to a single enemy?*\n\n*No! Absolutely not!*\n\nHe and his hundred thousand troops couldn't fall to one man. History would brand him the most incompetent commander in West Continent history. Duke Lucilliv had to avoid that fate. He decided to summon his elite group.\n\n\"Baron Duka! Earl Carrion! Earl Red! Marquis Bera! It's your turn!\"\n\nThey were the great swordsmen and magicians who boasted the kingdom's greatest power. The knights and soldiers they'd personally fostered were excellent even by Eternal Kingdom standards. Duke Lucilliv believed they could kill Grid, even if they sustained heavy damage in the process.\n\nHowever...\n\n\"Where is everybody?\"\n\nNot a single one could be seen. Confusion filled Duke Lucilliv's eyes—enough to drive a man to madness.\n\n***\n\n『 What are we witnessing right now? 』\n\nEarlier, Jishuka had summoned a red phoenix above Patrian. Experts worldwide had evaluated it as a quest item—power originating from a player shouldn't be that overwhelming unless it was a special force exclusive to the Eternal Kingdom war questline. Now they realized they might have been wrong.\n\nThe bow that summoned red phoenixes... Grid possessed multiple copies.\n\n*—Grid can summon the red phoenix five times consecutively, although each is weaker than Jishuka's. But doesn't Grid's summoning ability seem far superior overall?*\n\n*—I agree. It seems comparable to Meteor, that rumored high-grade spell.*\n\n*—What has Grid been doing since the National Competition? How did he become this strong in such a short time?*\n\n*—Don't try to understand him. Did you see how easily he crushed those vampires? He's a king among gamers—no, a god among gamers.*\n\n*—Right now, I'm thinking the candidates to win the 3rd National Competition are South Korea and Brazil. Summoning phoenixes alone could end a siege.*\n\n*—The haters have finally shut up. Everyone cursing Grid has gone silent.*\n\nViewers worldwide marveled at the spectacle. Grid had summoned five red phoenixes consecutively and destroyed over ten thousand troops. What other player could annihilate ten thousand soldiers in the blink of an eye? People began speculating that only Grid could accomplish this—not even Kraugel.\n\nThe reasoning was straightforward:\n\n『 We shouldn't overlook one crucial detail—Grid hasn't demonstrated most of the skills he used during the National Competition. 』\n\n『 Grid still hasn't fully revealed his true capabilities. 』\n\n***\n\nAkaru Fortress stood at the edge of the Saharan Empire. Geographically positioned toward Reidan, the fortress existed to monitor and check the Saharan Empire's movements—though checking a neutral state wasn't strictly necessary. Like other kingdoms, the Eternal Kingdom paid tribute to the empire. Consequently, few troops were typically deployed to Akaru Fortress.\n\nBut circumstances had shifted in recent years. The noble called Grid had revolted within the Eternal Kingdom, throwing the nation into turmoil. The Saharan Empire didn't intend to miss this opportunity. The empire had long coveted Reidan in particular. Now that the Eternal Kingdom was destabilized, they planned to invade Reidan and seize control.\n\nTwenty thousand elite troops had been deployed to Akaru Fortress. The moment was golden.\n\n\"The Eternal Kingdom has mobilized a hundred thousand troops.\"\n\n\"A contingent from Reidan moved in response.\"\n\n\"Now Reidan stands empty.\"\n\nThe time had come. They could enter Reidan without bloodshed and plant the empire's flag. What about the Eternal Kingdom's protests? The empire was merely assisting a kingdom suffering from rebellion. They were simply protecting Reidan while the kingdom recovered. Afterward, they could casually occupy it through political maneuvering.\n\nTerritory takeover by a powerful nation! Earl Turich, commander of Akaru Fortress, didn't hesitate. He mobilized his army toward the supposedly empty Reidan without a second thought. But he was forced to halt the march.\n\n*This is impossible!*\n\nThe mountain range lay between Reidan and Akaru Fortress. As his forces crossed the peaks, tens of thousands of Reidan soldiers appeared in the vast desert below. The massive army moved in perfect unity, training with synchronized movements. Goosebumps rippled through the imperial soldiers.\n\n\"How can tens of thousands of soldiers move identically?\"\n\nNot a single movement was out of place. Tens of thousands of troops performed the exact same spear techniques. A single glance confirmed these were elite forces.\n\n\"...We must withdraw.\"\n\nEarl Turich made his judgment and ordered the retreat. He never imagined the truth—only one thousand soldiers were actually training in the desert heat. The reason they appeared as tens of thousands? The shadows those thousand soldiers cast beneath the scorching sun, manipulated and multiplied.\n\n\"Using shadow soldiers strategically... Earl Lauel truly is exceptional.\"\n\nKasim's heart pounded as he watched the imperial army retreat beyond the mountains. He grew even more convinced that Grid, accompanied by such powerful allies and brilliant minds, would surely destroy the empire someday."
}