{
  "id": 562,
  "title": "Chapter 562",
  "content": "# The Fortified City of Patrian\n\nNight had fallen over the battlefield, but darkness found no purchase here. Fire arrows shrieked through the air in endless volleys, painting the sky in streaks of flame.\n\n\"This is impossible!\" A player from the 4th Patrian Reclamation Army slammed his fist against the ground. He'd expected the first three armies to have already broken Overgeared's resistance. He'd expected to arrive to mop-up operations and easy rewards. Instead, his army was being decimated in half a day.\n\nThe woman with the Red Phoenix Bow—Jishuka—had transcended what should have been possible for a player. Her arrows fell like rain of fire, each volley claiming dozens of lives. Distance meant nothing to her. Accuracy meant nothing. She was a force of nature given human form.\n\n\"How the hell do we fight that?\" one soldier muttered, watching another hundred men turn to ash.\n\nThe Eternal forces had frozen in terror. Breaking through that curtain of flame seemed as impossible as stopping the sunrise.\n\n\"What are our archers and magicians doing?\" someone finally screamed. \"Turn that woman into a corpse! Don't let her draw another arrow!\"\n\nA cynical laugh answered him. \"Don't you understand? She's a godly archer.\"\n\n\"Her skill level is beyond anything we can match,\" another voice added. \"Her range and accuracy exist in a different dimension.\"\n\n\"We'd need to close within 200 meters to even target her,\" a third player explained, his voice hollow. \"But she'll never let us get that close.\"\n\n\"...\"\n\nPatrian was the largest fortress in the Eternal Kingdom, its walls towering and formidable. Jishuka had claimed the highest rampart, and from that perch, she reigned as an angel of death. Her Hawk Eyes swept the entire battlefield, identifying and eliminating threats before they could even form. With each passing moment, Eternal's chances of victory withered.\n\n> [The morale of the soldiers has decreased!]\n>\n> [The stats of all soldiers will drastically fall!]\n\n\"This is insane.\" A player stared at the cascading notifications. They would have to abandon the assault on Patrian. But how could they accept that? What kind of absurd balance allowed one player to hold back tens of thousands?\n\n\"It doesn't make sense,\" another player said. \"She's made entire armies obsolete.\"\n\n\"Jishuka needs to be nerfed,\" someone else grumbled. \"She's broken enough to stop 20,000 troops single-handedly.\"\n\n\"That's nonsense,\" a different voice cut through the complaints. \"Jishuka worked for this strength. Maybe instead of complaining, you should put in the same effort she did.\"\n\nThe words struck home. It was a truth the players couldn't ignore.\n\n\"We're players like her,\" the voice continued. \"One day we can reach her level. This isn't the time for jealousy. This is the time to be inspired.\"\n\nUnlike NPCs, whose potential was fixed, players could grow without limit. Watching Jishuka's dominance, many in the Eternal army felt their perspective shift. They weren't just witnessing a defeat—they were witnessing what was possible.\n\n***\n\n\"Why would he ask that?\"\n\nFifteen minutes had passed since Grid's message in the guild chat. He'd asked where the defenders of Bairan had gone. Then—silence.\n\nThe Overgeared members exchanged worried glances. Pon and Yura stared at the chat window as if they could will it to life.\n\n\"Judging by the question...\" Pon began.\n\n\"He's in Bairan,\" Yura finished.\n\n\"Surrounded by 100,000 troops?\"\n\n\"...It seems likely.\"\n\nThe implications hung heavy in the air. Grid's silence meant only one thing: he was too busy fighting to type.\n\n\"I'll go,\" several members said in unison, already reaching for their weapons.\n\nYura raised her hand, stopping them. \"Wait. We don't know for certain.\"\n\n*What if we rush back to Bairan and he's not there?* she thought. *We'd just die meaninglessly to those hundred thousand soldiers.*\n\n\"We wait until Grid contacts us again,\" Yura said firmly. \"Besides—\" Her beautiful face softened with confidence. \"Grid would summon his knights if he was truly in danger.\"\n\n\"...\"\n\nThe logic was sound. The tension in the room eased slightly.\n\n*Youngwoo, I believe in you,* Yura thought, her eyes never leaving the chat window.\n\n***\n\n> [Your demonic power has reached 10,000!]\n>\n> [Your coordination with dark magic power has increased!]\n>\n> [Resistance to dark magic will increase by 10%!]\n>\n> [Resistance to divine magic will fall by 10%!]\n>\n> [The functions of the Blackening skill have been upgraded!]\n>\n> [One of the conditions for Noe's evolution is satisfied!]\n\nGrid's demonic power surged with each kill. The notification windows brought relief instead of concern.\n\n*So far, it's positive.*\n\nThe demonic power stat had appeared when Noe, the greatest demonic beast of hell, became his pet. Grid had always feared what might happen when it grew too high. Would he be dragged to hell? Would he transform into a demon?\n\nApparently not. At least not yet.\n\n*Species changes aren't that easy,* he reasoned. *Besides, it said I could \"freely\" access hell—not that I'd be forced there.*\n\nLooking back, his fear seemed unfounded. With Blackening and Noe both benefiting from higher demonic power, the stat could be an asset.\n\n*The divine resistance penalty is worth it.* Grid had strong rapport with most religions, including the Rebecca Church. His only real enemy was the Yatan Church—which meant dark magic attacks were far more likely than divine ones. The trade-off actually favored him.\n\nArrows rained down as Grid processed this information. The magicians had been obliterated by five consecutive Red Phoenix summonings, so the archers had taken over harassment duties. Grid's body moved on instinct, weaving through the deadly hail.\n\n> [You have suffered 250 damage.]\n>\n> [You have suffered 190 damage.]\n>\n> [You have suffered...]\n\nGrid ignored the shallow wounds as arrows clattered off his Triple Layers armor. He downed a potion, spun like a windmill, and his greatsword carved through hundreds of soldiers in a single revolution.\n\n\"Impressive...\" Duke Lucilliv murmured from his command post.\n\nGrid had swept through entire formations like wheat before a scythe. The duke had expected stamina to be Grid's weakness—expected him to tire and slow. But the man showed no signs of flagging.\n\n*I have no choice,* the duke thought grimly.\n\nHe raised his fist.\n\n\"My brave soldiers! Cut off the rebel's head!\"\n\nThe walls erupted with motion.\n\n\"WAAAAAAAAAH!\"\n\nFrom the ramparts, soldiers clad in golden armor launched themselves into the fray. They hit the ground in controlled rolls, then surged toward Grid with practiced precision. Moonlight caught their armor, turning them into blazing comets.\n\n—Finally, the elite troops!\n\n—The real battle starts now.\n\nThe golden-armored soldiers moved differently. Their strength showed in every stride, their discipline in every formation. They flowed through the press of allied soldiers like water, closing on Grid with frightening speed.\n\n\"For the glory of Duke Lucilliv!\"\n\n\"Die!\"\n\nWeapons gleamed as they thrust toward Grid. The players in Eternal's ranks saw their opening.\n\n\"Now!\"\n\n\"This is our chance!\"\n\nThese were the players Duke Lucilliv trusted most. They'd been waiting for this moment—when Grid would be forced to focus on the golden soldiers, when his guard would drop. The instant the elite soldiers closed—\n\n\"Your timing is excellent,\" Grid said.\n\n*Kaching.*\n\nOne hundred and thirteen white spheres materialized around Grid. They became rays of light that shot in every direction—Alarm's defensive trigger.\n\n*Thwack-thwack-thwack!*\n\n\"AAAAAGH!\"\n\n\"Guh!\"\n\nThe leading golden soldiers screamed as they were blown back.\n\n\"Pagma's Swordsmanship, Wave.\"\n\n*CRAAAASH!*\n\nA tsunami of blue energy erupted from Grid's blade, swallowing everything within range. His eyes widened as the golden soldiers disintegrated.\n\n> [You have defeated an elite soldier of Duke Lucilliv.]\n>\n> [A Sharp Longsword has been acquired.]\n>\n> [A gold nugget has been acquired.]\n>\n> [A gold nugget has been acquired.]\n>\n> [A gold nugget has been...]\n\n\"...What?\"\n\nUntil now, the soldiers had dropped nothing but rusted weapons and worn leather. But Duke Lucilliv's golden soldiers were literally dropping gold. Actual gold nuggets.\n\nGrid pulled up the item description.\n\n> **[Gold Nugget]**\n>\n> Worth 50 gold.\n>\n> Weight: 5\n\nFifty gold. Sixty thousand won per nugget. Grid's eyes went wide with greed.\n\nHis momentary distraction was all the opening the hidden players needed. Third advancement users burst from the crowd of golden soldiers, closing the distance in heartbeats.\n\n\"Grid, nothing personal!\"\n\n\"It's just business—the quest rewards!\"\n\nThe rankers shouted their excuses even as they unleashed devastating skills.\n\n*BOOOOOM!*\n\nThe concentrated assault would have killed most players instantly.\n\n\"I hold nothing against you either,\" Grid said calmly. \"But I will be taking your items.\"\n\n\"...?!\"\n\nQuestion marks practically appeared above the rankers' heads.\n\n*CRASH-CRASH-CRASH!*\n\nGrid's health bar dropped by a third.\n\nJust a third.\n\nThe rankers had expected to put Grid into critical condition at minimum. A third of his health? With his ridiculous defense and massive health pool, it barely qualified as a wound.\n\n*What kind of defense is that?!*\n\n*Insane overgeared bastard!*\n\nThe high rankers went pale. They tried to follow up with additional skills—\n\nSomething glinted in the moonlight. Thin as spider silk. Deadly as a garrote.\n\n*What is—*\n\n\"You'll make excellent shields,\" Grid said.\n\n*SNAP!*\n\nHis voice seemed to come from directly behind their ears as silver threads wrapped around their bodies, binding them tight.\n\n> [Your body is bound by something unknown!]\n>\n> [It is a powerful binding! It isn't easy to escape! This will last for 5 seconds.]\n\n\"What—?!\"\n\nFive seconds of captivity. The rankers floated into the air, suspended in a web of silver thread. Grid positioned them between himself and the golden soldiers.\n\nThe elite troops' attacks slammed into the helpless players.\n\n—Holy shit...\n\n—Look at Grid's face.\n\nGrid's hands moved in a blur, manipulating the silver threads with artistic precision. Five high rankers dangled behind him like grotesque puppets, absorbing blows meant for him. The contrast was disturbing—Grid smiled serenely while the rankers screamed in agony.\n\nOne of them, blood streaming from a dozen wounds inflicted by his supposed allies, managed to gasp out a question:\n\n\"Overgeared... can I join Overgeared?\""
}