{
  "id": 563,
  "title": "Chapter 563",
  "content": "The silver thread unfurled like a spider's web, refracting beautifully in the moonlight. The flashing silver evoked images of a chandelier, and Grid at its center resembled an arrogant king surveying his domain. His eyes swept across the battlefield with cold precision. He remained so tranquil it was hard to believe he stood isolated among tens of thousands of enemy soldiers. Both the spectators and the high rankers he'd captured felt their hearts race.\n\n\"Overgeared... is it possible to join Overgeared?\"\n\nIt wasn't fear for their lives driving the question. The high rankers sensed a genuine dignity radiating from Grid. From the bottom of their hearts, they wanted to follow this man. They couldn't help but be drawn to his absolute power and commanding presence. However, Grid misunderstood their intentions. These same people had just tried to kill him moments ago—how could this sudden request be sincere?\n\n*These guys are spouting nonsense because they don't want to die.*\n\nEven stupid people wouldn't fall for such an obvious ploy!\n\n*I'm different. Hmph!*\n\nGrid had gained considerable insight from his accumulated experiences. Setting aside his insight stat, Grid's mind managed to puzzle out the true intentions of the five high rankers.\n\n\"No. I won't accept you.\"\n\n\"...?!\"\n\nThe rankers reeled in shock. Who were they? Rankers who had achieved their third advancement. They ranked in the top ten of their respective classes. Even the Seven Guilds wanted to recruit them. Yet Grid refused their membership application outright? They could only think of one reason.\n\n*Is it because we tried to kill him?*\n\nThey understood Grid's perspective. How could he trust those who had just tried to kill him and his guild members? Even they wouldn't accept such people, let alone Grid.\n\n*Then it can't be helped.*\n\n*I'll humbly accept my death today and pledge myself to him next time.*\n\nThe high rankers suspended from the silver thread closed their eyes, expecting Grid to deliver the killing blow. However, it wasn't Grid who attacked them—it was Duke Lucilliv's golden soldiers.\n\n*Puuok!*\n\n*Puuoook!*\n\nThe blades aimed at Grid instead struck the high rankers Grid was using as human shields.\n\n\"Cough!\"\n\nThe golden soldiers were second advancement warriors. Duke Lucilliv's troops possessed strength far beyond ordinary Eternal soldiers.\n\nGrid hesitated as he prepared to deliver the final blow to the groaning high rankers. His gaze snapped toward the central square in the distance. Eternal soldiers were aiming their bows at the people of Bairan.\n\n*Those bastards!*\n\nUnable to overpower him directly, they were resorting to hostages!\n\n*Why?*\n\nWhy was it always the weak who had to make one-sided sacrifices? Unhappy memories from his school days bubbled up, making the situation feel even more unpleasant. Grid's face twisted into a demonic grimace. He was about to rush toward the square when he stopped himself.\n\n*Stay calm.*\n\nThe old Grid would've charged in immediately to rescue the hostages. But during the process of creating the Red Phoenix Bow, he'd learned how important it was to remain composed. He forced himself to think through his options, considering what his best choice would be. First, he killed the enemies attacking the high rankers, then pulled the captives in front of him.\n\n\"...?\"\n\nThe high rankers blinked in confusion as the silver thread released them. They'd expected death. Grid's **Slaughterer's Eye Patch** inflicted five seconds of captivity—a duration that could be shortened depending on the victim's abilities, but still long enough for Grid to strike them down.\n\nBeing hit by Grid meant almost certain instant death. In other words, Grid could kill them whenever he wanted. Yet he was sparing them?\n\nBewildered, the rankers watched as Grid continued to slaughter the surrounding enemies.\n\n\"As I said earlier, I have no intention of accepting your application to join the guild. I can't trust people who tried to kill me just moments ago. Isn't that right?\" Grid's voice cut through the chaos. \"But I will give you a chance.\"\n\n\"...?\"\n\n\"From now on, you will fight for me. Cut down any enemies blocking my way.\"\n\n\"...!\"\n\nA test to prove they deserved to be members of Overgeared! The high rankers' hearts soared. Grid was giving them this opportunity even after they'd tried to kill him.\n\n*Giving us a chance instead of punishing us for trying to kill him? Grid has incredible leadership skills!*\n\n*I understand now why the other powerhouses follow him.*\n\nThey believed Grid possessed excellent insight that could peer into a person's heart. The high rankers responded in unison.\n\n\"We're going!\"\n\n*Pahat!*\n\nShouting their determination, the high rankers surrounded Grid in a protective formation. They began to slaughter the golden soldiers targeting their new leader. They were indeed elite rankers of their respective classes—Duke Lucilliv's soldiers couldn't even slow them down. Relief flooded through Grid.\n\n*I thought they were going to stab me in the back. Fortunately, they didn't.*\n\nMaintaining his composure had been the right call. With the high rankers handling the bulk of the soldiers, he was free to rescue the hostages. Grid equipped the **Ideal Dagger** and activated **Quick Movements**, sprinting toward Bairan's terrified residents.\n\n***\n\n*The golden soldiers are just bait!*\n\nDuke Lucilliv understood the endless nature of human greed. Despite being second in power within the kingdom and possessing tremendous wealth, he still craved more. He was confident Grid suffered from the same affliction. Grid would lose focus when he saw the golden soldiers dropping gold lumps with each death. During that moment of distraction, Duke Lucilliv would strike.\n\nIn the central square, after creating the illusion that Bairan's residents were about to be executed, he'd positioned magic traps, guards, and elite knights throughout the streets Grid would have to traverse.\n\n*He will definitely try to protect the people.*\n\nGrid was bound to fall into this perfect trap!\n\n\"Kukuk!\"\n\nDuke Lucilliv's wicked smile spread across his face. The Bairan residents, silenced by magic, screamed internally.\n\n*Duke Grid, you absolutely can't come here!*\n\n*Don't fall into that evil man's trap because of us!*\n\nDespite death looming over them, their thoughts were consumed with worry for Grid. Of course they felt this way—Grid was fighting against one hundred thousand troops to save them. The people couldn't help but care about the man trying to rescue them at such terrible odds.\n\nDuke Lucilliv practically vibrated with anticipation while the villagers' fear created an oppressive atmosphere. Meanwhile, his soldiers wrestled with mounting doubts.\n\n*Why are we serving the Eternal Kingdom?*\n\n*True, we were born and raised here. We love our kingdom and paid our taxes faithfully. But the kingdom treats us like cattle.*\n\n*Being forced to sacrifice ourselves for this war...*\n\n*Taking the lives of innocent people...*\n\nThe behavior exhibited by the kingdom they served wasn't right. The sixty thousand non-regular soldiers felt their faith in the kingdom crumbling. They began to question the very foundation of their loyalty—all thanks to Duke Lucilliv's actions.\n\nRoyal blood flowed through Duke Lucilliv's veins. As a great noble of the Eternal Kingdom, his duty should have been to protect the people. Yet he acted nothing like this, leading the conscripted soldiers to assume all nobles were cut from the same cloth as Duke Lucilliv. Most of the non-regular soldiers, conscripted from their respective territories, witnessed Duke Lucilliv's cruelty firsthand.\n\nAnd what about Grid?\n\nHe was different.\n\nIn the distance—\n\n*Kuwang!*\n\n*Kwa kwa kwa kwang!*\n\nGrid carved through the enemy forces to reach his people. Though his body became drenched in blood, his eyes remained fixed on the residents, never wavering to his own safety. The non-regular soldiers began to think: *This is a person worth serving.*\n\nDuke Lucilliv, however, thought Grid looked utterly foolish.\n\n\"Putting yourself in danger to save these people—I can't understand it at all. Well, I'm able to gain greater achievements thanks to your stupidity.\"\n\nDuke Lucilliv failed to notice the shifting atmosphere among his soldiers. To him, common people were nothing more than brainless pigs. The thought that they might dare oppose him never even crossed his mind. As Grid's momentum surged, the duke proudly grasped his bow and aimed it at one of Bairan's beautiful young women.\n\n\"If you can't protect what you want to protect... will your heart shatter?\"\n\n*Kkirik!*\n\nHe wanted to hear Grid scream. The moment Duke Lucilliv's wicked smile widened and he began to pull back the bowstring—\n\n*Peeeeeong!*\n\nA shrill sound pierced Duke Lucilliv's ears.\n\n\"What?\"\n\nInstinct screamed danger. Duke Lucilliv's face went pale.\n\nThen—\n\n*Teong!*\n\nOne of the senior magicians guarding Duke Lucilliv was impaled by a spear that punched clean through his shield magic. The magician's eyes bulged in disbelief.\n\n*Breaking through the shield with an ordinary spear?*\n\nHow skilled must the thrower be?\n\nThe other magicians and Duke Lucilliv whipped their heads toward the spear's origin. A soldier stood there, clad in leather armor caked with dirt and blood. He was a strikingly handsome man whose noble blond hair seemed completely at odds with his battered appearance.\n\nPrivate Ars. His face lit up with satisfaction as he locked eyes with Duke Lucilliv.\n\n*I finally reached you.*\n\nIt had been such a long wait. Ars had endured sleepless nights for several days, constantly observing Duke Lucilliv to find an opening. It hadn't been easy—the duke always kept guards close. But now, thanks to Grid's assault, the opportunity had arrived.\n\n\"I'll finish this quickly for My Lord.\"\n\nWith the loyalty of the non-regular soldiers already crumbling, defeating Duke Lucilliv—the one oppressing them—would magnify the effect tremendously. Most of the conscripts would lay down their weapons, and this war would end. Ars surged toward Duke Lucilliv.\n\n\"Stop him!\"\n\nThe magicians beside Duke Lucilliv tried to cast their spells, but it was too late. Ars closed the distance in an instant.\n\n\"You!\"\n\nThe moment Duke Lucilliv felt death's cold touch—\n\n*Pahat!*\n\nThe spear poised to pierce Duke Lucilliv's body vanished in a flash of light, along with Ars himself.\n\n\"...?\"\n\nDuke Lucilliv and the senior magicians stood frozen in shock.\n\nAt the same time—\n\n\"M-My Lord?\"\n\nBairan City.\n\nAsmophel stared at Grid with an utterly bewildered expression, having just been summoned via **Knights Summoning**. Grid cut down two of Duke Lucilliv's guards and barked an order.\n\n\"Asmophel! Stop standing there like an idiot and do your job! The others told me they didn't know where you were!\"\n\n\"...\"\n\n*Do his job?* Asmophel felt wronged by the accusation, but there was no time to explain. He nodded and intercepted Duke Lucilliv's guards.\n\nGrid summoned Noe, Randy, and Iyarugt.\n\n*More!*\n\nMore! More! More! The group of high rankers, Asmophel, and the pets rapidly tore through the enemy forces. The distance to the central square shrank steadily. Grid didn't miss the opportunity and immediately activated **Blackening**. With his demonic power reaching 10,000 points, **Blackening** had grown even stronger.\n\n\"**Freely Move!**\"\n\nGrid bypassed all the guards, knights, and magical traps in a single fluid motion. This was the power of the **Secret Hero** title.\n\n\"...!\"\n\nDuke Lucilliv and the Eternal troops stared as if they'd witnessed a ghost. An awkward silence descended before Grid came face to face with the duke.\n\n\"Hah... that's right. You're nothing but trash that exhausts me.\"\n\nThe sun rose behind Grid's back, illuminating his black hair. After a terrible and fearful night for the people of Bairan, a brilliant morning had finally arrived.\n\n\"The position of the weak who can't resist—I'll let you experience it for the first time today.\"\n\nThe sun of Reidan blazed across the entire Eternal army."
}