{
  "id": 564,
  "title": "Chapter 564",
  "content": "# Chapter: [Bairan's Reckoning]\n\nImpertinent. Scandalous. Insufferable. Outrageous.\n\n*I want to tear him apart!*\n\nDuke Lucilliv's fury burned hotter than the rising sun as he faced Grid. Who did this upstart think he was dealing with? Duke Lucilliv was the younger brother of the late King Wiesbaden and uncle to the current King Aslan—royal blood ran through his veins. His lineage was the noblest in the Eternal Kingdom. Even setting aside his birth, he wielded more power than anyone else in the realm. The prestigious nobles of the Saharan Empire themselves treated him with deference.\n\n*And this bastard without a drop of noble blood dares insult me?*\n\nIt was intolerable.\n\n\"Grid!\" Duke Lucilliv's face flushed crimson. \"This behavior is too vulgar! You have no concept of filial piety or basic etiquette!\"\n\nGrid's shoulders shook—not with fear, but with barely contained laughter.\n\n\"Even if I had manners, why waste them on trash?\" Grid shot back. \"And what the hell is filial piety? Don't use words I don't understand.\"\n\n\"Y-You...!\"\n\n*Again! Again and again!*\n\nCalling a man of royal blood *trash*? Duke Lucilliv couldn't fathom what passed for a brain in Grid's skull.\n\n*Does this fool not comprehend the sanctity of royal lineage?*\n\nIn his indignation, Duke Lucilliv momentarily forgot the gravity of their situation. Then his eyes fell on the weapon in Grid's hand—a dark blue blade. No, it resembled a wooden practice sword more than a proper longsword, with no clear distinction between handle and blade. The duke's tension evaporated.\n\n*Of course. He wouldn't dare harm me. Without submission, those hostages will die.*\n\n\"Protect Duke Lucilliv!\"\n\n\"To the duke! Now!\"\n\n\"Waaahhhhhhhh!\"\n\nThe moment Grid and Duke Lucilliv faced off, Eternal's troops converged from every corner of Bairan. Over ninety thousand soldiers surrounded Grid in a tightening noose of steel and flesh. An impossible situation—a crisis by any measure. Duke Lucilliv gazed at Grid like a caged beast behind barbed wire.\n\n\"You spoke of experiencing the position of the weak who cannot resist?\" The duke pulled a silk handkerchief from his coat, pressing it delicately to his mouth and nose as dust rose from the soldiers' boots. Every gesture dripped with aristocratic refinement. By contrast, dust meant nothing to Grid, who'd spent years scraping by in the dirt. He'd swallow it whole if it came to that.\n\n\"You'll see soon,\" Grid said.\n\n*Kwajijijik!*\n\nThe wooden sword was no wooden sword at all.\n\nGrid moved, the **+7 Sword Ghost** suddenly alive in his hands. Duke Lucilliv and every soldier within eyeshot doubted their vision.\n\n\"D-Demon...?\"\n\nWhen Grid had first arrived, dawn's shadows had concealed his appearance. But now the sun climbed higher, banishing the shade. Grid stood revealed in harsh daylight.\n\nDarkness seemed to billow from him in waves. His skin was corpse-pale against that void. White skin. Blood-red eyes. He matched the demons described in ancient texts—difficult to mistake for any ordinary human.\n\n\"Duke Grid... is he a demon, not a man?\"\n\n\"That would explain his strength...\"\n\nMurmurs rippled through the ranks. Asmophel, arriving belatedly at Grid's side, wore a grim expression.\n\n*The soldiers who envied Grid are wavering now!*\n\nGrid needed to dispel the misconception immediately. But how? Even as Asmophel wrestled with the question, Grid registered the soldiers' confusion and acted.\n\nHe placed the **Holy Light Crown** upon his head.\n\nThe crown once worn by Pope Franz, the man who'd sealed Marie Rose—the strongest vampire to walk the earth. The divinity radiating from that sacred artifact needed no explanation. Against its holy light, the demonic aura Grid unconsciously emitted paled into insignificance.\n\n\"Ahh...\"\n\nThe soldiers' perception shifted once more. After envy and fear came awe. Grid began his dance.\n\n\"Pagma's Swordsmanship—Linked Kill Wave!\"\n\n*Kwa kwa kwa kwa kwa kwa kwa kwa!*\n\nBlack energy blades howled like a tempest toward Duke Lucilliv, rending the air itself. Then, impossibly—\n\n\"There's one more Linked Kill Wave.\"\n\n*Kwa kwa kwa kwa kwa kwa kwa kwa!*\n\n—he executed the technique a second time in immediate succession.\n\n\"—?\"\n\n*Is this a replay?*\n\nConfusion swept through the viewers watching from afar.\n\n***\n\nDid size truly matter on the Western Continent?\n\nSeventeen kingdoms sprawled across the landmass, home to countless ethnic groups and cultures. Yet in the end, one power's influence eclipsed them all. The continent might as well be called the Saharan Empire itself. Some scholars offered pessimistic interpretations.\n\nThe Saharan Empire's dominance was absolute. Every kingdom on the continent paid tribute to the Empire, absorbed its culture, studied its language. The smaller nations jumped at the Empire's every command.\n\n\"...But I will change the continent's landscape,\" King Aslan muttered to the empty air. \"The Eternal Kingdom will become the focal point of all nations—no longer cowering in the Empire's shadow.\"\n\nEternal's fourteenth king had studied in the Empire during his youth. Not by choice—it was mandatory for princes of tributary kingdoms. Throughout those years, he'd endured contempt from Imperial nobles and royalty alike. Sneers. Casual cruelty. Dismissal as something beneath notice.\n\nHe refused to let his descendants suffer such humiliation.\n\nThe dream was grand. Aslan had no intention of letting his brother Ren's sacrifice be wasted. After claiming the throne through fratricide, he'd been determined to leave behind legendary achievements. In the beginning, confidence came easily—surely his victory proved he was the superior brother?\n\n*My first goal: transform Eternal into a truly neutral nation.*\n\nSelf-sufficiency. Independence strong enough to resist Imperial pressure in economy, military, and science. This was why King Aslan had obsessed over Grid, maintaining cordial relations despite the dangerous blacksmith's refusal to swear loyalty to the crown.\n\nBut it had all fallen apart.\n\nGrid declared rebellion. Worse yet, the most reliable noble in Eternal—Earl Ashur himself—defected to Grid's side. King Aslan's desperation deepened. He'd lost strength before building any foundation. Now he watched his kingdom march down the path of destruction.\n\n*I hate that I had to frame Grid for my brother's murder.*\n\nThese past months had been a slow bleeding of resources. Reclaiming territories seized by Grid had drained the kingdom's treasury—war supplies, soldier training, conscription of young men who should have been Eternal's future. What good was condemning Grid and reclaiming land if the kingdom collapsed in the process?\n\n\"Kukuk... I'm incompetent after all.\"\n\nKing Aslan's heart felt diseased.\n\nHe'd killed his brother to pursue a grand vision. Now that vision crumbled to ash, the justification for fratricide evaporated. His heart rotted from within. He reached for another cup of wine when someone knocked at his chamber door.\n\nFew held permission to knock on the king's bedroom door.\n\n\"Enter,\" Aslan said hoarsely.\n\nThe man who stepped through was Chucksley—the finest swordsman in Eternal and loyal to the royal family unto death. He was also one of the handful who knew King Aslan had murdered Prince Ren.\n\n\"A guest from the Empire has arrived,\" Chucksley said gently.\n\nAslan's response dripped with bitterness. \"Is the price for making me king still insufficient? Ah, I see—have they come to collect compensation for that Solo Number Knight killed by a mere *soldier*?\"\n\nAslan had leveraged Imperial power to seize the throne. He'd thought himself clever, using them rather than being used. But the situation had reversed. Now he was their puppet, dancing on Imperial strings.\n\n\"Kukuk... Father must be ashamed. How terrible, watching his son murder his own brother and destroy his kingdom.\"\n\n\"Your Majesty, mind yourself,\" Chucksley said sharply.\n\nChucksley resented Aslan for killing Prince Ren. But duty bound him to serve whoever sat upon the throne—and that was Aslan. The concern in his voice made King Aslan's chest ache.\n\n*I've wasted his talent by being an incompetent master.*\n\nChucksley had achieved the rank of great swordsman through pure ability—uncommon even in the Empire. Rumors claimed only Piaro, Asmophel, and the top three Solo Number Knights of the current Red Knights surpassed him.\n\nIf King Aslan had provided the proper environment, Chucksley could have become one of the West Continent's greatest talents.\n\nInstead, he rotted in a dying kingdom.\n\n***\n\n\"It's been too long. And congratulations—belated though they are—on your coronation.\"\n\n\"...!\"\n\nKing Aslan froze upon entering the reception hall. Not because the guest merely nodded rather than kneeling before royalty—no, the identity of this Imperial visitor rendered such formalities moot!\n\n\"Prince Benoit...?\"\n\nThe Empire's third prince!\n\nUnlike his siblings, Benoit maintained a deliberately low profile in Imperial politics. He rarely appeared at official functions, possessed a subdued demeanor. But he remained a prince—third in line to the Saharan throne. His presence here, in this minor kingdom, was staggering.\n\nAslan swallowed his shock. \"I haven't seen you since my studies in the Empire. Prince Benoit, why have you come here personally?\"\n\nHis tone was carefully polite. Prince Benoit smiled—warm as sunshine breaking through clouds.\n\n\"We're fellow alumni, aren't we? Studied in the same halls. I heard you were in crisis and came to assist.\"\n\n\"Cri-sis?\"\n\nYes, he *was* in crisis. But one severe enough to summon an Imperial prince...?\n\nBefore Aslan could finish the thought, Chucksley burst into the room.\n\n\"Your Majesty! Emergency! Intelligence reports the rebel army marches on the capital!\"\n\n\"What?\"\n\nKing Aslan turned to stone. Grid still had forces to commit? Even a small army could overwhelm the skeleton garrison here—most troops were committed to distant fronts. Aslan's gaze swung back to Prince Benoit, whose smile hadn't dimmed.\n\n\"Is *this* the crisis you meant?\"\n\nBenoit didn't deny it. He nodded and pressed something into King Aslan's hand. A comb. An ordinary grooming implement for hair.\n\n\"What is this...?\"\n\nPrince Benoit leaned close, whispering.\n\n\"A tool to summon a great demon. You should try using it.\"\n\nAnd while chaos erupted, Benoit would locate Piaro and the Amethyst Shield."
}