{
  "id": 565,
  "title": "Chapter 565",
  "content": "# Chapter: The Demon's Bargain\n\nKing Aslan's desperate monologue. Prince Benoit's chilling appearance. This secret episode unfolded in real-time before the eyes of the black magician player Rose—a privilege granted by her status as quest performer.\n\nSystem notifications cascaded across her vision:\n\n> [Prince Benoit has succeeded in delivering the summoning tool!]\n> \n> [You have gained one level from the quest reward.]\n> \n> [You have acquired 10 stat points from the quest clear reward.]\n> \n> [<span class=\"unique\">Gulbas' Staff</span> has been acquired from the quest clear reward.]\n> \n> [The **Summoning of a Great Demon (4)** quest has linked to the **Summoning of a Great Demon (Final Part)** quest.]\n\nA new window materialized:\n\n> **[Summoning of a Great Demon (Final Part)]**\n>\n> **Difficulty Level:** SS\n>\n> Faithful servant of Yatan, thanks to your hard work, a great demon will soon descend to this earth.\n>\n> The only thing left is to wait...\n>\n> **Quest Clear Condition:** King Aslan summoning a great demon.\n>\n> **Quest Reward:** Varies depending on the great demon summoned.\n\nRose's face brightened at the quest renewal. *So this is how the story unfolds.* She allowed herself a rare smile. *The Overgeared Guild's war accelerated everything. I should thank them.*\n\nHer rise to the top of the black magician rankings had come after Yura's class change—a vacancy she'd eagerly filled. Following in Yura's footsteps, Rose had become Yatan's Servant and thrown herself into spreading fear and confusion across the continent. The SS-difficulty linked quest had been her greatest prize. Three months ago, she'd met Prince Benoit—a man whose dark interests aligned perfectly with her own.\n\n\"Are the offerings of sufficient quality?\" Prince Benoit's voice cut through her thoughts.\n\nRose nodded. \"Yes. Reinhardt is wealthy and peaceful. The virgins there are numerous and... suitable.\"\n\n\"Excellent.\" Satisfaction flickered across Prince Benoit's aristocratic features.\n\nRose frowned, voicing the concern that had nagged at her. \"But what if King Aslan refuses? Summoning a great demon requires sacrificing a large number of virgins. Would a king—even one desperate—actually sacrifice his own people? Especially to serve the Yatan Church?\"\n\nPrince Benoit's smile turned cold and certain. \"King Aslan overflows with ambition. He fears a pathetic end more than anything else. He won't be able to resist the great demon's temptations.\"\n\n\"Then we simply wait.\" Rose studied her mysterious partner. She'd wondered about this since their first meeting. \"I need to ask—why are you doing this? Why summon a great demon at all?\"\n\nPrince Benoit wasn't a Yatan believer. Rose had observed him carefully enough to know that. He wasn't some madman bent on destroying the world, either. So what drove his obsession with demon summoning?\n\nBenoit met her curious gaze for a long moment, then turned to stare out the window. His eyes grew distant, lonely, as he gazed at the sky.\n\n\"There's someone I want to meet.\"\n\n\"Someone?\" Rose leaned forward. \"What kind of person requires a *great demon* to reach?\"\n\nRose drew clear lines between NPCs and humans. NPCs were sophisticated AI—nothing more. She never concerned herself with their circumstances or feelings. In this, she was like most players.\n\nIt was a mistake.\n\nShe failed to read the mood, missed the warning signs, and squandered an opportunity to raise her affinity with Prince Benoit. She didn't even realize it.\n\n\"Don't be hasty just because you're curious.\" Benoit's voice dropped to a dangerous whisper. \"I may need to summon several more great demons, which makes you my most valuable helper. I'd rather not kill you.\"\n\nThe air itself seemed to press down on her.\n\n> [Prince Benoit is emitting killing intent.]\n> \n> [The bloodline of the Saharan Empire has ruled the West Continent for centuries. Their royal power is beyond superior. You are feeling an **irresistible** fear. Your actions will be restricted for five seconds. Defense and magic resistance has decreased by 23%. Some skills and spells cannot be used.]\n\n\"I-I'm sorry!\" The words tumbled out.\n\nRose—ranked first among black magicians and within the top fifty of the unified rankings—had been neutralized in an instant.\n\n*What is this power?* Cold sweat prickled her skin. *This is the Saharan Empire's royal bloodline?*\n\nGoosebumps crawled across her arms. Her grand ambition of making the Yatan Church the dominant power on the West Continent suddenly felt laughably small compared to the Empire's might.\n\n---\n\nThe result of two consecutive Linked Kill Waves, amplified by the influence of Blackening?\n\n—*Crazy.*\n\nIt could only be described as insane firepower.\n\nThe knights protecting Duke Lucilliv who stood in Grid's path? Their expensive heavy armor and reinforced shields meant nothing—they simply dissolved into grey light. The defensive magic from senior magicians? They never even got the chance to cast.\n\n\"*Kuaaaaack!*\"\n\nDuke Lucilliv let out a terrible scream as he caught the edge of the Linked Kill Wave bombardment. Grid advanced through the carnage at a speed that made the broadcast cameras struggle to track him.\n\n—*Wow... isn't Grid faster than before?*\n\n—*That looks like third advancement assassin agility.*\n\n—*What's boosting his speed? Must be some insane items.*\n\nBlackening's effects had strengthened after Grid's demonic power exceeded 10,000—now increasing attack power, magic power, and **agility** by 30%. That additional 10% agility boost made an enormous difference for someone with Grid's already-high stats. His movement speed had transformed.\n\n\"You!\" Duke Lucilliv's fury wasn't directed solely at Grid. His rage encompassed the helpless knights, magicians, and soldiers who'd failed to stop this single intruder. *Incompetent subordinates!* The duke lamented even as he drew his sword.\n\nIt was his final recourse after every formation had crumbled. But he was just a high-ranking noble. Could his swordsmanship possibly matter?\n\nThe viewers assumed Duke Lucilliv would fall instantly to Grid's blade.\n\nGrid, however, remained cautious.\n\n*He survived a direct hit from Linked Kill Wave.* Grid's eyes narrowed. *A duke of a kingdom—a named NPC. High base defense and stamina are guaranteed. He might have unexpected combat capabilities.*\n\n*I'll test him first.*\n\nGrid decided against using his strongest techniques immediately. If the duke had hidden trump cards, forcing them out prematurely would give away information.\n\nHe broke through the last line of soldiers and finally reached Duke Lucilliv.\n\n*Swaeek!*\n\nThe <span class=\"legendary\">Sword Ghost</span>—with its vastly superior attack speed compared to <span class=\"normal\">Failure</span>—shot forward in a straight thrust toward Duke Lucilliv's chest.\n\n\"A lowly *peasant* like you could never kill me!\" Duke Lucilliv roared.\n\n*Teong!*\n\nSteel met steel with a resonant clang. Heavy air pressure rippled outward from the impact.\n\n*Kiririk!*\n\nDuke Lucilliv rotated his blade with practiced skill, redirecting <span class=\"legendary\">Sword Ghost</span> toward the ground. His counterattack came immediately—his sword flashing toward Grid's exposed chest.\n\n\"Preach the greatness of Eternal's royalty in hell!\"\n\nDuke Lucilliv's face lit with triumph. He believed he could claim Grid's life with his own hands.\n\nIt was impossible.\n\nTrue, Duke Lucilliv's swordsmanship was excellent.\n\n*Puok!*\n\n> [You have suffered 2,500 damage.]\n\nBut his stats were relatively ordinary. The damage failed to penetrate Grid's <span class=\"legendary\">Triple Layers</span>.\n\n\"If you could beat me, I wouldn't have come here in the first place.\" Grid leaned close, his whisper barely audible over the chaos. Then he struck with <span class=\"legendary\">Sword Ghost</span>.\n\n\"*Hiik!*\" Duke Lucilliv's face went white as he stumbled backward.\n\n\"Protect the duke!\" Ten senior magicians moved as one, interposing themselves between Grid and their lord.\n\n*Chaaeng!*\n\nMagic shields layered upon magic shields, their combined defense transcending common sense. <span class=\"legendary\">Sword Ghost</span> couldn't pierce through.\n\n\"Now! Strike him down!\" Knights and soldiers surged toward Grid's now-blocked position.\n\n—*This is it. Grid's done.*\n\n—*He fought well, though.*\n\n—*Honestly, it's impressive he killed this many from a hundred-thousand-strong army in the first place.*\n\nHope seemed to fade. Viewers predicted Grid's inevitable defeat.\n\nThe result was the exact opposite.\n\n\"**Pinnacle Kill**.\"\n\nThe strongest single-target attack in Pagma's Swordsmanship—a skill that ignored 100% of the target's defense. It phased through the overlapping shields and struck Duke Lucilliv directly.\n\n\"Ku... *Kuaaaaaaaack!*\"\n\n\"...!\" The senior magicians stood frozen in disbelief as Duke Lucilliv began turning grey.\n\nBut the knights and soldiers had already reached Grid. Swords, arrows, and spears all converged on him from every angle.\n\n*Puk!*\n\n*Puuoooook!*\n\n\"*Cough!*\" Grid allowed numerous attacks to land, blood spraying from his mouth.\n\nThe dying Duke Lucilliv smiled through his agony as Grid's red blood splattered across his face.\n\n\"*Kukukuk!* The perfect... companion... to hell...\" Even now, he knew Grid could resurrect. But there would be a curse. A massive death penalty. Duke Lucilliv wanted Grid to taste despair.\n\nThe result?\n\n\"I'm... I'm fine.\"\n\nGrid didn't die. His wicked grin widened as he severed Duke Lucilliv's head in one clean stroke. Then he unleashed **Pagma's Swordsmanship, Wave** on the knights and soldiers surrounding him, sending them flying.\n\n\"The duke!\" Grid hoisted the severed head high. \"I have killed him!\"\n\n> [The enemies have confirmed the death of Duke Lucilliv!]\n> \n> [You have succeeded in reclaiming Bairan!]\n> \n> [The title skill **Confront 100,000 Enemies** has been acquired!]\n\n**[Confront 100,000 Enemies]**\n\n**Type:** Passive\n\nThe more enemies surround you, the higher your defense.\n\n*(There is a limit to the increase.)*\n\n\"T-This is impossible...\"\n\nGrid had swept through the enemy forces alone and beheaded their commander. He stood in the devastated plaza, and the sixty thousand non-regular soldiers looked up at him with awe. An absolute monarch with the power to defend his people—one who would sacrifice himself to protect them.\n\nThe cries of Bairan's residents reached the ears of the non-regular soldiers, igniting something inside them.\n\n\"I'm alive thanks to Grid!\"\n\n\"Thank you! I love and respect you!\"\n\n\"Grid is our eternal idol!\"\n\n\"My grandchildren will sing your praises!\"\n\n\"*Waaaaahhhhh!* Long live Grid!\"\n\n\"Long live Reidan's sun!\"\n\nThe cheers praised Grid's name. This was the spark. The captivated soldiers watched the residents' joy and ecstasy, then made their decision.\n\n\"W-We would like to become your people.\"\n\n\"Please accept us!\"\n\nThey didn't want to live in a kingdom that treated people as livestock. The non-regular soldiers begged earnestly. In truth, they doubted Grid would accept them—from his perspective, they were enemies. Afraid of execution, they pleaded humbly.\n\nGrid's choice surprised them.\n\nAsmophel whispered the situation into Grid's ear. Grid deactivated **Blackening** and adjusted the <span class=\"legendary\">Holy Light Crown</span>. Then he extended his hand to the soldiers.\n\n\"I won't disappoint you.\"\n\n\"...!\"\n\nGrid's smile was bright and warm—radiant as the sun itself. A noble smiling kindly at commoners? The non-regular soldiers vowed in their hearts to follow Grid for life.\n\n> [You have obtained 63,387 people.]\n> \n> [Congratulations! The number of people serving you has exceeded 100,000!]\n> \n> [You have achieved the minimum qualifications to establish a kingdom!]"
}