{
  "id": 566,
  "title": "Chapter 566",
  "content": "# Chapter: The Smile of a King\n\nA genuine smile takes practice. A famous actor once said, \"You have to train your face to produce a smile that resonates with everyone.\"\n\nIt made perfect sense. Not everyone looked good when they smiled. Some people, unfortunately, couldn't pull it off—and Grid had once been among them. In the past, his laughter had made people uncomfortable. Was it simply because he'd been ugly?\n\nNo. Smiling had been an alien concept to someone who'd had nothing to smile about. When he tried, the expression came out wrong—forced, awkward, unsettling. That was the real problem.\n\nBut things had changed. As Grid formed genuine bonds with people who mattered to him, smiling became natural. Now he could offer a warm expression that put others at ease, that made them trust him. His life had transformed. This simple ability was one of the most valuable gifts he'd gained.\n\n\"I won't disappoint you,\" Grid declared, his smile radiating sincerity.\n\nThe hearts of the Eternal soldiers thundered in their chests. Their eyes reddened, blood rushing hot through their veins. They were lowborn—commoners who had always been let down by those who ruled them. No, it went deeper than disappointment. They'd never had expectations to begin with. To them, a monarch was nothing more than a predator who exploited and abused the powerless.\n\nNot all rulers were corrupt, of course. But the ones *they'd* served? The absolute worst.\n\nGrid, though... Grid seemed different. Everything about him—his actions, his words, the sincerity in his expression—inspired a trust they'd never felt before.\n\n\"My family will serve yours for generations!\"\n\n\"I'll bring my wife and children to your lands!\"\n\n\"Long live Grid! Long live Grid!\"\n\n\"...\"\n\nGrid absorbed their cheers, feeling the weight of their faith settle on his shoulders like a mantle. He thought back to his first days in Reidan, remembered the hollow-eyed residents who'd had no one to rely on, who'd abandoned hope entirely.\n\n*I'll show them what happiness looks like.*\n\nNot out of charity, of course. He wasn't running a charity operation. Grid would fulfill his role as their lord, and in return, they would provide what he needed.\n\n*Sixty thousand people...!*\n\nA massive labor force. A substantial tax base.\n\n\"Asmophel, clean up the remaining enemy forces and oversee Bairan's reconstruction. These five will assist you.\" Grid gestured to the high-ranking players who'd fought beside him.\n\nAsmophel bowed deeply, unable to contain his joy.\n\n\"As you command, Your Grace.\"\n\nGrid didn't realize it, but assigning Asmophel to manage Bairan's restoration was inspired. The former Red Knight had lived as a common soldier—he understood the lower classes better than anyone. He knew exactly how to lead them effectively.\n\n\"Log out.\"\n\nGrid took his leave, exiting the game to rest.\n\n***\n\n*That was easier than expected.*\n\nGrid felt giddy as he processed the battle's conclusion. Duke Lucilliv had proven surprisingly capable, managing to halt Grid's momentum at a critical moment. Grid had been forced to tank multiple attacks, triggering his **Immortal** passive. If the Duke had held out just a little longer, Grid would've been the one lying dead on the battlefield. The 50% health penalty from **Blackening** was genuinely lethal.\n\nStill, if he'd unleashed his full arsenal from the start, the war would've ended even faster. Fighting one versus one hundred thousand had been easier than anticipated—though Youngwoo knew full well he hadn't done it alone.\n\n*Asmophel's contribution was crucial.*\n\nShin Youngwoo dissolved cocoa powder in warm milk and leaned against the window of his penthouse. It had only occurred to him later: Asmophel had disguised himself as an Eternal soldier. None of the kingdom's elite warriors had been in position to threaten Grid. Asmophel had made sure of that.\n\n*Sixty thousand soldiers swore loyalty to me today.*\n\nThe television broadcast footage from multiple fronts—Patrian, Cork Island, Borneo. Youngwoo watched his guildmates and subordinates fighting desperately across the West Continent.\n\n*Everyone's giving it their all.*\n\nThe time was approaching.\n\n*After this war ends, I'll claim my throne.*\n\nYes, it was time to become a king. The moment felt right. He wanted to make the sacrifice worthwhile for everyone who'd followed him—not just to satisfy his own ambitions. He'd been contemplating the kingdom's name for a while now.\n\n*Overgeared Kingdom.*\n\nThe Overgeared Guild would build this kingdom, so naturally it should bear that name. And what would his title be?\n\n*...Overgeared King!*\n\n*Crack!*\n\nYoungwoo gripped his cocoa mug so hard it nearly shattered. The thought of himself as a monarch sent thrills racing down his spine.\n\n***\n\n『 I understand many viewers criticized Grid's decision to face one hundred thousand troops alone. 』\n\n『 Correct. Most analysts predicted his imminent death, citing reckless overconfidence. 』\n\n『 Yet he successfully recaptured Bairan, didn't he? 』\n\n『 More than that—he absorbed at least sixty thousand of those hundred thousand soldiers. The moment Grid killed Duke Lucilliv, sixty thousand troops knelt and pledged their allegiance. 』\n\n『 I've watched the footage. It gave me chills. Over two hundred million views in just twelve hours... 』\n\n『 What compelled the Eternal soldiers to swear loyalty to Grid? 』\n\n『 I believe they were moved by his willingness to challenge an entire army to protect Bairan's citizens. Grid likely anticipated this outcome from the start. 』\n\n『 Are you suggesting Grid attacked one hundred thousand troops specifically to convert Eternal's soldiers? 』\n\n『 It seems probable. His tactical brilliance is honestly terrifying... 』\n\n『 Here's a question: Could Kraugel have broken through one hundred thousand troops and decapitated their commander? 』\n\nEveryone knew Kraugel outclassed Grid. The National Competition had proven it definitively. The comparison became the day's hot topic. If Grid could manage it, surely Kraugel could as well.\n\n『 It's not impossible for Kraugel. He possesses abilities Grid lacks. However, I doubt even he has the defense and stamina to endure such sustained assault. 』\n\n『 Furthermore, when evaluating pure offensive power and breakthrough capability, Grid clearly surpasses Kraugel. In large-scale warfare, Grid may actually be superior. 』\n\nInternational media outlets praised Grid's performance. His execution of the war effort had been flawless—undeniably brilliant. Even the God of War acknowledged it.\n\n\"Impressive.\"\n\nA middle-aged man crunched through salty potato chips and washed them down with cola. He wiped the residue from his fingers and addressed one of his most trusted aides.\n\n\"Scott, grab me another cola from the fridge.\"\n\n\"You're *impossibly* relaxed right now.\" Scott couldn't suppress the edge in his voice. \"Don't you understand how serious this situation is? Grid's going to claim the First King title! The Ares Army needs to support the Eternal Kingdom immediately! We have to crush the Overgeared Guild!\"\n\nThe Overgeared Guild's activities had Scott and the other Ares troops on edge. Since Satisfy's launch, they'd worked tirelessly toward building the Ares Empire—wandering battlefields while other rankers basked in fame and fortune. The first player to establish a kingdom would naturally be Ares. They'd earned that reward through blood and sweat.\n\nOr so the Ares Army believed.\n\nAres shrugged, watching the Overgeared members on the television screen.\n\n\"The Saharan Empire sits between us and the Eternal Kingdom. We're currently at war with the Empire. What route would our army take to reach Eternal territory?\"\n\n\"We don't need the full army! Just send a small elite force—me and Luck, for instance. We can sabotage them!\"\n\n\"Ah.\" Ares scratched his stomach idly before patting Scott's shoulder. \"Ambition's good, but don't lose sight of our ultimate goal: conquering the Saharan Empire. Don't obsess over short-term losses.\"\n\nAres retrieved a cola from the fridge, drained half of it, and climbed into his capsule.\n\n\"Did you actually watch the battle footage? Their commander, Duke Lucilliv, was incompetent. He lacked the strategic acumen to properly deploy one hundred thousand troops in a confined urban environment. Grid wasn't really fighting one hundred thousand to one—it was closer to battling a few thousand at a time. The world doesn't grasp this nuance, so they're heaping praise on Grid for his 'impossible victory.'\"\n\n\"...\"\n\n\"The Saharan Empire will be deceived by that reputation. They'll start monitoring Grid closely. We need to exploit that distraction.\"\n\nFirst King? He'd regret missing that title, but he wouldn't chase it obsessively. He had an entire empire to devour.\n\n*Grid, keep making a spectacle of yourself.*\n\nIt would be ideal if Grid attracted Agnus' attention as well. Ares grinned as he connected to Satisfy. Among his numerous titles, he possessed 'First to Slaughter 10,000 People' and 'First to Slaughter 20,000 People'—the very titles Grid and Jishuka had missed out on, despite their own massacres.\n\n***\n\nThe Overgeared Guild suffered from a critical weakness: they couldn't produce siege weapons due to insufficient technology and resources. Manufacturing siege engines required rare materials, specialized expertise, and skilled blacksmiths.\n\nLauel had been troubled by this limitation until he discovered an unlikely solution in the form of a unique class user who raised livestock with supernatural efficiency. He approached Nyangmong, the Pet Master, with an audacious proposal: Could super-large monsters be trained and deployed as living siege weapons?\n\nOrdinarily, such massive creatures resisted taming. But a Pet Master's abilities offered a glimmer of hope.\n\nNyangmong had been naive. He'd said yes. A Pet Master *could* fully tame and command super-large monsters—beasts twice the size of wyverns. But the cost had been steep. He'd been forced to release his beloved cat and dog-type monsters into the wild to free up the three pet inventory slots required for each colossal creature.\n\n*My precious babies... Are they starving out there, unable to adapt?*\n\nHe particularly worried about the short-tailed cat—a surly, arrogant creature who'd probably die alone without ever finding a mate.\n\n*I hope he's not crying because he misses me... God...*\n\nDuring the march to Reinhardt, the Overgeared members tried to console Nyangmong, who'd sunk into a profound depression.\n\n\"I'm sure your pets are thriving. They're monsters—living in the wild is probably far more fulfilling for them.\"\n\n\"Exactly. Monsters belong in nature. They're probably having the time of their lives right now.\"\n\nNyangmong's expression darkened further.\n\n\"...You're right. It's better for them to play with their own kind. Of course. Those children found happiness after leaving me. I've been... I've been stealing their happiness all this time.\"\n\n\"...\"\n\nThe Overgeared members froze. Kim Doohyun, the Korean actor who'd made it big in Hollywood—they'd assumed he was relatively normal. But no. He possessed the same peculiar quirks as the rest of the guild. Grid, Lauel, Huroi, Regas, Peak Sword, Vantner, Toon, Katz... Why were all their top players so *strange*?\n\n*Is the guild cursed or something?*\n\n*Remind me never to visit South Korea...*\n\nAs the Overgeared members contemplated this disturbing pattern, the army approached Reinhardt's walls.\n\nChief Commander Lauel raised his voice: \"Subordinates of the great war god Grid! I know the eve of battle sets your blood ablaze! But rest is paramount! Visualize the **Frost Queen's Breath** cooling your veins! We halt here!\"\n\n\"...Seriously?\"\n\nWhy couldn't he just order them to stop? Was the dramatic flair really necessary? Perhaps Lauel was ineffective as a field commander—the type who inadvertently lowered morale with every speech. He let out a peculiar *kukukuk* laugh, covering half his face with one hand theatrically.\n\n*Reinhardt...*\n\nHe'd conquer it within two days and present it to Grid. He didn't doubt the timing of his Reinhardt invasion was perfect.\n\nBut there was a variable. Prince Benoit.\n\n\"Bring me the virgins!\"\n\nAtop Reinhardt's walls, King Aslan spotted the Overgeared army in the distance and made his decision.\n\n*I'm summoning a great demon.*"
}