{
  "id": 569,
  "title": "Chapter 569",
  "content": "# Chapter: The Great Demon's Appearance\n\n## Patrian Fortress\n\n\"The enemy stopped advancing?\" \n\nYura lowered her blade, chest heaving. Beside her, Pon slumped against the ramparts while Jishuka kept her bow trained on the empty horizon. Ten days of relentless combat had finally ceased—the Eternal army's invasion grinding to an unexpected halt.\n\n\"Every muscle in my body is screaming.\" Jishuka's fingers trembled as she loosened her grip on the Red Phoenix Bow. The weapon granted her near-infinite stamina, but it couldn't ward off the mental exhaustion that came with unending battle. She sagged against the stone wall, desperate for rest.\n\nThe guild chat window erupted.\n\n\"Reinhardt...\" Jishuka's eyes widened. \"A great demon?\"\n\nYura was already on her feet, weapons drawn. Around them, the Overgeared members prepared to teleport.\n\n\"We move. Now.\"\n\n***\n\n## Reinhardt\n\n\"I will buy time. The rest of you—retreat.\"\n\nSilence fell across the battlefield.\n\nPiaro had never spoken those words before. The man who treated every opponent as equal before his hand plow. The legend who promised to \"take care of it\" before every major engagement. The farmer who *relished* challenging the strong.\n\nNow he stood before them, one arm mangled and useless, speaking of buying time instead of victory.\n\nThe Overgeared members exchanged stricken glances.\n\n*Piaro always seeks out powerful opponents...*\n\n*He's not enjoying this fight?*\n\n*If even Piaro can't win—how strong IS a great demon?*\n\nThe lore painted great demons as humanity's apex predators—existential threats capable of ending civilizations. Belial's presence confirmed it. Her aura alone pressed against their lungs like molten lead. Flames coiled around her form, and the demonic energy radiating from her body made their survival instincts *scream*.\n\nBut Piaro was a legend. A Named NPC who'd carved his own path to transcendence. The legends of old had opposed great demons. Why couldn't he?\n\nIbellin forced a laugh, the sound brittle. \"Master, retreat? That's excessive, isn't it? You're going to solo a great demon?\"\n\nMost of Overgeared's senior members had trained under Piaro. They'd sparred with him, refined their techniques through his guidance, elevated their swordsmanship to new heights. Ibellin especially—to him, Piaro was an eternal idol. His teacher. He *refused* to accept weakness in the man.\n\n*A great demon is nothing to Master! I'll stake everything on it!*\n\nDenial flooded his mind even as the evidence screamed otherwise. Piaro's Pounding Mortar—his ultimate technique—had obliterated one of Belial's arms, yet her health gauge remained virtually unchanged.\n\nIbellin's grip tightened on his sword. He charged.\n\n*Papat!*\n\nHe was strong. He would prove it. Fight the great demon and reignite Piaro's courage through his own strength.\n\nReality was crueler.\n\nThe moment Ibellin closed the distance and swung—\n\n> [**Belial's flames are too hot. You will receive 2,500 burn damage per second.**]\n\n> [**Belial's darkness has invaded your heart.**]\n\n> [**Delirium effect applied. You cannot attack Belial.**]\n\n> [**Murder impulse triggered. You will attack the nearest human.**]\n\n*Duguen!*\n\nIbellin's vision flashed crimson. His blade reversed mid-swing, redirecting toward the closest ally.\n\nFaker.\n\n*Chengkang!*\n\n\"T-This...!\" Ibellin's face twisted in horror.\n\n*I can't even attack her?*\n\nFaker's dagger caught the strike, his expression calm. \"The confusion only lasts for one blow.\"\n\nA small mercy. If the delirium persisted for an extended duration, they'd slaughter each other before Belial lifted a finger. Faker glanced back toward Lauel, the question clear in his eyes.\n\n*What do we do?*\n\nThe silent strategist finally spoke. \"Piaro—lead the soldiers and Maxong. Retreat.\"\n\nNo questions. No debate about why a great demon had appeared or what Lauel had been doing. The situation demanded immediate action, not investigation. Lauel's mind raced through scenarios, discarding options as quickly as he conceived them. Then he watched Belial shrug off Piaro's Pounding Mortar, and understanding crystallized.\n\n*We cannot kill this demon. Reinhardt's occupation has failed.*\n\nPiaro was still growing. Only four or five years had passed since he'd achieved his legend. Unlike the ancient legends who'd sealed the great demons during the Age of Heroes, Piaro needed more time.\n\n*I cannot lose Piaro or the soldiers.*\n\nAbandoning Reinhardt stung, but obsessing over an impossible objective was foolish. They needed to minimize casualties and preserve their forces. Piaro, Maxong, the carefully trained soldiers—they all had to survive.\n\nThe players would buy time with their lives.\n\n\"Earl Lauel! I will hold the line!\" Piaro's protest rang out.\n\nLauel ignored him, turning to Damian instead. \"Can you buff the entire Overgeared force?\"\n\nHe needed confirmation before committing to battle. Would Pope Damian's holy enhancement threaten a great demon? Could they resist Belial's delirium at all?\n\n\"Everyone except Piaro—attack Belial.\"\n\nThe order was executed instantly. Two hundred Overgeared members, including Faker and Ibellin and the former Silver Knights, surged forward. Most were mid-200s in level, elite by any standard.\n\nThe result was catastrophic.\n\nPlayer after player twisted mid-strike, weapons turning on their own allies. Faker and Ibellin fought each other. The formation dissolved into chaos.\n\nLauel's frown deepened. *It can't be resisted.*\n\nBelial denied all melee engagement. Every close-range fighter fell to confusion, becoming weapons against their own side.\n\n*What about ranged attacks?*\n\nLauel finished his spell—delayed by the caster's penalty of 20% reduced casting speed—and unleashed it alongside the other magicians. Earl Ashur added his own power to the barrage.\n\nThe magic struck.\n\n> [**Belial has activated Mirror Shield.**]\n\n> [**Only 30% of magic damage is applied.**]\n\n> [**The remaining 70% is reflected back to the caster.**]\n\n*Pepepepeok!*\n\n\"Kuaaaack!\"\n\nMagicians crumpled as their own spells detonated against them. \n\n*The worst possible matchup.*\n\nMelee attacks caused confusion. Magic attacks were neutralized and reflected. Ranged physical attacks like arrows bounced harmlessly off her defense. Belial was a walking disaster designed to slaughter ordinary combatants.\n\nUnderstanding dawned across the Overgeared ranks. To even *attempt* raiding Belial required legend-tier resistance to status effects. Anything less meant death—by her hand or by your allies'.\n\nLauel made the only rational decision.\n\n\"Form a defensive perimeter until Piaro and the soldiers withdraw. Do NOT attack Belial directly. Only defend. Damian, Chris—please assist with the evacuation.\"\n\nNeither were Overgeared members. He wouldn't demand their sacrifice.\n\nChris nodded immediately. \"Consider it done. Protecting your soldiers is a small price for commissioning Grid's work later.\"\n\nDamian shook his head. \"I'm staying. Isabel can escort Piaro.\"\n\nThe unexpected voice cut through the tension.\n\n\"I will also stay.\"\n\nIsabel, one of Rebecca's Daughters, drew Lifael's Spear—one of the Church's three divine artifacts—and advanced toward Belial.\n\n\"I-Isabel! Stop!\" Damian's face went pale, fear naked in his voice.\n\nIsabel didn't falter. The Rebecca Church existed to destroy Yatan's followers and the demonkin. Rebecca's Daughters stood at the vanguard of that eternal war. She couldn't turn away from a great demon's manifestation.\n\n\"**White Transformation.**\"\n\n*Kuhwaaaaaaang!*\n\nHer brilliant hair and eyes bleached to pure white as sealed power flooded her body. A golden aura erupted around her frame, radiant and terrible. She smiled at Damian—a sad, gentle expression.\n\n\"I'm repaying my debt to Grid. Your Holiness, go with the Overgeared members.\"\n\n\"I-Isabel! No! NO!\"\n\nToo late.\n\nWhite Transformation granted transcendent abilities in exchange for lifespan. The Isabel who'd faced Drevigo and Pascal was a shadow of her current strength—she'd grown exponentially, surpassing even Pope Damian in raw power. She tore free from his desperate grip and threw herself at Belial.\n\n\"**How ludicrous!**\"\n\nBelial's attention locked onto the approaching figure, fury blazing in her eyes.\n\n*Kwa kwa kwa kwa kwa kwa kwa!*\n\nDemonic flames collided with Isabel's golden aura. The shockwave tore through Reinhardt like a physical blow. The ground heaved. Palace walls crumbled. Overgeared members and soldiers died instantly, caught in the periphery.\n\n\"ISABEEEEL!\"\n\nDamian's anguished scream echoed across the ruins. He'd become pope solely to save her. Now he had to watch her sacrifice herself?\n\nGrief crashed through Lauel and the Overgeared members like a tidal wave.\n\nPiaro's fury ignited. \"Eek!\" \n\nLauel commanded Grid's forces—Piaro couldn't disobey. But watching these young women die while he fled? Intolerable. He lunged forward to aid Isabel.\n\n\"**Stop.**\" Lauel's voice cracked like a whip. \"Take one more step and you are no longer Grid's subordinate. Have you forgotten everything he's done for you?\"\n\nPiaro froze.\n\n\"I will say it again. Retreat with the soldiers.\"\n\nThe words tasted like ash in Lauel's mouth. He was abandoning Damian. Sacrificing Isabel's precious power as Rebecca's Daughter.\n\n*Someday, I'll repay this debt. I swear it.*\n\nAs despair settled over the battlefield, a whisper arrived.\n\n—*I'm moving now. Hold on a little longer.*\n\nLauel's body went rigid. That voice—\n\n—*If my strength combines with Piaro and Damian, we might be able to seal the great demon.*\n\n—*Kraugel!*\n\nThe Sky Above the Sky. The player who'd surpassed even Grid before obtaining a legendary class. Now armed with the Sword Saint class itself, racing toward Reinhardt at maximum speed.\n\nLauel's tactical mind blazed to life, processing new possibilities.\n\n***\n\n## Seoul, South Korea – The Real World\n\n\"...\"\n\nShin Youngwoo woke from restless sleep, eyes fixed on the television screen. Belial's image dominated the broadcast—all fire and malice and overwhelming presence. His jaw clenched as he suppressed his irritation and studied the demon with analytical focus.\n\nFootsteps pounded down the hallway.\n\n\"Brother! Right now...!\" Sehee burst through the door, hand shaking.\n\n\"Relax. Sit down.\" Youngwoo caught her trembling hand and pulled her beside him. \"You're coming with me.\""
}