{
  "id": 57,
  "title": "Chapter 57",
  "content": "# Chapter 57\n\nBack when I worked at the labor office, I'd managed five to six hours a day in Satisfy. Now, with the capsule room, that number had jumped to fifteen. Ten more hours of grinding. Ten more hours to make items. Twice the production output per day.\n\n> [The Legendary Blacksmith's Breath has increased the effectiveness of your production items.]\n\nThe notification flashed as I hammered the final seam. I pulled up the skill window.\n\n> [**Legendary Blacksmith's Breath**]  \n> **Lv. 2**  \n> When you are concentrating on making an item, the will of Pagma's Descendant will fill the production item.  \n> All stats of a production item will increase by **7%**.  \n> There is a rare chance of giving special features to your production items.\n\n*Please, legendary. Just this once.*\n\nThe plate armor I was working on had a level limit of 120. The materials alone cost 483 gold. One fifth of everything I owned. The most expensive gamble I'd ever made.\n\nTwenty hours of work. Twenty hours because I was terrified it would come out Normal.\n\nI wiped sweat from my forehead. *I'm not hoping for legendary. That's insane. Just... unique. Please, at least unique.*\n\nI was a legendary blacksmith. I needed something to show for it.\n\nThe final iron sheet slotted into place. Light burst from the forge.\n\n> [<span class=\"rarity-epic\">Very Delicate Plate Armor</span>]  \n> **Rating:** Epic  \n> **Durability:** 272/272 **Defense:** 303 **Movement Speed:** -6%  \n> * There is a small chance of completely defending against stab attacks.  \n>  \n> Armor made by a craftsman with great skills and potential, but lacks experience and reputation.  \n> By applying thinly refined steel plates in two layers, defense and movement has increased.  \n>  \n> **User Restriction:** Level 120+, **380+ Strength**, **400+ Stamina**, Intermediate Heavy Armor Mastery.\n\n> [An epic rated item was produced, so all stats have permanently risen by **+4** and reputation throughout the continent has risen by **+80**.]\n\n\"Dammit.\"\n\nEpic. Not Normal or Rare, so that was something. But considering the time, the materials, the capsule fees eating into my profits...\n\n*There's barely any money in this.*\n\nKhan looked over my shoulder. His eyes widened. \"Did you really make this using the method I gave you? Why did it turn out so differently despite using the same method?\" He laughed and slapped my back. \"You're truly amazing!\"\n\nI slumped against the anvil. \"How much can I get for this?\"\n\nKhan stroked his beard. \"Honestly, it's hard to measure the exact price. But one thing is clear.\" He picked up the armor, testing its weight. \"You'll get a higher price auctioning this to the knights rather than selling it at the smithy.\"\n\n\"Eh?\"\n\nAuction it to the knights? NPC knights bought at auctions?\n\n*Why would level 180 knights want level 120 armor?*\n\nKhan must have seen my confusion. \"A month ago, I witnessed the knights' armor at the procession for the newly appointed lady. I could see the work of a great blacksmith from Frontier.\" He set the armor down carefully. \"But your work is much better. Haha, it's only natural, since you're Pagma's Descendant.\"\n\nI blinked. My armor was good enough to appeal to knights twenty levels higher?\n\n*Right. The Craftsmanship Skill. The Breath Skill. That's 12% and 7% stat increases. This Epic might perform like a level 180 Normal or Rare.*\n\nPlus the added option from Breath.\n\n\"If my item sells at the auction, what's the fee?\"\n\nKhan waved dismissively. \"The proceeds for the knights' auction come from the castle. Organized in the name of the lady. Nobles have high pride. They aren't aiming for personal gain.\" He smiled. \"There is no fee at all.\"\n\n\"Okay.\" I straightened. \"I'll put it up for auction.\"\n\n\"Good decision. The auction is in two days, so I'll go at that time.\"\n\n\"No. I'll go.\"\n\nKhan raised his eyebrows. \"It's okay?\"\n\n\"Yes. I've been stuck inside for a month. I want to go outside for a while.\"\n\n\"Ah, yes.\" Khan rummaged through a drawer and produced a bronze token. \"Take this with you. It will prove your identity so you can enter without any extra procedures.\"\n\n> [You have obtained the token of 'Smithy's Successor.']\n\n*How much can I sell this armor for? If Khan's right, maybe...*\n\nNo. I stopped myself. *Don't expect too much. Lower expectations mean less disappointment.*\n\nI was someone with no luck. I'd been disappointed more times than I could count.\n\nKhan cleared his throat. \"Why don't you aim at making armor better than this one in the next two days? Wouldn't it be better to show several works if you're participating in the auction?\"\n\n\"That's true.\"\n\nFor the next two days, I invested twenty hours per day and made two more items.\n\nOne Normal. One Epic.\n\nI stared at the <span class=\"rarity-common\">Normal</span> piece in disbelief. \"How can I make a normal item after spending twenty hours on it? It should at least be rare.\"\n\n*This doesn't make sense. The S.A. Group is sabotaging me. They're worried my legendary class will destroy the balance, so they gave me the worst probabilities.*\n\nOr maybe I was just unlucky.\n\n*...Probably unlucky.*\n\n***\n\nThere were two reasons a territory ruler hosted regular auctions for knights. First, to help the knights obtain the best equipment. Second, to use it as an opportunity to find skilled craftsmen.\n\nWhy find skilled craftsmen? To make business deals. The creators of the most outstanding works gained permission to deliver goods to the lord. A door opening in life.\n\nThe annex lobby of Winston Castle buzzed with nervous energy. Dozens of people had gathered to present items, users and NPCs alike. Several blacksmiths stood among them.\n\nI scanned the crowd. *If there's an outstanding blacksmith here, I should recruit them for the smithy.*\n\nNew blacksmiths could handle the grunt work. I could take a commission from selling their items.\n\n*Once Khan steps down and I become owner, I'll run the smithy by recruiting new blacksmiths.*\n\nA type of slave project, really.\n\nThe auctioneer appeared. He was a thin man in formal attire. \"The auction will start in 20 minutes. It will last three hours. You can stay in the waiting room while it's ongoing.\"\n\nA notification appeared.\n\n> [You have entered the auction hosted by the lady. Please submit the items to be listed and the minimum bid for that item.]\n\nI opened my inventory and reviewed the items one last time.\n\n> [<span class=\"rarity-epic\">Very Delicate Plate Armor</span>]  \n> **Rating:** Epic  \n> **Durability:** 272/272 **Defense:** 303 **Movement Speed:** -6%  \n> * There is a small chance of completely defending against stab attacks.  \n>  \n> Armor made by a craftsman with great skills and potential, but lacks experience and reputation.  \n> By applying thinly refined steel plates in two layers, defense and movement has increased.  \n>  \n> **User Restriction:** Level 120+, **380+ Strength**, **400+ Stamina**, Intermediate Heavy Armor Mastery.\n\n> [<span class=\"rarity-epic\">Seemingly Plain Gauntlets</span>]  \n> **Rating:** Epic  \n> **Durability:** 83/83 **Defense:** 29  \n> **Attack Speed:** +4% **Accuracy:** +8%  \n>  \n> Gauntlets made by a craftsman with great skills and potential, but lacks experience and reputation.  \n> The exterior doesn't look like anything special, but it works surprisingly well when worn.  \n>  \n> **User Restriction:** Level 120+, **1,000+ Agility**.\n\n\"As planned, these two.\"\n\nI selected them from my inventory.\n\n> [Please set a minimum bid price for the <span class=\"rarity-epic\">Very Delicate Plate Armor</span>.]\n\n> [Please set a minimum bid price for the <span class=\"rarity-epic\">Seemingly Plain Gauntlets</span>.]\n\n*What should I set?*\n\nI normally made level 60 equipment. This was my first time making level 120 gear. I had no idea what it was worth.\n\n*I want to raise the price as high as possible, considering materials and labor. But if it's too expensive, there might not be...*\n\nA white-haired boy approached while I was distracted. \"Mister, is there a problem?\"\n\n\"You...?\"\n\nThe boy smiled. \"Hello. I'm called Steng. My class is blacksmith. I was watching you, and you seem like a blacksmith too. This seems like your first auction, so I thought I would help you.\"\n\n*Steng.*\n\nThe name was familiar. I knew it clearly, but couldn't remember why. Either my memory was garbage, or it wasn't important.\n\nI gestured at the notification windows. \"I'm worried because I can't decide on the bid price.\"\n\nSteng blinked. \"Your teacher didn't set a bid price?\"\n\n\"Teacher?\"\n\n\"The teacher who gave you this quest. Aren't you showing your teacher's items at this auction?\"\n\n*What is he talking about?*\n\nSteng pulled out a one-handed sword in a brilliant sheath. \"This is the special weapon my teacher created for this auction. Isn't it amazing?\" He grinned proudly. \"It's a <span class=\"rarity-rare\">rare item</span> with a level limit of 190.\""
}