{
  "id": 570,
  "title": "Chapter 570",
  "content": "Shin Youngwoo's mind raced, his gaze fixed on the broadcast.\n\n*Will Belial have a weakness, just like Hell Gao and the fire stones?*\n\nHell was a great demon's domain—their true home. Exerting full strength in the human world should be impossible. Hell Gao had proven that precedent. Belial must face similar limitations.\n\n*I need to find her weakness.*\n\nAll he could do was watch as the Overgeared members clashed with Belial. Youngwoo forced himself to accept this role rather than agonize over his absence from the battlefield. He steadied his breathing and studied Belial with clinical precision—her skills, her movements, the cadence of her voice, the subtle shifts in her expression, the focus of her eyes.\n\nIt was the right decision. Every fragment of Grid's growth fed Shin Youngwoo's understanding.\n\nMeanwhile, Sehee sat beside her brother, cheeks flushed. How long had it been since they'd sat together like this? A childhood memory surfaced, warm and nostalgic. But the moment shattered almost instantly. Her eyes widened, and her lips pressed into a thin, disapproving line.\n\nThe great demon on the television was *practically naked*. Flames only covered the most essential parts! This content should be rated for mature audiences!\n\n\"Are you okay?\"\n\n\"Huh?\"\n\nYoungwoo blinked as his sister's glare bore into him. Being an older brother was truly an impossible task.\n\n***\n\nA king's first duty: protect the people. This principle formed the bedrock of the bond between ruler and subject. King Aslan had shattered that principle. He'd sacrificed his people to summon a great demon. He'd abdicated the king's authority by his own hand. The act would echo through West Continent history as an unfathomable atrocity.\n\n\"The king killed my daughter!\"\n\n\"The king killed my sister!\"\n\n\"The king killed my friend!\"\n\n\"The king murdered them!\"\n\n\"Aslan is no king!\"\n\nBeyond the palace walls, the people's rage erupted in curses and accusations. Smoke choked the skies above Reinhardt—the remnants of 9,999 innocent virgins burned at the stake.\n\nKing Aslan didn't spare a thought for the angry, grieving, wailing masses. Their curses entered one ear and exited the other. In his twisted mind, enduring complaints was preferable to watching the kingdom crumble.\n\n*The people of a small kingdom are different from the people of the continent's finest power. My resolve today will pave the way to future splendor for all of you... You'll understand someday.*\n\nKing Aslan rationalized his atrocity, justifying the demon's summoning. Then he witnessed the colossal mortar descending from the heavens.\n\n**KRAKOOM!**\n\n\"Heok...!\"\n\nDivine punishment? The guilt buried in his heart's depths surged forth, and King Aslan collapsed.\n\n\"...Your Majesty!\"\n\n\"Your Majesty! Please wake up!\"\n\n\"Your Majesty!\"\n\n\"...\"\n\nA familiar voice pulled him back. King Aslan's glazed eyes fluttered open, relief washing over his features. If he was seeing Chucksley, then surely he wasn't in hell.\n\n\"You're alive... What was that mortar that fell from the sky?\"\n\nChucksley's expression was grim as he explained. \"It was a technique deployed by an Overgeared member. One of the great demon's arms was destroyed.\"\n\n\"*What?*\"\n\nThe strongest monarch of hell—fatally wounded? No, wait. Belial wasn't the strongest. She was the 32nd great demon. Anxiety clawed at King Aslan as he scrambled to the window. Had Belial perished before granting his wish?\n\n**BOOM! CRASH! BOOM!**\n\n**RUMBLE!**\n\nPandemonium sprawled beyond the palace. Ruins stretched across Reinhardt. Overgeared members burned in Belial's flames. No—this was no balanced battle. Belial was slaughtering them.\n\n\"Ha! Hahaha! That's right! A great demon wouldn't fall so easily!\"\n\n*Yes, Belial. Don't forget why you were summoned. Defend the kingdom and annihilate the invaders! Make Eternal the most powerful kingdom on the continent!*\n\nMadness blazed in King Aslan's eyes as he cheered for the great demon. Chucksley recoiled at the sight.\n\n*The king has changed.*\n\nHe'd never been qualified from the beginning. There had been some reason, once—some cause. King Aslan's sin was unforgivable, but at least he'd been minimally competent as a ruler. Not anymore. King Aslan was descending into insanity.\n\n*...The end.*\n\nChucksley realized the kingdom his ancestors had bled and suffered for was facing its final chapter.\n\n***\n\n\"Sky Dragon's Tears!\"\n\n**RUMBLE!**\n\nThey had to hold until Kraugel arrived. Lauel rescinded the retreat order and fought alongside Piaro, Isabel, Maxong, and the other Overgeared members. Only the soldiers withdrew. The Flow Master's ultimate weather manipulation technique filled the sky with thunder and rain, dampening Belial's flames.\n\n\"Free Farming 4th Style, Plowing the Field!\"\n\n**RUMBLE!**\n\nPiaro's pitchfork carved through the scorched earth. Magnificent. He resembled a god of agriculture. The ground Belial trampled transformed into farmland in an instant.\n\n\"Are you *mocking* me?\"\n\nClearing fields during battle? Even Belial—one of hell's 33 great demons—couldn't remain composed. She ridiculed Piaro as flames erupted around her. Isabel intercepted the attack, shielding Piaro's technique.\n\n\"Rebecca's servant! You're *pathetic!*\"\n\nBelial loathed Rebecca, the goddess of light—their natures were opposites. Her flames collided with Lifael's Spear as she lunged forward, seizing Isabel's throat.\n\n\"*Kuock!*\"\n\nIsabel's exhaustion from prolonged combat left her vulnerable. Belial grabbed her and slammed her face into the ground. Fortunately, Piaro's cleared land was soft rather than firm. Dirt smeared Isabel's face, but she suffered no serious injury.\n\n\"Isabel!\"\n\nDamian rushed to heal her. Isabel staggered upright, but Belial had already dismissed her. She crossed the newly-formed rice field, closing in on Piaro.\n\n\"*Cough!*\"\n\nPiaro's face tightened as he continued sowing seeds. She'd been a hundred meters away—now her movement speed was terrifying. Panic flickered through Piaro when a black shadow intervened. Faker.\n\n**CLANG!**\n\nHe couldn't strike Belial, but he could intercept her assault. He crossed his daggers, blocking Belial's thrust. The dagger meant for murder became a shield for protection.\n\n> **[Your perfect defense has failed.]**\n> **[You have suffered 9,830 damage.]**\n> **[The distance with Belial is too close! You will receive 500 heat damage and 2,500 burn damage!]**\n\n\"*Kuk!*\"\n\nFaker trembled. A monster like this existed in the world? His eyes wavered as he glared at Belial.\n\n*An ordinary human responded to my attack?*\n\nIndeed. Faker's swiftness and control impressed even a great demon. However, the significance was limited. In the future—after reaching his fourth or fifth advancement—Faker might threaten a great demon. But currently, he'd only completed his third class advancement.\n\n**WHOOSH!**\n\nFlames erupted from Belial's palms and pierced Faker's chest, disintegrating him into grey light.\n\n\"Faker!\"\n\nThe man who'd annihilated the Ice Flower Guild—killed in an instant? Lauel, the Overgeared members, and viewers worldwide reeled in shock.\n\n\"Free Farming 1st Style, Sowing!\"\n\n**Pop! Pop-pop-pop-pop!**\n\nFaker's sacrifice bought Piaro the time to plant countless seeds.\n\n\"This ends *now!*\"\n\nThis fool kept tending fields—was he mocking a great demon? Belial's irritation flared at the man who'd severed her arm and disrupted her focus. She surged past the dying Faker, attacking Piaro. Her flaming limbs struck like lightning bolts.\n\nBut the Overgeared members hadn't squandered Faker's sacrifice. Several members formed a human wall before Belial—a barrier to protect Piaro. This was the Overgeared members' role in battle.\n\n\"*Kuaaaack!*\"\n\nTen Overgeared members perished from Belial's onslaught.\n\n\"Free Farming 2nd Style, Rapid Growth!\"\n\nFury burned in Piaro's eyes as he blessed the planted seeds.\n\n**CRACK-CRACK-CRACK!**\n\nHundreds of seeds sprouted instantly, surging into massive trees. Not ordinary trees—ancient, beautiful giants that seemed to have lived for centuries. They formed a natural prison, caging Belial.\n\n*Instantly raising trees?*\n\nEven the elves couldn't accomplish this. Belial admitted a grudging respect—but the result was futile. She was the queen of fire! Piaro was a fool to trap her in wood.\n\n\"It's enough if I *burn* it!\"\n\n**WHOOSH!**\n\nBelial detonated her flames to reduce the trees to ash. However, Maxong moved faster.\n\n\"Your rampage ends here!\"\n\nAs the Water Clan King, Maxong was a master of water magic. He cast his spell.\n\n**WHOOSH!**\n\nLike an ascending blue dragon, water surged from the ground beneath Belial, trapping her inside.\n\n> **[The flames surrounding the 32nd Great Demon Belial have temporarily vanished!]**\n> **[You are free from the terrible heat!]**\n\nMaxong—king of his species. Now that he'd overcome the grief of losing his daughter, he was a powerhouse rivaling Piaro. Granted, his full strength manifested only in the sea. Still, he displayed formidable power.\n\n\"Now, Piaro!\"\n\n\"Yes!\"\n\nBelial writhed within the water pillar.\n\n\"Fated to Perish.\"\n\nPiaro seized the opening and deployed his most devastating single-target skill. His hand plow pierced Belial's forehead.\n\n**THUNK!**\n\n\"...!\"\n\nFated to Perish—an absolutely invincible technique with a 100% instant-kill rate. Naturally, targets classified as bosses resisted instant death. However, critical damage still occurred.\n\n\"*Kuk...! Kuaaaaaaaack!*\"\n\nBelial couldn't endure the agony, releasing a terrible scream. A reaction far more visceral than when she'd lost her arm.\n\n**『 ... 』**\n\n**—...**\n\nCommentators and viewers worldwide fell silent.\n\nA great demon. The raid against the worst and strongest boss...\n\n**—This is an agricultural promotional video.**\n\n**—Farming is truly magnificent.**\n\n**—Let's all wield hand plows.**\n\nPiaro seemed to proclaim exactly that. Many watching the raid footage developed newfound interest in the farmer class. This was the strength of a legend. Piaro, who pioneered the path of a new legend through sheer power alone. Piaro was extraordinary.\n\nS.A. Group Chairman Lim Cheolho paid direct attention to him.\n\n\"To me...! *Wounding me twice!*\"\n\nBelial clutched her forehead where Piaro's hand plow struck and fired demonic energy in all directions. She shattered the water pillar and trees restraining her, breaking free. She finally recognized Piaro's true nature.\n\n\"Now I understand. You're a *legend?*\"\n\nSword Saint Muller. A transcendent existence who'd humiliated several great demons centuries ago.\n\n\"You're Muller's reincarnation!\"\n\n\"No. I'm a farmer, not Muller.\"\n\n\"*Shut up!*\"\n\nShe knew legends existed in the human world, but never a farmer among them. He couldn't be a farmer.\n\n\"Stop *mocking* me!\"\n\n\"...\"\n\nNo more carelessness. She would unleash her full power! Belial turned serious, revealing her true strength.\n\n\"Summoning the 32nd Hell!\"\n\n**CRACKLE!**\n\n**CRACK-CRACK-CRACK!**\n\nThe landscape behind Belial split apart. Endless darkness poured from the fracture.\n\n\"I will tear you to *shreds!*\"\n\nSatisfaction curved Belial's lips.\n\n**FLASH!**\n\nDarkness consumed the world.\n\n> **[The 32nd Hell has been summoned!]**\n> **[Skill and magic power is reduced by 20% and casting speed is reduced by 50%.]**\n> **[Health and mana won't recover.]**\n> **[Stamina will fall faster.]**\n> **[Potions can't be used.]**\n> **[Creatures of the 32nd Hell will emerge!]**\n\n\"Ah...\"\n\nHope drained from the Overgeared members. Piaro's expression hardened. Hundreds of beautiful purple-skinned succubuses soared through the air.\n\n**『 This is impossible... 』**\n\n**『 A great demon that renders even the Overgeared Guild helpless... How can anyone defeat it? Now the continent will descend into chaos, and gameplay will be severely restricted. 』**\n\n**『 There's no hope unless the Saharan Empire deploys forces at scale. 』**\n\nThe global atmosphere plummeted. Fear of the future the great demon would bring gripped countless viewers. Then a sword fell from the heavens. The succubuses attacking Overgeared members sustained wounds.\n\n\"I apologize for the delay.\"\n\nThe sky above the sky. Sword Saint Kraugel had arrived."
}