{
  "id": 571,
  "title": "Chapter 571",
  "content": "**Clack! Clack! Clack!**\n\nHammers struck wood. Saws bit into timber. The rhythmic sounds of construction echoed across Bairan as 70,000 workers labored under the desert sun.\n\nIn what seemed like the blink of an eye, the war-torn city was transforming. Rubble from collapsed buildings vanished, cleared by countless hands. New structures rose in their place, their frames reaching skyward with astonishing speed. The workers moved with purpose—their bodies hardened by the brutal march from Eternal Kingdom, they hoisted massive loads as if they weighed nothing. What would have taken days in normal circumstances required mere hours under the coordinated leadership of Asmophel and the five high rankers.\n\nGold flowed freely, stripped from the golden armor worn by Duke Lucilliv's defeated soldiers. Bairan would grow larger and more prosperous than ever before.\n\nYet one critical problem gnawed at Asmophel's mind as he surveyed the abandoned fields.\n\n*There isn't enough food.*\n\nDuke Lucilliv's arrogance had been his undoing—he'd assumed the war would end quickly, and provisioned only enough supplies for a swift campaign. Now his 100,000 troops' worth of rations belonged to Bairan, yet even combined with the city's existing stores, they would run dry within a fortnight.\n\nAsmophel's gaze lingered on the empty farmland, barren from weeks of warfare. *If only we had one of Piaro's trained farmers. They could cultivate the fields, grow rainbow potatoes to solve this shortage.* The specialty crop of Reidan grew with remarkable speed, tasted delicious, and possessed exceptional nutritional value. But no Reidan farmers were present in Bairan.\n\n*We're at war, and Reidan can't spare the food.* His jaw tightened. *We'll need to import provisions.* His greedy lord would lament the expense, but they'd have to trade the captured gold for grain.\n\n\"Hmm?\"\n\nMovement caught his eye—a lone figure approaching from the forest road. Asmophel's hand drifted toward his weapon. That direction led to woods infested with dangerous monsters. What kind of person would travel through such territory alone?\n\nAs the figure drew closer, Asmophel recognized the worn traveling clothes, the straw hat, the farming implements hanging from a belt. A farmer? One who'd survived passage through monster-filled wilderness?\n\n*This is no ordinary person.*\n\n\"Eh? Are you Asmophel, Piaro's friend?\" the approaching farmer called out.\n\n\"You...!\" Color flooded back into Asmophel's face as recognition struck. Hurent—the farmer Piaro had personally trained before departing for Siren!\n\n\"Indeed, you are someone Piaro valued.\" Asmophel strode forward, relief washing over him. \"It was wise to invest time in your training.\"\n\n\"Huh?\" Hurent blinked.\n\n\"You foresaw that Bairan would need you and came running? Truly remarkable.\" Asmophel didn't waste time with pleasantries. \"Help us clear the fields.\"\n\n\"Huh?\"\n\n\"Teach Bairan's farmers. Cultivate rainbow potatoes.\"\n\n\"Huh?\"\n\n\"Then we'll have enough food to sustain 70,000 people!\"\n\n\"Huh?!\"\n\n\"I'm counting on you.\"\n\n> [The hidden quest **'Solve Bairan's Food Crisis'** has been created.]\n\n\"...\"\n\nHurent, the Aura Master who'd traveled all this way believing he would help protect Reidan's fields, now found himself reassigned as a farmer in Bairan.\n\nThe Overgeared members fighting in the 32nd Hell remained blissfully unaware of this development.\n\n***\n\n\"There's no answer to this.\"\n\n\"These status effects are completely insane...\"\n\nGrumbling filled the air as Overgeared members struggled against the onslaught. Great Demon Belial had summoned the 32nd Hell itself, and succubuses poured forth in waves. Debuff after debuff stacked upon the raiders until they felt stripped naked, their powers gutted and worthless. Even Maxong's expression had turned grim. Faker—one of their strongest—already lay dead.\n\nAnd this was only Belial's *second stage*.\n\n\"This monster...\"\n\nRaid a great demon? The notion seemed laughable now. They'd need years of preparation before attempting this again. Case in point: Piaro, at **level 452**, found himself forced completely on the defensive.\n\n**Pepeng!**\n\n**Pepepepeng!**\n\nHellfire erupted around Piaro's body as Belial conjured flames that burned with impossible heat. He defended frantically, each parry coming a fraction of a second slower than the last.\n\n\"There's no hope,\" someone muttered.\n\nThe situation had deteriorated beyond desperate. Success seemed impossible. Only despair remained.\n\n\"Of course...\" Another voice rang out, defiant. \"I won't give up so easily.\"\n\nNone of the Overgeared members intended to surrender. Guild Master Grid never gave up, no matter the odds—how could those who followed him do any less?\n\n\"Put some clothes on and go home!\" one member shouted at the approaching succubuses.\n\n\"Sadistic wenches!\"\n\nThe succubuses possessed unnervingly sensual bodies, their skimpy attire leaving little to imagination. Overgeared members raised weapons toward the beautiful but deadly women. Yet aside from Ibellin, none could mount an effective offense. The 32nd Hell's succubuses averaged **level 320**, while most Overgeared members hovered in the mid-**200s**.\n\n\"Hehehehe, you look *so* sexy when angry.\" A succubus licked her lips. \"Relax now. I'll make you feel *good*.\"\n\n\"I want to taste your skin...\"\n\nThe succubuses began their bewilderment assault. At least fifty swarmed the immediate area, with hundreds more visible in the distance—a tide of supernatural charm washing over warriors who found their resistance crumbling.\n\n> [You have been caught by the succubus' **Bewitchment**!]\n>\n> [It is difficult to control your body.]\n>\n> [**Magic Resistance** is reduced by **40%**!]\n\n\"You will be *delicious* to consume.\" The succubuses' faces flushed crimson with ecstasy as they revealed their true nature, latching onto the bewitched members and draining their stamina directly.\n\n\"Ungh...\"\n\n\"Dammit...\"\n\nPain and pleasure mingled as Overgeared members collapsed into helplessness. Then—\n\n*Flash!*\n\nSolid lines resembling spider silk cut across the battlefield. The confused members couldn't process what they were seeing. No sound. Just brilliant flashes of light carving through the air. But the results spoke for themselves.\n\n> [The succubus who has bewitched you has **died**.]\n>\n> [You are free from the **Bewitchment**.]\n\n\"What?!\"\n\nAstonishment rippled through the ranks. The succubuses threatening them were dissolving into gray particles?\n\n*Who?*\n\nWho could kill dozens of **level 320** monsters instantly? How many people in the entire world possessed wide-area skills with such devastating power?\n\nAs the Overgeared members stood stunned, a familiar voice cut through the chaos.\n\n\"Sorry I'm late.\"\n\nThe sky above the sky.\n\nSword Saint Kraugel had arrived.\n\nThe darkness of hell itself seemed to split in half as he leapt gracefully over the river of hellfire. He closed on Belial—who was driving Piaro into retreat—and struck at her exposed weak point with surgical precision.\n\n> [The distance with **Belial** is too close! You will receive **500** heat damage and **2,500** burn damage! You have **resisted**.]\n>\n> [**Belial's Darkness** has invaded your heart. You have **resisted**.]\n>\n> [Your mental state is being corroded... You have **resisted**.]\n>\n> [**Super Sensitivity** has scanned the subject's body.]\n>\n> [Slashing attacks will have reduced effectiveness. **Stabbing attacks** are recommended.]\n>\n> [**Critical Hit**!]\n>\n> [You have dealt **9,530** damage to the target.]\n\n\"*Ack*?!\"\n\nBelial's eyes widened. A new human had appeared from nowhere, closed the distance in a heartbeat, and *stabbed* her? The stinging pain was... uncomfortable. Unexpected.\n\n\"Who are you?\" The great demon's question dripped with genuine curiosity.\n\nKraugel didn't bother answering. To him, a great demon was simply a monster that dropped better loot. He ignored Belial's inquiry entirely, shifting position to support Piaro.\n\n\"You've endured well,\" Kraugel said.\n\n\"You...\" Piaro's eyes trembled. Kraugel had transformed—completely different from before. His growth surpassed even what Piaro had witnessed during his time as a great swordsman. \"You've finally become a Sword Saint!\"\n\nPiaro had recognized Kraugel's potential from the start. He'd seen that this man possessed greater talent than himself, believed he could eventually achieve Sword Saint status. But this quickly? Kraugel's growth rate exceeded even Piaro's expectations.\n\nIt was Grid-like talent.\n\n\"I was able to achieve it thanks to your teachings,\" Kraugel said. \"Plus, Grid—your lord—also helped.\"\n\n\"Hah... Haha.\"\n\nAttributing his own hard work and natural gifts to others? Piaro found it impossible to dislike someone with such humility. Rather than envy, he felt only genuine congratulations welling up.\n\n\"Well done. We should spar at a later date.\"\n\n\"Shouldn't we defeat the great demon first before sparring?\" Kraugel's tone remained level. \"I'm still not your match.\"\n\nAt this moment, Kraugel remained inferior to Piaro's overall combat capability. Lauel understood this truth as well. Kraugel had achieved Sword Saint during the National Competition's PvP finals at only **level 160**. Based on his calculations—factoring in Kraugel's comprehension, intelligence, hunting efficiency, title effects, and Yura's leveling speed after becoming a Demon Slayer—Lauel estimated Kraugel could potentially reach **level 160** in the short time since the competition.\n\nOnly someone like Kraugel could accomplish such rapid growth.\n\nLauel rated him extraordinarily high.\n\n*But seeing this now...*\n\nJust like Grid, Kraugel remained impossible for Lauel to fully analyze. The man had just killed fifty **level 320** succubuses. He might have surpassed **level 200** instead of hovering at **160**.\n\n*Is there hope?*\n\nBelial was a monster even Piaro couldn't handle alone. Though Kraugel's level exceeded expectations, could he truly threaten a great demon when Piaro struggled? Still, Lauel chose to place his faith. Kraugel never spoke frivolous words without basis. He clearly had some strategy in mind.\n\nThe moment Lauel's faith solidified—\n\n\"This *human* dares ignore me.\"\n\nBelial attacked Kraugel directly. Her fists and feet, wreathed in flames, lashed out in a furious combination. Kraugel evaded with **Super Sensitivity** and his innate combat instincts flowing seamlessly. Then he formed a party with Piaro and Damian.\n\nThe party system was one of the few mechanics NPCs and players shared. Piaro accepted the invitation without hesitation—and was immediately shocked.\n\n> [You are in the field of party leader **Kraugel**.]\n>\n> [**Sword Saint's Aura** is perfectly applied. Damage dealt to enemies will increase by **30%**. Damage of sword-related skills will **double**. This effect persists for the duration of the party.]\n\nDamian received a similar notification, though weaker:\n\n> [You can vaguely sense party leader **Kraugel's** field.]\n>\n> [**Sword Saint's Aura** is partially applied. Damage dealt to enemies will increase by **10%**. This effect persists for the duration of the party.]\n\n*A party buff?*\n\nWas this the dignity of a legendary combat class? Before the amazed Damian could process this revelation, Kraugel shouted—remarkably, while still evading Belial's relentless assault.\n\n\"Buff him!\"\n\n\"Ah, right! **Light's Blessing**!\"\n\n> [**Attack Power**, **Defense**, and **Accuracy** have increased by **80%**.]\n\n\"Ohhh!\"\n\nPower surged through Piaro's body. He felt reborn, transformed into someone entirely new.\n\n**Chaaeng!**\n\nKraugel could no longer perfectly evade Belial's attacks. Blood sprayed as a strike connected. He retreated while defending, then handed **White Fang** to Piaro.\n\nPiaro accepted the sword with confusion. Why would a swordsman surrender his weapon mid-combat? The question answered itself immediately.\n\n\"Can you show me the peak technique from your time as a great swordsman?\" Kraugel's voice held genuine respect. \"Please enlighten this ignorant student.\"\n\n\"My peak swordsmanship...!\"\n\nSupreme Swordsmanship. The most powerful sword art born on the East Continent, proud and devastating. While Piaro's Free Farming style drew from those principles, it inevitably lacked the pure killing power of true Supreme Swordsmanship.\n\nPiaro grasped Kraugel's intention. He didn't hesitate.\n\n\"Fall back!\"\n\nAs Belial chased the retreating Kraugel, Piaro gripped the blade.\n\n\"**Supreme Swordsmanship, Fourth Style**.\"\n\nTime seemed to freeze around Piaro. He stood alone with the sword, perfectly still as Belial charged toward him.\n\n\"You're so overwhelmed you've become a *statue*!\" Belial's momentum increased, sensing easy prey.\n\n\"**Splitting the Sky**.\"\n\nThe heavens fell.\n\n**KURURURUNG!**\n\nPiaro timed the technique precisely—the instant Belial closed within optimal range.\n\n**KWAJAK!**\n\n**KWAJAJAJAJAK!**\n\nHundreds of energy blades cascaded from the collapsing sky. They tore through the landscape of hell itself, shredding everything in their path—including Belial.\n\n\"K-*KUOOOOOCK*!\"\n\nHer third scream. Following **Pounding Mortar** and **Fated to Perish**, Belial's health gauge dropped again. Though the decrease seemed modest compared to her total vitality, it kindled fresh hope.\n\n**Kkuok.**\n\nKraugel reclaimed **White Fang** from Piaro and moved into position. He adopted the identical stance Piaro had just demonstrated.\n\n\"**Swordsmanship Creation**.\"\n\nThe strongest swordsman's technique.\n\n\"**Splitting the Sky**.\"\n\nHe inherited the power of the strongest swordsman.\n\n**KURURURUNG!**\n\nOnce more, the sky collapsed. This time, Belial couldn't even manage a scream."
}