{
  "id": 572,
  "title": "Chapter 572",
  "content": "# **[Swordsmanship Creation]**\n\n> You can create new sword techniques.  \n> The number of times it can be created will increase every time the level of **Complete Sword Mastery** increases.  \n> * The term \"sword techniques\" refers to skills that can be used when wielding sword-type weapons.  \n> * There are six factors that determine the power of the created sword technique.  \n> * Passive skills cannot be created.  \n> **Number of sword techniques that can be created: 3/4**\n\nSwordsmanship Creation was literal—true creation from nothing. It stood worlds apart from mere mimicry, operating on the same fundamental principle as Grid's **Item Creation**. \n\nKraugel's **Splitting the Sky** wasn't a copy of Piaro's technique. He had redesigned it, rebuilt it from the ground up to unleash even greater power. This had been his intention from the very beginning.\n\nThe reason Kraugel had asked Piaro to demonstrate his ultimate technique wasn't some petty desire to steal a powerful skill for free. No—it was born of pure, unwavering respect.\n\nKraugel wanted to preserve Piaro's legacy on the path of the Sword Saint he would forge in the years to come. To honor the blood and sweat Piaro had shed as a great swordsman, Kraugel willingly sacrificed one of his precious **Swordsmanship Creation** slots. In truth, the redesigned **Splitting the Sky** paled in comparison to a true Sword Saint's techniques—but that wasn't the point.\n\n\"Splitting the Sky.\"\n\nThe words carried Kraugel's profound intention. Piaro heard them. He understood immediately—one swordsman recognizing another—and felt gratitude swell in his chest.\n\n\"...!\"\n\nBelial couldn't even scream. Kraugel didn't waste the opening.\n\n*Puk!*\n\n*Puuoooook!*\n\nRelentless. Kraugel drove **White Fang** into Belial again and again. Each thrust was the product of countless hours of practice, the fundamental stab he'd honed endlessly in his quest to become a Sword Saint. Plain. Basic. Yet devastating when driven into a weak point.\n\n> [**Critical!**]  \n> [**Critical!**]  \n> [**Critical!**]\n\n**Complete Sword Mastery** amplified his attack power, attack speed, critical hit chance, and critical damage when wielding sword-type weapons. Now, its full potential blazed forth. \n\nThe Overgeared members watched Belial convulse in pain, and hope kindled in their hearts.\n\n*'He's overwhelming a great demon...!'*\n\n*'This is the Sky Above the Sky! Maybe we can actually win this raid!'*\n\nCourage surged through them at the sight of such a legendary figure fighting alongside them. They cast aside their fear and threw themselves back into the battle against the remaining succubi with renewed ferocity.\n\nMeanwhile, Kraugel's mind raced with doubts.\n\n*'Why didn't she evade?'*\n\nBelial's physical abilities were transcendent. As a great demon, she ranked among the top one hundred named bosses in all of Satisfy. Player stats couldn't compare to hers. Yet something felt wrong. She was allowing a level 214 player's attacks to land?\n\n*'It can't be... Is it that she* can't *avoid them, rather than she* won't*?'*\n\nTitle bonuses, hidden quest rewards, and elixirs had pushed Kraugel's agility beyond that of some level 300 players. His movements were blindingly fast and, thanks to **Super Sensitivity**, utterly unpredictable. Yet even a great demon should be able to respond. Kraugel's confusion deepened until a realization struck him.\n\n*'Perhaps?'*\n\nHe replayed Belial's fighting style in his mind. Her kicks and punches were swift and powerful—but were they truly threatening? No. Belial relied purely on overwhelming physical ability while her actual technique remained crude. Her attacks only became deadly because of the flames coating them.\n\n*'She isn't a martial artist?'*\n\nThe instant Kraugel understood—\n\n\"I won't tolerate this anymore.\"\n\nA cold smile spread across Belial's face as she absorbed yet another stab.\n\n**Kuaaaaaaang!**\n\nBlack magic erupted around her in a violent explosion. Dark power surged outward, instantly mummifying the nearby succubi—draining them to feed her rage. Yet Kraugel escaped unscathed. The moment Belial had detonated her magic, he'd predicted the blast radius and retreated beyond its reach using **Flow**—the legendary footwork available only to a Sword Saint.\n\n\"The more I observe, the more fascinating you become.\" Belial's voice held genuine admiration. \"Your physical abilities are far more efficient than any I've witnessed.\"\n\nShe could afford such leisure. Kraugel's expression hardened as he confirmed that every succubus within the explosion's range lay dead.\n\n*'Magician...!'*\n\nOf course. Belial's true specialty wasn't martial combat—it was magic. Her real power lay in instantaneous spellcasting. Which meant she'd been overpowering Piaro and all of Overgeared without using a single spell. \n\nKraugel shifted into the Sword Saint's defensive stance, a special form that increased his defense, blocking probability, and evasion rate.\n\n*'Just buy a little more time.'*\n\nGreat demons suffered penalties when summoned to the surface. He'd sent Hao to observe from the outskirts of the **32nd Hell**. Kraugel's goal was simple: survive until the whisper arrived.\n\nBelial waved her hand dismissively.\n\n\"I will inscribe my flames upon your very bones.\"\n\n**Hwaruruk!**\n\nThe fire wreathing Belial's body converged at a single point. Simultaneously, dark energy spread across her exposed skin like liquid shadow, forming itself into an elegant dress. Broadcasting directors across multiple countries breathed sighs of relief—they'd nearly had heart attacks when the feed threatened to shift to an adult rating.\n\n\"Taste my flames!\"\n\nThe concentrated fire at Belial's fingertips crystallized into the shape of a staff. Even at a glance, the weapon radiated tremendous magical power, perfectly embodying the Queen of Fire's devastating potential.\n\n**Kwa kwa kwa kwa kwa kwa kwa kwa!**\n\n\"...!\"\n\nA firestorm! Belial swung her staff and flames spiraled toward Kraugel in a roaring tempest. Unlike typical spells requiring preparation, this one manifested instantly—catching even Kraugel off-guard as he attempted to disengage with **Flow**. \n\nThe moment Kraugel evaded the first spell, Belial immediately unleashed a second.\n\nBut the second spell's form differed dramatically from the first. Where the initial attack had shot forward in a straight line, the second conjured thirteen separate firestorms erupting from the ground itself. Of course, such irregularity couldn't threaten Kraugel. He possessed godly control—abilities evaluated as reaching the domain of the divine. His body twisted through impossible angles, threading between the flames.\n\nThe real problem came with the third magical bombardment.\n\n**Kurururung!**\n\nWide-area magic descended from above. A meteor bombardment unlike anything witnessed since Satisfy's launch.\n\n\"**Meteor!**\"\n\nSupreme magic wielded by Belial!\n\n\"...!\"\n\nThe meteors' coverage was too vast, their descent too swift. They couldn't be evaded—not even by Kraugel.\n\n> [You have suffered catastrophic damage!]  \n> [Resisted the burn damage.]  \n> [Your right arm has been **fractured** by a meteorite. This is an unstoppable physical force.]  \n> [You have suffered **23,900 damage**.]  \n> [The confusion effect has been resisted.]\n\n\"Ku... ghhk!\"\n\n**Kwa kwa kwa kwa kwa kwa kwa kwa!**\n\nKraugel groaned as the meteor storm hammered him. Piaro and Damian were struck as well, coughing blood. Isabel and the Overgeared members fared no better. Nearly every Overgeared member below level 300 died instantly. \n\nViewers around the world sat stunned. The legendary **Meteor** spell proved even more powerful than the red phoenix Grid and Jishuka had summoned!\n\n**Kurururu!**\n\nThe **32nd Hell** lay in ruins from the meteor bombardment. Ash clouds choked the air while hellfire boiled over in all directions. The devastation was absolute.\n\nBelial's eyes remained cold as she surveyed the groaning Overgeared survivors.\n\n\"That brat?\"\n\nThe human called Kraugel. She wanted to kill him for inflicting such terrible pain. But where was he?\n\n\"Hiding like a rat.\"\n\nHe must have used the chaos to flee. Belial scoffed and began casting again.\n\n\"Can you survive a second time?\"\n\n**Kurururung!**\n\nDark fireballs materialized in the sky above the hell—precursors to a second **Meteor**. With infinite magic power, Belial could cast supreme magic consecutively.\n\n\"Cough! Cough cough! Piaro...?\"\n\nThey would all be wiped out. And Piaro couldn't resurrect. Lauel assessed the situation with growing desperation and finally located Piaro. Due to his proximity to Belial during the initial bombardment, Piaro had taken grievous wounds. He lay motionless on the scorched ground.\n\n\"P-Piaro!\"\n\nNew meteorites gathered overhead. Lauel's desperation peaked. Piaro was Grid's teacher—mentor to all the Overgeared members. He was one of their strongest pillars. What would happen if they lost him? The Overgeared Guild would crumble. Piaro's importance was that absolute.\n\n\"I...! I'll die a hundred times if it means saving you...!\"\n\n*Stagger.*\n\nLauel took weak, trembling steps forward. Despite knowing Belial could kill him at any moment, he pressed on without hesitation. His entire focus centered on reaching Piaro.\n\nBelial noticed where Lauel's gaze was fixed and found it amusing.\n\n\"Yes, you wish to save Muller's descendant?\"\n\nBelial's fundamental misunderstanding of Piaro remained intact. Beneath the gathering meteors, she aimed her staff at Piaro and conjured a spear of fire.\n\nAt that moment—\n\n\"Muller's descendant is right here.\"\n\nKraugel materialized behind Belial and drove his blade home. The thrust carried tremendous killing intent.\n\n\"My name will surpass Muller!\"\n\n**Kuoooooh!**\n\nKraugel roared like a dragon as **White Fang** pierced Belial's neck.\n\n\"What nonsense.\"\n\nThe instant Belial redirected her fire spear from Piaro toward Kraugel—\n\n\"**Hell Regulation.**\"\n\n> [The Demon Slayer has exerted influence on the **32nd Hell**.]  \n> [The debuffs of the **32nd Hell** are temporarily disabled!]  \n> [The power of the **32nd Great Demon Belial** has sharply fallen!]\n\n\"W-What is this?\"\n\nShock widened Belial's eyes as a fire arrow streaked toward them."
}