{
  "id": 573,
  "title": "Chapter 573",
  "content": "Confidence surged through Belial's veins.\n\nKraugel's blade arced toward her throat—sharp, precise, but lethably slow. His technique was flawless, his physical capabilities woefully inadequate. *The fire spear will incinerate him before his sword ever reaches me.*\n\nThe farmer claiming to be Muller's heir? Broken beneath her meteor storm, both legs shattered, immobilized. *I can end him whenever I please.* The others? Kindling waiting to be consumed.\n\nVictory was inevitable.\n\nYet life—and death—respected no certainty. Providence made no exceptions, not even for great demons.\n\n\"**Hell Regulation**.\"\n\n\"What?\"\n\nBelial's composure cracked. Half her magic—that vast, seemingly infinite wellspring—evaporated in an instant. The oppressive aura of the 32nd Hell dissipated. Her meteors, mid-descent, simply stopped.\n\n\"T-This power...!\"\n\nRecognition struck like a knife between the ribs. The emergence of a being who was the antithesis of all great demons.\n\n*Demon Slayer.*\n\nUnlike Muller, who had defeated great demons on the mortal plane, the Demon Slayer of legend had descended into Hell itself and *hunted* them. Five Hells had fallen to that class. Five rulers, destroyed.\n\nIce flooded Belial's spine.\n\n*Muller's successor and a Demon Slayer? Both here, at once?*\n\n**Puok!**\n\n\"...!\"\n\nWeakened and reeling, Belial barely registered the fire arrow until it struck. She laughed—a sound edged with hysteria. *Shooting flames at the Queen of Fire?* She reached for the energy, ready to absorb it, to feast—\n\n\"Ack?!\"\n\nPain lanced through her. The flames surrounding the arrow were anathema to her essence.\n\n*Divine fire. Red Phoenix.*\n\nHow could anyone on the West Continent wield a Red Phoenix's flames? Belial forced herself to focus through the chaos. Her gaze snapped toward the source.\n\nTwo women. One pale as moonlight with lustrous dark hair. The other sun-bronzed and lithe, skin glowing with vitality. Both trained their weapons on Belial—a bow and a gun.\n\n*Alex's gun!*\n\nDanger. The Demon Slayer's cleansing rounds would erode her essence with every hit. Belial twisted to evade—\n\nKraugel's sword pierced her throat.\n\n\"K...Kuaaaack!\"\n\n*How?* His stats were inferior! Every calculation said his blade should be too slow, too weak. Yet every strike found its mark, carving through her defenses like they were paper.\n\n**Puok!**\n\n**Kwa kwa kwang!**\n\n**Puuok!**\n\nKraugel's blade impaled her. Yura's bullets tore through her chest. Jishuka's arrows buried themselves in her flesh. Blood—her blood—spattered across the shattered ground.\n\nBelial's eyes found Kraugel, who had seized her ankle in an iron grip.\n\n\"I see...! Muller's successor is you, not that farmer!\"\n\n\"No,\" Kraugel said quietly. \"I didn't inherit Muller's techniques. I am the new Sword Saint—and I will surpass him.\"\n\n\"Impossible...!\"\n\nA Sword Saint. A Demon Slayer. A farmer whose potential rivaled them both. From any great demon's perspective:\n\n*This is catastrophic.*\n\nLegends capable of threatening the great demons appeared once per era. Perhaps twice, in the most turbulent centuries. Yet today, four had converged on this battlefield.\n\n*Why now? Why me?*\n\nDid that cursed Rebecca orchestrate this?\n\n**Pepeng!**\n\n**Pepepepeng!**\n\nBullets and arrows hammered Belial without pause. At full strength, she could have vaporized these attacks before they landed. But weakened as she was, crippled by Hell Regulation, her pride bled with every hit.\n\nAnd Kraugel. That insufferable swordsman read every dodge, blocked every escape. If she moved left, his blade was there, thrust extended. If she darted right, he'd already cut off the angle.\n\n*I'm dancing in his palm.*\n\n**Puoook!**\n\n\"...!\"\n\nA spear erupted through her heart. Pon's Rail Spear. Behind him, the Overgeared forces unleashed their ultimate skills in a devastating barrage. The succubuses, weakened by Hell Regulation, could no longer shield her or threaten her enemies.\n\nEarl Ashur deserved credit for that. Unable to harm a great demon directly, the great magician had focused his considerable power on annihilating the lesser demons. Protected by Ashur and Bland, the Overgeared members attacked without fear.\n\n\"Ugh! You insects!\"\n\nBelial's health dropped to two-thirds. Rage consumed her.\n\n\"I'll show you my true form rather than endure this humiliation!\"\n\nShe was the Queen of Fire and Darkness. But before that, she was the Queen of Lies—wearing beauty like a mask to deceive mortals. Now, that mask would shatter.\n\n**Jjejeok!**\n\n**Jjeejeeeong!**\n\nCracks spider-webbed across her skin. Lava and demonic energy boiled through the fissures, grotesque and terrible.\n\n\"**Kieeeeeeek!**\"\n\nBelial abandoned her human shell. Lava formed her body now, four legs planting against scorched earth. Countless blood-red eyes swiveled in all directions.\n\n\"Kik! Kikikik! Once you witness this form, none of you will survive!\"\n\nThese legends were still immature. Numerous, yes—but unripe fruit, easily crushed.\n\n**Kurururung!**\n\nA firestorm saturated with demonic energy engulfed the battlefield. Kraugel, Piaro, Damian, and Isabel—all caught in the devastation—screamed as flames seared flesh.\n\n\"Kuk...!\"\n\nThe accumulated damage was too much. No potions could save them now. Death loomed.\n\n*I can't use Heal alone!*\n\nDespair clawed at Damian. He was the Goddess's Agent, Pope of the Rebecca Church—why was he so useless against a great demon?\n\n*I should have remained a priest.*\n\nHeals would have sustained his allies. But he'd specialized in buffs, and buffs were fleeting. *Worthless. I'm worthless.*\n\n\"You did your best,\" Piaro said, his voice steady despite everything. \"Without you, we wouldn't have made it this far.\"\n\n\"P-Piaro!\"\n\nDamian's eyes widened. Piaro, using his hoe as a crutch, limped toward Belial.\n\n\"I'll buy time. Both of you—retreat.\"\n\n*They're all young,* Piaro thought, his mind clear. Kraugel, Damian, Yura, Jishuka, the Overgeared members. *So much potential. If they survive, if they grow... they'll surpass even this demon.*\n\n\"Why aren't you leaving?\"\n\nKraugel and Damian stood their ground. Piaro advanced on Belial. The great demon sneered.\n\n\"You can't even stand properly.\"\n\nPiaro's expression didn't change.\n\n\"I'll kill you first!\"\n\nBelial's decision was tactical. Piaro remained the most dangerous. Eliminating him was priority one. She shifted her focus entirely to the crippled farmer.\n\n**Pepeng!**\n\n**Pepepepeok!**\n\nChaos erupted. Jishuka's arrows flew wild, no longer aimed at Belial. Fire arrows detonated against the ground, against allies—\n\n\"Hah! Hahahahahat!\"\n\nBelial's laughter was unhinged. \"Attacking your teammates? You've lost your mind!\"\n\nHumans were so delightfully fragile. Watching them self-destruct was almost worth the inconvenience.\n\n\"You evil creature!\" Huroi shouted from his wyvern, voice booming across the battlefield. \"Your parents are angels! You fell from Heaven!\"\n\n\"...?!\"\n\nAngels. *Parents.* Fallen.\n\n\"H-How *dare* you?\"\n\nIn millennia of existence, no one had ever—*ever*—uttered such an insult. Fury eclipsed even the humiliation of Hell Regulation, the frustration of Kraugel's perfect defense. Belial's eyes blazed with incandescent rage—\n\n\"My body feels light.\"\n\n\"This is amazing.\"\n\nPiaro, Kraugel, Isabel, and Damian emerged from Jishuka's flames—unscathed. *Healed.*\n\n\"Recovery?\"\n\nImpossible. The flames should have burned them. Instead, Piaro's shattered legs were whole again.\n\n\"How's that?\" Jishuka puffed her chest proudly, a radiant grin on her face. \"I'm the main healer of Overgeared.\"\n\nMale viewers worldwide watched with hearts practically visible in their eyes.\n\n—*She's sexy and cute.*\n\n—*I want to be hit by Jishuka's arrows.*\n\n—*Agreed.*\n\n—*Ah... I want to join Overgeared.*\n\n—*If I get strong like Kraugel, maybe I can.*\n\n—*You think you're Kraugel-level? Or Overgeared material?*\n\n—*I want to fight.*\n\nThe Belial raid's viewership peaked—trailing only Grid's National Competition records. Could Overgeared actually defeat a great demon? The world held its breath.\n\n\"**Light of Destruction**.\"\n\nDemon Slayer Yura activated her ultimate skill. A pillar of radiant energy consumed Belial.\n\n* * *\n\nSeoul, South Korea.\n\n\"My share...?\"\n\nYoungwoo, who'd been anxiously watching his guildmates fight for their lives, felt a different emotion entirely.\n\nIrritation."
}