{
  "id": 575,
  "title": "Chapter 575",
  "content": "# Chapter: The Queen of Lies\n\n**Pounding Mortar**—one of Free Farming's devastating techniques. **Fated to Perish**—Piaro's ultimate art, a strike that guaranteed death itself. Despite both skills landing squarely on Belial, her health gauge barely flickered. Yet moments later, two uses of **Splitting the Sky** carved visible chunks from that same bar.\n\n*Why?*\n\nThe question had gnawed at Lauel throughout the entire raid.\n\n*Is she the type of boss who only takes damage after a threshold is met?*\n\nNo. The probability was too low. Pounding Mortar might fall short of such a threshold, but Fated to Perish was the strongest single-target skill in all of Satisfy. There was no logical reason for its damage to register lower than Splitting the Sky—especially when Kraugel was still relatively low-level, making his attacks objectively weaker than Piaro's.\n\n*What if she consumed something else instead of health when those first skills hit...?*\n\nA mana shield, perhaps. But he'd seen no visual effect to confirm it.\n\n*What am I missing?*\n\nLauel's mind churned even as the battle raged around him. Understanding a boss's mechanics was crucial to any successful raid. No matter how many angles he examined the problem from, Belial's health formula made no sense.\n\nThen again—maybe he didn't need to understand it anymore.\n\nThanks to Yura's unique abilities, Belial's health had plummeted to 10%. The mystery of why she'd taken no damage at the start hardly mattered now. This nightmare would be over soon.\n\nRelief began to wash over Lauel.\n\n***KUUOONG!***\n\nThunder and demonic energy exploded outward. Belial's form rippled and changed.\n\nGone was the seductive beauty. Gone was the monstrous terror. What emerged was something far more disturbing—a cold, emotionless woman rendered in pitch black, like a porcelain doll dipped in shadow. Insectile wings unfurled from her shoulder blades with a wet, chittering sound. Every inch of her skin had turned to obsidian, save for her eyes—those burned crimson, twin embers in a void.\n\n\"The health gauge...\"\n\n\"It *recovered?*\"\n\nThe Overgeared members—Lauel included—stared in disbelief. After the transformation completed, Belial's depleted 10% bar swelled back to a full 100%.\n\n*A transformation heal?*\n\nThat was the immediate conclusion most of the guild jumped to. But Lauel's mind worked differently.\n\n*Her health didn't restore during her first transformation.*\n\nIt made no sense for recovery to trigger only on this second change. Around him, morale plummeted like a stone. But Lauel's eyes widened as understanding crystallized.\n\n*The Queen of Lies...!*\n\nHe replayed the entire fight in his mind. Belial had screamed with every hit. Groaned. Flinched. She'd acted like she was suffering even when her health gauge remained untouched.\n\n*Why perform pain if you're not actually damaged?*\n\nThere had to be a reason. Belial wouldn't waste energy on meaningless theatrics.\n\n*Unless...*\n\nThe perspective shifted.\n\n*What if the actor isn't Belial—but her health gauge itself?*\n\nYes. That made perfect sense. Belial was the **Queen of Lies**. She wielded deception like a weapon. Using her own health bar as a prop was exactly the kind of trick she'd employ.\n\n*Looking back—she barely reacted to Fated to Perish and Pounding Mortar.*\n\nThose massive attacks had drawn minimal response. But afterward, when Piaro appeared, when Sword Saint Muller's specter manifested, when Demon Slayer Yura joined the fray—*that's* when she'd started to panic. She'd faced too many unexpected variables in rapid succession, lost her composure, and her health gauge had begun dropping.\n\n*She forgot to maintain the illusion.*\n\nNow the black skin made sense too.\n\n*It's a shell to hide her wounds.*\n\nA laugh bubbled up from Lauel's throat. He covered half his face with one hand, grinning behind his palm.\n\n\"Embodiments of Overgeared! Do not be deceived by the veiled appearance of the evil demon Belial. Her obsidian carapace is merely epidermis—a shroud to conceal her ravaged flesh. That emotionless mask? Nothing more than a facade to hide her anguish. Belial stands before us now as a wounded beast, her very soul bleeding!\"\n\nThe morale of his guild needed salvaging. He'd give them the truth wrapped in dramatic flair.\n\nThe Overgeared members stared at him.\n\n\"...Is he seriously doing this right now?\"\n\n\"What the hell is he even saying?\"\n\n\"...\"\n\n*Tch. Ordinary minds can't grasp my wavelength.* Lauel smiled ruefully and tried again—simpler this time. \"Belial's health gauge is a **lie**. Just like we saw earlier, her *actual* health is still at 10%. Don't panic. Pour everything you have into finishing this raid.\"\n\n\"Yes!\"\n\nDespite his chuuni tendencies, they trusted Lauel implicitly.\n\n\"We'll end this infernal nightmare!\"\n\n\"Direct attacks won't work! Avoid the confusion status and support Piaro, Yura, and Kraugel!\"\n\nEveryone except the grievously wounded Jishuka surged forward. The fake health gauge no longer fooled them. Victory blazed in their hearts.\n\nReality, however, was merciless.\n\nBelial's final form wasn't just theatrics. Her combat power had skyrocketed. Exhausted and battered, neither Kraugel nor the Overgeared members could match her now-overwhelming strength.\n\n\"**Meteor**.\"\n\n***KWA-KWAAANG!***\n\n***KWA-KWA-KWA-KWA-KWA-KWA-KWA-KWA!***\n\nThe sky tore open. Hundreds of flaming meteorites plummeted earthward like divine judgment made manifest. The phenomenon transcended magic—it was catastrophe incarnate.\n\n\"KUAAAACK!\"\n\n\"Ugh! I'm sorry!\"\n\n\"They say suffering makes you stronger, right?!\"\n\n***PAAK!***\n\n***PA-PA-PA-PA-PAT!***\n\nMeteorites obliterated Overgeared members one after another, reducing players to grey light. Even the raid's heavy hitters—Kraugel, Yura, Jishuka, Damian, Pon, Regas—suffered crippling injuries.\n\n\"S-Shit...\"\n\n\"We're... we're finished...\"\n\nDespair settled over the survivors as they watched their comrades die. Then someone spotted Piaro.\n\n\"Master...!\"\n\n\"Piaro!\"\n\nHe stood alone against the apocalypse, batting away meteors with his sickle and hand plow in a blur of desperate motion. Blood poured from countless wounds. His left wrist hung at an unnatural angle—shattered. And Belial was advancing on him step by inevitable step.\n\n\"N-No...\"\n\nThe Overgeared members wanted to save him. Wanted to rush forward and pull him back. But they couldn't even stand. Broken limbs from meteor impacts pinned them to the ground.\n\n\"Ah!\"\n\nJishuka nocked an arrow, aiming for Piaro's feet. The **Red Phoenix Bow**'s splash healing might reach him. Her fingers slipped. The arrow careened wide, her broken digits unable to maintain the draw, her prone position making accurate shots impossible.\n\n\"Great Demon!\" Piaro's voice rang out hoarse and defiant. \"I am my lord's subordinate! These warriors will become my lord's future strength—do not touch them!\"\n\n***KUWOOOOH!***\n\nAs Belial closed in, Piaro burned his remaining mana like a funeral pyre consuming his life force.\n\n\"*Cough!*\"\n\nBlood sprayed from his lips. He swung his precious hand plow in one final strike aimed at Belial's core.\n\nBut Piaro was already too broken.\n\n\"...\"\n\nBelial sidestepped the attack with contemptuous ease. Flames erupted from her palm, incinerating the hand plow. Her other hand shot out and clamped around Piaro's skull like a vice.\n\n\"I'm curious about this 'lord' you speak of.\" Her voice was cold, clinical. \"A human monarch is such a *weak* thing. How amusing that you think of him while staring at death. Now... you will all die. I want to see a human head burst like a volcanic eruption.\"\n\n***KKUOK!***\n\nDemonic energy gathered in her grip, preparing to detonate—\n\n\"Jude. **Kill**.\"\n\nJude had spent most of the battle cowering in a corner, his pure mind unable to function around Belial's and the succubi's exposed forms. But now Belial wore a shell of darkness. The succubi had been wiped out by her own meteors. Freedom—and clarity—returned to the young warrior.\n\nHe moved.\n\n***PUOK!***\n\n**Dainsleif (Reproduction)** crashed into Belial's face.\n\n\"Hoh?\"\n\nGenuine surprise flickered across her emotionless features. *A human attacked me? Why isn't he affected by my demonic energy? Why isn't he attacking his own allies?* More pressingly—*how did he survive the meteor bombardment?*\n\n***KWACK!***\n\nBelial's hand snapped up and caught the blade before it could pierce her skin.\n\n\"You're also a legend?\"\n\n***Grip.***\n\nJude's arms were already bloody from maintaining his hold on the sword. He refused to let Belial take it. \"I. Jude.\"\n\n\"Jude? Is that a legendary name?\"\n\n\"I. Jude.\"\n\n\"...?\"\n\n*This one is broken.* Belial dismissed him as worthless. Demonic energy pulsed.\n\n***PEEEEONG!***\n\n> **[Dainsleif (Reproduction) has been broken by the power of the great demon!]**\n\n\"...!\"\n\nThe sword Lord Grid had entrusted to him—*shattered*. Fury ignited in Jude's chest. But fury meant nothing here. Piaro dangled from Belial's other hand. Jude himself would die in moments. Belial's power was absolute.\n\n\"Jude!\"\n\nThe two pillars of Overgeared—about to crumble before their eyes. Reality was unbearable. Everyone silently prayed for their survival.\n\nBelial did not grant prayers.\n\n\"Die.\"\n\n***PEENG!***\n\nMagic coalesced at her fingertips, aimed at both captives' heads—\n\n***PAHAT!***\n\nPiaro and Jude vanished from her grasp.\n\n\"What?\"\n\nNo spatial distortion. No telltale signs of Teleport. Confusion cracked Belial's mask for the first time. Her gaze snapped upward.\n\nThere—hovering in the sky—the wounded Piaro and Jude were cradled in the arms of a stranger. Black hair. Sharp eyes like a bird of prey.\n\n\"A *human* dares look down on me?\"\n\nAbsurd.\n\n\"Who are you?\"\n\nThe black-haired man—Grid—met her crimson stare.\n\n\"The lord of these people.\"\n\n***KUOOOOOOOOH!***\n\nGrid triggered **Blackening**. His body began to transform. Belial recoiled, genuine revulsion twisting her features.\n\n\"The man without a soul? H-How are you here?\"\n\n\"...?\"\n\n*'Without a soul'—the first time we meet and she goes straight for that?*\n\n\"I've heard harsh words all my life,\" Grid said flatly. \"But that's a new type of attack.\"\n\nHe passed Piaro and Jude gently to Saintess Ruby. Then he descended toward the battlefield, **sword dance** already beginning in his hands."
}