{
  "id": 578,
  "title": "Chapter 578",
  "content": "**(Breaking News) Great Demon Belial Has Been Destroyed!**\n\n**(Breaking News) Overgeared Guild Succeeds in Great Demon Raid! Their Power Will Skyrocket!**\n\n**(Breaking News) Kraugel's Hidden Class Identified as Sword Saint!**\n\n**(Column) Future Power Dynamics Should Center Around Overgeared**\n\n**(Column) Is the Rebecca Church a Complete Ally of Overgeared? Where Does the Saharan Empire Stand?**\n\n**(Column) Analyzing Kraugel's Potential Based on the Previous Sword Saint**\n\n**(Column) The 32nd Great Demon: Belial**\n\n**(Column) Look at Piaro and Isabel—We Need to Invest More Interest in NPCs**\n\n---\n\n\"Top rankers are on a completely different level.\"\n\n\"No kidding. Who would've thought they'd actually succeed in a great demon raid?\"\n\n\"It's thanks to those incredible NPCs—Piaro and Isabel. They made all the difference.\"\n\n\"Exactly. The only reason they pulled it off was because Piaro had the agility to match Belial's speed and the defensive capability to tank him.\"\n\n\"Yeah, Piaro was—\"\n\n\"What about Kraugel's godly control?\"\n\n\"Kraugel lived up to his reputation. Every time Piaro or Isabel was in a crisis, he pulled Belial's aggro back. His movements were phenomenal—there's no doubt he's a true Sword Saint.\"\n\n\"Definitely. He really is worthy of being called the best. I wouldn't have accepted any other ranker becoming a Sword Saint, but for Kraugel? It's perfect.\"\n\n\"But didn't Chairman Lim directly state that Sword Saint is the strongest combat legendary class? Grid looks way stronger to me.\"\n\n\"Grid is broken in every aspect. The potential of Pagma's Descendant as a legendary item maker seems unmatched.\"\n\n\"There's a rumor your level resets when you become a legend... Maybe Kraugel's level is still low?\"\n\n\"A level reset is complete bullshit. Think about it—legendary class or not, who would keep playing if their level was wiped?\"\n\n\"True. That would be a ridiculous penalty for top rankers.\"\n\n\"By the way, how the hell did Grid recruit the strongest farmer?\"\n\n\"That loyalty is insane. Didn't Piaro hand over all his raid rewards to Grid?\"\n\n\"First time I've ever seen an NPC give items to a player without it being a quest reward.\"\n\n\"God... I'm so jealous of Grid. What must it feel like to have the strongest NPC that loyal to you?\"\n\n\"Starting today, I'm being friendly to every NPC I meet. Who knows? Maybe one of them will be my Piaro.\"\n\n\"I'm more curious about the actual raid rewards. A great demon must drop incredible titles and items.\"\n\n---\n\nThe world was shaking. The impact of the great demon raid eclipsed even the National Competition. How much stronger would Overgeared, Kraugel, and Damian become after killing Belial and claiming the loot? How would Hell react to the destruction of a great demon? What did players need to do to recruit NPCs like Piaro and Isabel?\n\nAs people across the world buzzed with questions, the site of the Belial raid had transformed into a celebration.\n\n---\n\n> **[Savior of the World]**\n>\n> A hero who saved humanity from Great Demon Belial.\n>\n> The continent's minstrels will sing your saga.\n>\n> * **All stats +200.**\n> * If you listen to your epic song performed by a minstrel, you will receive a buff that lasts for three hours.\n\n---\n\n\"Yes!\"\n\n\"Hell yeah!\"\n\nEvery level granted ten stat points. For a player with ten different stats, it would take **200 levels** just to raise all ten stats by 200 points. The value of the **Savior of the World** title was truly astronomical. The Overgeared members who participated in the Belial raid averaged eight stats each—they'd all achieved exponential growth.\n\n*The rise of Overgeared is beyond imagination.*\n\nKraugel smiled as he watched the jubilant Overgeared members. He recognized them as his peers now—Grid's comrades. Kraugel was genuinely pleased they'd grown stronger.\n\nGrid noticed the smile on Kraugel's face and felt his own mood lift. He was happy because Kraugel was happy. He wanted to congratulate him on his growth.\n\n\"Congratulations, Kraugel. You'll become even stronger now.\"\n\n\"I congratulate you as well. Perhaps we're both the biggest beneficiaries here.\"\n\nCurrently, Kraugel possessed fifteen different stats—tied with Grid's count. The increase in combat power for both men far exceeded the others, since all fifteen stats gained 200 points at once. Grid was satisfied.\n\n\"You know, I also have the Kingdom's Hero title. It increases all my stats by 120, so with both titles, I get +320 to all stats.\"\n\nKraugel snorted. \"I have plenty of titles that raise all stats too. Mine give me +350 to all stats just from titles alone. So I win.\"\n\n\"I—I have more titles that raise **strength** or **intelligence** separately, so I think we're about even.\"\n\n\"I have plenty of those too.\"\n\n\"What...?\"\n\nGrid felt a pang of defeat. He'd been grinding through quests and raids constantly—how was he still behind in titles?\n\nKraugel shrugged at Grid's frustrated expression. \"I know you're frustrated, but... honestly, it's surprising there isn't a bigger gap between us, considering I've been dominating content since Satisfy opened.\"\n\n\"...Don't patronize me.\"\n\nGrid grumbled aloud, but inwardly, his thoughts differed. His heart felt warm. In retrospect, he hadn't been a match for Kraugel until after becoming Pagma's Descendant. Now, without even realizing it, he stood shoulder to shoulder with him.\n\n*The presence in the sky I couldn't even see... is now my friend.*\n\nPeople believed in natural destiny, and the old Grid had never doubted it. An earthworm on the ground could never fly. But what was the reality? Destiny could be pioneered. Grid had worked hard and overcome the natural limitations of an earthworm. He wanted to tell everyone:\n\n*Try it.*\n\nLight could be won through effort. Someone unhappy today might be smiling tomorrow.\n\n---\n\n> **[Belial's Black Jewel <span class=\"unique-c\">C</span>]**\n>\n> A beautiful jewel that can be processed into accessory materials. Noblemen will purchase this great demon gem at an extraordinarily high price.\n>\n> When crafting accessories, there is a low chance of acquiring an option that increases **intelligence** or **shadow resistance**.\n>\n> **Weight:** 2\n\n> **[Belial's Red Jewel <span class=\"unique-c\">C</span>]**\n>\n> ...\n>\n> When crafting accessories, there is a low chance of acquiring an option that increases **intelligence** or **flame resistance**.\n>\n> **Weight:** 2\n\n> **[Belial's Hard Skin]**\n>\n> Can be used to craft weapons or armor.\n>\n> When crafting weapons, there is a medium chance of acquiring an option that increases **intelligence**, **damage**, or **attack speed**.\n>\n> When crafting armor, there is a medium chance of acquiring an option that increases **magic resistance** or **movement speed**.\n\n---\n\nThese were the rewards obtained by everyone who participated in the Belial raid—five <span class=\"unique-c\">C-grade</span> jewels and ten hard skins. Would ten skins alone be enough to make an item? Grid answered the eager questions from the Overgeared members.\n\n\"I can produce one armor piece or one weapon from this. Look at what equipment you're lacking and give me a production request.\"\n\n\"Ohhh!\"\n\n\"Thank you, Grid!\"\n\nThe Overgeared members' faces lit up. They were thrilled to have a legendary blacksmith as their guild master. Immediately, they pressed him for more information.\n\n\"What rewards did you get?\"\n\n\"Yeah, what about the first place prize Piaro handed you?\"\n\n\"I...\"\n\nGrid checked his loot. The fifth rank rewards weren't much different from what the other Overgeared members received—five <span class=\"unique-b\">B-grade</span> Belial black and red gems, plus ten more skins.\n\n*A B-grade jewel is already huge.*\n\nBut it paled in comparison to the first rank prize. Grid's heart pounded as he examined the loot Piaro had given him.\n\n---\n\n> **[Belial's Black Jewel <span class=\"mythic-s\">S</span>]**\n>\n> A beautiful jewel that can be processed into accessory materials. The value of this gem—which can never be obtained again—is equivalent to purchasing an entire city.\n>\n> When crafting accessories, you will acquire options that increase **intelligence** or **shadow resistance**. Additionally, there is a possibility that a passive skill will be attached depending on the accessory maker's capabilities.\n>\n> However, finding someone capable of handling this jewel will be as difficult as plucking a star from the sky.\n\n> **[Belial's Red Jewel <span class=\"mythic-s\">S</span>]**\n>\n> ...\n>\n> When crafting accessories, there is a chance of acquiring options that increase **intelligence** or **flame resistance**. Additionally, there is a possibility that a passive skill will be attached depending on the accessory maker's capabilities.\n>\n> However, finding someone capable of handling this jewel will be as difficult as plucking a star from the sky.\n\n> **[Belial's Horn]**\n>\n> A weapon material containing Belial's magic power.\n>\n> Various options are added when crafting weapons.\n>\n> However, finding a blacksmith who can handle this horn is as difficult as plucking a star from the sky.\n\n> **[Belial's Staff]**\n>\n> **Rating:** <span class=\"myth\">Myth</span>\n>\n> **Durability:** 509/703  \n> **Magic Attack Power:** 2,640\n>\n> * **Intelligence** will rise by 30%.\n> * Magic casting speed will increase by 30%.\n> * You can cast three types of magic simultaneously. However, proficiency is required.\n> * When fire magic and dark magic are cast simultaneously, both spells will have their power increased by 200%.\n> * Every time a spell is cast, a shield that absorbs 5,000 damage is automatically created. Targets that strike the shield are subjected to **Fear** and slowed stats.\n> * Magic critical chance is increased by 20%.\n> * Magic critical damage is increased by 150%.\n> * The passive skill **'Belial's Power'** is generated.\n>\n> A staff used by the 32nd Great Demon Belial.\n>\n> This staff contains the blessing of God Yatan—ordinary humans will struggle to bear its power.\n>\n> **Conditions of Use:** Rank 1 Black Magician. Or a Great Magician.\n>\n> **Weight:** 530\n\n> **[Belial's Power]**\n>\n> **Type:** Passive\n>\n> 200% increase in mana regeneration.\n>\n> In Hell, all magic cooldown times are reduced by 30%.\n\n---\n\n\"...\"\n\nGrid was speechless. He'd never imagined a <span class=\"myth\">myth-rated</span> weapon would drop. Braham's voice whispered in his mind.\n\n*'This is mine.'*\n\nThe tone carried an unmistakable intent—no one else would claim this staff. Unlike with the Red Phoenix Bow, Braham would not budge. Grid understood.\n\n\"Mm... Yeah.\"\n\nThis wasn't something that should be handed off to anyone else. It was different from the Red Phoenix Bow. Grid could acquire new legendary spells every time his **intelligence** increased.\n\n*A 30% increase to intelligence... Alright, I'll become a legendary magician.*\n\nThe legendary blacksmith renewed his commitment to becoming a legendary magician...\n\nAnyone else would find it absurd, but Grid had Braham's soul. It was feasible.\n\nGrid clenched his fists, then noticed Piaro's shattered farming equipment.\n\n*I should use Belial's Horn for Piaro.*\n\nThe best farming equipment for the strongest human... naturally, he should craft a weapon for him. It would be worth it. Piaro's strength directly benefited Overgeared—the Belial raid had proven that.\n\n\"The most urgent thing is recruiting an accessory maker.\"\n\nHe needed a skilled artisan to work with Belial's jewels. Grid shook his head as Jishuka examined the <span class=\"unique-b\">B-grade</span> jewels.\n\n\"No. There's something even more urgent right now.\"\n\nThe reason?\n\n\"Building a country.\"\n\nTalents would naturally gather once a foundation was established. Grid's gaze shifted toward the palace entrance.\n\nKing Aslan appeared."
}