{
  "id": 579,
  "title": "Chapter 579",
  "content": "\"...!\"\n\nKing Aslan staggered from the palace, his eyes refusing to accept what they witnessed. Great Demon Belial had truly been destroyed. The strongest monarch of Hell, possessing the power to annihilate humanity, had fallen to mere hundreds of humans. \n\nDisbelief contorted his features as his gaze found Grid among the victors. Rage, resentment, and madness burned in equal measure within his stare.\n\n\"The power of a legend capable of destroying even great demons...!\" Aslan's voice cracked with emotion. \"Why *you*? Why did you wield this power as a tool of rebellion?\"\n\nHe had only wanted to strengthen his kingdom. This pure and righteous goal—why did it have to be obstructed?\n\n\"You don't understand! I always wanted friendship with you!\" Aslan's hands trembled. \"I did everything in my power to treat you well! Then why? *Why* did you ignore me until the very end!\"\n\nHis sincerity was genuine. King Aslan had needed Grid's power and had exhausted every effort to make peace with him. Yet in the end, all his attempts had been dismissed.\n\n\"Why weren't you loyal to your kingdom!?\" The accusation tore from Aslan's throat.\n\nGrid regarded him in silence before slowly opening his mouth. \"You... How exactly was that the case?\"\n\n\"...!\"\n\n\"No, did you actually think I'd forgive you for using me to cover up murdering Prince Ren?\" Grid's voice remained cold and steady. \"Consider it from my perspective. How absurd is that? I accepted every gift you gave me, but I never once felt grateful.\"\n\n\"That... From my position, it couldn't be helped.\"\n\n\"Right.\" Grid's lips curved into a bitter smile. \"You're a dog who killed his own brother because he wanted to be king, then framed me for the crime. You're just trash. And now you're acting like the ultimate victim.\"\n\n\"You!\" \n\nThe truth cut too deep. A king of a nation who behaved no better than a dog *was* trash. Grid's words exceeded acceptable limits, and King Aslan could no longer contain his fury. Whatever lingering attachment he'd held toward Grid evaporated. The final wedge had been driven into feelings already near breaking.\n\n\"Everything is gone.\" Grid's expression remained impassive. \"You and I were never destined for the same path.\"\n\nThe reason Grid had built Overgeared? Only one explanation existed—to accumulate overwhelming resources. His infinite greed could never have been satisfied by Eternal's small kingdom.\n\n\"If not for the incident with Prince Ren, you would already be kneeling before me.\"\n\nFrom the beginning, swallowing Eternal had been inevitable. The decision had been made after the Reinhardt golem invasion, when Grid refused to pledge allegiance to the royal family.\n\n*Suuk.*\n\nGrid's sword leveled at Aslan. Not a trace of hesitation marred the movement.\n\n\"Let's finish this now.\"\n\nThe instant Grid's words fell—\n\n*Chaeng!*\n\n*Chaeeeeeng!*\n\nEvery Overgeared member simultaneously drew their weapons. The movements synchronized with mechanical precision, each blade aimed squarely at King Aslan. Silence descended for a heartbeat before sounds filtered from beyond the palace walls—the anguished wails of the people.\n\n\"Revive my daughter!\"\n\n\"Revive my sister!\"\n\n\"Kill the king!\"\n\n\"Aslan isn't our king!\"\n\nFamilies and friends of the virgins sacrificed for the great demon's summoning had condemned and cursed Aslan for half a day. Their sorrow and rage showed no signs of diminishing. Their innocent women had been burned alive—victims of an incomprehensible sin.\n\nReinhardt's people had reached a unanimous conclusion. Aslan possessed no qualification to rule. They cried out for the world to know the truth.\n\n\"Kill the king of Eternal!\"\n\nThe people had turned their backs on Aslan. Grid would execute their will.\n\n\"Aslan, I am not like you.\"\n\nIf greed ranked first in his nature, kindness toward the weak came second.\n\n*Step.*\n\nGrid advanced one pace closer to Aslan. Chucksley blocked his path—Eternal's Sword. Grid's expression twisted into something bitter as the knight defended Aslan without hesitation.\n\n\"Aslan is the criminal who murdered the legitimate successor, Prince Ren. He also sacrificed thousands of innocents to summon a great demon.\" Grid's voice remained level. \"Is there any reason to protect him?\"\n\n\"There's no reason.\" Chucksley's grip tightened on his sword hilt. \"This is my destiny.\"\n\nFrom the moment of birth until this instant, Chucksley had lived only to protect Eternal's royal family. He'd been raised for this single purpose. He could conceive of no alternative.\n\n*Even if it's the wrong king...*\n\nHe couldn't turn away.\n\n*Kkuok.*\n\nChucksley's expression hardened as he gripped his sword tighter. Yet his eyes held profound sadness. He blamed the fate against which he could not rebel. \n\nGrid's desire flared as he studied Chucksley.\n\n*I want him.*\n\nA named NPC with absolute loyalty to his master. Eternal's greatest swordsman. Grid recognized Chucksley's value immediately—someone he desired as much as Piaro, Asmophel, Sticks, and Rabbit.\n\nTherefore—\n\n\"I will deal with you myself. I'll change your fate.\"\n\n*Chwarururuk!*\n\nRather than the Holy Light Armor, Grid's body became sheathed in **Triple Layers**.\n\nThen—\n\n*Teong!*\n\nGrid ordered the Overgeared members to stand down and shot forward. Chucksley bellowed as Grid approached, \"This time will be different!\"\n\nNamed NPCs grew at rates slightly exceeding players. Chucksley had become several times stronger than when Prince Ren invaded Eternal, and he blocked Grid's attack with confidence.\n\n*Jjejejeok!*\n\nHe withstood the overwhelming attack power of the **+9 Failure** without difficulty. His sword carved across Grid's chest.\n\n\"Grid!\" \n\nRuby's shocked cry rang out as blood sprayed from the wound. She moved to cast Heal, but Piaro's hand stopped her.\n\n\"This is my lord's battle.\"\n\nTo embrace the dragon, one must become the sky.\n\n\"Humans cannot aid the sky. Simply watch.\"\n\n\"...?\"\n\nRuby couldn't grasp Piaro's meaning, but she possessed keen instincts. She forced her heart to steady even as Grid's health rapidly depleted. Piaro watched her with an approving nod.\n\n***\n\n\"Linked Kill Wave.\"\n\n*Kwa kwa kwa kwang!*\n\nThanks to **Triple Layers**, Grid significantly reduced Chucksley's attack power. He used the momentum of his sword's movement to create distance from Chucksley before unleashing a tempest of blade strikes.\n\nChucksley responded immediately.\n\n\"Sword of Incision!\"\n\nChucksley's origin as a knight defined his swordsmanship—characterized by exceptional defense.\n\n*Paaaat!*\n\nChucksley's blade wove patterns around his body, manifesting multiple layers of aura that defended against the bombardment.\n\n\"Hoh.\"\n\nGrid didn't panic despite his attack being neutralized. Rather, he relished it.\n\n*I desire him even more!*\n\n*Chwaruruk!*\n\nAs Chucksley defended against Linked Kill Wave, silver threads flew from Grid's fingertips as he initiated a new sword dance. Dozens of strands stretched outward—like the Milky Way pouring from the night sky, the beautiful silver filaments wrapped toward Chucksley's body. \n\nOr tried to.\n\n*Gone?*\n\nBefore the silver threads reached their target—\n\n*Pahat!*\n\nChucksley materialized behind Grid. He moved with an assassin's swiftness despite wearing heavy armor. Piaro's eyes widened in admiration.\n\n*A moving mountain.*\n\nA true rarity. Unlike others, Chucksley combined speed with resilience. The result of training to reach the king's side at any moment.\n\n*Jeeeong!*\n\n\"Kuk...!\"\n\nChucksley's shield slammed into Grid's back, canceling the sword dance. This revealed the limitation of his techniques. While the footwork allowed evasion, swordsmanship requiring specific movement patterns created vulnerabilities. If Grid could execute his techniques without the footwork requirement, such openings wouldn't exist.\n\nPagma's Swordsmanship was powerful, yet it displayed the inherent limitations of a non-combat class. However, Grid had already begun overcoming this weakness.\n\n*Chaaeng!*\n\n*Jjejeong! Jjejejeok!*\n\nGrid executed a series of rapid movements, shifting from side to side. He avoided Chucksley's shield while creating an opportunity to swap weapons—a staff instead of a sword. **Belial's Staff**.\n\n\"Magic Missile!\"\n\n*Peeeeeong!*\n\n**Magic Missile** activated once per second, penetrating Chucksley faster than ever before. The strength exceeded previous iterations. Thanks to the **Savior of the World** title, 200 additional **Intelligence** points amplified his magic power, while **Belial's Staff** further enhanced the damage.\n\n\"Cough!\"\n\nDespite his chest being pierced, Chucksley raised his shield instead of collapsing.\n\n*Peng!*\n\n*Pepepepeng!*\n\nThe **Magic Missile** barrage continued relentlessly. Earl Ashur's eyes widened as he observed.\n\n*I would believe he's a magician instead of a blacksmith.*\n\n**Magic Missile** alone reversed the momentum completely.\n\n\"Ugh...! King's Shield!\"\n\nThe continuous magical assault damaged Chucksley, forcing him to activate a defensive skill. A radiant barrier halted Grid's **Magic Missile** bombardment. Grid swapped from the staff to **Sword Ghost**.\n\n*Now!*\n\nA gap appeared during the item exchange. Chucksley attempted to exploit the opening, but his counterattack failed. Grid didn't allow it.\n\n\"Behind you.\"\n\nGrid spoke the cryptic statement toward Chucksley.\n\n*Pepepepeok!*\n\nWhite spheres positioned behind Chucksley's back released, penetrating his body. These were **Magic Missiles** containing **Alarm magic**. Chucksley hadn't realized the projectiles were lying in wait and couldn't react in time.\n\n*Swaeeeeek!*\n\nChucksley staggered to one side as **Sword Ghost** pursued.\n\n\"Huup!\"\n\nChucksley tried defending with his shield. The movement remained incomplete, placing tremendous strain on his knees and waist. Yet wasn't that preferable to allowing a direct hit? Chucksley focused entirely on blocking Grid's strike.\n\n*Supak!*\n\nThe **Sword Ghost** aimed at Chucksley split into two, creating dual trajectories.\n\n*Chaeng!*\n\nOne **Sword Ghost** followed the original path and crashed against the shield.\n\n*Seokeok!*\n\nThe second **Sword Ghost** struck Chucksley's chest.\n\n\"Keok!\"\n\nThe match concluded. Chucksley retained half his health while Grid possessed only a third, yet Chucksley understood the truth.\n\n*This is an opponent I cannot defeat...*\n\nGrid hadn't even deployed the golden hands. He'd overwhelmed Chucksley through pure skill alone. Chucksley couldn't deny his complete defeat.\n\n*But—*\n\nHis commitment to protect King Aslan remained. This was his absolute destiny. From an unstable posture, Chucksley attempted to activate his ultimate technique aimed at Grid. \n\nAt that precise moment—\n\n*Kurururung!*\n\nThe golden hands demolished a palace wall. Through the breach, Chucksley witnessed the weeping people enter.\n\nGrid's voice cut through the chaos. \"The king is respected because he protects the people. Chucksley, why should you protect a king who doesn't care about them?\"\n\n\"...!\"\n\nHis destiny shattered. Chucksley gazed at the crying people and comprehended. What justification existed for protecting this king? \n\nThe sword grew heavy in his grip. He released it. Chucksley fell to his knees and bowed his head.\n\nGrid confirmed the submission and issued orders to the Overgeared members.\n\n\"Capture Aslan. From this moment forward, I will occupy the throne of Eternal.\"\n\n『 ...!!! 』\n\nA new sensation erupted not long after the Belial raid! Media companies worldwide scrambled into action. Grid's brazen claim to the throne became breaking news. Within this heated atmosphere, Grid made his declaration.\n\n\"I will build a new nation with my people, alongside the wounded citizens of Reinhardt.\"\n\nThe first player to become a king! The Overgeared members' hearts thundered with excitement as the world's attention concentrated on Grid. Amid anticipation and anxiety, Grid spoke the name he'd considered carefully.\n\n\"The Overgeared Kingdom! I am Overgeared's king, Grid!\"\n\n\"...?\"\n\n『 ... 』\n\n—Is this real?\n\nA new legend had begun."
}