{
  "id": 58,
  "title": "Chapter 58",
  "content": "# Chapter 58\n\nThe item was only Rare-rated. Grid kept his expression neutral and nodded anyway. No point in nitpicking.\n\nSteng laughed and sheathed his sword, letting out a long breath. \"When will users like us ever get to submit *our own* items to the lady's auction?\"\n\nSomething about this conversation had felt off from the start. Grid needed to clarify.\n\n\"Wait.\" He tilted his head. \"You're not here to auction something *you* made? This is a quest. You're submitting your master's work?\"\n\nSteng's smile widened. \"Of course. Even Panmir, the number one blacksmith, can't create items worthy of this auction. How could I?\"\n\n\"Can you share the quest details?\"\n\n\"Huh? Why?\"\n\n\"I want to check something.\"\n\nSteng shrugged. \"Sure. It's not a secret.\"\n\n> [The player 'Steng' wants to share quest information. Accept?]\n\nGrid accepted.\n\n> **[Teacher's Errand]**  \n> Difficulty: C  \n> \n> The new lady of Winston holds her first auction. Blacksmith Razvan sees an opportunity to showcase his skills and establish a foothold in the city. He has entrusted you, his disciple, with this task.\n> \n> **Quest Clear Conditions:** Submit Razvan's work to the lady's auction.  \n> **Quest Clear Reward:** 20 gold.  \n> *If Razvan's work sells successfully, he will teach you a new production method.*\n\nGrid's eyes narrowed as he read. *Right. I forgot.* Most blacksmith users learned under NPC masters. They completed quests like this to raise their skill levels and earn new recipes. Khan had simply handed Grid production methods without asking for anything in return.\n\n*After seeing this quest, I'm certain.*\n\nNone of these users came to submit their own work. They were all running errands for their teachers, just like Steng. And as Steng said, current production-class players couldn't create items impressive enough to satisfy Winston's lady and knights.\n\nThe gap between Grid and ordinary users was a chasm. He'd barely felt inspired making an <span class=\"rarity-epic\">Epic</span> item, while normal users celebrated <span class=\"rarity-rare\">Rare</span> gear like a miracle.\n\n*Thank god for legendary classes.*\n\n\"If you don't mind,\" Steng leaned forward, eyes bright with curiosity, \"can I see your teacher's item?\"\n\nGrid stepped back. *Trouble waiting to happen.* \"No.\"\n\nSteng's face fell. \"Ah. Can't be helped.\" He paused, then added, \"Still, it's impressive your teacher didn't set a minimum bid.\"\n\n\"Yeah.\" Grid scratched his jaw. \"Do you know the average price for level 120 armor and gauntlets?\"\n\n\"Options vary, but...\" Steng counted on his fingers. \"Normal armor goes for about 300 gold. Gauntlets around 100.\"\n\n\"<span class=\"rarity-epic\">Epic</span> rating?\"\n\n\"Wow!\" Steng's eyes went wide. \"Your master made <span class=\"rarity-epic\">Epic</span> items? That's incredibly rare!\" He thought for a moment. \"Prices depend on the options, but the armor should fetch at least 1,800 gold. Gauntlets, 600 gold minimum.\"\n\n\"What?\"\n\nGrid's mind raced. One hundred gold equaled 120,000 won. If the <span class=\"rarity-epic\">Very Delicate Plate Armor</span> and <span class=\"rarity-epic\">Seemingly Plain Gauntlets</span> sold for 1,800 and 600 gold respectively, that was 2.88 million won.\n\nHe'd only been working in the capsule room for seven days.\n\n*No, wait.* His internal calculator kicked in. *After materials and room fees, net profit is around 2 million won.*\n\nStill. Still. If he made two <span class=\"rarity-epic\">Epic</span> items per week, that was 8 million won a month.\n\n*I can actually pay off the debt.*\n\nTen million won. The number had loomed over him for months like a guillotine blade. He'd barely managed to cover the interest with labor jobs, never touching the principal. But now...\n\n*A debt-free life.*\n\n\"Kukukuku...\"\n\nThe laughter bubbled out before he could stop it. Grid's imagination painted a picture of dignity, of walking down the street without flinching at every shadow. Of never seeing those loan shark faces again.\n\nHis eyes met Steng's.\n\nThe other blacksmith had gone pale.\n\n*Right.* Grid's smile died. *My smile.*\n\nChildren cried when he smiled. Strangers cursed him. People had literally pickpocketed him mid-grin. Someone once bought him cigarettes, mistaking him for a delinquent. Women looked away in discomfort.\n\n*After the debt's paid, plastic surgery goes on the list.*\n\nHe turned to the registration interface, distress churning in his gut as he input the prices Steng had mentioned.\n\n> [Set minimum bid for <span class=\"rarity-epic\">Very Delicate Plate Armor</span> at 1,800 gold. Confirm?]\n\n\"Yes.\"\n\n> [Set minimum bid for <span class=\"rarity-epic\">Seemingly Plain Gauntlets</span> at 600 gold. Confirm?]\n\n\"Yes.\"\n\n> [Items successfully registered for auction.]\n\nThe other users finished their registrations. The auctioneer confirmed the entries and gestured toward a side door. \"The waiting room, gentlemen.\"\n\nThe room beyond made Grid's breath catch.\n\nTiger-skin rug, thick and plush underfoot. Shelves lined with gold and silver ornaments that probably cost more than his entire debt. A crystal chandelier sparkled overhead, each facet catching the light.\n\n*This is for commoners?* Grid's throat went dry. *What does the lady's room look like?*\n\n\"Hey.\" Steng sidled up beside him, voice low. \"Don't touch those ornaments.\"\n\nGrid's eye twitched.\n\n\"I've done a lot of auction errands,\" Steng continued, oblivious to the look Grid was giving him. \"There's always someone who tries to steal from the castle. They get caught. Punished. Just... be careful, okay?\"\n\n\"I understand. I won't.\" Grid's voice came out flat. \"Wait. Do you think I'm a *thief*? That's pretty insulting.\"\n\n\"Sorry!\" Steng jumped back like Grid had pulled a knife. \"Sorry.\"\n\nBut his eyes kept darting over. Watching. Suspicious.\n\nGrid forced another smile.\n\nSteng flinched.\n\n*That bastard has good instincts.*\n\nThe plan to pocket a candlestick died in Grid's mind. He couldn't risk it with surveillance. Instead, he collapsed onto the velvet couch, deciding to nap through the three-hour wait.\n\n***\n\nIrene was Winston's new lady. Earl Steim's only daughter. She held only the title now, but succession was guaranteed. One day, she would be the Earl, a peak figure commanding the north.\n\nHer knights understood the weight of this responsibility.\n\n*We must be worthy of Lady Irene.*\n\nThey trained relentlessly, honing mind and body. But flesh had limits. Talent had ceilings. Equipment could bridge the gap.\n\nToday's auction was a disappointment.\n\n\"There's nothing worthwhile.\"\n\nWinston had grown into a proper city through northern expansion, but it still lagged behind Frontier. The local craftsmen lagged too. The accessories, clothing, and armor on display were uniformly inferior. A few decent pieces appeared, but nothing that met the knights' standards.\n\nTwo hours passed. Not a single bid had been placed.\n\nThe auctioneer's smile cut through the drowsy atmosphere. \"Pay attention to these next items.\"\n\n\"Oh...\"\n\n<span class=\"rarity-epic\">Epic</span>-rated armor and gauntlets appeared on the display stand.\n\nThe knights surged forward.\n\n\"Magnificent!\"\n\n\"You'd be hard-pressed to find quality like this even in Frontier.\"\n\nThey examined the pieces closely, running gauntleted fingers over the craftsmanship. One knight looked up at the auctioneer. \"Who made these? The famous Khan?\"\n\nKhan's reputation had spread to Frontier. The knights assumed only he could produce such work.\n\nThe auctioneer's smile turned enigmatic. \"Not exactly. These were crafted by Khan's successor. He's revered by Winston's residents. One of the three heroes.\"\n\n\"Ah.\" Another knight nodded slowly. \"The righteous blacksmith we've heard about?\"\n\n\"Correct.\"\n\nWarmth spread through the group.\n\n\"Winston houses such talent.\" One knight clasped his hands behind his back. \"Exemplary character and excellent skill. Lady Irene will surely recruit him.\"\n\n\"Then these items have even greater value.\" Another raised his hand. \"I bid 2,000 gold.\"\n\n\"Only 2,000? Your eyes must be failing!\" A third knight cut in. \"2,500 gold!\"\n\n\"2,800!\"\n\n\"I saw them first! 3,000 gold. Everyone else, stand down!\"\n\nEarl Steim ranked among the wealthiest nobles in the Eternal Kingdom. His knights' salaries reflected that wealth. Money was no object. The bids for Grid's creations skyrocketed.\n\n***\n\n\"Grid. Grid.\"\n\n*Ugh.* Grid's consciousness surfaced slowly. *Is it time for the labor office?*\n\nHe'd been working in the capsule room for a week, but his body still woke in a panic, expecting the foreman's shout.\n\n\"Grid, the auction's over.\"\n\n\"Ah...\" His eyes opened. Steng stood over him.\n\n*Right. Not home.*\n\n*Need to shake off these labor job reflexes.* Grid pushed himself up from the couch, joints protesting. He followed Steng back to the lobby where the auctioneer waited.\n\nThe auction manager did a headcount, then cleared his throat. \"Six items sold at this auction.\"\n\nMurmurs rippled through the crowd.\n\n\"Only six? I submitted seven items alone...\"\n\n\"There were over a hundred entries. Six sold?\"\n\nGrid's stomach dropped.\n\n*What if mine didn't sell?* His jaw clenched. *Did I set the minimum too high? Should've gone cheaper.*\n\nThe auctioneer pulled out a ledger. \"The sold items are as follows...\"\n\n---\n\n**Glossary of Common Korean Terms:**  \n**OG:** Glossary Link  \n**Current schedule:** 20 chapters a week\n\nCheck out my Patreon for early access to unedited chapters and goals for bonus releases. Early access chapters update after daily releases conclude."
}