{
  "id": 580,
  "title": "Chapter 580",
  "content": "# The Overgeared Kingdom\n\n**Overgeared.**\n\nThe term originated from combining the English word 'item' with 'system' in Korean. It emerged as slang in early twenty-first century South Korea—a mocking label for users who relied on equipment rather than skill. But now? Being overgeared had become a skill in itself. Thanks to Grid's influence within Satisfy, the perception had completely shifted. No one dared ridicule overgeared players anymore.\n\n\"*Overgeared Kingdom! What a magnificent name!*\"\n\n\"*I love how clear the meaning is. It perfectly symbolizes Grid and the Overgeared members.*\"\n\n\"*The name has such a powerful feel to it. Every citizen and soldier will be armed with exceptional items.*\"\n\n\"*Huhu, a kingdom where the entire populace bears legendary equipment... The strongest nation in Satisfy has emerged.*\"\n\n\"*The neighborhood children play at summoning red phoenixes...*\"\n\n\"*...I should consider emigrating to the Overgeared Kingdom.*\"\n\nThe foreign commentators responded with enthusiasm. To their ears, 'overgeared' was simply another English term—nothing unusual about it. The Korean commentators and viewers, however, reacted with bewilderment.\n\n\"*Wait, the kingdom is actually called Overgeared...?*\"\n\n\"*I appreciate the straightforward meaning, but I'm not sure how I feel about it.*\"\n\n\"*...*\"\n\n*—What's the Overgeared Kingdom? Is this for real?*\n\n*—The name sounds delicious. Makes me want to eat rice.*\n\n*—Doesn't it fit, though? I laughed when I first heard it. Now it just rolls off the tongue.*\n\n*—Even 'Overgeared King' sounds cool ㅋㅋㅋㅋ*\n\n*—Right. ㅋㅋㅋ Overgeared King Grid has a nice ring to it. ㅋㅋㅋ*\n\n*—The international reaction is explosive. The name Overgeared Kingdom carries real weight.*\n\n*—It's powerful because Grid immediately comes to mind whenever you hear 'overgeared.'*\n\n*—But why is Lauel acting like that?*\n\n*—The lord he serves just became a king.*\n\n*—Kuk...The thrills! How wonderful.*\n\n*—A lord and his loyal vassal. Feels like watching a historical drama.*\n\nThe Korean viewers, still debating the merits of 'Overgeared,' turned their attention to Lauel.\n\nOn screen, tears streamed down Lauel's face. Were they tears of joy, as the viewers assumed? Not quite.\n\n---\n\n\"Overgeared Kingdom? Did you just say *overgeared?*\"\n\nLauel's world tilted as Grid's declaration hit him.\n\nGrid nodded at his doubting advisor. \"Yes. It's a name I've painstakingly crafted. Isn't it cool?\"\n\n\"...\"\n\nLauel had been dreading this moment since Grid named the Overgeared Guild. The worry had kept him awake at night—that Grid would name the kingdom Overgeared when the time came. His worst nightmare had materialized into reality.\n\n\"How is that cool? No—Overgeared Kingdom! Absolutely not! It's *terrible!*\"\n\nLauel's voice rose sharply, desperation bleeding through his usual composure. Grid blinked at him, genuinely confused.\n\n\"Why isn't Overgeared cool?\"\n\nGrid had once lived the worst possible life. Items had allowed him to stand upright. Through equipment, he'd grown stronger, rebuilt his self-esteem, and secured his finances.\n\n\"My entire life can be defined by being overgeared. We met because of items. Isn't it perfect? Overgeared Kingdom.\"\n\n*Suuk.*\n\nGrid swept his gaze across the other members, seeking their opinions. One by one, the Overgeared members began to nod in agreement.\n\n\"He's right. It's true.\"\n\n\"Isn't it natural for the kingdom the Overgeared Guild establishes to be called Overgeared?\"\n\n\"I can't think of any other name.\"\n\n\"...\"\n\nA chorus of unexpected support! Was this a dream or reality? Lauel's mind reeled, but he forced himself to calm down.\n\n*Overgeared... Well, it is special.*\n\nGrid had a point. For the Overgeared Guild, the meaning of 'overgeared' held profound significance. They'd trusted each other, encouraged one another, grown as rivals, and now established a kingdom together. It began with items and would end with items.\n\n*Overgeared Guild, Overgeared Kingdom.*\n\nAnd eventually, the Overgeared Empire. Looking at it that way, it wasn't terrible. Overgeared Kingdom. It actually sounded... acceptable. Lauel's face went pale as the realization struck him.\n\n*...Unbelievable. Has my naming sense started to match Grid's?*\n\nThe elegant 'Kingdom of Darkness and Infinite Destiny' he'd been refining for months had been replaced by the crude Overgeared Kingdom?\n\n*This is the worst.*\n\nHe'd been infected by Grid's naming sense through prolonged exposure. He felt his dignity as a human being crumbling away.\n\n\"Ugh...!\"\n\nLauel couldn't deny the appeal of the Overgeared Kingdom anymore. He sank to his knees, tears spilling down his cheeks. Sadness and shame warred within him. However, Grid completely misread the situation.\n\n*This guy... He's so overwhelmed with joy that he's crying. Well, the happiness he's feeling right now must transcend my own.*\n\nLauel had helped Grid establish this kingdom. Lauel had done everything for Grid. Without meeting Lauel, Grid would never have dreamed of building a kingdom. He would have remained merely a powerful user. Lauel was irreplaceable.\n\n\"This is our kingdom. Together, let's lead it well forever.\"\n\n\"...!\"\n\n*Together.* *Forever.* Grid's words pierced straight through to Lauel's heart and soul. Reminded of his deep loyalty, Lauel rose to his feet. His voice trembled with emotion as he swore:\n\n\"My soul and heart belong to you until the day this body is ground to dust. And it will continue in the next life, and the one after that!\"\n\n\"Eh? U-Uh, yes.\"\n\nGrid sometimes found himself at a loss when talking to Lauel. Goosebumps rippled across his skin as Piaro approached.\n\n\"I've brought Aslan.\"\n\n\"Mm.\"\n\nGrid and Lauel's eyes turned in unison. King Aslan glared at Grid from where he'd been bound, madness and resentment burning in his gaze.\n\n\"You're like a rabid dog.\"\n\nA notification window materialized before Grid.\n\n> **[King Aslan has sacrificed innumerable lives for his personal ambition.]**\n>\n> **[Aslan has been morally corrupted. He has committed unforgivable sins. Furthermore, Aslan is hostile toward you. You have succeeded in defeating Aslan. You possess the right to punish Aslan.]**\n>\n> **[Aslan has lost the 'Absolute Protection' passive applied to NPC kings.]**\n>\n> **[Would you like to punish Aslan? Exercise caution. Aslan is king of a kingdom, and severe punishment will likely provoke opposition.]**\n>\n> **[Warning! If you dethrone or execute Aslan, the Eternal Kingdom will cease to exist. The Eternal Kingdom will be dissolved, triggering profound consequences across the continent. You will face a destiny that may prove difficult to handle.]**\n\nWarning after warning appeared before Grid. Yet he didn't hesitate for even a moment. He would punish and destroy Eternal. This decision had been made the instant he declared war. He couldn't falter now that the storm had passed. There was only one ending.\n\n\"Hand Aslan over to the people.\"\n\nThe citizens had suffered sorrow, anger, and despair because of Aslan. Grid intended to deliver Aslan to those still weeping, allowing them to exact their own justice. Aslan's voice cracked as he cried out:\n\n\"You...! The Saharan Empire backs me! You'll never be safe if you harm me!\"\n\n\"...!\"\n\nThe soldiers under Overgeared's banner flinched. Fear rippled through their ranks at the thought of antagonizing the Saharan Empire. However, the Overgeared members—including Grid—didn't so much as raise an eyebrow. Grid approached King Aslan and smiled.\n\n\"I don't know what you think you've figured out, but I will eventually devour the Saharan Empire. Being hostile to them is inevitable.\"\n\n\"*What?*\"\n\nSwallowing the strongest nation that dominated the continent? Most people would dismiss it as absurd nonsense. But King Aslan couldn't bring himself to laugh. The madness drained from his eyes for a brief moment.\n\n\"...I should have possessed such dignity.\"\n\nAslan had borrowed Saharan's power despite his desire to defeat them, then brandished that power as a final threat. He blamed his foolish self and closed his eyes with regret. He resolved to accept his fate humbly, even if his body was torn apart by the people and his soul cast into hell.\n\n*Father... Brother... I'm sorry.*\n\nOn this day, Aslan—the last king of Eternal—died.\n\n> **[You have successfully occupied Reinhardt!]**\n>\n> **[356,931 people in Reinhardt have pledged to serve you!]**\n>\n> **[Aslan has died!]**\n>\n> **[The Eternal Kingdom has lost its anchor and scattered!]**\n>\n> **[The surviving nobles of the Eternal Kingdom despise you!]**\n\nGrid's name was indelibly stamped into the continent's history.\n\n---\n\n\"...My son-in-law was right.\"\n\nMarquis Steim—Grid's father-in-law and lord of the north—had observed the war between Overgeared and King Aslan from beginning to end. He'd planted eyes and ears on every battlefield, watching closely. He needed to know the truth. Had King Aslan truly killed Prince Ren?\n\nHe'd wondered if his son-in-law had lied. As a loyal subject of Eternal and Irene's father, he bore a duty to confirm the facts. Now he knew with certainty that his son-in-law had spoken truth. King Aslan had indeed murdered Prince Ren. An unworthy man had occupied the throne.\n\n\"...\"\n\nMarquis Steim's heart churned with conflicting emotions. Relief that his son-in-law hadn't deceived him mingled with sorrow at the revelations uncovered. Still, such sentiments held no weight at all. He simply needed to make a decision. The Eternal Kingdom had scattered.\n\nShould he aid Grid, who would face threats from all directions?\n\nHe felt no anxiety. His choice was obvious.\n\n\"I will transfer the north to my son-in-law.\"\n\nHe would protect his son-in-law with the forces he and his ancestors had built, then establish Grid as king. Marquis Steim summoned Knight Laden without hesitation to prepare his tribute.\n\n---\n\n\"What? Sixty million gold?\"\n\nThe minimum conditions for establishing a kingdom required three cities, one hundred thousand people, and sixty million gold. *Sixty million gold.* An astronomical sum equivalent to seventy-two billion won. Even with Grid having recently joined the ranks of South Korea's wealthy, he couldn't afford such an amount.\n\n\"This is insane... Isn't this highway robbery?\"\n\nThat damn S.A. Group! Rage burned through him at the developers who disregarded economic principles and forced their users to hemorrhage gold.\n\nToban spoke to the furious Grid. \"It's not an unmanageable amount. If the guild members pool their assets, raising sixty million gold is simple...\"\n\nSatisfy's top rankers had accumulated tremendous wealth—especially the Overgeared members who occupied high rankings. As Toban said, they could easily provide enough funding for the kingdom. But Lauel refused.\n\n\"Grid, I recommend you provide the funding alone.\"\n\n\"...You want me to raise sixty million gold by myself?\"\n\nGrid reeled from the unexpected suggestion. Spending seventy-two billion won alone? Despite accumulating considerable assets through the National Competition, various broadcasts, and advertisements, Grid didn't possess such a massive sum.\n\n\"Hey, where would I acquire that much money? I'm not asking you to provide all of it, but isn't contributing a little acceptable? Hm? Just give me a small amount. I'll repay it with interest from the tax revenue.\"\n\n\"I'm urging you to provide the funding alone precisely to prevent this situation from occurring.\"\n\n\"...?\"\n\n\"You will hold all shares of the kingdom exclusively.\"\n\nThis was for Grid's benefit. It was for the future of Overgeared."
}