{
  "id": 581,
  "title": "Chapter 581",
  "content": "Gobble up the entire stake in a kingdom by himself? Grid's jaw tightened, a muscle jumping beneath his skin.\n\n\"What? You're asking me to be a dictator?\" His voice rose slightly. \"What right do I have when everyone suffered alongside me?\"\n\nThe corner of Lauel's mouth quirked upward.\n\n\"Dictator...\" Lauel leaned back, steepling his fingers. \"It would actually be ideal if you could become one and rule the kingdom well. Look at the Saharan Empire. This world operates differently from reality. Given the nature of these times, there wouldn't be significant opposition to a strong central authority.\"\n\n\"Unfortunately,\" Grid said, shaking his head, \"I don't think I'm capable of ruling a country.\"\n\nHe knew himself too well. Political power? He had none. The moment he tried to govern according to his own whims, the kingdom would crumble—and with it, his 72 billion won investment. The thought alone made his stomach churn.\n\nLauel's laugh was soft, almost indulgent, as he watched Grid's face contort. \"I'm not urging you toward dictatorship. Delegate authority to your subordinates, by all means. But I want *you* to be the immovable center. The foundation that can't be displaced.\"\n\nHe leaned forward, his expression growing serious.\n\n\"If too many guild members share stakes in the kingdom, your influence will dilute. I want to prevent the worst outcome.\"\n\nLauel paused, then added, \"Isn't there a saying in South Korea—too many cooks spoil the broth? I don't want that to happen here.\"\n\n\"Too many cooks...\" Grid repeated slowly.\n\nWas there such a saying in his country? He felt a flash of admiration that the American Lauel knew it, then nodded.\n\n\"I see. I understand.\"\n\nYes, it made complete sense. Providing the funding alone would be ideal. But reality crashed down on him like a hammer blow.\n\n\"How am I supposed to raise 60 million gold?\"\n\nHis current assets exceeded 20 billion won—enough to live comfortably for the rest of his life. But compared to the 72 billion won he needed? The gap yawned like an abyss.\n\nLauel shrugged, his expression unreadable. \"Think about it yourself. It isn't that hard.\"\n\nHe valued Grid more highly than anyone else in the world. But Grid himself remained blind to his own worth. A hundred times better than those who thought they could conquer the world with arrogance—yet Lauel questioned whether Grid would ever recognize the true capacity of his vessel.\n\n*He needs to value himself more.*\n\nGrid stared at Lauel's suddenly silent face, then ventured a thought.\n\n\"Should I get a sponsor?\" The words came faster as the idea took shape. \"What if I secured a large investment from a real-world company active in Satisfy? I could offer advertisement space on every main street in the cities in return. How about it?\"\n\n\"Well...\" Lauel's tone was carefully neutral. \"That's the common approach.\"\n\nIt wasn't a bad plan. The world's first player-founded kingdom would draw massive attention. High player populations, constant foot traffic—from a company's perspective, the investment would be sound. But it wasn't the answer Lauel wanted to hear.\n\nGrid caught the shift in Lauel's expression. \"Is there a better way?\"\n\n\"Of course.\"\n\n\"What is it?\"\n\nLauel's grin widened, taking on a quality eerily similar to Grid's own wicked smile. The resemblance between them grew stronger every day.\n\n\"Labor.\"\n\n\"...?\"\n\n\"Do labor. Stay in the smithy and constantly produce items. You'll be able to raise funds much faster than you think.\"\n\n\"...\"\n\n\"Set your customer base primarily as Overgeared members. You'll make a significant contribution to your allies' strength while simultaneously increasing your skill levels and stats.\"\n\n\"...\"\n\n*No. Damn it.*\n\nHe'd thought—finally, *finally*—he'd escaped poverty and achieved wealth. Now he had to return to hard labor?\n\nGrid's expression twisted, but Lauel didn't flinch.\n\n\"You shouldn't lose sight of your beginnings.\" His voice was firm. \"Do labor.\"\n\n\"...\"\n\n***\n\n\"Labor... I have to do labor...\"\n\nOn the verge of becoming a king, yet forced back into grueling work? The thought sat uncomfortably in his chest.\n\nOf course, Grid knew the truth. His foundation was blacksmithing. Working the forge was right—it was *who he was*. But he couldn't fathom how long it would take to earn at least 50 billion won.\n\n*Easy for Lauel to say.*\n\nIt had taken Grid two years to build his current assets. Some of it came from selling items, true, but most derived from broadcasting revenue. How many years would pass before he could earn 50 billion won purely from crafting?\n\n\"Do you have a moment?\"\n\nThe bustling streets of Reinhardt surrounded them—Overgeared members and soldiers helping the people rebuild. A figure approached Grid through the crowd.\n\nSword Saint Kraugel.\n\nGrid's expression brightened immediately. \"I should have thanked you sooner. You saved my colleagues...\" His voice grew more earnest. \"Piaro especially was in grave danger. Thank you for helping with the raid.\"\n\nKraugel shook his head, white hair shifting. \"No, if I hadn't come in the first place, the Overgeared members could have retreated safely. They missed their opportunity while waiting for me and were endangered because of it. I'm the one who should apologize.\"\n\n\"...That's unusual.\"\n\nKraugel was always the best. The man called the sky above the sky—an absolute existence revered worldwide. Yet he carried no arrogance. He always treated Grid with respect.\n\n*Someday, I want to be like him.*\n\nKraugel, unaware of Grid's thoughts, asked, \"I was convinced when I saw you use the same skill twice in succession against Belial. Did you obtain God's Command?\"\n\n\"...!\"\n\nGrid's eyes widened. God's Command—classified alongside Domain and Ruling Power as one of the three major offensive passives. Kraugel already knew about it?\n\n\"How do you know about God's Command?\"\n\n\"I've also progressed through the 7 malignant episodes. I gained knowledge about the three offensive passives, three defensive passives, and the corrupt passive.\"\n\n\"Huh? 7 malignant episodes? What's that?\"\n\n\"...\"\n\nKraugel's eyes twitched. Silence stretched for a heartbeat before he spoke.\n\n\"Don't tell me you obtained God's Command without going through the seven malignant episodes?\"\n\n\"So?\" Grid blinked. \"What are the 7 malignant episodes?\"\n\n\"...\"\n\nAbsurd. That was the only word for it.\n\nGrid had obtained God's Command through sheer coincidence—improbable events layering upon impossible circumstances.\n\n*...They say a hero is created by the times, not by themselves.*\n\nThis era had chosen Grid as its hero. His true rival.\n\nAdmiration and trepidation warred in Kraugel's chest. He controlled his expression with effort and explained briefly.\n\n\"The 7 malignant episodes tell an old story about seven wicked people chosen by the gods who became corrupted. As you progress through the episodes, you gain clues about the strongest passive skills those seven possessed. I haven't obtained the skill I was targeting because it's too difficult...\" He paused. \"I'm certain that Agnus and Ares have acquired their desired skills by now.\"\n\n\"Agnus... Ares...\"\n\nGrid's eyes sharpened like honed blades. Every time someone mentioned those names, he heard how exceptional they were.\n\n\"Everyone speaks highly of Agnus and Ares. Are they strong enough to make *you* conscious of them?\"\n\nKraugel was Grid's only rival—the thought came unbidden, instinctive. A strange competitiveness flared in his chest toward these two he'd never met.\n\nUnaware of Grid's internal struggle, Kraugel nodded.\n\n\"I believe their potential won't be suppressed even by you. I would advise avoiding association with them if you have any choice.\"\n\n\"Why?\"\n\nWas Kraugel worried he'd lose to them? Grid's frustration must have shown on his face, because Kraugel continued.\n\n\"Agnus is completely warped. If he learns more about you, he's likely to become dangerously obsessed.\"\n\nKraugel's voice took on a somber quality. \"Agnus is an unhappy person. Like you, he lived the worst possible life before encountering Satisfy. You overcame your adverse fate by forging a positive path forward. Agnus, however, remains trapped in the past, exploiting his power.\"\n\nHis gaze grew distant. \"Consider him an evil spirit. He'll never understand you. He'll thoroughly deny you—someone who walks a completely different path.\"\n\n\"...\"\n\n\"Ares, on the other hand, is a person with no shadow. He's a sun—like what you've become now. That quality makes him strong. He's drawn many powerful people to his side. If you become hostile to him...\"\n\nKraugel was convinced even the Overgeared Guild would struggle. But he kept that assessment to himself, unwilling to wound Grid's pride.\n\n\"...Well, this is merely advice. The choice is yours.\"\n\nHe'd already wasted too much time. His mother was waiting for him to eat.\n\nGrid stopped Kraugel as he turned to leave. His eyes, deep as a mountain lake, pinned Kraugel in place.\n\n\"I'll ask bluntly. Are Agnus and Ares stronger than you?\"\n\n\"For now.\"\n\n\"Which means that eventually, you'll become the best again?\"\n\n\"...I'll make it happen.\"\n\n\"Then I understand.\" Grid's voice carried absolute certainty. \"Kraugel, I'll only look at you. Agnus? Ares? Nonsense. I don't care about them. So set aside your worries. If you ever have difficulties, you can contact your older brother anytime.\"\n\n\"Older brother?\"\n\n\"Me.\"\n\n\"You're insane. I'm two years older than you.\"\n\nKraugel's response came automatically, but a small smile tugged at his lips as he turned away.\n\nLike the wind, Kraugel departed without fanfare. Like the sea, Grid remained in place.\n\nBoth of them silently cheered for each other in their hearts.\n\n*Later on, I'll be the best.*\n\n***\n\nJishuka—the striking beauty with provocative eyes—listened to Lauel's plan with interest. Making Grid shoulder the full 60 million gold alone?\n\n\"It's a sound idea.\" She nodded decisively. \"There might be seeds of discord down the line if you divide the stakes among guild members.\"\n\nThe problem, of course, was that Grid didn't have 60 million gold.\n\nJishuka's solution was characteristically direct.\n\n\"Isn't it sufficient if I pay 60 million gold for the Red Phoenix Bow?\" Her smile was radiant. \"Right?\"\n\n\"Cough! Cough!\"\n\nLauel hadn't yet confirmed the details of the Red Phoenix Bow. What item could possibly justify a 60 million gold price tag?\n\nJishuka laughed at Lauel's sputtering reaction."
}