{
  "id": 582,
  "title": "Chapter 582",
  "content": "\"No, what item is worth sixty million gold? Isn't the pricing absurd?\"\n\nEven for a first-rate legendary item, the Red Phoenix Bow being valued at sixty million gold was unrealistic. It defied common sense. Think about it—a kingdom could be established with sixty million gold. An item priced at that sum held the equivalent value of an entire nation. Wasn't that a gross exaggeration?\n\n*The items Grid makes are exceptional, but comparing them to a country's worth? They're more on par with cities.*\n\nLauel respected Grid's craftsmanship. He'd evaluated Grid's creations and concluded the finest among them matched a city's value. Players fully equipped in Grid's gear could theoretically wield nation-level influence. However, Lauel couldn't fathom a single item being worth an entire kingdom.\n\n\"Jishuka, I know you want to pay more than necessary to help Grid, but...\" Lauel had been separated from Jishuka during the war. He couldn't obtain all the information in real time and didn't know the true specifications of the Red Phoenix Bow.\n\n\"Don't exaggerate, no matter how fond you are of him.\"\n\n\"See for yourself.\"\n\nJishuka shared the Red Phoenix Bow's information window with Lauel, who never imagined it would be myth-rated.\n\nLauel's mouth hung open.\n\n\"...????\"\n\nHis eyes began darting around erratically. He resembled a malfunctioning automaton as he processed the Red Phoenix Bow's information.\n\n\"...Heok.\"\n\nQuestion marks practically floated above Lauel's head before he suddenly gasped. The unrealistic statistics of the myth-rated Red Phoenix Bow had stolen his soul.\n\n\"How is it? Isn't sixty million gold reasonable?\" Jishuka asked.\n\n\"Huh? What?\" Lauel snapped back to awareness. \"If you purchase such a monstrous item for *only* sixty million gold, you have no conscience!\"\n\nThe complete reversal made Jishuka laugh. She shrugged at Lauel, who now called her a thief.\n\n\"I don't intend to be one. Sixty million gold is merely the down payment. The remainder will be paid off for the rest of my life.\"\n\nJishuka—a high ranker celebrated worldwide for her beauty, charisma, and exceptional gaming prowess. One of South America's wealthiest young people, she'd fallen into debt before Grid.\n\nThis was the power of items.\n\nLauel's body trembled.\n\n\"The true value of Grid...\"\n\nThe uniqueness of Grid's class couldn't be fully measured, even with Lauel's infinite insight. He'd lost count of how many times Grid had shocked him. Tears welled in Lauel's eyes as he watched the sunset, improvising poetic words.\n\n\"Ahh, Grid is a descended god and I'm a feeble angel in his presence...\"\n\nLauel began laughing.\n\nThe Overgeared members nearby watched him warily.\n\n\"Did he lose his mind after the kingdom was established?\"\n\n\"Seems that way.\"\n\n\"He'll wield the most power after the king, right? Is it acceptable for him to be this unhinged?\"\n\n\"It'll work out somehow. He's done well so far. Why worry now?\"\n\n\"Stop talking and go stop Nyangmong.\"\n\nWild cats and dogs were gathering in Reinhardt's central square, drawn by Nyangmong's whistle. People were frightened—someone had to intervene.\n\nAdditionally, there were other matters.\n\n\"On the way, can you tell Jude to get dressed? There are complaints about his nakedness from the wall repair site.\"\n\n\"There are complaints that Vantner is threatening to make anyone who doesn't surrender bald. Shouldn't we stop him first?\"\n\n\"Eh, what? We're swamped. Where did Regas disappear to?\"\n\n\"He applied for a duel with Piaro.\"\n\n\"What? In this situation? Why didn't you stop him?\"\n\n\"...?\"\n\n\"Okay, okay.\"\n\n\"Touchy subject.\"\n\n*There's no one normal except me,* every member of Overgeared thought simultaneously.\n\n***\n\n\"Yes, let's not lose sight of my foundations.\"\n\nGrid watched Kraugel's retreating figure.\n\n*I'm still weak.*\n\nHe'd grown too excited after the Belial raid. He'd relaxed as though he were already the strongest. But what was the reality? Belial was the 32nd-ranked demon. That meant thirty-one monsters stronger than her existed. Not to mention Vampire Duke Marie Rose and countless enemies across the continent. Grid had more than one or two mountains to cross.\n\nIn this situation, he'd forgotten his duty as a blacksmith? Insane.\n\nGrid had to keep it in mind at all times—the fact that he was a blacksmith. He would labor in the smithy, raise his stats, craft superior items, and become overgeared. There was always work to be done.\n\n*Labor isn't something to avoid. It's my foundation.*\n\nThis wouldn't change even after becoming a king.\n\nTherefore—\n\n\"Let's begin production.\"\n\nGrid suppressed the excitement from winning the war and succeeding in the great demon raid. Was he moving toward a gorgeous and ornate palace? No. He headed toward a smithy.\n\n*As Lauel suggested, I'll stay in the smithy for a while. My role hasn't changed, even if I become a king.*\n\nGrid's heart burned with motivation! As he pulled out a hammer for production, a man and woman approached.\n\n\"Hello.\"\n\nIt was Pope Damian of the Rebecca Church.\n\n\"Hello.\"\n\nThe beauty with platinum hair was Isabel, one of Rebecca's Daughters. Grid felt grateful toward both of them for rushing to help Overgeared.\n\n\"It's been a while. I'm glad...\"\n\nGrid smiled brightly before his expression twisted. Isabel's pallid complexion was the cause.\n\n*The impact of White Transformation...*\n\nIsabel—a woman raised in the church alongside a weapon. Grid felt saddened watching her take up Lifael's Spear to protect the world. Unlike others, she couldn't enjoy her youth. She struggled while exhausting her vitality.\n\n\"Looking around Reinhardt, there's only one Rebecca Temple.\" Damian observed Grid and made a proposal. \"It's large enough and well-positioned. Out of personal ambition, I want to build two more temples here. The more temples we have, the more priests and paladins can be stationed here. How about it? Will you permit it?\"\n\nGrid couldn't refuse.\n\n\"I'm very thankful. But is it acceptable? No matter how large Reinhardt is, I doubt the Vatican will authorize three temples in one city. Strictly speaking, wouldn't that be wasteful of the Rebecca Church's personnel?\"\n\n\"Huhut, no need to worry. Due to succeeding in the great demon raid, my position in the church has solidified. The Vatican also holds a favorable impression of Grid and Overgeared for the demon raid. There won't be significant backlash if I increase Reinhardt's temple count.\"\n\n\"That's welcome news.\"\n\nAs healers in Satisfy, Rebecca's priests held tremendous value. The privilege of training priests simultaneously at three temples was extraordinary. Grid imagined it—a healing vending machine... No, an Overgeared healers division!\n\n*Brilliant.*\n\nIf the vampire city expedition consisted of Overgeared members plus healers, they'd become an immortal corps.\n\n*I have to make the soldiers' armor as resilient as possible!*\n\nGrid asked Damian, \"The Rebecca Church will cover the temple construction costs, correct?\"\n\n\"Huh?\"\n\nDamian looked profoundly embarrassed. He hadn't expected this question!\n\n\"Kings and lords across the continent desire Rebecca temples. Not only do they provide the construction costs themselves, they even send gratitude gifts to the church.\"\n\nIn other words, the Rebecca Church's response wouldn't be favorable if Grid asked them to shoulder the construction costs. Grid was requesting they cover the cost of three temples in one city? It would likely provoke backlash among the senior priests. However, Grid's logic was sound.\n\n\"Doesn't the Rebecca Church own the temples built in cities? I'm providing the land for free. Isn't it proper that the Vatican covers the construction expenses?\"\n\n\"...I'll try to push it through.\"\n\nHis position, elevated by the Belial raid, might plummet again. Damian mourned internally while Grid began closely observing Isabel. Isabel's pale face gradually flushed.\n\n\"Why are you staring at me?\"\n\nIt was shortly after using White Transformation. Isabel knew she currently appeared unhealthy. Therefore, Grid's gaze felt burdensome.\n\nGrid studied her steadily before grasping her wrist.\n\n\"Ah...\"\n\nIsabel's eyes widened and she trembled like a startled rabbit. An unfamiliar pleasure coursed through her body as Grid made his suggestion.\n\n\"Can you entrust Lifael's Spear to me?\"\n\nGrid's blacksmithing ability had improved dramatically while crafting the myth-rated item. Additionally, Grid possessed perfect understanding of Lifael's Spear. During the pope election episode in the past, he'd raised his understanding of Lifael's Spear to 100%.\n\n\"Let me examine Lifael's Spear. I'll make it powerful without burdening the wielder.\"\n\nGrid spoke with confidence. Now that he'd created a myth-rated item and upgraded his blacksmithing skill, Grid was convinced he could reconstruct Lifael's Spear more completely.\n\n\"I hope you and Damian will no longer suffer.\"\n\nThey were already special friends. He wanted to help those who'd already aided him multiple times. He wanted them to remain happy together for years to come. Grid conveyed his sincerity to Damian and Isabel. Isabel felt grateful toward Grid, while the sensitive Damian was already crying.\n\n\"Grid!\"\n\n***\n\n\"What would you like to do?\"\n\nThe Overgeared members and soldiers moved busily throughout Reinhardt, brimming with energy as they worked to restore war damage. Simply watching lifted one's spirits. Chris observed the scene quietly before speaking to his Seven Captains.\n\n\"What do you want to do?\"\n\n\"...\"\n\n\"Tell me honestly.\"\n\nWhen Chris asked again, the oldest of the Seven Captains, Zirkan, stepped forward. He was Chris' swordsmanship instructor and had once ranked first among swordsmen, despite nearing seventy years old. He held strong loyalty to Chris and was the person Chris trusted most in the Giant Guild.\n\n\"Let's join Overgeared.\"\n\n\"Why?\"\n\n\"I believe you know best. Grid has accomplished great things—it's better to ally with him than compete. If you're with him, I believe you can achieve a breakthrough.\"\n\nChris didn't deny it.\n\n\"His vessel is large enough to contain my vessel.\"\n\nChris decided to forsake the now-meaningless noble title of Eternal. The moment King Aslan died, his guild window had displayed a hidden quest: **Anti-Grid Nobles Alliance**.\n\n\"We'll go hunting.\"\n\nChris pledged to present Grid with the heads of Eternal's nobles as a gift for joining Overgeared."
}