{
  "id": 584,
  "title": "Chapter 584",
  "content": "**Chapter: The Price of Victory**\n\n\"What? The king is dead?\"\n\n> [King Aslan's death has become public knowledge. Eternal's navy descends into chaos!]\n> [The morale and combat effectiveness of Eternal's navy have plummeted. Skills and spells are no longer available.]\n> [Eternal's navy has begun a full retreat!]\n\n\"Hah... hah...\" Peak Sword's breath came in ragged gasps.\n\nOn Cork Island, he had been fighting the navy with the help of Soldier—a man he'd met during his mining operations. They'd been on the verge of total collapse after the enemy forces captured half the island. Now, relief flooded through him.\n\n\"Lauel... Grid. You actually did it.\"\n\nThe war had ended far faster than anyone had anticipated. Thanks to that, Cork Island remained in their hands. Against all odds, they'd defended it with Korean strength alone.\n\n\"We won! WE WON!\" The cry erupted from multiple throats.\n\nThe Silver Knights and Cork Island's garrison troops shed tears of joy. Their bodies and minds were shattered from days of relentless combat, but in this moment, they savored their hard-won victory. Peak Sword addressed them with genuine pride.\n\n\"Everyone has fought well. You've all shown the same spirit as Grid himself.\"\n\nIt was time to return to Grid's side.\n\n\"Let's go to Grid,\" Peak Sword announced. \"We'll celebrate our master's ascension to the throne.\"\n\nGrid would elevate South Korea's reputation once more. As president of the Korean Patriotic Society, Peak Sword felt more pride in this than in anything else he'd accomplished.\n\n*I'm honored to serve Grid.*\n\nA smile spread across Peak Sword's weathered face—the kind of comforting expression that warmed anyone who saw it. Unfortunately, the smile didn't last long.\n\nA shadow materialized behind him without warning. The ID above the figure that emerged from the very ground itself read: **Tarma**.\n\nAn assassin from the dark gamer organization known as Blood Carnival. His voice dripped with venom—the accumulated spite of being humiliated by Grid at both the National Competition and during the Siren invasion.\n\n\"The world is filled with powerful forces,\" Tarma hissed. \"Did you actually believe Satisfy belongs to Overgeared alone?\"\n\n\"You—!\" Peak Sword whirled, hand flying to his sheath.\n\n*Thunk!*\n\n\"...!\"\n\nTarma's yellow dagger buried itself in Peak Sword's heart.\n\n> [You have been hit by a lethal blow!]\n\nTarma possessed formidable skill. Even Grid, who had defeated him with relative ease, acknowledged the assassin's capabilities. In an environment where Tarma could execute a proper assassination, he became truly dangerous. For Peak Sword—exhausted from days of warfare—defending against this surprise attack was virtually impossible. His guard had dropped completely while celebrating their victory.\n\n\"Urk...!\"\n\n*Thunk! Thunk thunk thunk!*\n\n> [You have been hit by a lethal blow!]\n> [You have died.]\n> [You have lost 33.1% of your experience points.]\n> [Your level has decreased.]\n> [You will lose the 10 most recently invested stat points.]\n> [The item 'Peak Sword's Sheath' has dropped.]\n\nThe yellow dagger plunged into Peak Sword's body repeatedly as he dissolved into gray particles. It happened in seconds.\n\n\"Peak Sword!\" \n\nThe Overgeared members finally registered what was happening and erupted into chaos. A triumphant smile twisted Tarma's features.\n\n\"Devastate Cork Island!\" he roared. \"Trample everything! Erase every trace of Overgeared's presence!\"\n\nHe would destroy everything they'd built.\n\n*Swoosh!*\n\nThe moment Tarma's shout echoed across the island, assassins who had infiltrated during the naval battle burst into motion. They sprinted toward the city at the island's center. The Overgeared members tried to intercept them, but Tarma cut through their ranks like a blade through silk. The Silver Knights among Overgeared's forces lacked the skill to contend with high rankers—Tarma outmaneuvered them completely.\n\n\"Overgeared!\" Tarma's voice rang with savage glee. \"I'll haunt you for the rest of your existence!\"\n\nSatisfy boasted at least two billion users. The tangled web of conflicting interests and motivations meant nothing came easily. There was always something to lose. This harsh truth bore down on Grid and Overgeared with crushing weight.\n\n***\n\n\"Kuk! Kukukuk! Kuhahahahaha!\"\n\nAt the fortified city of Borneo, Katz doubled over with laughter atop the walls. The Gauss Kingdom's forces had lost sight of their objective, blinded by greed. Each time Seuron screamed in agony, Katz's joy intensified.\n\n\"...Truly remarkable.\"\n\nThe power of money never ceased to amaze. It never betrayed him. It consistently delivered fresh entertainment. Such was the world.\n\n\"Money is supreme.\"\n\nOnly someone wealthy could utter such words with genuine conviction. Below the walls, the Gauss troops shouted their demands.\n\n\"Seuron is dead!\"\n\n\"Now pay the promised reward!\"\n\n\"I landed ten strikes on Seuron!\"\n\n\"I put a hole clean through him!\"\n\nMoney! Money! Money!\n\nThe users on the ground reached toward Katz with grasping hands. Worried he might renege, they clamored for immediate payment. Katz gazed down at these puppets of greed with warmth.\n\n\"Very well. I'll provide the reward I promised.\"\n\n\"Yes!\"\n\nHe would uphold his honor as the son of Japan's wealthiest conglomerate. The Gauss players' eyes gleamed with anticipation. Katz provided them with an email address.\n\n\"This is my secretary's contact information. Send video footage of your attacks on Seuron along with your account details. The promised sum will be transferred immediately upon verification.\"\n\n\"...?\"\n\nHundreds upon thousands of Gauss users froze instantly. Confusion rippled through their ranks at the mention of video evidence. Katz gave them a puzzled look.\n\n\"Why this reaction? Is there something unreasonable about my requirements?\"\n\nNo, nothing was unreasonable. Katz had every right to verify who had struck Seuron and how many times. Video recordings provided definitive proof. He was obligated to review their footage before distributing the promised compensation. Most of the Gauss players had completely overlooked this detail.\n\nSomeone shouted from the crowd, \"There's a limit to capsule memory! Anyone who'd record video during a battle is insane!\"\n\n\"Exactly! How could we record footage on a battlefield with thousands of fighters and skill effects erupting everywhere? The file size would exceed the capsule's storage capacity!\"\n\n\"Pardon?\"\n\nKatz's expression darkened into a frown.\n\n\"What's your point? Do you expect me to personally track and memorize each person who struck Seuron and count every individual blow?\"\n\n\"W-Well...!\"\n\nRealization crashed over the Gauss users simultaneously. Receiving compensation had been impossible from the very start.\n\n\"Y-You wicked Japanese bastard!\"\n\n\"Damn it! This was your plan all along!\"\n\n\"You just used us!\"\n\nThe Gauss forces erupted in unified outrage. The Overgeared soldiers tensed, sensing the war might reignite at any moment. But Katz didn't flinch. He merely looked surprised.\n\n\"I fail to understand why you're directing blame toward me. If you'd used a Comet Group diamond-class capsule from the beginning, video recording capacity wouldn't be an issue.\"\n\n\"...?\"\n\n\"You can't record video because you purchased inferior capsules. Isn't your inability to submit evidence for the reward your own fault? Why blame others when you should lament your own inadequacy?\"\n\n\"...\"\n\nHe was right. Katz had no intention of deceiving the Gauss users. He'd genuinely planned to pay the promised rewards. His pride ran too deep to cheat ordinary people of such sums. Katz simply couldn't comprehend the circumstances of common folk.\n\n\"No matter how I consider it, I don't understand. Why aren't you using diamond capsules? Didn't Grid demonstrate their superiority during the National Competition? It's clearly the better option.\"\n\n\"...\"\n\nHow could ordinary people afford a capsule worth 1.32 million won?\n\n\"Damn rich people...\"\n\n\"Utterly detached from reality.\"\n\nThe Gauss users had lost all desire to argue with Katz. Their commander's voice rang out across the battlefield.\n\n\"Retreat! Full withdrawal!\"\n\nNews of King Aslan's death had reached the Gauss Kingdom. With Reinhardt now occupied, Overgeared reinforcements could arrive at any moment. The Gauss army had no choice but to withdraw. Katz shrugged as he watched them depart.\n\n\"Mission accomplished, in any case.\"\n\nBorneo had been defended with merely 2,000 troops—a result even Lauel hadn't anticipated, achieved through the power of wealth.\n\nMoney truly was supreme. Katz reaffirmed this truth. Which made Grid's items—things that couldn't be purchased with any amount of money—all the more extraordinary.\n\n***\n\nAcross Reidan's vast fields, farmers worked beneath the desert sun.\n\nToday, as every day, they maintained the precise techniques Piaro had drilled into them, tending their crops with military discipline. Their backgrounds varied widely: original Reidan citizens, the small group Piaro had brought from the Altes Mountains (who had actually been Prince Ren's people), and players who'd visited Reidan only to be conscripted by Piaro. Unlike ordinary farmers, they possessed hardened physiques and sharp, vigilant eyes.\n\n\"What's that?\"\n\nThe farmers wielding their tools focused their attention on a single point simultaneously. Beyond the verdant orchard, a sandstorm approached from the desert. An artificial disturbance—it looked like hundreds of mounted warriors advancing. The farmers' expressions sharpened instantly.\n\n\"Stay alert.\"\n\nMost of them were combat veterans. They had fields and a city to protect. As the unidentified figures drew closer, the farmers raised their guard. The sandstorm intensified.\n\n\"I can't believe there's a city in the middle of the desert.\"\n\n\"How can such extensive farmland exist out here?\"\n\nThe sandstorm wasn't generated by hundreds of horses. Astonishingly, it was caused by two women. One had white hair and a voluptuous figure; the other possessed black hair and emanated a somber aura.\n\nThe Black and White Sisters.\n\nThe farmers observed them with tools in hand, but the sisters paid them no attention whatsoever. They dismissed the farmers as ordinary villagers. They would have been more cautious if they'd known Reidan housed the infamous farmer who'd appeared at Siren, but their intelligence indicated he was in Reinhardt. Black and White brimmed with confidence.\n\n\"Let's proceed,\" White said.\n\nWhite ignored the farmers and strode forward, Black following in her wake.\n\n*Step. Step.*\n\nThe two women crossed the fields, carefully studying Reidan's walls.\n\n*Few guards posted.*\n\n*Suspiciously quiet.*\n\nThe timing for a surprise attack couldn't be better. Overgeared's stronghold stood virtually empty. They would obliterate everything Overgeared had built and eliminate Grid's cherished wife. White and Black refined their perfect revenge plan as they advanced.\n\n\"...?\"\n\nThey hesitated.\n\nBlack and White, who'd been moving with confident smiles, stopped abruptly. Their eyes swept the surroundings with sudden wariness. Something about the atmosphere felt wrong.\n\n*Rustle.*\n\n*Rustle rustle rustle.*\n\nThe farmers scattered throughout the fields began to move. Every farmer gripping dirt-covered tools approached with quiet speed. As the distance closed, they shed their outer garments, revealing armor or robes beneath. They stowed their farming implements and armed themselves with spears or bladed weapons.\n\nWhite and Black's confidence evaporated.\n\n\"A trap...!\"\n\nTheir surprise attack had been predicted and prepared for? Grid's foresight bordered on supernatural!\n\n\"This isn't normal...!\"\n\nWhite acknowledged Grid's cunning even as she dropped into a combat stance.\n\nMeanwhile, within Reidan itself...\n\n\"Young lord, it's time to visit the field,\" one of Rebecca's Daughters candidates announced.\n\nThrough rigorous training, the 200 young women had developed into elite warriors, building on their natural talents.\n\n\"Ohhh.\" Lord's cheeks puffed out like a balloon.\n\nPlaying assassination games with Kasim was entertaining. Recreating sword techniques learned from Uncle Kraugel proved interesting. Training the divine power awakened through Damian's guidance had value. Studying with Sticks expanded his mind. However, fieldwork held absolutely no appeal.\n\nWhenever he practiced the farming stances Piaro taught, every muscle in his body ached.\n\n\"I want to go to the smithy instead.\"\n\nOf all his subjects, blacksmithing proficiency brought him the greatest joy. Lord was Grid's son through and through—he possessed a natural aptitude for the forge. Despite his grumbling, the girls remained adamant.\n\n\"No. Each study topic has its designated time.\"\n\n\"That's correct. You'll achieve far better results by following the schedule Sticks designed.\"\n\n\"Tch.\"\n\nLord's cheeks inflated further. He looked thoroughly sulky. Normally at times like this, he'd be embraced or allowed to rest his head in someone's lap. Lord appeared so adorable the girls had to resist the urge to scoop him into their arms.\n\n\"Stop complaining.\" A voice emerged from the shadows. \"You'll soon be a prince. From now on, you must maintain your dignity. Go to the fields.\"\n\nIt was Kasim, King of Shadows.\n\nIn the end...\n\n\"Waaahhh!\"\n\nLord wailed as the girls caught him and carried him toward the fields—a young child enduring the rigors of advanced education. Before anyone fully realized it, this four-year-old genius of the Western Continent would reveal himself to the world.\n\nIt was the herald of a new era."
}