{
  "id": 585,
  "title": "Chapter 585",
  "content": "*Grid...!*\n\nWhite's mind raced. They'd anticipated the attack—set a trap—in the *rice fields* of all places!\n\n*Impossible!*\n\nOutside of harvest season, fields made terrible ambush points. The sparse, undeveloped crops left everything exposed, offering no cover for hidden forces. That's why the sisters had been caught completely off guard. Who would fortify a barren field?\n\n*Soldiers and guild members disguised as farmers!*\n\nThe implications struck her. These troops had sacrificed countless hours following Grid's orders, waiting motionless in the fields under the guise of laborers. Such devotion spoke volumes about Overgeared's loyalty to their king.\n\n*He played us perfectly.*\n\nWhite's estimation of Grid crystallized. Before being a blacksmith, before being overgeared, before even being a high ranker—Grid was an absolute ruler. A strategic genius. What she'd dismissed as coincidence now became clear: their collision with Overgeared in Siren had been no accident.\n\n*We've been dancing in his palm since the beginning!*\n\nGrid had been plotting against Blood Carnival from the start, manipulating events to keep them contained. The realization was as infuriating as it was impressive.\n\nMen. Simple-minded creatures obsessed with appearances. That she would acknowledge such a disgusting specimen bruised her pride. She glanced at Black, her little sister.\n\n\"Don't flinch,\" White commanded. \"No one here is our match. We'll shatter Reidan exactly as planned.\"\n\nNo bluff—just cold confidence. Fighting together, the sisters had never tasted defeat.\n\n\"Yes, Sister. Let's end this,\" Black replied.\n\nThey couldn't let Grid humiliate them again. The theft of the <span class=\"myth\">Ring of Absurdity</span> still burned. Black's grudge against Grid had grown into an all-consuming obsession.\n\n*Grid, I'll destroy everything precious to you.*\n\nBlack swallowed the venom in her heart. The power of an Illusionist—the ability to make illusions real.\n\n*Susuk.*\n\n*Sususuk.*\n\nThe fields where Reidan's farmers toiled peacefully...\n\n*Hwaruruk!*\n\nErupted into a sea of flame. The Illusionist's reality-warping power, mistaken by many for a legendary class ability, transformed imagination into devastating truth.\n\n\"Kuaaaaak!\"\n\nFarmers screamed as fire materialized around them without warning.\n\n\"Ugh! W-What is this?!\"\n\nTheir peaceful workplace became an inferno. Confusion turned to panic as Black conjured her next creation—a clone of herself. A sensual beauty flickered into existence, which Black immediately equipped with magic items before retreating to the rear. A fire magician specialized in mass destruction had joined the battle.\n\n\"Fire Spear!\"\n\n*Kwa kwa kwa kwang!*\n\nMagical power that even Euphemina would struggle to handle swept across Reidan's farmers. Though Black could use fewer spells without the Ring of Absurdity, against such weak opponents, she felt no regret whatsoever.\n\nThe storm of flames reduced dozens of farmers to ash.\n\n\"Perfect, Sister!\"\n\nWhite grinned at Black's handiwork. The fat she'd burned running to Reidan had begun recovering. She tore into a large piece of meat to accelerate the process, swelling back to her larger form. Then she launched herself at the farmers.\n\n*Kwaaaang!*\n\n\"Keok!\"\n\nThe farmers White mistook for disguised Overgeared members were actually users—players captured by Piaro and forced into agricultural servitude. They reeled from the impact. These were powerful individuals who'd survived the desert trek to reach Reidan, at least level 200. Yet before these unidentified women, they were nothing.\n\n*What are they?!*\n\n*How can they be this strong?!*\n\nA shield intercepted White's fist. The defender flew eighty meters backward. White pursued the tanker whose shield had warped from a single blow, using her bloated belly as a weapon.\n\n*Peeeeeong!*\n\n\"Hup...!\"\n\nCrushed beneath White's mass, the farmer tumbled across the ground before being swallowed by flames. Silence fell as the user dissolved into gray light. The Black and White sisters—the absolute power of unofficial rankers—overwhelmed Reidan's farmers and filled them with despair.\n\n\"Shit... Why do we have to suffer like this?\"\n\nThe users began to complain. They had no real connection to Overgeared—why should they sacrifice themselves for Reidan? As their grumbling spread, other users cut them off sharply.\n\n\"Don't forget what you received from Piaro's hidden quests. Show some gratitude.\"\n\n\"Doesn't your pride hurt, watching these fields burn?\"\n\n\"Think of the Reidan residents who bring us snacks every day. We can't let these monsters slaughter them.\"\n\n\"...You're right.\"\n\nA sense of solidarity replaced the complaints. Who were they, really? People caught by a mad farmer and enslaved? That was merely the surface. They had been reborn as farmers. The techniques Piaro taught weren't ordinary agriculture—their physical abilities and weapon skills had increased dramatically. Now was the time to prove their worth.\n\n\"Fight together!\"\n\n\"Remember Piaro's teachings! Channel the motion of wielding the hand plow!\"\n\n\"Waaahhhhhhhh!\"\n\n\"...!\"\n\nWhite's eyes widened in disbelief. Their morale hadn't decreased at all.\n\n*Ridiculous!*\n\nTheir courage doubled instead of breaking?\n\n*Kwaduduk!*\n\n\"How amusing!\"\n\nWhite would rather die than be dismissed. Especially by men. Fury ignited within her as she burned through the accumulated fat.\n\n*Chiik.*\n\n*Chiiiik!*\n\nHeat haze rose from White's body as she transformed—thinner, more beautiful. Simultaneously—\n\n*Peeng!*\n\nWhite's fist, now infused with the energy from burned fat, struck the farmers. Though several times smaller than before, the power and speed had multiplied.\n\n*Kwajajajak!*\n\n\"Kuock!\"\n\n\"Ack!\"\n\nFarmers collapsed one after another under White's assault. Sharp, destructive blows pierced straight through armor. The players froze at White's true capabilities. She smiled with satisfaction.\n\n\"Yes. My strength deserves reverence, not mockery.\"\n\nShe might have lost to that farmer called Piaro, but she remained the strongest user. Kraugel? Laughable. Her skills exceeded his several times over. Fundamentally, women were superior to men!\n\nThen a child's voice reached her ears.\n\n\"Who is that sister?\"\n\n\"Huh?\"\n\nA childlike voice—in the middle of battle? Confusion made White turn toward the sound. What she saw made her freeze.\n\n*Cute!*\n\n*Too cute!*\n\nA young boy with black hair, deep blue eyes, and pale skin approached the fields. Despite being male, the child was adorable. Soft cheeks and jewel-bright eyes.\n\n\"What? Why is a child here?\"\n\nWhite and Black, who'd been neglected and scorned by men because of their appearance, harbored deep hatred for the male gender. But children—they couldn't hate children. Worried the boy might be hurt, they stopped attacking the farmers.\n\n\"Young Nobleman Lord~~~!\"\n\n\"Why did you run off alone?!\"\n\n\"...\"\n\nTwo hundred beautiful girls surrounded him. They rushed to the child named Lord, clinging to him like devoted admirers. White and Black's faces twisted grotesquely.\n\n\"Already flirting at his age!\"\n\n\"Men shouldn't behave this way! All men are wolves! Wolves!\"\n\nThey didn't want to watch. They could already see what kind of man he'd become. Still, hurting a child seemed wrong, even if he was just an NPC...\n\n*Eh?*\n\n*Wait?*\n\nWhite and Black shuddered as realization struck. The title attached to Lord's name.\n\n*Young nobleman?*\n\nThat boy—\n\n\"Don't tell me... Are you Grid's child?\"\n\nSatisfy allowed marriage and childbirth between players and NPCs. Lord nodded, displaying intelligence far beyond his years.\n\n\"Yes. The most wonderful Duke Grid is my father.\"\n\n\"...!\"\n\nWhite and Black lit up with malicious joy. They'd found Grid's hidden treasure.\n\n*Kill him!*\n\n*Perfect! I'll make tears stream down Grid's face!*\n\nThe sisters exchanged gleeful smiles.\n\n\"Then I will punish you, Sisters.\"\n\nLord's expression turned cold, incongruous with his age, as he drew something forth. Daggers—as sharp as real blades. Not something any child should wield.\n\n*Why does a child carry such dangerous weapons?*\n\nTheir question found its answer immediately.\n\n\"Why would you hurt my father's people? You've done something bad. You must be punished.\"\n\n*Papat!*\n\nLord's daggers flew toward White and Black's ankles. The manifestation of **Lantier's Methods** that Lord had mastered. Though only level 40 due to age restrictions, the power of a legendary skill couldn't be dismissed.\n\n\"Dodge!\"\n\nSensing the threat, Black and White moved—or tried to. Shadows erupted from the ground like living creatures, seizing their ankles. **Shadow Methods**, passed directly from Kasim, King of Shadows.\n\n\"This monster!\"\n\nWhite and Black no longer saw a cute little boy. Before them stood a monster in child's form.\n\n*Pahat!*\n\nThey barely shook off the shadows and prepared to counterattack when light exploded across their vision. **Holy Light**—divine magic that applied specifically to evil beings. It dealt no damage to White and Black, but that wasn't Lord's intention. The brilliant flash temporarily blinded them.\n\n\"Ugh!\"\n\nReflexively closing their eyes against the intense radiance, White and Black left themselves open. Lord rushed forward, executing the secret technique Kraugel had wielded as a White Swordsman.\n\n\"**Storm Sword.**\"\n\n*Kwa kwa kwa kwang!*\n\n\"...!\"\n\nThe eyes of every farmer watching the battle—as well as Black and White themselves—twitched in shock."
}