{
  "id": 586,
  "title": "Chapter 586",
  "content": "*What in the world is that child?*\n\nLord was barely five years old. His vocabulary exceeded his years—a clever boy, White had first thought. \n\nThe reality was far more disturbing.\n\nThis wasn't intelligence. This was something monstrous wearing the skin of a toddler. The child wielded shadow techniques, divine magic, and swordsmanship with terrifying precision. Not just any swordsmanship either—the spectacular skill effects screamed unique-rated at minimum.\n\n*This little monster...!*\n\nToddle.\n\nDadadadada!\n\nLord closed the distance on stubby legs, his small blade erupting with a tempest of energy that lanced toward White and Black. The style, the execution—it bore the unmistakable hallmarks of Kraugel's technique.\n\nWhite made her choice instantly. Dodging everything was impossible. Where mages relied on shields to compensate for fragile bodies, she did the opposite—she built defense through raw offense.\n\n*How strong can a toddler actually be?*\n\nThe weapon itself was nothing—a baby sword, practically a toy. Flashy effects or not, White was certain the damage would be negligible. Head-on, she'd crush him.\n\nThe result proved otherwise.\n\nKwa kwa kwa kwa kwa kwa kwa!\n\n>**[The sharp Storm Sword has decreased your defense!]**  \n>**[The level of the target who attacked you is unreasonably low. Most of the damage has been neutralized.]**  \n>**[You have suffered 2,880 damage.]**\n\n*What?*\n\nWhite's build allowed her to redistribute body fat into combat stats. Her base **Defense** was already exceptional. As a top-ranked player, she possessed multiple unique titles and even a unique rune. She took immense pride in her survivability.\n\nA five-year-old boy had just torn away nearly 3,000 health.\n\nAgainst her total pool of over 60,000, it wasn't crippling. But the notification told the real story—at least a 200-level gap separated them. With that disparity factored in, the child should have dealt damage in the low hundreds at most.\n\nWhite's mind raced to the only logical conclusion.\n\n*This monster of a child... his stats and skill levels must be absurdly high relative to his actual level.*\n\nThen came something even more shocking.\n\n*He dodged my counterattack?*\n\nWhite doubted her own eyes. Lord pressed his assault without pause, his footwork flawless. It resembled **White Light Steps**—the very technique that had defined Kraugel during his White Swordsman era.\n\nHer fist had caught nothing but air.\n\n\"Kid! What *are* you!?\"\n\nThe iron sword looked trivial in those tiny hands, yet its power was undeniable. Grid's work, certainly—the boy called Lord was clearly Overgeared. That much she could accept.\n\nBut the shadow techniques that only a master could wield? The divine magic? And the swordsmanship and footwork bearing Kraugel's unmistakable signature?\n\n\"How can he execute such advanced techniques without even reaching his first class advancement?\" Black's usual silence shattered into an angry shout.\n\nAn theory crystallized in her mind.\n\n*Is this child a secret weapon Grid's deliberately cultivating?*\n\nTheir intelligence confirmed Damian and Kraugel had participated in the great demon raid. If those three had formed an alliance—Grid, Damian, Kraugel—working together to forge a human weapon...\n\n*The unlimited potential of named NPCs... Theoretically possible to instill the highest-tier skills if training begins in infancy.*\n\nThe ultimate human weapon.\n\n*Grid, you terrifying bastard!*\n\nGame or not, raising your own flesh and blood as a weapon was unconscionable. The man probably wouldn't shed a single tear over it. Just like a man—compared to women with their beautiful maternal instincts, males were nothing but trash.\n\n\"Yes... you truly are a pitiful child. Raised as a weapon by garbage parents before you could even grow up.\"\n\nWhite's expression softened with compassion as she regarded Lord. The emotion was alien to the boy, who'd only ever known admiration and affection.\n\n\"Trash?\" Lord's voice carried genuine confusion.\n\n\"...\"\n\nA child so young he didn't even comprehend the insult. Grid and Kraugel deserved credit for developing such a skilled combatant, yes—but the method was revolting. White's contempt for them both crystallized as she turned her fist toward Lord.\n\n\"You're destined for an unhappy life. Better I end it now.\"\n\nKuduk!\n\nKudududuk!\n\nThick veins bulged across White's fist, her slender arms suddenly swelling with muscle mass. Fat converted to pure strength.\n\n\"**Peerless Mountain Seizing Strength**!\"\n\nPeeng!\n\nPower sufficient to seize mountains and blanket the earth—White unleashed her true capabilities.\n\nKwa kwa kwa kwa kwa kwa kwa!\n\nThe skill was devastating. Each punch grew stronger, White's stats climbing with every blow. Behind her, Black scattered illusory flames across the battlefield, bisecting the field.\n\nKurururung!\n\n\"Oh!\"\n\nThe shockwave sent Lord stumbling backward. His stamina and mana reserves had hit their limits after his earlier skill usage. The underdeveloped body of a child simply couldn't sustain prolonged combat.\n\n\"We'll be your opponents from here!\"\n\n\"Lord, rest!\"\n\nThe 200 girls who'd been watching Lord's struggle finally moved as one. They equipped swords, spears, and shields, forming a protective wall before the exhausted child.\n\nWhite scoffed.\n\n\"A gang of children?\"\n\nThey'd fall in a single strike. She was certain of it.\n\n\"Join forces!\"\n\n\"Yes!\"\n\nKaaang!\n\nTheir daily training showed immediately. The 200 girls blocked White's assault with practiced coordination—50 shield-bearers intercepted and contained her punch while sword and spear wielders exploited the opening.\n\n*They blocked my punch?*\n\nHow could teenage girls demonstrate such cohesion? White's confidence wavered, though facing them felt manageable compared to battling that five-year-old aberration. She refused to show weakness, moving swiftly to evade attacks and retaliate.\n\nKwajak!\n\nJjejeong! Jjeejeeeong!\n\n\"Kyaaak!\"\n\nThese were Rebecca's Daughters candidates—hardened by brutal training at the Church's secret temple, then further refined under Piaro's instruction. As semi-named NPCs, their growth rates were exceptional, most already exceeding level 200.\n\nBut White was among the game's elite. The numerical advantage couldn't bridge that gap.\n\nNot yet.\n\n\"Sisters...!\"\n\nLord cried out as he watched them fall, bloodied and beaten. His mother had taught him to cherish women. His father had taught him to protect everything precious.\n\n\"Don't hurt my sisters!\"\n\nThe boy forced himself upright, voice cracking with emotion. For the first time in his young life, killing intent bloomed in his heart.\n\nThen—\n\n\"An assassin revealing killing intent? Didn't I tell you repeatedly to maintain composure, especially in desperate situations?\"\n\nA voice resonated from Lord's shadow itself.\n\nKasim.\n\n\"Master!\"\n\nLord's murderous impulse evaporated instantly at the sound. He clamped his mouth shut, enduring as Kasim had trained him.\n\n\"What choice should you make when you're about to lose those precious to you?\"\n\n\"I should ask for Master's help!\" Lord answered without hesitation.\n\n\"Correct.\"\n\nFoolish stubbornness served no purpose. This was the reasonable choice—particularly for someone in a position of authority. The power Lord could wield extended far beyond his individual strength.\n\nKasim's approval came with a satisfied edge. Sharp eyes gleamed beneath black robes.\n\n***\n\n\"Kyaaack!\"\n\nPepeng!\n\nPepepepeng!\n\nWhite's assault drove the girls back while Black's magical bombardment hammered them from range. White prepared to deploy a large-scale finishing technique—one that required consuming a significant portion of visceral fat.\n\n\"Can't let you live to support Grid's future.\"\n\nWhite smiled as she leapt skyward, her body inflating. She'd done this before—slaughter came easily to her now. One fist would crush every girl in range.\n\nThe plan died before it could be executed.\n\n\"What?\"\n\nWhite's bloated form paled mid-descent. Hundreds of black darts materialized from shadows carpeting the ground, all surging toward her position.\n\n\"Ugh...!\"\n\nThese bore no resemblance to Lord's shadow techniques. Panicking, White rapidly deflated her body and twisted aside. The sheer volume made total evasion impossible, but Black's shield magic absorbed the worst of it.\n\n\"Who the hell...?\"\n\nBlack's urgent warning cut through White's attempt to locate the caster.\n\n\"Sister! Above you!\"\n\n\"...!!!\"\n\nWhite snapped her gaze upward. The shadow darts she'd dodged were transforming mid-flight—reshaping into spears, trajectory resetting to pursue her.\n\n*This is insane!*\n\nCreating hundreds of shadow darts simultaneously was already beyond normal capability. Reforming them mid-attack? Altering their flight paths?\n\n*This is impossible!*\n\nThe shadow manipulation she was witnessing defied everything she understood about the technique. It bordered on absurd.\n\n*A bugged user?*\n\nWhite dropped hard, desperately trying to use the fallen Rebecca's Daughters as cover. Futile. The shadow spears tracked like guided missiles, weaving through and around bodies to maintain their lock on her.\n\n\"Sister!\"\n\nBlack needed a solution immediately. She reconstructed her clone to intercept the shadow spears targeting White. The devastated battlefield had been reduced to flat plains—nowhere for a shadow user to hide.\n\nThen they saw him.\n\nA tall figure in deep robes.\n\n\"You!\"\n\nWhite and Black attacked without hesitation, ignoring the shadow spear barrage. Their strikes never connected—summoned shadow soldiers formed an impenetrable wall around the robed man.\n\n\"How dirty...!\"\n\nThe shadow control was too fast, too precise. White knew of only one person in the world capable of this.\n\n\"Eh?\"\n\nWhite froze like a statue as realization struck.\n\n\"D-Don't tell me...\"\n\nAn assassin who commanded every shadow in existence. A power so absolute it had earned him a title.\n\nKing.\n\nIn that instant—\n\n\"King of Shadows!\"\n\n\"Kasim!!\"\n\nWhy? Why was the legendary King of Shadows in Reidan? White's eyes shook wildly with incomprehension.\n\nSuuk.\n\nKasim materialized behind Black, shadows folding space itself.\n\nPuok!\n\nHis blade punched through Black's heart.\n\n\"Cough!\"\n\nBlack's expression twisted in agony as blood and tears streamed down her face.\n\nWhite didn't flinch.\n\nBlack's true body had already infiltrated Reidan safely."
}