{
  "id": 587,
  "title": "Chapter 587",
  "content": "Black's form flickered, then dissolved into grey light as death claimed her.\n\nThe moment stretched. Kasim and White locked eyes across the battlefield, the silence heavy between them. White's mind raced, struggling to comprehend what she was witnessing.\n\n*King of Shadows, Kasim.* The realization struck her like a physical blow. *Why does the continent's strongest assassin serve Grid?*\n\nShe felt unmoored, grasping for answers that refused to come.\n\n*Does Grid have leverage over him? Some weakness he exploits?*\n\nBut there was no time to unravel the mystery. Kasim was already moving.\n\nSteel clashed against steel in a rapid staccato. White grunted, forced back a step. It was like fighting a hundred enemies simultaneously—Kasim wielded the shadows themselves, each pool of darkness becoming a potential weapon or escape route.\n\nHer eyes widened as a shadow blade materialized from nowhere. She barely deflected it, only to sense Kasim already behind her, his dagger thrusting for her spine.\n\n*Too much!*\n\nWhite pivoted, her fist lashing out with desperate force. The counterattack was perfectly timed—and completely worthless. Kasim had already melted back into the shadows, her strike cutting through empty air.\n\nStill, she didn't allow herself frustration. Creating distance was enough. In that momentary respite, White tore off a strip of dried meat and chewed rapidly, forcing her body to accumulate fat reserves.\n\n*What kind of city is this?* The thought was edged with disbelief. *Their main force is deployed elsewhere, yet Reidan still harbors monsters like this. How deep does Overgeared's strength run?*\n\nShe adjusted her strategy, resignation settling over her shoulders. *I only need to keep Kasim occupied until Black succeeds. Just hold out until Irene dies.*\n\nBut could she? White measured her opponent with calculating eyes. Kasim was a Named NPC whose exploits had spawned legends across the continent. She couldn't afford carelessness.\n\n*I was level 230 when rumors of the Shadow Assassin first spread.* The timeline made her grimace. That meant Kasim had achieved his third advancement while she was still struggling through her second. *I'm level 370 now. Given the exponential experience requirements and how Named NPCs scale...*\n\nShe ran the numbers. *He's probably mid-400s. At least the gap isn't over a hundred levels.*\n\nThat was manageable. Barely.\n\n*With my titles and the rune effect, I can bridge sixty levels.* White forced confidence into her thoughts. *Unless he's already achieved his fourth advancement... but that seems unlikely. Even for him.*\n\nThe real problem wasn't the level disparity—it was his class.\n\nShadow Assassins possessed something regular assassins lacked: substantial defense and overwhelming utility. No glaring weaknesses to exploit. Meanwhile, her Martial Artist class excelled in direct confrontation, not drawn-out battles against an opponent who refused to stay pinned down.\n\nBut there was hope.\n\n*Shadow Assassins sacrifice offensive power for their defensive capabilities.*\n\nThe tradeoff was inherent to the class design. Regular assassins hit like siege weapons but shattered like glass. Shadow Assassins were stable, durable—but their damage output suffered for it. That's why Black had fallen so easily; her Illusionist class made her physically fragile, and her clone had been a magic-type variant, even weaker in close combat.\n\n*I can hold out.* The conviction crystallized. *I just need to survive until Black completes her mission.*\n\nWhite concentrated, deliberately shifting her body's composition. Muscle mass decreased, fat content increased. She was trading attack power and agility for pure defensive capability.\n\nImpacts rained down on her from impossible angles. Each strike bit deep, but none were fatal. White's jaw clenched, teeth grinding as she weathered the assault. She refused to fall.\n\nKasim's tongue clicked in irritation as his shadow dagger withdrew without achieving a kill.\n\n*Too weak.* His own assessment was brutally honest. *My attack power is halved.*\n\nWhat White didn't realize—couldn't know—was that Kasim had his own weakness. The techniques that made Shadow Assassins so formidable consumed mana at an alarming rate. His offensive power wasn't the only thing that suffered. His combat endurance was fundamentally limited. Every second this fight dragged on worked against him.\n\nYet Kasim didn't rush forward with reckless abandon. He couldn't afford to.\n\nHis trained eye picked out the coiled muscles hidden beneath White's deliberately padded exterior. *A formidable opponent. She's baiting me. The instant I overcommit, she'll explode into a counterattack.*\n\nPatience was required. Besides, there was no strategic reason for haste. This was his lord's territory. Everyone here was an ally—except for the woman before him. Kasim steadied his breathing, carefully managing his mana reserves as he applied measured pressure. He would grind her down methodically.\n\nHe had no way of knowing that White was delighted with his approach.\n\n*Perfect. Kasim's caution is buying me exactly what I need—time.*\n\nShe barely suppressed a smile. Any moment now, news of Black's success would arrive. Irene would be dead, Grid would be devastated, and the mission would be complete.\n\n---\n\nNearby, Lord observed Kasim's every movement with intense focus.\n\nThe young boy's eyes tracked each feint, every shadow-shift, memorizing the patterns. He wanted to learn from his master's combat style, to grow stronger. The reason burned clearly in his mind: *I need power. Power to protect the people I love.*\n\nHis gaze blazed with fierce determination as he studied the fight, a lantern's intensity captured in a child's face.\n\nThe farmers of Reidan noticed. They always noticed.\n\n*That's Grid's son,* one thought, awestruck.\n\n*Is this what a super-grade NPC looks like?* another wondered. *His talent is extraordinary.*\n\n*If he's already this impressive as a child... I can't imagine what he'll become.*\n\n*Should we...?* The thought formed hesitantly. *Should we follow him specifically?*\n\n*What? But Overgeared has too many talented members. We'd never stand out.*\n\n*Then we don't join Overgeared directly. We serve Lord himself. Think about the future! If we become the foundation for someone destined for greatness, won't we become famous in our own right?*\n\n*...That's actually brilliant.*\n\nAnd so it began—the seeds of Lord's future power base, planted by those who recognized continental-level talent when they saw it. Years from now, they would emerge as an independent special unit within Overgeared, legendary in their own right.\n\n---\n\n> **[The summoned illusion has been damaged and has vanished.]**\n>\n> **[20% experience has been lost.]**\n\n\"Damn it.\"\n\nBlack spat the curse as she checked her experience bar. The Illusionist class could manifest imagination into reality—a performance so overwhelming it bordered on game-breaking. But that power came with brutal penalties.\n\nEvery illusion consumed experience upon creation. Every illusion *destroyed* by an enemy cost even more. And beyond that, the class itself had fundamental limitations that created a hard ceiling on progression.\n\n*Reaching level 400 is a pipe dream.* The acknowledgment was bitter.\n\nStill, she'd succeeded in infiltrating Reidan. With most of the garrison deployed elsewhere, security was thin. The guards wouldn't spot her while she maintained her illusionary concealment.\n\n*Now where's Irene's bedroom?*\n\nFrustration mounted as Black crept through the castle corridors. Every passing second was another moment White had to hold against Kasim. *How much longer can my sister last against that monster?*\n\nThen—\n\nHer breath caught.\n\nA silver-haired woman sat in the garden visible through the outdoor terrace. Even from this distance, her beauty was arresting—the kind that made the world seem to pause.\n\n\"...She's stunning,\" Black whispered despite herself.\n\nThe woman never lifted her gaze from the flowers surrounding her, her expression peaceful and serene. This was Irene. The innocent beauty who had captured countless hearts before becoming Grid's wife.\n\n*Look at that radiant smile.*\n\nPoison began seeping into Black's thoughts. A woman like that would have lived a completely different life. Always loved. Always happy.\n\n*No shadows in her heart. Not a single one.*\n\nWind swept across the terrace, catching Black's hair as she stared down at Irene. Her thin face twisted, hatred blooming like rot.\n\n*How can an NPC be happier than me?*\n\nThe memory surfaced, sharp as broken glass. An orphanage. Two abandoned girls. Black and White, discarded at birth, never knowing a parent's love. They'd been objects of mockery and pity their entire lives.\n\nThat's why she hated Irene. Couldn't accept such radiant existence. The sight of someone drowning in happiness awakened a visceral need to *take it away*, to drag them down into the same darkness.\n\n\"I'll kill her.\"\n\n*Kill. Kill. Kill.*\n\nMadness swirled in Black's eyes as she stared at Irene. She laughed—a cracked, broken sound—imagining herself with shining silver hair, with Irene's happiness stolen and worn like a trophy. Her hands moved through the preliminary gestures of Illusion Manifestation.\n\nThen a voice cut through the darkness.\n\n\"Don't infect her with your misery.\"\n\nMale. Calm. Cold enough to freeze marrow.\n\n\"W-Who's there?\"\n\nBlack whirled toward the darkened corridor, her heart hammering.\n\n*Step. Step.*\n\nFootsteps approached with measured deliberation. A silhouette materialized from the shadows, resolving into a familiar face.\n\n\"F-Faker? You're supposed to be in Reinhardt!\"\n\nOf all the Overgeared members, Faker commanded respect. Despite using a normal class—not even hidden, much less legendary—his reputation was unassailable. White and Black had studied him extensively. His control was flawless, his mastery of class mechanics reminiscent of Kraugel himself.\n\nAn inferior version, admittedly. If Kraugel's raw stats merited an S-grade evaluation, Faker's topped out around A+. Faker knew this. Accepted it. He was a top ranker, but not among the *best* rankers. That gap represented a wall of talent no amount of effort seemed capable of scaling.\n\nUntil now.\n\nDuring the Belial raid, something had changed. He'd realized that accepting limits was the only thing truly holding him back.\n\n\"Black. A sun-grade player.\"\n\nThe same tier as Grid. As Kraugel. Fighting spirit blazed in Faker's eyes as he assessed his opponent.\n\n\"I'll break through my limits by defeating you.\"\n\nHe would scale the cliff. He would stand beside those who touched the sky. Grid had shown him the path—refusing to surrender, constantly pushing beyond what seemed possible.\n\n*I won't give up.*\n\n\"I'm reaching for the sky too.\"\n\nFaker's robe billowed as he moved. Black's attention flickered to the dramatic motion for just an instant—\n\nAnd that instant was all he needed.\n\nThe dagger flew. The distance closed. Everything happened simultaneously.\n\nSteel met steel with a harsh screech. Black barely managed to summon a warrior-type clone, using it to block as her mind reeled.\n\n*So fast!*\n\nShe'd known Faker was a normal class user. She'd expected his attack to be competent but limited. Instead, the power behind that strike was staggering.\n\n*This doesn't make sense! Where are these stats coming from?*\n\nWhat Black didn't know: Faker had spent countless hours standing guard while his guildmates hunted. Rather than waste that time, he'd made it meaningful. Standing in the shadows, he'd swung his blade thousands of times. Refined his technique. Pushed his stats higher through pure repetition.\n\nThe clone's weapon met Faker's blade again and again, the defensive rhythm growing more desperate.\n\nSilver light flashed in the darkness, beautiful and lethal.\n\nThis was rebirth. A legend was being written—not about a chosen few with legendary classes, but about a man who refused to accept that \"normal\" meant \"less than.\""
}