{
  "id": 588,
  "title": "Chapter 588",
  "content": "*Like a flying squirrel...*\n\nA defensive warrior countered assassins perfectly. With high defense to shrug off quick strikes, measured attack power to punish frail bodies, and skills like **Dash** to pin down elusive opponents—Black felt confident her warrior clone would overpower Faker easily.\n\nReality proved less accommodating.\n\n*Wuuong.*\n\n*Wuuong!*\n\nThe clone's sword cut only air. Faker moved with fluid precision, exploiting every advantage his class offered. His control was impeccable, his positioning immaculate.\n\n*Peeng!*\n\nEven **Dash**—the warrior's bread-and-butter skill that closed distance instantly—proved worthless. Faker read the preparatory stance before the skill activated, sidestepping the charge before it launched.\n\n*Another Kraugel?*\n\nThe comparison struck involuntarily. This reminded Black of fighting the Sword Saint—one man holding his ground against both sisters through pure technique.\n\n*The location is the problem.*\n\nReidan Castle's third-floor hallway constricted movement like a vice. The narrow, dim corridor crippled her warrior clone. Sword arcs lost half their power and speed. Accuracy plummeted—tracking a swift assassin in darkness proved nearly impossible. The cramped quarters made **Dash** telegraphed and predictable.\n\nFor Faker, the space transformed into an arena tailored to his strengths.\n\nHe ricocheted off walls and ceiling, momentum building with each kick. Speed doubled, movement patterns became dizzying. The hallway belonged to him. Landing a hit felt virtually impossible.\n\n*This won't work.*\n\nBlack pivoted toward the terrace exit. While her clone kept Faker occupied, she'd reach the garden, seize Irene, and force Faker's surrender.\n\nShe overlooked one critical detail: enemy territory meant enemy reinforcements.\n\n\"You won't reach our lady.\"\n\n\"Death to invaders.\"\n\n*Pak!*\n\n*Pa pa pa pat!*\n\n\"What—?!\"\n\nBalanced on the terrace railing, Black jerked in surprise and toppled backward. Thirteen assassins materialized from shadow, robes emblazoned with silver dragons.\n\n*Another assassin unit? Intelligence never mentioned this.*\n\nTeeth grinding, Black snapped, \"Who are you people?\"\n\nQuestioning assassins ranked among the world's stupidest acts. Secrecy defined the profession. Silence was doctrine.\n\nThese assassins, however, seemed unfamiliar with doctrine.\n\n\"Curious about our identity? Allow us to introduce ourselves.\"\n\n\"We are the Silver Dragons—raised by Prince Ren as his succession weapon. **Daluka's Methods** made us Eternal's finest assassins.\"\n\n\"But that's not all. Recently, we've grown stronger. Under Duke Grid's banner, we train directly under Kasim—the King of Shadows himself.\"\n\n\"Now we are—\"\n\n\"The overwhelming Silver Dragons—\"\n\n\"The **Overgeared Shadows**.\"\n\n\"We are loyalists pledging ten lives to Overgeared's cause.\"\n\n\"...\"\n\n*Who is this performance for?* The absurdity struck Black like characters reintroducing themselves after a long absence from the narrative.\n\n*Syuok!*\n\n*Syu syu syu syu syuk!*\n\nAbsurdity didn't slow their blades. The Overgeared Shadows struck with terrible precision, daggers targeting vital points in coordinated strikes.\n\n\"Ugh!\"\n\nDespite exceeding level 330—well below White but formidable nonetheless—Black struggled against these mid-200s assassins. The **Illusionist's** fatal weakness exposed itself.\n\n*Cooperative attacks are devastating.*\n\nSuccessive strikes carved away health she couldn't afford to lose. Black made her choice—another illusion at the cost of experience.\n\n*Sururuk.*\n\nDark smoke poured from her body, coalescing into human form. This clone manifested as a paladin—excellent tanking, healing, and buffing capabilities.\n\n\"Hee~ Brothers, care to play with me?\"\n\nUnlike the real Black, this clone smiled cheerfully, equipping a tower shield and longsword.\n\n*Jjeejeeeong!*\n\n\"...!\"\n\nThe Overgeared Shadows recoiled. Their daggers couldn't bear the shield's weight. Momentum broken, they stumbled as Black's paladin shoved them toward the corridor entrance.\n\nThen the paladin turned her attention to supporting the warrior fighting Faker.\n\n\"**Round Heal**.\"\n\n*Swaaaaah!*\n\nGreen light blossomed in a circle beneath the battered warrior clone, Faker's relentless assault having taken its toll.\n\n\"Eh..!\"\n\nWarmth suffused the warrior. Color returned to its face—\n\n*Puoook!*\n\nA silver dagger punched through the clone's heart. Like fangs closing on a throat. Strength beyond expectation.\n\n> **[The summoned illusion has been damaged and has vanished.]**\n>\n> **[20% experience has been lost.]**\n>\n> **[Your level has dropped.]**\n>\n> **[10 of your most recently invested points will be lost.]**\n\n\"What?!\"\n\n*The first clone died while I'm dealing with assassins?*\n\n\"How is this possible?\"\n\nFaker possessed a **normal class**. How could his attacks be twice as devastating as her estimates? There had to be some trick—\n\n*Step.*\n\nFaker walked calmly into the **Round Heal** circle, restoring his own health before answering.\n\n\"The power of items.\"\n\nNo elaborate explanation needed. Overcoming a **normal class's** limitations required every advantage. As an Overgeared member, Faker exploited Grid's creations ruthlessly. The legendary items available to him multiplied his effectiveness several times over.\n\n**Kruger's Pants** in particular had transformed his capabilities.\n\nAgainst Belial, yes, he'd seemed ineffective—but that reflected an insurmountable level gap, not incompetence. Protecting allies had restricted his movements. Against Black?\n\nAgainst Black, Faker operated unrestricted. And Black found herself thoroughly outclassed.\n\n*Pahat!*\n\nEnhanced agility and jumping power—**Kruger's Pants'** effects—launched Faker skyward. Items crafted by legends, past and present, elevated his stats to overwhelming heights. In an instant, he appeared directly above her.\n\nBlack felt death's certainty.\n\n***\n\n> **[Your party member Black has died.]**\n\n\"W-What?\"\n\nWhite stared at the notification, disbelief warring with comprehension. Reidan's main forces were absent. Who could possibly harm Black?\n\n\"How? What is this?\"\n\nEverything had gone wrong from the moment they entered those fields. Process and outcome both diverged from predictions. The fields carried a curse—White felt certain. That insane farmer who'd killed her in Siren flashed through memory, phantom pain throbbing in her forehead.\n\n\"I can't retreat empty-handed.\"\n\nGrid and Overgeared owed debts requiring repayment. After coming all the way to Reidan, after sacrificing sister Black—retreat meant failure.\n\n\"You...!\"\n\nHer gaze locked on Lord in the distance. Grid's son. Overgeared's secret weapon. Killing the child raised by Grid and Kraugel would constitute true revenge.\n\n\"Kik! Kilkik! Hahahahahat!\"\n\nGuilt stabbed deep. Black had always suffered under leveling's crushing difficulty. Sacrificing her twisted something in White's mind. Her laughter emerged unhinged, body trembling.\n\nShe burned body fat, converting it to explosive muscle. Acceleration spiked—\n\n\"Young Lord!\"\n\n\"Block her!\"\n\nTwo hundred girls rushed to shield Lord. Too slow. White had reduced body fat to absolute minimum, maximizing speed beyond their capacity to intercept. The gap closed.\n\nHer smile sharpened.\n\n\"Blame your father if you need someone. You die because of him!\"\n\nKilling intent lanced toward the child—harsh enough to make ordinary children faint or weep.\n\nBut Lord was destined for legend. Abnormal status effects barely touched him.\n\nTears filled his eyes. He didn't look away.\n\n\"No! I don't blame Father! My father is the best person in the world!\"\n\nHow often had Father been present since Lord's birth? So few times he could count them. Yes, loneliness visited sometimes. Sadness, too. He wished he could follow Father around like the gardener's son did. Learn from him. Be with him.\n\nBut Lord never voiced those feelings. Never burdened Father with them.\n\nBecause Father worked for their family. For their people. His absence meant sacrifice, not neglect. Mother was great for caring for him. Father was great for suffering alone to protect them all.\n\nEven now, with Father unable to protect him, Lord refused to blame him.\n\nHe loved Father. Respected Father. Forever.\n\n\"T-This brat!\"\n\nThat unshakeable faith in the child's eyes—where did it come from? Wrong. Deeply wrong.\n\nDiscomfort surged. White's fist shot forward, power concentrated to crush the child's skull in one blow.\n\nThe blow never landed.\n\n\"**Greed**.\"\n\nWhite had assumed Kasim couldn't harm her. Catastrophic miscalculation.\n\nKasim could kill White whenever he chose.\n\n*Ku kwa kwa kwa kwa! Ku kwa kwa kwa kwa!*\n\n\"H-Heok!\"\n\n**Greed** manifested—Kasim's unique technique, synthesizing **Daluka's Methods** and **Lantier's Methods**. All surrounding shadows converged to a single point, devouring everything in proximity.\n\nA heartbeat later—\n\n*Clang.*\n\nOnly a sparkling necklace remained where White had stood."
}