{
  "id": 59,
  "title": "Chapter 59",
  "content": "# Chapter 59\n\n\"The <span class=\"rarity-epic\">Diamond Necklace that Causes a Slight Change in Sensation</span>, presented by Ms. Clarice, has sold for 453 gold.\" The auctioneer's voice echoed through the hall. \"Mr. Grees' <span class=\"rarity-rare\">Cold Protection Inner Armor</span> has sold for 189 gold. Mr. Piglet's <span class=\"rarity-uncommon\">Bitter but Superior Strength Potion</span> has sold for 15 gold each. Mr. Steng's <span class=\"rarity-rare\">Long Sword that Easily Harmonizes with Magic</span> has sold for 1,900 gold.\"\n\nCheers erupted around the auction hall.\n\nSteng bounced on his heels. \"My teacher's work sold! He's going to be so happy!\"\n\n*That bastard gets a new production method just for showing up.* I ground my teeth together. Steng turned toward me with a stupid grin, probably expecting congratulations.\n\nMy stomach churned. *Dammit. Nothing. My items didn't sell after all. Shit, I should've made them cheaper. How am I supposed to pay off my debts if—*\n\n\"Mr. Grid's presented work, the <span class=\"rarity-epic\">Very Delicate Plate Armor</span>, has sold for 3,500 gold.\"\n\nMy thoughts stopped.\n\n\"The <span class=\"rarity-epic\">Seemingly Plain Gauntlets</span> have sold for 2,000 gold.\"\n\n\"What?\"\n\nDid he just say 3,500 gold? Not 350? Not 2,000?\n\nVoices exploded around me.\n\n\"No way. How can a single item go for that much?\"\n\n\"Those were epic rated, weren't they? The level requirement was over 100...\"\n\nSteng stared at me with wide eyes. \"That's incredible! Your teacher must be an Advanced Blacksmith, right? Does he have the **Advanced Blacksmith's Craftsmanship** skill?\"\n\nI didn't hear him.\n\n*5,500 gold.* The numbers scrolled through my head like a slot machine. *That's 6,600,000 won. That's 73 days of backbreaking labor at the construction site. Seventy-three days. And I made it in a week.*\n\nMy mouth moved on its own. \"Abo... aboooo...\"\n\n\"Mr. Grid.\" The auctioneer appeared at my side. \"The administrator wishes to speak with you. Follow me.\"\n\nSteng clapped me on the shoulder. \"Congratulations! You'll be able to deliver goods to the castle now. Your smithy is going to be incredibly busy. Your master will give you so many quests!\"\n\nUnlike me, who'd felt a spike of jealousy watching his success, Steng looked genuinely happy. The kid was only in his mid-teens, but he had a good heart.\n\n*I like him.* I'd recruit him once I owned the smithy. He seemed like the type who wouldn't whine about overtime.\n\nI forced my face into the warmest smile I could manage. \"Thanks. See you around.\"\n\nSteng's expression went pale. He took a step back. \"Uh. Goodbye.\"\n\n*What was that about?* I dismissed it and followed the auctioneer.\n\nThe administrator's office was larger than I expected. A middle-aged man with an impressive mustache stood from behind his desk.\n\n\"Ah, Grid! I was very impressed by your work.\" He gestured to a chair. \"I wondered how someone so young became a smithy's successor, but your skill speaks for itself. Please, sit.\"\n\nA maid appeared with a tea tray the moment I sat down.\n\nThe scent hit me immediately. *Elpa tea. But not the cheap garbage Khan makes.* When Khan brewed tea, I had to stick my nose directly into the cup to smell anything. This tea filled the entire room with a sharp, spicy aroma.\n\n*Expensive leaves.* My hand moved before I could think. I drained the cup in one gulp and thrust it toward the maid.\n\n\"Another.\"\n\n\"Yes, sir.\"\n\nGulp.\n\n\"One more.\"\n\n\"Yes, sir.\"\n\n\"Kya! This is amazing. One more!\"\n\n\"...Yes, sir.\"\n\nThe administrator laughed after my fourth cup. \"The residents described you as someone with a heroic appearance. Yet you show no nervousness in front of authority.\"\n\n*Shit. Did I mess up?* Heat crawled up my neck.\n\nThe administrator waved a hand. \"Be comfortable. I prefer it.\"\n\n\"Right. Of course.\"\n\nHe leaned forward. \"I'd like to distribute your equipment to Lady Irene's knights and soldiers. Are you willing to do business with Winston?\"\n\n*There it is.* Every muscle in my body screamed to accept immediately, but I'd learned something from the auction. High-level items meant higher profits.\n\nI scratched my cheek. \"I don't know if you're aware, but the smithy is doing extremely well right now. I'll be very busy. I'm not sure I'll have time to mass-produce equipment for soldiers.\"\n\n*Level 50 gear for common soldiers? That's garbage money. One level 120 item is worth a dozen level 50 pieces.*\n\nThe administrator nodded slowly. \"I see your point. Your craftsmanship requires significant time investment. I was foolish to request hundreds of soldier supplies.\" He straightened. \"Then I'll adjust. Create equipment only for the knights.\"\n\n\"I can do that.\"\n\n\"However.\" His eyes locked onto mine. \"The equipment for the knights must exceed the quality of today's auction submissions.\"\n\nMy stomach dropped. \"What?\"\n\n\"I'm asking you to deliver items of epic rating or higher.\"\n\n*This crazy bastard.* My hands clenched under the table. *Even if I invest 20 hours per item, there's no guarantee I'll get anything better than Normal rating.*\n\n\"Of course, I understand the difficulty.\" The administrator's mustache twitched. \"That's why I'm willing to pay 10% above today's winning bids. And if you produce works significantly better than today's submissions, I'll pay even more.\"\n\nTen percent more than 5,500 gold.\n\nI shot to my feet. \"Deal! I'll head to the smithy right now!\"\n\n\"Wait.\" The administrator raised a hand. \"Start with three swords. Some of our knights lost their weapons in a recent incident.\"\n\n> **[Business with the Administrator (1)]**\n> \n> Difficulty: A\n> \n> Winston's administrator, Vladi, has requested equipment for his knights. He's offering favorable terms based on your demonstrated skill. Disappoint him, and the arrangement ends permanently.\n> \n> **Quest Clear Conditions:** Deliver three <span class=\"rarity-epic\">Epic</span> rated swords with level limits between 120-180 within one week.\n> \n> **Quest Clear Rewards:** Variable, based on item quality.\n> \n> **Quest Failure:** Business relationship with administrator terminated. Quest destroyed.\n\n*This is actually doable.* Over the past few days, I'd made three items with 20-hour investments each. Two came out epic. One was normal garbage. That was a two-thirds success rate.\n\n*Unless my luck completely dies and I get three Normal items in a row, I can definitely clear this.*\n\nConfidence surged through my chest as I left the castle. The afternoon sun hit my face.\n\nAn elderly woman approached as I walked toward the smithy. \"Mr. Grid, some people are following you.\"\n\nA fruit vendor nodded. \"That's right. Be careful. They might mean harm.\"\n\nMy **Affinity** with Winston's residents had maxed out after the Yatan Church incident. They treated me like family now.\n\n\"Following me?\" I glanced back.\n\nFigures lurked in the alley entrance. Under the shade of a tree. Behind a street vendor's cart. At least a dozen of them, trying and failing to be subtle.\n\n*Am I the target of some assassin organization?* Goosebumps crawled across my arms.\n\nThen I recognized a few faces. They'd been at the auction.\n\n*Oh. They're trying to figure out which blacksmith made my items.* \n\nI turned to the residents. \"Could you stop them from following me? Don't worry, they're not dangerous.\"\n\nThe residents' eyes blazed with determination.\n\n\"Leave it to us!\"\n\n\"We'll handle everything!\"\n\nThey rolled up their sleeves and charged as a mob. Dozens of them.\n\n\"What? Why are they grabbing us?\"\n\n\"Get off me! What's wrong with these NPCs?\"\n\n\"Let go!\"\n\nThe problem solved itself in under a minute.\n\nI thanked the residents and hurried back to the smithy. After explaining everything to Khan, I logged out.\n\n***\n\nThe capsule hissed open.\n\n\"Hu... huhuhut!\" I couldn't contain it. Laughter burst from my chest.\n\n\"Puhahahahat! I'm rich! I'm actually rich!\"\n\nSaying it out loud made it real. 6.6 million won in one week. The right to supply Winston Castle. My 10 million won debt would vanish soon. I could finally stop being a debt slave.\n\n*One day, I'll drive a foreign car.* The image filled my mind. *Ahyoung sitting in the passenger seat, wind in her hair...*\n\nI couldn't stop laughing. Tears leaked from my eyes.\n\n\"Excuse me.\" A capsule room employee appeared, frowning. \"You're disturbing other customers. Please keep it down.\"\n\n\"Sorry.\" I wiped my eyes, paid for the room, and headed home.\n\n***\n\nThe employee watched Shin Youngwoo leave. He clicked his tongue.\n\n\"A guy like that talking about being rich. Laughing like a maniac about money.\" He shook his head. \"Definitely crazy.\"\n\nA second employee leaned over the counter. \"You think he's homeless? He wears the same work clothes every single day.\"\n\n\"Has to be. But he pays for the capsule regularly, so who knows.\"\n\nTwo student part-timers joined the conversation, watching the door where Youngwoo had exited.\n\n\"I checked his member info. He's 26.\" The first student made a face. \"Showing up at dawn every day in those clothes. What a pathetic life. I'm never ending up like that after graduation.\"\n\n\"Forget him. Did you hit level 40 yesterday?\"\n\n\"Yeah! Still stuck at 39?\"\n\n\"Yeah. Where are you leveling? I need better hunting spots.\"\n\n\"Got lucky and picked up a <span class=\"rarity-rare\">Rare</span> item. Made hunting way easier. Items really do carry you.\"\n\n\"So jealous. I want a rare item for my mage.\" The student glanced at the door again. \"Wonder what level that homeless guy is.\"\n\n\"Please.\" The other student snorted. \"Look at him. Does he seem capable of playing well? Satisfy's crueler than reality. Losers stay losers. He's probably stuck at level 20, grinding trash mobs.\"\n\nThey returned to their phones, dismissing Shin Youngwoo entirely.\n\n***\n\n**Glossary of Common Korean Terms**\n\n[OG: Glossary Link]\n\nCurrent schedule: 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters."
}