{
  "id": 590,
  "title": "Chapter 590",
  "content": "# For Isabel's Sake\n\n> **[For Isabel's Sake]**\n> ★ Hidden Quest ★\n> \n> Isabel's mission demands she defend the Rebecca Church with her life—a cruel fate beyond mortal will or power to change. Even Pope Damian cannot save her.\n> \n> But you are different.\n> \n> Reconstruct Lifael's Spear flawlessly and prove your worth. Your blacksmithing prowess is a force mighty enough to shatter destiny itself. Reveal techniques beyond mortal comprehension and claim the right to transcend from legend to myth.\n> \n> **Quest Clear Conditions:** Diminish Lifael's Spear's divine power to ensure Isabel's safety. However, the reconstructed spear must surpass the original in overall performance.\n> \n> **Quest Clear Reward:** **Deity** +1\n\n*I need to accumulate deity points over the long term.*\n\nHidden quests never disappointed. They offered rewards impossible to obtain through ordinary means. This hidden quest awarded a single point in the **Deity** stat—proof that the stat couldn't be raised through conventional methods. It was like **Good Luck**. Even titles like *Kingdom's Hero* and *Savior of the World*, which boosted all stats, had no effect on **Deity**.\n\n*Makes sense.*\n\nHe hadn't expected it to be easy. If anything, a stat that granted special powers every ten points *should* be difficult to raise.\n\n*Well, whatever.*\n\nAnother headache loomed. He had to suppress Lifael's Spear's divine power while simultaneously increasing its overall performance? What a shameless demand. The spear's formidable strength came primarily from its divine power. Logically, weakening that power while boosting the weapon's capabilities seemed impossible.\n\nBut—\n\n*I have to do it.*\n\nGrid grumbled as usual, but surrender never crossed his mind. The quest had no time limit, and he wanted that **Deity** point. More importantly, Grid wanted to give Isabel happiness.\n\n*This is for Damian and Isabel's future. Don't rush. Take it slow and careful.*\n\n\"...\"\n\nGrid stood before the furnace, lost in thought. To the onlookers, he seemed the picture of melancholic artistry—an unsatisfied master, a stubborn craftsman bearing the weight of years of experience.\n\n*He looks amazing just standing there.*\n\n*The atmosphere is incredible.*\n\n*I want to be like him someday.*\n\nThe blacksmiths of Reinhardt watched Grid with envy. Naturally, blacksmiths revered legendary blacksmiths.\n\n\"Hrmm.\"\n\nGrid continued thinking.\n\n*Raising the spear's base performance is too difficult. What if I restructure it to better suit Isabel specifically?*\n\nIf the options were tailored to Isabel, Lifael's Spear would likely become more powerful.\n\n*...No, this is one of the Rebecca Church's three great divine artifacts. I don't think it can be personalized for just one wielder. Think harder.*\n\nGrid approached the problem methodically. After considering conventional methods to enhance the spear's power, he would attempt reconstruction. But nothing came easily. After suppressing the goddess's power, strengthening Lifael's Spear through ordinary means was virtually impossible.\n\n*Wait.*\n\nThe sun had set and the moon risen. Grid's eyes sharpened as he stared into the furnace.\n\n*What about changing the materials?*\n\nAdamantium ranked among the finest minerals. That's why Grid had considered Lifael's Spear's materials flawless. He'd been reluctant to add anything to a spear composed purely of adamantium. But looking back—didn't he possess materials equal to adamantium?\n\n*Belial's bones and horns!*\n\nAdamantium was a mineral that naturally formed in the divine realm. But compared to a great demon's body parts, it was practically inferior-grade material. A dark smile crept across Grid's face.\n\n*If I craft the spear from Belial's bones, the power will be maximized.*\n\nWhy hadn't such a simple solution occurred to him sooner? Braham doused Grid's excitement with cold water.\n\n*'Will you mix the bones of a filthy demon with Goddess Rebecca's artifact? Kuk kuk, entertaining, but won't that offend the Rebecca Church?'*\n\n\"...Ah.\"\n\nUsing a depraved being's body parts for a divine weapon was unacceptable. Grid belatedly realized, his headache intensifying.\n\n*Not so simple after all.*\n\nBraham offered advice to the dejected Grid.\n\n*'Why not try magic?'*\n\n*'...?'*\n\n*'Attach magic to Lifael's Spear. If your goal is increasing the weapon's power, wouldn't using magic be simple and effective?'*\n\nIndeed, a simple answer. But not feasible.\n\n\"How can I do that?\"\n\nCreating a magic item required three steps. First, imprint a magic power recovery formula so the item could generate magic power independently. Second, inscribe a magic spell onto the item. Third, infuse the inscribed mark with the magic spell.\n\nIt seemed straightforward but was extraordinarily difficult. Even great magicians struggled to create magic items. This was no domain for a blacksmith. Braham spoke with unmistakable pride.\n\n*'I will teach you how to make magic items.'*\n\n\"Ah!!\"\n\nGrid remembered something crucial. Who had created the strongest mineral, Greed? Braham and Pagma. The legendary great magician Braham undoubtedly knew how to create magic battle gear. Grid's eyes blazed with excitement.\n\n\"You'll really teach me? I can create magic battle gear?\"\n\nIf Grid mastered magic battle gear production, the variety of items he could craft would expand dramatically. The value was astronomical, no exaggeration. Braham responded positively to Grid's high expectations.\n\n*'Magic battle gear creation was something Pagma could do. You have the skills to do it as well.'*\n\n\"R-Really? Then why didn't you tell me sooner?\"\n\n*'You gained the potential to produce magic weapons because you destroyed Great Demon Belial and your **Intelligence** increased from the reward. Before that, you were so ignorant there was no hope.'*\n\n\"...\"\n\nHe praised the *Savior of the World* title internally. A notification window materialized before Grid.\n\n> **[One of Pagma's Descendant's hidden pieces, 'Sealed Ability,' has been acquired.]**\n>\n> **[You can acquire 'Magic Battle Gear Production Method' by clearing the quest.]**\n>\n> **[A new quest has been created.]**\n\n> **[Production Training]**\n> \n> Difficulty: SSS\n> \n> Magic battle gear creation was originally exclusive to magicians.\n> \n> But in the past, the legendary blacksmith Pagma developed his own unique method for crafting magic battle gear with Braham's help.\n> \n> You can also learn from Braham how to create magic battle gear.\n> \n> **Quest Clear Conditions:** Achieve what Braham demands.\n> \n> **Quest Clear Reward:** Magic Battle Gear Production Method Lv. 1\n\n\"Braham, you...\"\n\nHe'd done so much, only to be abandoned by Pagma later. Grid felt compassion stirring, then Braham spoke.\n\n*'Don't betray me.'*\n\n\"...\"\n\nBeing betrayed by a friend had profoundly impacted Braham. If Grid were in Braham's position, he wouldn't trust another human again. Yet Braham showed steady trust in Grid. Why? Grid couldn't help asking.\n\n\"Braham, why do you like me?\"\n\nBraham shouted angrily. *'W-What!? W-Who likes you?!'*\n\nBraham denied it, but his favorable feelings toward Grid were evident—he helped constantly. Why? Because Grid's nature differed from Pagma's. Unlike Pagma, who betrayed friends for his cause, Grid cherished every friend. Braham had been expelled from the vampire world, his personality gradually changing over hundreds of years. He also wanted to be important to someone.\n\n*'Che.'*\n\nWhy was his heart softening? It started when Mumud became his disciple. Braham had been jealous of Mumud's talents, intercepted his achievements, and resolved to erase Mumud from the world. Yet Braham couldn't kill Mumud. Later, Mumud had devoted himself to curing Braham's illness.\n\n*'...'*\n\nMumud. That innocent smile belonging to a man more lovable and naive than anyone else.\n\nGrid prompted him. \"What are you doing? Hurry up and teach me the Magic Battle Gear Production Method.\"\n\n*'Right. Start by learning to forge metal with Magic Missile.'*\n\n\"...?\"\n\n*'Do it ten thousand times. You need to strike the metal with Magic Missile that many times.'*\n\n\"?????\"\n\nCouldn't it be somewhat easier? Grid didn't understand why he had to suffer every time.\n\n***\n\nLauel stood before a full-length mirror.\n\n\"Lauel, you know you're perfect in every way.\"\n\nHis talent had already transcended the human realm, enough to earn the gods' jealousy. Ah, perhaps that was why?\n\n\"...I'm under a terrible curse.\"\n\nA curse that his military talent was merely at this level.\n\n\"Lauel, you're not qualified to lead the army.\"\n\nLauel had devised a strategy to swiftly end the war by targeting Reinhardt's weakness. A brilliant strategy ensuring all team members performed optimally, yet Lauel felt inadequate.\n\n*I can't adapt flexibly to variables and can't handle a war that changes in real time. Eventually, I'll make a critical mistake and plunge the army into crisis.*\n\nHis role was chief of staff, not general. He needed someone cool and charismatic while possessing excellent skills. Piaro and Asmophel? They fell short. They could win battles but lacked the wisdom to win wars.\n\n*Of course, Asmophel might be different once he develops further.*\n\nWas there someone who could assume Asmophel's role until his talent fully blossomed? Lauel's face darkened as he pondered.\n\n\"...N-No one?\"\n\nOvergeared Guild. He couldn't deny they had exceptional talent, but most of it was skewed toward individual combat prowess. Lauel felt desperate.\n\n\"Kukuk... Can't be helped. I need to secure new talent from outside.\"\n\nHow? The method was obvious. Recently, Overgeared's prestige and authority had become tremendous. Right now, many people worked tirelessly, hoping to join Overgeared. Lauel planned to leverage this.\n\n\"Toban, organize a large-scale recruitment drive for Overgeared. Broadcast my will to the world immediately. I will await those who will earn the honor of sharing my destiny.\"\n\n\"Ah... In other words, post job openings worldwide?\"\n\n\"...\"\n\nThere were no romantics in Overgeared. Lauel felt deflated."
}