{
  "id": 591,
  "title": "Chapter 591",
  "content": "# **On the Outskirts of Innsbruck**\n\nHigh in the Austrian mountains, an ancient castle stood beside a crystalline lake. The structure should have been breathtaking—medieval stone towers mirrored perfectly in still water, a landscape beautiful enough to stop birds mid-flight. Yet something felt profoundly wrong. No smoke rose from the chimneys. No lights glowed in the windows. When the wind swept across the empty fields, it carried no scent of life.\n\nThe castle was a tomb.\n\n***\n\nInside, a single room stretched nearly a thousand square feet, completely bare. No furniture. No decoration. Nothing but one capsule placed at its center.\n\n\"Luna...\"\n\nThe man inside tossed fitfully, green hair darkened with sweat and tears. His gaunt face twisted in anguish.\n\n\"Luna...!\" \n\nAgnus jerked awake with a strangled cry, chest heaving. His golden eyes darted around the barren chamber, searching desperately for something—someone—who would never be there. The familiar emptiness crashed over him like ice water.\n\n*She's gone.*\n\nHe stumbled to the window, gripping the stone sill until his knuckles whitened. Below, the lake reflected the castle's towers with perfect, mocking clarity. He'd stood here countless times before, her warmth beside him, her joy at this simple view filling the space between them.\n\nNow there was only absence.\n\n\"The landscape you wanted to see every morning...\" His voice cracked.\n\nThe wealth meant nothing. He'd bought an entire castle—this monument to his failure. Every room echoed with her loss. Every corridor whispered his incompetence. She'd suffered a terrible end because of him. Because he hadn't been strong enough. Smart enough. *Good* enough.\n\nThe thought of suicide flickered through his mind again. It always did.\n\n\"I need to see you again.\" The words came out hollow. \"Just once more.\"\n\nHe turned from the window, feet dragging across cold stone. His hand trembled as he reached for the capsule lid. Inside was the only place left where his desire might be fulfilled—where the impossible became possible.\n\nSatisfy waited.\n\n***\n\n## **Resurrection Point**\n\n\"Shit! *Damn it!*\"\n\nWhite slammed her fist against nothing, poison still burning through her veins from the Reidan debacle. Beside her, Black's silence screamed louder than any curse. Their fury was a physical thing, sharp enough to cut.\n\n*How?* White's mind raced. *How does Grid have NPCs of that caliber?*\n\nBlack's thoughts ran parallel. *Faker... just a normal class user... how dare he—*\n\nWhite's whole body trembled with the urge to charge straight back to Reidan. To make them pay. To *win*. But cold logic held her in place. They couldn't. The enemy was too strong. That was the bitter truth that made her blood boil—they weren't afraid of Grid or Kraugel themselves. They'd been crushed by Grid's *subordinates*.\n\n\"Confronting Overgeared with your current strength would be... unwise.\" \n\nThe gentle voice cut through White's rage like a knife. Both sisters whirled, weapons half-drawn, only to freeze at the sight of the speaker.\n\nBeautiful didn't begin to describe him. White hair framed features so delicate they bordered on feminine, yet something in those eyes spoke of calculated danger.\n\n\"Veradin.\" White's lip curled. \"What's the captain of the hyenas doing here?\"\n\nThe insult was deliberate. Necromancers—corpse manipulators, battlefield scavengers. *Hyenas*, every one of them. And Veradin wore the crown as the top-ranked necromancer in the game.\n\nBlack's eyes narrowed. *He was one of the 10 Rookies' greatest geniuses alongside Lauel. But unlike Lauel, he's been quiet. Too quiet. Why approach us now?*\n\nVeradin's smile never wavered as he extended one elegant hand. \"If revenge on Overgeared is what you seek, consider joining us.\"\n\nWhite barked out a laugh. \"The White Wolf Guild? You want *us* to serve under someone *weaker*?\" She shook her head in disbelief. \"Do you even understand who you're talking to? How could you possibly help us?\"\n\nThe reaction was harsh, but Veradin showed no offense. He knew the White Wolf Guild—ranked somewhere in the top 200—wasn't impressive enough bait for players of the sisters' caliber.\n\n\"A misunderstanding.\" His voice remained pleasant. \"I'm not recruiting you for my guild. I'm recruiting you for *Immortal*.\"\n\n\"Immortal?\" White repeated.\n\nBlack's posture shifted slightly. *That name...*\n\n\"The necromancer organization?\" White's skepticism remained, but curiosity flickered beneath it.\n\nVeradin's next words changed everything.\n\n\"Immortal is a secret organization in service to Agnus.\"\n\n\"*Agnus?*\"\n\nThe name hit like a thunderclap. Agnus—who stood beside Kraugel and Ares as one of the game's titans. Agnus—whose unique brand of madness made even Blood Carnival's worst killers keep their distance. Nobody wanted to provoke that particular sleeping dragon.\n\nYet for all his power, Agnus had always operated alone. A force unto himself, like Kraugel. Or so everyone believed.\n\n\"Hold on.\" White's eyes narrowed. \"Isn't giving that psychopath an organization incredibly dangerous?\"\n\n\"He levels cities when he's *bored*...\" Black added quietly.\n\nVeradin's expression turned rueful. Even these two—hardly paragons of sanity themselves—considered Agnus the worst of the worst.\n\n\"Agnus possesses more rationality than you might think,\" Veradin said carefully. \"He only engages in mass slaughter when his emotional state becomes... disturbed.\"\n\n*In other words,* both sisters thought simultaneously, *he murders thousands whenever he's in a bad mood.*\n\n\"Join Immortal,\" Veradin pressed. \"With Agnus backing you, Overgeared becomes manageable.\"\n\nThe logic was sound. Agnus's presence alone shifted the balance of power. And then there was his Death Knight Transformation—temporary, yes, but it made him an undead warrior without equal, one who didn't fear death itself.\n\n*With someone like that on our side...*\n\n*We'd be unstoppable.*\n\nBut changing allegiances required more than temptation.\n\n\"What's Immortal's endgame?\" White demanded.\n\n\"To make Agnus king of both living and dead. We're building toward a kingdom where undead and users coexist—a foundation for continental domination.\"\n\n\"Ambitious.\" Black's tone was approving. \"An undead army at the kingdom level would be formidable.\"\n\n\"But we're in Blood Carnival specifically because of the freedom,\" White cut in. \"I'm not interested in following orders.\"\n\n\"Freedom will be guaranteed,\" Veradin assured them. \"However, Overgeared and the Ares Army are designated enemies. If conflict arises with either force, your participation will be required.\"\n\nThe sisters exchanged glances. The terms weren't unreasonable. Freedom plus a clear enemy—specifically the enemy they already wanted destroyed.\n\n*Being hostile to Ares is risky,* White acknowledged internally.\n\n*But with Agnus's undead legions combined with our strength...* Black's thought finished the calculation.\n\nThe decision took seconds.\n\n\"Fine. We'll leave Blood Carnival.\"\n\nVeradin shook his head. \"Publicly, you remain Blood Carnival members. Just as I remain with the White Wolf.\"\n\n\"Not announcing Immortal's existence yet?\"\n\n\"Precisely. Among other reasons...\" Veradin's smile sharpened. \"I'm curious about Blood Carnival's hidden master. His identity remains a mystery.\"\n\n\"*Tell me about it,*\" White muttered.\n\nBoth sisters scoffed, but didn't protest. That particular mystery had gnawed at them for some time.\n\n***\n\n## **Deep in the Dravian Mountains**\n\nIn what was once the light dragon Nevartan's lair, Blood Carnival's stronghold thrived in shadow. Here, the organization's master—known only as 'Dark'—spent most of his time. Only Blood Carnival's three founding members knew his true identity.\n\n*The White and Black sisters' silence is troubling.*\n\nDark frowned, considering the implications. After their Reidan failure, he'd expected them to come raging back immediately. That was their nature—violent, direct, demanding. But instead... nothing. Radio silence.\n\nBlood Carnival's structure made intervention impossible. Everyone joined for personal gain, operating independently. He couldn't deploy forces to assist members without their request. Still, the quiet unnerved him.\n\nHe opened a whisper channel to Viola, one of the founding members.\n\n> **Dark:** Have you found any named NPCs comparable to Piaro?\n\n> **Viola:** I've been scouting multiple kingdoms with our people. No luck. I never realized independent named NPCs were this rare.\n\n> **Dark:** Everyone's competing for talent. Perhaps we're thinking about this wrong. Maybe we should *create* our own instead.\n\n> **Viola:** Create a named NPC? How?\n\n> **Dark:** Did you watch the Bairan war footage? One soldier was covertly assisting Grid on the battlefield. I doubt Grid simply stumbled upon named NPCs. More likely, he systematically trained ordinary NPCs until they evolved into named status.\n\n> **Viola:** That's possible?\n\n> **Dark:** That's what we need to determine. Find any NPC with decent potential and secure them. We'll place them in a dungeon environment and power-level them systematically.\n\n> **Viola:** U-Understood.\n\nViola's doubt was clear even through text, but her faith in Dark's judgment ran deeper. The whisper ended.\n\n\"Time to focus on the real work.\"\n\nDark's expression shifted to something approaching satisfaction as he moved toward a curtain concealing a hidden passage. Stone stairs descended into darkness, opening onto a labyrinthine network of tunnels.\n\nHe'd built every inch of it himself.\n\n\"Let's make progress today.\"\n\n*Clang! Clang!*\n\nThe sound of his pickaxe striking stone echoed through the passages as Dark continued his work. Each swing refined the dungeon's layout, increased its difficulty, perfected its deadly design.\n\nThis was the power of his hidden class: Dungeon Maker.\n\nOne day, this would become a gift—for Grid and the Overgeared Kingdom.\n\nThough neither of them knew it yet."
}