{
  "id": 592,
  "title": "Chapter 592",
  "content": "# Chapter: The Grind\n\nA Dungeon Maker could construct dungeons underground, in caves, inside buildings—anywhere their skills allowed. The rating of each dungeon varied according to location, design, and scale. Higher-rated dungeons accommodated greater numbers of traps and monsters, making the dungeon's rank a direct factor in its overall difficulty.\n\n> [The third section of the 'Beware Dogs' dungeon has been completed.]\n>\n> [The third section is structurally capable of placing 8 traps and 193 monsters. However, you cannot place flying-type monsters.]\n>\n> [This is a unique-rated dungeon. As a bonus, experience has increased by 10% and all stats have increased by 6.]\n>\n> [Every time someone destroys a trap or hunts a monster, you will share some of their experience. You can acquire a certain amount of gold and building materials every time someone acquires items. If a dungeon explorer dies during the dungeon, you will receive various special rewards.]\n\nThe dungeon 'Beware Dogs,' built in the Dravian Mountains by Dark, was his masterpiece—a structure designed to thoroughly block intruders and protect *it*, which would someday become its master. Of course, not all of Dark's dungeons served such a purpose.\n\nDungeons were highly versatile spaces. Dark sometimes produced training grounds for his allies or easy-access dungeons for his own profit. On occasion, he even created special attractions like haunted houses, charging admission and turning them into tourist destinations.\n\nDark didn't doubt that Beware Dogs would serve its intended purpose. But completion was still far off. The production time and cost for the dungeon were staggering—particularly the money. He needed so much more gold.\n\n*Should I raise the commission cost for Blood Carnival?*\n\nNo, he couldn't afford to be too greedy. Competitors in the same industry had been on the rise in recent years. He had to stay sharp.\n\n*There are too many bad guys in the world.*\n\nIn the shadowy corners where he worked, he saw them all—those who harmed others casually, those who killed for twisted reasons.\n\n*Kaaang! Kaaang!*\n\n*Puok! Puk.*\n\n*Suksak.*\n\nHe swung his pickaxe against the walls, dug with his shovel, and laid new bricks. Dark threw himself into the creation of his dungeon, but doubt crept in as he worked.\n\n*What is this feeling? I have a hidden class, but I'm doing hard labor every day?*\n\nHe stared at the pickaxe and shovel—tools he never touched in reality—and felt a surge of dismay.\n\n\"Sigh... Still, I'm glad it's a class that can earn me substantial rewards.\"\n\nDark sighed deeply. He was very much like someone else. That someone was, naturally—\n\n---\n\n\"Magic Missile! Magic Missile! Magic Missile! Magic... Oh! Hey, this piece of—!\"\n\n**Grid.**\n\nGrid had been launching Magic Missile for hours at the iron ore placed on his anvil. He'd already emptied several mana potions and turned to Braham once more for confirmation.\n\n\"Is this real? Can I really learn the Magic Battle Gear Production Method by repeating this?\"\n\nBraham's voice echoed in his mind, patient but slightly amused.\n\n*'That's right. After striking the iron ore 10,000 times, you'll need to strike jaffa ore 10,000 times, then orichalcum 10,000 times... If you continue this process, you'll eventually strike adamantium and bloodstone 10,000 times each. Only then will you be qualified to learn the Magic Battle Gear Production Method.'*\n\n\"Eh...??\"\n\nIt wasn't just iron ore? Grid doubted his ears, but his hands didn't stop. He fired another Magic Missile out of reflex. Then a notification window appeared.\n\n> [Your intelligence has increased by 1.]\n>\n> [Your magic accuracy has increased by 0.01%.]\n\n\"Ohhh!\"\n\nAt least his stats increased from the labor. He was particularly pleased that his **Intelligence** stat was rising.\n\n*'...'*\n\nGrid had been cursing moments ago, and now he was as delighted as a child. Braham found it absurd.\n\n*'Is there really such a simple person in this world?'*\n\nHe wasn't disparaging this simplicity. In fact, Braham believed that Grid's talent stemmed from it.\n\n*'His straightforward personality plays a significant role when he focuses on repetitive work.'*\n\nA huge smile spread across Grid's face as he watched his stats rise. Braham whispered to him once more.\n\n*'Please note—you can learn new magic if your intelligence increases just a bit more.'*\n\n\"R-Really? Okay! Magic Missile! Magic Missile!\"\n\n*Teong! Teong!*\n\n> [Your intelligence has increased by 1.]\n>\n> [Your magic accuracy has increased by 0.01%.]\n>\n> [Magic Mastery has increased from Lv. 5 to Lv. 6.]\n\nThere was compensation. Labor was always right. It didn't matter if it was hard.\n\n\"Pant... pant! Magic Missile! Pant... pant! Magic Missile! Magic Missile!\"\n\nGrid's satisfaction soared. His enthusiasm surged with each stat increase, and he continued hammering the iron ore with Magic Missile. At first, the ore had been damaged or penetrated by the spell, but now it grew firmer with each strike. This was the process of magically training the metal.\n\n---\n\n**Minor.**\n\nHe had been serving Grid since he was a 13-year-old boy. Now the talent forcefully recruited by Grid in Bairan had turned 18. What had he been doing for the past five years? Exploring the continent in search of new and better quality minerals. It was grueling work—finding new minerals while stationed in Reidan had been especially difficult.\n\nBut the power of education was remarkable! His natural talents had blossomed under Grid's forced tutelage, and now, at this very moment, he'd discovered new minerals in the Dravian Mountains—a place renowned as the nest of the Light Dragon Nevartan.\n\n*This is really...! I can feel the aura of a new mineral!*\n\nNow he had good news to bring to Duke Grid.\n\n*No, he's not a duke anymore. He's a king.*\n\nMinor had originally disliked Grid. Minor's pride soared as high as the sky because he was such a unique genius, and he'd thought it shameful to serve a mere duke. He'd believed that only the Emperor of the Saharan Empire was qualified to be his master.\n\nBut his thoughts had changed recently. Despite being a commoner like Minor, Grid had become a great nobleman and even earned the right to become king of a nation. Minor's impression of Grid had shifted dramatically.\n\n*This is someone I can serve.*\n\nMinor was determined to serve Grid faithfully from now on. He would work diligently and learn everything he could.\n\n*Huhuhu... Then one day, I'll become a noble and a king myself.*\n\nFrom now on, his goal was to become the second Grid. Resolved, Minor pulled a pickaxe from his bag. He planned to maximize his achievement by taking the newly discovered mineral directly to Grid. Though Grid used Minor as a minerals detector, Minor himself preferred mining.\n\nMinor—as greedy as Grid and as self-conscious as Lauel—began climbing the Dravian Mountains. He'd developed exceptional mobility skills and raised his **Strength**, **Stamina**, and **Persistence** while exploring the continent over the past several years.\n\n---\n\n\"Magic Missile! Magic Missile! Magic Missile!\"\n\nThe average time it took to use Magic Missile (Enhanced) Lv. 3 was 1.5 seconds. The cooldown was less than one second when used repeatedly, thanks to the spell's near-instant activation. Each cast consumed 420 mana. With his various titles and items, Grid's total **Intelligence** exceeded 1,900, giving him 12,000 mana.\n\nCalculating simply: Grid's mana depleted after using Magic Missile continuously for 40 seconds. There were limits, even with mana potions, due to reuse cooldown timers. In other words, it should have been theoretically impossible for Grid to launch Magic Missile for dozens of minutes without interruption.\n\nYet Grid had already been using Magic Missile for over four hours. This was thanks to the Ring of Absurdity, which reduced resource consumption by 50%.\n\n*This game truly is about items.*\n\nGrid grasped the undeniable truth once more and smiled with satisfaction. The moment his 10,000th Magic Missile struck the iron ore—\n\n> [You have learned the Iron Ore Magic Training method.]\n>\n> [In the future, you can train iron ore with various attack spells. The power and skill of the magic you use will determine the speed of the iron ore training.]\n>\n> [Magically tempered minerals have lower durability than traditionally handled minerals, but there is a possibility that special magic options will be attached. The types of options depend on the magic you use to temper it.]\n\n\"Oh...! Ohh!!\"\n\nGrid's joy pierced the heavens after repeating the same action for 4 hours and 10 minutes. Braham urged him forward as he examined the rewards.\n\n*'Wouldn't it be better to keep using Magic Missile? Next is jaffa ore.'*\n\nPerhaps Braham wasn't aware of his own emotions—his voice sounded excited as well. Grid laughed.\n\n*'I want to see the magic battle gear you can create as quickly as possible.'*\n\nIron ore, jaffa, mithril, orichalcum, black iron ore, blue orichalcum, and finally adamantium and bloodstone. Grid had to strike at least 19 types of metals 10,000 times each. It would take at least a week—accounting for stamina recovery time and Satisfy's connection time limit.\n\nThe same process needed to be repeated for a week or more. It would be torturous and mind-numbing for most people. But it wasn't a big deal for Grid. He wasn't frustrated because it required only patience, not talent. Never giving up was Grid's specialty.\n\n> [Long-term magic use has slowed magic recovery speed and mana deployment speed.]\n>\n> [You are tired. Stamina is consumed more quickly. You have resisted.]\n\n*It might take 10 days instead of a week.*\n\nThe system began interfering, but Grid's expression didn't change. He'd already adapted perfectly to this training.\n\n*Isabel, wait a little longer. I will surely give you the best spear.*\n\nThere was no anxiety. Grid's expression remained calm as he began striking the jaffa ore with Magic Missile. Only those waiting nearby grew nervous.\n\n*'How long is he going to repeat the same thing?'*\n\n*'Isn't he bored? I'm dying of boredom just watching...'*\n\n*'Ugh, my body is tired from standing next to him. I'm getting sore.'*\n\n*'Please go and take a rest...'*\n\nReinhardt's blacksmiths began to fear Grid's obsession. Meanwhile, Damian and Isabel watched Grid as if he were a role model. They thought his spirit was uncommon in this world.\n\n\"Magic Missile!\"\n\n*Jeeeong!*\n\nWhite flashes erupted in the smithy throughout the night. Lauel smiled at the sight from the distant walls.\n\n\"This light is the glorious future that will lead this kingdom. Haha...!\"\n\nA cool breeze swept through the pleasant night."
}