{
  "id": 594,
  "title": "Chapter 594",
  "content": "# Rewritten Text\n\n---\n\nIt was hell. Pure, unrelenting hell.\n\n*One week? Bullshit!*\n\nGrid had spent over a fortnight striking nineteen different metals with Magic Missile. The penalty of using magic continuously was far worse than he'd ever anticipated—a grinding mental erosion that threatened to shatter his sanity.\n\n*And they call this 'striking' metal?*\n\nEvery morning, the moment consciousness returned, he logged in. Every night, he fired Magic Missiles until exhaustion dragged him offline. The monotony ate at him like acid. More than once, Grid's finger had hovered over the quit button. One hundred ninety thousand Magic Missiles. The number alone made his skull throb.\n\n*How can anyone do something this insane?*\n\nThis was nothing like the grueling journey to the North End Cave, nothing like the brutal trial that made him Pagma's Descendant. Back then, anger had fueled him—a white-hot rage that kept his body moving even when stamina and concentration failed. He'd wanted to forget those desperate days. But now? Now there was no rage to sustain him. Only the soul-crushing repetition of the same spell. Again. And again. And *again*.\n\n*No... I can't give up now.*\n\nHis hands clenched. Quitting meant wasting every agonizing hour he'd already invested. Grid's stubborn nature couldn't stomach that kind of loss. More than anything else, though—\n\n\"Grid...\"\n\nHe looked up. Isabel's face was pale, drawn tight with guilt. She couldn't even meet his eyes.\n\nHis jaw set. *I won't give up.*\n\n*Crack!*\n\nGrid's trembling hand rose. Another Magic Missile screamed from his palm.\n\nOne hundred times. Two hundred. Five hundred. A thousand. Five thousand. Ten thousand strikes in a single day...\n\nAt some point, he stopped counting. Numbers became meaningless. There was only the furnace's heat, the flash of magic, and the relentless *thunk* of spell against metal.\n\n\"Grid! Stop! That's enough!\"\n\nIsabel's voice shattered through his trance. When had she moved closer? Her face was ghost-white, eyes wide with horror as blood dripped from Grid's lips.\n\n\"I can't—I won't let you suffer anymore because of me!\"\n\nGrid's hand rose again. It shook violently.\n\n*Jeeeeong!*\n\nThe Magic Missile struck adamantium.\n\n> [The quest has succeeded!]\n>\n> ['Magic Battle Gear Production Method' has been acquired.]\n\nThe notification blazed across his vision—the 190,000th strike.\n\n> **[Magic Battle Gear Production Method Lv. 1]**\n>\n> Metal can be tempered with magic attacks. Items crafted from this metal have a chance to develop magic options.\n>\n> * The rating of magically enchanted metal ranges from normal to legend. Higher ratings produce stronger, more varied magic options.\n> * Level 1 production. Only Magic Missile can be used to temper metal.\n> * To raise the level of Magic Battle Gear Production Method, you must learn to temper metal with higher-rated spells.\n\n\"Good.\" Grid wiped the blood from his mouth with the back of his hand. His gaunt face split into a smile. \"Very good.\"\n\nThe sweetest rewards always came at the end of the longest roads.\n\n\"Isabel.\" He turned to her. \"Are you ready to enjoy your happiness?\"\n\n\"G-Grid...\"\n\nTears spilled down Isabel's cheeks. All her life, she'd sacrificed herself for Goddess Rebecca—the deity she loved and believed in above all others. But now... now a savior had appeared.\n\nWith each passing moment, Grid's existence grew more precious to her. The gratitude swelling in her chest, the respect, the absolute trust—they towered over even her devotion to Rebecca.\n\n*Wait a second.*\n\nGrid's pride in Isabel's joy lasted exactly three seconds before a cold dread seeped into his gut. He read the skill description again.\n\n*To raise the level of Magic Battle Gear Production Method, you must learn to temper metal with higher-rated spells.*\n\n*Hey, Braham. About raising the skill level... don't tell me—*\n\n*'Your guess is correct.'* Braham's voice was insufferably smug. *'Eventually, you'll learn new magic and fire it at every mineral ten thousand times each.'*\n\n\"...\"\n\nGrid could endure 190,000 Magic Missiles only because the spell was cheap and quick. Mana cost? Minimal. Casting time? Instant. But 190,000 casts of higher-tier magic? The resource consumption alone would be catastrophic. The casting delays would stretch the torture over months, maybe years.\n\n\"Hah...\"\n\nGrid's sigh could have extinguished the furnace. He felt like a man who'd conquered a mountain, only to discover it was the smallest foothill of an entire range.\n\n---\n\n## * * *\n\nRecently, Brazil's real estate market had been suffering.\n\nThe culprit? Jishuka.\n\nShe'd accumulated massive wealth from Satisfy, and now she was liquidating everything—land, buildings, properties of every description. The sales were rushed, frantic even, with prices slashed well below market value just to convert assets into cash quickly.\n\nSpeculation ran rampant.\n\n*Jishuka received insider information about a Brazilian real estate crash and got out early.*\n\n*She's addicted to drugs and needs money for her habit.*\n\n*She's moving to South Korea to be with Grid. Marriage is imminent.*\n\nThe rumors grew more outlandish by the hour. Eventually, the media circus descended. Brazilian outlets lined up for interviews, checkbooks in hand.\n\nJishuka accepted. The payment was good, and she had no reason to hide.\n\n\"Your recent actions have caused considerable unease among the Brazilian people,\" a reporter began, camera lights glaring. \"Can you explain why you're disposing of your real estate so hastily?\"\n\n\"I'm buying an item.\"\n\n\"Excuse me?\"\n\n\"An item. In Satisfy.\"\n\nThe reporter blinked. \"An... item in Satisfy?\"\n\n\"Yes.\"\n\n\"...I'm sorry, could you clarify?\"\n\nJishuka's real estate portfolio was estimated at nearly sixty million dollars—capital enough to launch a major corporation. She was converting *all of it* to buy a single *game item*?\n\n\"Are you commissioning Grid to craft you a full set of equipment?\" another reporter ventured, desperately seeking rationality. \"Head to toe in legendary-rated gear?\"\n\nThat would make sense, at least. Grid was a legendary blacksmith. A complete armor set from him would justify astronomical expense—the investment would pay for itself in monster hunting and content monopolization.\n\nJishuka shook her head.\n\n\"It's for one bow.\"\n\nSilence.\n\nThe article went viral within hours. Internet forums around the world exploded.\n\n—*Won't Grid become the world's wealthiest person at this rate?*\n\n—*Grid is really something else...*\n\n---\n\n## * * *\n\nThe Yatan Church.\n\nEternal enemy of the Rebecca Church. Their purpose: summoning the great demons to the mortal realm. To achieve this, they had to eliminate Rebecca's Daughters—the divine maidens whose very existence suppressed demonic influence across the continent.\n\nBut the Rebecca Church was powerful. Too powerful. Its vast reach placed crushing restrictions on Yatan operations, forcing the dark church into perpetual shadow.\n\nFor this reason, every Yatan follower carried the quest: **'Kill Rebecca's Daughters (SSS-rank)'**\n\nEasy? Hardly.\n\nRebecca's Daughters were devastatingly strong. As incarnations of divine power, they were natural predators to black knights and black magicians alike. Killing them was theoretically impossible.\n\nBut opportunity had arrived.\n\nIsabel—one of the most formidable Daughters of this generation—had been critically weakened in battle against Great Demon Belial.\n\n\"Great Monarch Belial sacrificed herself for this opening.\" One Yatan Servant's voice dripped with satisfaction.\n\n\"Isabel is barely clinging to life,\" another agreed. \"We need only send the believers.\"\n\nHidden temples scattered across the continent would relay information. They'd locate Isabel quickly.\n\nAround the table, the Yatan Servants smiled.\n\n---\n\n## * * *\n\nYatan followers were ranked in eight classes.\n\nEighth-grade believers possessed strength comparable to common kingdom soldiers. First-grade believers, however, commanded terrifying power—only one hundred existed across the entire church. Their combat ability rivaled the Yatan Servants themselves.\n\n\"There.\" Bon's eyes gleamed in the darkness.\n\n\"The defenses are weak after the war,\" Adus confirmed.\n\nThe two first-grade believers had successfully infiltrated Reinhardt. In the chaos following the recent conflict, the city's guard system remained incomplete. Controlling the flow of outsiders was nearly impossible.\n\n\"Where's Isabel?\"\n\n\"Unknown. We'll need to measure divine power.\"\n\nThey pressed themselves against the shadowed walls. Dark magic coalesced in their palms—a precursor to Magic Detection. When powered by black magic, the spell became especially effective at detecting divine energy.\n\nWithin minutes, they'd located Isabel.\n\n\"Her power is as weak as the intelligence suggested.\"\n\n\"We might not even need to reveal ourselves.\"\n\n\"No.\" Bon's tone hardened. \"This mission requires certainty. We handle it personally.\"\n\n\"Unfortunately, you're right.\"\n\nIsabel's divine power flickered like a candle in the wind—her life force fading. She was so weakened that using White Transformation would likely kill her outright.\n\n*Suuuk.*\n\nBon and Adus melted into the darkness, their forms dissolving like smoke. Their destination: a smithy on Reinhardt's northern edge.\n\n\"I see her.\"\n\nThey observed from the shadows. Despite the late hour, the furnace blazed bright, illuminating a blacksmith at work. Isabel sat nearby, watching.\n\n\"What is she doing?\"\n\nA Rebecca's Daughter, mortally wounded, idling in a smithy? The scene made no sense.\n\nThen understanding dawned. Confused expressions transformed into predatory grins.\n\n\"Her spear must be broken.\"\n\n\"Lifael's Spear? Rebecca's divine artifact is damaged?\"\n\n\"Great Monarch Belial dealt a devastating blow indeed.\"\n\n\"Ah!\"\n\nEverything clicked into place. Isabel was wounded and couldn't return to the Vatican. Her divine weapon required urgent repair—so damaged she'd been forced to seek help in Reinhardt.\n\n\"This is an even greater opportunity than we thought.\"\n\nIsabel, weakened. Her divine weapon, broken. Killing her would be as simple as swatting a fly.\n\nBon and Adus exchanged a glance.\n\n*Kwa kwa kwa kwang!*\n\nBlack magic detonated. The smithy's wall exploded inward, showering the workspace with debris.\n\n\"Kuahahat! Rebecca's dog dies tonight!\"\n\nThey lunged forward, swords of condensed black magic screaming toward Isabel's throat.\n\nThe blades never reached her.\n\n\"What—?\"\n\nThe blacksmith. The figure they'd dismissed as irrelevant, hammering away at the golden spear in front of the furnace.\n\n*Paijijik!*\n\nDozens of Magic Missiles erupted from the golden weapon.\n\n\"Impossible!\"\n\n*Pepepepeok!*\n\nThe bombardment struck like artillery. Bon and Adus reeled, confusion turning to horror. These weren't ordinary Magic Missiles—divine power radiated from each projectile, rendering their dark shields utterly useless."
}