{
  "id": 595,
  "title": "Chapter 595",
  "content": "\"Gaaah!\"\n\n\"W-What is this...?!\"\n\nSweat and dust caked the face of the black-haired man hunched over his anvil. Every strike of his hammer rang true against the spear shaft—no wasted motion, no hesitation. He looked like any ordinary blacksmith absorbed in his craft.\n\nYet he wielded Rebecca's divine weapon. And from it, magic erupted.\n\n*What in the world IS this blacksmith?*\n\n*Could a Rebecca paladin have disguised himself? Spent years honing blacksmithing skills just for this moment?*\n\nCommon sense dictated that the weakened Isabel should have fled to the Vatican immediately. How could the Rebecca Church leave her unprotected, knowing full well the Yatan Church hunted her?\n\n*Wait—does it even make sense for a paladin to train in blacksmithing?*\n\n*No, you've forgotten how cunning those Rebecca bastards are! It's absolutely possible. We've walked straight into this angelic bitch's trap!*\n\n*R-Right!*\n\nBon and Adus bristled with indignation. Black magic knitted their wounds closed as they glared at Isabel and the blacksmith.\n\n\"Just like the Rebecca dogs,\" Bon spat. \"Setting a trap to lure prey?\"\n\n\"...?\"\n\nIsabel blinked in confusion at their accusation. Grid simply laughed. Arguing with people who'd launched a surprise attack seemed pointless. He'd dealt with ridiculous situations more than once or twice by now.\n\n\"Yeah, that's right. It's a trap.\" His grin widened. \"So just die already. Your fate was sealed the moment you stepped inside.\"\n\nGrid's smile grew. An opponent to test the reconstructed Lifael's Spear on—perfect. His casual arrogance made Bon and Adus' eyes twitch.\n\n*He's laughing? At two of the most talented members of the Yatan Church?*\n\nFewer than two hundred first-grade followers existed across the entire organization. The qualification requirements were brutal. While they might lack expertise in theology, intelligence work, politics, or military strategy, their combat ability rivaled the Yatan Servants themselves. Bon and Adus carried immense pride in that distinction. Even against Isabel one-on-one, they refused to believe they'd be pushed back.\n\n\"The hyena might dig a trap,\" Adus snarled, \"but it can't hunt a lion!\"\n\n\"You think Isabel can stop us in her current state?\" Bon added.\n\n*Boom!*\n\nAdus' black magic detonated. A shockwave tore through the smithy's interior, rattling the walls like an earthquake. The furnace flames roared higher, engulfing the workspace in a sea of fire.\n\nAmid the inferno, Grid's smile only widened.\n\n*Perfect. These are exactly the opponents I need.*\n\nGolden text floated above Bon and Adus' heads—named NPCs. Strong ones. Any normal player would flee from a confrontation with them.\n\nBut Grid wasn't normal. Among the hidden classes, his unique skills placed him in a league of his own. He'd already slain multiple Yatan Servants. First-grade followers? They weren't in his weight class.\n\n\"Let's begin the test.\"\n\nHe gripped Lifael's Spear, white light coiling along its shaft.\n\n---\n\n> **[Lifael's Spear]**\n> \n> **Rating:** <span class=\"myth\">Myth</span>\n> \n> **Durability:** 990/990\n> \n> **Attack Power:** 1,530~2,190\n> \n> * **Divine Power** +2,000\n> * All stats +200\n> * 250% increase in health recovery\n> * Fixed damage of +5,000 on each attack\n> * High probability of activating 'Light Wheel.' Each activation fires Magic Missiles (quantity based on Light Wheel range). Magic Missile damage: 4,000 per hit (+50% vs. evil targets). No mana consumption.\n> * High probability of 'Shield of Light' activating when defending or evading. Magic Missile (Enhanced) attached to Shield of Light. Targets that pierce the shield are struck by Magic Missile (4,000 damage, +50% vs. evil). 100% accuracy. No mana consumption.\n> * High probability of activating 'Light of Guidance' when moving\n> * Enables use of 'Weakened White Transformation'\n> * Attack power +30% against black magic users\n> \n> One of the three divine artifacts of the Rebecca Church. Contains divine power too potent for human bodies to withstand. However, the blacksmith Grid has suppressed this power through technological means. Tempered by legendary enhanced magic, Lifael's Spear is now stronger than ever before.\n> \n> **Conditions of Use:** Rebecca's Daughter\n\n---\n\n*Whoosh!*\n\n*Thrust!*\n\nGrid spun the spear and drove it forward. He'd once tried copying Pon's techniques through pure observation. Now, with Weapons Mastery, his spear handling flowed naturally.\n\n*Something's wrong...*\n\nBon and Adus hesitated mid-charge. A sense of wrongness crept over them.\n\n*Aren't Rebecca's Daughters the ONLY ones who can wield the three divine artifacts?*\n\nThe information wasn't confirmed—but throughout the Rebecca Church's entire recorded history, only Rebecca's Daughters had wielded these weapons. Yet now this male blacksmith... no, this paladin disguised as a blacksmith, held Lifael's Spear?\n\nGrid rushed them while they stood frozen in confusion. The spear wasn't his primary weapon, and Bon and Adus were formidable opponents. He couldn't afford to waste this opening.\n\n\"You dare!\" they roared in unison.\n\nAs Grid closed the distance and swung, they scoffed at his technique—a slash instead of a proper thrust.\n\n*This slow attack can't possibly touch us—!*\n\nTheir confidence evaporated. The golden arc traced by Lifael's Spear erupted into dozens of white flashes.\n\n*Another spell?!*\n\n*How is this possible?!*\n\nMagic Missile was the most basic spell imaginable—yet dozens fired simultaneously in rapid succession. And these weren't ordinary Magic Missiles...\n\n*Crack-crack-crack-crack!*\n\n\"Gaaah!\"\n\n\"It hurts!\"\n\nEnhanced Magic Missiles!\n\n\"Ugh... how can Dark Shield be penetrated by mere Magic Missiles?!\" Bon gasped.\n\nAll things had limits—magic included. A pebble couldn't shatter a boulder. The lowest-grade Magic Missile shouldn't pierce Dark Shield, a superior defensive spell.\n\n*Unless his magic power exceeds ours by tens or hundreds of times...!*\n\nChills raced down Adus' spine. Was this an elder priest of the Rebecca Church? The blacksmith's physical strength might be inferior, but his magic power completely overwhelmed theirs.\n\n*We've been deceived!*\n\nSwinging Lifael's Spear was just a feint. He was a priest, not a paladin—a senior priest at that!\n\n*That's why his spearwork is so crude!*\n\nThe blacksmith drew their attention to the weapon itself, a distraction while his true attack came through magic. Bon and Adus adjusted their strategy as Grid swung again.\n\n*We won't fall for it twice!*\n\nThey smiled, ignoring the spear entirely as they charged Grid directly. Their confidence stemmed from certainty—Grid's spear couldn't touch them.\n\nThe result?\n\n*Shunk!*\n\n*Thud!*\n\n\"Cough!\"\n\n\"Eek!\"\n\nA single strike. Grid's spear tore through their armor like parchment, punching deep into their shoulders. The destructive force dwarfed the Magic Missiles.\n\n\"Y-You...!\" \n\nBon and Adus finally grasped the severity of their situation. Grid's true identity crystallized in their minds.\n\n\"Tem—!\"\n\nA secret weapon cultivated by the Rebecca Church.\n\n\"—Templar!\"\n\nFew in number, but if left unchecked, they could rival Rebecca's Daughters. Grid shook his head at the astonished pair.\n\n\"I am Overgeared.\"\n\n\"...!!\"\n\n*Whooom!*\n\nGrid swung the spear again. He'd stubbornly slashed until now—but this time, he thrust. The attack maximized the spear's reach, speed and power unmatched.\n\n\"Ugh!\"\n\nAdus desperately raised his sword to block. The thrust had to be stopped—\n\nBut just before impact, Lifael's Spear curved mid-strike, slamming into Adus' exposed flank instead. Light Wheel activated.\n\n---\n\n> **[Light Wheel]**\n> \n> Stabbing, slashing, cutting—any attack type links into a circular strike. The target cannot escape this irregular assault.\n> \n> * 100% hit rate\n> * Contains light attribute\n\n---\n\n*Thud!*\n\n\"Kyaaah!\"\n\nAdus screamed as the attack's trajectory warped impossibly. Bon, standing beside him, suffered equal devastation. As Grid struck Adus, Magic Missiles erupted from the golden trail and peppered Bon.\n\n*Crack-crack-crack-crack!*\n\n\"Ughhh...! Nngh...\"\n\n*Thump.*\n\n*Thud-thud-thud.*\n\nThe furnace flames climbed higher. Adus and Bon's groans mingled with Isabel's awed gasp. As named NPCs, they struggled back to their feet.\n\n\"Overgeared!\"\n\nYes—they remembered now. The Slaughterer of Yatan's Servants. The man who'd killed Malacus, Neberius, Dark Bus, and even the First Servant Tallos. The gravest threat the Yatan Church had ever faced.\n\n\"Grid... you're Grid.\"\n\nBon and Adus knew Reinhardt had become Grid's territory after the war. But they'd never imagined the blacksmith repairing the Rebecca Church's divine artifact would be *him.* It defied logic—Grid had achieved a major rank, and rumors claimed he used Blackening. How could someone wielding demonic power also handle an artifact saturated with Rebecca's divine essence?\n\n\"Who the hell *are* you?\"\n\nBlacksmith and swordsman.\n\nSwordsman and magician.\n\nA wielder of divine magic and demonic power both.\n\nGrid met their confused stares with a simple answer.\n\n\"Overgeared King.\"\n\nThe identity was already established, thanks to the Overgeared Guild. Soon, the Overgeared Kingdom would follow. Grid intended the world to know him by that title.\n\n*What does 'overgeared' even mean?*\n\nStrong doubt filled Adus and Bon's minds. But their wounds had fully healed—Grid's performance test was complete.\n\nHe handed Lifael's Spear back to Isabel.\n\n\"You can use White Transformation freely now. As long as you have enough mana.\"\n\nThe spear no longer consumed health. Tamer than before—but still devastating.\n\n\"Be strong, Isabel.\"\n\nHe wanted to rest. Dealing with Bon and Adus properly might prove slightly dangerous right now. The story would be simple if he used Belial's Power from the Rune of Darkness—but Grid had no intention of tapping that extraordinary strength while this exhausted.\n\nGrid clasped Isabel's hand briefly, then left the smithy. Behind him, Isabel activated Lifael's Spear's White Transformation. Having completely overcome her fear of death, the power she unleashed was unfathomable.\n\n---\n\n> **[The quest has succeeded!]**\n> \n> **[You have gained 1 point in Deity from the quest reward.]**\n> \n> **[Isabel deifies you even more. Isabel will even become hostile to Goddess Rebecca for you if required in the future.]**\n> \n> **[Isabel will give you the loot acquired from Bon and Adus.]**"
}