{
  "id": 598,
  "title": "Chapter 598",
  "content": "# Chapter: Meritorious Retainers\n\nThe Overgeared Guild had won. Against Belial, against the Eternal Kingdom, against impossible odds—they had triumphed and laid the foundation for their own nation. Every member had played their part, each contributing to the victory that made this dream possible.\n\nGrid understood that better than anyone. Which was why he wanted to reward them all with magic battle items crafted by his own hands.\n\nThe problem was, it simply wasn't feasible. Not in terms of time, and certainly not in terms of capital. Lauel made sure Grid understood that, his objections sharp and unrelenting.\n\n\"Do you even know what a meritorious retainer *is*?\" Lauel's voice carried an edge of exasperation. \"It's not just 'someone who worked hard.' It refers to subordinates who built exceptional merit during a nation's founding. If you treat everyone the same regardless of their actual contributions, you'll strip the title of all meaning.\"\n\nGrid frowned. \"It feels wrong, though. Like I'm leaving people out.\"\n\n\"And if you give the same reward to those who risked everything and those who didn't?\" Lauel countered. \"The people who sacrificed more will feel cheated. Is that what you want?\"\n\n\"No, of course not.\"\n\n\"Then you need to be selective.\"\n\nGrid let out a slow breath. Lauel was right, as usual. *This isn't a communist utopia. Equal compensation for unequal contributions doesn't work.* Even in raids, rewards were distributed based on contribution. It had to be the same here.\n\nHe pulled up the contribution records and began his review, forcing himself to set aside personal feelings and evaluate objectively.\n\n*First on the list... Katz.*\n\nIt was strange to think about. When they'd first met, Katz had been insufferable—a right-wing nationalist who'd openly disparaged Koreans. Grid had barely been able to stomach working with him. But then Katz had done something rare: he'd admitted he was wrong. He'd withdrawn his hateful comments and apologized sincerely. More than that, he'd changed his entire worldview, abandoning his prejudices and even creating job opportunities for Koreans living in Japan as a form of atonement.\n\nSince joining Overgeared, his performance had been nothing short of spectacular. During this war, he'd held Borneo with only a thousand troops, single-handedly repelling the Gauss Kingdom's invasion.\n\n*Thanks to him, we could focus entirely on the war and the raid.* If Borneo had fallen, the Eternal Kingdom would have allied with Gauss, and Overgeared would have been encircled and crushed.\n\n*Katz absolutely deserves to be recognized.*\n\nSecond was Jishuka. She'd defended Patrian until Grid's arrival, then dominated the battlefield once she'd received the Red Phoenix Bow. She'd devastated the Eternal forces and turned the tide of the Belial raid by healing critically wounded allies when it mattered most.\n\n*And Piaro.* Without him, the Belial raid would have been impossible.\n\n*Asmophel's contributions were massive too.* Grid had reviewed the war footage carefully, studying every action Asmophel had taken during that legendary battle where he'd faced a hundred thousand enemies. The man had assassinated enemy commanders, infiltrated hostile forces to gather intelligence, and sown chaos at every turn.\n\n*If he hadn't killed those commanders, I might have died in that battle.* And if Grid had died, he wouldn't have made it to the Belial raid in time. Piaro would have fallen. The guild would have been destroyed.\n\nBut there was a complication.\n\n*I have to pretend I don't know.*\n\nIt felt wrong, even cruel, but Asmophel's passive skill—**Determination of the Number Two**—only activated when he needed to prove himself. The moment Grid acknowledged him as first among retainers, that skill would weaken, and his growth rate would plummet.\n\nGrid rubbed his temples. *I'm not excluding him from the list entirely. He's still a pillar of this kingdom. But giving him a formal title will diminish his potential...*\n\nHow was he supposed to handle this?\n\n*I'll talk to Lauel about it.* That was always the answer, wasn't it? When Grid couldn't solve something alone, Lauel would find a way.\n\nA warm gratitude swelled in his chest—a feeling that had become so habitual he barely noticed it anymore. *Thank god for Lauel.*\n\nWith the list of meritorious retainers complete, Grid set out to meet with each of them personally.\n\n\"What item would you like me to make for you?\" he asked each one.\n\nTheir requests varied. Some wanted weapons that would maximize their class strengths. Others needed armor to boost survivability. A few requested farming equipment to increase efficiency. But they all shared one sentiment:\n\n\"If I can get a Grid-crafted magic item, I'll grow faster than ever before.\"\n\n\"Leave it to me.\"\n\nTheir trust lit a fire in him. After gathering the necessary materials, Grid asked Sticks to teleport him to Reidan. There, alongside Khan and the Reidan blacksmiths, he fired up every furnace in the city, feeding them generously with white phosphorus wood.\n\n\"Intermediate blacksmiths, keep the furnaces burning at optimal temperature,\" Grid instructed. \"Advanced blacksmiths, refine the iron ore. Khan, you're with me.\"\n\nOne of the smiths raised a hand. \"What about the beginner blacksmiths?\"\n\n\"Have them observe and learn.\"\n\nConfusion rippled through the workshop. A beginner blacksmith could handle one-person smithy operations. An intermediate blacksmith could work as a private craftsman. An advanced blacksmith possessed the skill to serve in a palace forge. Yet Grid was having intermediates tend fires, advanced smiths smelt ore, and Khan—a **craftsman-grade** blacksmith who could work in the Empire itself—serve as an *assistant*?\n\nThe smiths exchanged bewildered glances. But not one dared question Grid's orders.\n\nOnce they watched him work, they understood. Even Khan couldn't match the precision, the artistry, the sheer mastery on display.\n\n*I'll reach intermediate rank soon, thanks to Grid's guidance,* one thought.\n\n*It's the greatest honor to do menial work for someone like him,* thought another.\n\nThey stopped questioning. They simply learned.\n\n\"Father, fighting!\"\n\nLord appeared at the smithy entrance, clutching Irene's hand. He flashed Grid a bright smile—the cheer he'd picked up from Aunt Ruby—and pulled out a tiny hammer, mimicking his father's stance.\n\n*Ttang! Ttang!*\n\n*Tatang! Tang!*\n\nThe sound of hammers—one deep and resonant, one high and eager—rang through the forge. Father and son, side by side.\n\nIrene watched them both, her face radiant with joy.\n\n---\n\n## Baron Kons' Miscalculation\n\n\"I can't *wait* to see the look on Grid's face.\"\n\nBaron Kons leaned back in his carriage, grinning as the wheels carried him toward Reinhardt. He imagined Grid's shock, his frustration, when informed that he'd need to pay tribute to fifteen kingdoms—including Gauss.\n\n\"Building a kingdom isn't child's play,\" Kons muttered smugly. \"If it were that simple, the continent would be drowning in petty nations by now.\"\n\nHe chuckled, savoring the mental image of Grid's despair.\n\n\"We've arrived, my lord.\"\n\nThe carriage came to a halt before Reinhardt Palace.\n\nBaron Kons stepped out—and froze.\n\n\"What...?\"\n\nReinhardt showed no signs of war. The streets were immaculate, the walls pristine, the city bustling as though it had never seen conflict.\n\n*They repaired all this already?* Kons frowned. *Did he work the people like slaves?*\n\nThat had to be it. The fool Grid had pushed too hard, too fast. It was only a matter of time before the people's resentment boiled over and tore this fledgling kingdom apart from within.\n\n\"Tsk. Oppressing your citizens before you've even stabilized. As expected, not just anyone can be a king.\"\n\n\"Excuse me, sir.\"\n\nA knight approached—clad in sturdy black armor that gleamed despite the overcast sky.\n\n\"Are you Baron Kons of the Gauss Kingdom?\"\n\n\"I am.\"\n\nThe knight scratched the back of his neck sheepishly. \"You don't need to be so formal with soldiers like us.\"\n\n\"Yeah, relax,\" another added. \"We're just regular troops.\"\n\nBaron Kons blinked. \"...What?\"\n\n*Soldiers?* These men wore armor finer than most knights in Gauss. Their discipline, their bearing—it was absurd to call them mere soldiers.\n\n*Who are they trying to fool?*\n\nAnger bubbled beneath Kons' confusion. *They're trying to intimidate me. Overgeared wants me to think even their rank-and-file troops are elite.*\n\n*Pathetic.*\n\nShaking his head, Baron Kons strode into the palace garden.\n\n*There won't be anyone important here,* he reassured himself. *What renowned figure would attend the founding of a kingdom built by a traitor?*\n\nThe event would either be empty or filled with nobodies trying to curry favor.\n\nBut then—\n\n\"Oh, Your Holiness, look at that statue! Brother Grid's likeness is captured beautifully.\"\n\n\"It would be fitting to place a statue of Goddess Rebecca beside it, don't you think?\"\n\n\"Grid would never pay for that.\"\n\n\"Huhu, Your Holiness, don't be cruel. Brother Grid has contributed so much to the Rebecca Church. I'm certain he wouldn't oppose honoring the Goddess. We'll commission it regardless.\"\n\nBaron Kons' breath caught in his throat.\n\nFifteen middle-aged men dressed in the ceremonial robes of the **Rebecca Church Elders** surrounded a young man they were addressing as... *the Pope?*\n\n*Impossible!*\n\nThe Pope and the Elders—figures so esteemed that even the Emperor of Saharan couldn't summon them at will—were attending the founding of the *Overgeared Kingdom*?\n\n*It's a scam. It has to be.* Grid must have dressed up his own people to impersonate the Church leadership.\n\nThe Pope's authority was unquestionable, but the Elders were notoriously reclusive. Even King Cactus had to travel to the Vatican personally just to meet with them. Yet they were here? For *Grid*?\n\n\"Excuse me.\"\n\nA group brushed past Baron Kons, breaking his spiraling thoughts.\n\n*What's that smell?*\n\nHe wrinkled his nose—brine and seaweed. Glancing over, he caught sight of the group and recoiled as though he'd seen a ghost.\n\n*The Water Clan?!*\n\nThe Water Clan lived in Siren, deep beneath the ocean. They were renowned for their powerful magic, and countless kingdoms—including Gauss—had sought alliances with them. But the Water Clan despised humans. They turned away envoys even in their darkest hours.\n\nYet here they were. At the Overgeared Kingdom's founding ceremony.\n\n*No. This can't be real.*\n\nMaybe they were here for another reason. Maybe Grid owed them a debt.\n\nBut then—\n\n\"His Majesty, King Maxong of the Water Clan, is entering!\"\n\n\"?!?!?!\"\n\nBaron Kons spun toward the garden entrance, eyes wide.\n\nThe figure who entered was massive, towering over the other Water Clan members. His presence radiated majesty and power, commanding the space effortlessly.\n\n*It... it really is the King!*\n\nKons watched, paralyzed, as King Maxong approached the group he'd thought were imposters.\n\n\"Hello, King Maxong,\" the young Pope greeted warmly.\n\n\"Your Holiness, it's been too long. Have you seen Grid yet?\"\n\n\"Not yet, I'm afraid.\"\n\n\"...\"\n\nBaron Kons' knees felt weak. *They're real. The Pope and Elders are actually here.*\n\nAnd if that was true, then the rumors...\n\n*Did a great demon really descend on Reinhardt? Did Grid and the Pope truly defeat it together?*\n\nThe story had spread across the continent—that Grid had slain a great demon. But no one had believed it. Great demons existed to annihilate humanity. Even a legend shouldn't be capable of such a feat. Everyone assumed Grid had fabricated the tale to inflate his reputation.\n\nNow, Baron Kons wasn't so sure.\n\n*King Cactus... I... I can't do this.*\n\nHis mission had been simple: attend the founding ceremony and demand tribute on behalf of fifteen kingdoms. But how could he make such a demand when the *Pope* and the *Water Clan King* were in attendance?\n\nThe task that had seemed so straightforward now felt utterly, impossibly insane."
}