{
  "id": 599,
  "title": "Chapter 599",
  "content": "\"All fifteen kingdoms sent envoys?\" Lauel's brow furrowed as he reviewed the intelligence report. \"Everyone except the Saharan Empire?\"\n\nThe Overgeared guild members erupted in confusion. They'd refused the founding ceremony invitations—so why dispatch representatives now?\n\n\"They think they can walk all over us!\" Peak Sword slammed his fist on the table.\n\nJishuka's fingers drummed against her bow. \"It's annoying, but it might not be entirely bad. If they sent representatives, at least they're willing to negotiate.\"\n\n\"Negotiate?\" Ibellin's skepticism was evident in his voice. \"These are the same bastards who rejected our kingdom's legitimacy. What changed?\"\n\n\"Maybe they finally realized Grid's power?\" someone suggested.\n\n\"The Overgeared Kingdom will eclipse the empire one day,\" Vantner declared, puffing out his chest. \"They're trying to get in our good graces early. Puhuhu!\"\n\n\"They've finally recognized our king's greatness!\" Peak Sword added. \"Puhahahat!\"\n\nThe meeting room's energy spiraled upward with each declaration, optimism feeding on itself.\n\nLauel's cold voice cut through the enthusiasm like a blade. \"That's impossible.\"\n\nEvery head turned toward him.\n\n\"They'll deny our legitimacy until the bitter end,\" he continued, leaning back in his chair with a predatory smile.\n\n\"Then why send representatives at all?\" Regas asked, confusion written across his scarred features.\n\n\"Isn't it obvious?\" Lauel's smile widened, serpentine. \"I've already deduced their intentions with one hundred percent certainty. This—\" he tapped the report, \"—is an opportunity. A very good opportunity.\"\n\nThe guild members exchanged uncertain glances as Lauel studied the list of representatives, looking like a snake sizing up prey.\n\n***\n\nAn hour after the Gauss Kingdom's representative arrived, the remaining fourteen envoys congregated in Reinhardt's palace district. Baron Cudan of the Murray Kingdom surveyed the crowds with widening eyes.\n\n*There are far more people than I expected.*\n\nReinhardt Palace, where the founding ceremony would occur, teemed with activity. Everywhere he looked, masses of people filled the streets and squares. For a kingdom allegedly without foundation, the turnout seemed... impossible.\n\nThe Ultana Kingdom's representative shrugged beside him. \"Aren't they just creating the illusion of importance? Look at the faces around us—not a single person of consequence.\"\n\nBaron Cudan scanned the crowd more carefully. The man was right. Broadcasters and their staff comprised the majority. The rest appeared to be users of low to middling reputation. In the eyes of an established noble, they were nobodies.\n\n\"Where is Baron Kons?\" Baron Cudan asked. \"The Gauss representative who arrived earlier?\"\n\nA knight in black armor approached their group, his movements fluid and assured. \"He suddenly required the restroom. Something about an upset stomach. May I assist you?\"\n\n\"Ah... no, that's fine.\"\n\nBaron Cudan's practiced eye catalogued the knight's equipment automatically. Both armor and weapons were exceptional quality—far beyond what a fledgling kingdom should afford.\n\n*I thought they'd need every coin for the founding ceremony itself...*\n\n\"The Overgeared Kingdom has more capital than anticipated,\" murmured the Arc Kingdom's representative.\n\n\"Impossible,\" another scoffed. \"It's all show. They're just dressing their knights in fine equipment for the guests.\"\n\n\"But there are hundreds of them dressed identically...\"\n\nThe representatives' gazes swept across the venue. Black-armored knights stood at regular intervals throughout the palace grounds. Baron Cudan counted silently—close to a thousand.\n\n*What? Even the Saharan Empire doesn't maintain such numbers in one location.*\n\nA ripple of unease spread through the diplomatic delegation. The silence stretched until Baron Briton of the Arc Kingdom spoke, his voice trembling with righteous anger.\n\n\"Grid is a wicked man.\"\n\n\"What do you mean?\"\n\n\"Think about it.\" Baron Briton's face reddened. \"How can a new nation field so many knights without exploiting its people? These thousand were raised by squeezing the blood from commoners. It proves Grid treats his subjects as less than cattle.\"\n\nSome representatives shifted uncomfortably, clearly unconvinced. Baron Cudan, however, felt fury ignite in his chest.\n\n*What a demon!*\n\nA man who'd betrayed his kingdom and murdered his king. A vicious demon. And these people would recognize his stolen crown?\n\nBaron Cudan's hand drifted to his sheath. *For the peace of the continent, wouldn't it be better to end him here?*\n\nHis killing intent leaked out, sharp and predatory. The aura made nearby attendees stumble back. The other representatives noted it with approval.\n\n*Murray's Lion isn't just reputation,* one thought. *What fearsome sword energy.*\n\nBaron Cudan's fame rested on fighting two of the empire's Black Knights simultaneously—and surviving. Though his upright nature had prevented political advancement, his swordsmanship was renowned across the continent.\n\n\"Put away your sword energy.\"\n\nBaron Cudan's focus snapped to a soldier approaching from his left.\n\n\"You're emitting sword energy in a foreign palace,\" the blond man continued, his tone mild but firm. \"As a representative, you should understand basic courtesy.\"\n\nThe soldier wore shabby leather armor that looked ready to tear. When he scratched at a worn seam absently, flakes of old material crumbled away. Baron Cudan's eyes narrowed. The Overgeared Kingdom treated its soldiers this poorly while knights paraded in exceptional armor?\n\n*All show and no substance,* several representatives thought. *Grid's just putting on airs.*\n\nBaron Cudan, however, had gone deathly pale.\n\n*What is this soldier?*\n\nThe blond man looked... ordinary. Compared to the black-armored knights stationed throughout the venue, he seemed almost beneath notice. Yet standing before him, Baron Cudan felt the hairs on his neck rise. The sword energy he'd been so proud of—that had made lesser warriors cower—withered in the soldier's presence like grass before wildfire.\n\n*How can a common soldier emanate such depth?*\n\nGoosebumps raced across Baron Cudan's skin. If one random soldier possessed this level of power, what about the thousand knights?\n\nHe swallowed hard, his throat suddenly dry.\n\n\"How dare you speak to a baron that way!\" one of Cudan's escort knights shouted.\n\n\"We represent the great Murray Kingdom!\" another added.\n\nSteel hissed as the Murray knights drew their blades. They moved toward the blond soldier—\n\n\"Stop!\" Baron Cudan's voice cracked with urgency.\n\nHis knights froze, shocked by their lord's command.\n\n*If we attack here, we all die.* The certainty settled in Baron Cudan's gut like ice. *Killed by a mere soldier.*\n\nBaron Cudan clutched his stomach dramatically and collapsed to one knee. \"U-Ugh! What? Why does my stomach suddenly hurt so badly?\"\n\n\"My lord?\" His knights stared in confusion.\n\nBaron Cudan had never been sick a day in his life. His constitution was legendary—he'd fought through wounds that would have killed lesser men. To see him complain of stomach pain was...\n\n\"We need to return to the kingdom immediately,\" Baron Cudan gasped, not meeting the blond soldier's eyes. \"Oh, it burns! Must have been that beef jerky from the road.\"\n\n\"But my lord, the king's mission—\"\n\n\"It burns! We're leaving!\"\n\n\"Y-Yes, my lord!\"\n\nThe Murray delegation fled Reinhardt with their lord hunched over, one hand on his stomach. As they crossed the city gates, several representatives called out:\n\n\"Baron Cudan! Will you truly abandon your duty?\"\n\n\"What is happening...?\"\n\nThe remaining representatives exchanged bewildered glances. Baron Cudan, abandoning his mission?\n\n*This is completely unlike the Murray Kingdom's usual discipline.*\n\nThey watched the delegation disappear down the road, unable to process what they'd witnessed.\n\nBaron Cudan himself maintained his pained expression until Reinhardt vanished behind the hills. Then his face hardened with resolve.\n\n*I must convince the king to make peace with the Overgeared Kingdom.*\n\nHow could Grid be more dangerous than the Saharan Emperor himself? The man might be a rebel, but his power transcended anything Baron Cudan had imagined. Grid was the future—fighting him would be suicide.\n\n***\n\n\"What? The Gauss representative left as well?\"\n\nTwo of the fifteen envoys gone before the ceremony even began. The remaining thirteen representatives found it absurd.\n\n\"What kind of representative abandons his mission?\"\n\n\"Baron Kons and Baron Cudan are both incompetent cowards.\"\n\n\"It reflects poorly on their kings' dignity.\"\n\nBaron Vedika, representative of the Ultana Kingdom, shook his head in disgust. He'd earned the nickname 'Vampire Baron' by hunting the intermediate vampires that plagued his territory and claiming their rings as spoils. His reputation for sustainability in combat was well-deserved—he could drain health from enemies, making him nearly immortal in prolonged fights.\n\n*They fled after seeing the thousand knights,* Vedika thought with contempt. *Afraid they'd be cut down the moment they demanded tribute.*\n\n*Pathetic. A representative should place his kingdom's honor above personal fear.*\n\nTo be honest, Baron Vedika felt the tension as well. Success would bring glory, but the thousand knights surrounding them could just as easily mean execution. However, he had an ace that the others lacked.\n\n*The vampire ring.*\n\nEarned by hunting intermediate vampires with his entire knight order. Baron Vedika believed that with the ring's power, he could survive even a thousand-to-one fight.\n\n\"Huhuhut...\" His chuckle died as his gaze fell on the ring. \"Huh?\"\n\n\"Will there be group activities after the founding ceremony?\"\n\n\"Yeah, we're organizing a hunt in the vampire cities.\"\n\nBaron Vedika's head snapped toward the voices. Two users walked past, casually discussing their plans.\n\n\"The vampires are too weak to be fun anymore,\" one complained. \"The experience isn't even worth it.\"\n\n\"But it's a celebration,\" his companion replied. \"Good chance to help the second-string guild members level up.\"\n\n\"I suppose. If we're going, might as well try a city we haven't cleared yet.\"\n\nOrganizing hunts in vampire cities? The vampires being *too weak*?\n\n*What are they talking about?*\n\nBaron Vedika nearly laughed at the obvious bluster. Then he caught sight of something on the bald man's finger—a ring with a faint crimson glow.\n\n\"Pant... pant?\"\n\nHe couldn't breathe. The dozens of people in the group, including the bald man, all wore vampire rings. Rings that pulsed with stronger magic power than his own hard-won treasure.\n\nBaron Vedika's worldview tilted. His hands trembled as he approached the group, swallowing his noble pride.\n\n\"Forgive my impertinence, but... what is your position here?\"\n\nThe bald man—Vantner—turned to him with a friendly grin. \"We're King Grid's subordinates. Why?\"\n\n\"...U-Urgh!\" Baron Vedika clutched his head. \"Why am I suddenly feeling dizzy? This is strange...\"\n\nThe Ultana Kingdom's representative fled Reinhardt with unseemly haste.\n\n\"...???\"\n\nThe remaining twelve representatives watched another colleague abandon his post, completely baffled. Finally, reluctantly, they settled in to observe the founding ceremony.\n\nWhatever awaited them, they would see it through."
}