{
  "id": 6,
  "title": "Chapter 6",
  "content": "# Chapter 6\n\n*The black magicians are the problem right now.*\n\nI was currently level -1. My strength and stamina stats sat at one point each. Mengel's Plate Armor added five strength, bringing my total to six. When all my stats combined, I had a pathetic 34 health. I might land a few punches before heading to the netherworld.\n\n*Can I get away?*\n\nThe quest failure was inevitable. I just wanted to preserve my life. No, I *had* to survive. If someone died twice in a day, they couldn't access the game for 12 hours. \n\n*Okay, this is the only way.*\n\nI shouted at the air. \"Log out!\"\n\n> [You can't log out of the game here.]\n\n\"Fuck! I should've expected this!\"\n\nIt was common knowledge that logging out during a timed quest was impossible. There was a way to force it, but the penalty would be massive. I scanned for escape routes instead. No luck. This was their stronghold.\n\nBelievers swarmed from every direction. No matter how many calculations I ran through my head, there was no path forward. I was slow as a tortoise. There was no hope.\n\nDoran's voice cut through my planning. \"Break through to the basement at once!\"\n\nHe pulled two daggers and threw them without hesitation. His hands moved so fast I barely registered the motion.\n\n*Thunk. Thunk.*\n\n\"Kuaack!\"\n\nOne dagger struck a believer's eye. The other pierced another's heart. Doran closed the distance before either could scream and wielded his dagger.\n\n\"Open up.\"\n\nHe sliced both throats. The believers vanished in flashes of grey light without making a sound.\n\nI couldn't resist admiring it. Temple NPCs were generally level 150 or higher. These believers were probably the same, yet Doran handled them like they were made of paper.\n\n*Is he a named NPC?*\n\nMy impression of him shifted. Maybe I could clear this absurd quest if I stuck close. 3,000 gold! That was 3,600,000 won! The earl's daughter! All stats plus twenty! A beautiful wife! I would become a lord with territory. I could steal taxes from users and NPCs alike.\n\n*If I become a landlord, I'll get revenue every month.*\n\nExcitement surged through me.\n\nI began to cheer. \"Good! Doran, fighting! I've admired you for a long time!\"\n\nDoran glanced back mid-strike. \"Eh? For a long time? When have you ever seen—\"\n\n\"Ah! Danger! Over there!\" I pointed frantically. \"You must take care of your body!\"\n\n\"B-Body...?\"\n\nHe looked confused by my sudden shift in attitude, but he refocused on the enemies in front of him. More grey lights erupted.\n\n*Really strong!*\n\nDoran threw hidden weapons like they were extensions of his body. The number one assassin ranker, the 'Old Sword Demon', was like a child compared to this.\n\n*Isn't he three times stronger than Ashur? I should befriend him and ask him to assassinate Ashur!*\n\nThe Yatan believers ignored me and rushed Doran instead. Their efforts were futile. Doran focused on the ones chanting spells, attacking them before they could finish their magic. Without completed incantations, the black magicians posed no threat.\n\n\"Amazing! You're really amazing!\" I pumped my fist in the air. \"Doran, you're my god!\"\n\nA black magician opened his mouth to cast. Doran's dagger pierced through his cheek before a single syllable emerged.\n\n*The best!*\n\nBy relying on the NPC's strength, I could actually complete this quest! A fantastic quest! How pathetic that I'd been trying so hard to refuse it minutes ago.\n\nI chased after Doran at my sluggish pace. He stopped occasionally, and I caught up each time.\n\n\"Are you waiting for me?\" I wheezed. \"How kind. Hehe.\"\n\nDoran's expression was grim as he scanned the room. \"These guys have started to use their heads.\"\n\n\"Huh?\"\n\nI followed his gaze. The black magicians were chanting spells at the same time.\n\nOne began: \"Blessed souls underground.\"\n\nAnother continued: \"Use your grudges and fears to ensnare the enemy.\"\n\nA third: \"Those who feel fear will have their legs restrained.\"\n\nA fourth: \"Their minds will be crushed and they will lose their willpower.\"\n\nThe final voice: \"Become a doll with a lost soul!\"\n\nThey were sharing the spell. One magician chanting alone would be stopped by Doran before finishing. By splitting the incantation, each sentence connected to form a single spell. The magic would cast.\n\nDoran's voice was flat. \"Be prepared.\"\n\nI grabbed his collar. \"Be prepared? You should do something!\"\n\n\"It's too late.\"\n\n\"Dammit!\"\n\n*Kuoooooh!*\n\nA line of blood appeared on Doran's face. Black energy rose like mist and covered him.\n\n\"N-No! I'm finished if you die!\"\n\nI'd boarded the same boat as Doran, and he was the oarsman. I couldn't escape quest failure if he died here.\n\n\"Cough!\" Doran staggered.\n\nI cursed and shouted at him. \"Fuck! If it was going to be like this, you shouldn't have made me feel hopeful in the first place!\"\n\nGreen light flowed from Doran's ring and surrounded him. His complexion gradually restored.\n\n*W-What?*\n\nDoran attacked the surprised black magicians before they could start new spells.\n\nHe spoke between strikes. \"This ring is special. It protects the wearer from curses and poisons. However, the protection isn't perfect. The damage is cumulative, so I need to avoid as much magic as possible.\"\n\n\"Yes, indeed!\" I nodded vigorously. \"The great Doran is even wearing a ring like this!\"\n\n*The ring is clearly Epic or higher rating. Is there a way to obtain it?*\n\nWhile I schemed, Doran continued to slaughter enemies. He allowed a few magic spells through but eventually carved a path forward.\n\nHe paused at the entrance of a staircase. \"Come on!\"\n\n\"Yep!\"\n\nMy vigorous reply didn't match my actual pace. I chased Doran down the stairs at a crawl. Black magicians pursued us with spells, but they posed no threat. Doran threw daggers the moment he heard chanting.\n\nWe arrived at the dark basement.\n\nDoran's voice cracked. \"Young Lady!\"\n\nHe found a beautiful woman bound to the altar in the center and sprinted toward her. A crowd blocked his path. A dozen black magicians.\n\nI laughed at them. \"These ridiculous bastards! They need more people than that to be our opponents! Now, Doran! Get rid of them!\"\n\nDoran nodded. \"Of course!\"\n\nHe wielded his daggers in front of him. Doran might be tired, but the number of opponents was too small. I imagined the black magicians turning into grey light. The quest clear signal was right around the corner.\n\n\"3,600,000 won and the earl's daughter, here I come!\"\n\n*Clang. Clang. Clang.*\n\n\"...Eh?\"\n\nThe hidden weapons Doran threw stopped mid-air and clattered to the ground. His advance halted.\n\n\"Shield?\"\n\n*Defense magic can't be used by black magicians. Only second advancement black magicians can do that.*\n\nA young woman walked out from among the black magicians. She boasted unique beauty that made the noble lady on the altar pale in comparison.\n\n*She looks familiar?*\n\nI checked her name and froze.\n\n*Blood Witch!*\n\nThe Blood Witch. ID: Yura.\n\nThe Korean user ranked number one on the black magician rankings and number five on the unified rankings. A famous person who frequently appeared on TV because of her beautiful appearance and outstanding abilities.\n\n*Why is she here?*\n\nYura looked toward me and stretched out her hand. \"I'm sorry, but I can't allow you to take away the sacrifice.\"\n\n*Peeng!*\n\nA red fire sword emerged from her hand with fierce momentum. Unlike typical black magicians who lacked attack magic, she was well versed in it. I stared at the flames.\n\n*Did I get this far, only to die?*\n\nWhy the hell was she here? Despair filled my body. A notification window popped up.\n\n> [You have been hit by a critical blow!]\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with the minimum amount of health.]\n\nOne health point remained. I'd temporarily forgotten the attribute of my title. It activated, and I gained a temporary immortal body. Yura's face showed genuine confusion as I survived her magic.\n\n\"That was clearly a critical hit.\" She tilted her head. \"Based on the equipment, you're only around level 80. So how are you fine after being hit by that attack?\"\n\nYura asked while hiding behind the black magicians in preparation for Doran's counterattack. She always had a calm smile on TV. I was probably the only one who had seen her flustered expression.\n\nI ran forward. \"Quickly! Let's finish it in five seconds! I'll use my body to block their attacks, so Doran must kill them! I believe in you, Doran! My god!\"\n\nThe spells of all the black magicians, including Yura, concentrated on me. This meant Doran could strike freely. The best development.\n\n*Yes, hit me! No matter how you hit, I won't die!*\n\nToday would be the day an ordinary user stood up to a ranker.\n\nI narrowed the gap toward Yura. All types of curses and attack spells struck me while Doran followed the path I made and dealt devastation to the black magicians. Then Doran stepped on my back and jumped toward Yura.\n\nYura blocked his attack despite being confused. Doran's momentum rose.\n\n*We can win!*\n\nBut Doran stepped on my back.\n\n> [You have died.]\n\n\"......?\"\n\n*Eh? Eeeeh?*\n\nI wanted to reject this situation, but reality was cruel. A new notification window popped up as my vision turned grey.\n\n> [Quest failed!]\n> [Your level has dropped by 2.]\n> [You are now level -3.]\n> [As you have died two times within 24 hours, you won't be able to connect to the game for 12 hours.]\n\n*Hah, it somehow turned out like this.*\n\nI gazed toward Doran fighting. No. My last sight as I closed my eyes was that damned Blood Witch."
}