{
  "id": 60,
  "title": "Chapter 60",
  "content": "# Chapter 60\n\nIn the past few months, Earl Steim had thoroughly searched and demolished almost all the Yatan Temples in the north. The Yatan Church was being punished for kidnapping virgins to sacrifice them. But Earl Steim's fury was personal. His daughter Irene had been one of those victims.\n\nIt was fortunate that Irene had been rescued, but he'd lost his most powerful shadow, Doran, in the process.\n\nEarl Steim harbored a fierce desire to eradicate the Yatan Church root and stem. But the elders of Yatan were distributed in great numbers across the continent. It wasn't easy to exterminate those who bred endlessly like cockroaches. There was even a Yatan Temple on the outskirts of Winston.\n\nIrene stared out the window of her chambers, hands clenched at her sides.\n\n\"At the very least, there should be no more Yatan Temples in the north.\"\n\nHer hatred matched her father's intensity. She couldn't tolerate the existence of the Yatan Church in Winston. The terrible fear she'd felt after being abducted by those believers still haunted her. She trembled at the thought of becoming a victim again.\n\nA few days ago, she'd sent out her army to destroy the Yatan Temple. But due to heavy resistance from the believers, the army had returned without any achievements. The casualties numbered one hundred soldiers, and three knights were seriously injured.\n\nIrene's voice rang through the war room, cold and absolute.\n\n\"Reorganize the temple expedition. This time, make sure the temple burns to ashes!\"\n\nShe invested more troops, her ambition on full display. As she watched them prepare to march, Irene touched the blue ring hanging from her necklace.\n\n\"Doran... I will get revenge for you who sacrificed your life for me.\"\n\n***\n\n> **[Eighth Servant]**\n> \n> **Difficulty Level:** SS\n> \n> You have become one of the most blessed beings of God Yatan. Head to the northern part of the Eternal Kingdom and save the believers who are being suppressed there!\n> \n> If you spread the greatness of God Yatan to the pagans in the north, you will be given the position of the Eighth Servant.\n> \n> **Quest Clear Conditions:** Earl Steim's army is constantly attacking the Yatan Temple in the north. Rescue at least 300 stranded temple believers.\n> \n> Number of followers rescued so far: 0/300\n> \n> **Quest Clear Reward:** The position of 'Eighth Servant.'\n> \n> * **Eighth Servant:** The skill 'Infinite Faith' will be created. The skill 'Teaching Doctrines' will be generated. The skill 'Divine Punishment' will be generated.\n> \n> **Quest Failure:** Level -5. Faith -1,000\n\nThe soldiers in the north of the Eternal Kingdom were known for their strength. Obviously it would be a tough fight. But Yura didn't hesitate. She immediately set her course for Winston.\n\n*I have to become stronger.*\n\nNot long ago, Yura had faced Agnus, who was 7th on the unified rankings. The encounter had revealed the immense gulf between her and an epic class. She'd felt helpless, just like when she'd confronted that mysterious man with the ID of Grid.\n\nNow she'd acquired an SS-grade quest. A golden opportunity. Yura was determined to use this quest as a stepping stone toward her ultimate goal of claiming first in the rankings.\n\n***\n\nI received a level 160 sword production method from Khan. But the recipe was burdensome. Based on the list of required ingredients, it would cost 950 gold to make a single sword.\n\nI stared at the materials list, doing the math in my head.\n\n*Well... it can't be helped.*\n\nI currently had 6,710 gold. With this money, I could only make seven swords. Worse, the number of swords I could craft in a week was just seven.\n\n*Seven. Isn't it good that everything adds up to seven?*\n\nIn South Korea, the number seven was a symbol of good luck! I trusted the lucky number.\n\n\"I'll do it in one go! An epic item is coming! Hehehehehe!\"\n\nCaught up in a pleasant mood, I hummed while spending twenty hours on the sword. And the completed work...\n\n> **[Durable Longsword]**\n> \n> **Rating:** Normal\n> \n> **Durability:** 250/250  \n> **Attack Power:** 200\n> \n> A sword made by a craftsman with great skill and potential but lacking in experience and reputation.\n> \n> It won't be easily damaged after being tempered for a long time.\n> \n> **User Restriction:** Level 160 or higher. More than 950 strength. Intermediate Sword Mastery.\n> \n> **Weight:** 600\n\n\"...Who said that seven was a lucky number? Urgh, I want to kill them.\"\n\nOne attempt flew away. It was normal to feel like cursing the system. However, the value of the materials couldn't be returned. I barely moved my legs, trembling from anger, and approached Khan.\n\n\"How much will this sell for?\"\n\nKhan examined the sword for a long time before replying cautiously.\n\n\"It is around 800 gold.\"\n\n\"W-What?\"\n\nI almost grabbed Khan's collar. The materials I'd used were worth 950 gold, but the value was only 800 gold? Then what was this? A scam?\n\n\"An equipment like this with the original conditions won't trade well. This is why...\"\n\nKhan elaborated.\n\nHere was the brief summary: A level 160 item had better basic performance than a level 120 item. Normal rated items had no options, while rare items had a small option attached. Depending on how the options were set up, a level 120 rare item often outperformed a normal level 160 item. Therefore, the prices of the two items didn't vary greatly.\n\nPeople with money were more likely to buy the level 120 <span class=\"rarity-rare\">rare item</span> than the level 160 normal item.\n\n*In other words, get rid of the normal items...*\n\nKhan patted my shoulder.\n\n\"But your equipment is good even with a low rating, so you won't see a big loss. Please be comforted by that.\"\n\n*Comfort... Hah, this is really messed up.*\n\nIn the future, I could make six more swords. Based on the two-thirds probability of getting an epic item, I had a chance to clear the quest.\n\n\"Damn, this time it will surely work!\"\n\nI became extremely focused. Then I tried to make the best possible sword.\n\nTwenty hours later, the second sword was complete.\n\n> **[Durable Longsword]**\n> \n> **Rating:** Normal\n> \n> **Durability:** 250/250  \n> **Attack Power:** 200\n> \n> A sword made by a craftsman with great skill and potential, but lacking in experience and reputation.\n> \n> It won't be easily damaged after being tempered for a long time.\n> \n> **User Restriction:** Level 160 or higher. More than 950 strength. Intermediate Sword Mastery.\n> \n> **Weight:** 600\n\n\"Hey, this piece of garbage! The operators... Bastards! They are manipulating this stupid system! No, why are you doing this?\"\n\nKhan brought me a cup of warm tea.\n\n\"Have strength. Trials will come to everyone. If you overcome this trial...\"\n\n\"Ah, don't talk to me! I am too annoyed right now.\"\n\n\"......\"\n\nI ran out of Khan's smithy and yelled toward the sky.\n\n\"These damn operators! If you manipulated the probabilities, I will report you to the Consumer Rights Center! You pieces of trash!\"\n\nI'd used the best materials. I'd done my best during production. If the operators had a minimum of conscience, a normal result wouldn't come out. I believed it and started making the third sword.\n\n*Ttang! Ttang! Ttang!*\n\nI barely slept for the past few days as I kept hammering. My shoulders burned, but I didn't stop. It was a matter of pride. I had the title of legendary blacksmith, so I couldn't keep making normal rated items. I would escape the manipulations of the operators and create an <span class=\"rarity-epic\">epic item</span>.\n\nNot long ago, my goal had been to create a <span class=\"rarity-unique\">unique</span> or <span class=\"rarity-legendary\">legendary item</span>. Now I was only aiming for epic. But what could I do? Reality wasn't kind, so I had to settle for epic items.\n\n***\n\nIt was dinner time. I had no appetite. I didn't know if the rice entered my mouth or my nose.\n\nMy mother looked at me with a bemused expression.\n\n\"Hey Youngwoo, did something bad happen? I worked on those braised short ribs for a long time, so why are you sucking on a bone for five minutes?\"\n\n\"A pathetic person like me isn't qualified to eat meat...\"\n\nOne and a half days had passed in reality, while six days passed in Satisfy. In the meantime, I'd made six swords. The results: three normal, one <span class=\"rarity-rare\">rare</span>, and two <span class=\"rarity-epic\">epic</span> swords. Now I could make one more sword before the time limit was over, but I only had two epic rated items.\n\n*I'm ruined... Ruined...*\n\nWhen investing twenty hours to create an item, the probability of making an epic item was close to one third. In other words, the possibility of my remaining sword being an epic item was very low.\n\nMy quest 'Business with the Administrator' would soon fail.\n\n*I have a legendary class but I can't even make an epic item... I am a truly pathetic person who doesn't deserve food.*\n\nSehee, frustrated, placed a braised rib on top of my rice bowl.\n\n\"What's new? Brother, haven't you always been pathetic? Why do you need to look so weak now? I don't know what type of adversity you're going through these days, but the only good thing about you is that you don't know how to give up. Right? When you were in 6th grade in elementary school, you were able to memorize everyone from the 1st grade to 6th grade, so don't be frustrated this time and be patient. You'll surely be able to overcome these difficulties.\"\n\nI got goose bumps at the words that Sehee normally didn't say.\n\n\"S-Sehee... did you eat something bad?\"\n\nI turned to my mother.\n\n\"Mother, maybe there's something wrong with the braised ribs. Are these beef short ribs? Is this beef from cows with mad cow disease?\"\n\n\"These are pork ribs!\"\n\n*Ppak!*\n\nSehee picked up the piece of rib she'd given me and threw it at me. The rib slid down the side of my face as I seriously wondered: Why was I being hit every time I sat down for a meal? Why was I being treated worse than a dog by my family members?\n\n---\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}