{
  "id": 601,
  "title": "Chapter 601",
  "content": "# The First Player King\n\n\"Waaahhhhhhhh!\"\n\n\"Grid! Grid! Grid!\"\n\n\"God Grid! God Grid! God Grid!\"\n\nThe roar began the instant the system announcement echoed across the server—*The First Player King Has Been Crowned*. The sound rolled through Reinhardt like thunder, shaking the very stones of the plaza. Tens of thousands of players and hundreds of thousands of NPCs surged forward, their voices blending into a single, deafening hymn of Grid's name.\n\n\"Get that shot!\" A broadcast director frantically waved at his cameramen. \"Close-up on the crowd—I want faces! I want *joy!*\"\n\nThe camera crews scrambled through the packed square, capturing expressions of awe and ecstasy. Who in all the world could command such worship from so many? It was as though a global leader had just been elected—no, something even greater. The broadcasters themselves were swept up in the moment, desperate to convey the raw electricity of the scene to viewers worldwide.\n\n*All I can say is... this is incredible.*\n\nThe voices of the people seemed to pierce the heavens themselves. Players of every nationality shouted Grid's name without hesitation. Broadcasting staff darted between the crowds, jostling for angles.\n\nAnd through it all, one old swordsman stood trembling.\n\nZirkan's gaze fixed on a figure near the stage—Lauel, grinning beneath his ridiculous black eyepatch.\n\n*Lauel... you absolute monster.*\n\nWho had spread the rumor that the Eternal nobles were marching on Reinhardt? Lauel. Who had orchestrated this perfect crescendo of tension and release? Lauel. The dramatic timing of Marquis Steim and the Giant Guild's arrival—every beat choreographed to maximize impact.\n\nAnd the result?\n\n*This.*\n\nThe founding of the Overgeared Kingdom would dominate every conversation for days, perhaps weeks. How many times would the words \"Overgeared Kingdom\" pass through the lips of players across the world? The number was incalculable.\n\n*If Chris had someone like Lauel...*\n\nZirkan watched Lauel laugh—that insufferable, knowing laugh—and hunger gnawed at him.\n\n*Chris would already be a king.*\n\nZirkan had been the first-ranked swordsman until Ibellin dethroned him. He'd mentored Chris for years, watched the prideful young man mature into someone envied by all. Chris had built the Giant Guild from nothing, climbed to first place in the unified rankings.\n\n*Chris has every qualification to rule.*\n\nThe only thing he lacked was people like Lauel.\n\nAnd that deficiency was Zirkan's failure.\n\nA heavy hand fell on his shoulder.\n\n\"Zirkan.\" Chris's voice was quiet, steady. \"Does my decision to follow Grid... does it disappoint you?\"\n\nDecades of friendship meant Chris could read Zirkan's heart from his expression alone.\n\nThe old swordsman's shoulders sagged. \"If I had even half of Lauel's talent, you wouldn't need to bow your head to anyone.\"\n\n\"That's not true.\"\n\nChris shook his head, his smile tinged with something that looked like relief. \"I lack the charisma to draw people to me. I can't inspire the kind of devotion that makes someone stake everything on your word. I don't have the force to *break the sky*.\"\n\nHe'd spent a long time looking at himself honestly, measuring himself against Grid. The gulf between them was clear.\n\n\"Zirkan, remember this—from now on, Grid is my standard.\"\n\n\"Standard?\"\n\n\"Yes. His choices are my choices. His path is my path.\"\n\nChris had finally accepted the truth: he couldn't lead more than five hundred people. First in the unified rankings? That throne meant nothing. He'd claimed it only because Kraugel and Zibal had withdrawn from active competition. Grid had shown him his limits—and shown him something greater.\n\nGrid was a giant who could achieve what Chris could not.\n\nMore than that, Grid loved his people as family. Something Chris had never dared to do.\n\nTherefore, Grid would be his compass.\n\n\"Chris.\"\n\nGrid's voice rang out from the stage—the first name spoken since the crown had been placed on his head. Calling the current rank-one player, leader of five hundred warriors, before all the world.\n\nAn honor.\n\n\"I have a formal request.\" Grid extended his hand. \"Become my colleague.\"\n\n> [The Overgeared Kingdom is awarding you the title of Duke. Do you accept?]\n\nThe notification hung before Chris's eyes. In essence, it asked: *Are you prepared to stake everything you've built since your first day in Satisfy on Grid?*\n\nChris didn't hesitate.\n\n\"It is an honor.\"\n\nHis footsteps rang against the stage—firm, deliberate, final. He knelt before Grid.\n\nThe world held its breath.\n\n\"Chris and the 503 members of the Giant Guild pledge ourselves to the Overgeared Guild.\" He bowed his head. \"No—we pledge ourselves as your *servants*, to defend the Overgeared Kingdom with our lives.\"\n\n\"...!!\"\n\nThe crowd erupted. One of the Seven Guilds—*absorbed* by Grid! Breaking news alerts flashed across every server, every broadcast. The most shocking development in Satisfy's history was unfolding live.\n\n---\n\n**[Global Chat Explodes]**\n\n—*Holy shit.*\n\n—*The rank-one player and the entire Giant Guild, absorbed just like that?*\n\n—*Wait, doesn't this seem weird? Why would Chris become Grid's SERVANT?*\n\nEveryone knew Chris had claimed first rank partly because Kraugel and Zibal had stepped back. But nobody dared claim he was unworthy—Chris's strength spoke for itself. To see such a player kneel to Grid...\n\n—*Did Grid blackmail him?*\n\n—*Did Overgeared threaten them somehow?*\n\n—*How could anyone threaten one of the Seven Guilds?*\n\n—*What ARE the Seven Guilds anymore? Overgeared has the power of an entire KINGDOM.*\n\n—*Come to think of it... the Seven Guilds are nothing compared to Overgeared;;*\n\n—*So will Overgeared just keep absorbing guilds until they own all of Satisfy?*\n\nWhile speculation ran wild, experts from various countries offered sharper analysis.\n\n『Chris's decision to join Overgeared is tactically brilliant. The Giant Guild has grown too large, and their territories aren't particularly valuable. Perhaps Chris recognized he'd hit a ceiling.』\n\n『Exactly. It's far more profitable to secure prime real estate under Grid's banner than to stagnate independently.』\n\n『So the rumors of Overgeared using threats are baseless?』\n\n『Obviously. The Overgeared Guild is proud of their strength, yes—but strong-arming Chris would create massive blowback. An anti-Overgeared coalition would form overnight.』\n\n『The Overgeared Guild already has enough enemies. The risk of coercion far outweighs any benefit. Chris and the Giant Guild joined *willingly*.』\n\n『Hah... Still hard to believe. The largest guild, led by the first-ranked user, just... absorbed.』\n\n『This is a glimpse of Grid's true influence. Grid is exceptional...』\n\n『...』\n\nInternational broadcasters and analysts who'd mocked Grid as stupid mere hours ago now sang his praises. The anchors could only shake their heads at the whiplash.\n\n---\n\n**[S.A. Group Headquarters]**\n\n\"Didn't you say the Overgeared Kingdom would only survive a few years?\"\n\nChairman Lim Cheolho swirled his drink, watching the ceremony feed with amusement.\n\n—*Originally, the Overgeared Kingdom faced destruction in two years and three months. Gradual suppression by the fifteen kingdoms, eventual occupation by the Saharan Empire. But the situation has changed. The Giant Guild's integration has increased Overgeared's power exponentially.*\n\n\"Hah... Hahahaha!\"\n\nMorpheus delivered a completely different projection than before.\n\nGrid. How many times had this one player shattered the predictions of the world's most advanced supercomputer? A true miracle player. One of only five.\n\nIt was *delicious* to watch.\n\n—*Updated timeline for Overgeared's destruction: Two years and eight months.*\n\n\"...\"\n\n—*Coinciding with the beginning of the Light Dragon Nevartan episode.*\n\n\"Hmm, that creature awakens then? Though at that point, most kingdoms will fall—not just Overgeared.\"\n\nSo many stories waiting in the wings. Who would seize wealth and glory in the coming trials?\n\nLim Cheolho's anticipation was palpable.\n\n---\n\n**[The Founding Ceremony - Reinhardt Palace]**\n\n\"Grid! Grid! Grid!\"\n\n\"Thoughtless rabble.\"\n\n\"A world where a traitor's name is shouted. Absurd.\"\n\n\"Lowly and unpleasant.\"\n\nThe ceremony had reached its zenith. The representatives of the twelve kingdoms failed to mask their disgust. All they saw was a mob of lunatics chanting the name of that filthy upstart Grid—a candle flame before the wind, soon to be extinguished.\n\n\"Unexpected that the prestigious Marquis Steim would debase himself under Grid.\"\n\n\"There's no future for the Overgeared Kingdom. No tomorrow for a regime built on injustice.\"\n\n\"But commoners wouldn't understand. Pity they're so dazzled by momentary splendor.\"\n\n\"We must remind them of reality.\"\n\nOn stage, the self-proclaimed Overgeared King called Chris and Steim forward in turn, elevating them to dukes. The ceremony was in full swing—hardly the time for interruptions.\n\nBut the representatives felt no need for courtesy toward this illegitimate regime.\n\nThey stood, walking directly onto the stage without invitation.\n\n\"Who the hell are those people?\"\n\n\"What's going on?\"\n\nBroadcasters and players focused on the ceremony blinked in confusion. The Overgeared Kingdom's soldiers—commoners in ill-fitting armor, barely qualified as guards—tensed and drew weapons.\n\n\"Violence already? Indeed, when the master seizes his throne through bloodshed, his servants can only be barbarians.\"\n\nThe representatives sneered as soldiers surrounded them.\n\nOvergeared members bristled with outrage. Grid, however, showed no reaction.\n\nLauel stepped forward instead. \"Entering an event without invitation? You don't even know basic manners.\" His smile was poisonous. \"The level of the kings you serve must be equally crude.\"\n\nThe representatives' faces flushed with fury, but they maintained composure. They could afford patience—they'd have the last laugh.\n\n\"We're too busy to wait our turn.\"\n\n\"Too noble to participate in this farce you call a founding ceremony.\"\n\n\"You fucking bastards!\" Vantner's bald head went crimson as he raised his axe.\n\nPon caught his arm. \"Wait. This might be what Lauel wants. Wait for his signal.\"\n\n\"Ngh!\"\n\nThe representatives produced sealed letters. Broadcast cameras zoomed in.\n\nThey opened their mouths in synchronized proclamation:\n\n\"Grid, hear us.\"\n\n\"Our fifteen kingdoms cannot acknowledge one who seized power through violence.\"\n\n\"Your kingship violates providence. It will be a stain on this continent's history.\"\n\n\"Grid, understand this clearly.\"\n\n\"Our fifteen kingdoms *deny* you and your Overgeared Kingdom.\"\n\n\"But what crime have your people committed? We have no desire to water the earth with innocent blood.\"\n\n\"Therefore, we grant you one opportunity.\"\n\n\"Grid, submit to us.\"\n\n\"Henceforth, you will pay monthly tribute to our fifteen kingdoms.\"\n\n\"Cast aside your greed. Empty your coffers.\"\n\n\"Starve. Serve. Repent.\"\n\n\"Grid and the Overgeared Kingdom will be governed by our fifteen nations.\"\n\n\"...\"\n\nThe plaza fell into absolute silence."
}