{
  "id": 602,
  "title": "Chapter 602",
  "content": "# Chapter: The Founding Ceremony's Test\n\nThe founding ceremony grounds fell silent.\n\nAcross the world, viewers processed the gravity of what they'd just witnessed. Fifteen kingdoms—*fifteen*—had united to demand tribute from the newborn Overgeared Kingdom. The choice before Grid was binary: pay and watch his treasury bleed dry, or refuse and face annihilation.\n\nGlobal chat channels exploded with commentary:\n\n**[DarkKnight99]:** *Not accepting means war...*\n\n**[SilverArrow]:** *If they pay tribute to all 15 kingdoms, they'll go bankrupt within months.*\n\n**[CasualGamer]:** *Wait, so either way the Overgeared Kingdom is finished?*\n\n**[StrategyNerd]:** *The kingdom died the moment those 15 nations united. It's too early for a player to establish a kingdom. The NPCs aren't ready for it.*\n\n**[GameTheory]:** *Was this designed by Morpheus? The AI must have planned this.*\n\n**[RealistPlayer]:** *Makes sense. Kingdom ownership generates astronomical wealth. Satisfy is notorious for difficulty—no way the system hands out easy wins.*\n\n**[Spectator101]:** *S.A. Group is ruthless... Grid's 60 million gold is about to evaporate.*\n\n**[HonestTroll]:** *Pitiful, but he had it coming. Grid's been too successful. I was getting jealous anyway, lol.*\n\n**[MoralSupport]:** *There are too many people like you in this world.*\n\nThe world watched with bated breath, a kaleidoscope of emotions painting the collective consciousness—anger, sorrow, schadenfreude. Every eye turned toward the marble stage where Grid sat enthroned.\n\nSome predicted he would diplomatically accept the demands, then scheme in private. Others insisted his volatile nature would lead to violence against the representatives. A few argued he'd choose to fight rather than submit.\n\nBut most agreed on one point: Grid couldn't afford to lose 60 million gold. At current exchange rates, that represented approximately 65 million dollars—enough to buy a super-luxury mansion, a fleet of supercars, and live like royalty for life. The investment was too massive. Compromise was inevitable.\n\n\"Hrmm.\"\n\nGrid shifted on his marble throne, the Holy Light Crown gleaming atop his head. His first reaction.\n\n*Gulp.*\n\nThe Overgeared members swallowed hard.\n\n*Grid, please... hold it together!*\n\n*That 60 million gold cannot disappear!*\n\nUnlike the global audience, they knew Grid's true nature. Violence was always on the table. But when Grid finally spoke, his voice carried an eerie calm that surprised even his closest allies.\n\n\"Let me ask you something,\" he said, gaze sweeping across the representatives.\n\n\"...?\"\n\n\"Why are there twelve of you instead of fifteen?\"\n\n\"...!\"\n\nThe representatives stiffened. How could they admit that the envoys from Gauss, Ultana, and Murray had fled with ridiculous excuses? The unified front was already cracking, and those three kingdoms' true intentions remained uncertain.\n\nGrid's lips curled into a scornful smile. \"Twelve representatives strutting around, pretending to speak for fifteen kingdoms. All I see are bluffers spinning lies.\"\n\n\"Ugh...!\"\n\nThe accusation landed like a hammer. None of them could refute it.\n\n\"Damn scum,\" Grid muttered, barely audible. Then he leaned back into his throne with the casual arrogance of an emperor and called out, \"Huroi.\"\n\n\"Yes, Your Majesty.\" The first-ranked orator stepped forward from below the stage.\n\n\"Repeat my words from now on.\"\n\n\"As you command!\"\n\nHuroi was perfectly suited for this moment. His class granted him supernatural persuasion—the ability to make words sound more logical, to cut through noise and chaos, to compel listeners. His skill could transform even Grid's rough speech into eloquent proclamations.\n\n\"Hey, you bastards.\"\n\n\"**Listen well, foolish and false representatives.**\"\n\n\"I didn't violate any bullshit moral laws.\"\n\n\"**I have violated no moral laws. I am no traitor. Rather, I fulfilled my sacred vow of loyalty to King Wiesbaden—the only monarch worthy of my allegiance.**\"\n\nHuroi's voice resonated through Reinhardt like a clarion call. The refined words, still carrying the essence of Grid's intent, captured the hearts of every anxious soul in the capital.\n\n\"**The reason I claimed this throne was to liberate the people suffering under the corrupt Eternal royal family. This is a noble cause that should be etched into the continent's history. You cannot distort truth with your hollow lies.**\"\n\n\"**WAAAHHHHHHH!**\"\n\nThe crowd erupted. The people of Reinhardt had endured King Aslan's tyranny firsthand. They genuinely saw Grid as their savior. His words—enhanced by Huroi's oratory—rekindled their courage, and they roared his name in approval.\n\nLauel observed the scene with a satisfied smile.\n\n*He's handling this perfectly.*\n\nViolence against the representatives would have been catastrophic—instantly creating irreconcilable hostility with fifteen kingdoms while breeding distrust among the citizens. Instead, Grid controlled his rage and weaponized Huroi's eloquence to paint the envoys as the corrupt ones. The representatives were now on the defensive.\n\n*Damn it, the atmosphere has turned against us.*\n\n*Our plan to intimidate the crowd and create fear—it's completely backfired.*\n\n*The people's loyalty toward Grid just *increased*. What is this? We handed him a victory on a silver platter!*\n\n*This is all Kons and Cudan's fault! If those cowards hadn't fled like ghosts, we'd still have the upper hand!*\n\n*Everyone, calm down. The public incitement failed, but nothing fundamental has changed. He still has to pay tribute. And when he does, he'll pay dearly for today's disrespect.*\n\n*Mm...*\n\nDespite the unexpected reversal, the representatives steadied themselves. They still held the winning position. Baron Biz of the Violet Kingdom seized the momentum.\n\n\"Grid!\" he bellowed. \"No amount of rhetoric can cover your evil deeds! The king is the highest existence! Regardless of reason, regicide cannot be forgiv—*Heok*?\"\n\nHe choked mid-sentence. Dozens of figures around Grid had drawn weapons simultaneously, their killing intent radiating like physical heat.\n\n\"D-Daring to threaten a representative...!\" Baron Biz's voice cracked. \"You have no basic sense! Harming representatives is tantamount to declaring war on our kingdoms!\"\n\n\"Shut up.\" Pon stepped forward, leveling his spear at the baron's throat. \"You think you can talk to our king like that and live? You said it yourself—the king is the highest existence. Isn't that right?\"\n\n\"U-Ugh...\"\n\nBaron Biz didn't want to acknowledge Grid's kingship, but his life hung in the balance. Terrified, he clamped his mouth shut, finally recognizing his error.\n\n*I got too excited!*\n\nSwept up in the moment, he'd overstepped catastrophically. While he couldn't accept Grid as king, that was merely *his* position. Grid's subordinates had every justification to take his head. Indeed, none of the other representatives moved to save him.\n\nGrid gazed down at the trembling baron, and a predatory smile crossed his face.\n\n\"Hey. You.\"\n\n\"...!\"\n\nBaron Biz flinched. Grid was staring at him with an expression that promised either salvation or doom.\n\n\"I'll give you a chance.\"\n\n\"A-A chance...?\"\n\n\"Yes. You deserve death, but I'm a benevolent person.\"\n\n\"...?\"\n\nWhat was Grid planning? Baron Biz couldn't read his intentions. Under the scrutiny of thousands, Grid rose from his throne.\n\n\"This is an opportunity for you to preserve your life, and an opportunity for me to demonstrate the Overgeared Kingdom's strength. Let's help each other.\"\n\n\"W-What kind of opportunity?\"\n\nBaron Biz leaned forward desperately. He would grasp any lifeline offered.\n\nGrid gestured toward the baron's waist. \"Looking at your build and that sheath, you've trained in swordsmanship?\"\n\n\"T-That's... correct.\"\n\n\"Good. A warrior should be able to defend himself.\" Grid's smile widened. \"Now, choose.\"\n\n\"Choose what...?\"\n\n\"Your opponent. Pick someone to fight. Win, and I'll forgive your transgression. But if you die in combat...\" Grid shrugged. \"That's your own fault. The Overgeared Kingdom bears no responsibility.\"\n\n\"...!!\"\n\nBaron Biz's heart hammered. A chance at survival! But the other representatives paled.\n\n*Grid is being clever!*\n\n*If Baron Biz dies this way, the Violet Kingdom can't hold Grid accountable!*\n\nBaron Briton of the Arc Kingdom protested loudly, \"You call this an opportunity?! You're planning to kill Baron Biz by forcing him against an opponent he can't defeat!\"\n\n\"What nonsense are you spouting?\" Grid clicked his tongue. \"Do you write novels in your spare time?\"\n\n\"...!\"\n\n\"I said he can *choose* his opponent.\"\n\n\"I-Is that true?\"\n\n\"Of course. Unlike you people, I don't lie.\"\n\n*I can live!*\n\nJoy surged through Baron Biz. He was stronger than most knights—if he could select his opponent, victory was guaranteed. His eyes scanned the assembled forces, and a dark smile spread across his face.\n\nThere. A blond soldier in worn leather armor, standing apart from the thousand elite knights clad in black plate.\n\n*Just look at this insignificant soldier! You're my opponent!*\n\nBaron Biz thrust his finger toward the blond man. \"I-I'll fight him!\"\n\nPeople might call him cowardly for selecting a common soldier, but survival trumped pride a thousand times over. Baron Biz braced for Grid's mockery, but instead received easy acceptance.\n\n\"The soldier. Very well.\"\n\nGrid winked at the blond man, who began walking toward Baron Biz. The baron looked significantly more imposing—taller, better equipped, trained in noble swordsmanship. How could a mere soldier pose any threat?\n\nAround the world, viewers groaned in frustration.\n\n**[JusticeWatch]:** *Seriously, what is Grid doing? Why give that bastard a chance to survive?*\n\n**[Disappointed]:** *This isn't good at all.*\n\n**[SympathyVoter]:** *That poor, innocent soldier... He picked the wrong master and now he'll be killed for it.*\n\nGlobal sympathy poured out for the soldier. They saw him as a victim of an unreasonable superior's whims.\n\nHowever, the soldier himself was smiling.\n\nHe faced Baron Biz and tied back the blond hair flowing beneath his helmet. The name of the soldier concealed by that helmet was **Asmophel**."
}