{
  "id": 603,
  "title": "Chapter 603",
  "content": "Grid fought to suppress a smile, the corner of his mouth twitching despite his best efforts.\n\n*As expected, he chose Asmophel.*\n\nOnly a thousand Overgeared soldiers were currently stationed in Reinhardt, but each one was an elite warrior who had completed their second class advancement and wore Grid's mass-produced equipment set. By appearance alone, they could easily be mistaken for knights of any other kingdom.\n\nAnd then there was Asmophel—a man who looked like the most ordinary soldier imaginable. He appeared to be the weakest fighter in all of Reinhardt. It had been laughably easy to predict that Baron Biz would select him as his opponent.\n\n*Did Lauel orchestrate this?*\n\nThe tactic was brilliant—engineer a situation where the death of a representative wouldn't create diplomatic complications for the Overgeared Kingdom. It seemed too clever to be Grid's work alone, so the Overgeared members naturally assumed Lauel had masterminded the entire scheme.\n\nBut they were wrong.\n\nGrid was handling the twelve representatives entirely on his own. He had created this situation through his own planning and execution. Lauel couldn't stop smiling as he watched from the sidelines.\n\n*Grid... your growth continues to ignite my passion. You've transcended the limits of your intellect. Hehehehe...*\n\nA thrill of excitement coursed through Lauel as he observed the scene unfold.\n\n\"Really?\" Baron Biz asked again, seeking confirmation. \"You'll spare me if I win against this soldier?\"\n\nGrid nodded once. \"I keep my promises. But don't forget—the Violet Kingdom cannot hold us responsible if you die.\"\n\n\"Understood!\" Baron Biz whirled toward his attendants and shouted, \"At this moment, I am not the representative of the Violet Kingdom! I am simply Baron Biz! Even if I die here, the Overgeared Kingdom will not have killed a diplomatic envoy! Is that clear?\"\n\nThe death penalty loomed over him, but here was a chance—however slim—to save his life. He couldn't let this opportunity slip away. Baron Biz was confident he could win this battle.\n\n*I'll kill this common soldier!*\n\n*Schwing!*\n\nBaron Biz drew his sword. Both his level and equipment were formidable.\n\n> Baron Biz's level is at minimum **250**. He also possesses the title 'Noble who Learned Swordsmanship,' which suggests he has Advanced Sword Mastery... He'll be stronger than most decent knights.\n\n> Then how can a mere soldier possibly defeat Baron Biz?\n\n> He's as good as dead. The outcome is obvious.\n\n> ...\n\nFoolish Grid! He'd had the perfect chance to eliminate a representative, yet he'd wasted it and sacrificed an innocent soldier in the process! This time, no one supported Grid's decision. The media and viewers alike thought he'd made a catastrophic mistake.\n\nThey had no idea how thoroughly the world was about to be turned on its head. Grid was a destroyer of common sense who consistently produced results that defied or exceeded all expectations.\n\n\"I will deliver the punishment of death to you who have despised and belittled my king,\" the soldier declared, sending forth waves of killing intent from eyes hidden deep within his helmet.\n\nBaron Biz glanced at the old, worn spear in the soldier's hands and laughed.\n\n\"Kukuk... a mere soldier spouting such ridiculous words.\"\n\nBaron Biz was certain of victory. If he combined his swordsmanship skills with his superior equipment, he would easily shatter both the spear and armor his opponent wore. The gap in their items and abilities was crystal clear.\n\n\"Haaap!\"\n\nBaron Biz exploded forward with practiced footwork—a high-ranking movement technique that closed the distance to a target in mere moments. It was a family secret, passed down through generations of his bloodline.\n\n—*It's over.*\n\nThe viewers mourned the soldier's imminent death. They were convinced he would die without even taking advantage of his spear's superior reach.\n\nIt was a meaningless prediction.\n\n*Thunk!*\n\n\"...!!!\"\n\n—*Huh?*\n\nBaron Biz had closed the distance without a single wasted movement, fast as lightning—but the soldier was far faster. Before Baron Biz's sword could strike the soldier's helmet, the spear had already pierced through his chest.\n\n\"Kuock!\" Baron Biz's face twisted in disbelief. How could this soldier's attack speed surpass his own? How had the spear torn through his armor in a single strike?\n\n\"This is a sca—!\"\n\n*This is fraud! Something's wrong! He's definitely cheating!*\n\nBut Baron Biz never finished voicing his protest. The soldier's spear struck his chest again in rapid succession.\n\n\"Cough! Ugh! Kuaaaack!\"\n\nHe could only scream. The relentless series of strikes gave Baron Biz no opportunity to mount any defense.\n\n\"...\"\n\n\"...\"\n\nEvery representative present, every player at the venue, every viewer watching the broadcast—all fell into stunned silence. Only the hosts of various broadcasting stations managed to speak, bound by their obligation to narrate events.\n\n> The soldier has completely overwhelmed a noble's swordsmanship! This is completely unexpected!\n\n> The difference in equipment means nothing against superior skill! What is this? The Overgeared Kingdom's soldiers are incredibly strong!\n\nThe world had been turned upside down by this shocking result. The person most stunned by the turn of events was naturally Baron Biz himself.\n\n*W-Who is this person?*\n\nHe'd thought his opponent was just a soldier. So what was this? Even the proud knights of the Violet Kingdom wouldn't be able to handle this soldier's spear!\n\n*Thud! Thunk!*\n\n\"Hik! Hiiiik!\"\n\nBaron Biz had polished his swordsmanship for many years. He desperately tried to deflect the soldier's spear with his sword, but it was a worthless effort. For every ten strikes the soldier launched, Baron Biz was hit ten times. No matter how aggressively he tried to resist, every defensive maneuver and evasion attempt ended in failure.\n\n\"You...! What the hell are you?!\" Baron Biz screamed through sprays of dark red blood. \"You can't be a soldier! Why are you pretending to be one?!\"\n\nThe viewers who had previously sympathized with the soldier now felt pity for Baron Biz.\n\n—*Baron Biz walked right into a trap. There's no way a common soldier could defeat a noble.*\n\n—*That's right. He doesn't seem like a soldier at all. He's probably a knight disguised as one.*\n\n—*Actually, doesn't this mean Grid predicted this exact situation and disguised a knight as a soldier?*\n\n—*Now that you mention it...*\n\nConfusion rippled through the audience. A \"soldier\" was demolishing Baron Biz. If this person wasn't actually a soldier, then Grid was a terrifying genius to have anticipated this scenario. If this person *was* a genuine soldier, then the Overgeared Kingdom possessed troops with strength rivaling other kingdoms' knights. Either interpretation led to the same conclusion—Grid and the Overgeared Kingdom were extraordinary.\n\n—*This is terrifying.*\n\n—*This is insane.*\n\n—*Grid and the Overgeared Kingdom are magnificent...*\n\nGrid's reputation soared exponentially from this single incident alone.\n\n*Grid's honor will be restored, and his reputation will climb even higher,* Asmophel thought, sensing the shift in public opinion. He brought the one-sided fight to an end. Baron Biz, beaten bloody and broken, died.\n\n*Thunk!*\n\n> [Baron Biz, representative of the Violet Kingdom, has died.]\n> [Due to the agreement made by Baron Biz, the Violet Kingdom cannot hold the Overgeared Kingdom responsible for his death.]\n\n\"What is this?\" The other representatives watched Baron Biz's death in horror, unable to comprehend the situation. They'd fallen into a carefully laid trap.\n\nBaron Briton of the Arc Kingdom shouted in outrage. \"Grid...! How can you be such a villainous person? Disguising a knight as a soldier just to trap Baron Biz!\"\n\n\"You.\" Grid pointed directly at Baron Briton. \"You pick next.\"\n\n\"...?\"\n\n\"You should be held accountable for accusing and taunting a king in his own kingdom,\" Grid declared. \"Just like Baron Biz.\"\n\n\"...!\"\n\nHe shouldn't have said anything! Baron Briton found himself in the exact same predicament as Baron Biz. His face drained of color as he realized there was no escape. He fought to maintain his composure as his eyes darted around the area, searching for a weak opponent—just as Baron Biz had done.\n\nThen he spotted one.\n\n\"I'll fight him!\" Baron Briton declared, pointing.\n\nThis person looked like the weakest one present. The choice was almost comically obvious.\n\nThe orator. The very orator who had spoken on Grid's behalf.\n\n\"Hoh... first a soldier, and now an orator.\" Grid's expression filled with interest while the Reinhardt residents erupted in outrage.\n\n\"Despicable bastard! You're pointing at an orator who's never held a blade in his life!\"\n\n\"Are all the nobles of the Arc Kingdom like you?\"\n\n\"Trying to fight someone whose weapon is words!\"\n\n\"Booooo!\"\n\n\"Booooooo!\"\n\nThe jeering and criticism continued unabated, but Baron Briton felt no shame. What good was honor if he was dead?\n\n*I refuse to die in this savage kingdom!*\n\nIt was his fervent belief. He couldn't die so easily, not here. Baron Briton gripped the mace hanging from his waist, ready to face his opponent.\n\nThen Orator Huroi summoned his wyvern.\n\n\"...??\"\n\n\"??????\"\n\n*KURARARARARARA!*\n\nBaron Briton and the residents alike stood frozen in shock as the massive red wyvern materialized and unleashed a torrent of flames. An orator had summoned a wyvern? Not just any wyvern, but the most powerful variety—a fire wyvern!\n\n\"W-Wait a minute... this is fraud!\"\n\n\"Your parents are fraud!\" Huroi shot back.\n\n\"What? What nonsense are you spouting? Kuaaaaaaah!\"\n\nTo have his parents insulted? By someone who was clearly scamming him? Baron Briton's rage and frustration peaked, but he was utterly helpless against the situation. He was consumed by the flames of Huroi's wyvern and died screaming."
}