{
  "id": 604,
  "title": "Chapter 604",
  "content": "The ten remaining representatives stood frozen, jaws slack and eyes wide. The demonstration of the Overgeared Kingdom's strength had struck them like a physical blow.\n\n*A soldier who's stronger than a knight...* one of them thought, his hands trembling slightly.\n\n*If this is the ability of a mere soldier, the talents of those thousand black-armored knights must be beyond imagination,* another realized, sweat beading on his forehead.\n\n*I can't believe the orator has a wyvern.*\n\n*This kingdom... it's truly formidable.*\n\nThe performance by the Overgeared Kingdom's soldier and orator had shattered every preconception they'd held.\n\nSeveral representatives coughed nervously, shifting their weight from foot to foot. A heavy silence descended as they grappled with their internal dilemma—should they really maintain their hostility toward the Overgeared Kingdom?\n\n*It would be better to hold hands,* one thought, his mind racing through the political implications.\n\nThe power structure of the continent had long been composed of one empire and fifteen kingdoms. The Saharan Empire reigned supreme—a young, ravenous lion circling fifteen bound rabbits. Those fifteen kingdoms lived in constant fear of being devoured, paying tribute to stave off their inevitable fate. The tribute they paid was astronomical, bleeding their treasuries dry and crippling their development. But now, the emergence of the Overgeared Kingdom was like a ray of hope breaking through storm clouds.\n\n*If we combined the forces of the Overgeared Kingdom with the three million troops from the fifteen kingdoms...*\n\n*We could become self-reliant. Break away from the empire's stranglehold.*\n\n*The timing is perfect. The empire is currently focused inward, consumed by its policy of exterminating minor species. They can't spare attention for external threats.*\n\nThe representatives' expressions shifted as they looked at Grid. The contempt and hostility that had hardened their features melted away, replaced by cautious anticipation.\n\n\"King Grid!\" someone shouted, courage surging through his voice.\n\nIt was Baron Guy of the Fold Kingdom.\n\n\"Please forgive my previous rudeness!\"\n\nWhat happened next defied all diplomatic protocol. Baron Guy locked eyes with Grid and deliberately tore the royal letter in his hand—ripping apart his own king's will in front of everyone. The paper shredded with audible tears. It was an act of political suicide, and everyone watching understood the gravity of it. Shock rippled through the crowd while Grid's eyebrow rose with interest.\n\n\"Do you mean to withdraw the words you said before?\" Grid asked.\n\n\"Indeed!\" Baron Guy declared, his voice ringing with newfound conviction. \"King Grid, I hope that the Overgeared Kingdom will be a permanent companion of the Fold Kingdom! I will give my king one hundred reasons why he should ally with the Overgeared Kingdom! Furthermore, I am convinced that my king will understand my explanation and reconcile with the Overgeared Kingdom! Overgeared is a great kingdom!\"\n\nGrid said nothing, his expression unreadable.\n\nThis was the same person who had demanded tribute mere minutes ago, dismissing both Grid and his kingdom with contempt. His attitude had pivoted on a coin's edge. He'd even betrayed his king's explicit orders, changing his position mid-mission. This unprecedented event would echo throughout the continent, spreading the Overgeared Kingdom's reputation like wildfire.\n\n*Very good. This is more than I expected,* Grid thought, satisfaction warming his chest.\n\nIf he allied with even a few of the fifteen kingdoms, the Overgeared Kingdom's foundation would solidify exponentially. While accumulating power to defend against the empire, he wouldn't need to waste resources worrying about petty provocations. Grid's mind painted a brilliant future.\n\n-Please refrain from replying and give honors to your retainers first.\n\nLauel's whisper cut through his thoughts. The strategist had been silently observing until now.\n\n*I don't know his intentions, but...*\n\nLauel was the person Grid trusted most. Without questioning the wisdom of it, Grid followed the advice. He deliberately ignored Baron Guy, who stood waiting for acknowledgment like a puppy expecting praise.\n\n\"...Rude,\" Baron Guy muttered, his face flushing crimson.\n\nHe had torn up his letter to demonstrate his sincerity, yet Grid had dismissed him like an annoying child rather than being moved by the gesture.\n\nThe other representatives exchanged disappointed glances, their eyes darting between Baron Guy and Grid.\n\n*Grid will never have a big vessel.*\n\n*Baron Guy acknowledged his mistake and offered a bright future, but Grid is still nursing his wounded pride.*\n\n*How can he rule over a kingdom when he's so narrow-minded?*\n\n*It isn't right to establish diplomatic relations with such a savage kingdom.*\n\nDisapproving clicks of tongues echoed among the representatives. They judged Grid pathetic, petty.\n\n\"Duke Lauel, come forward,\" Grid announced.\n\nGrid began calling his meritorious retainers in turn. Lauel was first to kneel before him. Grid handed him a pair of gauntlets—mysterious pieces of dark-colored metal with a glazed black surface. They were beautiful and elegant enough to capture anyone's attention, shimmering with an otherworldly quality.\n\n*But they're just gauntlets. The reward for the person who had the highest merit in establishing a kingdom...* one representative thought.\n\n*It's evidence that the Overgeared Kingdom is a small group of elites, but poor. The foundation will be stable by absorbing Marquis Steim's power, but they need our help.*\n\n*If the Overgeared Kingdom refuses to cooperate with us, only self-destruction awaits them.*\n\nGauntlets were items that protected the hands and forearms—defensive equipment. For a meritorious retainer, one should bestow a sword to cut down enemies or armor to defend against attacks. Grid's reward seemed trivial at best.\n\nThe representatives had just solidified this opinion when—\n\n\"Kukuk...! Kukukuk! <span class=\"myth\">Belial's Gauntlets</span>... This transcends my expectations. The hot skin of Belial sealed against my arms has succeeded in containing the aura of the dark dragon. Huhuhut!\" Lauel's voice dripped with theatrical satisfaction.\n\nHis reputation had spread across the fifteen kingdoms. The duke of the Overgeared Kingdom covered half his face with one hand, spouting incomprehensible nonsense. The representatives couldn't make heads or tails of what he was saying—which was natural. Even the Overgeared members who'd worked alongside Lauel for years still didn't understand half of what came out of his mouth.\n\nLauel turned his gaze toward the representatives. One eye was covered with a black eyepatch, giving him the appearance of an injured warrior.\n\n\"People from small and weak kingdoms,\" he announced, his visible eye gleaming with condescension, \"behold the great power that King Grid has entrusted to me.\"\n\n**Swipe.**\n\nYes, just a swipe. Lauel swiped his hand once. The motion seemed casual, but the wavelength it created was enormous.\n\n*Kakiing.*\n\nFive white spheres materialized from the fingertips of the gauntlets Lauel wore. The spheres pulsed with contradictory energies—hot fire and cool demonic energy swirling together.\n\n**Kwa kwa kwa kwang!**\n\nThe spheres shot toward the representatives like missiles, exploding at their feet. The representatives jerked back, shock rendering them motionless. Their expressions resembled startled fish—mouths gaping, eyes bulging stupidly. Lauel smirked at those who couldn't process what had just happened and moved his hand again.\n\nFive more white spheres materialized and flew toward the representatives' feet, detonating in sequence. Flames erupted from the explosions, and demonic energy polluted the atmosphere, making the air thick and oppressive.\n\nThe representatives gasped, understanding finally crashing over them like a wave.\n\n\"H-Heok!\"\n\n\"Unbelievable! Creating such powerful magic with just a wave of the hand!\"\n\n\"D-Don't tell me the power of those gauntlets...?\"\n\n*An artifact?* one thought desperately. *No, it's impossible. Pagma's Descendant, Grid—he might be a legendary blacksmith, but he doesn't have the capacity to produce artifacts. Artifact production is an area reserved for only the most exceptional magicians.*\n\n\"Marquis Piaro, come forward,\" Grid called.\n\nThe representatives scrambled to deny what their eyes had shown them, clinging to their disbelief about the gauntlets' power.\n\n**Step, step.**\n\nThis time, a middle-aged man climbed onto the stage.\n\nThe representatives blinked, then blinked again, doubting their eyes. The person ascending the platform was a middle-aged peasant farmer. He wore old clothes caked with dirt, and a variety of farming equipment hung from his waist—hoes, trowels, shears.\n\n*Crazy?*\n\nA marquis who was a farmer? No—a *farmer* marquis? This was absurd. A noble doing fieldwork? The very thought made several representatives feel physically ill.\n\n*No, set that aside for now.*\n\nThis was the founding ceremony, an occasion demanding formality. Basic etiquette required appropriate dress, even if this middle-aged Piaro truly was a farmer. What was he thinking, appearing in these filthy work clothes?\n\n*Not even understanding basic manners...*\n\n*The king has no foundation, and his subordinates are the same.*\n\nMore disapproving tongue-clicks rippled through the group. Then Grid handed Piaro a sickle and hand plow.\n\n\"In fact, I wanted to wear official clothing today,\" Piaro whispered while receiving the farming equipment, glancing around self-consciously. Grid had asked him to attend in his work clothes, but Piaro felt uncomfortable being so underdressed.\n\nGrid smiled and patted his shoulder reassuringly. \"Your official clothing *is* farming work clothes. From now on, you should also wear a straw hat.\"\n\nGrid's affection toward Piaro had grown boundless. Piaro was an absolute pillar of the Overgeared Kingdom's strength, and he'd given all the loot acquired from Belial to Grid without a moment's hesitation. Grid wanted to acknowledge Piaro fully and accept him as the farmer he was.\n\nPiaro's eyes shone with emotion. \"Your servant Piaro! I will devote myself even more to the field! I will provide enough food so that our citizens will never starve!\"\n\n\"...Farmer,\" one representative whispered.\n\n\"A real farmer!\" another confirmed, voice cracking.\n\nThe dubious representatives went pale when they heard Piaro's fervent cry. Seeing that a kingdom's marquis was genuinely a farmer short-circuited their understanding of proper nobility. Their minds reeled.\n\nThen Piaro descended from the stage and approached them.\n\nThe representatives flinched backward. Piaro possessed muscles that seemed harder than granite. As he stepped toward them in his dirt-covered clothes, gripping farming implements, the representatives couldn't help but shrink away.\n\n\"W-What...?\" one stammered.\n\n\"What are you trying to do?\" another demanded, voice pitched high with anxiety.\n\nThe sickle and hand plow looked unnervingly sharp in Piaro's calloused hands. The representatives gulped.\n\n\"H-Hik...!\"\n\nThe moment Piaro reached them, he raised both sickle and hand plow. The representatives tensed, convinced they were about to be slaughtered.\n\n**Flop!**\n\nPiaro suddenly squatted. He began digging at the ground that had been ruined by Lauel's magic bombardment—the scorched, contaminated earth. Then something miraculous happened. Plants began sprouting from the burnt soil, pushing up through the demonic pollution.\n\n\"H-Heok?\" \n\nRice grew before their eyes in mere seconds. What farmer possessed such power?\n\n*No, this doesn't make sense even for a farmer,* one thought frantically. *This must be the power of an artifact!*\n\n*It's clear that Grid's sickle and hand plow have the power to restore the earth!*\n\n*Grid! His blacksmithing abilities far surpass even Pagma's!*\n\nAdmiration, amazement, wonder, shock—the emotions cycled through the representatives' faces in rapid succession. Lauel observed their expressions carefully and whispered to Grid. Grid nodded, then finally turned his attention to Baron Guy of the Fold Kingdom.\n\n\"You want to hold hands with the Overgeared Kingdom?\" Grid asked.\n\n\"Yes...! Yes! Indeed!\" Baron Guy nodded vigorously, bobbing like a frightened bird.\n\n*If my kingdom doesn't form an alliance with Overgeared, we'll perish,* he thought desperately. *There are too many exceptional people in this kingdom.*\n\nGrid shook his head slowly.\n\n\"I will ask you again. You want to hold hands with the Overgeared Kingdom?\"\n\n\"...?\"\n\nBaron Guy's stomach dropped. The reaction was ominous, as if Grid wanted to reject the alliance outright.\n\nPanic seized him. \"King Grid! Please forgive my rudeness and think calmly! Right now, the continent is dominated by the Saharan Empire! No matter how wonderful King Grid and the Overgeared Kingdom are, you cannot deal with the empire alone! Ally with the Fold Kingdom for your future!\"\n\n\"I agree that it is better to be together,\" Grid said evenly. \"But I don't want an alliance.\"\n\n\"...Huh?\"\n\n*No alliance?* Baron Guy's mind went blank as Grid opened his inventory. He pulled out all the magic battle gear he had created—piece after gleaming piece—and distributed them to the God Hands, Noe, and Randy. It was a calculated display of wealth and power.\n\nGrid grinned, addressing all the representatives, including Baron Guy.\n\n\"Serve the Overgeared Kingdom.\"\n\n\"....!!\"\n\nThe representatives stood thunderstruck. How many times would they be shocked during this founding ceremony? The answer, evidently, was as many times as Grid deemed necessary.\n\nThanks to this spectacle, sky-high ratings were guaranteed. The executives and employees of broadcasting companies across the continent praised Grid's name, their coffers swelling with advertising revenue."
}