{
  "id": 605,
  "title": "Chapter 605",
  "content": "# Chapter: The Sixth Knight\n\nReidorn.\n\nOne of the solo number knights—elite warriors considered to have surpassed even Piaro, the former pillar of the empire. As the sixth knight, his power eclipsed that of the eighth and ninth, marking him as a catastrophic force capable of razing entire nations.\n\nAnd now, this living weapon stood among the crowd at the Overgeared Kingdom's founding ceremony.\n\n*Grid... He may be far more dangerous than our intelligence suggested.*\n\nCaution defined Reidorn's nature. While the empire dismissed Grid as a temporary nuisance, confident the Overgeared Kingdom would collapse under its own weight, Reidorn had watched. He had observed. Grid's actions warranted objective evaluation—the man had wrought miracles as the descendant of a legend.\n\n*Then there's the rumor about his forces and the Rebecca Church sealing a great demon.*\n\nInitially, Reidorn had dismissed it as propaganda—a convenient lie to legitimize Grid's seizure of power and mislead the masses. That was before the ceremony began. After surveying Reinhardt, however, amazement had replaced skepticism. Three Rebecca temples were under construction within the city limits.\n\nOnly a handful of cities outside the imperial capital boasted three or more temples. Such favor from the Church wasn't granted lightly—certainly not to a fledgling kingdom unless the rumors held truth. A great demon had indeed been sealed.\n\n*The demon's power may have been weaker than anticipated, but that doesn't diminish Grid's threat.*\n\nDecision crystallized in Reidorn's mind. He had come here today, and today he would kill Grid and shatter this kingdom before it could threaten the empire's dominance.\n\n*Time to begin.*\n\nHesitation fell away. He wore no red armor, concealing his identity, but felt no particular fear. Armor? Unnecessary. His talent lay in cutting down enemies before they even realized his blade had moved.\n\n*Step. Step.*\n\nReidorn slipped through the crowd, approaching the stage with measured steps.\n\n\"Piaro, come forward.\"\n\n*Piaro?!*\n\nReidorn froze. That name—the former Red Knights' chief, the pillar of the empire who had defected after his betrayal. Why would that name be spoken here?\n\n*The traitor... He's been actively working in this region?!*\n\nHis throat constricted. Knights one through seven had been selected and trained to surpass Piaro's abilities. Yes, Reidorn was superior. But the Piaro of old had been *great*. Instinct screamed at him, and his body locked in place like petrified wood. Destroying the Overgeared Guild, Grid included? He could manage that. But facing Piaro...\n\n*Wait. No.*\n\nReidorn pressed deeper into the crowd, expression twisting as he watched the stage. The person called forward walked into view—and looked nothing like the legendary swordsman. This Piaro wore a farmer's clothes and carried agricultural tools.\n\n*Just someone with the same name?*\n\nDamn it, he'd been frightened over nothing. Reidorn exhaled sharply and began moving again, dismissing the farmer as he restored scorched earth with magically-enhanced equipment. His focus returned to Grid.\n\n*I will destroy you and your kingdom today, for the empire's glory.*\n\n*Kkuok!*\n\nReidorn steadied his spooked heart and laid his hand on his sheath. The precursor to Sun Cut—the strongest sword-drawing technique on the West Continent, passed down through generations of a royal family until the empire crushed their kingdom. Reidorn had claimed it upon qualifying as the sixth knight. A technique capable of splitting castles.\n\nThe blade began its emergence, brilliant aura gathering like condensed sunlight—\n\n\"Serve the Overgeared Kingdom.\"\n\n\"...!!\"\n\nGrid's declaration to the assembled representatives shattered Reidorn's concentration. His hand stilled on the hilt as representatives and onlookers alike stared in disbelief.\n\n\"What is this absurdity?\"\n\nThe Overgeared Kingdom—established mere hours ago—was demanding fealty from fifteen kingdoms steeped in centuries of history and tradition? It sounded mad. Even Reidorn, assassin though he was, felt stunned by the audacity.\n\nThe sheer lunacy of the statement seemed to rob the representatives of coherent anger. Then Grid continued, expression perfectly sincere:\n\n\"It would benefit you more to serve me than the empire, who bleeds your treasuries dry with excessive tributes that stunt your growth. I'm not as unscrupulous as the emperor.\"\n\nRed-faced fury swept across the representatives. Bloodshot eyes bulged. A kingdom without roots, a nation that could crumble tomorrow—and *this* was their king? Yet none dared speak carelessly, not after witnessing what had befallen the previous delegates who'd challenged him.\n\nBaron Guy barely suppressed his rage. \"Our fifteen kingdoms pay tribute to the Saharan Empire because they command overwhelming military might. Force sufficient to annihilate all fifteen of us simultaneously. But the Overgeared Kingdom?\" His voice dripped with skepticism. \"I acknowledge your personal power, Your Majesty. But can you alone subjugate fifteen kingdoms?\"\n\nBaron Guy didn't wait for a reply. If Grid said yes, it would only confirm his delusion.\n\n*He's not worth conversing with.*\n\nThe Baron bowed his head in disappointment, turning to leave—\n\n\"Of course not.\"\n\n\"...?\"\n\nBaron Guy hesitated. Grid's answer contradicted expectations, yet his expression remained confident.\n\n\"The Overgeared Kingdom is still weak. We cannot compare to the empire, which could crush your kingdoms individually. But that's merely the present situation. Watch closely.\"\n\n*Suuk.*\n\nGrid glanced toward Noe.\n\n\"Nyang.\"\n\nWhether from lack of exercise or natural growth, Noe had grown plumper—doubling his already considerable cuteness. Chubby cheeks and a wide mouth practically begged to be pinched.\n\n\"Ahem.\"\n\nGrid ignored the adorable display to preserve his dignity, accepting an item from Noe's dimensional storage.\n\n---\n\n**[<span class=\"myth\">Belial's Sheath</span>]**\n\n**Durability:** 916/916  \n**Attack Power:** 350\n\n* Sword drawing speed +50%\n* Sword recovery speed +60%  \n* Sword drawing skill damage +150%\n* Drawing a sword triggers **Magic Missile (Enhanced)**, dealing 4,000 fixed damage\n* Targets struck by **Magic Missile (Enhanced)** suffer 1,500 fire damage per second for 20 seconds. Demonic energy reduces attack and defense by 20% (or increases attack and defense by 20% if target possesses dark attribute)\n\n*A sheath crafted by blacksmith Grid—now approaching mythological status—from the enchanted bones of great demon Belial. It combines Great Magician Braham's enhanced magic with Belial's fire and dark energy. The exceptional durability and attack power allow this sheath to function as a weapon in its own right. The structure is optimized for sword-drawing techniques.*\n\n---\n\nPeak Sword had led his three hundred Silver Knights into Overgeared's service. He'd struggled ceaselessly for Grid and the guild—and during the battle for Cork Island, his achievements had brought the Eternal navy to the brink of collapse. His name graced the list of meritorious retainers, and this sheath had been forged specifically for him, with perfect compatibility.\n\nGrid placed the **+7 Sword Ghost** into Belial's Sheath, then assumed a sword-drawing stance. Though he possessed no dedicated quick-draw skills, his exceptional stats and equipment would suffice. He intended to demonstrate the power of his magic battle gear to the representatives—to earn their trust through overwhelming force.\n\n\"If you serve the Overgeared Kingdom, I will provide items of this caliber. You will gain power sufficient to resist the empire. **Transcend**!\"\n\n*Kuoooh!*\n\nThe atmosphere trembled. To properly showcase the sheath's brilliance, Grid needed to amplify his base attack power and convert it to ranged damage.\n\n\"**Blacksmith's Rage. Blackening.**\"\n\n*Kuwaaaang!*\n\nAfter activating his buff, he equipped Dark Bus's Earrings and triggered the more potent Blackening transformation. Forming a party with Kraugel further amplified his swordsmanship. The moment he prepared to split the sky with his technique—\n\n\"You! You've already discovered my presence, and now you dare provoke me?\"\n\n\"...What?\"\n\nSomeone burst from the crowd, charging toward Grid.\n\n\"How dare you attempt a sword-drawing technique before *me*, Reidorn? Your arrogance pierces the heavens themselves!\"\n\n\"Reidorn?\"\n\n*...Who?*\n\nGrid and every Overgeared member stood frozen. Some deranged NPC had erupted from the audience. Baron Guy, however, looked as though he'd seen a ghost.\n\n*S-Solo number knight...! He's not wearing the red armor, but I'm certain—that's a solo number knight!*\n\nReidorn. The Saharan Empire's supreme quick-draw swordsman. Baron Guy knew him intimately. Five years ago, Reidorn had visited the Fold Kingdom when it attempted to strengthen its military and escape imperial dominance. His demonstration had been *terrifying*. Even now, the memory made Baron Guy's hands shake.\n\n*Dozens of knights and soldiers fell each time he drew his blade...*\n\nNo exaggeration. The elite warriors the Fold Kingdom had cultivated with such pride died without comprehending their deaths. Reidorn's drawn sword moved like lightning given form.\n\n*His presence here means...*\n\nThe Overgeared Kingdom would be destroyed. Today. Now. And Baron Guy—\n\n*He saw me attempting to ally with Grid!*\n\nThe Fold Kingdom was finished. Everything he'd worked for, gone.\n\n*It's over!*\n\nTears streamed down Baron Guy's face as he trembled. He'd torn up the king's letter for his kingdom's sake, but now it faced annihilation anyway. Guilt crashed over him like a tidal wave.\n\n\"What are you doing?\"\n\nGrid's expression showed displeasure rather than fear. His eyes narrowed. No signs of nervousness. Reidorn leaned forward into a sword-drawing stance.\n\n\"Why this pretense of ignorance? Do you seek to enrage me further? Foolish!\"\n\n*Supaak!*\n\nSolar brilliance erupted from Reidorn's waist. Sun Cut—the ultimate sword-drawing technique. Unavoidable. The moment Grid tensed, the God Hands, Randy, and Noe flew to intercept.\n\n\"Kya!\"\n\n\"Kyaaak!\"\n\nNoe and Randy couldn't react to Sun Cut's speed. The flash bisected their forms before any skill could activate. The God Hands fared no better. Despite wielding magical weapons intended for the meritorious retainers—equipment loaded with devastating skills—the flash passed through them and reached Grid before they could trigger a single ability.\n\n\"Kuk!\"\n\n*Sakak—!*\n\nBlood sprayed from Grid's chest as—\n\n*Kuwaaaaaang!*\n\n—Grid completed his own sword draw. The **+7 Sword Ghost** erupted from Belial's Sheath with a feral roar.\n\n\"What?\"\n\nReidorn's eyes widened. A massive flash of white light, followed by waves of fire and demonic energy, bore down on him. The power seemed to eclipse even the sun.\n\n\"This is impossible...!\"\n\nHe frantically materialized his red armor, but—\n\n*Kwa kwa kwa kwang!*\n\n—too late. The blast swept Reidorn away. He tumbled through the air, coughing blood as Overgeared members swarmed his position.\n\n\"Ugh! *Keok!* Eek! *Eek!*\"\n\n\"Wow, he survived. That armor's tough as hell.\"\n\n\"I don't think this is some common named NPC... Throw him in the dungeon.\"\n\n\"...\"\n\nA solo number knight. The sixth knight. Dominated in an instant?\n\n*Flop!*\n\nBaron Guy prostrated himself before Grid.\n\n\"The Fold Kingdom will serve the Overgeared Kingdom! I will stake my life and honor to convince my king!\"\n\n\"Eh? R-Really?\"\n\n*Was the demonstration really that impressive?* Grid scratched his head, genuinely baffled. The other representatives stared at Baron Guy as though he'd lost his mind.\n\nThe founding ceremony concluded amid a series of disturbances and shocking incidents."
}