{
  "id": 608,
  "title": "Chapter 608",
  "content": "# Chapter: The Griffin's Nest\n\n*Where is that blond soldier?*\n\nBefore heading to the griffin's nest, Coke visited the barracks with one goal in mind: to recruit the mysterious warrior who'd made such an impression on him. The man he sought had escorted Grid during the legendary 100,000 versus one battle at Bairan, and later overwhelmed a noble NPC at the Overgeared Kingdom's founding ceremony with casual ease.\n\nMost players recognized him as a grandmaster hiding in plain sight—he'd appeared on broadcasts often enough. Of course, only a handful of Overgeared's inner circle knew his true identity: Asmophel, the former Red Knight.\n\n*I need his help.*\n\nCoke understood that most Overgeared soldiers were exceptional talents. Particularly those stationed at Reinhardt—the majority had completed their second advancement, their equipment often mistaken for that of knights rather than common footmen.\n\nBut the one horned griffins were different. They required more than ordinary soldiers, no matter how well-trained.\n\nYet the blond soldier was nowhere to be found in the barracks.\n\n\"What assistance do you require?\"\n\nCoke turned. A middle-aged soldier approached, gentle eyes visible through the visor of his black helmet. The man had clearly noticed Coke's Kingdom Quest marker—the telltale sign of someone acting in the King's name.\n\n\"Our soldiers will fulfill whatever need you have,\" the man continued. \"We stand ready to help.\"\n\n\"I'm looking for a specific soldier,\" Coke said. \"Blond hair, uses a spear?\"\n\nThe middle-aged soldier tilted his head. \"A blond spearman?\"\n\nAll Overgeared soldiers wielded spears with competence—they'd been trained in Reidan's Spearsmanship by both Piaro and Asmophel. The style originated from the Saharan Empire's martial traditions, refined over centuries...\n\n*Golden-haired soldiers aren't exactly common, but there are a few.*\n\nThe soldier scanned the barracks, then pointed. \"Rio's skilled with the spear.\"\n\nA young soldier with bright blond hair turned at the mention of his name.\n\n\"Rio!\" Coke's face lit up. *That must be him!*\n\n\"I need soldiers to help hunt the one horned griffins,\" Coke announced. \"Rio included.\"\n\n\"Understood.\"\n\n> [You have received support from five Reinhardt soldiers. Quest rewards will be shared accordingly.]\n>\n> [WARNING: If a soldier dies during this quest, you must reimburse the Kingdom for training costs and equipment value.]\n\n*Damn.*\n\nThere was the catch. This was precisely why most players avoided requesting soldier support for Kingdom Quests. Not only did rewards get split, but the compensation system was brutally expensive.\n\nFrom the Kingdom's perspective, though, it made perfect sense. Without such safeguards, malicious players could intentionally kill soldiers to steal their gear.\n\n\"What exactly is a one horned griffin?\" Rio asked as they left the barracks. \"I know griffins, but I've never heard of this variant.\"\n\nCoke froze mid-step.\n\n*How can Reinhardt's soldiers not know about top-tier monsters in their own backyard?*\n\nReality struck him. Every organization had its spectrum of talent. The Overgeared army might be exceptional overall, but not every single soldier could be elite.\n\n\"They're three times stronger than regular griffins,\" Coke explained carefully. \"Level 300 monsters.\"\n\nHe pulled up the party information.\n\n> **[Rio]**\n> Level: 205\n> Occupation: Overgeared Kingdom Soldier\n>\n> **[Gashu]**\n> Level: 206  \n> Occupation: Overgeared Kingdom Soldier\n\nAll five soldiers hovered in the early 200s. Including Rio.\n\n*Why would Rio—no, wait. Don't tell me...*\n\nAt the gates, Coke swallowed hard. \"Rio... were you the one who fought the noble representative at the founding ceremony?\"\n\n\"Hm? That wasn't me.\"\n\n\"...\"\n\nCoke's hand moved toward his quest interface, ready to abandon the whole endeavor.\n\nThen he noticed his viewer count.\n\n*What? Why are there so many people watching?*\n\nHundreds of players had gathered, all eager to see what the self-proclaimed \"peak second generation rookie\" would do next. How would he handle adversity? Would he praise Grid's wisdom or admit defeat?\n\n*Shit.*\n\nCoke had idolized Grid since the 1st National Competition. Where Grid was called God, Coke aspired to similar heights. He still treasured the signature he'd gotten when they met at Patrian years ago.\n\n*I can't disgrace God Grid. Not in front of all these people.*\n\nA true fan protected their idol's reputation.\n\nCoke squared his shoulders. He'd push through.\n\n*Five one horned griffins. If I use the soldiers to manage aggro, I can take them one at a time.*\n\nHe was the strongest of the second generation rookies—as talented as Lauel, who'd been praised as a heavenly genius.\n\n*I won't be afraid of mere monsters!*\n\nHis jaw set with determination, fists clenched.\n\nBehind him, the five soldiers yawned.\n\nThey'd visited vampire cities immediately after the founding ceremony, then spent the past month on security rotations without a break. The Overgeared Kingdom still suffered from manpower shortages, forcing the soldiers through one hardship after another.\n\nBut those hardships had yielded results—new skills, increased stats, invaluable experience.\n\n---\n\n## Griffin's Nest\n\nThe hunting ground sprawled south of Reinhardt, home to level 250 griffins and the occasional field boss: the one horned griffin. Their population required constant culling, lest they invade neighboring habitats and destroy the ecosystem.\n\nWhy did that matter if monsters just killed other monsters?\n\nTerritory value in Satisfy depended heavily on hunting ground diversity. Reinhardt needed to support players of all levels—allowing one dominant species free rein would ruin that balance.\n\n\"Hello, dear viewers!\" A cheerful woman's voice cut through the afternoon air. \"I'm Bunny Bunny with *Overgeared Kingdom Today*. Right now, we're at the griffin's nest. Can you guess why?\"\n\nThe livestream chat erupted:\n\n—*Don't ask rhetorical questions*\n\n—*Your ratings have been tanking lately. Where's the hard-hitting journalism?*\n\n\"Because we're covering the peak second generation rookie, Coke!\"\n\n—*Oh shit, for real?*\n\n—*Coke? Isn't he that corpse-eater guy?*\n\n—*Yeah, when he consumes monster corpses, there's a rare chance he learns new skills or raises certain stats*\n\n—*Completely broken ability. His skill catalog is insane*\n\n—*I heard most of the individual skills are mediocre quality, though*\n\n—*True, but he's called the strongest second gen rookie because of how efficiently he combines them*\n\nBunny Bunny grinned at her camera. \"Most viewers probably think Coke will breeze through regular griffins. But here's the twist—he's not hunting normal griffins. He's hunting **one horned griffins**! Five of them!\"\n\n—*Wait, what?*\n\n—*Those are unique to Reinhardt's territory*\n\n—*They're hard as gargoyles but can shoot beams from their horn*\n\n—*Jesus. Medium-tier field boss. Can't be brute-forced with levels or gear alone*\n\n—*Who's in his party?*\n\n—*Five soldiers*\n\n—*...*\n\n—*;;;;;;;*\n\nThose familiar with one horned griffins thought Coke had lost his mind. The creatures were legitimately dangerous.\n\nMeanwhile, the man himself entered the nest with conviction burning in his chest.\n\n*I'll prove it. God Grid wouldn't give us an impossible quest without deeper meaning.*\n\nMotivation surged through him.\n\nThe five soldiers, by contrast, seemed utterly relaxed.\n\n\"So these one horned griffins can fly?\" one asked casually.\n\n\"That's right.\"\n\n\"Should be fun to hunt, then.\"\n\n\"Hahaha!\"\n\n\"...\"\n\nTheir nonchalance stoked Coke's anxiety. They showed no tension, no awareness of the danger. It was difficult to trust them.\n\n*No... it's fine. Stay focused.*\n\nCoke's reputation stat was high enough that the soldiers would follow his commands. He'd led countless raid parties before. This was no different.\n\n*I've got this. I'll show everyone. I'll become a god myself.*\n\nCoke acknowledged only two people in the world as his peers: Grid and himself.\n\n\"Let's move out!\" he shouted confidently.\n\nThey advanced toward the deeper nest, where the one horned griffins roosted. Normal griffins attacked along the way—sharp beaks flashing, powerful hindquarters propelling them forward with bull-like strength.\n\nCoke didn't flinch.\n\n\"**Grid's Sword Dance: Kill!**\"\n\n> [You have used **Sharp Stab**.]\n>\n> [Critical Hit!]\n\n\"**Grid's Sword Dance: Wave!**\"\n\n> [You have used **Rotation Cut**.]\n\n\"**Grid's Sword Dance: Linked Kill!**\"\n\n> [You have used **Continuous Stab**.]\n\nGriffins collapsed in his wake. The viewers typed their admiration in chat. The soldiers clapped and cheered.\n\n\"Hah... hah... finally...\"\n\nCoke and his team reached the one horned griffin habitat.\n\nThe creature was approximately 1.5 times smaller than typical griffins, but its wings were proportionally larger—every feather resembled a blade, sharp and hard as steel.\n\n*Kyaaaak!*\n\nThe one horned griffin spotted the intruders. Blue energy gathered at the horn jutting from its forehead.\n\n*Peeng!*\n\n\"Kuk!\"\n\nFar faster than Coke anticipated. The beam lanced through his chest before he could dodge.\n\n> [You have suffered catastrophic damage!]\n>\n> [You cannot regain your mental state!]\n>\n> [Passive Skill **'100 Year Golem's Patience'** has activated. Stun duration reduced by half.]\n\n\"S-shit...\"\n\nTwo seconds. He couldn't move a muscle, couldn't even think clearly.\n\nAnd the griffin's horn was already gathering energy for a second shot.\n\n*I'm going to die!*\n\nThen a soldier's voice cut through his panic: \"Take out the harpoons.\"\n\n*Thunk! Thunk!*\n\nThe five soldiers drove massive stakes into the ground, chains rattling as they secured them.\n\n\"W-what...?\"\n\nCoke and the viewers stared in shock at the weapons being assembled—chains connected to massive harpoons, the kind designed to bring down creatures far larger than griffins.\n\n\"Let's show them the throwing techniques we developed against those bats in the vampire cities,\" Rio said with a grin.\n\n> <span class=\"legendary\">**[Dragon Harpoon]**</span>\n\nThe very same weapon Grid had wielded during the drake raid at the 2nd National Competition.\n\nCoke's eyes widened. *How...?*"
}