{
  "id": 609,
  "title": "Chapter 609",
  "content": "# Rewritten Text\n\n---\n\n**Puoook!**\n\n*Kieeek! Kiek!*\n\nOne of the soldiers hurled his harpoon with practiced precision. The weapon punched through scale and sinew, eliciting a shriek of agony from the griffin. The Dragon Harpoon—deadly against flying monsters and large beasts alike—had found its mark. With five harpoons arcing through the air simultaneously, the one-horned griffin had no chance to evade them all.\n\n\"Now!\" Rio roared, his voice cutting through the creature's cries.\n\n\"Got it!\" another soldier answered.\n\nAll five soldiers seized the chains attached to the embedded harpoons and hauled backward in unison.\n\n*Kuwuong!*\n\nThe one-horned griffin plummeted earthward like a meteor, its massive body cratering the ground on impact. Dust and debris exploded outward from the point of collision.\n\n\"Wow...\" Coke breathed, still frozen in place despite having recovered from his stunned state moments ago.\n\n*The one-horned griffin neutralized in an instant? By ordinary soldiers?*\n\n\"What are you standing there for?\" Rio barked at him.\n\n\"Come on, dogpile it!\" Gashu added, already advancing with his spear ready.\n\n*Dogpile it?*\n\nCoke blinked at the unfamiliar slang—the Overgeared soldiers, Grid's direct subordinates, peppered their speech with Korean expressions—but the situation made the meaning clear enough. He charged forward and targeted the griffin's horn, his blade flashing.\n\n*Kik. Kieeek!*\n\nThe creature thrashed and bucked, desperate to break free, but the soldiers moved with the coordination of veterans. They maintained constant tension on the chains, extending the binding duration of the harpoons while simultaneously launching fresh ones. The griffin's struggling only embedded the barbed tips deeper. Thanks to their relentless support, Coke found himself in an almost straightforward hunt against a Level 300 boss monster. He unleashed every spell and skill at his disposal, magical energy cascading toward the pinned beast.\n\n> **Your level has risen!**\n\n> **Your level has risen!**\n\n> **The feather of a one-horned griffin has been acquired.**\n\n> **The beak of a one-horned griffin has been acquired.**\n\n> **The spellbook 'Wind Cutter' has been acquired.**\n\n> **Reinhardt Soldier Rio has leveled up.**\n\n> **Reinhardt Soldier Gashu has leveled up.**\n\n\"A-Amazing...\" Coke stammered, chest heaving as the griffin dissolved into motes of light.\n\nHe'd hoped to complete this quest through clever tactics and perseverance. But he hadn't expected it to be this... *manageable*. At this moment, a revelation crystallized in Coke's mind.\n\n\"Everything is God Grid's arrangement!\" he declared, eyes shining with fervent conviction.\n\n*That's why Grid assigned such difficult quests! He knew the soldiers would help us grow stronger!*\n\nIndeed, Grid was great. No—Grid was a genius. Coke's heart swelled with admiration for his king's foresight.\n\nThe soldiers approached the still-thrilled young man and extended their palms expectantly.\n\n\"Hand over the loot,\" Rio said matter-of-factly.\n\nGashu nodded. \"We fought together, so the rewards should naturally be shared.\"\n\n\"Yes...? No, wait—I'll share it later when I receive the quest reward...\" Coke protested weakly.\n\n\"Hey, friend,\" Rio interrupted, his tone patient but firm. \"The mission reward is your salary from the kingdom. The shares from hunting monsters are calculated separately.\"\n\nGashu crossed his arms. \"King Grid always says this: Take care of your own rice bowl.\"\n\n\"...\" Coke's mouth opened and closed soundlessly, his dreams of easy wealth evaporating.\n\n---\n\nOn that day, the Overgeared Kingdom became the hottest topic on community sites across every nation. It had been some time since the founding ceremony, but the buzz had never truly died down.\n\n**-It's easy to ride the soldiers' bus if you're a citizen of Overgeared. I want to immigrate to the Overgeared Kingdom.**\n\n**-But the soldiers are expensive...**\n\n**-Still, the results are worth the investment...**\n\n**-Isn't this a private jet instead of a bus?**\n\nThanks to Coke's enthusiastic evangelism and the publicity effect of *Overgeared Kingdom Today*, the player population began increasing at an exponential rate. Within weeks, it had surpassed fifty thousand.\n\n---\n\n\"There are only a thousand soldiers stationed in Reinhardt,\" Lauel said, rubbing his temples with both hands. \"They can't possibly support every player's quest. Please, *please* adjust the difficulty of the quests from now on. Yes, Your Majesty?\"\n\nGrid cleared his throat awkwardly. \"Hum hum. But the results are good, aren't they? Our player population exceeds fifty thousand now, and our total population is approaching eight hundred thousand.\"\n\n\"You should exercise more caution,\" Lauel insisted, his expression grave. \"Your position is vastly different from what it once was. Don't forget—your actions directly affect the lives of hundreds of thousands of people.\"\n\nGrid's shoulders slumped slightly. \"...I'm sorry. But now that the population has increased, won't our tax revenue also increase?\"\n\n\"There's still no profit,\" Lauel replied, spreading several ledgers across the desk. \"As you're aware, the investment costs for developing a kingdom are astronomical. If it weren't for Duke Steim's financial support, we'd be running a deficit right now.\"\n\nCurrently, the Overgeared Kingdom encompassed sixteen territories.\n\nSix of the northern territories were efficiently administered by Duke Steim, but the remaining ten territories devoured gold like bottomless pits. The massive expenditures stemmed from systematically erasing all remnants of the Eternal Kingdom while simultaneously developing domestic affairs, cultural institutions, and infrastructure from the ground up.\n\n\"Aren't you being too thorough about removing Eternal's traces?\" Grid asked. \"The financial damage is substantial.\"\n\nLauel's eyes narrowed. \"It has an adverse psychological effect on the populace. If remnants of Eternal remain throughout our territory, it will trigger nostalgia among former Eternal citizens. That nostalgia breeds problems—dissent, rebellion, divided loyalties.\"\n\n\"The comparison feels thin,\" Grid muttered.\n\n\"If you're referencing the period when Japan occupied Korea...\" Lauel paused, reading Grid's expression. \"Sorry.\"\n\n\"No, it's fine. I was joking—I didn't mean to imply criticism.\" Grid waved dismissively. \"I trust and respect your judgment. But there's one thing I can't reconcile: Reidan. Are you *still* pouring massive amounts of gold into those alchemy facilities?\"\n\nLauel believed that alchemy's advancement was directly linked to national wealth, but Grid remained unconvinced. \n\n*Alchemy can add options to items? Nonsense. Those facilities only produce garbage options with terrible success rates!*\n\nGrid's jaw tightened as bitter memories resurfaced, while Lauel offered an understanding smile.\n\n\"As I've mentioned repeatedly, the synergy between alchemy and blacksmithing will eventually prove invaluable. We've already invested too much capital to abandon the project now. The sunk costs are simply too great.\"\n\n\"Well, if you insist...\" Grid sighed. \"Alright, I understand.\"\n\n\"Don't think so negatively about it,\" Lauel continued, his tone brightening. \"The alchemy facility is already playing a crucial role, isn't it? The potions produced there have dramatically increased the survival rate of our soldiers.\"\n\n\"...The potions are also prohibitively expensive,\" Grid grumbled.\n\n\"Better than losing trained soldiers,\" Lauel countered.\n\n\"That's true. You're right,\" Grid conceded.\n\nGrid knew Lauel's reasoning was 100% sound. Ever since various advanced medicines began being supplied to the Overgeared soldiers, their survival rate had climbed to nearly 100%. Considering the time, effort, and resources invested in training each soldier, he shouldn't balk at the cost of potions.\n\n*I can't stay rational when it comes to alchemy,* Grid admitted to himself. *I need to be more careful about my biases.*\n\nLauel shifted topics. \"Are you planning to attend the talent selection competition?\"\n\nA large-scale recruitment event hosted by the Overgeared Kingdom—with screening conducted by senior guild members—would be held in Reinhardt next week. The goal was to identify individuals with exceptional talent in specific fields: military command, intelligence gathering, crafting professions, and support roles.\n\nGrid answered without hesitation. \"Can't you select capable people even without my presence? Your eye for talent far exceeds mine. I don't see the point of wasting hours sitting in judgment. That time would be better spent forging items.\"\n\n\"But wouldn't it be pleasant to enjoy the privileges of kingship occasionally?\" Lauel suggested. \"Based on recent reports, you can afford to spare some time.\"\n\nGrid had been fulfilling his responsibilities diligently. While most of the administrative burden fell to Lauel, Grid hadn't neglected his own duties. Recently, he'd undertaken the grueling task of training large numbers of blacksmiths—a process that demanded daily observation using the Great Lord's Sword to screen candidates with genuine aptitude, followed by intensive personal instruction.\n\n\"I can't afford to relax until we have at least a hundred **Advanced Blacksmiths**,\" Grid declared. \"The Overgeared Kingdom will be a kingdom of master craftsmen.\"\n\nGrid's obsession with cultivating advanced blacksmiths stemmed from practical necessity. Advanced Blacksmiths could not only perform standard smithing work but also serve as skilled assistants when Grid tackled complex projects. The production time for high-level items decreased dramatically when he worked with an advanced blacksmith's support compared to laboring alone.\n\n\"Very well. I'll trust your judgment, as always,\" Lauel said.\n\n\"Thank you.\"\n\nGrid and Lauel locked eyes—two men who harbored no doubts about one another. Their mutual trust ran bone-deep. They were king and subject, guildmaster and member, and above all else, true friends.\n\n---\n\n\"Damn it, what is this? The Empire's power exceeds all imagination!\" Ares cursed, his usual composure shattered.\n\nTaturans Plains. A massive military engagement raged along the contested border between the Saharan Empire and Belto Kingdom. God of War Ares directed Belto's forces, while 1st Knight Mercedes commanded the imperial legions. Rivers of blood carved through trampled earth as the two armies clashed in brutal melee. After three days and nights of continuous warfare, Ares' army found itself pushed onto the defensive.\n\n\"Lim Cheolho, that bastard!\" Ares spat, his face twisted with rare frustration.\n\nAres, who remained collected even when facing Kraugel, couldn't suppress his grimace now. The Empire's military might exceeded every calculation, every contingency plan. It felt as though Lim Cheolho had hammered a massive nail through his ambitions—a nail labeled *'A player cannot overcome the Empire.'*\n\n\"The 1st through 3rd Knights operate on a completely different dimension,\" Scott said quietly, his complexion ashen. \"Kraugel and Grid... even Agnus couldn't defeat them.\"\n\nScott felt nauseous. Even the warriors Kraugel had praised were overwhelmed by the 3rd through 10th Knights. And despite Ares' passive ability—which boosted all stats by **10%** and all skills by **20%** when facing over a thousand enemies—they hadn't dared approach the 1st Knight directly.\n\n\"A **Transcendent** named NPC,\" Ares murmured, staring across the battlefield at Mercedes' distant figure. \"Her level is simply too high.\"\n\nFor the first time in his long gaming career, Ares tasted genuine despair. Despite accumulating power in Belto Kingdom for three years, he'd been unable to breach the Empire's borders. His forces had been systematically dismantled.\n\n\"The Emperor's favored pillars didn't even participate...\" Ares' jaw clenched. \"Damn it. Everyone, retreat! We'll halt their invasion at Grand Prix Fortress.\"\n\nHaving lost substantial forces, Ares chose tactical withdrawal. As his army began its organized retreat, Mercedes' voice suddenly echoed in his mind—a telepathic message that sent ice down his spine.\n\n—*Don't forget that the only master of this continent is the Empire.*\n\n*Shit. I thought NPCs couldn't send whispers to players,* Ares thought, goosebumps prickling his arms. *This is on another level entirely.*\n\nDefeating the Empire in open warfare meant claiming dominion over the entire continent. That's why Ares had targeted them from the beginning—no half-measures, no compromises. But today had shattered that dream.\n\n*The war against the Empire will require a long-term strategy,* Ares concluded grimly. *It would be wiser to fully conquer Belto Kingdom first and secure the throne. Build a proper foundation before challenging them again.*\n\nAres made his decision and led the retreat, sacrificing a unit to serve as rearguard against the Empire's pursuit. As they watched the distant Ares army flee, the imperial commanders took notice of the small kingdom they'd previously dismissed as irrelevant.\n\nIt was the precursor to the massive 'West Continent Unification' episode that would soon engulf Satisfy.\n\n---\n\n\"Reidorn?\"\n\n\"He didn't speak today either,\" the guard reported.\n\n\"Truly stubborn,\" Grid muttered, shaking his head. \"How has he endured torture for over a month?\"\n\nReinhardt's dungeon. Grid made his daily visit to the cells, descending stone steps that grew progressively damper. The bloodied Reidorn hung from shackles bolted into the wall, his body a canvas of bruises and lacerations. Despite his condition, he managed a cold smile when Grid entered his line of sight.\n\n\"Only ruin awaits you,\" Reidorn said hoarsely.\n\n\"Shut your mouth, you mannerless dog,\" Grid snapped.\n\n\"Ggweg.\" Reidorn's laugh was wet and mocking.\n\nGrid showed no mercy to his enemies. He seized a spear from the guard and drove it through Reidorn's thigh with clinical precision. But even as Reidorn's scream echoed off the dungeon walls, Grid felt no satisfaction—no sense of triumph.\n\n*This determination to protect his secrets even unto death...* Grid withdrew the spear, watching blood pool on the floor. *He's as fanatic as any member of the Yatan Church.*\n\nThe calm before the storm gnawed at Grid's nerves. He'd weathered countless storms before—crushed conspiracies and defeated powerful enemies. But something about Reidorn's unwavering silence troubled him deeply.\n\n*What secret is worth dying for?*"
}