{
  "id": 610,
  "title": "Chapter 610",
  "content": "# Year 20XX: The Immigration Problem\n\nBy Year 20XX, over two billion player accounts had been created in Satisfy—nearly one-fifth of the world's population. It was no wonder the global economy revolved around the game.\n\nOf course, the vast majority of those two billion were casual players or dormant accounts. Even accounting for that, the fact that only 50,000 users had migrated to the Overgeared Kingdom was... troubling.\n\n『 The first player-created kingdom has generated massive interest across the continent. So why aren't more players moving there? You'd expect the population to skyrocket. 』\n\n『 Two major factors are at play. First, immigration isn't easy. People are a nation's lifeblood—no kingdom wants to lose population. Anyone attempting to migrate must pay substantial taxes or complete specific quests. And because it's the *Overgeared* Kingdom we're talking about, the other kingdoms are even more restrictive. Of the fifteen kingdoms on the continent, only one views Overgeared favorably. 』\n\n『 What about the Empire? Is it also blocking migration to Overgeared? 』\n\n『 The Empire doesn't need to. It's the strongest nation on the continent—who would willingly leave it for Overgeared? Being a citizen of the Empire is far more advantageous than living in the Overgeared Kingdom. 』\n\n『 The second reason for low immigration numbers is simpler: the Overgeared Kingdom is new and unproven. Yes, it's secured tremendous resources through alliances with the Rebecca Church and the Siren Kingdom, but it's still a small kingdom without distinct advantages. Players see no reason to uproot themselves and risk losses in their current kingdoms just to move there. 』\n\n***\n\n\"It's slower than I expected.\"\n\nGrid frowned at the population report spread across his desk. The initial wave of players drawn by launch quests had slowed to a trickle. The soldiers available to support those quests were limited, and the difficulty had normalized.\n\n*I need a way to make people relocate to Overgeared despite the immediate risks.* He drummed his fingers on the armrest. *But what?*\n\nHe considered consulting Lauel, then dismissed the idea. His prime minister was already losing sleep over this exact problem.\n\n*I need to think of something only I can come up with.*\n\nGrid's worries stretched over several days. He pondered the issue while fulfilling his royal duties, spending time with his family, even while brushing Noe's fur.\n\nThen it hit him.\n\n*What if I made items for quest rewards?*\n\nHe approached the problem not as a Legendary Blacksmith, but as a craftsman solving a practical challenge.\n\n*Of course, the items can't be too valuable—I can't devalue the rarity of my work. And I need to prevent players from grabbing the rewards and leaving immediately.* His eyes brightened. *Set items. That's the answer.*\n\nThe mass production Grid Set.\n\n*Every two or three quests a player completes, they receive one piece from the mass-produced Grid Set.*\n\nThe set was divided into six parts: weapon, secondary weapon, armor, gauntlets, helmet, and boots. Wearing two or more pieces activated set effects. If players received Grid's equipment as rewards, their collector's instinct would drive them forward.\n\n*Players won't be able to leave the Overgeared Kingdom until they've collected all six pieces.*\n\nFrom the kingdom's perspective, players would complete diverse quests and develop the nation's power in the process.\n\n*By the time they collect the full Grid Set, the Overgeared Kingdom will be well-developed.*\n\nA developed Overgeared Kingdom would naturally appeal to players. No one would want to leave after investing so much effort.\n\n*Perfect.*\n\nGrid shot up from his throne and headed straight for Lauel's office. Technically, as king, he should summon his subordinate to him—but he didn't want to interrupt Lauel when the man was drowning in work.\n\n***\n\n\"It's a brilliant idea.\"\n\nLauel leaned back in his chair, eyes gleaming with approval. Generate linked quest chains with the mass-produced Grid Set as rewards, leveraging player initiative to accelerate the kingdom's development. If players had long-term goals, their passion and focus would intensify. The Overgeared Kingdom could make rapid progress.\n\n\"I think once the Overgeared Kingdom develops, it'll create a snowball effect—more and more people will want to immigrate...\"\n\nLauel nodded thoughtfully. Then his expression shifted to something more bittersweet.\n\n\"Do you have the resources and manpower to produce thousands—potentially tens of thousands—of mass-production Grid Sets?\"\n\n\"...\"\n\nThe reality hit Grid like a hammer strike. It wasn't just about technique. Resources. Manpower. Mass production required both.\n\n\"Uh... well...\"\n\nHis face flushed with embarrassment. He couldn't produce large quantities of items quickly on his own, and he lacked the capital to consume the massive amounts of black iron required—the main ingredient of the mass-produced Grid Set.\n\n\"Damn it. I was too short-sighted.\"\n\nGrid sighed heavily, lamenting his oversight. Lauel offered a gentle smile.\n\n\"Don't blame yourself. There's no shame in working hard to develop the nation.\" He chuckled warmly. \"Huhut.\"\n\n\"Thanks for the encouragement, but it doesn't solve the problem.\"\n\n\"On the contrary, you've opened up new possibilities. If your plan comes to fruition, I'm certain it'll greatly benefit the Overgeared Kingdom's development. My role is to make your vision a reality.\"\n\n\"How?\"\n\n\"Could the other blacksmiths produce the mass-produced Grid Set?\"\n\n\"Ah.\"\n\n*Why didn't I think of that?* For years, Grid had Khan focus on nurturing blacksmiths. Currently, the 1,000 blacksmiths in Reidan trained under Khan, with Grid only occasionally mentoring them directly. He'd never considered passing specific production methods to the blacksmiths—the necessity simply hadn't occurred to him.\n\nGrid thought for a moment.\n\n\"The advanced blacksmiths could learn to make the mass-produced Grid Set.\"\n\n\"How many advanced blacksmiths are currently in Reidan?\"\n\n\"Ten before the founding ceremony. Probably around fifteen now?\"\n\nReidan's blacksmiths were talented—Grid had personally selected them using the <span class=\"legendary\">Great Lord's Sword</span>. Under Khan's tutelage over the past few years, their growth rate had been exceptional. Lauel's expression brightened.\n\n\"Let's open the treasury. We'll have the thirteen advanced blacksmiths here in Reinhardt, plus Khan and Reidan's advanced blacksmiths, begin production of the Grid Set immediately. Ah, of course—\"\n\nHe raised one finger.\n\n\"This all depends on securing enough capital to mass-produce the set.\"\n\n\"How long will that take?\"\n\n\"Three to four years? If you instruct Marquis Peak Sword to expedite development of the black iron mine, we might shorten that by six months.\"\n\n\"Four years...\"\n\nFour years. Enough time for military conscription twice over. Grid's shoulders sagged. Lauel laughed at his king's frustration.\n\n\"Don't be anxious about the kingdom. We'll develop slowly and steadily. Think positively—in four years, the number of advanced blacksmiths will have increased significantly. Production of the Grid Set will become even easier.\"\n\n\"Mm... you're right. Rome wasn't built in a day. I shouldn't be so impatient.\"\n\nGrid was just beginning to accept the timeline when a soldier entered the office and bowed.\n\n\"Minor has returned.\"\n\n\"Minor?\"\n\nGrid blinked. He'd completely forgotten about Minor, who'd been gone for the past year.\n\n\"I thought he'd run away again.\"\n\n*What has he been doing all this time?* Minor was an excellent miner with a unique talent for discovering new minerals. Grid had once held great expectations for him. Minor possessed the unprecedented position of 'Minerals Detector'—a role that should have been invaluable. But discovering new minerals across this vast continent wasn't easy. Minor had never found anything significant, and Grid had gradually forgotten about him.\n\n\"That brat—don't tell me he's coming back with a woman?\"\n\nGrid frowned. Lauel looked puzzled.\n\n\"A woman?\"\n\n\"He's at the age where he's interested in the opposite sex. Who knows? Maybe he spent the past year chasing skirts instead of working.\"\n\n\"Haha, surely not.\"\n\nCould such an irresponsible NPC even exist? Lauel thought Grid's concerns were baseless. But then—\n\n\"The genius born in the stream called Bairan! The genius Minor, who will become the second mythological commoner, has returned! Duke Grid... no, should I call you King now? Heh, are you happy to see me after such a long time?\"\n\n\"...\"\n\nMinor was *actually* holding a woman's hand. She wore flashy clothes and heavy makeup—the kind of woman typically found in back-alley taverns.\n\n\"...Is this a joke? You're too young to be fooling around like this.\"\n\nMinor's eyes widened as he finally registered the situation. He hurriedly waved his free hand.\n\n\"Ah! I only met this woman today when I arrived in Reinhardt and stopped by a pub. I wasn't playing around with her for the past year!\"\n\nThe heavily made-up woman extended her other hand toward Grid.\n\n\"The kid was a virgin. I came because he said the King would pay me.\"\n\n\"...\"\n\nGrid handed money to the woman with trembling hands.\n\n\"This comes from Minor's salary.\"\n\nRage boiled in Grid's chest. He fully intended to throttle the boy. But then—\n\n\"Look at this! This genius struggled for the past year and found a new mineral!\"\n\nMinor pulled out a large sack. Grid's eyes widened as he glimpsed the contents.\n\n\"This...!!\"\n\nThe sack was filled with minerals that glittered like a chandelier's crystals. Grid's heart thundered in his chest.\n\n*Thump. Thump. Thump.*\n\nHe reached for one with shaking hands.\n\n> **[<span class=\"???\">Mineral Containing the Breath of a Light Dragon</span>]**\n>\n> A mineral that naturally occurs in the nest of the light dragon Nevartan. It has been affected by Nevartan's breath for thousands upon thousands of years, resulting in unique properties. This is an extraordinary mineral.\n>\n> **Weight:** 5\n\n\"An extraordinary mineral?\"\n\nGrid stared at the description in confusion. Minor fidgeted, looking strangely apologetic.\n\n\"This mineral... it multiplies.\""
}