{
  "id": 611,
  "title": "Chapter 611",
  "content": "# Rewritten Text\n\n\"What?\" Grid's brow furrowed as he leaned back in his chair. \"A mineral that multiplies on its own? Have you been drinking, Minor?\"\n\nIt was a natural reaction to such an outlandish claim. Minor huffed indignantly, his face flushing as Grid regarded him like a madman. Without another word, the young miner yanked open the sack at his feet and thrust a handful of gleaming ore toward Grid's desk.\n\n\"It *does* multiply! I swear it!\" Minor's voice cracked with frustration. \"There were exactly twenty pieces when I first sealed this bag. That was over a month ago. Look at it now—one hundred sixty pieces! The total mass has increased several times over!\"\n\nGrid's skeptical expression softened. He studied the earnest determination burning in Minor's eyes, then slowly straightened in his seat.\n\n\"...You wouldn't lie about something this absurd.\" Grid rose from his chair, his tone growing serious. \"There's no benefit to making a false report like this.\"\n\n*And I don't smell any alcohol on him,* Grid noted mentally.\n\nThe method to verify Minor's claim was simple enough.\n\n\"Legendary Blacksmith's Appraisal.\"\n\n> The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.\n>\n> You have discovered a hidden feature in the item!\n>\n> The information about 'Mineral Containing the Breath of an Insane Dragon' has been updated!\n>\n> **[Insane Dragon Iron]**\n>\n> A mineral that naturally occurs in the nest of the insane dragon Nevartan.\n>\n> It has been influenced by Nevartan's madness for countless years and gained the chaotic ability 'Proliferation.'\n>\n> It doubles every 10 days.\n>\n> This absurd nature makes it very difficult to control. The hardness is comparable to black iron, but the smelting difficulty is several times higher.\n>\n> **Weight:** 5\n\nGrid's breath caught in his throat. His eyes widened as the information crystallized before him, and he stared at the mineral with newfound reverence.\n\n*A mineral that doubles...* The implications crashed through his mind like thunder. *If I just store it in the warehouse, it will increase infinitely! And it's a precious mineral on par with black iron!*\n\n\"Lauel!\" Grid spun toward his advisor, excitement crackling in his voice. \"We might be able to mass-produce the Grid Set in a few months—not four years!\"\n\nLauel's expression shifted from curiosity to predatory delight as Grid shared the item information. A low chuckle escaped his throat.\n\n\"Kukuk! Your good luck shows itself at the most exquisite moments, doesn't it? You always hit the jackpot when it matters most.\"\n\n\"Not necessarily...\" Grid's enthusiasm dimmed slightly as memories of past failures surfaced.\n\nThere had been plenty of crucial moments when luck had abandoned him entirely. While Lauel laughed and Grid reminisced about his more disastrous experiences, Minor's indignant voice cut through their conversation.\n\n\"You're both fortunate?\" Minor crossed his arms, his expression incredulous. \"How is this *your* good luck? This is *my* merit!\"\n\n\"Of course.\" Grid's demeanor shifted instantly, and he fixed Minor with a look of genuine warmth. \"How could we not recognize your achievement? Your very presence is our kingdom's fortune. You are a treasure of the Overgeared Kingdom, Minor.\"\n\nGrid gazed at the young miner with deep affection.\n\n*He's as valuable as I thought. I'm counting on him to continue working with me.* Grid's mind raced ahead to the future—Minor exploring every corner of the continent, discovering rare minerals, constantly finding new resources. He stepped forward and seized Minor's hands with both of his own, gripping them firmly.\n\nMinor's heart swelled with excitement at Grid's display of confidence and trust.\n\n*Won't I at least become a marquis with this achievement?* The thought blazed through Minor's mind. *Discovering an infinitely proliferating mineral—this is unquestionably a great feat. It must be comparable to the greatest achievements in other kingdoms. I've given this kingdom infinite wealth. I deserve recognition for this merit!*\n\nWith sparkling eyes full of anticipation, Minor waited for Grid to deliver his reward.\n\n\"In the name of Overgeared King Grid—\" Grid's voice rang with formal authority. \"—I hereby establish a Minerals Detection Department, and you, Minor, shall be its general manager.\"\n\n\"...?\" Minor blinked. The words didn't quite register.\n\n\"You're only eighteen years old...\" Grid continued, smiling warmly. \"Yet you'll command dozens of subordinates at such a young age. Aren't you thrilled?\"\n\n\"Thrilled?\" Minor's voice came out flat. \"What's there to be thrilled about?\"\n\nHis mind reeled. *I was supposed to leverage this achievement into a high position, enter social circles, build a network, establish a faction—create the foundation to eventually become a king myself. And now he's... he's interrupting my entire plan?*\n\nResentment bubbled up in Minor's chest.\n\n\"If you don't want to give me money, at least grant me a barony!\" Minor's composure cracked. \"A Minerals Detection Department? Are you insane? Why would I lead some damn department? Do I have to spend the rest of my life searching for minerals?\"\n\nMinor understood his own talents and achievements. He wanted—no, he *deserved*—appropriate compensation. And Grid, for his part, understood exactly how Minor felt.\n\n*If Minor had a corrupt heart, he could have taken these minerals and become wealthy on his own. If he'd run to the Saharan Empire with this discovery, he would have received a high noble title immediately. But he didn't betray me. It's only natural to give him fair treatment.*\n\nBut reality was merciless.\n\n\"Minor, I'm truly sorry, but—\" Grid's expression turned genuinely apologetic. \"—I don't have any spare titles to grant right now.\"\n\nThe Overgeared Kingdom held a national rating of **F**—the absolute lowest classification. A kingdom's rating depended on territory size, population, and internal stability. Despite having vassal kingdoms, the Overgeared Kingdom's future remained uncertain due to its small population and empty treasury. The **F** rating was inevitable.\n\nBecause of these limitations, Grid could only appoint three dukes, three marquises, six earls, and thirty barons. He had already distributed every single one of those titles.\n\n\"Then make me a viscount!\" The excited Minor surged closer, desperation creeping into his voice.\n\nLauel opened his mouth to interject, but Grid raised a hand to restrain his advisor. Instead, Grid reached out and gently stroked Minor's head.\n\n\"How could I let a precious child like you settle for being *just* a viscount?\" Grid's voice carried both warmth and conviction. \"Your achievement is sufficient for an earldom, let alone a viscountcy. Can someone of your caliber truly be satisfied with such a small title?\"\n\n\"...Y-Your Majesty?\" Minor's voice wavered.\n\nGrid pulled the young man into an embrace. Standing there wearing the Great Lord's Sword and Holy Light Crown—both of which amplified his **Dignity** stat—Grid radiated an almost overwhelming presence.\n\n\"Minor, I have tremendous expectations for you.\" Grid's words were measured and sincere. \"Your talent is far greater than even you realize. When you finally make your noble debut, it must be absolutely magnificent. I hope you'll accumulate even greater merits by that day.\"\n\n\"Y-Your Majesty!!\" Tears pricked at Minor's eyes.\n\nMinor was intelligent—perhaps too intelligent for his own good. That intelligence made him acutely aware of his limitations. He'd always blamed himself for being born a commoner, convinced that his insignificant origins would eventually drag him down. But now, in this moment, Grid was offering him a brilliant future. This was an assessment from the first commoner to ever become a king.\n\n*He acknowledges me,* Minor realized. *Grid truly acknowledges me.*\n\nThe recognition struck him like a physical blow. His loyalty to Grid surged, crystallizing into something unshakeable. This brief incident taught Grid something valuable as well.\n\n> Minor has exceeded his limit.\n>\n> The information about Minor has been updated!\n\n*Huh?* Grid blinked at the unexpected notification.\n\nJust as Jude and Iyarugt—both of whom sought to grow stronger—had broken through their limits by defeating more powerful opponents, Minor broke through his by achieving recognition from someone he respected. In other words...\n\n*To help an NPC break through their limitations, I need to understand their individual characteristics and utilize them properly.*\n\nGrid was becoming an expert in NPC management. This knowledge would allow him to cultivate talented NPCs far more efficiently in the future. Minor's updated information materialized in Grid's field of view.\n\n> **Name:** Minor  \n> **Age:** 18  \n> **Gender:** Male  \n> **Occupation:** Minerals Master  \n> **Level:** 235\n>\n> **Strength:** 355/450  \n> **Stamina:** 408/608  \n> **Agility:** 200/200  \n> **Intelligence:** 420/1,120\n>\n> **Skills:** Fantastic Pickaxe Technique (S), Minerals Master (S+), Talent will Reveal Itself (SS)\n>\n> A boy who has held a pickaxe since the age of five, following in his miner father's footsteps.\n>\n> After entering Grid's service, he put down the pickaxe to focus on mineral research and detection. However, he can still collect minerals better than miners who have worked for decades.\n>\n> * A prodigious talent. If properly cultivated, he will become his nation's foremost authority in this field.\n> * He has broken through his limits by achieving a worthy accomplishment and gaining recognition from someone he respects. The maximum values of **Stamina** and **Intelligence** have greatly increased. (1/20)\n> * This limit breakthrough will accumulate each time conditions are met.\n\n*Amazing...*\n\nThere existed an inevitable gap between Named NPCs and Semi-named NPCs. Named NPCs possessed infinite growth potential and well-rounded stats, while Semi-named NPCs faced growth limitations and tended toward specialized stat distributions. Jude served as a perfect example—his combat-related stats were exceptional, but his **Intelligence** remained poor.\n\nMinor fell into a similar category. Though he possessed high-grade unique skills, his overall stats were relatively low. But now Minor had proven he could overcome those shortcomings by breaking through his limits. If a Semi-named NPC grew steadily through limit breakthroughs, they could potentially rival a Named NPC.\n\nGrid's appreciation for Minor deepened. And it wasn't solely because of the young man's growth potential.\n\n*He admires me?* The realization struck Grid with unexpected force.\n\nMinor's passive skill, **Talent will Reveal Itself**, was a double-edged sword. Because his exceptional abilities were so visible, he constantly attracted outside temptation and recruitment attempts—making betrayal a very real possibility. Grid had always kept this risk in mind, which was why he'd never invested too heavily in Minor. He'd simply utilized Minor's abilities while maintaining careful distance.\n\n*But now he respects me? He won't betray me?*\n\nGrid felt both astonished and genuinely happy. To be an object of respect—someone's role model—filled him with an unfamiliar warmth. A smile spread across his face.\n\n\"Lauel, arrange a proper salary for Minor going forward.\"\n\n\"Rabbit handles salary negotiations. He'll take care of it appropriately.\"\n\n\"Mm.\" Grid nodded approvingly.\n\nAs a reference point, Rabbit was the same administrator who had once hired Piaro for a mere seventy-three silver coins. It was thanks to Rabbit's ruthless cost management that the current Overgeared Kingdom could sustain its operations. Neither Grid nor Minor were aware of this particular detail as they stood there, trusting each other with newly forged mutual respect.\n\n***\n\nGrid left Lauel and Minor behind. He headed toward the smithy with light, eager footsteps, the Insane Dragon Iron weighing on his mind.\n\n*I need to experiment.*\n\nGrid wanted to understand the concept of \"proliferation\" more precisely. The Insane Dragon Iron's characteristic was to double every ten days. But did this property persist even after being forged into an item?\n\n*Tang! Tang!*\n\nGrid crafted a Mass-Produced Grid's Greatsword using the Insane Dragon Iron as material. He planned to check in ten days whether the greatsword actually multiplied. Then, after some time had passed, a dramatic change occurred in the greatsword Grid had made.\n\n> The Mass-Produced Grid's Greatsword has transformed. The volume and weight have doubled due to the effect of the Insane Dragon Iron used as a material.\n\n\"...Damn. What a shame.\"\n\nThe realization crashed over Grid like cold water.\n\n*It multiplies when it exists as raw, unprocessed mineral. But after being forged into an item, the volume increases instead.*\n\nIn order to use Insane Dragon Iron as a crafting material, he would need to properly control this characteristic. Otherwise, the Mass-Produced Grid Set would be completely ruined. Who would want to use an item that doubled in volume and weight every ten days?\n\nGrid steeled his resolve to find a solution.\n\nThe Insane Dragon Iron—a mineral that naturally occurred in the nest of the insane dragon Nevartan. Which meant there had to be various other types of minerals in Nevartan's nest besides the Insane Dragon Iron.\n\n*It's possible that a mineral exists with properties that suppress or counteract the Insane Dragon Iron.*\n\nWhich meant...\n\n*I have to go to Nevartan's nest?*\n\nGrid had felt anxious even when raiding Hell Gao. He'd harbored a nagging suspicion that someday, he might need to infiltrate a dragon's lair to find rare minerals.\n\nThat anxiety had just become reality. After all, it would be far more efficient to visit Nevartan's nest directly to study the characteristics of minerals that naturally occurred in that environment.\n\n\"Hah...\" Grid released a deep sigh.\n\nHe immediately summoned Minor again. When the young miner arrived, Grid asked in a carefully neutral tone, \"Is Nevartan currently present in his nest?\"\n\n\"No. If Nevartan had been there, I wouldn't have entered in the first place.\" Minor looked at Grid like he'd lost his mind. \"Do you think I'm suicidal?\"\n\n\"That's... reassuring.\" Grid felt a weight lift from his shoulders. \"What about other monsters? Are there guardians?\"\n\n\"None. It was a completely empty dungeon.\"\n\n\"Oho.\" Grid's tension evaporated, replaced by excitement.\n\n*I was worried for nothing.*\n\nGrid smiled with satisfaction and rose from his seat. He began preparations to leave Reinhardt for the first time since the founding ceremony.\n\n\"Let's go, Minor.\"\n\n\"Yes! I'll prepare boxed lunches.\" Minor's face lit up with anticipation. \"Hehe, the king's boxed lunches will be packed with delicacies, right? I'm really looking forward to it.\"\n\n\"...I don't have money, so we're packing jerky.\"\n\n\"...\"\n\n*Being king isn't all it's cracked up to be,* Minor reflected. He'd been having this thought quite often recently."
}