{
  "id": 613,
  "title": "Chapter 613",
  "content": "> [You have entered the Beware Dogs dungeon.]\n\n\"Eh? What kind of name is this for a mine?\"\n\n*Beware Dogs?* Grid frowned at the familiar phrase—something he'd seen scrawled on walls in his old neighborhood. *This is Satisfy, all right. Made by Koreans.* Even the mine's name carried a distinctly South Korean flavor.\n\nHe swept his gaze across the interior and grimaced.\n\n\"What a mess.\"\n\nThe mine looked devastated—walls crumbling, rubble scattered everywhere, like a battlefield after the fighting had ended.\n\n*What the hell happened here?*\n\nMinor stepped forward, reading Grid's confusion. \"I smashed through the wall here to reach the minerals. Some crazy bastard had bricked up the entire interior—walls, ceiling, everything.\"\n\n\"That would be the insane dragon Nevartan,\" Grid said. \"This was originally a mine. He renovated it into his nest.\"\n\nWhich explained why the system classified it as a dungeon rather than a simple mine. Grid's wariness faded as Minor pulled out his pickaxe.\n\n\"Either way, mining here is hell unless you're a genius. You have to break through the bricks first, *then* extract the minerals. Your Majesty, prepare yourself for some serious labor.\"\n\n\"You don't understand.\" \n\nGrid smiled and summoned Noe and Randy.\n\n\"Nyang! Master!\"\n\n\"Grid!\"\n\nBoth materialized in bursts of light, circling him with obvious joy. They looked almost like a family—young father, child, and pet cat.\n\n\"Your Majesty...?\" Minor stared, bewildered. *Why summon pets before starting work?*\n\nNoe's ears twitched as he belatedly noticed the stranger.\n\n\"Who's this human, nyong? Is he a tribute for the best demonic beast of hell?\"\n\nWithout waiting for an answer, Noe dropped to the ground and began licking his pink paw pads. The gesture was so adorable it completely undermined any attempt at intimidation. A black cat with a swishing tail and bright, shining eyes—Minor felt his face flush.\n\n\"Can I adopt him?\"\n\n\"No.\"\n\nGrid's rejection was immediate and firm. He pulled out two pickaxes and handed them to Noe and Randy.\n\n\"It's been a while since we've done this.\"\n\n\"Nyang?\"\n\nBoth pets stared at the tools in confusion. Grid clarified the situation.\n\n\"Your job today is to gather all the minerals in this dungeon.\"\n\n\"Kyang!\"\n\nNoe hurled his pickaxe to the ground the moment he understood.\n\n\"This is ridiculous, nyang! The best demonic beast of hell won't hold a pickaxe! Nyang! This is bullshit, nyong!\"\n\nNoe had been bored and lonely ever since Grid became king. He'd looked forward to hunting humans or monsters again—real combat, side by side with his master. And today, finally summoned outside the palace after so long, he'd expected battle.\n\n*Mining?* A noble creature precious even to the great demons who ruled hell—reduced to swinging a pickaxe? Noe's whiskers quivered with indignation. *Why should I suffer this humiliation?* His nose twitched from side to side.\n\nUnlike his irritated companion, Randy found the situation novel and interesting.\n\n\"How do I use this pickaxe? Grid, teach me.\"\n\n\"Like this.\"\n\nGrid demonstrated with a few practice swings.\n\n\"...\"\n\nNoe's anger evaporated. The harmonious atmosphere between Grid and Randy was too pure to resist. Worried that Grid would focus entirely on Randy and ignore him, Noe reluctantly retrieved his pickaxe.\n\n\"I will help, nyong...\"\n\n\"Good boy.\"\n\nGrid stroked Noe's head, then summoned the God Hands. All four golden constructs materialized, each equipped with a pickaxe. Minor's confusion finally crystallized into understanding—and horror.\n\n\"Y-Your Majesty, have you lost your mind? You're making your *pets* and *artifacts* mine?\"\n\nThe minerals growing in this dungeon were exceptionally rare—more precious than gold. Experts would need to work carefully to avoid even minor scratches while extracting each piece. Even skilled miners would struggle. Making pets and artifacts do this work was insanity.\n\n\"You're taking mining far too lightly!\"\n\nMinor was the son of a miner who'd dreamed of becoming one himself. No matter how great Grid was, mining required skill and care. His anger lasted only a moment.\n\n*Peok! Peok! Peeeeok!*\n\n\"...W-Wow.\"\n\nMinor's protest died in his throat. The golden hands moved with professional precision, their mining technique flawless.\n\n*These are mining-specialized artifacts...!*\n\nMinor had never seen Grid fight, so the misunderstanding was natural. The <span class=\"unique\">unique-rated God Hands</span> received 30% of Grid's **dexterity**. Currently, their **dexterity** exceeded that of intermediate blacksmiths. Their mining technique reflected that expertise.\n\nAs for Noe and Randy?\n\n\"Kyahahat, how funny.\"\n\n\"The best demonic beast of hell holding a pickaxe, nyang... What a disgrace...\"\n\nDespite their complaints, both performed adequately.\n\nNoe had known language from birth, and his learning ability was exceptional. Mastering the pickaxe proved interesting enough—though his lack of **dexterity** made him somewhat clumsy and slow. Still, he could extract minerals, which was sufficient.\n\nRandy, meanwhile, used his duplication skill to transform into Grid, granting him 30% of Grid's total abilities. With his borrowed **dexterity**, his hands moved swiftly and efficiently, minerals practically flowing from the walls.\n\n*Mining pets!*\n\nMinor was awestruck by Grid's resourcefulness. *He has unique artifacts and pets specifically for mining. Of course he does.*\n\n*He probably has different artifacts and pets for every situation. A commoner king truly is extraordinary.*\n\nGrid nudged the stunned Minor.\n\n\"Well? Aren't you going to work?\"\n\n\"Ah! Y-Yes, Your Majesty!\"\n\n*Ttang! Ttang! Ttang!*\n\nZone 1 of the Beware Dogs dungeon—the structure Dark had designed and constructed over several months—began collapsing at an irreversible rate. The pickaxes moved faster and faster as Randy, Noe, and the God Hands adapted to their task.\n\n***\n\n\"Better than expected. Very good.\"\n\nDark surveyed his accumulated spoils with satisfaction. The Anti Blood Carnival alliance had crumbled, and he'd claimed every item he needed. The experience and loot were substantial. More than that, he felt immense pride.\n\n*Was there anyone else who could kill a party of 300 high-level users single-handedly?* And he hadn't even needed to lift a finger.\n\n*If I acquire a second class later...*\n\nHe'd be the best. The strongest. A title only one person among two billion users could claim.\n\n\"...Huh?\"\n\nDark was lost in fantasies of standing at the peak when an alert interrupted him.\n\n> [An intruder has appeared in the 'Beware Dogs' dungeon.]\n\n\"Again?\"\n\nAnother intruder, so soon after the Anti Blood Carnival alliance?\n\n*I can't keep a discovered location secret forever.*\n\nHe hadn't expected someone to invade again this quickly, though.\n\n*Too many people are hunting for Blood Carnival. I'll be constantly defending this place.*\n\nPerhaps it was time to relocate their base and hide the dungeon more thoroughly. Dark shook his head, then froze.\n\n*Wait. Why is the intruder still in Zone 1?*\n\nThe alliance had cleared Zones 1 through 3. Without traps or monsters blocking the way, any new intruder should advance to Zone 4 without issue. They should've reached it by now.\n\nBut this intruder was still lingering in Zone 1.\n\nPuzzled, Dark's confusion shifted to mockery.\n\n*Is he stuck in Zone 1 out of fear?*\n\nWhat a pathetic coward. Probably a low-level player.\n\n*He'll die if he encounters the monsters in Zone 4 anyway.*\n\nDark returned his attention to constructing Zone 8 at the dungeon's end. Then, after a short while:\n\n> [Zone 1 of the Beware Dogs dungeon has been completely destroyed!]\n\n\"What?!\"\n\nPlayers attacked dungeons for rewards—levels, items, boss encounters. Destroying the dungeon itself served no purpose whatsoever.\n\nYet this intruder was dismantling the structure. Just like a month ago...\n\n\"D-Don't tell me—\"\n\nA chill raced down Dark's spine. He was suddenly convinced: this new intruder was the same person who'd invaded a month prior.\n\n\"You son of a bitch!\"\n\nHe'd confirm personally what kind of lunatic this was. Dark moved to confront the intruder—\n\n> [An intruder has appeared in Zone 2 of the 'Beware Dogs' dungeon.]\n\n> [Zone 2 of the Beware Dogs dungeon has been completely destroyed!]\n\n\"Damn it!\"\n\nThe destruction rate was *accelerating*. At this pace, Zone 3 would fall as well. If the entire dungeon was destroyed, the damage would be catastrophic—he'd have to start construction from scratch. Panicking, Dark rushed toward Zone 3.\n\n***\n\n*Is he dead...?*\n\nGrid had been in the dungeon for over an hour. Since the alliance had already cleared the first three zones, Grid should've proceeded directly to Zone 4 upon entry. Where he would've encountered the enemies stationed there—enemies who'd exterminated the entire alliance.\n\nThe Evil Eyes.\n\nLike vampires, they were demonkin designed specifically to counter players. Particularly dangerous was their power of foresight—Evil Eyes could perfectly predict player behavior. Theoretically, defeating them in combat was impossible.\n\n*No. Grid is still alive. He defeated the Sky above the Sky.*\n\nBut perhaps even he needed help now. Perhaps he was desperate.\n\n*I... I'll help him.*\n\nNo more casualties because of the wicked Blood Carnival. Tom Yum steeled herself and entered the dungeon, ignoring concerns about her equipment's durability. She couldn't turn away.\n\n*Huh?*\n\nTom Yum stepped inside and froze, doubting her own eyes. The dungeon's landscape was completely different from before. Inner walls demolished, ground and ceiling cratered and cracked.\n\n*It's like...*\n\nIt looked like an abandoned mine. *What the hell happened here?*\n\nCuriosity gnawed at her, but she couldn't afford to investigate. Grid might be suffering at this very moment. Tom Yum quickened her pace, rapidly advancing toward Zone 4.\n\nThen she saw them.\n\nThe twenty Evil Eyes who'd overpowered the alliance's rankers lay stunned across the chamber floor. Even the seers among them were bloodied and broken.\n\n\"Uh... How?\"\n\nGrid had defeated the powerful Evil Eyes *alone*? Tom Yum stared in disbelief, then turned toward Grid himself.\n\nHe stood atop a fallen Evil Eye's body, pickaxe casually held in one hand.\n\n\"Why are these mobs running wild?\"\n\n\"...\"\n\n*Mobs?* He'd called the Evil Eyes *mobs*?\n\nTom Yum was at a complete loss for words."
}