{
  "id": 614,
  "title": "Chapter 614",
  "content": "# Chapter: Zone 4\n\n\"Dammit!\"\n\nDark clenched his fists, knuckles white against the notifications flooding his vision.\n\nA Dungeon Maker wasn't a tamer. He couldn't simply command monsters to obey. Instead, he had two methods to populate his creation. The first—contracts. Grid could hire intelligent creatures as dungeon guards, establishing mutual cooperation. But that only worked with monsters capable of understanding such agreements.\n\nFor the less intelligent ones, Dark relied on instinct.\n\nGriffins loved orc meat. Place the delicacy in the right location, trap the griffins inside, and they'd naturally claim that territory as their domain. The scent alone was enough to bind them to the dungeon.\n\nOf course, this method came with a fatal flaw: monsters deployed this way were hostile to *everyone*—intruders and Dark alike.\n\nWhich was why he remained stuck at Zone 5, unable to reach Zone 3. The moment he'd triggered Display Mode to deal with the intruder, every monster in his dungeon had awakened simultaneously. Moving between zones now meant sneaking past dozens of hostile creatures, slowing him to a crawl.\n\nAnd his worst fear had come to pass.\n\n> [Zone 3 of the Beware Dogs dungeon is completely destroyed!]\n\n\"N-No!\"\n\nThe notification felt like a knife to the gut. Three zones. Gone. The damage was catastrophic—at least a month to rebuild, not to mention the astronomical funding required.\n\n\"D-Damn bastard...!\" Tears of rage welled in his eyes as his vision blurred red.\n\nHis whole body trembled.\n\nThen another window materialized before him.\n\n> [An intruder has appeared in Zone 4 of the 'Beware Dogs' dungeon.]\n\nDark's fury transformed in an instant. A smile crept across his face.\n\n\"...Kuk, taste hell.\"\n\nThe anger drained from his expression, replaced by savage satisfaction. \"You broke through three zones without obstacles. Impressive. But Zone 4 will shred your sanity.\" His smile widened. \"I don't know who you are, intruder, but the evil eyes will grind you into paste.\"\n\nThe evil eyes.\n\nDemonkin born with unreasonable, overwhelming power. Supreme predators granted absolute strength from birth.\n\n*There are dozens of types,* Dark thought, his confidence swelling. Each variant possessed different abilities—freezing, ignition, blindness, silence. Fighting multiple evil eyes simultaneously was suicide. And among them, the ones who could glimpse the future—even just a few seconds ahead—were virtually unbeatable.\n\nHow had Dark managed to place such formidable creatures in his dungeon?\n\nPure luck.\n\nHe'd built the Beware Dogs to protect *it*—the very thing the evil eyes desired to hatch. Their goals aligned perfectly. Natural allies, bound by shared purpose.\n\n***\n\n\"This is amazing speed!\"\n\nMinor watched in awe as the God Hands and Randy demolished the wall. Their pickaxes blurred with motion, extracting minerals with surgical precision and maximal efficiency.\n\n\"But it isn't as good as me. Huhut.\"\n\n*He isn't pretending,* Grid thought, observing Minor's work. *This guy really is exceptional.*\n\nMinor's speed was overwhelming—even Grid had to admit it. All four God Hands combined couldn't match the young man's talent. As a miner, Minor was truly the best Grid had ever seen.\n\nBut that changed nothing.\n\n*No matter how skilled, you're still a minerals detector.*\n\nThe world had many excellent miners. Only Minor could *find* the ore in the first place. That unique talent was too valuable to waste.\n\n\"Your Majesty, there's a door to the next section. Should we proceed?\"\n\n\"Of course.\"\n\nGrid's goal remained unchanged: collect every mineral growing in this place. That meant exploring every area.\n\n*Shame there was only insane dragon iron in the first three sections.* He shrugged internally. *Well, no point being nervous. Nothing dangerous so far.*\n\nNevartan had stayed here. That alone suggested this was no ordinary mine. But without any major threats manifesting, Grid entered Zone 4 with minimal caution.\n\nThe instant he crossed the threshold, he realized his mistake.\n\n> [You have entered Zone 4 of the Beware Dogs dungeon.]\n> [The traps have been activated.]\n\n*Kurururung!*\n\n\"...!!\"\n\nGrid's eyes widened. Minor gasped beside him.\n\nA massive boulder—easily several tons—rolled down the narrow passage toward them, gaining momentum with each rotation. The corridor was barely wide enough for two people to stand side by side.\n\n*Can I dodge it?*\n\nNo. Too narrow. And behind them, the entrance had already sealed itself.\n\n\"D-Death...\" Minor's voice came out as a broken whisper. He squeezed his eyes shut, hands clutching his head, already imagining the boulder crushing his bones to powder.\n\n\"Open your eyes and raise your head.\" Grid's voice cut through the mounting terror. \"Show a confident charm.\"\n\n\"Your Majesty...?\"\n\nHow could he be so calm? They stood on the verge of death, caught in an unexpected trap, and Grid sounded almost... *bored*. Minor's eyes snapped open reflexively, searching Grid's face for fear.\n\nHe found none.\n\n\"Pagma's Swordsmanship.\"\n\nGrid drew a blue greatsword from beneath his Lantier's Cloak, the blade singing as it cleared the sheath. His body shifted into the opening stance of a sword dance, movements fluid and precise.\n\nThe boulder roared toward them.\n\nGrid swung.\n\n\"Kill.\"\n\n*Jjeejeeeong!*\n\n\"Pant...\"\n\nThe weight behind the boulder was immense—dozens of tons of solid stone propelled by gravity and momentum. An unstoppable force.\n\nBut this was Satisfy. A game. And before a legendary blacksmith wielding a blue orichalcum greatsword, that rolling death trap was nothing more than tofu.\n\n\"Y-Your Majesty, jackpot!\"\n\nThe sword pierced the boulder's center. The stone split cleanly in two, both halves tumbling harmlessly to either side. A fragment broke off, striking Minor's shoulder and drawing blood, but the young man still raised his thumb in triumph.\n\nGrid, completely shrouded in Lantier's Cloak, deflected the smaller debris without effort.\n\n\"When did you learn that word?\" Grid glanced at Minor with amusement.\n\n\"Your Majesty uses it often...\"\n\nMinor wanted to be like Grid. That aspiration drove him to observe everything—even the small habits, the casual phrases. Grid's laughter was warm.\n\n*This isn't a normal mine.*\n\nOf course not. This was a dragon's lair. Traps made perfect sense. Strong monsters likely slept deeper within, guarding whatever treasures Nevartan had hoarded.\n\nGrid didn't hesitate. If anything, his pace quickened.\n\n*This is interesting.*\n\nMinerals, experience, and loot awaited. And more importantly—\n\n*The reason there are traps is because they're protecting something.*\n\nTreasure. A dragon's treasure.\n\nGrid surged forward. More traps activated along the way—swinging blades, gouts of flame, collapsing ceilings. None of them threatened him. The blades couldn't pierce his armor, the flames washed over him harmlessly.\n\nMinor nearly died several times. Noe and Randy pulled him from danger repeatedly, and the potions from Reidan's alchemy facility kept him on his feet.\n\n\"This should be good.\"\n\nThe narrow passage opened into a vast chamber. Grid pulled out his pickaxe once more, surveying the space. Zone 4 dwarfed the first three sections combined—a complex labyrinth of tunnels and caverns that stretched beyond sight.\n\nMinor stared, overwhelmed by the sheer scale.\n\nGrid simply saw a bigger mine.\n\n*Teong! Teong!*\n\nGrid, Minor, the God Hands, Noe, and Randy set to work, pickaxes rising and falling in rhythmic percussion against stone.\n\n\"It's an unpleasant noise.\"\n\nA voice echoed from behind them.\n\n*A person?*\n\nGrid had expected monsters. He turned, startled.\n\n\"...A child?\"\n\nThe speaker was indeed a boy—young, with a round, charming face and large eyes that somehow managed to look harmonious despite their unusual appearance. An eyepatch covered one eye, reminiscent of Lauel's distinctive accessory.\n\n\"Why is a kid like you here? Ah.\"\n\nEven as Grid spoke, he realized how foolish the question was. Above the boy's head, a name floated in crimson letters: **Evil Eye**.\n\n*Monsters.*\n\nHumanoid monsters. Probably high-level, given the location. Grid couldn't afford to be fooled by the young, cute appearance. He shifted, positioning himself between Minor and the creature.\n\n\"Kukukuk... A mere human has invaded the territory of the evil eyes.\" The boy's voice dripped with theatrical menace. \"Looking at the past and present, it's rare that such a crime would be committed.\"\n\n\"...\"\n\n\"I, an ordinary resident of the evil eye clan, command this uncivilized human.\" The boy lifted his eyepatch with a flourish. \"Look into my 'ice' and be bound for all eternity.\"\n\nThe revealed eye was mesmerizing—a blue iris containing three black pupils, beautiful in its alien geometry.\n\n*Jjejeok.*\n\n*Jjeejeeeong!*\n\nIce erupted across the ground where Grid stood. The intense cold raced up his legs, clawing toward his waist, his heart, seeking to freeze him solid.\n\nBut—\n\n> [You have made eye contact with an evil eye.]\n> [You have fallen into the 'frozen' state!]\n> [You have resisted.]\n> [Due to the effect of the **'First King'** title, **'Great King's Majesty'** is activated.]\n> [You have counterattacked against the abnormal status.]\n\n*Jjejeok!*\n\n*Jjeejeeeong!*\n\n\"W-What...?\" The boy's face went pale. \"A mere human can threaten me...!\"\n\nThe freezing curse reversed direction. Ice crawled up the evil eye's feet instead, rooting him in place. Terror flashed across those strange pupils.\n\nGrid's pickaxe descended, striking the boy squarely in the forehead.\n\nBased on the name, evil eyes seemed like magical creatures—low physical defense. Grid was confident the pickaxe would do plenty of damage.\n\nMore importantly, he didn't want to waste time switching weapons when he had mining to do.\n\n\"I'm busy.\"\n\nGrid returned to the wall, his pickaxe resuming its steady rhythm against stone.\n\n\"...\"\n\nMinor stood frozen, mouth hanging open like a carp gasping for air.\n\nThe evil eyes. In all his travels across the continent, he'd heard the rumors—these were incredibly powerful demonkin. A normal human meeting an evil eye's gaze would lose their life before they could even scream.\n\nYet Grid had just casually dispatched one with a *pickaxe*. And then immediately gone back to *mining*.\n\n\"Hrmm... It's a small fry mob, so no item drops.\"\n\nGrid muttered his disappointment. Minor finally found his voice.\n\n\"The evil eyes aren't small fry mobs!\"\n\nEvil eyes had a slim chance of dropping their skin when killed—a material many adventurers desperately coveted. But realistically, hunting evil eyes was impossible. They were too powerful, too—\n\n\"Hoh, this is astonishing.\" Three new voices spoke in unison, cutting off Minor's thoughts. \"A mere human dares to kill an evil eye? A human has overcome their natural limitations?\"\n\n\"Huhuhut, humans have always produced heroes. It is a species that can't be denied.\" The three newcomers—more young boys with eyepatches—stepped into view. \"But in the end, you're trivial in front of our evil eyes.\"\n\nThey seemed excited rather than angry about their fallen kin. They regarded Grid as prey, hands reaching for their eyepatches simultaneously.\n\n\"Ignite.\"\n\n\"Blindness.\"\n\n\"Silence.\"\n\nThree different curses launched at once.\n\n> [You have resisted.]\n> [You have resisted.]\n> [You have resisted.]\n> [Due to the effect of the **'First King'** title, **'Great King's Majesty'** is activated.]\n> [You have counterattacked against the abnormal status.]\n\n\"K-Kuack...? Is my body burning hot because my heart is warm toward this human?\"\n\n\"Suddenly the world is dark. My brilliant presence has eclipsed all light except my own radiance.\"\n\n\"Oof oof.\" The third evil eye clutched at his throat, unable to speak.\n\n\"Phew. Really noisy.\"\n\nGrid's pickaxe rose and fell three more times in quick succession.\n\nWas this mob hunting or mineral gathering?\n\nMinor stopped trying to understand. His brain simply couldn't process what he was witnessing.\n\nGrid's pickaxe just kept working, its rhythm never breaking."
}