{
  "id": 615,
  "title": "Chapter 615",
  "content": "**First King** was a title only one player could acquire—the first to establish a kingdom among two billion users. The sheer uniqueness of this achievement was evident in its extraordinary acquisition conditions. Among the entire player base, only one person could claim it.\n\nWhat about its effects? Countless players speculated it would be the best title in existence. Some envied Grid more for obtaining this title than for his vast territory or the hundreds of thousands of citizens under his rule. And in reality?\n\n> **[First King]**\n> \n> A great king who built the first nation of players. A living history and myth.\n> \n> * A great king puts his safety first. If you lose 70% of your maximum health, a shield containing the health you lost within the last minute will be created. At this point, terrain adaptability will increase by 100% while movement speed and defense will increase by 10%.\n> * A great king must be familiar with the crown. You can wear a helmet and crown together, receiving the stats of both items. The exposed image must either be a helmet or a crown.\n> * A great king is diligent and bold. You can always keep your cool and status resistance will increase by 50%.\n> - You will reflect the abnormal status effect when resisting it. However, you won't be able to trigger this reflection if the opponent has achieved a certain level of reputation, status, or level.\n> * A great king is respected. Stats such as **charm**, **dignity**, and **leadership** will exert more influence on NPCs and monsters.\n> * A great king is competent. The skill level of all acquired skills will increase faster. Two points will also be added to your stat points acquired every time you level up.\n\nAmazing. The title boasted five effects, each one demonstrating overwhelming performance. Increased equipment slots, enhanced status resistance with reflection capabilities, improved stat and skill growth—every single effect was a treasure in its own right. The **First King** title exerted power beyond any other title in existence. The additional stat points per level and abnormal status resistance were particularly broken.\n\nBut human greed knew no bounds.\n\nGrid felt a twinge of disappointment despite everything. The 50% status resistance increase was essentially wasted on him. *If only it had been something else instead,* he mused. Still, did he have any right to complain?\n\nGrid forced himself to think positively. He particularly appreciated the two additional stat points per level up. Combined with everything else, it made his growth rate truly unrivaled.\n\n*Fourteen stat points every time I level up... Hehehehe.*\n\nNormal players gained ten stat points with each level. Grid received two more from his dual class, and now two additional points from the **First King** title. He was a special existence. Grid felt like the protagonist of the world itself, and his immersion in the game deepened exponentially. This translated directly into increased concentration.\n\n*Ttang! Ttang!*\n\nDelighted to experience the **First King** title's effects firsthand, Grid devoted himself to mining once more. At that moment, new Evil Eyes materialized.\n\n\"Hoh, it's quite commendable that a human can so easily dismantle members of the Evil Eye clan. Is it a miraculous bloom that appeared among the disappearing ephemera? Kukuku, I can't help but pay respect to you for giving me a feeling of tension for the first time.\"\n\n\"...\"\n\nThis time, sixteen Evil Eyes appeared. They reminded Grid of super-deformed characters with their childlike proportions. As he stared at their large, sharp eyes, his spirit felt assaulted.\n\n*It feels like there are sixteen Lauels...*\n\nHis ears and mind felt contaminated. Every time they spoke, Grid's hands and feet wanted to curl up in secondhand embarrassment. It was unpleasant—almost like suffering from a status condition.\n\n\"Randy, close their mouths,\" Grid ordered.\n\n\"Yes!\" Randy responded immediately.\n\nGrid refused to be disturbed while mining. There wasn't enough time to extract minerals from every area of this massive dungeon. He kept his pickaxe moving as Randy stepped forward. The doppelganger duplicated **Sword Ghost**.\n\n\"Pagma's Swordsmanship,\" Randy announced.\n\n\"Wow...\" Minor gasped in shock.\n\nMinor stared as Randy copied the same swordsmanship Grid wielded. Normal doppelgangers couldn't duplicate their target's skills—Randy clearly wasn't ordinary.\n\n*What kind of doppelganger is this?*\n\nMinor had assumed Randy was simply a mining pet. Now he realized this was a versatile companion. He desperately wanted a doppelganger like Randy for himself.\n\n\"**Wave**.\"\n\n*Supaak!*\n\nThe battle erupted. Randy rushed the Evil Eyes and struck multiple targets simultaneously. Focused entirely on Grid, the Evil Eyes failed to evade the surprise attack. Even with only 30% of Grid's stats, Randy dealt critical damage—the Evil Eyes possessed pathetically low defense and health. However, they had other means of fighting back.\n\n\"**Sleep**.\"\n\n\"Ah... Um...\"\n\n*Crash!*\n\nThe Evil Eyes simply looked at Randy. The effect was instantaneous and devastating. Randy literally fell asleep mid-combat. Grid's eyes widened.\n\n*It overcame Randy's status resistance?*\n\nRandy was a named boss with exceptionally high status resistance. Grid couldn't remember ever seeing Randy affected by status conditions before. Yet the Evil Eyes handled him with ease. Their ability represented absolute power against most players—only legendary class users stood a chance.\n\n*These eye monsters... They give five million experience, which is absurdly high for what should be trash mobs.*\n\nJunior vampires granted five million experience, suggesting the Evil Eyes weren't level 300. This was why Grid had classified them as small fry.\n\n*But if level 200 monsters possess such absolute status abilities...*\n\nIf high-level Evil Eyes existed, wouldn't they qualify as fairly powerful bosses? Only Grid would prove a proper match.\n\n\"Do you know why you have two eyes?\" Grid asked, genuinely concerned about Randy's condition.\n\nThe Evil Eyes shifted their attention to Grid and laughed.\n\n\"That's a silly question.\"\n\n\"We can't deny having two eyes. It's just like having two moons in the sky.\"\n\n\"No, you're wrong,\" Grid countered, shaking his head.\n\nThe Evil Eyes tilted their heads in confusion. Unlike normal monsters, they engaged with human conversation. This indicated the Evil Eyes were suitable candidates for taming as pets. Grid wasn't a tamer, though, so such thoughts never crossed his mind.\n\n\"What's wrong?\" the Evil Eyes asked, genuinely puzzled.\n\nThe moment they became absorbed in the conversation—\n\n\"It's okay to get rid of one,\" Grid declared.\n\n\"What are you saying?\"\n\n\"I'm going to destroy your eyes.\"\n\n*Pa pa pa pat!*\n\nThe **God Hands** armed with **Mjolnir** flew at the Evil Eyes.\n\n*Peok!*\n\n*Bam bam bam!*\n\n\"Ugh!\" the Evil Eyes groaned.\n\nThey paled, unable to resist the golden hands' assault. The **God Hands** were fast, powerful, and immune to the Evil Eyes' abilities—because they had no eyes to curse. The biggest problem was the black-haired human himself. Whenever Grid met the Evil Eyes' gazes, he didn't suffer curses. Instead, the Evil Eyes became cursed.\n\n*It feels wrong to kill them,* Grid thought.\n\nHe refrained from killing the terrified Evil Eyes after striking them several times across their foreheads with his pickaxe. They were monsters, yes, but they talked and resembled people. Since they posed no real threat and didn't drop items, he saw no need to eliminate them.\n\n\"Human... Why don't you take our lives?\" one asked weakly.\n\n\"Is the second ego sleeping in your heart whispering not to harm us?\" another wondered.\n\n\"Were you an Evil Eye in your previous life?\" a third suggested.\n\nThe Evil Eyes continued their nonsense even while collapsed on the ground. However, their killing intent diminished. The fighting spirit vanished from their eyes as they regarded Grid. Then—\n\n\"Kukuku... A human runs wild in our domain. But you're already dead the moment you made eye contact with me.\"\n\nA new Evil Eye materialized. Where the ordinary Evil Eyes resembled childlike characters, this newcomer sported a mustache—clearly older and more experienced.\n\n\"**Foresight**.\"\n\n*Pahat.*\n\nThe Evil Eye lifted his eye patch and observed Grid. In that instant—\n\n*Foresight?*\n\nNo \"resisted\" message appeared in Grid's vision. This Evil Eye didn't inflict a status condition.\n\n*Is this the boss?*\n\nGrid tensed, readying himself.\n\n\"...\"\n\nThe Evil Eye suddenly began sweating profusely.\n\n\"...?\"\n\n*Why isn't it attacking?* Grid wondered, confused.\n\n\"Kuk... Kukuk, it can't be helped. If this is my destiny, I will accept it.\"\n\nThe Evil Eye mumbled before lying down on the ground.\n\n\"Now, kill me.\"\n\n\"...\"\n\n*Committing suicide?* Grid blinked. *A boss appears at the perfect dramatic moment only to immediately show his belly?*\n\n\"What are you scheming?\" Grid demanded.\n\nHe refused to approach carelessly. Grid remained wary of traps—it was only natural to be vigilant when an unfamiliar monster begged for death.\n\n*Is this some kind of exploding enemy?*\n\nThe Evil Eye laughed at Grid's obvious suspicion.\n\n\"My great **Foresight** told me everything. In a few seconds, my forehead would be pierced by your pickaxe. Kukuk... If this is the destiny heaven has decreed, I will humbly accept it.\"\n\n\"...What bizarre monsters. Why are they even here in the first place?\"\n\nAll seventeen Evil Eyes lay sprawled like corpses. Grid was grumbling about how to handle them when a woman's voice called out.\n\n\"Uh... How did you handle so many Evil Eyes by yourself?\"\n\nTom Yum. The Thai woman he'd met at the entrance approached cautiously. Grid scratched his head.\n\n\"It's a bit vague to say I 'handled' them. What about you? Why did you follow me?\"\n\n\"I was worried...\" Tom Yum admitted.\n\n\"What?\"\n\n*She followed me because she was worried?* Grid couldn't comprehend it.\n\n\"Don't talk nonsense.\" If she was after the minerals, Grid wouldn't yield an inch. He fixed Tom Yum with sharp eyes, displaying obvious hostility.\n\nTom Yum saw his expression and misunderstood.\n\n*Is he worried I'll get caught up in the fight with Blood Carnival?*\n\nThey'd only met for the first time today.\n\n*I haven't encountered someone with such a good heart in a long time. He's the Overgeared Guild Master for a reason.*\n\nA powerhouse who made other high rankers submit to him.\n\n*It wouldn't be polite to refuse the goodwill he's shown me repeatedly.*\n\nTom Yum stepped backward and bowed respectfully to Grid.\n\n\"Next time, I'll greet you properly.\"\n\n\"Why?\" Grid asked, bewildered.\n\n*What is she talking about?*\n\nTom Yum vanished before Grid could ask further questions. As she headed back toward the entrance, she thought:\n\n*He isn't exhausted at all despite defeating powerful Evil Eyes alone. I don't need to worry about him.*\n\nIndeed, this was the man who'd broken through the Sky above the Sky ranking. Perhaps **Blood Carnival** would fall today after all."
}