{
  "id": 616,
  "title": "Chapter 616",
  "content": "\"Why haven't you killed me yet? Are you trying to shame me with mercy?\" The evil eye's voice dripped with defiance. \"How amusing. I'll politely decline. I am a noble being who can perceive the flow of time itself. It's disgraceful to cling to life through human pity. The blood in my veins boils at the very humiliation.\"\n\n*What the hell is wrong with these things?*\n\nThe evil eyes lay sprawled on the ground, practically begging for death. Grid stared at them, completely dumbfounded.\n\n*I should've just killed them from the start instead of wasting time sparing them.*\n\nThis was exactly why he shouldn't deviate from his usual methods. Doing things outside his comfort zone always led to complications.\n\n*It was a mistake to even talk to them in the first place.*\n\nThe way the evil eyes spoke—that verbose, theatrical style—reminded him so much of Lauel that he'd actually felt a flicker of kinship. It had dulled his hostility.\n\n*Wait a second...*\n\nA sudden thought struck him.\n\n*These guys... wouldn't they get along great with Lauel?*\n\nNow that he'd already spared them, killing them seemed wasteful. Grid's mind raced through possibilities before he spoke.\n\n\"You want to die? Fine. Become my subordinates instead.\"\n\n\"...What?\"\n\nServitude. Could non-NPC monsters even be made into subordinates? Normally, Grid wouldn't have entertained such a notion. But now he possessed the title of First King.\n\n> **Title Effect Activated**\n> \n> A great king commands respect. Charm, Dignity, and Leadership stats exert significantly greater influence over NPCs and monsters.\n\n*Maybe it's actually possible.*\n\nThis could be his chance to recruit the evil eyes as subordinates. He had nothing to lose by trying. The evil eyes began reacting to Grid's dubious yet hopeful proposition.\n\n\"A mere human dares to claim the noble evil eyes as subordinates?\" One of them let out a theatrical laugh. \"Looking at our entire history, no human has ever shown such audacity. Your arrogance already transcends the boundaries of humanity. A mentality unbound by common sense... Yes, that's what we're witnessing.\"\n\n\"Shocking. Enough to shake the very essence of our souls, trapped as they are within these fleshly prisons.\"\n\nAll seventeen evil eyes groaned as they struggled to their feet. Their massive heads made the effort visibly difficult.\n\n*Their weight distribution is completely unbalanced. Their agility must be abysmal.*\n\nThe evil eyes were a species plagued by physical disadvantages. Yet their inherent power was undeniable.\n\n*If I can actually make them my subordinates, it'll be a massive gain.*\n\nHis heart raced with anticipation as the evil eyes staggered toward him, their crimson pupils blazing with otherworldly light.\n\n\"Do you truly believe we would serve a mere human? As I stated before, it would be an unforgivable disgrace. It's utterly imposs—\" The evil eye froze mid-sentence, its massive eye widening in shock. \"What... what is *that*?\"\n\nThe creatures trembled, their gazes fixed on something behind Grid.\n\n\"That cat...!\"\n\nA plump feline wielded a pickaxe with awkward, clumsy movements, chipping away at the dungeon wall. Its round belly swayed with each swing. The evil eyes stared as if they'd seen a ghost.\n\n\"Memphis!\"\n\nA demonic beast of noble lineage—one that served only the great demons. The finest demonic beast in all of hell. Why was such a creature here?\n\n*And why is it holding a pickaxe?*\n\nThe situation defied comprehension. Then, understanding dawned on the bewildered evil eyes.\n\n\"Huff... huff... Master, can I take a break? This is hard, nyaa...\"\n\n\"What?!\"\n\nImpossible! The greatest demonic beast of hell—a Memphis—*served* a human?\n\n\"You've still got stamina left, so what's the problem? Stop whining and get back to work.\"\n\n\"Mining isn't fun...\"\n\n\"If labor was fun, it wouldn't be called labor.\"\n\n\"Nyaa...\"\n\nGrid remained unmoved. He walked over to Noe, who had sprawled on his back, exposing his plump belly. The cat's eyes grew impossibly wide, projecting maximum pitiful distress—a shameless plea for mercy. Grid's expression didn't soften in the slightest. Eventually, Noe was forced to resume mining.\n\nThe evil eyes watched this exchange in stunned silence.\n\nGrid nodded in the awkward quiet. \"I understand your position. Then I'll kill you as you requested.\"\n\nHe released his attachment to recruiting them and gripped his pickaxe with grim determination.\n\n\"Wait! I will serve you!\"\n\n\"Me as well!\"\n\n\"I share their sentiment!\"\n\nAll seventeen evil eyes reversed their stance in an instant.\n\n\"Though you are human, the fact that you've tamed a Memphis into such docility... that alone commands respect.\"\n\n\"In truth, dismissing you merely for being human was narrow-minded. You defeated all of us.\"\n\n\"However, there is one condition before we pledge our service.\"\n\n\"A condition?\" \n\nThey wanted to negotiate *after* he'd spared their lives? Grid almost admired their audacity—or stupidity. These evil eyes were something else entirely.\n\n\"What do you want?\"\n\n\"The desire burning within us evil eyes is the destruction of the great demons. We cannot forgive those who drove us from hell.\"\n\n\"But to exact revenge on such powerful beings, we require a formidable ally.\"\n\n\"And we have discovered that ally.\"\n\n\"The child of the insane dragon, Nevartan.\"\n\n\"Such a being would harbor tremendous resentment toward the great demons who drove his father to madness.\"\n\n\"We wish to secure the dragon egg that will soon hatch.\"\n\nGrid listened in silence before asking, his expression skeptical, \"...Is this some kind of delusion?\"\n\nWas this like Lauel's bizarre claim about a black dragon sealed in his hand? The sudden mention of a dragon seemed too fantastical to take seriously. The evil eyes shook their massive heads emphatically.\n\n\"At the deepest point of this dungeon lies the insane dragon's egg.\"\n\n\"If you help us secure it from the human who currently guards it, we evil eyes will bind our fate to yours forever.\"\n\n\"No.\"\n\nGetting involved with dragons this early? Absolutely not.\n\n\"I'm not—\"\n\nGrid envisioned Reinhardt reduced to rubble by dragon breath and began to refuse their proposal outright.\n\n> **[A Hidden Quest has been created.]**\n> \n> **[Insane Dragon Egg]**\n> \n> ★ **Hidden Quest** ★\n> \n> The evil eyes are demonkin exiled from hell.\n> \n> They dream of allying with Nevartan's child to exact revenge upon the great demons.\n> \n> Secure the insane dragon egg guarded by the dungeon master and deliver it to the evil eyes.\n> \n> **Quest Clear Conditions:** Secure the insane dragon egg.\n> \n> **Quest Clear Rewards:** Acquire 17 evil eyes as subordinates. Affinity with the evil eyes will increase. Trade opportunities with the evil eyes become available.\n> \n> **Quest Failure Penalty:** Level -3.\n\n\"You've got to be kidding me!\"\n\nA quest that would cost him *three levels* if he failed?\n\nGrid's hands trembled.\n\n*Why am I suffering when all I wanted was to dig up some minerals?*\n\nHe'd fought and defeated the evil eyes. He'd proposed they become his subordinates. They'd accepted because they'd seen Memphis. This hidden quest had emerged through a chain of pure coincidences. An episode that might have remained hidden forever had been triggered because of Grid's actions.\n\nNormally, Grid would feel pride at uncovering such content. He'd be thrilled by the quest rewards. But right now? He felt nothing but dread. This quest involved a *dragon egg*. Where were dragon eggs typically kept? Heavily guarded, dangerous locations. Grid wanted those rewards desperately, but the odds of failure loomed large in his mind.\n\n\"Damn it... Son of a—!\" He bit off a string of curses.\n\nThe evil eyes shifted uncomfortably as Grid's mood darkened. They could sense the killing intent radiating from him.\n\n\"I should've just killed you from the start.\"\n\n*Gulp.*\n\nHe'd promised to spare them, and now he wanted them dead? *And* he was saying it right to their faces? The evil eyes concluded that Grid was an extremely vicious and capricious individual.\n\n\"Indeed, the master of hell's finest demonic beast must be truly wicked.\"\n\n\"He's a demon wearing human skin.\"\n\n\"That's precisely why our souls are drawn to him. Hehe...\"\n\nSweat beaded on their forms despite their fear, yet their mouths continued running. Grid, maintaining his grim silence, pulled something from his inventory. He distributed pickaxes to all seventeen of them.\n\n\"...?\"\n\nThe evil eyes stared at the mining tools with blank incomprehension. Then Grid spoke.\n\n\"Isn't the dragon egg at the end of the dungeon? Don't forget to mine as we go.\"\n\n\"Hehe... what? You want *us* to mine? The great and noble evil eyes don't perform such menial labor—\"\n\n\"Shut up unless you want me to kill you right now.\"\n\n\"...\"\n\n***\n\nDark confirmed that the intruder had reached Zone 4.\n\n\"Man, braised pig's trotters really hit the spot for a midnight snack.\"\n\nDark had logged in after finishing his meal, confident the evil eyes would have handled the intruder by now.\n\n\"That bastard intruder is definitely dead by now. Once I confirm it, I'll— Huh?\"\n\nHis face went rigid. Cold sweat soaked his spine. The Beware Dogs dungeon was *still* in Display Mode.\n\n*What? The intruder's still alive?*\n\nThat meant the intruder had survived an encounter with the twenty evil eyes stationed in Zone 4.\n\n\"The evil eyes were defeated?\"\n\nNo, that theory didn't make sense. The evil eyes were the most powerful monsters in his arsenal—capable of neutralizing opponents with their gaze alone. There was no way they could be defeated.\n\n\"Maybe the first intruder died and a new one appeared? Oh no...\"\n\nDark's face drained of color as he checked the dungeon's defense logs. There was no record of a new intruder entering. The original intruder had survived Zone 4.\n\n\"How is that possible?\"\n\nDark's mind reeled, unable to comprehend the situation. His thoughts spun in confused circles.\n\n\"I-I need to assess the situation properly.\"\n\nDreading the worst, Dark hurriedly opened the dungeon status window.\n\n> **[Zone 7 of the Beware Dogs dungeon has been completely destroyed!]**\n> \n> **[An intruder has appeared in Zone 8 of the 'Beware Dogs' dungeon.]**\n\nCatastrophic notifications filled his vision.\n\n\"This is... this is the end of the dungeon!\"\n\nA voice echoed through the chamber.\n\n\"You... who are you?\"\n\nDark whirled toward the intruder, trembling with rage and disbelief. Then he saw him.\n\n\"Grid...?\"\n\nThe first legendary class holder. The first king. The intruder was someone of *that* caliber? Grid studied the bewildered Dark with open curiosity. It was only natural to be intrigued after discovering the master of such an elaborate dungeon was a fellow player.\n\n\"Tell me,\" Grid said. \"What's your identity?\""
}