{
  "id": 617,
  "title": "Chapter 617",
  "content": "# The Dungeon Master\n\n**Master of Blood Carnival.**\n\nDark had always operated from the shadows. He never revealed himself publicly, never exposed his identity. The reason was simple—he refused to let anyone connect him to the notorious Blood Carnival. For someone with ambitious plans for the future, Blood Carnival was merely a means to an end: a lucrative source of funding.\n\n\"You—what's your deal? You look... strange.\"\n\nDark wore a mask daily, a necessary precaution during his dealings with Blood Carnival.\n\n\"Why the silence? Can't you speak?\"\n\nGrid's frown deepened. A mysterious player with their face and ID completely hidden. According to the quest details, this person owned the dungeon. But how? *How does a player even own a dungeon?* Questions multiplied in his mind, yet the masked figure remained silent as stone.\n\n\"Who are you?\" Grid pressed.\n\nA derisive laugh echoed from behind the mask.\n\n\"Your personality is as rotten as the rumors suggest. How can you act so entitled when you're the one who invaded someone else's territory and destroyed everything? Don't you have even a shred of conscience? Any remorse at all?\"\n\n\"I had no idea this dungeon belonged to anyone. How was I supposed to know?\"\n\n\"Does ignorance absolve you of sin?\"\n\n\"Yes. It does.\"\n\nIn truth, Dark wasn't wrong about Grid's past. He'd been selfish and greedy, never hesitating to seize any advantage. But that was before. He'd changed. Now, he wouldn't pursue profit if it meant devastating innocent people. If Grid had met Dark before the Insane Dragon Egg quest, he might have felt genuine remorse.\n\n\"But right now, I'm completing a quest. Quests are the core content of this game, aren't they? I'm sorry, but it can't be helped. Hand over the insane dragon egg.\"\n\nYes, it was rationalization. Grid justified his selfishness and greed under the banner of quest completion. To Dark's eyes, Grid was nothing more than a shameless villain. Yet Dark didn't condemn him—he understood. He, too, employed any means necessary to achieve his goals. Such was the burden of those who dreamed of reaching the top.\n\n\"You're after the insane dragon egg...\"\n\nDark shook his head slowly. *How much have I sacrificed to protect this egg?* He'd discovered it a year ago, purely by chance. Since then, he'd harbored one ambition: to become the only player with a dragon companion. He'd extracted exorbitant profits from Blood Carnival to fund this dungeon's construction. And now, someone like Grid appeared, demanding *his* egg. Unacceptable.\n\n\"Disgraceful.\"\n\n*Kwaduduk!*\n\nKilling intent flooded the chamber.\n\n\"You're underestimating me.\"\n\nDungeon Maker was a hidden growth-type class that had evolved to unique rating. While specialized in dungeon creation, like Pagma's Descendant, it possessed formidable combat capabilities. More importantly, within his own dungeons, all of Dark's stats and skills received massive bonuses. Here, his class advantages activated fully, amplifying his power to terrifying levels.\n\n\"I don't care if you broke the old sky! *I am the new sky!*\"\n\n*Kwarururung!*\n\nAt Dark's roar, the dungeon itself awakened. Zone 8—every wall, every floor tile—was a trap designed to protect the dragon egg. They activated simultaneously, converging on Grid.\n\n*What?!*\n\nGrid's eyes widened. This trap dwarfed anything he'd encountered since starting Satisfy.\n\n\"God Hands!\"\n\nThe four golden constructs materialized, intercepting arrows and spears. But four hands, no matter how swift, couldn't block thousands of projectiles.\n\n\"**Wave**.\"\n\n*Kurururung!*\n\nGrid pushed through the God Hands' defensive perimeter and unleashed the wide-area technique, sweeping away the incoming barrage. Several attacks landed, but Triple Layers and Lantier's Cloak absorbed most of the damage. The real problem emerged from below—the floor split apart, revealing churning lava hungry to consume him.\n\nGrid hastily equipped Braham's Boots and took flight.\n\nA mistake.\n\n*Kukukung!*\n\nThe ceiling plummeted downward, crushing him with devastating weight. Unable to support it through strength alone, Grid activated Freely Move, phasing through the trap network to close on Dark.\n\n\"**Kill**!\"\n\nGrid's blade thrust forward.\n\n\"**Building Walls**!\"\n\n*Kwa kwa kwa kwang!*\n\nDark produced a massive hammer and slammed it into the ground. Stone walls—stronger than any magician's barrier—erupted upward, completely absorbing Kill's damage.\n\n*It blocked +9 Failure's Kill completely?*\n\nStone fragments scattered like shrapnel. Ignoring the razor-sharp debris, Grid pressed his assault. Dark's resistance proved stubborn—he wielded a shovel, pouring cement to neutralize Link.\n\n> [You have been inflicted with 'Petrification.']\n> [You have resisted.]\n> [Due to the effect of 'First King' title, 'Great King's Majesty' is activated.]\n> [Status reflection has failed.]\n\n*You bastard!*\n\nGrid and Dark locked eyes, mutual wariness thickening the air. Both acknowledged the other as a genuine threat. Grid countered Dark's shovel with Revolve, then immediately activated Blackening. The counterattack staggered Dark, who retaliated by using Throwing Bricks to disrupt Grid's trajectory. The perfect opening vanished, but Grid understood.\n\n*Based on his skill configuration and complete trap control...*\n\n*A Dungeon Maker? This player can actually create dungeons?*\n\n\"A hidden class!\"\n\n\"Finally figured it out! I'll become a legend too!\"\n\n*Kwa kwang!*\n\n*Kwa kwa kwa kwang!*\n\nGrid activated Blacksmith's Rage and launched a relentless offensive. Dark countered expertly, utilizing traps with precise timing to sever the coordination between Grid and his God Hands.\n\n*By recreating Grid's battle footage, I've identified his greatest weakness—the limited duration of his buff skills.*\n\nPriority one: survive until Blackening expired. Counterattack afterward. Dark studied Grid carefully, confident his strength and agility far exceeded his opponent's.\n\n*I've been crafting dungeons for over three years!*\n\nHe would rely on stamina cultivated through endless labor to withstand Grid's fierce assault. Dark felt certain he could outlast Grid's exhaustion. Yes, he simply needed to wait.\n\nHowever...\n\n*Pant... pant... what the hell?*\n\nFifteen minutes into the battle, Blackening faded, yet Grid continued his assault without any sign of fatigue. Meanwhile, the confident Dark gasped for breath. *How does he have more stamina than me, the king of grinding?*\n\nHe even had dungeon buffs active!\n\n*It's his items...!*\n\nObviously Grid wore equipment that reduced stamina consumption. But the reality? If Dark was the king of grinding, Grid was the **god** of grinding. While others pressed production buttons for instant results, Grid spent days manually crafting each item. In terms of stats developed through sheer labor, Grid vastly surpassed Dark.\n\n*Is he finally wearing down?*\n\nEvery time Grid attempted a finishing blow, traps or skill deployments saved Dark. Grid acknowledged his opponent's power, but as the battle progressed, he noticed subtle changes. Dark's trap deployment and skill activation slowed incrementally.\n\n\"**Can you Become the King of the Dead?**\"\n\n*Clack!*\n\n*Clack clack!*\n\nDark recoiled as Grid and the God Hands advanced. Skeletal figures emerged, wielding silver threads.\n\n*Necromancer abilities?*\n\nBut they were merely skeletons with thread. Nothing threatening. Dark dismissed them, focusing on defending against Grid's attack.\n\nHis mistake.\n\n*Chwaruruk!*\n\nSilver threads successfully ensnared Dark's body. Grid's blade finally connected.\n\n\"**Linked Kill Wave Pinnacle**.\"\n\n*Peeng!*\n\n*Pepepepeng!*\n\nLinked Kill systematically shattered Dark's defensive walls.\n\n*Kurururung!*\n\nMid-sequence, Dark's defenses collapsed completely, leaving him exposed.\n\n\"*Kuaaaaak!*\"\n\nDark screamed as energy blades engulfed him, descending like lightning strikes.\n\n> [You have suffered catastrophic damage!]\n> [You won't die easily within your own dungeon. You can resist all attacks for 2 seconds at minimum health. The dungeon escape skill 'Emergency Exit' is activating.]\n\n\"Still alive?\"\n\nDark survived his strongest technique? Grid regarded him with renewed interest, while Dark's expression twisted in anguish.\n\n\"You! I'll repay this humiliation someday!\"\n\nDark looked like a broken puppet. The mask covering his face shattered, revealing his hidden ID.\n\n**[Eat Spicy Jokbal]**\n\n\"...\"\n\n\"...\"\n\nThe intense atmosphere evaporated into awkward silence. Dark's—no, Eat Spicy Jokbal's—expression turned sheepish. He activated Emergency Escape. Reality fractured, a door materializing in thin air.\n\n\"S-Son of a bitch! Just wait until I get an ID change ticket!\"\n\n*Pahat!*\n\nUnable to hide his embarrassment, Eat Spicy Jokbal fled through the emergency exit.\n\n\"...Korean?\"\n\nGrid found himself impressed by Eat Spicy Jokbal's dungeon creation abilities and combat prowess.\n\n*I should search for 'Eat Spicy Jokbal' online later.*\n\nIf it referenced an actual business, it might provide a contact method. Yes—Grid wanted Eat Spicy Jokbal to join Overgeared. Natural, really. The dungeon-making ability was unique, and his combat capabilities exceeded many current Overgeared members.\n\n*Then I can properly compensate him for the damages.*\n\nFair, considering he'd be claiming the insane dragon egg. Grid approached the severed stone in the dungeon's center. There sat a massive oval egg, significantly larger than himself."
}