{
  "id": 618,
  "title": "Chapter 618",
  "content": "**Chapter [X]**\n\n\"Small consolation, I suppose.\"\n\nEat Spicy Jokbal exhaled slowly as his status window materialized before him, safely beyond the dungeon's boundaries. The experience gain was substantial—Grid's rampage through the dungeon's monsters and traps had inadvertently gifted him two full levels.\n\n*At least I've measured the strength of my forces accurately now.* His lips curved into a bitter smile. *Testing myself against someone of Grid's caliber? That's worth more than gold.*\n\nThe insane dragon egg—gone. A year of careful protection, reduced to nothing. Yet his hands remained steady, his resolve unshaken. One setback wouldn't break him. \n\nIt was the Korean way, he told himself. That stubborn refusal to yield that Peak Sword always spoke of—the fire that had burned in his people for generations whenever invaders came. The same spirit that had dominated e-sports for half a century now blazed through Satisfy.\n\n*Still...* A flicker of disappointment crossed his face. *Being the first dragon rider would've been legendary.*\n\nHe dismissed the thought just as quickly. The evil eyes' words had been clear enough: dragons didn't follow humans. The probability had always hovered near impossible.\n\n*Grid won't tame it either.*\n\nThe pieces fit together too neatly. This egg, positioned to counter Hell itself according to Satisfy's lore—no single player was meant to wield such power. The game's narrative wouldn't allow it.\n\nWith practiced efficiency, Eat Spicy Jokbal composed a message to his old comrades—the three who'd stood with him since Blood Carnival's founding.\n\n—*Grid knows.*\n\n—*What? How the hell did he find out?*\n\n—*His intelligence network runs deeper than we thought. He knew I led Blood Carnival. He even had intel on the dragon egg.*\n\n—*Christ... that's terrifying.*\n\n—*First King for a reason. We can't predict his next move. Cut our losses now—disband Blood Carnival. Everyone goes dark. Immediately.*\n\n***\n\nThe egg dominated the altar, easily twice Grid's height. \n\nGrid circled it slowly, one hand stroking his chin. At 181 centimeters of solid muscle, he wasn't a small man—which made the egg's proportions even more absurd.\n\n\"Could feed a battalion with egg fried rice from this thing...\" He tilted his head. \"Wait, does that mean the hatchling's bigger than a person right out of the shell?\"\n\n\"It's called a *hatchling*, not a puppy.\" Minor emerged from his hiding spot, the seventeen evil eyes flowing like shadows behind him.\n\n\"Huh. Learn something new every day.\"\n\nGrid had wondered why they'd sat out his confrontation with Eat Spicy Jokbal. The answer lay in their nature: demonkin couldn't harm humans they'd contracted with. Faith bound them—and the evil eyes possessed unusually strong faith for their kind. Righteousness and compassion ran through them like veins of gold through stone. They simply couldn't bring themselves to attack Eat Spicy Jokbal.\n\n\"So when's this thing due to crack?\"\n\n**Legendary Blacksmith's Appraisal** revealed nothing. The egg's secrets remained locked.\n\nAn evil eye with foresight abilities stepped forward, its multiple pupils swirling. \"When twin moons dance nine times through darkness eternal, and the ancient song echoes... roughly speaking. Kukukuk.\"\n\nAnother chimed in, \"Twin moons rise once per four months. Three years, give or take.\"\n\nGrid's eye twitched. *No wonder Hell kicked these guys out. They're insufferable.*\n\nA notification chimed.\n\n[**Quest Complete!**]\n\n[Reward: 17 Evil Eyes will serve as your subordinates]\n\n[Affinity with Evil Eyes has increased dramatically. Trade and exchange are now available]\n\n\"The egg is secured. We serve you now, as promised.\" The speaker's tone carried pride despite the pledge of service. \"Kukuk. Appreciate the honor, human.\"\n\n\"Command us. Whatever you expect, we shall exceed it. Huhut.\"\n\n\"...\"\n\nTheir manner bordered on insolent, but Grid detected genuine loyalty beneath the attitude. It reminded him of Lauel—which wasn't necessarily a compliment.\n\n\"Managing seventeen of you sounds like a headache. You'll report to Lauel directly. He'll know how to use you properly.\"\n\n\"Lauel?\" Multiple eyes narrowed. \"Who is this?\"\n\n\"We swore service to *you*. No other human is worthy of commanding us.\"\n\nGrid waved dismissively. \"You'll like him once you meet. Trust me—Lauel's a kindred spirit. Practically one of your own from a past life.\"\n\n\"A past life companion?\" Murmurs rippled through the group. \"Hoh... interesting words.\"\n\n\"What happens to the egg now?\"\n\nGrid didn't bother asking whether the hatched dragon would serve him. His understanding of Satisfy had grown substantially since his early days. The quest's framework told him everything he needed to know: this dragon wouldn't—couldn't—belong to any single player.\n\n*Makes sense. A player-owned dragon would shatter game balance completely.*\n\nBeyond balance, it approached bug-level exploitation. Grid released his attachment to the idea with practiced ease.\n\nAn evil eye explained, \"We'll transport it to our village. It will be guarded until hatching.\"\n\nAnother continued, \"The moment it emerges, the dragonling will comprehend truth itself. It will aid us in avenging its sire's enemies.\"\n\n\"In one thousand years, the dragon will reach maturity. Hell will tremble. Huhuhut.\"\n\n\"*One thousand years?*\"\n\nGrid's jaw dropped. A thousand years from hatchling to adult dragon?\n\n*I'll be dust and bones while the great demons are still going strong.*\n\nThe dragon egg wasn't a player-relevant episode at all. Not for anyone currently alive.\n\n*Actually, that's probably for the best.* Grid's expression cleared. *If dragons got involved in player affairs, the game would become unplayable. Too much power concentrated in one event.*\n\nBetter to settle for the evil eyes as allies. That was reward enough.\n\n\"Human, come with us to our village. Just once.\"\n\n\"Our king will bestow great rewards upon you.\"\n\nSomething about the phrasing—*bestow*, like he was some subordinate receiving a bonus—rankled Grid slightly. Still, he swallowed his pride and nodded. A powerful new species backing his kingdom's future? That was worth a little discomfort. Besides, establishing relations with the entire evil eye race would pay dividends.\n\n*Keep the ego in check. Make allies of all of them if possible.*\n\n\"Fine. I'll visit your village.\"\n\nHe paused, gaze sweeping across Zone 8's mineral-rich walls.\n\n\"But first—start mining.\"\n\nBy the time Grid finally departed Beware Dogs dungeon, the evil eyes were utterly exhausted.\n\n***\n\n\"Noble of foresight, I must ask something.\"\n\n\"Resident of blazing eyes?\" The addressed evil eye's pupils swirled with amusement. \"Kukuk. Very well. On my honor as nobility, I shall answer faithfully.\"\n\n\"We've sworn ourselves to Grid. He is worthy—I don't dispute that. But leading him to our city...\" The speaker hesitated. \"Isn't that betrayal?\"\n\nThe concern wasn't baseless. Their village housed roughly a thousand evil eyes—small in number, overwhelming in power. More critically, their minister possessed an ability that compelled absolute submission. If Grid encountered it...\n\n\"He'd become enslaved to the evil eyes forever. We'd trap him.\" The speaker's voice dropped. \"Our pride wouldn't allow it.\"\n\n\"Your concern is misplaced.\" The noble's tone carried certainty. \"Grid helped secure the dragon egg. Our minister's pride exceeds even ours—harming Grid would be beneath him.\"\n\n*Tang! Tang! Tang!*\n\nIn Zone 8's devastation, pickaxes rang against stone. The evil eyes, newly taught in Mining skill basics, worked while debating Grid's fate. Their loyalty ran deep—though as with any species, personalities varied. Not every evil eye in the village would share these seventeen's sense of honor.\n\nGrid remained blissfully unaware of this nuance. His thoughts focused solely on the potential of this new alliance.\n\n*Lulula~*\n\nHe hummed cheerfully as dragon-essence minerals piled into his inventory.\n\n***\n\n[**Blood Carnival has been disbanded.**]\n\n\"What the fuck?\"\n\nBlood Carnival had flourished in recent years, feeding on the world's endless supply of wicked people and those who needed their services. Nearly four hundred members strong—gone overnight. Dissolved without warning.\n\n\"That bastard Dark...\"\n\n\"Never even saw his face. Years of working together, and he dumps us without a word.\"\n\n\"I mean, what were we expecting? We're criminals. But throwing away an organization this valuable in one night? That's just stupid.\"\n\n\"Hmm...\"\n\nConfusion rippled through the scattered former members. Dark's decision had been absolute—no consultation, no explanation. For days, they speculated wildly about what could've prompted such drastic action.\n\nThen the rumors began circulating.\n\n\"The Anti-Blood Carnival Alliance hit our base.\"\n\n\"Three hundred players. Around twenty high rankers.\"\n\n\"Such a massive operation, and it happened when nobody was home?\"\n\n\"Maybe Dark got soloed and panicked into disbanding?\"\n\n\"No, you've got it backwards.\" The speaker's voice dropped to an awed whisper. \"The alliance was *annihilated*.\"\n\n\"*What?*\"\n\nDark had defeated three hundred players alone? Including twenty high rankers?\n\n\"How strong is this guy? Stronger than the Black and White sisters?\"\n\n\"He always hid behind that curtain. Was he concealing this kind of power all along?\"\n\n\"Then why disband? If he's that powerful—\"\n\n\"There's more.\"\n\nNope, whose intelligence network rivaled any guild's, leaned forward. The high-ranking adventurer swallowed hard.\n\n\"Grid showed up right after Dark wiped the alliance.\"\n\nSilence crashed down like a physical weight.\n\n\"Grid... *Grid?!*\"\n\nGoosebumps erupted across every arm in the room.\n\n\"Grid was backing the Anti-Blood Carnival Alliance?\"\n\n\"Has to be. Grid used the alliance to locate our base and corner Dark.\"\n\n\"Then he made his move—disband Blood Carnival, or the Overgeared Kingdom comes down on us like a hammer.\"\n\n\"Cork Island...\" Someone breathed the name like a curse. \"This is revenge for Cork Island.\"\n\n\"God, what a monster...\"\n\n\"We provoked the wrong person. We should've never touched him.\"\n\n\"T-Tarma!\" A player's voice cracked with terror. \"What do we do? Will Grid hunt us down?\"\n\n\"...\"\n\nTarma and his Cork Island raiders sat frozen, faces ashen. The implications terrified them: Grid had located Blood Carnival's hidden base and demolished it in *one day*. \n\nGrid himself had no idea he'd stumbled onto Blood Carnival's headquarters. The mine had simply looked promising for minerals.\n\nBut nobody knew that. The misunderstanding spread like wildfire.\n\n\"No choice,\" Tarma finally managed. \"We go dark for a few months. Better to restrict our activities than get farmed repeatedly by the Overgeared Kingdom.\"\n\n\"That'll hurt our earnings badly.\"\n\n\"Better than being hunted by that demon.\"\n\n\"Fuck...\"\n\nFrom that day forward, an unusual peace settled over Satisfy. The activities of dark gamers plummeted. A single hero's presence had reshaped the underworld.\n\nThe hero himself remained completely oblivious.\n\n***\n\n\"Why do my ears keep itching lately?\"\n\nEn route to the evil eyes' village, Grid—unwitting disbander of Blood Carnival—scratched at his ear in confusion."
}