{
  "id": 62,
  "title": "Chapter 62",
  "content": "# Chapter 62\n\nThe crowd murmured in amazement. Grid pushed through them and approached the administrator.\n\n\"How much will this be worth?\" Grid jabbed a finger at the sword. \"You said it before. If I make good items, you'll pay a higher price.\"\n\n\"U-Ummm.\" The administrator's face went pale. \"That... that...\"\n\nThe words wouldn't come. This work was too valuable. He would need to discuss purchasing and pricing with Lady Irene before committing to anything.\n\nIrene had already made up her mind.\n\n\"Sir Phoenix.\"\n\n\"Yes, My Lady.\"\n\n\"If you had this sword, could you defeat one of the Seven Servants?\"\n\nPhoenix fell silent. He weighed the testimonies from the defeated soldiers against his own abilities. The calculation took time.\n\n\"I believe I could.\" He straightened. \"No. I would be stronger. Assuming I wielded this sword.\"\n\nThis wasn't arrogance. Phoenix ranked among the ten strongest knights in the Eternal Kingdom, and held the title of the north's finest blade. Irene smiled at the certainty in his voice.\n\n\"Good. Administrator, purchase this sword. I'll leave the price to your judgment.\"\n\n\"Yes, My Lady.\"\n\nGrid's chest swelled. *Her words carry weight. As expected from nobility.*\n\n*How much will I get?*\n\n\"Let's go to my office,\" the administrator said.\n\n\"Yes. My Lady, I'll take my leave.\" Phoenix bowed.\n\n\"I'll see you again, Grid.\"\n\nIrene extended her hand. Grid recognized the gesture. A kiss on the back of a noblewoman's hand represented the highest honor she could bestow. Irene felt genuine respect after witnessing his blacksmithing.\n\n*Huh?*\n\nAs Grid bent to kiss her hand, he noticed a blue ring on her necklace. *Where have I seen that before?*\n\nHe tried to remember but drew a blank.\n\n*Must be a common design.*\n\nAfter Irene's party departed, Grid followed the administrator to his office.\n\n\"Sit for a moment while I calculate the purchase price.\" The administrator gestured to a chair. \"It might take some time, so please bear with me.\"\n\n\"Take all the time you need.\"\n\nThe administrator settled at his desk and dragged over an abacus. The calculations proved complex. His face twisted with concentration as the beads clicked back and forth. Grid drank eight cups of warm tea. His eyelids grew heavy. Finally, the administrator set down the abacus.\n\n\"Um. The <span class=\"rarity-uncommon\">Anticipated Sword</span> will be purchased for seven thousand gold.\" He cleared his throat. \"The <span class=\"rarity-legendary\">Sword of Self-transcendence</span> will be purchased for two hundred thousand gold.\"\n\nGrid bolted upright in his chair.\n\n\"Are you kidding me? Twenty gold? The other sword is seven thousand, and you're offering twenty for the <span class=\"rarity-legendary\">Sword of Self-transcendence</span>?\" His voice rose. \"This is ridiculous. I used nine hundred and fifty gold worth of materials to make that sword!\"\n\n\"No, no.\" The administrator waved his hands frantically. \"I think you misheard me. I said two hundred thousand gold, not twenty.\"\n\n\"Two hundred thousand gold?\"\n\n\"That's correct.\"\n\n\"......\"\n\nGrid's heart stopped.\n\nSeveral seconds passed.\n\n\"Huu... huuk... huuuck!\" He couldn't breathe. \"Two hundred thousand gold? Are you serious?\"\n\nThe administrator studied him carefully.\n\n\"Do you think the amount is too low?\" He fidgeted with his sleeve. \"This is the highest value, exceeding even the heirlooms passed down through Earl Steim's family for generations. Do you still think it insufficient? Uhh. I'm willing to pay twenty thousand gold more, but anything beyond that is impossible. It would seriously damage our financial situation. Please understand.\"\n\nWinston boasted a population of three hundred and thirty thousand and a growth rate of twenty-two percent annually. Its operating budget reached one hundred and seventy thousand gold. The value of the <span class=\"rarity-legendary\">Sword of Self-transcendence</span> exceeded Winston's entire annual budget.\n\nThe administrator leaned forward. \"This is the highest value I can offer. It will become an heirloom of Earl Steim's family. If you aren't satisfied with this amount, it would be difficult. You'd be hard-pressed to find a noble or merchant offering more.\"\n\nGrid said nothing. The administrator's concern deepened. He assumed Grid was dissatisfied with the offer.\n\nHe was mistaken. Grid was thrilled beyond measure.\n\n*The many misfortunes I suffered in my twenty-six years of life led to this one lucky moment.*\n\nTwo hundred and twenty thousand gold equaled two hundred and sixty-four million won.\n\n*After paying back my debt, I'll have two hundred and fifty-four million won left.*\n\nHe wanted to complete the transaction immediately and log out. Then he'd march straight to Mother's Heart is Happy Financial Services and shove the ten million won debt in their faces. He imagined the scene.\n\n\"That's it! I paid back the money, so don't call me anymore, you money-grubbing jerks!\"\n\nThen he'd buy a foreign car. Luxury clothes. In a month, he'd attend his high school reunion in style.\n\n*I'll show up in a foreign car wearing designer brands.*\n\nGrid, the debt-ridden game addict, had always been the target of ridicule. Whenever he attended reunions, shame followed him like a shadow. He'd skipped the last one, despite it being the only place he could see Ahyoung, his first love.\n\nEverything had changed now. Grid would attend confidently and prove himself.\n\n*They won't be able to ignore me anymore. Then I can confess to Ahyoung.*\n\nGrid had considered another option before coming here. Should he sell the <span class=\"rarity-legendary\">Sword of Self-transcendence</span> on the item trading sites? The first legendary item would surely fetch a massive price. If that were true, abandoning the administrator's quest and registering the sword online made more sense.\n\nThe consideration hadn't lasted long. At present, no users existed who could meet the usage requirements for the <span class=\"rarity-legendary\">Sword of Self-transcendence</span>. If he listed it on trading sites, only merchants seeking future investments would show interest, not genuine buyers.\n\nGrid didn't sell the <span class=\"rarity-legendary\">Sword of Self-transcendence</span> for the same reason he hadn't sold the <span class=\"rarity-uncommon\">Ideal Dagger</span>. The administrator had promised a high price. Selling directly meant no transaction fees.\n\nGrid had secured two hundred and sixty-four million won. Satisfaction flooded through him.\n\n\"Okay. I'll sell at that price.\"\n\n\"Ohh, a wise decision.\" The administrator beamed. \"The trade is complete.\"\n\n> [The deal has been completed.]\n> \n> [Quest success!]\n> \n> [234,000 gold has been acquired.]\n> \n> [3 pieces of blue orichalcum have been acquired.]\n> \n> [Obtained the status of 'Winston's Person of Distinction']\n> \n> [Affinity with the administrator has risen to the maximum.]\n\n*Blue orichalcum!*\n\nGrid pulled up the production method for <span class=\"rarity-legendary\">Failure</span>.\n\n> **[<span class=\"rarity-legendary\">Failure</span>]**\n> \n> Rating: Unique ~ Legendary\n> \n> **Unique Rating Information:**\n> \n> Durability: 699/699 | Attack Power: 733~1,621 | Defense: 50\n> \n> * Agility +30\n> * Low probability of blocking enemy attacks\n> * Certain probability of activating the '5 Joint Attacks' skill\n> * High probability of activating the 'Cutting' skill\n> * Fear effect if the enemy is more than 20 levels lower than the user\n> * Attack power +20% in dark places\n> \n> **Legendary Rating Information:**\n> \n> Durability: 1,090/1,090 | Attack Power: 874~1,820 | Defense: 80\n> \n> * Agility +50\n> * Low probability of blocking enemy attacks\n> * Certain probability of activating the '5 Joint Attacks' skill\n> * High probability of activating the 'Cutting' skill\n> * The skill 'Bisect' will be created\n> * Fear effect if the enemy is more than 20 levels lower than the user\n> * Attack power +20% in dark places\n> \n> A greatsword designed by a legendary blacksmith. Its unique shape grants excellent cutting ability despite its size. It resembles the predator of the sea, a shark, and instills fear in enemies. Small blades protruding from the sword increase defense.\n> \n> Blue orichalcum is used as a material. Its lightness prevents reduced attack speed. Due to the nature of blue orichalcum, it becomes stronger in the dark.\n> \n> User Restriction: Level 300 or higher. More than 5,000 **Strength**. Advanced Sword Mastery level 8 or higher.\n> \n> Weight: 550\n\nThe performance was overwhelming. To produce such a weapon, he'd need fifteen pieces of blue orichalcum. A rare material dropped by the Guardian of the Forest. He'd just obtained three of this precious mineral.\n\nThe administrator smiled at Grid, who stared at the blue minerals.\n\n\"Indeed. You're a great blacksmith, so you recognize the value of that mineral.\" He nodded. \"It's a gift I received in the past for helping others. I've been using it as decoration due to its mysterious color, but you can use it more appropriately than me.\"\n\nJoy surged through Grid at the unexpected windfall. Then another reward caught his attention.\n\n*Winston's Person of Distinction? What's this?*\n\nHe examined the new status.\n\n> **[Winston's Person of Distinction]**\n> \n> This status is given to technicians acknowledged by Winston's ruler.\n> \n> Works produced by Winston's Person of Distinction will have higher value in Winston and be exempt from all taxes there.\n\n*Ohh. Khan pays various taxes when he runs the business. Once I become the smithy owner, I won't have to pay taxes?*\n\nGrid's expression brightened. The deal with the administrator looked better by the minute.\n\nThe truth was different. Grid had suffered a massive loss.\n\nWhy?\n\nGrid and most users didn't know this, but the current top twenty rankers were close to mastering intermediate level skills. In a few months, several rankers would possess advanced level skills.\n\nIf Grid had registered the item at the trading sites, the price could have climbed to billions of won due to fierce competition between top rankers. This wasn't an exaggeration. Satisfy boasted at least two billion users. Many earned real money and invested cash to acquire better items. Meanwhile, the item supply rate remained devastatingly low.\n\nPrices would skyrocket if a legendary item went to auction. Grid would have traded with some of the richest people in the world. He'd lost his original intention to create a legendary item and extract wealth from players worldwide.\n\nGrid could have amassed a fortune selling a single legendary item. Instead, he'd sold it to an NPC for a mere two hundred and sixty-four million won, a laughable amount. The only consolation was the Winston's Person of Distinction status. Grid would gain steady benefits in the long run from selling the <span class=\"rarity-legendary\">Sword of Self-transcendence</span> so cheaply.\n\n---\n\n\"Mother! Father! Sehee!\"\n\nYoungwoo burst from the capsule and sprinted to the living room. He wanted to share the news that their disappointing son had earned a fortune.\n\nThe living room was empty.\n\n\"Eh?\"\n\nDarkness filled the space. Dread coiled in his gut.\n\n*Did something happen to my family while I was in the capsule?*\n\nUnknown anxiety overwhelmed him.\n\n\"I should call them.\" He patted his pockets. No phone. \"Where's my phone? I'll use the home phone. Stay calm. Calm.\"\n\nHe stood before the phone. His hands shook as he dialed. The ringing sound stretched endlessly. Then he glanced at the electronic clock beside the phone.\n\n\"It's three in the morning?\"\n\nHe'd logged into Satisfy for so long that his sense of reality had dulled. He hadn't realized dawn approached. Youngwoo opened the bedroom doors one by one. Sehee and his parents slept peacefully.\n\n\"Phew. I'm glad.\"\n\nHe called himself an idiot and returned to bed. He'd share the happy news in the morning.\n\nMorning arrived. Youngwoo opened his eyes and understood the source of his anxiety.\n\n\"Youngwoo. Sehee.\" His mother's voice cracked. \"This isn't a joke, so listen carefully. Your father made a terrible mistake.\"\n\nSilence hung in the air.\n\nHis mother was crying. His father was smoking, despite quitting ten years ago.\n\n\"Your father became a guarantor for a friend's loan.\" Tears streamed down her face. \"That friend has been out of contact for a long time. Oh my! What should we do now?\"\n\n*This can't be happening.*\n\nHis father, who divided one chicken over three meals, had acted as a guarantor? The father he'd admired was this foolish? Shock and disappointment flooded through Youngwoo. Sehee's calm voice cut through the chaos.\n\n\"How much is the debt?\"\n\n\"Eight hundred million.\" Their father's voice was hollow. \"If I sell the store, this house, and use the money we've saved, I can pay back four hundred million. But I'm sorry, Sehee. The money we saved for your university and marriage...\"\n\nSomething didn't add up.\n\n\"Father, if you collected money for Sehee's university, surely you collected my marriage funds as well?\"\n\n\"No.\"\n\n\"No? How come? I'm the eldest son! Why are you saving money for Sehee's marriage first? Why does a woman even need marriage funds? The cost of purchasing a home, the wedding, the honeymoon, all of that is paid by the groom!\"\n\nYoungwoo jumped up in agitation. Sehee grabbed his arm and pulled him back down.\n\n\"I won't go to university.\" Her voice was steady. \"I'll get a part-time job and help pay off the debt.\"\n\n\"What are you saying?\"\n\nUnlike Youngwoo, Sehee had good looks and intelligence. She'd never missed first rank since elementary school. The declaration that she'd give up her university education made their parents furious.\n\n\"You don't have to worry about this, so just live normally! You only have to study.\" Their father's fist slammed the table. \"By the time you graduate high school, I'll have paid back the debt and provide your university tuition. Don't say such things!\"\n\n\"Oh my, I'm so sorry toward Sehee.\" Their mother sobbed.\n\nA melodrama involving three family members unfolded. Youngwoo remained on the outside. Reality crashed down on him.\n\n*Right. My family is in crisis. This is my chance. Time to be the eldest son.*\n\nHe stood and shouted. \"I'll make money, so you don't have to worry! Father, there's no need to sell the store or house. Mother, you don't have to worry. It'll be okay. Sehee, like Father said, you just need to study.\"\n\n\"Sigh. I have to look for work tomorrow.\" His father didn't look at him.\n\n\"I'll go to the restaurant and do the dishes.\" His mother wiped her eyes.\n\n\"Father, Mother, I'll get a part-time job on weekends.\" Sehee's voice was quiet.\n\nNo one acknowledged him. Not even a glance. His family treated him like he was invisible. He was an incompetent son and brother who couldn't instill trust in anyone.\n\nYoungwoo calmed himself. He sat before his family, straightened his posture, and met each of their eyes in turn.\n\n\"I was going to tell you this.\" His voice was steady. \"Ten days ago, I quit the labor job.\"\n\n\"What?\" His father's head snapped up. \"You haven't been working?\"\n\nYoungwoo stared straight into his father's eyes.\n\n\"In the past ten days, I made over two hundred million won in the game.\" His hands clenched. \"In the future, I'll be the eldest son of this family! I'll be responsible for both of you and Sehee!\"\n\nFor the first time in his life, he felt genuine responsibility. A foreign car? Luxury clothes? He couldn't afford to think about such things. His first love, Ahyoung? No room remained in his head for unrequited love.\n\nUntil this crisis passed, he had to care for his family. He had to change his approach to Satisfy. More caution. More planning.\n\nNo more reckless gambling."
}