{
  "id": 620,
  "title": "Chapter 620",
  "content": "Kingship could be claimed in many ways—through blood, through conquest, through the will of the people. Yet no matter the path, not everyone could wear the crown. Kings were beings touched by heaven itself.\n\nChairman Lim Cheolho understood this. He'd designed every monarch in Satisfy to be exceptional. King Aslan and Great Demon Belial had shaped the entire game world through their clash. King Maxong could forge artifacts and commanded strength that defied mortal limits. Each ruler possessed undeniable presence.\n\nGrid had witnessed this truth firsthand.\n\n*The Evil Eyes' King will be special,* he concluded. *He's a king. He won't be like those other chuuni evil eyes.*\n\n\"Hah...\" \n\nGrid exhaled slowly as a minister led him forward. The evil eyes—a species that held absolute power over most players, save for legendary class users. How this meeting unfolded would determine the relationship between them and the Overgeared Kingdom. The weight of it pressed against his chest, tightening his muscles.\n\nBut he wouldn't back down.\n\n*I need to forge a strong bond with them.*\n\nHis footsteps echoed as he approached the great hall's entrance.\n\n\"A man who transcends mortal limits—Overgeared King Grid, whom even our evil eyes acknowledge—now enters.\"\n\nThe minister's announcement made Grid blink. The formal words sounded... servile. As though the minister served *him* rather than his own king.\n\n\"I understand we have you to thank for securing the insane dragon egg.\" A voice emerged from the darkness ahead. \"On behalf of all evil eyes, you have my gratitude.\"\n\n*Good start.*\n\nNo torches lit the chamber. The Evil Eyes' King sat upon his throne shrouded in shadow. Grid located him by sound alone and felt genuine appreciation for the courteous greeting.\n\n*Grateful. Respectful. Not dismissive despite me being human.* Relief warmed his chest. *A true king—nothing like those other evil eyes.*\n\nThe dignity resonating through that voice marked him as fundamentally different from his subjects. Grid wouldn't need to worry about chuuni antics here.\n\n\"I'm prepared to entrust the insane dragon egg to your people.\" Grid matched the king's respectful tone, offering as much deference as protocol demanded while speaking plainly. \"I don't want to squander this opportunity for partnership. I hope the evil eyes will become allies of the Overgeared Kingdom.\"\n\nSilence stretched between them before the king responded, his voice carrying an edge of surprise.\n\n\"Allies? Humans and demonkin?\" A pause. \"Is such a thing possible?\"\n\n\"Why wouldn't it be? Species doesn't matter. If we can help each other, isn't mutual reliance the logical choice?\"\n\n\"A rational argument.\" The king sounded thoughtful. \"But will your subjects share this view? Ordinary humans fear demonkin. Will they truly be willing to trade with us?\"\n\n\"Fear?\" Grid considered it. \"Well... my people are already fully adapted to Lauel, so it should work out.\"\n\n\"Lauel? I don't follow.\"\n\n\"The point is, my subjects won't be a problem.\"\n\n\"Hmm... Such determination. Remarkable.\"\n\n*Step. Step.*\n\nThe king rose, beginning his descent down the stairs. He moved slowly toward Grid, who stood alone at the hall's center.\n\n*What...?*\n\nAs the figure emerged from shadow, Grid's eyes widened.\n\n*Both eyes are covered?*\n\nEvery evil eye wore a covering over one eye to contain their power—Grid had expected nothing different from their king. Yet what he saw defied expectations. A thick cloth band wrapped completely over both the king's eyes.\n\n*How can he see anything?* Grid's mind raced. *Unless... Mind's Eye?*\n\nPerception without sight—seeing through pure awareness. Grid's throat bobbed as he swallowed.\n\n*His strength must rival Marie Rose.*\n\nAfter the progenitor's death, Marie Rose had become the paramount vampire. Grid had encountered her once. She'd been overwhelming—powerful enough to grind Grid and the entire Overgeared Guild into dust without effort. The Evil Eyes' King had to operate at that same tier.\n\n*Is he coming to test me?*\n\nTension coiled through Grid's muscles.\n\n*Thud.*\n\n\"...?\"\n\nOne step. Another. Then the Evil Eyes' King stumbled as he drew near. \n\nGrid stared, thrown off balance by the display. \"What's wrong?\"\n\n\"I cannot see.\"\n\n\"???\"\n\nGrid doubted his own ears.\n\n\"You... can't see?\"\n\nThe king's cheeks flushed crimson beneath the blindfold. He nodded at Grid's question.\n\n\"As you observed, I have both eyes sealed. Naturally, I cannot perceive my surroundings.\"\n\n\"...\"\n\nWhy blindfold yourself if you couldn't see or walk properly?\n\n*Is he some kind of pervert?*\n\nThe king's mouth twisted in a bitter smile, as if reading Grid's thoughts. An explanation followed.\n\n\"It is... uncomfortable. I possess the Legendary Evil Eyes—cursed eyes capable of annihilating the world itself. If I do not seal them, I will become a mass murderer whose name echoes through history...\" His voice dropped. \"This is my karmic burden. The responsibility I must shoulder.\"\n\n\"...Right.\"\n\nThe king wasn't different at all. An evil eye remained an evil eye. Grid had hoped the Evil Eyes' King might be reasonable. Instead, he felt betrayed. Yet he couldn't afford to show distaste—not when the evil eyes' friendship hung in the balance. He forced his limbs steady and pushed words through gritted teeth.\n\n\"That's... truly unfortunate. Born with such power that you must blind yourself?\"\n\n\"Precisely. A terrible curse.\" The king's voice carried genuine anguish. \"I have never seen my wife's face. My child's features remain unknown to me. My evil eyes would bring only destruction to them...\" A hollow laugh. \"You likely don't believe this, but I have kept this band tied since the moment of my birth. I have *never* removed it.\"\n\n*Wait.*\n\nLightning crackled through Grid's mind. A realization struck—one only possible because of his extensive experience manipulating NPCs. He coughed to mask the grin threatening to split his face.\n\n\"How tragic.\" He kept his tone carefully neutral. \"Then you've never seen anyone's face at all?\"\n\n\"No one. Not my family. Not my subjects.\" The king's voice roughened. \"I feel utterly alone in this world. The loneliness rots me from within, decay spreading through heart and soul alike.\"\n\nGrid's mouth curved upward in a sly, predatory smile. But he didn't let the king—couldn't let the king—see it. He waited, letting silence stretch before speaking with deliberate calm.\n\n\"Why not become friends with me?\"\n\n\"...Pardon?\"\n\nThe king sounded genuinely confused. A stranger met for the first time wanted friendship. More absurd still—a *human* stranger!\n\n\"Are you pitying me?\"\n\n\"No offense intended.\" Grid's voice remained level. \"I simply wanted to give you the pleasure of seeing someone. Of truly talking to another person.\"\n\n\"The pleasure of seeing—? You!\" Anger sharpened the king's words. \"Have you heard nothing I've said? I possess the Legendary Evil Eyes! A cursed existence that annihilates everything caught in my gaze! I will *never* remove this seal!\"\n\n\"Then remove it.\"\n\n\"*You—!*\"\n\nWas this human insane? Such disrespect was intolerable.\n\n*Does he think I'm bluffing?*\n\nEvil eyes were demonkin. While they didn't revel in needless slaughter like common demons, their nature remained. And ultimately—\n\n\"How dare you provoke me...! I am *King!*\" The words thundered through the hall. \"Even if you secured the insane dragon egg—even if you are a benefactor—I cannot tolerate such disrespect!\"\n\nThe king tore the band from his eyes.\n\nThe instant his red left eye and white right eye became visible—\n\n*KRAAAKOOOOOM!*\n\nThe great hall *shook*. Countless system notifications exploded across Grid's vision.\n\n[You have been captured in the sight of the cursed Third Evil Eye!]\n\n[All your actions are predicted!]\n\n[You have fallen into 'Burned by Hellfire' status.]\n\n[You have fallen into 'Hell Freezing' status.]  \n\n[You have fallen into 'Absolute Fear' status!]\n\n[You have resisted.]\n\n[Reflection has failed.]\n\n*CRACKLE! SHATTER!*\n\n*BOOM! CRASH!*\n\nBrilliant, devastating light erupted from the Evil Eyes' King. Everything in his field of vision froze solid, burst into flame, and crumbled simultaneously. The massive hall collapsed into ruin within seconds.\n\nYet—\n\n\"...You're unharmed?\"\n\nAmid the devastated chamber, Grid stood before the king. Not burned. Not frozen. He simply gazed at the Evil Eyes' King with calm composure.\n\nThe king couldn't process it.\n\n\"Someone who withstands my Third Evil Eye...?\"\n\nAn old tale surfaced in his memory. A human who'd survived Hell Gao's hellfire unscathed. Sword Saint Muller.\n\n\"A legend...\"\n\n*Brrr.*\n\nThe eyes that saw the world for the first time trembled. They swept slowly across Grid's face, drinking in details.\n\n\"Do I... do we look similar to you?\"\n\nThe king's voice shook with emotion. Grid replied without hesitation.\n\n\"No. You look much better.\"\n\nA complete lie! But Grid understood. Simple words could bring immense joy. He believed his past self would have found courage if someone had spoken warmly to him.\n\n\"...I see.\"\n\nMoisture gathered in the king's eyes. Tears disappeared as quickly as they formed. The king covered his eyes once more, then extended his hand toward Grid.\n\n\"My evil eyes will become steadfast allies of the Overgeared Kingdom.\"\n\n\"Thank you.\" Grid clasped the offered hand. \"You won't regret this.\"\n\n[The Overgeared Kingdom and the 'Evil Eyes' species have formed an alliance.]\n\nThat day, a powerful demonkin race—still unknown to most players—became allies of the Overgeared Kingdom.\n\nThe Overgeared Kingdom had grown significantly stronger."
}