{
  "id": 621,
  "title": "Chapter 621",
  "content": "# Chapter: Alliance and Advancement\n\nThe alliance treaty Grid negotiated during his stay in the Evil Eyes' village was surprisingly straightforward. The Overgeared Kingdom and the Evil Eyes would maintain mutual respect and peaceful relations. They would prosper together through resource exchange—the kingdom providing military support when needed, the Evil Eyes lending their considerable strength in return. Most importantly, Grid and the Evil Eyes' King would meet regularly to maintain their friendship.\n\nSimple terms for what Grid hoped would become a powerful partnership.\n\n\"I enjoyed these past two days immensely,\" the Evil Eyes' King said.\n\nFor the first time since his birth, he'd been able to look directly at another person without causing harm. What others took for granted had been a revelation—a gift beyond measure. Grid was special. In his presence, the curse of blindness lifted.\n\nGrid felt a pang of sympathy. \"I'll try to make artifacts that can suppress your third eye's power. You should see your family's faces at least once before you die.\"\n\n\"Your words mean more than you know, but...\" The king shook his head gently. \"It's probably impossible.\"\n\nHe'd learned long ago not to hope. Disappointment hurt less when you expected nothing.\n\nBut Grid had every intention of fulfilling that promise, though not entirely from altruism. During their conversations, he'd learned the king possessed the ability to implant evil eyes in others. If Grid could maximize their affinity, perhaps he could acquire that power for himself. A worthy goal—one that would benefit them both if he succeeded.\n\n\"I'll head back now,\" Grid said. \"The fifty protection cloaks will arrive every month as agreed.\"\n\n\"Safe travels.\"\n\nThe Evil Eyes took pride in their innate strength. Their bodies were weapons; they needed no equipment. But they were also chuuni—dramatic souls who appreciated aesthetic flair. They *wanted* those cloaks. Grid planned to craft Mass Produced Lantier's Cloaks, combining style with substantial defensive capabilities.\n\n*The more gear I can mass produce, the better.*\n\nHe envisioned a future where every Overgeared soldier and citizen wore his equipment—Grid Sets paired with Lantier's Cloaks. Not a fantasy, but an achievable goal within a few years. The mountains of insane dragon iron in his inventory would make that reality possible.\n\n***\n\nRumors spread like wildfire across the continent.\n\n\"Did you hear? The Overgeared Kingdom's revamped their quest rewards.\"\n\n\"Really? I thought the quests were already pretty good.\"\n\n\"This is different. Players above level 180 can earn items *Grid himself crafted* as rewards.\"\n\n\"Wait—items Grid made? Seriously?\"\n\n\"Set items, even. Complete three quests, get one piece.\"\n\n\"Holy shit... actual Grid Set items?\"\n\nGrid the Legendary Blacksmith. Nearly every player in Satisfy dreamed of owning his work, but supply had never met demand. His items had become priceless rarities—couldn't be bought at any price.\n\nNow, supposedly, they could be earned through quests.\n\nThis was Lauel's masterstroke. He'd invested heavily in information brokers, deliberately leaking news of the reward restructuring across the continent. A massive PR campaign designed to lure players to the Overgeared Kingdom.\n\nThe results exceeded all expectations.\n\n\"Why wouldn't I move to Overgeared?\"\n\n\"Lower taxes *and* Grid's items? No-brainer.\"\n\n\"This is my shot at his gear. I'm going.\"\n\nPlayers worldwide made their decisions, willing to endure short-term losses for long-term gains. The fifteen kingdoms panicked.\n\n\"We need loyalty requirements! Players can't just leave freely!\"\n\n\"Immigration must be *earned* through service and contribution!\"\n\nThe kingdoms implemented brutal immigration quests—challenges nearly impossible for anyone below high level with exceptional specs. The player base exploded with outrage. Complaints flooded forums and the S.A. Group's customer service channels.\n\n*—NPCs restricting player freedom? How is that acceptable?*\n\n*—Isn't Satisfy supposed to have high freedom? We're not NPC puppets.*\n\nPlayers demanded S.A. intervene and overrule the NPCs.\n\nThey were ignored.\n\nThe S.A. Group viewed Satisfy's NPCs as genuine residents of another world, deserving the same respect as real humans. They refused to interfere, preferring to let Satisfy's evolution unfold naturally.\n\nWhile most players raged at this non-response, a minority understood: operator intervention would shatter immersion. S.A. wanted players to experience Satisfy as a real world, not just a game. Many already did. That perception existed *because* of S.A.'s hands-off policy. Heavy-handed interference would destroy what made Satisfy special.\n\nEventually, players accepted reality. Complete the grueling multi-week immigration quest, or stay put. Unsurprisingly, most chose to stay.\n\nWho cares about Grid Sets when the quest was borderline impossible? Average players couldn't afford two-plus weeks of grinding with a high failure rate. Better to cut their losses and remain where they were.\n\nThis benefited the Overgeared Kingdom immensely.\n\nPlayers who *did* complete the immigration quest were enthusiastic, capable individuals—far above average. The fifteen kingdoms had inadvertently created a talent filter, weeding out casual players and sending only the dedicated and skilled to Overgeared.\n\nThe kingdom's overall strength increased dramatically as a result.\n\n***\n\n\"Incredible.\"\n\nWhat had happened during his absence? Grid stood in Reinhardt, reviewing the kingdom's statistics with genuine amazement. The player population approached 100,000—a massive jump from before.\n\nLauel covered half his face with one hand, shoulders shaking with barely contained laughter. \"This is the result of strategically leaking information about the quest reward changes as a promotional tool. Huhut... my genius combined with Your Majesty's greatness has created this magnificent tide... Enough to shake the world to its foundations. Kukukuk...\"\n\n\"Outstanding work. You've really outdone yourself, Lauel.\"\n\n\"...?\"\n\nLauel blinked in surprise. Normally Grid reacted to his theatrical speeches with embarrassment, asking him to tone it down. But after two weeks apart, Grid seemed... different. He'd accepted Lauel's dramatics without batting an eye, responding as if it were perfectly normal.\n\nLauel misunderstood entirely.\n\n*'His Majesty finally understands.'*\n\nHe'd realized Lauel's manner of speaking was actually *cool*?\n\n\"Huhuhut...\"\n\nLauel practically glowed with validation. As he basked in the moment, unfamiliar figures approached—beings with 3D chibi-like proportions, plump bodies combined with fierce eyes.\n\n*The Evil Eyes.*\n\nAll seventeen of them greeted Lauel in unison.\n\n\"Kukukuk... It's you. It truly is you.\"\n\n\"The human who shared past lives with us.\"\n\n\"You must have walked a lonely path, reincarnating alone as a human. How difficult it must have been.\"\n\n\"But worry no longer. We magnificent Evil Eyes shall be your companions now.\"\n\n\"Kukukuk... after cycling through multiple incarnations, we are reunited... The pull of our shared fate is undeniable. Truly magnificent.\"\n\n\"The stars burn brighter tonight. Shall we drink from the deep lake to toast our reunion?\"\n\n\"...Unbelievable.\"\n\nLauel pressed a hand to his chest, stunned by their words.\n\n*Thump-thump. Thump-thump.*\n\nHis heart raced several times faster than normal.\n\n*'My past lives were real.'*\n\nSometimes—often, if he was honest—he'd worried. Wondered if he was just insane, trapped in elaborate delusions. But here was proof. These beings validated everything. His memories of being a hero, a god, a villain—all true. All *real*.\n\n\"Fate...\"\n\n\"...Destiny.\"\n\nLauel and the Evil Eyes stared at each other with profound trust and affection.\n\n***\n\n\"Summon all blacksmiths with Advanced rank or higher to Reinhardt.\"\n\nThe royal decree spread throughout the Overgeared Kingdom. Lords immediately began searching their territories for qualified smiths. The results shocked Grid: eight additional Advanced blacksmiths beyond the twelve he and Khan had personally trained in Reidan.\n\n*'Is it normal to have this many Advanced blacksmiths?'*\n\nAdvanced smiths were precious talents coveted by kingdoms everywhere. Their skills made them invaluable. Grid and Khan had only managed to train so many in Reidan through intensive personal instruction—it was extremely rare for Advanced blacksmiths to develop naturally.\n\nOutside the Empire, ordinary kingdoms typically had fewer than ten. Yet Reinhardt contributed five more. Combined with Reidan's twelve, that made twenty-five total.\n\n\"...\"\n\nThe assembled blacksmiths gulped nervously as they gazed up at Grid in the palace hall. He was their king, a Legendary Blacksmith—their ultimate role model made flesh.\n\n*'Besides the ones Khan and I trained, there are thirteen Advanced blacksmiths... Was the former Eternal Kingdom specialized in smithing?'*\n\nAs Grid puzzled over this, a young blacksmith stepped forward and bowed low.\n\n\"Speak.\"\n\n\"Your Majesty, forgive my presumption—do you remember a village called Rolling?\"\n\n\"Rolling?\"\n\nGrid had visited countless villages over the years. Unless something significant had occurred, the names blurred together. The blacksmith—Rector—elaborated.\n\n\"A small village near the Vatican.\"\n\n\"Ah, right.\"\n\nThe memory surfaced. A mountain village cluttered with Rebecca statues. Where he'd met that cleric he'd turned into a healing shuttle. Where his path had crossed with Marie Rose.\n\n\"I'm a blacksmith from Rolling. The reason I achieved Advanced rank is... because of you, Your Majesty.\"\n\n\"My help?\"\n\n\"Yes. I was a Beginner smith back then, barely keeping my father's forge running after he died. You were just an adventurer when you visited my smithy, but you gave me profound guidance.\"\n\n\"...Huh?\"\n\nWhen had he—?\n\n\"Your teachings sparked enlightenment. I practiced diligently, following everything you showed me, and eventually reached Advanced rank. I've always wanted to thank you properly. I'm honored to have this chance. Truly—I owe you everything I've become.\"\n\n\"...\"\n\n\"These three beside me are my students. They all followed your teachings and achieved Advanced rank as well.\"\n\n\"...\"\n\nGrid stood speechless, searching his memories for details he'd long forgotten.\n\n*'I stopped at Rolling's smithy for repairs.'*\n\nRight. The owner had been a Beginner smith who hadn't recognized a Legendary Blacksmith standing in his forge.\n\n*'That person became an Advanced blacksmith?'*\n\nThe Overgeared Kingdom. *He* was the reason so many Advanced blacksmiths existed in the former Eternal Kingdom. All because of a casual visit years ago, a few offhand comments he'd barely remembered making.\n\nA smile spread across Grid's face."
}