{
  "id": 622,
  "title": "Chapter 622",
  "content": "**\"Incredible.\"**\n\nGrid had personally selected and trained a hundred blacksmiths. Experience had taught him that advanced blacksmiths weren't easily produced, no matter how much effort he and Khan invested. Yet Rector had broken through that barrier with just a few words of advice—if you could even call it that—and elevated himself to advanced rank. His talent might even surpass the blacksmiths Grid had discovered in Reidan.\n\n*Could he be...?*\n\nGrid's pulse quickened. Rector might possess the same talent as Khan—the makings of a Blacksmith Craftsman. A genius. The thought filled him with anticipation as he withdrew the Great Lord's Sword. He'd need to complete the king's exclusive quest before upgrading it to the King's Sword, but his schedule was packed.\n\n*Character Observation.*\n\n**Name:** Rector  \n**Age:** 28 **Gender:** Male  \n**Occupation:** Blacksmith  \n**Level:** 237  \n**Strength:** 250/600 **Stamina:** 899/1,300  \n**Agility:** 50/88 **Intelligence:** 420/420  \n**Skills:** Advanced Blacksmith's Craftsmanship Lv. 2, Gain Abilities like a Sponge (S+), Tenacity that Never Gives Up (S+), Teaching by Rote (S+).\n\n*A blacksmith born in Rolling.*  \n*He is good at learning, has a strong commitment, and fast growth. The ability to instill his studies into others is also excellent. However, all these talents are limited to blacksmithing.*\n\n\"Oh.\"\n\nGrid couldn't suppress his exclamation.\n\n*I need to send him to Reidan.*\n\nWhether he had craftsman-level potential remained uncertain, but Rector was already a treasure of the Overgeared Kingdom. If Grid assigned him to train the hundred blacksmiths in Reidan, they could secure a large pool of advanced blacksmiths far more quickly.\n\n*And Rector reached advanced rank because of me.*\n\nThe affinity between them would be high—very high.\n\n*I can use Blacksmith's Affection.*\n\n**[Blacksmith's Affection]**\n\n*If you have the maximum affinity with a NPC blacksmith, you can raise their skill level by 1~5 levels.*\n\n*The blacksmith who received your teachings will be loyal to you for life and will share with you every time they learn new item production methods.*\n\nHe'd acquired the skill back when he'd rescued Smith during the attack on Bairan. That same skill had allowed Khan to become a Blacksmith Craftsman and elevated Smith to advanced rank.\n\n\"Rector, do you like me?\"\n\n\"Huh...?\"\n\nRector tensed. King Grid was watching him with an intensity that bordered on hunger. And now he was asking if Rector *liked* him? His imagination spiraled in unfortunate directions.\n\n*I-Is he... is he talking about...*\n\nRector's face drained of color. A nervous murmur rippled through the assembled blacksmiths.\n\nThen—\n\n\"I really like you!\"\n\nAn elderly blacksmith shot to his feet, voice ringing through the hall. Smith—the Bairan blacksmith who'd taught Grid the jaffa arrow production method and received his blessing in return.\n\n*The gay old man.*\n\nHow had things derailed so spectacularly? Grid's confusion cleared the moment he saw Smith's enthusiastic expression. He'd nearly been branded as... No. Grid pointedly ignored Smith and rose from his throne. He approached the trembling Rector and placed a hand on his head.\n\n\"Heok.\"\n\nRector sucked in a breath, bracing for harassment.\n\nBut the other blacksmiths realized their mistake immediately. There was nothing improper in Grid's bearing as his hand rested on Rector's head. If anything, he looked sacred. Sunlight streamed through the windows, illuminating the legendary blacksmith as he touched the head of his student. Like a Pope anointing a follower. To the blacksmiths—who held an instinctive reverence for legendary craftsmen—the scene was divine.\n\n\"Rector.\"\n\n\"Y-Yes... Yes, Your Majesty.\"\n\nThe Holy Light Crown gleamed. The Great Lord's Sword radiated authority. Grid's high Dignity stat amplified everything, creating a presence that commanded absolute attention. Every blacksmith held their breath.\n\n\"I bestow my affection upon you.\"\n\n*Paaaat!*\n\nGolden light blazed from Grid's palm, brighter and warmer than the sun itself.\n\n\"Ahh...\"\n\nRector trembled, enveloped in radiance. He couldn't articulate it, but instinct told him he'd received something extraordinary. The watching blacksmiths felt it too—every one of them shaking as they witnessed the power of Blacksmith's Affection.\n\nWords failed them.\n\n[*Due to the effect of the Blacksmith's Affection skill, Rector's blacksmithing skill level has risen by 5!*]\n\nJoy flooded Grid at the notification. The day he became deified in the eyes of blacksmiths.\n\n*If you receive Grid's blessing, your blacksmithing skills will greatly increase.*\n\nThe story spread beyond the Overgeared Kingdom to every corner of the continent. Blacksmiths everywhere grew more respectful toward Grid, dreaming of the day they might meet him. When people spoke of legendary blacksmiths now, Grid's name came to their lips before Pagma's.\n\n***\n\n**[Insane Dragon Iron]**\n\n*A mineral that naturally occurs in the nest of the insane dragon Nevartan.*\n\n*It has been influenced by Nevartan's madness for countless years and gained the chaotic ability 'Proliferation.'*\n\n*It doubles every 10 days.*\n\n*This absurd nature makes it very difficult to control. The hardness is comparable to black iron, but the smelting difficulty is several times higher.*\n\n**Weight:** 5\n\n**[Insane Dragon Stone]**\n\n*A mineral that naturally occurs in the nest of the insane dragon Nevartan.*\n\n*It has been influenced by Nevartan's madness for countless years and gained the chaotic ability 'Suppression.'*\n\n*The hardness is very low, but when mixed with other minerals, it has the function of eliminating the characteristic of those minerals.*\n\n**Weight:** 1\n\n**[Insane Dragon Bead]**\n\n*A mineral that naturally occurs in the nest of the insane dragon Nevartan.*\n\n*It has been influenced by Nevartan's madness for countless years and gained the chaotic ability 'Rampage.'*\n\n*When mixed with other minerals, it multiplies the mineral's characteristic.*\n\n*If a human touches this mineral, they would lose their sense of reason and can't smelt it. Use with caution.*\n\n**Weight:** 300\n\nReinhardt Palace housed a personal smithy for Grid—natural, given his status as king. Grid brought the advanced blacksmiths there and produced three types of insane dragon materials. First, the insane dragon bead. A circular green mineral the size of a soccer ball, but deceptively heavy despite its appearance.\n\n\"Khan, can you touch this once?\"\n\nThe bead caused the 'rampage' effect. Grid's resistances kept him safe, but the advanced blacksmiths would be in serious danger if they made contact. However, Khan was a Blacksmith Craftsman.\n\nGrid held his breath in anticipation. Perhaps craftsman-level blacksmiths could overcome the mineral's curse. The result...\n\n\"Well, it's certainly heavy. Smelting this will take considerable time and skill.\"\n\nJust as Grid expected, the insane dragon bead's curse had no effect on Khan. Grid smiled.\n\n*That's reassuring.*\n\nKhan was his first friend in this world. Grid had always relied on him. His affection for the old man deepened as he turned to explain to the other blacksmiths.\n\n\"These three minerals were obtained from the nest of the insane dragon Nevartan.\"\n\n\"...!\"\n\nThe blacksmiths stirred. *Dragon lair.* Natural, given that such materials came from a dragon's domain. Grid pressed on.\n\n\"The insane dragon iron multiplies infinitely—whether as raw ore or after being forged into an item.\"\n\n\"Huh...?\"\n\nShocked murmurs rippled through the group. A mineral that multiplied without end? Wasn't that a dream material?\n\nGrid grinned.\n\n\"Credit goes to my subordinate's achievement. But that proliferation isn't always beneficial. Tools made from insane dragon iron become unusable as their weight constantly increases. That's where the insane dragon stone comes in.\"\n\nHis explanation continued, detailing each mineral's properties and their interplay. When he finished, he assigned them their task: master the production of the Grid set using these materials.\n\n\"Starting today, you'll undergo specialized training until you can craft the Grid set. It might take days. It might take weeks.\"\n\n\"We'll work tirelessly to meet your expectations!\"\n\n\"There's no greater honor than receiving direct instruction from Your Majesty! Even if it takes months or years, we'll learn!\"\n\n\"Good.\"\n\nFrom that day forward, the sound of hammering never ceased in Reinhardt's smithy. The blacksmiths gathered under Grid devoted themselves to learning, never losing their enthusiasm until they'd mastered the Grid set. Through the process, their admiration and loyalty toward Grid deepened. The king himself had given them expert instruction. How could they not feel grateful?\n\nTwo weeks later.\n\n\"Blacksmith's Affection.\"\n\nAll twenty-two remaining advanced blacksmiths received Grid's blessing—everyone except Khan, Smith, and Rector, who'd already been graced. They grew significantly, fully mastering the Grid set production method.\n\n\"All of you will become pillars of the Overgeared Kingdom. Don't forget this, and dedicate yourselves to your roles.\"\n\n\"As you command!\"\n\nAs a kingdom founded by a blacksmith, the Overgeared Kingdom's smiths were becoming the finest on the West Continent. Grid and his blacksmiths wouldn't stop until every citizen was properly equipped.\n\n*Of course, I can't fall behind in the process.*\n\nGrid's survivability had increased exponentially after obtaining the First King title. Combined with the infinite stiffness combos from the God Hands and Mjolnir, he could function as a perfect tank. But his damage output was relatively weaker. He needed to increase his offensive power.\n\n*I don't have enough attack unless God's Command gives me the boost...*\n\nRelying on luck to activate God's Command was exhausting.\n\n*I'll forge a weapon for myself.*\n\nGrid made his decision and withdrew Belial's bones and leather—the only materials remaining after crafting items for his meritorious retainers.\n\n\"And these.\"\n\nGrid smiled with satisfaction as he examined the seven insane dragon beads obtained from Nevartan's nest.\n\n*It multiplies a mineral's unique characteristics?*\n\nWhat if the demonic energy in Belial's materials became twice as potent?\n\n\"Kukuku... This time, I'm making a demonic sword.\"\n\nIt would be nice to craft a new crown to match the dark aesthetic of his weapon. Now that he could wear both a crown and helmet simultaneously, the crown's performance mattered.\n\n*I'll display power that surpasses even the great demons themselves.*\n\nEveryone would look up to the Overgeared King in awe."
}