{
  "id": 628,
  "title": "Chapter 628",
  "content": "\"Your Majesty!\" Fatima clutched at Grid's sleeve, eyes brimming with tears. \"To think you would come yourself to save me! You care for even the lowest of your subjects—truly, you are the very model of kingship!\"\n\n\"Uh... well...\"\n\n\"I swear on my family name, we Fatimas will serve the crown for generations! I would strip naked and walk the streets if you commanded it!\"\n\n\"That won't be—\"\n\nGrid scratched his cheek, deeply uncomfortable. The truth was, he'd stumbled onto Fatima purely by accident. Who could have guessed Earl Bruno had been hiding the tailor in his mansion?\n\n*Earl Bruno.* Grid's jaw tightened. Of all people, Duke Steim's most trusted aide had been leading the rebellion...\n\nHis father-in-law stood nearby, head bowed like a condemned man. Grid exhaled slowly and rested a hand on the duke's shoulder.\n\n\"Father-in-law, you're the one suffering most from this. Don't punish yourself on my account. Your people need you—go restore order.\"\n\nDuke Steim's knuckles whitened as his hands clenched. \"...You have my word. Nothing like this will happen again. I'll make certain of it.\"\n\nThe duke departed with his soldiers, urgency in every step. Grid watched him go, understanding the crisis at hand. Word would spread quickly—the Overgeared King had personally executed the leader of the Anti Grid Alliance. Frontier would teeter on the edge of chaos unless Duke Steim moved fast to restore confidence.\n\n\"Fatima.\"\n\n\"Yes, Your Majesty?\" The tailor straightened despite his injuries—bruises darkening his arms, a split lip still bleeding sluggishly.\n\n*Same story, different kingdom.* Grid's past weighed on him as he reached into his inventory. After a moment's hesitation, he produced a potion. \"Here. Drink this first. Then I need you to teach me your method for crafting underwear.\"\n\n\"Your Majesty would grant me a potion?!\" Fatima's hands trembled as he accepted the vial.\n\nGrid winced internally. It was barely worth mentioning—a low-grade potion for level 50 beginners, practically worthless. But to an NPC like Fatima...\n\n\"I shall preserve this as a family treasure!\" Fatima pressed the vial to his chest.\n\n\"...\"\n\nGrid's eye twitched. *This bastard is trying to steal my potion bottle.*\n\nBefore Fatima could pocket the vial, Grid moved. He thrust another potion forward with barely concealed frustration. \"It's not heirloom quality. Drink it. Now. Then show me the production method.\"\n\n\"At once, Your Majesty!\"\n\n\"Tailor Fatima.\" One of the knights stepped forward, hand on his sword hilt. \"His Majesty gave you an order.\"\n\nAll twenty-eight knights—formerly Earl Bruno's men—fixed Fatima with cold stares. The tailor's hands shook as he uncorked the vial and drank.\n\nGrid smiled warmly at the knights. *Strong. Very strong.*\n\nA quick assessment with the Great Lord's Sword had revealed their capabilities. Twenty-eight knights, all hovering around level 250. Their skills lagged behind the eight prodigies trained by Piaro and Asmophel, but that gap could be closed.\n\n*I'll have the eight lead the twenty-eight. Good practice for them, easier on me.* An investment in the Overgeared Kingdom's future, Grid told himself. Definitely not laziness.\n\n***\n\n*So this is a tailor's workshop.*\n\nGrid surveyed Fatima's studio with genuine interest. The space felt utterly foreign compared to a smithy—quiet where a forge was cacophonous, cool where flames roared, leather-scented instead of iron-tinged. Fabric and tools lay in neat arrangements. Everything spoke of precision, patience, concentration.\n\n*Well, concentration I've got.*\n\nOther production class users had an auto-craft button. Lucky bastards. Grid had to manually create every single item, piece by agonizing piece. If that didn't forge diamond-hard focus, nothing would. He was a god. A god of labor. An overworked, underpaid god of labor.\n\n*Let's get this over with.*\n\nFrontier's environmental conditions had forced local tailors to develop specialized underwear techniques. The learning curve would be steep, but Grid possessed nearly 3,500 dexterity and the tenacity of a cockroach. He'd master this quickly enough.\n\nFatima wrung his hands, watching Grid with obvious concern. *His Majesty is a legendary blacksmith—his pride must be immense. He thinks this will be easy.*\n\nThe tailor knew better. Tailoring demanded just as much skill as blacksmithing, and the intermediate underwear method required both high dexterity and proper tailoring knowledge. *I don't want to see my king's heart break when he fails.*\n\nThe thought pained him so deeply that Grid noticed.\n\n\"Why aren't you teaching me?\"\n\n\"...Your Majesty, please steel yourself.\"\n\nFatima could delay no longer. With the air of a man handing over funeral rites, he produced the method he'd invented.\n\n> [Fatima has handed over the **Intermediate Underwear Production Method**!]\n>\n> [Since you have created thousands of battle gear pieces, the difficulty of the **Intermediate Underwear Production Method** isn't particularly high. You have understood it easily.]\n>\n> [2,000 **Dexterity** is required to acquire the **Intermediate Underwear Production Method**. Your current **Dexterity** is **3,487**.]\n>\n> [The **Intermediate Underwear Production Method** has been acquired.]\n>\n> [The **Collection of New Production Methods (1)** quest has been completed!]\n>\n> [You have gained **two levels** from the quest reward.]\n>\n> [Due to the effect of the **Legendary Great Magician** second class and the **First King** title, a total of **28 stat points** are obtained!]\n>\n> [**12 points** have been forcibly invested into **Intelligence** due to the influence of the second class, **Legendary Great Magician**.]\n>\n> [**Collection of New Production Methods (1)** will be linked to the **Collection of New Production Methods (2)** quest!]\n>\n> [**Collection of New Production Methods (2)**]\n>\n> **Class Quest**\n>\n> You have finally learned to create underwear. However, you've realized you need advanced tailoring skills to produce underwear properly. Acquire tailoring skills to utilize the **Underwear Production Method**.\n>\n> **Quest Clear Reward:** Level +2. The **Tailoring Technique** will be acquired. A linked quest will follow.\n>\n> [You have fully understood the **Intermediate Underwear Production Method** and naturally acquired **Intermediate Tailoring Technique Lv. 8**!]\n>\n> [The **Collection of New Production Methods (2)** quest has been completed!]\n>\n> [You have gained **two levels** from the quest reward.]\n>\n> [Due to the effect of the **Legendary Great Magician** second class and the **First King** title, a total of **28 stat points** are obtained!]\n>\n> [**12 points** have been forcibly invested into **Intelligence** due to the influence of the second class, **Legendary Great Magician**.]\n>\n> [**Collection of New Production Methods (2)** will be linked to the **Tailoring Technique Training** quest!]\n>\n> [**Tailoring Technique Training**]\n>\n> **Class Quest**\n>\n> Your possibilities for development have expanded greatly after learning the **Tailoring Technique**.\n>\n> If you reach the point where you can combine blacksmithing and tailoring, your foundation as a blacksmith will expand exponentially.\n>\n> However, your current tailoring skill remains too rudimentary.\n>\n> The gap between intermediate tailoring and legendary blacksmithing is vast. The intermediate tailoring technique will likely degrade the quality of your legendary blacksmith's work.\n>\n> Raise your tailoring skill to the point where it can be combined with blacksmithing.\n>\n> **Quest Clear Conditions:** Master the **Advanced Tailoring Technique**.\n>\n> **Quest Clear Reward:** Level +6. The opening of **Craftsman Level Tailoring Technique**.\n\n\"Ah, shit.\"\n\nHe'd accidentally crushed a rebel conspiracy, effortlessly learned the underwear method, and auto-completed the follow-up quest. His luck was too absurd.\n\n*Does it make sense to demand a blacksmith master tailoring? Are they insane?*\n\nHow many cloth garments would he need to produce to reach mastery? Hundreds? Thousands? The number was astronomical. This class quest wasn't just demanding labor—it was demanding *inhuman* labor.\n\n*When will this nightmare end?*\n\n\"%$@#!!\"\n\nGrid unleashed a string of profanity. Beside him, Fatima gaped like a fish. Every other tailor in Frontier had failed to learn underwear production despite years of effort. This blacksmith had mastered it in seconds.\n\n*This is the skill of true legend! He's no different from a god!*\n\nAnother Grid believer was born.\n\n***\n\n\"Hao! It's such an honor to meet you!\"\n\n\"Could we possibly get your autograph?\"\n\nThe Youngwoo Building's first-floor cafe buzzed with excitement. The employees swarmed around Hao with the enthusiasm usually reserved for movie stars. Such was the reality for high rankers in Satisfy—achievements in the game translated to celebrity status in the real world. Even Vantner drew crowds when he ventured downtown. Though admittedly, Vantner's fans skewed heavily male.\n\n\"Sweet potato latte.\"\n\nHao didn't bother with false courtesy. No practiced smiles, no calculated charm—he simply existed as himself, and somehow that authenticity only intensified his appeal. The employees practically swooned as they took his order, his broken Korean endearing rather than awkward.\n\n\"Oh, how interesting!\"\n\n\"Wait, isn't that what Grid orders every morning?\"\n\n\"Do all rankers love sweet potato lattes?\"\n\n\"...!!\"\n\nHao's head snapped up, pupils dilating. \"Grid drinks sweet potato latte? Every day?\"\n\n\"Oh yes, he's devoted to them. Rain or shine, Grid always orders sweet potato lattes.\"\n\n\"We've never seen him touch coffee. Maybe he doesn't like it?\"\n\n\"Isn't that adorable? Hehe.\"\n\n\"...\"\n\nThe employees dissolved into gossip, work forgotten. Hao studied them with the intensity of a scholar deciphering ancient texts.\n\n\"Two sweet potato lattes.\" He paused. \"No. Three.\"\n\nHao was hailed as a miracle in China—a genius among 1.4 billion people. He'd considered himself peak humanity once. Then he'd met Grid and Kraugel, and that comfortable delusion had shattered. Now he understood his position: beneath them both, but climbing.\n\nHe dreamed of standing shoulder to shoulder with those two. And if drinking sweet potato lattes was part of Grid's routine...\n\n*I'll drink sweet potato lattes every morning from now on. This must be the secret to Grid's focus.*\n\nHao felt vindicated in his decision to visit South Korea. Every detail mattered in the pursuit of greatness—even beverages."
}