{
  "id": 629,
  "title": "Chapter 629",
  "content": "**Seven ranks in a single day.**\n\nThe forums were ablaze with speculation. Grid's level had stagnated for weeks after founding his kingdom, and now—overnight—he'd jumped four levels and climbed the rankings like a man possessed.\n\n*SSS-difficulty quest cleared. Has to be.*\n\n*Four levels? For an SSS quest? That's it?*\n\n*Ordinary players will never even SEE an SSS quest. And Grid just knocked one out before breakfast.*\n\nOnce again, Grid had set the community on fire. But the man himself was less than thrilled as he stared at his status window.\n\n\"I have to finish these quests,\" he muttered, rubbing his temples. \"That's when the class unlocks its true potential.\"\n\nThe problem? He couldn't see the end. His class quests kept extending, branching into new requirements like some sadistic skill tree from hell. Mastering Advanced Tailoring Technique was just *one step* in the chain.\n\n*How long will it take to master tailoring? Months? Years?* He clenched his jaw. *When the hell will this class quest actually finish?*\n\nWhy did a legendary blacksmith need to learn how to sew?\n\n*I know, I know—versatility is good long-term.* Grid tried to console himself. *But it's been YEARS since I became Pagma's Descendant, and I still haven't unlocked the full class.*\n\nThe frustration gnawed at him. Every other legendary class holder seemed to have clarity—a defined path. Meanwhile, he was drowning in prerequisites.\n\n\"Whatever.\" He exhaled slowly. \"The tailoring skill will rise if I keep making underwear for the guild members and soldiers.\"\n\nA kingdom *armed with items*—that was the vision. Grid forced his irritation down and logged out.\n\n***\n\n\"You worked hard today.\"\n\nYoungwoo opened his eyes to find Sehee's face hovering over the capsule, a bottle of water extended toward him. He'd just spent twelve hours managing the Overgeared Kingdom, and his brain felt like mush.\n\n\"Thanks.\" He smiled despite his exhaustion. His sister really was the best—her gentle face and kind heart always settled his nerves.\n\n\"Gulp, gulp. Puh—BLAAAAGH!\"\n\nWater sprayed from his nose and mouth as carbonation hit his throat like a chemical weapon. He'd thought it was regular water. It was *not* regular water.\n\n\"Khak—! This is *disgusting*!\" Tears streamed down his face.\n\nSehee folded her arms, expression grim. \"Weren't you about to drink soda anyway? Have some carbonated water first. Better for you than Coke.\"\n\n\"Y-You demon...\"\n\nFive-year-olds drank carbonated water these days. Humanity had moved on. But Youngwoo aged backward at his own pace—a man out of time. He still wasn't used to the stuff.\n\nGrumbling, he stumbled toward the bathroom to gargle. Sehee called after him.\n\n\"Hao's waiting for you in the first-floor cafe.\"\n\n\"Yeah, I know.\" He spat into the sink. \"He said he wanted to talk. Something important.\"\n\n\"You two aren't exactly close...\" Sehee frowned. \"Are you sure it's safe to meet him in person?\"\n\nShe worried about her brother meeting someone who could hurt him. But Youngwoo turned the concern around.\n\n\"Anyone watching you would think you're my *mother*.\" He shook his head. \"Worrying about carbonated water, nagging me constantly—you sound like Mom.\"\n\n\"...\"\n\n\"You're still young. Men don't like nagging women, you know. If you want to get married someday, ease up.\"\n\n\"A person who's never been in love is lecturing *me* about relationships...\"\n\n\"I'm *married*!\"\n\n\"That's in a *game*! You've never even *held hands* with a real woman!\"\n\n\"Not true! I held hands with Yura and Jishuka when I was drunk! I'm experienced with physical contact!\"\n\n\"W-What?! How shameless!\"\n\nThe argument escalated, and somehow, Youngwoo—despite being nine years older—ended up getting beaten up by his younger sister.\n\n***\n\n\"Ugh... What's with that girl's strength? I feel sorry for her future husband.\"\n\nYoungwoo limped into the family's private elevator, gingerly touching his bruised back. Still, a part of him felt proud.\n\n\"Better to be strong than weak, though. Sehee's nothing like me—she's got her life together, right? My sister's pretty reassuring, don't you think?\"\n\n\"...R-Right.\"\n\nToon—the beast-type user who'd once been part of the Italian mafia—stood beside him in the elevator. He lived in the Youngwoo Building and served as Grid's personal security. Like Sehee, he was a little concerned about this meeting with Hao, a man famous for his real-world martial arts mastery.\n\nJust in case.\n\n\"How's Bairan doing?\" Youngwoo asked.\n\nToon managed that territory. Since they rarely crossed paths in-game, Youngwoo got his reports in the real world.\n\n\"Tax revenue dipped slightly after Smith transferred to Reinhardt,\" Toon said. \"But it's temporary. Otherwise, no issues. War damage is fully repaired, and the Guardian of the Forest is bringing in new users.\"\n\n\"What about the soldiers?\"\n\nThe troops stationed in Bairan weren't from Reidan—they were conscripted and trained locally. Bairan was safer, farther from outside threats, so it didn't require elite forces.\n\n\"Average level's over 100.\"\n\n\"Already?\" Youngwoo blinked. \"That's unbelievably fast.\"\n\n\"We linked Bairan into the Grid set quest chain. Users go there for the quest stages and party up with soldiers. Shared experience is accelerating their growth.\"\n\n\"How many Grid set items have been distributed as rewards?\"\n\n\"Twenty-three weapons, five gauntlets.\"\n\nGrid set items were the prize for completing kingdom quests—stage three rewarded a weapon, stage six a gauntlet. Only five people had reached stage six.\n\n\"That's... tiny.\" Youngwoo frowned. \"Is the difficulty too high?\"\n\n\"No, it's appropriate. The Grid set shouldn't be handed out like candy. If anything, the scarcity is driving more enthusiasm—users are obsessed with completing the full set. The linked kingdom quest system you and Lauel created is working perfectly. It's benefiting both the players and the kingdom.\"\n\n\"Hmm...\"\n\nThe elevator doors opened. Toon clapped a hand on Youngwoo's shoulder.\n\n\"You're doing better than anyone expected. Don't stress.\"\n\n\"...Is it really okay for me to be making underwear?\"\n\n\"...What?\"\n\nToon didn't understand. Youngwoo shuffled into the cafe without elaborating.\n\n***\n\n\"Whoa. Did you overdose on sweet potato latte or something?\"\n\nYoungwoo and Toon received warm greetings from the cafe staff as they entered. Their eyes widened when they spotted Hao sitting by the window—*three* empty sweet potato latte cups lined up in front of him.\n\n\"Are you a gourmet?\"\n\nFinding common ground was how relationships formed, after all. Youngwoo, a sweet potato fanatic himself, felt an immediate surge of goodwill toward Hao.\n\nHao, meanwhile, stared at Youngwoo like he'd seen a ghost.\n\n*How can anyone drink this sugary garbage every day?*\n\nHao was from Sichuan. He liked spicy, sour foods. This cloyingly sweet drink was torture. He'd forced down three sweet potato lattes in a desperate attempt to bond with Youngwoo, and he'd already vowed never to touch one again.\n\n\"Two sweet potato lattes,\" Youngwoo told the barista.\n\n\"...\"\n\nThe vow crumbled.\n\n*Grid drinks them. Toon drinks them.* Hao's mind raced. *The sweet potato latte must be important. I can endure. I'll drink one every morning from now on.*\n\nHe closed his eyes and picked up his fourth cup. His head swam from sugar overload, but he could handle it if Youngwoo drank this poison daily.\n\nYoungwoo slid his own cup toward Hao. \"You really like these, huh? Have another. I can order more if you want.\"\n\n\"...No, I'm fine.\"\n\nHao's face had gone pale. He adjusted his translator—a diamond-class model from Comet Group, sponsorship perk—to make the conversation smoother. Youngwoo and Toon wore matching ones.\n\n\"Thanks for coming all this way,\" Youngwoo said belatedly. \"Welcome to my home. Must've been a long trip.\"\n\n\"Thank you for making time to see me.\"\n\n\"Have you tried Korean food yet?\"\n\n\"Not yet.\"\n\n\"Want to hit up a Chinese restaurant? Get some jjamppong? It's one of my favorites—really good stuff.\"\n\n\"...?\"\n\nHe'd just asked if Hao had tried *Korean* food, and now he wanted to go to a *Chinese* restaurant? Hao wondered if the translator was malfunctioning.\n\nToon sighed. \"Grid, you're getting off-topic.\"\n\n\"Oh, right. Sorry—I'm starving. Lost focus.\"\n\n\"...\"\n\n\"So why did you come to see me?\"\n\nHao realized the translator was working fine. He cleared his throat.\n\n\"I want you to persuade Kraugel not to move to the United States.\"\n\n\"...What? Kraugel's moving to the US?\"\n\n\"That's right.\"\n\nYoungwoo looked startled, then nodded slowly. \"Makes sense, actually. Russia held his sick mother hostage—of course he'd leave. Immigration's the natural move.\"\n\n\"But isn't it a problem if he goes to the *US*?\" Hao leaned forward. \"If he has to relocate, wouldn't South Korea or China be better?\"\n\nYoungwoo blinked. \"Why?\"\n\n\"Kraugel's Korean!\" Hao said it like it was obvious. \"Shouldn't he move to an Asian country—Korea or China—rather than the West?\"\n\n\"I mean... does race matter when choosing where to live? Isn't the point to find a place where you'll be happy?\"\n\n\"...\"\n\nHao fell silent. Grid's attitude was completely different from what he'd expected. Hao had a strong sense of nationalism—he couldn't wrap his head around this response.\n\nToon intervened. \"Grid isn't tied to the concept of countries.\"\n\nHe didn't think *South Korea is right* just because he was Korean. He was the complete opposite of Peak Sword. Sure, he loved his country—he'd go to the army without complaint—but he wouldn't force his patriotism onto Kraugel.\n\n\"This is Kraugel's decision to make,\" Youngwoo said. \"Talking about it is meaningless.\"\n\nHao stood abruptly. \"Think about it! If Kraugel moves to the United States, first place at the National Competition goes to the US!\"\n\nThe most influential country in the world. The United States had held that title for hundreds of years. It was a massive barrier to China's rise, and Hao—patriotic to his core—felt a visceral hostility toward American dominance. Now they wanted to conquer *Satisfy* too?\n\n\"Then is it okay for South Korea or China to dominate first place if Kraugel moves here?\" Youngwoo countered.\n\n\"China is my homeland, and South Korea is a country I respect...\" Hao hesitated. \"No—it's better than letting the US have him. I don't understand why Kraugel would choose the US...\"\n\nHe trailed off as Youngwoo's words echoed in his mind. *Find a place where you'll be happy.*\n\n*My personal selfishness shouldn't stand in the way of Kraugel's happiness.*\n\nCrooked patriotism was poison. Hao took a breath and sat back down.\n\n\"I shouldn't have come to South Korea at all,\" he muttered with a self-deprecating laugh.\n\nYoungwoo slurped his sweet potato latte through a straw. \"Really? I'm glad you came. This is more pleasant than I thought.\"\n\n\"...\"\n\n\"Let's go to that Chinese restaurant.\"\n\n\"...Why would I come all the way to South Korea just to eat Chinese food? I was planning to have pork belly and kimchi stew.\"\n\n\"You can eat famous dishes like that in China. Let's go to a Chinese restaurant.\"\n\n\"...\"\n\nWhat kind of person *was* this? Hao didn't know whether to laugh or cry. On the other hand, Toon was typing a message to Peak Sword.\n\n*—As expected, Hao seems to like Grid. Maintaining a good relationship with him is smart. I want pork belly and kimchi stew, so you're treating me to dinner.*\n\nThe reply came immediately.\n\n*—Do you even know what kimchi stew tastes like?*"
}