{
  "id": 631,
  "title": "Chapter 631",
  "content": "**Who is this woman?**\n\nEnvoys were expected to be skilled communicators—their ability to convey their nation's will and secure favorable outcomes was paramount. That Mercedes was a named NPC made perfect sense for such a critical role.\n\n*The Empire is renowned for its exceptional talent. Named NPCs must be commonplace there.*\n\nBut sword energy? That changed everything. The passive skill Mercedes wielded—one that wreaked havoc and bypassed even a Legend's absolute resistance—belonged to the realm of top-tier named classes. Grid had only ever known one person capable of such a feat.\n\n*Unless my memory fails me, Kraugel was the only one the system explicitly described as possessing 'sword energy.'*\n\nThe power amplified all sword-related skills. Which meant...\n\n*If Mercedes has sword energy, she must be a swordmaster on par with a Sword Saint.*\n\nGrid's gaze sharpened as he studied the woman before him. The silence stretched between them until Mercedes finally spoke.\n\n\"You are more impressive than the rumors suggest.\" Her tone carried genuine admiration as she assessed the skills and stats only she could see. \"The potential of a Legend may exceed what history has recorded. Our Empire has underestimated the power of Legends other than the Sword Saint. That evaluation will change moving forward.\"\n\nGrid's frown deepened. The way she spoke to him—as though addressing a precocious child—set his teeth on edge.\n\n*If she can maintain that composure after seeing my stats, she must be stronger than me.*\n\nThe logic was inescapable. As a representative of the Saharan Empire, which dominated the entire Western Continent, her level would naturally dwarf that of ordinary named NPCs.\n\n\"What is your position within the Empire?\" Grid kept his voice level, his posture regal despite the unease coiling in his gut.\n\n\"I serve among the Red Knights. His Majesty the Great Emperor granted me the number one.\" A slight smile touched her lips. \"People call me the First Knight.\"\n\nGrid's composure cracked for an instant. The First Knight of the most powerful empire in existence—*that* was who had been sent to his fledgling kingdom.\n\n\"Isn't that remarkable?\" He forced his tone into one of mild curiosity. \"Why would His Majesty the Emperor dispatch someone of your stature to my modest realm?\"\n\nHe was careful with his words, ensuring he used the proper imperial honorifics. One misstep could invite destruction upon the Overgeared Kingdom.\n\n*We can only afford to make an enemy of the Saharan Empire in the distant future.*\n\nGrid maintained his diplomatic smile, playing the role of king with every ounce of concentration he possessed. The weight of tens of thousands of lives pressed down on his shoulders.\n\nMercedes' laugh was light, almost musical. \"His Majesty sent me precisely because he respects King Grid. He holds your accomplishment in high regard—conquering an entire kingdom through your own strength is no small feat. Sending the representative of the Red Knights demonstrates the depth of that respect.\"\n\n\"I'm... honored.\"\n\n\"His Majesty the Emperor believes that a true leader should never be miserly with praise. His heart is as vast as the sea itself.\"\n\n\"I see. My gratitude to His Majesty.\"\n\nWith each exchange, Grid's discomfort intensified. He decided to cut through the pleasantries.\n\n\"What does His Majesty the Emperor want from me?\"\n\nThe friendly warmth drained from Mercedes' face. Her porcelain skin and ice-blue eyes suddenly radiated cold authority.\n\n\"First, let us discuss your crimes.\"\n\n\"Crimes?\"\n\n\"First: You destroyed the Eternal Kingdom—a nation that paid tribute to the Saharan Empire and thus fell under its protection—without imperial permission.\"\n\nGrid's jaw tightened.\n\n\"Second: You established a kingdom without seeking approval from the Empire, the rightful sovereign of the Western Continent.\"\n\nHis hands clenched on the armrests.\n\n\"Third: After claiming the title of king, you failed to swear a vassal's oath to His Majesty the Emperor.\"\n\nBlood pounded in his temples.\n\n\"Fourth: You seized the Fold Kingdom from the Empire's sphere of influence.\"\n\nMercedes' voice remained clinical, detached. She likely expected him to explode in indignation. And she wasn't wrong—from the Empire's perspective, these charges carried weight. But from Grid's position, he was being painted as a criminal awaiting sentencing.\n\nHe steadied his breathing and opened a whisper channel to Lauel.\n\n—*These four crimes she's listing. What do I do?*\n\n—*Exactly as we predicted.*\n\nLauel's confidence was reassuring. He'd foreseen this scenario and prepared accordingly.\n\n—*Repeat exactly what I tell you. Word for word.*\n\nGrid drew a breath and began channeling Lauel's carefully crafted response.\n\n\"I cannot acknowledge these four crimes, as they stem from misunderstandings or ignorance.\" His voice carried surprising authority. \"Regarding the first—it is inaccurate to call the Eternal Kingdom an imperial subject. Yes, they paid tribute to the Empire, as did many kingdoms. However, the Eternal Kingdom held officially neutral status, acknowledged by the Empire itself. Their tribute was a gesture of courtesy, not vassalage.\"\n\nMercedes' expression remained inscrutable.\n\n\"Second—no continental law exists requiring imperial permission to establish a kingdom. Had I been wiser, I would have informed the Empire as a courtesy. My ignorance prevented me from extending that respect, and for that oversight, I am genuinely remorseful. But ignorance is not deliberate offense.\"\n\nThe First Knight's eyes narrowed fractionally.\n\n\"Third—the Overgeared Kingdom is newly formed and still stabilizing. How could I presume to present myself before His Majesty the Emperor while my realm remains in such disarray? It would have been the height of arrogance. I have been waiting until I could approach the Empire properly.\"\n\nGrid's hands trembled slightly as he delivered the final point.\n\n\"Fourth—accepting the Fold Kingdom as a vassal was a defensive necessity. All fifteen kingdoms were circling like predators, and I needed to demonstrate strength to ensure my people's survival. In the process, I inadvertently claimed what was rightfully within the Empire's sphere. Naturally, I intended to restore the Fold Kingdom to imperial authority.\"\n\nHis body shook—with rage at his own self-abasement, at the injustice of it all. Mercedes listened in silence before her severe expression softened marginally.\n\n\"Excuses. Scandalous excuses.\" Her tone suggested she didn't entirely believe him. \"But I understand King Grid's intentions. What matters is this: the Overgeared Kingdom acknowledges its loyalty to the Empire. Is that not true?\"\n\nGrid froze. Every instinct screamed against answering. But Lauel's urgent whisper pushed him forward, reminding him that pride was a luxury he couldn't afford.\n\n\"...Yes.\"\n\n\"Good. You have responded as His Majesty the Emperor anticipated.\" Mercedes straightened. \"I will now convey His Majesty's decree. Overgeared King Grid—descend from your throne, kneel, and receive the Emperor's will.\"\n\n\"What?\"\n\n*Kneel?* Grid stared at her, certain he'd misheard.\n\n\"This is an imperial edict. Proper courtesy is required. Do you refuse?\"\n\n\"...No. Of course not.\"\n\nShame burned through him like acid. But his choice would determine the fate of every member of Overgeared, every citizen who believed in him. Beyond that, he'd invested billions of won into building this kingdom. He couldn't destroy it all over wounded pride.\n\n*Stay calm. This isn't shameful. This is survival.*\n\n*Crack.*\n\nGrid rose from his throne. With deliberate, measured steps—maintaining every shred of royal dignity he could muster—he descended and knelt before the First Knight.\n\nMercedes' elegant eyebrows drew together.\n\n*He shows no humiliation?*\n\nThis man was a beast that would be difficult to tame. She would need to remain vigilant. With that thought in mind, she withdrew a sealed letter and began to read.\n\n\"I, Juander, Master of Earth and Sky, do decree: I accept Grid's transgressions with magnanimity and acknowledge his status as the Overgeared King. The Fold Kingdom shall remain under his authority. In return, Overgeared King Grid and the Overgeared Kingdom shall demonstrate their eternal loyalty and gratitude to the Empire. The Overgeared Kingdom will remit seventy-two percent of its monthly tax revenue to the Empire. Furthermore, when Prince Lord reaches twelve years of age, he shall be sent to study within the Empire.\"\n\nGrid's mind raced. Lord was still young—several years remained before that deadline. If the Overgeared Kingdom grew strong enough before then, perhaps that condition could be renegotiated. The immediate crisis was the tax burden.\n\n\"The other kingdoms only pay thirty-six percent of their tax revenue to the Empire.\"\n\n\"The price for retaining the Fold Kingdom.\" Mercedes' smile turned sharp. \"You must pay double the standard tribute. Or would you prefer to refuse?\"\n\nHer expression practically dared him to object. Now that she'd met Grid in person, she found him more formidable than the Emperor's assessment suggested. She hoped to provoke him into a misstep.\n\nBut Lauel's steady whispers continued to flow through the mental link, anchoring Grid's composure. And Grid's own mental fortitude—forged through countless trials—held firm.\n\n\"No. I will comply with His Majesty the Emperor's command. I accept these terms.\"\n\n\"...You truly are no ordinary man.\" Mercedes inclined her head slightly. \"Very well. I shall take my leave.\"\n\nShe offered Grid a perfunctory nod and departed the audience chamber. \n\nAlone at last, Grid's eyes blazed crimson with suppressed fury.\n\n\"Be ready,\" he whispered to the empty room. \"Next time we meet, you'll be the one kneeling.\"\n\nHe needed strength. *More strength.*\n\nGrid opened his eyes—metaphorically and literally—as he contacted Lauel.\n\n\"How long can we sustain the Empire's tribute demands?\"\n\n\"Three months.\" Lauel's response was immediate and precise. \"After three months, our people and soldiers will go hungry. The kingdom will sink into debt. By the fourth month, we'll cease to function as a viable nation and collapse entirely.\"\n\n\"What's the solution?\"\n\n\"Piaro is currently in the Fold Kingdom, and his agricultural development is proceeding three times faster than projected. The National Development Quest tied to your Grid's Set will attract five times as many player participants within two months. Combined tax revenue from the Fold Kingdom and Siren will double. We'll increase production of limited-edition potions from the alchemy facility sevenfold. And the Overgeared Guild members will donate their salaries to the kingdom coffers. If all of this comes together, we can extend our survival to nine months.\"\n\n\"The long-term solution?\"\n\n\"Power. Simple as that. Become so formidable that the Empire doesn't dare threaten us again.\"\n\nGrid's thoughts turned eastward, toward Pangea.\n\n\"I'm returning to the East Continent. I'll bring back the allies I made there.\" He pulled something from his inventory. \"And give this to Piaro.\"\n\n\"A golden walnut?\"\n\n\"More valuable than gold itself. If anyone can cultivate it successfully, it's Piaro.\" Grid's voice carried absolute conviction. \"He's a Legendary Farmer, after all.\""
}