{
  "id": 637,
  "title": "Chapter 637",
  "content": "# Chapter 637\n\nThe volcanic peak loomed against the sky, black stone rising in jagged spires that seemed to pierce the heavens. Grid stared up at the dormant mountain, feeling the weight of its ancient presence settle over him.\n\n\"Something about this place feels wrong,\" he muttered.\n\nThe Lava Prison wasn't a structure built by human hands—nature had carved this hellhole into the mountainside, and someone had simply recognized its potential as a cage.\n\nIdan shifted nervously beside him. \"Those peaks look like teeth. Ready to bite.\"\n\n\"This is a volcano, isn't it?\" Yang Fei's voice carried an edge of panic. \"What if it decides to wake up while we're inside?\"\n\nNeither of them took another step forward.\n\nGrid turned to face them, already reaching for his mask. \"You've done enough. Go back to the inn and wait for me there.\"\n\n\"I'll have a hot meal ready,\" Idan promised.\n\nYang Fei nodded quickly. \"Bath water and tea. Just... please be careful.\"\n\n\"I will.\"\n\nAs their footsteps faded into the distance, Grid checked the time. Less than two hours until Han Seokbong's execution.\n\n*Too long. We spent too long gathering information.*\n\nWithout Yang Fei's connections, he might still be wandering the capital, ignorant of where they'd taken the calligrapher and his daughter. \n\n*And if I'd failed? I would've had to confront the king himself.*\n\nThe thought left a sour taste in his mouth. The hidden quest offered two paths—rescue the prisoners or approach the Cho King directly. Common sense suggested that marching up to a monarch who'd ordered their execution would end in bloodshed. Grid couldn't afford that. Not when his entire reason for returning to the East Continent was to build alliances for his kingdom.\n\n*I need the Cho Kingdom as a friend, not an enemy. Which means getting in and out without anyone knowing I was here.*\n\nHe fitted the Slaughterer's Eye Patch over his face, then secured the mask. The disguise settled into place just as he crossed the threshold into the prison.\n\nA system message flashed across his vision:\n\n[You are the first player to discover the Lava Prison dungeon!]\n[Experience gained from Lava Prison will increase for the next week!]\n[Drop rates for Unique-grade items and higher will significantly increase when defeating boss monsters!]\n\nGrid froze mid-step. \"Wait. This place is a *dungeon*?\"\n\n*Did I get the location wrong?*\n\nNo—the information had been solid. He forced himself to stay calm and surveyed his surroundings, alert for threats.\n\nThe rattle of chains echoed through the corridor.\n\nGrid spun toward the sound. A figure emerged from the shadows, arms bound by iron shackles that dragged across the stone floor. Pale skin stretched over angular features. The name plate above its head read: **Lava Prison Guard**.\n\nA jiangshi.\n\n*They're using monsters as guards?*\n\nIt made a twisted kind of sense. He'd expected to fight human soldiers—had dreaded the thought of cutting down men who were simply following orders. But monsters? No guilt. No hesitation.\n\n*Perfect. I can move fast.*\n\nFour golden hands materialized around him, each one gripping a hammer that crackled with power. The God Hands took formation.\n\n\"Clear the path.\"\n\n*Pepeng!*\n\n*Pepepepeng!*\n\nThe hammers struck with thunderous force. The jiangshi staggered—but didn't fall. Didn't even flinch. The stiffness effect that should have locked them in place simply failed to trigger. The creatures' defenses held firm against the divine-powered weapons.\n\nGrid's jaw tightened. *That's why they use these things to guard a national prison. High resistance, high defense—built to endure.*\n\nHe drew his greatsword. The blade emerged with a predatory gleam, its blue surface reflecting the dim light like sunlight through deep water. In the darkness of the prison, the +9 Failure truly came alive, its power amplifying with every shadow.\n\nTime to see what these guards were really made of.\n\n---\n\nHeat rolled through the Lava Prison in suffocating waves. Even sitting still, a person would sweat through their clothes within minutes. Dehydration came quickly. Stay too long, and the heat itself would kill you—no executioner required.\n\nThat's why the guards weren't human.\n\nNo ordinary soldier could survive a work shift in this hellish place. So the Cho Kingdom had turned to necromancy, crafting jiangshi to patrol the corridors where living men would perish.\n\n\"It's time.\" The blood jiangshi's voice carried no inflection. \"Let's go.\"\n\nHan Seokbong struggled to his feet. Sweat dripped from his brow, soaking his collar despite the water rations the king had secretly provided. The heat sapped his strength with relentless efficiency.\n\nHe swayed, one hand shooting out to grip the iron bars for support.\n\nThe metal burned cold against his palm.\n\n*Blood jiangshi.*\n\nThese weren't ordinary undead. Virgin blood mixed with concentrated poison during the creation process made them stronger, faster—and gave them the ability to speak. Though their intelligence rarely exceeded that of their creator.\n\nThe creature gestured toward the corridor. Han Seokbong forced himself forward, one foot in front of the other.\n\nHis death approached. He should have been terrified. And he was—but not for himself. The pain of dying didn't frighten him. What haunted him was the image of Sua, alone in the world.\n\n*No. I can't think like that. Sua is strong. She'll survive this. She has to. The king gave me his word he'd watch over her.*\n\nA father had to believe in his daughter. Han Seokbong drew on that faith, letting it steady his breathing. He'd accept his fate with dignity.\n\nThen Sam Dasoo stepped into view.\n\n\"Pathetic, isn't it?\"\n\nHan Seokbong's expression hardened. \"You.\"\n\nSam Dasoo represented everything rotten about the Cho Kingdom's nobility—corruption wrapped in silk robes, cruelty masked as pragmatism. Han Seokbong had fought against him for years, refusing to compromise his principles.\n\n\"When I'm gone, you'll be the only counsel the king has left.\" The words tasted like ash. \"I fear for our kingdom's future.\"\n\nSam Dasoo laughed. \"Why waste energy worrying about tomorrow when you won't live to see it?\"\n\n\"Did you come here just to mock me?\"\n\n\"Mock you? No, no.\" Sam Dasoo's smile widened. \"I came to offer comfort. Our rivalry is ending, after all. Consider this a parting gift—news about your precious daughter.\"\n\nEvery muscle in Han Seokbong's body went rigid. \"Don't you *dare* speak her name.\"\n\n\"But she's the whole reason I'm here.\" Sam Dasoo leaned closer, his voice dropping to a whisper. \"I'm going to take excellent care of Sua. I'll enjoy her beauty for as long as it pleases me. So you can die in peace, knowing she won't be lonely.\"\n\nThe world tilted.\n\n\"You can't.\" Han Seokbong's voice cracked. \"The king promised to protect her. He *promised*.\"\n\n\"And what if she comes to me willingly?\"\n\n\"That's impossible—\"\n\n\"Is it?\" Sam Dasoo's grin turned predatory. \"This morning, I had Hwanryongcho mixed into her breakfast.\"\n\nThe air left Han Seokbong's lungs.\n\nHwanryongcho. A drug that shattered the mind's defenses, that made the victim susceptible to any suggestion whispered into their ear.\n\n\"By now, someone wearing your face has already visited her cell.\" Sam Dasoo's laugh echoed off the stone walls. \"He's telling her to trust me. To serve me. Your dying wish, delivered by her loving father. Brilliant, isn't it?\"\n\n\"You *monster*!\"\n\nHan Seokbong lunged forward. The blood jiangshi's grip tightened on his arms, holding him back. Sam Dasoo simply stood there, savoring every moment of Han Seokbong's anguish.\n\nHis curses and threats meant nothing. In minutes, he'd be dead. And Sua would be lost.\n\n---\n\nSecond floor of the Lava Prison.\n\n\"Father?\"\n\nSua's thoughts moved through fog. The heat had been oppressive since dawn, but this was different—her mind felt disconnected from her body, floating somewhere just beyond reach.\n\nWhen her father appeared in the doorway, she couldn't tell if he was real or another fever dream conjured by the heat.\n\nHe reached out, touching her cheek. His hand felt wrong. Too cold. But he was here, and that was all that mattered.\n\n\"Are you leaving?\" Her voice trembled.\n\n\"I am.\" Her father's expression was strange. Distant. \"Sam Dasoo will look after you in my place. You must trust him, Sua. Serve him faithfully. Promise me.\"\n\nSomething screamed wrong in the back of her mind, but the fog smothered it.\n\n\"Yes. I promise.\"\n\n\"Since when does a *monster* pass for your father?\"\n\nThe voice cut through the haze like a blade.\n\nSua's eyes widened. \"Grid?\"\n\nThat voice. She knew it—impossible to forget. But how could he be here? This had to be another hallucination, her mind playing tricks in the heat and darkness.\n\nThe figure beside her snarled. \"What bastard dares—\"\n\nSua watched in horror as her father's face began to *melt*. The features ran like wax, reforming into something grotesque. A stranger. A devil wearing her father's skin.\n\n\"Who are you?\" Panic clawed at her throat. \"Where's my father? What did you do to him?\"\n\nThe drug's hold on her mind shattered. Clarity returned in a rush of pain and terror. She was alone. Her father was gone. And this *thing* had tried to—\n\n\"Pagma's Swordsmanship.\"\n\nGrid's voice. Real this time.\n\n\"Link.\"\n\n*Pit!*\n\n*Pipipipipit!*\n\nThe imposter screamed.\n\n*Kurururung!*\n\nThe iron bars of her cell exploded inward, torn apart by invisible force.\n\n\"Let's go.\"\n\nA hand extended through the settling dust. Large. Scarred. Unmistakable.\n\n\"Grid...\" Sua reached up, her fingers wrapping around his. \"It's really you.\"\n\nHe pulled off his mask with his free hand. Blood—his own blood—stained the fabric. His smile came with difficulty, lips cracking.\n\n\"Yeah. It's me.\" He squeezed her hand. \"Time to go home.\"\n\nHe looked like he'd fought through hell to get here. The mask that should have been wet with enemy blood was instead soaked with his own. Wounds covered his body, still bleeding.\n\nHe'd come anyway."
}