{
  "id": 638,
  "title": "Chapter 638",
  "content": "*The jiangshi are too damn strong.*\n\nAt level 360, the Lava Prison Guards stood twenty-nine levels above Grid's current power. Yet level alone shouldn't have mattered—not with his equipment and transcendent stats. No, what made these blood jiangshi truly terrifying wasn't their crushing strength or iron-hard defense. It was their *absence*. No consciousness. No pain. No fear. Just relentless, mechanical violence.\n\n*Kieeeeek!*\n\n*Chaaeng! Chaeng!*\n\n\"Kuk...!\"\n\nEven Grid's massive health pool—over 80,000 after earning the 'Savior of the World' title from the Belial raid, enough to shame most dedicated tanks—was hemorrhaging fast. Forty percent remained. And dropping.\n\n*These bastards hit like sledgehammers.*\n\n*Chaaeng!*\n\n\"...!\"\n\nHis +9 Failure, empowered by the prison's darkness, carved through the air toward three blood jiangshi. One of them simply *kicked* the blade. Grid's fingers went numb. The sword tumbled from his grip.\n\nEven with his overwhelming strength stat, three-on-one against these monsters was impossible.\n\n*Damn it.*\n\nGrid cursed internally but didn't panic. Satisfy might boast cutting-edge realism, but it was still a game. Rules existed. When a weapon left your hand, you couldn't retrieve it for one to three seconds. Simple. Exploitable.\n\n*Kuwang!*\n\nThe jiangshi didn't waste the opening. All three surged forward, their chain-bound fists swinging with the savage momentum of enraged apes. No technique. Pure brutality. More than enough to tear a man apart.\n\n\"Grid!\"\n\nSua's face went white. He'd broken her out of this hell, only to get himself cornered by the guards. Guilt crashed through her chest like a physical blow.\n\n*Because of me. He's risking everything for me.*\n\nWhy? Why throw his life away in this cursed place?\n\n*Crunch.*\n\nSua wasn't the type to hide behind others. Couldn't stomach watching Grid die for her sake.\n\n*I'll save you.*\n\nWarrior first, woman second. She ignored her screaming stamina, her leaden legs, and launched herself forward. Before she'd covered half the distance, Grid had already freed himself. Four God Hands materialized to bind one jiangshi. His two Overgeared Skeletons deployed silver threads to restrain the others. And in his right hand, a longsword gleamed where Failure had been.\n\nHe'd swapped weapons in the half-second window.\n\nGrid's item rotation speed transcended reason. The God Hands made it possible. He'd tried hammering the jiangshi with Mjolnir's stiffness effect, but their unnatural bodies resisted the debuff. So he'd switched to swords. The moment Failure slipped away, a +7 Sword Ghost arrived in his palm. Lower base damage than his +9 weapon, true—but the Sword Ghost had a stacking passive. Every consecutive hit on the same target increased its power.\n\nAnd that wasn't all.\n\n*Kkirik!*\n\nThe blade that carved through the jiangshi's chest *split in two*.\n\nIf the blood jiangshi possessed proper consciousness, they would've recoiled in horror. That impossible transformation was the Sword Ghost's greatest strength. One longsword. Or a longsword *and* shortsword. Maximum versatility.\n\n*Chukakakakak!*\n\nThe twin blades severed both wrists simultaneously.\n\n[The +7 Sword Ghost has accumulated 3 attacks against the same target!]  \n[The +7 Sword Ghost's attack power has increased by 20%!]\n\nGrid the predator showed his fangs.\n\n*Seokeok!*\n\n*Puok! Puuok!*\n\nHe never released his prey. The Sword Ghost hammered the same jiangshi over and over, a lesson learned through countless life-or-death battles. The result?\n\n[The +7 Sword Ghost has accumulated 11 attacks against the same target!]  \n[The +7 Sword Ghost's attack power has increased by 100%!]\n\nMaximum potential unleashed. At double power, the Sword Ghost now eclipsed even Failure. Rotten black blood oozed from the jiangshi's steel-hard flesh.\n\n\"Pagma's Swordsmanship—*Kill!*\"\n\n*Peeeeeong!*\n\nThe necklace Lord had gifted him activated. Thanks to the Necklace of Agility's 15% skill deployment boost, Grid's sword dance accelerated beyond its natural limits.\n\n—*Kuaaaaah!*\n\nEnergy blades rocketed forward like missiles, punching through the jiangshi's chest. It crumbled to ash.\n\n[The Lava Prison Guard has been defeated.]  \n[185,001,400 experience points acquired.]  \n[63 gold acquired.]\n\n*The experience is insane.*\n\nAs the first discoverer of the Lava Prison dungeon, Grid enjoyed a massive experience multiplier for one week. Over 100 million from a single mob.\n\n*No item drops from jiangshi, though. Still, they give thirty-three percent more experience than the armored needles. If I could farm this efficiently...*\n\nThis would be the ultimate grinding spot. While the first discoverer buff lasted, anyway.\n\n*Once I rescue Han Seokbong and Sua and escape, I won't be able to return. I'll waste the buff.*\n\nYet he felt no regret. Satisfy had countless hunting grounds. The lives of Han Seokbong and Sua—and the quest rewards—mattered more.\n\n*Kiyaaaaaah!*\n\n*Rumble!*\n\nHe turned on the two jiangshi still trapped by the God Hands.\n\n[15 minutes remaining until Han Seokbong's execution!]\n\nThe notification made his pulse quicken.\n\n\"Already? I searched the first and second floors—no sign of Han Seokbong. Do you know which floor he's on?\"\n\n\"I'm not sure. But the Lava Prison has four floors total.\"\n\n*Third and fourth floors, then.*\n\nSimple enough. Grid shoved down his anxiety and headed for the spiral staircase. Sua followed, her face tight with worry.\n\n\"Are you okay?\"\n\nShe wanted her father saved. *Needed* Grid to save him. But was it even possible? Three blood jiangshi on the second floor had already pushed Grid this hard. His breathing came ragged, his entire body scored with wounds. That bizarre mask was painted red with his blood. How could he possibly break through the jiangshi on the third and fourth floors?\n\nTime was running out. Grid might be the most powerful person in Sua's heart, but the odds felt insurmountable. He reached the third floor ahead of her and laughed.\n\n\"Believe in me. Item Transformation.\"\n\n**[Item Transformation]**  \n*A skill that activates if the legendary mineral 'pavranium' is possessed.*  \n*Transforms pavranium into the shape and performance of a specific item.*  \n*Can only transform into items you have learned how to make.*  \n*Duration: 3 minutes. After transformation ends, pavranium returns to its original form.*  \n*Skill Mana Cost: None.*  \n*Skill Cooldown: 6 hours.*\n\nThe signature move of Pagma's Descendant. Six-hour cooldown. But Grid had crafted four God Hands from vast quantities of pavranium. He could transform each hand individually, and they operated on separate cooldown timers.\n\n*Pahat!*\n\nOne God Hand floated before him.\n\n\"Lifael's Spear.\"\n\nThe enhanced version he'd reconstructed for Isabel.\n\n*Kuoooooh—*\n\nGolden light erupted. The spear radiated lethal intent that belied its beautiful craftsmanship.\n\n*An artifact that transforms...?*\n\nSua stared, awestruck. Grid flashed her a reassuring smile and charged four blood jiangshi, spear blazing.\n\n[Light Wheel skill activated.]  \n[Light Wheel has fired multiple Magic Missiles (Enhanced).]  \n[Shield of Light activated.]  \n[Magic Missile (Enhanced) fired at enemy who struck the shield.]\n\n*Kuwang!*\n\n*Kwa kwa kwa kwa kwa kwa kwa kwa!*\n\n\"...\"\n\nOverwhelming. Absolute. The myth-rated weapon forged by the blacksmith Grid reduced the powerful blood jiangshi to cinders. They couldn't even scream before death claimed them.\n\n*Kurururung!*\n\nThe prison structure buckled under Lifael's Spear's firepower. The floor fractured. Grid caught Sua around the waist as she fell.\n\n\"Ah...! H-hat!\"\n\nSua gasped and immediately clamped both hands over her mouth, her face going scarlet. An unexpected reaction. Normally she'd have teased him mercilessly. Today, though, she flushed like a bashful maiden and refused to meet his eyes. Grid's heart stuttered at her vulnerable expression.\n\n*She can look this cute?*\n\nUntil now, he'd maintained iron discipline around Sua's beauty because her personality clashed with his tastes. She was so brazenly forward that it overwhelmed his relatively pure sensibilities. But at this critical moment, his composure cracked.\n\n\"Ahem.\"\n\n\"...\"\n\nGrid coughed and set the still-blushing Sua down in a safe spot. Silence stretched between them. Then four more blood jiangshi emerged from the far end of the corridor.\n\n*Need to hurry.*\n\nGrid steeled himself to finish the jiangshi before the weapon transformation expired—less than two minutes remained. He pressed the +7 Ideal Dagger into Sua's hands. Its usage requirements were low enough for her to wield.\n\n\"Support me, please.\"\n\n\"Eh...? Y-yes! Yes! I understand!\"\n\nHe was trusting her with a weapon more precious than life itself?\n\n*Does this mean he sees me as...?*\n\nYes. Maybe it meant she was valuable to him. Sua's heart hammered. She forced herself to calm down, then activated the Wind Blast skill embedded in the Ideal Dagger to assist Grid.\n\n*Oh.*\n\nGrid marveled at her timing and precision. She made the fight significantly easier. The combination of Cho Kingdom's greatest warrior and the Overgeared King was devastating. But time remained merciless.\n\n[5 minutes remaining until Han Seokbong's execution!]  \n[4 minutes remaining until Han Seokbong's execution!]\n\nGrid annihilated the blood jiangshi and swept through the third floor. No sign of Han Seokbong.\n\n*Fourth floor!*\n\nThe last level of the Lava Prison. Grid and Sua sprinted up the final staircase. And then he saw it.\n\n\"S-Sua...? G-Grid...?\"\n\nHan Seokbong, dragged like a condemned criminal.\n\n\"Father!\"\n\nSua bolted forward without checking her surroundings.\n\n[The leader of the Lava Prison has emerged.]\n\nAn overwhelming presence materialized.\n\n*Damn. This won't be easy.*\n\nGrid sighed."
}