{
  "id": 639,
  "title": "Chapter 639",
  "content": "\"Han Seok... What?\"\n\nThe guards halted mid-stride, their grip loosening on Han Seokbong as they spotted Grid.\n\nThe ground erupted.\n\nA pale, unnaturally slim figure burst from beneath the prison floor, blocking Grid's path. The system notification flickered across his vision:\n\n[The leader of the Lava Prison has emerged.]\n\nGrid's brow furrowed. Something felt wrong.\n\nIn Satisfy, boss monsters announced themselves with crushing auras that pressed down on everything nearby. Even low-level bosses inflicted status abnormalities on sight—fear, paralysis, confusion. It was an unavoidable mechanic.\n\nYet this creature emanated nothing. No debuffs triggered. No warning messages flashed. Just an unsettling stillness that made Grid's instincts scream danger.\n\n*If it's not causing abnormal conditions...*\n\nThe implications crystallized in his mind. Either the boss was pathetically weak—unlikely given the dungeon's difficulty—or its base specifications were so overwhelming that intimidation tactics were unnecessary. Given how formidable the ordinary jiangshi had proven, their leader operating at peak physical capacity was a terrifying prospect.\n\n*This is bad.*\n\nThe regular guards had already pushed him to his limits. He'd lost his sword fighting just three of them simultaneously. If this boss possessed ten times their strength—a reasonable estimate for elite variants—Grid would be hard-pressed to survive. His defensive capabilities depended entirely on his blade work. Without it...\n\n*No. I'm catastrophizing.*\n\nHe shook his head, forcing an awkward smile. Anxiety wouldn't help.\n\n\"B-Black-horse jiangshi...!\"\n\nSua's voice cracked with terror.\n\n\"...?\"\n\nGrid's forced calm evaporated. Why that reaction? What made this particular type so—\n\nThe guard moved.\n\nIts kick blurred through the air toward Sua with technique that reminded Grid of Regas, the first-ranked martial artist. No—this was faster, sharper, more refined than anything Regas could manage.\n\n*Kuwaaang!*\n\nThe impact crater where Sua had stood testified to the creature's monstrous strength. She'd barely escaped using Quick Movements, the Ideal Dagger's skill activating at the last possible instant.\n\n\"That kick?\"\n\nRelief at Sua's survival warred with Grid's growing confusion. The previous jiangshi had only attacked with their arms, leading him to assume they suffered from restricted lower-body mobility. This boss shattered that assumption completely.\n\nSua's explanation tumbled out in breathless gasps:\n\n\"There are five types of jiangshi.\"\n\nThe iron jiangshi—most common. They wielded tremendous physical power, their bodies moving like armored battering rams. But they couldn't bend their knees, making their movements predictable despite their strength.\n\nThe poison jiangshi—similar physical capabilities to iron variants, but exponentially more dangerous. Every wound they suffered leaked toxins. Perfect for slaughtering large groups.\n\nThe blood jiangshi—a different breed entirely. Crafted using virgin blood mixed with powerful drugs, they possessed triple the speed and strength of iron jiangshi. Unlike their mindless cousins, blood jiangshi could understand and execute complex commands.\n\nA kingdom with an army of blood jiangshi could conquer nations. But like iron jiangshi, their knee joints remained rigid, limiting tactical flexibility.\n\nThen came the superior types—black-horse and flying-horse jiangshi, operating in a completely different realm.\n\nBlack-horse jiangshi were designated 'superior' tier. Ten times more physically powerful than blood jiangshi, with no anatomical restrictions. They could even utilize skills.\n\nFlying-horse jiangshi—the 'living superior' type—existed only in rumors. Supposedly crafted from rare elixirs and virgin blood, a single flying-horse jiangshi could allegedly destroy entire armies. But no confirmed sightings existed.\n\n\"The black-horse jiangshi represents the absolute peak of jiangshi evolution.\"\n\n\"...Wonderful.\"\n\nGrid's sarcasm couldn't mask his dismay. Ten times stronger than a blood jiangshi? He'd been calculating for three times. But *ten*?\n\n*Frontal confrontation is suicide.*\n\n\"Grid! Forget about me—protect Sua! Run!\"\n\nHan Seokbong's voice echoed across the prison yard as guards dragged him toward the execution grounds. Despite his faith in Grid's abilities, he knew the black-horse jiangshi represented an insurmountable obstacle. He'd already accepted death. His only hope was their survival.\n\nSua's expression hardened with resignation.\n\n\"I'll buy time. Grid, run while you can.\"\n\nShe positioned herself between Grid and the monster, biting her lip hard enough to draw blood.\n\n*Father, forgive me. I lack the strength to save you. At least I'll join you soon.*\n\nShe'd given up on rescue. With the black-horse jiangshi deployed, her sole remaining wish was Grid's survival. He'd come to save them despite the danger. The least she could do was ensure he lived.\n\n\"Run!\"\n\nShe refused to let Grid suffer for her sake. She pressed the Ideal Dagger back into his hands—returned his only weapon—then turned to face the creature barehanded.\n\n*Kiyaaaaaah!*\n\nThe black-horse jiangshi's laughter mocked her futile determination. As if she could delay it even momentarily. As if this insect could buy time for anything.\n\n*No way!*\n\nGrid had traveled to the East Continent specifically to recruit talented individuals. The Han Seokbong family—abandoned by the Cho Kingdom, masters of their crafts—were exactly the allies he needed.\n\n*I'll protect you both and make Pangea an Overgeared territory.*\n\nThe vow solidified as he summoned the God Hands, deliberately avoiding the transformation into Lifael's Spear.\n\n*The reproduction is too weak compared to the original.*\n\nHe couldn't replicate the goddess' divine essence—the core material of the true Lifael's Spear. Against this opponent, the transformed version would barely scratch its hide. Better to save the transformation cooldown for when it mattered.\n\n*The God Hands focus on pure defense!*\n\n*Pa pa pa pat!*\n\nResponding to his will, the golden constructs shot toward Sua, interposing themselves between her and the jiangshi's devastating kick.\n\n*Jjejeong!*\n\n*Jjeejeeeong!*\n\nPavranium's greatest strength was its infinite durability. The impacts that would have pulverized steel left them intact. But even indestructible materials had limitations—each blow locked them in place for several seconds. They couldn't maintain a defensive perimeter indefinitely, but they'd buy precious time.\n\n\"Noe!\"\n\n[The best demonic beast of hell has been summoned!]\n\nGrid had deliberately withheld Noe despite the time-attack pressure, conserving the familiar for emergencies. This qualified. He needed Noe at full strength and stamina.\n\n\"Nyang! Feeding time!\"\n\nNoe materialized with jaws already widening, attempting to swallow the black-horse jiangshi whole. But the creature moved like liquid shadow, flowing aside effortlessly.\n\n\"Eh?\"\n\n\"Nyong?\"\n\nNoe *missed*? Both Grid and the familiar froze in disbelief.\n\n*Peeok!*\n\n\"Kiyang!\"\n\nThe counterattack sent Noe flying. His eyes rolled back in X-shapes as his tongue lolled out, consciousness fleeing.\n\n\"S-Sacred creature...!\"\n\nDuring the armored needle incident, Sua had mistaken Noe for a sacred beast. Seeing him dispatched so casually shattered her composure.\n\n\"Grid, please—just run!\"\n\nIf a sacred creature couldn't survive this monster, what chance did Grid have? He needed to flee, to preserve his life. But Grid ignored her desperate plea, stepping forward instead of back.\n\n\"Sua, you're mistaken. I didn't stumble here by accident. I came specifically to save you and your father. I'll protect you both, even if it costs me everything.\"\n\n\"...Why?\"\n\nWhy sacrifice himself for strangers? Grid was already their benefactor, having shown them undeserved kindness. There was no justification for this level of commitment.\n\n\"Ah...\"\n\nHer confusion evaporated as Grid drew a new sword. The translucent crimson blade took her breath away. Iyarugt. The 'Coolness' option made the weapon seem almost ethereal, its brilliant red glow illuminating the dark dungeon like a rising sun.\n\nThis was the prelude—the harbinger of hell's greatest swordsman.\n\n\"Summon Iyarugt.\"\n\n[Summoning Sword Demon Iyarugt!]\n\n*Kurururung!*\n\nThunder rolled through the prison as the blade roared. Blood-red light exploded outward, the sword rising from Grid's grip of its own accord.\n\n\"Ah...!\"\n\nSua's breath caught. The crimson energy radiating from Iyarugt resonated with something deep in her soul. More beautiful than any gemstone, more captivating than any work of art.\n\n*Kuoooooh!*\n\n\"...Refreshing.\"\n\nThe turbulent soul-energy coalesced, forming the shape of an elderly man bent with age. Blood-colored light wreathed his frame like living flame—the magical power of hell's supreme swordsman, a low-grade demonkin who had dueled great demons and survived.\n\n*Paaaat!*\n\nIyarugt savored his first breath of fresh air in ages, then struck.\n\nThe black-horse jiangshi couldn't dodge.\n\nNot because Iyarugt's speed surpassed the creature's reflexes—the jiangshi's physical capabilities far exceeded the demon's. But swordsmanship wasn't about pure speed. The blade's trajectory was so perfectly executed, so inevitably placed, that the jiangshi saw the strike coming and still couldn't avoid it.\n\n*Chukakakakak!*\n\nCrimson light danced around the black-horse jiangshi in mesmerizing patterns, each movement buying precious seconds.\n\n\"Open Rune of Darkness.\"\n\nGrid released the seal.\n\n\"Belial's Power.\"\n\nThe strength of a great demon flooded his body.\n\n***\n\n\"Who *is* this lunatic?\"\n\nSam Dasoo secured Han Seokbong's bindings while shaking his head. He glanced back at the prison in disbelief.\n\n\"What kind of fool sees a black-horse jiangshi and doesn't immediately flee? What manner of freak are we dealing with?\"\n\nHan Seokbong glared at him despite his restraints.\n\n\"Watch your mouth. He's not someone trash like you can speak about.\"\n\n\"Kukuk! Look at you, defending a dead man's honor. How amusing.\"\n\nBlack-horse jiangshi were the Cho Kingdom's ultimate weapons. Only five existed in the entire nation. The unidentified intruder attempting Han Seokbong's rescue? He'd be corpse before getting within ten meters of his target.\n\n*The girl with him will die too.*\n\nRegrettable, but unavoidable. Sam Dasoo worried about arriving late for the execution and urged the guards forward. Han Seokbong kept glancing backward, concern for Sua and Grid etched into every line of his face.\n\nThen—\n\n*Kurururung!*\n\nThunder crashed from atop the Lava Prison.\n\n\"What?\"\n\nSam Dasoo whirled around. Part of the prison's roof had been obliterated by magical bombardment.\n\n\"What is this?\"\n\nThe intruder was actually *winning* while fighting a black-horse jiangshi? Sam Dasoo swallowed nervously, his earlier confidence evaporating.\n\n*Duk!*\n\nSomething bounced down the prison steps like a ball, rolling across the ground before stopping at Sam Dasoo's feet.\n\nThe severed head of the black-horse jiangshi stared up at him with lifeless eyes.\n\n\"H-Hik...!\"\n\nThe color drained from Sam Dasoo's face."
}