{
  "id": 64,
  "title": "Chapter 64",
  "content": "# Chapter 64\n\nThe money I'd earned bought my family a reprieve from disaster. By paying the overdue interest my father's friend left behind when he ran like a coward, I'd kept the loan sharks from seizing what little we owned.\n\n\"Hum hum hum~\"\n\nMy mother hummed as she walked, her expression bright for the first time in months. Sehee held her hand, the two of them moving together through the afternoon sun. I watched them, something tight in my chest loosening at the sight.\n\nMy father spoke beside me. \"I'm indebted to my son. I'm sorry.\"\n\n\"Indebted? Why are you saying that to me?\"\n\n\"...Hey.\" He stared at the ground. \"This is a matter of a man's pride.\"\n\nI opened my mouth, then closed it. *Somehow, I think I understand.* My father draped an arm over my shoulders, the weight of it unfamiliar but not unwelcome.\n\n\"The immediate crisis is over, so don't worry about what comes next.\" His voice was firm. \"Your mother and I will work hard. We'll pay off the remaining debt within three years. I'll also repay the 240 million won I borrowed from you. We're capable of at least that much.\" He squeezed my shoulder. \"So stop worrying and do what you want to do. You're 26. One of the most important periods in your life. I'll make sure your path is clear, so do your best. If the path you've chosen is playing a game... try to be the best there. I'm cheering you on.\"\n\n*Six hundred million won.* The number sat in my gut like a stone. Even if my father didn't like it, I would help him whether he wanted it or not. This was atonement for being a useless son.\n\nBut first, I had to clarify something.\n\n\"Father.\" I met his eyes. \"I gave you 240,800,000 won. Not 240 million. Don't forget the 800,000 won.\"\n\n\"...\"\n\nThe sky overhead was blue. My heart felt the same shade of melancholy. The useless son was transforming into someone dependable after obtaining a legendary class and crafting a legendary item. I felt fulfilled watching myself grow.\n\n*...Though I still haven't escaped the debt.*\n\n*I'll skip the reunion this year.*\n\n***\n\nWinston's streets buzzed with nervous energy.\n\n\"Did you hear?\" A woman clutched her basket tighter. \"The Yatan Temple defeated our troops again. Captain Phoenix was seriously injured...\"\n\n\"No way.\" Her companion's voice rose. \"Captain Phoenix is the strongest knight! He lost, even leading the army himself?\"\n\n\"They're saying the opponent was one of the Seven Servants.\"\n\n\"W-What? Did Winston anger the Seven Servants? What'll happen to us?\"\n\n\"Ah... we barely escaped the Mero Company's grip, and now this...\"\n\nThe discovery of a Yatan Temple in Winston's outskirts had set everyone on edge. Lady Irene had dispatched troops three times to eliminate it. Three times they'd failed. The enemy was supposedly one of the Seven Servants, the kind of figure parents invoked to make children behave.\n\nHonestly? I didn't care.\n\n*That story has nothing to do with me.*\n\nI left the anxious residents behind and pushed through Khan's door. The familiar smell of iron and coal smoke washed over me. I sat on the bench and pulled up my inventory, eyeing the 20,000 gold remaining from my sales.\n\n*Big profits come from high-rated items. But if something comes out normal rated, I'll take massive losses.*\n\nThe Legendary Blacksmith's Craftsmanship Skill and Legendary Blacksmith's Breath could boost an item's stats by 19%. But that math fell apart if I produced a level 160 normal rated item that nobody wanted to buy.\n\nMaking items with sky-high requirements wasn't always profitable.\n\n*I need something that won't destroy me even if it comes out normal rated.*\n\nReality was harsh. Most of what I made came out normal. I had to accept that and plan accordingly. A level 140 item would still turn a profit even at normal rating.\n\n*I have to pay off this debt quickly.*\n\nSix hundred million won plus monthly interest. I needed to work like a dog. I pulled up my status window, reviewing my progress.\n\n---\n\n**Name:** Grid  \n**Level:** 45 (3,400/238,000)\n\n**Class:** <span class=\"rarity-legendary\">Pagma's Descendant</span>  \n* The probability of adding additional options when making items will increase.  \n* The probability of item enhancement will increase.  \n* All equipment items can be worn unconditionally. However, there is a penalty depending on the rating of the item.\n\n**Title:** One who Became a Legend  \n* Abnormal conditions don't work well on you.  \n* You won't die when health is at the minimum.  \n* Easily acknowledged.\n\n**Title:** First Unique Item Maker  \n* Dexterity +200\n\n**Title:** Only Legendary Item Maker  \n* Dexterity +350\n\n**Title:** Knight Slayer  \n* Stamina +100  \n* Strength +30\n\n**Title:** Apostle of Justice  \n* All stats +10  \n* The Apostle of Justice's bravery is unmatched.\n\n**Health:** 5,682/5,682 **Mana:** 504/504\n\n**Strength:** 393 **Stamina:** 411 **Agility:** 195 **Intelligence:** 168  \n**Dexterity:** 838 **Persistence:** 190  \n**Composure:** 143 **Indomitable:** 162 **Dignity:** 143 **Insight:** 143  \n**Courage:** 87\n\n**Stat Points:** 0  \n**Weight:** 842/11,660\n\n---\n\nAll my stats had climbed dramatically after producing various <span class=\"rarity-epic\">epic</span> items and one <span class=\"rarity-legendary\">legendary</span> piece. Dexterity and persistence had skyrocketed during the grinding process of hammering out item after item.\n\nI'd surpassed a level 80 warrior's stats ages ago. The thought of hunting pulled at me like a fish hook in my gut.\n\n*With these stats and the Ideal Dagger... I could easily hunt level 100 monsters after making a few armor pieces.*\n\nSwinging a sword at monsters. Watching items drop. Experience flooding in, pushing my level higher. That rush, that pure excitement of character progression. I hadn't felt it in months.\n\n*...Forget it. I need money.*\n\nI picked up a hammer instead of a sword. The same old hammer I'd been using for months, its handle worn smooth by my grip.\n\n*The durability's dropping faster now. Should I make a new one?*\n\nI didn't have a production method for hammers, but I could figure something out with my current capabilities. I loaded iron into the furnace.\n\nKhan glanced over from his workbench. \"What are you making this time?\"\n\n\"Hammer.\"\n\n\"Huh?\"\n\n\"A hammer.\" I checked the furnace temperature.\n\n\"Huh...?\" Khan set down his tools. \"Are you going to use the hammer you're making?\"\n\n\"Yes.\"\n\nI nodded. Khan's face twisted with confusion.\n\n\"You've been using that hammer for months. I thought there was some special story behind it...\"\n\n\"Story?\" I frowned at him. \"There's nothing like that. It's the only hammer I have, so I used it. No special meaning.\"\n\n\"Then why didn't you make a new hammer sooner?\"\n\n\"What? Why are you shouting all of a sudden?\"\n\nKhan stood up, his stool scraping against the floor. \"There are four critical things when making battle gear! First! Outstanding technique. Second! The materials. Third! Patience and devotion. Fourth! A hammer with good performance.\" He pointed at my worn tool. \"But you've been using that garbage hammer for no reason! This is ridiculous!\"\n\n\"...What?\"\n\nI pulled up the hammer's information.\n\n> **[Blacksmith's Hammer]**  \n> Durability: 50/70 Attack Power: 18~25  \n>   \n> A hammer used by a blacksmith to make items, but it can also be used as a weapon.  \n>   \n> Conditions of Use: None.  \n> Weight: 60\n\nThe hammer I'd picked up in Bairan Village. No special features, nothing remarkable. I'd assumed all production hammers were basically identical. Khan's reaction said otherwise.\n\nI activated my appraisal skill on his hammer.\n\n\"Legendary Blacksmith's Appraisal.\"\n\n> **[Legendary Blacksmith's Appraisal]**\n> \n> The blacksmith who becomes a legend appraises items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.\n\n> **[<span class=\"rarity-rare\">Excellent Blacksmith's Hammer</span>]**  \n> Rating: <span class=\"rarity-rare\">Rare</span>  \n> Durability: 166/250 Attack Power: 40~50  \n> Odds of Making a Rare Rated Item: +10%  \n>   \n> A blacksmith hammer that Khan inherited from his father. It can still be used daily because he maintains it carefully.  \n>   \n> User Restriction: Level 80 or higher. More than 60 strength. Intermediate Blacksmith skill.  \n> Weight: 80\n\n> [A hidden function doesn't exist.]\n\n> [You have grasped the materials that make up the Excellent Blacksmith's Hammer, the production method, and the intentions of its creator.]\n\n> [Your understanding of the Excellent Blacksmith's Hammer is now at 100%.]\n\n> [You have learned how to make the Excellent Blacksmith's Hammer.]\n\n\"Wow...\"\n\nMy stomach sank. Hammers had ratings and options too. If I'd known, I would've thrown that garbage away months ago and made an <span class=\"rarity-epic\">epic</span> rated hammer immediately.\n\n\"I thought production hammers were all the same.\" I glared at Khan. \"Why didn't you tell me hammers mattered? How long were you planning to watch me use that piece of junk?\"\n\nKhan held up his hands, looking embarrassed. \"You're Pagma's Descendant. I never imagined you wouldn't know the basics... Like I said, I thought you were using the old hammer because it had some special meaning...\"\n\n\"Ugh!\"\n\nThis wasn't the time to blame him. I turned back to the furnace and got to work. Normal rated hammers emerged from my first attempts, sweat dripping down my back as I repeated the process. On the sixth try, something better took shape.\n\n> **[<span class=\"rarity-epic\">Unknown Blacksmith's Hammer</span>]**  \n> Rating: <span class=\"rarity-epic\">Epic</span>  \n> Durability: 350/350 Attack Power: 70~80  \n> Odds of Making a Rare Rated Item: +17%  \n> Odds of Making an Epic Rated Item: +7%  \n>   \n> A blacksmith's hammer made by a craftsman with great skills and potential, but his experience and reputation is somewhat lacking.  \n>   \n> This is a hammer produced by the craftsman himself, so it isn't suitable for other blacksmiths to use.  \n>   \n> Conditions of Use: Pagma's Descendant  \n> Weight: 80\n\n*Because I designed it specifically for myself?* Only Pagma's Descendant could use it. Out of two billion Satisfy users, this hammer belonged to me alone.\n\nThe options weren't spectacular compared to the exclusive restriction, though.\n\n*If it's only for Pagma's Descendant, shouldn't it boost the rate of unique and legendary items...? Stingy game. Wait. Did the description just change?*"
}