{
  "id": 640,
  "title": "Chapter 640",
  "content": "The Rune of Darkness—an item Grid had claimed during the event triggered by accepting Braham's soul. It dropped from Tallos, the agent of Amoract, the First Servant.\n\nTallos was no small threat. As the chosen agent of a Great Demon, he possessed devastating power, cruelty, and versatility. The Yatan Church's spread across the West Continent? That was purely his accomplishment.\n\nEven now, Grid would stand no chance against Tallos in a fair fight. But Braham had demonstrated his true overwhelming strength during that event, reducing Tallos to nothing more than an insect beneath his boot. A handful of Magic Missiles and Fireballs—that's all it took for Braham, with his 15,580 Intelligence, to obliterate the demon's agent.\n\nThe point was simple: the Rune of Darkness wasn't something obtained through conventional means. Who else could acquire an item that only dropped from Tallos? If Grid hadn't accepted Braham's soul... if he hadn't gained the second class of Legendary Great Magician, he wouldn't have even known runes existed.\n\n'Among two billion players, only a handful possess runes. In Overgeared, I'm the only one.'\n\nGrid suspected that eventually, runes would determine the hierarchy of power. Those who secured them early and accumulated strength within them would surge ahead of everyone else.\n\n'Agnus has probably accumulated more power in his rune by now.'\n\nAnd not just Agnus. Anyone Lauel classified as sun-grade had likely secured a rune already. He couldn't rule out the possibility of runes superior to the Rune of Darkness. Yet Grid remained confident. Even if more players possessed runes than he expected, his had an advantage no one else could match.\n\nWhy?\n\n'Because I've already absorbed the strength of a Great Demon.'\n\n[Rune of Darkness]\n\nBound Item.\n\nPermanently preserved in your inventory. Trading, dropping, or destroying it is impossible.\n\n**Usage Effect:** Demonic power state will rise in exchange for its use.\n\n* Normal attacks and skill attacks will deal an additional 20% dark damage.\n\n**Unique Lasting Effect:** When dealing with named demonkin and demons, you can absorb unique attributes.\n\n* **Tiramet's Power:** If your health drops below 10%, health will be restored to 30% in an instant. Cooldown Time: 12 hours.\n\n* **Latina's Power:** The 'Can you Become the King of the Dead?' skill is generated.\n\n★**Special**★\n\n**32nd Great Demon Belial's Power**\n\n*The queen of darkness who terrorizes the world.*\n\n*The queen of flame burns the world.*\n\n*The queen of lies ruins the world.*\n\nThe ultimate strength, now expressed through the rune itself. The power of a hell monarch, channeled through Grid.\n\n\"Activate Belial's Power.\"\n\n**KWAAAAANG!**\n\n\"...!\"\n\n\"?!\"\n\nNoe, collapsed from the black-horse jiangshi's blow. Iyarugt, restraining the creature's movements. The black-horse jiangshi, adapting to Iyarugt and improving its evasion. Sua, watching the deadly exchange between demon sword and undead.\n\nAll of them turned to Grid as one. The magic erupting from his body was absurdly powerful. Grid met the black-horse jiangshi's eyeless gaze and smiled darkly.\n\nRed, black, and intense—the magic wrapped around him like a comet blazing through the night.\n\n[The power of Great Demon Belial sealed in the Rune of Darkness has been released!]\n\n[It is impossible for humans to digest all three of Belial's powers.]\n\n[Your body feels a great burden. You have lost 35% of your maximum health.]\n\n[You have fallen into the 'weak' state.]\n\n[You have resisted.]\n\n[Your health has dropped below 10%. Tiramet's Power belonging to the Rune of Darkness is activated.]\n\n[30% of your health has been restored.]\n\n[You have lost more than 70% of your maximum health. The First King title effect is activated.]\n\n[A protective shield containing the health that was lost in the last minute has been created. As the shield continues, terrain adaptability will increase by 100% while movement speed and defense will increase by 10%.]\n\n[As a human, you can use only one of Belial's three powers: darkness, fire, or deception.]\n\nGrid had already tested Belial's power several times since the raid.\n\nFire granted him the Fire Queen passive—stamina consumption eliminated, recovery speed increased by 300%, fire resistance at 100%. Against flames weaker than hellfire, he might even regain health. It also unlocked Queen's Flames of Hell and Flames of Hell Path. High persistence, explosive damage.\n\nDarkness made demonkin non-hostile. Mana regeneration increased by 300%, dark magic resistance at 100%. It provided Queen's Provocation and Path of Darkness—perfect for magic-heavy combat and debuffs.\n\nDeception produced only Queen's Distortion, but utilizing that distortion magic required exceptional control and power. Grid lacked both.\n\n\"Besides, fire will be fatal for you.\"\n\nSince entering the Lava Prison, Grid's health had hovered at 40%, keeping the First King title primed. The penalty from activating Belial's Power? Negated by Tiramet's Power. Simultaneously, the First King effect triggered, creating a powerful shield.\n\nIn this state—\n\n**HWARURUK!**\n\nFlames engulfed him from head to toe. Red light flickered across his eyebrows and hair.\n\n[You have selected the power of fire!]\n\n[The passive skill Fire Queen is applied for two minutes while Belial's Power is maintained. You can also use the Queen's Flames of Hell and Flames of Hell Path.]\n\n[Queen's Flames of Hell]\n\nWild magic that symbolizes the fire queen.\n\nPowerful flames will damage your target. The amount of damage is proportional to the user's powerful blow and the maximum health of the target.\n\n**Skill Mana Consumption:** 90% of your maximum mana.\n\n**Skill Cooldown Time:** 10 minutes.\n\n[Flames of Hell Path]\n\nAn afterglow remains on the path that the queen of fire walks.\n\nDuring the duration of the skill, the flames on your body will cause 'burns.' When using physical attacks and skills, fire damage is added. Fire damage is proportional to your strength and intelligence.\n\n**Resource Consumption:** Lose 250 health and 60 mana per second while it is activated.\n\n**Skill Cooldown Time:** 5 seconds.\n\nGrid chose fire for one simple reason: the black-horse jiangshi's nature. Despite Iyarugt landing multiple strikes, the creature showed minimal damage. Its physical resistance was enormous.\n\n'But its magic resistance is weak!'\n\nHe would incinerate it. Grid unleashed the Queen's Flames of Hell.\n\n**KURURURUNG!**\n\n\"Ugh...!\"\n\nSomething vital tore from his body as the spell activated. When massive amounts of mana were consumed instantly, mana rampage could occur. But Grid weathered it.\n\n[You have resisted.]\n\nThe characteristic of Pagma's Descendant saved him.\n\n**KWAAAAANG!**\n\nFlames poured over the black-horse jiangshi like a crimson waterfall. No scream escaped the creature—it felt no pain.\n\n**Stagger.**\n\nThe wound was critical, obvious to anyone. Even with a boss monster's immense stamina stat, the Queen's Flames of Hell devastated its health.\n\n**KURURURUNG!**\n\nThe explosion around the black-horse jiangshi obliterated the remaining structure. The Lava Prison vanished without a trace.\n\n\"Kyaaak!\"\n\n\"Nyang!\"\n\nAs the ground collapsed, Sua and Noe lost their footing.\n\n'The sacred creature's paws!'\n\nSua grabbed Noe's feet, and for a moment, even falling through a collapsing prison, happiness flooded through her. Noe's paw pads felt *amazing*.\n\n**Teok!**\n\nGrid crossed the disintegrating ground, closing the distance to the black-horse jiangshi. The +9 Failure in his hand blazed.\n\n\"Pagma's Swordsmanship—\"\n\n**HWARURUK!**\n\nThe afterglow of flames surrounding Grid flared.\n\n\"Linked Kill!\"\n\n**KURURURUNG!**\n\nFailure pierced the black-horse jiangshi's body repeatedly.\n\n**Puk! Puk puk!**\n\n**Puuok!**\n\n[Critical!]\n\n[The effect of the title 'Death in One Shot!' has been activated, adding 30% critical damage!]\n\n[The weak spot has been attacked! Further damage will be dealt!]\n\n[Critical!]\n\n[The effect of the title 'Death in One Shot!' has been...]\n\n[The weak spot has been...]\n\n[Critical!]\n\n...\n\n...\n\nBlacksmith's Rage and the Rune of Darkness, both activated—his critical damage doubled, then doubled again. Already devastated by the Queen's Flames of Hell, the black-horse jiangshi crumbled beneath Grid's assault.\n\n\"Ohhhhh!\"\n\nHe needed to finish this before Belial's Power expired. Grid unleashed every technique of Pagma's Swordsmanship except Linked Kill Wave Pinnacle, which remained on cooldown. But the black-horse jiangshi's resilience proved formidable. Knowing neither pain nor fear, it counterattacked relentlessly. Grid abandoned defense, trading blow for blow to end the fight faster.\n\nBlood soaked the Slaughterer's Mask.\n\nThe result?\n\n**Seokeok!**\n\nThe black-horse jiangshi's health plummeted, and Failure's Bisect option activated. The creature's head separated from its body as both fell from the shattered prison. A thunderous roar echoed below.\n\n[The Chief Lava Prison Guard has been defeated.]\n\n[1,922,509,991 experience has been acquired.]\n\n[Your level has risen.]\n\n['Jiangshi Recipe' has been acquired!]\n\n[Jiangshi Recipe]\n\n<span class=\"unique\">Unique</span> rated skill.\n\nAn old booklet containing the recipe for a steel jiangshi.\n\n**Conditions of Use:** Daoist, necromancer.\n\n\"Ohh!\"\n\nA method to create jiangshi! This was a jackpot beyond imagination. If he could bolster the Overgeared Kingdom's lacking military strength with jiangshis...!\n\n'...Ah. We don't have any necromancers in the guild.'\n\nJoy and disappointment struck simultaneously. But he couldn't dwell on it—Han Seokbong's life was at stake.\n\n\"Fly.\"\n\nAs Belial's Power expired, Grid swapped to Braham's Boots and soared from the prison, Sua and Noe secured in his arms.\n\n**KURURURUNG!**\n\nGrid's party escaped the completely collapsed Lava Prison. Lava erupted everywhere, but the greater threat was the ash. The city of Kars in the Cho Kingdom turned gray.\n\n\"This crazy bastard...! What the hell is that lunatic doing?\"\n\nSam Dasoo screamed and fled as the black-horse jiangshi's severed head crashed down nearby. He tried to drag Han Seokbong's rope, but a black-haired man with a muscular frame and broad shoulders blocked his path. The beauty Sua, covered in ash, rested in his arms.\n\n\"Father!\"\n\n\"Sua!\"\n\nHan Seokbong and Sua's reunion was immediate.\n\n\"Who the hell are you? What cowardly trick did you use to kill the black-horse jiangshi?!\"\n\n\"I am the king of the Overgeared Kingdom.\"\n\n\"...What?\"\n\nSam Dasoo's first encounter with Grid couldn't have gone worse.\n\nMeanwhile, in the VIP room of the palace—\n\n\"What was that sound?\"\n\nThe luxuriously dressed yangbans sensed the disturbance, their leisurely rest interrupted."
}