{
  "id": 641,
  "title": "Chapter 641",
  "content": "\"That came from the Lava Prison's direction.\"\n\nThe yangbans pinpointed the explosion's source instantly. Given the distance between the royal palace and the prison, their hearing transcended human limitations entirely.\n\n\"Why would there be an uproar in the capital? Are we at war?\"\n\n\"Impossible.\"\n\nEvery kingdom knew the yangbans were currently in Kars. None would dare provoke a disturbance. The fate of those who showed disrespect to the yangbans was well-documented—and terrible.\n\n\"Han Seokbong is imprisoned in the Lava Prison. Most likely, someone's attempting a rescue.\"\n\n\"Hoh... Brave of them.\"\n\n\"Brave or desperate. Han Seokbong and his daughter are nobility in Cho Kingdom. They have followers.\"\n\n\"Mm. Wasn't there a black-horse jiangshi guarding that prison? Who in Cho Kingdom could possibly defeat such a creature?\"\n\n\"The Cho King's Ten Swords, perhaps.\"\n\n\"The Ten Swords?\" The yangban's eyes narrowed. \"But the Cho King himself ordered Han Seokbong's execution. Why would his confidants betray that order? Unless...\" Understanding dawned. \"Ah.\"\n\n\"Precisely. The Cho King's affection for Han Seokbong is well-known.\"\n\nThe Cho King had announced the execution only to appease the yangbans. Of course he would scheme to save Han Seokbong behind their backs.\n\n\"So the Cho King orchestrates a rescue while pretending innocence?\" The most lavishly dressed yangban rose, his lips curling into a cold smile. \"Kukuk... That fool dares deceive us?\"\n\nKwaduduk!\n\nGaram's fingers cracked as he clenched his fists. Among the yangbans, he was notorious for his rigid sense of superiority. Any slight against their dignity demanded punishment. Human lives—all lives beneath the yangbans—were expendable.\n\n\"I'll make the Cho King weep tears of blood.\"\n\nThe two remaining yangbans watched Garam stride toward the door.\n\n\"Do what you wish, but remember—this isn't the Hwan Kingdom. Maintain our dignity before the common people.\"\n\n\"Naturally.\"\n\nGaram stormed into the great hall, only to find it empty.\n\n\"His Majesty departed for the execution grounds,\" a servant explained nervously. \"As you know, it's Han Seokbong's scheduled execution...\"\n\n*He orchestrates the rescue while maintaining his facade of compliance?*\n\nGaram's eyes narrowed. Cunning. He launched himself skyward, his blue robes snapping in the wind. His vision—sharper than any hawk's—locked onto the Lava Prison in the distance.\n\n\"How delightful if this rescue fails. Kukukuk!\"\n\nPahat!\n\nHe vanished, a blur against the ash-gray sky.\n\n***\n\n\"Overgeared...? Overgeared King?\"\n\nSam Dasoo stared at Grid in incomprehension. What did \"overgeared\" even mean? But he understood \"king\" well enough. As did Han Seokbong and Sua.\n\n\"King?\" Han Seokbong's voice cracked. \"Grid, you're a king now?\"\n\n\"Ah.\" Grid blinked. Right. He'd never mentioned that detail. When he'd first arrived on the East Continent, he'd been preoccupied with... well, everything. But now? He trusted the Han Seokbong father and daughter completely. They'd worried for him even facing their own deaths. That kind of righteousness couldn't be faked.\n\n*People reveal their true nature before death. These two are nothing like me.*\n\nGrid smiled. \"That's right. I'm a king.\"\n\nSilence.\n\nHan Seokbong's face turned to stone. Sam Dasoo's expression twisted with horror. Only four rulers on the continent could claim the title of king—and Grid wasn't among them. Which meant...\n\n\"Oh my god...\"\n\nA barbarian king had saved them.\n\nHan Seokbong went pale. Sam Dasoo thrust an accusing finger. \"Han Seokbong, you're filthy! Pretending to be righteous on the surface, yet consorting with a barbarian king! You'll be damned for this!\"\n\n*Barbarian king?*\n\nGrid frowned at their reactions. \"Barbarian? Is that what you call people from the West Continent?\"\n\n\"?!!\"\n\n\"!!!\"\n\nAll three of them froze. Sua's eyes widened.\n\n\"You're... from the West Continent?\"\n\n\"Yes.\"\n\nSam Dasoo laughed—a high, desperate sound. \"You're lying! Trying to hide that you're a barbarian! Crossed the Red Sea? That's nonsense! Hup!\"\n\nHis voice died mid-shout. Grid's gaze had sharpened, predatory and cold. This was the monster who'd killed a black-horse jiangshi. Sam Dasoo's hand flew to his throat protectively.\n\nHan Seokbong exhaled slowly, relief flooding his features.\n\n\"I see... You truly are from the West Continent.\"\n\nThe two continents had been isolated for centuries, separated by the cursed Red Sea. Yet historical records mentioned rare occasions when Westerners washed ashore, rescued from those deadly waters.\n\n\"Grid was shipwrecked...\"\n\nSua gazed at him with sympathy, as if he were a lost traveler far from home.\n\nGrid chuckled. \"Not quite. I came here deliberately. And I have a way back.\"\n\n\"...!!\"\n\nImpossible. For thousands of years, the two continents had existed in total isolation. Yet Grid spoke of traveling between them as casually as crossing a river. Sam Dasoo's mind reeled.\n\n*If this is true... the implications...*\n\nThen reality reasserted itself—he was supposed to be dragging Han Seokbong to the execution grounds. But how could he possibly fight this monster?\n\nGrid, meanwhile, frowned at his quest log.\n\n*Why hasn't it cleared?*\n\nThe quest required rescuing Han Seokbong and Sua unharmed. He'd done that. So why—\n\n*Ah. I need to get them out of Kars safely.*\n\n\"Let's go,\" Grid urged. \"We're exposed here. It's dangerous.\"\n\nHe expected them to follow. Han Seokbong pulled his hand back.\n\n\"I can't leave.\"\n\n\"What?\"\n\n\"I'm on death row because I disappointed the yangbans of the Hwan Kingdom.\" Han Seokbong met Grid's eyes steadily. \"They demanded the location of the master craftsman who created the Red Phoenix Bow. I couldn't give them an answer.\"\n\n\"They're looking for me? Why?\"\n\n\"Your reproduction surpassed the original. They're intrigued. I'd hoped...\" Han Seokbong smiled sadly. \"I'd hoped you might befriend them. But now, knowing you're from the West Continent...\" He shook his head. \"They won't react well.\"\n\nGrid grimaced. That tracked. Yangbans who dominated the East Continent wouldn't welcome a Westerner outshining them. His brief encounter in Pangea had already left a sour taste.\n\n\"All the more reason to leave.\" Grid extended his hand. \"Come with me.\"\n\n\"I cannot.\"\n\n\"What? Why not?\"\n\n\"If I flee with you, the yangbans will punish the entire Cho Kingdom.\" Han Seokbong's voice remained calm, resigned. \"I'll stay. Be executed as scheduled. Just... please. Take my daughter.\"\n\n\"You can't be—\"\n\n—*Run. Now.*\n\nBraham's voice cut through Grid's thoughts, sharp and urgent in a way it rarely was.\n\n\"What? Why?\"\n\n—*Someone beyond your capability is approaching.*\n\n*What?*\n\n—*Che. Too late. Use Assimilation.*\n\n*What are you talking about?*\n\nGrid's confusion cost him the moment. A voice drifted down from above.\n\n\"Hrmm? You're not one of the Ten Swords?\"\n\n\"....!!\"\n\nGrid's head snapped up. A blue-robed figure hovered in the sky, gazing down at them with casual curiosity. The clothing, the bearing, the overwhelming presence—it all resembled Pagma.\n\n\"You...!\"\n\nThe yangban from Pangea.\n\n*No. No, not now.*\n\nGrid's pulse hammered in his ears.\n\n\"Hrmm. You look familiar.\"\n\nGaram tilted his head, studying Grid with mild interest.\n\n\"Ah. The man I saw in Pangea. I remember now—that stench clinging to you.\"\n\nThe stench...?\n\n\"Pagma's scent. Kukuk, I see.\" Garam's smile widened. \"It was you. You recreated the Red Phoenix Bow.\"\n\n[You have an urge to bow.]\n\n[You have resisted.]\n\n\"Are you Pagma's Descendant?\"\n\nDuguen!\n\nGrid's heart slammed against his ribs."
}