{
  "id": 642,
  "title": "Chapter 642",
  "content": "The Hwan Kingdom—a pillar that held up the entire continent, a realm that dwelt beneath the heavens themselves. Ever since that fateful day when a singular child was born in what history dismissively called the 'small kingdom,' the Hwan Kingdom had dominated the continent. But why? Why should the yangbans rule? What gave them the right to divide humanity into two castes—the exalted and the expendable?\n\nOne child had dared to question what everyone else accepted as natural law.\n\n\"That kid's name was Pagma.\" Garam's voice carried the warmth of reminiscence. \"He was a fool who believed all humans were equally precious.\"\n\n\"...\"\n\nThe yangban looked genuinely happy as he wandered through his memories, a smile playing across features so delicate they might have been carved by a master sculptor. Those long, half-moon eyes would have been beautiful on anyone else—but on this man, they only fueled Grid's irritation.\n\n'Damn bastard.'\n\nGrid bristled at Garam's ethereal beauty. Not that it mattered—the yangban had shown zero goodwill from the moment he appeared. That smile was a facade. The eyes told the real story, and they looked at Grid like he was something that had crawled out from under a rock.\n\n\"That fool Pagma reached his peak when it came to useless non-combat skills.\"\n\nEver since he'd appeared, Garam had spoken of Pagma with casual dismissal, as if discussing a mediocre servant. Surprisingly, Grid felt no offense on the legendary blacksmith's behalf. He'd never met Pagma. Why should he care if some arrogant yangban badmouthed the man?\n\nBut something in those words caught his attention.\n\n\"Useless non-combat skills...\" Grid's eyes narrowed. \"Are you talking about blacksmithing?\"\n\nHe had no personal attachment to Pagma the man. But Pagma's techniques? Those, Grid respected. Those, he took pride in having mastered. Blacksmithing wasn't just his job—it was the blessing that had transformed his miserable life. And this bastard had just called it useless.\n\nGaram met Grid's glare with amusement.\n\n\"Indeed. What, are you glaring at me?\"\n\n\"...I apologize. I got carried away for a moment.\"\n\nThe words left Grid's mouth before his pride could stop them. Instinct had taken over—the instinct that recognized Garam as leagues beyond his current strength. Most of his buff skills were still on cooldown, Belial's Power included. He couldn't afford to make an enemy of this man.\n\n'I'm not groveling because I'm afraid to die,' Grid told himself. 'I just need to stay polite long enough to learn more about Pagma.'\n\n—Who are you trying to convince?\n\n'...Don't misunderstand. I'm not being subservient.'\n\n*Kwaduduk!*\n\nGrid's teeth ground together as he made excuses to Braham, each word a knife twisting in his chest. The shame of it dragged up memories he'd tried to bury—all those times he'd been too weak to stand up to the strong. The disgust rose like bile in his throat.\n\n'Idiot. I swore I'd never bow my head again. This pathetic nature of mine—it's garbage. Pure garbage.'\n\nBraham's voice cut through his self-loathing.\n\n—There's no shame in showing caution before superior strength. Even beasts fear predators that outmatch them. Are you supposed to be less sensible than an animal? You're not an idiot.\n\n'...'\n\n—But don't yield to absurdity. If someone insults you and makes unreasonable demands simply because they're strong, then be prepared to die rather than submit. Weakness that forces you to discard your pride? That's not survival—it's surrender. Though I'll admit, I killed everyone who was weak and still tried to oppose me.\n\n'...'\n\nDespite the arrogance woven through Braham's advice, Grid found himself relaxing. The shame evaporated. He wasn't weak—he was being strategic. There was a difference.\n\nGaram continued as if Grid's internal crisis had never happened.\n\n\"But surprisingly, that useless skill proved valuable. Once Pagma learned blacksmithing, the yangbans of the Hwan Kingdom enjoyed far more convenient lives. His tools exceeded anything else available in quality.\"\n\n*Suuk.*\n\nGaram reached into his robes and produced a smoking pipe—white, refined, with lines so smooth they seemed to flow like water.\n\n\"This pipe? Pagma crafted it from white phosphorus wood.\" A low chuckle. \"Every time I smoke from it, I think of him. The Pagma who ran away like a coward. I recall the memories of tormenting him quite fondly.\"\n\n\"...\"\n\nThe legendary blacksmith made smoking pipes?\n\n'Just how powerful are these yangbans if they could treat Pagma like a servant?'\n\nPagma had defeated a great demon after becoming Baal's Contractor. Even accounting for the fact that great demons couldn't manifest their full power on the surface, that achievement placed Pagma among the elite of combat legends. Yet this man spoke of him like a particularly useful dog.\n\n'Is this even the same Pagma I inherited my class from?'\n\nThe question had barely formed when—\n\n\"Hoo.\"\n\nGaram lit the pipe. He inhaled deeply, then exhaled, wreathing his face in smoke—a complete dismissal of Grid's presence.\n\n\"Yes, Pagma was an extremely convenient laborer. Many yangbans regretted his flight from the kingdom. How fortunate that a successor to his techniques has appeared.\"\n\nGaram's eyes traveled over Grid like he was appraising livestock. Or perhaps a particularly ripe fruit ready for harvest.\n\n\"I'll take you to the Hwan Kingdom. I don't believe the pure air there will decay just because one ignorant person takes up residence. Kukuk.\"\n\n'This son of a bitch.'\n\nGrid's patience snapped. The cowardice evaporated, burned away by the fury that was far more natural to his character. Subservience had never been part of Grid's nature.\n\n'What did he just decide?'\n\nThe fear vanished from Grid's eyes, replaced by naked anger. His hands clenched into fists.\n\n\"How dare you mock the greatest techniques in the world? You think I'll just nod and follow you, you XX? You think I'll sit here and take this?\"\n\nThe words were halfway to his lips when—\n\n—Calm yourself. Keep talking to him.\n\nBraham's command froze Grid's outburst. The great magician wanted more information about Pagma.\n\nEven after everything, even after Pagma's betrayal, he'd been a friend once. At least for a time.\n\n'Tch.'\n\nGrid swallowed his rage. He understood Braham's perspective, and honestly, his own curiosity was burning just as hot. The more he learned about Pagma, the closer he'd get to understanding his class quests and hidden pieces. He forced down his anger and spoke through clenched teeth.\n\n\"I'm curious why Pagma fled the Hwan Kingdom. What happened? And another thing—you look about my age. How can you possibly share a timeline with someone as ancient as Pagma?\"\n\nSam Dasoo answered before Garam could speak.\n\n\"You insane fool! What right do you have to question a great yangban?! They can deflect the very passage of years!\"\n\nThe man had been prostrate since Garam appeared, but now he lifted his head, foam flecking his lips, eyes wild with the fervor of a true believer.\n\n'Deflect the years?'\n\nWere they gods, then?\n\nBraham's whisper cut through Grid's confusion.\n\n—Impossible. Pagma aged like any mortal. Time wasn't kind to him.\n\n'So this Garam bastard is full of it?'\n\nThe questions were piling up faster than Grid could process them. Then Garam spoke, and the confusion only deepened.\n\n\"Why did Pagma run? Simple. He became disillusioned with his own weakness and couldn't bear the shame of it.\"\n\n\"Weakness?\" Grid blinked. \"The legendary blacksmith Pagma?\"\n\n\"Yes. He was ashamed of how helpless he truly was. He failed the yangban's Chiyou Test and fled rather than face his inadequacy.\"\n\n\"Chiyou Test?\"\n\n\"A demonstration of martial prowess. Armed combat capability.\"\n\n\"Martial prowess...\"\n\nHow difficult could this test be that someone as powerful as Pagma failed it? Garam's next words shattered Grid's understanding entirely.\n\n\"Well, Pagma was famously weak.\"\n\n\"Weak?\"\n\n\"Indeed. His swordsmanship was nothing but cheap tricks.\"\n\n\"...\"\n\n\"Hmm, I've been lost in nostalgia too long. Time to depart for the Hwan Kingdom. I still have much to accomplish. Ah, but first...\"\n\nGaram's gaze shifted to Han Seokbong and his daughter. The temperature plummeted. Grid, Sam Dasoo, and the father-daughter pair all felt their hearts turn to ice. Because compared to the casual condescension Garam had shown Grid—this was different. This was the look of someone about to swat an insect.\n\nThey realized, in that moment, that Garam had been friendly to Grid.\n\n\"I should kill these people who dared deceive a yangban.\"\n\n*Suup.*\n\nGaram drew a deep breath. His mouth began to glow red.\n\n'No!'\n\nGrid knew the properties of white phosphorus wood. This was the precursor to explosion. But surely Garam's mouth would—no. This was a yangban. Common sense didn't apply.\n\n\"Pagma's Swordsmanship!\"\n\nGrid moved on pure reflex. To protect the Han Seokbong family. At the exact same instant—\n\n*Peeng!*\n\nFlames erupted from Garam's mouth, a stream of white fire lancing toward the father and daughter.\n\n\"Revolve!\"\n\n*Pepepepeng!*\n\nGrid materialized between them and the attack, sword spinning in a half-moon arc. The flames reversed, absorbed and redirected—\n\n\"Ah... Ahh...\"\n\n\"T-This...\"\n\nSam Dasoo and the Han Seokbong family turned pale as Garam vanished into a column of his own reflected fire. A yangban, wounded? Impossible.\n\n\"Use this opening. Run!\"\n\nGrid extended his hand to the father and daughter.\n\n\"Are you insane?\"\n\nGaram's whisper cut through the flames. His voice trembled—not with pain, but with volcanic rage.\n\n\"An ignorant worm dares to swing a sword at me? Do I seem easy to you?\"\n\n*Pahat!*\n\nGaram burst from the flames like a striking serpent. One hand still held the tobacco pipe. The other remained casually behind his back. Grid unleashed Pagma's Swordsmanship Link from Sword Ghost. Energy blades carved through the air—\n\n*Hwiririk!*\n\n*Peok!*\n\nGaram's body twisted with impossible grace. He slipped through the barrage as if the blades weren't even there. Then his palm struck Grid's forehead.\n\n[You have suffered 9,350 damage.]\n\n'What the hell?'\n\nThat was a basic attack?\n\n*Jiing.*\n\nThrough the haze of pain, Grid saw the smoking pipe in Garam's hand turn cherry red.\n\nHan Seokbong's panicked shout: \"Grid!\"\n\n\"...?\"\n\n*Peeeeong!*\n\n[You have suffered 25,310 damage.]\n\n[Severe damage to optical system. Vision impaired: Left Eye.]\n\n\"...?!\"\n\nThe explosion came too fast for Grid to even scream. Blood sheeted down from his ruined eye as he staggered backward. Garam's expression twisted into something ugly.\n\n\"That sword dance is pathetic.\"\n\nPagma's Swordsmanship—Grid's ultimate technique—dismissed as insignificant. The rage cleared Grid's mind like a bucket of ice water. Sword Ghost blurred through the air as Grid closed the distance.\n\n\"I can't tolerate this. Perhaps I should sever your legs to rid you of that spirit.\"\n\nGaram's memory of Pagma's Swordsmanship was that of a mediocre style, flashy but ultimately shallow. He felt no threat from Grid's sword dance. Saw no need to prevent the build-up.\n\nIt was a fatal miscalculation.\n\n\"Linked Kill Wave Pinnacle.\"\n\n\"...?!?!\"\n\nThis wasn't the Pagma's Swordsmanship that Garam remembered. This transcended everything the yangban thought he knew.\n\nGaram's eyes went wide with shock."
}