{
  "id": 643,
  "title": "Chapter 643",
  "content": "Every yangban possessed the intellect and strength to surpass anyone in the world—a necessity for beings meant to rule as absolute authorities. Yet Pagma's talent had never impressed his peers. His swordsmanship, for all its innovation, contained too many exploitable gaps.\n\nThe movements were large and telegraphed. He had to perform an elaborate dance before striking. Visually stunning, perhaps, but tactically worthless. At least, that was the common assessment when he first unveiled his technique. Despite relentless criticism, Pagma refused to surrender. Through countless iterations, he refined his sword dance until the very movements that seemed like weaknesses became tools for evasion and defense.\n\nHe turned disadvantage into advantage. But that was where his progress ended. The other yangbans' natural gifts far eclipsed his own. They instantly recognized when Pagma transitioned between defensive and offensive movements, exploiting the transitions with ruthless precision.\n\nPagma could never complete his sword dance against his fellow yangbans. Even when he managed to finish the sequence safely, it accomplished nothing. His focus on blacksmithing over swordsmanship left his physical abilities inferior to theirs. Their bodies could withstand his strikes with minimal injury.\n\nThe skill gap was insurmountable. In the end, Pagma became the first yangban to fail Chiyou's Test. Everyone mocked him.\n\n'Except for one person.'\n\nHanul, one of the Five Seniors, had seen Pagma's potential. If he could learn to connect multiple sword dances into a single fluid sequence, he might stand equal to his peers.\n\n'But Pagma never reached that level.'\n\nDespite his talent, Pagma never managed to properly link more than two sword dances. One day, he simply vanished from the Hwan Kingdom—seemingly fleeing in shame over his inadequacy. Yet now, at this very moment...\n\n\"Linked Kill Wave Pinnacle.\"\n\n'Four linked sword dances?'\n\nThis ignorant surface-dweller had surpassed Pagma's greatest achievement.\n\n'This ignorant... Disgraceful wretch!'\n\nThough Garam had dismissed and disliked Pagma, the man had still been a yangban. The idea that some uncultured foreigner could exceed him was intolerable.\n\n*Peeng!*\n\n*Pepeng!*\n\n*Pepepepeng!*\n\nVicious strikes targeted Garam's weak points in rapid succession. With his reflexes and perception, avoiding them would have been trivial. Instead, Garam met them head-on. Pride demanded nothing less.\n\n\"How dare you strike at me?\"\n\nTruly contemptible. This talentless fool dared to wound him?\n\n\"One born to defy the natural order! I refuse to acknowledge your existence!\"\n\nGaram roared and swung his smoking pipe to neutralize the attack. But—\n\n*Kwajajak!*\n\n'What?'\n\nGrid's strength exceeded his calculations. The moment the white phosphorus pipe contacted the blade, Grid's sword pierced Garam's chest.\n\n*Puok!*\n\n*Puk! Puk puk!*\n\nFour consecutive stabs tore into Garam. For the remaining three strikes, he abandoned his pride and dodged.\n\n'He evaded?'\n\nThat Garam could avoid such aggressive attacks sent chills down Grid's spine. Still, he didn't falter. He maintained absolute focus to complete Linked Kill Wave Pinnacle.\n\n---\n\n**[Linked Kill Wave Pinnacle]**\n\n*Four sword techniques executed in sequence.*\n\n*1,500% attack power delivered through Linked Kill.*\n\n*If the target is struck four times or more, Linked Kill damage increases by 200%, triggering Wave.*\n\n*Wave affects all enemies within a 5-meter radius, dealing 500% attack power and reducing all movement speeds by 30%. Additionally, guaranteed damage from Pinnacle follows.*\n\n*Pinnacle ignores 80% of target defense, dealing 1,800% attack power as physical damage.*\n\n*This skill does not share cooldowns with Link, Kill, Wave, or Pinnacle.*\n\n*Mana Cost: 50% of maximum mana*\n\n*Cooldown: 3 hours*\n\n---\n\n*Kwarururung!*\n\nGaram had failed to protect himself properly, allowing four clean hits. The residual energy from the strikes spiraled upward like an ascending dragon—the culmination of Wave following Linked Kill. While Linked Kill could be evaded, Wave was inescapable. The wide-area technique focused on a single target, leaving no room for evasion.\n\n\"Ugh!\"\n\nGaram's face contorted in agony.\n\n\"The yangban is...!\"\n\n\"Wounded...!\"\n\nSam Dasoo, Han Seokbong, and Sua went pale. They had never imagined a yangban could bleed. Their perception of Grid shifted fundamentally in that moment.\n\n'A king from the Western Continent...!'\n\n'The Overgeared King!'\n\nGrid's expression, however, remained grim as his attacks rained down on Garam.\n\n---\n\n[You have dealt 5,200 damage to the target.]\n\n[You have dealt 5,950 damage to the target.]\n\n[You have dealt...]\n\n...\n\n[Critical Hit!]\n\n[The target has resisted the critical.]\n\n[Critical damage negated.]\n\n[Target's movement speeds reduced.]\n\n[The target has resisted.]\n\n---\n\n'This monster!'\n\nThe power of Linked Kill Wave Pinnacle was enough to make even gods wary. Though Wave's base damage was relatively weak, the exponential scaling of Linked Kill Wave Pinnacle had dealt at least 30,000 damage to Great Demon Belial herself.\n\nYet Garam only took one-sixth of that. During the Belial Raid, Grid had wielded both Failure and Grid's Greatsword. Now he only held Sword Ghost. Even accounting for the weapon difference, Garam's physical resistance clearly surpassed Belial's. He could even nullify critical hits.\n\n'Yangbans are Legends...! They possess Legendary Classes!!'\n\nGrid couldn't win. But that didn't mean death was inevitable. Pinnacle was about to connect—the moment when Linked Kill Wave Pinnacle's true devastation would manifest.\n\n*Kurururung!*\n\nThunder crashed in Garam's ears.\n\n'This...!'\n\nAlarm flashed through Garam. He looked skyward and saw the massive energy blade descending.\n\n'I must stop it!'\n\nPinnacle was a guaranteed-hit technique. Realizing escape was impossible, Garam resolved to destroy it instead. He drew what appeared to be a silver flexible sword—an extremely thin, highly elastic blade that bent gracefully.\n\n*Hwiririk!*\n\nGaram swung the flexible blade dozens of times, each strike pursuing the descending Pinnacle. He believed he could neutralize Grid's attack. But Satisfy's system applied equally to players and NPCs alike. Pinnacle would 'definitely hit,' and Garam could not prevent it.\n\n*Sakak-!*\n\nGaram's robes tore. It was futile.\n\n\"Cough!\"\n\nGaram staggered backward, coughing blood.\n\n*Chukakakakak!*\n\nCrimson poured from Garam's smooth chest, now exposed through the torn fabric.\n\n\"Hurry!\"\n\nThe instant Linked Kill Wave Pinnacle concluded, Grid reached toward the Han Seokbong father and daughter. His eyes burned with urgency.\n\n\"Use this opening to escape! If we miss this chance, you'll both die!\"\n\n\"I-I...\"\n\nHan Seokbong hesitated. He had resolved to sacrifice himself so the Cho Kingdom wouldn't face the yangbans' wrath. But that sacrifice was now meaningless. A yangban had been wounded. Would his death truly appease Garam's fury? His sacrifice would accomplish nothing.\n\n'Forgive me, Your Majesty!'\n\nHan Seokbong silently apologized to the Cho King and grasped Grid's hand. Sua did the same. Sam Dasoo cried out with venomous hatred toward the fleeing trio.\n\n\"You fools...! You've condemned the Cho Kingdom to hell!\"\n\n\"...\"\n\nHan Seokbong despised the corrupt noble Sam Dasoo, who was slowly strangling the kingdom. He had denied everything the man stood for. But in this moment, he couldn't refute the accusation. It was undeniable—the Cho Kingdom would descend into crisis. Han Seokbong closed his eyes and heard Grid's whisper.\n\n\"Ally with my kingdom. Together, we'll grow strong enough to protect the Cho Kingdom.\"\n\n\"That... That's the only way I can atone.\"\n\nUnderstanding Grid's intent, Han Seokbong nodded. They began to run. They had to cover as much distance as possible while Garam recovered from his grievous injuries. But Garam was a yangban. A transcendent yangban.\n\n\"You ignorant wretch...! So you truly are that fool Pagma's successor! Youuuuu!\"\n\nThough Garam was a transcendent Named NPC, he was still humanoid. Compared to Belial, his health pool was far smaller. Grid's Linked Kill Wave Pinnacle had cost him approximately one-seventh of his total health—a testament to the technique's devastating power, given how far Garam's level exceeded Grid's own.\n\n*Peeng!*\n\nGaram closed the distance in an instant.\n\nShunpo.\n\nThe peak-level footwork mastered by all yangbans.\n\n\"I'll carve your body into a hundred pieces and feed them to the dogs!\"\n\nGaram's menacing declaration echoed as his blade targeted Grid's back. He never anticipated what came next.\n\n\"Linked Kill Wave Pinnacle!\"\n\n\"W-What?\"\n\nEven as Garam pursued, Grid activated Linked Kill Wave Pinnacle again. His luck had held—God's Command had triggered, resetting the cooldown.\n\n\"Kuaaaaak!\"\n\nGaram, caught completely off-guard, screamed as the technique struck him unprepared. Grid immediately switched to the Ideal Dagger, activated Quick Movements, and fled with Han Seokbong and his daughter.\n\n\"...\"\n\nSam Dasoo remained alone with the wounded Garam, trembling, unable to decide where to look."
}