{
  "id": 644,
  "title": "Chapter 644",
  "content": "**Why isn't he pursuing us?**\n\nGrid's pulse hammered in his throat. When the second Linked Kill Wave Pinnacle struck Garam, the yangban had absorbed only the first three hits before evading the rest—dodging the fourth strike meant Wave and Pinnacle never connected.\n\n*He took the initial impact head-on, then slipped past everything else...*\n\nA monster in human skin. Nothing about him suggested vulnerability in single combat. The wound hadn't been fatal. Grid had braced himself for immediate retaliation, prepared to burn through every resource at his disposal to buy Han Seokbong and Sua the seconds they needed to escape.\n\nYet Garam remained motionless. After evading strikes four through seven, he'd simply... collapsed.\n\n*Did the narrative system force him to break pursuit?*\n\nThe hypothesis made sense. Yangbans operated on a different power scale entirely—leagues beyond what any player could currently handle.\n\n*Either way, I'll take it.*\n\nThey'd made it out intact. With Garam still down, this window wouldn't stay open long.\n\n\"Run and don't look back!\"\n\n\"Yes!\"\n\n\"Understood!\"\n\nGrid and the father-daughter pair accelerated into the wilderness.\n\n***\n\n*Drip.*\n\n*Drip. Drip.*\n\nCrimson soaked into the dust—yangban blood, more precious than rain in drought season.\n\n\"...\"\n\nGaram lay crumpled where Grid's unexpected assault had dropped him. He remained eerily still. Sam Dasoo stared, mind racing.\n\n\"S-Sir Garam...?\"\n\nThe yangban didn't respond. Blood continued to pool beneath him in silence.\n\n*Is the injury preventing his regeneration?*\n\nImpossible. Yangbans didn't—\n\n*An ordinary human dealt a critical blow to a yangban... the Overgeared King... Are all the western rulers this formidable?*\n\nDread coiled in Sam Dasoo's gut at the thought of what might arrive from the West Continent. He swallowed hard and crept forward, reaching out to help Garam rise.\n\n\"Kuk...!\"\n\nGaram's shoulders shook.\n\n\"H-Hik!\"\n\nTerror lanced through Sam Dasoo. Was Garam *angry* with him? He squeezed his eyes shut.\n\n\"*Kuhahahaha!*\"\n\nLaughter erupted from Garam's throat. The chest wound had already sealed—vanished, as if it had never existed. The Red Phoenix's Breath granted yangbans regeneration that defied mortal understanding.\n\n\"So absurd my mind went blank for a moment. Kukuk... I let the rat slip away.\"\n\nGaram touched the torn fabric of his robe, then smoothly returned his flexible blade to its sheath. His movements were practiced, unhurried. As he straightened his clothing, the shredded material began knitting itself whole again—blue dragon scales woven into the fabric, restoration courtesy of the Blue Dragon's Breath.\n\n\"Hmm.\"\n\nOnce his appearance was pristine again, Garam turned his attention to Sam Dasoo. Killing intent blazed in those ancient eyes. Sam Dasoo's heart plummeted. His bladder released.\n\n\"What you witnessed today—you will speak of it to no one.\"\n\n\"Y-yes... wait, what?\"\n\nThe order caught Sam Dasoo completely off-guard. He'd expected Garam to mobilize every soldier in the Cho Kingdom, to hunt Grid to the ends of the earth. But silence? Sam Dasoo stood frozen while Garam clicked his tongue.\n\n\"I was wounded by someone who isn't even a yangban. Better this stays buried—the shame of it becoming public knowledge...\" His lips curved without humor. \"Besides, doesn't this serve your kingdom's interests?\"\n\n\"Of—of course! Yes! Your wisdom runs deeper than the ocean!\"\n\nThe Cho Kingdom's crisis had been averted by Garam's pride alone! Sam Dasoo bowed so low his forehead nearly touched the ground, gratitude and relief flooding through him. Garam's expression remained sour.\n\n*Tch.*\n\nTruth be told, Garam wanted to kill Sam Dasoo where he stood. His pride demanded that anyone who'd witnessed his humiliation be silenced permanently. But Sam Dasoo's death would raise questions among the other yangbans—questions Garam had no interest in answering. Better to bury this quietly.\n\n*If word spreads that Pagma's Descendant landed a blow on me...*\n\nThough even calling it \"landing a blow\" stretched the truth. In a fight to the finish, Garam would have crushed Grid without breaking stride. He hadn't even deployed a single technique. Hell, if he'd activated any of the sacred creature breaths, Grid wouldn't have touched him at all. Carelessness had created the opening. Grid had simply been quick enough to exploit it before vanishing.\n\n*Next time we cross paths, I'll kill him immediately.*\n\nRage simmered beneath Garam's composure, volcanic and restless. Yet mixed with the fury was something else—something uncomfortably close to exhilaration. Grid had injected vitality into a life that had grown stagnant since he'd passed Chiyou's Test.\n\n*Three centuries since I've felt this... Hrmm. Perhaps it's time I resumed training.*\n\n***\n\n\"You're certain?\"\n\nThe execution square in Kars—where Han Seokbong's life should have ended—stood empty past the appointed hour. Then Garam appeared. The Cho King's voice carried doubt and desperate hope in equal measure as the yangban nodded.\n\n\"I've released Han Seokbong and his daughter. Executing them for not knowing the Red Phoenix Bow's creator struck me as... excessive.\"\n\n\"Ah...! Sir Garam's mercy knows no bounds!\"\n\n\"The yangbans are truly worthy of our reverence!\"\n\nHan Seokbong enjoyed genuine love and respect among the Cho Kingdom's citizens. Dissatisfaction with his execution order had simmered through the populace. Now, with Garam's pronouncement of clemency, adoration and relief washed over the crowd in waves. The Cho King spoke for them all.\n\n\"Thank you! Our gratitude is eternal! Your mercy will never be forgotten!\"\n\n\"Hail Sir Garam!\"\n\n\"Hail the Hwan Kingdom!\"\n\n\"Hail the yangbans!\"\n\n\"*Waaahhhhhhhh!*\"\n\nNo one questioned their king prostrating himself before the yangban. It was simply the natural order of things. The crowd occupied itself with praise for Garam and the Hwan Kingdom. Garam surveyed them with an expression utterly unlike the one he'd worn facing Grid—flat, empty of interest or engagement.\n\n\"...Pathetic fools.\"\n\nThe murmur was barely audible as he turned away.\n\n\"Ready my carriage! I depart for Pangea immediately!\"\n\nThe moment Garam vanished from view, the Cho King issued his own orders. His heart ached to reunite with his dearest friend, to apologize for his inability to intervene during Han Seokbong's ordeal, to celebrate his survival.\n\nBut that dream would remain unfulfilled. The reunion between the Cho King and Han Seokbong lay years in the distant future.\n\n***\n\n\"Doesn't seem like anyone's following.\"\n\nSua had trained extensively as Han Seokbong's heir. Natural talent allowed her to become Pangea's finest warrior despite societal expectations about women. She'd mastered not only combat but scholarship and calligraphy as well.\n\n**Name:** Han Sua\n**Age:** 25 **Gender:** Female\n**Level:** 277\n**Strength:** 930 **Stamina:** 722\n**Agility:** 1,511 **Intelligence:** 885\n\n**Titles:**\n* Daughter of Pangea's Lord\n  ‣ +10% to all stats within Pangea territory\n* Captain of the Red Phoenix Group\n  ‣ Red Phoenix members gain +10% to all stats under her command\n* Pangea's Strongest Warrior\n  ‣ Increased combat skill proficiency gain\n* First Beauty of the Cho Kingdom\n  ‣ High probability of bewitching enemies\n\n**Description:**\nHan Seokbong's daughter. Possesses innate talent, exceptional beauty, and high status—earning the respect of all Pangea's residents. Unlike her father, she inherited her grandfather's calligraphic genius. Outwardly perfect, but harbors uncontrollable desires deep within. Without finding a suitable match, she risks corruption.\n\n**Skills:** Drawing (A), Singing (A), Finding the Enemy (A), Intermediate Weapons Mastery (Lv. 9), Han Family Swordsmanship (A), Fighting Spirit (S+), Calligraphy in the Dark (SS-), Peerless Beauty (SS), An Irresistible Desire (SS+)\n\nGrid examined Sua's information through the Great Lord's Sword. As expected, she registered as a named NPC with impressive stats. What surprised him was the relative lack of combat abilities.\n\n*Pangea's strongest warrior only has A-rank swordsmanship techniques...*\n\nThe raw talent was undeniable. Trained under Sticks, Piaro, and Asmophel, who knew how far she could develop?\n\n*But...*\n\nOne detail gnawed at him. An Irresistible Desire? Likely to be corrupted without a proper match?\n\n*She's genuinely dangerous.*\n\nWithout someone capable of satisfying those desires, Sua could very well transform into something demonic.\n\n\"Why don't we rest here?\"\n\nThey'd fled for half a day and only just cleared Kars' immediate vicinity—still technically within the Cho King's territory. Normally, stopping would be suicide. But Sua's Finding the Enemy skill was exceptional, and she detected no pursuit. A brief respite seemed manageable.\n\nHan Seokbong looked ready to collapse from exhaustion. Now was the right moment. Grid agreed with Sua's assessment.\n\n\"We'll rest then. I need to retrieve the companions I left hidden in Kars.\"\n\nHan Seokbong's eyes widened.\n\n\"You're going *back* to Kars? You just spent half a day running after fighting Garam without a single break. You can still *move?*\"\n\n\"I'm fairly resilient.\"\n\nGrid operated as an all-rounder. His tanking capability didn't stem solely from equipment—his stamina stat was genuinely overwhelming. Sua gazed at him with suddenly luminous eyes.\n\n\"Strong...\"\n\n\"...?\"\n\nA chill traced Grid's spine. The moment their eyes met, unease prickled across his skin. He quickly stepped back.\n\n\"I'll return shortly!\"\n\n\"Be safe... *hah*...\"\n\nSua flushed crimson as Grid's retreating figure grew distant. The reasons behind her burning cheeks and breathless sigh—those remained unspoken."
}