{
  "id": 645,
  "title": "Chapter 645",
  "content": "**Chapter [X]**\n\nThe Invisibility Cloak—a legendary artifact crafted by the master tailor Kruger. Only five were rumored to exist in the entire world, making them objects of fantasy rather than reality. No player had ever laid eyes on one.\n\nWhat they didn't know was that someone had already created a functional equivalent.\n\n*Dururuk!*\n\n\"As long as the hood stays up, I'm untraceable.\"\n\nThe Hooded Zip Up. Born from Grid's Item Creation skill, it replicated the cloak's fundamental properties—rendering the wearer both invisible and unidentifiable.\n\n'The original is probably superior in every way.'\n\nGrid suspected Kruger's authentic cloaks erased *all* traces of the wearer's presence. Against sufficiently powerful opponents, his version might prove inadequate by comparison. But for his current needs, it was more than sufficient. It would let him navigate Kars undetected.\n\n\"H-Huh? G-Grid?\"\n\n\"When did you get back?\"\n\nAt a nondescript inn on the city's outskirts, Yang Fei was tidying her bed while Idan pored over cooking recipes. Both jumped when the window burst open and Grid materialized from thin air.\n\n'Appearing and vanishing like a phantom...'\n\nYang Fei blinked rapidly at the hooded figure. Grid wasted no time on explanations.\n\n\"We're leaving. Now.\"\n\n\"Ah...? Right!\"\n\nIdan stood frozen in confusion, but Yang Fei's instincts kicked in immediately. The youngest of sixteen children, she'd learned to read situations fast. Grid's clipped tone told her everything—they were in danger. She began gathering her belongings with practiced efficiency. Idan hesitated until Yang Fei shot him a sharp look, then scrambled to pack his frying pan. He'd never been able to refuse her, not since their restaurant days.\n\nOnce they were ready, Grid summoned Noe and the God Hands.\n\n\"Well-rested? Grab them and follow.\"\n\n\"Understood, nyang!\"\n\nNoe's tiny fangs clamped onto Yang Fei's collar while the golden hands seized Idan. Before either could protest, they launched through the window and into the open sky.\n\n\"*Eeek!* W-What are these things?!\"\n\nIdan's face went pale as the ground shrank to pinpricks below. The autonomous hands gripping him defied everything he understood about the world. His head swam—he was going to faint.\n\nYang Fei, on the other hand, stared wide-eyed at the horizon.\n\n'I'm *flying!*'\n\nThe morning sun painted the eastern sky in shades of gold and crimson. Her heart soared. Whatever came next, serving Grid would never be boring.\n\n[Affinity with Idan has decreased by 10.]  \n[Affinity with Yang Fei has increased by 10. It is already at the maximum.]\n\n***\n\n\"What's the situation in Kars? Are we all wanted?\"\n\n\"Is the Cho King safe? Did the yangbans retaliate against the kingdom?\"\n\nHan Sua peppered Grid with questions the moment he landed with his charges. He shook his head.\n\n\"I flew above the city. Couldn't get a read on the street-level mood.\"\n\n\"You... *flew?*\"\n\n\"Through the sky?\"\n\nWasn't flight the exclusive domain of shamans? Yet this man—who was somehow both a swordsman *and* the blacksmith who'd forged the Red Phoenix Bow—could soar through the air as casually as walking?\n\n\"Just what *are* you...?\"\n\nHan Seokbong studied Grid with renewed wonder. Every answer spawned three new questions. The more he learned about this man, the more incomprehensible he became.\n\n'An enigma wrapped in mystery.'\n\nSua's pulse quickened. Countless men had pursued her over the years, yet none had stirred even a flicker of interest. She'd resigned herself to a quiet, solitary existence—until Grid appeared. Now, for the first time, she felt the stirrings of genuine desire.\n\nThe problem? Grid kept avoiding her.\n\n\"Grid...\"\n\nHan Seokbong shook off his momentary distraction.\n\n\"What's our next move?\"\n\nThe yangbans' influence stretched across the entire East Continent. After injuring Garam, they had nowhere to hide. They'd escaped Kars, yes—but their future looked bleak. Grid produced the intercontinental scroll and held it up.\n\n\"I already told you. Come to my kingdom. We'll build your strength there.\"\n\n\"That scroll...?\"\n\nThe yellowed parchment looked ancient and unremarkable. Han Seokbong frowned in confusion, but Sua's eyes lit up with recognition.\n\n\"That's a talisman for continental transport, isn't it?\"\n\nGrid nodded.\n\n\"Movement magic capable of crossing continents.\"\n\n\"And it can take all of us?\"\n\n\"Correct.\"\n\nStandard scrolls transported a single person. But Sticks had understood Grid's purpose in returning to the East Continent—to recruit allies. He'd provided a large-capacity scroll designed for group travel.\n\n\"Let's go.\"\n\nGrid gripped both edges, preparing to tear it, when Han Seokbong seized his wrist.\n\n\"Wait. I—\" He swallowed hard, then bowed deeply. \"I know this is presumptuous, but... my mother is still in Pangea. Before we leave, I need to bring her to safety.\"\n\nEven as he spoke, shame burned in his chest. Delaying their escape while yangbans hunted them was suicidal. But he couldn't abandon his mother. If he fled alone, she'd be branded a traitor's mother and suffer unimaginable torment.\n\nHis mother. Han Seokbong simply couldn't leave her behind.\n\nGrid's expression softened. He thought of his own mother.\n\n\"Of course.\"\n\n\"...!!\"\n\nNo hesitation. No debate. Just immediate agreement. Han Seokbong had braced himself for resistance, for pragmatic arguments about danger and timing.\n\n\"Grid, you... you're truly—\" His voice cracked. \"You're extraordinary.\"\n\nThis man possessed depths Han Seokbong couldn't fathom. He wasn't merely a king. His respect for Grid deepened into something approaching reverence.\n\nGrid offered a slight smile.\n\n\"Actually, I was planning to stop in Pangea anyway. I want to recruit the Red Phoenix Group to my kingdom.\"\n\nThe Red Phoenix hadn't contributed much during the armored needle crisis, but their skills were undeniable. They operated at the level of the Saharan Empire's Black Knights—elite tier by West Continent standards.\n\n'Plus, Sua's leadership gives them a 10% stat boost. If Asmophel trains them properly, they could become exceptional.'\n\nSua nodded thoughtfully.\n\n\"I believe they'll follow us once they understand the circumstances.\"\n\n\"Mm.\"\n\nGrid found his gaze drawn to her lips as she spoke. He quickly looked away, clearing his throat.\n\n\"Right. Then it's settled. We head for Pangea.\"\n\n***\n\nThe journey proved slower than anticipated. Idan and Yang Fei lacked the physical conditioning of the Han family. They tired quickly, forcing frequent rest stops.\n\nYet no one complained. The Hans were beloved for good reason—their generosity of spirit. Both Han Seokbong and Sua encouraged the struggling pair with patient words, helping them maintain focus.\n\nBy the journey's end, Idan and Yang Fei's stamina had noticeably improved. Grid watched them with quiet satisfaction. Coming to the East Continent had been the right choice.\n\n***\n\n\"Lord Han Seokbong was executed *four days ago?*\"\n\n\"That noble man... such a terrible fate...\"\n\n\"I don't believe it... This has to be a nightmare!\"\n\n\"The lord has surely found peace in the next life.\"\n\n\"What about Lady Sua? Does anyone know?\"\n\nPangea, one of the Cho Kingdom's major port cities, had always thrummed with vitality. Until a month ago, when Lord Han Seokbong was arrested and taken to the capital. A pall had settled over the city that never lifted.\n\nNow, with news of his execution, despair became complete. The people mourned and seethed with impotent rage.\n\n\"But what about Mother Park?\"\n\nMother Park—the affectionate title they'd given to Han Seokbong's mother, Park Jurim. That alone spoke volumes about the woman's character.\n\n\"They executed the lord. Mother Park won't be safe either.\"\n\n\"My own parents once served her household.\"\n\n\"She saved half the city during the famine after the evil daoist's attack. Without her, we would have starved.\"\n\n\"We have to protect her! We owe her everything!\"\n\n\"Yes! We defend Mother Park!\"\n\nThe people's resolve crystallized around a single purpose. They flooded toward the castle, a mob armed with farming implements and determination.\n\n\"Mother Park! You must flee!\"\n\n\"Leave the castle! The capital will send soldiers!\"\n\n\"We'll hold them off! Go, while you still can!\"\n\n\"Run!\"\n\nHundreds of voices rose in desperate chorus, tools raised high. When Park Jurim emerged to see what the commotion was about, her eyes widened.\n\n\"*You dare speak of rebellion against the crown?!*\"\n\n\"...!!\"\n\nHer voice cracked like thunder despite her eighty-plus years, echoing off the castle walls. The crowd fell silent, stunned by the rebuke.\n\nThen Park Jurim's weathered face softened into a sad smile.\n\n\"My son was a great noble, a devoted lord, and a loving child. But he died branded a criminal. Would you protect a criminal's mother? Would you make yourselves traitors as well? My husband, my son—must everyone I cherish become enemies of the throne? I won't allow it!\"\n\n\"...\"\n\n\"M-Mother...\"\n\nThe fire of rebellion guttered and died. Here stood the person who should be drowning in grief and terror, yet she thought only of *them.* Shame and sorrow warred in their hearts. They couldn't burden her further with their recklessness.\n\nOne by one, farming tools clattered to the ground.\n\n\"Mother... Mother Park...!\"\n\nThey collapsed where they stood, weeping openly, pounding fists against innocent earth. Then someone gave voice to the bitter thought they'd all been suppressing.\n\n\"This is all because of that blacksmith...! The one who made the Red Phoenix Bow! If he hadn't—Lord Han Seokbong would still be alive!\"\n\n\"...\"\n\nThey all knew the truth. Han Seokbong had died protecting that blacksmith's identity from the yangbans. But they also knew the blacksmith shouldn't be blamed—if he hadn't restored the legendary bow, the yangbans' wrath would have consumed all of Pangea. The entire city would have burned.\n\n\"We know. We all know.\"\n\n\"He saved us by restoring that bow... We should be grateful!\"\n\nBut grief demanded a target. The injustice of it all needed somewhere to land.\n\n*Kwarururung!*\n\nThunder cracked across the clear sky, as if the heavens themselves wept for the mourners.\n\n*Swaaaaah.*\n\nRain poured down, washing over the assembled crowd, cooling heated emotions. Within moments, everyone was soaked to the bone. Park Jurim watched with maternal concern.\n\n\"Goodness, they'll all catch cold.\"\n\nEven now, she thought of them as her children. It was the Han family way—had been for generations. Park Jurim shouted toward the Red Phoenix Group members standing guard.\n\n\"Don't just stand there! Send everyone home!\"\n\n\"No. Let them stay.\"\n\nThe unfamiliar voice came from above. Every head snapped upward.\n\n\"The larger the audience, the better.\"\n\n\"...!!!\"\n\nImpossible. That voice—\n\nPark Jurim and the Red Phoenix members gaped at the figure standing on the palace roof. A black-haired man with sharp features and an imposing presence gazed down at them through the rain.\n\n\"Pangea's Duke of Virtue!\"\n\nThe blacksmith who forged the Red Phoenix Bow had returned."
}