{
  "id": 646,
  "title": "Chapter 646",
  "content": "\"Pangea's Duke of Virtue!\"\n\nThe man who restored the Red Phoenix Bow, slaughtered Arube, and annihilated the armored needles. Yet also the one held responsible for driving Han Seokbong to the execution block. His sudden appearance threw the crowd into chaos.\n\n\"W-Why are you here?\"\n\nNo one had known his whereabouts. That ignorance was precisely why Han Seokbong had been sentenced to death. And now Grid appeared? In Pangea?\n\nA voice rang out, thick with anguish. \"Why? Why come back now? Better you'd never shown your face than arrive at the very end!\"\n\nHe should never have left the Cho Kingdom. If he planned to return anyway, why not before the execution?\n\n\"Why now? Why only now?\"\n\nRationally, everyone understood that Grid bore no fault. That blaming him was irrational. But his timing—appearing mere moments after Han Seokbong's beheading—left a bitter taste. As the crowd's murmurs turned hostile—\n\n\"Everybody shut up!\"\n\nThe blacksmiths surged forward. Craftsmen from Black Anvil, Red Tongs, Blue Flames, and White Hammer—all four smithies united.\n\n\"Why blame him?\"\n\n\"He's willing to cooperate with the yangbans! He didn't know he was summoned, but he fears them no more than we do!\"\n\n\"He's human, just like us! Why single him out?\"\n\nBlacksmith White—once timid and withdrawn—now bellowed louder than anyone. The roar of a man transformed by Grid's influence.\n\n\"...\"\n\nThey were right. Shamed by the blacksmiths' words, the crowd fell silent as mice. Anger drained away as reason reasserted itself.\n\n\"Hrmm.\"\n\nGrid stood upon the rain-slicked tiles, poised like a leopard lounging in the branches, surveying the ground below. His gaze settled on White and the other craftsmen with satisfaction.\n\n*Setting White aside, I didn't expect the other smithies to defend me. Blacksmiths are proud creatures. I have to bring them back with me.*\n\nThe East Continent's craftsmen were exceptional. The four smithy masters, especially, possessed potential to reach the Craftsman rank. Mass-producing the Grid Set would become exponentially easier with them in the Overgeared Kingdom.\n\nPark Jurim's voice cut through his thoughts.\n\n\"You should leave. Their pain and resentment will find you if you linger.\"\n\nAn elderly woman from the castle. Grid had heard she was a decade Khan's senior, yet her spine remained straight, her eyes sharp. Impressed by her resilience, Grid asked, \"Do you blame me too?\"\n\n\"How could I?\" Park Jurim's denial came swift, despite having just watched her son executed. She'd lost everything, yet her mind remained clear. Extraordinary mental fortitude. \"I'm grateful to you. I will be, always.\"\n\n\"...Good.\"\n\nGrid's broad smile reflected his satisfaction—so many talented people to claim from the East Continent. Those who witnessed that grin recoiled.\n\n*He's smiling?*\n\n*What could possibly be amusing right now?*\n\nEveryone mourned while he smiled alone? The crowd couldn't comprehend it. Their barely-suppressed fury began bubbling up again. But only for a moment.\n\nSnap!\n\nGrid's fingers cracked like a whip.\n\n\"N-No...!\"\n\n\"Lord Han Seokbong?\"\n\n\"Lady Sua?\"\n\nEvery eye doubted what it saw. Four golden hands materialized behind Grid, cradling Han Seokbong and Sua. The dead, standing before them alive? How?\n\nGrid's voice exploded across the square. Not even the torrential rain could drown his words—another benefit of his high Dignity stat. Every soul present felt his declaration pierce straight through them.\n\n\"I, Overgeared King Grid of the West Continent, make this declaration!\"\n\n*West Continent?*\n\n*Overgeared King?*\n\n*Grid?*\n\nHis origin. His identity. The revelations struck them as absurd.\n\n\"I am kidnapping Lord Han Seokbong and his family to my kingdom!\"\n\n\"...!!!\"\n\n\"Tell your king this—the Cho Kingdom will forever regret losing such a loyal family to Overgeared King Grid!\"\n\n\"...\"\n\nSilence crashed down. Despite Grid's vicious expression, no one believed him. If Han Seokbong and his daughter were truly \"kidnapped,\" they wouldn't appear so calm. Besides, Han Seokbong had been on death row. Yet here he stood, breathing. The crowd wasn't stupid—they understood.\n\nTears mixed with rain on countless faces. Why the Han family still lived. Why Grid \"kidnapped\" them. Everyone grasped the truth.\n\n*Grid rescued them.*\n\n*He's protecting Lord Han Seokbong, who's lost everything here.*\n\n*By claiming kidnapping...*\n\n*If Han Seokbong fled of his own will, the Cho Kingdom would brand him a true traitor. To prevent that, Grid must take the blame.*\n\n*Not only did he save Lord Han Seokbong's life—he preserved his honor too. Is there anyone else in this world like him?*\n\nExactly right. The crowd had grasped Grid's intentions perfectly. Grid would someday return to consume the East Continent. When that day came, he'd need the Han family—and the people couldn't resent them for leaving. He'd planned this during every journey back to Pangea.\n\n\"Pangea's Duke of Virtue!\"\n\n\"Thank you!\"\n\n\"Thank you for saving the young lady!\"\n\n\"Long live the Duke of Virtue!\"\n\n\"Long live the Overgeared King!\"\n\n\"Long live Grid!\"\n\nHundreds of thousands roared his name. Like the procession of yangbans themselves. At that moment, notifications blazed across Grid's vision:\n\n>[The inhabitants of Pangea have started to deify you!]\n>[As a special reward, your Deity stat has increased by 1.]\n\n\"...\"\n\n*Jackpot!*\n\nGrid barely swallowed the exclamation. Dignity. Must maintain dignity.\n\n\"Ahem.\"\n\nHe cleared his throat while Park Jurim moved to Han Seokbong's side. Then he produced the scroll—return passage to the West Continent.\n\n\"Now then, let's begin this kidnapping. Anyone who wishes to depart for my kingdom—gather here!\"\n\nGrid winked at the Red Phoenix Group and the blacksmiths. With any luck, he'd recruit most of them. However—\n\n\"Waaaahhhhh!\"\n\n\"Eh?\"\n\n\"Here! Take me!\"\n\n\"My entire family will follow!\"\n\n\"Ehh?\"\n\n\"I'd march into hell itself if it meant serving the Duke of Virtue and Lord Han Seokbong!\"\n\n\"Ehhhhh?\"\n\nNot just the Red Phoenix members and craftsmen swarmed toward him. Most of the hundreds of thousands who'd been cheering now surged forward. Grid's mind went blank.\n\n\"J-Jackpot...\"\n\n***\n\nReinhardt, capital of the Overgeared Kingdom.\n\n\"Hurry! I'm swamped!\"\n\n\"No breaks! We're out of time!\"\n\nPeople sprinted through every district. Agriculture, industry, education, magic, military—every sector suffered critical manpower shortages. Not just Reinhardt, either. Every territory in the Overgeared Kingdom faced the same crisis. Without Duke Steim's continuous infusions of funds and personnel, the entire kingdom would have collapsed.\n\n\"More people. We desperately need more people.\"\n\nPlayer immigration was climbing steadily thanks to the linked quests rewarding mass-produced Grid Sets. The market economy flourished. But that created a new problem—they had nothing to sell!\n\n*Though real estate transactions are booming with all this surplus land.*\n\nWorkers were desperately needed across all fields. Unfortunately, recruiting NPC professionals proved nearly impossible. Once again, Lauel found himself marveling at Grid. Obtaining skilled NPCs was absurdly difficult, yet Grid somehow accumulated them effortlessly. Common sense dictated that players couldn't easily build enough favor with NPCs to recruit them permanently.\n\n*Most users don't even have a single NPC companion.*\n\nLauel was no exception. During his solo career, he'd focused purely on personal growth. NPC relationships? He'd accumulated moderate favorability through leveling, quest completion, and item enhancement—nothing more.\n\n*Typically, I only interacted with NPCs when absolutely necessary, preferring player transactions otherwise.*\n\nBut common sense evaporated where Grid was concerned. Lauel rose from his seat. Time to visit the smithy.\n\n*I need to push the blacksmiths harder.*\n\nThe Overgeared Kingdom was fundamentally a blacksmith's kingdom, pouring tremendous resources into the craft. The problem? Like everywhere else, the smithies were critically understaffed. They couldn't keep pace with player demand.\n\n*I'll have to tell Khan to reduce rest periods even further.*\n\nThey'd already been working brutal hours lately. More cuts would trigger backlash. But what choice did they have with this personnel shortage?\n\n\"Haah... huh?\"\n\nLauel left the castle with a heavy sigh, then froze mid-step. A massive pillar of light erupted in the palace garden.\n\n\"U-Uh?\"\n\nLauel closed his eyes. Opened them. Repeated the process. Rubbed them vigorously. Pinched his cheek. He couldn't determine whether the scene unfolding before him was dream or reality. Grid waved at Lauel's slack-jawed expression.\n\n\"Yo.\"\n\n\"Haha... is this real?\"\n\nLauel realized it was no dream and burst out laughing. Grid had arrived in a pillar of light. The giveaway? The area surrounding him was packed wall-to-wall with NPCs.\n\n*Was Grid a human trafficker in a past life?*"
}