{
  "id": 647,
  "title": "Chapter 647",
  "content": "**Translator's Note:** Just a reminder—I'm using \"Eat Spicy Jokbal\" instead of the previous \"Eating Jokbal in Bed.\"\n\n---\n\n\"Thirty thousand... Exactly thirty thousand people...\"\n\nEven under ideal conditions—a steady influx of players into a village of a thousand NPCs—it took considerable time to grow into a city. Building a kingdom required a minimum population of one hundred thousand. Yet Grid had traveled to the East Continent and returned in ten days with thirty thousand NPCs.\n\nAn absurd, impossible number.\n\nLauel struggled to process it.\n\n\"Do you understand how difficult this is?\" He shook his head slowly. \"Most players can barely max out their affinity with a *single* NPC. And even then, convincing that NPC to actually *follow* them? Nearly unheard of.\"\n\nHe stared at Grid with something between awe and disbelief.\n\n\"Yet you captured the hearts of thirty thousand people in less than ten days?\"\n\nLauel knew about Grid's title effect—*Easily Acknowledged*—the perk that came with becoming Pagma's Descendant. But a title alone couldn't explain this. Grid possessed an almost supernatural ability to win over NPCs.\n\nGrid shifted uncomfortably under Lauel's admiring gaze, then decided to come clean.\n\n\"Actually... there were two hundred and fifty thousand people in Pangea who wanted to follow me.\"\n\n\"...\"\n\n\"Every single inhabitant wanted to become citizens of the Overgeared Kingdom. Unfortunately, the return scroll to the West Continent only had capacity for thirty thousand. So I could only bring that many.\"\n\n\"...\"\n\nIf anyone else had said this, Lauel would have laughed in their face. Called them a liar. Told them to stop exaggerating. But this was Grid. Lauel trusted Grid's words absolutely.\n\n\"...A man with a truly sincere heart.\" Lauel's voice grew softer. \"Grid's charm is like a swamp—inescapable. I should know. I can't escape Your Majesty either.\"\n\n\"...R-Really?\"\n\nGrid felt goosebumps crawl up his arms. He quickly opened his quest window, desperate for a distraction.\n\n[King's Quest]\n\nThe large-scale quest had generated automatically after Grid established the Overgeared Kingdom—exclusive content for players who became monarchs. Ordinary players would never see this window.\n\n*Khan will take the blacksmiths. Lauel gets Han Seokbong. Asmophel can manage the Red Phoenix Group.*\n\nThat left the talents of the remaining Pangea residents unknown. Grid wanted to identify their abilities before assigning them positions. But examining all thirty thousand residents individually with the Great Lord's Sword? Absurd. It would take months.\n\nHe opened his list of King's Quests instead, focusing on the one he'd been postponing: upgrading the Great Lord's Sword to the King's Sword.\n\n---\n\n**[The King's Role (1)]**\n\n*Difficulty: Linked Quest*\n\n*The king belongs to all the people.*\n\n*You have a duty to care for your citizens and place them where they belong.*\n\n*Experience their lives. Understand them deeply.*\n\n*Quest Clear Conditions: Experience 100 classes.*\n\n*Quest Reward: King's Sword crafting method. Access to next linked quest.*\n\n---\n\n**[The King's Sword]**\n\n*Durability: 530/530 | Attack Power: 320*\n\n*• Dignity +300*\n\n*• Insight +300*\n\n*• Leadership +300*\n\n*• Generates skill 'Wide Area Character Observation'*\n\n*• Generates skill 'Talent Search'*\n\n*A sword reserved for the ruler of a kingdom. Observe soldiers and residents more efficiently and command them with precision.*\n\n*Conditions of Use: King*\n\n*Weight: 490*\n\n---\n\nWide Area Character Observation. Clearly superior to the Great Lord's Sword's single-target limitation.\n\n*With this, finding talent becomes exponentially easier.*\n\nGrid wanted the King's Sword. But those quest requirements—experience at least one hundred classes? The difficulty was insane.\n\n*I've been putting this off because it's such a pain...*\n\nBut he needed to observe not just the thirty thousand from Pangea, but all eight hundred thousand citizens of his kingdom. Somewhere among them might be a genius-level Named NPC.\n\n*Can't be too greedy, though.*\n\nHe'd settle for ordinary talent—competent people who could excel in their respective fields. Deploy them efficiently, and the Overgeared Kingdom's labor shortage would largely resolve itself.\n\n*Time to steel myself.*\n\nGrid took a deep breath and rose from his throne.\n\n\"From now on, I'll be traveling in disguise.\"\n\nHis personal hell had begun.\n\n---\n\nFifty days passed.\n\nGrid blended into the populace, experiencing two jobs every day. He served in restaurants, cleaned toilets, managed bedding at inns, worked as a hired guard, performed covert missions for various guilds. By the end, he'd sampled nearly every occupation available in Reinhardt.\n\nGrid didn't realize how remarkable this was—but it was only possible *because* he was Grid.\n\nConsider: how many players could actually complete all these tasks? A knight-class player couldn't fulfill secret missions for the Assassin's Guild. They lacked the necessary skills. But Grid had sky-high stats and was, well, *overgeared*.\n\nThe Assassin's Guild's infiltration mission? Easy with his high agility and the Hooded Zip Up. The Magician's Guild assignment? Magic Missile and Belial's Staff handled it. He was a sensation at the Tanker's Guild—the quest to \"tank enemy attacks while escorting a peddler\" was child's play for someone who'd once tanked one hundred thousand enemies alone.\n\nOther tankers attempting the same quest whispered amongst themselves: \"A monster guard has appeared—someone who surpasses even Vantner.\"\n\n\"Is Grid a munchkin?\" one Overgeared member asked.\n\n\"...Munchkin?\"\n\n\"You know—those fantasy novel characters who break the game's power balance. Fraudulently overpowered.\"\n\n\"...\"\n\nThe Overgeared members watched Grid's antics with growing bewilderment. It was like he was playing an entirely different game from everyone else. Grid had become a walking caricature of broken game design.\n\nBut Grid didn't see it that way.\n\n*I'm still rising.*\n\nA legend who'd glimpsed the myths—but not truly a legend yet. What did that mean? The possibility of Myth class had opened to him, but compared to previous legends, he remained incompetent. Incomplete. Neither one thing nor the other.\n\nThat was Grid's self-assessment.\n\n*A bit more. No—a lot more.*\n\nHe would keep trying. Keep improving. Grow stronger. Become truly competent.\n\nGrid renewed this pledge to himself as he worked throughout Reinhardt.\n\nFor fifty days, he concealed his identity. Rumors proliferated.\n\n\"A genius magician has emerged in Reinhardt.\"\n\n\"A genius assassin appeared in Reinhardt...\"\n\n\"A genius *cleaner* showed up in Reinhardt...\"\n\n\"A genius masseur...\"\n\nEvery rumor was about Grid. He remained oblivious.\n\nThose fifty days of rumors drew more players to the Overgeared Kingdom. The masseur rumors proved especially popular—some players speculated that the person's skills were so extraordinary, a \"Legendary Masseur\" class must have been unlocked.\n\n---\n\n\"This is the last one.\"\n\nWhile Grid completed his fifty-day quest, Peak Sword was wrapping up the mission Grid had assigned *him*—a real-world task. Find the Dungeon Maker, Eat Spicy Jokbal. A very important mission.\n\n\"I've eaten nothing but spicy jokbal for a month...\"\n\nPeak Sword's internet research had revealed a total of one hundred and nine restaurants serving spicy jokbal—including several large chains. Would he find a clue to the Dungeon Maker's identity in one of those one hundred and nine establishments?\n\nPeak Sword had spent a fortnight visiting jokbal restaurants, eating spicy jokbal every single day. His lips were raw. His heartburn was unbearable.\n\n\"Welcome!\"\n\nHaenam, South Jeolla Province—the southernmost tip of South Korea. A spicy jokbal restaurant operated here, a grueling distance from Seoul.\n\nGrumbling, Peak Sword entered and ordered with the ease of an expert.\n\n\"One small spicy jokbal. Go light on the starch syrup, please—less sweetness. And stir-fry it over high heat.\"\n\n\"Got it.\"\n\nThe owner recognized a true connoisseur. This wasn't someone eating spicy jokbal for the first time. Pride evident in his movements, the owner began cooking.\n\nA few minutes later—\n\n\"Enjoy.\"\n\nThe owner personally delivered the dish, clearly confident in the taste. Peak Sword met his eyes and spoke.\n\n\"Dark.\"\n\n\"...?\"\n\n\"Blood Carnival.\"\n\n\"...??\"\n\n\"Insane dragon egg.\"\n\n\"...???\"\n\nPeak Sword watched the owner's face carefully after each word. Any sign of recognition, any flicker of unease, would confirm this man as the Dungeon Maker.\n\nBut the owner didn't react. He simply returned to the kitchen, as if Peak Sword were some lunatic.\n\nA chill ran down Peak Sword's spine.\n\n\"Not here either?\"\n\nHe'd visited all one hundred and nine spicy jokbal restaurants across the country. Hadn't met the Dungeon Maker at any of them. Which meant...\n\n\"Worst case scenario... the Dungeon Maker Grid mentioned isn't someone who *runs* a spicy jokbal store. Maybe he just *loves* spicy jokbal.\"\n\nWould he have to revisit all one hundred and nine stores and request customer lists?\n\n\"Ah, shit.\"\n\nPeak Sword finished his jokbal and returned to his van—a luxury vehicle with a Satisfy capsule installed inside. He climbed into the capsule and told his driver, \"Wake me when we get home.\"\n\n\"Yep.\"\n\n*Vroooom.*\n\nThe van began its long journey back to Seoul.\n\nThe spicy jokbal restaurant owner lit a cigarette, watching the van disappear into the distance.\n\n\"Damn... I moved all the way out here, and a demon *still* found me. Grid, you really aren't an ordinary person. Cruel and tenacious.\"\n\nGood thing his real face looked nothing like his in-game character. The restaurant president wiped sweat from his forehead, relief flooding through him. Though now he was seriously wondering if he should flee abroad.\n\nThen Peak Sword's van came rumbling back.\n\n\"Hey, Boss.\"\n\n*Screeeech.*\n\nPeak Sword opened the van door. He smiled at the owner, who was desperately trying to maintain a calm expression.\n\n\"You're the Dungeon Maker, Eat Spicy Jokbal, aren't you?\"\n\n\"What are you talking about?\"\n\n\"Your restaurant doesn't have a TV. Classic trait of Satisfy players—neglecting television.\"\n\n\"...\"\n\n\"Boss, you don't watch TV, and you don't even provide one for customers. How's that for reasoning? Worthy of the Patriotic Association's president, right? I've got the excellent brain of someone raised on soybean paste and kimchi.\"\n\n\"...There are plenty of restaurants without TVs.\"\n\n\"True. That's why I wasn't certain at first.\" Peak Sword gestured at the owner's face. \"But you're wearing sunglasses indoors. Why would a spicy jokbal restaurant owner wear sunglasses? You're hiding something. Your face, right?\"\n\n\"...Impressive. You really are worthy of being the Patriotic Association's president.\"\n\n*Flap.*\n\nThe restaurant boss removed his apron. No avoiding this situation now. Time to face it.\n\n\"Is this about Cork Island? About Blood Carnival destroying it?\" He raised his fists. \"Fine. Bring it on. I'll fight you.\"\n\nHe'd been gaming since before Satisfy launched—over ten years of experience. The Haenam spicy jokbal restaurant owner stood ready while Peak Sword looked confused.\n\n\"Does God Grid and the Overgeared Guild really seem that petty to you? Don't make me laugh. We just wanted to meet you.\"\n\n\"What? You don't hold a grudge against the leader of Blood Carnival?\"\n\n\"Why would we? A Korean led a powerful force—that's something to be proud of. Makes me proud as president of the Patriotic Association.\" Peak Sword paused. \"Little embarrassed it was a *vicious* force, admittedly.\"\n\n\"...\"\n\n\"Anyway, I'm off. If you ever want to join the Overgeared Guild, feel free to contact me.\"\n\nPeak Sword placed his business card on the counter and strolled out leisurely.\n\nHe thought he looked pretty cool."
}