{
  "id": 649,
  "title": "Chapter 649",
  "content": "The memory of their first meeting still blazed in Yura's mind. She'd been fifth in the overall rankings then—comfortable, confident. Then Grid appeared, standing alone against one of the best players among two billion users. That moment had struck her harder than even meeting Kraugel.\n\n*That was when everything changed.*\n\nShe found herself tracking his movements without realizing it, her eyes drawn to him in crowds, her ears catching his name in conversations. The attraction crept up on her, subtle but undeniable. Grid was different. He never looked at her the way other men did—never saw the beauty or the wealth. He saw *her.* Just Yura. She could still taste the bulgogi from that restaurant he'd taken her to, the memory as vivid as yesterday.\n\n\"Yura?\"\n\nShe blinked. \"Ah.\"\n\nThe gate to hell loomed before her, its dark surface rippling like disturbed water. She'd spent weeks preparing for this expedition, gathering everything needed to hunt the hidden pieces of the Demon Slayer class. Now, standing at the threshold, her resolve wavered.\n\nLauel's expression softened. \"Nervous about the long road ahead? Don't be. You'll excel, like always.\"\n\n\"I'm not sure I should be leaving. Not with the Empire breathing down our necks.\" Yura's fingers curled into fists at her sides. She wanted to stay, to throw her strength behind the coming conflict.\n\nBut Lauel shook his head. \"Believe in us. We'll weather this storm.\" He paused, meeting her eyes. \"That doesn't mean we don't value your strength—we do. I'm confident you'll surpass even Grid or Kraugel one day. I won't hold you back from reaching that future faster.\"\n\nThe logic was sound. Belial's death had yielded myth-rated items, and if the other great demons followed suit, each raid would exponentially increase the guild's power. To hunt great demons, they needed Yura at her absolute peak.\n\nStill, she hesitated. \"That woman from Cho Kingdom—Sua. She's as beautiful and wise as Irene.\" The words tasted bitter on her tongue. \"Grid would like her.\"\n\nThe admission slipped out before she could stop it. Jealousy, raw and ugly, coiled in her chest. The thought of Grid forming bonds with other women, while barely noticing her own existence, was acid in her veins.\n\nLauel smiled, gentle and knowing. \"You're more beautiful and wiser than either of them. Don't waste energy on fleeting shadows—they can't reach the real Grid.\"\n\nHeat flooded Yura's cheeks. The real Grid. Shin Youngwoo, the man behind the avatar. \"I don't think... I won't be with him that way.\"\n\nThe admission hurt. What did it matter if she'd fallen for him? Grid's attention was always elsewhere, fixed on goals and battles and building his kingdom. Never on her.\n\n*Even someone loved by millions can't win the heart of the one person who matters.* \n\nLauel's thoughts drifted to the guild's perpetual bachelors—Peak Sword, Vantner, and the rest who'd spent last Christmas alone and would spend this summer the same way. Somehow, Yura had joined their ranks despite being one of the world's most sought-after women.\n\n\"I'm going.\" Yura drew a steadying breath and stepped forward, the gate's darkness swallowing her whole.\n\nLauel watched until she vanished. \"Come back with everything you need.\"\n\n***\n\n\"Ha! I thought you were fresh off the farm, but look at you go!\" The worker clapped Grid's shoulder. \"Not afraid of shoveling shit, and you work like you were born to it!\"\n\nGrid grimaced beneath his hood. \"Born for this? Really? That's too much.\"\n\n\"No exaggeration, friend. I mean every word.\"\n\n\"Well...\" Grid hefted another load. \"We're all subjects of King Grid, right? Of course we're capable.\"\n\n\"Hah! Good people follow a great king! Everyone in the Overgeared Kingdom pulls their weight!\"\n\n\"Damn right!\"\n\nReinhardt's infrastructure had reset when the kingdom changed hands—a natural game penalty. The sewage system, downgraded to level two, required an army of workers to keep functional. Most citizens saw it as simple necessity, unaware that Lauel had designed the system specifically to create employment.\n\nGrid had spent fifty days like this, moving through the capital's various jobs, experiencing the lives of his people firsthand. It was the only way to truly understand them.\n\n[You have completed 100 types of job experiences.]\n\n[Your understanding of the people has deepened.]\n\n[The King's Role (1) quest is linked to the King's Role (2) quest.]\n\n[Your level isn't high enough to perform the King's Role (2) quest yet. The King's Role (2) quest will open at level 350.]\n\n[The production method for the King's Sword has been obtained as a reward for clearing the quest.]\n\n[**Production Method: The King's Sword**]\n\n**Rating:** Unique\n\nYou can learn how to make the King's Sword.\n\n**Learning Condition:** King Grid.\n\n\"Heading out, boys.\" Grid waved to his coworkers and slipped into an alley, his smile dying the moment he was alone.\n\n*Just as I feared.*\n\nThe learning condition glared at him from the notification. Only he could learn this production method.\n\n*This is terrible.*\n\nThe implications hit him like a hammer. If the rewards varied by player, then his blacksmith class meant he'd received a *recipe* instead of an actual sword. Other king-class players would probably get a finished weapon for completing the same quest.\n\n*I'm getting screwed over.*\n\nThe King's Sword could only be equipped during royal duties—making multiple copies was pointless. Yet he'd have to invest time and materials crafting it himself while other kings just... received theirs. And if this pattern continued through the entire quest chain?\n\n*Ares would clean up.* \n\nThe God of War would receive rewards suited to his general class—military power, army buffs, strategic advantages. Meanwhile, Grid would get more blacksmithing recipes that only he could use.\n\n*The blacksmith penalty strikes again.*\n\nGrid pressed his forehead against the cold stone wall, frustration welling up in his throat.\n\n\"Hey, that guy's—\"\n\n\"Oh no, his clothes are covered in... from the sewers, probably.\"\n\n\"Poor thing. Should we help?\"\n\n\"Come on, we'll get you cleaned up and fed.\"\n\nGrid lifted his head, his irritation melting away. He was dressed in beggar's clothes, literally covered in shit, yet these people weren't laughing. They weren't mocking him. They were offering help.\n\nPride swelled in his chest.\n\n*We built this. We built something good.*\n\nDon't judge by appearances. Help those struggling. Never mock the downtrodden.\n\nLauel and the Overgeared members had woven these principles into the kingdom's culture, shaped by Grid's own bitter past. They'd all seen what he'd endured—the contempt, the casual cruelty. They refused to let the Overgeared Kingdom breed that same poison.\n\n*New players starting here won't face what I did.*\n\nHe was right. The Overgeared Kingdom had already gained a reputation as the best starting location. New users could quest without enduring the casual degradation that other kingdoms—modeled too closely on real-world social hierarchies—dished out freely. Here, they were treated with basic human decency.\n\nThe culture ran deeper than just protecting beginners, though. Overgeared citizens were kinder, more considerate, more industrious than their counterparts in other nations. It showed in everything from crime rates to productivity.\n\nA whisper notification chimed as Grid pulled his hood up and headed toward the palace.\n\n—*You've cleared the King's quest by now, haven't you?*\n\nLauel's timing was supernatural.\n\n—*You're like a ghost. How did you know to contact me now?*\n\n—*I've spent over two years with you in real time. My genius-level intellect, combined with extensive observation of your personality and capabilities, allows me to predict your movements with remarkable accuracy. Heh.*\n\nGrid could almost hear the smug grin.\n\n—*Right. What do you need?*\n\n—*I've finalized the roster for the Ares Army support. Review it and tell me if there are issues.*\n\n—*Who's going?*\n\n—*You, Duke Jishuka, Earl Pon, Earl Regas, and Earl Euphemina.*\n\nJust five people to support an army trying to conquer a kingdom? It seemed too few. But Grid understood the caliber of these individuals.\n\n—*Perfect.*\n\nJishuka wielded the Red Phoenix Bow—a myth-rated weapon that made her the deadliest combatant in large-scale warfare. She outclassed both Grid and Kraugel when armies clashed. No one among two billion users could match her battlefield impact.\n\nPon and Regas, the Twin Chariots of Overgeared, had grown terrifyingly strong. Back when Grid ruled Reidan, fighting them had been uncertain—he'd estimated only a ninety percent win rate. Now? They'd evolved far beyond those days.\n\nAnd Euphemina remained the conditional strongest. With enough copied skills in her arsenal, her destructive potential was unmatched. She'd completed Mumud's Soul Liberation quest and now pursued his legacy, adding water and non-attribute magic to her already formidable repertoire. Her potential reached myth-level.\n\n—*With this lineup, even Ares will roll out the red carpet.*\n\n—*Precisely. Although... there's one concern.*\n\n—*What?*\n\n—*Euphemina's reputation is lower than the others. She didn't stand out much in the Eternal war or the Belial raid.*\n\nUnavoidable, really. The extended conflict had forced her to burn through copied skills, gradually weakening her impact as the battles dragged on.\n\n—*The Ares Army might undervalue her at first. If she takes offense, you'll need to smooth things over.*\n\n—*Just make sure she's treated well.*\n\n—*Understood. I'll handle it personally.*\n\nGrid's thoughts drifted to family.\n\n—*What are Yerim and Ruby up to these days?*\n\n—*Still supporting the citizenry with quests and leveling steadily. Both are growing strong. No need to worry.*"
}