{
  "id": 650,
  "title": "Chapter 650",
  "content": "Most unofficial rankers remained anonymous by design. In Satisfy's vast world, some players deliberately concealed their identities, operating outside public scrutiny. Ares was one of them. Though the Overgeared members might recognize him, to ordinary players he was a ghost.\n\nThe Belto Kingdom occupied the far eastern edge of the West Continent—smallest of all kingdoms in both economy and territory. Its insignificance had served as perfect camouflage for the Ares Army. Until now.\n\n\"The Overgeared Kingdom has proposed an alliance.\" Ares studied the faces of his assembled commanders. \"They're offering to help us seize control of Belto and fortify our position against the Empire.\"\n\nSeveral staff members exchanged startled glances, but most remained impassive.\n\n\"Not surprising they know about us,\" one officer said with a shrug.\n\nAnother leaned forward. \"There's talk of a special relationship between Grid and Kraugel. Kraugel must have leaked our intel.\"\n\n\"Then we refuse,\" a third cut in. \"This is just their excuse to protect Kraugel from our hunters.\"\n\n\"Does the Overgeared Guild even know we're hunting him?\" someone else countered. \"I can't imagine Kraugel running to Grid for protection.\"\n\n\"Agreed. This isn't about Kraugel at all—they want something else from us.\"\n\n\"We need to uncover their real agenda. Put ourselves in the advantageous position before we commit to anything.\"\n\nAres let the debate unfold, his expression neutral. This was his strength—creating space for his people to speak freely, without fear of rank or consequence. The best decisions came from many minds, not one.\n\nScott, one of Ares' most trusted advisors, waited for a lull in the conversation. When he spoke, the room fell silent.\n\n\"The Red Knights returned to the Empire after their victory here. With Belto's rear secured, where do you think Imperial eyes are turning?\"\n\nUnderstanding rippled through the commanders.\n\n\"Back to the Overgeared Kingdom,\" someone murmured.\n\nScott nodded. \"The Empire is applying pressure. The Overgeared Kingdom needs us to cause chaos in Imperial territory, give them breathing room while they consolidate. They're not offering help—they're asking for it.\"\n\n\"So we'd be their distraction.\"\n\n\"Their meat shield while they grow stronger.\"\n\n\"Makes sense.\"\n\nAres nodded slowly, agreement settling over his features. \"They present it as 'helping' us, but they're the ones in desperate need.\"\n\nHe drummed his fingers against the table. Belto had already fallen from Imperial attention after their defeat. There was no rush. He'd cultivated his position as duke carefully, building strength incrementally. When the moment came to overthrow the royal family, he'd be ready.\n\n*I don't need the Overgeared Guild's help.*\n\nTheir assistance would accelerate his plans, certainly. But Ares' long-term vision included conquering the Overgeared Kingdom itself. Why strengthen a future enemy?\n\n\"I'm rejecting the alliance.\"\n\n\"Ares! Ares!\"\n\nLuck burst through the meeting room doors, breathless. He'd complained about the \"boring strategy talk\" earlier and left to hunt. His sudden return, face flushed with alarm, commanded everyone's attention.\n\n\"What is it?\" Scott asked.\n\n\"The royal army—they're marching on us!\"\n\n\"*What?*\"\n\nConfusion erupted. Ares had built his entire position on demonstrated loyalty. The king trusted him implicitly. Why would the royal family suddenly mobilize against their most faithful duke?\n\nThrough the chaos, Ares caught Scott's eye. Both men wore the same grim expression.\n\n*Lauel.*\n\nThe Overgeared Kingdom existed because of Grid's power and Lauel's cunning. The world had learned to respect—and fear—that combination. Ares and Scott certainly did.\n\n\"Lauel drove a wedge between us and the royal family,\" Scott said quietly.\n\n\"To force our hand.\" Ares' jaw tightened. \"Accept the alliance or face annihilation.\"\n\n\"Wait—the Overgeared Guild engineered this?\" One of the staff members stood abruptly. \"That's despicable! We can't accept their alliance now!\"\n\nLuck's face had gone crimson. He'd pursued Kraugel relentlessly after the man's level reset, and this betrayal by Grid's guild felt personal. \"After we crush the royal army, let's march straight to the Overgeared Kingdom!\"\n\n\"We can't.\" Scott's blunt assessment cut through the anger. \"Our current strength isn't sufficient to defeat the royal family.\"\n\nThe bitter irony wasn't lost on anyone. Belto might be small, but its army was formidable—thanks entirely to Ares' own training programs. He'd built their military systematically, earning royal trust while simultaneously preparing to challenge the Empire. Now that carefully cultivated strength was turned against him like a blade at his throat.\n\n\"Accept their proposal,\" Scott urged. \"The enemy at our gates matters more than the enemy of tomorrow.\"\n\nAres said nothing, pride warring with pragmatism.\n\n\"You'll repay this humiliation,\" Scott continued. \"Once Belto is yours and your position is secure, opportunities will come.\"\n\n\"...Fine.\"\n\nThe word came out like broken glass. But Ares hadn't built an army by letting pride override strategy.\n\n\"Send word. We accept the alliance.\"\n\n***\n\nFrom high above the Ares Duchy, Grid watched dust clouds rise like smoke from eight different directions. Screams drifted upward, sharp and terrible. He grimaced.\n\n*—Still no answer?* he whispered to Lauel.\n\n*—Ares has no choice but to accept. Don't worry—his response will come soon.*\n\n*—That's the problem.*\n\nLauel had orchestrated this nightmare. Manipulated the royal family into attacking, backed Ares into a corner, forced the alliance. Effective, certainly. But watching innocent NPCs die while Grid floated uselessly above them left acid in his throat.\n\n*—Can we actually trust an alliance built like this?*\n\n*—We were never going to be friends with Ares,* Lauel replied. *His ambition is too vast. This isn't friendship—it's a business transaction. Short-term mutual benefit. That's all it needs to be.*\n\n*—...Mm.*\n\nBelow, residents of the Ares Duchy were being cut down by their own kingdom's soldiers. The royal decree had branded every man, woman, and child as accomplices to treason. Potential risks to be eliminated.\n\n*Everyone has their reasons,* Grid thought, trying to steady himself.\n\n*—Ares accepted,* Lauel's whisper came. *With one condition: we stop two of the eight army divisions. Hold them for three days until his main force returns from training.*\n\n*—Isn't this the mess you created?*\n\n*—He's testing our capabilities as allies.*\n\n*—You told me not to expose my skills.*\n\n*—Yes—showing everything to a potential enemy is dangerous. Stick to what you demonstrated during the Belial raid.*\n\nGrid smiled.\n\n*—Then I'll handle two divisions myself.*\n\n*—No, you just need to delay them for three days... Your Majesty? Your Majesty? Sir?*\n\n***\n\n\"I suspected Ares from the beginning.\"\n\nDuke Vanish savored the words. He'd once been the Belto Kingdom's premier power, his family's generations of loyal service giving him unquestioned authority. Then Ares had appeared like a comet—brilliant, unstoppable, ascending to rival Vanish's position within three years.\n\nThe royal family praised Ares. The officials deferred to him. The people celebrated him. Duke Vanish could only watch his influence evaporate, replaced by this upstart who'd arrived from nowhere.\n\nBut opposing Ares directly had been impossible. The man's military genius was undeniable. In three years, he'd transformed Belto's pathetic army into a genuine force. Without the Empire blocking expansion, Belto could have conquered neighboring kingdoms.\n\n*Which is exactly the problem.*\n\nWhy would someone of Ares' caliber serve a insignificant kingdom? The Saharan Empire itself would covet such talent. The question had gnawed at Vanish for years.\n\nThen the anonymous report arrived. Evidence of Ares' true intentions—troop deployments positioned for rapid assault on the capital. War games conducted in a mockup of the palace district. Everything pointed to imminent coup.\n\nVanish had presented the evidence to the king. The betrayed monarch's fury was magnificent to behold. Within hours, Vanish commanded the royal army with orders to erase the Ares Duchy from existence.\n\n\"Can he possibly stop ten thousand troops?\" Vanish laughed.\n\nThe royal army had been tempered in combat against the Empire. They were veterans, battle-hardened and loyal. Meanwhile, Ares had lost considerable forces in that same war. He had nothing to match this.\n\n\"Hahaha! Burn it all!\" Vanish's voice cracked with glee. \"Every building Ares touched, every field he walked—reduce it to ash! Wipe the Ares Duchy off the map!\"\n\n\"*Raaahhh!*\"\n\nThe army's roar shook the ground as they advanced unopposed, eight divisions spreading across the duchy like an iron tide.\n\nNothing could stop them now.\n\nOr so Duke Vanish believed."
}