{
  "id": 651,
  "title": "Chapter 651",
  "content": "\"Ten thousand armored elite troops?\"\n\n\"That's correct, sir.\"\n\nScott pressed his palm against his forehead, processing the scout's report.\n\nThe armored elite troops. Born from Ares' *Fostering Strong Soldiers* skill and funded by the royal treasury, they'd been forged with a single purpose: to combat the Saharan Empire. Every soldier mastered advanced riding techniques—skills most players couldn't dream of acquiring—and their combat record against the Empire spoke for itself.\n\n*The king must be furious to deploy such a force.* Scott had expected the royal family to keep these troops in reserve, ready to repel any Imperial aggression.\n\n*Though I suppose if they crush us quickly enough, they won't need to worry about raids.*\n\nThe Ares Army's current troop strength defied conventional wisdom among players: thirty thousand strong, three times the size of the royal force. Yet the numbers offered cold comfort.\n\n*Our new recruits average level 170. The armored elite troops hit 290 during the Imperial war.*\n\nThose thirty thousand would become nothing more than experience fodder. \n\n*The soldiers are a liability, not an asset. The elite troops will level up in real-time during combat and spiral beyond our control.*\n\nJust as they had against the Empire.\n\nThe secret to the armored elite troops' effectiveness lay in Ares' skill: full resource recovery on every level up. In prolonged warfare, it created a snowball effect. They grew stronger with every battle, earning them the modifier \"Undead Army.\"\n\n*Better to meet them with quality over quantity. Guerrilla tactics.*\n\nWhich meant relying on the core Ares Army itself.\n\nTwo hundred guild members under Ares' banner. Excluding twenty-eight production classes, the remaining fighters averaged over level 300. Add the hundred sixty-two Overgeared members, and they could harry the enemy long enough to survive.\n\n*Four days. Just need to hold four days until Fostering Strong Soldiers reactivates.*\n\nScott's strategy crystallized—until the next report shattered his confidence.\n\n\"The Overgeared reinforcements have arrived. However—\"\n\n\"However what?\"\n\n\"There are... only five of them.\"\n\n\"*What?*\"\n\nScott's expression twisted into something demonic.\n\n\"Those *fools!*\"\n\nThey'd orchestrated this entire crisis to force the alliance, only to send a skeleton crew?\n\n*A ploy to weaken us while maintaining the appearance of cooperation!*\n\nFury ignited in Scott's chest. The Overgeared Guild—supposedly home to the world's strongest players—revealed themselves as third-rate opportunists.\n\n*And we're shackled to these unreliable bastards.*\n\nHe clicked his tongue and headed for the VIP room, pausing outside the door to steady his breathing. Despite his rage, he wouldn't tarnish Ares' reputation.\n\n*Ares asked me to treat them well. Regardless of how they respond.*\n\nScott swallowed his anger and raised his hand to knock. Before his knuckles touched wood—\n\n\"Come in.\"\n\n*Wait...*\n\nThe voice that drifted through the door made Scott freeze. Melodious, captivating—unmistakably female. He'd recognize that voice anywhere.\n\nJishuka.\n\n*The Godly Archer...!*\n\nHer performance during the Eternal War had left spectators speechless. In large-scale warfare, she had no equal. She was one of the few players who earned Ares' genuine admiration—alongside Grid and Kraugel.\n\n*If we have the expert archer, five reinforcements might be enough.*\n\nRelief washed over his earlier fury. Perhaps Overgeared wasn't entirely third-rate after all.\n\nScott pushed open the door.\n\n\"Welcome—\"\n\nThe greeting died in his throat.\n\n\"Nice to meet you.\"\n\nA man stood framed against the window, shoulders broad enough to eclipse half the light streaming through. Sharp eyes, prominent nose, high forehead—all framed by black hair.\n\n\"Overgeared King...!\"\n\nGrid. The man who'd shattered every ceiling and become the first player to claim a throne. Legendary Blacksmith and monarch in one.\n\n*How?*\n\nOf two billion users, Grid should be the busiest. A star in distant heavens, like Ares himself. Yet here he stood—not sending subordinates to this temporary alliance of convenience, but arriving personally.\n\nIt defied imagination.\n\nGrid smiled at Scott's stunned expression, clearly amused by catching him so unprepared.\n\n\"I'm glad you accepted the alliance. I'd like to offer a small gift to commemorate it.\"\n\n\"A small... gift?\"\n\nGrid's confidence didn't waver. \"I'll eliminate half the enemy forces in your territory within two days.\"\n\n\"Ha!\"\n\nThe laugh escaped before Scott could stop it. Too naive. Too reckless.\n\n*Doesn't he grasp the situation?*\n\nOvergeared had to know the Ares Army's capabilities. They'd watched the royal forces advance unopposed.\n\n*Surely he understands what we're facing?*\n\nWas this legendary figure actually an idiot?\n\n*No. Impossible. He's testing me.*\n\nScott forced a knowing smile, convinced he'd seen through Grid's bluster.\n\n\"It would be quite reassuring if you could truly halve the royal army in thirty hours. I'll 'believe in you,' then.\"\n\n\"Good.\"\n\n\"Right. You'll... do that.\"\n\n\"Yes. Point me toward the units you want handled.\"\n\nThe royal army had split into eight advancing columns. Some posed significantly greater threats than others. Scott selected four of the most dangerous.\n\n\"The 1st, 3rd, 4th, and 6th battalions of the armored elite troops are particularly formidable. Same average level as the others, but superior tactical acumen. They don't rely on brute force alone—their coordination is razor-sharp.\"\n\nThose four battalions had chosen routes that would be nightmares for the Ares Army to intercept. Grid seemed oblivious to these logistical realities.\n\n\"Understood. Leave them to me.\"\n\nGrid rose to depart. The silent observers—Jishuka, Pon, Regas, Euphemina—stood with him.\n\nScott's eyes widened.\n\n*Pon and Regas?*\n\nGrid's overwhelming presence had blinded him to the others. Only now did he register who else occupied the room.\n\n*The Overgeared King, the Godly Archer, the White Horse Prince, the Asura... If Yura and Katz were here, this would be Overgeared's full elite roster.*\n\nPerhaps Grid's confidence wasn't entirely baseless. All four had extensive large-scale warfare experience. Grid himself had once faced down a hundred thousand enemies alone. From their perspective, ten thousand might seem trivial.\n\n*They'll learn soon enough.*\n\nThe armored elite troops weren't ordinary soldiers. Each individual matched a ranker's combat power, and their coordinated tactics surpassed even top-tier rankers. Jishuka's red phoenix that had incinerated entire battlefields? It wouldn't work on all the elite troops simultaneously. Grid, Pon, and Regas lacked Jishuka's area-of-effect dominance in large engagements. They'd struggle, eventually fall back.\n\n*But it's enough.*\n\nThey only needed to buy time until Fostering Strong Soldiers reactivated.\n\n*In four days, we'll crush the armored elite troops and force a ceasefire.*\n\nWhile Belto Kingdom licked its wounds, they'd strengthen their forces and claim the kingdom under Ares' banner.\n\nScott's eyes gleamed with certainty as the radiant future unfolded in his mind.\n\nGrid, however, misread the expression entirely.\n\n*We must seem reliable. Ares' second-in-command has quite the vision.*\n\nGrid smiled with quiet satisfaction.\n\n***\n\n\"Grid? Jishuka? Pon? Regas?\"\n\nLuck's eyes lit up as he reviewed the reinforcement roster.\n\n\"The Overgeared Guild's founding heroes? Color me impressed.\"\n\nThe terms of this alliance had left a sour taste in Luck's mouth. Overgeared had engineered the crisis that forced their hand, turning them into puppets dancing on strings. He'd expected the alliance to crumble at the first opportunity.\n\nBut this roster? These members were heavyweight. As distasteful as the alliance's formation had been, at least Overgeared was taking it seriously.\n\n\"They wouldn't dare jeopardize this. Not with the Empire still looming.\"\n\nScott's assessment matched Luck's own thinking.\n\n\"Should be manageable. The problem is the Empire will *always* be looming.\"\n\nThe war had taught Luck exactly how vast the gulf between them and the Saharan Empire truly was. The contemporary Red Knights exceeded every projection, and the 1st Knight had been overwhelming.\n\n*I can't compete with anything from the 5th Knight upward.*\n\nThe 4th Knight felt like hitting a wall. The 3rd Knight existed in another dimension entirely—capable of crushing prime Kraugel one-handed.\n\n\"Anyway, I'm most curious about the Overgeared founding heroes' capabilities.\"\n\nHow long could they hold against the armored elite troops? Luck estimated three days. For a single battalion, naturally.\n\n*If they employ guerrilla tactics and stretch it out...*\n\nBoth Luck and Scott waited with anticipation.\n\nThen the guild chat exploded.\n\n**@ The 3rd armored elite troops battalion...!!**\n\n\"What?\"\n\nNot even half a day since Grid's arrival. Luck and Scott spoke in unison, bewildered.\n\n**@ Did Jishuka's red phoenix work on the armored elite troops?**\n\n**@ Did Grid summon two red phoenixes?**\n\nMore than that. Grid, Jishuka, Pon, and Regas must have unleashed every ultimate skill in their arsenals.\n\n*But even so...*\n\nAnnihilating an entire battalion of armored elite troops in half a day... Scott and Luck couldn't comprehend it.\n\nThen the shocking response arrived.\n\n**@ No, Grid summoned four red phoenixes!**\n\n**@ Yes, four...**\n\n**@... Red phoenixes?**"
}