{
  "id": 652,
  "title": "Chapter 652",
  "content": "**Chapter: The Phoenix Storm**\n\n\"Four red phoenixes... Did God's Command proc again?\"\n\nThe Ares Army's intelligence network was second to none. While Grid operated with limited reconnaissance capabilities, Ares commanded an information apparatus rivaling the continent's top powers. Among their accumulated intelligence was detailed knowledge of the Seven Malignant Episodes—the legendary trials that bestowed three offensive passives, three defensive passives, and one corrupting passive skill upon those who completed them.\n\nThe Ares leadership didn't possess exact acquisition methods, but they'd pieced together enough to identify Grid's possession of God's Command. The evidence was damning: consecutive ultimate skill activations during the Belial Raid, and four phoenixes manifested during the Eternal campaign.\n\nScott frowned, studying the battlefield reports. *But God's Command activates on probability, doesn't it?*\n\nGrid triggered it too consistently—almost as if bending the skill to his will.\n\n\"High Luck stat from equipment?\" Luck muttered, voice tight with speculation. \"Or his natural fortune is just that absurd.\"\n\nTheir theorizing shattered when a new alert pinged through the guild network.\n\n**@ Grid just summoned two MORE phoenixes! Six total in the sky!**\n\n\"What?!\" Scott lurched forward, nearly knocking his chair over.\n\n\"But he already activated God's Command for the four—\" Luck's words died mid-sentence as they both scrambled for the Eternal War footage, rewinding to analyze Grid's combat patterns.\n\n*Two of the four God Hands transformed into bows.*\n\n*Grid wielded one. The remaining God Hands operated the other in tandem.*\n\n*Which means...*\n\n*...All four could theoretically become bows simultaneously.*\n\nThe realization hit them like cold water.\n\n\"That's insane.\" Scott exhaled slowly, goosebumps rising on his arms.\n\nLuck felt the impact more viscerally. He'd been measuring himself against Grid as an equal—a peer competitor operating at similar capability thresholds.\n\n*I was deluding myself.* The bitter truth settled in his chest like lead. *Grid's already beyond me.*\n\nA rueful laugh escaped him. *So this is Kraugel's rival.*\n\n---\n\n**Bultail Plains**—vast grasslands dotted with weathered stone, terrain purpose-built to showcase the Armored Elite Troops' devastating potential. Their equipment buffs sang in this environment: increased speed and agility on flat ground, bonus attack power when charging across a hundred-meter stretch. Confidence radiated from their ranks like heat shimmer. On these plains, they believed themselves capable of challenging even the Saharan Empire's legions.\n\n\"No rebel formation will slow our advance.\" Battalion Commander Pastano's voice carried absolute certainty, dark blue eyes gleaming beneath matted hair. He envisioned his Third Battalion arriving first at Duke Ares' stronghold, claiming the lion's share of glory and royal favor.\n\n*I once considered Ares a mentor.* The thought carried no warmth. *Not anymore.*\n\nPastano had convinced himself he'd surpassed his former idol. Yet admiration and resentment warred within him—he'd never been granted the opportunity to prove his superiority.\n\n*Until now.*\n\nThe news of Ares' rebellion had sent exhilaration coursing through Pastano's veins. Finally, a chance to demonstrate his evolution before the kingdom.\n\n\"Ares!\" His battle cry split the morning air. \"Your legacy ends as my stepping stone!\"\n\nHe spurred his mount forward, the beast surging with unnatural speed. A bound ghost inhabited the horse's frame, granting it inexhaustible stamina and fearlessness in the face of death.\n\n\"Forward! At the charge!\" Pastano laughed, manic and wild, as 2,500 elite cavalry thundered across the grasslands. In his mind's eye, the Ares Duchy capital already burned, its ashes the foundation of his new reputation.\n\nThen his expression twisted. *What the hell?*\n\nA solitary figure stood in the army's path. Distance obscured details—Pastano couldn't determine species or intent.\n\n*Monster?* He dismissed human possibility immediately. No sentient being would position themselves before thousands of advancing cavalry unless suicidal or insane.\n\n\"Trample it!\"\n\n\"Sir!\" The troops responded in thunderous unison, hoofbeats drumming a war rhythm into the earth.\n\nThen the distant figure moved. Drew a gleaming golden bow. And shouted words that carried across the plains with impossible clarity.\n\n\"**Fly Up!**\"\n\n*Kiyaaaaaaack!*\n\nThe armored cavalry faltered. Above them, the azure sky darkened—not with storm clouds, but with a creature of legend. A phoenix wreathed in crimson flames, wingspan so vast it eclipsed a quarter of the visible heavens.\n\n\"What—?\" Pastano's certainty cracked.\n\n\"Is that a red phoenix?!\" Panicked voices rippled through the ranks.\n\nThe troops instinctively decelerated. That hesitation would prove fatal.\n\n\"**Fly Up!**\"\n\nThe figure pulled the bowstring again.\n\n*Kiyaaaaack!*\n\nA second phoenix materialized, flames painting the sky in shades of apocalypse.\n\n\"Impossible...\"\n\n\"No one can summon red phoenixes!\"\n\n\"This has to be a trick!\"\n\nRaw disbelief fractured their formation. Pastano fought to restore order, his voice cutting through the rising chaos.\n\n\"Steady, damn you! We are the Armored Elite Troops—the kingdom's finest! Don't let parlor tricks shake your resolve!\" He wrestled his own shock into submission, forcing logic through the terror. *It can't be real. Summoning legendary sacred creatures? Absurd. This is Ares' desperation—an illusion to break our momentum.*\n\n\"Full charge! Crush this charlatan and raze Ares' holdings to ash!\"\n\n\"**RAAAAAH!**\"\n\nPastano's command reignited their courage. The cavalry surged forward again, earth trembling beneath their renewed assault.\n\nBut the damage was done. The critical seconds lost. The distant figure produced two more golden bows—four total now, impossibly wielded simultaneously—and drew them in perfect synchronization.\n\n\"**Fly Up!**\"\n\n*Kiiiiiing!*\n\n**HWOOOOOOOSH!**\n\nThe sun vanished. Four red phoenixes now dominated the heavens, their combined radiance transforming daylight into an inferno's glow. The grasslands burned with reflected fire before a single flame had fallen.\n\n\"Four... red...\"\n\n\"...Phoenixes?!\" Pastano's voice cracked.\n\nTerror—real, primal terror—seized the battalion. Trick or not, the heat was *real*, waves of scorching air rolling across their armor, cooking them inside their own equipment. The horses screamed. The troops wavered. Yet momentum carried them forward, closing the distance to their doom.\n\nThen the figure beneath those four blazing gods delivered the killing blow.\n\n\"**Two more! Fly Up!**\"\n\nGod's Command had activated. Twice. In the span of four Fly Up! casts, Grid's legendary passive had reset the cooldown on half of them—astronomical luck, even by his standards. Now six red phoenixes crowded the sky, their combined power eclipsing even the Myth-rated Red Phoenix Bow's standard devastation.\n\n**KRRRRRRRRUUUUUUNG!**\n\nFire descended like judgment. The green plains ignited instantaneously, transformed into a roaring sea of flame.\n\n\"AAAAAAGH!\"\n\n\"HELP ME! GODS, PLEASE—!\"\n\nUnquenchable fire consumed everything. The legendary Armored Elite Troops—the formation that believed itself capable of challenging empires—burned.\n\n**[Your level has risen.]**  \n**[Your level has risen.]**  \n**[Your level has risen.]**  \n**[Your level has risen.]**  \n**[Your level has risen.]**\n\n\"...Huh?\" Grid blinked at the notification cascade. Five levels from fewer than three thousand enemies? The experience was staggering.\n\nUnderstanding crystallized. *These weren't regular soldiers.*\n\nThe Ares Army members watching from the command post stood in shell-shocked silence. Their life's work—years of training, strategic planning, equipment optimization—rendered meaningless by one man and six phoenixes.\n\n*Barbaric.*\n\n*Is he really at Ares' level?*\n\nThe unspoken question hung between them: *What happens when he becomes our enemy?*\n\n\"Wait.\" One of them pointed. \"Survivor.\"\n\nThrough the smoke and ash, a single figure emerged from the cremated Third Battalion. Pastano. His armor glowed red-hot, charred flesh visible through gaps in the plate, yet he remained standing—testament to the gulf between battalion commanders and common troops.\n\n\"YOU!\" Pastano's voice was shredded, raw. \"WHO ARE YOU?!\"\n\nHe'd lost everything in that fire. His command. His reputation. His future. Ambition had burned away with his men, leaving only rage—pure, incandescent fury.\n\n\"I'LL KILL YOU! I'LL RIP YOU APART!\"\n\n**KUAAAH!**\n\nHe launched himself forward with berserker desperation. The hundred-meter charge ability activated, granting devastating momentum. A cavalry charge was considered the most powerful assault in conventional warfare, and Pastano's wounded fury made it apocalyptic.\n\nBut every strength carried inherent weakness. Cavalry charges followed straight lines—predictable, unavoidable trajectories. Perfect for counterattacks.\n\n\"Pagma's Swordsmanship, Revolve.\"\n\n**KWAJAJAJAJAK!**\n\nPastano's eyes widened in shock as his chest plate split open. The +7 Sword Ghost traced a precise circle, creating a vortex that absorbed his charge's kinetic energy and *reversed* it, turning his own attack back through his sternum.\n\n\"Guh—!\" Blood erupted from his mouth.\n\n*He's not a summoner?*\n\nThe black-haired warrior before him had manifested six legendary phoenixes. Whatever dark sorcery enabled that should have categorized him as a pure caster—vulnerable at close range, easy prey for sustained melee assault.\n\n*Then why—?*\n\n\"Swordsmanship... How does a summoner wield a blade like this?! *Cough!*\"\n\nThe wound was mortal. Grid moved to grant mercy—the final stroke that would end Pastano's suffering.\n\n\"Killed by a *summoner*... what humiliation...\"\n\n**CHAAENG!**\n\nGrid froze mid-strike. Pastano had blocked with his spear—movements sharp, precise, despite his catastrophic injuries.\n\n*His reflexes are still functional?*\n\nPastano had endured six phoenix strikes. His health gauge flickered near empty, his body more burn scar than flesh. Standard humanoid NPCs collapsed under far less punishment. Yet here Pastano stood, defending with a master's precision.\n\n*This is why Ares is dangerous.* The realization settled cold in Grid's gut. He'd gained five levels from the troops, which meant their commander's experience value would be astronomical. And their existence—their power, their discipline—was entirely Ares' creation.\n\n*I need to avoid direct conflict with the Ares Army.*\n\n\"RAAAH!\"\n\n**Chaaeng! Chaaeng!**\n\nPastano attacked with desperate ferocity. But his health pool had already crossed the point of no return. Two strikes from Grid, and the commander's eyes glazed. He collapsed, armor clattering.\n\n**[The leader of the Armored Elite Troops 3rd Battalion, Pastano, has been defeated!]**\n\n**[The Armored Elite Troops burn with desire for revenge! When facing you in the future, their combat power will increase exponentially!]**\n\n\"Are you *kidding* me?\" Grid stared at the notification.\n\nAres' troops approached, reading his expression. One offered explanation with thinly veiled schadenfreude.\n\n\"That's the nature of Ares' leadership ability.\"\n\n\"Anyone strong enough to kill his commanders...\"\n\n\"Becomes a priority target. The army's potential unlocks against them specifically.\"\n\n\"Kraugel learned that lesson the hard way.\"\n\nTheir intent was transparent—instill fear, establish psychological dominance.\n\nGrid's response shattered their expectations.\n\n\"The revenge penalty doesn't concern me.\" His tone carried absolute confidence. \"Because I won't be fighting the Armored Elite Troops again.\"\n\nThe Ares members exchanged confused glances. \"What?\"\n\n\"My colleagues will handle the remaining seven battalions.\"\n\nThe declaration hung in the air—not a boast, but a statement of operational reality. The penalty from killing Ares' commanders meant nothing when you commanded forces capable of executing the same operations independently.\n\nThe war of nerves had begun in earnest."
}