{
  "id": 653,
  "title": "Chapter 653",
  "content": "# Chapter: The Immortal Bridge\n\nPured Bridge spanned a river so vast it dwarfed most lakes. One of the Belto Kingdom's critical arteries, it had earned its moniker—the Immortal Bridge—through centuries of standing firm against flood, siege, and time itself.\n\nToday, three hundred horses thundered across its ancient stones.\n\nFrom a distance, the mass of armored bodies appeared as a single writhing organism—only up close could you distinguish individual mounts. The 4th Battalion of the armored elite troops. Speed and shock were their doctrine, compensating for what they lacked in numbers.\n\n\"Faster!\" Bocard, the battalion commander, urged his men forward. \"Secure that watchtower before they sound the alarm!\"\n\nIf the garrison spotted them, their advantage would evaporate. His soldiers responded with the precision of veterans, deploying advanced riding techniques as they ate up the remaining distance. Three meters from the tower, they launched themselves from their saddles in perfect synchronization—not a single man losing his balance.\n\n*Crack!*\n\nWeighted chains whipped through the air, coiling around the watchtower's support pillars.\n\n\"Enem—*urk!*\"\n\nThe Ares sentries died with the warning half-formed on their lips. By the time they'd registered the threat, it was already too late. The 4th Battalion excelled at precisely this: striking from shadow, swift as death.\n\n\"Contact!\"\n\nThe main guard force didn't realize they were under attack until half their defenses had already fallen. The elite troops were already swarming up the chains, blades flashing in the morning light.\n\n\"Light the beacon! Alert the duchy!\"\n\nPured Bridge occupied open ground—easily monitored, easily secured. That very visibility had bred complacency. The defenders had never imagined an assault *here*, of all places, and they'd grown lax because of it.\n\nThe defense captain lunged for the signal fire. The armored troops cut him down before he'd taken three steps, stamping out the flame before it could catch.\n\nThe ground commander—Baphrang—spotted Bocard among the attackers and his face twisted with betrayal. \"You're using Duke Ares' own techniques! Without him, you'd be *nothing!* How dare you spill blood on the land of the man who trained you?\"\n\nBocard's expression didn't waver. \"We trained under Duke Ares for the *royal family*. He was a great general. A great teacher. And now he's a traitor who turned his back on his rightful liege.\"\n\n**[Quest Failed!]**\n\n**[You have failed to convince Captain Bocard of the 4th Battalion.]**\n\n**[New Objective: Retreat from Pured Bridge! Warn Duke Ares of the enemy's advance!]**\n\n*Shit.*\n\nBaphrang had been bitter about this posting. Guarding a bridge no one would ever attack? It felt like being shoved aside, denied any chance at glory while others racked up achievements in real battles. \n\nNow he understood. This wasn't the periphery.\n\nThis was the *lynchpin.*\n\nPured Bridge was the shortest route to Ares' stronghold. If it fell, the duke would face a full assault with no time to prepare proper defenses.\n\n*I have to warn him.*\n\nGuild chat would be simple. A quick message, instant communication. But the moment the elite troops had appeared, the quest parameters had triggered—all remote communication was blocked. If he wanted to warn anyone, he'd have to run there himself.\n\n\"Hah!\"\n\nBaphrang vaulted over the tower's edge. Six meters straight down in full plate armor—the fall damage alone would cripple most players. But Baphrang had reached his third advancement. He had control.\n\nJust before impact, he activated Charge, twisting mid-air to redirect his momentum laterally rather than downward, defying gravity through pure skill.\n\nHe didn't account for Bocard.\n\nThe spear captain had already predicted his landing zone.\n\n*Thunk!*\n\n\"*Ghhk!*\"\n\nThe spear punched through Baphrang's cuirass and into his chest—a perfect strike to the heart. His health dropped by a third in an instant. Critical hit. Mortal wound.\n\nAnd then—\n\n*Crackle-BOOM!*\n\nLightning erupted from the spear's shaft, arcing through Baphrang's body. The additional damage wasn't even the worst part—the electric shock paralyzed him, locking every muscle.\n\n*Bastards!*\n\nHe couldn't move. Couldn't even reach for a potion. Could only watch helplessly as the elite troops closed in for the kill.\n\n*This is it.*\n\nDeath meant failure. Failure probably meant expulsion from the Ares Army. His future—everything he'd worked toward—about to disappear because he'd been too complacent, too focused on his wounded pride to do his damn job.\n\nThe hoofbeats grew louder.\n\nBaphrang closed his eyes.\n\nThen—\n\n*KRAKOOOM!*\n\nLightning split the sky.\n\nNot Bocard's parlor trick. Real lightning—a column of raw fury that made the spear's shock look like static electricity.\n\n*BOOM!*\n\nThe sound was physical, hammering into their chests.\n\nThe armored elite troops scattered on pure instinct, abandoning their killing blow in favor of survival. For several heartbeats, no one moved. No one breathed.\n\nThen the impossible happened.\n\nThe lightning... *stayed.*\n\nStill crackling on the ground where it had struck. Still pulsing with lethal energy.\n\nAnd then it *moved.*\n\n*Crackle-snap!*\n\nThe lightning bolt surged forward like a living thing.\n\nConfusion rippled through the battalion. Lightning didn't behave like this. Lightning struck and dispersed. It didn't linger. It didn't *hunt.*\n\nThey didn't understand what they were seeing.\n\nAsura. The warrior class that one man in hundreds of thousands had elevated beyond its normal limits through sheer mastery.\n\n\"Regas!\" Baphrang's shout was half relief, half disbelief.\n\n\"*Lightning Dragon Ascension!*\"\n\nRegas became the storm.\n\nHis movement speed and agility multiplied beyond human limits as he tore through the armored formation. He didn't run—he *manifested*, appearing and disappearing faster than the eye could track.\n\n*Crack!*\n\nOne soldier down.\n\n*Boom!*\n\n*Crash!*\n\nTwo more.\n\n*BOOM-BOOM-BOOM!*\n\nAn onslaught of fists and feet, each strike accompanied by thunder, each impact delivering a jolt of electricity that locked muscles and shattered balance. The elite troops—these soldiers who'd trained for years under Ares himself—couldn't even respond. Couldn't raise their weapons. Couldn't do anything but fall.\n\n*I can't—*\n\n*—can't even see him!*\n\nThen Pon arrived.\n\n\"Didn't want to interfere, honestly.\"\n\nHe'd known Baphrang would be an enemy soon enough. The smart play was to let him die. But Regas had grown up practicing Taekwondo—the sport had instilled certain values. You didn't abandon allies in trouble, even if those allies were temporary.\n\n\"But what Regas wants, Regas gets.\" Pon grinned. \"Lucky for you.\"\n\nHe hurled his spear with everything he had.\n\n*SHRIEEEEK—*\n\nBelial's Spear—his reward from the National Competition—screamed through the air. It punched through the first stunned soldier. And the second. And the third. The Mach Spear technique manifested sonic booms and flames in its wake, the spear itself moving faster than sound.\n\nBaphrang's jaw went slack.\n\nHe'd known the Overgeared members were strong. Top-tier players. But he'd mentally categorized most of them below Grid, Yura, Jishuka, and Katz—the true monsters of the guild.\n\nHe'd been wrong.\n\n*Regas' speed... Pon's destructive power... This isn't top-class.*\n\n*This is world-class.*\n\nGoosebumps rose on his arms despite the situation.\n\nRegas approached, offering his hand with that genuine, transparent smile of his. \"Can you stand?\"\n\nBaphrang stared at him.\n\n*You know I'll be your enemy someday. You know this is temporary. And you're still treating me like a real comrade?*\n\nThis wasn't coincidence. Regas hadn't just happened to be nearby. He'd *come* to help.\n\n*How big is the Overgeared Guild's heart?*\n\nMeanwhile, what had Baphrang been doing? Sulking about his post. Neglecting his duty because he wasn't getting personal glory. Thinking about his own achievements instead of his team.\n\n\"I'm... ashamed.\"\n\nHe clasped Regas' hand and pulled himself up, looking at the martial artist with newfound respect and admiration.\n\n\"If Grid has subordinates like you... I can't even imagine what kind of person he must be.\"\n\nRegas blinked, clearly confused.\n\nPon laughed so hard he nearly dropped his spear.\n\n***\n\n**Guild Chat Update:**\n\n**@ The 4th Battalion has collapsed. Pon and Regas confirmed the kills.**\n\nThe Ares command staff stared at their screens.\n\nThe 4th Battalion was small but elite—their guerrilla tactics were a nightmare to counter. And it wasn't Grid or Jishuka who'd destroyed them, but Pon and Regas?\n\n\"Baphrang must have set up perfect defenses at the bridge,\" someone suggested. \"Funneled them into a kill zone.\"\n\nNods all around. But Scott and Luck exchanged glances.\n\n\"No,\" Scott said slowly. \"The Overgeared Guild is stronger than we estimated.\"\n\n\"The loot from the great demon raid,\" Luck added. \"Whatever they got must have been significant. They're operating at a completely different level than during the Belial fight.\"\n\n\"If they're that much stronger than the Belial raid...\" Someone swallowed hard. \"What does that make Jishuka?\"\n\n\"Grid's probably on par with Ares leading twenty thousand troops,\" Scott said grimly. \"Maybe thirty thousand.\"\n\nSilence.\n\n\"Which means Grid will be confident enough to send Jishuka against the 1st Battalion alone.\"\n\n\"She'll die. The 1st Battalion has mixed unit composition—their defense is too layered. The red phoenix flames won't penetrate armored troops.\"\n\n\"But she'll soften them up. Drain their stamina, force them to burn through resources. Then we mop up the exhausted survivors and claim the experience.\"\n\nThe Ares members were nodding, already calculating their share of the spoils, when a new message appeared.\n\n**@ 1st Battalion has made contact with an Overgeared member. But...**\n\n**@ What?**\n\n**@ It's someone called Euphemina. Not Jishuka.**\n\n**@ Euphemina?**\n\n**@ Who the hell is that?**\n\nScott and Luck stared at each other.\n\n*Why does nothing ever go according to plan?*"
}