{
  "id": 654,
  "title": "Chapter 654",
  "content": "# The Duplicator\n\nFew knew of its existence, but the Duplicator stood among Satisfy's first hidden classes—appearing alongside Baal's Contractor and Blood Warrior. Any skill below Epic rating could be copied and wielded as naturally as breathing. The right tool, pulled from an arsenal limited only by what its user had seen.\n\nA Duplicator who'd assembled a vast collection of skills became something beyond categorization. Even Overgeared King Grid had privately admitted: if he faced Euphemina at her peak, he would lose.\n\n\"Who the hell is that girl?\"\n\nThe 1st Battalion of Belto Kingdom's armored elite troops—the same unit that had bloodied the Saharan Empire's nose during the war—stared in disbelief at Parklu Fortress. The stronghold should have been abandoned after the garrison's retreat. Instead, a lone figure stood atop its walls: a girl with blonde hair tied in a ponytail, looking more like she belonged at a village festival than a battlefield.\n\n\"Civilian who didn't evacuate?\"\n\nBut no civilian would stand that confidently. No white flag in hand, no fear in her posture. Battalion Commander Zen signaled to his archers without hesitation.\n\n\"Kill her.\"\n\nDuke Ares had a reputation for turning weaklings into warriors, then warriors into knights. That fragile-looking girl was likely one of his hidden weapons. Better to eliminate unknown variables before they became problems.\n\n*Kkirik!*\n\nThe elite archers hesitated only a moment before drawing. Five hundred meters to target, poor wind conditions—but their passive granted eighty percent accuracy regardless. Through Hawk Eyes, the girl's silhouette sharpened into crystal clarity.\n\n*Thwip! Thwip-thwip-thwip!*\n\nTen jaffa arrows arced through the air. All ten would find their mark. Everyone saw the girl's inevitable death.\n\nEveryone except the girl herself.\n\n\"Two hundred archers total...\" Euphemina murmured, counting. \"I'll need defense.\"\n\nShe activated the skill copied from Jeff, Zeraph Guild's master and first-ranked Qigong Master.\n\n\"**Deny Reason.**\"\n\nAn ultimate technique of the third advancement Qigong Master class, *Defying the Natural Order*.\n\n*Paaang! Pa-pa-pa-pang!*\n\nHundreds of water-like spheres materialized around her. The ten arrows seeking her heart simply... vanished into them, neutralized as if they'd never existed. A force that rejected all projectiles.\n\nThe armored troops accelerated their approach.\n\n\"Qigong Master! Ranged attacks won't work!\"\n\n\"Maintain formation and close the distance!\"\n\n\"Shield wall forward! Archers, cease fire—those spheres might redirect our own shots!\"\n\nOfficers barked commands in rapid succession. The elite troops reached the fortress base within moments. It should have been enough. Euphemina stood alone on walls they couldn't climb.\n\nShould have been.\n\n\"Earthquake. Blizzard. Thunderstorm. Volcano.\"\n\n\"...What?!\"\n\n\"Is she a mage?!\"\n\nNot just a mage—a Great Magician who unleashed top-tier spells across four elements *without casting*. Impossible.\n\n\"GREAT MAGICIAN!\"\n\n*KRRRUMBLE!*\n\nThe earth collapsed beneath their feet.\n\n*Crack! CRACK-CRACK-CRACK!*\n\nA blizzard descended, freezing flesh through gaps in armor.\n\n*BOOM! Crackle-crackle-crackle—!*\n\nLightning hammered the immobilized troops, each bolt finding frozen metal like a lodestone.\n\nThen—\n\n*ROOOOOAR!*\n\nA volcano erupted from the shattered ground, spewing magma across the panicked formation.\n\n\"AAAGHH!\"\n\n\"How can she chain spells like this?!\"\n\nPandemonium. \n\nThe elite troops scrambled, defenseless against the linked devastation. Commander Zen watched his soldiers fleeing the volcanic eruption and understood with cold certainty:\n\n*Duke Ares has a Great Magician.*\n\nPlenty of mages dabbled in multiple elements. But wielding the pinnacle magic of each attribute? That was the domain of the legendary few—the Great Magicians, counted among the continent's top ten.\n\n*No—more than that!*\n\nGreat Magicians were still mages. They couldn't use Qigong techniques. Yet this girl had opened with a Qigong Master's skill to cover a Great Magician's weakness. She was—\n\n*Complete.*\n\nZen swallowed hard.\n\n\"Off the walls! Hammer squad—bring it down!\"\n\nThe armored elite troops lived up to their reputation. Euphemina's magic had left many wounded, but none dead. As the volcano faded, they shook off the pain and rose. Simultaneously, they activated their best skills and struck the fortress walls.\n\n*BOOM! KRRRUMBLE!*\n\nThe section beneath Euphemina crumbled. The troops scattered with practiced agility, dodging falling stone.\n\n*Thud! Crack!*\n\nThrough the settling dust, a thousand soldiers surrounded the blonde girl.\n\n\"Die, witch!\"\n\nWhatever she was transcended normal categorization. Heat distorted the air above them, enough to evaporate clouds. None of it mattered.\n\n\"**White Light Steps.**\"\n\n*Fwip!*\n\n\"—?!\"\n\nWhite Light Steps. The technique required exceptional control and shined brightest under intense sun or clear moonlight. The supreme footwork skill Kraugel favored, now perfectly reproduced.\n\n*She's gone?*\n\nZen lost his target. Like she'd been erased from reality.\n\n\"Protect the commander!\"\n\nThe two hundred archers who'd been holding back immediately loosed their arrows blindly. Not one considered that Euphemina might still be controlling those spheres after casting so many spells. Understanding a genius player's multitasking was beyond them.\n\n\"No—\"\n\nZen sensed something wrong. As hundreds of arrows rose from the ground around him, he understood with dawning horror: those spheres still answered to the blonde girl's will.\n\n*Swirl... swirl-swirl-swirl.*\n\nThe spheres consumed the arrows. Then—\n\n\"**Sonic Boom.**\"\n\n*BWOOOOOOOM!*\n\nThe ultimate magic of Zednos, first-ranked wind mage. Cast directly above Zen's head.\n\n\"—!!\"\n\nSound became weaponized beyond human tolerance. Zen and his troops collapsed, blood streaming from their ears. The wind pressure that followed crushed flesh and bone, while the trapped arrows exploded outward in a lethal barrage.\n\n[**Your level has risen.**]\n\n[**Your level has risen.**]\n\n[**Your level has risen.**]\n\n[**Your level has ri...**]\n\n...\n\n[**The leader of the armored elite troops' 1st Battalion, Zen, has been defeated!**]\n\n[**The armored elite troops burn with vengeance! They will exert greater power when facing you!**]\n\n***\n\n**Ares Guild Chat**\n\n> Euphemina is that Overgeared mage from the Reinhardt golem invasion, right?\n\n> Yeah, the girl who demolished those golems.\n\nThe Ares Army had tracked Overgeared Guild closely for months. They'd recognized Grid and his core members' potential early, studied their combat footage obsessively. That beautiful female mage who'd turned the tide against the golems—she was unforgettable.\n\n> She handled golems well but couldn't scratch the Ancient Weapons.\n\n> Didn't do much in the Eternal Kingdom war either. Pretty quiet during the Belial raid too.\n\n> Her popularity isn't high... Why would Grid send HER against the 1st Battalion?\n\n> Buying time, obviously. She stalls them while Grid, Jishuka, Regas, and Pon handle the other battalions.\n\n> Makes sense... Wide-area magic is perfect for delaying tactics.\n\n> The more I learn about Grid, the more impressive he gets. Willing to sacrifice his own guildmates to maintain this alliance.\n\n> Grid understands reputation. We can trust him while this partnership lasts.\n\n> Agreed. Respectable guy.\n\nThe Ares troops couldn't help but admire Grid's ruthless pragmatism—sending a guildmate on a suicide mission to preserve the alliance. They assumed Euphemina was equally noble, sacrificing herself on Grid's orders.\n\n> Overgeared Guild... can't underestimate them.\n\n> Wait, the 1st Battalion collapsed?!\n\n> She might be stronger than Kraugel and Agnus.\n\n> THE 1ST BATTALION COLLAPSED!\n\n> Not Agnus-level. That madman's on another scale entirely.\n\n> Worse when you consider all those necromancers following Agnus. Eventually, his undead army alone could number in the hundreds of thousands.\n\n> THE 1ST BATTALION WAS WIPED OUT!\n\n\"...\"\n\nThe heated debate died instantly. The absurd words hung in the chat window. Finally, someone snapped:\n\n> Stop trolling. This isn't the time.\n\n> We've been overestimating Overgeared for too long.\n\nAs multiple members typed agreements, their battlefield scout posted:\n\n> IT'S TRUE! EUPHEMINA SOLO WIPED THE 1ST BATTALION!\n\n\"...\"\n\nInsane. Even Jishuka couldn't defeat the 1st Battalion alone. Two thousand troops, five specialized unit types, perfect tactical balance. That battalion had held entire Saharan Empire forces at bay. Yet Euphemina destroyed them single-handedly?\n\nAnd—\n\n> In only twelve minutes?\n\nThe initial report of Euphemina engaging the 1st Battalion had arrived exactly twelve minutes ago. As the Ares members checked the timestamp, a chill ran down every spine."
}