{
  "id": 656,
  "title": "Chapter 656",
  "content": "\"So, did I capture it? A very handsome and dashing man—practically rugged, wouldn't you say? Kelkelkel!\"\n\nAres. The God of War. The player who had come closest to claiming the title of First King. If not for Lauel's brilliant maneuvering, Grid knew, that throne would have belonged to Ares.\n\n\"First time I've heard someone call themselves handsome,\" Grid remarked. \"Isn't that a bit much?\"\n\nDespite the boast, there was something disarming about Ares. His cheerful demeanor and unremarkable features made him easy to like, the kind of person who put others at ease without trying.\n\n\"Never heard you were handsome? That's odd...\" Ares grinned and nudged Grid with his elbow. \"Or are you just playing modest in front of your lover?\"\n\n*Lover?*\n\nGrid followed Ares' gaze. Jishuka. Even in a crowd of hundreds, the South American beauty stood out—tanned skin, model-like proportions, and striking features that drew the eye.\n\n\"She's not my lover.\"\n\n\"Come on, the rumors say you conquered both Jishuka and Yura.\"\n\n\"I didn't conquer anyone—\"\n\n\"The world's finest South American flower *and* an Oriental beauty? I'm envious. If only I were ten years younger...\" Ares sighed wistfully.\n\n\"They're not my lovers. Think about it realistically. Unless I was some kind of saint who saved the universe in a past life... Actually, wouldn't I be trash for two-timing?\"\n\n\"Oho, so you're only dating Yura? Just a flash in the pan with Jishuka, then?\"\n\n\"Ugh, drop it.\"\n\nAres reminded Grid of Doran—arguing was pointless. Grid grumbled and looked away, but Ares' eyes remained steady on him.\n\n*The pure and honest type.*\n\nHard to believe this man ruled a kingdom. No pretense, emotions worn openly on his sleeve. At forty-nine, Ares had learned to spot people like Grid—the ones who wouldn't stab you in the back.\n\n*Of course, too early to be certain.*\n\nStill, the first impression was positive. The Overgeared Guild might have used underhanded tactics to force this alliance, but that was water under the bridge now. With their help, dealing with the armored elite troops had been effortless. Moving forward, a good relationship with Grid and the Overgeared Guild was clearly the smart play.\n\n\"Just joking. You're pretty narrow-minded for a hero. A man should be more generous—like me! Kelkelkel!\"\n\nAres continued needling the silent Grid. This old man... It was hard to believe he led the famous Ares Army.\n\n*We need to stay alert.*\n\n*Is this an act?*\n\nJishuka and Euphemina exchanged wary glances.\n\n\"Hah...\"\n\nScott let out a deep sigh—just like Lauel when dealing with Grid. Jishuka and Euphemina's shoulders relaxed. They were starting to understand what kind of person Ares really was.\n\n***\n\nAres genuinely liked Grid's straightforward nature. More importantly, he'd determined that the Overgeared Guild and Kingdom's strength would be essential long-term. This alliance might have been forced, but he hoped it would endure.\n\nSo he approached Grid with complete sincerity.\n\n\"Still not good enough?\"\n\nAres Castle, central training ground. Ares unveiled the ten thousand new troops he'd trained.\n\n\"My **Fostering Strong Soldiers** is only level 2, so I can grant twenty different attributes. Starting level is two hundred. Much better than the armored elite troops' baseline, though. Hahaha!\"\n\n\"...\"\n\nBoth Grid's group and the Ares Army had gathered to inspect the soldiers. For Ares to openly reveal his abilities and new army to outsiders was... absurd.\n\n\"H-Have you lost your mind?!\"\n\nScott's outburst came too late. He couldn't fathom why Ares was showing his hand to Grid and the Overgeared members. Ares merely shrugged.\n\n\"They've already seen some of what I can do. Why hide what'll come out eventually? Better to be upfront and clever about it. Kelkelkel!\"\n\n\"Hah... *sigh*...\"\n\nScott's breathing grew ragged, his usual composure shattered. His face looked so haggard he might collapse at any moment. Into the awkward silence, Grid asked a question.\n\n\"Distinct attributes? These are skills they can learn?\"\n\n\"Let's see... Advanced Riding Techniques, Advanced Heavy Armor Mastery, Intermediate Weapons Mastery, Beginner Anti-magic Shields... oh, and Beginner Charge. Quite a few, right? Lots of skill slots filled since I gave them two advanced skills right off the bat.\"\n\n\"You're not joking?\"\n\nIn Satisfy, players had two methods for training armies.\n\nFirst: build barracks in your territory. Invest capital and population to produce soldiers. Depending on barrack level, the soldiers' capabilities varied—like that famous century-old game, StarCraft. Resource-based production was convenient, but resulted in lower-level troops with mediocre skills.\n\nSecond: personally train soldiers or have NPCs handle recruitment and training. Far more work—everything required hands-on management. Time-consuming, expensive. But soldiers could learn chosen skills, and their levels rose steadily during training.\n\nGrid used both methods. Barracks-produced soldiers went to lower units like security forces. Personally trained soldiers became elite troops—especially those trained by Asmophel and Piaro, who were guaranteed high levels and diverse skills.\n\nBut granting specific *attributes* artificially was nearly impossible. They usually developed naturally during training. Piaro's soldiers, for instance, gained '120% adaptation rate increase on rice field terrain.' The bottom line:\n\n*Even soldiers directly trained by Piaro and Asmophel can't acquire dozens of different attributes, and starting with advanced skills is impossible.*\n\nSkills were learned at beginner level and progressed from there. That was how soldiers worked. Yet Ares' troops started with advanced skills.\n\nAres' ability was extraordinary.\n\n\"Broken... You're truly amazing. But such powerful skills must have drawbacks, right?\"\n\n\"Too disadvantageous for me to share. Haha!\"\n\n\"No, you should tell me. I thought you were generous.\"\n\n\"I'm generous *and* thorough.\"\n\n\"...\"\n\nBefore Grid realized it, he was bantering with Ares like an old friend. Jishuka, Euphemina, Pon, and Regas listened with keen interest. Meanwhile, the Ares troops looked confused.\n\n*What's he thinking?*\n\nThe Overgeared Guild were reliable allies—for now. But they couldn't depend on them forever. Eventually, there would be conflict. These were potential enemies. Why give away information so freely?\n\n*Grid is Kraugel's friend, too!*\n\nAres' capabilities would likely reach Kraugel's ears—a disadvantage from every angle. After studying his concerned members' faces, Ares turned back to Grid.\n\n\"So? Wouldn't it be overwhelming if my army wore your equipment?\"\n\n\"Hoh...\"\n\nThe strongest army trained by Ares, equipped with the strongest armor produced by Grid.\n\n\"The Empire? We'd tear through them. Not yet, of course. Haha!\"\n\nHe wanted to secure the Legendary Blacksmith Grid. Ares sincerely believed that combining their strengths would create an army none could stand against.\n\n\"Let's be friends.\"\n\nAres extended his hand with a laugh. In that moment, his bearing matched Grid's dignity—perhaps even surpassed it. The friendly neighborhood uncle vanished as if it had been an illusion, replaced by a bear-like, imposing presence.\n\n*As a specialist in training and commanding soldiers, a high Dignity stat makes sense.*\n\nGrid wondered about Ares' class. Setting the question aside, he grasped the offered hand.\n\n\"Yeah. Let's get along.\"\n\n***\n\nBelto Royal Palace.\n\n\"Pathetic worms. Too slow.\"\n\nThe figure on the throne wasn't the king. Agnus sat there instead—pale skin, green hair, and a sadistic smile.\n\n*Spin, spin.*\n\nA gem-encrusted object twirled in his fingers. The crown symbolizing the Belto Kingdom, reduced to a toy. The Belto King watched without protest, carefully asking:\n\n\"I've recalled all troops from the fortresses. Now the enemy can march here unimpeded... Isn't this dangerous?\"\n\nFortresses were defensive installations built at strategic military positions. Their value in warfare was immense—ideal for repelling invaders. Yet Agnus had ordered them all abandoned. The enemy could advance without resistance. Neither the Belto King nor his advisors understood Agnus' intentions.\n\nAgnus answered.\n\n\"Want to know why I gathered the kingdom's entire military here?\"\n\n\"Y-Yes.\"\n\nThe pink rose emblem on Agnus' chest kept drawing officials' eyes. The rose symbolized the Empire's second greatest power—the Red Knights, commanded by Empress Marie. The Belto King and his court were certain Agnus served as her close aide. That he'd come to help them seemed surprising, yet logical. Better to survive under a despised power than die to a traitor.\n\nUnfortunately, Agnus wasn't someone they could depend on.\n\n\"I want them to arrive as quickly as possible.\"\n\n\"...?\"\n\n\"Isn't waiting boring? So I cleared the path. Come quickly. Kukukuk—the more bodies, the better.\"\n\n\"A-Ahh...\"\n\n*This* was why he'd sacrificed so many defensive positions on the way to the capital? The Belto Kingdom's officials trembled, faces red from suppressing their rage as Agnus continued.\n\n\"When the enemy arrives, don't resist. Open the gates. Throw the people and soldiers to them. Got it? Kik! Kilkik! Puhahahat!\"\n\n\"T-This is ridiculous...!\"\n\nFinally, some nobles couldn't contain themselves.\n\n\"You're insane! I refuse to believe this is Empress Marie's will!\"\n\n\"Exactly! Don't resist and open the gates? Throw our people to the enemy? What kind of nonsense—*heeok*?!\"\n\nThe nobles fell silent. Agnus had summoned a lich.\n\n*Clack. Claaack. Clack clack clack clack.*\n\nCloaked in tattered robes, the lich radiated terrifying magical power. They didn't understand why, but every instinct screamed to flee.\n\n\"Kill them.\"\n\nAgnus' command was casual.\n\n*KUAAAAANG!*\n\nThe lich unleashed magic upon the nobles.\n\n> **[You have killed the nobles of the Belto Kingdom.]**\n> \n> **[Baal's Contractor is one who brings out the fundamental fear in humans.]**\n> \n> **[The Belto royal family and remaining nobles harbor no animosity toward you—their fear has grown too great.]**\n> \n> **[Some have overcome their fear. They intend to resist.]**\n\n\"Kik? Kill more.\"\n\n*KWARURURUNG!*\n\nThe lich who continued killing at his master's behest was named Mumud. Though his skeletal face showed no expression, he seemed to be weeping."
}