{
  "id": 657,
  "title": "Chapter 657",
  "content": "\"Something's off.\"\n\nThe Ares Army had expected to fight through thirteen fortresses before reaching Belto's capital—a campaign brutal enough to have Grid's entire group on edge. Yet fortress after fortress stood empty. No soldiers. No resistance. Not even a damn rat.\n\n\"Why abandon strategic positions?\" one of Ares' officers muttered.\n\n\"Have they surrendered already?\"\n\nGrid frowned at the vacant battlements. Fortresses existed to bleed attackers dry, to turn superior numbers into a liability. Abandoning them made no tactical sense—unless the Belto Kingdom had already given up.\n\nThe Ares Army saw it differently.\n\n\"The royal family thinks our new army destroyed their elite troops,\" one commander said.\n\nAnother nodded. \"They don't know about the Overgeared Guild's involvement. From their perspective, Ares' Fostering Strong Soldiers skill did all this.\"\n\n\"The armored elite leveled up in real-time during their campaign against the Empire. The king watched it happen.\"\n\n\"So now he fears that same trap. Spread defenders across thirteen fortresses, and each garrison becomes experience points that make our army stronger.\"\n\n\"He's consolidated everything in the capital for one decisive battle.\"\n\nAres listened, then grunted approval. \"Smart move—from their perspective.\"\n\nThe Iron Wheels still sat at level 200. Higher than Belto's average soldier, certainly, but only ten thousand strong. Ares had hoped to level them through fortress sieges. Now those ten thousand would face one hundred and thirty thousand defenders at once.\n\n*Not ideal. But not disastrous either.*\n\nBeyond the Iron Wheels, Ares commanded thirty thousand additional troops. More importantly, the Iron Wheels shared the armored elite troops' signature ability—all resources restored on level-up. Infinite combat endurance, provided they avoided overwhelming burst damage.\n\nAnd the only three players capable of such damage—Grid, Jishuka, and Euphemina—fought on *his* side.\n\nThe mild-mannered man transformed before his officers' eyes, his expression hardening into something ancient and merciless. \"Shall we educate this animal about the danger of baring its throat?\"\n\n\"OHHHHH!\"\n\nThe army surged forward, no longer wary of ambush, racing toward the capital at full speed.\n\n***\n\n\"BREAKING NEWS! URGENT BULLETIN!\"\n\nMedia outlets across the globe erupted simultaneously—South Korea, the United States, Europe, all scrambling.\n\nA group calling themselves Immortal had sent a coordinated message to every major news organization:\n\n*Today, Agnus will slaughter the Overgeared King and the God of War. Agnus will reign as king of the living and the dead.*\n\nAgnus. One of the first epic class holders. A ghost wrapped in mystery who'd never made a public appearance. But every ranker knew his name—usually because he'd killed them. \n\n*That psychopath.*\n\nA player who murdered people for the crime of existing on the same street. Now he'd announced his presence to the entire world, and his target—\n\n*—is Grid?!*\n\nFew people knew who this \"God of War\" was. But Grid? Even kindergarteners recognized the Overgeared King, one of the most influential figures on the planet.\n\n\"He's threatening to kill *Grid*!\"\n\n\"Agnus really is as insane as the rumors!\"\n\n\"Get people to Belto Kingdom NOW! I want cameras on the ground and every angle covered!\"\n\n***\n\n『Breaking: At 10:24 Korean Standard Time, media organizations worldwide received identical messages. \"Today, Agnus will slaughter the Overgeared King and the God of War. Agnus will reign as king of the living and the dead.\" Agnus currently ranks 5th on the unified rankings and holds one of the first epic hidden classes...』\n\n『Analysts note the phrase \"king of the living and the dead.\" Many speculate Agnus' class is Lich, which would explain reports of his apparent immortality...』\n\n『Veradin, self-proclaimed follower of Agnus, earned recognition as one of the Ten Rookies and now ranks 1st among necromancers. His allegiance to Agnus suggests extraordinary power...』\n\n『Immortal likely commands an undead army led by Lich Agnus and Necromancer Veradin—possibly the strongest force after the Overgeared Guild. Using Grid as a measuring stick would cement their reputation...』\n\n『But can Agnus actually win? Doubtful. Before Kraugel and Yura vanished from the rankings, Agnus held 7th place despite having the first epic hidden class. Seventh isn't low, but it suggests he lacks the raw talent of top-tier geniuses.』\n\n『Agreed. The Lich class offers overwhelming power through infinite mana and survivability, but Agnus himself seems limited. Give Kraugel the same class and he'd dominate. Declaring to the entire world that you'll slaughter Grid—who only Kraugel has ever defeated—borders on delusional.』\n\nMost coverage obsessed over the Grid-versus-Agnus angle. The mysterious \"God of War\" received barely a footnote.\n\nBut those with deeper knowledge paid attention.\n\nOGC Director Lee Gookrae stared at his monitor, brow furrowed.\n\n*The God of War. Nobody earns that title by being weak.*\n\nWhile competing broadcasters fixated on Agnus, OGC smelled a bigger story. They needed to identify this God of War before anyone else.\n\n***\n\n\"UNBELIEVABLE!\"\n\nReinhardt, capital of the Overgeared Kingdom.\n\nLauel tore off his headset, face ashen. Agnus? That rabid monster was siding with Belto Kingdom to ambush Ares?\n\n*No.*\n\nGrid and Ares had walked into a fight between two apex predators. Colliding with Agnus unprepared would leave Grid exhausted and vulnerable.\n\n*How did this spiral so fast? No... we were played from the beginning.*\n\nVeradin of the Immortal Guild.\n\nThe realization hit like cold water.\n\n\"Veradin...! This entire scenario—you *predicted* we'd ally with Ares!\"\n\nLauel had watched Veradin carefully since their days among the Ten Rookies. Lauel considered himself the world's premier strategist, but Veradin's intellect and ruthless pragmatism commanded grudging respect.\n\n*The devil I knew in my past life...*\n\nThe trap made horrible sense now. Veradin had anticipated the Overgeared-Ares alliance and engineered a scenario to eliminate both forces simultaneously.\n\n*God knows what else he's prepared.*\n\nLauel opened the whisper interface, fingers trembling.\n\n-Grid, come back right now—!\n\nThe response came before he could finish.\n\n-Why? Is it because of Agnus?\n\n-...!!\n\n***\n\nLet's rewind to before Immortal's message reached the media.\n\n\"What the hell?\"\n\nThe combined army stood before Belto's capital, strategies for breaching 130,000 defenders dying on their lips. The gates stood open. The walls—empty.\n\n\"A trap?\"\n\n\"If this is a trap, it's the dumbest one in history.\"\n\nOpen gates meant surrender, not ambush. Ares was cautious, but never paralyzed by caution.\n\n\"Everyone inside. Let's see if they're stupid enough to fight us in the streets or if they've already fled.\"\n\n*BOOM. BOOM. BOOM.*\n\nThe army surged through the gates, Ares at their head. Soldiers filled the streets in scattered clusters—no formations, no command structure.\n\n\"H-HIIK—!\"\n\n\"The enemy! Rebel Ares has reached the capital!\"\n\n\"D-Don't fight us!\"\n\n\"...?\"\n\nBelto Kingdom's forces moved like panicked civilians, not trained soldiers. They charged mindlessly, leaderless.\n\n*What happened here?*\n\nThe command structure had collapsed entirely. Some catastrophe had gutted the capital's military hierarchy.\n\n*Whatever it was, fortune smiles on us.*\n\nAres led his troops into the slaughter. The level 200 Iron Wheels began climbing steadily.\n\nHours passed in brutal street fighting before they reached the palace gates.\n\nScott stared at the silent, pristine palace—untouched by the chaos surrounding it. \"This feels wrong.\"\n\n\"Suspicious as hell,\" someone agreed. \"But we can't stop now.\"\n\nThey needed the king. Victory lay within reach, and the enemy army was shattered.\n\n*Click.*\n\nAres pushed open the palace entrance.\n\n*SHING!*\n\nPurple light exploded from the darkness. Death knight. Surprise attack.\n\n\"Hup!\"\n\nLeading forty thousand troops had dramatically boosted Ares' stats. He twisted aside, the spectral blade carving empty air. But magic detonated exactly where he'd dodged.\n\n*KABOOM!*\n\n\"ARES!\"\n\nFlames swallowed their commander.\n\n\"Kik! Kikikiki! KUHAHAHAHAHAT!\"\n\nLaughter echoed from shadows so deep that light couldn't touch them.\n\n*Who—?*\n\nGrid had never heard that deranged sound. But around him, the Ares veterans—Jishuka, Euphemina, Pon, Regas—went corpse-pale.\n\n\"Agnus!\"\n\n*CRASH!*\n\n*Clack! Clackclackclackclack!!*\n\nThe palace vomited skeletons in a surging tide. Fallen Belto soldiers lurched upright as zombies, turning on Grid's group and the Ares Army.\n\n*CLANG! CLANG!*\n\n*BOOM!*\n\n\"AGNUS!\"\n\nScreams and explosions overlapped. Pandemonium. The combined force reeled in confusion—\n\n—except Grid.\n\nHe'd already pulverized several skeletons, gaze locked on a figure in the darkness.\n\n\"You're Agnus?\"\n\n\"And you must be the Overgeared King~? Yes~? Kilkil.\"\n\nGolden eyes met Grid's.\n\n*WHAM!*\n\nA death knight smashed through the Iron Wheels' formation, blade whistling toward Grid's head. Different from the one that attacked Ares.\n\n*CRACK!*\n\nGrid's weapon intercepted the strike.\n\n*BOOM!*\n\nLich magic hammered his chest simultaneously.\n\n[You have suffered 11,900 damage.]\n\nIn that exact moment—\n\n-Grid, come back right now—!\n\nLauel's whisper arrived. Perfect timing to assault Grid's pride, with hundreds of cameras broadcasting worldwide.\n\n-Why? Is it because of Agnus?\n\n-...!!\n\n-Did you really think I'd run away?\n\n*Shhk.*\n\nThe Slaughterer's Mask materialized on Grid's face.\n\n*CRACK!*\n\n*CRACKCRACKCRACK!*\n\nHis four God Hands morphed, golden light coalescing into Lifael's Spear.\n\n\"Didn't realize today was mad dog hunting season.\"\n\n\"Kik?\"\n\n*KABOOOOOM!*\n\nBrilliant radiance. White lightning swallowed the battlefield's heart whole."
}