{
  "id": 658,
  "title": "Chapter 658",
  "content": "**Chapter: Convergence**\n\n---\n\nAcross the world, life stopped.\n\nStudents lowered their heads in class—not to their textbooks, but to the phones cupped in their palms. Office workers abandoned their spreadsheets. Train passengers pressed against windows, squinting at their screens. Even pedestrians halted mid-stride on crowded sidewalks, oblivious to the flow of bodies around them.\n\nOn every screen, the same battlefield unfolded.\n\nThe city sprawled vast and chaotic, a maze of stone buildings and narrow streets where Ares' troops surged like a crimson tide. They moved with precision—shields locked, blades flashing, grappling hooks deployed to scale walls in coordinated waves. The Belto Kingdom's defenders crumbled before them, scattered and directionless as autumn leaves in a storm.\n\n*This is a player's army?* \n\nThe thought rippled through millions of viewers simultaneously. The Ares commanders adapted in real-time, exploiting alleys and rooftops, their tactical awareness reminiscent of legendary generals from history books. Watching the disciplined advance, spectators couldn't help but draw comparisons to the Saharan Empire's own military machine.\n\nBelto's capital teetered on the brink. No coordinating officer emerged. No rallying cry turned the tide. The viewers leaned closer to their screens, hearts racing with the thrill of witnessing overwhelming power unleashed.\n\nThen Ares himself appeared at the vanguard—a titan carving through enemy lines with brutal efficiency. Now they understood why Agnus had called him the God of War.\n\nBut understanding came too late.\n\n*Clack.*\n\n*Clack-clack-clack.*\n\nThe sound rolled across the battlefield like a herald of doom. The moment Ares' forces breached the palace courtyard, everything changed. A death knight rose from the cobblestones—massive, armored, ancient. Behind it, a lich materialized in robes that seemed woven from midnight itself.\n\nThe frontline shattered.\n\nSkeletal warriors erupted from the ground in waves, drowning Ares' advance in a tide of bone and rusted steel. Soldiers who'd fought with machine-like precision moments before now screamed and flailed against enemies that felt no pain and knew no fear. \n\nSlaughter followed. Then destruction. The cameras captured every desperate stand, every futile blade swing.\n\nAnd through the carnage, two figures converged.\n\n*『Finally!』* the broadcaster's voice crackled with excitement. *『The moment we've been waiting for—Agnus and the Overgeared King!』*\n\nGrid stood at the center of a golden constellation. Four hands wrought of shimmering metal orbited him like satellites, each one wielding his massive blue greatsword with independent will. Around him, skeletons collapsed into dust as the God Hands carved protective circles through the undead masses.\n\nAgnus approached through the gap his own army had created, the death knight and lich flanking him like demonic honor guards. His skeletal warriors parted before him in reverence.\n\n*『Can Agnus make good on his promise to slaughter the Overgeared King?』*\n\n*『This is puzzling,』* another commentator interjected. *『Why close the distance at all? Agnus has every advantage at range. Keep the death knight forward, the lich in support, whittle Grid down from safety—that's the obvious strategy.』*\n\n*『Pure arrogance,』* came the response. *『He has two death knights. Two liches. He's so confident in his overwhelming advantage that he's giving Grid favorable conditions. This isn't strategy—it's contempt.』*\n\nThe analysts didn't understand Agnus' true class. A lich summoning another lich? Impossible. Which meant—\n\n*『Agnus has transcended normal classifications. Whatever hidden growth class he's unlocked, it's shattered game balance. Multiple death knights, multiple liches—no player should wield this much power.』*\n\n*『Yet we shouldn't count Grid out,』* a veteran commentator cautioned. *『He defeated Kraugel. Agnus' strength comes at a cost—it has to. These abilities must carry brutal penalties.』*\n\n*『The brighter the flame, the heavier the price...』*\n\nBut the spectators didn't know what Grid knew: death knights weren't just strong—they were *strategic nightmares*. \n\nThird-generation necromancy's apex creation. Depending on the knight's former life, their base statistics could dwarf even high-level players by multiples. They retained combat skills from life, gained new abilities in undeath, and—most terrifyingly—continued to level up like players. \n\nTrue, limitations existed: restricted equipment slots, difficult control schemes, loyalty issues. But these weaknesses paled against the fundamental truth that a single death knight could turn the tide of any normal battle.\n\nAgnus commanded *two.*\n\nAnd beyond them, the liches. Bosses in their own right. Undead spellcasters with supposedly infinite mana reserves, each one powerful enough to make death knights serve as mere guards. Players weren't meant to control such entities—they were designed as endgame antagonists, perhaps achievable only at a necromancer's fourth advancement.\n\nYet Agnus wielded two of them as casually as a warrior might carry spare swords.\n\nThe conclusion seemed inescapable: brutal penalties must shackle such power. Balance demanded it. Grid would find that weakness and exploit it.\n\nThey hoped.\n\n---\n\n**[Lifael's Spear]**\n\n**Rating:** Legendary (Reproduced Transformation)  \n**Durability:** Infinite  \n**Attack Power:** 1,230~1,890  \n\n* Fixed damage of +3,000 on each attack.\n* High probability of activating 'Light Wheel.' Each activation fires Magic Missile (Enhanced). Number of missiles scales with Light Wheel's area of effect. Magic Missile deals 4,000 fixed damage per hit (+20% against evil targets). No mana cost.\n* When defending or evading, high probability of activating Shield of Light. Magic Missiles attach to the shield. Any attack penetrating the shield triggers automatic Magic Missile counterattack. 4,000 fixed damage per hit (+20% against evil targets). 100% accuracy. No mana cost.\n* When moving, high probability of activating 'Light of Guidance.'\n* +20% attack power against targets with dark magic power.\n\n---\n\nGrid hadn't crafted the reproduced Lifael's Spear for himself. Every hammer blow had been struck for Isabel—for her safety, her happiness. Yet in creating perfection for another, he'd gained something extraordinary for himself: complete understanding of a myth-rated divine weapon. \n\nNow he could replicate its power. Modified, yes—weakened White Transformation, enhanced specialized abilities—but functional. And he'd made *four.*\n\n*Crackle—!*\n\n*CRACK-CRACK-CRACK!*\n\nAround him, the four God Hands ceased their defensive pattern. Golden light erupted from their cores as metal flowed like water, reforming, extending. Four swords became four spears, divine power bleeding into the air with electrical intensity.\n\nAgnus' pupils contracted. Even at distance, he felt the sanctified energy radiating from the transformation.\n\n*'Kukuk! Basic tactics!'*\n\nOf course the Overgeared King would carry anti-undead weapons. Satisfy teemed with undead monsters. Any competent player prepared accordingly. Agnus' grin widened—\n\n\"Didn't realize today was a mad dog day,\" Grid said.\n\n\"What—?\"\n\n*KWAAAAAH!*\n\nThe spears spun. Four became one became a wheel of radiant destruction that engulfed Agnus' position entirely. Magic Missiles erupted in their wake—dozens, then hundreds, each one a lance of divine wrath that scoured the battlefield clean.\n\n**BOOM-BOOM-BOOM-BOOM-BOOM!**\n\nThe Ares troops froze mid-battle, their weapons slack in their hands.\n\nThe detonation vaporized dozens of skeletons instantly. The sheer *scale* of devastation rivaled Grid's Red Phoenix flames. Maybe exceeded them.\n\n*What ARE those golden hands?*\n\n*They adapt to each enemy. Transform. And the firepower...*\n\nThe title of Overgeared King was well-earned. No one could dispute that now. Grid's arsenal transcended normal player capabilities entirely.\n\n*Even Agnus can't withstand—wait.*\n\nThe dust cleared.\n\nAgnus stood untouched. Not even his hair had been disturbed. \n\nBody Shield—the Baal's Contractor signature defense. Unlike typical necromancers who crumbled under physical assault, Agnus' class granted exceptional bodily resilience. The Body Shield absorbed any single attack dealing less than 10,000 damage completely. One perfect block, similar to Grid's Overgeared Skeletons' one-time protection, but far more potent given the damage threshold.\n\n\"Pathetic!\" \n\nAgnus' voice cut through the settling dust. For someone so erratic, he fought with surprising calculation. This battlefield—carpeted with fresh corpses—hadn't been chosen randomly. Every fallen soldier was potential ammunition.\n\nGrid cursed and surged forward.\n\nThe death knight intercepted, massive blade descending like a guillotine.\n\n*Shing-shing-shing-shing!*\n\nFour divine spears pierced through armored chest, greaves, shoulders, helm—opening a corridor through the undead guardian's very body. Grid sprinted through the gap before the death knight could collapse.\n\n\"Kuahahaha! Come, then!\"\n\nAgnus spread his arms in welcome, confidence radiating from his posture. The lich hovered at his shoulder, spell matrices already forming. Grid would never reach him. The magic would—\n\n> [You have dealt 5,700 damage to the target.]  \n[The target has resisted the damage.]  \n[The target has resisted the damage.]  \n[You have dealt 6,100 damage to the target.]\n\n*Full resistance?!*\n\nThe Holy Light set. Grid's equipment choice made mocking sense now—he'd anticipated this exact scenario. The lich's spells splashed against holy-aspected armor like water against stone.\n\n\"Pagma's Swordsmanship!\"\n\nGrid's boots hit the cobblestones in a dead sprint. His massive blue blade—Failure, enhanced to +9—swept up in a devastating arc.\n\n*Thwack!*\n\n\"**Linked Kill!**\"\n\n\"Body Shield!\"\n\nThe blade found Agnus' chest. For one crystalline instant, the necromancer's smug expression fractured into disbelief.\n\n*Crack!*\n\n> [The target's attack power is too strong. The defense has failed.]\n\n\"Wha—*urk!*\"\n\nSteel punched through ribs. Blood erupted from Agnus' lips as Grid twisted, already transitioning into Linked Kill's second strike—\n\n*BOOM!*\n\nA corpse exploded between them. The shockwave broke Grid's momentum, snapping his combo chain. \n\n*Dammit!*\n\nLinked Kill—*cancelled.* \n\nGrid stumbled backward. Agnus' longsword materialized in his off-hand, thrusting forward with viper speed.\n\n*Clang!*\n\n> [You have suffered 2,859 damage.]\n\nGrid's eyes widened. \"...What?!\"\n\nBaal's Contractor was a necromancer class. Necromancers didn't *do* melee. And that damage—despite the Holy Light set's weaknesses, this output made no sense from a caster class.\n\nAgnus' tongue clicked against his teeth. \"That was a normal attack.\"\n\nGrid's eyebrows shot toward his hairline.\n\n\"*That's Jishuka's line!*\"\n\nHis outraged shout died abruptly.\n\n*CRASH!*\n\nThe death knight—isolated by the four divine spears—suddenly surged through their defensive perimeter. Its armored fist connected with Grid's shoulder, not dealing devastating damage but triggering a knockback effect that sent him skidding across the blood-slicked stones.\n\n\"Want to see something interesting?\"\n\nAgnus' grin split his face. He raised one hand, dark energy coalescing around his fingers as he opened the Rune of Death—acquired long before Grid had ever obtained his Rune of Darkness. Nine skills nested within its corrupt lattice, each one purchased with terrible prices.\n\n\"**Furfu's Power.**\"\n\nGrid's blood ran cold.\n\nA great demon's name. \n\nIn that moment, he understood the gulf between them. When Agnus had been signing contracts with Hell's nobility, Grid had been a nobody—just another nameless player grinding rats outside a starter village.\n\nTheir starting lines had never been equal."
}