{
  "id": 659,
  "title": "Chapter 659",
  "content": "Furfu. Hell Gao. Drasion. Morax. Astaroth. These five great demons lived in legend—their names scattered across quest texts and dusty tomes, immortalized in the chronicles of Muller's heroism.\n\nMuller had sealed their bodies. Two billion players knew those names.\n\n\"Furfu's Power.\"\n\n\"Furfu...?\"\n\nThe Overgeared members and Ares' troops paled. Ordinary viewers, unfamiliar with runes, simply looked confused. Then—\n\n*Swaaaaah!*\n\nThe night sky bleached white. Frost poured down like rain, transforming the battlefield.\n\n'Blizzard magic?'\n\nGrid and the Overgeared members raised their guards.\n\n\"It isn't magic!\" Ares' voice cracked with urgency. He fought alongside Luck and Scott against a death knight and lich, barely holding the line. \"It's Furfu's power...!\"\n\nYes—the very power Ares had coveted. Agnus had claimed it first.\n\n\"Dammit...! Watch out for Agnus' familiars—!\"\n\n*Kuaaaaang!*\n\nThe warning drowned beneath an aura explosion. The death knight—bound moments ago by Luck—erupted with violet energy that shifted transparent as ice.\n\n\"Keok!\"\n\nAres coughed blood, clutching his chest. As a commander, he'd invested everything in stamina and health for survivability. Yet a single blow had nearly broken him.\n\n\"Ares...! You bastard!\"\n\nThe death knight ignored everyone else, fixated solely on Ares. Luck spun like a top, building momentum, then launched a devastating kick at the creature's skull.\n\n*Peeok!*\n\nHeavy impact. The skull should have shattered—Luck's strike carried that much force. But frost crystallized midair, forming a barrier that nullified the blow entirely.\n\n\"What?\"\n\nComplete bullshit! While Luck reeled, Scott stayed calm, analyzing the situation.\n\n\"The caster...! Attack Agnus!\"\n\n\"....!\"\n\nScott's shout pierced through to Grid.\n\n*If only I'd secured a rune before raiding Hell Gao.* Envy and regret churned in Grid's chest as he watched Agnus wield Furfu's power. *My rune would have Hell Gao's strength instead.*\n\n\"Yes.\"\n\nHe snapped back to focus. All the Magic Missiles from Lifael's Spear shattered harmlessly against Agnus' Body Shield. Agnus fought with his back protected by the death knight and lich—a perfect defense.\n\n\"Our starting points were the same...!\"\n\nAn excuse. Grid had played Satisfy since closed beta. Why was he weaker while Agnus became Baal's Contractor? Not timing. Talent. Skill. Nothing else.\n\n'But I closed that gap...!'\n\nGrid recalled his journey as he activated the power within his Rune of Darkness. Had he been lacking since becoming Pagma's Descendant? No. He'd already caught Kraugel—the sky above the sky.\n\n\"...I'll fill whatever remains!\"\n\n*Hwaruruk!*\n\nFlames engulfed Grid from head to toe. Red light flickered across his eyebrows and hair. Belial's Power—the fire queen's might—awakened.\n\n\"...!!\"\n\nAgnus' eyes widened, his expression shifting despite the support of Baal sustaining Furfu's Power. The intensity of those flames felt sharp enough to warp flesh.\n\n'That's right!'\n\nThis was a great demon's true power—incomparable to weakened Furfu, sealed and broken by Muller!\n\n*Duguen!*\n\nA wide smile split Agnus' face. This moment thrilled him. Grid had claimed that power, taking one step ahead. Now Agnus glimpsed what he would eventually possess.\n\n\"Kik! Kilkil! Kuhahahat! Come!\"\n\nAgnus' voice rang with momentum, but he didn't engage directly. His hand shot skyward, releasing Furfu's strength to block Grid.\n\n*Clack!*\n\n*Clack clack!!*\n\nFifty skeleton warriors materialized, armed with swords and shields. Baal's Contractor granted unique skills that enhanced summons' stats, and Furfu's Power amplified them further—each skeleton warrior matched a level 250 user.\n\nA one-man army. The phrase fit Agnus perfectly. But Grid had already proven such forces helpless against him.\n\n\"Flames of Hell Path!\"\n\n*Hwaruruk!*\n\nThe blazing Grid charged forward.\n\n*Chwaruruk!*\n\n*Clack! Clack clack!!*\n\nSkeleton warriors melted. Frost evaporated before reaching him.\n\n\"Hah!\"\n\nAgnus' admiring smile deepened. Grid dealt damage despite Furfu's power protecting the summoner twice over.\n\n'Did he already know about Furfu's Power?'\n\nOf course—this was the man who'd defeated that rat Kraugel.\n\n*Clink!*\n\nAgnus commanded twenty skeleton archers behind him. Unlike the warriors' durability, these archers sacrificed defense for devastating attack power.\n\n*Ping!*\n\n*Pipipipiping!*\n\nBone arrows streaked toward Grid as he closed the distance. His momentum never faltered.\n\n\"Pagma's Swordsmanship, Transcend.\"\n\n*Kuwaaaaaang!*\n\nThe instant Grid saw those arrows, his attacks shifted to ranged.\n\n*Pepeng!*\n\n*Pepepepeong!*\n\nEnergy blades intercepted the projectiles. Explosions threw the unbalanced skeleton archers to the ground. Agnus recalled them immediately.\n\nGrid stood before him.\n\n\"Kill!\"\n\n\"I won't allow it!\"\n\n*Kwajak!*\n\nThe death knight moved—freed from the God Hands wielding Mjolnir after Item Transformation ended. It positioned itself between Grid and Agnus, releasing aura. The collision between Kill and that energy sent shockwaves through the ground.\n\n\"Corpse Explosion!\"\n\nAgnus detonated bodies rising from the trembling earth. Or tried to. The corpses refused to explode.\n\n\"Eh?\"\n\nAgnus froze. The skill activated. Mana drained. But nothing happened. His sharp eyes caught a black ring on Grid's finger.\n\n\"Dispel!\"\n\nHe recognized it instantly. Dark Bus' Ring. Grid had equipped it deliberately to prevent Corpse Explosion from canceling his sword dance.\n\n\"Pagma's Swordsmanship!\"\n\n*Paaaat!*\n\nThe death knight collapsed under Kill's assault. Grid closed the final distance and unleashed his ultimate skill.\n\n\"Linked Kill Wave Pinnacle.\"\n\n\"Kuk...! Kuhahahahat!\"\n\nThe blue greatsword's energy—enhanced by flames—reminded Agnus of ultimate boss monsters. Thrill coursed through him as the fiery +9 Failure aimed for his vital point.\n\n*Puok!*\n\nThe strike pierced Agnus' heart, beginning Linked Kill.\n\n*Puoook!*\n\nThe second blow hit the same spot. Grid's precision dropped Agnus' health gauge instantly—overwhelming damage that rendered Baal's Contractor's Mana Shield meaningless.\n\n\"From now on...!\"\n\nThe true power of Linked Kill Wave Pinnacle would manifest when the third strike landed. Grid sharpened his concentration to its absolute limit. Agnus still smiled.\n\n\"Peong—\"\n\nA sound emerged just before Grid's third consecutive strike.\n\n*Kwajajajajak!*\n\nJishuka, Euphemina, Pon, and Regas gasped as the lich suddenly fired magic at Grid.\n\n\"No way!\"\n\nThe stronger the species, the higher the ego. They'd been certain the lich's aggro wouldn't shift to Grid despite their attacks. They were wrong. Agnus' dominance violated common sense.\n\n\"Kuaaaack!\"\n\n\"Kuhahahahaha!\"\n\nAgnus laughed as Grid screamed, lightning striking from behind. Laughed as the sword dance canceled. But the laughter died quickly.\n\n'Dead?'\n\n*Swaaaaah!*\n\nGrid turned gray after the lich's magic hit? Agnus' mind reeled. Grid wouldn't die from that magic alone. Even if he did, his legend's passive would trigger an immortal state. So how—?\n\n'Don't tell me...!'\n\nAgnus whipped his gaze behind him.\n\n\"Too late! Shit!\"\n\n*Puoook!*\n\n\"Keeok!\"\n\nGrid's third Linked Kill struck from the side, slamming into Agnus' ribs. Grid had used Position Change with Randy.\n\n『 Ninja...! 』\n\nCommentators worldwide erupted. The Japanese commentator particularly lost his mind, seeing Grid's swap technique as reminiscent of ninjas, revealing unnecessary pride. At this moment, no one doubted Grid's victory. Grid himself saw Agnus' health gauge flickering like a dying flame.\n\n'It's over!'\n\nGrid began linking Wave when Agnus' sullen voice reached his ears.\n\n\"Bentao's Mockery.\"\n\n*Peok!*\n\n> [You have suffered 1,930 damage.]\n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\n\"...?!\"\n\nGrid's confusion peaked. The situation made no sense."
}