{
  "id": 66,
  "title": "Chapter 66",
  "content": "# Chapter 66\n\n> **[Quest Success!]**\n> \n> **[You have obtained the status of 'Eighth Servant.']**\n> \n> **[The skill 'Infinite Faith' has been created.]**\n> \n> **[The skill 'Teaching Doctrines' has been created.]**\n> \n> **[The skill 'Divine Punishment' has been created.]**\n\nYura had traveled across the northern reaches of the Eternal Kingdom, rescuing three hundred believers one by one. The quest was finally complete. The Seven Servants were now Eight, and the power of the Yatan Church had grown stronger still.\n\nShe pulled up the details of her new skills.\n\n**[Infinite Faith]**\n\n*The growth rate of your faith will double.*\n\n*Passive Skill.*\n\n**[Teaching Doctrines]**\n\n*Lv. 1*\n\n*Preach the doctrines of the Yatan Church and cover a single target with the property of darkness. The dark property will prevent the use of divine spells for 4 seconds, and will deal 1.5x damage for 2 seconds.*\n\n*Mana Consumption: 800*\n\n*Skill Cooldown Time: 100 seconds*\n\n**[Divine Punishment]**\n\n*Summons a lightning bolt that deals 15,000~23,000 damage within 10 meters.*\n\n*Range of Damage: 3m radius around the target.*\n\n*\\* If you use this skill to kill an enemy, your faith will rise by 50 points for each killed enemy.*\n\n*Mana Consumption: 4,000*\n\n*Skill Cooldown Time: 1,200 seconds*\n\nBlack magicians had always suffered from one critical flaw: inferior attack power compared to other mage classes. Now, reborn as the Eighth Servant, Yura had finally overcome that weakness.\n\nA moment later, every user in Satisfy received the same notification.\n\n> **[The Eighth Servant of God Yatan has been born. The believers of Yatan who witnessed the power of God Yatan will have their faith deepened.]**\n> \n> **[The influence of the Yatan Church will increase throughout the continent.]**\n> \n> **[The minimum level for Yatan believers has risen from 160 to 170.]**\n> \n> **[Players who are part of the Yatan Church will benefit from a 20% increase in experience for the next 72 hours.]**\n> \n> **[If the Yatan Church continues growing like this, their forces will become strong enough to form one nation.]**\n\nAn emergency. Dozens of nations across Satisfy declared their intent to subjugate the Yatan Church. They could not tolerate the growth of a religion that harmed innocents in the name of sacrifice to their dark god.\n\nUsers everywhere were bombarded with quests related to the Yatan Church subjugation. The Eternal Kingdom was no exception. In the north, Earl Steim declared a large-scale expedition.\n\n\"This time, I will root out every last seed of the Yatan Church in the north!\"\n\nSubjugation quests spread like wildfire. Users cooperated, searching for the Yatan Temple in every corner of the northern territories.\n\nThe Yatan Church did not take this lying down.\n\n\"This is our opportunity! Show the pagans the greatness of God Yatan! Dye the continent in the color of our God!\"\n\nTallos, the First Servant and bishop of the Yatan Church, was known as the continent's strongest black magician. After his declaration of war, millions of users belonging to the Yatan Church received numerous war-related quests.\n\nThe Alliance versus the Yatan Church. A large-scale conflict that would reshape the political landscape of the continent had begun. Since the launch of Satisfy, no event had matched this scale. The entire world watched.\n\n*『Will the alliance stop the Yatan Church?』*\n\n*『If the Yatan Church wins and establishes a nation, what kind of story will develop?』*\n\n*『The Yatan Church is evil! Users must cooperate and wipe them out!』*\n\n*『As you know, the cause of these events is the Eighth Servant. Rumor has it the Eighth Servant is a user, not an NPC. If that's true, there's only one possible candidate...』*\n\n*『5th on the unified rankings! Blood Witch Yura! The world must pay attention to her!』*\n\nThe media treated it as a massive story, even larger than the appearance of the first second class user. Any news related to the Yatan Church dominated headlines worldwide.\n\nHowever, Grid existed in an entirely different world.\n\n\"I need to complete my class quest...\"\n\nOver the past ten days, Grid had produced various armor sets. He was now fully equipped in rare and epic gear. And yet.\n\n\"Ugh... Kesan Canyon is still too difficult, even armed to the teeth like this.\"\n\nKesan Canyon. One of the worst areas in the entire north.\n\nThe terrain of the winding canyon made movement treacherous. The cliffs on both sides rose so high they seemed to swallow the sky, creating an ominous atmosphere thick with dread.\n\nThe real problem lay in the hundreds of caves, large and small, dotting the canyon walls. Monsters and mysterious creatures hidden within those caves averaged level 160 or higher. They emerged the instant they detected travelers. Moving carelessly meant becoming a rat in a trap. It was no wonder Kesan Canyon ranked among the five forbidden zones in the Winston region.\n\nGrid had ventured into Kesan Canyon searching for clues to Earl Ashur's quest. He'd died more than ten times.\n\n*I'm different now. My stats are better than when I was a warrior, and I have incredible items. Don't lose courage so easily... gah!*\n\nDespite his internal pep talk, Grid couldn't bring himself to enter. He knew for certain he'd die within minutes. Eventually, he started blaming Khan's ancestor.\n\n\"No, seriously, why would that insane ghost draw the picture in Kesan Canyon of all places?\"\n\nHis resentment changed nothing. He needed to enter Kesan Canyon to complete the class quest. Reality wouldn't bend no matter who he blamed.\n\n*Should I stop crafting for now and level up from hunting? If I reach level 150, I should be able to fight the monsters in Kesan Canyon... No, dammit. I can raise my level anytime! I need to pay off the debt. But if I don't delay the quest, I can obtain Dainsleif faster. Ugh! Isn't there something else I can try? Wait...*\n\nAn idea struck him.\n\n\"Item Creation!\"\n\n**[Legendary Blacksmith's Creation Skill]**\n\n*You can create three equipment item production methods every time the skill level of 'Legendary Blacksmith's Craftsmanship Skill' increases.*\n\n*Number of items that can be created at present: 5/6.*\n\n*\\* When items are produced using this skill, the name of the creator is automatically inscribed on the item.*\n\nHe'd been unable to craft Failure due to lacking blue orichalcum. But Grid had learned from that experience. He was confident he could create the right item this time.\n\n\"Yes, I'll make an item! Something that'll let me counter the monsters in Kesan Canyon.\"\n\nGrid had died ten times in that accursed canyon. He knew the general tendencies and attributes of the monsters lurking there.\n\n\"Alright, let's do this. Legendary Blacksmith's Creation!\"\n\nGrid was about to create an item with an entirely new concept.\n\n***\n\n\"Twenty-nine days left. Can't wait for the reunion~\"\n\n\"That reminds me, what about Youngwoo? Will he show up this year? Has he changed at all?\"\n\nA group that had been friends for ten years since high school traveled through the northern region of the Eternal Kingdom. Shin Youngwoo's former schoolmates. They were discussing the upcoming reunion, and naturally, Shin Youngwoo himself.\n\n\"Are you curious? You really think he'll come? Everyone else studied abroad or found jobs, while he's playing games and drowning in debt. Won't he be too embarrassed to show his face?\"\n\n\"True. He was ignored by everyone at the last reunion.\"\n\n\"Ugh, if I were Youngwoo, I'd seriously think about suicide. Not that I think Youngwoo *should* kill himself, of course.\"\n\nDuring his school days, Shin Youngwoo had been utterly unremarkable. His grades hovered in the middle. His athletic ability was average. He followed everyone else to a mediocre university. Back then, no one really mocked him.\n\nNow, things were different. All the alumni ignored him, laughed at him. Frankly, most of them weren't doing particularly well either. Some had graduated and landed grueling corporate jobs. Others were still studying. They'd all experienced the ruthlessness of society, felt the sting of disappointment at failing to find ideal employment or academic opportunities. It was a period of tremendous anxiety.\n\nIn such times, Shin Youngwoo made a perfect target.\n\n*At least I'm better off than him.*\n\nThey comforted themselves with that thought when they looked at Shin Youngwoo. A person worse off than themselves? They couldn't resist poking fun at him. At this point, they could hardly be called 'friends.'\n\n\"Speaking of which, it's amazing. Hasn't Youngwoo been playing Satisfy since launch? We started late and only play after work or on weekends, but we're already over level 80. So what's he been doing?\"\n\n\"Right? If I played Satisfy full-time like Youngwoo, I'd already be a ranker. Pathetic, truly pathetic. Youngwoo doesn't even have talent for games.\"\n\nThey laughed among themselves. Then they noticed something strange.\n\n\"Where are we?\"\n\n\"Well... this place isn't on the map. What?\"\n\nThey weren't from the north, so they had no concept of how dangerous the region could be. No way to know when high-level monsters might chase them or when they might fall into a trap.\n\nThat's right. These travelers had fallen for a trap designed by goblins and lost their way.\n\n\"Huff... huff...\"\n\nThey walked and walked. No matter how long they traveled, they couldn't see the end of the vast snowfield.\n\n> **[You feel hungry.]**\n> \n> **[You have started to feel dizzy.]**\n> \n> **[Your health is slowly falling.]**\n\nWarning notifications flashed constantly, signaling danger.\n\n\"What do we do? We didn't set a new resurrection point after coming north, did we?\"\n\n\"Ah... you're right. This is bad. If we die here, won't we resurrect in Amsland? Doesn't that mean three days of travel down the drain?\"\n\n\"I'm more worried about the experience loss, dammit! We'll die from freezing to death, not even from hunting! What the hell is this?\"\n\nThey'd been heading to Winston to pick up quests, only to get hopelessly lost in the far north.\n\n\"Huh?\"\n\nPain, despair, and anger twisted their faces. Then they suddenly brightened. They'd reached the end of the snowfield and found a canyon.\n\n\"Let's go there!\"\n\nThey fled the snowfield in a rush. The canyon before them was massive, boasting scenery more impressive than the Grand Canyon.\n\n\"Wow! Is this real? I've never seen anything like this! Not even in movies!\"\n\n\"Who needs to travel the world these days? Adventures in Satisfy are way better.\"\n\n\"Hey, you think Youngwoo's been playing tourist this whole year in Satisfy?\"\n\n\"Puhahaha! It's possible. *An enjoyable trip traveling around Satisfy~!* Wow, isn't Youngwoo unexpectedly romantic?\"\n\nThe group forgot they'd been on the verge of death moments ago. They were too captivated by the canyon's breathtaking views.\n\n\"So where is this place? Is it on the map?\"\n\n\"Let me check. Ah, I see it. Ke... san. This is Kesan Canyon?\"\n\n\"Kesan? I feel like I've heard that before.\"\n\n\"Isn't scenery this rare in Satisfy? Maybe it's a famous tourist spot.\"\n\n\"Hmm, but isn't it too quiet to be a tourist spot?\"\n\n\"Wait. Do you hear something?\"\n\nThe expressions of the party members gradually stiffened. No matter where they looked, they were alone in this vast canyon. Not even animals. Nothing but the howl of wind through stone.\n\nAn ominous feeling crept over them.\n\n\"I've got a bad feeling. Let's get out of here.\"\n\n\"Y-Yeah.\"\n\nThey quickened their pace. No more sightseeing. They walked forward, eyes focused ahead. Then they noticed it: dozens, perhaps hundreds of caves dotting the towering cliffs, large and small.\n\n\"What is this?\"\n\n\"I don't know. Are there even animals here?\"\n\nAt that moment.\n\n*Kuweeeeeoh!*\n\n*Kiyahahahat!*\n\n*Kkiiik!*\n\nBizarre sounds echoed from the caves. Bestial cries. Something like human laughter. Then a gigantic shadow emerged from one of the openings.\n\n*Suruk suruk.*\n\nA shadow with eight legs descended along the curved walls. A spider. An impossibly huge spider that made a fifteen-ton truck seem small by comparison.\n\n\"H-Hik!\"\n\nTerror paralyzed the party. Their legs refused to move. The giant spider shrieked, its body shaking as if amused, then shot out thick webs. The strands were thicker than rope, stronger than wire. The party screamed as they were wrapped, cocooned, helpless.\n\n***\n\nGrid stood at the entrance of Kesan Canyon. He stared into the depths and recalled bitter memories.\n\n\"I came here only to die, die, and die again...\"\n\nThe place was so terrible that Kesan Canyon haunted his dreams. A location that filled Grid with genuine fear. He would only sleep soundly after conquering it.\n\n\"The monsters here are so damn weird...\"\n\nThe creatures of Kesan Canyon were grotesque beyond measure. Both in appearance and behavior. Among them, the 'canyon spider' remained vivid in his memory.\n\n*The giant spider eats people alive. Ugh...*\n\nThe shock and horror of being trapped in spider webs, unable to move, watching that massive mouth approach.\n\n*At least I didn't feel myself being chewed. I died the instant my head entered its mouth...*\n\nGrid recalled those memories, then cleared his mind.\n\n\"Stop wasting time on useless thoughts. Find Pagma's swordsmanship.\"\n\nHis deaths here belonged to the past.\n\n\"I'm different now! I'll show you the power of items, you monsters! Revenge! Revenge!\"\n\nGrid shouted as he entered the canyon. Despite his bold words, his body trembled with fear."
}