{
  "id": 660,
  "title": "Chapter 660",
  "content": "**Bentao's Mockery.**\n\n\"—?!\"\n\nSomething *twisted* inside Grid the moment Agnus invoked the skill.\n\n*Kihihihit!*\n\nA grotesque clown—bloated and grinning—flickered through his vision.\n\n> [You have heard Bentao's bad laughter. You can't stay calm after listening to it.]\n> \n> [You have lost your composure. The deployment of all active skills will be cancelled.]\n> \n> [Insane Clown King Bentao has fallen into a rage. Resistance has failed.]\n> \n> [It will take over one minute to overcome the 'frenzy' state.]\n> \n> [During the frenzy, your base damage will increase slightly, but your defense will decrease slightly. In addition, the casting speed and resource consumption of all skills are greatly increased.]\n> \n> [Bentao has stretched out his hand while you are losing your cool. Your health has changed with the owner of Bentao.]\n> \n> [49,300 health has become 819!]\n\n'*What?*'\n\nHealth swapped? Grid's mind reeled. He'd seen dozens of absurd skills before, but this—\n\nThe panic hit harder than the clown's laughter. **Bentao's Mockery didn't reduce his health. It replaced it entirely.** Tiramet's Belt wouldn't trigger. First King's regeneration wouldn't activate. He was left with scraps.\n\n*Puok!*\n\n> [You have suffered 1,930 damage.]\n> \n> [A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\n\"Kh—!\"\n\nThe blade caught him in the back. Agnus moved like smoke, exploiting the fraction of a second when Grid's guard shattered. His last safety net—gone.\n\n'*Damn it!*'\n\nFive seconds. That's all he had.\n\nGrid's sword lashed out in a flurry of strikes, fury overriding precision. Not mindless—his body knew the rhythms of combat even when his mind spiraled—but crude. He mixed basic attacks with skills, compensated for the frenzy's erratic accuracy. It should've worked.\n\nIt didn't.\n\nPagma's Swordsmanship demanded one or two seconds to activate. Under frenzy, those seconds stretched into chasms. His timing collapsed. Skills misfired mid-swing, their energy dissipating into nothing.\n\n\"Ha? You're this pathetic without your cheat?\"\n\nAgnus' voice was flat. No mockery. No anger. Just disappointment.\n\nGrid stumbled through another failed combo, and Agnus sidestepped it like he was dodging a child. The young man's expression went cold. He'd lost interest.\n\nOf course he had. Status locks, silence effects, confusion debuffs—Agnus had subjected countless players to these hells. They adapted. They found workarounds.\n\nGrid? He'd leaned on his legendary class's **resistance to all status conditions** for so long that he'd never *learned* how to fight through them. No contingency skills. No backup plans. When the safety net vanished, so did his edge.\n\n\"You defeated Kraugel?\"\n\n*Peeng!*\n\nAgnus dodged, extended one hand, and **fired**—the charging effect built into his fingertips detonating against Grid's chest.\n\n\"Guh!\"\n\nThe explosion hurled Grid backward. Agnus opened the gap with surgical precision, and Grid's frustration spiked. Time was bleeding away.\n\nAgnus stared at him, disgust settling into his features.\n\n\"This is the pitiful side effect of Bentao's Mockery.\"\n\nRight. The health swap was the *real* threat. The frenzy? A minor inconvenience at best. Yet Grid crumbled under it like wet paper. Incomparable to Kraugel. Incomparable to Ares.\n\n\"Fake bastard.\"\n\nThe first player king. A legend built on the foundation of a legendary class—nothing more. Agnus felt his anticipation curdle into contempt.\n\nHe raised his hand again as Grid charged.\n\n*Peeng!*\n\nAnother charging blast. The **Destruction King's** incomplete echo—one of Baal's countless titles—turned Agnus' every basic attack into a ranged detonation. Grid couldn't close the distance. One second of immortality remained.\n\nAgnus aimed.\n\n> [Tiramet's Belt has been equipped.]\n\nGrid swapped gear mid-stride. Immortality didn't lock his inventory.\n\n> [You have suffered 1,400 damage.]\n> \n> [Your health has dropped below 10%. Tiramet's Power is activated. 30% of your health has been restored.]\n> \n> [The duration of immortality is over.]\n\n*Yiing—*\n\nGrid's health bar surged upward by a third. But that wasn't the turning point.\n\nThe **Composure** stat—cultivated through countless hours of Item Creation, refined by title after title—finally bore fruit. Composure accelerated recovery from status conditions. It had been useless before, his legendary resistances rendering it redundant. Now?\n\n> [You have regained your composure.]\n> \n> [You have overcome the frenzied state.]\n\n\"Pagma's Swordsmanship.\"\n\nGrid's voice steadied.\n\n\"**Transcended Link.**\"\n\n*Kurururung!*\n\nTwenty energy blades erupted from his sword, a storm of silver light tearing toward Agnus at medium range.\n\n\"?!\"\n\nAgnus' eyes widened. Top rankers *could* break status effects quickly—but this was something else. Less than a minute. Far less.\n\n'*A production class stat?*'\n\nComposure was hard to raise for combat classes. Grid had it in spades, courtesy of Item Creation. This was the result.\n\n\"But so what?\"\n\nAgnus' expression didn't shift. Disappointment had already settled like ash.\n\n*Kwaaaaang!*\n\nThe lich's magic wave collided with Grid's energy blades. The battlefield erupted in a maelstrom of light and force, carving trenches into the earth.\n\n---\n\n\"Grid!\"\n\nJishuka's face went white. The party window showed Grid's health plummeting like a stone. She twisted toward him—\n\n\"Where are you looking?\"\n\n*Pajijik!*\n\nBlack's magician clone fired a lightning bolt. It slammed into Jishuka's side, and she convulsed. Archers had paper-thin defenses. The shock lasted just long enough.\n\n\"Ugh—\"\n\nBlack's warrior clone lunged, sword aimed for Jishuka's throat.\n\n\"**Rain Spear!**\"\n\n*Chwarururuk!*\n\nDozens of spear projections materialized mid-air. Black's clone spun, deflecting them one by one. Pon rode past on his white horse, eyes cold as ice.\n\n\"You trash-like man…! You males only look at pretty girls!!\"\n\n*Kwaang!*\n\nBlack had leveled aggressively since joining Immortal, bolstered by necromancer support. Her clone techniques had evolved. Pon's Rain Spear barely fazed her.\n\nPon clicked his tongue. \"I don't judge women by their appearance. I like *everything* about women.\"\n\n\"Lies! Shut up!\"\n\n\"No, seriously—we're enemies, you're attacking us, why wouldn't I—ack?!\"\n\nThe illusion shifted. The corpse-strewn palace warped into a sheer canyon, cliffs rising on both sides. Pon's mount stumbled. His attack power on horseback would nosedive in this terrain. Worse, the narrow space would trap both him and Jishuka.\n\nElsewhere, things weren't any better.\n\n\"All young and beautiful women should **die!**\"\n\n\"Kyaaak!\"\n\n**White**—the martial artist who'd surpassed Asura Regas. Her body size and weight fluctuated freely with her techniques, each strike carrying the force of a collapsing sun. She fought Euphemina and Regas simultaneously without losing ground.\n\n'*Why is this lunatic targeting me?!*'\n\nEuphemina barely escaped a palm strike that would've caved in her ribs. Regas pulled her clear, and she gasped. They'd never met before today! What had she done to deserve this?\n\nWhite pivoted, locked onto Euphemina again.\n\n\"I can't stand your white skin and curly hair!!\"\n\n\"Kyaaak!\"\n\nEuphemina scrambled backward. Not because she thought White was unbeatable—victory would be hard, but not impossible. The problem was **Mumud**.\n\nShe had the quest: **Mumud's Soul Liberation**. She'd been waiting—*praying*—for Agnus to summon the lich Mumud. Instead, he'd called two *different* liches and ignored Mumud entirely.\n\n'*This is my chance to clear the quest…*'\n\nHer gaze flicked toward Grid and Agnus.\n\nWhite's eyes narrowed. \"Aren't all pretty women foxes? You're looking at Grid, expecting him to save you? Too incompetent to stand on your own?\"\n\n\"…What?\"\n\nEuphemina's round eyes sharpened into slits. The same look she'd worn when she annihilated Faker's party.\n\n\"L-Lady Euphemina?\"\n\nRegas jolted. He felt the same pressure he'd once felt from Jishuka. He didn't understand—Grid feared Euphemina not because of her skill, but because she had a *temper*.\n\n\"Should I kill this white pig before doing the quest?\"\n\n\"W-White *pig?*\"\n\n\"Stop talking. I'm annoyed.\"\n\n\"…?!\"\n\n---\n\n\"**Protect Grid!**\"\n\nGrid was a symbol now. If Agnus crushed him here, in this debut, his momentum would become unstoppable. Ares couldn't allow that.\n\n\"It's impossible!\"\n\nNo one could reach him. The skeleton legions—summoned and controlled by Immortal's necromancer rankers—formed an impenetrable wall. **Veradin** was the worst. His death knight lacked the raw power of Agnus', but it moved with surgical precision. Agnus juggled two death knights and two liches; Veradin focused everything on *one* death knight.\n\nThat focus made him terrifying.\n\n\"Veradin!\"\n\nScott abandoned all subtlety. He charged, determined to eliminate the necromancer with overwhelming force.\n\nVeradin's eyes narrowed as he blocked the strike. \"It's unpleasant seeing your low-key ID.\"\n\n\"I'll change it when I get a damn ticket!\"\n\n*Chaaeng! Chaaeng!*\n\nScott's blade met the death knight's greatsword again and again. They traded blows in midair, sparks flying. But the outcome was inevitable.\n\nThe death knight regenerated steadily through Veradin's mana. Scott couldn't outlast it. Stamina was a player's limitation.\n\nThe Overgeared King and the God of War—both in crisis.\n\nAgnus' forces were overwhelming.\n\nThe viewers finally understood."
}