{
  "id": 661,
  "title": "Chapter 661",
  "content": "Around the globe, Overgeared members stared at their screens in mounting frustration.\n\n\"Why isn't he summoning his knights?\"\n\nThey'd seen Grid's trump card before—the ability to call forth his strongest warriors. One command, and Piaro alone could turn the tide. Grid was a *king* now. He didn't need to prove himself in a fair fight. Let his soldiers do the work while he commanded from safety.\n\nBut Grid refused to play it safe.\n\n\"Just one summon... that's all it would take...\"\n\n\"If he loses, the entire kingdom's reputation...\"\n\nAnxiety rippled through the guild's ranks, especially among the newer recruits in Overgeared Two. These members had only joined after Grid's rise to nobility. They'd seen Duke Grid, the strategic leader. King Grid, the benevolent ruler. But they'd never witnessed the man beneath the crown—the one who still carried old wounds like badges of honor.\n\nThe veterans knew better. Grid would never summon backup. Not here. Not with the world watching.\n\nHe was too proud. Too hungry. Too *scarred* by his past failures.\n\nOn a stage this grand, he'd prove himself or die trying.\n\n***\n\n'Damn it. He's going all-in.'\n\nGrid had already swapped his Holy Light set for Triple Layers and other physical defense gear, anticipating the clash. Transcended Link's twenty energy blades packed serious punch—he'd demonstrated that enough times for Agnus to recognize the technique. \n\nThe logical play? Agnus would dodge or turtle behind his lich's mana shield while sending in the death knight for a counter.\n\nLogic failed him.\n\nAgnus's lich was a monster. It deflected all twenty strikes with double-cast magic *and* launched a counterattack in the same breath.\n\n\"Gah—!\" \n\nThe ice blast hammered through Grid's storm of energy blades and slammed into his chest. He resisted the freeze effect, fingers fumbling for a potion as blood seeped through the cracks in his armor.\n\nAgnus sneered. \"Prediction's a bitch when you're wrong, isn't it?\"\n\nAnother disappointment. Grid had tried to outthink him and ended up eating the damage himself. Pathetic.\n\n\"You don't have Kraugel's instincts. His reaction time. Hell, you don't have *anything* he has.\" Agnus's laugh was sharp and cruel. \"And *he* lost to *you*? What a fucking joke.\"\n\nThe lich ceased its double casting—maintaining that output drained mana too quickly for sustained combat. Agnus had speed, not capacity.\n\n\"Cao. Finish him.\"\n\nHe turned his back on Grid, a deliberate insult. The massive death knight responded instantly, purple light flaring across its frame. Cao had been an orc warrior once—one of the top ten. Slower reflexes than his human counterparts, but the raw power more than compensated. Perfect for crushing an exhausted opponent.\n\nPerfect for grinding Grid's pride into the dirt.\n\n\"You know...\" Grid's voice cut through the arena. \"You talk too much.\"\n\nHis health bar sat at 10,000. Critical. Emergency. One clean hit from death.\n\nBut his expression showed no panic. No desperation.\n\nBecause he hadn't used everything yet. Desperation was for people with nothing left.\n\n\"Blackening.\"\n\n*Kaching.*\n\nThe legendary accessory—Dark Bus's Earrings—activated. Twelve-hour cooldown. Five-minute duration. The restrictions alone spoke to the skill's power.\n\n*BOOM.*\n\nDemonic energy *exploded* outward. Grid's skin bleached pale, the whites of his eyes flooding with ink-black corruption. Dark power coiled around him like smoke, transforming him into something that existed somewhere between human and demon.\n\nThe crowd erupted.\n\n『 HERE IT IS! 』\n\n\"A bit stronger?\" Agnus scoffed. \"So what?\"\n\nGrid blurred forward, his enhanced agility from Blackening letting him intercept Cao mid-swing.\n\n*CLANG!*\n\nThe death knight's greatsword hammered into Grid's chest, scattering purple light.\n\n> [Death Knight Cao has inflicted 1,940 damage.]\n\n\"What?\"\n\nFor the first time since entering Satisfy, genuine surprise cracked through Agnus's facade. Not even meeting Kraugel had managed that.\n\n*Less than 2,000 damage?*\n\nGrid tanked the blow and kept moving, closing the distance to Agnus. Triple Layers. Lantier's Cloak. His physical defense had reached absurd levels.\n\n\"You—!\"\n\nAgnus grinned, a predator's expression. Energy gathered at his fingertips, ready to unleash.\n\nIt never fired.\n\n\"Restraint.\"\n\n\"—!!\"\n\nThe overwhelming pressure locked Agnus in place. His body refused commands, frozen by the skill's dominance. Cao rushed forward, greatsword whistling through the air.\n\n> [Death Knight Cao has inflicted 1,670 damage.]\n> [Death Knight Cao has inflicted 1,910 damage.]\n> [Death Knight Cao has inflicted...]\n\nBasic strikes. No techniques. No finesse. Cao's orcish heritage meant superior raw stats but a limited skill set. The simple attacks couldn't stop Grid's advance.\n\n\"Kuh...!\"\n\nAgnus's laugh twisted into something between amusement and pain.\n\n*Thud. Thud. Thud.*\n\nGrid's fists crashed into him, the death knight utterly ignored. Those eyes—cold, focused, *vicious*—never left Agnus's face.\n\n\"Spec...tacular!\"\n\n*SLASH.*\n\nThe +9 Failure carved diagonally through Agnus's torso. Pinnacle.\n\n> [You have suffered 35,400 damage.]\n> [Mana Shield has activated. Health loss converted to mana loss.]\n> [High-grade mana potion consumed.]\n\n\"Gck—hah?!\"\n\nBarely standing. Swaying on his feet. But Agnus caught his breath just as Grid wound up for the follow-up.\n\nLaughter bubbled from his throat. \"Kuh...! Kuhahahahaha! You beat *Kraugel* like this?!\"\n\nYes. *This* was why combat mattered. Walking the razor's edge between victory and oblivion. One mistake meant death. The thrill made reality fade away, replaced by pure, crystalline focus.\n\n\"Veradin! Ares is yours!\"\n\nAgnus dismissed his death knight Doom and lich Amy from the Ares fight, freeing up his Domination stat. He needed every point for what came next—a summon that required massive magical investment.\n\n\"Lich Summoning: Mumud!\"\n\n*CRACK.*\n\nThe space between Grid and Agnus *split*.\n\n*SCREEEEEEE—*\n\nA monster's roar. Magic power erupted from the dimensional tear.\n\n—*Dodge!*\n\nBraham's voice exploded in Grid's mind, urgent in a way he'd only heard once before—when the yangban Garam appeared. Grid's instincts screamed danger.\n\nBut—\n\n'How?'\n\nHe was mid-technique. The magic was erupting directly in front of him. No time to abort. No space to evade.\n\nOnly one option remained: complete Pinnacle Kill and take Agnus with him. Whether they'd both die or only one would fall—that was in the gods' hands now.\n\n\"Pinnacle Kill!\"\n\nThe magic surged toward Grid's throat. His blade descended toward Agnus's skull.\n\nThen—\n\n> [★ Hidden Quest ★ 'Braham and Mumud' has been generated!]\n\n\"—?!\"\n\n\"—!!\"\n\nBoth fighters froze. Identical notification windows. Different messages.\n\n> [Braham has detected Mumud's soul. Consumed by fury, he has burned a soul fragment to forcibly invoke Assimilation.]\n> [Braham's soul has merged with yours. Control of your body is transferring to Braham... **Transfer Failed.**]\n> [The soul fragment's consumption has severely damaged Braham. Braham's soul has entered dormancy. Manual Assimilation control required.]\n> [Braham's base statistics have deteriorated.]\n> [Class changed to Great Magician. Statistics recalibrating.]\n> [Braham wishes to speak with Mumud. Lich Mumud's magic power reduced and neutralized by 30%.]\n\nPower drained from Grid's limbs. His black hair bleached white as snow. His eyes burned ruby-red.\n\n\"Ugh! B-Braham!\"\n\nThe energy vanished as suddenly as it arrived. Grid struggled to regain control of his transformed body.\n\n> [Mumud has sensed Braham's soul. His hatred has freed a suppressed statistic.]\n> [Lich Mumud's level increased to 400.]\n> [Control Mumud. Defeat the Legendary Great Magician Braham. Forge Mumud into a new legend.]\n> [Victory will resolve Mumud's grudge. He will become your eternal servant.]\n\n\"Ha...! Kihahahahahaha!\"\n\nAgnus was having the time of his life."
}