{
  "id": 662,
  "title": "Chapter 662",
  "content": "\"Kyaaaaah!\"\n\nThe shrieks echoed through the arena—not screams of terror, but pure feminine delight. Women in the crowd gasped and swooned as they beheld the transformed Grid. Where a dark-haired warrior had stood moments before, there was now a figure of ethereal beauty. His bone structure had refined itself, his features sharpening into something almost otherworldly. The young Braham's appearance—sleek, elegant, devastatingly handsome—triggered every protective and appreciative instinct in the onlookers.\n\n***\n\n> Name: Braham Eshwald (Grid)\n> \n> Class: Great Magician\n> \n> Title: Possessor of Great Knowledge\n> \n> * The best intellectual of this time. The truth hasn't been learnt yet, so he is still obstinate. This pursuit of knowledge is very strong, sometimes acting as a poison.\n> * Intelligence will rise by 35%.\n> * There is a low probability of running wild.\n> \n> Title: One who Became a Legend\n> \n> ...\n> \n> Level: 400 (Correction)\n> \n> Health: 100,000/100,000 (Correction)\n> \n> Mana: 200,000/200,000 (Correction)\n> \n> Strength: 158 Stamina: 1,400\n> \n> Agility: 601 Intelligence: 7,000+2,100\n> \n> * In this human flesh, Braham Eshwald's full strength can't be drawn out. Most of his stats are sealed.\n> \n> * Braham's soul is shocked and has fallen asleep. You have control over your body. The stats have been sealed to a greater extent.\n\n'This bastard's trolling me.'\n\nGrid's eye twitched. This was the second time Braham had screwed him over. First, forcing that loss against Kraugel. Now this—passing out at the worst possible moment, right when a quest trigger forced them into Assimilation?\n\n'Does he get off on this...?'\n\nGrid shook his head sharply. No time for complaints. His mind raced as he backpedaled from Agnus, pulling up his status window with trembling hands.\n\n'Level 400. Nine thousand Intelligence. Resources in the six figures...'\n\nThese weren't numbers that made sense for ordinary players. It was identical to his first Assimilation experience—the system adjusting his body to match the quest parameters.\n\n'So can't I just one-shot Agnus?'\n\nThe thought flickered through his mind like lightning.\n\n'No. Nothing's ever that easy.'\n\nReality crashed back down. Agnus controlled Lich Mumud. And if this quest centered on Mumud, then the system would've adjusted his stats as well.\n\n'My current specs probably match Mumud's exactly.'\n\nWhich meant Agnus had the same quest. Same conditions. Same power level.\n\nAnd that created a massive problem.\n\n'Agnus has experience controlling Mumud. Me? I've got nothing.'\n\nEvery previous Assimilation, Braham had seized control immediately. Grid had been relegated to spectator status, watching from a third-party perspective as the great magician worked. He'd never actually piloted this form before.\n\n'And even worse...'\n\nHe was a blacksmith. A swordsman. \n\nNot a fucking mage.\n\n'How the hell am I supposed to play a magic class?'\n\nMages and assassins—universally considered the highest skill-ceiling classes. Success required split-second timing, juggling spells with different cast speeds, maintaining situational awareness while channeling. It was a thinking man's class, and Grid had always been better with his hands than his head.\n\n\"Damn it.\"\n\nHe exhaled hard, forcing down the anxiety clawing at his chest. The quest trigger had created a lull in the battle. He needed to use it. Needed to center himself.\n\nJust as Grid began to steady his breathing—\n\n*Ttiring~*\n\nThe notification chimed, and the quest window materialized.\n\n> [Braham and Mumud]\n> \n> ★ Hidden Quest ★\n> \n> Braham was jealous of Mumud. He couldn't tolerate a disciple who had more talent than himself. He started neglecting Mumud and even took away his achievements. In the end, he decided to kill Mumud. It was a foolish judgment that arose from the idea that he should reign as the supreme being on Earth.\n> \n> But Braham didn't harm Mumud. No, he couldn't harm Mumud. Braham had lived as a human for hundreds of years. Braham awakened emotions without knowing it.\n> \n> One day, Mumud suffered from an incurable disease and left Braham.\n> \n> After a long time, Braham found him again.\n\nThe text faded. A video began to play.\n\n***\n\n\"Even after you turned your back on me...\" \n\nThe voice was weak, trembling with suppressed emotion.\n\n\"Even when you stole my work. Erased my name from history. I didn't blame you.\"\n\nThe scene materialized like a dream—or perhaps a nightmare. The underwater city of Siren spread out in the background, dark and mysterious, bioluminescent creatures drifting through the depths. Two figures stood facing each other on an ancient plaza.\n\nBraham looked exactly as he did now through Grid's body—young, beautiful, ageless. But the other man...\n\nMumud had aged decades in what should have been the prime of his life. His frame was skeletal, skin stretched tight over bone. Every breath seemed to cost him.\n\n\"Cough—cough!\"\n\nBlood sprayed from his lips, but he didn't stop.\n\n\"I pitied you, Master. I understood that your obsession, your fear of being surpassed... it came from a broken place. So I couldn't hate you.\"\n\n\"...\"\n\nBraham said nothing. His expression was carved from ice.\n\n\"But this?\" Mumud's voice cracked. \"Turning me into a lich? You want me to serve you even in death? To never know peace?!\"\n\nTears cut tracks down his hollow cheeks. When he spoke again, each word dripped with venom.\n\n\"Life is meant to end. I would rather disappear naturally than exist as your eternal puppet.\"\n\nGrid's chest constricted. Through the Assimilation link, he could sense the emotions churning beneath Braham's frozen exterior.\n\n*'I just wanted to save you.'*\n\n*'I'm so sorry.'*\n\n*'I wanted the world to see your brilliance, even if you couldn't live to show it yourself.'*\n\nThe truth was painfully clear. Braham had been consumed by jealousy, yes. He'd sabotaged his disciple's career, stolen his achievements. But he'd also genuinely loved Mumud—the only person who'd ever trusted him unconditionally. When disease began claiming Mumud at barely thirty years old, Braham had been desperate to make amends.\n\nLichdom was meant to be salvation. A chance to restore Mumud's reputation. To keep him in the world.\n\nBut Braham's pride was a fortress wall. He couldn't speak his true feelings. Couldn't admit vulnerability. And his solution was warped by his nature—a vampire who'd already murdered his own kin and been exiled for it. A creature caught between two worlds, understood by neither the living nor the undead.\n\n\"You're the worst kind of monster,\" Mumud gasped. \"With what little magic power I have left... I'll kill you... Cough! Cough!\"\n\n\"You don't have much time.\" Braham's voice was flat, emotionless. \"Accept the honor of lichdom. When Pagma completes the Vessel of the Soul, I'll reclaim true immortality. You'll stand beside me. The world will praise your name for eternity.\"\n\n\"No—!\"\n\n\"You don't have a choice.\" Braham turned away. \"The day you die, I'll retrieve your body. And I'll resurrect you as something that can never fade.\"\n\nThe vision ended.\n\nGrid didn't need to see more. The present-day Mumud was proof enough that Braham had followed through. \n\nWhich created an immediate problem.\n\n'Agnus stole Lich Mumud.'\n\nRight in front of the Overgeared members. Shortly after Grid's battle with Elfin Stone in the vampire city.\n\n'Damn it.'\n\nGrid had only learned the full story when Euphemina received her quest to free Mumud's soul. Now, watching that painful confrontation, understanding flooded through him.\n\n'Braham... what would you say to Mumud now?'\n\nHe didn't need an answer. He already knew.\n\n'You want to apologize. You finally understand how badly you fucked up, don't you?'\n\nOf course, an apology wouldn't fix anything. Mumud had suffered for centuries. The damage was irreversible. He had no obligation to forgive, and even if he did, the pain wouldn't disappear.\n\n'But Braham knows that.'\n\nGrid understood the dictionary definition of Assimilation now. *Different things becoming similar to each other.* They remained separate individuals, but through this connection, they'd begun reading each other's thoughts. Understanding each other's hearts. Grid had taught Braham about humanity.\n\nWhether Mumud forgave him or not...\n\nBraham believed he owed his disciple an apology. It was the responsibility of the one who'd committed the sin.\n\n\"Yeah...\" Grid's jaw set. \"That's what a man does.\"\n\nHe thought of Lee Junho—the bastard who'd tormented him through school. What if Junho showed up tomorrow with a genuine apology? It wouldn't erase the past. But it might ease something. Lift a shadow that had lingered too long.\n\n\"Alright. I'll do this.\"\n\nNot just for Braham. For the quest, yes—but more importantly, for Mumud. The victim deserved closure.\n\n'Time to win this.'\n\nHe steeled himself and pulled up the spell list available to his current class.\n\n***\n\nOn the opposite side of the arena, Agnus stood perfectly still.\n\n\"Kukukuk... yes, Mumud. You were just another pathetic fool.\"\n\nHis laughter was different this time. Not his usual mocking cackle. This had teeth. This had *rage* simmering beneath every syllable.\n\n\"Stupid. Fucking. Idiot.\"\n\nHe'd watched the same quest video from Mumud's perspective. And God, it made him sick. The victim was weak. Spineless. Agnus despised weakness. Despised victims who accepted their suffering.\n\nThey reminded him too much of his former self.\n\nHis bony hand shot out, gripping Mumud's skull with white-knuckled intensity.\n\n\"Victims have two choices,\" he whispered, voice like poison. \"Forget and run away... or get revenge.\"\n\nEverything else was a lie. Trying to \"move on\" while pretending the past didn't matter? That wasn't living. That was letting your abusers win twice—first when they hurt you, then again when they stole your right to be angry about it. They took your body, your soul, your future.\n\n\"So kill him, Mumud. Erase the past by destroying it. This time, *we're* the ones who do the trampling.\"\n\n*Shaaaaaaaaah—*\n\nMumud's magic power detonated outward like a supernova. Seven-attribute magic—the revolutionary system that had once made him famous—began coalescing into devastating forms. Agnus immediately accessed the highest-tier spells available to a level 400 lich.\n\nHe wasn't holding anything back.\n\nMeanwhile, across the battlefield, Grid raised Belial's Staff.\n\n\"Fireball. Wind Cutter.\"\n\n\"...?\"\n\nAgnus's concentration broke for a split second. Was Grid seriously opening with *beginner spells*?\n\n*Puaaaaaaaah!*\n\nThe attacks landed before Mumud could finish casting. Flames engulfed the lich's skeletal frame while a blade of compressed darkness carved through his Mana Shield like wet paper.\n\nThe protective barrier crumpled. Both spells struck true.\n\n\"What the—?!\"\n\nAgnus's mind reeled. That made no sense. Low-level magic shouldn't penetrate a lich's defenses. Unless...\n\nGrid's eyes gleamed as he regarded Belial's Staff.\n\n\"Myth-rated equipment, asshole.\"\n\nThe staff's true capabilities sang through his awareness:\n\n+30% Intelligence.\n\n+30% spell casting speed.\n\nSimultaneous casting of three spell types.\n\nWhen fire and dark magic are combined: +200% magic power to each element.\n\n+20% critical hit rate for all spells.\n\n+150% critical damage.\n\n*This* was Belial's Staff.\n\nAnd Agnus—who'd only fought weakened great demons, who'd never faced a true myth-rated item in combat—had no idea what he was up against."
}