{
  "id": 663,
  "title": "Chapter 663",
  "content": "**[Mana Shield Lv. 6]**\n\n*When attacked, consume mana instead of health. Defense and Magic Resistance reduced to 68% while active.*\n\n*Incomplete during spellcasting. Shield penetrated if damage exceeds 30,000 during cast time.*\n\n*Can be toggled without cooldown.*\n\nThese specifications defined the Mana Shield of a level 400 lich. Combined with Mumud's near-infinite mana pool—close to 500,000—and his passive trait that boosted casting speed by 15% while regenerating mana 30% faster, the undead spellcaster should have been unstoppable. Agnus had calculated every variable. Mumud would begin casting high-level spells immediately, weathering any assault behind his impenetrable barrier while the incantations took shape. Five to seven seconds—an eternity in combat, yet Agnus had been certain his lich could endure.\n\nThe reality proved... different.\n\nGrid's lowest-tier magic cast three times faster than Mumud's, and hit hard enough to punch straight through the Mana Shield.\n\n[**Lich Mumud has suffered 37,300 damage!**]\n\n[**Lich Mumud has lost 30,000 mana!**]\n\n[**Lich Mumud has suffered 7,300 damage!**]\n\n*Fireball and Dark Cutter did this?*\n\nMumud's intelligence exceeded 10,000. His magic resistance could absorb spells from the continent's top-ranked magician without breaking a sweat. Yet Grid's basic magic tore through those defenses like tissue paper.\n\nAgnus' eyes widened. Then he laughed—a sharp, incredulous bark of sound.\n\n*This is Braham's power. I have to acknowledge it.*\n\nFor the first time, Agnus truly appraised Grid. This wasn't just the player who'd stumbled into Pagma's Descendant. This was someone who'd acquired the strength of *two* legends. His quest progression must be absolutely unique.\n\n*If Kraugel is a combat genius, then Grid has a talent for understanding the game's worldview—for exploiting the story itself.*\n\nThe assessment was wildly off-base, but Agnus had no way of knowing that. The only explanation for wielding two legendary powers was that Grid had somehow broken the system. The thought sent a thrill racing down Agnus' spine, his smile stretching wide as Grid spoke.\n\n\"This is a **myth-rated item**, bastard.\"\n\n\"It...em!\"\n\n*BOOM!*\n\nAnother Fireball erupted from Grid's staff. Lich Mumud still hadn't finished casting his S-grade spell, and Grid was already on his third attack. By all logic, lowest-tier magic shouldn't even scratch a lich's defenses. Yet Grid's Fireballs defied common sense entirely.\n\n*Another 20,000 damage hit?*\n\nWhen Fireball and Dark Cutter struck simultaneously, they'd dealt over 37,000 damage. Even a single Fireball should deal at least 20,000—\n\n*CRACK!*\n\n[**Lich Mumud has suffered 8,800 damage!**]\n\n[**Lich Mumud has lost 8,800 mana.**]\n\n*...Huh?*\n\nThe power was significantly weaker than before.\n\n*Was the first spell a critical hit?*\n\nAgnus' mind snapped back into focus. He moved in front of Mumud, positioning himself as a shield while the incantation reached completion.\n\nMeanwhile, Grid was struggling.\n\n[**The double casting of Fireball and Dark Cutter has failed.**]\n\n*Dammit!*\n\nBelial's Staff possessed a broken option—Triple Casting enabled through proficiency support. But Grid's skill level wasn't remotely close to utilizing it.\n\n*Double casting...*\n\nSpeaking Fireball aloud while simultaneously visualizing Dark Cutter in his mind was proving nearly impossible. The first successful attempt had been pure, dumb luck.\n\n*If I grabbed a hundred random people off the street and asked them to try this...*\n\nAll hundred would fail. The difficulty was absurd.\n\n*Should I switch to higher-tier magic?*\n\nGrid had equipped nearly every item in his arsenal. Neberius's Bracelet increased Intelligence by 30 and shortened casting time by 20%. The Black Quartz Earrings added 15 Intelligence. The Ring of Absurdity doubled mana regeneration and halved resource costs. Malacus' Cloak provided 200 Intelligence and emitted a bloody aura. The Holy Light Crown granted 300 Intelligence and 200 Dignity. And of course, Belial's Staff itself.\n\nHe'd pulled out every magic-enhancing item he owned. Combined with Braham's level 400 spell list, Grid's magical capabilities were equal to—possibly exceeding—Lich Mumud's. But he'd deliberately restricted himself to basic spells for one reason: *efficiency.*\n\nMagic Missile, Fireball, and Dark Cutter cast in one or two seconds. Higher-tier spells required exponentially longer incantations.\n\n*Too risky. I don't know these spells well enough to stand still that long.*\n\nMagic wasn't just about raw power. Every element had counters, weaknesses, and situational applications. The tactical possibilities were endless, which meant magical duels were fundamentally *psychological warfare*. Grid's entire magical experience consisted of Magic Missile, Fly, and Alarm.\n\nCould someone with his limited intelligence fight efficiently using a diverse spell arsenal in real-time? Impossible. His opponent was Agnus—backed by a lich specialized in magical combat. Grid would lose any battle of wits.\n\n*So.*\n\nHis plan relied on Belial's Staff's unique property: bonus damage when using fire and dark magic simultaneously. Avoid the mind games entirely by spamming instant-cast basic spells, overwhelming Mumud through sheer speed and power.\n\nExcept reality refused to cooperate.\n\n\"Fireball!\"\n\n*'Dark Cut...Ball!'*\n\n\"Fire...! Dark!\"\n\n*'Shit!'*\n\nCasting Fireball and Dark Cutter simultaneously was proving impossibly difficult. He was becoming convinced double casting simply wasn't meant for players.\n\n*This is why the title of Great Magician will always belong to NPCs.*\n\n*CRACK! BOOM!*\n\nFireball and Dark Cutter deployed separately, striking Mumud one after another. The damage was pathetic compared to synchronized casting—nowhere near enough to penetrate the Mana Shield.\n\nGrid's anxiety spiked.\n\n*\"KIIIAAAAAAH!\"*\n\nProtected by both Agnus and the Mana Shield, Lich Mumud completed his incantation. Magic power erupted outward, surging toward Grid.\n\n\"God Hands!\"\n\nNothing happened. Assimilation had transformed Grid into a great magician—but the God Hands were exclusive to Pagma's Descendant. They didn't recognize this form.\n\nGrid would have to endure Mumud's attack on his own.\n\n*What can I block?*\n\nHe'd never seen this spell before. Its power and effects were complete unknowns. But anything requiring an eight-second cast time was guaranteed to be top-tier.\n\n*I have to stop it. No choice.*\n\nGrid rapidly scanned through the magic list he'd reviewed earlier, searching the defensive options. There—a spell offering extreme magic resistance.\n\n\"**Anti-magic Shield!**\"\n\n[*Increases Magic Resistance by 50% for 10 seconds.*]\n\n[*Negates one magic attack.*]\n\n*SHHHHWAAAAA!*\n\nA translucent pink barrier wrapped around Grid's body.\n\n*ZZZZZRRRAAACK!*\n\nA comet-like flash of light slammed into the pink curtain. The barrier shattered instantly—but the prismatic light that struck it emerged with only six colors instead of seven.\n\nGrid's blood ran cold.\n\n*Multi-element composite spell...!*\n\nThe prismatic flash appeared to be a single attack, but it was actually seven different spells woven together—one for each magical element.\n\n***BOOM-BOOM-BOOM-BOOOM!***\n\nMumud's magic tore through the anti-magic shield and detonated against Grid's chest. The explosion was so massive the ground where Grid stood simply *vanished*, as if a meteor had struck.\n\n\"...\"\n\n\"G-Grid...\"\n\nThrough the dust and smoke, they could make out Grid's silhouette—struggling, but still standing. Flames scorched him. Ice encased him. Earth crushed him. Wind buffeted him. Lightning pierced him. Seven forms of devastation struck simultaneously.\n\nThe sight raised goosebumps.\n\nLich Mumud. Whether they'd known of him before or learned of him today, everyone watching felt the same thrill. This was Mumud's magic—power sufficient to silence an entire chaotic battlefield.\n\n\"Ku ku ku...!\"\n\nTime seemed to stretch. The stillness lasted a moment—or perhaps an eternity. Viewers and soldiers alike envisioned Grid's death.\n\nThen someone's unpleasant laughter shattered the silence.\n\n\"**KUHAHAHAHAHA!**\" Agnus cackled. \"Okay! Very good! **HAHAHAHA!**\"\n\nAgnus craved stimulation—anything to distract from his miserable reality. Today's encounter with Grid delivered exactly that.\n\n\"You, bearing Braham's soul... You'll be the perfect stepping stone for Mumud's growth! Ku ku! **GRIIIIID!** More! Push yourself further! **GIVE ME MORE!**\"\n\n*Crack! Crack-crack-crack!*\n\nLich Mumud launched another barrage at Grid's silhouette through the dust. Most viewers assumed this was the finishing blow. Mumud's previous attack had been too devastating for Grid to recover so quickly.\n\nBut then—\n\n\"...Why didn't I think of this sooner?\"\n\nThe storm of residual magic cleared. Grid stood revealed, wounded but upright. Ten fireballs hovered over his left shoulder in perfect formation. Ten blades of darkness aligned over his right. They resembled wings—one of flame, one of shadow.\n\n\"...?\"\n\nThe viewers, Ares Army, Overgeared Guild, and even Agnus stared in confusion, unable to comprehend what they were seeing.\n\nBut Lich Mumud...\n\n*Flinch.*\n\nHe understood. Among all the enhanced magic Braham had redefined and perfected, the most efficient application belonged to the most basic spell.\n\nA weaponized evolution of Alarm magic."
}