{
  "id": 664,
  "title": "Chapter 664",
  "content": "Satisfy's graphics surpassed any game or film—vivid, spectacular, alive. Every skill activation, every spell cast became a dazzling display of light and power. Players who wielded such beauty became objects of envy.\n\n\"Are those... wings?\"\n\nTwin appendages unfurled from Grid's back—blazing red flames on the left, midnight-black darkness on the right. Every eye on the battlefield locked onto the white-haired figure. The impossible sight stole the breath from spectators and soldiers alike.\n\nAgnus alone kept his focus razor-sharp. While others stared transfixed, his mind raced through tactical calculations.\n\n*Flying magic with bombardment capability.*\n\nThe conclusion formed instantly—wings meant flight. A rational deduction. Agnus's fingers moved in practiced gestures.\n\n\"Raincoat.\"\n\n*Chwarururuk!*\n\nDozens of translucent shields materialized above him in overlapping layers. The strongest anti-air defense in his arsenal. His eyes tracked upward, waiting for Grid to take to the sky.\n\nA fatal miscalculation.\n\n*Kwa kwa kwa kwa kwa kwa kwa!*\n\nGrid's feet never left the ground.\n\nInstead, the wings *pulsed*—and twin torrents of magic erupted forward in a devastating barrage aimed directly at Lich Mumud.\n\n*Fireballs? Dark Cutters?* Agnus's eyes widened as realization struck. Those weren't wings at all—they were a multi-deployment formation of the most basic spells, weaponized through sheer volume.\n\nHis hands flew through cancellation gestures, abandoning the useless aerial defense. Bodies of the fallen lurched upward around Mumud, forming a makeshift wall of flesh and bone.\n\n*Pepepepeng!*\n\nToo slow.\n\nThe fraction of a second delay cost him. Ten pairs of fire and shadow magic slipped through the gaps in his undead shield.\n\n*Damn it!*\n\nThe explosions swallowed his curse.\n\n*Kwa kwa kwa kwa kwa kwa!*\n\n> [Lich Mumud has suffered 38,100 damage!]\n> [Lich Mumud has suffered 36,860 damage!]\n> [Lich Mumud has suffered 37,500 damage!]\n> [Lich Mumud...]\n\nThe notifications scrolled past in a crimson blur.\n\nAgnus's jaw clenched. In theory, a lich represented the pinnacle of undead power—a being that transcended death itself. But that was only true for *independent* liches. The moment one became bound to a player, severe limitations took hold. Not just stat reductions, but something far more crippling: the command delay.\n\nCombat moved at lightning speed. Issuing detailed, real-time instructions to a summoned creature while simultaneously defending, attacking, and adapting to an opponent's moves? Nearly impossible. Even players with exceptional multitasking could only deliver basic commands under pressure. The more unpredictable the enemy, the wider the gaps in coordination became.\n\nJust like now.\n\n*I was too hasty,* Agnus thought, his tactical mind already analyzing the failure. *I should've prioritized Mumud's defense over offense.*\n\nAssuming Grid would attack from the air had been premature. Worse—he'd been overconfident in his ability to protect Mumud while maintaining offensive pressure. The lich had been mid-cast when Grid's barrage struck, leaving it completely exposed.\n\nSeventy thousand health and thirty thousand mana per hit. Twenty hits total. Mumud's reserves now sat at a critical fifty thousand health and one hundred seventy thousand mana.\n\n*The lowest-tier magic, dealing this much damage...*\n\nBut raw power wasn't even the most impressive part. The computational ability required to cast twenty simultaneous spells—even basic ones—demanded an inhuman level of magical control.\n\n*Is this Braham's signature style?*\n\nMumud possessed his own unique magical techniques. If Braham operated similarly, enhanced casting speed and mana recovery would be fundamental traits. The conclusion formed with cold clarity.\n\n*This matchup favors him.*\n\nMumud specialized in high-level destruction magic—devastating individual spells designed for mass annihilation. Braham, by contrast, was a generalist. Low-level magic amplified to absurd power levels, cast with virtually no cooldown between spells. In direct combat, Braham held the advantage.\n\n*Which means my personal performance becomes decisive.*\n\nSomething shifted in Agnus's posture. His breathing steadied. The chaotic thoughts plaguing his mind—memories of reality, of pain, of loss—faded into insignificance. Only the battle remained.\n\n*Sururuk.*\n\nAs his demonic energy settled into a controlled flow, a voice cut through the moment.\n\n\"Stay focused on him.\"\n\nFar away, a handsome man with black hair watched the broadcast intently, his expression unreadable. Kraugel's eyes never left the screen.\n\n***\n\n*Hrmm.*\n\nAgnus issued rapid mental commands: cancel offensive casting, switch to full defensive mode, prioritize evasion protocols. Mumud's form began weaving between incoming Fireballs and Dark Cutters with mechanical precision.\n\nBut Agnus's attention had already shifted. His gaze locked onto the separate engagement where White fought Regas and Euphemina.\n\n*Peeng!*\n\nA Fireball clipped his arm, spinning him halfway around.\n\n*Troublesome.*\n\nIndividually, Fireball and Dark Cutter were the most basic attack spells—predictable trajectories, simple to avoid. But Grid was maintaining *twenty concurrent casts*. The sheer volume created overlapping fields of fire that occasionally found their mark no matter how Agnus moved.\n\nMeanwhile, Mumud's defensive spells held firm, deflecting everything that came near. Agnus allowed himself a moment of relief before returning focus to White's battle.\n\nShe was dominating Regas, clearly the superior fighter—but she couldn't land a finishing blow. The magician Euphemina kept interrupting at crucial moments, disrupting White's rhythm. Victory wouldn't come quickly through White alone.\n\n*Then I'll force a breakthrough.*\n\nAgnus drew his sword and raised it to his mouth. His tongue dragged across the blade in a slow, deliberate lick.\n\n*Pisisik.*\n\nThe metal began to corrode, hissing as toxic saliva ate into the steel.\n\nGrid's casting rhythm faltered for half a second as his eyes widened. *What kind of poison...?*\n\nBut Agnus was already moving.\n\n*Teong!*\n\nIn a burst of speed, the necromancer disengaged—abandoning Mumud to face Grid alone as he sprinted toward White's position.\n\n\"Watch out!\" Grid's shout rang across the battlefield. He assumed Agnus was targeting Regas and Euphemina with that poisoned blade.\n\nThe assumption proved wrong.\n\n*Puok!*\n\n\"Kugh!\"\n\nAgnus's corrupted sword plunged into White's abdomen from behind.\n\nShocked silence rippled outward. Attacking his own ally? White's face twisted—not in pain, but in furious confusion.\n\n\"What the hell are you—\"\n\n\"Accept it,\" Agnus whispered, his voice cold as the grave.\n\n*Shaaaaah!*\n\nPurple demonic energy erupted from the corroded blade, flowing like poison through White's circulatory system. Her veins turned black beneath her skin.\n\n> [You have temporarily made the target a death knight.]  \n> [If the target accepts the transformation, their species will change to undead. All stats will increase by 23%, and they will gain the skill **Death Aura**. However, they will become extremely vulnerable to divine magic and will not benefit from healing effects.]\n\nDeath Knight Transformation—Agnus's most powerful and dangerous skill, obtained from a hidden quest chain. It granted the abilities of an elite death knight to a living person, transforming them into an undead weapon.\n\nBut it came with a brutal cost.\n\n> ['Agnus' wants to transform you into a death knight! Warning: When Death Knight Transformation expires, you will die and lose experience!]\n\nWhite's blood ran cold as the notification appeared.\n\n*That bastard—!*\n\nNo one would willingly accept such a skill unless they possessed absolute loyalty to Agnus. The penalty was too severe. Her moment of hesitation lasted only a heartbeat before Agnus leaned closer.\n\n\"Refuse, and I'll kill you right now anyway. Accept it and at least take them down with you. Well?\" His smile was a predator's grin. \"Keheheh...\"\n\nThe skill could be cast on corpses, but dead targets only gained partial benefits—and Agnus would have to control them directly like puppets. A living, willing death knight was exponentially more effective.\n\n\"You son of a bitch...\" White's voice shook with rage. \"You're paying me back for this!\"\n\nTrapped and out of options, she accepted.\n\n*Kiyaaaaaaah!*\n\n*Peeeeeong!*\n\nPurple aura exploded from White's body like flames. Her fist, now wreathed in death energy, rocketed toward Regas and Euphemina with triple her previous speed.\n\n\"Regas! Euphemina!\" Jishuka's panicked shout cut across the battlefield. She and Pon were still locked in combat with Black, unable to intervene. White's transformation had turned her into an overwhelming threat. Combined with Grid's precarious situation against Mumud, defeat seemed imminent.\n\nAgnus's smile widened with satisfaction. \"Keheheh... This is the true power of a necromancer. Understand now?\"\n\nDeath Knight Transformation was a limited-duration skill with strict cooldown restrictions—but it consumed *zero* dominance points. The only method by which Agnus could field both a death knight and Mumud simultaneously, since the lich alone drained most of his dominance stat.\n\nHis strategy crystallized: White would suppress Grid and his allies while Mumud prepared the ultimate spell. One catastrophic attack would end everything.\n\nNot just Agnus—every spectator reached the same conclusion. Grid's defeat was inevitable.\n\n\"It's over,\" Veradin muttered, watching from his own battle against Scott and the Ares Army. He and the other Immortal necromancers had expended enormous resources blocking the enemy advance. Ares' forces were strong; if this stalemate continued much longer, they'd break through. Veradin needed Agnus to finish quickly.\n\n*I didn't expect Grid to last this long, but— what?*\n\nVeradin's eyes snapped upward. A shadow fell across the battlefield like an eclipse, darkening the ground where tens of thousands clashed.\n\n\"What is...\"\n\nImmortal members and Ares soldiers alike froze mid-swing, staring skyward in incomprehension. Something *massive* was falling from the clouds—a pillar the size of a building, descending with apocalyptic force.\n\nA calm voice cut through the silence:\n\n\"Free Farming Peak Style, Pounding Mortar.\"\n\n*KUWAAAAAANG!*\n\nThe earth itself screamed. The colossal pillar of condensed energy crashed down precisely where White's death knight form had been charging—and *obliterated* her.\n\nNot damaged. Not wounded. *Annihilated*.\n\nWhite's body didn't even have time to turn gray. She simply ceased to exist beneath the crushing weight.\n\nAgnus's mouth hung open. His mind had gone completely blank. *A pillar from the sky? White killed instantly? What... how...*\n\n\"You summoned backup first, didn't you?\" \n\nGrid's voice held exhaustion—hundreds of simultaneous spells had drained his mana reserves to critical levels—but also satisfaction. \n\nStanding beside him, a middle-aged man lowered his hand. He carried a farming hand plow and sickle like weapons of war. Piaro's expression was serene, but his presence radiated absolute menace.\n\n\"HOW DARE YOU!\" Piaro's roar shook the battlefield. \"WHO DARES THREATEN THE OVERGEARED KING?!\"\n\n*Kuooooh!*\n\nThe very air responded to his fury. Grains of wheat that had been growing in distant fields began to glow. Natural State activated—and Piaro *vanished*.\n\nHe reappeared one meter from Agnus's face.\n\n\"Fated to Perish.\"\n\nAgnus's eyes widened in comprehension—and terror.\n\n*Puk.*\n\nA wet, meaty sound echoed across the suddenly silent battlefield.\n\n\"N-No...\"\n\nGrid and Euphemina's expressions fell in unison. The certainty of victory evaporated like morning dew."
}