{
  "id": 665,
  "title": "Chapter 665",
  "content": "—*I'll make sure you get your share. Just stay back.*\n\nThat was the message Grid had sent Euphemina the moment Agnus summoned Lich Mumud. He didn't want her interference—not in this fight. Agnus was considered one of the absolute strongest, and Grid needed to prove he could stand against him. Needed to earn that reputation, not hide behind others.\n\nEuphemina understood. She recognized the pride in Grid's request, even if it was impractical, and chose to respect it.\n\nSo she held back. Conserved her strength while fighting White, saving her most powerful skills. She felt bad for Regas taking the brunt of White's assault, but she was waiting—waiting for Grid to call her after he'd proven himself against Agnus.\n\nThen Piaro ruined everything.\n\n\"**Fated to Perish.**\"\n\nGrid's summoned knight appeared on the battlefield and annihilated White with **Pounding Mortar**. Then, without hesitation, he turned that devastating technique on Agnus himself.\n\n*Thunk!*\n\n\"N-No...!\"\n\nThe hand plow struck Agnus' forehead. His body began dissolving into grey light—the telltale sign of death. Grid's stomach dropped. When a summoner died, their summons died with them. Which meant...\n\n*Mumud.*\n\nBoth Grid's **Braham and Mumud** quest and Euphemina's **Liberate Mumud's Soul** quest were about to fail.\n\n\"D-Damn it, Piaro...\" Grid choked out.\n\nHe was as much a troll as Braham!\n\n\"It's all—wait...\"\n\nGrid blinked. The grey light was... *receding*. Agnus' body was reforming.\n\n*That's not the Immortal passive. He was already dead—I saw it. How is he canceling death itself?*\n\nThen Agnus spoke, his voice a raspy whisper that cut through the chaos of battle.\n\n\"Kuk... Kukuk! Never expected a monster of that caliber to show up.\"\n\nGrid stared.\n\nAgnus stood before them, but barely. Flesh hung in tatters from his frame, muscles torn, bone exposed beneath. He looked like a walking corpse—an undead thing that refused to die.\n\nThe battlefield went silent. Even the soldiers stopped mid-swing.\n\n\"**Summon Knights**...\" Agnus continued, sweeping blood-soaked hair from his skeletal face. \"You don't even have to control the summons. Broken skill.\" He laughed—a wet, rattling sound. \"Though I'll admit, I never thought to use it here myself. My dominated players are already engaged, and my NPC knights... they have finite lives. Too risky to throw them at someone as strong as you.\"\n\nHis exposed jaw cracked into a grin. \"But *your* knight? He's completely unfair.\"\n\nAgnus' hollow gaze locked onto Piaro. A legendary NPC—a monster no player should be able to face at this stage of the game. The kind of overwhelming force that made balanced PvP impossible.\n\n*Funny,* Agnus thought. *People look at me the same way.*\n\nHis mind drifted to **Absolute Domination**—Baal's Contractor's ultimate skill. Three uses. Ever. He could make any dead target his eternal servant. He'd used it once to steal Lich Mumud from Braham.\n\nTwo charges left.\n\nHis lips curled. Greed burned in his eyes as he stared at Piaro.\n\nMeanwhile, Piaro was looking back with something very different in his expression: *killing intent*.\n\n\"Power over death...\" Piaro's voice was cold. \"Dangerous.\"\n\nAgnus was too strong. If Piaro let him leave this battlefield alive, he would inevitably come back to threaten Grid.\n\n\"I have to kill you.\"\n\n*Crack.*\n\nPiaro's grip tightened on his sickle and hand plow.\n\n\"Yeah, no. Not today.\"\n\nAgnus stepped backward. The power of **Immortal** surged around him.\n\n*Clack! Clack clack clack!*\n\n*CLATTER CLATTER CLATTER!*\n\n*WAAAAAAHHH—*\n\nA wall of skeletons erupted from the ground—thousands of them, bodies piling upon bodies to form a writhing barrier. Even Piaro would need time to carve through that.\n\n\"Agnus, this way!\" Veradin's voice cut through the din, fighting his way past the Ares encirclement.\n\n\"Wait!\" Grid shouted after the retreating figure. \"What, you have no guts? Running away like this—aren't you embarrassed?\"\n\nAgnus froze.\n\nFor a moment, Grid thought his taunt had worked.\n\nThen Agnus laughed. \"Guts? Kik!\"\n\nHe shrugged off his robe.\n\nHis entire lower body was skeletal. Just bone and sinew. Several people immediately bent over, retching. Grid flinched despite himself.\n\n\"I'll postpone our rematch,\" Agnus said cheerfully, his skeletal jaw clicking with each word. \"Quest doesn't have a time limit anyway. Kukuk!\"\n\nHe turned to leave—but the Overgeared members and Ares troops weren't about to let him walk away.\n\n\"**Fly Up!**\"\n\nThe Red Phoenix erupted from Jishuka's bow, a blazing harbinger as the Ares forces surged forward in a coordinated assault.\n\nBut—\n\n\"**Raincoat. Body Shield.**\"\n\n*CRACK-CRACK-CRACK-CRACK!*\n\nMultiple magic shields materialized above Agnus, intercepting Jishuka's phoenix. The other skills crashed harmlessly against **Body Shield**—a defensive ability that could completely nullify any attack dealing less than 10,000 damage in a single hit.\n\nOf course, Agnus couldn't block everything alone. But he had hundreds of necromancers at his command, and they had thousands of undead. An army focused purely on defense was a nightmare to break through. Even Piaro and Euphemina were bogged down in the skeletal horde.\n\n\"Next time, summon your farmer from the start,\" Agnus called back with a grin. \"Let's see if you can do it without crying.\"\n\nHe channeled Lich Mumud's magic and began teleporting backward, space folding around him. While **Immortal** and the skeletal army tied up Overgeared and Ares, Agnus vanished from the battlefield.\n\n> [You have failed to defeat Mumud.]\n> [Braham's promise will have to wait for next time.]\n\n***\n\nLosing Agnus didn't mean losing the war.\n\nGrid's objective had been helping Ares conquer the Belto Kingdom. Meeting Agnus was pure coincidence.\n\n『 The moment Agnus retreated, Belto surrendered! 』\n\n『 God of War Ares has occupied the kingdom and become the second player king! 』\n\n『 Incredible that a force this powerful remained hidden for so long. Really shows you how vast Satisfy's world is. 』\n\n『 Speaking of which—Agnus. He might have lost and failed to kill both Grid and Ares, but his strength was *unique*. 』\n\n『 He held off the entire Ares Army plus Overgeared's elite forces... Honestly, more impressive than when Kraugel showed up. I was on the edge of my seat. 』\n\n『 Still, Grid comes out on top. The first player king helped create the second—his influence just keeps growing. 』\n\n『 That farmer though... 』\n\nThe ripple effects were massive.\n\nA second player kingdom had emerged. And it appeared to be closely allied with the Overgeared Kingdom, which meant Grid's sphere of influence had just expanded exponentially. Players across the continent took notice. Some with fear. Others with ambition.\n\nThe Ares Army's reputation skyrocketed overnight. An unknown force crushing an established kingdom made people wonder what *other* hidden powers might exist...\n\nAnd Agnus?\n\n\"If Agnus hadn't burned through his forces dealing with Ares first, his fight with Grid might have gone differently.\"\n\n\"That undead form when he was on death's door—*chilling*. Agnus is definitely Kraugel's level.\"\n\n\"The way he laughed while sacrificing his own allies... that's charisma.\"\n\n\"Yeah... Agnus is the real deal. I'm following him.\"\n\nFormer Blood Carnival members and other unsavory players were drawn to his strength—and his madness. They began gathering under his banner.\n\n***\n\n\"I'm sorry.\"\n\nGrid's apology was quiet but sincere. Euphemina had lost her chance at Mumud because of his pride. His need to prove himself.\n\nShe shook her head. \"Don't. Even if I'd been in the fight from the start, I'm not sure I could have subdued Mumud.\"\n\nThe encounter with Agnus had been completely unexpected—a random, terrible coincidence. And she'd burned through most of her high-level skills fighting the armored elite troops. She might not have been in any condition to face both Agnus and Mumud.\n\n\"He's just... really strong,\" she admitted.\n\nAgnus had exceeded everyone's expectations. But despite that, the mood among Overgeared wasn't grim. Sure, Agnus was powerful—but Grid had ultimately prevailed. As long as Grid was with them, they felt secure.\n\nGrid himself, however, looked troubled.\n\n*The commentators were right. If Agnus had come at me with his full force from the beginning—all his liches, all his death knights—I would have lost.*\n\nWithout the **Braham and Mumud** quest forcing Agnus to hold back, Grid wouldn't have stood a chance. He'd only maintained his advantage because of the quest's compensation effects.\n\n*I'm weaker than Agnus. Without Piaro, I would have lost.*\n\nBut then—\n\n*Next time will be different.*\n\nThe shadow lifted from his face. Because Grid had something Agnus didn't: flexibility. Adaptability.\n\n*That's the greatest advantage of Pagma's Descendant.*\n\nHe could create new items. Items tailored specifically for fighting undead. Anti-necromancer gear. The possibilities were already forming in his mind.\n\n*Agnus isn't like Kraugel.*\n\nKraugel's foundation was his inhuman control and reflexes—things Grid could never match. But Agnus relied on skills and summons. Which meant he had weaknesses. Gaps. And items were the perfect tool for exploiting those gaps.\n\n\"Next time...\" Grid murmured, a fierce smile spreading across his face. \"Next time, I'll win.\"\n\nThe game was too damn fun. There was never a dull moment.\n\n***\n\nOutside the Belto Kingdom.\n\n*Sssss...*\n\n*SSSSSSSS!*\n\nAlone, Agnus' body began dissolving into grey light again. The duration of his half-lich transformation had expired.\n\n> [You have died.]\n> [You have lost a large amount of experience.]\n\n\"Kik... Kikikik! Grid...\"\n\nBut he wasn't angry. His \"glorious debut\" had been humiliated, sure—but who cared? Who else had pushed him this far besides Kraugel?\n\nNobody.\n\n\"Grid! Kihat! Kikikik! Kuhahahat!\"\n\nAgnus was *happy*. Grateful, even. Grid had given him something precious: a new memory violent enough to overwrite the old ones. The suffering. The loss.\n\nTonight, at least, he'd be able to sleep soundly."
}