{
  "id": 666,
  "title": "Chapter 666",
  "content": "Agnus.\n\nBorn in Garmisch-Partenkirchen, Germany. Tormented throughout his school years by relentless bullying—stories so horrific they defied imagination. The harassment never stopped, not even when he became an adult.\n\n\"What made him a target?\" Lauel set down the dossier.\n\nThe detective struck a match, cigarette dangling from his lips. \"The way he talked.\"\n\n\"That's it?\"\n\nA bitter shrug. \"Doesn't take much to set people off. Some find it entertaining to watch someone suffer. Then it becomes routine.\" He exhaled smoke. \"What matters is what happened to his girlfriend—his only refuge.\"\n\n\"...\"\n\nLauel's jaw tightened as he read. The same people who'd tormented Agnus for years had done the unthinkable. They'd gang-raped her. While Agnus watched, helpless.\n\n\"The trauma drove her to suicide. That's when Agnus snapped. He took revenge—brutal, methodical. The court sentenced him to twenty-eight years.\" The detective tapped ash into a tray. \"Some human rights group got him out after three.\"\n\n\"Right when Satisfy launched...\" Lauel's voice was hollow.\n\n\"His psychiatrist pushed the game as therapy. Social readjustment program, they called it. Agnus dove in and never surfaced. Everyone around him breathed easier—better a ticking time bomb locked in a virtual world than walking the streets.\"\n\n\"...\"\n\nWhat better escape than a game? Reality offered nothing but pain. In Satisfy, at least the system was fair. Work hard, get rewarded. Simple. Clean.\n\nLauel drummed his fingers against the table, then stood. \"Appreciate it.\"\n\n\"You're paying me. I should be thanking you.\" The detective waved him toward the door. \"Call anytime you need something. Seattle's always open.\"\n\n\"...\"\n\nThe mansion felt emptier than usual when Lauel returned. He sat in the dark, thinking.\n\n***\n\n\"Noe, why aren't you eating?\"\n\n\"Don't want to, nyang.\"\n\n\"What's wrong?\"\n\n\"Why do you care if I don't eat, nyong?\"\n\n\"...\"\n\nThis wasn't normal. Pets still needed food even when tucked away in the inventory. And Noe? The demonic beast was a bottomless pit—always hungry, always waiting for his next meal. Now he was refusing food entirely. Grid studied Noe's shrunken belly with growing concern.\n\n\"Is this because I didn't summon you against Agnus?\"\n\nNoe's triangular eyes widened. His tail shot straight up.\n\n\"That's right, nyang! Why didn't you call me? I wanted to fight too!\"\n\nNoe had imprinted on Grid the moment he'd hatched—saw him as family, as everything. Helping Grid wasn't just a duty. It was instinct. And watching Grid face a powerful enemy without him? Unbearable.\n\n\"I'm the best demonic beast in hell! The noblest! You should depend on me, nyang!\"\n\nHis eyes gleamed with wounded pride. Grid couldn't help but smile at the fierce loyalty radiating from the small creature.\n\n\"I'm sorry. Won't happen again. But seriously—eat something.\"\n\nHad Grid truly forgotten about Noe? Of course not. How could he forget his strongest pet while fighting someone like Agnus? The truth was messier. Grid had wanted to summon Noe multiple times during that battle. Desperately wanted it. But Agnus had contracted with Baal—the 1st Great Demon himself. And memphis were demonic beasts, creatures born of hell's hierarchy.\n\nGrid had been afraid. Afraid that Agnus' aura might corrupt Noe, turn him against his master.\n\n'Maybe not full betrayal. But influence? Control? I couldn't risk it.'\n\nHe still didn't fully understand what Baal's Contractor meant. Too many unknowns.\n\n'And necromancers in general... I know nothing about them.'\n\nOvergeared had no necromancers in its ranks. The class specialized in solo play—most practitioners avoided guilds entirely.\n\n'Need to study them. Understand how they work.'\n\nParticularly death knights. The mechanics, the limitations. Grid hunted for several more hours, feeding souls to Noe, then logged out to do research.\n\n***\n\nNecromancers controlled the undead—skeletons, zombies, ghouls, skeleton warriors, archers, mages. The Domination stat determined how many they could command simultaneously. Higher domination meant more minions. The undead's strength scaled with the summoner's level. A typical level 300 necromancer possessed around 1,500 Domination—enough for 150 basic skeletons or 15 skeleton magicians at once.\n\nDifferent undead required different amounts of domination. A death knight—available only after third advancement—cost at least 1,000 domination points to maintain.\n\nDeath knights were crafted from the corpses of warriors who'd achieved greatness in life. Their power varied based on the body used as material. Quality of the base determined the ceiling. Once created, death knights were permanent summons that could level through combat like pets. Their development depended entirely on how the necromancer allocated stat points after each level gained.\n\nThird advancement necromancers could use Death Knight Production exactly once. Most speculated this limit would increase at fourth advancement.\n\n\"God, Agnus is completely broken.\"\n\nYoungwoo leaned back from his computer, rubbing his eyes. Every piece of information he gathered made Agnus seem more absurdly overpowered.\n\n\"No wonder everyone's obsessed with him right now...\"\n\nTwo days since their battle. The forums burned with speculation—people convinced Agnus possessed the next Legendary Class after Pagma's Descendant and Sword Saint.\n\n\"Most players don't even know hidden growth classes exist. Hrmm...\"\n\nAfter compiling everything about necromancers and mentally replaying Agnus' combat techniques, Youngwoo shut down his computer. Quick meal. Back to the capsule.\n\n\"The Behen Archipelago.\"\n\nDeath Knight Lantier guarded the 61st island. Grid would craft equipment for fighting undead, inspired by his clash with Agnus. Then he'd finally conquer the archipelago and claim Pagma's full legacy. That was the plan. The fastest path to getting stronger.\n\n\"Login.\"\n\n***\n\nGrid wasted no time. The moment Satisfy materialized around him, he teleported to a field outside Reinhardt and summoned his forces—four God Hands, Noe, Randy, both Overgeared Skeletons. He set them to hunting while he settled cross-legged and worked on his Tailoring skill. Efficient. Almost like macro-automation. Hell, practically necromancer-level automatic grinding.\n\n\"Item Information.\"\n\nHis hands moved mechanically, stitching leather as he pulled up Tiramet's Belt.\n\n[**Tiramet's Belt**]\n\n**Rating:** Unique (Growth)  \n**Experience:** 58.9%\n\n* Reduce damage received by 10%  \n* **Stamina +250**\n\n*A belt containing the unique magic power of Vampire Viscount Tiramet. When this item reaches legendary rating, the wearer can summon Vampire Viscount Tiramet.*\n\n**Weight:** 13\n\n\"Fifty-eight point nine percent...\"\n\nSeveral years in-game since he'd acquired it. Still stuck at unique rating. The growth curve to legendary was brutal.\n\n\"Once I can summon Tiramet, my attack power will spike.\"\n\nTiramet's defensive capabilities ranked among the highest of all vampires. Having him as a tank would stabilize Grid's entire combat style.\n\n'Won't need to order the God Hands to defend constantly. Tiramet tanks while using his bite to drain enemies—maximize both survivability and damage output simultaneously.'\n\nMotivation surged through him. Given Lantier's strength on the 61st island, every hit Grid took would pump massive experience into Tiramet's Belt.\n\n\"Strike while the iron's hot.\"\n\nGrid rose, still sewing, and headed toward Sticks' location. He'd need her to open a portal to the Behen Archipelago.\n\n'Wait.'\n\nHe stopped mid-stride.\n\nHe was stronger than before. Significantly stronger. But guaranteed victory against Lantier? Still a stretch.\n\n'Already finished armor specifically for fighting him... A new weapon would help.'\n\nHow long had he been using Failure? He hadn't crafted a single sword worth keeping since then. Even Sword Ghost—his most recent attempt—hadn't replaced it.\n\n'Hrmm.'\n\nThe materials from Belial's raid sat in his inventory. Plus, he'd finally mastered proper use of Belial's accessories through crafting items for his retainers. Grid could make the sword he'd been dreaming about. Just one problem.\n\n'Belial's accessories contain too much concentrated demonic power. Any weapon made from them would be specialized for one characteristic...'\n\nUnfortunate. Great demon materials inherently pushed equipment toward single-trait optimization.\n\n'What if I could forge a true master weapon? Strong against normal monsters, strong against players, strong against giants, strong against undead—perfect versatility.'\n\nBut was that even possible? Even myth-rated items like the Red Phoenix Bow and Lifael's Spear specialized in fire and divine power respectively. A perfectly balanced all-rounder weapon seemed like fantasy.\n\n\"...Hold on.\"\n\nLightning struck in Grid's mind. An idea crystallized. The hidden skill Item Combination whispered possibilities!"
}