{
  "id": 668,
  "title": "Chapter 668",
  "content": "Four hours and change. That's how long Grid had been hunched by the roadside, lost in his work. Nothing else existed—just the item taking shape in his hands.\n\n\"...Done.\"\n\nGrid straightened, confidence blazing across his features. \"It's perfect.\"\n\n> [Pulling Tool]\n> * Secondary tool.\n> A small box five centimeters in diameter, created by blacksmith Grid in his pursuit of divine craftsmanship.\n> Pressing the button activates an internal mechanism: clockwise rotation retracts the silver thread, counterclockwise extends it. Deployment time: 0.3 seconds.\n> The thread's end can be affixed to any blade-type item.\n> Conditions of Use: Dependent on installation location.\n> * Box can be mounted anywhere.\n> Mana Cost per Activation: 630.\n\n\"Three-tenths of a second...\"\n\nThe words came out half-choked with excitement. He'd cut the blade separation time to almost nothing!\n\n\"I have to test this. Now.\"\n\nGrid practically ran toward the smithy.\n\n***\n\n*Clang! Clang!*\n\n\"No, you idiot! Where's the rhythm? Listen to what the metal's telling you!\"\n\n\"That fire's all wrong. Control the heat like you would a woman's body—gently, precisely—and you'll get twice the yield.\"\n\nThe massive forge complex at Reinhardt's heart bustled with activity. Master blacksmiths from across the kingdom worked alongside craftsmen from Pangea, training thousands of apprentices. East and West Continental techniques merged and evolved, creating something neither tradition could achieve alone.\n\n> [Baron's Beginner Blacksmith skill has improved!]\n\n> [Spinner's Intermediate Blacksmith skill has advanced!]\n\n> [Medon's Intermediate Blacksmith skill has achieved significant growth!]\n\n\"Good, good! That's more like it!\"\n\nKhan moved through the organized chaos, his weathered face creased with satisfaction. The Overgeared Kingdom's only Craftsman-ranked blacksmith took pride in this work—watching his students teach and learn, compete and grow. All for King Grid.\n\n*His Majesty must be accomplishing something incredible right now...*\n\nGrid had disappeared shortly after relocating tens of thousands of Pangeans to Reinhardt. Khan had no doubt what that meant. Somewhere out there, Grid was either performing heroic deeds or forging masterwork equipment with the continent's finest techniques. Of that much, the old blacksmith was certain.\n\n*Snap!*\n\nThe smithy's front door—heavy enough that a strong man had to lean his full weight against it—swung open as if caught by a breeze.\n\n\"Move!\"\n\nGrid burst through, too focused to remember he was a king. He made straight for the nearest furnace and pulled out his hammer.\n\n\"The Overgeared King...!\"\n\nEvery eye turned toward him. *Pagma's Descendant.* A legendary blacksmith. The chance to observe him work was worth more than any lesson. Excitement rippled through the forge as blacksmiths abandoned their stations and converged on Grid's workspace. Even Khan couldn't help himself.\n\n*Those eyes—so focused...!*\n\nKhan swallowed hard, already wondering what marvel would emerge. Grid produced drake fangs and silver thread.\n\n\"Ohhh!\"\n\nMaterials rarer than dragon scales, both at once! Anticipation crackled through the crowd.\n\n*A legendary sword?*\n\n*No, look at all that thread—probably armor. He'll use it for reinforcement and aesthetics.*\n\nWhat would the world's only legendary blacksmith create with such treasures? Work stopped throughout the forge as everyone fixated on Grid. Oblivious to the attention, he began.\n\n*Clang! Clang!*\n\n\"...Huh?\"\n\n*Whoosh! Crackle!*\n\n\"...?\"\n\n*Clang! Clang!*\n\n\"...\"\n\nConfusion spread as the work progressed. Those precious drake fangs became... an empty box? And some kind of disc? Neither weapon nor armor. The purpose remained utterly unclear.\n\n*What on earth...?*\n\nThe finished pieces were tiny—the box barely five centimeters across, the disc even smaller. Child's toy sized. Several blacksmiths stared in disbelief.\n\n*He used drake fang for... that?*\n\n*Maybe His Majesty doesn't understand material value?*\n\nThe doubts multiplied as Grid continued. He wound silver thread around the disc, then mounted the assembly inside the box. The advanced blacksmiths caught their breath—Grid's dexterity transcended anything they'd ever achieve.\n\nThe intermediate and beginner blacksmiths, however, saw only speed. They'd missed the subtlety entirely, assuming the work was simple.\n\n\"Alright, finished.\"\n\nGrid smiled and drew his **+7 Sword Ghost**, separating the blade from its handle. He attached the pulling device to the grip, then welded it in place using the furnace's heat.\n\n\"Keke... Kehehehe!\"\n\nWhatever had him so pleased remained Grid's secret. The blacksmiths exchanged bewildered glances.\n\n*Click!*\n\nGrid pressed the button.\n\n*Whirrrr!*\n\nSilver thread shot from the box.\n\n*Click.*\n\nHe pressed again.\n\n*Whirrrr!*\n\nThe thread retracted instantly.\n\n\"What...?\"\n\n*Spectacular!*\n\nInterest rekindled throughout the forge. But the tool's actual purpose remained a mystery.\n\n*Impressive, sure, but what's the point of launching a single thread?*\n\n*Too flimsy for a weapon...*\n\n*Maybe it's meant to grapple onto things? Or bind enemies?*\n\n*Can't be. That thread's barely a meter long.*\n\n*Hmm...*\n\nThe Overgeared Kingdom employed no player blacksmiths—most production classes gravitated toward the Saharan Empire's wealthy markets. These NPCs, born and raised in Satisfy, couldn't bridge the gap to Grid's modern Earth sensibilities. Grid pulled out Belial's Horn.\n\n> [Belial's Horn]\n> Weapon material infused with a Great Demon's magic.\n> Adds multiple options to crafted weapons.\n> Finding a blacksmith capable of working this material is nearly impossible.\n\nA great demon's drop. More valuable than adamantium, arguably. Grid had already worked with Belial's Horn multiple times while crafting equipment for his retainers.\n\n*At least eight options should manifest...*\n\nPhysical damage, magic damage, fire damage, dark damage, a chance to release flames on contact, bonus damage against divine beings, and the ability to induce hallucinations.\n\nExperience taught him that weapons made from Belial's Horn gained between two and four of these eight properties.\n\n*Physical damage, fire damage, and the divine-killer effect—like Piaro's hand plow.*\n\nThat weapon's power was devastating. The blade he intended to craft would need those same qualities.\n\n*Please, no magic damage bonus...*\n\nGrid tossed the horn into the flames.\n\n*Rummmble!*\n\n\"Heok...!\"\n\nGasps echoed through the smithy. The instant Belial's Horn entered the fire, the furnace roared with barely contained violence.\n\n\"I-Is that the curse of a great demon?\"\n\nKhan's voice cut through the rising panic. \"Settle down! It's not a curse—just the reaction from the demonic magic in the horn.\"\n\n*This* was why blacksmiths feared Belial's Horn. The material fought back viciously, especially during the refining process.\n\n*Clang!*\n\n*Peeeong!*\n\n*Clang!*\n\n*BOOM BOOM BOOM!*\n\nGrid placed the glowing red horn on his anvil. Each hammer strike unleashed explosions of flame and shadow that engulfed him completely. The damage was constant.\n\n> [You have suffered 4,400 damage.]\n\n> [You have suffered 4,530 damage.]\n\n> [Doran's Ring effect has activated.]\n\n> [2,265 health restored.]\n\n> [You have suffered 4,370 damage.]\n\n> [Tiramet's Belt experience increased by 0.01%!]\n\n*At least I'm getting item experience out of this pain.*\n\nWithout his current stats and equipment, this process would kill him outright.\n\n*Clang! Clang!*\n\n*RUMMMBLE!*\n\nHundreds of strikes! Each one brought fire and darkness crashing down. But Grid didn't fall. He weathered the onslaught with potions, Tiramet's Belt's healing, and the defensive boost from his **First King** title.\n\n\"...Gulp.\"\n\n*Risking death just to smith?* Horror and awe warred on every face watching. The forge had gone silent except for the rhythmic pounding of Grid's hammer.\n\n> [Your potion cooldown hasn't reset.]\n\n\"Damn.\"\n\nBelial's Horn's resistance was relentless. Grid took breaks when injuries forced him, relying on sheer stubbornness to push through.\n\n\"G-Good god...\"\n\n\"...\"\n\nNight turned to dawn. The blacksmiths had forgotten to eat. Some had dozed off standing up.\n\n*Clang! Clang!*\n\n*Whoosh!*\n\nThe horn still fought, but its fury was weakening. Grid sensed the end approaching. The sun climbed toward its zenith.\n\n> [Your extreme concentration has triggered **Legendary Blacksmith's Patience**.]\n\n> [Vitality, Defense, and Dexterity increased by 200% for one hour.]\n\nThe skill that activated far less often than **Legendary Blacksmith's Breath** finally triggered, making everything easier.\n\n*Clang! Clang!*\n\nUnder Grid's relentless hammering, Belial's Horn began to transform. The blade shape he'd envisioned slowly emerged. Then something extraordinary happened.\n\n> [Final tempering complete. Belial's Horn has been enhanced.]\n\n> [Enhanced Belial's Horn]\n> Belial's Horn refined by Legendary Blacksmith Grid.\n> Superior to standard Belial's Horn as weapon material.\n> Handling difficulty significantly increased. Requires substantial time and effort to forge into desired form.\n\n\"Eh...?\"\n\nThe same phenomenon that had occurred with the Red Phoenix's Breath—it had happened again!"
}