{
  "id": 670,
  "title": "Chapter 670",
  "content": "# Chapter: The Burning Blade\n\nThe training grounds of the Overgeared Kingdom rang with the clash of steel and the shouts of drilling soldiers. Asmophel stood among them, overseeing their exercises, when he spotted Grid crossing the yard. Something unusual hung at the king's waist—a bladeless weapon that caught his eye immediately.\n\n\"Your Majesty.\" Asmophel approached, his gaze locked on the strange implement. \"That weapon... it has no handle.\"\n\nThe blade appeared incomplete, as if Grid had abandoned the forging process midway through. Asmophel opened his mouth to ask about it—\n\nFlames erupted from the weapon.\n\nThe fire blossomed like a flower in full bloom, lava-red and beautiful, before vanishing as suddenly as it had appeared. Asmophel's eyes widened.\n\nGrid grinned. \"Impressive, isn't it? It's made from Belial's Horn, just like your weapon. And yes, it's finished.\"\n\nRather than explain further, Grid reached for the Sword Ghost at his hip and pressed the button on the Pulling Device attached to it.\n\n*Hwiririk!*\n\nSilver thread shot out, snaring the floating blade and yanking it toward the Sword Ghost with a metallic *click*. The two pieces locked together seamlessly.\n\n\"Ah.\" Understanding dawned on Asmophel's face. \"The groove in the blade—it attaches like a sheath.\"\n\n\"Exactly. I can separate them mid-combat and catch an enemy off-guard.\"\n\n\"A clever application.\"\n\n\"Well, that's one use for it, anyway.\"\n\nAs Grid walked deeper into the training yard, the soldiers' attention shifted toward him like iron drawn to a magnet. Drills faltered. Sparring matches paused. Thousands of eyes followed the Overgeared King across the grounds.\n\nAmong them stood more than just NPCs. Player soldiers watched as well—mercenaries like Soldier, who'd fought alongside Peak Sword on Cork Island, and dozens of others who'd enlisted specifically for one reason: the mass-produced Grid Set.\n\nThey harbored no loyalty to the Overgeared Kingdom. The empire would have been a better choice from a tactical standpoint. So would Ares' forces. But neither offered equipment that could match Grid's creations.\n\n*Just get the set and leave,* one player thought, arms crossed as he watched Grid approach the training dummies. *Complete the quests, earn the rewards, move on.*\n\n*The empire pays better,* another mused. *But the gear here is worth the temporary inconvenience.*\n\nThey saw the Overgeared Kingdom as a stepping stone—nothing more.\n\nUnlike the NPC soldiers whose eyes shone with admiration, the players watched Grid with skepticism. They'd seen him lose to Kraugel at the National Competition. They'd witnessed Agnus push him back in the Belto Kingdom. In their minds, Grid was strong, yes—but he wasn't number one.\n\n\"What's he doing?\" someone muttered as Grid stopped before a training scarecrow.\n\nAnother player snickered. \"Going to put on a show for the NPCs? Boost morale with some flashy swordplay?\"\n\n\"Typical,\" a third player said with a smirk. \"The NPCs don't know about Kraugel or Agnus. They'll eat it up.\"\n\nThe players didn't hate Grid. They were jealous—jealous of his success, his fame, his legendary class. But rather than admit it, they searched for flaws to pick apart, small criticisms to make themselves feel superior.\n\nGrid, for his part, didn't spare them a glance.\n\nHe knew exactly why these players had enlisted. They were tourists passing through, nothing more. He treated them as such—background decoration while he focused on what mattered.\n\n\"Time to test this properly.\"\n\nSparks danced along the blade in his hand as he raised it toward the scarecrow. The training dummy had fixed defense and zero resistance—perfect for measuring raw damage output.\n\nGrid swung.\n\n*Peeeeeong!*\n\nThe sound wasn't that of a basic attack. It rang out like a bell, sharp and resonant, as the scarecrow's frame shuddered under the impact.\n\n[You have dealt 11,397 damage to the target.]\n\nThe scarecrow toppled backward, then sprang upright again—its enchantments forcing it to reset after taking sufficient damage.\n\n\"...!!\"\n\nSoldiers blinked in confusion. The scarecrows only fell when hit for more than 10,000 damage. Had the king used a skill?\n\nGrid struck again. Then again. The blade sang through the air in rapid succession.\n\n*Jjang! Jjejeong! Jjejejeok!*\n\n[You have dealt 12,537 damage to the target.]\n[You have dealt 13,791 damage to the target.]\n[You have dealt 15,170 damage to the target.]\n\nEach strike hit harder than the last. The Sword Ghost's enchantment was working—every consecutive hit on the same target increased his attack power. The scarecrow fell and rose, fell and rose, like a macabre dance partner.\n\n\"Wait.\" One of the player soldiers squinted. \"Is he... not using skills?\"\n\n\"He has to be,\" another insisted. \"No way that's basic attacks. The scarecrow wouldn't fall otherwise.\"\n\nBut doubt crept into their voices. They'd seen Grid's sword dance before. This wasn't it. These were simple swings—brutal in their efficiency, lacking any flourish or technique.\n\n*Jeeeong!*\n\n[Critical!]\n[The effect of the title 'Death in One Shot!' has been activated, adding 30% critical damage!]\n\nThe next strike blazed with orange light. A critical hit, amplified by both Grid's title and his Pagma's Swordsmanship passive bonuses. His base critical damage exceeded 250%—a number that would make assassins weep with envy.\n\n[You have dealt 41,718 damage to the target!]\n\n*Kwajak!*\n\nThe scarecrow exploded into splinters.\n\n\"That... that wasn't a basic attack,\" a player stammered, face pale. \"It couldn't be.\"\n\nThe scarecrows were enchanted to stabilize under 50,000 damage. For Grid to destroy one meant—\n\nNo. Impossible.\n\nGrid moved to the next dummy.\n\n[The +8 Holy Light Gloves's option effect is activated, causing the skill '5 Joint Attacks' to be generated!]\n\nFive strikes in the span of a single blow. The damage multiplied beyond reason.\n\n[You have dealt 91,780 damage to the target!]\n\nThe scarecrow didn't just break—it vaporized. Ash scattered through the air.\n\n*Kuwaaang!*\n\n[The option effect of the Sword Born from Enlightenment and Strong Desires has added 5,000 fire damage!]\n\nFlames consumed even the ash, leaving nothing behind.\n\n\"He's chaining skills,\" someone whispered. \"That has to be it. He's using abilities without any cooldown delay.\"\n\nThe players clung to that explanation. It was the only thing that made sense. Grid couldn't possibly be doing this with basic attacks alone.\n\nBut Grid wasn't finished.\n\nHe turned to a fresh scarecrow and began again. One strike. Two. Three. The Sword Ghost's enchantment stacked with each consecutive hit, building power exponentially.\n\n[You have dealt 11,397 damage to the target...]\n[You have dealt 12,537...]\n[You have dealt 13,791...]\n...\n[You have dealt 22,794 damage to the target!]\n\nTen consecutive strikes on the same target. The Sword Ghost's power peaked at 100% bonus damage.\n\nA new notification flashed in Grid's vision.\n\n[The option effect 'Black Flames' has activated from the Sword Born from Enlightenment and Strong Desires!]\n\nThe blade in Grid's hand erupted with black fire.\n\n*Kuwaaaaaang!*\n\nFlames radiated outward in every direction—a sphere of destruction with Grid at its center. Five thousand training scarecrows filled this section of the grounds. Now they ignited like kindling.\n\n[Splash damage equal to 300% of your attack power will hit every target within 10 meters.]\n[Critical!]\n[The effect of the title 'Death in One Shot!' has been...]\n[The +8 Holy Light Gloves's option effect is activated, causing the skill '5 Joint Attacks' to be...]\n\n[You have dealt 854,775 damage to the target!]\n[You have dealt 854,775 damage to the target!]\n[You have dealt 854,775 damage to the target!]\n[You have dealt 854,775...]\n...\n\n*Ku kwa kwa kwa kwa! Ku kwa kwa kwa kwa!*\n\nExplosion after explosion detonated in a perfect circle around Grid. Hundreds of scarecrows simply ceased to exist, erased from the world without leaving so much as a fragment behind.\n\nSilence fell over the training grounds.\n\nAsmophel wiped sweat from his brow, blown there by the shockwave. \"Lauel isn't going to be happy about this.\"\n\nThe soldiers—both NPC and player alike—lay flat on the ground, knocked over by the blast. They stared up at Grid with expressions of pure shock.\n\nGrid, standing at the center of the scorched earth, wiped tears from his eyes.\n\n\"Beautiful.\"\n\nHe hadn't even used Blackening. Hadn't activated Blacksmith's Rage. This was his *base* power with the new weapon—just basic attacks and passive effects. And he'd obliterated everything within ten meters.\n\n---\n\nThat evening, a post appeared on the Satisfy community forums.\n\n**Title:** *To Everyone Saying the Overgeared King Can't Match Agnus*\n\n**Posted by:** Soldier J\n\nListen up. I'm a soldier in the Overgeared Kingdom's army, and I need to set the record straight.\n\nYou people think Grid went all-out against Agnus in Belto? You think that was his limit?\n\nWrong.\n\nI watched King Grid train today. He has this sword—burns with black flames, the kind that ignore resistance entirely. He could've incinerated Agnus, every death knight, every lich, all of it. Just burned them to nothing.\n\nBut he held back. Didn't even use it. Too much power, honestly ㅡㅡ;;;;\n\nJust wanted you to know the truth.\n\nP.S. I'm never leaving the Overgeared army. For reference.\n\n---\n\nThe post exploded across the forums, but not with belief—with mockery.\n\n*\"Overgeared propaganda lol\"*\n*\"They're trying to salvage Grid's reputation\"*\n*\"Zero credibility\"*\n\nPlayers dismissed it as manipulation, the kingdom's PR team working overtime to protect their king's image.\n\nBut the truth has a way of revealing itself.\n\n---\n\nDays later, the training grounds buzzed with renewed energy.\n\n\"Salute!\"\n\n\"Long live King Grid!\"\n\n\"For the Overgeared Kingdom!\"\n\nGrid walked past, confused by the sudden enthusiasm from soldiers he'd barely spoken to. The player soldiers who'd once watched him with skepticism now drilled with the same fervor as the NPCs.\n\nThey'd seen the truth with their own eyes. And they'd chosen to stay.\n\nThe Overgeared army grew stronger by the day."
}