{
  "id": 673,
  "title": "Chapter 673",
  "content": "\"The Behen Archipelago.\" Grid's reluctance was written all over his face. \"It's too soon.\"\n\nLauel disagreed. \"Didn't you say the guardian of the 61st island is the legendary assassin Lantier?\"\n\n\"Lantier as a Death Knight—armed with Pagma's gear!\" Grid corrected him sharply.\n\n\"He must be formidable. But you already have a plan to counter him, don't you? You forged armor specifically to nullify his attack power.\"\n\nGrid had assembled quite the defensive arsenal: Triple Layers for physical resistance, Lantier's Cloak, the Horned Helmet, and the Large Gloves. He nodded slowly.\n\n\"You're not just blowing smoke... I won't drop as fast as before, that's true. But what about my weapon?\"\n\nHis brow furrowed. \"I made the Enlightenment Sword—a demonic blade perfect for cutting down divine beings, but not ideal against undead.\"\n\nDeath Knight Lantier was classified as a dark-property monster. The Enlightenment Sword's thirty percent bonus to dark damage would actually heal him. Worse, Lantier's evasion was legendary. Could Grid really take down such a formidable named boss?\n\n\"So you need a holy sword first?\" Lauel asked.\n\n\"It would help.\"\n\n\"Makes sense. Better to prepare thoroughly without worrying about death penalties... Do you have materials for a holy sword?\"\n\n\"Mithril's readily available on the market.\"\n\n\"Mithril?!\" Lauel shot to his feet.\n\nGrid flinched. \"What? Why are you freaking out?\"\n\n\"I'm not freaking out! This is a holy sword we're talking about! And you want to make it from *mithril*?!\"\n\n\"...\"\n\nMithril was effective against undead and classified as an advanced mineral—but that was ordinary player thinking.\n\n\"The demonic sword is forged from Belial's Horn,\" Lauel said. \"If you're making a holy sword, shouldn't the material match that standard?\"\n\nGrid paused. \"...You have a point.\"\n\nThe Blade Born from Enlightenment and Strong Desires was myth-rated. Against undead, the Enlightenment Blade would outperform any legendary mithril weapon.\n\n\"Right. Using common materials for my weapons doesn't make sense.\"\n\n\"Glad we agree.\"\n\nMoving forward, all of Grid's personal weapons should aim for the Enlightenment Sword's caliber at minimum. The implications were staggering.\n\n'So where do I find materials for a holy sword?'\n\nEven adamantium couldn't match Belial's Horn. To obtain sacred materials of equivalent grade...\n\n'Would I have to kill an angel?'\n\nFor what reason?\n\n'Can I even *meet* an angel?'\n\nHis thoughts spiraled.\n\n\"Grid?\"\n\nSage Sticks entered. Lauel had summoned him.\n\n\"You're heading to the Behen Archipelago?\"\n\nSticks wanted the Behen Archipelago purified, restored to its rightful function as the Hall of Fame. His eyes brightened at the prospect of Grid attempting it again. Grid caught that hopeful look and scratched his cheek.\n\n\"Actually, I think I should postpone.\"\n\nGrid expected understanding. Sticks knew firsthand how powerful the guardians of the sixties islands were. But Sticks' response caught him off guard.\n\n\"Why postpone?\"\n\n\"Why? I'm still too weak.\"\n\n\"What?\"\n\n\"...\"\n\n*That* reaction? Grid blinked.\n\n\"What's that supposed to mean? Sticks, you *saw* Lantier's power. I couldn't even touch him before.\"\n\n\"That was then. Death Knights don't grow without their master. But you? You have new armor, new weapons—you're incomparably stronger than before. You can defeat Lantier now.\"\n\n\"...\"\n\nLauel and Sticks. When two brilliant minds kept treating Lantier like a minor obstacle, Grid felt like an idiot.\n\n'Am I underestimating myself?'\n\nHe *had* grown by leaps and bounds since his first attempt at the Behen Archipelago. His equipment had been enhanced multiple times, his character level and skill levels had climbed steadily. He'd even earned legendary titles like Savior of the World and First King. But the trauma of facing Lantier had warped his perspective.\n\n\"Even if I can beat Lantier, the Behen Archipelago doesn't end at the 61st island. There are sixty-six islands. I'd have to fight multiple legendary Death Knights back-to-back. Wouldn't it be safer with a holy sword ready?\"\n\n\"I see your concern. You think a holy sword is essential because Death Knights are evil. But Death Knights are undead *before* they're evil, which makes them vulnerable to explosive attacks and light attributes.\"\n\nUndead had weak endurance. High-level undead compensated with high defense, but defense and endurance were separate concepts. Their bones could be shattered and separated with sufficient explosive force.\n\n\"I heard the sword you forged has a powerful explosion effect. You can easily defeat undead with it.\"\n\n\"...\"\n\nNo reason to delay. Sticks' words freed Grid's paralyzed mind.\n\n\"So the Behen Archipelago is... easy?\"\n\n\"...I wouldn't go *that* far...\"\n\n\"Fine! Let's go! Right now!\"\n\nHow depressing. He was a king, yet being sent on a business trip.\n\n'I feel like a salaryman, not a monarch!'\n\nA wave of loneliness washed over him. Before departing, Grid turned to Lauel.\n\n\"Is it safe to leave now? What if the Empire strikes?\"\n\nGrid knew the Empire was having trouble mobilizing troops, but they still had the Red Knights. If Lauel followed through with refusing this month's tribute, the Empire might send the Red Knights to threaten the Overgeared Kingdom. Lauel's reassurance was immediate.\n\n\"Someone claiming to be the Undefeated King's descendant appeared in Lubana. The Red Knights were dispatched in force. That's partly why Ares could defy the imperial envoy. The Empire can't touch us right now.\"\n\n\"The Undefeated King...?\"\n\nGrid vaguely recalled Undefeated King Madra from the 2nd National Competition, when commentators mentioned it while discussing Bubat's Undefeated King's Battle Gear Set.\n\n\"The king of Lubana who never lost to the Empire...\"\n\nA thought struck him.\n\n\"Is Bubat the Undefeated King's descendant?\"\n\nBubat's status conditions applied constantly. With the Undefeated King's power backing him, he couldn't be dismissed lightly. Lauel shook his head at Grid's wariness.\n\n\"Identity unknown. Besides, we don't need to worry about them.\"\n\nThe Undefeated King's appearance benefited both Overgeared and Valhalla. Their identity was a mystery, and while they might become enemies later, for now they were welcome. Too early for paranoia.\n\n\"We just need to focus on what we have to do.\"\n\n***\n\nThe Behen Archipelago—the Hall of Fame that honored past legends' achievements and passed down their legacies to current legends. An important stronghold in the human world, the Middle World. That made it a target for Great Demons.\n\nWary of legends who could threaten them despite being mere humans, the Great Demons invaded to conquer the Behen Archipelago. Then Pagma emerged, wielding transcendent power through his contract with Baal, the 1st Great Demon. He transformed the Behen Archipelago and intercepted the invading demons, defeating them decisively.\n\nBut the Behen Archipelago couldn't function properly afterward. It was no longer the Hall of Fame, no longer a place of succession after Pagma's transformation. It became an impregnable fortress that existed only to destroy intruders. Sticks called it \"contaminated.\"\n\n\"I won't deny Pagma's accomplishment. Without Pagma, the Middle World would be a demon playground right now. Neither of us would exist. I respect him. I'm grateful to him.\"\n\nHe paused.\n\n\"But Pagma's choice weakened the Middle World. The Behen Archipelago lost its function. The memories, the feats, the visions of past legends—forgotten. Current legends can't exert their full strength, except those who pioneered new legends independently, like Piaro. They're different.\"\n\n\"'Those'? There's someone else who became a new legend besides Piaro?\"\n\n\"I can't rule it out. Somewhere, another human or elf might have become a legend in their field. Unlikely, but possible.\"\n\n\"...True.\"\n\nSatisfy was vast. Sticks only mentioned humans and elves, but there might be legends among other species—dwarves, orcs.\n\n'No, new legends are bound to emerge.'\n\nNot just existing ones. The damn S.A. Group kept raising the difficulty, doing god-knows-what behind the scenes. Sticks placed a hand on Grid's shoulder.\n\n\"Let's depart.\"\n\nSticks had enormous hopes for Grid. As Pagma's Descendant, Grid seemed destined to cleanse the Behen Archipelago.\n\n\"Restore the Hall of Fame. Become a legendary hero.\"\n\n'Legendary hero...'\n\nA hero of heroes.\n\n'Like... a celebrity of celebrities?'\n\nThe thought made Grid's head spin.\n\n*Flash!*\n\nHis vision blinked to black. Sticks' Mass Teleport activated, coordinates locked on the Behen Archipelago."
}