{
  "id": 674,
  "title": "Chapter 674",
  "content": "**Corpse Storage:** A necromancer-exclusive inventory capable of permanently storing up to five NPC or monster corpses. Most necromancers hoarded the remains of named NPCs or raid bosses they'd acquired through quests or events—a collection of potential death knight candidates. They'd save the best corpses to transform into their ultimate undead warriors.\n\nAgnus had one such body stored away.\n\n**[Lantier's Remains]**\n\nRating: Legendary\n\n*The remains of the 15th Lantier, revered as a legendary assassin.*\n\n\"I'd love to use him...\" Agnus muttered, staring at nothing. \"But the dominance requirements are insane.\"\n\nHe'd come to the Behen Archipelago searching for Pagma's legacy—the inheritance of Baal's former contractor. The 61st island had nearly broken him. Two days and nights of relentless combat against Lantier's death knight. His own undead forces had died repeatedly, losing experience each time. Even his liches had burned through their passive abilities. The stamina management alone had pushed him to his limits.\n\nBut god, what a rush.\n\nPure. Focused. Nothing but the fight.\n\n*A level 400 death knight with a legendary body as its base...* \n\nMore than that, Lantier had been an assassin. The corpse's agility would make it move like something alive—fluid, deadly, unlike his other lumbering death knights. Agnus was certain it would rival Lich Mumud in power.\n\n*Once I level up... once my dominance is high enough... Lantier will move like my own shadow.*\n\nHe'd go back. Back to the 62nd island where he'd fallen.\n\n\"I'll claim every legendary death knight on these islands.\" His voice dropped to a whisper. \"Every. Single. One.\"\n\nThe realization had hit him hard: the legendary death knights scattered throughout the Behen Archipelago *were* Pagma's legacy. Each one wielded his items.\n\n*More.*\n\nHe needed more power.\n\n*I'll crush everything. Break it all.*\n\nThere was no high quite like destruction. No pleasure that compared to slaughter. For the first time, he understood those pieces of trash who'd tormented him to madness—\n\n\"Kuk!\"\n\nAgnus stumbled, shaking his head violently. The thought sent agony lancing through his skull. Some deep, primal part of him recoiled at the idea that he'd become like *them*—like the scum who'd destroyed his life and murdered his beloved. His mind protected itself the only way it knew how.\n\n\"Hah... hah... kik, kikik.\"\n\nHe licked the cold sweat from his lips, forcing out a laugh. Ignore the past. Forget the meaningless present. Focus on what matters.\n\n\"Veradin! VERADIN!\"\n\n\"You called?\"\n\nThey stood in Empress Marie's palace, surrounded by her Rose Knights. Agnus didn't spare her a glance. Veradin appeared quickly, and Agnus spoke before he'd fully arrived.\n\n\"I'm going to the Behen Archipelago. Now.\"\n\n\"What?\"\n\nVeradin's composure cracked. Death Knight Alex—the former Demon Slayer—guarded the 62nd island. Agnus couldn't beat him yet. Why would he throw himself at an impossible challenge without preparation?\n\n\"You'll fail again. What's the point of—\"\n\nVeradin stopped. Agnus' eyes were bloodshot, tears streaming down his face.\n\n\"You...\"\n\n\"I have to fight! I *have* to forget!\"\n\n\"...\"\n\nAh. Veradin understood. Agnus wanted to drown the memories in combat—lose himself in the only thing that still felt real. It was a desperate wish, almost childlike in its simplicity.\n\nVeradin understood. But he couldn't allow it.\n\n\"Go to Empress Marie instead. Accept a quest from her. The Behen Archipelago isn't going anywhere, but weakening yourself with pointless defeats will only push your goal further away. Breathe. Calm down.\"\n\n\"...\"\n\nVeradin's voice was incongruous with his beautiful, youthful appearance—deep and resonant, like it came from the depths of a cave. That voice carried a weight that made people believe. Even Agnus' spiraling thoughts began to settle.\n\nVeradin pressed on. \"Don't be anxious. The Behen Archipelago will still be standing when you're ready. It's waited this long—it can wait longer.\"\n\nThe difficulty was absurd. Even Kraugel hadn't cleared it. Veradin was certain of this assessment, and Agnus—his mind clearing—had to agree.\n\n\"Kuk... kukuk... yes. Later. I'll go later.\" He turned toward Marie's chambers. \"I hope she has something fun for me this time.\"\n\n***\n\n\"Why not tell Grid about Agnus' past?\"\n\nFaker's question hung in the shadows. He believed Grid deserved to know about an enemy who would plague them for years to come. But Lauel had shared Agnus' history with every Overgeared leader *except* Grid.\n\nThe reason was simple.\n\n\"Grid isn't heartless.\"\n\nHe seemed selfish on the surface. But there were lines Grid wouldn't cross—damage he refused to inflict. At his core, the man was compassionate.\n\nIf he learned the truth about Agnus...\n\n\"He wouldn't use it as a weakness. He'd *sympathize.* It would disturb him when we needed him focused.\"\n\n\"...\"\n\nFaker disagreed silently. Grid's compassion had always seemed limited to his people. He'd never seen the man show mercy to an enemy.\n\nLauel smiled, bitter. \"Agnus' past overlaps with Grid's past. Too much. Grid would feel... kinship. And kinship leads to sympathy.\"\n\nThe weight was different, of course. What Agnus had endured dwarfed Grid's suffering. But pain wasn't a competition. Everyone's threshold was different.\n\n\"I just hope they don't cross paths.\"\n\nLauel stared out the window, voicing the wish aloud. Agnus was poison to Grid—he was certain of it. What had happened to Agnus was terrible, yes. But Lauel had no intention of excusing what he'd become because of it.\n\nFaker watched him from the darkness, considering. Then: \"Why does Veradin serve Agnus?\"\n\nVeradin had been famous since his rookie days—brilliant enough to form the \"Double Pillars\" alongside Lauel. People still ranked him among the best strategic minds in Satisfy. Why would someone like that bow to Agnus?\n\nLauel's answer was chilling.\n\n\"Veradin isn't serving Agnus. He's *studying* him. Like an interesting experiment.\"\n\n\"...Experiment?\"\n\n\"Veradin is a psychologist.\"\n\n\"...\"\n\nIn the end, Agnus was still completely alone.\n\nLauel thought it was the saddest thing in the world.\n\n***\n\n[You have entered the 60th island.]\n\nGrid materialized at the last save point before the 61st island. Beside him stood the elf Sticks—beautiful despite being male.\n\n\"A thought just occurred to me.\" Grid frowned. \"Will Muller's death knight be the guardian of the 66th island?\"\n\nThe legend even Braham acknowledged as the strongest. If Grid had to face *that*... the Behen Archipelago might be impossible to clear.\n\nSticks shook his head. \"Pagma couldn't make Muller a death knight, even with Baal's contract. Muller possessed a noble soul.\"\n\n\"...Truly the greatest, with no rivals.\"\n\nDid that mean Muller had transcended death itself? Before Grid could dwell on it—\n\n\"Sticks! Sticks! STICKS!!\"\n\nThe little fairy Bini burst onto the scene, wings buzzing frantically. He normally guided challengers when Sticks was absent. What had him so worked up?\n\n\"Pant... pant...\"\n\nBini seemed desperate to speak, but flying in such a panic had exhausted him. He gasped for breath.\n\n*This is why exercise is important.*\n\nGrid mentally added two hundred push-ups to his workout routine tonight. Maybe an extra hundred squats too.\n\n\"The 61st island...!\" Bini finally managed. \"Someone... cleared the 61st island!\"\n\n\"What?\"\n\nBoth Grid and Sticks straightened in shock. Death Knight Lantier—the monster whose speed and stealth reached inhuman extremes—had been defeated?\n\n*Who?*\n\nGrid had secured the first legendary class. He'd been growing constantly. And yet someone had beaten him to this milestone. The impact hit him like a physical blow. Despite his legendary class, his mediocre talent kept pulling him back down.\n\nAs Grid wrestled with frustration, Bini dropped a name he never expected.\n\n\"Agnus! He said his name was Agnus! He was completely insane!\"\n\n\"Agnus?\"\n\nThe man who'd nearly defeated him in front of the entire world during the National Competition. Standing in his path again.\n\nGrid's blood ran hot. His eyes burned with the same intensity they'd held facing Kraugel.\n\n\"...\"\n\nNormally when Grid got fired up, he lost his composure—just like anyone else. But—\n\n\"What about the 62nd island? Did he clear that too?\"\n\n—Grid was not ordinary. When he thought about someone he recognized as a true competitor, the passion sharpened his mind rather than clouding it.\n\n\"He didn't capture the 62nd island. Died after a few gunshots.\"\n\n\"Gun?\" Grid's mind raced. \"The 62nd island is guarded by the former Demon Slayer?\"\n\nWhich meant he'd have to fight without Blackening. The penalty would be severe.\n\n*I need to reach the 66th island. I have to break through the 62nd without Blackening.*\n\nAgnus had cleared the 61st island before even reaching the legendary class threshold. Grid had started touching the realm beyond legend itself. He couldn't—*wouldn't*—fall behind Agnus.\n\n\"I'm going to the 62nd island.\"\n\nGrid attached the Enlightenment Blade to Sword Ghost as he spoke.\n\n\"Good luck.\"\n\nSticks smiled gently.\n\nBini turned pale. \"H-how can you challenge the 62nd island when the crazy human already failed?! You didn't even beat the 61st island!\"\n\n\"That was a long time ago.\"\n\n*Crack!*\n\nGrid stepped through the gate that materialized before him. His form vanished.\n\nBini flailed helplessly. \"S-Sticks! Say something! He's going to die again!\"\n\n\"No.\"\n\n\"...?\"\n\n\"He'll purify the Behen Archipelago.\" Sticks pulled out a crystal ball, his eyes distant. \"And earn the title of Hero King.\"\n\nThe crystal's surface shimmered. Bini's eyes widened at what he saw within.\n\n*BOOM!*\n\nBlack flames erupted toward Death Knight Alex!"
}