{
  "id": 68,
  "title": "Chapter 68",
  "content": "# Chapter 68\n\nGrid stared at the <span class=\"rarity-unique\">Hooded Zip Up</span> in his hands, a grin spreading across his face.\n\n*I can use this to sneak past every monster in Kesan Canyon. Then I'll sell these things for a fortune and clear my debt in weeks.*\n\nThe satisfaction was intoxicating. *Am I actually a genius? This is practically cheating!*\n\nHe turned to Khan, confidence radiating from every pore. \"Where do the sylphids live? Do I need to hunt them for the scales?\"\n\nKhan's hammer paused mid-swing. The old blacksmith blinked, then his face split into a wide grin. He doubled over, wheezing with laughter. \"What? Hunt sylphids? Hahaha! Boy, unless you're an elementalist, you can't even *see* sylphids with human eyes. But hunting them? Oh, that's rich!\"\n\nGrid's face went from pale to crimson in seconds. \"What?\"\n\nA bolt of ice shot through his gut. He lunged forward, grabbing Khan's apron. \"Why didn't you tell me sooner? Where the hell can I get sylphid scales then?\"\n\nThe familiar panic clawed at his throat. *This can't be like Failure. Not again.*\n\nKhan raised his hands, startled by the intensity. \"Easy! Easy, boy. You can't hunt sylphids directly, but there's another way. Frostlight orcs. Hunt them, and you'll find the scales.\"\n\n\"Frostlight orcs?\" Grid's grip loosened. \"What are those? Why would orcs have sylphid scales?\"\n\nKhan dusted off his apron and settled onto his stool. \"They're monsters living in the far north. Blue-skinned instead of green. About fifty percent bigger than regular orcs, and considerably smarter. Immune to cold, weak to fire.\"\n\n\"That still doesn't explain the scales.\"\n\n\"The frostlight orcs possess a sixth sense that lets them detect and hunt sylphids. They collect the scales like treasure. So if you kill enough frostlight orcs, you'll get your scales.\"\n\nGrid's face brightened immediately. \"Orcs? That's easy! I'll farm them until I have a mountain of scales!\"\n\nThis was different. He could actually obtain the materials. Relief flooded through him.\n\nKhan's expression turned serious. \"Grid, listen to me. These aren't common orcs. They're dangerous. If you don't exploit their fire weakness properly, you won't even scratch them.\"\n\nGrid snorted. *Orcs are fodder.*\n\nEveryone knew the three easiest monster types in Satisfy: orcs, goblins, and kobolds. Level ten to forty trash mobs. Khan's warning rolled off him like water off waxed leather.\n\n*I just need cold-weather gear.*\n\nGrid equipped the hammer he'd forged the previous day.\n\n> [<span class=\"rarity-epic\">Unknown Blacksmith's Hammer</span>]\n>\n> Rating: Epic\n>\n> Durability: 350/350 | Attack Power: 70~80\n>\n> **Odds of Making a Rare Rated Item:** +17%\n>\n> **Odds of Making an Epic Rated Item:** +7%\n>\n> *A blacksmith's hammer made by a craftsman with great skills and potential, but his experience and reputation is somewhat lacking.*\n>\n> *This is a hammer produced by the craftsman himself, so it isn't suitable for other blacksmiths to use.*\n>\n> **Conditions of Use:** Pagma's Descendant\n>\n> Weight: 80\n\nConfidence surged through him. *With this, I can't possibly make anything below Rare rating. I'll probably churn out Epics left and right.*\n\n\"How do I make armor with good cold resistance?\"\n\nKhan scratched his beard. \"Giant brown bear leather would do the trick.\"\n\nGrid spent the rest of the day and night hunched over his workbench. Twenty hours bled together in a haze of cutting, stitching, and treating leather. When dawn broke, he finally held up the finished product.\n\n> [Warm Giant Brown Bear Leather Armor]\n>\n> Rating: Normal\n>\n> Durability: 200/200 | Defense: 143\n>\n> **Cold resistance** will increase by **15%**.\n>\n> *A giant brown bear leather armor made by a craftsman with great skills and potential, but his experience and reputation is somewhat lacking.*\n>\n> *The wearer will be able to feel warm even in winter. It has enough defense to protect the wearer from sharp weapons. However, it is vulnerable to blunt instruments.*\n>\n> **User Restriction:** Level 130 or higher. Intermediate Leather Armor Mastery.\n>\n> Weight: 300\n\nGrid stared at the screen. His eye twitched.\n\n\"Normal? NORMAL?\" He slammed the armor onto the bench. \"This is insane! This is bullshit!\"\n\nTwenty hours of work. Premium quality bear leather. An epic-rated hammer that boosted his odds. And he *still* produced garbage.\n\n\"It's rigged. Those bastards at S.A. Group rigged the system!\" His voice rose with each word. \"I'm the only legendary blacksmith among two billion users! Why am I making trash?\"\n\nThe injustice of it burned in his chest. He wanted to log out immediately, march to S.A. Group's headquarters, and scream at the president until his voice gave out.\n\n\"...If I actually had the balls to do that, I would've done it years ago.\"\n\nGrid's shoulders slumped. This wasn't new. Every time he crafted something, hope bloomed in his chest. Every time, it died when he saw the 'Normal' rating. He'd grown numb to the disappointment.\n\nHe took a breath and got back to work. Gloves, boots, a cloak, and a hat. The accessories required less intricate work than full armor, so they went faster.\n\n> [Warm Giant Brown Bear Leather Hat]\n>\n> Rating: Normal\n>\n> Durability: 65/65 | Defense: 19\n>\n> **Cold resistance** will increase by **5%**.\n>\n> *A giant brown bear leather hat made by a craftsman with great skills and potential, but his experience and reputation is somewhat lacking.*\n>\n> *The wearer will be warm even in the dead of winter. Don't expect a defense effect.*\n>\n> **Conditions of Use:** Level 130 or more.\n>\n> Weight: 50\n\n> [Warm Giant Brown Bear Leather Cloak]\n>\n> Rating: Normal\n>\n> Durability: 78/78 | Defense: 22\n>\n> **Cold resistance** will increase by **5%**.\n>\n> *A giant brown bear leather cloak made by a craftsman with great skills and potential, but his experience and reputation is somewhat lacking.*\n>\n> *The wearer can feel warmth even in the dead of winter, and it is effective enough to stop a chill from going down the wearer's spine. The leather is thick and stiff.*\n>\n> **User Restriction:** Level 130 or higher.\n>\n> Weight: 100\n\n> [<span class=\"rarity-rare\">Warm and Functional Giant Brown Bear Leather Gloves</span>]\n>\n> Rating: Rare\n>\n> Durability: 110/110 | Defense: 50\n>\n> **Cold resistance** will increase by **15%**.\n>\n> *Giant brown bear leather gloves made by a craftsman with great skills and potential, but his experience and reputation is somewhat lacking.*\n>\n> *It has an excellent effect in cold weather, to the extent that the wearer can feel their fingers.*\n>\n> *Even though the gloves are made of thick leather, it feels very comfortable when gripping things.*\n>\n> **User Restriction:** Level 130 or higher.\n>\n> Weight: 50\n\n> [<span class=\"rarity-epic\">Great Giant Brown Bear Boots</span>]\n>\n> Rating: Epic\n>\n> Durability: 160/160 | Defense: 95 | **Movement Speed:** +2%\n>\n> **Cold resistance** will increase by **20%**.\n>\n> *Giant brown bear leather boots made by a craftsman with great skills and potential, but his experience and reputation is somewhat lacking.*\n>\n> *It has an excellent effect in cold weather, to the extent that the wearer can feel their feet.*\n>\n> *Even though the boots are made of thick leather, it feels so comfortable that there is no awkwardness when walking. It doesn't slip easily on ice.*\n>\n> **User Restriction:** Level 130 or higher.\n>\n> Weight: 80\n\nTwo Normal items, one Rare, one Epic. Grid exhaled slowly. \"The performance isn't terrible. Might as well equip them.\"\n\n> [Due to your class characteristics, you have equipped the Warm Giant Brown Bear Leather Armor.]\n>\n> [This is an item you created. Your understanding is 100%.]\n>\n> [In the case of items made by you, a penalty will be applied if you don't meet the item usage requirements, even if you have full understanding.]\n>\n> [The defense of Warm Giant Brown Bear Leather Armor has been reduced by 5%. Only half of the option effects will be applied.]\n\nThe system notifications continued as he donned the hat and cloak. Same penalties. Five percent defense reduction, halved option effects.\n\n*Just like the Ideal Dagger. Normal items get a five percent penalty. The Unique-rated dagger had a twenty percent penalty. So what about Rare and Epic?*\n\nHe pulled on the gloves.\n\n> [Due to your class characteristics, you have equipped the <span class=\"rarity-rare\">Warm and Functional Giant Brown Bear Leather Gloves</span>.]\n>\n> [This is an item you created. Your understanding is 100%.]\n>\n> [In the case of items made by you, a penalty will be applied if you don't meet the item usage requirements, even if you have full understanding.]\n>\n> [The defense of Warm and Functional Giant Brown Bear Leather Gloves has been reduced by 10%. Only half of the option effects will be applied.]\n\nThen the boots.\n\n> [Due to your class characteristics, you have equipped the <span class=\"rarity-epic\">Great Giant Brown Bear Boots</span>.]\n>\n> [This is an item you created. Your understanding is 100%.]\n>\n> [In the case of items made by you, a penalty will be applied if you don't meet the item usage requirements, even if you have full understanding.]\n>\n> [The defense of Great Giant Brown Bear Boots has been reduced by 15%. Only half of the option effects will be applied.]\n\n\"So Rare is ten percent, Epic is fifteen...\"\n\nA new notification appeared.\n\n> [You have equipped the 'Giant Brown Bear Leather Set,' giving a bonus of **60 defense** and **30% cold resistance**.]\n\nGrid froze. \"Wait. Khan, are these set items?\"\n\nKhan chuckled from his workbench. \"When I make them, they're just separate pieces. When you make them, they become a set. Must be because you designed the balance perfectly.\"\n\nGrid shook his head. \"I just followed the production method.\"\n\nBut the truth was undeniable. This was the power of Pagma's Descendant manifesting itself. Set items sold for far more than individual pieces. His mouth curved into a smile.\n\n\"Another income stream. Perfect.\" He headed for the door, his body now wrapped in reddish-brown fur. \"Time to go north.\"\n\nAt that moment, Grid remained blissfully ignorant. The frostlight orcs were far more dangerous than he imagined. And the drop rate for sylphid scales? Approximately one percent.\n\n---\n\n**Glossary of Common Korean Terms**\n\nOG: Glossary Link\n\nCurrent schedule: 20 chapters a week\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}