{
  "id": 685,
  "title": "Chapter 685",
  "content": "Grid struck again. Same result.\n\n>[Gis is mining. Gis is invincible when mining. You can't cause any damage.]\n\nHe gritted his teeth. \"This is ridiculous.\"\n\nThe problem wasn't just the 64th island—it was the entire damned Behen Archipelago. Sixty-six islands, each requiring some elaborate puzzle or gimmick to clear. His patience had worn thinner with every step.\n\n\"Some weren't so bad...\" he muttered, though even he knew that was generous.\n\nAny ordinary player would have laughed in his face. The Behen Archipelago devoured adventurers whole. But Grid wasn't ordinary. His ability to craft solutions in real time—literally forge his way through problems—gave him advantages others couldn't dream of. Hell Moon? Cleared it with his Hooded Zip Up. Still, even he had to admit the overall difficulty was absurd.\n\n\"What the hell do I do now?\"\n\nGis was invincible while mining. Judging by the mineral deposits and his glacial pace, it would take the bastard over a month to clear this cave. Grid had four days of food left. Four days before he starved to death on this gods-forsaken rock.\n\n\"Shit.\"\n\nThe word tasted bitter. He hadn't cursed with this much venom in ages.\n\n\"Aren't I supposed to be versatile?\"\n\nHe was, wasn't he? Pagma's Descendant granted him weapon mastery across the board. He could smith. He could tailor. He could even sling spells. But cooking? That particular life skill had eluded him entirely. Which meant unless he solved this puzzle, he'd die of starvation. Simple as that.\n\n\"Some all-rounder I am...\"\n\nOne missing skill, and it would cost him everything.\n\n*Flop.*\n\nGrid collapsed to his knees, face twisted in frustration. Then his eyes sharpened. An idea—stupid, probably impossible, but an idea nonetheless.\n\n*Worth a shot.*\n\n*Ttang—ttang—*\n\nHe crept toward Gis, who continued his methodical mining, oblivious to Grid's inner turmoil. A wicked smile crept across Grid's face as he studied the skeleton's exposed spine.\n\n*Theoretically, this should work.*\n\nHis fingers twitched, ten digits limbering up. Time to put his absurd dexterity to use.\n\n*Over 4,000 dexterity.*\n\nHe'd seen what a single poke could do. Men and women alike buckled when he applied even a fraction of that stat. Some couldn't handle the sensation—overwhelming, electric. He'd kept this particular application sealed away, reserved for private moments with Irene. But desperate times...\n\n\"I'll make you stop mining if it's the last thing I do!\"\n\nGrid's fingers danced across Gis' ribs, exploiting every gap between bone with surgical precision.\n\nThe result?\n\n\"...\"\n\n*Ttang! Ttang!*\n\nNothing. Absolutely nothing. Gis continued his work without so much as a pause. Over 4,000 dexterity, worthless against a target that couldn't feel pleasure or pain.\n\n\"...Figures.\"\n\nOf course the undead wouldn't be ticklish. What a stupid plan.\n\n*Then there's only one option left.*\n\nBut Grid didn't despair. Years of failure had taught him how to pivot, how to adapt. His eyes blazed with renewed determination as he formulated a new approach.\n\n***\n\n\"Come on, Grid. Use that brain.\"\n\nOn the 63rd island, Sticks hunched over his crystal ball, anxiety etched into every line of his aged face.\n\n\"Invincible while mining...\"\n\nGis, the legendary miner. More than one great demon had been stymied by his unique defense mechanism. The death knight's abilities were genuinely formidable. But Grid couldn't afford to give up. The entire Behen Archipelago depended on him pushing through.\n\n*There's no such thing as true invincibility. Calm down and find the weakness.*\n\nEasier said than done. Pagma had been clever—whatever vulnerability Gis possessed, it was buried deep. Sticks himself hadn't spotted it yet, and he'd been studying this problem for hours.\n\n*The key is stopping the mining.*\n\nNo matter what Grid attempted, Gis simply ignored him and kept working. Making him stop seemed virtually impossible.\n\n*This is bad.*\n\nThe odds of clearing the 64th island were dropping by the minute. Sticks bit his lip hard enough to taste copper.\n\n*Ttang! Ttang! Ttang!*\n\nThen Grid pulled out his portable furnace and set to work.\n\n\"What are you crafting?\" Sticks leaned closer to the crystal ball, brow furrowed. \"No item you make will force him to stop—\"\n\n\"...What?\"\n\nThe sage's composure shattered. His jaw actually dropped as Grid unveiled his creation: a pickaxe.\n\n\"You can't be serious...\"\n\nBut the pieces clicked into place immediately. Sticks hadn't achieved his position through luck.\n\n\"That insane, brute-force method...\"\n\nGrid had countered the legendary tailor with tailoring. Now he'd counter the legendary miner with... mining. The logic was absurd yet perfectly in character.\n\n*He's going to mine out the entire cave so Gis has nothing left to extract...*\n\nWhat a stupid, ignorant, gloriously moronic plan!\n\n\"Mining isn't something you just *do*...\"\n\nWithout the proper skill, mining speed plummeted. Even if Grid gave it everything he had, he'd barely match Gis' deliberately slow pace. The math didn't work.\n\n\"Wait...\"\n\nSticks froze. Grid wasn't making just one pickaxe. He was crafting several. And then—\n\nGrid summoned Noe and Randy, tossing them pickaxes. The four God Hands received their own tools. But Grid wasn't finished.\n\n\"Can you Become the King of the Dead?\"\n\nTwo additional skeletons materialized, oversized skulls giving them an almost endearing appearance despite the wild gleam in their eye sockets.\n\n*Clack!*\n\n*Clack clack!*\n\nThe skeletons rattled their jaws eagerly, each gripping a pickaxe in bony fingers.\n\n\"...The power of numbers...\"\n\nSticks could only shake his head. Was this how new legends were forged? He belonged to the Overgeared Kingdom—he should have seen this coming. The name itself was a warning.\n\n***\n\nGis was invincible while mining. Grid had four days before starvation claimed him. After the dexterity debacle, he'd wracked his brain until a solution emerged—brutal, stupid, and just crazy enough to work.\n\n\"Strip the cave clean. No minerals, no mining, no invincibility.\"\n\nA supremely ignorant plan! Peak Sword with his Intermediate Mining Technique would need two weeks to clear this cave. Grid had to do it in four days. Impossible. He hadn't even learned the mining skill yet—it was too far outside his class specialization. Who knew how long it had taken Peak Sword, a swordsman, to acquire it?\n\nStill.\n\n\"I can do this.\"\n\nGrid's confidence in this near-zero-percent-chance plan burned absolute. He had reason for that confidence.\n\n\"I know how to make the Fantastic Pickaxe!\"\n\nThe legendary-rated mining tool he'd crafted for Peak Sword. It boosted high-grade mineral acquisition and granted Intermediate Mining Technique Lv. 3. Put that pickaxe in a five-year-old's hands, and they'd mine like a master!\n\n\"Mass production it is.\"\n\nNo time to waste. He fired up his portable furnace and began smelting white phosphorus wood. Iron ore—every blacksmith's first material—followed, refined with practiced efficiency. Then:\n\n*Ttang! Ttang!*\n\nHe hammered out pickaxes on his anvil. Eight total. Completion time? Two hours. His speed had improved dramatically since the crafting duel with Kruger, and pickaxes were fundamentally simple tools for any competent smith. The results?\n\n>[**Mass Produced Fantastic Pickaxe**]\n>\n>Rating: Epic  \n>Durability: 125/125 | Attack Power: 37\n>\n>* +3% chance to acquire advanced minerals.\n>* Grants skill 'Beginner Mining Technique' at Master Level.\n>\n>*A pickaxe based on Blacksmith Grid's legendary Fantastic Pickaxe. While it doesn't match the original, it boasts excellent performance for its grade.*\n>\n>User Restriction: Level 100 or higher.  \n>Weight: 75\n\n>[**Mass Produced Fantastic Pickaxe**]\n>\n>Rating: Unique  \n>Durability: 150/150 | Attack Power: 77\n>\n>* +3% chance to acquire advanced minerals.\n>* +1% chance to acquire highest grade minerals.\n>* Grants skill 'Intermediate Mining Technique' Lv. 1.\n>\n>...\n\n\"Not bad.\"\n\nTwo rare-rated, four epic-rated, two unique-rated. Excellent performance across the board. Obviously inferior to the legendary original, but masterworks compared to standard pickaxes.\n\n\"Noe! Randy! God Hands! Can you Become the King of the Dead?\"\n\n*Pak!*\n\n*Pa pa pa pat!*\n\nGrid's summons appeared in rapid succession—he might as well have been a summoner. A black cat, a little girl, four golden hands, and two skeletons crowded the chamber. The God Hands maintained their usual vigil, but Noe, Randy, and the Overgeared Skeletons practically vibrated with excitement at seeing Grid after so long. He distributed pickaxes like party favors.\n\n\"Let's get to work.\"\n\n\"...\"\n\nNoe's ears drooped. Déjà vu hit him like a hammer—memories of the evil eyes' mine flooding back. He was the greatest demonic beast of Hell, and Grid kept making him mine like some common laborer. Heartbreaking. But what could he do? He loved Grid too much to refuse.\n\n\"Nyang...\"\n\n*Ttang! Ttang!*\n\nLed by the tearful Noe, the workforce struck stone. Randy in particular excelled once he transformed into Grid's likeness, his performance dazzling. Grid watched with satisfaction before turning to roar at Gis.\n\n\"Let's see how long your invincibility lasts!\"\n\nFour days. He'd strip this cave bare in four days if it killed him—which it might, but not from starvation!\n\n*Peeok! Peeok!*\n\n*Ttang! Ttang!*\n\nDust exploded with each strike, coating Grid, Noe, and Randy in a layer of grime. Their faces darkened within minutes.\n\nGrid—legendary blacksmith, great magician, master swordsman, king of a nation. Noe—Memphis, mightiest demonic beast in all the Hells. Randy—the unrivaled doppelganger who ruled the Mysterious Forest. Three beings of incomparable power and prestige, reduced to filthy miners in a forgotten cave. So absurd that witnesses would doubt their own eyes. The world imagined Grid living in glory, draped in luxury and achievement.\n\nThe reality?\n\n\"*Cough!* Ugh! Hey! Slave! Watch where you're swinging that thing!\"\n\n\"Nyang... Understood, ong. Wait... did you just call me slave, ong?\"\n\n\"O-Of course not! What kind of master would I be? Hahaha...\"\n\n\"...\"\n\nGrid's daily life was anything but glamorous. More often than not, it was pathetic and miserable. \n\nNoe and Randy had chosen the wrong master."
}