{
  "id": 687,
  "title": "Chapter 687",
  "content": "'An apple mark?'\n\nJudging from what happened to Noe and Randy, the glowing apple icon meant Povia had locked onto him. Grid's plan to close the distance with **Freely Move** crumbled.\n\n\"What kind of archer can mark targets from this far away?\" He grimaced. \"This completely breaks the game's balance! **Magic Detection!**\"\n\n*Pahat!*\n\nGrid urgently activated **Magic Detection (Enhanced)**. He'd been training the spell daily, and it had reached level three. Braham's voice echoed in his mind.\n\n*—An archer's range far exceeds an assassin's. Especially a legendary archer.*\n\nGrid already knew this—he'd fought alongside Jishuka enough times. As expected, **Magic Detection** failed to locate Povia.\n\n\"Your magic is worthless when I actually need it.\"\n\n*—That's because you're incompetent.*\n\nBraham maintained that two more skill levels would've revealed the Death Knight's position immediately.\n\n*—I keep telling you to train your magic. Stop wasting time on frivolous underwear.*\n\nGrid had been focused on tailoring instead of magical studies lately. While Braham sighed in exasperation, a volley of arrows rained from the canopy—eleven in total. Grid's response was remarkably composed.\n\n\"**God Hands!**\"\n\nHe commanded the floating hands to block the rightward arrows while he dodged left. A solid tactic. Against untargeted attacks, this split defense would work. But Povia's arrows were locked on—and Satisfy's system made locked attacks impossible to evade.\n\n*Jjang!*\n\n*Puk! Puuok!*\n\nThe shield deflected a few arrows. The rest punched into Grid's armor.\n\n\"Kuk...!\"\n\nSix hits. Over forty thousand health gone.\n\n'That damage... she's ignoring my defense stat?'\n\n*Tong!*\n\n*Teteteteng!*\n\nFive more arrows streaked down. Grid blocked with the **God Hands** and his shield, then examined the fletching. Jaffa arrows.\n\n\"Tsk. No wonder they hurt like hell.\"\n\nHe gulped a health potion—one of Reidan's finest alchemical brews. His health bar filled instantly.\n\n*—You're surprisingly calm.*\n\nThe forest was a nightmare of poor visibility. Dense foliage blocked the sun, and the cacophony of birds drowned out subtle sounds. Grid was trapped in a one-sided engagement against an invisible enemy—the exact situation that caused most players to panic. Yet he remained focused.\n\n*—Do you have a plan?*\n\nBraham tried to sound indifferent. Grid smirked.\n\n\"Even a legendary archer can't shoot constantly. Right?\"\n\nThink realistically. An archer with unlimited range, massive damage, *and* auto-locking arrows? That was beyond broken—a power that shouldn't exist.\n\n'Povia's lock-on skill must have a cooldown.'\n\nShe might have spammed it while alive, but as a death knight, the cooldown was probably severe.\n\n'One apple each for Noe and Randy. Five marked arrows out of eleven for me. The next volley won't be targeted.'\n\nNon-targeted attacks were typically more powerful than targeted ones. Greater power meant longer cooldowns.\n\n'I can use **Revolve** to its full potential here. Then...'\n\nGrid recalled **Pagma's Swordsmanship, Revolve**—the technique that could deflect *any attack*. More importantly, it returned attacks to their point of origin. He could exploit that.\n\n'If I follow the reflected attack... I'll find Povia.'\n\nA counterattack skill doubled as a tracking mechanism. Real-time tactical thinking. The type of adaptability he'd been developing through countless battles. Grid felt a flash of pride, though he kept it in check.\n\n'Kraugel would've realized this the moment he learned **Revolve**.'\n\nEvery step forward only highlighted Kraugel's brilliance. Ironic. The closer Grid climbed, the more distant the peak seemed.\n\n'...But recognizing greatness means I'm growing too, doesn't it?'\n\n*Clink!*\n\nKraugel was probably facing his own deadly trial somewhere. Grid smiled at the thought and raised the **Enlightenment Sword**.\n\n*Kuwaaaaaang!*\n\nA single arrow plummeted from the sky like a meteorite. Only one—but the impact shook the forest floor. A direct hit would be devastating, possibly fatal. Grid wasn't worried. He'd already formed the perfect counter. He just needed the timing.\n\n\"**Revolve**.\"\n\n*Kuwaaaaaang!*\n\nThe forest *tilted*. The meteor arrow spiraled into Grid's vortex of sword energy, distorting the air around him. He waited—one heartbeat, two—then launched himself skyward.\n\n\"**Fly!**\"\n\n**Braham's Boots** carried him through the canopy, chasing the meteor arrow as it rocketed back toward its origin point.\n\n'Alarm. Attach to **Magic Missile**. Deploy three seconds ahead of my arrival.'\n\n*Yiing—*\n\nSpheres of light materialized around Grid as he weaved between tree trunks.\n\n\"There!\"\n\nHe dropped from the canopy onto a cliff ledge. Death Knight Povia stood between two rock faces, bow drawn.\n\n*Peeeeeong!*\n\nThe meteor arrow struck first. **Magic Missiles** followed a split-second later. Grid didn't stop.\n\n\"**Pagma's Swordsmanship!**\"\n\nPovia sidestepped with legendary precision, evading both the meteor and the magic. But Grid had predicted the dodge—he fired **Link** directly into her escape path.\n\n*Pit!*\n\n*Pipipipipit!*\n\nDozens of energy blades erupted. Red lightning screamed down from above. Black flames detonated across the cliff face.\n\n*Kurururung!*\n\n*Kwa kwa kwa kwang!*\n\nThe cliffside shattered under the onslaught. Povia staggered through the collapsing stone, firing arrows with the inhuman speed of a legendary archer.\n\n\"**Quick Movements! Blacksmith's Rage! Freely Move!**\"\n\nGrid's concentration crystallized. To clear the Behen Archipelago, he needed absolute focus. No—not quite absolute. That came when his back was truly against the wall, like against Kruger or Gis. But this was close.\n\n*Jjejeong!*\n\n*Jjeejeeeong!*\n\nHe charged through the arrow storm and closed with Povia. Basic attacks flowed into combos. The **Enlightenment Lightning Sword** roared.\n\n[You have dealt 18,900 damage to the target!]\n\n[You have dealt 20,730 damage to the target!]\n\n[You have dealt 22,500...]\n\n[The option effect 'Black Flames' has activated from the Lightning Sword Born from Enlightenment and Strong Desires...]\n\n*Kuwaaaaaang!*\n\nOverwhelming. **Pagma's Swordsmanship** chains flowed seamlessly, then **God's Command** triggered a cooldown reset. The barrage would shatter even the Undefeated King's iron defense.\n\n*—Is this sufficient?*\n\nBraham observed from within Grid's body.\n\n\"Incredible...!\"\n\nSticks watched through his crystal ball, gasping with each exchange.\n\n*Peng!*\n\n*Pepepepeong!*\n\nPovia fought like a caged beast. She twisted between strikes, firing at point-blank range. The high attack power nearly killed Grid twice.\n\n\"**Iyarugt!**\"\n\n*Paaaat!*\n\n**Doran's Ring** saved him from the first crisis. A health potion and **Tiramet's Belt** effect pulled him through the second. Just before his **First King** immortality would've activated, Grid summoned the blood sword. An elderly demonkin materialized beside Povia.\n\n\"**Sublime Sword**.\"\n\n*Chukakakakak!*\n\n\"*Kiyaaaaack!*\"\n\nDevastating. Both Braham and Sticks watched with newfound respect. Braham could no longer dismiss Grid as a mere novice.\n\n*—Excellent! This level of power could threaten a great demon!*\n\n\"Once you achieve Hero status, you'll be ready to face the Seven Malignant—\"\n\n> [You have defeated Death Knight Povia, guardian of the 65th island!]\n>\n> [The 65th island has been cleansed!]\n>\n> [As a reward for cleansing the island, you have gained one level!]\n>\n> [The Elf Bow Thimble (Made by Pagma) has been acquired.]\n>\n> [World Tree's Necklace has been acquired.]\n\n*Swaaaaah!*\n\nLight flooded the darkened forest, illuminating Grid's blood-streaked, sweat-soaked face.\n\n\"Hah... hah... Only one left.\"\n\nThe Behen Archipelago—challenged by the Overgeared members, Kraugel, Agnus, Damian, and Zibal. It was about to fall to the Overgeared King.\n\n***\n\n> **[Elf's Bow Thimble (Made by Pagma)]**\n>\n> Rating: Legendary\n>\n> Durability: 100/111\n>\n> * Bow attack speed +20% when worn (elves receive double the effect).\n>\n> * Allows normal attacks or skill attacks to switch to 'target mode.' (Three minute cooldown. Cooldown is halved for elves.)\n>\n> A thimble crafted for Death Knight Povia by Pagma, legendary blacksmith and Baal's Contractor.\n>\n> Designed to accommodate Povia's hybrid physiology—born between human and elf.\n>\n> Weight: 15\n\n> **[World Tree's Necklace]**\n>\n> Rating: Legendary\n>\n> Durability: 20/22\n>\n> * +20% strength and agility in elven territory.\n>\n> * +150% mana regeneration in elven territory.\n>\n> * 1.2x movement speed in elven territory.\n>\n> Before achieving legendary status, Povia was shunned by both humans and elves. The World Tree—her only companion—gifted her this necklace.\n>\n> Weight: 50\n\n'Can't complain about that.'\n\nEvery reward from the 60s islands had been exceptional. Astronomical value across the board. The Behen Archipelago was a treasure vault unto itself. Grid was grateful he'd arrived before anyone else.\n\nHe grinned—then Sticks' voice cut through his satisfaction.\n\n\"The Undefeated King Madra may still possess his intelligence. Be cautious.\"\n\n\"His intelligence?\" Grid glanced toward the 66th island. \"Death knights can retain intelligence?\"\n\n\"Yes. Those with exceptionally strong wills retain fragments of their memories, whether as death knights or liches. Those memories become their driving force.\"\n\n\"A strong will... What would the Undefeated King cling to after death? His title makes it sound like he died satisfied.\"\n\n*—He died miserably. Murdered by his own son.*\n\n\"...Damn.\"\n\n*—Kukuk. I was betrayed by a friend, but that's nothing compared to Madra.*\n\n\"...\"\n\nGrid thought the backstory belonged in a daytime soap opera, not a Korean video game."
}