{
  "id": 69,
  "title": "Chapter 69",
  "content": "# Chapter 69\n\nThe northern snowfields bit deep. A person without winter clothing would catch the flu within minutes and eventually freeze solid. But Grid's cold resistance sat at 60% after equipping the Giant Brown Bear Leather set.\n\n\"Hahaha! This is nothing!\"\n\nGrid stood in the heart of a raging blizzard like a man basking in front of an air conditioner during summer. The set effect was working overtime.\n\n\"There it is.\"\n\nAfter pushing through the storm, Grid spotted the frostlight orc village. He drew the Ideal Dagger.\n\n> **[Ideal Dagger]**\n> \n> <span class=\"rarity-unique\">Rating: Unique</span>\n> \n> **Durability:** 168/168 | **Attack Power:** 242~264\n> \n> **Attack Speed:** +11%\n> \n> * Rare chance of instant death effect\n> * **Agility +20**\n> * Generates skill 'Wind Blast'\n> * Generates skill 'Quick Movements'\n> \n> *A dagger created by a craftsman with great skill and potential, but lacking experience and reputation. Made in collaboration with the renowned blacksmith Khan.*\n> \n> *There is nothing special about the materials or method used, but the craftsman's skill and cooperation with Khan has created an ideal dagger.*\n> \n> **User Restriction:** Level 180+, 450+ Agility, Advanced Dagger Mastery\n\n> **[Wind Blast]**\n> \n> Shoots a blade-like wind forward. Deals 60% of current attack power.\n> \n> **Mana Cost:** 100 | **Cooldown:** 40 seconds\n\n> **[Quick Movements]**\n> \n> Increases evasion rate by 30% and doubles agility for 1 minute.\n> \n> **Mana Cost:** 80 | **Cooldown:** 100 seconds\n\nGrid tested the dagger's weight. *These orcs? This weapon is more than enough.*\n\nHe marched toward the village with unearned confidence.\n\n\"Come on, orcs! Hand over the sylphid scales! Otherwise, there's going to be a bloodbath!\" Grid screamed like some cartoon hero.\n\nThe orcs manning the watchtowers noticed him immediately.\n\n\"Kuwik, kuweek? *(What... who is that human in leather?)*\"\n\n\"Weukikukkikuok. Kururukuweeek. *(Maybe he's insane. He dares enter our village without fear.)*\"\n\n\"Ururukak! Kiukekik! *(No time for talk! Kill him quickly!)*\"\n\nTwo watchtowers flanked the village entrance. The sentries nocked arrows and drew without warning.\n\n*Swaeek!*\n\n\"Huh?\"\n\nGrid heard a sharp whistle from above. Small lights flashed. His blood ran cold when he realized they were arrows.\n\n\"Shit! Arrows? Quick Movements!\"\n\n> [Quick Movements has been activated. Your agility and evasion rate will increase significantly for 1 minute.]\n\n*Puuok!*\n\nGrid activated the skill on reflex and barely avoided the volley. Arrows thudded into the snow where he'd been standing, and his stomach turned.\n\n*Orcs using bows?*\n\nOrcs had intelligence. They had language and lived in villages. But they lacked dexterity. They only had three fingers, for god's sake. Everyone knew they couldn't handle delicate weapons like bows.\n\nYet the frostlight orcs were firing with precision.\n\n\"Ten meters away and they're hitting that close?\" Grid's mind raced back to Khan's warning.\n\n*'The frostlight orcs inhabit the snowy north. Blue skin instead of green. Higher intelligence. One and a half times the size of regular orcs. Extremely strong against cold, but fire is their weakness.'*\n\n*'Grid, stay alert. The frostlight orcs are nothing like common orcs. They're powerful. If you don't exploit their weakness properly, you won't even scratch them.'*\n\nAn ominous feeling settled in Grid's gut. *Should've listened to the old man. No, no. Even if they can use bows, orcs are still orcs. I'll be fine.*\n\nHe was still trying to convince himself when an orc descended from the watchtower.\n\n\"Kuk, kueeek! Kugura!? *(Hey, leather-covered human! Why are you here!?)*\"\n\nThe blue-skinned orc towered over two meters tall. Grid couldn't understand the language, but he grasped the intent.\n\n\"Shut up and give me the sylphid scales.\"\n\nIt was the scene of a man invading a peaceful village and threatening extortion. The orc snarled and drew its bowstring.\n\n\"Kuruk! Kueeeruruk! *(Insane! I'll kill you!)*\"\n\n*Syuk!*\n\nThe arrow cut through the snowstorm. The ability to fire quickly and accurately while ignoring wind resistance spoke to brutal arm strength and high archery proficiency. Grid dodged thanks to Quick Movements and immediately counterattacked.\n\n\"Wind Blast!\"\n\nA sharp blade of wind struck the frostlight orc.\n\n*Hwiririk!*\n\nThis skill had torn through armored NPC soldiers in one shot. It slammed into the orc's chest, and blue blood the same shade as its skin spurted out. But the cut was shallow. The frostlight orc's defense far exceeded those soldiers.\n\n*What kind of defense is this? How thick is that hide?*\n\nThe enraged orc bellowed at the stunned Grid.\n\n\"Kuruk... kuweeek! *(Bastard... that hurt!)*\"\n\nThe orc dropped its bow, yanked out a hand axe, and charged. The axe descended toward Grid's face. He raised the Ideal Dagger to block.\n\n*Kaaang!*\n\n\"Ugh!\"\n\nGrid's eyes watered. The impact numbed his entire arm. It felt like blocking Leo's blade, back when the Northern Nova had nearly killed him.\n\n*Strong!*\n\nGrid finally acknowledged reality. The frostlight orcs were powerful. It made sense.\n\nGrid didn't know, but the frostlight orcs were level 120. Their agility might lag, but their attack power and stamina surpassed their level bracket. The level 45 Grid should've been paste. It was normal for him to die in one blow.\n\nHowever, Grid's stats matched a mid-100s user thanks to Pagma's Descendant's superior base stats, the mountain of quests he'd completed, and the items he'd forged. He could face a frostlight orc head-on.\n\n\"Come on, orc!\"\n\n*Bbaek!*\n\nGrid kicked the orc in the stomach while his thoughts raced.\n\n*What do I do? Run? No, no! I can't go back empty-handed! Besides, I need those sylphid scales to enter Kesan Canyon!*\n\nFrustration clawed at him.\n\n*I'll give it a shot. If I use my skills properly...*\n\nNormally, a blacksmith had zero combat skills. But Grid was different. Since becoming Pagma's Descendant, he'd scraped through countless quests and armed himself with the Ideal Dagger. He actually had combat skills now.\n\n> **[Blacksmith's Rage]** Lv. 1\n> \n> Increases attack power by 10% and attack speed by 30% for 20 seconds.\n> \n> **Mana Cost:** 50 | **Cooldown:** 60 seconds\n\n> **[Unbreakable Justice]** Lv. 1\n> \n> Deals 300% of your attack power.\n> \n> **Mana Cost:** 350 | **Cooldown:** 100 seconds\n\n\"Blacksmith's Rage!\"\n\n> [Blacksmith's Rage has been activated. Your attack power and attack speed will increase significantly for 20 seconds.]\n\nStrength boiled through Grid's veins. He planted his feet and faced the frostlight orc.\n\n\"Wind Blast!\"\n\n\"Kuwek!\"\n\nThe 10% attack boost made Wind Blast bite deeper. Grid rushed through the gap while the orc recoiled and drove the Ideal Dagger into its thick neck. His experience as a warrior, grinding monsters for pennies, finally paid off.\n\n> [Critical hit!]\n> \n> [You have dealt 923 damage to the target.]\n> \n> [A bleeding effect is applied. The target will receive continuous damage.]\n\n\"Kuweeeeek!\"\n\nThe frostlight orc thrashed as blue blood gushed from its neck. The heat from flowing blood created steam that shrouded its eyes. Even blinded, the orc kept swinging its axe.\n\n> [You have suffered 807 damage.]\n> \n> [You have suffered 1,005 damage.]\n\n\"Gah! Damn! That hurts, you orc bastard!\"\n\nThe frostlight orc's attack power was vicious. Grid took massive damage even with his set's defense. But he gritted his teeth and fought back. He traded blow for blow. It became a dogfight between Grid and the orc to see who'd drop first.\n\n> [You have dealt 501 damage to the target.]\n> \n> [You have suffered 1,051 damage.]\n> \n> [You have dealt 607 damage to the target.]\n> \n> [You have suffered 988 damage.]\n> \n> [You have consumed an intermediate health potion. 1,500 health will be restored.]\n> \n> [You have dealt 700 damage to the target.]\n> \n> [You have suffered 890 damage.]\n\nWho would die first? Red and blue blood mixed on the snow. The heat created a fog, blue and red swirling together. Grid's situation turned critical first. His health plummeted and his potion was still on cooldown.\n\n*Shit!*\n\nGrid tried to buy time for the cooldown to reset. But the frostlight orc hunted him relentlessly.\n\n> [You have suffered 929 damage.]\n\n\"Kuk!\"\n\nGrid's health dropped below 10%.\n\n> [The Apostle of Justice's bravery is unmatched.]\n\nThe passive effect of his title triggered for the first time.\n\n> [The Apostle of Justice is in a crisis. You won't easily collapse before your enemies.]\n> \n> [All stats will increase by 30%.]\n\nGrid's face split into a savage grin.\n\n*Can't resent Huroi anymore. This title has an incredible feature!*\n\n*Kwajak!*\n\n> [You have dealt 1,100 damage to the target.]\n\n\"Kueeeek! Kuwek! Uweeek! *(Aaack! You became stronger suddenly!)*\"\n\nThe frostlight orc's screams changed pitch. The orcs watching from the watchtowers stared, their expressions twisting.\n\n\"Kuruk...ikku? Kururuk... *(What... that human? Strong...)*\"\n\n\"Iwukeek purukurururk! *(He became stronger all of a sudden!)*\"\n\n\"Kururukuk! Eiokku! *(We can't just watch! We'll help!)*\"\n\nThe orcs descended to assist their comrade. They stepped into the bloody mist and froze. Their companion was dissolving into grey light on the ground, while the human in bear skin turned toward them, drenched in blue blood.\n\n\"Ruurek? *(How is this possible?)*\"\n\nTheir eyes widened.\n\n\"Rekrekpukeoke! *(He's not even wounded!)*\"\n\nThe orcs had clearly seen the vicious brawl. The human should've been half-dead. Yet they couldn't spot a single injury on his body.\n\nWhy was Grid unharmed? He'd leveled up.\n\n> [You have defeated a frostlight orc.]\n> \n> [7,266,000 experience has been acquired.]\n> \n> [<span class=\"rarity-uncommon\">Frostlight Orc Leather</span> has been acquired.]\n> \n> [<span class=\"rarity-uncommon\">Crude Hand Axe</span> has been acquired.]\n> \n> [Your level has risen.]\n\nSatisfy's system restored health and mana upon leveling. Thanks to the level gain, all of Grid's wounds from the brutal struggle vanished. He peered through the bloody fog at the two newly arrived orcs and grinned.\n\n*This is great... free experience.*\n\nThe fight taught Grid that frostlight orcs were strong, but manageable opponents. If he used Unbreakable Justice, he might handle two at once.\n\n\"Ahahahat!\"\n\nGrid was riding high. One orc gave him an entire level. The experience was ridiculous. The frostlight orcs transformed from threats into prey.\n\n\"I'll grind a few more levels! Unbreakable Justice!\"\n\n*Kwaaaaang!*\n\nGrid fought two orcs simultaneously using Unbreakable Justice. Mid-fight, the Ideal Dagger's option triggered.\n\n> [Critical hit!]\n> \n> [The Ideal Dagger's option effect is activated, instantly killing the target.]\n\n\"Kuweeeeek!\"\n\nThanks to the wide-area skill and the dagger's rare instant-death proc, both orcs died.\n\n> [You have defeated a frostlight orc.]\n> \n> [8,266,000 experience has been acquired.]\n> \n> [<span class=\"rarity-uncommon\">Frostlight Orc Leather</span> has been acquired.]\n> \n> [Your level has risen.]\n> \n> [You have defeated a frostlight orc.]\n> \n> [10,266,000 experience has been acquired.]\n> \n> [Your level has risen.]\n\n\"Kuk...! Kukukuk! Kuahahaha!\"\n\nGrid laughed like a maniac. His hunting instincts awakened for the first time in forever.\n\n\"Today I'm wiping you all out! Stupid orcs!\"\n\nHe tasted the pleasure of grinding after a long drought. Grid forgot his original purpose of obtaining sylphid scales and charged into the village.\n\n***\n\nHuroi always visited Khan's smithy after finishing his hunts. Today was no different. After four days at the hunting grounds, he returned to the village and immediately stopped by the smithy.\n\n\"Where is the person I seek?\"\n\n\"Oh, Huroi.\" Khan looked up from his anvil.\n\nHuroi greeted Khan politely. \"Grid... have you seen him? Can you tell me his location?\"\n\n\"He left for the northern snowfields three days ago.\"\n\n\"Northern snowfields? Why would he go there?\"\n\n\"Hunting frostlight orcs.\"\n\n\"Frostlight orcs?\"\n\nMost users had never heard of frostlight orcs. But Huroi had encountered one during a past quest. Its strength had terrified him.\n\n\"Why is Grid after frostlight orcs?\"\n\n\"He needs materials.\"\n\n\"That idiot!\"\n\nHuroi had witnessed Grid overwhelm knights despite being a blacksmith. Even so, he couldn't shake his worry.\n\n*The frostlight orcs are organized. They'll be dangerous opponents, even for Grid.*\n\nHuroi equipped the longsword and shield he'd purchased from Khan's smithy recently. Normally, an orator couldn't use swords or shields. Huroi only gained the ability after obtaining his second class, Apostle of Justice's Partner.\n\n\"I'm going to help Grid!\"\n\n\"Oh, how reassuring! Travel safely.\"\n\nHuroi said farewell to Khan and stopped by the general store before heading to the frostlight orc village. He bought fifty firebombs from the shop. He remembered frostlight orcs were incredibly vulnerable to fire.\n\n\"I'm coming now!\"\n\nHuroi left for the northern snowfields. A few hours later, he arrived at the frostlight orc village.\n\n\"What?\"\n\nSomething felt wrong. There were no frostlight orcs. The village was silent as a tomb. Huroi worried it might be a trap and moved carefully. Then he heard an orc scream nearby.\n\n\"Grid!\"\n\nHe instinctively knew Grid was there and sprinted over. Then he saw it.\n\n\"Kuwek! Kuweeek!! Kirarurarak! *(This guy! This evil bastard! He's destroying our village!)*\"\n\n\"Kuruek! Kuweeeek! *(I'll resent him even after death!)*\"\n\nGrid was effortlessly slaughtering frostlight orcs.\n\n\"As expected... I worried for nothing.\"\n\nHuroi watched Grid pierce the thick leather with his dagger and wondered how to return the firebombs to the general store owner.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}