{
  "id": 690,
  "title": "Chapter 690",
  "content": "# Chapter 690\n\n**CRASH!**\n\nThe sound of steel meeting bone echoed across the plains like thunder.\n\nMadra's blade carved through the air, and the world itself seemed to recoil. This was the **100,000 Army Massacre Sword**—a technique whose name was no exaggeration. The skeletal warrior's swing didn't simply strike at Grid; it detonated across a hundred-meter radius. Energy blades materialized by the thousands, transforming the vast plains into a killing field.\n\n> [You have suffered 10,900 damage.]\n> [You have suffered 11,310 damage.]\n> [You have suffered 10,870 damage.]\n> [**Tiramet's Belt** has gained 0.12% experience!]\n> [You have suffered 11,100 damage...]\n\nThe notifications cascaded faster than Grid could process them. His health bar plummeted like a stone dropped into a well.\n\n> [The **First King** title effect is activated.]\n> [A great king puts his safety first. You have lost 70% of your maximum health, so a shield containing the health you lost within the last minute will be created. All terrain adaptability has increased by 100% while movement speed and defense has increased by 10%.]\n> [You have obtained a shield containing 61,722 health.]\n\nThe protective barrier materialized around him just as another wave of energy blades crashed down.\n\n> [You have suffered 9,870 damage.]\n> [You have suffered 10,200 damage.]\n> [You have suffered 9,930 damage...]\n> [**Tiramet's Belt** has gained 0.12% experience!]\n> [The shield is destroyed!]\n\nLess than a second. That's all it took for his salvation to shatter.\n\n\"**Freely Move!**\"\n\nInstinct took over where rational thought failed. Grid's body blurred forward, survival reflexes honed through countless battles firing without conscious command. The sword that should have bisected him cleaved empty air instead.\n\n*Whoosh—whoosh—whoosh—*\n\nMadra's assault suddenly met nothing but wind. The skeleton warrior's hollow eye sockets flickered with surprise as Grid materialized beside him, blade already in motion. Four strikes per second—Grid's sword became a whirlwind aimed at Madra's exposed neck.\n\n*Thunk. THUNK.*\n\n> [Critical!]\n> [You have dealt 7,600 damage to the target!]\n> [You have recovered 912 health thanks to **Elfin Stone's Ring**!]\n> [The experience of **Elfin Stone's Ring** has increased by 0.2%!]\n> [Critical!]\n> [You have dealt 7,540 damage to the target!]\n> [Critical!]\n> [You have dealt 7,660 damage to the target!]\n> [Critical!]\n> [You have dealt 7,590 damage to the target!]\n\n\"I can't even dodge...\" Madra's voice carried a note of genuine surprise. \"I truly have weakened.\"\n\n\"Weakened?\" Grid's throat went dry.\n\nThe word sent his mind racing back to the Second National Competition. Bubat wearing the Undefeated King's armor—defense so high that Grid's attacks had barely scratched it. And now, landing clean critical hits on the Undefeated King himself, Grid was dealing less than eight thousand damage per strike.\n\n*He's a monster who combines absolute defense with overwhelming offense. A superior version of... me.*\n\nThe realization hit Grid like ice water down his spine. Tension coiled through his muscles as he watched Madra's bony fingers flex around the sword hilt.\n\n\"It isn't easy to wield a blade with only bones and no flesh,\" Madra said, his tone almost conversational. \"In this deteriorated form, I can only use the **100,000 Army Massacre Sword**.\"\n\nGrid's eyes widened. \n\n*A hint!* \n\nThe S.A. Group designed their bosses with weaknesses—they had to, unless you were fighting something like a dragon that was never meant to be defeated. The developers buried clues in boss behavior, breadcrumbs for players clever enough to spot them.\n\nAnd Madra had been dropping breadcrumbs from the start.\n\nGrid's gaze locked onto the skeleton's right hand, and there—a hairline fracture running through the bone. Madra had mentioned his weakness repeatedly: the undead body, the difficulty wielding his sword, how much he'd deteriorated.\n\n*He's the type of boss that self-destructs through combat!*\n\nGrid had faced enemies like this before. Overwhelming power offset by terrible sustainability. Every swing of that monstrous blade was eating away at Madra's structural integrity. If Grid could endure long enough, the skeleton would literally fall apart.\n\nBut he'd already burned through **First King** and **Freely Move**. His two best survival tools, gone.\n\nCould he really outlast a legend?\n\n\"We'll find out! **God Hands!**\"\n\n*CLANG!*\n\nThe four golden constructs orbiting Grid suddenly dove like falcons, each wielding a Mjolnir and attacking from different vectors. But Madra was no ordinary opponent—he was war incarnate, a warrior who'd built his legacy fighting outnumbered and surrounded. \n\n\"**One Million Army Breakthrough**.\"\n\nMadra's skeletal form spun like a dervish, flowing through the God Hands' assault pattern as if reading a familiar book. In a heartbeat, he'd closed the distance to Grid.\n\nGrid's breath caught.\n\n\"**200,000 Army Crushing Sword**.\"\n\n*WHOOOOM!*\n\nThe sword descended, and with it came devastation. A crescent moon of purple aura exploded outward, the very earth buckling and heaving from the shock wave. Grid's footing dissolved into trembling chaos as the energy blade screamed toward his torso—a strike meant to separate his upper body from his legs.\n\nBut Grid was already moving, already three steps ahead.\n\n\"**Pagma's Swordsmanship: Revolve!**\"\n\nHis blade traced a perfect circle, creating a vortex that *swallowed* the incoming attack. For a single frozen moment, Madra's annihilating power spiraled into Grid's counter—and then erupted back at its source.\n\n*BOOM!*\n\n> [You have dealt 2,118,000 damage to the target.]\n\nGrid's grin was slightly manic as the notification appeared.\n\n*Two million. Two MILLION damage.*\n\nThe same skeleton whose defense shrugged off Grid's seven-thousand-damage criticals had just taken two million in reflected power. The message was crystal clear: if Madra's **200,000 Army Crushing Sword** landed even once, Grid's immortality would mean nothing. He'd simply die.\n\n\"Pagma's Descendant,\" Madra said, finally placing Grid's identity. \n\nThe skeleton casually switched his sword to his left hand—his right clearly too damaged now to trust.\n\n\"How interesting. Pagma created this place, and now his successor comes to cleanse it.\"\n\n\"...\" \n\nGrid blinked at Madra's almost friendly tone. \n\n\"You figured out I'm Pagma's Descendant. The Pagma who transformed you into a death knight was my... teacher, essentially.\" Grid's eyes narrowed. \"You don't have anything to say about that?\"\n\n\"What should I say?\"\n\n\"Pagma imprisoned you here for over a century.\"\n\n\"Hrmm...?\" The skeleton's jaw moved in what might've been a chuckle. \"I see. You think I'd hold a grudge against Pagma and transfer it to you?\"\n\n\"...\"\n\n*Exactly that*, Grid thought. \n\nHe'd always viewed the legends guarding Behen Archipelago as victims—unable to rest peacefully in death, instead forced to resurrect and fight in isolation for over a hundred years. Strictly speaking, he pitied them.\n\nMadra's skull tilted as if he'd read Grid's thoughts in his expression.\n\n\"The only truly pitiful one here is that hybrid vampire parasitizing your body. *He's* the tragic figure—betrayed by Pagma, now reduced to leeching off Pagma's Descendant. After centuries of cold isolation, he finally developed human emotions, and now he hungers for affection like a starving—\"\n\n—*You bastard!*\n\nBraham's voice exploded through Grid's consciousness, fury incandescent. The magician had been quietly uncomfortable since they'd arrived on the sixty-sixth island, ever since Madra first called him a hybrid vampire. But this mockery was the final straw.\n\n'Please, just stop!' Grid mentally grabbed hold of Braham before he could seize control. 'Don't troll right now!'\n\nDuring the fight with Agnus, Braham's takeover had nearly cost them everything. Grid refused to let it happen again. Relying on others during critical battles—even Braham—always ended in disaster.\n\n'I'll put him in his place myself,' Grid promised. 'So trust me and watch.'\n\n—*Grid...*\n\nThe simple words seemed to strike Braham like a physical blow. No one in his centuries of existence had ever told the legendary great magician to *depend on them*. The unfamiliar sensation rippled through Braham's soul, something warm and uncomfortable and precious.\n\nHe didn't show it, of course.\n\n—*Bah! Don't get cocky! Remember—the current Madra is WEAK! If you lose to this pile of bones, I'll never let you hear the end of it!*\n\n'Right... weak...'\n\nWeak compared to his living prime, maybe. But Grid had never faced the Madra of legend. The skeleton before him *now* was the strongest enemy Grid had ever encountered. There was zero room for arrogance.\n\n\"**Quick Movements. Blacksmith's Rage.**\"\n\nGrid drew his **Ideal Dagger** and activated the buff skills in rapid succession. He targeted Madra's right side—the weakness, the cracked hand that couldn't fully defend. With **Slaughterer's Mask** and **Slaughterer's Eye Patch** enhancing his vision, **Vital Spot Detection** painted the vulnerable point in glowing red.\n\n\"**Pagma's Swordsmanship: Link!**\"\n\n*Shing!*\n\nTwenty energy blades per second—not as spectacular as the **100,000 Army Massacre Sword**, perhaps, but devastating in concentration. The barrage hammered toward Madra's damaged side.\n\nMadra flowed left, sword already tracing an elegant counter.\n\n*CLANG!*\n\nThe skeleton froze mid-strike as a Mjolnir crashed into his spine from behind. Grid had predicted the dodge, positioned the God Hand perfectly. \n\n—*Yes! That's it! He's just a skeleton now! No brain, so of course he falls for your basic tactics!*\n\n'Did you have to call it \"basic\"...?'\n\n*WHAM!*\n\nThe moment Madra stiffened from the Mjolnir's impact, Grid launched his ultimate combination.\n\n\"This is—?\"\n\n*ROOOAR!*\n\n**Linked Kill Wave Pinnacle** erupted like a natural disaster. Madra's hollow eyes widened—he knew Pagma, knew the original swordsmanship, and this fusion technique carried the shadow of Pagma's peak-period ultimate skills.\n\n\"You've reached this level without borrowing the Duke of Fire's power...!\"\n\n*Slash—stab—slash—stab—overhead blow—slash!*\n\nFlames, crimson lightning, and black hellfire spiraled from the **Enlightenment Blade**, each element detonating against Madra in perfect rhythm.\n\n> [You have dealt 113,500 damage to the target!]\n> [Critical!]\n> [You have dealt 256,200 damage to the target!]\n> [**God Hand (1)** has dealt 1,010 damage to the target.]\n> [The **Ultimate Enhanced Mjolnir** has caused the target to stiffen for 0.3 seconds.]\n> [The option effect of the **Lightning Sword Born from Enlightenment and Strong Desires** has dealt 15% additional lightning damage to the target!]\n> [You have dealt 129,700 damage to the target!]\n> [**God Hand (2)** has dealt 650 damage to the target.]\n> [The **+7 Mjolnir (2)** has caused the target to stiffen for 0.1 seconds.]\n> [The option effect of the **Lightning Sword Born from Enlightenment and Strong Desires** has summoned a red lightning bolt!]\n> [You have dealt 278,030 damage to the target!]\n> [The target is caught in an electric shock for 1.2 seconds!]\n> [The option effect **'Black Flames'** has activated from the **Lightning Sword Born from Enlightenment and Strong Desires**!]\n> [Critical!]\n> [You have dealt 950,490 damage to the target!]\n\nPerfect. *Perfect.*\n\nThe four Mjolnirs created a chain of stiffness effects—0.3 seconds, 0.1 seconds, 0.1 seconds, 0.1 seconds—seamlessly feeding into the red lightning's 1.2-second electric shock. Infinite stiffness, mathematically optimized. \n\nFor the first time in his legendary existence, living or dead, the Undefeated King was helpless.\n\n\"I'll take that 'undefeated' title from you...!\" Grid's voice rang across the sixty-sixth island, fierce with battle-joy. \"**Noe! Randy! Get out here!**\"\n\nThe summons flared as Grid pressed his advantage, determined to break the legend who'd never known defeat."
}