{
  "id": 691,
  "title": "Chapter 691",
  "content": "Every strike Grid landed thundered across the plains. Crimson flames erupted from one blow, scarlet lightning from the next, black fire from another—each impact deafening, far beyond what any ordinary weapon could produce. The raw *power* was unmistakable.\n\n\"Ngh...!\"\n\nMadra—the Undefeated King—had never tasted defeat in life or death. Absolute in both states, this helplessness Grid forced upon him was an entirely foreign sensation. When the golden hands wielding hammers first battered him into helpless rigidity, panic seized him. Then he *laughed*.\n\n\"Kuk...! Kukukuk! So this is how ordinary warriors fight!\"\n\nLegendary beings resisted all status effects save two: those inflicted through pure physical force, and those that bypassed resistance entirely. Even then, most legends weren't *truly* immune. But Madra was different. To remain undefeated, he'd needed to eliminate every variable, every uncertainty. Among all legends, he alone possessed *perfect* status resistance—superior even to Sword Saint Muller's Super Sensitivity.\n\nBut that was when he'd been alive.\n\nAs a death knight, Madra had lost most of those abilities. Which was why Mjolnir's stiffness effect worked on him at all.\n\n\"To think...! That I, Madra the Undefeated King, would face a situation beyond my control! What an unfamiliar... what a *delightful* experience!\"\n\n*What the hell is wrong with this guy?*\n\n**Crack!**  \n**Crack crack crack!**\n\nThe four God Hands continued their relentless assault on Madra's skull. Four Mjolnirs attacking in perfect rotation, each blow stunning him for another fraction of a second. It was already decided. Madra couldn't move, couldn't retaliate. He would simply be beaten to death.\n\nYet there he was—laughing like a madman.\n\n*Is he another Agnus...?*\n\nGrid was misunderstanding. As had been established repeatedly, Madra had *never* been defeated. His unbroken record stemmed from absolute composure in battle. If he was laughing, it meant he didn't consider this a crisis.\n\n**Crunch!**  \n**Crunch crunch crunch!**\n\nThe hammer strikes and elemental explosions carved deeper fissures into Madra's skull.\n\n*Good. Keep the pressure on.*\n\nGrid watched Madra's health drop below fifty percent and intensified his assault. As long as the infinite stiffness chain held, victory was certain.\n\nThen—\n\n**BOOM!**  \n**BOOM BOOM BOOM!**\n\nAfter a full minute of continuous black flame detonations, Madra's health plummeted to thirty percent. His skull fractured. The right side of his forehead collapsed completely.\n\nAnd in that instant—\n\n\"I've been waiting for this moment!\"\n\n\"—!\"\n\nMadra broke free.\n\nThe reason was simple. When the forehead bone shattered, God Hand (3)'s timing faltered by a hair's breadth. After hundreds of identical strikes, the target's *shape* had changed. God Hand (3) had been striking every 0.6 seconds in perfect synchronization with its companions. When the bone collapsed and its target point vanished, it hesitated—recalculating. Less than 0.2 seconds. But Madra had been waiting for exactly that gap. He'd foreseen this moment, knowing his fragile undead frame couldn't withstand the punishment indefinitely.\n\n**Thunk!**\n\nIn a blink, Madra pierced through the encircling God Hands. His blade plunged into Grid's chest.\n\n> **[Critical!]**  \n> **[You have suffered 26,130 damage.]**  \n> **[The experience of Tiramet's Belt has increased by 0.12%!]**\n\n\"Tch...!\"\n\nDirect combat wasn't the answer. Grid had to re-establish the stiffness lock. He made the snap judgment—God Hands surged back around Madra—\n\nBut it was already too late.\n\n**BOOOOOOM!**\n\nMadra's blade erupted. The **200,000 Army Massacre Sword** detonated in a sphere of devastation hundreds of meters wide.\n\n\"...Ghhk!\"\n\nGrid's scream tore from his throat as the shockwave consumed him. His vision flashed red.\n\n> **[You have suffered catastrophic damage!]**  \n> **[The God Hands have become stiff.]**  \n> **[The experience of Tiramet's Belt has increased by 1%!]**  \n> **[A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]**\n\n*What the—*\n\nGrid had maintained maximum health throughout the stiffness sequence. Nearly 90,000 HP—comparable to top-hundred-ranked tanks. All of it obliterated by *two attacks*. His immortal passive had triggered. Despite wearing Triple Layers.\n\n*This is the damage from a basic attack and an area skill...!*\n\nIt was absurd. Completely broken!\n\n*The other death knights can barely use basic techniques. What the hell is this monster?*\n\nGrid had assumed 200,000 Army Massacre Sword was Madra's ultimate technique. The hundreds-of-meters range, the overwhelming power—it had to be his trump card. For a death knight to retain access to such an ultimate ability seemed unfair enough.\n\nThen Braham's voice echoed in his consciousness.\n\n—*That's a basic skill. Madra's true power begins at the 500,000 Army Massacre Sword level.*\n\n*What? Begins at—?*\n\n—*The technique that symbolizes Madra is the One Million Army Massacre Sword. The current Madra is pathetically weak... his limit of 200,000 is pitiful. You can't even consider this the real Madra.*\n\n\"...\"\n\nGrid didn't hear that. He refused to acknowledge Braham's words.\n\n*I have to end this within five seconds.*\n\nHe activated Blackening, determined to unleash everything in his immortal window. But determination alone doesn't bend reality. The world wasn't so accommodating.\n\n\"I won't allow it.\"\n\n**Shhk!**\n\nMadra wrenched his sword free from Grid's chest and kicked off, launching himself backward. He was a legend too. He knew about the immortal passive's limitations.\n\n\"You won't reach me.\"\n\n\"Hey...! You cowardly bastard!\"\n\nMadra spoke with regal dignity—utterly at odds with his actions. To deny Grid any opportunity during his immortal state, Madra was already *running away*. There was no chance Grid could catch up to someone using shunpo with such a head start.\n\n\"Wait! Stop running!\"\n\n\"Hahaha! Come and catch me if you can!\"\n\n\"I *will* catch you!\"\n\n—*...*\n\nFour seconds left on Grid's immortal state. Madra sprinted across the plains shouting taunts. Grid chased after him. At a glance, it resembled lovers reuniting after long separation—an old skeleton and a young man having their passionate moment!\n\n—*...What in the world are you doing?*\n\nBraham's disgusted cry came just as—\n\n\"Time's up.\"\n\n**SLASH!**\n\nThe instant before Grid's immortal state expired, Madra stopped fleeing and counter-attacked. He intended to end the battle the moment Grid's invulnerability dropped. Anyone who understood the immortal passive would make that same judgment.\n\nWhich meant Grid could predict it easily. He'd already downed a superior health potion, equipped Doran's Ring, and prepared a sword technique in advance. Naturally, he chose Revolve—the supreme counter-skill that reflected enemy attacks.\n\nHowever—\n\n**SHING!**\n\n\"...!\"\n\nGrid's eyes widened as Revolve activated against Madra's strike. Because Madra had attacked him with a *basic* swing. In other words, Grid had just wasted Revolve on a simple attack.\n\n\"Hahaha! You fool!\"\n\n*He knew...!*\n\nOf course Madra knew Pagma. He'd probably seen Revolve before. He'd predicted Grid would use it at exactly this moment.\n\n**WHOOSH!**\n\nMadra's **100,000 Army Massacre Sword** descended toward Grid's exposed neck.\n\n\"Grid...!\"\n\nOn the sixty-fifth island, Sticks watched through his crystal ball, face drained of color. Madra's overwhelming power shocked him. He genuinely worried they'd have to abandon the Behen Archipelago purification entirely.\n\nBut Grid was different.\n\nA broad smile spread across Grid's face as he met Madra's attack. Madra felt a flicker of suspicion.\n\n\"Revolve.\"\n\n\"...What?\"\n\nThe technique Madra had just neutralized—*again*?\n\n**KRAKOOOOM!**\n\nThe 100,000 Army Massacre Sword—originally meant to execute Grid—reversed course and slammed into Madra instead.\n\n**BOOOOOM!**\n\nImpact.\n\n> **[You have dealt 1,435,900 damage to the target.]**\n\n\"Ghk...\"\n\nThe explosion carved a crater in the earth. Atop the devastation, the supposedly unbeatable king staggered... Who could have imagined? Madra the Undefeated King, driven to the brink twice by the same opponent!\n\n\"No one could have imagined it. Right?\"\n\nGrid had been able to use Revolve consecutively thanks to God's Command. Pure luck had saved him from certain death—but he didn't show it. He stood with confident dignity.\n\n\"Except one person. Didn't I tell you? I'm taking your undefeated title.\"\n\n\"Hah...!\"\n\n\"Pagma's Swordsmanship!\"\n\n\"300,000—!\"\n\nGrid began the sword dance of Transcended Link. Madra tried to counter. Unfortunately, there was a fundamental difference in their physical states. Death Knight Madra's fragile skeletal frame had already reached its breaking point.\n\n\"Army—!\"\n\n**Crack!**\n\n\"Massacre—!\"\n\n**Crunch crunch crunch!**\n\n\"...Sword!\"\n\n**CRASH!**\n\nHe'd wanted to neutralize Grid's skill with 300,000 Army Massacre Sword. Instead, Madra only worsened his situation. His cracked, damaged body could no longer withstand the strain. The technique completely shattered Madra's left arm and shoulder. Ribs and leg bones caved inward.\n\n**Thud!**\n\nThe sword technique failed. Madra collapsed.\n\nHe wasn't laughing anymore. But there was no hostility either. He looked up at Grid with something like humility. Despite losing the undefeated title he'd defended for hundreds of years, there was no obsession, no desperation clinging to it.\n\nMadra was exhausted. Since his resurrection as a death knight, he'd endured solitary existence on the sixty-sixth island for over a century. As the Undefeated King, he couldn't express weakness or complaint—but it had worn away at his soul. He'd been longing for rest.\n\n\"...Overgeared King. Legend of the new era. Thank you for giving me joy at the end. Let me reward you.\"\n\n\"...Madra!\"\n\nA brief gratitude. A quiet farewell.\n\nThe moment Madra's words reached Grid's ears—\n\n**BOOM!**  \n**BOOM BOOM BOOM BOOM!**\n\nGrid's Transcended Link engulfed Madra.\n\n> **[You have dealt 21,560 damage to the target!]**  \n> **[You have recovered 2,587 health thanks to Elfin Stone's Ring!]**  \n> **[The experience of Elfin Stone's Ring has increased by 0.2%!]**  \n> **[You have dealt 24,010 damage to the target!]**  \n> **[You have dealt 26,500...]**  \n> **[You have dealt 29,100...]**  \n> ...  \n> ...  \n> **[Critical!]**  \n> **[...The option effect 'Black Flames'...]**  \n> **[A red lightning has been summoned...]**  \n> **[Critical!]**  \n> ...  \n> ...  \n> ...  \n> ...  \n> **[The great hero, Overgeared King Grid has given rest to the heroes and succeeded in cleansing the Behen Archipelago.]**  \n> **[This will be a long-standing achievement in humanity's history.]**\n\nWorld messages bloomed across every player's vision.\n\n\"...\"\n\nGrid's expression was somber. Madra's final bearing left Grid's chest hollow and aching."
}