{
  "id": 695,
  "title": "Chapter 695",
  "content": "The S.A. Group dropped their bombshell announcement just as Grid and the Behen Archipelago dominated every news cycle. New rules for the 3rd National Competition—rules that conveniently shifted attention away from Grid's accomplishments and sparked outrage across South Korea.\n\n\"This is bullshit! A blatant attack on our country! These new rules screw us over completely!\" The commentator's voice crackled with indignation. \"The S.A. Group needs to answer for this!\"\n\nAt the Haenam branch of Eat Spicy Jokbal, Peak Sword gnawed on a piece of pork trotter, his jaw working overtime—though whether from the food or his anger was anyone's guess.\n\n\"Those bastards.\" He slammed his soju glass down. \"Three months before the competition and they pull this shit?\"\n\nThe Olympics had evolved over centuries. What started as a chaotic mess of bizarre events and arbitrary rules had matured into the fairest sporting competition in the world. The Satisfy National Competition would get there eventually—but they sure as hell weren't there yet.\n\nEvery year brought a complete overhaul of the fundamental rules, leaving players and spectators scrambling to keep up.\n\nThe 1st National Competition: seventeen countries, each player forced into three events.\n\nThe 2nd National Competition: thirty-two countries, players allowed up to six events total—three individual, three group.\n\nNow? Fifty countries, but players could only enter two events. Solo or group, didn't matter—two was the limit.\n\nThe expanded roster wasn't the problem. More countries meant wider recognition, a narrowing skill gap between nations. That was good. But restricting individual participation to two events? That was a direct hit to South Korea's strategy.\n\nThe future belonged to countries like the United States with their massive player pools. Meanwhile, South Korea—the nation that had shocked everyone by dominating the first two competitions—was getting kneecapped.\n\nAnd everyone knew why.\n\nGrid.\n\nGrid had carried South Korea to glory, racking up gold medals like they were achievement badges. Now that safety net was gone. No matter how skilled he was, Grid could only secure two gold medals maximum. Without him sweeping multiple events, South Korea's hopes of maintaining their ranking were effectively dead.\n\n\"Twenty events now, too.\" Peak Sword exhaled sharply. \"This is exactly what everyone's been saying. The S.A. Group took American money. The U.S. wants the prestige of being Satisfy's strongest nation, and they're scared of us, so they changed the rules.\"\n\n\"Maybe because South Korea only has Grid in the first place?\" Eat Spicy Jokbal didn't look up from the makguksu he was preparing. \"Can't win gold medals without him? What difference does it make if you can't qualify for gold? If South Korea drops in the rankings, that's on you. Nobody else to blame.\"\n\nObjectively speaking, Eat Spicy Jokbal was right. South Korea's high rankings were an anomaly built entirely on Grid's shoulders. The international criticism had been building for a while—hence the rule changes. But Peak Sword wasn't backing down.\n\n\"Sure, relying on one person isn't ideal. But doesn't it strike you as pathetic that the organizers changed the entire competition just to stop one player? Think about it. Brazil, Germany, Italy, Argentina—they dominate soccer, win World Cups constantly. Did anyone ever create special rules against them?\"\n\n\"That's... that's not the same thing.\"\n\nEat Spicy Jokbal clicked his tongue at the absurd comparison. Peak Sword plowed ahead anyway.\n\n\"Fine. Then what about Taekwondo? E-sports? South Korea wins medals across multiple competitions, and what happens? They introduce rules specifically to handicap us! It's systematic bullying!\"\n\n\"...\"\n\nEat Spicy Jokbal was Korean too. He couldn't fully agree with Peak Sword's conspiracy theory, but he understood the frustration. Still, what could anyone do? The entire world resented South Korea's success in the previous competitions. No other country thought it was fair watching Grid vacuum up gold medals. If the National Competition continued as a one-man show, it would lose all credibility and become a joke.\n\n\"Peak Sword, try to understand. Would you be saying this if you weren't Korean?\"\n\n\"...\"\n\n\"The Satisfy National Competition is still new, still massive in scale. What feels unfair now becomes the foundation for the future. Give it time. Eventually it'll develop into something everyone can accept.\"\n\nThe words felt strange coming from Eat Spicy Jokbal—a man who'd organized Blood Carnival purely to satisfy his own desires. But Peak Sword's weekly visits had been changing him. The man who'd only cared about personal growth was now offering comfort. Peak Sword's genuine warmth was infectious.\n\n\"Stop sulking and drink.\" Eat Spicy Jokbal refilled Peak Sword's glass.\n\nPeak Sword downed the soju, his real feelings spilling out with the alcohol.\n\n\"You know what pisses me off about people like you? Everyone thinks South Korea is weak in Satisfy, but that's garbage. I've heard the rumors—plenty of South Koreans among the unofficial rankers. You're sitting right in front of me.\"\n\n\"...\"\n\n\"If you people hiding in the shadows actually fought for South Korea instead of chasing personal gain, nobody would underestimate us. We could stand alongside the United States and Canada as a recognized powerhouse. Every South Korean could feel proud. But what's reality? Grid and Yura are the only ones fighting for this country with pure intentions.\"\n\nPeak Sword included himself in that criticism. He'd skipped the 1st National Competition, afraid of exposing his techniques to the world, convincing himself it wouldn't matter anyway.\n\nMeanwhile, Grid and Yura took the penalties and committed to their country—at least, that's how Peak Sword saw it. The memory of Grid's appearance at the 1st National Competition still stunned him. That unknown player revealing his talents to the world...\n\n\"I hope you don't end up with regrets like mine. Participate in the 3rd National Competition. Show the world that Grid and Yura aren't South Korea's only talents. Imagine proving that even their rule changes can't keep us down!\"\n\nPeak Sword had demolished more than half the jokbal already. First he'd gotten free makguksu, now he was making demands.\n\n\"Didn't you approach me about joining Overgeared? Now you want me fighting for South Korea. Make up your mind.\"\n\nA fair point—Peak Sword was losing the plot. But after weeks of visits, Eat Spicy Jokbal had started thinking of him more as a drinking buddy than a guild recruiter. That was a miscalculation. Peak Sword hadn't forgotten anything. He was just greedy.\n\n\"If you join Overgeared, the guild thrives. If you compete for South Korea, the country thrives. I want both.\"\n\n\"So you want everything? That's pretty damn greedy.\"\n\n\"I'm not forcing you. I don't have that right. The choice is yours. Either way, I still want you as my drinking buddy. Your jokbal is delicious.\"\n\n\"Hrmm...\"\n\nEat Spicy Jokbal poured another glass. His dungeon-making abilities could be deployed across countless fields. Among the \"conditionally strongest\" players—alongside Yura, Katz, and Seuron—he was prime talent. Now he was locked in thought.\n\n***\n\n\"Hero King~ Hero King~~ lululu~~ Ego sword producer~~~ lulalulua~~~\"\n\n\"...\"\n\nGrid's emotional range was something else. Minutes ago he'd been clutching his head in frustration. Now he was dancing around the room, singing off-key.\n\nSticks watched with question marks practically floating above his head.\n\n*How does someone with this personality show such extreme focus in battle?*\n\nConcentration required self-control. Yet Grid in his natural state resembled an innocent child. How did this man reign himself in to achieve that level of focus?\n\n*He must work harder than everyone else...*\n\nRising to his current position despite lacking talent—that took effort. Sticks smiled and activated Mass Teleport.\n\n***\n\n\"A letter arrived from Lubana.\"\n\n\"Finally.\"\n\nReinhardt, capital of the Overgeared Kingdom.\n\nLauel glanced up from the mountain of documents burying his desk. The soldier handed over a letter. The sender: 'Descendant of the Undefeated King.' Lauel could guess the contents easily enough.\n\n*He wants cooperation in the war.*\n\nExactly right. The person claiming to be the Undefeated King's descendant—the one who'd sparked rebellion in Lubana—hoped Overgeared would strike while the empire focused its forces on suppressing him. Rumors of tension between Overgeared and the empire had spread, making it seem like a mutually beneficial proposition.\n\n\"But why would we do this?\"\n\nThe request was simple: attack the empire's rear, force them to split their attention. Lauel had zero intention of accepting. They knew nothing concrete about this supposed descendant or the actual situation in Lubana. The risk far outweighed any potential benefit.\n\n\"Thought he'd at least give us some information about himself. Instead he hid everything.\"\n\nLauel skimmed the disappointing letter and tucked it into a corner of his inventory.\n\n*Pahat!*\n\nLight flashed at the center of the office. Sticks and Grid materialized.\n\n\"Ah! Jesus!\"\n\nTwo people suddenly appearing in a quiet room would startle anyone who wasn't completely dead inside. Lauel jerked backward. Grid approached and extended a large hand.\n\n\"Bit of an overreaction, isn't it? What's the Overgeared Kingdom going to do if a high ranker has such a weak constitution?\"\n\n\"I wouldn't dare call myself a high ranker in front of someone ranked third in the world.\"\n\nTears gathered in Lauel's eyes as he grasped Grid's calloused hand. Grid had only been gone for ten days, but it felt like months. That made sense—Grid had completely changed. Nearly ten levels gained, his expression more mature, red energy radiating from his body with transcendent power. He'd returned as someone fundamentally different.\n\n\"What an incredible aura... Have you finally recovered some of the power sealed from your previous life?\"\n\n\"Hahaha, good to hear your chuuni nonsense after so long.\"\n\nGrid felt the same way. It seemed like forever since he'd seen Lauel, thanks to everything he'd experienced on the Behen Archipelago. Looking back, those ten days felt like months compressed into a handful of memories.\n\n\"Are you going to see Queen Irene?\"\n\nAfter a brief greeting, Grid headed straight for the office door.\n\n\"No, I'm going to the library.\"\n\nGrid waved a shabby booklet.\n\n\"Eh? Huh? Library??\"\n\nLauel doubted his ears. The library was the last place he'd ever associate with Grid. In all their time together, he'd never once seen or heard of Grid using the library.\n\n\"...\"\n\nWhat was so urgent that Grid had to leave immediately? Lauel turned to Sticks, who looked equally confused about why he'd been forced to teleport directly into someone's office.\n\n\"Is His Majesty alright? Did he hit his head?\"\n\n\"...\"\n\nGoing to read a book was apparently so unusual it warranted a head injury diagnosis. Sticks felt a pang of pity that Grid would be so misunderstood just for wanting to study."
}