{
  "id": 697,
  "title": "Chapter 697",
  "content": "Grid gripped the textbook, reading the same line three times to be sure. The words didn't change. **Legendary.**\n\nEven the degraded version warranted legendary classification.\n\nHis mind flashed back to conversations with Braham about Madra. This—100,000 Army Swordsmanship—was merely the *foundation*. Madra's true techniques began at 500,000 and climbed higher still.\n\nThe memory of his first assimilation with Braham surfaced unbidden. The vampire's consciousness had seized control and unleashed **Mana Drain the Sky**, forcibly stripping every drop of ambient power from the air itself. Even Piaro, who stood among the continent's elite, would've burned to ash beneath a single fireball from Braham in his prime.\n\nGrid's lips curved upward. \"That's what makes it worth doing.\"\n\nSatisfy's story had barely begun. The ceiling stretched impossibly high—which meant *he* could climb that high too. He and Kraugel shared the same summit in their sights.\n\nHe cracked open the textbook.\n\n[You are attempting to learn a new swordsmanship technique, 100,000 Army Swordsmanship (Degraded).]\n\n[You have received the Undefeated King's recognition. Learning conditions satisfied.]\n\n[Congratulations! You have acquired **100,000 Army Blockade Sword (Degraded)** and **100,000 Army Massacre Sword (Degraded)**!]\n\n\"Yes!\"\n\nGrid immediately pulled up his skill window. Forty attacks per second across a wide area—Massacre Sword made Link look primitive by comparison. His finger hovered over the description, ready to test it.\n\nThen he actually *read* the requirements.\n\n**[100,000 Army Blockade Sword (Degraded) Lv. 1]**  \nDeals 20% damage to all enemies in visual range and inflicts 'Blockade' for 3 seconds, preventing movement and skill usage.  \n**Cost:** 5,000 Mana, 20 Sword Energy  \n**Cooldown:** 30 minutes  \n*Skill inactive. Acquire Sword Energy resource to activate.*\n\n**[100,000 Army Massacre Sword (Degraded) Lv. 1]**  \nDeals 60% attack power 30 times to all targets (friend or foe) within 10 meters.  \n**Cost:** 8,000 Mana, 50 Sword Energy  \n**Cooldown:** 10 minutes  \n*Skill inactive. Acquire Sword Energy resource to activate.*\n\n\"What the hell is Sword Energy?\"\n\nNo explanation. No hint. Just a locked door with the key description missing.\n\n\"You've got to be kidding me.\"\n\nHe'd fought for this. Madra himself had acknowledged Grid's worth. And now the system dangled the prize just out of reach?\n\n\"This is garbage.\"\n\nGrid shoved back from his desk and stalked toward the palace gardens.\n\n***\n\n\"Kyaaak! The Overgeared King!\"\n\n\"It's His Majesty!\"\n\nThe maids and gardeners erupted in delighted chaos at his appearance. Grid barely registered them. He drew Failure—no, the gorgeous crimson blade that had evolved beyond its humble origins—and every voice fell silent.\n\nDozens of eyes tracked his movements as he positioned himself before a row of ornamental trees.\n\n\"**100,000 Army...**\"\n\nThe name alone sent anticipation rippling through the crowd. What devastating technique would their king unleash?\n\n\"**Massacre Sword!**\"\n\nSilence.\n\nThe trees swayed gently in the breeze, completely unharmed.\n\n[100,000 Army Massacre Sword is inactive. Skill failed.]\n\nGrid stood frozen, sword extended toward nothing.\n\nThe maids exchanged glances.\n\nThe gardeners studied their feet.\n\nNobody moved.\n\nOn that day, whispers began circulating through Reinhardt Palace: *His Majesty has a bit of a... dramatic streak.*\n\nThe debut of Grid's strongest skill was, categorically, a disaster.\n\n***\n\n\"Seriously. This is *nasty*.\"\n\nGrid slumped in his study, glaring at the skill description like it had personally wronged him. **Pagma's Swordsmanship** provided passive bonuses when not actively used—boosted attack power, increased critical chance. His basic attacks hit like a freight train because of it. He'd been *salivating* at the thought of combining that foundation with 100,000 Army techniques.\n\nExcept he couldn't cast them at all.\n\nHis total mana pool barely scratched 14,000 despite forced investment in Intelligence. Blockade Sword ate 5,000 mana. Massacre Sword consumed 8,000. Either skill alone represented a massive commitment. Adding an entirely unknown resource requirement on top?\n\n*I have a skill that deals 60% damage thirty consecutive times across a wide area.*\n\n*And I cannot. Use. It.*\n\nThe frustration gnawed at him like a physical ache. Then a name surfaced in his thoughts.\n\n\"Chris would know about Sword Energy.\"\n\nAfter claiming the Hero King title, Grid had unlocked **Fighting Energy** as a new resource. Logic suggested Sword Energy functioned similarly—a specialized pool for swordsman classes. And Chris, ranked first on the unified standings, wielded a greatsword with unmatched mastery.\n\nPlus, he'd sworn allegiance when the Giant Guild joined Overgeared. If Grid couldn't rely on a duke of his own kingdom, who *could* he turn to?\n\nHe headed for Reidan.\n\n***\n\nThe city sprawled across the desert, a testament to reclaimed prosperity. Once the Overgeared Guild's stronghold, Reidan now served as the kingdom's second capital under Chris's governance.\n\nChris himself was something of an anomaly. Natural talent sharpened by Zirkan's mentorship. Former leader of the Giant Guild, one of the infamous Seven Guilds. His raw Strength stat dwarfed even Grid's. After acquiring his second class—**Tyrant**—he'd gained the ability to drain Strength from enemies, allowing him to unleash destructive force that rivaled Grid's **Enlightenment Sword**.\n\nThat the Canadian representative had bent the knee during Overgeared's founding ceremony had sent shockwaves through the community. Half the forums screamed about blackmail.\n\nThe truth was simpler: Chris recognized greatness when he saw it. Following Grid meant reaching heights he couldn't achieve alone.\n\nThough that respect had limits.\n\n\"I also want to use Sword Energy.\"\n\nChris's concentration shattered mid-swing. His blade bit into a true blood vampire's shoulder instead of its neck.\n\n\"Sword Energy is a resource exclusive to those who've earned the **Great Swordsman** title.\" He pivoted, driving his blade through a second vampire lunging from the shadows. \"How exactly do you plan to access it?\"\n\nHis swordsmanship remained flawless despite the conversation—economy of motion, perfect weight transfer, not a single wasted movement. Grid felt that familiar pang of admiration mixed with envy.\n\n\"So you *do* know about it. How do I get Sword Energy?\"\n\nGrid drove forward, striking a true blood vampire four times in rapid succession before finishing it with **Black Flame Explosion**. Searing darkness consumed the monster.\n\nChris went still for a heartbeat.\n\n*That must be the new sword everyone's talking about.*\n\nThe power output was staggering. Grid had evolved again in just a few months.\n\n\"Didn't you hit third on the rankings after clearing Behen Archipelago? The Hero King title must've given you something.\"\n\n\"Can't brag to the first-place ranker, can I?\"\n\n\"...Right.\"\n\nChris knew the truth. Grid could claim that top spot whenever he wanted. The knowledge didn't sting—Chris had already bent the knee. He'd accepted his position. Of course, he didn't intend to let *anyone else* overtake him.\n\n\"You acquired a new swordsmanship on Behen Archipelago.\"\n\nIt wasn't a question.\n\nGrid blinked. \"How'd you—? Yeah. That's exactly right.\"\n\n\"Then here's your answer: Sword Energy unlocks after you achieve a certain threshold as a Great Swordsman. And Great Swordsman is a title restricted to swordsman-type classes.\" Chris met Grid's eyes. \"You will never obtain Sword Energy.\"\n\nGrid's jaw tightened. He channeled frustration into action, activating **Pagma's Swordsmanship, Transcend**. For thirty seconds, every strike carried doubled power and sent blade projections slicing through the darkness. Vampires fell like wheat before a scythe.\n\nWhen the skill expired, Grid exhaled slowly. \"So what—these techniques are just dead weight forever?\"\n\n\"Originally? Yes.\" Chris's greatsword hummed as pale blue energy coalesced along the blade. \"But you might have an alternative.\"\n\nThey'd reached the thirteenth vampire city's inner sanctum while talking. The current lord—a true blood who'd claimed Elfin Stone's territory—rose from its throne with a shriek of rage.\n\nThe haze surrounding Chris's weapon intensified, sharpening into a visible aura.\n\n\"This is Sword Energy.\"\n\nHis blade carved a blue arc through the air.\n\nThe boss's torso simply *ceased to exist* from the sternum up.\n\n\"Holy shit...\"\n\n\"That red glow around you—that's the Fighting Energy from your Hero King title, right?\"\n\nChris studied the crimson corona emanating from Grid's body.\n\n\"I completed a quest chain a while back. According to the lore, Muller held the Hero King title.\"\n\n\"Sword Saint Muller?\"\n\n\"The same. He wielded both Sword Energy *and* Fighting Energy. Which means Fighting Energy has applications for swordsmanship.\" Chris drove his blade through the boss's regenerating lower half. \"Try substituting Fighting Energy where the skill calls for Sword Energy.\"\n\n\"How am I supposed to—\"\n\n\"Figure it out.\" Chris flashed a rare grin. \"Not my job to hand you everything.\"\n\nThey dismantled the remainder of the fight through pure synchronization, their combat experience speaking louder than any coordination. The boss fell in record time.\n\n[The master of the 13th city, True Blood Vampire Ray, has been destroyed.]\n\nGrid wiped his blade clean, his mind already racing ahead. *Maybe it's time to push deeper into the vampire cities.*\n\nThey'd avoided the higher-numbered cities out of respect for Vampire Duke Marie Rose and the direct descendants' power. But months had passed. Grid and the Overgeared members had all climbed higher. As long as they avoided Marie Rose herself...\n\n\"I need to talk to Sticks about Fighting Energy mechanics.\" Grid clasped Chris's shoulder. \"Thanks. Seriously. Now go get some levels in.\"\n\n\"You absorbed ninety percent of the experience and you're *thanking* me...\"\n\n\"Haha, my bad! Call if you need backup!\"\n\nGrid triggered a Return Scroll, leaving Chris alone in the blood-stained chamber.\n\nChris chuckled and turned back to the dungeon depths.\n\n\"National Competition's going to be interesting this year.\""
}