{
  "id": 698,
  "title": "Chapter 698",
  "content": "*Click.*\n\nThe lid of Comet Group's diamond-class capsule hissed open. Shin Youngwoo sat up, running a hand through his hair as fragments of understanding crystallized in his mind.\n\n*So that's what Piaro meant.*\n\nBack when the legendary farmer had spoken of abandoning aura for sword energy, it had sounded like mystical martial arts nonsense. But now, after studying Madra's diary, the concept made perfect sense.\n\n*Piaro discovered a new combat resource—sword energy. But as an NPC, he couldn't explain it in game mechanical terms.*\n\nThe reason Piaro had to abandon aura was still unclear, but Youngwoo could make an educated guess.\n\n*Skills that consume sword energy must be exponentially more powerful than aura-based techniques.*\n\nEvery warrior's skill set was unique. Perhaps Piaro's aura skills had been relatively mediocre—dead weight holding him back from reaching Sword Saint status.\n\n\"Hah... hah...\"\n\nEven while his thoughts churned, Youngwoo moved. He stretched his stiff muscles, dropped for a hundred push-ups, then pulled himself up a hundred times on his home gym bar. A healthy body housed a healthy mind. That's why he logged out religiously every six hours—to eat, exercise, and maintain his physical condition.\n\n*Without this routine...*\n\nHe'd turn into a brain-fogged husk who couldn't stand his own reflection. Exercise sharpened his thinking, cleared away the mental cobwebs.\n\n*There are two paths to acquiring sword energy.*\n\nAfter his workout, Youngwoo showered and had jajangmyeon delivered. Dressed in a comfortable cardigan, he settled by the garden pond. His reflection showed an athletic build that could rival professional competitors, while his focused expression carried an almost cinematic intensity.\n\n*First option: find a way to substitute fighting energy for sword energy.*\n\nThat meant consulting Sticks. While Youngwoo didn't fully understand fighting energy's mechanics, the sage might have insights worth exploring.\n\n*Second option: intensive sword training with Piaro and Asmophel.*\n\nThere had to be a path to earning the Great Swordsman title through dedicated practice. Chris insisted it was exclusive to swordsman classes, but Grid disagreed. After all, Pagma had been a great swordsman.\n\n*A blacksmith AND a great swordsman...*\n\nIf Pagma managed it, so could he. Still, exploiting fighting energy seemed more practical than pursuing the Great Swordsman title. According to Chris, sword energy only unlocked at higher levels *after* becoming a great swordsman. The title alone wouldn't guarantee access to the resource.\n\n*I might waste years grinding swordsman quests.*\n\nIt had been nearly two years of Satisfy time since acquiring Braham's soul, yet he'd only mastered a handful of spells. Skills outside your core class demanded massive time investment for minimal returns.\n\n*But I need 100,000 Army Swordsmanship NOW.*\n\nHe'd suffered to obtain those hidden skills. Not being able to use them was maddening.\n\n*Ideally, I'll unlock them before the National Competition.*\n\nHis recent encounter with Chris had driven home an uncomfortable truth—while Grid grew stronger, so did everyone else. If he wanted to dominate the competition, he needed every advantage.\n\nHe'd already committed to participating in the 3rd National Competition. The propaganda value was too important to ignore.\n\n*I need to showcase the Overgeared King's power to the world. Draw talent to the kingdom.*\n\nDuring the next competition, Grid would demonstrate his strength at every opportunity. He swore it.\n\nHe had no idea that a video titled \"Grid's Chunni Scene.avi\" was already spreading across the internet...\n\n---\n\nGrid was South Korea's rising star—his fan cafe membership had exploded past one million. Among those devotees lurked some with... intense dedication. The kind who craved glimpses of their idol's daily life.\n\nOne such fan worked as a maid in the Overgeared Palace.\n\nThe moment she spotted Grid in the courtyard, she activated recording mode. What followed was pure gold.\n\n\"Haa... haah. He's so adorable.\"\n\nMin, a woman in her early twenties, replayed the footage for the dozenth time. The contrast was perfect—Grid's broad swimmer's shoulders, his sharp monolid eyes, his aggressively masculine presence... all undermined by his deadly serious proclamation of *\"100,000 Army Massacre Sword!\"* at an innocent tree.\n\nShe was in heaven.\n\nThen inspiration struck. Other fans deserved to witness this precious moment. Purely to spread joy, of course. She uploaded the video to Grid's fan cafe.\n\nThe reaction was immediate and explosive. Within hours, the clip had migrated to every SNS platform and gaming community imaginable.\n\n—100,000 Army Massacre Sword lmaooooo I'm dying\n\n—Dude's out here fantasizing about killing 100,000 people...\n\n—I mean... even for a power fantasy, isn't that naming sense a bit... elementary school? Does Grid have the mental age of a twelve-year-old?\n\n—Ugh, seriously? Let the man have fun in his downtime.\n\n—The gap between his broadcast persona and THIS is hilarious. Full-blown chuunibyou.\n\n—Chuuni? Grid's life is still a million times better than yours lol\n\n—Why is this even controversial? We ALL know Grid's a chunni. Anyone who names their guild \"Overgeared,\" their kingdom \"Overgeared Kingdom,\" and calls himself \"Overgeared King\" is terminally afflicted. How are you people this dense?\n\n—...\n\nThe commenters had no way of knowing that 100,000 Army Massacre Sword was an actual skill. They could only assume it was Grid's tragic attempt at sounding cool. Still, most of his fanbase found it endearing rather than embarrassing—Grid's accomplishments were too numerous and impressive for this to tarnish his reputation.\n\n---\n\nThe beautiful peninsula of Lubana boasted diverse climates and rich culture. Though it had been a Saharan Empire territory for two centuries, its people maintained fierce pride in their heritage. After all, Lubana had been an independent kingdom for nearly five hundred years before the Undefeated King Madra's death.\n\nBut the Lubanian people suffered. Mainland discrimination. Imperial propaganda masquerading as education. Two hundred years of systematic oppression had fermented deep resentment toward the empire.\n\nThen someone claiming descent from the Undefeated King emerged.\n\n\"I will free you,\" he proclaimed.\n\nFor the exhausted, downtrodden people of Lubana, it was an irresistible promise. They rallied behind the Undefeated King's heir and rose in rebellion—not for conquest, but for independence. For dignity. For the right to live without discrimination.\n\nThe empire responded with overwhelming military force.\n\nThe descendant fought back.\n\n\"Hah... hah...\"\n\nOasis. An early adopter who'd played since Satisfy's launch, consistently maintaining a rank within the top ten million users. Out of two billion players, that technically qualified as \"high-ranking.\"\n\nBut Oasis knew better. His position was too middling to brag about. He was aggressively, frustratingly *average*.\n\nHe'd never deluded himself otherwise. Stars like Kraugel and Grid existed in a different stratosphere—objects of distant admiration. Sometimes Oasis daydreamed about having Kraugel's transcendent talent, or Grid's incredible luck and charisma. How many nights had he fantasized about that? They were shonen protagonists made flesh. Like most people, Oasis desperately wanted to be special.\n\nReality remained brutally indifferent. His daily life persisted in mundane mediocrity.\n\nUntil opportunity found him.\n\nHis cautious, timid personality had one advantage—he'd never lost a fight. Never been defeated, never died. When he came to Lubana as a second advancement class user, that undefeated record caught someone's attention.\n\nAn ancient sheath. An ego item containing a fragment of the Undefeated King's will.\n\n—*You carry neither the stench of defeat nor mastery. Yet you remain undefeated. Curious. Moderately interesting. Let us see what manner of master you become.*\n\nUndefeated King Madra—relatively obscure compared to other legends since he'd operated exclusively in Lubana during his lifetime. The moment that ego recognized him, Oasis smiled. *An ordinary person chosen by a legend.* This was his chance.\n\n*I'll become legendary too.*\n\nCould he stand alongside Kraugel and Grid, figures he'd only admired from afar? Could he live like a protagonist? Oasis refused to waste this opportunity. He accepted the Undefeated King's sheath with reverent hands.\n\n\"I'll trust and follow you. Please guide me to mastery.\"\n\n*I'll become a master.* If he were Kraugel or Grid, he might have declared it boldly. But Oasis was just an extra. He couldn't muster that confidence. Desperation drove him instead.\n\nHe spent a full year completing the sheath's grueling quest chain. An opportunity earned through his own effort—though Oasis never recognized it that way. He attributed everything to luck, convinced fate had randomly smiled on an ordinary person.\n\nEventually, the sheath offered him a choice. To become the Undefeated King's Descendant, he'd need to undertake his greatest adventure yet: wage war against the Saharan Empire itself.\n\nHim. The man who always chose safety. Who avoided dangerous quests and risky adventures.\n\nHe accepted anyway. Hope and dreams fueled his courage. After this adventure, surely he'd become a protagonist.\n\nBut reality set in quickly.\n\n*Dreams are just dreams...*\n\n*Ku-tang-tang-tang!*\n\nHis vision had been flashing red for ages now.\n\nOasis no longer resisted the encircling knights. The passive Super Sensitivity and status resistances granted by his Undefeated King's Descendant candidacy still functioned, but his physical and mental stamina had hit absolute zero. The quest's temporary buffs—infinite stamina, tenfold stat increase—no longer mattered.\n\n*The reason I stayed undefeated after my second advancement...*\n\n...was because he ran away. Not because he fought and overcame trials like the true Undefeated King.\n\n*I...*\n\nWasn't qualified. Oasis's heart acknowledged the bitter truth. The dream shattered. Surrounded by thousands of imperial soldiers, First Knight Mercedes approached—a beautiful, expressionless woman far beyond his station. Her gaze held no inspiration as it settled on him.\n\n\"The rebellion ends here. You've lost your first battle—disqualified from inheriting the Undefeated King's legacy.\"\n\n\"...I was never qualified to begin with.\"\n\nOasis closed his eyes. He felt no fear of his first death, no regret over losing his chance at becoming the Undefeated King's Descendant. He'd been punching above his weight class. Time to accept his place as a background character.\n\nThen—\n\n\"Hey there, young lady. Been a while, hasn't it?\"\n\nA middle-aged man's voice boomed across the battlefield with such commanding presence that thousands of soldiers turned as one. Oasis's eyes snapped open reflexively.\n\n\"God of War...?\"\n\nAres. Another world-class protagonist on par with Kraugel and Grid.\n\nHe'd arrived.\n\n\"Sorry, but I'm taking the baby Undefeated King with me.\"\n\n\"You...!\"\n\nFor the first time, Mercedes's mask cracked. She despised Ares—the traitor who'd defied the empire to establish his own kingdom. His existence was intolerable. Her lieutenants Scott and Luck materialized on her flanks, unleashing their ultimate skills.\n\nAres seized the opening. Leading fifty thousand Valhalla troops, his stats surged from his Army Commander bonuses. He carved through the imperial forces like a battering ram, bearing down on Oasis.\n\n\"You're the Undefeated King, right? Has to be you! Ha ha!\"\n\nMounted on a massive warhorse, Ares towered over ordinary men like a giant. The presence of a true protagonist made manifest. Thrilled beyond words, Oasis grasped the offered hand."
}