{
  "id": 70,
  "title": "Chapter 70",
  "content": "# Chapter 70\n\nGrid wiped sweat from his brow and pulled up his interface.\n\n\"Status window.\"\n\n---\n\n**Name:** Grid  \n**Level:** 83 (331,400/2,298,000)  \n**Class:** Pagma's Descendant  \n\n* The probability of adding additional options when making items will increase.\n* The probability of item enhancement will increase.\n* All equipment items can be worn unconditionally. However, there is a penalty depending on the rating of the item.\n\n**Title:** One who Became a Legend  \n* Abnormal conditions don't work well on you.\n* You won't die when health is at the minimum.\n* Easily acknowledged.\n\n**Title:** First Unique Item Maker  \n* Dexterity +200\n\n**Title:** Only Legendary Item Maker  \n* Dexterity +350\n\n**Title:** Knight Slayer  \n* Stamina +100\n* Strength +30\n\n**Title:** Apostle of Justice  \n* All stats +10\n* The Apostle of Justice's bravery is unmatched.\n\n**Health:** 7,886/7,886 **Mana:** 522/522  \n**Strength:** 679 **Stamina:** 517 **Agility:** 202 **Intelligence:** 174  \n**Dexterity:** 844 **Persistence:** 198  \n**Composure:** 149 **Indomitable:** 168 **Dignity:** 149 **Insight:** 149  \n**Courage:** 93\n\n**Stat Points:** 0  \n**Weight:** 8,302/17,540\n\n---\n\nThree days. Three days of killing frostlight orcs until his fingers cramped and his eyes burned. Grid had entered this frozen hellhole at level 45. Now he was level 83.\n\n*Three days... level 83 in only three days...*\n\nHe stared at the numbers. Back when he'd been a warrior class, grinding his way through debt-fueled panic, it had taken him a full year to claw his way to level 80. A whole year of his life wasted. He'd blamed the system back then. Called it unfair. Rigged against the poor.\n\n*But I just did in three days what took me a year.*\n\nIt didn't make sense. Grid closed the window and slumped against a frost-covered rock.\n\n*Was I just... not really playing back then?* He shook his head. *No. I'm just broken now. Overgeared.*\n\nThe thought should have pleased him. Instead, it sat like a stone in his gut. He pulled up his inventory, trying to distract himself with profit margins.\n\nForty frostlight orc leathers. Sixty old jewels. A pile of crude hand axes and bows he'd strip for materials. 580 gold total. And...\n\n\"Three scales.\"\n\nHis voice came out flat. Grid stared at the inventory count.\n\n*Three. Sylphid. Scales.*\n\nThe reality crashed over him like ice water. He'd come here to farm twenty scales. Twenty scales to make the invisibility cloak. He'd spent three days butchering over eighty orcs, and he had three gods-damned scales to show for it.\n\n\"What is this?\" Grid's voice rose. \"Why are there only three scales? I killed over eighty of those blue bastards!\"\n\nThe drop rate was abysmal. Worse than abysmal. Grid kicked the rock he'd been leaning against, then immediately regretted it as pain shot through his toes.\n\n\"Grid. Hello.\"\n\nGrid didn't turn. He'd known Huroi was there. The orator had been lurking at the village edge for the past ten minutes, probably working up the nerve to approach.\n\n\"Yeah. What.\"\n\nSilence. Grid finally glanced over his shoulder. Huroi stood frozen, eyes wide like he'd just witnessed a miracle.\n\n\"What's your problem?\"\n\n\"You...\" Huroi pointed at him. \"Did you hit your head?\"\n\n\"What are you talking about?\"\n\n\"You're not yelling at me!\" Huroi's voice pitched higher. \"Normally you'd be cursing me out and telling me to leave!\"\n\nGrid shrugged. *He's not wrong.* Until recently, Huroi had seemed like a delusional lunatic, the kind of person Grid instinctively avoided. But that was before. Before the title. Before Huroi's insane loyalty had accidentally made Grid stronger.\n\n\"Do you want me to swear at you?\" Grid asked. \"I can if it'll make you feel better.\"\n\nHuroi waved his hands frantically. \"No, no! This is much better. I'm just... glad you're acknowledging me.\"\n\nThe orator scratched his head and laughed. The sound was too genuine. Too earnest. Grid felt something uncomfortable twist in his chest.\n\n*He really does worship me. Like a dog.*\n\nGrid decided to test the limits of that loyalty.\n\n\"Huroi. I get why you think I'm your savior. I pulled you out of prison. But why serve me?\"\n\nHuroi's eyes widened, like Grid had just asked him to explain why the sky was blue. Then his face split into a bright, eager smile.\n\n\"It wasn't just prison,\" Huroi said. He stepped closer, lowering his voice like he was sharing a secret. \"I was stuck in a quest. Couldn't log out for 50 real-time hours. Solitary confinement for 200 hours in-game. It was hell, Grid. True hell. And you saved me from it.\"\n\nGrid's skepticism must have shown on his face, because Huroi kept talking.\n\n\"I know it sounds crazy. Who makes a quest like that? But it's real. The reward was a second class.\"\n\nThe world seemed to tilt.\n\n*Second class.*\n\nGrid's throat went dry. He moved closer to Huroi, slowly, like approaching a skittish animal.\n\n\"S-grade quest?\" Grid's voice came out hoarse. \"The reward was a second class? Actually?\"\n\nHuroi met his gaze without flinching. \"Yes.\"\n\nGrid grabbed Huroi's shoulder. His hand shook. He took a breath, trying to keep his voice steady.\n\n\"The first person to get a second class. That was you?\"\n\nHuroi laughed. The sound grated against Grid's eardrums like sandpaper.\n\n\"Yes, that's right! Hahaha! Are you surprised? I see myself on the news and I still can't believe it. Hahaha! This good luck is all thanks to you, Grid!\"\n\n*Serve me. Forever.*\n\nGrid's grip tightened. He'd dumped most of his stat points into strength over the past three days. Now that strength made Huroi's shoulder creak under his fingers.\n\n\"You should serve me always.\"\n\n\"G-Grid?\"\n\nThe name came out strangled. Good. Grid squeezed harder. His whole body trembled with the effort of not shaking Huroi like a rag doll.\n\n*He got the second class. HE got it. The first one. And I'm the reason why.*\n\nThe unfairness of it burned in Grid's throat. He'd handed Huroi this gift without even knowing. Without getting anything in return. It should have been his.\n\n\"I gave you this!\" Grid's voice cracked. \"I gave you this perfect fortune without even realizing it!\"\n\nHe grabbed Huroi's neck with his other hand.\n\n\"Serve me for the rest of your life! From this day forward, I'm your master and you're my servant! You lucky bastard!\"\n\n\"Can't... breathe...\" Huroi clawed at Grid's hands.\n\n\"Promise me!\"\n\n\"I already... swore... let go...\"\n\nGrid was about to squeeze again when the ground shook.\n\n*Thoom. Thoom.*\n\nThe vibrations traveled up through his boots. Grid released Huroi and spun toward the sound. The orator collapsed, gasping.\n\n*Thoom. Thoom. THOOM.*\n\nSomething massive crested the hill at the village edge. Grid's first thought was *ogre*. But the shape was wrong. Too lean. The thing stood over four meters tall, blue-skinned, with tusks like curved swords.\n\n\"What is that?\"\n\nHuroi wheezed beside him, one hand massaging his throat.\n\n\"Chief...\" Huroi coughed. \"Frostlight Orc Chief. Level 140 field boss. You killed too many of his orcs.\"\n\nThe chief's name floated above its head in brilliant gold text. Behind it, eleven regular frostlight orcs formed a warband.\n\nGrid's survival instincts kicked in. He turned to Huroi.\n\n\"Buy me time while I run.\"\n\nHuroi owed him. Huroi worshipped him. Therefore, Huroi would die here while Grid escaped. The logic was flawless.\n\nSo why was Huroi running after him instead of toward the boss?\n\n\"What are you doing?\" Grid's voice rose to a shout. \"You said I was your master! So stay and fight!\"\n\n\"There's no need!\" Huroi caught up, still rubbing his neck. \"If we work together, we can kill it!\"\n\n\"What?\"\n\nGrid slowed. Huroi's face was flushed with excitement, not fear.\n\n\"My second class is 'Apostle of Justice's Partner'! When I'm with you, all my stats increase by 20%. I'm level 138! You overwhelmed knights at level 83, so together we can handle a level 140 field boss!\"\n\nGrid's feet stopped moving. His brain churned through the math.\n\n*Field bosses are weaker than dungeon bosses. Rankers solo them all the time.*\n\nHe glanced back. The chief was closing the distance with ground-eating strides. The warband fanned out behind it.\n\n*A legendary class and a second class user. Two-man raid. It could work.*\n\nGrid yanked out his dagger. The blade caught the pale northern light.\n\n\"Fine. But all the drops are mine.\"\n\nHuroi blinked. \"What?\"\n\n\"You said you serve me, right?\" Grid pointed the dagger at Huroi's chest. \"So you're not going to steal your master's loot.\"\n\n\"I... no, I just want to fight with you. My class only works when you're around.\"\n\n\"Good.\"\n\nGrid pulled up the party interface and set distribution to 'Party Leader Pickup'. He sent the invite. Huroi accepted.\n\n> [The party invitation has been accepted.]\n\nHuroi's level appeared in Grid's peripheral vision. Level 138. Respectable. Then Huroi saw Grid's level and choked.\n\n\"You're only level 83? How did you kill knights? How are you farming frostlight orcs?\"\n\nGrid shrugged. *Because I'm a legend, you idiot.*\n\n\"Do you have a hidden class?\" Huroi's eyes lit up. \"One of the epic classes? Only three people have those!\"\n\n*I'm better than epic. I'm legendary.*\n\nBut saying that out loud felt like tempting fate. Grid jerked his chin toward the approaching warband.\n\n\"Less talking. More planning. We need to separate the adds from the boss.\"\n\n\"The what?\"\n\n\"The regular orcs. I'll handle them while you keep the chief busy.\"\n\nHuroi paled slightly. \"M-me? You want me to tank the boss?\"\n\n\"You're higher level. And you said you wanted to serve me, right?\"\n\n\"I... yes! Of course! I'll do it!\"\n\nHuroi squared his shoulders and ran toward the chief. When he was twenty meters away, he opened his mouth and unleashed a stream of profanity so creative, so vile, that Grid actually stopped to admire it.\n\nThe orc chief's roar shook the air. It charged Huroi, the eleven regular orcs surging forward in its wake.\n\nGrid intercepted them.\n\n\"Blacksmith's Rage!\"\n\n> [Skill 'Blacksmith's Rage (Lv. 2)' has been activated.]  \n> [Attack Power increased by 15%.]  \n> [Attack Speed increased by 30% for 30 seconds.]\n\n\"Unbreakable Justice!\"\n\n> [Skill 'Unbreakable Justice (Lv. 2)' has been activated.]\n\nGrid's dagger blurred. The first orc's throat opened in a spray of blue blood. The second raised its crude axe. Too slow. Grid ducked under the swing and drove the blade up through its jaw.\n\n*Eleven more to go. And then the boss.*\n\nBehind him, Huroi screamed something incomprehensible. The orc chief bellowed in rage.\n\nGrid smiled. His hands didn't shake anymore.\n\n*Let's see what a legend and his servant can do.*"
}