{
  "id": 700,
  "title": "Chapter 700",
  "content": "Grid didn't approach Satisfy like most players would. His methodology was unconventional—and frankly, inefficient.\n\nAny typical player who earned the Hero King title would have immediately studied the fighting energy resource. They'd test how it accumulated, analyze the stat bonuses it provided, investigate the penalties for dropping below 10 points. They'd master this new mechanic as quickly as possible to maximize its effectiveness.\n\nGrid was different. The detailed information window told him what fighting energy did, so he accepted it without further analysis. As for the penalty below 10 points? Since fighting energy stayed at 10 by default, he didn't worry about it. He figured he'd learn the rest naturally.\n\nAfter cleansing the Behen Archipelago, Grid had focused entirely on Madra. Between gratitude toward the Undefeated King and fascination with his strength, Madra dominated Grid's thoughts. The fighting energy resource had been an afterthought—something to examine after acquiring Madra's swordsmanship.\n\nThis emotional, instinct-driven approach would have been disastrous in most games. But Satisfy valued NPC relationships above cold optimization, and ironically, Grid's unique playstyle had become one of his greatest strengths.\n\n\"Hmm.\"\n\nThe beginner hunting ground outside Reinhardt—where monsters below level 10 spawned and Lord had once played as a child—stretched peacefully before him. A few novice players and woodcutters moved through the area as Grid struck a passing deer.\n\n*Thwack!*\n\nThe creature died instantly. Grid's sword struck four times per second, but only the first blow mattered. The remaining three attacks hit empty air.\n\n\"Damn it...\"\n\nGrid's expression soured. He'd already slaughtered twenty deer, and his fighting energy remained stubbornly at 10 points.\n\n*Think back.*\n\nWhen he'd hunted vampires with Chris, his fighting energy hadn't budged despite killing several ordinary and True Blood specimens. After testing a few more deer, Grid confirmed his suspicion.\n\n*Fighting energy won't increase against weak opponents. I need to find the exact threshold.*\n\nGrid moved to progressively harder hunting grounds, systematically exterminating monsters by type. He summoned the Overgeared Skeletons to help them gain experience in the process.\n\nThe results were clear.\n\n*Any monster more than 30 levels below me won't generate fighting energy.*\n\nFor Grid at level 356, enemies needed to be at least level 326 to matter.\n\n*On the other hand, stronger opponents should generate fighting energy much faster.*\n\nThe pattern supported this analysis. Higher-level monsters increased fighting energy more rapidly. Against enemies 10 levels below him, it took ten landed hits to gain one point of fighting energy. Against equal-level monsters, eight hits. \n\n*What a troublesome resource.*\n\nFighting energy only accumulated when attacks connected—actually striking or being struck. Evasions, blocks, and parries didn't count. Grid's expression darkened as he considered the implications for PvP.\n\nHe ranked third in the unified rankings. Out of two billion players, only two people had officially higher levels than him.\n\n*I can't use this effectively in player combat.*\n\nMost opponents he'd face in the 3rd National Competition would be at least 30 levels lower. Fighting energy would be essentially useless.\n\n\"Damn it.\"\n\nHero King. A title optimized for fighting the strong, conditionally powerful but maddeningly restrictive. He couldn't call it bad—when it worked, it was devastating—but the limitations stung.\n\n*Kyaaaaaah!*\n\nA feminine figure emerged while Grid grumbled, hair writhing like serpents. A degraded medusa—the variety that petrified victims on eye contact.\n\n*I wandered all the way to Rock Forest.*\n\nRock Forest was exactly what its name suggested: a dense woodland studded with boulders. It was considered the hardest hunting ground near Reinhardt, so players rarely ventured here. The degraded medusae appeared in swarms, making them extremely difficult to handle.\n\nParties needed at least 80% petrification resistance plus a Rebecca Church member just to survive. Solo play? Unthinkable.\n\nExcept for Grid.\n\n[You have made eye contact with the degraded medusa! You have been petrified.]\n\n[You have resisted.]\n\n[You have made eye contact...]\n\n[You have resisted.]\n\n[You have resisted.]\n\n[You have res...]\n\n\"????\"\n\nThe five medusae surrounding Grid shared a moment of profound confusion. The stupid humans always froze to stone when gazes met. \n\nGrid launched himself forward with the God Hands and activated **Wave**.\n\n[You have dealt 25,900 damage to the target!]\n\n[You have dealt 28,100...]\n\n*This is perfect.*\n\nDegraded medusae were level 350 elites that provided excellent experience. As status-condition specialists, their physical abilities were weaker than typical elite monsters. Grid built fighting energy rapidly while cutting them down. To speed up the hunt, he equipped Malacus's Cloak.\n\n[Fighting energy has reached 20 points.]\n\nAgainst similarly-leveled enemies, fighting energy accumulated quickly. A purple aura—appearing almost red from certain angles—began radiating from Grid's body.\n\n[You have dealt 32,700 damage to the target!]\n\nAs fighting energy rose, Grid's damage output increased. His hunting speed accelerated with every kill.\n\n*Right.*\n\nGrid remembered his original purpose while carving through Rock Forest's medusae. When fighting energy reached 50 points, he opened his skills window.\n\n\"...Go to a hunting ground. Build up fighting energy, then try the swordsmanship.\"\n\nSticks's meaningful words echoed in his mind.\n\n**[100,000 Army Blockade Sword (Degraded) Lv. 1]**\nDeals 20% damage to all enemies visible in your field of view and inflicts the 'Blockade' effect for 3 seconds. Blockaded targets cannot move or use skills and magic.\n\nSkill Resource Consumption: 5,000 mana, 20 fighting energy.\nSkill Cooldown Time: 30 minutes.\n\n*The skill has activated due to acquiring the fighting energy resource.\n\n**[100,000 Army Massacre Sword (Degraded) Lv. 1]**\nDeals 60% of attack power 30 times to everyone (friend or foe) within a 10 meter radius.\n\nSkill Resource Consumption: 8,000 mana, 50 fighting energy.\nSkill Cooldown Time: 10 minutes.\n\n*The skill has activated due to acquiring the fighting energy resource.\n\n\"...You're kidding me.\"\n\nWhen fighting energy reached certain thresholds, it could be consumed as a skill resource. Grid's face burned with embarrassment.\n\n*I could have figured this out immediately if I'd just checked from the beginning!*\n\nAll that needless worry. All that wasted time. Grid was forced to confront his own foolishness. Shame turned hot in his chest.\n\n\"Damn it... I'm angry.\"\n\nGrid took out his frustration on the innocent medusae! He activated **Quick Movements** and tore through them.\n\n*Kyak!*\n\n*Kiyak!*\n\nThe screams of medusae—creatures that symbolized terror for ordinary players—echoed through Rock Forest.\n\n[Fighting energy has reached 70 points.]\n\nFinally, Grid had gathered the resources needed for the 100,000 Army Swordsmanship.\n\n\"**Fly**.\"\n\n*Whoosh!*\n\nGrid didn't hesitate. He wore Braham's Boots and soared into the sky.\n\n\"Eight, fourteen... twenty, thirty-two...\"\n\nFrom his aerial vantage, Grid counted over thirty medusae visible below. They'd smelled blood and kept gathering as they prowled Rock Forest. A wicked smile crossed Grid's face. He spoke in the Undefeated King's cadence.\n\n\"Watch. This is my sword dance.\"\n\n*Kuooooh!*\n\nThe purple aura around Grid's body erupted like a storm. The effect was so intense that Grid's silhouette disappeared within the violet maelstrom.\n\n\"**100,000 Army.**\"\n\nGrid's eyes shone sharp within the raging storm. He moved his sword.\n\n\"**Blockade Sword.**\"\n\n*Crack!*\n\n*Crackcrackcrackcrack!*\n\nA festival erupted. Purple fighting energy rained down from Grid's blade like firecrackers. Every medusa on the ground became a target. Everything in Grid's *sight* was struck by fighting energy.\n\n*Kiik!*\n\n*Kuaaaaaaah!*\n\nThe 100,000 Army Blockade Sword didn't deal devastating damage. The medusae struck by the fighting energy firecrackers didn't suffer severe physical harm. But the blockade effect was another matter—the ultimate crowd control that disabled movement, skills, and magic for three full seconds. The medusae froze like stone statues. The creatures who turned others to stone found themselves victims of their own specialty.\n\n\"**100,000 Army.**\"\n\nGrid descended to the ground.\n\n\"**Massacre Sword.**\"\n\n*Death!*\n\n*Thunk.*\n\n*Thunkthunkthunkthunk!*\n\nThirty attacks per second. The target was the medusa directly in front of Grid—and every medusa within a 10 meter radius.\n\n*Bang!*\n\n*Crackcrackcrackcrack!*\n\nSplash damage erupted everywhere! Black flames exploded around the medusae throughout Rock Forest.\n\n[You have dealt 15,380 damage to the target!]\n\n[You have dealt 16,900 damage to the target!]\n\n[You have dealt 18,700 damage to the target!]\n\n[You have dealt...]\n\nGrid had favored **Link** ever since creating the Enlightenment Sword for two reasons. First, the high number of strikes maximized the chance of triggering black flames. Second, the damage amplification effect stacked fully with each consecutive hit on the same target. Once Link connected, Grid's attack power instantly doubled.\n\nBut 100,000 Army Massacre Sword was even better. Every target in range received 30 strikes simultaneously, meaning *all of them* suffered the full 100% damage amplification.\n\n\"Kuk...! Kahahahahaha!\"\n\nEcstasy! Pure pleasure!\n\nGrid burst out laughing. Damage notification windows updated hundreds of times across his vision. Thirty hits against dozens of enemies at once—the windows scrolled at the speed of light.\n\n\"The finishing touch...!\"\n\nGrid rode the euphoria of the hunt! Just as he moved to finish off the dying medusae, he suddenly froze.\n\n[Fighting energy has dropped to 0.]\n\n[A penalty has occurred. Fighting energy will not recover for 10 minutes and all stats will drop by 50%.]\n\n\"You've got to be—\"\n\nGrid had actually used the skills after securing only 70 fighting energy specifically to test the penalty. He'd judged the medusae suitable test subjects. Of course, he'd never imagined the penalty would be this severe when making that decision.\n\n*Kyaooooh!*\n\n\"H-Hik...!\"\n\nAll stats reduced by half! Even Grid couldn't handle dozens of medusae in this condition. He was still wearing Malacus's Cloak, so more medusae kept gathering.\n\n\"G-God Hands! Noe! Randy! Overgeared Skeletons!\" \n\nGrid went pale as he frantically tore off the cloak and summoned his pets. Noe and Randy didn't even get a chance to greet him after so long apart.\n\n\"Distract them while I run away!\"\n\n\"...\"\n\nHell's best demonic beast—a Memphis with exceptional learning abilities. As he'd served Grid, who'd once been verbally abusive, Noe had learned to speak eloquently. But Noe had never cursed. A noble being like him shouldn't meet an opponent who'd make him forget his dignity and resort to vulgar profanity.\n\nUntil this moment.\n\n\"My damn master...\"\n\n\"...\""
}