{
  "id": 701,
  "title": "Chapter 701",
  "content": "[Your Memphis, Noe, has injured a degraded medusa.]\n[Your Memphis, Noe, has injured a degraded medusa.]\n[Your Memphis, Noe, has leveled up!]\n[The Mysterious Forest's Doppelganger, Randy, has injured a degraded medusa.]\n[Doppelganger Randy has leveled up!]\n[Overgeared Skeleton One has been petrified.]\n[Through repeated petrification exposure, Overgeared Skeleton One's petrification resistance has increased by 1.]\n[Overgeared Skeleton Two has been petrified.]\n[Through repeated petrification exposure, Overgeared Skeleton Two's petrification resistance has increased by 1.]\n[God Hand (4)'s experience has increased by 0.01%!]\n\n'Wait... is this actually efficient?'\n\nGrid stood amid the stone statues of Rock Forest, watching another medusa crumble to ash under his assault. What had started as a desperate survival tactic—summoning his pets—had turned into an unexpected training opportunity.\n\n'Most of these things were already half-dead from my Massacre Sword. Noe and Randy are just cleaning up the scraps.'\n\nThe Overgeared Skeletons were another story. Still below level 50, they were hopelessly outmatched by the elite monsters. Not a single point of experience came their way. Yet their adaptive nature was proving valuable in other ways—every time a medusa's gaze turned them to stone, their resistance grew fractionally stronger. Ten minutes of repeated petrification had already begun building immunity.\n\n[Fighting energy has reached 10.]\n[All stats restored to base values.]\n\nThe penalty lifted. The crippling zero that had haunted Grid's fighting energy for ten agonizing minutes climbed back to its resting state of 10, and with it, his stats surged back to normal.\n\n\"Right then. Time to give the kids some proper training.\"\n\nStronger pets meant a stronger Grid—a simple equation. He pulled Malacus' Cloak back over his shoulders, and the bloody reek billowed out like a beacon. Fresh medusae began converging from deeper in the forest. Randy's panicked voice cut through the sound of slithering scales.\n\n\"Randy doesn't like this! Too many! So scary!\"\n\n***\n\n[Fighting energy has reached maximum capacity.]\n[Strength, stamina, and agility increased by 50%.]\n\n\"Pagma's Swordsmanship—Transcend!\"\n\n*Peng!*\n\n*Pe-pe-pe-peng!*\n\nAt peak fighting energy, Grid's body became a weapon of devastating efficiency. Transcend converted every strike into a ranged attack, and he unleashed four per second. The medusae couldn't adapt, couldn't retreat, couldn't survive. Two hours of relentless grinding had crystallized an important lesson about his Hero King title.\n\n'Seal the 100,000 Army Swordsmanship. At least for now.'\n\nThe math was brutal but simple. Burning through 50 points of fighting energy to use Madra's techniques versus maintaining maximum capacity for a permanent 50% stat boost while using Pagma's Swordsmanship? The answer was obvious.\n\n'Though... there'll probably be situations where I need that overwhelming power.'\n\nStill, the cost stung. Grid had tested the Ring of Absurdity, hoping its \"reduced resource consumption\" would apply. It hadn't. The ring lowered mana costs, but fighting energy remained untouched—too unique a resource to fall under standard reductions, just like demonic power. Even the \"all stats increase\" bonuses from crafting high-level items ignored special stats like those.\n\n'I need to be surgical about when I use the 100,000 Army techniques.'\n\nThe real frustration was the accumulation mechanic. Fighting energy only built through single-target damage. Land a sweeping attack that carved through multiple enemies? Nothing. The restriction made sense from a balance perspective—Grid would be unstoppable otherwise—but it chafed nonetheless.\n\nHe dismissed the Enlightenment Lightning Sword back to his inventory. Rock Forest stretched empty around him; at maximum fighting energy, he butchered medusae faster than they could respawn.\n\nGrid retreated to the safety zone and retrieved Madra's diary. With fighting energy restored and the prerequisites for 100,000 Army Swordsmanship met, the sealed chapters should finally be accessible.\n\n'Let's see what else you have to teach me, old king.'\n\nThe moment he cracked the binding, light consumed his vision.\n\nWhen it cleared, Pagma stood before him.\n\n***\n\n\"Outrageous! Unconscionable! You *dare* strip me of rest and bind me to servitude?! A thousand deaths wouldn't be punishment enough for you!\"\n\nResurrected. Made undead. Chained to guard some monument—all without permission, without choice. Madra's rage was a living thing.\n\n\"100,000 Army Massacre Sword!\"\n\n*Chak.*\n\n*Cha-ka-ka-kak!*\n\nHe hurled his technique at Pagma with murderous intent. This was the swordsmanship that had decimated entire imperial legions, that had made him a legend.\n\nIt accomplished nothing.\n\n\"...!\"\n\nHis blade refused to bite. His body rebelled against his will, joints locking, muscles redirecting his strikes away from their target. Even as Madra screamed internally, his sword simply... avoided Pagma entirely.\n\n\"Did you think I'd resurrect you without precautions?\" Pagma's voice was clinical, devoid of sympathy. \"I am your master now. You cannot harm me.\"\n\n\"...\"\n\nThe truth settled like lead in his chest. Death knight. The term carried implications Madra was only now beginning to understand. Instincts that weren't his whispered submission. Urged obedience. Made him *want* to serve.\n\n\"Guard this place against the great demons. That is your purpose.\"\n\nThat was all. Pagma turned and left. Madra remained, alone with his fury and the beginning of an eternity in isolation.\n\n***\n\n\"...Christ.\"\n\nGrid's hands trembled as he emerged from the memory. Experiencing Madra's resurrection firsthand—feeling that cocktail of rage, violation, and despair—had left him shaken. The mental echo of being trapped in a body that no longer obeyed your soul was horrific.\n\n'I don't want to read more of this.'\n\nThe thought of experiencing Madra's solitude, years of it, possibly decades... Grid's finger hovered over the diary, reluctant to turn the page.\n\nBut he owed the old king this much. Madra had chosen Grid, trusted him with this legacy. The least he could do was bear witness.\n\nHe opened the third chapter.\n\n***\n\n**Third Chapter**\n\nI have lost count of the days since my resurrection. The undead do not sleep. \"Day\" has become a meaningless concept—there is only the endless present.\n\n\"...\"\n\nThis island is barren. Empty. Was I alone for days? Years? I cannot tell anymore.\n\nSolitude erodes the self. I feel myself dissolving.\n\nI wish I could close my eyes and never open them again.\n\nI wish thought itself would cease.\n\nI pray for oblivion.\n\n***\n\n\"God...\"\n\nThe chapters blurred together after that. Four. Five. Six. An endless parade of isolation, of a mind slowly fracturing under the weight of eternity. Grid felt tears prick at his eyes. Even knowing Pagma had done this for the greater good, to protect the world from demonic invasion—even knowing that—he couldn't help but resent the man.\n\nThen the seventh chapter arrived, and everything changed.\n\n***\n\n**Seventh Chapter**\n\n\"So this is the final island.\"\n\nA great demon. The first visitor in... how long?\n\n\"I am Leraje, the 10th Great Demon.\" The figure wore an elaborate hat that shadowed half his face, revealing only pale skin and crimson lips. \"One of the thirty-three rulers of Hell itself. I am a sovereign of both power and cunning—as evidenced by how *easily* I reached the sixty-sixth island. Heh.\"\n\n\"...\"\n\nContact with another sentient being. After decades of silence. Madra should have felt *something*—relief, joy, anything. Instead, there was only hollow irritation. Of course his first visitor would be an arrogant demon who loved the sound of his own voice.\n\nLeraje continued his monologue without pause.\n\n\"Struggle is my domain. I have never failed to defeat an opponent. Take the guardians of the previous islands—pathetic. The Demon Slayer Alex, terror of Hell? He lasted mere minutes. Hah!\"\n\n\"...\"\n\n\"Ah, forgive me. Death knights lack true ego, don't they? No point in conversation. Still—\" Leraje's eyes gleamed as they fixed on Madra's blade. \"—judging by that sword, you must be Sword Saint Muller. The one who sealed Hell Gao and his ilk. I've wanted to meet you for *ages*. Time to prove I surpass Hell Gao in every way.\"\n\n\"I am not Muller.\"\n\nHow *dare* this creature mistake his identity? As Madra spoke, Leraje's eyebrows shot up.\n\n\"Oh? A death knight with speech? Fascinating. You're not Muller? Then who—\"\n\n\"Madra. Former King of Lubana.\"\n\n\"Madra...?\" Leraje's expression soured. \"I've heard the name, yes. Disappointing. I was hoping to face Muller on the final island. This battle will be anticlimactic.\"\n\n\"...\"\n\nWhite-hot fury ignited in Madra's chest. *This* was the threat Pagma feared? *This* posturing fool?\n\n\"200,000 Army Crushing Sword.\"\n\n\"...!\"\n\nYes, Madra had no purpose. No hope. No reason to move beyond standing sentinel on this cursed rock. His second life was meaningless.\n\nBut his skills? Those remained razor-sharp.\n\nTerror flooded Leraje's eyes as the technique descended.\n\n***\n\n[Your current abilities are insufficient to replicate Madra's swordsmanship. You cannot proceed beyond this point in the seventh chapter.]\n[To continue reading the seventh chapter, you must learn Madra's swordsmanship.]\n[Acquired: Swordsmanship Textbook - 200,000 Army Swordsmanship]\n[Death Knight Madra's diary sealed until you master 200,000 Army Swordsmanship.]\n\n[**Swordsmanship Textbook: 200,000 Army Swordsmanship**]\n**Rating:** Legendary\nA manual recording the fundamentals of Madra's legendary techniques. However, these are the degraded versions developed after his resurrection as a death knight—notably weaker than his living prime.\n\nContains one technique: **200,000 Army Crushing Sword (Degraded)**\n\n**Learning Requirements:** Recognition by Madra. Level 399 or higher.\n\n\"A legend on par with Muller.\"\n\nBraham's assessment made perfect sense now. Madra's influence had been geographically limited to Lubana, keeping his fame below other legends, but his actual skill was monstrous. The proof was in Leraje's reaction—a great demon who had destroyed Lantier, Alex, Kruger, Gis, and Povia without breaking a sweat had *frozen in fear* at Madra's swordsmanship.\n\n\"So after 100,000 Army Swordsmanship, there's 200,000 Army Swordsmanship...\"\n\nGrid's mind raced ahead. Would there eventually be a One Million Army Swordsmanship? The possibility was tantalizing.\n\nThen he checked the level requirement and his excitement crashed.\n\n\"Level 399. That's... years away.\"\n\nNothing to be done about it. Some treasures required time to claim.\n\n'Back to Reinhardt, then.'\n\nGrid closed the diary, tucked it into his inventory, and stood. The Rock Forest still needed clearing, but he'd accomplished what he came for.\n\nFor now, that was enough."
}