{
  "id": 703,
  "title": "Chapter 703",
  "content": "# King's Quest\n\nGrid stared at the notification with mounting dread. After claiming his throne, the system had generated a series of large-scale quests befitting his new status. He'd already completed the first—King's Role (1)—which rewarded him with the method to craft a King's Sword. Useful, certainly, but the quest itself had been exhausting.\n\nNow, having returned from the Behen Archipelago at level 357, he'd finally met the requirements for the second quest. The requirements that made his stomach sink.\n\n> **[The King's Role (2)]**\n> \n> You have experienced the lives of the people and learned their suffering.\n> \n> Please resolve the troubles of the people.\n> \n> **Quest Clear Conditions:** Give the necessary help to 5,000 people.\n> \n> **Quest Clear Rewards:** Political Power stat will open. The next linked King's Quest.\n> \n> * It counts if other members of the royal family help the people.\n\n\"You've got to be kidding me.\"\n\nNot a hundred. Not even a thousand. *Five thousand* people. At ten people per day, he was looking at five hundred days minimum—and that assumed he never had to leave the kingdom for other business. The math was depressing.\n\nGrid opened his mouth to curse, then caught himself. Complaining wouldn't change anything. Besides, after grinding through King's Role (1), he understood the quest's purpose. It was a reconstruction guide, a framework for building his fledgling kingdom into something sustainable. Each person he helped would strengthen the Overgeared Kingdom's foundation.\n\nThe problem remained: *time*.\n\n\"This is going to take *years*...\" Grid muttered, rubbing his temples.\n\nThe notification flashed.\n\n> [The royal princess Ruby has already helped more than 5,000 people. The condition for the King's Role (2) quest has been fulfilled.]\n> \n> [The King's Role (2) quest has been completed.]\n> \n> [As a quest reward, the political power stat will open.]\n> \n> [You will be able to proceed with the next King's Quest 'Choice' at level 370.]\n\nGrid blinked. Read it again. Question marks might as well have materialized above his head.\n\n\"What?\"\n\nHow did Ruby—wait. He reread the fine print: *It counts if other members of the royal family help the people.*\n\n\"No way... Her work as Saintess counted?\"\n\nOf course, it couldn't be her entire history of good deeds. Only actions performed after Grid established the Overgeared Kingdom and Ruby officially joined the royal family would register. But she'd *still* already surpassed five thousand...\n\nHe thought back to the reconstruction efforts after the war. Ruby had been everywhere—healing the wounded, blessing crops, organizing relief efforts. She'd been the single greatest contributor to the kingdom's recovery.\n\n\"My sister is incredible.\" A genuine smile broke across Grid's face. \"I should thank her when I log out... Actually, no. She'd probably hit me if I got too sappy.\"\n\nStill. His sister was amazing.\n\n---\n\nMeanwhile, in Valhalla, Ares wiped sweat from his brow.\n\n\"Finally! Number three hundred ninety-nine!\"\n\nHaving reached the level requirement before Grid, he'd jumped into King's Role (2) immediately. For weeks now, he'd been trudging through his capital, performing \"good deeds\" with gritted teeth.\n\n\"This is *exhausting*!\" he groaned.\n\nMore than once, he'd nearly snapped and punched someone out of sheer frustration. The monotony wore at him. The constant neediness of his subjects grated. But Ares forced himself to maintain perspective. The people's gratitude made it worthwhile. And besides, Grid—who'd only just hit level 350—would be suffering through the exact same hell.\n\n'He's probably managed what, thirty people by now? Maybe forty?' Ares grinned wickedly. 'Poor bastard.'\n\nHe couldn't help but laugh.\n\n\"Hang in there, Grid! We're in this together! Hahahaha!\"\n\n---\n\n**Political Power**\n\n> Improves efficiency of various domestic activities.\n> \n> * The higher the number, the higher the effect.\n\nGrid examined the new stat thoughtfully. Political Power was rare—typically held by politicians, certain hidden classes, royalty, and high-level merchants. Rabbit possessed significant Political Power, which made him invaluable for domestic management. Appoint someone with high Political Power as head of market development, and the market would flourish at accelerated rates.\n\nIt was distinct from Intelligence. Political Power represented practical governance ability—the capacity to manage people, resources, and systems effectively.\n\n'Lauel only unlocked this stat after becoming Prime Minister,' Grid mused. The man had been running the Overgeared Guild and kingdom's internal affairs for *years* before achieving it. Political Power was notoriously difficult to obtain.\n\nYet Grid had it now. The implications settled over him like a mantle. With this stat, he could personally handle administrative tasks that previously would have required advisors. He could *govern*, not just rule.\n\n'I'm really a king now.'\n\nThe weight of it struck him unexpectedly. Moved by the realization, Grid headed to the smithy. He had work to do—designs for the mass-produced Lantier Cloaks needed completion, and he wanted to craft a proper crown for himself.\n\n---\n\n\"This should work.\"\n\nDesigning the mass-production version of Lantier's Cloak proved straightforward enough. Grid based the pattern on the original, then substituted expensive materials with cheaper, more accessible alternatives. The result wouldn't match Lantier's legendary cloak, but it would provide solid stealth capabilities for his assassins.\n\n\"Khan, distribute this design to the blacksmiths. The advanced smiths should be able to interpret it easily enough, right?\"\n\nKhan examined the drawing, weathered hands steady. \"I believe so, yes.\"\n\nBut Grid barely heard the response. His attention had fixed on the deepened lines creasing Khan's face. Just a few months ago, those wrinkles had been less pronounced. The old blacksmith's health gauge—visible to Grid thanks to their deep friendship—sat noticeably lower than before.\n\n*Time is running out.*\n\nThe thought pierced Grid like cold steel. Human lifespans weren't infinite, and NPCs aged faster than players. He wanted Khan to live forever. The idea of losing him—\n\nKhan noticed Grid's expression and thumped his own chest firmly. \"See this steel body? This old man is perfectly fine. Your Majesty needn't worry.\"\n\nHis health gauge dipped from the self-inflicted blow.\n\nGrid's chest tightened painfully, but he forced a smile. Khan didn't need to shoulder Grid's fear.\n\n\"I'm not worried about your health. Why would I be, when I know how strong you are?\" Grid's tone came out teasing. \"I just think the smell of confirmed bachelorhood is getting worse.\"\n\n\"Hoh, is that so?\"\n\nKhan sniffed at his sleeve with exaggerated concern, playing along.\n\n\"Haven't you considered remarrying? A family might ease the loneliness.\"\n\nKhan had been alone for decades—his wife and son long dead. Grid feared the old man would die isolated, his passing unnoticed for days. The thought made him sick.\n\nBut Khan just smiled, bright and genuine.\n\n\"How could I be lonely? I have a family.\"\n\nThe words hit Grid like a hammer blow to the heart.\n\n---\n\n'How do I intentionally attach specific stats to items?'\n\nBack at the anvil, Grid contemplated his next project. One benefit of the First King title: increased equipment slots. He could wear both a helmet *and* a crown simultaneously. But before crafting a new crown, he needed to solve a problem.\n\nStamina. Specifically, how to forge items that granted Stamina.\n\n'Stamina increases defense and health, plus it affects health recovery rate,' Grid reasoned. 'It might even influence lifespan...'\n\nThat was the core of it. If he could create stamina-boosting items for Khan, maybe—just maybe—the old blacksmith would live longer. It was probably wishful thinking, but Grid had to try.\n\nBeyond Khan's needs, Grid recognized his own deficiencies. His defense stat was already high enough that further increases yielded diminishing returns. Worse, defense didn't fully apply against higher-level opponents, and many enemies possessed defense-penetrating abilities. Raising his total health pool made more sense strategically.\n\nWhich meant he needed help.\n\n\"Sticks!\"\n\nGrid abandoned the smithy and sprinted to Overgeared Academy, once again dependent on the sage's wisdom.\n\n\"Is there a way to make equipment that raises Stamina?\" he asked without preamble.\n\n\"You'll need to use Alchemy.\"\n\n\"...Alchemy.\"\n\nGrid's expression soured. The memory of Iyarugt gaining that ridiculous \"Coolness\" stat still rankled.\n\nSticks raised a patient hand. \"I know you distrust it. Alchemy has notoriously high failure rates. But when it *succeeds*, the results are powerful. Rather than avoiding it entirely, learn to leverage it. You'll need to invest heavily, of course.\"\n\nHigh risk, high reward. That was Alchemy's nature. And Grid's luck stat was *atrocious*.\n\n'But I can't keep dodging this forever.'\n\nHe'd already poured resources into Reidan's alchemy facility, aiming to transform the city into a second Talima. Avoiding the system because of one embarrassing outcome would be cowardice.\n\n'Time to commit.'\n\nDecision made, Grid left the academy and whispered to Lauel.\n\n—*What level is Reidan's alchemy facility at?*\n\n—*Intermediate Level 8.*\n\n—*Still? Wasn't it Intermediate 8 months ago?*\n\nReidan's facility had been producing super restorative potions steadily. Grid had assumed the constant work would raise its level significantly.\n\nLauel's response carried a note of frustration.\n\n—*To effectively level the facility, we need to focus on development rather than production. But development costs money. Recently, we've been unable to fund the alchemy research because all available resources go to the Empire's tribute.*\n\n—*Damn Empire...*\n\nAccording to Sticks, the facility needed to reach at least Intermediate Level 9 to reliably attach stat bonuses to items. Once again, the Saharan Empire's extortion was strangling the Overgeared Kingdom's growth.\n\nGrid's resentment crystallized into something sharper.\n\n—*Is there a way to hurt the Empire?*\n\n—*Yes. One comes to mind.*\n\nOf course Lauel had an answer ready.\n\n—*What is it?*\n\n—*Go to Valhalla. The Emperor won't forgive Ares for sheltering the Undefeated King's descendant. He'll definitely send troops. Soon.*\n\n—*You want me to help defend? Won't that escalate things?*\n\n—*This is different from the Belto situation,* Lauel clarified.\n\n—*If Overgeared officially allies with Valhalla against the Empire, we'll be marked as enemies. The consequences would be severe. But...*\n\n—*What?*\n\n—*Go alone. Hide your identity.*\n\nGrid paused.\n\n—*As Your Majesty noted, official involvement would make Overgeared the Empire's next target after Valhalla. So help Valhalla secretly. While you're gone, I'll finalize plans for attacking the vampire cities.*\n\n—*Heh... This should be fun.*\n\nGrid's shoulders shook with suppressed laughter. The chance to stab the Empire in the back was too delicious to pass up.\n\n'I'll make them regret this.'\n\nBut Lauel's next whisper carried a warning note.\n\n—*You understand that hiding from the Empire means more than covering your face, right? You can't use Pagma's Swordsmanship. Too recognizable.*\n\n—*...Obviously. I'll just use basic attacks.*\n\n—*...You hadn't thought of that, had you? Exercise restraint. Based on the situation, Valhalla won't actually fall—the Empire is just flexing. Don't get carried away.*\n\nGrid winced slightly. Lauel knew him too well.\n\n---\n\nAt the same time, in Titan...\n\n> **[Secret Mission]**\n> \n> **Difficulty:** SSS\n> \n> You have received a secret mission from Sword Duke Limit.\n> \n> To prevent Kyle from accumulating achievements, provide covert support to Valhalla and engage Kyle directly.\n> \n> The imperial household has yet to identify the members of the Rose Knights, so you need not worry about discovery.\n> \n> However, avoid killing Red Knights when possible.\n> \n> **Quest Clear Conditions:** Kyle's death or retreat.\n> \n> **Quest Clear Reward:** Death Ruler's Staff. Affinity with Sword Duke Limit +50.\n\n\"Kehehehe, what kind of quest is *this*? I get to help Ares fight one of the Five Pillars?\"\n\n\"You should refuse. Kyle may be the weakest of the Five, but—\"\n\n\"Why would I refuse something this *interesting*? Kehehehe! Hahahaha!\"\n\n\"...\"\n\nAnd so another figure, unidentified, also set course for Valhalla."
}