{
  "id": 704,
  "title": "Chapter 704",
  "content": "# Chapter 241: The Battle of Liberon Forest\n\n[The Saharan Empire has declared war on the Valhalla Kingdom!]\n\n[The relationship between the Valhalla Kingdom and the Saharan Empire has become 'hostile'!]\n\n[There are various restrictions on exchanges and activities between the two nations!]\n\nThe notifications blazed across every player's vision throughout Valhalla. Yet confusion was absent. Fear, even less so. From the moment Ares had sheltered the Undefeated King's heir—or perhaps when he'd first refused the Empire's tribute—every citizen had been preparing for this day.\n\n\"I won't lie to you!\" Ares' voice cut through the assembled crowd like a blade. His presence on the capital square's raised platform commanded instant silence. Authority and confidence radiated from his very stance. \"An infinite war awaits us! This conflict won't end until one side lies broken!\"\n\nThe God of War had thrown down the gauntlet. Battlefields were his proving ground, war his birthright. Through conflict, he would forge himself and his army into something greater—and Valhalla would be reborn in fire.\n\nBeside him, Oasis frowned. *Where does this confidence come from?*\n\nSince joining Valhalla, Oasis had been cataloguing the kingdom's strength. The numbers didn't lie. After absorbing Belto, they'd swelled to seven hundred thousand citizens—but only fifty thousand soldiers. Against the Empire's ten million strong military? The math was brutal. Days. Maybe less. That's how long Valhalla would last.\n\nAres descended from the platform, catching Oasis' troubled expression.\n\n\"My armies gain two hundred percent bonus experience during wartime.\" His grin was sharp. \"And I possess Plundering—I can strip enemy territories of food, wealth, and even troops. Used correctly, Valhalla doesn't just survive. We *thrive*.\"\n\nWar wasn't just Ares' specialty—it was his nature. Persistence incarnate.\n\n\"Still.\" He shrugged. \"Fighting the Empire first isn't ideal. I'd have preferred building strength against smaller kingdoms.\"\n\nBut that path was closed. The Empire's tributary system had poisoned the well. Touch one vassal state, face imperial wrath. The Overgeared Kingdom had been his initial target.\n\nUntil he'd chosen alliance over conquest.\n\n\"I understand your abilities,\" Oasis pressed. \"But the Empire could crush us with overwhelming force before your powers matter.\"\n\nAres laughed—excited, almost manic. \"You think I'm gambling blind? The Empire's fractured. Multiple factions tearing at each other. They *can't* focus on us.\"\n\n\"The Red Knights—\"\n\n\"Are weakened.\" That meaningful smile returned. \"Intelligence confirms the First and Second Knights are under probation. The Fourth only deploys for special circumstances. The Third and Fifth alone?\" He waved dismissively. \"They can't stop my army.\"\n\nThere was more. The path from Saharan to Valhalla forced the Empire through Liberon Forest—a doppelganger-infested hell of difficult terrain. Ares planned to exploit every tactical advantage.\n\n\"The Empire will feed my army's growth. Just watch.\"\n\n***\n\n\"Liberon ahead.\"\n\nFifty thousand troops stretched across the landscape like a living tide. At the vanguard rode the Red Knights themselves—the continent's apex warriors, symbols of imperial might made flesh.\n\n\"Larger than I expected.\" The white-haired man surveying the forest was Lorex, Third Knight. Past forty, scarred, competent. Beside him stood Kyle of the Five Pillars—an unsettling figure with alabaster hair, eyebrows, skin. Even his lips and eyes carried that ghostly pallor.\n\n\"Forests favor traps and ambushes...\" Kyle studied the dense foliage.\n\nBasic tactics. The undergrowth was thick, the silence absolute—no birdsong, no animal sounds. Lorex chuckled without respect.\n\n\"Liberon isn't ordinary forest. Doppelgangers infest it so heavily that maintaining traps would be nearly impossible.\"\n\n\"But it's enemy territory. Won't they know the terrain better?\"\n\n\"No.\" Lorex shook his head. \"The real threat is climate. Extreme heat and humidity make it virtually impossible to work or wait inside—especially for armored soldiers.\"\n\nWhich was why he'd halted the march. Four and a half hours minimum to traverse at standard pace. Better to rest the troops first.\n\n*Clap. Clap. Clap.*\n\nKyle applauded, grinning. \"Sir Lorex earns his reputation. Strategic positioning, careful evaluation—I'm impressed.\"\n\n\"This is...\" Lorex scratched the back of his head, expression turning cynical.\n\nKyle was one of the Five Pillars—untested, raised high on imperial favor alone while the Red Knights bled for their standing. Lorex had *hated* hearing Kyle would command this campaign in Mercedes' place.\n\nBut reality proved different. Kyle showed humility, respected the knights, delegated authority despite his appointment. \n\n*The Pillars lack field experience. His Majesty elevates them regardless.*\n\nKyle was simply following orders. Limit had warned against trusting him, but open hostility seemed unnecessary now.\n\nLorex cleared his throat. \"Break's over! Into the forest!\"\n\n***\n\n\"They're coming.\"\n\nLiberon Forest. Abandoned wasteland under Belto's rule, but Ares had transformed it into a strategic stronghold after conquest. His ace? Every Valhalla soldier possessed Climate Adjustment, allowing them to operate in the forest's punishing environment.\n\nThey'd trained here. Learned the terrain. And now they waited.\n\n\"The Red Knights have exceptional detection abilities.\" Ares' voice was barely a whisper. \"Let them penetrate deep. Strike when I give the signal.\"\n\nSilent nods rippled through the hidden forces. No sound, no movement. They were ghosts.\n\nThree hours later, exhaustion had set into the imperial army's bones. The heat was suffocating, the humidity oppressive. They stumbled through without proper caution.\n\n\"Now!\"\n\n\"*WAAAHHHHH!*\"\n\nValhalla soldiers erupted from the undergrowth. Arrows darkened the sky. Swords flashed. The imperial formation shattered.\n\n\"W-What—\"\n\n\"*Kuaack!*\"\n\n\"Ambush!\"\n\nImperial soldiers turned to gray light. Golden pillars of experience erupted around Valhalla troops—level ups cascading through the ranks. Each one made them stronger.\n\n\"Press the attack!\" Ares roared.\n\nHis commander buffs stacked with combat momentum. The Valhalla army was growing more powerful in real-time. Imperial confusion spiraled into panic.\n\n\"*AREEEES!*\"\n\nLorex charged through the chaos like a juggernaut. He'd fought this man before. Won before. Five strikes last time—he'd crush him in five strikes again.\n\n\"Your head is *mine*!\"\n\nHis axe carved a half-moon arc through the air. Last battle, this strike had nearly killed Ares leading ten thousand troops.\n\nBut Ares now commanded fifty thousand. Twenty-five percent stat increase. Additional attack and defense bonuses stacking on top.\n\n\"I'm not who I was!\"\n\n*PEEEONG!*\n\n\"*What?*\"\n\nHis axe *stopped*. Lorex stared in disbelief. The man who'd crumpled under one blow months ago was now holding his ground. He unleashed a flurry.\n\n\"Try blocking *this!*\"\n\n\"Disgusting bastard—\" Ares' hand went numb from the defense. No way he could tank another. He dove aside. \"Scott! Luck! Pin him down!\"\n\n\"Both of us, go!\"\n\n\"*Got it!*\" Luck's shield slammed into Lorex's skull from behind, yanking aggro from Ares. Scott's sword followed with advanced skills.\n\n*Peeeng!*\n\nThe attacks barely dented Lorex's health. Third Knight. Weaker than the First and Second, true—but still beyond what players could handle alone.\n\n*KWAJAK!*\n\n*KWA-KWA-KWANG!*\n\nLorex's axe sent both men flying. But the Ares Army didn't falter. They'd planned for this.\n\n\"Swarm him!\"\n\nTop rankers converged. Dozens of third advancement users attacked in coordinated waves. Lorex found himself occupied.\n\n\"Aid Sir Lorex!\" The Fifth Knight and other Red Knights tried breaking through.\n\n\"Now!\" Ares bellowed. \"Trigger the trap!\"\n\n\"—!!\"\n\nThe ground vanished. A massive pit swallowed the Red Knights whole—twenty meters deep, two weeks in the making.\n\n\"Puahahat! Did you think I'd face monsters like you unprepared—*gasp!*\"\n\nAres' laugh died. The Fifth Knight *jumped* from the pit's bottom. Twenty meters. One leap. Superhuman.\n\n\"Are you *kidding me?!*\"\n\nThis was bad. Ares had planned to massacre the army while the knights were trapped. Now—\n\n*PENG!*\n\n*PEPEPEOK!*\n\nExplosions ripped through the imperial camp. Everyone froze—Red Knights, Ares, both armies—staring at the source.\n\n\"What in the—\"\n\nRed lightning fell from the heavens. It punched through armored bodies, carved trenches through the military formation.\n\n\"A demon king...?\"\n\nBlack flames engulfed the entire imperial position. Splash damage rippled outward in waves. Hundreds died. Then hundreds more. The attack power was *absurd*.\n\n\"W-What kind of monster has no mana restrictions?!\"\n\nWhat insane creature could spam such devastating skills infinitely? Ares swallowed hard. He hadn't known *anything* was sleeping in Liberon Forest.\n\n\"Ares!\" Scott escaped Lorex in the confusion. \"We can't let that reach our army! Retreat!\"\n\nThe mysterious entity was cutting through imperial forces. Soon it would reach them. Ares came to the same conclusion—he couldn't see what it was through the chaos, but the devastation spoke volumes.\n\n\"Full retreat! *MOVE!*\"\n\nLorex and the Red Knights were struggling to maintain control. Perfect timing. Ares wheeled his horse without hesitation.\n\nThen the entity emerged from the smoke and ruin.\n\n\"I am the Basic Attack King.\"\n\nThe creature who'd annihilated an army stood before them—and called himself that."
}