{
  "id": 705,
  "title": "Chapter 705",
  "content": "The Overgeared Kingdom's neutrality was a carefully maintained facade. They'd ceased their tribute to the Saharan Empire—even claimed two tributaries of their own—and to the uninformed, they might have appeared a rising power. But Grid knew better. The reality was far grimmer: they were surrounded, hemmed in on all sides by hostility. If the Empire was a prowling male lion, then the Overgeared Kingdom was nothing more than a deer trapped among a pride of lionesses. From the imperial perspective, his kingdom was a meal waiting to be devoured at their leisure.\n\nThe thought gnawed at him. Everything he and his guildmates had built, all their blood and sweat—fragile as a sandcastle before the incoming tide.\n\n*Don't look at me.*\n\nGrid pushed the bitterness aside. This was an opportunity he couldn't afford to waste. Every imperial soldier he cut down here was one less threat to his people. Recognition could wait. Survival came first.\n\n***\n\n[You have dealt 17,870 damage to the target!]\n[The option effect of the Lightning Sword Born from Enlightenment and Strong Desires has added 5,000 fire damage!]\n[You have dealt 20,100 damage to the target!]\n[The target has died!]\n[Your demonic power has increased by one.]\n\nThe synergy between Grid's three thousand strength and the Enlightenment Lightning Sword was devastating. Imperial soldiers—level 230 and fully armored—crumpled after two strikes, dissolving into grey light. Their levels meant nothing. Their equipment might as well have been paper.\n\nThe sword itself was a masterwork of compounding advantages: twenty percent increased physical attack, thirty percent fire damage, thirty percent dark damage, fifteen percent lightning damage. But the weapon's options were only the beginning. Grid's own passives transformed him into something beyond a typical player.\n\nIntermediate Weapons Mastery—earned in the Behen Archipelago and raised to level five—added seventeen percent attack power. Pagma's Swordsmanship at level four contributed another thirty-four percent when not actively used. The Dominion's Blessing infused into his pavranium gauntlets granted fifteen percent more.\n\nLayers upon layers of buffs stacked atop Pagma's Swordsmanship itself, elevating what Grid called a \"basic attack\" into something approaching a superweapon.\n\nAnd that wasn't even accounting for the sword's active effects.\n\n[The option effect of the Lightning Sword Born from Enlightenment and Strong Desires has summoned a red lightning bolt!]\n[You have dealt 44,900 damage to the target!]\n[The target is caught in an electric shock for 1.2 seconds!]\n[The target has died!]\n[The option effect 'Black Flames' has activated from the Lightning Sword Born from Enlightenment and Strong Desires!]\n[Splash damage equal to 300% of your total attack power has hit all targets in a 10 meter radius!]\n[The target has died!]\n[The target has died...]\n[The target has died...]\n[The target has...]\n...\n[Your demonic power has increased by 232.]\n\nMythic-grade effects triggered with every swing—resource-free, relentless, overwhelming. It was slaughter masquerading as combat.\n\n\"*KUAAAAAK!*\"\n\nChaos erupted through the imperial camp like wildfire. Grid's \"basic attacks\" tore through their formations faster than most players' ultimate skills.\n\n\"Enemy contact! Behind us!\"\n\n\"Hundreds down in a single blast—great magician confirmed!\"\n\n\"Since when does Valhalla have a great magician?! Get those anti-magic shields up! *Now!*\"\n\nTo their credit, the imperial army recovered quickly. They were, after all, the strongest military force on the continent. Within moments, officers barked orders through the confusion, organizing a response to both the Valhalla ambush and this new rear assault. Seeing the cascading red lightning and erupting black flames, they concluded they faced a caster. Magic shields snapped up across the front lines while battlefield minstrels began countersongs to slow enemy casting speeds.\n\nIt was exactly the wrong call.\n\n\"What?\" Grid almost laughed. \"Are you trying to make this easier for me?\"\n\nHis blade carved through the sea of bodies. With their heavy armor swapped for lighter anti-magic gear, they might as well have been naked. He'd almost suspect imperial spies were feeding him intelligence.\n\n\"I don't know what you're thinking, but—thanks!\"\n\n*Puk!*\n\n*Puuok!*\n\nFour strikes per second. Armed with Alex's Quick Gloves, Grid moved like lightning given flesh. Soldiers targeted directly died within a heartbeat. Dozens more within ten meters suffered the splash damage.\n\n*Peng!*\n\n*Pepepepeong!*\n\nThe rough forest terrain amplified the devastation. From the empire's perspective, the black flames were a natural disaster made manifest. With each detonation, hundreds turned to grey light. At this rate, the entire fifty-thousand-strong army would be annihilated within the hour.\n\nCaptain Beit stood frozen, jaw slack.\n\n\"W-What in the hells is that *monster?*\"\n\nFive minutes after the initial surprise attack, Beit had finally fought through to the army's rear to visually confirm the threat. What he found defied expectation. Not a magician—a lone swordsman. One man. Every swing of his blade brought—\n\n\"*Kuock!*\"\n\nBlood spray.\n\n*Kwajijijik!*\n\n*Peeng!*\n\nRed lightning. Black flames. Again and again. The imperial army's fortress-like defensive formations crumbled like rotten wood before this... this *thing*.\n\n\"I didn't realize Valhalla had anyone of this caliber...!\"\n\nThe swordsman's blade moved almost too fast to track. How much mana would someone need to continuously manifest flames, lightning, and darkness? Beit measured the straw-hatted figure against the empire's solo number knights and decided he ranked at least with the fifth.\n\n\"Sir Lorex! We need Sir Lorex's support!\"\n\nThe distance between them was closing. With every step the swordsman took, hundreds more died. Panic clawed at Beit's chest. If this continued, their entire rear would collapse. Only the Red Knights could stop this.\n\nHe shouted for reinforcements.\n\n\"The Red Knights are pinned down in the enemy's trap!\"\n\n\"Lorex is engaged with enemy commanders—!\"\n\nDesperate reports came back one after another.\n\n\"Damn it... Everyone fall back! I'll hold him here!\"\n\nNo choice remained. Beit spurred his horse forward. He was a captain of the Saharan Empire—beneath the Red Knights perhaps, but not without skill. He could buy time. He *had* to.\n\n*Lizzie, forgive me. I won't be coming home after all.*\n\nHe kissed the pendant at his neck—a farewell to his wife—and charged.\n\n\"For His Majesty!\"\n\n\"*WAAAHHHHHH!*\"\n\nCaptain Beit would rally the troops. He'd stand fearless against this monster and restore their morale—\n\n*Puk!*\n\n*Puuok!*\n\n\"*Kuock!*\"\n\n—Or so he'd intended. His magnificent cavalry charge ended in eight strikes instead of the usual two. Still only took about two seconds.\n\n\"T-The captain... so easily...\"\n\n\"*Hiik*...! Run! Just *run!*\"\n\nThe effect was catastrophic. The soldiers had envied Beit's skill and rank. Watching him die like a common footsoldier shattered what remained of their morale.\n\n\"He's no ordinary warrior...! His technique is flawless, and he knows our formations!\"\n\nThe other captains reeled at witnessing Beit's death. They interpreted it as a surgical strike—the enemy had deliberately targeted their captain, knowing precisely what his death would trigger.\n\nThis monster had planned it all.\n\n\"He's terrifyingly competent...! Shit! No time to regroup—fall back to the Red Knights' position!\"\n\nAgainst sufficiently high-level players, numerical superiority meant nothing. The imperial captains knew this bitter truth from watching their solo number knights operate. Their only option was retreat. Ironically, Grid's rampage made this easier—he'd already carved a path through the imperial forces, heading straight for the army's vanguard.\n\nHe was running *toward* the Red Knights' position.\n\nNaturally. He intended to kill them.\n\n\"I am the Basic Attack King.\"\n\nGrid arrived at the fierce clash between the Ares Army and the Red Knights, announcing himself to the sudden attention.\n\n\"Red Knights of the Saharan Empire. The empire dominates this continent because of you. Therefore—I cannot allow you to exist.\"\n\n\"...\"\n\nAwkward silence followed. The Red Knights were stunned by the sheer presence rolling off this stranger. As for the Ares Army...\n\n\"Grid...?\"\n\n\"...\"\n\nWho else had that particular brand of chuuni naming sense? The Ares troops had all seen the video of Overgeared King Grid shouting *100,000 Army Massacre Sword*. The identification seemed obvious.\n\nGrid denied it immediately.\n\n\"Grid is the Overgeared King. I am the Basic Attack King.\"\n\n\"...R-Right. Of course.\"\n\nAres caught on fast. Better if Grid's identity remained hidden here. He played along—while internally, excitement built in his chest.\n\n*Just how strong has he become?*\n\nAres freely admitted many surpassed him: Kraugel, Grid, Agnus, Luck, Scott—he respected and admired them all. But somewhere deep down, he'd always thought Kraugel stood alone at the pinnacle. That assumption was crumbling now.\n\n*The one who reached the sky...*\n\nThe memory surfaced: Grid pushing Kraugel to the brink of death during the second National Competition. And now—\n\n*Has he found the power to break through even that ceiling?*\n\n*Hwaruruk!*\n\nAres swallowed hard as the sword in Grid's hand ignited crimson. The Enlightenment Lightning Sword—Grid's masterwork—leveled at Third Knight Lorex.\n\n\"Let's fight.\"\n\n\"*Come!*\"\n\nLorex roared his challenge. The monster who'd just butchered thousands of imperial soldiers wouldn't be forgiven. Since common troops couldn't touch someone at this level, Lorex would handle it personally.\n\n\"Before the might of the Red Knights, you're nothing but a frog in a well! I'll tear that hat from your face and paint it with despair!\"\n\n*Kurururung!*\n\nThe red armor encasing Lorex's body deepened to scarlet. The Red Armor's true power activated—amplifying the wearer's stats to their absolute limit. Lorex acknowledged this opponent as a genuine threat.\n\nIn that moment:\n\n[A strong aura has been detected. Your fighting energy reacts and has started to boil.]\n[From now on, fighting energy will naturally rise by 1 every 10 seconds.]\n\nGrid's smile widened as understanding clicked into place. *This* was the true value of fighting energy.\n\n\"Let's see.\"\n\nA knight who represented the continent's military peak, versus the hero who'd conquered heroes.\n\nWho would stand when the dust settled?"
}