{
  "id": 706,
  "title": "Chapter 706",
  "content": "**He's not backing down?**\n\nLorex froze. The bastard was *smiling* at him.\n\n*Is he insane?*\n\nLorex was the Third Knight—one of the strongest warriors in the empire, feared across the entire continent. Yet this man stood before him grinning like a madman.\n\n\"I've encountered countless warriors who trembled at the sight of me...\" Lorex's surprise curdled into rage. Blood vessels bulged across his forehead. \"But you're the first fool brave enough to *smile*!\"\n\n*Peeng!*\n\nNo more words. This arrogant bastard had slaughtered his entire battalion—fifty thousand soldiers reduced to corpses. For that crime alone, he would erase this man from existence.\n\n\"You cut through fifty thousand troops? *Child's play*.\" Lorex's axe blazed with power, distorting the air itself. \"Let me show you how vast the world truly is beyond your pathetic little well!\"\n\n*Sukakak!*\n\nThe shockwave from his weapon pulverized the stones at his feet into dust. Ares watched the display and shouted a desperate warning.\n\n\"Don't block it head-on! His strength stat is at least five thousand! You have to dodge!\"\n\nEven as the words left his mouth, Ares knew they were useless. Lorex wasn't some lumbering brute—he was fast, precise, and relentless. The attack couldn't be dodged. It was too swift, the angle too perfect, and even attempting to block it would result in catastrophic damage. In Ares' estimation, the Third Knight was 'overwhelming even for Kraugel at his peak.'\n\n*I hate admitting it, but that's reality.*\n\nPlayers hadn't reached level 400 yet. The solo number knights were elite warriors that required a fourth advancement class just to *compete* with, let alone defeat.\n\n\"Avoid it? Why would I do that?\"\n\nGrid's specialty was shattering expectations.\n\n*Peeeeeok!*\n\nLorex's axe slammed into Grid's chest.\n\n[You have suffered 14,300 damage.]\n\nDevastating damage, even with Triple Layers reducing the physical impact. Yet Grid stood firm, boots planted in the earth.\n\n*Puk!*\n\n*Puuok!*\n\nFour counterattacks per second. Grid's answer to Lorex's assault.\n\n[You have dealt 6,900 damage to the target!]\n[You have dealt 7,630 damage to the target!]\n[You have dealt 8,400 damage to the target!]\n[You have dealt 9,390 damage to the target!]\n[The option effect of the Lightning Sword Born from Enlightenment and Strong Desires has summoned red flames. Additional 5,000 damage will be dealt.]\n\nThe overgeared fighting style in its purest form—absorb hits, hit back harder with superior items.\n\n\"Kuk...?\"\n\nLorex's eyes widened as the four strikes landed in rapid succession. A cold thread of anxiety wound through his chest as he registered the accumulated damage.\n\n*He survived my attack? And each of his hits seems to be getting stronger...*\n\n*Kwajajajak!*\n\nLorex was one of the continent's finest warriors. Even caught off-guard by the counteroffensive, his body moved on pure instinct. While Grid's sword carved into him, his axe crashed into Grid's shoulder.\n\n[Critical!]\n\nA clean hit. Lorex expected Grid's body to shatter under the impact. He wrenched at his axe, intending to tear through armor and flesh alike. But—\n\n*It won't budge?*\n\nThe armor's multiple layers created an absurd level of durability that contradicted its elegant design. Lorex's axe couldn't even crack it. Well, fine—many excellent armors existed in the world. His weapon was legendary for cutting through steel like parchment, but even he couldn't slice through *everything*.\n\nThe real problem came next.\n\nThe armor's barbs began grinding into his axe blade.\n\n*Kkirik!*\n\n*Kiiiiikik!*\n\n\"...!!\"\n\nLorex tried to yank his weapon free, but—\n\n*Pasak!*\n\n—the axe escaped the barbed grooves with a hairline crack running along the blade. The 'Sword Breaker' effect of Triple Layers at work.\n\n\"Hit me all you want.\" Grid gulped down a health potion, eyes locked on Lorex. \"Let's see what breaks first—me or that axe of yours.\"\n\n*Gulp gulp.*\n\nGrid's sword found Lorex's side again. Each consecutive attack on the same target increased his damage output.\n\n[You have dealt 14,300 damage to the target!]\n\n\"Huup!\"\n\nOn the tenth strike, Lorex's side actually dented inward—physical pain manifesting in his flesh.\n\n\"You bastard!\"\n\n*Wuuong.Kwang!*\n\n*Wuuong!Kwajak!*\n\nLorex unleashed a flurry of axe swings. Grid couldn't evade them all, but each hit he took only meant more counterattack damage piling onto Lorex.\n\n\"...\"\n\n\"...\"\n\nAn uncomfortable silence settled over the battlefield as the brutal exchange continued. Ares watched with growing disbelief.\n\n\"This is just... a complete slugfest...\"\n\nNo high-level techniques. No elegant swordplay. Just two warriors beating the hell out of each other like common street brawlers.\n\n*Nod nod.*\n\nEveryone watching—allies and enemies alike—nodded in agreement.\n\n*But I'm not laughing.*\n\nAres' expression darkened. The difference between Grid and Lorex was obvious to anyone with eyes. Grid was a player; Lorex was an NPC. Player health was determined by stats, titles, and equipment, but NPC health was set separately by the system. Named NPCs, in particular, possessed health pools comparable to raid bosses—tens or even hundreds of times greater than any player. While Grid's health gauge dropped by a seventh or sixth with each attack, Lorex's bar barely budged.\n\n*At this rate, Grid has no chance. I need to finish the Fifth Knight and create an opening to help—*\n\n\"Eh...?\"\n\nGasps rippled through the battlefield. The thick water vapor of Liberon Forest had been concealing something—a red and purple aura radiating from Grid's body. Fighting energy. It had been there from the start, hidden beneath the blood and humidity, but now it blazed bright enough to pierce through the mist.\n\n[Fighting energy has reached 50 points.]\n\n*Jjang!*\n\n*Jjeejeeeong!*\n\n\"Kuoh...!\"\n\nLorex's eyes went wide as Grid's next strike landed. The power difference was staggering.\n\n\"I see now! You're a berserker!\"\n\nThe defense was too high for a berserker, but it was the only explanation Lorex could accept. Grid shook his head.\n\n\"Berserker? No.\"\n\n\"????\"\n\n\"It's just a basic attack.\"\n\n\"What—!? Stop spouting nonsense!\"\n\nFury consumed Lorex. He roared like a wounded beast and intensified his assault.\n\n***\n\n[You have suffered 14,600 damage.]\n[Fighting energy has reached 60 points.]\n[You have dealt 15,660 damage to the target!]\n[You have dealt 15,710 damage to the target!]\n[You have recovered 1,885 health thanks to Elfin Stone's Ring!]\n[The experience of Elfin Stone's Ring has increased by 0.3%!]\n\n*This bastard's endurance is monstrous.*\n\nTwo minutes. That's all the time that had passed, yet it felt like an hour-long marathon. Trading one hit for four counterattacks every second—Grid's stamina could sustain it, but his mental endurance was fracturing. Every moment required absolute focus, channeling power and precision without a single wasted movement.\n\nThe mental pressure was crushing.\n\n*Kwajak!*\n\n*He's got a passive lifesteal ability.*\n\nGrid coughed blood as the axe cracked into his chest again. His eyes tracked Lorex's health gauge—it was rising slightly with each exchange.\n\n*Damn it... a passive skill means it's always active. Stronger than any toggleable ability.*\n\nGrid knew Lorex outclassed him. The flat damage alone exceeded even Madra's output, and the item experience gains from Elfin Stone's Ring, Tiramet's Belt, and God Hands were climbing faster than during the Madra fight. He considered every variable, calculated every option, and reached an inescapable conclusion.\n\n*I can't win this.*\n\nDefeating Lorex—who possessed over ten million health—with basic attacks alone was virtually impossible.\n\n*Pagma's Swordsmanship could do it.*\n\nThe overwhelming offensive power of those techniques would neutralize Lorex's monstrous sustain. But Grid couldn't use any abilities that identified him as the Overgeared King. His presence here had to remain anonymous.\n\nSo what? Run away because the odds were impossible?\n\n*No.*\n\nThis felt different from encountering Yangban Garam or First Knight Mercedes. Those two radiated an oppressive presence that dwarfed Lorex's. And more importantly—Grid had earned his confidence. Not through arrogance, but through achievement. The title of Hero of Heroes wasn't bestowed lightly. He trusted his skills.\n\n*Think, Youngwoo. How do I beat this bastard?*\n\n\"Kuhahahaha! Getting tired, are we?\"\n\n*Shit!*\n\nHe'd gotten too lost in thought. Grid blanked for a single second, failing to counterattack. In that opening, Lorex activated a skill. The blue-black aura wreathing his axe surged forward, energy rippling at the blade's edge like a coiled explosion. It resembled the black flames' splash damage pattern.\n\n*Can't block his basic attacks, so definitely can't stop this. Damn it, I'll have to burn Quick Movements to dodge—*\n\nBetter than wasting his immortal passive. Grid prepared to activate the evasion skill.\n\n*Wait. Explode?*\n\nA memory surfaced. As Lorex's axe descended toward his face, Grid yanked out a large piece of cloth.\n\nA cloak?\n\nNo—just fabric.\n\n\"Grid...! Wait, what?\"\n\nAres judged Grid to be in mortal danger and started rushing to assist—then froze. Something about that cloth triggered a realization.\n\nLorex's axe struck. No—it struck the cloth *before* reaching Grid.\n\nLorex snorted in contempt.\n\n*This fool really is insane!*\n\nTrying to block Volcano Axe—an area-devastation technique—with a *piece of cloth*? Well, perhaps madness was understandable. Volcano Axe couldn't be blocked or evaded. When resistance was futile, why not do something crazy?\n\n\"...Huh?\"\n\nThe savage grin on Lorex's face—anticipating Grid's explosive demise—froze. His mind went blank. The axe, which should have erupted with devastating energy, fell completely silent the moment it touched the cloth.\n\n*What?*\n\nHe felt like he'd been possessed by ghosts. Lorex couldn't comprehend what had happened, but with his vision obscured, he immediately retreated. Grid's sword found his exposed side. A basic attack as usual—but this time, Grid wove a skill between the strikes.\n\n\"Unbreakable Justice!\"\n\n*Peeeeeong!*\n\n\"...!!\"\n\nLorex's vision went white."
}