{
  "id": 707,
  "title": "Chapter 707",
  "content": "**[Unbreakable Justice Lv.1 (93.1%)]**\n\n**Deals 300% of your attack power.**\n\n**Skill Mana Cost: 350**\n\n**Skill Cooldown Time: 100 seconds**\n\nA skill granted by the Apostle of Justice title. Compared to Pagma's Swordsmanship, Braham's magic, or Madra's techniques—all legendary in their own right—Unbreakable Justice seemed modest at best. Yet even so, it ranked among the upper echelon of abilities.\n\nThe damage coefficient alone proved that. Standard level 1 area skills rarely exceeded 100% attack power, but Unbreakable Justice tripled it. Better still, it activated instantly—no elaborate wind-ups or positioning requirements like Pagma's techniques demanded. Huroi, Grid's companion who'd inherited the Apostle title, had mastered it within weeks.\n\nSo why had Grid largely ignored it?\n\nSimple. Pagma's Swordsmanship outclassed it in every meaningful way. The benefits of Unbreakable Justice paled next to his legendary sword dance techniques.\n\nThat didn't mean Grid had abandoned it entirely. He kept Unbreakable Justice, Continuous Stab, and Spear Shot in his arsenal for the right moments. Spear Shot particularly had proven invaluable during the Tiramet raid and the National Competition.\n\n*Peeong!*\n\n> [You have dealt 15,730 damage to the target!]\n\n> [You have dealt 47,200 damage to the target!]\n\n> [You have dealt 15,710 damage to the target!]\n\n> [Fighting energy has reached 61 points.]\n\n> [You have dealt 16,050 damage to the target!]\n\n> [You have dealt 16,090 damage to the target!]\n\n> [The black flame explosion...]\n\n> [You have dealt 48,040 damage to the target!]\n\n\"Kuoh...!\"\n\nGrid wove Unbreakable Justice seamlessly between basic attacks. When the black flames detonated, Lorex absorbed over 160,000 damage in a single second. Even as Lorex's counterattack connected, Grid's mind raced through calculations.\n\n*It compensates for my lacking burst potential. If both red flame and red lightning procs trigger simultaneously, I could push 200,000 damage per second.*\n\nThe math was simple. In ten seconds, he could theoretically deal one million damage to Lorex. If Lorex possessed tens of millions of health, that would mean nothing. \n\nExcept Lorex wasn't a training dummy. He retaliated with every strike, and Grid's health pool sat below 100,000. In a straight damage trade, Grid would fall first.\n\n*If Kraugel were here...*\n\nHe'd evade every swing of that axe. Kraugel would dismantle Lorex without taking a scratch.\n\n*...No.*\n\nGrid shook his head, banishing the thought. He was exhausted by the constant self-comparison.\n\n*I'm Overgeared. My entire fighting style differs from his.*\n\nCan't dodge? Fine. So it hurts? He'd hurt them worse. Grid dismissed his sword.\n\n> [You have equipped the Motley Flail.]\n\n\"...???\"\n\nLorex's expression cycled past confusion into pure bewilderment. In the middle of combat—switching from a legendary weapon to *farming equipment*?\n\n*Is this bastard actually insane?*\n\nGoosebumps crawled across Lorex's skin—not from fear, but from sheer *disgust*. He involuntarily recoiled, clearly unwilling to engage with whatever madness Grid represented. In that opening, Grid test-swung the flail through the air.\n\n*Buong~ Buong~*\n\n*Good. With Alex's Gloves, I'm maintaining four swings per second. Now for the debuffs...*\n\nAs for the buffs? Grid refused to consider the worst-case scenario.\n\n> **[Motley Flail]**\n>\n> **Rating:** Unique\n>\n> **Durability:** 259/259 **Attack Power:** 143~191\n>\n> * **A special effect will occur every time the target is hit. The effect is unpredictable.**\n>\n> * **Thrashing speed will increase by 150%.**\n>\n> * **There is no guarantee how the condition of the thrashed grain will change.**\n\nEquipment he'd forged ages ago. No—a *weapon*. When Grid first faced his doppelganger and saw no path to victory, he'd gambled everything on this flail's random effects.\n\n*I'm not expecting the miracle that saved me then. Just... a slight attack power reduction. Even briefly. That's enough.*\n\nHe could offset health loss with potions, Doran's Ring, and his lifesteal properties. He only needed a small advantage.\n\n\"Go!\"\n\nGrid roared and charged.\n\n\"You bastard...!\"\n\nInstinct drove Lorex backward. He'd already been caught off-guard once by that mysterious cloth. How could he not be wary of yet another bizarre farming implement?\n\n***\n\n\"Unbreakable Justice!\"\n\n\"...I thought he was the Basic Attack King.\"\n\nAres' dry observation came the instant Grid activated a skill. Yet the surrounding Ares Army could only watch in awe. Lorex reeled from the technique, his health bar visibly plummeting. The soldiers collectively held their breath.\n\n*Grid's damage output is insane.*\n\n*That attack speed has to be breaking the system.*\n\nThey'd clashed with Lorex before. They knew exactly how monstrous his defense was. Even Luck—the hardest hitter in their entire force—maxed out at 5,000 to 7,000 damage per strike against him. Grid's basic attacks were dealing *double* that damage at *twice* the speed. If anything, it looked even more devastating.\n\n*Overgeared...! So this is what it truly means to be Overgeared.*\n\nEvery soldier's gaze locked onto Grid's weapon and gloves. Neither piece was familiar. Scott trembled.\n\n*He's crafting new items on the fly...!*\n\nThe unparalleled advantage of a Legendary Blacksmith. A living reminder that balance was a myth.\n\n*An existence that shatters equilibrium itself.*\n\nPlayers grew through two paths—grinding levels or hitting the jackpot on rare drops. But jackpots were exactly that: rare. Better equipment required tackling harder raids. Even successful raids didn't guarantee the drop you needed.\n\nThat limitation throttled everyone's growth rate. Most players hit prolonged plateaus. High-level users especially, whose experience requirements skyrocketed. Often their combat power remained stagnant for months.\n\nBut Grid? He forged top-tier equipment himself, rendering the entire loot system obsolete. He grew stronger *daily*. Each absence made the gap wider. It genuinely terrified Scott.\n\n*If he's your enemy, there's no answer. Ares was brilliant to secure his friendship. Wait—*\n\nScott, who'd been watching Grid with reverent dread, froze.\n\nGrid abruptly sheathed his sword and drew... something else.\n\n\"What is that?\"\n\nAn unfamiliar item. Scott squinted, trying to place it. Then recognition struck—Grid had pulled out a tool farmers used to thresh grain.\n\n\"A flail...? Why would he switch when he was dominating?\"\n\nA confrontation with a powerhouse like Lorex. An encounter that would determine the entire battle's momentum. And Grid swapped to *farming equipment*? Scott couldn't comprehend it. He wanted to crack open Grid's skull and examine his thought process. As confusion rippled through the ranks, Ares suddenly shouted.\n\n\"I understand...! I know the Bas— No, I know the Basic Attack King's intentions!\"\n\n\"...?!\"\n\nAres had somehow deciphered Grid's reasoning behind equipping farm tools mid-combat?\n\n\"As expected of Ares...! You understand what the Basic Attack King is thinking?\"\n\nThe Ares Army marveled at their leader and pressed for answers. Ares wore a knowing expression as he explained.\n\n\"It's a provocation. Pure psychological warfare.\"\n\n\"Provocation?\"\n\n\"Precisely. The Basic Attack King is sending Lorex a message: *I can beat you with farming equipment.*\"\n\n\"...No way.\"\n\nThe Ares Army trusted their commander implicitly. But this interpretation stretched credibility to its breaking point. Who was Lorex? The Third Knight of the Red Knights—a warrior whose peers could be counted on one hand. He approached final boss territory. How could *anyone* defeat him with farming tools? Even Grid couldn't pull that off.\n\nJust as that collective thought solidified—\n\nGrid smashed the flail into Lorex's face.\n\n\"What...?\"\n\nFor reasons beyond comprehension, Lorex looked utterly *shaken*. His face drained of color.\n\nIn that moment—\n\n\"Quick Movements! Blacksmith's Rage!\"\n\nGrid activated his saved buffs and swapped back to the Enlightenment Sword after several flail strikes. The assault continued—basic attack, basic attack, basic attack. With each connection, Lorex's health bar plummeted dramatically.\n\n\"...\"\n\nAres and his entire army collectively stopped thinking.\n\n***\n\n> [The target will receive three times the damage due to the effect of the Motley Flail. This effect will last for one minute!]\n\n\"This is perfect...!\"\n\nGrid had only hoped to reduce Lorex's attack power—just enough to survive the damage trades. Instead, the flail amplified his own damage output. If Lorex took triple damage, that effectively *tripled Grid's attack power*.\n\n\"This is going to hurt!\"\n\nThe debuff would last one minute, but Lorex was still the Third Knight. Grid assumed he'd shake off the effect within thirty seconds. He surged forward, Quick Movements boosting his agility while Blacksmith's Rage elevated both attack power and attack speed.\n\n*Peng!*\n\n*Pepepepeng!*\n\nCombined with his steadily climbing fighting energy, he reached six basic attacks per second.\n\n*Maximum speed achieved.*\n\n\"You crazy bastard...! You're fighting like an assassin!\"\n\nAttack speed rivaling legendary assassins! Lorex found himself genuinely *frightened* by Grid's acceleration—the kind of speed that raised goosebumps. But he didn't panic. So what if the attacks came faster?\n\nThey still weren't threatening. He could counter everything—\n\n\"Keeeok!\"\n\nLorex's scream tore through the battlefield as he swung his axe. The blade piercing his side delivered pain far beyond anything he'd anticipated. Grid smiled.\n\n> [Fighting energy has reached 70 points.]\n\n> [You have dealt 69,100 damage to the target!]\n\n> [You have dealt 68,930 damage to the target!]\n\n> [You have dealt 70,800 damage to the target!]\n\nFrom a *basic attack*. The result of Blacksmith's Rage increasing Grid's attack power by 25%, multiplied by Lorex taking triple damage.\n\n> [The black flame explosion...]\n\n> [Critical!]\n\n> [The effect of the title 'Death in One Shot!' has been activated...]\n\n> [You have dealt 489,300 damage to the target!]\n\n\"Kuaaaack!\"\n\nUntil now, even Grid's most devastating strikes had only drawn grunts from Lorex. But this—this tore a genuine scream from his throat. Agony overwhelmed him as his health bar dropped precipitously. His counterattacks couldn't keep pace. Even with lifesteal active, the recovery couldn't match the hemorrhaging health.\n\n*Why did he suddenly become this strong?*\n\nLorex couldn't fathom that farming equipment had caused this catastrophe. Dread crawled down his spine.\n\n*Don't tell me... he was holding back this entire time?*\n\nHe couldn't gauge this madman's true capabilities. Anxiety gripped him. Lorex shouted to his comrades.\n\n\"How long are you planning to watch? *Help me!*\"\n\nTruth be told, Lorex wasn't built for duels. His massive axe and skill set focused on terrain destruction and sweeping multiple enemies simultaneously—a war specialist. One-on-one against an equal opponent? Fundamentally disadvantageous.\n\n\"Cowardly bastard...! We'll help the Basic Attack King!\"\n\n\"Yes!\"\n\nThe moment Lorex called for reinforcements, Ares issued orders and his army responded.\n\n\"No. Stay back.\"\n\nGrid's command halted the Ares Army. He launched himself skyward, Lorex and all the Red Knights filling his vision.\n\n\"100,000 Army.\"\n\n\"...?\"\n\n\"Blockade Sword!\"\n\n\"...!!\"\n\n*Peng!*\n\n*Pepepepeok!*\n\nDozens—*hundreds*—of fighting energy stems cascaded from above in torrents of red and purple light. Lorex, the Red Knights, and Oasis alike felt shock and panic grip them.\n\n\"The Undefeated King...!\""
}