{
  "id": 708,
  "title": "Chapter 708",
  "content": "Dragons. Great demons. The Saharan Empire had survived them all.\n\nBut there was one name that still made emperors wake in cold sweats—*Madra*, King of Lubana. Ninety-seven wars waged against him. Ninety-seven defeats. Not a single victory.\n\nThe soldiers who'd conquered a continent meant nothing before Madra. The strategists who'd toppled kingdoms with their brilliance became fools in his shadow. The knights who'd built the empire's dominance through sheer force—reduced to children swinging sticks.\n\nMadra's valor broke veteran soldiers into cowards. His tactics made legendary commanders look like amateurs. His strength crushed the empire's finest warriors like insects. The common people never knew—too much had been scrubbed from the records. But the imperial archives told the truth in stark, horrifying terms:\n\n*If Madra had lived three more years, neighboring nations would have begged to become Lubana's vassals. Five more years, the empire would have lost half its territory. Ten more years... there would be no empire at all.*\n\nThe Undefeated King.\n\nThat name had haunted the imperial bloodline for centuries. It explained why the empire crushed Lubana so ruthlessly as a tributary state—not out of cruelty, but terror. They feared the kingdom that had birthed such a monster. Feared a second Undefeated King might rise from those same streets. So they broke Lubana's spine and ground its people into the dirt.\n\nWhich made the news all the more catastrophic.\n\nWhen word reached the capital that someone claiming to be the Undefeated King's descendant had appeared in Lubana, Emperor Juander's composure shattered. His body shook despite himself.\n\n\"*Destroy him!*\" \n\nThe order came immediately. Elite battalions. The Red Knights themselves. All marching toward Lubana with one purpose—erase this threat before it could grow.\n\nBut they failed.\n\nAres, that upstart King of Valhalla, had intervened and spirited the descendant away. Now the Red Knights bore the weight of imperial wrath. Their new mission: punish Valhalla's rebellion and eliminate the descendant they harbored.\n\nLorex had expected an easy execution. Valhalla fell quickly enough. But the descendant had vanished like smoke, hiding in some corner like a *rodent*. Finding him would take time they didn't have.\n\nOr so he'd thought.\n\n\"**100,000 Army Blockade Sword.**\"\n\nThe voice rang out from above. Lorex's head snapped up.\n\n*No.*\n\n\"The Undefeated King's descendant...!\" The words escaped his throat as sweat broke across his skin.\n\nThis *stranger*—the man he'd been trading blows with—was the descendant?\n\n'*Impossible!*'\n\nJust weeks ago in Lubana, Lorex had met the supposed descendant himself. An ordinary warrior. Unremarkable technique. He hadn't even known the Undefeated King's swordsmanship. The entire claim had reeked of fraud.\n\nSo who was *this*? What phantom had mastered that cursed art in mere weeks?\n\nThe 100,000 Army Blockade Sword—the technique whispered through Lorex's family for generations. Stories of the Undefeated King raising his blade and freezing one hundred thousand soldiers in their tracks.\n\n\"*Absurd!*\" Lorex roared, rejecting the legend even as his gut twisted. \n\nThe tales were too fantastical. Too mythical to be real. A sword that could seal an entire army? Even third-rate novels wouldn't print something so ridiculous. The Undefeated King was exaggeration and propaganda. This man in the sky was *bluffing*—\n\n*BOOM!*\n\n*Crack-crack-crack-CRACK!*\n\nRed and purple fighting energy erupted across the sky like fireworks. No—like artillery shells. The world itself *screamed*.\n\nLorex understood his mistake the moment pain lanced through his body.\n\n> [**You have been blocked!** You cannot move for 3 seconds. All skills and magic disabled!]\n\n\"This... This is...!\"\n\n*The legends were true.*\n\nThe color drained from Lorex's face. His legs gave out—not from injury, but pure instinctive dread. Around him, the Red Knights wore the same expression of dawning horror.\n\n*SLASH!*\n\nA blade of pure light descended from above. Grid's follow-up strike, his speed amplified to inhuman levels by **Quick Movements** and **Blacksmith's Rage**.\n\n\"You—!\" Lorex raised his axe desperately.\n\nSix strikes per second. He couldn't track them all. Couldn't guard against the storm of steel carving through his defenses.\n\n*SCREEEECH!*\n\nDark sword energy slammed into his helmet's center.\n\n*SCREEEECH!*\n\nBlack flames *detonated*.\n\nLorex, frozen like a statue, took the full brunt. The Red Knights around him—equally immobilized—erupted in blood and screams. \n\nAres and his army could only stare.\n\nThe Red Knights. The most feared warriors on the continent. The backbone of the Saharan Empire's dominance.\n\nGrid was *annihilating* them. Alone.\n\n\"Impossible...!\" Ares choked out the words, then found his voice. \"You! *You're the best!* Grid, you're the absolute best!\"\n\n**Grid.**\n\nFirst Legend. First King. Hero among heroes. If he wasn't the best, then who in this world deserved that title?\n\nAres shouted it like a prayer. None of his soldiers disagreed.\n\nAnd Grid...\n\n'*The best...*'\n\nHis eyes burned red.\n\n*Thump.*\n\nThat single word struck his heart harder than any blade. \n\n'*I'm the best.*'\n\nEveryone acknowledged it. Everyone *saw* him. In this moment, he stood at the pinnacle of two billion players. \n\nA lifetime of being called a fool. Endless failures blamed on a lack of talent. And now—*now*—the title that only geniuses had ever claimed was his.\n\n> [Fighting energy has reached 60 points.]\n\nNothing could have meant more. Not to Grid, who'd been mocked and dismissed his entire life. And it wasn't some random voice—it was *Ares* proclaiming his supremacy. Tears stung Grid's eyes.\n\n\"*YOUUUUU!*\"\n\nLorex broke free from the Blockade Sword's grip and exploded forward, axe swinging. This wasn't like before. The weapon split—one became three, each blade attacking from a different angle simultaneously. \n\n**Three Point Axe.** Lorex's signature technique.\n\n\"You won't dodge this just by being fast!\"\n\nGrid's response was cold. \"That assumes you're correct.\"\n\n\"...!!\"\n\nHorror dawned on Lorex's face. He'd made another critical mistake.\n\nThis entire fight—Grid hadn't been *dodging* his attacks. He'd been *tanking* them. Because dodging was unnecessary when the hits barely mattered.\n\n*THWACK!*\n\nLorex's axe struck Grid's chest.\n\n*Crack!*\n\n*CRUNCH!*\n\nGrid countered with savage force. Lorex still carried the debuff—**triple damage taken**.\n\n\"*KUAAAAAAK!*\"\n\nNot Grid, but *Lorex* staggered from their exchange, agony ripping through him.\n\nThe Red Knights surged forward to aid their commander—\n\n*BOOM-BOOM-BOOM!*\n\nBlack flames erupted in a wall, cutting them off.\n\n\"What in the—!\" One knight's voice cracked. \"How does he keep using abilities this strong? Does his mana have no limit?!\"\n\nAnother muttered through the smoke, \"This is... This is the strength of the Undefeated King...\"\n\n\"...!\"\n\nYes. The Undefeated King. The monster in front of them was that legend's heir. Common sense didn't apply.\n\nThe moment that realization settled over them all—\n\n> [Fighting energy has reached 70 points.]\n\nGrid's aura, which had weakened after **100,000 Army Blockade Sword**, thickened again. **Quick Movements** and **Blacksmith's Rage** accelerated the accumulation dramatically.\n\n> [Fighting energy has reached 71 points.]\n\n> [Fighting energy has reached 72 points.]\n\nFaster. *Faster.*\n\nMore Red Knights joined the fray, trying to overwhelm Grid through sheer numbers. It backfired. Every additional enemy fed his momentum, causing more harm than help.\n\n> [**Fighting energy has reached maximum!**]\n\nTen seconds left on **Quick Movements** and **Blacksmith's Rage**. Grid clung to life through **Doran's Ring**, **Tiramet's Belt**, and the **First King** title—recovery skills firing on cooldown as notification windows flooded his vision.\n\n\"*Push!*\" Lorex roared.\n\nThe Red Knights intensified their assault. They'd seen Grid's health bar—watched him barely survive through intermittent heals. He was on the edge. Time to finish this.\n\nGrid reached the same conclusion. With fighting energy maxed, his strength, agility, and stamina surged fifty percent. He activated the obscure power that symbolized his kingship.\n\n\"**Blackening.**\"\n\n*BOOOOOOM!*\n\nDemonic energy exploded outward in a shockwave. \n\nThen—\n\n\"**100,000 Army Massacre Sword.**\"\n\n\"...!!\"\n\n*Chk-chk-chk-chk-chk-chk—*\n\nForty strikes. Every second. Invisible to the naked eye. The air itself turned black from sword energy as the technique carved through flesh and steel.\n\nLorex and every Red Knight in range—*shredded*.\n\n> [You have dealt 65,900 damage!]\n\n> [You have dealt 67,800 damage!]\n\n> [You have dealt 66,670 damage!]\n\n> [**Black flame explosion triggered!**]\n\n> [Splash damage: 300% total attack power to all targets within 10 meters!]\n\n> [You have dealt 32,100 damage!]\n\n> [You have dealt 29,500 damage!]\n\n> [**Black flame explosion—**]\n\n> [Splash damage: 300% total attack power—]\n\nThis was why Grid favored **Link**. More hits meant more chances to trigger the **Lightning Sword's** black flame option. That logic applied equally to **100,000 Army Massacre Sword**—except this was an area-of-effect technique. Multiple enemies. Multiple strikes each. \n\nThe explosion probability skyrocketed.\n\n*BOOM!*\n\n*BOOM-BOOM-BOOM-BOOM!*\n\n*BOOM-BOOM-BOOM-BOOM!*\n\n\"...\"\n\nIt looked like **Meteor**—the highest-tier magic players had ever witnessed—except *continuous*. Black fire consumed everything, turning Liberon Forest into a hellscape.\n\nAres and his entire army stood slack-jawed.\n\nAnd on that day—\n\n> [23rd Knight Rove has been defeated.]\n\n> [26th Knight Kent has been defeated.]\n\n> [29th Knight Ordo has been defeated.]\n\n> [12th Knight Theo has been defeated.]\n\n> [14th Knight Shen has been defeated.]\n\n> [15th Knight Vio has been defeated.]\n\nKnights ranked in the thirties and twenties—obliterated. Those in the teens—annihilated.\n\nThen—\n\n> [**Third Knight Lorex has been defeated.**]\n\n> [Your level has risen.]\n\n> [Your level has risen.]\n\n> [**Red Knights' Red Armor** acquired.]\n\n> [**Lorex's Red Armor** acquired.]\n\n> [**Lorex's Large Axe** acquired.]\n\nThe Third Knight himself collapsed.\n\n\"U-Unbelievable...!\"\n\n\"You! The Undefeated King's Descendant!\" \n\nThe surviving Red Knights rallied around the Fifth Knight. They'd endured—relatively intact. Damage hadn't accumulated like with Lorex, and they lacked the triple-damage debuff. Defense skills had saved them.\n\nMeanwhile, Grid was *spent*.\n\n> [**Quick Movements** duration ended.]\n\n> [**Blacksmith's Rage** duration ended.]\n\n\"Hah... hah...\"\n\nEvery survival skill exhausted. Buffs expired. **Blackening** had cost him half his remaining health.\n\n'*Can't keep fighting.*'\n\nUsing **Immortality** here would be wasteful. That was his absolute last resort. Grid made his decision—retreat before **Blackening** wore off. Get clear of the Red Knights while he still could.\n\nHe tried to move.\n\n*CRACKLE!*\n\n*CRACKLE-CRACKLE-CRACKLE!*\n\n> [Powerful lightning has paralyzed you!]\n\n> [You cannot resist.]\n\n> [High **Composure** has reduced restraint duration.]\n\nHis body locked up.\n\n\"I've never seen the Red Knights pushed this far.\" The voice came from *nowhere*—empty air speaking. \"You truly are the Undefeated King's descendant. His Majesty will be very pleased when I present him with your head.\"\n\nAn irresistible force. Grid's spine turned to ice.\n\n'*What?*'\n\nA figure materialized before him. Transparent skin gradually solidifying, color bleeding in until pale white flesh stretched over bone. Hair, eyebrows, pupils—all white as fresh snow.\n\n\"Hello?\" The man smiled pleasantly. \"I am Kyle.\"\n\n**One of the Five Pillars.**\n\nThe empire's hidden trump card stood before Grid.\n\n\"Now then. Die.\"\n\n*CRACKLE!*\n\n*CRACKLE-CRACKLE!*\n\n\"Kuk...!\"\n\n> [1 second remaining until restraint ends.]\n\nKyle's hand wreathed itself in lightning and thrust toward Grid's face—\n\n\"**Raising Corpses.**\"\n\n*THOOM!*\n\nBehind Kyle—at the exact spot where Lorex had fallen—a death knight erupted from the earth and attacked. Lorex himself, reborn as undead.\n\n\"...Huh?\"\n\nKyle flinched from the unexpected assault.\n\n> [You are free from restraint!]\n\nGrid shrugged off the lightning binding his limbs and *moved*, creating distance from Kyle as fast as his exhausted body allowed.\n\nThen he heard it. That familiar, *wretched* voice.\n\n\"Kik... kehehehe... You're *mine*. I won't let anyone else have you.\"\n\n\"You...!\"\n\nGrid's blood ran cold.\n\nDark, sunken eyes ringed with shadows. Pallid skin stretched too tight over sharp bones. Green hair falling lank around a gaunt face.\n\n*Agnus.*\n\n**Baal's Contractor** had arrived."
}