{
  "id": 709,
  "title": "Chapter 709",
  "content": "*Why is he even here?*\n\nThe question was pointless. Agnus was a player—he could appear anywhere, pursuing any number of quests. Grid should have anticipated this encounter from the start. What truly baffled him was something else entirely.\n\n*Why did he help me?*\n\nKyle had Grid at his mercy. The Ares troops tried to intervene, but the imperial forces blocked them at every turn, even throwing away their lives to keep Grid isolated. Then Agnus appeared and intervened—an unmistakable act of assistance. It made no sense. Whether driven by personal grudges or quest objectives, Agnus should have been Grid's enemy.\n\n*From his perspective, my death would be a gift.*\n\nSo why?\n\n*Why save me?*\n\nBefore Grid could untangle the mystery—\n\n[The corpse you raised exceeds your dominance capacity.]\n[Control has been lost.]\n\nDeath Knight Lorex flickered and vanished after a single strike against Kyle's back. Three seconds—that was all.\n\nA manic grin split Agnus' face. \"Three thousand dominance burned for three seconds? Keheheh! You actually defeated this thing?\"\n\n\"...\"\n\n\"Hero King!\" Agnus' voice rose to a shriek. \"Hero King! Show me how much stronger you've become! Kihahahaha!\"\n\n\"...!!\"\n\nGrid scrambled backward as Agnus lunged at him. The same man who had just saved his life now attacked with murderous intent.\n\n\"What the hell?\"\n\nGrid barely dodged the bone sword slashing toward his throat. Agnus pressed forward, cackling.\n\n\"Kik! Kikikik! Fight back! Don't just run! Give me a good show! Kihahahaha!\"\n\n\"You psychopath!\"\n\nUnderstanding crashed over Grid like cold water. There was no understanding Agnus. The man was simply insane. Any feeling of debt—any sense that he owed Agnus for saving him—was a dangerous delusion.\n\n*He didn't save me. It was just a whim.*\n\nThe bone sword grazed Grid's cheek.\n\n[You have been cursed.]\n[You have resisted.]\n\n*A debuff weapon? New gear?*\n\n\"Kikikik! Why so tense? Stop running and hit me! Kuahahahaha!\"\n\nAgnus grew wilder, oblivious to the Red Knights and Kyle encircling them both. Fifth Knight Dia ground his teeth.\n\n\"They treat us like decorations!\"\n\nDia specialized in direct combat. Though his overall stats fell short of Third Knight Lorex, in single combat he was superior. He prepared to charge—\n\n\"Wait.\" Kyle's hand stopped him. \"You've seen the Undefeated King's descendant fight. The other one appears equally dangerous. Let them tear each other apart first.\"\n\n\"Guh...!\"\n\nDia despised Kyle. The man hadn't shown his face when Lorex and the Red Knights faced death—only appearing after the Undefeated King's descendant had been worn down. If Kyle had acted sooner, Lorex might still be alive. But—\n\n*I can't criticize him. I also failed to save Lorex.*\n\nDia swallowed his anger and nodded. \"Understood.\"\n\nLet the two monsters destroy each other. A sound strategy. But events took an unexpected turn.\n\n\"Agnus! Get a grip!\" Veradin appeared on the battlefield, seizing his guildmate by the shoulder. \"You can fight him anytime! But Kyle? If we don't kill him now, we may never get another chance!\"\n\nKyle and Agnus served the same empire, just different factions. Normally, they couldn't be enemies. If they let this opportunity pass, they might face him as an ally next time.\n\n\"...Kihi!\"\n\nAgnus froze mid-chase, his madness crystallizing into something sharper. Kyle was ranked among the continent's strongest NPCs. Fighting him would be far more entertaining than chasing Grid around.\n\n\"Yeah... better to fight someone strong than a tired coward running away. Kik.\"\n\n\"Hah... hah...\"\n\nGrid collapsed against a tree, relief flooding through him.\n\n*I almost died.*\n\nNot just from exhaustion. He couldn't reveal his identity as the Overgeared King here. Without access to his full strength, defeating Agnus was impossible—unless Agnus summoned Mumud and forced Grid to use Assimilation.\n\n*But only an idiot would summon Mumud now.*\n\nSummoning the lich would trigger the Braham VS Mumud quest. Grid would receive the level 400 correction. The assimilated Grid and Mumud would be forced into combat. Agnus knew all this. He wouldn't make that mistake.\n\nSure enough—\n\n*Rummmmmble...*\n\nDeath knights and liches materialized around Agnus—all except Mumud. He sent them charging at Kyle. Veradin's death knight joined the assault.\n\n*This is bad.*\n\nGrid activated Braham's Boots and took to the sky, putting distance between himself and the chaos below. He analyzed Kyle's odds.\n\n*He's at least as strong as Lorex.*\n\nBut even Lorex couldn't have withstood a coordinated assault from both Agnus and Veradin—the monsters who had simultaneously held off Grid and the entire Ares Army. Kyle was doomed.\n\nOr so Grid thought.\n\n**CRACKLE!**\n\n*BOOM-BOOM-BOOM!*\n\nA storm of lightning erupted around Kyle. Death knights flew through the air like ragdolls, scattered by the sheer magical power.\n\n*That's stronger than Earl Ashur's magic!*\n\nBeyond a Great Magician! Grid's eyes widened as Kyle's true capabilities revealed themselves. This was the power of one of the empire's pillars—forces that transcended even the solo number knights.\n\n\"Don't tell me—one of the Five Pillars?!\"\n\nGrid finally understood who he was facing.\n\n\"I don't know who sent assassins after me, but they're fools.\" Kyle stood at the storm's center, lightning crackling around his frame. \"Did you really think this rabble could kill me?\"\n\n**FLASH!**\n\nKyle vanished. He reappeared behind Agnus in an instant, nobody on the battlefield fast enough to track his movement. A dagger glinted in his hand. Not just a magician—a combat specialist.\n\n*Thunk! Thunk-thunk-thunk-thunk-thunk!*\n\nThe dagger pierced Agnus' side six times per second. Kyle matched the maximum speed Grid could achieve even with his buffs.\n\n\"Agnus...!\"\n\nGrid tensed in midair.\n\n*Should I help him?*\n\nHe hated Agnus. They were enemies. Grid should want him dead. But Kyle was the far greater threat.\n\n*As long as the Five Pillars exist, the empire will maintain its stranglehold on the continent. The Overgeared Kingdom will never be safe.*\n\nThis was a chance—maybe the only chance—to eliminate one of the pillars and cripple the empire.\n\n*...But I don't want to owe that lunatic anything.*\n\nHis health, mana, and stamina had recovered enough. Grid drew the Enlightenment Lightning Sword. At the same moment, the Ares Army broke through the imperial lines and joined Agnus. They'd made the same calculation as Grid.\n\n\"Agnus! I don't know what you're planning, but fine! I'll work with you! If it means killing one of the Five Pillars, I'll team up with a rabid dog!\"\n\n**CLANG!**\n\nAgnus' scattered death knights had been blown apart by Kyle's lightning. With the Ares Army engaging the Red Knights' rear guard, they regained their freedom and swarmed Kyle from all sides. Agnus laughed wildly as he pressed the attack.\n\n\"Yes! Good! Furfu's Power!\"\n\nThe moment the great demon's name left his lips—\n\n*Whoooooosh...*\n\nThe sun-stained sky turned white. Frost descended like rain, transforming the battlefield into a winter hellscape.\n\n*KREEEEEEE!*\n*GROAAAAAR!*\n\nGreat Demon Furfu's power flooded into Agnus' undead. The death knights swelled with strength. Kyle clicked his tongue, now truly surrounded.\n\n*Troublesome.*\n\nIn truth, Kyle had achieved his objective the moment Lorex died.\n\n*The Third Knight led the imperial army to defeat. The Third Knight died, along with numerous Red Knights. Proof of their incompetence.*\n\n'The Red Knights are obsolete.'\n\nThe emperor would be delighted by Kyle's report. This entire campaign was designed to dismantle the Red Knights and weaken the empress' faction.\n\n*Capturing the Undefeated King's descendant would have been ideal, but...*\n\nThese two necromancers complicated everything. Especially the insane one—he fought outside all conventional logic.\n\n*A great demon's power... I should withdraw while the surviving Red Knights can still serve as shields.*\n\nTo Kyle, Valhalla was a backwater. He had no intention of making his debut in this provincial nowhere. This stage was too small to properly demonstrate his power.\n\n\"Blue Dragon's Dance.\"\n\n**CRACKLE!**\n*BZZZZT-BZZZZT-BZZZZT!*\n\nKyle channeled power from the East Continent, maximizing his physical abilities. He prepared to break through the death knight encirclement. But an unexpected event shattered his plan.\n\n\"Summon Lich! Mumud!\"\n\n\"You crazy bastard!\"\n\n\"?!\"\n\nAgnus summoned the lich. Grid dove from the sky toward Kyle, his black hair bleaching white as Braham's soul took control.\n\n\"Fireball!\"\n\n\"Kiaaaaaaagh!\"\n\n**BOOOOOOM!**\n\nBraham and Mumud cast simultaneously. Their spells collided in a massive explosion—with Kyle caught dead center in the blast zone."
}