{
  "id": 71,
  "title": "Chapter 71",
  "content": "# Chapter 71\n\n**Kwaaaaang!**\n\n\"Kieeeek!\"\n\n> [Blacksmith's Rage has increased your attack power by 10%.]\n\nThe boost surged through my muscles. I activated Unbreakable Justice.\n\n> [You have dealt 300% attack power as damage.]\n\nEleven orcs shrieked as the skill tore through their ranks simultaneously. I didn't give them time to recover.\n\n\"Wind Blast!\"\n\nSharp wind cut into their wounds. The orcs stumbled, confused and bleeding. I triggered Quick Movements and blurred forward. My blade found throats. Found hearts. The wounded monsters couldn't track my speed.\n\n> [You have defeated a frostlight orc.]\n> [You have defeated a frostlight orc.]\n> [You have defeated a frostlight orc.]\n\nThe notifications flooded my vision. Gold. Leather. Crude axes. And then.\n\n> [A sylphid scale has been acquired.]\n> [A sylphid scale has been acquired.]\n\nI stared at the items materializing in my inventory. *Two scales? Just like that?*\n\nI'd killed eighty orcs before finding three scales total. Now two dropped from a single pack.\n\n*If the common orcs drop them this easily, the chieftain should yield a fortune.*\n\n\"Okay!\" I turned toward Huroi, who was desperately blocking the chieftain's massive axe. \"Hey, Huroi! Let's finish him now!\"\n\nThe chieftain's head snapped toward me mid-swing.\n\n\"Huh?\"\n\nHuroi's voice cracked behind me. \"The duration of my taunt is over!\"\n\n\"What?\"\n\n\"Kuooooh!\"\n\nThe massive orc materialized in front of me. His eyes burned with rage for his fallen pack. He roared and swung.\n\n**Kuwang! Kuwang!**\n\nEach swing of that tree-sized axe generated wind pressure that carved trenches in the earth. Snow exploded away from the village ground, revealing frozen dirt beneath.\n\n> [You have suffered 104 damage.]\n> [You have suffered 97 damage.]\n\n\"No way!\"\n\nThe wind alone was cutting me. I hadn't even been touched yet. *What kind of absurd strength is this?*\n\n\"Kuwooooh!\"\n\nThe chieftain's strikes accelerated. Faster. Sharper. I focused everything on evasion, barely twisting away from direct hits while the pressure blasts shredded my health. No openings for counterattacks existed.\n\n*I'm intimidated.*\n\nThis was a true boss monster. Every field boss I'd killed as a warrior had been under level 100, fought with dozens of party members. This was my first solo attempt.\n\n*Can we actually win?*\n\nFear crept up my spine. Then.\n\n> [A legend doesn't feel fear easily.]\n\nMy mind steadied. The composure, indomitable, and courage stats kicked in, washing away the terror like cold water. I shook off the mental debuff and shouted.\n\n\"Huroi! Now!\"\n\nHe lunged from the side. His sword punched into the chieftain's thigh.\n\n\"Unbreakable Justice!\"\n\nThe same skill I used. The blade bit deep. The chieftain flinched and dropped to one knee. I activated Blacksmith's Rage and Quick Movements, closing the gap in a burst of speed.\n\n\"Unbreakable Justice! Wind Blast!\"\n\nBoth skills struck his exposed flank almost simultaneously.\n\n**Kwaang! Hwiririk!**\n\n\"Kuooooh!\"\n\nThe chieftain toppled backward. As he crashed down, I drove my dagger into his left Achilles tendon. Huroi mirrored me on the right. But the thick, leathery skin resisted penetration.\n\n\"Kuwooh!\"\n\nThe chieftain rose, gripping his axe with both hands. Then he spun. Actually spun in place like a top.\n\n\"Ugh?\"\n\n**Kuooooh!**\n\nA whirlpool of violence. Rough winds spiraled up from the rotating axe. Huroi and I were caught defenseless in the vortex. The blade struck home.\n\n> [You have suffered 5,300 damage.]\n\n\"Cough!\"\n\nHuroi's health plummeted from nearly full to below 10%. Mine dropped to 20%. Crisis.\n\n\"Huroi?\"\n\nHe stood frozen. Stunned.\n\n\"Dammit!\"\n\n*I forgot.* After becoming Pagma's Descendant, I'd grown resistant to abnormal status effects. But normal users who lost 40% health in one attack got stunned for three seconds. Completely defenseless.\n\n\"This!\"\n\nThe chieftain's gaze locked onto the helpless Huroi. Easy prey first.\n\n*If Huroi dies, I can't handle this monster alone.*\n\nThe choice crystallized. Flee, or save him. The axe arced down toward Huroi's skull.\n\n\"Shit! This is the first time I've led a raid in Satisfy. I can't give up!\"\n\nI'd always been a supporting actor. In life. In this game. But not anymore. At least in Satisfy, I could be the star. Stars don't quit.\n\nI threw myself through the air and wrapped around Huroi.\n\n**Peeeeok!**\n\nThe blow hit undefended. Red filled my vision. My body shook violently. Then calm returned.\n\n> [You have been hit by a critical blow!]\n> [A legend doesn't die easily. You will resist all attacks for 5 seconds with a minimum of health.]\n\nBlood poured from the wound. Huroi's armor turned slick with it beneath my arms.\n\n\"G-Grid...?\" \n\nHis voice trembled as the stun wore off. He looked up at me.\n\n\"Why... why do you keep sacrificing yourself for me?\"\n\nTears gathered in his eyes. I drank a health potion and gave orders.\n\n\"Attract that bastard's attention and buy some time. I need to recover.\"\n\n\"Kuoh...!\"\n\nHuroi gritted his teeth and rose. He chugged potions. Health, buffs, the works.\n\n\"I will surely hand his head to My Liege!\"\n\n*There he goes again.* The historical drama act resumed. He was thrilled I'd protected him.\n\n*I didn't do it for you.* But letting him think otherwise wouldn't hurt.\n\nI checked my potions. Intermediate health potions restored 1,500 each. Total health: 7,886. I needed four potions before reaching maximum.\n\n*The potion cooldown is 20 seconds. Huroi needs to survive for one minute and twenty seconds.*\n\nHuroi performed beyond expectations. He retrieved his scattered shield and blocked the chieftain's strikes. Then reached into his inventory.\n\n*What's that?*\n\nGlass bottles. He hurled one at the chieftain. It shattered against the orc's shoulder. Flames erupted.\n\n\"Kieeeeeeek!\"\n\nThe chieftain's eyes widened with primal fear as fire consumed his flesh.\n\n*Firebomb! Right. Frostlight orcs are weak to fire.*\n\n*How did Huroi get firebombs? Did he prepare them before coming here?* I reassessed him. *He's more capable than I thought.*\n\nHuroi drew more bottles from both hands.\n\n\"Take this! 49 Firebomb Bombardment!\"\n\n*Did he get too excited?* The childish technique name echoed across the battlefield as bottles flew in rapid succession.\n\n**Pepeng! Pepepepeng!**\n\nThe chieftain's massive body became a bonfire.\n\n\"Kiyaaaaah~!\"\n\nHis screams pierced the sky. Huroi exhausted his supply and drew his sword again, charging into the flames.\n\n**Puuok! Puuok!**\n\nI clenched my fist as blue blood sprayed. *Did the raid succeed?*\n\nNothing was that easy.\n\n\"Kuruk! Kuruk! Kuruk!\"\n\nThe burning chieftain snorted through Huroi's attacks. He pulled a small bead from his pocket and raised it skyward.\n\n\"What is he doing?\"\n\nHis blue skin flushed crimson. Dark clouds gathered overhead. The atmosphere itself changed. He was activating something tremendous.\n\nHuroi countered with his own skill.\n\n\"Strong Will!\"\n\nSimultaneously.\n\n\"Kuoooooh!\"\n\n**Kwarururung!**\n\nAs the chieftain turned fully red, a crimson lightning bolt tore from the sky and struck his axe. He leveled the crackling weapon at Huroi.\n\nThe momentum suggested it could shatter Winston's walls. I mentally calculated Huroi's death.\n\nThen.\n\n**Kwaang!**\n\n\"Kuruk?\"\n\nThe chieftain's red axe crashed against Huroi's forehead. And stopped. It couldn't penetrate.\n\n*I saw this before.* Memory surfaced of Winston's dungeon. *He blocked that knight's attack with his body too.*\n\nHuroi possessed ridiculous defensive capabilities. The axe slid aside. Huroi transitioned immediately to offense.\n\n\"Aaaaaaah!\"\n\n**Puuok!**\n\nHe stabbed. Again. Again. No breaks.\n\n\"Kuwek! Kieeeek!\"\n\nAftermath from using the lightning skill? Or too much damage from the firebombs? The chieftain reverted to blue and could only defend weakly.\n\nHuroi's skill came off cooldown.\n\n**Peeeeeong!**\n\n\"Kuaaaaah!\"\n\nUnbreakable Justice hammered the abdomen. The chieftain collapsed. Huroi climbed onto the fallen monster and stabbed downward repeatedly, ignoring the damage to himself.\n\nThe beating continued until the chieftain swung wildly and launched Huroi away. Then the orc rose, swinging his axe in berserk patterns.\n\n\"Kuooh!\"\n\nDespite the bombardment and stabbing, the chieftain showed no signs of dying. Huroi tried blocking with his shield initially, but the item was nearly destroyed. He retreated instead.\n\n*The end is close.*\n\nHuroi had been drinking potions steadily, but his health bar scraped bottom. He wouldn't last much longer.\n\n*Damn. I thought the firebombs won it.* So much for sitting back and collecting rewards. *I have to go forward again.*\n\nI prepared to move. Then Huroi's bloody form sprinted back toward the chieftain.\n\n\"Eh? Hey, Huroi! Don't overdo it! Pass the baton! While I fight, you stay behind and recover!\"\n\n\"Don't you know we can't cause much damage this way?\"\n\n\"But if you die, I'm left alone! Then the odds of winning disappear!\"\n\nI'd rather fight while Huroi healed. But his decision was made.\n\n\"My Liege! I will see you later! Sacrifice for Justice!\"\n\nHis sword blazed gold. His health drained until only 10,000 remained.\n\n\"What's this?\"\n\nThe golden blade struck the chieftain's chest. Something strange happened.\n\n\"Kieeeeeeek!\"\n\nThe chieftain, who'd endured firebombs and countless stabs, unleashed a dreadful scream. His health bar plummeted from that single strike.\n\nHuroi grinned. \"I will leave the rest to you.\"\n\n**Peeok!**\n\nThe enraged chieftain's axe connected. Huroi dissolved into grey light.\n\n> [Your party member Huroi has died.]\n\nI stood alone.\n\n\"Kuwaaah!\"\n\nThe chieftain roared and charged. But not like before. The wounds had taken their toll.\n\n\"Can't be helped.\" I activated my buffs. \"Blacksmith's Rage. Quick Movements.\"\n\n> [Blacksmith's Rage has been activated. Your attack power and attack speed will increase significantly for 20 seconds.]\n> [Quick Movements has been activated. Your agility and evasion rate will increase significantly for 1 minute.]\n\nMy body surged with temporary power. I used Wind Blast to strike precisely at the chest wound.\n\n> [You have dealt 1,090 damage to the target.]\n\n\"Kiek!\"\n\n\"Huh?\"\n\nThe damage was significantly higher. The chieftain flinched in visible distress.\n\n*Sacrifice for Justice did this.* I pieced it together. *The skill consumes health to deal massive damage and reduce enemy defense.*\n\nI drank a mana potion and pressed the attack aggressively.\n\n\"Unbreakable Justice!\"\n\n**Peeng!**\n\n\"Kiyaaaaak!\"\n\n> [You have suffered 5,006 damage.]\n\nThe chieftain's resistance was crumbling. His skin flushed red again as he swung wildly. He reached for the bead to summon lightning.\n\nI had to kill him before the transformation completed.\n\n> [You have dealt 1,600 damage to the target.]\n> [You have dealt 1,711 damage to the target.]\n> [You have suffered 2,203 damage.]\n> [You have dealt 1,509 damage to the target.]\n> [You have dealt 1,830 damage to the target.]\n> [You have suffered 2,500 damage.]\n\nI didn't retreat. I stood my ground and attacked as fast as possible. *If I back down now, the lightning will finish me.* This was the moment to win.\n\n\"Kuwaaah!\"\n\n\"Ohhhhhh!\"\n\n**Peng! Peng!**\n\n**Puk! Puuok!**\n\n> [You have suffered 2,154 damage.]\n> [The Apostle of Justice's bravery is unmatched.]\n> [The Apostle of Justice is in crisis. You won't easily collapse in front of enemies.]\n> [All stats will increase by 30%.]\n\nMy health dropped below 10%. The crisis passive triggered, boosting my attack power.\n\n> [You have dealt 2,480 damage to the target.]\n> [You have dealt 2,502 damage to the target.]\n\n\"Kuock! Kuwoook!\"\n\nThe chieftain's entire body blazed crimson. A red lightning bolt flashed across the sky. Would that electrified axe fall on my head? Or would the chieftain die first?\n\nI didn't know. The only thing I could do was attack.\n\n**Kwarurung!**\n\nLightning struck the axe. At the same moment, Unbreakable Justice came off cooldown. I stared at the descending weapon and activated my skill.\n\n**Peeeeeong!**\n\n\"Keok...ke...\"\n\nJust before the axe split my skull.\n\n\"Kieeeeeeek!\"\n\nUnbreakable Justice pierced the chieftain's chest. He screamed and coughed blood. Knelt. Dissolved into grey light.\n\n> [You have defeated the frostlight orc chief.]\n> [750 gold has been acquired.]\n> [Blessed Weapon Enhancement Stones (2) have been acquired.]\n> [Blessed Armor Enhancement Stones (3) have been acquired.]\n> [Frostlight Orc Chief's Helmet has been acquired.]\n> [Red Lightning Summoning Bead has been acquired.]\n> [Sylphid scales (7) have been acquired.]\n> [3,554,000 experience has been acquired.]\n> [Your level has risen.]\n> [Your level has risen.]\n\nSeven sylphid scales. Various items. A massive amount of gold. Two levels.\n\nVictory."
}