{
  "id": 710,
  "title": "Chapter 710",
  "content": "When people spoke of genius in Satisfy, one name dominated the conversation: Kraugel. The world saw him as a prodigy, a collection of impossible talents—the reason he'd climbed to the summit above two billion players.\n\nBut the truth ran deeper. The world was vast, and monsters lurked in every shadow. If Kraugel possessed only natural talent, he would never have reached the top. What set him apart was relentless effort. He fought not just to maintain his position, but to climb higher still. In many ways, he was what Grid aspired to become.\n\nThen there was Agnus.\n\n*Good. The fool finally understands. Otherwise, saving him would've been pointless.*\n\nHere stood a man who'd reached the pinnacle through comparatively little effort. Despite claiming one of only three Epic Hidden Classes, Agnus languished at seventh in the unified rankings. Most dismissed him—*Can't even place first with an Epic Class? Must lack talent.*\n\nThose who truly knew Agnus thought differently.\n\nUnlike other rankers, death held no terror for him. He chased only pleasure, playing for momentary thrills rather than calculated gain. The penalties he accumulated would have destroyed an ordinary player's career. Yet not only did Agnus hold seventh place, he also bore the title of \"one of the strongest.\" A genius, in his own twisted way.\n\nNow, having saved Grid's life, Agnus made his next move based on pure instinct.\n\nKyle—one of the Empire's Five Pillars. The weakest of them, perhaps, but still over level 450. Defeating him required something special. Agnus grasped the solution immediately: pit Mumud against Braham, both empowered by the quest's level correction.\n\n\"Summon Lich! Mumud!\"\n\n[Lich Mumud has been summoned!]\n[Mumud has detected Braham's soul!]\n[The quest *Braham VS Mumud* has been triggered!]\n[Lich Mumud's level has increased to 400. Some sealed magic is now available. However, control is impossible.]\n\nThe magician whose talent transcended legend drew forth a portion of his true strength.\n\n\"You mad bastard! **Fireball!**\"\n\nBraham—legendary genius and supreme talent—unleashed his own magic. When these two apocalyptic forces collided, Agnus calculated Kyle would be caught in the middle.\n\nPerfect.\n\nTwin spheres of flame erupted from Mumud and Braham, racing toward each other. Kyle stood at ground zero.\n\nThe explosion tore through Liberon Forest.\n\n\"Fall back! Everyone fall back!\"\n\nAres frantically ordered his troops to retreat. The imperial army, leaderless and confused, failed to react in time. The carnage was absolute.\n\nThe shockwave rippled outward. Secondary detonations followed, chaining through the forest. Imperial soldiers vanished in walls of fire. Agnus surveyed the blood and corpses, his laughter rising above the chaos.\n\n\"Yes! *Yes!* More! Tear them apart, Mumud! Give me more!\"\n\n\"...Agnus.\" Veradin's voice cut through the hysteria. \"Remember why we came here.\"\n\nIt took effort to anchor the necromancer to reality.\n\n***\n\n[Braham's soul has found Lich Mumud!]\n[The quest *Braham VS Mumud* has been triggered!]\n[Your level has increased to 400. Some sealed magic has opened due to increased Intelligence. You cannot control your body.]\n[Braham has taken control of your body and equipped **Belial's Staff**.]\n\n\"**Fireball!**\"\n\nThe moment Agnus summoned Mumud, Braham seized Grid's body and attacked. He targeted only his former disciple. Mumud responded in kind, arcane power crackling between them.\n\n*We're finished,* Grid thought.\n\nThen—\n\nThe twin spells converged. Kyle stood at the intersection point, caught between impossible forces. No escape. No defense.\n\nThe world went white.\n\n[You have dealt 3,250,900 damage to the target.]\n\n*This is the power of a legendary magician wielding a myth-rated staff.*\n\nThe earth heaved. Kyle's scream cut through the thunder of colliding magic.\n\nA chill ran down Grid's spine. *Did Agnus plan this?* The positioning was too perfect—himself, Agnus, and Kyle forming an ideal triangle. But then:\n\n\"More! *More!* Ravage everything, Mumud!\"\n\n*...No. That madman doesn't think like that.*\n\nThe relief was short-lived. Braham and Mumud focused only on each other. If Kyle recovered and counterattacked while they fought...\n\n*He'll destroy us from behind. Braham, please—calm down!*\n\nGrid tried to shout through Braham's control of his body. \"Mumud! I'll grant you rest!\"\n\nIt didn't reach him. Braham's consciousness belonged entirely to his ancient student.\n\n*Damn troll.*\n\n***\n\nKyle lay on scorched earth, robes in tatters. His pristine white appearance was now ash and blood.\n\n\"What... what *are* they?\"\n\nHe stared at Braham and Mumud, magical auras radiating from both figures. The power rolling off them matched his own. Kyle had long prided himself on surpassing even legendary magicians after claiming magic power far beyond any great magician.\n\nNow, faced with two equals? And Grid—\n\n*How can the Undefeated King's descendant use magic?*\n\nThe Undefeated King's legend spoke of hundreds of thousands slain by the sword. Never magic. Yet Grid wielded power that transcended great magicians!\n\n\"**Fireball.**\"\n\n\"*Ahhh!*\"\n\nAnother exchange. Another cataclysmic explosion.\n\n\"Ugh!\"\n\nKyle stumbled away from the bombardment. He needed to escape. But the two monsters fought *around* him, pinning him at the epicenter of their duel.\n\nBlast after blast tore through the forest.\n\n\"Gah!\" Kyle coughed blood. This couldn't be happening.\n\n*This is **Fireball**? Not Meteor?*\n\nFireball was the most basic spell—fast to cast, but weak and inaccurate. These versions defied classification. They combined the casting speed of a low-tier spell with the accuracy and devastation of supreme magic. It reminded him of tales about the legendary great magician Braham...\n\n*No. That's impossible. This is the Undefeated King's descendant.*\n\nKyle shook his head violently, rejecting the thought. Grid had acquired Braham's magic? Absurd!\n\n\"There's something I don't understand here.\"\n\nHe had to retreat. Analyze this disaster later, from safety. Kyle forced his trembling body to move, calling on the Blue Dragon's power—\n\n\"Kyle, you have excellent natural magic power, but your understanding of magic formulas is severely limited. Walking this path is useless for you. I give up my hopes. Leave. Even looking at your face pains me.\"\n\nHis teacher's words echoed as sacred energy filled his body. Lightning began to gather around him. Then:\n\n\"**Fireball! Fireball!**\"\n\n\"*Kyaaaah!*\"\n\n\"...!\"\n\nThe bombardment intensified. Grid and the lich accelerated their casting, spell after spell crashing through the space where Kyle struggled to escape.\n\n\"*Ahhhhh!*\"\n\nLight engulfed him. He broke free of the explosion's radius—at the cost of his left arm, torn away by the shockwave. He was a Pillar of the Empire. This humiliation—\n\n\"Ah... *gah...*\"\n\nKyle's eyes went bloodshot. His gaze locked onto Grid.\n\n\"Someday... I'll repay this...!\"\n\n\"Hm? What was that, insect?\"\n\n\"Agh!\"\n\n*I'll run now, but next time—*\n\nThe thought died. Grid, who'd been focused entirely on Mumud, suddenly turned to look at Kyle. The gaze held no emotion. No recognition. Kyle felt like an ant beneath a boot.\n\n\"You have a violent temper for such a small thing. Do you want to die?\"\n\nBraham, wearing Grid's body, spoke in his characteristic tone. To Kyle—one of the Five Pillars of the Saharan Empire.\n\n\"I'm s-sorry! Forgive me!\"\n\nKyle bowed and fled.\n\nHe wouldn't forget the face beneath that straw hat. Grid's face. Later, this would matter.\n\n***\n\n[Kyle has retreated!]\n[The quest *Secret Mission* has been completed!]\n\nAgnus had achieved his objective.\n\n\"Kill me.\"\n\nHe turned to Veradin with the order. The extreme choice—death to forcibly end the quest and recall Mumud from his uncontrollable rampage. Not out of any concern for Grid.\n\nNo, the journey through the forest had nearly killed him already. Grid and Ares' army had taken their toll. Agnus didn't fear death, but losing the *Braham VS Mumud* quest would be a catastrophic waste. Better to end it on his terms. Veradin understood.\n\n\"I'm glad you've regained your senses.\"\n\n\"Hehehe...\"\n\nVeradin's blade found its mark.\n\nAgnus collapsed. Mumud vanished.\n\n\"I'll take my leave.\"\n\nAs Grid's hair faded from black back to its natural color, Veradin disappeared from the battlefield."
}