{
  "id": 711,
  "title": "Chapter 711",
  "content": "\"Chase them down! Not one escapes alive! Show no mercy! Carve our name into the Empire's nightmares!\"\n\nThe moment Braham and Mumud appeared in Liberon Forest, the retreat began. The Red Knights and imperial forces fled without a backward glance. Their grand ambition to crush Valhalla and the Undefeated King's descendant? Shattered. With the Third Knight defeated, no one remained who could face that monster—the man who'd driven off one of the Five Pillars himself.\n\n\"Kuack!\"\n\n\"Hiiik!\"\n\nThe imperial soldiers scrambled to escape this hell, but the forest itself conspired against them. Treacherous terrain and hostile climate slowed their retreat to a crawl. Meanwhile, the Valhalla troops—trained in these very woods—surged forward with soaring morale, closing the distance with terrifying speed.\n\nPuk!\n\nPuk puk puk!\n\nChukakakakak!\n\nA massacre unfolded. The Valhalla soldiers became devils incarnate, deaf to pleas for mercy, blind to raised hands of surrender. This was their message to the Empire: *Never underestimate Valhalla again.*\n\n\"You bastards...!\"\n\nDia, the Fifth Knight, watched his men cut down like wheat. Rage burned in his chest at these upstarts who dared defy the Empire. Yet he didn't move to help the dying soldiers. His duty was to the Red Knights—not expendable troops who could be replaced tomorrow.\n\n*Without Mercedes, we've been devastated. If I lose what remains of the Knights, I'll never face her again.*\n\nKwajak!\n\n\"Kuak!\"\n\nHe swept aside another pursuer, buying the Red Knights precious seconds. One thought brought him cold comfort: Kyle, the Emperor's favorite, had failed to stop the Undefeated King's descendant. Which meant the Red Knights' defeat was inevitable. The Emperor couldn't punish them without punishing his beloved Kyle.\n\n*...Though it is surprising.*\n\nDia recalled Kyle's helplessness before the lich's bombardment and the descendant's relentless assault.\n\n*Weaker than his reputation. Even as the weakest of the Five Pillars, he couldn't match Lorex.*\n\nIf Kyle couldn't defeat the man who'd killed Lorex, then Kyle was clearly inferior. The Five Pillars' fame was hollow boasting.\n\n*What does that mean for Mercedes and Lucas?*\n\nThe First and Second Knights. Their reputations towered above all others, yet the Emperor suppressed their achievements at every turn.\n\n*In truth, Mercedes surpasses the Five Pillars.*\n\nDia held the rear position, placing himself between the enemy and his retreating comrades. The most dangerous post. The duty of a leader.\n\n\"Look at the Red Knights scurrying like rats! Puhuhu!\"\n\nLuck of Valhalla thundered alongside him—reins in one hand, massive guandao in the other. As the gap closed between them—\n\nPeeeeeong!\n\nThe polearm carved through the air. Dia caught it with his blade, but the impact jarred his entire torso.\n\n\"You...!\"\n\nDia's eyes widened. He'd crossed swords with Luck before—always on foot, always with Dia holding the advantage. Now, mounted and wielding a reach weapon, Luck's attack power had *doubled*.\n\nLuck grinned savagely. \"My horse riding mastery is maxed out! And swords? Terrible weapon for mounted combat!\"\n\nJeeeong!\n\nThe guandao descended vertically with crushing force. Dia's guard buckled.\n\n\"Sir Dia!\"\n\nBehind him, the Red Knights wheeled their mounts around.\n\n\"Keep moving!\" Dia roared. \"Get to Mercedes!\"\n\n\"B-But...!\"\n\nThey understood the situation all too well. Dia had held back *thousands* while Lorex dueled the descendant. He was already exhausted. Now he faced a surging enemy force alone.\n\n\"I am the Fifth Knight! My duty is to *protect* you!\"\n\nA leader protects his subordinates. Just like Mercedes.\n\n\"I will hold them! Ride! Don't look back—reach the capital!\"\n\nJjang! Jjang! Jjeejeeeong!\n\nDia grunted under the relentless barrage, abandoning all hope of survival. He pivoted to face Luck directly. Dozens of elites—Scott among them—supported the mounted warrior. But Dia felt no fear.\n\n\"The Red Knights are eternal...!\"\n\nPiaro. The name that was taboo to speak. In his youth, Dia had served in the Black Knights and worshipped that legendary figure. He'd dreamed of becoming a Red Knight who could destroy enemies on the front lines while protecting his comrades.\n\n*In the end, I never achieved that dream...!*\n\nJjejeong! Jjang!\n\nHis sword twisted and opened a gash across Luck's chest.\n\n\"Cough!\"\n\nLuck spat blood.\n\n\"I have no regrets!\"\n\nDia's battle cry rang out even as Scott's blade pierced his chest from behind. His sword never stopped moving. He cut down every enemy who approached, an immovable wall buying seconds with his life. Finally—\n\n\"...A magnificent warrior.\"\n\nBy the time the Ares forces broke through, the Red Knights had vanished over the horizon. Dozens of Valhalla troops lay dead. He truly was a solo number knight.\n\n\"Your final words?\"\n\nAres honored this enemy with the highest respect a warrior could offer.\n\n\"I...\"\n\nDia's eyelids drooped. His vision blurred and swam.\n\nFlop!\n\nHe fell to his knees, legs finally giving way. Yet his fingers never released the sword.\n\n\"...I... believed in Piaro... I never doubted you... Not once...\"\n\nHis voice faded to a whisper.\n\n\"One day... your name will be cleansed of betrayal.\"\n\nSwaaah.\n\nWho were these final words meant for? Dia coughed black blood, and his body dissolved into grey light. Ares stood in silence.\n\n***\n\nKyle had fled. Agnus had chosen death. Grid sat apart from the battlefield, catching his breath while Valhalla's army mopped up the stragglers. Then Braham's deep voice echoed in his mind.\n\n—*Grid.*\n\n\"Oh, you're conscious?\" Grid's tone dripped sarcasm. \"Last time you saw Mumud, you fainted. How'd you manage to stay awake today? Color me impressed.\"\n\nBraham never helped when it mattered. This time things had worked out, but Grid still felt bitter. Braham's response was completely unexpected.\n\n—*I'm sorry.*\n\n\"...?\"\n\nThe man who considered himself heaven's greatest gift to earth! Pride incarnate! Yet here he was... *apologizing?*\n\n\"W-What? Did you eat something rotten?\"\n\nBraham's voice carried an unusual gentleness.\n\n—*I failed to recover my body and came to you in the Behen Archipelago. Do you remember what I asked when I borrowed your body?*\n\n\"...?\"\n\nThis tenderness was so unlike him that Grid felt genuine confusion. Then memory surfaced—a quest notification from years ago.\n\n[Legendary Great Magician]\n\n★ Hidden Quest ★\n\n*Braham has failed to recover his original body. He seeks refuge in a safe space until his magic power is restored, and has chosen your body as that sanctuary.*\n\n*Accepting Braham's soul will grant you immense power.*\n\n*Quest Acceptance Reward: 50% increase in affinity with Braham, acquisition of the legendary second class 'Legendary Great Magician.'*\n\nAn ongoing quest. Grid had gained a legendary class and Braham's companionship for three years.\n\n*That's right... Braham said he needed one to four years.*\n\nIt had been three years in Satisfy time.\n\n\"...Have you recovered your magic?\"\n\nGrid's voice shook. The realization hit him like a physical blow—Braham would leave. The thought of separation brought unexpected grief. When had this insufferable troll become so precious? Despite everything, Braham had saved him countless times. Infuriating or not, he was Grid's strongest ally.\n\nHis friend.\n\nBraham sensed the emotion behind Grid's words and sniffed softly.\n\n—*Yes. Fully recovered. This should be a happy occasion. So why do you sound like that? Do you... actually like me?*\n\n\"...\"\n\nGrid couldn't deny it. Braham meant too much to hide behind false pride.\n\n—*...*\n\nAn uncomfortable silence stretched between them. This vulnerability was new for Braham. Since being cast out from the vampire world and living as a human, he'd learned what affection meant. He'd treasured Pagma. He'd worried over Mumud. And now, he cared for Grid. Braham forced cheer into his voice.\n\n—*This is good news. We're both free now. I'll restore my body, and you won't suffer because of my actions anymore.*\n\n*Suffer.* The word struck Grid's chest like a hammer. He understood—Braham blamed himself for losing control around Lich Mumud. Grid rushed to correct him.\n\n\"No. Braham, you've never hurt me. Think about it. Would I even be here without you? I've been nothing but grateful for your company.\"\n\n—*...Thank you.*\n\nThe words came with difficulty. Braham's voice trembled. Grid's throat tightened.\n\nPaaaat!\n\nDeep in Grid's chest, the wellspring of power stirred. Braham's soul began pulling away.\n\n\"Wait! Why the rush? Take your time! Don't just leave!\"\n\n—*Kukuk, I've waited three years for this moment. I want my body back. My *complete* body.*\n\n\"Even so! This is too sudden! After all this time together, say something! Anything!\"\n\nGrid's voice cracked with emotion. This abrupt separation felt impossible to accept.\n\nBrrururung.\n\nBraham's soul pulsed—moved by the knowledge that he'd become precious to someone.\n\n—*...I'll give you a gift. I'm embedding my magic formulas in your body. When your intelligence is high enough, you can learn new spells. You won't miss me.*\n\n\"Braham...!\"\n\n—*Kukuk, don't be so sentimental. I told you—I'm reclaiming my flesh. We live in the same era. We'll meet again.*\n\nPaaaat!\n\nBraham's soul emerged from Grid's chest, ascending rapidly. His voice faded to silence.\n\n\"Braham!\"\n\nGrid reached toward the brilliant blue light streaking skyward...\n\n*Stay well.*\n\nBraham didn't look back. The soul blazed across the sky like a shooting star.\n\nJjejeok! Jjejejejeok!\n\nTiny cracks spiderwebbed across the luminous form.\n\n*In my current state, I can't guarantee victory against Lich Mumud. I'd only drive Grid to his death.*\n\nBraham had known from the beginning. His presence was becoming a liability. At first, he hadn't cared—Grid was merely a vessel while his power recovered. But time changed everything. He refused to burden Grid anymore.\n\n*Don't worry. Even if I die and fall to hell, I'll repay this debt. Be well. Live without regrets.*\n\nJjeok! Jjejejejeok!\n\nThe cracks multiplied across the azure soul. Braham ignored them, focusing all his will on a final goodbye.\n\n*New legend... I praise you. I fear you. I love you.*"
}