{
  "id": 712,
  "title": "Chapter 712",
  "content": "# Chapter [X]: The Weight of Solitude\n\n> [Braham's soul has left.]\n\nA single notification. That was all the system offered for the departure of a friend who had shared Grid's very heartbeat for months.\n\n*The system doesn't understand,* Grid thought numbly. *It can't.*\n\n\"Braham...\"\n\nThe name escaped his lips like a prayer to an absent god. His chest felt hollow—no, worse than hollow. It was as if someone had reached inside him and carved out something essential, leaving behind a void that pulsed with phantom pain.\n\nGrid's legs refused to move. He stood rooted to the blood-soaked earth of Valhalla's border, his gaze fixed on the fading blue luminescence that traced Braham's ascent through the sky. Minutes bled into hours. The ethereal trail had long since dissipated, but Grid remained, a solitary statue among the aftermath of war.\n\n***\n\nFive hours.\n\nOasis had been watching Grid for five hours now, and the man hadn't moved. Hadn't even shifted his weight.\n\nThe candidate for the Undefeated King's succession—though he felt that title slipping further from his grasp with each passing day—stood among the Ares Army as they processed prisoners and tended to the wounded. His eyes kept returning to that distant figure.\n\n*Why?*\n\nThe question gnawed at him. Here stood Pagma's Descendant. Grid. The hero who'd carved his name into this era with blood and steel and impossible feats. The first player to claim a kingdom. A man who commanded wealth that would make emperors weep, fame that eclipsed the sun, and—Oasis's gaze flickered to the soldiers whispering admiringly about their king—the adoration of countless followers.\n\nAnd now, impossibly, Grid wielded the Undefeated King's swordsmanship too.\n\nWhen Oasis had first witnessed those techniques—*his* techniques, the ones meant for *him*—a bitter darkness had seized his heart. *Why is the world so unfair? This game is only for protagonists. Grid hoards all the luck in existence while the rest of us...*\n\nBut that resentment had curdled into something else as the hours crawled by.\n\n*What is he doing?*\n\n\"Replaying the battle,\" Oasis murmured to himself, conviction solidifying. \"He's analyzing every moment, burning the lessons into his mind.\"\n\nIt made sense. Grid was famous for this—the obsessive dedication that separated legends from the merely skilled. After every major event, Grid would sequester himself, dissecting his performance with surgical precision. Hours upon hours of mental review, transforming experience into exponential growth.\n\n*That's why he's different.* Oasis's grip tightened on the Undefeated King's Old Sheath at his hip. *That's why he's the protagonist and I'm...*\n\nThe thought trailed off, incomplete and damning.\n\nAres had been right. Luck was a myth. Grid hadn't stumbled into greatness—he'd *earned* it with this exact kind of relentless self-improvement. While others celebrated victories, Grid studied them. While others rested, Grid refined himself.\n\n*I can't even be jealous anymore,* Oasis realized, something like awe replacing the envy. *He's simply... operating on a different level.*\n\nBut with that realization came another, more painful one. His hand drifted to the sheath again—the legendary item that had chosen him, that had promised him a path to greatness.\n\n*Can I really keep this?*\n\nThe question had haunted him since Lubana, since the moment his quest had failed and Grid had demonstrated the very techniques Oasis had been meant to inherit. The Undefeated King's swordsmanship belonged to Grid now. If Grid also possessed the sheath...\n\n*He'd become the true successor. Immediately.*\n\nOasis's jaw clenched. Grid already had Pagma's Descendant. Already commanded a kingdom. Already stood at the pinnacle. But this sheath—this was Oasis's one chance at relevance, his single legendary-tier opportunity.\n\nAnd yet.\n\n*Grid is the rightful owner.*\n\nThe admission tore something inside him, but it was the truth. Grid embodied everything the Undefeated King had represented: overwhelming power, tactical brilliance, the ability to stand alone against impossible odds. Grid had *earned* this legacy.\n\nOasis took a breath, then another. His feet began moving before his mind could intervene.\n\nEach step toward Grid felt like approaching a natural disaster—beautiful and terrible in equal measure. His heart hammered against his ribs. The man who'd seemed merely impressive on broadcasts and at a distance... up close, he radiated something Oasis couldn't name. Pressure. Presence. *Weight.*\n\n\"H-Hello?\"\n\n*Damn it.* He'd bitten his tongue. Heat flooded his face.\n\nGrid turned, and Oasis's breath caught.\n\nThose eyes. Black as midnight, deep as an abyss. They held *centuries* in their depths—impossible for someone supposedly the same age as Oasis. This wasn't the Grid from the broadcasts, all swagger and sharp edges. This Grid looked... ancient. Worn. Profoundly, devastatingly sad.\n\n\"What can I do for you?\"\n\nThe polite formality of the question shocked Oasis more than anything else. Grid—the Grid who cursed at emperors and trash-talked rankers without a second thought—was using *honorifics*?\n\nOasis floundered, his prepared speech evaporating. \"Ah, t-that...\"\n\n\"I don't know what's going on,\" Grid said, and impossibly, he smiled—a gentle expression that transformed his face entirely, \"but feel free to speak your mind.\"\n\nThat smile hit Oasis like a physical blow. In Grid's eyes, he saw something unexpected: recognition. Understanding. As if Grid looked at him and saw not a stranger or a potential rival, but... himself? A reflection of something familiar?\n\nThe kindness in that gaze undid something in Oasis's chest. *When was the last time someone looked at me like this? Like I mattered?*\n\n\"Please accept this.\"\n\nThe words tumbled out as Oasis thrust the Undefeated King's Old Sheath toward Grid with both hands. His reasoning crystallized even as he moved: *If I do this—if I help create the true Undefeated King's successor—he'll reward me. Legendary items. A position in his kingdom. A chance to be something more than a failed candidate.*\n\nGrid's expression transformed in an instant. The gentleness vanished, replaced by a thunderous scowl.\n\n\"Hey, are you—\" He bit off what sounded like the beginning of a curse. \"Is this a *joke?*\"\n\n\"Wh-what?\" Oasis stammered, his extended hands suddenly trembling.\n\nGrid snatched the sheath and immediately shoved it back, his eyes blazing. \"A person is trying to hold himself together, and you pull *this?* You want to mock me with some *japtem* right now? What the hell is wrong with you?\"\n\n\"*Japtem?*\" The word came out strangled. *Japtem. Trash loot. He called a legendary-tier item trash.*\n\nImpossible. Unless—\n\nPanic seized Oasis. Had the sheath lost its power? Had his failed quest somehow corrupted it? But then—\n\n—*Do you believe you can surrender ownership so easily? The choice was never yours to make.*—\n\nThe voice resonated from the sheath, not through Oasis's ears but directly into his consciousness. Ancient. Imperious. *Alive.*\n\n\"I... I didn't lose my qualifications?\" Oasis's voice cracked on the question, barely a whisper.\n\n—*Whether you have or haven't is for me to judge, not for you to assume. Stop thinking about it.*—\n\nTears pricked Oasis's eyes. The dream he'd mourned—the future he'd buried—suddenly roared back to life. His chest heaved with the force of suppressed sobs.\n\nGrid watched this display with flat, unimpressed eyes.\n\n*Great. Just great.* His earlier impulse toward kindness shriveled and died. *The guy's having a full conversation with an imaginary friend right in front of me. Completely insane.*\n\nOnce again, the universe reminded him: being nice to strangers was a sucker's bet. This was clearly some twisted, attention-seeking weirdo.\n\n\"Grid!\"\n\nHoofbeats announced Ares's arrival. The God of War dismounted with practiced ease and dropped into a deep bow.\n\n\"I can't thank you enough. Your intervention turned this from a delaying action into a *decisive victory.*\" Ares clasped Grid's hand with both of his own. \"Liberon Forest was only supposed to be the first interception point. We had fallback positions prepared throughout the region, traps and ambush sites that would've cost us resources and lives. Because of you, the Empire's expeditionary force is *broken.* We won't need any of it.\"\n\n\"I didn't do it for gratitude.\" Grid's voice was carefully neutral.\n\n\"I know.\" Ares's smile was understanding. \"You fought for the Overgeared Kingdom's future, not Valhalla's. But that doesn't change the fact that my kingdom benefited enormously. Allow me to repay the debt.\"\n\nHe clapped twice, sharp and commanding.\n\nFive hundred soldiers emerged from the Ares Army's ranks, moving in perfect formation. These weren't raw recruits—every movement spoke of discipline and training.\n\n\"Elite troops,\" Ares explained. \"Each one has been blessed with superior attributes. The war pushed them to level 270. With the right guidance, some of them could achieve knighthood.\"\n\nGrid blinked. \"That's... impressive, but—\"\n\n\"I'm giving them to you.\"\n\n\"You're *what?*\"\n\n\"These soldiers.\" Ares gestured expansively. \"They're yours. Take them to the Overgeared Kingdom.\"\n\n\"...\" Grid stared, momentarily speechless.\n\nAres's expression grew serious. \"Valhalla will supply military support to Overgeared. In return, Overgeared will supply equipment and items to Valhalla. This is the foundation of a true alliance—not just words, but concrete, mutual investment. I hope this is only the beginning of deeper cooperation between our kingdoms.\"\n\nThe weight of the offer settled on Grid's shoulders. Five hundred elite soldiers. Trained warriors who'd just survived a brutal campaign. The kind of core troops that could form the backbone of a professional military.\n\n\"I understand,\" he said finally. \"Thank you.\"\n\n\"The gratitude is mine, King Grid.\"\n\n***\n\nGrid departed Valhalla with his new troops in tow, cutting a figure that would've seemed impossible just months ago—a player commanding hundreds of NPCs with absolute authority.\n\nOasis watched him go, the Old Sheath warm against his palm.\n\n\"Isn't he perfect?\" he asked the presence within the sheath. \"Isn't he exactly the ruler you're looking for? Surely he could fulfill your wish?\"\n\nThe response came tinged with something that might have been regret:\n\n—*He's already a ruler. His vessel has grown too vast for the fragment of soul contained in this sheath to influence. He's beyond my reach.*—\n\n\"I see.\"\n\nOasis's eyes tracked Grid's retreating form—the straight back, the confident stride, the aura of absolute competence that made soldiers twice his level treat him with reverence.\n\n*Someday,* he promised himself, *I'll stand beside you. Not as an equal—I'm not delusional. But as someone you notice. Someone who matters in your story.*\n\n*Until then... keep winning. Keep climbing. I'll follow in your footsteps.*\n\nThe path Grid carved through this world—already, countless others followed it. He'd become the goalpost, the benchmark against which all others measured themselves.\n\nJust as Grid chased after Kraugel, now a generation chased after Grid.\n\nThe hero's journey continued. And in his wake, he left not destruction, but *inspiration*.\n\n***\n\nWhat Oasis didn't know—what *couldn't* have known—was the truth of those five hours.\n\nGrid hadn't been analyzing the battle. Hadn't been replaying combat sequences or planning future strategies.\n\nHe'd simply been standing there, drowning in grief, staring at the sky where the last traces of his friend had disappeared.\n\nTrying not to cry.\n\nTrying not to shatter.\n\n*Braham... I never even told you thank you.*\n\nAnd in that moment of profound loss, something had crystallized in Grid's understanding: respect wasn't a resource to hoard or a tool to leverage. It was a basic dignity that *every person* deserved—not because they'd earned it, but because they were *human.*\n\nHe'd spent so long suspicious of everyone, guarded and paranoid, that he'd never simply *seen* the people around him. Not really. He'd viewed Braham as a tool first, an asset second, and a person... barely at all.\n\nUntil it was too late.\n\n*I could've helped you,* Grid thought for the thousandth time. *I could've tried to find a way to restore your body, to bring you back to life. You gave me everything, and I never even tried to give you hope in return.*\n\n*Because I was selfish. Because I was scared. Because I didn't think you needed it.*\n\nBut everyone needed hope. Everyone needed kindness. Everyone needed to know that they mattered to someone.\n\n\"I'll do better,\" Grid whispered to the sky, to the ghost of his friend's departure. \"I swear it.\"\n\nAnd so, when an awkward stranger approached him—clearly struggling with nerves, clearly seeing Grid as something larger than life—Grid had made a choice.\n\n*Be kind. Show respect. Not because you expect anything in return, but because that's who you should've been all along.*\n\nIt hadn't worked out perfectly. The stranger had been weird, and Grid's grief had made him snap when offered the sheath.\n\nBut it was a start.\n\nThe first step of becoming not just a powerful player or a successful king, but a better *person.*\n\nBraham had deserved that person. The world deserved that person.\n\n*I'll become that person. For you.*\n\nGrid's hand drifted to his chest—to the hollow space where Braham's soul had once resided.\n\n\"Goodbye, my friend,\" he murmured. \"Thank you. For everything.\"\n\nThe sky offered no response, but Grid felt lighter somehow. The grief remained—would remain for a long time—but beneath it, something else had taken root.\n\nPurpose. Growth. The determination to honor Braham's memory by becoming worthy of the faith that impossible, brilliant, difficult soul had placed in him.\n\nOne step at a time.\n\nOne choice at a time.\n\nGrid turned his face toward home, toward the Overgeared Kingdom, toward the future.\n\nAnd took that first step forward."
}