{
  "id": 713,
  "title": "Chapter 713",
  "content": "**Name:** Hail  \n**Level:** 271  \n**Class:** Soldier  \n**Stats:** Strength 1,090/1,700 | Stamina 1,047/1,700 | Agility 600/1,000 | Intelligence 306/800  \n**Skills:** Intermediate Sword Mastery Lv. 1, Intermediate Spear Mastery Lv. 1, Beginner Bow Mastery Lv. 7, Beginner Shield Techniques Lv. 7, Beginner Horse Riding Lv. 3, Beginner Swimming Lv. 1  \n**Hidden Attributes:** Terrain Adaptability Increase, Climate Adaptability Increase, Increased Experience Gain, Recover All Resources at Level Up, Status Resistance Correction, Decreased Morale Drop Rate  \n**Status:** Depressed (*King Ares abandoned me... What did I do wrong?*)\n\n**Name:** Kan  \n**Level:** 275  \n**Class:** Soldier  \n**Stats:** Strength 1,290/1,400 | Stamina 1,347/1,500 | Agility 810/1,100 | Intelligence 106/500  \n**Skills:** Intermediate Sword Mastery Lv. 2, Intermediate Spear Mastery Lv. 2, Beginner Bow Mastery Lv. 9, Beginner Shield Techniques Lv. 9, Beginner Horse Riding Lv. 5, Beginner Swimming Lv. 1  \n**Hidden Attributes:** Terrain Adaptability Increase, Climate Adaptability Increase, Increased Experience Gain, Recover All Resources at Level Up, Status Resistance Correction, Decreased Morale Drop Rate  \n**Status:** Confused (*It's an honor to serve the famous Overgeared King... but what about my family back home?*)\n\n'...Insane.'\n\nEn route to the Overgeared Kingdom, Grid examined the 500 soldiers marching alongside him with the King's Sword—and found himself utterly astounded. Not because of their outstanding talent, no. By conventional measures of NPC potential—maximum stat caps and innate abilities—these soldiers were thoroughly ordinary. That's what made it so incredible.\n\n'To elevate common soldiers to this level...'\n\nTalented NPCs learned faster. Conversely, ordinary soldiers progressed at a crawl when developing their skills. Yet these 500 troops Ares had gifted him possessed remarkably high proficiency despite their mundane foundations. More importantly, the hidden attributes they carried were exceptional.\n\n'Especially that one—recovering all resources at level up. That's the secret behind Valhalla's overwhelming war performance.'\n\nGranting such unique attributes wasn't easy. The Overgeared soldiers had earned their Increased Adaptation in Rice Fields trait through relentless, specialized training. Despite drilling all day, they lacked the breadth of advantages these Valhalla troops enjoyed. As for recovering resources on level up? Grid had no idea how to instill such an attribute.\n\n'Just how powerful is Ares' Fostering Strong Soldiers skill?'\n\nHe imagined it—Ares commanding a million soldiers with that ability active.\n\n'...Terrifying. Absolutely terrifying.'\n\nGrid never wanted to face Ares as an enemy. But if it came to that...\n\n'We'd have to strike before Valhalla fully develops.'\n\nGrid was confident. If he led Asmophel, Chucksley, Maxong, and Overgeared's elite in a devastating frontal assault while Kasim and Faker assassinated key targets in the chaos, they could conquer Valhalla. However...\n\n'We'd take catastrophic losses and expose ourselves to the Empire.'\n\nAnnihilation would follow.\n\n'I don't want Ares as an enemy in the first place.'\n\nGrid genuinely liked the man. Who could hate someone with Ares' straightforward, bold personality?\n\n'...And he has the candidate for the Undefeated King's Descendant at his side.'\n\nOasis. The man who'd approached him and pressed a worn, ancient sheath into his hands. Grid recalled that encounter and silently wished him well.\n\n'Don't give up.'\n\nAt first, Grid had been baffled when a stranger suddenly handed him a sheath. Then he'd used Legendary Blacksmith's Appraisal on it—and felt a complicated mixture of anger and sympathy.\n\n> **[Undefeated King's Old Sheath]**  \n> ★ Quest Item ★  \n> A sheath used by the Undefeated King during his lifetime. Contains a fragment of the Undefeated King's will.  \n> **Conditions of Use:** Player character. Must not have died once since current class change.\n\nA quest item tied to the Undefeated King. Grid immediately understood Oasis' identity—he was the rumored descendant. No, a *candidate* for the title.\n\n'This is a precious opportunity you earned yourself. You shouldn't give it away to others.'\n\nWhy had Oasis tried to hand it over? Grid knew the answer.\n\n'He wanted to quit.'\n\nHe'd seen it in Oasis' eyes, in the shadows darkening his face. Oasis lacked confidence. Just like Grid had, once upon a time.\n\n'I used to talk to myself constantly...'\n\nThat's right. Grid was projecting his former self onto Oasis. That's why he felt both frustrated with the man and deeply sympathetic—why he wanted to cheer him on.\n\n'The quest is difficult right now, and you want to run. But don't give up. Hold on.'\n\nPersonal feelings aside, did that mean Grid coveted the Undefeated King's Old Sheath? Did he want it for himself? Absolutely not. Grid and his companions weren't afraid of failure—but none of them met the usage requirements. They'd all died at least once since their last class change.\n\n'Besides, nothing in this world is free. If I accepted the sheath, I'd owe him something in return.'\n\nMore pressing was addressing the 500 soldiers' declining morale. Grid spoke to reassure them.\n\n\"Don't worry about your families in Valhalla. In the name of the Overgeared King, I will bring them all to the Overgeared Kingdom.\"\n\nNaturally, Ares would cooperate if asked. The soldiers' eyes lit up at Grid's trustworthy expression.\n\n'Unbelievable... He read our anxiety without us saying a word and already prepared a solution...'\n\n'He's truly remarkable... This is the famous Overgeared King.'\n\nGrid won people over through action and results.\n\n***\n\n\"What?!\"\n\nFifty thousand soldiers annihilated. Multiple Red Knights dead. Kyle's left arm severed.\n\nEmperor Juander's fury blazed when the reports reached him. He'd wanted to suppress the Red Knights' influence, and common soldiers could be replaced easily enough. But Kyle's injury was catastrophic. It made pinning responsibility for this defeat on the Red Knights impossible, and would weaken the standing of the Five Pillars. As a result, Juander had failed to achieve any of his objectives. Worse, his prestige had taken a hit.\n\n\"Kyle...! Kyle, you fool! I trusted you!\"\n\n**KWAAAAANG!**\n\nRed Energy—the unique power passed down through generations of the Saharan imperial bloodline—erupted through the great hall. Juander's rage manifested as a tangible, crimson force that shook the very stones. Kyle's face went ashen.\n\n\"I am... ashamed.\"\n\nKyle couldn't raise his head. He was prepared to die. His failure had shattered the Emperor's plans and weakened his own position. Yet Juander remained cold. No matter how angry, he wouldn't be foolish enough to cut his own flesh.\n\n\"Confinement...! Don't show your face until I summon you!\"\n\n\"...You're sparing my life?\"\n\n\"Don't flatter yourself! I'm only keeping you alive because I have use for you!\"\n\n\"...I will repay this debt one day.\"\n\nKyle bowed deeply before Juander, then withdrew from the great hall. Left alone, the Emperor began to tremble.\n\n\"The Undefeated King's Descendant...!\"\n\nHalf the Red Knights destroyed. Kyle crippled—through *magic*? This power was incomparable to what had been witnessed at Lubana!\n\n'He can use magic too?'\n\nEven the legendary Undefeated King had never wielded magic. Unease coiled in Juander's chest.\n\n\"Could it be... that this descendant is *stronger* than the Undefeated King himself?\"\n\n***\n\nMany players knew the East Continent boasted higher difficulty than the West. It came as no surprise, then, that the people Grid had recruited from the East and brought to the Overgeared Kingdom far outperformed the Kingdom's native residents.\n\nTheir base levels were higher, and each excelled in their respective fields. Prime examples included the four blacksmiths from White Hammer smithy, the Red Phoenix Group, Sua, and Han Seokbong. Additionally...\n\n\"Oh no, it's time to water the garden! I need to hurry—\"\n\n\"Don't worry. Yang Fei already handled it.\"\n\n\"The Prince's afternoon snack isn't ready yet!\"\n\n\"Don't worry. Yang Fei already brought him a homemade pie.\"\n\n\"This is a disaster. Tomorrow's cleaning day, but I can't find the supplies—\"\n\n\"Don't worry. Yang Fei inventoried and organized everything.\"\n\n\"Sir Chucksley requested leave due to back pain. I need to summon Jude as a temporary escort for Prince Lord—\"\n\n\"No need. Sir Chucksley withdrew his request. His back pain vanished after Yang Fei gave him a massage.\"\n\n\"Yang Fei...\"\n\n\"Yang Fei...\"\n\nSuper Maid! That was the nickname that had attached itself to Yang Fei. After relocating to the Overgeared Kingdom, she demonstrated truly exceptional versatility. She'd developed these skills out of necessity—supporting a large family alone had taught her to handle any situation. Now, she'd risen to become a senior maid representing the Overgeared Palace. A commoner turned royal servant!\n\n'I'll devote myself even more!'\n\nYang Fei brimmed with motivation. Being able to showcase all her skills felt like a calling. This was heaven compared to working at Idan's restaurant.\n\n\"If I work hard enough... maybe one day King Grid will...\"\n\n\"What about Father?\"\n\n\"Come to me at night like the old days...\"\n\n\"At night?\"\n\n\"For a massage... *Kyaaah!*\"\n\nYang Fei's face flushed crimson as her imagination spiraled. She finally noticed the presence beside her and yelped. The cause was the five-year-old boy standing at her elbow. Black hair and a high-bridged nose resembling his father. Eyes like his mother's—gentle and blue as the sky. His face was a perfect oval with delicate features.\n\n\"P-Prince Lord...!\"\n\nThat's right. The smiling boy whose eyes sparkled like lanterns was Lord. As usual, he was covered in grime and dirt—hardly befitting a prince. Inevitable, considering he worked the fields in the morning, trained in martial arts in the afternoon, and handled royal business in the evening.\n\n\"Hello, Yang Fei.\"\n\n\"...\"\n\nHis bright, innocent expression froze Yang Fei in place. Lord's beauty was so flawless that even the composed Yang Fei found herself momentarily stunned. And he was only five years old. Then Lord asked an innocent question.\n\n\"Does Father massage Yang Fei every night? Is it nice?\"\n\n\"N-No! It only happened a few times years ago! Not recently at all!\"\n\nThey had been perfectly normal massages. But what Yang Fei had felt at the time was... different. Guilt crept into her voice despite herself. A strange smile appeared on Lord's face. The innocence washed away like a mask removed. He felt less like a five-year-old boy and more like a mischievous uncle.\n\n\"Teach me how to give massages. I want to give them to my girlfriends.\"\n\n\"...\"\n\n\"I'll keep it a secret from Mother. So? Want to go to my room?\"\n\nLord smiled again, playing innocent once more! Yang Fei—renowned for her composure and professionalism—couldn't help feeling flustered. He was clearly enjoying her reaction when a voice echoed from above.\n\n\"King Grid has returned. Prince Lord, please change clothes and go greet him.\"\n\nThe voice from the ceiling belonged to Kasim, the King of Shadows. With tensions mounting against the Empire, he'd devoted himself to escorting Lord and handed over leadership of the Overgeared Shadows to Faker.\n\n\"Father!\"\n\nLord's face lit up like the sun. Reunited with the father he respected and loved most in the world, he truly looked like the child he was."
}