{
  "id": 714,
  "title": "Chapter 714",
  "content": "**Chapter XXX**\n\n*Where did it all go wrong?*\n\nKasim had been wrestling with this question for weeks now. From the shadows of Prince Lord's chambers, the King of Shadows watched as the five-year-old child terrorized yet another palace maid. Nothing too severe—a command here, a dismissive gesture there—but troubling nonetheless. The boy was growing increasingly imperious, and that worried Kasim deeply.\n\nUnder normal circumstances, a spoiled child wouldn't merit concern. Every noble brat threw tantrums and abused their station. But Lord was far from ordinary.\n\nThe prince possessed an intellect that bordered on frightening. Concepts that should take months to grasp, he absorbed in days. Skills that required years of practice, he demonstrated after mere weeks. Kasim had trained assassins for decades, and he'd never encountered raw talent like this. The boy would undoubtedly become a legend—of that, Kasim had no doubt.\n\nWhich made Lord's emerging cruelty all the more dangerous.\n\nTake the incident earlier today. Lord had summoned Yang Fei to his study and kept her kneeling for over an hour while he \"considered\" a trivial request. The senior maid couldn't refuse. How could she? He was a prince. His whims were commands, his jokes were law.\n\n*For now, it's harmless enough,* Kasim thought, though the observation brought him no comfort. *But what happens when he grows older? When his power becomes absolute?*\n\nA prince's casual cruelty could destroy lives.\n\nKasim had made assassination his trade for forty years. He'd witnessed firsthand what happened when corrupt power went unchecked—the purges, the torture chambers, the mass graves. He'd helped orchestrate some of them himself, back when he still served the empire.\n\n*I've tried everything,* he thought, frustration gnawing at him.\n\nLord didn't lack for teachers. The legendary farmer Piaro taught him to understand the hearts of those who tilled the fields and stood the shield wall. Sage Sticks instructed him in ethics that transcended race and station. Master Blacksmith Khan demonstrated the humble dignity of true craftsmanship. Even Pope Damian occasionally visited to instill the virtues of faith and compassion.\n\nYet despite this wealth of guidance, Lord continued to twist into something ugly.\n\nKasim no longer saw the prince as merely a tool for revenge against the empire. Somewhere along the way, the boy had become like a son to him. Which made the failure hurt all the more. He'd been Lord's shadow since birth, his constant guardian and secret protector. If he couldn't fix this, who could?\n\nThe answer arrived in a clatter of armor and the smell of smoke.\n\n\"Lord!\"\n\nGrid burst into the prince's chambers, still wearing his battlefield plate. Soot and dried blood streaked the metal. He'd clearly come straight from the war front without even stopping to clean himself.\n\nThe Overgeared King's eyes found his son immediately. Lord sat at his desk, face flushed and damp with perspiration, surrounded by military treatises and economic ledgers that would challenge court officials twice his age.\n\nGrid's expression crumbled.\n\n\"What—? Oh, my boy. You've been pushing yourself too hard again.\" He crossed the room in three strides and swept Lord into his arms, heedless of the dirt and grime transferring to the child's fine clothes. \"I know studying is important, but... Lord, you're five years old. You should be making friends. Playing. Being a *child*.\"\n\n\"F-Father...\"\n\nLord's lower lip trembled. His eyes, so cold and imperious mere moments ago, now glistened with unshed tears.\n\nFrom birth, the weight of destiny had pressed down on the prince's shoulders. *Genius of the continent. Sole heir of the Overgeared Kingdom. Son of a living legend.* Millions of people across the realm held expectations for him, and he'd spent every waking moment trying to fulfill them all.\n\nThe pressure was crushing. Part of him resented his father for it—for being so legendary that his son had no choice but to chase that impossible shadow. For blessing him with talent that made everyone expect miracles. But Lord had never voiced these feelings. How could he? It would disappoint everyone. It would shame Father.\n\nAnd yet...\n\n\"All I want is for you to be healthy and happy.\" Grid's voice was thick with emotion as he held his son close. \"I'd rather see you with a dozen friends, covered in mud from playing in the gardens, than locked in here with ledgers and textbooks. You're my son, Lord. Your happiness matters more than any crown or kingdom.\"\n\n\"...\"\n\n\"I want you to enjoy your childhood. To smile. To make others smile. That's what would truly make me proud.\"\n\nThe words shattered something in Lord's chest. The iron control he'd maintained for so long finally cracked.\n\n*Kkuok...*\n\nHe buried his face against his father's breastplate and bit down hard on his lip, fighting desperately not to sob. His small shoulders shook with the effort. At five years old, Prince Lord had been buckling under burdens that would break grown men. But in this moment, in his father's arms, he found the strength to begin mending himself.\n\n*I'll do better,* he promised silently. *I'll study even harder—but not to meet everyone else's expectations. I'll do it to make you proud, Father. To be someone worthy of you and Mother.*\n\nThe smell of iron and sweat from Grid's armor filled his nose—usually unpleasant, but now the most wonderful scent in the world. His father's calloused hands, rough from decades of smithing and swordwork, stroked his hair with infinite gentleness.\n\nLord smiled through his tears.\n\nFrom the shadows, Kasim allowed himself a rare, genuine smile. The tension that had coiled in his chest for weeks finally released.\n\n*A teacher can only do so much,* he reflected. *Some things can only be fixed by a father's love.*\n\n---\n\n\"You're back safe. Thank the gods.\"\n\nGrid looked up from where he sat in his office, Lord drowsing in his lap. Lauel stood in the doorway, expression unreadable. The Prime Minister still hadn't adjusted to this side of his king—the doting father who set aside reports to hold his sleeping son.\n\nOnly a few months ago, Grid had been the opposite. Demanding. Expecting perfection. Pushing Lord to master everything immediately.\n\n\"Whenever I see him like this—exhausted, covered in sweat from studying—I think about Sehee.\" Grid's voice was quiet, careful not to wake the boy. \"About Ruby, I mean.\"\n\n\"Ah.\" Understanding flickered across Lauel's face. \"Your sister.\"\n\n\"She spent her entire childhood in private academies because of me. Because I was such a worthless brother that our parents pinned all their hopes on her instead.\" Grid's jaw tightened. \"She'd come home at midnight, barely able to stand. I watched her suffer under that pressure for years.\"\n\n\"I see.\"\n\n\"Talent shouldn't be a burden. Yes, Lord needs proper education—he'll be king someday. But I won't let him be crushed by it. Not like Sehee was.\"\n\nLauel clasped his hands behind his back. \"Your Majesty, I understand your feelings. But Prince Lord represents the future pillar of the Overgeared Kingdom. If we reduce his training regimen, we directly weaken our nation's future strength—\"\n\n\"Then I'll get stronger to compensate.\" Grid's tone brooked no argument. \"I recently unlocked the Political Power stat. I'll work harder, delegate less. My son shouldn't have to carry the kingdom on his back before he's even tall enough to see over a table.\"\n\n\"...\"\n\nGrid's expression hardened. Ever since Braham had departed—his soul finally achieving independence—Grid had felt the absence keenly. He'd been relying too much on others. On Lauel's political genius. On his retainers' strength. Even on his five-year-old son's potential.\n\nNo more.\n\n\"I need to be more responsible,\" he said firmly. \"Starting now.\"\n\nLauel studied his king for a long moment, then inclined his head. \"As you command, Your Majesty. Though I maintain my objection, I'll respect your decision.\" He shifted gears smoothly. \"Have you reviewed my proposal for the vampire cities?\"\n\n\"The raid targets? Briefly.\"\n\nThe vampire cities represented some of the most valuable content in Satisfy. Named bosses guarding legendary items, all hidden in underground labyrinths scattered across the desert. Securing them would dramatically increase the Overgeared Kingdom's power.\n\n\"I've finalized the attack sequence,\" Lauel continued. \"We're bypassing the Second City—intelligence suggests Duchess Marie Rose resides there, and she's... beyond our current capacity. The First City also remains off-limits for now, given its estimated difficulty. That leaves seven targets.\"\n\n\"Party composition?\"\n\n\"You'll lead a core team of viscount-rank members. Jishuka, Pon, Regas, and the other Tzedakah elites. Peak Sword, Euphemina, Chris, Katz...\" Lauel ticked off names on his fingers. \"The strongest we have.\"\n\nGrid nodded slowly. \"That's a solid roster.\"\n\n\"Initially, I considered broader inclusion to accelerate guild-wide growth. But given recent events...\" Lauel's expression darkened. \"The Empire failed to break Valhalla. They're blaming the Undefeated King's descendant for the defeat, but that won't last. Eventually, their attention will shift. If they consider Valhalla too costly, they may redirect their armies toward us instead.\"\n\n\"And our third-advancement users can't handle solo number knights yet.\"\n\n\"Precisely. If we don't focus on raising our top-tier combat power now, we'll be slaughtered when the Empire comes.\" Lauel's voice dropped. \"Chris, Faker, Regas—these three in particular need rapid advancement. If they can reach the level to match solo number knights one-on-one...\"\n\nGrid had witnessed the Red Knights' strength firsthand during the Valhalla campaign. The memory of their overwhelming skill still haunted him.\n\n\"You're right. Focus on the elites.\"\n\n\"Ah, one more thing.\" Lauel's lips quirked. \"Ruby and Sexy Schoolgirl will accompany you.\"\n\n\"...Don't they have university entrance exams?\"\n\n\"They've decided to prioritize Satisfy over their studies for now.\"\n\n\"I... see.\" Grid winced. \"The vampires are going to have a rough time.\"\n\nAt that moment, his legendary bad luck activated, though he wouldn't understand the consequences for some time yet.\n\n---\n\n**Imperial Capital, Titan**\n\n**National Cemetery**\n\nThe Red Knights stood like crimson shadows against the gray tombstones, though today their signature armor was hidden beneath black mourning clothes. They'd gathered where the Empire's greatest warriors rested eternally—and where their own comrades now lay.\n\nMercedes, the First Knight, led the silent vigil. Against the black fabric, her pale skin seemed to glow like alabaster. She bowed her head.\n\n\"A moment of silence for the fallen.\"\n\nEvery knight followed suit.\n\n\"Sir Lorex...\" someone whispered. \"I'll avenge you. I swear it.\"\n\n\"Sir Dia... your sacrifice won't be forgotten.\"\n\nQuiet sobs rippled through the assembly. Hardened warriors wept openly, grief overwhelming their discipline. But Mercedes remained silent, her eyes dry. Tears were a luxury she couldn't afford. She was their leader. Her duty wasn't to mourn—it was to *act*.\n\nAfter the funeral rites concluded, she straightened and turned to her aide.\n\n\"Sky. Prepare to depart.\"\n\nThe young knight blinked. \"My Lady?\"\n\n\"We're going to Valhalla.\" Mercedes' voice was cold as winter steel. \"We're going to find the Undefeated King's descendant. And we're going to kill him.\"\n\n[**QUEST RECEIVED**]\n\n> **Blood Revenge**\n>\n> **Difficulty:** SSS\n>\n> First Knight Mercedes seeks to honor her fallen comrades. She has sworn to travel to Valhalla and execute the Undefeated King's descendant.\n>\n> As her aide, you are obligated to accompany and assist her in this mission.\n>\n> **Clear Conditions:** Death of the Undefeated King's descendant\n>\n> **Rewards:** Invitation to join the Red Knights (increased stats, exclusive skills)\n>\n> **Failure Penalty:** -5 Levels\n\nSky's heart nearly stopped. *Finally!*\n\nFor two years, he'd worked tirelessly for this moment—the opportunity to officially join the Red Knights. He was the first player ever to receive such a quest. The implications were staggering.\n\n*This is just the beginning,* he thought, ambition burning in his chest. *Step by step, I'll climb the ranks. Become a solo number knight. Stand as Mercedes' equal.*\n\nThen, with effort, he'd make her something more than his commander.\n\nAn ugly smile twisted his features as his gaze drifted across Mercedes' slender neck, lingering on the exposed skin above her collar.\n\n*Soon.*\n\n---\n\n**Vampire City (Unknown Location)**\n\n\"Three brothers are dead.\"\n\nThe announcement echoed through the ancient chamber. Nine direct descendants of Shizo Beriache—or rather, six, given the absences—had gathered for the first time in centuries. As true children of the Blood Monarch, they possessed transcendent power far beyond ordinary vampires. But that power came with a price: the Curse of Idleness, which forced them into centuries-long slumbers.\n\nThey'd only recently awakened to the news. Elfin Stone. Tiramet. Latina. All destroyed.\n\n\"I can understand Tiramet and Latina falling,\" one murmured. \"They were always reckless. But Elfin Stone?\"\n\nEarl Elfin Stone had been formidable. Among the nine—no, ten, if one counted the estranged Braham—Elfin Stone ranked near the top in pure combat ability.\n\n\"To be killed by *humans*...\" Another voice, thick with disbelief.\n\n\"Perhaps one of the old legends still lives? Someone like Muller?\"\n\n\"Impossible. Muller died centuries ago. All the legends of that era are dust.\"\n\n\"Then who...? Who could possibly... um... ummmm...\"\n\n\"...Kuooh... kuoooh...\"\n\n\"...Drrrool!\"\n\nOne by one, the assembled direct descendants began to nod off. Despite the gravity of the situation—despite three of their siblings lying dead—the Curse of Idleness proved overwhelming. Within minutes, all but two vampires lay sprawled across ancient furniture, snoring softly.\n\nOnly Duchess Marie Rose and Marquis Fenrir remained immune to the curse's effects. They exchanged glances across the chamber, simultaneously exasperated and unsurprised.\n\nThe meeting would have to wait."
}