{
  "id": 715,
  "title": "Chapter 715",
  "content": "Fifteen vampire cities lay scattered across the region. Overgeared had already conquered the last six—cities ten through fifteen.\n\n\"The boss guarding each city is either a True Blood vampire or a Direct Descendant.\" Lauel's briefing began at the entrance to the ninth city. \"The Direct Descendants are super named bosses. Kill them, and they're gone forever. True Bloods take their place afterward.\"\n\nChris crossed his arms. \"I've hunted True Bloods fifty-three times since taking over Reidan. Every one of them was a named boss. Strong as hell.\"\n\n\"Fifty-three times?\" Pon's jaw dropped. \"In three months? How is that even—\" He knew the difficulty firsthand. Without Grid, a single city took at least three days to clear, even with their top members. \"Wait. Were you soloing them?\"\n\n\"...\" Chris coughed into his fist. \"I challenged myself that one time. Before that, I always had my captains with me. Built up enough experience to try it alone.\"\n\n\"You don't need to spare my feelings.\" Pon's competitive fire kindled. \"There's a gap between us. I know. But I'm closing it today.\"\n\nFirst ranked versus seventh. The provocation landed.\n\n\"...I look forward to it.\"\n\nChris couldn't help but feel a surge of satisfaction. Back in L.T.S., he'd never beaten Jishuka, Regas, or Pon. Now the tables had turned.\n\nRegas' eyes gleamed. \"I hope we run into a Direct Descendant. That'd be fun.\"\n\n\"Fun?\" Vantner clicked his tongue. \"Try 'nightmare.' Elfin Stone was probably on par with Belial.\"\n\nMonsters grew stronger over time, same as players. If Elfin Stone had been that powerful months ago, the current earls might match Belial's former strength.\n\nLauel nodded thoughtfully. \"You're not wrong. The Direct Descendants we face now will be brutal.\" His gaze swept across the assembled guild. Overgeared King Grid. First-ranked Chris. Godly archer Jishuka. God of killing Faker. Asura Regas. White Knight Pon. The bald-headed Vantner. Blood Warrior Katz. The conditional powerhouse Euphemina. Peak Sword. Paladin Toban. Huroi. The finest warriors on the continent stood together, backed by Saintess Ruby's unmatched healing and her knight Sexy Schoolgirl. \"But even if we met Belial again, we'd win with this roster. Though I wish Yura was here.\"\n\n\"Yura...\" Grid's expression softened. Months had passed since he'd last seen her face—that beautiful, almost addictive face. \"She's still in Hell?\"\n\n\"Yes. No communication.\"\n\n\"I'm looking forward to her return.\"\n\nPeak Sword's smile didn't quite reach his eyes. \"She needs to be back before the National Competition.\"\n\n\"Our stamina's recovered.\" Ruby and Sexy Schoolgirl approached, color returning to their faces. The desert crossing after hitting level 200 had drained them completely.\n\n\"Good.\" Grid rose, taking point. The strongest rankers fell in behind him.\n\n\"This is Overgeared!\"\n\n\"Hell yeah!\"\n\n\"Let's move!\"\n\nThey carried themselves with pride. Even Chris, ranked first in the world, followed Grid willingly. They'd all recognized him as their leader—long before the rest of the world caught on.\n\n***\n\nThe ninth vampire city sprawled in eternal darkness.\n\n\"When's Earl Cray coming back?\"\n\n\"I don't think he is...\"\n\n\"...\"\n\nA year had passed since the master of the ninth city—a Direct Descendant of Shizo Beriache—left for a \"brief\" meeting. He'd promised to return shortly. The vampires had stopped believing that promise. The Curse of Idleness weighed heaviest on the most powerful vampires, and Earl Cray had almost certainly succumbed to sleep. Decades would pass before he woke.\n\n\"What if those humans who killed Earl Elfin Stone attack?\"\n\n\"Then the True Bloods go out.\"\n\n\"True.\"\n\n\"Blood.\"\n\n\"Vampires.\"\n\nThe True Blood vampires—personally sired by the Direct Descendants—carried immense pride. Cray surpassed Elfin Stone in power. Surely his progeny could handle any invasion.\n\nAs if summoned by that very thought, intruders materialized in the city.\n\n\"Twenty humans entered?\"\n\n\"Hah. Arrogant fools. Such a small force.\"\n\nThree True Blood guardians stirred from their coffins, shaking off centuries of drowsiness.\n\n*Shaaaaaah—*\n\nTheir flesh dissolved into smoke, flowing through lightless corridors. Then—\n\n\"There.\"\n\n\"How long since I've tasted human blood?\"\n\n\"Dinner time! *Kihahahahat!*\"\n\nThey reconstituted above the intruders, red eyes gleaming with predatory hunger. Below, hundreds of lesser vampires encircled the humans. Easy prey.\n\n\"First one to feed takes ownership!\"\n\nThe three True Bloods descended in a blur—faster than a griffon's hunting dive, too swift for human eyes to track.\n\n*Sukakak!*\n\n*Puok!*\n\n*Peeng!*\n\nClaws, magic, and weapons struck simultaneously. The floor should have been painted with human blood.\n\n*Kwajak!*\n\n*Kwa kwa kwa kwa kwa!*\n\nInstead, three vampire faces smashed into cold stone.\n\n'What—?!'\n\n'How—?!'\n\nThey'd been struck before they even registered the counterattack.\n\n*—!*\n\n*——!*\n\n*———!*\n\nThree soundless flashes cut through shadow. Blood sprayed from vampire backs. Faker, god of killing, moved between them like smoke given teeth. Despite his normal class, he'd defeated the sun-grade Black through pure mastery. His Assassination skill reached perfection through flawless control.\n\n\"*Kuaaaaak!*\"\n\n\"*Kuk...!*\"\n\nPain lanced through their necks. By the time they understood what was happening, Faker's skill cooldown had expired.\n\n*Chwarururuk!*\n\nA cold-eyed man emerged from the darkness. He stood alone amid three True Bloods without a trace of fear. The vampires faltered.\n\n\"You're insane!\"\n\n\"Damned human!\"\n\n\"You bastard!\"\n\nRage overwhelmed their fear. They unleashed everything.\n\n*Peng!*\n\n*Kwa kwa kwa kwang!*\n\nMagic bombardment lit up the chamber. They'd slaughter this assassin first, then the humans fighting at the rear. Except seventy percent of their spells struck empty air. The assassin was simply too fast.\n\nThen Grid arrived.\n\n\"Pagma's Swordsmanship.\" His aura blazed with power rivaling Earl Cray himself. \"Linked Kill Wave Pinnacle.\"\n\n*Chukak. Chukakakakak!*\n\n*Pajijijik!*\n\n*Kurururung!*\n\n\"*Ke...ok.*\"\n\n\"*Kuaaaaak!*\"\n\n\"*Hiik!*\"\n\nThe True Blood vampires—masters of the city in any Direct Descendant's absence—forgot their dignity and screamed. Acute, overwhelming pain.\n\n'These humans...!'\n\n'They came prepared...!'\n\nFirst the assassin, now this overwhelming force. Clever. Too clever. They drew on their species' legendary resilience, preparing to counterattack—\n\n\"Your parents were lazy sloths! All you do is sleep instead of hunting!\"\n\n\"What...?\"\n\nThe truth struck harder than any blade. Their defenses crumbled under the emotional assault.\n\n\"1,000 Ton Sword!\"\n\n\"Rail Spear!\"\n\n\"Fly Up!\"\n\n\"Draw Sword, Extinguish!\"\n\nOvergeared's finest unleashed their buffed skills as one.\n\n\"*Kuaaaaack!*\"\n\nTwo hours later, the ninth vampire city fell.\n\n[The party 'Let's Obtain Loot!' has succeeded in capturing the 9th vampire city!]\n\n[Party leader 'Grid' has acquired an Intermediate Vampire Ring.]\n\n[Party leader 'Grid' has acquired a Strength Elixir.]\n\n[Party leader 'Grid' has acquired 21 Weapon Enhancement Stones...]\n\n...\n\n[Party member 'Ruby' has leveled up!]\n\n[Party member 'Sexy Schoolgirl' has leveled up!]\n\n\"...I didn't do anything.\"\n\nToban and Vantner stood in awkward silence. The party's tanks. The vampires had died before they'd needed to actually tank. They'd just stood there collecting experience like it was a free meal."
}