{
  "id": 717,
  "title": "Chapter 717",
  "content": "Flash!\n\nLight glinted off Vantner's scalp—still distractingly brilliant despite everything. He felt four pairs of eyes lock onto him at once.\n\n\"Hahaha... Modern helmet design really is...\"\n\nSilence.\n\nEven Pon, who would've roasted Vantner alive under normal circumstances, could only swallow hard. The four direct descendants loomed before them, and shock had sealed every throat.\n\n\"...Lucky seven, right?\"\n\nNo one answered. Peak Sword stood frozen. Four direct descendants. Four earl-class vampires in a single city, manifesting simultaneously. The worst possible scenario—one no sane person would have predicted.\n\n\"How...?\" Lauel's voice cracked.\n\nHis research had been thorough. Direct vampires were slaves to the Curse of Idleness. They never left their cities. They slept in coffins for decades, sometimes centuries. For them to gather here, now—it violated every precedent.\n\n*Are all four of them city masters?*\n\nPain lanced through Lauel's skull. Variables. Unexpected, catastrophic variables, and all his careful planning meant nothing.\n\n\"I'm... sorry.\"\n\nThe words trembled out. He'd initiated this conquest. The responsibility was his. He should throw himself forward, buy time for the others to escape—\n\nBut there was no escape. Not until the city's master fell. His sacrifice would accomplish nothing.\n\nThe survival rate was zero.\n\n*Gods, what have I done?*\n\nHis carelessness would cripple the Overgeared Kingdom. Lauel's face went chalk-white. Then a hand settled on his shoulder—large, warm, solid. He knew that grip.\n\n\"King Grid...\"\n\nLauel turned. Met those cool, steady eyes.\n\n\"Save the apologies and use your brain. This is the moment to stay calm.\" Grid's voice was iron. \"Pull yourself together.\"\n\n\"...\"\n\nYes. Lauel knew his weakness—had known it for years. When events deviated from his predictions, he lost his center. Fatal, for a strategist. A strategist had to adapt to any variable, meet chaos with cold reason.\n\n\"Don't act like it's over.\"\n\nFour earl-class direct descendants? Unwinnable. But Grid had no intention of rolling over.\n\n\"Think while we buy time. That's all we can do.\"\n\nMorale had cratered. Regas looked eager—he lived for fights like this. Katz's expression was sharp, controlled. But the others? Ruby was ghost-pale, eyes too wide.\n\n*I promised to be someone they could rely on.*\n\nA leader bore that weight. Especially now.\n\n*Clang!*\n\nGrid kicked off the ground and rocketed skyward. Alone. He would face all four direct descendants himself.\n\n\"Grid...!\"\n\nBlack demonic energy wrapped around his body as he closed the distance.\n\n\"**Blackening. Quick Movements.**\"\n\n>[Your black magic power has increased.]\n\n>[You don't have any black magic power. It will be replaced with demonic power.]\n\n>[While Blackening is activated, your species will change to half-demon.]\n\n>[As a half-demon, your maximum health is reduced by 50%. Your attack power, magic power, and agility will increase by 30% each.]\n\n>[All attacks will be converted to the dark attribute.]\n\n>[Your evasion rate is increased by 30% and your agility doubled for 1 minute.]\n\nHe'd stake everything on survival. Learn their patterns. Show his team the path forward.\n\n*Shing!*\n\n*Shingshingshingshing!*\n\n\"Hoh.\"\n\nThe four direct descendants looked up, boredom draining from their expressions. What they'd assumed was a suicidal fool moved like quicksilver.\n\n\"Interesting.\"\n\n*Shing!*\n\n*Shingshingshingshing!*\n\nDark energy blades erupted in a storm. Blood misted—the direct descendants hadn't evaded. Grid's speed had exceeded their response time.\n\n*Not defending. Not even trying.* Grid's mind raced. *That's something. Not invincible.*\n\nHe grasped their agility baseline and transitioned into a sword dance. Time to test their defense.\n\n\"**Pagma's Swordsmanship, Link!**\"\n\n*Slash.*\n\n*Slashslashslashslash!*\n\nTwenty strikes per second hammered into Earl Cray's body. The God Hands formed a defensive perimeter, intercepting the other earls' counterattacks. Notification windows cascaded across Grid's vision.\n\n>[You have dealt 16,900 damage to the target!]\n\n>[You have dealt 18,780 damage to the target!]\n\n>[You have dealt 20,600 damage to the target!]\n\n...\n\n*Not bad at all!*\n\nTheir defense wasn't astronomical—slightly lower than Third Knight Lorex, even. Hope kindled in Grid's chest.\n\n*If we all hit them together, we can take down two.*\n\nThe city raid could fail. But if they eliminated two of four, the next attempt was guaranteed. The moment that thought crystallized—\n\n\"Oho, that's right.\" Earl Cray smiled, blood streaming from his wounds. His gaze fixed on Grid's hand. \"That ring. You're the human who sealed Elfin Stone.\" His smile widened. \"Pathetic. Then again, unlike me, he was never a candidate for marquis.\"\n\n*Fwoooosh!*\n\n\"...?\"\n\nTime... stopped?\n\nNo. Not stopped. The blood flowing from Cray's wounds simply refused to fall. Droplets hung suspended, defying gravity.\n\n\"What's wrong?\"\n\n\"...!\"\n\nGrid tried to swing again, but—\n\n*BOOM BOOM BOOM BOOM! BOOM BOOM BOOM BOOM!*\n\nThe blood gathered. Coalesced. Shot toward Grid like a crimson missile.\n\n*SHRIIIEK!*\n\n\"Guh...!\"\n\nAgony ripped through him.\n\n>[You have suffered 19,500 damage.]\n\n>[All of your lost health is absorbed by the target.]\n\nHis health bar plummeted. Worse—Cray's wounds sealed themselves, the damage Grid had inflicted vanishing as his own blood fueled the vampire's regeneration. One hundred percent life steal.\n\n*Shit—this is a direct descendant!*\n\nEarl Cray wasn't dangerous because of raw physical stats. Like Elfin Stone with his swordsmanship and magic, like Tiramet with overwhelming physicality, Cray had specialized. Blood manipulation. Life drain. Grid reeled, chest burning, and Cray's hand clamped around his face.\n\n\"**Blood Tornado.**\"\n\n*Fwooooooosh!*\n\nPillars of blood uncoiled from Cray's body like serpents. They began to spin, a crimson vortex, and Grid's body started to shred.\n\n>[You have suffered 17,500 damage.]\n\n>[You have suffered 15,900 damage.]\n\n>[A great king puts his safety first. Due to the **First King** title effect, a shield with all the health lost in the last minute will be created.]\n\n>[All terrain adaptability has increased by 100% while movement speed and defense has increased by 10%.]\n\n\"Mm...?\"\n\nThe blood pillars should've continued until their victim was pulverized. Earl Cray had expected the human to die in seconds. Instead, a radiant shield flared around his prey.\n\n*Crack!*\n\n*CRACK CRACK CRACK CRACK!*\n\nThe body that should've torn like wet paper suddenly resisted. Grid had swapped armor—Holy Light Set now blazing against the storm.\n\n\"**Linked Kill!**\"\n\n*Thunk!*\n\nAn energy blade punched through the vortex. Struck Cray's chest.\n\n*Thunk thunk thunk!*\n\nTwice. Three times. Four.\n\n\"Khah!\"\n\nEarl Cray coughed blood and wrenched himself away from Grid.\n\n\"Hahahaha! Now *this* is what I'm talking about!\"\n\nWhile everyone else despaired at the appearance of four direct descendants, one person rejoiced.\n\n\"**Black Lightning Ascension!**\"\n\n*Crackle!*\n\n*CRACKCRACKCRACK!*\n\nAsura Regas—who lived for battles like this. He couldn't fly, but he scaled the side of a building and launched himself from the rooftop toward the clustered vampires. Precisely where Earl Cray had retreated.\n\n\"A pincer—!\"\n\nCray's eyes widened.\n\n*WHAM!*\n\nRegas' fist smashed into his face. And then—\n\n\"**Fly Up!**\"\n\n\"**Rail Spear!**\"\n\nThe rest of Overgeared opened fire. Twenty skills that had obliterated true blood vampires in single salvos all converged on Earl Cray.\n\n*Boom!*\n\n*Shriek!*\n\n*BOOM BOOM BOOM!*\n\nExplosions. Magic. Steel. The bombardment tore new wounds across Cray's body, and more blood spilled into the air. Which was exactly the problem.\n\n\"Hmm... I'm genuinely impressed that humans have reached this level.\"\n\nEarl Cray's voice carried honest admiration. The single blood pillar coiling around him split. Two. Three. Four. The more he bled, the stronger he became. That was Earl Cray's true nature.\n\nEvery member of Overgeared tensed. If he was this dangerous with one pillar, what was he with four?\n\n\"Cray manifested four 'tails.' It's been centuries.\"\n\n\"The last time was when he fought Braham with six and got thrashed, wasn't it?\"\n\n\"These humans are quite capable.\"\n\nThe other three direct descendants watched with detached amusement, confident in Cray's victory. Until a voice cut through the tension.\n\n\"Kuk...! Kukuku! You're using blood as a weapon? *In front of me?*\"\n\nBlood Warrior Katz. The man who'd complained about hunting in a group. The one who'd sat idle through the 9th and 8th city conquests, arms folded.\n\n\"I am the master of all blood.\"\n\n*RUMBLE!*\n\n*RUMBLLLLLLLE!*\n\n\"...!!\"\n\nAll four direct descendants froze. Earl Cray's four blood pillars—\n\nThey thrashed. Convulsed. Turned against their master."
}