{
  "id": 719,
  "title": "Chapter 719",
  "content": "**THUNK!**\n\nFour consecutive impacts—each one tearing through flesh and spraying black blood across the night sky. Earl Cray staggered mid-air, overwhelmed by agony he hadn't felt in centuries. The fusion of Link and Kill had birthed something devastating: Linked Kill, the precursor to Grid's ultimate technique.\n\n*How can a mere human wield such power?*\n\nEarl Cray's crimson eyes trembled. This mortal had activated the Rune of Darkness, triggered Blacksmith's Rage, and pushed his fighting energy to 80 points. The weapon forged through Item Combination blazed in his hands with power that made even the Direct Descendants recoil. Worse still—Grid had reserves left to burn.\n\n[Fighting energy has reached 83 points.]\n\n[You have hit the target with Linked Kill more than four times! The damage of Linked Kill is increased by 200% and Wave is summoned!]\n\nThree more strikes hammered into Earl Cray's torso before he could even register the system notification. *He's getting stronger mid-combo?*\n\nThe vampire coughed black blood as Grid's seventh consecutive hit connected. The air around Grid's blade began to ripple and distort. Energy gathered at the sword's edge—violent, churning power that threatened to devour everything in its path.\n\nWave.\n\nEven Garam, the yangban, couldn't evade this technique. When focused on a single target, the wide-area attack became inescapable. Absolute.\n\n**KRAKOOM!**\n\n\"Ghhk—*AAAAAHHH!*\"\n\nThe energy engulfed Earl Cray like a crushing fist. He felt his ancient skin peel away, flesh separating from bone in layers.\n\n[Critical!]\n\n[The effect of the title 'Death in One Shot!' has been activated, adding 30% critical damage!]\n\n[...The option effect 'Black Flames' has activated!]\n\n[Wave has reduced the speed of all targets hit by 60%.]\n\n[The target has resisted.]\n\n**CRACK! CRACK! CRACK!**\n\nDamage stacked upon damage. Between the Overgeared members' coordinated assault and Grid's relentless offense, Earl Cray's health plummeted to 40%. But the nightmare wasn't finished.\n\n**SHHHKKK—**\n\nThe energy swirling around the vampire contracted, focusing into a single point above his head.\n\nPinnacle.\n\nThe technique ignored 80% of defense and dealt 1,800% of Grid's attack power as pure physical damage. It descended toward Earl Cray's crown like divine judgment.\n\n[Fighting energy has reached 90 points.]\n\n[Critical!]\n\n[The effect of the title 'Death in One Shot!' has been...]\n\n[The black flame explosion...]\n\n[A red lightning has been summoned...]\n\n\"*GHAAAH!*\"\n\nEarl Cray's scream split the night. His body possessed unique traits—he grew stronger when bleeding, could absorb 100% of damage dealt by his attacks, making the concept of health nearly irrelevant in normal circumstances. His strategy had always been simple: summon multiple blood tails, weaponize them in wide-range attacks, drain his enemies dry while sustaining himself.\n\nBut tonight, that strategy lay in ruins.\n\nKatz had crippled him. The Blood Warrior's interference prevented Earl Cray from summoning more than three tails without risking complete loss of control. His greatest strength, neutered by a single human's unique ability.\n\n*Should I... flee?*\n\nWith only 20% health remaining after enduring the full sequence of Linked Kill Wave Pinnacle, the image of retreat filled him with shame.\n\n*Run? I... a Great Earl... driven away by humans?*\n\nBraham's mocking words echoed through his mind like poison.\n\n*\"A child who inherited Mother's power and wallowed in laziness. You're nothing compared to Elfin Stone, even with all his pathetic emotions. You should never have become an Earl, let alone a Marquis candidate.\"*\n\n*Braham...!*\n\nThat lunatic who'd slaughtered his own kin under the guise of eliminating the Curse of Idleness. Earl Cray had fled from Braham's humiliation once before. The trauma still festered. He'd sworn—*never again.*\n\nHis resolve crystallized.\n\n\"My innate power is my *strength!* I'll prove I surpass Elfin Stone!\"\n\nThat arrogant fool who'd looked down on him despite lacking Marquis candidacy himself. The vampire who'd dared speak of *love*. The weakling who'd fallen asleep before Braham due to the Curse of Idleness, only to watch his beloved die!\n\n\"I won't be looked down upon—*not by anyone!*\"\n\nHe would prove his superiority by tearing apart the human who'd killed Elfin Stone.\n\n**CRACK! CRACK! CRACK!**\n\nSix crimson tails erupted from Earl Cray's back. Pure power unleashed. He'd stopped worrying about Katz, stopped fearing lost control. If he had to fall, he'd fall without regrets, wielding everything he possessed.\n\n*Six?*\n\nGrid's eyes widened. Four tails had nearly crushed him before. Now there were six? The vampire he'd driven to the brink still had hidden strength?\n\n\"Grid!\"\n\n**BOOM! BOOM! BOOM!**\n\nThe Overgeared members redoubled their assault, every available fighter hammering Earl Cray with coordinated strikes. They could fight freely because the other three Direct Descendants had resumed their passive observation.\n\n\"A Memphis *and* Iyarugt? This human is extraordinary.\"\n\n\"I'm not... curious about his identity. Everything is so *tiresome*...\"\n\n\"Nyang...\"\n\n\"Damn it... once I recover my former power, you vampires...!\"\n\nThe four God Hands, Noe, Randy, and Iyarugt lay defeated by the three watching vampires. Yet those vampires offered Earl Cray no aid. They'd forgotten their purpose—eliminating Saintess Ruby—and simply stood idle. The Curse of Idleness gripped them, filling their minds with annoyance and overwhelming drowsiness.\n\nLauel recognized the opening.\n\n\"We *must* finish him!\"\n\nThe Overgeared members' focus on Earl Cray stemmed from Lauel's strategic assessment. Four Direct Descendants wouldn't share rule of a single city. The 7th City likely belonged to one master—and if they could kill that master, they could retreat safely.\n\nAll signs pointed to Earl Cray as the owner. He'd taken the most active position among the four vampires who'd appeared. Eliminate him, and the path to survival opened.\n\nThat's why Grid and Overgeared had concentrated everything on Earl Cray. Until moments ago, hope had been within reach.\n\nThen six blood tails unfurled.\n\n\"I'll show you the *chasm* between us!\"\n\n**BOOOOOM!**\n\nThe six tails moved with terrifying coordination. Some spread like nets, ensnaring Overgeared members mid-attack. Others whirled like crimson tornadoes, flinging bodies skyward. Two slammed the ground, sending shockwaves that damaged everyone simultaneously. Through it all, Earl Cray's health climbed.\n\n**SHRIEEEEK—**\n\nOne tail shot forward like a missile and punched clean through Grid's chest.\n\n[You have suffered 29,000 damage.]\n\n[All of your lost health is absorbed by the target.]\n\n\"Gh—!\"\n\nGrid choked back the scream threatening to tear from his throat. The tail had pierced his heart. But if he showed weakness now, his allies' morale would shatter. He forced the pain down, compartmentalized it.\n\n*—Katz, can you control the tails like before?*\n\nThe whisper left his lips desperately. Katz's response came heavy with regret.\n\n*—I'm sorry. As I said earlier, I've got nothing left in the tank.*\n\n*—I understand. Don't blame yourself.*\n\nKatz had already done more than anyone could ask. Grid gritted his teeth and adapted.\n\n**SHRIEK!**\n\nWhile the God Hands kept the three Direct Descendants distracted, Sehee's heal reached Grid through the chaos. He'd been defending against another tail strike when the light washed over him.\n\n[Saintess Ruby has restored 18,900 health.]\n\nWarmth flooded his body. The pain receded. But Grid refused to rely on it.\n\n\"Heal the *others!*\"\n\nHe'd felt Earl Cray's full power now. Even Sehee's percentage-based healing couldn't keep pace with the vampire's assault. Besides—\n\n\"I'm *immortal!*\"\n\nGrid was the only Legend in this raid. He was the last line of defense.\n\n*Draw his aggro. Keep it on me.*\n\nGrid committed himself. Item Combination had roughly 40 seconds remaining. He kicked off the ground and soared toward Earl Cray, who floated in the sky wreathed by six undulating blood tails.\n\n\"Come, human! I'll repay your earlier humiliation *tenfold!*\"\n\nThis was Earl Cray's true form—several times stronger than before. The confident vampire lashed out with all six tails simultaneously.\n\n**FWOOOOSH—**\n\nOne tail spread into a net, seeking to bind Grid in place.\n\n**BOOM! BOOM!**\n\nTwo more shot forward like ballistic missiles, ready to obliterate him the moment the net caught him. But Grid triggered Freely Move and phased through the assault entirely.\n\n\"What—?!\"\n\nGrid's movement was flawless compared to earlier. Earl Cray's amazement lasted only a heartbeat before he adapted, transforming the three remaining tails into massive blood tornadoes. They expanded simultaneously, creating overlapping zones of shredding force. The perfect counter to Grid's targeted-movement skill.\n\n**RIP! RIP! RIP!**\n\n[You have suffered 8,900 damage.]\n\n[You have suffered 8,730 damage.]\n\n[You have suffered 9,100 damage.]\n\n[All of your lost health is absorbed by the target.]\n\n*Shit—!*\n\nThe blood tornadoes consumed Grid, tearing at his body from every angle. His vision flashed red. Critical health threshold.\n\n\"Grid!\"\n\n\"Oppa!\"\n\nThe Overgeared members threw everything they had at Earl Cray, but once the vampire locked onto Grid, nothing could break his focus. Every attack, every tail, aimed solely at Grid's destruction.\n\n\"Kuhahahaha! *PERISH!*\"\n\nEarl Cray's laughter rang triumphant as he watched Grid struggle within the tornado.\n\n[A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\nGrid activated his final insurance.\n\n\"*HAAAAAAH!*\"\n\n\"Impossible—\"\n\nTrusting in his Immortality, Grid tore through the blood tornadoes by sheer force of will.\n\n\"Pinnacle Kill!\"\n\n**SHKKK—THOOM!**\n\nThe most devastating combination—Failure and the Enlightenment Sword fused in his hands—plunged toward Earl Cray's heart.\n\n**CLANG!**\n\nBut Pinnacle Kill's damage had made Earl Cray cautious. The vampire threw himself higher into the sky, opening distance between them.\n\n\"Tch—!\"\n\nGrid pursued immediately.\n\n\"You won't *touch* me!\"\n\nEarl Cray's six tails spread wide like a crimson web.\n\n\"...!\"\n\n[The duration of immortality is over.]\n\nGrid evaded the net by a hair's breadth using Quick Movements—but the worst possible system message materialized before his eyes at the exact moment his invincibility expired.\n\n\"*DIE!*\"\n\nThe six scattered tails reversed trajectory and converged on Grid like a firing squad.\n\n\"No!\"\n\n\"Grid!\"\n\nEveryone watching knew it was over. This was the end. Grid would die.\n\nThen—\n\n[You have entered the Ecstasy of Desire state.]\n\nGrid's black eyes bled purple."
}