{
  "id": 720,
  "title": "Chapter 720",
  "content": "Grid stood toe-to-toe with Earl Cray—not through raw power, but through the unwavering support of his guild.\n\n\"Peacock Shield!\"\n\nVantner discarded his axe and thrust his massive shield forward. A luminous peacock burst from the steel, its spreading tail demanding the vampire's attention.\n\n\"Holy Roar!\"\n\nToban's divine wail crashed over the battlefield. Earl Cray's pointed ears twitched, momentarily stunned by the sacred resonance.\n\n\"Your mother was a—!\"\n\nHuroi's string of vulgarities about the long-dead Beriache flowed seamlessly into debuff after debuff. Earl Cray's resistance was formidable—most provocations slid off him like water, and those that stuck lasted mere seconds. But even those brief windows were enough.\n\n\"Flower Lance!\"\n\nPon's spear flew true, catching the moment when Huroi's insult broke Earl Cray's concentration. The blade punched through the vampire's unguarded back.\n\n*Thunk!*\n\nA crimson flower bloomed from the wound—a skill designed to inflict devastating bleed damage and prevent recovery. Exactly what they needed to counter Earl Cray's blood-draining abilities. But high power came with low accuracy.\n\n[The target has resisted.]\n\n\"Damn it.\"\n\nPon had picked up Grid's bad habits. His female fans, drawn to his noble bearing on that white horse, would be horrified.\n\n\"Cowardly bastard! Get down here! Draw Sword, Annihilate!\"\n\n\"Rising Sword!\"\n\n\"Dagger Throwing.\"\n\n\"One rock coming up...\"\n\nChris, Peak Sword, Faker, Ibellin—all the melee fighters found themselves helpless the instant Earl Cray ascended fifteen meters into the air. The moment their mid-range cooldowns refreshed, they unleashed everything they had. When abilities ran out, they hurled rocks. Every point of damage counted.\n\n\"Pathetic!\"\n\nEarl Cray dismissed the attacks at first.\n\n*Whoosh—thunk!*\n\n*CRACK!*\n\n\"Guh...!\"\n\nHis smugness evaporated under the relentless barrage from Jishuka's myth-rated Red Phoenix Bow. Zednos and Laella's spells hammered him from different angles. Yet despite the onslaught from all directions—\n\n*BOOM BOOM BOOM BOOM!*\n\n—Earl Cray's focus never wavered from Grid.\n\nGrid held his ground only through his guild's coordinated assault, but to Earl Cray's eyes, Grid alone posed the true threat.\n\n\"Die!\"\n\nFresh from weathering Linked Kill Wave Pinnacle and Pinnacle Kill, Earl Cray summoned all six blood tails. They writhed through the air, abandoning their defensive net to converge on Grid as crimson missiles. An inescapable kill box.\n\n\"Grid!\"\n\n\"No!\"\n\nGrid stood alone at the center of the killing storm, his Immortality duration spent. Death closed in from every angle.\n\nEarl Cray might lack Elfin Stone's raw power, but his arsenal of crowd control was equally lethal. Without Katz and Ruby neutralizing his abilities, this fight would have been impossible. An earl was still an earl.\n\n*Shhhhhhing!*\n\nThe God Hands froze under the assault's pressure. Six blood tails struck—\n\n\"Oppa!\"\n\nRuby's scream pierced the darkness.\n\n*Flicker.*\n\nGrid's black eyes flared purple.\n\n[The option effect 'Ecstasy of Desire' has activated from the Sword Born from Enlightenment and Strong Desires!]\n\n*Swish.*\n\n*Swish swish.*\n\n\"...?!\"\n\n\"What the—?\"\n\nEarl Cray and the entire guild stared. Grid danced through the six-pronged assault with impossible precision, each movement leaving traces of violet light in the gloom.\n\n\"What's happening?\"\n\nContact lenses were popular for a reason—they made pupils appear larger, colors more vibrant. Just one millimeter could transform someone's appearance. A color change was impossible to miss.\n\n\"What kind of transformation...?\"\n\nEvery Overgeared member noticed Grid's metamorphosis. In the lightless vampire city, those glowing purple eyes blazed like beacons.\n\nEarl Cray's fury reached new heights.\n\n\"You insignificant worm...! How many times must you humiliate me?\"\n\nThe battle had been nothing but degradation. Earl Cray had thought it finished moments ago—certain his tails would end Grid's life. Yet the human survived. Again. Perhaps there was truth to the old vampire saying about humans being as hard to kill as cockroaches.\n\n\"Why won't you *die*?\"\n\n*ROAAAAAR!*\n\nThe roar hammered everyone on the ground with a status ailment. Direct Pressure's cooldown had reset. But Grid was a legend. Abnormal conditions broke against him like waves on stone.\n\n*SLASH!*\n\nGrid's weapon carved toward Earl Cray's heart.\n\n*WHOOOOOM!*\n\nBlack flames erupted outward, engulfing the vampire. His agonized shriek filled the city. Ecstasy of Desire had driven Grid's fighting energy to 100 and tripled his attack power. He was three times stronger than before.\n\n*Slash!*\n\n*WHOOOM!*\n\nGrid struck again. Black fire consumed Earl Cray. The vampire spread two tails in a restraining net while the remaining four attacked from all sides—the same pattern. Grid's purple eyes gleamed like amethysts.\n\n\"Is that all you have?\"\n\nBlatant mockery! Had Earl Cray ever imagined a day when a human would laugh at him?\n\n\"...!\"\n\nRage gave way to astonishment.\n\n*Swish.*\n\n*Swish swish.*\n\nGrid dodged all six tail strikes in one flowing motion.\n\n*'That wasn't luck?'*\n\nEarl Cray finally understood. Grid wasn't fighting—he was *dancing*. Weaving through the blood tails like they were part of the choreography.\n\n\"Pagma's Swordsmanship, Link.\"\n\n*Slash!*\n\n*Slash-slash-slash-slash!*\n\n*BOOM BOOM BOOM!*\n\nTwenty consecutive strikes, amplified by 100 fighting energy and Ecstasy of Desire's triple damage—devastation that surpassed even Linked Kill Wave Pinnacle.\n\n\"Agh...! I... I see...!\"\n\nUnderstanding dawned on Earl Cray.\n\nThat dark blade wreathed in crimson flames, occasionally flickering blue. A weapon whose power defied mortal limits.\n\n\"That's a dragon weapon!\"\n\nDragons—the only creatures capable of threatening gods. Ironically, those absolute beings sometimes took interest in human affairs, walking among mortals and leaving behind legendary armaments. That had to be it.\n\nEarl Cray clung to the belief that no mere human could harm him without draconic aid. Grid crushed that delusion.\n\n\"Dragon weapon? I made this myself.\"\n\n\"Lies! Impossible!\"\n\nHumans and their endless bluster. Earl Cray abandoned conversation and summoned six blood tornados simultaneously—an inescapable doom for any creature bound to the earth.\n\n\"This ends now.\"\n\n\"I'm bored. Time for bed.\"\n\n\"Agreed.\"\n\nThe direct descendants who'd been watching with detached interest began to depart. Those six tornados controlled the entire city. Cray's victory was assured.\n\n*CRASH!*\n\n*CRRRUNCH!*\n\nThe savage whirlwinds devoured ancient structures, withered trees, towering cliffs—everything.\n\n\"Get back!\"\n\n\"Move!\"\n\nThe blood tornados merged into one colossal maelstrom that swallowed the Overgeared members on the ground. A force capable of annihilating the entire city. The guild stood helpless. Laella froze in terror—until Jishuka's voice cut through the chaos.\n\n\"Earl Cray is on his last legs. If Grid survives this, we win. Understand? We protect Grid with everything we have!\"\n\nThey had to end the raid here. Kill Earl Cray now, and reclaiming the 7th City would become possible.\n\n\"Focus all defenses on Grid!\"\n\n\"Right!\"\n\n*Hum!*\n\n*Flash!*\n\nEvery defensive spell and ability converged on Grid's position. Simultaneously, explosive magic hammered the whirlwinds, trying to slow their momentum. The tornados tearing into the guild members? No one spared them a thought. Everyone prepared to die for Grid.\n\n\"Grid! Make sure you kill him!\"\n\nTheir desperate cry carried through the storm. Even as they shouted, doubt gnawed at them.\n\nThen—\n\n*Slash.*\n\n*Slash-slash-slash!*\n\n[You have suffered 12,430 damage.]\n\n[You have suffered 11,650...]\n\nThe whirlwind shredded their exhausted bodies. Death had come calling.\n\n*ROOOOOAR! ROOOOOAR!*\n\nThe maelstrom's howl drowned out everything as it consumed the city. The Overgeared members felt a familiar frustration—always relying on Grid at the critical moment—and closed their eyes.\n\nThen—\n\n—*Nothing.*\n\nThe flesh-rending wind and deafening roar vanished as if they'd never existed.\n\n*Splash.*\n\n*Patter... patter...*\n\nRain fell. No—blood. The crimson liquid that had formed the tornado now showered down, robbed of momentum.\n\n\"...?\"\n\nThe guild members stood frozen in confusion.\n\nThen they saw it.\n\nEarl Cray, body dissolving into grey light. Grid's sword, buried in the vampire's heart. Grid's hair still stood on end from Transcend's lingering effects.\n\n\"A tornado? Please. I can dodge those.\"\n\nHe wanted to reassure his teammates. Grid smiled through the pain wracking his entire body. His purple eyes faded back to black."
}