{
  "id": 721,
  "title": "Chapter 721",
  "content": "**The direct descendants are on another level.**\n\nThroughout the battle with Earl Cray, Grid couldn't shake the comparison to one particular adversary—Elfin Stone, the former wielder of Iyarugt. Cray's strength belonged in that same league. Tiramet and Latina didn't even come close.\n\nA troubling thought surfaced as Grid dwelled on that earlier raid.\n\n*What if I'd fought Elfin Stone now, at this strength?*\n\nRuby's Purification—devastating as it was—couldn't dispel Blood Field. Most of Overgeared would've been neutralized instantly. Grid wouldn't have had the instantaneous skill activations that kept him alive. His Immortality would've meant nothing.\n\n*And if Elfin Stone had summoned Iyarugt...*\n\nThe Elfin Stone raid had pushed Grid to his absolute limit. Multiple near-death experiences. An actual death. From his perspective at the time, it was the hardest raid he'd ever attempted.\n\nNow, though? He considered it a stroke of fortune that he'd faced Elfin Stone so early in his journey.\n\nGrid surged through the Blood Tornado's devastating radius. The crimson cyclones overlapped and merged, transforming into field magic that dominated the entire battlefield—a technique designed to disable all attempts at dodging non-targeted skills.\n\nAgainst the current Grid, it was meaningless.\n\nWith Ecstasy of Desire active, his evasion rate peaked at 99%. His consciousness separated from his physical form, slipping through the blood-soaked winds like smoke through fingers.\n\nBut.\n\n**[You have suffered 8,700 damage.]**\n\n\"Kuk—\"\n\n99% wasn't 100%. And the higher Earl Cray's accuracy, the more that 99% evasion rate deteriorated. Grid's skin split as he forced his way through the tornado zone. The six red tails lashed toward him—pillars of concentrated blood magic—and only the fact that his potion cooldown had just refreshed saved his life.\n\n\"Transcend!\"\n\nHis health was too precarious for close combat. Grid made the call and activated transcendent mode. The Pagma's Swordsmanship technique doubled his attack power while converting all basic attacks into ranged strikes.\n\n*Pepeng!*\n\n*Pepepepeng!*\n\nEmpowered strikes hammered Earl Cray through the blood tornado barrier, each one crackling with lethal force.\n\n\"Youuuu!\"\n\n*Kwa kwa kwa kwang!*\n\nThe blood tornadoes responded to Earl Cray's fury, intensifying their rampage. But the momentum was short-lived. Thanks to the Enlightenment Sword, Grid's basic attacks carried army-killing power—and in Transcend state, that lethality only multiplied. Red flames and black flames consumed Earl Cray in relentless succession. His health plummeted.\n\n\"Keook...!\"\n\nThrough the bloody maelstrom, Grid glimpsed Earl Cray's face—pale as death. The blood tornadoes weakened, their fury dissipating. Grid didn't waste the opening. Still in Ecstasy of Desire, he closed the distance and unleashed Pinnacle and Kill.\n\n*Shaaaaaah—*\n\nThe blood tornadoes—massive enough to swallow a city—began to dissolve. Blood tears streaked down Earl Cray's face as Grid's blade pierced through his core.\n\n\"Cough! Kuhuk...! I...! To a human, I...!\"\n\n\"...\"\n\nGrid's expression softened as he watched Earl Cray's form grey and crumble. The moment Cray had transformed all six tails into that cyclone barrier, Grid had understood—it was a desperate survival instinct. An obstacle to keep Grid at bay. A way to eliminate all threats to the city simultaneously.\n\nEarl Cray had felt the crisis from the very beginning.\n\nAnd yet, he hadn't called for help from his siblings. Pride? No—more likely, he knew they wouldn't come.\n\n\"How lonely...\"\n\nPeople couldn't survive alone in this world. Grid, who'd spent so long in isolation, understood that truth better than anyone.\n\n\"It's not that you're weak. I have companions. You don't. That's the only difference.\"\n\nWas he seeing his former self in the dying vampire? Grid offered meaningless, awkward comfort to a monster at the end. Christ, if anyone witnessed this scene, they'd either laugh or recoil in horror.\n\n\"...A human... pitying me.\" Earl Cray's eyes dimmed, light fading. \"Be careful of Marquis Fenrir and Vampire Duke Marie Rose. Fenrir inherited two of Mother's powers... and Marie Rose is Mother's second coming...\"\n\nAs his consciousness slipped away, Earl Cray gave Grid advice. Braham and Elfin Stone had both ignored and degraded Cray, despite being kin. Compared to them, Grid seemed... better. An unexpected consequence of the Qualification of a Blood King title combined with Pangea's Duke of Virtue. At the end, Earl Cray felt something close to respect for Grid.\n\n*Swaaaah!*\n\nEarl Cray scattered into ash.\n\n\"...Your personality was similar too.\"\n\nGrid gave a bittersweet smile, reminded of Braham.\n\n**[Owner of the 9th city, Vampire Earl Cray is forced to sleep after exhausting all his powers.]**\n\n**[The level of the party members including 'Grid' has risen by 1.]**\n\n**[The level of party members 'Sexy Schoolgirl' and 'Ruby' have risen by 3.]**\n\n**[The party leader 'Grid' has acquired Cray's Bracelet.]**\n\n**[The party leader 'Grid' has acquired the Finest Opals.]**\n\n**[The party leader 'Grid' has acquired 12 Blessed Weapon Enhancement Stones.]**\n\n**[The party leader 'Grid' has acquired 16 Blessed Armor Enhancement Stones.]**\n\n**[Cray's Strength is engraved on the Rune of Darkness possessed by party leader 'Grid.']**\n\n**[Party member Chris' 'Rune of Supplementation' has been engraved with 'Direct Descendant Resistance,' 'Blood Magic Resistance,' and 'Blood-sucking Capabilities.']**\n\n\"...\"\n\nThe raid's difficulty had earned them appropriate rewards. Grid examined the loot, joy and melancholy mingling in his chest. In particular, he noted the powers attached to the rune Chris had recently acquired.\n\n*As the name suggests—it compensates for weaknesses?*\n\nA rune that would only grow more valuable over time. Pride swelled in Grid's chest. He was grateful—grateful to have fought alongside his comrades and his sister, grateful to have taken down one of the strongest vampires.\n\nBut that joy was brief.\n\n\"What...? He wasn't the owner of the 7th city?\"\n\nGrid belatedly noticed. Earl Cray ruled the 9th city, not the 7th.\n\n\"This—!\"\n\nShock rippled through Overgeared. They'd assumed the exit would open once Earl Cray fell. This unexpected twist was devastating.\n\n\"Wait! Everybody, calm down!\" Lauel's voice cut through the rising panic. \"All the direct descendants have left this place. We still have time to recover. And just like Earl Cray, the rest of the direct descendants will fight us individually without cooperating.\"\n\nYes. There was still hope. Three direct descendants remaining? Fine. Each one fought separately. Everyone believed they could escape the 7th city safely if they defeated the direct descendants one at a time.\n\nThen that expectation shattered. Coincidentally, due to Grid.\n\n**[You have sealed four of Shizo Beriache's direct line. The title Qualification of a Blood King has been promoted to 'Blood King Candidate.']**\n\n**[Blood King Candidate] Lv. 1**\n\n**You have become a candidate to be a Blood King.**\n\n**You will give a sense of pressure to ordinary vampires. All general vampires hostile towards you will have their stats decreased by 15%.**\n\n**You will give a sense of hostility to true blood vampires. All true blood vampires hostile towards you will have their stats decreased by 8%.**\n\n**Direct vampires will be interested in you. Any direct vampires facing you will temporarily awaken from the Curse of Idleness.**\n\n\"Ah...?\"\n\nQualification of a Blood King had reduced general vampire stats by 10% while *increasing* true blood vampire stats by 10%. It also drew the interest of direct descendants—which explained Earl Cray's final change of heart.\n\nBut Blood King Candidate's influence was completely different. It created vigilance in the direct descendants—enough to temporarily overcome the Curse of Idleness.\n\n\"XX, this sucks...\"\n\nThe moment Grid cursed—\n\n\"Cray was defeated?\"\n\nEarl Yetima. One of the three direct descendants who'd stood by and watched the entire Earl Cray battle.\n\n\"This damned—!\"\n\nOvergeared was exhausted from the Earl Cray raid. Skills on cooldown, stamina depleted. If Earl Yetima was the same rank as Cray, Overgeared's survival probability was zero.\n\nHuroi stepped forward.\n\n\"Your Majesty! I'll buy time—take the others and go!\"\n\nAlways. *Always.* Every time a crisis emerged, Huroi sacrificed himself to protect Grid.\n\nGrid looked at him and made a silent vow. He wouldn't sacrifice his comrades again. To make that happen, he had to be stronger.\n\n\"Huroi—protecting you is *my* job from now on.\"\n\n*Step.*\n\nGrid moved in front of Huroi with a single stride. His fighting energy remained at 100 points. He pulled out the trump card he'd been saving.\n\n*Hwaruruk.*\n\nFlames engulfed Grid's body from head to toe. Red fire flickered across his eyebrows and hair. Belial's Power—the authority of the Queen of Fire—activated.\n\n\"I'm certain. You're weaker than Cray. Aren't you?\"\n\nCray had called himself a marquis candidate. Before death, he'd warned Grid about Fenrir and Marie Rose—but never mentioned the remaining three direct descendants. The message was clear: Yetima was weaker than Cray.\n\n\"Kukuk, what does a human know? Even if I'm weaker than Cray, what can you do in your current state?\"\n\nYetima noted Grid's injuries. He was like an intense flame flickering before the wind—ready to be extinguished.\n\nThen—\n\n*Peeng!*\n\nGrid shot upward like a comet.\n\n\"Item Transformation!\"\n\n*Paaaat!*\n\nThe hands behind Grid transformed into Lifael's Spear—four gleaming divine weapons.\n\n\"Trivial humans!\"\n\nIn the sky, Yetima drew a greatsword. He aimed an overwhelming horizontal slash at Grid, believing the human was too injured to counterattack. Yetima didn't bother defending—he planned to tear flesh from bone in a single strike.\n\nThat was his first mistake.\n\n\"Linked Kill!\"\n\nThe Power of Fire boasted overwhelming resilience—Grid had already regenerated a considerable amount of health.\n\n*Puok!*\n\n*Puk puk puk!*\n\n**[You have dealt 539,000 damage to the target!]**\n\n**[You have recovered 100% of the damage dealt to the target due to the effect of Cray's Power, attached to the Rune of Darkness.]**\n\n**[Cray's Power]**\n\n**Passive.**\n\n**Cooldown Time: 5 minutes.**\n\n**Absorb 100% of the damage done to the target. Once the blood volume exceeds maximum health, a red tail will be summoned with a duration proportional to the amount of health exceeded. You can have up to two red tails and cannot control them.**\n\nGrid wielded new power—a force that Yetima, inferior to Earl Cray, couldn't withstand.\n\n\"Kuk...! What?\"\n\nEarl Yetima reeled from Grid's Linked Kill. Contrary to expectations, Grid didn't die. Then Yetima spotted two red tails writhing behind Grid—and shock paralyzed him.\n\n*Stupid Cray! Your power was absorbed by an inferior human!*\n\n*Teteng!*\n\nYetima raised his greatsword to defend against Earl Cray's strength—the red tails. But he couldn't defend against the four Lifael's Spears that followed.\n\nThat was his second mistake.\n\n*Puk!*\n\n*Puuok!*\n\n\"Keok!\"\n\nThe deadly divine power of one of Rebecca's three artifacts pierced through him. Four spears skewered Yetima's torso. Grid leaned close and whispered:\n\n\"Small fry.\"\n\n*Hwaruruk!*\n\nMassive spheres of fire materialized before Yetima's body—Queen's Flames of Hell, dealing damage proportional to the target's health.\n\n*Puaaaaaaaah!*\n\nThe explosion shook the ground. Grid followed up with Pagma's Swordsmanship. Influenced by the Power of Fire, flames erupted repeatedly from the Enlightenment Sword, battering Yetima. Jishuka joined in, her infinite stamina courtesy of the Red Phoenix Bow unleashing relentless arrow volleys. The other Overgeared members surged forward.\n\nYetima stood alone.\n\nThat was his third mistake.\n\nAfter a while—\n\n**[The owner of the 7th city, Vampire Earl Yetima is forced to sleep after exhausting all of his powers.]**\n\nThe entrance to the 7th city—where Overgeared had been trapped—finally opened."
}