{
  "id": 722,
  "title": "Chapter 722",
  "content": "**[Vampire Earl Yetima, master of the 7th City, has been forced into dormancy after exhausting his power.]**\n\n**[Party member 'Faker' has gained 1 level.]**\n\n**[Party member 'Jishuka' has gained 1 level.]**\n\n**[Party member 'Ruby' has gained 2 levels.]**\n\n**[Party member 'Sexy Schoolgirl' has gained 3 levels.]**\n\n**[Party leader 'Grid' has obtained Yetima's Greatsword.]**\n\n**[Party leader 'Grid' has obtained Yetima's Gloves.]**\n\n**[Party leader 'Grid' has obtained the ??? Piece.]**\n\n**[The ??? Piece has been identified as the Red Mirror Piece.]**\n\n**[Party leader 'Grid' has obtained 7 Blessed Weapon Enhancement Stones.]**\n\n**[Party leader 'Grid' has obtained 10 Blessed Armor Enhancement Stones.]**\n\n**[Yetima's Strength has been engraved upon the Rune of Darkness in party leader 'Grid's' possession.]**\n\n**[Party member Chris' Rune of Supplementation has been engraved with 'Cutting Attack Resistance' and 'Vampire Swordsmanship.']**\n\n**[The entrance to the 7th City has opened.]**\n\n\"Hah... hah...\"\n\nGrid's chest heaved as he struggled to catch his breath. Compared to Earl Cray, Yetima had been manageable—*relatively* speaking. The earl was still leagues beyond any normal named boss in power and ferocity. Grid's overwhelming damage output had shortened what could have been an endless slog, but the toll on the Overgeared members had been severe.\n\nEspecially on Grid himself.\n\nPlaying both tank and primary damage dealer through two consecutive raids had drained him—physically, mentally, spiritually. His concentration had been razor-sharp for hours, and now that the adrenaline was fading, exhaustion crashed over him like a wave. He wanted nothing more than to log out and collapse into bed.\n\n*Is it always going to be this brutal?*\n\nNo matter how strong he became, every battle pushed him to his limits. It was the kind of relentless difficulty that would have crushed most players' spirits.\n\nBut not Grid's.\n\nA dark grin spread across his face as he pulled up the loot window.\n\n\"At least the rewards make it worth it.\"\n\n**[Cray's Bracelet]**\n\n**Durability: 8/30**\n\n**Rating:** <span class=\"quality_epic\">Epic (Growth)</span>\n\n* **If afflicted with 'Bleeding,' magic damage and defense increase by 19%.**\n* **The lower the wearer's health, the faster their casting speed.**\n* **When this bracelet reaches Legendary rating, the wearer may summon Vampire Earl Cray.**\n\n*A bracelet infused with Earl Cray's unique magical power. The closer to death its wearer comes, the more devastating they become.*\n\n**Weight: 5**\n\n---\n\n**[Yetima's Greatsword]**\n\n**Rating:** <span class=\"quality_epic\">Epic (Growth, Set)</span>\n\n**Durability: 609/1,300**\n\n**Attack Power: 500~2,890**\n\n**Attack Speed: -5%**\n\n* **Maximum damage strikes deal double damage.**\n* **When equipped with Yetima's Gloves, critical damage increases by 100%.**\n* **When this greatsword reaches Legendary rating, the wearer may summon Vampire Earl Yetima.**\n\n*The favored weapon of Earl Yetima. Its crude, oversized design suggests its wielder had zero aesthetic sense and even less finesse. Incredibly difficult to handle, but in the right hands, capable of devastating power.*\n\n**Requirements: Level 320 or higher. 3,000+ Strength. Advanced Sword Mastery Level 6 or higher.**\n\n**Weight: 3,200**\n\n---\n\n**[Yetima's Gloves]**\n\n**Rating:** <span class=\"quality_legendary\">Legendary (Set)</span>\n\n**Durability: 29/100**\n\n**Defense: 65**\n\n* **Low chance to trigger Joint Attacks twice in succession.**\n* **Attack speed increased by 180%.**\n* **When equipped with Yetima's Greatsword, critical hit chance increases by 10%.**\n\n*Leather gloves favored by Earl Yetima. Makes wielding oversized greatswords significantly easier.*\n\n**Requirements: Level 320 or higher.**\n\n**Weight: 20**\n\n---\n\n**[Red Mirror Piece]**\n\n*Fragment of a circular mirror forged from blood stone. Its true purpose remains unknown. The Third Prince of the Saharan Empire seeks this mirror. It's recommended you gather all pieces and deliver them to him.*\n\n* **Collect 2 more pieces to complete the Red Mirror.**\n\n---\n\nGrid's eyes traced over the haul. Combined with the 19 blessed weapon enhancement stones and 26 blessed armor enhancement stones, today's rewards were worth billions of won in real-world currency. That kind of value made loot distribution a delicate affair—one wrong move and resentment could fester.\n\n\"Anyone who needs one of these items, raise your hand.\"\n\nThe old Grid would have pocketed everything without a second thought. But he'd grown past that. As party leader, fairness mattered. Even items powerful enough to summon direct descendant vampires—he wouldn't monopolize them.\n\nThree hands went up immediately: Euphemina, Zednos, and Laella.\n\nAll three reached for Cray's Bracelet. It made sense—the magic power boost and defense would cover the weaknesses inherent to mage classes. The bleeding requirement was harsh, but the casting speed increase at low health was reliable enough to offset it.\n\n\"Anyone else?\" Grid glanced at Lauel. \"You sure you don't want it?\"\n\nLauel's hand stayed down. The bracelet was built for pure damage dealers, not for someone whose role centered on environmental control and battlefield manipulation. The same reason Grid didn't want it—magic was a secondary concern for him now.\n\nDespite Braham's departure, Grid technically still possessed his second class as a Great Magician. He could cast spells, learn new ones as his intelligence grew. But in practice? Against high-level opponents, he barely touched magic anymore.\n\nThis raid proved it. He hadn't cast a single spell against Cray or Yetima—couldn't afford to. When enemies attacked without pause, like Kraugel had during the National Competition, there was no time for calculations.\n\n*Plus, I almost never bleed in the first place.*\n\nCray's Bracelet would be wasted on him. Better it go to someone who could actually use it.\n\nEuphemina, Zednos, and Laella stared at each other with intense focus.\n\n\"Rock, paper, scissors!\"\n\n\"Yes! I won!\"\n\n\"Damn it...\"\n\n\"Congratulations,\" Zednos mumbled, dejected.\n\nA perfectly fair contest.\n\nEuphemina's face lit up with a bright smile as she clutched the bracelet. \"I'll calculate the bracelet's market value and split equivalent goods with everyone.\"\n\n\"Take your time with that,\" Grid said.\n\nNext came Yetima's Greatsword and Gloves. Grid had no interest in either. The greatsword boasted incredible conditional attack power, sure, but it was *only* attack power. No special utility, no versatility. Compared to his Enlightenment Sword, it was a blunt instrument.\n\n*And with my luck stat...*\n\nThere was zero chance he'd consistently hit maximum damage rolls. Better to pass.\n\nChris, however, practically vibrated with desire. The greatsword's average stats were lower than Grid's, but that maximum damage ceiling was absurd. And Chris prided himself on being the guild's best greatsword user—he was confident he could squeeze every point of damage from it.\n\nThe rest of Overgeared yielded without argument.\n\nThe gloves, though? That was trickier. Nearly every warrior wanted that 180% attack speed boost and the Joint Attack proc. Everyone except Grid, who already had the Holy Light Gloves and Alex's Quick Gloves.\n\nThe conclusion was obvious.\n\n\"It's a set. They belong together.\"\n\n\"Chris, take the gloves too.\"\n\n\"Thank you—seriously, thank you!\" Chris bowed his head, gratitude plain on his face. \"I'll pay you all back. I swear it.\"\n\n\"Don't worry about it. We want the right items in the right hands.\"\n\nA warm moment passed between Chris and his guildmates.\n\nMeanwhile, Pon squatted in the corner, muttering to himself like a man possessed.\n\n\"Please let a spear drop next time... please, just one spear...\"\n\n\"...\"\n\nVantner clicked his tongue and turned to Grid. \"What about the Finest Opals? Can you work with those?\"\n\n\"Not really. I could fumble through it with my dexterity, but the results would be mediocre at best.\"\n\n\"Shame we don't have a jewel craftsman in the guild...\"\n\nMost production class players were based in the Saharan Empire, where they enjoyed massive benefits and infrastructure. Poaching them would be nearly impossible.\n\n\"I'll hold onto the jewels for now,\" Grid said. \"Eventually we'll find someone.\" He pulled up his inventory. \"That just leaves the Red Mirror Piece.\"\n\nTwo more fragments and the mirror would be complete. Add in the Amethyst Shield that Prince Benoit was also searching for, and a larger picture was forming—though what that picture *was*, Grid couldn't say.\n\n*I'll figure it out eventually.*\n\nThe piece vanished into his inventory.\n\nFinally, the blessed enhancement stones.\n\n\"Let's split these evenly.\"\n\nLauel stepped forward before anyone else could speak. \"Your Majesty, what if we distribute the armor stones equally but give you all the weapon stones?\"\n\n\"Me? Why?\"\n\nYes, Grid had carried the hardest weight in both fights. But Katz, Ruby, and Jishuka had been critical. Without any one of them, Cray would have slaughtered the party.\n\n\"I don't need special treatment. We split it fairly.\"\n\nUntil now, Grid had always claimed the best drops from Overgeared raids—especially items from direct descendants. His guildmates had handed him every useful piece without hesitation, and he hadn't forgotten that generosity. He refused to be greedy now, especially with something as essential as blessed enhancement stones.\n\nKatz snorted. \"I don't need garbage I can buy with pocket change.\"\n\n\"...\"\n\nOnce, that comment would have stung. But the Overgeared members knew Katz by now—abrasive exterior, loyal heart. This was his way of looking out for Grid.\n\n\"You've got a weapon that needs enhancing,\" Katz continued bluntly. \"You've suffered the most. We want to see that sword of yours glow.\"\n\nThe Enlightenment Sword. The myth-rated masterpiece Grid had forged with his own hands. It still sat at +0 enhancement—and yet it had carved through the imperial army, the Red Knights, and multiple direct descendants without breaking a sweat. A testament to the absurd power of myth-rated gear.\n\n\"Then I should share them with Jishuka too...\"\n\nHer Red Phoenix Bow was also at +0.\n\nBut Jishuka's expression darkened immediately. \"Are you trying to put me further in debt? Absolutely not. Don't make me owe you more than I already do.\"\n\n\"...\"\n\nShe still hadn't paid Grid back for everything he'd given her. This was her chance to contribute, to invest in *him* for once instead of the other way around.\n\nGrid exhaled slowly, then nodded.\n\n\"All right. Thank you. All of you.\"\n\nHe was eager to see how brilliantly the Enlightenment Sword would shine once it was enhanced.\n\nOf course, that required actually *succeeding* at the enhancement.\n\n**[Enhancement has failed.]**\n\n\"...God damn it.\""
}