{
  "id": 723,
  "title": "Chapter 723",
  "content": "[**Enhancement Failed.**]\n[**Enhancement Failed...**]\n[**Enhancement...**]\n\nFailure after failure after failure. Grid's weapon enhancement attempts were a disaster. Each blessed enhancement stone cost 1,200 gold—and they were vanishing into thin air. The Overgeared members shifted uncomfortably.\n\n\"...Doesn't he have a passive that boosts enhancement success rates?\"\n\n\"He does,\" Ibellin replied to Vantner. \"That's why most of us ask him to enhance our gear.\"\n\nIt wasn't just Ibellin. Nearly every member of Overgeared ran to Grid when they needed something strengthened.\n\n\"But thinking back on it...\"\n\n\"...I'm not sure his success rate is any better than mine...\"\n\nSilence.\n\nThe uncomfortable truth hung in the air. Grid possessed the 'Increased Probability of Enhancement' passive. He'd been the first player to achieve an ultimate enhancement. And yet, his overall track record was... mediocre at best. His success rate barely differed from an average player's.\n\nWhy?\n\nGrid believed his 'increased probability' passive was simply shit. How else could he explain his abysmal enhancement luck? The Overgeared members were beginning to see another explanation.\n\n*'...Cursed hands.'*\n\nThey weren't wrong. Another blessed weapon enhancement stone crumbled to dust.\n\nGrid's hands trembled. His eyes were bloodshot, glistening with unshed tears. Watching thousands of gold vanish into nothing was torture—especially for someone who, unlike Katz, didn't have bottomless pockets.\n\n\"G-Grid, maybe you should take a break?\"\n\n\"Yeah, listen to Toban. This isn't the right time for this.\"\n\nCountless superstitions surrounded enhancement. Lucky times. Lucky places. Most rational people would cut their losses and try again later. But Grid wasn't thinking rationally—not when anger clouded his judgment. After failing so many times, he couldn't shake the irrational belief that the next attempt would succeed.\n\n\"Uwaaaaaah! Come on!\"\n\nGrid roared, hurling another enhancement stone at the Enlightenment Sword.\n\n[**Enhancement Failed.**]\n[**Enhancement Failed.**]\n\nNo miracle occurred. Probability struck Grid down as it always did. The watching Overgeared members felt goosebumps crawl across their skin.\n\n*'Grid's luck is terrible. We should go.'*\n\n*'Maybe myth-rated items have worse enhancement odds than we thought?'*\n\nNormal items could be enhanced to +6 safely. Myth-rated items? They could fail from +0. And every failure decreased the enhancement value—a brutal penalty.\n\nNo one knew the actual success rates for myth-rated enhancements. They'd assumed it was similar to enhancing a normal item to +7. Now they were realizing it might be closer to +8. Or worse.\n\n\"Jishuka, haven't you tried enhancing the Red Phoenix Bow?\" Peak Sword asked, his voice tinged with reproach. \"You could've warned him.\"\n\nJishuka shook her head.\n\n\"I only attempted it a few times.\"\n\n\"Why?\"\n\nIt was a myth-rated weapon. Even at +1, the growth would be explosive. Why wouldn't she push for higher enhancements? Jishuka's expression darkened.\n\n\"How can I afford enhancement stones when I'm still paying Grid back?\"\n\n\"Ah...\"\n\nNo one lived comfortably. Peak Sword was reminded of this timeless truth once again.\n\n---\n\n*If this bracelet reaches legendary rating, the wearer can summon Vampire Earl Cray.*\n\n*If this greatsword reaches legendary rating, the wearer can summon Vampire Earl Yetima.*\n\nWhile Grid drank his bitter cup of failure, Euphemina and Chris studied the information windows of their newly acquired items. Summoning tools for vampire lords! Setting aside their base performance, Cray's Bracelet and Yetima's Greatsword held immense value for that ability alone.\n\nThat's why Euphemina and Chris were grateful Grid had given them the items. They'd fought together. They'd won together. Didn't they have some claim to the loot?\n\nBut Grid's contribution had been undeniable. He'd dealt the most damage, taken the most risks, led the raid. If he'd claimed first pick, neither Chris nor Euphemina could have argued. Yet Grid had distributed the items based on who could use them best—despite the fact that they were Direct Descendant summoning items.\n\n*'Not just anyone can become a king,'* Chris thought.\n\nWhen he'd led the Giant Guild, Chris had monopolized the rare elixirs dropped in his castle's dungeon. Most guild leaders operated the same way—and Chris had considered it his right as a leader. But Grid was different. He made concessions despite his position. He crafted, enhanced, and repaired items for his colleagues without charging them.\n\n*'Respect.'*\n\n*'Thank you.'*\n\nBoth Euphemina and Chris gazed at Grid with newfound trust. They knew about his Blood King Qualification title—and the possibility of him becoming the king of the Direct Descendants. From Grid's perspective, collecting as many Direct Descendant summoning items as possible would be strategically optimal. Yet he'd suppressed his own desires for his companions' sake.\n\n*'I'll raise this to legendary rating.'*\n\n*'Then I'll return it to His Majesty.'*\n\nThey weren't acting purely out of altruism. Items could be replaced. Over time, stronger equipment would naturally come along. By the time the bracelet and greatsword reached legendary rating, Euphemina and Chris would likely have superior gear anyway.\n\n*'Besides, Grid will probably make me something better by then.'*\n\nThey had faith—because the other party was the legendary blacksmith Grid. Joining the Overgeared Guild was one of the best decisions they'd ever made.\n\nWide smiles spread across both their faces.\n\n---\n\n\"You should stop.\"\n\nLauel approached Grid, who was still frantically enhancing.\n\nGrid snorted.\n\n\"If you start something, you finish it. I'm not stopping until I've used every stone.\"\n\n\"What if finishing means you have nothing left to work with?\"\n\nLauel—who understood Korean idioms better than actual Koreans—spoke without hesitation, then issued a warning.\n\n\"I'm worried about the two remaining Direct Descendants.\"\n\n\"Ah.\"\n\nGrid snapped back to reality. Two Direct Descendants had departed alongside Yetima and hadn't returned. If either came back now, the exhausted party would be annihilated.\n\n*'At least the city entrance is still open.'*\n\nGrid returned the remaining six enhancement stones to his inventory and addressed his teammates.\n\n\"Let's evacuate first. We'll rest today and return tomorrow for another expedition—\"\n\n*Whoosh!*\n\nCrimson magic power lanced toward Grid's face.\n\n\"Grid!\"\n\nThe members tensed—then relaxed. The God Hands had intercepted the attack. Everyone whipped their heads toward the source.\n\nTwo earls floated side by side in the air.\n\n*'Damn. Too late.'*\n\nThe Direct Descendants had left Earl Cray earlier to sleep. Lauel had calculated that possibility and deemed the risk of them reappearing very low—the Direct Descendants typically slept for extended periods after exhausting their power. Yet Yetima had returned immediately after Cray's defeat, and now two more appeared after Yetima fell. Lauel had assumed Yetima was an exception because he owned the city.\n\nApparently not.\n\n\"After Cray, they defeated Yetima too?\"\n\n\"These bastards are slippery. We can't face them separately—let's each take one.\"\n\n\"Good idea.\"\n\n\"...!\"\n\nThe vampires' casual discussion of cooperation drained the color from every Overgeared member's face. If both were Yetima-level or stronger, defeating them simultaneously would be impossible—especially in their exhausted state.\n\n\"I'll buy time. Run.\"\n\nGrid stepped forward, prepared to die. He'd sacrifice his life to open an escape route for his companions.\n\nBut the sacrifice proved unnecessary.\n\n\"No need. Just retreat. I've already secured an escape route.\"\n\nWhile Grid had been posturing, Lauel had quietly prepared their exit. Grid blinked in confusion.\n\n\"You... really?\"\n\nGrid scratched his head. Lauel gave him a reassuring nod.\n\n\"I don't make the same mistake twice. Now let's go.\"\n\n\"You! I won't let you escape!\"\n\nThe Direct Descendants pursued as the Overgeared members fled with Lauel. They flew after the group, rapidly closing the distance with their superior mobility. Under normal circumstances, they would have caught up within seconds.\n\nBut something was wrong.\n\n*'What?'*\n\n*'Why can't we catch them?'*\n\nThe Direct Descendants couldn't close the gap. Their flight path was obstructed by countless stalactites, forcing them to slow down constantly. Lauel's plan. He'd memorized the terrain since entering the city and deliberately chosen this route to neutralize their aerial advantage.\n\nThanks to this, the Overgeared members escaped the city without a single casualty.\n\n\"Good work, Lauel!\"\n\n\"We're alive because of you!\"\n\nThe bright desert sun greeted them as the Overgeared members poured through the city entrance, showering Lauel with praise.\n\nLauel covered half his face with one hand and laughed.\n\n\"Kukuku... The children of night are helpless before me, master of darkness. They're nothing but small fry.\"\n\n\"...\"\n\nIt had been a while since Lauel had contributed significantly.\n\n\"Ahem. Let's split up here and reconvene tomorrow.\"\n\nGrid cleared his throat, diffusing the atmosphere, then logged out. His colleagues followed suit.\n\n\"Huh?\"\n\nLauel's laughter faded as he realized he was alone. He missed Damian and the Evil Eyes.\n\nLess than two months remained until the National Competition."
}