{
  "id": 725,
  "title": "Chapter 725",
  "content": "\"Did you calculate all of it?\"\n\nGrid materialized in the 7th Vampire City to find Lauel already waiting. He jerked back, startled.\n\n\"What—Lauel? You're early. We weren't supposed to meet for hours.\"\n\n\"I've been working on the raid strategy.\" Lauel adjusted his glasses. \"You as well, I presume?\"\n\nGrid scratched his head. Unlike their previous encounters with direct descendants, the two remaining earls would fight as allies. No mistakes could be tolerated—not from the guild leaders. They had to stay ahead of everyone else.\n\nReliable as always.\n\nStill...\n\n\"Wait, calculate what?\"\n\nLauel's smile turned sly. \"Giving Cray's Bracelet and Yetima's Greatsword to Euphemina and Chris.\"\n\n\"I... what?\"\n\n\"You've seen how difficult raising an item's rating can be. By letting them use those pieces, they'll enhance the gear for you.\" Lauel tapped his temple. \"Once you claim the king of direct descendants title, they'll gladly return the upgraded items—circumstances permitting, of course.\"\n\nGrid's mouth hung open.\n\n\"It's minimal risk for them,\" Lauel continued. \"When they hand back the gear, they'll simply request new equipment from Your Majesty in exchange.\"\n\n\"...\"\n\nThe thought had never crossed Grid's mind. He'd simply distributed loot to his teammates. The idea that they might return enhanced versions later—\n\nBut listening to Lauel explain it, the logic held water. Win-win-win for everyone involved.\n\n\"Great... I didn't think that far ahead...\"\n\nLauel shrugged at Grid's mumbled confession. \"No need for false modesty. I've witnessed your strategic evolution firsthand.\"\n\n'False modesty...?'\n\nAdmitting the truth would make him look like an idiot.\n\nGrid swallowed his guilt. \"Ha... hahaha, right. Can't fool you, I suppose. Yes, exactly as planned—I gave them the items with full knowledge of the outcome.\"\n\n\"Huhuhut... However clever Your Majesty may be, deceiving me remains beyond reach.\"\n\nLauel laughed, oblivious to the truth.\n\nGrid's conscience twinged.\n\n***\n\n\"Listen carefully.\" Lauel's expression hardened. \"The moment I give the signal, retreat using the path we scouted. Don't look back. Clear?\"\n\n\"Understood.\"\n\n\"Crystal.\"\n\nAfter defeating Yetima, the 7th city's boss had yet to respawn. Without an owner, the entrance remained perpetually open—a vulnerability the two surviving direct descendants seemed willing to tolerate. That open gate served as Overgeared's lifeline.\n\n*Zero chance we survive both earls simultaneously.*\n\nToday's objective was simple: identify the weaker target between Ruson and Noll. Tomorrow, they'd strike whichever proved more vulnerable. Defeat one, and the second became manageable the following day.\n\n\"Check which side shows lower physical resistance versus magic resistance first. That'll determine where our damage dealers focus.\"\n\n\"The instant both earls appear, launch everything. Magicians—gauge their resistances immediately.\"\n\n*Sakak!*\n\n*Puok!*\n\nThe Overgeared members advanced through the city with measured caution. They culled familiars and lesser vampires, conserving skills and spells for the true battle ahead.\n\nAfter an hour of steady progress—Ruby and Sexy Schoolgirl's experience gauges climbing ten percent from the vampire slaughter—the earls manifested.\n\n\"Ho...? Those fools returned?\"\n\n\"Told you they'd be back.\"\n\n\"Bah. Cray and Yetima disgraced our entire bloodline.\"\n\nRuson and Noll emerged overhead, hanging from the ceiling like bats. The sight should have been ridiculous.\n\nInstead, it looked cool.\n\nGrid scowled.\n\n*Even upside down, attractive bastards look good.*\n\nWhere was the fairness in that? Why couldn't he be handsome?\n\nHe channeled his resentment into action.\n\n\"Zednos, Laella! Now!\"\n\n\"Yes!\"\n\n*Hwaruruk!*\n\nLaella's flames merged with Zednos' wind magic. The resulting hurricane engulfed both earls simultaneously.\n\n[You have dealt 41,700 damage to the target!]\n\n[The target has resisted.]\n\n\"...!!\"\n\nThe notification windows made Zednos and Laella freeze. Their cooperative magic—completely neutered. Noll had outright resisted the attack.\n\n\"Both possess higher magic resistance than Cray and Yetima,\" Laella called out. \"Especially Noll—!\"\n\nEarl Ruson dropped toward her like a stone.\n\nPorcelain skin. Ruby-translucent eyes. Long hair framing sharp fangs—a vampire radiating dark mystique.\n\n\"You dare strike first? Your blood will be my—urk!\"\n\nRuson's hand closed around Laella's throat. Then he choked as Grid's blade bit into his back.\n\nBlackening. Blacksmith's Rage. Quick Movements. One hundred fighting energy.\n\nThe full buff suite.\n\nBlack flames erupted across Ruson's back, incinerating his silky hair.\n\n\"You—!\"\n\nGrid ignored Ruson's indignant cry, already airborne toward Noll. His blade carved into the second earl's exposed back.\n\n\"Kuak! Backstabbing coward!\"\n\nNoll's fury matched his brother's, but Grid simply snorted. \"Noll's physical resistance runs higher too.\"\n\n\"These humans!\"\n\nBeing ignored infuriated Ruson beyond measure.\n\nBoth vampires' attention locked onto Grid with predatory focus. Inevitable, really—the dealer with the highest attack power always drew aggro. Grid topped Overgeared's damage charts by a wide margin.\n\nMost damage dealers were glass cannons. Their powerful attacks came at the cost of survivability, keeping them perpetually on the edge of death.\n\nUnfortunately for the vampires, Grid was different.\n\n*Peeok!*\n\n*Kwajak!*\n\nHe weaved between Ruson and Noll's strikes without retaliating, calling out to his teammates as he danced away from their claws.\n\n\"Noll boasts significantly higher magic resistance and defense. Ruson's attack power overwhelms in comparison.\"\n\nHis guildmates nodded, confirming their findings matched Grid's assessment. They'd been hammering both targets with everything in their arsenals, cataloging the differences.\n\nGrid activated Belial's Power at maximum output.\n\nOne hundred percent.\n\n\"Understood. We return tomorrow to eliminate Ruson. I'll buy your retreat time.\"\n\n\"Got it.\"\n\n\"Moving out!\"\n\nThe Overgeared members didn't hesitate. Even Huroi immediately withdrew. None worried about abandoning Grid—they believed in their king. With every buff active, two earl-class vampires couldn't bring him down.\n\n*Pepepepeng!*\n\n*Kwa kwa kwa kwang!*\n\nMagic and steel clashed.\n\nGrid accumulated injuries as his teammates escaped.\n\n*Dirty bastards.*\n\n[The duration of Blacksmith's Rage has expired.]\n\n[The duration of Quick Movements has expired.]\n\nHis buffs began timing out one by one. Blackening would end soon. His health gauge plummeted toward critical levels.\n\n\"Don't imagine you'll leave alive!\"\n\n\"Naive fool!\"\n\nDark grins split Ruson and Noll's faces as they pursued their fleeing prey, anticipating the feast to come.\n\nTheir joy proved premature.\n\n*Peng!*\n\n*Pepepepeok!*\n\nThree hundred meters from the exit, the Alarm spells Grid had planted earlier detonated in sequence.\n\n\"Kuaaaaak!\"\n\n\"Traps?!\"\n\nGrid's Magic Missiles—which ignored magic resistance entirely—tore into both vampires. Their momentum faltered for a critical instant.\n\nGrid slipped through the exit.\n\n\"Until tomorrow.\"\n\n***\n\n\"Well done.\"\n\n\"Good work.\"\n\nThe Overgeared members brightened when Grid emerged unscathed.\n\nHe grinned at their relieved faces. \"Tomorrow, we execute the plan. Ruson dies.\"\n\nKill the weakest link first.\n\n\"Vantner, Toban, Huroi—you three will occupy Noll. Keep him off our damage dealers and Ruby at all costs. One mistake means a wipe.\"\n\n\"Got it. Tight formation, no breaks.\"\n\n\"I've prepared multiple contingencies to keep his attention on me. Won't be a problem.\"\n\n\"...Ruby and Sexy Schoolgirl are present, so watch your language.\"\n\n\"Yes...\"\n\nThe following day, Grid confirmed everyone's cooldowns had reset before marshaling the raid.\n\n\"Move out. Target: Ruson.\"\n\n\"Yes!\"\n\nCasualties were inevitable. Grid and the Overgeared members anticipated significant losses today—Vantner, Toban, and Huroi would do their utmost, but completely containing Noll while raiding Ruson was impossible.\n\nToday's sacrifices would pave tomorrow's victory.\n\nThe Overgeared members entered the 7th city without hesitation, their faith unshakeable.\n\nFive hours later, another direct descendant vanished from the world."
}