{
  "id": 726,
  "title": "Chapter 726",
  "content": "**[The duration of Immortality is over.]**\n\nGrid's chest heaved as he struggled for breath. Blood sprayed from between his lips, painting his vision crimson—the telltale sign that death loomed close. Through the red haze, he heard Noll's voice, thick with murderous intent.\n\n\"You insects... You *trivial* humans...!\"\n\n**[Vampire Earl Noll has used Direct Suppression.]**\n\nThe air itself shuddered. A river of blood still flowed where Ruson had fallen, and now the weight of an ancient predator pressed down on all present—a terror designed to paralyze inferior beings. This power had been a constant obstacle throughout today's raid, breaking formations and crushing morale. Yet now—\n\n**[You have resisted.]**\n\nGrid stood alone in the city. Every other Overgeared member had fallen during the assault on Ruson. Without allies to protect, the pressure of Direct Suppression meant nothing. He met Noll's crimson gaze without flinching.\n\n\"If anyone has the right to be angry here,\" Grid said, \"it's me.\"\n\nThey'd known from the start that facing two Direct Descendants simultaneously would be brutal. But Grid had wanted to minimize casualties, so they'd prepared meticulously—mapping every street, studying both Ruson's and Noll's combat patterns, stockpiling buffs from Reidan's alchemists, planting Alarm traps throughout the district.\n\nThey'd done everything right. And it hadn't been enough.\n\nThe problem was Noll himself. He wasn't merely a tank with exceptional defenses and resistances—his entire kit centered on *support*. Recovery. Ability resets. Blood tsunamis that shattered formations without warning. Healing that kept Ruson in the fight long past his expiration date. But the most devastating tool in his arsenal was Blood Donation: Noll literally poured his own vitality into Ruson, bolstering both health and defense simultaneously.\n\nThe casualties had mounted. Ruson took far too long to kill, and in that extended window, the Overgeared members died one by one.\n\nA chill ran down Grid's spine as he realized the full implications. *If Ruson had supported Earl Cray like this during our first raid...* They never would have taken the 7th city. Even with NPCs like Piaro and Asmophel reinforcing them, victory would've been uncertain at best.\n\n*The Curse of Idleness...*\n\nFor once, Grid felt grateful for that ancient affliction. Without it forcing Direct Descendants into isolation, cooperative vampire lords would be insurmountable. Looking back, it was the only reason he'd defeated Elfin Stone—the vampire had fought alone.\n\nAnd that was precisely why Grid hated his Blood King Candidate title.\n\nIt temporarily *freed* Direct Descendants from the Curse, enabling them to fight at full strength. The same effect applied to Marquis Fenrir and Duke Marie Rose. Vampires several times—or even dozens of times—stronger than the earls. If they ever fought seriously...\n\n\"You're an exception, though.\"\n\nVenom dripped from Grid's smile.\n\n\"You'll pay for what you did to my people.\"\n\n\"**Shut your mouth!**\"\n\nFreed from the Curse, Noll charged with predatory speed.\n\n*Thunk.*\n\nJust seconds before his health potion cooldown would reset, Grid's world drained to greyscale. His heart had been pierced clean through.\n\n**[You have died.]**\n\n**[You have lost 36.2% experience.]**\n\n**[Grid's Boots have been lost.]**\n\n---\n\n\"What's the damage?\"\n\nOutside the 7th vampire city, Grid materialized at the resurrection point and immediately turned to Lauel, who'd been compiling the casualty report.\n\n\"Experience loss across the board. Fourteen people dropped equipment.\"\n\n\"*Fourteen?*\"\n\nDeath in Satisfy carried brutal penalties. Experience loss scaled with level, and there was always the chance of losing items from your inventory. But equipment drops were the nightmare scenario—those items represented both power and massive investment. Losing your main gear meant losing a chunk of your combat effectiveness. Still...\n\n\"The drop rate for equipped items is barely one percent.\"\n\nExactly. When players died, equipment almost never dropped.\n\n*Unless you're me,* Grid thought bitterly. His personal drop rate felt closer to fifty percent.\n\n*Don't tell me my bad luck is contagious...*\n\nHe felt sick. More than half the raid had lost equipment. The guilt was suffocating. And then Lauel delivered the knockout punch.\n\n\"Pon and Vantner both lost their primary armaments.\"\n\n\"...\"\n\nLosing Grid's Boots hurt—they were his mobility option when wielding Grid's Greatsword. But for Pon and Vantner to lose their *main* weapon and shield? Grid couldn't imagine it. It would be like losing the Enlightenment Sword. His gaze drifted toward the two men.\n\nThey were already staring at him.\n\n\"My spear...\" Pon's voice was hollow.\n\n\"My shield...\" Vantner sounded equally devastated.\n\n\"...\"\n\n*If only I could replace them right now.* Both men looked like kicked puppies, too proud to outright beg for replacements despite their obvious need. They could've been brothers—one handsome, one bald, both equally pitiful.\n\n\"I'll craft new equipment,\" Grid said. \"We need to wait for skill cooldowns anyway before attempting another run. Plenty of time to forge replacements.\"\n\nItem creation was the foundation of Grid's strength. Every craft increased his stats, and both Pon and Vantner always paid fairly for his work. This should've been a win-win. Except—\n\n\"We don't have materials.\"\n\n\"...\"\n\n\"...\"\n\nPon's Black Dragon Spear and Vantner's Flame Shield had been forged from Belial's drops—materials from a Great Demon. Recreating them was impossible without equivalent components. Grid's hands trembled.\n\n*If I'd just been stronger...*\n\nRuson wouldn't have been such a nightmare. Jishuka stepped close, her voice gentle.\n\n\"This isn't on you. *We're* the ones who need to improve. Stop blaming yourself.\"\n\nPon and Vantner nodded in unison.\n\n\"She's right. We're the weak ones here. Not you.\"\n\n\"...\"\n\nThe mood turned leaden. Most of the raid had lost valuable gear, and the upcoming National Competition loomed like a shadow over them all—the gathering of each nation's elite rankers. Competing in a weakened state...\n\nOnly Lauel looked cheerful.\n\n\"Actually, you don't need to worry. We can recover everything you dropped.\"\n\nDropped items didn't vanish—they remained where they'd fallen. So why were drops such a catastrophe? Because of *other players.* Hunting grounds couldn't be sealed off. By the time you resurrected and ran back to your corpse, some opportunistic stranger would've looted you clean.\n\nBut the vampire cities were different. They existed in the vast desert of Reidan, hidden and deadly. The difficulty alone kept casual players away, and Lauel had controlled access from day one—he refused to let prime Overgeared hunting grounds become free-for-all zones. That possessiveness was about to pay dividends.\n\n\"Your items are still in the 7th city. Tomorrow, we'll go back to raid Noll *and* retrieve your gear in the process.\"\n\n\"You're right—nobody else can even reach this place.\"\n\n\"We'll guard the entrance just to be safe.\"\n\n\"Tomorrow. We get everything back.\"\n\n\"Hell yes!\"\n\nThe atmosphere transformed. Everyone's spirits lifted as they looked forward to the rematch. Then Lauel raised a cautionary hand.\n\n\"Don't get cocky. Noll's a support specialist, but he's still an earl-class vampire. His overall combat power equals any other Direct Descendant we've fought. If you're careless, you'll die again *before* recovering your items.\"\n\nHe paused for emphasis.\n\n\"And Noll will almost certainly bring his full retinue—vampires and familiars to maximize his support capabilities. Thanks to Grid breaking his Curse of Idleness, he's actually *motivated* now.\"\n\n\"...\"\n\nGrid's chest tightened, but Lauel was just stating facts, not assigning blame.\n\n\"The key to tomorrow's raid is speed—how fast we can grab our gear and regroup. If Noll catches us scattered and under-equipped, we're dead.\"\n\nChris nodded grimly. \"Agreed. Noll lacks the raw damage output of other earls, but he's got crowd control and ridiculous durability. Without full preparation and our complete loadouts, we can't take him down. Everyone memorize exactly where you died.\"\n\nLauel delivered his final warning with quiet intensity.\n\n\"We *must* kill Noll. If we fail here, and Fenrir or Marie Rose decides to join forces with him...\"\n\n*Gulp.*\n\nNervous swallowing echoed across the group. The implication hung in the air like a noose. If Noll's support abilities were stacked onto Marquis Fenrir or Duke Marie Rose...\n\n\"They'd become permanently unraidable.\"\n\n---\n\n\"Everyone remembers their drop location, right?\"\n\nAfter sufficient rest, Grid posed the question before they ventured back into the 7th city. It was probably unnecessary—\n\n\"Grid, do you think anyone could forget where they lost their most precious items?\"\n\n\"I've got the coordinates burned into my brain.\"\n\nGrid accepted their confident responses. \"Good. Move silently until you reach your recovery points. If Noll intercepts us before we're back to full strength, this raid is over before it starts.\"\n\n\"Understood.\"\n\nThe Overgeared members had cleared multiple vampire cities. Experience told them bosses never spawned at the entrance—they appeared later, after enough disturbance drew their attention. The raid would progress normally.\n\nAt least, that's what they believed. Perhaps they'd grown too confident in Grid's ability to predict enemy behavior.\n\n\"Heheheh. I've been waiting.\"\n\n\"...\"\n\nThe instant they crossed into the 7th city, Noll stood before them. He'd anticipated their return and prepared an ambush. Behind him, five hundred vampires and familiars filled the street.\n\nThis was the terrifying artificial intelligence of a top-tier named NPC.\n\n\"I... I'll just be going, then. Haha.\"\n\nGrid laughed awkwardly and bolted, the Overgeared members scrambling after him.\n\n---\n\n\"Fuck it. Call in everyone.\"\n\nAt the entrance to the 7th city, Grid issued the command to his shell-shocked guild members. It was a royal decree.\n\nThe privilege of a king who could mobilize thousands at will."
}