{
  "id": 727,
  "title": "Chapter 727",
  "content": "# Chapter\n\n\"Haap!\"\n\n\"Hiyaaack!\"\n\n\"Hey! Don't roll away from the attack! In real combat, you'll have enemies on all sides waiting to gut you! Stand your ground and grit your teeth!\"\n\nThe training grounds of Reinhardt never fell silent. Morning, noon, and night—the clash of steel and bellowed commands rang out without pause. Asmophel's training regimen knew no mercy. He believed war was inevitable, and his soldiers would fight when exhaustion hit hardest. So they drilled through the night.\n\nThe rotations were brutal but calculated. No soldier trained all twenty-four hours, but every soldier trained in darkness. By now, Asmophel's men could fight blind if they had to.\n\nThe Red Phoenix Group from the East Continent had integrated into this nightmare schedule without complaint.\n\n\"I feel myself getting stronger every day.\" Sua wiped sweat from her brow, breathing hard. \"I never thought I'd say this, but his method works.\"\n\n\"High praise from Lady Sua.\"\n\nThe knights nearby exchanged glances. Asmophel held a prestigious rank, yet he spent every day in the dirt with his soldiers. Sometimes you couldn't pick him out of the crowd—just another body going through the motions. The Red Phoenix members had never seen anything like it.\n\n\"How many nobles would even look at common soldiers?\" one whispered.\n\n\"Pangea's Duke of Virtue,\" another corrected. \"No—King Grid's right hand.\"\n\nGreat leaders bred great followers. They'd come to Reinhardt expecting bureaucrats and courtiers. Instead they found warriors who lived the same code they did. The Red Phoenix Group didn't hold themselves apart because of their higher levels. They trained alongside the Overgeared soldiers as equals.\n\nWhich meant the Overgeared knights couldn't afford to coast.\n\n\"They're already stronger than us,\" Royman muttered, watching Sua flow through a spear drill. \"And they're working twice as hard.\"\n\nThe Western Nova had risen from nothing—an ordinary Reidan soldier until Asmophel noticed her potential. Piaro's direct training had forged her into one of the kingdom's finest knights despite her recent promotion. But compared to the Red Phoenix Group, who'd been forged in the East Continent's crucible?\n\nShe still had ground to cover.\n\n\"We can't match them hour for hour and expect to catch up.\" Royman raised her voice so the other knights could hear. \"We work harder. Simple as that.\"\n\n\"Right!\"\n\nThe training ground's energy shifted, infected by renewed determination. The Red Phoenix Group's presence had lit a fire under the entire corps.\n\nAsmophel watched from the sidelines, hiding a smile.\n\nMost of the knights knew Royman's secret by now. Years of close quarters living made certain things obvious. But Royman herself remained blissfully unaware that her disguise had failed. She still bound her chest with brutal efficiency and tried to use the men's facilities.\n\nThe fact that her fellow knights now fled the changing rooms whenever she entered hadn't registered yet.\n\n\"Camaraderie!\" Royman beamed, misinterpreting their hasty exits. \"That's what I like to see!\"\n\nPiaro alone remained in the dark. He'd trained her personally for years and never questioned her claim. In his mind, Royman was simply an exceptional male knight with strong leadership qualities.\n\nAsmophel sighed.\n\n*My old friend is going to die a bachelor at this rate.*\n\n\"Royal order!\"\n\nThe shout cut through the training ground like a blade. Several riders thundered through the gates, their horses lathered with sweat.\n\n\"All troops except garrison forces—report to Reidan's desert at first light tomorrow morning! By order of the Overgeared King!\"\n\nPiaro and Asmophel locked eyes.\n\n\"I'm leaving now!\" Piaro moved immediately, abandoning protocol.\n\nAsmophel caught his arm. \"Wait. If His Majesty were in immediate danger, he would summon his knights first. Don't panic—coordinate the deployment.\"\n\nPiaro forced himself to breathe. His king needed soldiers, not a reckless commander. \"You're right.\"\n\nThat night, Reinhardt's training grounds emptied. The soldiers who'd filled them with noise and fury marched south toward Reidan.\n\nFor the first time in years, silence settled over the capital like snow.\n\n***\n\n\"What in the *hell* is happening?\"\n\nDuke Steim paced his office, all pretense of dignity abandoned. He ruled six northern cities and held more influence than any noble save Grid himself. As the king's father-in-law, he'd built a reputation for unshakeable composure.\n\nThat composure had shattered the moment he heard Reinhardt's entire army was mobilizing to save Grid.\n\n\"What could threaten him badly enough to require—\" He cut himself off, turning to Laden. \"Tell me I'm overreacting.\"\n\nThe young knight who'd inherited Phoenix's title as the Strongest in the North considered his words carefully. \"His Majesty didn't request northern reinforcements. If the situation were truly desperate, he would have.\"\n\nDuke Steim wanted to believe that. Age had made him cautious—age and the memory of how close he'd come to losing everything before Grid arrived.\n\nGrid *was* the Overgeared Kingdom. Everything revolved around him. If something happened to Grid, the kingdom would shake itself apart. And Duke Steim couldn't bear the thought of his daughter Irene's tears, or his grandson Lord's face crumpling with loss.\n\n\"I'm sending troops anyway.\" His jaw set. \"Better to arrive unnecessarily than too late.\"\n\nThe northern army wasn't ideal for desert warfare. Soldiers bred in ice and snow struggled with heat. But idle regret would help no one.\n\n\"I'll lead them.\" Laden stepped forward. \"I've fought in Reidan's desert before, during Prince Ren's invasion. I know the terrain.\"\n\nDuke Steim studied the young knight, then nodded slowly. Trust settled over his features like a familiar coat.\n\n\"Take the Gale Troops. Their horses move three times normal speed—you'll arrive in time.\"\n\nLaden's eyes widened. \"The Gale Troops...?\"\n\nThe north's elite cavalry. Phoenix had commanded them for over a decade. By granting Laden that authority, Duke Steim was publicly naming him Phoenix's successor.\n\nLaden dropped to one knee. \"I won't disappoint you.\"\n\n\"Just bring our king home safe.\"\n\n***\n\n\"Reinhardt's army is on the move.\"\n\nIn Siren, the Water Clan kingdom beneath the waves, Maxong's son delivered his report with appropriate gravity.\n\n\"Details,\" Maxong commanded.\n\nHis expression darkened as he listened. Grid had saved their kingdom. If the Overgeared King needed help, there was no decision to make.\n\n\"Muster the full military. I'll lead them personally!\"\n\n\"Yes, Your Majesty!\"\n\nNo debate. No council. Maxong's word became instant action.\n\nThe Water Clan possessed physical abilities and magical aptitude that surpassed humanity's limits. Scholars theorized that if the Water Clan had ever desired conquest instead of isolation, the landmasses would belong to them. They were simply that powerful.\n\n\"Move out!\"\n\n\"Ohhhhhh!\"\n\nAn army that rarely left the ocean surged onto land, led by their king. All for Grid.\n\n***\n\n\"Father.\"\n\n\"Mm.\"\n\nHigh on Patrian's walls, Marquis Ashur stood with his son Bland. Both held half-eaten potatoes.\n\n\"I'll be honest with you.\" Ashur took another bite, chewing thoughtfully. \"I hated Grid at first. Joining his kingdom felt like surrender.\"\n\n\"I know.\" Bland's response was quiet.\n\nThey'd grown addicted to these rainbow-colored potatoes—the taste was extraordinary, even for wealthy nobles accustomed to fine cuisine.\n\n\"But I was wrong.\"\n\nAshur devoured his potato, then wiped his hands with a silk handkerchief. The motion was refined, aristocratic. Right up until he licked potato crumbs off his cheek rather than waste them.\n\n\"Watching the Overgeared Kingdom's growth, I understand now. Serving King Grid means serving the future.\"\n\nPatrian's strategic position made it a perpetual target. The Eternal Kingdom had always left it undermanned, forcing the residents to live in constant fear of invasion. Under Grid's rule, everything had changed. Strong soldiers manned the walls. The royal family actually cared whether Patrian's people lived or died.\n\nThe difference showed in every face on the street.\n\n\"I've studied His Majesty's history,\" Ashur continued. \"The effort he's invested, the obstacles he's overcome—it's staggering. I admire him now.\"\n\nBland smiled. Hearing his father respect Grid meant more than he'd expected.\n\n\"Grid isn't just this kingdom's strength,\" Ashur said. \"He's the continent's treasure. The only hero capable of resisting the Saharan Empire. He must remain safe.\"\n\nHe turned to face Bland directly.\n\n\"I want to send troops to Reidan. But I can't leave Patrian undefended with Gauss breathing down our necks.\" His expression hardened. \"Lead the army yourself. Protect King Grid and come home alive. That's not a command, son. It's a request.\"\n\n\"I won't fail you.\"\n\nPatrian's soldiers were the kingdom's finest. Grid and Lauel had poured resources into the border city, understanding its importance. These men had seen real combat.\n\n\"To Reidan!\" Bland raised his voice, and his troops responded with a roar.\n\n\"Yes, sir!\"\n\nThe great magician's son and the legendary farmer's disciple rode through the gates, magic and swordsmanship coiled in his blood, ready to answer his king's call."
}