{
  "id": 728,
  "title": "Chapter 728",
  "content": "The Rebecca Temple in Titan dwarfed even the Vatican. Built on the backs of countless laborers, it stood as a monument to the Saharan Empire's alliance with the Church—a fact that drew no small amount of criticism from the Empire's detractors. Yet to Emperor Juander, this was sacred ground, the true dwelling place of the Goddess Rebecca herself.\n\n\"Your Majesty.\" Earl Lisha's voice echoed through the prayer hall. \"Urgent news.\"\n\nJuander's eyes snapped open. He'd been kneeling before Rebecca's statue, and the interruption soured his mood immediately. Still, Lisha wouldn't disturb him without cause. The intelligence chief bowed low.\n\n\"The Overgeared Kingdom is mobilizing in Reidan. All allied forces. We estimate forty thousand troops massing at the border.\"\n\nJuander's jaw tightened. Forty thousand soldiers on the Empire's doorstep—Grid was making a statement. Under normal circumstances, such provocation would be met with overwhelming force. But these weren't normal circumstances.\n\n\"The Overgeared King chooses his timing well.\" Juander rose, brushing dust from his robes. \"He knows our main army is deployed near Valhalla.\"\n\nThe Undefeated King's Descendant. Just thinking about that man sent ice through Juander's veins. Tens of thousands of imperial soldiers slaughtered. Red Knights cut down like wheat before a scythe. Kyle maimed, losing an arm to that monster's blade. The man wielded the legendary 100,000 Army Swordsmanship alongside magic—a combination that should be impossible.\n\nSome nights, Juander wondered if the Undefeated King himself had returned to walk the earth.\n\nThe heavy deployment near Valhalla was meant as containment. But both Valhalla and the Overgeared Kingdom had misread it as preparation for invasion. Grid's mobilization in Reidan was a counter-threat: *Touch Valhalla, and we'll gut you from behind.*\n\n\"Sigh...\" Juander exhaled slowly, then began to laugh. \"Kuk, kuku! Kukukuk!\"\n\nThe absurdity of it. A kingdom barely out of its cradle, threatening the Saharan Empire. When had anyone dared speak to him as an equal? When had the Empire ever needed to consider another nation's warnings?\n\nTimes had changed indeed.\n\n\"What's the exact troop count?\" Juander asked, composing himself.\n\nLisha's expression darkened. \"I... haven't confirmed the precise number yet, Your Majesty.\"\n\n\"...\"\n\nThe Empire's intelligence network spanned the continent. Spies in every court, every major city. Yet here was Lisha, admitting failure. Juander's frown deepened.\n\n\"Still unable to penetrate the Overgeared Kingdom? Disappointing, Lisha.\"\n\n\"Forgive me, Your Majesty. Their security is... exceptional. Every operative we've placed has been compromised within days. Reinhardt especially—of three hundred agents sent there, fewer than a handful remain in place. We believe they have a significant number of master-level assassins in their employ. I will find a solution.\"\n\n\"Then give me your best estimate.\"\n\n\"Forty thousand, as I said. But Your Majesty...\" Lisha hesitated. \"Numbers alone don't tell the story. The Overgeared Kingdom fields soldiers comparable to our Red Knights. Grid himself has toppled two kingdoms and founded two more in their place. He was instrumental in Valhalla's survival. If he catches our forces at Valhalla from behind...\"\n\nThe unspoken conclusion hung heavy in the air. Hundreds of thousands of imperial troops, rendered useless—or worse, slaughtered wholesale.\n\nJuander clenched his fists. *There's no one I can send.*\n\nLimit and the Red Knights stood with Empress Basara's faction. The Five Pillars were occupied training the next generation of elite knights and mages. Kyle remained, but with only one arm, he was diminished. All because Juander had lost Piaro years ago, weakening the Empire when it could least afford it.\n\nNow the Undefeated King's Descendant had appeared, and the continental balance of power had shattered.\n\n\"This won't do.\" Juander gestured, and a guard stepped forward with his traveling cloak. He donned it and strode toward the temple entrance. \"For now, I must swallow my pride. Prepare a diplomatic envoy.\"\n\n\"Your Majesty?\" The words came out strangled.\n\nDiplomacy. Emperor Juander had never practiced diplomacy. Since ascending the throne, he had been the unchallenged ruler of the continent. He issued commands; others obeyed. One-sided declarations, not negotiations.\n\nBut the world had moved on without him.\n\n\"Send an envoy to the Overgeared King,\" Juander said. \"Inform him that we have no immediate plans to invade Valhalla. Offer a formal truce as proof of our intent.\"\n\nLisha's eyes went wide. Behind them, Guard Captain Bain's face flushed crimson.\n\n\"Your Majesty!\" Bain stepped forward, fists trembling. \"Let me go instead! Forget the useless Red Knights—I'll bring you the heads of both the Undefeated King's Descendant and the Overgeared King myself!\"\n\n\"No.\" Juander's voice was gentle but firm. \"You're the only one I trust to watch my back, Bain. Without you, I can't sleep soundly. Your place is here.\"\n\n\"...\"\n\nGuard Captain Bain was the one man in the Empire whom Juander trusted without reservation. His most loyal sword. His shield against treachery.\n\nAs they left the temple, Juander replayed Kyle's report in his mind. *A monster who wields 100,000 Army Swordsmanship and magic both.*\n\nThe description still sent chills down his spine.\n\n*Better to wait until the Five Pillars are fully mobilized. Yes. This is wisdom, not cowardice.*\n\nHe repeated it to himself like a mantra.\n\n***\n\n**Vampire Underground City #7**\n\n\"Hahahaha! Did you see that? Those pathetic worms fled before us!\"\n\nEarl Noll stood at the city's edge, practically vibrating with excitement. Something fundamental had changed within him. The Curse of Idleness—that ever-present lethargy that plagued all Direct Descendants—had loosened its grip. He wasn't entirely sure how it had happened, only that after repeated encounters with the human called Grid, the word \"bothersome\" had vanished from his vocabulary.\n\nNoll attributed it to rage. The audacity of these humans, daring to challenge a Direct Descendant without fear. That anger had burned away the curse, and in its wake came something he'd never experienced in his centuries of existence: *clarity.* Pure, undiluted emotion.\n\n*So this is what Braham and Elfin Stone were chasing,* he thought. Braham's hunger for knowledge. Elfin Stone's pursuit of love. Both had opened their eyes to desire early, making the Curse of Idleness unbearable.\n\n\"Kuk...! Kuahahaha! But I'm the first to truly overcome it!\"\n\nIn Noll's mind, he'd surpassed both his siblings. He was superior. Stronger. More evolved.\n\nA True Blood vampire approached hesitantly. \"Um... Earl Noll? May we sleep now?\"\n\n\"...\"\n\nThe lesser vampires received only a fraction of the curse compared to Direct Descendants, but \"fraction\" was relative. They were still exhausted, desperate for their coffins. Yet they couldn't leave without permission.\n\nNoll clicked his tongue. \"Sleep here if you're tired. That human could return at any moment.\"\n\n\"...\" The vampires exchanged miserable glances. Sleep on the *ground* like animals? They were nobility!\n\nBut none dared protest. Just as the Direct Descendants revered Beriache, so too did the True Bloods and common vampires bow to their superiors.\n\nOne brave vampire spoke up. \"Earl Noll... humans aren't complete fools. Won't they avoid this place now that they know we're here?\"\n\n\"They'd have to be insane to come back,\" another agreed.\n\n\"Exactly why he *will* return.\" Noll's grin was all fangs. \"That human is a psychopath. He's come here multiple times, fought against impossible odds, and killed my siblings one by one. He's completely mad.\"\n\n\"You think he'll try again?\"\n\n\"I guarantee it. And when he does...\" Noll's tongue ran across his teeth. \"I'll drain every drop.\"\n\nHe'd already tasted Grid's blood once. Exquisite. The sweetness had sent his power surging toward a breakthrough—something akin to what the humans called \"class advancement.\" After annihilating the Overgeared members earlier, he'd grown stronger still. He could feel the difference in his bones.\n\n\"Ten years ago, remember when that human army breached the city?\" Noll said.\n\n\"Thousands of them,\" a vampire recalled fondly.\n\n\"A feast. The first and last time we ate our fill.\"\n\n\"We'll feast again soon,\" Noll promised. \"Weak creatures like to swarm. That lunatic will bring reinforcements—probably as many as we have here.\"\n\n\"Ohh...!\" Drowsy eyes lit up with hunger.\n\nHumans were prey. Always had been. A large group wasn't a threat; it was a buffet.\n\n\"Come, then!\" Noll shouted to the empty air. \"Bring your friends! I'll devour every last one and ascend to heights my siblings never reached!\"\n\n\"Yes, I'm here.\"\n\nThe voice echoed from the city entrance. Unmistakable. Unforgettable.\n\nGrid.\n\n\"Kik...! Kihahahaha!\" Noll shuddered with anticipation. \"You actually came back! You really are insane!\"\n\nThe prey had delivered itself. How thoughtful. How *delicious.*\n\nOther vampires joined in the excitement.\n\n\"Did he bring friends this time?\"\n\n\"How many little snacks did you bring us, human?\"\n\nGrid smiled beneath his helmet. \"Yes. I brought quite a few friends.\"\n\n*Kurururururuk!*\n\nFootsteps rumbled through the entrance tunnel. Not dozens. Not hundreds.\n\n*Kurururururuk!*\n\n\"...?\" Noll frowned. More footsteps. Many more than he'd expected.\n\n*Kurururururuk!*\n\nSoldiers poured through the gate in an endless stream. Dozens became hundreds. Hundreds became thousands. Thousands kept coming.\n\n\"I... can't count them all,\" a vampire whispered.\n\n\"Neither can I...\"\n\nThe column of soldiers seemed infinite. For the first time in their long lives, the vampires felt something cold creep into their chests. Something they barely recognized.\n\nFear.\n\n\"What's wrong with you?!\" Noll roared. \"The banquet is before us! Dinner has arrived! Should predators not rejoice?!\"\n\n\"Ohhhhhhh!\" His voice broke the spell. The vampires shook off their hesitation and launched themselves at the human lines. Noll led the charge, eyes locked on Grid. The other humans didn't matter. Only that sweet, intoxicating blood.\n\n\"I'll feast on you again!\" Noll shrieked.\n\nThen, from directly above:\n\n\"Pounding Mortar.\"\n\n\"...?\"\n\nSomething massive materialized above the vampire swarm—a titanic hammer of pure energy, the size of a house.\n\n*Kuuuuuuong!*\n\nThe impact shattered the ground. The shockwave tore through stone that had stood for centuries. The seventh vampire city, unchanged for hundreds of years, began to crumble around them."
}