{
  "id": 729,
  "title": "Chapter 729",
  "content": "**Pounding Mortar.**\n\nPiaro's masterwork—a Free Farming technique that manifested a house-sized mortar in the sky, crushing everything within a 180-meter radius for two devastating seconds. Despite its overwhelming area of effect, the technique discriminated perfectly between friend and foe.\n\n*Jjirak. Jjirak.*\n\n'What?'\n\nA massive shadow fell across Noll's position. The vampire earl, who had been focused entirely on Grid, felt the air itself grow heavy.\n\n*Kurururung!*\n\nThunder—no, something more artificial than thunder, more intense, more *threatening.* Instinct screamed warnings. Noll summoned his Blood Shield.\n\n*KURURURUNG!*\n\nImpossible weight crashed down.\n\n*Jjejeok! Jjejejejeok! Jjejejejeoook!*\n\nThe Blood Shield shattered. A magical defense robust enough to protect the direct descendants—*annihilated.*\n\n'This strength—'\n\nPain eclipsed the question before Noll could voice it.\n\n\"...!!\"\n\n*Kwajak! Kurururung! Kwajajajajak!*\n\nThe unbearable pressure crushed skin, flesh, and bone. Noll's mouth gaped, but no scream emerged—only bulging eyes and grinding teeth that did nothing against the relentless force.\n\n*Kwajajak!*\n\nHis body, suspended mid-air moments before, slammed into the ground. The earth sank like a meteor strike, swallowing him deeper with each passing heartbeat.\n\n*Peeng! Pepepepeng!*\n\nHundreds of vampires and familiars around him dissolved into grey ash. A massacre of crushing force.\n\n\"Kuk...! *Kuaaaaah!*\"\n\nNoll screamed, channeling his magic to defy this transcendent power—\n\nThe technique ended.\n\n\"Pant... pant... pant...\"\n\nFreedom. Noll gasped, his red eyes surveying the devastation through violent tremors. The city, his familiars, his vampires—all reduced to ash. Everything that had stood so proudly, *gone.* For a heartbeat, shock paralyzed him.\n\n\"A force this deadly to vampires... Did that bastard bring one of Rebecca's dogs?\"\n\n\"...\"\n\nSuch overwhelming power—it *must* be divine. A reasonable conclusion, from his perspective.\n\nReality proved far different.\n\n\"The city's soil... Most unusual. It's absorbed so much blood without seeing sunlight for so long.\"\n\n\"...?\"\n\nDirect descendants inspired terror in humans—their very presence could stop hearts. Noll was more than a direct descendant; he was an *earl.* Save for exceptional individuals like Grid, most humans couldn't even twitch in his presence.\n\nEven now, broken and battered, his killing intent froze thousands of soldiers at the city entrance. They stood pale, unable to meet his gaze.\n\nYet one man ignored it all.\n\n\"Hrmm... If I farmed here, I might grow something truly fascinating.\"\n\n\"...\"\n\nThe speaker wore rags caked with dirt. In his hands, unfamiliar tools—something resembling a sickle but without the edge. Clearly not weapons.\n\n\"Interesting. Very interesting. Certainly interesting soil.\"\n\n\"...\"\n\nNoll had lived his entire existence in this city, isolated from human society. But even he possessed common sense. He understood instinctively: a man in filthy rags, armed with crude tools, belonged to the lowest human castes. A slave, perhaps.\n\nYet the slave remained oblivious to the atmosphere, crouching before Noll to prod the ground while muttering to himself.\n\n\"...All humans are insane.\"\n\nThe Rebecca worshipper who'd unleashed that technique would need time before using it again. Noll resolved to eliminate Grid before the next assault. But first—\n\n\"I'll drink this slave's blood as an appetizer.\"\n\nHe wanted this pest *gone.* Noll snorted, waving a hand dismissively to crush the ground-sniffing slave before launching himself at Grid.\n\nExcept—\n\n\"What?\"\n\nThe \"slave\" casually deflected his attack. Then produced another tool.\n\n*Puk.*\n\n\"*Eek!*\"\n\nAgony exploded across Noll's forehead. Dignity forgotten, he let out an undignified shriek and stumbled backward, clutching his wound in disbelief.\n\n'Divine power...? Is his attack painful because of divine power?'\n\nWas this slave actually one of Rebecca's—\n\n\"But I heard Rebecca's dogs always wear pristine white!\"\n\n\"...\"\n\nPathetic. After witnessing Pounding Mortar, Grid and the Overgeared members now watched Noll get *struck* by this man. Humiliation curdled in Noll's gut.\n\n\"What? What are all of you *doing?*\"\n\nNoll's confusion peaked! If his magic resistance weren't so astronomically high, he'd suspect enchantment. But enchantment was *impossible* for him. Which only deepened the mystery: How had this Grid gathered so many powerful followers? What force had crushed his vampires and familiars? And above all else—\n\n\"You... *Who are you?*\"\n\nThe man he'd mistaken for a slave—Piaro—answered simply.\n\n\"A farmer.\"\n\n\"Farmer?\"\n\n\"Yes.\"\n\n\"A *farmer*...!\"\n\nNoll possessed common sense. He knew humans required food to live, that certain humans cultivated that food. Yes, he understood what 'farmer' *meant.*\n\n\"*You lying bastard!*\"\n\nOutrage boiled over. That a mere human could confuse him so thoroughly, humiliate him so completely—in his centuries of existence, he'd never encountered such audacity. Fury ignited.\n\n\"I'll *devour* you!\"\n\n*KUWAAAAAANG!*\n\nBlood Magic erupted alongside his roar—the high-grade technique exclusive to direct descendants.\n\n*Kurururuk!*\n\nThe crimson torrent swallowed Piaro whole. Exultation flooded Noll. Finally, that once-in-a-century madman would vanish without a trace.\n\nThe feeling lasted one second.\n\n\"The ability to breathe blood like water...! I definitely need to build a farm here!\"\n\n\"...!!\"\n\nPiaro stood unharmed within the Blood Magic. Naturally—he'd survived Great Demon Belial's attacks multiple times. More importantly, Ruby's support enveloped him. With Grid's entire party backing him, Piaro's death was never an option.\n\n*Flash! Flash!*\n\nSaintess Ruby's overlapping heals washed over Piaro. Holy Weapon blessed his equipment. The hand plow in his grip blazed with radiant light.\n\n\"Come at me!\"\n\n\"*Shut up!* Just *shut up!*\"\n\nFirst this monster—far stronger than Grid—claimed to be a farmer. Now the farmer *dared* challenge him directly. Every word from Piaro's mouth sent fresh waves of confusion and rage through Noll, shattering his composure. The Farmer's Provocation skill—an ability Piaro had acquired unintentionally through training warriors like Kraugel and Damian—worked its devastating magic.\n\n\"*Die!* Die! *DIE!*\"\n\n\"Die,\" not \"be eaten.\" The distinction revealed everything: Noll recognized Piaro as something beyond prey. His vision narrowed until only the farmer existed. Nothing else. No one else.\n\nThat tunnel vision proved fatal.\n\n\"Wrath of the Sea!\"\n\n\"Grey Strike.\"\n\nKing Maxong's tsunami crashed forth while Asmophel's glowing blade carved through the air. Both attacks carried enough force to threaten even an earl. Against Noll's shattered composure, they struck with devastating effectiveness.\n\n*Kurururung! Puoook!*\n\n\"*Keok!*\"\n\nThe tsunami swept Noll off balance. The sword impaled his heart. Piaro seized the opening.\n\n\"Fated to Perish.\"\n\n*Puk.*\n\nThe hand plow buried itself deep in Noll's chest. The vampire couldn't even scream. Grid checked the health gauge and clicked his tongue.\n\n\"...How did this happen?\"\n\n---\n\n\"Hey, look—shouldn't you wait your turn?\"\n\n\"What turn? Our Gale Troops arrived *one second* before you. We enter next.\"\n\n\"Ha...? One second? Got evidence? I'll swear it on this potato.\"\n\n\"...\"\n\nMeanwhile, at the gate behind Grid, the soldiers who *hadn't* entered the city continued their squabbling. Grid and the Overgeared members had only unleashed a *fraction* of the gathered forces.\n\n\"Isn't this basically a cheat code?\" Vantner muttered.\n\nThe power of Grid's Royal Order at work."
}