{
  "id": 730,
  "title": "Chapter 730",
  "content": "\"You...! *You!*\"\n\nThe exclamation wasn't directed at King Maxong—but at Piaro and Asmophel. For the first time, Noll abandoned the dismissive term 'human.' He was forced to acknowledge the truth: these creatures were anything but insignificant. Their power transcended the boundaries of mere livestock.\n\n*I refuse to believe it!*\n\nThe hand plow's impact sent fresh agony through his body, accelerating his descent into chaos. He was a direct descendant. A child of the great mother, Beriache herself. The blood of a Great Demon coursed through his veins. By every measure, he should reign as an absolute being in this middle world.\n\n*Then what is this farce? Am I... insignificant?*\n\nIt never occurred to Noll that he faced the very party that had destroyed a Great Demon. The realization shattered his composure.\n\n*Chaaeng!*\n\n*Chaeeeeeng!*\n\nHis shield intercepted Maxong's trident and magic. Blood magic countered Asmophel's blade.\n\n*Puk.*\n\nThe hand plow struck again—catching him in the opening created by defending against the other two.\n\n*Why does it hurt so much?*\n\nThe implement the so-called farmer wielded was too crude to be called a proper weapon. Its inefficiency should have rendered it harmless compared to conventional arms. Yet every strike delivered excruciating pain. The humiliation burned worse than the wounds—to be injured by such a peasant's tool was an insult beyond bearing.\n\n\"Enough games!\"\n\nBetween Piaro, Asmophel, and Maxong's relentless assault, Noll's health dropped to forty percent. Like most named bosses, he entered his second phase.\n\n*Kukukung!*\n\n*Kukukukukukung!*\n\n**Direct Suppression Lv. 2.** By devouring Grid's essence in their previous encounter, Noll's inherent ability had evolved far beyond what other earls could muster. It overwhelmed every target within his awareness, dramatically reducing their stats while inflicting both fear and silence. The duration had doubled.\n\n\"Kuk...!\"\n\n\"Ugh!\"\n\nAsmophel and Maxong staggered as an invisible weight crushed their minds and bodies. The inherent gap between them and a direct descendant was difficult to overcome. Maxong's water clan heritage allowed him to shake off the fear faster than Asmophel, but even he struggled. A grim smile twisted Noll's features.\n\n\"Kik...! Kikikik! Yes, this is how it should be. Look at you—frozen like mice before—*Eek!*\"\n\nHe would reverse everything. Drain the blood from these paralyzed cattle, recover his wounds, and crush them. But his triumphant declaration cut off in a strangled yelp—the hand plow had struck the back of his skull.\n\nNoll's eyes went wide.\n\n\"Why are *you* unaffected?\"\n\nDisbelief colored his shout.\n\n\"A legend doesn't yield.\" Piaro's voice carried quiet authority as he finally revealed his true nature. \"In fact, I'm not usually a farmer.\"\n\n*So that's it!*\n\n*Gulp!*\n\nNoll swallowed hard. The moment Piaro resisted Direct Suppression, the truth became clear—this man was a legend, just like Grid. But what *kind* of legend? Perhaps the strongest classification of all... a Sword Saint. If so, he faced an opponent even more terrifying than Grid.\n\n*What legend are you?*\n\nTrembling, Noll waited for the revelation.\n\n\"I am a...\"\n\n\"L...?\"\n\n\"Legendary...\"\n\n*Gulp!*\n\n\"Farmer!\"\n\n\"X%#@$~!!!\"\n\nThe evil tongue—the ancient language vampires had spoken in Hell before their exile. Though Noll was born in the middle world, his blood as a direct descendant granted him instinctive knowledge of the demon tongue. The vast majority of its vocabulary consisted of horrific profanity...\n\nPiaro's expression hardened as the vile words spilled from Noll's mouth. Though he couldn't comprehend the demonkin language, the cadence was unmistakable—he'd heard similar tones from Grid and Huroi countless times.\n\n\"Did you just curse at me?\"\n\n\"What if I did?\"\n\n\"I'll dig up your dead parents!\"\n\n\"*What?*\"\n\nEven Great Demons didn't cross that line.\n\n*I'm not as depraved as that bastard!*\n\nNoll's gaze snapped toward Huroi, standing at a safe distance from Grid. That garbage human had cursed Beriache herself multiple times. Being compared to him was intolerable. He wanted to actively deny the association.\n\n\"Unforgivable...! We'll have to correct this behavior if you're going to work the fields in the future!\"\n\nPiaro's killing intent erupted—his expression more ferocious than even during the Great Demon Belial raid. His momentum suggested an immediate strike. Yet reality imposed harsh limitations. Noll possessed the overwhelming innate stats of an earl-class vampire, while Piaro had already expended Pounding Mortar and Fated to Perish. Worse, Direct Suppression still bound Maxong and Asmophel, preventing them from offering active support.\n\n*He's powerful—exceptionally so. But does he truly believe he can defeat me one-on-one?*\n\nNoll's crimson eyes regained their calculated gleam. He sought certain victory. Yes, his focus on Piaro had made him forget the broader reality—he was alone, while Piaro commanded an army!\n\n\"**Purification!**\"\n\n\"Eh?\"\n\nSaintess Ruby's skill washed over the battlefield, liberating every ally trapped by Direct Suppression. Instantly, Asmophel and Maxong struck at Noll while Piaro activated Free Farming, delivering another devastating blow.\n\nAnd that was only the beginning.\n\n\"Shoot!\"\n\n*Puk!*\n\n*Puuoooook!*\n\n*Peng!*\n\n*Pepepepeok!*\n\nReinhardt's elite soldiers unleashed a barrage of arrows and magic. Freed from fear by Ruby's Purification, they attacked with renewed courage.\n\n\"We're joining the fight!\"\n\nLaden and Bland, who had arrived late to the city, charged into the front lines. The damage escalated exponentially.\n\n\"Insignificant worms!\"\n\n*Kurururung!*\n\nNoll abandoned his single-target focus, threatening all Overgeared forces within the city with wide-area spells. His berserk phase had begun.\n\n\"E-Everyone evade!\"\n\n\"Take cover...!!\"\n\nThe knights attempted to minimize casualties, but the narrow city streets had become dangerously overcrowded. Soldiers could barely move. If the Overgeared members tried to dodge, they'd collide with each other and inflict more damage than the spell itself. Yet these were elite soldiers trained by the kingdom's finest commanders. They recognized that frantic movement would only worsen the chaos. Every soldier stood their ground, eyes squeezed shut, ready to face the oncoming magic without flinching.\n\nIn that moment, hundreds—no, *thousands*—prepared to die. Yet the actual casualties remained surprisingly low.\n\nThe Overgeared members had positioned themselves among the soldiers.\n\n\"Protect the troops!\"\n\nThese soldiers represented their national strength! Without Grid or Lauel issuing commands, the Overgeared members moved instinctively, each one implementing their own strategy to shield the vulnerable.\n\nKatz consumed special resources to block the blood spells. Tankers like Vantner and Toban activated every defensive skill in their arsenal. Meanwhile, damage dealers such as Chris and Pon attacked the incoming magic to weaken its power—some even threw themselves bodily into the spells' paths.\n\n\"Kuk!\"\n\n\"*Cough! Cough!*\"\n\nThe screams and groans of Overgeared members echoed through the city. Noll was truly formidable—a direct vampire for good reason. Yet even this power seemed inadequate against the legendary farmer, Piaro.\n\n\"**Fly Up!**\"\n\nJishuka fired the Red Phoenix Bow. The skill damaged Noll while simultaneously healing allies. Thanks to her intervention, casualties remained lower than expected. But Noll in berserk mode showed no signs of stopping.\n\n\"Die! All of you will *die!*\"\n\n*Kuwang—!*\n\n*Kwa kwa kwa kwang!*\n\nAnother wide-area spell erupted. It was at this juncture that the soldiers began to hinder the Overgeared members.\n\nThe guild's inability to treat soldiers as expendable resources created a tactical vulnerability—members were obligated to defend them from Noll's area attacks, which exposed the members themselves to danger.\n\n\"Block it!\"\n\nThe water clan joined the effort, using magic to weaken Noll's blood spells. Piaro, Asmophel, and Maxong continued their relentless assault, attempting to interrupt his rampage. But Noll's health recovery was phenomenal—the vampire ability to convert inflicted damage into health combined lethally with the sheer number of targets. Hundreds of soldiers and Overgeared members struck by his magic became fuel for his regeneration. His health gauge climbed steadily.\n\n\"This monster has no cooldown...!\"\n\nVantner's shield durability plummeted to critical levels as he blocked spell after spell to protect the soldiers. Cracks spider-webbed across its surface.\n\nFinally—\n\n*Jjejeok!*\n\n*Jjejejejeok!*\n\nThe shield fractured. One more hit would shatter it completely. Cold dread washed over Vantner. If the shield broke, both he and everyone sheltering behind him would be annihilated. Fear gripped him—until a rhythmic hammering sound reached his ears.\n\n*Teeong—! Teeong—!*\n\n> [The durability of the Lud Shield has been restored.]\n\n> [The durability of the Lud Shield has been restored.]\n\n\"Grid...!\"\n\nVantner's eyes snapped open. Who else but a legendary blacksmith could restore item durability at such impossible speed? Grid's hand settled on his shoulder.\n\n\"I'll end this soon. Hold the line a bit longer.\"\n\nGrid had been protecting soldiers in real time as well—using Revolve to counter area spells, blocking with his shield, and offsetting damage with attack skills. Through this constant combat, his fighting energy had climbed to 80 points. A purple aura surrounded him as he activated Blackening, Blacksmith's Rage, and Quick Movements.\n\nThen—\n\n*Teong!*\n\nHis body launched skyward. His target was obvious.\n\n\"You...! Finally decided to face me!\"\n\nNoll roared as he spotted Grid mid-flight, temporarily ignoring Asmophel, Piaro, and Maxong. This was his chance for revenge against the architect of his current predicament. Enthusiasm flooded through him. He disregarded Piaro's incoming strike, reaching exclusively for Grid.\n\n\"Die!\"\n\n\"**Pagma's Swordsmanship!**\"\n\nGrid had already activated Item Combination—the fused Enlightenment Sword and Failure aimed directly at Noll's heart. Simultaneously, Piaro, Asmophel, and Maxong coordinated their assault.\n\nIn that moment, Grid experienced something unprecedented.\n\n> [You have joined forces with people you absolutely trust!]\n\n> [The player common hidden piece 'Cooperative Skill' has been opened for the first time!]\n\n> [As a reward for first opening the skill, the damage when using the Cooperative Skill has permanently increased by 20%!]\n\n\"**Splitting the Sky!**\"\n\nPiaro unleashed the technique Kraugel had once copied—the skill that broke the heavens themselves.\n\n*Puhahahak!*\n\nBlood erupted like a waterfall from Noll's chest.\n\n\"**Fire Sword!**\"\n\nAsmophel's blade wreathed itself in flames, carving repeatedly into Noll's side. The wounds turned to ash, blocking the direct descendant's natural recovery ability.\n\n\"**Sea Sting!**\"\n\nMaxong's trident blazed with blue magical power, striking Noll's heart with tsunami force.\n\n\"**Linked Kill Wave Pinnacle!**\"\n\nGrid's sword followed in perfect synchronization. The Cooperative Skill—activated when a player and a max-affinity NPC simultaneously targeted the same enemy with skills. It was a convergence of overwhelming power against one of the world's strongest beings. Noll's fate seemed sealed.\n\nBut Grid's abnormal character inadvertently disrupted the natural flow.\n\n> [The title 'Pangea's Duke of Virtue' is activated!]"
}