{
  "id": 731,
  "title": "Chapter 731",
  "content": "**This Wasn't Supposed to Happen**\n\nGrid had envisioned a display of overwhelming military might—the kind only a king could command. He wanted to teach someone who clearly didn't understand the meaning of *true* numerical superiority. So he'd assembled his main force in Reinhardt.\n\nThe final count: over thirty thousand soldiers. A force worthy of raiding Earl Noll. Enough to make the vampire experience genuine terror. Grid hadn't wanted more than that.\n\nYet somehow, everything spiraled out of control.\n\n\"King Maxong of the Water Clan has arrived with his army to aid the Overgeared King!\"\n\nGrid said nothing.\n\n\"Laden and the Gale Troops, my lord! Duke Steim sends his regards!\"\n\nStill nothing.\n\n\"Sir Bland, reporting. My father commanded me to protect Your Majesty.\"\n\nGrid remained silent.\n\n*—Grid-sama, I heard you're in danger! I'm bringing Rebecca's Daughters immediately, so hold on!*\n\n*—...Please don't.*\n\nThe power of a Royal Order exceeded anything Grid had imagined. Lords and adventurers from across the kingdom misread the situation entirely, assuming their king faced mortal peril. Reinforcements poured in from every direction until the vampire city's entrance became so clogged they could barely advance.\n\nIt was a disaster.\n\n*All this food wasted just marching here... What am I supposed to do?*\n\nSoldiers consumed far more provisions during wartime movements than peacetime. Even a simple march devoured resources at an alarming rate—a genuine economic burden for any kingdom. The Overgeared Kingdom, still heavily dependent on agricultural exports, couldn't afford such waste. Food was precious.\n\nGrid sighed as troops continued arriving in droves.\n\n*This is ridiculous...*\n\nFrom the beginning, Grid had only needed Piaro and Asmophel's strength. The soldiers were never meant to participate in actual combat—just stand at attention and intimidate the vampires through sheer presence. Why? First, if soldiers died in battle, the kingdom would suffer catastrophic losses. But there was a second, equally important reason.\n\n*I don't want to split the experience with thousands of NPCs!*\n\nGrid knew that even with just Piaro and Asmophel in the party, the experience would be significantly diluted. Adding thousands of soldiers who'd leech the rewards? Unthinkable. What was the point of raiding a Direct Descendant vampire if the experience gained amounted to scraps? Grid's plan had been simple: make the soldiers wait outside while only he, Piaro, and Asmophel handled the raid itself.\n\n\"Support our allies! Time to repay our debts!\"\n\n\"Summon the tsunami!\"\n\n\"...\"\n\nThat plan died the moment Maxong, commanding his independent force, ordered the entire Water Clan army to join the assault. This was no longer a raid. It was a full-scale war. Grid and his party could forget about meaningful experience, even if they personally killed Noll.\n\n\"Hah...\"\n\nGrid exhaled heavily, motivation draining away. He stood idle, watching Piaro, Asmophel, and Maxong battle the vampire earl. Couldn't bring himself to join. No enthusiasm. No point.\n\nBut he couldn't wallow in disappointment for long.\n\n\"I'LL SLAUGHTER EVERY LAST ONE OF YOU!\"\n\nNoll erupted into a frenzy, enraged by Piaro, Asmophel, and Maxong's coordinated assault. The vampire's overwhelming magic raged unchecked, each spell tearing through Overgeared soldiers by the dozen. The sight snapped Grid back to reality. He stopped mourning his lost experience and rushed forward, defending his troops with defensive buffs before launching into his own attack against Noll.\n\nThen—\n\n[**You have joined forces with individuals you trust absolutely!**]\n\n[**The player-common hidden piece 'Cooperative Skill' has been unlocked for the first time!**]\n\n[**As a reward for pioneering this technique, damage dealt via Cooperative Skill is permanently increased by 20%!**]\n\nPiaro, Asmophel, Maxong, and Grid—none of them coordinated intentionally. They simply read the perfect timing through absolute trust in one another. The result was devastating.\n\n[**All skill power increased by 240% through Cooperative Skill! Your skill damage increased by 260%!**]\n\n*KRAKOOM!*\n\nPiaro's Splitting the Sky descended with force rivaling his legendary Pounding Mortar technique. The impact proved lethal to Noll's defenses.\n\n*CRAAAAASH!*\n\n*BOOM-BOOM-BOOM!*\n\nAsmophel's blade carried similar destructive power, its sealing properties perfectly negating the target's regeneration.\n\n\"Sea Sting!\"\n\nMaxong's ultimate technique—dealing proportional damage to the target's maximum health—demonstrated power reminiscent of Piaro's Fated to Perish.\n\n\"Khuok...!\"\n\nThree techniques struck simultaneously. Noll's health gauge plummeted to critical levels in an instant. The Cooperative Skill proved catastrophically effective against the vampire, whose berserk state had stripped away his defensive abilities. Noll staggered, coughing blood. Through his blurring vision, he saw Grid approaching.\n\n\"Linked Kill Wave Pinnacle!\"\n\n\"You...!\"\n\nThose same four consecutive sword techniques that had slaughtered his brother. Noll couldn't mistake the harbinger of his own death. Of course, he refused to accept it. He was hundreds of years old. Centuries spent sleeping under the Curse of Idleness. He'd *finally* overcome that curse. Finally ready to experience life. He didn't want this world to end now. He had to survive—somehow. Escape the city, escape the desert, walk the surface world.\n\nBut—\n\n*Thunk!*\n\n*Thunk! Thunk! Thunk! Thunk!*\n\n\"...!!\"\n\nGrid's assault exceeded anything Noll could have imagined. The havoc of the Cooperative Skill made each strike a death sentence.\n\n*CRAAAAAASH!*\n\n*WHAM!*\n\n*FWOOOOSH!*\n\nPierced repeatedly, Noll's body erupted in black flames, threatening to reduce him to ash.\n\n*Ah... Ahhh...*\n\nNoll's consciousness dimmed. The pain that had dominated his body and mind faded away. Only one feeling remained: regret. An overwhelming hunger for life.\n\n*This too is a curse...*\n\nIf he were still suffering under the Curse of Idleness, death wouldn't feel so terrifying, so tragic. He might even welcome leaving this world as an escape from that burden. But Noll had overcome the curse. He'd tasted the desire to truly *live.* Being killed in this state—with so much left unexperienced—was unbearable. Grief consumed him.\n\n*Flash!*\n\nEnergy erupted from Grid's blade in a wave before plummeting like a thunderbolt. The final blow.\n\n*Mother... your foolish son who should never have been born... this worthless existence is leaving the world. I wanted to prove your sacrifice in bearing me was worthwhile, but the fate of a naturally cursed being is too difficult to overcome.*\n\nHis life's kaleidoscope showed only two images: the coffin that served as his bedroom, and his mother's face. Noll felt hollow realizing this was his entire existence. He'd failed her.\n\n*If... if another chance came...*\n\nHe'd live completely differently. But it was merely wishful thinking. This was the end. Noll closed his eyes, accepting death. Grid's sword hovered before his face.\n\nYet—\n\n\"...?\"\n\nA question formed. Grid's sword—which should have split his skull like a melon—appeared to have stopped inches from his nose.\n\n*Am I mistaken?*\n\nPerhaps he'd already died, his soul now wandering the eternal chaos? Yes, that must be it. He'd been killed without even feeling the final blow. After a moment, Noll organized his thoughts and opened his eyes, bracing himself for the landscape of eternal damnation his cursed soul would inhabit.\n\nInstead—\n\n\"Hah... hah...\"\n\nIt wasn't chaos. It was Grid, breathing heavily. The massive greatsword in his hands remained suspended, frozen before Noll's eyes.\n\n\"...\"\n\nAwkward silence descended. Everyone watched Grid, wondering why he hadn't delivered the killing blow.\n\n\"Wh... what?\"\n\nNoll stared up in equal confusion, unable to understand Grid's intention.\n\n\"...\"\n\nGrid said nothing. He simply raised his sword again—only to stop once more, the blade hovering before Noll's nose. Noll frowned.\n\n\"What...? Why won't you kill me?\" A realization struck him. \"You... you're *sympathizing* with me?\"\n\n\"...\"\n\nGrid remained silent, his expression conflicted. His mouth opened and closed repeatedly without producing words. Noll became certain.\n\n\"That's it... you sympathize with me. You recognized my yearning for life, my vulnerable heart...\"\n\nFor someone who'd lived hundreds of years, Noll experienced something utterly unprecedented. Despite his appearance as a beautiful thirteen-year-old boy, his delicate frame and voice began trembling.\n\n\"A human...! A *human* is...!! Feeling sympathy for a Direct Descendant...!\"\n\nTears streamed from Noll's eyes as he cried out. Was it shame that a human pitied him? No. It was gratitude. He was someone who'd never proven his worth, who'd merely *existed.* He'd never dared dream someone might sympathize with him enough to spare his life.\n\nYet such a person stood before him now—an opponent he'd fought repeatedly over the past several days. Noll understood dimly.\n\n\"Yes... you... you must have recognized my value. Through your experiences these past few days, you became convinced I'm a good vampire.\"\n\n\"...?\"\n\n\"...Thank you. For not denying me. For giving me a chance. I'm moved for the first time since birth.\"\n\n\"...??\"\n\n\"I can live because of you. My remaining life belongs to you now. I'll prove my worth and repay this favor at your side.\"\n\n\"...\"\n\nGrid said nothing to the end. Noll assumed it was due to overwhelming emotion. Naturally so. A human becoming master to a Direct Descendant vampire? Unheard of. A legend so improbable no historian would record it. Of course Grid was speechless from excitement.\n\nAt that moment, Piaro spoke in Grid's place.\n\n\"An excellent idea, serving King Grid. Come work the fields with me.\"\n\n\"What the f—\"\n\nNoll barely caught himself. This insane former Sword Saint who kept pretending to be a farmer, treating him like some common laborer—it grated on every nerve. Noll liked Grid well enough, but Piaro? Pure hostility."
}