{
  "id": 732,
  "title": "Chapter 732",
  "content": "**What? What the hell?**\n\nConfusion rippled through the Overgeared forces. They'd had it—a perfect opportunity. Grid, coordinating with Piaro, Asmophel, and Maxong, had been poised to end the battle. The vampire Earl's health gauge had plummeted. The guild members were already salivating over potential loot drops.\n\nThen Grid froze. His blade halted a hair's breadth from the killing blow.\n\n\"Purification!\"\n\nSaintess Ruby assumed her brother had been hit with a debuff. The spell activated, washing over Grid in holy light—and accomplished nothing.\n\n[Target is in a normal condition.]\n\n\"Brother...?\"\n\nHad he disconnected? Ruby's mind raced through worst-case scenarios. She knew her brother well enough to picture him filing a lawsuit against the internet provider before the day was out.\n\nThen Noll moved.\n\n\"I live only because of your mercy. What remains of my existence is yours.\" The vampire Earl knelt before Grid, head bowed in submission. \"I will prove my worth at your side. This I swear.\"\n\nGoosebumps erupted across Ruby's arms. The same stunned realization swept through every Overgeared member present.\n\n*A direct descendant...*\n\n*Did he just tame it?*\n\nIt defied everything they knew about Satisfy. Even legendary tamers couldn't bind named bosses. Yet Grid—who wasn't even a tamer class—had somehow made a named boss kneel in loyalty. The scene shattered every rule they'd learned.\n\nThe silence stretched for three heartbeats.\n\n\"Truly God Grid!\"\n\n\"As expected from My Lord!\"\n\n\"Kehehehe...! Your grace even captures the hearts of monsters?\"\n\nPeak Sword, Huroi, and Lauel—the infamous Grid worship trio—erupted into rapturous praise.\n\n\"The Blood King Candidate title interacting with mercy mechanics to trigger direct descendant loyalty?\" Peak Sword's voice rang out across the battlefield. \"Only Grid, with his complete mastery of Satisfy's hidden systems, could execute such a strategy! Truly God Grid! The pride of South Korea!\"\n\n\"My Lord has already won the loyalty of countless named NPCs,\" Huroi declared. \"Why should taming a monster be any different? But to capture a *direct descendant*—this transcends even my wildest expectations. I am humbled in your presence!\"\n\n\"Kehehehe... I suspected as much when His Majesty tamed the Evil Eyes.\" Lauel's grin was positively feral. \"His ability to pierce through surface mechanics to the fundamental truths beneath is priceless. Kehehehe...!\"\n\nThe trio spun the situation into something far grander than reality warranted.\n\n\"Ah... well...\"\n\nGrid opened his mouth to correct them, then snapped it shut. Tens of thousands of soldiers stared at him with shining eyes. The truth would only disappoint them.\n\nHe made his choice.\n\n\"Hahaha! Yes, exactly right. I studied Noll's psychology and acted accordingly. Thanks to his cooperation, everything proceeded as planned.\"\n\n\"OHHHHHHH!\"\n\n\"Long live King Grid!\"\n\n\"Long live the Overgeared King! Long live the Overgeared King!\"\n\nThe army erupted. The cheers thundered across the battlefield. Every soldier looked at their king with renewed awe and respect.\n\n*...I'll tell my core team the truth later.*\n\nGrid ignored the worshipful stares and began organizing the troops.\n\n***\n\n*Actually... this worked out better.*\n\nGrid had expected experience, items, and a new rune power from raiding Noll. He should have been furious at Pangea's Duke of Virtue for activating at the worst possible moment. The cursed title had been dormant since he'd acquired it. No—he'd been *praying* it wouldn't activate. When it had triggered right as he delivered the final blow, preventing the kill, his rage had been incandescent. Experience, items, and rune power, all of it slipping through his fingers like smoke.\n\nThen Noll had sworn fealty.\n\nAn earl-class direct descendant. Alive. Loyal. *Permanent.*\n\nExperience and items suddenly seemed trivial. What had Grid truly wanted from hunting a direct descendant in the first place? A summoning item. But raising a summoning item's rating was notoriously difficult. Even if he eventually succeeded and summoned a direct descendant, the creature would be reset to level one. Worse, summoning duration was limited—just like regular pets.\n\nBut Noll had subordinated himself while at full power. No level reset. No time limit. No penalties whatsoever. Grid had gained a supporter comparable to Asmophel or Piaro—a force multiplier worth thousands of troops.\n\n\"Hm.\"\n\nGrid smiled at Noll, his eyes warm with genuine affection.\n\n\"I'm human. Livestock, by vampire standards. Can you truly serve me?\"\n\nHe needed to know. This was a dealbreaker.\n\nNoll didn't hesitate. \"You acknowledged my existence. You gave me purpose. Your species is irrelevant.\"\n\nThe vampire's voice carried absolute conviction. Grid was the one who'd seen him as more than a sleeping curse-victim. That mercy had given Noll something he'd been denied for centuries: value.\n\n\"I swear on my mother's name—I won't look down on you for being human. I won't see you as prey or food.\" Noll paused. \"However.\"\n\n\"However?\"\n\n\"I cannot speak for other humans. You know what sustains me.\"\n\n*Slurp.*\n\nNoll's gaze drifted to Grid's teammates and soldiers in the distance. Hunger burned in his eyes. Raw, predatory desire. Every human except Grid was prey. It was inevitable. Eat and be eaten—the eternal dynamic between vampire and mortal.\n\n*Right...*\n\nGrid's mood soured as the practical problem manifested. He'd need to constantly provide Noll with human blood.\n\n*If word spreads that the king keeps a vampire and feeds him citizens...*\n\nHis reputation would crater. Enemy kingdoms would weaponize it in propaganda campaigns. He'd lose public support overnight. The headache building behind Grid's eyes intensified as he drew the King's Sword.\n\n*Character Observation.*\n\n**Ting~**\n\n**Name:** Noll  \n**Age:** 219 years old  \n**Gender:** Male  \n**Species:** Direct Descendant Vampire  \n\n**Title:** Fourth Child of Shizo Beriache  \n* Inherited Beriache's attribute of compassion. Can use blood magic with beneficial effects on allies.\n\n**Title:** Vampire Who Has Overcome the Curse of Idleness  \n* Strong desire for life. If health falls below 10%, will become cowardly, losing purpose and seeking only survival.  \n* Strong desire to broaden horizons. Will actively seek learning opportunities.\n\n**Title:** Predator  \n* True power manifests when hungry. Current hunger level: 5/10.\n\n**Level:** 433  \n\n**Strength:** 3,500 (▼)  \n**Stamina:** 2,449 (▼)  \n**Agility:** 1,980 (▼)  \n**Intelligence:** 3,500 (▼)  \n\n**Skills:** Direct Suppression (SS), Blood Transfusion (S), Blood Donation (SS), Blood Magic (S+), Run Wild (SSS)\n\n*A child particularly beloved by Shizo Beriache. She was fascinated by the compassion sleeping deep in Noll's heart, hoping he would strengthen his brethren and overcome trials alongside them. But like the other direct descendants, Noll could never meet her expectations. The Curse of Idleness was to blame.*\n\n*Noll remains bitterly resentful of this fact.*\n\n**[Run Wild]**  \nReduces cooldown of all magic to 3 seconds. Doubles mana consumption.\n\n\"Wow.\"\n\nGrid couldn't suppress his amazement. Noll's stats were far higher than expected.\n\n*How strong is he at full power?*\n\nObviously weaker than his boss form. In that state, Noll had boasted tens of millions of health—tens or even hundreds of times his current pool. But bosses and NPCs operated under different rules.\n\n*When an enemy becomes an ally, they always get nerfed.*\n\nThe universal law of gaming.\n\n*Even accounting for that, Noll is much stronger than expected.*\n\nWhich made the vampire issue even more frustrating. Grid sighed.\n\n\"What's wrong?\" Noll asked. \"Is there a problem?\"\n\n\"Can you survive on anything besides human blood? You understand my position—I'm a human king. I can't sacrifice my people to feed you.\"\n\n\"Why not?\"\n\n\"Isn't it a moral problem?\"\n\n\"Moral...?\" Noll's brow furrowed. \"I don't understand this concept. However, there is one alternative to human blood.\"\n\n\"What is it?\"\n\nNo one had to die! Grid's eyes lit up like lanterns.\n\n\"Elixirs. When human blood is unavailable, elixirs can sustain me.\"\n\n\"Ah, so that's why you occasionally drop elixirs as loot. Emergency rations that you dropped when you died...\"\n\nGrid's expression darkened again. He couldn't afford to use elixirs as vampire kibble. Noll responded to his heavy sigh.\n\n\"My sustenance isn't your concern. I can procure my own food. Hunting humans is sufficient.\"\n\n\"That's precisely the problem.\"\n\nGrid needed to control Noll's feeding to prevent chaos. If the vampire randomly attacked citizens in Reinhardt, the resulting confusion would be catastrophic.\n\n\"This human blood... how much do you need to function?\"\n\nHis tone was blunt. Clinical.\n\nNoll answered honestly. \"If I sleep, I can go decades without feeding. But I require blood equivalent to three people to operate properly for one day. For peak condition, one hundred servings.\"\n\n\"What happens to the people you drain?\"\n\n\"They die or become vampires.\"\n\n\"Can't you draw blood separately and drink it from a cup?\"\n\n\"Pointless. It must be fresh.\"\n\n\"Damn.\"\n\nWorth a thousand soldiers, but saddled with impossible requirements. Grid's mind churned through the logistics, finding no solution.\n\nThen Piaro approached.\n\n\"Don't worry about the vampire's food, Your Majesty.\"\n\n\"Piaro...? You have a solution?\"\n\nHope surged in Grid's chest. Noll snorted derisively—as if a madman playing farmer could solve anything.\n\nPiaro smiled serenely. \"I believe I can cultivate blood-rich plants using this city's soil. The vampires can subsist on them.\"\n\n\"What...?\"\n\nNoll's jaw dropped. *Plants?*\n\n\"I'm a vampire! Moreover, I'm a direct descendant! I cannot become a *vegetarian*!\"\n\nHis voice cracked with outrage at the absurd suggestion.\n\nPiaro's smile widened. \"But what if you cannot access human blood?\"\n\n\"I'd rather consume elixirs...!\"\n\n\"No, vegetarianism is preferable.\"\n\n\"Hey!\"\n\n\"Shall we begin farming, then?\"\n\n\"You crazy bastard...!\"\n\nGrid pinched the bridge of his nose. \"...I've added another loud person to my retinue.\"\n\nAn elderly one, at that. He was seriously beginning to worry whether he gave off some kind of 'lonely old bachelor' pheromone that attracted eccentric older men."
}