{
  "id": 733,
  "title": "Chapter 733",
  "content": "Grid studied the vampire earl with calculated interest. In terms of raw combat potential, Noll actually surpassed Piaro. His stats were superior, his regeneration formidable, and his defensive capabilities exceptional. But what truly caught Grid's attention was something else entirely.\n\n*He wants to live.*\n\nThat single trait made Noll infinitely more valuable than other powerful subordinates.\n\nNamed NPCs like Piaro and Asmophel were undeniably powerful—perhaps even stronger in pure skill—but they carried a fatal flaw: they were mortal. One death, one miscalculation in battle, and they'd be gone forever. No resurrection. No second chances. The thought of losing them gnawed at Grid constantly.\n\nWhat made it worse was their damned chivalric code. Both men treated their lives as expendable assets, ready to throw themselves into the flames at the slightest provocation if it meant protecting their lord. Their loyalty was absolute. Their survival instincts? Practically nonexistent.\n\nGrid hated it. Every deployment felt like sending family members to war.\n\nNoll, however, was different. The vampire clung to his existence with fierce desperation. If a battle turned against him, he'd abandon pride and retreat without hesitation. Some would call that cowardice. Grid called it *sense*.\n\n*I can actually use him without losing sleep over it.*\n\nThe possibilities bloomed in Grid's mind. A direct descendant vampire—one of the legendary bloodline itself—serving as a general of the Overgeared Kingdom. The image was intoxicating. His pulse quickened just imagining the reactions when word spread. A *named NPC* as a subordinate. A *direct descendant* under a player's command.\n\n*The forums will explode.*\n\nHe couldn't help the smile that spread across his face, or the way his chin lifted with satisfaction. This wasn't empty posturing. This was genuine pride in a hard-won achievement.\n\nThen reality crashed back in, and the smile died.\n\nThe food problem.\n\n*Damn it.*\n\nGrid grimaced. He couldn't let Noll loose on the general population—that was a diplomatic nightmare waiting to happen. Which left only one option: Piaro's insane proposal.\n\nThe farmer had been adamant that he could cultivate new crops in the vampire city. Crops that would sustain Noll without requiring a steady diet of Grid's citizens. It sounded absurd. It probably *was* absurd. But Piaro had never failed him before.\n\nGrid squared his shoulders and turned to face the still-fuming vampire. \"Noll. Until we solve your feeding situation, you'll be working in the fields under Piaro's supervision.\"\n\nThe color drained from Noll's face.\n\n\"*What?*\"\n\nFor a moment, the vampire simply stared, as though the words hadn't quite registered. Then understanding dawned, and with it, disbelief.\n\n\"Bah! I see—human humor! Very amusing, my lord. The puns in your language take some getting used to—\"\n\n\"I'm serious.\"\n\nNoll froze mid-laugh.\n\n\"I apologize,\" Grid continued, his tone firm but not unkind. \"But I can't risk unleashing you in your current state. The consequences would be catastrophic.\"\n\n\"Catastrophic?\" Noll's voice climbed an octave. \"This is a matter of *morals*? My lord, I give you my word—I won't touch *your* people. I'll feed on other kingdoms! Enemy territories! The possibilities are endless—\"\n\n\"Which would trigger a diplomatic crisis.\" Grid shook his head. \"And in the long term, we need a sustainable solution. Not a short-term fix that starts wars.\"\n\n\"Kuk...!\" The vampire's fangs flashed as he ground them together. Real anger sparked in his eyes now. \"You would have me—*me*—grubbing in the dirt like a common peasant? Do you have any conception of my *value*? The power I represent? I could make you emperor of the human world! And you want me to... to *farm*?!\"\n\n\"...\"\n\nGrid winced. He couldn't entirely blame Noll for the outrage. If someone asked him to spend his days hoeing turnips after everything he'd accomplished, he'd probably react the same way.\n\nBut what choice did they have?\n\n\"Human society has rules,\" Grid said carefully. \"Structures. Systems. If you're going to live among us—and you are, as my subordinate—then you need to understand how we operate.\"\n\n\"I *understand* perfectly! But manual *labor*—\"\n\n\"...\"\n\nGrid's conviction wavered. He turned to Piaro, lowering his voice. \"I'm starting to think Noll has a point. Making a direct descendant vampire work a field... Do you really need him for the farming? Couldn't we—\"\n\n\"Absolutely necessary,\" Piaro cut in without hesitation. \"Vampire blood will be crucial for cultivating the new crop strains. Beyond that, field work builds character. It teaches discipline, patience, and humility—all qualities Noll will need to adapt to the human world. It will cultivate both his body and his mind.\"\n\n\"R-Right...\"\n\nWhen Piaro spoke with such certainty, Grid found it impossible to argue. The man's track record spoke for itself.\n\n\"Speaking of cultivation,\" Grid ventured, \"any progress on the golden walnuts?\"\n\nPiaro's expression darkened slightly. \"Nothing yet.\"\n\n\"Yeah... I figured.\"\n\nHalf-elixirs weren't exactly known for being easy to farm. Hell, it might be outright impossible—the balance implications of players growing their own stat-boosting consumables would be game-breaking. The S.A. Group had probably hardcoded safeguards against it.\n\nGrid pushed the disappointment aside. \"All right. Everyone returns except Piaro and Noll. We're done here.\"\n\n\"*Excuse me?!*\" Noll's voice cracked like thunder, completely at odds with his youthful appearance.\n\nLauel materialized at Grid's elbow before the vampire could continue his protest. \"Your Majesty, with this much firepower assembled, shouldn't we push our advantage? We could clear out the remaining cities while we have momentum.\"\n\nGrid considered it for half a heartbeat, then shook his head. \"Not worth it.\"\n\nThe truth was simple: Marie Rose and Fenrir were untouchable. Marie Rose was pure suicide—Grid wouldn't even *consider* challenging her until he was significantly stronger. Fenrir was only slightly less impossible, requiring at least a fourth advancement before the fight became remotely feasible. Throwing their army at either one would result in catastrophic losses.\n\nWhich left the cities without direct descendants. And those...\n\n\"The cities without direct descendants don't offer enough reward to justify the deployment,\" Grid explained. \"More importantly, the National Competition is almost here. Our time is better spent on personal growth.\"\n\nLauel absorbed this, then nodded decisively. \"Understood. A wise allocation of resources.\"\n\n\"Pull everyone back.\"\n\n\"Yes, Your Majesty!\"\n\nThe order rippled outward like a stone dropped in still water. Within moments, tens of thousands of soldiers began their coordinated withdrawal—all moving in response to a single command.\n\nThe sheer *weight* of that authority settled over Grid's shoulders like a physical thing.\n\n*King.* The word resonated in his chest. *I'm a king now.*\n\nWhich meant every action reflected on his people. Their honor was tied to his. Their reputation rose and fell with his.\n\nSo...\n\n*I'll give them something to be proud of.*\n\nThe National Competition loomed ahead. This year would be different. This year, even facing Kraugel, Grid wouldn't accept defeat.\n\n*This time, I win.*\n\nLast year's loss demanded repayment. Last year's humiliation required an answer.\n\nGrid's hands clenched at his sides, and fire kindled behind his eyes. Just thinking about the coming battle with Kraugel sent anticipation flooding through his veins.\n\n***\n\n\"How do you assess Japan's prospects for this year's National Competition?\"\n\nThe camera flashes formed a strobing constellation, each burst of light accompanied by the mechanical *click-click-click* of shutters. Hundreds of reporters pressed forward, their recorders thrust toward the man at the center of the storm.\n\nDamian faced them without flinching.\n\nAs both a top-ranked Japanese player and the first user to achieve the rank of Pope in the Rebecca Church, he occupied a unique position in Japanese society. His open admiration for Grid—a Korean player—had earned him criticism from certain nationalist circles. But his undeniable skill and accomplishments made him untouchable. He was a hero, whether the right-wing media liked it or not.\n\nThe Japanese people expected great things from him, especially with this year's competition being hosted on home soil.\n\n\"A century ago, Japan was considered weak in e-sports,\" Damian began, his voice cutting through the murmur of the crowd. \"But that perception was rooted in cultural tendencies—specifically, a historical neglect of online gaming—not a lack of talent. Japanese gamers have always possessed exceptional skill. Access to gaming from an early age has created a strong foundation.\"\n\nHe paused, letting the words sink in.\n\n\"Satisfy has proven this definitively. Japanese players appear on numerous class rankings. Based on our current strength, I believe Japan can reach the top five this year. For a host nation, that's an achievement to be proud of.\"\n\nMost of the reporters nodded—the assessment was measured and realistic.\n\nBut a few faces showed dissatisfaction.\n\n\"Aren't you underestimating Japan's potential?\" one reporter challenged. \"Between yourself and Katz, plus the depth of our ranked players, we have more high-level competitors per capita than China or India, despite their massive population advantages. When you account for population ratios, Japan arguably has the highest concentration of rankers in the world.\"\n\nAnother voice joined in. \"Top five seems conservative. This year's format is specifically designed to prevent single dominant players from sweeping multiple events. Japan may not have an overwhelming individual like the United States, Canada, Brazil, or South Korea, but our *average* strength should put us in the top three, shouldn't it?\"\n\n*Here we go again.*\n\nDamian's expression soured. He recognized this pattern from past press conferences. The leading questions. The artificial controversy.\n\n\"Unless,\" the reporter continued with poorly concealed eagerness, \"you're suggesting South Korea will take third place?\"\n\nAnd there it was.\n\nThe journalists from right-wing outlets were manufacturing another South Korea conspiracy.\n\n\"Sigh.\"\n\nThe exhalation was audible, and the effect was immediate. Shocked silence rippled through the crowd. In Japanese society, where decorum was paramount, sighing openly during an official press conference bordered on scandalous.\n\nDamian didn't care.\n\n\"Even with this year's format explicitly designed to suppress South Korea's advantage, you're *still* obsessed with them?\" He let contempt color his voice. \"It's pathetic. Do you lie awake at night worrying about South Korea?\"\n\n\"What—\"\n\n\"How *dare* you—\"\n\nThe reporters erupted in outrage, faces flushing red. Damian could practically feel the right-wing internet exploding with condemnation in real-time.\n\nHe remained unmoved. His convictions didn't waver based on popular opinion.\n\n\"Let me address what you're really asking,\" Damian said, cutting through the noise. \"You want to know my assessment of Grid. Because Grid generates headlines. Grid generates clicks.\"\n\n\"...\"\n\nNot one reporter denied it.\n\n\"Two gold medals,\" Damian stated flatly.\n\n\"...?\"\n\n\"Due to the S.A. Group's restrictions, each player can only participate in two events. Therefore, Grid can only win two gold medals this year.\"\n\nThe framing was deliberate. Most players would struggle to secure even *one* gold medal. Damian was presenting two as a *limitation*.\n\nThe questions came immediately.\n\n\"But Grid has historically focused on PvP events! He won gold in PvP at the First National Competition, then lost to Kraugel in the second—\"\n\n\"This year, almost no one believes Grid can defeat Kraugel. Yet you're guaranteeing he'll win two gold medals?\"\n\n\"Which means—\"\n\n\"Grid will avoid the PvP event entirely?\"\n\nThe logic was sound. If Grid couldn't beat Kraugel in direct combat, the smart play was to compete in different events.\n\nDamian smiled.\n\n\"You misunderstand completely.\"\n\n\"...?\"\n\n\"Grid won't *avoid* Kraugel.\" Damian's smile widened. \"He'll *hunt* him.\"\n\n\"...??\"\n\n\"Grid will enter the exact same events as Kraugel. And he'll beat him in both. That's Grid's goal this year—I'd stake my reputation on it. Because that's the kind of person he is.\"\n\n\"...!!\"\n\n*Not running away despite last year's loss!* The reporters' fingers flew across their keyboards, racing to be first with the breaking story.\n\n**[Can Grid Reach the Sky Above the Sky This Time?]**\n\n**[Grid's Target: Kraugel!]**\n\n**[Japan's Pope Predicts Grid Will Challenge Kraugel Head-On!]**\n\nThe headlines spread like wildfire across international forums.\n\nAnd Grid, reading them from his office in Reinhardt, wanted to commit murder.\n\n\"That *idiot* Damian.\"\n\nGrid's original plan had been simple: avoid Kraugel's events, compete in the Blacksmith competition, and secure at least one guaranteed gold medal. Play it smart. Play it safe.\n\nNow, thanks to Damian's public declaration, that option had evaporated. If Grid avoided Kraugel after this, he'd be branded a coward across every server.\n\n\"That absolute *bastard*.\" Grid pressed his hands against his face. \"This is how he treats someone who helped him?\"\n\nThe ingratitude was staggering.\n\nAs usual, Grid's problems had multiplied exponentially through no fault of his own."
}