{
  "id": 735,
  "title": "Chapter 735",
  "content": "\"Has the old man finally lost his mind?\"\n\nFourth Prince Edan—son of Empress Marie—had once been an afterthought in the line of succession. Birth order aside, his reputation had paled against his siblings. But that was before Empress Aria's death. After Marie seized power, everything changed. Her faction rallied behind Edan with fervor, and in recent months, his position had grown to rival that of First Prince Roland himself.\n\nA man convinced he stood above heaven and earth.\n\nJean, his tutor, spoke carefully. \"Your Highness, I beg you—guard your tongue. If such words were overheard, it wouldn't be just your head at risk. Everyone who follows you would share the same fate.\"\n\n\"What's wrong with calling an old man old?\" Edan's lip curled. \"Tell me honestly, Teacher. Do you think the Emperor is sane?\"\n\n\"...\"\n\n\"Answer me. No? If His Majesty still had his wits, he wouldn't have crawled to the Overgeared Kingdom begging for peace. Isn't that right?\"\n\n\"His Majesty surely has deeper purposes—\"\n\n\"A single upstart kingdom without history or tradition, and he *trembles*. He's gone mad.\"\n\nJean fell silent. There was no point. He'd given up trying to teach this prince anything two years ago—which was precisely why Edan hadn't dismissed him yet.\n\n*Clang!*\n\nThe wine glass shattered against the wall. Knights rushed in, followed by maids who swept up the glittering shards with practiced efficiency. Edan clicked his tongue in disgust.\n\n\"That senile fool signed a truce with Valhalla. Do you understand what that means? It's delayed the magic machines' first deployment.\"\n\nMagic machines. Towering constructs powered by ancient alchemy and condensed magic, they moved like giants across the battlefield. The pilots sacrificed agility, true—but what they gained in exchange was overwhelming. Robustness. Destructive force beyond human comprehension. A single magic machine could level mountains, obliterate cities. Their combat power rivaled that of great demons.\n\nThe problem lay in control. Few possessed the talent to pilot them, and the magic power supply remained an unsolved riddle. Most dismissed them as mythological relics—ancient weapons too impractical for modern warfare.\n\nBut Edan saw what others couldn't. He'd invested time and fortune into the magic machines project. They were his path to the throne, his proof of vision. He needed only to demonstrate their worth.\n\nHe exhaled slowly and rose from his seat. \"Tell the riders they have leave.\"\n\n\"Yes, Your Highness.\"\n\n***\n\nIn Satisfy's early days, two legends stood above all others.\n\nNot God of War Ares. Not Overgeared King Grid, not first-ranked Chris, not Godly Archer Jishuka, not the Shadow King Faker. In those beginning days, those names meant nothing.\n\nThe legends everyone envied were Kraugel and Zibal—two players who'd rocketed to first and second place at speeds that left others in the dust.\n\nOf the two, Kraugel still reigned supreme as the sky above the sky...\n\n\"Beautiful morning.\"\n\nThe man standing on Titan's walls smiled as dawn broke over the capital of the Saharan Empire. This was Zibal—once second-ranked, once a hero who'd carried America's hopes during the Second National Competition.\n\n\"Hey! Zibal! You slacking off again?\"\n\n\"I'm sorry, sir!\"\n\nNow? A common soldier, anonymous and forgotten. The countless titles he'd once worn—Kraugel's only rival, leader of the Seven Guilds, god of raids—had vanished like morning mist. The public's memory was cruel, and they'd long since moved on.\n\n\"Did you confirm Raiders is properly maintained?\"\n\n\"Yes, sir! Absolutely!\"\n\n\"You're certain? When did you finish?\"\n\n\"Right after morning drills, sir!\"\n\n\"And your meal?\"\n\n\"I'll eat on patrol, sir!\"\n\n\"Tch. This brat. Don't let me catch you goofing off again.\"\n\nThe Imperial Army's 14th Division, 21st Battalion—a unit that officially didn't exist, stationed secretly on Titan's outskirts. The entire battalion numbered only eighty souls. More surprising: only four were combat operatives.\n\nZibal was one of those four. The lowest-ranked, bearing only a private's stripes—yet his uniform bore an unusual designation: *Chungik*. A special rank that granted him veto power over any order, save those from his direct superior. Even imperial commands could be refused.\n\nWhy would a former guild leader and noble of the Haken Kingdom serve as a common soldier in the Empire's army?\n\nBecause of his new hidden class.\n\n*Blue Sky Rider.*\n\n**You can ride and perfectly control all vehicles.**  \n**While mounted, your stats increase significantly.**\n\nA unique class, specialized entirely in mounted combat. At first, Zibal had been bitterly disappointed. Vehicles? In Satisfy, that meant horses. Maybe the occasional monster. He'd regretted the class change immediately.\n\nThen he'd received his class quest—and disappointment had ignited into revelation.\n\n**[Blue Sky Rider]**  \n**Class Quest:**  \n*Seek out Fourth Prince Edan of the Saharan Empire. Prove your worth and swear allegiance. In return, you will obtain the strongest vehicle in existence.*\n\nA magic machine. From a player's perspective, these were ancient weapons—things of myth, impossibly powerful and utterly inaccessible.\n\n*I never dreamed I'd become master of one.*\n\nRaiders—the fourth magic machine prototype—was built for aerial combat.\n\n\"Next year,\" Zibal murmured. \"Just wait until next year.\"\n\nParticipating in the upcoming Third National Competition would be pointless. Raiders was still low-level, bound by restrictions that would prevent him from demonstrating its true potential. Kraugel or Grid would crush him. But the Fourth Competition? That would be different.\n\n\"Grid... I'll show you what being Overgeared truly means.\"\n\nHe acknowledged Grid's skill now. Respected it, even. But Grid was the one who'd labeled him a punching bag, who'd ground his reputation into dust. Next year, Zibal would return that favor. He'd settle the score once and for all.\n\n\"Then I can finally move forward.\"\n\nTo become the sky above the sky. The determination carved into his features was absolute.\n\n***\n\n**To: All Third National Competition Participants**  \n**From: S.A. Group**\n\n*We understand many are disappointed by the reduction to two personal medals per participant. To address this concern, we're preparing a special supplementary event.*\n\n*If you wish to participate, please grant permission for personal information collection and usage.*\n\n*Please note: We cannot disclose the event's date or time in advance.*\n\n*- Event contents will be globally broadcast the moment it begins. This may infringe on some participants' privacy rights.*  \n*- We will guarantee all participants' safety.*  \n*- Compensation will be provided via Satisfy goods.*  \n*- Non-participation carries no penalties.*\n\n\"What the hell?\"\n\nFresh from his workout, Shin Youngwoo paused at the bathroom door, frowning at his phone.\n\n\"Why won't they say what the event actually *is*?\"\n\nWhat kind of half-assed announcement was this?\n\n\"Pass.\"\n\nIf he agreed to information collection, his phone would probably explode with spam. He was about to close the email when his phone rang.\n\nThe caller ID read: *Yura*.\n\nHis heart lurched. It'd been three months since they'd last spoken, and the thought of hearing her voice again—\n\n*Ahem.* Youngwoo cleared his throat and answered.\n\n\"Yeah?\"\n\n—which was precisely why he'd never had a girlfriend. Shin Youngwoo possessed absolutely zero social grace. If Yura had been any less patient, she'd have stopped calling him ages ago.\n\n*\"Did you get the event email?\"*\n\n\"...\"\n\nGod, her voice was sweet. His heart hammered as he answered, trying to keep his tone steady.\n\n\"Yeah.\"\n\n*\"Are you going to participate?\"*\n\n\"Wasn't planning on it?\"\n\n*\"I figured. But you should reconsider.\"*\n\n\"Why? Do you know what the event is?\"\n\n*\"No. But given S.A.'s intent, the rewards should be comparable to the reduced medals. Please participate.\"*\n\n\"Well... if you think so...\"\n\nYoungwoo didn't realize he was smiling—a blissful, idiotic expression. One of the world's most beautiful women was looking out for him, and his heart soared. He wanted to record the conversation, post it online. *This is me talking with Yura. Jealous?* He'd plaster it across every forum.\n\n*\"Okay, I'm hanging up—\"*\n\n\"Wait!\"\n\n*\"...Yes?\"*\n\n\"Are you entering the Competition this year too?\"\n\nYura had competed every year. In the First National Competition, she'd been South Korea's sole hope, their champion when no one else could stand. Surely she'd participate again.\n\n*\"Of course.\"* Her voice rose slightly. *\"Why do you think I got the same email? You only receive it if you've registered.\"*\n\nThe subtle edge in her tone went completely over Youngwoo's head. Even if he'd noticed, he wouldn't have understood why.\n\n\"Right, that makes sense. See you soon, then.\"\n\nHis voice practically vibrated with excitement. Getting to see Yura's face again after all this time—\n\n***\n\n\"This event is going to generate complaints.\"\n\n\"We already faced conspiracy theories when we reduced the gold medals to two per person. Now this...\"\n\nS.A. Group's headquarters. The board members voiced their concerns, and their worry was understandable.\n\n**[Battlefield]**  \n*All participants fight in an isolated arena with one goal: survival. At the start, everyone begins equal—same level, same stats, same equipment, same titles. A concept reminiscent of the battle royale games popular last century.*\n\nAn event that seemed specifically designed to target someone whose strength came from being Overgeared.\n\nDirector Yoon Sangmin smiled at the anxious executives.\n\n\"You're right. We'll face backlash. But Grid himself will be thrilled. He'll finally get his chance.\"\n\n\"Chance for what?\"\n\nThe executives looked confused. Yoon Sangmin's smile widened.\n\n\"Once Grid proves himself, those accusations will turn into cheers. Just watch.\""
}