{
  "id": 736,
  "title": "Chapter 736",
  "content": "**Chapter: The Rematch Looms**\n\nGrid's thoughts kept circling back to Kraugel's performance during the Belial raid. With the National Competition only days away, he couldn't help but calculate and recalculate the variables. After their last encounter—one year and three months ago—the score stood at one win apiece. This would be the tiebreaker. The decisive match.\n\n*At least a hundred and fifty level difference,* he reasoned, mentally reviewing Kraugel's progression curve. *Maybe more.*\n\nBut doubt crept in almost immediately. Kraugel's leveling speed defied conventional prediction. The gap might be narrower—perhaps under a hundred levels. Still, that hardly mattered. The critical threshold was level three hundred, and Kraugel couldn't have crossed it yet. No Third Awakening. No fundamental stat transformation.\n\nGrid's hands clenched involuntarily. Some might call it unfair to lean so heavily on a level advantage, but he dismissed the notion outright. Leveling was a skill like any other—proof of dedication, efficiency, talent. If he'd outpaced Kraugel, that was simply another victory to claim.\n\n*The level reset was harder on him, sure,* Grid admitted privately. *But I went through the same thing at level eighty. Different circumstances, same principle. If I've climbed higher since then, it means I'm stronger. Better.*\n\nThe mental gymnastics required for this conclusion would've made any objective observer wince, but Huroi—ever the loyal retainer—simply nodded along with an expression of solemn agreement.\n\n\"Your Majesty possesses unparalleled genius,\" Huroi declared. \"The coming battle will prove what we already know: you stand above all others. The world itself will kneel before your supremacy.\"\n\nGrid frowned slightly. \"Genghis Khan was Mongolian, though. I'm Korean.\"\n\n\"Does nationality matter in a globalized world? You rule an international kingdom, my lord.\"\n\n\"Hm. I suppose you're right.\" Grid's tension eased fractionally. \"You have surprising depth, Huroi.\"\n\n\"I live to serve!\"\n\nLauel, working quietly at his desk while the other two sat together, looked up with undisguised concern. One was crafting items. The other was apparently cramming for diplomatic certification exams. And both were engaging in what could only be described as aggressive delusion.\n\n\"Your Majesty,\" Lauel interjected carefully, \"overconfidence against Kraugel would be... unwise. Regardless of the level gap, his class is the Sword Saint. The ultimate combat specialization. Last year was difficult enough. This time will be worse. Please don't underestimate him.\"\n\nHe kept his tone measured and supportive—because he genuinely wanted Grid to succeed—but the tactical reality demanded acknowledgment. Kraugel wielded a sword that could theoretically cut through anything, even reality itself. Against such an opponent, Grid's reliance on superior gear might prove insufficient.\n\n\"Against the Sword Saint, Your Majesty's current fighting style—equipment-focused rather than technique-focused—may not be enough. Perhaps consider—\"\n\n\"Shut up.\"\n\nLauel blinked. \"I'm sorry?\"\n\n\"Are you trying to psych me out right now?\" Grid's eyes narrowed dangerously. \"You're on the American team with Kraugel, aren't you? Is this some kind of sabotage? Lower my morale so your teammate wins?\"\n\n\"What? No, I—\"\n\n\"Forget it. I should've known better than to trust someone competing for another country.\"\n\n\"Ah.\" Understanding dawned on Lauel's face—too late. Grid wasn't currently wearing the mantle of the Overgeared King. Right now, he was just Shin Youngwoo: competitive, insecure, and desperately seeking reassurance rather than tactical analysis. Huroi had recognized this immediately and adjusted accordingly.\n\n\"My lord!\" Huroi leaped to his feet with theatrical outrage. \"I will personally remove this traitor from your sight!\"\n\n\"Good. At least *you* understand loyalty. I'll upgrade your equipment as a reward.\"\n\n\"Future generations will sing of your generosity!\"\n\n\"Wait—I was joking earlier—! Huroi, listen, I—\"\n\nLauel's protests faded as Huroi bodily escorted him from the workshop. Watching them go, Grid felt a twinge of vindication. Perhaps it was petty. Perhaps it was immature.\n\nBut it felt good.\n\n---\n\nTime marched forward with relentless momentum. Three months had passed since the announcement, and now only three days remained until the National Competition.\n\nJohn F. Kennedy International Airport teemed with reporters, their camera flashes creating a strobe-light effect across the departure terminal. They'd come to capture the American representatives before their flight to Japan—elite players who served as national heroes, celebrities in their own right.\n\nBut one figure drew the majority of attention.\n\n\"Kraugel! How does it feel representing the United States?\"\n\n\"Any regrets about immigrating six months ago?\"\n\n\"Which events are you competing in?\"\n\n\"Is it true Grid is entering every event you've registered for? What do you think about that?\"\n\nThe questions came in a relentless barrage. While other representatives fielded one or two inquiries each, Kraugel faced ten simultaneously. A crowd of reporters—many of them young, attractive women—pressed close, drawn by his fame and striking appearance. Despite his Asian features, Kraugel had become something of a heartthrob in America.\n\n\"Way more attention than when Zibal was leading the team,\" one ranker muttered.\n\n\"Completely different tier of celebrity,\" another agreed.\n\nThe top US players had grown accustomed to recognition and admiration, but standing beside Kraugel reduced them to background extras. It was strange, being so thoroughly overshadowed—but not entirely unpleasant. Let him handle the media circus.\n\n\"I've adapted well to American life,\" Kraugel told the reporters smoothly. \"Everyone has been incredibly welcoming. It's an honor to compete for the United States in return.\"\n\nHe'd grown comfortable with public appearances since the previous National Competition, learning to navigate interviews with practiced ease. The key was saying things that made everyone feel good without committing to anything specific.\n\n\"As you know, I'll be competing in PvP,\" he continued. \"But I'd prefer to keep my second event a surprise until the opening ceremony. More dramatic that way. As for Grid...\"\n\nKraugel paused, turning to look directly into the nearest camera. His dark eyes—large and expressive—had an almost hypnotic quality. Several reporters visibly held their breath.\n\n\"I'm pleased,\" Kraugel said simply. \"I'm conscious of him too.\"\n\nThe statement was straightforward enough, but something about Kraugel's androgynous features and earnest delivery created an unexpectedly charged atmosphere. A few reporters exchanged glances, wondering if they'd just witnessed some kind of declaration.\n\n\"For the record,\" a new voice cut in, \"he's not gay.\"\n\nLauel arrived fashionably late, drawing instant recognition. As the Prime Minister of the Overgeared Kingdom—Grid's right hand—he commanded attention that rivaled even Kraugel's. Cameras swiveled toward him.\n\n\"Kraugel and King Grid are rivals and friends,\" Lauel continued with an easy smile. \"Competitors who respect each other. Please don't read anything else into it.\"\n\nHe'd successfully defused the odd tension while simultaneously advancing the Overgeared Kingdom's diplomatic interests. If Kraugel and Grid were friends, then by extension, the Sword Saint was friendly toward the Overgeared Kingdom. Antagonizing Grid meant antagonizing Kraugel. A useful association to plant in people's minds.\n\n*Two birds, one stone,* Lauel thought, maintaining his pleasant expression. *Perfect.*\n\n---\n\n\"This is the first-class lounge,\" the attendant explained.\n\n\"...Wow.\"\n\nShin Youngwoo had never experienced this particular luxury before. The first National Competition had been in South Korea—no international travel required. The second had involved Yura's private jet, which was luxurious in a different way. But this? This was his first encounter with a commercial airline's premium service.\n\nThe exclusive lounge stretched out like an indoor plaza, easily the size of a sports field. One section offered an elaborate buffet ranging from instant noodles to haute cuisine. Floor-to-ceiling windows provided a panoramic view of the airport. And the bathrooms—\n\n\"Are these... private?\"\n\nYoungwoo stood in a long corridor lined with individual facilities. Each one was a self-contained space with a sink, toilet, and urinal. Premium toiletries were provided: high-end toothpaste, professional-grade toothbrushes—far superior to anything he used at home.\n\nAfter a moment's hesitation, he pocketed one of the toothbrushes.\n\n\"Youngwoo?\"\n\nHe turned to find Kang Daehan (better known as Peak Sword) looking equally bewildered.\n\n\"I thought I was entering a bathroom, but it's like a hotel room. What even *are* these?\"\n\n\"...They're bathrooms.\"\n\nBoth men stood in confused silence. Neither had bothered reading the detailed information provided by S.A. Group, which had arranged first-class travel for all national representatives worldwide. They simply assumed they'd be flying economy—maybe business class at best. This level of extravagance was completely unexpected.\n\n\"I could live here,\" Daehan said reverently.\n\nYoungwoo grinned. \"Every day would be perfect. Beautiful flight attendants, unlimited food... If they installed capsule units, I'd never leave.\"\n\nThey collected plates of food and settled into plush chairs, laughing together like schoolboys on a field trip. The other Korean representatives watched with bemused expressions.\n\n*What's with their reactions?* the others wondered. *Shin Youngwoo and Kang Daehan are basically millionaires at this point. They could probably afford first-class travel monthly without blinking. Why are they acting like this is their first time seeing luxury?*\n\n\"Could you two try acting natural?\" an unexpected voice interrupted. \"Everyone knows you're loaded by now.\"\n\nYoungwoo froze mid-bite, his mouth full of braised pork. \"You—?\"\n\nEat Spicy Jokbal—formerly known as Dark, the leader of Blood Carnival—stood before him with an expression of mild amusement.\n\n\"What are you doing here?\" Youngwoo's entire body tensed. Was this some kind of real-world revenge plot?\n\n\"Relax,\" Daehan said quickly. \"He's a friend of mine. He'll be competing with us.\"\n\n\"*What?*\"\n\nThe Dungeon Maker—one of the highest-ranked players in the world, hidden from public awareness—had just joined the Korean national team."
}