{
  "id": 737,
  "title": "Chapter 737",
  "content": "\"After hearing your story, Grid, I became fascinated with Eat Spicy Jokbal and tracked him down. Believe me, it wasn't easy.\" Peak Sword's expression shifted as memories surfaced. \"I scoured the entire country, learning to recognize the taste of makguksu from every restaurant that served it...\"\n\n\"...\"\n\n\"I wanted to quit so many times.\" Peak Sword's face cycled through a dozen emotions. \"But I didn't. Why? Because I'm convinced the Overgeared Kingdom needs someone like Eat Spicy Jokbal.\"\n\n\"...\"\n\n\"And here's the result—we're friends now! Pretty impressive, right? Kuahahaha!\" Peak Sword threw his arm around Eat Spicy Jokbal's shoulders, grinning triumphantly. They certainly looked close.\n\nOne second passed.\n\n\"Get your hand off me.\" The temperature in the room dropped ten degrees. Eat Spicy Jokbal shrugged off the contact and fixed Youngwoo with a hard stare. \"Don't misunderstand. I'm fundamentally different from you people. We'll never be friends.\"\n\n\"Fundamentally?\"\n\n\"That's right. I'm here for one reason only—it's not patriotism, and it sure as hell isn't for the glory of South Korea.\"\n\n\"...\"\n\n\"I'm here for money. Cold, hard cash. I'm going to recoup what I lost from that dragon egg incident with gold medals.\"\n\n\"...I see.\"\n\nThe irony wasn't lost on Youngwoo. He wasn't here out of pure patriotism either—he had his own agenda. But Eat Spicy Jokbal had misread him. Most people did. From the outside, Shin Youngwoo looked like the perfect patriot.\n\nIt made sense. Objectively, participating in the National Competition was a strategic mistake for Grid. Every appearance revealed more of Pagma's Descendant's capabilities, eroding his competitive advantage. He could earn far more by staying home and crafting items. The gold medal rewards shouldn't even register as a consideration.\n\nYet he returned every year. People naturally assumed it was pure devotion to country.\n\n'Well, it's not like patriotism plays no part.'\n\nAs a veteran, he had the baseline pride in his homeland that military service instilled. Helping South Korea felt good. But honor drove him more than patriotism—the need to prove himself on a world stage, to be recognized as exceptional.\n\nBesides, the rewards this year were too valuable to ignore. Myth-rated materials weren't something money could buy. Materials he could request as custom compensation from the S.A. Group.\n\n'Last year, I only knew about adamantium.'\n\nThis year was different. Now he understood the full spectrum of myth-rated materials: sacred creature byproducts, the Goddess' Hair he'd witnessed firsthand. Resources that could transform his crafting entirely.\n\n'Two gold medals minimum.'\n\nHe needed Red Phoenix Breath or something equivalent. The thought of forging a second Enlightenment Sword—or even a third—made his pulse quicken.\n\n\"Whatever. Maybe we'll build some rapport eventually.\" Youngwoo extended his hand. \"Either way, good to meet you.\"\n\nEat Spicy Jokbal's declaration about \"recovering damages through fair competition\" actually reassured him. The man's approach was honest.\n\nA truly malicious person would've tried blackmail in real life, demanding cash compensation outside the game. At minimum, they'd harbor visible resentment. But Eat Spicy Jokbal's eyes held no malice—just competitive fire and wounded pride.\n\n'Peak Sword saw his character clearly.'\n\nYoungwoo smiled as genuinely as he could manage. Eat Spicy Jokbal accepted the handshake with obvious reluctance.\n\n\"Fine. We're temporary colleagues, so... huh?\"\n\nEat Spicy Jokbal's expression shifted the moment their hands met. Youngwoo's grip told a story—rough calluses, iron strength, a life built through manual labor.\n\n'He works hard in reality too?'\n\nAt thirty-six, Eat Spicy Jokbal had a decade on Youngwoo, who didn't look thirty yet. He'd expected the legendary blacksmith to be... softer in person. Awkward. Less substantial than his digital avatar.\n\nThe opposite proved true. From their first meeting, Youngwoo carried himself exactly as Grid did in Satisfy—confident, direct, radiating quiet authority.\n\nEat Spicy Jokbal swallowed hard.\n\n'Grid... this is just who he is.'\n\nOf course. Ordinary people didn't become kings, whether virtual or otherwise. The realization killed any lingering hostility.\n\nMeanwhile.\n\n\"Wait, your actual name isn't Eat Spicy Jokbal, right?\"\n\n\"Obviously it's my game ID.\"\n\n\"Still, Eat Spicy Jokbal? Really? Even for a game name, that's...\"\n\n\"...\"\n\nThe gathered representatives murmured amongst themselves. Eat Spicy Jokbal silently prayed for the S.A. Group to release ID change items soon.\n\n\"Oh my, the gang's all here.\"\n\nA man and woman approached the assembled Korean representatives. The woman wore traditional hanbok, refined and elegant, the type featured in tourism brochures. Thirties, carrying herself with natural grace. The man beside her was clearly mixed-race—Korean and Western—dressed in a riding jacket. The contrast between them was striking.\n\n\"Who...?\"\n\nNone of the representatives recognized the latecomers. Especially the woman—her behavior seemed deliberately peculiar.\n\n\"I'm Viola. I'll be representing South Korea this year.\"\n\n\"Ma Bongshik. Same here.\"\n\n\"Wait, those are your in-game IDs?\"\n\n\"Our real names.\"\n\n\"Ah... right.\"\n\n*Interesting names,* was the collective first impression.\n\n***\n\n\"Who exactly are they?\"\n\nEat Spicy Jokbal. Viola. Ma Bongshik.\n\nPeak Sword showed all three excessive attention and favor. He wouldn't lavish such treatment on nobodies, which meant these three carried weight. The problem was their anonymity—none of the other representatives could place them.\n\n\"I've never heard of any of them.\"\n\nRepresentatives from the same country weren't required to share intelligence. The game continued after the competition ended. Mandatory information disclosure would've decimated ranker participation.\n\n\"Honestly, Grid's the real story here.\"\n\n\"Right? He actually looks better in person.\"\n\n\"Check out his back. Even as a guy, I'm jealous.\"\n\nAttention inevitably shifted to Grid. He didn't realize it, but over half of South Korea's thirty representatives admired him deeply. They'd grown up watching Grid, dreaming of matching him—especially after last year's legendary clash with Kraugel. For this generation of players, Grid represented the pinnacle. They desperately wanted to connect with him during the competition, but approaching such a towering figure felt impossible.\n\n*I'll perform spectacularly this year.*\n\n*If I catch Grid's attention, maybe I can join Overgeared Guild... wait.*\n\nSuddenly, every enthusiastic representative's thoughts blanked simultaneously.\n\nThe last Korean representative entered the lounge.\n\n\"Sorry I'm late.\"\n\n\"...\"\n\n*Was the world always this monochrome?*\n\nThe representatives stared, transfixed, as Yura apologized in a voice like honey over silk. Her overwhelming beauty drained color from everything else in the room.\n\n\"I-It's been a while.\"\n\nEven Youngwoo stumbled over the words. His heart hammered as he took in Yura after their long separation.\n\n*Her skin's practically luminous... Has she been taking care of herself?*\n\nSomething about Yura's porcelain complexion unsettled him. She tilted her head, puzzled.\n\n\"Is something on my face?\"\n\n\"N-No. You've gotten even prettier since... god, what am I saying?\" Youngwoo slapped a hand over his mouth the instant he realized what he'd blurted out.\n\nYura...\n\n\"...\"\n\nColor flooded her milky skin—a crimson blush spreading from neck to hairline. The Korean representatives watched, entranced.\n\n*Youth. The absolute prime of life.*\n\n*God, I'm jealous...*\n\n***\n\nFifty nations were competing in the 3rd National Competition. The expanded scale had gamers worldwide buzzing with anticipation. What spectacular moments would this year produce? Millions counted down the days.\n\nPerhaps sensing that collective hunger...\n\n『 **A special pre-competition event will now commence.** 』\n\nRepresentatives from every nation boarded their flights. Broadcasting networks across the globe launched simultaneous live coverage—content produced by the S.A. Group itself. The host was Orlando, world-famous pop star and a ranker in Satisfy's top 100,000.\n\n『 At this moment, 1,500 representatives from every participating nation have completed boarding for Japan. The S.A. Group has prepared something special for all of them. 』\n\n\"An event?\"\n\nThe broadcast launched without warning, but the National Competition connection made it irresistible. Word spread like wildfire. Viewers flooded in by the millions. MC Orlando maintained his enthusiastic smile as he explained.\n\n『 Instead of seats, every player on those flights will find a capsule. These capsules grant access to a server called 'Battlefield.' 』\n\n\"Battlefield?\"\n\n『 A secret server Satisfy has borrowed specifically for this. Starting now, 1,500 players from around the world will enter a designated arena where everything is equalized—same level, same stats, same equipment, same skills. Complete parity. 』\n\n\"...?\"\n\n『 They'll fight until only three survivors remain. 』\n\n\"What?\"\n\n\"A pure survival game with no advantages?\"\n\n\"The S.A. Group isn't even subtle anymore. This is obviously targeting Grid.\"\n\n\"Wow, that's brutal.\"\n\nKorean viewers erupted with criticism once the event's nature became clear. International audiences, however, loved it.\n\n\"This is fascinating. Who's genuinely the most skilled when everything's stripped away?\"\n\n\"Kraugel, obviously.\"\n\n\"Maybe someone we don't know will surprise everyone and beat even Kraugel.\"\n\nGrid's name never appeared among the predicted winners. Without his items, victory seemed impossible."
}