{
  "id": 738,
  "title": "Chapter 738",
  "content": "**[You will now be connected to Battlefield.]**\n\nThe announcement came the moment every representative boarded their plane. \n\nAll fifteen hundred participants in this year's National Competition had been waiting for this—a special event, details classified, rewards undisclosed. Now, finally, they were about to learn what they'd signed up for.\n\nThe host's voice filled their capsules.\n\n\"Battlefield is a mini-map, approximately ten thousand pyeong. Not large enough for fifteen hundred people to spread out comfortably, but the terrain is varied enough for tactical play. Your objective is simple: survive. Only three of you will walk away from this.\"\n\nA ripple of discontent spread through the representatives.\n\nViola leaned forward in her capsule. \"This is going to turn into a show for the top rankers. How is that fair?\"\n\nMa Bongshik nodded. \"Limited space means higher specs win. This is just an arena for the elites.\"\n\nMurmurs of agreement echoed from other representatives. All eyes drifted to Grid—everyone wondering how the legendary blacksmith would react to what seemed like a rigged game.\n\nBut Grid sat perfectly still, face calm, listening without a flicker of emotion.\n\n*His composure is incredible...*\n\n*That's God Grid for you. I'd be losing my mind right now.*\n\nThe Korean representatives exchanged impressed glances. Even Eat Spicy Jokbal found himself admiring Grid's restraint.\n\nIf only they knew the truth.\n\n*Fuck. Am I really the only one petty enough to be pissed about this?*\n\nGrid's thoughts were far less noble than his expression suggested. He was furious—he just knew better than to waste his breath complaining when nothing would change.\n\nThe host continued, oblivious.\n\n\"Before you assume this favors the strongest, let me clarify: Battlefield operates on a completely separate server from Satisfy. Your account data won't transfer. Everyone starts fresh. Same stats. Same empty hands. This is as fair as it gets.\"\n\n*...*\n\nNow Grid's composure cracked. Just slightly. A twitch at the corner of his mouth.\n\nThe host pressed on, laying out the rules in rapid succession:\n\n\"You'll have ten minutes after connection to choose your class. Four options, all with identical base stats but different mechanics. Choose wisely—if the timer runs out, the system picks for you.\"\n\nThe detailed rules followed:\n\n**Rule 1:** All participants would be masked. No IDs, no faces, voices modulated. To prevent team-ups. Viewers would see the IDs, but players wouldn't know who they were fighting.\n\n**Rule 2:** Everyone started barehanded. Weapons scattered throughout the map. First to arm themselves gained the advantage.\n\n**Rule 3:** Three-hour time limit. After one hour, the map would begin to shrink. Anyone caught in the collapsing zones would be eliminated. Watch for the warnings.\n\n**Rule 4:** Survival was victory. Killing wasn't mandatory—hiding was a valid strategy. Until the final ten minutes, when the map would be too small to hide. Then, everyone fought.\n\n**Rule 5:** No natural recovery for health or mana. Potions only. Health potions restored 7 points. Mana potions restored 6. Supply drops every five minutes. Maximum capacity: two of each type.\n\n\"It's a separate system, so there's a learning curve,\" the host concluded. \"But if you're top rankers among two billion users, adaptation shouldn't be a problem.\"\n\n*Shouldn't be a problem?* \n\nGrid's eye twitched. \n\n*Shouldn't you at least give us a manual or something?*\n\nWhile the other representatives nodded confidently, Grid sat there in mild panic.\n\n**[You will now access Battlefield.]**\n\nThe capsule hummed to life.\n\n***\n\n**[Connected to Battlefield.]**\n\n**[Character automatically created.]**\n\n**[Please select a class.]**\n\nThe selection window materialized before Grid's eyes. Four options, each with identical base stats but wildly different mechanics.\n\n**[Warrior]**  \nHealth: 20/20 | Mana: 15/15  \nAttack Speed: 1 | Movement Speed: 2\n\nFists deal 1 damage. Equipped weapons deal 2 damage (bows deal 1 damage, range 10 meters, consume arrows). Can equip shields (reduce damage by 50% when blocking).\n\n**[Magician]**  \nHealth: 20/20 | Mana: 15/15  \nAttack Speed: 1 | Movement Speed: 2\n\nFists deal no damage. Equipped weapons (except bows) deal 1 damage. Magic wands deal 3 damage with ranged attacks (10 meters, 7 mana per attack).\n\n**[Cleric]**  \nHealth: 20/20 | Mana: 15/15  \nAttack Speed: 1 | Movement Speed: 2\n\nFists deal no damage. Equipped weapons (except bows) deal 1 damage. Can read scriptures scattered across the map to restore 10 health (costs 2 mana).\n\n**[Producer]**  \nHealth: 20/20 | Mana: 15/15  \nAttack Speed: 1 | Movement Speed: 2\n\nFists deal no damage. Equipped weapons deal 1 damage. Starts with a pickaxe (not a weapon). Gather resources (clay, wood, metal). Craft items (15 minutes per item, can move while crafting, costs 10 mana). Crafted items deal 2 damage when wielded by the creator, including bows.\n\nAll fifteen hundred participants stared at the same selection window. \n\nMillions of viewers around the world watched their screens, analyzing the options.\n\n\"Magician's broken if you find a wand. Three damage per hit? That's a scam.\"\n\n\"Producer could dominate the late game if they survive long enough to craft a bow. Two damage from stealth? Deadly.\"\n\n\"Warriors seem strongest early. Reliable damage, can use shields... solid all-around.\"\n\n\"Clerics are trash. Too dependent on finding scriptures. Pure RNG.\"\n\nThe debate raged across forums and viewing parties.\n\nMost analysts agreed: rankers wouldn't pick warrior. Too straightforward. They'd gamble on magician or producer—high risk, high reward. That was the ranker mindset.\n\n\"Grid's definitely going producer, right? He's a legendary blacksmith.\"\n\n\"Has to be. Playing to his strengths.\"\n\nThe viewers' engagement peaked as the ten-minute timer ticked down.\n\n*Click. Click-click-click-click.*\n\nAll fifteen hundred participants locked in their choices. \n\nThe map loaded.\n\nThey spawned at intervals across the terrain, each one alone.\n\n\"Where's Kraugel?\"\n\n\"Find Yura!\"\n\nViewers scrambled to locate the favorites. The camera feeds jumped from competitor to competitor, IDs flashing on screen.\n\nThen someone spotted Grid's feed.\n\n**[Grid]**  \n**Class: Cleric**\n\nThe forums exploded.\n\n\"WHAT?\"\n\n\"Did he... did he seriously pick Cleric?\"\n\nThe most analyzed class. The weakest option. The one that everyone agreed was pure luck. \n\nAnd Grid—legendary blacksmith, expected to choose Producer or maybe Warrior—had picked Cleric.\n\n『 Incredible! Grid has chosen Cleric! Completely against all predictions! 』\n\n『 The worst class in terms of reliability! This is shocking! 』\n\nThe casters scrambled for explanations. Clerics had zero combat presence without scriptures. The scriptures were scattered randomly. Finding them was a gamble. This was the class for people who had no faith in their own skills—people who'd rather roll the dice than trust their ability.\n\nAnd Grid chose it.\n\n『 It seems Grid lacks confidence in his pure mechanics. He's gambling on luck to survive as long as possible. 』\n\nThe conclusion seemed obvious.\n\nThe internet erupted.\n\n*- Look at Grid lmaooo. High level means nothing if you can't play*\n\n*- The moment he lost his items, it was over*\n\n*- This proves it. Grid's control is garbage. He just has OP items*\n\n*- His items probably have auto-mastery boosts or something*\n\n*- Oh for fuck's sake, here we go again with the Grid hate. You people never learn*\n\n*- Grid is DIFFERENT. He has a plan. There's a reason he picked Cleric. Trust the process*\n\nThe debate consumed every forum, every chat, every viewing party across the globe.\n\nMeanwhile, Grid's eyes gleamed as he scanned his mini-map.\n\n\"Just as I thought,\" he murmured. \"Cleric isn't about luck at all.\"\n\nDozens of shrine locations glowed on his mini-map, plain as day."
}