{
  "id": 739,
  "title": "Chapter 739",
  "content": "# Chapter: The Cleric's Gambit\n\n\"Why do they always hit me from behind?\"\n\nGrid's relationship with the S.A. Group was... complicated. He owed them everything—Satisfy had given him success, bonds, and a life worth living. Yet despite this debt, he couldn't shake a bone-deep mistrust of the corporation. Too many coincidences. Too many \"balanced\" patches targeting him specifically. Every National Competition felt like a personal attack wrapped in the guise of game design.\n\nSo while the other representatives chattered about strategy and team composition, Grid did what he did best: he looked for the trap.\n\nHis eyes scanned the class selection window, noting the restrictions. Limited potions. Fixed stats. Equal starting conditions. The S.A. Group had stripped away every advantage, forcing pure skill to the forefront. Most players would see this as fair.\n\nGrid knew better.\n\n'Two potions maximum. No natural healing. Everyone starts with twenty health...'\n\nThen he saw it. The detail buried in the Cleric class description.\n\n'Scriptures scattered across the map. No limit on how many you can carry.'\n\nThe other classes looked stronger on paper. Warriors hit harder. Magicians had range. Producers could craft advantages. Clerics? They seemed like walking punching bags—one damage per hit, no burst potential, entirely dependent on finding enough scriptures to stay alive.\n\nBut Grid's mind was already racing through the math. A Cleric dealt one damage. Against a Magician with a wand dealing three damage per hit, the Cleric would die in seven strikes. The Magician would need nineteen. A seemingly hopeless matchup.\n\nUnless the Cleric had scriptures. Each scripture restored ten health. With enough healing, the math inverted entirely. The slow, steady Cleric would outlast the Magician's mana. Victory through attrition.\n\n'Of course, that only works if I can actually *find* enough scriptures.'\n\nGrid studied the class description again. *Scriptures can be found throughout the map.* Not \"rarely found.\" Not \"difficult to obtain.\" Just... throughout the map. The phrasing was almost suspiciously vague.\n\nAnd there were fifteen hundred delegates. How many would choose the high-risk, low-reward Cleric class? Fifty? A hundred at most? The competition for scriptures would be minimal.\n\n'This is exactly the kind of trap the S.A. Group would set.'\n\nThey'd made the strongest class *look* like the weakest. Typical.\n\nGrid selected Cleric without hesitation.\n\n---\n\nThe moment Battlefield loaded, Grid was moving. He jumped, threw punches, tested his sprint speed—cataloging his capabilities like a craftsman examining new tools. The analysis took seconds.\n\n'Baseline stats. Equivalent to a level ten character.'\n\nOne attack per second. Movement speed slightly faster. His vision could track a single blow if he concentrated. With focus, he might dodge one attack in three.\n\n'Which means everyone else can do the same.'\n\nThe realization sent a spike of anxiety through his chest. Control. This entire event would come down to control. And Grid knew his own limitations better than anyone—he'd spent years watching Kraugel, watching Yura, watching peak-level players who could dance through attacks he could barely track.\n\n'They'll all pick Magician. Maximum damage, ranged advantage. That's what skilled players do.'\n\nHis throat felt dry. A MISS chance meant even scriptures might not save him.\n\nThen he stopped himself. Took a breath. During his years in Satisfy, he'd learned one crucial lesson: panic kills faster than any sword. He'd faced dragons, demons, and entire armies. He could handle a battle royale.\n\n'I've got experience. I've got scriptures. I can win.'\n\nThe nearest shrine pulsed on his mini-map. Grid headed straight for it.\n\n---\n\nEvery shrine was a powder keg.\n\nOver a hundred players crouched in the surrounding terrain, watching the entrances with predatory patience. Some wanted scriptures. Others wanted to eliminate Clerics early. A few simply waited to ambush whoever moved first. The standoff had frozen everyone in place.\n\nThen Grid arrived.\n\n\"Oh! Door's still closed—nobody's gone in yet? Lucky me!\"\n\nHe didn't slow. Didn't scan the area. Just strode up to the shrine entrance like he owned it.\n\nThe hidden players gaped.\n\n'Is he insane?'\n\n'Has to be a trick...'\n\nBut Grid was already pushing open the ancient door. He'd done the math: acquiring a bow took time, arrows were consumables, and firing a shot would paint a target on your back for every player nearby. The shrine was the safest place on the map right now.\n\nThe door creaked shut behind him.\n\nInside, Grid's eyes adjusted to the dim light. Stone walls. Dusty air. And there, in the corner—exactly what he'd come for.\n\nA scripture. And beside it, a bow.\n\nHe grabbed both without ceremony.\n\n**[Scripture acquired.]**  \n**[Bow acquired.]**\n\nGrid allowed himself a smile. The S.A. Group's \"trap\" was playing out exactly as he'd predicted. Now to—\n\n\"Wait.\"\n\nA woman stepped through the shrine entrance, blade drawn. The sword glinted in the filtered light as she leveled it at his chest.\n\n\"Give me the scripture. Or die.\"\n\nGrid's smile didn't falter. Outside, the sounds of combat erupted—the standoff had finally broken. He had seconds to resolve this.\n\n\"No scripture here. Just this bow.\" He pulled the weapon from his inventory, holding it up. \"See?\"\n\n\"Liar.\" But there was uncertainty in her voice.\n\n\"Think about it. The bow's the real prize—ranged attacks from ten meters out. Way more valuable than a sword right now.\" He kept his tone casual, reasonable. Like he was offering a fair trade instead of spinning a desperate lie. \"Tell you what—take the bow. I'll keep the sword. We both walk away.\"\n\nThe woman hesitated. Her mask hid her expression, but her grip on the sword shifted. \"Why would you trade down?\"\n\n\"Because I don't want to waste time fighting when people are killing each other outside.\" Grid met her eyes steadily. \"Your call. The bow for your sword, or we settle this the hard way.\"\n\n\"The bow needs arrows. You don't have another weapon, so—\"\n\n\"Then let's fight.\" Grid dropped the bow back in his inventory and raised his fists. \"You're a Cleric or Magician, right? That sword hits for the same damage as my bare hands. We can make this ugly if you want.\"\n\nThe woman flinched.\n\n'He's a *Warrior?* Not a Cleric?'\n\nHer logic crumbled. She'd assumed anyone entering a shrine was hunting scriptures. But if he was a Warrior class...\n\n\"I... I'll just let you go. Keep the bow.\"\n\n\"Appreciate it.\"\n\nGrid walked past her without looking back. The moment he cleared the shrine, chaos erupted around him—players locked in desperate combat, resources already growing scarce. None of them could break away to pursue him.\n\nHe sprinted for the treeline and didn't stop until he'd found a sturdy oak with dense branches. Only then, perched safely in the canopy, did Grid let out the breath he'd been holding.\n\n\"Damn. That was close.\"\n\n---\n\n『Incredible presence of mind,』 one commentator breathed. 『He read the entire situation and turned a disadvantage into victory through pure nerve.』\n\n『This is what separates legends from ordinary players,』 another agreed. 『Title or no title, stats or no stats—Grid fights with something you can't quantify.』\n\nAcross the world, viewer appreciation for the Overgeared King climbed steadily higher.\n\nAnd in Battlefield, the participant count continued its rapid decline."
}