{
  "id": 740,
  "title": "Chapter 740",
  "content": "Strategies diverged from the first moment. Some hunted for weapons. Others sought shelter. A few went straight for kills. The cycle repeated endlessly—hide, seek, strike, loot. With no safe zones, fifteen hundred minds clashed across the terrain. Twenty minutes in, only nine hundred remained.\n\nGrid checked the survivor count displayed at the edge of his vision and grimaced.\n\n'I thought 100,000 pyeong would feel massive.'\n\nIn truth, it should have. The space rivaled half a provincial town, complete with hills, valleys, structures, and forests. When he'd first logged in, Grid had figured most players would still be searching for each other when the three-hour timer expired.\n\nHe'd been wrong.\n\nWith fifteen hundred players hunting, hiding, and fighting, 100,000 pyeong felt cramped. Grid studied the mini-map, plotting his next move.\n\n'I'll skip the nearest shrine.'\n\nThe closest one sat only 110 meters away—practically next door to the shrine where he'd grabbed the scripture. Too close. Too obvious.\n\n'Anyone who watched that entrance will head to the next nearest location and try the same ambush.'\n\nA bloodbath was probably unfolding there right now. Grid had no interest in throwing himself into that meat grinder.\n\n'What about going underground?'\n\nBattlefield included an extensive tunnel network. Entrances dotted the map, easy to access. The mini-map didn't reveal the underground layout in detail, which offered a tactical advantage. On paper, the tunnels seemed like the safest option.\n\n'Which means everyone else thought the same thing.'\n\nThe underground would be packed with players tearing each other apart in the dark.\n\nHe glanced down at his empty hands and frowned.\n\n'Speaking of which...'\n\nHe needed a weapon. Basic survival equipment. Grid stayed above ground and scanned his surroundings, eyes catching on thick undergrowth in the forest. Weapons were fairly common if you knew where to look.\n\n\"A mace.\"\n\nHe pulled it free from a tangle of thorny vines and gave it a few test swings. The blunt weight felt... ordinary. No different from swinging a standard sword. Every weapon in Battlefield followed the same formula—except bows and magic wands.\n\n'But there are subtle differences.'\n\nHe noted the mace's length: fifty centimeters. Much shorter than the average sword—shorter even than the blade that masked woman in the shrine had been wielding.\n\n'Doesn't feel right.'\n\nAs Pagma's Descendant, Grid had wielded every weapon type imaginable. But his favorites remained greatswords and longswords. Blunt weapons didn't benefit from Pagma's Descendant's corrective effects, which left them feeling awkward in his grip.\n\n'Better find a sword.'\n\nScriptures weren't exclusive to shrines. They could appear anywhere—like this mace hidden in the vines. Grid relaxed slightly, reassured by that knowledge. No need to fixate on shrines when flexibility served him better.\n\n'Hm?'\n\nHow perfect would it be to find both a sword and a scripture? Grid moved through the forest with renewed purpose, pushing through dense bushes—and froze.\n\nAn old cabin. Narrow, cramped. Barely enough room for one person.\n\n'Could there be items inside?'\n\nEverything indicated that specific buildings contained tools and equipment.\n\nSo...\n\n'I'm not going in there.'\n\nSomeone was already inside. Had to be. The setup was too obvious: hide the tools, wait for a greedy fool to walk through the door, then ambush them. Grid melted back into the bushes and studied the cabin's structure.\n\n'Windows on every side. Can't approach without being seen. I'll wait for someone else to show up first.'\n\nEventually some idiot blinded by greed would stumble onto the cabin without thinking it through. Then the hidden player would strike, and they'd tear into each other.\n\n'I'll watch quietly and clean up afterward.'\n\nThe ideal scenario—let the mindless competitors eliminate each other, then walk in and claim the spoils! Grid's grin was predatory. Nothing better in life than free loot. But his smile faltered.\n\n'Then again, how many idiots would actually walk up to an obvious trap like this... Better to just move on... Wait.'\n\nHe started to leave, accepting that no reward was worth the obvious danger. But then—\n\nFootsteps.\n\n\"...!\"\n\nGrid flattened himself against the ground. A man approached the cabin. Grid clamped a hand over his mouth to muffle his breathing, watching with growing anticipation.\n\n'There actually is someone stupid enough!'\n\nLike watching his past self. Grid felt a strange sense of growth as the man reached the cabin door. But what happened next shattered his expectations.\n\n*CRASH!*\n\n\"Hyah!\"\n\nThe door swung open. The woman hiding inside slashed her sword in a textbook ambush—perfect timing, perfect angle.\n\nWhich made it predictable.\n\n*THUD!*\n\nThe man slammed the door shut again, using it as a shield. The woman's blade, which should have pierced his chest, instead bit deep into the wooden door. The man confirmed the blade was stuck—then yanked the door open.\n\n\"Kyaaak!\"\n\nThe woman stumbled out, still gripping her trapped sword. The man's spear flashed.\n\n*THUNK!*\n\nA perfect heart strike. In Battlefield, damage was fixed—but in Satisfy, that blow would have guaranteed a critical hit. Flawless reaction speed. Environmental awareness. Masterful spear technique. Grid watched from the bushes, conviction hardening in his gut.\n\n'High ranker...!'\n\nThis man wasn't stupid at all. He'd known someone was hiding in that cabin and approached anyway, confident he could overwhelm whoever was waiting. \n\nAnd Grid? He was a high ranker too. So why—\n\n'Why don't I have that kind of confidence?'\n\nHis eyes trembled as he watched the unknown player dismantle his opponent through pure skill. Something stirred in his chest—the blood of the Overgeared King who'd fought empires and vampires awakening once more.\n\n***\n\n『Truly a genius of combat...! What tremendous skill!!』\n\nAcross Battlefield, one-sided massacres played out on screen after screen. All fifteen hundred players had started equal, but strategy and mechanical skill created vast gulfs between them. In identical circumstances, one player would breeze through a crisis while another drowned in it.\n\nSome lost fights despite having better weapons. Most victors were high rankers—giants who'd ruled Satisfy through raw skill alone. Their talent was on full display in Battlefield. And among them, one stood above the rest.\n\nHao.\n\nChina's number one ranker, the Miracle of the Continent—his combat prowess was breathtaking. Perhaps conscious of rivals like Kraugel, he'd chosen Magician over Warrior for its higher potential. Then he proceeded to demolish every opponent with nothing but an old spear that dealt one damage. With identical stats and vision to everyone else, his ability to control fights bordered on supernatural.\n\n\"Kyaaak!\"\n\nThe Japanese woman in the cabin, despite holding the advantageous position, fell in seconds. Hao's use of the door itself to neutralize her attack revealed why he was considered a master of combat. His skill transcended ordinary comprehension.\n\n—Hao is one of the players closest to Kraugel's level... The Chinese weren't exaggerating.\n\n—Agreed. If Hao had Kraugel's leveling speed, it wouldn't even be a contest.\n\n—If it hadn't been Grid vs Kraugel at last year's National Competition, it would've been Hao vs Kraugel.\n\nThose watching Hao's true talent felt certain he'd be among Battlefield's last survivors.\n\nAs for Grid, hiding in those bushes and witnessing the one-sided slaughter?\n\nHis performance so far had been surprising—but pale compared to Hao's.\n\n—How long is Grid planning to hide there...?\n\n—He'll wait until Hao leaves.\n\n—The participants don't know each other's identities, but Grid just watched Hao's skill firsthand. He knows that guy isn't ordinary.\n\n—The chance of Grid taking a risk to fight him is basically zero.\n\n—Seems cowardly, but it's smart.\n\n—Exactly. Grid is playing well within his limitations.\n\nIn Battlefield, where personal items couldn't be used, Grid was naturally perceived as weaker. He was known as the Overgeared King—someone who relied on equipment. He seemed aware he couldn't match other high rankers in pure talent. In fact, Grid had been avoiding combat as much as possible.\n\nMeek compared to his reputation. But no one blamed him. They appreciated his self-awareness and strategic play. No one thought less of him for it.\n\n『Ah! The moment I finish speaking, Hao eliminates Satsuki!』\n\n『Truly admirable. He only took two damage the entire fight.』\n\n『In other words, he landed twenty hits while only getting hit once. I still don't understand how high rankers achieve that level of control... As an ordinary player, I can't even imagine it.』\n\n『Scenes like this fuel the theory that specific DNA exists for virtual reality talent... Huh? W-What's this?』\n\n『Wait, what kind of courage is this?』\n\nThe commentators had been praising Hao when they suddenly froze. A man who'd been hiding throughout the entire fight—Overgeared King Grid—jumped up and stepped directly in front of Hao.\n\n—What?\n\n—Does he want to fight Hao?\n\n—Grid's shown some excellent plays already. Maybe he's trying to prove his talent again by facing Hao?\n\nExpectation rippled through the audience.\n\n\"Pon? Regas? Perhaps Kraugel?\" Grid held up his blunt weapon and pointed it at Hao. \"I don't know who you are.\"\n\nHis mask couldn't hide the intensity in his eyes.\n\n\"Let's fight. I'm curious—what level am I at now?\"\n\nHao met Grid's gaze and instinctively sensed it. This opponent was a predator like himself.\n\n\"I'd prefer to win...\" Hao smiled bitterly. Then he exhaled and dropped into a fighting stance. \"But I can't avoid a fight when you've asked so boldly.\""
}