{
  "id": 741,
  "title": "Chapter 741",
  "content": "*This body is a cage.*\n\nHao wasn't just a high ranker—he was a martial artist first. In the real world, he'd pushed his body to the absolute limits of human capability. Both in Satisfy and reality, he possessed a transcendent physique honed by decades of discipline. Now, shackled by Battlefield's constraints, he felt crippled.\n\nThe Level 10 vessel they'd granted him was sluggish. Weak. His mind raced ahead while his limbs lagged behind, every movement fighting through invisible weights. Worse—he hadn't even sensed the man watching him. The realization stung his pride.\n\n*But this is equal ground.* \n\nEveryone suffered the same limitations. No one held an advantage. Hao studied his opponent, analyzing the blunt weapon in the man's grip. Not Kraugel—that would be absurd. The Sky Above the Sky wouldn't claim he needed to \"test his abilities.\"\n\nDamian? Vantner? Toban? The list of blunt-weapon specialists ran through his mind. *Damian makes the most sense.* The others ranked too far below him. They'd never dare challenge him directly. But Damian—one of the few who'd matched Grid in the previous National Competition—that made sense. That was competition Hao respected.\n\n*In Satisfy, his Pope skills are overwhelming. Here? I'm superior.*\n\nBattlefield stripped away fraudulent class advantages. Pure skill decided everything.\n\n**Supak!**\n\nHao thrust straight ahead—basic spear technique, nothing fancy. Twenty years of sword training had given him formidable spear skills too, enhanced by Weapons Mastery. He could execute complex techniques, but not in this body. Complex movements would only expose openings. Better to rely on fundamentals: familiar, efficient, devastating.\n\n**Puok!**\n\nThe spear punched through his opponent's chest. Perfect. Grid's recognition came too late—by the time his eyes registered the attack, the point had already found flesh.\n\n*Now!* \n\nHao yanked back to deliver rapid follow-up strikes—but the spear stuck. Grid surged forward the instant Hao tried to withdraw, closing the distance before Hao could react. Suddenly Grid's weapon became a threat.\n\n**Peng!**\n\nThe blunt weapon whistled past Hao's temple, close enough to make his ears ring. Hao's teeth clenched in frustration. *Normally that first strike would've been fatal. But I can only deal fixed damage here—he doesn't even hesitate.*\n\n**Puuok!**\n\nHao created space and stabbed again. Grid charged right into it, eating another hit to close distance.\n\n**Peng!**\n\nAnother near miss. Hao twisted away, rotating his hips to reset his stance and—\n\n**Pakak!**\n\n—drove the spear through Grid's forearm. Three hits landed in rapid succession.\n\n*Too weak. Vantner? Toban?*\n\nNot Damian. Someone below his level.\n\nThe crowd groaned.\n\n—*Three hits to zero. This is over.*\n\n—*What was Grid thinking?*\n\n—*Fool's courage.*\n\n—*This is embarrassing.*\n\nThe verdict seemed clear: Grid's delusion had led him to slaughter. Overconfidence meeting reality. Another lesson learned the hard way.\n\nThen—\n\n**Cheook!**\n\nHao's spear found Grid's forearm again. As Hao retreated to reclaim range, Grid moved. Left, then right. The footwork was too deliberate for simple evasion. Almost like... dancing.\n\nHao's eyes widened.\n\n—*Wait. Those movements...*\n\n—*Is that...?*\n\nSomething familiar flickered at the edge of recognition.\n\n**Peng!**\n\nGrid's weapon connected.\n\n**Peeng!**\n\nAgain.\n\n**Kwajak!**\n\nAnd again.\n\nSuddenly Hao was the one getting hit while Grid slipped through every thrust like smoke. Those side-to-side movements, that pattern—Link. The footwork of Pagma's Swordsmanship, executed perfectly despite the Level 10 body.\n\n\"Grid...!\" Hao's voice came out strangled.\n\n\"Works best when the body knows it by heart. Wouldn't you agree?\"\n\nGrid had studied Hao's basic patterns and countered with his own: the sword dances practiced ten thousand times until they became instinct. Other skills required mere activation words. But Pagma's Swordsmanship demanded *process*—each movement earned through repetition until muscle memory transcended conscious thought.\n\nSatisfy and Battlefield—different games, same foundation. Years of accumulated experience crystallized into pure weapon mastery.\n\n\"Pagma's Swordsmanship.\"\n\nGrid moved again, footwork refined by hundreds of thousands of repetitions. The approach wasn't linear—he advanced while evading, creating angles that made Hao instinctively retreat. For once, Hao's exceptional perception worked against him. He saw too clearly what Grid intended.\n\n\"Kill!\"\n\n**Peeng!**\n\nThe technique surged forward, saturated with killing intent. Only 1 damage in Battlefield's system—but the *momentum* was real. For an instant, Hao forgot where he was. He felt death's approach, real and immediate.\n\nAn illusion. Just an illusion.\n\n[You have suffered 1 damage.]\n\n\"Kuk...!\"\n\nBreath caught in his throat as reality reasserted itself. But Grid already controlled the rhythm.\n\n\"Endless Pagma's Swordsmanship!\"\n\nNo mana cost. No cooldown. Grid flowed seamlessly between forms—Link's footwork into Kill's pressure into Wave's crowd control. Attack, evade, counterattack. The dance never stopped.\n\n**Peok! Puk! Jjejejeok!**\n\nGrid's accuracy climbed to one-in-three. Hao's dropped to the same ratio. Suddenly they were even.\n\nCommentators and viewers alike sat in stunned silence.\n\n—*Grid and Hao are... matched?*\n\n—*This is insane.*\n\n—*And people claimed Grid only succeeds because of items?*\n\n—*He just proved how he became a Legend.*\n\n—*How he earned his kingdom.*\n\n—*How he reached the Hall of Fame.*\n\nEvery victory, every defeat, every hard-won lesson against impossible odds—Grid's entire journey crystallized in this moment. He wasn't just a high ranker. He was a warrior forged in crucibles most players never survived.\n\n\"URAAAAAAT!\"\n\n\"Ugh...!\"\n\n**Peng! Peng! Pepeng!**\n\nGrid roared like something feral, pressing his advantage with relentless aggression. He stayed inside the spear's reach, where the blunt weapon's thick striking surface made complete evasion nearly impossible. Wide attack angles. Continuous pressure.\n\n*It truly is Grid!*\n\nHao had acknowledged Grid since the 2nd National Competition—praised him so highly he might've followed Grid instead of Kraugel, if circumstances had been different. But acknowledgment didn't mean surrender.\n\n*He's mastered the blunt weapon through pure talent.*\n\nHao's gaze flickered past Grid toward the cabin. They'd drifted during combat—Grid backing him steadily in that direction. Then Hao spotted it: a longsword on the ground near the cabin entrance, dropped by a previous opponent.\n\n*The early advantage is mine. I can still claim victory—but I need to minimize further damage.*\n\nIf he reached that sword, he could match Grid in close quarters. Overpower him without accumulating more hits. After all, Hao's expertise was swords, not spears.\n\nOne problem.\n\n\"Why do you think our positions changed this way?\"\n\nIce crystallized in Hao's gut. Grid had guided him here *deliberately*. From the beginning, Grid targeted that sword. Hao had only noticed it recently—first dismissing it, confident his spear would suffice. Now it determined everything.\n\nGrid broke away and snatched the sword before Hao could react. He grinned at Hao's despair, then opened the scripture in his other hand.\n\n**Shaaaaaah—**\n\nDivine light enveloped Grid's body as his health bar refilled completely.\n\nEven here, items made all the difference."
}