{
  "id": 742,
  "title": "Chapter 742",
  "content": "**\"What the—\"**\n\nThe moment Grid produced the blue booklet, Hao's blood ran cold. Recognition struck like lightning.\n\n*A scripture!*\n\nLight enveloped Grid's body. The wounds marking their brutal exchange vanished as if they'd never existed. Hao's eyes widened.\n\n*He chose cleric?*\n\nDuring character selection, Hao had dismissed the cleric as worthless. Magicians wielded devastating power once they obtained a wand. Producers could craft their own bows and arrows. Both classes offered clear advantages. Given Grid's identity as a legendary blacksmith, Hao had been certain he'd pick producer.\n\nYet here he stood—a cleric.\n\nHao swallowed hard.\n\n*He knew from the start.*\n\nLike Hao, he'd initially considered the cleric the worst option. Then he'd entered the battlefield and spotted dozens of shrines scattered across the mini-map. The truth had crystallized instantly—the cleric possessed the greatest potential of any class. The scriptures he'd assumed were pure RNG drops? They could be farmed strategically. A cleric who secured multiple scriptures would become an unstoppable force.\n\nStill, he hadn't worried. No high ranker would be foolish enough to pick cleric.\n\n*No one could've deduced the scripture locations just from the character description.*\n\nThe description stated only that scriptures existed \"throughout the map.\" Nothing indicated they could be found in concentrated areas. Every other ranker would've rated cleric as trash tier.\n\nBut Grid hadn't.\n\n*He saw several moves ahead. Truly worthy of my respect.*\n\nAdmiration and excitement warred in Hao's chest. His health stood at 7. Grid's had just climbed to 15.\n\n*I need to land fifteen hits.*\n\nThe situation had deteriorated dramatically. For the first time, the specter of defeat loomed.\n\nBut Hao had never learned how to quit.\n\n*There's still a chance. No way he secured two scriptures.*\n\nHe'd need to land two or three strikes for every one he took. Hao gripped his spear tighter, focus sharpening to a razor's edge. By now, he'd memorized every nuance of Pagma's Swordsmanship.\n\n*Link and Wave involve rotation. Kill comes from a forward thrust. Revolve is pure footwork—no attack. Pinnacle closes distance.*\n\nPraised throughout his career as a master tactician, Hao excelled at identifying enemy patterns and exploiting weaknesses. His analytical mind and improvisation were second to none. Understanding Pagma's Swordsmanship had been trivial. By watching Grid's footwork during each sword dance, he could predict and counter every move.\n\nVictory was still within reach.\n\nThen—\n\n*Crack!*\n\nGrid stepped forward. The weight distribution was wrong—this wasn't simple movement. This was the wind-up for Kill or Pinnacle.\n\nHao identified it instantly. His right foot shifted back as he tracked Grid's stance, preparing to counter either a thrust or dodge accordingly. Grid advanced again, closing far more distance than necessary.\n\n*Pinnacle!*\n\nHao caught it. With his health critically low, he couldn't afford to block. He retreated one step, committing to evasion.\n\n*Slash—!*\n\nGrid's blade carved through the space Hao had just vacated. The attack carried a sharpness his previous blunt weapon could never achieve. A smile tugged at Hao's lips.\n\n*Now!*\n\nCounterattack. His right foot swept wide. The spear lanced forward like lightning, aimed precisely at Grid's heart. The strike was perfect—unavoidable.\n\nThen Grid's descending blade stopped mid-swing. As Hao committed to his thrust, the downward strike transformed into a counter-stab.\n\n**Pinnacle Kill.**\n\n*Impossible—*\n\n*Thud!*\n\nHao's spear punched into Grid's chest.\n\n***THUNK!***\n\nGrid's sword impaled Hao's heart. Grid was faster. Before Hao could retract his spear, Grid had already withdrawn his blade and attacked again. The sword's shorter reach proved decisive.\n\n*Slash!*\n\n\"Guh...!\"\n\nHao's shoulder split open. Grid recovered instantly. Hao finally pulled back his spear and countered with a second strike, fighting to maintain composure. Two more hits and they'd be even. He wouldn't panic. He *couldn't* panic.\n\nHis second thrust never landed.\n\n***CLANG!***\n\nJust before the spear reached Grid's chest, his blade twisted through the air and deflected the strike.\n\n**Revolve.**\n\n*What just happened?*\n\nHao's eyes twitched. Not only had Grid's repertoire expanded—he was chaining techniques faster than before. A small difference perhaps, to outside observers. But to Hao, locked in close combat, it was like fighting a completely different person.\n\n\"Sword dance,\" Grid murmured. \"No wonder it works better with a blade than a club.\"\n\nUnderstanding crashed over Hao. The moment Grid had switched to a sword, everything changed. Now he was displaying his true skill.\n\n*I can't lose to a swordsman!*\n\nFrom the beginning, Grid had viewed Hao as a formidable opponent. He'd been hunting for a sword since the match started. Hao, meanwhile, had considered Grid inferior. He hadn't prioritized finding a blade.\n\n*This is what carelessness buys me!*\n\nThe difference crystallized. Grid was humble. Hao was arrogant. The results spoke for themselves.\n\nOr so Hao believed. Reality was more nuanced. Hao wielded all weapons with equal proficiency thanks to Weapons Mastery—a product of exceptional talent. No single weapon dominated his style. Grid possessed no such talent. Though he'd trained with various weapons, only the sword felt natural. With anything else, his confidence evaporated. His obsession with swords wasn't humility.\n\nIt was necessity.\n\nOne born with talent. One forged without it. Here lay the true divide—and no one understood.\n\n*I can't win.*\n\nThe certainty struck when Grid chained two sword dances seamlessly.\n\n*To execute such complex techniques with these base stats... His talent rivals Kraugel's.*\n\nThe gap between them stretched to infinity. Enlightenment washed over Hao. He released his spear.\n\n\"I surrender. Finish it.\"\n\n\"Huh?\" Grid blinked. \"Why surrender? Even if you're going to lose, shouldn't you deal as much damage as possible?\"\n\n\"Only if I wanted to hurt you.\"\n\nHao held Grid in genuine regard—the reason he'd traveled to South Korea. He refused to weaken Grid through a pointless last stand. Better to step aside and let him advance. Grid caught the sentiment and smiled.\n\n\"You really are Pon. Thank you.\"\n\n\"...\"\n\nAfter fighting this long, Grid *still* didn't recognize him? Hao's frustration spiked. Was his presence truly that forgettable?\n\n*I'm not skilled enough.*\n\nOnce, Hao had been Grid's enemy. If he'd made a strong enough impression, Grid would've identified him during this match. But Grid remained oblivious. The message was clear—Hao had failed to leave his mark. He blamed himself for the inadequacy.\n\nThe truth was different. Grid's mistake wasn't dismissal of Hao's abilities.\n\nIt was the opposite.\n\n\"Come on, you're Pon, right? Only he can wield a spear like that.\"\n\n\"...Haha. I'm Hao.\"\n\nHao's smile widened despite himself.\n\n***\n\n—*Hao is pathetic!*\n\n—*Surrendering instead of fighting to the end... it's a disgrace to the nation!*\n\nChinese viewers erupted in fury. Their top ranker, defeated by a representative from a \"small country.\"\n\n—*Hao should be banished from China forever!*\n\n—*Exactly! Unacceptable for a representative of 1.5 billion to kneel before Korea! The whole world watched China surrender to South Korea! Absolute disgrace!!!*\n\n—*Banish Hao!*\n\n—*Throw him in the trash!*\n\nThe internet descended into chaos. Rage flooded forums and social media feeds. Not all Chinese citizens, of course—but enough selfish, arrogant voices to stain the country's image.\n\n—*I feel bad for Hao.*\n\n—*Seriously. How many medals has he won for China? One loss and suddenly he's a traitor.*\n\n—*They're extra sensitive because it's Grid, who's Korean. Chinese netizens seem to look down on South Korea.*\n\n—*Why are they treating Grid vs. Hao like South Korea vs. China? It's a solo exhibition match.*\n\n—*Right? Why does nationality even matter?*\n\nAs international viewers condemned the toxic Chinese comments, Korean netizens basked in satisfaction.\n\n—*God Grid turns the continent upside down single-handedly ㅋㅋㅋㅋ Incredible.*\n\n—*Koreans must be genetically superior. Small population, but we produce unique talents in every field.*\n\n—*I love Grid so much. Every National Competition, he makes me proud.*\n\n—*Uh, what's that?*\n\n—*Whoa, shit!*\n\nViewers watching the Battlefield feed tensed. While Grid and Hao faced each other, an Australian representative had drawn his bow in the bushes behind them.\n\nGrid, completely unaware—\n\n—*MOVE!*\n\n—*LOOK OUT!*\n\nNo matter how frantically viewers typed or how loudly the stadium screamed, their warnings couldn't reach him. Grid stood frozen, debating whether to eliminate the surrendering Hao or propose an alliance.\n\nThen—\n\n***THWACK!***\n\nAn arrow burst through the foliage and struck Grid's side.\n\n**[You have suffered 2 damage.]**\n\n\"Gah—!\"\n\nDevastating power. Grid whipped around toward the arrow's origin, eyes wide.\n\n\"Take this.\" Hao pressed the blue booklet into Grid's hands. \"If you beat me, you'd better win.\"\n\nHe charged into the bushes.\n\n*Thunk!*\n\nAn arrow pierced Hao's chest. His health dropped below 3. His vision flashed red in warning. But Hao didn't stop. He tracked the arrow's trajectory with perfect accuracy and drove his spear through the ambusher's gut.\n\n\"Shit—! I thought I'd get a free kill! Aren't you supposed to be enemies?!\"\n\nThe Australian representative convulsed around the spear. He'd already been wounded from previous fights—his health nearly depleted.\n\n***Flash!***\n\nHao and the Australian representative disintegrated into grey light simultaneously.\n\n\"Hao!\"\n\nThanks to Hao's sacrifice, Grid's health remained intact. Less than four hundred survivors remained on Battlefield."
}