{
  "id": 743,
  "title": "Chapter 743",
  "content": "\"What goes around comes around...\"\n\nThe memory surfaced unbidden—Grid buying Hao jjampong when the Chinese player had visited South Korea. He'd even splurged for the premium version, a whole thousand won extra.\n\n\"I'll make this right.\" Grid's voice was quiet as Hao's avatar dissolved into grey light. The lesson cut deep. He'd kill plenty more before this was over—survival demanded it—but within reason, when someone extended a hand, he'd return the favor.\n\n*Like Hao did for me.*\n\nWas his resolve pure? Hell no. Grid's motivations remained thoroughly self-interested. But that was the point. The man who'd once hoarded every scrap for himself was *changing*. Friends, guildmates, family—people he actually gave a damn about. Even strangers, sometimes. One small step at a time, he was building something new.\n\n\"Thank you again, Hao.\"\n\nGrid examined what Hao had pressed into his hand before the end—a blue booklet. Scripture. The bastard must've grabbed it from a shrine at the match start.\n\n\"Next time you're in Korea... I'll get you the *really* good jjampong.\"\n\nHe pocketed the scripture and moved toward where the bodies had fallen. Items dropped on death here too, just like in Satisfy. His hopes rose.\n\nFive arrows. That was it.\n\n*Same drop mechanics as the main game.*\n\nStill, arrows were arrows. Grid scooped them up and circled behind the cabin toward the cliff's edge. A small village spread out below where the forest ended.\n\n*Time to stock up on swords.*\n\nDurability mattered here just like in Satisfy—he'd noticed the red gauge on his weapon depleting during the fight with Hao. Halfway gone already. When it hit zero, the weapon would shatter. He needed backups.\n\nGrid began his descent, moving from shadow to shadow. No point advertising his presence to whoever might be watching.\n\n***\n\nThe mini-map labeled it \"Caroline\"—a hamlet perched beneath the high-altitude forest, right on Battlefield's outer edge. Nine houses, nothing more.\n\nAnd inside one of them, Brazil's representative Jishuka was pinned down and bleeding out.\n\n*Shouldn't have come here for supplies.*\n\nShe'd walked right into an ambush. Three-on-one, and she'd barely scraped through the initial assault. Now she was down to seven health with a weapon about to break.\n\n*If I just had a bow...*\n\nThe godly archer, reduced to flailing with a sword. She was competent enough in melee, but against a coordinated trio? It was like fighting with one hand tied behind her back.\n\n\"Girl, you're dead anyway! Stop wasting our time!\"\n\n\"What is this, hide-and-seek? You're supposed to be a *national representative*. Some honor that is.\"\n\n\"Oh wait, I forgot—you're from a *poor* country. Honor probably doesn't translate well, huh?\"\n\nThe French team circled the house like wolves, voices dripping with contempt. They'd worked out a system: taunt the prey out, eliminate them efficiently, move to the next. Their coordination was excellent—they'd established recognition signals before the match and managed to find each other early. Forty kills between them already, just in this tiny village.\n\n\"She's not taking the bait.\"\n\n\"Damn. We need to be careful. That woman's a ranker.\"\n\nThey nursed their wounds and exchanged nervous glances. The initial assault had cost them. Jishuka had proven she wasn't some scrub they could toy with.\n\nDrain, the group's de facto leader, held up a hand. \"Relax. Supply drop's coming soon. We'll heal up with potions. She won't. Just wait her out.\"\n\nTime favored the hunters. Sure, the map would shrink eventually, but there were *three* of them.\n\n\"We'll be the final three standing.\"\n\n\"Damn right.\"\n\n\"Let's just wait.\"\n\nHis teammates fell in line easily. Drain always kept his head in a fight, and his unified ranking sat at ten thousand. With him leading, victory seemed inevitable.\n\nThen—\n\n*Flap.*\n\nA parachute blossomed against the sky, supplies box swinging beneath it.\n\n\"There!\"\n\n\"Potions!\"\n\nAll three heads snapped skyward. The drop was close. Maybe forty meters.\n\n\"You two hold position. I'll grab it.\" Drain was already moving.\n\n\"Got it.\"\n\n\"Don't underestimate her.\"\n\nDrain flashed a confident grin and broke away. The supplies had landed within Caroline's boundaries, and they'd held this ground for over an hour. Low risk.\n\n*There.*\n\nThe box sat pristine in the street. Drain burst from the alley, hand outstretched—\n\n\"Link.\"\n\n*Shing! Shing!*\n\n\"Gah!\"\n\nTwin slashes carved across his reaching hand. Two damage—just scratches, but the shock made him fumble. The supplies box tumbled away.\n\n\"Who the *fuck*—\"\n\nSomeone had infiltrated the village? Damn it, they'd been so focused on the high ranker they'd forgotten their perimeter. Drain's weapon came out in a blur.\n\n*Clang!*\n\nMetal rang as he swatted the returning blade from the air.\n\n\"I'm a warrior class! Your little one-damage scratches won't cut it!\"\n\n*Thwang!*\n\nDrain committed his full strength to the riposte, launching his opponent's sword skyward, then drove forward with his shoulder. The moment his enemy lost balance, he followed through with a lethal cut. As a top ten-thousand ranker, his mechanics were clean.\n\nBut the spectators weren't impressed.\n\nDrain looked pedestrian compared to Hao's earlier showing. And the \"intruder\" he was fighting? Second place on the unified rankings. The man who'd just killed Hao.\n\n\"Revolve.\"\n\n*Krakrakrakrack!*\n\n\"What the—\"\n\nThe falling man *rotated mid-air*, not only blocking Drain's attack but counterattacking in the same motion. Drain's sword met empty air while a blade caught him for one damage.\n\n*This guy's a high ranker!*\n\nTop five thousand, minimum. Maybe top one thousand.\n\n*I'm fucked.*\n\nDrain didn't hesitate. He spun and bolted toward his teammates, abandoning the supplies without a second thought.\n\nWhich meant Grid claimed them unopposed.\n\n[Health Potion acquired.]\n\n[Mana Potion x2 acquired.]\n\n\"Three potions. Not bad.\"\n\nThe mana especially pleased him—more scriptures he could burn through later. Grid turned toward the nearest house to start looting—\n\n\"KYAAAAH!\"\n\nA woman's scream split the air. Same direction Drain had run.\n\n*Let's see what's happening.*\n\nHe wasn't planning to play hero. But watching other people kill each other, then swooping in to clean up? That was just good tactics.\n\n***\n\n\"Shit! We need to finish this *now*!\"\n\nDrain skidded to a stop beside his teammates, bleeding and empty-handed. His usual composure had cracked.\n\n\"What? What happened?\"\n\nThey'd never seen their leader rattled. No supplies, a fresh wound, and that look in his eyes—\n\n\"Another high ranker showed up. He's coming for us. We kill the woman *before* he gets here.\"\n\nThey could run, but the risks of moving across unknown territory outweighed holding this ground. Drain's teammates read the decision in his face and nodded.\n\nMace. Axe. Sword.\n\nThree weapons hit the door simultaneously.\n\n\"You bastards!\"\n\nJishuka lunged from her hiding spot, blade raised. But in the cramped space, outnumbered three-to-one—\n\n*Clang! Crack! Crack!*\n\n*Thud!*\n\n\"Ugh!\"\n\nShe was good. Better than good. But close quarters wasn't her forte, and the French trio moved with practiced coordination.\n\n\"KYAAAAH!\"\n\nCritical hits landed in rapid succession. Pain flooded her system as the weapons found flesh. Even burning through all her potions, she was down to three health.\n\n\"Persistent.\"\n\n\"But it ends now.\"\n\nThe French representatives bore wounds of their own, but the outcome was decided. Jishuka was pinned, disarmed, helpless.\n\nDrain raised his sword for the killing blow.\n\n\"Wave.\"\n\n*Whoosh!*\n\n*Crack-crack-crack!*\n\nThe voice came from behind them. All three Frenchmen staggered as force hammered into them simultaneously.\n\n*Area-of-effect?*\n\nTheir eyes went wide. There weren't supposed to be *attack skills* in Battlefield! They turned, movements jerky with shock, and found Grid lowering his blade.\n\n\"Three guys beating on one girl. Not a good look.\" Grid's smile was pleasant. Dangerous. \"How about you try me instead?\"\n\nSilence.\n\nThen Grid and Jishuka's eyes met across the space between them. Recognition was instant. Jishuka identified him by his swordsmanship. Grid identified her by... other distinguishing features.\n\n*Grid!*\n\n*That's definitely an E-cup.*\n\nMask or no mask, Grid was absolutely certain. Only one woman in the world had *that* exact silhouette.\n\n*Shing!*\n\nGrid's blade flashed toward Drain, but his other hand was already moving—pulling the bow and arrows from his inventory, tossing them to Jishuka in one fluid motion.\n\n\"Light them up!\"\n\n\"On it!\"\n\nThe godly archer returned.\n\n\"A bow? In this cramped—*ack!*\"\n\nArrows punched into the French representatives with devastating precision. Between Jishuka's shooting and Grid's swordwork, the fight lasted seconds.\n\nVictory.\n\n—*He's straight out of a fairy tale.*\n\n—*Grid swooping in to save his girl. Classic.*\n\n—*Jishuka's gorgeous though. Lucky bastard.*\n\nFor every new member joining Grid's fan cafe, another joined his anti-cafe. Jealousy was a powerful motivator.\n\nBattlefield was entering its final phase.\n\n**Survivors remaining: 166.**"
}