{
  "id": 744,
  "title": "Chapter 744",
  "content": "\"How did you know it was me?\"\n\nBehind the mask, Jishuka's eyes gleamed with undisguised delight. Despite her beauty and wealth—gifts most could only dream of—nothing compared to the warmth flooding through her now. Grid had recognized her instantly.\n\n\"That...\" Grid hesitated.\n\n\"Yes?\"\n\n\"...I looked closely. We've been together for years, after all.\"\n\nHe couldn't tell her the truth—that he'd recognized her figure—without risking a harassment accusation. His evasive answer would've made anyone suspicious, but Jishuka simply laughed.\n\n\"You saw through my disguise despite the voice modulation and mask? How clever.\"\n\n\"Wait—I'm not some stalker. Don't get the wrong idea.\"\n\n\"Fascinating.\"\n\n\"...\"\n\nGrid's stomach knotted. He couldn't read her mood at all. How could he possibly assume Jishuka—who'd topped the \"Most Desirable Women\" poll three years running—had any interest in him?\n\n[Axe acquired.]\n\n[Long Sword acquired.]\n\n[Tanto acquired.]\n\n[Short Bow acquired.]\n\n[Arrows (4) acquired.]\n\n[★Backpack★ acquired.]\n\n**[★Backpack★]**  \n*Hidden Item*  \nIncreases maximum capacity for health and mana potions by one.\n\n\"Huh.\"\n\nThe French trio had dominated Caroline village, slaughtering countless competitors in the process. Naturally, they'd accumulated quite the haul. Grid hummed cheerfully as he sorted through the spoils, then offered the bow and arrows to Jishuka.\n\n\"The Red Phoenix Bow is closer to a short bow than a greatbow, right? Use this instead.\"\n\n\"You're giving these to me?\"\n\nJishuka had been about to return the bow Grid had lent her earlier—it was his property, after all. Misinterpreting her hesitation as reluctance to be indebted, Grid waved dismissively.\n\n\"I'm a Cleric. Can't use it anyway.\"\n\n\"Cleric?\"\n\n\"Yes.\"\n\n\"...\"\n\nJishuka had assumed Grid was a Producer class. A Cleric? Of all things?\n\n\"...Not a Warrior or Magician? Cleric?\"\n\n\"That's right.\"\n\n\"...\"\n\nGrid and the Cleric class. Was there any stranger combination in the entire game? Watching her stunned expression, Grid shrugged.\n\n\"I would've given it to you even if I could use it. Your archery's the best in Battlefield. Now drink this potion.\"\n\nHe'd already made his decision.\n\n\"Jishuka, team up with me. Let's survive this together.\"\n\n\"Yes!\"\n\nJishuka nodded eagerly, her smile radiant. This brutal survival game allowed only three victors. Having someone more reliable than anyone else at her side filled her with relief—and something warmer still.\n\n***\n\nOne and a half hours into Battlefield.\n\n『Solo combat's practically extinct now.』\n\nOf the 166 survivors, most had formed teams. An inevitable evolution. As the participant count dwindled, identifying other players became easier. They leveraged connections and shared goals to forge alliances.\n\n『Battlefield was designed to test individual skill... This development seems contrary to S.A. Group's intentions.』\n\nSome criticized the shift from solo competition to team warfare. Others disagreed.\n\n『Communication is an individual skill. Anyone capable of assembling a competent, trustworthy team in these circumstances has already proven their worth. I see no problem.』\n\nTeamwork was talent. Most welcomed the development.\n\n*—A three-person survival game naturally encourages three-person teams.*\n\n*—Securing the right allies is part of personal capability.*\n\nThe forums burned with debate. With 166 elite survivors remaining, engagement soared. Who would claim those final three slots? One candidate seemed certain.\n\n***\n\nWhen Battlefield launched, dozens fled into the underpass. The weaker competitors judged that the dark, maze-like tunnels offered better defensive positions than the exposed ground. They found favorable terrain, concealed themselves, and prepared defensive positions—believing they'd be safe until the map boundaries forced them out.\n\nWishful thinking.\n\nDisaster struck. That disaster's name was Sword Saint Kraugel.\n\nPoor visibility. Narrow, twisting corridors. From any conventional tactical perspective, the underpass disadvantaged attackers and favored entrenched defenders. Most avoided the underground entirely.\n\nKraugel saw opportunity.\n\nHe recognized that the enclosed space prevented escape. The defenders had traded mobility for imagined safety, trapping themselves in a killing box. He descended personally, hunting competitors who might pose future threats. Everyone he encountered died.\n\nWords failed to capture his transcendent skill. They called him Sky Above the Sky—and for good reason. In close quarters where control mattered most, Kraugel was unstoppable. His enemies couldn't evade his strikes. He neutralized attacks from every angle simultaneously. He moved beyond human limitation, an action hero made flesh.\n\n*Is this it?*\n\nHe'd cleared the underground of hundreds of competitors. He stood alone.\n\n*Step. Step.*\n\nKraugel was the sole player to eliminate over one hundred of Battlefield's 1,500 participants. One hundred twenty-seven kills, to be precise. In ninety minutes.\n\n\"Mm.\"\n\nHe gathered usable items from the corpses, then paused at the stairwell leading topside. The survivor count had frozen at 166 for two minutes straight.\n\n*They're forming teams.*\n\nGiven the map's size, a lull with 166 survivors remaining made no sense—unless solo combat had ended. Kraugel immediately grasped the situation. Battlefield had become a team game.\n\nTherefore:\n\n*I wait.*\n\nCaution. What did the invincible Kraugel need to fear? Naturally—Grid.\n\n*Grid's likely gathered the Overgeared members.*\n\nKraugel had recognized Grid's potential long before the world acknowledged him. He never underestimated Grid. When factoring in control, speed, and coordinated tactics, Kraugel calculated his odds of victory against a unified Overgeared force as poor.\n\n*I'll wait.*\n\nKraugel melted into the underground darkness, prepared to remain until the survivor count dropped further. Anyone foolish enough to descend would die.\n\n***\n\nTwo and a half hours into Battlefield. Thirty minutes remained. The map had contracted by a third. Thirty-two survivors struggled across the shrinking arena as Kraugel finally prepared to surface.\n\n\"My Lord...!\"\n\nAboard the Mongolian representatives' plane, Huroi—who'd cast a wide-area taunt at the event's start and earned the dubious honor of being eliminated \"first\"—watched Grid's feed with mounting anxiety. Since partnering with Jishuka, Grid's team had focused on securing arrows and scriptures. Meanwhile, other survivors had formed teams of three to five. Kraugel remained alone, but he was an exception.\n\n\"My Lord's at a disadvantage!\"\n\nIf only he'd been competent! If only he'd targeted a single opponent instead of provoking everyone in range!\n\n\"I could be at My Lord's side right now! What an irreversible mistake!\"\n\n\"...God.\"\n\nThe other Mongolian representatives sighed with relief. If Huroi had survived and continued cursing, Mongolia's reputation would've been ruined. His early elimination was a blessing in disguise.\n\n***\n\n>[After two minutes, this marked space will disappear.]\n\n*Beep. Beep.*\n\nWarning intervals shortened relentlessly. Hiding places vanished. The survivors closed on one another until they moved between small buildings within visual range.\n\n\"The real fight starts now.\"\n\n\"No party's stronger than ours.\"\n\nThe thirty-two survivors brimmed with confidence. The team of Regas, Pon, and Lauel stood out especially—a combination of brilliant strategy and flawless execution. They believed they could defeat any opponent. Their track record supported that belief. Nothing had stopped their momentum so far.\n\n\"Heheheh... Even His Majesty can't beat us.\"\n\nLauel's wicked laugh carried across the battlefield. Viewers recognized the trio as championship favorites. Even Kraugel seemed unlikely to prevail against them. Their performances had been devastating.\n\nBut they had one weakness: Grid.\n\n\"Everyone, listen!\"\n\n\"...?\"\n\nThe survivors' attention snapped toward a voice. A man and woman stood together—a duo. The man was shouting.\n\n\"From this moment forward, I'll craft items for anyone who surrenders!\"\n\n\"...?\"\n\nWho was spouting such nonsense? Confusion rippled through the survivors. Lauel went pale.\n\n\"That's cheating...!\"\n\n\"I am the Overgeared King!\"\n\n\"...!\"\n\nThe survivors' confidence shattered."
}