{
  "id": 745,
  "title": "Chapter 745",
  "content": "Twenty-eight minutes remained.\n\nThe Battlefield map had been carved down to nothing but rubble and ruin, leaving only a single settlement intact: Trion. Five six-story buildings dominated the small town's skyline, surrounded by roughly forty single-story structures. The narrow alleys between them were cluttered with abandoned crates and barrels—natural cover. A fountain anchored the central square, and the side streets branched off in a maze of potential ambush points. Most striking were the clotheslines strung between the taller buildings, thick as mooring cables and sturdy enough to bear weight.\n\nGrid crouched in a tree overlooking the town, Jishuka beside him. Around them, other survivors had taken similar positions, waiting for the final confrontation.\n\n*The math doesn't favor us.*\n\nJust the two of them against teams of three, four, even five. Worse, everyone who'd survived this long had earned their place. Rankers, most of them. Chris would be out there. Pon. And Kraugel—always Kraugel. Grid had beaten strong opponents before, but numbers were numbers. Fighting multiple coordinated teams would be hell.\n\nAnd then there was the map itself.\n\n*Too cramped. No clear sniping positions.*\n\nAs a Cleric, Grid's combat potential was limited. The burden of offense fell to Jishuka, and she only had 136 arrows left. In theory, enough to eliminate multiple targets. In practice, bows needed distance to shine. Space to maneuver. Time to aim.\n\n*For Jishuka to be effective here, we'd need to take one of the tall buildings...*\n\nGetting inside wouldn't be hard. But the moment she started picking off targets from an upper floor, every team on the map would converge on their position. Grid would have to hold the stairs—alone—against however many came.\n\nAnd then there were those damned clotheslines. Enemies could cross from adjacent buildings, bypassing the stairs entirely. Defending multiple entry points simultaneously? Impossible.\n\n*Can I even hold the stairs at all?*\n\nOutnumbered. In a confined space that nullified Jishuka's greatest strength. The only sensible play was to turtle up and wait for opportunities.\n\n*Watch the flow. Stay reactive.*\n\nBut even that seemed like wishful thinking. He could feel eyes on them. The other survivors had already marked them as targets—the isolated duo, easier prey than the larger teams. The moment the timer forced everyone into motion, the hunt would begin.\n\n*Damn it. Why does it always come to this?*\n\nGrid had learned to manage his expressions in front of cameras. Society expected a certain composure from its public figures, and he'd gotten better at wearing the mask. So while his mind churned with frustration, his face remained still.\n\n\"Well,\" Jishuka murmured beside him, \"everyone left is good enough to have formed teams. This won't be easy.\"\n\n\"Good enough?\" Grid blinked. \"Forming teams is a skill?\"\n\n\"How can it not be— Oh.\"\n\nThen it hit him.\n\n*Of course it's a skill.*\n\nBattlefield had no rule against cooperation. He and Jishuka had teamed up themselves, after all. But turning competitors into allies in a free-for-all? That took something special. Competence. Charisma. Leverage.\n\n*Building a team here isn't easy.*\n\nThe survivors who'd pulled it off had demonstrated real ability—just not the kind that showed up in flashy combat highlights. Social intelligence. Negotiation. Leadership.\n\nThe realization struck Grid like a hammer blow.\n\n*There are so many more ways to prove myself than I thought. It doesn't have to be pure combat.*\n\nProof. That's what this was about, wasn't it? He'd approached Battlefield as a chance to demonstrate his worth on equal footing—no legendary items, no class advantages, just skill against skill. He wanted the world to see that he belonged among the rankers, that his success was more than gear and luck.\n\nBut he'd been thinking too narrowly. Combat wasn't the only measure of a ranker's ability.\n\n*I can show them.*\n\nGrid had skills beyond swordsmanship. Time to prove why he'd climbed this far.\n\nA smile crossed his face.\n\n\"Everyone, listen up!\" His voice cut through the tense silence. \"Surrender now, and I'll craft an item for you! Each person who surrenders gets a Grid original!\"\n\n\"...?\"\n\nThe trees around him rustled. Survivors shifted in their hiding spots, exchanging bewildered glances.\n\n*What the hell?*\n\n*Is he insane?*\n\n\"I'm the Overgeared King!\" Grid pressed forward, dropping all pretense. \"The legendary blacksmith! This is your chance—why hesitate?\"\n\nHe was confident. Few people could resist what he was offering.\n\nAnd judging by the murmurs spreading through the survivors, he was right.\n\n*Grid?*\n\n*That bastard, pulling something like this...*\n\n*But think about it—isn't getting a Grid item worth more than gambling on first place?*\n\n*Seriously. How often do you get access to his work? Legendary ratings. Growth items.*\n\n*Gulp.*\n\nThe mood shifted. The survivors were biting. Hard.\n\n『...』\n\nEven the commentators had gone silent.\n\n『Why... why is this happening?』 one finally managed.\n\nHe'd wanted to call an epic final battle, not watch everyone surrender without a fight. But he couldn't condemn Grid's approach. If anything, the strategy was brilliant.\n\n『It's disappointing for the spectators, but... I have to acknowledge it. Grid is exceptionally clever. Resourceful.』\n\n『Agreed. Using his itemcrafting ability to manipulate the field? I never would've imagined it.』\n\nWas this cheating? Bringing Satisfy influence into a Battlefield match? Most viewers didn't seem to think so. These were Satisfy players competing in a Satisfy-sponsored event. Of course Grid's reputation carried weight here.\n\nJust...\n\n—Nobody else even thought to try this...\n\n—Because nobody else *could*. Who besides Grid can offer something that makes everyone want to surrender?\n\n—True.\n\n—Amazing. He's going to win without throwing a punch.\n\n—I've been saying it—Grid's mind is his greatest weapon. Strong? Sure, he beat Hao. But it's the combination of intelligence and strength that makes him exceptional. Top-tier among high rankers.\n\n—Plus that alpha presence. First King for a reason. There's more to Grid than what we see in highlight reels.\n\n—Right. We only catch glimpses during competitions and PvP videos. If you could watch him operate day to day...\n\n—...you'd understand why Overgeared is so loyal. It makes sense now.\n\n—Probably why Pope Damian respects him too.\n\nThe praise rolled on. They saw Grid clearly now. Saw his true value.\n\n—I don't think anyone will underestimate Grid again after this.\n\nA complete existence. Finally.\n\nJust like Kraugel.\n\n***\n\n\"So, what's everyone's decision?\"\n\nGrid ignored the cameras, focused on the moment. He expected a decent yield—maybe half the survivors would take the deal.\n\n*Some will definitely hold out.*\n\nHe understood the value of his work. He'd used it as diplomatic currency before, and it had always worked. Most of these people wanted his items badly enough to surrender for them.\n\nThere was just one problem.\n\nAside from himself and Jishuka, fourteen of the thirty survivors were Overgeared members. Who already had access to his workshop. Who didn't need to surrender to get his gear.\n\nGrid had overlooked this completely. His intelligence stat had improved dramatically, but there were still gaps in his strategic thinking.\n\nStill—an achievement was an achievement. Just as Grid fought for victory, so did his guildmates. They wanted to win on their own merits.\n\n\"That Grid is fake!\" Lauel's voice rang out. \"There's no proof that's really him! Don't fall for it!\"\n\nLauel loved Grid. Would stand beside him for life. That was genuine—years of partnership, and many more to come. Grid was precious to him.\n\nBut Lauel never confused affection with competition. He wouldn't surrender victory out of sentiment. He wanted to win. For himself, for his country, for the pride of it.\n\nAnd he wasn't alone.\n\n\"That's right! Grid isn't this desperate!\"\n\n\"The real Grid wouldn't resort to bribery!\"\n\n\"What—\"\n\nThe wave of denial crashed over Grid before he could respond. The other survivors, briefly swayed by his offer, began to waver.\n\n\"Maybe it *is* an imposter. Grid wouldn't just give away items for free.\"\n\n\"Plus, would he really honor the deal after the match?\"\n\n\"Wait, I never said it would be free—\"\n\n\"That's not Grid!\"\n\n\"No way!\"\n\n\"Oh!\"\n\nGrid couldn't get a word in edgewise. Every time he tried to explain, another Overgeared member shouted him down.\n\nJishuka laughed softly. \"Well. Our people aren't easy, are they?\"\n\n\"They're Overgeared members?\" Grid stared. \"All of them?\"\n\n\"Just look around.\"\n\n\"You little shits!\"\n\nIrritation and pride warred in Grid's chest. Irritation won on the surface—but deep down, he was pleased. His people were fighting with everything they had. As they should.\n\n*Fine. If that's how you want it, we'll fight to the bitter end.*\n\nA fair battle. He'd give them exactly what they were asking for.\n\nThe moment Grid steeled himself for combat—\n\n\"I won't surrender,\" a lone voice cut through the noise. \"But I'll join your team. Make me an item in exchange?\"\n\n\"...?\"\n\nThe bustling atmosphere stilled. Everyone turned to stare at the speaker—a man standing alone, no team behind him. Unlike every other survivor, he operated solo.\n\nHe walked forward calmly, comfortable under the weight of all those eyes.\n\n\"You have two. A third won't hurt, right?\"\n\nThe man stopped directly in front of Grid.\n\nGrid frowned. \"Are you sure? I just painted a target on my back with that stunt. Teaming up with us might be dangerous.\"\n\nThe man snorted. \"Who's going to threaten a team with you and me on it?\"\n\n\"...?\"\n\n*Who the hell is this guy?*\n\nGrid tilted his head in confusion.\n\n—Oh my god.\n\n—This is insane. Absolutely insane.\n\n—The dream team. This is the dream team.\n\nThe audience erupted. Communities across the globe went into meltdown, as if someone had announced the apocalypse. A commentator's voice cracked.\n\n『K-Kraugel! Sword Saint Kraugel has announced his intention to team up with Overgeared King Grid!』\n\nThe sky above the sky. The strongest man alive. The one person who couldn't pass up Grid's offer.\n\n\"Why are you here...?\" Grid gaped.\n\nAround the world, understanding dawned.\n\nBattlefield would end soon. But the final three were already decided."
}