{
  "id": 746,
  "title": "Chapter 746",
  "content": "\"With the two of us together, what's there to fear?\"\n\n\"...?\"\n\nWho was this guy? A flicker of recognition stirred in Grid's mind as he studied the man offering to join forces. Something about him seemed familiar, though he couldn't quite place it. Then a name surfaced in his thoughts.\n\n*No way. Impossible.*\n\nGrid dismissed the notion immediately. The person he was thinking of would never stoop to chasing items.\n\n\"You might want to look behind you.\"\n\nA wave of competitors surged toward their position. They couldn't allow Grid to form a three-person squad—not when every other team had already done the same. Time was running out.\n\n*Ping!*\n\n*Piiing!*\n\nArrows filled the air. Four projectiles launched from different angles, converging on Grid, Jishuka, and the stranger.\n\n\"Shit!\"\n\nGrid's aggro management had just gone sideways. He clicked his tongue and twisted aside as an arrow whistled past his ear. Half a second slower and it would've skewered him. Jishuka wasn't as fortunate—a shaft buried itself in her forearm. She simply couldn't match Grid's reaction time.\n\n*Clang!*\n\n\"...!!\"\n\nThe mysterious man's sword flashed twice, batting arrows from the air mid-flight. Grid, Jishuka, and the watching crowd stared in stunned appreciation at the display of pure skill.\n\n\"You...!\" Grid's eyes widened as recognition finally clicked into place. \"Kraugel...?\"\n\n\"That's right.\"\n\n\"...What the hell are you doing here?\"\n\nOf all people—*The Genius* himself. The player who combined god-tier mechanics with unshakable confidence. Kraugel's presence here made no sense.\n\nKraugel addressed Grid's confusion with characteristic calm. \"Why am I here? Did you expect me to be eliminated already?\"\n\n\"That's not what I meant. Since when do you chase after items?\"\n\n\"Should I maintain some lofty pretense? I'm not stupid enough to ignore a golden opportunity for the sake of pride.\"\n\n\"Really?\" Grid's tone dripped with sarcasm. \"Even the legendary Kraugel stoops to item grinding?\"\n\nThe rivalry between them ran deeper than most viewers realized. What grated on Grid most was Kraugel's absolute composure—the bastard didn't even blink as enemies swarmed their position. He could afford to *relax* in a situation like this?\n\n\"Kuk!\"\n\nGrid grunted as another arrow slammed into his side. The impact cost him 2 health, and he grimaced before shouting to Jishuka.\n\n\"Inside! That building behind us!\"\n\n\"Right!\"\n\nGrid and Jishuka didn't hesitate. They bolted for the structure at their backs. Kraugel, however, remained rooted in place—directly in the path of twenty competitors descending on him like a pack of hungry wolves.\n\n\"The hell are you waiting for?\" Grid called back.\n\n\"Do you accept me as a teammate?\"\n\n\"What...?\" Was this bastard seriously waiting for confirmation? *Now?* \"You've got to be kidding me! What choice do I have? Get your ass in here!\"\n\nAt that moment.\n\n\"...Very well.\"\n\n*Step.*\n\nKraugel moved. Too late. Four enemies had already closed the distance, cutting off his escape route.\n\n\"Going somewhere?\"\n\n\"You really think we'll let you team up?\"\n\nThe rules were simple: only three winners. Every participant in Battlefield needed to eliminate competitors, and smart players targeted the weakest prey first. Grid's team had only two confirmed members, while this unidentified swordsman stood alone. They made obvious targets.\n\nBut—\n\n*Swish!*\n\n*Clang-clang-clang-clang!*\n\n\"Gah..!\"\n\n\"W-What the—?\"\n\nOne man proved worth a hundred. Numbers meant nothing against true skill. Kraugel deflected all four simultaneous attacks while delivering precise counterstrikes. Each of his four opponents reeled backward, suffering 2 damage and looking like they'd seen a ghost. The realization hit them all at once.\n\nWho was this lone swordsman?\n\n\"The Genius...!\"\n\n\"You've got to be shitting me...!\"\n\nCries of recognition rippled through the assembled players. The momentum of the pursuing mob ground to a halt. It was a sight to behold—elite rankers representing their nations frozen in place, completely overwhelmed by a single individual. The impact on the broadcast audience was tremendous.\n\n—*That's just... he's on another level entirely.*\n\nKraugel stood alone between the building entrance where Grid and Jishuka had taken refuge and dozens of would-be attackers. Yet he didn't appear cornered or desperate. If anything, he looked down at them from an untouchable height. No one dared rush him. The outcome seemed inevitable.\n\nThen—\n\n\"Kraugel! Perfect!\" A figure burst from the crowd—not another sheep, but a wolf who'd been hiding among them. \"Finally! A chance to face you on equal terms. I couldn't be happier!\"\n\nThe man's voice rang with almost childish excitement. He was a top-ranking member of the Overgeared Guild representing the United Kingdom—Regas. Kraugel identified him instantly and couldn't help but chuckle.\n\n\"Equal terms?\" He glanced meaningfully at the group Regas had emerged from.\n\n*Step.*\n\nKraugel advanced one pace toward the building.\n\n*Step.*\n\nAnother. In moments, he'd reached the entrance where Grid and Jishuka waited.\n\n\"If you're truly serious about fighting me, then follow.\"\n\nKraugel understood exactly what made Regas tick. After issuing that challenge, there was no chance the martial artist would back down.\n\n\"Damn right I'm serious!\"\n\n\"Wait! Regas, wait!\" Lauel's shout fell on deaf ears. Regas saw only Kraugel as he charged into the building. \"Shit...! That muscle-brained idiot! Everyone else, move in!\"\n\nThe moment Lauel and Pon moved toward the entrance—\n\n*Thunk!*\n\n*Thunk!*\n\nArrows punched through their shoulders with surgical precision. Perfect shots. Lauel and Pon immediately knew the archer's identity.\n\n\"Jishuka?\"\n\nUnderstanding dawned. Their gazes snapped upward to find—\n\n\"Hi there, boys.\"\n\nThe red-haired woman perched on a window ledge above, bow drawn. The same woman who'd been fighting alongside Grid.\n\n*We're screwed!*\n\nThe realization hit Lauel and Pon simultaneously.\n\n\"Hands up if you value your heads.\"\n\nJishuka's cheerful announcement preceded a barrage of arrows. For the players below, it was a nightmare scenario. Most were Overgeared members who knew exactly what she was capable of. They flattened themselves against the building's wall, frantically exchanging theories.\n\n\"Damn it, Jishuka's got the high ground.\"\n\n\"We got too cocky. We need to get out of her line of sight.\"\n\n\"No—follow that fighting maniac inside. We don't have a choice. We need to work together.\"\n\nA party consisting of Grid, Jishuka, and Kraugel. They hated to admit it, but this was potentially the strongest combination possible. Without cooperation, they had no chance of stopping those three.\n\n\"Form a temporary alliance. We take down those three first, *then* compete among ourselves. Agreed?\"\n\n\"Won't an alliance look bad? The viewers might think we're cheap.\"\n\nSome participants worried about their public image. National representatives had reputations to protect. Another voice cut through the hesitation.\n\n\"Who's in the wrong here? Isn't it more unfair that those three teamed up in the first place?\"\n\n\"...You've got a point.\"\n\n\"Nobody's going to blame us.\"\n\n\"Alright! Let's storm the building!\"\n\n\"We'll take the adjacent structure! We can cross using the clothesline!\"\n\nKraugel and Grid would obviously defend the stairs—a bottleneck that made flanking maneuvers nearly impossible. But they had overwhelming numbers.\n\n*Eventually Grid's party will run out of health and fall.*\n\nConfidence surged through the assembled players. They began coordinating their assault in teams. Close-combat specialists charged straight into Grid's building. Archers and ranged fighters secured positions in neighboring structures, establishing firing angles through windows to support the ground assault. Some even planned to infiltrate via the clothesline stretched between buildings.\n\nThe viewing audience watched the coordinated attack unfold with mounting tension.\n\n—*This event's purpose just completely changed...*\n\n—*...*\n\nBattlefield had transformed. It was no longer a free-for-all battle royale—it had become Hunt Grid's Team. The commentators analyzed the shift.\n\n『It's the fate of the strong to unite the weak against them.』\n\n『The question is how long Grid, Kraugel, and Jishuka can hold out.』\n\n『No matter how skilled those three are, they can't defeat this many elite rankers. Everyone was intimidated by Kraugel initially, but look at Regas now—he's holding his own. He might actually take down Kraugel solo.』\n\n『Gathering too much talent might actually backfire. Grid's party could surprisingly be the first to—wait, what?』\n\nThe commentators fell silent. In the span of their brief analysis, Regas had been pushed to the brink of defeat. The martial artist who'd dominated every match suddenly found himself completely outclassed by Kraugel. What started as a competitive duel had become a one-sided beatdown.\n\n\"Hah... hah... Unbelievable. How did you get this strong?\"\n\nRegas struggled to catch his breath. On the narrow staircase, his clash with Kraugel had reached its inevitable conclusion. Kraugel found the situation almost absurd.\n\n*Does this man actually think he can beat me?*\n\nThe question had merit. Regas was fighting barehanded. That's right—against Kraugel, one of the strongest players in Satisfy, Regas had chosen to fight without a weapon. His martial artist class dealt only 1 damage per unarmed strike in Battlefield, yet he believed he could demonstrate his true skill through pure technique. So he'd fought the entire match with his fists. Naturally, he applied the same approach against Kraugel.\n\n\"...\"\n\nThe Overgeared Guild truly housed remarkable individuals. Kraugel delivered the finishing blow.\n\n\"Kuk...! Long live The Genius!\"\n\nRegas's final words rang with admiration as his avatar dissolved to gray light. Viewers mourned the loss while marveling at his commitment to fighting in Battlefield barehanded. Meanwhile, Kraugel faced his next challenge—ten enemies ascending the stairs.\n\n*I've taken more damage than expected.*\n\nRegas's bare-fisted strikes had connected five times, chipping away at Kraugel's health. He resolved not to underestimate these top-tier players and tightened his grip on his sword.\n\n\"Leave them to me. Go protect Jishuka.\"\n\n\"Grid, you...\"\n\nKraugel's voice trailed off. Grid appeared beside him, late to the party. He clutched ten scriptures in his hands—precious healing items.\n\n\"Hiccup!\"\n\nThe advancing enemies froze at the sight. Grid positioned himself on the stairs and made his declaration.\n\n\"I am the Overgeared King.\"\n\n\"...\""
}