{
  "id": 747,
  "title": "Chapter 747",
  "content": "\"...Are those scriptures?\"\n\n\"No way. But the design matches...\"\n\nThe figures ascending the stairs moved with purpose. Elite players, every one of them—survivors who'd clawed their way to the final minutes through skill and cunning. They knew their worth. Confidence radiated from their stance, their weapons, their coordinated advance. \n\nWhy wouldn't they be confident? The math was simple: twenty health per character, maximum two potions. If they worked together, this should be over in seconds.\n\nUntil they saw what Grid carried.\n\nMore than ten scriptures. Blue booklets cradled in his arms like treasure.\n\n'This crazy bastard...'\n\n'Did he spend the entire match hunting scriptures?'\n\nClerics struggled to secure even one scripture. This walking pharmacy had collected over ten. The implications hit them all at once. The stairwell fell silent except for the distant sounds of combat echoing through the ruined map.\n\n\"Grid!\" Ibellin's voice broke the tension, bright and warm. \"Man, you made it! That's incredible. You spent all that time gathering scriptures?\" He laughed, shaking his head. \"I should've known. You never do anything halfway.\"\n\nGrid recognized him immediately. Not many people used that tone with him.\n\n\"Ibellin? You're still alive?\"\n\n\"Got lucky. Lasted through the early bloodbath.\"\n\n\"Lucky enough to be here at the end?\"\n\n\"We'll see about that.\"\n\nThe others were still processing. Over ten scriptures meant over a hundred health. Add two potions and Grid effectively had six lives. But he was still just a Cleric—unarmed, vulnerable.\n\n*Clink.*\n\nIbellin drew something from his inventory. Light gleamed along a polished staff.\n\n\"Whoa.\"\n\n\"Where did you get that?\"\n\n\"Is that—?\"\n\nMurmurs rippled through both groups. A magic wand—the strongest weapon in Battlefield. Rare as dragon teeth. Ibellin's smile widened as magical energy pulsed along the wood.\n\n\"It's all about the items, right?\"\n\nGrid's eyes narrowed. \"...I really did raise a tiger cub.\"\n\nSweat beaded on his forehead. The atmosphere shifted, heavy with lethal intent. Even the allied players shuffled back. Even Ibellin felt it.\n\n*Now!*\n\nIbellin knew Grid's reputation. Had watched him grow from struggling blacksmith to legend. He still remembered the Mystery Forest—eighty-three attempts against Pagma's doppelganger before Grid finally won. Eighty-three failures, each one a lesson carved into muscle memory.\n\n*Can't give him an opening!*\n\nStrike hard, strike fast. The longer Grid had to adjust, the more dangerous he became. Ibellin's knuckles whitened on the wand as he swung.\n\n*Crack!*\n\nThe wooden railing exploded into splinters. Grid's former position—now empty air.\n\n\"...Damn.\"\n\nGrid stood three feet to the left, eyes wide with genuine surprise. That power was no joke. The other rankers saw his expression and grinned.\n\n*He's rattled.*\n\nGrid's gaze locked on the wand, tracking it like a hawk watching a snake. His entire focus seemed consumed by that single weapon, telegraphing his fear.\n\n*This is it!*\n\nWhile Grid fixated on Ibellin's wand, three top rankers saw their opening. They waited, muscles coiled, for the perfect moment.\n\n*Whoosh!*\n\nIbellin's wand carved a wide arc. Magic shrieked toward Grid.\n\n*Now!*\n\nThree bodies exploded into motion. They vaulted up the narrow stairs, weapons singing through air, aimed not at where Grid stood but where he'd have to dodge—\n\n*Perfect!*\n\n—and died on their lips.\n\n\"No—!\"\n\nIbellin saw it too late. He'd missed his second strike, and only then did he understand: Grid wasn't rattled at all. That laser focus on the wand? Precision calculation. Grid had tracked every millimeter of the attack's trajectory, responded with exactly the movement necessary.\n\nBut Ibellin, locked in direct combat, barely noticed in time. The other three had no chance of reading Grid's true intent.\n\nThey were already committed when Grid smiled.\n\nThree blades converged on his escape route. Grid used Revolve's footwork to slip past Ibellin's magic.\n\n*Slip.*\n\n\"What?!\"\n\nGrid twisted. Two swords cut empty air. The third—Grid turned as if he had eyes in the back of his skull and the narrow stairs suddenly became a weapon.\n\n*Thump!*\n\nFive bodies in a space meant for two. Grid pivoted, shoulder checking the nearest attacker. The man stumbled. Grid used the momentum, shifted his weight, drove his shoulder into the second man's chest—\n\n\"Wait—what—!\"\n\nThe three attackers staggered backward in a chain reaction.\n\n*Oh no.*\n\nTheir feet found nothing. The gap Ibellin's wand had torn in the railing yawned behind them like a mouth.\n\n\"AHHH!\"\n\n*Crash!*\n\n*Bang bang bang!*\n\nThree bodies tumbled down four floors. Ten damage each on landing. One potion wouldn't fix that.\n\nGrid glanced down at the groaning heap, then back at the stunned survivors.\n\n\"No room for carelessness,\" he said mildly. \"That's basics, isn't it?\"\n\nHis eyes had changed. No more surprise, no more wariness. Sharp. Cold. Predatory.\n\nIbellin recognized those eyes instantly. Every Overgeared member did.\n\nTheir king's eyes.\n\n*Gulp.*\n\nThe boundary between Battlefield and Satisfy blurred. Ibellin retreated a step, then another. The magic wand might as well have been a stick. Grid moved forward without hesitation—\n\n*CLANG!*\n\nSteel screamed. A greatsword deflected Grid's thrust, the flat of the blade catching his sword and twisting. Grid's weapon tilted off-axis.\n\n*Shing!*\n\nThe greatsword's edge flashed toward Grid's throat. In the same motion, its wielder flowed around Grid's guard, claiming the high ground behind him.\n\n*Whoosh-whoosh-whoosh!*\n\nThe blade descended in a flurry. Grid threw himself backward, gaining the top landing. The fourth-floor platform fell to enemy control in seconds.\n\nGrid laughed, but there was no humor in it.\n\n\"Isn't this a bit much?\"\n\nThe greatsword's owner lowered his blade slightly.\n\n\"I'm nothing compared to you and Kraugel.\"\n\n\"Nobody believes that. Trust me.\"\n\nChris. First place in the unified rankings.\n\nGrid grimaced internally.\n\n*Why didn't he go to Kraugel's side?*\n\nChris's greatsword technique was terrifying. Every strike carried absolute conviction. The world acknowledged his skill. Grid admitted it freely every time he saw the man fight. Part of why Grid had always wanted to master the greatsword was because of Chris.\n\nAs long as Chris existed, Grid knew he could never be the symbol of that weapon.\n\n*Well.*\n\nGrid checked the remaining time. Counted the enemies: thirteen total, including Chris. His objective shifted.\n\n*Can't wipe them all out.* The realistic goal? *Hold until reinforcements arrive.*\n\nOriginally, he'd planned to destroy everyone here. These were the top rankers from multiple countries. Was that arrogance? No—a calculated assessment. Grid had proven himself beyond ordinary rankers the moment he eliminated Hao. He was a master-class player.\n\n*Besides,* I have backup.\n\nKraugel and Jishuka would handle anyone approaching from behind. Then they'd assist him.\n\n\"All right then.\"\n\n*Shaaaa—*\n\nGrid opened a scripture. Blue light washed over him. His wounds vanished, health restored to full.\n\n\"Still have eleven left.\"\n\n\"Cockroach...\"\n\n\"...\"\n\nThe muttered word hit home. Grid couldn't even argue.\n\n---\n\n*Thwip!*\n\n\"Ugh.\"\n\nDust showered onto Jishuka's head as she drew her bowstring. An arrow had embedded itself in the ceiling inches above her.\n\n\"Headshot attempts already?\"\n\n*Twang!*\n\nShe fired through the window at the building across the street.\n\n*Thunk!*\n\n[You have dealt 1 damage to the target.]\n\n\"Impressive.\"\n\nKraugel's admiration rang genuine. Third time he'd said it. Jishuka's archery transcended anything he'd expected, even from a supposed top ranker. She shrugged.\n\n\"It's nothing. I'm no Grid.\"\n\n\"...\"\n\nKraugel found the Overgeared members' casual self-deprecation baffling. He had no response, so he focused on his sword. An enemy was attempting to cross the clothesline between buildings.\n\nKraugel leaned through the window—\n\n*Twip! Twip-twip-twip!*\n\nThree arrows screamed toward him from the opposite building.\n\n\"Look out!\"\n\nKraugel twisted mid-motion. All three arrows kissed empty air.\n\n\"...Are you even human?\"\n\n\"Last I checked.\"\n\nSimple question, simple answer. Kraugel appreciated the straightforwardness.\n\n*CRASH!*\n\nA spear punched through the left window. Kraugel blocked it, but the follow-up came from the right instead. Jishuka tried to cover him, but arrows suddenly concentrated on her position. She dove behind cover, pressed into a corner by the suppressing fire.\n\n*They've figured out shooting at Kraugel is useless.*\n\nFrustrating. Jishuka peeked around her cover and spotted the coordination: two men flanking Kraugel from both sides while archers kept her pinned.\n\nPon on the left. Lauel on the right."
}