{
  "id": 748,
  "title": "Chapter 748",
  "content": "*How did they get past me?*\n\nKraugel had been watching the clotheslines—those tough cords stretched between buildings that refused to be cut or sawed through. Every angle, every approach from the opposite building lay within his field of view.\n\nYet Pon and Lauel had materialized at the windowsill like ghosts.\n\nHis gaze dropped to a spear embedded in the wall below. The weapon looked spent, its durability completely exhausted.\n\n*They climbed.*\n\nThe five-story building was ancient and decrepit. Its exterior wall bore the scars of time—rugged surfaces, deep cracks, handholds for anyone skilled and patient enough to use them. Climbing it would require exceptional agility, concentration, and nerves of steel.\n\nKraugel studied the two men flanking him. One gripped a spear, the other an iron fan.\n\nBefore he could wonder at their identity, they introduced themselves.\n\n\"I am Lauel of the Overgeared Kingdom. Or should I say American Representative Lauel?\" The man's voice carried casual confidence. \"This is separate from the National Competition, of course, but I regret we couldn't fight together—\"\n\nKraugel's sword whistled through the air mid-sentence.\n\nHis target: Lauel.\n\nThe strategist needed to be eliminated first. Pon was strong—a warrior whose combat prowess demanded respect. But Lauel was the architect, the schemer. In pure martial skill, he should be the weaker link.\n\nThat's why the surprise attack made perfect sense.\n\n*Clang!*\n\nSteel met iron as Lauel's fan intercepted the blade. He'd read the timing perfectly, his defense smooth and practiced.\n\nKraugel's eyes widened fractionally—the only sign of his surprise.\n\nLauel folded the fan and tapped it against his lips, a scholar's gesture. \"I've advanced too, you know. Though admittedly on a different scale than the man who stands above two billion users.\"\n\nHe shifted his stance. \"Three years ago, ten geniuses rewrote the rankings. Late starters who dominated their classes within months—the first generation of the Ten Rookies. I was the best among them. People praised me then.\" His smile was self-deprecating. \"After joining Overgeared, I became a Flow Master. I direct battles now, control terrain and weather. My combat ability dropped significantly.\"\n\nThe fan snapped open. \"But my fundamentals remain.\"\n\nIn Battlefield, where stats equalized and only skill mattered, Lauel was still elite.\n\nHis laugh carried genuine amusement. \"More importantly, I have the analytical mind to predict your patterns. You're in for a tough fight, Kraugel. I can feel the adrenaline already.\"\n\nKraugel's expression remained neutral, but a chill ran down his spine.\n\n*Troublesome.*\n\nA spear thrust from his blind spot—Pon's opening strike. Kraugel rolled, came up into a guard position, and attempted a counter.\n\n*Clang!*\n\nLauel's fan was already there, intercepting. Before Kraugel could adjust, Pon's spear targeted the back of his neck. Quick. Coordinated. A flawless pincer attack.\n\nSteel pierced flesh.\n\nBlood welled from Kraugel's shoulder.\n\n『 He's hit! Kraugel took the first strike! 』\n\n『 I never thought I'd see this! 』\n\nCommentators worldwide erupted. Kraugel allowing a clean hit was headline material.\n\n\"Kraugel!\"\n\nJishuka started forward, then—\n\n*Thunk. Thunk-thunk-thunk!*\n\nArrows hammered her position from the opposite building. She dove behind a leather sofa, the only substantial cover in the bare room.\n\n*Damn it!*\n\nHer role was clear: provide covering fire, protect Grid and Kraugel, eliminate as many enemies as possible. But the coordinated assault made that impossible.\n\n*I wanted to win alongside Grid.* The fantasy had been vivid—embracing him on stage before the world, perhaps even stealing a kiss if the moment felt right. Now it seemed laughably distant. *Useless. I'm so damn useless.*\n\n*Thunk!*\n\nAn arrow punched through the sofa's leather hide. The piece of furniture had become a pincushion, bristling with shafts.\n\n*Almost no safe spots left.* Emerging from cover meant turning into a hedgehog herself.\n\nThe interior offered nothing—bare walls, too many windows. Archery required line of sight, visual tracking of the target. The moment she left her cover, she'd be riddled with arrows.\n\n*Wait.*\n\n*I don't need to track them with my eyes.*\n\nJishuka drew a slow breath, steadying her nerves, and closed her eyes. The sounds of combat filled her awareness—footsteps, the clash of steel, heavy breathing. She drew her bowstring, using her ears alone to aim—\n\n*Thunk-thunk-thunk!*\n\nMore arrows threatened her position.\n\n*Damn.* Her eyes snapped open. *The mirror.*\n\nWho furnished an abandoned building with mirrors? The map designer clearly had archers in mind.\n\nShe lowered her bow with a bitter laugh.\n\nBut despair didn't follow.\n\n*It's fine. They can't have unlimited ammunition.*\n\nAfter joining Grid, Jishuka had learned the true scarcity of arrows and scriptures. Finding them was grueling work. Most caches held one or two at best, and they were effectively consumable. Gathering a meaningful supply required enormous effort.\n\nHer attackers would run dry eventually.\n\nAs for herself?\n\n*My supply is practically endless.*\n\nIn the dusty mirror's reflection, Jishuka's face held grim satisfaction. The arrow-studded sofa and walls were proof of her enemies' dwindling resources.\n\n***\n\n*Thank god for Jishuka.*\n\nThe arrows from across the street had stopped targeting him. Kraugel's evasion was exceptional, but Pon and Lauel would exploit any gap in his concentration. Having Jishuka draw that aggro was invaluable.\n\n*But there's still a problem.*\n\nThe close-range fighters who'd failed to cross the clotheslines earlier were attempting another crossing. He needed to eliminate Pon and Lauel immediately.\n\nEasier said than done.\n\n*Clang! Clang-clang!*\n\nLauel's iron fan—barely thirty centimeters long—became a blur of precise strikes.\n\nPon maintained medium range, his spear darting forward like a viper's tongue. Together, they shackled Kraugel's momentum.\n\n*Crack!*\n\nKraugel's sword caught Lauel's ribs in exchange for taking a punch. The strategist grinned through the pain rather than flinching.\n\n\"Dealing one damage? You're getting irritated, aren't you? Time isn't on your side.\"\n\nLauel glanced toward the clotheslines. His allies had begun crossing again. Soon Kraugel would be overwhelmed. Even legends were human. They broke under sufficient pressure. Lauel had witnessed it firsthand serving beside Grid. Didn't even the Overgeared King lose his composure under stress?\n\n*Eventually, you'll—*\n\nThe world spun.\n\n\"What?\"\n\nImpact. Ground. Pain.\n\nLauel's brain caught up to his body—he'd been caught off-guard and sent flying. Before he could react, Kraugel's sword plunged into his chest.\n\n*Thunk!*\n\n\"Gah!\"\n\nPon's spear flashed toward Kraugel's exposed side—\n\n*Clang!*\n\n—and met a shield.\n\n**[Defense successful!]**\n**[Damage reduced.]**\n**[You have suffered 1 damage.]**\n**[Shield durability decreased by 1.]**\n\nThe shield was warrior-exclusive gear, one of several items Kraugel had secured during the underground hunt. It guaranteed a blocked attack but lost a point of durability with each use. Maximum durability: ten.\n\nAgainst opponents of this caliber, burning through the shield was worthwhile.\n\n*Snap!*\n\nKraugel caught Pon's spear where it pressed against the shield. Using his body's natural spring, he drove a dagger into Pon's heart.\n\n*Thunk!*\n\n*Thunk-thunk-thunk!*\n\nThree rapid strikes to the abdomen. Somewhere between the first and third, the sword in Lauel had been abandoned and a dagger had appeared in Kraugel's hand.\n\n\"Shit...!\"\n\nEverything had reversed in a heartbeat. Goosebumps crawled across Lauel's skin as he scrambled to help Pon—but Kraugel already had the spearman's throat. He shoved Pon toward the open window.\n\n*Thud!*\n\nKraugel grabbed an ankle, tilted, and released.\n\nPon tumbled into open air.\n\n\"Pon!\"\n\nWhat kind of brutal, realistic combat was this? Chills ran down Lauel's spine as Kraugel dismissed the dagger and drew a fresh sword from inventory. The underground hunting had stocked him well.\n\n\"This space favors Pon's spear work, technically.\" Kraugel's voice was clinical. \"But we're inside a building. From the beginning, your odds were poor.\"\n\n\"You...!\"\n\n*Monster.* The word nearly escaped Lauel's lips. He bit it back, glancing toward the window. His allies were making progress on the clotheslines now.\n\nAnd—\n\n*Whistle!*\n\n—an arrow streaked toward Kraugel. The archers had resumed firing. The battlefield was shifting rapidly.\n\nLauel made his decision in an instant. Instead of engaging Kraugel, he sprinted toward Jishuka—denying her the ability to control the enemy archers. Without her interference, the arrows converged on Kraugel while the clothesline crossers safely reached the window frame.\n\nKraugel raised his shield against the arrow storm rather than attempting evasion. He took a potion while striking at the enemies clinging to the window frame. But potions were even more limited than shield durability. He couldn't hold out forever.\n\nFour enemies fell.\n\nSix made it through.\n\n\"Lauel, you bastard!\"\n\nJishuka shouted as she loosed arrows at the strategist. Lauel barely deflected with his iron fan, impressed she could still shoot after taking a direct hit.\n\n\"Battlefield is excellent training. Thanks to today, the Overgeared Guild will emerge stronger. Consider your trials growing pains.\"\n\n\"Training instructor my ass! You gang up on people like a coward!\"\n\n\"Is that King Grid's influence? You've picked up a lot of Korean profanity.\" Lauel's smile was genuine. \"Still, it's a hundred times better than learning from Huroi.\"\n\nHe'd regained his composure. Jishuka's resistance weakened. Meanwhile, Kraugel fought a siege in that narrow space.\n\n*We're winning.*\n\nLauel watched Soul Predator Seuron engage Kraugel directly.\n\n\"I'll bring you down!\"\n\n*Clang! Clang-clang!*\n\nKraugel's momentum flagged as he parried Seuron's blade. He was exhausted. Holding off over twenty enemies had been impossible from the start. And these weren't ordinary players—they were top-100 rankers, exceptional talents wherever they went.\n\n*I'm sorry, Grid.*\n\nJishuka watched Kraugel accumulate wounds, defeat settling over her like ash. She was tired of needing Grid's help constantly. Bitter frustration welled up.\n\nThen—\n\n\"Ahhh!\"\n\n\"Damn you...!\"\n\nEnemy screams yanked her attention back. Kraugel still fought, eyes unwavering despite his health dropping into single digits. He ignored his own blood, maintaining absolute focus. He gave his all without flinching. The arrows continued hammering from across the street. Six of the strongest warriors pressed him simultaneously. Yet for every wound they carved into him, he dealt two or three in return.\n\n*I can do this too...!*\n\nSomething seized Jishuka's heart. Kraugel's example blazed before her—someone refusing to surrender under impossible circumstances.\n\nShe stepped forward.\n\nAt that exact moment—\n\n*CRASH!*\n\nThe firmly sealed door burst open with violent force. The door from downstairs. The entrance the intruders had been desperately trying to breach. The door Grid had been guarding.\n\n\"Grid...!\"\n\nBoth Jishuka and Kraugel turned toward it simultaneously. Waiting. Hoping.\n\nHow absurd. Could Grid have fought alone against ten enemies? The idea that he'd repelled them all was fantasy.\n\nAnd indeed—\n\n\"What a mess.\"\n\nThe figure in the doorway wasn't Grid. A man armed with a greatsword stepped through.\n\n\"Chris!\" Lauel recognized him, shouting with triumph.\n\n*Grid was defeated?*\n\n*No...*\n\nJishuka and Kraugel were forced to accept reality. Grid must have fallen. The logic was sound—what good were scriptures that restored health when he could only deal one damage per strike? Such a non-threatening offense couldn't eliminate ten elite warriors.\n\nDark clouds gathered on Jishuka's face. Kraugel continued fighting in silence.\n\n\"Well then... good lu—*urk!*\"\n\nChris suddenly coughed blood and dissolved into gray ash.\n\nThen—\n\n\"Seriously, what took you guys so long? I waited forever down there, had to handle everything myself. Whatever, forget it.\"\n\nGrid emerged from the dispersing ash cloud.\n\n\"**Wave.**\"\n\nCrescent-moon flashes erupted from his blade, cutting through multiple enemies simultaneously."
}