{
  "id": 749,
  "title": "Chapter 749",
  "content": "# Chapter X: Deception in Battlefield\n\n\"Wave.\"\n\n*A skill?*\n\nImpossible. Every player in Battlefield started equal—same stats, same abilities. No active skills. Yet Grid's voice rang out clear, announcing one of Pagma's legendary techniques. A myth-rated skill from Satisfy, manifesting in this stripped-down arena.\n\n*A bug? No, that can't be—*\n\nSeuron's thoughts scattered as Grid closed in, blade singing through the air in fluid arcs. The movement looked ceremonial, almost dance-like. Then understanding clicked. Grid's attack was just a basic slash. He'd simply woven the motion into a normal strike.\n\n\"A trick!\" Seuron spat, recovering his composure. Of course it was fake. How could a skill manifest where no system existed to support it?\n\n*Bastard almost fooled me.*\n\nThe Overgeared King. Treacherous to his core, with the cunning of a hundred foxes crammed inside one scheming skull.\n\n*Not exactly kingly behavior.*\n\nSeuron brought his sword up to parry—\n\nThen Grid's blade shifted. Down. Back up. The momentum of an actual wave, crashing against shore.\n\n*What the hell?*\n\n**Chukakakakak!**\n\nThe unexpected trajectory slipped past Seuron's guard. Grid's blade kissed his side, then caught another ranked player standing too close.\n\n[You have suffered 1 damage.]\n\nSeuron's eyes widened as the notification flickered across his vision.\n\n*This level of control?*\n\nEverything Seuron knew about Grid came down to one word: overgeared. A player who leaned on items, whose combat fundamentals were mediocre at best. Sure, Grid wielded equipment like an artist, but his actual fighting ability? Questionable.\n\nThat assessment crumbled to dust in an instant.\n\n*In just one year... he's developed combat instincts like this?*\n\nHeaven-sent talent.\n\n*Another monster for the sky above the sky.*\n\nA chill crawled down Seuron's spine.\n\n---\n\nBehind them, Kraugel watched Grid's technique slice through Seuron's defense. The motion itself was more stunning than Grid's earlier appearance with an impossible stockpile of scriptures.\n\n*He's translating game mechanics into real martial principles.*\n\nGrid had sublimated digital skill into genuine combat technique. Admiration stirred in Kraugel's chest.\n\n*The logic is sound.*\n\nSatisfy's skills defied reality—walking on water, shattering stone with bare hands, flash-stepping across battlefields. Transcendent effects that could never manifest in the physical world. But the *motions* themselves? Those followed earthbound physics. The supercomputer Morpheus had built every skill animation from genuine martial arts theory, drawing from centuries of human combat knowledge. Stylized, yes. Exaggerated, certainly. But fundamentally practical.\n\n*Pagma's Swordsmanship is the perfect example.*\n\n*Sigh.*\n\n*Implementing those techniques here, in Battlefield... the experience he'll gain from this.*\n\nWonderful.\n\nOne word summed up Kraugel's thoughts about Grid.\n\n*The dedication required to memorize, study, and internalize those skills so deeply that muscle memory alone could reproduce them... That's far beyond normal.*\n\nThis moment proved it. Grid wasn't just surviving. He was planning ten steps ahead.\n\n\"Kraugel!\"\n\nThe shout snapped Kraugel's focus back. Grid's eyes flicked right, tracking something behind him. Kraugel tilted left on pure reflex.\n\nA spear hissed past his ear.\n\nOne second slower, and it would've punched through his skull.\n\n\"...The rumors about your eyes in the back of your head seem accurate.\"\n\nGrid's astonishment was genuine. Kraugel shook his head.\n\n\"Instant analysis. Fast judgment. Nothing compared to your foresight.\"\n\n\"Foresight?\"\n\nDid he possess foresight?\n\n*Most ridiculous thing I've heard all year.*\n\nWas Kraugel mocking him? Two arrows streaked toward Grid from the opposite building before he could frown properly.\n\n**Puk puk!**\n\n[You have suffered 1 damage.]\n\n[You have suffered 1 damage.]\n\n\"Kuk...!\"\n\nNo room to dodge. Evading meant creating an opening for Seuron's blade. Grid had to choose: arrows or the sword dancing toward his throat.\n\n\"Che!\"\n\nSeuron's expression twisted with frustration as Grid accepted the arrow hits to maintain his guard.\n\n\"I understand you're cautious of me—Soul Predator Seuron—but can you afford this damage accumulation? You'll turn into a pincushion at this rate.\"\n\n*Oh. So that's Seuron.*\n\nSeuron assumed Grid had recognized him from the start. Excessive confidence. Grid only just placed the name, and honestly didn't care. Seuron was dangerous in Satisfy, sure. But in Battlefield, stripped of equipment advantages?\n\n*He's no Pon or Regas.*\n\n**Jjejeong!**\n\nGrid deflected Seuron's strike and pressed forward.\n\n\"Kill.\"\n\n**Puk!**\n\n\"Kill. Kill.\"\n\n**Puk puk!**\n\n\"Kill. Kill. Kill.\"\n\n**Puk puk puk!**\n\n\"Ugh...?\"\n\n\"Barley.\"\n\n\"?\"\n\n\"A fake! Kill!\"\n\n**Puok!**\n\nEach attack was nothing but a thrust. Simple. Direct. Yet something in the execution made them vicious—the way Grid advanced with each strike, step by inexorable step. Pressure built with every footfall.\n\n*This bastard's drilled that thrust tens of thousands of times.*\n\nSeuron could see the skill embedded in Grid's movements, the confidence born from endless daily training with the blade.\n\n**Chaeng!**\n\n**Chaeeeeeng!**\n\n\"Cough!\"\n\nSeuron gave ground, but he wasn't being demolished. He blocked what he could, countered when openings appeared. Then a massive scream tore from his throat as an arrow punched through his side.\n\n*A mistake?*\n\nAllied archers on the opposite building weren't precision shooters like Jishuka. Accidents happened. Seuron started to dismiss it—\n\n**Puk puk!**\n\n\"These bastards...!\"\n\nSeuron's allies began taking arrows too. The pattern became clear.\n\n\"What the hell are you doing?\" Seuron roared while shoving Grid back, teeth grinding.\n\nThe reply came cold and clear from across the gap.\n\n\"You're dead weight. Just die together.\"\n\nSeven minutes remained in Battlefield. The map was contracting, zone by zone. Soon only one building would stand. The six archers in the opposite building had reached the same conclusion: eliminate everyone before the final collapse—allies and Grid's party alike.\n\n\"Son of a bitch!\"\n\nSeuron's irritation spiked. Across the floor, Lauel grappled with Jishuka alone, his frustration mirroring Seuron's.\n\n*Never imagined it would drag on this long.*\n\nGrid was too massive a variable. Lauel hadn't predicted he'd solo Chris's entire team.\n\n**Puk!**\n\n**Chaeng!**\n\n**Chaeeeeeng!**\n\nChaos. Grid, Seuron, and Lauel fought desperately while arrows rained down from the opposing building.\n\n*There's still hope!*\n\nSeuron refused to surrender. Grid was far more exhausted.\n\n*He's out of potions.*\n\nGrid had torn through multiple competitors already. His supply had to be depleted. Meanwhile, Seuron had one potion remaining—the advantage of superior numbers.\n\n[Battlefield will end in 7 minutes.]\n\n**Kurururung!**\n\nThe notification arrived with a rumble. Part of the map dissolved into void. Now only this building remained. The archer's perch and the clothesline connecting it began crumbling.\n\nSeuron watched the collapse and shouted, \"Let's finish this, then deal with those traitors—urk!\"\n\nTwo or three more hits. Just one successful counter. Grid's limited health would shatter. Seuron calculated, called out—\n\nThen stopped.\n\n**Swaaaaah.**\n\nGrid opened a blue booklet. Light enveloped him. A scripture.\n\n\"You *monster*...!\"\n\nSeuron had guessed Grid was a cleric from the damage output. He'd known Grid secured multiple scriptures to annihilate Chris's party. But he'd assumed they were spent. Shock froze him for a critical instant.\n\nA sword flashed from behind.\n\nKraugel's blade. While Grid held two opponents, Kraugel finished his own fight and joined the assault.\n\n\"Let's end this.\"\n\n\"Pant... pant... yes. Please... finish it.\"\n\nGrid and Kraugel's gazes swung toward the window simultaneously. New enemies crossed the swaying clothesline.\n\n**Kwajajajajak!**\n\nWithout a word exchanged, both yanked spears from the ground and thrust. Perfect synchronization. Perfect judgment. Enemies impaled mid-crossing, bodies tumbling down to vanish against the ground far below.\n\n\"...I surrender.\"\n\nOnly Lauel remained. He recognized the mismatch and dropped his weapon, palms raised.\n\nThe final three survivors of Battlefield: Grid, Kraugel, and Jishuka.\n\n---\n\nShortly after landing in Japan, hundreds of reporters and fans swarmed the South Korean representatives at the airport. The crowd was dense enough to paralyze traffic. Most had come for Grid alone."
}