{
  "id": 750,
  "title": "Chapter 750",
  "content": "# Chapter: Shadows and Spotlights\n\nThe beer arrived without fanfare—a single glass, foam still settling.\n\nRed Deer, Alberta. Eighty thousand people called this southern Canadian town home, yet tonight the streets lay empty. Every television in every bar broadcast the same thing: Battlefield. The National Competition had the entire town transfixed.\n\nWhich meant the black-haired man in dark sunglasses could slip into the shabby pub unnoticed.\n\nHe took his usual seat at the corner booth, far from the other patrons clustered around the television. The bartender—a middle-aged man who'd been running this place alone for years—set the beer down with a knowing nod.\n\n\"You never take those off, do you?\" The bartender gestured at the sunglasses. \"It's been weeks. Jennifer keeps asking about you.\"\n\nThe man they called Ray—half-Korean, half-Canadian, and known in Satisfy as Faker—responded with silence. He raised the glass to his lips, ebony hair falling across his pale face, and drank.\n\nHis attention drifted to the screen.\n\n\"Look at Grid move! Incredible!\"\n\n\"Chris is on another level though.\"\n\n\"That's our boy! Come on, Chris—forget Grid's your king for five minutes!\"\n\nThe other patrons were on their feet, shouting encouragement at the broadcast. On screen, Grid held a stairwell alone, scripture in hand, reading skill descriptions even as Chris pressed the attack. The Canadian powerhouse was winning. The gap in their control skills was obvious.\n\n*But Grid's holding his own,* Faker thought, watching the exchange with clinical precision. *Last year, he couldn't have lasted ten seconds against Chris in Battlefield.*\n\nThe growth was remarkable. Not raw talent—Grid had never been naturally gifted. This was pure, relentless effort made manifest.\n\nFaker's lips quirked upward. He didn't realize he was smiling.\n\n\"What the hell?\"\n\n\"Is Chris... retreating?\"\n\nThe momentum shifted. Grid stopped reading. He exploded forward, and suddenly Chris was backpedaling. One by one, the other rankers fell. Grey light bloomed across the screen as players were eliminated.\n\nFaker's gaze tracked a specific figure: Yura. Korean representative. Demon Slayer. And right now, subtly sabotaging Chris.\n\nEvery time Chris moved to counter Grid's attacks, Yura was there—blocking his path, forcing him wide, creating fractional delays. The interference was masterful. Even the other competitors hadn't noticed. Only Chris knew, and judging by his frustrated expression, he couldn't do anything about it.\n\n\"The Young Master's in trouble...\" A new voice, aged and refined. \"Yura's heart belongs to Grid, I'm afraid.\"\n\nFaker turned.\n\nThe old man settling into the booth across from him had immaculate white hair and carried himself with the bearing of nobility. Zirkan. Former first-ranked swordsman. Chris's mentor. Captain of the Giant Guild. Now a pillar of the Overgeared Kingdom.\n\n\"Why aren't you in Japan?\" Faker asked bluntly.\n\n\"You're not surprised I found you.\"\n\n\"Your family owns half of Alberta. Of course you found me.\"\n\nZirkan chuckled, setting his cane aside. Despite his age, the old man's shoulders were broad beneath his coat, muscles still defined. \"Long-distance travel is harder these days. Better I rest than become a burden.\" He tapped his knees. \"Besides, Grid doesn't need my help. The man's blessed—surrounded by beautiful women who'd move heaven and earth for him. I'd be jealous if I were ten years younger.\"\n\nThere was no bitterness in his tone when he mentioned Yura's interference. She was Overgeared. She loved Grid. From Zirkan's perspective, that was enough.\n\n\"Love is a wonderful thing,\" the old man mused, signaling the bartender. \"Coke, please.\"\n\n\"Coming right up.\"\n\nThe bartender seemed genuinely pleased to see Faker had company. He'd been serving the quiet Asian man for years now—always alone, always in sunglasses, always polite. It was good to see him with a friend.\n\n\"You'll have to forgive the soft drink,\" Zirkan said apologetically. \"My body can't process alcohol like it used to. Old age is a cruel master.\"\n\n\"Then why travel from Toronto?\"\n\n\"Because I thought you'd be lonely.\"\n\nFaker went still.\n\n\"You have more talent than anyone I've ever met,\" Zirkan continued quietly. \"More drive than Chris. More dedication than Grid. You could stand in the sun—win medals, take the stage, claim your place among legends.\" He paused. \"But you can't. Your position in the Overgeared Kingdom requires you to remain hidden. You can't compete publicly. So you sit here, watching others claim the glory you've earned.\"\n\n\"...\"\n\n\"Your blood must be boiling.\"\n\nThe old man had seen right through him.\n\nFaker took another sip of beer. \"I can control myself. The public knows I exist. That's enough.\"\n\n\"Excellent.\" Zirkan's smile was warm, almost paternal. \"You're wiser than I was at your age.\"\n\n\"You have regrets.\"\n\n\"Many.\" The old man's gaze grew distant. \"I retired too early. Convinced myself I was too old for international competition, that I should focus on teaching Chris. But I loved it—the game, the spotlight, the thrill of competition. Last year, when my rusty skills kept me from qualifying...\" He shook his head. \"I came here thinking you'd feel the same frustration. I was wrong. You've already found peace with your choice.\"\n\nFaker's eyes returned to the television. Grid was carving through opponents like a scythe through wheat. \"I learned about hard work from Grid.\"\n\n\"Oh?\"\n\n\"I was always diligent. Tenacious. But I had limits—lines I wouldn't cross, boundaries defined by common sense.\" Faker's voice was soft, contemplative. \"Watching Grid changed that. He has no limits. He'll do whatever it takes. That taught me to do the same.\"\n\n\"And now you can defeat sun-grade powerhouses.\"\n\n\"Now,\" Faker agreed, \"I don't need the sun. Grid can be king in the light. I'll be king of the shadows.\"\n\nZirkan studied the young man across from him—the dark sunglasses, the subtle smile, the absolute certainty. He saw the ghost of another face, another legend from Korea's golden age of gaming.\n\n\"Your grandfather would be proud,\" the old man said quietly.\n\nFaker didn't respond.\n\n\"You know what?\" Zirkan called to the bartender. \"Bring me a beer. It's not every day I get to drink with a legend's grandson.\"\n\n---\n\n\"GRID-SAMA!\"\n\n\"GOD GRID! GOD GRID!\"\n\n\"YURA! YURA! YURA!\"\n\nThe airport terminal erupted.\n\nPeak Sword whistled low, watching security scramble to establish a perimeter. He'd expected fans. He hadn't expected *this.*\n\nTens of thousands of people packed the arrivals area—and they were all Japanese. Here to see Grid and Yura. The roar was deafening.\n\n*We really are going global,* Peak Sword thought with satisfaction. As chairman of the Korean Patriotic Association, he felt personally vindicated. *Small population, massive impact. That's Korea for you.*\n\n\"Um...\" He nodded sagely to himself, then realized the reporters had broken through security.\n\n\"Player Grid!\" A journalist thrust a microphone forward. \"Analysts say your control skills have improved dramatically. What's the secret?\"\n\nGrid adjusted his helmet—he'd worn it through immigration to avoid attention, which had obviously failed. \"I was always skilled. The items just overshadowed it.\"\n\n\"The Overgeared Kingdom recently signed an agreement with the Saharan Empire—the first West Continent nation to do so. How will this backing change your strategy?\"\n\n\"It's a temporary truce, not an alliance. I wouldn't describe the empire as 'backing' me.\"\n\n\"Do you enjoy Japanese culture? Manga, perhaps?\"\n\nGrid cleared his throat awkwardly. \"I... appreciate baseball videos.\"\n\n\"The Japanese Baseball League? Which team?\"\n\n\"Es... Oh... Di?\"\n\n\"I'm sorry?\"\n\n\"I mean—\" Grid's face was turning red beneath the helmet. \"I support all the teams. Equally. Very equally.\"\n\n\"How magnanimous! As expected of a king!\"\n\n\"What's your favorite food?\"\n\n\"Wraps.\"\n\n\"You mean lettuce wraps with grilled meat?\"\n\n\"Canned tuna with lettuce and hot sauce.\"\n\n\"...Excuse me?\"\n\n\"I don't really like meat mixed with vegetables. The flavors clash, even with expensive beef—\"\n\n\"OKAY!\" Peak Sword physically inserted himself between Grid and the microphones. \"That's enough for today! King Grid needs rest after his historic victory!\"\n\n---\n\n**The Next Morning**\n\nSigns appeared in convenience stores across Tokyo:\n\n【SOLD OUT: Lettuce, Canned Tuna, Red Pepper Paste】\n【We apologize for the inconvenience. New stock arriving soon.】\n\nA new Korean dish had been born. Such was the ripple effect of stardom."
}