{
  "id": 753,
  "title": "Chapter 753",
  "content": "**Thud.**\n\nA dark blob splattered across the marble floor—chocolate pudding, falling from Grid's slack fingers.\n\nThe South Korean team's waiting room buzzed with low conversation, but Grid heard none of it. His eyes remained fixed on the monitor, unseeing, as the expensive dessert he normally wouldn't even consider purchasing pooled at his feet.\n\n\"Grid? Hey!\" Peak Sword shook his shoulder. \"Grid!\"\n\nNo response. Peak Sword's concern deepened. Six empty pudding cups sat beside Grid's chair—six consecutive servings of the most expensive item in the complimentary refreshment spread.\n\n\"I told you not to inhale that much sugar at once!\" Peak Sword grabbed both shoulders now, shaking harder. \"You can't just keep saying 'free stuff is the best' and— Grid! Look at me!\"\n\nThe other Korean representatives watched this scene with barely concealed bewilderment. Before today, Overgeared King Grid and Peak Sword had existed in their minds as legends—towering figures worthy of reverence. The younger rankers especially had built them up as untouchable idols.\n\nThe reality playing out before them shattered that image completely. They looked less like heroes and more like...well, a couple of neighborhood idiots.\n\nAnd yet no one felt disappointed. If anything, the lack of pretense made them more approachable. Better this than suffocating formality.\n\n\"I'm fine.\" Grid finally blinked, awareness returning to his eyes as he refocused on the screen. \"Just thinking.\"\n\nOn the monitor, Yura moved through a monster-infested zone, gathering Proofs of Strength with ruthless efficiency.\n\n\"She's really something,\" Grid murmured.\n\nHe hadn't voiced it aloud, but he'd worried about her. Yura had been dominant for so long—how devastating must it have been to struggle for over a year after becoming a Demon Slayer?\n\n*Demon Slayer.*\n\nA conditional class. Exceptional power in specific circumstances, worthless outside them. Perfect for someone like Grid, who'd always had to specialize. But for Yura? Someone with the talent to excel in any field? It was a cage. A self-imposed limitation on someone who could have soared anywhere.\n\n*I would've regretted that choice.*\n\nBut Yura hadn't. She'd walked her path alone, refusing help, and descended into Hell itself. And this was the result—her return to dominance at the National Competition.\n\n\"All that effort...\" Grid shook his head in admiration.\n\n\"Grid...\" Peak Sword's expression turned solemn as he pressed a tissue into Grid's hand. \"Wipe your mouth.\"\n\n***\n\n[The Crystal Skeleton has been defeated.]\n\n[All Proofs of Strength acquired. Visit Andrew Village and meet the Chief to receive the second verse of the Saint Sword's Song.]\n\nYura dismissed the notification, her mind already racing ahead.\n\n*Can't cross paths with Kraugel.*\n\nHad he finished collecting his proofs already? Or was he still hunting? Based on her calculations, he'd finished at least thirty minutes ago.\n\n*If I head straight for the village, he'll be waiting.*\n\nShe hated admitting it, but even among legendary classes, Sword Saint Kraugel operated on another level. That moment earlier when he'd nearly tagged her—the pressure of it still made her hands shake. If she'd drawn her gun even a second later, he would've landed the hit. His ability exceeded her worst estimates.\n\n*If only Hell Leap was more reliable...*\n\nA hidden quest reward. Her trump card. And completely unstable.\n\nHell Leap temporarily relocated the caster *somewhere* in Hell. Anywhere in Hell. No control, no precision—just a blind jump into one of the most hostile dimensions in Satisfy. At best, she'd land in an empty corridor. At worst? Directly into a great demon's throne room. Or onto a lake of hellfire.\n\nThirty minutes ago, she'd used it to escape Kraugel and materialized at the gates of the 15th Great Demon's castle. A crimson demonkin guard had been on her before she could orient herself, and even her legendary passive couldn't fully resist the absolute petrification effect. Her body still felt sluggish, agility crippled.\n\n\"Damn it.\"\n\nShe was weaker than Kraugel. Same legendary class, higher level—she'd broken 300 before the competition even started, while he was still mid-200s. None of it mattered in a straight fight.\n\n*Stop making excuses.*\n\nClass wasn't everything. Kraugel had proven that when he beat Grid with a normal class.\n\nYura steeled herself, pushing into a sprint toward Andrew Village.\n\n*Can't keep avoiding him. Not if I want the gold.*\n\nThe Saint Sword Drawing meant nothing if she kept running. Eventually, she'd have to face him.\n\nShe just hoped Grid's support had brought her enough luck to make it count.\n\n***\n\n\"They're at it again.\"\n\n\"Yura's got guts, I'll give her that.\"\n\n\"This time looks bad though.\"\n\nTwo and a half hours into the event. Most participants had reached the third verse of the Saint Sword's Song. Kraugel and Yura had reached the final verse—and were facing each other for the sixth time.\n\nSix confrontations. Each one worse for Yura than the last.\n\nKraugel's adaptability was inhuman. Fight by fight, he dissected the Demon Slayer class, identified its patterns, and methodically neutralized her advantages. Now Yura couldn't even mount a proper offense. Her only option when they met was immediate retreat—Hell Leap, no hesitation, no looking back.\n\nAnd every time she used it...\n\n\"Wait, what?\"\n\n\"Is she summoning demonkin now?\"\n\nThe audience recoiled. Yura vanished in crimson light and reappeared through a black portal—with something latched onto her shoulder. At first glance, it looked like a summoned creature.\n\nThen they noticed the thing was *biting* her, tearing into her flesh.\n\n*What?*\n\nCommentators, spectators, even Kraugel himself paused in confusion.\n\nIt only took a few moments for understanding to dawn.\n\n*She's been going to Hell. Every single time.*\n\nLooking back through the footage, the signs were obvious. Each time Yura reappeared, she bore fresh injuries or status conditions. Her \"teleport\" wasn't teleportation at all—it was a blind drop into a hostile dimension.\n\n\"That skill's insane,\" Kraugel said, an edge of respect in his voice. \"And not in a good way.\"\n\nYura's expression didn't flicker. She tore the demonkin off her shoulder and leveled her gun at him in one fluid motion.\n\n\"I don't know what you mean.\"\n\nShe needed distance. Time to recover enough resources to risk another Hell Leap. Kraugel read the intent and closed in, but Yura hadn't earned her reputation for nothing. She was the best female player in the world for a reason—and she sure as hell wasn't letting him corner her that easily.\n\n***\n\n\"Kraugel's such a bastard!\"\n\nGrid's agitation had only grown over the past hour. Watching Kraugel hunt Yura instead of focusing on the quest objectives made his blood boil.\n\n\"Why can't they both medal? Why does he have to monopolize everything?\"\n\n\"Because he respects Yura's skill,\" Eat Spicy Jokbal said, not looking away from the screen. \"If he gives her an inch, she might take the gold from him.\"\n\nThe woman in the hanbok beside him—Viola—nodded thoughtfully. \"That woman is dangerous.\"\n\nKraugel clearly held the advantage. But the gap between them wasn't overwhelming—and historically, only Grid had ever pushed Kraugel this hard. In the eyes of the audience, Yura's skill was close enough to be threatening.\n\n\"What the hell is that Hell Leap skill, though?\"\n\n\"Right? I thought it was just a broken mobility skill, but now she's pulling out monsters.\"\n\nYura escaped again, vanishing into the forest and slipping Kraugel's pursuit. Grid released a breath he hadn't realized he'd been holding and reached for a soda—\n\n\"Excuse me.\" A security guard approached. \"You have a visitor.\"\n\n\"A visitor? Now?\" Grid frowned. \"Who?\"\n\n\"Panmir. From the American team.\"\n\n\"...What?\"\n\nPanmir. First-ranked blacksmith since Satisfy's launch. The man who'd goaded Grid into the blacksmithing event last year.\n\n*Is he here to do it again?*\n\nSuppressing a laugh, Grid rose and headed for the hallway. Panmir wasn't someone to ignore. Grid respected his position—but he didn't fear the man. He'd studied Panmir's work extensively. He understood the quiet desperation in Panmir's eyes, the sense of being forever second-place to a legendary blacksmith. Panmir was someone who required careful handling.\n\n\"Been a while,\" Grid said as he spotted Panmir waiting in the hall.\n\nPanmir looked older than last year—more grey in his hair—but his build remained solid, his eyes sharp. He carried himself like Khan might have fifteen years ago.\n\n\"I'll get straight to it.\" Panmir didn't bother with pleasantries. \"This year, I'm going to beat you.\"\n\n\"...\"\n\n*That's it? You came here just to—*\n\nGrid's irritation must have shown, because Panmir pressed on quickly.\n\n\"Beating you doesn't mean I'm better. You are—your craftsmanship, your dedication to manually forging each piece—that's beyond me. But I can still win.\" He pulled out a thin booklet. \"Because they rigged the rules against you.\"\n\nThe blacksmith event regulations had changed this year. Last year, all participants crafted the same item to the same specifications. This year? Total freedom—any item, any design. And the judging criteria had shifted dramatically.\n\nLast year's competition judged \"comprehensive value\"—overall stats and functionality. This year? Pure rating. Legendary item beat epic, epic beat unique, unique beat rare. Period. Even growth-type items would be judged on their *initial* rating. A normal-rated sword that could eventually become legendary? Still just normal.\n\nPanmir's gaze bore into Grid.\n\n\"You've already figured it out, haven't you? They changed the rules specifically to handicap you.\"\n\nIf judging came down to stats, Grid won every time. His items consistently had higher numbers than equivalently-rated gear. So they'd removed stats from the equation entirely.\n\n\"Changing the rules to target one competitor...\" Panmir shook his head. \"If I were you, I'd be furious. So I wanted you to know—when you lose to me in this event, it won't mean you're the weaker smith. It just means the organizers screwed you.\"\n\n\"...What are you getting at?\"\n\n\"I don't want you taking it personally when I win. You're not worse than me. You're just fighting an unfair system.\"\n\nGrid stared at him, momentarily speechless. The sheer confidence—and worse, the sincerity behind it. Panmir genuinely believed everything he was saying. And he'd come here out of some misguided sense of honor to warn Grid about it.\n\nA wry smile crossed Panmir's face.\n\n\"I hit level 280. Completed three hidden quests. I now have a 0.01% chance to produce legendary-rated items. And my floor is epic-rated—nothing I make drops below that. I can create utterly fraudulent items now. So...prepare yourself mentally. Just so you're ready.\"\n\nHe turned to leave.\n\nGrid stood alone in the hallway, scratching the back of his head.\n\n\"So...you came here because you're worried about me?\"\n\nHe'd always known Panmir had exceptional skill. He just hadn't realized the man possessed this much grace. Or anxiety.\n\n*Sorry, Panmir.*\n\nGrid wasn't going to show mercy. And Panmir had absolutely no idea about the surprise Grid had waiting for him."
}