{
  "id": 757,
  "title": "Chapter 757",
  "content": "\"High rankers like that exist in South Korea?\"\n\n\"Cloud didn't stand a chance...\"\n\nSilence hung over the US waiting room. Their team had walked away from today's group events without a single gold medal—a catastrophic result that sent shockwaves through their overall standings. Canada had overtaken them. The subjugation expedition had been their chance to recover, their ace in the hole. Cloud, Zibal's right-hand man, was supposed to secure that victory. Nobody had questioned it.\n\nInstead, three unknown Korean players had crushed him.\n\nWhile the other representatives sat in stunned disbelief, Skull leaned forward, eyes narrowed in concentration. As the US's perennial top-ten ranker—a position he'd held for four consecutive years—his analytical eye caught what others missed.\n\n\"Perfect synergy,\" he murmured.\n\nMa Bongshik wielded his spear to inflict chill, slowing enemies and sapping their strength. Viola's magic amplified the cold to devastating effect. Then Dark—that ridiculous username aside—finished them with overwhelming physical power. Individual skill was one thing, but this level of coordination? That only came from years of fighting together.\n\n*Grid and Kraugel won't have an easy time against them.*\n\nSkull glanced sideways and found Kraugel watching the replay, those dark eyes gleaming with unmistakable interest.\n\n*That's the look.*\n\nA smile tugged at Skull's lips. Korea hadn't lost its edge. The gaming DNA that once dominated e-sports was alive and well.\n\n***\n\nChris's hands clenched on the armrests of his chair.\n\nUnlike his Canadian teammates, he already knew who Dark was—Grid had mentioned him more than once. But knowing *of* someone and watching them decapitate Henry in a single exchange were two entirely different things.\n\n*Just from the attack power alone...*\n\nChris ran the numbers in his head. Dark's strength stat had to rival or exceed his own. Impressive, considering Dungeon Maker wasn't even a combat-focused class. The skill list was sparse, lacking the offensive arsenal of a warrior or knight. Which meant that devastating damage output came from raw stats alone.\n\n*The class itself explains it.*\n\nDungeon Makers functioned as architects—similar to production classes like blacksmiths or tailors, except instead of crafting items, they built structures. Every completed building granted permanent increases: +2 strength, +2 stamina. Not flashy. Just reliable, incremental power that never stopped growing.\n\n*No wonder Grid and Peak Sword have been trying to recruit him.*\n\nDark's combat fundamentals were rock-solid. Paired with teammates who covered his weaknesses, he'd be a nightmare in PvP. He hadn't become Blood Carnival's leader by accident.\n\nChris leaned back, a competitive fire kindling in his chest. *Fighting him in his own dungeon... now that would be interesting.*\n\nThe rookie had captured everyone's attention today—rankers and casual viewers alike. One hell of a debut.\n\n***\n\n『 South Korea takes the gold! That's two gold medals in the team events—Building Walls and Subjugation Expedition! 』\n\n『 Absolutely unprecedented! Nobody predicted this outcome... 』\n\n『 This changes everything. The United States hasn't won a single team gold today. Canada missed their chance to pull ahead. Even China's momentum has stalled. 』\n\nSouth Korea had thrown a wrench into the entire competition. The overall rankings, once predictable, were now anyone's game.\n\n**Canada:** Gold (5), Silver (5), Bronze (1)  \n**United States:** Gold (4), Silver (5), Bronze (2)  \n**China:** Gold (3), Silver (1), Bronze (1)  \n**South Korea:** Gold (2), Silver (1), Bronze (0)  \n**United Kingdom:** Gold (1), Silver (2), Bronze (4)  \n**Japan:** Gold (0), Silver (1), Bronze (3)  \n**France:** Gold (0), Silver (0), Bronze (3)  \n**Brazil:** Gold (0), Silver (0), Bronze (1)\n\nTwo golds had launched South Korea into fourth place. With Yura, Peak Sword, and Grid still waiting in the wings, a top-three finish seemed suddenly, impossibly within reach.\n\nThe complete reversal sent the Korean internet into hysterics.\n\n\"Every year these competitions get better!\"\n\n\"Grid carried us the last two years, but this time we've got fresh blood!\"\n\n\"We're actually getting the National Competition buff this year! Finally!\"\n\n\"Forget chicken—I'm ordering spicy pork trotters for the rest of the competition!\"\n\n\"Did you see Ma Bongshik? I didn't even know you could spec that hard into Chill. Most people treat it like a garbage skill.\"\n\n\"Takes vision to build like that.\"\n\n\"None of this works without Viola, though. Conjurer is insanely difficult to play.\"\n\n\"First time I've even seen one at this level.\"\n\nWhile South Korea celebrated, China mourned.\n\nThe world's most populous nation—1.5 billion people—watched their team falter and couldn't process it. How? How did a country of fifty million keep beating them?\n\n\"Are we seriously going to place lower than South Korea *again*?\"\n\n\"It's humiliating! We should dominate them in every metric!\"\n\n\"Do Koreans just have better genes for gaming or something?\"\n\nNational pride, already bruised, took another battering. Zhang Zheng felt it more acutely than most. Born into privilege, raised to believe in China's inherent superiority, he'd clawed his way onto the world stage expecting validation.\n\nInstead, he got humiliation.\n\n\"Not even a silver medal.\" His voice came out flat. Cold.\n\nChina had advanced to the semifinals. They'd been one of the final four teams. Victory over South Korea—the team that had already eliminated the US and Canada—should have been guaranteed. Should have been *easy*.\n\nReality, as always, proved cruel. The Koreans had trampled them, eliminating China first and denying them even a bronze medal. All three Chinese representatives were top-five rankers domestically. The loss stung.\n\nZhang Zheng's hand shot out, fingers closing around his teammate's throat.\n\n\"You think you can bring this disgrace to our nation and just walk away?\" His voice dropped to a venomous whisper. \"Do you?\"\n\n\"Kek! Kekek!\"\n\nEveryone in Chinese gaming circles knew: Zhang Zheng was unhinged. His father's political connections insulated him from consequences, letting him say and do whatever he wanted. Rumor had it he carried a knife everywhere. Rumor also had it he'd used it.\n\nThe blade appeared now, gleaming in his free hand as he pressed it against his teammate's cheek.\n\n\"Let him go.\"\n\nZhang Zheng's head snapped around. Hao stood three feet away, utterly calm.\n\n\"They fought hard. This isn't their fault.\"\n\n\"Hao...!\" Bloodshot eyes locked onto the other man. Zhang Zheng's grip tightened, knuckles white. Every fiber of his being wanted to drive the knife home, to make Hao pay for the disrespect—\n\nBut Hao didn't even blink.\n\nNo fear. No hesitation. The knife meant nothing. Zhang Zheng's family connections meant less.\n\n\"Tch.\" He released his teammate and stepped back, lowering the blade. \"Isn't this funny? You're lecturing *me*?\" A mocking laugh bubbled up. \"You're the one who kneeled to Korean dogs twice. Maybe you should just move there.\"\n\n\"Keep talking and you'll regret it.\"\n\n\"Oh? Scary!\" Zhang Zheng raised his hands in mock surrender. \"What'd I say? I'm just thinking out loud here.\"\n\n\"Trash.\"\n\nHao turned away, done with the conversation. He headed for his seat.\n\nZhang Zheng's voice followed him. \"Hey, you know people hate you, right? Surrendering on the world stage like that? Kneeling in front of everyone?\" His tone turned sing-song. \"Better get some results this year, or you might catch a knife in the back. Just saying.\"\n\nHao's jaw tightened. It wasn't a threat—threats implied bluffing. Zhang Zheng spoke simple fact. \n\nHe'd surrendered to Grid twice now: last year's competition and this year's Battlefield. The optics were terrible. If he went home empty-handed again, someone would make him disappear. China was vast, and vast places bred plenty of people crazy enough to play assassin.\n\nSilence seemed the wiser option. Hao settled into his chair.\n\n\"Me, though?\" Zhang Zheng's grin widened. \"People will love me. Yeah... I'm going to break that Grid you keep bowing to.\"\n\nMoney and power had built Zhang Zheng an empire. Over a hundred high-level players worked in his workshops, grinding raids around the clock. He claimed the best loot, equipment, and resources. Currently, he sat at the highest level among Chinese players with gear to match.\n\nHao closed his eyes. *Grid. Be careful.* \n\nZhang Zheng had registered for PvP this year. If Grid lost to him, the insults would be merciless.\n\n*I'm worried about Grid instead of my own country.*\n\nThe realization brought a bitter smile. Maybe he *did* deserve the traitor label.\n\n***\n\n\"How does it feel?\"\n\nDark swaggered back into the waiting room, gold medals gleaming against his chest—one for each event. The other Korean players pressed forward, eyes bright with admiration.\n\n\"That was incredible!\"\n\n\"Seriously amazing!\"\n\n\"Okay, when I first saw your username, I thought— Uh. Never mind. You're awesome!\"\n\n\"Huhuhut!\" Dark's chest puffed out, basking in the praise.\n\nGrid approached, hand extended. \"Well done. Congratulations. And thank you.\"\n\n\"Um... ahem!\" Dark stopped mid-reach, suddenly giving Grid the cold shoulder. \"Don't misunderstand. I didn't win this medal for *you*.\"\n\nOld wounds ran deep. Grid had dismantled Blood Carnival. Grid had claimed the insane dragon egg. Dark lacked the strength to challenge him over it, but that didn't mean he'd forgotten. Friendliness wasn't on the table.\n\nViola sighed and stepped forward, covering for her teammate.\n\n\"Dark's always been petty. Your Majesty, please be understanding.\"\n\n\"...\"\n\nShe'd maintained a pleasant demeanor with Grid throughout the entire competition. As Dark got mobbed by the other players, Grid lowered his voice.\n\n\"You're not angry with me?\"\n\n\"Of course I'm angry. You destroyed our operation.\"\n\n\"...\"\n\n\"But anger doesn't mean I want revenge. From what I've seen...\" Her eyes gleamed. \"You can offer us opportunities far more lucrative than what we lost.\"\n\nSharp. Grid wanted Dark and his team in the Overgeared Kingdom. Their addition would dramatically increase the guild's strength, and Viola had clearly figured that out.\n\n\"You read people well. I do want you. We could help each other significantly.\"\n\n\"I agree. But—\"\n\nShe glanced toward Dark, who was laughing with the other players.\n\n\"—he's the problem. We won't be joining until he opens up to you.\"\n\nGrid nodded slowly. That tracked.\n\n\"There's someone else, too.\" Viola's expression turned serious. \"The princess will hate you even after she wakes up. So... we probably won't be able to join for a while.\"\n\n\"Princess?\"\n\n\"Youngest founding member of Blood Carnival. Pretty college girl. Very fierce.\" A wry smile. \"Watch yourself around that one. She bites.\"\n\n***\n\nDay two concluded with China, England, and Mongolia claiming gold in the individual events that followed the team competitions.\n\nThe Truth Game—where players had to win over ten NPCs using only in-game social clues—had made Grid nervous when Huroi registered. His retainer had a... reputation. But Huroi performed beautifully, charming every NPC with grace and eloquence. Not once did he insult anyone's parentage, despite clear frustration.\n\nGrid found himself reminded that Huroi's class was Orator, not \"professional trash-talker.\"\n\nNine events remained. Tomorrow, the third National Competition would conclude.\n\nAnd tomorrow, the heavy hitters would finally take the stage.\n\nGrid flexed his fingers, feeling the familiar weight of anticipation settle across his shoulders. Yura stretched nearby. Peak Sword cracked his knuckles. Toon checked his equipment one last time.\n\nSouth Korea's strongest were ready."
}