{
  "id": 761,
  "title": "Chapter 761",
  "content": "# Breaking the Hero\n\nSeven players from six countries stepped onto the competition stage. At its center stood a black-haired man, his expression utterly indifferent.\n\n\"Are you challenging me?\"\n\nThe Hero.\n\n***\n\n*Breaking the Hero*—the event Peak Sword had registered for. A straightforward time-attack format: defeat the Hero in single combat as quickly as possible. Simple in concept, yet this year's debut had generated massive public anticipation.\n\nThe reason? The Hero's identity.\n\nKraugel. Winner of the 2nd National Competition's PvP tournament.\n\nTo be precise, this Hero was a doppelganger—a perfect replica of Kraugel's stats and skills from one year and three months ago. How many of this year's competitors could stand against last year's strongest player? The premise alone had captured public imagination long before the 3rd National Competition even began.\n\n『The roster is impressive—Chris from Canada, Damian and Katz from Japan, Pon from Spain, Regas from the United Kingdom... But why only seven participants? Far fewer than expected.』\n\n『That's Kraugel's majesty for you. Even his year-old ghost is still recognized as \"the best.\" Who would dare challenge that? I'd say seven contestants is surprisingly high.』\n\nThe experts' analysis, however, missed the mark entirely.\n\nThe real reason elite players avoided *Breaking the Hero* had nothing to do with fear.\n\n\"What's the point of knocking down a ghost of the past?\"\n\nIn Argentina's waiting room, Soul Predator Seuron sneered at the participant list displayed on screen.\n\n\"Pathetic losers. Real heroes compete in PvP.\"\n\nHe wasn't alone. Top rankers from every nation shared similar contempt for the event. What value was there in defeating last year's Kraugel? This year's Sword Saint would be leagues beyond his former self. True strength meant facing *this* year's Kraugel in PvP and emerging victorious.\n\n*Breaking the Hero is just refuge for cowards who won't challenge the real thing.*\n\nNone of them realized that every single participant was connected to the Overgeared Guild.\n\n***\n\n\"So. Here we all are.\"\n\nChris—rank one on the unified rankings—greeted his fellow competitors. His decision to enter *Breaking the Hero* instead of PvP had shocked many observers.\n\nPon. Regas. Peak Sword. Katz. Ibellin. Damian.\n\nAll Overgeared members, except for Damian—who happened to be Grid's most devoted fan. Every person who'd chosen this event over PvP shared one crucial piece of knowledge: they'd witnessed the power of Grid's new weapon, the Enlightenment Sword.\n\nDamian in particular had died to it.\n\nThey weren't here because they feared Kraugel's doppelganger. They were here because Grid was *terrifying.*\n\n\"But...\" Katz ignored the others, directing his question at Peak Sword and Ibellin specifically. \"Isn't this a bit out of your league? Taking on Kraugel?\"\n\nA realistic assessment, not an insult. Peak Sword's combat style—massive damage with equally massive cooldowns—was suicide against Kraugel's agility. As for Ibellin, talented as he was, he remained inexperienced. Kraugel's techniques would overwhelm him.\n\nIbellin's eyes burned with determination. \"I don't believe I can win! But this is my chance to measure myself! I'll use today's challenge as a stepping stone!\"\n\nPeak Sword's response was more... Peak Sword.\n\n\"Huh. Japanese sure have pointless concerns. Don't waste your energy on me.\"\n\nChris laughed. \"Confidence is good. But it won't be easy—you do realize? Getting gold past me is going to be damn near impossible.\"\n\nHe carried Canada's hopes on his shoulders. A gold medal here would exponentially increase their chances of claiming first place overall. Obligation and desire burned in his eyes as he regarded the others, igniting their competitive spirits in turn.\n\nCamaraderie sharpened into rivalry. Apart from Peak Sword and Ibellin, the participants acknowledged as national powerhouses exchanged glances that could start fires. Yet when those same eyes turned to Peak Sword and Ibellin, they softened with unmistakable *pity.*\n\nPeak Sword felt the isolation keenly. Still, his voice remained steady.\n\n\"...Today, I'll show you South Korea's spirit.\"\n\n***\n\n『Chris and Damian have roughly an 80% chance of winning *Breaking the Hero*.』\n\n『Absolutely. They've been compared to Kraugel since last year for good reason. Chris holds rank one globally, while Damian's been Pope for years. Defeating last year's Kraugel shouldn't be difficult for either—it's purely a question of speed.』\n\n『Chris's explosive greatsword damage gives him the edge over Damian's approach. After those two, Katz has decent odds if he can use his blood control to neutralize the Hero's agility.』\n\n『Pon and Regas, though... questionable. Their strength lies in control, same as Kraugel. Fighting the peak of control is an uphill battle.』\n\n『Peak Sword and Ibellin are highly likely to be eliminated.』\n\nPre-match speculation ran rampant. Peak Sword's evaluation was particularly harsh. His class's inherent characteristics created a natural disadvantage against Kraugel. With gaps between attacks, defeating such an opponent seemed impossible.\n\nKorean viewers couldn't argue otherwise.\n\n\"It'll be brutal for Peak Sword.\"\n\n\"He's incredible in team support, but solo? Too many vulnerabilities. Against Kraugel? No chance.\"\n\nHope for South Korea's first-place finish seemed to evaporate. \n\nGrid, however, thought differently.\n\n*Peak Sword has the highest possibility of winning.*\n\nHe knew exactly what last year's Kraugel had been—remembered with perfect clarity.\n\n*Paper-thin defense. Just needs to land one clean hit.*\n\nBloodstone. The supreme mineral Grid had earned as last year's competition reward. Iyarugt's Sheath, forged from that very bloodstone, paired with Peak Sword with devastating synergy. Unintentional, perhaps, but the result spoke for itself.\n\n*Thump-thump. Thump-thump.*\n\nGrid's expectations soared.\n\n***\n\n『OVERWHELMING ATTACK POWER!!』\n\n*CLANG! CLANG!*\n\nChris, first challenger, performed exactly as expected. He deflected the Hero's swift strikes while retaliating with crushing greatsword blows.\n\n*THUD!*\n\nThe greatsword connected. The Hero staggered.\n\n\"Guh!\"\n\nDanger. The Hero activated Super Sensitivity. Evasion and accuracy spiked instantaneously. Last year's Chris couldn't have handled this state. But this year's Chris—who'd maintained rank one through relentless hunting, who'd encountered Super Sensitivity repeatedly during his \"Great Swordsman Hunting\" hidden quest—responded with the wide-area devastation of his Tyrant class.\n\nIn the end—\n\n*CRASH!*\n\nChris shattered the Hero. Nineteen minutes. The Hero dissolved into grey light—twenty minutes faster than Grid's defeat by Kraugel the previous year. A strong candidate for gold, without question.\n\n\"Damn. That was something.\"\n\n\"Really drives home how much one year means.\"\n\nLast year, Kraugel versus Grid had felt transcendent—a battle on another dimension. Kraugel had emerged victorious. Now, one year and three months later, last year's Kraugel looked almost... ordinary. Subdued by the current rank one in under twenty minutes.\n\nEveryone contemplated the weight of time's passage as Damian approached the stage.\n\nThe Hero fell again. Damian leveraged his paladin's defense, layered buffs, and papal abilities to secure victory in twenty minutes and fifty-five seconds. Two minutes slower than Chris.\n\n\"Ugh... gold medal...\"\n\nFrustration tightened Damian's features.\n\n*What a monster...*\n\nChris and the other participants gaped. Damian's attack power rivaled major damage dealers wielding greatswords, while his defense exceeded theirs several times over.\n\n*After watching Grid beat him senseless...*\n\n*...I had no idea he was this strong.*\n\nThe Overgeared members silently pledged never to make an enemy of Damian.\n\nThen—\n\n\"I'm next.\"\n\nThe third challenger stepped forward. Peak Sword mounted the stage to zero expectations.\n\n*This pressure...*\n\nThe Hero—Kraugel from one year and three months past—had fallen twice already. That didn't make him weak. Peak Sword's breath caught in his throat the moment they faced each other alone. The Hero capitalized on that instant of distraction.\n\n*Whoosh!*\n\nDistance collapsed between them.\n\n*CLINK!*\n\nPeak Sword drew his blade. A national representative, after all. His breathing stabilized.\n\n\"**Annihilate.**\"\n\n*FLASH!*\n\nIyarugt emerged from its red-and-transparent sheath in a beautiful arc. That exact moment—\n\n[**Iyarugt, who is 100% charged with magic power, is in an intoxicated state. He has lost his ego and is running wild.**]\n\n[**The conditions of use for Iyarugt has been changed to 'person to be sacrificed.'**]\n\n[**It's impossible to summon Iyarugt.**]\n\n[**Iyarugt's damage has increased by 500%.**]\n\n[**Iyarugt's state is delivered to Peak Sword through Iyarugt's Sheath.**]\n\n*SLASH—!*\n\nAmong all skills in Satisfy, Draw Sword combined supreme attack power with unmatched speed. Red light carved through the air.\n\n\"What?\"\n\n\"What the hell—?!\"\n\nChris, the participants, commentators from every broadcasting company, viewers worldwide—all reacted simultaneously. The Hero's health gauge plummeted to nothing from a single strike.\n\n\"...!\"\n\nThe Hero jerked backward, more surprised than anyone. Massive health loss triggered defensive protocols—he retreated, judging himself in critical danger. The limitation of artificial intelligence. The real Kraugel would never make such a tactical blunder.\n\n*CLINK!*\n\nWithout counterattack, Peak Sword retrieved his sword effortlessly.\n\n[**Iyarugt has been picked up by his sheath! 50% of your health has been lost!**]\n\nPeak Sword ignored the notification. He attacked again.\n\n*SLASH—!*\n\nThe Hero activated Super Sensitivity, desperately attempting evasion. Futile. He'd already allowed Peak Sword to recover his blade. The second strike connected.\n\nThe Hero died.\n\nTwo blows. That's all it took Peak Sword to break the Hero.\n\nThen—\n\n*Whoooosh.*\n\nPeak Sword turned to grey."
}