{
  "id": 762,
  "title": "Chapter 762",
  "content": "One minute. That's all it took. Peak Sword had demolished what everyone considered the pinnacle of competitive gaming in sixty seconds flat. Sure, he'd died too—but nobody seemed to care about that minor detail.\n\n\"Impossible! Has to be a bug!\"\n\nFans of The Hero scrambled to deny reality.\n\n\"Think Peak Sword could actually beat Kraugel this year?\"\n\n\"Forget Grid and Kraugel—Peak Sword's the real top dog.\"\n\nTrolls and spectators ate it up. Confusion rippled across the globe. But Peak Sword remained blissfully unaware.\n\n\"Hah... hah...\"\n\nThe cost of wielding Iyarugt in its intoxicated state had been his life. When he logged out, sweat drenched every inch of his body. One missed attack—just one—and everything would have fallen apart. The mental strain of fighting The Hero under those conditions had been crushing.\n\n*'God Grid fought that monster for dozens of minutes...'*\n\nLying in his capsule, Peak Sword shivered. Grid's achievement suddenly seemed impossibly vast. That battle had been over a year ago—sixteen months, to be precise. And this year's Grid? He'd crafted Iyarugt's Sheath, an item capable of obliterating last year's Kraugel in two strikes.\n\n*'He really is a god...'*\n\n\"...Player Peak Sword? Player Peak Sword!\"\n\n\"Huh?\"\n\nPeak Sword snapped from his reverie. The host loomed over his capsule, microphone thrust forward like a weapon.\n\n\"Incredible performance! Everyone wants to know—how did you defeat the sky above the sky in one minute and one second? Have you been sandbagging this whole time?\"\n\nLast year's National Competition had earned Peak Sword a different title: useless. Despite ranking in the top fifteen globally, he'd gone home empty-handed. This year his rank had slipped to twentieth. Nobody expected anything from him. Yet here he stood—or lay—having pulled off the impossible.\n\nThe host's eyes blazed with excitement. The crowd held its collective breath. Peak Sword felt the weight of the world's attention pressing down. He wiped sweat from his cheek and mustered his best confident expression.\n\n\"You know Overgeared?\"\n\n\"...\"\n\n\"You know God Grid?\"\n\n\"...\"\n\nThe interview died there. Peak Sword, utterly entranced by the power of Iyarugt's Sheath and Grid's craftsmanship, had squandered his moment in the spotlight. His chance to become a global superstar evaporated like morning dew.\n\n[Peak Sword's Gold Medal Secret: Grid's Items?]\n\n[Grid Makes Useless Peak Sword Useful]\n\n[(Opinion) Could Grid Defeat The Hero Faster Than Peak Sword?]\n\nHeadlines worldwide fixated on Grid instead of Peak Sword. Such was the price of worship.\n\n***\n\n\"God Gridddd!\"\n\nAfter Breaking the Hero and the waterfall piercing event concluded, Peak Sword—wearing two gold medals representing the hopes of fifty million South Koreans—burst into the waiting room. He seized Grid's hands and howled.\n\n\"Amazing! Your item won me a gold medal! You're the best! An actual god!\"\n\n\"...\"\n\nSpit flew everywhere. Peak Sword's enthusiasm was literally infectious. Grid's face grew increasingly damp.\n\n\"Seriously, how did you create such a monstrous sheath?\"\n\n\"Well...\"\n\n[Iyarugt's Sheath]\n\nDurability: 200/200\n\n* Iyarugt's demonic power feeds the sheath continuously. Charges 1% demonic energy every 10 seconds.\n\n* Drawing Iyarugt consumes demonic energy. Loses 1% per second while drawn.\n\n* At 20% charge, Iyarugt enters 'satisfied' state. The sword becomes compliant, gains 20% attack power, and maintains this state for 30 seconds after being drawn. Draw Sword cooldown resets.\n\n* At 70% charge, Iyarugt enters 'excited' state. The sword ignores commands and acts independently. State lasts 70 seconds after Draw Sword. Cooldown resets.\n\n* At 100% charge, Iyarugt enters 'intoxicated' state. The sword perceives its wielder as prey. Draw Sword damage increases 500%. User loses 50% health over 4 seconds and dies within 30 seconds. To survive, sheath the blade within 10 seconds. Draw Sword becomes unusable for two minutes while demonic energy depletes. Using Draw Sword again during this period causes instant death.\n\nRequirements: None. Compatible only with Iyarugt.\n\nGrid had secured bloodstone during the 2nd National Competition, but struggled to find a use for it. Iyarugt was already a sword, and he lacked enough material for armor. Then came the Belial raid, which flooded him with crafting materials. The bloodstone got pushed aside—until just before this year's competition, when Grid formed a hypothesis.\n\nWhat if Iyarugt's soul resided in a bloodstone blade because their essences were compatible? Wouldn't Iyarugt grow stronger with a bloodstone sheath? Obsessed with maximizing his arsenal before facing Kraugel, Grid immediately forged one. The result was Iyarugt's Sheath—beautiful, deadly, and perfectly suited to its blade.\n\n\"As you saw, it's incredibly powerful. But the drawbacks are massive.\"\n\nFor Grid, Iyarugt's satisfied state held no appeal. Even with the 20% boost, it couldn't match his Enlightenment Sword. Same for the excited state—an uncontrollable weapon was worse than useless.\n\nAnd the intoxicated state? Despite the 500% damage increase, the three-second safety window made it impractical compared to the Enlightenment Sword's versatility and options.\n\n*'Sure, the raw damage exceeds the Enlightenment Sword. But stability matters more.'*\n\nHe saw no reason to risk swapping weapons for slightly higher numbers—when he wielded them directly, anyway.\n\nBut the God Hands? Different story. They had no health to lose. For them, intoxicated Iyarugt carried almost no penalty.\n\nGrid convinced himself and extended his hand to Peak Sword.\n\n\"Now then—time to return what you borrowed.\"\n\n\"Y-Yeah. Of course.\"\n\nPeak Sword remained sprawled in his capsule, reluctant to move.\n\nThe synergy between Peak Sword and high-attack-power Iyarugt was undeniably spectacular. But without demonic power, he couldn't properly wield it. Only the intoxicated state bypassed that requirement—and using it meant the damage to himself outweighed any benefits.\n\nThe blade was a poor fit for Peak Sword outside one-off events like the National Competition. He harbored no desire to keep it. However—\n\n\"Um... God Grid. Once I exchange this gold medal for minerals, could you craft me a matching blade and sheath set?\"\n\nPeak Sword's request came out tentative. Grid nodded immediately.\n\n\"Absolutely.\"\n\nA sacred creature byproduct. Given that Red Phoenix's Breath contained fire power, Blue Dragon's Breath likely held lightning. And lightning-attribute items typically boosted speed.\n\n\"Request Blue Dragon's Breath.\"\n\nHow powerful would Peak Sword become? The thought made Grid tremble. Pride swelled in his chest—his skills could elevate someone to new heights. Time passed...\n\n『 Only one event remains! 』\n\nThe National Competition's third day. Eight of nine events finished, leaving only the grand finale: PvP. The showdown the world had anticipated for over a year—Grid and Kraugel's long-awaited rematch.\n\n\"Kuk! Kukukuk! Finally!\"\n\nSeuron of Argentina grinned savagely.\n\n\"Grid and Kraugel—I'll crush both pieces of trash!\"\n\nZhang Zheng of China sneered.\n\n\"Grid! This year I'll have my revenge! Erosion will nullify your precious items!\"\n\nTarma, formerly of Blood Carnival, snarled.\n\nAnd...\n\n\"...\"\n\nThe sky above the sky stood silent.\n\nThirty-two competitors converged on stage. Grid among them.\n\nSouth Korea: Gold (6), Silver (1), Bronze (2)\n\nUnited States: Gold (5), Silver (8), Bronze (4)\n\n\"Grid, stay strong!\"\n\n\"Win this year, please!\"\n\n\"Kraugel! You'd better win this time!\"\n\n\"First place in overall rankings—USA!\"\n\n\"Grid! Grid! Grid!\"\n\n\"Kraugel! Kraugel! Kraugel!\"\n\nThe crowd's roar shook Tokyo. The dome temperature climbed toward boiling. The sky above the sky versus the man who'd nearly reached it. Who would fall this year?\n\nAmid the tsunami of cheers and expectations—\n\n\"During the sword drawing event...\"\n\nGrid and Kraugel faced each other on stage. Grid spoke first.\n\n\"When you won gold and Yura took silver, I felt relieved.\"\n\n\"...\"\n\n\"It was fortunate. You didn't lose. My heart wouldn't be racing like this if someone else had beaten you first.\"\n\nOnly Grid could break the sky. It was the final proof he needed to claim the summit.\n\n\"This year, I will win.\"\n\nKraugel's reply came brief and certain.\n\n\"Looking forward to it.\"\n\nTo Kraugel, Grid represented something special—the only opponent whose defeat wasn't guaranteed. In today's confrontation, Kraugel might be even more eager than Grid himself."
}