{
  "id": 763,
  "title": "Chapter 763",
  "content": "Victory was no longer promised.\n\nAfter the 1st National Competition, the 2nd, his guild war defeats, and successive losses to Grid and the Overgeared members—Bubat had become synonymous with failure. Those who once praised him now turned their backs. Some openly mocked him. The honor he'd built as leader of the Yak Guild, one of the Seven Guilds, and as the strongest Crusher—it had all crumbled like sand beneath the tide.\n\nYet Bubat didn't waver. Not once.\n\nAs a tanker, he'd spent years learning to take hits. His mental fortitude had been forged in that crucible of punishment.\n\n\"This year will be different.\" \n\nBubat's resolve hardened as he prepared for the PvP bracket.\n\n\"This year, I *will* defeat Grid.\"\n\nHis obsession with Grid wasn't born from personal hatred or simple revenge. Grid represented a wall to be overcome—a trial that would force him to evolve beyond his limits.\n\nAnd there was more.\n\n*'Father, stay strong!'*\n\n*'This year, bring home that gold medal!'*\n\nHe wanted to be a hero in his daughters' eyes. They were growing up so fast.\n\n*'Tomorrow... I'll see my princesses again.'*\n\nThe memory of last night's video call brought a smile to his lips. His opponent, China's Zhang Zheng, was already waiting. The young fighter climbed into his capsule at the host's signal and sneered across the stage.\n\n\"Do all Turks lack brains, or just shame? Why waste everyone's time competing when you never win medals?\"\n\n\"Tsk.\"\n\nZhang Zheng was young. His mouth ran ahead of his maturity. Bubat clicked his tongue and settled into his capsule. At thirty-five years old, he'd learned not to bite at cheap provocations from children.\n\nThe host's voice boomed across the arena.\n\n\"The long-awaited opening match of the PvP bracket! China's Zhang Zheng versus Turkey's Bubat—both players logging in! The showdown begins... NOW!\"\n\n\"WAAAAAAHHH!\"\n\nThe crowd's roar filled Bubat's ears as his eyes slid shut.\n\nThen—\n\n\"Mm.\"\n\nHis eyes opened again. Lion's Castle materialized around him—the same arena that had hosted three years of PvP battles. Zhang Zheng vaulted over a low wall, weapons already drawn.\n\n\"Pretty solid for a human, aren't you?\"\n\n*Shrak!*\n\nZhang Zheng launched forward, venom dripping from his words. In his hands: the Destruction Sword, one of eight powerful weapons he'd acquired through his network. It dealt bonus damage to humanoid targets, blocked healing effects, and scaled with the victim's maximum health.\n\n*Thuk!*\n\n*Thuk-thuk-thuk!*\n\nZhang Zheng had emerged as China's rising star last year with his hidden Fighter class. His Weapons Mastery let him wield any armament with deadly proficiency, backed by exceptional strength and agility. Bubat, who'd invested nearly everything into stamina, couldn't hope to dodge the barrage. The black blade carved into his stone-like body again and again.\n\nYet Zhang Zheng's expression soured. \n\nBubat's health bar barely moved.\n\n*'What kind of defense is this?'*\n\nBubat's tanking ability had already stunned Grid last year. His reputation as the strongest initiator came from being able to dive into enemy formations and *survive*—his overwhelming defense was the foundation of that strength.\n\n*Snap!*\n\nBubat's hand locked around Zhang Zheng's wrist. He smiled.\n\n\"They don't call me the Yak for nothing. Did you really think that toothpick would bring down a bull?\"\n\n\"You boar bastard—!\"\n\nZhang Zheng recognized the danger and tried to wrench free. Futile. A Crusher never released prey once caught.\n\n\"**Go to Hell!**\"\n\n*KRAKAKAKAAA!*\n\nThe skill slammed Zhang Zheng's skull into the arena floor, triggering every status ailment in the book. The technique carried devastating damage—for a Crusher, stamina *was* attack power, hitting with force comparable to a pure damage dealer.\n\n\"...!\"\n\nZhang Zheng couldn't even scream as his head cratered into stone. His vision went black, swallowed by earth and shadow.\n\n\"Hup!\"\n\nBubat wrapped his arm around Zhang Zheng's waist, still buried upside-down in the ground. It wasn't a gesture of mercy.\n\n\"Brace yourself. This one's worse.\"\n\nBubat's teeth clenched—\n\n*WRENCH!*\n\nHe ripped Zhang Zheng from the ground like pulling a turnip and hoisted him skyward. Then down again. A human pile driver.\n\n*'No—!'*\n\nZhang Zheng's vision blurred—sky to earth at terminal velocity—and primal terror seized his spine. Goosebumps erupted across his skin.\n\n*'You dare...!'*\n\nZhang Zheng bit down hard. He fought through the chaos status from Go to Hell.\n\n\"You *dare* do this to me?! I'll slaughter you!\"\n\nHe released the Destruction Sword and drew a dagger—a lethal weapon with accuracy bonuses, armor penetration chance, and damage rivaling his primary blade.\n\n*Stab! Stab-stab-stab!*\n\n\"Guh...!\"\n\nBubat's face twisted as Zhang Zheng—still locked in his arms—drove the blade repeatedly into his ribs. The armor-ignoring attacks found purchase where the sword had failed. Crushers had a passive that nullified damage beyond certain thresholds, but sustained low-damage strikes were their weakness.\n\n\"RAAAAAHHH!\"\n\n*BOOOOOM!*\n\nBubat powered through the pain and drove Zhang Zheng into the ground with everything he had.\n\n\"KYAAAAH! GHKK! GAAAH! KHEOK!\"\n\nZhang Zheng kept stabbing even as he cratered into stone. But the one suffering catastrophic damage was obvious. **Descending Death** hit twice as hard as Go to Hell. Zhang Zheng looked half-dead, his head embedded in cracked stone.\n\nThe match fell eerily quiet.\n\n*Thud-thud!*\n\n*Thud!*\n\nBubat's assault continued. Zhang Zheng remained perpetually stunned. Despite his high-grade items boosting his defense, Descending Death shredded through it, and his health plummeted.\n\n\"This ends now!\"\n\nBubat's declaration rang across the arena. Red light erupted from his body—the herald of **Watermelon Break**, one of the Crusher's few direct attack skills.\n\n*SHRIIIIING!*\n\nBubat's hammer swept across Zhang Zheng's exposed abdomen.\n\n*KA-KA-KA-BOOOOM!*\n\nZhang Zheng's armor detonated—not from the skill itself, but from the legendary armor's passive: *'Triple damage reflection after absorbing sufficient punishment.'*\n\n\"URGH!\"\n\nThe explosion caught Bubat point-blank and hurled him backward. Zhang Zheng shook off the stun and surged to his feet, then unleashed a storm of strikes on Bubat's fallen form.\n\n*Shlk!*\n\n*Shlk-shlk!*\n\nBlood sprayed. Zhang Zheng cycled through all eight weapons, maximizing each one's unique properties—defense reduction, fixed damage, status effects. The relentless barrage gradually chipped away at Bubat's granite-like constitution.\n\n\"You bastard! Do you know who I *am*?! Die!\" \n\nZhang Zheng stabbed without pause. His eyes gleamed with a killer's madness, like something out of a horror film. The organizers had minimized blood effects, but the scene remained visceral and cruel.\n\nFinally—\n\n\"B-Bubat has been logged out!!\"\n\nBubat's body dissolved into gray light. \n\nZhang Zheng kept stabbing the empty ground where he'd been.\n\n\"GAAAH! KYAAAAH!\"\n\nHorror rippled through the crowd. Even the Chinese supporters fell silent, unnerved by the display. Bubat's wife, watching at home, hurriedly ushered their daughters out of the room.\n\nThe atmosphere had turned toxic.\n\n\"Cute.\"\n\nGrid muttered the word as he prepared for his match. Having met the genuine psychopath Agnus, Zhang Zheng registered as little more than a yapping puppy.\n\n***\n\n\"Perfect. The crowd's already on edge.\"\n\nTarma's lips curved as he readied himself for the second match of the round of 32. Zhang Zheng's brutal takedown of Bubat—a rising star dismantling the old guard—would amplify the audience's bloodlust. Excellent. Since he'd drawn Grid right out of the gate, maximum attention was exactly what he needed.\n\nHe glanced at Grid and smiled. Victory was assured. With Erosion, he could temporarily destroy Grid's strongest weapon and neutralize him completely.\n\n\"I'll drag you down today and erase every humiliation from the past.\"\n\nTarma's reputation had imploded after Grid defeated him in three seconds at the 2nd National Competition. Job offers dried up. His income evaporated. And after Blood Carnival disbanded—Grid's doing—he'd become a fugitive, forced to flee to the East Continent and endure a hellish existence. Life there was brutal compared to the West Continent.\n\nBut his thirst for revenge had driven him to acquire Erosion.\n\n\"Kekeke! Grid...! Today you die!\"\n\nAnticipation thrummed through Tarma's body. He could already taste the glory of toppling the legend.\n\n『 After Bubat's shocking defeat, South Korea's Grid faces Greece's Tarma. 』\n\n『 Player Tarma is infamous as a former Blood Carnival operative—an assassin once rated superior to even the god of death, Faker. 』\n\n『 Though last year, Grid defeated him in three seconds, fundamentally altering public perception. Until yesterday, expectations for Tarma were... modest. 』\n\n『 However, his performance in the Asura Path event proved the rumors weren't hollow. He crushed the competition for gold, demonstrating peak-level mastery. 』\n\nTarma's skill in the event had been undeniable—placing him above powerhouses like Chris, Damian, Pon, and Regas. No exaggeration. After yesterday's finals, he'd given a revealing interview:\n\n*'I'm the one who conquered Overgeared's Cork Island. I killed every defender there. Kekeke, think I'm lying? Ask Peak Sword—I butchered him personally. Last year's loss to Grid? I was caught off-guard, nothing more!'*\n\nThe bombshell sent shockwaves through the media. Investigations confirmed every word. Tarma had indeed handed the Overgeared Guild a bitter defeat. Some analysts were now speculating he might actually have a chance against Grid.\n\nMeanwhile—\n\n*'I want to use it.'*\n\nGrid felt the urge burning in his chest as he faced Tarma onstage. The **100,000 Army Massacre Sword**. He wanted to unveil the ultimate technique inherited from the Undefeated King—prove to the world that those \"Grid the Chuuni\" videos circulating online were *wrong*.\n\nDrawing Tarma in the first round was fortunate. As a long-time unofficial ranker, Tarma's level likely matched or exceeded Grid's own.\n\n*'Build fighting energy, then finish with 100,000 Army Massacre Sword for the perfect showcase.'*\n\nGrid slid into his capsule. His eyes opened in Lion's Castle.\n\nTarma stood across from him.\n\n\"I! I've been *waiting* for this moment! KUAHAHAHA!\"\n\n*DASH!*\n\nTarma exploded forward. Assassins traded durability for overwhelming attack power and agility. As one of the elite few at the pinnacle of the class, Tarma's speed was terrifying. He closed the distance instantly.\n\nBut his initial strike was measured—exploratory. For all his bravado, Tarma was calculating. He'd probe first.\n\n*Fwip!*\n\nA minimal, efficient thrust.\n\n*Thk!*\n\nTarma's yellow dagger pierced Grid's shoulder. Confirming the damage, he immediately disengaged, anticipating a counterattack—\n\n*FWOOOOSH!*\n\nGrid surged forward at maximum speed, Alex's Quick Gloves activating. Black flames erupted from his weapon—a roar like dragonfire—and swallowed Tarma whole.\n\n[The target has died!]\n\n\"...?\"\n\nGrid stared at the notification window, nonplussed.\n\n『 Ah! The legendary assassin—Tarma has vanished! 』\n\n『 Where did he go?! Incredible! 』\n\nThe commentators, crowd, and viewers hadn't realized Tarma was dead. The gray pillar signaling a player's death had been buried under the brilliant, scorching effects of Grid's black flames. Grid stood alone in the empty castle, sweating awkwardly.\n\nSeveral seconds passed before the host belatedly grasped the situation and announced the match's conclusion."
}