{
  "id": 764,
  "title": "Chapter 764",
  "content": "**1.6 seconds.** That's how long it took Tarma to close the distance with Shadow Shift. His dagger bit into Grid's shoulder. Another half-second, and Grid's blade found its mark.\n\n**2.1 seconds total.** That's all it took to defeat Tarma—shattering Grid's previous record of three seconds.\n\nThe Tokyo Dome fell silent.\n\n*Thud.*\n\nSomewhere in South Korea, jokbal hit the floor. The viewers and commentators finally found their voices.\n\n『Skill... Player Grid has acquired a devastating new skill.』\n\n『Ah...! Yes! Th-That's right! It has to be!』\n\nMost of Grid's offensive toolkit required the preparatory movements of a sword dance—sometimes an advantage, but more often a liability. Against classes built for combat, those wind-up animations created fatal openings. It had been Grid's most glaring weakness.\n\nThis year, Grid had overcome it.\n\n『Player Grid conquered the Behen Archipelago. He must have claimed its ultimate reward—some form of instant-cast skill.』\n\n『He's been reborn... a complete warrior now...』\n\nNo one suspected what Grid had used was merely a *basic attack.* They couldn't. The human mind rarely entertains possibilities that shatter common sense. The analysts interpreted it as a new ultimate skill. The audience watched the replay loop and nodded in agreement.\n\n『A zero-cast offensive skill with range even the fastest assassin can't evade... Could it be the black fire dragon...?!』\n\n『Black fire dragon? You mean the power Player Lauel mentioned in past interviews?』\n\n『Exactly. Lauel claimed a black dragon's power was sealed in his right hand—that he served his master Grid with this power bound. Perhaps Grid has finally released the seal...』\n\n『If that's a quest reward, it's terrifying to consider the implications...』\n\nThe theory spread, though few truly cared about its accuracy. Black fire dragon or not, the conclusion remained the same: Grid had obtained an ultimate skill.\n\nAnticipation for the Grid versus Kraugel showdown intensified.\n\n***\n\n\"Player Tarma! How does it feel to be eliminated in under two seconds?!\"\n\n\"Shut the hell up!\"\n\nTarma fled the stage like a man possessed, shame burning his face. The terror returned—the fear of Grid, the man who had dismantled Blood Carnival piece by piece. It filled every corner of his mind as his body trembled.\n\nHe understood now. No amount of effort would ever close the gap between them.\n\n*I can't face that monster.*\n\nWhat retribution awaited him for the Cork Island incident? He didn't want to find out.\n\n*Scoff.*\n\n\"...?!\"\n\nTarma skidded to a halt, face still pale. Zhang Zheng leaned against the corridor wall, smirking.\n\n\"Dying in one hit—does that make sense to you? The old guard's a fucking joke.\"\n\n\"You..!\"\n\nHeat flooded Tarma's cheeks. This bastard didn't understand Grid's power at all, and the ignorance infuriated him. Killing intent flared in his eyes—then died just as quickly. Bodyguards flanked Zhang Zheng. Tarma lost his nerve and snorted instead.\n\n\"You think you're qualified to look down on me? You're barely out of the cradle. The world's gone mad if trash like you walks around running your mouth.\"\n\n\"You...! I'm a *third-generation* ranker!\"\n\nTen new prospects emerged every year, leveraging accumulated wisdom and publicly available data to accelerate their growth. They believed their rapid ascension proved superior talent. The veterans found it laughable.\n\n\"I'll tell you what's going to happen,\" Tarma spat. \"You'll die in two seconds too. One hit from Grid. *One.* He's a monster, and you're not any better than me!\"\n\nHe meant every word. Let this arrogant prick learn the hard way.\n\n*Shit. Never thought I'd root for Grid.*\n\nTarma stormed off, his rant echoing through the corridor.\n\nZhang Zheng shouted after his retreating back. \"Talk's all you've got, you dog! I'll show you just how pathetic the old guard really is! You watching?!\"\n\nTime bred development. That applied to humanity itself. More geniuses walked the earth now than in all of history combined. The new generation always surpassed the old.\n\nZhang Zheng believed this absolutely.\n\nIt was his truth.\n\n***\n\n\"Grid. I won't challenge you again.\"\n\n\"...\"\n\nOn the way back to the waiting room, Grid found Bubat waiting. A bitter smile curved the man's lips.\n\n\"Zhang Zheng showed me the truth. I have no hope in a one-on-one match.\"\n\nDuring the first two National Competitions, Bubat had defeated everyone in PvP—except Grid. That sole exception overshadowed all his victories. The limitations of a Crusher became painfully clear. Initiators excelled at control, not execution. He could neutralize targets but lacked the damage to finish them.\n\nAcknowledging this reality had taken Bubat years.\n\n\"I couldn't see it before. Apart from you, I only fought opponents weaker than myself. I thought I was truly strong—that I just needed one more chance to defeat you. But Zhang Zheng made it clear: once an opponent reaches a certain threshold, my class hits a wall.\"\n\n\"Hrmm...\"\n\nGrid showed a flicker of uncertainty. Three years of bad blood didn't vanish overnight, and he had no reason to trust Bubat. The man had participated in the Patrian invasion—had nearly destroyed the Overgeared Guild. Why approach him now?\n\nBubat caught Grid's hesitation and waved his hand. \"No—I'm not trying to burden you. I'm not presumptuous enough to expect we can start fresh. It's just... I just...\"\n\nHis eyes trembled, recalling the phone call with his wife moments ago. His children's shock at Zhang Zheng's cruelty still echoed in his ears.\n\n\"...I hope you don't lose to that cruel boy.\"\n\n\"Zhang Zheng?\"\n\n\"That's right. Be careful. If someone like him defeats you...\"\n\nThis stage would no longer be a dream for his daughters. For any children. Bubat wanted to provide whatever edge he could.\n\n\"Don't underestimate the rookie. Zhang Zheng's armor reflects damage three times over. Even you could be in danger.\"\n\nThe thought chilled him—Grid's devastating attacks rebounding with triple force. Grid might actually lose. That's why Bubat had come.\n\n\"Triple damage reflection...\" Grid's expression remained calm. \"Understood.\"\n\nHe nodded and walked past Bubat.\n\n*Step. Step.*\n\n\"...\"\n\nGrid's footsteps faded down the corridor. No farewell. No pleasantries. Bubat understood—he knew what he'd done to Grid and the Overgeared members. He couldn't expect warmth. He stood there, silent, when Grid's voice drifted back.\n\n\"You're weak.\"\n\n\"...\"\n\n\"Like you said—in a one-on-one.\"\n\n\"...?\"\n\n\"If we meet again in war, I hope we're no longer enemies.\"\n\n\"...Grid.\"\n\nThe Overgeared King had acknowledged his worth—in warfare, at least. Warmth bloomed in Bubat's chest, chasing away the gloom. A genuine smile crossed his face.\n\n***\n\nThe Round of 32 concluded swiftly. The chaff separated from the wheat.\n\nThe Sword Saint dominated his match. Kraugel faced the favored Seuron and dismantled him with even more overwhelming skill than last year. The audience expected nothing less—Kraugel had grown several times stronger.\n\nGrid, however, felt shock ripple through him. He knew Kraugel stood at least fifty levels lower than he had been last year.\n\n*Still hasn't reached level 300...*\n\nWas this Grid's final chance to surpass the genius? Would time eventually make the gap insurmountable? The thought crossed his mind—\n\n*Thump-thump. Thump-thump.*\n\n—and his heart raced with excitement. The higher Kraugel climbed, the stronger Grid's instinct to build his tower even taller.\n\n\"Oi, Bangzi. What's got you daydreaming?\"\n\nZhang Zheng. The Chinese player who would face Grid in the Round of 16.\n\n\"Thinking about packing your bags already?\"\n\n\"What kind of bullshit are you spouting?\"\n\n\"...?\"\n\nZhang Zheng blinked, thrown off balance. The established powers usually clung to dignity until provoked—he enjoyed watching them crack. But Grid cursed effortlessly, despite sitting on his throne.\n\n\"I'm not disrespecting you because you're weak. If you want respect, conduct yourself better.\"\n\nGrid belatedly switched off his microphone. He scoffed and reclined in his capsule.\n\nZhang Zheng's face flushed crimson.\n\n\"Bangzi...! That damn Bangzi dares...! Does he not know who I am?!\"\n\nNot ignoring him because he was weak? In other words—Zhang Zheng *was* weak?\n\n\"Bastard!\" He scrambled into his capsule, fury driving every movement. He'd make Grid taste defeat. \"Login! *Login!*\""
}