{
  "id": 765,
  "title": "Chapter 765",
  "content": "The world held hundreds of dialects—China alone boasted over a hundred, spread across its vast landmass and population. Most players relied on Satisfy's automatic translation system to communicate, but Grid had disabled it the moment he logged in. He wanted to hear Zhang Zheng's words in their raw form: the harsh consonants of Yanbian dialect rendered into Korean.\n\n\"I can't stand that accent,\" Grid muttered.\n\n\"What?\"\n\nWeathered castle walls rose around them, scoured smooth by relentless desert winds. Zhang Zheng stepped from behind their cover, his expression twisted with contempt. \"Grid. Don't expect a quick death.\"\n\nTwo years and three months. That's how long Zhang Zheng had been playing Satisfy. In that time, he'd leveraged his wealth, accumulated information like a hoarder, and ridden natural talent to heights that should have taken years. He'd surpassed the second-generation rookies. Broken into the top rankings. Now he stood here, facing one of the game's living legends.\n\nGrid? Kraugel? Zhang Zheng didn't believe the old guard could challenge him anymore.\n\n\"The National Competition opened my eyes.\" Zhang Zheng's lip curled. \"The veterans are weak—stagnant, complacent, dull. Being king of the garbage heap means nothing. Wouldn't you agree?\"\n\nHe saw Satisfy as a forest that had lost its lions. Only wolves and foxes remained, squabbling over scraps. Zhang Zheng intended to claim the vacant throne.\n\n\"I'll rule this forest.\"\n\nVictory was certain. His talent—the raw ability that had catapulted him past the so-called geniuses of the second generation—was proof enough. He knew, with absolute conviction, that he outclassed Grid.\n\n\"You said you'd cut me apart?\"\n\nZhang Zheng's smile turned vicious as he cycled through eight legendary weapons in rapid succession. Each one radiated power, their enhanced forms obvious to anyone with eyes. Different classes, different functions—the most devastating arsenal money and skill could assemble.\n\n\"Ohh...\"\n\nThe crowd's admiration rippled through the stadium. Each weapon swap triggered spectacular visual effects, a cascade of light and sound that had spectators leaning forward in their seats.\n\nGrid's expression didn't change. \"It doesn't matter how many weapons you own. You won't get the chance to use them.\"\n\nThe casual dismissal hit Zhang Zheng like a slap.\n\n\"King of mangy mutts!\" His face flushed crimson, veins standing out on his forehead. \"How dare a dog challenge a lion?! Today you'll learn the truth—how small and pathetic the world you've ruled really is!\"\n\nHis axe rose overhead. To the crowd, he looked demonic—consumed by rage and certainty. Grid's smile turned bitter.\n\n*A third-generation hothead...*\n\nAs king of a nation, Grid possessed intelligence networks beyond the reach of ordinary players. He'd researched Zhang Zheng thoroughly. The reports painted a picture of unprecedented growth—someone said to transcend even the second generation.\n\n*I expected more.*\n\nInstead, he faced a monument to arrogance. Watching Zhang Zheng spit on the achievements of the old guard sparked something protective in Grid. He felt responsible—for himself, for his guildmates, for everyone who'd built Satisfy's competitive scene from nothing. These pioneers didn't deserve to be called trivial.\n\n*Paaaat!*\n\nFour golden hands materialized behind Grid, each grasping a Mjolnir. The legendary status-effect weapons gleamed under the arena lights. Zhang Zheng's eyes lit up.\n\n\"Kukuk! Kuhahaha! Perfect! You admit you're afraid!\"\n\nDuring past National Competition matches, Grid rarely deployed his God Hands at a fight's opening. Aside from his bout with Kraugel, he'd never committed them so early. To Zhang Zheng, the message was clear: Grid considered him Kraugel-tier.\n\nThe crowd's excitement surged.\n\n\"Grid's using the God Hands already!\"\n\n\"Zhang Zheng must be incredibly strong...\"\n\n\"The third generation's strongest, without question!\"\n\nZhang Zheng had demolished Bubat, one of the old guard's pillars. Now Grid was showing his trump card from the start. The rookie's stock was soaring. Chinese viewers erupted in nationalist fervor.\n\n\"Finally, our great nation produces a true hero!\"\n\n\"Nothing like Hao, who grovels before Grid at every opportunity! This newcomer has Grid on the defensive!\"\n\n\"Zhang Zheng is merely the beginning. Our population is vast, and the young generation evolves daily. The descendants of ancient heroes will rise and dominate the world stage!\"\n\nChinese pride ran deeper than most. Intoxicated by nationalism, 1.5 billion people envisioned a glorious future where China ruled Satisfy's competitive scene. They never doubted it.\n\n\"Afraid? Me? Of *you*?\" Grid's next words shattered their dreams. \"You're an insect. I don't need to swat you myself. **Summon Iyarugt**.\"\n\n*Kurururung!*\n\nGrid drew the demonic sword. It screamed—a sound like tearing metal and breaking stone. Blood-red light erupted from the blade, too brilliant to look at directly. The weapon *refused* Grid's grip.\n\n*Paaaat!*\n\nIyarugt tore free, spiraling into the air. The translucent crimson of smelted bloodstone darkened to the color of dried blood. Ancient golden characters blazed across its surface, beautiful and terrible.\n\n*'What?'*\n\nZhang Zheng and the crowd stared, transfixed.\n\n*Kuoooooh—*\n\nThe sword stilled. Its radiance dimmed. Silence crashed over the arena like a physical force.\n\n\"...\"\n\nTime itself seemed to hold its breath.\n\n*Paaaat!*\n\nA crimson orb burst from the floating blade. The soul within Iyarugt—Hell's greatest swordsman, the Sword Demon, Great Demon Zepar's only rival—manifested before millions of viewers.\n\n\"What is that...?\"\n\nZhang Zheng stumbled backward, instincts screaming danger. Whatever was emerging, he couldn't let it finish. But he'd already hesitated too long. Iyarugt's soul exploded outward like a newborn star, light coalescing into solid form.\n\nAn elderly figure hunched forward, spine curved with age. A single horn jutted from his forehead. Crimson flames writhed across his body. His eyes bulged from their sockets, grotesquely muscular. Within those shadowed depths, irises as black as the ocean's floor fixed on Zhang Zheng.\n\n\"A demonkin...!\"\n\nSummoning demonkin was possible—third-advancement black magicians could do it. But Grid was a *blacksmith*. Zhang Zheng's face went pale. Then the elderly demon drew a deep breath, savoring air that hadn't touched his lungs in centuries.\n\n\"Sweet.\"\n\nIyarugt possessed the magic power of a lesser demon, but his swordsmanship rivaled the great demons themselves. Marbas, one of Hell's major powers, had once declared: \"Iyarugt could reshape Hell's hierarchy.\"\n\n*Sakak!*\n\nThe demon caught his namesake sword mid-air and advanced on Zhang Zheng.\n\n\"Keok...!\"\n\n[**A fatal weakness in your swordsmanship has been exposed.**]  \n[**Your evasion rate is negated. Defense reduced. Critical damage incoming.**]  \n[**You have suffered 12,150 damage.**]\n\n\"K-Kuock...!\"\n\nOne strike. A single sword swing carved away one-fifth of Zhang Zheng's health. What *was* this creature? His mind reeled at the appearance of this unexpected monster.\n\n*Snap!*\n\nDespite his aged appearance, Iyarugt moved with blinding speed. He closed the distance and drove Zhang Zheng into the ground.\n\n*Peeeeok!*\n\nZhang Zheng couldn't resist. The earth cratered beneath him.\n\n\"...\"\n\nChinese spectators sat in stunned silence, watching their champion crumple like wet paper.\n\n***\n\n**Name:** Iyarugt  \n**Age:** ??? **Gender:** Male  \n**Species:** Horned Demon  \n**Title:** Hell's Best Swordsman\n\n**Title Effects:**\n* Attack power doubled when wielding sword-type weapons\n* 100% critical strike rate when hitting weak points  \n* Evasion rate +50%\n\n**Stats:**\n**Strength:** 3,503 | **Stamina:** 1,090  \n**Agility:** 3,201 | **Intelligence:** 330\n\n**Skills:** Swordsman's Eyes (S), One Way of Life (SS–), Sword Dance Explosion (SS), Volcanic Circulation (SS), Hell Moon Cut (SS), Sublime Sword (SS+)\n\n**Description:**\n*A horned demon, classified among the lesser demons. Through relentless training, he became Hell's strongest swordsman. Yet he could not transcend the limitations of his birth and fell in battle against Great Demon Zepar.*\n\n*His soul was cursed and bound to a sword.*\n\n* *By defeating powerful opponents, he can gradually reclaim his former strength. (Progress: 1/10)*\n* *Victories must be against recognized 'enemies.'*\n* *Iyarugt has developed strong camaraderie and genuine affection for you.*\n\n***\n\nThe status window clarified that Iyarugt hadn't recovered his full power. In a one-on-one duel with Grid's current build, the demon would get pummeled. Still, by any standard, he was formidable. His health and defense matched ordinary players, but his attack power—augmented by guaranteed critical strikes—nearly equaled Grid's own. Within the Overgeared Guild, fewer than ten members could match Iyarugt's offensive capability.\n\nThird-advancement Zhang Zheng couldn't withstand him. What about Zhang Zheng's vaunted control skills? Worthless against Iyarugt. What about his legendary equipment? Trivial to a demon who'd tanked countless blows from Grid's arsenal.\n\n\"Kuaaaah!\"\n\nZhang Zheng surged upright, humiliation burning in his chest. He swung a blade enchanted with *bonus damage versus demonkin*. Iyarugt's sword blurred. Zhang Zheng's attack collapsed mid-swing. He whirled toward Grid, spitting fury.\n\n\"You! You *Bangzi* coward! You're afraid of a fair fight, so you summoned this monster?!\"\n\nPets had damage caps—their stats scaled poorly unless they exceeded their master's level. Yet this demonkin dealt over 10,000 damage per strike, far beyond Grid's estimated attack power. Zhang Zheng concluded Grid had contracted the demon through a special quest—a temporary trump card. He never imagined Iyarugt was Grid's permanent summon.\n\nGrid glanced at the cameras broadcasting worldwide, then answered. \"What monster? He's just my pet.\"\n\n\"What? What nonsense—\"\n\nZhang Zheng charged.\n\n**[Black King's Armor]**  \n**Rating:** Legendary  \n**Durability:** 299/299 | **Defense:** 699\n\n**Options:**\n* Blocks 7% of incoming damage  \n* 30% chance of stealth in darkness  \n* +20% defense in darkness  \n* Agility +50 in darkness  \n* After accumulating 30,000 damage, reflects 3× magic damage to attacker. (Costs 50 durability. Effect nullified if struck by 30,000+ damage in one hit.)\n\nZhang Zheng intended to overwhelm Grid and his demon through sheer durability. Mathematically, it was possible. The Black King's Armor could reflect 90,000 damage—no player could survive that! But...\n\n*Peok peok!*\n\n[**You have been stiffened.**]  \n[**You have been stiffened.**]  \n[**You have been stiff—**]\n\n\"Ugh! Keok! Eek!\"\n\nHe couldn't reach Grid. The moment the God Hands swung their Mjolnirs, Zhang Zheng fell into infinite crowd-control hell. Hammers rained on his skull from four directions simultaneously. His head snapped left, then right, then left again—a grotesque puppet dance. Grid watched the chain-stun loop with satisfaction.\n\n\"Didn't I warn you? You'd never get the chance to swing your weapon.\"\n\nGrid was, fundamentally, an arrogant man. If he truly expressed every grudge he carried, Zhang Zheng's earlier boasts would seem charming by comparison.\n\n\"You...! You filthy—eek! Keok!\"\n\nZhang Zheng's rage meant nothing. His health drained in increments of hundreds, methodical and unstoppable. Across China, 1.5 billion viewers descended into shock and despair."
}