{
  "id": 766,
  "title": "Chapter 766",
  "content": "**[You have suffered 1,950 damage.]**\n\n**[You have become stiff. You can't take any actions.]**\n\n**[You have suffered 879 damage.]**\n\n**[You have become stiff...]**\n\n**[You have suffered 880 damage...]**\n\n\"Ugh! Keok! Eek! Kuoh! Kuaaah!\"\n\nHelpless—like a fly thrashing in a spider's web. Zhang Zheng's roar echoed through Tokyo Dome, feral and raw, as Mjolnir hammers pounded him into submission. Minutes dragged by. Every blow locked his body in stiffness. The humiliation burned worse than the damage. His first taste of true powerlessness, and the entire world was watching.\n\n*I can't be eliminated like this. Not after—*\n\nLess than an hour ago, he'd declared Grid and Kraugel insignificant in that interview. If he logged out now, defeated without Grid even lifting a weapon, he'd be no different from Tarma—another washed-up braggart reduced to internet mockery.\n\nHis jaw clenched. *No. Find the gap.*\n\nZhang Zheng forced his mind to still. He only needed one opening. The instant the stiffness released, he'd swing—parry the next Mjolnir strike. Break the cycle. It was possible. It *had* to be possible. Satisfy couldn't have truly infinite crowd control. No game would allow that.\n\nHe steadied his breathing. Waited. Focused.\n\n*Peok!*\n\n0.3 seconds.\n\n*Peok peok!*\n\n0.1 seconds. 0.1 seconds. 0.1 seconds. Then 0.3 seconds again.\n\nThe four Mjolnirs alternated in perfect rhythm, each stiffness window bleeding seamlessly into the next. Zhang Zheng's eyes darted between the golden hands, searching for the pattern's flaw.\n\nThere was none.\n\n*This is—this is impossible!*\n\nA bug. Grid had to be exploiting some broken mechanic. Cheating. That was the only explanation—\n\n**[30,000 damage has accumulated. The Black King's Armor feels humiliated!]**\n\n*Peeeeeong!*\n\nHis armor flashed crimson. The explosion rippled outward, catching all four God Hands in the blast. They scattered, bodies going rigid from the counterattack. The stiffness cycle shattered.\n\nZhang Zheng gulped down a health potion mid-roll and surged forward.\n\n\"How long did you think you could hide behind that trick?\" His voice cracked with vindication. Finally. *Finally.* He raised his sword, Grid's exposed throat just meters away—\n\n*Puok!*\n\n**[You have suffered 13,050 damage.]**\n\n\"Keok!\"\n\nBlood sprayed from his lips. Iyarugt—the damned floating sword that had been standing idle beside Grid—slammed into his ribs. Zhang Zheng had been so focused on Grid he'd forgotten the demonic blade entirely.\n\n*Peok peok! Peok peok peok!*\n\n\"Ugh! Eek! Kek!\"\n\nThe God Hands recovered. The bombardment resumed.\n\nZhang Zheng's brief hope crumbled to ash. Around him, the Chinese section of the crowd fell silent.\n\n**[30,000 damage has accumulated. The Black King's Armor feels humiliated!]**\n\n\"Kiyaaaaah! Bastard! Die! *Dieeee!*\"\n\nThis time, Zhang Zheng was ready. The moment the stiffness broke, he yanked chains from his inventory.\n\n*Chwaruruk!*\n\nBlack iron links shot outward in every direction, snaring all four God Hands mid-flight and slamming them to the arena floor.\n\n*That's it!*\n\nSatisfaction flickered across his face. He downed another potion and pivoted toward Iyarugt. If he couldn't reach Grid, he'd cut down the sword first.\n\n*Chaaeng! Chaeng!*\n\nSteel rang against demonic metal. Zhang Zheng's focus sharpened, his technique finally clicking into place. One hundred twenty percent output. Every muscle fiber screaming. He'd wipe that smug look off Grid's face if it was the last thing he—\n\n*Snap. Snap. Snap. Snap.*\n\nBehind him, Grid casually released each chain with the Pulling Device attached to the God Hands. One by one. Four simple clicks.\n\n*Peok! Peok peok!*\n\n\"Cough! Ugh! Eek!\"\n\n*Peeeeong!*\n\nThe armor exploded again. Another 50 durability gone while Zhang Zheng had been distracted by Iyarugt.\n\n\"Bastard! You nasty bastard! Cowardly bastard!!!\" Zhang Zheng's voice cracked as he re-bound the God Hands. His eyes, bloodshot and wide, fixed on Grid.\n\nWho stood there. Hands in pockets. Not even bothering to swing a weapon. Just… managing his items. Directing his pets. Like this was some idle clicker game instead of the world's premier combat tournament.\n\nAnd the worst part? Zhang Zheng could match Iyarugt's speed. He could even push it back. But he couldn't *defeat* it. Not fast enough. Not before Grid freed the God Hands again.\n\nGrid yawned. Actually *yawned.* Then pulled out his flute and played a cheerful tune while the chains fell away from his God Hands one more time.\n\n\"...\"\n\nEven the commentators had gone silent. What could they say? This wasn't a match. It was systematic dismantling.\n\nMeanwhile, Grid's eyes narrowed thoughtfully as Zhang Zheng's armor exploded for the fourth time.\n\n*Still not quite there.*\n\nHe'd been counting. The reflection wasn't triggered by individual hits—it activated every 30,000 accumulated damage. And when it did trigger, it reflected *triple* that amount. A devastating counterattack. Which meant the armor had to have an equally devastating drawback.\n\nGrid had expected this the moment Bubat described Zhang Zheng's equipment. As a legendary blacksmith, he understood balance. Any production item that reflected three times the damage? There would be a fatal flaw.\n\nHe'd been testing his hypothesis since the match began.\n\n*Peeeeong!*\n\nFifth explosion. Zhang Zheng drank another potion, panting.\n\nThen he noticed Grid's smile.\n\n*Is this bastard… smiling? Why is he—*\n\nIce flooded Zhang Zheng's veins. The fog of humiliation cleared just enough for clarity to pierce through.\n\n*The durability.*\n\nHis armor had exploded five times. Which meant it had lost… he mentally calculated… 250 durability. If a typical legendary armor had around 300 total durability, then one more explosion would—\n\n*Peok! Peok peok!*\n\n\"N-No…!\"\n\n**[You have suffered 1,600 damage.]**\n\n**[You have suffered 930...]**\n\n**[You have suffered 965...]**\n\nPanic seized him. He couldn't swap equipment while stunlocked. The damage counter in his peripheral vision climbed toward 30,000 with mechanical inevitability.\n\n\"Stop! Please! *Please stopppp!*\"\n\nThe words ripped from his throat before pride could stop them. Begging. He was *begging* in front of billions of viewers. But the alternative—\n\n\"What if I don't want to?\" Grid's voice was flat. Almost bored.\n\nThe God Hands didn't stop.\n\n\"Today is your memorial day.\"\n\n\"You…!\"\n\nZhang Zheng's eyes went white with rage and terror. The notification window materialized like a death sentence.\n\n**[30,000 damage has accumulated. The Black King's Armor feels humiliated!]**\n\n*Peeeeong!*\n\n**[The Black King's Armor has completely lost its durability. The Black King's Armor is permanently destroyed.]**\n\n\"N-No! *Nooooooooo!*\"\n\n*Puok!*\n\nIyarugt's final strike split the air. Zhang Zheng's avatar collapsed. His vision went dark.\n\nHell released him at last.\n\n***\n\n\"The winner is Grid!!\"\n\nThe host's voice boomed through Tokyo Dome. In the competitor section, Zhang Zheng's capsule hissed open.\n\n\"You…! How dare you!\"\n\nHe exploded from the capsule before his opponent had even logged out, feet hitting the floor at a sprint. Reason abandoned him. The National Competition, the cameras, the billions watching worldwide—none of it registered. Only the humiliation. The rage.\n\n\"I will kill you!\"\n\nHis fist lashed out the moment Grid emerged, aimed directly at that infuriatingly calm face. A perfect straight punch. Fast. Precise. The kind he'd drilled ten thousand times in the academy.\n\nGrid's eyes widened slightly.\n\nThen he *moved.*\n\nZhang Zheng's fist cut through empty air. Footwork—the kind of instinctive, body-memory movement that came from thousands of hours in virtual combat—carried Grid's head back just far enough. Zhang Zheng's momentum carried him forward off-balance.\n\nGrid's boot snapped up.\n\nNot a taekwondo kick from his military service. Just… a kick. A simple, almost lazy extension of his leg that caught Zhang Zheng in the solar plexus.\n\nZhang Zheng crumpled.\n\n\"...!!\"\n\nSecurity guards froze mid-sprint, staring. Grid's movements had been so clean. So economical. A professional takedown.\n\nGrid, meanwhile, stared down at Zhang Zheng with something between confusion and pity.\n\n*Wow. He's… really bad at this.*\n\nMemories flickered through Grid's mind. School beatings. The gangsters who'd cornered Sehee and Yerim a few years back—how they'd knocked him around while a high school girl defended him. The shame of that moment had convinced him he was weak. That real-world combat was beyond him.\n\nBut Zhang Zheng's punch had seemed to move in slow motion. The form was technically correct, but there was no weight behind it. No real violence. Like someone who'd learned martial arts from a textbook.\n\n*There are people worse at fighting than me…*\n\nThe revelation was oddly comforting. Grid didn't know that Zhang Zheng was actually a certified martial artist in China. That his credentials looked impressive on paper.\n\nSome people simply couldn't translate theory into practice.\n\n\"Waaahhhhhhhh!\"\n\nThe crowd's roar shook the stadium.\n\n\"Grid properly gave a scolding to that nasty Chinese player!\"\n\n\"How can he fight so well? What can't he do?\"\n\n\"He's the real deal…!\"\n\n\"Grid! Grid!! Grid!!!\"\n\nGrid walked off the stage riding the adulation like a wave, every screen in Tokyo Dome showing his face. The main character of the world itself.\n\nBehind him, security hauled Zhang Zheng away. The penalties came down within the hour: four-month account suspension. Banned from the next two National Competitions. His burgeoning career as \"China's new star\" had lasted less than a day.\n\nBack in China, the mood was somber. But surprisingly, few blamed Grid. Zhang Zheng had started the fight. He'd embarrassed himself. The punishment was deserved.\n\nIn the Korean team's waiting room, Toon stared at the replay on the monitor, watching Grid's casual takedown over and over.\n\n\"...Doesn't Grid fight better than me?\"\n\nHis voice was small. Worried. What if he lost his job as Grid's bodyguard?\n\n***\n\nThe 3rd National Competition's PvP Event might as well have been renamed \"The Grid and Kraugel Show.\"\n\nFrom the round of 32 to the finals, they cut through their brackets like hot knives through butter. Grid relied on overwhelming attack power—enemies deleted before they could mount offense. Kraugel demonstrated perfect control, manipulating his sword with mental commands, defeating opponents without even unfolding his arms.\n\nWhen Grid fought without touching his weapons, Kraugel answered by winning without touching his sword.\n\nStrangely, not a single other Overgeared member had entered PvP this year. The Chinese media speculated it was because they knew they'd lose to Grid. A realistic assessment—most analysts agreed.\n\nThrough four matches each, neither Grid nor Kraugel faced a single moment of crisis. The crowd watched in awed silence, witnessing a level of dominance that shouldn't be possible.\n\n\"Isn't Grid several layers stronger than last year?\"\n\n\"Has to be. The growth is exponential.\"\n\n\"But Kraugel's improvement is just as dramatic. That Control Sword technique—moving the blade with his mind? That's perfect defense against Grid's God Hands.\"\n\n\"Exactly. Those four golden hands were Grid's trump card last year. Now Kraugel can just… intercept them. Without lifting a finger.\"\n\n\"So who wins?\"\n\nNobody would commit to an answer. Even the professional analysts stayed silent during broadcasts, drawing viewer complaints. After all, what were they being paid for if they couldn't provide insight?\n\nBut the truth was simpler: the experts had no idea. Grid and Kraugel had both ascended beyond predictable analysis.\n\nThe finals would tell the story. And the entire world waited with bated breath."
}