{
  "id": 768,
  "title": "Chapter 768",
  "content": "**US Team's Waiting Room**\n\nPanmir couldn't stop talking. He perched beside Lauel, words spilling out like a child staring at birthday candles. After the National Competition ended, he'd join Overgeared—a new life awaited.\n\n\"Does the Overgeared Kingdom have any blacksmith craftsmen?\"\n\n\"Five of them.\"\n\nFour had come from Pangea on the East Continent. The fifth was Khan. Grid had trained them all personally, guiding each to enlightenment and the craftsman rank. Among them, Khan stood apart—Lauel would stake his reputation that the old blacksmith ranked among the continent's top ten.\n\n\"Khan?\" Panmir's brow furrowed. \"That name... Wait, wasn't he the finest blacksmith on the continent twenty years ago? Retired after his son died?\"\n\n\"The same.\"\n\n\"But he didn't actually retire.\" Panmir's eyes widened with understanding. \"He followed Grid. Grid brought him to the craftsman rank—he's Khan's benefactor.\"\n\nHow long had Grid been cultivating talent? Remarkable.\n\nLauel's smile carried hidden meaning. \"Benefactor? Perhaps. Though I suspect Khan might be King Grid's benefactor instead.\"\n\n\"What?\"\n\n\"Nothing.\" Lauel waved dismissively.\n\nKhan's skills exceeded most players', true, but from the NPC perspective he was extraordinary. More than that, though—he'd been Grid's first friend. Teacher and student. Family.\n\nWho could understand?\n\nOn the monitors above, Grid stood at the center of the world stage. Lauel watched with unwavering eyes, his smile gentle.\n\n---\n\n**Lion's Castle**\n\nNight wrapped around the ancient stones. Every year, the PvP finals took place here—four spires, seven floors, hundreds of rooms connected by winding corridors. A ruin now. Whatever civilization had built this place had crumbled, leaving only desolation and whistling wind.\n\n*Chichik. Chijijik.*\n\nStone powder drifted from the hundreds of pillars supporting the roof. Each trembled, on the verge of collapse.\n\nIn the central square, beside a crumbling fountain, Grid and Kraugel faced each other. Neither moved. Neither breathed.\n\nThe powder settled.\n\nThey exploded forward.\n\n*Chaeeeng!*\n\nDarkness incarnate—Kraugel's +9 White Fang left no afterimage as it shot toward Grid's throat.\n\n**[Complete evasion failed. You have suffered 1,290 damage.]**  \n**[Triple Layers durability decreased by 1.]**\n\n*Kwajajajak!*\n\nGrid's Enlightenment Sword tore through the darkness, bird-of-prey talons that shattered the old fountain's stone.\n\n\"Damn!\"\n\nEven with Alex's Quick Gloves, Grid couldn't land a clean hit. Kraugel moved like water—Super Sensitivity and natural talent combining as he spun, blade already returning.\n\n*Peeeeeong!*\n\nSteel rang on steel. Grid's sword intercepted White Fang behind his back.\n\n**[You have blocked a powerful blow!]**  \n**[Your hands are temporarily paralyzed.]**  \n**[You have resisted.]**  \n**[+9 White Fang durability decreased by 2.]**\n\n\"Kuk...!\"\n\nThe impact drove Kraugel back a step. Grid's new sword hit harder than expected—far harder.\n\n\"How is it?\" Grid pressed forward, the Slaughterer's Eye Patch and his insight tracking Kraugel's movements with deadly precision. \"Have I become stronger?\"\n\n\"The best.\"\n\n\"Ha!\"\n\nPride surged through Grid's veins. His heartbeat thundered. He advanced, Enlightenment Sword grinding against White Fang, footwork ready to capitalize—\n\n\"Crushing Sword.\"\n\n*Hwiririk!*\n\nWhite Fang twisted. The Enlightenment Sword turned with it. Grid's wrist turned with it.\n\n*Kwajajajak!*\n\nPain shot up Grid's arm like lightning.\n\n**[Your wrist has been fractured.]**  \n**[You have entered the 'fracture' state.]**  \n**[Attack speed reduced by 50% for 20 seconds. Damage reduced by 30%.]**  \n**[Lightning Sword Born from Enlightenment and Strong Desires durability decreased by 12%.]**\n\n*Shit!*\n\nPhysical debuff *and* weapon damage? Grid's mind raced. Kraugel had mastered the sword to become a Sword Saint. The world's strongest player—and Grid had forgotten that for one critical second.\n\n*Seokeok!*\n\n*Pa-pa-pa-pat!*\n\n**[You have suffered 4,700 damage.]**  \n**[You have suffered 3,950 damage.]**  \n**[You have suffered 4,230 damage...]**  \n**[You have suffered 4,110 damage...]**\n\nThe slashes came too fast. Even Grid's enhanced perception couldn't track them all. The Sword Saint's passive damage boost cut through Triple Layers' defense like paper—a minimum compensation that scaled with the enemy's armor, making Grid's legendary protection nearly worthless.\n\n\"God Hands!\"\n\nGrid reset. Four golden hands materialized behind him, shimmering in the moonlight that pierced the darkness—\n\nFour control swords shot from Kraugel's inventory.\n\nThe God Hands scattered.\n\nControl Sword—a Sword Saint could manipulate ten blades simultaneously. Most people couldn't coordinate their body and weapons together.\n\n*Sururuk.*\n\nBut Kraugel was the sky above the sky. His control swords danced while he moved with White Light Steps, melting into moonlight.\n\n*'He's—!'*\n\nToo late. Grid swung his sword.\n\n*Supaak!*\n\nHis fractured wrist betrayed him. Kraugel moved at maximum speed—a Sword Saint passive with sword-type weapons—and Grid's blade cut only air.\n\n**[You have suffered 4,900 damage.]**\n\n\"Cough!\"\n\nBlood sprayed from Grid's side. Kraugel flowed past him like water, claiming Grid's blind spot. A perfect opening.\n\n*Clink!*\n\nKraugel bent low. His stance shifted.\n\nSpace Sword.\n\n*Sakak—!*\n\nWhite Fang blazed with black light. The ground, the darkness, the moonlight itself—\n\n*Jjejeok! Jjejejejeok!*\n\n—split in half simultaneously.\n\nThe target took no damage.\n\nFreely Move had carried Grid beyond the attack's range. Non-targeted skills couldn't touch him while the ability lasted. Even the glorious Sword Saint couldn't harm the Secret Hero who'd saved the world.\n\n*Kwajak!*\n\nGrid dropped. Rose. Simple movements that carried him past Space Sword's reach—and brought his blade down on Kraugel's body.\n\n**[You have suffered 9,490 damage.]**\n\n\"...!\"\n\nKraugel's eyes widened. Forty percent passive damage reduction from sword-type weapons—but this hit cut deeper than it should have.\n\nThe primary damage was only the beginning.\n\n*Kuwaaaaaang!*\n\nBlack flames erupted. Three hundred percent damage modifier.\n\n**『Ah...!』**\n\nCommentators around the world cried out. This was the immediate-execution skill that had destroyed Tarma, one of the tournament favorites. Some predicted Kraugel's death on live television.\n\n**『P-Player Kraugel! Surely he won't be eliminated like this?』**\n\nThe legendary class immortal passive was common knowledge now. The commentators knew Kraugel wouldn't die from this. But drama demanded exaggeration—they had to sweep the audience into nervous anticipation.\n\nThose who'd cheered for Kraugel watched the black flames with held breath. They didn't want the sky above the sky to fall. Not like this. Not after so many years.\n\n*Chwaruruk!*\n\nA shield of light consumed the flames. The inferno sweeping through Lion's Castle vanished without trace—Sword Curtain, the Sword Saint's defensive skill. It consumed sword energy to create a protective barrier of dozens of blades, blocking all magical and physical damage.\n\n\"...Wow.\"\n\nGrid's hands were slick with sweat. So this was what his opponents felt—facing someone whose class bordered on cheating.\n\n\"Isn't this a scam?\" The words escaped before he could stop them.\n\nThe Sword Saint, strongest legendary class, revealed his full majesty against the Overgeared King.\n\n**[You have discovered a strong person of this era!]**  \n**[The Hero King's fighting energy has started to boil!]**\n\nGrid's completion answered Kraugel's. His fighting energy—held at ten because of Kraugel's lower level—began to rise. The Sword Saint class triggered the hidden effect.\n\n*Kuooooh!*\n\nRed and purple aura wrapped around Grid's body like a heat haze.\n\n\"What's that?\"\n\n\"Whoa. It's *cool*.\"\n\nThe crowd noticed. The viewers noticed. The mighty power of the Undefeated King, whose very existence was legend—Grid had inherited his will and now exposed it to the world.\n\n*Duguen!*\n\nKraugel's instinct flared.\n\nThis year's match would be far harder than the last."
}