{
  "id": 769,
  "title": "Chapter 769",
  "content": "**\"Now the real battle begins.\"**\n\n*Kuoooooh!*\n\nRed and purple energy erupted around Grid's form. Kraugel recognized it immediately. Sword Saint Muller had also held the title of Hero King.\n\n*'Fighting Energy...'*\n\nJust as Grid had studied Pagma's legacy, Kraugel had learned every detail of the former Sword Saint's life—secrets most would never know. Fighting Energy wasn't foreign to him.\n\n*'The power that defines true heroes.'*\n\nMuller had achieved perfection by mastering both Fighting Energy and sword energy. The moment Grid claimed the Hero King title, that particular path had closed to Kraugel forever. Had he been chasing Muller's shadow, such a realization would have crushed him. But Kraugel was forging his own legend. The Hero King title meant nothing to one who refused to walk in another's footsteps. When Grid ascended to that rank, Kraugel had celebrated without reservation or envy.\n\n*Clink!*\n\nThis would eclipse last year's duel in difficulty. Facing Grid's Fighting Energy, Kraugel's expression smoothed into perfect calm. Yet beneath that mask, his palms slicked the grip of White Fang with cold sweat. The tension rivaled his confrontation with Great Demon Drasion—meaning Grid's presence now matched or exceeded that of a weakened great demon.\n\n\"Everything changes now!\"\n\nGrid charged forward, exhilaration burning in every word. His Fighting Energy surged higher, translating into raw speed and devastating power.\n\n*Jeeeeeong!*\n\n\"Kuk...!\"\n\nGrid's blade descended with impossible velocity. Kraugel's teeth ground together as he blocked. The weight behind the strike felt like a mountain crashing down. Body and mind pushed to their absolute limits.\n\n*Jaaeng! Jjejeong! Jjeejeeeong!*\n\nEach clash drove Grid's Fighting Energy higher, accelerating his attacks further. Relentless torrents of black and crimson light hammered Kraugel from every angle, forcing him back step by agonizing step.\n\nFinally—\n\n*Tak!*\n\nKraugel's back struck an ancient pillar. Grid was already closing the distance, his footwork flawless.\n\n\"**Pinnacle!**\"\n\nOne of Pagma's Swordsmanship's fundamental techniques. The devastating skill that ignored a percentage of defense descended like a thunderbolt. A question flashed through Kraugel's mind—hadn't he countered Pinnacle twice before? Every time Grid deployed it, Tearing the Sky had punished him brutally. Grid couldn't have forgotten that.\n\n*'He's setting up something else.'*\n\nInstinct screamed at Kraugel to avoid Tearing the Sky. As Grid's sword fell, Kraugel raised Sword Curtain instead.\n\nMeanwhile—\n\n*'Tch!'*\n\nGrid, who'd been preparing Revolve, clicked his tongue. His plan had been elegant: let Kraugel counter Pinnacle with Tearing the Sky, then use Revolve to redirect that counter right back at him. All for nothing.\n\n*Jjejeong! Jjejejeok!*\n\n*Kuwaaaaaang!*\n\nPinnacle colliding with Sword Curtain generated a shockwave of apocalyptic force. Naturally, the pillar behind Kraugel—along with two others within three meters—disintegrated in the blast. A corner of the castle crumbled.\n\n*Kurururung!*\n\nFalling debris and billowing dust clouds swallowed both fighters. Commentators and spectators craned their necks, searching desperately for any sign of movement.\n\n*Kuuong!*\n\nGrid burst from the smoke in a powerful leap. The instant his feet found purchase, he cast a spell.\n\n\"**Magic Detection!**\"\n\n> [**Magic Detection (Enhanced)** has been used.]\n\n*Paaaat!*\n\nMana rippled outward from Grid's body, scanning his surroundings.\n\n**Name:** Kraugel  \n**Level:** ???  \n**Class:** ???  \n**Stats:** ???  \n**Race:** Human  \n**Status:** Player\n\nSince advancing Magic Detection (Enhanced) to Lv. 3 on the East Continent, it revealed fragments of target information—more importantly, it pinpointed Kraugel's exact location. Directly ahead.\n\n*Chaeeeng!*\n\nGrid's blade whipped around, striking what appeared to be empty air.\n\n*Sururuk.*\n\nA full moon hung above the towering spires. Kraugel materialized from the moonlight itself—White Light Steps dissolving his concealment. His breathing came ragged as he deflected Grid's strike. Commentators, spectators, and viewers worldwide registered the sequence with growing unease.\n\n『Kraugel's condition seems... off?』\n\n『You noticed it too?』\n\nUnlike Grid, Kraugel didn't overwhelm opponents through superior stats, skills, or equipment. He dismantled them with surgical precision and flawless control. Yet that legendary control seemed absent against Grid. Throughout the entire battle, he'd fought like any other skilled player—relying primarily on techniques.\n\nSpeculation rippled through the crowd.\n\n\"Has Kraugel's control degraded?\"\n\n\"Or has Grid's control reached Kraugel's level...?\"\n\n\"Either way, this is nothing like their previous matches.\"\n\nPeople revered Kraugel precisely for his godlike control. The ability to move with such efficiency. To make split-second decisions under impossible pressure. How many rankers could match even half his skill? Everyone wondered that constantly.\n\nBut watching this fight, those thoughts evaporated. Kraugel seemed diminished compared to his usual dominance against Grid.\n\n*'Is this a side effect of becoming Sword Saint?'*\n\nA legendary class. Undoubtedly, Sword Saint possessed the most overwhelming raw power among such classes. Space Sword literally tore reality apart. Perhaps Kraugel had become drunk on these devastating abilities, forgetting the fundamentals that built his legend? Had skill dependency eroded his control?\n\nNone of them could have imagined the truth. At this very moment, Kraugel was controlling four swords simultaneously against the God Hands—countering Grid's vastly improved summoned weapons, which had evolved dramatically since last year. Splitting his concentration across four separate blades meant less precision available for fighting Grid directly. But no one understood Control Sword's principles well enough to grasp his predicament.\n\nOn the other hand—\n\n*'He's struggling.'*\n\nGrid vaguely sensed Kraugel's situation. It made sense. Directing the God Hands with sufficient finesse required an incredibly sophisticated command structure—even for Pagma's Descendant. Grid deduced that Control Sword would impose similar demands, and he was absolutely correct. Kraugel's mental power depleted twice as rapidly when utilizing Control Sword.\n\n*'God Hands! Keep hammering Kraugel! Don't give him a moment's rest!'*\n\nGrid maximized the God Hands' effectiveness. He exploited their autonomous ego functions to the fullest—the majesty of legendary-exclusive items that Kraugel had yet to acquire.\n\n*Peng! Pepepepeng!*\n\nThe God Hands locked onto Kraugel and unleashed volleys of Magic Missiles. His four swords intercepted Mjolnir's attacks. Rather than force Mjolnir through that defense, Grid ordered the God Hands to provide ranged support instead.\n\n*Syuok! Syuok!*\n\nKraugel wove in sharp zigzags, evading Magic Missiles. Grid attacked ruthlessly during those defensive gaps. Even when Kraugel tried activating Super Sensitivity to mount a counteroffensive, he was forced to abandon it immediately. Then a second Grid materialized at his back—Doppelganger Randy. For the first time across three confrontations with Kraugel, Grid had summoned his pets. The Battlefield event had opened his eyes. Pets were skills in their own right. Refusing to use them in the name of \"fair play\" was simply wasteful.\n\n\"**Kill!**\"\n\nSimultaneously, Randy replicated his master's technique.\n\n\"**Tearing the Sky.**\"\n\n*Kwajak! Kwajajak!*\n\nThe instant Randy appeared, Kraugel's counter struck him down. One of Grid's most trusted companions for years turned to gray particles and vanished. But Grid felt no distress.\n\n\"Sorry...!\" He apologized to Randy's fading form. \"That was perfect!\"\n\nGrid sent silent thanks.\n\n\"**Pinnacle Kill!**\"\n\nFinally, he completed the footwork sequence for his fusion skill—something Kraugel's relentless pressure had prevented throughout the entire battle. Without Randy drawing Kraugel's attention for that crucial instant, Grid would never have finished it.\n\n*Kuooooh!*\n\nAn ultimate slash infused with killing intent, transitioning seamlessly into a piercing thrust. The technique Grid had perfected while battling his clone on the Behen Archipelago—devastating to any target because it ignored defense percentages. The second most powerful skill in all of Pagma's Swordsmanship.\n\nA skill that even Kraugel's counter—Tearing the Sky—couldn't fully neutralize. Last year, Kraugel had barely blocked it using Jajinmori, which activated instantly at close range.\n\n*'Too slow...!'*\n\nThis year's Kraugel had fallen for Randy's feint. His reaction to Pinnacle Kill came a heartbeat too late.\n\n*Sakak—!*\n\nThe black and crimson blade fell in a perfect line toward Kraugel.\n\n*Puok!*\n\nThen the thrust followed. The most powerful skill—exerting tremendous force but placing immense strain on the user's muscles, risking 4,500 health loss.\n\n> [You have dealt **69,300 damage** to the target!]\n\nWhat did 4,500 health matter compared to landing a critical wound on Kraugel? Grid smiled in satisfaction.\n\n*Snap!*\n\nKraugel produced a gold peach and bit down. The ultimate recovery item he'd earned as Pangea's Little Hero. The gold peach restored health to maximum instantly. Grid had ignored various PvP rules designed to create a \"grand spectacle.\" Now Kraugel utilized the newly implemented \"consumables allowed\" rule to its fullest extent.\n\n\"What...?\"\n\nGrid stared in confusion as Kraugel's health bar refilled completely.\n\nKraugel disengaged using Jajinmori, then initiated one of the Sword Saint's unique ultimate techniques—**Condemnation Sword**. Unlike the area-of-effect Space Sword, this technique targeted a single opponent with power that transcended even that legendary skill. A full-scale counteroffensive had begun.\n\nBy using Space Sword early in the match, Kraugel had deliberately baited Grid into wasting Freely Move. He stood in a winning position now. Even if victory was only 1% certain, Kraugel hoped. He wished to remain Grid's goal for one more year—and swung Condemnation Sword with absolute sincerity.\n\nBut there was an old saying: Heaven doesn't love short-lived geniuses. Brilliant talent often came with lethal curses.\n\n> [**True White Fang** is resonating!]\n> \n> [The curse **'Bunhelier's Gaze'** is activating!]\n> \n> [Retreat!]\n\n**[Bunhelier's Gaze]**  \nThe evil dragon Bunhelier is always watching over you.  \nYou might be attacked on days when Bunhelier feels particularly grumpy.  \n**Skill Activation Condition:** Random\n\nThe curse attached to White Fang—one that had never activated before—chose to trigger now, in the match Kraugel had dreamed about for an entire year.\n\n*Kurwarwarwarwa!*\n\nWith a roar that shook the earth itself, an enormous shadow eclipsed the moon entirely.\n\n\"**Avoid it!**\"\n\nKraugel abandoned Condemnation Sword mid-cast and shouted urgently at Grid. The worst possible situation had occurred due to RNG. There was no one to blame, no time for recriminations. Kraugel simply couldn't allow this to escalate. He couldn't bear the consequences if Grid was trampled by a dragon while the entire world watched. Responsibility for this situation rested on his shoulders alone.\n\n\"**Freely Move!**\"\n\nThe title's acquisition condition: 'Raid three named bosses higher level than yourself alone.' It wasn't Grid's exclusive skill. Though one step behind Grid, Kraugel had also earned this title this year. Which meant he could use Freely Move as well.\n\n*Supaak!*\n\nKraugel escaped Bunhelier's breath, scaled the gray dragon scales, and reached its massive head. His black eyes blazed beneath black hair as he faced the dragon—while the world watched, stunned speechless. Only two people in the world understood the present situation: those who knew White Fang's hidden options. One of them was Grid.\n\n\"Damn lizard...!\"\n\n*Appearing at this exact moment to ruin the match?*\n\n*Kwaduduk!* A distinctively purple Fighting Energy erupted around Grid's body. His gaze locked solely on Bunhelier. He ignored Kraugel completely.\n\nThen—\n\n\"**100,000 Army Massacre Sword.**\"\n\nThe power of the Undefeated King revealed itself to the world."
}