{
  "id": 771,
  "title": "Chapter 771",
  "content": "**[You have dealt 1,430...]**\n**[The black flame explosion...]**\n\n*Bang! Bang-bang-bang!*\n\n『 P-Player Grid is relentless! He won't let up! 』\n\n『 Grid's attack power is completely overwhelming Kraugel! 』\n\n『 The 100,000 Army Massacre Sword...! Now I understand the name! That power is terrifying! 』\n\n『 Notice how the black flames keep detonating—they seem to trigger automatically alongside his other skills, suggesting a passive... 』\n\n『 Wait, really? 』\n\nThe stadium erupted as Grid hammered Bunhelier with the 100,000 Army Massacre Sword—thirty consecutive strikes. The dragon's scales, which had completely nullified Sword Saint Kraugel's attacks moments before, actually *took damage*. Grid's overwhelming dignity had pierced even the hidden SSS-rated skill, Absolute Defense.\n\nBunhelier's massive body trembled.\n\nFor a fleeting moment, spectators and viewers alike wondered if Grid might actually succeed in taking down the dragon. \n\nReality crushed that hope immediately.\n\nBunhelier's health hadn't dropped even a fraction. It was like someone keying a luxury car—sure, you might scratch the paint, but the vehicle itself remains pristine. Even the faint marks Grid's attacks left on those impervious scales were already healing, the grey surface knitting itself back together in real-time. His damage couldn't keep pace with the dragon's regeneration.\n\n\"No way...\"\n\nThe crowd's excitement died as they realized the truth through the flashy effects. Despite Grid landing dozens of devastating blows, Bunhelier's health bar hadn't budged.\n\n'Ten billion HP? More?'\n\nIf Great Demon Belial was estimated to have two billion health, then a dragon—a being that eclipsed even the 1st Great Demon Baal—could easily possess ten billion or higher. Between the defense, the size, and that regeneration... even if Grid could spam 100,000 Army Massacre Sword indefinitely, raiding Bunhelier was impossible.\n\nGrid didn't even know about the One Million Army Massacre Sword.\n\n\"...I'm sorry.\"\n\n*Thud!* \n\nAs Kraugel struck Bunhelier's snout, drawing those enormous eyes toward him, he turned to Grid with an apology. He had no choice but to bow his head before the world's apex predator. \n\nBefore a dragon, even Kraugel felt small.\n\n*KRAKOOOM!*\n\nThe ground heaved. Grid lost his footing and crashed down—not from an earthquake, but from the shockwave of Bunhelier taking a *single step* as it moved to crush Kraugel underfoot. To a dragon, humans were insects. Grid, who'd managed to scratch its scales? From Bunhelier's perspective, he was no different from Kraugel. Mildly irritating at best. Not even worth true attention—just ants nipping at its claws.\n\n*GROOOOOOAR!*\n\nBunhelier exhaled.\n\nGrid and Kraugel had zero chance of surviving the devastating attack that swept across the ruined castle arena. When both fighters dissolved into grey light simultaneously, the stadium fell into shocked silence.\n\n\"...Even Grid and Kraugel together can't touch a dragon.\"\n\n\"That breath range is broken. How could anyone survive that? You could throw every player in the game at it and they'd be wiped in ten minutes.\"\n\n\"Wait... why the hell did a dragon just crash our PvP match?\"\n\n\"...\"\n\nThe initial awe wore off, and anger replaced it. The crowd finally registered the absurdity. The confrontation they'd waited over a year to witness had ended in utter anticlimax.\n\n\"Is this a *joke?*\"\n\n\"I want a refund!\"\n\n\"Boo! BOOOOO!\"\n\nThe audience turned on the organizers, convinced this was some catastrophic production failure. They'd already dismissed Bunhelier as a concern—it was too far beyond their world to matter. What they wanted was accountability from people within reach.\n\nMeanwhile, Bunhelier stood alone amidst the devastated arena, the so-called worst existence that should have terrorized the world alongside Insane Dragon Nevartan. For perhaps the first time in its ancient life, the dragon felt... uncertain.\n\nThen—\n\n\"Wait! Look!\"\n\n\"Was it staged after all?\"\n\nThe broadcast feed switched. The arena had changed. This new space was vast enough to make humans look like specks of dust—large enough that Bunhelier could spread both wings fully and still have room to spare.\n\n\"A dragon's lair?\"\n\nRealization rippled through the crowd as they understood this was the new PvP stage.\n\nGrid and Kraugel, freshly resurrected, checked their notifications.\n\n**[You were killed by Bunhelier. The evil dragon's venom has penetrated deep into your lungs. Until you die again, all types of health recovery are reduced by 60%.]**\n\n\"...\"\n\nA terrible curse, solvable only through death. Kraugel's face darkened, his expression bitter. For the first time in his life, he felt true helplessness.\n\nBoth in reality and in Satisfy, whenever he'd faced a superior opponent, he'd believed he could eventually surpass them. But dragons? They were something else entirely—beings he could spend his whole life chasing and never reach. The encounter had branded itself deep into Kraugel's psyche, and he had no desire to ever face a dragon again.\n\nGrid, however, was different.\n\n\"Ah, *shit!*\"\n\nGrid paced back and forth, practically vibrating with agitation. An opponent impossible to overcome? Unlike Kraugel, Grid had experienced that sensation *countless times*. He'd learned to transform helplessness and frustration into fuel for growth. His reaction stood in stark contrast to Kraugel's resignation.\n\n\"That goddamn *lizard!* Killing people and not even apologizing? That bastard! Next time we meet, I'm getting payback! I'll—I'll at least cut its health in half! Yes! I'll forge items specifically designed to counter dragons!\"\n\n\"...\"\n\nKraugel stared, taken aback by Grid's burning resolve. Those eyes promised Kraugel an unexpected future.\n\n\"I'll summon that lizard for you later.\"\n\n\"...What?\"\n\n\"When that time comes, you and I will be armed with dragon-slaying equipment and we'll peel that layer of scales right off. And then... hehehehe! We'll craft armor from them. How's that sound? Doesn't just imagining it make you excited?\"\n\n\"...\"\n\nKraugel had known Grid was exceptional. But this exceeded all expectations.\n\n'His capacity expands mine.'\n\nExpression complicated, Kraugel returned his focus to the present.\n\n\"So... what now?\"\n\nGrid noticed the cameras activating again and realized the PvP match was about to resume. They were still suffering from the evil dragon's curse—the recovery effects from Doran's Ring, Elfin Stone's Ring, and Cray's Power were all nullified. Kraugel's situation was identical. For someone who relied on the Troll King's Curse, the Spear of Bitter Grief, and Red Sword Style for sustain, it was a potentially lethal handicap.\n\nNaturally, S.A. Group hadn't overlooked this complication. The organizers removed the curse, invoking divine intervention.\n\n**[Goddess Rebecca has purged you of the evil dragon's extreme venom.]**\n\nSimultaneously—\n\n『 We hope you enjoyed the spectacular appearance of the evil dragon Bunhelier, adding unprecedented drama to our PvP finals! The second round will now commence on a brand new stage—the lair of evil dragon Bunhelier himself! 』\n\nThe host, clearly reading from an emergency script, bellowed the announcement with forced enthusiasm.\n\nGrid and Kraugel caught each other's eyes and laughed quietly.\n\n\"The host is suffering too.\"\n\n\"Agreed.\"\n\n\"Let's finish this. I'm exhausted from fighting, fighting, and more fighting.\"\n\n\"A sea of hope awaits.\"\n\nNo further words were needed. Their resources—health, mana, skill cooldowns—had been restored to their pre-Bunhelier states. The two warriors surged toward each other.\n\n*Clash!*\n\nWith his fighting energy exceeding 50, Grid's attack power had grown overwhelming. Kraugel found himself increasingly forced onto the defensive during their sword exchanges. He evaded, then launched a barrage of weapons with Control Sword. The blades came from every angle, making conventional dodging impossible.\n\nGrid didn't search for an escape route. He wasn't afraid. Blacksmith's Eyes revealed the swords' ratings: Unique to Legendary. And Grid's defense? He judged that unless Kraugel wielded them directly, the weapons wouldn't penetrate his armor.\n\n*Thunk! Thuuud!*\n\nGrid's fighting style: trade damage to deal damage. He aimed counterattacks at Kraugel every time a sword struck home. Then he suddenly froze—several blades had pierced his right elbow joint. The physical obstruction prevented his arm from rotating properly.\n\n'Damn it...!'\n\nGuided strikes?\n\n'What the hell...?'\n\nAs frustration and grudging admiration warred within Grid—\n\n\"Condemnation Sword.\"\n\n*Crackle! Crackle-crackle!*\n\nA silver blade rose, wreathed in energy. The same technique Bunhelier's intrusion had interrupted earlier. Now it threatened Grid once more.\n\n*Clink!*\n\nMoving the hand gripping his sword was impossible. Grid made his choice instantly, raising his left hand and summoning Iyarugt directly from his inventory. Kraugel expected him to counter with Revolve.\n\nGrid chose differently.\n\n\"100,000 Army Massacre Sword!\"\n\n'At *this* timing?'\n\n*BOOM-BOOM-BOOM-BOOM-BOOM-BOOM-BOOM!*\n\nThe ultimate technique that had penetrated even a dragon's scales erupted toward Kraugel. He was engulfed—but not before silver light flashed from his sword tip."
}