{
  "id": 772,
  "title": "Chapter 772",
  "content": "Every warrior saw the battlefield differently. Two fighters could face the same opponent yet walk away with entirely different lessons. Those who found inspiration rather than fear were the ones who surged ahead.\n\n*This time, Grid was the one moving forward.*\n\nThe Evil Dragon Bunhelier—an absolute existence beyond raiding, beyond challenge. Where Kraugel had turned away in defeat, Grid burned for revenge. That difference in mindset was everything. After facing Bunhelier, Grid would grow at a rate Kraugel couldn't match.\n\nIf he wanted to keep pace, Kraugel couldn't afford to run from that dragon either. But first, Grid had driven him to the brink.\n\n\"Condemnation Sword!\"\n\nOne of the Sword Saint's ultimate techniques—an attack that dealt damage equal to one hundred percent of the target's defense. Useless against Bunhelier's impenetrable scales, but devastating against Grid. Silver light erupted along White Fang's edge as Kraugel closed the distance.\n\n\"100,000 Army Massacre Sword!\"\n\n\"...!\"\n\nKraugel had expected a defense or counter. Instead, Grid unleashed the very technique that had wounded Bunhelier—the strongest skill in his arsenal.\n\n*Why?*\n\nGrid's power scaled with accumulated Fighting Energy. Logic dictated he should hoard every point. Yet here he was, burning it all on the Massacre Sword. Kraugel's mind raced. What was Grid thinking? What was he—\n\n\"Freely Move!\"\n\nThe Secret Hero title flared to life. Kraugel became untouchable, his body flowing like water through the storm of thirty strikes per second that erupted at point-blank range.\n\n\"Incredible...!\"\n\nGasps rippled through the arena. The crowd watched in awe—Grid's sword blurring into impossibility, Kraugel dancing untouched through the onslaught.\n\n*Crackle! Crackcrackle!*\n\nRed afterimages hung in the air like wounds in space itself.\n\n*Thunk!*\n\nKraugel materialized at Grid's flank, White Fang already thrusting home.\n\n[You have dealt 53,400 damage to the target!]\n\n*Squelch!*\n\nThe blade sank deep into Grid's side. Blood sprayed. A critical strike. For one brilliant moment, victory gleamed within Kraugel's grasp—\n\nThe crowd's cheers turned to gasps of dismay. Grid had earned their respect by damaging Bunhelier. Now they were watching that same warrior fall to someone they considered his equal. Many felt the sting of seeing a hard-fought battle end like this.\n\nKraugel prepared to chain into his White Sword, Black Sword, and Twin Sword combination techniques.\n\nThen—\n\n\"...!\"\n\nHis eyes widened. \n\nKilling intent crystallized at Grid's sword tip—dense, familiar, and utterly terrifying. Kraugel knew this aura.\n\n*Linked Kill Wave Pinnacle...!*\n\nThe ultimate fusion technique Grid had unveiled during the Belial Raid. The power Kraugel feared most. The entire reason he'd spent the finals disrupting Grid's footwork was to prevent exactly this.\n\nGrid had completed it. While Kraugel was locked onto the Massacre Sword, Grid had finished the stance.\n\n*This was his plan all along.*\n\nGrid had sacrificed Fighting Energy and wasted his strongest technique just to bait Kraugel's attention. He'd thrown away the Massacre Sword as a feint to complete his footwork. No—wait. The Massacre Sword wasn't his strongest technique at all, was it? Linked Kill Wave Pinnacle was.\n\nA chill ran down Kraugel's spine. Cold sweat broke across his back.\n\n*ROOOOAAAAAR—!*\n\nThe Enlightenment Blade howled. Flames erupted along its length—Kraugel only now realized the sword before him had been burning this entire time. He'd walked into the trap the moment Grid used the Massacre Sword on Bunhelier. The spectacle had been so dazzling, so overwhelming, that Kraugel had dismissed Linked Kill Wave Pinnacle as obsolete. He'd already burned Freely Move.\n\nHe had nothing left.\n\n*Stab!*\n\n*Stab stab stab!*\n\nThe Enlightenment Blade came alive. Like a fish returning to water, the killing intent poured out—fluttering like a butterfly, stinging like a hornet.\n\n[You have suffered 43,100 damage.]\n\n\"Kuk...!\"\n\nEven Kraugel couldn't fully evade it. His Super Sensitivity passive helped—no cooldown or cost like the active version—but it was weaker by comparison. If he'd reached level 300, if his stats had undergone Third Awakening, his superior agility might have maximized Super Sensitivity enough to slip through Linked Kill Wave Pinnacle entirely.\n\nBut Kraugel was still in the 200s. He was using Control Sword to suppress the God Hands. There hadn't been enough time since obtaining the Sword Saint class—not nearly enough.\n\n*Stab stab!*\n\n[You have been hit by a lethal blow!]\n\n[A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\nThe immortal passive triggered despite the Sword Saint class's damage mitigation. Kraugel staggered as Kill transitioned into Wave, and Grid's voice cut through the chaos.\n\n\"Next year's champion...!\"\n\nLast year's PvP winner. Kraugel the champion. Everyone's idol, everyone's goal. Grid had watched him with burning eyes all this time, desperate to claim that title.\n\n\"I will be next year's champion!\"\n\n*KRAAAKOOOOM!*\n\nGrid's will to win erupted like never before. The Enlightenment Blade responded with savage joy. Black flames detonated in waves. Red lightning crashed down on Kraugel's position.\n\n\"Guh! Passing the Sky!\"\n\nEngulfed in the sword energy storm, Kraugel gritted his teeth and launched his counterattack against the final Pinnacle strike.\n\nPassing the Sky—Kraugel's ultimate counter, evolved from Tearing the Sky. Its power rivaled Revolve itself. Unlike Grid's techniques, Kraugel could unleash it instantly, no footwork required. In pure terms, it exceeded Revolve.\n\n*CLAAAAAANG!*\n\nIt collided with the finishing blow of Linked Kill Wave Pinnacle.\n\n\"Gah!\"\n\nBlood erupted from Grid's chest. And in that opening—\n\n\"HAAAAAAAH!\"\n\nKraugel pushed through on his immortal passive, unleashing a furious assault. One decisive strike to force Grid's immortal passive as well, then reverse the entire battle—\n\n[Your health has dropped below 10%. 31,600 health is instantly restored due to the effect of Tiramet's Power attached to the Rune of Darkness.]\n\n[A great king puts his safety first. Due to the First King title effect, a shield with 92,800 defense will be created.]\n\n\"What—?!\"\n\nShock colored Kraugel's voice. White Fang, stabbing toward Grid's heart—\n\n*CLAAAAAANG!*\n\n—shattered against a radiant shield that blazed around Grid like a miniature sun.\n\n\"Incredible!\"\n\n\"Oh my god...\"\n\nThe arena exploded with amazement. Grid's health restored, a brilliant barrier manifested—his defensive capabilities matched renowned tanks like Vantner and Bubat.\n\n\"Blackening!\"\n\n\"Splitting the Sky...!\"\n\nKraugel refused to surrender. His sword techniques rained down on Grid without mercy. If only he had the levels, the resources to utilize the Sword Saint class fully—\n\n*Crack crack crack!*\n\n*CLANG!*\n\nNeither warrior slowed. Grid's stats skyrocketed from Blackening and Fighting Energy while Kraugel's immortal passive expired. Finally, Kraugel made his choice—he recalled the swords harassing the God Hands. His dispersed attention reunited. His focus sharpened to a knife's edge.\n\n*Clang! CLAAAANG!*\n\n\"Kuk...!\"\n\nGrid fell back on defense. The radiant shield dimmed with each impact. But Kraugel was a guttering flame. The moment the God Hands rejoined Grid's assault, Kraugel's depleted resources caught up with him. He was being overwhelmed.\n\nAt last—\n\n*SHIIIIING!*\n\n*Stab! SQUELCH!*\n\nThe instant Kraugel shattered Grid's shield, Grid's sword pierced clean through his chest. After becoming Pagma's Descendant, Grid had conquered countless quests and risen to kinghood. Meanwhile, Kraugel had focused purely on leveling since changing to Sword Saint.\n\nThat was the difference between them. It had been clear from the start. Time was never on Kraugel's side.\n\n\"Grid.\"\n\nThe God Hands transformed via Item Transformation into Lifael's Spears—four radiant lances that impaled Kraugel's body. Before he dissolved into grey light, knowing the world was watching, he spoke.\n\n\"From now on, you are my idol. I will be the challenger.\"\n\nKraugel understood. The way Grid had always looked at him—envy, longing, admiration mixed with frustration. That burdensome gaze would vanish now. Finally, he was free.\n\n*Heh...*\n\nKraugel smiled warmly. His bloodied hand reached up to touch Grid's cheek—\n\n*Ssssshhhhhaaaa—*\n\nHis body scattered into grey light. The victor of the 3rd National Competition's PvP finals was decided.\n\n『 With this result, South Korea claims first in the overall rankings!! 』\n\n\"WAAAAAAAAAAAAH!\"\n\nAll of South Korea erupted. Fifty million people screamed themselves hoarse. Some laughed until they wept. Others simply wept.\n\n\"That's my son! My son is the best!\"\n\n\"Oppa...!\"\n\nNo one cried harder than Grid's family. They'd witnessed their son—their brother—defeat the world's greatest player and earn his recognition. Gratitude overwhelmed them.\n\nMeanwhile, Grid stood alone on the PvP stage.\n\n\"...\"\n\nHe clenched his jaw. Tears threatened to spill over. He held his silence for a long moment before shouting in a trembling voice:\n\n\"Log out.\"\n\nTime to return to reality. He'd finally won the title he'd dreamed of.\n\n***\n\n『 Player Grid has shattered the sky above the sky and carried South Korea to first place in the overall rankings. 』\n\n『 Who could have predicted South Korea would reach number one? 』\n\n『 I'm moved to tears. Player Grid is truly a son that all of South Korea can be proud of. 』\n\n\"Player Grid! How are you feeling right now?\"\n\n\"What does it feel like to become the new sky?\"\n\nHundreds—thousands—of camera shutters clicked without pause. Questions from reporters and cheers from the crowd overlapped into a deafening roar. Four years and five months since Satisfy's launch changed the world, and interest had never been hotter. Grid's name and face dominated global news. Every feat he'd accomplished was being revealed to the entire world.\n\nGrid had become the new sky.\n\n*Everyone...*\n\nHis parents and Sehee. Khan, Irene, and Lord.\n\nGrid stood on the podium as the world watched with envious eyes. All he wanted was to rush to his family—to hold them close and bask in their pride.\n\n*Click! Clickclickclick!*\n\nCamera shutters accelerated to a frenzy. The reporters felt it instinctively—a sense of duty screaming that they needed to capture this moment. This gentle, loving expression on Grid's face.\n\nThis was history being written."
}