{
  "id": 773,
  "title": "Chapter 773",
  "content": "# Chapter: The Victor's Shadow\n\n**\"WAAAHHH!\"**\n\n**\"HE DID IT! GRID ACTUALLY DID IT!\"**\n\n**\"THE BEST! ALWAYS THE BEST!\"**\n\n**\"Keok! God Grid…! I LOVE YOU, GOD GRID!\"**\n\nThe sight of Grid standing atop the podium—*above* Kraugel—felt surreal. Triumphant. *Impossible.*\n\nHe'd shattered the reign of the untouchable king. Over two years, he'd dragged South Korea—previously ridiculed as weak in Satisfy—to second place in the rankings. And now? He'd delivered them glory: first place. The championship.\n\nKorean players erupted with gratitude and awe. Even Eat Spicy Jokbal, who publicly despised Grid, felt something stir in his chest—a patriotic fervor he'd thought long dead. Without thinking, he grabbed Peak Sword and pulled him into a fierce embrace.\n\nViola folded her arms, fixing Jokbal with a pointed look. \"You should convince her to join Overgeared, you know.\"\n\nOn the broadcast screen, Grid's interview was underway.\n\n\"Like everyone who's ever played Satisfy, Kraugel was my idol. My goal.\" Grid's voice carried through the stadium speakers, measured and sincere. \"I heard the legends. I burned with fighting spirit listening to his saga. So I worked. Harder than I ever had. This…\" He gestured toward the gleaming trophy. \"This is the result.\"\n\nHis gaze shifted across the press pit—toward where Kraugel stood, likewise surrounded by microphones and flashing cameras. Grid's expression didn't waver. Respectful. Genuine.\n\n\"Thanks to Kraugel, I've reached this height. He'll always be my idol. My rival. My competitor.\"\n\nGrid closed his eyes. Drew a long, steadying breath. In that moment, he saw it all: the grimy one-room apartment, the debt collectors, the endless grinding in filthy hunting grounds. Every failure. Every resurrection. Every impossible climb from the bottom to the summit.\n\nWhen he opened his eyes again, hundreds of cameras captured his smile.\n\n\"And one more thing—\" His grin widened. \"The best capsules are from Comet Group.\"\n\n---\n\nGrid's sponsorship with Comet Group had renewed for another year, and for good reason. Sales had *skyrocketed* thanks to his endorsement. A single sentence from Grid's mouth outperformed months of television ads, banner campaigns, and newspaper spreads combined.\n\nEvery employee at Comet Group regarded him with something approaching worship. The chairman had even floated the idea—quietly, privately—of arranging a marriage with his youngest daughter.\n\nHis daughter had refused. Firmly.\n\nHow could she compete? Yura and Jishuka, two of the most stunning, accomplished women in the world, stood beside Grid like twin goddesses. A corporate heiress, wealthy as she was, couldn't measure up to *that*.\n\n---\n\nDespite the celebratory atmosphere, a darker mood settled over the other competitors.\n\n\"What about next year?\" someone muttered.\n\n\"Next year? Forget it. It's going to be hell.\"\n\n\"What can we even do? Just… give up?\"\n\nChris exhaled sharply. Damian stared at his hands. Pon, Regas, Katz—they all felt the weight of it.\n\nThey knew Grid's power. Intimately. And now, as the PvP champion, he'd return *as the Hero replica* next year. \n\nThe nightmare scenario.\n\n\"Infinite stiffness is baseline,\" someone said. \"And those God Hands can morph into *anything*.\"\n\n\"Blackening. Belial's Power.\"\n\n\"How do you counter the Enlightenment Sword?\"\n\n\"If he summons Iyarugt…\" A pause. \"Maybe in two years?\"\n\nSilence.\n\nCould they beat him in two years? No one was certain. But the answer hung unspoken in the air.\n\nThey wouldn't participate in next year's *Breaking the Hero* event. \n\nThat was the only sane choice.\n\n---\n\n**\"Are you heading back to South Korea?\"**\n\n**\"Yeah. I want to eat my mother's cooking.\"**\n\n**\"…A mother's cooking. I envy that.\"**\n\n**\"Wait—Kraugel, don't you live with your mom? What, is she sick again?\"**\n\n**\"No. Don't take it seriously.\"**\n\nTokyo Dome had hosted the National Competition for three consecutive years. Now, after the closing ceremony, the stadium lay empty and dim. Grid and Kraugel sat side-by-side in the vacant stands, illuminated only by faint overhead lights.\n\n\"Your reach is going to expand,\" Kraugel said quietly. \"Going forward, I mean.\"\n\n\"Isn't that true for you, too?\"\n\n\"I'm a solo player. You're a *king*. You'll gain access to information I never will. Places I'll never see.\"\n\n\"Heh. Nervous?\" Grid smirked. \"Don't be. I've got the weight of a kingdom on my shoulders now. I'll move forward with heavy steps. You'll have the light ones.\"\n\n\"…Enough of that.\" Kraugel's tone sharpened. \"Grid, remember this.\"\n\n\"What?\"\n\nKraugel's gaze was steel. Serious.\n\nGrid's grin faded. He straightened, listening carefully.\n\n\"If you visit the East Continent as a king—if you go in any official capacity—you'll inevitably cross paths with the Hwan Kingdom.\"\n\nKraugel had eyes and ears everywhere. He'd traveled the East Continent long before Grid had even set foot there. He knew bits and pieces of Grid's activities: his time in Pangea, the residents he'd relocated to the Overgeared Kingdom. But the details? Those remained hazy.\n\n\"You've heard of the Hwan Kingdom, right? They're the sole religion. The absolute rulers of the East Continent.\"\n\n\"Like the Saharan Empire,\" Grid offered.\n\nKraugel shook his head sharply. \"No. Not even close. They're not *like* an empire. They're beyond that. They *are* the religion. The rulers. To the people there, they're *gods*.\"\n\n\"...\"\n\nGrid's mind flashed to the yangban Garam. As if reading his thoughts, Kraugel spoke the word aloud.\n\n\"Yangban.\" His voice dropped. \"They're not pretenders. They don't *fancy* themselves gods. They *are* gods—or close enough. They have the qualities. The skills. The power.\"\n\nKraugel leaned forward.\n\n\"Don't engage with them until you're at least level 500. If you *must* visit the East Continent, go as an individual. Not as a king. If the Overgeared Kingdom becomes entangled with the Hwan Kingdom…\" He trailed off, shaking his head. \"I don't know what will happen.\"\n\n\"Are they really that dangerous?\" Grid asked.\n\n\"They're not evil. Not exactly. But their worldview is… fundamentally different. Treat them like monsters.\"\n\nGrid thought of Garam's cold arrogance, his casual dismissal of mortals. Yeah. Monster fit.\n\nHe grinned. \"So they're *that* strong? Enough to make you warn me like this?\"\n\nKraugel nodded without hesitation.\n\n\"They're strong. To you, right now? They're a mountain. No—a mountain stacked on top of another mountain. And the sky above that.\"\n\n\"...\"\n\nWas this related to the Chiyou Test Garam had mentioned? Had Kraugel faced them?\n\nBefore Grid could ask, Kraugel spoke again.\n\n\"But.\"\n\n\"…?\"\n\n\"They're not as strong as Bunhelier.\"\n\n\"Heh.\" Grid stretched, understanding dawning. \"Alright. I get it. I'll be careful. I'll avoid them where I can. But I won't be intimidated by anything less than a dragon.\"\n\n\"Good.\"\n\nYes. Grid just needed to stay sharp. Avoid unnecessary entanglements with those sociopaths unless they made the first move. Kraugel believed in Grid's strength.\n\nWhat he didn't know was that Grid had *already* become a yangban's target.\n\n\"Well, I'm off. Home to eat Mom's cooking.\"\n\nGrid extended his hand. Part of him wanted to share a drink with Kraugel—soju, maybe, on a quiet evening. But that time hadn't come yet.\n\nThe day they'd share that drink…\n\n\"Three rounds,\" Grid said suddenly.\n\n\"…?\"\n\n\"A man's match should be decided in three rounds, right? I've been thinking. Our first fight doesn't count.\"\n\n\"What do you mean?\"\n\n\"You'd just fought Piaro. You weren't in peak condition. If you had been…\" Grid shrugged. \"You would've won.\"\n\n\"Pointless speculation. I lost. That's the truth.\"\n\n\"No. I'm not satisfied.\" Grid pulled his hand back, turning away. \"Let's settle it in the third round. Next year's National Competition. *Then* we'll have that drink.\"\n\n\"Grid—!\"\n\nBut Grid was already walking away, heading toward the parking lot where Toon waited.\n\nHe'd noticed.\n\nFreed from the pressures of his title, Kraugel was planning to retreat from the public eye. To return to his old, quiet ways—no tournaments, no spotlights.\n\n*\"You're not retiring alone.\"*\n\nGrid needed Kraugel in his sights. If Kraugel disappeared, Grid would feel… unmoored. He needed to know: Was Kraugel still chasing him? Or had he already surged ahead?\n\n*\"Just keep playing, Kraugel. Stay where I can see you.\"*\n\nThere were a hundred ways to argue the three-round claim. Grid had held overwhelming advantages—not just in the first match, but the second and third as well.\n\nIt was *absurdly* unfair.\n\nGrid grinned.\n\n---\n\n**\"…!\"**\n\nToon startled as Grid approached, that massive, uncharacteristic grin plastered across his face. He seemed like a completely different person from this morning.\n\n*'The absolute best…'*\n\nA warrior turned blacksmith. A guild recruit turned Guildmaster. A vagrant turned *king*. And his evolution wasn't over.\n\nWhat would Grid become a year from now?\n\nToon's phone buzzed.\n\nHe answered.\n\n**\"…What?\"**\n\nHis face drained of color. He whipped around. Grid had already collapsed into the backseat, exhausted, fast asleep.\n\n\"Did something happen?\" the driver asked.\n\n\"Airport. *Now*.\" Toon's voice was tight. Urgent.\n\nHe prayed Grid was having a good dream.\n\n---\n\n## **Meanwhile—Earlier**\n\nThe PvP finals between Grid and Kraugel were about to begin.\n\nAcross the world, in Reinhardt, Veradin stood before the central smithy district with Immortal's elite forces.\n\n\"It's here.\"\n\nBefore them stretched a sprawling smithy complex—five massive workshops capable of housing over thirty furnaces. Worse yet, several more were still under construction, skeletal frames rising into the night sky.\n\n\"They say Reinhardt is a city that never sleeps,\" one of the necromancers muttered. \"All because of these damned forges.\"\n\nVeradin smiled.\n\n*'Grid's going to be furious when these all burn.'*\n\nThe legendary farmer Piaro had vanished after the vampire expedition. Grid's first knight, Jude, remained stationed in Bairan. The great magician Ashur guarded the border at Patrian.\n\nGrid's three pillars—his \"Heavenly Kings\"—were absent from Reinhardt.\n\nVeradin knew. Empress Marie had confirmed it herself.\n\nAnd with the National Competition underway, most of Overgeared's core members were abroad. Reinhardt's defenses were stretched paper-thin.\n\n\"Still… I should be cautious.\" Veradin's grin widened. \"Khan is the priority target. Assassinate him first.\"\n\n**Sururuk.**\n\nFrom the shadows, a death knight materialized—reanimated from the corpse of an assassin once called the *Reaper in the Dark*.\n\nVeradin's heart raced.\n\nWeakening the Overgeared Kingdom's infrastructure was critical for Immortal's future. That's why he'd mobilized the elites. That's why he was here.\n\nThis incident would enrage Grid. And when he discovered Agnus was behind it? Oh, the *fury*. The bloodlust.\n\nWhat would Agnus look like when cornered? Desperate? Broken?\n\nVeradin was curious. He wanted to witness every facet of that madman's psyche.\n\nBecause—just as Lauel had once surmised—Veradin wasn't loyal to Agnus.\n\nAgnus was an *experiment*.\n\nAnd Grid?\n\nGrid was the sacrifice."
}