{
  "id": 774,
  "title": "Chapter 774",
  "content": "# The Final Radiance\n\nFor eleven generations of Eternal kings, Khan's bloodline had forged the kingdom's finest steel. The smithy bearing his family name stood as testament to a legacy that stretched back centuries—a lineage that had once inspired even the legendary Pagma himself. In his youth, Khan had been hailed as the eastern provinces' greatest blacksmith, and he'd harbored no doubt that he would one day claim that title for the entire continent.\n\nReality, as it turned out, had other plans.\n\nHis wife and son had died within hours of each other. The woman he'd grown up with, loved with an intensity that outweighed all the gold in the kingdom's treasury—gone. Their boy, who'd inherited her gentle eyes and his father's stubborn chin—gone. \n\nFor years afterward, Khan had held a bottle where his hammer should have been. He'd stared at the river instead of the forge-fire, watching the current carry away everything he'd once been.\n\nHe might have followed them into death if the Mero Company hadn't tried to seize his father's smithy. Duty had pulled him back from the edge—the obligation to protect his inheritance, even when life held no other meaning. But grief was a poison that worked slowly, and in the end, he'd surrendered. He'd given everything to those damned swindlers and walked toward the final darkness.\n\nThen Grid appeared.\n\nEven now, Khan could recall that first encounter with perfect clarity: a sullen young man with dead eyes that mirrored Khan's own emptiness. But where Khan had given up, Grid had fought. He'd rescued the old blacksmith from his crisis, then stayed. Became his student. His friend. His son, in all the ways that mattered.\n\nNow he was a king.\n\nKhan set down his polishing cloth and pressed his knuckles against his eyes, but the tears came anyway. Eighty years was longer than most men got. Long enough to recognize the signs—the sleepless nights, the memories that rose unbidden, the wetness on his cheeks that appeared without warning.\n\nHis time was running out.\n\nWhatever others might think—that he was merely code, merely an NPC—Khan was as human as any player. And every human knew, instinctively, when the end approached. That's why his hammer hadn't stopped for days. Every strike carried the weight of unpaid debts, the desperate need to give Grid something worthy before Khan's hands grew cold.\n\n*Tang! Tang!*\n\nThe metal sang beneath his hammer. Albatino's blood ran in his veins—the blood of the smith who'd taught Pagma himself. He would prove it with Valhalla, would craft armor worthy of preserving a king's life.\n\n'My posthumous work,' he thought. 'My last chance.'\n\nTo prove his life hadn't been wasted. To prove Grid's faith in him hadn't been misplaced. To create something that would make his student—his king—truly proud.\n\n*TANG!*\n\nHis technique had never been sharper. Each blow landed with legendary precision, the accumulated experience of eight decades flowing through the hammer into the metal. Not a miracle. Just mastery.\n\nAround him, other smiths worked in shifts on the mass-produced Grid Sets. Their hammering created a constant backdrop of industry. But Khan's strikes rang clearer than all the rest.\n\n\"The Chief's in rare form tonight.\"\n\n\"Already anticipating something special.\"\n\n\"Though I'm worried—he hasn't slept in days...\"\n\nA new voice cut through the workshop: \"There's an old saying about the final radiance of a setting sun.\"\n\nThe words came low and cold from the entrance.\n\n*Clack. Clack-clack-clack.*\n\nFootsteps followed—too light, too hollow. Khan looked up.\n\nBones. \n\nSkeletal warriors filled the doorway, their eyeless sockets somehow managing to look threatening. Behind them stood a white-haired man who studied Khan with the detached interest of a scholar examining an insect.\n\n\"Such dedication,\" Veradin observed. \"Burning the last of your life for your craft. No wonder the Overgeared King favors you.\"\n\nKhan's hammer stilled. \"Who are you?\"\n\nThis was the kingdom's most crucial district. Soldiers stood constant watch; knights patrolled hourly. For an intruder to reach the central smithy meant—\n\nHe didn't want to think about what it meant.\n\n\"I'm sorry,\" Veradin said, not sounding sorry at all. \"But I'm a villain.\"\n\nHe flicked his wrist. The robed figures behind him gestured in unison. The skeleton knights lurched forward.\n\n\"Khan! Run!\"\n\nThe blacksmiths surged to intercept—civilians armed with nothing but hammers and desperate courage. They knew the truth: Khan's life mattered more than all of theirs combined. He was their teacher, their mentor, the man closest to their king.\n\n\"AAAGH!\"\n\n\"Khan—GO!\"\n\nSkeleton knights were advanced undead, animated from the corpses of trained warriors. Death held no fear for them. Necromantic power made them transcendent. Even real knights struggled against them.\n\nBlacksmiths—strong from their trade but civilians nonetheless—didn't stand a chance.\n\nFive skeleton knights carved through dozens of men in seconds.\n\n\"Jane! Abra!\"\n\nKhan's scream tore from his throat. Young smiths—the kingdom's future—lay broken and bleeding. The weight of that loss crushed down on him.\n\n\"Come forward,\" Veradin called. \"Accept the inevitable. Make this easier.\"\n\nHe frowned as more blacksmiths threw themselves at his summons. Such waste. He valued life—understood its worth. Purposeful killing served strategy; this senseless slaughter offended his aesthetics. He moved to block the entrance, to hasten the old man's death and end the unnecessary casualties.\n\nThen something fell from the ceiling.\n\nFive skeleton knights exploded into bone fragments.\n\nVeradin's eyes widened. \"Faker? What are you doing here?\"\n\nGrid's shadow should have been at the National Competition, watching his master compete. Playing the loyal dog. But no—Veradin read the truth in those cold eyes and his lip curled.\n\n\"Ah. The God of Killing. I suppose godhood beats servitude, doesn't it?\"\n\n*Whoosh.*\n\nFaker didn't answer. He closed the distance faster than thought, Acceleration carrying him to Veradin's side. The dagger in his hand—Belial's bone, a founding ceremony gift—drove toward Veradin's ribs.\n\n*Thunk.*\n\n[You have suffered 12,900 damage.]\n\n[You have been cursed with fire and darkness!]\n\n[Every five seconds, you will receive damage equal to 4.8% of your total health. Duration: 30 seconds.]\n\n[As a necromancer, you have resisted the curse of darkness.]\n\n\"Premptive strike?\" Veradin stumbled back, already drinking a potion. \"Clever.\"\n\nFaker lunged again—\n\n*SNAP.*\n\nVeradin raised one finger.\n\n\"Ugh!\"\n\n\"...?\"\n\nKhan's pained gasp spun Faker around. A death knight had materialized from the shadows, blade pressed to the old smith's throat.\n\nVeradin's smile curved like a crescent moon. \"I knew this blacksmith mattered to Grid. Though I didn't realize he warranted your personal protection. Doesn't the Overgeared Kingdom have craftsmen to spare?\"\n\nSilence.\n\n\"Hmm? Not surprised by the ambush itself? Lauel's work, I take it? That friend of yours is excellent at preparation.\"\n\nThe logic was sound. National Competition rewards dwarfed even raid earnings—ten times the payout for a single medal. But such profits drew predators. Why did so many rankers avoid the competition? Because while participants wasted time in scheduled matches, others hunted and raided, achieving steady growth. No medal was guaranteed. Territories lay vulnerable.\n\nSmart leaders prepared for this.\n\n\"Putting your best guardian on the most valuable target—very Lauel. Is he a fortune teller?\"\n\nNot a fortune teller. Just thorough. Kasim guarded Irene and Lord. Faker protected Khan. Simple priority matrix.\n\n\"You're talented,\" Veradin continued. \"But talent enough to beat me?\"\n\nHe was Agnus' right hand—superficial loyalty perhaps, but Agnus didn't tolerate incompetence. Meanwhile Faker was merely one of Grid's many subordinates. The hierarchy spoke for itself.\n\n*Snap.*\n\nVeradin's fingers flicked again.\n\n*Whoosh.*\n\nFaker Accelerated instantly.\n\n*CLANG!*\n\nHis dagger intercepted the death knight's blade a hairsbreadth from Khan's neck. The riposte flowed seamlessly—\n\n*Chk-chk-chk-chk!*\n\nSharp strikes punctured the death knight's armor. Purple light erupted across its body. Luminous Ray Flash. The undead warrior stumbled, blinded.\n\n*Crack!*\n\nFaker's kick sent it reeling. He grabbed Khan's wrist, calculating the fastest escape route to the—\n\n\"Tower of Command.\"\n\n\"Tower of Command.\"\n\n\"Tower of Command.\"\n\n*BOOM. BOOM. BOOM.*\n\nBlack towers erupted around them. One meter tall, then two, then three. More kept rising. The necromancer's signature skill—weakening the living while empowering the dead.\n\n*SHRIEK!*\n\nThe death knight launched itself at Faker, sword cutting wild patterns. Not random—the blindness had worn off already. This was pure aggression, beast-like ferocity backed by expert technique. High-level Sword Mastery wearing the skin of frenzy.\n\n*Clack-clack-clack-clack.*\n\nWorse still, the skeleton knights were rising. Dance of the Reaper had only knocked them down. Now they closed in, weapons ready.\n\n\"Don't worry about me!\" Khan shouted. \"Just run!\"\n\n\"...\"\n\n\"I'm eighty years old! I don't have long anyway! Don't throw your life away for—\"\n\n\"Your life is worth a hundred of mine.\"\n\nFaker's voice—the first words Khan had heard him speak in years—cut through the chaos like a blade through silk.\n\n\"Hold tight. We're moving fast.\"\n\n*FLASH.*\n\nFaker's dark dagger ignited crimson. Bloody demonic energy exploded outward, shattering towers and shredding skeleton knights. Only the death knight dodged in time. But Khan and Faker were already gone, clinging to the ceiling supports.\n\n\"Overgeared...\"\n\nThe Immortal elites exchanged worried glances. How did you measure Overgeared's strength when their equipment broke every standard? The plan was unraveling.\n\n*BOOM!*\n\nThe death knight launched itself upward, intercepting Faker's escape. Veradin's contingency activating.\n\n*CLANG! CLANG-CLANG!*\n\nFaker's frown deepened as he parried. The death knight's blade wept poison—black ichor that dripped and hissed against the floor.\n\n\"Cough...!\"\n\nKhan doubled over, coughing blood dark as tar."
}