{
  "id": 775,
  "title": "Chapter 775",
  "content": "**Wiiiiiiing!**\n\nFaker's sharp whistle echoed through the smithy—a signal for the Overgeared Shadows stationed outside.\n\nSilence.\n\n\"Did you think it would be that easy?\" Veradin's voice dripped with confidence. \"Immortal has more than enough talented members to handle your subordinates.\"\n\nDeath Knight Kyleo leaped across the pillars with inhuman grace, closing the distance. Behind him, ten fresh skeleton knights clattered into the smithy, summoned by necromancers who'd already torn through the Overgeared Shadows outside. \n\nWorse still, the bodies of the slain blacksmiths began to twitch and rise—reanimated ghouls now serving the enemy.\n\n*Clang! Clang!*\n\nFaker's daggers blurred as he deflected Kyleo's relentless assault. Behind him, Khan's labored breathing grew weaker with each passing second. The poison was spreading fast. Faker was alone. The enemies kept multiplying. Every moment that passed tilted the scales further against him.\n\n*I need to get Khan out of here.*\n\nBut Kyleo was far stronger than anticipated. An erosion-type assassin in life, the death knight wielded poison with lethal precision while maintaining devastating close-quarters combat prowess. This wasn't some common soldier—Kyleo had been a master in life.\n\n\"Cough! *Cough!*\"\n\nKhan convulsed as another wave of poison flooded his system. Death Knight Kyleo drew freely on Veradin's vast mana reserves, releasing toxin after toxin into the air. The blacksmith's condition deteriorated rapidly.\n\n*Chwarururuk!*\n\nAn illusion rippled across Faker's vision. The technique struck intermittently, always when he was most vulnerable. With Khan's life in his hands, Faker couldn't afford to dodge or counterattack freely. He was shackled.\n\n{*Faker: I need support at the 1st smithy.*}\n\nThe guild chat remained silent. Of course—every Overgeared member would be watching Grid and Kraugel's finals match right now. Could he blame them? If Lauel hadn't specifically assigned him to guard Khan against potential threats, Faker would've logged out to watch as well.\n\n*Clang! Claaaaang!*\n\nKyleo caught on quickly. Once the death knight realized illusions disrupted Faker's timing, he increased their frequency. Mana cost didn't matter—Veradin had plenty to burn.\n\n\"Kuk...!\"\n\nFaker's world fractured into kaleidoscope shards. Hundreds of Kyleo's daggers multiplied across his vision. Khan's face warped into a grinning skeleton. The support pillars transformed into coiled serpents, fangs bared.\n\n*Thunk!*\n\n*Slash!*\n\nWounds blossomed across Faker's body. He staggered, dropped to one knee. Skeleton knights and ghouls swarmed forward like carrion birds.\n\nVeradin's smile widened. Even as Faker fell, his body angled to shield Khan from harm. The necromancer could see it now—just how critical this old blacksmith was to the Overgeared Kingdom.\n\n*Perfect. I've found the right target.*\n\nThis would cripple Grid's kingdom. The damage would be catastrophic. And when Grid came hunting for revenge in his fury, how far would Agnus' madness escalate in response?\n\n*Thump-thump. Thump-thump.*\n\nVeradin's heart raced with anticipation.\n\n\"Freeze! Don't move!\"\n\nThe smithy doors burst open. Warriors clad head-to-toe in mass-produced Grid Sets flooded inside—Sua and the Red Phoenix Group. Lauel's contingency plan. These were Pangea's defenders, veterans whose average capabilities exceeded most West Continent fighters. Faker hadn't been the only safety measure.\n\n\"Well, well. Isn't this a pleasant surprise?\"\n\nThe elite necromancers of Immortal turned their attention to the newcomers. Several fixated immediately on Sua. Satisfy boasted countless beautiful NPCs, but Sua stood out even among them—easily top five.\n\n\"I'd love to see what lies beneath that flesh.\" Drew, the 7th-ranked necromancer, wiped drool from his chin. \"You'd make an *exquisite* death knight.\"\n\nA named NPC—obviously. Drew's current death knight paled in comparison to what this woman could become. Veradin nodded his approval; he knew Drew had been seeking an upgrade.\n\n\"Do what you want.\"\n\n\"Excellent!\"\n\nSua was his now. Drew waved off the envious protests of his fellow necromancers and sent his skeleton knight charging forward.\n\n*Kiyaaaaak!*\n\nThe skeleton knight sprinted at Sua, sword raised high. For someone who'd survived armored needles in Pangea's dungeons, a mere skeleton knight posed little threat.\n\n*Crash!*\n\n\"What?!\"\n\n\"...!\"\n\nThe necromancers' eyes widened as Sua's blade shattered the skeleton knight in a single strike.\n\n*Faker-level strength?*\n\n*From an NPC?* \n\nThe Overgeared Kingdom's hidden elites had arrived. Drew recognized the danger immediately and began summoning his death knight. The casting time was longer than Veradin's—he lacked that level of mastery—but a death knight remained several times more powerful than any skeleton knight.\n\nSua assessed her opponent and barked orders to her team. \"I'll take point! The rest of you—get Khan to safety!\"\n\n\"Yes, ma'am!\"\n\nThe smithy exploded into chaos. The Red Phoenix members, trained in Asmophel's swordsmanship techniques, carved through dozens of skeleton knights like a scythe through wheat. Meanwhile, Sua engaged Drew's death knight directly, her blade work several times more refined than what she'd displayed back in Pangea.\n\nThe pressure eased. Faker seized the opening and turned the tables on Kyleo. Khan was pulled back to relative safety and administered an antidote potion.\n\nBut Khan's poisoning persisted. His health continued its slow, inexorable decline.\n\n\"Have you ever heard,\" Veradin said conversationally, \"about the legendary poisoner?\"\n\n\"...?\"\n\n\"There was once a man who spent thirty years exposing himself to over twenty different toxins. Slowly. Methodically. He bathed in poison. He drank it. He breathed it.\" Veradin paused for effect. \"Eventually, his very existence became toxic. His breath killed. His touch was death. He wasn't merely an assassin—he was a walking plague.\"\n\nFaker's jaw tightened.\n\n\"My Death Knight Kyleo inherited that legacy. The poison suffusing his bones is beyond any antidote's reach.\"\n\n\"...\"\n\nIt wasn't bluster. Khan's status effects refused to clear. The poison's damage-over-time was low enough that potions could outpace it, but Khan would suffer agonizing pain for as long as it lasted. And didn't everyone know? NPCs in Satisfy experienced pain identically to humans in reality.\n\n*I need to get him to Sticks.*\n\nThe sage's vast knowledge would surely contain a solution. Faker pressed several health potions into Khan's trembling hands and rose to his feet. He took a deep breath, fixing his gaze on Kyleo.\n\nVeradin laughed. \"Still clinging to hope?\"\n\nSua and the Red Phoenix Group were formidable—stronger than Veradin had initially assumed when Faker first appeared. But it didn't change the inevitable outcome. Immortal's forces were simply superior. Veradin could handle Faker alone, while his elite necromancers were more than sufficient for Sua's team. The current stalemate wouldn't last. The moment a Red Phoenix member fell and rose as an undead ally, the balance would shatter completely.\n\n*Snap.*\n\nVeradin flicked his fingers leisurely and issued the command.\n\n\"Finish this.\"\n\n*Kuweeeeeoh!*\n\nKyleo stalked forward, each step accompanied by wisps of poisonous breath. Faker watched carefully—not the poison, but those eyes. His assassin class granted high poison resistance, but offered no defense against illusions.\n\n*Don't meet his gaze.*\n\nHe attacked while deliberately avoiding eye contact. Any competent fighter knew to track an opponent's gaze—it telegraphed intent. Faker understood this fundamental principle. But this time, he made an exception. The instant their eyes met, Kyleo's would flash purple and trap him in another illusion. Better to fight partially blind.\n\nVeradin read the tactic and clicked his tongue in disappointment. Faker's caution would only make this more difficult for himself.\n\n*Slash!*\n\nFaker rapidly deteriorated. When defending Khan earlier, he'd successfully dodged or parried eight out of ten strikes. Now he was letting most attacks through.\n\n*This will end soon.*\n\nDid these people truly think they could threaten Agnus with only this level of strength? In the entire Overgeared Kingdom, only Grid and Chris warranted real concern.\n\n\"...!\"\n\nVeradin jolted upright in shock.\n\n\"Moon Sting.\"\n\nFaker materialized from his blind spot—impossibly fast—and drove his dagger straight through Veradin's heart.\n\n\"*Kuk!*\"\n\nNearly 40,000 damage! Faker's ultimate technique combined with Acceleration caused Veradin's vision to strobe red. He frantically chugged potions as the dagger punched through his chest again and again. If Kyleo hadn't intervened at the last second, Veradin would've turned to gray ash.\n\nFaker had known from the start. Against any necromancer, you didn't kill the summons—you killed the summoner. Every defensive action had been a calculated feint to lull Veradin into complacency.\n\n\"Clever... you almost had me.\" Veradin clutched his chest, breathing hard. \"A sharp final gambit.\"\n\nBut Veradin had access to extensive intelligence networks. He knew the Master of Swiftness class had severe limitations on Acceleration usage.\n\n*I just need to maintain distance.*\n\nVeradin summoned his Tower of Command, bathing the area in necrotic energy that weakened Faker while empowering Kyleo. Then he followed up with Specter's Hand—an attack that dealt moderate damage while inflicting multiple debuffs. With Kyleo keeping Faker pinned down, the spectral attack landed clean. Faker's movements grew increasingly sluggish.\n\nThe Red Phoenix Group's battle was deteriorating as well. The moment a member died, they rose as ghouls and turned on their former comrades. The balance collapsed like dominoes.\n\n\"Hah... hah...\"\n\nFaker's breathing came ragged as he struggled against Kyleo's onslaught. The Master of Swiftness had always been a glass cannon class—poor endurance by design. Each use of Acceleration drained his stamina dramatically.\n\n\"Support Kyleo.\"\n\nGrowing impatient with the extended battle, Veradin summoned an additional skeleton knight. Now Faker had to contend with both death knight and skeleton knight simultaneously.\n\n\"Faker...\"\n\nKhan's trembling voice reached him from behind, thick with guilt. The old man understood—people were dying to protect him.\n\nFaker barely deflected Kyleo's next strike and stepped back toward Khan. His normally impassive face softened into a rare smile.\n\n*This isn't your fault. Don't blame yourself.*\n\nKhan read the message in those eyes and felt his heart clench. Faker confirmed Khan was drinking another health potion, then refocused on the battle.\n\nVeradin couldn't comprehend it.\n\n*Why keep fighting? It's pointless.*\n\nThe battle was already over. Faker's resistance meant nothing. Beyond the difference in raw ability, Veradin held every advantage. He'd built his character specifically for PvP from day one—heavy investment in stamina, maximized survivability. His specs were perfect for countering assassins. Bait the attack, drain their stamina through prolonged combat, then finish them with the death knight.\n\nJust as Veradin's expression twisted with contempt—\n\n—*An assassin fighting to defend someone... how rare. Most assassins exist solely to kill.*—\n\n\"...!\"\n\nA voice whispered in Faker's ear. The words seemed to emanate from his own shadow.\n\n—*Yes. You're worthy of Doran's techniques.*—\n\n*Kasim...!*\n\nFaker recognized the voice instantly. In that moment, he understood—a hidden quest was about to begin."
}