{
  "id": 776,
  "title": "Chapter 776",
  "content": "Nine names echoed through Satisfy's history: Muller, Pagma, Braham, Madra, Lantier, Povia, Kruger, Gis, and Alex. Most players knew these former legends—their stories woven into the game's very fabric. But what of those who came before? The legends of ages past remained shrouded in mystery. Pokibun, Ten, Arin... names lost to time, their deeds known to almost no one.\n\nYet Kasim knew Lantier. His master had told him the story many times.\n\nMetal rang against metal. Faker dodged another strike from Death Knight Kyleo, the skeleton knight's blade whistling past his ear. He kept one eye on Kasim even as he fought.\n\n\"Can you save Khan first?\"\n\n—*My teacher also bore the name Lantier.*\n\n\"...What?\"\n\n—*Lantier isn't one person. It's a title—the mantle passed down through Eclipse, a shadow organization that's existed for over a thousand years. My teacher, who trained both Doran and myself, was the 32nd Lantier. Do you understand?*\n\n*Thunk!*\n\nPain exploded through Faker's shoulder as Kyleo's dagger punched deep into muscle. He hissed through his teeth, but the skeleton knight blocked his counterattack before he could retaliate. Kasim continued as if nothing had happened.\n\n—*I'm going to teach you techniques meant for a legendary assassin. Not all of them—many were lost over the years.*\n\nThis power...\n\n—*Whether it elevates you to legendary status or leaves you at the level of myself, Doran, and our teacher... that depends entirely on you.*\n\n*Clang! Clang!*\n\nWhy was Kasim doing this *now*? He had to know what Khan meant to Grid. Faker gritted his teeth, more frustrated than grateful. This was supposed to be an incredible opportunity—a hidden quest of vital importance. But all he could think about was Khan bleeding out somewhere in the smithy.\n\n\"Kasim...!\" Faker's voice held an edge of desperation. He'd gladly forfeit the quest if it meant saving Khan's life.\n\n—*Don't worry. I'll be there soon.*\n\nSomething in Kasim's tone made Faker pause.\n\n\"I must commend your persistence.\"\n\nVeradin's voice cut through the chaos. Weakened by Tower of Command, Faker found himself trapped by the skeleton knight's relentless assault. When he saw Kyleo's dagger streaking toward his face, he knew this was the end.\n\nVeradin was no ordinary necromancer. His survival instincts and dominance stat were off the charts. Even when Faker had landed Moon Sting directly, the bastard had barely flinched. Veradin was leagues above him—which meant Immortal might be far more dangerous than the Overgeared Kingdom realized.\n\n*I'm sorry, Khan.*\n\nThe dagger filled his vision. Not just the blade itself, but every detail—the snake scales embossed on the green handle, each individual ridge and groove. Time seemed to slow as Faker's mind kicked into transcendent focus, his thoughts racing faster than the moments themselves.\n\n*Gulp!*\n\nJust before the blade reached his eyes, Faker bit down. The small capsule hidden in his back molars cracked open, the drug flooding his system. Assassin's Mindset—a reward from a hidden quest long ago. Anyone who consumed it could detonate themselves instantly, targeting all enemies within two meters.\n\nThe cost? Triple death penalty. Three times the experience loss, three times the chance of dropping gear. It was career suicide.\n\nFaker swallowed it without hesitation. If it gave Khan even a slightly better chance at survival, it was worth it. Without him holding off the death knight and skeleton knight, the Red Phoenix Group and Sua wouldn't stand a chance against the remaining forces.\n\nThen—\n\n*Whoooosh!*\n\nFaker's shadow erupted upward like a geyser. Kasim, King of Shadows, materialized from the darkness. He'd used Shadow Move multiple times to travel from the palace, rising from Faker's own shadow to drive his blade into Kyleo's exposed back.\n\n\"Kugh!\" Kyleo staggered.\n\n\"Deserved,\" Faker said through a grin of relief.\n\nVeradin's composure cracked. \"Who the hell are you?\"\n\nFirst Faker. Then the Red Phoenix Group. Now this. Veradin's jaw clenched as reinforcement after reinforcement appeared.\n\n\"Stay out of my way!\" His scream echoed through the smithy.\n\nKyleo and the skeleton knight turned on Kasim at their master's command. The death knight's poison output increased dramatically—more than it should have. Veradin's mana plummeted at an alarming rate despite chugging potions. This wasn't right. Kyleo was going *berserk*.\n\nBut how? Veradin still had dominance to spare. The question had barely formed when—\n\n*Clang! Clang!*\n\nKasim's dagger became a blur, moving with Faker's speed but Kyleo's viciousness. Then the shadows at Kyleo's and the skeleton knight's feet began to rise.\n\n*Spurt!*\n\n*Crash!*\n\n\"What the—?!\"\n\nVeradin's face drained of color. Shadow spears erupted from below, skewering Kyleo even as the skeleton knight crumbled to ash.\n\n*Screeeee!* Kyleo thrashed wildly, his blade carving random arcs through the air. More poison poured from his wounds as he shrieked in an inhuman voice.\n\n\"Interesting,\" Kasim mused. \"He remembers being killed by me.\"\n\n\"...!!\"\n\nUnderstanding dawned on Veradin's face. He finally knew who he was facing.\n\n\"King of Shadows!\"\n\nThe supreme assassin. A presence felt across every shadow in the world. A death sentence with no escape.\n\n\"Shadow Soldiers.\"\n\nThe words carried the weight of royalty. One hundred thousand shadow warriors answered his call.\n\nVeradin's lips moved soundlessly. *Not... not him...* Why would such a monster be in the Overgeared Kingdom? Terror seized him as shadows flooded the smithy—hundreds of thousands of them, filling every corner.\n\n\"W-What is this?!\"\n\n\"Wha—? No! Noooo!\"\n\nThe Immortal necromancers' screams filled the air as shadow blades cut them down. Bodies hit the floor in rapid succession. Kasim's shadow army was the perfect counter to their numerical advantage. The necromancers who'd relied on overwhelming their enemies with corpses found themselves overwhelmed instead, helpless before the tide of darkness.\n\n*Squelch!*\n\n*Crack-crack-crack!*\n\nGhouls and skeleton knights shattered under the assault of shadow swords and spears flying from every direction. In the center of the darkness-shrouded smithy, Kasim pressed a small booklet into Faker's hands.\n\n\"This is what Doran inherited from our teacher.\" Kasim's voice was quiet, almost gentle. \"I lacked the talent and temperament to master these skills. But you...\" He'd watched Faker for years while guarding Lord. He'd seen potential that eclipsed his own. \"For you, this is only the beginning. Surpass Doran first. Then...\"\n\nHis sharp gaze shifted to Veradin, who'd made the smart choice to run. Foolish. Did he really think he could escape a death sentence?\n\nKasim almost smiled.\n\n\"...surpass me as well.\"\n\nWhen Doran's techniques combined with Kasim's, Lantier's legacy would be complete. The path to legend would open. Despite being a normal class user, Faker had already proven himself by defeating a Sun Grade player. He had wings.\n\nBut Faker pushed the joy aside. He didn't even glance at the hidden quest notification.\n\n\"I'll thank you properly later.\"\n\nThey lived in the same house, after all. Plenty of time for gratitude. Faker gave Kasim a brief nod before scooping up Khan and bolting from the smithy toward Sticks' location.\n\nBehind him, Kasim moved.\n\n*Whoooosh!*\n\nShadows erupted beneath Veradin's feet, spreading like spilled ink. Veradin burned through his trump card—Overcoming Death—multiple times to survive Kasim's initial assault, but it was futile. Kyleo was gone. Even if he could resummon the death knight after the mandatory eighteen-hour cooldown, it wouldn't matter.\n\nVeradin dropped to his knees with a hollow laugh. He looked like he had something up his sleeve, but Kasim showed no interest. When the assassin's dagger angled toward his throat, Veradin finally spoke.\n\n\"You'll regret killing me!\"\n\n\"Will I?\" For the first time, Kasim seemed curious.\n\n\"You think I'd invade without insurance? If I die, the queen and prince might not be safe.\"\n\nA bluff, of course. Even Veradin wouldn't dare touch Irene or Lord. Not out of morality—he simply knew they'd always be protected. But there was no reason to be honest. Veradin desperately wanted to avoid the death penalty. For him, it would be catastrophic.\n\n\"Really?\" Kasim's tone was flat. \"You sent forces after Queen Irene and Prince Lord?\"\n\n\"Twenty death knights. If I die, they won't—\"\n\nVeradin's face remained perfectly composed as he lied, but he stopped mid-sentence. Kasim was *laughing*. Doubled over, clutching his stomach, laughing.\n\n*Did I overdo it?*\n\nTwenty death knights was too many. Obviously an exaggeration. Should've said ten. Unease crept into Veradin's chest.\n\n\"Those twenty death knights?\" Kasim wheezed. \"They'd all be dust by now.\"\n\nTwo hundred Rebecca's Daughters candidates guarded Lord. Even if there really were death knights, they wouldn't stand a chance. Besides, Kasim *knew* Irene and Lord were safe—that's why he'd come to help Faker in the first place. If there'd been even the slightest risk, he'd never have left their side.\n\n*Thunk!*\n\nKasim's blade pierced Veradin's heart.\n\n[You have died.]\n\n[You have lost 32.3% experience.]\n\n[Your death has caused you to lose all conditions required to be a Hwan Kingdom resident. All associated effects have been forfeited. To regain these benefits, you must meet the requirements again from the beginning.]\n\nMassive losses. It had been nearly a year since his last death. Veradin stared at the respawn screen, tasting the bitterest defeat since he'd started playing. He'd missed his target, Khan, and only managed to kill a handful of young blacksmiths.\n\n***\n\nMeanwhile, in Sticks' office:\n\n\"I need to reach the elven kingdom for the antidote.\" Sticks straightened from examining Khan. \"Wait here. I'll hurry.\"\n\n\"Wouldn't it be faster to bring Khan with you?\"\n\n\"There are procedures for allowing humans into the elven kingdom. I can't bypass them.\"\n\n\"How long?\" Faker's voice was tight.\n\n\"Six hours... no, seven—\"\n\n\"Can't you do it sooner? Look at him!\" Faker gestured at Khan, who was clenched in silent agony.\n\n\"...I'll try.\"\n\nSticks gave Khan one last look before vanishing with Teleport. Faker pressed his hands against his face. Seven hours. Khan would suffer through seven hours of that poison coursing through his veins.\n\n\"I...\" Khan's raspy voice made Faker's head snap up. \"Take me to the smithy.\""
}