{
  "id": 777,
  "title": "Chapter 777",
  "content": "Khan's wrinkled face held no trace of color. Pallor spread from his cheeks to his fingertips, his body a ruin of what it had once been. Black blood bubbled from his lips with each rattling cough—the depth of his agony was unfathomable.\n\n\"I... take me to the smithy.\"\n\n\"...\"\n\nFaker's first instinct was to lay the old man down, to keep him still and stable until Sticks returned. But the thought died as quickly as it came. Khan had spent eighty years of his life at the forge. The old blacksmith would only feel truly alive with a hammer in his hand and flames at his back.\n\n\"I understand.\"\n\nIf anywhere could bring Khan peace, it would be there. Faker helped the old man to his feet, bearing his weight as Khan leaned heavily against his shoulder.\n\n\"Thank you. Thank you.\"\n\nThe words pierced Faker's heart like daggers. When had Khan become so small? Where had those massive, calloused hands gone—the ones that had shaped steel and trained apprentices? Time had hollowed him out, left him diminished. As they walked, Faker's mind drifted to the early days of the Tzedakah Guild, to all the moments he and Khan had shared.\n\nAnd he thought of Grid.\n\nWhatever sorrow Faker felt now would be nothing compared to the anguish Grid would suffer.\n\n***\n\nThe smithy stood silent.\n\n\"...\"\n\nTears welled in Khan's eyes as he crossed the threshold. Hours ago, this place had been alive with young voices, ambitious blacksmiths eager to serve their new king. Now they were gone—nothing but ash and memory, their dreams and futures snuffed out in an instant.\n\n\"Should we go back?\"\n\nFaker caught Khan's trembling frame, concern etched across his features.\n\nKhan shook his head. \"It's nothing. I'll be fine.\"\n\nHe had one final work to complete. One last gift to lay before the souls of those lost apprentices. Khan shuffled toward the furnace as Faker set hundreds of potions beside the anvil.\n\n\"I'll bring the Saintess. Don't forget to drink these.\"\n\nKhan nodded.\n\nFaker logged out the instant he received confirmation, immediately accessing the emergency network to contact Saintess Ruby. But the timing was catastrophic—Grid had just won the PvP finals and was receiving his gold medal. The entire guild was celebrating. No one answered.\n\nFrantic, Faker tried every Overgeared member he could think of.\n\nNothing.\n\n*Kwang!*\n\nHis fist slammed into the wall. Again. Again. Blood smeared the plaster.\n\n\"...Dammit.\"\n\nFury and self-loathing warred in his chest. What good was defending the Overgeared Kingdom if he couldn't protect a single old man?\n\n*Why didn't I push harder?*\n\nThe limitations of his normal class crashed down on him like a physical weight. He'd known—*known*—that monsters walked the world beyond his comprehension. But he'd grown complacent. Satisfied. After his victory against Black, arrogance had taken root.\n\nHe needed to do more. Be more.\n\nFaker sank to the floor, head in his hands.\n\n*Yiing.*\n\nHis phone vibrated.\n\nHis head snapped up, hope blazing across his features as he saw the caller ID.\n\nSaintess Ruby.\n\n***\n\n\"Grandfather Khan!\"\n\n*Taang, taang.*\n\nThe hammer's rhythm rang lonely through the night air. Ruby burst into the smithy, chest heaving.\n\n\"Grandfather...\"\n\n\"Oh, our princess has come.\"\n\nThe figure at the forge barely seemed real. Khan's skin was ashen, colorless despite the furnace's blazing heat. Even the flames couldn't warm him now.\n\n\"G-Grandfather...\"\n\nTears spilled down Ruby's cheeks. The man who'd cherished her like a granddaughter, who'd always been there with his warm smile and gentle guidance—he looked like a ghost of himself. The cheerful expression he forced onto his face couldn't hide the truth from her. This was goodbye.\n\n\"Hope! Benevolent Light! Purification!\"\n\nDesperation poured through her as Ruby unleashed every healing spell she knew, following with a cleansing incantation to purge whatever poison ravaged his system.\n\n[You have healed the target.]\n\n[The target is old. His body has reached its limits.]\n\n[The recovery effect is not properly applied.]\n\n[The detoxification effect is not properly applied.]\n\n\"...!\"\n\nRuby had saved countless lives through her good deeds. She'd believed she could save anyone, bring happiness to all who needed her power. But now, when it mattered most—\n\nShe couldn't save him.\n\nThe realization shattered something inside her. She'd never doubted the power of a Saintess until this moment.\n\n\"P-Purif... Purification! Purification!\"\n\nShe was still new to *Satisfy*, still unfamiliar with the harsh reality of NPCs and mortality. Denial drove her to cast the spell again and again until Khan's weathered hand settled on her head.\n\n\"Please, calm down.\"\n\n\"G-Grandfather...\"\n\n\"I'm sorry for causing you pain, our princess. I'm just too old now. Haha.\"\n\n\"Uh...!\"\n\nRuby collapsed into his arms. Khan's body—always so warm from years at the forge—felt cold against her skin. He stroked her trembling back with one hand.\n\n\"Don't torment yourself with grief. There's no need for sadness. My grandson has become a magnificent king. And you, Princess Ruby—you've grown from a girl into a respectable woman. It's time for this old man to return to the earth.\"\n\n\"Grandfather...! Grandfather! *Wahh!*\"\n\nRuby's composure finally broke. The girl who always presented such a calm, gentle face to the world—conscious of her responsibility as Saintess—was still just that. A girl.\n\nKhan drew a shuddering breath. \"Hehe, don't be sad. I'm leaving at the end of my natural span. Instead, you should celebra—*Cough! Cough cough!*\"\n\nHis health gauge plummeted.\n\n\"Grandfather!\"\n\nFaker materialized at the smithy entrance, a contingent of priests following in his wake—the expedition party had just returned to Reinhardt.\n\n\"We pray to the Goddess of Light.\"\n\n\"Grant peace to your faithful servant.\"\n\nSeventeen priests joined hands, their voices rising in unified prayer. *Light Prayer*—the ultimate healing spell of Rebecca's Church, manifested through collective devotion.\n\nEven that did nothing.\n\nA priest approached Faker, speaking with quiet caution. \"It's time to let him go.\"\n\n\"What are you saying? We just need four more hours. *Four hours.*\"\n\nSticks would return by then. Maybe sooner. The sage's wisdom would surely find a cure. The priest looked away from Faker's desperate conviction, unable to meet those eyes burning with futile hope.\n\n\"Not yet... I still have work to do.\"\n\nKhan wiped the blood from his lips and released Ruby from his embrace. He rose on unsteady feet and shuffled toward the anvil, where a suit of armor rested in the firelight.\n\nPlate armor without a single gap for blade or spear. Gold rings and hinges connected the black iron plates; a crimson buckle gleamed at the chest. Every detail was meticulously crafted—a design prioritizing the wearer's safety without restricting movement.\n\n\"Just... a bit more...\"\n\n\"...\"\n\n*Taang, taang, taang.*\n\nNeither Ruby nor Faker moved to stop him. Khan placed a fresh iron plate on the armor and resumed his work. Connect the hinges. Thread the rings. Repeat. His eyes held only warmth as he labored, all traces of poisoned agony seemingly forgotten.\n\n\"...A true craftsman.\"\n\n\"Remarkable...\"\n\nThe priests' voices trembled with awe. They gazed upon Khan with the same reverence they showed Rebecca's statue.\n\nTime passed.\n\n\"Hu...hehe.\"\n\nKhan suddenly laughed—a soft, delighted sound. He'd just realized: the gold and red detailing he'd chosen. These colors were *precisely* Grid's taste. He set another plate into place, desperately praying to see his king wear this armor just once.\n\n\"...*Cough!*\"\n\n\"Grandfather!\"\n\nBlood erupted from Khan's mouth as he reached for a health potion, spattering across the floor. Throughout his work, Ruby and the priests had maintained a constant stream of healing magic around him.\n\nIt changed nothing.\n\n*It's time to let him go.*\n\nFaker watched Khan's health gauge with hollow eyes. One-tenth remained, draining like sand through an hourglass.\n\n*Grid.*\n\nThe message must have reached him by now. Faker prayed Grid would arrive in time—that he'd have the chance to say farewell.\n\n*Please. Come quickly.*\n\nAs Faker's anxiety mounted to unbearable heights—\n\n*Ttaaang!*\n\n\"...!\"\n\nFaker, Ruby, and every priest present gasped as one. The sound of Khan's hammer connecting with steel resonated through their very *souls*.\n\n\"O-Ohhhh...\"\n\n\"Khan...\"\n\nMurmurs of wonder rippled through the smithy. Even those who knew nothing of blacksmithing could feel it—at this moment, Khan had transcended mortal limitations.\n\n*Ttaang... taang... taang...*\n\n\"...\"\n\nThe rhythm that had captivated them all began to fade. Khan's strikes grew weaker, slower. His health gauge showed almost nothing.\n\nAnd then—\n\n[A new legendary blacksmith has been born!]\n\n[Every blacksmith in the world will look up to him and praise him!]\n\nThe notification blazed before the eyes of every player in *Satisfy*.\n\nA world message.\n\nFive seconds.\n\n\"*Pant! Pant!* Khan!!\"\n\nGrid burst through the smithy entrance.\n\nThree seconds.\n\nHe stared at Khan with devastation written across his features, not even pausing to catch his breath.\n\n\"You came.\"\n\nOne second.\n\nKhan smiled and opened his arms.\n\nGrid dove into that embrace as Khan's body began dissolving into grey light."
}