{
  "id": 778,
  "title": "Chapter 778",
  "content": "\"Khan!\"\n\nAs Khan's body dissolved into grey light, Grid seized him desperately, as if he could somehow hold onto every fading particle.\n\n\"You must be happy.\"\n\nKhan's final words—simple, quiet. There was so much more he wanted to say, but time had run out. \n\n*Swaaah.*\n\nHis hands reached for Grid one last time, but they vanished before they could complete the embrace. No sorrow touched Khan's face. He died smiling—a final image that would burn itself into Grid's memory forever.\n\n\"*Khannnn!*\"\n\nGrid's hands grasped at empty air, chasing the warmth, the solidity, the smell of leather and forge smoke that dissolved like morning mist. Nothing remained. His fingers closed on nothing.\n\n\"Brother...\"\n\nRuby's tears fell steadily as she witnessed the farewell. Faker supported her trembling form, her face red and blotchy from crying.\n\n\"Leave him,\" Faker said quietly.\n\n***\n\nThe first person to truly see him. The man who shared his suffering, his failures, his rare victories. Khan had been teacher and student, friend and family. Whenever Grid thought of the people he treasured most, Khan was always there at the front.\n\n\"Kuk...\"\n\nThe smithy stood empty now. Grid stared at the vacant space where Khan had been, eyes dry and hollow, before his chest seized and he collapsed. How many hours had passed? He'd thought he had no tears left.\n\nHe'd been wrong.\n\n\"...Damn old fool.\" His voice cracked as he pressed his forehead to the floor, speaking for the first time since Khan disappeared. The words echoed through the vacant smithy. \"You said you wouldn't leave until you mastered all my techniques. So why...why did you break your promise? You stubborn, infuriating...\"\n\n*Liar.* The word died on his tongue. Some superstitious part of him feared the gods might be listening—might judge Khan harshly for such an accusation and condemn him to hell.\n\n\"...\"\n\nTime crawled forward. Grid looked around the smithy, every surface marked by Khan's presence, and felt the bitterness of self-recrimination poison his grief. Why hadn't he protected him? Why hadn't he arrived sooner?\n\n\"Ten years.\" The words came as he sensed someone approaching. \"Ten years we worked side by side. And I got one second to say goodbye.\"\n\nHow lonely must Khan have felt? Grid had called him father, grandfather in his heart, but he'd never properly shown that devotion. He hadn't even been there at the end.\n\nLauel's voice came soft behind him. \"For Khan, that second would have stretched into eternity. He wasn't lonely. He was happy—knowing he got to see you one last time.\"\n\nThirteen hours and twenty-three minutes had passed since Khan's death. While Grid mourned, Lauel had been working.\n\n\"I've mobilized our intelligence network to identify Immortal's members. We're tracking their locations and bases now. Just give the word, and I'll issue the kill order.\"\n\nThey had dared invade the Overgeared Kingdom. Dared to hurt Grid's family. From the kingdom's perspective—even setting aside Grid's personal feelings—there could be no forgiveness. Lauel and every member of Overgeared were ready to unleash hell. They would crush Immortal so thoroughly that the survivors would spend the rest of their lives drowning in regret.\n\n\"Also, Khan's funeral will be a state ceremony. His contributions to the kingdom's economy and military development were immense. And...\" Lauel paused, drawing a steadying breath to calm the tremor in his voice. \"The new legendary blacksmith who appeared...you already guessed. It was Khan.\"\n\nThe world message had appeared the instant Khan died. He'd hammered iron until his final breath and achieved legend status only in death. A legend who existed for mere seconds—but whose legacy would endure forever. Lauel would make certain of that.\n\n\"The official cause of death is natural causes, not the poisoning.\"\n\nLegends gained passive resistance to all status conditions and five seconds of immortality. If Khan had been in normal health when the transformation occurred, the poison would have been purged and his health locked at minimum. But that hadn't happened. Based on testimony from Faker, Ruby, and the attending priests, Khan had simply reached the natural end of his lifespan.\n\n\"It's...fortunate, in a way. He went without pain.\"\n\nAnd the legend's five seconds of immortality had given him enough time to see Grid one last time. Lauel hoped the information would bring some small comfort.\n\nInstead, Grid's rage ignited.\n\nHis face twisted. When he spoke, his voice shook with barely contained fury. \"The poison could have shortened his life.\"\n\n\"...\"\n\n\"Even if it didn't kill him directly, Khan spent his final hours in agony from that poison.\"\n\nPoisoned for hours while his body failed him. Grid couldn't truly comprehend the pain and terror Khan must have felt in those moments. Khan, who had lived with the grief of losing his wife and son. That he should suffer even at the very end—it was unbearable.\n\n\"Immortal...\"\n\nGrid's whole body trembled. He said nothing else. Just clenched his fists until his knuckles went white. He needed time to think clearly through the rage.\n\n\"I'll make the arrangements.\"\n\nLauel bowed and turned to leave. As acting administrator, he had no time to linger. There was too much to do.\n\n*Looking at him now, I'd better prepare to mobilize the army.*\n\nLauel could read the signs. Grid wouldn't be satisfied with a simple kill order. He'd want to move the entire military to slaughter Immortal personally. Which would be disastrous. War consumed soldiers, food, supplies—the costs were astronomical. Fighting necromancers especially would bleed the kingdom's resources dry.\n\n*Veradin, you son of a bitch. Striking during our truce with the Empire...*\n\nLauel had planned to increase the kingdom's national power by over twenty percent during the armistice. Now they'd be lucky to break even. When the truce ended, dealing with the Empire would be infinitely harder. His shoulders felt heavy with the weight of it as he headed for the exit.\n\nBehind him, Grid rose to his feet. His attention caught on the full plate armor resting atop Khan's anvil—Khan's final work. Grid approached with trembling hands and lifted it.\n\n[Valhalla of Infinite Affection]  \n**Rating:** Secret  \n**Durability:** ??? **Defense:** ???  \n**Options:** ???\n\n*An armor containing the hidden story of the 2nd legendary blacksmith Grid and the 3rd legendary blacksmith Khan.*\n\n*Only 'Grid' can check the detailed information of the item.*\n\n[You are Grid.]  \n[The item information will be updated.]\n\n*Ttiring~*\n\n[Valhalla of Infinite Affection]  \n**Rating:** Secret  \n**Durability:** 1,721/1,721  \n**Defense:** 1,410  \n\n* 20% increase in health recovery.\n* 40% reduction in damage from physical attacks and magic attacks.  \n* Immunity to instant death and assassination skills.\n* Maintains body temperature.\n* If you are in a party, defense increases based on the number of party members.\n* Defense increases each time the armor's durability decreases.\n* **Magic Defense +300.**\n* When struck, high probability of releasing 'Distinguished Poisoner's Poison.'\n* Passive skill <Immune to Ten Thousand Poisons> will be generated.\n* Passive skill <Moving Fortress> will be generated.\n\n*An armor produced by the legendary blacksmith Khan while wishing for Grid's safety. It is filled with Khan's care, affection, and devotion, and covered in poison. A work based on Valhalla, the masterpiece of Blacksmith Albatino which gave deep inspiration to Pagma.*\n\n*The performance exceeds the original. There is potential to become a myth depending on the wearer's actions.*\n\n**Weight:** 3,980  \n**Conditions of Use:** Grid.\n\n\"Khan...\"\n\nGrid understood immediately how much care and skill Khan had poured into this armor. Every detail was designed specifically for him. In the end, even dying, Khan had been thinking of Grid's safety.\n\n\"I'm sorry...I'm so sorry, Khan.\"\n\nFresh tears came. He was a failure. Why had he never given Khan anything in return? If Grid had made something equally precious for him, would Khan's fate have been different? The realization of his own negligence cut deep. He swore to do better by the people who remained.\n\n*—Arrange a press conference,*\" Grid whispered to Lauel.\n\n*—What? Press conference?*\n\nLauel's shock was palpable. He'd expected Grid to demand they hunt down Veradin and Agnus immediately.\n\n*—We'll publicly denounce Immortal. Make it clear they invaded a sovereign kingdom during the National Competition and caused catastrophic damage.*\n\n*—...You want to move public opinion through the media?*\n\n*—Yes.*\n\nThe continent was vast. Having Overgeared members hunt scattered Immortal players individually would be impossibly inefficient. They might kill a few, but the impact would be minimal.\n\n*—So I'll borrow other hands. I'm going to issue a kill order on Immortal to all two billion players in Satisfy.*\n\n*I know we can't afford a military campaign.*\n\nDespite the fury and grief consuming him, Grid's analysis remained cold and clear. This was a king's discipline. Lauel felt genuine admiration—but also concern about the media approach.\n\nImmortal's raid and Khan's death were catastrophic for the Overgeared Kingdom. But to the average player? An NPC's death would barely register. Wouldn't Grid's condemnation just invite mockery? Especially after his massive rewards from this year's National Competition. The envious masses would love an excuse to tear him down.\n\n*—I don't think the media angle will work. Even if you denounce Immortal, to most people it's just someone else's drama. Players rarely take action over these things.*\n\nLauel gave his honest assessment.\n\n*—You're mistaken.*\n\n*—...?*\n\n*—I'm not using the media to ask for cooperation. I'm using it to advertise.*\n\n*—Advertise...?*\n\n*—Yes. After I justify why we're targeting Immortal, I'll announce publicly that I'll craft a custom item for any player who kills an Immortal member.*\n\n*—...*\n\nIt was brilliant. Once Grid's advertisement spread across the world, two billion players would become Immortal hunters. They'd sprout like weeds after rain, and Immortal would face endless PKs with no respite.\n\nBut the cost would be staggering. Crafting items for hundreds—potentially tens of thousands—of hunters would drain Grid's resources completely.\n\n*—...Can you even afford that?*\n\nLauel raised the practical concern. Grid's response came without hesitation.\n\n*—I have plenty of money.*\n\nGrid's wealth had grown steadily since selling the Red Phoenix Bow to Jishuka. His resolve was absolute.\n\n*—I don't care if I go broke. I'm going to make those Immortal dogs quit the game entirely. That's an order.*\n\nGrid had learned more than just smithing. He was learning to wield his wealth and position as weapons."
}