{
  "id": 779,
  "title": "Chapter 779",
  "content": "The persecution began overnight.\n\n\"Looking for work? You're a necromancer? Get lost. Try somewhere else.\"\n\n\"You can't be serious. What kind of Necromancer's Guild turns away necromancers?\"\n\n\"This kind. Now leave before I throw you out.\"\n\n\"This is insane!\"\n\nThe Fold Kingdom had once been a tributary of the Saharan Empire—a blood-soaked realm where succession wars claimed tens of thousands of lives. The empire had orchestrated the chaos deliberately, backing incompetent princes to keep the kingdom weak and fractured. Centuries of violence had left the land saturated with lingering spirits and shambling undead.\n\nFor necromancers, it had been paradise. A treasure trove of death energy and restless souls, ideal for practicing their craft.\n\nThat paradise ended yesterday.\n\n\"NPCs won't even talk to me anymore.\"\n\n\"Same here. Every relationship I built, every quest chain I was working on—all worthless now.\"\n\n\"Has to be a bug. Why would the Necromancer's Guild refuse to work with necromancers?\"\n\n\"It's not a bug. I contacted customer service. This is intentional.\"\n\nThree days after the National Competition ended, necromancers across the Fold Kingdom found themselves pariahs. Innkeepers turned them away. Quest-givers wouldn't speak to them. Guards questioned them in the streets. Some were beaten and deported.\n\nThe situation in Siren was worse.\n\n\"Necromancer, you said? State your guild affiliation.\"\n\n\"Why do you—\"\n\n\"Answer the question! Wait—this one's with Immortal. Arrest him!\"\n\n\"No, wait—!\"\n\nSoldiers throughout Siren's territories detained Immortal members on sight, throwing them into cells for weeks. Those who resisted were killed. The confusion spread as ordinary necromancers suffered alongside the guilty.\n\nThen Grid's press conference aired worldwide.\n\n*\"I condemn the cowards of Immortal, who attacked the Overgeared Kingdom while our forces were away at the National Competition. They caused catastrophic damage—not just to our infrastructure, but to our people. We will never forgive this. I'm asking for the world's support.\"*\n\nOrdinary necromancers blamed Immortal. Immortal blamed Veradin. Factions formed overnight, demanding he take responsibility for the disaster.\n\nVeradin addressed the angry gathering with practiced calm.\n\n\"The actual impact is minimal. We simply avoid territories under Overgeared influence—Fold, Siren, and the surrounding regions.\"\n\n\"Not being able to operate in Fold is a massive problem!\"\n\n\"There are superior hunting grounds across the continent. Have you done no research?\"\n\n\"You want us to abandon months of work? All the reputation we built? People have suffered because of *your* actions!\"\n\n\"Should I apologize?\" Veradin's tone hardened. \"Wasn't this organization created to help Agnus build his Kingdom of the Dead? Everything I did weakened the Overgeared Kingdom—a potential threat to that goal. I acted for all of us. Why am I being blamed?\"\n\nSilence fell.\n\n\"Grid recruited Panmir during the National Competition,\" Veradin continued. \"That gives the Overgeared Kingdom a massive production advantage. By striking their smithies, I disrupted that advantage. Was I wrong to do so?\"\n\nNo one answered. The justification was too solid, even if the results had been painful. Veradin let the silence linger before speaking again.\n\n\"There's no reason to fear the Overgeared Kingdom. We move beyond their reach, conserve our strength, and build our foundation. Grid doesn't have unlimited resources to hunt us across the entire world. We're a needle in a desert.\"\n\nThe tension eased. Most members seemed convinced.\n\nThen Bullet, the guild's second-ranked necromancer, raised a hand. \"What about the innocent necromancers caught in the crossfire?\"\n\nEveryone turned.\n\n\"Hundreds of players are being suppressed because of us,\" Bullet said. \"Low and mid-level necromancers relied on the Fold Kingdom. They've lost everything. Some might cooperate with the Overgeared Kingdom for revenge.\"\n\n\"They won't,\" Veradin said flatly. \"Those necromancers know Agnus will bar them from his kingdom if they turn against us. Their anger won't be directed at Immortal—it'll be aimed at Grid, who's actually oppressing them.\"\n\nVeradin didn't consider the situation serious. In his calculations, only one person had died. The damage was acceptable.\n\nHe was catastrophically wrong.\n\n\"Kukuk... what the hell did you idiots do?\"\n\nThe meeting room door slammed open. Agnus stood in the doorway, his grin sharp as broken glass.\n\nVeradin and the others jumped to their feet, bowing. Agnus ignored the gesture, perching on the windowsill rather than taking a seat at the table.\n\n\"Grid placed a global bounty on Immortal,\" Agnus said. \"Every player in the world can claim a reward.\"\n\n\"What?\"\n\n\"Kill an Immortal member, and Grid will craft you an item. Kukuk... kikikik!\"\n\n\"That's impossible!\"\n\nVeradin and the others went pale. None had anticipated Grid extending his reach beyond the Overgeared Kingdom. Even Veradin, usually several steps ahead, had missed this.\n\n*Giving items as rewards?* Veradin's mind raced. *There's a limit to how much even he can afford. He has to be bluffing.*\n\nVeradin didn't know about the fortune Grid had earned from selling the Red Phoenix Bow to Jishuka.\n\n\"Will people even respond?\" Veradin argued. \"Grid failed to defend his own kingdom. Now he's asking others to do his work. The masses will see through it.\"\n\n\"Have you forgotten Grid defeated Kraugel?\" Agnus asked.\n\n\"...So?\"\n\n\"Kilkik! Don't you understand symbolism? Right now, Grid is the strongest player in the world. Millions of people worship him. One word from him moves armies. You really think no one will answer his call?\"\n\n\"Ah...\" The realization hit Veradin like ice water.\n\nGrid wasn't just powerful—he was an icon. Countless players would jump at the chance to earn his favor, regardless of the politics involved.\n\nAgnus leaned closer, his voice dropping to a whisper. \"I don't know what schemes you're running... but this time, your opponent isn't following your script. Is he?\"\n\nVeradin flinched.\n\n\"You think I'm a fool?\" Agnus's golden eyes gleamed. \"Months ago, you told me to avoid conflict with the Overgeared Kingdom at all costs. Then suddenly you invade them during the National Competition? Did you think I wouldn't notice?\"\n\nAgnus's hand clamped down on Veradin's shoulder with crushing force. For a necromancer, the grip was agonizing.\n\n\"You beat Faker in single combat? *You?* Kukuk... what are you really?\"\n\n\"You're misunderstanding—\"\n\n\"Shut up.\"\n\nVeradin fell silent.\n\n\"I don't care what you're planning. If you want to stab me in the back eventually, fine. You won't succeed anyway.\"\n\nAgnus held Veradin's gaze, and the manipulator finally understood.\n\n\"Keep one thing in mind: you can do whatever you like, as long as you keep providing me what I need. Work like a loyal dog, and I won't discard you. The moment you become useless...\" Agnus released him. \"Well. Let's not find out.\"\n\nVeradin's blood ran cold. Agnus wasn't insane—he was *controlled*. His emotions ran intense, sometimes appearing as madness, but beneath it lay perfect clarity. Veradin had suspected something, but he'd underestimated how thoroughly Agnus had seen through him.\n\n*I've been dancing in the palm of his hand this entire time.*\n\nVeradin clenched his jaw.\n\n\"So what now?\" Agnus asked, almost playfully. \"I don't care what happens to Immortal. Should I sit back and watch? Or should I fight Grid, like you obviously wanted? Your choice. I'm just here for the entertainment.\"\n\n\"...For now,\" Veradin said carefully, \"we should take shelter in the empire. Request protection from the empress.\"\n\nIt was a retreat. Veradin's original plan—pushing Agnus into a corner, amplifying his madness to study it—was dead. If he forced a meaningless conflict now, Agnus's distrust would explode. Better to hide until public interest cooled.\n\nBut Veradin had made two critical miscalculations.\n\nHe didn't understand the scale of two billion players worldwide.\n\nAnd he didn't know Grid's obsession when given a clear target. Grid's focus, once locked, surpassed even Agnus's intensity. Grid didn't pursue fun to escape reality—he pursued *victory* with single-minded fury.\n\n---\n\n\"Gather the insane dragon iron.\"\n\nGrid's order was simple, delivered after receiving confirmation that Immortal had fled to the empire."
}