{
  "id": 78,
  "title": "Chapter 78",
  "content": "# Chapter 78\n\nI'd seen Angel Falls on TV once. Some nature documentary I caught between bill-collecting calls. Venezuela, 979 meters high, fog at the bottom, Spanish name meaning \"angel.\" The sort of thing people with money and free time flew across the world to see.\n\n*Why am I thinking about this?*\n\nBecause the waterfall in front of me made Angel Falls look like a backyard fountain.\n\n\"Right here.\"\n\nKwaaaaaaah!\n\nThe roar drowned out my voice. Water plummeted 1,300 meters down the north face of Kesan Canyon, hammering into the earth with enough force to shake my teeth. Vapor rose in churning walls, refracting sunlight into a hundred overlapping rainbows. The air tasted wet and electric.\n\nLoran Falls. Named after the founder of the Eternal Kingdom, supposedly one of the most sacred sites in the country. I saw exactly zero pilgrims. Just me, surrounded by monsters that could rip a casual tourist in half.\n\nSmart people stayed away from Kesan Canyon. Which meant smart people never saw this.\n\nI stared at the cascade, water glittering gold in the afternoon light.\n\n*Huh.*\n\nNature didn't pay my debts. Didn't put food on the table or keep the loan sharks from my door. I'd spent my whole life in concrete and asphalt, working construction sites and hauling boxes, and I'd never once thought, \"Man, I should visit a waterfall.\"\n\nBut this…\n\n\"Damn.\"\n\nThis was something. The buildings back home, the fancy architecture, the heritage sites people lined up for. They were impressive, sure. But standing here, watching a mountain's worth of water hammer into the earth every second, I felt like an ant staring up at a boot.\n\n*If this is just a game, what would the real thing be like?*\n\nA stupid thought. Pointless. I had debt to clear before I could afford luxuries like international travel.\n\n\"What am I doing?\"\n\nI shook my head hard. The quest. Pagma's swordsmanship. The whole reason I dragged myself through this monster-infested deathtrap.\n\n\"The north cliff. Khan's ancestor said north cliff.\"\n\nI started searching.\n\nTen minutes passed. Then thirty. An hour. Two hours.\n\nNothing.\n\nI scaled the rock face, fingers bleeding through my gloves, checking every surface for engravings. The sunset turned the waterfall into liquid gold, a river of fire pouring from the sky. Beautiful. Useless.\n\n\"Hey.\"\n\nMy jaw clenched. Khan's ancestor said he'd carved Pagma's swordsmanship onto the north cliff. That ghost, floating in the cemetery with his cryptic history lesson, swearing up and down that this was where I needed to go.\n\n\"Did that bastard lie to me?\"\n\nI punched the cliff face. The stone didn't care.\n\n*Of course I trusted a ghost. Brilliant. Ghosts are evil. Every horror movie ever made taught me this. Ugly, cruel, vindictive spirits leading people to their deaths.*\n\n\"This is the worst decision of my life. Wait, um?\"\n\nI caught movement in my peripheral vision. Not on the cliff. Behind the waterfall.\n\n*No way.*\n\nMiddle school. Terrible martial arts films from fifty years ago, badly dubbed, even worse special effects. But every single one had the same trope. The waterfall. The hidden cave. The secret technique waiting for the chosen hero.\n\n*If the developers watched the same garbage…*\n\nI jumped.\n\nThe water hit me like a fist, cold and brutal, trying to hammer me into the rocks below. I kicked against the current, dragged myself through the curtain of falling death, and stumbled into a shallow cave behind the cascade.\n\nMurals covered the walls. A man, moving through sword forms in carved sequence, blade held in perfect lines.\n\n\"Wow.\"\n\nMy hands were shaking. From cold, from anger, from relief.\n\n\"That ghost.\" My voice echoed in the cave. \"Khan's ancestor. 'North cliff,' he said. Just 'north cliff.' Not 'behind the waterfall,' not 'through the death trap of freezing water.' If he wasn't Khan's grandfather, I'd go back to that cemetery and kick his spectral ass until he discorporated.\"\n\nI paused. Looked around.\n\n*Can ghosts hear me? Is he watching right now?*\n\nNothing moved except water. I turned back to the murals. Time and moisture had worn them down, but the carvings were still clear. The figure's face struck me first. Sharp eyes, angular features, the sort of face that belonged on magazine covers.\n\n\"Shit. Pagma was handsome.\"\n\nI'd pictured him as some barrel-chested blacksmith type. Thick arms, soot-stained, built like Khan but younger. Instead he looked like a damn model. Slender build, elegant lines, probably had women throwing themselves at him.\n\n\"Why am I mad at a dead person's face?\"\n\nI focused on the technique. Pagma's height was considerable, but the sword in his hands dwarfed him. Dainsleif. Three meters, twenty centimeters of folded steel, heavy enough to crush bone through armor.\n\nAnd Pagma swung it one-handed. Like it weighed nothing. The forms showed power and grace combined, strength hidden in flowing movements. A butterfly's dance with a guillotine's edge.\n\n*How?*\n\nThe murals showed mastery. Perfection. The endpoint of a lifetime's training.\n\nI walked the sequence three times. Memorized every angle, every stance.\n\n\"Okay. So where's my skill notification?\"\n\nNothing appeared. I kept staring at the murals.\n\nStill nothing.\n\n\"Do I have to touch them?\"\n\nI pressed my palms against the carved stone. Cold. Damp. Inert.\n\nNo notification.\n\n\"What? Looking doesn't work, touching doesn't work. Do I have to copy the movements?\"\n\n*That must be it. Learn by doing. My body has to understand the technique.*\n\n\"Annoying.\"\n\nI drew the Ideal Dagger. Not a greatsword, but it would serve. I mirrored the first form. Awkward. My feet were wrong. I tried again. Better. Still wrong.\n\nThree hours blurred together. I lost count of repetitions. My stamina bar dropped into red. My real muscles screamed. Sweat mixed with waterfall spray.\n\n\"I can't do this.\"\n\nI collapsed against the wall, panting. The forms were memorized. My brain knew every movement. But my body wouldn't cooperate. The transitions felt clumsy, the rhythm broken.\n\n*When did I last dance?*\n\nClubs, years ago. Awkward shuffling in dark rooms, never quite matching the beat. I'd never had rhythm. Two left feet, the other kids used to say.\n\n\"Hahaha! That's it. I can't learn this because I never learned to dance.\"\n\nI stared at the ceiling.\n\n\"Wait. No.\"\n\n*This is a game skill. It can't require real-world dancing ability. That would be insane. There's another reason.*\n\nI examined the murals again. Slower this time. The sequence ran along the wall, form after form, ending at the far corner where water dripped from a crack above.\n\nMoss covered the final section. Thick, green, thriving in the moisture.\n\n\"The last mural. Is it under the moss?\"\n\nI laughed. It came out slightly unhinged.\n\n\"There wouldn't be such a stupid development.\"\n\nI scraped the moss away with my dagger. More mural emerged. The final form. The completion of the sequence.\n\n> [Pagma's swordsmanship has been acquired.]\n\n> [You have completed the first class quest. Return to Blacksmith Khan.]\n\nMy hands stopped moving. I stared at the notifications.\n\n\"What have I been doing for the last few hours?\"\n\nThe moss sat in a pile at my feet. Innocent. Blameless. Just a plant growing in a damp cave.\n\nI wanted to scream. Wanted to tear it apart and throw it into the waterfall. Wanted to curse every developer who'd coded this scenario.\n\n\"You're lucky.\"\n\nI stomped the moss into paste. Took deep breaths. Forced my heart rate down.\n\n*Don't think about it. You have the skill. That's what matters.*\n\nPagma's swordsmanship. The technique that pierced the sky. The missing piece of my combat abilities.\n\nMy hands were still trembling as I opened the skills window.\n\n**[Pagma's Swordsmanship]**  \nLv. 1\n\n**Deactivated State:**  \nPhysical attack +20%, Critical hit rate +10% (Sword weapons only).  \nNo mana cost.\n\n**Activated State:**  \nEnables five sword techniques: Wave, Restraint, Link, Kill, Transcend.  \nPassive bonuses are lost while active.  \nActivation cost: 20 mana.  \nReactivation delay: 10 seconds.\n\n**[Wave]**  \nDeals 155% attack power to all enemies within 1 meter. Reduces target movement speed.  \nMana Cost: 350 | Cooldown: 120 seconds\n\n**[Restraint]**  \nPrevents enemy approach for 3 seconds (Does not affect undead).  \nMana Cost: 300 | Cooldown: 300 seconds\n\n**[Link]**  \nDeals 500% attack power to single target.  \nMana Cost: 350 | Cooldown: 100 seconds\n\n**[Kill]**  \nDeals 1500% attack power to single target. Inflicts bleeding and desperation.  \nMana Cost: 1,200 | Stamina Cost: 50% | Cooldown: 500 seconds\n\n**[Transcend]**  \nDoubles attack power. Basic attacks become ranged for 30 seconds.  \nMana Cost: 1,800 | Cooldown: 3,000 seconds\n\nI read it three times. Then a fourth.\n\nMy mouth was dry.\n\n\"Holy shit.\""
}