{
  "id": 780,
  "title": "Chapter 780",
  "content": "# Kill Immortal\n\nThe press conference was a brazen display of power—Grid weaponizing his position to rally the world against a personal enemy. He declared his intent to destroy Immortal, demanded cooperation, and framed it all as righteous vengeance. It reeked of tyranny, the kind of authoritarian posturing that should have sparked outrage.\n\nAnd yet, the masses ate it up.\n\nMoney bought a hell of a screenplay.\n\n\"The Overgeared Kingdom has suffered tremendous losses, yes. But at the end of the day, isn't this just a territorial dispute between two powers? What does that have to do with the rest of us? Why should ordinary players join the Overgeared Kingdom's revenge tour?\"\n\n\"Because the future of the National Competition is at stake.\" Grid's voice was steady, measured. \"If we let Immortal's invasion slide—striking another power during the Competition itself—we set a precedent. Next year, it'll happen again. And again. Before long, every major force will be vulnerable during the event.\"\n\n\"So... you're saying participation rates will plummet?\"\n\nExactly. The National Competition had become the world's premier event, a festival people waited all year for. No one wanted to watch a watered-down tournament filled with mid-tier players while the rankers cowered at home.\n\n\"Precisely. If you enjoy the Competition, you can't let Immortal normalize this behavior. We need to punish them thoroughly—make an example that ensures no one ever tries this again.\"\n\n\"Are you claiming the Overgeared Kingdom is doing this for the public good, not personal revenge?\"\n\n\"That's correct.\"\n\nOver two hundred reporters had gathered, but Grid only acknowledged twenty of them. Twenty names on Lauel's payroll. They lobbed him softballs, carefully steering the narrative away from the violence of revenge and toward the nobility of justice. What should have been interrogation became theater.\n\n\"Wait a moment.\" One brave soul pushed back. \"Immortal's stated reason for the invasion was to check the expansion of a rising power. That's a legitimate strategic concern, isn't it? Isn't complete annihilation a bit... excessive?\"\n\n\"And what about the collateral damage? Innocent necromancer players caught in the crossfire—\"\n\n\"Raise your hand if you have a question.\" Grid cut them off smoothly, his gaze sweeping past them. \"Reporter on the left, please.\"\n\n*Buzz buzz.*\n\nHe ignored every dissenting voice. No matter how insistently they raised their hands, Grid only acknowledged his pre-approved plants.\n\n*This is insane,* the genuine reporters fumed. *He's not even hiding it anymore.*\n\nAs the press conference morphed into a one-man propaganda show, the murmurs grew louder. A few reporters stood, ready to call out the charade. Grid had anticipated this. He dangled the bait before they could strike.\n\n\"I will personally craft items for anyone who joins the hunt against Immortal. Consider it gratitude for protecting the integrity of the National Competition.\"\n\n\"Wait—you mean the mass-produced Grid Sets flooding the market?\"\n\n\"No. Something special. I guarantee every piece will be Epic-rated at minimum. And I'll cover the material costs myself.\"\n\n\"...!\"\n\nA free Epic item made by Grid. That was front-page news. Skepticism evaporated. Pens flew across notepads. The public's attention pivoted from ethics to rewards.\n\n\"That concludes today's conference. Thank you all for attending.\"\n\nSixty minutes. That's all it took for Grid to rebrand himself as the \"Apostle of Justice,\" a champion defending the sanctity of the National Competition rather than a vengeful king. Corrupt media and deep pockets—a hell of a combination.\n\n***\n\n\"Was it really okay?\" Toon asked from the driver's seat, glancing at Grid in the mirror.\n\nGrid stared out the window, expression unreadable. He looked... uncomfortable. Maybe even guilty for buying the media, for manipulating the masses.\n\n\"I'm fine.\" Grid's smile was bitter. \"You know me, Toon. I've never pretended to be a saint.\"\n\nEven if he had been one, Khan's death would have corrupted him. His fists trembled against his knees.\n\n***\n\n\"I watched the press conference,\" Lauel said. \"You performed exceptionally well.\"\n\nMuddy the waters, then pivot to justice. That had been Lauel's strategy, and Grid had executed it flawlessly. The reporters on Lauel's payroll had done their part.\n\n\"Don't praise me for reading Huroi's script in a movie you directed,\" Grid muttered.\n\n\"The best script in the world is worthless without a convincing lead actor.\"\n\n\"...\"\n\nGrid fell silent. His skin was thickening with every manipulation, every calculated lie. He could see himself becoming one of those soulless politicians from the news—hollow men who smiled while the world burned. The thought made his stomach churn. \n\nLauel caught the anxiety flickering across his friend's face and smiled. \"Politicians are clever, Grid. You?\" He shook his head. \"You're too honest to ever be like them.\"\n\n\"...I hope you're right.\"\n\nGrid exhaled, tension easing from his shoulders. Lauel was forcing his own smile, trying to lighten the mood. Grid noticed—he'd gotten better at reading his friend's tells.\n\n*My expression's too stiff.*\n\nHe consciously relaxed his face. Friends were precious. Just like Khan.\n\n\"Don't worry about me,\" Grid said. \"I'm holding it together.\"\n\nHe leaned forward, shifting to business. \"Immortal's holed up in the Empire, just like you predicted?\"\n\n\"Yes. They won't surface anytime soon.\"\n\nThe Saharan Empire's infrastructure was unmatched—hunting grounds, quests, facilities, all top-tier. The overcrowding was the only downside, but manageable. A player could spend their entire career there without issue.\n\n\"Plus, Immortal has ties to the Empire. They'll be protected, pampered even.\"\n\n\"So they're living comfortably?\"\n\n\"For now. But they'll never rest easy. Every Empire player will be watching them. One wrong step outside the capital, and an assassin's blade finds their throat.\"\n\nThe psychological warfare would be relentless. A hell of a punishment from Immortal's perspective. But it wasn't enough for Grid. He wanted obliteration. Veradin, who'd delivered Khan's death blow, and Agnus lurking behind him—Grid wouldn't tolerate their existence.\n\n\"I need to visit the Empire.\"\n\n\"You're planning a solo infiltration and assassination?\"\n\n\"Is it possible?\"\n\n\"Not even remotely.\" Lauel shook his head. \"After you abducted Asmophel, they upgraded their defenses. Search magic will detect you even through the invisibility cloak.\"\n\nSure, the Empire's remote territories were accessible. But Immortal would be nestled in the capital, probably within the palace itself. Even Faker's grandfather couldn't infiltrate that stronghold undetected. Grid? Zero chance.\n\n\"...You can't be serious.\"\n\nLauel stared as realization dawned. Grid's mouth was curving into a smile.\n\n\"You're planning to walk through the front door?\"\n\nGrid had maintained composure since Khan's death, had delivered a masterful performance at the press conference. Lauel had let his guard down. He'd forgotten that beneath the calm exterior, Grid was *unhinged.*\n\n\"Relax. I'm not crazy.\"\n\nGrid held up a placating hand. \"Send a formal letter to the Empire. Inform them that Overgeared King Grid requests an official state visit.\"\n\nThe Saharan Empire ruled the West Continent. By all rights, Grid should have paid his respects to the Emperor immediately after founding his kingdom. Instead, he'd refused, earning the Empire's ire.\n\n\"During the armistice... I'll use this opportunity to meet the Emperor.\"\n\nThe fact that the Empire had proposed a truce with the Overgeared Kingdom proved one thing: they could no longer afford to dismiss him. Grid wouldn't be humiliated. This was the perfect moment to take the Emperor's measure. Lauel read between the lines and felt a surge of excitement.\n\n\"I've wanted to suggest this since the truce was signed,\" Lauel admitted. \"But I didn't think you were ready.\"\n\nA successful state visit could extend the armistice, buy them breathing room.\n\n\"But—\" Doubt crept into Lauel's voice. \"What will you say to the Emperor? You're not actually going to demand he hand over Immortal?\"\n\n\"I'm not an idiot, Lauel. What's the point of groveling just to get rejected?\"\n\n\"Thank god.\"\n\nRelief washed over Lauel. At least Grid wasn't *that* far gone.\n\n\"I'll be in the smithy working with the insane dragon iron. Gather every craftsman and sculptor in the kingdom. And that merchant ranker, Muto—tell him I have a business proposal.\"\n\nGrid's instructions were deliberate, loaded with intent. Lauel's mind raced, piecing together the strategy. He nodded immediately.\n\n\"Understood.\"\n\nHis heart hammered in his chest. Grid was evolving, learning to leverage not just personal strength but infrastructure, resources, political capital. \n\n*Like watching a primate discover tools,* Lauel mused. *Raw intelligence isn't enough—you need to learn how to wield the world around you.*\n\n\"The chrysalis stage...\" he murmured.\n\n\"What? Why are you talking about bugs?\"\n\n\"...\"\n\nLauel blinked, snapping back to the present.\n\n***\n\n\"You'll craft ornaments from the insane dragon iron. Quantity matters, but don't cut corners. If the artistry isn't pristine, it's worthless as a diplomatic gift.\"\n\n\"Understood. Though the material will be exceptionally difficult to work with.\"\n\n\"I'll assist. White—fabricate needles from the insane dragon iron. As many as possible.\"\n\n\"Needles?\"\n\n\"Even the sturdiest wall crumbles if you drive enough needles into the cracks. Show the technique to Panmir.\"\n\n\"Of course.\"\n\nThe smithy complex at Reinhardt's heart roared back to life for the first time since Khan's death. Workers swarmed the forges, and Grid stood among them, eyes burning with purpose.\n\n*Just wait, Veradin. Agnus. I'm coming for you. And you'll die screaming—again and again.*\n\nImmortal's hiding in the Empire was a gift. It gave him the perfect excuse to cripple a future enemy under the guise of diplomacy.\n\nGrid's thoughts had never been colder."
}