{
  "id": 782,
  "title": "Chapter 782",
  "content": "# Chapter: Seeds of Diplomacy\n\nThe Overgeared Kingdom rose from the soil. Piaro's revolutionary farming techniques had transformed barren lands into fields of plenty, stabilizing the treasury and laying the groundwork for thriving trade routes. Every furnace Khan lit, every apprentice Grid trained—all of it traced back to the gold earned from wheat and potatoes.\n\n\"You can't be serious.\"\n\nGrid stared at the mountain of supplies transported from Bairan. A hundred tons of rainbow potatoes and wheat—the kingdom's primary exports, the lifeblood of their economy—all destined for the empire. His jaw tightened.\n\n\"Why should we offer tribute in the first place? We're not some vassal state.\"\n\n\"It's not tribute, Your Majesty.\" Lauel's calm correction carried the patience of a tutor addressing a stubborn student. \"It's a diplomatic gift. *You* requested this visit. The empire accepted. Basic courtesy demands we don't arrive empty-handed.\"\n\nGrid's frown deepened, but Lauel pressed on.\n\n\"This is a meeting between sovereigns—an official event that will echo across the continent. The empire will host us for their own political benefit, certainly, but if we show up with nothing?\" Lauel shook his head. \"The damage to our reputation would be severe.\"\n\n\"Still seems like a loss.\"\n\n\"On the contrary.\" Lauel's lips curved into something predatory. \"The empire is preparing elaborate events for your visit. Gifts, likely. Small ones, perhaps, but in pure monetary value, they'll spend more than us. Besides...\" That demon's smile widened. \"Imagine their faces when they taste what a legendary farmer can produce.\"\n\nGrid blinked.\n\n\"Our wheat is an improved cultivar—superior to anything on the continent. Haven't you heard the rumors? Travelers raving about Overgeared bread and noodles? The empire's palate won't be immune.\" Lauel leaned forward, eyes glinting. \"This visit could crack open trade routes that have been sealed for decades. That's why I specifically chose agricultural products.\"\n\nAdmiration flickered across Grid's face. No matter the situation, Lauel found the angle, the leverage, the profit. The man was an invaluable blessing to the kingdom.\n\n\"Actually,\" Lauel admitted, \"Administrator Rabbit devised this strategy. When it comes to generating revenue, I'm outmatched.\"\n\nGrid huffed a quiet laugh. Rabbit—the shrewd merchant who'd once paid a mere 73 silver for Piaro's services when the man was still a legendary swordsman. Since his recruitment, Rabbit had managed the kingdom's finances with ruthless efficiency. Without him, their growth would be half what it was, maybe less.\n\n\"You know, it's remarkable.\" Lauel tilted his head, studying Grid with open curiosity. \"You were still... let's say *unrefined*... when you recruited Rabbit. Yet somehow you keep selecting and recruiting incredible talent—Rabbit, Khan, Piaro, Asmophel, Sticks. Is it instinct? Natural talent?\"\n\n\"...\"\n\n*At least be honest with the person you serve.* Lauel had adopted this principle over time, and though his bluntness occasionally stung, Grid appreciated it. That honesty forced him to reflect, to improve.\n\n\"An eye for talent...\"\n\nGrid's thoughts drifted across the faces of everyone he'd recruited. When viewed objectively, the pattern was almost uncanny. Each one had been broken when they met him—half-dead, defeated, abandoned. Yet he'd seen something in them. The Character Observation skill from the Lord's Sword had helped, true, but the deeper truth was becoming clear now. Stats alone didn't explain it. Turning someone into a loyal retainer required more than just reading numbers.\n\n*Can I take pride in this? Khan... that I won your heart, your loyalty.*\n\n\"Your Majesty?\"\n\n\"Ah.\" Grid blinked, wiping moisture from his eyes before Lauel noticed. Too late.\n\nLauel's expression softened. \"Khan's funeral... you're certain you don't want a state ceremony?\"\n\nGrid nodded firmly. \"Yes. His soul doesn't belong here.\"\n\nThree days remained before his scheduled departure for the empire. First, there was somewhere else he needed to be.\n\nWinston. Khan's home.\n\n---\n\nSatisfy didn't handle death the way the real world did. Players and NPCs alike dissolved into gray ash upon dying—no corpses, no remains. Exceptions existed during specific quests or for necromancers, but generally, the dead left nothing behind. The fact gnawed at Grid. He couldn't even care for Khan's body properly, couldn't give his friend that final dignity.\n\nBut he'd remembered something. Satisfy had souls—tangible, persistent. He'd witnessed them: Braham's soul, Iyarugt's consciousness, the ancestral spirits in Khan's family cemetery. Khan's soul still existed. Somewhere. \n\nFor a time, Grid had considered using the \"Granting an Ego\" skill acquired from the Behen Archipelago to bind Khan's soul to an item, to keep his friend close forever.\n\n*I won't make Khan suffer for my selfishness.*\n\nHe'd seen the anguish of the former legends resurrected as death knights by Pagma. They hadn't wanted power or continuation—they'd wanted *rest*. Grid couldn't chain Khan's soul to the earth out of grief.\n\n\"Khan.\"\n\nThe small cemetery outside Winston stood quiet under an overcast sky. Khan's wife, his son, his ancestors—all rested here. Grid stood alone among the weathered headstones, tears tracking down his face despite his efforts to wipe them away.\n\nFrom his inventory, he withdrew a memorial stone—a collaborative work with the kingdom's finest sculptors. A vessel where Khan's soul could reside.\n\n\"Please... stay in heaven.\" His voice cracked. \"Only come down sometimes. To visit. I'll maintain the cemetery. Ruby and Lord will come often. The children...\"\n\nHe placed the stone at the cemetery's heart and his composure shattered. Sobs wracked his frame as he knelt in the grass.\n\nTime passed. How long, he couldn't say.\n\nIn that remote cemetery where no one could witness his grief, Grid wept alone.\n\n*Thank you.*\n\n*Thank you.*\n\nA familiar voice, warm as sunlight, brushed his ears like a gentle wind.\n\n---\n\nOvergeared King Grid. Inheritor of the legendary blacksmith Pagma's abilities. Hero of the former Eternal Kingdom. The man who, alongside his capable subordinates, defeated Belial, the 32nd great demon. Later, he'd overthrown an entire kingdom, established the Overgeared Kingdom in its place, and played a pivotal role in founding Valhalla.\n\n\"He cleansed the Behen Archipelago? Restored the Hall of Fame?\"\n\n\"Has a statue erected there, even.\"\n\n\"Yohohoho... A new titan for a new era, perhaps.\"\n\n\"He's certainly stepped out from Pagma's shadow.\"\n\n\"Yohoho... and he has close ties with the Rebecca Church's Pope?\"\n\n\"Indeed. Also maintains relations with Sword Saint Kraugel.\"\n\n\"Yoho... the boy knows how to leverage his assets.\"\n\n\"Absolutely. Uses Pagma's techniques as bait to expand his network.\"\n\n\"Even Braham became involved with him?\"\n\nThe Tower of Eternity—a sanctioned institution studying magic under imperial aegis, notorious for violating countless taboos in the name of magical advancement.\n\n\"Yohoho, I'm eager to meet him.\"\n\nGoldhit, Master of the Magic Tower. One of the Ten Great Magicians on the Continent, she operated on an entirely different plane than someone like Earl Ashur. The gap between them was one of fundamental nature, of birth. She was, after all, the fourth disciple of the legendary great magician Braham himself.\n\n---\n\n\"AAAAGHH!\"\n\nIn Titan, capital of the Saharan Empire, a necromancer from Immortal stumbled out of a grocery store—and immediately collapsed. A knife and axe protruded from his back, blood spreading across cobblestones.\n\n\"Stop right there!\" Patrolling soldiers rushed toward the commotion, but the attackers had already vanished into the crowd.\n\n\"That's one down!\"\n\nThe necromancer's corpse dissolved into gray ash as the hunters fled, laughing.\n\n\"Did you get the footage?\"\n\n\"Crystal clear! And we secured one of Grid's items!\"\n\n\"Hell yes! Hahaha!\"\n\nThey sprinted through winding streets, guards in pursuit, city penalties be damned. The reward for hunting Immortal members far outweighed any minor fine.\n\nOther players watched with naked envy.\n\n*I need to find them first!*\n\nAcross the empire, players hunted for Immortal members with obsessive fervor. Necromancers were tracked, monitored, identified. Some impatient hunters killed anyone who so much as *looked* like a necromancer. For Immortal, the empire had become hell itself.\n\n\"DAMN IT!\"\n\n***BANG***\n\nIn a remote village near the Empress's palace, the 347 members of Immortal huddled in safehouses, rage and fear boiling over in equal measure. They couldn't hunt, couldn't gather items, couldn't even step outside without risking their lives. All because of Grid. Trapped like rats in a cage they couldn't escape.\n\n\"That bastard Veradin. Acted so clever and got us all fucked.\"\n\n\"Let's just turn in Veradin's group. Why should all of us suffer?\"\n\n\"You want to betray our own people?\"\n\n\"Then what? We just roll over and die together?\"\n\nCracks formed in Immortal's unity. Fear had taken root—fear of Grid, the man who'd mobilized billions of players against them with a single act. They'd poked a sleeping lion, and now the beast was hunting them down systematically.\n\nBullet, one of Immortal's executives, tried to restore calm. \"Everyone, settle down. This can't last forever. Players lose interest. Once they stop finding us, the frenzy will die out.\"\n\n\"I guess...\"\n\nIt was a hunter's nature—lose the trail, lose the enthusiasm. If they stayed hidden long enough, the storm would pass. They'd be able to breathe again. That hope lasted until someone burst through the door.\n\n\"G-Grid! Grid is visiting the empire!\"\n\n\"...What?\"\n\nEvery face in the room went pale.\n\n\"He's a devil! An actual devil!\"\n\nFirst he'd branded them criminals over some NPC blacksmiths. Now he was traveling to the empire personally to hunt them? The man was obsessed! As panic spread through the room, a calm voice cut through the chaos.\n\n\"Why is everyone afraid? This is an opportunity.\"\n\nVeradin emerged from the back room, expression cold and calculated. \"We can demonstrate our strength to Grid. Turn this around. Hunt the hunter who came for us.\"\n\nSeveral members looked at him like he'd lost his mind, but Veradin continued.\n\n\"Obviously, we can't strike recklessly. According to my intelligence, Grid will have an official schedule arranged by the empire. If we attack and disrupt the Emperor's plans, the empire will abandon us completely.\" His eyes hardened. \"We need to choose the right moment. Precisely.\"\n\nA cornered mouse will bite the cat. Grid needed to learn that lesson. As Veradin laid out his preliminary plans, a merchant caravan passed through the gates of Empress Marie's palace.\n\nThe pieces were moving into position."
}