{
  "id": 783,
  "title": "Chapter 783",
  "content": "\"Muto. Thank you for coming on such short notice.\"\n\n\"When the Prime Minister of the Overgeared Kingdom extends an invitation, one doesn't hesitate.\" Muto settled into his chair, studying Lauel carefully.\n\nThe third-ranked merchant in the entire continent had been both thrilled and anxious when the summons arrived. Grid's kingdom represented everything Muto admired—a nation built on merit and innovation rather than the calcified hierarchies of the old world. If he could secure exclusive trading rights with such a rapidly growing power...\n\n\"You've been trading with the Saharan Empire for some time now, haven't you?\"\n\n\"Four years this autumn.\" Muto couldn't help but smile at the memory. \"Pure luck, really. I ran into Duke Guardian during a quest, and he opened doors that would have taken decades to reach otherwise.\"\n\nLauel's eyebrows rose. \"Four years? That's earlier than even Kir managed.\"\n\n\"By about six months, yes.\" There was no pride in Muto's voice, only a weary sort of resignation. \"I pioneered that market. For all the good it did me.\"\n\nThe statement hung in the air. Lauel leaned forward, elbows on the desk.\n\n\"Explain that. You were first to the largest market on the continent, yet you're ranked third behind Kir. On paper, that makes no sense.\"\n\nMuto's jaw tightened. \"Kir doesn't build businesses—he steals them. The man's political power dwarfs mine, and he's not afraid to use it. Slander, intimidation, buying out my contacts... I've lost more accounts to his machinations than I care to count.\" He met Lauel's eyes squarely. \"I'm not vessel enough for first rank. Never claimed to be. But third? Third I can manage. Third I've earned.\"\n\nIt was the truth, and they both knew it. If the Overgeared Kingdom wanted the best, they would have summoned Kir. They hadn't. That meant they wanted something else—someone they could trust.\n\n\"I'm here because you need something from me,\" Muto said quietly. \"Tell me what it is. I'll deliver.\"\n\n*Sharp. No ego. Good.*\n\n\"You accompanied King Grid on the East Continent,\" Lauel said. \"He spoke highly of you. So let me be direct: I need you to become a con man.\"\n\nMuto blinked. \"I... excuse me?\"\n\n\"Sell defective merchandise to the imperial palace. Goods that will catastrophically fail within a month. In doing so, you'll burn every bridge you have with the empire. Your dealings there will be finished.\"\n\nThe room seemed to tilt. \"What are you—Lauel, half my wealth comes from imperial contracts. You're asking me to—\"\n\n\"One-third.\"\n\n\"—commit professional suicide for—what?\"\n\n\"One-third of the Overgeared Kingdom's trade. Exclusive contracts. The Muto Company becomes our primary merchant partner.\"\n\nThe words didn't register at first. When they did, Muto felt his breath catch.\n\n\"A third of a *kingdom's* trade...\"\n\n\"Not just any kingdom. We're growing faster than anywhere except the empire itself. Players are flooding in daily—Grid's items draw them like moths to flame, and our infrastructure expands to match.\" Lauel smiled, sharp as a knife. \"In five years, maybe less, we'll be the second-largest economy on the continent. I'm offering you a third of that pie.\"\n\nMuto's mouth had gone dry.\n\n\"The first rank,\" Lauel said softly. \"Shouldn't you take it?\"\n\n***\n\n*Deep breath. You can do this. Sky-sent opportunity. Sky-sent. Don't waste it.*\n\nMuto waited in the empress's receiving room, his hands trembling despite his best efforts. This was madness. Actual madness. Swindling the Saharan Empire wasn't just career suicide—it was a gamble with his life. If they discovered the deception before the plan came together...\n\nHis hands shook harder. He drained another cup of cold water.\n\n\"Did the sun rise in the west today?\"\n\nEmpress Marie swept into the room, and Muto's trembling stopped as if a switch had been thrown. **Merchant's Fortitude**—the passive skill that had saved him countless times—locked his nerves in iron. When facing a trading partner, he simply *could not* show weakness.\n\nHe rose smoothly and bowed. \"Your Majesty grows more radiant with each season. My family will speak of this audience for generations.\"\n\n\"Flattery is for amateurs, Muto. Natural beauty doesn't fade—it simply *is*.\" She settled onto her chaise, eyes gleaming with interest. \"Now, you've broken protocol. Every merchant sees my husband first. Why am I so fortunate today?\"\n\nThe question was playful, but Muto heard the calculation beneath it. He'd counted on this—on Marie's endless cold war with the emperor, her need to feel superior even in small ways.\n\n*The hook is set. Don't fumble it.*\n\n\"Your Majesty has impeccable taste in rare goods. What I've brought today deserves to be seen first by someone who can truly appreciate it.\" He gestured, and his assistants unveiled the pieces.\n\nMarie went still.\n\nThe chandelier was magnificent—matte black metal shaped into flowing curves, with candle holders fashioned as imperial chrysanthemums. The mobile beside it shared the same dark elegance, its razor-sharp leaves catching the light like obsidian knives.\n\n\"The craftsmanship...\" Marie rose, circling the chandelier slowly. \"When lit, the petals will glow crimson—tulips blooming inside chrysanthemums. And this metal...\" Her fingers traced the metal's surface. \"What *is* this?\"\n\nHere it was. The moment of truth.\n\n\"Dragon-iron, Your Majesty. From the lair of Nevartan the Mad.\"\n\nMarie's head snapped around. \"Impossible. No human could—\"\n\n\"Nevartan abandoned his lair months ago. He wanders the continent in madness, leaving his hoard unguarded.\" Muto kept his voice calm, matter-of-fact. \"My scouts confirmed the cave was empty. We had three hours to take what we could carry before territorial drakes moved in.\"\n\nIt was a beautiful lie, buttressed by just enough truth. Nevartan *was* wandering. Entering a dragon lair *would* be possible under those circumstances. And the metal itself was genuine insane dragon iron—just badly flawed, prone to stress fractures after sustained weight.\n\n\"Experts,\" Marie commanded. \"Now.\"\n\nFour master craftsmen emerged from the shadows and swarmed the pieces. Muto waited, heart hammering behind his merchant's calm, while they examined every joint and seam.\n\n\"Mineral origin: unknown, but consistent with dragon-touched materials.\"\n\n\"The metalwork is craftsman-grade, possibly higher. Excellent technique.\"\n\n\"However...\" The lead expert frowned. \"The design harmony is lacking. This won't be a masterpiece—the components fight each other rather than complement.\"\n\n\"But still valuable,\" another added. \"Extremely so.\"\n\nMarie smiled. \"I'll take both.\"\n\n\"Ah...\" Muto let his expression fall. \"Your Majesty, I... I intended to show one to His Majesty. Something this rare, he should have first—\"\n\n\"Oh, Muto.\" Marie's smile widened. \"Drop the act. You came to me first because you knew I'd pay more. Well, you were right. I'll buy both. And I'll gift one to my dear husband—he'll be *so* pleased.\"\n\nShe looked absolutely delighted at the prospect. Muto suppressed a shudder. The emperor and empress would both be in their chambers when those pieces came crashing down.\n\n\"Your Majesty is far too perceptive.\"\n\n\"I'm simply realistic about my marriage.\" She waved a hand. \"The price?\"\n\n[**You have received 580,000 gold as the transaction price for the Insane Dragon Iron Chandelier.**]\n\n[**You have received 190,000 gold as the transaction price for the Insane Dragon Iron Mobile.**]\n\nHis Advanced Trading and Bargaining passives had squeezed every possible coin from the deal. Even after splitting the profit with the Overgeared Kingdom, Muto would walk away wealthy.\n\n\"Your Majesty is generous beyond measure.\"\n\n\"Don't spend it all in one place, Sir Muto.\"\n\nHe bowed and withdrew, his merchant's smile never slipping. Only when he was safely outside the palace walls did he allow himself to exhale.\n\nOne month. In one month, that chandelier would give way under its own weight. The mobile's leaves would snap free like guillotine blades. And in the chaos that followed, Grid would strike.\n\nMission accomplished.\n\n***\n\n\"So that's Titan.\"\n\nGrid stared up at the walls and felt something inside him shrivel. They were *endless*—great towering slabs of stone that made Reinhardt look like a provincial backwater. The sheer *scale* of the empire pressed down on him like a physical weight.\n\nFor a moment, he genuinely considered avoiding conflict with this nation forever. Just... not picking this fight.\n\nThen he shook himself.\n\n*Can't afford to think like that. Shrink back now, and they'll swallow you whole.*\n\nThe Overgeared Kingdom was growing, yes, but the empire grew faster. If he wanted to survive, he couldn't just defend—he had to *attack*. Seize their resources, steal their advantages, force them to react to him instead of crushing him at their leisure.\n\n*Strike first. Strike hard. Make them bleed.*\n\nSurururuk.\n\nThe convoy rolled forward into the shadow of those impossible walls. Behind him, Kasim's operatives were already at work, pressing needles into the ancient stone at precise intervals. The guards watching Grid's procession saw nothing—why would they? No one had breached these walls in centuries.\n\n*One month. You get one chance, so make it count.*\n\nThe chandelier would fall. The walls would crack. And in the confusion, Grid and his elites would slip into the imperial palace and gut Immortal where they slept.\n\nHe wanted them to understand: nowhere was safe. Not anymore. Every night, they would go to bed wondering if this was the night the Overgeared King came for them.\n\n*Veradin. Agnus. I'm coming.*\n\n\"Overgeared King Grid is entering!\"\n\nThe gates opened, and sound crashed over him like a wave.\n\n\"WAAAHHHHH!\"\n\n\"KING GRID! WELCOME!\"\n\n\"GLORY TO THE OVERGEARED KINGDOM!\"\n\nBOOM. BOOM. BA-BOOM-BOOM-BOOM!\n\nDrums thundered. Flower petals rained from the ramparts. The citizens of Titan lined the streets ten deep, screaming themselves hoarse. Reporters jostled for position, shouting their commentary into broadcasting orbs.\n\n『In five hundred years of imperial history, they have formally received exactly one foreign dignitary—Prince Rajandra of Lubana, who brought them the head of Undefeated King Hamad!』\n\n『The Saharan Empire doesn't *do* diplomacy! They conquer! For Grid to receive this honor—the implications are staggering!』\n\n『We may be witnessing a genuine shift in continental power!』\n\nGrid straightened in his saddle. These people—these *thousands*—were here for him. Honoring him. If he'd shown up empty-handed like some provincial bumpkin, the shame would have been unbearable.\n\nBut he hadn't. He'd brought gifts, brought tribute, brought himself in full royal regalia. His Dignity stat helped, certainly, but more than that: he'd done this before. National competitions, dungeon raids, the founding of his kingdom—he knew how to carry himself in the spotlight.\n\n*This is theater. Play your part.*\n\nHe raised a hand, and the crowd's roar doubled.\n\n'*Your Majesty.*'\n\nKasim's voice, tight with tension. Grid kept his smile fixed, barely moving his lips.\n\n\"Report.\"\n\n'*I've been scouting the palace with Shadow Movement. It's... bad. I've detected at least ten individuals more powerful than me. Possibly more beyond my range.*'\n\n\"Can they detect you?\"\n\n'*Almost certainly. If they're looking for me, they'll find me.*'\n\nGrid thought of Laden—Duke Steim's knight, who'd spotted Kasim despite his stealth. These imperial monsters would be far more dangerous.\n\n\"Then stay out of the palace. I won't have you captured.\"\n\n'*But if you need—*'\n\n\"I have Knights Summoning,\" Grid said quietly. \"You, Piaro, Asmophel—I can pull you to me in seconds. Stay hidden until I need you.\"\n\nKasim fell silent, acknowledging the order.\n\nGrid exhaled slowly and advanced toward the palace entrance. Time to meet the empire's strongest.\n\n[**You have discovered a strong person of this era!**]\n\nThe Hero King title activated instantly, flooding Grid with adrenaline as his fighting energy surged. Standing at the palace entrance, resplendent in ice-white armor, was Mercedes—First Knight of the Red Knights, and one of the most dangerous swordswomen alive.\n\nShe inclined her head slightly. Just slightly.\n\n[**Mercedes' deep eyes have looked at you.**]\n\n[**Some of your stats and skills are forcibly revealed to Mercedes.**]\n\n[**You can't resist.**]\n\n[**Mercedes' sharp sword energy threatens you. The strong pressure makes your mind and body shrink.**]\n\n[**All speeds are reduced by 30%.**]\n\n[**Skill casting speed is reduced by 20%.**]\n\n[**You have resisted.**]\n\n[**Reflecting the status has failed.**]\n\nGrid had endured this before—that soul-deep gaze that peeled back your secrets and weighed your worth. It didn't frighten him anymore.\n\n\"You...?\" Mercedes' eyes widened.\n\n\"Whatever you saw in there,\" Grid said, stepping forward, \"keep it to yourself.\"\n\n*Tak.*\n\nHe gripped her shoulder—hard enough to make her flinch—and leaned in close.\n\n\"Next time, bow *deeper*. A knight doesn't meet a king's eyes unless that king allows it.\"\n\n\"Kuk—!\"\n\nMercedes stood frozen, her beautiful face twisted in shock and fury. This man had been *kneeling* before her mere months ago. Begging for imperial favor. And now—\n\nGrid walked past her without a backward glance, entering the great hall beyond.\n\nAnd immediately stopped.\n\n[**You have discovered a strong person of this era!**]\n\n[**You have discovered a strong person of this era!**]\n\n[**You have discovered a strong person of this era!**]\n\n[**You have discovered a strong person of—**]\n\n[**You have discovered—**]\n\nThe notifications came in a flood. Five. Ten. Fifteen. More.\n\nThe hall was filled with monsters.\n\nGrid's smile didn't waver, but his hand drifted toward his sword.\n\n*Wonderful. Just wonderful.*"
}