{
  "id": 784,
  "title": "Chapter 784",
  "content": "A chill ran down Grid's spine.\n\n*What...?*\n\nThirty pillars lined each side of the great hall at four-meter intervals. The space was breathtaking—just the entrance hall alone dwarfed anything in the Overgeared Kingdom. All those months of building, all that effort... and it amounted to a speck of dust compared to this empire.\n\nBut the architecture wasn't what made Grid's hands tremble.\n\nHe swallowed hard and moved forward. At the far end of the hall, a figure on the throne watched him approach.\n\n*Step. Step. Step.*\n\nWith each footfall, Grid's fighting energy stirred in response to the *powerhouse* before him, deepening from purple to crimson. Some courtiers leaned forward with interest. Others scowled. A few didn't seem to notice at all.\n\nSilence pressed down on the hall.\n\n\"Overgeared King Grid greets Your Majesty the Emperor.\"\n\nGrid reached the base of the dais and sank to one knee, head bowed. Emperor Juander—the absolute power of this age. Countless armies answered his call. Entire nations bent to his will. Grid wouldn't dispute that this man ruled the continent.\n\nEnemy or not, present or future, Grid wouldn't dishonor himself by skipping the formalities. He simply hid the blade behind his courtesy.\n\n\"You truly are the Hero King.\"\n\nThe Emperor's hair was white—not the yellowed grey of age, but a lustrous silver that caught the light. \n\n\"King of the Overgeared Kingdom, I sincerely welcome you to the empire.\" Juander's voice carried effortlessly through the vast space. \"I am the Emperor.\"\n\nNo lengthy introduction needed. The title itself proclaimed mastery over heaven and earth. It wasn't arrogance—it was simply truth.\n\n*What is this?*\n\nGrid had known the moment he crossed the threshold. The chill down his spine, the primal fear—it wasn't from the ranks of powerhouses lining the hall.\n\nIt was from *him*.\n\n*...The last boss?*\n\nGrid's Legendary Blacksmith's Eyes returned nothing. Character Observation failed. The level gap was too vast. But his insight—that recently awakened stat—screamed at him.\n\nThe Emperor was *strong*.\n\n*This is beyond expectations.*\n\nAn NPC's power often reflected their status. The leaders of nations and clans, especially, possessed frightening strength. The Water Clan King. The Evil Eyes' Ruler. Both had proven that rule.\n\nSo how strong was the master of the entire continent?\n\nGrid had expected formidable. He hadn't expected *this*.\n\n*Legendary level...*\n\nThe system might make an 'emperor' equivalent to a 'legend.' It made sense, actually. If the empire's founder was myth-tier, then the bloodline itself...\n\n\"So, did you enjoy your welcome?\"\n\n\"More than I deserve. I'm grateful Your Majesty was willing to accept my sudden visit.\"\n\n\"We may be temporary allies, but allies nonetheless. It's only natural that I and my people show you respect.\" The Emperor smiled, his expression pleasant. His grey eyes, however, held the cold calculation of a predator. \"Just as you showed proper respect to me.\"\n\nEvery word carried layers of meaning.\n\n\"Now then—what brings you to seek me out?\"\n\n\"I came to thank Your Majesty personally for the mercy of the truce.\"\n\n\"Mercy... of the truce.\"\n\nThe Emperor's eye twitched.\n\nWhen the empire had mobilized to crush Valhalla, the Overgeared Kingdom's army had massed at the imperial border. The empire—which had *always* dictated terms to foreign nations—had been forced to negotiate. For the first time in generations, they'd backed down.\n\nIt was a humiliation the Emperor would prefer to see erased from history.\n\nAnd this bastard had just dragged it back into the light.\n\n*This son of a bitch dares?*\n\n\"Tch.\"\n\nThe sound came from Punching King Rigal, one of the empire's seven dukes. Commander of the Sky Force—five hundred griffons, three hundred wyverns. His ground armies numbered in the hundreds of thousands. His pride in the empire was matched only by his pride in himself.\n\nHe couldn't forgive Grid. This nobody who'd declared himself king and forced the empire to bend.\n\n\"The man is an honored guest.\" Rachel, another duke, spoke without looking away from Grid's fighting energy. \"Don't let him bait you. Would you cause an international incident because you can't control your temper? Though...\" Her lips quirked. \"I'm not entirely certain it *was* bait. Kukuk.\"\n\nRachel was descended from Dehakel, one of the empire's founding heroes and a legendary spearman. She wielded a spear herself, and her Twilight Spearsmanship—forged in countless wars—made her comparable to the Red Knights. Some said she rivaled even Kirinus, the continent's finest spearman.\n\nGrid felt the shift in atmosphere.\n\n*They show up to greet me, then don't even say hello.*\n\nPetty. But what could he do? They were strong. He was weak.\n\nHe'd endure whatever treatment they dished out.\n\n*For now.*\n\n**[Rigal]**  \n**Level:** 439  \n**Class:** Rider  \n**Stats:** ????  \n**Skills:** ????\n\n**[Rachel]**  \n**Level:** 475  \n**Class:** Spearman  \n**Stats:** ????  \n**Skills:** ????\n\n*Are these the Five Pillars?*\n\n\"Did you really travel all this way just to say thank you?\"\n\nThe voice dripped with skepticism. Even the Emperor addressed Grid as a king, but this speaker stripped away every title.\n\nBoth Grid and the Emperor frowned.\n\n\"Wasn't Reinhardt recently attacked by that organization—Immortal?\"\n\nGrid's eyes found the speaker.\n\n**[Limit]**  \n**Level:** 468  \n**Class:** Sword Duke  \n**Stats:** ???  \n**Skills:** ???\n\nMaster of the Red Knights. The empire's finest swordsman. \n\nLimit ignored Grid's displeasure and the Emperor's darkening expression. \"That same Immortal guild is currently here in Titan. So the *real* reason you came to the empire—it's to hunt them down, isn't it?\"\n\n\"Hunt Immortal? Here?\"\n\nThe empire might dwarf the Overgeared Kingdom, but Limit was a duke and Grid was a *king*. Basic courtesy demanded he at least pretend respect.\n\nYet Limit showed none. As if the entire Overgeared Kingdom was beneath notice.\n\nA smile played at Limit's lips as Grid's fighting energy flared brighter.\n\n*Yes. Show it.*\n\nFew in the empire had been pleased by the truce. Emperor Juander, forced to negotiate with a tiny kingdom, had been called the most incompetent emperor in history. If Grid now showed hostility toward Limit—representative of the noble faction—it would be perfect.\n\nThe duke's loyalty to the Emperor would waver. He might even fully commit to the Empress's faction.\n\nThat was Limit's game. Provoke Grid. Wait for the explosion.\n\nGrid's loss of composure would make Juander look pathetic—unable to command respect even from minor kings. Meanwhile, Limit, champion of the Empress's faction, would have put the upstart in his place.\n\nThe rumors would spread. The Empress's position would surge.\n\nLimit waited for the detonation.\n\n\"...If I'd come for that reason, things would certainly be more *enjoyable*.\" Grid's voice was calm, almost pleasant. \"I'd get to punish those villains with my own hands. But isn't it a shame? I had no idea they were hiding here until just now.\"\n\nGrid didn't take the bait. Reaching the summit among two billion users had taught him caution.\n\n\"But that does raise a question.\" Grid's gaze sharpened. \"Duke Limit, how *do* you know about Immortal? Are you the one who sent them to the Overgeared Kingdom?\"\n\nHe wasn't just deflecting. He was *counter-attacking*.\n\n\"Are you dissatisfied with the armistice that *His Majesty* arranged? Is that why you struck at the Overgeared Kingdom—breaking the very agreement *His Majesty* himself negotiated?\"\n\nGrid emphasized the Emperor's title. Repeatedly. Framing Limit as acting against the imperial will.\n\n*Of course, it won't work.*\n\nGrid was Juander's enemy, present and future. The Emperor would see through this transparent attempt to play them against each other. Limit was doing the same to him, after all.\n\nBut surprisingly, the Emperor didn't dismiss it out of hand.\n\nLimit *was* in the Empress's faction. The Emperor had been disciplining both Limit and the Red Knights lately. Would it be so strange if Limit held a grudge? If he'd orchestrated the attack on the Overgeared Kingdom out of spite?\n\nThe Emperor's face revealed nothing. He couldn't question a vassal's loyalty in front of a foreign king.\n\n\"The situation has grown... *noisy*.\" The Emperor rose smoothly. \"Let us enjoy dinner.\"\n\n***\n\n*What can I do about the level gap?*\n\nAt dinner, Grid confirmed the names and levels of attendees. The empire's average powerhouse level exceeded Piaro's.\n\nThe problem was, Piaro had a *Farmer* class.\n\nThe empire's might was crushing. The uncertain future pressed down on Grid like a physical weight.\n\nBut someone else was even more anxious.\n\n*That man...*\n\nMercedes couldn't look away from Grid. The beautiful, ice-cold First Knight watched him with obvious wariness—something close to *fear*.\n\nHer innate ability to read talent and potential always gave her a measure of people. But Grid? He defied measurement. And that spot on her shoulder where he'd touched her earlier—it felt *strange*. \n\nShe'd never experienced anything like this.\n\n\"He's no insignificant player.\"\n\nSword Duke Limit materialized at her side, voice low. \"Strike at Grid.\"\n\n\"...Pardon?\"\n\n\"You don't need to kill him. Just make it clear the empire ordered the hit.\"\n\n\"You want us to attack an honored guest? May I ask why?\"\n\n\"To make Grid break the armistice first.\" Limit's eyes glittered. \"What happens when the agreement His Majesty negotiated gets shattered by the other party? Absolute disgrace. His political standing would crater.\"\n\n\"...\"\n\nLimit had always been torn between temptation from the Empress and loyalty to the Emperor. Now, it seemed, he'd chosen his side.\n\nThe Emperor's constant pressure on the Red Knights had produced the worst possible result.\n\n\"The Empress will provide support,\" Limit whispered. \"Necromancers. Good ones. Strike when Grid's returning to the Overgeared Kingdom.\"\n\n\"...I understand.\"\n\n*Is this right?*\n\nMercedes knew it wasn't. Knights served their lords. Remained faithful even when orders conflicted with conscience. That was a knight's *fate*.\n\nThis felt like a denial of everything she was.\n\nShe bit her lip until blood welled, gaze shifting between the Emperor and Grid.\n\n***\n\nAt the same time, in Empress Marie's palace.\n\n\"This is a perfect opportunity.\" Veradin—the mastermind who'd turned Limit to the Empress—gathered Immortal's elite forces. \"We'll show Grid what happens when you cross us.\""
}