{
  "id": 785,
  "title": "Chapter 785",
  "content": "Emperor Juander set down his fork with a satisfied nod. \"Excellent, as always.\"\n\nAround the dining hall, the gathered officials murmured their agreement. The imperial kitchens were renowned across the continent for reinterpreting regional cuisines into sophisticated masterworks, but tonight's feast was exceptional even by those standards. The chefs had clearly outdone themselves for this honored guest.\n\n*That frontier bumpkin must be shocked senseless,* Punching King Rigal thought, barely suppressing a smirk as he watched Grid. The Overgeared Kingdom's famous specialty was *potatoes*, of all things. He couldn't wait to see how a king who subsisted on peasant fare would react to true imperial cuisine.\n\nGrid lifted his goblet, surveying the spread before replying. \"The food is quite good. Especially the wheat dishes—those are remarkable.\"\n\nThere it was. Rigal's smile widened. The king was practically gushing, exactly as expected. The Saharan Empire truly was superior in every regard. Even Emperor Juander seemed pleased by the compliment.\n\nSeizing the moment, Rigal clapped his hands twice. \"Chef! Attend us.\"\n\nThe head chef hurried over, face pale. \"Y-Your Majesty called?\"\n\nBeing summoned before the Emperor could mean anything from commendation to execution. Sweat beaded on the man's brow.\n\n\"Explain the dishes to our honored guest,\" Rigal said smoothly. \"I'm certain there are many here he's unfamiliar with. It would be… educational.\"\n\nEvery dish served at the imperial table had history, tradition, lineage. Knowing that history enriched the experience—or so Rigal would claim. In truth, he simply wanted to highlight Grid's provincial ignorance. The contempt in his eyes was barely veiled.\n\nGrid met his gaze without flinching, his expression serene. \"How thoughtful of you, Sir Rigal. My thanks.\"\n\n\"Of course…\" Rigal blinked, momentarily thrown.\n\n*He still doesn't realize he's being mocked.*\n\nRachel, seated nearby, shook her head. \"You really are still a child, Rigal. Picking on someone weaker than you.\"\n\n\"Rich, coming from you. I still wake up in cold sweats remembering how you tormented me when we were young.\"\n\nThe two had been close since childhood, their families bound by long alliance. Their banter drew light chuckles from those nearby—until the head chef spoke.\n\n\"As the Overgeared King may already know, tonight's courses were prepared using wheat imported from the Overgeared Kingdom.\"\n\nThe pleasant atmosphere shattered.\n\n\"…!\"\n\n\"…?\"\n\nSurprise rippled through the hall. Emperor Juander's brow furrowed. Grid's smile didn't waver.\n\n\"I thought so,\" Grid said easily. \"The wheat dishes stood out particularly. Of course—you're using Overgeared grain.\"\n\nThe Emperor's frown deepened, but the chef—blissfully ignorant of the political minefield he'd just wandered into—pressed on with enthusiasm. \"Indeed, Your Majesty! The quality is unmatched. We're grateful for the shipment of the finest wheat on the continent.\"\n\nThe head chef was simply a chef. He understood ingredients, not intrigue. To him, Grid was an honored guest, and praising his kingdom's produce was only proper. Unfortunately, he'd likely be reassigned to the scullery by morning.\n\nGrid caught Rigal's darkening expression and resisted the urge to gloat.\n\n*Don't be petty,* he reminded himself. *You represent your kingdom now.*\n\n\"It speaks to your skill, Head Chef, that you can recognize such quality,\" Grid said warmly. \"His Majesty is fortunate to have someone of your caliber preparing his meals daily. I confess, I'm envious.\"\n\n\"Y-You flatter me, Your Majesty!\"\n\nThe chef beamed, bowing low. Emperor Juander's scowl softened into something approaching approval. He appreciated Grid's diplomatic save.\n\n\"The Overgeared King speaks truth,\" Juander declared. \"I am blessed to have a chef who can transform quality ingredients into masterpieces. This calls for celebration—bring out the thousand-year vintage. Pour for everyone.\"\n\n\"At once, Your Majesty!\"\n\nJust like that, the tension dissolved. Crystal glasses were filled with ancient wine, and the dinner party resumed its convivial atmosphere. The Emperor and his officials relaxed, though behind every smile lurked concealed thoughts.\n\n*Tsk.*\n\nIn a shadowed corner, Limit chewed his food with distaste, then rose abruptly. He had business at the Empress's palace.\n\n***\n\n\"He's been tested before,\" Limit said.\n\nEmpress Marie glanced up from inspecting her nails, one eyebrow raised.\n\n\"Grid reads situations well. He's disciplined, not easily provoked, and knows how to turn an opponent's aggression to his advantage.\" Limit's tone held grudging respect. \"I expected a simple brute who'd conquered through raw force. Instead, he's a natural politician.\"\n\n\"Surprising,\" Marie murmured. \"I thought him nothing more than a violent upstart.\"\n\n\"So did I. Yet…\" Limit shook his head. \"He handles himself like someone born to the game.\"\n\nIf only Limit knew the truth—that Grid had once been painfully lacking in every regard. But he didn't. The Grid he'd observed tonight was the product of countless trials, someone who'd grown through bitter experience. Limit couldn't help but acknowledge that growth.\n\n\"Veradin was right. Grid is formidable.\"\n\n*Veradin.* The enigmatic figure who'd appeared seemingly from nowhere and secured the Empress's favor. Limit had been suspicious at first, but recent events had forced him to recognize the man's capabilities.\n\n\"Then we proceed as planned,\" Marie said. \"Strike tonight. Make it appear as though Grid has moved against the Emperor. Once suspicion falls on him, the Empire will handle the rest.\"\n\n\"I'll coordinate with the Red Knights.\"\n\n\"Good. I'll mobilize Immortal. Don't fail.\"\n\nMarie smiled, a predatory expression. She'd been born a mere duke's daughter, yet now commanded princes and military leaders. And soon, when her son claimed the throne… The thought sent delicious shivers down her spine.\n\n***\n\n*What did you make of the Emperor?*\n\nGrid's carriage rolled through the darkened outskirts of Titan, the cheering crowds left far behind. Kasim's voice emerged from the shadows alongside the road.\n\nGrid considered the question carefully. Despite Juander's reputation as a tyrant, the man he'd dined with had seemed surprisingly… ordinary. Perhaps even a capable ruler. But for Kasim, Emperor Juander was an object of consuming hatred—the enemy he lived to destroy.\n\n\"The Emperor is… well, an emperor,\" Grid said finally. \"Arrogant beyond measure.\"\n\nSilence stretched for a moment, then: *You've changed.*\n\n\"Hm?\"\n\n*You're more careful with your words now than you used to be.*\n\nKasim had been watching Grid since before Lord's birth. He'd seen Grid when the man was rough-edged and reckless. He'd witnessed every stage of growth, every hard lesson learned. And now, watching Grid choose his words with such deliberate care…\n\n*You don't need to spare my feelings. What did you honestly think of him?*\n\nGrid exhaled slowly. \"He wasn't as selfish as I expected.\"\n\nThe master of a continent. A man who'd conquered dozens of kingdoms and united them beneath one banner. Such a figure should have been brutal, tyrannical, consumed by ego. Yet Emperor Juander had been measured, even respectful. It was embarrassing to admit, but Juander displayed more grace now than Grid had possessed when first grasping power.\n\n\"He has more friends than I anticipated.\"\n\n*…*\n\n\"But that's Juander the man. The Emperor is another matter entirely.\"\n\nGrid knew the truth of it. History itself testified.\n\n\"As Emperor, he's exactly as ruthless and selfish as we believed. How many kingdoms has he erased? How many lives snuffed out in the name of imperial expansion?\"\n\nThe answer was carved in blood across decades of conquest.\n\n\"Eventually, we'll fight. The Emperor will remain your enemy—that won't change. Don't worry about restraining yourself. Dream of revenge, Kasim. Let it sharpen you.\"\n\nKasim's driving force was vengeance against the Empire. The more deeply he embraced that purpose, the stronger he became. Grid had no intention of dulling that edge.\n\n\"I didn't see any of the Five Pillars tonight. Only seven dukes and their knight escorts. Yet even they felt formidable enough to mistake for the Five.\"\n\nIf those were merely the supporting pillars, how terrifying must the true Five be? Grid had escaped Kyle the other day only because of Braham and Mumud's intervention. Without Braham, both Grid and Ares's army would have been annihilated.\n\n\"Grow stronger, Kasim.\"\n\n*Yes, Your Majesty.*\n\nGrid had already achieved his early dreams—wealth, recognition, respect. No one dismissed him now. He was envied, even feared. But that was only in the real world. In Satisfy's vast and merciless landscape, Grid remained vulnerable. He had people to protect. A kingdom to defend.\n\nHe needed to be stronger. Much stronger.\n\n*Clatter, clatter.*\n\nGrid's carriage rolled slowly through the dark forest, paced to match the soldiers and supply wagons following behind. The measured speed was Grid's decision—a king who considered his people's limits. Growth, in more ways than one.\n\n***\n\n\"Pathetic.\"\n\nDeep in the forest shadows, Veradin watched the distant carriage approach with cold eyes.\n\n\"Human behavior is purely transactional. Every choice stems from desire for compensation. Take reproduction—why does sexual desire exist? Because pleasure is the reward for propagating the species. Compensation is the fundamental human need.\"\n\nA thin smile crossed his usually impassive face.\n\n\"Grid's compensation is respect. He spent most of his life despised, so now he's obsessed with others' evaluations of him. He craves universal acknowledgment. Wants everyone to respect him.\" Veradin's eyes gleamed. \"Slowing his carriage? That's not consideration for his soldiers. It's performance. He needs them to see him as benevolent, to validate his worth.\"\n\nGrid was a creature of pretense. All bluster and desperate image-crafting. That same insecurity made him viciously vindictive—he feared that any unpunished slight would invite more contempt. Grid's revenge plots actually exceeded Veradin's initial assessments.\n\n\"So very simple.\"\n\nVeradin's expression remained flat as the carriage drew nearer. People like Grid were depressingly common. He couldn't muster genuine interest in such a transparent specimen. \n\nAgnus, though… Agnus was driven by the need to compensate for *loss*. Far more complex. Far more fascinating. Veradin wanted to study him further. Which meant repairing their fractured relationship.\n\n\"And the means of repair…\"\n\nVeradin closed his fingers around the Ghost's Necklace, channeling magic power into the artifact.\n\n\"There you are, Grid. Right on schedule. Now die. And come back burning with even greater rage.\"\n\nDirect that rage toward Agnus. Use it to push Agnus deeper into madness. Once Agnus lost himself completely, he'd need an anchor again. He'd need Veradin.\n\n\"Summon Death Knight.\"\n\n*Kuwaaaahhh…*\n\nThe ground split open. Kyleo—the death knight who'd driven Khan to his grave—hauled himself from the earth at Veradin's command. Around Grid's carriage, hundreds of skeleton knights and skeleton mages materialized from the darkness, weapons drawn, empty eyes fixed on their target.\n\n*Something's wrong.*\n\nMercedes, the First Knight, watched from her position near the carriage. Her hand moved toward her sword."
}