{
  "id": 786,
  "title": "Chapter 786",
  "content": "The carriage wheels squealed and clattered as Grid's convoy pushed deeper into the forest. One by one, the cries of nocturnal beasts faded into silence, leaving only the creak of wood and the measured footfalls of soldiers.\n\n\"Monsters ahead?\" Grid murmured.\n\nWhen birds and beasts fell silent, predators prowled. It was common knowledge among travelers.\n\nBut Kasim's voice echoed in Grid's mind. *No monsters hunt along Titan's well-traveled roads. These are men. Many of them, concealed throughout the forest.*\n\nKasim's shadows spread through the darkness like questing fingers, reporting back what they found.\n\n*The enemy. Over three hundred.*\n\n\"Bandits?\"\n\n*The same ones who attacked Khan.*\n\n\"...!!\"\n\nImmortal.\n\nGrid's composed mask shattered. His face twisted with demonic fury as he kicked open the carriage door.\n\nA bone-rattling howl split the night.\n\nHundreds of crimson pinpoints ignited in the underbrush as the ground trembled beneath skeletal feet. The clouds parted, bathing the forest in pale moonlight—revealing a nightmare. An undead army, hundreds strong. Skeleton knights formed the vanguard while robed skeleton mages gathered in the rear, their hollow eye sockets glowing with eldritch power.\n\n\"Build up a stronger sense of revenge.\"\n\nThe melodious voice drifted from the rear of the undead host. Grid leaped from the carriage and locked eyes on the white-haired youth.\n\n\"Veradin...!\"\n\nThe architect of Khan's suffering. The bastard Grid had murdered a thousand times in his imagination.\n\n\"Die!\"\n\nBefore Kasim could intervene, Grid tore the Ideal Dagger from its sheath. Quick Movements ignited. He became a blur, streaking toward Veradin with murder in his eyes—then dismissed the dagger mid-charge, drawing his true weapon.\n\n\"Grid! Get him!\"\n\n\"Kill that bastard!\"\n\nThe necromancers' excited shouts rang out as their undead forces surged forward. Dozens of skeleton knights converged on Grid, wielding massive swords and spears with single-minded purpose.\n\nThe God Hands answered.\n\nFour spectral appendages materialized, transforming into Lifael's Spear. Holy light erupted. The skeleton knights combusted into ash, their unholy essence purged in an instant. A path opened before Grid.\n\n\"Impossible...!\"\n\n\"H-He just—!\"\n\nThe necromancers recoiled. Dozens of level 250+ skeleton knights, annihilated in seconds? By spears that moved without being touched?\n\nRealization struck them like cold water.\n\n*We're hunting the man who broke the sky.*\n\nGrid plunged into the heart of their formation and pressed the Pulling Device's trigger.\n\nThe Enlightenment Sword materialized—red and black blades spinning through moonlight, merging into one terrible instrument. The combined weapon carved through skeleton knights and necromancers alike, sending bodies and bone fragments spinning through the air.\n\n\"Veradinnnnnn!\"\n\nThe earth convulsed. Trees bent from the shockwaves. Grid carved a bloody path through the undead horde, four divine spears orbiting him like a living hurricane—Moses parting the Red Sea with violence instead of miracles.\n\n*He's transcended humanity.*\n\nVeradin had known Grid possessed godlike power. The intel had been thorough. But witnessing it firsthand—watching that unstoppable force bearing down on him—exceeded every prediction. Terror locked Veradin's legs even as his lips curled into a satisfied smile.\n\nGrid closed the distance with murder etched on his face, protected by four whirling spears. Did Grid believe himself invincible? Or had rage simply blinded him to danger?\n\nEither way, he never saw Kyleo coming.\n\nThe death knight materialized from shadow and drove a poisoned dagger through Grid's heart.\n\nIt should have been fatal. Kyleo's ultimate technique—imbued with decades of accumulated toxins, guaranteed to paralyze even dragons and drain half a target's health instantly. A slim chance existed of inflicting instantaneous death.\n\n\"Now!\"\n\nVeradin seized what should have been a perfect opening. At his command, forty-seven skeleton mages unleashed their prepared spell in perfect synchronization.\n\n*I have him!*\n\nThe magical energy coalesced, dense enough to warp the air. Veradin's grin widened. The bombardment would obliterate Grid's health, triggering his Immortality state—and then the real killing could begin.\n\nBut something was wrong.\n\n[Death Knight Kyleo has returned to an inactive state.]\n\n[The target received no damage.]\n\n[The target has resisted the absolute paralysis and poison.]\n\n\"What?\"\n\nVeradin's face went slack as the notification windows materialized. Impossible. He'd seen Kyleo's blade pierce Grid's chest. Witnessed the dagger sink to the hilt. Yet Grid stood unharmed?\n\n\"What is this...? Stop! Stop the cast!\"\n\nToo late. The skeleton mages completed their incantation.\n\nGravity Boom—advanced black magic, the ultimate spell in a level 300+ skeleton mage's arsenal. It distorted gravity within a localized area, crushing targets before detonating with catastrophic force. Devastating power offset by a narrow effective radius and glacial casting time. Nearly impossible to land on a moving opponent.\n\nWhich meant nothing if the target was paralyzed.\n\nExcept—\n\n\"He's moving?!\"\n\nGrid shrugged off Kyleo's paralysis and poison as if they were mere inconveniences, Khan's posthumous masterpiece Valhalla granting complete immunity. He took one step toward Veradin.\n\nThe spell detonated behind Grid's previous position.\n\nTwo steps.\n\nThree more explosions cratered the forest. Grid activated Link, carving through skeleton mages as if they were wheat before a scythe, never slowing as he closed on Veradin.\n\n\"First time I've said this.\" Grid's voice dripped with killing intent. \"You're going to die. For me.\"\n\nBut death would only be the beginning.\n\n\"You'll keep dying. Over and over. I'll make you suffer every moment of agony Khan endured, multiplied a thousandfold.\"\n\nKyleo desperately interposed himself, launching assassination techniques with mechanical precision. Every strike glanced harmlessly off Khan's armor.\n\n\"You're crazily overgeared,\" Veradin breathed, expression caught between terror and disbelief.\n\n\"Shut your filthy mouth.\"\n\nGrid swung the Enlightenment Sword for Veradin's throat.\n\nSteel sang against steel.\n\nA blade intercepted his strike—wielded by a woman whose transparent blue hair seemed to shed frost in the moonlight.\n\n\"You...?\"\n\nGrid faltered, recognizing her.\n\n\"Mercedes?\"\n\n\"...\"\n\nThe First Knight. The Empire's sword. The Emperor's tool. Her expression held nothing but sorrow.\n\n\"I'm sorry.\"\n\nHer shield drove upward at an impossible angle, catching Grid's guard and launching him skyward with overwhelming force. He tumbled through the air, completely exposed.\n\n\"Your Majesty!\"\n\nKasim's anguished cry echoed from the chaos. While Grid had tunnel-visioned on Veradin, Kasim and the soldiers had been surrounded by Red Knights.\n\n\"Shadow Move...!\"\n\nKasim tried to reach Grid, but the full moon's brilliance devoured the shadows he needed. His range constricted to mere meters. Red Knights closed in from behind.\n\n\"Ugh!\"\n\n\"Kasim...!\"\n\nLord's mentor. Lord's friend. Lord's surrogate father.\n\nGrid couldn't lose Kasim too.\n\n\"No...!!\"\n\nHe forgot his enemies, forgot everything except saving Kasim. Fly activated. Grid shot toward the trapped assassin—\n\nMercedes cut him off.\n\nHer blade became a silver blur, matching Kraugel's legendary speed as she drove Grid back. The God Hands swung Mjolnir as Item Transformation's duration expired, but Mercedes flowed around each strike like water, maintaining her position between Grid and Kasim.\n\nConfusion crystallized into rage.\n\n\"You dog...! The Emperor...! Did the Emperor order this?!\"\n\nSent off with smiles and warm words, only to be ambushed on the road?\n\nMercedes remained silent, unable to meet his eyes.\n\nVeradin filled the void with his gloating. \"If you possessed any intelligence, you'd have anticipated this. Did you truly believe I'd move against you without insurance?\"\n\nThe full moon. The Red Knights. Everything had been calculated. Now all that remained was killing Overgeared King Grid and broadcasting his death across the kingdoms. The Overgeared Kingdom's fury would ignite, Immortal's notoriety would skyrocket, and Agnus would finally be forced to join them.\n\nVeradin's smile widened. He knew Grid possessed the ability to summon his Overgeared members and the three heavenly powers. But not even Grid's full roster could overcome ten Red Knights led by the First Knight herself.\n\n*Please, summon them. I'll slaughter everyone you rely on.*\n\nMercedes' blade—carrying strength that dwarfed even Lorex's—pierced Grid's abdomen.\n\n\"Cough...!\"\n\nShe was a monster. Equal to the Seven Dukes, possibly superior. Blood sprayed from Grid's lips, but his own life barely registered. Only Kasim mattered. Kasim's finite, irreplaceable life.\n\n*If I die, Kasim dies. Lord loses another father.*\n\nGrid refused to let his son experience that soul-crushing grief and hatred.\n\nOnly one choice remained.\n\n\"Knight... Summoning...!\"\n\nThe trump card. The only power capable of achieving the impossible.\n\n\"Piaro!\"\n\n\"...?!\"\n\nA name buried deep in Mercedes' heart.\n\nShe froze as a pillar of light erupted beside Grid, and a man materialized from its brilliance."
}