{
  "id": 787,
  "title": "Chapter 787",
  "content": "# Rewritten Text\n\n---\n\n*Two pillars hold the empire high.*  \n*Eternal strength, the people's pride.*  \n*In Great Swordsman Piaro and Splendid Swordsman Asmophel, we trust.*\n\nOnce, that song had echoed through every corner of the Saharan Empire. Mothers sang it to their children. Soldiers marched to its rhythm. It was more than music—it was hope incarnate, embodied by two legendary knights whose very names inspired courage.\n\nMercedes had been one of those children. She'd worn out her throat humming that melody, dreaming of the day she'd earn her own red armor. Every bruise, every exhausting drill, every impossible trial—she'd endured them all chasing the shadows of her heroes. \n\nThen came the tragedy twelve years ago.\n\nThe day one pillar shattered.\n\n\"Piaro!\"\n\nThat name—buried so deep she'd almost forgotten the weight of it—suddenly tore from Grid's lips.\n\n*Flash!*\n\nA pillar of light erupted from empty air. When it faded, a man stood before them.\n\nHe looked nothing like a legend. Shabby farming clothes hung loose on his frame, stained with dirt and sweat. A battered straw hat shaded his weathered face. His hands—calloused and rough—gripped a simple sickle and hand plow. Every inch of him screamed *peasant*.\n\nBut Mercedes knew better.\n\nTwelve years meant nothing. She recognized him in a heartbeat.\n\n\"Piaro...\" The word escaped as barely a whisper.\n\n*Great Swordsman. Hero. The Emperor's Blade. My Captain.*\n\nAll those titles turned to ash in her mouth. Now, the only kindness she could offer was silence—to not speak the word that haunted them both.\n\n*Traitor.*\n\nPiaro shifted, positioning himself between Grid and Mercedes' leveled blade. Something flickered across his face—bitter and sweet all at once, like biting into fruit that had begun to rot.\n\n\"That sharp-eyed girl grew into a fine knight.\"\n\nHis voice carried no regret. No longing for what was lost.\n\nThat absence hit Mercedes harder than any blade could.\n\n\"You...\" Her jaw clenched. The words wouldn't come.\n\n*Why?* Why didn't he mourn what they'd had? How could he stand there with such quiet dignity? And why—*why*—was he defending the Overgeared King?\n\n\"Your Majesty, are you unharmed?\" Piaro asked, never taking his eyes off Mercedes.\n\n\"Thanks to your timing,\" Grid replied.\n\n\"Then I have fulfilled my duty.\"\n\n\"Don't tell me...\" Mercedes' voice cracked.\n\nDid the empire mean *nothing* to him anymore? Had it all been so easy to discard?\n\n\"Ah...\" A sound caught in her throat. Her vision blurred. She was *not* going to cry. She was a Red Knight. She didn't—\n\n\"I...!\" The words burst from her. \"Do you have *any* idea how long I searched for you?\"\n\nTwelve years. Four thousand, three hundred and eighty days of wondering if he was alive. If he'd suffered. If he was coming back.\n\nThe tears came anyway.\n\n\"Every single day,\" she choked out. \"I waited. I convinced myself you'd appear one morning and tell us it had all been a lie. That you'd been framed. That our Captain would come home.\"\n\nPiaro said nothing. He simply stood there, Grid sheltered behind him.\n\nAn *enemy*.\n\nThat's all she was to him now.\n\n\"But look at you!\" The words turned ragged, torn from somewhere deep and wounded. \"Where is he? Where did my Captain go?!\"\n\nHer anguished cry rang across the battlefield like a struck bell.\n\nEverything stopped.\n\nThe Red Knights turned as one, their weapons falling slack as they registered what their eyes were telling them.\n\n\"P-Piaro?\" one stammered.\n\n\"It can't be... Why is *he* here?\"\n\nThe clash of combat died. Veradin and his Immortal necromancers stood frozen, completely blindsided by this development. Even Grid looked uncertain as he watched the Red Knights' reactions.\n\n'What am I missing here?' Grid's mind raced. He knew the basics—Piaro had been exiled a decade ago, most of his followers executed as traitors. He'd assumed the current Red Knights were an entirely different generation, with no connection to the disgraced commander.\n\nClearly, he'd been wrong.\n\nMercedes provided the answer, her voice steadying as grief crystallized into something sharper.\n\n\"Every recruit who came after you... they all dreamed of meeting you,\" she said. \"The young knights who studied your teachings, who grew strong following your example—they're the ones wearing red armor now.\"\n\nPiaro's expression didn't change.\n\n\"No one dared speak your name aloud,\" Mercedes continued. \"But we *all* carried you with us. And I... I kept hoping. Hoping you'd return one day and prove the accusations false. That you'd come back to us.\"\n\n*Or at least let us bury you with honor.*\n\nHer tears had stopped. Her face had gone still as stone.\n\n\"But instead, the traitor stands before us alive and well.\"\n\nHiding behind the enemy king.\n\n*Crack.*\n\nSomething inside Mercedes shattered. The confusion burned away, leaving only pure, incandescent rage at the betrayal.\n\n\"I missed you so much.\" The words came out flat. Cold. \"I *wanted* to believe in you. Now I'm just... ashamed of myself for being such a fool.\"\n\n*Shing.*\n\nShe drew her second sword. Only with both blades in hand did Mercedes reveal her true strength—the stance of a solo number knight.\n\n\"Overgeared King Grid,\" she declared, her voice ringing with authority. \"You have committed the crime of harboring an imperial traitor within our borders. And as for Piaro...\" \n\nHer blades rose.\n\n\"I will execute him myself.\"\n\nFor the Red Knights, Mercedes' word was law. Her declaration broke the spell that had frozen them in place. As one, they turned from Piaro and renewed their assault on Kasim.\n\nMercedes launched herself forward, twin swords singing through the air toward Piaro's throat.\n\nVeradin seized the moment.\n\n\"*Now!*\" \n\nThe Immortal necromancers, who'd been watching the bizarre confrontation with growing unease, snapped back into action. Fresh undead poured from their summoning circles, crashing into Grid's soldiers like a rotting tide.\n\nVeradin's grin was vicious. \"Grid! You'd better summon every knight you've got! Unless you want to watch your precious farmer die right here!\"\n\n*Summon them all and lose everything in the gamble!*\n\nVeradin could practically taste victory as he imagined Grid's forces being ground down by the Red Knights' superior skill. What he didn't know—what he *couldn't* know—was that Piaro's Pounding Mortar had once torn the arm clean off Great Demon Belial herself.\n\nNo mere player could survive that.\n\n\"Piaro!\" Mercedes' blades blurred, striking faster than thought. *Clang! Clang!* \"How long are you going to toy with me? Do you still see me as that helpless child?!\"\n\nThe legendary farmer deflected her strikes almost casually, his humble sickle and hand plow moving with the precision of master-crafted blades.\n\nThen he spoke two words.\n\n\"Pounding Mortar.\"\n\n*BOOM.*\n\nReality *bent*.\n\nSomething massive appeared in the night sky—a pillar, no, a *mortar* of such incomprehensible scale that it seemed to devour the full moon itself. The sheer presence of it made the air vibrate.\n\nGoosebumps erupted across every exposed inch of skin.\n\nMercedes and the Red Knights scattered on pure instinct, their training screaming at them to *run*. But Veradin and his necromancers—caught flat-footed by the sudden shift, their agility stats too low for rapid repositioning—found themselves directly beneath the falling hammer of God.\n\nYet Veradin didn't panic. His grin only widened.\n\n\"So this is it.\" He'd studied the footage from the Belial raid countless times, analyzing every member of the Overgeared forces. He knew this technique. \"The legendary farmer's ultimate skill. Area-of-effect damage calculated as a percentage of the target's maximum health, right?\"\n\nThat was the only explanation. Nothing else could have wounded Belial so severely—a demon with millions upon millions of HP.\n\nPercentage-based damage.\n\nWhich meant...\n\n\"Immortal! Equipment change!\" Veradin's voice cracked like a whip.\n\nEvery top-tier member of the guild drew new armor from their inventories.\n\n> [The Armor of Great Weight has been equipped.]\n> \n> **[Armor of Great Weight]**  \n> Rating: Epic  \n> Durability: 59/59  \n> Defense: 579  \n> \n> * Increases defense in proportion to the wearer's level (1 defense per 3 levels)  \n> * Reduces physical damage by 9%  \n> * Movement speed is fixed at 0 and moving isn't possible  \n> * Stamina is reduced by 20%  \n> * Stamina will be reduced by 1 every 10 seconds  \n> \n> *Armor forged by the Pero tribes to withstand the Saharan Empire's relentless campaigns. It maximizes defensive capability at the cost of everything else. The excruciating weight drains the wearer's stamina rapidly, and its poor durability makes extended use impossible.*\n> \n> Weight: 69,900  \n> User Restriction: Level 250 or higher\n\nThe ultimate sacrifice armor—immobilizing the wearer completely while boosting defense to absurd heights. Useless for normal combat.\n\nPerfect for surviving a single devastating attack.\n\n\"If we endure this...\" Veradin's hands flew through his inventory, downing defensive buffs that would've bankrupted most players. The expendable sub-rankers who couldn't afford such gear? Not his problem. He and the elite survivors would be more than enough to help Mercedes butcher Grid. \"We win!\"\n\nThe mortar fell.\n\n*KRAAAAKOOOOOM!*\n\nPiaro had aimed it perfectly—right at the heart of the necromancer cluster. He understood battlefield tactics. Cut off the head of an undead army, and the body withers.\n\n\"Hahahaha! Ha—?\"\n\nVeradin's triumphant laughter died in his throat.\n\nDied along with everything else.\n\n> [The Armor of Great Weight has been destroyed!]  \n> [The Armor of Great Weight has been shattered!]  \n> [The Armor of Great Weight has been obliterated!]\n\nThe weight of that falling blow defied comprehension. It didn't *deal damage*—it simply *erased*. The epic-grade armor that Veradin had staked everything on crumpled like wet paper. His body, his soul, his very existence scattered into motes of grey light without so much as a scream.\n\nThe forest was gone.\n\nWhere ancient trees had stood moments before, there was now only a crater. Ash hung in the air like snow, drifting through the moonlight in lazy spirals. The undead army—hundreds of summoned corpses—crumbled to dust and returned to the earth.\n\nSilence.\n\nNo one could speak. They could only stare at the absence where a forest had been.\n\n\"As long as I draw breath,\" Piaro said quietly, his voice carrying across the stunned battlefield, \"no one will touch my king.\"\n\nHe looked at Mercedes. At the Red Knights.\n\nAt the enemies they'd become.\n\nThe old days were truly dead.\n\nMercedes felt something break inside her chest. The hero who'd taught her what it meant to be a knight—the man she'd idolized, followed, *loved* like a father—was pointing his weapon at the empire.\n\nAt *her*.\n\n*Is this what it means to be a knight?* The thought tasted like poison. *Something so easily discarded?*\n\n\"It's too dangerous,\" one of the Red Knights murmured. \"We can't win. Not just us.\"\n\n\"If we retreat now, even Captain Limit would understand—\"\n\n\"Everyone withdraw,\" Mercedes interrupted. Her voice sounded hollow in her own ears.\n\n\"Sir Mercedes?\" A younger knight looked at her in confusion. \"Who will cover your rear guard?\"\n\nShe didn't answer. Couldn't answer.\n\n*What's the point of living like this?*\n\nHer captain—the one she'd sworn her knight's oath to—was demanding she betray the emperor. Her teacher—the one who'd taught her about loyalty and honor—had already betrayed everything.\n\nBetter to die than become what he'd become.\n\nPiaro seemed to understand. For the first time since appearing, something like his old smile crossed his face.\n\n\"You haven't changed at all.\"\n\nSome people never bent, no matter the storm. The ones with conviction carved into their bones.\n\n\"I can't break your will.\" His grip shifted on the hand plow. \"Very well. If you insist on this path... I'll end it with my own hands.\"\n\nHe was Grid's now. Completely. And Mercedes had tried to harm his king. He knew her talent, her potential, her unshakeable beliefs. He'd raised her from a rookie into one of the empire's finest.\n\nNow he would kill her himself.\n\nBut Grid stepped forward, one hand raised.\n\n\"Piaro.\" \n\nThe farmer paused.\n\n\"Do you remember what I told you?\" Grid's voice was surprisingly gentle. \"That I wanted you to be happy?\"\n\n\"Your Majesty...?\"\n\nGrid took a breath. Then, in a voice that rang across the battlefield like a bell:\n\n\"Summon Knight—Asmophel.\"\n\nThe Red Knights froze.\n\nMercedes' soul left her body.\n\nThat name. That *impossible* name.\n\n---"
}