{
  "id": 788,
  "title": "Chapter 788",
  "content": "Twelve years ago, Asmophel had condemned Piaro and his loyalists as traitors.\n\nThe fallen hero.\n\nAfter Piaro's supposed betrayal, Asmophel ceased to be a hero. Having destroyed his dearest friend, slaughtered Piaro's comrades and their families with his own hands—he'd locked himself away in his mansion for years, drowning in drugs and alcohol. A slow suicide. A ritual summoning death itself.\n\n\"...Then one day, you vanished.\"\n\nEven ruined, a swordsman of Asmophel's caliber didn't simply disappear. Mercedes knew his strength too well to believe he'd been taken by force. Which left only one possibility.\n\n\"I assumed you'd staged your own disappearance.\"\n\nSilence.\n\nThe old hero materialized in a column of light. For a moment, he looked as he once had—noble and beautiful—and smiled at Mercedes the way he used to.\n\n\"I thought you'd grown tired of living in hell. That you'd fled the empire to escape the Red Knights' surveillance.\"\n\nIt had broken her heart. A knight who abandoned his duty for his own sake was no knight at all. Mercedes had mourned the man who'd once been her idol—watching him transform from hero to symbol of shame and corruption.\n\n\"I thought you were already dead.\"\n\nBut—\n\n\"You're alive. Standing beside the traitor Piaro.\" Mercedes gripped her twin swords so tightly that blood ran down her hands. She trembled. \"You were a hero once. Yet you betrayed your country, your emperor—all of it—to stand with your friend?\"\n\nSilence stretched between them.\n\nGrid wasn't concerned. He knew Asmophel would clear up the misunderstanding the moment he spoke.\n\n\"Mercedes.\" Asmophel's voice finally broke his silence. \"There are things you need to understand.\"\n\nHe met her gaze steadily.\n\n\"First—the Red Knights weren't protecting me. They were monitoring me. You know about the Fourth Knight, don't you?\"\n\nThe Fourth Knight was unique among the order. Unlike the others, it wasn't a position appointed by the emperor, but an inherited title.\n\n\"The Fourth Knight's position was designed to safeguard the Red Knights themselves. But it became corrupted. I believe the Fourth Knight is deeply connected to the Yatan Church. Dive—the man closest to Marie—was a black magician. In truth, he was Yatan's Seventh Servant, operating under the Fourth Knight's command. Those who watched me under the guise of protection? All of them answered to the Fourth Knight.\"\n\nShock rippled through the assembled knights.\n\nThe implications were staggering. If the person closest to the empress served Yatan, then Empress Marie herself must be involved with the Church. Mercedes and the Red Knights stared at Asmophel in disbelief.\n\n\"Impossible. The empress undergoes rigorous investigation before joining the imperial family. Only women of impeccable backgrounds are accepted. How could she possibly be connected to the Yatan Church?\"\n\n\"She was pure once.\" Exhaustion lined Asmophel's face. \"But purity couldn't survive her ambition to place her son on the throne. When she reached out to the dark forces that serve the great demons—she was lost. Humans are weak to temptation.\"\n\nHis expression twisted with self-loathing.\n\n\"I am no exception.\"\n\nMercedes frowned. \"What—\"\n\n\"I fell for Marie's beauty. We had an affair.\"\n\nThe words fell like stones into water.\n\n\"W-What?\"\n\nAsmophel didn't make excuses—didn't blame the Yatan essence that had weakened his mind or claim he'd been brainwashed. The truth was simpler and more damning. His inferiority complex toward Piaro had created a vulnerability. Yatan's essence had merely exploited what was already there.\n\nIt had been his own weakness from the start.\n\n\"You're right. I lost the right to call myself a knight long ago. I betrayed my country. I betrayed the emperor.\" His voice cracked. \"Piaro was innocent. A victim of my sins.\"\n\nEvery time Asmophel confronted what he'd done, his heart shattered anew. Shame filled his soul like poison. His guilt toward Piaro and the empire ran deeper than the lowest circle of hell.\n\n\"That's the truth. I'm the one who betrayed the emperor—not Piaro, not the Red Knights.\"\n\nHe didn't deserve to cry. Yet Asmophel's eyes burned red as the memories assaulted him.\n\n\"I wanted to hide my sin. To protect myself, I framed my friends. My comrades. I murdered their families. Their lovers.\"\n\nTerrible crimes committed under the banner of justice. Asmophel's body shook with pain, with sorrow, with rage at himself. But he forced himself to continue. This was why he still drew breath—to drag the buried truth into the light.\n\n\"Stop.\" Piaro—who had already forgiven him—tried to intervene.\n\nIt was useless. Asmophel wouldn't be silenced. His trembling voice carried to Mercedes and every Red Knight present.\n\n\"The knight of the empire—the hero you once admired and loved—still lives. Strip away your misconceptions about him. Direct your hatred where it belongs. Toward me.\"\n\nSilence.\n\nWhat was he saying? The Red Knights struggled to process his confession. But Mercedes understood immediately. Every word was truth. Tears spilled down her pale cheeks. She also realized what Asmophel wasn't saying. If he were truly irredeemable, Piaro would never have forgiven him.\n\n\"You...\"\n\nFor twelve years, one hero had suffered under false accusations while another drowned in guilt. And the source of it all was Empress Marie and the Yatan Church.\n\nThe moment this truth crystallized in her mind—\n\n*I am the hero of your heroes.*\n\nGrid felt a thrill of excitement seeing Mercedes' expression shift. Now that she knew the truth, she had a duty. She would need to convince the other Red Knights to believe Asmophel's testimony. To do that—\n\n\"I'll need solid evidence.\" Mercedes' voice was steady despite her tears. \"We'll return to the empire and investigate the events from twelve years ago. We'll determine whether your words are true.\"\n\nShe paused, meeting the eyes of her fellow knights.\n\n\"If we can verify your testimony...\"\n\nThe confused Red Knights straightened. Their eyes hardened with determination. They trusted Mercedes absolutely.\n\n\"We'll help you bring charges against Empress Marie. And see her punished.\"\n\nIt was the empire's duty—and the emperor's—to both heroes.\n\n*I'll need to investigate Captain Limit first.*\n\nWas he allied with the empress? Or had he been compromised by the Fourth Knight? There was so much to uncover. Mercedes felt the urgency pressing down on her. She turned to Piaro and Asmophel.\n\n\"I didn't see you today. When next we meet, I hope my blade doesn't turn toward you.\"\n\nIn her heart, she wanted to kneel. To scream at them for making her resent them all these years. But she couldn't. Not until the other Red Knights understood everything. She bowed deeply to Grid instead.\n\n\"Overgeared King Grid, I apologize for our intrusion. And I ask for your understanding. This debt will be repaid—even if I must give up everything to do so.\"\n\n\"Everything...\" Grid's smile widened. \"I look forward to it.\"\n\nHis heart raced at the notification.\n\n[Affinity with First Knight Mercedes of the Red Knights has increased by 20.]\n\nGrid knew how rare it was to gain affinity with named NPCs of her caliber.\n\n*She truly believes in Piaro and Asmophel. When the truth comes out, this will pay massive dividends.*\n\nMercedes would likely face danger in the process. Her opponent was the empress of the empire itself. There was a strong chance Mercedes would suffer a counterattack—perhaps even be branded a traitor like Piaro once was.\n\nFrom Grid's perspective, that was perfect. It could be his opportunity to pull Mercedes away from the empire entirely.\n\n\"We're leaving.\"\n\nMercedes commanded the Red Knights and approached her aide, who'd been guarding her horse at a distance. His name was Sky—a player, though Grid didn't realize it beneath the helmet.\n\n*Jackpot.*\n\nSky was elated. Thanks to Grid, he'd witnessed a hidden episode involving the Red Knights. One step closer to his grand ambition of making Mercedes his slave.\n\n*I need to reach the empress at the right moment. Grid—thank you for this gift.*\n\nSatisfy wasn't just a virtual world—it was a world, period. Politics, betrayal, scheming—all of it thrived here among two billion players with conflicting agendas. Sky understood this reality. And he was right.\n\n\"Kasim.\"\n\n—*Yes.*\n\n\"Eliminate the witness who overheard the conversation between Mercedes and Asmophel.\"\n\n—*You mean the First Knight's aide? What if she discovers me?*\n\n\"It doesn't matter. Mercedes will understand. Worst case, she'll stop you—but she'll also dismiss the aide. She'll have to be more careful going forward.\"\n\n—*Understood.*\n\nGrid's power had reached a level that defied conventional logic. His journey to transcend even the boundaries of legend was far from over."
}