{
  "id": 789,
  "title": "Chapter 789",
  "content": "**Chapter: The Weight of Wisdom**\n\nThe Overgeared Kingdom had painted a target on its own back. As the strongest player force in Satisfy, every ambitious guild and nation had reason to fear them—and therefore, reason to strike. It was the inevitable fate of the powerful: constant vigilance against those who would drag them down.\n\nBut Grid had forgotten this truth. During the National Competition, his kingdom stood vulnerable, its defenses weakened while its greatest champions competed abroad. The enemy had walked through the open door.\n\nKhan died because of that oversight. That single, terrible mistake.\n\n*My fault. My ignorance.*\n\nAfter Khan's death, Grid swore he would never again be so blind. Wisdom—that's what he lacked. If he'd thought deeper, planned better, Khan wouldn't have died alone in that smithy. Grid didn't possess Lauel's natural cunning or quick wit. His intelligence stat remained stubbornly average. But what he lacked in raw mental power, he could make up for through sheer, grinding persistence.\n\nThink. Keep thinking. Never stop thinking.\n\nEvery decision became a labyrinth of possibilities. Every conversation, a chess match. Where others saw a simple choice, Grid forced himself to examine it from ten angles, then ten more. His mind operated constantly, churning through scenarios even when his body screamed for rest.\n\nWhen the Red Knights and Immortal attacked him tonight, why summon only Piaro? Because Agnus—the real threat—had vanished from sight. The assault felt wrong, too obvious. If it was bait, and Grid bit down hard by summoning all his knights, his kingdom would lie exposed. Vulnerable. Empty.\n\nSo he'd summoned Piaro alone and kept his other forces in reserve.\n\nThe same logic applied to Mercedes' aide. The man hadn't shown any particular cleverness—but that wasn't the point. The point was that Grid didn't *know* him. Couldn't predict him. The aide had stayed by the horses throughout the confrontation, far from the action. An unknown variable in a situation that demanded control.\n\nSo Grid had given the order.\n\n\"Sigh.\"\n\nKasim melted into the shadows, gone on his dark errand.\n\nGrid slumped against the carriage seat, every muscle heavy with exhaustion. This mental warfare drained him worse than any raid boss. When he'd lived impulsively—acting on emotion, trusting his instincts, depending on others—life had been simpler. Lighter. This new burden of constant calculation felt like wearing lead weights on his thoughts.\n\n\"You've been through an ordeal tonight.\" Piaro bowed deeply, his weathered face warm with pride. \"But you handled yourself well, Your Majesty.\"\n\nRather than drowning in grief over Khan, Grid had honored his friend's memory by becoming stronger. By facing the Emperor himself without flinching. Piaro believed in this version of Grid—the man who thought before he acted, who protected what mattered.\n\nGrid studied his knight. \"Was I right to... handle the aide?\"\n\nHe'd witnessed the Red Knights' discipline firsthand. Despite their shock at Piaro's appearance, they'd executed Mercedes' orders without hesitation. They'd questioned Asmophel's testimony but hadn't defied their commander's judgment. Grid trusted that the knights present tonight would keep silent about Piaro and Asmophel.\n\nBut the aide? That man remained a cipher. Too distant to judge, too unknown to trust.\n\nSo Kasim had received his orders.\n\n\"Mercedes will sort through her own people now,\" Piaro said with certainty. \"She'll separate the trustworthy from the suspect. She's more than capable.\"\n\n\"You have a lot of faith in her.\"\n\n\"She's exceptionally intelligent. Always has been.\" Piaro's eyes grew distant with memory. \"I chose her as my seed for good reason. She's exceeded every expectation... she'll become a new pillar of the empire, in time.\"\n\nIn truth, Piaro had been shocked to see Mercedes alive at all. When Grid first summoned him and they'd crossed paths with the Red Knights, he'd assumed the entire previous generation had been slaughtered. Asmophel, in his brainwashed state, would never have left survivors to stab him in the back. That Mercedes—*Piaro's own student*—had survived seemed impossible.\n\nYet Asmophel had spared her. Why?\n\n*His subconscious rebelled,* Piaro realized. *Even corrupted, some part of him couldn't destroy talent that precious. He feared for the empire's future.*\n\nPiaro gazed up at the night sky. \"Your words have made me ambitious.\"\n\nGrid leaned forward. \"I'm going to recruit Mercedes.\"\n\nThe duel with her had been... humbling. She'd read his movements with unnatural accuracy, countering attacks before he fully committed to them. At first, he'd attributed it to superior skill, but the more he reflected, the clearer it became.\n\nShe'd *predicted* his actions. Seen his intentions before they manifested.\n\n*Completely broken,* Grid thought with grudging admiration.\n\nMercedes belonged to the same tier as Piaro—a transcendent Named NPC, an impossible wall for ordinary players to overcome. But Grid had stopped thinking of himself as ordinary. He'd claimed Piaro. He'd recruited Braham. He'd built a kingdom from nothing.\n\nHe would make Mercedes his knight.\n\nPiaro felt the same hunger. During their exchange of blows, he'd recognized that only Fated to Perish could overcome her defenses. And even that advantage wouldn't last forever.\n\n*Give her time,* Piaro thought grimly, *and she'll evolve past even that technique.*\n\nHis greed deepened. \"Yes, Your Majesty. You must secure her allegiance.\"\n\n\"Mm.\" Grid nodded, swallowing the question that rose to his lips: *Do you miss it? The empire? Your homeland?*\n\nHe trusted Piaro. That had to be enough.\n\n\"Let's return to Reinhardt.\"\n\nGrid doubted the empire itself orchestrated tonight's attack. The Empress, though—she reeked of guilt. But the implications sprawled too wide for him to untangle alone. He needed Lauel.\n\nHe climbed into the carriage, bones heavy with fatigue.\n\n*One day in Titan feels like a year anywhere else.*\n\nThrough the window, Grid spotted Asmophel walking alongside the carriage, pain etched into every line of his face.\n\n*His guilt has infected his soul,* Grid realized. *There's no salvation for a man like that.*\n\nPiaro might have forgiven him, but the dead Red Knights and their grieving families never could. Asmophel was probably counting the days until he achieved his revenge on the Empress—and then ended his own miserable existence.\n\n*Wait.*\n\nGrid straightened, an idea crystallizing.\n\n*Did ALL the Red Knights really die?*\n\nThe official story condemned them as traitors who followed Piaro's rebellion. Most had been executed. *Most*. Not all. Some escaped. Survived as fugitives, hiding across the continent.\n\n*I can give Asmophel something to live for.*\n\n\"Asmophel.\" Grid didn't hesitate. \"I have a mission for you. Travel the continent and find the survivors of the old Red Knights.\"\n\nAsmophel's head snapped up, face draining of color. \"W-What...?\"\n\n\"I'm going to recruit the previous generation's Red Knights,\" Grid continued calmly. \"It's possible, isn't it? They have no loyalty to the empire anymore.\"\n\n\"You want to gather... the survivors?\" Asmophel's voice cracked. \"But why me? Why not send Piaro—\"\n\nHe stopped. Understanding dawned across his features, but he couldn't bring himself to say the word.\n\n*Atonement.*\n\nHis head bowed low.\n\n\"Piaro forgave you,\" Grid said quietly.\n\nSilence.\n\n\"The others might feel the same way. You won't know until you face them.\"\n\nMore silence.\n\n\"Find them. Talk to them. That's your mission.\"\n\nAsmophel stood frozen. The order was tactical—bringing legendary warriors to the Overgeared Kingdom—but also deeply personal. A chance to confront his sins. To possibly, impossibly, earn forgiveness from those he'd wronged.\n\nThis was Grid's way. He thought about his people, invested in their happiness, gave them reasons to keep fighting. That quality, more than any stat or legendary skill, formed the foundation of the Overgeared Kingdom's strength.\n\n\"Always be happy.\" Grid's expression softened. \"That was Khan's dying wish for me. Let's try to honor it together.\"\n\n\"...I will remember.\" Asmophel's voice emerged thick with emotion.\n\nHe remained bowed as the carriage rolled away, wheels crunching against the road. Only when it disappeared from view did he finally straighten.\n\nFrom the carriage, Piaro watched his former student and silently cheered him on.\n\n*Stay strong. Come back with old friends.*\n\n---\n\n**[Hwan Kingdom's Resident (1)]**\n\n**★ Hidden Quest ★**\n\n*You must meet the minimum qualifications to challenge Chiyou's Test.*\n\n*First, transcend the limits of an ordinary person.*\n\n**Quest Clear Condition (1):** Reach level 400 without dying.\n\n* Every 20 levels gained without death grants a large amount of additional stats.\n* Death forfeits ALL acquired additional stats. Lost stats cannot be restored.\n* Death changes quest clear conditions to option two.\n\n**Quest Clear Condition (2):** Deaths must not exceed 5 before reaching level 400. (Current Deaths: 2/5)\n\n* This is your final chance. Failing the second condition permanently revokes qualification for Chiyou's Test.\n\n---\n\nVeradin stared at the quest window with bloodless lips.\n\nHe'd been so careful. When he first visited the East Continent, he'd ignored the common player routes and focused entirely on the Hwan Kingdom's yangbans—the immortal rulers who commanded the eastern kingdoms like pieces on a board. He'd cultivated the right connections, made the right impressions, and became the first player ever to receive this hidden quest.\n\nAt level 290, he'd ground his way past 300 without a single death, accumulating tremendous bonus stats.\n\nThen Grid happened.\n\nTwo deaths. All those stats—gone. Months of careful planning—wasted.\n\n\"Maybe...\" Veradin swallowed hard, Grid's words echoing in his skull.\n\n*\"The first time.\"*\n\nNot a threat. A promise. Grid wouldn't stop at two deaths. He'd hunt Veradin down again and again, methodically destroying everything Veradin had built.\n\n\"I'll hide,\" Veradin whispered to himself. \"Until I'm strong enough. Until I have a plan.\"\n\nPride warred with terror in his chest. He'd always believed himself superior—a manipulator, someone who controlled others through psychology and strategy. But Grid's items violated common sense. His power shattered assumptions. Veradin had never felt *fear* like this before, cold and corrosive.\n\n*I'm afraid of some ordinary person... ME?!*\n\nHis jaw clenched hard enough to ache.\n\nBut underneath the anger, questions remained. The Red Knights' reaction to Grid's farmer summon—they'd been *shocked*. Terrified, even. Veradin had stood too far back with the necromancers to hear the conversation clearly.\n\n*There's something there. Something important.*\n\nMaybe that farmer was the key to understanding Grid's power? A vulnerability to exploit?\n\nVeradin filed the thought away and began planning his vanishing act.\n\n---\n\n**Outskirts of Titan**\n\n*Chaeeeng!*\n\nMercedes' blade intercepted the dagger before Sky registered the attack. His shield came up half a second late, hand trembling as his brain caught up with reality.\n\n*That would've killed me.*\n\nMercedes peered into the darkness. \"Tell the Overgeared King I understand his concerns. I'll handle this matter personally.\"\n\nA voice drifted from the shadows—cold, professional: *\"...Understood.\"*\n\nSky's blood turned to ice. \"What...?\"\n\nAn assassin had just tried to kill him. And Mercedes had... had stopped it? Saved him?\n\n\"As of today, you're dismissed,\" Mercedes said flatly.\n\n\"What?\"\n\n\"You're banned from the imperial palace. Permanently.\"\n\n\"W-Wait, this doesn't make—\"\n\nSystem notifications cascaded across his vision.\n\n**[You have lost your Second Class: First Knight's Aide.]**\n\n**[All Red Knights quests have been terminated.]**\n\n**[You are denied entry to the imperial palace.]**\n\n**[Your affinity with Mercedes has been reset to 0.]**\n\n\"No... no, no, no!\" Sky stumbled backward, hands shaking. \"This can't—\"\n\nBut Mercedes had already turned away, dismissing him from thought as easily as thought from existence.\n\nSky stood alone in the dark.\n\n*Grid.* The realization hit like a warhammer. *This was Grid's doing.*\n\nAll that work. All those careful machinations, positioning himself as Mercedes' aide, working toward the ultimate goal of enslaving her through dark magic and forbidden quests—gone. Destroyed in an instant.\n\n\"You... YOU BASTARD!\" Rage flooded through him, hot and bitter.\n\nBut the anger cooled quickly. In its place, something worse.\n\nTerror.\n\nGrid could end someone's ambitions with a word. Crush them effortlessly. This new king didn't play by the old rules. He was something different. Something *greater* than King Wiesbaden had ever been.\n\n\"C-Crazy...\"\n\nSky fled into the night, no longer sure whether Grid was his enemy or his nightmare."
}