{
  "id": 79,
  "title": "Chapter 79",
  "content": "# Chapter 79\n\n\"Holy shit.\"\n\nPagma's Swordsmanship exceeded anything I'd imagined. The damage output, the utility—it was absurd.\n\n*One passive, multiple actives. No mastery skills, but this compensates for everything I've been lacking.*\n\nMost classes came with passives like Weapons Mastery or Armor Mastery, boosting equipment performance across the board. Pagma's Descendant had nothing. A massive hole in the class design that had pissed me off since day one.\n\n\"Not anymore.\"\n\nWhen inactive, Pagma's Swordsmanship increased my attack power and crit chance. Essentially, it functioned like Weapons Mastery.\n\n*The effect matches Intermediate Weapons Mastery. It deactivates when I use the sword dances, but that's manageable. Five active skills unlock when it's on.*\n\nPagma's Swordsmanship. This was what a legendary class should feel like. Maybe I could actually take pride in this fraudulent thing.\n\n*I've bitched about the production side, but the class is broken. Not a combat build, sure. My abnormal status resistance lets me tank, and if I develop combat skills, I'll be unstoppable. But...*\n\nOne problem.\n\n\"Why the fuck does it cost so much mana?\"\n\nI had around 500 mana total. Only that high because my Intelligence crept up from constant crafting. I'd never manually invested a single point. Without that passive gain, I'd be sitting at less than 100.\n\nThe bottom line: I couldn't use half the skills.\n\n\"Goddammit.\"\n\nWave. Restraint. Link. Kill. Transcend.\n\nFive sword dances. Minimum cost: 300 mana. Kill ate 1,200. Transcend devoured 1,800. To use them freely, I needed to dump points into Intelligence. But I'd never touched that stat since my warrior days.\n\n*Magicians pump Intelligence because it scales their damage. They get value. But me?*\n\nI didn't want to invest in Intelligence. Focusing on Strength and Stamina was optimal. More Strength and Stamina meant longer crafting sessions and higher attack power.\n\nBut Intelligence? What skills did I have that scaled with it? None. I'd be raising the stat purely for the mana pool.\n\n\"Shit. I have to do it anyway.\"\n\nComplaining wouldn't change reality. I needed the stat to use the sword dances.\n\n\"Status window.\"\n\n---\n\n> **Name:** Grid  \n> **Level:** 92 (1,531,400/3,798,000)  \n> **Class:** Pagma's Descendant  \n> * Probability of adding options when crafting: Increased  \n> * Probability of successful enhancement: Increased  \n> * All equipment can be worn unconditionally (penalties apply based on item rating)  \n>  \n> **Title:** One who Became a Legend  \n> * High resistance to abnormal conditions  \n> * Survive fatal damage with 1 HP  \n> * Easily acknowledged  \n>  \n> **Title:** First Unique Item Maker  \n> * **Dexterity +200**  \n>  \n> **Title:** Only Legendary Item Maker  \n> * **Dexterity +350**  \n>  \n> **Title:** Knight Slayer  \n> * **Stamina +100**  \n> * **Strength +30**  \n>  \n> **Title:** Apostle of Justice  \n> * **All Stats +10**  \n> * Unmatched bravery  \n>  \n> **Health:** 8,330/8,330  \n> **Mana:** 522/522  \n> **Strength:** 775  \n> **Stamina:** 523  \n> **Agility:** 208  \n> **Intelligence:** 180  \n> **Dexterity:** 855  \n> **Persistence:** 210  \n> **Composure:** 155  \n> **Indomitable:** 176  \n> **Dignity:** 155  \n> **Insight:** 155  \n> **Courage:** 99  \n>  \n> **Stat Points:** 0  \n> **Weight:** 9,404/19,700  \n\n---\n\nYesterday, when I entered Kesan Canyon, I was level 85. After clearing the monsters, I hit 92. Seventy stat points earned.\n\n\"I should've saved them.\"\n\nZero points remaining. Why? I dumped all seventy into Strength.\n\n\"Couldn't help it. The canyon spiders had insane defense.\"\n\nBoosting Strength made them easier to kill. More damage per hit. But now I regretted it.\n\n\"Should've stockpiled until I got Pagma's Swordsmanship.\"\n\nEvery point in Intelligence gave me three more mana. If I still had those seventy points, I could've invested them now. Built up the pool.\n\nToo late.\n\n\"I need to raise Intelligence.\"\n\nThe thought of learning skills I couldn't use made my blood boil. Anyone would be pissed. So I made an unusual decision.\n\n\"Hunt. Level up. Get Intelligence through leveling. At minimum, enough mana to use Kill.\"\n\nKill dealt 1500% of my attack power to a single target. Cost: 1,200 mana. Which meant I needed at least 400 Intelligence.\n\n\"Get 400 Intelligence through grinding.\"\n\nA rough estimate.\n\n\"This sucks.\"\n\nI'd started hunting for the first time since becoming Pagma's Descendant specifically to unlock Pagma's Swordsmanship. The frostlight orcs in the northern snowfields, then the monsters in Kesan Canyon—\n\nThe rush of combat after so long.\n\n*Right. This is what hooked me on Satisfy.*\n\nWatching my level climb. Seeing gold and loot pile up in my inventory. The satisfaction of growing stronger. For a moment, I wanted to stay in Kesan Canyon and keep grinding.\n\nBut reality didn't allow luxuries. My family was drowning in debt. My parents and Sehee couldn't sleep at night from anxiety. I needed to craft items, not hunt monsters. Items paid the bills.\n\n\"Yeah. Get back to Khan's smithy. Finish Dainsleif. That's the smart play.\"\n\nI crushed the urge to hunt and left the cave behind the waterfall. Staring at the stars, trying to push down the frustration—\n\n\"Kuwaaah!\"\n\nA roar erupted from the base of the waterfall. Water exploded upward. Six mermen surrounded me.\n\n\"Great. Fish out of water.\"\n\nMermen were male mermaids. Nothing like the fairy tales. Satisfy's mermen were hideous. I grimaced at the gills on their necks.\n\n\"You gonna dry out and suffocate?\"\n\nThe lead merman brandished his trident. \"Worry about yourself! Give me your heart!\"\n\nMermen ate human hearts for sustenance. Monsters inside and out.\n\n*Six of them.*\n\nMermen adapted to any environment. They lived across the continent. But the ones in Kesan Canyon were notorious. Level 175—among the highest-level mermen anywhere.\n\n*They're stronger in water. Six on one.*\n\nBefore learning Pagma's Swordsmanship, I would've run. But not now. I raised the **+8 Ideal Dagger**. The blade gleamed darker blue in the shadows.\n\n\"You want my heart?\" I grinned. \"How about I eat *you* instead?\"\n\nA merman snorted. \"Bah! Human bluffing.\"\n\n*Swaaah.*\n\nThey surged across the water like surfers riding a wave, closing the distance at terrifying speed. I waited. Let them come.\n\nJust before a trident pierced my chest—\n\n\"Pagma's Swordsmanship, Restraint!\"\n\nMy body moved. The dagger traced an arc, blue light flashing in the moonlight. A quiet, deadly dance.\n\nThen—\n\n\"...!!\"\n\nThe mermen's charge stopped dead. They flailed, struggling to break free from the invisible pressure locking them in place. I didn't waste time.\n\n\"Blacksmith's Rage!\"\n\n> [Blacksmith's Rage activated. Attack power and attack speed significantly increased for 20 seconds.]\n\n\"Wind Blast!\"\n\n*Kwa kwa kwa kwang!*\n\n\"Kyaak!\"\n\nWind slashed across their torsos.\n\n> [You dealt 3,750 damage.]  \n> [You dealt 3,802 damage.]\n\nTheir lower bodies—covered in scales—had high defense. But the human-like upper halves were vulnerable. Each strike carved deep. I kept attacking until—\n\n*Shit. Out of mana.*\n\nI yanked an inferior mana recovery potion from my inventory. Downed it. Waited for the bar to refill. Then I deactivated Pagma's Swordsmanship and switched to my custom skill.\n\n\"Wind of Justice!\"\n\n*Pepeng! Pepepepeng!*\n\nThe blast hit harder than Wind Blast. With Pagma's Swordsmanship inactive, my attack power and crit chance spiked. The damage multiplied.\n\nWind of Justice swept across the mermen. Those caught in the torso couldn't even scream.\n\n\"Quick Movements!\"\n\n> [Quick Movements activated. Agility and evasion rate significantly increased for 1 minute.]\n\n*Splash splash!*\n\nI dove into the melee. The **+8 Ideal Dagger** carved through flesh, targeting upper bodies with surgical precision.\n\n---\n\n**Glossary of Common Korean Terms:**  \nOG: Glossary Link.\n\n**Current Schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to unedited chapters and support goals for extra releases. Early access chapters update after the day's releases are complete."
}