{
  "id": 790,
  "title": "Chapter 790",
  "content": "**REWRITTEN:**\n\n\"Everything went according to plan?\"\n\n\"Yes, sir. We didn't conceal our involvement.\"\n\nLimit drummed his fingers against the mahogany desk, his frown deepening. \"Then why the silence?\"\n\nA week had passed since the Red Knights and Immortal struck at Grid. Seven days, and the Overgeared Kingdom hadn't issued so much as a statement. No declaration of war. No demand for restitution. Nothing.\n\n\"Their king was attacked in broad daylight, and they act as if nothing happened...\" Limit trailed off, considering the implications. Fear couldn't explain the silence—Grid had proven himself too bold for that. Which meant they were planning something. But what?\n\nHe drummed his fingers faster, pieces of a puzzle refusing to align. \"Do they know what we're after?\"\n\nIf the Overgered Kingdom had a competent strategist—and Limit suspected they did—they might have already deduced the truth. The attack hadn't come from Emperor Juander. It had come from Empress Marie's faction. If Grid's people had figured that out, they could exploit the growing rift in the imperial court.\n\n\"A dangerous opponent indeed.\"\n\nHis gambit to use the Overgeared Kingdom as a blade against the emperor had failed before it began. Limit glanced meaningfully at Mercedes. Time to go.\n\nMercedes exhaled as the office door closed behind her, relief warring with dread. \n\n*The captain sees His Majesty as an enemy. No question about it.*\n\nEver since her meetings with Piaro and Asmophel—since learning the truth about what happened twelve years ago—she'd been watching Sword Duke Limit. Investigating him. Trying to determine how deep his involvement ran in that tragedy.\n\nBut investigating a duke proved nearly impossible. Every avenue she pursued led to obstruction. And the worst interference came from an unexpected source.\n\n\"Sir Mercedes.\"\n\nHer spine stiffened. \"Sir Gyuratan.\"\n\nThe Fourth Knight's role within the Red Knights was unique. While others served as the empire's sword, Gyuratan served as the order's conscience—defending them from external threats, yes, but also watching them from within. Ensuring the Red Knights' principles remained uncorrupted.\n\nTwelve years ago, Gyuratan had branded Piaro a traitor.\n\nMercedes had never trusted him, not from the beginning. But now, armed with what Asmophel had revealed about Gyuratan's true allegiance to the Yatan Church, distrust had crystallized into cold hatred.\n\nShe smiled. Controlled. Professional. A swordsman's first lesson: never let emotion show on your face.\n\n\"It's been too long, Sir Gyuratan.\"\n\n\"I've been investigating.\" His tone carried false warmth. \"Looking into the deaths of Third Knight Lorex and Fifth Knight Dia.\"\n\nMercedes said nothing. Lorex and Dia—both fallen to the Undefeated King's heir. Both had failed to apprehend Piaro during his escape. When she'd met Piaro last week, she'd thought of them constantly.\n\n*If they were still alive... if they knew what really happened...*\n\nThey would have wept with equal parts joy and grief. They would have been powerful allies. She was mourning comrades she'd never see again when Gyuratan's voice cut through her thoughts.\n\n\"During my investigation, I came across something interesting. You were in Valhalla recently, weren't you?\"\n\nHer blood went cold. \"I—\"\n\n\"Seeking vengeance for our fallen knights? Hunting the Undefeated King's descendant?\"\n\n\"...Yes.\" The lie came easily.\n\n\"And the outcome?\"\n\n\"I failed. Couldn't find the bastard.\"\n\nIt wasn't entirely false. Mercedes had fought the heir face-to-face in Lubana—she knew his fighting style intimately. Yet despite two months infiltrating Valhalla, she'd found no one matching his profile.\n\n\"So you violated a direct order and accomplished nothing.\" Gyuratan tsked softly. \"If you'd succeeded, I might have argued for clemency before His Majesty. As it stands...\"\n\n\"What do you want?\"\n\n\"Want? Nothing. I'm simply doing my duty.\" His smile was poisonous. \"Should I report to the emperor that his First Knight defied his commands?\"\n\n\"You son of—\"\n\n\"Remember your position, Mercedes. The First Knight must be above reproach—an inspiration to every imperial warrior. Yet you abandoned your post to pursue a personal vendetta. I can't overlook that.\"\n\nShe wanted to drive her blade through his throat.\n\n\"Next time you receive an order, follow it. First Knight or not, His Majesty won't tolerate another transgression.\"\n\n*Of all the times for this to surface...* \n\nMercedes forced herself to think past the rage. This wasn't coincidence. The timing was too perfect.\n\n*He's known all along. Buried it deliberately until the moment he needed leverage.*\n\nThe realization struck like a blade between the ribs. Gyuratan knew she'd started digging into the events of twelve years ago. This was his warning shot.\n\nShe couldn't hide her hatred anymore. Her eyes burned as she glared at him.\n\nGyuratan merely shrugged, his grin widening. \"Don't worry about the Red Knights during your... sabbatical. Sir Lucas and I will manage things beautifully. Oh, wait—Lucas is imprisoned? I suppose I'll handle it alone.\"\n\nEvery fiber of her being screamed to attack. To end him right here. But she couldn't—not yet. Not until she'd uncovered the full truth and dragged it into the light for all to see.\n\n***\n\n\"Let's establish the hierarchy.\"\n\nIn Reinhardt, the Overgeared Kingdom's capital, Lauel stood before a blackboard covered in names and arrows. At the apex, he'd written: *Garam (Yangban)*.\n\n\"Based on Your Majesty's assessment: yangbans occupy the highest tier. Below them, the seven imperial dukes. First Knight Mercedes ranks in the lower advanced bracket, roughly equivalent to Piaro's raw stats. Asmophel sits at intermediate. You and Kraugel fall somewhere beneath that. Accurate?\"\n\n\"More or less.\"\n\n\"And Piaro? You said he's on par with the dukes.\"\n\n\"In terms of pure level, he should be lower advanced like Mercedes—she matched him move for move. But factor in Fated to Perish...\" Grid paused, considering. \"Most named NPCs can resist the technique, but even resisted, it deals catastrophic damage. With that in his arsenal, Piaro belongs in the duke tier.\"\n\n\"Which still puts him below the yangbans.\" Lauel studied the board grimly. Understanding the world's power structure wasn't academic—it was survival. \"One question: if Garam was that strong, how did you escape?\"\n\n\"Told you already. Caught him off-guard, God's Command triggered, let me chain Linked Kill Wave Pinnacle twice.\"\n\nLauel erased Grid's name from the bottom of the chart. Then he wrote it again—between the yangbans and the imperial dukes.\n\n\"This is where you actually stand.\"\n\n\"...\"\n\n\"Your Majesty.\" Lauel met Grid's skeptical stare head-on. \"It's good to be cautious. But don't mistake caution for cowardice.\"\n\n\"I'm being realistic. Thinking strategically, like you always tell me to.\"\n\n\"Except your thinking is flawed because you're not that smart. No offense.\"\n\n\"...\"\n\n\"You're far stronger than you're giving yourself credit for.\" Conviction rang in Lauel's voice. \"Listen carefully: level up obsessively. Stay ahead of the named NPCs. Equip yourself with your own masterwork gear.\"\n\n\"You know how fast named NPCs level, right? They scale with average player levels—it's a system mechanic. No player can match their growth rate.\"\n\n\"Most players, yes. Not you.\" Lauel leaned forward. \"Your leveling speed is absurd. Named NPCs rise proportionally to the player base average—but you level far faster than average. Do the math.\"\n\nGrid opened his mouth. Closed it.\n\n\"Starting today, set up infinite grinding loops. God Hands, Noe, Randy, the Overgeared Skeletons—use them all. Especially those skeletons. How long are you going to let them gather dust? If I had them, they'd be death knights by now.\"\n\nThe criticism stung because it was accurate. Grid had been neglecting level progression, too focused on crafting. And the skeletons... yeah, he'd completely wasted their potential. \n\nHe still wanted to punch Lauel.\n\n\"One more thing,\" Lauel continued, oblivious to Grid's darkening expression. \"Think during combat. Constantly. Even in the worst situations.\"\n\nTrain yourself to strategize in the heat of battle, Lauel explained. Make it instinct.\n\n\"Do that, and you'll surpass any genius.\"\n\n\"I've got a thick skull,\" Grid muttered. \"Thinking while fighting doesn't come naturally.\"\n\n\"Real rocks don't think at all, so calling you thick-skulled is technically—wait, I'm sorry.\"\n\n\"Can I hit you? Just once?\"\n\n\"Please don't kill me!\"\n\nLauel regretted his poor word choice, acutely aware that one blow from Grid would be lethal.\n\n***\n\nTwo weeks after the 3rd National Competition, the promised rewards materialized.\n\n[3rd National Competition Medal Reward]\n\nGrid's gift box contained exactly what he'd requested: production materials.\n\n[You have acquired Blue Dragon's Breath.]\n\n[You have acquired White Tiger's Breath.]\n\n[You have acquired Black Tortoise's Breath.]\n\n\"Perfect.\"\n\nThree medals—Battlefield plus two golds—converted into three divine materials. Grid grinned, already envisioning the possibilities. A new myth-rated creation wasn't just possible—it was inevitable.\n\n**[Blue Dragon's Breath]**  \n*Contains the Blue Dragon's blessing.*  \n*Lightning Resistance +30%*  \n*Can be fused with items possessing strong lightning affinity.*  \nWeight: 2\n\n**[White Tiger's Breath]**  \n*Contains the White Tiger's blessing.*  \n*Earth Resistance +30%*  \n*Can be fused with items possessing strong earth affinity.*  \nWeight: 2\n\n**[Black Tortoise's Breath]**  \n*Contains the Black Tortoise's blessing.*  \n*Water Resistance +30%*  \n*Can be fused with items possessing strong water affinity.*  \nWeight: 2\n\n\"Excellent.\"\n\nGrid rolled the three beads across his palm—blue, white, and black, each thrumming with elemental power. Just as he'd enhanced the Red Phoenix's Breath, he could strengthen these. Upgrade them. Transform them into something extraordinary.\n\n*Time to get stronger. Right now.*\n\nHe reached for his hammer, eyes blazing with determination, when a voice interrupted.\n\n\"Grid. Honor your promise.\"\n\nHe nearly dropped the hammer. \"...You?\"\n\nKraugel stood in the doorway, his normally stoic expression replaced by something almost eager.\n\n\"Make me a sword.\"\n\n\"Y-Yeah, of course...\"\n\nHad Kraugel been camping in Reinhardt, waiting for the rewards to arrive? The Sword Saint's timing was suspiciously perfect.\n\n*Didn't know he had an impatient side.*\n\nGrid hid his smile as Kraugel continued.\n\n\"I found an excellent hunting ground recently. I'll share the location if you're interested.\"\n\n\"Oh, thanks...\"\n\n\"Fair warning: you'll need to rest ten minutes between kills.\"\n\nGrid's eyebrows rose. *What kind of monsters require that much recovery time?*\n\nAnticipation and apprehension warred in his chest.\n\n\"Also,\" Kraugel added casually, \"I eliminated fifty-two Immortal members while staying in Titan. Would that cover the cost of armor and boots as well?\"\n\n\"F-Fifty-two?\"\n\n\"I can show you screenshots if you need proof.\"\n\n\"...\"\n\nSky above the sky indeed. For Kraugel, the impossible was routine.\n\nGrid accepted the materials—two breaths and a small ingot of adamantium—and moved toward his forge. As he kindled the flames, Kraugel watched with an expression Grid had never seen before: something almost gentle.\n\n*He's healing,* Kraugel thought. *Good.*"
}