{
  "id": 795,
  "title": "Chapter 795",
  "content": "# Chapter: A Token of Friendship\n\n> **[Still Crouching White Tiger Sword]**\n> \n> **Rating:** Normal (Growth)  \n> **Durability:** 390/390  \n> **Attack Power:** 373  \n> **Defense:** 31\n> \n> * 10% reduction in attack speed.\n> * 3% increase in physical attack power.\n> * 3% increase in defense.\n> * 3% increase in magic resistance.\n> * 6% increase in maximum health.\n> * 8% bonus earth attribute damage.\n> * Low probability of sword weight increasing during attack. When activated, grants 33% physical attack power that ignores target's defense. Recovery speed reduced by one second.\n> \n> *A sword destined to transcend even legend and reach myth...*\n> \n> *[Further details omitted]*\n\nOne of two swords forged by Grid's hand. Thanks to Yura's steady hunting expeditions in hell, she'd gathered enough bloodstones to supply the guild warehouse with legendary-grade materials. Combined with the enhanced White Tiger's Breath woven into its core, the blade transcended its Normal rating in every practical sense. Growth-type items already boasted superior base performance compared to fixed-grade equipment—this one pushed those boundaries even further.\n\nStill, it paled against Grid's myth-rated masterpiece.\n\nKraugel's jaw tightened as he absorbed the item information. His silence stretched long enough to make most people uncomfortable.\n\nBut Grid understood. \"Moved to silence, are we?\"\n\nSomeone ignorant of growth-type items' true value might have called Grid greedy—keeping the superior weapon for himself while pawning off the \"lesser\" one. Kraugel knew better.\n\nEvery rating increase transformed a growth-type weapon fundamentally. New options emerged, existing ones strengthened dramatically, and—crucially—the weapon evolved according to its wielder's unique characteristics. The lower the starting rating, the greater the potential ceiling. Normal to Rare. Rare to Epic. Epic to Unique. Unique to Legendary. Legendary to Myth.\n\nEventually, this White Tiger Sword would eclipse Grid's current myth-rated version entirely.\n\n\"Can I...\" Kraugel's voice cracked. \"Can I truly accept this?\"\n\nGrid's smile was genuine. \"I forged it for you in the first place.\"\n\n\"But this is growth-type. Grid, you should—\"\n\n\"I know what you're thinking.\" Grid cut him off gently. \"Long-term, this would serve me better. But you know my fighting style—I constantly swap between weapons. How could I possibly dedicate enough time to raise this to myth rating?\"\n\nHis Tiramet's Belt, Elfin Stone's Ring, and God Hands remained stuck at Unique for *years*. Raising a Normal-rated item to Myth would consume at least a decade of Satisfy time. And that was his timeline. Unlike Grid, who juggled a dozen legendary items, Kraugel could focus his entire progression path on a single weapon. Add the Sword Saint's class bonuses to accelerate growth rates...\n\n\"This is the logical distribution,\" Grid said with finality.\n\nKraugel's response came swift and fierce. \"Then I promise—the moment this sword reaches myth rating, I'll return it. We'll trade. You can have the perfected version, and I'll take your current one.\"\n\nGrid's heart stuttered. The sincerity in those words hit harder than any attack.\n\n*Damn it.*\n\nHow had he ended up surrounded by people this good? Where did this fortune come from? His eyes burned. Rather than let Kraugel see him tear up, Grid masked emotion with irritation. \"Don't be ridiculous. By the time it reaches myth, it'll have grown into *your* sword—perfectly suited to your techniques, your style. Just be grateful and shut up.\"\n\n\"...You won't regret this?\"\n\n\"Are you planning to make me regret it?\"\n\n\"Never.\"\n\n\"Then that's settled. More than enough.\" Grid understood Kraugel's true worth. The future Sword God? Earning his friend's loyalty and trust was worth twenty legendary swords, much less one. \"Let this blade stand as proof of our friendship. Forever.\"\n\n\"Forever...\" The smile that transformed Kraugel's face belonged to someone experiencing joy so profound, he could count similar moments on one hand.\n\nGrid felt the same. Two people who'd walked alone—one because he had too little, one because he stood too far ahead—now faced each other as equals.\n\n***\n\n*Time to field-test the Pulling Device.*\n\nGrid had an obligation to master the equipment he'd poured so much effort into creating. Anything that could shave milliseconds off his weapon-swap time demanded thorough practice. Moving forward, he planned to craft weapons in \"blade-only\" form, similar to the Enlightenment Sword.\n\nHe'd forged the White Tiger Sword as a complete weapon purely for Kraugel's sake—the Sword Saint's insights had shaped every design choice, resulting in a blade with unmatched versatility.\n\nThe results spoke for themselves. While it lacked the Enlightenment Sword's raw aggression, its overall balance was superior. That defense stat especially caught his attention: 724 base defense. Equivalent to wearing high-grade plate armor. Nearly matching the Holy Light Armor he'd relied on alongside Triple Layers for nine years of game time.\n\n*That knuckle bow is the key.*\n\nGrid studied the crown-shaped guard at the blade's base, its elegant red velvet cushioning blending seamlessly with the transparent steel. Beautiful craftsmanship—and the source of the sword's defensive prowess.\n\n*Problem is, I designed it with a traditional handle. To integrate it with the Pulling Device properly, I'll need to remove the grip entirely. There goes most of that defense bonus.*\n\nTrade-offs. Connecting the blade to Sword Ghost's handle via the Pulling Device would sacrifice defense for a substantial attack power increase—transforming it into pure offense.\n\n*The ideal solution...*\n\nIntegrate the knuckle bow directly into the blade structure rather than the handle. That way, even when equipped via Pulling Device, it would maintain defensive properties while gaining offensive synergy.\n\n*But my current skill level can't handle it.*\n\nFusing the knuckle bow with the blade would require perfect balance calculations. One miscalibration and the entire weapon would collapse—might even lose its myth rating entirely.\n\n*Two more blacksmithing levels, maybe. A few years of constant work.*\n\nHis head felt stuffed with cotton. Ten days of non-stop crafting had pushed him past his limit. Time to stop forcing solutions that wouldn't come.\n\n\"Dear husband!\"\n\nIrene's voice cut through his mental fog. The national mother, role model to hundreds of thousands—a woman whose kindness inspired countless others to better themselves—became a shy girl whenever Grid entered the room. Still chasing her first love after all these years.\n\n\"I heard the forging session was brutal.\" Her embrace was fierce, desperate. She'd witnessed Grid's grief after Khan's death, knew exactly how he pushed himself when hurting.\n\nGrid cupped her cheek, thumb brushing soft skin. \"I'm fine. Health and safety first—you know that's my rule.\"\n\nEven someone as pure-hearted as Irene could spot a lie that blatant. She'd watched Grid build a family, fight beside comrades, forge a kingdom and defend it against all threats. Overwork was his natural state.\n\n\"No.\" Her hands found his hips, her gaze rising to meet his. Those large, gentle eyes tried for sternness and achieved something closer to \"adorable rabbit.\" Grid bit back a smile.\n\n\"I won't budge. Bedroom. Rest. Now.\"\n\n\"Yes, ma'am. Let's get some proper sleep.\"\n\nGrid genuinely intended to rest—his stamina gauge was scraping empty, his nerves frayed. But relaxation proved impossible once they reached the bedroom.\n\nIrene began massaging the tension from his legs, working with practiced care to ease the fatigue. And she was wearing *that underwear*—the vampire-crafted piece Grid had saved for... well. The sheer fabric revealed more than it concealed, and her touch sent electricity through his exhausted muscles. Every brush of her fingers. Every press of her lips against his skin. The detailed explanation will be omitted, but suffice to say...\n\n\"Irene, I can't—\"\n\n\"What do you need?\"\n\n\"*Irene!*\"\n\nThe detailed description of Grid's hands exploring his wife's curves will be omitted.\n\n\"Irene, I love you!\"\n\n\"Ah! Dear husband!\"\n\nAs the bedroom air grew thick with heat, the two became thoroughly entangled. Further descriptions are omitted for everyone's dignity.\n\n***\n\n\"Wonder if I'm getting a little brother or sister?\"\n\nLord's voice carried through the door, bright with innocent amusement. The prince seemed genuinely pleased his parents' love remained so vibrant.\n\nChucksley cleared his throat—a pointed sound from the middle-aged knight assigned to guard the royal family. \"Your Highness, eavesdropping is beneath you.\"\n\n\"Oh! Right, my bad.\" Lord's grin turned sheepish. \"I'll come back later. Hehet!\"\n\nThe unflappable Chucksley trusted Lord's maturity. The boy—rapidly becoming a young man—retreated readily enough, wandering into the garden where several beautiful young women immediately surrounded him. Rebecca's Daughters candidates, most of them. In another year or two, they'd be stunning.\n\n\"Prince Lord, are you well?\"\n\n\"I'm great! Though I *would* like a kiss.\"\n\n\"Me first! Chu~!\"\n\n\"Hey, no fair! The prince's right cheek is *mine*!\"\n\nTo outside observers, it might have looked like lonely girls competing for a prince's attention. The reality was considerably more complex.\n\n***\n\nSeveral days later, Grid stood in the palace courtyard, fully equipped for travel.\n\n\"I'll be going now.\"\n\n\"You have everything?\" Lauel's tone carried the patient worry of someone who'd checked the same list three times already.\n\n\"Yes. Stopped by the alchemy facility and grabbed all the supplies.\"\n\n\"Good. I've said this repeatedly, but if things go sideways, use Knights Summoning immediately. The Overgeared members will be on standby twenty-four seven. Understood?\"\n\n\"Understood.\"\n\nGrid accepted Lauel's farewell and slipped out of Reinhardt through a side gate, avoiding the main roads where citizens might recognize him.\n\nHis destination: Titan. The imperial palace."
}