{
  "id": 796,
  "title": "Chapter 796",
  "content": "Mercedes had defied a direct order to travel to Valhalla—a hostile kingdom. This was more than simple insubordination. It represented a fundamental breach of trust, a clear signal that the First Knight had lost faith in her emperor. When combined with her unauthorized visit to an enemy nation, it bordered on outright treason.\n\nGyuratan's report painted the situation in the worst possible light, filled with slander and distorted facts. Yet the core truth remained undeniable: the First Knight had traveled to meet with the enemy.\n\n*There must be a reason she went to Valhalla.*\n\nEmperor Juander understood Mercedes' true motivation. She had been hunting for the Undefeated King's descendant, seeking vengeance. The idea that she would actually ally herself with Valhalla was absurd. And yet...\n\n*She still disobeyed my direct command.*\n\nThat bitter reality forced the emperor to question her loyalty. A truly loyal knight would never leave his side under any circumstances—not for any reason.\n\n*Though I suppose I never expected loyalty to begin with.*\n\nThe thought came unbidden. Even Piaro, once his most trusted knight, had betrayed him. These so-called knights were nothing more than jesters playing at honor. Loyalty was merely a convenient mask, easily discarded when it no longer served their purposes.\n\n*But I need to understand why Gyuratan is making his move now.*\n\nThe Fourth Knight had been the one to expose Piaro's betrayal twelve years ago. What was his purpose in monitoring the Red Knights? Why was he now twisting the facts to paint Mercedes as a villain?\n\n*Something dangerous is brewing. I need to neutralize Mercedes before it's too late.*\n\nEmperor Juander made his decision.\n\n\"The First Knight exists to serve the imperial family, yet Mercedes has abandoned that sacred duty by defying my orders.\" His voice rang out with cold authority. \"I hereby strip Mercedes of all her qualifications. She will serve three years of disciplinary confinement.\"\n\nThe pronouncement struck like thunder.\n\nShock rippled through the assembled officials, both great and small. Mercedes? The woman who had united the fractured Red Knights after Piaro's betrayal? The knight who had single-handedly restored stability and maintained their legendary reputation? Her bravery in battle was unmatched, her accomplishments nearly impossible to replicate. Mercedes had become the symbol of a new era for the empire.\n\nAnd now the emperor was discarding her?\n\nThe wave of dismay was palpable.\n\nEven the emperor's most trusted advisors recoiled at the decision.\n\n\"She may operate under the empress' authority, but even so...\" Guard Captain Bain spoke carefully. \"Your Majesty, I don't believe this is wise—even if she *is* the empress' puppet.\"\n\n\"Precisely,\" another duke added. \"There's a vast difference between disciplinary action and complete disqualification.\"\n\n\"You must consider her influence, Your Majesty. The knights may turn against you over this. Perhaps a more measured punishment would be prudent.\"\n\nThe question hung unspoken in the air: if forced to choose between Duke Limit and First Knight Mercedes, whom would the Red Knights follow? The answer was obvious—most would rally behind Mercedes. She commanded their respect in a way few others could match.\n\nThe emperor's decision made no strategic sense.\n\n\"Hmm...\" Even with his closest advisors opposing him, Juander remained outwardly calm, though frustration simmered beneath the surface. His thick fingers drummed against the table in an irregular pattern.\n\nThen—\n\n*CRACK!*\n\nAn ominous sound echoed from above.\n\n\"...!\"\n\nEvery head in the emperor's office snapped upward—Juander, the dukes, all of them staring at the ceiling.\n\n\"Your Majesty!\" Guard Captain Bain exploded into motion. His massive hand shot up and caught the falling chandelier before it could crash onto the table.\n\n\"W-What is this...?\" The color drained from the dukes' faces.\n\nThe chandelier had simply... fallen? Without warning? From the ceiling of the emperor's own office?\n\n*This is a terrible omen!*\n\nThis was the imperial palace's inner sanctum. Every facility was meticulously maintained. There should be no possibility of structural failure. Indeed, examining the chandelier showed no signs of age or wear—if anything, it looked recently installed.\n\nThe dukes read this as a portent of disaster, anxiety crawling up their spines.\n\nBut the emperor's reaction was pure fury.\n\n\"The *empress*...!\" The blood vessels at his temples bulged as realization struck.\n\nThe empress wasn't merely a puppet of the nobles—she was their *leader*. Juander's gaze fixed on the chandelier with sudden, terrible clarity. This had been a gift from Empress Marie, presented just one month ago.\n\n\"Bring Marie before me!\" he roared. \"*Now!*\"\n\n\"At once, Your Majesty!\"\n\nThe gravity of the situation was unmistakable. The dukes, who moments ago had been sitting in comfortable authority, now scrambled from the room. Already, hundreds of guards were assembling in front of the office. Emergency orders rang out across the imperial palace.\n\n\"Seal every exit immediately! I want every door locked—not so much as a mouse leaves this palace!\"\n\n\"Yes, sir!\"\n\n\"Retrieve Empress Marie! This is an imperial command!\"\n\n\"Understood!\"\n\nChaos flooded through the corridors. The empire's political landscape was shifting with catastrophic speed.\n\nAnd then—\n\n\"Your Majesty! Urgent news!\" A messenger burst through the doors, his face pale with shock. \"The southern wall—a section has collapsed!\"\n\n\"*What?*\"\n\nThe walls of Titan had stood impregnable since the empire's founding. Not a single enemy had ever breached them. And now they were simply... crumbling?\n\nIt was unprecedented. Unthinkable.\n\nDeep in the emperor's heart, something began to fracture. Emotional stability gave way to creeping paranoia.\n\n***\n\n\"Your Majesty's beauty knows no equal.\"\n\nWithin the empress' palace, a noblewoman knelt in supplication, her voice dripping with honeyed flattery. She carefully applied polish to Empress Marie's toenails. The sight of a lady from a prestigious family performing such menial labor left the nearby maids deeply uneasy. They understood all too well—witnessing a noble debased like this would eventually result in their own punishment.\n\n\"I only worry that these powdered pearls aren't lovely enough for Your Majesty's feet.\"\n\n\"Don't fuss. They're perfectly adequate.\" Empress Marie smiled benevolently, though her heart swelled with satisfaction. This—*this* was true power. A noble lady reduced to a fawning pet at her feet...\n\n*She's painting my toenails.*\n\nThe intoxicating rush of authority filled her. If this was the power of an empress, she could barely imagine what authority the empress dowager wielded. Marie's ambitions crystallized further. Placing the 4th Prince on the throne was no longer merely a goal—it was destiny.\n\n\"Mmm... hmmm~\" The empress hummed a melody, her voice sweet and pure as an angel's.\n\nBut the noblewoman and the maids knew better. That kind smile and beautiful appearance concealed something far darker. Empress Marie was no angel.\n\n\"Your Majesty!\"\n\n\"...Mmm?\"\n\nThe tranquil moment shattered. The empress stopped humming, her gaze shifting toward the intrusion. Viscount Albert had burst into the chamber, gasping for breath.\n\n\"You must avoid His Majesty. *Now.*\"\n\n\"*What?*\" Anger flashed across Marie's features, overwhelming any confusion. She was the empire's empress, the future mother of an emperor. And now someone was telling *her* to hide? From her own husband?\n\nWhy?\n\nViscount Albert explained quickly, noting the empress' deepening frown. \"Duke Grenhal is en route to this palace—and his mood is foul! He's brought His Majesty's personal guards with him!\"\n\n\"Duke Grenhal...?\"\n\nWhy would the emperor's right hand be coming here? With the imperial guard in tow?\n\nThe empress felt the ground shifting beneath her. \"Find out what's happening. Immediately.\" She rose from her seat, and the maids hurried to help her with her shoes.\n\nBefore leaving the chamber, the empress pointed toward the servants. \"Dispose of them. We must protect the countess' honor.\"\n\n\"E-Empress...!\" The maids' eyes widened in terror.\n\n\"Your Majesty's consideration always moves me deeply.\" The noblewoman bowed with gratitude.\n\n*Another den of lowly filth cleansed.* Viscount Albert bit his lip to hide his thoughts from the empress. Then he drew his sword and cut down all five maids in swift succession.\n\nA knight appeared, breathless. \"Your Majesty—I've learned the cause. The decorative mobile in your bedchamber fell.\"\n\nThe empress' expression froze. \"What caused the failure?\"\n\n\"Unknown. The maids claim the mobile had become larger and heavier than when originally installed.\"\n\n\".....\" Understanding crashed down on Empress Marie like a tidal wave. \"Prepare my carriage. *Immediately.* I must speak with His Majesty.\"\n\nShe needed to explain at once—before this spiraled beyond control.\n\n\"I've already prepared your carriage, Your Majesty.\" Duke Grenhal's voice cut through her thoughts. As always, he sat astride his enormous rhinoceros. The empress disliked the calculation in his gaze, but she couldn't afford to show it. Duke Grenhal commanded the greatest military strength among the seven dukes—he was not someone she could oppose.\n\n\"Thank you for your... consideration.\"\n\n***\n\n\"This is bad.\"\n\nDespite the underlying chaos, the empress' palace maintained a veneer of peaceful normalcy.\n\nThen, in a single afternoon, everything collapsed.\n\nVeradin assessed the situation and concluded that Empress Marie's political position would be catastrophically diminished from this day forward.\n\n*If we don't move now, we'll be caught in the flames.*\n\nImmortal operated under the Rose Knights—Empress Marie's direct command. They needed to be cautious about guilt by association.\n\n*We need a new base of operations.*\n\nVeradin began making preparations. He and Agnus had been residing in the empress' palace for some time now.\n\n*Time to leave this nest.*\n\nIn the worst-case scenario, the empress' patronage would transform from asset to liability. That would make any operation on the West Continent nearly impossible.\n\n*Perhaps the East Continent would offer better opportunities.*\n\nA crisis was also an opportunity. This might be forced timing, but it could open doors to new ventures. Veradin allowed himself a measure of hope, viewing this as primarily Marie's crisis rather than his own.\n\nWhat he failed to consider was just how dangerous the situation truly was. Why?\n\n...Because at least for now, the palace remained the safest location. Leaving it would be a catastrophic mistake. His enemies were far more numerous—and far more prepared—than he imagined.\n\nFor the sake of revenge, they had plunged the continent's greatest empire into chaos.\n\n*Step. Step.*\n\n\".....\"\n\nOne step. A second. A third.\n\nVeradin's pace quickened as he departed the palace. Something felt wrong. The knights and soldiers who normally guarded every corridor were conspicuously absent due to the empress' departure. Then he understood—this was no longer safe ground.\n\nBut enlightenment always arrived too late.\n\n\"What's the rush? Need the toilet?\"\n\n\".....\"\n\nAs Veradin reached the palace entrance, a familiar voice spoke from behind him. He stopped walking.\n\n\"Is this Lauel's doing? Did he orchestrate all of this?\"\n\n\"You're not qualified to ask me questions.\"\n\n\"Are you insane? This is Immortal's base. What do you think you can accomplish by infiltrating it alone? You can't threaten us.\"\n\n\"I'm not here to threaten you. I'm here to kill you. All of you.\"\n\n\"Ha! Planning to use Knights Summoning? The moment Overgeared members are spotted during this chaos, the empire will turn its full might against your kingdom.\"\n\n\"You know what? You're the first.\"\n\n\"Everyone, get out here!\"\n\nVeradin still faced away from Grid. He turned toward the empress' palace entrance and screamed as loudly as he could. \"Grid! It's *Grid!*\"\n\n\"What? Really? Grid is here!\"\n\n\"Everyone out! *Now!*\"\n\nDozens—then hundreds—of necromancers poured from the building. Only when Veradin saw them did he feel his panic subside. Then he turned to face Grid's cold, merciless gaze.\n\n\"The first time,\" Grid repeated.\n\n\"First time for what?\"\n\n\"The first time you'll die by *my* hand.\"\n\n\"...?\"\n\n\"I'm not counting Piaro's kill, you bastard.\"\n\nKhan's murderer stood before him at last. In this moment, Grid wasn't the figure admired by two billion players. He wasn't the Overgeared King representing his people. He was simply Grid—complete, unrestrained, consumed by uncontrollable resentment and killing intent.\n\n*FLASH!*\n\nThe necromancers summoned their skeletal warriors. Death Knight Kyleo and countless skeleton knights surged forward to intercept—\n\n\"Remember this.\" Grid activated Freely Move, materializing at Veradin's side in an instant. The Enlightenment Sword blazed in his grip, empowered by Blacksmith's Rage and Blackening. \"The moment I appear before you, you're already dead.\"\n\n*SLASH!*\n\n\"Guh...!\"\n\n[You have suffered 51,900 damage.]\n\n[35% of your maximum health is preserved due to the effect of Overcoming Death.]\n\nWas that a skill? The devastating blow left Veradin's mind reeling. He stumbled backward, frantically reaching for a potion—\n\n*THUNK!*\n\nLifael's Spear punched through his chest.\n\nDeath Knight Kyleo and the skeleton knights swarmed Grid, their weapons raining down on him. Grid didn't bother blocking. Instead, his armor released waves of poisonous fog. But Veradin's agony came not from poison—it came from the sword and spear embedded in his flesh.\n\n\"Die,\" Grid whispered, his smile reminiscent of darker days when he'd been known as the Slaughterer. \"A hundred times. A thousand times. However many it takes.\"\n\nTwo normal attacks.\n\nThat was all it took.\n\n*BOOM!*\n\nBlack flames erupted outward. Veradin and the surrounding necromancers dissolved into ash."
}