{
  "id": 797,
  "title": "Chapter 797",
  "content": "\"This is impossible!\"\n\nImmortal had studied the National Competition footage obsessively. Every match, every technique, every exploit—catalogued and analyzed. They knew about the instant skill Grid had used to obliterate Tarma in seconds.\n\nBut this? This was different.\n\nVeradin was no ordinary necromancer. He'd transcended the class's fundamental weakness—fragility. When the Overgeared Kingdom had been invaded, he'd outmaneuvered even Faker, surviving an assassin's sustained assault. A man like that didn't die to a single strike.\n\nAnd yet—\n\n'The area of effect...'\n\nThe black flames had consumed everything within ten meters. Dozens of necromancers, vaporized alongside their leader.\n\nHow could an instant skill possess such devastating power and range?\n\n'Is this what a legendary class truly means?'\n\nNervous swallowing echoed across the battlefield. Bullet, the second-ranked necromancer, broke the silence. \"Scatter! Everyone—spread out!\"\n\nDrew, ranked seventh, bellowed over him. \"Don't let that monster escape!\"\n\n\"Move!\"\n\nSurvival instinct conquered fear. The necromancers shook off their paralysis, summoning skeleton knights and mages to screen their retreat. Some didn't bother with tactics—they simply ran.\n\nThose were Grid's first targets.\n\n\"Where do you think you're going?\"\n\nThis wasn't battle. It was extermination. Grid had learned long ago: some enemies could never be allowed to regroup.\n\n\"Transcend.\"\n\nThe skill activated with a low rumble. Grid's black hair rose as if caught in an updraft. Fragments of shattered stone lifted from the ground, suspended by invisible force—the precursor to ranged combat.\n\n*Whoosh!*\n\n*BOOM-BOOM-BOOM-BOOM-BOOM-BOOM!*\n\nBlackening pushed Grid to his absolute limits. Six sword strikes per second. Six energy blades launched across the battlefield. He wasn't a man anymore—he was a weapon given human form.\n\n\"AAGH!\"\n\n\"Gkk—!\"\n\nEnergy swords carved through retreating backs. The necromancers' pathetic defenses crumpled like paper. Most died instantly. The survivors stood frozen, stunned, having lost over half their health to a single blow.\n\n\"Lubaan!\" Bullet's scream tore across the battlefield.\n\nDeath Knight Lubaan responded, his massive halberd streaking toward Grid's exposed flank.\n\n*CRASH!*\n\nThe orc fighter's weapon—over two meters of enchanted steel—caught Grid mid-strike, slamming into his shoulder.\n\n'Got him,' Bullet thought. Lubaan's attack power surpassed even Death Knight Kyleo's. No way Grid could shrug off a critical hit like that.\n\n*CLANG!*\n\nThe notification made Bullet's blood run cold.\n\n[You have dealt 2,430 damage to the target!]\n\n[Poisonous fog has activated!]\n\n[Death Knight Lubaan is poisoned.]\n\n\"...What kind of bullshit is this?\"\n\nThe armor poisoned attackers instead of defending? \n\n'This makes no sense.'\n\nBullet had watched Grid fight the dragon. The man had died easily to a single breath attack, just like Kraugel. In the PvP finals, Kraugel had torn through him. Yes, Grid's equipment was exceptional, but his defenses seemed ordinary—\n\nThe second-ranked necromancer had believed himself capable of threatening Grid, just as the National Competition rankers had.\n\nWhat arrogance. What a shameful miscalculation.\n\n'I'm a frog at the bottom of a well.'\n\nThey existed in completely different dimensions of power. As reality crashed down on Bullet, he stood paralyzed.\n\n[Death Knight Lubaan has returned to the earth.]\n\nWatching his most powerful summon crumble beneath Grid's assault, Bullet shouted, \"Corpse Explosion! It's our only chance!\"\n\nHope flared among the necromancers. Corpse Explosion—a spell that dealt damage proportional to the target's maximum health by detonating summoned undead. The drawback was severe: destroyed undead required significant time to resummon. But the power was undeniable.\n\nFacing a prolonged battle with Grid was suicide. They began detonating their minions.\n\n*KABOOM!*\n\n[You have suffered 4,900 damage.]\n\nAs undead exploded around Grid—\n\n\"Yes!\" the necromancers roared.\n\nFor the first time, Grid coughed blood. Hundreds of walking bombs converged on his position. A scene from a nightmare made real.\n\n\"Grid! Pay for your arrogance!\"\n\nIndividual power had limits. Immortal sneered at Grid's foolishness—coming here alone. Dozens of ghouls closed the distance and detonated simultaneously.\n\n*BOOM!*\n\n*BOOM-BOOM-BOOM-BOOM!*\n\nThe empress's palace shook from the cascading explosions. But when the dust cleared—\n\n\"What...?\"\n\nGrid stood unharmed. Kruger's Mysterious Cloth had absorbed the blast. He emerged from the smoke without a scratch.\n\n*Thwk!*\n\n\"Gkh!\"\n\n*Crunch!*\n\n\"AAGH!\"\n\nBlackening amplified Grid's agility beyond what the necromancers could track. He flashed across the battlefield like a phantom, and bodies fell in his wake.\n\n\"H-How are you fine? No!\" Drew shrieked, summoning more undead. Then he noticed two peculiar skeletons approaching. He'd assumed they belonged to his allies—until they stabbed him.\n\nThese skeletons were different. They had *expressions*.\n\nBullet stared in confusion at the skeletons' cheerful '⌓ ⌓' eyes.\n\n\"What the hell are these things?\"\n\nThe damage was negligible—barely 100 points. But something felt wrong. Undead with facial expressions? He'd never encountered such a thing. Even liches, the apex of undead evolution, remained expressionless.\n\n'Could these be—'\n\nUltra-rare summons?\n\n'Who controls them?'\n\nBullet read the names hovering above their skulls: *Overgeared Skeleton One* and *Overgeared Skeleton Two*. The naming convention made ownership obvious.\n\n\"G-Grid summoned them?\"\n\nA blacksmith commanding undead? How was that possible? As the question formed—\n\n*Thunk!*\n\n\"Gkk...!\"\n\nBlood filled his mouth. While he'd been distracted by the skeletons, Grid had closed the distance and stabbed him through the heart.\n\n\"W-Wait—\"\n\nOne strike. Ten percent health remaining. Bullet forced words past his lips. \"S-Spare me...! Please! I never invaded the Overgeared Kingdom! Veradin's faction forced this! I'm a victim!\"\n\nThe human mind broke easily under pressure. Bullet counted on Grid's hesitation—any moment of doubt.\n\nGrid's response was ice.\n\n\"You could have stopped it.\"\n\nHis blade moved. Bullet shattered into gray light.\n\nThe sight broke the remaining necromancers completely. They finally understood true fear—the kind that followed you after logout, that haunted you until you abandoned the game entirely.\n\nHaving delivered his message, Grid equipped the Hooded Zip Up. Soldiers were converging on the explosions. He couldn't afford delays.\n\n'Shame about Agnus.'\n\nBut revealing his identity here would be catastrophic. The empire's fury would crash down on the Overgeared Kingdom.\n\n'Time to leave.'\n\nThe north gate made the most sense—opposite the collapsed southern wall, where security would be thinnest.\n\n***\n\nNorthern Titan sprawled with mansions and villas housing the empire's nobility.\n\nFirst Knight Mercedes' estate stood among them.\n\n\"Who dares strike at the empire...?\"\n\nMercedes received word of the southern wall's collapse and immediately reached for her sword. She moved to don the Red Armor—then hesitated, leaving her chambers in a simple dress instead. \n\nOutside, she found Red Knights assembled in her garden. Fourth Knight Gyuratan and his retinue.\n\nGyuratan's smile was thin. \"Disobeying another imperial order... The rumors must be true.\"\n\n\"What rumors?\"\n\n\"That you've lost respect for the emperor. That you're planning rebellion.\"\n\n\"Baseless accusations.\"\n\n\"Any rational person would suspect you. The wall collapses the moment His Majesty moves to strip your rank? Clearly your supporters created this chaos.\"\n\n\"No one will believe that.\"\n\n\"They'll be *made* to believe it. Why else would you leave your mansion during such turmoil? I wonder what punishment awaits a traitor.\"\n\n\"...This conversation is pointless.\" Mercedes' expression shifted. \"You're framing me. Just as you framed Piaro twelve years ago.\"\n\n\"Speaking a traitor's name—clear evidence of your guilt.\" Gyuratan's smile widened grotesquely. \"First Knight Mercedes, I sentence you to death.\"\n\nOn his command, five Red Knights attacked.\n\n*Swish!*\n\nMercedes spun in her white dress, twin swords clearing their sheaths with liquid grace. Her rotation carved through the garden's flowers and trees. Blood misted from the knights' chests.\n\nGyuratan clicked his tongue. \"Knights in their twenties aren't enough.\"\n\nUseless.\n\n\"They're no different from the Red Knights squad I butchered.\" As those chilling words left his mouth, Mercedes flew at him like a white butterfly. Gyuratan noted her exposed thighs with clinical detachment. Sexual desire was for lesser creatures—humans and animals.\n\n*CRACK-CRACK-CRACK-CRACK!*\n\nBefore Mercedes' dual blades could connect—\n\n\"Ah!\"\n\nBlack magic exploded outward. The unexpected counterattack forced Mercedes to cross her swords defensively.\n\n*CRASH!*\n\nBut two swords couldn't deflect magic. Without her armor, she was too vulnerable. Mercedes rocketed backward, slamming into her mansion's wall. Blood poured from multiple wounds.\n\nGyuratan approached slowly. Corruption rippled across his skin—pale flesh, eyes gone entirely black.\n\n\"For twelve years, your eyes have irritated me. Those clear eyes that see through every secret, every lie. I've wanted to gouge them out every time we met. Wanted to watch you suffer.\"\n\n\"Haa... haa... You...\"\n\n\"But Limit trusted you implicitly. No gaps to exploit. Then you stupidly started investigating him.\" Gyuratan extended a withered hand, fingernails elongated into claws. \"Thank you for digging your own grave. Watch from the afterlife. Scream in agony as the empire you wanted to protect burns.\"\n\n\"Ngh...!\" Mercedes' body refused to respond. The demonic corruption was more lethal than any poison, strangling her heart from within.\n\nAs death approached—\n\n\"That woman is mine.\"\n\n*Thunk!*\n\n*THUNK!*\n\nA golden spear wreathed in divine power lanced through the air, skewering Gyuratan.\n\n\"The Overgeared King...?\" Gyuratan staggered, corruption barely holding against Rebecca's blessing. Meanwhile, Mercedes recalled a fairy tale from childhood—the one about heroes arriving at the darkest hour."
}