{
  "id": 798,
  "title": "Chapter 798",
  "content": "**[You have been discovered by a magic power detector!]**\n\n**[The effect of the Hooded Zip Up has been rendered ineffective. Stealth has been deactivated.]**\n\n**[Warning: Any actions deemed dangerous within the next three minutes will result in immediate retaliation.]**\n\nThe system messages flared across Grid's vision—not for the first time since entering Titan. His stealth cloak shimmered and faded, leaving him exposed in plain white fabric. \n\n*So much for staying hidden.*\n\nHe'd seen these detectors everywhere: not just in the palace, but in ordinary shops, even the slums. The technological saturation was staggering. It painted a vivid picture of the empire that had ruled the continent for centuries—wealth beyond measure, surveillance beyond escape.\n\n*I need to get out of here. Now.*\n\nGrid suppressed his instinct to run and forced himself to walk. He kept his face uncovered, his ID visible. In a game with two billion players, \"Grid\" was hardly a unique name. Hiding would only make him conspicuous. Better to blend into the crowd, just another traveler on the street.\n\nThe north district was quieter than the rest of the city—most people were congregated at the southern wall. Grid moved through the emptier streets without incident, tension coiled tight in his chest.\n\nThen—\n\n**KWAANG!**\n\nThe sharp crack of combat shattered the silence.\n\nGrid froze, muscles tensing. He knew that sound intimately—metal on metal, magic meeting flesh. Somewhere ahead, a fight was unfolding.\n\n*Not my problem.*\n\nHe needed to escape Titan, not get tangled in someone else's battle. But even as the thought formed, his gaze snagged on something in the distance.\n\nA golden exclamation mark, glowing bright above the chaos.\n\nA quest marker.\n\n*You've got to be kidding me.*\n\nWho in the empire could possibly offer him a quest right now? In the middle of this disaster? Grid's mind raced through possibilities, searching for connections, for anyone who might—\n\n\"Mercedes.\"\n\nThe name came like a thunderclap.\n\nThe First Knight. The woman who'd confided in him about the truth from twelve years ago—the truth she was risking everything to uncover. If she'd been discovered, if they'd connected her to him—\n\n\"Quick Movements!\"\n\nGrid didn't hesitate. His body blurred with enhanced speed as he sprinted toward the sound of fighting. Blackening was still on cooldown, but Quick Movements would have to do. He tore through the empty street, rounding the corner at full speed—\n\nAnd stopped cold.\n\n\"Thank you for digging your own grave,\" a voice hissed. \"Watch from limbo. Scream in pain and sorrow as the empire you tried so desperately to protect crumbles to ash.\"\n\nA man stood over Mercedes. His skin was corpse-pale, his eyes solid black—a more twisted, grotesque version of Grid's own Blackening form. Mercedes knelt before him in a white dress, coughing black blood onto the cobblestones. Her iconic red armor was nowhere to be seen.\n\n**[A new quest has been created!]**\n\n**[For Piaro]**\n\n**★ Hidden Quest ★**\n\n*First Knight Mercedes has uncovered dangerous truths. Now, those truths have found her.*\n\n*If she dies here, Piaro will remain branded a traitor forever.*\n\n**Objective:** Keep Mercedes alive.\n\n**Reward:** Affinity with Mercedes +50. Special event unlocked.\n\n**Failure:** Mercedes' death. All Red Knights storylines permanently deleted.\n\nGrid's jaw clenched. *Why is she in trouble? She's supposed to be as strong as Piaro.*\n\nBut he knew the answer, even as frustration flared hot in his chest. This was Satisfy. The moment an NPC became an ally, they became vulnerable. The moment their story intersected with yours, the game found a way to put them in danger.\n\n*Doesn't matter. I'm not letting her die here.*\n\nGrid raised his hand. One of his four God Hands shimmered, metal flowing like water, reshaping itself into the gleaming form of Lifael's Spear. Three remained—he'd only used one against Immortal, leaving the rest available.\n\nMercedes swayed, blood staining her lips. The pale man raised his twisted blade.\n\n\"That woman is mine!\" Grid roared.\n\nThe divine spear flew.\n\n**Puoook!**\n\n**[You have dealt 26,900 damage to the target!]**\n\nThe man—Gyuratan, according to the floating nameplate—staggered back, blood erupting from his side. The massive damage from Lifael's Spear confirmed what Grid already suspected: demonkin. And demonkin were helpless before Rebecca's divine weapons.\n\n*Good. That should keep him down long enough to—*\n\n\"Overgeared King?\"\n\nGyuratan pulled the spear from his waist with one smooth motion. No grimace. No struggle. His health bar barely showed a dent.\n\n*Transcendent named.*\n\nIce flooded Grid's veins. He was already too close—nearly at Mercedes' side, which meant nearly within Gyuratan's reach.\n\n\"Mercedes! You conspired with the Overgeared King!\" Gyuratan's voice rose with vindictive glee. \"Your betrayal is proven!\"\n\nHe thrust forward with his twisted blade, aiming straight for Grid's heart—\n\n**KWAAAAANG!**\n\nTwo golden hands intercepted the strike, metal shrieking against metal. Gyuratan's eyes widened.\n\n*Autonomous artifacts?*\n\nThe realization flickered across his pale face. Before he could process it, the God Hand equipped with Mjolnir swung in from his blind side. Behind him, Lifael's Spear—dropped but not defeated—launched itself at his back.\n\nGyuratan allowed both hits to land. His body jerked from the impacts, stiffening for a fraction of a second. Then he ripped the divine spear from his chest and held it fast.\n\n**Kwajijik!**\n\nRed lightning crashed down from the sky, arcing through Gyuratan's frame. He barely flinched.\n\n\"I see now,\" he said slowly, smile spreading across his pallid features. \"Overgeared King. Templar. Or rather... Overgeared.\"\n\nHis black eyes gleamed with recognition. \"For years, Yatan's servants have fallen across the continent. You're the one responsible. A man with artifacts that fight on their own.\"\n\n\"Kukuk... You're no ordinary mortal. You built a kingdom. Killed the servants. Yes, it makes sense now.\"\n\n\"Who are you?\" Grid demanded.\n\nVery few people knew he was the Yatan Servant Slaughterer. Braham and Yura—that was it. Yet this demonkin had identified him instantly. Which meant—\n\n\"Are you a Yatan Servant too?\"\n\nGyuratan's smile widened. \"You could say that. All creatures under heaven serve God Yatan.\"\n\nGrid's eyes narrowed. *Not the answer I wanted.*\n\n\"Be careful!\" Mercedes gasped behind him. \"He's casting—he'll use black magic!\"\n\n\"What—\"\n\nBut Gyuratan was already moving. His free hand swept through the air, and beneath Grid's feet, a magic circle blazed to life. \n\n*Damn it—*\n\n\"How naive,\" Gyuratan sneered.\n\n**KUWAAAAAAH!**\n\nHellfire erupted from below, a pillar of black flames that swallowed Grid and Mercedes both. The heat was immense—Grid recognized it immediately. It reminded him of Hell Gao before the fire stones were mined. Raw, unfiltered infernal power.\n\n\"My lucky day,\" Gyuratan said, satisfaction dripping from every word. \"Two problems solved at once.\"\n\nHe watched the flames consume them, already shifting form. His pale skin flushed with color, the pure black of his eyes receding to reveal human whites. Back to his disguise. *How should I spin this to the Emperor?* \n\nThen—\n\n\"What is your weakness?\"\n\nThe voice cut through the roaring flames.\n\n\"—?!\"\n\nThrough the smoke and fire, Grid emerged. Mercedes was cradled in his arms, completely unscathed. Grid had taken the brunt of the explosion—used his body as her shield. \n\nBut that wasn't the impossible part.\n\n\"Why are you fine?\" Gyuratan breathed.\n\nGrid's armor was scorched but intact. His health bar had barely moved. He'd tanked hellfire head-on and walked away.\n\n\"Don't you know why they call me the Overgeared King?\"\n\nGrid's sword flashed.\n\n**Puoook!**\n\nGyuratan, still reeling from shock, failed to guard. The Enlightenment Sword plunged through his chest, piercing clean through to his heart. The weapon blazed with power—divine-level damage rivaling even Lifael's Spear.\n\n\"Cough!\"\n\nBlood sprayed from Gyuratan's lips. In his hand, Lifael's Spear lost its shape—Item Transformation's duration expired, and it reverted to a God Hand. The golden construct struggled to break free.\n\nGyuratan gripped it tight.\n\n**Kwajijik!**\n\nLightning lanced down from the heavens, red and violent. Gyuratan's body convulsed. Grid moved.\n\n\"Linked Kill Wave Pinnacle!\"\n\n**Puok!**\n\nThe first strike landed.\n\n**Puk puk puk puk!**\n\nThe rest followed in rapid succession—a storm of thrusts that tore through Gyuratan's defenses. Each stab triggered an explosion of black flames, their destructive power matching Gyuratan's hellfire but with zero casting time. \n\nGyuratan's eyes widened. Mercedes stared in shock.\n\n\"Kuk—! Y-You—!\"\n\nDemonic energy poured from Gyuratan's body, black eyes returning. Grid didn't flinch.\n\n\"You're already a corpse,\" he said coldly. \"Muller saw to that.\"\n\n**Kwarururung!**\n\nLinked Kill engulfed Gyuratan in a maelstrom of blade work and black fire. His flesh scattered, his body torn apart by relentless strikes. Grid's sword energy surged higher with every hit. Around him, the four God Hands joined the assault—Failure, the White Tiger Sword, Iyarugt, and Grid's Greatsword all pierced forward as one.\n\n\"Isn't it a bit early for celebration?\"\n\nGyuratan's voice cut through the chaos, sharp with cynicism.\n\nGrid didn't respond. He simply activated Pinnacle.\n\n**Seokeok!**\n\nThe blade cleaved from crown to groin. The four weapons drove home simultaneously.\n\n**KUWAAAAAANG!**\n\nBlack flames detonated in a final, massive explosion. Gyuratan vanished into the inferno.\n\nMercedes stared, breathless. She'd seen Piaro fight. She'd seen the great dukes. But Grid's firepower was on another level entirely. Linked Kill Wave Pinnacle was—\n\n\"Hurry.\"\n\n\"...Huh?\"\n\nShe blinked. Grid was already backing away, weapons withdrawing.\n\n\"Wake up,\" he said sharply. \"People will be here any second. I can't afford to get caught in this.\"\n\n*Because I can't win.*\n\nThe truth was simple. Gyuratan was a great demon—weakened and sealed by Sword Saint Muller, yes, but still a demon. Grid stood no chance in a real one-on-one. Even now, after that entire assault, Gyuratan's health bar hadn't dropped below ninety percent.\n\nHe'd only won against Hell Gao because he'd exploited the fire stones. Here, there was no weakness to exploit.\n\n\"By the way,\" Grid added as he grabbed Mercedes' hand and pulled her into a sprint, \"where's your armor?\"\n\n\"I-I didn't sell it!\" Mercedes' face flushed crimson. \"How could I—such a noble symbol—I would never—!\"\n\nGrid almost smiled. She was too serious. Didn't even recognize a joke.\n\nBut as they ran, Mercedes felt the warmth of his hand around hers—firm, steady, completely focused on pulling her to safety. Her heart thundered in her chest, and she couldn't tell if it was from the battle or something else entirely."
}