{
  "id": 799,
  "title": "Chapter 799",
  "content": "The gates loomed ahead.\n\n\"Wait!\" Mercedes pulled free from Grid's grasp, her eyes fixed on the soldiers standing watch. A flush crept across her pale cheeks, and her fingertips still tingled where he'd touched her.\n\nGrid stopped. \"What's wrong?\"\n\n\"Where exactly are you taking me?\"\n\n\"Outside the empire. Where else?\"\n\n\"I can't leave.\"\n\n\"What?\" Grid's brow furrowed. \"That bastard Gyuratan—from the way he carried himself earlier, he clearly holds significant power in the empire.\"\n\nHe'd noticed something crucial during their confrontation. The empire didn't know Gyuratan's true nature. Demonkin were humanity's common enemy. If the Saharan Empire knew a great demon walked among them, they couldn't possibly stand idle. Mercedes' crisis stemmed entirely from Gyuratan's deception.\n\n\"He's branded you a traitor,\" Grid continued. \"You're in danger. He'll frame you just like he did Piaro.\"\n\n\"Which is precisely why I must inform everyone about his identity.\"\n\n\"And you think they'll believe you?\"\n\nMercedes smiled, bitter and knowing. \"No one will believe me. I can barely believe it myself.\"\n\nFifteen years. Gyuratan had played the role of Fourth Knight for fifteen years. A perfect human performance, maintained without a single slip. Not even her sharp eyes had detected the truth, nor those of the empire's renowned magicians and priests. His ability to mask his demonic power transcended the extraordinary—it was the power of a great demon. Weakened or not, he could still make fools of humanity.\n\n\"But if I wait, an opportunity will come.\" Steel entered Mercedes' voice. \"I will hold my position until that day arrives. It's my duty.\"\n\nA great demon of unknown origin threatened to plunge the empire into chaos. As First Knight, she had to stop him. This was her mission—noble, inescapable, and one she refused to abandon.\n\nGrid's expression remained uncertain. \"If Gyuratan tells the Emperor you were with me today—\"\n\nThe chance she waited for would never come. She'd disappear first.\n\nBut Mercedes smiled—bright as sunshine, radiant in a way that didn't suit a noble knight's stern countenance at all.\n\n'She can smile like that?'\n\nThe sight transfixed Grid. Heat crept up his neck.\n\nMercedes' own cheeks darkened. She looked away. \"I'll deny it. Just as no one will believe my claims about Gyuratan being a great demon, no one will believe his accusations against me. But if I run now, I'll have no chance to defend myself. So I stay.\"\n\n\"And if he attacks you directly? Like today? I won't be there to help.\"\n\n\"Who do you think I am?\" \n\nLight blazed in Mercedes' clear eyes—the pride of the empire's First Knight, the strongest warrior who'd made Grid bow at their first meeting.\n\n\"Today went badly in many ways. But next time, I'll be ready.\"\n\nShe'd been without her armor during her detention period. She'd lowered her guard against Gyuratan's magic, thinking him merely a swordsman. Worst of all, her morale had crumbled. Trapped in her own home, uncertain who to trust, she'd grown restless and confused.\n\nBut clarity had returned. She knew her enemy now. And she had someone to rely on. The fog had lifted.\n\n\"Overgeared King.\"\n\n\"Yes?\"\n\n\"Don't worry. I'll clear the false accusations against the Piaro you cherish. I promised, didn't I?\"\n\n\"...I know.\"\n\nGrid understood Piaro's past anguish too well. He desperately wanted to remove that stigma, to free his knight from the dark chains of history. And beyond that...\n\n\"Stay safe.\"\n\nGrid wanted Mercedes for himself. He needed people of strength and talent, and Mercedes embodied everything he sought.\n\nMercedes went rigid, frozen in place. \"...Do you like me?\"\n\nA difficult question. Grid nodded. \"It's not just liking—I covet you. I think about it every night.\"\n\nWho wouldn't covet a knight of her caliber? And among those who might, Grid knew her value better than anyone. That's what he meant.\n\nMercedes heard something else entirely. Her ears burned crimson. \"You're too forward. Are you like this with everyone?\"\n\nGrid missed the accusation beneath the question. \"No, not everyone. I know I shouldn't say this, but what can I do? You're special.\"\n\nHe knew she served the empire already, but he wanted her as his knight. His earnest desire twisted somewhere in translation.\n\n\"I-Is that so?\"\n\nMercedes regarded Grid warily. This man was no ordinary king. He must live as a rake, a woman at his side each night. And yet... she found she didn't entirely mind. He was Piaro's benefactor. Asmophel's savior. The one offering a chance to restore the old Red Knights' honor. He'd saved her life. Surely such a man couldn't be wholly bad.\n\n\"I won't ask why you're in Titan. I won't doubt my benefactor.\" She smiled sadly. \"But please stop shaking my heart. Nothing can happen between us anyway.\"\n\nShe was the empire's knight. How could she marry a foreign king? It would mean forsaking everything. Impossible.\n\nGrid caught her wrist, determination burning in his grip. \"I won't give up on you. Didn't you say when you reunited with Piaro that you'd repay me even if it meant giving everything? Keep your promise.\"\n\n\"...So you don't want a lover or wife, but a slave.\"\n\n\"Huh?\"\n\n\"How crass.\"\n\n\"...??\"\n\nRealization crashed over Grid too late. His dexterity stat, combined with skin contact—\n\n\"It's too much to caress a woman's body while staring with such greedy eyes.\" Mercedes' tone carried an edge. \"You saved my life, and this is the repayment you seek?\"\n\nThe quest reward had transformed him into a pervert in her eyes. Grid's face fell.\n\n\"...If that's truly what you want, I suppose it can't be helped.\"\n\nMercedes' hand rose to her slender neck. Grid's gaze followed the movement to her collarbone. He swallowed.\n\nBut Mercedes simply unclasped the pendant hanging there and offered it to him. White silver gleamed, etched with an elegant rose pattern.\n\n\"This is...?\"\n\n\"My family's token. If you face difficulties in the empire, use this. It will help.\"\n\n*Ttiring~*\n\n[The hidden quest has been completed!]\n\n[Affinity with Mercedes has risen by 50.]\n\n[You have obtained the Vaintz Family's Pendant.]\n\n[**Vaintz Family's Pendant**]\n\n[Durability: 31/33  \nCharm +100  \nNobility +100\n\nA pendant passed down through the direct line of the prestigious Vaintz family in the Saharan Empire. It can be used to prove your identity throughout the empire. There is a high probability of receiving great respect.\n\nWeight: 5\n\nConditions of Use: The heir of the Vaintz family or someone recognized by the heir.]\n\n\"Isn't this precious?\"\n\nThe token represented Mercedes herself, the rightful heir, or someone intimately connected to her. For Grid to possess it seemed strange.\n\nMercedes shook her head. \"It's a trivial thing for a king.\"\n\n'Hardly trivial.'\n\nThis item granted him status across the entire Saharan Empire. Grid could move freely, regardless of circumstances. The value was immense.\n\n\"Are you certain? What if I abuse it and endanger your family?\"\n\n\"Piaro and Asmophel chose you. I don't believe you'd abuse their trust. And even if you did, you'd have good reason. I'll accept whatever consequences arise as my burden.\"\n\n\"...All right. Does this mean you'll keep your word?\" \n\nGrid grinned. Mercedes' straightforward nature appealed to him. The more he learned, the more he trusted her.\n\n\"Thank you.\" A brief farewell.\n\nMercedes knelt, formal and respectful. \"I appreciate everything, Overgeared King.\"\n\n\"Good luck.\"\n\n\"I must succeed. For the empire. For Piaro.\"\n\nThey would meet again safely. Grid would make certain of it.\n\n***\n\n\"You came back? Not eager to die, are you?\"\n\nGyuratan waited in Mercedes' mansion, tone and bearing unchanged from always. As if nothing had happened hours before. Once Mercedes confirmed their solitude, she spoke mockingly.\n\n\"Didn't you expect me to return?\"\n\n\"Honestly? I hoped you'd flee.\"\n\nIf Mercedes had left with Grid, Gyuratan could have buried her under fabricated charges. He could have destroyed her entire family, branded them rebels. But she'd returned instead. A minor complication, easily resolved.\n\n\"Falsifying evidence of treason is simple enough. There'd be backlash, but nothing I couldn't handle by eliminating everyone involved. Just like I did with Piaro's family. Kukukuk!\" \n\nGyuratan's smile turned wicked. His tone and manner fully revealed the great demon beneath.\n\nThe mention of Piaro was obvious provocation. Mercedes saw through it instantly.\n\n\"Such petty tactics, unworthy of a great demon.\"\n\n\"...\"\n\n\"You're nervous. Losing control. If you fight me while I'm fully prepared, the resulting chaos might expose you. So tell me—what do you really want?\"\n\nGyuratan's eyes narrowed. \"Are you proposing a deal?\"\n\nDeals were a demon's specialty, not the contractor's. Few could resist a great demon's temptations. Mercedes understood this perfectly.\n\n\"I propose we don't interfere with each other,\" Gyuratan said. \"My identity cannot be revealed. I am the Great Demon Astaroth. Until my summoner's wish is fulfilled, my presence must remain hidden. I will use every power at my disposal to fulfill that contract.\"\n\n\"Summoner...?\"\n\nMercedes' composure cracked. She'd overlooked something crucial.\n\n'Who summoned him?'\n\nWho had called a great demon into the imperial palace? Her eyes widened.\n\nGyuratan looked satisfied. \"Kukuk! Someone you know well.\"\n\n\"Who?\"\n\n\"I cannot say. A demon's contract demands absolute secrecy. The damage to my contractor would be catastrophic, and even a great demon cannot bear that cost. But I'll give you a hint—it isn't the woman you suspect.\"\n\n'Not Marie?'\n\n\"Compared to her, they're far closer to the Emperor.\"\n\nGyuratan's grin stretched impossibly wide.\n\nMercedes' face drained of color. 'Close' couldn't mean physical proximity alone. It meant blood.\n\n\"One of the princes?\"\n\n\"My hints end there. Obviously, my patron isn't someone easily opposed. You, on the other hand? You've never earned the Emperor's full trust. You rejected the Empress' overtures. You've damaged your relationship with Sword Duke Limit, the man who believed in you. The knights who envy you are merely sheep—they cannot help. Mercedes, you stand alone. Thoroughly powerless. You cannot threaten me.\"\n\nWords designed to breed despair.\n\n\"Unfortunately, I cannot threaten you either. I don't wish to face you directly right now—the risk is too great for me as well.\"\n\nHe'd lost his trump card of surprise magic. Mercedes' skill earned even a great demon's acknowledgment. Weakened state or not, he had to respect her strength.\n\n\"Therefore, I propose we watch each other. It's not so terrible for you. Don't you need time to accumulate power and allies to resist me?\"\n\nThe great demon's temptation proved less sweet than legend suggested.\n\n'I need the Emperor's trust. Urgently.'\n\nMercedes nodded, lost in thought.\n\nGyuratan laughed."
}