{
  "id": 8,
  "title": "Chapter 8",
  "content": "# Chapter 8\n\n\"That bastard Doran!\" \n\nI stumbled out of the capsule, legs still shaking. The window screeched as I yanked it open.\n\n\"He forced a quest on me just to get his teammate killed! Fuck!\" Rain hammered the glass. My voice tore into the downpour. \"Thieves, robbers, thugs—now I know why people use those names! Doran! Your name's a curse!\"\n\nThe rain drowned my shouting. No neighbors pounding on walls. No one to hear me scream myself hoarse at four in the goddamn morning.\n\nA golden holiday. My family could sleep in because of the storm. And I was locked out for twelve hours.\n\n\"Level minus three.\" The number burned. \"The more I think about it...\" I slammed my palm against the windowsill. \"Doran, Doran, *Doran*!\"\n\nThe bathroom mirror showed a face I barely recognized. I cranked the cold water and dunked my head under the faucet. Two days without washing. The stream pounded against my skull until the rage finally cooled to something manageable.\n\n*Doran's not actually to blame.*\n\nThe admission tasted bitter.\n\nHe'd been stronger than I expected. Fought like a demon. I'd just stood there like a useless bridesmaid while he tore through enemies alone. Without his power, I'd have failed the quest in the first five minutes.\n\nDoran did everything right.\n\nThen she showed up.\n\n\"Damn witch.\"\n\nWater dripped from my hair onto the tile. *Why was Yura even there?* Black magician. Yatan Temple. The math wasn't complicated. Of course she'd be skulking around an evil church. *And of course she'd attack an intruder.* Me. Invading her territory.\n\n*The moment I accepted the quest, the black magicians probably got their own quest to stop me.* The pieces clicked together. *Real enemies are other players, not NPCs. That's why Doran was so strong. The S-grade quest was never supposed to be easy.*\n\nI grabbed a towel. Pressed it against my face.\n\n*Thanks to me starting the quest, she got all those rewards.* My hands twisted the fabric. *Girl didn't shed blood or sweat. Just swooped in to kill me instead of saying thanks.*\n\nAfter my death, Yura would've cleaned up. She was strong. Doran was exhausted. Simple arithmetic.\n\n*I* triggered the quest. *I* was too weak to help, grinding Doran down. Yura just sat back and collected the prize.\n\n\"Bread I put in her mouth,\" I muttered.\n\nBad person. A ranker over level 200 stealing from someone at minus levels.\n\nThe capsule hummed as I connected to the Internet. I typed her name.\n\n**Yura.**\n\nThe screen flooded. Hundreds of links. Thousands. I clicked through the high-traffic blogs and major communities, piecing together her profile.\n\n'Blood Witch'—creepy nickname for someone universally loved. Beautiful. Skilled. Perfect media image. Men worshipped her. Women envied her. International fan clubs numbered in the thousands. More popular than Hollywood's top actors, some posts claimed.\n\n*This is the world now.*\n\nSatisfy was bigger than movies. More colorful, more thrilling, more dramatic than anything on a screen. Its protagonists enjoyed more fame than film stars. Hundreds of TV channels dedicated to Satisfy coverage. High ratings. Entire networks built around the game.\n\nAnd it wasn't just South Korea. Two billion users worldwide. A global broadcasting market.\n\nRankers like Yura occupied a different stratosphere.\n\nHer beauty amplified everything. Money. Fame. A perfect contrast to me—drowning in debt because of this game.\n\n*She's living a fantasy while I'm suffering.* The injustice gnawed at me. *Playing her favorite game, recognized by the world.*\n\nIf I were Yura, I'd have no complaints.\n\n\"A person like you had to steal from someone poor.\"\n\nNot a witch. Just wicked.\n\n*Kwaduduk.*\n\nThe hologram keyboard materialized. I cracked my knuckles and started typing.\n\n> *Yura is garbage. Interfered with a low-level user's quest. Completely different from her TV personality. Rotten to the core.*\n\nPost.\n\n> *Yura's not even pretty in real life. Plastic surgery. Nose job. Always looks like she's chewing shit. That smile's fake.*\n\nPost.\n\n> *Why does everyone worship Yura??? She's a bad person. Ruined my brother-in-law.*\n\n> *A ranker stole my quest!! Don't believe the TV image.*\n\n\"Huhuhu...! Kukukuk!\"\n\nSpreading truth. Journalism. Exposing the lies fed to deceived masses. The humiliation from earlier faded with each comment, replaced by righteous vindication.\n\n*Tadak. Tadadak.*\n\nTen fingers dancing across glowing keys. The room dark except for the blue-white illumination of the hologram. Someone watching might find it beautiful. Mysterious.\n\n\"Have you finally gone crazy?\"\n\nI jerked up. Sehee stood in the doorway, arms folded.\n\n\"You scared me.\" My hand went to my chest.\n\nShe stepped inside. \"I was going to the bathroom when I heard giggling. Thought the game fried your brain.\" Her nose wrinkled. \"Are you insane? Please tell me you're not.\"\n\n\"Why would you talk to me like that?\" I shifted in my seat. \"I'm not crazy.\"\n\n\"Good. Though something *smells.*\" She eyed my head. \"When did you last shower? And clean up those bowls! Why are you eating in your room anyway? You should eat with—no, forget it.\"\n\nShe started gathering the stacked dishes and empty containers.\n\n*Good kid. Pretty. Glad she doesn't take after me.*\n\nI watched her work. She glanced back.\n\n\"Don't just sit there. Help me. No—go wash up. I don't like how you look right now.\"\n\n\"Leave it. I'll handle it later.\" I waved her off. \"Why are you even awake? It's not morning yet. Go back to sleep.\"\n\n\"I saw you laughing like a maniac. Sleep's gone.\" She wrinkled her nose again. \"Wash up. I want to see your face properly after so long... no! Just wash off that *smell*!\"\n\nWhen she was one, I was nine. This was the respect I got?\n\n*Should've showered when I washed my hair.*\n\nI trudged to the bathroom. Grabbed soap, lathered up, toweled off. My hair felt strange. Stiff.\n\n\"It was laundry soap.\"\n\nBack in my room, a different scent greeted me. Fresh. Clean. *Did she spray perfume?* Meticulous girl. She'd cleaned and organized everything while I was gone. Diligent. Unlike me. She'd make a good wife someday.\n\nShe sat in the capsule now, sprawled on my bed.\n\n\"Connect to the Internet if you want.\"\n\nI couldn't access the game anyway. Might as well let her use it.\n\nShe sent me a look. Disappointment? Disgust? \"Are you a keyboard warrior?\"\n\n\"Keyboard warrior?\" I blinked.\n\nShe rose, pointing at the monitor floating before the capsule.\n\n\"Why are you spreading lies about a woman younger than you? Even if you have reasons, this is pathetic. I'm disappointed.\"\n\nHer voice dropped. Genuine anger.\n\nI followed her finger. The comment thread. Still open. Every malicious post I'd written about Yura displayed like evidence at a trial.\n\n*Dammit! I forgot to close the window!*\n\n\"S-Sehee, this—\"\n\n\"How low.\"\n\nShe left. Her door locked. I stood there, working the handle, pleading through the wood. Nothing. The last shred of her respect for me, gone.\n\n*What is this?*\n\n\"This is all that witch's fault!\"\n\nI kept appealing outside her room until my mother found me there the next morning, body aching from sleeping against the door.\n\n*Not trained at all. Everything hurts.*\n\nCold patches applied. More sleep. Then the next day.\n\n\"Huaaah~~\"\n\nEleven a.m. Parents at work since dawn. Sehee three hours into her school day.\n\n\"Only six hours of sleep. Can't oversleep when I'm this diligent.\" I scratched above my underwear. \"Why did God make me so responsible?\"\n\nThe kitchen beckoned. My stomach growled. Cooking seemed too much effort.\n\n\"Forget it.\"\n\nI ignored my protesting gut and collapsed on the living room sofa. TV on. Satisfy channel, naturally.\n\nEven housewife networks covered it. *How to Meet Young Men Through Satisfy!* A program teaching middle-aged women to make attractive characters.\n\n*PD Cheon Jaende?*\n\nHigh viewership, apparently. I skipped past some guy who looked like his wife would kill him after seeing the show.\n\n*Satisfy's Hot Issues* caught my attention.\n\nA cute female reporter interviewed an Asian youth about my age. Close-up on his face. Subtitles identified him: **Katz, Level 203.**\n\n\"Already level 200?\"\n\nKatz was famous. Notorious for arrogance, but consistently top-ranked among warrior classes. Three months ago, he'd been 170. Now 203. That would put him high on the unified rankings.\n\n*Over thirty levels in three months?*\n\nThe reporter asked my question.\n\n> **\"Katz, you're one of Satisfy's biggest trending topics. Our producers were shocked. In three months, you climbed to 53rd on the unified rankings. What's the secret to your rapid growth?\"**\n\nKatz swept a hand through his perfectly styled hair. Smug smile.\n\n> **\"Three months ago, I obtained an Epic Class. I accepted this interview to reveal it.\"**\n\n> **\"What?!\"**\n\nThe reporter froze. I stopped scratching.\n\nEpic Class. Two had appeared in the past year. Their value transcended comprehension. And Katz claimed a third.\n\n*The third Epic Class.*\n\nNo information existed on the previous two. The first class change book traded in secret markets, owner unknown.\n\nThe second belonged to Agnus—7th on unified rankings. His class remained a mystery.\n\nTop rankers hoarded information. Knowledge was power. Competition in Satisfy demanded secrecy. Most players kept discoveries to themselves. I would too.\n\nBut Katz was revealing everything. He loved attention. Colorful, prominent displays.\n\nThis was massive. Rating records might break.\n\nI sat forward. The reporter's eyes gleamed with excitement.\n\n> **\"What class did you get?\"**\n\n> **\"Blood Warrior.\"**\n\n> **\"Is it as special and terrible as the name suggests?\"**\n\nNeither special nor terrible. Common. Mundane. Sloppy name for an Epic Class. But Katz seemed proud of the childish title.\n\n> **\"The name's nothing impressive, but the class is fantastic. Let me show you one important feature...\"**\n\nHe drew his sword. The weapon radiated power. Tremendous aura. *I could pay off my entire debt selling that blade.*\n\n> **\"Look.\"**\n\nHis eyes tinged red. The sword began to writhe."
}