{
  "id": 80,
  "title": "Chapter 80",
  "content": "# Chapter 80\n\n\"Kiyaaaaak!\"\n\nThe merman's scream was music to my ears.\n\n*Yes! Good!*\n\nEvery swing of my blade brought a fresh wave of satisfaction. Each spray of blood, each shriek of pain confirmed what I already knew: I was getting stronger.\n\n> [The Best Gauntlets option effect is activated, causing you to attack the target twice.]\n\n> [The Ideal Dagger's option effect is activated, instantaneously killing the target.]\n\nOne of the six mermen collapsed, its body already dissolving into grey light. The Ideal Dagger's instant-kill effect had triggered. Perfect.\n\nThe remaining five converged on me, tridents raised. But I was already inside their reach, dagger in hand. Their weapons were two meters long. They needed distance.\n\n\"Grrr!\"\n\nThe mermen backed off, pupils dilated with rage. They circled me like sharks, tridents leveled at my chest. I didn't give them time to regroup. I picked the weakest-looking one and lunged.\n\n*Bam bam bam!*\n\n\"Kiik!\"\n\nThe merman tried to parry, but I stuck to it like a leech. My dagger found gaps in its scales, punching through the soft tissue beneath. The others hesitated. They wanted to help their companion, but they were afraid of catching my blade instead.\n\n*Idiots.*\n\nMermen had a reputation for strong bonds and teamwork. Right now, that meant nothing. They were just fish out of water.\n\n*Mermen... these damn creatures!*\n\nThe memory surfaced unbidden. Lake Fabian. I'd been a warrior back then, barely scraping by. The mermen there had been low-level trash compared to these, but they'd still overwhelmed me. Drowned me. Killed me.\n\n*Payback time.*\n\n*Puok!*\n\n\"Kkuk!\"\n\nThe merman went limp, my dagger buried in its throat. The others saw their companion die and lost it. Tears of blood streaked down their scaled faces. They charged.\n\n> [You have suffered 2,900 damage.]\n\n> [You have suffered 2,830 damage.]\n\nTwo trident strikes. More than half my health, gone in an instant.\n\n*Damn.* I staggered back, tasting copper. *I'm wearing the Frostlight Orc Chief's Helmet and Khan's Masterpiece. This should've bounced off.*\n\nBut fear was a luxury I couldn't afford. The cooldown on my mana potion had expired.\n\nI drank.\n\nThe liquid burned down my throat, and my mana gauge surged. I checked it once, then activated my skill.\n\n\"Pagma's Swordsmanship, Wave!\"\n\nMy body stilled. Behind me, Loran Falls roared, a thousand tons of water crashing down stone. For a moment, I was like that waterfall. Calm. Gathering force.\n\nThen I moved.\n\nWaves of energy erupted from my blade, rippling outward in every direction.\n\n*Pepepepeng!*\n\n\"Kiyaaaaak!\"\n\nAll four mermen were caught in the blast. They reeled, movements slowing to half speed. Attack speed, movement speed, everything dragged down by the skill's effect.\n\nI didn't waste the opening.\n\n\"Wind Blast!\"\n\n\"Kyaaak!\"\n\nThe last merman fell.\n\n> [Your level has risen.]\n\nI exhaled. Six mermen down. Gold, japtem, and experience confirmed.\n\n\"Invest 10 points in intelligence.\"\n\n> [You have invested 10 points in intelligence. Is this correct?]\n\n\"Yes.\"\n\nMy mana climbed to exactly 600. Still pathetically low, but progress was progress.\n\n*If I keep making items, my stats will rise. Someday I'll have enough mana to use Pagma's Swordsmanship freely. But when?*\n\nI pictured myself at level 300, swimming in mana, debt-free and powerful. The fantasy tasted sweet. I turned to leave.\n\nA man stood in my path.\n\nScraggly beard. Filthy rags. Tangled hair.\n\n*A beggar.*\n\nMy heart sank.\n\n*Oh no. He's going to ask for money.*\n\nI'd lived 26 years on Earth without once dropping a coin in a Salvation Army bucket. I wasn't about to start in a video game. I pivoted on my heel and walked the other way.\n\n\"I have a favor to ask of you.\"\n\n*Ah, damn.*\n\nOf course. Of course this beggar wanted something.\n\n*He picked the wrong target.*\n\nI kept walking. The beggar's hand landed on my shoulder.\n\n\"Can't you hear me?\"\n\n\"I heard you.\" I didn't stop.\n\n\"Then why aren't you answering?\"\n\n\"Why would I reply to a beggar?\" I shrugged off his grip.\n\nHis face twisted. \"What? Beggar? I am a beggar?\"\n\n\"You aren't? You look exactly like one.\"\n\n\"Kuk! Kuhahahaha!\"\n\n*Is this beggar insane?* I glanced back. *Why is he laughing?*\n\n\"Hey, Mister.\" I kept my voice low. \"Would you mind being quiet? This place smells of mermen blood. More might appear. It'll be dangerous if you keep making noise.\"\n\n*Gurgle gurgle!*\n\nFoam erupted from the base of the waterfall.\n\n*Damn it.*\n\nMore mermen. I'd wanted to leave before reinforcements arrived. My instincts screamed at me to run.\n\n*I can't fight more than seven.*\n\n\"Hey.\"\n\nThe beggar called out again. I didn't slow down.\n\n\"Hey, beggar. If you don't want to die, then leave. Well, I don't care if you die or not. I'm going...\"\n\n*Peeng! Peeng! Peeng!*\n\n*Damn. Damn!*\n\nEleven mermen burst from the water. They formed a circle around me and the beggar, tridents gleaming wet.\n\n\"Who...? Someone murdered our kin!\"\n\n\"I will kill you... Kill him and chew up his heart!\"\n\nI pointed at the beggar.\n\n\"I witnessed with my own eyes that this man killed your brethren!\"\n\nThe words came out before I could think. Instinct. Pure survival instinct.\n\n*Sacrifice someone else. Live another day.*\n\n\"You...! It was you!\"\n\nThe mermen bought it. Their eyes locked onto the beggar. I bolted.\n\n*Chaeng!*\n\n*A sword?*\n\nThe sound of steel on steel froze me in place. I looked back.\n\nThe beggar held a longsword. Old design, worn grip, but the edge gleamed sharp.\n\n*That's clearly a sword! How does a beggar have that?*\n\n*Wait.*\n\nNo beggar would survive in Kesan Canyon. Not for a day. Not for an hour.\n\n*Then this person...*\n\nI focused on the name above his head.\n\n**Piaro.**\n\nGreen text. An NPC. And he'd approached me first.\n\n*A quest.*\n\n\"I don't like fish.\" Piaro's voice was flat.\n\n*Sasak! Sasasasak!*\n\nHe moved.\n\nNo skills. No flashy effects. Just pure swordsmanship. His blade wove through the mermen like thread through cloth. Eleven enemies. Eleven strikes. He sheathed his sword.\n\n*Clink.*\n\nThe mermen coughed blood and vanished into grey light.\n\nI stared.\n\n*What... what the hell?*\n\nPiaro looked at me. His expression was cold.\n\n\"You are the type of person who will sacrifice innocents to survive.\" His voice carried disgust. \"You are the type of person I hate most in the world.\"\n\n\"I-I'm sorry...\" The words came out small. *Don't kill me. Please don't kill me.*\n\nHe shook his head. \"There is no need for any pretenses. I don't want to talk to you for too long, so I will cut to the chase. Help me.\"\n\n*Ttiring~*\n\n> [**The True Traitor of the Red Knights**]\n>\n> **Difficulty:** S\n>\n> The Red Knights were once the strongest knight division on the continent. The Saharan Empire exists today because of the Red Knights.\n>\n> Asmophel, the vice captain of the Red Knights, had a secret rendezvous with the Empress. Then he framed Piaro, who knew the truth.\n>\n> Due to Asmophel skillfully borrowing the power of the Empress, Piaro and his men were framed as traitors to the Emperor and were forced to flee.\n>\n> Piaro cannot forgive Asmophel or the imperial family who drove his comrades to ruin. But it is impossible for Piaro to move directly due to the trackers scattered throughout the continent.\n>\n> In the end, Piaro must entrust his revenge to an agent.\n>\n> **Quest Clear Conditions:** Punish Asmophel.\n>\n> **Quest Clear Reward:** Title 'Agent of Revenge.'\n>\n> * **Agent of Revenge:** The 'Cruelty' stat will be opened. **Attack Power +100**. Skill 'Murderous Impulse' will be generated.\n>\n> **Quest Failure:** Level -4.\n\nI scanned the quest text. The Saharan Empire was next to the Eternal Kingdom, but it was still a long journey. And I had to punish the vice captain of a knight division? Leo, the Northern Nova, would be a chick compared to Asmophel.\n\n*I like the reward. But there's no guarantee of success and the distance is too far. It's wiser to make items at the smithy than waste time on this.*\n\nI made my decision.\n\n\"I don't have the time or ability to help you.\"\n\n> [The quest was refused.]\n\nPiaro clicked his tongue.\n\n\"You don't like the reward?\"\n\n\"No. I don't have the time or ability.\"\n\n\"I am familiar with people like you.\" His eyes narrowed. \"You must be hoping for a bigger reward by taking advantage of my desperate situation.\"\n\n\"No, that isn't it. It isn't about the reward. I really don't have the time or ability to help you.\"\n\n\"Bah. I will add my sword as a reward.\"\n\n> [Piaro has changed the quest reward.]\n>\n> **Quest Clear Reward:** Title 'Agent of Revenge', **Piaro's longsword**.\n>\n> * **Agent of Revenge:** The 'Cruelty' stat will be opened. **Attack Power +100**. Skill 'Murderous Impulse' will be generated.\n>\n> * **Piaro's longsword**\n>\n> **Rating:** <span class=\"rarity-unique\">Unique</span>\n>\n> **Durability:** 110/213  \n> **Attack Power:** 387  \n> **Accuracy:** +10%\n>\n> The skill '**Hatred**' will be generated.\n>\n> * **Stamina** -100.\n>\n> *It is somewhat damaged, but that doesn't change the fact that it is a great sword. But it is cursed because it contains Piaro's strong grudge. There is some risk involved in using it.*\n>\n> **User Restriction:** Level 190 or higher. More than 900 strength. More than 300 agility. Advanced Sword Mastery.\n\nI stared at the stats.\n\n*Attack power 387.*\n\nA one-handed sword with higher attack power than the legendary Sword of Self-transcendence. The level requirement was 30 levels higher, but still. For a Unique rating, this was incredible.\n\n*This could sell for a fortune.*\n\nMy brain started calculating. Why did I make items? To make money. But even if I crafted dozens or hundreds of items, there was no guarantee I'd produce anything Unique or higher. This quest might give me a bigger reward than weeks in the smithy.\n\n*But...*\n\nI closed my eyes.\n\n*I truly don't have the capabilities.*\n\nI was strong. But not strong enough to face the vice captain of the once-strongest knight division on the continent. I needed to be smart. Greed was one thing. Stupidity was another.\n\nI turned away from the sword.\n\n\"I truly don't have the ability to carry out your request.\"\n\n> [The quest was refused.]\n\nPiaro bit his lip. Anger flashed across his face.\n\n\"You truly are a greedy person. Don't you know that excessive greed can be a poison?\"\n\n*This is familiar.*\n\nThe memory surfaced. Doran. No matter how many times I'd refused his quest, I'd ended up doing it anyway. Piaro reminded me of Doran.\n\n*I need to be firm. Or I'll get dragged into this.*\n\nI raised my voice.\n\n\"How many times do I have to say it? I don't have the ability! The ability! Why are you misunderstanding me?\"\n\n\"You don't have the ability?\" Piaro's eyes bored into me. \"It isn't easy to kill canyon lizards, lizardmen, spiders, eagles, crocodiles, wolves, and six mermen at the same time.\"\n\n\"Heok...\"\n\n*What... how?*\n\nHe knew everything. Everything I'd done in Kesan Canyon.\n\n\"Y-You!\" Panic clawed up my throat. \"Are you a stalker? What do you want from me? Surely not my virginity...! Dirty bastard!\"\n\n\"Didn't I already say it? All I want is Asmophel's death.\" Piaro stepped forward. \"It seems talking won't work with you.\"\n\n*Peok!*\n\nHis sheath cracked against my thigh.\n\nI fell.\n\n> [You have suffered 7,500 damage.]\n\n> [The Apostle of Justice's bravery is unmatched.]\n\n> [The Apostle of Justice is in a crisis. You won't easily collapse in front of enemies.]\n\n> [All stats will increase by 30%.]\n\n\"W-What...?\"\n\nMy health bar had dropped by more than half. From a sheath. Just a sheath. And he'd killed eleven mermen in seconds.\n\n*Who is this person?*\n\nPiaro looked down at me with cold eyes.\n\n\"Make sure to answer. Will you accept my request? Or will you die here?\"\n\nSilence.\n\n*He's nothing like Doran.* Doran had been stubborn but kind. This man was different. Cold. Ruthless.\n\nA demon.\n\n\"T-This is ridiculous...!\" My voice cracked. \"An NPC will kill me if I refuse a quest... What the hell is this...?\"\n\n\"What are you saying? Answer me.\"\n\n\"Dammit! I'd rather die!\" The words spilled out. \"If I fail the quest, I'll lose four levels and waste my time. But if I die here, I'll just lose experience! I'll be resurrected in Winston, so it'll save me some time!\"\n\nPiaro's expression didn't change.\n\n\"You don't know what a life is worth. Why did God create immortal beings like you, and why are you living among ordinary humans like us? I can't understand, no matter how I think about it.\"\n\n*An NPC questioning the existence of users?*\n\nI stared at him, speechless.\n\n\"Get lost.\" Piaro turned away.\n\n\"Huh?\"\n\n\"Get out of my sight.\"\n\n\"Q-Quest. No, weren't you going to kill me if I refused your request?\"\n\n\"Bah. I don't have the hobby of killing innocent people.\" \n\nHe walked away. Just before disappearing from view, he stopped.\n\n\"If you are willing to accept my request later, come here. I'm not forcing you. It's just hope.\"\n\nThen he was gone.\n\nI sat there for a long moment, thigh throbbing. Eventually, I stood. I returned to Winston. Along the way, I fought several monsters in the canyon and reached level 95. I invested all the stat points into intelligence.\n\n*I'm like a magician.*\n\nInvesting everything in intelligence just to increase mana. It was regrettable. But I got some good news.\n\n> [The skill level of **Blacksmith's Rage** has risen.]\n\n> [The skill level of **Unbreakable Justice** has risen.]\n\n> [**Blacksmith's Rage**]\n>\n> **Lv. 2**\n>\n> Increases attack power by **15%** and attack speed by **30%** for 30 seconds.\n>\n> **Skill Mana Cost:** 40  \n> **Skill Cooldown Time:** 60 seconds\n\n> [**Unbreakable Justice**]\n>\n> **Lv. 2**\n>\n> Deals **320%** of your attack power.\n>\n> **Skill Mana Cost:** 300  \n> **Skill Cooldown Time:** 90 seconds\n\nWind Blast and Quick Movements were built into the Ideal Dagger. Their levels wouldn't increase no matter how much I used them. But Blacksmith's Rage and Unbreakable Justice were my own skills. They gained experience. They leveled up.\n\nI felt stronger.\n\n*Progress. Slow progress. But progress.*"
}