{
  "id": 800,
  "title": "Chapter 800",
  "content": "**Chapter: The Tower of Eternity**\n\nGrid exhaled a long breath as the massive walls of Titan faded into the distance. The Hooded Zip-Up's stealth function had proven invaluable—he'd slipped past the magic power detectors and patrolling soldiers with surprising ease. His improved control skills deserved some credit, certainly, but his heightened senses played the larger role.\n\n\"Great demon...\"\n\nBehind him, Titan's colossal exterior walls still dominated the horizon. Above them, storm clouds gathered in oppressive layers, dark and heavy with the promise of rain and thunder.\n\n*Which one is he?*\n\nHell Gao, Furfur, Drasion, Morax, Astaroth—the five great demons sealed by Sword Saint Muller himself. Gyuratan had to be one of them.\n\n*Not Hell Gao.* That demon possessed hellfire and descended periodically into low-grade demonkin hosts. But Hell Gao's prison was Cork Island, not the imperial capital.\n\n*Not Drasion either.* According to information Grid had received from Kraugel, the Sword Saint had already raided that particular demon. If Drasion were sealed anywhere near Titan, witnesses would have reported Kraugel's assault.\n\n*And definitely not Furfur.* Grid had seen Agnus wielding that demon's power firsthand.\n\nThat narrowed it down to Morax or Astaroth. Astaroth supposedly commanded lightning and might be connected to thunder stones, but Grid knew nothing about Morax's abilities.\n\n*Mercedes should be fine.* He knew her capabilities well enough. Pure force wouldn't overcome her easily, and a weakened great demon—especially one so diminished it needed to masquerade as a Red Knight—couldn't possibly match a complete demon's power.\n\n*That Gyuratan bastard is cunning, though.* Grid shook his head, then deliberately banished the thought. *Not my problem to solve.*\n\nThis was the empire's internal affair. He could only hope Mercedes would overcome whatever crisis awaited her. Grid turned his back on Titan completely—\n\n\"Overgeared King.\"\n\nA figure in a wide-brimmed hat and forsythia-colored robes materialized before him. Grid's insight stat flared a warning. His hand moved to his weapon. \"You know who I am? Who are you?\"\n\nThe stranger removed their hat. The name hovering above their head displayed in NPC coloring.\n\n\"I am Raji, a magician of the Tower of Eternity. The tower's master, Goldhit, extends an invitation. We hope Your Majesty will accept.\"\n\n*The Tower of Eternity?*\n\nGrid possessed Magic Missile and Magic Detection—gifts from Braham. He had the theoretical knowledge to learn Fireball if he raised his intelligence high enough. But he was no magician. The Tower of Eternity meant nothing to him.\n\nHis first instinct was to simply ask what it was, but revealing ignorance to a stranger seemed unwise. When in doubt, consult Lauel.\n\n—Lauel.\n\n—Yes, Your Majesty. The response came instantly, as if his strategist had been waiting by the whisper channel ever since Grid entered the empire alone.\n\n—What's the Tower of Eternity?\n\n—A magic tower belonging to the Saharan Empire. Rumor has it the emperor relies on the Tower of Eternity almost as much as the Tower of the Sun. The tower's master, Goldhit, ranks among the ten great magicians of the continent.\n\n*This is huge.*\n\n—Then why do they want to see me?\n\n—Huh? Have you been discovered in the empire? Are you in danger?\n\n—No. I finished my business quietly and left Titan. Then this magician was waiting for me. He knew my identity and invited me.\n\nAn invitation instead of an arrest warrant?\n\n—An invite... wait, this could be— Lauel's voice quickened with excitement. —The Tower of Eternity's magicians technically belong to the empire's forces, but only during wartime. Usually, the tower operates in complete seclusion from worldly politics. They wouldn't involve themselves in the empire's current situation.\n\n—So it's a genuine invitation?\n\n—Yes! Accept it immediately. The Tower of Eternity is famous for hidden quests. There are magicians who'd kill for an invitation like this.\n\nGrid felt his own excitement rising, but caution held him back.\n\n—Wait. This Goldhit knows I'm a king, yet didn't come personally? Isn't that disrespectful? Sending a subordinate?\n\nThis wasn't Grid being oversensitive—it was common courtesy. Goldhit was clearly underestimating the Overgeared Kingdom. As its ruler, Grid couldn't simply ignore such a slight.\n\n—Goldhit isn't someone who concerns themselves with manners, Lauel explained. —The masters of the Tower of Eternity and Tower of the Sun are known as the king's magicians. Goldhit is over one hundred and twenty years old. They've been the continent's strongest magician for more than a century. If Emperor Juander wants an audience with Goldhit, he has to visit the tower himself.\n\n*Someone who makes even the emperor come to them?*\n\nGrid's expectations soared. Why would the master of a tower famous for hidden quests seek him out specifically?\n\n*A massive hidden quest?*\n\n\"I understand. I accept the invitation.\" Grid nodded to the waiting Raji.\n\n***\n\n**80th Floor, Tower of Eternity**\n\nOnly one person could climb to the tower's pinnacle—the level where all of Titan spread out below like a painted map. Goldhit, a great magician who stood apart even among the legendary ten, had earned that privilege through power alone.\n\nMany said if she'd pursued worldly authority, she would have ruled nations by now. Some believed she could have built a magical empire to rival the Saharan Empire itself. Yet Goldhit remained a shadow in Satisfy's history, secluded from the world. Unless a player reached the heights of magical mastery, they would never even hear her name.\n\n\"I was never fully trained in Teacher Braham's enhancement magic.\"\n\nBraham's fourth disciple. A genius, they said. The most talented magician on the continent, according to ordinary people.\n\nBut before Braham's brilliance, her talent was dust. She couldn't follow her mentor's teachings, couldn't grasp the theories he laid bare.\n\nGoldhit resented being his student. She'd learned enhancement magic existed, tasted its possibilities—only to find herself forever barred from its deepest secrets. Just a little more...\n\nIf she could truly understand the theories behind enhancement magic, she could transcend her limits. She could become a legend.\n\nFor years, Goldhit had nursed this frustration. Then Grid appeared—Grid, who'd assimilated Braham's soul and learned the enhancement magic properly. When news of that development reached her tower, Goldhit's ancient heart had nearly burst with excitement.\n\n\"Finally... the opportunity has come.\" She gazed into a crystal sphere, watching Grid's approach, and smiled. \"Magic Detection.\"\n\n*Shaaaaaaah—*\n\nMaster-level detection magic blanketed the Tower of Eternity. Goldhit focused every nerve on sensing Grid's mana, on catching even a glimpse of the enhancement magic in action.\n\n\"Come on, show me Braham's technique. Yohohoho...\"\n\n***\n\n*Thunder stone?*\n\nRaji guided Grid through the tower's entrance. At the very top, Grid spotted something unusual—a massive transparent stone imprisoning a tremendous thunderbolt. It looked like someone had taken a thunder stone and magnified it a hundredfold.\n\n*What's the point of that? And how did they even make a thunder stone that large?*\n\n\"You must ascend alone from the 10th floor to the 20th floor,\" Raji said, interrupting Grid's thoughts. \"It serves as a test to determine whether you're worthy to be the tower's guest. This tradition is as old as the tower itself. I hope Your Majesty isn't offended.\"\n\nInviting someone as a guest, then immediately testing them? Grid felt a flash of irritation, but if this was the tower's tradition, arguing seemed pointless. Then understanding struck.\n\n*This test is a quest.*\n\nHis irritation transformed into anticipation. Grid followed Raji to the 10th floor. There, the magician bowed politely. \"Good luck, Your Majesty.\"\n\nHe withdrew—\n\n[A quest has been created.]\n\n[★ Hidden Quest ★\n\n**The Tower of Eternity**\n\nThe Tower of Eternity stands as history's tallest tower. Not just anyone may access its heights.\n\nYour mind will gain enlightenment with each floor you climb, absorbing the essence of knowledge and wisdom contained within.\n\n**Quest Clear Conditions:** Break through the gateways to ascend the tower. Currently, you may reach the 20th floor.\n\n**Quest Clear Compensation:** Each floor conquered permanently increases Intelligence by 2 points.\n\n**Quest Failure:** Return to the 10th floor.]\n\n\"Incredible!\" The exclamation burst from Grid's lips.\n\nTwo intelligence points per floor. The reward exceeded his wildest expectations.\n\n*And it's intelligence specifically.*\n\nFor an ordinary blacksmith, this would be a mediocre reward at best. But Grid was Pagma's Descendant and Braham's student. His skills devoured mana at staggering rates. He had the potential to master all of Braham's enhancement magic.\n\nIntelligence was critical.\n\nStrength and stamina remained his priorities, certainly, but the forced intelligence allocation from his class had always felt wasteful—necessary but grudging. Now he had a chance to gain intelligence *willingly*, in meaningful quantities.\n\n*Twenty floors means forty intelligence points total.*\n\nExcitement burning in his chest, Grid pushed open the firmly sealed door.\n\nInside lay a circular arena. Despite the tower's narrow exterior, the 10th floor stretched vast—larger than the Overgeared Kingdom's training grounds, which could accommodate hundreds of soldiers simultaneously.\n\n[The Tower of Eternity's Guardian has appeared!]\n\n*Kwaaaaah!*\n\nA golem. The guardian materialized with enough force to shake the entire tower, then immediately struck at Grid. Its size was tremendous.\n\nBut golems were slow. Grid sidestepped the crushing blow and slashed with the Enlightenment Sword.\n\n*Jeeeeeong!*\n\nA powerful strike! The blade connected squarely with the gray golem's thick waist—\n\n[You have dealt 1 damage to the target.]\n\n\"Complete physical resistance?\"\n\nThe golem stood unharmed. It ignored Grid's follow-up attacks like mosquito bites and swept its massive arms in wide arcs.\n\n*Kung! Kwang!*\n\nThe arms missed Grid but hammered the ground with devastating force. The impacts alone threatened him—the shockwaves disrupted his balance, nearly knocking him off his feet.\n\nHigh above, Goldhit smiled as she watched through her crystal sphere.\n\n*The tower's guardians can only be defeated through magic. Eventually, you'll have to use it. Come on. Use that beautiful enhancement magic. Show me its glory.*\n\nAnticipation coiled tight in her chest—\n\n*Peng!*\n\n*Kwarururung!*\n\nFlames erupted inside the crystal's image. Fire engulfed the guardian in successive waves, consuming it completely.\n\nThe Enlightenment Sword's **Fire Emission** enchantment. Five thousand fire damage per activation.\n\nGoldhit stared at the sphere.\n\n\"...What?\""
}