{
  "id": 801,
  "title": "Chapter 801",
  "content": "**Chapter: The Tower's Trial**\n\n*Can a single magic sword wreak such havoc alone?*\n\nGoldhit's fingers drummed against the armrest of her throne, eyes fixed on the scrying crystal. Magic weapons required the combined expertise of both magician and blacksmith—a collaboration of disciplines. While a single artisan could occasionally produce one, such occurrences were extraordinarily rare. She'd worked with countless blacksmiths over the centuries, knew the difficulty intimately.\n\n*Creating such a weapon alone should be nearly impossible.*\n\nShe catalogued the weapon in her mind. Magic armaments fell into three distinct categories:\n\nFirst, battle gear imbued with complete magical circuits—capable of channeling the wielder's mana to cast spells embedded within the weapon itself.\n\nSecond, magically enhanced equipment that amplified the wearer's innate magical power.\n\nThird, elemental conduits containing pure attribute essence. These consumed the user's mana with each activation, manifesting fire, ice, or lightning. Despite expressing raw elemental force, their output remained disappointingly modest.\n\nThe sword Grid wielded clearly belonged to the third category. Yet something was wrong. The blade released flames without draining his mana reserves—drawing instead from the atmospheric mana saturating the tower. An infinite fuel source. And the flames themselves... far more potent than any standard elemental conduit should produce.\n\n*A weapon worthy of legend itself.*\n\nThe realization struck her like a physical blow. Grid was Pagma's Descendant. Her gaze sharpened, analyzing every inch of the longsword's construction. The material was anything but ordinary.\n\n*Demonic energy? It couldn't be...*\n\nThe story of Grid's victory over the Great Demon Belial had spread across the continent. The pieces fell into place.\n\n*A fragment of Belial.*\n\nCertainty crystallized in her mind. This weapon would be sung of in legends for generations. And Grid had forged it with his own hands. Goosebumps rippled across her skin—the first time she'd felt such pure admiration in... how long? Half a century at least.\n\nA dark smile curved Goldhit's lips. Her perception of Grid shifted fundamentally. He wasn't merely fortunate enough to possess Enhancement Magic. He stood as something far greater.\n\n*Of course. It was obvious from the start.*\n\nThe man was a living legend. A national hero who'd carved out a new kingdom from nothing. A hero to other heroes. Her obsession with Enhancement Magic had blinded her to the broader truth. Now, freed from that narrow-mindedness, genuine respect bloomed.\n\n*A hero who transcends his era. I should greet him with proper courtesy.*\n\nBut.\n\n*I cannot forget my original purpose.*\n\nRespect and necessity were separate matters. She could admire him while still pursuing her goal. Goldhit needed to push Grid toward using Enhancement Magic. She checked his progress on the sixteenth floor and played her trump card.\n\n\"Deploy the Lilith Guardian.\"\n\n---\n\n[You have dealt 1 damage to the target.]\n\n[You have dealt 1...]\n\n[The Sword Born from Enlightenment and Strong Desires has emitted flames. It deals 5,000 fixed fire damage to the target.]\n\nThe Enlightenment Sword possessed a passive effect: 'a certain chance to release large flames with every attack.' Through extensive testing, Grid had determined the probability hovered around thirty percent. As his combo extended, the likelihood increased exponentially.\n\nThe weapon synergized beautifully with Alex's Quick Gloves, which dramatically increased his basic attack speed.\n\nThe flames dealt less damage than the black flames from Belial's power, and enemies with high fire resistance could shrug them off entirely due to the pure fire attribute. But in situations like this, when facing physically resistant opponents? Sometimes these standard flames proved more effective than the black flames, which registered as physical attacks.\n\n*So many item options still to discover.*\n\nGrid's smile stretched wide. What incredible fortune! His intelligence stat had climbed by twelve points already, and now he ascended toward the sixteenth floor. He'd handled every guardian encountered so far without significant difficulty. Still, he refused to grow complacent.\n\n*Something's different here.*\n\n*Snap!*\n\nHe pushed open the door to the sixteenth floor without hesitation and studied the waiting guardian. The physique appeared remarkably small—roughly the size of an average adult male. No immediate sense of threat. But monsters on higher floors were never weaker than those below. Judging by outward appearance would be foolish.\n\n*It reminds me of Braham's golems.*\n\nThe memory surfaced unbidden—that invasion of Reinhardt years ago. Those humanoid golems with deceptively small frames had inflicted the highest casualty counts. Their strength, incomparable to standard golems, remained vivid in his mind.\n\n*This one looks similar. Am I imagining things?*\n\n**[Lilith Guardian]**\n\nGrid examined the name and appearance, then tried identifying the metal composition of its body.\n\n\"Kuk!\"\n\nInstinct moved his sword arm. The guardian had closed the distance with footwork eerily similar to Yangban Garam's Shunpo, materializing directly before Grid's face.\n\n*Peeeeeong!*\n\nShockwaves erupted as the Enlightenment Sword collided with the guardian's fist. A section of wall and ceiling collapsed. Grid ignored the rain of stone debris and counterattacked, landing a blow before raising his sword again. He chained attacks without pause, judging that creating distance would be tactically unsound. He kept the guardian pressured, never granting it breathing room.\n\n*Kaang! Kakakang!*\n\nEach strike dealt one point of damage. Like previous guardians, this one boasted extreme physical resistance. But the construct had no answer for a swordsman who cut and stabbed without fear of being struck. It responded with a right fist when Grid slashed, countered with a left when Grid thrust at center mass.\n\n[You have suffered 1,900 damage.]\n\n[You have suffered 1,780 damage.]\n\n[You have suffered 1,910 damage.]\n\nThe damage accumulated steadily. Despite appearances, Grid was being thoroughly beaten. Yet he showed no irritation, waiting patiently for the flames to trigger.\n\n*Peeng!*\n\nFinally, the Enlightenment Sword blazed crimson.\n\nHowever.\n\n[You have dealt 1,660 damage to the target!]\n\n*What? Why is its fire resistance so high?*\n\nThe guardian's health bar barely scratched. Its total HP pool appeared massive. Relying solely on the flame releases—which now dealt pittance damage—meant this fight could drag on indefinitely. Grid's stamina might fail before the guardian fell.\n\n*Jjeejeeeong!*\n\nThe guardian ignored the Enlightenment Sword's edge, leaped into the air, and lashed out with a devastating kick. Grid's vision filled with the crumbling ceiling as he flew backward.\n\nAnd.\n\n\"Yohohoho... Struggling, are we?\"\n\nOn the eightieth floor, Goldhit clearly saw Grid's eyes waver through her crystal ball.\n\nInitially, she'd felt pure shock. The way Grid had responded to the guardian's first spatial jump—using Blink with perfect timing—had left her stunned beyond admiration. She'd known Pagma's Descendant combined blacksmith and swordsman classes, but never imagined Grid possessed such refined strength and agility.\n\nYes, Grid far exceeded his reputation. Perhaps the empire had drastically underestimated him.\n\n*But.*\n\nResistance neutralized raw power. For Grid to defeat a guardian with exceptional fire resistance, he would need to abandon the sword and turn to magic. Goldhit's anticipation peaked. She waited for Grid to deploy the Enhancement Magic she so desperately sought to study. She still didn't understand—Grid specialized in shattering common sense.\n\n---\n\n*Peok!*\n\n*Kwajajak!*\n\n*It doesn't hurt.*\n\nGrid felt Khan's presence acutely with each blow from the guardian's fists and feet. The work Khan had left behind continued protecting him. Valhalla released thin wisps of smoke every time the guardian struck. Only Grid knew what that smoke presaged.\n\n*Chukakakakak!*\n\n*Peeng!*\n\nGrid carved a line across the guardian's chest while accumulating minor damage, his smile widening.\n\n*Jeeeeeong!*\n\nThe guardian's fist hammered his arm solidly. Simultaneously, green smoke billowed from the armor where metal met flesh. The smoke thickened into fog.\n\n\"This...!\"\n\nGoldhit, who'd been watching intently to catch the moment Grid deployed magic, shot to her feet in shock. She recognized it instantly. That fog was poison!\n\n*Shaaaaah—*\n\nThe toxin Kyleo had perfected through countless experiments filled the sixteenth floor. An option embedded in Khan's Armor. The Lilith Guardian's devastating momentum faltered immediately. The construct couldn't resist the poison. Its health plummeted while its movements grew sluggish. The unidentified metals comprising its body oxidized rapidly, rust spreading like infection.\n\n\"This is ridiculous!\"\n\nA powerful magic weapon *and* magic armor? Complete with reflective damage? Goldhit's composure cracked as Grid efficiently cleared the sixteenth, seventeenth, and eighteenth floors with his armor's assistance. He was entering the nineteenth floor now—the final gateway. If Grid broke through the nineteenth floor, he'd reach the twentieth.\n\nIn the end.\n\n*—Expand the gateways by ten more!*\n\nGoldhit's urgent command resonated through the minds of every magician in the tower. Her disciples protested immediately.\n\n*—Aren't you granting an outsider excessive benefits?*\n\n*—Master, the internal backlash will be severe.*\n\nThe essence of knowledge gained from each floor climbed was monumentally valuable. Ascending the tower held profound significance. The magicians of the Tower of Eternity dedicated years to study, earning the qualification to attempt the climb. Yet Goldhit was showing blatant favoritism to the outsider Grid.\n\nGoldhit addressed her worried disciples sharply.\n\n*—How many people successfully climb the tower even after qualifying? This is a trial, not preferential treatment. No matter how many gateways I open, it means nothing if Grid fails. And Grid...*\n\nHe kept rising. He continued advancing. Even without magic!\n\n\"Dammit...!\"\n\nGoldhit had been trapped behind an insurmountable wall for decades. The lack of progress had transformed recent years into personal hell. Grid represented her only hope. The problem? Grid defied every prediction.\n\n[Grid has reached the 24th floor.]\n\n[Grid has reached the 25th floor.]\n\n[Grid has reached the 26th...]\n\n.......\n\n.......\n\n\"...He's *still* not using magic?\"\n\nWho could imagine the continent's strongest magician sulking like a petulant child? Even Grid, the architect of Goldhit's frustration, couldn't picture it.\n\n[A new gateway has opened. Please challenge up to the 40th floor!]\n\n\"Is this heaven?\"\n\nThe gateways kept generating, and rewards kept flowing! Grid had secured forty intelligence points in mere three hours. The smile refused to leave his face. Pure euphoria."
}