{
  "id": 803,
  "title": "Chapter 803",
  "content": "\"Unbelievable...!\"\n\nThe exclamation didn't come from Goldhit. She stood frozen, stunned by the loss of her Lightning God. No—the shocked cry belonged to Grid as he watched Noe devour what remained of the construct.\n\n[The demonic beast Noe has absorbed half the magic weapon 'Lightning God's' power.]\n[Your intelligence will increase by 3,113 for 3 seconds!]\n[The demonic beast Noe has absorbed half the magic weapon 'Lightning God's' power.]\n[Your intelligence will increase by 3,113 for 3...]\n[The demonic beast Noe has absorbed half the magic weapon...]\n......\n......\n\nNotification windows cascaded across Grid's vision, each one announcing another instance of consumption. While Grid's magic had held the guardian's attention, Noe had latched onto its leg and *feasted*. The durations of Soul Ingestion and Soul Transference refreshed constantly, maintaining Grid's transcendent power.\n\n'First time I've seen this happen.'\n\nGrid recalled Noe's skill descriptions:\n\n[Soul Ingestion Lv. 1]\n[Absorbs half of the target's highest stat and transfers it to your master.\nSkill Cooldown Time: Your own decision.]\n\n[Scratch Lv. 1]\n[Your paws attack and poison the target.\nSkill Cooldown Time: Whenever you like.]\n\nSimple descriptions. Fraudulent effects. Grid alone understood the truth—Noe had *no* cooldowns. The best demonic beast in Hell, coveted even by Great Demons themselves.\n\nYet in all their time together, Grid had never truly witnessed this ability in action. Noe occasionally used Scratch in rapid succession, but Soul Ingestion? Never more than once per target.\n\n'I'd completely forgotten.'\n\n*Lick lick!*\n\n\"...\"\n\nNoe ate with obvious relish, his round bottom swaying as he chewed the Lightning God's remnants. Tears of joy leaked from his eyes.\n\nA hypothesis formed in Grid's mind. 'Could it be... the reason Noe never used Soul Ingestion repeatedly...'\n\nHad the previous targets simply not tasted good enough?\n\n'So he'd only eat a little? No, that can't be—'\n\n\"Master! So delicious, nyong! Can keep eating even though full!\"\n\n\"...\"\n\nThe hypothesis crystallized into reality. Grid's shoulders sagged. During every crisis, every desperate moment, this selfish cat had *held back* because the food wasn't appetizing enough?\n\n\"Typical beast...\"\n\nCreatures remained slaves to their instincts.\n\nGrid clicked his tongue and swept the area for item drops, equally enslaved by his own greedy nature. Unfortunately, the Lightning God left only its corpse—same as the previous guardians.\n\n\"They could at least drop *something*.\"\n\nHis gratitude for the free intelligence boosts had already evaporated. Typical Grid.\n\nDid Noe sense his master's disappointment?\n\n\"Nyang...! Nyaaaaong!\" \n\nThe cat suddenly reared up on his hind legs, pawing the air like a tiny, threatening bear.\n\n...Any observer would have found it adorable. But something significant was happening.\n\n\"W-What? What's wrong?\"\n\nHad he eaten too much? Grid rushed forward, hands hovering over Noe's distended belly. \"Going to burst? Need to throw up?\"\n\n\"Nyaaaaong!\" Noe shook his head violently.\n\nGrid glimpsed the pink pads of Noe's feet. \"Then what's with the sudden crazy act?\"\n\n\"Kyaong! Am best demonic beast of Hell! Master is crazy one, nyong!\"\n\n\"...\"\n\nA rebellion? Grid stumbled backward as brilliant light erupted around Noe's body—intense enough to sear his vision.\n\n'What the—'\n\nThe radiance peaked, then gradually receded. When Grid could see again, his jaw dropped. \"N-Noe!!\"\n\n\"Nya...! Nyaaaaong!\"\n\nNoe crouched like a straining toddler, legs splayed, screaming through the transformation. His black fur lightened, brightened. The small horn on his forehead split, then split again.\n\n\"Nyaaaaong!\" \n\nThe roar held new depth. Noe's fur lengthened, shifting to lustrous gold. His head rounded. The horns, now divided into four, became delicate white points.\n\n\"...Why did you get *cuter*?\"\n\nBecause that's exactly what had happened. The evolution made Noe more adorable, more beautiful—a perfect pet that anyone would covet. He looked like a species deliberately bred across generations to satisfy human aesthetic preferences.\n\nHard to even call him a 'demonic beast' anymore. \n\n*Had he devolved?* \n\nGrid's anxiety spiked. Then he noticed the sparks dancing across Noe's body—identical to those that had wreathed the Lightning God.\n\n[The demonic beast 'Noe' has successfully evolved!]\n\n[**Name:** Noe  \n**Species:** Memphis  \n**Level:** 1 (0/10,000)  \n**Affinity:** 100/100  \n**Health:** 10,000/10,000  \n**Physical Attack Power:** 160  \n**Magic Attack Power:** 160  \n**Defense:** 160  \n**Magic Resistance:** 160  \n**Attribute:** Dark, Lightning  \n**Status:** Narcissistic  \n*(Will develop further, nyang! Will become stronger like best demonic beast of Hell! Nyahahahat!!)*  \n**Skills:** Fluidization (S), Scratch (S), Soul Ingestion (SSS), Lightning Discharge!! (SSS)]\n\n[**Lightning Discharge!! Lv. 1**]  \n[Electricity discharges when non-master entities approach. Attacks up to 10 enemies with 10x magic damage and very high chance of electrical shock.  \n**Cooldown Time:** None]\n\n\"...\"\n\nA massive evolution. Noe's stats had multiplied three to sixfold compared to... when Grid first obtained him. Compared to level 1.\n\nBack to level 1.\n\n\"Nyahahat! Master! This body cool, nyong? Enough to be captivated!\" Noe preened, licking his chest fur with a tiny pink tongue.\n\nGrid's eye twitched. \"...Is this a joke?\"\n\n\"Nyang?\"\n\n\"*Why*—\" Grid's voice cracked. \"Why did you reset to level one?!\"\n\nThe Overgeared Skeletons were difficult enough to train, their levels stagnating because every enemy Grid faced vastly outclassed them. Leveling them required visiting beginner zones—time Grid simply didn't have.\n\nBut Noe had been different. They'd grown together from the beginning. Recently, Noe had reached level 300. Now, thousands of stat points had collapsed into mere hundreds.\n\nYes, Noe's potential had increased dramatically. But years of progress, *erased*.\n\n\"Okay, Master. Feed lots of delicious food like today, will quickly become strong again. Cheer up, nyong. Treat to delicious food!\"\n\n\"...Delicious like *today*?\"\n\nInformation surfaced in Grid's memory.\n\n[**Thunder Stone**]  \n[A mineral produced only when the Great Demon Astaroth manifests in the mortal world.  \nBestows lightning attribute to items. Also excellent feed for demonic beasts.  \nThe demonic beast will be extremely pleased.  \n**Weight:** 5]\n\n\"...\"\n\nYears ago, Grid had battled Prince Ren of the Eternal Kingdom. After defeating Ren's archer, Ferrell, Grid claimed the Thunder Bow—a family heirloom. Which Grid had immediately disassembled without sentiment, obtaining three Thunder Stones.\n\nThe description explicitly stated demonic beasts would enjoy them. Grid had never considered feeding them to Noe.\n\nFor good reason. This wasn't about affection—it was common sense. Who would waste a precious mineral that only appeared when a Great Demon entered the mortal world?\n\nCertainly not on a pet.\n\n'...Actually, Nyangmong would. Wait—'\n\nThe thought struck like lightning. Thunder Stones symbolized Astaroth's presence. And they existed here, in the Empire.\n\n\"Then Gyuratan is...\"\n\nAstaroth. Grid's slow mind finally caught up.\n\n'Destroy the Thunder Stone.'\n\nHis experience with Hell Gao had taught him the lesson. Destroying the Thunder Stone atop the magic tower would weaken Gyuratan—and weakening Gyuratan meant saving Mercedes.\n\n\"Noe! Time to eat!\"\n\n\"Nyang?\"\n\nPurpose clarified, Grid sprinted toward the upper staircase. Someone waited there.\n\n\"I am pleased to see the Overgeared King.\"\n\nA child. A girl no older than four or five, greeting him with perfect courtesy. Grid read the name above her head and froze.\n\n\"Goldhit...?\"\n\n*The Magician King.* The continent's strongest mage was a *little girl*?\n\nConfusion didn't begin to describe Grid's mental state.\n\nMeanwhile, at the imperial palace, others experienced far worse confusion...\n\n\"Demonkin...? How dare a mere demonkin invade the palace!\"\n\n'Kuk...! Why are those greedy mages tampering with the Thunder Stone?!'\n\nGyuratan—Great Demon Astaroth—felt his power destabilize as his identity became exposed. Mercedes recognized the opening, unaware that Grid had created it.\n\nBut opportunity came paired with danger. Without armor or weapon, Mercedes couldn't withstand Astaroth's assault. The demon scattered the knights like leaves and carved through Mercedes' chest.\n\n\"Mercedes?\" \n\nThe Emperor's voice broke. She had defended him—even after everything he'd done to her. His eyes trembled as blood painted his vision crimson."
}