{
  "id": 804,
  "title": "Chapter 804",
  "content": "The girl on the stairs barely came up to Grid's hip. When his eyes flicked to the name floating above her head, his brow furrowed.\n\n*Goldhit?*\n\nThis child couldn't possibly be the Magician King.\n\n\"What's your name?\" Grid kept his voice gentle. \"Why are you here alone? Where are your parents?\"\n\nThe girl's expression was guileless—until she laughed. The sound that emerged was wrong, ancient, like stones grinding together. \"Yohoho... I am Goldhit. Some call me the Magician King.\"\n\nGrid's jaw went slack. The legendary sorceress was supposed to be over one hundred and twenty years old. Even elves, famed for their longevity, aged more visibly than this.\n\n\"Magic,\" he said slowly. \"This is magic.\"\n\nRed pigtails bounced as Goldhit nodded. \"Correct. Magic creates miracles. I have spent my life pursuing the ultimate miracle, and this\"—she gestured to herself—\"is the result. Yohohoho.\"\n\nThe Tower of Eternity. The name suddenly made terrible sense.\n\n*She wants to live forever.*\n\nA goal that defied nature itself. No doubt countless people had condemned her for it, pointed fingers and called her mad. But Grid found he couldn't judge. Hadn't he wished desperately for Khan to live? Didn't the thought of Irene's eventual death fill him with dread?\n\n\"Impressive,\" Grid admitted. \"Using magic to restore your youth—\"\n\n\"Youth?\" Goldhit's smile turned cryptic. \"Your Majesty, you're more innocent than I expected. Yohoho...\"\n\n\"...What?\"\n\nSomething was wrong. If she hadn't regained her youth, then what exactly was he looking at? The sense of wrongness intensified, revulsion coiling in his gut. Before he could pursue the thought, Goldhit shifted topics.\n\n\"Thank you for answering my invitation. It's an honor to host the greatest hero of our time.\" Despite her childish appearance, she clasped her hands behind her back—an old woman's gesture, impossible to shake.\n\nGrid cut to the point. \"Why did you summon me?\"\n\nIn truth, he was irritated. The hidden quest had ended the moment Goldhit appeared, robbing him of potentially thousands of intelligence points. Just a bit more, and he could have reached 2,500—enough to learn Fireball (Enhanced).\n\n\"I want you to take me as your disciple.\"\n\nGrid blinked. \"...What?\"\n\nThe continent's greatest magician wanted to be *his* student?\n\n\"You want to learn blacksmithing?\" The question came out flat with disbelief.\n\n\"No, that's impossible.\"\n\n*I misheard.* Grid rubbed his temples. The exhaustion since Khan's death must be affecting him. Maybe he needed those energy supplements after all.\n\n\"I want to learn magic,\" Goldhit continued, \"not blacksmithing.\"\n\nGrid's expression turned thunderous. \"Did you drag me here for a joke?\"\n\nThe greatest magician on the continent wanted a blacksmith to teach *her* magic? Even a child wouldn't make such an absurd—\n\n'Has her brain regressed too?' He didn't bother hiding his disgust. As the Overgeared King, he wouldn't tolerate this mockery. It was an insult to his entire kingdom.\n\n\"Don't be offended.\" Goldhit's smile never wavered. \"I'm completely serious. I want to learn Braham's enhanced magic from you.\"\n\nThe name struck Grid like a physical blow.\n\n*Braham.* How did she know that name? How did she know he'd learned those techniques?\n\nThen it clicked. 'She was watching when I fought the Lightning God.'\n\nOf course. The system designated Goldhit as a \"powerhouse of the time\"—not a legend yet, but close. Someone of her caliber would recognize Braham's signature magic.\n\n\"Naturally, I'm not asking for charity.\" Goldhit's childish features arranged themselves into something shrewd. \"If you teach me, you'll be compensated. Handsomely.\"\n\nGrid waited.\n\n\"I've served three generations of emperors. I've accumulated wealth and influence beyond measure.\" She spread her hands. \"Whatever you desire, I can provide. Name your price. Yohohoho.\"\n\n\"The thunder stone.\"\n\nGoldhit's smile froze.\n\n\"The one on your roof,\" Grid continued. \"Give it to me.\"\n\n\"That's...\" Her first genuine reaction. \"That's asking too much.\"\n\n\"You know what it is, then.\"\n\n\"Of course I do. You're a legendary blacksmith—naturally you'd recognize the thunder stone's value. But surely you understand it's priceless. Nothing in the world compares. It can only be obtained when a great demon descends—\"\n\n\"You *know*.\" Grid's voice went cold. \"You know the thunder stone is tied to a great demon, and you kept it? You just... left it there? Do you have any idea what great demons are capable of?\"\n\n\"The stone belongs to Astaroth, who lost his flesh to Muller and was stripped of his status as a great demon. He's hardly a threat now.\"\n\n\"...\"\n\n\"The thunder stone contains enormous magic power. It's invaluable for advancing both magic and weaponry. Why would I destroy such a treasure over one weakened demon?\"\n\nGrid laughed—sharp and bitter. *Weakened?* If only Goldhit knew Astaroth had been playing in the empire for a decade. When the truth came out, her reputation would crumble.\n\nAn alarm shrieked through the tower.\n\n\"Master!\" Raji burst into view, robes flying. \"There's an emergency at the imperial palace!\"\n\n\"I know.\" Goldhit reached into empty air. Space rippled—similar to a player's inventory interface—and a white robe materialized. She shrugged it on and glanced at Grid. \"We'll have to continue this conversation later.\"\n\n*Perfect.* Grid would smash the thunder stone while she was gone. The disturbance had to be Gyuratan—which meant Mercedes was in danger.\n\n\"Don't even think about it.\" Goldhit read his intent easily. \"No one accesses the thunder stone without my permission. You'll only make me angry.\"\n\nThe stone was protected by elaborate traps and five Lightning Gods. Even Astaroth himself couldn't break through.\n\n\"I'll return quickly. Wait here like a good guest. Yohohoho...\" Her bizarre laugh echoed as her small form vanished in a flash of light.\n\nThe moment she disappeared, Grid bolted for the stairs. His destination: the roof. He'd destroy the thunder stone for Mercedes' safety, then collect the fragments.\n\nBut of course it wouldn't be that simple.\n\nThe next floor opened into a massive labyrinth. Endless corridors branched in impossible directions, walls shifting subtly whenever he looked away. A magician approached, expression obsequious.\n\n\"Goldhit asked me to see to your comfort, Your Majesty. Please, let's return downstairs. I'll attend to your every need.\"\n\n\"And if I want to go up?\"\n\nThe magician's smile turned condescending. \"The Tower of Eternity isn't a zoo. Not just anyone can climb it.\"\n\n\"Really?\" Grid's eyes narrowed. \"Because from where I'm standing, you're the only animal I see.\"\n\n\"...\"\n\nCalled cattle by some smug tower lackey. The peak of two billion users, reduced to livestock. \n\nGrid's hand moved. The Enlightenment Sword materialized, black flames writhing along its length. His fighting energy—built up during the encounter with Goldhit—surged through his veins.\n\n\"100,000 Army.\"\n\nThe magician's eyes widened.\n\n\"Massacre Sword.\"\n\n\"Wait—!\"\n\n**CRACK.**\n\nRed and purple energy blades tore through reality. The maze simply... *ceased*. Stone exploded. Magical wards shrieked and shattered. A clean line of destruction carved straight through the Tower of Eternity's ancient defenses.\n\nWhen the dust settled, a gaping wound marred the previously immaculate structure.\n\n\"What...\" The magician stared, face ashen. \"You destroyed a master-level trap with raw force? And that technique—100,000 Army Massacre Sword—you're the Undefeated King's descend—gurk!\"\n\nGrid's blade punched through the man's chest.\n\nNo witnesses.\n\nHe stepped over the corpse and climbed.\n\n***\n\nMercedes' scream rang through the reception hall.\n\nGyuratan had never been aiming for the emperor. He'd known from the start that targeting Emperor Juander would force Bain to intervene—and Bain would only move if the emperor was directly threatened. So instead, he'd gone for the First Knight.\n\n\"Sir Mercedes!\" Knights flooded into the hall, faces twisted with rage and horror. They surged forward as one.\n\n\"Don't.\" Gyuratan's hand tightened around Mercedes' throat, lifting her off the ground. \"Move, and she dies.\"\n\nBlack veins spread from where his blade had cut her. Demonic energy, poisoning her from within.\n\nThe knights froze. Emperor Juander's voice cut through the tension.\n\n\"First Knight. You have permission to arm yourself.\"\n\nTwo knights reacted instantly, hurling their swords through the air.\n\n*Shink! Shink!*\n\nSteel flashed. Gyuratan jerked as both blades found marks along his torso.\n\n\"Kuh...!\" His grip loosened.\n\nMercedes dropped into a crouch, immediately tearing away the lower portion of her blood-soaked dress. The fabric fell away, freeing her legs for combat. She rose, positioning herself between Gyuratan and the emperor.\n\n\"Twelve years ago,\" Mercedes said, voice steady despite the poison coursing through her, \"you murdered the Red Knights and their families. People who devoted everything to this empire.\"\n\nGyuratan said nothing.\n\n\"You deceived His Majesty. You deceived the people.\"\n\nSilence.\n\nThe hall held its breath. Gyuratan stared, seemingly dumbfounded. Tears streamed down Mercedes' face.\n\n\"You destroyed Piaro's honor.\" Her hand found her sword hilt. \"I will never forgive you.\"\n\nEvil would not escape justice."
}