{
  "id": 805,
  "title": "Chapter 805",
  "content": "Mercedes drove Gyuratan back with relentless strikes—one blade flashing like lightning, the other stinging like a wasp. Steel parted beneath her assault. Blood sprayed from Gyuratan's lips as her twin swords carved through his defense, binding his limbs in a web of steel.\n\n*By a mere human—!*\n\n\"Two Storms.\"\n\nThe air itself seemed to crack.\n\nMercedes unleashed her signature technique, each strike amplified by sword energy that extended her reach unpredictably. She darted in, blades singing, then retreated three meters before surging forward again. Light, clean, devastatingly fast.\n\n\"Khh—!\" \n\nGyuratan's arms trembled as he desperately parried. The changing attack distance—now close, now far—left him unable to find his rhythm. Everyone watching knew how this would end.\n\n*As expected!*\n\nThe Fourth Knight was strong, entrusted with protecting the Red Knights themselves. But the First Knight stood at the pinnacle of their order. There could be no contest. Mercedes' victory was inevitable.\n\n\"Ah...\"\n\n\"Sir Mercedes...!\"\n\nHere stood a noble knight defending the very emperor who had once suppressed her, vindicating the old hero everyone had condemned as a traitor. Blood-soaked and magnificent, Mercedes carved justice into Gyuratan's flesh. Several knights wept openly, overcome with pride that their idol fought beside them.\n\nWhich made what happened next all the more devastating.\n\n**BOOM!**\n\n\"—!!\"\n\nMercedes' body hurtled through the air.\n\n\"Sir Mercedes!\"\n\nGyuratan abandoned swordsmanship entirely. He was no longer the Fourth Knight—he was a great demon. His counterattack erupted with such violence that the knights' screams echoed through the great hall. Yet Mercedes heard nothing. The world had gone silent as Gyuratan's lightning explosion consumed her.\n\n*Ah...*\n\nTime crawled. Lightning demonic energy rose from Gyuratan's body like a heat shimmer. The hall filled with crackling power until it seemed the very air would split. The emperor's face contorted in an expression Mercedes had never seen him wear. Everything moved so slowly—one second became a minute, ten minutes, an hour...\n\nImages flooded her mind. Red-armored knights. Broad backs standing between her and danger. Warm smiles and patient instruction from those who had led her on countless battlefields. The past washed over Mercedes as Gyuratan's lightning-wreathed fist closed the distance.\n\n*\"Are your eyes bad? How can that be? If you can see through them, feel free to look. There is no darkness or lies in my heart.\"*\n\nHer cursed vision—the power that had sometimes made even her parents flinch. Piaro had accepted it completely. She'd been so young then. Young enough to meet his gaze directly. Young enough to believe when he showed her there was nothing to fear. And yet...\n\n*I'm so... sorry.*\n\nShe hadn't trusted him. When everyone screamed \"traitor,\" she'd believed them. She'd abandoned him to that stigma without a fight.\n\n*I was the traitor.*\n\n**CRASH!**\n\nMercedes smiled bitterly as she struck the floor. Lightning erupted across her body.\n\n\"Sir Mercedes!\"\n\n\"You bastard! Stand down!\"\n\nKnights rushed to her aid, weapons blazing with technique. But the Gyuratan of their memories no longer existed. This creature before them operated on another level entirely.\n\n\"That humans dare breathe in my presence is insult enough.\"\n\nThat damned Sword Saint Muller's face flashed through his mind. Gyuratan concentrated his lightning. Then—\n\n\"W-What—?\"\n\nThe knights' swords, their armor—their very bodies—lurched toward the lightning. Resistance was futile. Like opposite magnetic poles, Gyuratan's lightning generated an attractive force that metal could not deny. This was why he'd suddenly overwhelmed Mercedes.\n\n*This is bad.*\n\nBain's sole duty was protecting the emperor, yet his tactical mind raced. Why had a great demon manifested in the heart of the palace? Even for Bain, this opponent would be difficult.\n\nGreat Demon Astaroth. The empire had predicted his eventual emergence fifteen years ago when the thunder stone first appeared. But something was wrong. The longer a great demon survived, the more powerful the thunder stone became—meaning greed had led them to this moment. What they hadn't anticipated was Astaroth manifesting inside the imperial palace itself.\n\n\"Leave while the knights buy time,\" Bain said.\n\nThe seven dukes had already returned to their territories after the Overgeared King's diplomatic visit. Only the Five Pillars remained. But Bain judged them unnecessary.\n\nHe might struggle, but Goldhit could easily overpower this weakened great demon. The emperor shared this assessment. The Overgeared King had hunted a complete great demon, and the Overgeared Kingdom was no match for the empire. Naturally, the mighty empire could handle a weakened specimen.\n\nYet the emperor hesitated, gaze fixed on Mercedes' crumpled form. Would she survive until Goldhit arrived?\n\nUnlikely.\n\nThe emperor wanted answers about what had truly happened twelve years ago.\n\n\"Bain.\"\n\n\"Your Majesty.\"\n\n\"Save Mercedes.\"\n\nBain's eyes narrowed. Strange, given how the emperor despised the Red Knights. But questioning orders wasn't Bain's role. Only obedience mattered.\n\n\"Understood.\"\n\nBain vanished from the emperor's side, reappearing behind Gyuratan beside Mercedes' broken body.\n\n\"Bain...!\"\n\nGyuratan snarled even as he dragged knights toward him with his lightning. Bain's presence demanded wariness. But Bain simply gathered the battered Mercedes into his arms and shook his head.\n\n\"I have no interest in you.\"\n\nHe turned to leave.\n\n\"But **I** am interested!\"\n\nGyuratan blocked his path. He seized the magnetized knights like a weapon and hurled the mass of bodies at Bain. Mercedes had wasted fifteen years of his suffering. She would pay for his rage.\n\n\"N-no...\"\n\n\"Tch.\"\n\nBain had been about to slice through the incoming projectile when Mercedes caught his wrist. He changed tactics, shifting to evade. But the moment he prepared to blink back to the emperor's side, Gyuratan's blade came screaming through the air.\n\nThe sword aimed for Mercedes. Bain intercepted with his shoulder, then drove his own blade toward Gyuratan's exposed abdomen. Steel should have bitten deep. Instead, it stopped mid-thrust.\n\nThe lightning demonic energy that had been attracting metal now repelled it with equal force. Bain's blade hung frozen in the air as Gyuratan's next strike descended.\n\nThe battle intensified. Gyuratan's swings accelerated while Bain performed an acrobatic dance, using the small shields mounted on his shoulders and wrists to deflect. Both the emperor and Bain realized the same thing—this great demon was far too strong to be called \"weakened.\"\n\n*Was he high-ranking originally?*\n\nMost likely. The great demon Grid's party had hunted was among the lowest tier. If Astaroth ranked higher, he'd surpass even Belial despite having lost his body.\n\n*And furthermore...*\n\nThe emperor noticed something troubling—as time passed, the thunder stone's power grew. Did the stone's growth mean the demon's growth as well?\n\n\"Where is Goldhit?\"\n\nThe emperor's voice held an edge of panic.\n\n*Am I too late?*\n\nMercedes' body grew cold in Bain's arms. Death's shadow crept closer. Then—\n\n**BOOM! BOOM! BOOM!**\n\nA meteorite punched through the great hall's ceiling—Meteor Strike, signature spell of humanity's strongest magician. It paled beside true Meteor, which summoned multiple meteorites. Meteor Strike conjured only a small one.\n\nBut only Braham in all human history had mastered full Meteor. The spell was synonymous with great demons themselves. That a human could wield even Meteor Strike was already remarkable, and its power was enough to shatter any defense.\n\n\"Apologies for my tardiness. Yohoho...\"\n\nA young girl descended through the ruined ceiling, hair whipping in the storm as all eyes turned to her. \"Tsk, tsk. Foolish demon. You should have stayed hidden.\"\n\nSuch a waste of a thunder stone.\n\nGoldhit reached toward the meteorite-struck Gyuratan. Magic power beyond human category gathered at her fingertips. But it meant nothing if the spell never manifested.\n\nBlack lightning lanced down from the sky and struck her dead-center. She collapsed without even a scream.\n\nThe Magician King was defeated the instant she arrived. The lightning storm raged on. Astaroth grew stronger by the second. Rain fell like judgment itself.\n\n---\n\nSimultaneously, in the Tower of Eternity...\n\n\"What the hell...?\"\n\nGrid's ascent had been remarkably swift compared to the Behen Archipelago. He reached the 79th floor to find something that made his blood run cold—a massive pen. Young boys and girls huddled inside like livestock awaiting slaughter, filthy straw scattered across the floor.\n\n\"You sick bastard...!\"\n\nGrid understood what had felt wrong during his conversation with Goldhit. She hadn't become younger through natural means.\n\nShe'd *stolen* it.\n\n\"Ugh—!\"\n\nHow long had this atrocity continued? The scene turned Grid's stomach. He looked at the children—their empty gazes that understood nothing—and rage ignited in his chest.\n\nNo more hesitation.\n\nGrid ascended to the 80th floor. The glass ceiling housing the thunder stone dominated his view.\n\n\"Discovery.\"\n\n\"Intruder.\"\n\n\"Discovery.\"\n\n\"Repel. Repel. Repel.\"\n\nFive lightning gods activated. Goldhit believed them the ultimate defense for the thunder stone.\n\nBut—\n\n\"**Divinity.**\"\n\n[Show off the virtues of a blacksmith who deserves to be praised as a god. The casting time and cooldown time of all blacksmithing skills will be removed. Applicable up to two times.]\n\n\"**Item Combination.**\"\n\nThe power he'd gained from forging three myth-rated items awakened. Not even five lightning gods could stop him now."
}