{
  "id": 806,
  "title": "Chapter 806",
  "content": "**[The heavenly gods cannot look away. After forging three sets of battle gear worthy of divine envy, your dignity rivals that of the gods themselves.]**\n\nThis message had appeared when Grid completed the myth-rated White Tiger Sword. It marked the first \"special event\" triggered by crafting three mythic items—his reward being the skill **Divinity**.\n\n**[Divinity - Blacksmithing Version]**\n\n**Elevates your existence to near-divine status. Removes all casting time and cooldown from blacksmithing skills. Can be activated up to twice per use.**\n\n**Resource Cost:** None  \n**Cooldown:** 23 hours\n\nGrid stared at the description. His first thought?\n\n*Fuck.*\n\nBecause here was the problem: blacksmithing skills were production-based. For ordinary smiths, Divinity would be godlike—press the \"Production\" button and instantly complete an item. But Grid's skills were **passive**. He had no production button. Worse, Pagma's Swordsmanship was classified under sword techniques, meaning Divinity didn't affect it at all.\n\nIn short, the benefits were... underwhelming.\n\nHis fury had burned for hours after acquiring it.\n\n\"Item Combination.\"\n\nEventually, Grid calmed down and took inventory of every blacksmithing-related ability he'd obtained through hidden pieces. Two stood out: **Item Combination** and **Item Transformation**. Both were transcendent if used correctly, but their cooldowns were crippling—especially Transformation. Combination's long casting time made it impractical in combat.\n\nBut Divinity eliminated those weaknesses. No cast time. No cooldown.\n\nGrid's lips curved upward. This changed everything. With this, his power approached something truly **invincible**.\n\n**[Belial's Staff and the Lightning Sword Born from Enlightenment and Strong Desires will be merged!]**\n\nNormally, Grid combined similar items—sword with sword, armor with armor. The combinations were logical, predictable. But now? Now the system itself would handle the synthesis through Divinity, optimizing the fusion automatically.\n\nWhich meant he could try something insane.\n\nCombining a **sword** and a **staff**.\n\n*Flash!*\n\nBoth weapons tore free from his grasp, spiraling into the sky. Brilliant light enveloped them as they began to merge, a spectacle that would've stopped any normal observer in their tracks. The lightning gods charging toward Grid, however, showed zero reaction. Emotionless constructs, they existed only to destroy him.\n\nThen—\n\n**[Item Combination complete!]**\n\nThe radiance faded. The fused weapon dropped into Grid's waiting hand.\n\nIts new form was... striking. The staff now served as a two-meter handle, with the sword forming a bladed tip. Total length: three meters. A spear-sword hybrid, crackling with suppressed energy.\n\n---\n\n**[Belial's Staff + Lightning Sword Born from Enlightenment and Strong Desires]**\n\n**Rating:** Myth (Transcendent)  \n**Durability:** Infinite  \n**Physical Attack Power:** 3,490  \n**Magic Attack Power:** 2,253  \n\n* **+30% Intelligence**\n* **+20% Physical Attack Power**\n* **+40% Magic Attack Power**\n* **+30% Fire Damage**\n* **+30% Dark Damage**\n* **+15% Lightning Damage**\n* **+50% Damage vs. Sacred Beings**\n* **Moderate chance:** Fire Emission (Large)\n* **Low chance:** Illusion Release\n* **Low chance:** Red Lightning Bolt\n* **★ Moderate chance:** Black Flames Explosion\n* **+30% Casting Speed**\n* **Triple-cast magic** (proficiency required). When Fire + Dark magic are cast together, both gain **+200% power**.\n* **Automatic 5,000 HP shield per spell cast.** Enemies striking the shield suffer **Fear** and **Slow** debuffs.\n* **★ Passive triggers** (fire, illusions, lightning, black flames) **count as spell casts**.\n* **+20% Magic Critical Chance**\n* **+150% Magic Critical Damage**\n* Skill: **Enlightenment**\n* Skill: **Ecstasy of Desire**\n* Skill: **Belial's Power**\n\n---\n\n\"...What?\"\n\nGrid blinked. The attack stats were *slightly* lower than the individual weapons—probably because merging a sword and staff disrupted their ideal balance. The option values hadn't changed much either.\n\nExcept for **one thing**.\n\nHis eyes locked onto the new mechanic:\n\n**[Every spell cast generates a 5,000 HP shield automatically. Targets striking the shield are inflicted with Fear and Slow.**  \n**★ Passive triggers (fire, illusions, lightning, black flames) count as spell casts.]**\n\nThat single addition transformed the weapon from powerful to **utterly broken**.\n\nThis was the true power of **myth + myth**.\n\n**[The God of Blacksmiths is shocked. He feels envious of a mortal's skill.]**\n\n**[Other gods laugh at the God of Blacksmiths.]**\n\n**[Affinity with the God of Blacksmiths decreased by 1.]**\n\n**[Warning: If affinity reaches -10, all items crafted (Legendary rating or higher) will be cursed.]**\n\n\"Ah, **shit**...\"\n\nGrid cursed for the first time in ages. Every gain came with a catch. Big reward, big risk. Just like how he'd been nerfed after crafting five legendaries.\n\n*Jealousy? Curses? What kind of petty god is this?*\n\nLosing affinity for merging two **myth-rated items** was insane. If he didn't figure out how to restore favor, the curses would pile up until his creations became worthless.\n\n\"This is ridiculous. Absolutely ridiculous.\"\n\n*Damn bastard.*\n\nThe lightning gods closed in while Grid silently raged at the spiteful deity. His response was immediate.\n\nHe swept the three-meter spear-sword in a wide arc, striking all five constructs simultaneously. One detonated in flames. Another convulsed as a red lightning bolt speared through it. And around Grid's body, translucent dark shields shimmered into existence.\n\n**[Shield created: 5,000 HP (Belial's Shield)]**\n\n**[Shield created: 5,000 HP (Belial's Shield)]**\n\n**They stacked.**\n\nIn an instant, Grid gained **10,000** bonus health. The remaining three lightning gods lashed out with crackling fists.\n\n**[You have taken 3,900 damage.]**\n\n**[Target resisted Fear. Target failed to resist Slow.]**\n\n**[You have taken 3,710 damage.]**\n\n**[Target resisted Fear. Target failed to resist Slow.]**\n\n**[You have taken 4,050 damage.]**\n\n**[Target resisted Fear...]**\n\nGrid watched the once-blinding-fast constructs slow to a crawl. His grin widened.\n\n*This is broken.*\n\nWhether they resisted the debuffs didn't matter. What mattered was the **shield generation**—overlapping, infinite, **mana-free** protection.\n\n*More. I need to make **more**.*\n\nHis motivation surged. He thrust the hybrid spear forward, leveraging both its physical and magical attack power.\n\n*I'll combine **everything**.*\n\nThe possibilities flooded his mind—dozens of item pairings he could now exploit thanks to Divinity. An infinite arsenal. True Overgeared dominance. His excitement **burned**.\n\nThe five lightning gods traded blows with him, but the outcome was never in doubt. Grid's magic power tore them apart piece by piece, while he remained untouched. Fire emissions. Red lightning. Black flames—the passives triggered constantly, layering shield after shield. As the battle dragged on, his protection didn't **decrease**—it **increased**. Soon it surpassed **50,000 HP**.\n\n\"Kuhahahahaha!\"\n\nPure, unfiltered **joy** exploded through him.\n\nThis was what it felt like to cheat. This was the pinnacle of Overgeared. He was so exhilarated he could barely contain it. If the lightning gods had emotions, they'd be screaming at the unfairness of it all.\n\n\"Nyahaha!\" Noe was equally ecstatic, gorging himself on thunder stone fragments. With every core he devoured, his level skyrocketed—nearly reaching **100** from feasting on five gods at once.\n\nGrid crushed the final lightning god's head. The duration of Item Combination expired, and the fused weapon split back into staff and sword. He looked up at the glass ceiling.\n\nAt the enormous **thunder stone** crackling above.\n\n\"Let's finish this.\"\n\nHe drove his blade upward.\n\n**Kuwuoooong.**\n\nThe black clouds vanished as if they'd never existed. Thunder ceased. Lightning died. The torrential rain stopped. Light returned to the gray world.\n\n---\n\n***\n\n\"...!!\"\n\nGoldhit's eyes snapped open.\n\nShe bolted upright, heart pounding. *Was it all a dream?* But no—Gyuratan and Bain were still locked in combat. This was real.\n\n*Dammit.*\n\nShe'd passed out in front of the **Emperor**. The humiliation burned. She, the Magician King, rendered unconscious before even engaging. Her face flushed crimson.\n\n*Why didn't I just Teleport straight to the palace?*\n\nShe'd wanted to analyze the great demon's abilities first—identify his affinities, his techniques. She'd deduced Astaroth specialized in **darkness** and **lightning** magic, possibly augmented with swordsmanship. So she'd reinforced her body with defensive spells and erected a barrier.\n\nShe'd done everything right.\n\nAnd yet she'd been struck down the **moment** she arrived.\n\nGoldhit clutched her head, forcing herself to remember. \n\n*I wasn't hit by **him**.*\n\nThat's right. The spell that knocked her out hadn't come from Gyuratan.\n\n*There's another enemy here.*\n\nSomeone—or something—had attacked her from behind. An opponent skilled enough to penetrate her omni-element barrier and remain undetected.\n\n*Could it be another great demon?*\n\nHer throat tightened.\n\nThen—**crack**—lightning split the sky.\n\n\"Wait...\" A chill raced down her spine. \n\n*The storm itself is the magic.*\n\nThere was no caster to detect because the **entire thunderstorm** was an attributeless spell. The source was invisible.\n\n\"Is this Astaroth's domain...?!\"\n\nHer blood ran cold. If this level of environmental control was possible, then Astaroth could be a **single-digit great demon** at full strength.\n\nNearby, Bain's sword was wrenched from his grip by a surge of demonic energy, spinning uselessly into the air. Defenseless, he couldn't block Gyuratan's follow-up strike.\n\n\"...\"\n\nThe great hall was in ruins. The **First Knight's Aide** was battered and bleeding. The Five Pillars lay defeated. Behind them, mountains of corpses—soldiers and knights alike—painted a picture of absolute devastation.\n\nThis was the overwhelming might of a **great demon**.\n\nGyuratan opened his mouth to speak—perhaps to declare humanity's futility—\n\n**Swaaaaaah.**\n\nThe rain stopped.\n\nAll at once, the deluge ceased. The lightning storm dissipated. The roiling demonic energy around Gyuratan's body thinned to mist.\n\n*Don't tell me...*\n\nGoldhit's mind flashed to a single man: **Overgeared King Grid**.\n\nThen—\n\n*Clink.*\n\nMercedes rose.\n\nUsing a shattered blade as a crutch, the **First Knight** forced herself upright. She was gravely wounded—one breath away from death. Standing seemed to take all her remaining strength. \n\nSo why?\n\nWhy did the Emperor feel such **unshakable trust** when he looked at her?\n\n*This* was the value of a knight."
}