{
  "id": 807,
  "title": "Chapter 807",
  "content": "For a Great Demon, eternity meant something different. Fifteen years should have passed like a blink—yet for Astaroth, every single day had been agony. The human body his contract bound him to was pathetically fragile, a prison of weakness. He'd spent a decade and a half walking on glass, grateful each night he survived another sunrise.\n\n\"Fifteen years,\" he hissed. \"Fifteen years of this.\"\n\nThe shackles of his contract would only break when his summoner's wish came true. He'd survived Piaro. Outlasted Asmophel. Two legends of the empire's golden age, and he'd endured them both. All those years of swallowing blood, of choking down his true power—\n\n\"And you ruined *everything*!\"\n\nHis gaze locked on Mercedes, hatred burning in his eyes so fiercely the vessels in his forehead ruptured. Blood streamed down his face. He didn't care.\n\nThe Overgeared King was the real culprit. If that madman hadn't interfered, Mercedes would be dead, Gyuratan's position unassailable, and the contractor's path to the throne cleared. The contract would have completed. Resurrection within reach.\n\nBut Grid wasn't here. So Mercedes would pay the price.\n\n\"Why did you bring him here?!\" Astaroth screamed, his fragile body straining under the weight of his rage. Weakened demonic energy crackled around his hands. \"WHY?!\"\n\nHe'd learned one truth in his years among humans: they broke easily. Livestock in human shape. The wounded knight before him should collapse from a whisper of mana, let alone a direct attack.\n\nLightning demonic energy erupted toward Mercedes. She couldn't resist—the metal attraction property seized her broken sword, dragging it toward her own throat. Her own weapon would kill her.\n\nPerfect.\n\n\"Mercedes!\" Emperor Juander's voice cut through the hall. \"SURVIVE!\"\n\nIn twelve years of service, Mercedes had never heard that tone from her master. Command threaded with desperate hope.\n\nSomething shifted.\n\nHer consciousness, nearly extinguished, flared. Numb flesh remembered duty. Vision that had faded to fog sharpened, processing the world with crystalline clarity. Instinct alone had kept her standing—but now purpose flooded back.\n\nShe hurled her sword forward.\n\nThe blade intercepted the demonic lightning, conducting it harmlessly into the stone floor.\n\n\"Futile!\" Astaroth followed his attack, blade raised for the killing stroke. This wounded knight thought she could use simple physics against him? \"Die!\"\n\nHis sword plunged toward her face.\n\n\"Supreme Swordsmanship, Fourth Style.\"\n\nMercedes's body moved before her mind caught up. Muscle memory from childhood training, a technique carved into her very bones. The forbidden art of an old hero branded traitor.\n\nShe used it anyway.\n\nAstaroth's eyes widened. His blade, moments from piercing her skull, lost all momentum. It drifted sideways as if pulled by invisible strings—straight into Mercedes's waiting palm.\n\nHer hand closed around the steel. Not bleeding. Not breaking. Glowing.\n\nLight erupted from her body.\n\n[A legendary knight has been born!]\n\n[Every knight in the world will look up to her and praise her!]\n\nWorld messages blazed across the vision of every player in Satisfy.\n\n\"What—no. No!\" Terror clawed up Astaroth's throat. He saw it now—Muller's shadow overlaying Mercedes's form. A legend who transcended human limits. A monster that could threaten even superior species.\n\nImpossible. She'd *evolved*.\n\n\"Knight's Resolution.\"\n\nSilver sword energy exploded from Mercedes—but not toward Astaroth. Toward her knights.\n\nThroughout the hall, dying men gasped. Energy flooded their broken bodies, wounds closing, strength returning. Silver sword marks burned on their chests. The same mark glowed on Mercedes's breastplate.\n\n\"What are you—\" Astaroth snarled, a cornered beast.\n\n\"For our homeland.\"\n\n\"FOR OUR HOMELAND!\"\n\nMercedes and her knights charged as one. Astaroth abandoned his trapped sword and retreated, but too slowly. Mercedes claimed the blade and became complete.\n\nDespite her wounds, she moved at transcendent speed. Her swordsmanship flowed like water, mesmerizing in its deadly grace.\n\n\"Pledge Sword.\"\n\nMercedes became a silver blur. Her blade struck Astaroth too fast to count, each thrust infused with radiant sword energy. The air itself seemed to tear, the universe pouring through the rents.\n\n\"Khuak!\"\n\nAstaroth crashed to the floor, blood erupting from his mouth. The impact shattered stone. The entire hall trembled—but the knights stood firm, Mercedes's buff anchoring them in place.\n\n\"You...\" Astaroth struggled upright, pale face ghostly. His vision swam with dozens of swords hovering in the air above.\n\nMercedes held her blade before her chest, a perfect vertical line. Her conviction made steel.\n\n\"I told you,\" she said quietly. \"I will punish you.\"\n\nSilver wings of light unfurled from her sword energy. Her blade blazed with holy radiance.\n\nAstaroth stared up at her, at the descending angel of judgment.\n\n\"Why?! Why do legends always—\"\n\nMercedes's sword fell.\n\nWithout the thunder stone, stripped of his power, Astaroth had nothing left. The blade split him from crown to groin. His body crumbled to grey dust.\n\n\"*WAAAAAAAH!*\"\n\nThe knights' roar shook Titan itself. Their triumph echoed off the palace walls, a sound that would ring in the city's memory for generations.\n\nEmperor Juander stood silent. Bain said nothing. Goldhit watched in mute disbelief.\n\nThe empire's second legend. Born in fire and blood.\n\nJealousy twisted in Bain's chest. Goldhit felt it too—that bitter ache of witnessing greatness they'd never reach.\n\nAnd the emperor...\n\nShame crushed him. Born to rule the world, he'd never once bowed his head. Until now.\n\nMercedes approached, her body a canvas of wounds, blood soaking through her armor. Yet even broken, she remained beautiful.\n\nShe knelt before him.\n\n\"Your Majesty, forgive my disloyalty. I should have trusted you.\"\n\nThe emperor's throat closed. Her guilt—completely misplaced—made his own inadequacy unbearable.\n\n\"You... blame yourself?\" he managed.\n\n\"Knights cannot blame their masters.\"\n\n\"Then Piaro and the former Red Knights didn't betray me?\"\n\n\"No, Your Majesty. The Great Demon orchestrated everything.\"\n\n\"You knew from the beginning?\"\n\n\"I discovered the truth recently. Piaro and Asmophel now serve the Overgeared King.\"\n\nMercedes explained everything. The deception. The manipulation. The truth hidden for fifteen years. The emperor listened. The knights wept.\n\n\"I see,\" Juander said quietly. \"So that's how it was.\"\n\nRegret settled on his shoulders like a physical weight. But gratitude too—that Piaro had found a new master. That redemption might still be possible.\n\n\"Mercedes.\"\n\n\"Yes, Your Majesty.\"\n\nMercedes waited. Would he restore Piaro's honor? Proclaim the truth? Or bury it like so many imperial secrets?\n\nPlease, she prayed silently. Let him clear Piaro's name.\n\n\"I'm stripping you of your knight qualifications.\"\n\n\"...!\"\n\n\"Y-Your Majesty!\" The knights surged forward in protest. Bain and Goldhit stared in shock.\n\nDismissing a legendary knight? Madness. Pure madness, regardless of reason.\n\nEven Bain—who never questioned the emperor—stepped forward. \"Your Majesty, you must reconsider—\"\n\n\"No.\" Juander approached Mercedes, who knelt frozen in disbelief. He took her wounded hands in his. \"This isn't a command. It's a request.\"\n\nHis voice cracked.\n\n\"Mercedes, give me a chance to atone. Please... serve my old friend. Help him spend his final years in peace.\"\n\nPiaro. Childhood genius. Noble lineage. The emperor's companion since youth, bonds forged deeper than status. Which made the perceived betrayal so devastating. Made the hatred burn so hot.\n\n\"Please. I'm asking you.\"\n\nTears streamed down Juander's face. His knights had never seen their emperor weep. The revelation struck them like a thunderbolt—their god-king was human after all.\n\nMercedes's resolve crumbled.\n\n\"...I will leave,\" she whispered. \"I will protect the old hero. And I will tell you of his happiness.\"\n\n\"Thank you.\" Juander's grip tightened. \"Truly. Thank you.\"\n\nA pause. Then, barely audible: \"I'm sorry.\"\n\nSince losing Empress Aria, since Piaro's betrayal, had Juander met anyone with a pure heart? The answer was no. But perhaps that could change. The emperor smiled through his tears as the crushing weight finally lifted.\n\nThe Saharan Empire would grow stronger from this day forward.\n\nMeanwhile, halfway across the continent...\n\n[A legendary knight has been born!]\n\n[You have succeeded in sealing the weakened Great Demon Astaroth!]\n\n[The 1st place raid compensation is acquired!]\n\nGrid stared blankly at the notifications.\n\n\"...What the hell?\""
}