{
  "id": 808,
  "title": "Chapter 808",
  "content": "**[Name: Kazak]**\n**Age:** 6 | **Gender:** Male | **Race:** Human | **Level:** 1\n**Strength:** 1/40 | **Stamina:** 2/50 | **Agility:** 1/30 | **Intelligence:** 1/???\n\n*A child born with innately high magic power. Kidnapped by the Magic Tower four years ago and raised by magicians as a potential vessel. Lacks basic language and intellectual development due to the absence of any education.*\n\n**[Name: Cha Cha]**\n**Age:** 5 | **Gender:** Female | **Race:** Human | **Level:** 1\n**Strength:** 1/20 | **Stamina:** 1/40 | **Agility:** 1/40 | **Intelligence:** 1/???\n\n*A child born with innately high magic power. Kidnapped by the Magic Tower four years ago and raised by magicians as a potential vessel. Lacks basic language and intellectual development due to the absence of any education.*\n\n---\n\nThe thunder stone shattered beneath Grid's blade, fragments of crystallized lightning scattering across the glass ceiling. He should have gone straight to the imperial palace—every second mattered if he wanted to help Mercedes—but his feet refused to move. Not when dozens of children remained imprisoned on the floor below, treated like livestock awaiting slaughter.\n\nThe descent to the seventy-ninth floor took only moments. What awaited him there would haunt Grid for far longer.\n\nSmall hands reached through iron bars as he approached. Hollow eyes tracked his movement. The children's stomachs provided a chorus of hunger—a sound Grid recognized all too well from his own past.\n\nHe studied the dungeon through **Insight**. Straw scattered across filthy stone. A single trough of fetid water. No blankets. No light save what filtered down from above. The status windows that appeared when he examined the children told a story that made his jaw clench: potential wasted, futures stolen, bodies used as nothing more than containers.\n\nGoldhit had selected these children to be vessels for her soul. If she planned to inhabit their bodies eventually, basic care should have been a given. Yet they'd been abandoned here, left to rot in their own filth.\n\n*The strong always discard what they consider weak.*\n\nGrid's expression hardened before he caught himself. Several children flinched back from the bars, tiny bodies pressed against the far wall. He forced his features to soften—an effort that would have been impossible for him just a year ago.\n\n\"It's all right.\" The words came easier than expected. \"I'm not here to hurt you.\"\n\nWhen had he become someone who rescued strangers? The old Shin Youngwoo would have walked away, convinced that survival meant putting yourself first. Grid shook his head at the thought and grasped the padlock securing the cell. Three thousand points of strength made short work of the thin metal. The lock snapped like a dried twig.\n\n\"You can come out now.\" He opened the door slowly, careful not to let it creak. \"No one will hurt you anymore.\"\n\nNone of the children moved. They huddled together in the cell's far corner, staring at the open doorway as if it might be a trap. For them, this prison was the only world they'd ever known. The only life Goldhit's magicians had permitted them to remember.\n\nFire built behind Grid's eyes. His **Dignity** stat flared, and the children whimpered. He forced it down, closed his eyes, and took several deep breaths until the rage settled into cold determination.\n\n\"Forgive me.\" Grid stepped into the cell himself, dropped to his knees, and let the straw soak through his expensive clothes. \"Let me try again.\"\n\nHe knelt among them like a merchant displaying his wares, though his inventory contained nothing appropriate for children. His smile came more naturally this time, bolstered by his **Charm** stat. \"Come outside with me. If you leave this place, you'll find food that actually tastes good. Clean air that doesn't burn your lungs. The sun on your face.\"\n\nThe children stared.\n\n\"...Pretty things,\" he added awkwardly. \"Whatever children like. I'll make sure you have it.\"\n\nSomething in his voice finally reached them. Perhaps it was the sincerity that his high **Dignity** lent to every word. Perhaps they simply recognized someone who'd known hunger himself.\n\nA small boy took one tentative step forward. Then another. The other children watched him reach Grid's side unharmed, and the spell broke. They surged forward in a rush of small bodies and reaching hands, desperate little sounds replacing the previous silence.\n\n\"Easy now.\" Grid's hands moved on autopilot, pulling items from his inventory. \"One at a time.\"\n\nHe'd crafted simple undergarments using materials from the **Alchemy Facility** back in Reidan—nothing fancy, but clean and properly sized for growing children. Each child received a set along with preserved meat and bread meant for soldiers. Their gratitude showed in wide eyes and trembling fingers.\n\n\"What in the nine hells are you doing?!\"\n\nThe magicians appeared at the chamber's entrance, robes billowing as they skidded to a halt. Their faces were flushed from running—likely drawn by the thunder stone's destruction. The children immediately scrambled behind Grid's back, tiny hands clutching at his armor.\n\nGrid rose to his feet slowly. His hand drifted toward the hilt of his sword. \"What are these children to you?\"\n\n\"You've met Goldhit.\" The lead magician's tone suggested Grid was being deliberately obtuse. \"Her appearance should have made their purpose obvious. Given her current vessel, I'd think—\"\n\n\"I asked what they are to you. Specifically.\" Grid's voice dropped. \"Why were they living like animals?\"\n\n\"Neglect isn't the same as abuse.\" The magician waved a dismissive hand. \"We cared for them properly at first, naturally. These particular specimens lost their qualification to serve as vessels. They're useless now.\"\n\n\"Then release them.\"\n\n\"And waste perfectly good research materials?\" Another magician laughed. \"These children still have value as experimental subjects. Guinea pigs, if you will.\"\n\nThe words were meant to provoke. Grid recognized the tactic—make him lose control, force him into an irrational attack that would justify retaliation. He'd seen the same play a hundred times in both virtual and real worlds. Knowledge of the game should have made him immune.\n\nIt didn't.\n\n\"You're all dead.\" Grid's body moved before conscious thought engaged. His fingers wrapped around the grip of his greatsword as he closed the distance between them.\n\nThe magicians responded instantly.\n\n\"**Water Wave!**\"\n\n\"**Chain Lightning!**\"\n\nSpells converged on Grid's position in a coordinated assault that would have killed most players instantly. Water surged around his ankles, trying to drag him down and conduct the lightning coursing through the chamber. The combination should have been devastating.\n\nGrid walked through it like morning mist.\n\n**Valhalla of Infinite Affection** absorbed most of the lightning's fury. His **Magic Resistance** converted the rest into negligible damage. The water sloshed harmlessly around his greaves.\n\n\"What—?!\" The lead magician stumbled back. \"How did you—\"\n\nGrid didn't answer. A lesser magician attempted binding magic. Another cast **Grease** across the floor, trying to rob Grid of his footing. Both spells unraveled against his resistance stats without slowing his advance.\n\n\"**Explosion!**\"\n\nThe desperate casting came from a magician whose survival instincts had finally overcome his arrogance. The explosive spell would bring down this entire section of the tower, but death was preferable to facing Grid's blade. At least the tower's collapse might take this monster with him.\n\nToo late for wisdom.\n\n\"**Revolve.**\"\n\nGrid's greatsword traced a perfect arc through the air. The blade caught the explosion's energy at the moment of detonation, drawing fire and force into a controlled vortex that reversed the spell's trajectory. The magician who'd cast it didn't even have time to scream before his own magic consumed him.\n\n*Peeeeong!*\n\nThe explosion tore through their formation. One magician collapsed with catastrophic burns. Another's casting shattered mid-incantation, backlash searing through his mana channels. They tried to regroup—magicians were most dangerous when working in concert, each spell building on the last to create devastating combinations—but Grid had already broken their rhythm.\n\nHe didn't waste time on flashy skills. **Pagma's Swordsmanship** was powerful, but these enemies didn't warrant such expenditure. His basic attacks, enhanced by **Alex's Quick Gloves** and over three thousand points in strength, cut through robes and flesh with equal ease. Magicians rarely invested in defense. Their bodies couldn't withstand punishment.\n\nThe battle should have ended there.\n\n\"**Crossfire!**\"\n\n\"**Thunder Hammer!**\"\n\nGoldhit's personal disciples proved themselves more competent than the tower's rank-and-file researchers. They abandoned powerful spells in favor of rapid-fire casting, throwing multiple low-level attacks at Grid in quick succession. Accumulated damage through superior numbers rather than relying on single devastating strikes. The strategy might have worked against a normal opponent.\n\nAgainst Grid, it merely prolonged the inevitable.\n\nEach strike from his blade dealt more damage than three of their spells combined. **Doran's Ring** converted a fraction of that damage into healing, keeping his health stable. The disciples fell one by one, their talent and training insufficient to bridge the gap between them and a legend.\n\n\"You... you can't...\" A magician coughed blood, his health depleted but his body not yet registered as dead by the system. \"Do you understand what you've done?\"\n\n\"We're subjects of the Saharan Empire!\" another gasped. \"Harm us, and your entire kingdom will burn! You and everyone you've ever known will disappear from history!\"\n\nGrid stood over them, greatsword still in hand. These weren't ordinary monsters—they were humanoid NPCs, designed with the complexity and resilience that made them difficult to kill outright. Their wounds would heal given time and potions. They could report everything they'd seen here today.\n\n*Which means I can't let them live.*\n\nThe thought came with surprising clarity. This wasn't about anger anymore, though fury still simmered beneath his calculated exterior. The Saharan Empire would eventually oppose the Overgeared Kingdom. That conflict was inevitable given their respective positions and Grid's ambitions. These magicians represented future threats—powerful spellcasters who could rain destruction on his people from miles away.\n\nHe'd already destroyed the thunder stone. War with the empire was coming whether he wanted it or not. Better to eliminate as many pieces from their board as possible while the opportunity presented itself.\n\n\"You're right,\" Grid said quietly. \"The empire will come for me eventually. Which means I can't avoid that mountain anyway.\"\n\nUnderstanding dawned in their eyes. Then terror.\n\n\"You can't—!\"\n\nGrid's blade fell. He made the deaths quick, at least. No torture, no cruelty. Just efficient removal of future problems. When the last magician dissolved into grey light, Grid finally sheathed his weapon and turned back to the children.\n\nThey were huddled in the far corner, watching Noe with wide eyes.\n\n\"Behold!\" The demonic beast had puffed himself up to twice his normal size, floating in lazy circles above the children's heads. \"You witness the glorious form of Hell's strongest demonic beast! Gaze upon my magnificence and—\"\n\n\"Ah! Ahh!\" The children reached up with delighted sounds, trying to touch Noe's fluffy tail as it swished past.\n\n\"—and appreciate my...?\" Noe deflated slightly as tiny fingers patted his fur. \"Well. Yes. You may pet me. This is an honor rarely granted to humans...\"\n\nGrid smiled despite everything. The children had never seen anything so beautiful and harmless in their short lives. Let them have this moment of joy. He'd already taken so much innocence today.\n\nHe waited until the children were thoroughly distracted before cleaning blood from his blade.\n\n\"Let's go.\"\n\n---\n\n*I need to help Mercedes.*\n\nGrid led the children through the tower's lower corridors, avoiding main passages where they might encounter more magicians. His visit to the empire would be discovered soon enough—Goldhit would investigate the thunder stone's destruction, and she'd eventually trace it back to him. The collapsed walls and fallen chandelier would be attributed to Astaroth, but Grid's presence during that chaos would raise questions.\n\n*Still, the great demon's appearance should work in my favor. They'll assume Astaroth was responsible for everything.*\n\nGrid found himself grateful for Astaroth's emergence, completely unaware that his own actions had triggered the demon's arrival in the first place.\n\nHe located a sheltered alcove several floors down—an abandoned storage room that showed no signs of recent use. \"Wait here,\" he instructed the children, distributing the remaining food from his inventory. \"Stay quiet. I'll return for you.\"\n\nNoe floated beside him, ears twitching. The demonic beast's usual smug expression had softened into something almost protective as he watched the children divide the bread.\n\n*If they'd been raised properly, they could have been happy.*\n\nThe thought followed Grid as he prepared to leave. These children had potential—raw magical talent that most players would kill for. Given education and care, they might have become powerful magicians themselves. Instead, they'd been discarded like broken tools.\n\nHis eyes burned with suppressed emotion as he turned away.\n\nThen the world message appeared.\n\n> **[A legendary knight has been born!]**\n> **[Every knight in the world will look up to her and praise her!]**\n\nGrid froze mid-step. \"What?\"\n\nThe message designated the new legend as female. Only one person came to mind immediately: Mercedes, the First Knight of the empire who'd been defending against Astaroth alongside the emperor himself.\n\n*She ascended to legendary status.*\n\nBefore Grid could fully process the implications, another notification appeared:\n\n> **[You have succeeded in sealing the weakened great demon, Astaroth!]**\n> **[1st place raid compensation is acquired!]**\n\n\"...What?\" He stared at the message. \"How is that possible?\"\n\nHe hadn't participated in the raid directly. Hadn't even seen Astaroth during the actual battle. Yet the system credited him with first place contribution?\n\n*Wait.* Understanding dawned slowly. *The thunder stone. Astaroth was powered by it. Without destroying the stone, they couldn't have sealed the demon.*\n\nThat explained part of it, at least. Grid's contribution had enabled the victory, even if he hadn't struck the final blow. The system recognized indirect participation in raids—especially when that participation proved crucial to success.\n\nWhat Grid didn't realize was that exposing Astaroth's true identity in the great hall also counted toward his contribution. The system tracked far more than direct combat participation.\n\n*This is actually a problem.*\n\nHis initial excitement over the raid rewards faded as he considered the situation. Mercedes had become a legendary knight through her performance against Astaroth. She was now the empire's newest hero, celebrated across the continent for her valor and strength.\n\nHow could she possibly leave the empire now?\n\nThe nobility would never permit it. The emperor would chain her with honors and duties. And Mercedes herself—proud, loyal Mercedes—would never abandon her post after ascending to such heights. Her nature wouldn't allow it.\n\n\"Damn.\" Grid's fist clenched. \"I'm losing her.\"\n\nHe valued items more than most players. Built his entire combat style around equipment superiority. Earned the title of Overgeared King through his obsession with gear. But Grid also understood the worth of people—had learned it through recruiting NPCs like Piaro, Asmophel, Sticks, and Rabbit.\n\nLosing Mercedes hurt worse than missing out on the raid rewards currently filling his inventory.\n\n\"Return to the kingdom first...\" He forced himself to start moving, to focus on getting the children to safety. Then his eyes caught on the final notification, and he stopped again.\n\n> **['Weakened Great Demon Astaroth's Power' has been attached to the Rune of Darkness!]**\n\nGrid blinked at the message. The **Rune of Darkness** was already one of his most versatile items, capable of storing and utilizing defeated enemies' abilities. But he knew nothing about Astaroth's powers. He hadn't witnessed the demon fight. Couldn't predict what skill the rune had absorbed.\n\nCuriosity overcame frustration. He pulled up the item description:\n\n**[Weakened Great Demon Astaroth's Power]**\n\n*If you are a demonkin or have demonic energy, you can create the Storm Demonic Energy Field.*\n\nGrid's mouth fell open. \"A field ability?\"\n\nHe'd fought enough bosses to recognize what that meant. Field abilities were typically reserved for raid encounters—environmental effects that covered entire battle zones and provided massive advantages to their users. Players didn't get field abilities. That was a mechanic reserved for Named NPCs and boss monsters.\n\n\"Am I seriously...\" Grid stared at his own hands. \"Am I turning into a boss mob?\"\n\nThe progression felt surreal. He'd started as an ordinary blacksmith struggling to survive. Now he possessed abilities that rivaled some of the game's most fearsome entities. The line between player and Named NPC grew blurrier with each legendary achievement.\n\nOmnipotence, Grid reflected, might not be as versatile as he'd once thought. It was starting to feel more like overwhelming, singular power.\n\nThe kind of power that changed everything around it whether he wanted it to or not."
}