{
  "id": 809,
  "title": "Chapter 809",
  "content": "Mercedes departed the great hall, the emperor's dismissal still ringing in her ears.\n\n\"Your Majesty! Are you unharmed?\" \n\nThe remaining Five Pillars burst into the chamber—Grandmaster Zikfrector and Armored Cavalryman Chensler, their arrival delayed by duty elsewhere in the palace. Zikfrector's gaze swept across the scorched floor and shattered columns while Chensler rushed to the emperor's side, searching for wounds.\n\n\"I'm fine.\" The emperor's tone left no room for argument. He didn't chastise them for their tardiness—they'd been stationed beyond the palace walls when the demon attacked. Under the circumstances, they'd arrived swiftly.\n\nZikfrector crouched beside the pile of grey ash that had been Astaroth. \"You destroyed the thunder stone.\" He straightened, eyes narrowing. \"This battle should have been overwhelming. If you survived, there must have been an unexpected variable.\"\n\nGoldhit stepped forward. \"Indeed. I commanded my disciples to destroy the thunder stone, averting catastrophe.\"\n\nShe had no intention of revealing Grid's role. Having already lost the thunder stone, she meant to salvage what advantage she could—especially since she'd contributed nothing during the actual fight.\n\n\"You?\" Zikfrector's laugh held no humor. \"You voluntarily destroyed the thunder stone? That's the funniest joke I've heard all year.\"\n\nHe knew Goldhit's ambitions too well. She would sooner die than relinquish such power willingly.\n\nGoldhit's face flushed crimson. \"You dare question my word?\"\n\n\"Don't waste your indignation.\" Zikfrector dismissed her with a wave, already turning away. As the pinnacle of the Five Pillars, he had no patience for the Magician King's theatrics—not when a new legend had just walked these halls.\n\nHe approached the emperor. \"Mercedes dealt the finishing blow to Astaroth.\"\n\n\"Correct.\"\n\n\"And her absence now suggests you've sent her away.\"\n\n\"...The Grandmaster's perception remains sharp as ever.\"\n\nZikfrector spoke with the casual familiarity of one who'd lived centuries, despite his youthful appearance. \"You may respect her sacrifice, Your Majesty, but don't grant her any of the battle's spoils. You'll need them.\"\n\nSilence.\n\n\"If it troubles you, I'll retrieve them myself.\"\n\n\"No.\" The emperor reached for parchment and quill. \"I'll issue the order.\"\n\n***\n\nDozens of knights filled Mercedes' garden, swords drawn in salute.\n\n\"We will carry your teachings with us always.\"\n\nMercedes regarded them with stern affection. \"Why gather here when the palace still reels from disaster? Even now, citizens suffer.\"\n\n\"Please, Captain. Allow us this final farewell.\"\n\n\"We return to duty the moment you depart.\"\n\n\"You're not children.\" But even as she scolded them, a smile tugged at her lips. Twelve years of service, twelve years of bonds forged in battle and blood. She could grant them this moment.\n\nShe walked toward the gate, each step deliberately slow. Her knights raised their swords, tears streaming down weathered faces.\n\n*Sir Dia, Sir Lorex, and all who fell before their time... Do you see us now?*\n\nThe Red Knights revered Mercedes above all others. Many would have followed her into exile, but she'd taught them better. A knight's loyalty belonged to their master—always.\n\nA young soldier intercepted her at the garden gate, imperial seal clutched in trembling hands. \"Captain Mercedes, I bear His Majesty's command.\"\n\nHe unfurled the parchment. \"'Mercedes, I wish you luck.'\"\n\n\"That's all?\"\n\n\"Yes, Captain.\" The boy's eyes shone like stars. \"I also wish you luck.\"\n\nMercedes' smile outshone even his youthful admiration. \"Thank you, soldier. I wish you luck as well.\"\n\n***\n\n>[Storm Demonic Energy Field - Weakened State (3)]\n>\n>[-Summons a lightning storm with a radius of 200 meters.\n>\n>-Field Effect 1-\n>\n>A maximum of 11 lightning strikes will occur at least four times per second. The struck target will suffer 10,000 fixed damage, resulting in paralysis, stuns, burns, and other status conditions.\n>\n>* Lightning bolts will fall randomly. In addition, the lightning bolt won't distinguish between enemies and friends. It will be a threat to all except for the caster.\n>\n>-Field Effect 2-\n>\n>Strong winds will lighten the user's body. Under the effect of the strong winds, the user's movement speed will increase by 20%. On the other hand, everyone apart from the user will be unable to cope with the pressure of the strong wind and movement speed will drop by 20%.\n>\n>-Field Effect 3-\n>\n>The heavy winds will interrupt the visibility of all targets except the user, reducing the accuracy rate by 10%.\n>\n>-Field Effect 4-\n>\n>The sound of thunder in the ears will cause confusion. The skill and casting speed of everyone except the user is reduced by 10%.\n>\n>-Field Effect 5-\n>\n>Sealed due to the weakening. Will be opened in Weakened State (2).\n>\n>-Field Effect 6-\n>\n>Sealed due to the weakening. Will be opened in Weakened State (1).\n>\n>-Field Effect 7-\n>\n>Sealed due to the weakening. Will be opened when released from a weakened state.\n>\n>Resources consumed when field is activated: 1,000 mana per second.\n>\n>The time it takes to summon the field: 30 seconds.\n>\n>* Activated immediately in places where the weather is already cloudy.\n>\n>Skill Cooldown Time: 20 minutes.]\n\nGrid stared at the notification, mind racing.\n\nField magic. The domain of bosses. The signature ability that turned battlefields into nightmares, strengthening the monster while crushing players beneath overwhelming pressure. And now he possessed it.\n\nThis wasn't just powerful—it was game-breaking.\n\n*Though the mana consumption is brutal.*\n\nA thousand mana per second to maintain a two-hundred-meter storm. Still, combined with Blackening? Even in its weakened state, this ability would make him unstoppable.\n\n*And three more effects remain sealed.*\n\nThe lost opportunity to recruit Mercedes stung less now. This was what made games beautiful—unlike reality's grinding effort-to-reward ratio, games offered explosive growth. New quests, new levels, new trials, new power.\n\nHe clenched his fist, silently addressing his past self. *Shin Youngwoo, this game was never a refuge. It's hope itself.*\n\n\"Let's head home, Noe.\"\n\nHe'd accomplished his goal and gained more than expected. Enough to balance the disappointment of Mercedes' refusal. \n\nBut the children complicated matters. Dozens of traumatized youngsters who could barely walk for more than an hour without rest. Alone, he could reach Reinhardt in a month. With them? The journey would take three times as long.\n\n*Should I leave them at a village?*\n\nWould they even be welcomed? These innocent victims had suffered enough. He couldn't risk exposing them to more cruelty.\n\n*Perhaps I should summon someone.*\n\nEuphemina could duplicate Mass Teleport, transporting everyone instantly. Grid raised his hand to message her—\n\n\"That's a flower, nyong.\"\n\n\"Abu!\"\n\n\"That's a mountain, nyong.\"\n\n\"Ada!\"\n\n\"That's the sky, nyong.\"\n\n\"Bubu! Ba!\"\n\n\"Nyahahat! The best demonic beast of hell, Noe, is your teacher, nyang!\"\n\n\"No...e!! No..uh!\"\n\n\"Nyang!\"\n\nGrid lowered his hand.\n\nThe children had spent their entire conscious lives trapped in that tower's darkness. Noe had languished in the pet inventory for months. Now both savored their first taste of true freedom, wonder bright on every face.\n\n*We'll walk a little longer.*\n\nHe summoned Randy and the Overgeared Skeletons instead. Better to have extra protection for the journey ahead.\n\n\"Abu!\"\n\n*Clack! Clack clack!*\n\n\"Adad!\"\n\n\"Hello. I am Randy.\"\n\n*Clack! Clack!*\n\nHell's finest demonic beast. A doppelganger. Two skeletons. Traumatized children. The strongest player alive.\n\nAnyone witnessing their party would think they'd lost their minds.\n\n\"You! Hand over your—*keok!*\"\n\nThe bandits never finished their demands.\n\nThe absurd party proved devastatingly effective. Grid obliterated over a dozen bandit groups and cleared a thousand monsters as they traveled, the Overgeared Skeletons growing stronger with each kill.\n\nBut no one wins forever.\n\n*KIYAAAAAAAH!*\n\n\"Dammit! Why is there a medusa here?\"\n\nThe field boss materialized as they entered the Lamia Forest. Low three-hundreds level—weak by Grid's standards. \n\nBut the children changed everything.\n\nOne look at those serpentine eyes meant instant petrification. Grid charged forward, desperate to hold the medusa's attention, but the children refused to cooperate.\n\n\"Ahh! Kyao!\"\n\n\"Kyaak~~!\"\n\nThe medusa's writhing hair sent them into hysterics. Their screams drew the monster's gaze like a magnet.\n\n\"No...!\"\n\n*Is this how their suffering ends? After everything they've survived?*\n\n*Thunk!*\n\nArrows sprouted from the medusa's skull in rapid succession—precision archery that rivaled Jishuka herself. Grid and the medusa both whipped toward the source.\n\nA knight emerged from the shadows. She wore battered leather armor instead of imperial crimson, bow already slung across her back as she drew an axe.\n\nThe thrown weapon buried itself in the medusa's throat. The knight closed the distance in a blur, twin swords flashing. \n\nHeart. Neck. \n\nThe medusa's head tumbled free, its body dissolving to grey light.\n\n\"You...\"\n\n\"Wandering knight Mercedes greets the Overgeared King.\"\n\nTheir paths had crossed again."
}