{
  "id": 81,
  "title": "Chapter 81",
  "content": "# Chapter 81\n\nKhan greeted me at the smithy entrance. \"You cleared Kesan Canyon? Those monsters are no joke.\" He stepped closer, eyes bright with anticipation. \"Did you learn it? Pagma's Swordsmanship?\"\n\n\"Yeah.\"\n\n\"Show me.\" The old blacksmith's voice cracked slightly. \"Let me see the technique that made my ancestor witness a legend.\"\n\nI glanced around the cramped workshop. \"Not enough space here. Outside.\"\n\nWe moved to the yard behind the smithy, where stacks of firewood bordered the packed earth. I pulled the Ideal Dagger from my inventory and centered my stance.\n\n\"Pagma's Swordsmanship. Wave.\"\n\nBlue light rippled outward as I moved through the forms. Each step scattered luminous arcs across the ground. Khan's breath caught.\n\n\"Incredible.\" He wiped his eyes. \"Beautiful... and brutal.\"\n\n*There are four more techniques.* I sheathed the dagger. \"That's all for today.\"\n\n\"What? Why stop?\" Khan's disappointment was palpable. \"I want to see the rest.\"\n\nI wanted to show off. The old man had earned that much. But my mana sat at a pathetic 630 points. Wave had eaten 370 of it. Another technique would drain me completely, and mana potions cost money I didn't have.\n\n\"Can't afford the mana.\" I shrugged. \"Potions are expensive.\"\n\nKhan laughed, a short bark of understanding. \"Fair enough. Come on, then.\"\n\nHe led me into the smithy and climbed the stairs to the second floor. When he turned, Dainsleif rested across both palms, the massive blade catching the forge light.\n\n\"Your reward.\" He extended the greatsword. \"Pagma's Descendant should wield Pagma's inspiration better than anyone.\"\n\nThe system flared to life.\n\n> [Dainsleif (Reproduction) has been acquired.]\n\n> [Quest Success!]\n\nI pulled up the item window.\n\n**Dainsleif (Reproduction)**\n\n<span class=\"rarity-unique\">Rating: Unique</span>  \n**Durability:** 500/500  \n**Attack Power:** 451~635  \n**Attack Speed:** -8%\n\n**Options:**\n* Deals additional damage equal to 10% of target's current Defense\n* Attack power increases with number of enemies\n* Generates skill: **Golden Flash**\n\n*A masterpiece created by Albatino, the first craftsman before Pagma's era. He attempted to reproduce the mythical weapon Dainsleif.*\n\n*Though inferior to the original, he succeeded in restoring key features. Acclaimed as a 'masterpiece of human history' by King Loran, founder of the Eternal Kingdom.*\n\n*The legendary blacksmith Pagma drew great inspiration from Albatino's work.*\n\n**User Restriction:** Level 250+, **1,800 Strength**, Advanced Sword Mastery  \n**Weight:** 1,580\n\nThe requirements were steep, but the performance surpassed the Sword of Self-transcendence by a clear margin. *Only top rankers have weapons this good.*\n\nI examined Dainsleif closer. Three meters and twenty centimeters of pure intimidation. The black iron blade married elegance to raw power, while the mithril handle created a subtle contrast of darkness and silver. Carrying this on my back would turn heads everywhere.\n\n*If I enhance this thing...*\n\n\"Alright!\" I pumped my fist. \"Next is Valhalla!\"\n\nKhan had waited years for someone who could appreciate these weapons. That person was me.\n\n\"Khan, what's the next step? How do I get Valhalla?\"\n\nThe old blacksmith patted my shoulder, his smile tired. \"Let me rest first. If I give you everything too quickly, my heart might give out.\"\n\n*So I don't meet the second class quest conditions yet.* I nodded. The time would come.\n\n***\n\nThree days crawled by since Kesan Canyon.\n\nThe world buzzed with news. The Eighth Servant had appeared. Every Yatan Church member gained a 20% experience bonus. New users flocked to join the dark faith. Analysts wrung their hands on forums, predicting doom.\n\n*\"The Yatan Church's growth threatens Satisfy's stability. NPC casualties are exponential in certain cities. Some villages have vanished completely. The Alliance must stop them.\"*\n\nOthers pointed fingers at Yura.\n\n*\"The Eighth Servant is definitely her. She'll grow impossibly strong as the Church expands. Normal users can't compete. The ranker balance is destroyed.\"*\n\nI ignored it all.\n\n*I'm busy with my own problems.* Yeah, it stung that Yura was eating all the good opportunities. But wasn't that always the case? Getting jealous now was pointless.\n\nThree days. I'd spent them at the forge, grinding out items.\n\nThree Normal-rated. One Rare.\n\n\"This production rate is garbage.\" I stared at the meager pile of goods. \"Hunting makes way more money. How am I supposed to pay off the debt at this pace?\"\n\nThe northern snowfields called to me. Frostlight Orcs meant experience and sylphid scales. If I collected twenty scales, I could craft the Hooded Zip Up. Level up while gathering materials.\n\n*But the drop rate is horrible.* Five days until the next interest payment. Relying on RNG was suicide.\n\n*Focus on production for five days. Stable profit. Pay the interest. Avoid a foreclosure notice.*\n\n\"Mr. Grid?\"\n\nTwo soldiers appeared at the smithy entrance.\n\n\"What?\" My tone came out sharper than intended.\n\nThey didn't flinch. \"The Administrator is looking for you. Urgent.\"\n\n*Oh?*\n\nThe Business with the Administrator quest. Round two.\n\n*What does he want me to make this time?* Maybe this would be profitable. I followed them toward the castle, hope flickering in my chest.\n\n***\n\nAdministrator Valdi's office was exactly as I remembered it. Tidy. Efficient. Expensive.\n\nHe produced a scroll the moment I entered, no pleasantries.\n\n\"Urgent matter.\" He unrolled it halfway. \"Can you produce an item using this method?\"\n\n\"Let me see.\"\n\nI took the scroll.\n\n> **['Divine Shield' Production Method]**\n> \n> **Prerequisite:** Advanced Blacksmith Mastery Level 3 or higher\n> \n> **Divine Shield:** A shield containing the power of Rebecca, Goddess of Light. Its strength against dark magic makes all demon followers and Yatan Church members suffer when facing it.\n> \n> **User Restriction:** Level 190+\n\nMy eyes widened.\n\n*He's just giving me this?*\n\nValdi leaned forward. \"Do you have the ability to understand and create this?\"\n\n\"Yeah.\" I met his gaze. \"I can learn it easily.\"\n\n\"Excellent!\" Relief washed across his face. \"Then please, learn the method and craft this shield.\"\n\nA free production method for a level 190 item. Of course I'd accept. But there was a problem.\n\n\"I can make the shield according to the specs, but I don't have the divine power to complete it.\" I tapped the scroll. \"This needs a priest or mage. I'm just a blacksmith.\"\n\n\"Already handled.\" Valdi gestured to his left.\n\nI turned.\n\nA young man stood there in white robes, the symbol of Goddess Rebecca embroidered on his chest. I blinked. *What the hell?* I hadn't noticed him at all. Even now, facing him directly, he gave off almost no presence. My instincts screamed warning.\n\nThe priest's expression remained neutral. \"I am Cassus. I serve Rebecca, the Goddess of Light.\" He inclined his head slightly. \"Please take care of me.\"\n\nHis nameplate glowed green. NPC.\n\n\"Right. Thanks.\" I kept my tone guarded.\n\nThe quest window materialized.\n\n> **[Business with the Administrator (2)]**\n> \n> **Difficulty:** AA\n> \n> Winston is defenseless after consecutive losses and heavy troop casualties.\n> \n> Administrator Valdi requires the Divine Shield to prepare for the Yatan Church's potential counterattack.\n> \n> You must work with Cassus, a priest serving Goddess Rebecca, to complete the Divine Shield.\n> \n> **Quest Clear Condition:** Deliver a Divine Shield of at least Epic rating within two days\n> \n> **Quest Acceptance Reward:** Learn Divine Shield production method  \n> **Quest Clear Reward:** Varies based on item quality delivered  \n> **Quest Failure:** Business relationship with Administrator cancelled. Quest destroyed.\n> \n> [Accept Quest?]\n\nNo reason to refuse. But I had a question.\n\n\"Is the Yatan Church actually likely to attack Winston?\"\n\nValdi folded his hands on the desk. \"For enemies to reach here, they must pass through Kinban Fortress. Kinban holds the elite northern army. A full invasion is unlikely.\" He paused. \"However, small strike teams could infiltrate and cause havoc. The Divine Shield is insurance against such tactics.\"\n\nMade sense.\n\n\"Hope my work helps, then.\"\n\n> [Quest Accepted.]\n\n> [Divine Shield production method acquired.]\n\nI opened my status window to confirm the new recipe.\n\n*Time to get to work.*"
}