{
  "id": 810,
  "title": "Chapter 810",
  "content": "\"What?\"\n\nGrid blinked, certain he'd misheard. Mercedes, hero of the Saharan Empire, standing before him in Reinhardt? \"A wandering knight? You *left* the empire?\"\n\nImpossible. Even if Mercedes wanted to leave, the emperor would never allow it. What kind of fool would release a legendary hero from service? Yet Grid found himself hoping anyway. Mercedes wasn't the type to joke—her serious nature made lies foreign to her.\n\n\"Is this... real?\"\n\n\"Yes.\"\n\n\"You're certain?\"\n\n\"I left. Or rather, I was expelled.\" Mercedes met his gaze steadily. \"Will Your Majesty accept me into his service?\"\n\n\"Ha!\" The laugh burst from Grid before he could stop it. Questions about her expulsion evaporated as pure joy flooded his mind. His hands moved before his thoughts caught up.\n\n\"I'm thrilled! Mercedes, you're more than welcome!\" Grid pulled her into a tight embrace, her slender frame fitting against him. She stiffened in surprise, but he barely noticed, holding on as if she might vanish. \"I never imagined this would happen!\"\n\nIf someone ranked warriors like trading cards, Mercedes would sit at the absolute pinnacle—and that was *before* her ascension to legend. Her current value? Immeasurable. The greatest knight on the continent, choosing to serve *him*. Grid's eyes burned. Somewhere beyond the sky, Khan had to be grinning.\n\nMercedes' face blazed crimson. Grid's smile radiated warmth, his chest felt solid beneath her cheek, and his breath ghosted hot against her ear. Gratitude welled up—for saving her from crisis, for healing the wounded heroes. But beneath that gratitude lay something deeper. Grid had awakened something in her heart she'd never felt before.\n\nShe'd been longing for him.\n\n\"I...\" Mercedes gave up resisting, her voice trembling as she rested her face against his chest. \"May I stay by your side?\"\n\n\"Always.\" Grid's answer came without hesitation. \"Stay with me forever.\"\n\nMercedes drew a shaky breath. \"I've lived twenty-seven years as a swordsman and a knight.\"\n\n\"I know.\"\n\n\"I don't understand how to be anything else.\"\n\n\"Huh? What do you mean?\"\n\n\"But I'll learn. I'll try my hardest.\"\n\n\"Thank you, Mercedes.\"\n\n\"As Your Majesty's knight and—and mis—\"\n\n\"Mis?\"\n\n\"Mis...!\" The word stuck in her throat. *Mistress*. She'd never experienced first love, never learned these unfamiliar terms. The confession spun circles in her mind, refusing to emerge. How could she say it aloud?\n\nGrid tilted his head. \"Mis-mis-mis? Like true-true-true?\"\n\n\"It's fine.\" Drunk on the euphoria of securing Mercedes' service, Grid dismissed his curiosity. \"Welcome to the Overgeared Kingdom.\"\n\nAnyone watching the exchange would've collapsed from sheer frustration.\n\n***\n\n[The level of Overgeared Skeleton One has risen!]  \n[The level of Overgeared Skeleton Two has risen!]\n\nThe journey from Titan to the border yielded unexpected rewards. Low-level monsters prowled the wilderness—perfect training targets for the Overgeared Skeletons.\n\n\"They're adorable.\" Mercedes' eyes sparkled like lanterns, fixed not on Noe or the rescued children, but on the skeletons. Her fascination bordered on obsessive.\n\nGrid clicked his tongue at her peculiar taste, though he had to admit the Overgeared Skeletons looked different from ordinary undead. Their skulls were proportioned oddly, with oversized eye sockets that gave them an almost endearing appearance. Perhaps Mercedes' interest wasn't so strange after all.\n\n*Clack! Clack clack!*\n\nThe skeletons' eyes curved into crescent moons as Mercedes patted their skulls. They liked her too.\n\n\"I've never seen undead express emotions,\" Mercedes murmured, genuine wonder in her voice.\n\n\"The empire doesn't have skeletons like these?\"\n\n\"Nowhere on the continent does. They possess empathy—almost lifelike self-awareness. They're extraordinary.\"\n\n\"Hmm.\" Grid nodded. The skeletons certainly qualified as special. They gained levels, equipped items, learned skills. More like pets than simple summons. However...\n\nThey were painfully weak.\n\nGrid pulled up their status windows.\n\n**[Overgeared Skeleton One]**\n\n**Lv. 70**  \n**Health:** 1,045/1,045 **Mana:** 3/3  \n**Strength:** 127 **Stamina:** 100  \n**Agility:** 127 **Intelligence:** 1  \n\n**Items Worn:**  \nWeapon: Sturdy Long Sword  \nSecondary Weapon: Silver Thread  \nArmor: Dependable Armor  \n\n**Exclusive Skills:** Silver Thread Shooting, Silver Thread Avoidance, Beginner Mining Technique Lv. 6, Beginner Sword Mastery Lv. 2, Beginner Petrification Resistance, Beginner Physical Resistance, Beginner Magic Resistance, Strike, Bite, Skull Headbutt\n\n**[Overgeared Skeleton Two]**\n\n**Lv. 70**  \n**Health:** 1,045/1,045 **Mana:** 525/525  \n**Strength:** 25 **Stamina:** 100  \n**Agility:** 55 **Intelligence:** 175  \n\n**Items Worn:**  \nWeapon: Sharp Dagger  \nSecondary Weapon: Good Shield  \nArmor: Dependable Armor  \n\n**Exclusive Skills:** Silver Thread Avoidance, Beginner Mining Technique Lv. 6, Beginner Mental Focus Lv. 1, Beginner Petrification Resistance, Beginner Magic Resistance, Beginner Instantaneous Acceleration, Strike, Bite, Skull Headbutt\n\nFive stat points per level. Growth potential, equipment capability, learning aptitude—all superior to standard undead. But skeletal frames imposed harsh limits. The Overgeared Skeletons remained fragile, their bones liable to scatter from strong winds or hard impacts like chopping white phosphorus wood.\n\nGrid had pumped points into stamina, yet their survivability stayed low. Explosions devastated them. He'd crafted armor to compensate, but...\n\n'At least they resist slashes and stabs well.'\n\nTheir evasion rate, specifically. Blades passed between ribs or missed bones entirely, attacks registering as failures. Pure luck, but it helped.\n\n\"The fundamental problem,\" Mercedes said, studying them, \"is they don't know how to fight.\"\n\nShe pointed at Overgeared Skeleton One. \"This one has excellent strength-to-agility balance. His movements should be swift, his strikes sharp. But his intelligence is too low—he can't properly utilize his physical gifts.\"\n\n\"He has Sword Mastery, though.\"\n\n\"Which requires intelligence to apply the techniques.\"\n\n\"Ah...\" That single point in intelligence. Grid made a mental note to adjust future stat distributions. His thoughts drifted to Jude. The talented knight no longer needed to guard Winston—perhaps it was time to bring him into closer service.\n\nMercedes turned to Overgeared Skeleton Two. \"This one's clever, but physically weak. He uses skills properly, but they lack impact.\"\n\n\"He's meant to become a mage,\" Grid explained. \"But I haven't taught him magic yet. And I'm not skilled at crafting magic equipment.\"\n\nUntil those gaps were filled, Overgeared Skeleton Two couldn't reach his potential.\n\n*Awooooo!*\n\nWolf howls split the air. Grid's gaze snapped upward. Direwolves descended on bat wings—level 200 monsters, far beyond the skeletons' capabilities.\n\nMercedes stepped forward, twin swords already in hand. She moved with surgical precision, blades threading between snapping jaws and piercing vital points. Clean. Efficient. The kind of swordsmanship Grid aspired to learn.\n\nThe Overgeared Skeletons watched with rapt attention. Overgeared Skeleton One's eye sockets widened. Suddenly he lunged at Overgeared Skeleton Two, knocking him over and snatching his dagger. The skeleton brandished both weapons, mimicking Mercedes' dual-sword stance.\n\n\"Interesting.\" Mercedes' clear eyes glinted with approval. She raised her blades and nodded at Overgeared Skeleton One. \"Very well. I'll teach you the basics.\"\n\nThe Overgeared Skeletons had found their mentor.\n\nMercedes demonstrated simple movements, techniques their frames could execute. Against every low-level monster they encountered, the skeletons practiced religiously.\n\n[The level of Overgeared Skeleton One has risen!]  \n[The level of Overgeared Skeleton Two has risen!]  \n[Overgeared Skeleton One and Overgeared Skeleton Two have acquired the skill 'Vaintz Swordsmanship'!]\n\n\"Incredible...\"\n\nTheir growth rate skyrocketed. Overgeared Skeleton One's development proved especially dramatic. Each intelligence point from leveling boosted his attack accuracy and evasion significantly. His durability remained abysmal, but broken limbs became less frequent.\n\n\"Teaching them is rewarding.\" Mercedes gently stroked their skulls. Grid suddenly felt an absurd desire to have his own head patted.\n\nHe shook off the thought. 'Didn't Braham favor them too?'\n\nThe prideful great magician had advised Grid to nurture the Overgeared Skeletons carefully. Both the legendary knight Mercedes and the legendary magician Braham recognized their potential. Perhaps these skeletons possessed far greater value than Grid had realized.\n\nHis expectations soared.\n\n***\n\nSeveral days later, Lauel greeted Grid at Reinhardt's gates. \"Have you been maintaining two households?\"\n\nThe other Overgeared members gaped. Grid had arrived with a woman and a crowd of children—the implications seemed obvious.\n\n\"What a vigorous king...\" someone muttered.\n\nVantner, forever single, wept bloody tears at the imagined harem.\n\n\"There are many people to meet.\" Mercedes removed her helmet, revealing her face and nameplate.\n\n\"The First Knight...!\" someone gasped.\n\nMercedes' reputation preceded her. Grid stepped forward with a formal introduction. \"Everyone, meet Mercedes. The legendary knight who'll be fighting alongside us from now on.\"\n\n\"*What*...?\" Lauel and the Overgeared members stared, eyes wide as saucers."
}