{
  "id": 811,
  "title": "Chapter 811",
  "content": "# Chapter: The Legendary Knight's Allegiance\n\nThe birth of a legendary knight dominated headlines across the world. Every media outlet scrambled to answer the same burning questions: Who had achieved this unprecedented transformation? What power did they now wield? How would this shift the balance of power in Satisfy?\n\nAnalytical broadcasts flooded the airwaves, each dissecting every scrap of information. The ratings spoke for themselves—the world was captivated.\n\nWithin the Overgeared Kingdom, however, the atmosphere was far from celebratory.\n\n\"It has to be someone from the Empire,\" Lauel said, his expression grim as the core members gathered. \"The Red Knights are the strongest order on the continent. And their First Knight—Mercedes—she's female.\"\n\nThe realization settled like a stone in their stomachs. They all remembered her. The woman who had forced Grid to his knees during their first encounter. If she had been formidable then, what would she be like now as a legend?\n\n\"We're going to get crushed,\" someone muttered.\n\nThe mood grew increasingly somber as the implications sank in. Then—\n\n\"Everyone,\" Grid's voice cut through the gloom as he entered the hall, \"I'd like you to meet someone.\"\n\nHe stepped aside, revealing the silver-haired woman beside him.\n\n\"This is Mercedes. She'll be fighting alongside us from now on.\"\n\nSilence.\n\nComplete, absolute silence.\n\nVantner broke it by slapping his own bald head. *Clap. Clap clap.* The sound echoed awkwardly through the hall as he tested whether he was dreaming. His scalp reddened like a boiled octopus. \"This... this isn't a dream?\"\n\nIt wasn't.\n\nThe Overgeared members stared, mouths agape, glancing between Grid and the legendary knight as if waiting for the punchline. They knew Grid had a gift for building rapport with NPCs, but this? And Mercedes wasn't just any NPC—she was the Empire's finest, renowned for her unwavering loyalty to the Emperor himself.\n\nNothing about this made sense.\n\nBefore anyone could voice their confusion, Mercedes moved. She knelt before Grid with fluid grace, her voice clear and formal.\n\n\"Your Majesty, forgive me, but your introduction was incomplete.\" Her gaze never left Grid's face. \"I am *your* knight before I am a legendary knight.\"\n\nThe morning sun caught her silver hair, casting her kneeling form in an almost ethereal glow. The image struck something primal in the watching crowd—a chill of recognition that history was being made.\n\n> **[You have recruited the legendary knight Mercedes.]**\n> \n> **City Buffs When Present:**\n> * City wall strength +50%\n> * Siege weapon power +20%\n> \n> **During Sieges:**\n> * Knights and soldiers under her command: Attack +10%, Defense +10%, Health +10%\n\n***\n\nThe explanation took time.\n\nGrid recounted everything: the hidden history between Mercedes and Piaro, the chandelier incident that freed the great demon Astaroth, Mercedes' near-death experience, and the desperate raid that followed. With each revelation, the Overgeared members' expressions shifted from confusion to understanding.\n\n\"Wait, back up,\" Vantner interrupted. \"Why would the Emperor just... *let her go*? She earned a legendary promotion by defeating a great demon. That's not the kind of asset you give away.\"\n\n\"Exactly,\" Zednos agreed. \"It doesn't add up. What if she's a spy?\"\n\nThe murmurs grew louder, suspicion spreading through the group like wildfire.\n\n\"Ah.\" Grid realized his mistake. He'd buried the lead. \"There's more. Mercedes explained on our way here.\"\n\nHe took a breath and continued, laying out the true relationship between Emperor Juander and Piaro—the guilt, the manipulation, the tragedy that had driven Piaro from the Empire's service.\n\nUnderstanding dawned across every face.\n\n\"The hidden story...\" Jishuka whispered.\n\n\"The Emperor sent her as atonement,\" Lauel concluded, his analytical mind piecing it together. \"For what happened to Piaro.\"\n\n\"He's trying to lift the burden of his guilt,\" Huroi added. \"Perhaps he hopes Piaro's remaining years might be peaceful.\"\n\n\"Even the continent's greatest power is human in the end,\" Peak Sword mused. \"How... unnecessary.\"\n\nThe revelation had an unexpected effect. The Saharan Empire had loomed as their inevitable enemy—vast, powerful, implacable. But knowing the Emperor carried such human regrets, that he would make this gesture for a single subordinate's peace... it was strangely moving.\n\nGrid's voice cut through their contemplation, sharp with warning.\n\n\"Don't soften.\" All eyes snapped to him. \"The Emperor achieved his atonement by sending Mercedes. He's shed his guilt, purged the shadow from his heart. That makes him more dangerous, not less.\"\n\nGrid had faced Juander directly. He'd seen the steel beneath the crown. Whatever sentiment had driven this decision, Juander remained the Emperor first and a man second.\n\nLauel nodded slowly. \"For now, he'll focus on consolidating internal power. The chandelier and demon incidents will have destabilized multiple factions.\"\n\n\"Which means there'll be blood as the court reorganizes,\" Grid agreed. \"We need to use that window. Build our strength while they're distracted.\"\n\nThe immediate crisis with Immortal had concluded—they'd been driven from the imperial palace. But vengeance was a dish best served cold, and there was work to be done in the meantime. Mercedes needed a proper knight order built around her. The Overgeared members who'd earned medals at the National Competition required new equipment to match their growth.\n\nGrid stood. \"Then let's begin.\"\n\nMore work. Always more work.\n\nThe weight settled on his shoulders, but he kept his expression neutral. His people needed to believe they could depend on him, and he would never let them see the exhaustion.\n\n***\n\nMercedes found him after the meeting disbanded.\n\n\"Aren't you tired?\"\n\nThe simple concern, delivered in her clear voice, somehow eased the fatigue grinding at his bones. Grid realized—with some amusement—that he'd been right about the power of beauty. Just looking at her lovely face made the burden lighter.\n\n\"Having you here helps,\" he admitted. \"Makes the work feel easier.\"\n\nMercedes tilted her head slightly, parsing his meaning with endearing confusion. Grid couldn't help but laugh.\n\nWhile she puzzled over his words, he took the opportunity to examine her status in detail.\n\n> **[Name: Mercedes]**\n> \n> **Age:** 27 | **Gender:** Female\n> \n> **Occupation:** Legendary Knight\n> \n> **Passive Effects:**\n> * Can equip all weapon and armor types without restriction (excluding magic weapons)\n> * Unlocks hidden properties of shields and heavy armor\n> * Can create personal knights (number increases with Complete Weapons Mastery skill level)\n> \n> **Title: Owner of Keen Insight**\n> * Penetrates the essence of all things\n> * Nullifies mental magic and trap effects\n> * Reveals target skills and abilities\n> * Reduces target's attack power and defense by up to 30%\n> \n> **Title: One who Became a Legend**\n> *(Additional effects hidden)*\n> \n> **Title: Becoming a Role Model**\n> * Knights and soldiers under command gain +30% growth rate with maximum loyalty\n> * When commanding in war: Allied morale highly resistant to deterioration; command transmission speed +50%\n> \n> **Level:** 457\n> \n> **Stats:**\n> * **Strength:** 3,231\n> * **Stamina:** 2,588\n> * **Agility:** 2,910\n> * **Intelligence:** 1,530\n> * **Leadership:** 2,512\n> \n> **Exclusive Skills:**\n> * Empire's Military Tactics (A+)\n> * Vaintz Swordsmanship (S)\n> * Eyes that can Read Combat (SS)\n> * Noble Bravery (SS)\n> * Knight's Resolution (SS)\n> * Shield Block (SS)\n> * Complete Weapons Mastery (???)\n> * Incomplete Predictions (???)\n> * Noble Chivalry (???)\n> * Silver Wings (???)\n> \n> **Description:**\n> *A scion of the Saharan Empire's most prestigious lineage, blessed with unparalleled insight. As she develops, her insight will evolve toward true precognition.*\n> \n> *Currently loyal to Player 'Grid.' No other player can build affinity with this NPC.*\n\nThe strongest. What other word fit?\n\nBut beyond the staggering stats, one detail made Grid's chest swell with satisfaction: *He was the only player in Satisfy who could build a relationship with Mercedes.* The sense of exclusivity was intoxicating.\n\n\"Have you had a chance to look around the capital?\" he asked.\n\n\"Yes.\" Mercedes' eyes brightened. \"Your Majesty, it's like heaven.\"\n\n\"Heaven?\"\n\n\"A city where even the poorest residents can smile. Where misfortune seems distant.\" Her gaze grew distant, thoughtful. \"And with both Piaro and Asmophel stationed here, your defenses are impeccable.\"\n\nMercedes had traveled the entire continent in the Empire's service. She'd walked the streets of hundreds of cities, from gleaming capitals to struggling border towns. Reinhardt ranked in her personal top five—she'd thought so during her first visit two months ago when delivering the imperial summons, and her impression had only strengthened.\n\n\"I appreciate that,\" Grid said. \"Have you seen Piaro yet?\"\n\n\"No. I searched every military facility in the city, but he wasn't there. I assume he's on an external assignment.\"\n\n\"Military facilities?\" Grid blinked. \"Why would you look for him there?\"\n\nMercedes stared at him, equally confused. \"Where else would he be?\"\n\n\"Ah.\" Grid opened his mouth, then closed it. He sighed heavily.\n\nHe'd been about to say *the agricultural fields*, only to realize how depressing that sounded. Piaro—the man who'd once been the Empire's greatest swordsman—was now most easily found among vegetables.\n\n*Originally, he should be in the military facilities...*\n\nThat had been true during Piaro's glory days. And in fairness, the farmer was still monstrously strong. Pounding Mortar and Fated to Perish could damage even great demons. In Natural State, Piaro's destructive power reached transcendent levels.\n\nBut most of his abilities now revolved around agriculture. If all those skills were combat-focused instead...\n\n\"Your Majesty?\"\n\nGrid looked up to find Mercedes watching him with concern, her clear eyes reflecting genuine worry. The sight lifted his spirits.\n\nHe smiled and took her small hands in his. \"Come on. Let's go find Piaro.\"\n\nMercedes' face flushed crimson, but Grid—focused on his destination—failed to notice.\n\n***\n\n\"Why is Piaro... *here*?\"\n\nMercedes stood at the edge of agricultural fields, watching Grid lead her farther from the city center. Her confusion deepened with each step.\n\nPiaro had earned the title of great swordsman. Why would such a warrior spend his time farming instead of pursuing the path to Sword Saint? Shouldn't he dedicate every waking hour to refining his technique?\n\n*He must need rest,* she concluded. *Even legends require recovery time.*\n\nThe full moon hung impossibly large in the night sky, casting silver light across the rice fields. The scene was tranquil, almost painfully beautiful. Mercedes walked beside Grid, drinking in the night sounds—wind through grain, distant cricket songs.\n\nHer heart hammered against her ribs.\n\nShe imagined finding Piaro gazing at the stars with his hands clasped behind his back, a dignified hero taking a moment of peace before returning to his eternal battle for mastery.\n\n*Puk! Puk puk!*\n\nMercedes froze mid-step.\n\nThat sound—something digging through earth. Multiple somethings. Her hand dropped to her sword hilt as decades of training screamed warnings. Meanwhile, Grid continued walking, oblivious.\n\nThe difference in their perception abilities couldn't have been clearer.\n\n\"Your Majesty.\" Mercedes moved silently in front of Grid, blocking his path. Her blade whispered free of its sheath. \"I hear digging. Someone's excavating a tunnel—likely planning to infiltrate the capital.\"\n\n\"Tunnel?\"\n\nFor a bizarre moment, Grid's mind supplied an image of North Korean operatives. Then he focused, straining his hearing until...\n\nYes. There. The rhythmic *thud-thud-thud* of something striking soil.\n\nGrid's eyes widened with recognition. That was a hand plow. He knew that sound intimately from countless hours of farming. But to Mercedes, who'd never worked a field in her life, it would sound exactly like covert digging.\n\n\"Leave this to me,\" Mercedes said, her voice dropping to a warrior's focus. \"I'll neutralize the infiltrators and extract information about who sent them.\"\n\n\"No, wait—!\"\n\nShe was already gone.\n\nSilver sword energy erupted around Mercedes' form like wings of light. The charge technique launched her forward in an explosive burst of speed. In the space of a heartbeat, dozens of meters separated them.\n\n*KUWAAAAAANG!*\n\nThe impact shook the earth. Distant sounds of combat rang out—metal on metal, shouts of surprise.\n\n\"Her personality is so...\" Grid searched for words. \"...direct.\"\n\nHe almost felt sorry for whoever eventually married her. The thought of trying to win an argument with Mercedes made him wince.\n\n*Kwa kwang! Kwa kwa kwa kwang!*\n\nThunder rolled across the fields. Wind pressure from the battle flattened entire rows of wheat. Grid's amusement evaporated, replaced by dawning horror.\n\n\"Who could possibly match her in combat out here?\"\n\nUnless...\n\n\"Oh no. Not again!\"\n\nPiaro. It had to be Piaro. And the old swordsman—meeting Mercedes after she'd achieved legendary status—would absolutely be unable to resist testing her growth.\n\nGrid broke into a run, his heart sinking.\n\nHe didn't want this fight to happen. Not because he feared for Mercedes—but because he couldn't bear to see Piaro defeated. His friend, his ally, his kingdom's guardian...\n\nWhat Grid didn't yet understand was this: he'd completely misjudged the situation.\n\nPiaro's true value was about to be revealed in the most spectacular way possible."
}