{
  "id": 812,
  "title": "Chapter 812",
  "content": "Moonlight bathed the fields as Piaro worked the soil with his hand plow. Tonight's full moon provided perfect conditions for planting the bloody tomato—a new strain he'd developed with help from his work in the vampire cities.\n\n\"Field work truly is enjoyable.\"\n\nEvery swing of the plow reaffirmed what he'd always known: farming was serious business. Dig into the hard earth. Plant the seeds. Cover them with fresh soil. Each repetition of this ancient rhythm trained his muscles more efficiently than any sword drill, building strength with every motion.\n\n\"All thanks to good health and clean outdoor air.\"\n\nHe drew a deep breath, filling his lungs. Perhaps it was fanciful, but each inhalation felt like it added a day to his life. Such sensations were impossible in the vampire cities below—those underground labyrinths where air grew stale and the sun never touched skin.\n\nStill...\n\n\"I'll need to return soon.\"\n\nHe couldn't avoid it, regardless of his preferences. Noll's blood was too valuable for farming, rich with nutrients that could revolutionize his potato strains. With the vampire earl's help, Piaro might finally unlock the secret of cultivating golden walnuts.\n\n*Tomorrow I'll bid His Majesty farewell.*\n\nHe'd returned to Reinhardt solely to ensure Grid's safety during the imperial visit. Now that Grid had come home unharmed, there was no reason to linger.\n\n*I should visit him.* But the hour was too late. Waking Grid would be discourteous, especially given Piaro's recent habit of working through the night and sleeping past dawn.\n\n\"Hmm?\"\n\nPiaro's hands stilled on the plow. Something had shifted in the atmosphere, perhaps three hundred meters distant.\n\nThe farmland remained quiet. Only the hooting of night owls broke the silence. Yet Piaro's certainty didn't waver—someone approached. His years of farming by sun, earth, water, and wind had honed his senses until they could detect even subtle disturbances in the air.\n\n\"Over there!\"\n\nA woman's cry pierced the night. Her footsteps had been silent—unconsciously so, he realized, evidence of considerable skill. Before Piaro could react, another shout rang out:\n\n\"Stop!\"\n\nThis voice came from the woman's right flank.\n\n\"...What?\"\n\nShock rippled through Piaro as the woman's speed registered. She'd closed dozens of meters in a heartbeat, materializing within his field of vision like morning mist.\n\n\"An unexpected guest indeed.\"\n\nRecognition sparked as moonlight illuminated her face. Piaro's expression brightened.\n\n\"P-Piaro?!\" Mercedes' eyes went wide as she identified the figure working the field. \n\nHow had she trained? What methods had produced such explosive growth? Piaro's fighting spirit ignited, blazing hot. \"You've improved dramatically in just one month!\"\n\nHe didn't waste time with pointless questions about her presence here. Instead, he swung his hand plow, driven by the dream every warrior holds—to duel someone strong.\n\n\"What...?\"\n\nMercedes recoiled. An old hero, encountered in the most bizarre circumstances imaginable. Instead of warm reunion, he attacked without preamble? Moreover, with farming equipment!\n\nHer sword flashed up defensively, frown creasing her brow. *He feels different than before.*\n\nA month ago, she'd already faced Piaro's power when Grid ordered him to test her. His attacks with sickle and hand plow instead of proper weapons had been surprising then. But now Mercedes had ascended to legend herself. Without Piaro drawing his sword, she should easily counter his agricultural implements.\n\nYet she couldn't.\n\nThis was farmland—Piaro's domain. The aura of nature amplified his strength the way hell empowered Demon Slayer Yura. Grid had overlooked this principle because he gained no such advantage fighting in his smithy.\n\n\"Kugh...!\"\n\nPiaro pressed his advantage relentlessly, exploiting the hand plow's compact reach and swift recovery. His strikes carried more threat than a month prior. Mercedes found herself forced onto the defensive, blade moving in desperate parries.\n\n\"As expected of Piaro...! You've grown even stronger in such a short time!\"\n\nFacing legendary power with farm tools...!\n\nSomething felt off, yet Mercedes didn't question why Piaro attacked. She knew his obsession with strength too well. Drawing her second sword, she called out while blocking another plow strike:\n\n\"Are you finally reaching the level of Sword Saint?\"\n\nIf so...\n\n\"Then I'll help you!\"\n\nShe'd duel with everything she had, helping this old hero achieve the next realm. Silver sword energy erupted behind her—wings of light, beautiful and terrible. The silver wings spread wide, granting limited flight while constantly projecting cutting force toward her opponent.\n\nMercedes' full power collided with Piaro. Storm winds howled across the farmland, tearing up soil and hurling grain into the air.\n\n\"I'm no longer the young girl from your memories. Draw your sword.\"\n\nBut Piaro remained stubborn. Instead of steel, he drew a sickle. Now both hands were armed—hand plow and harvesting blade.\n\nMercedes' expression hardened. \"...You'll regret this.\"\n\nShe needed to demonstrate how far she'd grown. Not merely for acknowledgment—she had to prove herself worthy of standing among Grid's companions.\n\n\"Sword of Honor.\"\n\nHer dual blades converged on a single point. Wings beating, she launched into a devastating assault that forced Piaro to defend desperately.\n\n*Ha!*\n\nPiaro barely caught the thrust—so fast ordinary eyes couldn't track it. Yet even Grid's personally crafted tools, forged from Great Demon Belial's materials, showed hairline cracks under the strain.\n\nNot because Mercedes' swords surpassed Grid's craftsmanship. Simply because farming equipment used far less metal than weapons, sacrificing durability for other purposes.\n\nMercedes had already identified this weakness.\n\n*She planned to exploit it from the start.* \n\nPiaro's admiration flared even as he twisted his crossed implements.\n\n*Clang!*\n\n\"...!\"\n\nMercedes' blade skidded aside. Piaro anticipated her losing balance, stumbling off-center.\n\n\"Hah!\"\n\nInstead, transcendent footwork kept her stable. Her second sword grazed Piaro's chest as she pivoted, upper body flowing with the motion.\n\n\"Please—draw your sword now.\"\n\n\"The hand plow and sickle are my finest weapons. Why would I draw a sword?\"\n\n\"Stubborn to the end...!\"\n\nHad twelve years of hardship warped Piaro this way? Mercedes felt certain of it. *Clearly, Piaro has regressed.*\n\nHow could anyone progress under such circumstances? When survival itself demanded every ounce of strength? Mercedes concluded that suffering had narrowed his mind, trapped him in old patterns.\n\n\"Knight's Resolution.\"\n\nEnergy coalesced on her chest as an ethereal blade. Her mind and body surged with enhanced power. A sense of duty crystallized within her—the obligation to defeat Piaro here, to force him to face painful reality and seize the chance for further growth.\n\n*Piaro must become a Sword Saint.*\n\nWhat of Kraugel? She refused to accept some unknown upstart suddenly claiming that title. The moment Mercedes solidified her resolve—\n\n\"Free Farming 7th Style.\"\n\nThousands of seeds scattered through the air, flung wide by the aftermath of their clash.\n\n\"Polishing.\"\n\n\"...?!\"\n\n*BOOM BOOM BOOM!*\n\nExplosions rippled across ground and sky in a devastating chain. Thousands—no, tens of thousands—of detonations. Each individual seed produced only a modest blast, yet collectively they rivaled magical bombardment in scale.\n\n\"Agh...!\"\n\nMercedes found herself trapped in the blasting zone, unable to advance even one step. She wrapped herself in silver sword energy, desperately minimizing damage.\n\n*What is this...?*\n\nSeeds that exploded on command? Could sword energy truly manipulate them in such a fashion?\n\n*Impossible!*\n\nMercedes curled within her protective wings, finally understanding. Piaro had already reached her realm. Which meant...\n\n\"A Sword Saint...\"\n\nThe explosions ceased. Mercedes' wings unfurled, tattered but intact, her expression radiant with joy.\n\n\"Are you already a Sword Saint?\"\n\nShe'd hoped to witness the resurrection of an old hero. Piaro brutally crushed that expectation.\n\n\"No. I am a farmer.\"\n\n\"...?\"\n\nWas he *still* joking? Mercedes opened her mouth to protest—then Piaro produced a pitchfork.\n\n\"Free Farming 4th Style: Plowing the Field.\"\n\n*CRACK-CRACK-CRACK!*\n\nThe earth around Mercedes tore open in moments, freshly tilled.\n\n\"Sowing Seeds! Grow!\"\n\nNew crops took root. Piaro channeled nature's energy, accelerating their growth to maturity.\n\n\"...\"\n\nMercedes stood stunned, suddenly surrounded by a golden wheat field.\n\nIt was going to be a long night."
}