{
  "id": 813,
  "title": "Chapter 813",
  "content": "They called themselves the \"Five Pillars\"—the men who supposedly held the empire aloft. Yet Mercedes, along with most of the imperial court, couldn't bring herself to acknowledge them. Not because they were weak—far from it. They simply hadn't *done* anything. Their strength existed in a vacuum, shielding the Emperor while accomplishing nothing of substance.\n\nThe balance they maintained was hollow compared to the former pillars: Piaro and Asmophel. Those two had crushed countless enemies and saved countless lives. They were paragons—inspirations to commoner and noble alike, pulling the empire back from the brink time and time again, giving courage to all who called themselves Saharans.\n\nPiaro and Asmophel had been *great*.\n\n\"...A farmer.\"\n\n*Don't be absurd.* Mercedes choked on the words she wanted to scream. Her Insight skill was firing alarm after alarm—this wasn't an illusion, no trick of the light. Piaro's farming techniques had genuinely transformed barren earth into fertile fields in a matter of seconds.\n\n\"Why...\" Mercedes' face drained of color, her lips trembling despite her clenched jaw. She desperately wanted this to be a nightmare.\n\nIt wasn't.\n\n\"Why are you a farmer?\"\n\nThe occupation belonged exclusively to peasants.\n\nMercedes cared for the common folk—truly, she did. She'd been taught that dignity existed in all professions, and she believed it. But she was still nobility to her core. The man she'd admired for so long, the legend she'd idolized... reduced to this? Her mind rejected it wholesale.\n\nPiaro understood her turmoil—he'd once been nobility himself. But now...\n\n\"I like being a farmer far more than I ever liked being a great swordsman.\"\n\nHe hefted his pitchfork, then pulled out a flail—a simple tool for threshing grain.\n\n\"No profession is inherently superior to another. If anything, a farmer is nobler than any swordsman or Sword Saint. Without farmers, there's no food. Without food, humanity never would have developed civilization. Never would have found happiness.\"\n\n\"...\"\n\nMercedes' mind recoiled. *Without hunters, we'd have no meat or leather either.* Piaro's absolutism felt extreme, wrong. But beneath her rejection, another emotion stirred—a sense of duty. For twelve years, she'd carried the weight of wanting to help the \"broken\" Piaro escape his hellish existence.\n\n\"We don't have time for philosophy.\"\n\nHer tattered silver wings blazed with renewed brilliance.\n\n*Kuooooh!*\n\nMercedes' twin blades erupted in radiance, pure white light swallowing the darkness and drowning out even the moon.\n\n\"Piaro! Come back to yourself!\"\n\nHer assault was magnificent. Devastating. Blinding arcs of light carved wounds across Piaro's body—his thin farming clothes offered no protection against her razor-sharp technique. But the real problem came when Mercedes switched tactics. She built up damage relentlessly, never giving him a moment to recover, always repositioning to avoid counterattacks.\n\nPiaro remained persistent. His Rapid Growth ability wove barriers of living plants, intercepting ranged strikes. Rice, wheat, potatoes, cabbage—all became weapons spinning through the air.\n\n\"...!\" Mercedes retreated. The vegetation contracted as if to explode—but this time, they didn't. Instead, they *struck*.\n\nPiaro chained the attack into Free Farming Style Six. A barrage. Unrelenting.\n\nThe flail caught Mercedes square in the back.\n\nShe staggered. Her worn leather armor provided pitiful defense; the pain eclipsed anything she'd felt from blades or spears. But worse than the physical agony was the humiliation—a noble knight, beaten by a *farmer*. The mental anguish cut deeper than any wound.\n\n\"See? This is a farmer's power! I'm stronger and healthier than I ever was as a swordsman. I can bring happiness to more people! This is my calling!\"\n\n\"Gh...!\"\n\n\"This is my path!\"\n\nThe earth convulsed.\n\nTwo legends colliding produced a spectacle rivaling a great demon raid. The scale was incomprehensible—every field in their path simply ceased to exist. Grid watched from a safe distance, throat dry.\n\n\"A clash of titans...\"\n\nTrue enough. But that wasn't his primary concern. Awe had seized him completely.\n\n*Was Piaro always this monstrous?*\n\nCrops detonated in rapid-fire succession. Plants erupted from the soil, coiling around Mercedes' limbs like living chains. Her perfect weapon-swapping technique—sword, axe, bow, shield, spear, switching seamlessly based on circumstance—crumbled before the onslaught of vegetation that refused to stop growing.\n\nWas this another nerf? Had Mercedes been weakened the moment she joined his side?\n\nNo. Mercedes was still formidable. Piaro was simply *stronger*.\n\nGrid's eyes widened with belated understanding.\n\n\"The farmland...\"\n\nThese fields had been Piaro's domain for years.\n\n\"It's *his* territory...!\"\n\nPiaro had transcended the limits of an ordinary NPC. The legendary Piaro was effectively a boss monster. Grid's heart hammered with excitement—he'd always relied on Piaro's overwhelming strength, but this...\n\nAny regret about Piaro becoming a farmer? Evaporated. Piaro was fighting at a level that made Sword Saint Kraugel look tame.\n\n\"Piaro!\" Grid's shout carried across the battlefield. \"Show me the power of the strongest!\"\n\nThe cry pierced through the cacophony of colliding weapons and struck Piaro's ears. His grip on the farming implements trembled.\n\n\"If that is Your Majesty's wish...!\"\n\nWind howled. Mercedes' silver wings thrashed like a bird caught in a hurricane. Piaro's hands began to rotate.\n\n\"Free Farming!\"\n\n\"...!!\" Mercedes' eyes went wide as both her swords were sucked into Piaro's spinning grip.\n\n*Supreme Swordsmanship Fourth Style...!*\n\nPiaro's old technique had helped bring down the great demon Astaroth.\n\n\"Watermill!\"\n\nNow it had been sublimated, transformed into something more devastating. The technique neutralized Mercedes' weapons entirely and sent tremors through the earth. A pillar of water erupted skyward, slamming into Mercedes with the force of a tsunami.\n\n\"Ah...\"\n\nAs Mercedes sailed through the air, clarity struck her.\n\n*No occupation is nobler than another.*\n\nHer worldview shattered and reformed in an instant. First Knight Mercedes established her first chivalric code:\n\n*Never prejudge.*\n\n[Legendary Knight Mercedes has created a new chivalric code.]\n\n[All stats increased by 10%. Chance of weak point exposure decreased by 80%.]\n\n\"...?\" Grid's jaw dropped as he watched.\n\nMercedes crashed to the ground, then bowed her head to Piaro.\n\n\"We've been reunited after twelve years. I couldn't show you my growth, yet you still taught me. I'm ashamed and grateful.\"\n\n\"I've learned much as well. I couldn't guarantee victory if you'd fought at full strength.\"\n\n\"No. I would have lost regardless.\"\n\n\"Huhu, you're too modest.\"\n\nThe night deepened around a warm scene.\n\n***\n\n\"You're leaving already?\"\n\nAfter talking through the night, Mercedes and Piaro approached Grid in the morning. Piaro announced his intention to depart for the vampire cities.\n\n\"Yes. Now that the finest knight stands at Your Majesty's side, I can leave without worry.\"\n\n\"Why the rush? It's been so long since you saw Mercedes. Stay a few more days.\"\n\nGrid valued Piaro too much to see him stressed. Piaro's answer caught him off guard.\n\n\"I was shaken when I heard about Khan. If I'd succeeded in cultivating the golden walnut just a bit sooner... he might have lived longer.\"\n\nKhan's sudden death had struck Grid hard. That same grief and regret now lived in Piaro.\n\n\"Your Majesty, I'm going to work even harder.\"\n\n\"...\"\n\nPiaro's sincerity was palpable. Grid couldn't stop him anymore. He clasped Piaro's hands firmly.\n\n\"Thank you. But promise me this—don't overdo it. I won't forgive you if you leave like Khan did.\"\n\n\"...Yes.\"\n\nMercedes smiled at the touching exchange between lord and retainer.\n\n\"Piaro, wait!\"\n\nAdministrator Rabbit came jogging over. He bowed politely to Grid, then thrust a document at Piaro.\n\n\"This is the bill for damages to the farmland from last night! I'm deducting it from your pay!\"\n\n\"...\"\n\nThe Overgeared Kingdom's steady progress during Grid's absence was built on people like this working tirelessly.\n\n***\n\n\"Remarkable children.\"\n\nSage Sticks, now principal of Overgeared Academy, couldn't stop smiling.\n\n\"They were slow learners at first—common sense didn't come easily. But once they grasped the fundamentals, their development exploded. All twenty-three will undoubtedly become great scholars and magicians.\"\n\nHe was referring to the children Grid had rescued from the Tower of Eternity. Once mistaken for Grid's offspring, they'd recently become the talk of the kingdom—their intellects were genuinely prodigious.\n\nGrid grinned. \"That's wonderful news. Are they healthy?\"\n\n\"Yes. The shadows in their hearts have lifted. I believe the affection Your Majesty showed them during the rescue healed many wounds. You did well. Very well.\"\n\nSticks' gaze was warm.\n\nThe noble elves had always despised humanity's selfish and violent tendencies. Had any elf in history felt genuine affection for humans?\n\nNone.\n\nYet Sticks held great affection for Grid, who'd given him new perspectives. Thanks to Grid, he'd discarded his prejudices. The transformation had been swift.\n\nSimultaneously...\n\n\"Finally found it.\"\n\nMerchant King Kir became the first player to discover the World Tree's Forest. A species quest was about to unlock—though in the worst possible form."
}