{
  "id": 814,
  "title": "Chapter 814",
  "content": "Last year's player census revealed that over forty-one million users had chosen the Merchant class—rivaling even Swordsman and Magician in popularity. The reason was simple: in a world where virtual goods converted to real-world currency, playing Merchant wasn't just a game choice. It was an investment.\n\nOf course, most merchants failed. The market was ruthless, and dreams of wealth often shattered against cold economic reality. But a select few transcended the masses, accumulating fortunes that made headlines across the real world.\n\nFirst among them stood Kir.\n\nHe'd built the first player-run company in Satisfy's history, leveraging that advantage into a sprawling commercial empire. Tens of thousands of employees now operated under his banner. Some called him the Merchant King—though never to his face, for Kir cultivated an image of refined humility that belied the cutthroat businessman beneath.\n\n\"Finally.\"\n\nPlatinum hair caught the dappled sunlight filtering through ancient branches. Emerald eyes gleamed with satisfaction as Kir surveyed the pristine wilderness stretching before him. The World Tree's Forest. The Elven territories. And he was the first player to breach its borders.\n\n[You are the first player to discover the Elven Territory!]\n\n[An achievement for the history books! First Discovery grants numerous benefits!]\n\n[Elven Affinity builds 50% faster. All purchases in elven settlements receive a 20% discount, while goods sold fetch 20% higher prices.]\n\n[Experience gain increased by 20% throughout elven lands. Item drop rate increased by 10%.]\n\n[Permanent bonus: Mana Regeneration +8%.]\n\nA slow smile spread across Kir's aristocratic features. \"Better than expected.\"\n\nHe glanced over his shoulder. \"You can enter now.\"\n\nEight figures emerged from the forest boundary, all clad in expensive gear that marked them as high-level players. One of them, a mage named Boutian, paused to cast a detection spell.\n\n\"Magic Detection.\"\n\nInvisible tendrils of mana spiraled outward, probing the surroundings. After a moment, Boutian reported, \"Small animals only. No elven patrols at the perimeter—they're not maintaining any defensive wards here.\"\n\n\"Peaceful,\" someone murmured.\n\n\"Hundreds of years without contact,\" another added. \"Can you blame them for dropping their guard?\"\n\nKir's smile deepened, though something shifted in his expression—a coldness seeping through the genteel mask. \"Unfortunate that I won't get to enjoy the full benefits of this discovery, but—\"\n\nHe never finished the sentence.\n\nSteel flashed. His own companions moved as one, blades singing from their sheaths. The first strike caught him across the ribs.\n\n\"Guh!\" Kir staggered, blood soaking through his merchant's robes.\n\nMerchants invested nothing in physical stats. Despite his expensive armor, his defense was pathetic. Two more strikes sent his health plummeting into critical range.\n\n\"D-Dammit!\" He turned and ran, crashing through the underbrush. \"Help! Someone—anyone!\"\n\nHis shouts echoed uselessly through the trees. Behind him, his former colleagues laughed.\n\n\"Where exactly are you running to?\" one called mockingly. \"Those merchant legs won't carry you far.\"\n\n\"Does he expect a bear to save him? Hilarious!\"\n\nThey pursued at a leisurely pace, savoring his terror. Branches whipped Kir's face as he stumbled deeper into the forest. His health continued dropping from bleeding damage. The hunters followed, unhurried, driving him forward like dogs herding wounded prey.\n\nFinally, a woman's voice cut through the chase. \"Enough games. Let's finish this.\"\n\nShe'd been picking her way carefully through the brush, unwilling to soil her equipment. Now impatience hardened her features. She closed the distance in three strides, scimitar materializing in her hand.\n\nKir collapsed against a tree trunk, gasping. \"W-Why? We're partners! What did I do to—\"\n\n\"Partners?\" The woman's laugh was knife-edged. \"We wanted your gold, you naive fool. That's all you've ever been to us—a walking treasury.\" She pressed the blade to his throat, drawing a thin line of blood. \"So here's how this works. You transfer enough wealth to satisfy us, and we let you respawn with your precious levels intact. Refuse...\" The blade bit deeper. \"Well. You seem like a smart man.\"\n\nKir's expression cycled through terror, betrayal, frustration—and finally settled on righteous fury. \"Using people for their money... You're worse than beasts!\"\n\n\"Oh, sweetie.\" The woman's smile never wavered. \"We're people. Most people are exactly this greedy—you're the freak for pretending otherwise. We're just more honest about it.\" The scimitar drew another bead of blood. \"Now. Pay up.\"\n\nKir's throat worked as he swallowed. \"Never.\"\n\n\"Excuse me?\"\n\n\"Justice screams in my heart!\" His voice rose, trembling with emotion. \"I'd rather die with honor than submit to extortion! If I surrender now, you'll just do this again—create new victims, perpetuate the cycle!\"\n\nThe woman blinked. \"Are you insane?\"\n\n\"No! I'm more clear-headed than I've ever been!\" Kir's eyes blazed with conviction. \"I absolutely will not yield!\"\n\n\"What a freak.\" She raised the scimitar. \"Then die.\"\n\n*Thunk.*\n\nAn arrow sprouted from the woman's shoulder.\n\n\"What—?\" She spun, weapon raised, as her companions scrambled for their own weapons. \"Who's there?\"\n\n\"Intruders in this forest?\" another voice called. \"Impossible!\"\n\nThe underbrush parted like a curtain. \n\nShe was beautiful in the way legends described elves—features so perfect they seemed carved rather than born, proportions that violated human possibility. Pointed ears swept back through white hair that seemed to glow with its own luminescence. But it was her eyes that froze the would-be murderers in place: cold, ancient, and utterly without mercy.\n\n\"E-Elf...\"\n\n\"We're in an *elven forest*?\"\n\nReality crashed over them. Elves numbered barely a hundred thousand across the entire continent, yet they held their territories through sheer individual might. Their archery was legendary. Their spirit magic, devastating. Even the Empire's armies had learned to avoid elven borders.\n\nAs one, the humans sheathed their weapons and raised their hands.\n\nThe white-haired elf—Beniyaru—kept her bow drawn, arrow nocked and aimed. \"Leave this sacred place immediately. Your corruption has no place among these trees.\"\n\n\"Y-Yes! Of course! Right away!\"\n\nThey fled without a backward glance, stumbling over roots in their haste. Kir was instantly forgotten, abandoned to his fate.\n\nBeniyaru watched them go, then lowered her bow with a disgusted expression. \"The wards must be failing if humans can wander in so easily.\" She turned to examine Kir, who remained slumped against the tree. \"You.\"\n\n\"Th-Thank you!\" Kir bowed his head deeply. \"I'll repay this kindness, I swear it!\"\n\n\"Unnecessary.\" Her tone remained cool, though curiosity flickered in her eyes.\n\n\"Of course—I'll leave immediately.\" Kir tried to stand, managed two steps, and collapsed as his wounded legs gave out. \"I'm so sorry. Just... need a moment to catch my breath. Then I'll go, I promise.\"\n\nBeniyaru studied him. His face was open, honest, untainted by the calculating greed that marked most humans. The conversation she'd overheard replayed in her mind: *I'd rather die with honor than submit...*\n\n\"I heard what you told them,\" she said. \"You would truly choose death over compromise?\"\n\nKir smiled—small, self-deprecating. \"Call me foolish if you want. But I despise greed. I'd rather die than reward that kind of behavior.\"\n\nSomething shifted in Beniyaru's expression. The frost thawed, just slightly.\n\n\"Follow me,\" she said. \"I'll take you to our village.\"\n\nKir's eyes widened. \"But... I'm human. Would your people even allow—?\"\n\n\"You're different from the others. The first guest we've had in hundreds of years.\" She turned, already moving. \"Stay until your wounds heal and those vultures outside have moved on.\"\n\n\"Thank you!\" The gratitude in Kir's voice seemed genuine enough to move stone.\n\nHis innocent smile sparked no suspicion in the elf's ancient instincts. The Merchant class's natural charm, combined with his first-discovery bonuses, wove a perfect web of trust.\n\nAs he followed Beniyaru deeper into the forest, Kir opened his messaging interface.\n\n*—Wait one more day before departing,* he whispered to his \"attacker.\"\n\n*—Understood,* came the reply from the woman who'd held a blade to his throat minutes ago.\n\nIt had all been theater. Every word, every wound, every desperate plea—a performance designed to manufacture exactly this outcome. Natural access to elven territory, earned through apparent virtue and victimhood.\n\nKir's smile, hidden behind Beniyaru's back, held nothing innocent at all.\n\n***\n\nGrid stared at the interface panel, barely believing what he was reading.\n\n**—Candidates for Knight Division Leadership—**\n\n**[Mercedes]**\n\n*[Maximum Division Size: 50 knights]*\n\n*[Division Buffs: Physical Damage +12%, Defense +12%, Attack Speed +5%, Movement Speed +7%]*\n\n*[Effects are permanent while members remain in the division]*\n\n*[Passive Skills: Health Regeneration (High), Mana Regeneration (Medium), Stamina Conservation (High)]*\n\n\"This is...\"\n\nOnly two NPCs had ever qualified for knight division leadership before: Piaro and Asmophel. Even Chucksley, one of the Eternal Kingdom's finest knights, hadn't met the threshold. Which meant any NPC who *could* lead a division was inherently exceptional.\n\nBut Mercedes didn't just clear the bar. She shattered it.\n\nPiaro's division granted +10% attack power, +3% attack speed, and +5% movement speed—already powerful enough that Grid considered him invaluable. Asmophel provided +5% magic damage and -8% skill cooldown, which made mage divisions devastating.\n\nMercedes offered *double* their benefits.\n\n+12% to both attack and defense was comparable to wearing enhanced legendary gear. For high-level players like Chris and Pon, these buffs would be game-changing. Add in the passive regeneration effects, and Mercedes' division would be unstoppable.\n\nGrid swallowed hard. After a long moment, he spoke.\n\n\"Mercedes.\"\n\n\"Yes, Your Majesty?\"\n\n\"Can I... join your knights division?\"\n\nSilence.\n\n\"That's... not possible, is it?\" Grid forced a laugh. It sounded hollow even to his own ears. Inside, regret gnawed at him like acid.\n\n[The Legendary Knights' Overgeared Division has been created.]\n\nA third division joined the Overgeared Knights and Overgeared Magicians. Membership would be restricted to the absolute elite—those who'd proven themselves time and again in service to the kingdom.\n\nLauel, whose contributions and skill level qualified him immediately, accepted the invitation and stared at his status screen.\n\n\"The Legendary Overgeared Knights Division...\" His voice cracked. \"I'm really...\"\n\nHe should have been overjoyed. The stat bonuses alone would make him significantly more powerful. But as he read the numbers, tears began streaming down his face.\n\nLauel understood what Grid could not: being strong enough to *lead* such a division versus being strong enough to merely *join* it. The gap between Grid and Mercedes had never been clearer.\n\nAnd that realization broke his heart."
}