{
  "id": 815,
  "title": "Chapter 815",
  "content": "This happened shortly after Grid established the Knights Division.\n\n\"My armor?\" Mercedes blinked at Grid's summons, confusion evident on her face. \"Your Majesty intends to craft armor... for me?\"\n\n\"That's right.\"\n\nThe words struck Mercedes like a thunderbolt. \"Absolutely not. A king doesn't labor for his subjects.\"\n\nShe knew Grid had started as a blacksmith—everyone did. But this violated every principle of proper hierarchy. What monarch in history had ever put their own convenience aside to personally craft equipment for a knight? The very idea was backwards.\n\n\"Please reconsider, Your Majesty.\"\n\nGrid shook his head. \"It's not just for you—it's for me as well. Your strength is my strength. Don't feel burdened by this.\"\n\nMercedes specialized in heavy armor. The leather armor she'd been wearing while competing against Piaro on the farms had never suited her properly. She was fighting at a disadvantage, and Grid couldn't stand to see that continue. He wanted her at full strength as soon as possible.\n\n\"Let's go. I have several items to forge besides your armor.\"\n\n\"...Very well.\" Mercedes finally yielded, bowing deeply. Her respect for Grid deepened with each passing day.\n\n***\n\n\"Would your parents be proud, knowing you'll die here in the dark?\"\n\n\"You—! Don't you dare mention my parents!\"\n\n\"I pity them, truly. Imagine raising a child only to watch them throw their life away in a dungeon cell.\"\n\n\"...\"\n\nDeep beneath Reinhardt's castle, a terrible criminal festered in chains.\n\nReidorn—the assassin who had tried to murder Grid during the kingdom's founding ceremony. Finding his backers had become a priority, which meant interrogation. Huroi, the kingdom's top-ranked Orator, had taken personal charge of the questioning. Every day followed the same pattern.\n\n\"If you ever want to see them again, just tell me! How does a motherless bastard like you find the courage to target King Grid?!\"\n\n\"Kuk... kukuk!\" Reidorn's laughter came out bitter. \"How many times must I repeat myself? It was my decision alone. No one gave me orders.\"\n\n\"The king of a nation... you expect anyone to believe you planned regicide on your own initiative? That you picked the founding ceremony out of sheer inspiration? Even your parents wouldn't believe such an obvious lie!\"\n\n\"Bastard!\" Reidorn struggled against his bonds, composure shattered once again. \"I told you—stop bringing up my parents!\"\n\n\"Why so angry? I'm not cursing them.\"\n\nIt was true—Huroi wasn't insulting Reidorn's parents. He simply mentioned them frequently. Yet every single mention sent Reidorn into a rage. That was the insidious nature of the Taunt skill at work.\n\nHuroi activated Taunt every time he referenced the man's family, triggering an involuntary emotional response. The efficiency was questionable, but Huroi found the method personally satisfying.\n\n\"Hrmm...\" Huroi studied his prisoner—bound, growling, and unbroken after more than six months of confinement. The man's resilience demanded grudging respect. \"I didn't want to resort to this... tsk.\" Shadows gathered under Huroi's eyes, and his expression turned reluctant.\n\nReidorn's heart began to pound. 'Is he finally bringing out the real torture tools?'\n\nHe swallowed hard, body trembling despite his best efforts. But his mind remained steel. 'I'll never break.'\n\nHe couldn't reveal his identity as a Red Knight—as a solo number knight of the Saharan Empire. The assassination attempt had been his own decision, made without orders. He'd recognized the threat Grid posed to the empire and acted on that assessment. If the truth came out, it would trigger a diplomatic crisis. Grid's power, which Reidorn had witnessed firsthand, was exactly the kind of threat the empire couldn't ignore.\n\n'I'd rather die than talk.'\n\nHis heartbeat thundered in his ears as fear crept through his veins.\n\n\"Bring it in,\" Huroi ordered.\n\nGuards entered carrying a small wooden box.\n\nReidorn's imagination spiraled into dark territory. An eye-gouging device? Finger-breaking implements? His face went pale as Huroi opened the container before him.\n\nInside...\n\n*Chirp! Chirp!*\n\nA chick. Small, yellow, impossibly cute.\n\n\"...?\" Reidorn's mind went blank. Where were the torture instruments? Why was there a baby bird in the box? His confusion deepened as the tiny creature waddled toward him.\n\n*Chirp chirp!* The chick's black bead-eyes peered up at Reidorn, apparently mistaking the prisoner for its mother. After months of daily torture, the sight of something innocent and vulnerable cracked Reidorn's armor. He felt the ghost of a smile tug at his lips. An almost forgotten instinct urged him to reach out and stroke the soft down.\n\nHuroi's voice cut through the moment like ice. \"Something urgent requires my attention. I won't be returning for several days. Enjoy your peace.\"\n\n\"Wait—what are you planning? What's the chick for?\"\n\n\"You don't know?\"\n\nHuroi left without answering, the guards filing out behind him.\n\n*Chirp chirp!*\n\nAlone with the chick, Reidorn felt genuine warmth for the first time in half a year. His heart softened. Outside the cell, the guards cornered Huroi with questions.\n\n\"What's the meaning of this? Why give the prisoner a pet?\"\n\n\"You're letting a criminal murderer bond with an animal?\"\n\nHuroi sighed deeply, wishing for a cigarette. He finally answered the confused guards. \"I'm going to let the chick grow a bit.\"\n\n\"Yes...?\"\n\n\"Then I'll kill it in front of him.\"\n\n\"...\"\n\n\"The chick he'll have bonded with for weeks...!\"\n\n\"...\"\n\n\"...I'll add vegetables and make a stew.\"\n\n\"T-That's...!\"\n\n\"You're worse than a Great Demon!\"\n\nThe guards recoiled, goosebumps breaking out across their skin. The psychological warfare Huroi had planned was so calculated, so cruel, it turned their stomachs. Huroi himself looked uncomfortable.\n\n\"He's the one who made me this way...\"\n\n\"Dear god...\"\n\nThunder should have rumbled overhead to punctuate the moment, but the sky remained perfectly clear and blue.\n\n***\n\n\"Where are we going?\" Mercedes asked, following Grid out of the throne room. She'd expected him to head for the smithy, but he was walking toward the castle gates instead.\n\n'Is there a workshop somewhere outside?'\n\n\"Starting today, I'm making my blacksmithing more efficient,\" Grid explained.\n\nCrafting items consumed massive amounts of time and focus. A single piece could require days of unbroken concentration. The results were often excellent, but the method had a critical flaw—it left zero time for hunting. Over the past few months, Grid's level had stagnated. He'd soon drop out of the top ten on the unified rankings.\n\nThis was the curse of a production class. Combat-focused players could devote themselves entirely to leveling, while Grid had to split his time between the forge and the field. The gap would only widen. But Grid had been working on a solution—the portable furnace.\n\nThanks to the white phosphorus wood, he could now achieve smithy-level firepower anywhere.\n\n\"From now on, I'll be forging at hunting grounds.\"\n\nHe'd attempted this before. Noe, Randy, and the God Hands would hunt while Grid worked the portable forge. But it hadn't been effective. Without white phosphorus wood, the portable furnace couldn't generate sufficient heat. He'd been limited to basic equipment.\n\n'But now it's different.'\n\nGrid pulled out a map with a confident smile. His destination was a new hunting ground Kraugel had recommended—the Boundary Forest. Deep within the woods, mysterious wards prevented access to certain areas.\n\n\"A forest with unusually sweet fruits...\"\n\nAccording to Kraugel, using Media Mountains Honey there would summon something called a bear-wolf. The creature was powerful enough that it took strong players considerable time to kill, but it supposedly granted field boss-level experience.\n\n\"Is the information reliable? How did Kraugel even discover the summoning method?\"\n\n\"He was eating honey bread during a rest break.\"\n\nValuable intel, gifted in exchange for the White Tiger Sword.\n\n\"Anyway, he's a good friend.\" Pride warmed Grid's chest whenever he thought of Kraugel.\n\nMercedes felt an odd pang of jealousy seeing that expression. Her tone came out more critical than intended. \"I'm familiar with bear-wolves. They combine a bear's destructive power with a wolf's agility. They'll be more dangerous than you're anticipating.\"\n\nYet Grid wanted to hunt these monsters while simultaneously crafting armor? Impossible. Grid met her concerned gaze with complete confidence. \"I have you with me. Why would I worry?\"\n\n\"Don't you need the experience points? If you don't personally hunt the bear-wolves, how will you level?\"\n\n\"You're not going to hunt them. You're just going to season them for me.\"\n\n\"Season... what?\" Mercedes stared blankly. Why was he talking about cooking?\n\nGrid elaborated for his baffled knight. \"When the bear-wolf appears, you'll hit it as hard as you can. That'll make it angry at you, right?\"\n\n\"Yes, I suppose so.\"\n\n\"From that point forward, you just need to tank. While you hold aggro, my pets—Noe, the God Hands, and the Overgeared Skeletons—will finish it off. I'll gain experience while sitting and crafting armor, and my summons will level up as well.\"\n\n\"Understood. I'll do exactly that.\" Mercedes straightened with renewed energy.\n\nDespite being the continent's strongest warrior, her role here would be support. This was the legendary knight serving as a bus driver—and Grid was her only passenger."
}