{
  "id": 816,
  "title": "Chapter 816",
  "content": "\"Harder than I expected.\" \n\nGrid studied the map for what felt like the hundredth time in four days. Finding the right path had proven maddeningly difficult, yet he wasn't lost—his sense of direction had never failed him. After all, he'd discovered the North End Cave and Pagma's Rare Book through that same instinct.\n\nHis eyes traced the parchment once more, dwelling on the empty space where Kraugel had indicated the Boundary Forest should exist. Right at the convergence point of the Beldon Volcanic Zone and the Lilton Desert. Of course it wasn't marked on any map—that explained everything.\n\n\"East from Beldon, west from Lilton...\" Grid's jaw tightened. The delay grated against his carefully planned schedule.\n\nMercedes finally broke her silence, her tone measured and careful. \"Is Kraugel a credible person?\"\n\nGrid glanced up. \"Where's this coming from?\"\n\n\"I find it difficult to believe a forest exists here.\"\n\nShe gestured at their surroundings—volcanic hellscape on one side, barren desert on the other. The logic was sound. How could any vegetation survive between these extremes?\n\n\"You can trust him,\" Grid said without hesitation.\n\nBlind faith had no place in this world—he understood that. Friendship didn't guarantee honesty. But Kraugel was different.\n\n\"He has too much pride to lie. It's not in his nature.\"\n\n\"A Sword Saint, correct?\"\n\n\"You know about that?\"\n\n\"He's been making waves in the Empire for months.\" Mercedes' expression remained neutral. \"Opinion is divided on whether to recruit him or eliminate him. The Emperor chose to court him.\"\n\n\"Makes sense.\" Grid felt no sting of jealousy at the revelation, no bruising of ego from being overlooked in favor of Kraugel. Not because he considered the Sword Saint class superior to Pagma's Descendant, but because his pride had deeper roots than anyone's opinion. He knew his own worth. Let others underestimate him—the truth would speak for itself eventually.\n\n\"Kraugel rejected the offer, though?\"\n\n\"He did.\"\n\n\"That must have annoyed you.\"\n\nSilence answered him. Grid had read Mercedes clearly from their first meeting—her loyalty burned hot and absolute, and she viewed anyone who defied her master as an enemy. A dangerous trait in an opponent. An invaluable one in an ally.\n\n\"Save your energy for later,\" Grid said, fighting back a grin. \"When you meet him again—give it a year or two—you'll be strong enough to guarantee victory.\"\n\n*Don't start unnecessary fights,* he added silently. He'd learned firsthand how battles between the strong catalyzed growth for both sides. Mercedes had the potential to push even further. A confrontation with Sword Saint Kraugel could unlock it.\n\n*And Kraugel would benefit too.*\n\nGrid's pulse quickened at the thought. A rematch with a more developed Kraugel, both of them at full strength—the anticipation alone set his blood racing. The 3rd National Competition still left a bitter taste, despite his victory. He'd won without revealing everything he could do. The hollow feeling afterward had been nothing like the exhilaration of their clash in the 2nd Competition.\n\n*Undeniable.*\n\nHe'd held back and won. But who could he tell? No one would believe him. \n\n*And what's the point?* \n\nIt would sound like empty posturing.\n\nGrid's smile faded as he stopped walking. They'd reached the boundary—the lava zone ending where the desert began. Then something unexpected happened.\n\n[The World Tree's Necklace is responding!]\n\nHe yanked the item from his inventory, reading the description with mounting excitement. The necklace Povia had given him, woven from world tree bark. If it was reacting here, that meant—\n\nThe stat bonuses confirmed it as he equipped the necklace. They were already inside the Boundary Forest. A ward was simply masking its presence.\n\n\"Knew it!\" \n\nTwo realizations struck him. First, Kraugel had only shown him the location, not how to breach the ward—probably because no ward had existed during his visit. Second, the elves must have detected Kraugel's intrusion and reinforced their defenses. It explained everything.\n\nBut how to dispel a ward? The standard methods floated through his mind: understand the underlying principle, or use specialized magic. He hadn't learned the necessary spells, which left him with the thinking option.\n\nDamn it.\n\n\"F—\" He caught himself, swallowing the curse. Can't exactly swear in front of his newest subordinate. \n\n\"Ugh.\" Suppressing the impulse only made his frustration worse. He was wrestling with the problem when Mercedes spoke.\n\n\"Is there something I can help with?\"\n\n\"I need to break through this ward, but I don't—\"\n\nMercedes' expression shifted, a flash of wounded pride crossing her features. Her master expected nothing from her?\n\n\"I'll simply destroy it.\" Her voice had gone cold.\n\n\"What?\"\n\n\"If my physical strength exceeds the ward creator's by three times, brute force suffices.\" She drew her swords, energy rippling along the blades. \"Let's see who's stronger.\"\n\nLight erupted. Mercedes swung once—a motion that echoed Kraugel's Space Sword in its devastating simplicity. The strike carved through reality itself. Sky, desert, volcano, earth—everything split and fractured. The volcanic zone and desert shimmered and dissolved like morning mist. In their place, an impossibly vast forest materialized, stretching beyond the horizon. A nation unto itself.\n\n\"...Incredible.\"\n\nGrid wasn't marveling at the forest's scale, but at Mercedes' technique. The ward had been masterfully crafted, weaving convincing illusions of heat and terrain. \"Is this elemental magic? I've heard of it, but—\"\n\n\"Most likely. Fire elemental for the volcano, earth elemental for the desert. Far more sophisticated than simple illusions.\"\n\n\"Have you encountered elementals before?\"\n\n\"No.\"\n\nGrid noticed the way sunlight filtered through the canopy, dappling Mercedes' face as she gazed around. Her composure had cracked, wonder leaking through. \n\n*Right.*\n\nThey'd just discovered the elven territory—isolated from humanity for centuries. Anyone would be awestruck. He watched her take in the forest with an expression that was almost childlike, warmth spreading through his chest.\n\n*No first discovery reward. Someone beat me here.*\n\nNot Kraugel, though. Kraugel hadn't known this was elven territory. Either he'd never entered the forest itself, or someone else had already claimed the achievement. The latter possibility was staggering. Who could outpace Kraugel? Grid's curiosity sharpened as he pulled out his portable furnace and began loading firewood. He arranged his anvil beside it, then positioned his hammer and quenching bucket.\n\nMercedes stared. \"Your Majesty... This is our chance to meet the elves. Shouldn't we seek them out first?\"\n\nSome people still thought of elves as mythical creatures, ethereal and unknowable. Even Mercedes clearly wanted to encounter one immediately. Grid, however, shrugged.\n\n\"I can see an elf any day.\"\n\n\"What?\"\n\n\"A high elf, actually. Sage Sticks. You didn't know he's in the Overgeared Kingdom?\" Grid raised an eyebrow. \"The Empire's intelligence network really is lacking.\"\n\n\"...Oh.\" \n\nThe memory surfaced—Mercedes had simply suppressed it after an incident five days ago, when Grid had first arrived in Reinhardt.\n\n\"Grid!\" Sticks had sprinted toward him, agitation written in every line of his body. \"We need more teachers at the academy! I'm teaching twelve classes a day alone—twelve! There's no time to rest!\"\n\n\"Fine. Talk to Administrator Rabbit.\"\n\n\"He's the problem! Says we can't afford more teachers, so he's working me to death to save money!\" Sticks had practically wailed. \"It's exploitative!\"\n\nHe'd seemed so... ordinary. So thoroughly mundane that Mercedes had instinctively buried the knowledge that he was both high elf and sage.\n\n\"...Understood.\" She nodded slowly, the sealed memory reasserting itself. \"Then there's no rush to find them.\"\n\n\"Exactly. Besides, they're probably all men anyway.\"\n\n\"Men?\"\n\n\"Never mind. Let's get started.\" Grid rolled up his sleeves, then retrieved a jar of expensive Media Mountain honey and pressed it into Mercedes' hands. He hefted his hammer. \"I'll work. You eat honey.\"\n\nHer first important mission since swearing service to Grid, and she was being told to... eat honey?\n\n\"Yes...\" Her response came out flat. She drew her swords anyway, and in the same motion, deflected an arrow from the treeline.\n\n\"What is the meaning of this?\" Mercedes' gaze snapped forward, sharp as her blades.\n\nElves emerged from the forest, fury radiating from them. The white-haired one in front—Beniyaru—pointed at them with shaking hand. \"We hate you! Humans should be extinct!\"\n\n\"Wow.\"\n\nStraight to extinction? Was lighting a fire in the forest really that offensive? Sweat prickled Grid's neck as understanding dawned. \n\n*...Okay, yes. Pretty offensive.*\n\nBut he didn't know yet—the elves' hatred of humans had nothing to do with Grid and Mercedes."
}