{
  "id": 817,
  "title": "Chapter 817",
  "content": "Every gamer knew the sting of frustration. Failed enhancements. Grinding for hours without gaining a level. Wasting days on a raid only to walk away empty-handed. Suffering through brutal questlines for pitiful rewards. Discovering your chosen class was worthless. Selling an item cheap only to watch its value soar. Watching someone else hit the jackpot while you got nothing.\n\nThe list went on.\n\nFor all the joy games brought, they delivered equal measures of stress and disappointment.\n\n\"Ah...\" Grid was no exception. Even at the peak of Satisfy's player base, even with the wealth and fame he'd accumulated, he still felt that crushing weight of loss.\n\nAnd right now? This moment was no different.\n\nThe elves had been separated from humanity for hundreds of years. Unreachable. Uncontactable. So why the hell were they showing up *now*?\n\n\"Why did they have to appear while I'm using the white phosphorus wood?!\" Grid's scream echoed through the forest as an arrow whistled past his cheek and struck his portable furnace dead-center.\n\n*Thunk!*\n\n[The portable furnace is hit.]\n[The portable furnace won't function properly.]\n[You need to be careful.]\n\n\"No!\"\n\nInside the punctured furnace, the white phosphorus wood continued burning—consuming itself uselessly. Wood he'd risked his life transporting from the East Continent. Wood that was nearly impossible to replace.\n\n'Only eighty pieces left!'\n\nHe needed three or four pieces minimum to achieve the proper temperature. With the yangbans hunting him, crossing back to the East Continent was suicide. Every piece was precious.\n\nAnd these elves had just cost him four of them.\n\nGrid's blood boiled. \"You're just pretty faces!\"\n\nHe had to admit—the rumors were true. Compared to elves, even Korea's top beauties looked plain. Every elf before him possessed flawless beauty rivaling Yura, Jishuka, Irene, Sua, and Mercedes. Speaking of which, Mercedes stood right beside him, making the comparison easy.\n\nBut so what if they were beautiful? They weren't his!\n\n\"Flat-chested too... Urk!\"\n\n*Thunk!*\n\n[You have suffered 8,980 damage.]\n\n\"Your Majesty!\"\n\n\"God Hands!\"\n\nThe arrows flew silently. Grid's high agility and insight let him track their trajectories, but the follow-up shot was invisible—*stacked* directly behind the first arrow, hidden in its wake.\n\n'Movie archery bullshit.'\n\nKorean players loved bragging about their country's ancient archery traditions. High-level techniques passed down through generations.\n\n'I don't care!' \"Pagma's Swordsmanship!\"\n\n*Clang! Clangclangclang!*\n\nGrid launched into his sword dance while Mercedes and the God Hands formed a protective barrier around him.\n\n*Thunk!*\n\nAn arrow slipped through a gap in the God Hands' formation and pierced his thigh, interrupting the skill mid-cast. Pagma's Swordsmanship's fatal weakness—any interruption during the animation rendered the technique useless.\n\n'The arrows are too fast!'\n\nThe power, speed, and stealth reminded him of Povia's death knight. These elves possessed skills surpassing most rankers. The God Hands buckled under the concentrated barrage, entering a stiffened state and leaving Grid exposed.\n\n\"Vaintz' Swordsmanship, Third Style.\"\n\nMercedes materialized before him like a shield. A legendary knight serving as his guardian.\n\n\"Fly, Sword Energy.\"\n\nShe spun, and a silver storm erupted. Trees, bushes, and boulders alike disintegrated under the tempest of blade aura.\n\n\"Kyaaaah!\"\n\n*Crash! Crackcrackcrack!*\n\nThe elves scattered, thrown in all directions by the devastating technique. Their agonized screams rang through the vast forest.\n\nYet something felt wrong.\n\n'Only half their health?'\n\nEvery elf survived. All maintaining fifty percent health despite wearing nothing but leaves. Unbelievable defense. Persistent vitality that defied their delicate frames.\n\n'These are just ordinary elves...?' Grid's gaze locked onto the white-haired figure. The elf called Beniyaru bore a golden nameplate—a named NPC, and clearly someone exceptional.\n\n\"Your Majesty, we should retreat.\" Even Mercedes recognized the threat. These elves exceeded their reputation. Protecting Grid while engaging them simultaneously was impossible.\n\n\"Retreat?\"\n\nThe suggestion stung Grid's pride. He met Mercedes' eyes directly. Quick Movements activated as two arrows streaked toward him. \"You're mistaken. I'm not some weakling who needs protecting.\"\n\nHis footwork accelerated. The arrows passed harmlessly by as he flawlessly executed Pagma's Swordsmanship this time.\n\n\"What?!\"\n\n\"How...?\"\n\nThe snipers hiding behind trees froze. An irresistible force seized control of their bodies. Fingers locked. Bowstrings slackened. Without status resistance to break the hold, they stood helpless. Bows and arrows clattered to the forest floor.\n\n\"Pagma's Swordsmanship!\" Grid had been wearing his comfortable crafting clothes, but the God Hands swapped him into Valhalla of Infinite Affection in seconds. He charged the stunned elves. \"Wave!\"\n\n\"...!\" \n\nElves and Mercedes alike startled. Grid's momentum evoked an erupting volcano—powerful, destructive, overwhelming. The wave of force swept the elves away, dealing massive damage while crippling their mobility.\n\n\"Now!\"\n\nFor whom did he call?\n\n\"Yes!\" Mercedes understood. She was amazed, thrilled by the grandeur of the king she served.\n\n\"Vaintz' Swordsmanship, Fourth Style—Raising the Sword Energy!\"\n\nA silver cyclone erupted upward. Combined with Grid's assault, the elves were launched skyward.\n\n\"Pagma's Swordsmanship—Transcended Link!\"\n\n\"Vaintz' Swordsmanship, Fifth Style—Sowing Sword Energy!\"\n\nGrid and Mercedes selected ranged techniques for the finishing blow, targeting the airborne elves. They prepared to unleash devastation.\n\n\"Kuk...!\"\n\n\"Ugh!\"\n\nBoth groaned simultaneously.\n\nBeniyaru had intervened. Her bow struck Grid's throat while her fire elemental-clad fist slammed into Mercedes' abdomen. Grid crashed into a boulder. Mercedes hurtled toward a tree before catching herself with her silver wings. Meanwhile, Beniyaru's wind elementals cushioned her companions' landing.\n\nA smile crossed Grid's face. 'So that's it.'\n\nHeaven hadn't granted him a legendary knight without reason. It was preparation for threats like this. How many such monsters lurked in Satisfy's vast world? Grid assessed Beniyaru as Mercedes' equal.\n\n'But Mercedes is at a disadvantage.'\n\nNaturally. This was the World Tree's forest—the elves' home. Furthermore...\n\n'Neither Mercedes nor I understand elementals.'\n\nUnknown power. As Grid watched Beniyaru command her fire elemental Yutan and wind elemental Sulle, his frustration over the wasted white phosphorus wood evaporated. Now, only the enemy before him mattered.\n\nBeniyaru's mocking voice reached his ears. \"She's somewhat competent for a human. You, however, are not.\"\n\nElves were classified as a superior species—like the water clan, vampires, and evil eyes. As one of the 12 Te, Beniyaru's pride reached stratospheric heights.\n\nThis weak male human daring to challenge her with his eyes? Unacceptable.\n\n\"Yutan. Sulle.\"\n\nElementals symbolized elven strength. Only fifteen elves commanded two or more—the 12 Te and three kings.\n\n\"Assist me.\"\n\nBeniyaru drew her bowstring. Flames wreathed the arrow. Wind rose from the south, lifting Grid's hair. She released.\n\nThe fire arrow accelerated on the wind's current, streaking toward Grid.\n\n\"How dare you?!\" Mercedes was already moving before Beniyaru fired. Her sword intercepted both arrows mid-flight. A massive explosion erupted. The blast shredded Mercedes' leather armor to tatters.\n\n\"You—!\" Mercedes' fury ignited as her pale shoulders lay exposed. Diplomatic relations with the elves be damned—her king had been attacked. She revealed her true power, intent on making Beniyaru pay.\n\nBut Grid moved first. Blackening activated. He crossed before Mercedes in an instant and appeared face-to-face with Beniyaru.\n\n\"Insignificant wretch!\" Beniyaru despised humans and demonkin equally. The blackened Grid represented everything she loathed. Her fire and wind elementals responded to her rage, surrounding her body in a blazing vortex—a shield impenetrable to ordinary physical and magical forces. A shield that devoured anything nearby.\n\n\"Your Majesty!\"\n\nMercedes wrapped her silver wings around Grid to shield him—\n\n*CRACK!*\n\nLightning struck.\n\n'What?'\n\nHadn't the sky been clear moments ago? The elves looked up. Through the forest canopy, storm clouds roiled where blue sky had been.\n\nGrid whispered to Mercedes, who held him tight. \"Get away if you don't want to get hurt.\"\n\n\"...!\"\n\nA knight existed to serve her master. Retreat? Mercedes nearly refused—until her eyes widened. She sensed unfamiliar energy gathering above. Almost like...\n\n'Astaroth?'\n\nDemonic lightning bolts rained down, targeting the elves' feet and heads.\n\n\"What?!\"\n\nBeniyaru's ward shattered in a single strike. The transcendent power left her stunned. She tried escaping using her wind elemental, but the storm itself held her down, making her body impossibly heavy.\n\nMeanwhile, Grid's body became infinitely lighter.\n\n\"You won't die from this much, right? We'll talk after. **Linked Kill Wave Pinnacle.**\"\n\nTalk...?\n\nThe ferocious combination tore through Beniyaru's body while thunderbolts reduced the other elves to smoking ruins. Rain and lightning baptized the forest depths.\n\n[The title 'One who Made the Elves Surprised' has been acquired!]\n[The elves feel awe toward you.]\n[The elves are no longer hostile to you.]\n\nThus Grid made an excellent first impression on an entirely new species.\n\nAnd...\n\n\"So strong...!\"\n\nMercedes stood outside the storm's radius, jaw slack. Finally, she remembered.\n\nHer new master was the first Hero King born in hundreds of years."
}