{
  "id": 818,
  "title": "Chapter 818",
  "content": "# Rewritten Chapter\n\nGrid's Blackening ability had grown exponentially stronger during the Eternal War, fueled by his rapid accumulation of demonic power. Through relentless effort, he'd successfully forged the Linked Kill Wave Pinnacle technique—a feat made possible by his Watched by the Gods title. Fighting energy had begun swirling around him the moment the elves materialized from the shadows. And now, crowning it all, he possessed the Weakened Great Demon Astaroth's Power.\n\n\"Urghh!\"\n\nThe torrential downpour battered them as demonic lightning crackled through the air. Beniyaru faltered, her disheveled white hair plastered across her face, revealing wide pupils that trembled with barely contained fear.\n\n*How did it come to this?*\n\nThe reality struck her like a physical blow. One of the 12 Te—a guardian from the twelve noble families—forced to her knees before a mere human. The weight of that failure pressed down on her shoulders, a stain that would forever tarnish the sacred name of 'Te', which meant 'to protect.'\n\n\"Did you sell your soul to the great demons?\" Beniyaru's glare cut through the storm, hostile and accusatory. The demonic energy itself didn't concern her—countless humans throughout history had obtained such power through black magic or cursed artifacts. But this field technique was something else entirely. An ability that conjured storms filled with lightning demonic energy—a force that evoked the terrible majesty of Hell's monarchs themselves.\n\n\"Wicked human!\" Her sharp voice pierced through the howling storm, reinforced by mana. \"You've allied yourself with a great demon to invade our territory! Is there no limit to your greed?\"\n\nIf Grid had been an ordinary player, that mana-laced rebuke would have disrupted his internal energy flow and inflicted multiple status conditions. But Grid stood his ground, unmoved.\n\n\"Why do you always jump to conclusions?\"\n\nThe rain ceased. Through gaps in the lush canopy overhead, patches of clear sky emerged. Unable to sustain the massive mana drain, Grid released his hold on the Storm Demonic Energy Field.\n\nBeniyaru's eyes widened. *Is he conserving strength? He doesn't intend to kill us after all?*\n\nBut that revelation brought no comfort. If anything, despair deepened across her delicate features. \"You...! You mean to sell us to slavers!\"\n\n\"...\"\n\nThe elves harbored a profoundly narrow-minded view of humanity—a biased, relentlessly negative worldview. Despite her considerable power, Beniyaru seemed fundamentally afraid.\n\nGrid's expression softened with genuine pity. He could see how thoroughly Beniyaru believed her own assumptions, and for that, he couldn't bring himself to feel frustrated or angry. Instead, he felt sympathy—the memory of his own past self reflected in her fear.\n\n\"Your twisted perspective isn't entirely your fault,\" he said gently. \"I think humans have wounded you deeply.\"\n\n\"...\" Beniyaru trembled at the unexpected kindness in his voice. For a moment, she stood dumbfounded, before violently shaking her head and summoning fresh hostility toward her enemy. \"Don't pretend you understand when you know nothing about us! I don't need your gentle expressions or honeyed words. No matter what tricks you try, I'll never be deceived!\"\n\n\"Ah, what a mess.\"\n\nConversing with elves was like talking to a brick wall—a reality that would crush the dreams of countless players who fantasized about meeting these legendary beauties. But Grid felt no disappointment. After all, he hadn't come here seeking elven company.\n\n\"Let's cut this short. Listen carefully—I'll state my position.\"\n\nGrid's commanding tone made Beniyaru and her companions swallow nervously. Through their leaf-woven garments, the female elves' delicate skin was clearly visible. They braced themselves for whatever terrible judgment this human would pronounce.\n\n\"First, an introduction. I am Grid, King of the Overgeared Kingdom. I'm a descendant of the legendary blacksmith Pagma. I have made no contract with any great demon. The power I used came as spoils from *killing* a great demon.\"\n\n\"...!\"\n\nGrid stepped forward. \"I came to this forest to hunt bear-wolves. I had no idea this was your territory. If my presence frightened you, I apologize.\"\n\n\"...\"\n\n\"I have no desire for hostility between us. As a king, I'm obligated to foster positive relationships with other races. You're welcome to remain suspicious and wary—that's your right. But I ask permission to remain here temporarily to hunt.\"\n\nAs Grid spoke calmly, he shifted his gaze toward the clear sky overhead—a deliberate avoidance of the elves themselves. Their attire consisted of strategically placed leaves covering only what was absolutely necessary, leaving them essentially half-naked. Grid lacked the courage to stare directly at them. The last thing he wanted was to be branded a pervert during his first encounter with elves, or worse, to have distorted rumors spread about his character.\n\nHis decisive yet innocent demeanor caused Beniyara and her companions to gradually lower their guard.\n\n\"A legend... I see. That transcendent power makes sense if you've reached that level. Is she also a legend like you?\" Beniyaru's attention shifted to Mercedes, who still glared at her with barely restrained hostility for daring to attack Grid.\n\nGrid squeezed Mercedes' hand reassuringly. \"Yes, she is.\"\n\n\"I see...\" Beniyaru finally accepted her defeat. She knew nothing of this Pagma that Grid mentioned, but she knew of Povia—the child born between human and elf, who'd lived a tragic existence belonging to neither society until she achieved transcendent power and became a legend.\n\n\"...The legend I knew was a sublime being. You have credibility. Very well—you cannot be judged as a common human. I'll trust your words.\" As one of the 12 Te, she straightened. \"I grant you permission to remain in this area temporarily. The bear-wolves threaten us as well. If you hunt them, so much the better.\"\n\n\"Thank you.\"\n\n\"However, don't venture deeper into the forest. Your movements will be restricted to this region.\"\n\n\"Understood,\" Grid agreed readily.\n\nMeanwhile, Mercedes stared in confusion at Grid's larger hand wrapped around hers. She leaned close and whispered urgently, \"Your Majesty, this is the perfect opportunity to glimpse elven society and establish future diplomatic relations. Are you truly going to let this chance slip away?\"\n\nThe elves' archery had proven even more spectacular than historical records suggested, and their connection to elementals exceeded all expectations. Mercedes firmly believed the Overgeared Kingdom needed to cultivate a strong relationship with the elves.\n\nNaturally, Grid agreed. \"I know. But look at their attitudes. If we push too aggressively now, we'll only make them more suspicious. We can't rush this. Another opportunity will come.\"\n\nThis situation required patience—a lesson Grid had absorbed through countless hard experiences.\n\n\"Just being allowed to remain in elven territory is achievement enough.\"\n\n\"Yes, I understand.\" Since the king had made his decision, Mercedes fell silent.\n\n\"Then let's begin.\" Grid's face lit up as he produced his damaged furnace and hammer. Repairs came first. Unfortunately, the forest's oppressive darkness hampered his work. The gloom made delicate precision nearly impossible.\n\n\"The trees grow so densely that sunlight can barely penetrate...\" After hammering for a while, Grid paused and surveyed his surroundings. Trees and undergrowth grew wild and unchecked. The elves' love of nature meant they never bothered controlling this rampant growth.\n\n\"Hmm...\"\n\nAfter planting maple, persimmon, and plum trees in his penthouse garden, Grid had become familiar with proper pruning techniques. With that knowledge, he could clearly see the forest's poor condition.\n\nHe pointed to a massive tree nearby, its surface torn and scarred. \"If you truly care about these trees, you need to prune them. When growth goes unchecked, trees become entangled with each other and deformed. Without adequate sunlight, the moss near the roots becomes nutrient-deprived, making them vulnerable to pests and disease.\"\n\n\"...?\" Beniyaru and the other elves stared at him in bewilderment as Grid launched into his lecture. They could barely comprehend what he was saying.\n\n\"Pruning? Pests? What are you talking about?\"\n\n\"Nature requires a helping hand to stay healthy.\"\n\n\"What kind of sophistry is this? Nature is perfect as it exists!\"\n\n\"Don't pretend expertise in human nonsense!\"\n\nThe elves bristled with indignation. But Beniyaru reacted differently. In Grid's words, she glimpsed the shadow of an old friend.\n\n*He's saying exactly what Povia used to say...*\n\nPovia had claimed to have learned such knowledge from her human parent, and the elves had mocked her mercilessly. Many had ridiculed the pathetic half-breed. Beniyaru had been among them. Now, thinking she should believe Grid, she waved her hand—a gesture of atonement for Povia. She decided to make a request.\n\n\"You... Overgeared King Grid.\"\n\n\"...?\"\n\n\"May I entrust management of this forest to you?\"\n\n\"Eh?\" Grid's composure shattered at the sudden proposal.\n\nBeniyaru bowed deeply. \"Your argument carries weight. I would like you to perform this pruning.\"\n\n\"...!!\"\n\nOne of the famously proud elves—bowing to a human while making a request? Moreover, this same elf had tried to harm him mere moments ago! Mercedes' eyes widened as she stared at Grid, thoroughly impressed by his greatness.\n\n*His Majesty orchestrated all of this!*\n\nMercedes understood nothing about horticulture and couldn't grasp the botanical nuances, but clearly Grid had masterfully engineered this entire situation. As Mercedes' reverent gaze fixed on him, Grid began to sweat.\n\n*No, wait...*\n\n[Tend to the Elven Forest]\n\n[Difficulty: A\n\nBeniyaru, one of the 12 guardians protecting the elves, seeks your assistance.\n\nShe wishes for you to restore beauty to this forest!\n\nQuest Clear Conditions: Prune 2,000 trees (0/2,000)\n\nQuest Clear Reward: Affinity with all elves increased by 20. Leaves of the World Tree (20), Fruits of the World Tree (5).\n\nQuest Failure: Relations with the elves will become hostile.]\n\n\"...I'm not a gardener.\"\n\nExactly. Grid was a blacksmith. Why was he receiving quests meant for landscapers? He'd come here to craft equipment and level up, not waste precious time pruning two thousand tree branches.\n\n*How tedious will cutting all those trees be?*\n\nHe should refuse this quest immediately. Grid wanted to shout that very declaration.\n\nExcept the rewards gave him pause. The World Tree leaf he'd given to Sticks was a legendary panacea. Grid desperately wanted to discover what effects the World Tree's fruit might possess—items that seemed even more precious. And the increased affinity with the entire elven race carried enormous diplomatic value.\n\n*Why...?*\n\nGrid hesitated, neither accepting nor refusing the quest. One person flashed through his mind.\n\n*Piaro!*\n\nThe legendary farmer who understood crops better than anyone! Perhaps Piaro had also specialized in managing other plants, including trees? With that thought, Grid immediately activated Knights Summoning. This would be the first meeting between the legendary farmer and the elves—two forces who cherished nature above all else.\n\nWorried his king might be in danger, Piaro had responded to the summons with urgent haste.\n\n\"Elves...\" He faced them while gripping his hand plow and sickle. The elves sniffed the air around him, and their faces flushed with color.\n\n\"What a wonderful man...\"\n\n\"...\"\n\nThe earthy scent clinging to Piaro's body stirred something primal in the elves' hearts. Fortunate for Grid.\n\n\"Perfect. I'll craft armor while Mercedes enjoys some rest. Meanwhile, Piaro will handle the pruning alongside the elves.\"\n\nGrid's delegation strategy wasn't inherently flawed. Subordinates existed to be utilized, after all. However, Grid's particular subordinates happened to be a legendary farmer and a legendary knight..."
}