{
  "id": 819,
  "title": "Chapter 819",
  "content": "The giant trees reached toward the sky like monuments to eternity. Branches longer than a grown man jutted out like bladed spears, while dense foliage choked the gaps between them. Standing before such primordial grandeur would make most men feel small—insignificant enough to forget to breathe.\n\nBut Piaro was a legend. Nature wasn't something to fear—it was a second home to the farmer who'd spent years cultivating the earth. The clean forest air filled his lungs and set his blood racing.\n\n\"Let me clean you up!\" Piaro launched himself between the trees like a flying squirrel, Belial's sickle flashing in his hands. Each strike sent massive branches crashing to the forest floor. In less than ten minutes, an entire giant tree stood neatly trimmed.\n\nGrid's gamble had paid off. The legendary farmer's deep understanding of plants translated into spectacular pruning technique. His hands breathed new life into each tree.\n\n[Your subordinate, Piaro, has completed the pruning. (1/2,000)]\n\n\"Well done!\"\n\n*Ttang! Ttang!* Grid hammered a metal plate over the hole in his portable furnace, his movements frantic and graceless—like a drunk soldier attempting to dance.\n\n'This is working!'\n\nParty members and pets counted toward hunting quests—Grid had tested that before. So why couldn't subordinates handle other quest requirements? It was logical reasoning, and now that logic was being rewarded. Thanks to Piaro, the pruning quest would be cleared far faster than if Grid tackled it alone.\n\n\"Incredible...\"\n\n\"I never thought a human could be so attuned to nature—more so than even our people.\"\n\n\"Look at how he's become one with the trees. He surpasses our finest elves several times over. If I were to bear children, I would want them to be his.\"\n\nThe noble elves—falling for a mere human. The female elves now understood how half-elves came to exist. Their eyes glistened as they watched Piaro work.\n\nMercedes felt an odd pride. 'This is the charisma of a true hero—one that transcends species itself. Piaro is extraordinary.'\n\nHe was the man she admired most. Mercedes dipped a finger into the honey and brought it to her lips, appearing far too relaxed compared to the rest of Grid's party. While she should be protecting her king, she was... eating honey? To an outside observer, it would seem bizarre. But Mercedes had her reasons.\n\n'I must pace myself.'\n\nThe Media Mountain honey—so expensive that even Grid hesitated to consume it—was incomparably more fragrant and sweet than any premium honey Mercedes had tasted before. Its freshness was addictive; she could eat it endlessly without tiring of the taste. The legendary knight found herself craving more with demonic intensity. The temptation was nearly impossible to resist.\n\n*Lick...*\n\nShe wanted to devour it all at once! Mercedes looked more radiant than usual as she fought the urge, taking only tiny amounts on her fingertips. Grid stared at her while hammering, a realization dawning on him.\n\n'Where's the bear-wolf?'\n\nTwenty minutes had passed since Mercedes started eating the honey. One hundred milliliters cost fifty gold—meaning he'd just wasted 60,000 won on this absurdly expensive honey.\n\n'Is this going to be for nothing?'\n\n*Ttang! Ttang!* Grid's hammering grew more frantic as his anxiety peaked.\n\n*Lick.*\n\n\"Hah... Hah... Y-Your Majesty, I can't endure much longer.\" Mercedes' eyes shifted. Her breathing grew labored, and more honey coated her fingers.\n\n[Mercedes has entered the 'intoxicated' state.]\n\n\"What?!\"\n\nEven a legend's passive resistance couldn't withstand it. This was the terrifying power of expensive honey!\n\n\"N-No...! My money...!\" Grid's anguished cry rang out as 60,000 won worth of honey was about to vanish into Mercedes' stomach in one go.\n\nHad his desperate plea reached the heavens?\n\n*KWAAAAAH!*\n\nFinally—the bear-wolf Grid had been waiting for appeared.\n\n[The bear-wolf is enticed by the sweet scent!]\n\n[The atrocious cry incites fear in all those who hear it!]\n\n[You have resisted.]\n\n[The cry of an atrocious beast has filled the ears of those scattered throughout the forest. If you can't hunt the bear-wolf within five minutes, a new bear-wolf will appear! Be careful! The bear-wolves have excellent collective hunting ability and will grow stronger as their numbers increase!]\n\n\"Hah!\" Grid exhaled in relief, smiling. The moment an enemy appeared, Mercedes snapped out of her intoxicated state. She licked the remaining honey from her hand—without swallowing the large glob—and drew her shield with the other. The bear-wolf leaped with a wolf's agility and swung a massive paw reminiscent of a bear. Mercedes blocked with her shield and skidded back two steps.\n\nGrid, Mercedes, and even Piaro—still pruning in the trees—were all startled.\n\n'That strength rivals an ogre!'\n\nThis was no ordinary monster. And if they failed to kill the bear-wolf within five minutes, another would spawn. Grid had hoped to save honey by hunting slowly, but that message made it clear—this would be a race against time.\n\n\"Bear-wolves are a threat even to us elves!\" Beniyaru's shout echoed through the forest. She'd grown fond of Piaro and was genuinely concerned for Grid's party.\n\nThe situation was urgent. Grid felt a bit embarrassed as he called out the skill name. \"C-Can you Become the King of the Dead?\"\n\n*Clack! Clack clack!*\n\nTwo skeletons rose from the earth—Overgeared Skeletons One and Two.\n\n\"Undead!\"\n\nThe bear-wolf ignored the skeletons entirely, but the elves reacted differently. Those who revered nature despised the undead—creatures that defied the natural order. Their bows instinctively aimed at the Overgeared Skeletons.\n\n\"These children aren't evil undead—they're good undead,\" Piaro said as he dropped down from a tree.\n\nThere was no logical basis for his claim. Undead were undead. What distinguished good from bad? Yet the elves accepted it without question. Words from those they respected held more power than logic ever could.\n\nWhat happened when an ugly man approached a beautiful school junior? He might be called a creep. But if a handsome man did the same? They'd likely start dating immediately. This was similar.\n\n\"I see—they're good undead!\"\n\n\"Now that I look closer, their appearance is quite pleasant!\"\n\n*Haha, hoho!* Piaro and the elves formed a cheerful atmosphere. Surrounded by admiring elves like flowers in a field, Piaro radiated contentment. The elves treated him with far more warmth than usual.\n\n'Is he going to marry an elf?'\n\nThere was precedent—Povia had done it. Marriage between humans and elves wasn't impossible. It was heartwarming to see the affinity the elves showed Piaro through their shared love of nature. Grid's imagination wandered. If Piaro married an elf, an alliance between the elves and the Overgeared Kingdom would naturally follow...\n\n\"No—this isn't the time for daydreaming.\"\n\nMercedes' small shield cracked under the bear-wolf's assault. After leaving the empire, Mercedes had been using old equipment from her days serving under Captain Piaro. Her sword, shield, armor, boots, and gloves were all level 200 gear—the kind that would make any poor soldier tremble.\n\n\"Kyaaak!\" Randy materialized after the Overgeared Skeletons and clashed with the bear-wolf, only to be sent flying backward. The good news? The Overgeared Skeletons remained intact. The bear-wolves completely ignored them—their low-level attacks couldn't even pierce the creature's hide. The bear-wolf didn't care when the skeletons struck it.\n\nIn truth, the Overgeared Skeletons dealt exactly 1 damage to the bear-wolf. Not only did the beast's defense exceed their attack power, but the level gap was overwhelming.\n\nMercedes' role became crucial. It would take at least twenty minutes of accumulated damage before the Overgeared Skeletons gained any experience. During that time, Mercedes had to endure the bear-wolf's attacks while also dealing with any new arrivals that spawned.\n\nBut was that even feasible? Mercedes' shield was already failing. If it broke, fighting with just her swords would be far too dangerous. Grid couldn't allow that.\n\nHe opened his inventory and withdrew the World Crushing Sword of the Noble White Tiger—the blade he'd designed with Sword Saint Kraugel.\n\n\"Mercedes!\"\n\nThe White Tiger Sword's usage condition required the wielder to be among the top three rankers in their class capable of using sword-type weapons. Could Mercedes meet that requirement? Grid was certain she could. As a legendary knight, she'd naturally qualify as the top ranker of her class.\n\nHis assumption proved correct. Mercedes caught the sword Grid threw to her. She blocked the bear-wolf's paw with her shield—without even looking—while examining the White Tiger Sword. Then her skin prickled. It was the aftershock of appraising the blade with her discerning eyes.\n\nHer small shield couldn't endure another impact. The bear-wolf's paw shattered it completely.\n\n*KWAAAAAH!* The bear-wolf roared and swung its razor-sharp claws. But those claws never reached Mercedes' face. Instead, the White Tiger Sword struck the bear-wolf's abdomen. Simultaneously, a stone pillar erupted from the ground and slammed into the beast's massive body. The pillar—weighing several hundred kilograms—launched the bear-wolf five meters into the air.\n\n\"Unbelievable...!\" Mercedes marveled at the divine sword's power—something beyond even legend. Grid's voice reached her ears. \"Congratulations on becoming a legendary Overgeared Knight, Mercedes.\"\n\nA product of Grid's terrible naming sense—which would've made anyone else cringe—stirred something deep in Mercedes' heart.\n\n'Legendary Overgeared Knight...'\n\nAn Overgeared Knight of the Overgeared King. Mercedes felt a profound sense of belonging, and her loyalty to Grid surged even higher. She was now truly a member of the Overgeared Kingdom."
}