{
  "id": 82,
  "title": "Chapter 82",
  "content": "# Chapter 82\n\nThe scroll's seal broke beneath my fingers. The production method for the Divine Shield flooded into my brain.\n\n*Finally.*\n\nThe administrator stepped closer, his voice sharp with urgency. \"There's no time! The castle smithy. Make it there.\"\n\nI couldn't even return to Khan's? \n\n\"The materials.\" I turned toward the door. \"I need to buy them from the market first.\"\n\n\"I'll send a servant.\" The administrator waved dismissively. \"You focus on the work.\"\n\nNo room to argue. He guided me through stone corridors to the castle's forge. The blacksmith stationed there was competent enough, but he lacked Khan's weathered expertise. Still, the furnaces burned hot, and the anvils were solid. Good enough.\n\nI unrolled the scroll fully.\n\n> [Do you want to learn how to make the Divine Shield?]\n\n\"Yes.\"\n\n> [You have learned how to make the Divine Shield.]\n\nThe knowledge settled into my hands like muscle memory. I pulled up the item specifications.\n\n> **[Divine Shield]**\n> \n> **Rating:** Rare ~ Legendary\n> \n> **<span class=\"rarity-rare\">Rare Rating Information:</span>**\n> Durability: 360/360  \n> Defense: 189  \n> Magic Resistance: 150\n> \n> * There is a rare chance of completely resisting dark spells.\n> \n> **<span class=\"rarity-epic\">Epic Rating Information:</span>**\n> Durability: 430/430  \n> Defense: 230  \n> Magic Resistance: 181\n> \n> * There is a certain probability of completely resisting dark spells.\n> \n> **<span class=\"rarity-unique\">Unique Rating Information:</span>**\n> Durability: 510/510  \n> Defense: 295  \n> Magic Resistance: 238\n> \n> * There is a certain probability of completely resisting dark spells.\n> * The skill 'Divine Light' will be generated.\n> \n> **<span class=\"rarity-legendary\">Legendary Rating Information:</span>**\n> Durability: 680/680  \n> Defense: 370  \n> Magic Resistance: 280\n> \n> * There is a high chance of completely resisting dark spells.\n> * The skill 'Divine Light' will be generated.\n> * The skill 'Divine Favor' will be generated.\n> \n> *A shield that contains the power of Rebecca, the goddess of Light. Due to its strength against dark magic, all followers of demons and the Yatan Church will suffer when facing this shield.*\n> \n> **Conditions of Use:** Level 190 or more. More than 500 strength. More than 1,000 divine power. A member of the Rebecca Church.\n> \n> **Weight:** 800\n\n*Minimum rating is Rare.*\n\nThat should've been reassuring. It wasn't.\n\nI scanned the materials list. One top-grade magic stone. Two kilograms of mithril ore. Fifteen kilograms of iron ore. Four hundred grams of gold.\n\n*Gold?*\n\nRebecca's symbols were the sun and gold. Of course this thing needed gold plating. Of course.\n\n*This is a luxury item. Not a shield. A goddamn investment piece.*\n\nI scribbled the requirements on parchment. Doubled the quantities. If I was gambling my savings, I'd at least have two attempts. The servant took the list and vanished into the castle depths.\n\nWhen he returned, he carried crates of raw materials and a receipt.\n\n\"Total purchase cost.\" He placed the parchment in my hand. \"Sixteen thousand, nine hundred thirty-five gold. Twenty silver.\"\n\nThe number punched through my chest.\n\n*That's almost everything I have.*\n\nMy hands went cold. Rare rating shields would sell, sure. But not for enough to recoup seventeen thousand gold. Not with the restrictive usage requirements. Only Rebecca Church members could equip the damn things. Limited market. Limited buyers.\n\n*If I make two Rares, I'm ruined.*\n\nThe administrator needed Epic minimum. One Epic would save me. Two Rares would bury me.\n\n*This is insane. I should walk away.*\n\nBut an Epic rating shield? The profit margin was massive. And I had the legendary crafting skill. I had the class that made this possible.\n\n*Two shields. One has to be Epic.*\n\nI grabbed my hammer.\n\n\"I'll make it.\"\n\n**Ttang! Ttang!**\n\nTwo days. That was the deadline. I fired the furnace immediately and started smelting steel. The mithril ore glowed cherry-red in the heat.\n\nA presence pressed against my back.\n\nI spun. Cassus stood five feet away, silent as a corpse. Expressionless face. Skin the color of old parchment. Eyes like dirty water.\n\n*When did he get there?*\n\n\"Mr. Cassus.\" My voice came out higher than intended. \"You've been standing there this whole time?\"\n\n\"Yes.\"\n\nHe'd followed me from the administrator's office. I hadn't heard a single footstep.\n\n\"Why don't you rest?\" I turned back to the furnace. \"You won't be needed for hours.\"\n\nCassus shook his head. \"I appreciate the courtesy. But I can't allow you to suffer alone. I will pray to Goddess Rebecca while you work.\" He folded his hands. \"For your success.\"\n\n*Great. A creepy priest staring at my back while I work.*\n\nI bit down the complaint. Insulting a priest seemed like poor strategy. Especially one who looked like he'd crawled out of a grave.\n\n\"Sure. Thanks.\"\n\nI focused on the work. The mithril resisted the heat, stubborn as iron but twice as temperamental. Smelting it required precision. Too hot and it became brittle. Too cold and it wouldn't flow. The temperature window was narrow. Between 1,820 and 1,840 degrees.\n\n*Advanced Blacksmith Mastery level three minimum for a reason.*\n\nHours bled together. The castle blacksmith dozed off in the corner. I finally drew the mithril from the furnace, sweat soaking through my shirt.\n\n\"Mithril is a pain in the ass.\"\n\nI reached for my waterskin. Bread sat in my bag.\n\n\"Have this.\"\n\nThe voice came from directly behind me.\n\n\"Christ!\" I jerked forward, nearly dropping the waterskin.\n\nCassus stood there. Holding cheese.\n\n\"You've been standing there the *entire time*?\" My heart hammered against my ribs.\n\n\"Yes.\" No inflection. \"I have been praying.\"\n\n*Praying doesn't help me forge a shield.* I swallowed the words. \"Look, I appreciate it, but you should really rest.\"\n\nFor the first time, his expression changed. A faint crease appeared between his eyebrows. \"Rebecca is the goddess of light. This light encompasses all positive energy.\" He spoke slowly, like explaining to a child. \"Including good luck. My prayer will invoke your fortune.\"\n\n*I just insulted his religion.*\n\nThe last thing I needed was a vengeful priest with dark eyes and no presence. I backpedaled. \"Right. Sorry. I'm ignorant about faith. Please, keep praying.\"\n\n\"I will.\" He closed his eyes immediately. Hands clasped. Lips moving in silent devotion.\n\n*At least he's committed.*\n\nI ate the bread and cheese. Good cheese, actually. Better than what I usually bought. The work resumed. One hour later, I'd fixed the magic stone to the mithril skeleton with silver wire. Time for Cassus to earn his keep.\n\n\"Your turn.\" I gestured to the framework. \"Infuse it with divine power.\"\n\nCassus approached without a word. He knelt before the magic stone and began praying aloud.\n\n\"Oh, in the name of Goddess Rebecca!\"\n\nThe prayer went on. And on. And *on.*\n\n*He stood all night praying, and he still has this much energy?*\n\nMy eyes grew heavy. The forge heat, the exhaustion, the droning prayer. I slumped against the anvil.\n\nDarkness took me.\n\n\"Mr. Grid. The divine power infusion is complete.\"\n\nI jolted awake. Cassus's pale face filled my vision. Those dead eyes stared down at me from six inches away.\n\n\"Jesus!\"\n\n\"What's wrong?\"\n\n*What's wrong? You look like a damn vampire.* \n\nI swallowed it. \"Nothing. Let's continue.\"\n\nTwenty-three hours. That's how long the first shield took. Three hours more than my usual production time. Not by choice. Mithril and divine-infused magic stones required precision I barely possessed. Advanced Blacksmith Mastery level three was the *minimum* requirement for a reason.\n\n*If I had more experience with mithril, this would go faster.*\n\nSatisfy rewarded experience. Two blacksmiths with identical stats and skills would produce different results if one had forged a hundred swords and the other had forged ten. Knowledge was one thing. Application was another.\n\n*At least the second shield will be easier.*\n\nI started immediately on shield number two. The castle blacksmith stirred from his nap and wandered over, rubbing his eyes.\n\n\"You finished the first shield?\" He peered at my workbench. \"Why not complete the gold plating? You're one step from done.\"\n\n\"I'm finishing both at the same time.\"\n\nHe frowned. \"That's inefficient.\"\n\n*It's insurance.*\n\nIf the first shield came out Rare, I'd lose all motivation. The doubt would poison the second attempt. Better not to know. Better to finish both and pray one hit Epic rating.\n\nI only had materials for two. This was it.\n\n---\n\n## ***\n\nLim Cheolho reclined on his office sofa. One hour per day, he allowed himself this indulgence. Monitoring users. Watching Satisfy's world breathe and move.\n\nFor the past week, he'd focused on Grid.\n\n\"Hoh.\" He leaned forward. \"Indeed.\"\n\nHis eyes shone like a child watching Saturday morning cartoons.\n\n\"How interesting.\"\n\nHe meant it. Grid fascinated him. The user played inefficiently. No shortcuts. No optimization. Just pure, honest effort. Twenty hours of in-game time per item. Every single time.\n\nRefreshing.\n\n\"Hahaha! Ridiculous! He defeated a level 188 knight through sheer luck!\" Lim Cheolho laughed. \"Ohh, a partnership offer from an NPC? How delightful. The auction prices for his work are climbing. Selling a legendary item to an NPC, though? What a waste. But entertaining! Hm? He didn't recognize Doran's ring on Irene's finger? Such a pity. His relationship with her could've deepened. Creating a transparent cloak, smart choice. Wait, he's not even attempting the invisibility cloak? Well, eventually he'll figure it out. A two-man raid! Good levels and items, but I wish he'd focused on finding Pagma's Swordsmanship. Finally, he found it! No? Hahaha! He's imitating the murals for *hours*! A masterpiece!\"\n\nSometimes admiration. Sometimes regret. Sometimes excitement.\n\nThen anger.\n\n\"No! Why did he refuse Piaro's quest?\" Lim Cheolho sat upright. \"The rewards would've been excellent!\"\n\nAsmophel was weakened. Sick. Grid could've cleared that quest easily. The rewards would've accelerated his growth exponentially. But Grid had been overly cautious. Missed the golden opportunity.\n\n\"He changed after Kesan Canyon.\" Lim Cheolho rubbed his chin. \"Before, he acted impulsively. Chaotically. Now he plans ahead. But he's still inexperienced. Immature.\"\n\nDirector Yoon Sangmin called Grid a fool. His reasoning was sound. Grid failed to leverage his legendary class efficiently. At the time, Lim Cheolho had laughed. Now, watching Grid fumble through opportunities, he understood Yoon Sangmin's frustration.\n\nYoon Sangmin's words echoed in memory:\n\n*'If I was Grid, I'd join a guild immediately. Legendary class guarantees entry to any top guild, regardless of level. They'd support item costs. Help with quests. The class quest would clear faster with a guild's resources. I'd be pursuing larger goals by now. But Grid lacks vision. He tries to do everything solo. No grand strategy. He just sits in a smithy making items.'*\n\nTrue. Most people would think that way. Yoon Sangmin was confident he'd play Grid's class better than Grid himself.\n\nBut Lim Cheolho questioned the premise.\n\n\"Would that be fun?\"\n\nSatisfy was recognized as a second reality. Few viewed it as a mere game anymore. Success in Satisfy equaled success in the real world. Users pursued efficiency above all else.\n\nYet Satisfy remained, at its core, a game. Lim Cheolho designed it for enjoyment. Users should *enjoy* playing. Those who mimicked others' strategies would eventually lose interest.\n\nHe refused to accept that outcome.\n\n\"Grid should play as he likes. No obligation to obsess over efficiency.\"\n\nLim Cheolho overlooked one critical detail. While watching, he'd concluded Grid played for simple enjoyment. A casual user savoring the experience.\n\nThe reality was different. Grid played Satisfy desperately, clawing for success. Financial success. He simply lacked the ability to achieve it efficiently.\n\n\"Huh?\" On screen, Winston Castle's administrator approached Grid. A priest from the Rebecca Church followed. \"This is...\"\n\nLim Cheolho raised his wristwatch to his lips. \"Morpheus.\"\n\nA moment passed. The AI responded.\n\n[Did you call me?]\n\n\"Search the NPC list currently in instance G-HFO6C1E. Is Isabel among them?\"\n\n[No.]\n\n\"What?\"\n\nDoubt creased Lim Cheolho's face.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}