{
  "id": 820,
  "title": "Chapter 820",
  "content": "Gray-furred and three meters long, the bear-wolves resembled oversized wolves at first glance—until you noticed their massive paws. What seemed like simple size concealed something far deadlier: the destructive power of a bear compressed into a predator's frame.\n\nThe White Tiger Sword's stone pillar struck true, launching the beast five meters into the air. For a heartbeat the creature hung suspended, disoriented—then instinct took over. Its body twisted mid-flight, converting confusion into acceleration. Hundreds of kilograms of fang and claw plummeted toward Mercedes' face, an instant-cast technique no human should be able to evade.\n\nMercedes sidestepped it with practiced ease.\n\nHer insight read the attack's trajectory before the bear-wolf completed its rotation. She slipped past its aerial assault by a hair's breadth, denying the creature its chained combo.\n\nThe bear-wolf's paws hit earth. Wolf-like agility transformed its failed strike into a spinning follow-up, claws arcing toward Mercedes' exposed flank. She recognized the danger a fraction too late—abandoning her counterattack to create distance instead.\n\n*Grrrrr...*\n\nThe creature lowered its chest to the ground, haunches coiled.\n\n*It'll spin again.*\n\nMercedes analyzed the bear-wolf's physiology and movement patterns, calculating the force of its next assault. The White Tiger Sword filled one hand. Her backup blade occupied the other.\n\nThe legendary knight prepared to fight seriously.\n\n*Ttang! Ttang!*\n\nGrid's hammer strikes faltered as he watched the exchange, the portable furnace repair nearly complete.\n\n\"What the hell *is* that thing?\"\n\nHe imagined himself in Mercedes' position. The first strike? Maybe he could dodge it. But that pivoting follow-up would've caught him mid-recovery, sent him flying. He'd have been pummeled.\n\n*Kraugel wasn't exaggerating.*\n\nThe Sword Saint had warned him—bear-wolves were strong, difficult to hunt. Grid had dismissed it as hyperbole. Field monsters, threatening? Now he understood. Without Mercedes, raising his Overgeared Skeletons' levels here would've been impossible. He couldn't manage the skeletons *and* fight these things simultaneously.\n\nBeniyaru's murmur reached his ears. \"To face an ancient species...\"\n\n\"Ancient species?\"\n\n\"Beasts that have existed since the world tree's beginning. Bear-wolves are among them. Despite thousands of years of elven history, their numbers remain stable. For a human to challenge them directly...\"\n\nOne person. Handling a bear-wolf alone. She even had breathing room.\n\n*Truly legendary...*\n\nBeniyaru thought of Povia, the half-elf archer of legend. Then a piercing shriek snapped her attention back.\n\nThe bear-wolf had attempted its spinning assault, claws extended to shred Mercedes—only to find the situation reversed. Both front paws were pierced through by her twin blades. The creature howled as the White Tiger Sword's rapidly increasing weight pressed down on its massive body.\n\n**[There will be a one-second penalty in the recovery of the White Tiger Sword.]**\n\nThe White Tiger's fatal flaw revealed itself. Mercedes couldn't retrieve the weapon pinning the bear-wolf down.\n\n\"*Haaap!*\"\n\nHer free sword blazed with light. She raised it for the finishing blow—then stopped. Her mission was to draw aggro, not to kill. The final strike belonged to—\n\n*Clack! Clack clack!*\n\nRandy and the Overgeared Skeletons unleashed their assault. The damage was pitiful. The skeletons chipped away single-digit health chunks. Randy's attacks, even mimicking Grid's form, barely broke four digits.\n\nThe bear-wolf surged upright, completely ignoring the small fry clinging to its flanks. It charged Mercedes again.\n\nBullfighter and bull. Exactly as Grid requested—Mercedes held absolute aggro.\n\n*Ttang! Ttang!*\n\nThe furnace repair neared completion. Grid watched the bear-wolf's health drain and shouted, \"Okay! Go!\"\n\nHe anticipated the experience gains for his Overgeared Skeletons and Randy. Particularly, he wondered what would happen when the skeletons hit level 100. Would they experience stat awakening like players? Could they promote classes—skeleton warrior, skeleton mage? His expectations soared.\n\n*CRASH.*\n\nTrees splintered in the distance—hundreds of meters away at first, then closer. A massive trunk toppled behind Mercedes. A second bear-wolf emerged, shoulder muscles bulging as it bulldozed through the forest. Its paw swept toward her.\n\nFive minutes since the first bear-wolf appeared.\n\nManageable so far. Mercedes juggled both bear-wolves without serious difficulty, maintaining aggro while Randy and the skeletons focused their damage. Then the third bear-wolf arrived.\n\n\"*Ugh...!*\"\n\nThe three creatures fought like trained soldiers—coordinated strikes from every angle. Mercedes suffered her first wound. Their power multiplied with each additional bear-wolf.\n\nGrid wasn't worried. He believed in the legendary knight.\n\n\"White Tiger's Attitude.\"\n\nMercedes activated the skill at maximum output.\n\n**[White Tiger's Attitude]**  \n**[Acquires the attitude of the White Tiger.**  \n**Attack power and movement are reduced by 80% and defense is increased by 198%.**  \n**Skill Mana Cost: 17 per second.**  \n**Skill Cooldown Time: 30 minutes.]**\n\nHer defense skyrocketed. Mercedes weathered the three-way assault, her swordsmanship shifting into pure defensive form. Grid finished the furnace repair and loaded white phosphorus wood. Temperature rising.\n\n**[You have defeated a bear-wolf.]**\n\nThe notification arrived as the fourth bear-wolf appeared. Twenty minutes after the first creature spawned, it finally fell. The rewards exceeded every expectation.\n\n**[The level of Overgeared Skeleton One has risen!]**  \n**[The level of Overgeared Skeleton One has risen...]**  \n**[The level of Overgeared Skeleton One...]**  \n**[The level of Overgeared Skeleton One...]**\n\n**[The level of Overgeared Skeleton Two has risen!]**  \n**[The level of Overgeared Skeleton Two has risen...]**  \n**[The level of Overgeared Skeleton Two...]**\n\n**[Doppelganger Randy's level has risen!]**  \n**[Doppelganger Randy's level has risen...]**\n\nFourteen levels for the Overgeared Skeletons. Three levels for Randy. And—\n\n**[39,000,100 experience has been acquired.]**\n\nAs master of his summons, Grid claimed his share. Only a fraction of the total experience, but still substantial.\n\n*Worth every second of this marathon hunt.*\n\nKraugel's recommendation proved golden. Grid called out, \"Keep it to two bear-wolves maximum!\"\n\n\"Yes!\"\n\nThe creatures spawned every five minutes regardless. No point juggling three or more simultaneously. Mercedes received her orders and unleashed her true power. The ground trembled beneath her feet.\n\n**[White Tiger's Cry Lv. 1]**  \n**[Creates an earthquake with a radius of 5 meters.**  \n**All objects within range are subjected to a 'loss of balance' status and a 13% reduction in defense, evasion, and accuracy. If the target is using a spell or skill, casting is forcibly canceled.**  \n**Mana Consumption: 1,500**  \n**Skill Cooldown Time: 10 minutes.]**\n\nThe bear-wolves stumbled, fighting to regain balance with raw athleticism—but Mercedes exploited the opening. A storm of sword energy consumed them.\n\n*Ttang! Ttang!*\n\nGrid observed Mercedes' movements, mentally designing armor and shields optimized for her combat style. First, though—\n\n\"Mercedes!\"\n\n\"Yes!\"\n\n\"Collect all the bear-wolf loot and give it to me later!\"\n\n\"Yes!\"\n\nThe hunt continued, bear-wolf cries echoing through the forest. Grid's experience bar crept upward—0.5% gained despite zero combat participation. The Overgeared Skeletons reached level 100.\n\n**[Overgeared Skeletons One and Two have received their first stats awakening!]**\n\nStat awakening at level 100, identical to players. Furthermore—\n\n**[Overgeared Skeletons One and Two can be upgraded. Please select the desired class.]**\n\nClass promotion unlocked.\n\nGrid's expectations met perfectly. What secondary classes awaited basic skeletons? His heart thundered as the selection menu materialized before him.\n\n*Clack! Clack clack!*\n\nThe Overgeared Skeletons sensed their own growth. Excited, they clasped bony hands and danced in celebration."
}