{
  "id": 821,
  "title": "Chapter 821",
  "content": "> [Overgeared Skeletons One and Two have reached Level 100. Class advancement is now available. Please select the desired specialization.]\n\nGrid froze mid-step as the notification appeared, his pulse quickening with excitement that burned hotter than the white phosphorus wood's residual heat against his skin.\n\n'Skeleton warrior? Skeleton mage?'\n\nHe knew the standard evolution paths by heart. Skeleton → Skeleton Warrior → Skeleton Knight → Death Knight, Dark Knight, or Reaper. Or alternatively: Skeleton → Skeleton Mage → Skeleton General → Lich. Both trees were well-documented progressions for ordinary undead.\n\nThe possibilities made his imagination run wild. Overgeared Skeleton One as a Death Knight. Overgeared Skeleton Two as a Lich. Grid's lips curved into a broad smile as he called them over.\n\n*Clack! Clack clack!*\n\nThe pair had developed distinct personalities over time, and they responded to him with the eager obedience of loyal pets. Their bones clattered rhythmically as they hurried to his side.\n\n\"Let's see what we've got.\"\n\nGrid's expression was warm as he reached out to tap the golden exclamation marks hovering above their skulls. The interface materialized instantly, displaying options that would thoroughly demolish his expectations.\n\n> [Available Class Advancement Options]\n>\n> **Overgeared Skeleton One:**\n> 1. Skeleton Miner\n> 2. Skeleton Dancer  \n> 3. Skeleton Destroyer\n>\n> **Overgeared Skeleton Two:**\n> 1. Skeleton Miner\n> 2. Skeleton Dancer\n> 3. Skeleton Restorer\n\n\"You've got to be kidding me.\"\n\nWhere were the warriors? The mages? What the hell were *Miner* and *Dancer* doing on an undead advancement list? Grid rubbed his eyes, certain he was hallucinating. The text remained unchanged.\n\n\"Why does this always—\" His whole body trembled with rising fury, teeth grinding together. Then he caught sight of Mercedes and Randy still fighting the bear-wolves alone, the knight clearly conserving her stamina to ensure the skeletons could gain experience before—\n\nGrid forced himself to take several deep breaths.\n\n'Calm down. Think.'\n\nHe examined each option's description:\n\n> [Skeleton Miner]  \n> Due to extensive mining work enforced by their master, the Overgeared Skeletons have developed the natural aptitude of miners. They are likely to be relatively proficient at resource extraction.\n\n> [Skeleton Dancer]  \n> The Overgeared Skeletons perform spontaneous dances whenever the wind stirs. Though their technique remains rudimentary, they have developed the foundations of a dancer's grace.\n\n\"...Of course there's a reason.\"\n\nThe realization hit him like a hammer. All those hours forcing them to mine. That time he'd left them standing in the wind, watching them dance mindlessly while he worked on other things...\n\n'No—even if I hadn't done those things, it probably would've turned out just as ridiculous.'\n\nHe refocused on the remaining options: Destroyer and Restorer. Based purely on the names, they sounded more promising than the standard paths anyway. Perhaps even *better* than an ordinary warrior or mage...\n\nGrid swallowed, hope rekindling in his chest despite everything.\n\n> [Skeleton Destroyer]  \n> Overgeared Skeleton One has repeatedly destroyed Overgeared Skeleton Two during their development, granting it specialized knowledge in inflicting critical damage to undead entities. Even Death Knights should exercise caution in the presence of a Skeleton Destroyer.\n\n\"...\"\n\n> [Skeleton Restorer]  \n> After enduring multiple instances of destruction at Overgeared Skeleton One's hands, Overgeared Skeleton Two utilized its superior intelligence to develop rapid bone reconstruction techniques using mana. This class functions as a skeletal healer. The presence of a Skeleton Restorer will significantly extend the combat longevity of skeleton-based undead.\n\n\"...\"\n\nGrid's eyes drifted shut as memories surfaced unbidden. Overgeared Skeleton One smacking Overgeared Skeleton Two in the back of the skull. Overgeared Skeleton Two's body flying apart from the impact...\n\n\"Why...\" His voice was barely a whisper. \"Why did I let them keep doing that?\"\n\nThe truth was undeniable. Destroyer and Restorer were unique specializations born entirely from the Overgeared Skeletons' specific behavioral patterns—patterns *he* had allowed, even encouraged through neglect. Goosebumps prickled along his arms.\n\n'Just how much freedom does the system give them?'\n\nIf their advancement classes could diverge based purely on environment and behavior, they had more agency than most players. Which meant—\n\n'These two really are super-named grade.'\n\nThe conviction settled over Grid like a comfortable weight. Meanwhile, Mercedes continued her defensive battle against three bear-wolves simultaneously, White Tiger's Attitude holding firm despite the mounting stamina cost. Randy fought nearby with support from the God Hands, steadily accumulating experience.\n\n\"Master, should I help?\" Noe's voice interrupted Grid's thoughts.\n\nGrid shook his head. \"No. Just rest.\"\n\nNoe had absorbed massive amounts of energy from the Thunder Stone during the Astaroth raid, triggering his evolution. His power was already at its peak—leveling could wait. Grid's current objectives were twofold: accelerating the growth of the Overgeared Skeletons and Randy, and observing Mercedes' combat style to better design her custom armor. Noe's intervention would only interfere.\n\n\"Initiate class advancement.\"\n\nGrid stroked Noe's soft fur absently, then confirmed his selections with deliberate care. Overgeared Skeleton One: Destroyer. Overgeared Skeleton Two: Restorer. His finger hovered over the confirmation button as paranoia struck—one misclick could doom them to *Miner* or *Dancer*.\n\nHe tapped. Clean hit.\n\n*Flash!*\n\nBrilliant light enveloped both skeletons as system notifications cascaded across Grid's vision.\n\n> [Overgeared Skeleton One has advanced to Skeleton Destroyer.]  \n> [Class advancement bonuses: +10 Strength, +10 Stamina.]  \n> [New Skill Acquired: Bone Cracking]\n\n> **[Bone Cracking Lv. 1]**  \n> Low probability of completely destroying bone-based materials (undead, items, structures, etc.).  \n> **Mana Cost:** None  \n> **Cooldown:** 20 seconds\n\n> [Overgeared Skeleton Two has advanced to Skeleton Restorer.]  \n> [Class advancement bonuses: +10 Intelligence, +10 Stamina.]  \n> [New Skill Acquired: Bone Sticking]\n\n> **[Bone Sticking Lv. 1]**  \n> Restores 20% of a skeleton-based undead's maximum health. Repairs damaged skeletal structures.  \n> **Mana Cost:** 20  \n> **Cooldown:** 30 seconds\n\n\"...\"\n\nThere was something absurdly fitting about it. One skeleton that specialized in shattering bones, another that excelled at mending them. A perfect dysfunctional pair.\n\n'If this trend continues, will Overgeared Skeleton One become pure destruction incarnate while Overgeared Skeleton Two develops area-of-effect healing?'\n\nGrid would later realize just how limited his imagination had been in this moment. But that revelation awaited their second advancement, still far in the future.\n\n*Kyak kyak! Kyak!!*\n\n\"—!\" Grid jolted.\n\nThe skeletons had developed *voices*. Previously they'd only clacked their jaws mutely, but now actual laughter—shrill and clattering—emerged from their skulls.\n\n\"Unbelievable.\"\n\nThis wasn't some horror movie. So why were these undead abominations somehow... *cute*? Grid found himself questioning Mercedes' taste all over again as he issued his command.\n\n\"Move out! Time to level up!\"\n\n*Kyak kyak! Kyak!*  \n*Kyak kyak kyak!*\n\nTheir enthusiasm was infectious. Overgeared Skeletons One and Two charged toward the bear-wolves, crude weapons stabbing forward. What happened next defied Grid's expectations entirely.\n\n> [Overgeared Skeleton One has dealt 4 damage to the bear-wolf.]  \n> [Overgeared Skeleton Two has dealt 2 damage to the bear-wolf.]\n\nThe damage output had multiplied several times over!\n\n'This is the power of Stats Awakening...!'\n\nFour damage. Two damage. Were such minuscule numbers really worth celebrating? Absolutely—because context mattered. The bear-wolves were estimated at level 400 minimum, while the Overgeared Skeletons had *just* hit level 100. A 300-level gap should have rendered their attacks completely ineffective. The fact that they could inflict any damage at all proved one critical theory:\n\n'Normal monsters don't benefit from Stats Awakening.'\n\nRegular monsters were inherently weak relative to their level. Named-grade monsters enjoyed natural advantages, and that gap would only widen as levels increased. But the Overgeared Skeletons were *super-named* entities—which meant their actual combat value vastly exceeded their nominal level. At level 300 or 400, they'd likely match or surpass boss-tier monsters. And the proof was unfolding right before his eyes.\n\n> [Overgeared Skeleton One has activated 'Bone Cracking'.]\n\n\"—!?!?!\"\n\nGrid's eyes went wide as saucers. Overgeared Skeleton One drove its blade deep into the bear-wolf engaging Mercedes, the skill triggering the instant it detected contact with bone.\n\nThe result—\n\n> [Overgeared Skeleton One has dealt 10,500 damage to the bear-wolf!]  \n> [The bear-wolf's lower body skeletal structure has been shattered. Permanent paralysis inflicted! All stats reduced by 20%!]\n\nFor the first time, a bear-wolf's aggro shifted away from Mercedes and toward the skeletons. The wounded beast's massive paw crashed down toward Overgeared Skeleton One's skull—but the attack proved futile.\n\n*Kik! Kikikik!*\n\nOvergeared Skeleton Two released its rattling laugh an instant before activating Bone Sticking, seamlessly restoring its partner's obliterated head.\n\n*Kyak kyak! Kya kya kyak!*\n\nOvergeared Skeleton One celebrated its restoration with gleeful cackling—then immediately backhanded Overgeared Skeleton Two, sending its skull flying across the battlefield. The healer skeleton fell silent, forced to wait for its skill cooldown to expire before reattaching its own head.\n\n\"...\"\n\nGrid stood motionless, staring at the Overgeared Skeletons with something approaching paternal affection. Even their unhinged laughter was starting to sound endearing."
}