{
  "id": 829,
  "title": "Chapter 829",
  "content": "\"The wealthiest man in the world, and he couldn't even bring a proper gift.\" Yerim's voice carried a teasing lilt as she leaned against Youngwoo's arm, tilting her head to catch his eye. Over the years, she'd grown from Sehee's childhood friend into someone who commanded attention without effort—though the person she wanted to notice most never seemed to see it. \"Chairman Lim came all this way for your birthday. Shouldn't he have at least brought something?\"\n\nYoungwoo reached over and ruffled her hair in that same brotherly way he always did, as natural as breathing. \"He did give me something. Something incredible, actually.\"\n\nNo matter how she positioned herself—leaning close, holding his arm, catching his eye—Youngwoo only ever saw Sehee's best friend. The seal he'd placed on his own heart showed no signs of breaking.\n\n\"Incredible?\" Yerim's tone flattened slightly.\n\n\"More valuable than you'd think.\" A knowing smile crossed Youngwoo's face as he recalled the chairman's parting words.\n\n*The blacksmith god is closely related to the class quest of Pagma's Descendant.*\n\nThat single hint was worth more than gold. The curse that would trigger at -10 affinity with the blacksmith god had been weighing on his mind for weeks now, restricting his choices, making him second-guess every decision. But Chairman Lim's words reframed everything. What if the curse itself was part of something larger? What if reaching that threshold triggered an event rather than simple punishment?\n\nHis pulse quickened. He needed to get back into Satisfy—now.\n\n\"Don't you still have ninety minutes before you can reconnect?\" Sehee's voice cut through his thoughts, gentle but perceptive as always. \"We can wait. Have the party after.\"\n\nYoungwoo turned to his sister, something warm settling in his chest. How many siblings would not only track their brother's game restrictions but adjust family celebrations around them? He pulled her into a quick, fierce hug before heading straight for his capsule.\n\n***\n\nMorning light filtered through the canopy in pale columns, turning the forest air hazy. Mercedes sat alone on a broad stone outcropping, eyes closed, replaying yesterday's battle against the giant cave cricket frame by frame in her mind.\n\nThe creature had overwhelmed her with sheer speed and ferocity. If she'd had a shield—a proper, sturdy shield—she could have anchored herself, absorbed the worst of the barrage, controlled the engagement. Two swords were elegant, yes. Perfect for cutting through waves of enemies. But against something stronger than herself? The Vaintz family swordsmanship exposed too many openings.\n\nShe'd known it the moment she abandoned her ancestral style during the Astaroth raid, relying instead on the Supreme Swordsmanship to survive.\n\n*No point clinging to tradition when it becomes a liability.*\n\nKing Grid had understood from the start. That's why he'd promised her armor and a shield, not another sword.\n\nMercedes' eyes snapped open. \n\nSomeone was approaching—many someones. Her senses, honed through countless battles, picked out the subtle wrongness in the forest's rhythm. Thousands of presences, moving in formation. Too many to be the elves simply returning with friends from the village. And mixed among them...\n\n*Humans.*\n\nHer jaw tightened. Worse, the elves' presence felt diminished. Hollow. The vibrant connection they usually shared with their elementals had gone silent.\n\nKing Grid had gone to rest. Piaro had returned to the vampire cities after finishing his work. That left Mercedes alone.\n\nHer orders were simple: wait for Grid's return.\n\nShe hesitated for only a heartbeat before climbing into the nearest tree, pressing herself against the trunk high above the forest floor. Not perfect—any skilled assassin would do better—but enough.\n\nVoices drifted up through the foliage.\n\n\"Stop trying to summon your elementals. Save your strength and walk faster.\"\n\nMercedes' breath caught.\n\nA column of prisoners emerged from the treeline—thousands of elves bound together in a long, stumbling procession, guarded by hundreds of humans who looked far too pleased with themselves.\n\n*What—?*\n\nBeniyaru had said she was meeting a friend. That she'd return with companions. So what was this? Mercedes stared down at the scene unfolding below, taking in the vacant eyes, the cuts and bruises marking pale skin, the slumped shoulders of defeat.\n\nRage kindled hot in her chest.\n\nThen died just as quickly.\n\n*Who am I to be angry?*\n\nShe was an Imperial Knight. How many villages had she razed under the Emperor's banner? How many refugees had she displaced? She'd followed orders, yes. Never took pleasure in it, never mocked or enslaved. But the result was the same—lives destroyed because she held a sword.\n\n*I was just like them.*\n\nShe had no right to pass judgment. No right to interfere without her king's command. The empire had trained that into her bones: a knight does not act on personal feeling.\n\nMercedes closed her eyes, willing herself not to see. Her fists clenched white-knuckled against the branch.\n\nBelow, one of the humans reined in his horse.\n\n\"Hrmm.\" The rider was unremarkable at first glance—dark clothing, guarded posture, minimal equipment. His name was Knight, a player who'd made a name for himself by winning a regional PvP tournament in Russia, even defeating Alexander. His reputation hadn't spread far beyond his homeland; Knight preferred it that way.\n\nBut his skills were undeniable. That's why Merchant King Kir had paid a fortune to hire him.\n\nKir rode up beside him. \"Problem?\"\n\nKnight stared up into the canopy for a long moment. His passive skill—Death God's Sixth Sense—marked the presence above as *extreme threat*. But the presence wasn't moving. Wasn't preparing to attack. \n\nBest to let sleeping dragons lie.\n\n\"Nothing important.\" Knight spurred his horse forward. \"We need to reach the temple before the Yatan Essence wears off. We should move faster.\"\n\n\"Right.\" Kir nodded, then cracked his whip across the backs of the nearest elves. \"Pick up the pace!\"\n\nThe sound echoed through the trees like rifle shots. Players scattered through the column laughed, some joining in with their own whips, treating it like sport.\n\nBeniyaru bit down on the inside of her cheek until she tasted blood. How could she have been so stupid? How could she have trusted them? Her foolishness had damned every elf here. She wanted to bite through her own tongue, let the darkness take her.\n\nBut she couldn't die. Not yet. Someone had to survive this. Someone had to remember. Someone had to eventually save the others who suffered because of her mistakes.\n\nShe would endure.\n\nKir caught the determination in her eyes and smiled. \"That's a good expression. Keep that fire burning. I want to be there when it finally goes out. Heh.\"\n\n\"Bastard!\" Beniyaru's control snapped. She reached for her mana, trying desperately to call even the weakest elemental—\n\nAgony.\n\nThe Yatan Essence in her blood ignited like acid through her veins. Beniyaru's vision whited out. She collapsed, screaming, blood streaming from her nose and ears.\n\nKir's smile widened. \"Money really is the answer to everything. You get what you pay for, don't you?\"\n\nForty million gold. Roughly forty-eight billion won converted to real currency. An insane amount to spend in a game. But Kir didn't see it as spending—he saw it as investment. A wildly successful one. The Yatan Essence that kept the elves helpless had cost a fortune from the Yatan Church, but the returns...\n\nAn entire species enslaved. The elves alone would sell for more than his initial investment. And beyond that? Exclusive rights to harvest the World Tree. The fruit, bark, leaves, branches—resources that would generate income on par with a small nation.\n\n*Father, are you watching? Your son isn't the failure you thought he'd be.*\n\nHe'd transcended the humiliation of his father's miserable end. Only one step remained in the oath he'd sworn at that pathetic funeral.\n\nKir took a deep breath and rode to the front of the column—then stopped.\n\nA pillar of pale red light materialized directly in front of him, the telltale effect of a player logging in.\n\n*Who—?*\n\nHad someone else discovered the forest? Kir frowned but didn't signal an alert. The ward was down. Anyone could stumble in here now. Besides, it was just one player. And his company numbered in the hundreds.\n\n\"Keep moving.\" He gestured forward, intending to simply ride past whoever had logged in.\n\nThen he saw the name floating above the player's head.\n\n**[Grid]**\n\nKir's blood ran cold.\n\nGrid materialized in the forest, took one look around, and froze. \"...What is this?\"\n\nHis gaze swept across the bound elves, the human guards, the whips. His eyes narrowed into chips of ice.\n\nKir forced himself into motion, riding forward with his best diplomatic smile plastered on. \"Grid! What an honor—I'm Kir, ranked first among merchants. I've heard so much about—\"\n\nGrid didn't take his hand. Didn't even glance at it. His attention stayed locked on the prisoners. \"Beniyaru. Can you hear me?\"\n\n\"Grid—\" Kir positioned his horse to block the line of sight, noting the dangerous tension in Grid's jaw. \"Surely you have more important matters—\"\n\nThe words died when Grid's indifferent gaze finally shifted to him. Not hostile—worse. Dismissive. As if Kir were an insect that had briefly buzzed too close.\n\nKir's smile cracked at the edges. \"Your manners are atrocious for someone of your status. You're a king now, aren't you? One of the top-ranked players? Basic courtesy isn't too much to ask.\"\n\n\"Ha.\" Grid's laugh held no humor. The situation had crystallized in his mind with perfect, awful clarity—what these elves had already endured, what awaited them if this continued. His expression hardened to stone. \"How about this: you leave. We both get what we want.\"\n\nSomething in Grid's tone made the hairs on Kir's neck stand up. But he was a top ranker too, dammit. He'd worked too hard, spent too much, to back down now. Especially not in front of his employees. \"This doesn't concern you. Walk away. It's better for both of us.\"\n\n\"Better for you, you mean.\"\n\nGrid's gaze swept past Kir, finding Beniyaru in the crowd. The elf's face was a mask of pain and dried blood. Their eyes met.\n\nGrid's voice gentled. \"Can I help you?\"\n\n\"Why...\" The single word trembled with a dozen unspoken questions. Why would you? Why should I trust you? Why would any human help?\n\nGrid's expression softened into something almost kind. \"I know a high elf named Sticks. He's helped me. I'd like to repay that debt.\"\n\n\"You think I'll just let you interfere?\" Kir's smile turned predatory. He raised his hand—a signal.\n\nDozens of players drew weapons with a unified rasp of steel.\n\n\"Who the hell do you think you are?\" one of them shouted. \"Beat Kraugel once and now you're untouchable?\"\n\n\"Mind your own damn business!\"\n\nThe circle of blades tightened.\n\nGrid never looked away from Beniyaru. Waiting for her answer.\n\nBeniyaru's throat worked. Just minutes ago, she'd sworn never to trust another human. The wound was too fresh, the betrayal too deep. But Grid had invoked Sticks' name. And weeks ago, when Grid could have hurt her, could have taken advantage... he hadn't.\n\n\"...Help us.\" Her voice cracked. \"Please! Help us!\"\n\nThe desperate plea hit Grid like a physical blow. His jaw set.\n\n\"Yeah. I'll help.\" A grim smile touched his lips. \"I'll be the apostle of justice.\"\n\n\"What—?!\"\n\nThe world blurred.\n\nKir's company didn't even see Grid move. One moment he was standing alone. The next, his fist had multiplied into dozens of strikes that connected with bone-crushing force. Players crumpled like puppets with cut strings, the skill *Unbreakable Justice* living up to its name.\n\nThe rescue had begun."
}