{
  "id": 83,
  "title": "Chapter 83",
  "content": "# Chapter 83\n\nTwo hours left on the quest. Grid finished plating the first shield and wiped the sweat from his brow. The information window materialized before him.\n\n---\n\n> **[Divine Shield]**\n> \n> Rating: <span class=\"rarity-rare\">Rare</span>  \n> Durability: 360/360 | Defense: 189 | Magic Resistance: 150\n> \n> * Rare chance of completely resisting dark spells.\n> \n> An item crafted by a blacksmith with great skill and potential, though his experience and reputation remain lacking.\n> \n> Thanks to the power of Cassus, a priest of the Rebecca Church, it shines with the divine power of the goddess of light. Due to its strength against dark magic, all followers of demons and the Yatan Church will suffer when facing this shield.\n> \n> User Restriction: Level 190+. Strength 500+. Divine Power 1,000+. Member of the Rebecca Church.\n> \n> Weight: 800\n\n> [A <span class=\"rarity-rare\">Rare</span> rated item has been produced. All stats have permanently increased by +2. Reputation throughout the continent has increased by +30.]\n\n---\n\nGrid's hands clenched around the hammer. \"This is shit.\"\n\n*Rare. Rare rated.* The word throbbed behind his eyes like a migraine. *I need Epic at minimum. I NEED it.*\n\nHis entire fortune had gone into these two shields. Materials. Time. Opportunity cost. If the second shield also came out Rare and this quest failed, he wouldn't break even. He'd be lucky to eat this month.\n\nHis hands shook. The hammer rattled against the anvil.\n\nCassus spoke from his prayer mat. \"The other will finish with good results.\"\n\nGrid rounded on him. \"You said praying would have a clear effect! What is this then?\" He gestured wildly at the shield. \"Does your god even exist?\"\n\nSilence.\n\nCassus didn't respond to the outburst. His expression remained blank, but something in the set of his jaw suggested he found Grid's tantrum absurd. Two days locked in a workshop together had taught Grid to read those micro-expressions.\n\nGrid deflated. \"Ah... I'm sorry.\"\n\n*Don't blame Cassus. It's not his fault my luck is garbage.* He turned back to the second shield, forcing his breathing to steady. The plating process required precision. One mistake and—\n\nHe didn't let himself finish the thought.\n\nCarefully. Methodically. He applied the final layer.\n\nThe information window appeared.\n\n---\n\n> **[Perfect Divine Shield]**\n> \n> Rating: <span class=\"rarity-legendary\">Legendary</span>  \n> Durability: 680/680 | Defense: 370 | Magic Resistance: 280\n> \n> * High chance of completely resisting dark spells.\n> * Skill 'Divine Light' will be generated.\n> * Skill 'Divine Favor' will be generated.\n> \n> An item crafted by a blacksmith with great skill and potential, though his experience and reputation remain lacking.\n> \n> Thanks to the power of Cassus, a priest of the Rebecca Church, it shines with the divine power of the goddess of light. Due to its strength against dark magic, all followers of demons and the Yatan Church will suffer when facing this shield.\n> \n> User Restriction: Level 190+. Strength 500+. Divine Power 1,000+. Member of the Rebecca Church.\n> \n> Weight: 800\n\n> [A <span class=\"rarity-legendary\">Legendary</span> rated item has been produced. All stats have permanently increased by +25. Reputation throughout the continent has increased by +1,000.]\n\n---\n\nGrid's breath caught. His vision swam.\n\nCassus rose from his mat, pale skin catching the forge light. For the first time in two days, his lips curved upward. \"Congratulations.\"\n\nGrid stared at him. The priest's pallid complexion and colorless eyes had seemed unsettling when emotionless, but the smile transformed his face completely.\n\n\"This is all thanks to your prayers!\" Grid's voice cracked with relief.\n\n\"It is Goddess Rebecca's divine favor.\"\n\n\"Yes! That's right! Goddess Rebecca, hooray! Hooray! Hoor—\"\n\n\"Goddess Rebecca is eternal.\" Cassus's smile faded to something reproachful. \"Don't cheer for her like that.\"\n\n\"Ah. Yes. Right.\" Grid grabbed both shields from the workbench. \"Now let's return to the administrator.\"\n\n\"Understood.\"\n\nGrid bolted for the door. The sooner he showed these shields to that administrator, the sooner he'd get paid. The sooner he could start calculating exactly how much debt this would erase.\n\nCassus followed. Despite appearing to merely walk, he kept pace effortlessly.\n\n*Are his legs just that long, or...?* Grid glanced back. The priest glided across the courtyard like his feet weren't quite touching the ground.\n\nThey arrived at the administrator's office. Grid pushed through the door.\n\n\"You came.\"\n\nThe administrator's usual energetic greeting was absent. His face looked drawn, shadows under his eyes.\n\n*Fight with his wife? Well, his mood's about to change.* Grid pulled out the <span class=\"rarity-legendary\">Perfect Divine Shield</span>, holding it high. \"How about this? Impressive, right? No, it's amazing, isn't it?\"\n\nThe administrator said nothing. He took the shield, turning it over in his hands. His fingers traced the engravings.\n\n*Speechless. He's absolutely speechless.* Grid's chest swelled. *First a legendary sword, now a legendary shield. He's wondering if a blacksmith this good can even exist. Wondering if he's dreaming.*\n\n*I'm wondering the same thing.*\n\nThe truth had crystalized over these past months. Making high-rated items required luck, quality materials, time, and effort. When he'd crafted the <span class=\"rarity-epic\">Special Jaffa Arrows</span> in Bairan Village, he'd thought Epic items were easy.\n\nWrong.\n\nWhen he'd made a <span class=\"rarity-unique\">Unique</span> rated dagger in that timed competition with Euphemina, he'd thought Unique items were simple.\n\nWrong again.\n\n*Making a Legendary item is like winning the lottery.*\n\nHis gaze drifted to Cassus. *Maybe the prayer really did work.* The priest stood motionless, face blank as always, but Grid no longer found it unsettling.\n\nGrid smiled at him.\n\nCassus's expression froze. \"Do you have complaints toward me?\"\n\n*Is my smile that bad?* Grid filed away a mental note to practice in front of a mirror. Seriously practice. Maybe watch tutorials.\n\n\"Good work,\" the administrator said.\n\nGrid blinked. \"Huh?\"\n\nWhere was the excitement? The exclamations? When Grid had first brought the <span class=\"rarity-legendary\">Sword of Self-transcendence</span>, the administrator had practically climbed the walls with enthusiasm. Now he looked like Grid had delivered a sack of potatoes.\n\n\"I will determine the value as soon as possible.\" The administrator set the shield on his desk. \"You should go back for today.\"\n\n\"What?\" Grid stepped forward. \"You priced the Sword immediately. Why am I going back empty-handed?\"\n\n\"There is a financial crisis due to the recent war. I will set a price after meeting with Lady Irene.\"\n\n\"Oh.\" Grid frowned, but nodded. \"Okay, I guess.\"\n\nHe extended his hand toward the administrator. The older man stared at it.\n\n\"This hand?\"\n\nGrid pointed at the <span class=\"rarity-legendary\">Perfect Divine Shield</span>. \"That. Give it back.\"\n\nThe administrator's face darkened. \"Why would I give it back?\"\n\n\"Eh?\"\n\n*What's wrong with this old man? Did he take the wrong medication?*\n\n\"Isn't it natural to return an item to its owner?\" Grid kept his hand out.\n\n\"Owner?\" The administrator's voice rose. \"You think you're the owner of this shield?\"\n\n\"Then whose is it if it isn't mine?\"\n\n\"You...\" The administrator's face flushed red. His hands clenched into fists. \"The owner of this shield is someone we can't go against!\"\n\nHis voice cracked with genuine fury.\n\n*Someone we can't go against? Lady Irene?* Grid's confusion deepened. *Money hasn't been paid yet, so the shield is mine. I'm exercising ownership over my property. Why is he so angry?*\n\n\"Guards!\" The administrator strode to the door. \"Come and capture this person!\"\n\nFour guards burst into the office, spears leveled. They hesitated when they saw Grid, recognition flickering across their faces, but orders were orders. They seized his arms.\n\nGrid struggled. \"What are you doing? Why are you capturing an innocent person? This is misconduct!\"\n\nThe administrator clutched the shield to his chest. \"Shut up! I treated you well due to past accomplishments, yet you dare to overstep!\"\n\n\"*You're* in the wrong here!\" \n\n\"Lock him in the castle's dungeon. Now.\"\n\n\"You crazy—\"\n\nThe administrator turned toward the door.\n\n\"Wait there.\"\n\nCassus blocked his path. He raised one hand, tracing a cross in the air above the administrator's head.\n\n\"Light of Purification.\"\n\nWhite light flooded the office. Not harsh or blinding, but warm. Peaceful. It washed over Grid like sunlight through clean water.\n\nThe administrator staggered. He looked around wildly. \"What? What is this situation?\" His gaze fell on Grid. \"Why are the guards holding you?\" He looked down at his own hands. \"What is this shield? Why am I holding this?\"\n\nGrid's jaw dropped. *Does he have dementia?*\n\nThe administrator's legs buckled. He collapsed.\n\n\"Administrator!\" The guards released Grid, rushing to support the fallen man.\n\nCassus approached Grid. \"The administrator was brainwashed by the Yatan Church.\"\n\n\"Brainwashed?\"\n\n\"Consider the facts.\" Cassus's voice remained level, clinical. \"Only members of the Rebecca Church can handle the Divine Shield. There is no one in Winston who can use it. Even if Winston owns the Divine Shield, they cannot use it to defend against the Yatan Church. So why did the administrator commission its creation?\"\n\nGrid's stomach dropped. \"I didn't think about that.\"\n\n\"I grew suspicious when the administrator requested only a priest to help craft the shield. If he truly intended to defend Winston, he would have also requested a paladin to wield it.\"\n\n\"I see. So I made a mistake. And you suspected me.\"\n\nOne of the four guards spoke. The youngest one, supporting the administrator's left side. He straightened, brushing dust from his uniform.\n\nCassus's gaze locked onto him. Dark energy erupted from the guard's body, black smoke curling upward. When it cleared, an elderly man stood in the guard's place.\n\n\"What—?\" Grid stumbled backward.\n\nThe remaining three guards gaped. \"Who are you? Where's Roy?\"\n\nTheir companion had transformed before their eyes. The old man waved his hand dismissively. Black nails materialized in the air, sharp as daggers. They shot forward. Three wet *thunk* sounds. Three bodies hit the floor.\n\nCassus stepped between Grid and the old man. \"Dirty infidel. You dare commit murder before a priest of Rebecca?\"\n\nThe old man laughed. He bent down, retrieving the <span class=\"rarity-legendary\">Perfect Divine Shield</span> from where the administrator had dropped it. \"From my point of view, *you're* the dirty infidel.\"\n\nThe office wall exploded.\n\nStone and dust erupted inward. A figure emerged from the debris, backlit by afternoon sun. A girl in an embroidered blue dress, dark hair tied with ribbons. Green letters hovered above her head: **Isabel**.\n\nShe looked like she'd stepped out of a manhwa illustration.\n\nCassus didn't look at the destruction. \"Why did you go through the wall when there's a door?\"\n\nIsabel grinned. \"Isn't this cooler?\"\n\nSilence.\n\n*What is happening?* Grid's brain struggled to process the last thirty seconds. *What the hell is going on?*\n\nIsabel raised her hand. A golden circle materialized in the air, edges spinning with light. A white spear emerged from its center, shaft gleaming like pearl.\n\nThe old man's face went ashen. \"Lifael's Spear?\" His voice cracked. \"Don't tell me—\"\n\n\"What does the Yatan Church want with the Divine Shield?\" Isabel tilted her head, still smiling. She hefted the spear.\n\n\"Impossible!\" The old man backed toward the broken wall. \"Why is Rebecca's Daughter here?\"\n\nIsabel dragged her tongue along the spear's edge. \"Shall we play?\"\n\nThe old man fled through the hole in the wall. Isabel pursued, moving with inhuman speed. Cassus followed, robes billowing.\n\nGrid stood alone in the office, surrounded by bodies and debris.\n\n\"What just...\" His brain caught up. \"Hey, you crazy geezer! My shield!\"\n\nHe sprinted for the hole in the wall.\n\nThe corridor beyond stretched empty. Isabel and Cassus had already vanished around a corner. Grid pushed his legs harder, lungs burning.\n\n*Not fast enough. I'm not fast enough.*\n\nTheir speed defied logic. Within seconds, he'd lost them completely.\n\nGrid skidded to a halt at a four-way intersection, gasping. \"Which way? Which way did they go?\"\n\nWinston Castle sprawled across three floors, hundreds of rooms branching off dozens of corridors. No witnesses. No signs. No clues.\n\n\"Someone must have seen them!\" He jogged down the left corridor, scanning for servants or guards. Anyone.\n\nEmpty. All empty.\n\n*The quest notification. It has to trigger soon.* He checked his interface every few seconds. *I invested everything into that shield. Legendary materials, Cassus's prayer time, my fortune. There HAS to be a quest to recover it.*\n\nFive minutes passed.\n\nTen minutes.\n\nThirty minutes.\n\nNo notification appeared.\n\nGrid slumped against a wall. \"This really stinks.\"\n\n*Random quests spawn constantly. Constantly. But when I actually need one?* He pulled up his quest log, as if staring at it would summon new entries.\n\nNothing.\n\n\"Shit! SHIT! Is this a joke?\" His voice echoed off stone walls. \"How can I lose a legendary item that easily? That's worth hundreds of millions of won!\"\n\nHis debt flashed through his mind. The exact figure. Always the exact figure. That shield would have cut it almost in half.\n\n\"No way. No way, no way, no way.\"\n\nAnger bubbled up from his chest, hot and acidic. He slammed his fist against the wall.\n\n\"Give me my shield, you bastards! I could pay off half my debt if I sold that, you worthless—\"\n\nHis shout carried down the corridor. It bounced off paintings and tapestries and suits of decorative armor.\n\nNo one answered.\n\n---\n\n**Glossary of Common Korean Terms**  \n**OG:** [Glossary Link]\n\n*Current schedule: 20 chapters a week.*\n\n*Check out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day.*"
}