{
  "id": 830,
  "title": "Chapter 830",
  "content": "Grid's fist blazed forward, wreathed in divine light. **Unbreakable Justice**—an area-of-effect skill dealing three hundred percent of his attack power—caught five of Kir's Company mid-formation. Level 250 players equipped with unique-rated gear, yet they barely registered the attack before it connected.\n\n[You have suffered 2,900 damage.]\n[You have suffered 3,150 damage.]\n\n\"Gh—!\"\n\nThe strike was blindingly fast, but survivable. Even Grid, ranked first in PvP, couldn't one-shot elites decked in top-tier equipment. The five players immediately counterattacked, weapons flashing as they drew on the considerable arsenal Kir had provided them.\n\nTheir narrow field of vision never registered the threat spinning toward them from behind.\n\n[You have suffered 11,290 damage.]\n[You have suffered 9,870 damage.]\n\n\"What the—?!\"\n\nA blade carved through the air, silver thread gleaming from its pommel. Before they could process the attack, the weapon flashed crimson and shot back toward Grid's outstretched hand, fusing seamlessly with his sword. The **Lightning Sword Born from Enlightenment and Strong Desires** materialized fully in his grip.\n\nThanks to an ancient enhancement scroll, Grid had successfully upgraded the weapon to +1. A modest five percent increase in power—yet that \"modest\" improvement added one hundred and eighty-nine attack damage to a weapon already exceeding three thousand base attack power.\n\nFive percent sounded negligible. Apply it to a weapon with a hundred attack and you gained a mere five damage. For rare or epic gear, that percentage barely registered. But for myth-rated equipment with astronomical base stats? That five percent became devastating.\n\nThe difference between victory and defeat often hinged on far less.\n\n'Damn it,' Grid cursed internally, even as he carved through his enemies. 'If I'd gotten it to +3, I'd have over five hundred additional damage.'\n\nHe activated **Quick Movements**, agility surging as he plunged deeper into enemy ranks. The God Hands orbited him, deflecting incoming attacks while his blade painted arcs of lightning through flesh and bone.\n\n[You have suffered catastrophic damage!]\n[You have died.]\n\n[You have suffered catastrophic damage!]\n[You have died.]\n\n\"Impossible...\"\n\nColor drained from the faces of Kir's Company as their comrades exploded into light with single strikes.\n\n'This isn't what we saw in the footage!'\n\nNearly every Satisfy player had studied the National Competition videos religiously. Those who missed the live broadcasts watched replays. High-level PvP matches were analyzed frame by frame, watched dozens of times.\n\nKir's Company was no exception. They'd earned fortune and gear in Kir's service, dreaming of becoming rankers themselves. The National Competition served as both inspiration and textbook—Grid's matches from all three competitions memorized and dissected until they felt confident they understood his style.\n\nThey'd been certain they could defeat him. Avoid the black and white transformations—**Blackening** and **Assimilation**. Watch for his instant-kill quick attack skill. Simple enough, wasn't it?\n\nReality shattered that confidence like porcelain.\n\n\"Guh!\"\n\nGrid's movements, so easy to track in slow-motion replays, became impossible to follow with the naked eye. His attack patterns, seemingly straightforward compared to Kraugel's elegant complexity, proved utterly unpredictable in person.\n\nThe defensive, counter-attacking style Grid displayed against superior opponents? That only emerged when facing players who surpassed his own control. Against Kir's Company, his \"relatively normal control\" proved more than sufficient.\n\nThey couldn't predict where he'd strike. Couldn't anticipate his timing. And worst of all—\n\n[You have suffered catastrophic damage!]\n[You have died.]\n\n—his attack power killed them in a single blow.\n\n\"This is insane!\"\n\nThirty seconds. That's all it took. More than ten corpses dissolved into light, and the survivors' faces turned ashen. Some backed away like whipped dogs.\n\nGrid's expression remained utterly calm throughout the slaughter. The elite subordinates of the Merchant King—the man most likely to found a kingdom after Grid and Ares—might as well have been training dummies. His face showed no excitement, no satisfaction. Just methodical, absolute carnage.\n\n\"Orders?\" the magician Boutian asked, approaching with the scimitar user Arisa.\n\n\"What should we do?\"\n\nBoth had been with Kir since he first discovered the World Tree's Forest. Level 349 and 351 respectively, armed with legendary equipment courtesy of their merchant master's vast resources.\n\n\"Still deciding,\" Kir said.\n\nHe couldn't commit rashly. Boutian and Arisa commanded thirty fighters between them—all third-advancement rankers. But could even they handle Grid? Not when he possessed **Knights Summoning**.\n\n'I can summon knights too, but...'\n\nThree named NPCs waited in his city, capable of matching whatever Overgeared members Grid called. But Piaro was different. Grid's right-hand man had demonstrated overwhelming power during the great demon raid. A fully-grown named NPC of that caliber? Unstoppable.\n\n'And Knights Summoning isn't my only concern.'\n\nThis was Kir's first time meeting Grid in person, yet the man had already impressed him. Not with his strength—Kir had anticipated Grid's combat prowess from the start. He'd known Knight would need to intervene personally.\n\nNo, what surprised Kir was Grid's *intelligence*.\n\n'His mind works fast.'\n\nA stupid man would've ignored the elves. Would've prioritized building a relationship with the world's top merchant over making an enemy of Kir's Company. Instead, Grid had saved them and maneuvered to make the elves request his direct assistance—laying groundwork for future alliances.\n\n'He saw it instantly.'\n\nThe short-term risk versus the long-term benefit. Grid was the first player king for good reason. That foolish persona he'd cultivated in media appearances? Pure theater.\n\n'Conniving bastard.'\n\nGrid had to be holding something back beyond Knights Summoning. Otherwise he wouldn't dare engage four hundred enemies alone.\n\n\"What if it's simple arrogance?\" Arisa asked.\n\n\"...?\"\n\n\"He's the best in the world. Beating Kraugel probably went to his head. Think about it—even if he summons ten knights maximum, are his guildmates on standby twenty-four hours a day? Is that even feasible?\"\n\n\"...\"\n\n\"Your summoning capacity probably matches his. And even if he calls more than expected, we have numbers. Overthinking becomes its own poison.\"\n\n\"...\"\n\nKir fell silent, calculating.\n\nFinally, Boutian cast **Magic Detection** and spoke. \"Kir, you were right. Grid has something else besides Knights Summoning.\"\n\n\"What?\"\n\n\"A rat hiding in the trees above us.\"\n\n\"Just one? You're certain?\"\n\n\"Yes. Actually, our position favors us. Notice how Grid isn't using area attacks despite being outnumbered?\"\n\nWhy?\n\n\"He's worried about hitting the elves.\"\n\n\"Knights Summoning becomes meaningless. And Jishuka's arrow rain? We'll use the elves as human shields.\"\n\nArisa clapped her hands. \"Exactly! If Kir threatens to kill the elves, we can fight without restrictions.\"\n\nMaintaining their current cautious stance only hurt them. Accept some casualties and they'd win this battle decisively.\n\n\"...All right.\" Kir's expression hardened. \"We'll crush Grid with sheer numbers. Show the Overgeared King what Kir's Company can do!\"\n\n\"Finally!\"\n\nBoutian, Arisa, and the other elite members stepped forward. Morale surged among the high-level fighters who'd been watching Grid's rampage.\n\n—Knight: *Do you intend to sacrifice the elves?*\n\nThe whisper came from Knight, who'd been observing from a distance. Kir scowled. He'd invested forty million gold into this operation. Abandoning the elves meant catastrophic losses.\n\n—Kir: *Impossible.*\n\n—Knight: *Then I won't stop you. I'll give you what you paid for. But...*\n\nKnight's black robes rippled as he drew a massive scythe befitting his Death God class.\n\n—Knight: *I won't risk my life for pocket change. I'll retreat if things turn bad.*\n\n—Kir: *...Is Grid that dangerous?*\n\nKir knew about Knight's **Death God's Sixth Sense**. He had to factor that in.\n\n\"Question mark,\" Knight replied aloud.\n\n\"...What?\"\n\n\"I can't measure him. Take his **Blackening** skill—it means the system can't properly assess his combat potential since he still has room to increase his power. He beat Kraugel, so obviously he's formidable. But you've determined you can handle him, haven't you? I'll leave Grid to you.\"\n\nKnight's gaze shifted upward. The real problem wasn't Grid.\n\nIt was the highest-risk threat hiding in the canopy.\n\nHis scythe bit into ancient wood. The tree fell in a single smooth motion, trunk crashing to earth as a white-haired figure plummeted from the branches.\n\nMercedes hit the ground in a crouch and immediately launched herself at Knight, blade howling through the air.\n\nKir's eyes widened. \"The First Knight?! Why is she here?!\"\n\n\"The First Knight?\"\n\nKnight tensed but held his ground. He'd honor his contract. Death God power erupted outward—dominion over anything possessing finite life. Bushes withered. Trees blackened. A new gauge materialized beneath Mercedes' health bar: **Soul Gauge**.\n\n\"Better hurry if you don't want your soul devoured.\"\n\nThe spectral image of a death god manifested behind Knight's back—power Alexander had never witnessed before being crushed. That's right. Alexander had lost without forcing Knight to reveal his true strength."
}