{
  "id": 831,
  "title": "Chapter 831",
  "content": "# Chapter: Death and Slaughter\n\nThe name said it all. Knight had dreamed of becoming a knight since Satisfy first launched. He devoted years to training and quests, chasing that singular ambition. But fate had other plans.\n\nEvery knights division he joined met the same end—annihilated by unexpected enemies. He moved cities, changed kingdoms, started over. Again and again, his comrades fell around him while he alone survived. The pattern repeated until the system itself took notice.\n\n[You have opened the power of a death god.]\n\n[The spirit of life is perceived as an enemy.]\n\n[The energy of death covets the soul of the target.]\n\nThe growth-type hidden class Death God was far more powerful than any knighthood could offer. But Knight felt no satisfaction. The stigma of death mocked everything he'd once aspired to be.\n\n\"Twelve minutes...\" Knight's voice drifted through the dark curtain veiling him, bitter amusement coloring his words. \"The reputation of the First Knight is well-deserved. I've never seen such a solid soul before.\"\n\nMercedes said nothing. Her soul gauge depleted steadily, the drain slow but inexorable.\n\n\"You'll die if you can't hurt me in twelve minutes,\" Knight warned. His smile held no joy.\n\n***\n\n'Not even close to Immortal's level.'\n\nGrid's blade swept through another victim. Nearly half of Immortal's members had survived his opening strikes—he'd needed two or three blows to put them down. Even as necromancers with inherently weak bodies, their high-rated gear and title bonuses made them genuinely dangerous. A guild of true rankers.\n\nKir's Company? Laughable by comparison.\n\n\"Ack!\"\n\n\"No—!\"\n\nOne strike, one death. Grid's sword flashed and three more players dissolved into gray light. They were pathetically weak compared to Overgeared, Valhalla, or Immortal.\n\nThe disparity amused him. Players spent years carefully nurturing their characters for one simple reason—to dominate. To feel the rush of absolute superiority. Just like he felt right now.\n\n[The target has died!]\n\n[The target has died!]\n\n[The target has—]\n\nThe Enlightenment Sword traced a perfect arc, and three more members vanished. Others couldn't even approach through the barrage of Magic Missiles from his floating God Hands.\n\n'These things never disappoint.'\n\nGrid's grin widened as he carved through hundreds of enemies alone. But beneath the joy, his concentration remained razor-sharp. He parried strikes he could have tanked, conserving stamina when he didn't need to—all to conceal his hidden card.\n\nThe +1 Valhalla of Infinite Affection leaked poison with every blow it absorbed. He wanted that surprise intact.\n\n'The real threats are watching.'\n\nTop rankers circled like hyenas, waiting for their moment. When they finally struck, Grid would bleed. And when he bled, that poison fog would turn the tide.\n\n\"Gahhh!\"\n\nHis fighting energy climbed higher. Red and purple aura blazed around him, each strike hitting harder, his improved agility turning coordinated attacks into amateur flailing.\n\n\"Hup!\"\n\n\"Hiii—!\"\n\nHis eyes flashed. Hearts froze. The smile never left Grid's face as he understood the gulf that separated true strength from pretenders.\n\n'Still not enough for them...'\n\nThe Kir members had watched Grid's broadcasted fights dozens of times—against otherworldly giants, against Great Demon Belial himself. But footage couldn't capture this. The level gap of over a hundred felt insurmountable now that they experienced it firsthand.\n\nTheir control skills, the pride of their gameplay, seemed childish against his movements. The unique items Kir had given them? Meaningless. They'd thought numbers would matter—hundreds against one. But space was limited. Only so many could engage at once, and those who did died.\n\n'We can't win this.'\n\n'How did Kraugel even compete with this monster?'\n\n\"What are you doing?\"\n\nGrid materialized before them like a specter. They flinched backward.\n\n\"Why so distracted? Should I beat you the way you beat the elves?\"\n\n\"That's—\"\n\nOne member stepped back. Then another. The retreat became a rout. Grid stepped forward; they stumbled over each other fleeing. The pride of belonging to a merchant empire's private army crumbled to nothing.\n\n\"Use the elves as shields!\" Kir's voice cut through the panic.\n\nThe Merchant King had entered the fray.\n\n\"Switch to ranged weapons! Magicians, drain your mana potions if you have to! Keep the pressure on Grid—don't give him room! You're safe behind the elves!\"\n\nThe word *safe* rekindled something in the scattered company. Morale flickered back to life.\n\nThey scattered among the thousands of captive elves, drawing bows and throwing daggers. Magicians who'd been suppressed by the God Hands' Magic Missiles began incantations. Thirty-two rankers, including Boutian and Arisa, finally entered the battle properly.\n\n\"Stone Shower.\"\n\nBoutian's spell rained boulders onto Grid's position. Arisa closed from the side, her scimitar slicing toward his exposed flank.\n\n\"Heh. Blocking that? You've improved since the National Competition.\" Arisa's eyes glinted with grudging respect as Grid parried. \"But you're about to have problems.\"\n\nShe'd studied Grid's combat footage obsessively. Quick Movements—that buff skill generated by the God Hands through a specific dagger—had a time limit. And it was about to expire.\n\nSure enough, Grid dodged Boutian's follow-up spells and evaded Arisa's second and third strikes, but the fourth caught him. Her blade flashed like lightning across his chest as her subordinates swarmed in.\n\n\"Perfect timing,\" Grid said. He was smiling.\n\n\"...?\" Confusion flickered across Arisa's face.\n\n[You have become affected by poison!]\n\n[It is an irresistible poison!]\n\n[You will receive 4,300 damage per second!]\n\n'What?!'\n\nWhere had the poison fog come from? Arisa's eyes widened as her health gauge began a rapid descent. Her subordinates pressed their assault, blades and spears stabbing at Grid's armored form.\n\nEvery impact released more dark green fog.\n\n\"Gah!\"\n\nDozens of attackers suddenly found their health plummeting simultaneously.\n\n\"This is absurd! High defense *and* poison damage on contact?\"\n\nArisa backpedaled, fumbling for an antidote. The moment the potion touched her lips, she realized her mistake.\n\n\"No experience fighting stronger opponents, I take it?\" Grid's sword punched through her chest before she could swallow.\n\n[You have suffered 14,900 damage.]\n\n[The durability of the Organ Armor has decreased by 20.]\n\n\"Huh?\"\n\nOne-fifth of her health—gone from a *basic attack*. The level 352 ranker's face paled. This was why he was called a monster. She closed her eyes, expecting the black flames that had consumed Tarma during the National Competition.\n\nThe flames never came.\n\nGrid withdrew his blade and leaped away from Boutian's Earthquake spell. Other rankers gave chase, burning through buff potions that doubled their combat power.\n\nEven Grid couldn't casually handle thirty rankers above level 300 working in concert. Time to stop toying with them.\n\n\"Pagma's Swordsmanship.\"\n\nUntil this moment, he'd used nothing but basic attacks. Nobody in Kir's Company had even noticed.\n\n\"Wave.\"\n\n\"Dodge!\"\n\nThey knew his techniques from broadcasts—Link, Kill, Wave, Pinnacle, Transcend. Every skilled ranker present recognized the telltale stance and scattered outside Wave's range.\n\n\"Over here!\" Boutian cried, scuttling among the elves like a rat. Arisa and the rankers regrouped around him, seizing hostages and pressing blades to throats.\n\n\"Even you have limits,\" Arisa said breathlessly. \"No matter how strong.\"\n\n\"I don't know your connection to the First Knight, but can you really save all these elves?\"\n\n\"Stand down now. We'll even gift you a few elves as compensation. Let's part on good terms.\"\n\nThe delusion of leverage.\n\n\"Fuck off.\" Grid's expression didn't change. He wasn't particularly concerned about the elves—that wasn't why he'd held back his area skills. He simply hadn't needed them against these weaklings. \"Now you're annoying me.\"\n\nTaking hostages ignited something cold in Grid's chest. The price for that mistake would be steep.\n\nRed and purple energy flooded the Enlightenment Sword. The Hero King's fighting energy merged with the Undefeated King's legacy. He raised his blade as he had against the dragon that interrupted the National Competition.\n\n\"You—!\"\n\nShock rippled through the company's ranks.\n\n\"Are you insane?!\" Arisa shouted. \"You'll kill all the elves!\"\n\n\"What?\" Grid's sneer didn't reach his eyes. \"The elves won't die from this.\"\n\nHis sword shifted position. The aura around him blazed like a newborn sun.\n\n\"100,000 Army—\"\n\nBoutian was the target. The strongest among them, cowering behind innocents.\n\n\"Wait!\" Kir's voice rang out with sudden desperation. \"Wouldn't you rather use that power to help the First Knight? She's in danger—the Death God is going to kill her!\"\n\nGrid froze mid-activation. His tone remained measured, deceptively calm. \"Death God?\"\n\nHe glanced toward the dark curtain. Mercedes' radiant hair had turned gray, drained of color. A bone-white scythe hovered at her throat.\n\n\"That player specializes in defense and guarantees death to any target,\" Kir explained rapidly, watching Knight and Mercedes. \"His unique combat style can overpower even the strongest NPC. I'm certain he can—\"\n\nHe stopped mid-sentence.\n\nMercedes' wings of light erupted from her back. Her sword swept upward. The darkness shattered like glass, and a pillar of gray light pierced the sky.\n\n[Your party member Knight has died.]\n\n\"...What?\"\n\nKir knew their capabilities. He'd expected Knight to buy time at best, not win. But to *lose*? This quickly?\n\nHis jaw hung open as the world turned red.\n\n\"100,000 Army Massacre Sword.\"\n\nThirty strikes in one second. Energy blades too fast to track rained down on Boutian's position, shredding everything within range. Blood painted the forest floor.\n\nHuman and elf alike screamed as the technique fulfilled its namesake."
}