{
  "id": 832,
  "title": "Chapter 832",
  "content": "The elves had survived Mercedes' assault. They'd even endured Grid's Linked Kill Wave Pinnacle. Beniyaru stood among them, bloodied but alive. Despite their slender frames—clad only in leaves—the elves possessed defense and vitality that belied their appearance. They were an upper-tier species, fundamentally different from vampires.\n\nBut could they survive the 100,000 Army Massacre Sword?\n\n**[100,000 Army Massacre Sword (Degraded) Lv. 1]**\n\n**[Deals 60% of attack power 30 times to all targets (friend or foe) within a 10-meter radius.]**\n\nGrid couldn't be certain. Even degraded, this was the Undefeated King's technique—the very swordsmanship that had *slaughtered* a hundred thousand enemies. Its power eclipsed anything in Pagma's repertoire. And with the +1 Enlightenment Sword in his hands, there was a real chance the black flames would erupt with each strike.\n\nSo why risk it? Why use an indiscriminate area-of-effect skill when he was trying to *save* the elves?\n\nBecause Grid had an ace up his sleeve.\n\nOr rather, on his thumb.\n\n**[Elf's Bow Thimble (Made by Pagma)]**\n\n**[Rating: Legendary**  \n**Durability: 111/111**  \n**• Bow attack speed +20% when worn (elves receive double effect)**  \n**• Normal attacks and skill attacks can switch to 'Target Mode' (Three-minute cooldown; halved for elves)**  \n\n**A legendary item received from Death Knight Povia on the Behen Archipelago!]**\n\nA fraudulent item that converted non-targeted skills into targeted attacks.\n\nWhen he'd first obtained it, Grid had been too fixated on the 100,000 Army Swordsmanship itself to fully appreciate the thimble's capabilities. He'd stuffed it into his inventory and promptly forgotten about it.\n\nBut discovering the World Tree's Forest had triggered the memory. The bow thimble wasn't just valuable—it was *perfect* for this exact situation.\n\nGrid equipped both the World Tree's Necklace and the bow thimble. His hand settled on the Enlightenment Sword's grip.\n\n\"100,000 Army Massacre Sword.\"\n\nThe technique erupted outward—a wide-range skill by design. Yet only Kir's forces went flying, their bodies torn from where they'd hidden among the thousands of elves. Black flames occasionally licked across elven skin.\n\n\"Kyaaak!\"\n\n\"Agh...!\"\n\nThe elves' natural constitution kept them alive, but two or three successive explosions still left them with serious injuries. Grid winced, but pressed forward.\n\n*They'll live through this much,* he told himself. *They just have to endure.*\n\nGray pillars of light erupted skyward as Kir's forces perished. Grid activated Revolve immediately after the Massacre Sword finished its work.\n\nArisa's scimitar came at him from the side—and reversed mid-swing, plunging into her own chest instead. She staggered, stunned by the massive damage, her voice trembling.\n\n\"What the hell...?\"\n\nThose black flames—they were the instant-kill technique that had obliterated Tarma at the National Competition. But they'd just exploded *dozens of times in a row*. Every skill had a cooldown. The more powerful the skill, the longer the cooldown. This made no sense. This was *impossible*.\n\nGrid looked at her, genuinely confused. \"What do you mean?\"\n\nHe had no idea what she was asking. He didn't realize Arisa had mistaken the black flames for some sort of cooldown-free ultimate skill. The truth was far simpler: it was just his basic attack.\n\nGrid struck once at Arisa's exposed flank. Then twice. He raised his sword for a third blow—\n\nBut it wasn't necessary. Already critically wounded from Revolve's reflected damage, Arisa turned to gray particles after the second strike. A high-level player who'd stood against hundreds of level 200+ warriors without a scratch had fallen helplessly before Grid's onslaught.\n\n*All existences except me are equal before my blade,* Grid wanted to declare.\n\nKir stood frozen, staring at the carnage. Knight—the mercenary he'd hired for *millions* of gold—was dead. His elite forces, cultivated over months, were gone. Butchered.\n\n\"Crazy...\" The word escaped him, barely a whisper.\n\nThe disaster called Grid was something the so-called Merchant King had never prepared for. Only thirty-four people remained from the Massacre Sword's bombardment. They stood in silence, killing intent extinguished, as Grid approached their leader. No one moved to interfere.\n\nEverything Kir had built—the army he'd assembled with his hard-earned fortune—knelt before a single man. For someone who'd built his power on wealth, Grid represented something fundamentally unjust.\n\n*Power,* Kir realized. *I need real power.*\n\nHe shouldn't have been satisfied purchasing a single city. The money he'd invested there could have bought the Empire's favor instead. If Kir had stood under the Emperor's aegis, Grid would never have dared face him like this.\n\nRegret and remorse churned through him as Grid stopped directly in front of him.\n\n\"Is there a demand for elf slaves?\" Grid asked.\n\n\"Don't you think it's a merchant's role to *create* demand?\" Kir's voice dripped with bitterness. \"Why? Do you intend to hunt down the buyers and punish them? Is that your justice?\"\n\n\"I'm not that diligent.\" Grid shrugged. \"I was just wondering how many people treat buying and selling other people like it's normal.\"\n\n\"*People?*\" Kir's eyes widened. He burst into laughter. \"Are you insane? Are you seriously claiming these masses of AI are *people?*\"\n\nAnger flared in his expression. \"NPCs exist for the convenience and progress of us *players*. Only players can be called people. Have you forgotten this is a game after marrying an NPC and spawning one? Or do you *wish* you could become an NPC so your wife and child would be real?\"\n\n\"Kukuk!\" The laugh escaped him, sharp and mocking. Here he was, grinding through Satisfy to fulfill his grand dream—to complete his revenge against his father. Meanwhile, this famous ranker had been playing house with NPCs.\n\n\"I can't acknowledge it.\" Kir's anger boiled over. He stared at Grid with murderous intent and pulled out a heavy bag. The contents clinked and shifted—clearly coins. Hundreds of kilograms worth?\n\n\"You carry that much money around? I suppose that's the first-ranked merchant for you.\" Grid raised an eyebrow, then smirked. \"So what? Trying to bribe me to spare your life? All right. Let's see what you've got. Depending on the amount, I might consider it.\"\n\nHe'd succeeded in rescuing the elves. Mercedes was mopping up the remaining members of Kir's Company. Kir was the only threat left, and even that was debatable. Grid had no personal vendetta demanding Kir's death. If the man wanted to throw money at the problem, why refuse?\n\nBut Kir laughed bitterly. \"You talked about principles, but you're the same as everyone else.\"\n\nIn the end, humans wanted money. Greed was universal. Kir reminded himself of this fundamental truth.\n\n\"Money? If you want it so badly, I'll give it to you!\" He hefted the bag and swung it toward Grid.\n\n*Is he serious?*\n\nGrid had always viewed the merchant class as lacking combat power. This attack seemed meaningless—so pathetic he couldn't even bring himself to mock it properly.\n\nThen—\n\nGrid's instincts screamed. He tried to dodge Kir's painfully slow swing—and couldn't move.\n\n**[The overwhelming power of gold stimulates your greed.]**\n\n**[You cannot resist. You have been seized by the Gold Force.]**\n\n*What?*\n\nThe heavy bag of coins slammed into Grid's face.\n\n**[You have suffered 1 damage.]**\n\n**[The Weight of Riches is absolute law. You cannot bear it!]**\n\n**[You have been knocked out of the battlefield!]**\n\nGrid's body launched into the air like a cannonball—and vanished into the sky."
}