{
  "id": 833,
  "title": "Chapter 833",
  "content": "\"Y-Your Majesty!\"\n\nMercedes stared skyward, devastation written across her face. The impossible had just happened before her eyes.\n\n\"Your Majesty?\" Kir's voice cut through her shock. \"If you mean Grid, you'd better hurry. It's dangerous for him to be alone this deep in the forest.\"\n\n\"Kuk!\" Nothing mattered more than her master's safety. Mercedes glanced between the fallen elves and the grotesque merchant, then took off without another word, sprinting in the direction Grid had been launched.\n\nOnly after her footsteps faded did Kir reveal his desperation. \"Another unexpected expense...\"\n\n> **[Flying Money]**  \n> *A survival skill available only to third advancement merchants. Hits the target and blows them away three kilometers. Inflicts 1 damage. Applies to anyone who cannot resist the smell of money, except a certain species.*  \n> *Skill Resource: Consumes gold proportional to target's level and attack power.*  \n> *Cooldown: None*\n\nOf the two merchants who had achieved third advancement, Kir was one. Few knew this skill existed, and even Kir himself had never tested it until today. Now he understood its terrible power—and its terrible cost.\n\n\"...430,000 gold. Gone.\"\n\nHis hands trembled. He'd expected the skill to be expensive, but this? The operation to capture the elves had failed because of Grid. He'd lost ownership rights to the World Tree. Total losses: 40.43 million gold—over 48.5 billion won.\n\nThe weight of it crushed his chest.\n\n\"Dammit! Dammit!\"\n\nMerchant rankings weren't based solely on level. Completed transactions, total assets—all of it factored in. This incident would strip him of his first-place position and every privilege that came with it.\n\nHis vision darkened. His body shook.\n\n\"Hrmm, this is great.\" Beniyaru laughed at his fury.\n\nKir's rage found a new target. \"You! This is because you cried out!\" He kicked her face repeatedly, spat on her, then forced her onto his horse. \"I'll sell you for whatever price I can get.\"\n\n\"Beniyaru!\"\n\nThe other elves tried to intervene, but the Yatan Essence poisoning had rendered them immobile. They couldn't even twitch their fingers.\n\n\"Knight Summoning!\"\n\nThree knights materialized—Named NPCs, Kir's pride. He issued his command. \"One minute. Kill as many elves as you can. Then take a few back to the city.\"\n\n\"Yes!\"\n\nKir pulled Beniyaru onto the horse behind him and galloped in the opposite direction from Grid's trajectory. Deep grudges settled in his heart.\n\n*Grid! I'll make you regret this day for the rest of your life!*\n\nBehind him, elven screams echoed through the forest.\n\nDarkness filled Beniyaru's empty eyes.\n\n***\n\nGrid didn't know where he'd landed. After being struck by a bag of money and flying several kilometers, he'd lain on the ground for a while. But his recovery was quick. Within moments, he was back on his feet.\n\n\"Wow. This is absurd.\"\n\nThe power of gold that couldn't be resisted? He'd never imagined such a skill existed. If he'd known merchants possessed something this dangerous, he would never have let Kir live.\n\n*I didn't think he'd be this troublesome.*\n\nGrid had noticed Kir leaving the battlefield at the start of the fight. He'd consciously excluded the merchant from the range of his 100,000 Army Massacre Sword. Why? Because he'd been confident he could deal with a merchant who had no escape route.\n\nBut now...\n\n*Dammit.*\n\nOverconfidence was poison. He needed to study more.\n\n*I should collect information on unfamiliar classes and their characteristics.*\n\nWould there ever be an end to the studying required? With Satisfy's countless classes, his pledge might be impossible. But Grid refused to regret it. He believed he could persist without giving up.\n\nAt the same time, he reflected.\n\n*I should've used Mercedes more aggressively.*\n\nHe should have ordered her to monitor Kir, to assess his skills and abilities. She might have detected Flying Money and helped him avoid it.\n\n*I have a legendary knight, but I'm not using her properly. Tsk.*\n\nThe problem wasn't his intelligence. This failure stemmed from excessive confidence. He'd seen himself as a top-tier player and Kir as insignificant. So he'd been careless. He'd failed to maintain concentration and missed critical details.\n\n*Well, everything is experience.*\n\nHe activated Braham's Boots and took to the air. There was no nervousness about leaving Mercedes and the elves alone—he trusted Mercedes. As he flew back toward his original position, he smiled while navigating the forest obstacles from above.\n\n*Kir, you stupid bastard.*\n\nWhat did the merchant think he'd accomplished by blowing Grid away? Mercedes still remained. She would handle Kir's Company and rescue the elves.\n\n*I hope Kir is still alive.*\n\nThen Grid could take his money. It hadn't been \"general consideration\" that made Grid endure Kir's uncomfortable nonsense from start to finish. He'd been patient to maximize his advantages. He'd intended to bargain with a merchant afraid for his life, offering hope for his future. If Kir didn't provide the wealth Grid wanted? Then he'd simply kill him. From Kir's perspective, desperation would be inevitable.\n\n*There's still hope. Mercedes might have kept him alive. Wait...*\n\nGrid stopped in mid-flight, confused.\n\nHe saw Mercedes running toward him from a distance.\n\n\"Your Majesty! Are you alright?\"\n\n\"What?\"\n\nThis was unexpected. Grid's confusion shifted to regret. \"Did you already kill Kir?\"\n\n\"Huh? No, I was worried about your safety and immediately followed.\"\n\n\"What?\" Grid closed the distance between them. Mercedes flinched—Grid had only shown her gentleness since acquiring her. His tone was sharp. \"Are you that incompetent? You abandoned the enemies who needed to be captured and the targets who needed protection?\"\n\n\"...I'm sorry.\" Mercedes wanted to argue, but a knight didn't make excuses to their master.\n\nGrid lifted into the air again. \"Well? Return to the front line immediately!\"\n\n\"Yes!\"\n\nHe didn't rebuke her further. From the perspective of a knight whose top priority was their master's safety, he understood why she'd run while leaving Kir and the elves behind. Her master had been attacked and had disappeared before her eyes. How could she think about anything else? Chasing Grid was natural—her duty was to protect him, not the elves.\n\nStill, it was regrettable. If Mercedes were a player, she could have responded flexibly by sending a whisper or checking his health gauge in the party window.\n\n*It's a limitation of NPCs.* \n\nGrid felt strange whenever he remembered the differences between players and NPCs. His heart especially ached when he thought about Irene. Trying to shake off these thoughts, his shout came louder than usual. \"Knight Summoning!\"\n\n*I don't need Piaro or Asmophel.*\n\nSummoning Asmophel would burden someone traveling the continent to find Red Knights. Piaro would have to return from the vampire city. Besides, Grid needed knights with high mobility to track down Kir, who'd already fled.\n\n\"Huroi! Faker!\"\n\n> [The summoning command has been sent. The response is pending.]  \n> [The targets have accepted the summons.]  \n> [The knights Huroi and Faker have been summoned.]\n\n\"This Huroi! I have come in response to Your Majesty's call!\"\n\n\"What's going on?\"\n\nBoth appeared immediately.\n\n\"Merchant King Kir is somewhere in this forest. He can't have gone far. Find him now and bring him before me.\"\n\nOrator Huroi had a wyvern—he could survey the entire forest from the sky with excellent maneuverability. Meanwhile, Faker was an assassin with superior tracking abilities.\n\n\"Yes!\"\n\n\"Understood.\"\n\nBoth replied confidently. They had no idea what had happened, but they recognized the urgency and immediately took action.\n\nA few minutes after they left...\n\n\"...Ah.\"\n\n\"...\"\n\nGrid and Mercedes arrived at the location where the elves had been. The number of terrified elves had noticeably decreased. Over one hundred elves had vanished in their brief absence. Beniyaru was nowhere to be seen.\n\nAn ominous feeling settled over Grid. He took several deep breaths to clear his mind of terrible possibilities and approached a young elf. He released her bound wrists and ankles.\n\n\"What happened?\"\n\n\"Sob...\" The elf couldn't speak. She shook her head, fear written across her face. She was clearly afraid of Grid—of humans.\n\n\"I'm sorry... I'm sorry, Your Majesty.\" Mercedes bowed deeply, believing this disaster had been caused by her. She felt devastated that the trust Grid had built with the elves had collapsed because she hadn't responded flexibly.\n\nGrid's voice reached her ears. \"No. It isn't your fault. Kir is the one in the wrong. In the end, I've crossed a river that can't be reversed.\"\n\nGrid felt intense hostility and disgust toward Kir, who'd tried to enslave the elves under the excuse that they were just NPCs with artificial intelligence. But he knew most people, not just Kir, perceived NPCs as bits of AI or chunks of graphics. Even among the Overgeared members, weren't there players who didn't recognize NPCs as people?\n\nThere was no reason to waste energy imposing notions of respect and affection on Kir. He'd been just a bastard Grid could extract money from.\n\nUntil a few minutes ago.\n\nNow the situation had changed. Grid took several deep breaths, trying to calm himself.\n\nNo matter how hard he tried, he couldn't settle down. He'd witnessed countless terrible and miserable things before, but why couldn't he ever adapt? His eyes were cold, his hands trembling as he released the frightened elves while sending a whisper to Lauel.\n\n—*Grid: The city of Merchant King Kir. What kingdom is it in?*\n\n—*Lauel: The Gauss Kingdom.*\n\n—*Grid: If we invade the city, does it count as invading the Gauss Kingdom?*\n\n—*Lauel: Of course. There's a high probability a diplomatic problem could lead to war.*\n\nLauel didn't ask what had happened. He'd sent a whisper to Huroi after the summoning and gotten a glimpse of Grid's current situation.\n\n—*Lauel: My role in this life is to realize Your Majesty's will. Don't worry about anything.*\n\n—*Grid: ...*\n\n—*Lauel: Since Mercedes arrived, the Overgeared Kingdom's power clearly exceeds the Gauss Kingdom. They can't defeat us even if war breaks out. Of course, there's room for other countries to intervene.*\n\nSmall nations didn't want the Overgeared Kingdom expanding its power. An alliance of small countries would likely form, and the Overgeared Kingdom would face a great crisis. But Lauel didn't mention this. After all, Grid was the strongest player. Lauel couldn't control him under the reins of \"responsibility\" while Grid was spreading his wings.\n\nLauel thought from Grid's position. How frustrated would he feel if suppressed by the guild and kingdom he'd built with his own efforts? He wouldn't feel strong—he'd doubt himself instead. This was the time to release Grid's desires.\n\n—*Lauel: Please give the command. I'll summon an army to trample Kir's city and burn it.*\n\n—*Grid: Is there a need to move the army?*\n\n—*Lauel: Huh?*\n\nLauel didn't know about the Divinity and Astaroth's Power Grid had recently acquired. A wicked smile appeared on Grid's face.\n\n—*Grid: Leave the army. I'll go alone.*\n\nBut first, he had work to do. He had to chase down Kir and save the kidnapped elves.\n\n\"Mercedes.\"\n\n\"Yes!\"\n\n\"Release the elves here and protect them.\"\n\n\"I understand.\" Mercedes was given an order, so she couldn't tell him she didn't want him to go alone. She wasn't stupid enough to make the same mistake twice. Instead, she believed in her master's power—because that's what he wanted.\n\nGrid received a new whisper.\n\n—*Faker: I've found a party moving with dozens of kidnapped elves. But Kir isn't here.*\n\n—*Grid: There was another party? Yes, it would be impossible for Kir to kidnap or harm over a hundred elves in such a short time alone.*\n\nGrid realized Kir had likely summoned his knights. Natural, since Kir was a baron.\n\n—*Grid: Okay.*\n\nThis was fine. He'd handle all of Kir's knights. A dark smile appeared on Grid's face—evil enough to surprise Mercedes.\n\n—*Grid: Let me know their locations. Also, keep tracking Kir.*\n\nFaker's biggest advantage was that he didn't talk much. He accepted assignments without expressing opinions. But not this time.\n\n—*Faker: I'm two kilometers northwest of the summoning point. Be careful. There are three people, and they're all Named NPCs. Depending on the situation, I'll stop tracking Kir and join you.*\n\n—*Grid: Needing to join me... That won't happen.*\n\n***\n\n*Won't he be blind with rage right now?* \n\nKir laughed. He felt immense pleasure imagining the fury Grid would experience witnessing the elves' deaths. Of course, this lasted only a moment. Kir remembered he'd lost close to 50 billion won in one day, and the slight joy evaporated.\n\n\"You dog bastard!\" Kir cursed.\n\nFrom his perspective, Grid was the scum of the earth. Natural, since Grid had ruined Kir's business empire just to help NPCs. Grid was a disruptive character impossible to understand.\n\n*He's almost at the level of a psychopath.*\n\nKir thought back on his past. How many weak people had he trampled? He'd directly and indirectly exploited countless individuals climbing to first in the merchant rankings. But he'd justified his evil deeds under the guise of revenge against his father.\n\n*...In the end, I'm the same.* \n\nHe regained his rationality. Looking at the wounded Beniyaru, Kir belatedly realized something. Seeing the poison in her heart again, he warned her. \"There's no hope. You can't go back anymore. Just accept reality.\"\n\nIt was also a warning to himself. Kir controlled the poison in his own heart.\n\nThen he heard a tremendous noise from above—a loud roar.\n\n*A wyvern?* Was there a wyvern habitat here?\n\nKir looked up and saw a red wyvern in the sky above the forest. The creature descended with terrifying momentum and landed on the ground, blocking Kir's path. He was forced to stop his horse.\n\n\"This is...!\"\n\nWhy had a wyvern suddenly appeared and blocked his path? Kir froze like a stone statue when he finally noticed a person riding on the wyvern's back.\n\nHuroi.\n\nThe orator dismounted and asked Kir a question. \"Did your parents recently die?\"\n\n\"How did you know?\"\n\n\"...\"\n\nBoth Kir and Huroi were upset by this exchange, but Huroi recovered his composure first. He coughed and adopted a serious expression, as if his previous words had never been spoken.\n\n\"Hoh! You are very bad! You're a terrible person who has gone astray and caused your wonderful, precious parents to feel shocked and sorrowful!\"\n\n\"What?\"\n\nWhy was this person suddenly talking about a stranger's dead parents? From Kir's perspective, Grid, Huroi, and all the Overgeared members were terrible villains."
}