{
  "id": 834,
  "title": "Chapter 834",
  "content": "# Chapter X\n\n\"Your Majesty! I've found that bastard!\" Huroi's voice crackled through the communication crystal.\n\nGrid's eyes narrowed. \"Kir?\"\n\n\"Yes!\"\n\n\"Good work. Faker, rendezvous with Huroi immediately. I'll join you after I've secured the elves.\"\n\n\"Understood.\" Faker's reply was calm, professional. \"But Grid—watch yourself out there.\"\n\nGrid nodded, though Faker couldn't see him. Most players in *Satisfy* relied heavily on their pets—creatures whose power varied wildly depending on species, attributes, level, and a dozen other factors. When individual strength reached its limits, a powerful companion made all the difference.\n\nGrid was the exception. He'd always fought his own battles.\n\nHuroi, however, had cultivated his wyvern from the early days. The Lord of the Skies above the Grasslands—a level 300 beast—unleashed torrents of flame that painted the sky crimson.\n\n**[You have suffered 9,700 damage!]**\n\n**[Burn status inflicted! You will receive 1,330 damage per second.]**\n\n\"Ghaaah!\" Kir's scream tore through the burning forest as fire engulfed him.\n\nHis legendary armor smoked and blackened. Precious jewelry cracked from the intense heat. Already weakened by Huroi's **Spiteful Tongue**, his defense and resistance had plummeted—leaving him vulnerable despite his supposedly invincible gear. The man who'd bragged about being the most overgeared player after Grid himself now writhed in agony.\n\n*I can't win this!*\n\nKir's survival instincts kicked in immediately. He knew what he faced. Huroi wasn't just some support class hiding behind eloquent speeches—the bastard had been the first player to obtain a second class. An Orator *and* a Swordsman. Combined with a battle-trained wyvern, he was high-ranker material.\n\nAnd Kir? A merchant. His only combat skill was **Flying Money**, and even that required gold he couldn't spare.\n\nHe had to run.\n\n\"Your own parents would be ashamed to call you son!\"\n\n\"You—!\" Kir's legs locked.\n\n**[You have been provoked!]**\n\nHis rational mind screamed to flee, but his body refused to obey. The system override was absolute—neither NPC nor player could resist a properly executed taunt. Grid's Longsword—the genuine article, not some mass-produced replica—plunged deep between Kir's ribs.\n\nThe legendary-rated armor held. Barely. The blade didn't pierce flesh.\n\nThe moment the taunt duration expired, Kir gulped a potion and snarled, \"I'm Merchant King Kir! You think rabble like you can hurt me?\"\n\nHuroi might be a high ranker, but he was nothing compared to Grid himself. Kir had used **Flying Money** to literally blow Grid across the battlefield—but wasting gold on someone like Huroi? Unthinkable.\n\nThe wyvern, though... those flames were the real problem.\n\nThe beast seemed to gaze down at him with knowing eyes: *Pay up if you want to live.*\n\n*No! I can't afford it!*\n\nDamn it all. If only he could summon his knights right now! But he'd already called all three just minutes ago—wasting them to slaughter elves out of petty spite toward Grid. The cooldown wouldn't expire for hours.\n\nAnother gout of flame transformed the forest into an inferno. Kir's white horse crashed through burning underbrush, leaping over fallen logs and scattered boulders. Branches whipped past Kir's face as—\n\nHuroi's eyes widened. \"A unicorn?\"\n\nThe horn was small—easy to mistake for an ordinary warhorse at first glance. Judging by its size, the creature was still immature. But even a juvenile unicorn possessed astronomical value. In all Huroi's travels, he'd only ever seen them in the possession of royalty.\n\n\"The rich really are different!\" Huroi urged his wyvern forward, Faker's shadow keeping pace on the ground below.\n\nPursued from earth and sky, Kir felt the noose tightening.\n\n*Why? Why is this happening to me?*\n\nBehind his sweat-matted hair, his eyes burned with equal parts terror and rage. The legendary Merchant King—whose reputation ranked alongside Grid, Kraugel, Agnus, and Ares—was reduced to this: a fleeing coward.\n\n***\n\n\"This is a truly unpleasant assignment.\"\n\nBanus, one of Kir's three knights, spat the words like poison.\n\nBehind him trudged twenty elven prisoners, bound together by enchanted rope. His orders had been clear: massacre the men, capture the women. Slaughter those who resisted, drag away those who couldn't.\n\nEven for a mercenary, it left a foul taste.\n\nThese were sapient beings. Beautiful, helpless, and utterly beneath his dignity as a warrior. What honor was there in terrorizing civilians? He might as well be a common bandit shaking down farmsteads.\n\n*I chose the wrong master.*\n\nKir had promised him wealth beyond measure. Glory on the battlefield. A warrior's greatest honor was testing himself against legendary opponents—and Kir had sworn to provide exactly that. Endless battles against the greatest fighters on the continent. A life of meaningful combat.\n\nThe reality? Whipping frightened prisoners through the woods like cattle.\n\n\"Tch.\" Banus cracked his whip, the leather biting into an elf who'd slowed. \n\n\"Ah!\" Her health bar visibly dropped from the single strike.\n\nThe prisoners had already been beaten by Kir's regular company members—but those injuries were nothing compared to the damage Banus could inflict with casual effort. His strength was on an entirely different level.\n\n\"Stop dragging your feet,\" he growled. \"Cooperate, and I won't touch you. Better for everyone.\"\n\n\"Where are the others?\"\n\nA black-haired man dropped from the sky, landing directly in Banus's path with barely a sound.\n\nBanus studied those sharp, predatory eyes. \"Overgeared King?\"\n\nRecognition flared. Before serving Kir, Banus had worked as a mercenary across the continent—including a stint with the former Eternal Kingdom during their war against the Overgeared Guild. He'd never forget that battle. Particularly his duel with Toban, that dark-skinned paladin. The strongest warrior in Grid's forces. They'd fought for an entire hour before Banus fell—but he'd managed to wound the man. Slow him down. Without that sacrifice, Eternal would have fallen weeks earlier.\n\n\"Kehehehe!\" Banus's grin widened as his muscles began to swell. \"So my master fled from *you*?\" Power radiated from his frame, each flex promising bone-crushing force. \"I watched you from afar during that war. You swept through thousands like wheat before the scythe. Yes... this is *exciting*!\" He laughed—truly laughed—with genuine joy. \"Thank you! Thank you for appearing before me!\"\n\nWithout preamble, Banus charged.\n\nHis body was a weapon honed through decades of combat. Muscles so dense they'd turned aside spears. Skin that had withstood Toban's blade. Combined with the legendary armor Kir provided, he was a walking fortress.\n\nHis fist hammered into Grid's chest with earth-shattering force.\n\n\"Ngh?\" Pain lanced through Banus's knuckles. *Impossible.*\n\nHe'd never felt pain from a bare punch in decades. Gritting his teeth, he drove forward anyway, pouring his full strength into the strike. His fist contained an ogre's might—the same devastating power that had seriously injured Toban. Enhanced by legendary-rated knuckles, the impact should have pulverized ribs.\n\nGrid didn't even flinch.\n\n\"Wh-What?!\" Banus stared in disbelief.\n\nHis punch hadn't scratched the armor. No—that wasn't the problem. Armor was *supposed* to deflect attacks. What stunned him was that Grid remained perfectly balanced, unmoved by the sheer kinetic force. \n\n\"Is this... the power of a legend?\" Banus breathed. He'd known Grid was stronger than Toban, but this was absurd. \"You're the first since the Solo Number Knight to force me to use *this*!\"\n\nMana swirled as Banus activated his ultimate technique.\n\nHis already-swollen muscles expanded further. His right forearm grew as thick as an ogre's torso, veins bulging like steel cables beneath the skin.\n\n\"Now the *real* fight begins!\" Confidence blazed in his eyes—the same technique that had devastated the Ninth Red Knight.\n\n**\"Revolve.\"**\n\n\"Ghhk!\"\n\nBanus's own fist crashed into his face.\n\nThe world spun. He tasted blood—his *own* blood. Impossible. Before he could process what happened, he was on the ground, coughing crimson. Grid's blade rested against his throat.\n\n\"Where did the other two knights take the remaining elves?\"\n\nGrid asked without expecting an answer. He genuinely admired Banus's combat ability—that strike had actually damaged him through his armor, which was no small feat. But loyal named NPCs typically chose death over betrayal. Grid had enough experience with high-loyalty subordinates to know that much.\n\n\"Go straight ahead,\" Banus said clearly. \"You'll find them. I deliberately fell behind—couldn't stand traveling with those two.\"\n\n\"...\" \n\nGrid blinked. That was... unexpected.\n\nBanus tilted his head back, exposing his throat fully. \"Well? Kill me.\"\n\n\"...\"\n\n\"Hmm? What are you waiting for? You slaughtered tens of thousands during the Eternal War. One more corpse won't matter.\" His voice carried no bitterness—only acceptance. \"For a warrior, defeat is death. I have no reason to continue living.\"\n\n\"...I see.\" \n\nGrid raised his blade. He'd always planned to eliminate all of Kir's forces—strip the merchant of everything he valued. It was strange that he hesitated now, feeling a flicker of kinship with this man's warrior spirit and straightforward nature.\n\n\"The warrior who defeated me...\" Banus managed a bloody smile. \"Those other two knights are monsters of a completely different breed. Don't underestimate them. Kuhaha...\"\n\nHis body dissolved into grey particles, leaving behind legendary knuckles.\n\nGrid examined the weapon. Inferior to his own craftsmanship, naturally—but excellent material for smelting. He pocketed them and turned to the elven prisoners, severing their bonds with a quick slash.\n\n\"Return the way we came. Your families are waiting.\"\n\n\"Wait...\" One elf stepped forward—a young woman with round cheeks and large eyes that gave her a rabbit-like appearance. \"I am Deruyaru of the Deru family, one of the Twelve Te. On behalf of my people... thank you.\"\n\n\"Save it for later.\"\n\nNot everyone was rescued yet. Grid left Deruyaru and the others behind, sprinting in the direction Banus had indicated.\n\n\"Noe. Randy.\" His voice turned grim as he ran. \"**Can you Become the King of the Dead?**\"\n\nIf Banus warranted a warning, the other two would be even worse.\n\nGrid had learned to respect such warnings.\n\nHe prepared for the worst."
}