{
  "id": 835,
  "title": "Chapter 835",
  "content": "Kir's lungs burned. Each ragged breath tore at his chest as he urged his mount forward, yet the forest stretched endlessly ahead. What he'd believed to be a treasure trove had become his personal hell. The beautiful flowers, ancient trees, and sweet fruit fragrance—all of it now seemed like an elaborate curse mocking his predicament.\n\nAs he downed another stamina potion, questions churned through his mind. How had it come to this? Why had Grid turned hostile? Was enslaving a few elves really worth this manhunt? And more disturbing—had Grid orchestrated the entire situation from the start?\n\n*Was I dancing in his palm all along?*\n\nWhen had the trap been set? From the moment Kir began investigating the World Tree's Forest?\n\nA massive shadow swept across the ground. Kir's heart hammered against his ribs as Huroi's wyvern circled overhead, its presence suffocating.\n\n\"Pero! Evade!\"\n\nThe unicorn—far superior to any common mount—leapt sideways in a movement impossible for an ordinary horse. Flames scorched the earth where they'd been a heartbeat before, the wyvern's breath carving a blackened trail through the undergrowth.\n\nKir traced the path of destruction and swallowed hard. *Wyverns don't have infinite mana.*\n\nOne, maybe two more flame breaths at most. Meanwhile, Pero could execute his evasion skill dozens more times. The unicorn's mana reserves far exceeded even a drake's.\n\n*I'll survive this.*\n\nKir had no time for regrets or fears. Only the present mattered. He refused to suffer the nightmare of losing massive experience and items to death.\n\n*I'll make it back to my city, no matter what!*\n\nAnd when he did, he'd repay today's humiliation tenfold. Kir clung to that promise—and to the ace cards waiting at his base. Form King Banus, Dark King Dias, and Eating God Phou were the strongest NPCs he'd recruited during his merchant travels. Named NPCs outclassed even elite Overgeared members. Kir had witnessed Piaro's overwhelming performance during the Belial raid firsthand—that level of power confirmed his strategy.\n\nWith another year of investment, his three knights would surpass even Piaro.\n\n*The potential is limitless. They haven't fully developed, yet they already bear titles like \"King\" and \"God.\"*\n\nJust as NPCs called him Merchant King, Banus, Dias, and Phou had earned their epithets from locals long before Kir recruited them. They transcended player limitations, wielding the unlimited growth potential of named NPCs.\n\n*If I escape, Overgeared will likely invade my territory. I'll request support from Gauss Kingdom, defend with my three knights, then relocate to the Empire...*\n\nA smile crept across Kir's face as the plan crystallized. An Overgeared invasion would actually benefit him.\n\nFirst, it would cement hostilities between Gauss and Overgeared. Second, he could weaponize public opinion against the Overgeared Kingdom as aggressors. Third, anxious neighboring kingdoms would become natural allies. As a bonus, relocating to the Empire would shield him from future Overgeared interference.\n\n*The First Knight serving Grid complicates things...*\n\nStill, compared to the Emperor's continental ambitions, that shouldn't matter. As Kir finalized his reasoning, his body jerked upward. Pero had jumped again—this time without warning.\n\nSword energy carved through the space where the unicorn's legs had been. One second slower, and Pero would've been crippled.\n\n*Impossible!*\n\nHuroi had descended fast enough to match the unicorn's speed and attack? An Orator class pulling off that maneuver? Unconvinced, Kir twisted to look back. His eyes widened at the true source of the blade.\n\n\"Faker!\"\n\nGrid had deployed his trump card. Ice flooded Kir's veins. Throughout his rise to Merchant King, information had been his greatest weapon. In his private power rankings compiled through extensive intelligence gathering, Faker held S-class status—just below absolute monsters like Grid, Kraugel, Agnus, and Haster. In terms of pure killing potential, Faker rivaled the continent's apex. Both were high rankers, but Faker operated on a completely different level than B-class Huroi.\n\n*This can't be happening!*\n\nOnce Faker locked onto a target, escape became impossible. Kir knew this.\n\n\"Pero! Brilliant Sprint!\"\n\nPure white light enveloped the unicorn's body. It vanished—not through teleportation, but through movement so rapid the eye couldn't track it. The skill consumed most of Pero's remaining mana.\n\nFaker gazed into the forest depths. \"You think you can escape?\" Then he too vanished.\n\nFrom above, Huroi stroked his jaw thoughtfully. His wyvern circled as he mused aloud, \"A unicorn... Master would look magnificent on such a mount.\"\n\nBlack smoke coiled upward from the forest below.\n\n***\n\nIn the World Tree's Forest, Dias frowned at Phou's declaration.\n\n\"Hungry...\"\n\nBehind them, thirty elves trembled in their bonds. They'd already witnessed what happened when Phou said those words—terror crashed over them like a tide. Every single time.\n\nDias rebuked him. \"You just ate. They're not your food—they're Master's merchandise.\"\n\n\"Hungry...\" When hunger consumed Phou, intelligence fled. Only his stomach mattered. Words became meaningless.\n\n\"Fine. Do what you want.\" Dias raised his hands in surrender. He held no authority over Phou and had learned not to waste energy trying.\n\n\"N-No...!\" The elves paled as Dias retreated. Tears filled their eyes, but Phou simply stared, saliva dripping from his chin.\n\n\"Haaap!\"\n\nThe elf Phou seized met a horrific end—swallowed whole, her form dissolving into grey light.\n\n*Gulp.* Despite consuming a 170-centimeter woman entirely, satisfaction never touched Phou's expression as he belched. His meal was far from finished.\n\nFor the thirty surviving elves, this was living nightmare. Yet they no longer cried or begged. Witnessing their families and friends devoured had shattered their minds. Even fear had abandoned them.\n\n\"Hungry...\"\n\nAn elf stood motionless as Phou's massive hand caressed her body. He opened his mouth to swallow her whole—\n\nFour golden hands shot forward, hammers striking in rapid succession. They crashed into Phou's thick neck and biceps with devastating force.\n\nA furry blur moved next—stubby legs pumping as the cat transformed into a lightning bolt.\n\n\"Lightning Discharge~! Discharge, nyong!\"\n\n\"What do you think you're doing?\" Grid emerged, his cloak billowing behind him. His eyes promised death as they locked onto Phou.\n\n\"Kill!\" Grid's Enlightenment Sword carved through the air. The combination should've been decisive—Mjolnir's four successive strikes causing stiffness, Noe's lightning paralyzing, leaving Phou defenseless against his legendary technique.\n\n*Gulp!*\n\nBut Phou resisted both stiffness and electrical shock. Instead, he swallowed the elf—whose eyes had just begun to show hope—then struck Grid's Kill with his bare palm.\n\n**[The skill has been neutralized.]**\n\n\"What?\"\n\nPhou had deflected a legendary skill with his hand alone? Moreover, he'd shrugged off status effects that should've immobilized him? As shock crossed Grid's face, Phou's head snapped forward in a devastating headbutt.\n\n\"I don't know who you are, but I'm sorry.\" Dias shook his head, already anticipating the black-haired man's defeat against the three-meter titan. \n\nHe was wrong.\n\n\"...\"\n\nThe black-haired man stood unharmed. One of the golden hands had intercepted Phou's strike, now trembling and frozen. Beyond it, Grid's eyes burned.\n\n\"You pig-faced dog!\"\n\nDias scratched his head in confusion at the bizarre insult.\n\n\"Pagma's Swordsmanship!\"\n\n*Pagma?*\n\n\"Wave!\" Grid's blade traced a dark crimson arc. Energy erupted forward, slamming into Phou.\n\n**[You have dealt 28,310 damage to the target!]**\n\n**[Target's speed reduced by—]**\n\n**[The target has resisted.]**\n\n*Slow resistance?*\n\nPhou's health pool was staggering. Nearly thirty thousand damage barely moved his health gauge.\n\n*Defense is manageable, but his base speed is deceptive...*\n\nThrough the Slaughterer's Eye Patch, Grid analyzed his opponent—then his eyes widened. Phou's palm, three times larger than Grid's head, was already hurtling toward him. Only the God Hands' instant reaction prevented disaster. Despite his bulk, Phou moved with shocking speed. After consuming two elves, his previously docile eyes had turned feral—baffled and enraged by Grid's iron defense.\n\n\"These hands... Phou's attack... stop...\" Phou seized a God Hand, raised it to his mouth, and attempted to swallow it. His body rejected the attempt instinctively.\n\nDias led the elves to safety. \"If you wield Pagma's Swordsmanship, you must be the famous Overgeared King. But do you truly believe you can defeat Phou? That creature is the offspring of a giant and a troll king. Even transcendent humans can't harm him.\"\n\nThe abdominal wound Wave had inflicted was already closing. Phou's regeneration matched a true troll's. His face flushed crimson, and he roared.\n\n\"PHOU! MONSTER! NOOOOOOOOO!\"\n\nThe sound wave struck like a physical force. Dozens of elves, Randy, the Overgeared Skeletons arriving late, and even Dias staggered as Giant's Roar sapped the strength from their legs.\n\n\"Divinity. Item Combination.\" Grid remained unmoved.\n\n**[Belial's Staff and the Lightning Sword Born from Enlightenment and Strong Desires will be combined!]**\n\n*Flash!* The two weapons merged in blazing light, reforming into a spear-like armament.\n\nGrid swung. Black flames and crimson lightning—now classified as magic through the combination's properties—erupted forward. Magic damage increased by twenty percent. Critical damage amplified by one hundred fifty percent. More than sufficient to threaten Phou's massive health pool.\n\nPhou's health gauge plummeted noticeably as he writhed in agony. And Grid?\n\n**[A shield with 5,000 health has been created due to the effect of Belial's Shield.]**\n\n**[A shield with 5,000 health has been created due to the effect of Belial's Shield.]**\n\n**[A shield with 5,000 health has been created due to the effect of...]**\n\nMultiple overlapping black barriers began rotating around him—a stark contrast to the accumulating wounds covering Phou.\n\n\"Hurts! It huuuuurts!\" Madness consumed Phou's eyes. His fists hammered the shields encasing Grid in rapid succession. Each strike only worsened his situation.\n\n**[You have suffered 9,700 damage!]**\n\n**[The shield will absorb damage.]**\n\n**[You have suffered 10,300 damage!]**\n\n**[The shield will absorb damage.]**\n\n**[The target who attacked you is in the 'fear' state. 'Slowness' has been resisted.]**\n\nGrid's health remained untouched behind his barriers while Phou's momentum collapsed.\n\n\"H-Hik! Phou... Phou is afraid...!\"\n\nIndeed. Phou rivaled Piaro's strength during the Belial raid. He resisted numerous status conditions. But he wasn't a Legend—he lacked immunity to all debuffs. Phou was vulnerable to fear. Meanwhile, Grid had grown several times stronger since the Belial raid. Currently, he far surpassed even Piaro's power from that battle.\n\n\"Blacksmith's Rage. Blackening.\" Grid pivoted in a half-circle, drawing upon his maximum output. The invincible spear pierced Phou's distended stomach. \"Knight Summoning! Jishuka, Regas, Chris, Pon, and Jude!\"\n\nWhy summon reinforcements when victory was assured? To ensure a clean finish. No room for complacency remained. Grid struck Phou once more, then commanded his manifested knights.\n\n\"Kill that one! Save the elves!\"\n\nHis target was Dias. Faced with five formidable knights materializing simultaneously, Dias shrank back in terror.\n\nGrid had demonstrated his absolute superiority over Kir in every conceivable way."
}