{
  "id": 836,
  "title": "Chapter 836",
  "content": "\"Lauel briefed us on the situation before we logged in,\" announced a sun-kissed beauty wielding a bow. She nocked three arrows in one fluid motion, their shafts wreathed in flames that danced like her flowing hair. \"We'll handle the small fry.\"\n\nJishuka's smile radiated confidence as she unleashed a volley that would make any godly archer proud. Three flaming arrows streaked toward their target simultaneously, striking true—one between Dias' eyes, one at his brow, one through his heart.\n\nThe hybrid mage and his elven captives alike froze in shock.\n\n*A human archer... with this level of precision?*\n\nThe arrows hit like artillery shells, erupting on impact and tearing through Dias' defenses. He staggered backward—directly into Chris's waiting blade.\n\n\"You don't get to touch King Grid without going through us first!\" Chris roared, believing firmly in proper hierarchy. His greatsword hammered into the reeling mage, followed by devastating strikes from Regas and Pon. The coordinated assault left Dias dizzy and disoriented.\n\n\"Jude. Hit.\"\n\nThe final blow came from Grid's first knight, his greatsword arcing toward the battered enemy.\n\nIt cleaved only empty air.\n\n\"...What?\" \n\nThe party stood frozen in confusion. Where was the killing blow they'd all expected?\n\nChris recovered first, unleashing his ultimate technique. \"1,000 Ton Sword!\"\n\nThe devastating strike connected. Dias' body began dissolving into gray ash.\n\nYet something felt wrong. As the party moved to support Grid against Phou, they realized—no death notification. No experience. No loot.\n\n*What's going on?*\n\nEveryone except Jude showed bewilderment. The knight's expression remained impassive, unsurprised.\n\n\"I warned Master this would end badly.\" Dias' voice echoed from behind Jishuka, his body whole and unmarked. He shook his head with genuine regret. \"Told him not to provoke a sleeping lion. Tsk.\"\n\n\"Jishuka! Move!\" Chris shouted.\n\nToo late.\n\nDias' hand, wreathed in dark energy, punched through the archer's defenses. Flesh tore. Blood sprayed.\n\n[You have suffered 12,390 damage!]\n\n[You are afflicted with black magic. Pain receptors amplified to maximum.]\n\n[You have suffered an additional 5,700 damage!]\n\n[All resource regeneration severely reduced. Defense and resistance compromised. Skills and magic sealed for 3 seconds!]\n\n\"Kuh!\" Jishuka gasped, the agony stealing her breath.\n\n*Grid fought these monsters alone?*\n\nBefore Regas' retaliatory kick or Pon's spear thrust could land, Dias vanished again, their attacks whistling through empty space. He reappeared several paces distant, making an exaggerated show of wiping his brow.\n\n\"Well, this has gone rather poorly for us.\" He glanced toward where Grid methodically dismantled Phou. \"No path to victory here—not for me alone.\"\n\nThe Overgeared King and his knights exceeded their reputation. Facing them solo bordered on suicide. One-on-one? Perhaps manageable. But against this coordinated force, especially with that peculiar knight...\n\n\"Jude. Kill.\"\n\n*Why doesn't my illusion work on him? Is that vacant expression mocking me?*\n\nDias barely managed to deflect the incoming greatsword, the sheer weight forcing him to abandon his position. Jude pivoted relentlessly, cutting off every escape route.\n\n\"Kuock!\"\n\nThe knight's raw power shattered Dias' carefully maintained illusions, dispelling them one by one.\n\n\"Found him!\"\n\nThe others' attention, previously scattered across false targets, locked onto Dias' true position simultaneously.\n\n\"I've never had my illusions broken this quickly.\" Frustration bled into Dias' voice. Throughout his campaigns in the Violet Kingdom, facing countless elite players, he'd never encountered such a crisis. This simple-looking knight possessed transcendent perception. \"I see why you're the Overgeared King's first knight.\"\n\n\"Jude. His Majesty's. First knight!\" The greatsword never stopped moving, driving Dias into an ever-tightening corner. \n\nSince becoming Grid's knight, Jude had transformed—breaking through his limits against Maxong, growing stronger during the Belial raid, and now achieving his third breakthrough.\n\nDias attempted counterattacks, his magic deflecting strikes while targeting Jude's vulnerable points. But Jishuka's covering fire rendered his efforts meaningless. Her arrows found flesh while healing magic closed Jude's wounds.\n\nChris, Pon, and Regas coordinated seamlessly with their fellow knight, applying crushing pressure from all angles.\n\nFinally, Dias collapsed to his knees, blood trickling from his mouth. \"The equipment you wear... crafted by the Overgeared King himself, yes?\" He coughed wetly. \"Precious memories woven into solid form—stories that will become history, legends...\"\n\n\"...?\"\n\nWhat was he trying to say? The party listened intently, recognizing the pattern of quest-granting NPCs—all except Jude, who struggled against Regas and Pon's restraining hands.\n\nBut no quest notification appeared. Instead, Dias simply made a request: \"Please... don't hate Master too much. He wasn't always wicked.\"\n\nPlayers, NPCs, monsters—everyone carried their own story. In his final moments, Dias' only wish was mercy for the one who'd never fully returned his loyalty. Yet the grace Kir had shown on that first day had been real.\n\n\"I still feel some anger toward Master, but...\" Dias extended his neck toward the still-struggling Jude, offering it to the strongest knight who'd defeated him. \n\n\"W-Wait a moment—\" Jishuka began, reluctant to end this.\n\nToo late.\n\n\"Waste. Time. No. His Majesty. Help. I will.\" Jude shrugged off his companions and executed Dias without hesitation.\n\nGray light erupted skyward.\n\nThe moment Dias' illusions fully dissipated, Phou descended into madness. Starvation—true, crushing hunger—overwhelmed the beast's mind. He attacked Grid with frenzied desperation.\n\n\"Jude! Help!\" The knight, thinking only of his king, charged forward. His third limit-break granted him explosive speed, but—\n\n\"Linked Kill Wave Pinnacle!\"\n\n\"KUWAAAAH!\" \n\nBerserk and focused solely on offense, Phou ignored the damage accumulating from Grid's shield and Valhalla's poisonous fog. He made no attempt to defend or evade.\n\nThe battle ended there. Unable to withstand Linked Kill Wave Pinnacle activating twice through God's Command, Phou dissolved into gray ash.\n\nJude arrived at Grid's side just as the final particle faded.\n\n\"Your Majesty. Cool!\"\n\n***\n\nKir's stamina gauge flashed red. Days without proper rest, constant flight through hostile territory—it had taken its toll.\n\nPero nuzzled his master's haggard face, the unicorn's luminous eyes brimming with affection and concern. Emotions wasted on Kir, who saw only graphics and programmed responses.\n\n\"Tch.\" He wiped away the saliva like grime, then spotted Faker's silent vigil nearby. Genuine curiosity stirred beneath his exhaustion.\n\n\"Why this obsession?\" Kir's voice carried bitter resignation. \"What does killing me achieve? What does the Overgeared Kingdom gain from my lost items and experience?\"\n\nHe already knew the answer, of course. Satisfy mirrored reality—a competitive hierarchy where threats required elimination. Today Kir was manageable. But given time to grow? He could rival Grid himself. Better to crush that possibility now.\n\n\"Shit... dammit.\" Understanding didn't make it easier to accept. Trapped in Grid's web, Kir faced inevitable devastation. Still...\n\n\"If you think this ends here, you're mistaken.\"\n\nThe unicorn's blessing slowly replenished his stamina. Kir forced himself upright, pressing a vial of black liquid to Beniyaru's lips.\n\n\"Yatan Essence. This concentration would kill even a named NPC instantly. Understand? I won't die alone.\" The elf had called out to Grid, begged for his help—clearly she mattered to him. Her death would wound Grid far more than simple item loss. \"I'm not going down without taking something precious with me. Fair, wouldn't you say?\"\n\n\"Nothing's fair about this.\"\n\nKir froze.\n\n\"...!\"\n\nA God Hand materialized from nowhere, hammer swinging in a brutal arc.\n\n\"Urgh!\" The stunning blow locked Kir's muscles. Grid materialized beside him, scooping Beniyaru from his paralyzed grip.\n\n\"You!\" Kir's hatred burned genuine and raw. \"How much more will you take from me?!\"\n\n\"How much more will *you* take from the elves?\" Grid countered.\n\nKir's mouth opened and closed soundlessly. The question struck too close—he finally understood what it meant to be the victim.\n\nGrid turned his attention to Beniyaru. She'd retreated somewhere deep inside herself, cutting off all emotion and thought. A beautiful doll with empty eyes.\n\n\"What did the elves ever do to deserve this suffering?\"\n\n\"...\" Kir had no answer.\n\nGrid raised his blade toward Kir's exposed throat—\n\n\"Master, wait.\" Huroi appeared at his shoulder, whispering urgently. \"The horse. It's a unicorn.\"\n\n\"Unicorn? You're certain?\"\n\n\"Take it.\"\n\n\"How? Pets aren't like items—ownership is guaranteed even through death.\"\n\n\"There's a way. Ownership can be transferred voluntarily.\"\n\nGrid frowned. \"Why would he—\" Understanding dawned. \"Ah.\"\n\nAll eyes tracked their whispered conversation, unable to make out the words. The sudden shift in Grid's demeanor shocked them all.\n\n\"Kir. Do you want to live?\"\n\n\"What?\" Confusion replaced fear in Kir's expression. \"You'd spare me?\"\n\nGrid nodded slowly. \"You've invested heavily in this elf operation, haven't you? Death here means ranking loss, damaged business relationships, compromised future dealings...\"\n\nThe logic was sound—Kir couldn't deny it. His merchant's instinct immediately searched for the catch. \"What's your price for mercy?\"\n\nGrid pointed at the unicorn. \"That.\"\n\n\"You insane bastard!\" Kir's outrage erupted naturally. A unicorn's value transcended monetary calculation! No other player in the entire game possessed one. He'd rather die a thousand times than surrender something so precious—\n\n\"Think carefully before answering.\" Grid's voice dropped to something cold and final. \"Make the wrong choice, and I become an enemy you'll never escape.\"\n\nKir's blood turned to ice. He'd watched Immortal's recent struggles—even with imperial protection, they couldn't withstand Overgeared's focused assault. How could a lone merchant survive what an entire guild couldn't? He'd become a target for two billion players worldwide.\n\nThe nightmare scenario crystallized with terrifying clarity.\n\nGrid pressed his advantage. \"Give me the unicorn. In exchange, I spare your life *and* place no death bounty on your head.\"\n\n\"You'll truly let me go? No kill orders?\"\n\n\"Correct. However...\" Grid's smile held no warmth. \"Next time we meet, you die. Simple as that. I despise you. Never cross my path again.\"\n\n\"Ugh..!\"\n\nMoney, strength, authority—Grid wielded the trinity of power. The forces he could marshal, the resources he commanded, the influence he possessed... all infinite. Terrifying.\n\nIn the end, pragmatism won.\n\n[Ownership of the unicorn 'Pero' has been transferred to 'Grid.']\n\n\"...May I go now?\" Kir's voice emerged hollow, defeated.\n\nGrid gestured dismissively. \"Leave.\"\n\nTime, money, pride, his irreplaceable unicorn—all sacrificed. Yet motivation burned in Kir's eyes as he stumbled away.\n\n*One day... I'll repay this humiliation a thousand fold.*\n\nNot this year, perhaps not the next. But in four or five years? He'd rebuild under the empire's aegis as planned. Forge an alliance around Gauss Kingdom. Crush Grid through sheer accumulated power and influence.\n\nHis faith in this future lasted exactly twenty minutes.\n\n\"Forgot my warning already? I specifically told you never to meet me again.\"\n\n\"What?!\" Kir's head snapped up. Grid blocked the forest path ahead, seated comfortably atop a gleaming white unicorn.\n\n\"No... this can't—\"\n\n\"I said I'd kill you next time we met.\" Grid's tone carried patient explanation, as if addressing a slow child. \"I warned you to be careful.\"\n\n\"You son of a bitch!\"\n\nVillain. Scoundrel. Gangster—Kir finally understood Grid's true nature. Panic overwhelmed calculation.\n\n\"Knights Summoning!\"\n\nForget the elves—he had to eliminate Grid *now*, today, whatever the cost! He activated his skill to summon his three contracted knights...\n\n\"What?\" The color drained from Kir's face.\n\n[No knights are available to be summoned.]\n\n\"Don't tell me...\"\n\n\"The unicorn is excellent, by the way.\" Grid's casual tone delivered the final blow.\n\nKir, who had transformed the World Tree's sacred forest into a slaughterhouse, dissolved into gray light. \n\nThis marked the beginning of the Merchant King's fall. Everything Kir thought he'd lost today? Merely the opening act. His true treasures—the mercantile connections cultivated across the entire continent—those losses would come later.\n\n[The unicorn is deeply sad.]\n\n[Affinity with the unicorn is critically low.]\n\n[It is recommended you give the unicorn a new name.]\n\n[Affinity with the elves has increased by 50.]\n\n[The World Tree has taken notice of you.]\n\n[The World Tree extends an invitation.]"
}