{
  "id": 838,
  "title": "Chapter 838",
  "content": "Foam dripped from the kapen skunks' jaws as they charged through the foothills—frothing, rabid beasts that struck at something primal in the human psyche.\n\n\"Archers, take the high ground!\" Royman bellowed, her voice cutting through the chaos. \"Spears and shields—with me!\"\n\n\"Move, move, move!\"\n\nEvery spring, these level 277 nightmares descended on Reinhardt's outskirts. Their strength and overwhelming stench had once spelled hell for the Eternal Kingdom's forces. So many died that the saying went: *there is no stone in the spring of Eternal*—too many tombstones to count.\n\nBut Reinhardt belonged to the Overgeared Kingdom now. And Overgeared's soldiers didn't flinch. Months of farming alongside Piaro had forged them into something harder than the knights who came before.\n\nRoyman moved like water. As the skunks bounded across rocks and trees, she slammed her triangular shield into the earth, its sharpened base biting deep. The moment the creatures closed in, the ground gave way—collapsing as if someone had carved it out with hoes.\n\nThe beasts sensed danger too late. Mid-leap, they froze—then scrambled as the hillside slid out from under them. Arrows blackened the sky. While Royman and her squad held the line, the archers rained death from above.\n\nJaffa-tipped shafts found their marks. One by one, the skunks dissolved into grey light. Pillars of radiance descended on Royman's troops again and again—the telltale glow of leveling up.\n\n***\n\n\"Signal from Sua's squad! Buren Valley is clear!\"\n\n\"Bland reports Fortina Field secured!\"\n\n\"Royman's in!\"\n\n\"Excellent. Southern sector complete.\" \n\nAt the outer barracks, Lauel couldn't suppress his grin as he orchestrated the operation from his map table. He remembered their first spring as the Overgeared Kingdom—the nightmare of it. Villages razed. Countless dead or displaced. The skunks bred too fast, and Overgeared simply hadn't been strong enough. Without Pon and Regas pulling miracles, the damage would've been catastrophic.\n\nNow? They'd cleared the infestation in two days.\n\nThe difference was night and day. Grid's recruits from the East Continent. Piaro's trainees. Asmophel's disciplined army. This year, they were stronger than they'd ever been—hundreds of times over.\n\n*Worth every sleepless night,* Lauel thought, unconsciously rubbing his thinning hairline. *Worth every gray hair.*\n\nBut satisfaction was a luxury he couldn't afford. The Saharan Empire loomed. Valhalla grew bolder by the day. And now—\n\n*Agnus.*\n\nThe world message from minutes ago still echoed in his mind. A new legend born. One of their most dangerous enemies had just transcended.\n\nLauel's jaw tightened. The weight of it pressed down on him—the responsibility to keep Overgeared growing, evolving, staying ahead.\n\n*How did he manage it so fast?*\n\nAgnus' playstyle made no sense. The man died more than any other high ranker—reckless, self-destructive. Death in Satisfy meant setbacks, experience loss. Lauel had assumed it would take years for Agnus to reach legend.\n\nBut he'd been wrong.\n\n*God, I've been an idiot.* A chill ran through him. *All those deaths... he wasn't being reckless. He was grinding through unknown content. High risk. High reward. Pure calculation.*\n\nThat's how Agnus stayed 7th in the rankings despite dying constantly. He had standards. Acceptable losses. A methodology.\n\n*He's not mad. He's terrifyingly rational.*\n\nLauel's throat went dry—\n\n—*Lauel.*\n\nGrid's whisper cut through the spiral of anxiety like a lifeline.\n\n—*Send someone to bus Ruby and Sexy Schoolgirl. We need them ready to fight Agnus. Triple our offerings to the Rebecca Church—I don't care if we run a deficit. I'll cover it myself. We'll need priests against an undead army.* A pause. *Also... those NPCs who finished training at the academy. Can we deploy them?*\n\n—*Understood.*\n\nThe knot in Lauel's chest loosened. So what if Agnus was stronger than expected? Grid was stronger too. Sharper. Always three steps ahead.\n\nThey'd be ready.\n\n***\n\nThe World Tree pierced the heavens—a colossus of bark and branch. A few hundred meters away, an elf village nestled among the boughs, houses woven from living wood.\n\n\"Wait. What?\"\n\n\"You're serious?\"\n\nJishuka, Faker, Huroi, Pon, Regas, and Chris stood in a loose circle around Grid, confusion written across their faces. He'd just ordered them to abandon their administrative duties. Focus entirely on personal growth.\n\n\"Grid, that's not realistic.\" Chris crossed his arms. \"Jishuka and I run Bairan and Reidan. Without us, those cities grind to a halt.\"\n\n\"Exactly,\" Jishuka added. \"The kingdom would descend into chaos.\"\n\nBeing a lord was every player's dream—wealth, power, influence flowing from taxes and territory. But with status came responsibility. Jishuka and Chris spent a quarter of their fourteen-hour play sessions managing their cities. The same went for every other lord. If key members like them stepped away, the entire Overgeared Kingdom would collapse.\n\nYet Grid didn't budge.\n\n\"You've sacrificed years of personal time to build this kingdom. Now it's time to prove that development paid off.\"\n\n\"What do you mean?\"\n\n\"I've secured NPCs to take over your roles.\"\n\nStunned silence.\n\nSince the kingdom's founding, Lauel had been drowning in work with only Administrator Rabbit to help. Finding NPCs with administrative talent was like plucking stars from the sky.\n\n\"Rabbit identified prospects. Sticks trained them at the academy—same way Piaro and Asmophel trained soldiers.\"\n\n\"And they're ready?\"\n\n\"We're not lacking talent anymore. Most of your current workload will transfer to them. You've earned this. Consider it a promotion—from administrator to warrior.\"\n\nGrid's expression hardened. \"Agnus just became a legend. Before that, he was already aggressive enough to hit both us and Valhalla. Now? Who knows how high his ceiling is. We need to prepare.\"\n\nHe swept his gaze across them. \"All of you—focus on growth. You should be working toward your fourth advancement, shouldn't you?\"\n\nA memory surfaced. Years ago, Lim Cheolho had announced at a press conference that normal classes would eventually rival hidden classes through advancement. At the time, Grid had felt threatened as a legendary class holder.\n\nNow he understood.\n\n*Just because everyone's strong doesn't mean I'm weak.*\n\nBecause now—\n\n*I have the best allies in the world.*\n\nNo matter his personal power, there were areas where others in Overgeared excelled beyond him. He trusted them. Wanted to rely on their strength.\n\n*And I'll keep growing too.*\n\nBy the time normal classes caught up to legendary ones—\n\n*I'll be myth-rated.*\n\nNot arrogance. Reality. He'd absorbed great demon powers. Crafted multiple myth-rated items. The path was there.\n\nGrid turned to Deruyaru, the young elf. \"Speaking of colleagues—can they hunt ancient species while staying in the forest?\"\n\nThe 12 Te's eyes went wide.\n\n\"Do you understand how powerful ancient species are?\"\n\n\"If your companions aren't as strong as you, they'll be dismembered.\"\n\n\"Exactly. We appreciate the thought, but don't burden your friends. Please reconsider.\"\n\nThe elves' concern was genuine—born from their newfound affection for Grid.\n\nBut Deruyaru spoke up. \"Grid's companions don't need our worry. They're strong. I saw it myself.\"\n\nThe other elves faltered. *Weren't humans supposed to be weak?*\n\nGrid shrugged. \"I have dozens more just like them. I'll bring everyone to the forest. We'll clear out the ancient species.\"\n\n\"I... I see...\" Too outlandish to be a lie. The 12 Te nodded, bewildered.\n\nThen—warmth flooded the air. A voice resonated through the grove, ancient and vast.\n\n—*Children of the forest. The human beloved by the goddess of light. Grant him and his companions the blessing of the elementals.*\n\nThe World Tree itself had spoken.\n\n> **[The World Tree has bestowed an immense blessing!]**\n\n> **[Player Grid and all members of Grid-led forces may now contract with elementals. Limited to lower elementals. Attribute assignment is random and cannot be selected.]**\n\n> **[This benefit applies only to current members. New additions will not receive it.]**\n\nGrid's soul nearly left his body when he heard the trembling voices around him.\n\n\"...I love you, Grid.\"\n\n\"Me too.\"\n\n\"Same.\"\n\n\"...\""
}