{
  "id": 839,
  "title": "Chapter 839",
  "content": "[Thanks to the player 'Grid', you have received the blessing of the World Tree. You can now contract with lower elementals.]\n\n[You must meet the World Tree to form a contract with the elementals.]\n\nThe notification appeared without warning, and the Overgeared members erupted in celebration. It was like receiving a windfall—unexpected and entirely unearned.\n\n\"God Grid strikes again!\"\n\n\"Every time he leaves Reinhardt, we hit the jackpot!\"\n\n\"Grid is the best!\"\n\nElemental contracts represented uncharted territory for most players, which only heightened their excitement. The guild members immediately began preparing for departure, organizing themselves according to Lauel's instructions. Their destination: the World Tree's Forest.\n\n***\n\n-Lauel: *Only guild members receive this benefit—not citizens of the Overgeared Kingdom.*\n\n-Grid: *Good. That's how it should be.*\n\n-Lauel: *Agreed. We can't give unconditional rewards to people who might defect to other kingdoms at any time. By the way, have you contracted with an elemental yet?*\n\n-Grid: *About to now.*\n\nGrid closed the whisper window and stood before the World Tree. The colossal plant stretched skyward, its canopy so distant he couldn't see where it ended. Craning his neck to gauge its size made his muscles ache. The Overgeared members, Mercedes, even the normally stoic Jude—all of them stared in silent awe. Before the infinite mysteries of nature, humanity's proud dominion over the world seemed infinitely small.\n\n\"I greet the mother of the forest.\" Grid bowed respectfully. This wasn't a calculated gesture—he was genuinely honored. Like the others, he felt overwhelmed by the World Tree's majesty.\n\nThe voice that answered was warm and melodious, like wind through spring leaves. \n\n>[You who have received the Goddess of Light's favor through strength of will... I am grateful for your aid to my children. The protection of the elementals shall forever be with you...]\n\n*Elementals!* Grid's pulse quickened.\n\nHe'd witnessed Beniyaru's elementals neutralize attacks from both Mercedes and himself—a burning giant and a beautiful woman, manifestations of raw power. The memory amplified his anticipation.\n\n*Even if they're only lower elementals, that's still incredible.*\n\nHis heart hammered against his ribs as he knelt before the World Tree, following the procedure the elves had described. Light blazed brighter than the sun, yet caused no discomfort. Instead, warmth enveloped him like a embrace.\n\n\"Ah...\" The sound escaped unbidden. His mind and body relaxed into the emerald radiance, and infinite contentment washed over him. It felt like sinking into clean sheets on the eve of a long holiday weekend. He wished this moment could last forever.\n\nBut he forced himself to focus. Opening his eyes, Grid called out:\n\n\"I, Grid, wish to contract with an elemental!\"\n\nThe light surrounding him intensified in response.\n\n>[The lower elementals are examining you.]\n\n>[The lower fire elementals sense a flame hotter than their own and flee in terror!]\n\n>[The lower water elementals attempting to approach evaporate instantly!]\n\n>[The lower earth elementals detect the metal you carry and burrow deep into the ground!]\n\n>[The lower wind elementals realize they cannot wrap around you and drift away!]\n\n\"What?\"\n\nGrid's excitement shattered. Notification windows scrolled past, each one contradicting his expectations. The fire elementals' rejection stung worst of all.\n\n*I thought they'd help me understand the Duke of Fire.*\n\nBraham had explained that Pagma's ascension to greatness began when he'd been surrounded by flames while forging. Fire and blacksmithing were natural partners. Grid had assumed a fire elemental was guaranteed—yet they'd fled from him. And not just fire elementals. *All* of them had refused.\n\n\"What's happening?\"\n\nThe tranquility from the World Tree's light evaporated, replaced by rising panic. Had he somehow failed? Then new text appeared.\n\n>[The World Tree admires your vast vessel, which cannot be satisfied with mere lower elementals. The World Tree summons the hidden elementals!]\n\n>[The lower light and darkness elementals have appeared!]\n\n\"Ah!\"\n\nTwin orbs descended from above—one from the sun, one from the shrouded moon. Gasps rippled through the assembled elves watching the ceremony. Light and darkness elementals were symbols of royalty, beyond even the reach of the 12 Te.\n\nTheir savior or not, Grid was still human. For a human to be chosen by light or darkness? The elves couldn't comprehend it. Meanwhile, the Overgeared members, Mercedes, and Jude remained calm in their ignorance, watching the ceremony unfold with quiet curiosity.\n\nGrid, however, was suffering.\n\n>[The lower light elemental is consumed by the darkness hidden within you!]\n\n>[The lower dark elemental is lost in the radiance of Goddess Rebecca's blessing upon you!]\n\n>[The World Tree is embarrassed!]\n\n\"Seriously?\"\n\nWasn't this excessive? Grid's anxiety spiked as both elementals vanished. Being rejected by *every* elemental left him hollow. Then the World Tree's voice filled his ears once more.\n\n>[The Goddess of Light's affection for you runs deeper than imagined. Yet you also harbor great darkness within your heart.]\n\n\"Is that it, then?\" Grid asked bluntly.\n\nThe World Tree took extraordinary measures.\n\n>[I witnessed your struggle to protect my children from beginning to end. I cannot ignore such grace. I shall grant you a greater blessing.]\n\n>[The intermediate elementals are examining you.]\n\n>[The intermediate fire elementals sense a flame hotter than their own and flee in terror!]\n\n>[The intermediate water elementals attempting to approach evaporate instantly!]\n\n>[The intermediate earth elementals detect the metal you carry and burrow deep into the ground!]\n\n>[The intermediate wind elementals realize they cannot wrap around you and drift away!]\n\n>[The intermediate light elemental...]\n\n>[The intermediate dark elemental...]\n\n\"...\"\n\nHistory repeated itself. Like the lower elementals before them, the intermediate elementals couldn't withstand Grid's presence.\n\n*This is ridiculous.*\n\nWas he really going to walk away empty-handed? Grid cursed internally—\n\n>[The advanced elementals are examining you.]\n\nThe World Tree hadn't given up. Advanced elementals materialized around Grid, their forms similar to those Beniyaru commanded.\n\n\"Incredible...\"\n\nBut the 12 Te erupted in protest.\n\n\"Mother! We understand your sentiment, but this is dangerous!\"\n\n\"We don't doubt Grid's character, but we worry about the weakness inherent to mortal minds. Excessive power corrupts humans. Mother, remember the Seven Malignant Saints who gained divine power and fell into darkness. Grid could become the next malignant evil.\"\n\n\"Exactly! The emergence of a malignant evil in this era, with no Hero King to oppose them, would spell the world's destruction! Please reconsider, Mother!\"\n\nThe Seven Malignant Saints. Grid's strongest passive skill, **God's Command**, originated from those legendary figures. Hearing the elves speak of them startled him into muttering: \"I *am* the Hero King...\"\n\n\"What?\"\n\n\"What?!\"\n\nThe 12 Te reeled in shock.\n\n>[Indeed. You are beloved by the Goddess of Light and bear the title of Hero King. I trust you completely.]\n\nThe World Tree's determination was absolute. The advanced elementals approached Grid, pausing repeatedly as they tested his aura. Unlike the lower and intermediate elementals, these beings spoke in human language.\n\n\"This human already commands fire expertly. My flames would offer little benefit.\"\n\n\"Too hot... too dry... when water meets him, only steam remains.\"\n\n\"Um... the power... of earth... not needed... I think... um...\"\n\n\"His name is Grid? He already wields a storm's might. My wind would be redundant. Perhaps... only the Elemental Kings could serve him.\"\n\nOne by one, the advanced elementals withdrew. Finally, the advanced light and darkness elementals appeared. The light elemental resembled a soccer ball—a white sphere with cheerful yellow half-moon eyes.\n\n\"I like him. This person's light reminds me of Mother's radiance. The darkness within is frightening, but I can overcome it. I choose him.\"\n\nThe darkness elemental—a black sphere with crimson eyes—was less enthusiastic.\n\n\"I refuse. This child carries more light than darkness. I will not contract with him.\"\n\nThe decision was made. Elemental contracts required the elemental's consent, and Grid had no say in the matter.\n\n>[Light elemental, be with him forever.]\n\n\"Okay!\" The light elemental bobbed eagerly in agreement.\n\n>[You have successfully contracted with the light elemental!]\n\n>[Title acquired: 'Light Elemental (Advanced) Contractor']\n\n>[**Light Elemental (Advanced) Contractor**]\n\n>You can utilize an advanced light elemental.\n\n>Current Elemental Level: 1\n\n>**—Available Elemental Techniques—**\n\n>*The energy of advanced elementals is infinite. Advanced elementals do not consume the contractor's resources.*\n\n>**[Sword of Light]**\n\n>Transforms the elemental into a sword of light.\n\n>The elemental will maintain visibility in darkness and autonomously attack enemies with darkness affinity.\n\n>The Sword of Light's attack power scales with the contractor's physical and magical attack power.\n\n>*This skill can remain active indefinitely. However, other techniques cannot be used while in Sword of Light form.*\n\n>**[Flash]**\n\n>The light elemental instantaneously moves to a target designated by the contractor.\n\n>If the target is an enemy: The elemental blinds them for 0.3 seconds. This effect cannot be resisted.\n\n>If the target is an ally: The elemental grants them one instance of dark attack resistance.\n\n>Cooldown: 5 minutes.\n\n\"...This is amazing.\"\n\nAn unresistable crowd control effect combined with autonomous attack capabilities. Though limited to darkness-attribute targets, the potential exceeded even a Sword Saint's reaction speed. And this was merely a level 1 elemental. Grid couldn't imagine its power at higher levels.\n\nPerhaps the 12 Te's concerns about creating another Malignant Saint weren't entirely unfounded.\n\nThe Sword of Light materialized beside Grid, hovering in the air. Jishuka's eyes transformed into hearts.\n\n\"It's like you're ready for a photoshoot with that lighting...\"\n\nThe light's intensity was almost absurd—a walking spotlight. Grid had acquired yet another system to add to his growing arsenal of advantages."
}