{
  "id": 84,
  "title": "Chapter 84",
  "content": "# Chapter 84\n\nTwo weeks had passed since the war between the Alliance and the Yatan Church began. The Giant Guild had racked up achievement after achievement during that time. Today, they celebrated.\n\n\"Congratulations on the master's inauguration as lord!\" Someone hoisted a mug. \"Cheers!\"\n\n\"Cheers!\"\n\nThe Giant Guild was one of the best guilds in Satisfy, boasting 530 members under the command of Chris, who ranked third on the unified rankings. Chris himself had just been appointed Lord of Pedro for his battlefield exploits. He stood now before his assembled guild, surveying the mass of faces.\n\n\"Now is the time for consolidation.\" His voice carried across the hall. \"For the next two weeks, we cease offensive operations. We focus on Pedro's defense and strengthening our core.\" He paused, letting the announcement settle. \"And.\"\n\nChris pulled leather armor from his inventory and examined it once more.\n\n> **[<span class=\"rarity-epic\">Unexpectedly Comfortable Rat Leather Armor</span>]**\n>\n> Rating: Epic  \n> Durability: 24/24  \n> Defense: 22  \n> Movement Speed: +3%  \n>\n> *An armor made of rat leather by a craftsman with great skills and potential, but who lacks experience and reputation.*\n>\n> *It is designed so the wearer won't be inconvenienced when moving. The wearer can move a little faster.*\n>\n> *The fact that this type of armor was made with such meager materials is amazing.*\n>\n> User Restriction: Level 13 or higher. Beginner Leather Armor Mastery.\n\nThe unknown craftsman. The same one who'd created those epic arrows that set the forums ablaze weeks ago. Chris had searched, scraped through rumors and dead ends, found nothing. Then, buried in a community post three days ago, a clue. Winston.\n\n*Please let it not be too late.* \n\nChris held up the armor. \"I'm detailing half the guild to form search teams. Destination: Winston. The goal is the unknown craftsman. Find him. Invite him to the guild.\" He met their eyes. \"Whatever conditions he presents, you accept them unconditionally.\"\n\nHigh-level combat classes would make the Giant Guild stronger in the short term. But skillful production classes would make them complete, make them permanent. Chris had already failed to recruit Panmir and Steng, the first and second ranked blacksmiths. He'd settled for fourth and fifth. It wasn't enough.\n\nHe wanted the unknown craftsman. With him, Chris would establish the Giant Guild's supremacy beyond question.\n\n***\n\n\"We don't have enough people.\"\n\nThe Tzedakah Guild was stretched thin, chasing three objectives at once. Finding Euphemina. Completing Yatan Church quests to boost guild reputation. And still searching for that damned unknown craftsman.\n\nJishuka rubbed her temples. The guild only had seventeen members. All rankers, yes. But seventeen rankers could not be in four places at once.\n\nThe meeting had been inevitable.\n\n\"We postpone hunting Euphemina.\" One of the members leaned forward. \"Revenge is satisfying, but it doesn't pay dividends. The Yatan quests and the craftsman, those benefit the guild directly. We shelf the grudge and focus on what matters.\"\n\n\"Agreed.\" Another nodded. \"That girl hides like a rat anyway. Waste of time.\"\n\nJishuka tallied the votes. \"Seven for. Seven against. Three abstentions.\"\n\n\"We should keep going as planned.\" A dissenting voice. \"If we quit halfway, people talk. Drop the Yatan quests instead. We're skilled enough to build reputation without grinding Church errands.\"\n\n\"Exactly. Revenge is about pride. Our pride. Has everyone forgotten what the Tzedakah Guild stands for?\"\n\n\"Seven for. Five against. Five abstentions.\"\n\nRegas had been silent until now. He spoke up. \"What about the unknown craftsman?\"\n\nJishuka glanced at him. \"You think we should postpone that too?\"\n\n\"No.\" Regas shook his head. \"Honestly, shouldn't that be the highest priority?\"\n\n\"I agree.\" Jishuka's voice cut through the murmurs. \"We drop the Yatan quests. Full focus on finding Euphemina and the unknown craftsman.\"\n\n\"Understood!\"\n\nThe guild members scattered after that.\n\nWinston. They were based here because the evidence pointed to the unknown craftsman being here as well.\n\nRegas stretched as he left the meeting room. \"That was dull. Huh?\"\n\nAn Asian guy blocked his path. Regas's face split into a grin.\n\n\"Hey! Gladiator of the body!\"\n\nGrid had been walking with his head down, lost in thought. He looked up with irritation when someone stepped into his way and shouted at him. Recognition dawned.\n\n\"Regas?\"\n\n\"Ha! You remember me? I thought you wouldn't.\"\n\nGrid moved to the fountain and sat on the edge. \"You defended me when everyone else was piling on. How could I forget?\"\n\nSeveral months ago, when Grid had been languishing at level negative-three, he'd tried to join the Guardian of the Forest raid party. The other applicants had torn into him. All except one. Regas had believed in him, supported him.\n\nGrid didn't feel grateful. He felt wary. That pure, naive nature rubbed him the wrong way. And Regas was handsome, which was its own kind of offense. After their brief conversation back then, Grid had concluded Regas was the type of idiot who'd co-sign a loan for a stranger. He'd extricated himself from the interaction as quickly as possible.\n\nNow they'd met again.\n\n*Time to cash in.*\n\nRegas frowned. \"Why do you look so miserable? Did something happen?\"\n\nGrid arranged his features into maximum suffering. \"An old man stole my item.\"\n\nRegas recoiled. \"Such wickedness! There are people like that in this world?\"\n\n\"Seems like it.\" Grid's voice cracked just slightly. \"People who take another's livelihood... they should die.\"\n\nRegas's jaw tightened. \"People like that should pay.\"\n\nGrid prepared his hook. \"If only someone would help me. But, well, there's no chance of that. In this harsh world, no one helps others for free. Right?\"\n\nRegas shot to his feet. \"Harsh? What are you saying? This world is warm and beautiful!\"\n\n\"Is it?\" Grid let his shoulders slump. \"The world I've experienced is harsh and poisonous. Having my item stolen...\"\n\n\"What was the item? Is it really that important?\"\n\n\"Yes. Really important. It was my life.\" Grid's voice dropped to a whisper. \"But I lost it. I think I'll just... quit. Delete my character.\"\n\nRegas paled. \"Character deletion? You can't! Think of your family! Filial duty! Have you forgotten the spirit of Taekwondo?\"\n\n\"Sorry. I'm just so tired. Mentally, physically. I had a bad thought.\"\n\nRegas grabbed Grid's shoulder. \"This can't stand! I'll help you! I can't forgive anyone who'd injure another person like this!\"\n\n*Yes. Got him.*\n\nThe moment Grid was about to seal the deal...\n\n**Smack.**\n\nJishuka hit Regas on the back of the head. She grabbed his earlobe and twisted.\n\n\"You're going to help someone? Have you forgotten everything on your plate?\"\n\nGrid stared at her. Tanned skin. Red lips, full and curved. Long, catlike eyes. And a chest that defied physics. She was his ideal type made flesh.\n\n*This woman.*\n\nRegas yelped as his earlobe stretched. \"She's my guild master! Ow! It hurts!\"\n\n\"Does it hurt, you pathetic bastard?\"\n\n\"Aagh!\"\n\nJishuka twisted harder, then turned her attention to Grid. She sighed when she noticed his eyes roaming her body. She was used to the stares, but they still grated. Virtual reality or not, men were the same.\n\n\"Hey, you.\"\n\n\"Yes!\" Grid straightened like a soldier.\n\nJishuka looked him up and down, then wrinkled her nose. \"Newbie. Regas is busy right now. You'll have to handle your own problems.\" She yanked Regas forward by his ear. \"We're leaving.\"\n\n*Newbie. Newbie. Newbie.*\n\nThe word echoed in Grid's skull as he watched her walk away.\n\n\"She looked at me like I'm trash.\"\n\nAn ideal type was still just fantasy. Grid shook himself and jogged after her.\n\n\"Hey.\"\n\nJishuka turned, surprised. The nervous wreck who couldn't meet her eyes a minute ago was now blocking her path. The surprise lasted half a second. She smiled, crossing her arms in a way that emphasized her chest.\n\n\"Why are you calling me?\"\n\n\"Kuh!\" Grid's gaze locked onto her chest. He dragged it back up with effort. \"Can you give me Regas? He said he'd help me. What right do you have to interfere?\"\n\n\"Natural right. I'm his guild master. He follows my commands. Understand? Don't be offended. Just leave.\"\n\n\"Being his guild master doesn't give you that right.\"\n\n\"Oh? Does a random third party have more right than me?\"\n\nJishuka had the upper hand and they both knew it. Grid pivoted.\n\nHe bowed his head. \"Please. I'm desperate.\"\n\n\"We're desperate too. We can't spare anyone.\"\n\n\"I'm more desperate!\"\n\n\"We're more desperate!\"\n\n\"I'm more desperate!\"\n\n\"We are!\"\n\n\"Me!\"\n\nA crowd began to gather as the adult man and woman descended into a childish shouting match. Whispers spread through the onlookers. Jishuka was famous, after all.\n\n***"
}