{
  "id": 840,
  "title": "Chapter 840",
  "content": "[The lower wind elemental whispers that it will make your arrows faster.]\n\n[The lower wind elemental whispers that it will make your spear lighter.]\n\n[The lower wind elemental whispers that it will make your mouth lighter.]\n\n\"Why my mouth?\"\n\n\"...??\"\n\nJishuka, Pon, and Huroi successfully contracted with wind elementals.\n\n[The lower earth elemental promises to make your body more solid.]\n\nRegas managed to contract with an earth elemental.\n\nThough they felt a twinge of disappointment after watching Grid bond with an advanced elemental, none of them voiced it. After all, without Grid, they would never have had this opportunity in the first place. Even contracting with a lower elemental was an honor they scarcely deserved.\n\n*Still, this is good.*\n\nJishuka and Pon gained slight increases to attack speed and accuracy thanks to their lower wind elementals. Huroi's speaking speed increased—naturally. Regas received enhanced resistance and defense from his earth elemental, leaving him thoroughly satisfied. He was particularly pleased since his low defense had held him back countless times before.\n\nMeanwhile, Faker and Chris struck gold.\n\n[The lower wind elemental realizes you are faster than it and retreats in frustration.]\n\n[The intermediate wind elemental whispers that it wants to have fun with you.]\n\n[All lower elementals have sensed the aura of a tyrant and fled in fear.]\n\n[The intermediate earth elemental promises to temper your savage nature.]\n\nAfter witnessing the two of them contract with intermediate elementals, Chris developed a hypothesis: the most important factor in contracting with a higher-tier elemental was possessing a high-rated class. His reasoning was sound. Faker had acquired the second class Shadow Master's Student after Khan's death, while Chris himself possessed the second class Tyrant.\n\n\"It's highly likely. Isn't that why Grid contracted with an advanced elemental?\"\n\n\"Hmm... We'll know for certain once we see Yura's results.\"\n\nWould Demon Slayer Yura succeed in contracting with an advanced elemental like Grid? Grid and the entire Overgeared Guild waited with bated breath.\n\n***\n\nThick fog clung to the poisonous river. A noxious miasma that inflicted the *poisoned* status on anyone who inhaled it. Volcanoes erupted throughout the region, and the earth trembled without cease. Maintaining one's balance was nearly impossible. Boiling lava radiated such intense heat that it melted skin from meters away, forbidding any living creature from approaching.\n\nThis was the 32nd Hell.\n\nWithout its ruler Belial, chaos reigned. Creatures ran rampant, unchecked. Residents had long since abandoned their homes. Only starving demonic beasts remained, wandering without purpose. Into this hellscape, gunshots rang out, heralding the death of demon after demon.\n\n*Tang! Tang tang!*\n\nEach shot turned a demonic beast to gray ash. Dozens of ashen pillars rose through the fog. The surviving demons witnessed the slaughter of their kin and lost all courage. Tails tucked between their legs like frightened puppies, they scattered.\n\nBut the beautiful woman missed none of them. She warped through space itself, driving her blade into the mouths of the fleeing beasts. The Demon Slayer's pale skin turned crimson as blood splattered across her body.\n\n\"Hah... hah...\"\n\nAll communication with the surface world was severed in Hell. No one with a normal mind could survive alone in this desolate wasteland.\n\nYura had never lost her composure—except when dealing with Grid. But life in Hell was brutal. Her body and mind had been pushed past their limits long ago. She could no longer distinguish whether the screams echoing in her ears were real or hallucinations, and her thoughts blurred together in a tangled mess.\n\nStill, Yura pressed forward. She walked without rest through the unchanging landscape she'd been trapped in for months, raising her gun toward another demonic beast.\n\n*Tang!*\n\nShe yearned to stand on equal footing with Grid, who had torn down the heavens to become the new sky. Yura wanted to feel pride again. Desperate to reclaim her place at the top, she needed to prove that her Demon Slayer class wasn't inferior to Sword Saint or Pagma's Descendant. She refused to feel ashamed when facing Grid. More than that, she couldn't become a burden to him after abandoning the Yatan Church for the Overgeared Kingdom.\n\n\"...?\"\n\nYura froze mid-step. Her eyes widened. For the first time in two months, Hell's landscape had changed. In the distance, shrouded in fog, stood a black castle.\n\n*Belial's Castle?*\n\nYura swallowed hard, the castle's silhouette reflected in her eyes.\n\nHope surged through her. Perhaps something remained in the ownerless fortress—something that could help her. There might be fierce monsters, but she was certain there would also be treasures to accelerate her growth. This wasn't baseless optimism. Given the symbolic importance of a great demon's castle, Yura's expectations were entirely reasonable.\n\nThe massive, dust-covered gate swung open under her touch.\n\n\"...\"\n\nYura's eyes narrowed as she surveyed the courtyard beyond. Had the demonic beasts resorted to cannibalism after hunger drove them mad? The area outside the castle reeked of rotting corpses. She moved cautiously forward. As she approached the main entrance, she began to sense *something.* She wasn't mistaken.\n\n[The Demon Slayer's intuition has detected a powerful demonic energy.]\n\n[You have entered the Prepared to Die Posture. Concentrated magic bullets gain +10% creation speed. Physical defense increased by 15%. Magic resistance increased by 20%.]\n\nThe passive skill that hadn't even triggered when she faced the 32nd Great Demon Belial was warning her now. Whatever lay beyond that door far exceeded her expectations. Yura steadied her breathing and focused her mind.\n\n*I'm over level 300 now.*\n\nThis was Hell—a stage that maximized a Demon Slayer's abilities. The current Yura was incomparable to who she'd been during the Belial raid. Recognizing this, she pushed past her fear and shoved open the door with her slender hands. The rusty iron shrieked as it moved, but it was the *figure* on the throne in the darkened great hall that sent chills racing across Yura's skin.\n\n\"Why are you here?\"\n\nYura's voice trembled as she addressed the man seated on the throne. The last time she'd been so visibly shaken was when she'd faced Grid.\n\nOf course. Grid always transcended her expectations. Just like now.\n\n\"Pagma's Swordsmanship.\"\n\nThe man rose from the throne. One step. Two steps. Then he danced forward. Sharp eyes like a bird of prey locked onto her.\n\n\"Transcended Linked Kill Wave Pinnacle.\"\n\nAn atrocious surge of energy erupted with devastating momentum, crashing toward Yura.\n\n\"...!!!\"\n\nThe colossal castle—symbol of the 32nd Great Demon's supremacy—collapsed like a sandcastle.\n\n***\n\nOver the past few years, the Overgeared members had aggressively leveraged Grid's reputation and abilities. They'd recruited talent using Grid's name, and Lauel had hand-picked promising individuals to join the Overgeared Guild.\n\nThe Overgeared Guild now boasted 620 members. The composition was admittedly unbalanced—more than half were production classes. But this made perfect sense. For a kingdom's *army*, production classes held more strategic value than combat classes.\n\n\"All the blacksmiths contracted with fire elementals?\"\n\n\"Yes. Even Panmir.\"\n\n\"Damn it... Why am I the only one with a light elemental? Isn't Pagma's Descendant a blacksmith class?\"\n\nGrid's obsession with the Duke of Fire title ran deeper than anyone imagined. Understandable, really—he was chasing Pagma's shadow.\n\nLauel placated the grumbling Grid. \"Isn't the light elemental a higher-tier spirit? I heard they're elementals of royal lineage. Shouldn't that be better than a fire elemental? Just accept it and be satisfied.\"\n\n\"I know that. But it's not very effective unless the target has the dark attribute.\"\n\n\"Isn't the water elemental weak to the fire elemental? What result would ever give 100% satisfaction?\"\n\n\"No, think about it. How convenient would it be if I had a fire elemental? It'd make crafting items easier, and I could cook rice while traveling.\"\n\n\"...You only eat beef jerky anyway.\"\n\nGrid's complaints were just idle grumbling, so Lauel gave up trying to console him and looked outside. Hundreds of Overgeared members stood before the World Tree. Their contracts with the elementals had succeeded, and happiness radiated from their cheers for Grid.\n\n\"In any case, it's truly remarkable. I'm constantly amazed by what you accomplish.\"\n\n\"Did you contract with an elemental?\"\n\n\"Of course. I followed the pull of my soul and communicated with an elemental as soon as I entered the forest.\"\n\nGrid studied the grinning Lauel and asked cautiously, \"Did you contract with a dark elemental?\"\n\n\"That's correct. I hesitated between fire and dark because of the black flame dragon sealed in my arm, but ultimately chose dark.\"\n\n\"Crazy!\"\n\nAt this point, the game system was uncanny. It seemed to read people's personalities perfectly.\n\nLauel asked for final confirmation. \"If the Overgeared members form parties of eight, they can raid the ancient species called bear-wolves... You're certain there's nothing wrong with this directive?\"\n\n\"Yes.\"\n\n\"You realize the Overgeared members at full strength could attempt the Belial raid again, right?\"\n\n\"Yes.\"\n\n\"The bear-wolves are that strong?\"\n\n\"They're incredibly strong. That's why I'm leaving Mercedes and Jude behind. They'll ensure the guild members' safety while everyone hunts and grows together in the forest.\"\n\n\"Really... You're truly going alone?\"\n\nGrid had declared he would invade and destroy Merchant King Kir's city single-handedly. Naturally, Lauel felt concerned. Though Grid had eliminated Kir's elite knights, thousands of troops remained in the city. There would be hundreds of players. Dozens of high rankers had ties to Kir through items he'd provided. Did it make sense that one person could defeat all of them? Even with his understanding of Grid's strength, Lauel thought it impossible. The recent growth of rankers was terrifying, and the trend showed no signs of slowing.\n\nGrid shrugged. \"Don't worry. I've become much stronger.\"\n\nKir's chance of escape vanished the moment Agnus became a legend. Grid needed to shatter Kir so thoroughly that recovery would be impossible. This was absolutely necessary given Kir's personality.\n\n\"I need to hurry. Kir might have already made contact with Agnus.\"\n\nThe Saharan Empire. Immortal. The Yatan Church. The great demons...\n\nGrid had no intention of leaving variables unchecked with unavoidable wars looming on the horizon. His resolve firm, Grid departed the World Tree's Forest and headed for Merchant King Kir's city."
}