{
  "id": 841,
  "title": "Chapter 841",
  "content": "The system notification blazed across Yura's vision, painting the collapsed stone around her in crimson light.\n\n[You have suffered catastrophic damage!]\n[**A legend doesn't die easily.** You can resist all attacks for 5 seconds with a minimum of health.]\n\nStone dust choked her lungs. The castle—what remained of it—groaned and settled around her as she dragged herself from beneath a pile of rubble. Her health bar flickered in the tens. One blow. A single strike had brought her from full strength to the edge of death.\n\n*Why is Grid here?*\n\nThe question spiraled through her mind, but the wrongness of it struck her immediately. Grid had no reason to be in Hell. Not now. Not like this.\n\nShe forced herself to breathe, to think past the pain screaming through her ribs. The figure standing in the ruined hall wasn't moving—just watching her with an expression that might have been curiosity on anyone else. On Grid's face, it looked wrong.\n\nYura pulled herself upright and stared at the nameplate floating above his head.\n\n**Grid.**\n\nGolden text. Not the white of a player.\n\n\"What...\" The word escaped her as understanding crystallized into ice in her chest. A named NPC. Grid's name, Grid's face, Grid's voice—but something else wearing them like a mask.\n\n\"Question,\" the thing said, tilting its head with mechanical precision. \"Are you human? Are you the same creature as Grid?\"\n\nHer hand found a potion by instinct, downing it as she raised her gun. The liquid burned down her throat, barely enough to pull her from death's doorstep.\n\n\"Do you know Grid?\" The question came out sharper than she intended.\n\n\"Surprise. It is the first time I've seen a human here.\" A pause, as if cataloging new information. \"Question. Can Grid come here?\"\n\nEvery word raised more questions than it answered. Yura kept her aim steady. \"Are you looking for someone called Grid?\"\n\n\"Answer. That's right.\"\n\n\"What's your relationship with him?\"\n\n\"Answer. There is no relationship.\"\n\n\"Then why—\"\n\n\"Answer. I have to kill him.\" The clone's expression didn't change. \"I was born for the sake of killing Grid.\"\n\nThe primitive part of Yura's brain that had kept her ancestors alive on the savanna began screaming. Not fear of strength—she'd faced stronger enemies. This was something deeper, more fundamental. Like staring into the eyes of something that shouldn't exist.\n\n\"You...\" She took a step back. \"Who are you?\"\n\n\"Subtle. Grid?\"\n\nAnother step backward. The potion had restored barely enough health to run. Whatever this thing was—incomplete ego, failed creation, deliberate weapon—it wasn't something she could handle alone.\n\n\"Question. Does our conversation mean anything?\"\n\nYura didn't answer. She turned and ran.\n\n\"**Pagma's Swordsmanship, Flower.**\"\n\nThe world exploded into light. Dozens of energy blades materialized like petals unfurling, each one carving through stone and air with surgical precision.\n\nPain. Everywhere.\n\nHer vision flashed red again. The health bar—still in the tens, somehow—flickered dangerously. She didn't look back. Couldn't afford to. The ruins of the castle blurred past as she fled, boots skidding on loose stone, lungs burning.\n\nBehind her, silence.\n\nWhen she finally dared to glance over her shoulder, the clone remained in the hall, sliding that rusted sword back into its sheath with the same mechanical precision.\n\n\"Difficult,\" it murmured to the empty air. \"Need to find a new home...\"\n\nThe words followed her into the darkness, and with them, a single question that refused to leave:\n\n*What have they created?*\n\n***\n\n\"I'll make that bastard regret he was ever born!\" Merchant King Kir's voice echoed off the ornate walls of his Penan office. \"How are the other rankers so incompetent that they're pushed around by that fool?\"\n\nThe eastern edge of the Gauss Kingdom had never been prime real estate—thirty thousand souls crammed into aging buildings, struggling fields, mediocre trade routes. But Kir had seen potential. Twenty million gold. Ten billion won in cold, hard cash. Seven years to recoup the investment, he'd calculated, if everything went according to plan.\n\nGrid had made sure nothing went according to plan.\n\nThe ledgers mocked him from his desk. This morning's losses exceeded the city's entire value. Three knights dead. Most of his private army scattered or slaughtered. And the project—his beautiful, carefully orchestrated project—lay in ruins before it had even begun.\n\n\"Stupid bastard!\" Kir slammed his fist on the desk. \"Doesn't he understand that cooperation would profit us both? Why make an enemy when we could've been partners?\"\n\nIt always came down to this. The intelligent saw opportunity; the ignorant saw threats. Grid was a walking tumor on his business interests, and tumors needed to be cut out.\n\nA knock interrupted his brooding.\n\n\"Earl Taru has agreed to support us with his troops.\"\n\nKir's mood brightened fractionally. \"Good. He'd better. I paid enough for this city.\" Earl Taru had owned Penan before Kir—one possession among dozens. The gold that had changed hands ensured cooperation. \"The man has a conscience, at least.\"\n\nRebuilding required soldiers. Soldiers required money. Money required business operations that Grid had thoroughly demolished. The circle needed to close, and fast.\n\nThe door opened wider, revealing white hair and a confident smile.\n\n\"I didn't think we'd meet under these circumstances,\" Veradin said, extending his hand.\n\nKir clasped it with both of his, relief and calculation warring in his expression. \"Thank you for accepting the invitation.\"\n\n\"I should be thanking you.\" Veradin's smile never wavered. \"We've been... nomadic, lately. The Overgeared Kingdom's kill order has made settlement difficult.\"\n\n\"Were you hit by Grid too?\" Kir asked, releasing the handshake.\n\nVeradin blinked. \"I haven't mentioned why I called you. How did you—\"\n\n\"You're famous for self-interest, Merchant King.\" Veradin settled into a chair uninvited, perfectly at ease. \"Inviting Immortal risks Grid's attention. You wouldn't do that unless he'd already burned you.\"\n\nA long exhale escaped Kir's lips. \"You're not wrong. That damn Grid cost me everything. I have debts to collect.\"\n\n\"Interesting.\" Veradin leaned forward. \"Tell me more.\"\n\nKir obliged, walking through the forest ambush, the lost knights, the destroyed plans. He carefully downplayed the casualties and omitted any mention of the Yatan Church. Some alliances required full disclosure; others required careful omissions.\n\nWhen the explanation concluded, Veradin nodded slowly. \"You've been through hell. Grid leaves victims wherever he goes.\" His eyes glinted. \"Immortal will stay. We'll make this our base and reserve our strength. Consider us at your disposal. Victims should help each other—who else will?\"\n\n\"Excellent.\" Kir allowed himself a genuine smile. \"I'll provide equipment, resources, whatever you need. But...\" He paused. \"What about Agnus?\"\n\nThe legendary necromancer had been the real draw. A newly ascended legend would tip the scales against Grid dramatically. Yet Agnus was conspicuously absent.\n\n\"Agnus?\" Veradin's laugh held just a touch too much ease. \"He's a legend now. He goes where he pleases, enjoys his newfound power. The kill order is meaningless against him—who besides Grid himself could threaten him?\"\n\n\"True enough.\"\n\n\"He'll join us once we've handled the preliminary matters. Don't worry.\"\n\nThe lie came easily to Veradin's lips. Agnus had severed ties after the Reinhardt disaster, blamed Veradin for the failure, and now treated Immortal like discarded tools. But admitting that would shatter the illusion of strength. Without Agnus, Immortal was just another guild of homeless players. Veradin clung to the belief that Agnus would return eventually. He had to.\n\n\"Shall we discuss the future?\" Veradin prompted.\n\n\"Money first. I'll gather it from every commercial avenue available, regardless of method.\" Kir's expression hardened. \"Then I'll develop talent and acquire weapons.\"\n\n\"Just to defend against Grid?\"\n\n\"Defense?\" Kir's laugh was bitter. \"I'm going to take everything from him.\"\n\n\"Ha! The right mindset.\" Veradin's grin widened. \"Let's join forces and flatten Grid completely.\"\n\n\"Flatten? We'll erase him. Crush everything he's built into dust!\"\n\nTheir laughter filled the office—expensive furniture, imported decorations, the trappings of wealth that Grid had very nearly stripped away. Two men united by failure, planning revenge with the confidence of those who've never truly understood their enemy.\n\nThey calculated Grid's growing list of rivals. Envied nations. Jealous competitors. Bitter veterans of past defeats. Surely, with so many enemies, the Overgeared Kingdom would crumble.\n\nIt was exactly what Grid and Lauel expected. Enemies who'd already revealed themselves were enemies that could be eliminated.\n\n\"K-Kir!\"\n\nThe office door slammed open. One of Kir's subordinates stumbled through, face pale.\n\n\"Veradin! He's here!\"\n\n\"...?\"\n\nThe laughter died. Both men froze, smiles cracking like thin ice.\n\n\"What?\" Kir's voice came out strangled.\n\n***\n\n\"I was careless back then,\" Boutian admitted.\n\n\"We both were.\" Arisa nodded, replaying the forest battle for the dozenth time in her mind.\n\nThey sat in one of Penan's guard houses, a bottle between them, analyzing their failure like scholars dissecting a particularly stubborn problem.\n\n\"When I tried to blow him away with magic—that was the mistake.\" Boutian's fingers traced patterns on the table. \"I should've locked down his movement instead. Pagma's Swordsmanship requires specific positioning. The National Competition footage showed it clearly.\"\n\nGreed had made them sloppy. They'd seen a legendary player and imagined the glory of the kill, the bragging rights, the loot. Strategy had taken a backseat to ambition.\n\n\"I focused too much on his Blackening,\" Arisa confessed. \"Held back at first, waited to see if he'd transform. Should've gone all-out from the start.\"\n\n\"You should've taken me,\" Tarot interrupted from where he lounged against the wall. His red eyes—a gift from the transformation that had made him half-demonkin—reflected the lamplight. \"I would've hunted Grid easily. Isn't that right?\"\n\nBoth rankers winced. Tarot possessed Blackening too, gained through some great demon quest that had rewritten his species. If he'd been in that forest...\n\n\"It would've been our chance to hunt him and claim the bonuses,\" Boutian agreed reluctantly.\n\n\"You had a separate mission,\" Arisa reminded him.\n\n\"A mistake from the start.\" Tarot picked at his teeth. \"If you'd waited until I finished, you wouldn't have suffered such humiliation... Huh?\"\n\nHis casual posture snapped straight. The red eyes focused on something beyond the window, pupils contracting like a predator spotting prey.\n\n\"Isn't that Grid?\"\n\n\"What?\" Boutian and Arisa spoke simultaneously, frowns mirroring each other.\n\nThis wasn't the time for jokes. Tarot ignored their skepticism, lips pulling back from teeth that were slightly too sharp for human.\n\n\"Ah, right. Human vision is terrible. I'd forgotten.\" He pushed off the wall. \"It's been months since I was fully human.\"\n\n\"What are you—\"\n\nBlack energy erupted from Tarot's skin, the transformation immediate and violent. Blackening wasn't subtle—it twisted the user's features, amplified their stats, announced its presence like a war drum. His red sword materialized in his hand as he launched himself toward the gate.\n\nA white blade of pure light intercepted him mid-leap.\n\nThe holy energy punched through his forehead, and half his health evaporated in an instant. Momentum became deadweight. Tarot crashed to the cobblestones, stunned, as a figure in white strode past him.\n\nThe figure didn't stop. Didn't even look down.\n\nDozens of energy blades materialized from thin air—petals of light that carved through flesh and bone with the precision of a master's brushwork.\n\nTarot turned to gray particles before he could scream.\n\n\"E-Emergency!\" Boutian's chair clattered backward.\n\n\"Gather the army! Now! Everyone—\"\n\n\"**100,000 Army Massacre Sword.**\"\n\nThe words fell like a sentence of execution.\n\nAlarm bells began to ring across Penan as Grid walked through the gate, and the city learned what it meant to harbor his enemies."
}