{
  "id": 843,
  "title": "Chapter 843",
  "content": "[Your party member, White, has died.]\n\n\"Sister!\"\n\nIn a distant alleyway far from the battle's center, Black hunched over her control station, face draining of color. Her sister—who had ground levels relentlessly, who had sworn vengeance, who had armed herself with legendary equipment—had lasted less than two minutes.\n\nBlack's gaze locked on Grid through her clones' eyes as lightning tore through their forms. Ice flooded her veins.\n\n*The gap widened. How?*\n\nEvery game had a ceiling. Growth curves flattened at high levels. Low-tier players climbed faster than veterans. Those lacking gear progressed quicker than those drowning in it. Grid, who'd wielded legendary items from day one, who sat at the rankings' peak—his growth should have crawled.\n\nYet here he stood, transcendent. Not just stronger than last year. Stronger than the National Competition months ago.\n\n\"Myth-rated items?\" Black whispered. \"No. Impossible. You'd have better odds plucking stars from the sky.\"\n\nShe shook her head, feeling Illusion Manifestation's resources finally replenish. No hesitation. She activated her ultimate technique.\n\n*Illusion World.*\n\nThe field Grid controlled would turn against him. Reality itself would bend to her will.\n\n[Your illusions have twisted reality.]\n\n[You have lost 4.7% experience as the price for wielding Illusion World.]\n\n[The target location is already dominated by overwhelming power!]\n\n[The target's presence neutralizes your illusions.]\n\n[Illusion World has failed to manifest!]\n\n\"What?\"\n\nGrid had pegged Black's class as legendary long ago. His instincts, honed against countless opponents, rarely missed. The truth sat closer to the mark than even he knew—Illusionist was a growth-type hidden class capable of reaching legendary rating. Black's level remained suppressed by the brutal penalties each skill demanded, keeping her class locked at unique rating. But its power? Undeniable.\n\nAn Illusionist's constructs influenced nearly any target. Even legendary classes crumbled before illusions purchased with experience. Only entities like archangels, great demons, and transcendent beings like yangbans resisted unique-rated Illusions. Affecting them required the legendary upgrade.\n\nYes, those rare exceptions existed. But a unique-rated Illusionist should have *absolute* dominion over players.\n\nYet Grid stood untouched.\n\n\"This can't be...\"\n\nResources spent. Experience burned. Her ultimate technique—*neutralized*.\n\nBlack reeled from the loss, then Grid's voice cut through the chaos, addressing her illusion clone directly: \"You sisters haven't improved at all. Take a vacation or something?\"\n\n\"You bastard!\"\n\nA vacation? Did he have any idea how hard they'd worked? The grinding, the sacrifices, the countless hours—\n\n\"You know nothing!\" Black's fury ignited. Her illusions shook off their paralysis and charged. She'd modeled them after Faker—the monster who'd beaten her despite his normal class. If anyone could handle Grid, copies of that demon could.\n\nThe logic held weight. Grid had burned through his arsenal against Kir's forces and White. He'd even shown fatigue.\n\nIn truth...\n\n*Too much mana.*\n\nGrid could no longer sustain Storm Demonic Energy Field's thousand-mana-per-second drain. The Ring of Absurdity—stolen from Black herself, ironically—cut the cost in half, but his mana pool simply couldn't keep pace.\n\nStill, no regrets. Storm Demonic Energy Field had slaughtered hundreds.\n\n\"Die! Die! DIE!\" Three beauties materialized, daggers gleaming, converging on Grid from all angles. Their speed rivaled the third advancement assassin specialization, Master of Swiftness. They weaved between soldiers, striking faster than Grid could react.\n\nHis arm. His waist. Both opened up.\n\nKir's magicians and necromancers layered curses and spells over the assault, fracturing Grid's focus.\n\n\"Kyahat! Kuhihihit!\" Black's delighted laughter rang out as her illusions spun and stabbed.\n\nGrid raised the God Hands against the magical bombardment and equipped the Slaughterer's Eye Patch.\n\nThe clones' accuracy plummeted immediately. Grid read their attack patterns now, movements flowing around each strike.\n\n\"Tch!\" Black's annoyance bled through to her constructs. \"Why aren't you protecting me? Move those skeletons! Seal his movement! God, are all men this useless?\"\n\n\"...\"\n\nWhite and Black wielded considerable influence in Immortal—Veradin's personal recruits. The necromancers bristled at the constant belittlement, the casual misandry, but voiced nothing. Besides, they'd crawl through filth for a chance at Grid. This opportunity wouldn't slip away.\n\n*Clack! Clack clack!*\n\nThe undead surged forward. Fallen soldiers rose and pressed against Grid, restricting his mobility. Black's accuracy climbed.\n\nBut a problem emerged.\n\n[You have dealt 2,100 damage to the target!]\n\n[You have dealt 1,860 damage to the target!]\n\n[You have dealt 1,990...]\n\nGrid's defense was absurd.\n\nBlack's illusions wielded +7 enhanced unique-rated weapons—purchased with her experience—yet barely scratched armor that performed like +8 enhanced gear or better.\n\nBlack clung to optimism. Water wore down stone eventually. The damage would accumulate. After Storm Demonic Energy Field and Blackening faded, her illusions would grind him down.\n\nThen—\n\n*Clack clack! Clack!*\n\nHundreds of skeletons surrounded Grid completely. Undead and illusions boxed him in. Nowhere to run. Perfect execution.\n\n\"Hihit! Hihihik! Finished!\"\n\n\"Die, Grid!\"\n\nAttacks rained down like a storm.\n\n\"Wave.\"\n\nGrid's wide-area skill detonated outward. Energy rippled in all directions, slamming into undead and illusions simultaneously. He'd played defense deliberately, baiting them into Quick Movements range to eliminate Black's constructs in one sweep.\n\n\"Limited uses,\" Grid muttered. \"Make them count.\"\n\nHe burst through the collapsing undead and hunted down each remaining illusion.\n\n[The illusion summoned with Illusion Manifestation has been destroyed.]\n\n[You have lost 20% experience.]\n\n\"Impossible!\" Deep in her alley hideout, Black's eyes widened as the penalty struck. The shock finally cut through her grief-fueled rage.\n\n*I can't win.*\n\nWhite hadn't survived two minutes. What chance did Black have?\n\nShe turned to flee.\n\n\"Found you, nyang.\"\n\nBlack spun around.\n\n\"Noe!\"\n\nThe memphis—more popular than Grid himself, with a fan cafe to prove it. Black's sister had secretly joined that very community. Noe looked even cuter after his fur transformation.\n\nTo Noe, though? Black was simply the enemy. And she'd threatened his master.\n\n\"Eating time, nyang.\"\n\nHis small 'ㅅ'-shaped mouth expanded and swallowed Black whole.\n\n[Your pet, Noe, has ingested the soul of player Black.]\n\n[He has stolen half of the target's highest stat!]\n\n[Intelligence has increased by 2,131.]\n\n[You have gained understanding of Braham's knowledge and magic.]\n\n[Skill unlocked: Fireball (Enhanced)]\n\n[Skill unlocked: Dark Cutter (Enhanced)]\n\n[Skill unlocked: Chain Lightning (Enhanced)]\n\n[Skill unlocked: Enchant Weapon (Enhanced)]\n\n[Skill unlocked: Decoy (Enhanced)]\n\n\"Finally.\"\n\nGrid switched to Belial's Staff and stripped off Triple Layers—temporary armor for tanking the assault—replacing it with Valhalla of Infinite Affection.\n\nMerchant King Kir and Veradin appeared with massive reinforcements.\n\n\"Keep pushing!\" Veradin shouted, analyzing the battlefield with cold precision while Kir gaped at Penan's devastation. Veradin spotted Grid's depleted health gauge—the numerical advantage and the sisters had taken their toll.\n\n*This time. This time I kill you.*\n\nThis Penan counter-offensive represented Immortal's resurrection. Veradin summoned his infamous poison death knight, filling the area with toxic breath. His eyes burned with determination. The dream of becoming a Hwan Kingdom resident still lived.\n\n\"Kill Grid!\"\n\nGrid had exhausted his skills. Pagma's Swordsmanship suffered from brutal cooldowns. Veradin felt confident.\n\nThen incomprehensible words reached his ears.\n\n\"Enchant Weapon. Chain Lightning.\"\n\n*Magic?* High-tier spells, several grades above Magic Missile—why were they coming from Grid's mouth?\n\nBefore Veradin could process it, lightning detonated across necromancers' undead, Kir's soldiers, Veradin himself, and his death knight. Range: one hundred meters.\n\n[You have suffered 19,000 damage!]\n\n[Electric shock applied!]\n\n[Overcoming Death has negated electric shock...]\n\n\"Kuk—! Kuaaaack!\"\n\nChain Lightning with hundred-meter range? Power matching high-tier magic?\n\n\"Why... why are you...\" Veradin's voice cracked. \"How do you keep growing?\"\n\nA massive fireball filled his vision.\n\nGray ash scattered where Veradin had stood.\n\nKir stared, jaw slack.\n\n*From the beginning...* That first day he'd met Grid... *I should have bowed.*\n\nHis chest tightened. Regret choked him.\n\nToo late. In Grid's mind, the \"Merchant King\" title belonged to Muto now.\n\nNot Kir."
}