{
  "id": 844,
  "title": "Chapter 844",
  "content": "**TL Note:** Please check the updated announcement post if you haven't already—I got the dates wrong in the first version.\n\n---\n\nUndead had never been weak pets.\n\nTrue, they suffered from fundamentally low intelligence, but they would execute any command without question. Their lack of emotions and common sense could be an asset. And while their agility and durability fell short compared to other species, evolution into higher undead could overcome these limitations.\n\nIn practice, skeleton warriors were only slightly slower than their living counterparts. Their durability was considerable. Against players of equal level, skeleton warriors excelled in one-on-one combat. When you factored in that a second advancement necromancer could summon multiple skeleton warriors alongside regular skeletons, the class became formidable indeed.\n\nBut that advantage applied only to general hunting or PvP. Against boss monsters, necromancers were vulnerable. The undead's attack power and durability simply couldn't overcome a boss's overwhelming defense and devastating strikes.\n\n\"...Should we just surrender?\"\n\nThe elite necromancers of Immortal watched their fighting spirit crumble. Grid himself had become a boss monster. They were convinced that defeating him lay beyond their abilities.\n\n\"He's a goddamn monster!\" The level 245 necromancer Kakron trembled. He'd worked as hard as anyone else, yet Grid stood alone against thousands and refused to fall. The sense of deprivation overwhelmed him, and the curse slipped out before he could stop it.\n\nNot a single person agreed.\n\nDrew, the 7th ranked necromancer, turned on him. \"What bullshit are you spouting? What right do you have to complain? Your level's lower than everyone here and your equipment's mediocre. You'll lose less than any of us. You've invested less time, less money, less effort—do you have any self-awareness?\"\n\n\"...\"\n\n\"Shut up if you've got a brain. Don't demand more than you're owed.\"\n\nDrew's anger and contempt were directed as much at himself as Kakron. He'd been watching Grid, Kraugel, and Agnus for some time now. He knew what it took to become a top player in Satisfy.\n\nWas it the patience to hunt in one location for days on end? The wealth to purchase the best items? The luck to overcome financial hardships? No. Those alone weren't enough. The real key was the ability to continuously generate and link hidden quests. Those who could exploit Satisfy's infinite freedom to navigate through unique episodes—they were qualified to be top players.\n\nDrew had never achieved it. He didn't know the details. When to go, where to go, whom to meet. What choices would trigger hidden episodes or quests? He simply didn't have the mental capacity to figure it out.\n\n\"...Damn monster.\"\n\nThere was no hatred in Drew's eyes as he watched Grid single-handedly kill Veradin, then annihilate the soldiers and undead army. Only awe.\n\n\"How smart is he?\"\n\nWas Grid a gaming genius? Did he constantly experience new episodes and make rapid progress through hidden quests? It was a talent Drew desperately wanted to possess.\n\n\"Hah...\" Drew was sighing in frustration when Veradin's whisper arrived.\n\n—**Veradin:** I'm sorry I died without accomplishing anything. I'm at the resurrection point now. I'll rejoin you for sure, so use Kir's soldiers as shields. Let's catch Grid today.\n\n\"Ha!\" Drew laughed bitterly and replied.\n\n—**Drew:** You're going to rejoin us? You?\n\n—**Veradin:** What do you mean?\n\n—**Drew:** You hate dying. You think I don't know you're doing a quest where you can't die?\n\n—**Veradin:** Your guess doesn't make sense. What player *likes* dying? I'm just trying to protect myself. What quest are you talking about?\n\n—**Drew:** The difference between before and after you came back from the continent is too obvious.\n\n—**Veradin:** ...Are you sure?\n\n—**Drew:** Bastard! I already know about your secret exit route! Do you think we're idiots?\n\n—**Veradin:** ...\n\n—**Drew:** Based on that reaction, you're already there, aren't you?\n\nAt the entrance to the waterway beneath Kir's castle, Veradin stiffened. Bullet, the 2nd ranked necromancer, was waiting for him.\n\nThe usually gentle Bullet was furious. \"I followed you because I recognized your skills and believed in your accomplishments. In the end, were we just tools for you to discard?\"\n\n\"...So what? You want me to give you something special? Me? To an ordinary person like you?\" Veradin's voice dripped with contempt. \"I gathered you because I wanted Agnus to recognize me. I wanted him to see me as useful, to qualify to stay by his side and observe his madness.\"\n\n> **[Hwan Kingdom's Resident (1)]**\n> \n> **[★ Hidden Quest ★]**\n> \n> You must meet the minimum qualifications to challenge the Chiyou Test.\n> \n> First, transcend the level of an ordinary person.\n> \n> **Quest Clear Condition (1):** Don't die until you reach level 400.\n> \n> * Every time you gain 20 levels without dying, you will receive a large number of bonus stats.\n> * If you die, you will lose all bonus stats acquired. The lost stats cannot be restored.\n> * If you die, the quest clear conditions will change to condition two.\n> \n> **Quest Clear Condition (2):** Deaths must be fewer than five before reaching level 400 (Deaths: 4/5).\n> \n> * This is your last chance. If you fail to complete the second condition, you will permanently lose your qualification to challenge the Chiyou Test.\n\nThere was no turning back for Veradin. Half-abandoned by Agnus—who wasn't actually insane—and dragged down by Immortal rather than helped, Veradin had only one life remaining. He had to protect himself. He had to escape.\n\n*Tsk.* He clicked his tongue and pulled up the guild member list, intending to use his authority to expel Bullet and Drew. He'd silence them, give them the expulsion penalty—\n\nBut unlike Veradin, Bullet and Drew had worked for the guild with genuine sincerity. The members' loyalty belonged to them.\n\n> **[You have been impeached from the position of guild leader by member vote!]**\n> \n> **[Guild Leader Bullet has expelled you from the guild!]**\n\n\"You—!\"\n\nThe system interpreted guild expulsion as a 'serious unforgivable sin' and imposed penalties accordingly.\n\n> **[You have been expelled from the guild and designated a fugitive!]**\n> \n> **[Punishment for your crimes: If arrested by a former guild member, your imprisonment sentence will increase. If killed, the death penalty will increase by 20%. This penalty applies once.]**\n\n\"This is... being bitten by a dog I raised.\"\n\nImmortal was *his* force! These people, even Agnus—none of them had done anything! Veradin's voice shook with rage as he raised his head and shouted, \"Summon Death Knight!\"\n\nHe was in an extreme state. He had to assume the necromancers who'd betrayed him might surrender to Grid and lead him here.\n\n*I have to leave. Now!*\n\nVeradin commanded his death knight to kill Bullet.\n\n\"Summon Death Knight.\" Bullet calmly summoned his own.\n\nThe battle between the first and second ranked necromancers began.\n\n***\n\n\"Dammit! How do I fix this?\"\n\nHad Grid been a mage before changing to Pagma's Descendant? As Grid suddenly began using magic to slaughter soldiers, Kir felt profound unease. The undead army that had risen was now retreating from Grid.\n\n*Is there a separate strategy?*\n\nVeradin might have died uselessly, but Immortal had many ranked necromancers besides him. Kir had relied on Immortal sincerely. He'd thought that with their cooperation and his troops, they'd have a chance against the tiring Grid.\n\nThen the strange phenomenon occurred. The undead army gained distance from Grid, then suddenly collapsed and returned to earth.\n\n\"What's happening?\"\n\n\"...\"\n\nKir shouted toward Immortal, but received no response. The Immortal members were slowly backing away, trying not to draw Grid's attention.\n\nKir's eyes blazed. \"You dare break our alliance so one-sidedly?\"\n\nDrew approached. \"The person who made the alliance just left the guild. That bastard Veradin abandoned us and went solo. We no longer have a reason to fight.\"\n\n\"...I don't know the details, but aren't you being too casual? You've already attacked Grid. Do you think he'll spare you because you've stopped fighting? You'll have to fight to survive anyway. Stop this nonsense and resummon the undead. Stop that monster alongside my soldiers.\"\n\nDrew shrugged at Kir, who barely contained his frustration. \"Of course, it won't be easy. But I'm already prepared.\"\n\n\"...?\"\n\n\"We're going to die until Grid's anger is satisfied. I just hope it happens quickly.\"\n\n\"You'd go that far?\"\n\nDrew met Kir's question steadily. \"Isn't that the only answer? Haven't you figured it out yet? Is Grid an enemy we can oppose at our level?\"\n\n\"...\"\n\nThe final spell detonated. Grid obliterated dozens of soldiers with a single Fireball, then put away his staff and drew his sword. The temporary intelligence boost from Soul Ingestion had ended, and his mana was completely depleted. He could no longer function as a mage.\n\nYet to Immortal and Kir, it seemed like Grid was merely *playing*.\n\n\"He's not satisfied slaughtering with magic, so now he's using a sword...\"\n\nKir swallowed hard at Drew's analysis, his fighting spirit wavering. Then Arisa rushed to his side.\n\n\"Grid must be exhausted—his stamina should be low. I'm sure we can corner him now. Isn't Tarot coming?\"\n\nThe half-demonkin Tarot was the most expensive mercenary Kir's Company had hired. He'd been killed in a surprise attack right after Grid appeared, but Arisa didn't doubt his fighting spirit would remain high after resurrection.\n\nKir met Arisa's hopeful eyes and shook his head bitterly. \"He hasn't responded to my whispers.\"\n\n\"...\" Arisa fell silent.\n\nHer hope had rested on Tarot's power. Why would he suddenly stop responding? The hope that had filled her scattered like ash.\n\nGrid was approaching. With each step, dozens of soldiers turned gray. The power of his intermittent black flame explosions was staggering—an infinitely activated skill.\n\nThey had no idea what Grid's skill tree even looked like.\n\nIn the end, Kir was forced to concede. He ordered Arisa to halt the troops and approached Grid. \"This is a one-sided invasion, a cruel massacre. When today's disaster is revealed, public opinion will turn against you. There will be accusations of every kind.\"\n\nIt was a threat meant to end the situation. No matter how mighty one's forces, 'standing alone' bred fear. Kir wanted to negotiate.\n\nUnfortunately, his intimidation failed completely.\n\nGrid scoffed and jerked his chin toward the distance. \"You think I came here to play? Some lunatic used Blackening and rushed me. Then your soldiers attacked. I was defending myself when Immortal showed up. All of that is being livestreamed right now.\"\n\n\"...!\" Kir's head snapped around to where Grid indicated. Bunny Bunny, the world's most famous gaming streamer, waved at him.\n\nGrid's eyes turned cold. \"The cost of challenging me is very high.\"\n\n\"Ack...! Eeek!\" Kir had only wanted to protect his minimal rights. Now his eyes turned yellow with fear at Grid's words."
}