{
  "id": 845,
  "title": "Chapter 845",
  "content": "Grid was as strong as he was aggressive—and far from wise. Drunk on his own power, he chased immediate gains while blind to greater profits. His so-called decisiveness was nothing more than crude violence, the perfect recipe for making enemies.\n\nThat had been Kir's assessment. Grid might reign through brute force now, but isolation and ruin would follow sooner than expected. His days were numbered.\n\nAnd yet...\n\nKir's spine turned to ice as he watched Bunny Bunny. He was forced to reconsider.\n\n*'He's clever!'*\n\nNo—Grid himself wasn't clever. This had to be Lauel's influence, the genius who'd founded the Overgeared Kingdom. With someone like Lauel backing him, Grid had no weaknesses.\n\nThe moment Kir realized Grid intended to strip him of everything, despair swallowed him whole. \"What's the difference between you and me?\" he demanded.\n\n\"...?\"\n\n\"At least I didn't slaughter the elves. Not a single one died by my hand until you interfered. But you?\" Kir's voice cracked. \"You just butchered hundreds of soldiers in under an hour. And you dare claim you respect NPCs? You condemn me for taking prisoners while you leave corpses in your wake? What gives a murderer like you the right to judge me?\"\n\n\"Oh.\" Grid's expression didn't change. \"That's simple.\"\n\n\"...?\"\n\nYears ago, Grid had been racing against the clock to eliminate Pope Candidate Pascal and the Vatican elders. He'd overlooked the deaths of prostitutes—innocents used as human shields—because stopping meant failure.\n\nBut go back even further. The first day he met Khan, Grid had casually killed the local thugs who'd threatened them both.\n\n\"I have my own standards,\" Grid said. \"Never said I respected *all* NPCs.\" He'd wrestled with the question of NPCs' existence more times than he could count. He gestured toward the civilians cowering in doorways. \"Look. Those people are still breathing.\"\n\n\"You—!\" Kir found himself unable to intimidate or even criticize this man. Grid's profound selfishness rendered all words meaningless. Blood rushed to Kir's eyes. \"Do you think you're some kind of god? How can anyone be this selfish?!\"\n\nGrid looked genuinely confused. \"What are you talking about? Aren't *you* the one playing god?\"\n\n\"...?\"\n\n\"That's exactly what you've been doing. Capturing the weak without hesitation—because you thought you were above them.\"\n\n\"S-Sophistry!\"\n\n\"Sure, call it sophistry.\" Grid shrugged. \"But don't overthink a simple matter.\"\n\n\"What?\" The Korean phrasing flew over Kir's head. He frowned as Grid leveled a sword at his throat.\n\n\"Stop your attacks now.\"\n\n\"???\" Kir stared in disbelief. The man who'd been slaughtering his forces one-sidedly was telling *him* to stop? \"Shouldn't *I* be saying that to *you*?\"\n\n\"No. Don't I have the right to self-defense? Stop attacking. Then I'll stop.\"\n\n*'This bastard!'*\n\nGrid was conscious of the cameras right to the bitter end. Playing the victim—how despicable. Still, he offered one final chance. \"Surrender. I'll leave this city without claiming it.\"\n\n\"...\" Just the city. Everything beyond it would be forfeit.\n\nKir wasn't surprised. He'd expected this from the moment Grid arrived. \"...You're taking all my merchandise?\"\n\n\"Yes.\"\n\n\"That's beyond common sense. One day the world will learn what you've done and condemn you. The Overgeared Kingdom will face isolation.\"\n\n\"I know.\"\n\nAll manner of schemes would unfold before the kingdom's founding. Plenty of forces would covet what the Overgeared had built. An alliance to crush them was inevitable. The threat was coming regardless—better to grow stronger than wait passively.\n\n\"You're too dangerous to leave alone. Better to take your life now and ensure you can't recover. From the Overgeared Kingdom's perspective, at least. Understand?\"\n\n\"...\" Kir said nothing, because he agreed. He'd done the same to others who might threaten him later. Ultimately, his priority was protecting his trading rights. After careful consideration, he showed a merchant's cunning. \"Fine. I accept your terms.\"\n\n\"Oh?\"\n\n\"But...\"\n\n\"But?\"\n\n\"Promise you won't touch any trading rights I acquire in the future.\"\n\nIf forced to lose what he had, he'd surrender it to Grid. But his future should remain his own.\n\nGrid considered for a moment, then nodded. \"Yeah. Let's draw up a contract.\"\n\nTruthfully, Grid hadn't expected Kir to comply. He'd anticipated spending considerable time and resources stealing commerce rights bound in legal contracts. Yet here was Kir, offering everything at once. Better yet, guaranteeing Kir's future actually benefited Grid.\n\n*'If he loses everything and starts from scratch, he won't grow fast enough to threaten the kingdom.'*\n\nGrid lowered his blade and turned toward the necromancers standing off to one side. His face twisted into something terrible—an expression saturated with hatred and killing intent.\n\n\"What are you waiting for? Have you abandoned even the pretense of resistance?\" He aimed his sword at one particular man.\n\nDrew, the famous ranker who led the necromancers, cried out, \"...Kill me!\"\n\nGrid hesitated. The powerful necromancer had retreated and abandoned resistance. Now he was offering his throat.\n\n*'Is this a trap?'*\n\nWould the hundreds of corpses in the ground explode the moment he approached? Drew explained to the wary Grid, \"We invaded Reinhardt purely under Veradin's command. But Veradin abandoned us. He's left Immortal.\"\n\n\"...\"\n\n\"I'm not shirking responsibility. I invaded Reinhardt—I accept the consequences. But I ask one thing.\"\n\n\"What?\"\n\n\"Hunt down Veradin and kill him. We can't stop him ourselves.\"\n\n\"...Where is he?\"\n\n\"Behind the castle, you'll find an entrance to the underground waterways. He's escaping through there.\"\n\n\"Got it.\" Grid's blade flashed, severing Drew's neck. The remaining necromancers flinched as their leader fell. Grid's gaze swept over them. \"Anyone else who invaded Reinhardt will die eventually.\"\n\n\"...\"\n\nGrid had already noticed Agnus had abandoned Immortal. That was the only reason they'd lost their fighting spirit.\n\n*'Not even a glimpse of him...'*\n\nGrid activated Quick Movements and raced toward the waterway.\n\n***\n\n[You have died.]\n\nTarot had taken Grid's surprise attack the instant he'd activated Blackening. Pierced by white light and struck down by the passing Grid, he revived far from his resurrection point—surrounded by nausea-inducing poisonous fog and scorching lava.\n\nTarot woke in the middle of Hell.\n\n\"How rotten...\"\n\nHe didn't panic. Hell wasn't unfamiliar—he'd experienced death while using Blackening during boss raids before. That didn't make it comfortable. Despite his classification as half-demonkin, Hell remained an alien place that instilled primal fear.\n\n[You have failed to send a message to the guild. Hell is disconnected from the mortal world.]\n\n[You have failed to send a message to the guild. Hell is disconnected from the mortal world.]\n\n[The death penalty has failed to remove Blackening.]\n\n\"Tch.\"\n\nTarot's Blackening lasted 15 minutes—far superior to Grid's version via Dark Bus's Earrings. So what was this?\n\n*'He cut me down before I even saw it coming!'*\n\nThe image burned into his brain—Grid's blade falling without hesitation. Tarot had never imagined such a gulf in skill existed between them.\n\n*'I was a frog in a well.'*\n\nConfronted with reality, Tarot burned with determination rather than despair. *'Being weak means I can still grow stronger. Grid—next time will be different.'*\n\nTarot was like a weed. No matter how many times he was trampled, he sprang back up. Through hundreds of such cycles, he'd become who he was today.\n\n\"Let's hunt demonic beasts while I have time.\"\n\nHe couldn't waste this opportunity! Tarot knew he'd return to the mortal world once Blackening ended. He'd spend the remaining time hunting.\n\nStrange, though—there wasn't a single beast in sight, as if someone had swept through recently... It was vaguely unsettling.\n\nTarot advanced cautiously, weapon ready, when he spotted a figure in the distance. A man with shaggy hair and shabby clothes. Something about that silhouette triggered a sense of déjà vu.\n\nIt looked like Grid's back—the last thing he'd seen before dying.\n\n*'No way.'*\n\nWas he losing his mind? Tarot shook his head desperately.\n\nThe figure turned and spoke. \"Question. Human?\"\n\n\"...?!!\" Tarot's heart plummeted as he saw the man's face. \"G-Grid...?!\"\n\nHad Grid followed him to Hell just to kill him again?!\n\nThe man's sword flew toward him. Tarot couldn't match the speed or withstand the force.\n\n\"Cough!\"\n\n[You have died.]\n\n[You have died twice within 24 hours and have been forcefully logged out.]\n\nStabbed repeatedly, Tarot died in seconds. Twice to Grid in one day!\n\nTarot swore—even with a blade at his throat or a mountain of gold offered—he would *never* antagonize Grid again!\n\nThat day...\n\n**[Title: Meeting with Grid]**  \n**Author: Hokquah**  \n**Contents:** If you mess with Grid, he'll follow you to Hell and kill you. This isn't a metaphor—it's literal;;;\n\nA post on a popular Satisfy forum exploded.\n\nThe comments section filled with sarcasm:\n\n*—Who doesn't know this already? Look what happened to Immortal. Of course Grid goes to Hell. With his personality, chasing someone to Heaven wouldn't be strange either.*\n\n*—Why would you poke God Grid and expect anything less?*\n\n*—Are you from Penan? That place is full of lunatics.*\n\n*—Penan really is weird. Grid went sightseeing and got attacked out of nowhere.*\n\n*—Author's Comment: No, I mean he LITERALLY chased me to Hell. And what's crazy about Penan? That bastard invaded first.*\n\n*—You really are insane.*\n\n*—Author's Comment: [Reports have been received and this comment is hidden].*"
}