{
  "id": 846,
  "title": "Chapter 846",
  "content": "*Should I have killed them all?*\n\nGrid's jaw clenched as the faces flashed through his mind—Veradin, Drew, Tageo, Dail, Eisto, King Dragon. Every single Immortal member who had invaded Reinhardt, who had slaughtered his blacksmiths and soldiers. Some had knelt before him minutes ago, heads bowed in surrender.\n\nHe'd let most of them live.\n\nThey were broken. Beaten. Regret had bled from their words like poison from a wound, their fighting spirits crushed beneath the weight of Agnus' abandonment. Not like Kir—Kir had been a threat that needed eliminating. But Immortal? Immortal was just... fragile.\n\nStill. Drew had been their representative, and Grid had made an example of him.\n\n\"...Tsk. Should've killed them all.\"\n\nThe words tasted bitter. Khan's face surfaced in his thoughts—Khan, who had left this world before seeing justice done. Grid's fingers curled into fists. Unnecessary sympathy. That's what it was. Weakness.\n\nKilling intent crystallized in his chest, sharp and cold, focused on a single name.\n\n*Veradin.*\n\nGrid's pace quickened toward the underground waterway.\n\n***\n\n\"Wasting my time with this pathetic struggle.\" Veradin looked down at Bullet like he was examining something stuck to his boot. \"You really don't think for yourself, do you? This is exactly why I avoid trash like you.\"\n\nBullet's eyes wavered, blood seeping through his armor. \"Where did he go?\"\n\n\"Who?\"\n\n\"The Veradin who struggled through that empire quest. Who actually cared about his guildmates. Who was loyal to Agnus.\" Bullet's voice cracked. \"Where did that man go?\"\n\nVeradin smiled. \"He never existed.\"\n\nAn act. All of it. The perfect performance to gain trust, to observe weaknesses, to manipulate every variable to his advantage.\n\n\"...\" Bullet's throat worked silently.\n\n\"Didn't you once tell me I reminded you of an old friend?\" Veradin crouched, head tilted with mock sympathy. \"I *made* you feel that way. I needed your reputation to attract talent when Immortal was young.\"\n\nSilence.\n\n\"But that was the old you.\" Veradin straightened, brushing invisible dust from his sleeve. \"If you still consider me a friend, then do me a favor—don't drag me down with you. Don't hide in the empress' palace using my name like a shield. Although, I'm curious... when did you start to suspect?\"\n\n\"...When Agnus stopped acknowledging you. When you started giving orders that made no sense.\"\n\n\"Mm. Careless of me.\" Veradin glanced at his poison master death knight, then raised his dagger. Wounds marked his body from the fight with Bullet's death knight, but his movements remained smooth. Precise.\n\nThe gap between first and second place had never felt so vast.\n\n*The rankings don't lie,* Bullet thought dimly. *And Grid... Grid fights people like this constantly. If only Agnus were still—*\n\nThe memory surfaced unbidden: that first day meeting Agnus. The undead army rising at his command, the sheer presence that screamed *this is a true necromancer*. Everyone had been electrified. And Veradin, who claimed to speak for him...\n\nReality was a gutter compared to that dream.\n\n\"Kuk...!\" Tears blurred Bullet's vision. All he'd wanted was friendship. People united by common purpose, moving forward together through this incredible world. Was that so wrong?\n\n\"You should've been more vicious.\" Veradin's voice cut through the haze. \"Kept that darkness in your heart. Then maybe *you'd* be standing over *me* right now.\"\n\n\"...\"\n\n\"Goodbye, you boring idealist.\"\n\nThe poisoned blade plunged into Bullet's chest.\n\n\"Ah...\" \n\nPain. Poison spreading like liquid fire. And beneath it all, something darker blooming—rage at his own naivety. At chasing impossible dreams.\n\n*But not at Agnus,* he realized. *Agnus never owed me anything.*\n\n\"How disappointing.\" Veradin read his expression and clicked his tongue. \"Not even hatred at the end.\"\n\nBullet's cheek pressed against cold stone. The world blinked red.\n\n> [You will receive 4,300 poison damage.]\n> \n> [Your potion cooldown time hasn't returned.]\n> \n> [The antidote isn't working.]\n\nHis health bar drained. Motivation fled. An empty shell, waiting for the end—\n\n\"I saw it well.\"\n\nThe voice was unfamiliar. Strong-willed like Agnus', but... gentler.\n\n\"Gri... d...\"\n\n\"If you're interested in jiangshi, contact me later.\" Grid stepped past him without breaking stride. \"Talented people are always welcome.\"\n\nNo mercy. Bullet was still Immortal, after all. But Grid had given him something more valuable than mercy—a second chance.\n\nGrey light consumed his vision as Grid's footsteps echoed into the underground waterway.\n\n***\n\n\"Hah... hah...!\"\n\nVeradin's breath came in ragged gasps, all traces of his earlier composure shattered. Grid's face haunted him—those cold eyes watching in silence as Veradin delivered the killing blow to Bullet.\n\n*Arrogant bastard!*\n\nJust standing there. Watching. Like he could catch Veradin anytime he pleased.\n\n\"I'll make him regret giving me that time!\"\n\nVeradin hadn't been watching Penan for nothing. The legends spoke of a sleeping terror beneath these waterways:\n\n**The Cave King.**\n\nWhen Kir had contacted him, Veradin had thought it destiny. The underground route wasn't just for secrecy—it was opportunity. The poison master had proven useless against Grid. Time to upgrade.\n\n*Here.*\n\nGrid would be coming. Had to hurry. Veradin tore through the waterway, mud coating his armor as he searched—\n\n\"Found you!\"\n\nAn ancient iron coffin, rusted and forgotten.\n\nThe Cave King—a warlord from centuries past who'd built a secret kingdom beneath Gauss, plotting its conquest. About to be reborn with infinite stamina and earth-shaking power.\n\nVeradin wrenched the coffin open, grinning. \"Release Death Knight Kyleo!\"\n\nHis Corpse Storage manifested. The poison master's bones were ejected, replaced by the Cave King's remains.\n\n\"I, Veradin, claim dominion over the Cave King! Rise as my death knight!\"\n\n> [This is a legendary rated body.]\n> \n> [Due to the lack of dominance stats, you have failed to make the Cave King your death knight.]\n> \n> [The title 'Possessed by the Deceased' has allowed you to overcome the limitations of the dominance stat.]\n> \n> [You have succeeded in making the Cave King a death knight.]\n> \n> [The title 'Under the King...' has been acquired.]\n\n> **[Death Knight]**\n> \n> **Name:** Cave King  \n> **Level:** 361  \n> *The master's level is too low. The level and stats of the Cave King are in a weakened state.*  \n> **Strength:** 4,100 (▼) **Stamina:** 4,100 (▼)  \n> **Agility:** 540 (▼) **Intelligence:** 190 (▼)\n> \n> **Skills Possessed:**  \n> Plunder (A-), Cave in Sword (A+), Lead to Hell (S)...\n\n\"Haha... kuhahahaha!\"\n\nBeyond expectations. Stronger than any death knight he'd ever controlled—stronger than the poison master by magnitudes. High stats, all A-rank skills or better... this was Agnus-level quality.\n\nFear evaporated. When Grid appeared at the waterway entrance, Veradin didn't even flinch.\n\n\"Every time I see you, I'm reminded of something.\" Veradin's smile was knife-thin. \"Do you have any self-awareness? You've destroyed countless lives. Right now, you're creating new victims. So why? Why this obsession with the damage *you* suffered?\"\n\n\"...?\"\n\nGrid's silence only fueled Veradin's momentum.\n\n\"Your hatred. Your revenge against Immortal—it's excessive.\" Veradin gestured broadly. \"We invaded Reinhardt. Is that such a crime? Haven't *you* invaded kingdoms? Destroyed one entirely? You thrive on conquest, but when others dare touch your territory?\" He laughed. \"You're trapped in the past. Terrified of being weak again. That fear makes you unfit to stand at the summit.\"\n\nHis fingers moved. The Cave King's eyes blazed crimson.\n\n\"So today, I'll drag you down. You'll remember me as disgusting and evil forever—because to a damaged mind like yours, that's all I'll ever be.\"\n\nThe Cave King roared, purple light crackling around its form.\n\nGrid triggered Item Combination. Enlightenment Sword and Belial's Staff merged into one. The Cave King hurled stone projectiles—Grid's sword swept in a wide arc.\n\nShields materialized. One. Two. A dozen. The barrage shattered harmlessly against the endless barriers.\n\n\"W-what?\"\n\nInfinite shields? How many reality-breaking abilities did this man possess?\n\n\"Lost count of how many times I've killed you.\" Grid's whisper was barely audible over the Cave King's collapse. \"Let's call this the first.\"\n\n\"W-wait a minute!\"\n\n\"Keok!\"\n\n> [You have suffered serious damage!]\n> \n> [It is catastrophic damage...!]\n\n> [You have died.]\n\n> [You have failed to fulfill the conditions of ★Hidden Quest★ **Hwan Kingdom's Resident (1)**. The quest has been destroyed.]\n> \n> [The Hwan Kingdom will no longer give you a chance. You aren't even permitted to visit.]\n> \n> [You have died two times within 24 hours and have been forcefully logged out.]\n\nThe underground waterway fell silent."
}