{
  "id": 847,
  "title": "Chapter 847",
  "content": "\"No... NO! GRID!\"\n\nVeradin's scream echoed in the capsule as his eyes snapped open. For a single, merciful moment, he thought it had been a nightmare. Then reality crashed down—he'd died twice in succession and been forcibly ejected from Satisfy. Worse still, his chance to become a resident of the Hwan Kingdom had been permanently destroyed.\n\nHe dragged himself upright, fingers digging into the capsule's edges. *How did he still have so much strength left?*\n\nThe calculations had been flawless. Penan's garrison numbered three thousand, bolstered by Merchant King Kir's resources—rankers equipped with premium gear, necromancers from Immortal. Grid should have burned through his skills and stamina just reaching the inner sanctum. By the time he caught up to Veradin, the man should have been running on fumes.\n\n*He had to be.*\n\nStamina wasn't like health or mana—you couldn't chug a potion and call it fixed. Rest was the only cure, and even someone with three thousand stamina couldn't fight an army without exhaustion setting in.\n\nYet Grid had been *fine*.\n\n\"Did they surrender?\" Veradin muttered, grasping at straws. \"Did the Immortal forces on the front lines just... give up?\"\n\nIt would explain the stamina reserves, but something didn't add up. The pieces refused to fit.\n\nHe didn't know that Kir had lied. The merchant had downplayed his losses to salvage his pride, conveniently omitting the unicorn he'd surrendered to Grid. Veradin's intelligence network had failed him at the worst possible moment.\n\n\"Unless...\" His breath caught. \"Unless his stamina exceeds four thousand.\"\n\nThat would explain the defense, at least. But if Grid had invested so heavily in stamina, where did the devastating attack power come from? The magic? The speed?\n\nHis fist struck the capsule—a pathetic blow from an arm that had never seen a gym. The expensive equipment didn't even dent.\n\n\"It's the gear,\" Veradin whispered, the words tasting like ash. \"He really is just... overgeared.\"\n\nHe'd dreamed of becoming a yangban. Of standing apart from the two billion players drowning in mediocrity. Of crushing Agnus beneath his heel and savoring unparalleled superiority.\n\nNow? Now Grid haunted him like a specter.\n\nThe grudge burned white-hot, but beneath it lurked something worse—hesitation. Immortal had bled wealth and prestige fighting this man. They'd poked a sleeping lion, only to discover it was something far worse.\n\nVeradin's shoulders sagged. He could have been a star. Instead, he'd chosen to step on a monster.\n\n***\n\nMuto had carved his success from Grid's goodwill and his own sharp instincts. The chandelier deal with the imperial palace had launched him skyward, and he'd parlayed Grid's support into exclusive commerce rights within the Overgeared Kingdom. Rather than gorging on profit margins, he'd kept prices fair—and consumers had flooded in by the thousands.\n\nThe agricultural powerhouse that was the Overgeared Kingdom now boasted a commercial sector to match. Muto's company had become synonymous with the kingdom itself, and he'd clawed his way from third rank to knocking on second's door. Four months—that's all he needed.\n\nRankings determined how many stores a merchant could operate. The gulf between second and third was vast, and Muto could taste the upgrade.\n\nHe'd gambled everything on Grid back on the East Continent, even enduring that insane chef's poisonous cooking to curry favor. Betting against the Saharan Empire had been terrifying, but Grid had proven worth the risk.\n\nLife was good.\n\nThen Merchant King Kir walked into the room.\n\n\"What are you doing here?\" Muto's voice cracked with barely suppressed alarm. \n\nThe man sat across from Lauel like he belonged there, and Muto's stomach dropped. *Not again.* Kir had stolen from him before—crushed competitors through ruthless expansion and backroom deals. The merchant's presence here could only mean one thing: the empire he'd built in the Overgeared Kingdom was about to be dismantled.\n\n*While Grid invaded his city, he still managed to outmaneuver me?*\n\n\"Stop glaring at me like I'm the villain,\" Kir said, smirking. \"From where I'm sitting, you're the one stealing. Here—take this.\"\n\nHe slid a leather-bound ledger across the table.\n\nMuto stared at it like it might explode. \"What...?\"\n\n\"Accept it,\" Lauel said smoothly. \"That's the Merchant King's complete financial records. Every account, every business operation.\"\n\n\"I don't—what is this?\"\n\nKir's laugh was bitter. \"Oh, don't play innocent. You don't understand the scheme to strip me bare and hand everything to you? Really?\"\n\n\"I have no idea what—\"\n\n\"It's exactly what it sounds like,\" Lauel interrupted, resting a hand on Muto's shoulder. \"Kir's empire is yours now.\"\n\nThe world tilted.\n\n\"Become the new Merchant King. King Grid has commanded it.\"\n\nMuto's heart hammered against his ribs. Heat flushed his face as understanding crashed through him—Grid had done this. Grid believed in him. Trusted him with something this monumental.\n\nLauel, of course, knew better. They'd simply run out of options. The Overgeared Guild lacked a merchant, and Muto had proven his worth. Still, watching a new fanatic be born never got old, and Lauel saw no reason to correct him.\n\n\"Muto,\" Lauel said, letting sentiment fade into business, \"you're about to acquire unimaginable wealth. Between Kir's network and the Overgeared Kingdom's commerce, the money will be astronomical. Agreed?\"\n\n\"Yes.\"\n\n\"Then seventy percent goes to Grid.\"\n\nThe number was fair, even generous considering Grid had delivered both Kir's empire and the kingdom's exclusive rights on a silver platter. Eighty percent wouldn't have been unreasonable.\n\nKir smirked. Only two players could handle his merchant network—third-ranked Muto and second-ranked Cecilia. Grid needed Muto, which meant Muto held leverage. Seventy percent? The fool would demand better terms.\n\n\"Seventy percent?\" Muto frowned. \"I don't like that.\"\n\nKir's grin widened. The rift was opening beautifully.\n\nLauel sighed—carefully measured to suggest disappointment without showing offense. \"Understood. We can negotiate further.\"\n\nSixty percent, probably.\n\n\"I'll give you ninety percent.\"\n\nSilence.\n\n\"...What?\"\n\n\"What the hell?\"\n\nLauel and Kir spoke simultaneously, shock fracturing their composure.\n\nMuto's smile was radiant. \"I'll repay Grid's grace for the rest of my life. In exchange, I want Grid's protection. Unconditionally.\"\n\nThe pieces clicked into place for him. Grid wouldn't remain king of a small nation—not with his combat prowess, legendary craftsmanship, and the collection of talent gravitating toward him. Five years, maybe ten, and Grid would rival the Saharan Empire itself.\n\nThis wasn't generosity. This was investment.\n\nKir couldn't believe what he was hearing. \"Are you blind? Grid is reckless—he makes enemies everywhere he goes. He'll collapse under his own hubris, and you want to chain yourself to that?\"\n\n\"Chain myself?\" Muto's grin sharpened. \"I'm first rank now. You're the one with nothing.\"\n\nKir's mouth snapped shut.\n\n***\n\n[**Merchant Rankings**]  \n[**1st Place: Muto (Affiliation: Overgeared Guild)**]\n\nThe update sent shockwaves across the continent. Kir's name had vanished entirely, and Muto wore the Merchant King's crown. The Overgeared Kingdom's influence surged overnight.\n\n***\n\nFar from Reinhardt, another storm was brewing.\n\nValhalla—the second player-founded kingdom—was on the march. God of War Ares commanded tens of thousands of elite soldiers, their destination the Ultina Kingdom. The small nation had been selected as Valhalla's first conquest, and the army moved like an avalanche.\n\nBeside Ares rode Oasis, the man who'd once shaken the world as a candidate for the Undefeated King's legacy. His determination burned like a brand.\n\n*I won't fail this time.*\n\n***\n\nDeep in Ultina's mountain range, a hermit received an unexpected visitor.\n\n\"Master's old friend?\" Haster's eyes narrowed at the exhausted man standing before him. The NPC—Asmophel—didn't inspire immediate trust.\n\n\"We served in the same knights division,\" Asmophel said, his voice heavy with something darker than fatigue. \"Tell him I'm the traitor. He'll remember.\"\n\nUnderstanding dawned.\n\n\"Ah. You.\" Haster's wariness evaporated. \"I've been waiting for you.\"\n\nThe hermit rose—one of the Five Miracles, the player even Kraugel feared to challenge.\n\nThe board was shifting. And Haster was finally ready to move."
}