{
  "id": 849,
  "title": "Chapter 849",
  "content": "Three-Eyed Valley was the finest hunting ground Kraugel had discovered after the World Tree's Forest. He'd spent months here, battling the three-eyed giants, pushing toward a singular goal. When the notification finally appeared, he allowed himself a breath.\n\n> [Your level has risen.]\n> [Congratulations! You have reached level 300 and achieved the third stats awakening!]\n> [For every point of stamina, health will increase by 25 and defense will increase by 0.9.]\n> [For every point of strength, health will increase by 7 and attack will increase by 0.6.]\n> [For every point of intelligence...]\n\nPower surged through him—different, deeper than before. This was his second time reaching this threshold, so Kraugel simply closed his eyes, expression serene.\n\nMemories surfaced unbidden. The quest for Quick Command, one of three passive attack skills, had led him through the Seven Malignant Saints questline to a remote mountain where the Red Sage resided. Outside a weathered cabin, he'd encountered someone unexpected: Haster, once king of the gaming world.\n\nKraugel hadn't heeded Haster's warning—that the Red Sage was ill and exhausted. He'd demanded an audience. Steel met steel. The outcome? Crushing defeat. Even as the Sword Saint, fresh past level 200 and still called \"sky above the sky,\" Kraugel had fallen.\n\nHaster's combat style defied convention. He wielded every weapon imaginable, conjured ice barriers mid-strike, and fought with a creativity that overwhelmed Kraugel's Insight and Super Sensitivity. Worse, Kraugel's unpredictability meant nothing against an opponent who fought by sound alone, reading attacks through their whisper and responding with surgical precision. It had been a humbling lesson in why Haster had once reigned supreme.\n\n*Could I win now?*\n\nThe question gnawed at him. Level 300, third stats awakening complete—did he finally have enough?\n\nKraugel closed his eyes again. The mountain cabin materialized in his mind. Haster barred the path. They fought. Kraugel lost.\n\n\"...He represents the apex of the old era.\"\n\nHaster was fighting to reclaim what he'd lost to the new generation. But Grid had already claimed that throne. Could Haster truly overthrow him? Kraugel imagined the battle. This time, Grid stood before him. The mental duel stretched on. When Kraugel finally opened his eyes, his jaw tightened.\n\n*I can't accept defeat.*\n\nThree names haunted him: Haster, Grid, and likely Agnus. Three walls he couldn't yet scale. Yet instead of frustration, fire bloomed in his chest. Motivation. Hunger.\n\nThe game had only just begun.\n\n***\n\n\"Restrain anyone who resists! No threats, no killing! These are civilians—they can't harm us.\"\n\nOasis led his unit into a village at the mountain's base. \"Village\" was generous; \"hamlet\" fit better. Everyone looked gaunt, hollowed by the brutal winter season. The storehouse held almost nothing—scraps of dried meat, boiled animal hides.\n\n*I'm sorry.*\n\nValhalla had endured much this past year. With the Overgeared Kingdom's support, they'd repelled the Empire's invasion and bolstered their military strength. But another assault loomed inevitably on the horizon, bleeding Valhalla's coffers dry. Their economy couldn't sustain this.\n\n*We conquer, or we starve.*\n\nThe Ultina Kingdom shared their border—a potential dagger at their back. If Ultina allied with the Empire, Valhalla would face encirclement. This conquest war served dual purposes: absorb Ultina's economy, eliminate the threat.\n\nBut did it require *this*? Plundering a hamlet barely clinging to survival? Turning future subjects into bitter enemies? Oasis wrestled with doubt until Ares' skill provided the answer.\n\n> [The Oasis Squad has succeeded in looting the food of Ren Village!]\n> [The effect of 'War King's Generosity' has been activated!]\n> [War King Ares has made a proposal to the inhabitants of the village that has been looted! The residents of the village will be able to find more food than what was stolen! The inhabitants of the looted village have a deep respect for King Ares!]\n> [The morale of the Oasis Squad has risen sharply! All stats will increase by 5% while morale is maintained. Stamina consumption will slow by 50%. The 'Courage' effect will be obtained. The squad won't shrink back even when meeting a strong enemy.]\n\n\"UWAAAAHHHH!\" Oasis and his soldiers roared their triumph. The War King class—currently unique-rated but growth-type—possessed mechanics unlike anything else in Satisfy. Oasis' faith in Ares ran bone-deep. He'd learned much under his king's tutelage, believed wholeheartedly that Ares would guide him toward becoming the Undefeated King's Descendant.\n\n*I'll become a protagonist like Ares and Grid...*\n\nOne year. Five years. Ten, if necessary. Oasis would wait however long it took. His days of glory would come. His perseverance and determination exceeded the ordinary—he knew this with quiet certainty.\n\n\"Who are you?\"\n\nOasis was directing the food transport when two figures materialized. Military helmets concealed their faces and names. Village youths seeking justice, perhaps? But their gear told a different story—luxurious armor beneath worn cloaks, quality that didn't match rustic surroundings.\n\nOne spoke: \"I am a soldier.\"\n\n\"...A soldier?\" The other hesitated. \"M-Me too.\"\n\n\"...\"\n\nSoldiers? One wore threadbare leather armor. The other dressed like a mountain hunter.\n\nOasis frowned, signaling his men. They encircled the strangers. \"Wandering knights playing hero with some naive villager. Valhalla's army isn't for small fries like you. Walk away now, keep your swords.\"\n\nHe needed to project authority. Valhalla's reputation couldn't be undermined by random interference.\n\n\"Acting tough while robbing a starving village?\" The leather-armored man's voice cracked like a whip. \"Your Valhalla is nothing but thugs!\"\n\n\"Take that back.\"\n\n\"Why? Truth hurt?\"\n\n\"You—!\"\n\nOasis gave the signal. Comparing the great Valhalla—Ares' legacy—to common thugs? Unforgivable. His soldiers attacked as one, their morale-enhanced strikes swift and lethal. These warriors trained under Ares himself, their defense impenetrable as stone, their spears like vipers.\n\n\"Hoh.\"\n\nAsmophel's eyebrows rose. Actual discipline. Impressive, for players. Still, he didn't panic. He'd trained Overgeared's soldiers—equipped them with superior gear. These Valhalla troops were competent, but inferior.\n\nFive spears converged from different angles. Asmophel dodged fluidly, snatched one mid-thrust, and whipped it in a wide arc. The soldier on the other end flew, crashed into his comrades, shattered their formation. Meanwhile, Haster raised a hand. Ice materialized—a crystalline barrier that caught the remaining attacks. Then the ice cracked deliberately, and bullets of frozen magic shot through the fractures. Armor pierced, soldiers collapsed screaming.\n\nOasis watched his formation disintegrate in seconds, blood draining from his face.\n\n*Where did these monsters come from?*\n\nWere his soldiers just that weak, or were these two truly on par with Grid?\n\nNormally, Oasis would flee. Survival trumped pride. But he was Valhalla now. Abandoning his men was unthinkable. Besides, Courage burned in his veins, banishing fear.\n\n\"You!\" He drew his sword, activated Charge, and thundered toward Haster. Speed and momentum on his side—\n\nHaster's horn bow sang. The arrow caught Oasis' horse in the foreleg.\n\nThe world spun. Oasis' vision tumbled, then Haster's blade descended toward his throat.\n\nA voice—cold, mocking—echoed in his mind:\n\n*—You threaten no one. You're unqualified for my power. Our partnership ends today.*\n\nThe Undefeated King's sheath. Rejecting him.\n\n\"No—\" Oasis twisted mid-fall, contorted his body with desperation-fueled control he'd never possessed before. The blade missed by a hair's breadth. He hit the ground rolling, came up in a crouch. \"I won't lose anymore!\"\n\nHe wanted to matter. Wanted to prove that ordinary people could stand on that grand stage. His face blazed with determination as he raised his sword—\n\nBut reality didn't care about determination. Talent mattered. Experience mattered. The world wasn't kind to willpower alone. Not everyone could be the protagonist.\n\n> [You have suffered serious damage!]\n\n\"Kh—!\"\n\n\"OASIS!\"\n\nPain arrived late, announcement preceding sensation. Oasis stared down at the spear through his abdomen, mind blank with incomprehension. When? Who?\n\nHe turned his head slowly. The soldier in the military helmet. Haster. He'd circled behind, driven the spear through, then followed with his sword—a second, brutal puncture. Oasis' body began graying at the edges.\n\n> [You have died.]\n> [This is considered a defeat.]\n> [You have lost your qualification to become the Undefeated King's Descendant.]\n> [The voice of the Undefeated King can vaguely be heard.]\n> *—I like your heart.*\n> [The hidden class quest 'Undefeated King's Descendant' has changed to the '100,000 Army Swordsmanship' skill acquisition quest.]\n> *—A loser has his own oath. Shall we try a bit more?*\n\nLegendary classes had cruel requirements. Impossible to force, impossible to predict. But the S.A. Group wasn't sadistic—one failure didn't mean permanent loss. New opportunities emerged. In fact, Oasis' death had opened a more realistic path forward than before.\n\nMeanwhile, Haster turned to Asmophel. \"Thank you for the assistance. You're searching for the old generation of Red Knights, yes? I can help.\"\n\nDistant roars echoed from the capital. Valhalla's conquest war raged on.\n\n***\n\nSimultaneously, in the Overgeared Kingdom...\n\n\"I want to learn how to make jiangshi.\"\n\n\"Why?\"\n\n\"I want to be worthy of standing beside the one who gave me a second chance. I... I want a friend. I'm tired of relationships built on exploitation.\"\n\nGrid smiled at his welcome guest. \"You came to the right place.\""
}