{
  "id": 85,
  "title": "Chapter 85",
  "content": "# Chapter 85\n\n\"Isn't that Jishuka?\"\n\nA whisper rippled through the crowd. Grid didn't notice. He was too busy clutching at Regas's sleeve like a drowning man grabbing driftwood.\n\n\"That proud woman is squabbling like a child?\"\n\n\"I never thought I'd see the day...\"\n\nJishuka's jaw clenched. The muscles in her neck corded with tension. *My reputation is being destroyed in real-time, and this idiot doesn't even notice.*\n\nGrid remained oblivious. Hundreds of millions of won had vanished before his eyes—actual money, not just game currency. His mind had tunneled down to a single point: retrieve the Divine Shield. Nothing else mattered.\n\n\"Please lend me Regas!\"\n\nJishuka exhaled through her nose. \"...Fine.\"\n\nShe released Regas's ear and stepped back, crossing her arms. \"Do you know better than anyone what a desperate situation our guild is in right now?\" She looked at Regas directly. \"Do you have time to help strangers?\"\n\nRegas hesitated. His gaze bounced between Jishuka and Grid.\n\nGrid pressed forward. \"Regas, I'm begging you. You're the only one I can rely on.\"\n\n*The only one.* The words hung in the air.\n\nRegas grabbed Grid's hand. \"I'll help.\"\n\nSomething snapped.\n\nNot audibly. But Jishuka felt it—a sharp crack inside her skull where patience used to live. Every pair of eyes in the square swiveled to her. Grid and Regas didn't even glance her way.\n\n\"Thank you, Regas!\" Grid pumped the martial artist's hand. \"I'll consider you my lifelong benefactor!\"\n\n\"Haha, it's nothing.\" Regas puffed out his chest. \"After all, it's my responsibility to protect justice and help the needy!\"\n\n*Violence.* The word bloomed in Jishuka's mind, vivid and detailed. She could picture exactly how she'd make Regas regret this. But too many witnesses. Too many cameras. She forced her red lips into something resembling a smile.\n\n\"...Yes. You've decided? Okay. I understand. Good luck.\"\n\nHer voice came out flat. Dead.\n\nRegas bowed. \"I'm sorry! Please understand this once! I'll do this and then help you straight away!\" He turned to Grid. \"Now, let's go!\"\n\n\"Yes!\"\n\nThey left. Jishuka stood alone in the square.\n\n\"Choosing a guy he doesn't know over a friend of years...\"\n\nThe spectators weren't even trying to whisper anymore.\n\n\"Jishuka got rejected for a man...\"\n\n\"Not another woman. A *man*.\"\n\n\"Unbelievable...\"\n\nJishuka tuned them out. *I'm going to break both of them.*\n\nThen someone in the crowd said, \"But that guy, isn't he a blacksmith? The one who competed against that beauty in the item creation game?\"\n\n\"Oh, the one who teamed up with Khan for a two-on-one match but still lost?\"\n\nJishuka's eyes widened. *Khan's disciple?*\n\nThe Tzedakah Guild had been searching for him. If he'd competed with Euphemina, he'd know something about her whereabouts. But Khan had kept his identity locked down tight.\n\nShe opened her whisper interface. **[Regas! The man with you is likely Khan's disciple! I need to talk to you right away! Where are you now?]**\n\n> [The recipient has blocked all whispers.]\n\n\"...This bastard.\"\n\nRegas had blocked her. Of course he had. She pulled up the guild chat window, fingers flying across the holographic keyboard.\n\n**{Hey, Regas! Regas Regas Regas Regas Regas Regas Regas Regas Regas!}**\n\n**{Guild Master (-_-) Don't spam the chat.}**\n\n**{Shut up = _ = This isn't the time for jokes.}**\n\n**{T_T sorry sorry}**\n\n**{Regas! Can't you see the chat? Hey! Do you really want to die?}**\n\n**{If he's quiet in front of your bombardment, he must've blocked guild chat too. What happened? Did Regas get into another incident?}**\n\n**{Regas is with Khan's disciple! But he doesn't know that's who it is!}**\n\n**{Huh? Khan's disciple? -_-; How did that happen?}**\n\n**{Anyway, find Regas right now! If he's Khan's disciple, he'll have a clue about Euphemina!}**\n\nNone of them could imagine the truth. Khan's disciple wasn't just a source of information. He was the unknown craftsman they'd been hunting.\n\n***\n\n\"Hmm...\"\n\nGrid explained everything to Regas. Well, almost everything. He left out details that contradicted his blacksmith cover story. Regas only needed to know what the thief looked like.\n\n\"So you received a quest and went to Winston Castle, where a soldier suddenly turned into an old man and stole your item?\" Regas scratched his chin. \"You tried to chase him but lost the trail?\"\n\n\"Yes. Exactly.\" Grid nodded. \"A black aura emerged from the soldier's body, and he transformed...\"\n\n\"A black aura?\"\n\n\"Yes.\"\n\nRegas's expression grew serious. \"Doesn't it sound like someone from the Yatan Church?\"\n\nGrid frowned. *The Yatan believers are supposed to feel pain just touching the <span class=\"rarity-legendary\">Divine Shield</span>. But that old man held it in his bare hands.*\n\n\"I don't think he's a Yatan follower...\"\n\nRegas shook his head. \"It's definitely a Yatan follower. Those who deal with black magic have a 90% chance of being one. Let's search the nearby Yatan hideouts. If we clear them one by one, we'll find who robbed you.\"\n\nGrid added more context. \"Actually, the item he stole would deal massive damage to Yatan Church followers. But the old man handled it easily, so he can't be part of the church...\"\n\n\"If it was a high priest who transformed, he might resist the item's effects due to high faith.\"\n\n\"Really? Hmm...\" Grid considered it. \"Okay. I'll trust your judgment. By the way, where exactly are these hideouts?\"\n\nRegas scratched his head. \"I'm not sure. We just need to find them, right?\"\n\n\"......\"\n\nRegas was powerful. The Taekwon Master's combat strength was undeniable. But his tactical intelligence left something to be desired.\n\n***\n\n\"...This place?\"\n\nIrene woke in darkness. Complete, absolute darkness. Where was she? She couldn't tell. She felt like she'd been asleep for days. Her limbs were heavy, unresponsive.\n\nA voice cut through the confusion.\n\n\"Don't be afraid. Darkness is easy to adapt to. You'll soon realize where you are.\"\n\nHer eyes adjusted slowly. Shapes emerged from the black. Stone walls. A crude altar. A statue carved in mockery of divine form.\n\n\"The Yatan Temple!\"\n\n\"No.\" The man's voice held amusement. \"This is just a common cave. I decorated it to resemble a temple.\"\n\n\"You...?\"\n\nIrene found him kneeling before the statue of God Yatan. He turned his head, revealing a gaunt face with eyes like pits.\n\n\"I am Malacus.\"\n\n\"......!\"\n\nShe knew the name. Everyone on the continent knew the name.\n\nMalacus. God Yatan's Sixth Servant. The one who determined how many virgins would be sacrificed each year. One word from him controlled the lives of countless women across the continent.\n\n\"H-How did you...? Where are we? Why am I here?\"\n\nMalacus rose. He approached with measured steps, each footfall echoing in the cave. \"Winston Castle possesses the method to create the <span class=\"rarity-legendary\">Divine Shield</span>. I made a deal with a skilled blacksmith.\"\n\n\"......\"\n\n\"Light exists to be consumed by darkness. Do you know what happens when the <span class=\"rarity-legendary\">Divine Shield</span> is infused with dark magic?\"\n\nHis laugh was wrong—layered, as if two voices laughed simultaneously. Irene clutched Doran's ring with trembling hands.\n\n*Doran... Doran!*\n\nThe shadow who'd protected the Steim family for generations. Who'd saved her countless times since childhood. Gone now. The thought opened a void in her chest.\n\nShe remembered his final words. *'If you find the man who knows this ring, lean on him. He saved you this time... He'll be a great help if you keep him by your side. Be sure to keep him close.'*\n\nWhen would that man appear? Irene prayed silently. *Doran... please help me meet him.*\n\n***\n\nGrid gasped for breath at the base of Rolf Mountain. \"Pant... pant... what if all of this is in vain?\"\n\nA day had passed. They'd combed through every forest and mountain near Winston, searching for Yatan hideouts. Grid was exhausted, sleep-deprived, running on fumes. Regas looked like he'd just woken from a refreshing nap.\n\n\"If it's in vain, we just try another mountain.\" Regas smiled, wide and genuine.\n\n\"......\"\n\nGrid wanted to hit him. Under normal circumstances, he would have. But the <span class=\"rarity-legendary\">Divine Shield</span> consumed his thoughts. He followed without complaint.\n\nHalfway up Rolf Mountain, a notification appeared.\n\n> [Your persistence has risen.]\n\nGrid dismissed it. The message had appeared ten times already. Regas pointed ahead.\n\n\"This is the place.\"\n\nGrid followed his gaze. A large cave mouth gaped in the mountainside. Yatan followers stood guard—lots of them.\n\n\"The numbers aren't a joke... Aren't there at least thirty?\"\n\nWinston's army had launched several subjugation operations under Phoenix's command. The knight had carried the <span class=\"rarity-legendary\">Sword of Self-transcendence</span>, yet the Yatan Church remained this strong.\n\n*He really is incompetent,* Grid thought.\n\n\"Bring it on, you evil bastards!\"\n\n\"Wait—\"\n\nRegas shouted and leaped into the middle of the enemy formation.\n\n*He's insane!*\n\nGrid cursed internally, but Regas was already moving.\n\n\"Isn't this quite good? Gale Attack!\"\n\nHis legs became a blur. Wind howled. Yatan followers collapsed around him. One got back up, and Regas's grin widened.\n\n\"Okay! These guys are strong! Bring it on! Force Palm!\"\n\nThe sound of impact—flesh on flesh, bone on bone—echoed through the clearing. Thirty against one.\n\nGrid stared. *I need to regain my senses.*\n\nThe old man wasn't among the guards outside. He had to be deeper in. Grid moved toward the cave entrance while Regas held the Yatan followers' attention.\n\nHe stepped into darkness.\n\n\"I don't like uninvited guests.\"\n\nThe voice was wrong. Layered. Two people speaking in perfect unison. A notification blazed across Grid's vision.\n\n> [God Yatan's Sixth Servant, Malacus has appeared.]\n>\n> [The mighty dark power has applied fear, weakness, and immobilization effects.]\n>\n> [A legend doesn't feel fear easily.]\n>\n> [You have resisted all abnormal conditions.]\n>\n> [Malacus has unleashed a surprise magic attack.]\n\nBlack blades materialized from the cave—dozens of them, whistling through the air. Grid threw himself backward.\n\nOutside, Regas froze. The wave of dark power washed over him, pinning him in place. The magic blades found him before he could move.\n\nThe impact sent him sprawling.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \n**Check out my Patreon** for early access to a certain number of unedited chapters and to help achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}