{
  "id": 850,
  "title": "Chapter 850",
  "content": "Asmophel and Haster watched the Valhalla soldiers flee into the distance. Neither man moved to pursue. The villagers were safe—that mattered more than chasing down broken soldiers who wouldn't dare return.\n\nHaster pulled off the military helmet and held it out. \"You're certain about this? Leaving with me?\"\n\nAsmophel accepted the helmet, fingers closing around the familiar metal. \"You were protecting the cabin. Surely there was a reason.\"\n\n\"There was.\" Haster's gaze drifted back toward the small structure that had been his home for so long. Master Winfred's teachings had included skills that required 'meditation' to level properly—techniques that demanded stillness, patience, time. And his teacher had left final words: *A person of distinction will visit here.*\n\nThe skill levels had been achieved. The distinguished visitor had arrived.\n\n\"The time has come.\" Haster turned away from the cabin, from the memories it held.\n\nA notification flickered across his vision.\n\n[Affinity with Asmophel has increased by 10.]\n\nWarmth bloomed in Asmophel's chest—an unfamiliar sensation for one who had walked such a cold path. \"Winfred's disciple at my side. I suspect we'll complement each other well on the road ahead.\"\n\n\"I believe so too.\"\n\nThe moment Haster spoke, a transparent orange barrier materialized around him, shimmering like heat haze.\n\n[All resources restored through the passive skill 'Heroic Story.' For one minute, defense increases proportional to resources expended in the previous two minutes. Additionally, a shield that negates all skill and magic damage will persist for 10 seconds.]\n\n***\n\n[Jiangshi Recipe]\n\n[Category: Skill Book (Unique)\n\nAn ancient manual detailing the creation of steel jiangshi.\n\nRequirements: Daoist, Necromancer.]\n\nSkills came from two primary sources in Satisfy. The first: class advancement, granted automatically as levels accumulated. The second: discovery—hidden quests, ancient manuals, forgotten techniques.\n\nThe second category commanded far greater value. Class skills were inevitable. Quest skills were *scarce*. And the higher a skill's rating, the more astronomical its worth became.\n\nA unique-rated skill book would sell for billions of won at auction. Easily. The rankers had accumulated fortunes over the years, their hunger for advantages only growing sharper. Supply, meanwhile, remained brutally limited. Every month that passed saw Satisfy's premium items appreciate in value.\n\nBullet stared at the book in Grid's hands, his mind refusing to process what he was seeing. \"You're... giving this to me?\"\n\nThe second-ranked necromancer had been ignored by Agnus, used and discarded by Veradin as Immortal crumbled. He'd expected many things when Grid summoned him. Not *this*.\n\n\"I thought—when you mentioned jiangshi production, I assumed you meant consumable items. Summoning scrolls, ritual components. Not a *skill*.\" His hands trembled slightly. \"Why me?\"\n\nThe question carried weight. Wariness flickered behind Bullet's eyes—the caution of a man who'd learned that generosity often carried hidden costs.\n\n\"If you want information about Agnus in exchange, you'll be disappointed. I don't know anything meaningful about him. And even if I did...\" Bullet's jaw tightened. \"I wouldn't speak. I've seen what he does to people who cross him. I'm sorry.\"\n\nHe bowed deeply, the gesture carrying genuine regret.\n\n*Another bond I'll fail to forge.* Bitterness welled up as he stared at the ground, waiting for Grid's anger. After all, from the King's perspective, Bullet was protecting an enemy.\n\nInstead, Grid scoffed. \"Why are you inventing problems? Who said anything about Agnus?\"\n\n\"...What?\"\n\n\"I want you as an ally. Consider the skill book a signing bonus.\"\n\nGrid knew his own strength. He trusted his guild members—specialists in their respective fields, competent and growing stronger by the day. But trust wasn't the same as complacency. His pursuit of Merchant King Kir hadn't been about eliminating a future threat.\n\nIt had been about *preparation*.\n\nThe Overgeared Kingdom's unique development path would eventually isolate them. Grid could feel it coming—the moment when every established power would view his kingdom as a threat to the old order. When that day arrived, individual strength wouldn't be enough.\n\nHe needed exceptional people.\n\nBullet fit that criterion perfectly.\n\nBesides, how long would Grid let a unique skill book gather dust in his inventory? The Overgeared Kingdom needed a talented necromancer. Unfortunately, most of the ranked necromancers belonged to Immortal—inaccessible until now. Finding Bullet, the second-ranked practitioner, unaffiliated and available? That was fortune itself.\n\n\"I heard what happened with Immortal. With Veradin.\" Grid's expression remained steady. \"Agnus abandoned you all when it mattered. He didn't show his face once while Immortal burned.\"\n\n\"...\"\n\nGrid had witnessed Bullet's confrontation with Veradin—had seen the ideals the necromancer championed, the principles he refused to compromise. Those ideals aligned with what the Overgeared Kingdom represented.\n\n\"Join us. We need you. *I* need you.\"\n\n\"...\"\n\nGrid's gaze didn't waver. There was no calculation in those eyes, no hint of someone seeking to exploit strength or extract value. Only certainty—the kind that came from genuine conviction.\n\n*He means it. Despite everything, despite us being enemies...*\n\nSomething tightened in Bullet's chest. Respect, different from what he'd felt toward Agnus. Warmer. \"Thank you. I'll prove your faith wasn't misplaced, Grid.\"\n\nStill, one matter needed clarification. \"But I'll purchase the skill book at fair market value. I can't accept something this valuable as a gift.\"\n\nHe'd watched too many relationships disintegrate over money. Better to establish clear terms from the beginning—no room for future resentment.\n\nGrid shook his head. \"No.\"\n\n\"But—\"\n\n\"This came from the East Continent.\" Grid's expression grew serious. \"From the Chief of the Lava Prison in the Cho Kingdom. Do you understand what that means? This skill book is irreplaceable. Unique. There's no second copy, no alternate source.\"\n\nHis eyes glinted with something predatory. \"Can you really put a price on that?\"\n\n\"...\" Bullet's mouth opened, then closed. The man had a point.\n\nGrid's smile turned wicked. \"I'll accept your life as payment instead. You can never leave my side in the future.\"\n\n\"What if I learn the skill and run?\"\n\n\"You've seen what happens to those under our kill order. I'll follow you to hell itself.\"\n\n\"Haha...\"\n\nBullet considered retreating right now, before this became too real. But temptation pulled harder than caution. The prospect of a genuine bond, of belonging somewhere that valued him...\n\n[Necromancer 'Bullet' has joined Overgeared Guild One!]\n\n***\n\n[The 'Jiangshi Recipe' has been acquired.]\n\n[Skill unlocked: Jiangshi Production]\n\n[Skill unlocked: Coffin Production]\n\n[Skill unlocked: Jiangshi Control]\n\n[Jiangshi Production Lv. 1]\n\n[Converts a human corpse into a jiangshi. Cannot be produced from non-human species, monsters, or animals.\n\nIf the corpse's level exceeds the creator's level, production fails.\n\nSteel jiangshi begin at level 100. Maximum level: Creator's level minus 100.\n\n* Higher skill levels unlock additional jiangshi varieties.\n\nMana Cost: 100% maximum mana.\n\nCooldown: None.]\n\n[Coffin Production]\n\n[Creates specialized coffins for jiangshi storage and control.\n\nOne coffin required per jiangshi.\n\nMana Cost: 1,000\n\nMaterials Required: 12 iron spikes, 3 birch logs.\n\nProduction Time: 1 hour 30 minutes.]\n\n[Jiangshi Control Lv. 1]\n\n[Passive.\n\nMaximum active jiangshi: 2\n\nActive Duration: 3 hours per deployment. Requires 3 hours rest in coffin afterward.\n\nDeath Recovery: 12 hours rest in coffin.]\n\n*This is incredible.* Bullet absorbed the skill information, mind racing through the implications. *These could become as valuable as death knights.*\n\nThe level limitation seemed restrictive at first glance, but higher skill levels would almost certainly expand that cap. Which meant jiangshi qualified as top-tier undead—potentially rivaling the most powerful summons available.\n\n\"These are high-grade undead...\" Bullet breathed.\n\n\"Told you. East Continent rewards aren't trivial.\"\n\nGrid remembered the black-horse jiangshi that had commanded Lava Prison—a monster that would slaughter ordinary players by the dozen. If Bullet could field multiple specimens of that caliber...\n\n\"Work hard, Bullet. Whatever support you need, you'll have it.\"\n\n\"I won't let you down!\" The words burst out, raw with emotion. Bullet could already envision it—regular undead consuming his dominance stat, jiangshi operating independently, an army that could match Agnus's forces...\n\nThe thought sparked ambition. \"I'll need a new necklace.\"\n\nHis current accessory—crafted from crow bones with an amethyst centerpiece—boosted his dominance stat considerably. But with this new direction, he could afford to upgrade. *Should* upgrade.\n\n\"Necklace?\" Grid's interest sharpened. \"You know a quality jewelry maker?\"\n\nThe jewels from the Belial raid still cluttered his inventory—precious stones with extraordinary effects, completely useless without someone skilled enough to work them.\n\nBullet nodded. \"I have connections with Princess.\"\n\n\"Princess?\"\n\n\"That's what necromancers call her. There's a master jewelry maker living deep in the Gerad Mountain dungeon. She only crafts necklaces, and her attitude...\" Bullet grimaced. \"Let's just say the nickname fits.\"\n\n\"Introduce me.\"\n\n\"That'll be difficult.\"\n\n***\n\nThe day Grid and Bullet joined forces, Satisfy's community forums exploded.\n\n**—Necromancer Rankings—**\n\n**1st place – Veradin (Independent)**\n\n**2nd place – Bullet (Overgeared Guild)**\n\n**>> After Muto, now Bullet?**\n\n**>> The 2nd ranked necromancer joined Overgeared... this changes everything**\n\n**>> Wasn't Bullet part of Immortal?**\n\n**>> He got wrecked by the kill order and surrendered. Joined the winning side.**\n\n**>> No spine. Immortal should consider him a traitor.**\n\n**>> Are you seriously criticizing him for choosing survival? What's wrong with you?**\n\n**>> Overgeared's army + undead legions...**\n\n**>> Even if the Seven Guilds reunited, they couldn't challenge Overgeared anymore**\n\n**>> Obviously. Didn't the Seven Guilds get slaughtered by Overgeared farmers last time?**\n\n**>> Oh right lmao that happened**\n\n**>> What about Zibal and Seuron these days?**\n\n**>> Those guys can't do anything but watch Overgeared members from the sidelines**\n\n**>> And Agnus?**\n\n**>> Agnus is too unpredictable to track...**\n\nDiscussion naturally gravitated toward legends—current powerhouses, fallen champions, rising stars. And after Agnus achieved legendary status, public fascination with him had only intensified.\n\n\"Kikikik!\" A single player approached the massive formation known as Gerad Mountain—home to six artificial dungeons, each a complex labyrinth of manufactured challenges.\n\nEat Spicy Jokbal froze, horror dawning across his features as he confirmed what his instruments were detecting. The dungeons were being destroyed. Systematically. Rapidly.\n\nFar faster than Grid had managed during his rampage.\n\n\"Grid?\" No. Impossible. This destruction operated on an entirely different scale.\n\n\"A dragon...\" The word escaped as barely a whisper.\n\nEat Spicy Jokbal ran toward Gerad Mountain, dread building with every step."
}