{
  "id": 851,
  "title": "Chapter 851",
  "content": "> [An intruder has appeared in the 'Gerad 1st Dungeon'.]\n\nThe warning flickered across Eat Spicy Jokbal's vision. What came next made his blood run cold.\n\n> [The Gerad 1st Dungeon's first zone has been completely destroyed!]\n> [The Gerad 1st Dungeon's second zone has been completely destroyed...]\n> [The Gerad 1st Dungeon's third zone...]\n> [The Gerad 1st Dungeon has been completely destroyed!]\n\n\"Impossible.\"\n\nSix dungeons. He'd installed six dungeons throughout Gerad Mountain, each one meticulously designed to repel invaders. A single dungeon, obliterated in minutes?\n\nNot even Grid could clear a dungeon this fast. And the Gerad Dungeons were significantly harder than that Beware Dogs dungeon Grid had demolished. No player should be capable of—\n\nThe image of massive wings blotting out the sun flashed through his mind. The National Competition. The dragon.\n\n\"It's a dragon! It has to be!\"\n\n> [An intruder has appeared in the 'Gerad 2nd Dungeon'.]\n\nHis theory died before he could finish the thought.\n\n\"Not a dragon. Dragons don't need to enter through the front door.\"\n\nThe attacker was moving sequentially through the dungeons, following the path like any other player. Eat Spicy Jokbal's hands shook as he pulled out potions from his inventory. Whoever—*whatever*—was coming, it was heading straight for the top of Gerad Mountain.\n\nStraight for the Princess.\n\nHe ran.\n\n***\n\n> [You have entered the Gerad Dungeon (4).]\n> [The traps have been activated.]\n\nSpears erupted from the walls like hungry teeth. Above, a massive iron sphere—hundreds of kilograms of death—plummeted toward the corridor floor. Enough firepower to slaughter an army.\n\nAgnus didn't even flinch.\n\n\"Pathetic.\"\n\nBeside him, Lich Mumud gestured lazily. A shimmering shield materialized around them both, lifting them into the air as if gravity were merely a suggestion. The spears struck the barrier and shattered like glass. The iron ball bounced off harmlessly, rolling away with a hollow *thunk*.\n\nAgnus stepped onto the fallen sphere, surveying the narrow corridor ahead. His lips curled into a grin.\n\n\"A chokepoint. How *delightful*.\"\n\nThe dungeons were adapting. The first two had been spacious enough to flood with undead, overwhelming through sheer numbers. But the third had constricted, forcing him to be more... creative. This fourth one seemed determined to make things even more interesting.\n\nNot that it mattered. Agnus had seen far worse in his adventures. Though he had to admit—these Gerad Mountain dungeons had teeth.\n\n*Can't waste Mumud's power on this,* he thought, studying the path ahead.\n\nA flick of his fingers. A skeleton crawled from the ground, bones clicking together like a macabre puzzle. It lurched forward at his silent command, taking its first tentative step onto the narrow walkway.\n\nFire erupted, engulfing the skeleton. It kept walking, flames licking at its bones, feeling no pain because it had no nerves to feel with. Four steps. Then more fire roared to life and incinerated it completely.\n\n*Fixed damage, five thousand per four blocks.*\n\nAnother flick of his fingers. Another skeleton appeared at the fourth block marker where the first had fallen. This was Death Chain—the unique skill only Baal's Contractor could wield. Where one undead died, another was born.\n\nThe second skeleton reached the eighth block before the flames consumed it. A third materialized, pressing onward to the twelfth and final block.\n\nThe explosion nearly deafened him.\n\n> [Your skeleton has received 20,000 damage and has been destroyed.]\n\nThe blast ripped through the entire pathway. Fire traps detonated in sequence, a cascading chain of destruction that shook the dungeon to its foundations. Dust and debris rained from the ceiling.\n\nAgnus stood far enough back that the shockwave merely ruffled his hair.\n\n\"Kilkik!\" His laugh echoed through the ruined corridor. He strolled forward leisurely, already summoning the next skeleton for whatever trap lay ahead.\n\nThis was almost *fun*.\n\n***\n\nAt the summit of Gerad Mountain, in a workshop barely larger than a closet, Elizabeth worked alone.\n\nDark eyes peeked out from beneath her bangs, too large for her doll-like face. Her hands moved with practiced precision over the jewelry spread across her workbench.\n\nThe whisper notification chimed.\n\n*—Eat Spicy Jokbal: There is an enemy! Log out right now!*\n\nElizabeth's hands never stopped working.\n\n*—Eat Spicy Jokbal: Hey! Bokja!*\n\nHer fingers froze. Blood rushed to her temples, hot and furious.\n\n*—Elizabeth: Stupid uncle! I told you not to call me by my real name!*\n\n*—Eat Spicy Jokbal: It's because you didn't answer! Why are you biting my head off?!*\n\nEven through text, she could hear the panic in his voice.\n\n*—Eat Spicy Jokbal: The fifth dungeon is about to be breached! Log out right now!*\n\n*—Elizabeth: I don't want to!!*\n\nShe glared at the workbench, at the half-finished pieces scattered across it. This workshop contained everything—her tools, her materials, years of accumulated resources. How dare he ask her to abandon it?\n\nElizabeth wasn't some legendary class holder who could pump out myth-rated items while taking a nap. She was a jewelry maker who'd ground her way up from nothing. Thousands of normal-rated pieces to learn the basics. Hundreds of rare-rated ornaments to refine her skills. Dozens of epic pieces to prove her worth.\n\nEvery item she created carried her pride.\n\n*—Elizabeth: I don't know who's coming, but they obviously need my skills. They might be trespassing, but it's only right that I respond as a craftsman. You want me to run away from my own workshop?*\n\n*—Eat Spicy Jokbal: It's fine if they're a player! But...!*\n\nShe could almost see him struggling with the words, trying to articulate the fear she could sense bleeding through the whisper.\n\n*—Eat Spicy Jokbal: Bokja...!*\n\nElizabeth's expression softened. She knew what he was thinking. Uncle had watched her struggle to raise her production class, seen her pour countless hours into mastering her craft. But more than that—he just didn't want her to get hurt. To face threats and violence.\n\nShe appreciated it. She really did.\n\nBut this was her workshop.\n\n*—Elizabeth: The illegal intruder is a player.*\n\nA pause. Then:\n\n*—Eat Spicy Jokbal: What? A player? Are there hundreds of them?*\n\n*—Elizabeth: No, just one.*\n\n*—Eat Spicy Jokbal: This isn't the time to joke around!*\n\n*—Elizabeth: His ID is Agnus.*\n\nSilence. For three full seconds, no response came. Elizabeth almost smiled despite her nervousness. She could picture her uncle's face perfectly—frozen in horror, every worst-case scenario flooding through his mind at once.\n\n*—Eat Spicy Jokbal: Close your eyes and cover your ears! Don't interact with that madman!*\n\nElizabeth rolled her eyes. She was starting university, not kindergarten. Still, her finger hovered over the whisper menu.\n\nOne click.\n\n> [The target has blocked your whispers.]\n\nLet him panic a little. Maybe it would teach him not to use her real name.\n\n***\n\n\"You're invading illegally without following proper procedures.\" Elizabeth kept her voice steady, though her palms were slick with sweat. \"Can a famous person act so violently?\"\n\nShe wasn't about to show fear. This was *her* workshop. Her territory.\n\nAgnus approached slowly, each footstep deliberate. His face held none of the madness from the rumors—just the cold, focused intensity of a predator sizing up prey.\n\n\"Procedures take too long.\"\n\nElizabeth's back hit the workbench. She'd run out of room to retreat.\n\nAgnus pulled something from his inventory. A red stone, more vibrant than any ruby, almost pulsing with inner light.\n\n\"This.\"\n\nElizabeth's breath caught in her throat. She recognized it instantly, and the beauty of the gem turned her stomach.\n\n\"The Stone of Life...!\"\n\nStone of Life—such a benign name for something so profoundly evil. Created by murdering a virgin, sealing six hundred and sixty-six souls inside her dead heart. A monument to suffering given physical form.\n\n\"You recognize it.\" Something flickered in Agnus' eyes. Hope? Expectation? Emotions that shouldn't exist on the face of someone holding such a cursed object. \"You can work with it?\"\n\nElizabeth forced herself to meet his gaze. \"What do you want to do with that thing? Planning to use it with the Amethyst Shield and Red Mirror to summon a high-ranking great demon?\"\n\n\"No.\" The denial came instantly, almost offended. \"I didn't struggle this much for something so *trivial*.\"\n\n\"Then what else—\"\n\nHis hand shot out, grabbing her collar. Elizabeth gasped, more from surprise than fear. But then she noticed something odd.\n\nHis grip wasn't tight. Barely any force at all, really. And his eyes—\n\n\"You just have to do what I say.\" Agnus' voice was raw, stripped of pretense. \"You have no right to reject. I'll chase you for the rest of your life until you accept my commission.\"\n\n\"You have no manners!\" Elizabeth's protest died on her lips as she really *looked* at him. At the desperation carved into every line of his face, the barely contained anguish lurking behind those predatory eyes.\n\nCould a human being make such an expression?\n\n\"You...\"\n\n\"**You bastard!!**\"\n\nThe workshop door exploded inward. Eat Spicy Jokbal stood silhouetted in the entrance, sword already drawn, face contorted with rage.\n\n\"Get your hands off her right now!\"\n\n> [You have become stronger in a dungeon!]\n\nHe charged forward like a man possessed.\n\n***\n\n\"...Hey.\"\n\nGrid had been staring at the same cluster of trees for the past three hours. The ward Bullet kept insisting was \"just ahead\" remained conspicuously absent.\n\n\"Are you *sure* this is the way?\"\n\nBullet's shoulders slumped. \"...I'm sorry.\"\n\nGrid said nothing.\n\n\"Don't worry! We'll arrive soon. Probably.\"\n\n\"...\"\n\nDespite the frustration of walking in circles, Grid found himself grudgingly impressed. Bullet had maintained his second-place ranking among necromancers while possessing a sense of direction that could only be described as *catastrophically* bad. \n\nIf Bullet could actually *find* hunting grounds on the first try? He'd be rank one, no question.\n\nThe thought sustained Grid through another hour of following Bullet's increasingly uncertain navigation. They passed the same distinctive rock formation. Again. For the fourth time.\n\nAt least Grid wasn't wasting the journey. His hands moved automatically, crafting underwear as he walked, muscle memory allowing him to maintain production while his feet followed Bullet in endless circles.\n\n*I wonder if I can master directional crafting,* Grid mused. *Make items while walking backwards. Now that would be efficient.*"
}