{
  "id": 852,
  "title": "Chapter 852",
  "content": "Eat Spicy Jokbal had made a habit of purchasing intelligence from the top rankers in every class—a practice dating back to his Blood Carnival days. The sheer volume of information at his disposal made him far more dangerous than most people realized.\n\n\"Get your fucking hands off her!\" \n\nA green aura flared around his body as he charged. Mithril longsword and armor gleamed under the dungeon's harsh lighting, every piece of equipment specifically chosen for fighting the undead. He'd come prepared for exactly this scenario—for Agnus to be the intruder. Years spent building the Blood Carnival's arsenal meant he had the right tool for every job. The legendary-rated Lua's Blessing and unique-rated mithril armor tore through the skeletal horde like parchment, dozens of summoned undead crumbling to dust.\n\nThe Dungeon Maker class thrived in enclosed spaces, and against the undead, his battle gear created devastating synergy.\n\n\"Kik? Strong ones everywhere I look.\" Agnus' smile never wavered, his grip on Elizabeth's collar casual. Relaxed.\n\nThat arrogance made Eat Spicy Jokbal's blood boil. The bastard still held his niece. He closed the distance, hungry to wipe that smirk off Agnus' face.\n\n*Clack! Clack clack!*\n\nSkeletal hands erupted from the ground, grasping at his legs. Skeleton warriors—the kind of summons that gave most rankers nightmares. High dominance cost, exceptional combat ability. Even third-advancement necromancers could only maintain two at once.\n\nAgnus had summoned four.\n\nThe undead swarmed him, cutting off escape routes. Anyone who'd watched Eat Spicy Jokbal dominate at the National Competition would've found this scene impossible to believe. Yet here he was, isolated and struggling. The pressure forced Agnus' hand—he released Elizabeth's collar.\n\n\"Sprinkle Cement!\"\n\nOne skill. Four skeleton warriors locked in place, immobilized. Eat Spicy Jokbal burst forward, chaining directly into Cutting Bricks. If Agnus had still been holding the girl, the razor-sharp strikes would've carved through them both.\n\nInstead, Agnus slipped away, body twisting clear of the assault. Laughter echoed off the dungeon walls. \"Kuk! Kukukuk! Kuhahat! You're one of them too?\"\n\n\"What the hell are you talking about?\"\n\n\"The monsters who can split the game into point-one-second increments. Kikik!\" Agnus drew his sword, the Supreme Ruler passive activating instantly. Pressure crashed down like a physical weight.\n\n*Just like the intel said.* Eat Spicy Jokbal's jaw tightened as he caught the blade. Fast. Brutally strong. Absurd for a necromancer. But foreknowledge kept him steady, let him adapt. Information was the difference between victory and death.\n\nMost players lost to Agnus because they couldn't predict him. But even with accurate intelligence, there was still one problem.\n\nAgnus evolved.\n\n*What?* The color drained from Eat Spicy Jokbal's face after their fourth exchange.\n\n>**[Lua's Blessing has received a demon's curse.]**\n>**[The divine power of Lua's Blessing has temporarily vanished.]**\n>**[The durability of Lua's Blessing has decreased by 27.]**\n>**[The attack power of Lua's Blessing has dropped by 50% for 20 seconds.]**\n\nA skill? Or was the curse embedded in the weapon itself? He blocked another strike, then another, watching his legendary blade lose its holy radiance. \n\n\"Brought a divine sword to punish the villain?\" Agnus' voice dripped with mockery. \"How thoughtful.\"\n\nThis bastard had prepared for divine weapons. Eat Spicy Jokbal's weakened blade punched through Agnus' abdomen while the heavy sword tore into his shoulder. The wounds looked worse on Eat Spicy Jokbal's side, but the actual damage was nearly identical.\n\nThe Supreme Ruler's rune inscription and Sword Mastery couldn't bridge the fundamental stat gap. But Dungeon Maker was a class built on grinding—on hard labor. His **strength** and **stamina** rivaled Grid's raw numbers. Even with the weapon debuffed, his attacks still carried serious power. The divine armor held firm.\n\nThe real problem? Agnus wasn't fighting alone.\n\nA chill ran down Eat Spicy Jokbal's spine. He ignored Agnus' incoming strike, whipping around. The death knight was moving, raising a sword wreathed in violet energy. He took the hit from Agnus to brace for the death knight's assault, pain lancing through his body as notification windows flooded his vision.\n\n>**[Soseosan's Mithril Armor has received a demon's curse.]**\n>**[Soseosan's Mithril Leggings has received a demon's curse.]**\n>**[The divine power of Soseosan's Mithril Armor has temporarily vanished.]**\n>**[The divine power of Soseosan's Mithril Leggings...]**\n>**[The durability of Soseosan's Mithril Armor has decreased by 47.]**\n>**[The durability of Soseosan's Mithril Leggings...]**\n>**[The defense of Soseosan's Mithril Armor has decreased by 20% for 20 seconds.]**\n>**[The defense of Soseosan's Mithril Leggings...]**\n\n\"What?!\"\n\nThe curse infected armor too?! The death knight's blade crashed down toward his skull.\n\n\"Kuk!\"\n\nThe collision sent shockwaves through the dungeon, dust raining from the ceiling. Agnus and the death knight pressed their advantage, strikes coming in rapid succession. Each blow shaved chunks off his health bar. He tried to counter, but the low-probability debuffs turned every attempt into a gamble. Helpless.\n\n\"Uncle!\"\n\nElizabeth's scream cut through the chaos. This man had raised her when her parents and grandparents couldn't. Friend, mentor, guardian—the foundation of her world. She couldn't bear to see him like this, beaten and struggling. Game or not, watching him suffer tore at her heart. And the death penalty... if he died here...\n\n\"I understand!\" Her voice cracked. \"I'll accept your request! Just leave him alone!\"\n\nAgnus paused. The death knight's sword stopped mid-swing.\n\nAnd Eat Spicy Jokbal exploited the opening.\n\n\"Looking away mid-fight? Big mistake. I'm a dirty fighter.\"\n\n\"...?\"\n\nThe dungeon lurched. Stone groaned and cracked as the entire structure began to shift. Floors rose and fell like breathing lungs, ceiling segments rotating wildly, walls sliding into new configurations. The Dungeon Remodeling skill—unlocked at level 325.\n\n>**[Dungeon Remodeling Lv. 1]**\n>**Temporarily change the internal structure of a dungeon that you created. The structure change is random, and all objects in the dungeon won't be able to resist the 'confused' or 'isolated' state. The caster himself can't avoid this effect.**\n>**★ Locations set as critical points will be preserved and won't be affected by the remodeling.**\n>**★ The changed dungeon can be restored to its normal structure at any time.**\n>**Skill Mana Consumption: 20% of current mana.**\n>**Skill Cooldown: 6 hours.]**\n\nEven the caster wasn't immune. Massive variables, unpredictable outcome. But when you're already cornered, you might as well flip the board.\n\n\"U-Uncle... dizzy...\"\n\n\"Kuk...!\"\n\nVision swam. The world tilted sideways, blurred at the edges. Agnus' legendary class gave him resistance—an unexpected complication—but the Gel-Dena Ring Elizabeth had crafted accelerated their recovery. Uncle and niece shook off the confusion faster.\n\n\"Bokja!\"\n\n\"Uncle!\"\n\nThey grabbed each other and ran. Walls moved between them and Agnus, creating barriers, buying precious seconds. They sprinted for the exit. Elizabeth abandoned any thought of saving her workshop. Losing the space hurt, but not as much as losing family. They thought they'd escaped.\n\nThey were wrong.\n\n\"Kik! Kikikik!\" Agnus' laughter echoed through the shifting corridors. He staggered upright, shaking off the disorientation. \"Demon Summoning!\"\n\nBaal's Contractor. The name wasn't just for show—he had a contract with the First Great Demon.\n\n\"Dyulebul.\"\n\nPeople focused on his necromancy, but the true power of Baal's Contractor lay in demonic summoning and control. It only fully manifested after the class evolved to legendary rating. The summoned demon opened its maw and unleashed a searing ray of energy.\n\n\"Bokja!\"\n\nEat Spicy Jokbal threw himself over his niece, his clothes burning away as the attack struck them both.\n\n***\n\n*Does Youngwoo even know?*\n\nYura's thoughts churned as she escaped hell's borders, exhaustion weighing on every step. The Grid NPC she'd encountered down there—it had to be connected to the real Grid. But he'd never mentioned it. If he knew about an NPC duplicate running around hell, he would've warned her before she went down. Wouldn't he?\n\n*I should tell him.*\n\nShe wouldn't demand explanations, but he deserved to know there was an NPC that looked exactly like him when using Blackening, lurking in the depths of hell.\n\n*Then I'm taking a few days off.*\n\nMonths trapped in hell had drained her. Physical rest could restore the body, but the mind? That took longer. The barren wastelands, the oppressive atmosphere—it had hollowed her out inside.\n\nThe worst part was reaching level 320 without feeling any stronger. Her Demon Slayer class refused to shine, power always just out of reach. Compared to the other legends, she felt like a pale imitation. Shame burned in her chest.\n\n*In hell, I can keep pace with the Sword Saint and Pagma's Descendant. But...*\n\nHell wasn't the only stage. She couldn't spend the rest of her Satisfy career trapped down there. And outside hell? The other legendary classes dominated anywhere, anytime. She was falling behind.\n\n*Will completing all the class quests change things? But Youngwoo hasn't finished his either... Maybe I missed a hidden quest?*\n\nHer steps dragged as she approached Reinhardt. Heads turned, eyes tracking her beauty. It grated. She didn't want to be valued for her appearance—she wanted recognition for her skill. For her power.\n\nThen opportunity arrived.\n\n>**[A demon has emerged in the human world! It is a high-level demon dependent on dark and powerful magic.]**\n>**[The new skill Demon Tracking has been opened.]**\n>**[The fourth class quest 'Old Enemy' has been created.]**\n>**[Defeat Baal's Contractor!]**\n\n\"Gerad Mountain!\"\n\nClose. So close she could reach it before anyone else. Joy sparked through her exhaustion as she broke into a run. Agnus matched Grid in terms of reputation and threat level, but as a Demon Slayer? This was her arena. Perfect matchup. She had a real chance.\n\nMeanwhile...\n\n\"Is this the right way?\"\n\n\"That's the third time you've asked. Relax. We'll get there safe and sound.\"\n\n\"...\"\n\n\"Again, I apologize for wasting your time. I'm truly sorry.\"\n\n\"...I'd be cursing if you didn't look so pathetic.\"\n\n\"...\"\n\nGrid and Bullet continued their aimless wandering. Surprisingly, Grid's irritation had faded. He crafted underwear during the journey, productive despite being lost. And after hours of conversation, he'd found common ground with Bullet. Their relationship had actually improved."
}