{
  "id": 853,
  "title": "Chapter 853",
  "content": "**[Status Window]**\n\n> **[Dyulebul]**\n> \n> **Health:** 100,001\n> \n> An ordinary hellfire lizard from the Hellfire River, transformed into a higher demon after being struck by the saliva of the 1st Great Demon, Baal, during his picnic.\n> \n> * Baal's influence corrupted Dyulebul's salivary glands. Dyulebul spits concentrated rays of light every 5 seconds.\n> \n> * Each spit inflicts 2,000 fixed damage to the primary target and 8,000 splash damage within a 10-meter radius.\n> \n> * Dyulebul's skin remains partially evolved, causing it to take 2,000 fixed damage from any strike regardless of strength.\n> \n> * Dyulebul's tail rotates continuously, radiating hellfire that deals 3,000 fire damage to all enemies within range. Inflicts an additional 699 burn damage per second.\n\nThe creature loomed before them—a grotesque fusion of human torso and reptilian head. Its elongated tail, tipped with living flame, whirled in endless circles like some demonic hula hoop.\n\n\"A demon?\" Dark's blood ran cold. He'd never imagined players could summon such creatures. Then again—his eyes flicked to Agnus—the man *had* contracted with Baal himself. Strange that the 1st Great Demon's agent had been limited to undead until now. This must be what legendary advancement truly meant.\n\nDyulebul soared over Dark and Elizabeth's heads. Light gathered in its gaping maw—concentrated magical power masquerading as saliva.\n\n\"Stop struggling if you value your lives.\" Agnus's grin was sharp. \"Kik.\"\n\nThe demon was less versatile than death knights or liches. Its attack patterns were primitive, designed purely for slaughter. Its intelligence barely registered—it followed the basest instinct to kill humans and ignored most commands.\n\nBut raw power compensated for every shortcoming.\n\nTwo thousand fixed damage and eight thousand splash at range. Flames that denied close combat. And above all, that monstrous health pool. One hundred thousand health at 2,000 damage per hit meant fifty-one strikes minimum to kill it. Legendary skills were worthless against such numbers.\n\nA nightmare scenario for any player. Group tactics could overwhelm it eventually, but Agnus could simply summon undead to split aggro across the battlefield.\n\n\"Move!\"\n\nThe first ray tore through the dungeon. Stone cracked. Supports groaned. As the demon's maw lit up again, Dark shoved Elizabeth aside and took the blast head-on.\n\n> **[You have suffered 20,000 damage!]**\n> \n> **[You have suffered 8,000 damage!]**\n\nDark's health plummeted. He collapsed, gasping, vision swimming. Agnus hadn't even summoned his liches yet—those legendary undead that were supposed to be his true strength. Every scrap of intelligence Dark had gathered felt worthless now.\n\nAgnus's rebirth as a legend had rendered all previous data obsolete.\n\n*Am I weaker than Grid?* The thought arrived with bitter irony. When had Grid become his measuring stick? *I thought I hated that guy...*\n\nStrange. The more he reflected on it, the more Dark realized the hatred had faded. Maybe that shared ordeal at the National Competition had changed something fundamental between them.\n\nDyulebul's maw blazed again.\n\n\"Uncle!\" Elizabeth's scream pierced the dungeon as light flooded toward him. Regret twisted her features. If she'd only listened, if she'd just run when he'd told her to—\n\nDark read her expression even as death approached.\n\n\"This isn't your fault!\" His voice carried no anger, no resentment. Only love. \"The outcome would be the same! He'd have waited here forever! Remember what our family always says—don't regret the past!\"\n\nThe third ray fired.\n\n\"Noooo!\" Tears streamed down Elizabeth's face as her uncle—her Superman—collapsed. Her legs gave out.\n\nAgnus's voice cut through the settling dust. \"Give up. Create the Stone of Life. You have no other choice.\"\n\n\"Why—\"\n\n\"Refuse me, and you'll die hundreds of times. Thousands. Do you want that hell?\"\n\nNo humor touched his face. Only grim desperation. After achieving legendary status, Agnus had finally gained the creation skill needed to resurrect *her*. But the Stone of Life was essential to complete the ritual. Resurrection—a word that would make anyone laugh. Yet Agnus had never been more serious.\n\nSilence stretched heavy.\n\nDark should have been crushed beneath fallen stone after that third blast. Instead, his roar shattered the stillness.\n\n\"That's no way to ask for a favor!!\"\n\nHe erupted from the rubble and sprinted toward Elizabeth.\n\n\"U-Uncle?\" Confusion replaced relief on her tear-stained face.\n\nDark grinned. \"Isn't your uncle invincible?\"\n\n> **[You won't die easily in your own dungeon. You can resist all attacks for 2 seconds at minimum health.]**\n> \n> **[The dungeon escape skill 'Emergency Exit' has been activated.]**\n\nThe Dungeon Maker's trump card. The same skill that had saved him from Grid that first day. Dark's hand reached for the escape—\n\n\"Baal's Eyes.\"\n\nAgnus had already moved. Adventures and endless battles had honed his instincts razor-sharp. He'd recognized the telltale signs and countered instantly.\n\n*Thrum.*\n\nDarkness coalesced. A massive eyeball materialized, its pupil shifting between black, red, and yellow—utterly inhuman. Every being it observed—Dyulebul, Dark, Elizabeth—froze in place.\n\n> **[Complete terror has stopped your heart.]**\n> \n> **[Your thoughts have ceased. You cannot move for 1 second. Skills and magic sealed for 3 seconds.]**\n\nAn ultimate technique of Baal's Contractor, bypassing all resistance. It affected friend and foe alike—even Dyulebul seized up—but Agnus could simply summon fresh undead.\n\n\"Stop interfering!\"\n\nHe closed the distance as Dark's Emergency Exit failed to activate.\n\n*Damn it!* Dark's expression twisted. No escape. This was the end—\n\nA woman appeared between them.\n\n\"I will punish you.\"\n\nWhite cloak billowing. Silk-black hair streaming. Lake-deep eyes contemplating evil without flinching. Yura—the ranker who'd carried South Korea's hopes alone before Grid's rise—stood before them like divine judgment made flesh.\n\n\"Purification.\"\n\n*Crack!*\n\nThe magic bullet struck Agnus's forehead. He staggered back with a strangled grunt. A quarter of his health vanished instantly. Worse—his legendary advancement had changed his race from human to half-demonkin. Demon Slayer attacks were now critically effective.\n\n\"Why...\" He straightened slowly, summoning skeletons as shields against her next shot. \"Why does the world keep interfering?\"\n\n\"...\"\n\n\"Why?!\" His laughter rang hollow as he clutched his bleeding forehead, murder burning in his eyes.\n\n> **[The second class quest of Baal's Contractor has occurred.]**\n> \n> **[Old Enemy]**\n> \n> **Quest:** A Demon Slayer exists to destroy hell. She regards you—Baal's agent—as her enemy and will hunt you relentlessly. For your survival, eliminate the Demon Slayer.\n> \n> **Clear Condition:** Kill the Demon Slayer\n> \n> **Reward:** Evolution from half-demonkin to demon. Unlock new skills, magic, and additional demon contracts.\n> \n> **Failure Condition:** Death by the Demon Slayer's hand\n> \n> **Penalty:** Permanent loss of 100 points from highest stat\n\nGrowth-type legendary classes suffered level regression to 300 upon advancement—a mercy compared to Grid, Yura, and Kraugel's complete resets to level 1. But that mercy came with a price. Class quests carried brutal difficulty. A single failure meant permanent crippling. Walking a tightrope over an abyss.\n\nNormally, Agnus welcomed oblivion. Not this time.\n\n\"Get out of my way! Summon Lich—Mumud!\"\n\nMagical power detonated toward Yura. Dyulebul shook off its paralysis and fired simultaneously.\n\n***\n\nElizabeth had never dyed her hair. Through university, she'd maintained that natural black while her peers experimented with every color imaginable. People assumed it suited her doll-like features—practical and elegant. But the truth was simpler.\n\nBlack hair was Yura's symbol. Elizabeth had worshipped her idol for four years since that first glimpse on television.\n\n\"Hah... hah... hah...\"\n\n\"Yura!\"\n\nHer idol fought right before her eyes. The hero who'd appeared when all seemed lost. But as the battle intensified, Elizabeth's excitement curdled into anguish watching Yura take hit after hit.\n\n\"Damn it! Elizabeth! Run instead of standing there!\" Dark's voice cracked with desperation. He couldn't abandon Yura after she'd risked herself for them. But isolated by death knights and skeleton warriors, he could barely stay alive, let alone help.\n\nElizabeth remained rooted. She couldn't flee while her uncle and idol fought for their lives. If her presence endangered them, she'd have run without hesitation. But Agnus never targeted her. His assault focused entirely on Yura and Dark.\n\nYura dodged Mumud's spell and Dyulebul's ray, reloading her magic bullets. Agnus vanished from sight. A skeleton materialized in his place—a human shield against her aim. Brilliant improvisation.\n\nBefore Yura could adjust, a magic circle blazed beneath her feet. Mumud's spell formation. She'd already suffered severe damage from his Fireball. Avoiding this was mandatory.\n\nShe leaped. Pain lanced through her midsection. Without hesitation, she twisted mid-air and fired backward.\n\n*Bang!*\n\nA skeleton warrior's skull exploded. The ground beneath fractured like shattered pottery. Flames erupted through the cracks—Mumud's delayed explosion magic. The skeletons had blocked her escape path perfectly.\n\n\"Sister!\" \n\n\"Kahaha! Yes! *Yes!*\"\n\nIn the collapsing dungeon, screams and laughter merged into chaos.\n\n***\n\n\"Is this it?\" Grid emerged from the forest and spotted a mountain several kilometers distant.\n\nBullet hadn't expected to see their destination so clearly. He nodded quickly. \"That's Gerad Mountain!\"\n\n\"Long journey.\" Grid's pockets clinked with colorful jewels—spoils from the Belial raid."
}