{
  "id": 854,
  "title": "Chapter 854",
  "content": "Most of Lich Mumud's high-level spells combined two or more elemental attributes. Explosion was no exception. First came the howling winds, then the ignition—flames that struck with precision and devastation far beyond standard fire magic. Through Agnus' experience, he knew even a third advancement paladin, boasting superior magic resistance compared to other classes, would lose half their health from a single blast.\n\n*She's unscathed?*\n\nYet Yura stepped from the inferno without a mark on her body. Her health gauge remained stable.\n\n\"You're not even hurt?\" Joy flashed across Agnus' eyes. He forgot, for just a moment, why he'd come here.\n\n*Thud-thud. Thud-thud.* \n\nHis heart pounded. These desperate moments when breathing became difficult—only then could he feel truly alive.\n\n\"Yuraaaaa!\"\n\n\"Agnus!\"\n\nThey knew each other well. Before the comet called Grid blazed across the rankings and disrupted everything, Yura and Agnus had stood at the pinnacle, keenly aware of one another. A Yatan Servant and Baal's Contractor—two souls walking parallel paths that might have intertwined their destinies.\n\nThat possibility died long ago. The weight of evil the Yatan Servants carried became too heavy a burden for Yura to bear. She abandoned her foolish thoughts of opposing Grid and became the enemy of Agnus, the lord of darkness himself.\n\nAgnus needed to embrace evil to achieve his purpose. Yura stood in his way. One had to defeat the other. One had to consume the other. Coexistence was impossible.\n\nThey fought with lethal intent as dozens of skeletons rose and fell within the dungeon depths. Each burst of azure light destroyed a demon. Each new demon spawned only to be consumed by that same blue radiance. Lich Mumud's spells triggered landslides throughout the mountain's interior, while Yura's shape-shifting magic engineering weapon tore into Agnus with each transformation.\n\n\"Kik! Kikikik! Kuahahahahat! Marvelous! I'm happy! This is thrilling! You're strong!\"\n\n\"Ugh..!\"\n\nThe shockwaves were too immense. Gerad Mountain ranked twenty-third tallest on the continent, yet proved too small a stage for two legends to clash. The mountain began to collapse entirely.\n\n\"Bokja! We need to leave!\"\n\n\"B-But...!\"\n\nEat Spicy Jokbal ignored his niece's protests. He simply scooped her up and fled down the mountainside. Did Elizabeth want to stay and help Yura, only to be crushed beneath falling stone?\n\n*Was Yura always this powerful?*\n\nEat Spicy Jokbal noticed the difference between the Yura from the National Competition and the woman fighting now. To battle Agnus for ten minutes straight—wasn't that strength comparable to Grid himself? He wondered what secret lay behind Yura's explosive growth over mere months.\n\n*Or am I mistaken?*\n\nPerhaps Agnus wasn't at Grid's level to begin with? No. Impossible. Comparing Grid's strength to Agnus' strength—there was no telling who held the advantage.\n\n*Maybe it's simply elemental compatibility...*\n\nThe azure light Yura generated proved fatal to Agnus' undead and demons. The Demon Slayer class held the elemental advantage, that much was clear. Even so, Agnus matched her blow for blow.\n\n*There really are monsters walking this world.*\n\nAgnus operated on an entirely different level. Eat Spicy Jokbal felt the same drive toward Agnus as he did toward Grid—a burning desire to stand shoulder to shoulder with them. That motivation shattered moments later when a figure plummeted from the sky. Eat Spicy Jokbal and Elizabeth stopped running, shocked. The person who crashed before them was none other than Yura.\n\n\"S-Sister!\"\n\n\"Ugh...!\"\n\nYura's health gauge had hit zero. She clung to life only through the legendary class passive that prevented death for five seconds. A voice drifted down from above. \"Is this the end?\"\n\n\"Agnus...!\" \n\nA chill crawled down Eat Spicy Jokbal's spine. While Yura lay dying, Agnus' health bar remained completely full. Ten minutes of combat ending so one-sided...? Terror overwhelmed his admiration, and his determination to reach Agnus' level crumbled.\n\nIn the terrible silence...\n\n*Snap!*\n\nAgnus landed and seized Yura's face with one hand.\n\n\"Well. That was entertaining.\"\n\nThe fight hadn't been easy for Agnus. Three contracted demons had returned to hell, and Lich Mumud's remaining summoning time was exhausted. He'd even burned Bentao's Mockery, the skill that swapped health with his target. Using Baal's Eyes on Eat Spicy Jokbal now seemed wasteful.\n\n\"It would've been more convenient if you'd fought me first. Isn't that right?\" \n\nAgnus shifted his gaze while gripping Yura's face, forcing Eat Spicy Jokbal to retreat. Pure instinct. After defeating him and then Yura in sequence, Agnus inspired nothing but primal fear.\n\n*Who could possibly defeat this monster?*\n\nGrid? Kraugel? Ares? Was victory even possible? Grid alone wielded enough firepower to annihilate a city—but so did Agnus. Agnus also possessed Kraugel's power and reflexes, neutralizing most enemy attacks. Case in point: his skeletons blocking nearly all of Yura's bullets. What about Ares' army then? Agnus commanded demons and legions of undead.\n\n*This is broken no matter how you look at it...*\n\nEat Spicy Jokbal swallowed hard and shrank back entirely, overwhelmed by Agnus' presence. He couldn't move. The moment Agnus' sword aimed for Yura's heart—\n\n\"Wait!\" Elizabeth's shout cut through the tension. \"I'll accept your request! Just stop!\"\n\n\"...\"\n\nAgnus, Yura, and Eat Spicy Jokbal all turned to Elizabeth.\n\n\"I'll work on the Stone of Life,\" she declared with surprising confidence. \"In return, guarantee my uncle and Yura's lives.\"\n\n\"Done.\" \n\nAgnus accepted without hesitation. He could defeat Yura and Eat Spicy Jokbal anytime, even if they recovered fully. Just as Yura's spirit broke, an angry voice rang out.\n\n\"Why are you negotiating for my colleague's life?\"\n\nShock rippled through everyone present. A black-haired man stood where all eyes turned. Sharp gaze, exceptionally broad shoulders—Grid.\n\n*Why is he here at this moment?* \n\nAgnus felt puzzled rather than pleased as the situation deteriorated. For the first time, confusion crossed his face—a sight even Bullet, the third leader of Immortal, had never witnessed.\n\n\"Agnus...\" \n\nBullet's mouth fell open at encountering an unexpected person in such an unexpected place. Relief flickered across Agnus' expression when he spotted Bullet beside Grid, but no one caught that change. A Sword of Light slammed into Agnus' face. Startled, he barely blocked with a skeleton and released Yura.\n\n\"Are you okay?\" Grid caught the stumbling Yura.\n\n\"...\" \n\nThe rescued Yura felt no relief. Her head bowed, face flushed as Grid's fingers brushed against her. She bit her lip. \"I...I'm...\"\n\n*Weak.*\n\nThat terrible reality hadn't changed despite months of hellish training. Unable to help Grid, unable to stand beside him as an equal. Yura swallowed her words.\n\n\"You're strong.\" Grid wasn't merely consoling her. \"What you lack are items.\"\n\nThe sniper rifle proved ineffective against Agnus' endless undead, so Grid deduced Yura had fought in pistol mode to maintain attack speed.\n\n\"You don't have any runes. Meanwhile, that bastard Agnus has completely fraudulent specs.\" Grid knew—he'd fought Agnus before. Agnus possessed skills nearly impossible to resist, and his items were nightmarish to counter. Grid still trembled remembering Bentao's Mockery. Combined with transcendent talent, how formidable was Agnus?\n\nCompared to Agnus, Yura had excellent talent, but her lack of skills and items inevitably disadvantaged her. But that was only surface-level analysis.\n\nThis was Grid's conclusion.\n\n\"Fight again.\"\n\nYura wasn't weak at all. Grid wanted to restore her confidence. His chest tightened seeing her so uncertain. He missed her commanding presence from before. As friend, colleague, and benefactor, Grid needed to return Yura's self-assurance.\n\n[Player 'Grid' wants to hand you the Lightning Sword Born from Enlightenment and Strong Desires.]\n\n[Do you want to accept it?]\n\n\"Y-You?\"\n\nAfter Alex's Magic Engineering Bayonet crafted by Pagma, Grid was offering another myth-rated weapon? Frightened, Yura refused. Yet Grid extended the item again. \"I'm lending this to you. I don't want another debtor like Jishuka.\"\n\n\"...\"\n\nGrid's meaning reached Yura. After several minutes of internal struggle, she accepted the dark blade and fixed her gaze on Agnus.\n\nAgnus scoffed. \"A beaten dog crawling back for more?\"\n\nRage surged through Agnus every time he saw Grid. Wasn't Grid also living with a terrible past? Didn't he want revenge for being trampled by others, for a life of suffering?\n\n\"Why are you...\" \n\nRather than inflicting pain on others—!\n\n\"Annoying! Kik! Kilkik! So annoying!\"\n\nWas there only one accessories maker in this world? Why did Agnus have to endure all this trouble? In that moment, the thin thread of reason he'd been clutching snapped. He roared.\n\n\"Just die!\"\n\nDemonic energy exploded outward. Grid shielded the injured Eat Spicy Jokbal and Elizabeth with his God Hands, relocating them to safety.\n\n*Flash!*\n\nYura pierced through the demonic miasma before her. She closed the distance to Agnus instantly, firing to shatter his skeleton shield while simultaneously swinging the Enlightenment Sword.\n\n\"...!!\""
}