{
  "id": 856,
  "title": "Chapter 856",
  "content": "**Chapter [X]**\n\nMorning sunlight spilled through the windows of Reinhardt's Security Building as the day's quest board updated with fresh opportunities.\n\n> [**Daily Quest: Contribute to City Security**]\n> Visit the Security Department for today's assignment.\n> **Reward:** 1 Grid Set Voucher\n> *Collect 40 vouchers to exchange for a mass-produced Grid item. Collect 120 vouchers for a craftsman-quality piece.*\n\n> [**Daily Quest: Secure City Resources**]\n> Deliver 100 leather and bones from level 100+ monsters, OR 200 units of minerals, stone, wood, or herbs to the Procurement Department.\n> **Reward:** 1 Grid Set Voucher\n\n> [**Daily Quest: Agricultural Development**]\n> Report to the farmlands for field work.\n> **Reward:** 1 Rainbow Potato. +1 Affinity with Overgeared Kingdom Farmers\n> *Maximum farmer affinity may trigger a hidden quest from a 'special character.' (Extremely low probability)*\n\n> [**Daily Quest: Administrator Rabbit's Summons**]\n> Administrator Rabbit requires assistance.\n> **Reward:** Gold\n> *Payment varies based on performance. Known for modest compensation.*\n\n> [**Daily Quest: Pet Care Mission**]\n> Overgeared member Nyangmong requests feeding for 10 sheep and 10 street dogs.\n> **Reward:** 1 Grid Set Voucher\n\n> [**Special Quest: Earl Pon's Request**]\n> Earl Pon seeks epic-grade or higher spear skill books.\n> **Reward:** ???\n\n> [**Special Quest: Duke Jishuka's Advertisement**]\n> Duke Jishuka is purchasing jaffa arrows in bulk at 150% market value. Special jaffa arrows: 300% market value.\n\n> [**Repeating Quest: Hall of Fame Pilgrimage**]\n> Visit the Hall of Fame and pay respects at King Grid's statue once every three days.\n> **Reward:** 1 mass-produced Grid item per 20 consecutive visits.\n\n\"Only eight more to go!\" Ryan clutched his quest log, eyes bright with anticipation. Thirty-two vouchers. After months of grinding daily quests, he was *so close*. \n\nLike most fourth-generation players, Ryan had chosen Reinhardt as his starting city—a decision that seemed obvious in hindsight. The infrastructure was unmatched, the quest system streamlined, and the reward structure actually made sense. Other kingdoms forced newbies to scrape together gold for overpriced gear. Here, consistent effort guaranteed results.\n\nRyan tapped his voucher count again, grinning. \"If I clear today and tomorrow, I'll finally get a Grid weapon!\"\n\nHe'd seen the performance comparisons on the forums. Mass-produced Grid items crushed same-level epics without breaking a sweat. They even held their own against unique-rated equipment once set bonuses kicked in. The playing field had shifted—patience and dedication now outpaced deep pockets. For once, the common player actually had a chance.\n\n\"What's got you so excited?\" Alcolman and his group materialized beside Ryan, drawn by his uncontrollable grin. They'd all started around the same time.\n\nRyan straightened, puffing his chest. \"By tomorrow afternoon, I'll have forty vouchers.\"\n\n\"Whoa!\"\n\n\"No way!\"\n\nThe group leaned in, equal parts impressed and envious. None of them had managed to maintain a perfect daily streak. Ryan was about to *ascend*.\n\n\"You'll carry us tomorrow, right?\" someone asked.\n\n\"Forget carry—he'll be our party leader with a Grid weapon!\"\n\n\"We should tackle Cigna Cave. We're ready.\"\n\nCigna Cave required at least five players between level 60-70 for a clean run. Ryan and Alcolman's group hovered around fifty—normally a recipe for disaster. But with a Grid weapon? The power spike was real. Everyone knew it.\n\n\"Today's special quests are kind of disappointing though,\" Alcolman muttered, scrolling through the listings.\n\n\"Yeah. Epic skill books? Those only drop from high-level raid bosses. And jaffa arrows are practically a blacksmith exclusive.\"\n\n\"Can't you buy arrows at auction?\"\n\n\"Already checked. Sold out. Jishuka must've cleaned out the market yesterday.\"\n\n\"Isn't she in debt?\"\n\n\"With her hunting speed? She'll earn it back in a week...\"\n\n\"Man, I'd kill to watch her hunt just once.\"\n\n\"Same...\"\n\nThe group moved through Reinhardt's bustling streets, weaving between hundreds of Muto Company wagons. The security building loomed ahead—a familiar destination.\n\n\"Here for today's security work,\" Ryan announced. \"Ryan, level fifty-one swordsman.\"\n\nThe receptionist's friendly smile flickered. She pulled up his profile, then winced. \"Here are your available assignments.\"\n\n*Ttiring~*\n\nEight quests materialized. Ryan scanned the list—and his stomach dropped. Minimum level sixty across the board.\n\n\"These look... rough. Anything easier available?\"\n\nThe receptionist's expression turned apologetic. \"Unfortunately, no. It's a Two Moon Overlap period. Monster levels have increased significantly across all zones.\"\n\n\"Damn it...\" Ryan exchanged frustrated glances with Alcolman's group. Missing even one voucher felt catastrophic. They'd maintained perfect attendance for *months*.\n\n\"I do have an alternative,\" the receptionist offered. \"A cooperative quest?\"\n\n\"Cooperative?\"\n\n\"It's a limited-time initiative commemorating the armistice between the Overgeared Kingdom and Saharan Empire. You'd partner with imperial players. The rewards are equivalent to our daily quest standards.\"\n\nRyan's nose wrinkled. \"Work with the empire...\"\n\nThe others shifted uncomfortably. Imperial players carried a certain... arrogance. The empire flooded newbies with startup gold, letting them buy their way to level one hundred. Fast early growth bred inflated egos. Meanwhile, Overgeared Kingdom players scraped by in basic gear until their Grid sets came together around level ninety. Different philosophies, different attitudes.\n\n\"It's completely safe,\" the receptionist assured them. \"Prime Minister Lauel designed these initiatives to foster exchange between our nations. There's nothing to worry about.\"\n\n\"It's not about safety,\" Ryan said quietly.\n\n\"Hm?\"\n\n\"Nothing.\"\n\nThe receptionist had no idea what newbie politics looked like. Ryan and Alcolman sighed in unison, then nodded.\n\n\"Fine. We'll take the cooperative quest.\"\n\nThey couldn't afford to miss a voucher. Not when Ryan was this close.\n\n---\n\nAn hour later, six imperial players strolled up to their meeting point in Reinhardt's central plaza. \n\n\"You're the cooperative quest party?\" one asked, not bothering to hide his smirk.\n\n\"Ah, yes—\"\n\n\"Wow. The rumors are true.\" The imperial player looked Ryan's group up and down, gaze lingering on their patched leather armor and basic iron weapons. \"The Overgeared Kingdom really does exploit beginners. What cheap bastards.\"\n\n\"They'll probably die if a boar breathes on them. *Kilkil*.\"\n\nRyan's jaw tightened. Alcolman's hand drifted toward his sword hilt before he stopped himself.\n\nThe imperial players *knew* about Grid sets—everyone did. But Grid sets weren't *free*. They required months of consistent contribution, daily dedication, kingdom development. Meanwhile, the Saharan Empire just handed newbies a fat sack of gold and said *good luck*. Two different systems, two different values.\n\n\"Doesn't matter how good Grid sets are,\" another imperial player said, adjusting his expensive gauntlets. \"They're not endgame equipment anyway.\"\n\n\"Exactly. Better to take the funding, blast through level one hundred, and move to real hunting grounds.\"\n\nWhat the imperial players didn't understand—or chose to ignore—was that Overgeared Kingdom players *exploded* once they hit ninety. Four Grid set pieces transformed adequate fighters into monsters. By one-eighty, the gap had reversed entirely. But that required surviving the brutal early grind.\n\n\"Haap!\"\n\nThe cooperative hunt began in the horned rabbit fields. Imperial players cut through the mobs effortlessly, their expensive weapons dropping rabbits in three hits. Ryan's group needed six. What took the imperials thirty seconds left Ryan's party gasping and chugging potions.\n\n\"So who's really *overgeared* here?\" The mocking started openly now.\n\nRyan bit his tongue. His group exchanged glances but stayed silent. There was a story the older players told—that King Grid himself had been ignored and ridiculed in his early days. That he'd endured. Persevered. If Grid could do it, so could they.\n\n> [The cooperative party has hunted 231/500 horned rabbits.]\n\nAlmost halfway. The humiliation was nearly over. Just a bit more patience—\n\n> [**Field Boss: Four-Horned Rabbit has appeared!**]\n\n\"Shit—!\"\n\nThe monster erupted from the underbrush—easily twice the size of a normal rabbit, with four massive horns and eyes that burned crimson red.\n\n\"You've got to be kidding me...!\"\n\n\"This is *your fault*!\" An imperial player rounded on Ryan's group. \"If you'd killed faster, we'd be done already! Now we're stuck dealing with a boss!\"\n\n\"This is what happens when you party with dead weight!\"\n\nThe Four-Horned Rabbit's level marker flashed: **120**. Far beyond what their combined party could handle.\n\n\"Oh dear. Looks like the newbies are in trouble.\"\n\nA second cooperative party emerged from the tree line—all over level one hundred. The Overgeared Kingdom members wore matching Grid sets, equipment that actually *fit together* aesthetically. The imperial players... wore a chaotic mix of unique-rated pieces that screamed *I bought this with daddy's credit card*.\n\n\"Mine!\" Three imperial players charged immediately, flashy unique-rated swords gleaming.\n\n*Slash! Slash! Slash!*\n\nThe Four-Horned Rabbit's health barely budged. Three-quarters remaining. Their expensive weapons meant nothing without the skill to back them up.\n\n\"Help us!\" The same imperials who'd rushed ahead now shouted at the Overgeared players. \"Stop standing there!\"\n\nThe three Overgeared Kingdom members—Ryan's future, in Grid set armor—simply shrugged.\n\nThen moved.\n\nTheir coordinated assault was surgical. Sword, spear, and magic wove together with practiced efficiency. The Four-Horned Rabbit thrashed, bellowed—\n\n> [The Four-Horned Rabbit has been defeated!]\n\n\"No way...\"\n\n\"That fast...?\"\n\nThe imperial players stared, faces pale. The legends about Grid sets weren't exaggerated—they were *understated*.\n\nRyan's group, meanwhile, looked at their seniors with stars in their eyes.\n\n\"Are you okay?\" one of the Overgeared players asked, helping Ryan to his feet.\n\n\"Yes! Thank you!\"\n\n\"Are you in the Overgeared Guild?\" Ryan blurted out. \"Like, officially?\"\n\nThe senior players laughed.\n\n\"Overgeared Guild? Us? No way.\"\n\n\"That's the dream, though. Our ultimate goal.\"\n\n\"A dream with like, 0.001% odds. Haha!\"\n\n\"...\"\n\nTime had transformed the Overgeared Kingdom. For the new generation, the kingdom itself was hope. Guild members were legends. And the Overgeared King? A distant, untouchable icon.\n\nGrid himself, naturally, remained oblivious to his own mythology.\n\n---\n\n\"*Achoo!*\"\n\n\"You could at least turn your head when you sneeze.\"\n\n\"Sorry, sorry. It came out of nowhere. Did I get you?\" Grid wiped his nose, peering at Elizabeth through the dusty air of collapsed Gerad Mountain.\n\n\"I'm now infected with invisible bacteria.\" Elizabeth crossed her arms, though her tone lacked real heat. \"Where did you get those jewels, anyway? Steal a treasure chest during your empire visit?\"\n\n\"Steal? No way. I raided a great demon for these.\" Grid examined one of the gems, watching light refract through its facets. \"And I can't exactly steal from the empire. The emperor and his retainers are terrifying.\"\n\n\"You *raided a great demon*...\" Elizabeth's voice trailed off. \"The *emperor*...\"\n\nGrid's casual words painted a picture of a world operating on a completely different scale than she'd imagined. Her resentment toward him—for being Yura's... whatever he was to Yura—crumbled under the weight of reality.\n\n\"I suppose... she wouldn't choose an ordinary man.\" Elizabeth's gaze softened. \"I'm sorry. I misjudged you.\"\n\n\"...???\"\n\n\"You're special.\" The first-ranked accessories maker looked at the ruins of her workshop, then back at Grid. Her decision crystallized. \"Which means I need to be somewhere that challenges me.\"\n\nThe Overgeared Guild's doors were about to receive a very persistent knock."
}