{
  "id": 857,
  "title": "Chapter 857",
  "content": "**Chapter Rewrite**\n\nOnce upon a time, legendary items could only be obtained by slaying boss monsters. That common wisdom had been thoroughly shattered over the past year. As production classes advanced through increasingly challenging class quests, players had begun crafting legendaries themselves—rare, yes, but no longer impossible.\n\nElizabeth met Grid's gaze steadily. \"I know my reputation precedes me, but let me be clear about what I can actually do. I'm Elizabeth, a craftsman-level accessories maker. I can create any type of accessory, and I've been fortunate enough to produce a legendary ring and necklace.\"\n\nThe word *fortunate* wasn't false modesty—it was honest warning. She couldn't control what rating her creations achieved. If Grid had bought into the exaggerated rumors about the so-called \"Princess of Jewelry,\" he'd be disappointed to learn she couldn't guarantee legendary results.\n\n\"Overgeared King Grid.\" He extended his hand for a handshake.\n\nGrid had forged more items than anyone alive. He understood the production system's intricacies better than most, and he'd never believed those inflated rumors anyway. His expression remained openly interested.\n\n\"I...\" Heat rushed to Elizabeth's cheeks as their hands met. Something unfamiliar shot through her—a weakness in her knees, a flutter in her chest. Nothing like this had ever happened to her before.\n\nShe yanked her hand back. \"Thank you. For saving me, I mean. Well—you saved Yura more than me, but still. You helped.\"\n\nElizabeth had disliked Grid for a long time. His legendary class gave him advantages she'd never have, his innate luck produced results that should have required far more effort, and his abrasive personality grated on her. The fact that Yura loved him only made it worse.\n\nBut personal feelings aside, Grid had saved her uncle's life. That deserved genuine gratitude.\n\nGrid cut straight to business. \"If you mean that, I need a favor. Skip the usual commission process.\"\n\nElizabeth's standard terms were notoriously particular—a waiting list, materials that had to intrigue her, and the right to refuse anything that didn't. Simple requirements that somehow became incredibly restrictive.\n\n\"I understand. I'll prioritize your request.\" She held up a finger. \"But you should know—if the work doesn't engage me, the results suffer. I hope whatever you need will be interesting.\"\n\n*I just want some rings.*\n\nThat was it. Grid currently wore four rings: his wedding band, Doran's Ring, the Ring of Absurdity, and Elfin Stone's Ring. The first two he swapped out depending on circumstances. The latter two stayed on permanently. That left eight empty fingers.\n\nHe also wore the Guardian's Bracelet and Neberius' Bracelet (one on each wrist), the Guardian's Necklace, and two pairs of earrings—Dark Bus' Earrings and the Black Quartz Earrings. Making eight rings should cover his needs.\n\nYet she wanted an *interesting* request?\n\n*What kind of unusual accessory should I ask for? A chain? Some kind of piercing? Would those even provide stats?*\n\nWhile Grid puzzled over this, he produced a package of jewels.\n\n\"What—\" Elizabeth's eyes went wide. The gems inside stole her breath.\n\n**[Belial's Black Jewel (S)]**\n\n*[A gem of extraordinary beauty, suitable for high-grade accessories. Its value rivals that of purchasing a city—assuming one could find it for sale at all.*\n\n*When crafted into accessories, grants bonuses to intelligence or shadow resistance. May generate passive skills depending on the artisan's mastery.*\n\n*However, finding someone capable of working with this jewel is like plucking stars from the sky.]*\n\n**[Belial's Red Jewel (S)]**\n\n*[...*\n\n*When crafted into accessories, grants bonuses to intelligence or fire resistance. May generate passive skills depending on the artisan's mastery.*\n\n*However, finding someone capable of working with this jewel is like plucking stars from the sky.]*\n\n*Jewels that guarantee stat bonuses and resistance? With a chance at passive skills?*\n\nElizabeth had handled hundreds of gems throughout her career. High-rankers often brought her boss-drop materials—jewels that had a *low probability* of granting stats or resistance.\n\nThese jewels *guaranteed* both, plus potential passive skills.\n\nShe'd never seen anything like them.\n\n\"Where...\" Her voice came out hushed, awed. When Grid explained they'd come from raiding Belial, admiration flooded her expression.\n\nGrid sighed. \"I don't know if this will interest you. I just need ordinary rings.\"\n\n\"Rings?\"\n\n\"Eight of them.\"\n\n\"What about necklaces? Bracelets? Earrings?\"\n\nGrid blinked, confused. He'd expected disappointment, not this sudden intensity. Elizabeth had moved close enough that her large black eyes seemed to glow with hunger.\n\n\"You're too close.\"\n\nYura and Eat Spicy Jokbal both shifted uncomfortably.\n\nGrid stepped back. \"As you can see, I'm already using necklaces, bracelets, and earrings.\"\n\nHis current accessories served him well. The Guardian's Bracelet and Necklace provided defense and indomitable stats, with a set bonus of 100 additional defense. Neberius' Bracelet granted 30 strength and reduced casting time by 20%. The Black Quartz Earrings increased intelligence by 15%, while Dark Bus' Earrings enabled his Blackening skill.\n\nAs someone who filled damage dealer, tank, and mage roles simultaneously, Grid couldn't afford to give up any of those effects.\n\nElizabeth used her Artisan's Eyes to appraise his equipment. \"Those jade pieces—the bracelet and necklace. You can replace them.\"\n\n\"They're a set.\"\n\n\"A unique-rated set. So what?\" Elizabeth pressed a hand to her chest in exasperation. \"I can make you better bracelets and necklaces *even accounting for the set bonus.* I won't need any luck—the jewels you brought guarantee it!\"\n\nThen she hesitated. \"Though... these large jewels might be beyond me. I'm not confident working with S-grade materials. I'd need to be beyond craftsman level for that.\"\n\n\"So you can improve my current accessories using the B-grade jewels, but not the S-grade ones?\"\n\nBelial's jewels were worth even more than Grid had realized.\n\n\"Exactly.\" Elizabeth sorted through the B-grade stones. \"The rating will be epic, but the effects will exceed your current necklace and bracelet set.\"\n\nGrid had given her thirty jewels total: ten C-grade, ten B-grade, and ten S-grade. Setting aside the S-grade stones, she had enough to craft a necklace, a bracelet, and eight rings.\n\n*This is an incredible opportunity.*\n\nElizabeth felt more excited than Grid looked. The chance to work with materials from a great demon raid—she couldn't contain herself. \"It's a shame. If I had more jewels, I could try so many different designs.\"\n\n\"I was told you keep people on a waiting list. Would you really take multiple orders from one person?\"\n\n\"Of course! If I can work with more jewels like these, I'll craft for you for the rest of my life!\"\n\n\"For life?\"\n\n\"...\"\n\nThe passion in Elizabeth's declaration sounded disturbingly like courtship. Yura and Eat Spicy Jokbal's discomfort visibly intensified.\n\n\"Dozens of people in my guild have ten or twenty Belial jewels,\" Grid said casually.\n\n\"What?\"\n\nElizabeth had assumed Grid's thirty jewels represented Belial's entire drop. The thought that *hundreds* remained left her shaking. She stopped, seeming to come to a decision.\n\n\"I'm moving to the Overgeared Kingdom. This goes beyond being a VVIP client. Since you're the king—can you provide a workshop? Or should I just join the Overgeared Guild directly?\"\n\n\"...\"\n\n\"Do I not meet your requirements?\"\n\n\"Of course you do.\"\n\n---\n\nLater that day, when Grid returned with Elizabeth in tow, Lauel stared at him in despair.\n\n\"Why do you kidnap someone every time you leave the kingdom? What the hell are you doing out there? Do you have some hidden human trafficking skill? Is your third class 'Legendary Trafficker'? *What?*\"\n\n\"...\"\n\nGrid decided silence was the wisest response."
}