{
  "id": 858,
  "title": "Chapter 858",
  "content": "Valhalla's conquest of Ultina had entered its final stage. The outer fortresses lay in ruins, the capital walls breached. With their fortifications shattered, Ultina's demoralized troops fell like wheat before Valhalla's disciplined army. Only the kingdom's Guardian Knights—elite warriors who'd achieved their fourth class advancement—kept the invasion from becoming an outright massacre.\n\nPon had been following the news coverage during his logout sessions. Now, back in Lauel's office, he couldn't hold his tongue any longer. \"Are we really going to just... watch this happen?\"\n\nLike every member of Overgeared, Pon understood the threat Valhalla represented. For now, they were allies—both kingdoms stood against the Saharan Empire. But alliances were fragile things. And Ares' signature skill, Fostering Strong Soldiers, let him create elite troops at a terrifying pace. That power alone made Valhalla a potential nightmare.\n\nLauel, however, seemed unconcerned. \"Leave it be.\"\n\n\"What?\" Pon leaned forward. \"Have you talked to the guys we sent to support them? Ares' forces are getting stronger every day. Soon they'll outmatch our own soldiers. Their numbers, their training—\"\n\n\"Let them grow stronger.\" Lauel's interruption was calm, almost dismissive. \"No—they *must* become stronger.\"\n\n\"What?\"\n\nHad Lauel lost his mind? Pon stared at the guild's strategist, searching for any sign this was some elaborate joke. Only one explanation made sense. \"You want them strong enough to help us crush the Empire?\"\n\n\"Ah...\" Lauel pressed fingers to his temple in theatrical despair. \"The sorrow that fills my heart runs deeper than any ocean... Humanity exists in three dimensions, yet their thinking remains so painfully linear...\"\n\n\"...What?\"\n\n\"Pon.\" Lauel met his gaze. \"Why do you fear Valhalla?\"\n\n\"Because they might turn on us eventually.\"\n\n\"Exactly. There are no eternal allies.\" Lauel's smile was sharp. \"But tell me—do you plan on living forever?\"\n\nPon opened his mouth. Closed it. His eyes widened as understanding dawned.\n\nLauel's laugh was low and sinister. \"You see it now.\"\n\n\"You'd actually ally with the Empire?\" Pon's voice dropped to a whisper.\n\n\"Why not?\" Lauel spread his hands. \"Grid himself suggested the possibility. The Saharan Empire isn't like the great demons—they're not absolute evil. Which means they're not an absolute enemy. Relationships change.\" He leaned back in his chair. \"Just wait. The Empire won't sit idle, and as both kingdoms grow, their goals will expand. We maintain friendly relations with both sides. That gives us options. Stay calm.\"\n\n\"Understood.\"\n\nA chill ran down Pon's spine. Without Lauel's brilliance, the Overgeared Kingdom wouldn't exist. If Grid hadn't won him over—if Lauel had become their enemy instead...\n\nHe didn't want to imagine it.\n\nLauel's quiet laughter filled the office.\n\nA knock at the door interrupted the moment. Lauel checked the time, then opened it with a welcoming smile.\n\n\"Welcome, Eat Spicy Jokbal. Please, come in.\"\n\n\"Excuse me.\"\n\nThe Dungeon Maker stepped inside. His class let him create dungeons for protection, entrapment, or training. His personal combat strength was estimated at sun-grade—a massive asset. Both Lauel and Pon greeted him warmly.\n\n\"...What do you want?\" Eat Spicy Jokbal's tone was flat, his expression sour. He was only staying in the Overgeared Kingdom because his niece Elizabeth had joined up. Joining himself? That was another matter entirely. He still hadn't forgiven Grid for dismantling Blood Carnival and stealing that dragon egg.\n\n\"If you're going to ask me to join your guild, save your breath. I'm not interested.\" He turned toward the door. \"And if you want me to build you a dungeon, forget it. Why would I do you any favors?\"\n\n\"Have you acquired the Cooking skill?\" Lauel asked.\n\nBoth Pon and Eat Spicy Jokbal froze.\n\n\"...What?\"\n\nLauel continued as if this were perfectly normal conversation. \"You're a professional chef in reality, aren't you? I assumed you'd learned it in-game as well.\"\n\n\"Well... yes. But that's not exactly rare.\" Eat Spicy Jokbal's confusion was obvious. \"Lots of players pick up basic cooking.\"\n\nIt was true. Cooking was a common skill—anyone could learn the fundamentals for survival on long journeys. Actually mastering it required dedication, but the basics were accessible to all. Eat Spicy Jokbal had trained his cooking specifically to make jokbal on the road. It was a passion project.\n\nWhich made Lauel's next words completely unexpected.\n\n\"We have a chef in the castle basement. The Poison Master. You should train with him.\"\n\n\"Poison... what?\" Eat Spicy Jokbal blinked. \"What are you talking about?\"\n\nLearn from another chef? And why was he called the Poison Master? Before he could process this, another thought struck him. \"You're trying to keep me here, aren't you? Keep me in the city long enough and I might grow attached?\"\n\n\"Precisely.\" Lauel didn't even try to deny it. \"Stay long enough and you might actually like us. Then perhaps you'll join.\"\n\n\"That's ridiculous! What do I gain from training with some random chef?\"\n\n\"He's from the East Continent.\" Lauel's smile sharpened. \"His actual cooking is questionable, but his Cooking skill level is remarkably high. Build a relationship with him, train together, and your own skill will likely increase.\"\n\n\"So what if it does? Do you have any idea who I am?\"\n\n\"Of course I do, Jang Doksoo. Current president of the Eat Spicy Jokbal Haenam Branch. Former chairman of the main branch.\" Lauel stepped closer. \"Don't you want to share the perfection of jokbal with visitors from around the world? Expand your franchise globally? Reclaim your position in the company?\"\n\nSilence.\n\n\"How long will you accept exile in Haenam?\" Lauel's voice softened. \"Remember why you needed Blood Carnival's funding in the first place. Are you really going to let the traitors win?\"\n\nEat Spicy Jokbal said nothing.\n\n***\n\n\"You want to watch me work?\"\n\nElizabeth's eyes widened slightly. The request caught her completely off guard. No one ever wanted to observe jewelry crafting—it was meticulous, tedious work that could take days. Nothing like the relatively quick, visually striking process of blacksmithing.\n\nShe sighed internally. *He doesn't understand what he's asking for.*\n\nCraftsman-level accessory makers spent anywhere from hours to days on a single piece. Particularly delicate work could take four days or more. But a legendary blacksmith wouldn't know that. The class compensation effect made item creation so much easier for them—they probably assumed everyone else had it just as simple.\n\n*Though I'll admit he showed real skill at the National Competition.*\n\nShe didn't dismiss Grid entirely. His concentration and efficiency during the tournament had been impressive. He'd clearly put in serious effort to reach his current level. But still... compared to someone like her, who'd had to build every skill from scratch, he'd had a much easier path.\n\nThat was just how Satisfy worked. Legendary classes were overwhelmingly powerful. As a legendary blacksmith, he'd learned techniques that would take others years to master.\n\n*It's not his fault, though.* She looked at Grid with something approaching sympathy. He probably thought this would take a few hours at most. She should blame the S.A Group for making blacksmithing so accessible to legendary classes, not Grid himself.\n\n\"All right. You're welcome to visit, though I don't know how long you'll last.\"\n\nElizabeth's workshop occupied prime real estate in the high-end shopping district, surrounded by cosmetic boutiques and jewelry stores. The storefront was small but elegant, its sign reading \"Elizabeth's Workshop\" in flowing script. The Overgeared Kingdom had built it specifically to welcome her—a craftsman-level accessories maker worth the investment.\n\nAs she stepped inside with Grid, her eyes lit up. \"The layout... the equipment... everything's perfect. You followed all my specifications and even improved on things I didn't think of.\"\n\nGrid was more attentive than his rough exterior suggested.\n\n*He pays attention to details. That's how he recruited so many powerful allies. How he won over Yura.*\n\nHer opinion of Grid as a person rose considerably. Though she still had to separate Grid the individual from Grid the legendary blacksmith.\n\n\"I'll begin now.\"\n\n\"Sure.\"\n\nElizabeth sat at her worktable and raised a magnifying glass, then glanced back at him. \"Fair warning—this won't be entertaining. You probably won't understand what I'm doing just from watching. If you get bored, feel free to leave.\"\n\n\"That's considerate of you.\" Grid smiled brightly.\n\nHe genuinely seemed to think she was being kind. Elizabeth felt heat rise to her cheeks. Media portrayals painted Grid as arrogant and difficult, but in person he seemed almost... innocent? Naive, even?\n\nThe smile of a grown man shouldn't affect her like this. But suddenly she was acutely aware they were alone in a small space. Her face flushed as she remembered the spark she'd felt shaking his hand earlier.\n\n\"Something wrong?\"\n\n\"N-No! Nothing!\" Elizabeth turned quickly away from Grid's concerned expression and pulled out her materials.\n\nFirst, the package of four hundred Belial jewels, C-grade. Despite being the lowest grade, they outshone the finest rubies and emeralds. They possessed the brilliance and hardness of top-quality diamonds. And these were still raw materials—once a craftsman-level maker finished with them, their beauty would be breathtaking.\n\nElizabeth exhaled slowly, gathering her concentration to its peak. Her hands moved with practiced precision—marking, cleaving, cutting, shaping. The same careful movements she'd used during her craftsman qualification test. Her focus never wavered, even as night fell and dawn approached.\n\nThe next morning...\n\n\"Beautiful...\" A single perfect jewel lay before her, catching the light and throwing rainbow refractions across her workbench.\n\nElizabeth smiled in satisfaction. Then she remembered Grid.\n\n*I don't even know when he left.*\n\nShe'd completely forgotten his presence once she'd entered her working trance. *He must have gone back hours ago.*\n\nShe stretched, her shoulders protesting—then shrieked. \"Ah—Kyaaah?!\"\n\nGrid sat exactly where he'd been the previous evening, watching her with quiet intensity.\n\n\"Y-You—what are you still doing here?\"\n\n\"Didn't I tell you?\" Grid's tone was casual. \"I wanted to watch.\"\n\nAfter observing her work through the entire night, something had clicked for him.\n\n\"These jewels... depending on their hardness, could they be attached directly to equipment? Swords or armor?\""
}