{
  "id": 859,
  "title": "Chapter 859",
  "content": "\"Can these jewels be embedded directly into equipment?\" Grid asked, studying the black gemstone in his palm. \"Swords, armor—if the hardness is right?\"\n\nIf so, he could socket Belial's jewels straight into his gear. The stat boosts alone would be incredible.\n\nElizabeth nodded, though her expression held a note of caution. \"It's the ideal combination. Many have tried—accessory makers, blacksmiths. All failed.\"\n\n\"Why?\"\n\n\"Hardness doesn't equal toughness. Most gems shatter under impact, no matter how hard they are. Even diamonds.\" She gestured at the black jewel. \"Belial's gems are the same. That's why you rarely see jewels in actual combat equipment—only ceremonial pieces. One solid hit and they're dust.\"\n\nGrid's enthusiasm dimmed. \"What about impact-resistant gems?\"\n\n\"Black diamonds. But those...\" Elizabeth shook her head. \"Those require a legendary accessories maker. Beyond my skill.\"\n\n\"Damn.\" The disappointment lasted only a moment before his eyes narrowed. 'Wait.'\n\nHe'd been avoiding something. After claiming the First King title, he'd put off crafting a proper crown—partly because he lacked skilled jewelers, partly because a jeweled crown in battle seemed impractical. But now...\n\n'I can wear both a crown and helmet. Hide one appearance, keep both effects.'\n\nThe First King title granted him an extra head equipment slot. While others chose between helmet, hat, or crown, Grid could equip two. He'd tested it with the Holy Light Crown—wearing a helmet over it worked perfectly. The crown's stats remained active while the helmet protected it from damage.\n\n'If I socket jewels into the crown and cover it with a helmet...'\n\nHis mind raced. He could gain all the benefits with none of the risk. Ordinary fighters couldn't afford to wear jeweled crowns into combat—one swing and thousands of gold shattered. But Grid? He could protect the crown entirely while keeping every stat boost.\n\nOne problem remained. The helmet had to be large enough.\n\nGrid frowned. The Thick Helmet he'd worn for years could fit over the Holy Light Crown, but this new crown would be larger. He needed more internal space without sacrificing visibility or mobility.\n\n'If I make it too big, I'll fight blind...'\n\nHis gaze drifted to Elizabeth as she worked. An image flashed through his mind—Lim Cheolho at his birthday party, wearing that ridiculous pointed hat.\n\n'A cone design.'\n\nIncrease the vertical height dramatically, keep the horizontal dimensions tight. Plenty of clearance for the crown underneath, no obstruction to his peripheral vision.\n\n'I'm a fucking genius.'\n\nThe best part? With the First King title's 'exposed appearance' option, he could display the crown's majestic look while actually wearing the protective helmet. Style and substance.\n\nHe couldn't help but grin.\n\n\"Something amusing?\" Elizabeth glanced up, curiosity in her eyes.\n\n\"Just planning ahead.\" Grid cleared his throat. \"Is there a limit to how many jewels can be attached to one item? Say, a ring?\"\n\n\"Dozens, if you make them small enough. But they'd be useless.\"\n\n\"Why?\"\n\n\"Minimum size threshold. Jewels need sufficient mass to maintain their properties. Cut them too small and the effects vanish entirely.\"\n\n\"So most rings have one jewel.\"\n\n\"Correct.\"\n\n\"And a crown?\"\n\nElizabeth's expression shifted to something more calculating. \"Ten. Surely you noticed the Emperor's crown? Ten jewels—the maximum effective capacity. It's the ideal accessory for showcasing high-grade gems. Three for necklaces, ten for crowns.\" She paused. \"Of course, the Emperor is the only person who can afford to fight while wearing one.\"\n\n'Wrong.' Grid suppressed a smile. 'There's one more.'\n\n\"You're planning to give the first batch to your guildmates, right?\" Elizabeth asked. \"Not keep them yourself?\"\n\n\"Why would I do that?\"\n\n\"These are my first attempts with Belial's jewels. The quality will be inconsistent—the later ones will be superior once I've built up skill experience. You should take the best.\"\n\n\"No. I'll use the early ones.\"\n\nElizabeth blinked. \"Didn't you hear what I just—\"\n\n\"I heard you.\" Grid met her gaze steadily. \"Give my people the best.\"\n\nShe held up the jewel she'd just finished, worked through the night. Grid examined it.\n\n---\n\n**[Plainly Crafted Belial's Black Jewel]**\n\n**Rating: C**\n\n**Intelligence +6**\n\n**Shadow Resistance +2%**\n\n*A black jewel crafted by Elizabeth, a craftsman-level accessory maker. Adequate workmanship.*\n\n---\n\n\"See?\" Elizabeth pressed. \"The next batch will be 'delicately crafted' or 'perfectly crafted'—stats at least 1 to 3 points higher. I've worked with enough high rankers to know how this goes. Everyone wants the best.\" She studied his face. \"You're no different, are you?\"\n\n\"The stronger my guildmates, the stronger I am.\" Grid's voice carried quiet conviction. \"I want them powerful for my sake and theirs.\"\n\nElizabeth stared.\n\n\"Besides, I've got S-grade jewels already. These are fine for me.\"\n\n\"...\"\n\n\"You'll reach S-grade eventually, right? I can wait.\"\n\nSomething shifted in Elizabeth's expression—surprise giving way to reassessment. She was twenty years old, barely into university, but she'd seen enough of Satisfy's rankers to recognize genuine intent.\n\n'Maybe... I misjudged him.'\n\n\"The Overgeared Guild,\" she murmured. \"Might be worth staying with for a while.\"\n\n***\n\nFour days later, Elizabeth worked through another night, her hands moving with increasing confidence as skill experience accumulated. She glanced at Grid, still sitting exactly where he'd been since dawn.\n\n\"You're incredible, you know that?\"\n\nShe wasn't surprised anymore. His patience exceeded anything she'd expected.\n\n\"I think I get it now.\" She sat beside him, nodding slowly. \"Nothing came easy for you. You're always careful. Always invest the time.\"\n\n\"Damn right.\" Grid rolled his shoulders. \"Nothing in this world is easy.\"\n\nThe formality between them had dissolved over the past four days. Elizabeth now called him 'Oppa'—he was Korean, older, and after this long working side-by-side, it felt natural. Grid didn't mind. She reminded him of Sehee.\n\n\"You must be exhausted from the all-nighter,\" Grid said, his own fatigue bleeding through. \"Want a shoulder rub?\"\n\nHe'd spent the four days designing the crown and helmet between watching Elizabeth work, then hunting with the Overgeared Skeletons when she logged out. His mind felt scattered, the offer slipping out without thought.\n\n\"Really? That'd be amazing.\" Elizabeth's smile was immediate.\n\nGrid reached out, hands settling on her shoulders with purely practical intent.\n\n\"Ah...!\"\n\nThe moment his fingers made contact, Elizabeth's entire body tensed. Her eyes went wide. Grid, too tired to notice the subtle reaction, applied more pressure.\n\n\"Haah!\"\n\nHis large, calloused fingers—hardened from years of smithing—pressed into the muscles of her neck. Elizabeth felt her strength drain away. She couldn't help but lean back against his broad chest, gaze unfocused on the ceiling, sensations she couldn't quite name running through her body...\n\nThe workshop door slammed open.\n\n\"WHAT THE HELL ARE YOU DOING?!\"\n\nEat Spicy Jokbal stood in the doorway, face crimson, sword half-drawn.\n\n\"YOU ANIMAL!\" He stormed forward. \"You already have two girlfriends and now you're putting your hands on my niece?!\"\n\n\"I don't have any girlfri—\"\n\n\"Don't lie to me! Yura! Jishuka! I'm envious—NO, you're a bastard! Enemy of all men!\"\n\n\"What are you even—*ack!*\"\n\nA boot caught Grid in the side. He scrambled up as Eat Spicy Jokbal advanced, blade gleaming, and made the tactical decision to retreat at speed.\n\n\"Out! OUT!\"\n\nGrid fled the workshop, Eat Spicy Jokbal's roars echoing behind him.\n\n'What the hell is wrong with him this early?' Grid thought, catching his breath halfway down the corridor. He shook his head. 'Whatever. Time to work on that crown and helmet.'\n\nHe turned toward the smithy, already calculating dimensions in his mind."
}