{
  "id": 86,
  "title": "Chapter 86",
  "content": "# Chapter 86\n\nRegas grimaced as he uncorked a health potion and downed it. His fingers flew across the interface.\n\n*Didn't expect to run into someone like this.*\n\nHe toggled his system settings.\n\n\"Whisper unblock. Guild chat unblock.\"\n\nThe chat window exploded.\n\n> {Hey you! You will die if you don't find Regas today!}\n\n> {T-Take it easy, Master.}\n\n> {Yes, excitement isn't good for your skin. Isn't Master a woman as well?}\n\n> {Shut up... All of you, shut up! If you have time to chat, look for that bastard Regas!}\n\nRegas stared at the stream of messages. Jishuka was handling this worse than he'd anticipated. He hesitated, then typed.\n\n> {The slope of Rolf Mountain. Please send support.}\n\nThe response was immediate and violent.\n\n> {Regas!}\n\n> {Hey, Regas! What have you been doing all day? Why did you block the chat? Answer me!}\n\n> {You don't know how we have been tortured because of you!}\n\n> {Rolf Mountain...? I will visit you soon. ^^}\n\nBlack magic screamed past his head. Regas twisted, driving his elbow into the nearest believer's face. The man crumpled. Without looking, Regas typed again.\n\n> {Come prepared for battle. Malacus has appeared.}\n\nAnother wave of chaos.\n\n> {Malacus? The Sixth Servant?}\n\n> {Eh? Why is he on Rolf Mountain? Shouldn't he be with the other Yatan bastards?}\n\n> {What... Where have you been wandering around?}\n\n> {Why is Malacus there?}\n\n> {Isn't he a monster that is level 310?}\n\nThe guild reacted with shock to Malacus' presence. Jishuka, however, had other priorities.\n\n> {Hey! Regas! Are you still with the person called Grid?}\n\n> {Yes.}\n\n> {Grab Grid tightly and don't let him go! He is Khan's disciple that we are looking for!}\n\nRegas frowned at the screen. \"What?\"\n\nHis leg shot out, catching two Yatan followers simultaneously. They flew backward. He ducked behind a tree and typed again.\n\n> {That isn't possible?}\n\n> {It must be. I heard it from a witness. Grid is definitely Khan's disciple.}\n\n> {That eyewitness must be mistaken or gave you a false report.}\n\nHe blocked the chat before the argument could continue. The battle demanded his full attention. His gaze shifted to Grid, who stood alone facing Malacus with that massive greatsword held in both hands.\n\n\"There is no way he can be a blacksmith.\"\n\nRegas shook his head. \n\n*The guild master must be mistaken.*\n\nMeanwhile, Grid was trying to make sense of the situation.\n\n*What is going on?*\n\nMalacus had fixated on him from the moment he'd arrived. The masked priest studied him with unnerving interest.\n\n\"I am impressed that you can endure the pressure of my magic power.\" Malacus tilted his head. \"Then you... are you like Yura? An extraordinary person among travelers?\"\n\nGrid raised his hands in a placating gesture. \"Not really... well, I didn't come here to meet you. So can I go my own way?\"\n\n\"I can't allow that.\"\n\n\"Please have mercy just once. Hehe.\"\n\nMalacus' voice turned cold. \"One of the most insignificant words in the world is mercy.\"\n\nGrid's forced smile died. \n\n*Right. He's one of the most brutal religious figures in Satisfy. Trying to talk with him is pointless.*\n\n\"Tch. Whatever.\"\n\nHe opened his inventory. Armor materialized on his body without hesitation, not caring that Regas was watching. Then he drew Dainsleif, the blade gleaming with the distinctive aura of **+5** enhancement.\n\n> [<span class=\"rarity-unique\">+5 Dainsleif (Reproduction)</span>]\n> \n> **Rating:** Unique\n> \n> **Durability:** 500/500 **Attack Power:** 549~772 **Attack Speed:** -8%\n> \n> * Additional damage equal to 10% of the target's current defense will be dealt.\n> * The greater the number of enemies, the greater damage.\n> * The skill 'Golden Flash' has been generated.\n> \n> A work created by Albatino, the first human to receive the nickname of 'craftsman' before Pagma's era. He attempted to reproduce the mythical weapon, Dainsleif.\n> \n> It is far lacking compared to the original Dainsleif, but he succeeded in restoring some of its features, making it a masterpiece on its own.\n> \n> It was acclaimed as a 'masterpiece of human history' by the founder of the Eternal Kingdom and the king of the north, Loran.\n> \n> The legendary blacksmith Pagma is said to have received great inspiration from Albatino's work.\n> \n> **User Restriction:** Level 250 or higher. More than 1,800 strength. Advanced Sword Mastery.\n> \n> **Weight:** 1,580\n\nMalacus regarded the weapon with mild interest. \"A greatsword. But can it reach my body?\"\n\nThe priest appeared deceptively ordinary. No monstrous features, no horrifying mutations. Just a man in his thirties wearing a black mask and a long cloak. Less intimidating than the creatures Grid had faced in Kesan Canyon.\n\nGrid gritted his teeth. \"You will see soon! Blacksmith's Rage! Quick Movements! Pagma's Swordsmanship, Link!\"\n\nIn the ancient murals, Pagma wielded Dainsleif one-handed with casual grace. Grid lacked the strength for such elegance. He gripped the massive blade with both hands and charged. The sword sang through the air, impossibly fast for its size.\n\nThe edge descended toward Malacus' skull.\n\nA black barrier materialized.\n\n*Clang!*\n\nThe impact jarred Grid's arms. He stumbled back, already moving, already adapting. Dainsleif vanished into his inventory. The **+8 Ideal Dagger** appeared in his hand. **490 mana** spent on Blacksmith's Rage, Quick Movements, and Link. **277 mana** remaining.\n\n\"Wind Blast!\"\n\nThe skill erupted from the dagger's edge. Wind-forged projectiles hammered Malacus from multiple angles. Each one met a black shield that appeared precisely where it would strike, dispersing the force harmlessly.\n\nGrid drank a mana potion without slowing. \"Wind of Justice!\"\n\nThe enhanced wind attack was far more powerful than Wind Blast. It still couldn't penetrate. The black shields appeared and vanished in perfect timing, an impenetrable defense.\n\nGrid's hands shook.\n\n*What is this fraudulent defense skill? How much damage can it prevent?*\n\nMalacus extended one hand from beneath his cloak. \"Your weakness won't be able to break this. Die. Divine Punishme...\"\n\nHe stopped mid-incantation. His body jerked backward as Grid activated Restraint. The invisible pressure crashed over Malacus, overwhelming his senses, forcing him away. Three seconds of vulnerability.\n\nGrid didn't waste it. He turned and ran.\n\n\"Regas! Let's go!\"\n\nThe martial artist was still fighting, fists and feet carving through the remaining Yatan followers with methodical brutality.\n\n\"Regas!\"\n\nRegas glanced at Grid. His face was flushed, eyes bright with combat fervor. \"I don't run away. I will fight. When can I ever meet such a strong opponent again? I want to fight!\"\n\nGrid's expression twisted between frustration and disbelief. \"Are you insane? Aren't you afraid of dropping items and experience upon death?\"\n\nHe wanted Regas' help to find the Divine Shield. But not at the cost of his own equipment.\n\n*If I die and drop items...*\n\nEvery piece of equipment he wore was worth a fortune. The thought of losing any of it made his stomach clench. Grid made his decision. He would escape alone.\n\nAn arrow screamed out of the forest.\n\n*Thunk!*\n\n\"Kuk!\"\n\nMalacus, still partially constrained by Restraint's lingering effects, couldn't react in time. The arrow punched into his shoulder. A woman emerged from the treeline. Jishuka.\n\nShe nocked another arrow without breaking stride, her gaze fixed on Grid. \"If you don't want to be killed by arrows like that monster, you should stay in a corner.\"\n\nHer bowstring sang. The arrow seemed to fly directly at Grid's face, then curved at the last instant, flashing past his ear to strike Malacus in the forehead.\n\nThe black shield appeared.\n\n*Ting!*\n\nThe arrow bounced away. Jishuka's expression didn't change. She fired five more in rapid succession, each targeting a vital point. Shoulder. Throat. Heart. Liver. Eye.\n\n*Ting ting ting ting ting!*\n\nAll blocked.\n\nJishuka's lips curved into a smile. \"The speed of casting is really fast?\"\n\nMalacus allowed himself a moment of pride. \"Heh, your fragile arrows can't touch my body...\"\n\nRegas appeared at his side. The martial artist's fist was already in motion.\n\n\"Penetration.\"\n\n*Crack!*\n\n\"Keok...!\"\n\nMalacus bent unnaturally, his body folding around the impact point. The whites of his eyes showed. Jishuka's next arrow was already in flight.\n\n\"That isn't the real one. This is real.\"\n\n*Thud!*\n\nThe arrow flew without sound, riding the wind current, and buried itself in Malacus' heart. Grid recognized it immediately.\n\n\"Eh? The Special Jaffa Arrow? There are still some left?\"\n\nJishuka shot him a puzzled look. \"How do you know that?\"\n\nGrid's excitement overrode his caution. If Jishuka and Regas could actually beat Malacus, maybe he wouldn't lose anything after all.\n\n\"Oh, I made it.\"\n\n\"What?\"\n\nJishuka stared at him. Then Regas screamed.\n\n\"Kuaaack!\"\n\nGrid and Jishuka whipped around. Five black spears had materialized from thin air, impaling Regas through the torso. Dark magic writhed around the wounds. Malacus, recovered and upright, gripped Regas' head.\n\n\"It is still useless. You will all die by my hands!\"\n\n\"Are we late?\"\n\n\"Hey, Regas! You're still alive?\"\n\nFifteen members of the Tzedakah Guild materialized from the forest. Even Malacus hesitated.\n\n\"How is a group like this...?\"\n\nJishuka's smile returned, sharp and confident. \"Start the hunt.\"\n\nThe Tzedakah Guild averaged above **level 200**. Many held first place in their class rankings. Several were in the top 100 unified rankings. And now there was Grid, an unknown variable. Even against one of the Eight Servants, this was not a force to be underestimated.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\n**Check out my Patreon** for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}