{
  "id": 860,
  "title": "Chapter 860",
  "content": "**[Holy Light Crown]**\n\n**Rating:** Legendary (Set)  \n**Durability:** 180/180 | **Defense:** 20  \n* Intelligence +300  \n* Dignity +200  \n* **Set Bonus (3 pieces):** Defense +500, Health +6,000  \n*A crown forged by the legendary blacksmith Pagma for 5th Pope Franz.*\n\nGrid turned the delicate circlet between his fingers, studying the way light played across its polished surface. He'd favored this crown for years—wearing it to every official function, every time he needed to channel magic. He'd disassembled and reassembled it so many times that he knew every angle of its construction, every nuance of its enchantments. Understanding: 100%.\n\n*A crown is an accessory first, armor second.*\n\nUnlike a helmet built purely for defense, a crown offered flexibility. With the right design, you could prioritize stats, stack beneficial options. As regalia reserved exclusively for those who sat upon thrones, crowns held immense symbolic value—and Grid had exploited that fully. The crown he'd designed after founding the Overgeared Kingdom had boasted 190 points of Dignity. Pure vanity, really. All about appearances.\n\n*This one will be different. This one's for war.*\n\nHis intent during production would shape the final result. A battle-focused design meant substantial room for combat-relevant statistics.\n\n*And with Elizabeth's ten jewels...*\n\nEven at C-grade, those gems would add sixty points of Strength and twenty percent attribute resistance. Grid's pulse quickened. More Intelligence meant access to Braham's enhanced magic. The thought alone set his blood racing.\n\n\"Let's begin!\"\n\n\"His Majesty's at the forge!\"\n\n\"Someone fetch every blacksmith in Reinhardt!\"\n\n\"Move it!\"\n\nThe massive smithy filled with bodies—hundreds of onlookers crowding the workspace. Grid paid them no mind, lost in the design he'd refined over four days. A new crown, synthesizing elements from both the Holy Light Crown and the Saharan Emperor's regalia.\n\nFor the base material, he'd chosen mithril over traditional gold or silver. Mithril's superior strength-to-weight ratio made it ideal, and its high elemental compatibility would amplify the jewels' enchantments. Besides, the silver finish complemented his black hair better than gaudy gold ever could.\n\n*Should've used Seolkwang Stone.*\n\nThe ore was harder, rarer, and retained that same lustrous silver. But the auction houses were dry, and Grid had no leads on a supplier. He only knew of its existence through Pagma's inherited knowledge—he'd never actually worked with the material.\n\n*I can always forge a replacement later.*\n\nBelial's red and black jewels boosted only Intelligence. Eventually, he'd need crowns optimized for other attributes. Flexibility was key.\n\nThe design took shape under his hands—light, oval, closer to a tiara than a traditional crown. No velvet lining cluttered the elegant simplicity. Grid fed mithril into the furnace, where the extreme heat reduced the metal to molten silver.\n\n---\n\n*Is he finally done?*\n\nAfter the battle at Gerad Mountain, Yura had returned to the Overgeared Kingdom alongside Grid and Elizabeth. She'd been waiting ever since—biding her time, choosing her moment carefully. What she'd witnessed in Hell wouldn't be easy to hear. Grid's clone, walking around as a named-class NPC. Just imagining the revelation made her wince.\n\n*How would you feel, discovering your exact double exists somewhere?*\n\nCreepy. Deeply unsettling. She'd decided to hold her tongue until Grid finished his current project. No sense disrupting his concentration with existential crises.\n\n\"Finished!\"\n\nFour days in Elizabeth's workshop, a full week in the smithy. Grid finally emerged, the rumors about his new crown and helmet already circulating among the guild.\n\n\"You worked hard!\"\n\n\"What absurdly powerful item did you make this time?\"\n\nGrid's track record spoke for itself—the man rarely produced mediocre equipment. The Overgeared members gathered quickly, eyes bright with anticipation. Yura joined them, her news about the clone temporarily shelved.\n\n*Let's see what he's made first.*\n\nThe guild's expectations climbed higher by the second.\n\n\"I can't wait!\" Elizabeth had warmed to Grid considerably over the past week—a stark contrast to her initial frigid reception. When she smiled at him now, she looked like an affectionate younger sister.\n\n\"Our new recruit is adorable.\"\n\n\"Such incredible talent, too.\"\n\n\"Like having a reliable little sister around.\"\n\nYura felt an inexplicable flash of irritation as everyone gazed at Elizabeth with those indulgent expressions.\n\n\"Couldn't have done it without Elizabeth.\" Grid, oblivious to Yura's mood, ruffled Elizabeth's hair before producing the crown.\n\nTen dark jewels glittered against a mithril band—each gem a deeper crimson than any ruby, their centers holding an abyss-like darkness. Not flashy. Elegant.\n\nThe crowd held its collective breath as Grid raised the crown to his head. His hair had grown since ascending to kingship—short hair didn't suit a monarch. The silver circlet settled against his black locks, framing sharp eyes and angular features. The effect was striking. Almost otherworldly.\n\n\"Ah...\"\n\nTime and hardship had refined him. His body was lean muscle and old scars, his face carrying the weight of everything he'd endured. Compared to a year ago, Grid had transformed. The Overgeared members stared, transfixed—men and women alike caught by that magnetic presence.\n\n*Thump-thump. Thump-thump.*\n\nIn the silent smithy, someone's heartbeat thundered loud enough to hear.\n\nThe moment didn't last.\n\n\"And this.\" Grid lifted a second piece—a helmet shaped like a towering cone, at least fifty centimeters tall.\n\nHe placed it over the crown.\n\n\"...\"\n\nWhatever dignity Grid had possessed evaporated instantly beneath that iron monstrosity. Silence stretched. Then someone broke.\n\n\"Puhahaha! What—look at that ridiculous thing! Puhahahat!\"\n\n\"Vantner, why are you laughing? That helmet's still better than your bald head.\"\n\n\"Pon, you son of a bitch!\"\n\n\"...\"\n\n*Is it really that bad?* Grid glanced around, confused by the hysterics, then approached a nearby mirror.\n\nAn alien stared back. A creature with an elongated, pointed skull.\n\n\"...I look like a damn squid.\"\n\nHeat flooded his face. Without hesitation, he activated his First King title.\n\n\"Hide helmet appearance.\"\n\n**[The helmet's appearance has been concealed to preserve the First King's dignity. Visual hidden. Stats remain active.]**\n\n\"Thank God.\" The oppressive weight vanished while the defensive bonuses held firm. In the mirror, only the crown remained visible. No more squid. Grid's relief lasted approximately three seconds before Lauel approached, expression grim as a funeral dirge.\n\n\"What's wrong? Did something happen?\" The atmosphere shift set Grid on edge.\n\n\"Your Majesty.\" Lauel's voice trembled. \"Please never show us that appearance again. I almost resigned from the guild on the spot. It was like going permanently blind.\"\n\n\"...\" For once, Grid understood Lauel completely. He nodded quickly. \"I'll always keep it hidden. Don't worry.\"\n\n\"Why did you make it look like *that* in the first place?\"\n\n\"I thought it would be more comfortable worn over the crown... Look, I know how it appears, but the performance is exceptional.\"\n\n\"It better be. That appearance is garbage-tier, so the stats should be myth-rated to compensate.\"\n\n\"...\"\n\n*This isn't working.* Grid decided damage control required transparency.\n\n*Ttiring~*\n\n**[Player Grid wishes to share item information. Accept?]**\n\nThe notification appeared before every guild member. They accepted immediately.\n\n---\n\n**[Overgeared King's Crown]**\n\n**Rating:** Legendary  \n**Durability:** 270/270 | **Defense:** 33  \n* Defense +60  \n* Intelligence +65  \n* Dignity +400  \n* Fire Resistance +20%  \n* Shadow Resistance +15%  \n* Low probability of **Confusing** observers  \n* Maintains loyalty without requiring gifts  \n\n*A crown born from collaboration between Grid—a legendary blacksmith transcending into myth—and Elizabeth, a craftsman-level Accessory Maker. Beautiful and elegant, the household gods take pride in whoever wears this crown.*\n\n*The demonic power of Great Demon Belial within the jewels occasionally induces confusion in those who gaze upon it.*\n\n**Conditions of Use:** Grid  \n**Weight:** 267\n\n---\n\n**[Cone Helmet]**\n\n**Rating:** Legendary (Degraded)  \n**Durability:** 496/496 | **Defense:** 450  \n\n*A cone-shaped helmet.*\n\n*Forged by blacksmith Grid, who ascends beyond legend toward myth itself.*\n\n*The material achieved extraordinary hardness through days of Grid tempering iron alloyed with trace amounts of Belial's hide.*\n\n*However, debate regarding its appearance will rage eternal. The cone shape's purpose defies comprehension.*\n\n*Defense sufficient to maintain legendary status long-term. But that appearance...*\n\n* Stats may decrease depending on wearer's conduct  \n\n**User Restriction:** 3,000+ Strength | Level 340+  \n**Weight:** 4,820\n\n---\n\n\"What the...\"\n\nThe Overgeared King's Crown lived up to its name. The helmet's description matched its absurd appearance perfectly. Both items were undeniably powerful, yet...\n\nConfusion and admiration warred across every face—the exact same emotional cocktail Grid had experienced upon completing the pieces. A bizarre legendary item labeled *degraded* would do that to you.\n\n\"Well... legendary is still legendary...\"\n\nThe performance metrics didn't lie. That helmet provided armor-class defense ratings. Grid was beginning to feel satisfied with the reactions when Yura stepped forward.\n\n\"I need to tell you something. Are you aware you have a clone?\"\n\n\"A clone?\"\n\n*What?* Grid's face flushed as his mind immediately leaped to... certain implications. Only one thing came to mind when someone said 'clone.'\n\n\"What are you thinking about?\"\n\n\"N-Nothing. What do you mean?\"\n\n\"I saw it in Hell. Your clone.\"\n\n\"Hell? What?\"\n\n*Why would my clone be in Hell?* Grid's hand had started moving toward his crotch—checking—before his brain caught up. Something else clicked into place.\n\n\"Tell me everything.\"\n\n---\n\nSimultaneously, at the Yatan Temple...\n\n\"Rumors speak of a vile traitor sniffing around our sanctuary. Demonstrate our god's power. The other Yatan Servants will support you.\"\n\n\"Gladly!\"\n\nRose—who'd climbed to first-ranked black magician during Yura's absence—received a hidden quest notification. The largest she'd seen since the Belial summoning."
}