{
  "id": 861,
  "title": "Chapter 861",
  "content": "\"Excellent.\"\n\nThe Overgeared King's Crown exceeded Grid's expectations. That his work surpassed even the Holy Light Crown—a legendary set piece forged by Pagma himself—bordered on miraculous.\n\n*The intelligence bonus is lower than I'd like.*\n\nNot surprising. He'd designed the crown to enhance his physical combat prowess, prioritizing defense over magical aptitude. The sixty-five points of intelligence came entirely from Belial's jewels.\n\n*Still, it lacks a certain... presence.*\n\nYet he understood the true value of what he'd created. The confusion effect embedded in the crown would strip targets of attack power while weakening their defenses. A passive ability with no mana cost or cooldown that could affect multiple enemies simultaneously? The effect was borderline criminal in its potency.\n\nGrid studied his reflection in the mirror. Unremarkable features stared back at him. His thoughts drifted to Yura's warning, to the clone lurking somewhere in the world.\n\nThe memory of their battle on the Behen Archipelago still haunted him. That thing had wielded Pagma's Descendant abilities with a mastery that made Grid feel like a child fumbling with a practice sword. It had demonstrated fusion techniques Grid couldn't even comprehend—skills that should have been impossible.\n\nThroughout their duel, the gap had only widened. Grid's victory had come down to desperation and the Motley Flail's power—nothing more.\n\n*It died while using Blackening.*\n\nGrid knew that death intimately. He'd experienced it himself—the fall into hell after dying in the blackened state.\n\n*What if the clone is still down there?*\n\nYura claimed the clone remained in its blackened form.\n\n*When Blackening ended, hell expelled me. But what if the clone couldn't deactivate it? What if it's trapped there permanently?*\n\nHis jaw clenched. The thought of that unstoppable opponent hunting him through the shadows made his skin crawl. He'd grown stronger—learned the 100,000 Army Swordsmanship, enhanced his equipment, absorbed the power of great demons—yet fear still gnawed at his gut.\n\nYura reported the clone had executed a five-technique fusion skill. It had also unveiled something called Flower—clearly an expression of Pagma's Descendant's full potential. Grid desperately wanted to master it himself.\n\n*But five fused techniques? How?*\n\nLinked Kill Wave Pinnacle combined four skills, and Grid had only achieved that through Goddess Rebecca's blessing. Divine intervention had granted him power to threaten the gods themselves, earning their collective resentment in the process.\n\n*The clone surpasses even that.*\n\nHad Yura been mistaken? No—there was another explanation.\n\n*Did it receive Yatan's blessing? Is that the key to unlocking five-technique fusion through Pagma's Descendant?*\n\nThe questions spiraled without answers, tension coiling tighter in his chest.\n\n\"What are the great demons playing at... wait.\"\n\nHis breath caught. Belial's reaction during their encounter—the way she'd called him a 'soulless man' with such surprise in her voice.\n\n*She was talking about the clone.*\n\nThe great demons knew. Belial had been wary, almost fearful. Their relationship was clearly hostile. Which meant the clone lived. Still in hell. Still growing stronger.\n\nThe present clone that even great demons feared...\n\n\"This is insane.\"\n\nBorn to kill him. Eternally vigilant. Forever haunted by a shadow that grew more dangerous with every passing day. Grid sank to his haunches, fingers pressed against his temples.\n\n\"Father.\"\n\nGrid looked up. A small boy approached with eyes like deep blue pools—his mother's porcelain skin and his father's midnight hair framing delicate features. Lord.\n\n\"Shouldn't you be sleeping? You have to leave early for the Vatican.\"\n\nLord was real. Flesh and blood, warm and precious. Grid pulled his son into an embrace, feeling the boy's delighted giggle as those small arms wrapped around his neck. The child's face flushed pink.\n\n\"I wanted to see you.\"\n\n\"You can come anytime, Lord. I'll always welcome you.\"\n\n\"But I don't want to be selfish. You're busy protecting the kingdom and everyone in it. I shouldn't disturb you too often.\"\n\n\"Lord...\"\n\nGrid stroked his son's hair, emotion tightening his throat. This child's consideration, his genuine concern—it made everything worthwhile. Yes, Lord was real. In this world, at least, his son existed. His blood ran in these veins.\n\nHe pressed a kiss to the top of Lord's head.\n\n*If only we could be together in the real world too.*\n\nThe thought came unbidden, tinged with longing he quickly suppressed.\n\n\"Father, if something's troubling you, don't worry. I'll grow up strong. I'll protect you.\"\n\n\"...Yes.\"\n\nIn that moment, Grid made a vow. He would secure the Overgeared Kingdom's future before Lord came of age. This precious child would never face the hardships Grid had endured.\n\n*Clone, you're nothing but a fragment. A broken piece.*\n\nHe would destroy anything that threatened his family. His expression hardened, cold as moonlight on steel.\n\n***\n\nMorning sunlight bathed Reinhardt in gold. In the early hours, the streets maintained their peaceful beauty, though Grid's attention focused on a sight that outshone even the dawn-touched architecture.\n\n\"Travel safely.\"\n\nIrene stood before him, radiant in the soft light. The most beautiful woman in his world. Grid kissed her cheek, gratitude and pride swelling in his chest for this wise, loving wife.\n\n\"Father! Me too!\" Lord spread his arms wide, face bright with expectation.\n\nGrid kissed his son's soft cheek, then turned to the shadows. \"Their safety is your responsibility. No matter what.\"\n\n\"Of course.\" Kasim's voice emerged from the darkness, solid and reassuring.\n\nThe Vatican was their destination—Pope Damian's personal invitation. Between that safe haven and the escort assembled for the journey, Grid had every reason to feel confident. Kasim, Chucksley, Royman, and a contingent of Rebecca's Daughters candidates. Even Agnus would struggle to breach those defenses.\n\n*Is it enough?*\n\nHis gaze shifted to Mercedes at his side. She read the anxiety in his posture.\n\n\"Do you want me to accompany them?\"\n\nThough his safety was her highest priority, Mercedes had learned to be flexible—to consider his wishes as well as her duty. She would leave his side temporarily if he required it.\n\nGrid considered, then shook his head.\n\n\"No. The escort is sufficient.\"\n\nThey already had ample protection, and Damian would provide additional guards at the Vatican. Any more would be wasteful. As king, he had to separate personal feelings from practical decisions. Mercedes's place was here.\n\n\"Safe travels.\" Grid smiled and waved as the carriage pulled away, watching until it vanished from sight.\n\n***\n\nGreen hair fell across Agnus's face as laughter erupted from his throat—harsh and cutting. His mouth stretched wide, revealing rows of pointed white teeth. The madness danced in his eyes for a moment before he regained control.\n\n\"According to our contract, you need assistance raiding the Vatican.\"\n\nThe arrangement between Agnus and the Yatan Church was straightforward: they aided his pursuit of the Stone of Life, he provided his strength when called upon. Baal's Contractor and the Yatan Church were bound together by design.\n\nThe smile faded. Agnus reviewed the quest details, then rose from his seat.\n\n\"Fine. Can't be helped.\"\n\nHe needed the Yatan Church. Maintaining their favor required accepting missions like this, no matter how inconvenient.\n\nRose's expression brightened at his acceptance. She had no way of knowing that her carefully prepared trump card would soon become a liability. How could she anticipate such a thing?\n\n***\n\nThe Vatican buzzed with activity. Hosting the Overgeared Kingdom's queen and prince—both closely connected to the Rebecca Church—demanded extensive preparation. Despite the workload, anticipation thrummed through Damian. He wondered how much Lord's divine power had grown since their last meeting.\n\n\"Please take care of yourself,\" Isabel chided.\n\n\"Of course, Isabel-chan.\"\n\nIn the distance, carriages wound up the hillside toward the Vatican gates. The lead vehicle was magnificent—large, ornate, a testament to the Overgered Kingdom's accumulated wealth.\n\n\"Oh...!\"\n\nThe Rebecca believers gasped as a young boy stepped from the carriage. The elders, in particular, stared in awe. Whatever modest expectations they'd harbored evaporated instantly. They rushed down the stairs to greet Lord personally, their voices overlapping in excitement:\n\n\"A true pope!\"\n\n\"Why would such a child be born to the Overgeared King...?\"\n\nDamian felt a pang of... something. Jealousy? Inadequacy? The elders' attention fixed entirely on Lord, leaving Damian alone until he sought comfort by burying his face against Isabel's shoulder.\n\n\"Teacher Damian!\" Lord's voice rang out, bright with recognition.\n\n\"Lord-chan! You made it!\"\n\nThe reunion between the boy who'd captured the hearts of countless Rebecca's Daughters candidates and the current pope unfolded beneath the statue of the Goddess. Was it imagination, or did Rebecca's stone face appear troubled today? Isabel felt an inexplicable twist of unease."
}