{
  "id": 862,
  "title": "Chapter 862",
  "content": "Damian had heard Irene was in her thirties now, yet she remained as pure and beautiful as ever—untouched by time. She'd been perfect even before reaching maturity, and age had done nothing to diminish that perfection.\n\n*She's older than Grid.*\n\nA bittersweet smile crossed Damian's face as he watched Irene set down her teacup. Having fallen for Isabel himself, he understood all too well how painful the gap between players and NPCs could be. \n\nIrene gazed fondly at her son, Lord, who sat trapped between the bald elders, his young face stiff with embarrassment. Damian couldn't help but smile as he turned his attention to the boy as well.\n\n\"Prince Lord's manners have improved considerably. Despite possessing innate talent that reaches toward the heavens, he remains humble and upright—a testament to your dedication.\"\n\n\"You're too kind. The prince was simply born with a good heart.\"\n\nIrene knew better than most that character couldn't be molded through education alone. As a prominent noble from the fallen Eternal Kingdom, she'd witnessed countless corrupted aristocrats who'd hurt the weak without hesitation and pursued only their own interests, despite all their tutoring and training. That's why she remained forever grateful that Lord respected everyone equally, regardless of status.\n\n*He's like Grid.* \n\nThe thought of her husband brought a smile to her lips. It would have been the same even if she'd known about Grid's past personality. To Irene, Grid was everything.\n\n\"...\"\n\nBathed in sunlight, Irene's smile was radiant enough to make both Damian and Isabel's cheeks flush. Damian shook his head and rose from his seat.\n\n\"Ahem. Elders, please don't trouble Prince Lord any further—he must be tired. I'll escort him back.\"\n\nAfter bidding farewell to Irene, Damian strode across the green grass. His gait carried the aggressive confidence of a paladin rather than the measured grace of a priest—one of many reasons the elders found him distasteful. \n\nStill, what human existed without flaws? Not all the elders disapproved of him. Some acknowledged his strengths, while others held high expectations. Compared to the fallen Pope Drevigo and that snake Pascal, Damian was an excellent pope. For the sake of the church, the elders needed to support him. He was already in his third year, after all.\n\n\"Elders, release the prince. Can't you see he's suffocating in a cloud of elderly bachelor musk?\"\n\n\"*Cough*...\"\n\nThe elders, who'd been mesmerized by the divine power radiating from Lord, finally snapped back to awareness. Ashamed at having forgotten the boy's discomfort, they moved to help—though their expressions showed delight rather than embarrassment.\n\n\"Prince Lord, I'll see you at dinner. We'll speak more then.\"\n\n\"Prince, don't forget your prayers to Goddess Rebecca.\"\n\n\"The goddess shall bless you...\"\n\nThe elders bowed before stepping back. Completely enchanted by Lord's divine power, they spoke to him as if he were the goddess's personal messenger. Finally able to breathe freely, Lord gulped down air. Damian shrugged.\n\n\"You know, it's okay to act your age sometimes. If you're already this concerned with appearances at such a young age, you'll be old before your time.\"\n\n\"I'd rather be old than embarrass Father.\"\n\n\"Ah...\"\n\nLord's response was commendable, yet Damian felt a pang of regret. Without thinking, he reached out and ruffled the boy's hair.\n\n\"Oh—I apologize.\"\n\nNo matter how young, Lord was still a prince. For Damian to place his hand on the boy's head so casually was incredibly rude. He was still stammering apologies when Lord stepped into his arms.\n\n\"Please keep patting my head, Teacher.\"\n\n\"Gah! Lord-chan, you're too adorable!\"\n\nAnd so...\n\n\"Your Holiness! This is completely improper—!\"\n\n\"Think of your dignity, Your Holiness!\"\n\nDamian ended up laughing while serving as Lord's horse, galloping through the Vatican gardens as the panicked Isabel and Rebecca's Daughters gave chase. Watching the peaceful scene from beneath a shaded tree, Irene smiled contentedly.\n\nMeanwhile, the Overgeared Knights assigned to guard her and Lord stood stunned. That the pope of the Rebecca Church—one of the greatest powers on the continent, rivaling even the Saharan Empire—treated their young prince like a beloved nephew... they felt both proud and awed.\n\nCoke, in particular, swelled with pride.\n\n*The relationship between the Overgeared Kingdom and the Rebecca Church runs deeper than the rumors suggest. Coming here was the right choice.*\n\nAs one of the third generation 10 Rookies, Coke had recognized the Overgeared Kingdom's potential early. Back when he'd still thought himself a genius, he'd traveled to the fortified city of Patrian—only to be knocked flat by a bone Piaro had casually thrown. That moment had convinced him. He'd joined the kingdom the day it was founded.\n\nYears later, through pure skill and dedication, he'd earned his position as an Overgeared Knight. Even if Grid didn't know him personally, Coke remained loyal, determined to dedicate his life to the kingdom. He had no doubt the Overgeared Kingdom would one day unite the continent, and he dreamed of becoming a noble when that day came.\n\nSome called him foolish. They argued he was taking the hard path when his talent could have secured a stable future in the empire. Coke had hesitated, especially when rumors spread that the new kingdom was hostile to the empire. He'd seriously considered switching allegiances.\n\nBut Coke wasn't the type to reverse course once he'd made a decision. More importantly, he was a devoted fan of Grid. He believed in Grid and the Overgeared Guild.\n\nThen the impossible happened—the Overgeared Kingdom became the first in history to establish a truce with the empire. Now, Coke's doubts had vanished entirely. He watched the kingdom flourish while honing his skills and faithfully performing his duties.\n\n\"Sir Coke?\"\n\n\"Ah—sorry.\"\n\nLost in thought while watching Damian and Lord play, Coke hadn't noticed Knight Royman approaching. She gave him a pointed look.\n\n\"Have you forgotten the fundamentals of escort duty? You must remain *most* vigilant when the surroundings appear safe.\"\n\nRoyman spoke in a deliberately deep voice, still unaware her gender had been discovered long ago. She never noticed how her colleagues conveniently vanished whenever she entered the showers or changing rooms.\n\nStill, her skill was undeniable. At level 320—only nineteen levels above Coke's 301—she was easily twice as capable in combat.\n\nIt wasn't just in comparison to Coke, either. Among all the Overgeared Knights trained by Asmophel, Royman stood out as uniquely powerful. Many speculated she'd obtained a hidden class or skill from working the fields alongside Piaro.\n\n\"Yes, ma'am. I'll keep that in mind.\"\n\nCoke responded with appropriate tension, adjusting his position to keep both Irene and Lord in view simultaneously. It wasn't just to earn Royman's approval, though. If the Overgeared Kingdom was to thrive, Grid needed to triumph—and Coke felt personally responsible for ensuring Irene and Lord's safety.\n\n*So many notable figures.*\n\nCoke's gaze drifted down the hill. A parade of carriages bearing royalty from across the continent continued streaming into the Vatican. Even a carriage flying the Saharan Empire's flag rolled past. Every nation except the warring Valhalla and Ultina had gathered to celebrate Damian's tenure as pope.\n\n*An imperial prince...?!*\n\nCoke's eyes widened at the sight of a carriage drawn by four white horses.\n\n2nd Prince Dulandal. He hadn't expected one of the empire's greatest powers to attend, and the realization drove home just how immense the Rebecca Church's continental influence truly was.\n\nDamian set Lord down. \"Lord-chan, return to your quarters with your mother and rest. I'll see you at dinner.\"\n\n\"Yes.\"\n\nLord answered gently, not voicing his desire to keep playing. The bright child understood Damian's position. Once the pope departed to greet the royal families—including the imperial delegation—the scene shifted.\n\n\"Position the golden statue there.\"\n\n\"Station the 4th Knights Division at the village entrance. Security is as important as hospitality.\"\n\nThe elders bustled about the Vatican grounds. Unlike with Lord, they showed no particular interest in the arriving guests—not even the empire's representatives. This was only natural. The Rebecca Church was a transcendent institution. It bowed to no worldly power. Now that Grid had purged Pope Drevigo and Pascal's corrupt factions, the church was rapidly reclaiming its full authority.\n\nCoke felt increasingly fulfilled as he escorted Irene and Lord. It was both interesting and satisfying to know the arrogant elders treated Prince Lord with such special regard.\n\n*Step, step.*\n\nAs Lord led the procession down a red-carpeted corridor toward their assigned quarters, he whispered softly, \"Teacher, are you uncomfortable?\"\n\nA voice emerged from the shadows. —*No... I'm fine...*\n\nKasim. He claimed to be fine, but his voice trembled.\n\nIn truth, he was anything but fine. 2nd Prince Dulandal of the Saharan Empire—the man who'd just entered the Vatican—was responsible for Nero's destruction. Kasim couldn't suppress the anger and resentment boiling in his chest at the sight of his enemy. Maintaining his composure required every shred of willpower he possessed.\n\nChucksley sensed his struggle. \"Don't cause an incident.\"\n\n—*I know,* Kasim replied, his tone tight.\n\nThe laughter vanished from Lord's face as he overheard the exchange.\n\nMeanwhile, the other three remained oblivious to the shifting atmosphere. Irene and the Rebecca's Daughters candidates chatted pleasantly, while the young knights—Royman and Coke included—focused solely on their security detail.\n\nDark clouds gathered overhead once more. Thunder rumbled through the windows, heavy and ominous.\n\nAt the same moment, atop Kay Mountain overlooking the Vatican's white buildings...\n\n\"What a gathering of lunatics.\" \n\nAgnus laughed as he arrived late to the appointed meeting place. Rain soaked through his boots while images of the Yatan Servants flickered across the stormy sky above."
}