{
  "id": 863,
  "title": "Chapter 863",
  "content": "# The Shame of Yatan\n\nThe records spoke of five failures.\n\nYura, Eighth Servant—betrayed the Church.\n\nDive, Seventh Servant—fell during the infiltration of the Saharan Empire.\n\nMalacus, Sixth Servant—killed while preparing a ritual in Winston.\n\nNeberius, Fourth Servant—slain during the invasion of Bairan.\n\nTallos, First Servant—murdered by an unidentified mage who breached their headquarters.\n\nEach name was a scar on the Yatan Church's pride. Five agents, handpicked by the Great Demon Amoract herself to serve the evil god, cut down by unknown enemies. The humiliation burned.\n\nWhen Tallos died, Likaos inherited his mantle. As the new First Servant and Amoract's chosen voice, his first command rang with vengeance.\n\n\"Rebecca's lapdogs and the filth who worship them gather at the Vatican. We will sweep them from existence. Destroy the Vatican. Restore the Church's fallen glory!\"\n\nThe calculation was simple. Rebecca's Daughters were dying—their bodies rotted from within by the curse of three divine artifacts. Meanwhile, the newly appointed Yatan Servants stood young and strong.\n\nBeyond crushing the Rebecca Church, this was a chance to strike at the Empire and surrounding kingdoms in one blow. Likaos deployed all five Servants and called upon Baal's Contractor for support.\n\n\"Keke... what a lovely gathering of monsters.\"\n\nRain hammered the summit of Kay Mountain. Rose—ranked first among black magicians and bearer of the Eighth Servant's mantle—stood beside Baal's Contractor Agnus and the four other Servants, gazing down at the Vatican below.\n\nThe Overgeared King? Powerful enough to raze the Vatican twice over, perhaps. But one man was just that—one man.\n\nThe Red Knights escorting the imperial prince? Disgraced warriors who'd lost their emperor's trust, teetering on the edge of ruin.\n\nRebecca's Daughters? Crippled by divine artifacts, already half-dead.\n\n\"Pathetic.\"\n\nLikaos had judged them trivial. Agnus agreed. Yet the force assembled here was overwhelming—he could feel it in the shadows shifting behind him. Thousands of black magicians, moved into position in absolute secrecy.\n\n***\n\n\"Ha ha! Remarkable!\"\n\n\"Prince Dulandal never ceases to amaze!\"\n\n\"Truly worthy of the imperial bloodline!\"\n\nThe dinner banquet unfolded exactly as expected. Royal families from across the continent clustered around the Empire's Second Prince like moths to flame. Despite trailing the First Prince—backed by the Emperor—and the Fourth Prince—championed by the Empress—Dulandal's reputation preceded him. A man who could topple kingdoms before breakfast commanded attention. The smaller nations dependent on imperial favor naturally sought his good graces.\n\n\"Hmm...\" \n\nDulandal's attention drifted from the sycophants surrounding him. Across the hall, silver hair caught the light like spun moonlight. Even in the Empire, such beauty was rare. But it was her gentle bearing that truly captured his interest.\n\n\"Who is she?\"\n\nThe question prompted immediate answers from those vying for his attention.\n\n\"The Overgeared Queen, Your Highness.\"\n\n\"Ah... the Overgeared King's wife.\"\n\nThe Overgeared King—the man who'd forced the Empire to attempt *diplomacy* for the first time in its history. Emperor Juander, who'd never hesitated to invade any corner of the continent, treated this upstart with such caution he'd extended a state invitation.\n\n\"Pity.\"\n\nDulandal drained his cup. Fate could be cruel—that such a woman had already given her heart to another.\n\nHis gaze shifted to a young boy standing nearby. Ocean-blue eyes—the same striking shade as the silver-haired queen. Alabaster skin and ebony hair framed a face that radiated innate grace despite his youth.\n\n\"And the child?\"\n\n\"The Overgeared Prince, Your Highness.\"\n\n\"Indeed...\"\n\nThe Overgeared King's son. What potential lay dormant in such a vessel?\n\nIntrigued, Dulandal moved closer. The First Prince of the Fold Kingdom—standing with the boy—went rigid.\n\n*An imperial prince... here?!*\n\nDuring the Overgeared Kingdom's founding ceremony, Fold had sworn itself as a tributary state. They'd severed all ties with the Empire, casting their lot with their new overlords. But two centuries of slavery couldn't be erased overnight. Fear lived in the blood.\n\nPrince Shining's hands trembled.\n\n\"Stay back.\"\n\nPrince Lord's small hand caught Shining's arm. Something shifted. The terror draining color from Shining's face... stopped. Lord's gentle voice melted the ice in his chest. That small, warm touch rekindled his courage.\n\n\"No.\" Prince Shining gripped Lord's hand and set his jaw. He didn't retreat. \"I am First Prince Shining of the Fold Kingdom. It is an honor to greet such a distinguished prince of the Empire.\"\n\n\"Hoh...\"\n\nThe greeting threw Dulandal. What royalty of a backwater tributary dared show such dignity before an imperial prince? Astonishing—and vaguely offensive—that no trace of fear showed in the boy's eyes. Still, Dulandal hadn't earned his position by displaying every emotion that crossed his mind.\n\nHe smiled, resting a hand on Shining's shoulder. Political reality made for better weapons than personal pique.\n\n\"Did the Fold Kingdom not declare its independence from imperial protection?\"\n\n\"Yes... but how could a small, poor kingdom like ours continue to burden the Empire? We offer nothing of value. It consumes imperial resources to shelter us. My father believed we could no longer justify the expense. Independence was... inevitable.\"\n\n\"Sheltering a small kingdom costs the Empire little.\"\n\n\"...\"\n\n\"Independence is the Emperor's decision to grant. Not yours to take.\"\n\n\"...\"\n\n\"His Majesty is deeply displeased. I wonder—has the Fold Kingdom forgotten the Empire's generosity?\"\n\n\"That... no! Never! We could never forget what the Empire has done for us...\"\n\nThe color drained from Shining's face again. His voice cracked. His body shook.\n\nThe Fold Kingdom sprawled across desolate wasteland. For two hundred years, its kings had dreamed of reclaiming that barren earth, of feeding their people. The Empire had made those dreams impossible.\n\nThe Saharan Empire—powerful enough to crush Fold like an insect—had demanded crushing tributes for two centuries. Development became impossible. The people starved. Yet the tributes continued.\n\nFor two hundred years, the Fold Kingdom had died by inches. Resistance? Futile. Kings and officials who dared rebel were executed for \"treachery.\" Helpless, Fold had festered with rage and terror in equal measure.\n\nThat terror lived in Prince Shining now. At the mention of the Emperor, he seemed to physically shrink, his eyes going dark. The end of his dynasty felt suddenly, horrifyingly close.\n\nThen Lord grabbed his collar.\n\nStability flooded back through Shining's chest. His courage swelled. Warmth wrapped around him like an embrace, and he understood with crystal clarity—this was a blessing. Divine power.\n\n*This child... has divine power?*\n\nLord beamed up at him. \"Pope Damian has been teaching me.\"\n\n\"...?\"\n\nThe Pope tutoring a foreign prince? Absurd. Prince Shining found the claim bizarre, yet he didn't doubt Lord. He simply assumed the child had misunderstood something.\n\nDulandal, however, felt something shift.\n\n*What?*\n\nTwice now. Twice something had stabilized this Prince Shining—whose name Dulandal would forget by morning—at moments of crisis.\n\n*An artifact?*\n\nRed light kindled in Dulandal's black eyes. The \"red energy\" unique to imperial bloodlines. Through that crimson lens, Dulandal studied Shining more carefully.\n\nThen his attention snapped to the small boy beside him.\n\n*What... is this divine power?*\n\nThe aura radiating from Lord seemed to proclaim: *All beings save me are wicked.*\n\nIf this child continued training, within ten years he'd surpass even Pope Damian's divine power.\n\n*Is he truly the Overgeared King's son?*\n\nBlacksmithing talent would make sense. But divine power...\n\n*A mutation. Born with it.*\n\nWhy would the Overgeared King send a small child to the papal celebration? The answer crystallized.\n\n*His son was born with exceptional divine power. He's showing the boy to the Vatican early—establishing connections for when he leaves him here permanently.*\n\nLord lacked the talent to inherit his father's legacy, but the Vatican would treasure him. The Overgeared King was demonstrating his son's potential to the Pope and Cardinals, laying groundwork for a future alliance.\n\n*Forming a bond with the Vatican through his own child... clever.*\n\nHadn't the Empire done the same with Pascal? Dulandal felt genuine admiration.\n\n*Using even his young son as a political asset... truly, the Overgeared King deserves His Majesty's respect.*\n\nA smile touched Dulandal's lips.\n\n\"Hello, Your Highness.\" Lord bowed with practiced grace. \"I am Lord, son of the Overgeared King.\"\n\nSix years old. With such pure, innocent features, impossible to imagine him as a future adversary. Right now, he was simply... adorable.\n\n\"Ahem.\" Charmed despite himself, Dulandal cleared his throat and forced his expression back to stern propriety. \"Well met. I have heard much of your father's—\"\n\nSteel rang against steel.\n\nThe Red Knights flanking Dulandal drew their swords in unison.\n\n\"What?!\"\n\nThe hall erupted into chaos. Confusion rippled through the crowd as blades gleamed under the chandeliers. Paladins rushed forward. Prince Shining wrapped his arms around Lord protectively. Coke abandoned his post beside Irene and sprinted over.\n\n\"What are you doing?!\"\n\nBitter hostility radiated from Coke toward the Red Knights threatening his prince. He assumed they meant Lord harm.\n\nRoyman saw deeper. Her glare fixed on the shadow beneath Lord's feet.\n\n*King of Shadows... you fool...!*\n\nKasim—hidden in Lord's shadow—had released killing intent toward the imperial prince. The knights had merely reacted.\n\n*You've compromised everything...*\n\nTension crackled through the air like lightning.\n\n\"His Holiness, Pope Damian, is entering!\"\n\nThe celebration's guest of honor appeared. Damian pretended not to notice the commotion, smoothly redirecting everyone's attention. Protecting Lord from an incident that could turn ugly.\n\n\"Tch...!\"\n\nThe Red Knights seethed. Even if the imperial prince had been threatened, they couldn't act freely here. Not even a solo number knight could defy the Pope casually—especially not on sacred ground.\n\n\"Your Holiness!\" Prince Dulandal stepped forward, his voice carrying across the hall like a proclamation. \"It seems a rat is hiding among us. For your safety and ours, shouldn't we flush it out?\"\n\n\"...\"\n\nLord and Coke's faces reflected their dismay. In the shadows, Kasim cursed his own mistake.\n\nOn the ceiling of the banquet hall, someone else reacted with surprise.\n\n*How did he sense it?*\n\nSilvenas—the Yatan Fourth Servant, a darkness-type demonkin capable of becoming one with shadow itself—had believed her stealth rivaled the legendary assassin Lantier's. Yet somehow, she'd been detected.\n\n*They're more skilled than expected.*\n\nNo. Not detected yet. But if she moved now in panic, she'd give herself away. Silvenas remained perfectly still, swallowing hard."
}