{
  "id": 864,
  "title": "Chapter 864",
  "content": "\"There's a rat skulking in the shadows. For the safety of His Holiness and everyone present, shouldn't we flush it out?\"\n\nPrince Dulandal's voice rang across the banquet hall, drawing confused murmurs from the assembled nobility. A rat? Royalty from foreign kingdoms, unable to sense the murderous aura bleeding from the shadows, exchanged bewildered glances. Was the imperial prince seriously making a scene over vermin? They dismissed it as the whim of a bored aristocrat seeking entertainment.\n\nThe Overgeared Knights, however, recognized the threat immediately. If the Red Knights had detected Kasim's killing intent, how could they possibly protect both him and Prince Lord? Every muscle tensed as they calculated their options.\n\nHidden in Lord's shadow, Kasim's thoughts spiraled. *I've endangered the prince. All because of me...*\n\nHis mind dragged him back through the years.\n\nA village, nestled deep in the mountains. The home of the Nero Clan. His people had been gentle folk—content with little, quick to forgive, slow to anger. Days passed in simple contentment, families gathering under warm hearths. Peace had seemed eternal.\n\nUntil the day the imperial army arrived.\n\nPrince Dulandal had descended upon them with dozens of Red Knights and hundreds of soldiers. The words he'd spoken that day remained seared into Kasim's memory like a brand. *\"That skin, darker than midnight. Those unnaturally long arms. You're grotesque. The Empire recognizes neither your territory nor your religion. You're forbidden homes, forbidden clothing. You're beasts—livestock at best. If you wish to live, accept your place. Otherwise, leave your hides behind as payment. Don't protest. Animals have no right to human speech.\"*\n\nEvery syllable remained vivid after all these years. For young Kasim, sheltered and innocent, those words had shattered his understanding of the world. *Beasts.* They'd called his people *beasts*. In an instant, they'd been stripped of their humanity.\n\nThat day, rage had taken root in his soul for the first time—a fury that consumed the Nero people's gentle nature entirely. He hadn't been alone. Thousands of his kin had been driven to fury by this denial of their very existence. They'd fought back against the Empire trying to erase them.\n\nThey'd been slaughtered.\n\nThe Nero, despite their superior physical abilities, had been children before the Empire's trained knights. Massacred to the last.\n\nAll except Kasim.\n\n\"...\"\n\nSometimes survival felt like its own curse. Revenge consumed his thoughts—an all-encompassing need to see the Empire burn. But now, caught between the traumatized boy who'd witnessed genocide and the loyal retainer who served Prince Lord, he couldn't find a clear path forward.\n\n\"A stray rat is no different from an ownerless dog,\" Dulandal continued, his tone casual. \"I'll hold no one here accountable for harboring it.\"\n\nThe message was clear: *I know you're there, glaring at me from the darkness. Show yourself now, and your little prince stays safe.*\n\nThe prince was maintaining diplomatic appearances—making it clear he'd rather not break the truce his emperor had personally negotiated. But he'd settle for hunting down one insolent shadow.\n\nThe Overgeared Knights understood perfectly.\n\nChucksley's gaze flicked toward Lord's shadow—a pointed look that said everything. His expression held genuine regret. Kasim was valuable to the Overgeared Kingdom, no question. But a kingdom's talent existed to *serve* that kingdom. When that talent endangered the realm, the choice became simple.\n\nThe unspoken command reached Kasim's heart with perfect clarity.\n\n*Yes.* His shaking gaze steadied. The bloodshot red faded back to normal. Drawing a slow breath, Kasim forced his racing thoughts to calm. Once the Overgeared Kingdom grew strong enough—once the prodigy Lord reached his full potential—they would crush the Empire.\n\n*If I can't take my revenge personally, I'll entrust it to them.* He would leave the Empire's destruction to the Overgeared King and his heir. In exchange, he'd accept responsibility for his loss of control today. *This was my mistake. Mine to answer for.*\n\nKasim prepared to step from the shadows.\n\n\"Don't move.\"\n\nLord's voice? No—someone else had spoken first. Queen Irene stepped forward.\n\n\"Oh?\"\n\nThe woman who'd been standing quietly in the corner, seemingly uninvolved in political matters, was inserting herself into this crisis? Prince Dulandal's hostility dimmed, replaced by curiosity. What would this beauty who'd caught his eye demonstrate—courage or foolishness?\n\n*This just got worse.*\n\nIrene met the prince's gaze without flinching. \"Your Highness, that person is neither a rat nor a stray dog. He serves as Prince Lord's legitimate escort—a valued member of our kingdom.\"\n\n\"Excuse me?\" That wasn't what Dulandal expected at all.\n\n*Stupid woman.*\n\nHis expression hardened. \"Are you claiming that Prince Lord's escort attempted to harm me? That the Overgeared Kingdom sought to injure the Empire's second prince? You realize that constitutes a hostile act—a violation of the truce?\"\n\n\"Not at all. Consider why your own escorts drew their weapons. They were protecting you, weren't they?\"\n\n\"Obviously.\"\n\n\"Prince Lord's guard acted from the same duty. As someone who's served at the young prince's side since birth, he responded instinctively when your knights advanced on his charge.\"\n\n\"Killing intent is an 'instinctive response'?\"\n\n\"Isn't murderous aura less threatening than drawn steel?\"\n\n\"What?\" The logic hit Dulandal like a hammer. By acknowledging that the Red Knights had unsheathed their blades in his defense, he'd legitimized the shadow guard's reaction to that perceived threat. The absurdity of it left him momentarily speechless.\n\nHis anger flared—then subsided as quickly as it came. Dulandal's features twisted briefly before he forced a laugh. With exaggerated courtesy, he extended his hand toward Irene. \"Your Majesty's cleverness is admirable. Would you permit me to kiss your hand by way of apology?\"\n\n\"The honor is mine.\"\n\nWho could refuse such a formal gesture from an imperial prince? There was no reason to decline. Irene offered her pale hand without hesitation.\n\nDulandal's lips brushed her skin.\n\nLord's clear eyes sharpened with an edge that mirrored his father's. The six-year-old had caught the naked desire in the prince's gaze.\n\n*What?* The Red Knights protecting Dulandal collectively tensed. The pressure radiating from this child—barely old enough to hold a practice sword—it couldn't be real. It had to be their imagination.\n\nWatching from his barrier prison, Damian's unease deepened.\n\n*Queen Irene defused the situation, but...*\n\nWould this child's reaction ignite a new crisis? Damian tensed, preparing to intervene—\n\n*Flash!*\n\nBlinding light flooded the banquet hall. This wasn't the warm radiance associated with Goddess Rebecca, but something harsh and profane that forced eyes shut against its assault. Damian recognized it instantly. Even as his vision whited out, he shouted: \"Black magic! Paladins, protect the imperial prince and the royal families! Gah—!\"\n\nHis warning cut off. A red pentagram had appeared beneath his feet, glowing with malevolent power.\n\n>[Part of the will of God Yatan has cut you off from the world.]\n\n>[You can't take any action inside this dark barrier.]\n\n>[The barrier can only be destroyed from the outside.]\n\n*Yatan's will itself?* As Damian's vision cleared, he looked up to see a figure descending from the ceiling—a demonkin wreathed in shadow. Silvenas, one of Yatan's Servants.\n\n\"I got him! The pope's neutralized!\" Her cry served as a signal.\n\nChaos erupted beyond the hall. An explosion tore the doors from their hinges. Dust billowed inward as the temporarily blinded royalty stumbled in confusion.\n\n\"Punish the Goddess's dogs!\"\n\n\"God Yatan's curse awaits you all!\"\n\nBlack Magicians stormed the banquet hall, shouting zealously. Knights from various nations drew weapons to defend their lieges. The Rebecca Church's elders and paladins scrambled into defensive positions. In the corner, the Overgeared Knights formed a protective circle around Lord and Irene.\n\nFive more figures entered behind the first wave—three NPCs and two players.\n\nYatan's Third Servant, Aliburn.\n\nYatan's Sixth Servant, Cardiora.\n\nYatan's Seventh Servant, Hill.\n\nRose, ranked first among black magicians and Yatan's Eighth Servant.\n\nAnd finally—\n\n\"Agnus!\"\n\nBaal's Contractor. Players like Coke who'd attended the banquet paled. They might not recognize Yatan's Servants, but Agnus's reputation preceded him.\n\n*Four Servants including Silvenas?* Trapped in his barrier, Damian assessed the threats beyond Agnus with growing alarm. Rebecca's Daughters Candidates drew their divine artifacts and rushed toward him.\n\n\"...!\" He shouted from inside the barrier, but no sound escaped. Isabel made the logical choice—destroying this curse took priority.\n\nShe drove Lifael's Spear into the barrier. Nothing happened. The wall didn't crack, didn't even ripple. Physical force and divine power alike proved useless.\n\n\"Leave the barrier to us! Protect the civilians!\"\n\n\"Guard Prince Lord at all costs!\"\n\nThe elders moved forward. Their confidence reassured Damian slightly—these stubborn old men finally proving useful. But relief died quickly.\n\n\"Kyaaah!\"\n\n\"Guaaagh!\"\n\nGuests' screams filled the hall. The knights and paladins who'd tried to respond seemed trapped outside—Agnus's undead blocking their advance. Isabel grasped the situation immediately and sprinted to Prince Lord's position. After confirming his safety, she turned toward Agnus.\n\n\"Keke! Kekekeke!\"\n\nRoyal screams mixed with maniacal laughter. The banquet hall descended into pandemonium.\n\n\"It's alright. Everything's alright.\"\n\nIrene had once been captured as a virgin sacrifice for Yatan. The moment the Yatan Church appeared, those memories had surged back with suffocating force. But she refused to let it show. She pulled her young son into her arms, forcing herself to smile. *He can't see me afraid. I won't let him feel unsafe.*\n\n\"...Mother.\" Lord felt his mother trembling—felt the fierce love behind that tremor. His gaze shifted toward the battlefield, burning with the desire to fight.\n\n\"No. You're not ready for them.\"\n\n\"His Highness is right. Please stay back.\" Kasim, Chucksley, and the younger knights stepped forward to shield them both."
}