{
  "id": 866,
  "title": "Chapter 866",
  "content": "# Chapter XX: Storm of Blades\n\n*What the—?*\n\nEven Silvenas hadn't seen it coming. The young prince—barely old enough to hold a blade properly—had just *attacked* her. But this wasn't some clumsy child's swing. The boy moved with precision, each strike flowing into the next with practiced grace. More than that, his swordsmanship carried *intent*—fierce, relentless, and above all, *deliberate*. With every pass of his wooden blade, the ambient mana in the banquet hall stuttered and fractured.\n\n\"Kuk...!\" \n\nSilvenas found herself trapped within an expanding storm of sword energy, her movements sluggish, her powers unresponsive. A dark demonkin's greatest assets—Assimilation with Darkness, Conformity with the Wind—both relied on her innate mana circulation. This storm of disrupted energy was interfering with that circulation, choking her speed and strength at the source.\n\nBut Lord was still just a child. Within moments, his breathing turned ragged. Sweat poured down his face.\n\n*He won't last.*\n\n\"**Hiyaaack!**\" \n\nThe boy's desperate war cry bought just enough time. Royman burst through the encircling black magicians, Coke right behind her. The Overgeared Knights crashed into Silvenas like a hammer strike, exploiting her momentary vulnerability. Royman's blade work was particularly devastating—her unique style kept Silvenas off-balance, alternating between freezing strikes and sweeping leg cuts that repeatedly knocked the demonkin to the ground.\n\n\"Ugh...!\"\n\nThe relentless crowd control was maddening. Finally, Silvenas snapped. \n\nBlack wings of pure demonic energy *erupted* from her back. The sheer force of their manifestation shattered every control effect at once, granting her super-armor. She launched herself skyward, her restored speed making her little more than a red blur. Sword energy lanced down like crimson rain, each strike targeting a different knight.\n\n\"**Avoid it!**\" Royman's blade intercepted two, three, four of the energy bolts—but there were too many, coming too fast. Her eyes found Coke.\n\n*No.*\n\nHe'd been protecting Irene and Lord alone while the rest of them fought through the black magicians. He was already at his limit. One hit from Silvenas and he'd—\n\nRoyman's assessment was ice-cold and accurate.\n\n*This is it, then.* Coke's health sat at a miserable 5%. The potions couldn't keep up anymore, not with black magic eating away at him from three different angles. He didn't have the strength to block this attack. Hell, most of the other knights couldn't have blocked it either, and they were at full strength.\n\nSilvenas moved faster than his eyes could track. His hair stood on end as demonic energy flooded the space around him. Even his nose hairs prickled. Despite everything, Coke found himself smiling—bitter, but genuine.\n\n\"Make sure the queen and prince are safe...\"\n\n\"**Sir Coke!**\" \n\nRoyman was already moving, channeling Farmland Walk—the technique Piaro had drilled into all of them. She knew Coke had a revival blessing, knew he'd come back. But watching a comrade die, knowing the brutal penalties that resurrection carried... \n\n*No. Not if I can help it.*\n\nShe leaped, covering half the distance of a Blink spell. Then again. Thirteen meters to close. Not enough time. Not—\n\n\"**Hihit!**\"\n\nToo late. Silvenas had already materialized behind Coke, blade raised for the killing stroke.\n\nThen the notification appeared.\n\n> **[Prince 'Lord' of the Overgeared Kingdom wants to appoint you as his knight.]**\n>\n> **[Would you like to accept?]**\n\nThe red warning screen in Coke's vision suddenly sprouted blue text. He didn't hesitate.\n\n\"**I will be loyal to Your Highness!**\"\n\n> **[You have become the knight of Prince 'Lord' of the Overgeared Kingdom.]**\n>\n> **[Lord has summoned you.]**\n>\n> **[Would you like to accept the summons?]**\n\n*Yes.*\n\nThe world lurched. Silvenas's blade passed through empty air. Coke rematerialized beside the young prince, his body still positioned as if about to be struck down—but now fifteen meters away from danger.\n\n\"**This is nonsense!**\" Silvenas's shriek of frustration could've peeled paint. She dismissed Royman entirely, locked her eyes on the *real* threat. That insufferable child. Her blade fell toward Lord like an executioner's axe.\n\nThe boy was gasping, drenched in sweat from his earlier technique. But his wooden sword was already moving.\n\n\"**Tearing the Sky.**\"\n\nIt was a pure counter—one of the techniques Kraugel favored before ascending to Sword Saint. Effective only against overhead attacks, but *devastating* when it landed. The strength of the master channeled through the disciple.\n\nLord's blade moved like the claw of some enormous beast. The energy it carved through the air *tore*—through Silvenas's guard, through her body, through the ceiling of the banquet hall itself.\n\n\"**Cough!**\" \n\nFor the first time, real damage. Real pain. Blood spilled from Silvenas's mouth. Tearing the Sky was a reflecting technique—it returned the attacker's own power against them, amplified. Lord's own stats barely mattered. Even at level 60, he'd just carved through a Named-grade enemy.\n\n\"**Kuoh... Ugh..! You...! This little—!**\"\n\nOne tenth of her health. *Gone.* In front of the Vatican's holy warriors, in front of the assembled royalty, in front of a *thousand* black magicians—humiliated by a **child**.\n\nSilvenas had never known such shame. Not once in her entire existence.\n\nWhich left only one response.\n\n\"**Die...! Killing power!**\"\n\nThe beautiful mask shattered. Silvenas shed her humanoid disguise, revealing the true form of a dark demonkin—the species mocked throughout Hell as the most *hideous* of all.\n\n\"**Hiik!**\"\n\n\"**W-What is—**\"\n\nHer skin looked melted, twisted like burnt wax. Eyes, nose, mouth—all jumbled together in a nightmare configuration that violated every principle of symmetry and proportion.\n\nEven the Yatan believers recoiled. Shock. Dismay. Disappointment.\n\nFrom the edge of the hall, Yatan's Sixth Servant Cardiora smiled knowingly. \"Now no one survives.\"\n\nNot hyperbole. When Silvenas revealed her true face, she killed *everything* nearby. Enemies. Allies. Everyone.\n\n\"**Kieek! Kieeeeek!**\"\n\nThe *shriek* hit like a physical blow. The dark demonkin's lament of their own ugliness carried multiple curse properties—inflicting psychological damage, disrupting mana flow, rupturing eardrums. No direct physical harm, but for someone like Irene...\n\n\"**Your Majesty!**\" Chucksley abandoned his current opponent, sprinting toward the queen.\n\n\"**Where do you think you're going?**\" Rose stepped into his path. Belial's Staff blazed in her hands—the mythic reproduction she'd earned during the 32nd Hell raid. Magic bloomed, a wall of destructive force.\n\n\"**This is a mess...!**\" Chucksley went down hard, his heart screaming. *I failed her. I couldn't protect—*\n\nBut he hadn't failed. Holding off Yatan's Eighth Servant for even this long was itself extraordinary. The same was true for Isabel and Kasim against Agnus. They were performing far above their weight class.\n\n\"**Kikikik!**\" \n\nBaal's Contractor pulled back his forces, recalling the undead he'd scattered throughout the Vatican. He couldn't handle Isabel and Kasim simultaneously—not without support. Death knights and demons materialized at his flanks, forming a defensive perimeter.\n\nThe gap in power was simply too wide. Yes, Baal's Contractor carried immense potential, but as a *player*, Agnus faced restrictions no NPC would suffer. If he'd been an NPC with this class? He could threaten everyone in the Vatican at once. As it was, he needed multiple class quests completed before reaching that level.\n\n\"**Shadow Soldiers!**\" \n\nKasim's technique manifested specters from every dark corner, converging on Agnus from multiple angles. Isabel seized the opening, her spear punching through a demon's core.\n\n\"**Kik...! Kikikik! More! More! More! Moreee! Kuhahahahat!**\"\n\nAgnus's laughter spiraled into mania. To him, this chaos was *preferable*—a sweet dream that obliterated the unbearable reality waiting outside.\n\n\"**Your Holiness!**\"\n\n\"**Prince Lord!**\"\n\n\"**Imperial Prince!**\"\n\nThe withdrawal of Agnus's undead forces opened a gap. Paladins, Rebecca's Daughter candidates, and soldiers from a dozen kingdoms poured into the banquet hall, cutting down black magicians. For a brief moment, hope flickered.\n\nThen Yatan's Third Servant moved.\n\n\"There are more insects to exterminate.\" Aliburn's voice was almost conversational. He moved through the crowd like death incarnate, burning away the mana of every priest and paladin he passed. The stolen energy converted to devastating black magic that erupted in all directions. \n\nDozens fell in seconds. Several of Rebecca's Daughters transformed into pillars of ash, their screams cut short.\n\n\"**Lea! Anne!**\" \n\nLord's voice cracked. Two of his most precious friends—the girls he'd laughed with just hours ago—were *gone*. He wanted to run at Aliburn, to make him *pay*, but—\n\nSilvenas still loomed above his mother. His first duty was to her.\n\n\"**Kiyaaaaah!**\" The demonkin's screams intensified, each note like broken glass in the mind.\n\n\"Uh...!\" Irene stumbled. Lord caught her with his small frame while Coke—hands already bloodied, ears leaking red—covered Irene's ears with his palms.\n\n\"**This can't continue!**\"\n\n\"**Shit!**\" \n\nKasim made his choice. Irene was his highest priority—had always been his highest priority. He abandoned Agnus entirely, redirecting toward Silvenas.\n\nWhich freed Agnus. The necromancer gasped, finally able to breathe properly again. Then his eyes fell on Irene and the child supporting her.\n\n*Wait.*\n\nHe'd seen them on broadcasts. Grid's wife. Grid's son. Grid's *precious* people.\n\nAgnus's expression twisted. An unwelcome memory surfaced—one he could never quite bury. The woman he'd loved, surrounded by angry men. Powerless. Violated. While he could do *nothing*.\n\n\"...That bastard Grid.\"\n\nUnlike Agnus back then, Grid now commanded overwhelming strength. So why was he letting this happen to those he loved? Would he only understand their value after *losing* them?\n\nRage ignited in Agnus's chest. His eyes widened. He reached for the trump card he'd been saving—the one he'd sworn only to use in the direst circumstances.\n\nLich Mumud materialized. Ancient magic lanced toward Silvenas, catching her mid-flight.\n\n\"**Agnus! What are you doing right now?**\" Rose's confusion was palpable.\n\n\"**Kik? So what?**\" Agnus's voice dripped venom. \"**Is it normal to hurt a weak woman?**\"\n\n> **[You have abandoned the quest 'Vatican Invasion.']**\n\nThe notification barely registered.\n\n\"**You dog-like bastard... I want to rip you apart.**\"\n\n\"**You are crazy!**\"\n\nThe magical bombardment intensified. Explosions tore through the banquet hall. The ceiling groaned, then began to collapse.\n\nAgnus launched himself toward Irene and Lord.\n\n---\n\nMeanwhile, in the capital of the Overgeared Kingdom...\n\n\"**Quickly!**\" Grid paced like a caged animal. Coke's whisper message had arrived five minutes ago. Five minutes that felt like *years*.\n\nSticks sat cross-legged on the ground, eyes closed in concentration. \"Just... a bit... more...\" \n\nThe academy lessons had drained him. He needed to channel Mana Drain for a full five minutes while simultaneously consuming potions. Only then could he manage the massive energy requirements of Mass Teleport.\n\nFor Grid, every second stretched into an eternity.\n\n*Just hold on. I'm coming.*"
}