{
  "id": 867,
  "title": "Chapter 867",
  "content": "[★Hidden Quest★ 'Vatican Invasion' has been abandoned.]\n[Affinity with the Yatan Church has decreased by 100.]\n[The relationship with the Yatan Church has changed from friendly to wary.]\n\nThe Vatican Invasion—a hidden quest boasting tremendous rewards and the near-certainty of triggering a major story arc. Yet Agnus was throwing it all away. Walking away from the prize that had been within his grasp.\n\nIt was madness beyond comprehension.\n\n\"You're insane!\" Rose's scream tore through the chaos. But it was already too late to stop him.\n\nLich Mumud crashed into Silvenas, and Agnus shot through the opening, closing the distance to Irene in a heartbeat.\n\n\"Agnus...!\" Coke's voice trembled.\n\nThe Mad Dog himself. The lunatic everyone feared. Now he was barreling toward the queen and prince. Coke had no way of knowing Agnus had just saved them from Silvenas' lethal scream. All he could do was grip his sword with shaking hands, a boy determined to protect someone despite his weakness.\n\nThe sight struck something deep in Agnus. His eyes flashed with raw emotion.\n\nThe memory surfaced unbidden—of his own helpless past, when he couldn't protect the woman he loved. Regret. Rage. Resentment. Grief. All of it twisted across Agnus' face in a terrible expression that evoked more sympathy than fear.\n\n\"Who are you?\" the little prince asked, his voice soft. Even in his fear, he recognized the sorrow etched into the face of the man now standing between them and danger.\n\nAgnus barely suppressed the fury roiling inside him. \"Just a fool.\"\n\n\"...\"\n\nWhat else could he call himself? Obsessed with a past that could never be changed, creating fresh regrets in the present moment. A fool—that's what he was. Agnus knew with crystal clarity that abandoning this quest for old memories was irrational. He knew he'd regret it.\n\nYet here he was.\n\nAnd Yatan's Third Servant Aliburn was making sure he understood the consequences.\n\n\"Baal's Contractor!\" Aliburn's voice shook with fury. \"Have you forgotten the grace we showed you by granting the Stone of Life? You will regret this betrayal!\" His rage stemmed from misunderstanding—he couldn't fathom why Baal's Contractor would turn on the Yatan Church. \"It's always the same with Baal's Contractors! Always interfering with us!\"\n\nThe Yatan Church served the evil god Yatan, and the great demons were Yatan's children. By rights, Baal—the 1st Great Demon—should have been second only to Yatan himself in the servants' devotion. But Baal had always been incomprehensible. Centuries ago, he'd contracted with the legendary Pagma, granting him tremendous power that had been used to interfere with demonic descents. It had seemed like a whim then, but now Aliburn was forced to question Baal's true intentions.\n\n\"Baal seeks to betray God Yatan!\" There was no limit to a great demon's ambition. Clearly, Baal intended to overthrow Yatan and claim godhood for himself.\n\nAgnus laughed. \"That bastard's intentions don't concern me.\"\n\n\"What? You...?\"\n\n\"I am me. Did you think I'd dance to someone else's tune? Kik!\" Agnus didn't care if this was the wrong choice. He gestured toward Coke and Irene. \"I want to save these people. That's the only desire in my heart.\"\n\nTo Irene and Lord, he appeared as a heaven-sent savior. Yet Coke remained wary, uncertain.\n\nAliburn stared at Agnus, momentarily speechless. Then he made his threat explicit. \"Someday, your current strength won't be enough to protect them. You will fall, and they will die.\"\n\n\"...\"\n\n\"And then the Stone of Life will be taken from you.\"\n\nThis was Agnus' final chance.\n\n\"Wake up. Change your mind.\" Aliburn extended his hand.\n\nA notification window materialized before Agnus, asking once more if he wished to accept the Vatican Invasion hidden quest. Once again, the rewards were staggering—massive gains to demonic power, intelligence, and dominance, plus 50% resistance to divine attacks. Quest rewards perfectly tailored to maximize Baal's Contractor's strengths while covering his weaknesses.\n\nA temptation no sane person could refuse. Unless they were a fool...\n\nAnd Agnus was a fool.\n\n\"I'm still going to fight. Kik!\"\n\nHis desires had never aligned with those of ordinary people. He didn't crave strength, power, or wealth. He only wanted to reclaim what he'd lost. That's why he couldn't turn away from this scene—couldn't ignore these people—even if new regrets would join the old. His past wouldn't allow it.\n\n[★Hidden Quest★ 'Vatican Invasion' has been rejected.]\n[Yatan's Third Servant Aliburn is extremely angry.]\n[The relationship with the Yatan Church has changed from wary to hostile.]\n[The hidden class quest 'Will of the Former Generation' has been opened!]\n\n[Will of the Former Generation]\n[Difficulty: Class Quest.\nYou have made an enemy of the Yatan Church. This means you will face God Yatan and all great demons as adversaries.\nYou have chosen the same path as Pagma, the former Baal's Contractor.\nGo to the Hall of Fame!\nUnderstand Pagma's will!\nGlimpse the legacy and power he left behind, and prepare to battle the great demons!\nQuest Clear Conditions: Overcome the trials that await in the Hall of Fame.\nQuest Clear Reward: Baal's Contractor will inherit a portion of Pagma's power.\nQuest Failure: Rewards will be permanently lost.]\n\nConnected to Pagma? This unexpected development piqued Agnus' interest. One of the Five Miracles had once again defied Morpheus' predictions.\n\n\"Kik!\" Agnus burst into laughter.\n\n\"Yes! This is exactly what Baal's Contractor does!\" Aliburn roared. The magic power he'd accumulated by absorbing divine energy roiled through the ground. But Agnus met it without fear.\n\n\"Summon! Death Knight!\"\n\nLich Mumud entangled Silvenas as death knights erupted from the earth.\n\n\"Furfu's Power!\"\n\nWhite light flooded the stormy night sky. The torrential rain froze mid-fall. This was the might of Great Demon Furfu, channeled through Agnus' hands to empower all his servants—demons, death knights, and Lich Mumud alike.\n\nSilvenas had been holding her own against Mumud's prismatic magic, but now—\"Kyaaak!\" She screamed as the empowered Lich overwhelmed her.\n\nThe strengthened Mumud alone was threatening Yatan's Fourth Servant. Now that Agnus had crossed the point of no return, Aliburn's eyes burned crimson. \"You...!\"\n\nHis infinite pride as the continent's greatest black magician shattered.\n\n\"Let unclean darkness spread! Let the sky and earth be corrupted!\"\n\nThe sky, bleached white by Furfu's Power, darkened once more. Heavy rain fell invisible through the gloom as curses of every kind filled the air. Those present trembled in terror.\n\n\"Do as you will!\" At that moment, the elders who'd been working to break Pope Damian's barrier unleashed Goddess' Purification. With their high dark resistance, Aliburn's Mana Burn couldn't touch them. The divine light from all thirteen of them cleansed the polluted sky and earth in an instant.\n\n\"I'll have to handle this myself.\" The silent 2nd Prince of the Saharan Empire manifested his red energy. His blade, wrapped in that crimson power, cut down dozens of black magicians in a single strike.\n\n\"What?\" Yatan's Sixth Servant Cardiora's eyes widened. She'd been engaged with the solo number knights escorting the prince—she never imagined the greenhouse-raised imperial prince concealed such devastating strength. Cardiora wasn't alone in her shock. Kasim, flying in to strike at Aliburn, and everyone else in the banquet hall gaped at Dulandal's display.\n\n'This cursed power!' Kasim, of course, knew about the royal family's red energy. How could he forget? That same energy had annihilated his entire clan.\n\nThe battlefield lines were drawn: Silvenas pinned down by Agnus. Rose facing Chucksley and Isabel. Aliburn battling the elders and Rebecca's Daughters. Cardiora engaged with the Red Knights and Dulandal. The black magicians holding back knights from other kingdoms and the Rebecca's Daughter candidates.\n\nAgnus' betrayal and Dulandal's hidden power—two variables the Yatan Church hadn't accounted for. The situation was turning against them.\n\n'There's hope!' The gathered royalty, blessed with keen insight, felt their spirits lift. If they cooperated and fought hard, they could overcome this crisis. Survive. With renewed determination, they led their knights to cut down the black magicians as quickly as possible.\n\nThen Yatan's Seventh Servant Hill reversed everything. Despair crashed over them as the rotund middle-aged man emerged from wherever he'd been hiding since the battle began.\n\n\"Hehe! Kihehe! Aliburn! I've succeeded!\" Hill laughed, brandishing a sword embedded in a chunk of stone. The trapped Pope Damian, the elders, Rebecca's Daughters—all stared in horror. The Holy Sword gifted to the first pope by Goddess Rebecca herself was now in the Yatan Church's hands.\n\nA new quest forced itself upon Damian.\n\n[Recapture the Holy Sword]\n[The Sealed Holy Sword, bestowed upon the first pope by the goddess, has fallen into the hands of the Yatan Church!\nThe Holy Sword is Rebecca's symbol and proof of the papacy!\nYou must retrieve it!\nQuest Clear Conditions: Reclaim the Sealed Holy Sword.\nQuest Clear Reward: Goddess Rebecca's blessing. Affinity with the elders will reach maximum. All believers will revere you.\nQuest Failure: Many believers will lose faith in the church's ineffective leadership and abandon it. You will lose eligibility to serve as pope. Goddess Rebecca will be disappointed. Level -5.]\n\nWhat could he possibly do trapped behind this barrier? In the midst of crisis, Damian prayed desperately for salvation. But Goddess Rebecca remained silent.\n\n\"Ungh...!\" Despite his anxiety, Damian's gaze remained fixed on Isabel and Irene. He prayed for the safety of the woman he loved and everyone precious to him. How much longer could they hold out?\n\nAs Aliburn began cursing the Holy Sword, the Rebecca priests, paladins, elders, and daughters all felt their divine power beginning to drain away."
}