{
  "id": 87,
  "title": "Chapter 87",
  "content": "# Chapter 87\n\nMalacus, the Sixth Servant of God Yatan, held the title of high priest. He oversaw every ritual conducted by the Yatan Church.\n\nMost of those rituals targeted the church's enemies. Curses to spread disease. Plagues to cripple entire regions. His reputation was built on atrocities: eighty-seven virgins sacrificed to reduce the king of the Bungerst Principality to a drooling idiot. Six hundred and seven more burned alive to unleash an epidemic across Earl Raven's territory.\n\nMalacus threw his head back and cackled at the sky.\n\n\"Start the hunt? Kukuk! Kuhahahaha!\" He swept his gaze across the assembled guild members, eyes glinting with contempt. \"You insects think you can handle me? There is no one in this world who doesn't fear the Yatan Church. We carry out the supremacy of God Yatan. We exert influence across the entire continent. And I am the architect of that power! How laughable that you think yourselves worthy opponents!\"\n\nHis arrogance wasn't entirely unfounded. The Yatan Church was one of Satisfy's greatest forces, a name whispered in terror across every kingdom. Much of that growth could be attributed to Malacus himself. His accomplishments had shaped the political landscape of the entire continent. A man of such stature, reduced to prey in some backwater mountain village? Absurd.\n\nMalacus's lips peeled back from his teeth.\n\n\"You'll understand soon enough. Especially you, girl.\" He pointed at Jishuka. \"You will be sacrificed to God Yatan.\"\n\nHe could see their strength. The moment the entire guild had materialized around him, he'd felt a flicker of... something. Not fear. Caution, perhaps. But he was one of the Eight Servants. He had transcended the human realm. As long as they couldn't coordinate a perfect simultaneous assault, he had nothing to worry about.\n\nJishuka's thoughts ran in a different direction.\n\n\"I don't know about Malacus.\" She smiled, white teeth flashing in the shadows. \"But our Tzedakah Guild is the strongest. We have the power to stand at the top any time we choose. You can't threaten us.\"\n\nShe took a step forward, smile widening into something predatory.\n\n\"You will die here. Accept it humbly. For us, you're nothing more than game.\"\n\nMalacus's face twisted.\n\n\"You really believe you can harm me?\"\n\n\"Of course.\"\n\n\"Foolish!\"\n\nMalacus thrust out his hand. A ray of black magic power lanced forward in a perfectly straight line, aimed directly at Jishuka's heart.\n\nShe didn't move.\n\nToban did. The paladin lunged from her left side, shield raised high.\n\n\"Patience Shield!\"\n\nThe ray slammed into the barrier with a thunderous crack. Dust exploded outward. The shield absorbed the impact, but the shock traveled through Toban's arm. He coughed, blood flecking his lips.\n\n\"Kuoh...\" Toban's breath came in ragged gasps. \"The shield's durability dropped by twenty in an instant. That wasn't even his unique skill. Just standard dark magic that anyone in the Yatan Church could use. How much magic power does this bastard have?\"\n\nJishuka kicked his shin.\n\n\"Don't take it easy. It's unsightly.\"\n\nMalacus spread his arms wide.\n\n\"Die before this mighty power! It will be the last insignificant thing you ever do!\"\n\nA notification window materialized in front of every Tzedakah Guild member.\n\n> [The Sixth Servant of God Yatan, Malacus has discharged his magic power.]\n> [The mighty dark power has applied fear, weakness, and immobilizing effects.]\n> [Malacus has unleashed a surprise magic attack.]\n\nKwa kwa kwa kwang!\n\nDozens of black rays erupted from Malacus's hands, streaking in every direction like a storm of cursed lightning.\n\n\"Hey hey. Isn't this too much?\" someone shouted.\n\n\"This is crazy!\"\n\nJishuka and the guild members immediately moved to defend themselves, but Malacus's magic power crashed over them like a wave. The abnormal status effects rooted them in place.\n\n> [You have suffered 8,900 damage.]\n> [You have suffered 16,503 damage.]\n> [You have suffered 11,027 damage.]\n\n\"It hurts!\"\n\n\"This is foul!\"\n\nExcept for classes with high magic defense or dark resistance, the guild members lost at least thirty percent of their health. Jishuka, an archer built for evasion rather than tanking, faced a critical warning.\n\n> [You have lost 53% of your health from a single blow.]\n> [You can't regain your mental state.]\n\nThe system's stun mechanic kicked in. Any blow that consumed more than forty percent of a user's health in one strike would lock them down for three seconds. Jishuka stood completely defenseless.\n\n\"Defend the master!\"\n\nToban charged forward. The other Tzedakah members closed ranks around Jishuka. Malacus watched the display with something like amusement.\n\n\"Do you understand now? I am the hunter here. Not you.\"\n\nJishuka didn't flinch. She snapped out a command.\n\n\"Forget about me. Grid...\" She locked eyes with several members. \"Protect Khan's disciple!\"\n\nThe creator of the Special Jaffa Arrows that she'd been searching for! Grid was presumed to be Khan's disciple, someone who knew the creator's identity. No, there was a possibility he *was* the creator.\n\n\"Listen carefully. We need to defeat Malacus, but your top priority is protecting Grid. Don't let him die.\"\n\nThe guild master's word was absolute. The members scanned the area simultaneously, locating Grid hiding behind a tree.\n\n\"Eh? That guy?\"\n\nGrid was a blacksmith, wasn't he? A normal blacksmith should have died, or at least suffered critical injuries from that bombardment. But he looked fine.\n\n\"What's going on?\"\n\nJishuka was more surprised than anyone as she studied Grid's condition.\n\n*Now that I'm looking properly... isn't he wearing armor and holding a sword?*\n\nWas it a false tip? But Grid had confirmed he made the Special Jaffa Arrows. She felt baffled. The confusion lasted only a moment. Jishuka recovered from her stunned state and downed a health potion. Then she caught Malacus's attention before it could linger too long on Grid.\n\n\"Malacus.\" She forced a mocking laugh. \"Aren't you too weak? You didn't manage to kill any of us with that blow. Doesn't it advertise how incompetent you are?\"\n\n*Why wasn't Grid overwhelmed by that attack?*\n\nMalacus's pride stung as he registered that Grid had survived the bombardment unscathed. But then Jishuka's taunt drew his focus back. His face darkened with rage.\n\n\"Girl, you should stay down there. You're shaking with fear. That look suits you.\"\n\n\"I heard the rituals conducted by Malacus exceed common sense.\" Jishuka's voice dripped with disdain. \"A person or organization that doesn't worship Yatan isn't safe from your rituals, right? If the number of sacrifices was infinite, you might conquer the world through those rituals alone. Yes, your capabilities as a priest are enormous. I'll admit it.\"\n\nShe paused, lips curling into a sneer.\n\n\"But you...\"\n\nThe ridicule was obvious. Malacus's face reddened as Jishuka stared down at him with arrogant eyes.\n\n\"What's the big deal? Do you think we don't know your combat ability is the weakest among the Eight Servants?\"\n\nInformation was power. The Tzedakah Guild aimed for the top, which meant their intelligence network operated at the highest level. The Yatan Church was currently one of the greatest forces on the continent. Naturally, the Tzedakah Guild had compiled exhaustive dossiers.\n\nThe Sixth Servant, Malacus. He appeared in random locations every three months to indulge in his twisted game of 'sacrifice hunting.' **Level 310**. Dark Sorcerer class. Specialties: black magic, debuffs, and layered defense skills. He possessed amazing self-recovery fueled by his enormous magic power reserves. As a high-ranking member of the Yatan Church, his dark magic attacks demanded caution. However, his offensive skill variety was severely limited.\n\n*His level is very low compared to the other Eight Servants.*\n\nMalacus was a priest. His level lagged behind the other servants because he rarely entered direct combat. At only **Level 310**, the Tzedakah Guild, whose average level exceeded **200**, judged they could handle him.\n\n\"It's only been a month since your last sacrifice hunt...\" Jishuka raised her hand dismissively. \"I don't know why you strayed from your original timeline and appeared in the Eternal Kingdom, but I'm thankful. We'll sacrifice you and boost our reputation.\"\n\nShe ignored Malacus entirely as she addressed her guild.\n\n\"How long are you going to let your game run wild? Go ahead. Start the hunt.\"\n\nTeong!\n\nA muscular, middle-aged man who'd been waiting through the entire exchange exploded forward. Vantner, the tank destroyer, charged with axes raised high.\n\n\"Hey you! Give me Regas! Then I'll let you die quickly! Experience death! Wuhahaha!\"\n\nVantner wielded two axes, each large enough to require both hands. He swung them like they weighed nothing.\n\nKwang! Kwang! Kwaang!\n\nEach strike collided with Malacus's black magic shield, generating shockwaves that kicked up dust and sent Malacus's cloak flapping wildly. But that was all. Vantner's axes couldn't penetrate the barrier, let alone touch the priest's collar.\n\n\"He's fine?\"\n\nVantner backed away, breathing hard, forcing himself to think calmly.\n\n*That shield... my attack power can't break through? Okay, then it's a game of speed!*\n\nMalacus deployed the shield only on surfaces about to be struck. If Vantner attacked faster than Malacus could react, would the shield formation fail?\n\n\"Aaaaaaah!\"\n\nThe simple idea spurred Vantner into a frenzy. His arms became a blur.\n\nChaaeng! Jjejejeok!\n\nThe twin axes moved without rest, momentum fierce as lightning bolts. Malacus remained untouched.\n\n*Pant pant... my attack speed doesn't exceed his reaction time. How does a sorcerer's body move so fast?*\n\nVantner gasped for air. Malacus stood motionless, waiting for exhaustion to finish the job.\n\n\"Hmph. Unsightly.\" Malacus laughed at Vantner before turning his gaze back to Jishuka. \"My combat strength is indeed weak compared to the other servants. But that's only when measured against them. Compared to all of you, I am absurdly strong—\"\n\nThe words died in his throat. A spear shot over Vantner's shoulder.\n\nKaaang!\n\n\"Huh?\"\n\nMalacus grunted as the spear materialized like a lightning strike. If he'd been even slightly less vigilant, he wouldn't have deployed the shield in time.\n\n*Fast and strong. Nothing like the axe-wielding fool.*\n\nThe weight of the spear aimed precisely at his heart forced Malacus backward several steps despite blocking with the shield. Then the spear's owner appeared before him.\n\n\"Ah, you reacted to a perfect surprise attack? How strong are the other servants if you're the weakest?\"\n\nVantner glanced at the newcomer, who'd just expressed nervous admiration."
}