{
  "id": 870,
  "title": "Chapter 870",
  "content": "Dolce, second-ranked black magician in Satisfy, glared at the misty mountainside below him. Thousands of his peers would kill for his position. He'd clawed his way to the top through raw talent and relentless practice—no small feat for a class that struggled with basic leveling. Third advancement at his age spoke volumes.\n\nAnd they had him guarding a back entrance.\n\nHe kicked at a loose stone. \"Wasting my goddamn time.\"\n\nInside the Vatican, Rose would be collecting legendary drops and quest rewards while he sat on a rock in the rain. The injustice of it burned. He didn't buy the excuse that this was an important position. Who would attack from this direction? The real battles—the glory—were happening beyond those walls.\n\n*Just one chance.* That's all he needed. One opportunity to prove himself in combat, and he'd eclipse Rose entirely. The former rank one, Yura, was a different beast—a wall he couldn't see past. But Rose? He'd studied her patterns. Analyzed her tactics. Given equal circumstances, he was confident he'd come out on top.\n\nHis thoughts spiraled until movement at the barrier's edge caught his attention. Someone had crossed the perimeter wards. Yet no alert triggered. That meant—\n\n*Another babysitter?*\n\nDolce rose from his seat, peering through the darkness. A silhouette approached, features obscured by distance and shadow. \"Hey! They stick you out here too?\"\n\nMoonlight broke through the storm clouds.\n\nThe figure wore a crown. Red and black jewels caught the pale light, and for a heartbeat, they seemed to pulse with inner fire. Dolce's vision swam.\n\n**[You have been confused by the target! You have become defenseless. You can't take any action, and your defense and magic resistance are reduced by 40%.]**\n\nHis body locked up. Panic flooded his system—he'd stacked confusion resistance to the maximum, same as every other debuff. A single glance shouldn't have been enough. Unless...\n\n*Medusa-tier status effect?*\n\nOne second. The debuff duration ticked in his peripheral vision. His resistances had cut it down to nothing. Fifteen meters of distance. He'd recover before the target closed the gap, identify them, then—\n\nThe figure's face resolved as they stepped forward. Sharp features. Cold, calculating eyes that regarded him like an insect. Recognition hit like ice water.\n\nThen the target was *there*, materialized in front of him as though distance meant nothing.\n\n\"Get lost.\"\n\nBlack energy exploded outward. Grid swung his sword through a wide arc, and dark flames consumed everything—Dolce, his five companions, the rocks they'd been using for cover. The 2nd ranked black magician felt his health plummet, watching it drain in real-time as the flames ate through his defenses.\n\n*The others.* Could the Yatan Servants inside withstand this? Rebecca's Daughters were powerful, and they had numbers. But this variable, this monster who'd crossed fifteen meters in a heartbeat—\n\n\"S-stop him!\" Dolce's hand found the flare, fingers closing around it as his vision darkened. The magic failed—couldn't even form the spell matrix before Grid cut him down—but the flare burst skyward in a streak of crimson.\n\nHe turned to grey light with a smile on his face. He'd done his job.\n\nReinforcements materialized from the treeline. Black magicians and their knight escorts, converging on the intruder with practiced coordination. Curses first—overlapping debuffs that would lock down any target. Then the knights would finish it.\n\nExcept the curses slid off Grid's body like water off waxed leather.\n\n\"Wait!\" A magician's voice cracked with panic. \"Not yet—\"\n\nToo late. The black knights had already committed, muscle memory overriding caution. Six blades carved through the air, each trailing corrupted energy. They'd drilled this combination a thousand times.\n\nGrid moved.\n\nHe shouldn't have been able to dodge—six simultaneous angles, professional timing. But he flowed through the gaps like smoke, and his return stroke caught them all. A perfect circle of steel.\n\nKnights crumpled. Black magic was powerful, but it came with a price—reduced physical capabilities in the early levels. The Yatan Church's knights hit hard, but their defenses were tissue paper compared to Rebecca's paladins. And hitting hard meant nothing when you couldn't land a blow.\n\nTwo more fell. Then another. The remaining magicians stood frozen, watching their escorts die in seconds.\n\n\"**Wave.**\"\n\nBlack energy rippled outward in a perfect sphere. Trees shattered. Rocks exploded. The magicians' bodies disintegrated before they could scream. When the dust settled, Grid stood alone on a scorched hillside, the Vatican's white walls gleaming ahead.\n\n\"Irene.\" His voice was barely a whisper. \"Lord.\"\n\n*Hold on.*\n\nHe summoned his mount and charged forward.\n\n---\n\n**Inside the Vatican**\n\nDamian's shield arm was going numb. Each impact sent shockwaves through the blessed metal, and the ornate papal armor—symbol of his office—was developing spiderweb cracks. Hill's fists blurred through the air, twelve impacts per second, an unrelenting drumbeat that made defense feel like drowning.\n\n\"Persistent bastard!\" Hill's grin was manic. \"Just die already!\"\n\nBut Damian was good at not dying. Defense magic layered over divine buffs, healing spells cast on cooldown. He'd outlasted worse. The problem was that outlasting wasn't enough.\n\n*It has to be a skill.* The pattern was too consistent. Twelve hits, one second cooldown, super-armor state preventing any interruption. And during those twelve hits, counterattacking was suicide—any attempt to strike back would be crushed under the follow-up punches.\n\nThe one-second gap was his only window. But Damian's kit was designed for sustained combat and group support, not burst damage. He couldn't kill Hill in that window. Hell, he couldn't even hurt him much.\n\nWhich left him exactly where he was—deadlocked with Hill while his allies bled.\n\nThe Overgeared guards protecting Irene and Lord were on their last legs. Unlike the Red Knights who'd entered fresh, they'd been fighting since the initial breach. Now they stood between the Queen and a pack of black magicians with nothing left but determination.\n\nDamian's jaw clenched. He couldn't keep trading blows forever. Either he broke through Hill's offense or his friends died.\n\n*Grid did it.* The memory surfaced—footage from the National Competition, Grid abandoning defense entirely to match his opponent hit-for-hit. Trading damage for damage, betting on superior firepower.\n\nDamian's attack power was weaker. His strike speed was slower. But staying passive guaranteed failure.\n\nHe lowered his shield.\n\nHill's eyes widened. Then he laughed. \"Finally showing some balls?\"\n\nDamian swung.\n\nHis shield caught Hill in the face—not blocking, *striking*—and his sword followed in a tight arc. Two hits. Hill's twelve punches hammered into his chest and sides, cracking ribs and pulping muscle. Three hits. The heal triggered automatically, divine light suturing torn flesh.\n\n\"Two hits to my twelve?\" Hill's laughter echoed off the ruined walls. \"Are you stupid? Math isn't your strong suit, priest!\"\n\nFour hits. Five hits. The heal couldn't keep up.\n\n\"You need better tactics! **Strike harder!**\"\n\nHill's fists ignited with crimson light. The impacts doubled in force. Damian's health bar plummeted—thirty percent, twenty, fifteen—\n\n\"Kuk!\" His knee hit the ground.\n\n\"Teacher Damian!\"\n\n\"Your Holiness!\"\n\nLord's small fists clenched until his knuckles turned white. \"I wish I was an adult!\" Tears streamed down his face. If he were older, stronger, he could save his mother. Help Damian. But he was useless, powerless, trapped in a child's body while the people he loved—\n\n\"**Pagma's Swordsmanship.**\"\n\nA figure dropped through the shattered ceiling, landing in a crouch between Hill and Damian. Moonlight gleamed off his dark armor.\n\nHill sneered. \"Who's this bastard? You want to taste my fist too?\"\n\nSuper-armor activated. His fists became red blurs, twelve strikes compressed into a single second—face, chest, sides, all the killing zones.\n\nThe man moved.\n\n\"**Link.**\"\n\nSteel sang. Once, twice, ten times, twenty. The sound became a continuous note, a choir of ringing metal that drowned out Hill's laughter. Thirty cuts landed before the one-second window closed, each one precise and devastating.\n\nGrid straightened, his blade still humming with residual energy, and Hill staggered backward with blood pouring from three dozen wounds."
}