{
  "id": 871,
  "title": "Chapter 871",
  "content": "Every moment of delay had tested Grid's composure. Waiting for Sticks to recover his mana. The barrier surrounding the Vatican. Enemies clawing at his ankles one after another. Through it all, he'd forced himself to remain calm.\n\nDamian and Isabel were there. They would protect Irene and Lord. They *had* to.\n\nThat certainty was the only thing that kept panic from clouding his judgment, from slowing him down. Without those two, he would've lost precious time to fear.\n\nGrid's boots struck the flagstones as he disengaged from Hill. His gaze swept the banquet hall and found them immediately—Irene and Lord, huddled together. Exhaustion lined their faces, but they were whole. Uninjured.\n\nThe tension bled from Grid's shoulders. His smile came unbidden, radiant with relief. So pure was that expression that the onlookers who saw him first mistook him for something divine.\n\n\"Your Majesty!\"\n\n\"Father!\"\n\nTheir voices cracked. Irene and Lord stumbled toward him, eyes glistening. In that moment, Grid seemed less a man and more a legend made flesh—a hero arriving at the darkest hour.\n\nAnd they weren't wrong.\n\n[You have discovered a strong person of this era!]\n\n[You have discovered a strong person of this era!]\n\n[You have discovered a strong person of this era!]\n\nThe purple-red aura thickened around Grid's frame. Rebecca's Daughters. Yatan's Servants. The 2nd Imperial Prince. The solo number knights. Each one stoked the Hero King's fighting energy higher.\n\nGrid's attention shifted to the young knights forming a protective ring around his family. Blood soaked their tabards. Curse marks twisted across their exposed skin. Their swords trembled in white-knuckled grips, but they held their ground.\n\nKasim. Chucksley. The others.\n\n\"You have my gratitude.\" Grid's voice carried across the hall. \"All of you.\"\n\nThey'd bled for Irene and Lord. That was a debt he wouldn't forget.\n\nThen he turned to Hill, who was rising to his feet. The servant's health gauge hovered at nine-tenths—barely scratched by Link. Grid had lost 9,600 health from their initial exchange. His own gauge told the same story.\n\n\"Grid!\" Damian's shout cut through the tension. \"Even you'll struggle against him!\"\n\nThe pope had spent the entire battle analyzing Hill. Fifty million health, minimum. Attack power at least 1.6 times Damian's own. Defense only slightly lower. Grid might have doubled Damian's combat stats, but that wouldn't be enough.\n\n\"He doesn't have skill restrictions! Don't engage him head-on!\"\n\nTwelve punches per second, endlessly repeated. Pagma's Swordsmanship couldn't match that cadence—not with its cooldowns. No player could win that war of attrition. Not even Grid.\n\nGrid absorbed the warning. \"High defense. High attack power.\" He'd already felt it. Each of Hill's punches drained 800 health. All twelve strikes combined meant 9,600 damage—per second. Even with Doran's Ring's healing, Elfin Stone's Ring's lifesteal, Tiramet's Power, and the First King Title's restoration and shields, that output was lethal.\n\nDark Bus paled in comparison.\n\nGrid had shattered Yatan's Servants before. He knew their baseline. Hill exceeded it by orders of magnitude.\n\n*At the National Competition, I would've lost.*\n\nHill was that strong. No wonder Damian had been overwhelmed.\n\n\"Item Combination.\"\n\nGrid didn't hesitate.\n\n[Belial's Staff and the Lightning Sword Born from Enlightenment and Strong Desires will be combined!]\n\nThe flames, the illusions, the red lightning, the black flames—all would count as magic, triggering the shield that absorbed 5,000 damage. The combined weapon was his only answer to Hill's overwhelming offense.\n\nBlack fire and crimson electricity spiraled together, reshaping into a spear.\n\nHill's confident advance faltered. \"A spear?\"\n\nThe black-haired warrior with the beautiful crown had abandoned the sword that moved faster than Hill's fists. Trading speed for reach? For power?\n\n*Foolish.* The thought restored Hill's swagger. *He thinks a bigger weapon will help him land a decisive blow.*\n\nPointless. Whether Grid struck hard or struck often, the result would be the same. Among Yatan's Servants, Hill's physical supremacy was absolute.\n\n\"Speed isn't enough! Strength isn't enough!\" Hill's fists blurred forward. \"To beat me, you need an attack that can pierce my defense faster than I can move! Kuhahahat!\"\n\nHe launched himself across the hall. His round belly and jovial face should have been comical. Instead, the air itself seemed to recoil from his presence—the same overwhelming force that had crushed Pope Damian.\n\n\"Danger!\" Lord's voice rang out as his father stepped into Hill's range.\n\n***\n\n\"...!\" The distant cry snapped Agnus's attention away from Silvenas. The boy. The woman. He had to—\n\nSilvenas's fist cracked into his jaw. Blood filled his mouth. His guard dropped. Her blade carved through his chest.\n\n\"Kuk...!\"\n\n\"What are you—?\" Silvenas's eyes widened in disbelief. \"Why do you care about strangers when you're dying? Why protect the *enemy*? Are you insane?\"\n\nYatan's Servants were wicked by nature. Destroyers of worlds, harbingers of humanity's fall. From any rational perspective, they were mad.\n\nYet even they thought Agnus had lost his mind.\n\nAgnus clutched the wound in his chest, laughing wetly. \"You expect sanity in a world filled with monsters like you? Huh~? Kik...! Kilkik!\"\n\nHe'd gone insane the night they destroyed her. The night he'd watched her suffer.\n\n\"Mumud!\" Agnus's bloodshot gaze found the lich. \"Save the queen and the prince!\"\n\n\"...?\"\n\nLich Mumud hesitated. His master had never commanded protection before.\n\n\"Now!\" Agnus snarled.\n\n\"...\"\n\nLiches possessed thought. Emotion. Will. But duty superseded all. Since his enslavement, Mumud had committed atrocities that painted his existence in shades of damnation. Countless innocents had suffered under his master's orders.\n\nThis time was different.\n\nThis time, duty and will aligned.\n\n*Clack... Clack clack...*\n\nMumud advanced toward the banquet hall, magic gathering around his skeletal frame.\n\nSilvenas moved to intercept. Agnus blocked her path.\n\n\"Where do you think you're going?\"\n\nSilvenas's blade found Agnus's abdomen. The steel punched through. He'd lost his immortality—this should kill him.\n\n\"Kik...! Kikikik!\"\n\nThe wound didn't heal. Agnus's body was a ruin, his health bottomed out. Yet he remained standing.\n\nSilvenas stepped back, understanding dawning. \"You're on the threshold. Between life and death.\"\n\n\"Lich Transformation?\" Her voice pitched higher. \"You consumed your own *soul* to protect others?!\"\n\n\"Kik...! Kikikik!\"\n\nDeath knights materialized. Demons clawed through reality. The magic Agnus had sacrificed his soul to regain surged outward.\n\nSilvenas felt death's cold breath on her neck.\n\n***\n\n*'What is this...?!'*\n\nYatan's Third Servant Aliburn recognized the purple-red aura immediately.\n\n*'Hero King!'*\n\nThe legends spoke of Sword Saint Muller, the Hero King who'd sealed great demons. The Hero King, the Demon Slayer, Rebecca's Daughters—all were the Yatan Church's greatest threats. For him to appear now...\n\nHad Rebecca herself intervened?\n\n*'...No. This is our chance!'*\n\nAliburn's fear transformed into exhilaration. Hill wasn't like the previous servants—vulnerable in melee, easily cut down. Hill was Dark Bus's successor, the teacher of fallen servants. His combat prowess was unmatched.\n\n*'Amoract chose Hill specifically. He has the secret weapon to destroy a Hero King.'*\n\nThis was Providence. A divine opportunity to eradicate both the Rebecca Church and the Hero King in one stroke!\n\n\"Take this punch!\"\n\nHill's twelve-strike barrage descended on the Hero King. Dantalian, the 25th great demon, had blessed Hill with Fighting Knowledge—evolved now into the power to shatter heaven itself. Aliburn expected the Hero King to crumble beneath that assault, just as Damian had.\n\nThe outcome defied expectation.\n\n\"What?\"\n\nEach sweep of the Hero King's spear conjured lightning and flames. Hill's body was torn apart. Shields materialized around the Hero King—layers of protection that absorbed every counterattack. Hill bled. The Hero King remained untouched.\n\n\"This is beyond Muller...\" Aliburn's face went ashen.\n\n\"Linked Kill Wave Pinnacle!\"\n\nMyth upon myth upon myth.\n\nThe combined weapon—Belial's Staff and the Enlightenment Sword fused by divine blessing—transcended legendary classification entirely. Hill's death sentence was written in fire and lightning.\n\n[You have killed Yatan's Seventh Servant, Hill.]\n\n[Dantalian's Knowledge Fragment has been obtained.]\n\n[Your level has risen.]\n\n[Your level has risen.]"
}