{
  "id": 872,
  "title": "Chapter 872",
  "content": "[Dantalian's Knowledge Fragment]\n[★Fighting Knowledge ★\n-A fragment containing the fighting knowledge of the 25th great demon, Dantalian.\nMost of the knowledge is lost, but it is far beyond the knowledge of an ordinary human.\nMartial arts will evolve one step further.\nKnowledge Acquisition Conditions: A martial artist type profession.\nKnowledge Acquired: All skill level +1. 10% increase in attack speed, 20% increase in evasion.]\n\nGrid stared at the description, his eyes widening. Four years as Pagma's Descendant, and not a single skill had reached master level. The grind to raise even one skill rank made his head hurt just thinking about it—which meant this fragment's value was astronomical. And this was only a piece of Dantalian's full knowledge.\n\nWhen Hill's corpse had dissolved into light and dropped a single worn booklet, disappointment had soured Grid's victory. That feeling evaporated as he read. Satisfaction replaced it, then gave way to something deeper. Admiration.\n\nA blacksmith's knowledge fragment had to exist somewhere. Grid filed the thought away. More importantly, Regas would benefit enormously from this.\n\nNo calculations ran through Grid's mind about market value or potential buyers. The days of hoarding every advantage were behind him. Not because he'd grown soft or careless—his reasoning had simply evolved. Strong allies meant protection for everything and everyone he held dear. The investment Regas represented far outweighed whatever coins the fragment might fetch. Besides, making money had become trivially easy.\n\nJishuka and Yura had more than repaid his generosity. Regas would do the same.\n\nGrid was building a network of debt without even realizing it.\n\n[The duration of Item Combination is over.]\n[Belial's Staff and the Lightning Sword Born from Enlightenment and Strong Desires have been separated.]\n[The cooldown time of Item Combination is reset by the effect of the skill 'Divinity'.]\n\nThe spear collapsed back into its component forms. Grid returned the staff to his inventory while Aliburn's gaze locked onto the earrings dangling from his ears.\n\nThose ivory pieces...\n\nRecognition struck like lightning. Dark Bus had worn those exact earrings during his infiltration of the Saharan Empire. The artifact granted Blackening—the transformation into a half-demonkin once every twelve hours. One of their most powerful relics.\n\nAliburn's mind raced. The Overgeared King. Everyone knew the name, knew about the upstart kingdom carved from nothing. But if this man possessed Dark Bus' earrings, that meant...\n\nNo. It made no sense. Dark Bus had been sowing chaos in the Empire. Why would anyone kill him there? The logic didn't connect—\n\nGrid's hand shifted, and Aliburn's denial shattered. The thin black ring on his finger was unmistakable. Dark Bus' Ring, the cursed trinket that devoured mana and enabled skill dispelling. \n\nThere was no escaping the truth. Dark Bus' killer. The Yatan's Servants' Slaughterer they'd been hunting.\n\nStanding right in front of him.\n\nAliburn's fury crystallized into bloodlust. Rage flooded through him—this famous fool had murdered one of their own, and now he'd pay.\n\nAround the hall, reactions split between jubilation and despair.\n\n\"Overgeared King! Hero King! Yatan's Servants' Slaughterer!\" Aliburn's scream tore through the chaos, equal parts challenge and declaration.\n\nTwo minutes. Hill's defeat had taken only two minutes. Yet Aliburn didn't flinch. Something in his posture made Grid's instincts flare.\n\nThis one won't break easily.\n\nThe calculation was obvious. Grid had burned through Blackening on the journey to the Vatican, then emptied his arsenal protecting Irene and Lord the moment he'd arrived. Every trump card deployed at maximum efficiency—because Hill had been that dangerous, and because the enemy's numbers had demanded it.\n\nThe strategy was working. Pope Damian's appearance had shaken the black magicians' morale. Hill's death had nearly broken them. Debuffs rippled across the enemy forces, weakening their attacks and defenses.\n\nBut Aliburn's aura intensified. Hill's death hadn't rattled him at all. He'd watched, assessed, and recognized Grid's depletion.\n\n\"Your divinity skill caught me by surprise.\" Aliburn's voice carried absolute confidence. \"But even the Hero King can't chain divine abilities.\"\n\nHe raised one finger. The blackened nail wasn't decorative—blood had stained it permanently. Countless victims had died on those hands. Like most of Yatan's Servants, Aliburn had murdered his way to power. Children, innocents, anyone who served the Church's ambitions.\n\n\"Warning Cannon.\"\n\nHalf a second. Magic power condensed on his fingertip.\n\nAnother half second. He fired.\n\nOne second total. The beam obliterated every Rebecca paladin in its path, then streaked toward Grid.\n\nWarning Cannon. Warning Curtain. Warning Sphere. Transcendent black magic, all gifts from Amoract—the true First Servant. Power that made Aliburn untouchable.\n\n\"This treasure was meant for Rebecca's Daughters!\" Triumph dripped from every word. \"Not even the Hero King survives this!\"\n\nThe explosion swallowed Grid whole. The banquet hall wall disintegrated. Stone pulverized into dust, obscuring everything in a choking cloud.\n\n\"Grid!\"\n\n\"Your Majesty!\"\n\nShouts erupted from every direction. The blast's magnitude left no room for optimism, even among those who knew Grid's capabilities. Even Pope Damian and Lord, who trusted him more than anyone, felt their hearts seize.\n\n\"Father!\" Lord's voice cracked. His small body strained forward, desperate to run.\n\n\"He's fine.\" Irene's grip on her son was iron. Her hands no longer trembled. Every terror from her past had evaporated the instant Grid appeared. Her faith was absolute.\n\nDamian and Lord found themselves unable to argue.\n\n\"Whew.\" Grid emerged from the settling dust, vindicating their belief. The red glow from his ring pulsed brighter—Dark Bus' Ring, gorged on mana from dispelling the attack, heating toward critical mass. Once it absorbed five thousand mana, Skill Dispel had to activate twice within ten minutes or the backlash would kill the wearer.\n\nNeed to burn one more charge. Grid's irritation simmered beneath a provocative stare aimed at Aliburn. He'd bait out another attack, dispel it, then crush this bastard.\n\nAliburn remained motionless. His silence was predatory.\n\nThen Grid noticed. Every black magician had stopped casting. They stood idle, absorbing punishment from Rebecca's forces without resistance. Morale surged among the defenders.\n\nIce flooded Grid's spine.\n\nThey know about the ring.\n\nOf course. The Yatan Church would be intimately familiar with their own artifacts. They were deliberately avoiding giving him a second dispel target, forcing the ring to explode.\n\n[The amount of magic power accumulated in Dark Bus' Ring is too high. Dark Bus' Ring can't endure it.]\n[Warning. There are 30 seconds left until Dark Bus' Ring explodes. The explosion will permanently destroy Dark Bus' Ring, and the wearer will lose their life.]\n\n\"F—\" Grid choked the curse back, acutely aware of Lord and Irene's presence. \"Damian! Hit me with a skill!\"\n\nSkill Dispel required direct contact between ring and ability. Its unique rating instead of legendary reflected this limitation—awkward activation, devastating penalty.\n\n\"Huh? Y-Yes!\"\n\nDamian's confusion was visible, but he moved to comply. The skill died before formation.\n\n\"Warning Curtain.\"\n\nAliburn's enchantment blanketed the area, rendering everyone inside unable to activate skills.\n\n[Warning. There are 20 seconds left until Dark Bus' Ring explodes.]\n\n\"Damn it!\"\n\nNo choice. Grid had to abandon the ring. Valuable, yes, but worthless compared to Irene and Lord's lives. He reached to remove it—\n\n[You can't take Dark Bus' Ring off.]\n\nFifteen seconds. The ring stayed fused to his finger. Ten seconds. Nine. Eight.\n\n\"Shit!\" Panic clawed at Grid's composure. Then skeletal hands thrust through the shattered wall. Magic erupted—six pillars of power swept through the black magicians surrounding Irene and Lord. Grid lunged toward the nearest column.\n\n[The Skill Dispel option of Dark Bus' Ring has been activated!]\n[Dark Bus' Ring has removed the target skill. All the mana accumulated in Dark Bus' Ring has been consumed, and it has entered the resting state.]\n\nFour seconds before detonation, the ring went dormant.\n\n\"Hah... hah...\" Ten years of his life, returned in an instant. Grid's relief lasted only until he processed what had happened. His gaze snapped to the lich, killing intent radiating outward. Magic fired at his family...\n\n\"Mumud!\" Was Agnus orchestrating this from the shadows?\n\n\"Crazy bastard!\" Rage consumed Grid's thoughts—\n\n\"Warning Sphere.\"\n\nAliburn's voice cut through the chaos. Frustration colored his words—the chance to eliminate Grid had slipped away. Dozens of black spheres materialized around him, far more than the Overgeared Knights, God Hands assisting Kasim, or any of Grid's summons—Noe, Randy, the Overgeared Skeletons—could possibly intercept.\n\n\"Out of my way!\" Aliburn's true objective crystallized. Destroy the Rebecca Church. Elevate Yatan's influence. Slaughtering continental royalty as a warning was merely a bonus. Yet this petty king dared obstruct him? The darkness spread in every direction, threatening Grid's people and every noble present. Aliburn would sweep the board clean, then proceed unimpeded.\n\nHe still commanded reserves. Amoract's gift before the invasion gave him everything needed. The Hero King? The Overgeared King? Hill had already depleted this unexpected variable. Grid posed no real threat.\n\nThe end approaches. Rose smiled.\n\nAgnus' betrayal, the young prince's hidden capabilities, the imperial prince's strength, Damian's escape, Grid's arrival—each variable had sent ripples of unease through her. Not anymore. Aliburn, Yatan's Third Servant, brilliant tactician behind this entire Vatican raid, would crush Grid, Damian, and Agnus like the insects they were.\n\nGrid felt the crisis settling over him like a shroud.\n\nToo many!\n\nThe sphere count reached several hundred. Freely Move carried him to Aliburn in a blink, but the bastard didn't even stop casting. He tanked Grid's swordsmanship through raw health and defense, spawning more spheres with every second. When they detonated, the entire area would become a crater.\n\nGrid might survive—his titles, item effects, and passives could probably carry him through. But Irene, Lord, the young Overgeared Knights? He'd lose them all.\n\nSummoning more knights was impossible inside the ward. Options dwindled to nothing.\n\nWas this defeat inevitable from the start? The Yatan Church's victory pre-ordained? Players rendered helpless, the worst possible ending unfolding...\n\nWould he watch Irene and Lord die?\n\nThe thought drained the color from Grid's face. His eyes swept the chaos, searching for anything—\n\nHis gaze snagged on a hilt protruding from Aliburn's robe.\n\n[Sword Stuck in the Rock]\n\nA golden name. A quest arrow hovering above it, identical to the marker that had appeared over Lifael's Spear years ago. Grid's hand moved on pure instinct, closing around the hilt.\n\nAliburn's satisfaction evaporated into panic. \"You—what are you—?\"\n\n\"Legendary Blacksmith's Appraisal!\"\n\n[The blacksmith who became a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\n*Ttiring~*\n\n[You have discovered a hidden feature in the item!]\n[!!!! The first holy sword of humanity. It was sealed in the stone by the original seven malignant saints!]\n[★Hidden Quest★ Crossroad of Good and Evil has occurred!]\n[The power of God's Command has shattered the Stone of Original Sin!]\n[The quest item First Incomplete Holy Sword has been obtained!]\n\n\"What—?\"\n\nLight detonated outward. Darkness evaporated like mist under noon sun. Hundreds of black spheres winked out of existence as though they'd never formed.\n\nFor the first time, genuine shock carved lines across Aliburn's face.\n\n\"Grid!\"\n\n\"I...\"\n\nTheir eyes met across the battlefield. Grid absorbed the hidden quest details. Damian read the updated parameters of Recapture the Holy Sword.\n\nUnderstanding passed between them."
}