{
  "id": 873,
  "title": "Chapter 873",
  "content": "The quest was clearable. Damian had been certain of it from the start.\n\nEven trapped within the barrier, caught in Hill's iron grip, surrounded by Aliburn's hundreds of black spheres—his conviction never wavered.\n\n*This crisis exists to be overcome. That's how the world works.*\n\nHe'd been prepared to wait it out even if Grid hadn't arrived. Rebecca's Daughters still held their White Transformation in reserve, as promised. When they unleashed that power, the tide would turn. Damian had simply been waiting for that inevitable moment—the narrative beat where the Daughters would enter the fray with everything they had.\n\nBut the situation veered sharply from his expectations.\n\nBefore Rebecca's Daughters could move, Grid shattered the script entirely. It happened the moment his hand closed around the sword in Aliburn's arms—the blade sealed within stone.\n\nBrilliant light erupted. The weapon Grid drew forth didn't fade like an illusion. Instead, the radiance intensified, the blade's form solidifying into something complete and whole.\n\n\"What—?\"\n\nPagma's Descendant was interfering with the very *symbol* of the Rebecca Church?\n\n*What right does he have?*\n\nThe Holy Light Set, treasured relics of Fifth Pope Franz—Pagma had forged those, so Grid's connection made sense. But this?\n\n*Did Pagma have anything to do with the First Holy Sword?*\n\n**Ttiring~**\n\nA notification window materialized before Damian's eyes.\n\n> [The quest **Recapture the Holy Sword** has been updated to **Recapture the Holy Sword (2)**!]\n>\n> [**Recapture the Holy Sword (2)**]\n>\n> [★ Hidden Quest ★\n>\n> The sealed holy sword, held captive by the Yatan Church, has been liberated through the power of the Seven Malignant Saints.\n>\n> Those seven, unsatisfied with their status as half-gods, once sought this very blade in their quest to ascend to true divinity.\n>\n> The Holy Sword is Rebecca's symbol and the Pope's divine mandate!\n>\n> You must reclaim it!\n>\n> Beware the evil one who reaches for a god's throne!\n>\n> **Quest Clear Conditions:** Recover the Sealed Holy Sword.\n>\n> **Quest Clear Reward:** Blessings of Goddess Rebecca, God Judar, and God Dominion. Affinity with the Elders will reach maximum. You will command the respect of all believers.\n>\n> **Quest Failure:** Mass defection of disillusioned believers. Loss of papal eligibility. Goddess Rebecca's disappointment. **Level -10**.]\n\n*The Seven Malignant Saints? Where did they suddenly enter this?*\n\nFor most players, the Seven Malignant Saints remained unexplored lore. Even Overgeared King Grid had only recently learned of them—and only because Kraugel had shared that knowledge. But Damian was no ordinary player. As a high ranker with a former hidden class, as the Pope of the Rebecca Church itself, he'd conquered countless quests. His information network might even exceed Kraugel's. He knew the Malignant Saints for what they were: absolute evil.\n\n*They received the gods' favor and became half-gods. But they weren't satisfied. They reached for the gods' own thrones...*\n\nOne of them had inherited the power of light from Goddess Rebecca herself. The mere thought made Damian's blood boil. How dare they betray the Goddess who loved humanity with such compassion? From his days as the Goddess' Agent to his ascension as Pope, Damian had studied Rebecca's works extensively. He admired her deeply—and despised the seven who'd repaid her grace with treachery.\n\n*Wait...*\n\nThe realization struck like a thunderbolt. The quest had updated the instant Grid touched the holy sword. Which meant the \"evil person\" wielding the Seven Malignant Saints' power—\n\n\"Grid!\"\n\nDamian's shout cut through the chaos, ice threading through his voice. Grid heard him. But Grid was staring at his own quest window—at words dripping with temptation, pulling him toward an abyss of moral conflict.\n\n> [**Crossroad of Good and Evil**]\n>\n> [★ Hidden Quest ★\n>\n> Through countless trials, you have claimed the power **God's Command**—a gift left by Taren, the Fourth Malignant Saint.\n>\n> Taren's voice echoes: *\"The light was so bright, I could not see the darkness hidden beyond it.\"*\n>\n> War God Zeratul's voice counters: *\"Human. This is not Taren's arrangement. This is Dominion's will and mine. Do not heed the corrupted one's whisper.\"*\n>\n> The Incomplete Holy Sword begins to erode under God's Command's influence.\n>\n> The Incomplete Holy Sword is Rebecca's symbol.\n>\n> **Make your choice.**\n>\n> Will you seize the Incomplete Holy Sword through the Seven Malignant Saints' power, or return it to the Rebecca Church?\n>\n> Pioneer your own path!\n>\n> **Rewards for Seizing the Incomplete Holy Sword:**\n>\n> * Acquire the **Holy Sword of the 4th Evil**.\n> * **Race evolution:** Human → Half-god. Half-gods transcend humanity and approach divinity. Massive potential for ability growth.\n> * **God's Command** strengthened. Activation rate becomes 100%. (Critical hits disabled for affected skills.)\n> * Unlock skill: **Corrupted Holy Sword**.\n> * **Cursed by:** Goddess Rebecca, God Dominion, God Judar, God Zeratul.\n> * Affinity with Rebecca Church, Dominion Church, and Judar Church plummets to negative values.\n> * War God's followers will hunt you relentlessly.\n>\n> **Rewards for Returning the Incomplete Holy Sword:**\n>\n> * Goddess Rebecca's blessing.\n> * Rebecca Church affinity rises to maximum.\n> * (Your Rebecca Church affinity is already at maximum.)]\n\n**Thump. Thump. Thump.**\n\nGrid's heart hammered against his ribs. The words burned themselves into his vision. Desire writhed in his chest like a living thing, his base instincts screaming at him.\n\n*Take the sword!*\n\n*Half-god! HALF-GOD!*\n\n*No one could stop you. You'd reign forever!*\n\n*The entire world would know your name. People would look up to you with awe.*\n\n*Ahyoung would regret rejecting you every single night. Heh.*\n\n*Those bastards who bullied you—what would their faces look like then?*\n\n*This is a once-in-a-lifetime chance. Everything's dangerous right now. Someone like Kraugel or Agnus could take your position at any moment.*\n\n*What about the enemies hoping for the Overgeared Kingdom's downfall? What if they strip everything away? What if you return to that miserable life?*\n\n**Thump. Thump. Thump.**\n\nThe internal debate was lopsided from the start. Despite all his achievements, despite overcoming so much of his past, Grid's greed remained a ravenous thing. His grip tightened on the holy sword's hilt.\n\n\"Grid!\"\n\nDamian's shout barely registered. Grid knew Damian respected him—envied him, even. The feeling was mutual. Sometimes it felt like a dream that someone as remarkable as Damian would look at him with genuine admiration.\n\nBut it wasn't enough.\n\nGrid's fingers didn't loosen.\n\n\"Grid! Wake up!\"\n\nIsabel's cry pierced deeper. That poor woman. He'd saved her from darkness, given her happiness. The gratitude, love, and respect she felt for him had become one of his greatest sources of pride and strength.\n\nDisappointing her would sting.\n\n\"I...\"\n\nHis grip loosened—fractionally. For one heartbeat.\n\nThen his fingers clenched again, greed surging back like a tide. He couldn't suppress it.\n\n\"Your Majesty!\"\n\n\"Father!\"\n\n\"...!\"\n\nIrene's voice. Lord's voice.\n\nGrid's mind snapped into focus. For the first time, he tore his gaze from the blade and looked at them.\n\nThe first woman who'd loved him. The woman who'd devoted herself to him without reservation, who'd taught him what happiness and rest truly meant. And their son—the child who followed in his footsteps, who looked at him with such trust.\n\nOther faces flooded his mind. Huroi. Yura. Jishuka. Regas. Pon. Lauel. Peak Sword. Toon.\n\n\"I...\"\n\nThe conflict shifted. The scales tipped. He forced the boiling desire down, crushed it beneath something stronger, and roared with everything he had:\n\n\"I can't risk my family and comrades...!\"\n\nWhat was he thinking, acting alone? His people would suffer if he gave in to this. If he made himself an enemy of the world for personal power, *they* would pay the price. He refused to let that happen.\n\nHis life wasn't his own anymore.\n\n\"Damian!\"\n\nGrid shouted the name and hurled the holy sword skyward. Pope Damian snatched the tumbling blade from the air, and a brilliant smile split his face.\n\n*Thank the Goddess.* If Grid had become the second coming of a Malignant Saint—Damian didn't want to imagine that nightmare scenario.\n\n\"This—stop all of them!\" Aliburn shrieked, his composure shattered by the divine power erupting from the holy sword. But his command came too late. Yatan's Servants and the black magicians were still reeling.\n\n\"Goddess' Will.\"\n\nThe Pope swung the First Holy Sword. Divine power manifested in a wave of purifying light, scouring away dark curses and cleaving through Yatan's Servants and black magicians alike.\n\n\"*Kuock!*\"\n\nThe First Holy Sword was forged to slay great demons. Yatan's Servants couldn't withstand its might. Aliburn took a devastating blow and crumpled. Grid moved in response to Damian's strike, his body flowing into the familiar rhythm.\n\n\"Pagma's Swordsmanship!\"\n\n\"*You!*\" Aliburn's eyes were bloodshot, fixed on Grid with apocalyptic hatred. The one who'd destroyed everything—his plans, his ambitions. \"*I'll die and drag you to hell with me!*\"\n\n\"Kill!\"\n\n\"*Kuk...! Kuaaaaak!*\"\n\n\"H-hik...!\"\n\n\"The Third Servant!\"\n\nThe deathly screams of the wicked being who'd terrorized thousands of Rebecca's faithful drove the remaining black magicians into chaos. They scattered in panic while the Rebecca paladins gave chase.\n\n\"Hah... hah...\"\n\nAliburn vanished in a pillar of gray light. Grid stumbled, his body finally acknowledging the toll. The physical and mental exhaustion from protecting everyone he cherished crashed over him in a wave. His stamina plummeted—he should have collapsed on the spot.\n\nBut he remained standing. He had to. His wife and son were running toward him.\n\n\"Your Majesty!\"\n\n\"Father!\"\n\n\"Thank god. I'm so glad you're safe.\"\n\nAs he embraced them, the smile on Grid's face held a warmth that rivaled the goddess's portrait itself. The Rebecca Church's Elders watched him with expressions that had fundamentally shifted. Meanwhile, Isabel looked as though she were witnessing a living saint—on the verge of deifying Grid where he stood."
}