{
  "id": 874,
  "title": "Chapter 874",
  "content": "Grid's hand found Irene's cheek, his touch reverent. He cradled her face as though she were made of glass.\n\n\"The whole way here, I prayed you were safe.\" His voice cracked. \"Thank God. Thank God you're okay.\"\n\n\"My king...\"\n\nThe tenderness in his eyes, the warmth of his palm, the rawness in his words—Irene felt her heart overflow. Her love for this man knew no bounds.\n\n\"I'm so grateful you came—\"\n\nHad she been the only one in danger, guilt would have poisoned her joy. She would have hated herself for dragging the king away from his duties, from his kingdom. But she hadn't been alone. Lord had been threatened. Kasim and Chucksley had bled. Young knights—the nation's future—had nearly died. Grid had saved them all.\n\n\"Do you remember when we first met?\" Irene's voice grew distant. \"You were saving someone then too.\"\n\nShe'd been just an earl's daughter. Doran had still been alive. The Yatan Church had taken her, and Grid had come.\n\n\"When I became Winston's ruler, I heard stories about you.\" A faint smile touched her lips. \"A hero who freed the powerless from a tyrant. Who protected an old blacksmith named Khan.\"\n\nAfter that, Grid had saved her again from the Yatan Church. He'd driven back the golem invasion of Reinhardt. He'd rescued two hundred fifty thousand souls in Pangea, half a world away.\n\nThis was who Grid was. A man who lived for others.\n\n\"I admire you so much.\" Color rose in Irene's cheeks.\n\n\"Ahem. Right.\" Grid cleared his throat, sweat beading on his temple.\n\nIrene's idealized vision of him always made him uncomfortable. What would she think if she knew the truth? The selfish thoughts, the petty moments, the—\n\nIrene pressed against his chest and whispered, \"I need you to understand something. I would love you even if you weren't a hero.\"\n\nShe'd seen it clearly—that brilliant holy sword devoured by Grid's darkness. And she'd realized: even if he'd abandoned her and Lord to walk a corrupted path, she would have followed him still.\n\n\"You're the most precious person in the world to me.\" Conviction rang in every word.\n\nJoy surged through Grid's chest. \"Irene...\"\n\nWords became unnecessary. Their lips met, heedless of watching eyes. The emotions coursing between them needed no translation.\n\nThey each held one of Lord's small hands, completing the circle. Three became one.\n\n\"Father... Mother...\"\n\nLord felt his world settle into place.\n\nHis parents' love for each other rippled outward, strengthening him. Today had taught him so much. The patience to swallow grudges for a greater cause. A retainer's loyalty and a ruler's duty. A woman's wisdom and a mother's love. The Pope's righteousness and power—and his helplessness.\n\n*Father's strength, and...*\n\nLord's gaze drifted to the silent skeleton. Broken ribs. Cracked skull. Lich Mumud.\n\n*...sadness.*\n\nPerhaps only a child could see it—the anguish, regret, and hatred swimming in Agnus' eyes as he stared at Lord and his mother. And Mumud's loneliness, deeper than any ocean.\n\nEveryone carried wounds. Kasim's resentment toward the empire. His mother's fear of the Yatan Church.\n\n*I want to heal those wounds.*\n\nThe thought crystallized into purpose. If his father built kingdoms and stood as a guardian, then Lord would walk beside him, tending to what his father couldn't reach.\n\n*I'll bring more people to Father's side.*\n\nHe had faith. With teachers like Kasim, Damian, Kraugel, and Piaro, he would grow strong. Today's helplessness wouldn't last.\n\n*Stronger. I have to become stronger.* Strong enough to stand shoulder-to-shoulder with his father someday. *I have to work harder for Father.*\n\nHistory was littered with princes who plotted against kings, with kings who watched their heirs with suspicion. The lion and the cub, circling each other, waiting. But Lord's pledge of loyalty—sincere, unshakeable—was different.\n\nA moment that would echo through the ages.\n\nGrid broke the kiss. His eyes followed Lord's gaze.\n\nHis expression twisted into something savage.\n\n*That bastard's still here?!*\n\nHe'd missed it—Lich Mumud standing motionless, staring at Grid with empty sockets. Grid knew nothing of the living Mumud, but this version belonged to Agnus. Which made him an enemy.\n\n\"Agnus! Show yourself!\"\n\nGrid's roar shattered the pre-dawn silence. The Enlightenment Sword materialized in his grip as he launched himself at Mumud.\n\n\"Father! He's not the enemy!\"\n\n\"Your Majesty! The lich helped us!\"\n\nIrene and Lord's cries went unheard. Grid was already there, blade raised. And how could he believe them? Mumud, helping? Impossible. They had to be mistaken.\n\nThe Enlightenment Sword crashed against Mumud's shield. Black flames erupted, crumbling already-damaged walls, but the barrier held firm.\n\n\"Where's your master?\" Grid snarled, thinking of Agnus somewhere nearby, laughing as Grid's family suffered.\n\n\"...\"\n\nMumud said nothing. His hollow gaze met Grid's. He didn't counterattack.\n\nIt felt like mockery.\n\n\"Agnus!\"\n\nThe madness, the danger, the thought of Agnus enjoying Irene and Lord's terror—it fueled Grid's assault. His stamina was barely recovered, but he hammered at Mumud relentlessly. Meanwhile, the God Hands, his light elemental, and his pets formed a protective ring around his wife and son.\n\n\"...\"\n\nAs sword strikes and explosions raged around him, Mumud's mind drifted.\n\nWhat had he been doing at the young prince's age? Begging for scraps, an orphan who'd never known his parents' faces. Had he ever protected anyone the way this child had?\n\nOnce. Just once.\n\nHis wife from Siren. The only person he'd ever loved. The woman he'd promised to make happy forever.\n\n*Clack... Clack clack...*\n\nMumud's jaw rattled. His cracked skull trembled. The memories cut deep.\n\nThere had been a teacher once, someone Mumud had loved like a father. A betrayal. Then his wife, who'd healed that wound. Then sickness, incurable and creeping.\n\n*Clack! Clack clack!*\n\nHis life had been pain. His death was supposed to be rest—permanent, peaceful rest.\n\n\"Mumud!\"\n\n\"...\"\n\nBut a voice had dragged him back from that darkness. As if he didn't deserve peace. As if he'd been born to suffer.\n\n*Clack clack! Clack!*\n\n\"Agnus!\"\n\nGrid's shout snapped Mumud back to the present. Agnus stood nearby, half-skeleton—the early stages of lich transformation.\n\nWho was Grid really fighting?\n\nThe thought flickered and died.\n\n\"You!\" Grid had seen Mumud cast magic toward Irene and Lord. If Skill Dispel hadn't worked, they'd be dead. \"Die!\"\n\nGrid's killing intent blazed.\n\nBefore Irene and Lord could scream a warning—\n\n\"Mumud! Why aren't you killing that bastard? Huh? Kek! Kekekeke! Kyahahahaha!\"\n\nAgnus spoke first.\n\nAnd Mumud, who hated Agnus more than anything, who'd been defending silently—had no choice but to obey.\n\n\"Kugh...!\"\n\nGrid was mid-leap toward Agnus when the mana sphere struck his ribs. His health plummeted by thousands.\n\n\"Bastard!\"\n\n\"Kuahahahaha!\"\n\nChaos erupted.\n\nGrid had comforted his family, but now another enemy had appeared. He hadn't checked his quest rewards. Hadn't even confirmed what Aliburn's death had given him. Agnus was the same—he'd succeeded in his raid on Silvenas but rushed to the banquet hall without checking his loot.\n\nHe'd needed to make sure she was okay.\n\n\"Come on!\"\n\n\"Let's go!\"\n\nThe shockwave from their clash dwarfed everything before it. Not just the ruined banquet hall—the entire Vatican trembled. In the village below, residents feared landslides."
}