{
  "id": 875,
  "title": "Chapter 875",
  "content": "There are certain people who inspire visceral revulsion—not through malice or cruelty, but through something deeper, more fundamental. Grid was such a person to Agnus.\n\nAccording to rumors, Grid's past mirrored Agnus' own. True, Grid hadn't watched the woman he loved die while powerless to save her. Hadn't hunted down those responsible and carved vengeance into their flesh. Hadn't spent every waking moment since drowning in her memory.\n\n*But he suffered.* Agnus knew better than to measure pain like currency. The bullies who'd ground cigarettes into his palms while his lover screamed—they'd thought his pain trivial. Hadn't they laughed while he gritted his teeth and turned the pages of his textbook, ash still burning his flesh?\n\nPain was relative. Selfish. Unmeasurable.\n\nGrid's suffering couldn't be weighed against his own. That wasn't why Agnus found him disgusting.\n\n*I can't understand.* Why hadn't Grid's agony twisted him? *Why does he look so damn happy?*\n\nGrid was never alone. Family surrounded him. Lovers. Friends. Always smiling at his side, as though the world hadn't already shown them its teeth. How could Agnus comprehend it? Had Grid forgotten what powerlessness felt like? They'd both clawed their way to the top—to a place where they could *trample* instead of being trampled.\n\nPeople like them were meant to stand alone.\n\n> [You have suffered 8,900 damage.]\n> \n> [Your health is less than 10%. **Silvenas' Power** attached to the **Rune of Death** has activated. The dark demonkin's nature manifests—you assimilate with darkness, concealing your appearance and status.]\n> \n> [Your contractor **Baal** is pleased.]\n> \n> **—Evil consuming evil through twisted conviction. The inverse of my former contractor. I chose well. How fascinating.**\n> \n> [Affinity with **1st Great Demon Baal** has increased by 10.]\n\nAgnus ignored the notifications. His hateful gaze tracked Grid through the chaos.\n\n\"You're pathetic!\" His voice cracked. \"Can't even protect what matters to you!\"\n\nWhy wasn't Grid's mind a howling void like his own? Why hadn't isolation consumed him? Why did he squander his strength embracing the weak instead of hoarding those few precious things worth protecting?\n\nAgnus *despised* it. Despised *him.*\n\nHe vanished into shadow just as black flames erupted from the Enlightenment Sword. The splash damage found him anyway, searing through his concealment.\n\n> [You have suffered critical damage!]\n> \n> [Half-lich state active. Death resistance maintained for transformation duration.]\n> \n> [You have survived!]\n\nGray dawn light filtered through the ruined Vatican. Agnus pressed against a tilted pillar's shadow, half his ribcage visible bone. He swayed, balance failing. Any moment, Grid's blade could find his skull.\n\nNormally, Agnus would be *laughing*. These exhilarating moments—when death's proximity burned away the awful weight of reality—usually filled him with manic joy.\n\nNot now.\n\nConfusion and pain warred across his skeletal features. Not confusion over protecting Grid's family—he'd seen his dead lover in them, made his choice without regret.\n\nNo, the confusion came from *Grid himself.* Why was he so different? \n\n*Am I the one who's wrong?*\n\n\"No!\" The denial tore from his throat. \"YOU'RE wrong!\"\n\nHis sword materialized from darkness, plunging into Grid's side. Curses laced the blade, corroding resistances. Grid's dark resistance shattered completely.\n\nGrid coughed blood, and through the haze of pain, remembered the notifications he'd dismissed minutes ago:\n\n> [The **Goddess of Light Rebecca** awaits your response.]\n> \n> [You have been granted another opportunity to receive great power through the goddess' blessing.]\n> \n> [**War God Zeratul** is satisfied with your choice.]\n> \n> [**War God Zeratul** supports the goddess' affection toward you.]\n\nLike Agnus, Grid had ignored them. From their first meeting until this moment, Agnus had only ever brought suffering. Grid despised people who trampled others and *smiled* while doing it. And now his family had nearly become sacrifices to Agnus' twisted joy?\n\n\"Crazy bastard!\" Killing intent surged through him—pure and cold and *necessary.* This wasn't anger. This was responsibility. The fighting energy around him thickened, darkening.\n\n\"**Wave!**\"\n\nSword energy rippled outward in concentric circles. The wide-area technique would flush Agnus from invisibility.\n\n\"There!\" Something blocked the expanding waves. Grid's focus sharpened. He initiated the sword dance—**Pagma's Swordsmanship, Pinnacle Kill.**\n\nThe fusion technique manifested.\n\nAnd immediately failed.\n\n\"Kuk...!\" Grid's legs buckled. He'd been too agitated—overlooked his own stamina depletion.\n\n> [Stamina critically low. Combat skills unavailable.]\n\n\"Overgeared... Corn...\"\n\nHe needed the unicorn's stamina restoration. Desperately. But how could he commune with it mid-battle? His enemy wasn't slow. Wasn't foolish.\n\nEspecially not *this* enemy.\n\n\"Kikikik! Kihahahahat!\"\n\n**Wave** tore through Agnus' concealment. Half his body was exposed bone, white and gleaming, but the wind whipped his disheveled hair like a banner and his momentum remained fierce.\n\nCrisis. Grid had deployed everything—the **God Hands**, Noe, Randy, the **Overgeared Skeletons**, even the light elemental—all positioned around Irene and Lord. Nothing remained for his defense. He could barely lift his fingers.\n\n\"Grid!\"\n\nThrough blurring vision, Grid watched Agnus charge.\n\n\"...!!\"\n\n\"...!!!\"\n\nVoices rose around him, but the words didn't register.\n\n*Will I die here?*\n\nNo. Agnus was equally exhausted. His **Lich Transformation** was a last resort.\n\n*He might still have immortality. Bentao's Mockery.*\n\nGrid forced open the **Rune of Darkness**, activating **Cray's Power**—100% damage absorption. He swung his sword in a basic attack, determination overriding exhaustion. He still had the **First King** title effect. **Tiramet's Power**. His own immortality skill.\n\nIf he simply endured, he'd win.\n\nHe *had* to endure. Irene and Lord depended on it. Couldn't collapse. *Wouldn't.*\n\nGrid's basic attack cut air. Agnus used a skill, plunging through the strike to slam into Grid's body. They collided—\n\nAnd light flashed between them.\n\nWeaker than before, but unmistakable. The same blade that had wounded **Yatan's Third Servant Aliburn.**\n\nBoth warriors turned simultaneously toward Damian. The pope stood there, holy sword gleaming, expression resolute. He'd evolved after reclaiming the weapon and repelling the Yatan Church invasion.\n\n\"This is a sacred place serving the goddess' will.\" Damian's voice rang with authority. \"Stop fighting. As pope, I forbid further bloodshed.\"\n\n\"Why?\" Grid's question emerged hoarse, disbelieving. \"He's the enemy. Forget personal feelings—he's **Baal's Contractor.** Your church should be executing him. Why protect him now?\"\n\nDamian pointed. \"Look.\"\n\n\"...?\" Irritation sharpened to confusion. Grid followed the gesture.\n\nAnd froze.\n\n**Lich Mumud's** shield floated before Irene and Lord, absorbing the aftermath of their battle. The undead had been protecting them this entire time.\n\n\"What...\"\n\nMemory crashed through Grid's mind. Irene and Lord's voices: *He's a good skeleton.* They'd *meant* it. Lich Mumud had actually—\n\n*But why?*\n\nDamian watched Grid's trembling eyes. \"I understand your feelings. But let's end this. For today.\"\n\nThe Rebecca Church considered Baal their enemy. Pagma, his former contractor, had defended the **Hall of Fame**—but ultimately sold his soul to a great demon. The Church never forgave his later years. The new contractor deserved punishment.\n\nBut Pope Damian judged this wasn't the moment. \"Better if we part ways. For now.\"\n\nHe didn't understand why Agnus had betrayed the Yatan Church to help them. Didn't dare ask. The priority was stabilizing the situation. Perhaps someday, answers would come naturally.\n\nBut the explanation didn't satisfy Grid. \"What's your angle? Why protect my family?\"\n\n\"Hah?\" Agnus' laugh was brittle. \"The hell are you talking about? I didn't do shit.\"\n\n\"Answer me seriously!\"\n\n\"Didn't know they were yours.\"\n\n\"...?\"\n\n\"Just saw a pretty woman. Didn't want her dead.\" His grin turned predatory. \"Kikik... Wanted to play with her.\"\n\n**Lich Transformation** had ended. Only death awaited him now. Couldn't waste this opportunity—who knew when he'd get another chance at the undefended Overgeared King?\n\n\"Tch.\" Agnus swept his hair back, arranging it to expose cold golden eyes. The gesture transformed him from madman to something almost refined.\n\n\"Don't talk.\"\n\n\"...?\"\n\n\"Just fight. Kill me. Huh?\" The refinement shattered. \"Kik! Kikikik! Kihahahahat!\"\n\nAgnus lunged toward Grid, ignoring the pope entirely.\n\nThe watching Rebecca followers moved as one. Isabel's spear pierced his torso. Paladins' swords impaled his skeletal frame from three directions. Agnus collapsed before reaching Grid, fully restrained.\n\n\"Why would you—?\" Damian's anguished cry went ignored.\n\nInstead, Agnus' gaze drifted to Irene and Lord. The child was crying, silent tears streaming. Then those golden eyes locked with Grid's one final time.\n\n\"You...\"\n\n\"...\"\n\n\"...Become stronger.\"\n\nHis body turned gray, dissipating like ash. Lich Mumud followed moments later, unraveling into motes of dark light.\n\n\"Skeleton knight...\" Lord's voice cracked. *When will they find peace?* The red-eyed child fought back sobs, small hands clenched into fists.\n\nPope Damian moved to consult the elders. They dismissed the royalty and imperial prince to rest, then began investigating how the Vatican's defenses had been breached and assessing total damages.\n\n\"Your struggle was magnificent.\" 2nd Prince Dulandal approached Grid with courtly precision. \"Your Majesty is truly heroic. Several techniques particularly impressed me.\"\n\n\"Thanks.\" Grid's response was mechanical, distant. Only after confirming Irene and Lord had fallen asleep could he finally face the goddess' call.\n\n**—Hero. My blessing upon you.**"
}