{
  "id": 877,
  "title": "Chapter 877",
  "content": "**TL Note:** READ THE BIG ANNOUNCEMENT above this chapter. I'll link it here for convenience: [Announcement]\n\nThe good news is this puts more distance between me and the raw releases, so there's no point in doing a mass release when Overgeared returns. However, keeping the current seven-chapters-per-week schedule would end on a terrible cliffhanger. So I'm doing six chapters this week and six next week.\n\nFor those insisting on reading older chapters: please don't use aggregator or pirate sites. I'd rather you create your own PDF or EPUB during the two-week window and read privately—just don't distribute them.\n\n---\n\n*Is this some kind of joke?*\n\nForty strikes at 200% attack power per second. If all forty connected, that was 8,000% damage in a single second.\n\n*Of course, no one's going to just stand there and take it...*\n\nGrid possessed the Enlightenment Sword. Even if some exceptional player managed to dodge half those strikes, the black flames and red lightning would more than compensate. He could easily expect damage exceeding 8,000% attack power.\n\n*Who could possibly survive this?*\n\nAside from boss monsters, Grid would obliterate nearly any opponent in one blow. Players especially—with their relatively low health compared to monsters—simply couldn't withstand that kind of punishment.\n\n*I could one-shot them.*\n\nAnd Link had the shortest cooldown among Pagma's Swordsmanship techniques—just one minute. It was, without question, an invincible skill. The ultimate technique that would delete any enemy standing before him every sixty seconds.\n\n*And if I chain it into other sword dances immediately after...*\n\nHe could connect Link into any single technique to create two-fusion skills. Eventually, he'd unlock five-fusion skills. He was already anticipating firepower comparable to Hell Grid, the form that had overwhelmed Yura.\n\n*A god is a god for a reason.*\n\nGrid trembled with excitement over Goddess Rebecca's blessing. It was hard to imagine how much stronger he'd become.\n\nThen he checked the cooldown for Genuine Link.\n\nThe excitement drained from his face.\n\n*Thirty minutes?*\n\nDid he read that wrong?\n\n\"No... it's right.\"\n\n*Damn it!*\n\nWhat good was all that power if the one-minute cooldown became thirty minutes? Could it really be called an upgrade?\n\n*This can't be right.*\n\nThe biggest advantage of Link was unleashing black flames through multiple rapid strikes. With good luck, he could proc it every minute. A thirty-minute cooldown stripped away that entire advantage.\n\nHis mind raced to Wave and Restraint. Wave would hit harder. Restraint would ignore all status resistances completely. But both would also jump to thirty-minute cooldowns.\n\n\"You've got to be kidding me...\"\n\nWhat about Transcend? Kill? Revolve?\n\n\"More power, but...\"\n\nGrid's expression darkened with each skill he checked. Every single sword technique now had a fixed thirty-minute cooldown.\n\nHe couldn't take it anymore. Grid shot to his feet.\n\nHis wife and son were sleeping nearby. He bit back the curses building in his throat, then let them out in a strangled hiss: \"God—*damn* it! %!*$!!\"\n\n\"...?!\"\n\nThe knights stationed outside jolted at the sudden outburst. Coke especially looked completely thrown.\n\nGrid coughed when he noticed them. \"You've... worked hard out here.\"\n\n\"Not at all. It's an honor to guard Your Majesty.\"\n\n\"...\"\n\nGrid found himself genuinely amused by Coke's earnest energy. He didn't know about Coke's saga. Was it because Irene and Lord had praised him earlier?\n\n\"...Thank you.\"\n\nIn the silent corridor, Grid bowed deeply.\n\n\"Y-Your Majesty?\"\n\nCoke froze. The greatest person in the world was bowing to *him*? He had no idea what to do.\n\nGrid remained in his bow. \"I'm truly grateful that talented people like you joined the Overgeared Kingdom. That you threw yourself into protecting Irene and Lord.\"\n\nHe'd heard Coke was among the best of the second-generation Ten Rookies. Someone with that level of talent had options—plenty of them. Coke hadn't come here for mass-produced Grid Sets. He must have joined because he admired the Overgeared members. The way he'd protected Irene and Lord with everything he had proved it wasn't about quest rewards. He'd genuinely wanted to keep them safe, and earned the position of Lord's knight as a result.\n\nGrid straightened and clasped Coke's hand. His large, calloused palm completely enveloped the knight's.\n\n\"I'll repay you properly. So please—continue watching over my son.\"\n\nGrid never imagined Lord's first knight would be a player. Players were far more unpredictable than NPCs—too many variables. He'd have to work hard to maintain Coke's loyalty.\n\n*Please keep protecting Lord.* The message came through clearly in Grid's warm gaze.\n\n\"I don't want a reward.\"\n\nCoke's eyes reddened.\n\n\"I feel pride and joy every time I watch you compete in the National Competition or achieve something new. That's enough.\"\n\nCoke was Korean, just like Grid. He felt genuine pride whenever Grid elevated their country's standing. It fired him up, gave him something to aspire to—to become like Grid someday. Grid helped Coke just by existing.\n\nThat was the power of an idol.\n\nThe same way young people cheered for athletes during the Olympics or World Cup, Coke dreamed while watching Grid. Just being able to talk to him was a tremendous honor.\n\n\"Ah...\"\n\nA smile crossed Grid's face as he read the emotion in Coke's eyes. He finally understood—he was this young man's idol.\n\nWind blew through the half-open window, ruffling Grid's hair. His eyes held complicated emotions behind those windswept strands.\n\n*People I never would've dared to envy now look up to me...*\n\nGrid felt happiness and pride swell in his chest. But pleasant as those emotions were, they came with additional weight—a burden of responsibility toward those who believed in him.\n\n*If I ever shame them or let them down...*\n\nHe cleared his throat several times.\n\nHow embarrassing that his cursing fit had exposed his less dignified side. Coke noticed his discomfort and grinned. \"It's been two years since I first saw Your Majesty.\"\n\nHe'd been living in the fortified city of Patrian back then. After meeting Grid and Piaro, he'd steadily learned more about Grid's personality through TV and the internet.\n\n\"I'm already familiar with who you are.\" Coke's eyes were steady and certain. \"I know, and I still admire you.\"\n\n\"...\"\n\n\"So please, relax. Be yourself. I'll never be disappointed in you.\"\n\nCoke gazed at him with unwavering conviction.\n\nGrid trembled as he realized the depth of Coke's resolve. It hit him—he'd never fully grasped this before. There were countless people like Coke who looked up to him. But it would take them time to reach his side, to stand out.\n\nWhy?\n\nBecause Grid was the sky above the sky. It wasn't easy for rising talents to reach those heights.\n\n—*Grid.*\n\nA whisper arrived. Pope Damian.\n\n—*If you aren't busy, could you spare a moment?*\n\nHad something happened? Either way, he wasn't doing anything critical.\n\n—*Yes.*\n\nGrid made his way to the Vatican gardens. Behind him, Coke bowed and returned to his post. Having defended Irene and Lord, he'd gained the title of Protector. Just staying at his master's side was making him stronger.\n\n***\n\n\"Damian, there's something I want to ask you.\"\n\nGrid found the pope waiting in the gardens. The goddess of light, Rebecca—she might be an NPC, but she wasn't the unconditionally benevolent figure people assumed. What did Grid think about that? It was a heavy, complicated subject. Ultimately, the gods were too distant a concern. He had more immediate problems.\n\n\"Did you receive the goddess's blessing as a quest reward?\"\n\n\"Yes, I received a blessing as my reward.\"\n\n\"Good. Did you get something called Skill Enhancement?\"\n\n\"Skill Enhancement?\" Damian frowned slightly. \"No, nothing like that. I receive a new skill with each blessing. I've never had a chance to enhance existing ones. Why do you ask?\"\n\n\"Why...\"\n\nGrid launched into an explanation. Damian was as trustworthy as any Overgeared member, so Grid laid out everything.\n\n\"...and that's the situation.\"\n\nDamian absorbed Grid's complaints and summarized. \"So the cooldown for enhanced skills gets fixed at thirty minutes?\"\n\n\"Exactly. How is this an enhancement? What good is more power if I can barely use it?\"\n\n\"I see. It does seem more like a trade-off than a pure upgrade.\"\n\n\"Right? Some blessing this is. Isn't this a bit excessive?\"\n\nTo think a god's reward could be this stingy...\n\nDamian spoke carefully to the grim-faced Grid. \"What about skills with cooldowns over thirty minutes?\"\n\n\"Huh?\"\n\n\"For example—if a skill has a one-hour cooldown, would enhancing it reduce that to thirty minutes? Wouldn't that count as an enhancement?\"\n\n\"Ah...\"\n\n*Wait.*\n\nSurprise flashed across Grid's face. Linked Kill Wave Pinnacle. His strongest technique, with a two-hour cooldown. An ultimate skill he could typically only use once per battle unless God's Command activated. What if he enhanced *that*?\n\nGrid didn't hesitate. He opened the enhancement list and located Linked Kill Wave Pinnacle.\n\n**[Genuine - Linked Kill Wave Pinnacle]**\n\n**Four sword techniques connected in sequence.**\n\n**Linked Kill deals 2,000% of your attack power to the target.**\n\n**If the target is hit at least twice, Linked Kill's damage increases by 300%, summoning Wave.**\n\n**Wave affects all enemies within five meters, dealing 750% of your attack power. All targets hit have their movement and attack speeds reduced by 80% for 30 seconds. Additionally, Pinnacle delivers guaranteed follow-up damage.**\n\n**Pinnacle ignores 88% of the target's defense and deals 2,300% of your attack power as physical damage.**\n\n**You may chain another sword technique immediately after Linked Kill Wave Pinnacle.**\n\n***This skill does not share cooldowns with Link, Kill, Wave, Pinnacle, or Linked Kill.**\n\n***Enhanced skills are fixed at master level.**\n\n**Skill Mana Cost: Half of maximum mana.**\n\n**Skill Cooldown: 30 minutes.**\n\n*This is incredible!*\n\nGrid's entire body shook as he absorbed the information. Damian noticed things had worked out and smiled.\n\nFive sword dances fused? How quaint.\n\nGrid was already looking forward to fusing *six* sword dances together."
}