{
  "id": 879,
  "title": "Chapter 879",
  "content": "Grid turned the holy sword over in his hands, his brow furrowed. *How do I cleanse it?*\n\nThe question didn't trouble him overmuch. Past experience had taught him that answers revealed themselves during the work itself.\n\n*Goddess' Tears. Has to be.*\n\nThe Rebecca Church possessed their own sacred substance—a perfect counterweight to the Yatan Church's vile essence. Where Yatan's power poisoned, the Goddess' Tears purified. He'd handled them before. This wouldn't be particularly difficult.\n\nBesides, Pagma's Descendant class quests followed a pattern. The challenges came in acquiring them, not completing them. The work itself? Usually straightforward.\n\n\"Right.\" Grid straightened. \"Let's get started.\"\n\nThe new sword dance technique, the goddess' blessing—they dulled the sting of losing his chance at becoming a half-god. He could live with that.\n\nDamian raised a hand. \"Not today.\"\n\nGrid's enthusiasm faltered. \"Why not?\"\n\n\"The foreign dignitaries are still here. They depart tomorrow afternoon.\" The Pope's expression was apologetic but firm. \"Wait until then.\"\n\n\"Ah.\" Grid nodded slowly, understanding. \"Makes sense.\"\n\nA blacksmith worked in a smithy. Hammering would echo through the Vatican's halls. Questions would be asked. Rumors would spread—*the Overgeared King is forging something in secret*. Every prince and noble would want to know what.\n\n*Can't let future enemies see my hand.*\n\nWhen he worked, the world narrowed to metal and fire. He'd never notice someone watching. Better to wait.\n\n\"You're right.\" Grid checked his connection time. Fourteen hours today. His eyes burned with exhaustion he'd been ignoring. \"I should rest anyway.\"\n\nHe'd log out. Come back when Irene and Lord woke. As he turned toward the moonlight streaming through the windows, movement caught his eye—a figure standing where the pale beams didn't reach.\n\nMercedes.\n\nShe must have taken up her post the moment Aliburn fell and the barrier shattered. Hours ago. Standing guard in silence while he spoke with Damian.\n\n\"I'm logging out. Watch over the Queen and Prince while I'm gone.\"\n\n\"Yes.\" No elaboration. No questions.\n\n\"...\"\n\nDamian stared at her, transfixed. In the moonlight, Mercedes' white hair and porcelain skin seemed almost translucent—ethereal, like the yukionna from old legends. Beautiful in a way that didn't feel quite real.\n\n\"She is human, right?\" The Pope's tone was bemused.\n\nGrid shot him a look. \"Eyes front, Your Holiness. You have Isabel.\"\n\n\"What? No, I meant—\" Damian waved his hands defensively. \"I'm just appreciating her aesthetically. Nothing improper, I swear. It's just...\"\n\n\"Just what?\"\n\n\"...You're going to get more haters, you know.\"\n\nGrid blinked. \"Explain.\"\n\n\"The women around you.\" Damian's voice turned rueful. \"Yura. Jishuka. Your wife. Now Mercedes. All of them...\" He gestured vaguely at Mercedes' statuesque profile. \"Do you have any idea how jealous that makes people?\"\n\nEven Damian—Grid's self-proclaimed biggest fan—felt a twinge. Anyone who already disliked Grid would be furious.\n\n*Why would anyone be jealous of me?*\n\nGrid was single in reality. He had no interest in discussing his non-existent love life—not when he was pushing thirty without having dated once. The thought made him cringe.\n\n\"Goodnight, Damian.\"\n\n***\n\nThe dining hall bustled with quiet conversations as servants set platters on the long tables. Pope Damian had arranged a meal for the dignitaries who'd survived last night's chaos.\n\nMercedes escorted Queen Irene and Prince Lord through the arched doorway.\n\n\"I heard the Emperor stripped your knighthood.\" A man's voice, dripping with false courtesy. \"I never imagined we'd meet again like this.\"\n\n2nd Prince Dulandal stepped into their path, blocking the way forward. His eyes fixed on Mercedes with predatory interest.\n\nIrene's voice was cool. \"Your Highness. A pleasure.\"\n\n\"You grow more beautiful each day, Queen Irene.\" The Prince's gaze never left Mercedes. \"Tell me—the strength you honed to defend the imperial family, the skills you gained through our generosity... now you use them to guard *foreigners*?\" His smile was thin and sharp. \"Rather contradictory, wouldn't you say?\"\n\nMercedes said nothing. What could she say? Dulandal's anger was justified, from a certain perspective. The Empire had invested in her training. True, she'd repaid that debt with years of service, but to them? She was the dog they'd raised now guarding a stranger's house.\n\n\"His Majesty showed mercy when he freed you.\" Dulandal's voice hardened. \"If you possessed any loyalty or conscience, you'd have vanished into the mountains. Instead, you immediately wagged your tail for a new master. Where are your principles?\"\n\nThe temperature in the hall seemed to drop. This wasn't just mockery aimed at Mercedes—it was an insult to Queen Irene, to Prince Lord, to the Overgeared Kingdom itself. Chucksley's hand moved toward his sword.\n\nBefore he could speak, a new voice cut through the tension.\n\n\"How generous of you to waste attention on an ingrate who's forgotten the Empire's virtues.\"\n\nA Red Knight strode forward—young, female, her bearing confident. The 9th Knight, if Mercedes remembered the imperial roster correctly. But that couldn't be right. This girl looked barely out of adolescence.\n\nSusan. Mercedes' stomach dropped. *My cousin.*\n\nThe girl was supposed to be talented, yes, but she'd only just come of age last season. How had she—\n\n\"His Majesty has reconsidered his position on the Red Knights.\" Prince Dulandal's smile turned smug, reading Mercedes' shock. \"After so many died, after you abandoned your post, he realized he needed them after all.\"\n\n*But Piaro didn't betray anyone.* Mercedes wanted to scream it. *Astaroth manipulated everything.* The Emperor knew. He'd wept when he learned the truth.\n\nYet here was Dulandal, still ignorant of those facts—which meant the Emperor didn't trust his second son enough to share them.\n\n*No wonder he's bitter.*\n\nDulandal stood below both his elder and younger brothers in their father's estimation. Everyone knew it. The Emperor made no secret of his disappointment.\n\n\"His Majesty plans to rebuild the Red Knights into the finest warriors on the continent.\" Dulandal's chest puffed slightly. \"Grandmaster Zikfrector himself has agreed to personally oversee their training. This new generation will surpass everything you and Piaro accomplished. Superior in loyalty. Superior in strength.\"\n\nMercedes' breath caught. *Zikfrector?*\n\nThe Grandmaster was legend made flesh—a figure from a century past who'd somehow persisted into the present. Master of blade, spell, and summoning art. Even Emperor Juander feared him. The man was an enigma, powerful beyond measure and loyal to nothing but his own inscrutable goals.\n\n*He's training the Red Knights personally?*\n\nA shiver ran down Mercedes' spine. She remembered his eyes during their few encounters—how he'd looked at her like she was a specimen to be dissected and catalogued.\n\nHer gaze found Susan. *Is that how you became a Red Knight so young? Through him?*\n\nSusan smiled—beautiful and cold, a mirror of Mercedes' own features. \"The Grandmaster gave me a special assignment.\"\n\n\"...?\"\n\n\"The moment the truce with your kingdom expires, I'm to recover what you stole from the Astaroth raid.\" Susan's smile widened. \"I look forward to facing the so-called genius.\"\n\nThe Overgeared delegation froze. Mercedes most of all.\n\n*They're declaring war.* Not with armies and trumpets—with a nineteen-year-old girl's smirk in a dining hall. *The instant the truce ends, they'll come for us.*\n\nEveryone had known it was coming. Eventually. But to state it so baldly, in front of Queen Irene and Prince Lord—\n\n*This is a message. They don't fear us at all.*\n\nChucksley moved. The younger knights tensed. Coke's face flushed crimson with barely-restrained fury. How dare they mock the kingdom Grid had built with his own hands?\n\nSusan glanced at Coke, her lip curling. \"Nobody.\"\n\nThe boy went rigid, humiliation and rage warring across his features.\n\n\"Enough.\"\n\nThe voice was low and dangerous. A black-haired man appeared, his eyes sharp as broken glass.\n\nGrid.\n\nHe moved directly to Irene and Lord, kissing each on the cheek—a deliberate, casual gesture of affection—before turning to face Prince Dulandal. He didn't nod. Didn't acknowledge the Prince's rank or title. Simply stared at him as if the man were furniture.\n\nDulandal's jaw tightened. The Red Knights bristled.\n\nGrid bared his teeth in something that wasn't quite a smile. \"I'm looking forward to the face you'll make when the truce expires.\"\n\n\"How dare—\"\n\n\"You address the bloodline that has ruled for centuries with such—\"\n\nThe Red Knights' protests died as Grid turned his back on them entirely. Dulandal said nothing, though his eyes glittered with something between interest and contempt.\n\n*He fought well against the Yatan Servants,* the Prince mused. *As strong as Mercedes, perhaps. Impressive for someone who built a kingdom through individual might alone.*\n\nBut so what?\n\nIndividual strength couldn't match institutional power. The Overgeared Kingdom had a handful of exceptional warriors. The Empire had *thousands*. The Empire dominated the continent through sheer overwhelming superiority. What could one man—even a legendary one—do against that?\n\n*A bird that doesn't know the size of the sky,* Dulandal thought. *His Majesty worries over nothing. This 'Overgeared King' is no threat.*\n\nThey'd crush him when the time came.\n\nThen Grid said something insane.\n\n\"Your new Red Knights?\" He pointed at Coke—the boy Susan had just called a nobody. \"This kid will shatter them. All of them. By himself.\"\n\nSilence.\n\nPrince Dulandal blinked. The Red Knights stared. Susan's mouth fell open.\n\n\"...What?\"\n\nEven the NPCs could sense power levels instinctively. Coke was obviously the weakest person in this room—weaker even than Prince Lord, who was a *child*. During the Yatan Church attack, Coke had been practically useless.\n\nAnd Grid thought this boy would defeat the Red Knights? *All* of them?\n\n*Is he delusional?*\n\n\"Mark my words.\" Grid's voice was utterly confident. \"When the Empire points its sword at us, you'll see I was right.\"\n\nThe power of items. That was the secret. Grid had been a weakling once. Items had transformed him. The Legendary Blacksmith's Craftsmanship Skill—soon to be enhanced by the goddess' blessing—would do the same for his people.\n\nHe leaned close to Coke, voice dropping to a whisper. \"Don't be scared. We have time. I'm going to show you what being Overgeared *really* means.\"\n\nThe Saharan Empire was massive. Any one of its cities matched the entire Overgeared Kingdom in size. Controlling such an empire required more than just the imperial family's strength—it required systems, institutions, layers of power.\n\nGrid understood that weakness. He'd been preparing.\n\nThe Emperor might honor the truce. But the nobles, the generals, the ambitious princes—they'd find excuses to act sooner. Grid needed warriors ready when that day came.\n\n*After I finish this quest, I'll forge an army that lives up to the name.*\n\nAcross from him, Prince Dulandal matched his stare, unimpressed.\n\n*That King aims too high. His Majesty is wrong to worry.*\n\nBetween them, Coke squirmed like he was sitting on hot coals."
}