{
  "id": 88,
  "title": "Chapter 88",
  "content": "# Chapter 88\n\nVantner lurched forward like a wounded boar, his boots scraping against stone. \"Hey, Pon! Don't use me as a shield! This jerk's hiding behind me trying to suck up all the honey!\"\n\nPon, ranked among the best spearmen in Satisfy, clicked his tongue. His spear rested across his shoulders as he regarded the bald tank with barely concealed disdain.\n\n\"You're a guardian knight, Vantner. Using you as a shield is basic strategy.\" Pon's voice was flat, clinical. \"The tanker attracts aggro. The damage dealer eats the honey. It's common sense. Try thinking before you get angry next time. Or is your brain too small for that?\"\n\nStanding side by side, they looked like father and son. Vantner, bald and bearded, appeared to be pushing fifty. Pon had a sleek physique and handsome features that placed him in his late twenties. Both men were thirty-five.\n\nThe age gap was cosmetic. The animosity was real.\n\nVantner had hated Pon from the moment he learned they were the same age. His resentment festered every time he caught his reflection next to the spearman's chiseled jawline. Pon, for his part, dismissed Vantner as a simpleton who'd built his character wrong and lacked the wit to fix it.\n\nJishuka once called them \"two children who found value in disliking each other.\"\n\n\"My class might be guardian knight, but most of my stat points went into strength!\" Vantner's face flushed red. \"I've told you this a hundred times, chicken head! Do I need to tattoo it on your forehead? I'm a guardian knight with low defense! So stop sticking to me! Toban's our guild tanker, not me!\"\n\nPon snorted. \"Stupid. You chose a defense class and didn't invest in the appropriate stats. Can't tank, can't hit. Tell me, where exactly are you useful?\"\n\n\"W-What?\" Vantner's hand moved to his axe. \"You bastard! Want to experience the power of an all-strength guardian knight in PVP? I challenge you to a duel. One-on-one. Right now!\"\n\n\"Fine. I'll show you how incompetent your build really is.\" Pon examined his fingernails. \"But I'll have to pass for the moment.\"\n\n*Coward.* \n\nVantner had reason for his confidence. Against other users, his build excelled. The passive skill 'Reduce Damage Received' combined with basic defense abilities meant he could weather attacks other damage dealers couldn't. His strength investment gave him offense most tanks lacked. In player-versus-player combat, he had an edge.\n\nWeaknesses existed, of course. Enemies with overwhelming attack power could bypass his moderate defenses. Opponents with extreme defense could shrug off his mediocre damage. But at the current level cap, few players posed that type of threat.\n\nGuardian knights also possessed a one-time invincibility skill. Timed correctly, it could nullify an opponent's strongest attack and turn the tide of battle. The class thrived in PVP.\n\nVantner puffed out his chest. \"Heh. You're scared.\"\n\n\"Not at all.\" Pon gestured at the temple around them. \"Have you forgotten we're in the middle of a boss raid? You want a duel right now? How does that work, exactly?\" He tilted his head. \"Besides, my unified ranking is much higher than yours. The result's obvious even without fighting.\"\n\n\"Shut up!\" Spittle flew from Vantner's mouth. \"You're running scared! Don't dodge with that mouth of yours! Let's settle this in real life!\"\n\n\"And what happens if we meet in reality?\" Pon's smile was razor-thin. \"You wouldn't be able to do a single thing to me. Act your age, you bald bastard.\"\n\n\"I'm not bald in reality!\" The veins in Vantner's neck bulged. \"I just set my hairstyle to bald when I created the character. How many times do I have to explain this, chicken head?\"\n\n\"Making yourself bald when you're not? That doesn't make sense. You must really be bald.\"\n\n\"If I was actually bald, why would I choose bald in-game?! I would've given myself thick hair!\"\n\nPon examined his spear tip. \"If you're hiding baldness, you might deliberately set your character bald to throw people off.\"\n\n\"This $#!~$#!!\"\n\nThe 1st ranked guardian knight and the 1st ranked spear knight. Vanguards of the Tzedakah Guild. They stood at each other's throats while the boss monster watched.\n\nMalacus had endured enough. His skeletal fingers curled into claws.\n\n\"Why are you fighting amongst yourselves?\" Black energy gathered at his fingertips. \"Disagreeable wretches. You keep gathering before me!\"\n\n*Roaaaar!*\n\nEight rays of black magic lanced toward Vantner and Pon. Both warriors jumped aside. The magic rays curved mid-flight, every beam tracking Pon's trajectory.\n\n\"What?\" Vantner landed hard. \"Why aren't they chasing me? You dare ignore me?!\"\n\nPon twisted in midair. \"First time I've seen guided magic. One of the Eight Servants lives up to his reputation!\"\n\n*Can't dodge this.*\n\nHe channeled power into his spear. Flames erupted along the shaft. The temperature in the temple spiked.\n\n\"Mach Spear!\"\n\n*Peeeeeong! Pepepepeng!*\n\nThe sonic weapon tore through the air. Each rotation generated a new explosion. The shockwave rippled outward, forcing even Vantner to brace himself against the pressure.\n\n*Kwajajajajak!*\n\nPure kinetic force met pure magical energy. Pon's crimson lance pierced through all eight rays, scattering them like smoke.\n\n*Kwaaaaang!*\n\nThe red flash collided with Malacus's black shield. Rare agitation crossed Pon's face.\n\n\"It didn't pierce through?\"\n\nHis strongest offensive skill had been nullified. Just... stopped.\n\n*This is serious.*\n\nPon ranked 23rd on the unified leaderboard. The 23rd strongest player among two billion users. One of Tzedakah Guild's top three. He'd killed hundreds of boss monsters. Mach Spear had never failed to deliver.\n\nUntil now.\n\nThe shield's defensive capabilities were clearly exceptional. But Pon's thoughts went elsewhere.\n\n*I haven't been able to replace my weapon despite gaining fifty levels. This is my current limit. I need something better.*\n\nLevel 243, wielding a level 190 spear. The situation was absurd, but unavoidable. He'd visited every famous blacksmith on the continent. None could craft anything superior to what he already carried.\n\nThe reason was simple: his current weapon had a Unique rating. Despite its level 190 requirement, the rating and special options made it outperform level 240 Rare and Epic alternatives. Finding a replacement meant locating a Unique-rated spear with a higher level requirement.\n\nHe'd brought materials to the best smiths. Almost always, they produced Normal or Rare results. Occasionally Epic. Never satisfactory.\n\n*I need an outstanding blacksmith. Urgently.*\n\nThe unknown craftsman who'd created the Special Jaffa Arrows, turning the archery meta upside down. Pon and Jishuka both craved an introduction.\n\n*If he made me a spear, I could punch through Malacus's shield.*\n\nMeanwhile, Malacus was suffering. He'd blocked the attack with his black shield, but the impact had rattled his bones. The spear's mass had transmitted force straight through his defensive magic. He'd deployed a triple-layered barrier and barely held.\n\n\"To be shamed like this by a mere traveler!\"\n\nVantner caught the slight tremor in Malacus's stance.\n\n\"He's stiffened!\"\n\nVantner gripped his axe with both hands, muscles coiling. Then he hurled it with everything he had.\n\n*Swaeeel!*\n\nThrowing weapons was one of the few offensive options available to guardian knights. Compared to Pon's spear, it looked like a child's toy.\n\n*Kang!*\n\nMalacus barely glanced at the spinning axe. His shield deflected it with contemptuous ease.\n\nVantner watched his weapon sail into the darkness. He grabbed his head with both hands.\n\n\"Aaaagh! This is insane!\"\n\nThe powerlessness burned. Guardian knight. A class designed to protect the user and allies through defensive skills. Mastering advanced protection techniques required high stamina investment.\n\nBut Vantner had dumped points into strength for faster leveling. The result: he couldn't properly fulfill his role as a guardian knight. Couldn't make an impact against Malacus like Pon just had.\n\nAnd Pon looked *cool* out there, facing down a Yatan Servant one-on-one.\n\n*Damn it.*\n\nVantner ranked 66th on the unified ladder, well below Pon's 23rd. He knew the gap existed. But watching it play out in real time was a knife to the gut.\n\n\"There should be an item to respec stats!\"\n\n\"Satisfy doesn't have a cash shop.\" Pon's advice was genuine for once. \"An item like that will never be released.\"\n\nVantner pounded the ground. Pon crouched beside him.\n\n\"Starting from your next level, invest everything in stamina. If you keep pumping strength, your character becomes worthless.\" He spoke quietly. \"Right now, strength-build guardian knights are trending in PVP. But you just saw the limitation, didn't you? The stronger the opponent, the more useless a strength build becomes.\"\n\n\"Ugh!\" \n\n*I'm an idiot.* Vantner had distributed points to strength purely to climb the rankings faster. The short-term gain had gutted his long-term potential.\n\nPon's mind, meanwhile, remained fixed on weapons. His desire for a stronger spear consumed him. Neither man could focus on the present situation.\n\nNeither noticed Regas crumpled in the corner.\n\n\"Chatting amongst yourselves again?\" Malacus's voice cut through their distraction. \"You have no sense of tension. Very well. Let me clarify your situation.\"\n\nHe grabbed Regas by his bloody hair, lifting the martial artist's head like a trophy.\n\nPon blinked. \"What? Regas? Why are you in that state? Out of potions?\" A pause. \"Why haven't you run away yet?\"\n\nRegas, now serving as a hostage, laughed sheepishly. \"Haha. I wanted to observe Malacus's combat patterns up close. Thought it would help my training.\"\n\n\"Just die.\"\n\n*Too many idiots in this guild.* Pon had felt this way since the L.T.S. days. He and Vantner turned away from Regas in unison.\n\nMalacus shouted toward Jishuka, who stood at the far end of the chamber with folded arms. \"Girl! All of you will soon look like this wretch.\"\n\nMagic gathered at his fingertips, condensing into a point of absolute darkness. He would crush Regas's skull like a watermelon.\n\nFor a ranker, death meant catastrophe. A week's worth of hunting experience, gone. Under normal circumstances, the Tzedakah Guild would never abandon a companion. They'd risk themselves to prevent the loss.\n\nThis was different.\n\nRegas could have lived. He was going to die because of his own stupidity. He'd planted the seeds and now the harvest arrived. Not worth risking anyone else.\n\n\"Die cleanly and fix your mentality.\" Pon didn't even look.\n\nNo one in the Tzedakah Guild moved to intervene.\n\nThen a voice rang out.\n\n\"Pagma's Swordsmanship, Restraint!\"\n\nEvery head turned. Malacus froze. Jishuka's eyes widened.\n\nKhan's disciple. The creator of the Special Jaffa Arrows. An ordinary blacksmith, maybe. The Asian youth whose identity remained uncertain. He danced with a shining dagger, each movement precise and deliberate.\n\nGrid's expression was stone. Determination etched into every line of his face. The sword dance was rare, highly skilled. It looked like...\n\n\"Isn't this crazy?\"\n\nThe Tzedakah Guild members stared.\n\n\"What is this? Why is he suddenly dancing in this situation?\"\n\nGrid's behavior defied common sense. Toban squinted at the spectacle, and memory clicked.\n\n\"I remember that guy now.\"\n\nMonths ago, recruiting for the Guardian of the Forest raid in Bairan. A warrior who looked level 80 trying to join by pretending he was level 100. Claimed he never wore armor because he was a \"master of control.\" That loser was Grid?\n\n*This is completely...*\n\nToban sighed and turned to Jishuka. \"Master. As expected, this seems to be another false lead. Grid's a warrior, not a blacksmith. He's just a braggart... Ack?\"\n\nToban's voice died.\n\nThe dancing figure had seemed insane at first. But only for a moment. As the sword dance continued, Toban's heart began to race. Pressure emanated from Grid in waves, thick and suffocating. An invisible weight pressed down on the entire chamber.\n\n*What is this?*\n\nToban no longer spoke casually. The pressure overwhelmed him. He stumbled backward.\n\nJishuka felt it. The guild members felt it.\n\nEven Malacus felt it.\n\n*Even Malacus.*"
}