{
  "id": 883,
  "title": "Chapter 883",
  "content": "# The Sin of Envy\n\n**The God Who Abandoned His Children**\n\nWhen the goddess of life first commanded it, Hexetia descended to the mortal world with a sacred purpose—to teach humanity the secrets of fire and iron. In those primitive days, he walked among savage tribes and showed them how to forge tools, how to cook their meat, how to shape metal into something greater than themselves. Without his divine intervention, mankind would have remained nothing more than beasts scratching in the dirt.\n\nFor a time, pride filled Hexetia's divine heart. This was his purpose. This was why the gods existed—to guide the lesser beings toward enlightenment. He found satisfaction in watching humanity's first stumbling steps toward civilization.\n\nThat satisfaction proved tragically short-lived.\n\nAs the centuries passed, Hexetia witnessed humanity's true nature emerge. They threw infants into molten iron as sacrifices. They bathed their weapons in the blood of virgins. Rather than developing their own abilities, they became parasites—constantly crying out to the heavens for salvation, demanding the gods solve every trivial problem.\n\n\"Worse than the great demons,\" Hexetia muttered, his divine hands clenched in disgust.\n\nHatred replaced his former pride. He turned his back on humanity completely, ignoring their desperate prayers even as Yatan's forces ravaged the world. When the evil god's armies slaughtered millions, Hexetia felt nothing but cold satisfaction. And when Goddess Rebecca declared her intention to resurrect mankind after their near-extinction, he was the only god who dared rebel against her decree.\n\nThen came Pagma.\n\nA human blacksmith who needed no divine guidance. A mortal who developed legendary techniques through his own ingenuity. His very existence was an insult—proof that humanity could transcend without the gods' help. Here was a creature whose potential rivaled divinity itself.\n\nEnvy consumed Hexetia like poison. He placed obstacle after obstacle in Pagma's path, determined to prove the blacksmith's mortality. Trials that would have broken lesser men. Hardships that should have ended his advancement.\n\nYet Pagma overcame everything. Each challenge only made him stronger, more innovative. He transcended the limitations of the mortal mind entirely. The weapons he forged achieved mythical status—works that scholars began comparing favorably to Hexetia's own divine creations.\n\nMaddened by jealousy, the blacksmithing god made an unthinkable choice. He sought an audience with Yatan himself.\n\n*—Pathetic, isn't it?* The mysterious voice echoed through Grid's consciousness as the golden light around him intensified. *A god so terrified of being surpassed by a human that he begged for the world's destruction. They claim to be almighty, benevolent—but at their core, they're as petty and selfish as any mortal. Their talents have limits. Their pride has no bounds.*\n\nThe voice's rage crashed over Grid like a physical force. His chest tightened. His vision swam as the scene shifted, clouds parting to reveal the divine realm floating above.\n\n*—They have no right to 'manage' humanity! They treat mortals like dogs to be bred and broken!*\n\n\"Gah!\" Grid gasped, the fury bleeding through the vision stealing his breath. His pupils trembled. The golden world spun violently, and his skull felt ready to split open.\n\nThe clouds vanished. Suddenly Grid stood in a realm of seething crimson and black—a landscape dominated by rivers of lava and lakes of poison. Through the obsidian windows of a dark fortress, he watched a volcano erupt with apocalyptic fury.\n\nHell. He was witnessing Hell itself.\n\n**The Demon's Bargain**\n\nTwo figures faced each other in the chamber, utterly unmoved by the chaos outside. Grid's attention locked onto them.\n\nThe man with cascading red hair could only be Hexetia—the divine blacksmith himself, rendered in his most terrible aspect. Across from him stood a pale figure radiating an aura of absolute cold. Baal. The 1st Great Demon, his expression one of intrigued amusement.\n\n\"You'll forge weapons for the great demons?\" Baal's voice carried the weight of millennia.\n\nGrid's mind reeled. *Impossible. The blacksmithing god can't be—*\n\nBut Hexetia nodded without hesitation. \"I will grant you power beyond measure. All I ask in return is the complete annihilation of humanity.\"\n\n*This lunatic!* Grid's consciousness screamed, though no sound emerged.\n\nHatred for humanity was contemptible enough, but this—forming a pact with Hell itself out of petty jealousy toward a single mortal? Unforgivable.\n\nBaal tilted his head, considering. \"God Yatan's role is the destruction of the material world itself...\"\n\n\"No!\" Hexetia's composure cracked. \"Leave the Earth intact. Just erase the humans from its surface!\"\n\n\"Hmm.\"\n\n\"Baal, please—\"\n\n\"Very well.\" The demon's smile widened. \"However...\"\n\n\"What?\"\n\n\"One-sided slaughter bores me. I'll need to balance the scales properly.\"\n\nHexetia's divine features twisted with confusion. \"Balance? This is entertainment to you?\"\n\n\"Of course it's entertainment. A spectacular contest—the incompetent god versus the human who inspired such pathetic envy. Yes, this will prove quite amusing.\"\n\n\"You bastard—\"\n\n\"Why so angry? Unless you fear your divine position might be threatened again?\" Baal's eyes gleamed. \"Like that other time?\"\n\nHexetia's face went pale. \"I...\"\n\n*That other time? What does he mean?* Grid struggled to understand.\n\n*—The war between the gods and the Seven Half-Gods,* the mysterious voice supplied. *When seven humans achieved quasi-divinity and threatened the established order.*\n\nUnderstanding crashed through Grid's thoughts. *The Seven Malignant Saints existed before Pagma's era?*\n\n*—Precisely. I'm showing you Pagma's age so you'll understand the pattern. This was Hexetia's second bout of jealousy. First, he envied the Seven Malignant Saints who challenged the gods' supremacy. Then he repeated his sin with Pagma. The fool never learned!*\n\nIce water flooded Grid's veins. Hexetia was jealous of him too. Right now. In the present.\n\n*That bastard... is he already plotting against me?*\n\nBefore Grid could process the implications, the vision shifted again.\n\n**The Last Stand**\n\nNow he stood in the Hall of Fame, recognizing it instantly despite the transformed landscape. The ground itself bled crimson and black as great demons emerged from rifts in reality, an army of Hell ascending to the mortal plane.\n\nOne man stood against them all.\n\nPagma's grip on his sword trembled slightly, but his black eyes shone with absolute determination beneath his unkempt hair. A scythe hung at his side—a weapon Grid had seen before. The legendary blacksmith's posture radiated exhaustion and sorrow.\n\n\"In the end, I face this alone.\" His voice barely rose above a whisper.\n\nThen his body moved, flowing into the opening stance of a sword dance.\n\n\"Drop.\"\n\nThe heavens themselves obeyed his command. An impossible weight descended on the battlefield—the very sky falling toward the earth. The great demons staggered beneath pressure that seemed to crush reality itself. As the sky fell, Pagma's blade carved through the ground in sweeping arcs, each strike causing the terrain to collapse and reform.\n\nTears streaked down the legendary blacksmith's face even as he fought with transcendent skill.\n\n\"If I'd known that my understanding of good and evil was so twisted, I never would have betrayed Braham.\"\n\n*—Hexetia's envy caused immeasurable suffering. Countless humans died. All of humanity teetered on the brink of extinction. His sins weigh heavy on the scales of judgment.* The mysterious voice carried an edge like a blade. *Can you forgive him?*\n\n\"I...\" Grid tried to respond, but—\n\n**Reality**\n\n\"Gah!\" Grid lurched forward, the visions releasing him all at once.\n\n\"Grid!\" Damian dropped his dried bread, rushing to catch the blacksmith before he collapsed entirely. Strong hands gripped Grid's shoulders, holding him upright. \"What happened? Did you overextend your stamina?\"\n\nImpossible. Grid was a powerhouse who'd survived countless battles. Managing his physical resources was second nature by now. Something else had caused this.\n\nDamian's expression tightened with concern. \"You're pushing yourself too hard. Please, take a break.\"\n\nFor days now, Grid had spent every available hour in this smithy, consuming nothing but jerky and stale bread, never stepping outside. Even someone with his constitution had limits.\n\n\"No...\" Grid shoved himself free from Damian's support, forcing his legs to steady beneath him. His face remained ashen, his breathing ragged. \"I'm fine.\"\n\n\"Your health matters more than any quest!\" Damian insisted.\n\nGrid didn't answer. He couldn't—not with the notification windows flooding his vision.\n\n---\n\n> [The original sin of envy has been revealed!]\n>\n> [Unless the blacksmithing god Hexetia abandons his jealous nature, the Stone of Original Sin corrupting the holy sword cannot be removed.]\n>\n> [Two paths lie before you:]\n>\n> [Option 1: Reveal this truth to the Rebecca Church. The quest 'Cleanse the First Holy Sword' will end immediately. You will not receive the goddess' blessing. Affinity with Goddess Rebecca will plummet into negative values.]\n>\n> [Option 2: Hide the truth. The quest 'Cleanse the First Holy Sword' will continue indefinitely. Upon completion, you will receive the goddess' blessing.]\n>\n> [You have uncovered the hidden story of legendary blacksmith Pagma!]\n>\n> [Sharing this knowledge with Great Magician Braham will likely trigger a positive outcome.]\n>\n> [New skill acquired: Pagma's Swordsmanship, Drop]\n\n---\n\n**[Drop]**\n\n*A sword dance expressing resentment toward the heavens themselves.*\n\n*The authority of the fallen sky, made manifest through tranquil, profound movements.*\n\n**Effect:** Inflicts 30% of your physical attack power to all enemies within five meters. 30% chance to bypass enemy status resistance. Deals an additional 300% damage to divine beings. Hit targets cannot attack and suffer decreased defense.\n\n**Requirements:** Sword-type weapon equipped.\n\n**Cost:** 850 Mana\n\n**Cooldown:** 6 minutes\n\n---\n\n*Braham...*\n\nGrid barely registered the philosophical implications about the gods' true nature. The quest's branching complexity meant nothing. Even the new sword dance—powerful as it clearly was—felt distant and unimportant.\n\nOnly one thought consumed him: Braham.\n\n*Pagma regretted it. He felt guilty about betraying you.*\n\nBraham had been stabbed in the back by his only friend, cast aside simply for being born a demonkin. The grudge and sorrow carved into his soul across centuries—wouldn't this knowledge ease that burden, even slightly?\n\n*I'm so glad. Thank god...* Grid's relief felt overwhelming.\n\nHe needed to reunite with Braham immediately and deliver this truth. Yes—Grid had no idea that Braham's soul had already scattered after departing from him.\n\n*Come back soon, Braham.*\n\nThe great magician had left to recover his physical body. They were separated now, but only temporarily. They existed in the same era. Reunion was inevitable.\n\n*Old man... I miss you.*\n\nTheir first meeting had been a disaster, but Braham had become Grid's mentor nonetheless. His absence created a void that Grid felt more acutely with each passing day.\n\nMeanwhile...\n\n**The Sword Grave**\n\n\"Here. This is the place.\"\n\nSkunk—the 1st ranked explorer who'd famously discovered the Yatan Church's main temple—stood before an ancient burial ground, his eyes gleaming with anticipation. After months of research, he'd finally located the Sword Grave, where legend claimed Braham's body lay entombed.\n\n\"Now!\" He raised his fist toward the sky. \"Let's claim those treasures!\"\n\n\"Yeah!\" His companions roared their agreement.\n\nThe expedition began its descent into darkness."
}