{
  "id": 885,
  "title": "Chapter 885",
  "content": "# Chapter 884: An Offering to the God\n\n**Translator's Note:** *The final sections of chapters 881-883 were inadvertently truncated during upload. Please revisit those chapters to ensure you haven't missed any content.*\n\n---\n\nSomething felt wrong.\n\nGrid sat alone at a silver table in the heart of a sky garden carved into the mountainside, the entire Vatican sprawling below him. Wind teased through his hair as he raised a porcelain cup to his lips. For a moment, the sight was striking—heroic, even. Several onlookers flushed with admiration.\n\nThen he ruined it.\n\n*Ptui! Ptuh! Ptuh!*\n\nGrid spat the black tea across the flagstones, grimacing.\n\n\"...\"\n\nThe bitter liquid burned his tongue. He shoved the cup away and reached for water instead, trying to wash away the taste.\n\n*Right. Forgot the honey.*\n\nHe'd been so lost in thought that he'd poured the tea without sweetening it first. Now his mouth tasted like tree bark.\n\nBut the tea wasn't what bothered him.\n\n*This doesn't make sense.*\n\nGrid stared at the mountains beyond the garden, fingers drumming against the table.\n\n*Why are they dangling this in front of me?*\n\nThe reward structure was obvious. Complete the **Crossroad of Good and Evil** quest. Finish **Cleanse the First Holy Sword**. In return, **God's Command** would evolve—the cooldown-resetting passive would trigger with 100% reliability instead of its current chance-based activation.\n\nEven an idiot could see how broken that would be.\n\n*And that's exactly what makes me nervous.*\n\nS.A. Group had spent years keeping him in check. Lim Cheolho himself had explained their design philosophy: balance above all else. **Legendary class** users weren't meant to dominate forever. Normal class players who advanced steadily would eventually catch up.\n\nSo why offer him this?\n\n*If I could chain fusion skills back-to-back...*\n\nHe pictured it. **Linked Kill Wave Pinnacle** fired twice in rapid succession. Three times. Four. An endless barrage of devastation with no recovery window for his opponents.\n\nKraugel wouldn't stand a chance. Neither would Agnus, or the empire's dukes, or War God Ares with his entire army behind him. Even the **True Blood vampires** would crumble.\n\n*No one could survive that.*\n\nWhich meant one thing: this was bait.\n\n*They want me to think I'm becoming invincible. Then they'll pull the rug out.*\n\nGrid had been burned too many times to fall for it. There had to be a catch—some crippling penalty buried in the fine print. Maybe using **God's Command** repeatedly would drain his stamina to zero, leaving him paralyzed. Maybe it would lock out his skills entirely for hours afterward.\n\nWhatever the cost, it would be brutal.\n\n*S.A. Group doesn't hand out free power. They charge interest.*\n\nHe pushed the thought away, severing his attachment to the enhanced version of the skill.\n\n*Besides, the Goddess' blessing matters more.*\n\nIndividual strength had limits. He'd learned that lesson over and over. What he needed was better crafting capability—the kind of edge that came from divine favor, not combat tricks.\n\n*So I need to cleanse the sword.*\n\nWhich brought him back to the core problem: how to remove the blacksmith god's curse. How to deal with Hexetia's jealousy.\n\nHe was still mulling it over when voices approached.\n\n\"Overgeared King. There you are.\"\n\nGrid looked up. A cluster of elderly figures in pristine white robes moved toward him across the garden—the **elders** of the **Rebecca Church**, the ones who served only the Goddess herself. Even the pope walked carefully around them. Even the emperor.\n\nAnd now they were seeking him out.\n\n\"Elders.\" Grid rose slightly, inclining his head with practiced courtesy. \"Here to enjoy the view?\"\n\nThe eldest among them chuckled, waving off the formality. \"At our age? We've seen every view worth seeing. We were simply wandering.\"\n\nAnother smiled warmly. \"Not as industrious as Your Majesty, who guards us as though we were family.\"\n\n\"...\"\n\nGrid blinked. Their **affinity** toward him was... unusually high. Sure, he'd done the Church plenty of favors, but this felt excessive. He'd seen these same elders lecture Damian like a disappointing grandson. He'd watched them dismiss an imperial prince with cold indifference.\n\n*So why the warm reception?*\n\nHis instincts prickled.\n\n*Do they want something?*\n\nMaybe they were about to saddle him with another impossible quest. He kept his expression neutral, waiting.\n\nOne of the elders clasped his hands together, eyes bright. \"Your Majesty, you truly are exceptional.\"\n\n\"...Exceptional?\"\n\n\"Yes. Touched by divinity. A mortal who walks among gods.\"\n\nGrid's wariness deepened as he studied their faces. That look in their eyes—it was the same fervent adoration he'd seen in Isabel's gaze after he'd saved her.\n\n*Oh no.*\n\n\"You arrive when we need you most,\" the elder continued, voice trembling with emotion. \"You strike down evil at the perfect moment, like a hero from the old scriptures.\"\n\n\"Precisely,\" another agreed, nodding vigorously. \"A hero among heroes.\"\n\n\"Haha...\" Grid rubbed the back of his neck, uncomfortable with the praise but unable to deny it.\n\nWas it exaggerated? Not really. He *had* destroyed the corrupt Pope Drevigo. He *had* saved Isabel. He *had* foiled Pascal's schemes and defended the Vatican during the recent assault. The timing had been almost supernatural.\n\nSo yeah. He probably deserved the credit.\n\nStill, their **maximum affinity** gave him an idea.\n\n\"Do you know much about the blacksmith god?\" he asked carefully. \"Hexetia?\"\n\n\"Of course!\" One of the elders brightened immediately. \"He is one of the six gods who serve the Goddess of Light. Hexetia taught humanity to harness fire and forge iron. Without him, we would still be savages scratching in the dirt.\"\n\n\"Right.\" Grid nodded, listening.\n\nHe couldn't reveal what he knew about Hexetia's resentment—not to these people. But their perspective might give him the context he needed.\n\n\"However,\" the elder continued, smile widening, \"Hexetia's gifts came at the Goddess' command. The true credit belongs to her.\"\n\n\"Exactly!\" Another elder leaned forward eagerly. \"Hexetia was merely the messenger. The vision, the generosity—that was all Goddess Rebecca.\"\n\nThe others murmured agreement, their voices rising in enthusiasm.\n\nGrid said nothing, but pieces began clicking into place.\n\n*Low self-esteem.*\n\nThat was Hexetia's problem. He'd uplifted humanity, forged the tools of civilization—and received none of the recognition. There were no temples to the blacksmith god. No statues. No hymns sung in his honor. Everything got attributed to Rebecca.\n\n*I'd be bitter too.*\n\nFor all his contributions, Hexetia remained a footnote. And he couldn't complain about it—not when the goddess herself stood above him in the hierarchy. So the frustration had festered. Twisted. Until a human blacksmith emerged who threatened to surpass him entirely, and all that buried resentment found a target.\n\n*He's angry at the wrong people.*\n\nBut Grid understood it. He'd spent years crushed beneath the weight of his own inadequacy, hyperaware of everyone else's success, drowning in envy. **Low self-esteem** turned you into a smaller, meaner version of yourself.\n\nHexetia hadn't just become bitter. He'd become *warped*.\n\nStill, understanding didn't mean forgiveness.\n\n*But maybe it means there's a solution.*\n\nGrid tapped his fingers against the table, half-listening as the elders continued their enthusiastic lecture on Rebecca's magnificence. His mind worked through the problem from a new angle.\n\n*What if I acknowledge him?*\n\nNot as a rival. Not as a threat. As someone whose work *mattered*. If Grid expressed genuine gratitude—if he made Hexetia feel *seen*—would that be enough? Could recognition ease the god's jealousy and break the curse on the **holy sword**?\n\n*Worth trying.*\n\nBetter than fighting a god head-on. And the approach had its own logic. Grid was a blacksmith. Honoring Hexetia fit his identity.\n\n*I just need to give him what he's been missing.*\n\nValidation. Respect. A place in the world where people remembered his name.\n\nDecision made, Grid straightened.\n\n\"I want to build a temple,\" he announced. \"For Hexetia.\"\n\nThe elders froze mid-conversation.\n\n\"...A temple?\" one repeated slowly. \"For Hexetia?\"\n\n\"Why would you—?\" Another frowned, confused. \"Serving Goddess Rebecca honors all the gods beneath her. You don't need separate temples.\"\n\n\"That's right.\" A third nodded firmly. \"Hexetia wouldn't even want it. He'd find it embarrassing.\"\n\nGrid's jaw tightened. \"Then what about the **Dominion Church**? Or the **Judar Church**?\"\n\n\"That's different. Dominion and Judar have substantial achievements. Hexetia is... well, smaller in scope.\"\n\n\"And **War God Zeratul**?\" Grid pressed. \"I've heard there are followers of Zeratul.\"\n\n\"Ah...\" The elder hesitated. \"Zeratul is still a god, even if his deeds are modest. It's natural for some to honor him. Though I suppose...\" His expression shifted, understanding dawning. \"You're a blacksmith. You wish to honor the god of your craft.\"\n\n\"Exactly.\"\n\nThe elders exchanged glances. Grid watched them calculate, weighing doctrine against pragmatism.\n\n*Everyone's selfish in the end.*\n\n\"Well,\" one finally said, spreading his hands. \"If the legendary blacksmith wishes to serve Hexetia... I see no harm.\"\n\n\"Indeed.\" Another nodded. \"Your service to Hexetia is, by extension, service to Goddess Rebecca—his superior. She would be pleased.\"\n\n\"Yes, Your Majesty.\" The eldest gave his blessing with a benevolent smile. \"We shall permit construction of a temple to Hexetia. However\"—he raised a finger—\"you must erect a statue of Goddess Rebecca beside him. And hers must be larger.\"\n\n\"So all who visit understand,\" another added. \"Hexetia exists because of her grace.\"\n\n\"...Understood.\"\n\nSo he needed Church approval to build temples for gods other than Rebecca. Grid filed that information away, suppressing his irritation.\n\n*They really are obsessed.*\n\nThe way the elders spoke about the Goddess bordered on fanatical. It made his skin crawl.\n\nAnd yet they were starting to direct that same fervor toward *him*.\n\nIsabel practically worshiped him now. The elders looked at him like he was one step removed from divinity himself.\n\n*Have I really helped them that much?*\n\nThe thought was both gratifying and unsettling. Divine favor was useful. Divine *wrath*, on the other hand...\n\n*Not the time to worry about that.*\n\nGrid pushed back from the table and stood.\n\nHe would build Hexetia's temple. Give the forgotten god the recognition he craved. And if that broke the curse on the **First Holy Sword**—if it earned the Goddess' blessing Grid needed for his crafting—then it would be worth the effort.\n\nNow he just had to see if it would actually work."
}