{
  "id": 89,
  "title": "Chapter 89",
  "content": "# Chapter 89\n\n\"What... what *is* this?!\"\n\nMalacus froze, his hand still raised above Regas's skull. The crushing blow never came. Instead, the priest stumbled back half a step, breath catching in his throat.\n\n*It wasn't a fluke.*\n\nBefore the Tzedakah Guild arrived, Malacus had faced Grid alone. That confrontation had ended without bloodshed. Not because Grid was strong. The opposite, really. Grid was *weak*. Malacus could have snuffed out his life in seconds, crushed him like the insect he was. And yet... something had made the priest hesitate. Something radiating from that pathetic man had forced Malacus to retreat.\n\n*I thought it was my imagination.*\n\nBut here it was again. That same suffocating pressure bearing down on him. How could some nobody, some newbie barely worth noticing, exert such a presence?\n\n*I fear only God Yatan!*\n\nMalacus released Regas. His fingers twitched as he backed away, eyes locked on Grid's approaching figure.\n\n*Damn it!*\n\nMaximum distance. That was what Malacus needed. He retreated as Grid knelt beside the fallen Regas.\n\n\"Regas, you alright?\"\n\n\"Grid...\"\n\nRegas stared up at him. His eyes gleamed with something close to reverence. A single sword dance. That was all it had taken to dominate Malacus, the priest who had just been strangling the second-ranked fighter in their entire guild. Grid alone had overwhelmed seventeen of the top hundred users on the continent. His presence dwarfed any ranker Regas had ever met.\n\n*He's not even famous yet, but this dignity...*\n\nRegas's mind drifted back to their first encounter. Grid hadn't worn armor then. Just hunted monsters with a sword, nothing else. Everyone else had called him a braggart, laughed behind his back. But Regas had believed. Grid was reliable.\n\n\"The more I see of you, the more amazing you become.\"\n\nRegas held rank thirty in the unified rankings. Yet here he was, envying Grid. The words sent a thrill through Grid's chest.\n\n*Until recently, I was nobody. Now a ranker is looking at me like this.*\n\nRankers used to be distant figures on Grid's TV screen. Celebrities he'd never touch. But since becoming Pagma's Descendant, everything had changed.\n\n*My mouth is tingling!*\n\nGrid wanted to bask in Regas's praise. Roll around in it. Unfortunately, Restraint lasted only three seconds. No time to relax.\n\n*The situation's too dire.*\n\nGrid's brain churned through profit and loss calculations as he hauled Regas to his feet and ran.\n\n*Using the sword dance paid off. Definitely. Given Regas's personality, he'll want to repay this debt later.*\n\nThree seconds was nothing. As Restraint expired, Malacus's body unlocked. In the next instant, he materialized directly in front of Grid. Not a dash skill. This was high-level magic, the kind that folded space itself.\n\n\"Huh?\"\n\nGrid stumbled to a halt, face-to-face with the priest.\n\n\"G-Ghost?!\"\n\nMalacus ground his teeth together. \"The pressure is gone. Vanished like it was never there. Was I wrong? No. Impossible! You *tricked* me, disgraceful wretch. Show me your true power, or you'll never leave this place alive.\"\n\nThe voice scraped out of him like two people speaking at once. Malacus's tone dripped with menace.\n\n\"Hiik!\"\n\nGrid's face went pale. He dropped his head, mouth opening to beg.\n\nA sphere of flame streaked past his ear.\n\n**Peeng!**\n\n\"Use this chance to escape!\"\n\nThe explosion engulfed Malacus. Grid whipped his head around and spotted a familiar figure.\n\n\"Laella?\"\n\nLaella. Eighteen years old. British. Global pop star *and* top ranker in Satisfy. What was she doing here?\n\n\"W-Wait, don't tell me...\" Grid, her self-proclaimed biggest fan, looked at Regas. His eyes widened. \"Regas, is Laella in your guild?\"\n\nGrid's eyes went bloodshot. His nostrils flared. Regas snorted and gestured toward Laella. \"Yeah. She's been with us since L.T.S. You a fan of her music, Grid?\"\n\n\"Wow! Amazing! I really love Laella's breasts... uh, I mean, *songs!* Laella's *songs* are great! Haha!\"\n\nGrid's gaze lingered somewhere inappropriate. For a moment, he forgot his life was in danger.\n\nJishuka's sharp voice cut through his stupor. \"How long are you going to stand there gawking? Get over here!\"\n\n**Pahat!**\n\nShe fired as she spoke. Dozens of arrows arced into the sky and rained down on Malacus's head. Smoke still obscured his vision. Between Grid's antics rattling him and the smoke blinding him, Malacus had no shield deployed. The arrows turned him into a pincushion.\n\nGrid and Regas sprinted toward Jishuka.\n\nMalacus caught them again.\n\n\"You think I'll let you escape?\"\n\n**Kuoooh!**\n\nHe ripped arrows from his back. His arms swept forward. Three black spears tore through the air, homing in on Grid.\n\n\"Why is this bastard targeting me?! Shit! Am I really *that* intimidating?\"\n\nGrid reached for his inventory, fingers closing around Dainsleif's handle.\n\nA shadow flickered between them.\n\n**Kwa kwang!**\n\nThe spears struck earth instead of flesh. Explosions cratered the ground. Malacus's face twisted.\n\n\"A rat scurrying among the mongrels.\"\n\nA dark blade materialized before him. It shot forward, aimed at the shadowy figure protecting Grid.\n\n**Seokeok!**\n\nThe blade struck true. But instead of blood, the figure dissolved into mist.\n\n\"A clone? Tch. How irritating!\"\n\nFury radiated from Malacus. He began weaving another spell, intent on chasing Grid down.\n\nA young man with dead, apathetic eyes appeared and interfered. He darted left and right. Dozens of identical copies spawned around him.\n\n**Pepepepeok!**\n\n**Syu syu syu syu syuk!**\n\nDaggers and projectiles flew from every angle, each following a different trajectory. Impossible to shield every attack point. What could Malacus do?\n\nThe answer was simple.\n\n\"None of this will touch me!\"\n\nMalacus's black shield exploded outward, encasing his entire body. Absolute defense. Vantner watched with his jaw hanging open.\n\n\"How is this balanced? That shield is a scam! He activates it without casting and it covers everything? He's invincible! How do we even fight that?\"\n\nPon shook his head. \"If his defense was as invincible as you think, he'd keep it up constantly. But he doesn't. That's why Jishuka hit him multiple times earlier. He only deploys the shield for the bare minimum time and area needed to block an attack, then drops it. Maintaining it drains too much magic power.\"\n\n\"Makes sense,\" the shadowy figure who'd rescued Grid and Regas said. \"If Malacus is worried about magic consumption like Pon thinks... we're about to get hammered. He won't waste mana on defense anymore. He'll dump everything into offense.\"\n\nCorrect.\n\n\"Noble master of hell! Release the reins of the hounds you have tamed since the dawn of time! Command them to feast upon the hearts of those who dare oppress your lowly servant!\"\n\nThe blue sky blackened. No moon. No stars. Just darkness. The oppressive void swallowed the forest. Dark magic saturated the air. The temperature plummeted. Every member of the Tzedakah Guild felt ice crawl down their spine.\n\nPon muttered, \"Are we about to die?\"\n\nJishuka's voice cracked like a whip. \"Protect Grid!\"\n\nShe'd seen his sword dance moments ago. She wasn't certain Grid was a blacksmith anymore. His class had to be some kind of blade dancer. Still, she couldn't give up hope. Grid had identified the Special Jaffa Arrow with a single glance. That knowledge was invaluable. His survival took priority.\n\n\"On it!\"\n\nToban moved in front of Grid. He activated his strongest defensive skill. The rest followed. Vantner, Pon, Faker, Laella. Every guild member formed a protective wall around Grid.\n\nThe ground beneath Malacus churned like molten rock. Dozens of shadows clawed their way up from the earth. The shadows took form. Dark dogs. Three heads each.\n\n**Grrrung.**\n\n**Bark bark!**\n\nThe beasts stood two meters tall. Fire belched from one head, ice from another, poison from the third. Their red eyes burned with feral hunger. They barked like rabid animals. Malacus gazed at them fondly and smiled.\n\n\"The Hell's Keepers have arrived!\"\n\n**Keeong!**\n\nThe Hell's Keepers surged toward the Tzedakah Guild.\n\n\"Where do you mutts think you're going?\"\n\nVantner's twin axes might be useless against Malacus, but dogs? He could handle dogs. Vantner charged forward with confidence and spun his axes in a whirlwind of steel.\n\n\"Oraaaaa!\"\n\n**Pepeok! Peok!**\n\n**Bark bark! Bark!**\n\nAt first, Vantner seemed to have the advantage. The battle turned in seconds. The Hell's Keepers refused to die. Even split in half by axes, they kept moving. Vantner's body erupted in flames. His legs froze solid, immobilizing him. His skin turned a sickly green. Black blood poured from his mouth. Poison. Even his axes corroded, metal rusting into uselessness.\n\nFire, ice, and poison. All from the Hell's Keepers' breath. His guildmates suffered the same fate.\n\nPon unleashed Mach Spear to cover Vantner's retreat.\n\n**Pepepeng! Pepepepeng!**\n\nSonic spears punched through the Hell's Keepers surrounding Vantner.\n\n**Yip! Yelp!**\n\nThe beasts scattered in panic. Vantner used the opening to activate his invincible skill and stumbled off the battlefield.\n\nToban's face hardened as he watched. \"Not a single one died...\"\n\nNormal monsters crumbled under Pon's spear in one hit. Critical strikes could seriously damage even boss monsters. Yet the Hell's Keepers survived Mach Spear. These things had defense and health that eclipsed ordinary monsters entirely.\n\nThe gravity of the situation hit Jishuka and the guild simultaneously.\n\n\"Vantner dumped all his points into strength, but he's still a guardian knight. His defense and magic resistance are the highest in our guild. Those dogs turned him into a rag in *seconds*. Their attack power is top-tier among anything we've faced.\"\n\nPon grimaced. \"I'd estimate these dogs are at least level 300. We could probably handle two or three individually.\"\n\nTwenty-nine monsters. Minimum level 300. Armed with three elemental attributes. Plus Malacus. The odds were shrinking fast. Morale plummeted. The Hell's Keepers descended on the guild.\n\nJishuka barked orders. \"Ranged attacks only!\"\n\nGoing toe-to-toe with the Hell's Keepers was suicide. Jishuka's command made sense. Unfortunately, few guild members had ranged classes.\n\n**Bark bark!**\n\n\"Ugh!\"\n\nPredictably, the Hell's Keepers smashed through the Tzedakah formation. They shattered Toban's shield and aimed poison breath at the vulnerable targets behind him.\n\nGrid watched Toban's shield corrode in an instant. His life was in danger. He yanked a golden shield from his inventory.\n\nSomething incredible happened.\n\n**Kiing! Whine!**\n\nThe Hell's Keepers, who hadn't retreated even under Jishuka's arrow barrage, recoiled the moment they saw Grid's shield. They whimpered and backed away.\n\n---\n\n**Glossary of Common Korean Terms:**  \nOG: Glossary Link  \n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}