{
  "id": 9,
  "title": "Chapter 9",
  "content": "# Chapter 9\n\nThe camera lens tightened its focus on Katz's blade.\n\nBlood vessels erupted across the steel. Hundreds—no, thousands—of crimson threads writhed and multiplied at a terrifying pace, weaving themselves into a cocoon of pulsating flesh. Within seconds, the sword had transformed into something alive. The blade thrummed like a beating heart, yet its edge gleamed sharper than ever, a wicked thing of organic horror.\n\nThe reporter's face drained of color.\n\nKatz stroked the wriggling weapon like it was a pet. \"This is my passive skill.\" He held up the grotesque blade. \"Any weapon I touch transforms like this. When I strike an enemy, I drain their health in proportion to my attack power. I barely need potions anymore. Solo hunting is trivial.\"\n\nHe grinned at the camera. \"The faster I attack, the more health I steal. Combined with my combat skills, my leveling speed is phenomenal.\"\n\nThe reporter swallowed hard, forcing herself to ignore the sword. \"Is an Epic class truly that superior to standard classes?\"\n\nKatz's eyes narrowed. \"What kind of stupid question is that? Of course it is. Even a Rare class dominates normal ones.\" He leaned closer. \"I'll be first place on the unified rankings. Soon. That's not arrogance. It's fact.\"\n\n\"First place?\" The reporter's tone turned skeptical. \"The top ten rankings haven't changed in over a year. Those players are extraordinary. Isn't it presumptuous to claim you'll surpass them based on class alone?\"\n\n*She's going to make him angry.* I leaned forward on the couch.\n\nSure enough, Katz's expression darkened. He snatched the microphone from her hand. \"Based on class alone? How absurd. I have natural talent. The Blood Warrior class merely provides an outlet for my abilities.\" His knuckles whitened around the mic. \"Agnus obtained an Epic class long before me, yet he's only seventh on the rankings. I'll prove I'm fundamentally different from that failure.\"\n\nAccording to rumors, Katz was heir to one of Japan's largest conglomerates. His pride was as inflated as his bank account.\n\nHe raised the microphone higher. \"Listen well, everyone. I, Katz, will soon claim first place in the unified rankings. I revealed my class today for one reason: to put the current rankers on notice.\" His laugh was sharp and cruel. \"Tremble in fear. I'll cast you all aside.\"\n\nHe moved to return the mic, then paused. \"This is a Korean station, isn't it?\"\n\nThe reporter nodded.\n\nKatz smiled. It didn't reach his eyes. \"Perfect. Relay this message to Yura: Don't be proud of representing a country with nothing but S.A. Group. The era of Korean gaming dominance is over.\" He thrust the microphone back at her. \"I'll trample her, the last pride of Korean gamers, soon enough. Hahaha!\"\n\nThe reporter's eyes glistened. Her face twisted as if she'd stepped in something foul.\n\nI clicked my tongue. \"Microphones in Satisfy are limited-edition luxury items. Rich asshole, flaunting his wealth.\" I slouched deeper into the couch. \"But Blood Warrior...\"\n\n*I'm jealous.* Health drain skills had been overpowered in every game I'd played. And those combat skills Katz mentioned—Epic class abilities—were bound to be devastating.\n\n*But I'm stronger.*\n\nPagma's Descendant was a production class. Most production classes lacked offensive skills entirely. Mine probably did too. But that didn't make me weak. I'd gone head-to-head with Yura and survived.\n\n*My status resistance is absurd. And that five-second immortality passive? Completely broken.* I could build myself into an unkillable tank. *And there's more.* I could equip anything without restrictions. Items would compensate for whatever combat power I lacked.\n\n\"Production classes are money factories anyway.\"\n\nThat was the whole point. Why else would players choose crafting over hunting? Money.\n\n*Pagma's Descendant is a legendary blacksmith class.* A goose laying golden eggs.\n\n*If I make good items and sell them, I can escape my debt.* My pulse quickened. *This class could earn me hundreds of millions of won.*\n\nI returned to my room, powered on the capsule, and pulled up the internet browser. Blacksmithing guides filled my screen. Unfamiliar jargon and technical knowledge swam before my eyes—smelting temperatures, quenching techniques, metallurgical properties.\n\nI forced myself to focus.\n\nTime blurred. Hunger gnawed at my stomach again. I stumbled into the living room, drawn by shouting from the TV.\n\n'BREAKING NEWS' flashed across the screen in red letters.\n\nThe anchor's voice was urgent. \"We've just received breaking news. The Yatan Temple, located in the northern Eternal Kingdom, has collapsed. The well-preserved structure fell overnight under mysterious circumstances. What happened? We go live to Reporter Lee Kyungmin at the scene.\"\n\nThe feed cut to an exterior shot.\n\nI froze.\n\n*That place...*\n\nI knew those ruins. The Yatan Temple—where I'd resurrected yesterday. Where I'd met Doran. The massive structure, once larger than the Capitol Building, now lay half-destroyed, its walls crumbled into mountains of rubble.\n\n*Yura's spell.* The memory surfaced. That dark storm she'd unleashed.\n\n*That magic was powerful enough to destroy a temple?* I shivered. *She used that on me. On a person.*\n\nMy fear of the witch crystallized. *If I ran into her on the street, I'd piss myself.* And Katz thought he could beat her?\n\n\"Delusional bastard. He has no idea what he's talking about. She's on a different level. A monster.\"\n\nReporter Lee continued. \"At approximately 3:40 a.m. today, a user visited this location and witnessed something incredible. Yura, Korea's number one ranker and fifth globally, was engaged in combat. Against whom? With what stakes? Why this location? Was there a hidden quest? Let's hear from our eyewitness.\"\n\nA kid appeared on screen. Maybe middle school age. His ID and level appeared in subtitles at the bottom.\n\nThe boy shifted nervously. \"I was here for a quest. A monster chased me, and I fled into the temple. The believers were gone, but I heard noise underground, so I went to the basement—\" He stopped abruptly. \"There's a mosaic over my face, right? I should be at school. If my mom catches me in the capsule, I'm dead.\"\n\nThe reporter's face pixelated simultaneously. His voice became distorted. \"You're fully obscured. Both video and audio. Please continue.\"\n\nThe kid relaxed. \"Okay. So I went down and saw Yura. God, she's beautiful. Have you seen her in person? She's prettier than Kim Taehee. A complete goddess.\"\n\n\"Her beauty is world-renowned.\" The reporter's tone was impatient. \"What was happening in the basement?\"\n\n\"It was insane.\"\n\n\"Specifically?\"\n\n\"There were like twenty black magicians casting spells constantly at this one guy, but he took zero damage. The curses did nothing. He just laughed and walked toward Yura.\" The kid's eyes widened behind the blur. \"She looked nervous.\"\n\nThe reporter blinked. \"The Yatan Temple's NPCs are documented at level 160 minimum. This person tanked attacks from level 160 NPCs without taking damage?\"\n\n\"He resisted everything. I swear.\"\n\n\"Resisted dozens of spells simultaneously?\" Disbelief colored the reporter's voice. \"Even top rankers can't do that. Was he ranked higher than Yura?\"\n\nThe kid shook his head enthusiastically. \"No way. I've never seen him before. But he beat all the black magicians and threatened Yura. She used Dark Storm... actually, I think she threw everything she had at him. The spell was so strong it shattered the temple, but he was fine afterward.\" He paused. \"Yura looked scared. I'm in her fan club, so I know her expressions. She never looks like that. I couldn't believe it.\"\n\nThe reporter leaned forward. \"What was the outcome? And the man's ID?\"\n\n\"His ID?\" The kid scratched his head. \"Uh... I can't remember. I was too busy staring at Yura. Then a pillar fell on me and I died, so I don't know how it ended.\"\n\n\"I see.\" The reporter turned to the camera. \"Who is this mysterious player who defeated twenty black magicians and challenged Yura herself? This is Lee Kyungmin reporting.\"\n\nThe remote trembled in my grip. My heart hammered against my ribs.\n\n*They're talking about me.* A stupid grin spread across my face. *This is my chance. Interviews. Commercials. Money.*\n\nThe feed returned to the studio. A panel of experts began dissecting the \"mysterious player.\"\n\nI snatched up my phone and dialed the station.\n\n\"Hello, BCC viewer consultation center. How may I help you?\"\n\n\"The breaking news. The guy who fought Yura.\" I tried to sound casual. \"You're looking for him, right?\"\n\n\"Yes. Do you have information?\"\n\n\"It was me.\"\n\nSilence.\n\n\"Ah. Right. For verification purposes, could you provide your Satisfy ID and some details?\"\n\n\"My ID is Grid. My class is Pagma's Descendant. My level is negative three. Pagma's Descendant is from a legendary class change book—\"\n\nThe line went dead.\n\n\"...Hello?\"\n\nI called back. It rang once and went to voicemail.\n\n*They blocked my number.* Heat flooded my face.\n\n\"Idiots! You'll regret missing the scoop of the century!\"\n\nI reached for my phone to try another station, then stopped.\n\n*Wait.* If I went public now, I'd have to explain the minus level. The legendary class. *Not yet. It's too early.*\n\nI slumped back onto the couch and focused on the TV.\n\nA familiar figure appeared in the corner of the frame.\n\n*Doran?*\n\nThe screen showed an overhead shot of the temple ruins. A small inset window displayed the expert panel. In the main feed, barely visible amid the rubble, a figure crawled forward.\n\nDoran.\n\nI pressed my face against the TV screen. He was tiny, overlooked by the cameraman, but unmistakable. He dragged himself through the debris, a woman cradled in his arms.\n\n*The earl's daughter.* The one he'd been searching for.\n\nThe temple's destruction had created chaos. Somehow, Doran had used the confusion to reach her.\n\nThe woman stood. Her mouth opened in a scream. Tears streaked her face. Doran reached into his pocket and pressed something small into her hand. He spoke briefly, then collapsed.\n\nHis body dissolved into gray light.\n\nThe woman clutched the object to her chest and ran, disappearing into the ruins.\n\n\"Doran died.\"\n\nHe was an NPC. Artificial life. A program. But watching him fade felt wrong. He'd had thoughts. Warmth. A presence.\n\n\"The ring...\"\n\nI clenched my fists.\n\n*When NPCs die, their equipment vanishes with them.* My jaw tightened. *That ring. If you were going to die anyway, you should've given it to me.*\n\nI stared out the window. Rain hammered the glass in sheets.\n\nMy stomach growled.\n\nI forced down a meal, then returned to my research. Blacksmithing guides. Material properties. Crafting techniques.\n\nAt 3:55 p.m., the capsule chimed. My twelve-hour penalty had expired.\n\nI climbed inside.\n\n\"Login.\""
}