{
  "id": 90,
  "title": "Chapter 90",
  "content": "# Chapter 90\n\nFor the administrator's quest, Grid had created two Divine Shields. While the legendary shield was stolen from right under his nose, he still had the rare version.\n\n**[Divine Shield]**\n**Rating:** Rare\n**Durability:** 360/360  \n**Defense:** 189  \n**Magic Resistance:** 150\n\n* Rare chance of completely resisting dark spells.\n\n*An item made by a craftsman with great skill and potential, though his experience and reputation are somewhat lacking. Thanks to the power of Cassus, a priest of the Rebecca Church, it shines with the divine power of the goddess of light. Due to its strength against dark magic, all followers of demons and the Yatan Church will suffer when facing this shield.*\n\n**User Restriction:** Level 190 or higher. 500+ Strength. 1,000+ Divine Power. Member of the Rebecca Church.  \n**Weight:** 800\n\n\"What is that shield?\"\n\nThe moment Grid pulled out the golden shield, the wildly rampaging dogs stumbled backward. They began whining like puppies.\n\nThe Tzedakah Guild watched in admiration. Jishuka stared, visibly shaken. She couldn't let go of her hope. \"That shield... Did you make it? Just like the Special Jaffa Arrow?\"\n\nThe creator of the Special Jaffa Arrow was Grid? The Tzedakah Guild members doubted their ears. Grid was focused only on survival, so he nodded without thinking.\n\n\"Yes, I made it. But this...\"\n\nGrid ground his teeth. His eyes blazed. \"This is a failure! Shit! The real finished product was stolen from me by some bastard!\"\n\nThe Tzedakah Guild members flinched. They'd seen many outstanding shields before, but this ranked in the top three. To hear it called a failure was shocking.\n\n\"That shield is a failure? When it's one of the best three shields I've seen?\"\n\nThe guild members exchanged uneasy glances. Pon moved to Jishuka's side.\n\n\"Grid's dagger and armor are unusual. Both have outstanding performance. That dagger requires high agility, and that heavy armor is meant for knights. Above all, he revealed a strong sword technique earlier. Yet he's a blacksmith? The one who produced the Special Jaffa Arrow... Is he the unknown craftsman we're looking for?\"\n\nWhat type of blacksmith wore a dagger and heavy armor? Didn't he perform a sword dance typical of blade dancers? Jishuka had no answer for the suspicious Pon, but she didn't agree with his doubts either.\n\n\"Grid recognized the Special Jaffa Arrow at a glance and said he made it. He has no reason to lie. Let's assume he's the unknown craftsman.\"\n\nPon had been with Jishuka since L.T.S. and trusted her judgment. She was open and credible, which was why she'd become guild master. But this situation tested even his faith. No matter how he looked at it, Grid couldn't be a blacksmith.\n\nAs Pon wrestled with his suspicions, Malacus cried out. \"That is the Divine Shield! Are you the rumored blacksmith who has business dealings with Winston's lady?\"\n\nMalacus looked particularly agitated.\n\n\"The Divine Shield is in your hands... It means Mesta failed his mission. No wonder there was a delay!\"\n\nNow things made sense to Grid. The one who brainwashed the administrator and stole the Divine Shield was Malacus's subordinate.\n\n\"You fucker! It was you!\" Grid pointed at Malacus. \"You're the bastard who stole my shield!\"\n\nPon's eyes widened at the vulgar outburst. A strange excitement coursed through him.\n\n*Even Malacus is calling Grid a blacksmith.*\n\nEvidence that Grid's identity matched Jishuka's theory.\n\n*A blacksmith who can wear heavy armor and use that dagger, plus the sword dance...*\n\nPon turned to confirm his suspicion. \"Does Grid have a hidden class?\"\n\n\"It looks that way.\" Jishuka nodded.\n\nPon's voice rose with excitement. \"To determine Grid's identity, we need to finish this raid quickly. Right, Regas?\"\n\n\"Ah, yes.\"\n\nRegas emerged from a corner. His health and wounds had recovered with help from his guild members. Confidence radiated from his expression.\n\n\"I already know the strategy to beat Malacus. I'll finish it quickly.\"\n\nRegas, who'd watched the battle from right beside Malacus, asked Grid for help.\n\n\"Grid, these dogs seem afraid of your shield. I hope you'll help us.\"\n\nAll eyes turned to Grid. Questioning, doubt, confusion, and expectation mixed in their gazes. Grid nodded.\n\n\"I'll help if you promise to give me 50% of the items Malacus drops.\"\n\nVantner, who was sitting off to one side waiting for his potion cooldown, shouted angrily. \"Hey! There are seventeen of us and one of you. That's eighteen people total. The dropped items should be divided eighteen ways. Why should you take 50% alone? And didn't Regas help you for free? You received free help, but when you help, it's paid? What?\"\n\n\"You shouldn't be counted as seventeen people. Aren't all seventeen of you one organization? Shouldn't an organization count as one person? Besides, my work with Regas is different. Regas helped me, but have you helped me? Why are you acting so entitled?\"\n\n\"What? Hey, you! This is the first time I've met someone worse than Pon! Who in the world makes calculations like this? If it wasn't for us, wouldn't you already be dead? Shouldn't you thank us? Isn't this unconscionable?\"\n\n\"You should thank me. Didn't you get a chance to fight Malacus because of me? The raid was on the verge of failure, but you survived thanks to my shield.\"\n\n\"What!\"\n\n\"Stop it, Vantner.\"\n\nPon had quickly determined Grid wasn't ordinary. He calmed Vantner and nodded at Grid.\n\n\"You're right. I'll divide the items 5:5 according to your proposal. Please remember, we're unconditionally kind to you.\"\n\nPon was laying groundwork to recruit Grid into the guild. Grid had no knowledge of this and misunderstood.\n\n*They need my Divine Shield to defeat Malacus. Damn it. I should've demanded 7:3 instead of 5:5.*\n\nJishuka invited Grid to the party. Grid accepted with an unwilling expression, then froze when he saw the member list.\n\n*More than level 200!*\n\nGrid knew the Tzedakah Guild was small and elite. But he'd never imagined they'd be at this level.\n\n*Jishuka is level 251. Pon is 243... Regas 239... If this is the case, shouldn't all three be in the top 20 of the unified rankings? The others must be in the top 100... What is this monster group?*\n\nNumerous guilds existed in Satisfy. Among the established ones, a few belonged to the top 1,000 of the unified rankings. Each guild had around five rankers at most. Yet all seventeen members of the Tzedakah Guild were at least top 200 rankers. They might be few in number, but they were certainly one of the strongest guilds in Satisfy.\n\nOn the other hand, subtle emotions crossed the faces of guild members who checked Grid's level.\n\n*Level 95... Low.*\n\n*It's high for a blacksmith, but... Isn't he a hidden class like they're suggesting, not a pure blacksmith?*\n\n*Level 95 for a hidden class is...*\n\n*If this is real... I can't play games anymore.*\n\n\"What? What is it?\"\n\nGrid felt uncomfortable as the Tzedakah Guild members stared at him. Unlike the others, Regas just laughed and grabbed him. \"Let's go!\"\n\n\"Wait a minute...\"\n\nRegas lifted Grid's body. Then he threw the baffled Grid between Malacus and the hell's keepers.\n\n\"Are you trying to kill me? Ahhh!\"\n\nGrid crashed to the ground. \"My ass!\"\n\nThe hell's keepers yelped and scattered as Grid and the Divine Shield fell from above. Malacus was different.\n\n\"That shield, I'll take it!\" He blinked in confusion when Regas appeared before him. Then he laughed. \"You want to face me head on? You must be crazy!\"\n\nRegas struck.\n\nMalacus spat blood. \"Gah!\"\n\nThe black shield, which boasted absolute defense, collapsed before Regas's fist.\n\n*What?*\n\nMalacus hadn't made a mistake. He'd deployed the shield at the exact point of attack. But Regas's fist bypassed the shield completely and hit his abdomen. Malacus couldn't understand how.\n\nThen again.\n\n\"Kuah!\"\n\nMalacus's face took Regas's elbow. This time, Malacus grasped the situation.\n\n*This guy changes the trajectory of his attacks!*\n\nCorrect. As a means of defeating Malacus's defense, Regas adopted the simple method of changing his attack orbit in real time.\n\n\"Kgh!\"\n\nIf the fist aimed for the bottom of the chin, the shield deployed there. But the fist would stop midway and strike the neck instead.\n\n\"Ugh!\"\n\nThe shield opened on the left side of his head, but the fist stopped and struck his jaw instead.\n\nRegas's fists, which had a passive skill ignoring 33% of enemy defense, hit Malacus at blinding speed.\n\nIn the end, Malacus took a clean hit to the chest. He flew backward into the forest.\n\nMalacus's body pierced several trees before embedding deep in a large rock.\n\n\"K... Kgh...\"\n\nMalacus emerged from the rock, broken and bloody. But he recovered as if the damage was a lie. His overwhelming magic power fueled rapid regeneration. However, this meant excessive magic consumption.\n\nMalacus exited the forest and spoke to Regas in an unconcerned manner.\n\n\"You're stupid. If you change the orbit mid-attack, won't your muscles tear? I can heal from all attacks. The more you hit me, the more you damage yourself. Even more...\"\n\nRegas ignored the talking Malacus and wielded his fists again. Malacus unfolded the shield to protect his entire body. Then he laughed. \"If I use the shield like this, it doesn't matter if your fist can change orbit. You'll never touch my body!\"\n\n\"Yes. My fists are useless.\" Regas smiled. \"But that...\"\n\nArrows flew toward Malacus.\n\nThe arrows penetrated the shield and struck Malacus. Regas explained to the fallen priest. \"I saw your shield weaken as the range expanded. Your weakened shield can't stop her arrows.\"\n\nArchers were special among combat classes. Due to their poor defense, they ranked as one of the worst in close combat, along with magicians. Instead, they had extremely high attack power. In all of Satisfy's classes, few could deal as much physical damage as archers.\n\nJishuka stood at the peak of archers. The expert archer.\n\nRegas had witnessed Malacus using three layers of shields against Pon's Mach Spear and two layers against Jishuka's arrows, so he'd developed this strategy.\n\n\"Y... You...!\"\n\nThe wound healed slowly because it was fatal. The Tzedakah Guild poured attack skills toward the temporarily defenseless Malacus.\n\n\"Divine Punishment!\"\n\nDozens of black lightning bolts fell from the sky. Malacus sensed the crisis and used his strongest spell. It dealt catastrophic damage to the Tzedakah Guild.\n\n\"This attack power...\"\n\nToban and Vantner endured. However, the other guild members were stunned and left defenseless. Guild members with weak magic resistance died instantly. Despite raising their stats with various buffs and potions, they suffered a crisis and teetered on the verge of annihilation.\n\nFortunately, Jishuka maintained a careful distance and remained safe. Grid was protected by the Divine Shield. Grid sighed with relief when he saw the guild members' health plummet.\n\n*If it didn't have the rare chance option to resist dark magic, I would've died. I should buy a lottery ticket later.*\n\n\"You...\"\n\nMalacus rose with great difficulty. Most of his injuries had healed, despite being a semi-corpse moments ago.\n\n*This is the last chance!*\n\nThey had to hit Malacus before he fully healed. Jishuka didn't want her guild members' sacrifice to be in vain. She used her strongest attack skill, consuming 100% of her mana.\n\n\"Phoenix Arrow!\"\n\nThe Special Jaffa Arrow flew through the air. Flames appeared around it in the shape of a huge phoenix. The phoenix burned everything around it and swallowed Malacus.\n\nAn explosion shook the earth. The Tzedakah Guild hoped for Malacus's end, but no system messages appeared. Malacus emerged from the flames, half his body missing.\n\n\"Ku... Girl...! I... kill...!\"\n\nThe remains of a five-layer shield stood before Malacus. Jishuka's Phoenix Arrow had smashed through Malacus's five-layer shield and damaged him. But Malacus survived. A boss monster had enormous health.\n\nToban and Vantner stepped forward.\n\n\"We have to end him before he fully recovers!\"\n\nToban's mace and Vantner's twin axes aimed at Malacus's body. Their attacks didn't hurt him or restrain his regeneration.\n\nRegas and Pon watched, frustrated.\n\n*They're lacking attack power!*\n\nJishuka reached her mental limit from exhausting her mana. She didn't attempt another attack. Except for Toban and Vantner, everyone else remained stunned. Malacus laughed as he dismissed Toban and Vantner's attacks.\n\n\"Kuhahahaha! Okay! Hell's keepers! Eat those people!\"\n\nThe three-headed dogs growled and barked.\n\nThis was the end. The raid had failed. As everyone watched the hell's keepers desperately...\n\n\"Pagma's Swordsmanship.\"\n\nGrid, now armed with a greatsword instead of a dagger, began to dance.\n\nThe greatsword was over three meters long, but it moved through the air to an invisible tune.\n\n\"You...?\"\n\nMalacus's expression hardened. That familiar aura was being emitted from Grid again. Killing intent. Truly perfect killing intent. The killing intent around Grid compressed into the sword.\n\n\"Y-You... This is ridiculous!\"\n\nMalacus had sacrificed thousands, tens of thousands of virgins as living sacrifices. He'd experienced all types of hatred and anger, but this was the first time he'd been threatened by such killing intent.\n\n\"You!\"\n\nIt was coming. Malacus wanted to prepare. But his body still wasn't fully recovered, so he couldn't move freely. Then Grid's sword dance ended.\n\n\"**Kill!**\"\n\nAfter entering the party, Grid had received buff skills like the other members, raising his stats. His maximum mana increased, allowing him to trigger Kill.\n\nThe greatsword, filled with extreme killing intent, pierced straight into Malacus's heart. A notification window flashed before Grid.\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \n\nCheck out my Patreon for early access to unedited chapters and to help achieve goals for extra chapters. Early access chapters will be updated after I finish releasing all chapters for the day."
}