{
  "id": 901,
  "title": "Chapter 901",
  "content": "# Chapter [X]\n\nMountains and sea hemmed in the Murray Kingdom on all sides. While it lacked the empire's superior infrastructure or the diverse quest opportunities of the Overgeared Kingdom, Murray possessed its own appeal—enough to attract tens of millions of players. One-tenth of them called the capital city of Juden home.\n\nToday, the capital erupted into chaos.\n\nGuards sprinted through the streets. The army mobilized. Then came the explosion. The screams followed shortly after.\n\n\"There's no way...\"\n\nThousands of players converged on the source of the commotion, drawn by the thunderous noise. What they witnessed defied belief: a knight clad in crimson armor locked in combat with a shabby-looking soldier. The two combatants launched themselves skyward, exchanging blows at speeds that made their movements blur into afterimages. \n\nThe scene rivaled the legendary clash between Grid and Kraugel in the PvP finals of the 3rd National Competition. No—this battle was far more devastating.\n\n\"*Asmophelllll!*\"\n\nThe red knight—Singuled—roared with unbridled fury. Each swing of his sword unleashed a crescent of light that obliterated everything in its path. The high walls surrounding a nearby mansion collapsed after being pierced clean through. The players watching could only imagine what would happen if that attack struck flesh instead of stone.\n\nAnd the blond soldier facing this onslaught? He carved a path of destruction in the opposite direction, leaving trails of blazing light. Explosions kicked up clouds of dust. At this rate, the entire district would be reduced to rubble.\n\n\"NPCs like this actually exist?\"\n\n\"Where did these monsters come from—*Heok!*\"\n\n\"Get back!\"\n\nThe spectating players scattered in panic. Singuled's blade struck the earth, and the ground within a hundred-meter radius simply ceased to exist. The shockwave from the collision between Singuled's sword energy and Asmophel's counter sent the blond soldier hurtling through the air. He landed hard, a pained grunt escaping his lips.\n\n\"*Keuk...!*\"\n\nThe sight of Asmophel's face twisting in agony only stoked the flames of Singuled's rage.\n\n\"This is nothing—*nothing* compared to the pain of a betrayed heart!\"\n\nSinguled had once had a homeland. That homeland had sheltered his family. He had dedicated everything to it. He'd taken pride in being a citizen of the great empire that dominated the continent and would have gladly laid down his life for its glory. Twelve years ago, he had done exactly that—embraced his nation's will, marched to war, fought without shame, and torn out enemy hearts for his country's honor.\n\nBut when he returned home, there were no cheering crowds. No emperor's praise.\n\nInstead, he had been greeted by the sharp points of spears and swords—wielded by Asmophel and thousands of soldiers he had once called comrades.\n\n*'Enemy who betrayed your homeland, don't resist.'*\n\nHell. That day had been nothing less than hell incarnate.\n\nThe heads of his parents, his wife, his children—all hanging like trophies in that beautiful city.\n\nSinguled had fled that day and sworn with every fiber of his being that he would have his revenge. He would cut out Asmophel's tongue, gouge out his eyes, sever his limbs, and scatter them like refuse before Asmophel's family.\n\n\"*Asmophel! Until you feel that same agony—!*\"\n\nFor twelve years, Singuled had asked himself one question: how could he penetrate the empire's defenses to reach Asmophel? Finding his target here, in Murray's capital, was an unexpected stroke of fortune. He would not squander this opportunity.\n\n\"*Ohhhhh!*\"\n\nSinguled drove his sword energy into the ground. The earth itself began to erode, collapsing under the assault of his killing intent. Everything above the disintegrating ground—people, plants, buildings—teetered on the edge of death.\n\nAt the center of the maelstrom stood Asmophel.\n\n\"*Cough!*\"\n\nAsmophel's skin had taken on a sickly blue tinge. Each cough made the blood vessels in his neck and face swell as if ready to burst. Death was approaching, and part of Asmophel welcomed it. He wanted to use his death to escape the bridle of his sins, to finally lay to rest the vengeful spirits of his former comrades.\n\nBut his king had given him a mission. Asmophel could not die until he fulfilled it.\n\nFlames erupted from Asmophel's blade, neutralizing Singuled's sword energy. The trembling earth stilled. The plants and people standing upon it were released from the specter of death.\n\n\"I cut off your father's head.\"\n\nAsmophel drew a knife and sliced his own neck—not deep enough to kill, but sufficient to draw blood.\n\n\"Every soldier who harmed your family was following my orders.\"\n\nHe knelt before Singuled and began methodically wounding himself. Eyes, ears, mouth, neck, chest, arms, waist, legs—he carved into his own flesh like a butcher preparing livestock.\n\n\"What insanity is this?\" Singuled demanded.\n\n\"When you finally kill me, dismember my body and feed it to beasts. I hope that brings you some measure of peace.\" Asmophel's voice remained steady despite the blood streaming down his form. \"It will happen sooner or later. Until then, please wait until I have repaid the debt I owe to the king I serve.\"\n\n\"...\"\n\n\"I don't dare ask for forgiveness. I can only apologize. I committed an unforgivable sin against you and your family.\"\n\n\"...\"\n\nAn uncomfortable feeling swept through Singuled. The object of his hatred these past twelve years...\n\n\"Singuled, come with me to the Overgeared Kingdom. Piaro is waiting for you.\"\n\n\"...Boss?\"\n\n***\n\nGrid's confrontation with Hexetia had brought him tremendous benefits. He was now a benefactor to a god. His name echoed across the world. Blacksmiths everywhere—himself included—reaped incredible rewards. Pride swelled in his chest. The knowledge that the dwarves who had once inspired Pagma were now taking interest in *him* filled Grid with equal parts nervousness and anticipation.\n\nBut not everything was cause for celebration.\n\nSomething in hell had locked onto his position. The 1st Great Demon Baal had been mentioned. Who was tracking him, and why invoke Baal's name? The realization that he had become a target for something dwelling in hell sent ice through Grid's veins.\n\nAt this moment, his fear materialized.\n\n[The presence in hell who has captured your location has arrived on the surface.]\n\n*'No. How?'*\n\nIt couldn't be a great demon. The message would have explicitly stated as much.\n\n*'The presence was searching for me in hell, isn't a great demon, and is motivated enough to emerge on the surface the instant my location was discovered...'*\n\nThe answer crystallized in Grid's mind: his clone.\n\nThe clone born with the sole purpose of killing Grid. According to Yura's account, that purpose remained unchanged. It was still hunting him, determined to complete its mission.\n\n*'Yes. It's almost certainly the clone.'*\n\nWhich raised another question.\n\n*'How did it break out of hell?'*\n\nYura had reported that the clone resembled Grid when using Blackening. The clone had died while under the effect of Blackening and fallen into hell, where it maintained that state in order to survive the hostile environment. To climb back out, it would need to release Blackening—but the moment it did so, the system should pronounce it dead and erase its existence. At least, that was Grid's understanding based on his own experience.\n\n*'Maybe there are other methods. The clone is fundamentally different from me, after all.'*\n\nGrid shook his head, dismissing the speculation. How the clone escaped hell was irrelevant right now. The clone that even Great Demon Belial had been wary of was already here. Moreover, unlike great demons, it wouldn't suffer penalties on the surface. The clone could potentially display greater power than Belial himself on Earth, and it was heading straight for Grid. It would inevitably march on the Overgeared Kingdom, and many would be hurt along the way.\n\nGrid had to stop it.\n\n*'Where is it?'*\n\nThe clone knew Grid's location, but Grid had no idea where the clone currently was.\n\n*'What should I do?'*\n\nGrid wasn't particularly worried. He had people he could rely on.\n\n\"Summon the 10 Meritorious Retainers and Sage Sticks immediately.\"\n\n\"At once, Your Majesty!\"\n\nThis wasn't a problem he could solve through worry alone. He would gather his people and find a solution together. The Overgeared King commanded such a wealth of talent that doubt never crossed his mind.\n\n***\n\nRed warning lights flashed. Sirens wailed through the office.\n\n[TEX-214098 processor has activated]\n\nYoon Nahee, head of Satisfy's management team, frowned at the alert. \"Isn't TEX the designation for clones? What's the issue with this one?\"\n\nSatisfy contained hundreds of thousands of doppelganger monsters and clone-creation spells. They were utterly commonplace. A clone's actions shouldn't adversely affect Satisfy's worldview. So why was the supercomputer Morpheus reporting a risk?\n\n*'...Wait.'*\n\nYoon Nahee's confusion gave way to a sinking realization. She bit her nails, thinking, *'Am I working overtime for a ridiculous reason again?'*\n\nThen it hit her. There was one entity who survived—and created—all types of variables.\n\n\"Him...?\"\n\nIt was going to be a long night. Yoon Nahee set her bag back down and shrugged on her white coat once more.\n\n\"Checking designation 214098... I-It's Grid's clone!\"\n\nHer team members were already reporting in. It was exactly as she'd feared. Hundreds of monitors throughout the office displayed the image of Grid's clone. But something was wrong with the background. Instead of the dark, lava-filled landscape of hell, the clone stood in a lush green forest.\n\n\"214098's position isn't in hell? How did it reach the surface?\"\n\nHer team members' typing speed increased dramatically as they began calculating 214098's route, trying to determine how this had happened.\n\n\"It is Baal's entertainment.\"\n\nLim Cheolho's voice cut through the frantic atmosphere. The chairman looked remarkably well—his complexion vibrant, almost excited. He appeared decades younger than usual.\n\n\"Baal...? You mean S-003?\"\n\n\"Yes. The 1st Great Demon, Baal.\"\n\nAs the entity equipped with Satisfy's most advanced artificial intelligence, Baal had been the first virtual creature to experience *tedium*—and to pursue *entertainment*. In Satisfy's history, his simulation had preceded the game's official launch. He'd created countless variables, including assisting Pagma himself. These interventions had expanded and complicated Satisfy's worldview immeasurably.\n\nNow, history was repeating itself.\n\n\"Following Agnus, Grid has captured Baal's interest. Baal has recognized him as one of the Five Miracles—the ones who will alleviate his tedium.\"\n\n\"Then the reason Grid's clone escaped from hell...\"\n\n\"Your assessment is correct. It's not an error—it's Baal's will. In Satisfy's context, you could describe it as either a god's blessing or a demon's curse.\"\n\n\"...\"\n\nOn the monitors, Grid's clone began to move. When Grid unlocked new skills through the goddess's blessing, the clone had unlocked them as well. As Grid grew stronger through repeated battles and quests, so too did the clone. Could the current playerbase withstand the catastrophe Baal had unleashed upon the surface?\n\n*'...It'll be nearly impossible unless the Five Miracles unite.'*\n\nAn army might succeed, but the losses would be staggering. The clone's combat ability was too overwhelming, its arsenal of skills too vast. Millions could be slaughtered.\n\n\"...Hah.\"\n\nLaughter bubbled up from Yoon Nahee's throat—slightly hysterical.\n\nOriginally, most of humanity was supposed to have been wiped out during the insane dragon Nevartan event, or the alien species invasion. But Grid had intervened, alongside Kraugel and Kir, and saved humanity.\n\n*'Now humanity is in danger because of Grid.'*\n\nWhat did that mean? \n\nFate. That unscientific notion that outcomes were predetermined by forces beyond human understanding, that some destinies couldn't be avoided—it was manifesting in virtual reality.\n\n\"Haha...\"\n\nA scientist contemplating fate? The absurdity was almost too much. But as she laughed, Yoon Nahee heard Chairman Lim Cheolho speak again.\n\n\"I've been through this before.\"\n\nHe'd recognized what she was thinking—that she'd begun to believe in fate.\n\n*'When this happens...'*\n\nGrid will do something extraordinary."
}