{
  "id": 902,
  "title": "Chapter 902",
  "content": "\"Why were you born?\"\n\n\"...What?\"\n\nThe ten meritorious retainers exchanged bewildered glances. They'd dropped everything to answer Grid's urgent summons, only to be greeted with... philosophy? The silence that followed was arctic.\n\nFinally, Lauel straightened in his seat, a manic gleam entering his eyes. \"An excellent question, Your Majesty. I was reborn to rule this world. Kukuk... Every regret from my past life will be satisfied—\"\n\n\"Because I'm Daehan!\" Peak Sword cut in. \"I was born to raise Korea's status! Same as you, Grid!\"\n\nHuroi's eyes shone with fervor. \"My liege, your wisdom knows no bounds! I have learned much from—\"\n\n\"None of you can answer it.\"\n\n\"...Huh?\"\n\n\"I literally just answered.\"\n\nGrid waved them off impatiently. *Better to just move on.* He turned to the others. \"Most people can't answer that question. I can't. But my clone?\" He paused. \"He knows exactly why he exists. He was born to kill me.\"\n\n\"Clone?\" Chris leaned forward. \"Your clone?\"\n\n\"The one I saw in Hell?\" Yura's voice cut through the confusion.\n\n\"Yes. And he's not in Hell anymore.\" Grid's jaw tightened. \"He's coming here. To our kingdom.\"\n\nThe temperature in the room seemed to drop.\n\nGrid continued, his voice flat. \"He's dangerous. Everything he does serves one purpose—hurting me. And anyone between us becomes collateral damage.\"\n\nLauel's fingers steepled. \"What evidence do you have? How certain are you of his location and trajectory?\"\n\n\"The system notifications. And I know how he thinks.\" \n\nChris rose from his chair, battle-lust flickering across his features. \"Do you have his exact position?\"\n\nFighting a version of Grid without reservation—the thought sent adrenaline coursing through him.\n\n\"If I knew that, I'd already be there.\" Grid's answer deflated the room. \"I don't know where he is. But he knows where I am.\"\n\n\"Then we need to locate him. Now.\"\n\n\"Wait—didn't you say he's coming here? Why not just let him?\"\n\n\"And let our people get caught in the crossfire?\"\n\n\"We'll fight on the plains outside the city—\"\n\n\"You're oversimplifying this.\"\n\nThe debate escalated. Then a new voice cut through the chaos.\n\n\"Based on what I witnessed—and what Youngwoo-ssi told me—the clone has access to more skills than he does. Including the God Hands.\"\n\nEvery head turned. Yura stood in the doorway, her expression grave.\n\nShe moved to the table, ignoring Vantner's startled yelp. \"We need to intercept him as far from Reinhardt as possible. Grid's wide-range skills, his item-swapping capabilities...\" She met their eyes one by one. \"If we fight near the city, there won't be much city left.\"\n\nThe memory of that single devastating blow still haunted her. Reinhardt's towering walls would crumble like sandcastles. And if the God Hands wielded the Red Phoenix Bow...\n\n\"The clone is a rabid predator. He attacked me on sight, no hesitation, no questions. He'll tear through anyone between him and Grid.\" Yura's hands pressed flat against the table. \"We deploy the kingdom's full intelligence network. Find him. Stop him as far from here as possible.\"\n\nThe Overgeared members weren't heroes. They were pragmatists, profit-seekers, power-climbers. But Grid was their leader—their friend. If someone wearing his face started a massacre, public opinion would crucify him. The Overgeared Guild's reputation would shatter. For Grid's sake, and their own, they had no choice.\n\nFaker melted from his chair like smoke given purpose. \"I'll mobilize the Shadows immediately. Contact me with any updates.\"\n\nAs he vanished, hundreds of black-cloaked figures emerged from the castle's dark corners—the Overgeared Shadows, forged in the crucible of Kasim's training and honed by Faker's expertise. Their synchronization was beautiful, deadly. Grid exhaled slowly, tension easing from his shoulders.\n\n\"With the Shadows deployed, we'll have his location soon, right?\"\n\nLauel's expression remained troubled. \"If he's rampaging, yes. But if he's moving covertly...\"\n\nGrid's frustration bubbled over. \"Did you not hear Yura? He attacked her on sight. Does that sound like someone who'll skulk around?\"\n\n\"He's not a mindless monster. He has intelligence—super-named NPC intelligence, by your own assessment.\"\n\n\"So?\"\n\n\"Stamina management. You understand its importance better than anyone.\" Lauel's fingers drummed the table. \"He won't waste resources before the main event. Our intelligence web is comprehensive within Overgeared territory, but if he sticks to remote routes...\" He shrugged. \"Difficult.\"\n\n\"...\"\n\nSo Grid just had to... wait. Wait for the clone to arrive in his capital. The helplessness gnawed at him. He'd faced that monster. He knew what was coming. And Lauel, brilliant Lauel, had no solutions?\n\nLauel studied Grid's face, reading shadows there. \"Is it true? You genuinely believe you'll lose?\"\n\n\"What?\"\n\nGrid's memories of that encounter were branded into his psyche. \"He's stronger. He knows Pagma's Swordsmanship techniques I haven't learned. He can fuse more sword dances simultaneously. His combat instincts, his stats, his control, his adaptability—everything is superior.\"\n\n\"Wow...\" Vantner's whisper held equal parts awe and dread.\n\nThe implications settled over the room like a burial shroud. A version of Grid with better control? That wasn't a boss monster. That was a natural disaster. Even Katz, usually brimming with confidence, swallowed hard.\n\nYura's quiet voice hammered the final nail. \"He one-shot me.\"\n\nThe silence became suffocating. Every meritorious retainer was calculating casualties, imagining the devastation.\n\nThen Lauel scratched his head, breaking the spell. \"Look, this might sound harsh, but... Grid, couldn't you also one-shot Yura? I don't think that's the metric we should focus on.\"\n\n\"...What?\" Yura's eyes became dangerous slits.\n\nShe was Yura. Demon Slayer. Top-ranked before her legendary class, and now? Last year's National Competition, she'd traded blows with Kraugel himself. Pride wasn't a sin when it was earned. And Lauel had just casually dismissed her.\n\n\"Why are you provoking her?\" Grid hissed.\n\n\"I'm stating facts, not provoking.\" Lauel seemed genuinely confused. \"Miss Yura, you said Transcended Linked Kill Wave Pinnacle defeated you, correct?\"\n\n\"Yes?\"\n\n\"Take Grid to a sparring room. Let him hit you with a two-fusion skill. Same result.\"\n\nYura's face flushed crimson. Not from embarrassment—from fury. Lauel was reducing her defeat to a footnote, her strength to irrelevance.\n\n\"So what you're saying—\" Her voice shook. \"—is that the clone is weak, and I lost because I'm pathetic?\"\n\n\"No?\" Lauel blinked innocently. \"The clone is absolutely dangerous. I'm saying Grid is equally dangerous.\"\n\nNo malice. That somehow made it worse.\n\n\"Yura, ignore him.\" Grid scrambled for damage control. \"Lauel misspoke. Everyone makes mistakes, right?\"\n\nBut the fuse was already lit.\n\n\"Sparring arena. Now.\" Yura's tone brooked no argument. \"Hit me once. But I'm summoning Hell first—fair conditions, boosted stats.\"\n\n\"I—what? Is this really—\"\n\nGrid had learned from Sehee that when a woman's temper flared, there were no right answers. Yura was telling him to hit her, but some instinct screamed this was a trap.\n\n*And besides...*\n\nThis was Yura. Friend. Ally. The world's most beautiful woman, by popular consensus. The thought of striking her made his stomach turn.\n\n\"No. I refuse.\"\n\n\"If Your Majesty doesn't do this,\" Lauel intoned mournfully, \"Miss Yura will hate and doubt me forever.\"\n\n*Damn it.*\n\n\"This is insane...\"\n\nGrid felt like scum as he trudged to the sparring arena, Yura striding ahead.\n\n\"Hell Summoning.\"\n\nReality warped. The arena transformed into a nightmare landscape of ash and flame. Yura's stats surged.\n\n\"Now. Hit me.\"\n\n\"Uh...\" Grid faced her, mind racing. What if someone was recording this? What if—\n\n\"I've cleared the area!\" Lauel called. \"Only the meritorious retainers are present!\"\n\n*That's the problem!*\n\nThese were his friends, yes. Also his personal embarrassment committee.\n\nGrid summoned the Blade Aiming at the Gods, attaching it to his sword. He initiated the dance—Pinnacle Kill. Multi-hit skills like Linked Kill wouldn't achieve a one-shot. This was the only way.\n\nLauel's hand flew to his forehead. \"No, wait—you should use your strongest two-fusion—\"\n\nWhy Pinnacle Kill? Did Grid want Lauel proven wrong? Was he sabotaging—\n\nThe world tilted.\n\n[You have suffered catastrophic damage!]\n\n[A legend doesn't die easily. You can resist all attacks for 5 seconds with a minimum of health.]\n\nYura crumpled.\n\n\"I—it's the items!\" Grid dropped to her side, horrified. \"I'm sorry!\"\n\nSilence. Yura stared at nothing, processing. The meritorious retainers stared at Grid, recalculating.\n\nThey wore Grid's weapons. But the armor? Most of them were still using their own gear.\n\n\"The clone uses a rusty knife,\" Lauel murmured into the quiet. \"His skills might surpass Grid's. But Grid's been crafting, enhancing, perfecting his equipment for...\" His voice trailed off, letting the implication hang.\n\nThe gap wasn't insurmountable.\n\nIt was equipment."
}