{
  "id": 904,
  "title": "Chapter 904",
  "content": "Three years ago in Satisfy time, Euphemina had received the hidden quest 'Mumud's Soul Liberation' after her confrontation with Agnus ended in a stalemate. She'd acknowledged his strength back then—and resolved to surpass it. Four months ago, she'd finally set her plan in motion. She mobilized every contact, spent obscene amounts of gold gathering intelligence on Agnus, and traveled the continent duplicating skills specifically designed to counter his undead armies.\n\nNow, all that preparation was being tested against an entirely different enemy.\n\n\"Link.\"\n\n\"Blood Rain!\"\n\nEuphemina conjured a magic shield as dozens of dark energy blades sliced through the air. The shield shattered under the assault, fragments dissolving into particles of light. Through the dissipating barrier, she locked eyes with the clone.\n\nHis expression remained blank. Neutral. He showed no frustration despite having his skills neutralized repeatedly. Was he simply that confident?\n\n'No,' Euphemina realized. 'He doesn't *have* emotions.'\n\nGrid had been whispering to her throughout the battle, explaining the clone's origins and nature. Based on his description and what she was witnessing firsthand, Euphemina calculated the clone's approximate level.\n\n'Several times weaker than Grid.'\n\nThat was her conclusion. The clone might have grown over the years—Grid certainly had—but the real issue was his equipment. That rusty sword. That defensive gear. All of it was outdated equipment Grid had used years ago. Compared to his current arsenal, these items posed minimal threat.\n\n\"Items from before Triple Layers...\" Euphemina murmured. \"You can't beat me with hand-me-downs.\"\n\nThe term 'has-been' came to mind. And that armor—wasn't that the Holy Light Set? Once legendary, now surpassed. Euphemina could exploit that weakness. \n\nShe seized the initiative. Her arsenal of anti-undead skills—gathered specifically for Agnus—proved versatile and devastating.\n\nDozens of massive stone formations materialized overhead, each boulder exceeding a meter in diameter. They plummeted earthward. When the first one struck, the ground buckled. Tremors rippled through the street. Thousands of spectators stumbled, crying out in terror.\n\n\"H-Holy—! Get back!\"\n\n\"Uwaaaah!\"\n\n'There's my opening.'\n\nWhile chaos reigned and the clone remained trapped beneath the rubble, Euphemina prepared her finishing move. She unleashed Absolute Zero—a skill duplicated from Bondre, Valhalla's first-ranked ice mystic.\n\nThe clone's body crystallized as he crawled from the debris, frozen solid like an arctic sculpture.\n\n'Now!'\n\nLightning erupted from her fingertips. The ultimate technique struck the immobilized target dead-center. Given the clone's stats were comparable to Grid's, Euphemina expected this combination to delete his entire health pool.\n\n[You have dealt 29,000 damage to the target!]\n\n'What?'\n\nThe damage was... underwhelming. Shouldn't it have been two, even three times that amount? The rockfall and Absolute Zero had similarly disappointed. \n\nAs the lightning's force hurled him backward, shattering his icy prison, the clone's health bar—previously obscured by debris—became visible.\n\nNine-tenths remained.\n\nEuphemina's stomach dropped. Two facts crystallized simultaneously: First, the Holy Light Armor she'd dismissed as obsolete was still utterly fraudulent. Second, the clone was a *named boss.* The armor's magic damage reduction combined with a health pool exceeding ten million.\n\n'A Grid... with boss-tier HP?'\n\nThat was just unfair.\n\n'I can't win this.'\n\nFear crept in. The clone rushed forward, blade swinging. Basic attack. Basic attack. Basic—\n\n\"...?\" \n\nEuphemina summoned another magic shield, but her eyes widened. She caught it—the subtle shift in the clone's footwork. His stance had changed.\n\n'Sword dance...!'\n\n\"Pinnacle Kill.\"\n\nOne of Grid's strongest fusion skills. A defense-ignoring death sentence.\n\n\"Ugh!\" \n\nHer physical stats couldn't match her magical prowess—escape was impossible. She had no choice but to burn her trump card.\n\n\"Teleport!\"\n\nSpatial magic saved her life. Pinnacle Kill carved through empty air as light swallowed Euphemina's small frame. She reappeared behind the clone.\n\n\"Black Winds!\"\n\n\"...!\"\n\nThe ultimate technique of Zednos, the first-ranked wind magician, erupted from her fingertips and carved into the clone's back. Blood sprayed. The clone's gaze snapped to her, completely ignoring the Murray magicians attempting to restore order. His focus locked onto Euphemina alone.\n\nShe swallowed hard. As one of the world's strongest players, feeling this unnerved was rare.\n\n\"Wicked monster! Remove your mask at once!\" \n\nA savior appeared. Asmophel had finally broken free from the four God Hands. The moment he'd managed to stun all four simultaneously, he'd vaulted across broken rooftops, fire sword blazing.\n\n\"Sir Asmophel!\" \n\nEuphemina's face lit up with relief. The Overgeared Kingdom's greatest warrior after Piaro and Mercedes was here. Surely—\n\nHer relief lasted exactly one second.\n\nAsmophel wasn't in peak condition. His earlier struggle with the former Red Knight Singuled had taken its toll. While faster than the clone, the God Hands constantly disrupted his movements.\n\n\"Kuoh...!\"\n\n\"No...!\" \n\nEuphemina's cry came too late. The clone's hand clamped around Asmophel's throat. Unlike players, NPCs only had one life. Asmophel's death would devastate the entire Overgeared Kingdom. Grid and the others would be crushed. Euphemina remembered what Khan's death had done to Grid—she couldn't let that happen again.\n\nShe had to pull aggro back.\n\nMagic bombardment erupted from her hands. The clone's attention shifted from Asmophel back to Euphemina.\n\n\"Question. Do you believe you can avoid death?\"\n\n\"...!!\"\n\nThe clone charged through her magical barrage, Holy Light Armor negating most of the damage, sword aimed at her throat.\n\n\"Ah...!\" Asmophel's devastated cry echoed across the rooftops.\n\n\"Of course!\" \n\nEuphemina answered the clone's question and abandoned her duplicated skills. Time to reveal what she'd been hiding from the world.\n\n\"Flowing River.\"\n\n*Splash!* \n\nWater engulfed the clone's sword. Euphemina's Flowing River demonstrated the true strength of Mumud's water magic—the principle of 'magic power converted to water and ice, shaped to the caster's will.' The clone's rusty blade couldn't penetrate the flowing barrier. Each time the sword submerged, physical debuffs stacked: weakened power, reduced speed. The weapon became as useless as its appearance suggested.\n\n\"Is that an elemental?\" \n\nSpectators gaped. The blonde woman who'd appeared to save them seemed nothing short of heroic. Every time Grid's clone attacked, water flowed gracefully to intercept and neutralize the assault. The crowd mistook it for an elemental summon.\n\n\"Wait! T-That woman...!\"\n\nThe clone attacked from above, only for water to rise and block. He pivoted mid-strike, kicking at Euphemina's ankle. The blow connected. She tumbled from the rooftop, falling toward ground level—close enough for players to read the ID hovering above her head.\n\n\"Euphemina!\" \n\nShock rippled through the crowd. They knew her—the ally who'd stood beside Grid during the Reinhardt golem invasion years ago. Why was she fighting *against* Grid now?\n\nEuphemina knew thousands were recording this. She shouted, \"That's not Grid! It's a fake!\"\n\nGrid was her benefactor. Her friend. The person she both admired and envied. She refused to let people misunderstand and turn against him.\n\nHer declaration triggered a collective realization among the spectators.\n\n\"...NPC?\"\n\nOf course. The name tag above the fake Grid's head shone gold—the universal symbol of named NPCs. Across the internet, breaking news headlines shifted: 'Overgeared King Grid Invades Murray Kingdom' transformed into corrections and retractions. The battle footage dominated video rankings, watched in real-time by millions.\n\n\"I feel exposed.\"\n\nEuphemina unleashed Mumud's no-attribute magic—spells that ignored thirty percent of magic resistance—followed by torrents of water magic. The woman who'd deliberately skipped the National Competition to keep her abilities secret was now on display for the entire world. Agnus and countless other enemies would study this footage, prepare counters.\n\nIt couldn't be helped. Grid's reputation was worth it.\n\nHer magic power erupted outward, forcing the clone back. Euphemina stood protectively in front of Murray's knights and soldiers.\n\n\"You can't hurt anyone while wearing Grid's face. I won't allow it.\"\n\n\"...Judgment. Maintenance required.\" \n\nThrough the magical explosion, a small anvil and blacksmithing hammer materialized. The clone began repairs, striking the rusty sword with methodical precision. Within moments, the corrosion vanished—the blue greatsword called Failure restored to its original state.\n\nBad timing. Euphemina had already lost nearly a third of her health. The shark-shaped blade pierced through her water barrier and carved into her body.\n\n\"Ugh!\"\n\nDeep. Painful. Both Holy Light Armor and Failure still possessed overwhelming power. Blood spilled from Euphemina's lips as her casting faltered.\n\n\"Result. Victory.\"\n\nFailure descended toward her skull. Euphemina saw death approaching.\n\n\"...?\"\n\nThe blade stopped. Blocked. Euphemina didn't die.\n\nThe clone's gaze lifted from her, turning skyward.\n\n\"Kill. Grid.\"\n\nA bird's cry rang out—fierce and resonant. A massive red phoenix materialized overhead, raining fire arrows downward. The projectiles struck the clone while simultaneously healing Euphemina and Asmophel's wounds.\n\n\"I'm always late.\"\n\nGrid and the ten meritorious retainers appeared through Sticks' Mass Teleport."
}