{
  "id": 905,
  "title": "Chapter 905",
  "content": "The sea convulsed. Towering waves erupted skyward, threatening to swallow the sun itself.\n\n\"Ah...!\"\n\nFirst came the crimson phoenix. Then a deluge of flame. Explosions from the surging tides transformed the ocean into a boiling cauldron. The spectators who'd witnessed this cascading destruction could only stare—until movement against the sun's backdrop drew their eyes upward.\n\n\"Good. We're not too late.\"\n\nA woman lowered her bow, breath visible as she cooled the residual heat from its string. Her figure was captivating, commanding attention as the summoned phoenix wheeled overhead. Godly Archer Jishuka—the finest archer among two billion players.\n\n\"Plenty of spectators.\" An Asian man surveyed the Murray soldiers and gathered players with calculating eyes. \"If I use them as blood offerings, subduing that thing becomes trivial.\" Blood Warrior Katz. One of the first three to claim a hidden class, alongside Agnus and Euphemina.\n\n\"Euphemina lost a one-on-one?\" A spear-wielding man shook his head. \"She must've been caught off guard.\" White Knight Pon.\n\n\"Grid was right~~! His clone's actually strong! This is going to be fun!\" Regas, the blond brawler with sparkling eyes and gleaming gauntlets, practically vibrated with anticipation. His asura class carried an SSS-grade acquisition difficulty—and he wielded it with natural talent.\n\n\"Fighting here will elevate South Korea's standing even further. Huhuhut.\" Peak Sword stroked his sheath, dark amusement in his laugh. The man who'd shattered The Hero in two moves.\n\n\"Remove My Liege's mask immediately, or your parents will—\" Huroi didn't even blink as the threat rolled off his tongue.\n\n\"I want first crack at him.\" Chris hoisted his greatsword with barely restrained eagerness. The first-ranked player.\n\n\"Stay sharp. Don't get careless.\" Demon Slayer Yura's voice carried an edge as grey light rippled around her.\n\n\"Is that Failure? That piece of junk supposed to hurt me?\" Vantner's bald head gleamed with confidence.\n\n\"Kuk... kukukuk! I can already taste your despair. Your pitiful existence, clinging to an impossible purpose—it ends today. I'll grant you the rest you seek.\" Lauel's words were so painfully cringe-worthy that listeners instinctively curled their toes.\n\nThey descended on red wyverns, a sight to behold—the elite players who'd claimed gold medals representing their nations at the National Competition.\n\n\"Euphemina, Asmophel—you've done well. We'll handle it from here.\"\n\nFinally, the black-haired man. White light sphere and golden blade orbited him as he floated forward independently.\n\n\"T-The Overgeared King...\"\n\n\"Grid! It's the real Grid!\"\n\nRecognition sparked cheers from the crowd. The most famous player in Satisfy—more influential than his ten companions combined. The emergence of Grid.\n\nUnlike his wyvern-mounted allies, Grid descended alone through the air like a sorcerer, touching down with barely a sound.\n\n*Shing!*\n\nA sharp whistle cut through the din.\n\n\"...!\"\n\nThread—impossibly thin, invisible to the naked eye—bound the clone tight. Silver thread. Forged in Pangea on the East Continent. Unbreakable.\n\n\"Do we really need to talk?\"\n\nGrid knew from experience that high-level targets with resistance could slip these bonds quickly. He didn't waste time being greedy. His thumb pressed the release—silver thread loosening around the clone's torso. Another press. The thread snapped taut, and the +1 Lightning Sword Born from Enlightenment and Strong Desires attached to its end punched through the clone's sternum.\n\n> **[You have dealt 2,900 damage to the target.]**\n\n'What defense...'\n\nMinimum damage. The clone's defense exceeded even the Enlightenment Sword's attack power. With the Holy Light Armor factored in, the clone's stamina stat had to exceed **3,000**. While the clone remained frozen from the shock, Grid shaped the Enlightenment Sword using the silver thread's momentum.\n\n\"**Magic Missile!**\"\n\nNo respite. This was Grid's strategy—formed before ever confronting the clone. From his own experience and Yura's testimony, he knew the clone could execute more sword dances than Grid himself. Its swordsmanship was superior.\n\nBut Pagma's Sword Dance carried a fatal flaw: activation time.\n\nGrid would deny the clone that window.\n\n\"Noe! Randy! **Can you Become the King of the Dead?**\"\n\nMagic Missiles hammered the clone's position, obscuring its vision as Grid's summons materialized.\n\n\"Nyaaang!\"\n\n\"Hello.\"\n\n*Clatter! Clack-clack-clack!*\n\nThree Grids now occupied the battlefield. Randy's perfect mimicry launched Kill at the Magic Missile-battered enemy. White-furred Noe bounded forward on all fours, lightning crackling from his body.\n\n> **[Your pet, Randy, has dealt 4,100 damage to the target.]**\n>\n> **[Your pet, Noe, has dealt 6,300 damage to the target.]**\n>\n> **[The target has resisted the electric shock.]**\n\n*Clack! Clack-clack!*\n\nThe Overgeared Skeletons flanked the clone. Skeleton One triggered its destroyer class abilities, stabbing at the clone's wrist with the Grid Rapier for Beginners—attempting to proc Bone Cracking. Skeleton Two's basic attacks were pitiful, but effective at fracturing the clone's concentration.\n\n> **[Overgeared Skeleton One has failed to use the skill 'Bone Cracking.']**\n>\n> **[Overgeared Skeleton One has dealt 190 damage to the target.]**\n>\n> **[Overgeared Skeleton Two has dealt 23 damage to the target.]**\n\nBone Cracking didn't proc. But through the barrage of Magic Missiles came the sickening *crack* of breaking bone—Skeleton One, launched sideways by the clone's counterattack.\n\n> **[Overgeared Skeleton One has suffered catastrophic damage!]**\n>\n> **[Overgeared Skeleton Two has used the Bone Sticking skill.]**\n>\n> **[Overgeared Skeleton One has been restored.]**\n>\n> **[Overgeared Skeletons One and Two have received fatal damage and returned to the earth.]**\n\n\"Skeletons...!\"\n\nToo low level. No match for a clone equivalent to—or exceeding—Grid's own strength. The Overgeared Skeletons crumbled into nothing.\n\n\"**1,000-ton Sword!**\"\n\nChris plummeted from his wyvern, ultimate skill already active. The greatsword forged from Belial's bones crashed down on the clone's skull. The clone buckled under impossible weight, driven down until its body formed a crater fifty centimeters deep. A stake pounded into the earth.\n\n> **[You have dealt 251,500 damage to the target!]**\n\n\"...!?\"\n\nNot enough. Barely a flesh wound. Chris' ultimate technique had merely scratched the clone. Blood trickled from Chris' eyes as the clone tensed to retaliate—\n\n\"Ashamed of the face your parents gave you? Is that why you wear another's? How do you think your parents feel? Oh, wait—you *don't* have parents, do you?\"\n\nHuroi channeled his wind elemental, voice amplified as the Taunt triggered. The clone's focus snapped toward the wyvern-mounted orator.\n\nThe window for counterattack slammed shut.\n\n\"Stop yapping and die.\" Pon's spear drove through the clone's back.\n\n\"**Insane Dragon Wave!**\" Regas' flying kick hammered the clone's chest from the opposite side.\n\n\"...!\" The simultaneous impact—front and back—forced the clone to swallow its scream.\n\n\"**Pagma's Swordsmanship!**\" Grid completed the setup while his companions kept the clone locked down. \"**Linked Kill Wave Pinnacle!**\"\n\nKill's devastating strikes tore into the clone repeatedly. Energy blades erupted in a storm, caging their target. Crimson lightning descended. Blood burst from the clone's mouth and chest.\n\n> **[You have dealt 2,395,700 damage to the target.]**\n\nOverwhelming. Even Chris, Pon, and Regas—who'd gauged the clone's defense—stared in shock.\n\n\"Not enough...!\" Frustration flickered across Grid's face. God's Command had failed to proc at this critical juncture. But he wasn't alone. What he lacked, his companions would provide.\n\n\"**Give it to me.**\"\n\nPeak Sword had dropped to ground level the moment Noe and Randy appeared. Now he assumed the draw stance, eyes sharp as razors. Iyarugt gathered power in its sheath.\n\n> **[Iyarugt, who is 100% charged with magic power, is in an intoxicated state. He has lost his ego and is running wild.]**\n>\n> **[The conditions of use for Iyarugt has been changed to 'person to be sacrificed.']**\n>\n> **[It is impossible to summon Iyarugt.]**\n>\n> **[Iyarugt's damage has increased by 500%.]**\n\n\"**Annihilate.**\"\n\nDraw Sword—the fastest, hardest-hitting skill in all of Satisfy—emerged as a streak of crimson light. The blade of energy reached Grid's clone.\n\n\"...!!\"\n\nThe clone had braced for Linked Kill Wave Pinnacle. But not this. Its shoulder separated, arm tumbling free. The clone staggered.\n\n\"Lauel.\"\n\n\"**Storm Dragon's Fury.**\"\n\nJishuka and Lauel synchronized perfectly. Lauel bent the winds with his flow master abilities while Jishuka's fire arrows rode the gale, each one striking true. Blood flowed freely from the successive impacts.\n\nThen Katz seized control.\n\n\"**Blood Tornado.**\"\n\nEvery drop that had soaked into the ground answered his call, rising in a scarlet vortex.\n\n\"Master!\"\n\n\"Grid!\"\n\nNoe and the others signaled. But Grid was already moving—Linked Kill Wave forming as he closed in to finish the clone trapped within the bloody storm.\n\n*Tang! Tang! Tang!*\n\nHammering echoed from within the flames and blood. Grid pushed harder—but too late. The clone had activated Blacksmith's Eyes, analyzing Grid's equipment in an instant. Production skill triggered. The clone reproduced Grid's gear mid-combat.\n\nThen it activated Moving Fortress—the Valhalla of Infinite Affection skill, the armor containing Grid and Khan's story.\n\nThe blood storm and Linked Kill Wave both dissipated harmlessly."
}