{
  "id": 906,
  "title": "Chapter 906",
  "content": "**Clang! Clang! Clang!**\n\nThe clone's hammer struck the Holy Light Armor in rapid succession. Metal warped and twisted, transforming before Grid's eyes. Within seconds, the breastplate had become something else entirely—Valhalla of Infinite Affection.\n\nGrid's blood ran cold.\n\nHe'd known this was possible. Every encounter with his doppelganger in the Behen Archipelago had proven the thing could replicate his abilities, his equipment. He'd learned from those defeats, even gained Blacksmith's Eyes after finally breaking through. They took from each other—that was the nature of their twisted relationship.\n\nBut this...\n\n*Damn it. This can't be real.*\n\nSeconds. The clone had recreated Khan's masterwork in mere seconds. No materials. No schematics. Just—\n\n\"Die!\" The word tore from Grid's throat, raw with fury. His vision tinged red at the edges. How dare this thing mock Khan's legacy, the final gift from the man who'd—\n\nThe shout died on his lips.\n\n\"...What?\"\n\nBlack liquid spread across the clone's chest. Valhalla melted like tar, soaking into synthetic flesh before hardening again. The armor and body became one—an impossible fusion that made Grid's stomach turn.\n\n\"Recognition. I am you.\" The clone's voice held no inflection.\n\nGrid forced down his rage. Think. Analyze. His eyes tracked the clone's movements, the way the armor pulsed against its skin. Then understanding struck like a hammer blow.\n\n\"Moving Fortress!\" He spun toward his companions. \"Everyone—scatter! Now!\"\n\n>[Moving Fortress]\n>\n>[It can be activated if the wearer's health drops by more than one tenth (Enable/Disable can be selected).\n>\n>-Converts the durability of Valhalla of Infinite Affection to defense (one durability= two defense).\n>\n>-Immune to all conditions (including physical statuses).\n>\n>-It will last for one minute and the current durability of Valhalla of Infinite Affection will be set to 30 points (at the end of Moving Fortress, the current durability will be restored by a third of the maximum durability).\n>\n>* Please note that if the durability falls to zero, the item will be permanently destroyed.\n>\n>The wide range skill 'Impregnable', which deals half of all damage received in the last five minutes in a 50-meter radius, can be activated.\n>\n>Skill Resources Consumption: Valhalla of Infinite Affection's maximum endurance will drop permanently by 200.\n>\n>Skill Cooldown Time: 10 minutes.]\n\nThe ultimate skill. Devastating utility, catastrophic cost. Valhalla's durability would never recover, and a single mistake meant permanent destruction. Grid had sworn never to use it—Khan's legacy deserved better than expendable tactics.\n\nBut the clone had no such sentiments.\n\n\"Question. Why do I exist if you exist?\"\n\nThe words sent ice down Grid's spine. This wasn't just mimicry anymore. The clone was developing *purpose*. It didn't just want to kill him—it wanted to *replace* him.\n\nRed light erupted from the clone's body. No—from Valhalla itself, the armor superheating against false skin. The clone blurred forward.\n\n\"Move!\" Grid's warning came even as his companions reacted. \n\nJishuka's arrows rained from above, keeping the clone's attention split. The meritorious retainers scattered in practiced patterns. But the clone activated Quick Movements from the Ideal Dagger, closing distance faster than trained reflexes could manage. Jishuka's shots sparked harmlessly off Moving Fortress's impenetrable defense.\n\n\"What is needed? Your death. Perish.\"\n\nThe air itself seemed to compress. Grid, Chris, Pon, Regas, Katz, Peak Sword—all still within fifty meters. The accumulated damage from five minutes of combat detonated outward in a single, crushing wave.\n\nTiles shattered. Buildings crumbled. The impact crater spread like a wound across the battlefield.\n\nAnd then—nothing.\n\n\"...?\" A question mark materialized above the clone's head.\n\nBrilliant light reflected off a very bald, very stubborn head.\n\n\"Did you think I was a folding screeeeeen?!\"\n\nVantner stood at the center of protective barriers that rose from the ground itself. His face was already pale, mana reserves draining at a catastrophic rate. But the Sacrifice Shield held, converting 90% of his remaining power into absolute protection for his party.\n\n>[Party leader Grid has suffered catastrophic damage!]\n>\n>[The effect of 'Transfer Damage' has shifted the damage to the Sacrifice Shield.]\n>\n>[Serious damage was dealt.]\n>\n>[The user of this shield will die the moment the duration is over.]\n>\n>[Party member Chris has suffered catastrophic damage!]\n>\n>[The effect of 'Transfer Damage' has shifted the damage to the Sacrifice Shield.]\n>\n>[Party member Regas...]\n>\n>[Party member Pon...]\n\n\"Cough!\" Blood flecked Vantner's lips.\n\n>[The duration of Sacrifice Shield is over.]\n>\n>[Your flesh, which has crossed the limit to protect your colleagues, will collapse.]\n\n\"That bastard...\" Vantner's knees buckled. \"Get revenge... for me...\"\n\n>[You have died.]\n>\n>[You have lost 36.1% experience.]\n>\n>[The item 'White Pauldrons' has been lost.]\n>\n>[Two batches of the item 'Super Limited Resource Recovery Potion' has been lost.]\n>\n>[The durability of the 'Taldran Mace' has dropped by 103.]\n>\n>[The durability of 'Belial's Shield' has dropped by 209.]\n>\n>[The durability...]\n>\n>[......]\n\n\"Vantner!\"\n\nThe scream tore from multiple throats. But Pon's voice cut through the rest—ten years of friendship condensed into pure, incandescent rage.\n\n\"You dare!\" His spear trembled in white-knuckled hands. \"You *dare*!\"\n\nThey'd competed in every game before Satisfy. Argued over every victory, every defeat. Vantner had ground levels with painful dedication, hour after hour of thankless progression. And this *thing* had just erased months of effort like it meant nothing.\n\n\"Gail!\"\n\nThe white horse leaped from the wyvern in answer. Pon caught the saddle, buffs flooding his system as mount and rider synchronized. His spear left his hand in a silver streak—faster than Quick Movements, faster than thought.\n\nIt pierced the clone's heart.\n\nPon was already there, second spear leveled, preparing the ultimate technique. Take the Throne would chain perfectly from the impact—\n\nThe clone's hand snapped up. Pinnacle caught Pon mid-strike.\n\n>[You have died.]\n>\n>[You have lost 36.8% experience.]\n>\n>[The item 'Prototype Lantier's Cloak' has been lost.]\n>\n>[The item 'White Rose Gloves'...]\n>\n>[......]\n\n\"Pon!\"\n\nThe battlefield seemed to freeze. Murray Kingdom's players watched in disbelief as their champions fell. Strongest rankers. Legends. Dying to a single enemy.\n\nThis wasn't real. It *couldn't* be real.\n\n\"Your Majesty...\" Asmophel's voice cracked. The God Hands kept him pinned, unable to help. Unable to reach his king while the meritorious retainers—survivors of countless battles—crumbled like common soldiers.\n\nSinguled moved closer, studying Grid with critical eyes. \"That is your king?\"\n\n\"Yes.\"\n\n\"The one Piaro serves.\" Singuled's gaze sharpened. What would this king do now? How would he respond to watching his people die to a monster wearing his face?\n\nHaster thought he knew. *A wise king would retreat. Call Piaro. Knights Summoning exists for exactly this situation.*\n\nThe clone was magnitudes more dangerous than Grid himself. Impossible health pool. Instant item replication. The meritorious retainers had proven repeatedly they couldn't match Grid alone—how could they fight something stronger?\n\n*There's only one answer. Piaro.*\n\nThe Great Swordsman who Master Winfred had mourned his entire life. The Overgeared King's ultimate weapon. Haster waited for the summons, already anticipating how encountering Piaro might unlock his path to becoming a true Red Sage.\n\nBut Grid didn't move.\n\n\"Vantner. Pon.\"\n\nHe walked across ground turned to glass by the clone's assault. Dark red and purple energy coiled around him—fighting energy the clone hadn't copied. *Couldn't* copy.\n\nGrid knelt. His hands trembled as he gathered broken pauldrons, torn fabric. Vantner and Pon's dropped equipment felt heavier than Greed in his palms.\n\nHe looked up at his remaining companions.\n\n\"Buy me time.\"\n\n\"...?\" Haster's jaw went slack. Not summoning Piaro? *Depending on his companions instead?*\n\n*He'll sacrifice them rather than risk his best knight?*\n\nUnderstanding—cold and complete—settled in Haster's chest. *Shockingly selfish.*\n\nGrid had built his kingdom on the backs of the Overgeared Guild. Now, at the crucial moment, he'd throw them away to protect his prize asset. Haster almost laughed.\n\n*You won't keep your throne long.*\n\nThe cracks would form today. Grid's companions would see him for what he truly was. Everything he'd built would crumble from within.\n\n\"$#[email protected]#!!\"\n\nJishuka and Lauel rained attacks from above. Huroi's verbal assault battered the clone's composure. Ground troops scattered, harrying, buying seconds with their lives.\n\nAnd Grid? He hung back, supporting with white light and golden blades, with Noe and Randy. But never engaging directly.\n\n*Waiting for Moving Fortress to end,* Haster decided. *Planning a finishing blow for when the defense drops.*\n\nSimple tactics. And utterly futile. The clone was a named boss—intelligent enough to anticipate obvious strategies. By the time Grid attacked, his companions would be scattered corpses, and the clone would be ready.\n\n*Fool.*\n\nLauel, swaying on the wyvern's back, reached the same conclusion. *The clone will be prepared for the timing His Majesty targets.*\n\nBut neither Haster nor Lauel knew Moving Fortress's full mechanics. Only Grid understood the cost of the absolute defense coating his doppelganger.\n\n>[Fighting energy has reached the maximum.]\n>\n>[Strength, stamina, and agility has increased by 50%.]\n\n\"100,000 Army.\"\n\n\"...!?\" Lauel's eyes went wide.\n\n\"Using that *now*?\" Haster breathed.\n\nGrid moved. Not at the end of Moving Fortress—in the middle of its duration. Regas's kicks, Chris's greatsword, Jishuka's arrows, Yura's magic bullets, Katz's blood magic, Peak Sword's Draw Sword—all converged as Grid flashed forward.\n\nThe clone executed a perfect sword dance, parrying the onslaught of Overgeared's finest.\n\n\"Massacre Sword.\"\n\nEnergy blades erupted in a storm of killing intent. The clone's eyes widened fractionally—the first crack in its composure.\n\n*Why attack while Moving Fortress is active?*\n\nBecause Moving Fortress had already done its work. Durability reduced to thirty points. Valhalla, Khan's masterpiece, teetering on the edge of destruction.\n\n\"Judgment. Dangerous.\"\n\nThe armor splintered under the assault. The clone called the God Hands, activated Flower—mimicking lessons learned from Grid and Randy. Never use Revolve first. Advanced tactics.\n\nBeautiful and lethal, energy blooms shattered Grid's massacre blades mid-flight. But momentum couldn't be denied. Valhalla had already weathered the meritorious retainers' combined assault. Now the 100,000 Army Massacre Sword hammered through failing defenses.\n\nCracks spread. The armor's form collapsed entirely.\n\nGrid activated Quick Movements and Blacksmith's Rage in one fluid motion. \"Son of a bitch! Be prepared!\"\n\nThe pieces finally clicked together in his mind. Why had the clone replicated his equipment so quickly? A unique skill, obviously—fraudulent analysis and copying within seconds. But if that skill was truly perfect, Grid could never win. The game would become unplayable.\n\nAnd the S.A. Group, for all their creative sadism, wouldn't do something that *obviously* unreasonable. Not where media exposure could destroy them.\n\nWhich meant—\n\n\"You overgeared fraud! Pinnacle Kill!\"\n\n—it was the *items.*\n\nThe armor, sword, and God Hands the clone had initially appeared with. Those were the source. The copying ability came from equipment, not inherent power. Destroy the armor, break the mechanism.\n\n>[Critical!]\n>\n>[The effect of the title 'Death in One Shot!' has been activated, adding 30% critical damage!]\n>\n>[The Vital Spot Detection of the Slaughterer's Eye Patch has activated!]\n>\n>[The weak spot has been attacked! Further damage will be dealt!!]\n>\n>[You have dealt 9,195,700 damage to the target.]\n\nThe clone staggered. No new armor materialized. No replacement copied. Just raw damage, health plummeting without protection.\n\nGrid's grin was absolutely feral. \"Yes. This is the power of items.\"\n\n\"...\"\n\n*Then what about you?*\n\nThe unspoken question hung in the air as spectators processed Grid's words. The man who'd just weaponized equipment mechanics was *mocking* his opponent for relying on items.\n\nThe irony was not lost on anyone.\n\nAt S.A. Group headquarters, stunned silence gave way to frantic discussion.\n\n\"Did Grid understand the clone's structure from the beginning?\"\n\n\"The opening assault—he *wanted* the clone to copy Valhalla. Wanted it to use Moving Fortress.\"\n\n\"The moment he knew he'd face the clone again, he must have calculated how to exploit his own equipment.\"\n\n\"He truly is one of the Five Miracles...\"\n\n\"God Grid...\"\n\nThis was the moment the S.A. Group stopped calling Grid an ordinary player."
}