{
  "id": 908,
  "title": "Chapter 908",
  "content": "A rough tongue scraped across Grid's cheek—surprisingly gentle despite the sandpaper texture. He glanced down to find Noe's speckled eyes fixed on him, the white cat's fur bristling with anxiety.\n\n\"Master... hurt?\" The demonic beast's voice wavered.\n\nGrid touched the small, round head between Noe's ears. \"I'm fine.\"\n\n*Like hell I am.*\n\nHe choked back the profanity before it could escape. That goddamn Indomitable effect—activating at the worst possible moment, turning what should have been a killing blow into a glancing strike. Now the clone had recovered enough to counterattack, and Grid had lost his opening.\n\n*Of all the fucking times...*\n\nThe stat description mocked him from memory. **Indomitable**—a \"special\" stat that could nullify incoming damage. The probability ranged somewhere between 0.01% and 0.001%. Grid had forged enough items to push his Indomitable close to 2,000 points, and he could count on one hand the number of times it had actually triggered.\n\n*For me, anyway.*\n\nBut the clone? The bastard's luck activated it the instant before death. Grid finally understood the burning resentment his enemies must feel when facing him.\n\n*Items and luck... absolute bullshit.*\n\nA flicker of movement caught his eye—the clone's shoulder shifting. Grid threw himself sideways as Linked Kill's energy blade carved through the space where his head had been.\n\n*Christ, that was close.*\n\nHe'd used the technique hundreds of times. Muscle memory saved him. As he twisted through the air, applause erupted behind him.\n\n*Clap. Clap. Clap.*\n\n\"As expected from King Grid!\"\n\n\"...?\"\n\nLauel stood below, beaming. The same man who'd been white-knuckling his anxiety moments ago now wore the expression of a proud teacher.\n\n*Did he crack?*\n\n\"Your Majesty deliberately spared the clone!\" Lauel announced to the gathered crowd.\n\n\"Uh...\"\n\n\"You understand that killing it while Blackening is active would only repeat this disaster!\"\n\n\"...Right.\" Grid touched his forehead. *Oh no.*\n\n\"Furthermore, you're seizing this opportunity for training!\"\n\n\"What?\"\n\nLauel's eyes shone. \"The first time Your Majesty encountered Randy, you turned it into a learning experience. That small brain of yours, working so hard to improve... truly admirable.\"\n\n\"...\"\n\n*He's completely misread this.*\n\nYes, Grid had trained against Randy—Pagma's doppelganger—and against his clone in the Behen Archipelago. He'd lost repeatedly, studying each defeat until he could match them. But this time? He hadn't even considered learning from the clone's Transcended Linked Kill Wave Pinnacle. How could he worry about training when his guildmates were bleeding out?\n\nVantner and Pon had already fallen. The others teetered on the edge. Grid couldn't waste time playing student while his people died.\n\n\"Brilliant strategy!\" Lauel's voice carried across the square. \"Drag out the fight! Make Vantner and Pon's sacrifices meaningful! Use the clone as a whetstone!\"\n\n\"Wait, he spared it deliberately?\"\n\n\"Insane... fighting a superior opponent without breaking a sweat...\"\n\n\"This is why he's the best.\"\n\n\"Making his guildmates sacrifice themselves so he can grow stronger... ruthless efficiency.\"\n\n\"That's the Overgeared way!\"\n\nThe murmurs swelled into a roar. Haster and the other spectators leaned forward, eyes gleaming.\n\n*No, that's not—*\n\n\"Grid! You can do it!\"\n\n\"Murray Kingdom stands with you!\"\n\n\"God Grid! God Grid! God Grid!\"\n\nThe capital erupted in chants.\n\n\"That wasn't the plan...\" Grid muttered, sweat beading on his forehead. He forced himself to breathe. *Alright. Fine. Roll with it.*\n\nCrisis and opportunity—two sides of the same coin. The clone was dangerous, yes, but Grid could learn from it. And he held the advantage now. The clone's armor was gone, leaving it vulnerable. Grid himself remained healthy. Both their Immortality skills were spent.\n\n*But is this smart?*\n\nThe clone wielded the Enlightenment Sword's power. One mistake could be fatal. Grid glanced at his companions. The Ten Meritorious Retainers had pulled Asmophel back, clearing the battlefield.\n\n\"G-Grid! Fighting!\"\n\n\"Show us your greatness, God Grid!\"\n\n\"Kukukuk! You've got this, Your Majesty!\"\n\n\"...\"\n\n*They're just... standing there. Watching.*\n\nNot from cowardice—they'd done their part, worn down the clone, and now offered him the finishing blow as courtesy. The prey belonged to the hunter.\n\n\"Okay.\" Grid steadied his nerves and waited for Blackening to expire. He met the clone's eyes. \"Come on, then. Show me every sword dance you've mastered. We'll fight until one of us drops. Fair and square.\"\n\nHe pulled a health potion from his inventory and drained it.\n\n\"...\"\n\nThe crowd's enthusiasm deflated slightly.\n\n*Should've drunk that 1.3 seconds earlier,* Haster thought, mentally tracking Grid's potion cooldown. He studied the clone's health gauge. *If it doesn't take damage for five seconds, it recovers 10,000 health per second.*\n\nA boss-tier regeneration rate. Potions alone wouldn't carry Grid through an extended fight.\n\n*Does he have enough sustain? The vampire ring? Recovery accessories?*\n\nHaster had questioned Grid's judgment at the start of this battle, but not his raw power. Grid ranked among the absolute best. Still, Haster harbored one private hope:\n\n*Maybe he'll get desperate enough to summon Piaro.*\n\nThe air grew heavy. Spectators held their breath as Grid and the clone advanced one step—\n\n—and retreated one step.\n\nGod Hands, Noe, Randy, the Sword of Light, and the Blade Aiming at the Gods orbited both combatants. Grid's summons intercepted the clone's God Hands, creating a isolated duel. Tension crystallized.\n\n*Gulp.*\n\nThe sound rippled through the crowd. Neither fighter reacted.\n\n\"Pagma's Swordsmanship!\"\n\n\"Pagma's Swordsmanship.\"\n\nGrid struck first, lunging forward with a thrust. The clone rotated left.\n\n\"Kill!\"\n\n\"Wave.\"\n\nKill boasted superior damage, but Grid immediately grasped the clone's tactic. Wave's motion perfectly countered Kill's trajectory. The clone slipped inside Grid's guard and unleashed the energy wave. Grid, locked in Kill's recovery frames, took the hit full-force.\n\n\"Now...!\" The clone pressed the advantage, reading the opening in Grid's defense. It ignored Grid's Link and drove straight into Pinnacle—the unavoidable strike.\n\nThe Enlightenment Sword's power matched Grid's own attack. Even with Lantier's Cloak and Valhalla of Infinite Affection, Pinnacle would deal catastrophic damage.\n\n\"Kugh!\" Grid crumpled, health plummeting. The clone calculated—perfect artificial intelligence processing every variable—and thrust forward with Kill, aiming for the heart.\n\nThe blow would be lethal.\n\nIf it landed.\n\n\"Wave!\" Grid twisted, using the same counter the clone had demonstrated moments before.\n\n\"...!\" Instead of Kill piercing Grid's chest, Wave crashed into the clone, staggering it backward. Without armor, even Wave's lower damage became dangerous. The clone's expression shifted. *Grid's timing. The counter shouldn't have worked. He adapted?*\n\n\"Link!\" Grid's voice cut through its confusion.\n\nThe flurry of strikes hammered into the clone before it could recover.\n\n\"Pinnacle!\"\n\nThe clone failed to evade. Grid's blade carved through its chest, blood spraying. Two crimson tails manifested behind Grid as Cray's Strength activated through the Rune of Darkness. One hundred percent of the damage converted to health—so much that the excess formed a second tail beyond Grid's maximum capacity.\n\n\"What's wrong?\" Grid's two-tailed form loomed over the wounded clone. \"If you don't want to die like this, come on!\"\n\n> [The target has been destroyed!]\n\n\"...?\"\n\n> [You have won the fight against yourself!]\n\nThe notifications materialized unbidden. The clone—armorless, defenseless—couldn't withstand Grid's assault. It fell.\n\n\"N-No...! One more!\" Grid reached toward the collapsing figure.\n\n\"...End.\" The body that wore Grid's face dissolved into gray ash.\n\n> [You have succeeded in clearing the 41st island!]\n> \n> [Mission Clear Reward: +1 Skill Level Point acquired.]\n> \n> [You have overcome your limitations and moved one step closer to becoming a Legend.]\n> \n> [Hidden Piece of Pagma's Descendant acquired: **'Sealed Ability'**]\n\n\"...??\" Déjà vu washed over Grid. These notifications—hadn't he seen this exact sequence years ago in the Behen Archipelago?\n\n\"Don't tell me...\"\n\n> [Passive skill **'Blacksmith's Eyes'** acquired.]\n> \n> [Passive skill **'Blacksmith's Eyes'** already exists in skill list.]\n> \n> [.....]\n> \n> [Analyzing...]\n> \n> [Please wait...]\n> \n> [Rewards deemed insufficient. **'Blacksmith's Eyes'** will evolve into **'Code Name 214098 Eyes.'** For intuitive understanding, and in accordance with Satisfy's history and lore, skill name will be updated to **'Eyes of Pagma—Baal's Contractor Version.'**]\n\n\"What the hell...\" Grid stared at the windows, reading them twice, then three times. Nothing made sense.\n\nMeanwhile, at S.A. Group headquarters, the operations team descended into chaos."
}