{
  "id": 91,
  "title": "Chapter 91",
  "content": "# Chapter 91\n\n> [Critical!]\n> [The Best Gauntlets' option effect is activated, causing you to attack the target twice.]\n> [You have dealt 77,311 damage to the target.]\n\nMalacus staggered backward, his robes billowing. \"Kuaaaaak! This is ridiculoussss!\"\n\nThe priest's inhuman screech echoed through the chamber. He had endured the coordinated assault of multiple rankers, had clawed his way to the brink of victory with his final counterattack. And now, at the very last moment, his ankle had been caught. Unfair. It was utterly unfair. Malacus greeted death with that bitter thought burning in his mind.\n\nThe notification windows exploded across Grid's vision.\n\n> [You have defeated the Sixth Servant Malacus, who spread fear through the world!]\n> [Reputation throughout the continent will rise by +3,000.]\n> [The Yatan Church will be forever hostile to you.]\n> [Affinity with the Rebecca Church has increased by +2,800. Visiting a Rebecca Temple will give you great blessings.]\n> [Affinity with the Dominion Church has increased by +1,500. Visiting a Dominion Temple will give you great blessings.]\n> [Affinity with the Judar Church has increased by +800. Visiting a Judar Temple will give you great blessings.]\n> [The power of the Yatan Church is extremely weakened after losing a priest. Until a new priest is elected, there will be no further expansion of its forces.]\n> [The party leader 'Jishuka' has acquired 382 gold.]\n> [The party leader 'Jishuka' has acquired 8 blessed weapon enhancement stones.]\n> [The party leader 'Jishuka' has acquired 10 blessed armor enhancement stones.]\n> [The party leader 'Jishuka' has acquired 3 high rated magic stones.]\n> [The party leader 'Jishuka' has acquired Malacus' Cloak.]\n> [The party leader 'Jishuka' has acquired Malacus' Mask.]\n> [The party leader 'Jishuka' has acquired the Dark Magic Orb.]\n> [1,531,050 experience has been acquired.]\n> [Your level has risen.]\n\nGrid's eyes scanned the cascade of rewards. Tremendous fame. Massive religious affinity gains. A level up. Everything was perfect.\n\nEverything except one detail.\n\nHis face went pale. Sweat broke out across his forehead. He dropped to a sitting position, legs suddenly unable to support his weight.\n\n\"I...\"\n\nThe guild members turned toward him.\n\n\"I?\"\n\nEveryone stared, anticipation building. They had just cleared an impossible raid. What would Grid say? What insight would the man who had delivered the killing blow offer?\n\nGrid's voice cracked. \"I... Items...\"\n\n\"Items?\" Jishuka tilted her head.\n\n\"The party leader was set to acquire the items!\" Grid's hands trembled. He jabbed a finger toward Jishuka, his voice rising to a shout. \"How could I make such a mistake? Hey, Jishuka! Were you lying to me? You said the items would be split in half! But what's this? Are you trying to trick me? I never thought that top rankers would try to cheat a low-level user like me!\"\n\nSilence.\n\nThe wild look in Grid's eyes swept across the group. He had devoured everything after the two-person raid with the Guardian of the Forest. Now terror gripped him at the thought that Jishuka might do the same. His paranoia was a living, clawing thing.\n\nJishuka studied Grid with a complicated expression. She had been amazed when this Level 95 user landed the finishing blow on Malacus. Her heart had pounded during that desperate reversal, when despair transformed into hope. Grid had looked like something out of a movie.\n\nNow? Her pulse returned to normal.\n\n*Ugly.*\n\nThat was the only word for it. Jishuka's desire to recruit Grid for the guild hadn't diminished. A hidden class user with exceptional blacksmithing skills *and* combat potential? He was far more valuable than the creator of those Special Jaffa Arrows they'd spent so long searching for. But his personality...\n\n*Does it matter if his personality is good? All we need is his ability.*\n\nShe made her decision. Jishuka's voice came out calm and reassuring. \"Of course I will keep the promise. Don't worry.\" She paused. \"By the way, it is great. You managed to finish off Malacus.\"\n\nThe other guild members joined in with forced enthusiasm.\n\n\"You are really something!\" Toban laughed, the sound slightly strained. \"How is your attack power so high despite your low level? It is more than Vantner and me combined. Hahaha! G-Great!\"\n\n\"If it wasn't for Grid, this raid would've surely failed.\" Zednos nodded. \"I am impressed with your performance.\"\n\n\"Awesome...\" Laella's eyes shone.\n\nThe young global star was still young enough to be swept up in the drama. To her, Grid seemed like a movie protagonist. Her cheeks flushed red as she watched him.\n\nGrid ignored them all. *Are you trying to make me relax so you can take the items? Right? Dammit! Do you think I will fall for such a thing? How rotten!*\n\nHe crossed his arms. \"Don't hold out on me! Let's distribute the items first.\"\n\n*Ugly.*\n\nThe word echoed in multiple minds. The atmosphere cooled like water thrown on hot coals. Jishuka pulled up the item information and shared it with all party members.\n\n<span class=\"rarity-unique\">Malacus' Cloak</span>\n\nRating: Unique  \nDurability: 35/81  \nDefense: 15\n\n* **Intelligence +200**\n* Bloody smell.\n\n*A magic cloak that Malacus liked. It was originally a cloak made of blue cloth, but it became discolored by the blood of many virgins.*\n\nUser Restriction: Level 200 or higher.  \nWeight: 10\n\n**[Bloody Smell]**  \n*It always gives off a bloody smell. It is easy for the wearer to become a target of beasts and monsters, and makes other people offended.*\n\n---\n\n<span class=\"rarity-unique\">Malacus' Mask</span>\n\nRating: Unique  \nDurability: 11/20  \nAll Attributes Resistance: +5%\n\n* Reduces magic casting time by 20%.\n\n*A black mask used by Malacus. There are no special features regarding its appearance, but Malacus treats it like a treasure.*\n\nUser Restriction: Level 200 or higher.  \nWeight: 1\n\n---\n\n<span class=\"rarity-unique\">Dark Magic Orb</span>\n\nRating: Unique  \nDurability: 90/130  \nMagic Damage: +14%  \nDark magic attack power: +20%  \nNumber of spells that can be stored: 4\n\n*A powerful orb used since before Malacus was appointed as Yatan's servant.*\n\nUser Restriction: Level 200 or higher. More than 500 intelligence.  \nWeight: 80\n\n---\n\nThe Tzedakah Guild members leaned in, examining the stats.\n\n\"The options of the mask is very good,\" Zednos murmured.\n\nLaella nodded. \"Just raising the resistance of all attributes by 5% and the shortening of magic casting time is great. They are rare options.\"\n\n\"It is great that a mask has these options.\" Toban rubbed his chin. \"Almost no masks have options. People treat masks as simple accessories.\"\n\n\"The orb isn't a joke either,\" someone added.\n\n\"The magic damage is low for a unique rating, but the rise in dark magic is huge. And four spell storage slots...\" Regas whistled.\n\n\"Don't orbs usually store only two or three spells?\"\n\n\"Just being able to store three spells is a scam. But four spells...\"\n\nJishuka studied both items carefully. \"It will be too bad to sell both items. Our guild members should use it.\"\n\nThe Tzedakah Guild only had two magicians. Laella, the second-ranked mixed magician. Zednos, the first ranked wind magician. Logic dictated that the mask and orb should go to them. But they had promised a 5:5 distribution with Grid. One item would have to be surrendered.\n\nGrid's voice cut through their deliberations. \"I want the cloak.\"\n\n\"Eh?\"\n\nMultiple heads whipped toward him. Confusion rippled through the group. The cloak was clearly the least valuable of the three items. Yes, it provided **+200 Intelligence**, but the Bloody Smell option was a massive disadvantage. Finding a better cloak wouldn't be difficult at all.\n\nSo why?\n\n*What? Is he yielding the good items to us on purpose? His personality doesn't seem like that.*\n\n\"What?\" Grid's suspicious glare swept the group. \"It isn't possible? I want the cloak. Even though you fought him, didn't I finish him off? Honestly, the raid would've failed if it wasn't for me. But why aren't you giving me my choice?\"\n\n\"Grid...\" Regas stared at him.\n\nThe martial artist's jaw clenched. He wanted to speak up, to tell Grid the truth. That the cloak was the least valuable item. That Grid should choose something else. But fear held his tongue. Fear of damaging the guild's chances of recruiting this valuable user. His face flushed red as conscience warred with responsibility.\n\n*I have to tell him the truth.*\n\nThe internal struggle lasted several minutes. Finally, Regas opened his mouth.\n\nBut Jishuka spoke first. \"Among the three items, the value of the cloak is the lowest. Do you still want to choose the cloak?\"\n\nRegas's tension drained away. He smiled at his guild master with pure gratitude.\n\nGrid, meanwhile, frowned in puzzlement.\n\n*Why is the value of the cloak the lowest?*\n\nHis perspective diverged completely from the Tzedakah Guild's assessment. They saw the Bloody Smell debuff as crippling. Grid saw opportunity.\n\n*Doesn't Bloody Smell make it easier to hunt monsters? If so, isn't the value of the cloak as good as the mask?*\n\nIt was a rare moment of genuine insight. Evidence that Grid was growing, developing beyond his initial narrow worldview.\n\nWhy didn't the Tzedakah Guild share his perspective? The answer was simple. They were top rankers. Grinding normal mobs for experience was beneath them, inefficient. Their focus lay in hunting powerful boss monsters as a team, refining combat skills and coordination.\n\nGrid lived a different reality. As a blacksmith who needed levels, he cared about hunting efficiency above all else. Solo grinding was his bread and butter. The Bloody Smell effect would be a godsend for his playstyle.\n\nTwo worldviews. Two valuations. A transaction that would satisfy both parties.\n\n\"I still want the cloak,\" Grid said firmly.\n\nJishuka nodded. \"Then we will choose the mask first. What about the orb? If possible, we would like to have it as well.\"\n\n\"Only if you give me money.\"\n\n\"Okay. We'll give you gold equivalent to half the value of the orb.\"\n\nMalacus was a special boss. Unlike respawning field or dungeon bosses, he died permanently. No market precedent existed for pricing his drops.\n\n\"In this case, we have to use the auction house.\" Jishuka explained the process. \"We will register it for 48 hours then cancel it at 47 hours and 59 minutes.\"\n\nGrid's suspicion flared again. \"Don't you have to pay a fine if you cancel the registration of an auction item right before it is over? The fine... Do I have to pay it?\"\n\n\"We are willing to pay that much.\"\n\n\"Um... Then the division of the enhancement stones and magic stones...\"\n\nGrid's mind churned through calculations. Blessed enhancement stones sold for 1,200 gold each. High rated magic stones went for 4,000 gold. Eighteen enhancement stones plus three magic stones totaled 33,600 gold...\n\nBefore he could finish his mental math, Jishuka did something unexpected. She held out all the enhancement stones and magic stones toward Grid.\n\n\"... Eh?\"\n\nJishuka's smile could have lit up the cave. \"The raid would've failed if it wasn't for you. Shouldn't this belong to you?\"\n\nGrid stared. That beautiful face, framed by dark hair, smiling with genuine warmth. For a moment, he forgot to breathe.\n\n\"Let's split up and meet again in three days,\" Jishuka continued. \"I will hand you the prepared gold then.\"\n\n\"Y-Yes... Okay, I understand.\"\n\n\"Grid, I have a lot of things to do today.\" Regas clapped him on the shoulder. \"So let's take a break and look for your stolen item tomorrow.\"\n\n\"Regas, you'll still help me?\"\n\n\"Of course! I promised to help, so I should see it through to the end! Then I'm going!\"\n\nThe Tzedakah Guild members filed out of the temple ruins. Their footsteps faded into the distance, leaving Grid alone in the aftermath of battle.\n\n\"Hrmm.\"\n\nGrid turned his attention to the cave mouth where Malacus had emerged. The dark entrance beckoned.\n\n*What was he doing in here?*\n\nTreasure, perhaps. Hidden items. Secrets.\n\n\"Heh... This cave stimulates the instincts of a treasure hunter.\"\n\nGrid's experience with the Northern End Cave still burned fresh in his memory. Pagma's Rare Book. A legendary class from a random cave exploration. Lightning could strike twice, couldn't it?\n\n*Surely there isn't anything dangerous after Malacus is gone?*\n\nGrid crept into the cave. It was smaller than expected. Torches lined the walls, their flames casting dancing shadows across rough stone.\n\n\"Eh?\"\n\nTen steps. That was all it took.\n\nThe cave opened into a small chamber. Chains hung from the walls. And there, bound in silver restraints, sat a woman with flowing hair.\n\n\"Ah, this is what happened.\"\n\nThe pieces clicked together in Grid's mind. He had crafted the Divine Shield. Malacus's subordinate had stolen it. During the chaos at Winston Castle, with soldiers dying and Grid making his dramatic entrance, someone had been captured.\n\nLady Irene.\n\n\"Um...m?\"\n\nIrene stirred at the sound of his voice. Her eyes fluttered open. Recognition dawned. Then relief flooded her features, and tears began to stream down her face.\n\n\"It was you... The one who helped Doran and saved me... Now you saved me again...\"\n\n*Doran? Was the one Doran wanted to save Irene?*\n\nUnderstanding crystallized. Grid opened his mouth to speak.\n\nThe notification window appeared.\n\n> [A quest has been created.]\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG:** Glossary Link.  \n**Current schedule:** 20 chapters a week.  \n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}