{
  "id": 911,
  "title": "Chapter 911",
  "content": "**Chapter: Aftermath and New Horizons**\n\nThe dust had barely settled from Grid's clash with the clone when Singuled sought out the Murray King for one final conversation.\n\n\"Thank you, Your Majesty. For everything.\" The former Red Knight's voice carried the weight of eleven years. \"Your grace... I'll carry it with me until my last breath.\"\n\nThe young king felt his throat tighten. He'd known this day would come, had dreaded it, but Singuled had already made his choice. A decade of shared meals, quiet conversations in the garden, chess games that stretched into dawn—all of it was ending. The king wanted to ask him to stay, to fight for Murray, to make this place his home forever.\n\nInstead, he simply said, \"Take care of yourself.\"\n\nHe tried to smile the way he had on that first day—when he'd found Singuled bleeding in the forest, barely clinging to life. The smile of a king too small to hold onto everyone he wished to protect.\n\nSinguled saw through it. How could he not? This man had saved him when the empire cast him aside like a broken tool. When Singuled finally admitted his past—that he'd ridden with the Red Knights during their campaign against Murray—the king had waved it off with infuriating kindness.\n\n*\"That was yesterday,\"* the king had said. *\"Today, you're my guest.\"*\n\nThe memory surfaced unbidden. Singuled had tried to leave a dozen times those first few months.\n\n\"Your Majesty, once my wounds heal, I should go.\"\n\n\"Why?\"\n\n\"Because the empire *will* find me. And when they do, you and your people will pay the price.\"\n\nThe king had leaned back in his chair, studying him. \"Only if someone tells them. My people aren't for sale.\"\n\nSinguled had almost laughed. \"Every noble has a price. The empire's coffers run deep, and their reach is longer. It's only a matter of time.\"\n\n\"My subordinates don't hunger for gold or power. We're bound by something stronger—trust.\"\n\nHow naive that had sounded. How impossibly naive. Hundreds of nobles, each with their own agendas and appetites, united by trust alone? Singuled had prepared himself for betrayal, had kept his sword arm ready, expecting imperial agents at any moment.\n\nEleven years. Not once had anyone come.\n\nThe Murray Kingdom defied everything Singuled understood about power and loyalty. Here, a baker spoke to the king without trembling. Here, nobles served the crown instead of their own ambitions. It was nothing like the empire—that nest of vipers where paranoia was wisdom and conspiracy was currency.\n\n\"Your Majesty.\" Singuled's voice softened. \"When I've settled my accounts... if I'm still breathing... I'll come back. This is my home now.\"\n\nHe needed answers. Needed to understand why the empire had discarded him. Needed to look his betrayers in the eye. The path ahead ended in only two ways: the empire's fall, or his own grave. The smart money was on the grave. Empires that had ruled for centuries didn't topple easily.\n\nThe king gripped the balcony railing, knuckles white. He wanted to grab Singuled by the shoulders and refuse to let him walk into that darkness. But he'd learned long ago that some choices belonged to other men.\n\nInstead, he thought of the black-haired figure he'd watched from these same walls during the battle—the one they called the Overgeared King.\n\n*Please,* he prayed silently. *Keep him safe.*\n\nThe birth of the Overgeared Kingdom had terrified him initially. A new power meant a shattered status quo, and the empire would never tolerate that. War would sweep the continent. Blood would flow in the streets.\n\nBut reality had proven stranger than fear. The Overgeared Kingdom had grown into a genuine counterweight, its strength forcing the empire to pause. Small nations like Murray—places that had been slowly suffocating under imperial \"protection\"—could finally breathe again.\n\n\"Send an envoy to the Overgeared Kingdom,\" the king ordered once Singuled had departed.\n\nHis advisor frowned. \"Are we demanding reparations for the damage to the capital?\"\n\n\"No.\" The king turned from the window. \"We're done being an imperial tributary. It's time we made some actual friends.\"\n\nBaron Cudan had tried to tell them months ago, after attending the Overgeared Kingdom's founding ceremony. He'd returned bug-eyed and babbling about soldiers who fought like knights, about power beyond comprehension. At the time, it had seemed like exaggeration.\n\nNow, after watching what a single Overgeared soldier could do—after seeing their king and nobles tear through the capital like a storm—the words made perfect sense.\n\nThe Overgeared Kingdom wasn't just hope. It was the future.\n\n***\n\n*This is going to be awkward.*\n\nHaster walked a few steps behind Asmophel and Singuled, reading the tension in their shoulders, the careful distance they maintained from each other. Asmophel moved with military precision, eyes forward. Singuled glared at him like he was something scraped off a boot.\n\nHaster had his own reasons for being here. His class quest required defeating a former Red Knight—only then would the full skillset of a Red Sage unlock. But going in blind against warriors of their caliber was suicide. The plan was simple: let Asmophel and Singuled clash first, analyze the combat data, then issue his challenge.\n\nSimple in theory. Complicated by the fact that neither man seemed inclined to cooperate.\n\nThe silence stretched like a drawn blade.\n\n*I could just attack him,* Haster mused. *But antagonizing Master's former colleagues seems like a bad long-term investment.*\n\nBesides, Asmophel had already decided they were heading to the Overgeared Kingdom first. Which meant Haster's detour had become a sightseeing trip.\n\nNot that he minded.\n\nSeven years. Seven years he'd spent in the mountains, grinding through the same training regimen with monastic discipline. While Grid and Kraugel were out having adventures, collecting titles, making headlines—Haster had been doing push-ups and practicing forms until his hands bled.\n\nThe media kept calling the Overgeared Kingdom vibrant, revolutionary. Was it hype? Exaggeration? He'd find out soon enough.\n\n*My first real adventure.* The thought made him grin.\n\nGrid, Kraugel, Agnus—the other Five Miracles had experienced *Satisfy* in all its chaotic glory. They'd tasted victory and failure, formed bonds, made enemies, discovered secrets. Haster had experienced... discipline. Repetition. The soul-crushing monotony of perfecting his craft without distraction.\n\nHe'd wanted to quit more times than he could count. But quitting wasn't in his vocabulary.\n\nNow, finally, he was a Red Sage. The grind had been worth it.\n\n*Though I doubt Grid and Kraugel had it any easier. Everyone's path is hard. Just different flavors of hell.*\n\nHaster prided himself on objectivity. He didn't need to diminish others to validate himself. Grid's performance against the clone had been... impressive. More than impressive. The man who'd fumbled through last year's National Competition had evolved into something formidable.\n\n*Let's be honest. If we fought right now...* \n\nHe ran the numbers in his head. Thirty percent? Too generous. Twenty? Still optimistic.\n\nTen percent. That was his realistic win rate against current Grid.\n\n*And that's assuming he showed everything against the clone.*\n\nWhich was unlikely. Grid had held back—Haster had caught glimpses of unused skills, techniques kept in reserve. Just like during the PvP finals of the 3rd National Competition.\n\n\"Hey.\"\n\nHaster snapped back to the present. \"Yes?\"\n\nSinguled was looking at him like he'd grown a second head. \"What's so funny?\"\n\n\"Was I smiling?\" The question caught him off-guard. He must've looked like an idiot, grinning to himself on the road. \"Sorry. I think I just found a new rival.\"\n\nHistory was full of legendary pro gamers—titans whose records defined eras. One particular Korean FPS legend was even admired by the Overgeared Kingdom's god of death. But legends, for all their glory, still tasted defeat. Still experienced doubt. Still fell short sometimes.\n\nHaster's career had been different. No losses. No setbacks. No humbling moments. In FPS games, he wasn't a legend.\n\nHe was a myth.\n\nThe image of Kraugel, which had occupied half his thoughts for months, flickered. Faded. In its place, Grid's black-haired figure solidified.\n\n*I'll catch up,* Haster promised himself. *And one day, I'll surpass you.*\n\nNot to humiliate. Not to dominate. Just to see if he could. To push the boundaries of what was possible.\n\nHe didn't realize the irony. Kraugel—the man he'd defeated with relative ease—was intimately familiar with failure. Kraugel had learned that defeat was fertilizer for growth. But Haster, who'd only ever won, had mistaken Kraugel for someone like himself: a genius who'd never truly struggled.\n\nThe misunderstanding would cost him. Eventually.\n\n***\n\n**The Grave of the Three-Eyed Monsters**\n\nKraugel opened his eyes slowly, the meditation broken. Around him, hundreds of corpses were already dissolving into light. The stone blades that had erupted from the earth retracted silently.\n\n\"Ten percent.\"\n\nThe barrier that had blocked his progress for three months—the one Red Sage Haster represented—had finally shattered. The respawning monsters died before they could even roar, sliced apart by invisible earth techniques.\n\nInstant annihilation.\n\nThe sky above, which had seemed so impossibly far, was finally coming into reach again.\n\nThe fallen would rise. Slowly. Surely.\n\nBut they *would* rise."
}