{
  "id": 912,
  "title": "Chapter 912",
  "content": "\"Knight of Destruction Singuled. I greet you.\"\n\nSinguled froze. That name—his name—had become a curse word, forbidden in the empire. Who would dare speak it aloud?\n\nWhen Asmophel had brought him to the Overgeared Kingdom, he'd expected many things. Not this. The woman before him stirred something in his memory. Those penetrating eyes, sharp enough to cut through lies...\n\nRecognition dawned. \"Mercedes?\"\n\nImpossible. The girl who'd once served at Captain Piaro's side, all youthful loyalty and fierce dedication—she'd grown into this striking figure? What was a knight of the empire doing in enemy territory?\n\n\"I'm honored you remember.\" The white-haired beauty's lips curved slightly.\n\nSinguled's confusion ignited into rage. \"That bastard Asmophel!\" His sword cleared its sheath in one fluid motion. \"This was a trap all along!\"\n\nHe'd spent years gathering intelligence from Murray. Mercedes had risen to First Knight of the Red Knights—the empire's prized hound. Which meant... \"The truce between the empire and Overgeared was nothing but theater! This kingdom serves the empire!\"\n\nKilling intent rolled off him in waves.\n\n\"Actually,\" Mercedes said calmly, \"I serve the Overgeared King.\"\n\n\"What?\"\n\nThe absurdity of her claim threw cold water on his fury. Asmophel stepped forward. \"It's true. She left the Red Knights.\"\n\n\"You expect me to believe that?\" Singuled's voice dripped venom. \"Mercedes, the empire's legendary knight, abandoned everything? For what?\"\n\n\"You doubt me?\" \n\nA new voice, weathered and warm. Singuled's breath caught.\n\nPiaro emerged from the shadows, and suddenly Singuled was a young knight again, standing before his mentor. His sword clattered to the ground.\n\n\"You've gotten old,\" Piaro said gently.\n\n\"Captain!\" \n\nAll the years, all the suffering, all the nights spent plotting revenge—it crashed over Singuled like a tidal wave. The feared Knight of Destruction who'd slaughtered armies without mercy crumbled. His knees hit the earth, and Piaro caught him.\n\n\"You've endured so much,\" Piaro murmured. \"More than anyone should bear.\"\n\nSinguled wept. Great, heaving sobs tore from his chest. Piaro held him steady, watching the sun bleed red across the horizon, his own eyes gleaming with moisture. Asmophel stared at his boots, unable to witness what he'd wrought. Mercedes felt the weight of their shared history settle on her shoulders like winter frost.\n\n***\n\n[The goddess's blessing has been used.]\n\n[(Fighting against the Gods) Legendary Blacksmith's Craftsmanship Skill has been enhanced.]\n\n[(Fighting against the Gods) Legendary Blacksmith's Craftsmanship Skill has evolved into (Genuine - (Fighting against the Gods) Legendary Blacksmith's Craftsmanship Skill.]\n\n[Genuine - (Fighting against the Gods) Legendary Blacksmith's Craftsmanship Skill]\n\n[The production button has been enabled, and the time required to craft items is greatly reduced.\n\nMinimum item quality: **Epic**\n\nHigh probability of **Unique** rated items.\n\nCertain probability of **Legendary** rated items.\n\nRare probability of **Myth reproduction** or **Myth** rated items (conditions must be met).\n\n* All stats of crafted items increased by **30%**.\n\n* Upon creating **Myth** rated items: All stats permanently increase by **+20**, continent-wide reputation increases by **+1,000**.\n\n* Special events occur every **three Myth** rated items created.\n\n* Enhanced skill is fixed at **Master** level.]\n\n*Ttang!*\n\nThe hammer's ring echoed through Grid's smithy. He'd resisted the seven malignant saints, cleansed the First Holy Sword, and claimed two divine blessings. Now, gripping the Blacksmith Hammer to Go Against the Gods, he stood at the threshold of something revolutionary.\n\nAuto production.\n\nHis hands trembled—not from fear, but anticipation. Every other blacksmith in Satisfy could do this. Hell, it was standard functionality. And he'd never known it existed.\n\nGrid pulled up the production interface, selected a basic Grid Set piece from his catalog, arranged the materials, and clicked the floating button.\n\n[Item production has started.]\n\n*Ttang! Ttang! Ttang!*\n\nHis body moved. Not under his command—by itself. His hands stoked the furnace to perfect temperature, fed in the ore, retrieved it at the precise moment, and began hammering. Each movement flowed into the next with mechanical precision.\n\n*Ttang! Ttang! Ttang!*\n\nGrid stood there, stunned, while his body worked. No mental calculations for fire temperature. No second-guessing his hammer strikes. No agonizing over quench timing. His body simply... knew. Hours and days of exhausting crafting sessions, reduced to automatic execution.\n\n'This is what everyone else experiences?'\n\nA laugh bubbled up. All this time, other blacksmiths had lived in paradise while he'd sweated blood over every detail. His body hammered away while his mind floated free, unburdened.\n\nBut Grid hadn't become legendary by slacking.\n\n'If my body's busy, my mind should be too.'\n\nHe dove inward, into the mental space Belial's Staff had unlocked. Triple casting—three spells woven simultaneously. Most mages struggled with double casting. Triple was theoretically possible but practically impossible for anyone without divine-tier mental processing.\n\n'Magic Missile, Wind Cutter, Fireball.'\n\nSimple. Three names. Think them together.\n\n'Magic Missile, Wind Cutter, Bean Cup—fuck!'\n\n*Ttang! Ttang! Ttang!*\n\nThe hammer's rhythm never faltered, even as Grid's concentration shattered. Sweat beaded on his forehead. His thoughts kept derailing, mixing up spell names, losing track.\n\n'Magic Missile, Fireee... Wind... Magic...'\n\nFrustration built like steam in a sealed pot. His jaw clenched. But he'd built his entire life on one talent: persistence. While others were born brilliant, Grid simply refused to quit.\n\n'Again. Magic Missile, Fireball, Wind Cutter.'\n\nHis lips moved soundlessly. The names blurred together, separated, jumbled. He forced them back into alignment. Failed. Tried again. Failed. Again.\n\nThe hammer sang its steady rhythm while Grid waged war inside his own head.\n\n***\n\nGolden wheat swayed under the afternoon sun. Piaro sat beside Singuled in the vast fields, speaking quietly about the Murray king who'd sheltered his former subordinate. Singuled's emotions churned—gratitude for the truth about Asmophel warring with twelve years of hatred.\n\n\"I still can't forgive him.\" Singuled's voice cracked. \"Every night I see it. The executions. Asmophel's blade pointed at us. My colleagues falling. It never stops.\"\n\nHis hands clenched. \"For twelve years, I've dreamed of killing him. And the emperor. Truth doesn't erase that.\"\n\n\"I'm not asking you to forgive.\" Piaro's hand settled on Singuled's shoulder, solid and warm. \"Asmophel doesn't want forgiveness. But redirect your anger. The empress orchestrated everything. She's our true enemy.\"\n\n\"...\"\n\n\"After we've dealt with her, Asmophel will face whatever judgment comes.\"\n\nSinguled nodded slowly. \"Yes. I understand.\"\n\nWind swept across the fields. Golden wheat rolled like ocean waves. Rainbow potato leaves fluttered, their colors catching sunlight. A hawk dove from the sky, snatched a vibrant leaf, and climbed back into the blue.\n\nHaster watched from a distance. Piaro—the legend Winfred had praised endlessly—radiated quiet power even at rest. During the Belial raid, this former great swordsman had matched Grid blow for blow. As an NPC with steady growth potential, he might even surpass Grid's clone.\n\nHaster's pulse quickened. Fighting someone of Piaro's caliber could trigger a breakthrough. He could reach Grid's level before the National Competition. And if he lost? He'd simply challenge Piaro again until he won.\n\nDecision made, Haster approached.\n\nHis boot touched something soft. A hand clamped around his ankle.\n\n\"Watch where you're stepping.\" A farmer in the corner glared up at him.\n\nHaster glanced down. A delicate blue sprout nestled under his foot. \"My apologies.\" He retreated carefully. As a professional gamer, he'd learned to respect all occupations equally. His time with Winfred had taught him NPCs deserved the same courtesy as players.\n\n\"And now you're stepping on another one!\" the farmer snapped.\n\nHaster jerked his foot back. The farmer rose, anger radiating from him. \"What are you even doing here? Who sneaks around farm fields? You an imperial spy?\"\n\nThe straw hat came off, revealing not an NPC but a player. **Hurent**.\n\nRecognition struck Haster. 'The former Aura Master?'\n\nWhy was a once-famous ranker working fields in the middle of nowhere? Hurent's eyes narrowed with suspicion. \"You're a spy. Creeping toward Piaro like a rat. Imperial assassin, aren't you?\"\n\n\"That's quite a leap.\" Haster raised his hands. \"I'm requesting a duel, not planning murder.\"\n\n\"A duel? You?\" Hurent scoffed. \"Haster? Piaro doesn't waste time on trash.\"\n\n\"Trash?\" Heat flashed through Haster's chest. \"You don't know who I am?\"\n\n\"Why would I need to hear your name twice?\"\n\nThe casual dismissal cut deeper than any blade. Haster had spent years building his reputation as one of gaming's elite. Everyone should recognize his name, his face. But Hurent stared at him with complete indifference.\n\nThen Hurent swallowed the potato he'd been chewing and charged, wielding a *sokuri*—a woven grain basket.\n\nHaster's temper snapped. \"Someone needs to teach you manners.\"\n\n\"Says the assassin trespassing on our fields?\" \n\nRich, coming from someone who'd once invaded this very kingdom. But Haster was done talking. His sword cleared leather as his patience evaporated.\n\nThe *sokuri* hit him like a hammer.\n\n\"...?!\" \n\nPain exploded across Haster's ribs. The basket was light, nearly soundless in flight, but the impact rattled his bones. The trajectory had been impossible to predict.\n\n\"You're one of us—!\"\n\n\"One of who? **Aura Snake!**\"\n\n\"Shit!\"\n\nThe ground trembled. Aura coalesced into serpentine forms, weaving through the wheat. In the distance, Piaro's laughter rolled across the fields.\n\n\"Hurent's volunteering for extra work tomorrow,\" Piaro called out cheerfully. \"What a dedicated farmer!\""
}