{
  "id": 913,
  "title": "Chapter 913",
  "content": "The Growth-type hidden class, Aura Master, pushed the potential of aura to its absolute limits.\n\nHurent's aura transcended mere weapon enhancement or skill amplification. He could freely shape it into any weapon form or release it as a dragon's breath. More than that, he could mark living creatures with aura signatures and manifest his power at those points, creating countless combat variables. An Aura Master knew no bounds. Hurent was *strong*.\n\nYears ago, during the invasion of Reidan, he had already surpassed the category of ordinary players. Back then, the S.A. Group had assessed his strength as equal to Kraugel's—several times higher than Grid's at the time. Hurent was one of the five individuals Lim Cheolho called the Five Miracles.\n\nBut then came the 1st National Competition. Grid had achieved explosive growth, and Hurent—whose Aura Master class remained incomplete—fell in a pathetically brief exchange. His reputation never recovered.\n\nIn truth, Hurent's popularity belonged to Satisfy's early days. Now? Now he was forgotten. Few remembered the man who'd vanished from the rankings years ago. Those who did recalled him only as \"that five-seconds guy.\"\n\n\"You're the same as us—!\"\n\nYet Hurent's strength remained. No—he'd grown several times stronger. When Haster said \"us,\" he meant himself, Grid, Kraugel, Agnus, and the other apex players.\n\n\"Who's 'us'? Aura Snake!\"\n\nYears ago, Hurent had fought Piaro and been conscripted into farmwork. Since then, he'd hauled grain and worked the hoe under the scorching sun, forcing extreme growth. His muscle strength rivaled Grid's. His improvisation matched Kraugel's. His ability to control aura like a living thing mirrored Agnus'.\n\nHurent's aura coiled into serpentine form, launched from his fingertips, and wound through the fields. The path it carved through the abundant wheat was nearly impossible to track or predict—an attack that defied evasion or defense.\n\nHaster's exceptional hearing allowed him to raise Ice Curtain and block the snake precisely.\n\n\"You're not trash.\"\n\nHurent hadn't merely worked the fields. The moment each day's labor ended, he'd rushed to hunting grounds to steadily level his aura skills. Now, facing the ice barrier that withstood his 9,900 fixed-damage, defense-ignoring aura, he marveled at its solidity.\n\nHurent studied Haster's name and face carefully. \"You were a professional golfer?\"\n\n\"*Gamer!*\"\n\nIt was a cheap provocation, but Haster couldn't help taking the bait. His excessive pride demanded it. The idol of countless youths, the myth who had never lost—he couldn't brush aside such crude taunts. Unfamiliar with rough handling and unable to overlook the slight, he activated Dance of Redemption.\n\nAnd missed something critical.\n\nThe black mark on his still-maintained ice barrier!\n\n\"...?!\"\n\nAs Haster began forming a stone pillar with Dance of Redemption, his face crumpled. A faint cracking sound emanated from the ice barrier at his flank. Aura sharp as a knife blade erupted from within.\n\n\"Kgh...!\"\n\nHaster managed to dodge but was forced to cancel Dance of Redemption. A missed opportunity to seize control of the fight. As he repositioned urgently, new aura entered his vision.\n\n\"Oh, forgot to warn you ahead of time. My aura leaves marks, so watch your step. The entire ground beneath you is covered with them.\"\n\nDozens of aura threads spread from Hurent like a spider's web. The grey-haired man wore a pleasant expression unbefitting his age—though it was anything but pleasant for Haster, now trapped in the web.\n\n\"Why are you under Grid?\"\n\nFrom Haster's perspective, Hurent was an unexpected variable. He'd never imagined Grid—who already commanded so many renowned individuals—would have a monster like this serving him. More than that, he couldn't understand why Hurent was interfering.\n\n\"No way...!\"\n\nHaster's movements grew increasingly fluid as he deflected aura threads with his shield and struck with his sword. His response speed accelerated as the unique sounds of aura filled his ears.\n\n\"This is Grid's will!\"\n\nHaster recalled certain facts he shouldn't have overlooked: Asmophel was Grid's subordinate. Kraugel was Grid's friend.\n\n'Grid knows about me!'\n\nIt was certain. Grid had learned of Haster's existence through Asmophel and Kraugel.\n\n'He's judged that to maintain his position at the top, he needs to suppress me! That's why he ordered Hurent to interfere!'\n\nHaster smiled as understanding crystallized. Pride swelled within him—the Overgeared King was worried enough to take preemptive action.\n\n\"It feels good! I've finally reached the proper stage!\"\n\nRivals were necessary. The greater the rival, the more his desires and talents would ignite. As motivation burned through Haster, an aura spear thrust toward his flank—emerging from a ground mark. Hurent watched Haster detect the sound and block with his shield.\n\nThen Hurent asked, \"What are you babbling about? You think I'm under Grid? Wrong.\"\n\n\"I already understand the situation! No need to deny it!\"\n\n\"Listen, I'm *not*! Are you going deaf already, young man?\"\n\nHurent seethed at the misunderstanding. He still remembered the humiliation of dying in five seconds. From the standpoint of someone planning eventual revenge against Grid, being called his subordinate was unbearable shame.\n\n\"I'm simply repaying Piaro for his kindness!\"\n\nSnake, spear, sword, thread—the relatively simple forms of Hurent's aura began a special transformation. They coalesced like flames.\n\n[Aura Impact is being used.]\n\n[Accurately imagine the aura's shape within 2 seconds. Even the smallest error will cause skill failure.]\n\nHurent never neglected image training to unleash an aura master's true power! He roared, \"Super! Dragon's Roar!\"\n\n[You have visualized dragon's breath! By reproducing a transcendent being's power, your aura's strength is greatly increased!]\n\n[A unique-rated aura has limitations on the power it can exert.]\n\n\"...!?\"\n\nDespite the rating restrictions, it was still dragon's breath. The aura flames erupted fast and wide—an attack form that rendered Haster's sharp hearing and agility obsolete.\n\n'He can block once or twice, but enduring the sustained pressure is impossible.'\n\nThe dragon's breath had evolved since Hurent last used it. A multi-stage fire skill maintainable for five seconds. Fixed minimum damage of 9,900, with maximum damage scaling to 306,900.\n\nIt didn't matter if the target's defense was 10,000 or 100 million. For players averaging 100,000 health, one direct hit from dragon's breath meant death.\n\n[You have dealt 9,900 damage to the target!]\n\nBut Haster didn't defend. He allowed the breath to strike. An orange shield materialized around his body—Heroic Story, one of the strongest passive defense skills, activating when all conditions aligned.\n\n[All resources have been restored by the passive skill 'Heroic Story.' For one minute, defense increases proportionally to resources consumed in the past two minutes. Additionally, a shield negating all skill and magic damage will be maintained for 10 seconds.]\n\n\"What...?\"\n\nHurent had used aura's mid-to-long range to completely constrain Haster's movements and dominate the battle. Now, for the first time, composure cracked. The dragon's breath he'd poured forth was blocked by the orange shield—it felt like encountering a ghost.\n\n'A skill that nullifies damage?'\n\nNo, such skills typically had defense limits. Even that alone would be overpowered enough—able to completely overturn battles by blocking an enemy's ultimate technique at the perfect moment.\n\n'But his shield has *no* limit...!'\n\nA chill traced down Hurent's spine as he confirmed the orange shield still stood against the dragon's breath.\n\n'An OP shield that nullifies all skill damage for a fixed duration?'\n\nUnreasonable strength. This was certainly...\n\n\"The Seven Malignant Saints...!\"\n\n\"That's right. You haven't obtained it yet? You're behind.\"\n\nSatisfy was terribly fair. Players sacrificed one thing to gain another. Haster realized Hurent had met Piaro and missed the timing to obtain the Seven Malignant Saints quest.\n\n\"The gap will only widen.\"\n\nTime for payback. Haster taunted Hurent before raising his shield and charging.\n\n\"Too shallow!\"\n\nHurent avoided the shield bash by tilting his upper body, preparing to insert an aura thorn. But the thorn developed through Aura Impact failed to penetrate Haster's orange shield.\n\n\"It's over,\" Piaro murmured, watching the fight alongside Singuled. He observed Haster moving through Hurent's aura thorn and swinging his sword.\n\nAt that moment...\n\n\"Hurent used farming tools for swordsmanship development,\" Piaro spoke meaningfully.\n\nHurent dropped the *sokuri* and drew his sword to block.\n\n\"...!?\"\n\nHaster recoiled at the movement. 'What is this defensive form?'\n\nSuch movements weren't possible through reflexes and control alone. Clearly there was a compensation effect from high-level Sword Mastery.\n\n'How high is his Sword Mastery level?'\n\nConfused by this transformed Hurent, Haster forgot... Hurent had been a candidate for Sword Saint!\n\n\"Super Sensitivity!\"\n\n\"What?\"\n\n***\n\nSimultaneously, Grid worked in his smithy...\n\n'...Wait. Can I apply the goddess' blessing to Pagma's Swordsmanship *itself* rather than individual sword dances?'\n\nGrid's blood pressure was rising from triple casting, so he took a break. Then a new idea struck. His ears tingled with the thought. Swallowing curses was nothing new."
}