{
  "id": 916,
  "title": "Chapter 916",
  "content": "Grid tensed the moment he noticed Hurent's expression.\n\n*What's his angle?*\n\nThe man before him was the same player Grid had demolished in five seconds flat. That humiliation should have bred resentment—bitter, festering hatred that demanded revenge. Yet the gaze Hurent fixed on him now held nothing but... admiration?\n\n*This is wrong.*\n\nGrid shifted uncomfortably and looked away, trying to clear his head. Something wasn't adding up.\n\n*Think. Figure out what he wants before making a move.*\n\nHe'd spent the past year learning to use his damn brain. No more rushing in blind. No more stone-headed decisions.\n\n\"Why are you staring at me like that?\" Grid kept his tone casual, but his muscles were coiled. \"Did you hit your head?\"\n\nHurent's eyes sparkled with an emotion Grid couldn't identify. The intensity made his skin crawl.\n\n*I need to understand what he's after.*\n\n\"Huhuhut. No need for pretense between us.\" Hurent's voice carried a strange warmth. \"Oh, but I'm older than you, aren't I? May I speak more casually?\"\n\nGrid blinked. \"Act? What are you—\"\n\n\"I wanted to thank you.\" Hurent bowed—not the perfunctory nod of nobles but a deep, genuine gesture of respect. \"For the past few years, you've shown me incredible grace. Despite knowing I came to your kingdom with... complicated motives, you watched over me instead of interfering. I'm ashamed when I think about how obsessed I was with revenge.\"\n\nThe words hit Grid like a bucket of ice water.\n\n\"...What?\"\n\n\"I mean it.\" Hurent straightened, and his expression was earnest. \"Most rulers wouldn't tolerate a potential threat lurking in their territory—especially one nursing a grudge. But you gave me space to grow. To learn. That kind of magnanimity...\" He shook his head in wonder. \"Grid, your boldness fascinates me.\"\n\nEach word deepened Grid's confusion. Question marks might as well have been floating over his head.\n\n\"You kept watching over me even during my fight in the fields.\" Hurent's smile turned bittersweet. \"I'm grateful for your concern, though I imagine it must have been frustrating to witness. A man you defeated in five seconds, now struggling against farmers... What a thrilling spectacle that must have been.\"\n\n*He's insane.* Grid stared at Hurent as though the man had sprouted a second head. *Completely, utterly insane.*\n\nGrid had been watching him? Protecting him? Giving him opportunities?\n\n*Since when did I—* His gaze dropped to Hurent's dirt-stained clothes, then to the straw hat lying at the man's feet. *Oh. Oh no.*\n\nUnderstanding crashed over him like a wave. His brain, which actually worked now—thank the gods—pieced together the situation in seconds.\n\n*This lunatic has been farming in my kingdom for years. He thinks I knew about it the entire time. When I interrupted that fight, he assumed I was protecting him.*\n\nWhy did this keep happening? Why did people constantly misinterpret his actions?\n\nThough, if Grid was honest... most misunderstandings worked in his favor. If Hurent had assumed the worst instead of the best, the situation could have turned ugly fast.\n\n\"Your Majesty, allow me to explain.\"\n\nGrid nearly jumped at Piaro's quiet approach. The farmer—legendary though he was—had appeared without a sound.\n\n\"Please do.\" Grid's voice came out sharper than intended.\n\nPiaro launched into the full story. After Hurent led Eternal's forces against Reidan, Piaro had recognized potential in the man's aura abilities and recruited him as a farmer. Since then, Hurent had been contributing to the kingdom's agriculture, increasing crop production by twenty percent...\n\n\"Wait.\" Grid held up a hand. \"Naturalized? You mean he became a citizen? He's not here illegally?\"\n\nPiaro fell silent.\n\nThe silence stoked Grid's anger. \"You took an enemy—someone who wanted to harm me—and put him to work in our fields?\" His voice dropped dangerously low. \"Did you want me to get assassinated?\"\n\nGrid trusted Piaro's loyalty without question. The man had nearly died fighting Belial for Grid's sake, had abandoned his personal vendetta against the Empress, had handed over every piece of loot from that raid. But this? This was different.\n\n*He raised my enemy right under my nose.*\n\n\"I have no excuse, Your Majesty.\" Piaro's head bowed. \"The fault is mine.\"\n\nThe admission only fed Grid's frustration. Before it could spiral further, a familiar voice cut through the tension.\n\n\"King Grid, Hurent was under constant supervision.\"\n\n\"Bland.\" Grid acknowledged the magic swordsman—currently more renowned for his potato obsession than his combat prowess. The man was, predictably, chewing on a potato even now.\n\nBland swallowed. \"Piaro commanded me to observe Hurent at all times. If he showed even a hint of betrayal, I was to eliminate him immediately. Every precaution was taken for your safety.\"\n\n\"I made a judgment call,\" Piaro added quickly. \"Hurent lacks the capacity for underhanded tactics. Even if he did raise his blade against you one day, it would be in honest combat. I would have warned you beforehand and explained everything.\"\n\nUnderstanding dawned. Piaro hadn't coveted just Hurent's aura—though the ability to plow dozens of fields simultaneously was certainly valuable. He'd seen potential for growth, correctly predicting Hurent would become an agricultural asset. And he'd stationed guards around the man as insurance.\n\nThe knot in Grid's chest loosened. \"I see.\"\n\nHis disappointment faded, but concern lingered. \"In the future, report everything to me directly. I want to know what's happening in my own kingdom.\"\n\n\"Of course, Your Majesty. Whenever I recruit a new farmer, you'll be the first to know.\" Piaro's renewed vigor was palpable, his loyalty burning brighter than ever. He remained grateful that Grid had reunited him with Singuled, his old friend from the Red Knights.\n\n*...I want to disappear.* \n\nHurent stood apart from the conversation, face burning. The exchange between Grid, Piaro, and Bland had made the situation painfully clear. He'd built an entire narrative in his head based on nothing but assumption and wishful thinking.\n\n*I'm a fool. An absolute fool.*\n\nAny moment now, Grid would mock him for it. Hurent wanted to crawl into a hole and die.\n\n\"Do you resent me?\"\n\nGrid's sudden question startled him. Hurent glanced at Piaro and Bland before answering truthfully. \"It would be a lie to say I held no resentment. But now? I don't hate you. I was defeated because I was weak. Blaming you for that would be pathetic.\"\n\n\"Really?\" Skepticism colored Grid's tone. \"I humiliated you in front of thousands, and you're fine with it?\"\n\n\"I chose seclusion,\" Hurent said firmly. \"I didn't lose my standing because of you—I stepped away to train.\"\n\n\"To beat me?\"\n\n\"Yes.\"\n\n\"But you don't resent me?\"\n\n\"It's a matter of pride, not hatred.\"\n\n\"Hmm.\"\n\nGrid studied Hurent carefully. He'd lived enough lives for several people—debtor and millionaire, despised and admired, weak and strong. That varied experience had taught him to read people, and what he saw in Hurent was sincerity.\n\n*He's genuine. Like me when I used to chase after Kraugel.*\n\n\"I'll give you a chance.\" Grid beckoned. \"We'll fight. Right here, right now.\"\n\nHurent's eyes widened. \"What?\"\n\nThe opportunity had materialized out of nowhere. After preparing himself for exile, this was—\n\n\"No.\" Hurent shook his head, pushing away temptation. \"I can't.\"\n\n\"Why not?\"\n\n\"You saw the man who was here earlier? Haster?\" When Grid nodded, Hurent continued. \"I barely defeated him. An unknown player nearly broke me.\"\n\nHaster possessed the power of the Seven Malignant Saints—no pushover. But that only highlighted Hurent's weakness. He'd lost repeatedly to Bland, a farmer who happened to also be a magic swordsman.\n\n\"Despite years of effort, I'm shamefully weak. It would be absurd for someone like me to challenge you.\" His voice carried bitter acceptance. \"I'm giving up on this dream. I should have done it years ago, but enlightenment came late. Consider it an old man's stubbornness.\"\n\nGrid remembered the Aura Impact that had hammered him during their fight. He remembered Hurent's control, comparable to Hao's precision. That power, refined over years of dedicated training, should have made Hurent one of the strongest players in Satisfy.\n\n*This is wrong.*\n\nThe waste bothered Grid more than he expected. He liked Hurent's straightforward nature.\n\n\"You spent years preparing, and now you want to run away?\" Grid pressed. \"Won't you regret it? Won't there come a day when you wish you could turn back time? Come on. Fight me.\"\n\n\"You're...\" Hurent's nose wrinkled, emotion threatening to overwhelm him. Grid's consideration touched something deep. \"Alright! Let's do it! I'll challenge you!\"\n\n\"Finally.\" Grid grinned. \"Show me what you've learned.\"\n\n**[Aura Impact is being used.]**\n\n**[Accurately imagine the shape of the aura within 2 seconds. If there is even a small error in the image, the skill will fail.]**\n\n\"Aura Thunder!\"\n\n**[You have visualized lightning falling from the sky! By reproducing the power of nature, the power of your aura has been increased greatly!]**\n\n**[There is a limit to the power that a unique rated aura can exert.]**\n\nRed lightning screamed down from the heavens in a blinding flash. Without Super Sensitivity, an ordinary player wouldn't have even registered the attack before dying.\n\n**[You have suffered 9,900 damage.]**\n\n**[You have suffered 9,900 damage.]**\n\n**[You have suffered 9,900 damage.]**\n\n**[You have received an electric shock.]**\n\n**[You have resisted.]**\n\nElectricity surged through Grid's body. The sensation was... exhilarating. Fixed damage that ignored all his carefully accumulated defense and resistance.\n\n*Close to ten thousand per strike!*\n\nHurent was the real deal. No question. Grid felt genuine respect for the man's dedication.\n\n\"**Linked Kill Wave Pinnacle!**\"\n\nThe battle ended in a cascade of steel and lightning.\n\n**[You have suffered catastrophic damage!]**\n\n**[A legend doesn't die easily. You can resist all attacks for 2.5 seconds with a minimum of health.]**\n\n\"...Hah.\" Hurent's shoulders slumped in a painfully familiar way. The same defeated posture from that day, five seconds after their fight began. \"See? I'm weak.\"\n\n\"You lasted twenty seconds this time.\"\n\n\"Haha...\"\n\n\"Besides, you just finished another fight. You weren't at full strength.\"\n\n\"Haaaah...\"\n\n\"...\"\n\nGuilt gnawed at Grid. Hurent didn't deserve to carry this burden of inadequacy—not when he'd clearly grown so much.\n\nGrid extended his hand. \"If you have nowhere else to go, join the Overgeared Guild. We could use a scout.\"\n\n\"A scout?\" Hurent blinked in confusion. \"I already have a job. I'm a farmer.\"\n\n\"Are you serious?\"\n\n\"Completely. I need to learn more from Piaro.\"\n\n\"Learn more? To get stronger?\"\n\n\"At minimum, I need to stop being weak. What's the point of only beating monsters? I can't keep losing to people.\"\n\n\"...Right. Then join as a guild member, at least.\"\n\nHurent was too valuable to let slip away. Grid wouldn't miss this opportunity.\n\n\"Alright.\"\n\nAnd just like that, the Overgeared Guild gained a new member—an event that would shock countless players across Satisfy."
}