{
  "id": 918,
  "title": "Chapter 918",
  "content": "**[Whisper Conversation - Grid → Kraugel]**\n\n**Grid:** How are you?\n\n**Kraugel:** Worried?\n\n**Grid:** About you? The man who conquered the sky? I was just being polite.\n\n**Kraugel:** I'm doing well. Let's skip the pleasantries. What do you need?\n\n**Grid:** I have a question. Are there any minerals in Satisfy suitable for crafting sunglasses?\n\n**Kraugel:** Sunglasses... So you're the one who made first contact with the Evil Eyes' King. Planning to strike a deal?\n\n**Grid:** How the hell...? That's legitimately creepy. You figured that out from *one question*?\n\n**Kraugel:** ...Isn't it stranger that *you're* asking *me* about minerals?\n\n**Grid:** Pagma's knowledge isn't omniscient. I don't know what materials I need until I acquire the recipe.\n\n**Kraugel:** Didn't you recruit an accessories maker recently? Why not ask her?\n\n**Grid:** She lacks experience. You've accumulated more knowledge about Satisfy than anyone alive. Help me out here. If you do this—\n\n**Kraugel:** The Grandmaster's experimental subjects wear black glasses. They're made by processing ether diamonds.\n\n**Grid:** Grandmaster? Experimental subjects? Diamonds?\n\n**Kraugel:** *Ether* diamonds. They can be mined from the Elliter Mine in Talima.\n\n**Grid:** The dwarf city... Will the dwarves grant access?\n\n**Kraugel:** The Elliter Mine has been abandoned for years.\n\n**Grid:** Why?\n\n**Kraugel:** There's a dimensional rift inside. Muller sealed it, but the seal's weakening.\n\n**Grid:** A dimensional rift?\n\n**Kraugel:** A hell gate. Sometimes the 12th Great Demon's *hand* emerges.\n\n**Grid:** ...Hand?\n\n**Kraugel:** It can grab hundreds of dwarves at once. Turns them to dust.\n\n**Grid:** So it's inaccessible right now?\n\n**Kraugel:** Correct. The dwarves won't open it.\n\n**Grid:** Then there's only one way to obtain ether diamonds at the moment.\n\n**Kraugel:** Correct.\n\n**Grid:** National Competition rewards.\n\n**Kraugel:** Good luck.\n\n**Grid:** You too. I hope nobody disturbs your focus.\n\n**Kraugel:** Mocking me? You're several steps ahead this year.\n\n**Grid:** What about next year?\n\n**Kraugel:** We'll stand side by side.\n\nGrid closed the whisper window and stood, a faint smile playing at his lips. *Side by side, not surpassing me? Humble bastard.*\n\nHe felt it clearly—the resurgence of an SSS-class talent, someone fundamentally different from ordinary players like himself. The prospect excited him more than it frightened him. This was the kind of competition that sharpened you.\n\n***\n\nThe S.A. Group headquarters pierced the Seoul skyline like a spear thrust at the heavens. Grid had often wondered what kind of bribes changed hands to approve construction permits for something this obscene.\n\nA limited-edition sports sedan glided to a stop at the lobby entrance—one of perhaps two dozen in existence worldwide. Three years since its release, and the sleek design still turned heads. S.A. Group employees stopped mid-stride, recognizing the vehicle immediately. In South Korea, everyone knew who owned that car.\n\n*Click.*\n\nGasps rippled through the lobby as Shin Youngwoo emerged. The first player-king among two billion users. Even S.A. Group employees treated him like a celebrity.\n\n\"Welcome!\" Yoon Nahee, the operations team manager, approached with practiced enthusiasm. \"I was surprised when you requested a direct visit.\"\n\n\"I wanted to enjoy the fresh breeze.\" Youngwoo smiled disarmingly. \"This is the world's premier company, after all.\"\n\n\"We owe that reputation to dedicated players like yourself.\"\n\n\"*Grateful* to your users? I'm feeling confident about today's negotiations already.\"\n\nYoon Nahee blinked. The awkward, foolish young man from last year had vanished completely. \n\n*He's matured alongside Satisfy itself...*\n\nShe couldn't forget—the man before her was special. More than anyone else. Her smile brightened. \"We've put considerable effort into this contract. You can look forward to it.\"\n\n\"Considerable effort?\" Youngwoo's eyes glinted. \"Does that mean the company's stance on pavranium and divine stone has changed?\"\n\n\"I'm sorry, but... as we stated in advance, pavranium and divine stone cannot be included in the rewards. Pavranium is class-specific with limited acquisition paths. Divine stone is classified as a divine-tier material above adamantium and bloodstone—players can't obtain it yet. You received the contract draft this morning, yes?\"\n\n\"Just confirming. I understand—I can't argue with that reasoning.\"\n\n\"Thank you for understanding. The director will explain in detail, but your rewards are limited to tier-one production materials like last year... You—?\" Yoon Nahee faltered as they approached the elevator. Something about Youngwoo's expression disturbed her—that particularly dark smile spreading across his face. \"What are you thinking?\"\n\n\"Ether diamond. That's my reward.\"\n\n\"...!!\" \n\nYoon Nahee nearly stumbled. Ether diamonds—diamonds encased in ether, the dark matter that absorbed light and magical power. The mineral inherited characteristics from both components, demonstrating exceptional properties under specific conditions. It outperformed adamantium and bloodstone, the representatives of otherworldly minerals.\n\n*But its game rating is technically lower than adamantium and bloodstone.*\n\nStill the finest mineral available to players. The problem was—\n\n\"...How do you know about it? The acquisition path for ether diamonds hasn't been opened yet.\"\n\nThe ether diamond's special properties gave it unique utility—the potential to render rating classifications meaningless. Players shouldn't have access to it yet.\n\n\"Balance is crucial. At this stage, players shouldn't possess ether diamonds.\"\n\nShin Youngwoo understood her concerns perfectly. For instance—\n\n\"Are you worried I'll free the Evil Eyes' King?\"\n\n\"...!!\"\n\n*Ding!*\n\nThe elevator arrived at the 51st floor. Yoon Nahee stood frozen like a statue as Shin Youngwoo knocked on Director Yoon Sangmin's door and stepped inside. His voice drifted back through the closing gap:\n\n\"You made a promise. Up to seven items below a certain *rating* for the demon king project.\"\n\nRating... The S.A. Group had focused on *rating*. That was their mistake.\n\n\"N-No.\" Yoon Nahee stared at the closed door, then frantically pulled out her phone, dialing Yoon Sangmin.\n\n\"What's wrong?\" Fortunately, Director Yoon picked up immediately after greeting Youngwoo. She was in his emergency contacts—he couldn't ignore her.\n\n\"We need to modify the contract!\"\n\n\"What are you talking about? You want to suddenly change thoroughly reviewed terms? This isn't a playground!\"\n\n\"Youngwoo wants ether diamonds!\"\n\n\"*What?* A player already knows about ether diamonds?\"\n\n\"Revise the reward terms before he signs!\"\n\nIt wasn't too late. Youngwoo had just entered. They would've exchanged handshakes. Youngwoo would just now be reviewing the opening clauses. Hope flickered in Yoon Nahee's chest—until Yoon Sangmin's murmur extinguished it.\n\n\"...He's already signed.\"\n\n\"...!!\"\n\nSigned without reading it...?\n\n\"...Ah.\"\n\nRealization struck through her panic. This wasn't Youngwoo's first contract with S.A. Group. Before the 2nd National Competition, he'd signed an agreement and experienced their *reliability* firsthand.\n\n*That's why he requested the draft this morning...*\n\nYoon Nahee hung up and shook her head, half-impressed, half-dismayed.\n\n\"He gets sharper every year. Whatever woman ends up with him is in for a rough time.\"\n\n***\n\n\"It's been a while.\"\n\n\"Good to see you. I've been following your achievements.\"\n\n\"I appreciate that. The contract, please. I assume it matches the draft you sent this morning?\"\n\n\"Naturally. Take your time reviewing it before you... Excuse me, I need to take this call.\"\n\n\"Already signed.\"\n\n\"...What?\"\n\nLess than a minute had passed. Youngwoo smiled as he pocketed the fountain pen—a gift from his father—while Yoon Sangmin struggled to maintain composure as he lowered his phone.\n\n\"You signed without reading it?\"\n\n\"You said the terms were identical.\"\n\n\"You never know...\"\n\n\"Too late. It's signed.\"\n\n\"We could void and reissue if we both agree... No, forget it. What's done is done.\" Yoon Sangmin exhaled slowly. \"I have one question.\"\n\n\"Yes?\"\n\n\"Why take that risk?\"\n\n\"Risk?\"\n\n\"You could've pretended ignorance about ether diamonds, then signed after carefully reviewing everything. Why deliberately mention ether diamonds to Yoon Nahee and create an urgent situation?\"\n\n\"I needed confirmation.\"\n\n\"Of what?\"\n\n\"I wasn't certain whether ether diamonds were more valuable than divine creature byproducts.\"\n\n\"...Yoon Nahee's reaction gave you the answer.\"\n\n\"Exactly. Her honest panic told me everything. That's why I signed immediately.\"\n\n\"I see. Your judgment was sound. The ether diamond... or rather, the Evil Eyes' King you can exploit with it... his value is substantial.\" The evil eyes were an advanced species—incomparably superior to the water clan. Their king could grant Youngwoo power that dwarfed anything the water clan offered. \"This gives you a foundation to challenge the Empire. But remember—it's only a *possibility*. Rewards depend entirely on your performance and that of the four heavenly kings.\"\n\nThe contract stipulated clearly:\n\n**1.** Shin Youngwoo must participate in the 'Demon King Subjugation' event during the National Competition and fulfill the demon king role.\n\n**2.** The demon king's role requires hostility toward and dominance over participating players.\n\n**3.** S.A. Group will provide support to Shin Youngwoo.\n\n**4.** The four heavenly kings refer to NPCs Piaro, Asmophel, Mercedes, and Noll. Duplication is limited to their stats, skills, and items. Personality, memory, and emotion duplication is strictly forbidden.\n\n...\n\n...\n\n**12.** S.A. Group is obligated to compensate Shin Youngwoo whenever accumulated kills at the four heavenly kings' gates increase by 100. Compensation payout occurs at contract conclusion.\n\n**13.** If Shin Youngwoo survives until the Demon King Subjugation event concludes, S.A. Group will provide compensation. Payout occurs at contract conclusion.\n\n**14.** This agreement remains valid through the 4th Satisfy National Competition's conclusion.\n\nNo special privileges. S.A. Group wouldn't grant special skills or items for the demon king role. Youngwoo would fight the entire National Competition roster with his own abilities and duplicated stats from his four subordinates.\n\nIt wouldn't be easy. Once national representatives recognized the event's nature and formed an *alliance*, the odds of defeat would skyrocket. Grid could earn up to seven rewards—more than others could monopolize, but the situation disadvantaged him heavily.\n\n\"Perform well and claim your rewards.\"\n\n\"I appreciate the support.\" \n\nYoungwoo bid Director Yoon farewell and departed for home. The remaining time would be spent upgrading his specifications, crafting new items for his subordinates, and grinding levels. Particularly, he needed to develop Noll, who'd been neglected far too long.\n\n*The National Competition uses a separate server. I can consume creation slots freely.*\n\nThere was a path to victory.\n\n*I'll do whatever it takes to win.*\n\n***\n\n\"Remove them from the reward pool—aside from ether diamonds, eliminate the Stone of Life, the prophet's skull, kelad cloth, and the yangban's mask.\"\n\nYoon Sangmin issued the order after Youngwoo departed. They couldn't modify Youngwoo's separate contract, but gold medal rewards were another matter.\n\n*Youngwoo exposed the blind spots in our compensation structure. He's done us a favor.*\n\nHe tried to think positively, but a sigh escaped anyway. Yoon Sangmin was already dreading the demon king project."
}