{
  "id": 919,
  "title": "Chapter 919",
  "content": "> [You have entered the Vampire's Underground City (7).]\n> [The dungeon entrance is sealed. All contact with the outside world has been severed.]\n> [The dungeon boss detects an intruder.]\n> [The dungeon boss has identified you and immediately withdraws his magic power.]\n> [The dungeon entrance reopens. External barriers have been lifted.]\n> [The dungeon boss 'Noll' calls out to the city's vampires.]\n> \"He is my master.\"\n> [The dungeon vampires are stunned.]\n> [They question whether he surpasses even the farmer in strength.]\n> [The dungeon boss 'Noll' strikes them down.]\n> \"Silence.\"\n> [The dungeon vampires fall quiet.]\n> [You now control the Vampire's Underground City (7).]\n> [This is your first visit since conquering the dungeon.]\n> [Dungeon information updated.]\n\n> **[Vampire's Underground City (7)]**\n> \n> **Rating:** S (Temporarily Downgraded)  \n> **Boss:** Noll  \n> **Monsters:** Vampire Familiars, Low-grade Vampires, Intermediate Vampires, True Blood Vampires  \n> **Monster Respawn Time:** 1-59 minutes  \n> **Acceptable Monster Capacity:** 10,890  \n> \n> *A dungeon where agriculture flourishes thanks to the intervention of a legendary figure. The agricultural development is transforming the dungeon into a 'village.'*\n> \n> *The vampires' hunger remains minimal due to the cultivation of 'blood potatoes.' Under Boss Noll's influence, the city's vampires feel a faint attraction toward humans. Once the village transformation completes, all spawned monsters will become 'NPCs'—your precious people.*\n> \n> ***159 days remaining until village completion.***  \n> ***Pray that as many monsters as possible survive until then.***  \n> ***Monster types may change if the boss is replaced.***\n\n\"What wind blew you here today?\"\n\nThe boy who approached Grid possessed beauty that transcended human standards—a loveliness no mortal words could adequately describe. Vampire Earl Noll. Born directly from Shizo Beriache's body, he now served Grid due to the effects of Grid's *Pangea's Duke of Virtue* title.\n\n> **[Name: Noll]**  \n> **Age:** 221  \n> **Gender:** Male  \n> **Species:** Direct Descendant Vampire  \n> \n> **Title: Fourth Child of Shizo Beriache**  \n> * Inherited Beriache's attribute of compassion  \n> * Can use blood magic with beneficial effects on allies  \n> \n> **Title: Vampire Who Has Overcome the Curse of Idleness**  \n> * Possesses a strong desire for life. Falls below 10% health causes cowardice—loses purpose and fights only to survive  \n> * Possesses a strong desire to broaden horizons. Actively seeks to learn  \n> \n> **Title: A Predator**  \n> * When hungry, true power manifests. Higher fighting energy increases abilities. Current hunger level: 4/10  \n> \n> **Level:** 433  \n> **Strength:** 3,621 (▼) **Stamina:** 2,567 (▼)  \n> **Agility:** 2,310 (▼) **Intelligence:** 3,580 (▼)  \n> \n> **Skills:** Blood Farming (A), Direct Suppression (SS), Blood Transfusion (S), Blood Donation (SS), Blood Magic (S+), Run Wild (SSS)  \n> \n> *Shizo Beriache's beloved child. Beriache treasured the compassion sleeping deep within Noll's heart, hoping he would grant great strength to his brethren and overcome trials alongside them. Despite her wishes, most of his siblings have now departed this world. Noll views Grid—who removed the Curse of Idleness and saved his life—as a replacement for his lost brothers.*\n\n> **[Run Wild]**  \n> All magic cooldowns reduced to 3 seconds. Mana consumption doubled.\n\nNoll was the most exceptional vampire Grid had encountered. Perhaps more remarkable than even his brother, Braham Eshwald. With abilities to heal and empower allies, plus devastating area-of-effect skills, Noll grew stronger in groups than alone—fundamentally different from other Direct Descendants who terrorized humans in isolation. This 'difference' could be a tremendous asset. Grid relied on Noll. He had no doubt the vampire was essential to the Overgeared Kingdom's future.\n\n'His stats are still absurd.'\n\nGrid couldn't suppress a smile when he noticed the new Blood Farming skill. \"Why the cold shoulder after so long apart?\"\n\n\"The problem is you *didn't* come for so long! You...! Do you have any idea what shame and humiliation I've endured these past two years?\"\n\nNoll wasn't wrong. He'd been 219 when they first met; now he was 221. Yet he still appeared as a thirteen-year-old boy, and a vampire's ego remained tied to their physical form. Mentally, Noll was still a child.\n\n\"You never came to see me...!\"\n\n\"...\"\n\n\"After I swallowed my pride to serve a human, you should visit often...!\"\n\n\"...\"\n\n\"I said I'd serve *you*, not that insane farmer! So why...?! Why did you let that crazy bastard...?!\"\n\n\"I'm sorry.\"\n\nGrid grinned and ruffled Noll's hair.\n\n'Piaro isn't evil—don't hate him. He teaches you farming because he wants us to coexist peacefully.'\n\nGrid kept these thoughts to himself. Noll already knew. The boy was simply acting spoiled, wanting his 'brother' to protect him—venting frustration at the 'brother' who'd neglected him.\n\n\"...Bad person.\"\n\nNoll's shouting ceased. His cheeks flushed as the touch reminded him of his mother's hand—the kind, soft, warm touch of the one who watched anxiously as he slept in his coffin. Grid's hand differed from Mother's, but... it wasn't unpleasant.\n\n***\n\n\"What? What insane nonsense are you spouting now?\"\n\nIn a castle adorned with hundreds of coffins, Noll sat across from Grid at a long table. Crimson juice flowed like blood from the potato he was eating—fake blood that provided no true sustenance, yet remained precious food for the seventh city's vampires.\n\n\"Are you a fool?\" Noll's face twisted as he dabbed juice from his mouth with a handkerchief. \"We are vampires. Among them, we Direct Descendants are perfect beings—beyond human comprehension. Yet you dare...\"\n\n\"You're perfect despite sleeping all the time?\"\n\n\"...The Curse of Idleness rendered us incomplete, but I overcame it. One day, I'll destroy the Great Demons and God Yatan who dared insult my mother.\"\n\nThe fury in Noll's voice was genuine.\n\n\"I am complete. Using these trivial tools is an insult!\"\n\nGrid had proposed crafting weapons and armor for Noll, and the vampire bristled at the suggestion. Tools were crutches for weak humans—at least, that's what Noll believed. It explained why the vampires Grid had encountered previously went unarmed. Some wielded 'swords,' but only for amusement. Vampires were apex predators, hunting with natural physical prowess and magic power alone.\n\nGrid, however, saw the flaw in this thinking.\n\n\"Tools are trivial? Says the one who nearly lost his life to 'trivial' tools?\"\n\n\"...!\"\n\nNoll's mouth snapped shut, remembering how close he'd come to death from Grid's sword and the mad farmer's equipment.\n\n\"T-That...\" Face burning, Noll tried to defend himself but found no words. He realized he wasn't perfect, and tools weren't trivial after all.\n\n\"What if you'd worn armor then? Do you think Piaro's hand plow, my sword, and Jishuka's arrows would've beaten you?\"\n\n\"...\"\n\n\"Being overgeared is crucial. It's a concept that makes the strong *stronger*, not just the weak.\"\n\n\"...\"\n\n\"Noll, don't be stubborn. The era when vampires could rely solely on natural abilities has ended. Do you prefer heavy or light armor? Think about which feels more comfortable and answer me.\"\n\nAll the legends had fallen into slumber, and two centuries had passed. The world welcomed new legends, and those who'd reigned during the gap between legends became vulnerable again. The relationship between Grid and Noll embodied this shift.\n\nIn the end, Noll abandoned his stubbornness and accepted reality.\n\n\"...I'd prefer armor like yours. Not—not because I want to look like you or anything.\"\n\n\"Understood. Your weapon will be a shield.\"\n\nGrid's tone remained gentle and careful. His feelings toward Noll were complicated—after all, he'd killed several of Noll's siblings. Vampires and humans thought differently, so Noll bore no grudge. Still, Grid felt remorse.\n\n\"I'll forge you exceptional armor.\"\n\n\"Hmph. Do whatever you want.\"\n\nThe first preparations had begun. Grid would establish a new smithy here and craft equipment for Noll. Then the 'armed' Noll would be copied to become the fourth challenger in the National Competition.\n\n***\n\n\"The protagonist is blessed.\"\n\nThey receive overwhelming support from audiences and readers alike.\n\n\"As long as countless wishes support the protagonist, the protagonist is destined for strength.\"\n\nOf course, this wasn't universal. Sometimes the protagonist stood weaker than everyone else. Why?\n\n\"The protagonist must endure trials—an inescapable fate. But the protagonist emerges stronger after each trial.\"\n\nAt the S.A. Group's New York branch, a man participating in the US representative selection addressed the other candidates. His name was Zibal.\n\n\"I have overcome the agony of my last trial.\"\n\nOnce a powerful ranker who represented the United States, he'd earned the stigma of being a punching bag after losses to Kraugel and Grid. Now Zibal declared:\n\n\"I am the protagonist.\"\n\nFallen from grace into hell, Zibal had walked a path of penance like a monk. He'd endured ridicule and contempt, striving relentlessly to transcend his limits. Nobody could dismiss him. People might resist acknowledging him, but they had to respect him.\n\nHowever, one person dismissed Zibal entirely.\n\n\"No. I will be the new protagonist.\"\n\nIt was Haster.\n\nThe unexpected challenger's appearance shocked the crowd.\n\n\"Step aside, Zibal. I need to test my strength.\"\n\nHaster accepted that he couldn't defeat Grid presently. But Hurent...?\n\nHaster had beaten Kraugel. Something was wrong—fundamentally wrong. He needed to identify and correct the flaw immediately.\n\nThen this person interfered.\n\n\"Haster? Weren't you a pro golfer?\"\n\n\"Pro *gamer*!!\"\n\nIt was the punching bag, Zibal.\n\n> [Selection begins shortly. All candidates, please enter.]\n\nUnlike other nations, this scene showcased numerous high rankers in one place. Hundreds of formidable players, including Zibal and Haster, filed into the preliminary elimination arena."
}