{
  "id": 92,
  "title": "Chapter 92",
  "content": "# Chapter 92\n\n> **[Escort the Lady]**\n> \n> **Difficulty:** A\n> \n> Irene, who has been kidnapped by the Yatan Church for a second time, has a very weak mind and body. She cannot return to Winston Castle with her own power, so you must safely escort her to Winston Castle.\n> \n> Please note that while Malacus has died, there might still be other followers remaining.\n> \n> **Quest Clear Conditions:** Arrive at Winston Castle with Irene.\n> \n> **Quest Reward:** Irene's affinity will be MAX. <span class=\"rarity-unique\">Doran's Ring</span>.\n> \n> * If affinity with an NPC of the opposite sex reaches the maximum, the possibility of a special event occurring will increase.\n\n> **[Doran's Ring]**\n> \n> **Rating:** <span class=\"rarity-unique\">Unique</span>\n> \n> **Durability:** 10/10\n> \n> **Health:** +1,000\n> \n> **Black Magic Resistance:** +10%\n> \n> **Poison Resistance:** +10%\n> \n> * If you become poisoned or cursed, your condition will recover immediately (60 minutes cooldown).\n> * 50% of the damage received will instantly be recovered (10 minutes cooldown when the effect is activated).\n> \n> A treasure that Doran, Earl Steim's shadow warrior, loved very much. He is said to have received the favor of the goddess of health and wisdom.\n> \n> **Conditions of Use:** None.\n> \n> **Weight:** 0.1\n\n> **Quest Failure:** Irene is likely to die. Affinity with Earl Steim will fall to the lowest point.\n> \n> * The entire northern part of the Eternal Kingdom will fall into chaos because Earl Steim will lose his temper when Irene is killed.\n\n> **[Quest is in progress.]**\n\nGrid's fists clenched. His whole body trembled.\n\n*Yes! Finally!*\n\nHe wanted to laugh. This wasn't anger at the forced quest. This was opportunity. Raw, beautiful opportunity wrapped in a quest window.\n\n*Doran's ring. I'm going to get Doran's ring.*\n\nHe'd wanted it since the moment he first saw the damn thing. The ring with those absurd options. Now it was dangling right in front of him like meat before a starving dog.\n\n*A thousand health. A thousand. And no usage conditions?*\n\nGrid did the math. His **Strength** and **Stamina** stats were bloated compared to his level. All those garbage labor jobs had given him something, at least. His current health sat around 8,000 points. Higher than most tankers at his level, probably.\n\nFor a low-level player or someone who'd dumped everything into magic, 1,000 health from a single ring was game-breaking. Add in the attribute resistance, the status recovery, the instant healing. No conditions to equip it.\n\n*This thing will sell for tens of millions. Maybe hundreds of millions.*\n\n<span class=\"rarity-unique\">Unique</span> items without restrictions were practically extinct in the auction house. This was a payday. A massive one.\n\n*And I'm getting it because someone stole the Divine Shield? This is insane.*\n\nHe'd come to Rolf Mountain to hunt down the shield thief. Instead, he'd stumbled into Malacus, cleared two absurd quests without even trying, and now this. It was like dropping an axe into a lake and the river god handing you two made of gold.\n\n*I'm that guy who trips on the street and finds a winning lottery ticket on the way down.*\n\nGrid knew luck avoided him like a plague carrier in most situations. Before Pagma's Descendant, he would've face-planted into concrete and broken his nose. But lately, things were different. Success had a weird habit of landing in his lap.\n\n*And it's not just the ring.*\n\nIf Irene's affinity maxed out, marriage became possible. Likely, even. Marriage to a lady meant becoming the lord's son-in-law. Earl Steim's son-in-law.\n\n*Which means I'd basically be a lord myself, right?*\n\nWinston was exploding into one of the strongest cities in the north. The tax revenue alone would be astronomical. Enough to bury his debt ten times over and still have enough left to live like a king.\n\n*I'll raise taxes the second I get power. Then I'll be rich. Actually rich.*\n\nThe logic was flawless. Irene's MAX affinity meant marriage. Marriage meant becoming lord. Being lord meant controlling the taxes. The taxes would be his.\n\nGrid sucked in a breath. His hands moved without conscious thought, untying the ropes binding Irene. He helped her stand, forcing his face into what he hoped looked like a reassuring smile instead of the manic grin threatening to split his skull.\n\n\"Believe in me.\" \n\nHis voice came out steadier than expected. \n\n\"I will safely escort you to the castle, so don't worry too much.\"\n\n\"Thank you...\"\n\nIrene's voice was barely a whisper.\n\nGrid's confidence sat at an all-time high. He'd beaten Malacus. Malacus, the famous sixth servant. If any Yatan followers tried blocking his path now, he'd crush them.\n\n*The followers should be around the same level as Kesan Canyon monsters. Weak. Not a threat even without the Divine Shield or Malacus' Cloak.*\n\nRegas had already butchered most of them anyway. The real problem wasn't enemies. It was Irene.\n\n\"Can you walk?\"\n\n\"I'm sorry... I am a big burden to you.\"\n\nShe couldn't. Her legs barely supported her weight. Grid pulled a health potion from inventory and tipped it to her lips. Her health bar didn't budge. He tried another. Then a status recovery potion. Nothing changed.\n\n*This is NPC-locked. No potion is going to fix this until we reach the castle. Damn it. I just wasted good consumables.*\n\nHe stared at her, doing the math. Five hours on foot from Rolf Mountain to Winston. She couldn't walk. There was only one option.\n\nGrid crouched and presented his back.\n\n\"Get on.\"\n\n\"Kyaaak!\"\n\nIrene's entire face went crimson. She jerked backward.\n\n\"M-Mister Grid! You don't need to help me this much!\"\n\nShe squirmed against him, but her struggles had the strength of a dying fish. Grid had never touched a woman outside his sister. His blood roared in his ears. His palms were sweating.\n\n*This is... A woman. An actual woman.*\n\nHe'd never dated anyone. Never even come close. And now here he was, carrying one on his back in a fantasy game. His brain was short-circuiting.\n\n*This is the best luck. This is amazing.*\n\n\"There is no need to be ashamed!\" \n\nHis voice came out too loud. Too enthusiastic. He was screwing this up already.\n\n\"Don't be bothered. I will... No, I won't let you do anything hard! Leave everything to me!\"\n\n\"Mister Grid...\"\n\nThe months of labor quests had dumped close to 250 stat points into his build. His stamina was ridiculous now. Carrying Irene would barely slow him down.\n\n*Okay. Let's move.*\n\nFive hours to Winston on foot. He could do this. He had to do this. This was an A-grade quest, though. Of course it wouldn't be easy.\n\nThree Yatan followers emerged from the cave entrance like vengeful ghosts.\n\n\"You! You are the one who killed Malacus!\"\n\nThe lead one pointed a gnarled staff at Grid's face.\n\n\"I will get revenge for Malacus! Die!\"\n\nCurse magic flared. Purple-black miasma erupted from their staffs, coiling toward Grid like serpents. Poisonous fog followed, the kind that rotted lungs from the inside out.\n\nThe magic splashed against Grid's resistances and evaporated. He didn't even feel it.\n\n*These idiots are weaker than Malacus. Why are they trying to get revenge when they're this pathetic?*\n\n\"Aren't you weaker than Malacus? Why are you trying to get revenge when you are so weak?\"\n\nGrid triggered **Quick Movements**.\n\n> **[Quick Movements has been activated.]**\n>\n> Your **Agility** and evasion rate will increase significantly for 1 minute.\n\nHe didn't bother activating Pagma's Swordsmanship. When deactivated, it gave him a passive 10% boost to physical damage and critical hit rate. With Dainsleif in hand, even that was enough to paste magicians.\n\n\"Hiyaaaah!\"\n\nOne hand steadied Irene on his back. The other swung Dainsleif in a clumsy arc. He lacked the strength to control the massive blade properly with one hand. His swing was slow. Uncoordinated. \n\nIt didn't matter.\n\n\"Keook!\"\n\nThe blade caught the first follower across the chest. Blood sprayed. The man crumpled.\n\n\"For Malacus!\"\n\n\"For God Yatan!\"\n\nThe other two screamed their devotion. Grid slammed the sword into their faces without slowing. Bone crunched. They dropped.\n\nExperience trickled into his bar. Loot notifications pinged. He kept running down the mountain.\n\nMore followers appeared. They'd prepared ambush points all along the path.\n\n\"Souls of the underworld, use your grudges and fears to ensnare the enemy!\"\n\nThree more burst from behind boulders, chanting in unison.\n\n\"Crush his mind with fear and make him lose his will! Become a doll with a lost soul!\"\n\nCurse magic converged from multiple angles. Grid swapped Dainsleif into inventory mid-stride. The Divine Shield materialized in his grip. He angled it to cover Irene.\n\n\"Kuack!\"\n\nThe followers recoiled just from seeing it. The shield's holy aura hit them like acid. Grid dismissed the shield and pulled his dagger. **Wind Blast** tore from the blade toward the clustered magicians.\n\nThe explosion tore through the mountainside. Rock shattered. Trees splintered. Screams cut off mid-breath.\n\n\"T-Too strong...!\"\n\nThe survivors scattered. Grid pursued, swapping between shield, dagger, and greatsword depending on range and angle. The followers couldn't adapt. They'd prepared for a normal player, not someone with a legendary class and gear that trivialized their entire toolkit.\n\n*When I met Doran, these followers seemed terrifying. Now they're just walking experience.*\n\n\"You monster! Eek!\"\n\n\"Kyaak!\"\n\nThey fell in heaps. Some wept as they realized they couldn't win. Others charged with suicidal determination, screaming prayers to Yatan until Grid's blade shut them up. Not one retreated.\n\nThe madness made Irene flinch against his back. Grid was grinning under his helmet.\n\n*Keep coming. Please. All of you.*\n\nHe carved through them like wheat. The battle clarified something crucial.\n\n*Most players hate fighting enemies with status effects. But I'm different.*\n\nMonsters that relied on curses and debuffs usually had weak attack power or defense to compensate. For someone with near-total status immunity, they were free experience. Easy gold. Perfect prey.\n\n*I need to hunt these types more. This is a gold mine.*\n\nPagma's Descendant had turned status abnormalities from a weakness into an unfair advantage. The legendary class was broken. He was starting to understand just how broken.\n\nThree hours of grinding through ambushes pushed him to **Level 97**. Malacus' Cloak kept pulling monsters into aggro range, but Grid didn't care. More enemies meant more experience.\n\n\"We are delayed because monsters keep appearing. I'm sorry.\"\n\n\"... As Doran said, Mister Grid is the only one I can rely on. You are really strong.\"\n\nIrene's voice had steadied somewhat.\n\nShe'd grown up around Phoenix, one of the north's strongest knights. Her father commanded great warriors. She'd seen enough combat to recognize skill when she witnessed it. That made Grid's performance even more confusing to her.\n\n\"Isn't Mister Grid a blacksmith? But how can you be so strong?\"\n\nGrid's answer came without hesitation.\n\n\"The power of items.\"\n\n\"I... Items?\"\n\n\"It's the virtue of having great battle gear.\"\n\n*And a legendary class. But she doesn't need to know that part.*\n\n\"Even if you have great battle gear, won't it be hard if you don't have the skills? You are strong and humble.\"\n\nIrene smiled. Her appreciation was climbing.\n\nGrid could practically see the affinity meter filling. Marriage was close. He could taste it. They talked as they walked, and Winston's walls finally appeared on the horizon.\n\n---"
}