{
  "id": 920,
  "title": "Chapter 920",
  "content": "\"Why naturalize?\" A reporter thrust a microphone toward Jair as he stepped off the plane in Sydney.\n\n\"Simple.\" Jair shifted his bag higher on his shoulder. \"I wanted to compete.\"\n\nBack in the States, he'd been ranked 1,071st globally—respectable by any measure. He had the skills. He had the drive. But America's talent pool ran too deep. Among giants, even the strong became invisible. Election after election, his name never made the shortlist.\n\nThe land of opportunity had offered him none.\n\n***\n\n\"Well, well. Look who crawled back.\"\n\nThe New York selection arena buzzed with recognition as Zibal walked onto the stage. Hundreds of hopefuls tracked his movement, their reactions painting a spectrum from reverence to contempt.\n\nVeterans who remembered his leadership during the first two National Competitions straightened with respect. Younger competitors—those who'd only heard stories of his disappearance after consecutive defeats—wore expressions ranging from disappointment to open mockery.\n\n\"Shouldn't you stay retired?\" Someone in the crowd didn't bother lowering their voice. \"Everyone's already calling you a punching bag. Stop wasting everyone's time.\"\n\n\"Yeah, let someone else have a shot.\"\n\nThe hostility rolled off Zibal like water. He understood its source—it wasn't true hatred. It was wounded hope, expectations turned bitter.\n\n*They waited for me.*\n\nAnd they had every right to feel betrayed. Russia's Kraugel had defeated him. Korea's Grid had crushed him. But through it all, he'd remained one of America's finest. The people had needed their champion to rise again, to reclaim the crown in the third Competition.\n\nInstead, Zibal had vanished without explanation, abandoning his country when it needed him most.\n\nAmerica had fallen from grace.\n\n\"We have Kraugel now!\" A teenager near the front trembled with the intensity of his shout. His voice cracked with emotion. \"We don't need you anymore!\"\n\nThe kid was young enough to have once idolized Captain Zibal. Young enough to have his dreams shattered when that same hero disappeared. Young enough to harbor a seething resentment toward Grid—the Eastern monster who'd trampled American pride into dust.\n\n\"Hmm.\" Zibal had already given his speech to the main waiting room. He wasn't about to repeat himself for every straggler who'd been elsewhere.\n\nHis strength would speak for him.\n\nThe first selection event launched—PvE combat. Zibal raised one hand, and the air shimmered. Reality tore open.\n\nA massive construct materialized with a sound like thunder: the *Two-Headed Steel Chariot*. Its metal frame gleamed under the arena lights as it crushed the first wave of small monsters beneath its wheels. Zibal stood atop it, gazing down at the teenager with a slight smile.\n\n\"Ever watch movies, kid?\" His voice carried across the suddenly quiet arena. \"The protagonist always gets stronger after hitting rock bottom.\"\n\n\"Ah...\" The boy's eyes widened, envy and wonder flooding back into his expression as he stared up at the mechanical beast. Around him, every cynic fell silent.\n\nThe second wave materialized—dozens of flying creatures with razor talons. They swarmed Zibal from above, their aerial advantage seemingly nullifying his ground-based chariot.\n\nZibal's grin widened. \"White Accelerator.\"\n\nA second summon burst into existence: a massive white lion, its wings spanning twenty feet as they unfurled. Zibal leaped from the chariot mid-flight, landing on the lion's back. With a trident in hand, he carved through the sky, piercing monster after monster in a deadly aerial ballet.\n\nThe entire display took less than thirty seconds.\n\n\"AMERICA WILL WIN!\" Zibal thrust his trident skyward as the last monster dissolved. \"I'll make damn sure of it! Unlike the cowards who abandoned their country, I faced my failures and came back stronger! *I* am the true protagonist!\"\n\nAcross the arena, hidden among the observers, Lauel felt something stir in his chest—the competitive fire he'd thought long extinguished. Zibal had transformed. This wasn't the same man who'd fallen two years ago.\n\nEven in a nation overflowing with talent, Zibal now stood unique.\n\nHe was comparable to last year's Kraugel.\n\n*Maybe...*\n\nThe thought rippled through every American ranker present.\n\n*Kraugel and Zibal together... could they finally surpass Grid?*\n\n\"Victory won't come from you.\" A calm voice cut through the hopeful murmurs. \"Step aside.\"\n\nThe crowd parted. Most of the younger competitors looked confused, but anyone over twenty froze in recognition.\n\n\"No way...\"\n\n\"HASTER?!\"\n\nThe Emperor of FPS—a legend who'd built America's golden age alongside Korea's FaXer and Lim Xhan. The mythical pro gamer who'd retired the day *Satisfy* launched. Why would he surface *now*, of all times?\n\nThe younger generation exchanged puzzled looks while their elders gawked.\n\nHaster didn't bother with speeches. Ice barriers materialized around him, trapping the first wave of monsters. Flames erupted within each cage, reducing the creatures to ash. Then the second wave, handled with the same clinical efficiency—no flash, no drama, just flawless execution.\n\nNot as thrilling as Zibal's performance, but technically perfect.\n\n*Skilled,* thought Skull, watching from the sidelines.\n\nZephyr stood beside him, arms crossed. *But ultimately limited.*\n\nBoth men—ranked 10th and 20th globally—had represented America in every National Competition. They knew the truth others refused to face.\n\n*A few monsters mean nothing.*\n\n*That man is beyond them.*\n\nGrid. Three years of facing him or watching him compete had burned one fact into their minds: his growth defied conventional logic. It wasn't about stats or skills anymore. It felt like watching evolution in real-time, a species ascending to something greater.\n\n*He surpassed player limitations long ago.*\n\n*He's fought dragons—actual dragons—while we're still dealing with common monsters. To beat Korea, America needs someone who's transcended the same way Grid has.*\n\nDid they think Kraugel was that person?\n\nSkull and Zephyr exchanged glances, sharing the same bitter knowledge. Most people hadn't noticed, but at last year's PvP finals, Grid had held back. Even limited, he'd broken Kraugel like a child's toy. The man they'd called \"the sky above the sky\" for years had been utterly outclassed.\n\n*First place is a fantasy.*\n\nZibal and Haster returning changed nothing. As long as Grid existed, America would永ternally remain second.\n\nThe grim reality settled over both veterans like a weighted blanket.\n\n[The second test will now commence.]\n\nA new system message flashed. The atmosphere shifted.\n\nA vampire materialized on stage—pale skin, aristocratic features, and unmistakable power radiating from every pore. Earl-grade. Direct descendant. The kind of monster supposedly monopolized by the Overgeared Kingdom.\n\n\"Hungry...\" The vampire's fangs gleamed as crimson energy exploded outward, consuming the arena.\n\n[Blood Field is in effect.]\n\nEvery player on stage felt their strength drain. Skull and Zephyr moved immediately—in boss raids, accumulating damage or maintaining aggro determined your score. Neither planned to wash out in the selection rounds.\n\nThey barely managed three steps before freezing in place.\n\nThe sky went black. Thunder rolled.\n\n\"What the—\"\n\nReality split apart above them.\n\nSomething descended through the tear—a giant nearly five meters tall, its white plating reminiscent of dragon scales. Someone in the crowd whimpered, \"Is that... a Gundam?\"\n\nThe vampire earl was terrifying. This thing was apocalyptic.\n\nInformation screens flickered uselessly—nothing about this entity appeared in the event parameters. Panic rippled through the contestants. Even Haster felt it: the passive Mental Protection of his Red Sage class straining against the pressure.\n\nHis legs shook. Around him, dozens of rankers stood paralyzed, trapped in Fear or Confusion states.\n\nThen the pressure vanished.\n\n\"Come on, Raiders.\"\n\nZibal stood atop the giant's shoulder, one hand resting casually on its plating. The moment he activated synchronization, every abnormal status effect dissipated.\n\n[Synchronizing with Raiders...]\n\n[Synchronization successful!]\n\n[Raiders is now operational!]\n\n[Warning: Maximum mana capacity insufficient.]\n\n[Maximum operation time: 21 seconds.]\n\nZibal's grin was transcendent. \"I told you.\"\n\n[Blue Sky Rider] \n\nThe unique growth-type class he'd earned through blood and determination, serving under the Fourth Imperial Prince Edan. An artifact-class item like Raiders didn't just make him *a* protagonist—it made him *the* protagonist.\n\nThe parthenon cannons fired. The vampire earl's arm exploded, torn clean off its body.\n\n*Holy shit.* Skull and Zephyr's despair transformed into shock, then wild hope.\n\n*This... this is the Zibal we needed!* Haster's eyes shone with renewed faith.\n\nMeanwhile, Lauel caught sight of something engraved on Raiders' chest plate—a familiar imperial crest.\n\n*The Saharan Empire...*\n\nDespite their different perspectives, every observer reached the same conclusion:\n\nZibal would dominate the PvP event. America would reclaim its throne.\n\n***\n\n**South Korea**\n\n[Breaking: Overgeared King Grid Declines Participation in 4th National Competition]\n\nThe headlines exploded across every news site. Within sixty seconds, search engines drowned in queries—*Grid*, *Shin Youngwoo*, *Overgeared King*, *why isn't he competing*—dominating real-time rankings.\n\n**Ttang! Ttang! Ttang!**\n\nInside his workshop, Grid ignored the avalanche of interview requests. His hammer fell in a steady rhythm against armor that bore striking resemblance to Valhalla of Infinite Affection. Exhaustion weighed on his shoulders after days of continuous work, but the notification made it all worthwhile.\n\n> **[You have created a myth-rated item!]**\n>\n> **[All stats permanently increased by +20.]**\n> \n> **[Continental reputation increased by +1,000.]**\n>\n> **[Total reputation now exceeds 200,000. The Reputation Store is recommended.]**\n>\n> **[The Blacksmith God Hexetia praises your work.]**\n>\n> **[God Hexetia grants you a blessing.]**\n>\n> **[Dexterity increased by +100.]**\n\n\"I suppose I must try it on.\" Noll couldn't hide his joy after three days in Grid's company. His eyes sparkled as he immediately donned the armor. \"Though placing such common metal on this noble frame feels... beneath me.\"\n\nGrid studied the result and nodded. \"It's like looking at myself as a child.\"\n\nThe comparison was absurd. Noll resembled a star blazing in the night sky while Grid's childhood self had been... well, considerably less radiant. The sheer gap in their appearances made Grid's claim borderline delusional.\n\nYet Noll beamed with pleasure rather than offense."
}