{
  "id": 921,
  "title": "Chapter 921",
  "content": "Grid examined the armor laid out before him, running his fingers across the reinforced plating. The upgrade to his Minerals Strengthening skill had proven more valuable than he'd anticipated.\n\nFor seven years, that skill had been little more than dead weight—a supposedly useful ability that spent thirty days processing thirty grams of material at a time. He'd been strengthening blue orichalcum since the beginning, yet after all those years, he'd only accumulated 2.5 kilograms. Not even enough for a single longsword, which required four kilograms minimum. Essentially worthless.\n\nThat changed when he met God Hexetia.\n\n[Legendary Minerals Strengthening]\n\n[-Strengthens the performance and durability of minerals using the strengthening frame.\nMineral weight capacity: Up to 1 kilogram.\nStrengthening duration: 3 days.]\n\nThe 'special event' triggered during his confrontation with Hexetia—when he'd successfully forged his sixth myth-rated item—had upgraded the skill entirely.\n\nGrid hadn't been particularly thrilled at first. Seven years of having that skill clog up his window had left him bitter. Even after the upgrade, he'd remained skeptical about its utility. But after securing a substantial quantity of strengthened minerals and incorporating them into Noll's armor set, his perspective shifted dramatically.\n\nBlack iron was readily available—common enough that anyone with sufficient gold could purchase it in bulk. Blue orichalcum, on the other hand, was another matter entirely. Its scarcity made it virtually priceless, and the Overgeared Kingdom had established a monopoly on the supply dropped by the Guardian of the Forest. The combination of strengthened black iron and blue orichalcum had produced exceptional results:\n\n[Valhalla of Strong Trust]\n\n[Rating: Myth\nDurability: 1,745/1,745 Defense: 1,322\n\n* Health recovery +30%\n* Physical and magical damage reduction: 20%\n* Adds 100 defense per five enemies when facing multiple opponents\n* Physical defense and magic resistance +20% in darkness\n* Generates passive skill 'Immobile Fortress'\n\n-Armor crafted by Grid, the legendary blacksmith who defied the gods, based on Khan's original work.\n\nStrengthened black iron forms the base layer while steel plates of blue orichalcum protect the shoulders, chest, and waist.\n\nThe wearer of this armor will shine brilliantly in darkness and become a battlefield legend spoken of for generations.\n\nWeight: 4,770\nRequirements: Level 400+. Strength 3,200. Stamina 2,200.]\n\nUnlike Khan's Valhalla of Infinite Affection, this piece lacked the same profound 'birth background,' yet it had still achieved myth rating. The strengthened minerals provided exceptional durability and defense—a testament to both the upgraded skill and Grid's craftsmanship.\n\nEvery design choice reflected Grid's intentions. He'd incorporated blue orichalcum to enhance Noll's racial advantages as a vampire who ruled the night. The characteristics borrowed from Valhalla of Infinite Affection boosted the vampire's natural recovery abilities. And drawing from Dainsleif's specifications, he'd included options for fighting multiple enemies simultaneously. The result: amplified blood absorption, increased defense in darkness, and enhanced combat effectiveness against groups.\n\nEach project taught him something new. Having access to diverse production methods deepened his understanding of how different options functioned and how to draw them out intentionally.\n\nThe Overgeared Guild's constant contribution of new production methods was invaluable. They brought him every blueprint they discovered, allowing him to focus on quests and advancement rather than hunting for recipes like other blacksmiths.\n\nOf course, Grid reciprocated. He steadily produced equipment for his guildmates, and the value of those items matched what he gained from their assistance.\n\nNoll bounded around the workshop, his small frame practically vibrating with excitement. \"Grid! Look at this! This armor is brilliant! It has a blue shine!\"\n\n\"It suits you well.\"\n\n[Affinity with 'Noll' has increased by 20.]\n\nThe Valhalla of Strong Trust was worth billions of won at minimum—potentially tens of billions. Yet Grid no longer operated purely for profit. Seeing his colleagues and subordinates rejoice brought him more satisfaction than any amount of currency. Experience had taught him that strengthening his allies was worth more than money in his vault.\n\nThe shield, however, remained a source of minor regret. Unique-rated, not legendary. Creating a legendary shield would require more time than he could spare—potentially several months of attempts, gambling on luck for the rating upgrade. Grid had too many responsibilities to indulge in such uncertainty.\n\nHe gathered his tools and stood. \"I need to head back.\"\n\nNoll stopped spinning, his expression falling as he clutched the triangular shield. \"Already?\"\n\n\"Three days for the shield, another three for the armor. I've been here nearly a week. I have obligations waiting.\"\n\n\"I've lived for over two hundred years.\"\n\n\"What?\"\n\nNoll's small fingers caught Grid's collar with surprising desperation. \"One week... is short.\"\n\nGrid hesitated, discomfort gnawing at him. Leaving a young-looking boy alone in this dark, desolate underground city felt wrong. But sentiment couldn't override necessity. He needed to check on Piaro, Asmophel, and Mercedes.\n\n\"Noll, you have to protect this place.\"\n\n\"Why? The fields? How much larger should I expand them?\"\n\n\"I'm not certain of the exact threshold. Keep farming for the next 153 days. Once the fields reach a certain size, the system will recognize this territory and incorporate it into my kingdom.\"\n\n\"153 days?\" Noll's voice rose. \"I have to keep farming? Keep eating these potatoes?\"\n\n\"You said you've lived for over two centuries. If one week is short, then 153 days will pass quickly.\"\n\n\"One week and 153 days are completely different!\" Noll's shout echoed off the cavern walls before he caught himself, lowering his voice. \"After 153 days... can I follow you?\"\n\nGrid understood the desire. He wanted Noll with him as well. A powerful NPC like this would be tremendous support, and Lord would benefit from having a friend his own age...\n\nBut there was a fundamental problem. \"Unfortunately, you're the only one who can rule this place. Most of my colleagues and subordinates are human—they can't live in an underground city. I've barely managed a week here myself. The air...\"\n\n\"Then what? I stay here my entire life?\"\n\n\"It can't be helped. You can't tolerate sunlight, correct?\"\n\n\"Bah, I'm pure blood. Sunlight restrains me somewhat, but... wait.\" Noll's eyes brightened. \"What about asking someone else to rule on my behalf?\"\n\n\"Who?\"\n\n\"Another vampire like me.\"\n\n\"The other vampires suffer from the Curse of Idleness differently than you do. Someone who sleeps constantly can't function as a lord.\"\n\nA proper lord required operational competence—developing the city, collecting taxes, managing resources. Low intelligence or poor administrative ability would cause deterioration rather than growth. It was precisely why Lauel constantly searched for qualified personnel.\n\nNoll's face twisted. \"Damn Yatan...\"\n\nCursing a god. Grid found reassurance in this confirmation that Noll operated outside normal parameters. Having him as an ally was better than having him as an enemy.\n\n\"I really need to go. Watch over the city for 153 days. I want to integrate your people as soon as possible.\"\n\nThe vampire cities were valuable hunting grounds, rich in vampire rings and elixirs. While the Overgeared Guild nominally controlled these territories, enforcement remained imperfect. Hostile forces routinely invaded without permission, attacking the guards stationed at entrances. They ranked among the primary threats the Overgeared Kingdom needed to address.\n\n\"Bah. You're the only human permitted on my land.\"\n\n\"That's reassuring.\" Grid smiled and raised his hand in farewell.\n\nNoll watched him depart, then muttered under his breath, \"The armor and shield... thank you.\"\n\nThe first gift he'd received since birth. He couldn't be ungrateful.\n\n***\n\nSparks traced a straight line across the empty hunting ground—remnants of Draw Sword's activation.\n\nBlood dripped from Peak Sword's right arm as he sheathed his blade. The gauntlet on his hand bore responsibility for the injury.\n\n[Blue Dragon's Gauntlet]\n\nCrafted from the Blue Dragon's Breath he'd obtained at last year's National Competition, this growth-type item maximized Draw Sword's effectiveness by substantially increasing both attack power and attack speed. But the penalty was severe. The 'Lightning Speed' effect triggered randomly, doubling Draw Sword's damage at the cost of twelve percent of his health and inflicting a five-second 'fractured arm' debuff. A fracture directly diminished combat capability, making Lightning Speed a double-edged blade.\n\nHe'd hoped to increase the item's rating before this year's competition began.\n\nLast year, Grid had advised the Overgeared Guild's gold medalists—Peak Sword and Yura among them—to request sacred creature byproducts as rewards. They'd asked Grid to craft equipment from these materials, but the results ranged from unique to legendary rating. Peak Sword's Blue Dragon's Gauntlet had come out unique.\n\nStill, he harbored no real regret. He'd never expected a myth-rated item anyway, and the gauntlet carried the 'growth-type' designation.\n\nThe Blue Dragon's Gauntlet would eventually reach legendary rating at minimum. When that happened, the penalty—currently its sole disadvantage—would likely diminish. Compared to static equipment, it had vastly more potential for improvement.\n\nThe problem was the glacial accumulation of item experience. Eight months of dedicated grinding had only filled the progress bar to twenty percent. He'd haunted hunting grounds constantly except when quest obligations intervened.\n\nGrid had mentioned frequently that growth-type items were incredibly frustrating to develop. Peak Sword understood why now. Grid still hadn't summoned Elfin Stone despite years of effort with that vampire's equipment.\n\nThen today's news articles surfaced—Grid announcing his absence from the National Competition.\n\nThose bastards were probably cursing Grid right now.\n\nPeak Sword's admiration for Grid bordered on worship. The hero who'd elevated their country's honor and helped him countless times... He felt genuine disgust toward people who criticized Grid. Whenever he encountered articles attacking Grid, he logged into his alternate account—'Peak Dislike.'\n\n\"Can't be helped. Time to post some supportive comments.\"\n\nLunchtime anyway. He logged out without hesitation and returned to being Kang Daehan, head of the Patriotic Association.\n\nReal-time search rankings were dominated by Grid-related terms. Endless articles covered his declaration of non-participation.\n\nKang Daehan logged into the Peak Dislike account and clicked the top-ranked article, ready to 'recommend' every comment sympathetic to Grid and 'report' every comment condemning him.\n\nBut when he sorted by recommendations...\n\n\"These ignorant bastards talking about things they don't—huh?\"\n\nNo hostile comments appeared in the top rankings.\n\n—*Being absent from the largest annual event... Perhaps God Grid is dealing with health issues? I'm genuinely worried.*\n\nRecommendations: 21,034 | Dislikes: 509\n\n—*Praying for God Grid's recovery.*\n\nRecommendations: 18,110 | Dislikes: 288\n\n—*Grid deserves a break. The spotlight and expectations focus on him every year—that burden must be immense. Taking a year off is healthy. Shame about losing the gold medal rewards, but rest is important.*\n\nRecommendations: 14,500 | Dislikes: 1,209\n\n—*Last year's Reinhardt invasion probably influenced his decision. If Overgeared members all participate in the competition, groups like Immortal might attack Reinhardt again. Grid's likely trying to prevent a repeat incident. Why hasn't the S.A. Group improved the system? Communication is terrible.*\n\nRecommendations: 13,990 | Dislikes: 102\n\n—*Cheering for the Korean representatives! Please work harder for Grid watching from home!*\n\nRecommendations: 12,010 | Dislikes: 93\n\nKang Daehan stared at the screen, realization dawning. He wasn't the only one who loved Grid. All of Korea cherished him.\n\nOf course, exceptions existed.\n\n[(Column) Grid Has Reached His Peak]\n\n[*We don't know the exact rewards Grid obtained from past National Competitions. They certainly helped him at the time, but they're unlikely to benefit the current Grid significantly.*\n\n*Grid has reached his peak.*\n\n*The National Competition is merely a waste of time for him now. He's accumulated enough personal power to ignore public opinion without fear.*\n\n*He's abandoned his country and his people.*]\n\nThese so-called experts needed inflammatory material to attract attention. Grid rarely provided such opportunities, making this particularly valuable to them.\n\n\"These bastards...\"\n\nKang Daehan picked up his phone. Time to mobilize the Patriotic Association."
}