{
  "id": 922,
  "title": "Chapter 922",
  "content": "**Downtown Area Near Shin Youngwoo's Building, South Korea**\n\nChairman Lim Cheolho's latest statement played on every major news outlet: the 4th National Competition, fifty days away, would mark a new era of innovation—a world truly shaped by its players.\n\n***\n\n\"God, I need a break.\"\n\nYoungwoo stumbled out of his capsule, rolling his shoulders and working the tension from his neck. Ten days of nonstop work—designing equipment, analyzing stats, optimizing builds for his Four Heavenly Kings. Every waking moment spent in the game's forge, hammering away at problems that had no easy solutions.\n\nHe needed air. Needed to think about something—anything—other than item specifications and combat scenarios.\n\nBut stepping outside meant facing reality. Meant acknowledging what waited for him on the internet: thousands of comments about his withdrawal from the National Competition. The thought made his chest tighten. Even now, after everything he'd accomplished, the old wounds ran deep. Years of being dismissed, overlooked, treated as worthless—that damage didn't just disappear because you hit it big.\n\n\"Screw it.\"\n\nHe grabbed a face mask and headed for the door. Hiding wouldn't help.\n\nThe afternoon sun hit him like a blessing. Clean air filled his lungs, washing away the stale anxiety that had been building in his chest. He looked out over the street—commercial buildings lining both sides, crowds of people moving between shops, cars filling the underground parking lots.\n\nTwo years ago, this had been empty land. Now? A thriving district, all because people wanted to catch a glimpse of where Grid lived. Merchants had followed the crowds. \n\nShin Youngwoo—not Grid, just Youngwoo—had built something real.\n\n\"Here, you look like you could use this.\"\n\nHe turned to find a young woman from the ground-floor cafe holding out a steaming cup.\n\n\"What's this for?\"\n\n\"You're wearing a mask. Figured you might be coming down with something.\"\n\nSo much for staying anonymous. The mask only drew attention to his eyes, made his features more striking. And around here, everyone recognized his build on sight.\n\n\"Thanks.\" He accepted the tea with an awkward smile. \"But don't think this is getting you a rent discount.\"\n\nShe laughed. \"Wouldn't dream of it. This is coming out of my tips anyway.\"\n\nShe turned to head back inside, but Youngwoo caught her sleeve.\n\n\"Wait. You're not... angry?\"\n\n\"About what?\"\n\n\"The National Competition. Me not going.\"\n\nUnderstanding crossed her face. Her expression softened. \"Oh, Youngwoo. Is that what's been eating at you?\"\n\n\"Everyone's been watching. Every year, the whole country—\"\n\n\"Stop.\" She pulled out her phone, fingers dancing across the screen. \"Look at this. Really look.\"\n\nShe pulled up social media, searched for Grid-related tags. The feed filled with messages:\n\n*Hope Grid's okay. This has to be serious for him to skip the competition.*\n\n*Worried about what he's giving up. Those gold medal rewards are huge.*\n\n*Whatever's going on, hope he takes care of himself first.*\n\nConcern. Worry. Support.\n\nNothing about betrayal. Nothing about letting Korea down.\n\n\"We're not mad,\" the woman said gently. \"We're worried about you. My whole apartment building shakes when you compete—everyone screaming at their screens, my parents and grandparents who don't even understand the game rules. You've made them happy. Made all of us happy.\" She met his eyes. \"Nobody's going to blame you for taking care of yourself.\"\n\nYoungwoo's throat tightened. \"I didn't... I mean, I took that demon king role for myself. Didn't think about how it would affect everyone else. The medals Korea won't win. The buffs players won't get.\"\n\n\"And you know what? That's fine. You don't owe us anything. You've already given us so much.\" She squeezed his arm. \"We call you a hero because you've given us something to believe in. That's not meant to trap you—it's just... thanks. So stop looking so miserable. Do what you need to do. Anyone who gives you grief will have to answer to the rest of us.\"\n\nShe headed back inside, leaving Youngwoo standing there with his cooling tea.\n\nAn ordinary woman. A neighbor. Representing something Youngwoo hadn't fully grasped until this moment.\n\nHe'd learned patriotism in the military—duty, loyalty, sacrifice for the greater good. Abstract concepts that felt important but distant.\n\nThis was different.\n\nThis was his family. His neighbors. Real people living real lives in the place he called home.\n\n'The Overgeared Kingdom,' he thought. 'That's where I start.'\n\nHis people. His responsibility. If he could make them safe, make them proud, give them something to believe in—that would matter. Maybe it seemed small. Maybe others would laugh at the limited scope of his ambition.\n\nBut the world was changing. Virtual reality had already rewritten the rules once. It would happen again. And when it did, the spirit he built in his kingdom might be exactly what his real-world home needed.\n\n***\n\n**Hwan Kingdom, East Continent**\n\nBlood soaked Garam's robes. His hair hung in tangled strands, and his eyes burned with the killing intent that came from passing the Chiyou test. The trial came only once per century—a game the yangbans played when ennui threatened to consume them. Each time they overcame it, their power deepened.\n\nThe Five Seniors watched his return with mild interest.\n\n\"A yangban exists to perfect the world,\" one intoned.\n\n\"You've chosen the path of slaughter, Garam. That means your blade must touch everything.\"\n\n\"Kill to make room for new life. Serve the cycle. Preserve balance.\"\n\n\"When your bloodlust finally settles, peace will follow.\"\n\nFour voices offering wisdom. The fifth Senior remained silent.\n\nGaram turned to him. \"Hanul. Do you remember Pagma?\"\n\nThe name drew instant reactions—narrowed eyes, curled lips. Pagma, the heretic who'd questioned the natural order. Who'd claimed yangbans and humans should stand as equals. An unpleasant memory for those who'd witnessed his rebellion.\n\nBut Hanul's face stayed neutral. \"Of course. That smoking pipe at your belt—didn't he make that for you?\"\n\nGaram drew the pipe from his sash and crushed it in one hand. The artifact that had stopped Grid's blade moments before crumbled to powder.\n\n\"He's dead.\"\n\nThe Seniors barely reacted. They knew the price of leaving the kingdom: mortality reclaimed what should have been eternal. Pagma's death had been inevitable from the moment he'd crossed the border.\n\nBut Garam wasn't finished.\n\n\"Before he died, he scattered his techniques among the common masses.\"\n\nThe temperature in the room dropped.\n\n\"He *what?*\"\n\n\"Gave power to humans?\"\n\nForbidden. Absolutely forbidden. A yangban's techniques were sacred—earned through personal transcendence, symbols of their divine nature. To share them, to dilute them among lesser beings, was to deny everything they represented.\n\n\"We need to find whoever inherited his power,\" one Senior snarled. \"Destroy them. Burn this contamination from the world.\"\n\nGaram nodded, then focused on Hanul. \"The inheritor is a king in the western lands. Part the Red Sea for me. I'll cross over and end this—punish the beasts who abandoned us millennia ago.\"\n\n\"*Absolutely not.*\" The shouting Senior stepped forward. \"The West is polluted—corrupted by wicked gods of every stripe. Set foot there and you'll lose power. Maybe even your immortality!\"\n\nGaram hesitated. He hadn't known the situation was so dire. The western territories they'd abandoned generations ago had become that dangerous?\n\nFear flickered through him. But anger burned hotter. He remembered the wound Grid had given him—a scratch from a *human* wielding Pagma's stolen power.\n\n\"Then I'll sacrifice what I must. If it means correcting the world, I'll risk my body. Hanul, please—\"\n\n\"You won't be crossing the Red Sea.\"\n\nHanul's interruption carried absolute authority. His vision extended across Pangea, swept over the Red Sea to the Western Continent beyond.\n\nA smile touched his lips.\n\n\"The enemy will be crossing to us.\"\n\nHis power manifested.\n\n[★Hidden Quest★ 'Call of Heaven' has been created.]\n\nThe notification appeared simultaneously for tens of millions of players—including most of the Overgeared members. Every blacksmith on the server received the summons.\n\nFifty days until the 4th National Competition. One hundred and fifty days in Satisfy.\n\nA land more brutal than hell had just opened its jaws."
}