{
  "id": 924,
  "title": "Chapter 924",
  "content": "\"Keep them safe.\"\n\n\"You can count on me, Master.\" Noe's voice carried a faint purr.\n\nThe cat perched on Grid's shoulder cut an odd figure—white fur gleaming, belly round and soft, paws tipped with pink pads that looked more like jelly than flesh. Yet every blacksmith present knew what he truly was: a memphis, Hell's finest demonic beast. Noe possessed dragon heritage, granting him both formidable intelligence and the gift of flight. His crude breath alone surpassed any wyvern's. Among two billion players worldwide, only one had managed to tame such a creature.\n\n*Adorable.*\n\nThe thought crossed multiple minds as Noe groomed himself with his tongue, radiating an almost obsessive cleanliness. Occasionally he'd nuzzle Grid's cheek with that same endearing gentleness. But not a single blacksmith approached.\n\n\"Kyaong!\"\n\nBecause Noe showed everyone else his true nature—that of an apex predator. More than half the steel jiangshi that breached the walls fell to his claws within moments.\n\nOne blacksmith swallowed hard as Noe shattered stone with casual swipes, sending jiangshi flying with single blows. The Overgeared Skeletons crushed bones while Randy delivered killing strikes to those unable to rise. The light elemental and golden blades formed a defensive perimeter around the craftsmen.\n\nGrid's summons functioned like a perfectly coordinated party. He didn't lift a finger. The blacksmiths were safe.\n\nHope kindled in their eyes. Perhaps they could actually complete this forced linked quest. In that moment, they finally understood why the Overgeared members spoke of Grid with such reverence.\n\nGrid himself felt only frustration.\n\n*Where the hell do I even start?*\n\nHis quest demanded he locate and rescue thirty residents surrounded by poison jiangshi—all within one hour. The ruined city sprawled vast before him, and finding anyone felt impossible. Magic Detection had limited range compared to the urban sprawl. Worse, the moment the quest triggered, dense fog had swallowed everything, rendering Fly useless for aerial reconnaissance.\n\n*Damn it...*\n\nGrid saw only one path forward: scatter. He and the hundred blacksmiths would have to split up, move through the fog blind, search on foot. Otherwise, the quest was mathematically impossible.\n\n*If the rewards weren't so good...*\n\nJiangshi spawned continuously. The blacksmiths couldn't fight them. A quest designed to separate the group from their protector... yes, this was clearly meant to fail. The astronomical rewards existed precisely because success bordered on unreasonable.\n\n*We're screwed.*\n\nGrid turned to survey the faces of the blacksmiths who'd followed him here. People *he'd* brought to this place. Failing them felt like betrayal—and that wasn't an outcome he could accept.\n\n\"...\"\n\nHow to salvage this? While wrestling with the problem, an idea surfaced through the mental fog.\n\n\"Everyone stay put.\"\n\nHe launched himself across several rooftops in quick succession. Upon reaching the highest point available, Grid activated one of the powers bound to his Rune of Darkness.\n\n\"Ruson's Power.\"\n\nThe ability once belonged to an Earl-class vampire he'd slain during the 7th vampire city raid. Ruson's blood-tracking sense only worked on wounded targets, but it completely negated stealth and concealment. Grid felt his olfactory senses sharpen dramatically as he drew a deep breath. The stench of stagnant water and rotting jiangshi flesh faded. Now his nose detected only one thing: human blood.\n\n\"There.\"\n\nLike a bloodhound on the scent, Grid pinpointed a faint trace of life. Blood from residents besieged by poison jiangshi—roughly three kilometers east.\n\n*Thought it was weak compared to the other powers. Never expected it'd be this useful.* \n\nGrid smiled, then glanced down at Noe. The cat had rolled onto his back, licking his paws with single-minded focus, utterly entranced by his own grooming ritual. A creature born to overwhelming strength rarely felt genuine tension.\n\n\"Noe, I'll be gone for a bit. Keep everyone safe.\"\n\n\"Mmm. Got it.\" His answer came through a yawn.\n\nThe blacksmiths, relying on Noe for protection, exchanged uneasy glances at his casual attitude. But Grid trusted him completely. Noe had consumed the Great Demon Astaroth's power along with the thunder stone, evolving beyond even a typical memphis. \n\nGrid activated Keen Insight's Hunger state, trading health for explosive agility, and vanished into the fog.\n\n***\n\nPoison jiangshi possessed physical capabilities similar to their steel counterparts, but every wound they suffered released toxins into the air. Deeper cuts meant stronger poison. Anyone exposed trembled in death-like agony.\n\n\"Hah... hah... We're finished.\"\n\nLord Han Seokbong had once been captured by the king, then escaped. After Grid abducted him—along with the Red Phoenix Bow's creator—Pangea was abandoned. The king never appointed a replacement lord. The few remaining residents survived alone, and everyone understood why: protecting this city meant rebelling against the Hwan Kingdom's yangbans. The Cho King would never risk that.\n\nStill, enduring hell proved harder than accepting it. Jiangshi breached the walls easily without troops to man them. The residents spent every waking moment just fighting to survive, with no chance to restore Pangea's collapsed economy.\n\nNow they'd reached their limit. Starving and powerless, the residents faced their end. Heaven showed no mercy. Each time the jiangshi leaped forward, the distance closed sharply. The fog itself turned poisonous. Before the overwhelming threat of poison jiangshi, the people's resistance crumbled.\n\n\"Should've followed the lord that day...\" someone muttered. \"This land has no hope left...\"\n\nNo one contradicted him. Exhaustion had claimed them all. The noble spirit that once drove them—the determination to protect their home, to convince the Cho King to allow their lord's return—had long since died. Weapons clattered from trembling hands. Surrounded, they surrendered to despair, closing their eyes and cursing this twisted world that divided humanity between yangbans and ignorant masses.\n\nThe sound of cracking skulls. Tearing flesh. The residents knew—their families, their friends, everyone would die here. Yet time passed. No screams of agony followed.\n\n\"...?\"\n\nThrough wide eyes, the residents glimpsed light flashing through the fog. Each flash sent a jiangshi's head tumbling. Someone was slaughtering the undead.\n\n\"W-Who?\"\n\nSomeone was helping them, even after Heaven itself had turned away? They wanted desperately to see their savior's face—but stepping forward meant poison exposure. No one dared move.\n\n\"Whoever it is... they're going to die...\"\n\n\"We have to stop them. The yangbans' wrath will fall on anyone who helps us.\"\n\nThey worried most about the poison. If this stranger didn't understand poison jiangshi's characteristics, the toxins would kill him. But such concerns meant nothing to a legend—especially not one who specialized in producing miracles.\n\n\"Are you all unharmed?\"\n\nSteady footfalls echoed through the fog. A man emerged, his bearing calm and confident. Behind him, poison jiangshi lay dead—killed by their own toxins. When the residents saw his face clearly, tears streamed down their cheeks.\n\n\"Pangea's Duke of Virtue!\"\n\nThe man who appeared when Pangea faced crisis after losing the Red Phoenix Bow. Who recreated that legendary weapon and rescued their lord from execution. Who then abducted Han Seokbong and the others who'd earned the yangbans' fury, spiriting them away to the West Continent. A man of true virtue—and so Pangea had named him their Duke.\n\nThe hero's return ignited hope in those who remained.\n\n[★Hidden Quest★ 'East Continent Experience (2)' has been cleared.]  \n[Reward: 10 Blessed Weapon Enhancement Stones acquired.]  \n[Additional reward for exceeding minimum rescue count: 107 Weapon Enhancement Stones acquired (1 per extra person).]  \n[Quest reward: Linked quest generated.]\n\n[East Continent Experience (3)]  \n[★Hidden Quest★  \nPangea's blacksmiths departed long ago. Few weapons remain. Aid the residents in their fight against the jiangshi by producing armaments. Note: steel jiangshi and poison jiangshi will continue their assault.\n\nClear Conditions: Craft epic-rated or higher weapons and armor for Pangea's residents. User requirement: Level 250+. Time limit: 3 days.  \n* Residents rescued: 137\n\nRewards:  \n1. Generate linked hidden quest  \n2. 20 Blessed Armor Enhancement Stones\n\nFailure Penalty: -1 Level. Permanently lose 20 points from highest stat.]\n\nThe difficulty was absurd. Epic-rated equipment for *every* rescued resident? Within three days?\n\n\"G-Grid!!\"\n\n\"This is impossible!\"\n\nThe blacksmiths erupted in panic.\n\n\"We can't produce 274 epic items in three days!\"\n\nSatisfy's rating system progressed from Normal to Rare to Epic to Unique to Legendary. Even skilled craftsmen only produced one epic item per twenty attempts. Each piece required two to three hours minimum. One hundred and one blacksmiths crafting 274 epic items in seventy-two hours? The math didn't work.\n\nDespair settled over them. A few shot resentful glances at Grid—if he'd only rescued the required thirty instead of 137... But they swallowed those complaints. Without Grid, they'd already be dead. And seeing the wounded residents made protest impossible.\n\nGrid surveyed the turmoil. \"How many of you have unique-rated blacksmith hammers?\"\n\nBetter hammers increased the odds of producing higher-rated items exponentially. They were every blacksmith's dream—and notoriously difficult to craft. Only five hands rose from the hundred.\n\nGrid examined each hammer's properties, then smiled.\n\n\"Let's head to the smithy.\"\n\n\"...?\"\n\nSeveral blacksmiths with sharp eyesight doubted what they saw. Grid's obsidian eyes seemed to glow blue."
}