{
  "id": 925,
  "title": "Chapter 925",
  "content": "Auto Production speed depended on two factors: blacksmithing skill level and dexterity. The hundred blacksmiths Grid had brought to the East Continent all possessed over 3,000 dexterity, averaging just over two hours per item. He'd handpicked an elite group.\n\nThat didn't guarantee quality.\n\n\"Damn it. Rare.\"\n\n\"Mine's normal rated...\"\n\n\"Only five epic items? We're all going to die.\"\n\nPanic spread through the smithy. The first production run was a crushing defeat—bad luck striking every single one of them.\n\n\"Why...?\"\n\nThe blacksmiths' eyes turned to Grid. *Ttang! Ttang!* He worked silently in the corner, his hammer rising and falling in steady rhythm.\n\n\"Can we really count on him?\"\n\n\"...\"\n\nNo one answered. They couldn't rely on Grid this time. Everyone knew he produced items manually—rumor had it that Pagma's Descendant *prevented* him from using Auto Production. *Ttang! Ttang! Ttang!* The rumors seemed true. The other blacksmiths had already completed their first items and started their second while Grid was still hammering away, his first piece unfinished.\n\n\"There's only one option.\"\n\nSeveral blacksmiths pulled out their unique-rated weapon production methods—compensation for reaching Pangea. Since blacksmith's hammers counted as weapons, they could craft unique-rated versions. That would dramatically increase their odds of producing epic items.\n\nNone of them wanted to waste it. Pangea's smithy only provided ordinary steel. A unique-rated hammer forged from common materials would produce low-quality results—barely better than the epic hammers they already owned.\n\n*If only we could access the exchange.*\n\nSatisfy's intercontinental auction house remained mostly blocked. The exchange system wasn't active on the East Continent because the player market existed exclusively on the West Continent. That meant no way to acquire materials except gathering them personally. And they didn't have time for mining.\n\nThe blacksmiths sighed, steeling themselves.\n\n\"Can't be helped. We'll have to make steel hammers. Better than coming all this way just to abandon the quest.\"\n\nTwenty blessed armor enhancement stones—naturally a coveted reward. But the blacksmiths wanted to work for Grid more than they wanted immediate compensation. Without Grid, they never would have reached Pangea. They wouldn't have defeated the jiangshi or rescued the residents. They'd earned all manner of rewards thanks to him. They didn't want to see him suffer losses. This was about conscience, not faith.\n\n\"This time, we help Grid.\"\n\nThe blacksmiths set their resolve. A few hesitated, but the atmosphere left no room for refusal.\n\n\"Let's begin.\"\n\nUsing a unique-rated production method to craft a steel hammer... What a waste. But what choice did they have? The blacksmiths reached for their production methods with heavy hearts.\n\n\"Stop!\"\n\nGrid's shout froze them in place. Every eye turned to him. He held two hammers in his hands—supposedly just completed.\n\n\"Two...?\"\n\nThe blacksmiths had finished one item in two hours. Grid was supposedly still hammering. Yet he had two finished products?\n\n*Was he working on his second while we thought he was still on his first?*\n\n*Is he using Auto Production after all?*\n\n*No, even with Auto Production, how could he make two items in two hours? Does he have over 6,000 dexterity?*\n\nThe True Legendary Blacksmith's Craftsmanship reduced crafting time. The ordinary blacksmiths had no way of knowing this.\n\n\"Jin Haecheong. Alanta. Cedar.\"\n\nGrid called out three names.\n\n\"Huh? Yes.\"\n\nAlanta and Cedar ranked highest among the hundred blacksmiths. Jin Haecheong, though only mid-ranked, owned a unique-rated hammer.\n\nGrid looked at Jin Haecheong. \"Show me your hammer again.\"\n\n\"Yes...\" Jin Haecheong didn't understand, but he pulled out his hammer with trembling hands.\n\nGrid's eyes blazed blue.\n\n>[Eyes of Pagma-Baal's Contractor Version Lv. 1]\n>\n>You can check and copy the stats, options, and production method just by looking at the target item.\n>\n>However, in order to copy the item, you must use an item that you have created yourself as the material. Additionally, the difference in rating of the target item and the item used as the material must be within one grade. The item used as the material can't be recovered.\n>\n>* Skills that belong to the target item may not be copied.\n>\n>* The duration of the duplication is one day. The copied item that has reached the end of this duration will be permanently destroyed.\n>\n>Skill Resource Consumption: One item.\n>\n>Skill Cooldown Time: 1 hour.\n\nPower gained from defeating the clone. Grid sacrificed the epic-rated hammer he'd just finished and copied Jin Haecheong's tool.\n\n>[You have succeeded in duplicating the item!]\n>\n>[Great Hammer]\n>\n>Rating: Unique\n>\n>Durability: 486/520\n>\n>Attack Power: 193~240\n>\n>Odds of Making a Rare Rated Item: +3%\n>\n>Odds of Making an Epic Rated Item: +34%\n>\n>The work of blacksmith Rolloman, who wasted his fortune on gambling. Rolloman decided it would be more profitable to make in-demand items than attempt high ratings with extremely low production odds.\n>\n>With this hammer, he could finally become rich.\n>\n>User Restriction: Level 210 or higher. 603 or more strength. Intermediate Blacksmithing skill.\n>\n>* This is a duplicated item. It will be destroyed after 23 hours.\n\nDespite its unique rating, the hammer lacked options for crafting unique items. Instead, it massively boosted epic production rates. Perfect for this quest—exactly why Grid had copied it.\n\nThen Grid activated Divinity.\n\n>[Show off the virtues of a blacksmith who deserves to be praised as a god. The casting time and cooldown time of all blacksmithing skills will be removed. It can be used up to two times whenever the skill is activated.]\n>\n>[The cooldown time of Pagma's Eyes has been reset.]\n\n\"Pagma's Eyes.\"\n\nGrid's eyes, which had returned to normal after the first copy, blazed blue once more.\n\nThe blacksmiths stared, trying to process what they were seeing. By the time they recovered, two Great Hammers rested in Grid's hands. The original remained firmly in Jin Haecheong's grip.\n\nGrid shared the copied items' information with the group and handed the hammers to Alanta and Cedar.\n\n\"I'll give you another one every hour. Good luck.\"\n\nHe could craft Great Hammers from scratch, but reproducing unique items through Auto Production in one hour? Doubtful.\n\n\"...\"\n\nNo one answered. Every mouth hung open, unaware of the flies going in.\n\n***\n\nSix hours before the quest deadline.\n\n\"That's it!\"\n\n\"Wahhhh!\"\n\n\"We did it! We actually did it!\"\n\nThe blacksmiths erupted in celebration.\n\n>[★Hidden Quest★ 'East Continent Experience (3)' has been cleared.]\n>\n>[20 blessed armor enhancement stones have been acquired as a quest reward.]\n\nThey'd cleared a quest they thought impossible. All thanks to Grid continuously copying the hammer. The blacksmiths had experienced being truly overgeared, and they looked at Grid with undisguised envy.\n\nGrid shrugged inwardly. He was proud of the miracles he'd accumulated over years of crisis and resolution.\n\nBut now wasn't the time for smugness. He suppressed his excitement and waited for the next notification with a carefully neutral expression.\n\n>[A linked quest will occur as a quest reward.]\n\nAs expected. A new quest materialized without pause.\n\n>[Hunt the Daoist]\n>\n>[★ Hidden Quest ★]\n>\n>There is an unusual number of jiangshi filling Pangea. It is believed that a daoist is producing and controlling jiangshi near Pangea. Find the daoist and defeat him. Armed with their new weapons, Pangea's residents will help you.\n>\n>Quest Clear Conditions: Kill the daoist within three days.\n>\n>Quest Clear Rewards:\n>1. Create a linked hidden quest.\n>2. Three random elixirs.\n>\n>Quest Failure: Level -2. The highest stat will permanently decrease by 30 points.\n\nTwo lost levels and thirty points from his highest stat—the failure penalty had increased dramatically. Grid wasn't worried. His highest stat was dexterity, and from his perspective, dexterity was easy to raise. Losing a bit wouldn't hurt.\n\n*And I can recover levels through hunting.*\n\nThe reward was what mattered. Elixirs permanently increased a stat by ten points each. This was an opportunity to claim three. The other blacksmiths hungered for the rewards, but their fear ran deeper.\n\n\"What even is a daoist?\"\n\n\"We have to fight jiangshi...\"\n\nThe blacksmiths differed from Grid. They had no combat ability. The difficulty and penalties were overwhelming for those who couldn't have reached this place on their own. They wanted the elixirs, but elixirs weren't worth more than levels—not when raising levels as a non-combat class was already brutally difficult.\n\nWhat choice did they have? The water was spilled. No turning back now. The blacksmiths tried to raise their morale.\n\nGrid watched them with regret before turning to the residents. They radiated high spirits thanks to their new armor and weapons. They felt several times stronger, filled with hope that they could finally protect Pangea.\n\nGrid asked, \"What direction did the jiangshi come from?\"\n\n\"Most came from the west.\"\n\n\"The west...\"\n\nGrid pinpointed the daoist's likely location. Meanwhile, the residents murmured with serious expressions:\n\n\"You're going to fight for us again?\"\n\n\"Please, let us add our strength.\"\n\n\"We won't be in the way! Pangea's Duke of Virtue, please let us follow you!\"\n\n\"Alright.\"\n\nGrid didn't refuse. Character Observation revealed most residents were over level 300 with decent combat skills. They might prove useful against a daoist who could summon jiangshi in quantity.\n\nGrid's party moved west. The residents' report was accurate—jiangshi were entering Pangea through the crumbling western wall. Grid and the residents advanced while cutting through the undead, tracking their source. Eventually they reached a deep cave beneath a cliff. Jiangshi poured from its depths.\n\n\"Kill them...!\"\n\nThe residents' voices dripped with killing intent. They wouldn't forgive the daoist producing jiangshi and attacking Pangea. Because of him, they'd had no chance to restore their city. They'd lost family members. Friends.\n\nGrid stood at the forefront while the light elemental above his head illuminated the dark passage.\n\nHow far had they ventured? Three large jiangshi emerged from the depths. Blood jiangshi. Unlike steel or poison jiangshi, these were crafted from virgin blood mixed with potent drugs—three times faster and stronger. Intelligent enough to be truly dangerous.\n\n\"Heok!\"\n\nThe residents recoiled in dismay. Great despair washed over them at the sight of jiangshi stronger than their warriors.\n\nGrid remained calm.\n\n\"Link.\"\n\nHe unleashed a sword dance, movement flowing like a butterfly's flight. Three blood jiangshi that could threaten an entire army were carved into dozens of pieces within seconds.\n\nGrid's cold gaze found the trembling middle-aged man—the daoist hiding in the cave's depths. The man had gone pale with fright after watching Grid dispatch the blood jiangshi in an instant.\n\n\"You should've at least prepared a black-horse jiangshi if you wanted to deal with me...\"\n\nA chill raced down Grid's spine mid-sentence. The frightened daoist wasn't looking at him. He was looking *behind* him.\n\n*Who...?*\n\nGrid whirled. Wind gusted. Several blacksmiths and residents standing behind him exploded like firecrackers, bodies bursting in sprays of blood. Crushing pressure slammed into Grid's chest.\n\n>[You have suffered 29,590 damage.]\n\nIt felt like a debuff reducing his defense. Grid panted, staring at the man in the full dopo.\n\n>[You have discovered a strong person of this era!]\n>\n>[The Hero King's fighting energy has started to boil!]\n\nThe man stood surrounded by corpses—blacksmiths and residents alike. The yangban Garam wore a distorted smile.\n\n\"I was trying to catch you, but there's a bunch of trash here as well.\""
}