{
  "id": 926,
  "title": "Chapter 926",
  "content": "**REWRITTEN TEXT:**\n\nGaram's words clicked the scattered puzzle pieces into place.\n\nThe sudden East Continent quest. The requirement that only blacksmiths could participate, despite the content being impossible for ordinary blacksmiths to clear. The abnormalities finally made sense.\n\n*This quest was designed to reach only me.*\n\nGrid was the target. The realization brought unexpected calm. After all, he'd found Pagma's Rare Book through an NPC-triggered quest—the system allowed for such targeting. Most player quests originated from NPCs anyway.\n\nGrid reached for a health potion. Garam didn't stop him. Instead, the yangban snorted with derision.\n\n\"Pathetic and ignorant creature. You have committed three sins.\"\n\nThe air around Garam began to vibrate—invisible wind striking space itself in rapid succession.\n\n\"First, an ignorant wretch inherited a yangban's techniques. They may be Pagma's skills, but your very existence degrades the dignity of all yangbans. You deserve erasure.\"\n\nThe vibrations intensified, explosions of compressed air accelerating around him.\n\n\"Second, you dared refuse my offer. You rejected the honor of serving as my slave. Ignorant creatures like you exist only to obey yangbans. You have no right to autonomy.\"\n\n**Crack!**\n\n> [You have suffered 5,800 damage.]\n\n**Crack! Crack!**\n\n> [You have suffered 5,800 damage.]  \n> [You have suffered 5,800 damage.]\n\nBy the time Garam finished his second charge, Grid was drenched in blood. The invisible wind hammered him from all angles, bouncing him around the cave like a billiard ball. Each impact drew a groan. To Garam, Grid looked like a broken puppet—ridiculous and pitiful.\n\n\"Third, you injured me. Common people are livestock—raised according to our taste, then slaughtered at our convenience. Yet you extended your claws and drew my blood.\"\n\nLinked Kill Wave Pinnacle. Grid had chained four sword dances together and opened a shallow cut across Garam's skin. The unfamiliar sensation of pain had been... uncomfortable. It haunted Garam's dreams every night.\n\n\"Verdict delivered. You are sentenced to death.\"\n\nThe wind strikes grew faster, stronger, coalescing into a localized storm. It lifted Grid's body and slammed him into the cave ceiling. The storm circled him like a maddened beast, battering and slicing without mercy. Twenty centimeters deep. Thirty. Forty. Fifty.\n\nEach impact drove Grid deeper into the stone. The cave shook. Grid's vision spun. Blood poured from countless wounds. Garam's smile widened.\n\n\"Insignificant insect.\"\n\nIt felt like releasing a century of pent-up pressure. His pride, trampled by this *bug*, was finally restored. Garam hummed, watching Grid's life drain away.\n\n\"Transcended Link.\"\n\nGrid's health teetered at the edge of death, but he'd been waiting—letting his fighting energy climb to maximum. Embedded in the ceiling, he unleashed dozens of energy blades.\n\nGaram's eyes widened. The red and purple aura wreathing Grid's body screamed danger. He redirected the storm pressure instantly. The violent winds became a gentle shield, canceling the incoming energy blades. But Grid had won his freedom. He dropped to the ground and downed another potion.\n\n\"Dammit,\" Grid muttered, voice shaking. His gaze swept across the terrified survivors—blacksmiths and residents paralyzed by what they'd witnessed. Their companions had exploded like crushed fruit. The casual gesture of a transcendent had stolen lives. Those who remained drowned in helpless despair.\n\nGrid's jaw clenched. \"Did you have to kill them?\"\n\n\"Them?\" Garam sounded genuinely puzzled. \"Who?\"\n\n\"The blacksmiths. The villagers. The people you just murdered.\"\n\n\"Ah, those insects. They cluttered my sight, so I removed them. Do you stop walking to avoid stepping on ants?\"\n\n\"Insects. Ants.\"\n\nWere they truly so meaningless? The blacksmiths who'd followed him to the East Continent. The residents who'd refused to abandon their home. Grid barely knew them—the relationship was too brief for deep familiarity. But he remembered their dreams vividly. Their determination to build better lives. They'd struggled, same as him. They couldn't be dismissed as insects.\n\nGrid's fists clenched with uncontrollable fury. His gaze dropped to Tiramet's Belt. The unique-rated item had been stuck at 96% experience forever. Now it sat at 97%. Garam's casual assault—dozens of attacks—had pushed it over in seconds.\n\n*I cannot win.*\n\nGrid hated Garam with every fiber of his being. From their first meeting, Garam had been utterly detestable. But Grid had to acknowledge reality. Garam's level approached six hundred. His stats were overwhelming.\n\n*In a straight fight, I lose. Still...*\n\nThe purple-red energy crackling around Grid flickered as he turned. The trembling blacksmiths and residents stared at him with hollow eyes.\n\n*I can buy time for them to escape.*\n\nGaram was overwhelmingly powerful—Grid's fighting energy consumption and his belt's rapid experience gain proved it. But that same power made Garam careless. He'd already dropped his guard twice. Grid believed there would be one more opening.\n\nHe sent a whisper to Jin Haecheong.\n\n—*I'll buy time. Get everyone out.*\n\n—*I don't understand what's happening...*\n\n—*The quest ends here. You came to the East Continent because of me and lost levels and stats. I'm sorry.*\n\n—*Don't say that! What you've given us far outweighs some levels and stats! Coming here was worth it!*\n\n—*Thank you.*\n\n—*Please... stay alive!*\n\nJin Haecheong ended the whisper and made eye contact with the other blacksmiths. They had to save the residents. Unlike players, villagers only had one life. Remembering the past three days spent crafting together, the blacksmiths felt compelled to protect them.\n\n\"I don't understand why you cling to meaningless existence,\" Garam said mockingly as people began to move. His tone made clear he had no intention of letting them leave.\n\nThe air around him began exploding again.\n\n\"Pagma's Swordsmanship.\"\n\nGrid surged forward. One step, two steps—his dance strides shorter than usual as the Enlightenment Sword howled.\n\n\"Linked Kill Wave Pinnacle!\"\n\nGaram's face twisted for the first time. Grid had deliberately provoked him with the technique that had wounded him before. The bait worked—Garam forgot about the fleeing residents entirely.\n\nAbandoning his smoking pipe, Garam drew a short spear and intercepted the bombardment. He deflected energy blades with sweeping cuts, then raised the spear overhead to block the final lightning-fast strike. The entire sequence of Linked Kill Wave Pinnacle shattered against his defense.\n\nGrid had expected this. He didn't falter. Garam, however, recoiled as black flames erupted from Grid's blade.\n\nThe inferno engulfed him. The cave shuddered. Garam stumbled backward. The blacksmiths seized the moment and ran with the residents.\n\n\"Kkgh! Kuaaaah!\"\n\nGaram screamed—not from pain, but from humiliation. He was unharmed. Only the tips of his hair were singed. Still...\n\n\"Your pride stings, doesn't it?\"\n\nExactly. Garam had planned to crush Grid like an insect. To watch him die without resistance. Instead, Grid had struck back *again*, damaging Garam's body. Merely burned hair, but...\n\n\"You! Youuuu!\"\n\nThe wound to Garam's pride ran deeper than any physical injury. He'd drawn a weapon. He'd unleashed his wind powers. And this *insect* had still counterattacked.\n\nGaram's spear lashed out in fury, severing Grid's arm and hurling him into the cave wall. The reach and speed had doubled. The spear became a blur of strikes, driving Grid deeper into the cavern. Even summoning the light elemental and Blade Aiming at the Gods couldn't stem the onslaught. Grid was pushed into the depths.\n\n\"Cowardly bastard!\"\n\nGaram's spear thrust for Grid's heart—he had nowhere left to retreat. A single scratch from that spear dealt ten thousand damage. A vital strike would be instant death.\n\nGrid activated Blackening and Quick Movements simultaneously. \"Revolve!\"\n\nHe counterattacked instead of dodging. In a fraction of a second, Grid's sword caught the spear tip and redirected it. The weapon plunged toward Garam instead. Or seemed to.\n\n\"Predictable.\"\n\n**Shunpo.**\n\nGaram used the ultimate footwork technique—movement through space itself. The instant Grid countered, Garam appeared at his side. The spear only pierced the afterimage he'd left behind. Garam's hand clamped around Grid's face like a vice.\n\n**Wham. Wham. Wham.**\n\n> [You have suffered 4,900 damage.]  \n> [You have suffered 5,150 damage.]  \n> [One eye has been severely damaged. Your field of vision is impaired. Movement has been hindered.]\n\nGrid's face became unrecognizable pulp. Blood streamed between Garam's fingers. Grid couldn't even groan. Garam's expression was demonic.\n\n\"I don't understand. You're just an ignorant worm. Why do you insist on provoking me? What could you possibly believe in?\"\n\nGaram blamed Grid entirely. Treated him as the sinner. But Grid wasn't a sinner.\n\nHe was a king.\n\n\"Once again...\" Grid's mangled lips moved. Through ruined flesh, he glared directly into Garam's eyes. \"I will not... bow to you.\"\n\n\"What?\"\n\nGaram had expected begging. His ears were contaminated. He summoned a gale that shattered the light sword and Blade Aiming at the Gods, then slammed Grid's face into the stone floor.\n\n> [The **First King** title effect has activated.]  \n> [A protective shield containing all health lost in the last minute has been created.]  \n> [All terrain adaptability has increased by 100%. Movement speed and defense have increased by 10%.]\n\nA brilliant orange barrier formed around Grid. Fully adapted to the cave terrain now, he activated Ruson's Power—amplifying speed further and gaining blood scent tracking. Grid moved.\n\nGaram's spear thrust struck only air, embedding in a limestone stalactite instead.\n\n\"Slippery rat!\"\n\nGaram abandoned his remaining pride and unleashed his second power—the holy attribute. Meanwhile, Grid spotted the daoist cowering in a corner and ran him through. The man crumbled to ash under the sword's destructive force.\n\n\"If I'm dying anyway, might as well get more loot.\"\n\nGaram's response was volcanic. \"Y-You! You *snake*!*\"\n\nWas Garam angry about Grid earning rewards? His killing intent surged beyond anything before. Grid activated Belial's Power and used Item Combination, fusing the Enlightenment Sword and Blade Aiming at the Gods.\n\n\"Youuuuu!\"\n\nGaram looked like a man possessed. His eyes were manic as the spear blurred toward Grid's heart. But the weapon never reached its target.\n\nA vampire erupted from Tiramet's Belt—which had just achieved legendary rating. Tiramet caught the spear shaft with both hands.\n\n\"Nyaaong!\"\n\n\"Pagma's Swordsmanship.\"\n\nLightning burst from Noe's mouth. Randy—wearing Grid's copied appearance—flanked Garam's opposite side. Three allies converged on the yangban's vital point.\n\n\"Linked Kill.\"\n\nConsecutive energy blades fired at point-blank range. Grid's level and stats were vastly inferior to Garam's, but the super-myth-rated weapon combined with the rune's power carved through Garam's defenses.\n\n\"Kgh!\"\n\nGaram coughed blood. In that instant, Grid understood why Garam had panicked and exposed an opening.\n\n> [★Hidden Quest★ **Hunt the Daoist** has been cleared.]  \n> [You have acquired three elixirs as a quest reward.]  \n> [A linked quest will occur as an additional reward.]  \n> [**Return to the West Continent**...]  \n>   \n> [★Hidden Quest★  \n> Thanks to your efforts, the people of Pangea have regained peace. Pangea will now stand independently.  \n> **Quest Clear Conditions:** Return to the West Continent within 24 hours.  \n> **Quest Reward:** Pangea's Secret Dungeon Pass.]  \n>   \n> [Cross-continental travel restrictions have been lifted.]\n\n\"Ah.\"\n\n\"*Griiiid!*\"\n\nGaram's powers erupted wildly. Noe, Randy, and Tiramet were swept up in the chaotic magic and turned to grey ash. Garam lunged—\n\nBut Grid had already vanished in a flash of light.\n\n\"Goodbye, you arrogant bastard.\""
}