{
  "id": 928,
  "title": "Chapter 928",
  "content": "\"Dexterity? Why the hell is it *dexterity*?\"\n\nGrid stared at the notification in disbelief. Players could only invest stat points into the four core attributes: Strength, Stamina, Agility, and Intelligence. Standard elixirs followed the same pattern, boosting only those four stats. So why—\n\nUnderstanding struck him like a hammer blow. These weren't ordinary elixirs.\n\n\"They can raise special stats too.\"\n\nHe pulled up his character sheet, eyeing the list: Dexterity, Persistence, Composure, Indomitable, Dignity, Insight, Courage, Political Power, Demonic Power, Luck, and Deity.\n\n'Deity's obviously off the table.' That myth-rated stat only grew when enough people deified him—when faith transformed perception into power. A random elixir wasn't going to touch it.\n\n'Which leaves ten possibilities.' \n\nHis mood soured. Most of those stats ranged from situational to actively useless. Composure's resistance to status effects? Pathetic compared to a Legendary class's complete immunity. Indomitable's chance to nullify damage? He'd rather trust a fortune teller. With his luck, that \"chance\" might as well read zero.\n\nDignity was already capped thanks to the Overgeared King's Crown. Insight's ability to read enemy movements had known limitations—useful, but nothing to obsess over. And Dexterity? He practically breathed the stat. Every item he forged pushed it higher. At 3,967 base plus 880 from equipment, he was nearly at 5,000. He needed it like he needed another hole in his head.\n\n'Persistence practically raises itself. Demonic Power is worthless. Political Power, Courage...'\n\nPolitical Power did have merit. As a king, higher domestic development speed meant faster infrastructure growth, better resource generation. But it wasn't critical. Courage offered marginal gains—a measly 0.1 boost to attack and defense per point, laughable compared to the 0.6 attack increase from Strength or the 0.9 defense from Stamina after Third Awakening.\n\nWhich left one stat.\n\n'Good Luck.'\n\nThe stat that increased beneficial probabilities. Crafting success rates. Enhancement odds. Critical hits. Drop rates. Quest rewards. For someone cursed with Grid's catastrophic luck, it was salvation in statistical form. Better yet, titles didn't affect it—every point had to be earned, making each increase precious.\n\n\"Right.\" He clutched the remaining elixirs like prayer beads. 'Please be Good Luck. I'll even take Political Power or Courage. Just not Demonic Power. And definitely not more Dexterity.'\n\nHe uncorked the first bottle. \"Down the hatch.\"\n\nThe liquid fire burned down his throat.\n\n[The random elixir effect has increased dexterity by 10 points.]\n\nHe closed his eyes. Opened the second.\n\n[The random elixir effect has increased dexterity by 10 points.]\n\n\"...\"\n\nCruel. That's what this was. Pure, distilled cruelty. He pulled his knees to his chest, arms wrapped tight around his legs. The ridiculousness of hoping for anything from his luck finally, truly hit home. \"Should I just... delete my character and start over?\"\n\n\"Nyang?\" Noe's concerned chirp came from his shoulder.\n\n\"No. Can't even joke about that.\" Grid reached up to stroke the demonic beast's silky fur. Above them, the sky stretched impossibly blue and clear, as if the heavens themselves were mocking him. Noe, blissfully unaware, leaned into the touch and rubbed his face against Grid's chest.\n\nThe simple affection eased something tight in Grid's chest. \"You know what? Sometimes it's enough just to sit here.\"\n\nHe didn't know how long he stayed like that—time moved strangely when you stopped caring about it. Eventually, voices shattered the peace.\n\n\"Grid!\"\n\nHe looked up. The blacksmiths. Seventy-seven of them, returned from Pangea ahead of schedule.\n\n\"Made it back in one piece, I see.\"\n\n\"The quest cleared, right? You must've seen the notification.\"\n\n\"Yeah... about that.\" The words caught in his throat as he studied their faces. Seventy-seven survivors. Twenty-three dead. Those deaths hung heavy on his conscience—his reckless decision to accept that quest had nearly gotten them all killed by Garam. The terror in their eyes when that yangban appeared, the desperation as they scrambled to escape...\n\n'They nearly died because I dragged them into this.'\n\nOne of the blacksmiths must have read his expression. \"Hey, don't look like someone died. Well, technically some people did, but the ones who made it back early are celebrating! We all scored massive rewards thanks to you.\"\n\n\"Exactly,\" another chimed in. \"So what if we lost a level and some dexterity? We're rolling in gold.\"\n\nA third stepped forward. \"We talked it over on the way back. Those blessed enhancement stones—we want to sell them to Overgeared members only. Feels wrong selling this stuff to outsiders when you're the reason we have it. We'll give you guys a discount.\"\n\nWarmth spread through Grid's chest. But business came first. \"Sell them to me before offering them to anyone else.\"\n\n\"What? Oh, of course! Actually, no—you know what? Just take half for free—\"\n\n\"I'm paying full price.\"\n\nThe blacksmith blinked. \"But—\"\n\n\"Full. Price.\" Grid's tone left no room for argument. \"This kingdom doesn't run on charity. You earned those stones, you get paid for them. Besides—\" he allowed himself a small smile, \"—I need you motivated to keep producing quality work. Can't have my best smiths thinking I'm some freeloader king.\"\n\nThe effect was immediate. The blacksmiths practically glowed, respect and affection radiating from them in waves.\n\n'He's really not like other nobles.'\n\n'This is why even high-rankers bow to him.'\n\n'Even Katz treats him like an equal...'\n\nTheir admiration reached a boiling point. \"Then at least take these!\" One of them thrust forward a pouch bulging with vials. \"The elixirs—we can't use them anyway!\"\n\n\"Can't use them?\"\n\n\"Grid, we're production workers. Our builds are stamina, dexterity, and persistence. These random elixirs? The odds of getting what we need are terrible. It's basically gambling with two hundred million won per bottle.\"\n\nGrid decided honesty was the play here. \"They can raise dexterity. I know because I just drank two and got dexterity both times.\"\n\n\"Ha! Grid, you're too generous—\"\n\n\"I'm serious. It really does raise dexterity.\"\n\n\"You don't need to downplay it for our sake.\"\n\n\"Right,\" another agreed. \"We're ordinary blacksmiths with maybe a few hundred points in combat stats. These elixirs are wasted on us. Better if you use them, no matter how much we spent.\"\n\n\"...\"\n\nThey had a point. For smiths who barely scraped together any combat stats, gambling on random elixirs was lunacy. But the market value... two hundred million won minimum, sometimes hitting three hundred million. Katz, that trust fund kid, supposedly bought them by the crate at that price. Two hundred and thirty-one elixirs at even the low estimate meant 46.2 billion won.\n\nNobody had that kind of liquid capital. Not even Grid.\n\nAnd for items that might just boost dexterity again? The cost-benefit analysis was brutal.\n\nWhile he hesitated, one blacksmith cut through his thoughts: \"We're not trying to sell them, Grid. We're *giving* them to you. Please, just use them.\"\n\n\"But the value—\"\n\n\"Value we'd never have seen without you. The production methods alone made us rich. The enhancement stones are icing. We'd be greedy bastards to demand more.\" The smith grinned. \"Besides, call it an investment. Who knows what you'll slip us next time if we're on your good side? Maybe another production method you don't need? Wouldn't that be nice?\"\n\nAh. There it was. Not pure altruism—enlightened self-interest. Help Grid, Grid helps back. It was almost refreshing.\n\nAfter a long moment, Grid accepted the pouches. \"I won't forget this. When I can repay you, I will.\"\n\n\"We're counting on it.\" The lead blacksmith's smile was genuine. \"Just remember us little guys when the next opportunity comes around.\"\n\nOne hundred blacksmiths had embarked on that chaotic adventure. One hundred now formed the core of his most devoted followers, spreading his reputation through every workshop and forge in the kingdom.\n\n***\n\nThump. Thump. Thump.\n\nAlone in his office, Grid's heart hammered against his ribs. After saying goodbye to the blacksmiths, he'd returned to the castle. He'd whispered sweet nothings to Irene until she blushed, reviewed Lauel's latest reports, kissed baby Lord's sleeping forehead. Normal evening routine, except for the mountain of elixir bottles covering his desk.\n\nTwo hundred and thirty-one vials of iridescent liquid that looked less like salvation and more like a threat.\n\nHis back was already soaked with nervous sweat.\n\n'What if I drink all of this and only get dexterity and demonic power?'\n\nThe thought paralyzed him. But they were free. Any stat gain was technically profit. He forced his breathing steady, released his desperate hopes, and made a solemn vow: even if all two hundred and thirty-one bottles boosted nothing but dexterity, he'd accept it with dignity.\n\nThen he drank the first one.\n\n[The random elixir effect has increased dexterity by 10 points.]\n\nSecond.\n\n[The random elixir effect has increased dexterity by 10 points.]\n\nThird.\n\n[The random elixir effect has increased courage by 10 points.]\n\nHis head snapped up.\n\n[The random elixir effect has increased agility by 10 points.]\n\n[The random elixir effect has increased indomitable by 10 points.]\n\n[The random elixir effect has increased dexterity by 10 points.]\n\n[The random elixir effect has increased courage by 10 points.]\n\n[The random elixir effect has increased good luck by 10 points.]\n\n[The random elixir effect has increased political power by 10 points.]\n\nEach bitter swallow brought a new notification. His expression shifted from resignation to hope to outright joy. The pattern became clear: no Demonic Power. Lots of Agility. Even more Good Luck.\n\nThis was actually working.\n\n\"Gah!\" Around bottle one-fifty, his stomach lurched. He grabbed his bloated midsection as an unexpected window appeared.\n\n[Your courage stat has reached 1,200 points. The effect of the courage stat has increased. Every one point in courage now raises attack power and defense by 0.2.]\n\n[Your good luck stat has reached 400 points. The chances of a beneficial effect will greatly increase.]\n\nThreshold bonuses. His stats were breaking into new tiers. Grid's hands moved faster, practically chugging the remaining elixirs. He needed to test whether that \"greatly increased\" luck was real or just flavor text.\n\n[The random elixir effect has increased strength by 10 points.]\n\n[The random elixir effect has increased intelligence by 10 points.]\n\n[The random elixir effect has increased dexterity by 10 points.]\n\n[The random elixir effect has increased good luck by 10 points.]\n\n[The random elixir effect has increased good luck by 10 points.]\n\n\"YES!\" He slammed the last empty bottle down. Good Luck had skyrocketed to 631 points. For the first time in his life, fortune actually smiled on him. He could *feel* it, like standing in warm sunlight after months in the cold.\n\nThis high wouldn't last. He needed to strike while lady luck was watching.\n\nGrid yanked hundreds of blessed enhancement stones from his inventory, fingers already reaching for the Ancient Weapon Enhancement Scrolls. The +1 Enlightenment Sword and +0 Valhalla of Infinite Affection practically begged for upgrades.\n\n\"Just get to +2! Please, +2! Even just +2!\" \n\nHe slotted a stone into the Enlightenment Sword and activated it.\n\n[The item enhancement has failed.]\n\nThe notification blinked. Again. And again. Thirty times in rapid succession.\n\nGrid didn't flinch. Myth-rated items had abysmal enhancement rates. Thirty failures meant nothing.\n\n[The item enhancement has failed.]\n\n[The item enhancement has failed.]\n\nFifty failures.\n\nHis confidence wavered. Sweat dripped down his temple.\n\n[The item enhancement has failed.]\n\nThen—\n\n[The item enhancement has succeeded.]\n\n[The +1 Lightning Sword Born from Enlightenment and Strong Desires has been successfully enhanced to +2!]\n\nBefore he could celebrate—\n\n[The item enhancement has succeeded.]\n\n[+2... enhanced to +3!]\n\n[The item enhancement has succeeded.]\n\n[+3... enhanced to +4!]\n\n[The item enhancement has failed.]\n\n\"Three. Three in a row. Three consecutive successes on a *myth-rated* item.\"\n\nHe stared at the glowing blade in his hands, barely processing what had happened. Enhancement systems were the cruelest lottery in any game—pure probability wrapped in heartbreak. The despair of failure made success feel transcendent.\n\n[You are the first player to succeed in enhancing a myth rated item to +3!]\n\n[The perk has increased the damage of the target item by 1%.]\n\n[You are the first player to succeed in enhancing a myth rated item to +4!]\n\n[The perk has increased the damage of the target item by 2%, and added the 'setting sun' effect.]\n\n\"...\"\n\nThe Enlightenment Sword blazed orange, light spilling between his fingers like liquid fire. It looked like he was holding the sun at dusk. Grid couldn't look away—he literally couldn't, transfixed by the impossible beauty of what he'd created.\n\nMinutes passed before he remembered he had more stones.\n\nThe Enlightenment Sword stopped at +4 after burning through his weapon scrolls. Valhalla of Infinite Affection climbed to +3.\n\n[+4 Lightning Sword Born from Enlightenment and Strong Desires\nAttack Power: 4,611]\n\n[+3 Valhalla of Infinite Affection\nDefense: 1,622]\n\n\"Ha... hahahaha!\"\n\nPower surged through him. Not metaphorical power—actual strength, flooding his body like liquid lightning. Every stat increase, every enhancement level, crystallizing into something he could *feel*. He'd become several times stronger in a single night.\n\nAll because of luck. Because for once, just once, the universe had stopped kicking him while he was down."
}