{
  "id": 929,
  "title": "Chapter 929",
  "content": "Two hundred and thirty-four elixirs. Two thousand, three hundred and forty stat points.\n\nGrid stared at his status window, still processing the windfall. Even with only a tenth distributed to his core attributes, that was over two hundred points—equivalent to twenty levels worth of raw power. Add in the substantial boost to his good luck stat and his successful item enhancements, and his trip to the East Continent had catapulted him forward.\n\n*I jumped several stairs at once.*\n\nThe thought brought a bitter smile. Several stairs. What a joke.\n\n\"...Garam.\"\n\nThe name alone deflated his momentary euphoria. Compared to that yangban, Grid was still a helpless child. A few stairs? He'd need to climb hundreds just to meet Garam at eye level. And that was only one obstacle. The continent teemed with monsters—human and otherwise—that could crush him without breaking stride.\n\n*Still not enough. Nowhere near enough.*\n\nThe hunger returned, sharper than before. Faces flashed through his mind: Euphemina, Faker, Regas, Yura, Jishuka, Chris. Geniuses, all of them. He'd watched them hunt, seen how they never repeated the same mistake twice, how they absorbed and applied lessons with frightening speed. Sometimes it gave him chills—the gap in raw interpretation felt like comparing a child's scribbles to a master's brushwork.\n\nAnd then there was Kraugel. The *real* genius.\n\nGrid clenched his fist. \"Next year won't be enough. Maybe not the year after either. But I'll get there—I'll bury them under my stats and items until the difference doesn't matter.\"\n\nThey were his rivals. His inspiration. As long as they kept climbing, so would he.\n\n***\n\nLauel didn't merely govern the Overgeared Kingdom—he cultivated it. His responsibilities extended to ensuring every guild member had access to the best possible growth opportunities. The Galgunos Temple represented weeks of research, a hunting ground that poured experience into anyone strong enough to survive it.\n\nNo elixirs like the vampire cities. No rare accessories. Just pure, concentrated experience.\n\nThe catch? The difficulty was hellish.\n\n> [You have entered the Galgunos Temple.]\n>\n> [You can feel the source of the demonic energy.]\n>\n> [All stats decreased by 10%. Health recovery decreased by 50%.]\n>\n> [You have resisted.]\n\n\"Charming atmosphere.\"\n\nGrid surveyed the labyrinthine corridors, shaking off the curse's residual pressure. According to Lauel, Pon, Regas, and Chris had been grinding here for days. Even without curse resistance, they found it manageable.\n\n*Those three wouldn't party up if their lives depended on it. They're probably scattered across the entire temple, competing over kill counts.*\n\nMonsters—that's what they were.\n\nA figure materialized from the shadows ahead. Galgunos' messenger, a humanoid construct radiating demonic energy, charged with startling speed. At least two thousand agility, Grid estimated.\n\nHe yawned and sidestepped.\n\nCompared to Garam's impossible velocity, this was nothing. His counterstrike found the weak point between armor plates.\n\n> [Critical Hit!]\n>\n> [16,940 damage dealt!]\n>\n> [Black flames explode!]\n\nThe messenger's health bar dropped a tenth in one strike. Grid's enhanced good luck stat had his critical hits and elemental procs triggering constantly. Black flames and red lightning erupted with almost every swing.\n\nFive seconds. That's all it took.\n\n> [Galgunos' Messenger defeated.]\n\n\"Now that's what I'm talking about.\"\n\nNo item drops—ungrateful bastard—but the experience matched a direct vampire's. For a regular mob, that was insane value.\n\n\"I'm camping here until the National Competition starts.\" Grid grinned. \"No wonder those three wouldn't leave.\"\n\nHe needed levels. Raw power. Time to stop neglecting the fundamentals.\n\n\"**Summon Tiramet!**\"\n\nDark energy coalesced from his belt, materializing into a sharp-eyed vampire with wild hair—far more aggressive looking than the typical pretty-boy bloodsucker aesthetic.\n\n\"Um...\" Despite his fierce appearance, Tiramet flinched like a kicked puppy, immediately dropping into a combat stance.\n\nGrid almost laughed. Of course the poor guy was traumatized—last time Grid had summoned him, Garam had instantly deleted him from existence.\n\n\"Hey, relax. No yangbans here. You're safe.\" Grid clapped his shoulder, earning another nervous twitch. \"Here, try these on.\"\n\nHe produced a full equipment set:\n\n<span class=\"quality-unique\">+7 Duliani's Sword</span>\n**Rating:** Unique\n**Attack Power:** 1,890 | **Defense:** 340\nGenerates a shield when attacked, proportional to maximum health. Stacks up to five times.\n\n<span class=\"quality-unique\">+7 Emous' Armor</span>\n**Rating:** Unique\n**Defense:** 930\nDamage reduction: 12% | Health recovery: +50%\n**Set Bonus (2pc):** +10,000 Health\n\n<span class=\"quality-unique\">+7 Emous' Helmet</span>\n**Rating:** Unique\n**Defense:** 675\nCritical hit chance reduced by 20%\n**Set Bonus (2pc):** +50 Defense\n\n\"The gloves and boots are only epic quality, but use them for now. I'll craft proper ones when I find the rest of the set's production methods.\"\n\n\"I understand...\" Tiramet equipped everything with mechanical obedience, standing at attention beside Grid.\n\n*Good. Just like his status window suggested.*\n\nUnlike Iyarugt—who behaved like an NPC with an attitude problem—Tiramet had fully transitioned into pet parameters. Unlimited summoning duration, scaling stats, actual loyalty. Right now he was weak and demoralized, but with proper leveling? He could become Grid's second-best partner after Noe.\n\n\"Do your best for me.\"\n\n\"...Yes. I am honored to serve the master who holds the Qualification of a Blood King.\"\n\n*Oh, that's interesting.*\n\nSo Tiramet's compliance wasn't just pet programming—his title provided natural loyalty from vampire subordinates. Which meant eventually, when he could summon Earl Elfin Stone...\n\n*That arrogant bastard will have to kneel.*\n\nThe thought brought savage satisfaction.\n\nAs for Iyarugt, Grid had loaned the demonic sword to Peak Sword. The sheath synergized too well with Peak Sword's build to waste, and Peak Sword could level the ego weapon while using it. Win-win.\n\n\"Alright. Let's move.\"\n\nGrid called forth his full roster—Overgeared Skeletons, Noe, Randy—and pushed deeper into the labyrinth.\n\nThe messengers came in waves.\n\nGalgunos might be merely a great demon's servant, but he was still a lich of considerable power. His temple channeled endless demonic energy through stone idols, fueling the messengers' explosive attack patterns.\n\nNone of it mattered.\n\n> [Your pet 'Tiramet' has recovered from damage received.]\n>\n> [Your pet 'Tiramet' has recovered from damage received.]\n>\n> [Your pet 'Tiramet' has recovered—]\n\n\"**Pagma's Swordsmanship: Link!**\"\n\n\"**Pagma's Swordsmanship: Wave!**\"\n\nTiramet anchored the frontline while Grid and Randy carved through the mob. The messengers hit hard, but the Overgeared Skeletons disrupted their offense with silver thread strikes from range, closing in to break joints and limit mobility when openings appeared.\n\n\"Punish the intruders!\"\n\nNew contacts. Grid's head snapped toward the rear entrance.\n\nRobed messengers—mages. Damn it.\n\nRed magic circles blazed to life across the chamber. Dozens of spell formations targeted his party simultaneously.\n\nGrid could tank them. Randy and the Skeletons? Dead.\n\n*Was planning to level them more before—*\n\nMassive fireballs streaked toward his summons. Grid considered using Transcended Link to intercept, but the splash damage from the explosions would still wipe them. And Lauel had specifically warned him to save Blackening and Quick Movements for the intermediate bosses.\n\nHe prepared to resummon them after they died.\n\n> [Your pet 'Noe' has leveled up!]\n>\n> [Noe has reached level 100 and acquired a new skill!]\n\n\"Nyaang!\"\n\nNoe's tiny form appeared between the fireballs and the party. His paws rose.\n\nA curtain of crackling lightning materialized, a barrier of pure electrical fury that detonated every incoming spell on contact.\n\nThe explosion lit the chamber like a sun going nova.\n\nWhen the light faded, Noe sat there looking smug, not a hair singed.\n\n\"...What?\"\n\nEven the messengers seemed confused.\n\n\"Nyahahahat! This is a memphis, the best demonic beast of hell... Nyang...\"\n\nGrid didn't waste the opening. He blitzed the rear line, **Link** tearing through robed mages before they could cast again. Once the casters were down, he circled back to help Tiramet clean up the remaining warriors.\n\nOnly then did he check Noe's new skill.\n\n<span class=\"quality-SSS\">Become Majestic</span>\nHell's greatest demonic beast has pushed the thunder stone's power to its apex. Creates a lightning shield that blocks all attacks for two seconds.\n**Cooldown:** 30 minutes\n*User becomes drained for one minute after activation.*\n\n\"I love you, Noe.\"\n\nGrid meant it. He scooped up the cat and pressed his face into the soft fur, rubbing affectionately.\n\nNoe purred, radiating smug satisfaction.\n\n\"Grid, I also leveled up. You should hug me too.\"\n\n\"Y-Yeah, Randy. Once you're out of transformation.\"\n\n*Clack! Clack clack clack!*\n\n\"Congratulations to you too, Skeletons.\"\n\n***\n\nGrid's pace through the temple was brutal—easily four times faster than Pon, Regas, or Chris could manage solo. Within thirty minutes, both Tiramet and the newly-reset Noe had filled massive chunks of their experience bars.\n\nGrid's own gauge climbed steadily.\n\nSomewhere out there, the experts who'd been smugly discussing his fall to rank 80 were about to eat their words."
}