{
  "id": 93,
  "title": "Chapter 93",
  "content": "# Chapter 93\n\nPhoenix slammed his fist against the bedframe. \"Half a day. The lady has been missing for half a day and you incompetent bastards still have nothing?\"\n\nHis voice cracked. Blood seeped through the bandages wrapped around his chest. The wound was deep, carved into the flesh just millimeters from his heart by the Eighth Servant's blade. Every breath was agony. Every word cost him.\n\nA knight stepped forward, hands raised. \"Captain, please. We're searching every—\"\n\n\"I don't want excuses.\" Phoenix tried to sit up. His vision blurred. \"I want results.\"\n\nThe invasion had happened while he lay unconscious in the infirmary. A high-ranking elder of the Yatan Church had infiltrated Winston Castle, brainwashed the administrator, slaughtered the guards. By the time Phoenix woke, Irene was gone.\n\n*She's already been kidnapped once. The trauma nearly broke her then. And now...*\n\nDoran wasn't here anymore. No one was watching over her.\n\nPhoenix gripped the sheets. His knuckles turned white.\n\n*I have to move. I have to find her.*\n\n\"Ohhhh...\" The groan escaped before he could stop it. He swung his legs off the bed.\n\n\"Captain, no!\" \n\nThree knights rushed forward. Phoenix ignored them. He planted his feet on the cold stone floor. Blood dripped from beneath the bandages, pattering onto the ground like rain.\n\n\"If the lady isn't found, the castle will collapse.\" One of the knights grabbed his shoulder. \"You're safe here. Moving now will only make things worse.\"\n\nPhoenix shoved him away. \"Safe? You think I care about being safe when my lady is—\"\n\nThe door crashed open.\n\nA soldier stumbled into the room, gasping for air. \"The lady. She's back.\"\n\n***\n\nPhoenix dropped to his knees the moment Irene entered the infirmary. The impact sent fresh pain lancing through his chest. He didn't care.\n\n\"My Lady.\" His voice was hoarse. \"Your faithful subject failed to protect you. This sin will stain three generations. Please... kill me.\"\n\nIrene rushed forward. Her hands fluttered near his shoulders but didn't touch, as if afraid he might shatter. \n\n\"Sir Phoenix, stop this.\"\n\nBlood dripped steadily from the bandage around his chest. His skin was the color of ash. His lips had turned blue. The knights watching from the doorway had seen men die with better color in their faces.\n\nPhoenix bowed his head lower. \"It proves I neglected the castle's security. This is my—\"\n\n\"Be quiet!\" \n\nThe shout froze everyone. Irene never raised her voice. Never showed anger. Phoenix's mouth fell open.\n\nIrene's hands were shaking. \"This incident is my fault. I didn't increase the guard after you were injured. You have no responsibility.\" Her voice softened. \"So stand up. Please. I will be truly sad if you leave my side like Doran did.\"\n\nSomething in Phoenix's chest, tighter than the bandages, finally loosened. He exhaled slowly. Then he looked up and met her eyes.\n\n\"Was it the Yatan Church? Did they try to sacrifice you again?\"\n\nIrene shuddered. The memory of Malacus's cold eyes made her skin crawl. The fear of death, twice experienced, was a weight she couldn't bear. When she spoke, her voice trembled.\n\n\"I lost consciousness. When I woke, there was a man. The Sixth Servant. Malacus.\"\n\n\"What?\" Phoenix staggered to his feet. Around him, the knights erupted into chaos.\n\n\"A servant dared invade Winston?\"\n\n\"They're preparing for war!\"\n\n\"We must tell Earl Steim. Mobilize the army. Burn the main temple to ash.\"\n\nPhoenix held up a hand. The knights fell silent. Something didn't add up. The servants of Yatan were monsters in human skin. Malacus was famous for his cruelty. Irene shouldn't have been able to escape. He wouldn't have let her go.\n\n\"Who saved you?\"\n\nFew virgins kidnapped by the Yatan Church ever returned. Irene was one of them, but only because Doran had pulled her from the fire. Doran was gone now. And even he would have struggled against one of the Eight Servants.\n\n*Whoever did this must be incredibly powerful. But who in Winston has that kind of strength?*\n\n\"That person.\" Irene pointed.\n\n\"Huh?\" Phoenix turned. His eyes widened. \"You?\"\n\nGrid stood near the back of the room. He raised one hand in a half-wave. \"Haha, hello?\"\n\nPhoenix knew Grid as a blacksmith. A good one, certainly. But just a blacksmith. How could he possibly have saved Irene? Against Malacus?\n\n*Did he outsmart him somehow? But he doesn't seem... no, wait.*\n\n\"Mr. Grid is very strong.\" Irene's voice was steady now. \"He killed Malacus with his companions. Then he rescued me and destroyed the rest of the followers.\" She smiled. \"A hero.\"\n\n\"My Lady?\" Phoenix stared at her. Something in her gaze when she looked at Grid... it was soft. Warm. The look of a virgin toward someone she admired.\n\nPhoenix shook his head and studied Grid properly. The man had removed all his equipment in the safe zone. He looked scruffy, unremarkable. But beneath that... Phoenix could see it now. The weight of reputation. The presence of someone who had walked through hell and survived.\n\n*He must hide his identity. Blacksmithing is just a hobby. He's built his reputation in ways I can't imagine.*\n\nPhoenix bowed. \"Thank you. You are the savior of Winston and our lady. I will never forget this grace.\"\n\nGrid blinked. Then a notification window appeared in his vision.\n\n> **[Quest Success!]**\n>\n> **[Affinity with Irene, Winston's lady, has risen to the maximum.]**\n\n*Good.* \n\nThe quest had been easier than expected. And the rewards for an A-grade quest were always terrific.\n\n\"Mr. Grid.\" Irene stepped closer. She held out a small box. \"This is a token of my sincerity.\"\n\n> **[<span class=\"rarity-unique\">Doran's Ring</span> has been acquired.]**\n\nGrid opened the box. Inside was a blue ring that seemed to glow faintly in the dim light. \n\n\"This is...\"\n\n\"Please swear to me that you will cherish this ring.\" Irene's expression was earnest. \"It is a keepsake from the one who saved my life.\"\n\n\"You mean Doran?\" Grid closed the box carefully. \"I have a connection with him as well. I'll treasure it.\"\n\n\"Will you swear?\"\n\n\"Of course.\"\n\n> **[<span class=\"rarity-unique\">Doran's Ring</span> has been attached to you.]**\n\nGrid's stomach dropped.\n\n*No. No, no, no.*\n\nIn Satisfy, death had teeth. Experience loss. Durability damage. And worst of all, the chance of dropping equipped items. Regaining dropped items was nearly impossible. Other players snatched them up. Monsters devoured them. Hours of work could vanish in seconds.\n\nThat's why bound items existed. They never dropped, even on death. The system protected them. But they also couldn't be sold. Couldn't be traded. They were yours forever, whether you wanted them or not.\n\n*Dammit. Dammit, dammit, dammit.*\n\n<span class=\"rarity-unique\">Doran's Ring</span> was a top-tier accessory. Epic rating. But Grid could already resist most status conditions thanks to his class skills. He didn't need the poison and curse protection. He'd been planning to sell it. The ring could fetch tens of thousands of gold, maybe more.\n\n*It's bound to me. It's bound and I can't sell it and I just lost a fortune.*\n\nHis hands clenched. He forced them to relax. Forced his face into a smile.\n\n*Think positively. It's still a good ring. Health bonus. Damage recovery. It's useful.*\n\nHe slipped the ring onto his finger instead of putting it in his inventory. The metal was cool against his skin.\n\n*I like it. I get to wear such a nice ring. Haha. I feel... good.*\n\nIrene's smile widened. Her cheeks flushed. \"Mr. Grid, I will organize a feast in your honor soon. I hope you will attend.\"\n\n\"Yes.\" Grid's voice came out flat. He cleared his throat. \"Yes, I'll be there.\"\n\nHe left before anyone could see his expression crack. The walk back to Khan's smithy felt longer than usual. Khan was already asleep by the time he arrived. The smithy was dark and quiet. Grid sat at the workbench and pulled up his inventory.\n\n*<span class=\"rarity-unique\">Malacus' Cloak</span> and <span class=\"rarity-unique\">Doran's Ring</span>. Eight blessed weapon enhancement stones. Ten blessed armor stones. Three deluxe magic stones worth 33,600 gold total.*\n\nHe did the math in his head. One hundred gold equaled 120,000 won. That meant 33,600 gold was worth... 40,320,000 won. Over forty million won in items, all thanks to the Tzedakah Guild. And in three days, he'd get half the value of the orb they'd recovered.\n\n*Why are they treating me so well?*\n\nGrid leaned back in his chair. He thought about Jishuka. The way she'd smiled at him. The way she'd offered to split the loot so generously.\n\n\"Is she interested in me?\" The words sounded stupid even as he said them. But his heart started beating faster. \"Does a woman like that actually want to meet me?\"\n\nJishuka was one of Satisfy's idols. Fan clubs on every continent. Thousands of players desperate for even a moment of her attention.\n\n*Men will be envious. They'll curse at me. They'll say I don't deserve her.*\n\nIt was like a dream. Grid's nostrils flared.\n\n*Her personality is wild, but she's a global beauty. And her body is fantastic. If she confessed to me...*\n\nHe logged out before the fantasy could go any further. His room was dark. He crawled into bed without washing and stared at the ceiling, grinning like an idiot.\n\nMeanwhile, breaking news spread across the world.\n\n> **[World Message: The Sixth Servant, Malacus, has been slain!]**\n>\n> **[The dark power of God Yatan and the attack power of all Yatan Church members has been reduced by 10%.]**\n>\n> **[Black Magician class change is unavailable until a new priest is appointed.]**\n\nThe Tzedakah Guild's name was everywhere. Top rankers scrambled to join. Recruitment applications flooded in. Jishuka held a press conference announcing guild expansion and mandatory entry tests.\n\nRegas gave an exclusive interview hinting that someone else had been the MVP of the raid.\n\nThe biggest beneficiary wasn't Yura. It was the guild itself.\n\n***\n\n\"These days, most breaking news is about Satisfy.\"\n\n\"Isn't Jishuka sexy? I like her way more than Yura. I'd die happy if I could sleep with a woman like that.\"\n\n\"Ridiculous.\" Another voice laughed. \"You wouldn't get a woman like that if you died and were reborn a hundred times. She's only with the world's richest and most handsome people. She's in a completely different world from us.\"\n\n\"What about Satisfy rankers? She might date one of them.\"\n\n\"Is it possible to be richer or more handsome than rankers?\"\n\n\"Good point.\"\n\nThe group of alumni sat in a cafe, cups of overpriced coffee growing cold in front of them. They'd met to plan the upcoming reunion. The conversation had inevitably drifted to Satisfy.\n\nOne of them, a man with thinning hair and a nervous laugh, leaned forward. \"Hey, didn't Youngwoo say he started Satisfy during the Open Beta? He's been playing for over a year. Maybe he's met someone like Jishuka or Yura by now.\"\n\nThe others burst out laughing.\n\n\"Stop talking nonsense.\" A woman with too much makeup shook her head. \"He's a loser even in the game. How can he be a ranker when he's falling deeper into debt instead of making money? He's probably still hitting slimes.\"\n\n\"Slimes!\" The thin-haired man slapped the table. \"Pfff! That's too much. He wouldn't be killing slimes after a whole year. He can at least catch wolves.\"\n\n\"You're both wrong.\" Another man grinned. \"Give Youngwoo some credit. He's probably caught a goblin by now.\"\n\n\"Kikikik!\"\n\nThe laughter was cruel. Comfortable. For people struggling to find decent jobs, people watching others succeed while they floundered, Shin Youngwoo was a balm. A reminder that someone had it worse.\n\n\"I want to see Youngwoo at the reunion.\"\n\n\"Me too. Hey, Ahyoung!\"\n\nKim Ahyoung looked up from her phone. She was beautiful in a conventional way. Perfectly styled hair. Designer clothes. Nothing compared to Yura or Jishuka, but she'd been told she was the prettiest girl in their high school. She'd been Shin Youngwoo's first love, back when he was too pathetic to even talk to her.\n\n\"Doesn't Youngwoo like you? Meet him and ask him to come. He'll definitely show up if you ask.\"\n\nAhyoung wrinkled her nose. \"He liked me in high school, sure. But now? We only see each other once a year at reunions.\"\n\n\"You've met so many men and you still don't understand them?\" The thin-haired man leaned closer, conspiratorial. \"People with no dating experience never forget their first loves. Youngwoo probably still thinks about you.\"\n\n\"He has no dating experience?\" Ahyoung's lips curved into a smile. \"Hehe.\"\n\nThe idea was amusing. Playing with someone barely scraping by. Watching him squirm. It would be fun.\n\n\"Give me Youngwoo's phone number.\"\n\n\"Okay.\"\n\nNone of them knew that Shin Youngwoo, the loser they mocked, had been reborn as something greater. And they couldn't imagine the type of woman who would stand beside him at that reunion."
}