{
  "id": 931,
  "title": "Chapter 931",
  "content": "The Sword Grave sprawled across an open plain—4,179 blades embedded in the earth, each one a piece of an impossibly complex puzzle. Of those swords, 3,580 served as mere anchors. The remaining 599 were the key. Each could be rotated left or right, and with every turn, the orientation and slope of the terrain shifted in response. The mechanism functioned like a lock with tens of thousands of possible combinations. As the correct sequence emerged, the flat plains gradually rose into a hill—the proper form for what could truly be called a \"grave.\"\n\n\"Dammit. The pattern reset.\"\n\nThey'd turned the 423rd sword to the left. Immediately, the positions of swords 1 through 422 reverted to their starting configuration. The hill that had finally begun to take shape collapsed back into flatland.\n\nSkunk clapped his hands together and forced an encouraging smile for his team. \"Alright, break time. We're almost through this—no need to stress now.\"\n\n\"Thank god. I'm logging out for lunch.\"\n\nThe Skunk Expedition Group had been investigating the Sword Grave for one year and four months—a full year just to *find* the damn place, then four months wrestling with its mechanisms. Despite thousands of attempts, countless mistakes, and failure after failure, their motivation hadn't wavered.\n\nThis was what they lived for. Unearthing hidden histories, unraveling ancient mysteries—*that* was the ultimate thrill. Concepts like level rankings and power scaling? Stories for other players.\n\n\"Don't you think this is strange?\" \n\nThe woman who spoke was Dog Woman, second-in-command of the expedition and the 9th ranked explorer in the world. She sat across from Skunk in the barracks, staring at the pattern charts scattered between them.\n\n\"This place is connected to Pagma. It's clearly meant for Pagma's Descendant to discover.\"\n\nEveryone in the world knew who held that title now. Grid, the Overgeared King himself.\n\nDog Woman leaned forward. \"Could Grid solve this alone? It's taken us—eighty experts—*months* to get this far. No matter how I look at it, the difficulty doesn't make sense. If this trial was designed for an individual, why is it practically impossible for one person to clear?\"\n\nShe had a point, and Skunk knew it. \"Grid's a king now. He could mobilize an army to help him.\"\n\n\"But what if Pagma's Descendant wasn't a king? What if it had been someone else—someone without those resources? Are you telling me Pagma expected his successor to crack this nightmare puzzle solo?\"\n\nSkunk turned his full attention to her. \"What are you suggesting?\"\n\nDog Woman's expression tightened with frustration. \"There must be an easier method—a shortcut we're missing. I think we've been doing this the hard way from the start.\"\n\n\"Hmm.\" It was a reasonable theory. Truth be told, Skunk had entertained similar thoughts. But the timing was all wrong. He shook his head. \"Even if you're right, it's too late. We've already mapped the pattern logic up to the 422nd sword. Starting over now would be a colossal waste of time and manpower.\"\n\nThey were *close*. Another two months, maybe less, and the grave would open. Abandoning their progress to chase a hypothetical shortcut would be catastrophically inefficient—not to mention devastating for team morale.\n\nDog Woman nodded reluctantly. \"I know. I'm not saying we should change course now. I'm just... for future expeditions, we should explore more diverse approaches from the beginning.\"\n\n\"Agreed. We'll treat this as a learning experience.\"\n\n\"Fair enough.\" Dog Woman's frustration gave way to anticipation, her eyes gleaming. \"I really can't wait to see what's hidden inside. If there are items or quests tied to Pagma's Descendant, we could sell them to Grid for a fortune...\"\n\n\"When we negotiate, we take our time.\" Skunk's grin turned predatory. \"After all, Grid will be the desperate one.\"\n\nIn a few months—maybe a year—Grid would inevitably find this place. And when he arrived to discover an *empty* tomb, his panic would be priceless. That moment of maximum desperation? That would be the perfect time to name their price.\n\nSkunk was already counting the treasures inside the Sword Grave as his own.\n\n***\n\nA white horse thundered through the labyrinth's narrow passages, its rider twisted in the saddle to look behind him.\n\nA zombie in rotted rags gave chase.\n\n\"Shit! Why the hell is this bastard all the way out here?\" Pon's voice cracked with panic.\n\nA War God Follower. One of the worst possible encounters for a party without proper tanks or mages. Pon had never fought one solo—he'd been careful to hunt far from the stairwells where the Followers typically patrolled. But their activity range had expanded, and now he was trapped like a rat in a maze.\n\n*That Regas bastard. Did he do something?*\n\nPon's thoughts flashed to his guildmates hunting deeper in Galgunos Temple. Knowing Regas and his reckless love of impossible fights, it was entirely possible the idiot had provoked the Followers somehow.\n\n*He's a dead man!*\n\nThe straight passage was ending. Pon realized with cold clarity that he couldn't outrun this thing much longer. The moment the horse turned at the corner, the Follower would close the distance.\n\n*Charge through with a gap-closer.*\n\nFighting a Follower head-on was suicide. These monsters had a passive that reflected 100% of received melee damage—trading blows was a guaranteed loss. Pon wasn't stupid enough to dig his own grave.\n\nAs the white horse reached the wall and banked hard left, the War God Follower seized the opening. It lunged, blade thrust forward.\n\nBut Pon had anticipated this exact moment. He twisted at the waist, the sword whistling past his ribs, and swung his spear in a wide arc. The strike connected with the Follower's chest, launching the undead monster backward through the air.\n\nHorse turning. Spear swinging. Follower flying.\n\nThree actions in perfect synchronization, so fluid they seemed to happen simultaneously—a frozen moment of pure execution.\n\nThe Follower hit the ground and tumbled. The white horse bolted into the left passage at full gallop.\n\n\"Phew.\" Pon exhaled shakily. He just needed to maintain distance now and—\n\n\"*Aaaaaaack!*\"\n\nA scream echoed from ahead, down the dark passage.\n\nA *second* War God Follower emerged from the shadows.\n\nPon's face twisted. \"Oh, you've got to be kidding me—\"\n\nThis new Follower was chasing Regas, who sprinted desperately toward Pon's position.\n\n\"Hey, hey! SHIT! Don't bring that thing over here!\" Pon unleashed a string of curses, but Regas didn't slow down. Stopping meant death.\n\n\"S-Save me...! Uwah!\" \n\nFor a brief, foolish moment, Regas had felt hope—maybe if he combined forces with Pon, they could take these Followers down together.\n\nThen he saw the *third* Follower behind Pon.\n\nRegas' vision swam. His eyes stung with tears.\n\n\"Aren't you going to pull yourself together?\" Pon's sharp voice cut through his panic. In the same motion, Pon's spear lanced forward, stabbing the face of the Follower chasing Regas.\n\n\"*Gah!*\" Pon coughed blood from the counterattack damage, but his strike had created an opening.\n\nRegas drove a kick into the chest of the Follower pursuing Pon. The monster flew backward—kicked enemies always got launched. But instead of pressing the advantage, Regas scrambled onto the back of Pon's horse.\n\n\"Pon, what the hell are you doing? You should've used a pushing skill like I did! Don't you know you'll take reflected damage?\"\n\n\"Shut up before I throw you off.\" Pon bit back the urge to explain that his pushing skill was on cooldown. He swallowed his irritation and focused on escape.\n\nThen—\n\n*Kuaaaaaaah—!*\n\n\"...!?\"\n\nA *fourth* War God Follower materialized directly ahead, blocking the passage.\n\nThe white horse skidded to a halt. Regas, unprepared, tumbled off.\n\n\"Ow...\"\n\n[**Your left arm has been fractured.**]\n\nIt was a serious break—twenty seconds minimum before it would heal. Regas clutched his arm and took stock of their situation.\n\nThree War God Followers. One narrow passage. No way out.\n\n\"What a surprise...\" Regas' voice was hollow.\n\nPon stared at him, equally shocked. \"This wasn't your doing? I thought you'd aggro'd them.\"\n\n\"That's impossible! I couldn't beat these things—I stayed away from the stairs on purpose...\"\n\n\"Then who the hell stirred them up? Was it Chris?\"\n\nWhat damn bastard had pissed off the War God Followers? Pon wanted to know. He wanted a name to curse as he died. At least then it wouldn't feel so unfair.\n\nThe Followers stopped running. No need to hurry—their prey was trapped in a dead-end passage. Now they could take their time.\n\n\"Battle gear... mountain... where...\"\n\n\"...Battle gear... mountain... where...\"\n\nThe Followers raised their blades.\n\nPon gestured wildly. \"No, no—if you have a question, you should wait for an answer before attacking!\"\n\n\"That's right! Followers of the War God, put down your weapons until we answer!\"\n\nThe Followers ignored them.\n\nTheir swords descended—\n\n\"**Way of the Tyrant.**\"\n\nThe entire labyrinth *shook*. A sound like stampeding buffalo roared through the stone corridors. Pon, Regas, and the Followers all turned toward the source.\n\nA figure emerged from the shadows, greatsword in hand.\n\nChris. The 1st ranked player.\n\n\"**1,000 Ton Sword!**\"\n\nPure, overwhelming force. The greatsword crashed down onto a Follower's skull, driving the monster into the ground with such weight that the stone floor *cracked*. The War God Follower—infamous for its counterattack passive—*screamed* without retaliating. Chris's tyrant buff negated the enemy's ability to strike back.\n\n\"Whoa...\"\n\n\"Chris is...\"\n\nPon and Regas watched in awe as the Follower lost half its health from a single blow. Few players in the world could survive Chris's monstrous strength.\n\nChris shouted at them. \"What are you standing around for? RUN!\"\n\n\"Run? We're not fighting?\"\n\n\"Fight? These things counterattack even my 10 Ton Sword! With my 100 Ton and 1,000 Ton on cooldown, we've got nothing!\"\n\nReinforcements had arrived, but the situation was still grim. Pon and Regas bolted through the gap Chris had created—\n\n\"Give me a map.\"\n\nA new voice rang out from behind them, colder than the raspy moans of the undead.\n\nDozens of white lights erupted in the passage. A devastating barrage of magic slammed into the War God Followers, and despite their notorious physical and magic resistance, the undead monsters *recoiled* in distress.\n\nHad an entire army of mages appeared?\n\nChris, Pon, and Regas spun around in shock.\n\nOnly one person stood there.\n\n\"Spit out the map.\"\n\nGrid, wreathed in flames, staff in hand instead of his sword.\n\n\"**Queen's Flames of Hell.**\"\n\nThe ultimate magic of Belial's Power activated. It consumed 90% of Grid's maximum mana and unleashed catastrophic damage—calculated based on both the caster's magic power and the target's maximum health.\n\nGrid crippled all three War God Followers with a single spell. One Follower collapsed, its legs and arms beginning to *melt* from the hellfire.\n\n\"...\"\n\nHad he gotten even *stronger*?\n\nChris and Pon stood frozen until Regas's voice snapped them back to reality. \"What are you doing? Let's help Grid!\"\n\n\"Eh? Uh... huh?\"\n\nHelp? Help *who?*\n\nChris, Pon, and Regas remained rooted in place as Noe, Randy, the Overgeared Skeletons, the light elemental, and summoned vampires swarmed the War God Followers. The undead couldn't break through the wall of summons—Grid's light sword constantly disrupted their movements while he bombarded them with spell after spell, leveraging every effect Belial's Staff provided.\n\n\"...That guy's a blacksmith, you know.\"\n\nGrid was dismantling War God Followers without even *touching* his sword. At this point, calling him a necromancer-mage hybrid would be more accurate.\n\nThe three of them wondered what the top-ranked necromancers—who bragged about being a \"one-man army\"—would say if they saw this.\n\nGrid's voice cracked across the passage. \"Hiik! Hey! What are you doing? Aren't you going to help me? *Uwaahh!*\"\n\nBelial's Power was a fraudulent skill, but it only lasted two minutes. The flames around Grid sputtered and died. His other swordsmanship skills were still on cooldown from fighting previous Followers.\n\nGrid turned and ran, Noe at his heels."
}