{
  "id": 932,
  "title": "Chapter 932",
  "content": "Chris whistled as the last war god follower collapsed, the sound halfway between appreciation and exhaustion. \"So Luck's class connects to the war god, huh?\"\n\nGrid knew the name. \"One of Ares' people?\"\n\n\"Part of his inner circle—the strongest three.\" Chris rolled his shoulders, working out the tension from the fight. \"Like these bastards, he's got that unconditional counterattack passive. Complete nightmare to deal with. I've lost count of how many times Giant Guild got our asses handed to us because of that skill.\"\n\n\"Luck's terrifying,\" Regas admitted. \"Back when I was starting out, we fought constantly. I lost every single time.\"\n\nPon's eyebrows shot up. \"You? Lost? Is the counterattack really that broken?\"\n\n\"Ha! No, he didn't even have the skill back then. Just a regular martial artist like me.\" Regas grinned ruefully. \"He beat me with pure talent. Though... my level was lower.\"\n\nGrid's eyes narrowed. Regas wasn't someone who lost just because of a level gap—the man was a prodigy. Which meant his opponent had been one too.\n\n*Shit.* The world suddenly felt larger, more crowded with threats. If the Ares Army showed up at this year's National Competition, his plans got a lot more complicated.\n\nAnd then there was Kraugel. The man had cleared the PvP finals as a freshly class-changed Sword Saint with a reset level. What the hell would he be capable of now, after months of recovery? Grid's lips curved despite himself—anticipation thrumming beneath his concern.\n\n\"Why are you smiling like that?\" Pon's voice broke through his thoughts. \"Finally get what you were looking for?\"\n\nGrid blinked. \"Smiling?\"\n\n\"You've been grinning like an idiot for the past minute.\"\n\n\"I have?\"\n\n\"Oh, I see how it is.\" Pon's grin turned sly. \"Thinking about your *lovers*? Which one—Yura? Jishuka? Both at the same time?\"\n\n\"What—No!\" Grid's face heated. He forcibly smoothed out his expression. \"And I didn't get what I needed. Still missing map pieces.\"\n\n\"Right, this map you keep mentioning.\" Chris's curiosity showed. \"What's so important about it?\"\n\n\"It leads to a place called the Sword Grave. Connected to both Pagma and Braham somehow.\" Grid kicked at a piece of rubble. \"The war god followers drop fragments of the map.\"\n\n\"What's the connection between dead cultists and legendary figures?\"\n\n\"No idea yet. I'll figure it out when I get there.\"\n\nThe weight of the revelation settled over the group. A location tied to *two* former legends? Whatever waited there had to be critical for Grid's development.\n\nPon cracked his knuckles. \"Then we'll farm these followers properly. Full party.\"\n\n\"Wait.\" Grid held up a hand. \"Don't you all have prep for the National Competition? Solo grinding is way more efficient for leveling than—\"\n\n\"Oh, shut up,\" Pon cut him off. \"You know what? I actually miss the old Grid sometimes. The selfish bastard who grabbed everything he could with both hands.\"\n\nChris nodded. \"You're being too considerate. It's... weird.\"\n\n\"And kind of worrying,\" Regas added. \"People change when they face death. You're starting to worry us, man.\"\n\nGrid's throat tightened. \"But the Competition—\"\n\n\"Is important, sure.\" Pon's expression softened. \"But you're more important. So form the damn party already.\"\n\n\"...You're all giving me goosebumps.\"\n\n\"Good! I learned that from you. Now stop arguing and send the invites.\"\n\n***\n\nGrid caved.\n\nAnd immediately understood why they'd insisted. Solo, he could delete individual followers with Linked Kill Wave Pinnacle or black flames—or just go nuclear with Blackening. But on cooldown? He'd be kiting and dodging for minutes.\n\nWith the party, there were no gaps. Chris's heavy blade stunned followers for a critical second. Regas targeted joints with surgical precision—the Dantalion's Knowledge Fragment Grid had given him highlighting every weak point. Pon's spear struck like a viper, devastating and fast.\n\n[A war god follower who has escaped from the grave has been destroyed.]\n\n[21,506,070 experience will be divided.]\n\n[Party leader Grid has acquired the Sword Grave's Map Fragment (2).]\n\n\"Not bad experience for party play,\" Pon observed.\n\n\"They're absolute units,\" Chris replied. \"Makes sense they're worth this much.\"\n\nA week dissolved into hunting and banter. Grid's map was half complete, and everyone's expressions had grown progressively lighter. They'd come to help Grid, but the incidental leveling wasn't something to scoff at. At this rate, everyone would hit their pre-Competition target of one level up.\n\nAnd Grid? Grid was a one-man wrecking crew. Each swing of the radiant Enlightenment Sword carved massive chunks from the followers' health pools. The party could focus entirely on support—controlling, positioning, preventing the deadly counterattacks from triggering.\n\n*BOOM!*\n\nAnother follower detonated, flames consuming its form before it crumbled to ash. Chris eyed the glowing blade with barely concealed envy. \"Grid... that sword. Please tell me that glow isn't just the cosmetic effect from Reidan's alchemy facility. That's actual enhancement, right?\"\n\n\"Yeah. Only +4, but it's myth-rated, so the visual changed.\"\n\n\"*Only* +4?\" Chris's voice cracked. \"Do you have any idea how absurd that is? Myth-rated items have enhancement rates that make legendary items look generous!\"\n\nGrid shrugged, fighting a smirk. \"Guess I'm just lucky.\"\n\nThe party stared. Then someone snorted. Then they were all laughing—because this was *Grid*, the man whose bad luck was practically legendary within the guild.\n\nExcept the Enlightenment Sword's glow wasn't a joke. The power increase was undeniable.\n\nPon sobered first. \"Real talk though—why aren't you competing this year? You'd sweep medals.\"\n\nThe question Grid had been dreading. Chris and Regas leaned in, equally curious.\n\nThe contract with the S.A. Group flashed through his mind. *No disclosure of Demon King Subjugation details.*\n\n\"Let's just say losing isn't in my nature right now.\" He kept his tone light but firm—conversation over.\n\nBefore anyone could press, the world *lurched*.\n\n\"What the—\"\n\nThe labyrinth groaned, stone grinding against stone. The floor buckled. Grid's party scrambled for balance, hands flying to weapons and potion pouches.\n\n[A change has been detected in the underground of the Galgunos Temple.]\n\n[After confirming that his army has been reduced, Galgunos warns the intruders upstairs.]\n\n> **\"If you don't want to die... Get out now...\"**\n\nThe voice bypassed Grid's ears entirely, resonating directly inside his skull. Pressure slammed into his mind like a sledgehammer.\n\n[A voice filled with strong magic power affects your heart and mind.]\n\n[The chaos, fear, and mental breakdown states have overcome you.]\n\n[The effect of the mental breakdown has quickly depleted your mana. 1,000 mana will be lost per second for one minute. Mana potions can't be taken for 10 minutes.]\n\n\"Guh—!\" Pon collapsed against the wall, face pale and slick with sweat. Chris and Regas weren't much better, their legs giving out.\n\nGrid alone remained standing, though his hands trembled slightly.\n\n*We didn't even reach the boss room, and he's already attacking?*\n\nCold understanding trickled down his spine. The war god followers—the ones they'd been farming as intermediate bosses—were actually just *elite monsters* in this place's hierarchy. The real boss was leagues beyond them. Possibly stronger than the noble-grade vampires the guild had faced before.\n\nHis pets confirmed it.\n\n\"This is... unpleasant...\" \n\n[Tiramet has returned to his coffin.]\n\n\"I'm scared...\"\n\n[Randy has run away.]\n\n\"Hanyaaang... sleepy, ong...\" \n\n[Noe feels sleepy. All of Noe's mana has been depleted.]\n\nOne *warning*. That's all it took to neutralize an elite party and banish all his summons. The party would recover in a minute or so, but his pets had a 24-hour cooldown. If more followers showed up before then...\n\n*We're in deep shit.*\n\nThen movement caught his eye. Two figures, standing perfectly upright.\n\n[Overgeared Skeleton One is dancing.]\n\n[Overgeared Skeleton Two is using 'Ridicule.']\n\nSkeleton One swayed, shoulders and collarbones bouncing to some unheard rhythm. Skeleton Two's jaw clacked in what could only be described as mocking laughter.\n\nNeither showed any sign of distress.\n\nGrid's mind raced. *Because they're skeletons? No brains to affect?*\n\nBut that didn't track. If anything, undead should be *more* vulnerable to a lich's mental influence—Noe had mentioned that liches exerted power over undead. The skeletons should've been overwhelmed instantly.\n\nUnless they weren't normal undead.\n\nAnd they *weren't*. These were Latina's creations, complex enough that even Braham couldn't fully analyze them. Skeletons with intelligence. Emotions. The ability to learn.\n\n[A change has been detected in the underground of the Galgunos Temple.]\n\n[After confirming that he was mocked, Galgunos warns the upstairs intruders.]\n\n> **\"Beriache's experiments dare...! I will kill you if you don't stop laughing right now!!\"**\n\n[A voice filled with strong magic power affects your heart and mind.]\n\n[The chaos, fear, and mental breakdown states have overcome you.]\n\n[Mental breakdown is stacked on, and the mana depletion speed has increased. The time required for recovery has doubled.]\n\n[You have resisted.]\n\n[Overgeared Skeleton Two is using 'Ridicule.']\n\n[Overgeared Skeleton One has learned 'Ridicule.']\n\n[Overgeared Skeleton One is using 'Ridicule.']\n\nBoth skeletons cackled now, jaws clacking in perfect disharmony.\n\n> **\"These guys!! I will turn you into powder!\"**\n\n[The angered Galgunos is calling for his experimental bodies.]\n\n[A war god follower, who learned two secret techniques, has discovered your position.]\n\nDistant explosions shook the corridor. Walls shattered as something *big* carved a direct path toward them.\n\n\"G-Guys?\" Grid crouched beside his paralyzed party members, lightly slapping their cheeks. \"Wake up. Come on!\"\n\nNothing. They'd need the full minute.\n\nWhich meant Grid was fighting alone.\n\n\"This really sucks.\"\n\n*Clack! Clack clack!*\n\nBehind him, his skeletons continued laughing like they'd just heard the funniest joke in the world."
}