{
  "id": 933,
  "title": "Chapter 933",
  "content": "\"We're expanding,\" Lauel began, his fingers steepled before him. \"The Overgeared Guild needs subordinate organizations—proper ones, each led by someone Grid trusts implicitly.\"\n\nHe'd been complaining about talent shortages for months, though Grid knew it was perspective bias. The Overgeared Guild was bursting at the seams. Two guilds at maximum capacity—they'd outgrown their structure. Time to operate like the major corporations did, with proper subsidiaries.\n\n\"It's a delicate process. We'll implement it gradually.\" Lauel's voice dropped. \"But the Shadows division can't wait. Today, preferably. You know better than anyone how critical that organization is, and recruitment is—\"\n\n\"You need me to handle it.\"\n\n\"Yes.\" The word came carefully. \"Can you?\"\n\nLauel's caution was warranted. Every member of Overgeared Guild One currently served as Piaro's knights, benefiting from substantial stat compensation. The moment Faker transferred out, those bonuses would vanish. Lauel was asking him to sacrifice everything he'd built since their days in the Tzedakah Guild. The weight of it pressed down on them both.\n\nFaker's expression remained placid. \"I understand.\"\n\nNo negotiation. No protest. Just acceptance. That was Faker—he'd walk through fire for Grid and the guild without a second thought. His calm acquiescence somehow made Lauel feel worse.\n\n\"I'd almost prefer you got angry.\"\n\nThe gap between the guilds was staggering. Overgeared Guild One had reached maximum level, offering knight buffs and countless quality-of-life improvements. The Overgeared Shadows Guild would start from scratch—level one, with none of those advantages. The stat loss was just the beginning of Faker's sacrifice.\n\nAnd yet... Lauel had expected this response, but experiencing it firsthand left him rubbing his temples in frustration.\n\nFaker's blank expression didn't waver. \"I've been preparing for this day. Besides...\"\n\nWas that a smile? Just the faintest curve at the corner of his mouth? Lauel blinked, uncertain if he'd imagined it.\n\n\"There's an old saying from my grandfather's homeland: 'A dog who attends Seodang for three years can recite the classics.' I've shadowed you for years, Lauel. I'm confident I can develop and manage a guild. Have faith.\"\n\nAs the Overgeared Guild's shadow, Faker had worked alongside Lauel through countless operations. He'd observed more closely than anyone, absorbing lessons most wouldn't even notice.\n\n\"Thank you.\"\n\nThat day, Faker departed Overgeared Guild One and founded the Overgered Shadows Guild. Every assassin transferred with him, joined by eager recruits from the waiting list.\n\nThe largest assassin guild in existence had been born—a blade forged exclusively for Grid and the Overgeared Kingdom.\n\n***\n\n\"Damn it, you two. Stop taunting him!\"\n\nGrid's plea fell on deaf ears. The Overgeared Skeletons continued their relentless mockery.\n\nHe felt like the villain in some morality tale.\n\n*If I actually think about it from Galgunos's perspective...*\n\nThe lich was simply defending his home from invaders. Meanwhile, the crazy robbers who'd broken in kept insulting him without the slightest gratitude for his restraint. This could fuel an entire ethics debate.\n\n\"...Well, humans are villains. No point worrying about a monster. Right. That's it.\" Grid gave up. \"Overgeared Skeletons, laugh all you want. Keep it up. His name's Galgunos? I'm calling him Galgu.\"\n\nThe sound of shattering walls grew closer. The war god follower who had learned two secret techniques was closing the distance. Unavoidable now.\n\nAn eerie thrill ran through Grid as he gripped the Enlightenment Sword, Blade Aiming at the Gods hovering at his side alongside his light elemental.\n\n*What level is an actual intermediate boss?*\n\nAccording to Lauel's report, the Overgeared members had mapped both the Temple of Shadows and Galgunos' Temple. The 'intermediate boss' on the first floor had been labeled 'war god follower who escaped from the grave.'\n\nDangerous didn't begin to cover it. Attack power and agility comparable to Grid's. Defense matching Vantner's. Health exceeding nine million. And that absurd unconditional counterattack skill—one ability that single-handedly made one-on-one combat inadvisable.\n\nThe Overgeared members had mistaken them for intermediate bosses because of their overwhelming strength. Even Grid found them threatening.\n\nBut here was the catch: those powerful monsters weren't intermediate bosses at all. Based on spawn numbers, they were elite mobs. Weaker than this approaching second-grade war god follower summoned by Galgunos.\n\nWhich meant the true intermediate boss was an unknown quantity entirely.\n\n*The name gives me a clue, at least.*\n\nGrid's thoughts accelerated.\n\n*Two skills. The grave escapees only had counterattack. This one has another trick up its sleeve.*\n\n*In standard dungeons, intermediate bosses run thirty to sixty levels above elite monsters. Stats scale with levels—the gap's going to be substantial.*\n\n*Health pool's the real concern. If it has double the HP and my Blackening-Blacksmith's Rage-Flash-Linked Kill Wave Pinnacle combo doesn't finish it... I need to be ready to die.*\n\nHis racing thoughts produced no answers. If thinking solved everything, the world wouldn't have wars or hunger.\n\n\"Screw it. I'll find out soon enough.\"\n\nGrid had zero information. He didn't know if this war god follower was undead like the grave escapees or something else entirely. The secret techniques were a mystery. Basically, he knew nothing, and overthinking was pointless.\n\nExperience had taught him that sometimes, the best strategy was clearing your head completely. Grid wasn't proud or arrogant—he was a veteran who'd been grinding since day one of Satisfy.\n\n\"Blackening. Quick Movements. Blacksmith's Rage.\"\n\nThe wall before him exploded. A zombie draped in a tattered cloak emerged from the rubble. The war god follower who had learned two secret techniques was indeed undead.\n\nGrid responded instantly, striking with a basic sword attack. No notification of durability loss. No health damage. No fracture warning. Good—the intermediate boss's attack power was equal to or lower than his own.\n\nSmall comfort.\n\nGrid launched a continuous assault on the war god follower.\n\n[You have suffered 7,930 damage.]\n\n[The target has received 9,950 damage.]\n\n[You have been counterattacked by a mysterious technique. You have suffered 9,950 damage.]\n\nTwo seconds. One attack dealt, one received. Grid gauged the war god follower's attack power and speed. The counterattack skill was the real problem—the moment the follower registered damage, it retaliated at transcendent speed, returning exactly what Grid had inflicted.\n\n*Same as the grave escapees so far.*\n\nThe health bar remained impossible to estimate. Ten thousand damage hadn't budged the gauge. Grid's mind worked furiously.\n\n*What's the second skill?*\n\nExtended combat favored the enemy. Same issue as fighting the grave escapees—these damned war god followers matched Grid's buffed stats. He needed to end this while his buffs held.\n\n*No, I have a bit more time.*\n\nGrid unleashed a fierce barrage while glancing at his stunned companions. They'd recover in forty-five seconds—solid insurance.\n\n*I'm not alone.*\n\nHis eyes sharpened with determination. Questions burned in his mind. The lich Galgunos served a great demon—which one? Where had he obtained war god follower corpses, and why use them as experimental subjects? Why were the followers searching for the Sword Grave, and what awaited there?\n\nVictory was the only path to answers.\n\n\"Ah.\" The realization hit him—time for a new challenge. The 'illusion' ability from Belial's Power, which he'd been avoiding. He'd thought it beyond his capabilities.\n\nNow seemed like the perfect moment.\n\nReaching higher required new resolve and a willingness to challenge himself. Grid refused to stagnate. Especially with the demon king subjugation looming. Each counterattack dropped his health while the war god follower's gauge stayed full. Grid had already burned through half his HP. He was even grateful for the **+8 defense** from his underwear. That's how desperate things had become.\n\n\"Belial's Power.\"\n\nHe used—no, *challenged*—the power he'd been ignoring.\n\n>[The power of the great demon Belial summoned in the Rune of Darkness has been opened!]\n\n>[It is impossible for a human to digest all three of Belial's powers.]\n\n>[You are in a half-demon state. Your body has endured the pressure of immense power. However, it is still impossible for a human to digest all three of Belial's powers at the same time.]\n\n>[You can use one of Belial's three powers of: Darkness, fire, or illusion.]\n\n>[You have chosen the power of illusion!]\n\n>[The passive skill 'Queen of Mocking and Violation' will be maintained for 2 minutes, and Queen's Distortion is now activated. Another magic will be activated if your **Intelligence** exceeds **4,000**.]\n\n>[Your **Intelligence** is low. It is difficult to control Queen's Distortion.]\n\n\"Grid...?\"\n\nOne minute of Grid enduring the war god follower who had learned two secret techniques alone. Chris, Pon, and Regas were shaking off the negative status effects, consciousness returning.\n\nBut full awareness eluded them.\n\nInstead of one Grid, they saw five. Confusion washed over them like a narcotic haze."
}