{
  "id": 934,
  "title": "Chapter 934",
  "content": "**[Queen of Mocking and Violation]**\n\n**[Once health falls below 50%, an illusion will be summoned with every further 10% decrease in health.**\n\n**The health, defense, and agility of the clone are affected by your body's current health, defense, and agility. However, its attack power is fixed at 10% of the body. Additionally, the skills of the clone are limited to basic skills.**\n\n**Every time you summon an illusion, it will show hallucinations to all the surrounding people. They won't be able to distinguish between your body and the illusion.**\n\n**A target who attacks the clone will have 30% of the damage the target dealt reflected. However, it won't lead to death.]**\n\nBelial's third power was near-perfect illusion magic. Each time the caster's health dropped, a clone manifested. Every target in the area would be unable to distinguish the real body from the phantoms. Those who struck an illusion would suffer reflected damage. The clones even copied most of the main body's stats.\n\nOn paper, the skill was devastating. Anyone using such an ability should dominate the battlefield.\n\nYet Grid had never once used it in actual combat.\n\nThe reason was simple: the skill was a nightmare to control.\n\nDespite its versatility, Queen of Mocking and Violation had one critical flaw—it required inhuman coordination.\n\n> [You have suffered 8,190 damage.]\n\n> [The target has received 12,200 damage.]\n\n> [You have been counterattacked by a mysterious technique.]\n\n> [You have suffered 12,200 damage.]\n\n> [An illusion has been summoned with the effect of Queen of Mocking and Violation.]\n\nGrid's battered form split in two, one body becoming two.\n\n\"...?\" The War God Follower froze mid-strike. Its aggro fractured as it lost track of which Grid was real. \n\n*This should work,* Grid thought. *Like a scene from an action movie—two of me overwhelming this thing.*\n\nBut Grid stood frozen. He couldn't move.\n\nHis vision had split in half.\n\n'...Shit.'\n\nThis was exactly why he avoided this power. Every summoned illusion didn't just act independently—Grid saw through its eyes in real time. The one mercy was that he didn't have to manually control the clone's every movement.\n\nBut that was small comfort. Grid had to process both perspectives simultaneously, watching what the illusion did through its eyes while coordinating strategy with his real body. The mental strain was crushing.\n\n\"Urgh...!\" \n\nThe illusion took a hit. One of Grid's dual perspectives whipped through the air as the clone was sent flying. One field of vision showed the War God Follower straight ahead. The other showed the top of its head from below. \n\nNausea rolled through him.\n\nClosing one eye didn't help. The split-screen view persisted, just smaller. His brain couldn't reconcile the conflicting visual information.\n\nThe War God Follower blocked the illusion's strikes. The phantom had drawn its attention—natural, since Grid's real body stood paralyzed while the clone moved with fluid precision. The undead creature had already dismissed the motionless Grid as fake.\n\nWith each exchanged blow, Grid's disorientation worsened. The shared vision lurched and spun, making it nearly impossible to adapt.\n\nStill, he had to focus. He watched through the illusion's eyes, waiting for the War God Follower to expose an opening. Then he'd strike.\n\n'Get it together. Focus, damn it! I have to land as many hits as possible before the buff expires!'\n\nGrid forced his concentration to sharpen. The clone executed Link, striking the War God Follower repeatedly. Seven consecutive hits connected, each one battering through its guard.\n\nFrom Grid's perspective, it wasn't good news. If a clone with only 10% of his attack power could kill this thing, he wouldn't have taken such brutal damage fighting it in the first place.\n\nThe War God Follower retaliated with devastating speed. The clone, unable to defend, was torn apart in seconds. As it disintegrated, the undead suffered tens of thousands of reflected damage in return.\n\nThat was the moment Grid moved.\n\n\"Flash!\" \n\nHe surged past the War God Follower, activating the light elemental as he closed in. The elemental streaked forward and erupted into blinding radiance.\n\n\"Linked Kill Wave Pinnacle!\"\n\nGrid unleashed his ultimate combination. His blade became a storm of steel, each strike carving through the follower's defenses.\n\n> [The target has received 490,580 damage.]\n\n> [The target has received 511,900 damage...]\n\n\"**Kiyaaaaaah!**\" \n\nBlinded and ravaged by damage, the War God Follower failed to counterattack. It thrashed in agony as Grid transitioned seamlessly into Wave. Dozens of energy blades shredded its form before converging overhead.\n\n\"...Battle gear mountain...!\"\n\nThe follower didn't notice the lethal aura gathering above. Its vision cleared. It roared, \"Where?!\"\n\nPinnacle fell like divine judgment.\n\n> [The target has received 3,040,580 damage.]\n\nThe impact sent the War God Follower staggering. Its posture collapsed so completely it should have dropped its weapon. Defying physics itself, the creature triggered its counterattack skill despite the awkward angle—reflecting the full damage of Linked Kill Wave Pinnacle back at Grid.\n\nGrid had already anticipated this.\n\n\"Revolve.\"\n\nHe stood too close for the counterattack to miss him. But Grid had fought enough War God Followers to know the exact timing. He'd mastered this exchange.\n\n> [The target has received 3,040,580 damage.]\n\nThe follower's own reflected damage struck it again. Staggered by injuries it should never have sustained, the creature nearly collapsed. If this had been one of the followers from the graves, it would already be dead.\n\n'Damn. Just as I thought.'\n\nThis was the War God Follower who had learned two secret techniques—the intermediate boss. It likely possessed twice the health of the grave variants. Despite taking the ultimate skill combo and the reflected counterattack damage, the follower still had roughly half its health remaining.\n\n\"I... Battle gear mountain...! Guide me!!\"\n\nEnraged and threatened by Grid's unconventional tactics, the War God Follower revealed its second secret technique.\n\n\"?!\"\n\nGrid had retreated to a safe distance after the Linked Kill Wave Pinnacle combo, catching his breath. His eyes widened in shock.\n\nThe sword was growing.\n\nThe War God Follower took a single step. The rusty blade extended across the three-meter gap.\n\n*What the hell—*\n\nA chill shot through Grid, but he'd already committed to the distance. The very space he'd secured to stay safe now trapped him. His guard had dropped, making his reaction a split-second too slow.\n\n> [You have suffered 19,250 damage.]\n\n\"Ugh!\" Grid's chest split open as the sword caught him. The War God Follower's attack power had tripled. It advanced another step. The blade lengthened again.\n\n> [An illusion has been summoned with the effect of Queen of Mocking and Violation.]\n\nGrid's body shuddered and divided. The War God Follower lost focus as its target doubled. The second secret technique struck the ground between Grid and his new illusion, missing both.\n\nGrid studied the embedded sword and understood.\n\n*Aura.*\n\nThe blade wasn't growing—an aura projection extended from the tip, lengthening the weapon in real time. A technique that could alter its reach at will. Dangerous. With triple attack power, a few more hits would kill him. Most players wouldn't survive a War God Follower with two secret techniques.\n\nBut Grid understood aura. Piaro had taught him everything—why he'd kept Hurent close, the extent of Hurent's abilities, the fundamental characteristics of aura itself.\n\nSo when the embedded sword suddenly transformed into a mace with protruding thorns, Grid wasn't caught off guard. He avoided the spikes as if he'd predicted them, even pulling his illusion clear.\n\nIf the War God Follower had been alive, it might have panicked at having its secret technique so easily countered.\n\nBut this was an undead. It felt no surprise, no frustration. It simply continued attacking. The aura shifted form with each swing—now a mace, now a spear, now a whip. Grid's body accumulated wounds as he moved relentlessly.\n\n> [An illusion has been summoned with the effect of Queen of Mocking and Violation.]\n\n> [An illusion has been summoned with the effect of Queen of Mocking and Violation.]\n\n> [An illusion has been summoned with the effect of Queen of Mocking....]\n\nGrid's vision split into five perspectives. Four illusions now fought alongside him. The War God Follower's strikes missed repeatedly, hitting phantoms and suffering reflection damage each time.\n\n\"Hah... hah...\" \n\nGrid's head throbbed. Managing five simultaneous viewpoints was draining his mental power at an alarming rate.\n\n*Even Kraugel's grandfather couldn't adapt to this,* Grid thought with grim sincerity.\n\n\"Link.\"\n\n\"Kill.\"\n\n\"Wave.\"\n\n\"Pinnacle.\"\n\nHis illusions surrounded the War God Follower and began their sword dance. Grid watched through their shared vision, throat tight. One clone used Link. Another executed Kill. A third performed Wave. The last struck with Pinnacle.\n\nTheir fates were sealed—with only one-tenth of Grid's attack power, they would deal minor damage before being destroyed by counterattacks. From the War God Follower's perspective, they were merely annoying flies.\n\nBut what if those flies had venom? The illusions would die to counterattacks, yes—but what if their damage exceeded expectations? Then their deaths wouldn't be meaningless.\n\n*Steady... steady... I can do this.*\n\nOf the five perspectives Grid currently processed, his real body remained at the center. He watched his illusions assault the War God Follower.\n\nThen Grid cast his spell: \"Distortion.\"\n\nHis focus shifted to a different perspective—the one using Link on the War God Follower.\n\n**[Queen's Distortion]**\n\n**[Replace the body of the virtual image. The target can only be replaced once.**\n\n**Cooldown Time: None.**\n\n**Mana consumption: 2,300]**\n\n\"Ohhhhh!\" \n\nGrid became the illusion executing Link. He focused solely on the central vision, driving energy blades into the War God Follower.\n\n> [The target has received 23,500 damage.]\n\n> [The target has received 21,430 damage.]\n\n> [The target has received 22,990 damage...]\n\n> [The target has received 22,800 damage...]\n\nGrid's full attack power applied. The War God Follower reeled from damage it couldn't ignore, then counterattacked.\n\nSimultaneously, Grid swallowed his nausea and cast again: \"Distortion...!\"\n\nThe scene shifted. Now he occupied the illusion driving Kill into the War God Follower's body.\n\n> [Critical!]\n\n> [The target has received 1,010,590 damage.]\n\nThe body Grid had just vacated was blown away. His perspectives reduced from five to four. He cast Queen's Distortion again—barely in time. The illusion who'd used Kill turned to ash. The clones performing Pinnacle and Wave disintegrated simultaneously.\n\nOnly one perspective remained. His original body.\n\nGrid stared at the War God Follower across the battlefield. Five Grids had fought moments ago. Now only one stood.\n\n\"**Kieeek! KIeeeek...!**\" \n\nThe War God Follower creaked like a breaking toy. The damage Grid had dealt by jumping between illusions was substantial. Combined with the reflection damage from each destroyed clone, the toll was severe.\n\n\"Hah... hah... hah...\" \n\nGrid couldn't move. Sharing five perspectives and using three consecutive distortions had drained his mental power completely. His brain felt like it was on fire.\n\n*If my reflexes were just a bit faster, I could've connected my real body's attacks with the illusions' strikes.*\n\nHis legs trembled beneath him, barely supporting his weight.\n\n\"Leave it to us.\" \n\nChris, White Knight Pon, and Asura Regas stepped forward in formation. The 1,000 Ton Sword and 100 Ton Sword hammered the War God Follower to the ground. Mach Spear pierced through its heart. Lightning-fast kicks pummeled its head.\n\nThe struggle ended.\n\n> [The war god follower who learned two secret techniques has been destroyed.]\n\n> [129,990,250 experience will be divided.]\n\n> [Overgeared Skeleton One's level has risen.]\n\n> [Overgeared Skeleton Two's level has risen.]\n\n> [Party leader Grid has acquired 'Burnt and Unreadable Secret Technique of the War God Follower.']\n\n> [Party leader Grid has acquired the Sword Grave's Map Fragment (7).]\n\n> [Party leader Grid has acquired the Sword Grave's Map Fragment (3).]\n\n> [Party leader Grid has acquired the Sword Grave's Map (1).]\n\n> [You have completed the map of the Sword Grave!]\n\nGrid had conquered the challenge."
}