{
  "id": 935,
  "title": "Chapter 935",
  "content": "[You have completed the map of the Sword Grave!]\n\n\"Yes!\" Grid pumped his fist.\n\nHe'd expected this to take at least two weeks, but the unexpected appearance of that war god follower—the one who'd mastered two secret techniques—had actually accelerated their progress. What could have been a disaster turned into fortune.\n\n\"Must be my good luck stat finally paying off.\" Grid grinned, thinking about how those elixirs had sent his fortune through the roof. \"Maybe I should rebrand myself as the King of Luck.\"\n\nThe Overgeared Skeletons standing nearby made forlorn rattling sounds. He ignored them.\n\n'Even stumbling into Garam's trap worked out in the end. At this rate, I'll reach the Sword Grave and finish the hidden quest before the National Competition even starts.'\n\nIn his excitement, Grid forgot one critical detail.\n\nThey were still in the Galgunos Temple. This was *not* a safe zone.\n\n\"YOU DESTROYED MY CREATED SOLDIERS!\"\n\nThe roar erupted from deep underground, rattling the temple's foundations. Grid's party snapped to attention, every muscle tensing. They'd burned through all their resources fighting that war god follower. If another one showed up now—\n\n\"Potions, now!\" Chris barked, already checking his equipment durability.\n\nEveryone scrambled, gulping down recovery items while frantically scanning their skill cooldowns. They were preparing to run.\n\nBut none of it mattered.\n\n[Your relationship with Lich Galgunos, subordinate of a great demon, has become hostile.]\n\n['Galgunos Imprint' is engraved on your heart.]\n\n[The first imprint effect has occurred. The imprint is filled with the essence of magic power. You have failed to resist the imprint effect.]\n\n[The first imprint effect has caused death. The imprint has disappeared.]\n\n[Resistance to the first imprint effect has increased.]\n\n[36.7% experience has been lost.]\n\n[The +8 Ideal Dagger has been lost.]\n\nNo soldiers. No warning. Just instant death.\n\nGrid's vision went black.\n\n***\n\n\"You okay?\"\n\nGrid's eyes snapped open in the garden of Reinhardt Castle, and his first thought was for his teammates. Death stung—especially with that experience loss—but it wasn't the end of the world. He hunted faster than anyone else in the game. He'd recover. And the Ideal Dagger? The one he'd crafted when he first met Euphemina? Sure, it had been with him for ten years of Satisfy time, but +8 wasn't irreplaceable. He still had a pile of enhancement scrolls from his East Continent rewards.\n\nChris, Pon, and Regas were a different story. The three of them materialized at the resurrection point looking shell-shocked. For them, this kind of loss meant weeks of grinding.\n\n\"We're fine,\" Chris said.\n\n\"Why the long face? Not worth worrying about.\" Pon's voice was too casual.\n\n\"Dying's just part of hunting,\" Regas added with a shrug.\n\nTheir words said one thing. Their thoughts said another.\n\n'There goes my plan to gain a level before the Competition.'\n\n'Dammit, I dropped Lensia. Now I need a whole new secondary weapon.'\n\n'My pride... obliterated.'\n\nBut they kept their faces neutral. No point in making Grid feel worse.\n\nPon clapped Grid on the shoulder. \"Look at the bright side—you finished mapping the dungeon, and we learned how the boss mechanics work. We didn't die for nothing. So stop beating yourself up.\"\n\nChris nodded. \"I should brief Lauel. He needs to know that raiding the Galgunos Temple comes with guaranteed casualties.\"\n\nAnyone who killed that intermediate boss would get branded with the imprint. And that first imprint effect? Instant death, no saves. Grid's group had developed resistance now, but everyone else would need to accept dying at least once.\n\n\"Lauel's going to love that,\" Pon muttered. \"No way he'll approve a raid.\"\n\n\"Agreed. Tell the guild members—farm the mobs on the first floor, but leave the intermediate boss alone.\"\n\nIt made sense. Dungeons were for leveling and profit. You could get both by farming respawning trash mobs. Boss raids gave better rewards, sure, but not if the difficulty was suicide. Why chase uncertain gains when the cost was guaranteed loss?\n\nThe three of them had made up their minds: the Galgunos Temple wasn't worth raiding.\n\n\"We'll take it after the National Competition.\"\n\nThey turned to stare at Grid.\n\n\"At minimum, we won't die to the imprint anymore,\" he continued, grinning at their bewildered expressions.\n\n\"That's... true,\" Chris said slowly. \"But the imprint's just the beginning. The temple itself is brutal. The four of us can't clear it alone.\"\n\n\"So win two or three gold medals at the Competition. The rewards will make you stronger. Problem solved.\"\n\n\"Ah. Right. Of course. The *simple* solution.\"\n\nOnly Grid would talk about gold medals like they were participation trophies. The others could only laugh.\n\n***\n\nThe video opened above the clouds—heights no human could reach. For two seconds, the camera hung suspended in that impossible sky. Then it plummeted.\n\nDown through the clouds, accelerating toward the ground. Impact. The screen shook violently, then went still. A few seconds of silence.\n\nThen trembling. A broken sword appeared in frame.\n\n*-That's Kraugel.*\n\n*-Obviously. They're showing the fallen Sky above the Sky.*\n\n*-Brutal opening lol. S.A Group really hitting us with former #1's defeat from the start?;;;*\n\n*-Feel bad for Kraugel oppa. Don't want his pretty face getting stress wrinkles. ㅠㅠㅠ*\n\nThe pre-opening video for the 4th National Competition was three minutes of pure impact. It chronicled Kraugel's fall from grace—the man who'd held his throne until last year, now crashed to earth. Some viewers cheered. Others lamented. Many felt sympathy. But everyone shared one emotion: *regret*.\n\nThe camera shifted to Kraugel's perspective. His hand closed around the broken sword. He pulled himself up, reaching for the throne. But the throne sat empty, abandoned, rusted.\n\nSymbolizing Grid's absence.\n\n*-Confirmed: Grid's not competing this year.*\n\n*-So empty. What's even the point of watching?*\n\n*-Honestly, this whole Competition is meaningless. Just foxes fighting in a forest with no tiger.*\n\n*-\"Tiger\"? Seriously? Grid's a coward who ran away. He didn't enter because he knew Kraugel would beat him. That's not a tiger, that's a rabbit.*\n\n*-You must be American.*\n\n*-Am I wrong? What other reason would Grid have for skipping the gold medal rewards? He's afraid of losing his title.*\n\n*-Definitely American.*\n\n*-Without Grid, South Korea's going to crash in the rankings this year. ㅎㅎ*\n\n*-Japanese detected.*\n\n*-Chinese?*\n\n*-Taiwan number one!*\n\n*-Foreign trolls are out in force. Someone summon Peak Sword.*\n\nCommunities worldwide buzzed with National Competition speculation. Korean forums in particular were under siege—foreign commenters flooding in daily to mock South Korea's prospects without Grid. Apparently, plenty of people resented how Koreans had coasted on Grid's dominance.\n\nStill, even without Grid, interest in the Competition burned white-hot. It only happened once a year, after all.\n\nThen the full opening video dropped a few days later, and the entire world lost its mind.\n\nThe camera focused on Kraugel, staring at the empty throne. Players from the US team gathered around him. One approached the throne. Sat down. Threw back his head and laughed.\n\n*-It's the punching bag!*\n\n*-No way ㅋㅋ Zibal's making his comeback NOW?*\n\nBefore vanishing from the rankings, Zibal had held second place overall—Kraugel's only real rival. Now, after two years of silence, he was back.\n\nAmericans went feral.\n\nAnd Zibal wasn't alone.\n\n*-Is that Haster standing next to Lauel?*\n\n*-The FPS Emperor? No. Why would he be in Satisfy?*\n\n*-That's definitely Haster.*\n\n*-This is insane. Haster's playing Satisfy?*\n\n*-He's going to dominate again.*\n\n*-A legend returns... This Competition's going to be stacked with legends...*\n\n*-Kraugel, Zibal, Haster, Lauel, Skull, Zephyr... USA's got this in the bag.*\n\nOne hundred twenty-five countries were competing in the 4th National Competition. The five-minute opening video couldn't showcase them all. It focused on the thirteen superpowers that dominated Satisfy—the nations with the deepest rosters. High rankers from smaller countries got brief cameos. Jishuka appeared for maybe three seconds.\n\nThe spectacle had everyone hyped.\n\nBut one scene generated more discussion than all the others combined.\n\nDarkness. A castle silhouetted against the night sky. A single hand entering frame—beckoning. \n\n*Come.*\n\n*Come and face me.*\n\n*-Who the hell is that? Why no face reveal?*\n\n*-First-time competitor?*\n\n*-Arrogant bastard. Which top ranker hasn't competed yet?*\n\n*-Russia's Knight? North Korea's Jang Mihwan? Israel's Jacob?*\n\n*-Don't know about Knight, but Jang Mihwan and Jacob aren't confirmed players.*\n\n*-Has to be Jacob. The arrogance fits his whole persona ㅋㅋ*\n\n*-Don't think so... Body language feels European. Maybe GZ?*\n\n*-Not GZ. I'm thinking Faker.*\n\n*-Faker...? FAKER! Yes! That's it!*\n\n*-The dramatic flair checks out.*\n\n*-It's definitely Faker.*\n\n*-Makes sense. Nobody has a higher mystique than Faker. Of course he'd close out the video.*\n\nThe consensus crystallized: the mysterious figure was Faker, the Death God. One of the most accomplished high rankers who'd never entered the public eye. One of the strongest in the world. Member of the strongest guild.\n\nThe man Grid supposedly trusted above all others.\n\n***\n\n\"Ooh, came out pretty nice. Guess hiding your face helped?\"\n\nShin Youngwoo and Shin Sehee sat side by side on the living room couch, watching the opening video at midnight. Their reactions couldn't have been more different. Sehee practically vibrated with excitement over her brother's cameo. Youngwoo looked like someone had stolen his lunch.\n\n'They cut my line.'\n\n*There's no time, so bring it on—all of you at once.*\n\nThat was what he'd said to the camera during filming. Epic, intimidating, perfectly badass. And the editors had completely removed it. His heart ached.\n\n'They seriously cut it?'\n\nWas the line too childish? Too cringe? He sighed, then glanced at Sehee. Another sigh escaped when he noticed her outfit.\n\n\"First the high school uniform, now the gym clothes? You graduated already. Why are you still dressing like you're in high school?\"\n\n\"I told you—I study better in clothes from my high school days. Better focus.\"\n\n\"You're a college student. At S University. Why are you studying at home? Shouldn't you be studying on campus?\"\n\n\"I need to study to graduate.\"\n\n\"You're a *freshman*. Take it easy. Join some clubs like Yerim did. Get a boyfriend. Though you'd definitely have a curfew.\"\n\n\"Too busy studying and gaming.\"\n\nSehee had received so much from her brother. Enjoyed so much because of him. Now she wanted to succeed on her own terms—at minimum, become financially independent. Stop being a burden. Maybe even help support *him* for a change. That's why she threw herself into the game with everything she had. She understood the potential of the Saintess class.\n\nYoungwoo had no idea what was going through her head. He stood up, stretching.\n\n\"I'm going to bed.\"\n\n'Need a full night's sleep. Fresh start tomorrow. What's waiting for me at the Sword Grave?'\n\nThe place where Pagma had created his final works. Where Braham's body lay buried. For multiple reasons, Youngwoo couldn't wait."
}