{
  "id": 936,
  "title": "Chapter 936",
  "content": "High rankers rarely considered themselves inferior to anyone. Confidence ran in their blood—they attributed any gap in the rankings to variables, circumstances, and luck rather than skill. The difference between rankers, they insisted, was paper-thin. This belief wasn't arrogance. It was faith.\n\nThen came last year.\n\nThree National Competitions shattered that faith. The rumored Sky Above the Sky—Kraugel—had displayed mastery that transcended mere talent. Grid, once dismissed as lucky, had proven year after year that his growth was no accident. The high rankers could no longer deny it: a clear hierarchy existed, and they weren't at the top.\n\n\"That's why I'm avoiding PvP this year.\"\n\nThese words came from Bubat, the man whose name promised victory. He'd faced Grid multiple times and been the first to recognize the truth. Now, representing Turkey once again, he'd set his sights on the PvP event.\n\n\"Grid isn't participating this year? Then I have no reason to give up. The gold medal is mine.\"\n\nHis Yak Guild members exchanged doubtful glances.\n\n\"Why obsess over PvP?\"\n\n\"You'll just wash out in the round of sixteen again.\"\n\n\"Round of sixteen? If Kraugel enters the qualifiers, you won't even make it that far. Kilkil.\"\n\nWithout Grid, would Bubat claim first place? Even his own guild couldn't guarantee it. PvP attracted the best: Kraugel, Seuron, Regas, and dozens of other powerhouses staking their pride on the outcome. The Yak Guild found Bubat's optimism frustrating.\n\n\"Last year you lost to Zhang Zheng... PvP isn't a team event where we can cover your weaknesses. It's a solo show. Captain, this is too disadvantageous for you.\"\n\nBubat's Crusher class boasted exceptional defense and crowd control. The two skills he'd learned at level 360 could ignore status resistance entirely, guaranteeing their effects. But crowd control meant nothing without killing power.\n\nThe PvP format should have spelled doom for Bubat. Yet he radiated confidence, all thanks to a gift from an enthusiastic Turkish fan.\n\n[Artina's Natural Disposition Gloves]\nRating: Legendary\n\nA magnificent item that converted defense into attack power. The fan who'd presented them to Bubat had been adamant: raise Turkey's status this year.\n\n\"Huhu. Just wait. This year will be different.\"\n\nKraugel was no longer untouchable—Grid had proven that. Bubat had studied strategies against him. The odds might be slim, but Kraugel could be defeated. Grid wasn't the only one capable of it.\n\nBubat wasn't alone in this thinking. Rankers who'd sworn off PvP after witnessing Grid's meteoric rise now felt renewed hope. Once Grid announced his absence, participants flooded in.\n\nThe media response was predictable. Provocative articles proliferated worldwide. Rankers from every nation declared their intent to compete, shouting that Kraugel didn't frighten them. Naturally, all eyes turned to the man himself.\n\n\"Kraugel, many rankers have expressed confidence in defeating you. Your thoughts?\"\n\n\"They can be confident if they're on Grid's level.\"\n\nCamera shutters erupted. The reporters' faces lit up—they'd gotten their headline.\n\n*Don't challenge me unless you're Grid's equal. I won't lose to anyone but him.*\n\nThe implication was unmistakable. Confidence and provocation in equal measure.\n\nAnother journalist seized the moment. \"There's public consensus that Grid is running from the National Competition. What's your take on his absence?\"\n\n*Grid fled because he feared losing his title.* One of many theories circulating. What would Kraugel say?\n\nHe regarded the crowd with detached calm. \"It's mercy, not cowardice.\"\n\n\"Mercy?\"\n\nConfusion rippled through the press corps. Several reporters cocked their heads. The sharper ones, however, were already typing furiously. While the room buzzed with activity, a thought crossed Kraugel's mind.\n\n*Grid...*\n\nHe knew Grid needed ether diamonds. The National Competition remained the only reliable source. Which meant Grid's supposed absence was false.\n\n*Are you playing the demon king?*\n\n***\n\n*This is harder than I expected.*\n\nThe National Competition had introduced seven new events, including the demon king subjugation. After reviewing the rules thoroughly, Grid felt his stomach tighten.\n\nThe castle had four gates—north, south, east, and west. Each gate would be defended by one of the Four Heavenly Kings. Players would form groups of 120 and attempt to breach them. Meanwhile, the demon king would wait inside the castle, gaining 200,000 bonus health every ten minutes until all four gates fell.\n\nThat health bonus troubled Grid most. He'd receive 200,000 health every ten minutes while the Four Heavenly Kings fought?\n\n*Isn't this excessive?*\n\nGrid's defense and magic resistance already transcended player standards. Unless an enemy used percentage-based skills, damage barely scratched him. But adding 200,000 health every ten minutes...?\n\n*The Four Heavenly Kings won't fall easily.*\n\nGrid's health might actually exceed one million during the subjugation. Yet something made him uneasy—the S.A. Group had designed this system knowing his specifications.\n\n*The participants must be stronger than I thought...*\n\nHe'd prepared for a difficult fight. This might prove even harder. At least his sister Sehee wouldn't be participating. Grid shook his head at the frightening alternative.\n\nThere was something he didn't know, however.\n\nOriginally, the S.A. Group had set the demon king's health increase at 500,000 per ten minutes. Grid's overwhelming power had forced them to reduce it to 200,000. Their reasoning remained known only to them.\n\n\"Wait, is this the right road?\"\n\nGrid stopped and consulted his map—a chart of the Sword Grave.\n\n\"Should be...\"\n\nGrid might be dense about many things, but not directions. He'd found the North End Cave containing Pagma's Rare Book without issue. His ability to read maps was solid. Currently, he was following the route exactly.\n\nYet something felt wrong. The path was correct, but it simply... ended.\n\n\"What the hell?\"\n\nA sheer cliff face blocked his way—not marked on the map, which showed only a gentle mountain trail.\n\n*Is the map fake?*\n\nHad all his effort been wasted? As dread crept down his spine, the cliff before him began to split. The crack widened until two separate cliff faces stood apart, as if they'd always been separate.\n\nGrid glimpsed the path between them and moved without hesitation. Beyond the split cliffs, the terrain matched the map perfectly.\n\n***\n\n\"Ah...!\"\n\n\"Shit!\"\n\nGroans and curses echoed across the site. Skunk had rotated the 594th sword three times left, four times right. The hill collapsed, reverting to plains.\n\nThe 594th sword was the problem. Twenty-seven possible rotations in either direction—determining the correct sequence and direction was proving maddening.\n\n\"That's the twenty-eighth failure. Starting from scratch will take hours.\"\n\n\"Everyone's exhausted. We should stop for today.\" A subordinate spoke carefully to the frowning Skunk.\n\nHis response was sharp. \"We only have five swords left. The Sword Grave is almost open.\"\n\n\"I understand your urgency, but why rush? We've been at this for months. A few more days won't matter—we should be methodical. Haste could ruin everything.\"\n\nDog Woman's reasoning cut through Skunk's tension. He took a deep breath and nodded. \"You're right. No need to rush.\"\n\nSkunk's Expedition Group had been investigating the Sword Grave for five months without encountering another soul. Given that finding it had taken six months, no one else would suddenly appear and steal their discovery. There was no cause for panic.\n\nControlling his emotions, Skunk addressed his team. \"Everyone's worked hard. That's enough for today. Get proper rest for tomorrow.\"\n\n\"Thanks for understanding.\"\n\n\"Appreciate it.\"\n\nRelief washed over them. His subordinates opened their system windows, eager to log out and recover. But they couldn't rest. Not yet.\n\n\"...!?\"\n\nThe unidentified fragments throughout the Sword Grave—motionless since their arrival—suddenly flared with brilliant blue light.\n\n\"Why are there stars...?\"\n\nOf course, they knew these weren't true stars. The blue lights hovered too close to be celestial, shining brightly despite the daylight. Yet they gleamed with such beauty and remained beyond reach, forcing observers to call them stars anyway.\n\n\"Hold your positions!\" Skunk barked at his subordinates, who trembled at this unprecedented phenomenon.\n\nHis explorer's intuition and accumulated experience screamed a warning. Something had changed. The Sword Grave was reacting to an external factor.\n\n*Now...? What...?*\n\nThis didn't bode well. Skunk swallowed hard.\n\n\"Ugh. Finally made it.\"\n\nAn uninvited guest emerged.\n\nSkunk and his subordinates paled as they recognized the newcomer."
}