{
  "id": 938,
  "title": "Chapter 937",
  "content": "# Chapter 937\n\nThe Sword Grave bore its name for two reasons: it housed the weapons Pagma forged in his final years, and it served as Braham's tomb. A place of such profound significance to two legendary figures naturally drew the obsessive attention of Skunk's Expedition Group.\n\nUncovering its mysteries could rival—or even surpass—their discovery of the main Yatan Temple. Fame and fortune beyond measure awaited them. Skunk dreamed of buying his own plane. Dog Woman needed funding for experimental treatments for her dying brother. Crocodile wanted a garage full of supercars.\n\nA year. They'd invested an entire year into the Sword Grave.\n\nThen an uninvited guest arrived.\n\n\"G-Grid...!\"\n\nBlack-haired, crowned, with a high nose bridge and predatory eyes. His muscular frame couldn't be concealed beneath armor and cloak. The expedition recognized the name floating above his head instantly, and hatred flickered across their faces.\n\nGrid cocked his head. \"You are...?\"\n\nThe Sword Grave shouldn't exist to anyone outside Pagma's legacy. Yet here stood an entire group who'd arrived before him.\n\nHis eyes narrowed. \"Were you following me?\"\n\n\"No!\" Skunk blurted. \"That's impossible. This has to be coincidence.\"\n\nHe couldn't let a year of work go to waste. Blocking Grid would be suicidal—and Skunk hadn't become an expedition leader by being a fool.\n\nHe forced his rigid features to relax, plastering on a smile bright enough to belong to Grid's most devoted fan. \"What an honor, meeting you here! I'm Skunk, first-ranked explorer. It's a humble name, but... perhaps you've heard it?\"\n\n\"Skunk?\" Grid paused. The name conjured unfortunate associations, making it memorable. \"Ah, right. You located the main Yatan Church. Made headlines for a while.\"\n\n\"I'm honored you remember.\" \n\nSkunk's smile remained fixed, but his mind raced. Wasn't Grid supposed to be an arrogant fool in public? Why this polite demeanor in private, where no cameras watched?\n\n*It can't be genuine kindness.* Grid ruled a kingdom. His intelligence network dwarfed anything available to normal players. He could've been monitoring the Skunk Expedition Group for months.\n\nThe conclusion struck like ice water: Grid had been watching them excavate the Sword Grave's secrets all along. Of course he'd pay attention—this place mattered to him personally. He'd used them as unpaid laborers...\n\n*He's being polite because he feels guilty.*\n\nStupid. He'd been so monumentally stupid. They'd been excavating a site connected to Pagma, and he hadn't considered Grid might take interest. He'd even planned to negotiate a sale, completely blind to reality.\n\n\"...Um.\" \n\nSkunk's smile cracked. He felt ashamed before his companions, terrified before those calculating eyes. Nowhere to look. Nowhere to hide.\n\nBut he knew what had to be done.\n\nHis wandering gaze steadied. He bowed deeply. \"I'm sorry.\"\n\nThe apology carried layers of meaning: sorry for trespassing on Grid's quest, sorry for pretending this was chance, sorry for everything.\n\nHis companions stared in confusion. Even Grid looked lost.\n\n\"Skunk! What are you doing?!\"\n\n\"Why apologize out of nowhere?!\"\n\nThe expedition erupted. Dog Woman realized first, urgently gesturing for silence. Grid stood alone, completely unable to judge the situation.\n\n\"I don't know why you're apologizing.\"\n\nSkunk's heart plummeted. *He won't forgive me.*\n\nHe reassessed everything he knew about Grid: the man who'd married into Eternal Kingdom's nobility and consumed the kingdom whole. Who'd installed his follower Damian as pope and controlled him. Who'd sacrificed NPCs as shields during the Belial raid, then weaponized their deaths to annihilate Immortal. Who'd seduced Yura and Jishuka while negotiating with the Empire.\n\nGrid was vicious, cunning, ruthless, brilliant. Expecting mercy from such a man was madness.\n\n\"I see. This is your will, then.\"\n\nImpossible to be forgiven for daring to breach Pagma's tomb.\n\n*I deserve punishment. But not my team.* Skunk glanced at his nervous companions. *I can't let them suffer for my mistake.*\n\nA wasted year, and now their lives too? Unacceptable.\n\nHe bit his lip until he tasted blood, then raised his head.\n\nGrid said nothing. An attitude demanding they choose their own punishment. Likely the Skunk Expedition seemed like children playing dress-up to him. Not worth his time to determine consequences.\n\nSkunk smiled bitterly. \"I'll be honest. My colleagues solved how to unlock the secrets here. They can help you. Please, Grid. Please—direct your anger at me alone. Show them mercy...\"\n\n\"Skunk! Shut up!\"\n\n\"Captain, why take responsibility alone? There's only one Skunk Expedition Group!\"\n\nHis companions finally understood, screaming protests. Their captain wouldn't sacrifice himself alone.\n\n\"If Grid kills us, we die together!\"\n\n\"Yes! And I still don't understand why we have to die!\"\n\n\"Captain! Don't shoulder this by yourself!\"\n\n\"...Huh?\"\n\nThey shouted at Skunk, then unconsciously turned toward Grid.\n\nGrid had turned away, gazing at the stars.\n\n*I didn't see you today.*\n\n*I'm not seeing you now.*\n\n*Leave.*\n\n*Nothing happened.*\n\n*I'll forget this.*\n\nHis posture radiated these unspoken words as he studied the sky.\n\nSkunk felt something crack inside his chest. *I misunderstood him.*\n\nGrid had every reason to hate them. They'd tried to plunder the Sword Grave and sell its contents back to him at marked-up prices. Skunk had been so certain Grid had been watching, had prepared speeches about sin and punishment.\n\nYet Grid showed mercy. When he should barely contain his rage.\n\n*His heart is vast as the ocean.* \n\nEverything Skunk had believed about Grid crumbled. With hindsight, maybe this compassionate, generous person was the real Grid. Chris, Faker, Pon, Regas, Damian, Yura, Jishuka—all powerhouses. Would they follow a wicked man for years?\n\n*They know the true Grid.*\n\nTrembling, Skunk bowed deeply. \"Thank you. I'll never forget this grace.\"\n\nHe glanced at his party. The expedition members looked at Grid—still stargazing—and gathered beside Skunk. He sent a friend request.\n\n\"Regarding the Sword Grave... No, please whisper me if you ever need help. I'll come.\" \n\nFinal words delivered, he departed with his colleagues. Until the end, Grid never looked at them. Skunk glanced back several times, but Grid remained silently studying the heavens.\n\n*He's a great man.*\n\nAnyone else would hold a grudge. From Grid's perspective, they were grave robbers desecrating his teacher's resting place. Yet he forgave everything.\n\n\"The Overgeared King. The Overgeared Kingdom...\" \n\nSkunk began contemplating a new allegiance.\n\nMeanwhile, Grid had completely forgotten the Skunk Expedition Group existed. He hadn't heard Skunk's parting words. Every sense focused on the stars.\n\n**[An unknown light approached but stopped.]**\n\n**[The unknown light claims it never missed you.]**\n\n**[The unknown light insists it forgot the days spent with you. Says those days were insignificant and worthless.]**\n\n**[The unknown light doubts your quality—you're still weak.]**\n\n**[The unknown light wanted to ask if you've been eating well but stopped.]**\n\n**[The unknown light can't endure it.]**\n\n—*You're still ugly.*\n\nThe voice transmitted directly to his brain. Familiar. Wonderful. He'd never forgotten this voice. Grid recognized the attitude of the unknown light and felt tears sting his eyes.\n\n\"Aren't you supposed to be a transcendent great magician?\" Grid's face twisted into a frown. \"You're more like a dog magician.\"\n\nHe understood now. Why Braham left earlier than planned. How long Braham had suffered after departing Grid's body. The soul fragments showed him everything. His voice trembled with rising emotion:\n\n\"Really... I really wanted to see you, Braham.\"\n\nHe didn't know if he was laughing or crying. Grid smiled through his tears while Braham's soul fragments shone quietly around him."
}