{
  "id": 939,
  "title": "Chapter 938",
  "content": "# Chapter 938\n\nGrid had never known Braham whole. From their first meeting, the legendary great magician had existed as fragments—a shattered soul clinging to existence after losing both life and flesh. Hatred sustained him: loathing for the god who cursed his mother, rage toward the friend who betrayed him. Each fragment burned with the fury of the wronged.\n\nYet even diminished, Braham remained indomitable. An eternal flame that refused extinguishment. Those soul fragments possessed endless power and courage that commanded Grid's deepest respect. Despite his imperfect form, Braham had carved out an existence in this world through sheer force of will. He was absolute—the legendary great magician.\n\nBut years had passed since their separation.\n\nThe Braham that Grid encountered now was different. Weak. Diminished. The soul fragments flickered like dying embers, ash-grey and fading. Where once they had blazed with defiant fury, now they barely smoldered. The legendary magician who had forced Grid to submission, who had dominated the Red Sea with a single spell, who had witnessed the entirety of creation—his dignity had evaporated without trace.\n\nWhy?\n\n\"...Why did you leave me?\" Grid's expression twisted between laughter and tears before collapsing entirely into grief. Anger rose beneath the sorrow. \"You look so pathetic.\"\n\nBraham's power had waned to almost nothing.\n\n\"If you were going to end up like this...\"\n\nYou should have at least reclaimed your body first.\n\n\"Why did you leave?\" The question tore from Grid's throat as he struggled to contain his fury. He couldn't forget that day—the day of separation.\n\n*I have gathered all my strength and must depart.*\n\n*You were merely a vessel I required temporarily while consolidating my power.*\n\n*Since ours was only a contractual relationship, parting is simple.*\n\nThose had been Braham's words.\n\n\"Gathering all your strength—what bullshit.\"\n\nBraham had grown weaker, not stronger.\n\n\"What damn vessel?\"\n\nHe had cared for Grid.\n\n\"Simple? Like hell it was.\"\n\nNow reunited, Grid could see the truth written in every fragment: Braham had missed him desperately after leaving. Unable to suppress his emotions any longer, Grid shouted, \"What were you thinking? Why lie to me and abandon me? Why suffer alone? Tell me! *Tell me!*\"\n\n[The unknown light expresses confusion.]\n\n—*What's wrong with you? Has your mind fractured?*\n\n\"That's all you have to say?\" Grid felt like an idiot—standing here crying and raging alone while Braham dismissed him with casual deflection instead of answers. Paradoxically, that very dismissiveness helped Grid regain control, pulling him back from the edge of his surging emotions.\n\nBraham's voice carried forced lightness. —*No lengthy explanation is necessary. Circumstances differed from my expectations. That's all.*\n\nA lie. Braham had known from the beginning that he would fail. The magical power he'd recovered while residing within Grid fell catastrophically short of what resurrection required. He'd known his soul would collapse the moment he departed.\n\nHe left anyway. Because staying would have caused Grid even greater suffering. Naturally, Braham kept this truth buried. No need to burden Grid's heart with stones. Instead, he pivoted. —*Incidentally, why haven't you changed in three years? You're still pathetically weak.*\n\nDuring their separation, Grid had made tremendous strides. He'd absorbed power from direct vampire descendants, claimed the great demon Astaroth's strength, bonded with a light elemental, pushed his blacksmithing skills to their limits. Grid was confident he'd grown significantly.\n\nYet Braham scoffed. In his assessment, all vampires save his mother and Marie Rose were insignificant. He knew Astaroth had lost his body to Muller centuries ago, his power halved ever since. As for the light elemental...? Setting aside its rating, it was a newborn—hardly worth evaluating.\n\n—*The magic formulas I entrusted you remain sealed. How monumentally stupid must you be to not unseal even a single one in three years?*\n\n\"Braham.\" Grid cut through the harsh words.\n\nWatching Braham's cold performance, Grid found his calm completely restored. The soul fragments in the sky gazed down at him.\n\n\"You're right. I am weak.\"\n\nThe truth. Grid was confident in his strength—against other players.\n\nBut the 'world' Grid perceived extended far beyond other players' horizons. Which was precisely why—\n\n\"I need you. Come back to me.\"\n\nComplete honesty. Desperate sincerity.\n\n[The unknown light falls silent.]\n\n\"Let's stay together again. There's so much I want to learn from you.\"\n\n[The unknown light remains silent.]\n\n\"You don't want to? Fine. I'll concede. You don't need to teach me anything. Don't do anything at all. Just stay with me.\"\n\nNo pretense colored Grid's words. He didn't covet Braham's knowledge or magic, didn't hunger for the hidden quests a great magician might generate. Grid simply refused to allow a second Khan—refused to let Braham die alone in solitude and agony. He wanted to support Braham in his weakened state.\n\n\"Use me as your vessel. I'll lend you my body until you recover your strength. You can leave the moment you're fully restored.\"\n\n—*...*\n\n[The unknown light trembles.]\n\n[The unknown light struggles to contain itself.]\n\n[The unknown light resists being swept away by your emotions.]\n\n[The unknown light shakes violently.]\n\n[The unknown light cannot endure.]\n\n—*...I will be a burden to you.*\n\n—*Lich Mumud is powerful. Many of his restraints will lift when we meet.*\n\n—*Mumud's master enjoys the protection of Great Demon Baal. Though young now, one day the world will revolve around him.*\n\n—*Crisis will follow crisis if you keep me with you. Eventually, you won't be able to resist.*\n\nThese were the words that had driven Braham away three years ago—buried deep in his heart until now. He released them desperately. Yet Grid didn't waver.\n\n\"I'll become stronger.\"\n\nGrid's eyes held steady.\n\n\"Strong enough to protect you.\"\n\nNo hiding his feelings.\n\n\"A crisis I can't overcome? There won't be one.\"\n\nThis was why Grid had worked so relentlessly. Why he would continue working in the future.\n\n\"I'll protect my family and friends.\"\n\nHis wish: to safeguard those precious to him. Grid—who once pursued only individual gain—had changed through countless trials. He wasn't satisfied with wealth, fame, or heroism anymore. Instead, he worked ceaselessly.\n\nWhich was why he could say it clearly: \"I've been happy for a long time. Since the moment I escaped that life of inadequacy, weakness, and contempt. It started when I could afford the food I wanted... I felt happiness the moment I made friends who actually liked me.\"\n\nThis happiness...\n\n\"I want to share this happiness with the people I treasure. I want everyone important to me to feel what I'm feeling.\"\n\nGrid looked up at the stars. Tiny lights, pebble-sized. Dozens of dim fragments all staring down at him.\n\n\"You're one of them.\"\n\nGrid knew Braham's story. The curse he'd received, the suffering he'd endured. Braham carried deep anguish over abandoning his brothers and betraying his disciple. Grid understood it all. Braham had never gotten the chance to make amends—his friend betrayed him, killed him first.\n\nSo Grid wanted to offer Braham a new existence—a blessed life. He wanted to repay the countless gifts Braham had given him.\n\n\"Braham, trust me. Stay with me.\" Grid extended his hand.\n\n[The unknown light falls silent.]\n\n[The unknown light speaks truth.]\n\nBraham hesitated.\n\n—*I am weak.*\n\n—*I cannot help you.*\n\n—*I am a burden. Poison to your existence.*\n\n[Yet the unknown light still wishes to be with you.]\n\n—*...Even so, is it truly acceptable for me to remain?*\n\nGrid's face lit up. \"It's perfect.\"\n\nThe dozens of light fragments flowed into Grid's body. A thread of fate bound Grid's soul to Braham's. A notification window materialized.\n\n[You have acquired the Soul of a Great Magician Who Lost his Power.]\n\n[Your second class 'Great Magician' has evolved to 'Duke of Wisdom.']\n\n[You have obtained a legendary-rated second class twice consecutively!]\n\n[Additional stat points per level increased from 2 to 4.]\n\n[Half of all stat points gained upon leveling will automatically be assigned to Intelligence.]\n\n[The Soul of a Great Magician Who Lost his Power is currently in a 'Disabled' state.]\n\n[You cannot learn new spells in this state.]\n\n[You cannot use Assimilation in this state.]\n\n[The Soul of a Great Magician Who Lost his Power will recover over time or whenever your Intelligence increases by 1,000.]\n\n[Five recovery states exist: Disabled, Weakened, Improved, Recovering, and Complete. Special events will occur upon reaching 'Recovering' and 'Complete' states.]\n\n[The skill Magic Contemplation has been created.]\n\n[Magic Contemplation Lv. 1]\n\n[—Passive skill.\n\nThe knowledge and wisdom of the Duke of Wisdom penetrates the providence of all magic.\n\n★ When observing enemy magic: 50% chance to deconstruct the spell, 4% chance to replicate it.\n\n★ When observing ally magic: 30% chance to enhance it.\n\n★ Applies to magic of all attributes.\n\n★ Cannot yet contemplate multiple spells simultaneously.\n\nMana Cost: None\n\nCooldown: 3 seconds]\n\n\"Ah...\"\n\nThis wasn't what Grid wanted. He'd meant to help Braham, not receive gifts from him. Yet he couldn't deny the honest joy flooding through him at this new power. Admiration filled him completely.\n\n*How overwhelmingly strong was Braham in his prime?*\n\nBraham's voice reached Grid's ears—a quest prologue.\n\n—*Pagma remained wary of me until the very end.*\n\n[A hidden quest has occurred!]\n\n—*He encased my body in ice and concealed it somewhere here, protected by passwords I cannot bypass. Grid, I must reclaim my body eventually. I need to ensure it remains intact.*\n\n[Braham's Request]\n\n[★ Hidden Quest ★\n\nBraham is frustrated that Pagma continues tormenting him even beyond death.\n\nDreaming of resurrection, Braham wishes to confirm his body's safety.\n\nClear Conditions: Locate Braham's body.\n\nRewards: Affinity with Braham +30]\n\n[Your affinity with Braham already exceeds maximum threshold.]\n\n[Quest rewards have been adjusted.]\n\n[Adjusted Rewards: Intelligence +50. Linked hidden quest unlocked.]\n\nShould he say it? Maybe better to tell Braham in advance. Grid agonized over the quest contents before speaking carefully. \"Braham... Pagma regretted betraying you.\"\n\n—*What?*\n\n\"After discovering that a god had incited the great demons to invade the world, he realized that distinguishing good from evil was meaningless. He regretted what he'd done to you—deeply. To the point of shedding tears. The reason he encased your body in ice and hid it wasn't to torment you or stay wary. He was trying to protect it...\"\n\n—*Shut up. I didn't accept you as my vessel to listen to such nonsense.*\n\nBraham's voice shook Grid physically. The immense confusion radiating from Braham transmitted directly into Grid's consciousness. Grid sensed it then—a new story would unfold the moment he broke through the traps of regret and hatred binding these two legends together. Only one person in this world could initiate that story: Pagma's Successor and Braham's friend. Grid.\n\n\"Pagma's Eyes.\"\n\nGrid decided to proceed carefully rather than rush. His eyes blazed with blue light. The Sword Grave materialized in his vision—4,179 swords boring into his awareness. Pagma...? No, perhaps someone else?\n\nAmong those 4,179 blades, only one responded to Grid. An ego sword. Its design eerily reminiscent of the Rebecca Church's treasure—the First Holy Sword.\n\nGoosebumps rippled across Grid's skin. The ego embedded in that holy sword had to belong to a saint. Among Pagma's old comrades, one had been a pope. At this realization, Grid felt a chill of fear toward Pagma himself."
}