{
  "id": 940,
  "title": "Chapter 939",
  "content": "# Chapter 939\n\n*The 5th Pope...? No. That can't be right.*\n\nGrid recalled what he knew of Pope Franz—a figure said to have been close to Pagma, and the true master of the Holy Light Set. The history wasn't fabricated. Pagma himself had forged those sacred artifacts. He'd even sealed the Rebecca Church's three greatest treasures as a personal favor to Franz. The bond between them must have run deeper than the records suggested.\n\n*But to seal your friend's soul inside a sword? You'd have to be insane.*\n\nGrid shook his head, trying to dismiss the thought. Yet he couldn't entirely deny it. After all, Pagma had murdered Braham—someone he'd once called friend. Perhaps applying normal standards of morality to such a man was foolish.\n\n\"Are you Pope Franz?\" The question left Grid's lips despite himself. Part of him hoped for a denial, some proof that Pagma wasn't quite as monstrous as he feared.\n\nThe sword's response crushed that hope.\n\n—*I am surprised you recognized me. You must be closely tied to Pagma—intimately familiar with his work. You can wield his power, yes?*\n\nThe voice resonated with unexpected clarity and brightness. *Youthful*, Grid thought. The word sent chills down his spine. Pagma's cruelty in binding his friend's soul to cold steel. Franz's undiminished spirit after centuries of imprisonment.\n\n*This isn't about mental fortitude. It's his personality. He must be relentlessly, impossibly optimistic.*\n\n—*Did you come here because of Braham's soul?* the sword asked, sensing Grid's tension. *The one you're carrying?*\n\n\"You can feel him?\"\n\n—*At first, I couldn't sense his magic power. I never imagined a mere soul fragment could radiate such overwhelming arrogance.*\n\nThe sword seemed to laugh—as if amused rather than offended by Braham's pride.\n\n\"So that's why you're here? To guard this place?\"\n\n—*Correct. I stand watch over Braham's body, preserved in the glacier dungeon beneath the Sword Grave.*\n\nBraham's voice exploded through Grid's consciousness. —*That Rebecca-worshipping dog is keeping my body hostage!*\n\n*Calm yourself. He said he's guarding it.*\n\n—*Guarding it from ME! Preventing my resurrection! That bastard Pagma—more spiteful than any demon, tormenting me beyond the grave!*\n\n\"...\"\n\nBraham's rage and terror burned too hot. The soul fragment was small, fragile—barely able to contain such volatile emotions. Grid felt the danger of disintegration. He needed to complete this quest quickly, before Braham tore himself apart.\n\nMoving closer to the embedded blade, Grid activated Pagma's Eyes.\n\n**[Sword Guarding the Grave]**\n\n**Rating: Legendary**  \n**Durability: ∞ | Attack Power: 8,395**  \n**Divine Power: ??? | Defense: 2,029**\n\n**• A legendary-grade ego dwells within.**  \n**• ???**  \n**• ???**  \n**• Passive Skill: Pope Who Lost Faith**\n\n*A masterwork from the legendary blacksmith Pagma's final years. A treasure that will endure for millennia.*\n\n*The Sword Guarding the Grave bears the ego of 5th Pope Franz and exercises independent will.*\n\n**< Unavailable Item >**\n\n*His final years...*\n\nGrid had observed the pattern before. Pagma's early works fell short of Grid's current craftsmanship. His middle period matched Grid's skill. But the pieces from Pagma's twilight years? They occupied heights Grid could only glimpse from far below. The gulf was one of experience and accumulated wisdom—though God Hexetia's blessing meant Grid would eventually close that distance.\n\n\"Please,\" Grid said carefully. \"Guide me to Braham's body.\"\n\nHe didn't know when Franz had been transformed into this sword—whether by force or consent, how many centuries he'd stood vigil. Questions crowded Grid's mind, but reuniting Braham with his body took priority.\n\nThe sword's response surprised him.\n\n—*Isn't my role to guard the glacier dungeon from intruders? Why would I simply let you pass?*\n\n\"Intruder?\" Frustration crept into Grid's voice.\n\nThe sword knew his connection to Pagma. It had sensed Braham's soul. Why treat him like an enemy?\n\n\"I've inherited Pagma's skills. I'm protecting Braham's soul. Why call me an invader? I'm the *only* one qualified to enter that dungeon.\"\n\n—*You inherited Pagma's techniques, true. But techniques aren't intentions. And I can't distinguish whether you're protecting Braham's soul... or holding it prisoner.*\n\n**[A new hidden quest has occurred!]**\n\n>[**Proof**]  \n>  \n>[★ Hidden Quest ★]  \n>  \n>**Pass the test of the Sword Guarding the Grave!**  \n>  \n>Quest Clear Conditions: Pass the test.  \n>Quest Clear Reward: Authorization to enter the glacier dungeon.\n\n*A test?*\n\nGrid eyed the blade warily. Over 8,000 attack power. Forged by Pagma at his peak. Housing a pope's soul. And most of its abilities remained hidden behind question marks.\n\n*Still. No choice but to try.*\n\nHe swallowed hard and drew the Enlightenment Sword.\n\n—*First question! What was Pagma's ultimate purpose?*\n\n\"...Uh. W-World peace?\"\n\n—*Ding-dong-daeng! Correct!*\n\n\"...\"\n\n—*Second question! What ideal did Pagma value most highly?*\n\n\"The... humanitarian belief that blacksmithing should benefit others?\"\n\n—*Ding-dong-daeng! Correct again! Now, the third question: What is Braham's true identity?*\n\nThe absurdity faded from Grid's expression. His voice turned somber as he answered.\n\n\"He was a vampire. A human. A legendary great magician praised as the Duke of Wisdom—though he never reached the ultimate truth.\"\n\nGrid paused, then continued.\n\n\"He was a man who despised Yatan, the god who cast out and cursed his mother. And he was betrayed by the only friend he'd trusted.\"\n\nThe air grew heavy. Braham's soul trembled—Grid felt the resonance of it. This wasn't mere sympathy. In this moment, Grid understood Braham completely. Perhaps uniquely so.\n\n—*Yes,* the sword said quietly. *Correct.*\n\nThe frivolous brightness had left Franz's voice entirely.\n\n—*Final question. Do you sympathize with Pagma?*\n\nSomething in the sword's tone put Grid on guard. But he answered truthfully.\n\n\"I understand him. But I don't agree with his choices. I would never betray a friend.\"\n\n—*I see.*\n\nHad Grid imagined the shift in Franz's mood? The sword's tone remained gentle. The blade rotated twice—left, then right—and drove itself deeper into the earth.\n\nThe landscape transformed.\n\nThe plain's center rose like a burial mound, revealing what the Skunk Expedition Group had failed to find in half a month of searching. An iron door, firmly sealed, set into the hillside.\n\n—*Braham. I know you can't respond, but I hope you're listening.*\n\nThe door swung open slowly. Frigid air rushed out, frost spreading down the slope like grasping fingers.\n\n>[**★ Hidden Quest ★ 'Proof' has been cleared.**]\n\n—*Braham,* Franz continued, *Pagma sincerely regretted what he did to you. After defending the Behen Archipelago from the great demons, the first place he came was here—to the glacier dungeon where he'd buried your body. He knew that someday you might reclaim it. Be resurrected. So he created the Sword Grave to keep you safe. Then he summoned my soul and asked me to stand watch.*\n\n—*Shut up, shut up, shut UP!*\n\n—*He didn't do it seeking forgiveness. Pagma understood his sins could never be forgiven. Perhaps... he only wanted to hate himself a little less.*\n\n—*SHUT UP!*\n\n—*See your body with your own eyes. I hope you'll be resurrected someday. Hell and Marie Rose, the Hwan Kingdom and the gods... all the problems Pagma couldn't solve. Maybe you can—*\n\n—*I SAID SHUT UP!*\n\n\"Braham...\" Grid pressed a hand to his chest. The soul fragment was fracturing, spinning out of control. He feared it might shatter completely.\n\n—*Pagma's Successor.* Franz's voice carried a note of farewell. *From what I've witnessed, you are Pagma's opposite. I find myself hoping you succeed. Now—enter the dungeon. The door won't stay open.*\n\n\"I'll return. We'll speak again.\"\n\n—*Yes. I'll guard this place until Braham's resurrection. Come back whenever you need to.*\n\nThis was karma—the price for a foolish pope who'd weakened his church rather than use Rebecca's Daughters as disposable pawns. Franz, transformed into cold steel for centuries, had never once regretted asking Pagma to seal those three artifacts.\n\nThe iron door sealed behind Grid as he descended. The hill flattened once more. And 4,179 swords stood silent vigil over Pagma's final grave.\n\n***\n\nHuman language was inadequate.\n\nGrid reached this conclusion as he stared at the white-haired figure encased in ice. No words in his vocabulary could capture the ethereal beauty of the man trapped within. His heart and mind simply lacked the capacity to express it.\n\nBraham's soul was stabilizing.\n\n—*It's intact.*\n\n\"Thank the gods.\"\n\n—*Seeing myself again reminds me how much you resemble a squid.*\n\n\"...\" Grid couldn't argue. He felt almost grateful for the insult. Compared to Braham's frozen form, calling Grid a squid was generous. *(Note: In Korea, \"squid\" is slang for ugly.)*\n\n>[**★ Hidden Quest ★ 'Braham's Request' has been cleared.**]  \n>  \n>[Intelligence has increased by 50 as a quest clear reward.]  \n>  \n>[You cannot learn new spells in your current state.]  \n>  \n>[Quest completion has triggered a new hidden quest.]\n\n**[Pagma's Arrangement]**\n\n>[★ Hidden Quest ★]  \n>  \n>Pagma left his book in this world for one reason: his old friend, Braham.  \n>  \n>Braham knows the value of pavranium. Pagma anticipated that Braham would seek out Pagma's Successor and request the creation of the Vessel of the Soul.  \n>  \n>He is grateful you brought Braham here. As thanks, he offers you a gift.\n\n>[**★ Hidden Quest ★ 'Pagma's Arrangement' has been cleared.**]  \n>  \n>[Hidden piece skill 'Mineral Creation' has been acquired as a quest clear reward.]\n\n—*Grid.*\n\n\"Yes?\"\n\n—*I have no intention of forgiving Pagma. I'll hate him forever. If we ever meet in hell, I'll kill him with my own hands.*\n\n\"You do that.\"\n\n*Perhaps that's exactly what Pagma wanted,* Grid thought, but kept the words to himself."
}