{
  "id": 941,
  "title": "Chapter 940",
  "content": "# Chapter 940\n\n> [A thousand-year chill has penetrated deep into your bones.]\n> [Your heart is frozen.]\n\nThe glacier dungeon sealed itself the moment Grid crossed the threshold. The space itself served as the final guardian—hostile to all living things, tolerating none.\n\n*This is why Pagma chose this place.* Even if tomb robbers somehow discovered the Sword Grave against impossible odds, Braham's body would remain protected.\n\n> [You have resisted.]\n> [Your body temperature is maintained due to the effect of Valhalla of Infinite Affection.]\n\nGrid stared at the notification windows, his chest tightening. Pagma must have poured the same devotion into constructing the Sword Grave as Khan had when crafting Valhalla. Yet that devotion never reached Braham—the weight of betrayal was too heavy. Even after confirming his body's safety, Braham had only felt relief before hatred consumed him again.\n\nPagma must have known. He must have understood, even as he sealed this place, that his friend would never forgive him for murder.\n\n*He died alone.*\n\nGrid felt the bitter sting of that truth. He had no intention of defending Pagma's sins, but the tragedy of it lingered nonetheless.\n\nThe moment passed. Grid shook off his melancholy and examined his newly acquired skill.\n\n**[Mineral Creation]**\n- *Create new minerals by mixing multiple minerals. Requires the cooperation of a magician.*\n- *Skill Usage Conditions: Sign a research contract with a magician.*\n- *Duration required for skill research: ?*\n- *Number of minerals that can be created: 1*\n\n*As expected.* The instant he'd heard the skill name, Grid had thought of pavranium—the legendary mineral Pagma and Braham had created together after years of research. Infinite durability. Its own will. The strongest mineral ever forged.\n\n*Whatever I create might have completely different properties.* The skill allowed for mixing multiple minerals, which meant the characteristics would vary depending on the combination.\n\n*But the description is frustratingly vague.* The unknown research duration bothered him. How many minerals could be mixed? The skill didn't specify.\n\nBraham sensed Grid's confusion. —*The number of minerals and research time will depend on the magician's level. Impossible to predict precisely.*\n\nBut one thing was certain.\n\n—*Sign a contract with this legendary body, and you'll create minerals by mixing numerous types. The process will be remarkably swift.*\n\nBraham had experience creating pavranium with Pagma. Once you'd done it before, creating new minerals became exponentially easier.\n\n\"You're reliable.\" Grid smiled, the expression cutting through the cold that froze his bones and heart.\n\nThen Braham delivered unexpected news. —*However, I'm not a legendary great magician right now. Just a hollow shell with fragmented knowledge. I can't assist with your research.*\n\n\"Can't you just use your knowledge?\"\n\n—*I'm a magician. My knowledge is built on magic power. Without it, I can't implement anything.*\n\n\"Ah...\" Grid's face fell.\n\nHe couldn't create a second pavranium with Braham until the vampire's soul was fully restored. Braham noticed his disappointment. —*I remember you have a magician among your subordinates?*\n\nGrid had thousands of magicians under his command. But he knew exactly who Braham meant—Great Magician Ashur. The only one who met Braham's *minimum* qualifications to even be considered a proper magician.\n\n—*If you cooperate with him, you could begin research immediately.*\n\nGrid scoffed and spoke decisively. \"I'll definitely do my research with you.\"\n\n—*How irritating. I'm already trembling at the thought of working with an idiot like you... Though I suppose it can't be helped if that's what you want. Later, you'll kiss my feet and grovel in gratitude.*\n\nBraham's soul rippled. He seemed genuinely pleased.\n\n\"I understand. Kissing your instep is easy enough.\"\n\n—*W-What?! Look at this lunatic! I don't need your disgusting kiss!*\n\n\"Then why did you bring it up...?\"\n\nRegardless, the conversation was premature. Braham needed to restore his soul to legendary magician status first, and that would take considerable time.\n\n\"Let's table this discussion. Focus on your recovery until we create gravurnium—the mineral that will surpass pavranium.\"\n\n—*Gravurnium?*\n\n\"The name of our new mineral. Grid and Braham combined.\"\n\n—*Then where does the 'vur' come from?*\n\n\"That...\" Grid's mind went blank. Heat crept up his neck as he realized he'd subconsciously thought of gravure models.\n\n*Am I really that sexually frustrated lately?*\n\nMaybe he should name it something simple like Overgeared Stone? No, that wouldn't work. He wanted Braham's name incorporated into the mineral they'd create together.\n\n—*??* Braham's pale face flushed as he watched Grid shake his head vigorously for no apparent reason.\n\n> [The return scroll has been used.]\n\nGrid's vision flickered white.\n\n***\n\n—*It's acceptable.* Braham sounded mildly impressed as they materialized in Reinhardt Castle after so long away. Then his gaze landed on the massive portrait of Grid dominating the castle lobby. —*It's a good painting. A hundred times better than the real thing.*\n\n\"I know.\"\n\n—*Why are you blushing? It's natural for a king's portrait to hang in his castle. No need to feel self-conscious.*\n\n\"I'm just embarrassed to have my squid-like face on display.\"\n\n—*Hah? Compared to me, you're certainly a squid. But for a human male...*\n\nGrid was still squirming with embarrassment when Lord returned from training and spotted him.\n\n\"Father!\" \n\nLord almost launched himself into Grid's arms, but he was too old for that now, wasn't he? He caught himself, aware of the watching servants, and bowed politely instead. \"Did your journey go well? I was terribly worried.\"\n\nGrid dropped to his knees and pulled Lord into an embrace anyway. \"Thank you for worrying. I've returned safely.\"\n\n\"Ah... my clothes are filthy.\"\n\n\"Dirt on your clothes is natural.\"\n\nThey were different from typical royalty, Grid and Lord. Their clothing always bore stains of dirt and sweat—Grid from smithing and hunting, Lord from his relentless training. It was unavoidable.\n\n—*Your son is correct.*\n\nAfter bathing with Lord and spending time with Irene in the bedroom... *[content omitted]*... Grid returned to his office. Braham, who'd remained silent during Grid's family time, finally spoke. He sounded somewhat excited. —*I thought he was unusual the first time we met, but your son is a thousand times more talented than you.*\n\n\"Hehe. My son is a genius above geniuses.\"\n\nEven hedgehogs thought their babies were beautiful. Grid was naturally proud of Lord, who was not only handsome but possessed talent that outshone the entire continent.\n\nBraham's next words carried deeper meaning. —*Don't teach him magic yet.*\n\n\"Huh? Why? Lord is so exceptional at everything, I'm certain he'd master magic quickly.\"\n\n—*Don't teach him regardless.*\n\n\"But why?\"\n\n—*I don't want to explain. It's frustrating and exhausting to make you understand anything.*\n\n\"Ah, is that so?\"\n\nGrid trusted Braham just as Braham trusted him (intelligence aside). If Braham said so, there must be a good reason. Grid immediately resolved to forbid Lord from studying magic.\n\n\"Now then, next...\"\n\nOnly one task remained—preparing for his role as the Demon King. Grid laid out the materials he'd prepared earlier on his desk and began contemplating what to create using Item Creation, which he could use freely on the National Competition server.\n\n***\n\nChina was hosting the 4th National Competition. As August 3rd approached, one particular column sent shockwaves through the Chinese gaming community. The author was a veteran reporter who'd covered e-sports for sixty-three years.\n\n**[Koreans Will Learn Humility]**\n\n*We all know South Korea is one of Northeast Asia's smaller nations. Until Satisfy's release, South Korea wasn't particularly important to Chinese players, and some didn't even know it existed.*\n\n*However, for e-sports fans, South Korea occupies historic significance. Not only was South Korea the birthplace of e-sports, but the majority of legendary pro gamers from decades past were Korean. Yes—decades ago. What became of South Korea after that? Today, South Korea is merely part of history. Few still wonder about the fallen e-sports nation. The era when Koreans dominated the scene ended decades ago.*\n\n*Sixty years ago...*\n\n*I still vividly remember my first visit to South Korea. I can't forget the imposing sight of Korean pro gamers sweeping trophies across every game genre. To my youthful self, they were gods walking among mortals.*\n\n*What about now? South Korea has fallen. Their last heroes were Faker, Wolf, and Bang. Korean dominance in professional e-sports exists only in the distant past.*\n\n*Yet South Koreans remain proud. They believe they're still an e-sports nation. They believe the hero Grid will carry the country alone forever.*\n\n*I want to ask them: How many heroes does China have? How many does the United States have? Don't they realize that the Grid they praise as a hero is merely one individual? South Korea has limits. I must admit they produce heroes once every few decades, and I can't deny Grid is propping up South Korea in the present day. But can Grid's era last forever?*\n\n*E-sports powerhouses like China and the United States have built infrastructure based on enormous capital investment. This infrastructure produces dozens of new heroes annually. But South Korea? Their situation is entirely different.*\n\n*During e-sports' revival period, the South Korean government was incompetent enough (at least in this sector) to classify games as a \"drug.\" South Korea is an insular, outdated nation. They hastily constructed infrastructure after Satisfy launched, but they lack expertise and must learn through countless trials and errors.*\n\n*Unlike us, South Korea can't continuously cultivate heroes. They must rely on one \"genius\" hero, just as they did in the past. They remain oblivious to reality. South Korea believes they'll reclaim the e-sports summit once more.*\n\n*This reporter believes Grid declared he wouldn't attend this year's National Competition as a wake-up call to his people. Grid will learn humility when South Korea loses this year.*\n\nChinese public opinion boiled over regarding Grid. They'd begun praising Grid as the hero of the \"small country\" they'd previously ignored. Their superficial reasoning for praising Grid was awe for this \"thoughtful hero,\" but what was the reality?\n\nChina rejoiced because they believed they could claim first or second place at the National Competition in Grid's absence. As the host nation, billions of Chinese citizens hoped China would meet these expectations.\n\nThen circumstances shifted. In the Battlefield mini-game held before the National Competition, not a single Chinese player survived. Yet one survivor was Korean—Coke, the young prodigy mentored by the 10 Meritorious Retainers."
}