{
  "id": 942,
  "title": "Chapter 941",
  "content": "# Chapter 941\n\n\"Is South Korea back?\"\n\nThe upset came without warning. Despite Grid's absence, South Korea had already claimed two gold medals by the end of day one—a result that had blindsided every analyst's predictions.\n\nYura captured the first in Drawing the Saint Sword. Coke secured the second in Recapture the Mine.\n\n\"That rookie is inhuman,\" one commentator declared. \"Battlefield survivor, commanding genius, gold medalist—all in his debut year. The kid's built different. We're witnessing the birth of another monster.\"\n\nThe comparison was inevitable. Battlefield demanded raw individual skill—split-second decisions in pure combat chaos. Recapture the Mine required something else entirely: real-time command of twenty miners, strategic foresight, adaptive tactics. Two completely different skill sets.\n\nCoke had mastered both.\n\nHis debut wasn't quite at the Grid or Kraugel level—those were once-in-a-generation performances. But it came damn close.\n\n\"Look at South Korea's track record,\" another analyst noted. \"Yura. Grid. Peak Sword. Eat Spicy Jokbal. Now Coke. Five SSS-grade talents in as many years. And let's not forget—Kraugel was born Korean too. At some point, you stop calling it coincidence.\"\n\nThe international community stirred with barely concealed frustration. They'd spent months declaring South Korea a non-threat this year. Grid had abandoned them, after all. The remaining team couldn't possibly compete.\n\nYet here they were—two gold medals before anyone else had hit their stride.\n\nThe players who'd given those confident pre-tournament interviews now faced the wrath of their own citizens. China erupted with particular fury.\n\nThis was the homeland of Sun Tzu. Chinese players studied *The Art of War* like scripture. Strategy events—Recapture the Mine, Siege War—should have been guaranteed victories. The gold medals were theirs by cultural birthright.\n\nInstead, they'd scraped bronze.\n\nThe online forums exploded:\n\n*-Gold expected, bronze delivered? What a joke.*\n\n*-Our rankers talk big but deliver nothing. Too comfortable with their corporate sponsorships. Too fat and lazy.*\n\n*-Why do we keep losing to them? South Korea's population is thirty times smaller! Statistically, we should dominate!*\n\n*-'Lack of effort'—is that really still the excuse? Four years of the National Competition, four years of underperformance. Meanwhile, the United States maintains their top spot. Face reality: we're genetically inferior.*\n\n\"It's not fair,\" Li Xuandu muttered in the Chinese waiting room. \"Bronze is still an achievement.\"\n\nMei Xiao sat beside him, knees drawn to her chest, phone displaying the brutal commentary. She powered it off and turned to the forty-year-old veteran.\n\n\"You worked hard, mister. Don't let it get to you—they don't understand what it takes.\" Her hair was styled in double buns, giving her a panda-like appearance that suited her gentle demeanor. \"The other players know you gave everything.\"\n\n\"I appreciate it.\"\n\nBut consolation couldn't change results. At his age, Li Xuandu understood society's harsh truths. He managed a bitter smile. \"I'm sorry, Mei Xiao.\"\n\nHis bronze medal had branded him part of the 'incompetent Chinese contingent.' Worse, Mei Xiao belonged to the same rookie generation as Coke. The gold medal she'd aimed for—the spectacular debut she'd planned—had been claimed by her direct competition.\n\n\"Someone else achieved your dream debut first,\" Li Xuandu continued. \"That must sting.\"\n\n\"I'll be fine.\" Mei Xiao shook her head, blooming into a smile that belied her youth. She understood something important: dreams were personal. You couldn't rely on others to achieve them.\n\n*I'll prove myself when it matters. The final stages favor me anyway.*\n\nThe 4th National Competition spanned four days. Mei Xiao's events clustered on day four: Breaking the Hero, PvP, and Demon King Subjugation. The major events. PvP drew the largest global audience, but Breaking the Hero had special significance this year—the hero being Grid himself. Interest rivaled even PvP.\n\nThen there was Demon King Subjugation. Only three to four players per country could participate, but its team-based nature and difficulty made it arguably bigger than PvP.\n\n*Early impressions fade,* Mei Xiao reminded herself. *Final stage performances are what people remember.*\n\n\"I'll make you proud, brother.\"\n\nHer plan crystallized in her mind: defeat Grid's AI, reach the PvP finals against Kraugel, then dominate the Demon King Subjugation. A perfect trifecta to announce her arrival.\n\nMei Xiao was Hao's younger sister—Hao, who was absent from this year's competition. She'd been adopted as an orphan, raised alongside her brother by parents who'd given them everything. Now she would become China's new hero and restore the honor her brother had lost.\n\nThe pressure was immense. Could she really reach the PvP finals with Haster in the bracket? Coke had already stolen her dream of being the first rookie gold medalist. Self-doubt crept in.\n\n\"I can do this!\" She pumped her fist, forcing confidence into her voice.\n\nAcross the room, Zhang Jian and Liao Wei exchanged knowing looks.\n\n*Hao's sister thinks she'll steal the spotlight?* Zhang Jian's smile didn't reach his eyes. *I'll crush her in PvP if we meet. One blow.*\n\n*I'll clear the hero challenge faster and dominate the Demon King Subjugation,* Liao Wei thought. *Time to show who the real stars are.*\n\nThe Chinese rookies brimmed with confidence—perhaps too much. They'd been chosen from billions, showered with sponsorship money, told they were the best.\n\nMeanwhile, in South Korea's corner:\n\n\"Breaking the Hero? Me?\" Coke blinked at the reporter. \"No chance. Have you seen Grid's stats?\"\n\nHis humility bordered on self-deprecation. Or perhaps he simply understood the magnitude of the challenge. He regarded the interviewer with something like pity—as if the question itself revealed a fundamental misunderstanding of reality.\n\n***\n\nDay two proceeded smoothly. The United States, Canada, and China each claimed two golds. The major powers—United Kingdom, France, Japan, Russia—collected respectable numbers of silver medals.\n\nBrazil's lone gold came from Target Processing, naturally. Jishuka's Bow Mastery had evolved to near-master level, experts agreed. With the Red Phoenix Bow in her hands, she was untouchable in that event.\n\n*-Jishuka's instincts are insane. Those low-angle shots shouldn't be possible.*\n\n*-Her suppression fire coverage is perfect.*\n\n*-How does she predict attack vectors before they develop?*\n\n*-Jishuka's gorgeous.*\n\n*-That posture when she draws the bowstring... deadly in every sense.*\n\n*-She's always beautiful. Always sexy.*\n\n*-Lucky bastard Grid.*\n\n*-Grid should suffer.*\n\n\"Yes!\"\n\nPeak Sword and Toon secured silver for South Korea. Peak Sword groused about his medal—he'd been on track for gold until Iyarugt went berserk mid-event. Toon, by contrast, was thrilled. His performance in the Obstacles Race had revealed his potential. His ability to analyze obstacle characteristics and transform into appropriate animals was genuinely impressive. Next year, he'd be even more formidable.\n\nSouth Korean forums buzzed:\n\n*-Why was Peak Sword slashing at empty air?*\n\n*-Silver's still great. Proud but... yeah. Missed opportunity ㅠㅠ*\n\n*-Can't tell if Peak Sword's trolling or actually skilled.*\n\n*-Did you see Toon going ham?*\n\n*-Your pronunciation needs work, friend.*\n\n*-Seriously, take the advice.*\n\n*-Toon's legitimately good though. Glad he immigrated.*\n\n*-Government deserves credit for the military exemption deal.*\n\n*-...That was always standard procedure?*\n\n*-Learn to recognize jokes.*\n\n*-Toon posted a photo eating jjajangmyeon on social media ㅋㅋ*\n\n*-Grid eats jjajangmyeon almost daily ㅋㅋㅋ*\n\n*-Is Grid why Toon moved? Could other Overgeared members immigrate too?*\n\n*-Petition for Jishuka.*\n\n*-Euphemina would be better.*\n\n*-Faker immigrating would be the jackpot.*\n\n*-What if Vantner comes?*\n\n*-Vantner's not bald. He shaves his head.*\n\n*-He's bald.*\n\n*-That's our Vantner.*\n\nThe festival eclipsed the Olympics, World Cup, and Super Bowl combined. Even without Grid's participation, the 4th National Competition captivated billions. New storylines emerged daily. Heroes rose. Others fell. Tears of joy mixed with tears of frustration.\n\nDay three delivered the appearances everyone had been waiting for.\n\nZibal turned the Boss Raid into spectacle, riding his target monster like a mount while systematically dismantling it. Haster debuted in Cliff Flower, using sound waves—the very whisper of wind—to detect and eliminate emerging monsters before they fully spawned.\n\nNeither played by normal rules. Both transcended common sense. Their victory poses radiated casual confidence, as if gold medals were inevitable outcomes rather than achievements.\n\nAmerican forums buzzed with bittersweet pride. Kraugel, Haster, and Zibal—three titans forced to cannibalize each other for a single PvP gold. Two would leave empty-handed simply because they'd been born in the same country.\n\n『 Incredible! Kraugel's just eliminated five players simultaneously! 』\n\n『 They've literally vanished—turned to particles of light! Was that enough force to break orbit? What technique *was* that? 』\n\n『 Some kind of battlefield removal skill. Perfect for Kraugel's solo playstyle. 』\n\nThe man called the strongest remained peerless. In Siege War, paired with Lauel, Kraugel didn't even draw the sword technique that had once cut the world itself. His overwhelming presence rendered tactics meaningless, reduced strategy to window dressing. He thrilled audiences worldwide.\n\nPeople still couldn't comprehend how Grid had defeated this monster.\n\nEven Lauel—Grid's closest confidant—felt a thread of tension.\n\n\"Kukuku! Complete sword control mastered in a single year? Your growth defies comparison to last year's performance. You truly are the sky...\" Lauel's voice dropped to theatrical reverence. \"Only you and Grid can make my blood sing.\"\n\n\"Is your face injured?\"\n\n\"Huh? No...\" Lauel hastily lowered the hand half-covering his face, embarrassment breaking through his dramatic persona. Kraugel's completely sincere response had punctured the mystique. Lauel coughed. \"The South Korean representatives for Siege are Yura and Coke. Given their tactical capabilities, they'll conquer the seven northern castles and forge an alliance with Japan in the west. We need to relocate our barracks centrally, even if it means abandoning some camps. Your role will be—\"\n\n\"Wait. South Korea and Japan are allying?\"\n\n\"Ah, excellent question. You're wondering why Japan—represented by the Sakura Guild Master rather than Katz or Damian—would partner with South Korea? The alliance is inevitable for several reasons. First...\"\n\n\"...\"\n\nKraugel gained new appreciation for Grid. How had his friend tolerated this verbose, lonely genius for years? Kraugel preferred solitary operation. His personality compatibility with Lauel was abysmal.\n\nYet personality aside, their professional synergy was perfect. The finest strategic mind paired with overwhelming martial supremacy.\n\nThe United States claimed gold in Siege War. China took silver. Canada, bronze. The South Korea-Japan alliance crumbled before Lauel's ruthless tactics—particularly after China accepted America's surprise alliance proposal, blindsiding both eastern nations.\n\nThe remaining day-three events proceeded without incident. Then day four dawned—the finale. Breaking the Labyrinth, Building Blocks, Breaking the Hero, PvP, and Demon King Subjugation. Only premium content remained.\n\nThe overall rankings fluctuated with each result.\n\n\"Demon King Subjugation will shake everything up.\"\n\nThe event distributed medals based on complex metrics: survival rate, damage dealt, damage absorbed, allied buffs applied, enemy debuffs inflicted, healing provided, and numerous other factors. Multiple participants could earn gold, silver, or bronze depending on their statistical contributions.\n\nThe medal inflation reflected the event's brutal difficulty.\n\n\"...So who were the ones running their mouths?\"\n\nIn his private waiting room—a space reserved for just one competitor—Grid scrolled through articles about himself. Search terms: 'coward,' 'washed up,' 'hemorrhoids,' 'ugly.'\n\nHe catalogued every foreign player who'd spread rumors about his absence. Especially that Argentinian bastard who'd claimed Grid was skipping the competition because of hemorrhoids.\n\nGrid's smile didn't reach his eyes as he committed each name to memory."
}