{
  "id": 943,
  "title": "Chapter 942",
  "content": "\"WAAAAAAHHHHH!\"\n\nThe roar of the crowd filling Beijing Olympic Stadium was a cacophony of doubt, amazement, stunned silence, and wild cheering. Yet the American section remained frozen in confusion.\n\n\"Wait—what? Why is Kraugel *here*? Didn't every outlet yesterday say he was competing in PvP?\"\n\n\"Yeah, I read at least five articles. All of them said PvP...\"\n\n\"So he's *not* doing PvP? He's in the Demon King Subjugation instead?\"\n\n\"Why *wouldn't* he be? If you could choose between fighting the Demon King with a team or going solo against Grid in PvP...\"\n\n\"...Fair point.\"\n\nUnderstanding rippled through the American crowd. The previous day's headlines had been clickbait—third-rate media outlets churning out sensationalist garbage about Kraugel, Zibal, and Haster all competing in PvP. Desperate for traffic, they'd fabricated stories while reputable sources reported the truth. Other outlets had quietly let the false narrative spread, riding the wave of engagement without taking responsibility.\n\n\"Those reporters are absolute garbage. I stayed up until 3 AM reading that trash.\"\n\n\"Same here. Couldn't sleep thinking we'd just lost two gold medals. Got blackout drunk over it. Still nursing the hangover. But hey—this is way better.\"\n\n\"*Much* better.\"\n\nIf the three American powerhouses had entered the same event, it would've been a disaster. This was a stroke of luck.\n\n\"KRAUGEL! YOU'VE GOT THIS! WE'RE WITH YOU!\"\n\nThe stadium trembled as the American section exploded into thunderous support.\n\nOn stage, Mei Xiao felt the weight of a hundred thousand eyes pressing down on her shoulders. *Gods above...*\n\nShe'd performed at plenty of major events across China. Large crowds were nothing new. But this—the National Competition—existed on an entirely different scale. The sheer *mass* of spectators made her heart hammer against her ribs. She wasn't alone in her reaction. The other participants stood rigid, faces pale. None of them had ever experienced support this intense, this overwhelming.\n\nYet the man who'd sparked this frenzy remained perfectly calm. Kraugel approached his capsule with no visible emotion—no tension, no excitement, nothing. His face was a blank mask.\n\n\"E-Excuse me! Kraugel!\"\n\nHe paused, glancing back.\n\n\"C-Could I... maybe get your signature? After this?\"\n\nMei Xiao had meant to wait until after the event. But watching him walk away felt like watching a door close forever. He seemed so distant, so unreachable, as though this might be the only chance she'd ever get to speak with him.\n\nThe other participants clearly felt the same. Requests for signatures and photos came from multiple directions. Kraugel might have fallen to Grid, but his legacy over the past years was undeniable. Among high rankers, he was the living legend—the gold standard they all aspired to reach.\n\n\"...\"\n\nWithout a word, Kraugel entered his capsule as if the interruption had been mildly irritating. The other participants reluctantly followed after the host's urgent prompting. Moments later, they awakened inside Satisfy's dedicated server for the National Competition.\n\n*Did the camera catch that?*\n\n*That damn Mei Xiao!*\n\nZhang Jian's jaw clenched. He'd gotten swept up in the moment and made a fool of himself on international television. Back home in China, he was a star—the 'Ice Prince,' famous for his cold, untouchable demeanor. One embarrassing moment like that could shatter his carefully cultivated image overnight.\n\n*I should've waited until we were off-stage. Dammit!*\n\nEither way, Mei Xiao was a problem. He'd never liked her. Hao's youngest sister, more popular than him, always so bright and cheerful, always the center of attention...\n\n*Just you wait, Mei Xiao. I'll crush the Hero faster than you ever could and wipe that smug smile off your face.*\n\nHis preparation was flawless. He'd analyzed Grid's performance from last year's PvP finals over a thousand times. He'd optimized his build like a custom-tailored suit. Three years of constant grinding, legendary boss drops, perfect gear. Sure, he couldn't match *this* year's Grid—but the Hero was frozen in time at last year's strength.\n\nOne real-world year equaled three years in-game. Three years was an eternity. While Hero Grid had stood still, Zhang Jian had grown stronger with every passing day. It was simple mathematics.\n\n『 Our first challenger—China's Zhang Jian has entered the arena! 』\n\nThe instant the announcement finished, his avatar materialized. His heavy armor hit the ground with a resounding *clang*. Across from him, Hero Grid leaned casually against a tree, studying him with open curiosity. The blank, emotionless stare from last year's Hero was gone.\n\nThat should've been his first warning.\n\nThe AI's aggressive personality was fundamentally different from last year's cautious, calculating approach. Personality profoundly affected combat behavior. An experienced player would've recognized the distinction immediately—would've adjusted strategies on the fly.\n\nZhang Jian lacked that experience. He couldn't see the difference between last year's cautious AI and this year's predator wearing Grid's face. \n\nIt cost him everything.\n\nThe moment combat began, Hero Grid spun like a top and unleashed two devastating slashes in rapid succession.\n\n\"...!?\"\n\nZhang Jian barely managed to raise his guard.\n\n[You have blocked a powerful blow.]\n[The durability of Crying Warrior's Sword has dropped by 78!]\n[Your right wrist has been fractured!]\n[You have suffered 2,900 damage.]\n[You can't move your right hand for 15 seconds.]\n\n*This is insane—*\n\nHe'd *known* Grid's attack power was ridiculous. He'd accounted for that. Even basic attacks would hurt. But his defense had been maxed out! He'd even sacrificed offensive accessories to stack more defensive stats!\n\nThe Hero closed the distance. A thrust aimed at his throat. Zhang Jian transferred his sword to his left hand and activated his trump card.\n\n\"Heavenly Body!\"\n\nThe status buff made him immune to physical debuffs and reduced incoming damage. He'd planned to save it for the final phase, but if he didn't use it *now*, there wouldn't *be* a final phase. He parried Grid's blade and countered with a horizontal slash.\n\nThe Hero's cloak billowed unnaturally. Four golden hands emerged from behind his back, each firing white-hot magical projectiles. Magic that bypassed magic resistance entirely. Zhang Jian's health plummeted as he drove his sword toward Grid's chest.\n\n\"Who dies first...!\"\n\nA war of attrition. Fine. Zhang Jian activated his strongest attack buff and followed through.\n\n[The target has received 5,380 damage.]\n[The target has received 5,290 damage...]\n\n*That's ALL?*\n\nAttack buff active. Legendary weapon. And he'd barely scratched the bastard? Zhang Jian's eyes widened in disbelief—and then the Hero *smiled*. A dark, mocking curl of the lips that said: *You're adorable.*\n\n\"You son of a—!\"\n\nAn AI was *taunting* him? Zhang Jian, heralded as the new hero by billions of Chinese citizens, felt rage boil through his veins.\n\nIt didn't last.\n\nFlames erupted around Grid's body—searing flames that burned anyone close enough to touch.\n\n\"AHHH!\"\n\nZhang Jian stumbled backward, screaming. The burn damage accumulated faster than his sword strikes ever could.\n\n\"W-What the—*hnngh*!\"\n\nHe retreated, throwing out defensive sword techniques to create distance. His hand fumbled for a potion—but the Hero surged forward, smashing through his guard like it was paper.\n\n\"S-STAY BACK!\"\n\nPanic took over. Zhang Jian unleashed every attack skill in his arsenal. None of it mattered. The strongest techniques of a top-ranked player couldn't even dent Grid's defense.\n\n\"Hahaha!\"\n\nThe Hero laughed—actually *laughed*—as if this were entertainment. He grabbed Zhang Jian's face with one hand.\n\n**Queen's Flames of Hell**.\n\nOne minute and thirteen seconds. That was how long China's rising star lasted against the Grid of one year ago. \n\nThe Hero's health bar remained virtually untouched.\n\nThe Chinese section of the stadium fell silent.\n\n---\n\n『 And Player Mei Xiao has been eliminated! 』\n\n『 A breathtaking performance until the very end—but it wasn't enough. Still, she should be proud. That was an incredible fight. 』\n\nMei Xiao had been different from the three before her. Armed with a razor-sharp chain whip and powerful magic, she'd charged the Hero like a raging bull. In five minutes, she'd shaved off nearly 50% of Grid's health—a remarkable feat considering Tiramet's Belt recovery and the First King title's defensive properties. Compared to the others who'd died in under three minutes without landing a meaningful hit, Mei Xiao was clearly on another level.\n\n\"WAAAHHH!\"\n\nThe 100,000 spectators and billions of viewers worldwide erupted in applause.\n\nBut Grid, watching from the waiting room, remained unimpressed.\n\n\"Sloppy.\"\n\nLast year's Grid, controlled by artificial intelligence, fought like a bulldozer. Pure overwhelming specs with no finesse. No technique worth studying. Grid clicked his tongue in disappointment. He'd hoped to learn something from the AI's control, improve his own combat instincts.\n\nBut that regret vanished the instant the final participant stepped onto the stage.\n\n\"Kraugel...\"\n\nGrid straightened in his seat, eyes locked on the screen.\n\n\"...?\"\n\nJust as he'd done with every other participant, the Hero launched himself at Kraugel. But Kraugel sidestepped the attack mid-air and used the Hero's own body as a springboard. In the same fluid motion, his White Tiger Sword rose.\n\nThe Hero's stomach was pierced clean through. Blood sprayed in an arc.\n\nThe confident smile vanished from the Hero's face. His lips pressed into a thin line. The God Hands fired Magic Missiles at Kraugel before arming themselves with Mjolnirs.\n\n\"Wave!\"\n\nThe Hero executed a sword dance upon landing, sending a wave of destructive energy surging toward Kraugel. His Insight stat combined with the Slaughterer's Eye Patch to predict Kraugel's escape path with surgical precision.\n\nBut Kraugel had Control Sword. Four additional swords materialized from his inventory, intercepting the God Hands mid-flight.\n\n\"*Perfect!*\"\n\nGrid shot to his feet.\n\nControl Sword was notoriously difficult. Unlike the God Hands, which moved semi-independently, each sword required active mental control. Last year's Kraugel had struggled with it—losing focus, making mistakes when he tried to juggle too many variables at once.\n\nThis year was different. Complete mastery of both body and blades. Five bodies controlled by a single mind, moving in flawless synchronization.\n\nKraugel activated White Light Steps, vanishing and reappearing behind the Hero. The Hero's Insight tracked the movement instantly, spinning around with his sword already in motion. The two blades collided with a shower of sparks. Black flames engulfed Kraugel as sharp stone thorns erupted beneath the Hero's feet.\n\nOr seemed to.\n\nThe Hero twisted Lantier's Cloak, using its properties to deflect most of the projectiles before they could connect.\n\n\"...\"\n\nEvery single person watching held their breath. Billions of eyes glued to screens, sweat beading on foreheads, hearts hammering.\n\nAnd then—\n\n\"*That's it.*\"\n\nGrid's face split into a wide grin. His eyes burned with intensity, refusing to miss a single moment of Kraugel's battle against the Hero replica.\n\nThis was the fight worth studying."
}