{
  "id": 945,
  "title": "Chapter 944",
  "content": "# Chapter: The Sword Above the Sky\n\n[Critical Strike!]\n[The target has received 44,099 damage.]\n[The target has suffered irreversible damage! All stats reduced by 20%. All movement speeds reduced by 50%.]\n[The target has resisted.]\n[Cutting effect: Failed.]\n[The target's weakness has been exposed! Critical hits guaranteed for 30 seconds. Critical damage multiplier increased to 1.5x.]\n[...!]\n[!!!!!!!!!!!!!!]\n[Your powerful blade has sundered the world itself!]\n\n\"...!?\"\n\nThe Hero's perfect stance shattered. He dropped to one knee as blood erupted from his chest—a crimson geyser that the red tail drank greedily. Space Sword was merciless: it ignored defense, dealt bonus damage based on current health, guaranteed critical strikes, and carried a high chance of triggering the cutting effect.\n\nFive entire health bars vanished in an instant.\n\nThe First King title immediately restored a portion of the lost health, but the sheer consumption value told the real story—this was catastrophic damage.\n\nAs the gods began stitching reality back together, Kraugel tasted the familiar bitterness of another potion and activated White Light Steps. The Hero's red-purple aura blazed at its peak. A prolonged battle would be suicide.\n\nWhat followed was violence incarnate.\n\nThe Hero wielded silver thread in concert with his twin crimson tails, spinning a web of death meant to ensnare and devour. But this prey refused to be caught. Kraugel flowed through the gaps between thread and tail, each evasion bleeding seamlessly into a counterattack.\n\nThe Hero's teeth ground together. Kraugel's discarded swords jutted from the ground like grave markers, creating obstacles that disrupted his footwork and made skill execution nearly impossible. He switched weapons—Grid's Greatsword replaced the Enlightenment Sword.\n\nCray's Power deactivated. Yetima's Power surged forth.\n\nThe Direct Descendant's Sword technique activated, empowered by the greatsword. It fell like divine judgment. The atmosphere itself vibrated under the weight of the descending blade, and the pressure alone forced Kraugel to halt mid-dash.\n\n\"Kugh...!\"\n\nJust a shoulder wound. Yet it cost Kraugel one-sixth of his health—a testament to the Hero's overwhelming power even accounting for the Sword Saint's innate sword damage reduction and the Impenetrable Skin passive he'd gained at level 300.\n\nThe exchange continued.\n\nDirect Descendant's Sword entered cooldown. The Hero switched back to the Enlightenment Sword and reopened Cray's Power. Kraugel consumed potions at measured intervals, gradually adapting to the black flames. His Sword Saint class allowed him to commune with the blade itself—he began predicting when the Enlightenment Sword would release its inferno.\n\n\"Belial's Power: Queen of Mocking and Violation.\"\n\nThe Hero's health dropped below 40%. His safety limiters released.\n\nSuddenly, there were two Heroes.\n\n『 What in—?! 』\n『 G-Grid can summon clones?! 』\n『 They might be illusions, but still... 』\n\nClone summoning was typically an assassin's domain. The blacksmith Grid already defied categorization by wielding swordsmanship and magic. Now he added assassination arts to his repertoire. The commentators stammered. Several spectators, completely distracted, accidentally spilled drinks on the people in front of them.\n\nKraugel remained serene. His high-level Super Sensitivity distinguished the original from the copy instantly. The clone concerned him, yes—but the sky looking down upon the earth is not easily unsettled.\n\n\"I understood it at the end of my admiration.\"\n\nSilver energy enveloped Kraugel's body. His stage three buff activated. Sharp as a blade, he cut through the Hero's clone and closed on the main body. The Hero was already mid-technique—Linked Kill Wave Pinnacle, a devastating thrust with enough force to obliterate everything in its path.\n\n\"I have become one after understanding.\"\n\nKraugel's body solidified as he used Wear the Sword, integrating himself with the weapon. The attack couldn't penetrate his transformed state. Instead, the White Tiger Sword's durability plummeted.\n\n\"Linked Kill Wave Pinnacle!\"\n\nGod's Command triggered. The Hero unleashed his ultimate attack twice in rapid succession, hammering at Kraugel's White Tiger Sword. Visible cracks spider-webbed across the blade.\n\nKraugel showed no concern. He was already committed to ending this.\n\n\"I am a sword, and there is nothing I cannot cut.\"\n\nThe final verse completed. Poem Praising the Sword reached full power—a buff that added five to eleven times his attack power to his next skill.\n\n\"Transcend Storm Sword.\"\n\nA maelstrom of silver and green energy shredded the Hero. He responded instinctively with Revolve, but Transcend Storm Sword was a multi-stage technique. Only the first stage was deflected—the rest tore through him. The God Hands flew to intervene, but Kraugel's prepared swords intercepted them.\n\n\"Kuaaahhh!\"\n\nThe Hero screamed. Before he could process the pain, poison fog rose from his armor—Valhalla of Infinite Affection's hidden function.\n\nMeaningless. Kraugel possessed both Immune to Ten Thousand Poisons and Impenetrable Skin. Poison was useless against him.\n\nFour bars. Three bars. Two bars. One bar.\n\nTranscend Storm Sword lasted only 1.5 seconds, but the Hero's health gauge collapsed. When it hit 10%, Tiramet's Power activated, restoring him to 30%.\n\n\"What is this...?\"\n\"Is this even real...?\"\n\nThe audience assumed the Hero would triumph. As his health dropped, more clones manifested. Kraugel looked less like a challenger on the verge of victory and more like someone who'd opened Pandora's Box.\n\nWhen Transcend Storm Sword ended, the Hero smiled.\n\nFour clones surrounded Kraugel and activated Valhalla's Moving Fortress skill. They unleashed Impregnable simultaneously—a wide-area skill that released half of all damage suffered in the last five minutes within a 50-meter radius.\n\nFive overlapping detonations created a cataclysm.\n\nPine trees evaporated. Cliffs disintegrated. Kraugel vanished completely.\n\nThe hundreds of cameras shook violently, making 100,000 live spectators and billions of viewers feel nauseous.\n\n\"...Crazy.\"\n\nGrid was the first to recover his composure. He sat impressed in the waiting room, marveling at the Hero's creativity—linking Queen's Distortion with Impregnable. This was the thrill of discovery: learning to use skills and items in ways you'd never imagined.\n\nThen—\n\n\"Kraugel?\"\n\nHe scanned frantically for his rival. There—rising high into the sky. Wings of light extended from Kraugel's back, flickering between white and black.\n\n\"This is...\"\n\nKraugel's expression twisted. For someone who actively avoided showing emotion, it was remarkable.\n\nHe was angry. Angry at himself.\n\n\"Ruson's Power!\"\n\nThe Hero on the ground sensed mortal danger. He entered the hunger state after tasting Kraugel's blood, his movement speed exploding. He cast Fly and rocketed upward, weaving left and right in impossible trajectories faster than the eye could follow. It was brilliant. Intimidating.\n\n—Linked Kill.\n—Transcended Link.\n—Pinnacle Kill.\n—Wave.\n—Pinnacle.\n\nThe Hero's voice, recorded via Alarm spell, echoed from every direction. Kraugel should have been disoriented by the illusion of being surrounded by dozens of Heroes—confused as the real one constantly teleported between positions.\n\nBut Kraugel was not confused. The Hero couldn't deceive his senses.\n\n\"Falling Sword.\"\n\nThirty-seven swords materialized from Kraugel's inventory. They spread like a fan and rained down upon the Hero. The Hero's judgment was instantaneous—he used Freely Move to evade all thirty-seven blades and closed the distance. His footwork never stopped.\n\n\"Grab the Adam's Apple.\"\n\n\"...Kugh!\"\n\nKraugel moved faster than any sword dance. The cracked White Tiger Sword pierced the Hero's heart while Kraugel's hand crushed his throat. The Hero entered his immortal state as the winged Kraugel retreated. Six seconds later, Kraugel recalled the four swords he'd used to pin down the God Hands and aimed them at the Hero.\n\nThe bombardment was overwhelming.\n\nThe Hero died.\n\nKraugel won.\n\nThe Grid of one year ago had been defeated by today's Kraugel.\n\n\"**WAAAAHHHHHH!!**\"\n\nThunderous applause erupted. All 100,000 spectators in Beijing Olympic Stadium rose as one to deliver a standing ovation. Not a single person remained seated—an unprecedented, spectacular sight.\n\n\"You've suffered.\" \n\nGrid stood in the waiting room and clapped. His awe was genuine. His praise was sincere. There wasn't a trace of pretense. \n\n\"I knew you would win.\"\n\n*Thump! Thump! Thump!* His heart threatened to burst from his chest. He wanted to sprint onto that stage right now and challenge Kraugel to a duel.\n\n\"...Even so. I have to endure it.\"\n\nGrid stared at his trembling, sweating hands and desperately hoped for the Demon King Subjugation to begin soon.\n\n---\n\nOn this day, South Korea's Eat Spicy Jokbal claimed gold in the labyrinth escape event. Australia's Carrie and Canada's Richter won gold in block building and tree cutting respectively.\n\nFrom the American and Chinese perspectives, the medal standings were chaotic. Only two events remained in the 4th National Competition: PvP and Demon King Subjugation. First place was still undecided. With a minimum of five gold medals available in the Demon King Subjugation alone, everything remained uncertain.\n\nThe PvP gold medal carried immense weight.\n\n\"The PvP medal is obviously mine.\"\n\n\"...\"\n\nZibal, armed with his hidden magic machine, exuded his usual confidence. But Haster stood mute. The zipper across his mouth had been sealed all day. He'd finally understood the truth about his long-ago confrontation with Kraugel.\n\n*I was never worth his attention in the first place.*\n\nHe couldn't deny it. The only opponent who mattered to Kraugel was Grid. Haster hadn't reached their level yet. The world he'd been seeing was far too small.\n\nEverything was ruined.\n\nHaster withdrew from PvP. It would be too humiliating to expose himself to the world in his current state.\n\nMeanwhile, Zibal's arrogance soared. \"Did he quit because he was scared? Well, it couldn't be helped once he knew my real strength.\"\n\nHe almost regretted revealing his magic machine during the selection test.\n\n\"This year's PvP is going to be boring,\" Zibal muttered."
}