{
  "id": 946,
  "title": "Chapter 945",
  "content": "Global forums erupted with discussion.\n\n*His skill usage gave the Hero zero breathing room.*\n\n*lol did you see the distance between the Hero and those God Hands gradually widening? That's Control Sword at work.*\n\n*Wait, is Kraugel actually controlling all those swords mentally?*\n\n*Are you insane? Of course he is.*\n\n*Did you catch how he moved left to block the Hero's line of sight? Incredible positioning.*\n\n*Every time he draws from the sheath, his movement becomes impossibly fluid... it's unreal.*\n\nFresh from Kraugel's victory in the Breaking the Hero event, communities worldwide dissected every frame of his combat footage. Players analyzed his techniques, debated his intentions, and tried to glean insights from his unprecedented performance.\n\nInevitably, a new argument surfaced.\n\n*Grid's too scared of Kraugel to compete. That's why he skipped the National Competition.*\n\nSome accused Grid of cowardice—of hiding behind his royal duties to protect his reputation. The accusation gained traction. Grid's level gains had slowed considerably this past year, suggesting his growth had plateaued. Meanwhile, Kraugel had just demolished the Hero replica. The logic seemed sound: Kraugel had surpassed him.\n\n*Can you blame Grid? The man's running a kingdom AND managing his smithing. He doesn't have time to grind levels like the rest of us.*\n\n\"You sure you want to be reading that right now?\"\n\nShin Youngwoo glanced up from his phone. Yoon Nahee, Team Leader from S.A Group, stood in the doorway of the spacious waiting room, holding a lunch bag and offering a knowing smile.\n\n\"Hungry?\"\n\n\"Starving.\"\n\nYoon Nahee looked different outside the corporate environment. Gone was the severe business attire and professional mask. Today she wore casual jeans and a white t-shirt, her face relaxed as she settled in to enjoy her trip to China. She was objectively beautiful—though Youngwoo had become somewhat desensitized after spending time around Yura, Jishuka, Sehee, and Yerim. His standards, he realized vaguely, might have become impossibly high.\n\n\"Doesn't it frustrate you?\" she asked, unpacking the food. \"The way people react to you?\"\n\n\"What do you mean?\"\n\n\"You show them something incredible every year, and every year they find new reasons to tear you down. They twist the truth to fit whatever narrative they want.\"\n\nThe internet bred strange behavior. Anonymity brought out the worst in people—psychopathic tendencies, stress relief through cruelty, baseless accusations. But Youngwoo had long since stopped letting it bother him.\n\n\"It's just how things are. People call Chairman Lim a 'stone' online.\"\n\n\"A *stone*? Chairman Lim?\" Yoon Nahee's eyes widened. \"The man who created virtual reality?\"\n\nLim Cheolho—the architect of an entire world, universally recognized as not just the greatest living scientist, but perhaps the greatest *ever*. Even he knew he wasn't perfect, that he was merely exceptional in his specific field. But calling him stupid?\n\n\"Well, they don't exactly call him a stone *head*—\"\n\n\"Just a *stone*?\" Yoon Nahee burst out laughing, clutching her stomach. \"Oh my god!\"\n\nThe atmosphere lightened as they ate. Yoon Nahee had monitored Grid for years now, understood Youngwoo better than most. Their professional relationship had evolved into genuine familiarity this year while preparing for the Demon King project.\n\n\"Have you been watching the competition these past four days?\" she asked between bites. \"So many rankers have pushed past level 330 this year. Their skills have improved dramatically. You think you can handle four hundred of them alone?\"\n\n\"Hmm...\"\n\nYoungwoo paused, savoring the Beijing duck's rich juices. The player base had grown exponentially stronger—that much was undeniable. Normal classes especially had closed the gap significantly. Unlike hidden classes that started with powerful skills, normal classes accumulated abilities and traits as they leveled, steadily narrowing the advantage.\n\n*The gap is closing.* Chairman Lim's words from years ago were becoming reality.\n\n\"At first, I thought it'd be easy,\" Youngwoo admitted, moving on to the fried rice. \"Now? I'm definitely feeling the pressure.\" He'd watched this year's competition closely, studied their techniques. Their skill was undeniable.\n\n\"But?\"\n\n\"But I still don't think I'll lose.\"\n\nThe gap was closing? So what? Not all hidden classes were created equal, and more importantly—not everyone possessed his persistence. People gave up every day. Gave up smoking, drinking, dieting. Gave up when things got hard.\n\nYoungwoo's face flushed red as he spoke with absolute conviction, then took a long drink of soup. The wrong soup.\n\n\"G-gah—w-water! *Hiccup!*\"\n\nYoungwoo had just chugged spicy Malatang instead of mild jjampong. Sweat beaded on his forehead as his voice cracked.\n\n*Just like the Chairman,* Yoon Nahee thought, suppressing a grin.\n\nBrilliant in their fields, absolute disasters in everyday life. Somehow, it was endearing. She handed him water, smiling.\n\n\"Four hundred versus one. I can't wait to see it.\"\n\nFour hundred rankers from one hundred twenty-five countries against Grid alone. The fact that the outcome remained genuinely uncertain was both thrilling and terrifying.\n\n***\n\nGrid's absence drove this year's PvP participation to record heights.\n\n*At least I won't get one-shot. If I can just show my skills, I'll prove I'm world-class.*\n\nFour hundred sixty-seven players entered with that exact thought. Only sixty-four earned stage appearances. The four hundred three eliminated in preliminaries left shaken to their cores.\n\nAmerican elites excluding Kraugel. Overgeared members like Pon. Argentina's Seuron. Turkey's Bubat. Japan's Damian. India's Goshar. New Zealand's Everton. The eliminated had watched these names from afar for years, admired them, studied them. Facing them directly revealed the truth—some walls could never be climbed.\n\n\"This doesn't make sense. I thought everyone below Grid and Kraugel was roughly equal?\"\n\n\"There's a class system wherever you go, apparently.\"\n\n\"Bullshit! I'm not weak! This is ridiculous!\"\n\n\"It's... sobering. Watching and experiencing are completely different things.\"\n\nIndia's Goshar had failed to qualify for PvP every single year. His poor track record contradicted the high praise from other rankers and analysts, making many dismiss him as overrated. Until now.\n\n\"Yohohoho! Behold—a *giant!*\"\n\nThe magic Goshar summoned while cackling like a madman operated on an entirely different level. He'd slaughtered his way through the preliminaries.\n\nIn the round of 64, Goshar's opponent found himself trapped in a sand castle while a massive golem closed in for the kill. The top-ranked earth magician had earned his reputation honestly. The eliminated players felt cheated—Goshar had been *sandbagging* for three years.\n\nThey were wrong, of course. Goshar had simply faced stronger opponents early in previous years. Bad luck, nothing more. This year, fortune smiled. His preliminary bracket was soft, his round of 64 opponent manageable, and his round of 32 matchup was Bubat.\n\n\"Yohoho.\"\n\nAs the round of 64 concluded, Goshar took the stage grinning, facing down Bubat. Last year, the Chinese rookie Zhang Zheng had *devastated* Bubat in PvP. Goshar feared no one who'd already tasted defeat.\n\n\"Why do you keep entering PvP?\" Goshar taunted. \"If you stuck to team events, you might actually win a medal. Doesn't Turkey find your stubbornness frustrating? Yohohoho!\"\n\nBubat possessed a hidden class—an Initiator with exceptional tanking and crowd control. Strong in group content, weak in duels due to lacking offensive power. His fixation on PvP seemed almost self-destructive.\n\nBut this year's Bubat was different.\n\n\"Yohoho—*hik!*\"\n\nAn Initiator's greatest virtue was approach capability—the ability to close distance and open engagements. Tanking was baseline. Abnormal status resistance was mandatory. Goshar carpeted the arena floor with earth magic designed to block enemy advancement.\n\nBubat walked through it like it wasn't there.\n\nMore importantly, this year Bubat wore Artina's Natural Disposition Gloves—legendary-grade equipment that converted defense into attack power. His greatest weakness, nullified.\n\n\"*Hiyoouk—!* Gh-*hik!*\"\n\nThe match ended the moment Bubat reached the magician. Goshar's defense was pitiful—standard for his class. Bubat's merciless hands grabbed him, slammed him into the ground, and proceeded to beat him senseless. Minutes later, Goshar died. Bubat advanced to the round of 16, sneering.\n\n\"Too much talk, not enough action.\"\n\nIn that regard, Grid was genuinely terrifying. Every boast backed by his sword, every word punctuated by a corpse. Bubat swallowed hard, remembering the sensation of Grid's blade.\n\n*This is my last real chance. With Grid gone, I can aim for a medal.*\n\nWinning PvP was every high ranker's dream. Bubat's motivation soared. This year, even Kraugel had skipped PvP.\n\nHeaven-sent opportunity.\n\n***\n\nThe round of 16 concluded.\n\nGrid's jaw tightened as he monitored the broadcast, watching Yura emerge victorious. Something was wrong. She seemed... hollow. Drained. Like walking through a rainstorm only she could feel.\n\n*What happened to her?*\n\nGrid rarely admitted it, but Yura occupied significant space in his thoughts. She'd helped him countless times, both in-game and out. He couldn't help but worry. Today, Yura looked *broken*.\n\n*What's going on?*\n\nThe round of eight bracket appeared: Yura, Pon, Regas, Damian, Chris, Zibal, Seuron, Bubat. All exceptional talents. But Damian was Yura's worst possible matchup. Hell Summoning—her signature field magic—amplified Demon Slayer abilities while debuffing everyone else. Everyone except paladins blessed by the Goddess.\n\nDamian's divine protection made him immune.\n\nAnd somehow, impossibly, Yura drew him in the quarterfinals. Fighting injured against an opponent she couldn't beat.\n\nGrid's leg bounced anxiously. He wanted to run to her, to be there for the woman swinging her sword like she was fleeing from demons.\n\n\"Wait...\"\n\nHe froze. On screen, Yura deflected Damian's blade and fired her pistol in a fluid motion, snapping the paladin's head back.\n\n\"Gh—*agh!*\"\n\nDamian reeled, genuinely rattled. Months ago, Yura had defeated Agnus and cleared her fourth class advancement quest—Old Enemy. The reward: Swordsmanship of Light, her class mastery skill. This was the Pope's first time witnessing her evolved technique. The bullets hit harder. The blade moved faster.\n\n\"Divine Protection. Incarnation of Light. Light's Blessing. Goddess' Protection. Goddess' Blessing.\"\n\nDamian healed himself and activated every buff simultaneously—showing the \"true dignity of a Pope\" for the first time since facing Grid.\n\n\"Yura-san,\" he said quietly. \"I'm sorry.\"\n\n\"I'm truly sorry.\"\n\nRadiant divine power met jade-colored sword light. Bullets danced through consecrated space. She was a Legend, same as Grid and Kraugel. She'd earned the right to grow accustomed to victory.\n\n\"Nightmare Rumination.\"\n\nThe Path of Penance had been long—excruciatingly long. Light had come to her far too late.\n\nBut there was no turning back now."
}