{
  "id": 947,
  "title": "Chapter 946",
  "content": "The crowd's roar never ceased. Each jade-light slash that stripped away Damian's buffs, each bullet that found its mark—the spectators devoured it all. Yura's uncanny ability to nullify the pope's blessings left many stunned, though others marveled at how Damian threaded through her bullet-storm with preternatural precision.\n\n『 Last year's sword-drawing event proved Yura fights on Kraugel's level. Her one-on-one combat is exceptional. Why hasn't she competed in PvP before? 』\n\n『 South Korea lacks depth. A year or two ago, it was critical. They need every medal they can get, so Yura had to avoid competing in the same events as Grid. 』\n\n『 Grid's absence is Yura's opportunity. 』\n\n『 We need to reassess both Yura and South Korea entirely. Grid isn't here, yet they're sixth in the medal standings. Few silvers and bronzes, true—but six golds. 』\n\n『 Remarkable. No one can dismiss South Korea as weak anymore. If Yura takes gold in PvP and their team performs well in the demon king subjugation, third place is within reach. 』\n\n\"Kuh—!\"\n\nDamian's final buff dissolved under the jade blade. The sword bit into his shoulder. Blood spattered as he raised his shield to block the next bullet, then swung from behind its cover. The exchange was relentless—a storm of steel and light.\n\nTheir blades locked. Damian glimpsed Yura's eyes and froze for an instant. Something dark moved behind them. Even as his shield intercepted the pistol aimed at his stomach, concern bled into his voice.\n\n\"You look troubled.\"\n\nDamian could have entered events with weaker competition—an easy path to gold. But he chose PvP because he loved it. A field where he could fight without consequence, test himself against the best. There was no reason not to savor it.\n\nSo why did Yura seem so burdened? Not exhilaration—anxiety. Not joy—pain. The desperation in her eyes made her look like someone standing at a cliff's edge.\n\n\"If something's wrong, tell me.\"\n\n\"...?\"\n\n\"Grid's friend is mine. If you need help, I'll give it.\"\n\nHe had unlocked Holy Sword Deployment before the competition—a trump card. But he hesitated to use it now, not against Yura in this state. Not out of arrogance; she was strong enough that even his ultimate technique couldn't guarantee victory. He simply... worried.\n\nFor the first time, Yura smiled.\n\nThe expression was heartbreaking in its beauty. Everything around her seemed to fade to monochrome except for the woman herself, radiant and isolated in the center of a greyscale world.\n\n\"Thank you. But this is mine to carry.\"\n\nHer Swordsmanship of Light blazed brighter. Higher attack power than standard mastery. Perfect accuracy. Devastating critical rates. And when consuming a great demon's essence, it stripped buffs or inflicted debuffs at will. The jade aura coating her blade—her Demon Slayer inheritance made manifest—crashed against Damian's sword and left weakness seeping into his limbs.\n\n\"Come at me with everything.\"\n\nYura had to win. She needed results. But what worth was a hollow victory? Could she take pride in something false? She wanted Damian to stop holding back, and somehow, her conviction reached him.\n\n\"Understood.\"\n\nWhite light ignited around his shield-arm, fierce as wildfire.\n\n\"Holy Sword Deployment.\"\n\nHoly power erupted from Damian's body as he surged toward Yura with everything he had.\n\n***\n\n\"Hah...\"\n\nGrid couldn't look away. Damian's growth over recent months was staggering, and Yura fought at a level that bordered on terrifying. Their clash rivaled Kraugel versus the Hero in brilliance and ferocity—neither would seem out of place among the favorites for the PvP championship. Even Grid's pulse quickened watching them. He ached to cross blades with opponents like this. A shame Yura wasn't participating in the demon king subjugation.\n\n\"...Mm.\"\n\nFifteen minutes. The battle stretched across a quarter-hour before it ended. Holy Sword Deployment guttered out, leaving Damian weak and vulnerable. Yura's focus, meanwhile, had only sharpened. She used Hell Leap with surgical precision, bypassing his shield to strike at his exposed back.\n\nYura stood alone on the stage. Victor of a grueling duel—yet her expression was bitter. Lonely.\n\nOf course, Grid doubted anyone else noticed. To most viewers, she was smiling, clearly pleased with her performance. But Grid had spent enough time with her to recognize the shadows in that smile.\n\n'What's wrong?'\n\nShould he call? No—that would be weird. They were colleagues, sure, but reaching out just because he was concerned...\n\n'We're not that close. She might be uncomfortable that I can read her so easily.'\n\nShe might laugh at him, the way Ahyoung had. Still, the worry gnawed at him...\n\nHe stared at his phone, thumb hovering over her name.\n\n\"Youngwoo-ssi, it's time!\" Team Leader Yoon Nahee burst through the waiting room door. \"Let's go!\"\n\nHis appearance as the demon king. A showcase, really—part of the spectacle. The contract he'd signed stipulated his participation in this reveal.\n\n\"Right. Coming.\"\n\nHe'd delayed as long as he could, using the Yura-Damian match as an excuse. Grid rose and followed Nahee out.\n\n***\n\nS.A. Group was gambling everything on the demon king subjugation.\n\nA world shaped by players. The event embodied Chairman Lim Cheolho's vision perfectly. More than ideology, though, it had staggering commercial value—hype built for months. The investments poured into this event dwarfed anything they'd done before.\n\n\"Wait—what?\"\n\nThe PvP round of eight had just concluded. A hundred thousand spectators buzzed with excitement. Billions watched worldwide. Then confusion rippled through the stadium as darkness swallowed the PvP stage and something new materialized—a sprawling plain dominated by a massive castle.\n\n\"What just happened?\"\n\n\"Stage change for the semi-finals?\"\n\nCuriosity eclipsed confusion. No one moved for bathroom breaks. No one changed the channel. Only the crucial matches remained, and attention was at its peak. Perfect timing for S.A. Group to unveil the demon king.\n\n\"...?\"\n\nMusic began.\n\nGrand. Arrogant. Provocative. The melody seized people by the throat and refused to let go. Some recognized the instrument immediately.\n\n\"A pipe organ...\"\n\nThe opening video flashed through their minds—a young man draped across an enormous organ, thousands of pipes stretching behind him, beckoning with a single finger.\n\n\"No way...\"\n\nThe organ. The mysterious figure. One event left. The demon king. Puzzle pieces clicked together.\n\n\"The demon king...?\"\n\n\"THE DEMON KING!!\"\n\nRecognition exploded across the stadium. Thunder cracked in the blackened sky.\n\n\"Kukukuk.\"\n\nA figure stepped onto the plain. Grey mask. Three horns—one large, two small. Red eyes burned beneath the mask. Two wings spread from his shoulders. His hands were grotesquely oversized, tipped with blade-like talons.\n\nThe demon king.\n\n***\n\nRegas was an Overgeared ace, one of the favorites for the PvP title. He'd carved through renowned powerhouses before falling in the quarterfinals—defeated by Zibal's brilliant comeback. Two years as Grid's punching bag, and Zibal had finally shaken the stigma.\n\nThe joy lasted all of five minutes.\n\n\"Tsk. They'll do anything for ratings these days.\"\n\nZibal's mood had soured instantly. The crowd's attention had abandoned him the moment the demon king appeared.\n\n\"What's so special about some scripted boss fight?\"\n\nZibal's true talent was raids—analyzing boss patterns, managing parties with ruthless efficiency. He'd been the best until Grid's items overshadowed him. Now, with a hidden class unlocked, his confidence extended beyond raids. Watching the organizers spotlight a 'fake' boss monster rankled.\n\nThe other players shared his irritation. Four hundred participants for the demon king subjugation event. Many who'd just performed in the Demon King's Appearance were less than thrilled. Those freshly eliminated from PvP were especially raw.\n\n\"Yoho! Want to play?\"\n\nGoshar, ranked first among earth mages, had crashed out in the round of thirty-two and stewed in the waiting room ever since. Now his hands wove spell-forms. Participants could do whatever they wanted during the Appearance—nothing wrong with taking a shot at the demon king standing alone on that plain.\n\nGoshar began his incantation, targeting the figure labeled 'Demon King.'\n\nThen:\n\n> [From now on, audience voting will begin!]\n> \n> [Make a strong impression and earn votes during this event to receive a reward equivalent to a gold medal. Note: this will not affect the medal tally.]\n\n\"...?\"\n\nNone of the players had known about the vote beforehand. Annoyance transformed into motivation the instant the notification appeared.\n\nGoshar laughed. \"Yohohohut! The crowd's votes are mine!\"\n\nStrike first, leave the strongest impression! Goshar's magic blazed to life before anyone else could react. The group voting system was a gift from heaven.\n\n\"Giant's Haaaand! Yohohoho!\"\n\nThe ground liquefied into sand. The sand coalesced into an enormous hand reaching for the demon king.\n\nSimultaneously:\n\n> [The Demon King has perceived your spell. Your magic has been nullified.]\n> \n> [The Demon King has duplicated your spell!]\n\n\"...W-What?\"\n\nGoshar's eyes bulged. His body locked rigid. His giant hand dissolved—and another formed in its place, crashing down toward Goshar's head.\n\n\"...\"\n\nGoshar was pulverized like an insect underfoot. Spectators and players alike gaped in incomprehension. Silence blanketed the stadium.\n\n\"Why don't you all come at once?\"\n\nThe demon king's voice dripped contempt. He waved dismissively, mimicking the gesture from the opening video.\n\n\"...This bastard doesn't know who he's messing with.\"\n\n\"Poor fool.\"\n\nAggressive players surged forward. The mages reined in their tempers after witnessing Goshar's fate, but the warriors had no such restraint. They drew weapons and charged. He was an opponent they'd face anyway—better to probe his abilities now.\n\nRain began to fall from the swollen clouds. The demon king tapped his fingers lightly.\n\nA hurricane roared to life. Dozens of lightning bolts hammered down from above. Dozens of players were reduced to charred meat.\n\n\"Ghk...!\"\n\n\"F-Field magic...\"\n\nHe nullified spells. He denied approach. The demon king's power exceeded all expectations. Fear crept through the tense players. The commentators fell silent. Spectators and viewers remained glued to their screens, transfixed.\n\nIn that moment, the entire world watched the demon king. And the demon king—he was used to being watched. He'd lived under scrutiny dozens of times before.\n\nHis voice cut through the rain, calm and absolute: \"If you won't come to me, I'll come to you.\"\n\nHe drew a weapon—impossible to tell if it was spear or sword—and dove toward the players through the storm.\n\n> [The Demon King's Appearance event has ended.]\n\nTwo minutes. The notification appeared, and the demon king's form dissolved into black fog. The surviving players stood mute. Only a handful of rankers—Zibal, Seuron, Damian, and the Overgeared members—had fire in their eyes.\n\nBut one person was different.\n\n'Grid...'\n\nThe man who'd recognized the demon king's identity trembled. Electrifying. He understood now: the Demon King Grid was several times more powerful than the Hero Grid.\n\nA new notification materialized.\n\n> [Audience voting has concluded.]\n> \n> [The winner with the most votes: The Demon King.]"
}