{
  "id": 948,
  "title": "Chapter 947",
  "content": "# Chapter: The Demon King's Victory\n\n[The audience voting has ended.]\n\n[The winner of the most votes is the Demon King.]\n\n\"What? What the hell is this?\"\n\nThe notification sparked immediate outrage. Players across the arena erupted in protest.\n\n\"They let us vote for a *monster*? Are you kidding me? I don't have time for these games!\"\n\n\"Typical S.A. bullshit. They didn't want to pay out the rewards, so they rigged the vote. We got played.\"\n\nThese were elite athletes representing their nations. The weight of the international stage kept them from outright cursing, but the atmosphere was toxic enough that it wouldn't take much to push them over the edge. Everyone knew the Demon King wasn't a player—he should have been excluded from the voting. Hell, if they'd known he was eligible, they never would have given him such a prominent role in the event.\n\nBut the S.A. Group's response was characteristically blunt: \"We never stated the voting was limited to players.\"\n\nThe company's reputation for moving according to its own arcane rules was well-established. There was no arguing with that logic. Besides, for most of the competitors, this outcome was actually preferable. Better that no one benefited than watching one standout monopolize all the rewards.\n\nMany eyes turned toward Kraugel. He remained silent, his expression one of supreme indifference—as if he'd never cared about the rewards in the first place.\n\n***\n\n\"Thank you for your hard work.\"\n\nYoon Nahee greeted Grid as he returned to the waiting room. His performance had exceeded all expectations.\n\nGrid himself harbored suspicions about the activation rate of his Duke of Wisdom abilities. Magic Contemplation had two key functions: breaking down enemy magic with a 50% success rate, and replicating it with a mere 4% chance. Both had triggered flawlessly during his performance.\n\n*Pure luck.*\n\nThe skill's perfect activation had to be a result of his increased good luck stat. Grid offered a silent prayer that fortune would continue to smile on him, then voiced a concern that had been nagging at him. \"Won't people suspect the Demon King was actually a player?\"\n\n\"Why would they?\"\n\n\"Because it's true?\"\n\n\"Who would imagine a player serving as a raid boss for four hundred people? It defies logic.\"\n\nShe had a point. Grid's appearance had been completely transformed—different skin, different items, different pets. Even his skill names and descriptions had changed. The lightning storm he'd summoned during the Demon King's Appearance event bore only superficial resemblance to his usual techniques. Lava had erupted from the ground. The sound of thunder had carried a subtly different timbre. Connecting the Demon King to a player would be difficult enough; linking that player specifically to Grid would be virtually impossible.\n\n\"Then I can relax.\"\n\nGrid settled into his seat with a lighter heart. The PvP semi-finals were about to begin.\n\n***\n\nOne hundred twenty-five nations had participated in the 4th National Competition—the largest gathering yet. Fifty-three events had showcased a dizzying array of talents, providing spectacular entertainment for viewers worldwide. And now, the results were in.\n\n**[Medal Standings]**\n\n1st - United States (9 gold, 17 silver, 11 bronze)\n\n2nd - China (7 gold, 5 silver, 7 bronze)\n\n3rd - Canada (7 gold, 4 silver, 4 bronze)\n\n4th - Russia (6 gold, 2 silver, 1 bronze)\n\n5th - United Kingdom (6 gold, 1 silver, 5 bronze)\n\n6th - South Korea (6 gold, 1 silver, 1 bronze)\n\n7th - Japan (3 gold, 3 silver, 4 bronze)\n\n8th - India (3 gold, 2 silver, 3 bronze)\n\n9th - Brazil (1 gold, 1 silver, 0 bronze)\n\n10th - Spain (1 gold, 0 silver, 1 bronze)\n\n...\n\nThe United States had proven its dominance once again. With a talent pool unmatched by any other nation, America had swept medals across multiple events. The truly shocking fact? Not all of their powerhouses had even participated.\n\nThe United States claimed overwhelming first place despite the absence of players like Hurent, Box, and Asuka. They were a superpower capable of holding *selection trials* for the National Competition—something South Korea couldn't even dream of attempting.\n\n『At moments like this, the greatness of Overgeared King Grid becomes crystal clear.』\n\n『Indeed. Grid has a history of overcoming America's might and carrying South Korea to first place single-handedly.』\n\n『Players around the world must be watching this American dominance and missing Grid terribly.』\n\n『Ha ha, still, the U.S. can't rest easy just yet. We still have PvP and the Demon King Subjugation remaining, don't we?』\n\n『Precisely! The Demon King Subjugation alone offers up to fifteen medals, including five golds. The rankings could shift dramatically at any moment... Ah, while I was speaking, the players have entered the arena!』\n\n『After the shocking Demon King's Appearance event, we move to the PvP semi-finals! Here we go!』\n\n***\n\n\"Strong.\"\n\nThat single word captured Regas's assessment after his elimination in the quarter-finals. He made no excuses. He recognized that Zibal was the superior fighter and accepted his defeat.\n\n*For Regas to admit defeat without hesitation, his opponent must be on Faker's level at minimum,* Chris thought.\n\nZibal. A monster who'd held the 2nd rank for over three years after Satisfy's launch. Skilled enough to lead the coalition of seven guilds. In PvE content, he'd been considered Kraugel's superior back when Kraugel dominated as the sky above the sky. His PvP abilities had been labeled as relatively weak—but that assessment had proven to be a grave misunderstanding.\n\nIn the 2nd National Competition, Zibal had displayed exceptional PvP skills. However, his encounters with Grid and Kraugel had robbed him of opportunities to shine, eventually earning him the unfortunate stigma of being a \"punching bag.\"\n\n\"You've made a brilliant comeback.\" Chris smiled as he stood on the stage. Despite their rocky relationship, they shared a bond forged from existing in the same era. Chris felt genuine emotion at Zibal's successful return. A quiet excitement filled his chest. \"You must've trained yourself to death these past two years.\"\n\n\"That's right. I pushed myself until I almost broke.\"\n\n\"...?\"\n\nChris froze. He'd never expected Zibal to respond with such honest vulnerability. The man's pride had always been legendary—Chris had anticipated denial, deflection, anything but this raw admission.\n\nZibal shrugged. \"I'm not a natural genius like Grid or Kraugel. I had to work as hard as humanly possible. For two years, I abandoned my ego and started from scratch. I did things that would make you sick, but I endured it all.\"\n\n\"You've changed.\"\n\n\"I have. And I'll continue changing in the future.\" Zibal's expression hardened. \"But enough talk. I came here to challenge the Demon King.\"\n\nHe summoned his mount—but not the two-headed hippo from rounds 64 and 32, nor the pegasus from the quarter-finals. This was something else entirely. Not flesh and blood, but an artifact.\n\n\"A robot...?\"\n\nA crack split the sky. Descending through it came a white humanoid machine wreathed in seething energy. **Raiders**. Golden horns on either side of its head blazed with light. An ancient relic. A magic machine. One hundred thousand spectators, the commentators, billions of viewers in front of screens worldwide—none could close their mouths. The shock rivaled the moment the Demon King had appeared.\n\n\"This year, at the very least, I will be the strongest.\"\n\nHis tone suggested it was only natural to claim that title in Grid's absence.\n\n\"ZIBAL! ZIBAL! ZIBAL!\"\n\nThe crowd of one hundred thousand began chanting his name. The emergence of this five-meter-tall humanoid weapon was gorgeous and romantic enough to fill the void left by the absent champion.\n\n[Synchronizing with Raiders.]\n\n...\n\n...\n\n[Synchronization success!]\n\n[Raiders is now operational!]\n\n[Your maximum mana is insufficient!]\n\n[Maximum activation time for Raiders: 21 seconds.]\n\n\"I'm...\" For the past two years, his blood, sweat, and patience had been for this very moment. \"I'm back!\"\n\nHe boarded Raiders. The entire world's attention focused on him like a spotlight. A massive spear descended toward Chris's head.\n\n[You have blocked a devastating blow.]\n\n[Yetima's Greatsword durability decreased by 108!]\n\n[Both wrists fractured!]\n\n[Lower body strength depleted!]\n\n[You have suffered 7,930 damage.]\n\n[Movement disabled for 15 seconds.]\n\n\"Ghhk...!\" \n\nChris's knees buckled as he raised his greatsword overhead to intercept the blow. Even activating Tyrant's Strength, he could barely withstand the weight of that giant spear.\n\n[Tyrant's Strength has allowed you to resist status effects and increased attack power at the cost of defense.]\n\n\"OHHHHHH!\"\n\nIt was David facing Goliath. Chris looked pitifully small against the towering war machine, but his determination blazed. The 1st ranked player. The mountain that stood beneath Grid alone. He had no intention of surrendering his position to anyone except Grid himself. \n\nBut even mountains can crumble.\n\n[You have blocked a devastating blow.]\n\n[Yetima's Greatsword durability decreased by 79!]\n\n[Right wrist fractured!]\n\n[You have suffered 6,030 damage.]\n\n[You have blocked a devastating blow.]\n\n[Yetima's Greatsword durability decreased...]\n\nThe mountain fell.\n\n[Your defense has failed!]\n\n[You have suffered 28,090 damage.]\n\n[Silver Ogre's Armor durability decreased by 190!]\n\n[Internal injuries sustained! All stats reduced!]\n\nChris couldn't endure the relentless bombardment. The PvP stage shattered beneath him. This was an artifact created by ancient humans desperate to survive raids from great demons and archangels. No body that hadn't achieved transcendence could withstand it.\n\n\"You're not weak,\" Zibal said as Chris struggled silently under Raiders's assault. \"I'm not strong. *Raiders* is strong.\"\n\nThe spear's sharp edge pierced through Chris, and the first semi-final match ended in an unexpected manner.\n\n\"ZIBAL! ZIBAL! ZIBAL!\"\n\nThe crowd continued their chant. Male voices dominated—a hero piloting a giant robot was the ultimate romance for men worldwide, transcending nationality and race.\n\n***\n\nPon, whose fighting style relied on his spear's superior reach, faced Yura in the other semi-final and fell to defeat. Her bullets at medium range proved fatal. Pon's white horse was slower than Raiders. Once his mount was shot down, Pon took a devastating blow.\n\n\"Are you alright?\"\n\n\"I'm... fine.\"\n\nDespite Yura advancing to the finals, South Korea's atmosphere resembled a funeral. The citizens couldn't forget the white giant that had broken the 1st ranked Chris like a toy. The dream of Yura claiming PvP gold and lifting South Korea to 4th place in the rankings had evaporated like morning mist.\n\nAmid the national disappointment, Yura's grandfather Lee Jinmyung felt only relief.\n\n\"That child's place isn't in Satisfy.\"\n\nChairman Lee was one of the beneficiaries of international laws designed to prevent the S.A. Group's economic monopoly. The Daejin Group, originally focused on automotive manufacturing, had leveraged its technological prowess to produce and distribute 7.3% of Satisfy capsules throughout Northeast Asia, expanding its business significantly in this sector. But Chairman Lee Jinmyung was seventy-seven years old this year. He always joked about living to one hundred twenty, but he had to admit that leading a massive corporation at his age was increasingly difficult. He needed a successor.\n\nThat's why he clung to Yura. Chairman Lee Jinmyung recognized his granddaughter's business acumen. She was well-known as a prodigy, and the image she'd cultivated with shareholders was exemplary.\n\n\"That child must take my seat. I refuse to hand the company my ancestors built to those vultures.\"\n\nOnly a direct descendant of the Daejin Group's founding family could occupy this position. Lee Jinmyung's wrinkled hands gripped the leather armrests of his chair.\n\n\"WAHHHH!\"\n\nOn the television screen, he watched his granddaughter standing on the finals stage. She fought. She suffered. Her beautiful features became a mask of blood and pain as she was forced to one knee by the towering opponent, crimson streaming down to the ground. Then she dissolved into ash.\n\n\"...Yes. Now it's finished.\" \n\nThe chairman released a deep sigh as he watched his granddaughter's final match. His eyes were bloodshot as he slumped against his chair. He'd wanted his granddaughter to lose, yet the result left him feeling hollow. There was no satisfaction in watching his proud bloodline fail and taste frustration.\n\nSuddenly, he resented being chairman of the Daejin Group. He resented the burden of responsibility.\n\n*At this age, I have to crush my young granddaughter's dreams. Tsk.*\n\nHis son, who'd died first, had been the cruel one. Truly cruel to leave him with this burden.\n\n***\n\n\"Something's wrong.\"\n\nAfter the PvP event concluded, Grid felt uneasy watching Yura wear her silver medal. Her expression was too detached, too empty. She showed no regret whatsoever. That wasn't like Yura—someone who'd always been her own harshest critic.\n\n*Yura can't be satisfied with silver...*\n\nAnxiety gnawed at him. His instincts as a man were screaming at him to contact her immediately. But what did a man who'd never been in a relationship, who knew nothing of love, understand about \"instincts\"?\n\n\"Ah, screw it. Why should I feel guilty? Isn't it normal to check on a friend?\"\n\nThe problem was that such ordinary gestures had never been ordinary for him. Grid steeled his resolve and pressed the call button. It was the first time he'd called a woman simply because he was worried, without any practical purpose behind it. Nervousness made his heart thunder with each ring.\n\nHe had no idea that this single phone call would become the hottest topic of this year's National Competition.\n\nNo one knew."
}