{
  "id": 949,
  "title": "Chapter 948",
  "content": "**TL Note:** Please revisit Chapter 944. The author revised several references to Valhalla during the Kraugel vs. Hero battle, and a significant section was missing from my original raw files. I've corrected this—approximately 500 additional words have been added to Chapter 944.\n\n---\n\nThe press conference hall buzzed with speculation.\n\n\"Mounts are typically classified as pets, but that magic machine looked different. Is it categorized as equipment?\"\n\n\"What fuels it? Considering its size and output, external resources would allow extended operation, right?\"\n\n\"I spotted the Saharan Empire's insignia. Doesn't that make it imperial property? How influential is Zibal within the empire to personally command such technology? Does he have ties to the royal family?\"\n\n\"How many of these machines does the empire possess?\"\n\nThe ceremony following the PvP finals had begun smoothly enough. Zibal's responses remained professional, his answers measured. But journalists rarely maintained their restraint for long. Sensationalism sold, and the atmosphere shifted.\n\n\"Player Zibal!\" A reporter's voice cut through the measured tone. \"Why did you summon the pegasus first in the finals? Did you believe you could defeat Yura without the magic machine?\"\n\nThe question struck a nerve with the audience. In the semi-finals against Chris, Zibal had immediately deployed his magic machine. Yet in the finals—the most critical match—he'd summoned his pegasus before escalating to the machine. Speculation had run rampant. *He's mocking her. Yura doesn't deserve his full power. She's weaker than Chris. That legendary class is wasted on her.*\n\nThe vultures had already begun circling Yura's reputation, and this reporter was simply the latest to pick at the carcass.\n\nZibal laughed—not with warmth, but with sharp contempt. His eyes swept across the reporter, then toward the cameras broadcasting to millions. \"Some of you have likely already deduced this, but the pegasus specializes in resource depletion—particularly mana. When facing an opponent with Yura's utility arsenal, that advantage is indispensable.\"\n\nHe leaned forward, his expression hardening. \"I didn't summon the pegasus because she was easy. I summoned it because she was *difficult.*\"\n\nThe ridicule wasn't for Yura. It was for the small-minded fools trying to diminish her accomplishments. Zibal wouldn't disrespect a warrior who'd clawed her way to the finals and fought with everything she had.\n\n---\n\nIt was over.\n\nShe was no longer Player Yura. More than five years in Satisfy—ended in a single afternoon.\n\nYura fled the interview area without completing her obligations, stumbling toward the bathroom as emotions overwhelmed her composure. She didn't even have the strength to curse her own inadequacy.\n\n*In the end, I can't escape.*\n\nHer father's face materialized in her mind with painful clarity. He'd been a gentle man, someone who treasured family time above all else. But her grandfather had crushed that gentleness beneath the weight of expectation—demanding sacrifice for the company, never the family. Her father had withered under that burden, his vitality draining year by year.\n\nEven as a child, Yura had recognized his suffering. She'd never voiced it, of course. Her father wouldn't have wanted his daughter's pity. Instead, she'd played the role of the perfect child—innocent, beautiful, unburdened. A small respite in his endless exhaustion.\n\nAnd because she'd hidden her awareness so well, her father had been able to share his truth.\n\n\"I'm working hard because I want you to be free, Yura—not because I'm afraid of your grandfather.\" His hand had been warm on her head, his voice soft with conviction. \"You only have to do things that make you happy. I'll protect you.\"\n\nA promise to a child who understood nothing. A wish that had carved itself into Yura's heart and remained there even after the accident that stole both parents away. Freedom. Happiness. Her father's dream for her.\n\nWhen she'd discovered Satisfy, it had felt like destiny—the one path that could lead her away from her grandfather's suffocating ambitions.\n\nThe result had been catastrophic. She hadn't achieved her father's wish. She'd *become* her father—trapped, exhausted, drowning beneath expectations she couldn't escape.\n\nHer phone vibrated.\n\nYura's vacant eyes drifted toward the screen, already knowing who it would be. Her grandfather. A man incapable of empathy or compromise, who knew only duty and obligation. He'd demand her immediate return to South Korea, of course.\n\nBut the name on the display wasn't her grandfather's.\n\n*Shin Youngwoo.*\n\nShe froze. Grid—someone she'd known for over four years yet had never contacted privately. A man who sometimes radiated warmth but more often felt distant, unreachable.\n\nYura hesitated. Accepting this call would likely make everything worse. Grid only contacted her when he needed something. Help with a quest. Assistance in a raid. Support for some scheme.\n\n*I can't help him anymore.*\n\nShe'd wanted to be someone Grid could depend on—the same way she depended on him. She'd offered that support freely, planning to continue indefinitely. But now? She wasn't sure she could help anyone.\n\n*Just one day. One day to sort through everything.*\n\nThat was the sensible choice.\n\n\"...Hello?\"\n\nShe answered anyway. Because she needed to hear his voice—that languid, powerful tone that somehow made her feel less hollow.\n\n*\"Are you okay?\"*\n\nThe gentleness in his voice was unfamiliar. Wrong, somehow. Grid was never gentle.\n\nHer composure cracked. Her hand began trembling, warmth seeping through the ice that had encased her chest. In this entire world, Grid was the only person she could truly depend on.\n\n*\"Tell me what's going on.\"*\n\n\"What do you want me to say?\"\n\n*\"You're hurting. Stop pretending. You didn't look good today.\"*\n\n\"...I didn't look good?\"\n\nSince childhood, Yura had mastered the art of deception. Yet both Damian and Grid had seen through her performance.\n\n*Father...*\n\nGrief twisted in her chest. Her father had known. All those years when she'd smiled and pretended everything was fine—he'd *known* his daughter was acting. How had that felt? Watching his child bear burdens she shouldn't have understood?\n\n*\"I want to help you. No—I* will *help you. Tell me what I can do.\"*\n\n\"...Thank you.\" Tears blurred her vision. She could feel Grid's sincerity, his determination. They had the same heart—mutual trust, mutual support. But some things couldn't be helped. Some cages had no keys.\n\n\"Youngwoo-ssi.\"\n\n*\"Yes?\"*\n\n\"I'm quitting the game.\"\n\n*\"...What?\"*\n\n\"Thank you for everything.\"\n\n---\n\n*—I'm quitting the game!*\n\nOnce upon a time, that phrase had topped surveys of things parents most wanted to hear. Gaming addiction could destroy lives, and families had celebrated when children abandoned their virtual worlds.\n\nBut five years after Satisfy's launch, the world had changed. Satisfy meant wealth, prestige, and power. Parents now *encouraged* their children to play. Grid himself had accelerated that shift.\n\nWhich made Yura's announcement incomprehensible.\n\nSetting aside personal feelings, Yura was a core member of the Overgeared Guild—one of the kingdom's greatest assets. Losing her would be catastrophic.\n\n\"Ah...\" Grid's thoughts crystallized around an article from years ago that had dominated South Korean headlines. Yura was the Daejin Group chairman's granddaughter. The chairman had publicly announced plans to bring her into the company.\n\nLauel had nearly lost his mind over that news, calculating how much Yura's game time would be reduced if she accepted a corporate position.\n\n\"...It's actually happening.\"\n\nAnd in the worst possible way.\n\n*Why? What can I do?*\n\nHis racing thoughts ground to a halt, then lurched backward to Yura's earlier reassurance to Lauel.\n\n*She said she didn't want to join the company.*\n\nFirst: confirm the situation. Grid called back. \"Are you entering the company? Is that what you want?\"\n\nSilence.\n\nThat was answer enough.\n\nGrid ended the call and pulled up a search engine, fingers moving automatically. Among the results, a message from Daejin Motors appeared.\n\n*(Unable to reach you directly. We would like you to represent Daejin Motors' new luxury brand. Please contact us to arrange a meeting.*\n\n*—Choi Jingoo, Public Relations Manager, Daejin Motors)*\n\n\"Hello, is this Choi Jingoo? Grid here. Yes, I'm interested. But first—give me the chairman's contact information.\"\n\nThe Overgeared King. A legendary blacksmith with astronomical wealth and influence spanning continents. Grid was about to leverage that power in the real world's political and financial arenas.\n\n---\n\n\"What? *Grid?*\"\n\nChairman Lee Jinmyung of the Daejin Group nearly dropped his phone. Grid had avoided commercials and broadcasts for two years now. Money no longer motivated him—his focus had shifted toward legacy, toward achievements that would echo through Satisfy's history rather than fleeting media exposure.\n\nAnd now he wanted to become a Daejin Motors model?\n\n*This is incredible.* The global promotional value alone would be staggering.\n\n*But...*\n\nSuspicion crept in. Grid wouldn't reach out without reason. And the timing—immediately after Yura's PvP defeat—was too convenient to be coincidental.\n\n\"...I thought the rumors about them being lovers were baseless.\" Lee Jinmyung had thoroughly investigated the scandal linking Grid and Yura, dismissing it as fabrication. Now he wondered if he'd been too hasty. \"Send him my personal number. No—I'll contact him myself. A relationship with the Overgeared King could prove... valuable.\"\n\nLet's hear what the boy wanted. Lee Jinmyung placed the call. \"Shin Youngwoo? This is Lee Jinmyung, chairman of Daejin.\"\n\n*\"Give me your granddaughter.\"*\n\nLee Jinmyung shot to his feet, his chair clattering backward. His mind spun at ferocious speed—the mind that had built an empire calculating probabilities, weighing options. Yura as his successor versus Yura tied to Grid. Grid's current value. Grid's *potential* value.\n\nThe calculation took seconds. Grid's potential was limitless.\n\n\"When should we schedule the ceremony?\"\n\n---\n\n*—When should I set the date?*\n\nGrid clicked his tongue. *Impatient old man.* They hadn't even negotiated a contract yet, and the chairman wanted to schedule the commercial shoot? Well, enthusiasm was good. It meant Yura would be allowed to keep playing.\n\n\"The date... I'll leave that to you. Since you're accommodating me, I'll do my best for your campaign.\"\n\n*\"Haha! Leaving the wedding arrangements to me? Truly befitting a hero who shapes the era!\"*\n\n\"...Wedding?\"\n\nIce slid down Grid's spine. That ridiculous word echoing through the receiver. How many times had people misunderstood him? How many disasters had started from assumptions?\n\n\"Wait. You've misunderstood.\"\n\n*\"Misunderstood?\"*\n\n\"I'm not asking to marry her. I'm asking you not to take Yura from the game.\"\n\n*\"...That doesn't make sense.\"*\n\n\"I'll sign a long-term contract with Daejin Motors.\"\n\nThe silence on the other end carried weight—consideration, calculation. Chairman Lee Jinmyung hesitated. Unfortunately, the hesitation was brief.\n\n*\"...Aren't you being arrogant? Your market value this year isn't what it was last year. You're not participating in the National Competition—your visibility has dropped. Last year's Grid? Worth any price. This year's Grid? Not worth my granddaughter.\"*\n\n\"What if—\"\n\n*\"...?\"*\n\n\"What if I elevate my value even higher at this year's National Competition? Would you reconsider?\"\n\n*\"Perhaps. But you're absent from this year's competition. That's already irreversible.\"*\n\n\"Demon King.\"\n\n*\"Demon King?\"*\n\n\"I *am* the Demon King.\"\n\n*\"...!!\"*\n\nChairman Lee Jinmyung's breathing stopped. Grid continued, unaware that the chairman's face had gone crimson, that his chest was tightening dangerously.\n\n\"I'll dominate the Demon King Subjugation event. Then I'll reveal my identity.\"\n\n*\"...!!\"*\n\nNo chance to recover. Chairman Lee Jinmyung felt himself teetering on the edge of cardiac arrest."
}