{
  "id": 95,
  "title": "Chapter 95",
  "content": "# Chapter 95\n\nGrid spotted her immediately despite the crowd. Ahyoung stood out like a beacon in the sea of bodies pressing through the meeting place.\n\n*Too pretty.*\n\nYura. Jishuka. Euphemina. He'd seen beautiful women lately—professional models whose faces dominated CF advertisements across Seoul. None of them had made his pulse spike like this.\n\n*Was it because she's my first love? Even compared to those top rankers, Ahyoung is...*\n\nHe remembered the first day of high school. Her smile had disarmed him completely. The way she lit up every conversation, made everyone around her feel seen. Three years of watching her from across the classroom, never finding the courage to speak. Graduation came and went.\n\nBut now. Now was different.\n\n*She agreed to meet. Just the two of us. That has to mean something. It has to.*\n\nTwo years since the last alumni reunion. Two years since he'd managed anything beyond a stuttered greeting in a crowd of classmates. His throat tightened. Sweat prickled at his temples.\n\nGrid took a deep breath. Cleared his throat. His legs moved on their own, stretching, loosening up like he was preparing for combat.\n\nIn the middle of the crowded sidewalk.\n\nPassersby stared. A businessman in a suit gave him a wide berth, muttering something under his breath. Grid ignored them all, focusing on the breathing exercises he'd learned from some random internet article about managing anxiety.\n\nAfter a minute of looking like a complete lunatic, he felt fractionally calmer. He walked toward Ahyoung.\n\nHer hair caught the afternoon light. Long and straight, exactly as he remembered. That subtle scent—was it jasmine? Something floral and expensive—wafted toward him as he approached.\n\n\"H-H-Hello Ahyoung?\" His tongue felt thick. \"It has been a while. How is your family? Well, um...\" \n\n*What am I even saying?*\n\n\"Uh, it is already autumn. Isn't there a lot of leaves on the street? The cleaners must be going through a lot of trouble. Haha.\" He could hear himself rambling. Couldn't stop. \"Shouldn't winter come sooner? When winter arrives, spring will come soon... In the spring, the flowers—\"\n\n*Oh god. I'm talking about the four seasons. I'm literally explaining the concept of seasons to her like she's five years old.*\n\nSweat soaked through the back of his designer shirt. The one that cost him 480,000 won. Probably ruined now.\n\n*So pathetic. I can't even form a coherent sentence.*\n\nAhyoung's smile widened. The expression looked almost fond.\n\n\"Youngwoo is still funny.\" She tilted her head, studying his outfit. \"Haven't you become even more handsome?\"\n\nThe words hit him like a healing potion. The expensive haircut—180,000 won at that salon in Gangnam. The shoes, pants, shirt totaling 1,030,000 won. Every won invested into this moment was worth it.\n\n*People are actually looking. They're noticing me.*\n\nHis confidence crawled back from whatever hole it had been hiding in. Grid straightened his shoulders, gestured toward a nearby building.\n\n\"I made a reservation.\"\n\nThe restaurant had cost him thirty minutes of obsessive internet research. Tuna specialty. Omakase-style. The kind of place where the chef personally presented each course. The prices on the website had made his eye twitch, but this was Ahyoung.\n\nAhyoung removed her coat as they were seated. Grid's brain short-circuited.\n\n*No. Don't stare. Don't be creepy. Just—*\n\nHer dress had a neckline that could only be described as strategic. Grid grabbed his nose, convinced he was about to have an actual, literal nosebleed like some cartoon character.\n\n\"Isn't this place expensive?\" Ahyoung settled into her seat with practiced grace. \"Youngwoo, are you doing well these days?\"\n\nGrid forced his hand away from his face.\n\n\"I got a job.\" The words came out steadier than expected. \"My debt has now been cleared.\"\n\nHe needed her to understand. The old Youngwoo—the one drowning in loan shark interest, the one she'd heard about through the alumni gossip network—that person was gone.\n\nAhyoung's eyes widened. \"Omo, really? That is good.\" Her voice carried genuine warmth. \"Well, Youngwoo was a hard worker so I believed that you would someday do well.\"\n\nThe room tilted slightly. Grid blinked.\n\n*She noticed? All those hours in the library, the extra training after PE class, just trying to keep up with everyone else... She was paying attention?*\n\nNo one had ever acknowledged that before. His mediocre grades, his average athletic performance—everyone assumed he just coasted. Never tried. But Ahyoung had seen through it.\n\nThe first course arrived. Ahyoung poured soju with both hands, the traditional gesture of respect. She raised her glass.\n\n\"For Youngwoo's new start after clearing all the debt! Cheers!\"\n\n\"C-Cheers!\"\n\nThe soju burned going down, but it tasted like victory. Grid couldn't remember the last time alcohol had tasted this good. Maybe never. The tuna was incredible too, though he barely tasted it through the haze of euphoria.\n\n\"Too delicious!\" Ahyoung's enthusiasm was infectious. \"I am able to eat at a place like this thanks to Youngwoo. Are you making a lot of money? Where did you get a job?\"\n\nGrid hesitated. If he mentioned Satisfy, she'd assume he was still wasting his life on games. Better to keep it vague.\n\n\"I'm just a worker at a small company.\"\n\n\"Heh, is it your major?\"\n\n\"Um, something like that.\" He leaned forward, eager to shift focus. \"Ahyoung, what have you been doing?\"\n\n\"Me?\" She laughed, waving her hand dismissively. \"I'm just going to work and work and work, it is an infinite loop.\"\n\n\"What about romance?\"\n\n\"When will I have time for romance when I am so busy working?\"\n\n*There it is.*\n\nGrid's heart hammered against his ribs. Too busy for dating. Meeting him personally despite that schedule. The logic was airtight, irrefutable. She liked him. Had to.\n\n*I can do this. I can actually ask her.*\n\n\"You know Ahyoung.\" The words tumbled out before he could stop them. \"I am doing fairly well these days. It will take a while because my family is going through some tough times these days but... I am planning to collect my marriage funds soon. That... W-When...\"\n\n\"When?\"\n\n\"When I collect all the wedding funds... At that time, marry me!\"\n\nSilence crashed down like a dungeon ceiling collapsing.\n\n*What. What did I just—*\n\nAhyoung grabbed her stomach. Her laugh started as a giggle, built into full-blown hysterics.\n\n\"What, a proposal all of a sudden? You really surprised me. Youngwoo, you really...\" She wiped tears from the corners of her eyes. \"Have you always been this funny?\"\n\nGrid's face burned hot enough to smelt iron ore.\n\n*She thinks I'm joking. Of course she thinks I'm joking. Who proposes after two years of not seeing someone? I'm such an idiot.*\n\nHe wanted to melt into the floor. Seep between the expensive restaurant tiles and disappear forever. They continued eating. The conversation flowed easier after that, though Grid couldn't shake the mortification. Three bottles of soju between them. Grid stayed mostly sober, too anxious to drink properly. Ahyoung's cheeks flushed pink.\n\n\"I need to go fix my makeup.\"\n\n\"Ah, yes.\"\n\nShe glided toward the bathroom. Grid slouched in his seat, mind racing.\n\n*A bar? Karaoke? No, Sehee said my singing could kill small animals. Maybe... maybe a hotel? She's been drinking. I could suggest we take a break, sober up...*\n\n*Today could be the day.*\n\nFive minutes passed. Then ten. Grid frowned.\n\n*Is she okay? Did she get sick?*\n\nHe stood, flagged down an employee to ask for the bathroom location. The corridor stretched long and narrow, dim lighting casting shadows against wood-paneled walls. At the end, two doors. Women's bathroom on the left. Smoking area on the right.\n\nAhyoung's voice drifted through the smoking room door, slightly ajar.\n\n\"Ah, he is so embarrassing.\"\n\nGrid froze mid-step.\n\n\"Why is he wearing clothes that look like they come from the set of an Internet shopping mall? You know. Those pants that are popular these days... Yes, that's right. You see a lot of them on the street. He came fully dressed like that.\" A pause, presumably listening to whoever was on the phone. \"People were staring. I was really mortified. His hairstyle doesn't suit his face, making him look worse. Sigh, really.\"\n\nThe words registered in fragments. Grid stood perfectly still, blood turning to ice water in his veins.\n\n*She's talking about me. She's talking about—*\n\n\"Do you know? He proposed less than 30 minutes after we met. Kukuku! Not even dating, but marriage! He is really so pitiful, pitiful. Are you dying from laughter? Huh? That's right. I am having fun. Isn't it good playing around like this? I will be sure to make him come to the reunion.\"\n\nGrid reached up. Pinched his own cheek. Hard.\n\nThe sharp pain brought tears to his eyes. Real. This was real.\n\n*Not a dream. Not a nightmare. This is actually happening.*\n\nHe walked back to the dining room on autopilot. Poured himself another glass of soju. Downed it in one go. The sweet taste from earlier had curdled into something bitter and poisonous.\n\nAhyoung returned moments later, smile perfectly in place.\n\n\"What? Have you been drinking alone?\" She slid into her seat. \"Youngwoo, aren't you a drinker? Let's go somewhere else. We can talk more in a place where the atmosphere is better...\"\n\n*Say something. Tell her you know. Call her out.*\n\nBut Grid couldn't. The words stuck in his throat like a physical obstruction. Because despite everything, despite the phone call and the mockery and the casual cruelty, he still—\n\n*I still love her. How pathetic is that?*\n\n\"No, let's end it here today.\" His voice came out flat. Dead. \"I have to hurry home.\"\n\n\"Huh? Already?\"\n\nHer expression of surprise looked so genuine. Like a Rare-rated mask with perfect durability. If he hadn't overheard that call, he'd believe her completely. Forever fooled.\n\n\"I'm sorry, I'll have to see you next time.\"\n\nGrid stood. Left enough bills on the table to cover the meal and then some. They walked outside together. The autumn air bit at his face.\n\nAhyoung touched his arm lightly. \"Come to the reunion next week, understood?\"\n\n*Ah. So that's it.*\n\nThe alumni. They'd sent Ahyoung as bait. Use the pathetic Youngwoo's crush to drag him to the reunion. Give everyone a good laugh at his expense. Fresh material for their gossip.\n\n\"Okay, I understand.\"\n\nHe nodded. Couldn't even muster the energy to refuse.\n\nThe bus ride home blurred into a smear of streetlights and tears. Grid cried openly, face pressed against the window. Other passengers shot him dirty looks. Someone muttered about drunk kids. He didn't care. The tears kept coming.\n\nHis apartment building materialized through the haze. He climbed the stairs like a zombie, unlocked the door.\n\nSehee appeared immediately, concern written across her face.\n\n\"What's with that stupid haircut? Huh?\" Her eyes narrowed as she studied his expression. \"Why do you look like that? Are you crying?\"\n\nGrid met his sister's gaze. The words came out with absolute certainty.\n\n\"I'll never love again. Women... I'm really scared of women. I don't like them.\"\n\n\"What happened?\"\n\nBut Grid was already moving toward his room. Toward the capsule.\n\n*Reality doesn't need me. I'm just entertainment. A joke.*\n\nBut Satisfy was different. Khan depended on him. Administrator Valdi needed his skills. Irene genuinely cared about him. In that world, he had value. Purpose.\n\nGrid climbed into the capsule. Let the connection wash over him like absolution.\n\nThe whisper came through immediately.\n\n**[Jishuka whispers: The orb's price has been determined. Can we meet now?]**\n\nShe arrived at Khan's smithy within minutes, moved with purpose through the door. Jishuka held out a bag of gold, but her eyes were locked on his face.\n\n\"The maker of the Special Jaffa Arrows... We have been searching really hard for you.\" She leaned forward slightly. \"We need your abilities. Grid, please join our guild.\"\n\nGrid studied her. Beautiful, yes. Strong. Confident. She'd seen him use Pagma's Swordsmanship during the Malacus raid. Knew about the Divine Shield. She'd probably figured out he had a hidden class.\n\n*A top guild wants me. Actually wants me.*\n\nThe benefits were obvious. Resources. Support. Protection. But Grid had learned to be suspicious of good fortune.\n\n\"I have a question.\"\n\n\"Ask me anything.\"\n\n\"The money I will earn from my personal activities and the money I will earn from working with your guild.\" Grid crossed his arms. \"Which one will be bigger?\"\n\nJishuka didn't hesitate. \"Of course you will make more money when you are with us. You will get more money and reputation.\"\n\n\"Really?\" Grid felt something unfamiliar stirring in his chest. \"Then I have a condition before joining the guild.\"\n\n\"Yes. Whatever you ask.\"\n\n\"I am based here at Khan's smithy. I am Khan's successor and will someday inherit this smithy.\" He gestured at the forge, the tools, the building Khan had poured seven generations into. \"I don't want to move my base according to your tastes.\"\n\n\"Okay.\" Jishuka smiled. \"We will move our guild base to Winston instead of forcing you to move.\"\n\nGrid blinked. Stared. Tried to process what she'd just agreed to.\n\n*They'll move their entire headquarters? For me?*\n\nHe'd known he was good. The best blacksmith in Satisfy, probably. But he'd never imagined his value ran this deep. That an elite guild would restructure their entire operation just to recruit him.\n\n*I could go to any guild. Make demands. They'd probably agree.*\n\nBut Grid didn't want to shop around. Because this feeling—being acknowledged, being needed—was still too new. Too fragile. After Ahyoung, after a lifetime of being overlooked and mocked, Jishuka's offer felt like water in the desert.\n\n\"Okay. I will join the Tzedakah Guild.\" Grid extended his hand. \"If you don't keep any of your promises, I can leave the guild at any time.\"\n\nThey shook on it. Grid officially became a member of the Tzedakah Guild.\n\n*This is just the beginning.*\n\nHe clenched his fist as Jishuka left to begin arrangements. The hurt from Ahyoung still burned in his chest, but it was transforming into something else. Something colder. Sharper.\n\n*I'll become rich. Powerful. And then I'll show every single one of them.*\n\nThe alumni. Ahyoung. Everyone who'd ever looked at him and seen nothing but a joke. He'd make them eat their words.\n\nGrid walked to the forge. Picked up his hammer. The weight felt right in his hands.\n\n*I'll show them who Shin Youngwoo really is.*"
}