{
  "id": 950,
  "title": "Chapter 949",
  "content": "The Overgeared Kingdom might still be considered small by Satisfy's standards, but its landmass already exceeded Japan's. Following the Hexetia Crisis, the kingdom's population had exploded alongside an economic boom driven by their monopoly on the blacksmithing market.\n\nWhat made the kingdom truly remarkable was its ownership—a single player ruled it all. As Overgeared King, Grid commanded tens of millions of citizens, controlled resources distributed across the entire realm, and could theoretically convert the kingdom's entire GDP into real-world currency. This was wealth on a national scale, and it grew with every passing day.\n\nChairman Lee Jinmyung's hands trembled slightly as he gripped his phone. Daejin Group—currently ranked seventh among South Korean conglomerates—could become a global powerhouse through this partnership. If Grid became the face of Daejin, billions would learn the company's name. Their international position would solidify overnight.\n\nThis was an opportunity too massive to fumble.\n\n\"...Understood.\" The chairman's voice steadied. \"I accept your offer. Win the Demon King subjugation event, and I'll sign a long-term contract with you. Yura will be free to make her own choices.\"\n\nHis mind raced through the calculations. With Grid as a partner, clinging to Yura wasn't necessary. He still had his second daughter's child—bloodline without the Lee surname, but blood nonetheless. If he gained the halo called 'Grid,' such concessions became trivial.\n\nDecision made, the weight lifted from his shoulders. A smile crept across his face as he envisioned Daejin's gleaming future. \"By the way...\" He leaned back in his chair. \"What exactly is your relationship with Yura?\"\n\nFriends? Colleagues? That wouldn't drive Grid this far. The chairman was convinced they were lovers, regardless of public denials. Well, he wasn't being biased, but his granddaughter *was* the most beautiful woman in the world. Intelligent, virtuous, perfect. What man wouldn't fall for her?\n\nThe snake-like smile froze at Grid's response.\n\n—*Well, I rely on Yura quite a bit, but I'm not sure she feels the same way about me.*\n\n\"Rely on her...?\"\n\n—*Inside the game, her strength helps tremendously. Outside... I'm not exactly a social butterfly. She's given me tons of advice about media relations, taxes, that sort of thing.*\n\n\"And?\"\n\n—*Huh?*\n\n\"Is that all?\"\n\n—*Yes...?*\n\n\"Weren't you two involved in a scandal? I heard my granddaughter spent the night at your house.\"\n\nHe'd uncovered that detail during his investigation. During the 1st National Competition, his granddaughter had stayed overnight at this young man's home.\n\nGrid's flustered voice crackled through the speaker. —*N-Nothing happened! Yura was completely drunk, so I had to bring her back to my place. My parents were home the whole time. Really, nothing happened!*\n\n\"....!!\" \n\nThe phone creaked in Chairman Lee's white-knuckled grip. Rage boiled beneath his composed exterior.\n\nWas this fool *blind*? This complication hadn't factored into his calculations. Still, the deal was too valuable to abandon. Grid's worth transcended even major character flaws.\n\n\"*Sigh*... Fine. I understand.\" He pinched the bridge of his nose. \"Then I wish you luck. The moment you reveal yourself as the Demon King, we'll flood the media with news of our partnership. But keep one thing in mind—don't expose your identity until that dramatic reveal.\"\n\n—*That's what I want too.*\n\nThe foundation was laid. Contract details could wait until after the Demon King subjugation.\n\n***\n\n\"You worked hard out there.\"\n\n\"Shame about the result.\"\n\n\"What kind of consolation is that? Second place is incredible! Second *in the world*. You were amazing.\"\n\n\"I'm not saying silver is bad. Just... we all know you could've taken gold.\"\n\n\"Exactly. That gold medal should've been yours.\"\n\nYura returned to the South Korean team's waiting room to a chorus of sympathetic voices. Out of billions of players, she'd claimed second place in PvP—yet her teammates offered comfort instead of celebration. Their acknowledgment of her true skill was almost painful in its sincerity.\n\n\"You can aim for it next time,\" Peak Sword said gently. \"Next year, the year after that. Eventually, you'll take first place. Right?\"\n\nHe was right, of course. But Yura no longer had that luxury. Her days as a player were numbered. She could only manage a bitter smile in response.\n\n[The Demon King subjugation event will commence in 20 minutes.]\n\n[All 400 participants, please proceed to the private waiting room.]\n\n[Repeating: The Demon King subjugation event will commence in...]\n\nThe announcement echoed through the venue. This year's most anticipated event—a cooperative challenge requiring four hundred rankers to work together rather than compete. The difficulty would clearly be nightmarish, and global attention had reached a fever pitch after the Demon King's appearance event. Billions of viewers were holding their breath.\n\n\"T-Then I'm heading out!\"\n\n\"Yura, rest up. I'm nowhere near your level, but I'll give it everything I've got.\"\n\n\"Think I can snag a gold medal?\"\n\nCoke, Peak Sword, and Eat Spicy Jokbal—South Korea's representatives for the Demon King subjugation—departed for the waiting room. Watching Coke's nervous energy, guilt twisted in Yura's chest. She'd participated in both the sword drawing and siege war events, driven by a selfish desire to defeat Kraugel and prove her worth to her grandfather.\n\nNow Coke bore the weight of expectations she'd created.\n\nA hand settled on her shoulder. Viola, dressed in an elegant hanbok, offered a knowing look. \"You're too kind. Always worrying about everyone else.\"\n\n\"I'm not kind. I'm selfish.\"\n\n\"No, you're kind. You've been fighting alone since the 1st National Competition while other Korean rankers turned away. You've done more than enough. You don't have to carry everything by yourself. It's natural to pursue your own goals. Why feel guilty?\" Viola's eyes softened. \"How can anyone be so pure and selfless?\"\n\n\"...\"\n\nThe words settled over Yura like a warm blanket. *She'd done enough.*\n\nThat simple truth loosened the knot in her chest. Yes, perhaps she'd earned the right to rest. As she exhaled the tension, her phone buzzed. She expected her grandfather, but the screen displayed 'Shin Youngwoo' instead.\n\n\"...Hello?\"\n\n—*Keep watching until the end.*\n\n\"What do you mean?\"\n\n—*The Demon King subjugation event.*\n\n\"...?\"\n\n—*Someone will be fighting to protect you.*\n\n\"Wait, what?\"\n\n—*I have to go. See you soon.*\n\n\"Hello? *Hello!* Youngwoo-ssi!\"\n\nThe line went dead. Yura's hands trembled as she raised her eyes to the monitor.\n\n***\n\nThe Demon King subjugation stage materialized on screens worldwide—a castle fortress enclosed by circular walls.\n\n『 Four gates at the cardinal points, north, south, east, and west. Each gate is defended by one of the four heavenly kings. 』\n\nThe fortress sprawled across the landscape, its gates towering over twenty meters high and stretching forty meters wide. These barriers would remain sealed until all four heavenly kings fell.\n\n『 The four hundred participants will divide into groups of one hundred, each group tasked with defeating one heavenly king. Once all four have fallen and the gates opened, survivors will advance through the corridors to the Demon King's chamber. 』\n\n『 They must split up? Can't all four hundred attack the heavenly kings sequentially as one force? 』\n\n『 Impossible. Each gate functions as an instant dungeon with a population cap of one hundred players. 』\n\n『 What happens if one group fails to breach their gate? 』\n\n『 Another group must take their place. 』\n\n『 So the failed group is disqualified? 』\n\n『 No. They'll be counted as dead and resurrected once the gate opens. 』\n\n『 Meaning unless all four groups wipe, there's no disqualification? So all four hundred will potentially face the Demon King? 』\n\n『 Correct. The final confrontation is designed as four hundred versus one, even if groups fall at the heavenly king stage. 』\n\nWhich meant the Demon King's strength was monstrous. Analysts estimated his power rivaled that of great demons—at minimum. His appearance event had showcased devastating abilities: destroying magic, then copying it. A power that rendered sorcery obsolete.\n\nAt least eighty of the four hundred participants would become decorative casualties.\n\nThe magicians erupted.\n\n\"This is absurd! How can you discriminate against entire classes in the competition's flagship event?\"\n\n\"You're basically guaranteeing magicians won't earn any rewards!\"\n\nInside the Demon King subjugation waiting room, Goshar led eighty magicians in furious protest. The officials dismissed them with bureaucratic indifference—no discrimination had occurred, they insisted, maintaining that same maddeningly neutral stance.\n\n\"Damn it! When's a proper competitor to this game coming out? This is *bullshit!*\"\n\nCurses flew behind closed doors. In the midst of this bitter atmosphere, some sharper minds began theorizing.\n\n\"Maybe the four heavenly kings are vulnerable to magic while the Demon King resists it? We might be essential for clearing the gates.\"\n\n\"The heavenly kings also award medals. Magicians can shine there, then focus on support during the Demon King fight.\"\n\n\"But what about earning points against the Demon King himself?\"\n\n\"Ever heard of phase mechanics? Most named bosses shift characteristics based on health thresholds. The Demon King probably does too. High chance he loses magic resistance or becomes magic-vulnerable in certain phases.\"\n\n\"Hm...\"\n\nAs expected from rankers, the logic was sound. The magicians gradually calmed, thinking strategically.\n\n*We'll dominate the early stages and adapt for the final phases. That's enough screen time to secure sponsorships.*\n\n*This could be my commercial breakthrough.*\n\n***\n\nGoshar, ranked first among earth magicians globally, chuckled to himself. \"Yohohoho.\" \n\nAssigned to Group B for the west gate assault, his confidence had soared upon seeing their opponent. The heavenly king stood alone beneath the massive gate—a woman with a large blindfold covering her eyes, clad in remarkably shabby equipment.\n\nDespite being female, she wore a full heavy armor set: a helmet with neck guard, breastplate extending to mid-thigh, steel greaves rising to her knees. Only her lips, jaw, and hands remained exposed—a complete rejection of the ridiculous logic that female characters gained defense proportional to skin exposure. She looked like she'd wandered out of a beginner village.\n\n\"She looks pathetically weak.\"\n\n\"Don't underestimate her. She's one of the mad Demon King's four heavenly kings.\"\n\n\"The heavenly kings are probably weak compared to the Demon King anyway. They're side bosses to the main event, right?\"\n\nGoshar brimmed with confidence. After his humiliation by the Demon King, this was his chance for redemption.\n\n\"Go! **Giant's Haaaand!**\"\n\nA colossal earthen hand surged forward like a hydra's striking neck, engulfing the heavenly king in its crushing grip. The impact thundered across the battlefield!\n\n\"Oh...!\"\n\n\"Is it working?\"\n\nGroup B players peered through the settling dust cloud expectantly. The heavenly king stood motionless, shield raised. The giant hand had been completely blocked—only debris scattered across the ground.\n\n\"...Aren't *you* the weak one?\"\n\nEvery eye turned to Goshar. Sweat beaded on his forehead as a notification materialized before him.\n\n[The target has blocked most of the spell!]\n\n[The target has received 12,090 damage.]\n\n*Just over twelve thousand damage?* This was an ultimate-tier spell capable of dealing five hundred thousand damage to most monsters!\n\n*Weren't the four heavenly kings supposed to be weak against magic?*\n\nDamn it all!\n\n*Isn't female defense supposed to be proportional to exposed skin?*\n\nGoshar felt cheated on multiple fronts. The heavily armored woman—one of the four heavenly kings, with the name 'Benz' floating above her head—drew her sword. A crimson blade emerged, long and elegant, matching the deep red of her lips."
}