{
  "id": 951,
  "title": "Chapter 950",
  "content": "**West Gate**\n\nBenz launched herself forward. The earth cratered beneath her feet with a thunderous crack—the ground buckling under the sheer mass of her armor and shield. This wasn't merely weight. This was transcendent strength made manifest.\n\n\"Incoming!\"\n\nGroup B drew weapons as one. Sandy winds whipped around them, conjured by the earth magician Goshar—a desperate attempt to redeem his earlier failure. The guardian knight soared into the air, her crimson sword poised to strike.\n\n\"I'll hold her! Hit her while she's engaged!\" Weldon, Germany's sixth-ranked guardian knight, planted himself at the front line. His shield rose to meet Benz's descending blade.\n\nThe strike came—a thrust, clean and precise. Weldon was steel. His shield had weathered countless blows.\n\nBut steel meant nothing here.\n\n*CRACK.*\n\nThe impact bent his shield inward like parchment. Weldon's eyes widened as understanding crashed over him—the sword's weight had multiplied mid-strike. His wrists snapped under the impossible force, bones fracturing as the shield crumpled.\n\n\"Hold the line!\"\n\nA dozen players surged forward. Skills flared. Blades and spears lashed out. Arrows streaked through the air alongside spinning daggers.\n\nBenz's side shield deflected half the onslaught without her even glancing at it. Her sword intercepted the rest with surgical precision. Then crimson crystals exploded from her blade in every direction—dozens of them, like the stone thorns Kraugel's sword could conjure.\n\n[You have suffered 4,390 damage.]\n\n[Embedded crystals will interfere with recovery effects.]\n\n\"What the hell—\"\n\nThis wasn't simple weapon mastery. Blocking skills rather than basic attacks required either legendary technique or equipment effects. As players scrambled to analyze the threat, Benz moved.\n\nHer shield crashed into the nearest warrior, the impact carrying through to knock down the player behind him. She vaulted over their falling bodies and landed beside Goshar. She'd identified the source of the debuffing sandstorm.\n\n\"Hiik...!\" \n\nGoshar's hands were locked in casting gestures, his body completely exposed. The red sword fell toward him like an executioner's blade.\n\nAn axe intercepted it mid-swing.\n\nCoke—the secret weapon raised by the Overgeared Kingdom's ten meritorious retainers—had thrown his weapon with perfect timing, disrupting Benz's momentum. His spear followed, punching through her shoulder guard.\n\nFirst blood.\n\nBenz flinched back, and Peak Sword was already there. *Draw Sword* unleashed—Iyarugt sang from its sheath like a feral beast, the accumulated charge from Iyarugt's Sheath making the blade seem alive.\n\nThe strike shattered Benz's neck guard. Red blood—human-red—fountained from the wound.\n\nPeak Sword clicked his tongue as he checked her health gauge. \"Her defense is absolutely disgusting.\"\n\nHis tone was light. His expression was murderous. The charged Iyarugt had barely scratched her, and his frustration created an opening.\n\n\"Move!\"\n\nHe threw himself backward on instinct, but not fast enough to avoid the counter-cut across his shoulders.\n\n[You have suffered 15,900 damage.]\n\nPeak Sword was one of the Overgeared Kingdom's ten meritorious retainers. His equipment was personally crafted by Grid—armor and helmet of legendary quality. Even with Goshar's protective sandstorm active, he'd been gutted.\n\nBenz pressed toward the reeling swordsman.\n\n\"Not so fast.\"\n\nEat Spicy Jokbal—the Dungeon Maker who wielded power rivaling legendary classes within his domain—drew Benz's attention.\n\nHer momentum arrested.\n\nThe three Korean representatives commanded Group B now. Coke, Peak Sword, and Eat Spicy Jokbal had seized leadership so naturally that Goshar and the other proud rankers found themselves following orders without question. They executed Peak Sword's tactics, supported Coke's vanguard charges, and protected Eat Spicy Jokbal whenever he reshaped the dungeon terrain.\n\nKorean viewers' blood boiled. These rankers—once dismissed by the world—now stood as global icons. Every Korean player burned with desire to join the Overgeared Guild, to stand beside Grid and write their own legends.\n\n***\n\n**South Gate**\n\nThe southern guardian was unremarkable. Light chain armor. A single sword. His nameplate simply read 'Vin.' Nothing about him suggested he belonged among the Demon King's four heavenly kings.\n\n\"Well, he doesn't need to be that strong, right?\"\n\nThe four heavenly kings were obstacles, not endgame content. The S.A. Group wouldn't design an event where reaching the Demon King was impossible—that would defeat the entire purpose. Therefore, the heavenly kings had to be beatable.\n\nGroup C maintained this confidence, bolstered by their heavy hitters: Zibal, the PvP champion. Zhang Jian and Liao Wei, China's rising stars. Bubat of Turkey, Seuron of Argentina, and other top-ranked players.\n\nMost participants accepted they wouldn't score high in this stage—not with these powerhouses present. But at least they'd clear it.\n\n\"One-handed sword, no shield.\" Mei Xiao's voice cut through the casual atmosphere. \"He's built for pure swordsmanship. Expect speed. Stay alert.\"\n\nThe Chinese woman had tormented Hero Grid for five full minutes using her animated whip and cloth. Her tense warning dropped the temperature of the entire group.\n\nLiao Wei sneered. \"Overestimating the enemy already? Planning to surrender without fighting? Just like your brother?\"\n\nZhang Jian piled on. \"Why state the obvious? Trying to look smart? Think everyone else is an idiot?\"\n\nThe atmosphere turned arctic. This was an event with three medals at stake, and teammates from the same country were already tearing into each other?\n\n\"Pathetic.\" Zibal's contempt was naked. \n\nZhang Jian and Liao Wei bristled but swallowed their retorts. Zibal was single-digit ranked—formerly second place, a monster who'd touched the pinnacle. China's golden boys weren't stupid enough to challenge him directly. Better to pretend they hadn't heard.\n\nZibal addressed Mei Xiao instead. \"That guy—knight's armor but leather shoes. He'll move too fast to track easily. Binding him is priority one. Understood?\"\n\nMei Xiao's whip and cloth had moved like serpents during her battle with the Hero, constraining his movements. They weren't autonomous like Grid's God Hands—she controlled them manually—but her manipulation was fluid and precise. Zibal's decision to rely on her made perfect sense.\n\nTouched by his acknowledgment, Mei Xiao straightened. \"Yes! I'll lock down his movement!\"\n\n\"Good.\"\n\nZhang Jian and Liao Wei's faces darkened. Mei Xiao was gaining recognition from next year's probable champion while billions of Chinese viewers watched. The realization that she outclassed them crushed their pride. Jealousy coiled in their guts like acid.\n\nA new voice interrupted their spiral. \"You two planning to keep whining? Or will you actually contribute?\"\n\n\"Folding screens? How dare—\"\n\nThey spun, curses ready, then choked them back. Seuron stood behind them, smiling.\n\nThe Argentine leaned close, voice dropping to a conspiratorial whisper. \"First strike earns recognition for bravery. I was planning to take it, but I'll concede—out of pity for you. Interested?\"\n\nZhang Jian and Liao Wei glanced at Vin. The guardian stood before the gate with arms folded, radiating arrogance despite facing a hundred enemies.\n\n\"Viewers will hate his attitude,\" Seuron continued. \"Whoever hits him first becomes the hero.\"\n\n\"...\"\n\n\"No? Then I'll—\"\n\n\"We'll do it!\" Zhang Jian and Liao Wei lunged forward as Seuron moved to pass them. \"Leave it to us!\"\n\nThey didn't wait for acknowledgment. Zhang Jian's spear and Liao Wei's sickle struck from two meters out while Vin maintained his folded-arm stance. A perfect opening strike.\n\nFor half a second.\n\nVin's swordsmanship transcended Peak Sword's speed. Before their weapons reached him, his blade left its sheath and carved through Zhang Jian's heart and Liao Wei's throat in a single fluid motion.\n\n\"*Cough*...!\"\n\n\"Oh~ A bit stronger than expected?\"\n\nSeuron's whistle pierced through their shock. Understanding crystallized—they'd been manipulated, used as test subjects. They moved to retreat.\n\nVin's sword found them again. Cold flames erupted from their wounds, devouring their remaining health.\n\nThey collapsed as grey light.\n\nSeuron's smile widened, predatory and satisfied. It was the grin of a demon who'd just claimed two souls.\n\n\"Excellent. I've acquired usable materials.\"\n\n***\n\n**North Gate**\n\n\"What the hell is this?\"\n\n\"He's not a priest. Why does a Demon King's servant have healing?\"\n\nGroup D had radiated confidence mere minutes ago. Their roster justified it: Jishuka, Damian, Katz, and Haster.\n\nJishuka delivered overwhelming ranged damage with area healing. Damian combined buffs, healing, light-attribute attacks, and tanking capability. Katz wielded blood magic for crippling debuffs while sustaining himself through vampiric drains. And Haster—once crowned the emperor of gaming.\n\nOn paper, Group D might even surpass Group A, despite Kraugel, Chris, Pon, and Regas's presence. And the northern guardian's nameplate read 'Kobold'—a name synonymous with fodder mobs, lumped together with orcs, gnolls, and goblins.\n\nBreaking through should have been trivial.\n\nReality proved otherwise.\n\nThe masked Kobold defied his demeaning name. Wide-area spells bombarded Group D relentlessly. His defense shrugged off Jishuka's arrows and Damian's holy strikes. Worst of all was his regeneration—no matter how much damage they dealt, even amplified by Damian's buffs, Kobold recovered instantly.\n\n\"This is absurd...\"\n\nKatz had clashed with Kobold repeatedly now. Each exchange stimulated something buried deep. His madness—sealed since joining the Overgeared Kingdom—began to stir.\n\n\"*Bloody Sky.*\"\n\nBlood pooled across the battlefield, shed by Group D's members throughout the grinding fight. Now it rose, defying gravity, ascending toward the heavens.\n\n***\n\n**East Gate**\n\n\"He's confident.\" Chris could only laugh.\n\nPlayers from Canada, Korea, Britain, Japan, and China had banded together in national groups. Meanwhile, America's three rankers had split up independently—a declaration of superiority. Each would tackle separate gates, aiming for individual gold medals rather than settling for silver or bronze through cooperation.\n\n\"Grid would've done the same,\" Kraugel observed.\n\nChris shrugged. \"No point mentioning him.\"\n\nIf Grid were participating, everyone outside his group would probably pray he failed. He'd likely clear all four gates single-handedly.\n\n\"Anyway, let's give them a show.\" Chris extended his hand.\n\nThe other players mentally prepared themselves for disappointment. Kraugel accepting a handshake? The man who ignored hundreds of autograph requests? Impossible.\n\nKraugel clasped Chris's hand without hesitation.\n\nChris was Grid's colleague and a remarkable individual who'd earned respect through both achievement and character.\n\n\"Agreed. We may have chosen the worst opponent, so stay sharp.\"\n\n\"The worst?\" Chris frowned. \"There's a difference between the four heavenly kings?\"\n\nIf so, how could Kraugel already distinguish it?\n\nConfused, Chris studied their opponent. The guardian wore a wide-brimmed hat pulled low over his face—the kind favored by elderly gentlemen. He seemed almost... relaxed.\n\n\"...You're certain he's the worst?\"\n\n\"Unfortunately, yes.\" Kraugel surveyed the terrain surrounding the gate.\n\nMudflats stretched in every direction. Good for farming. Good for harvesting seafood.\n\n***\n\n**Demon King's Castle**\n\nInside the castle, beyond the camera's reach, Grid continued his work. Molten pavranium—the legendary golden mineral—flowed from his portable furnace. He'd melted down Blade Aiming at the Gods, the myth-rated sword.\n\nThe National Competition server was isolated from the main game. Destroying items here wouldn't affect his actual inventory.\n\n\"Perfect.\" Grid completed the smelting process and activated Legendary Blacksmith's Creation.\n\n[What item do you want to create?]\n\n\"A cannon.\"\n\nWide-area firepower was the foundation of defense. An automatic cannon that fired whenever its cooldown reset? \n\nGrid's grin could have made demons uncomfortable. He layered the *Alarm* spell into the creation.\n\nEven Seuron's predatory smile—worn while sacrificing his own group members—paled compared to Grid's expression of unholy glee."
}