{
  "id": 952,
  "title": "Chapter 951",
  "content": "The National Competition ran on a server completely isolated from the main game. Every item destroyed, every wound suffered, every piece of equipment lost—none of it would carry over. This safeguard had been implemented specifically for the 4th Competition.\n\nMost players had welcomed the change. Too many competitors had been devastated in previous years, losing irreplaceable gear to brutal defeats. The new system offered protection, a buffer against catastrophic loss.\n\nNow, twenty minutes into the Demon King subjugation, they finally understood why.\n\n[The Durnehild Shield has lost all durability and has been destroyed!]\n\n[Destroyed items will automatically be restored once the gate is breached.]\n\n\"Kuek...!\"\n\nThe sound echoed from all four gates simultaneously—north, south, east, and west. Rankers who'd entered the event in legendary and unique equipment now stood in tattered rags, their prized possessions reduced to scrap metal.\n\nThe S.A. Group hadn't implemented the separate server out of generosity. They'd done it because they knew what Grid's four heavenly kings would do to anyone who challenged them.\n\n\"Cough, cough! No way...!\"\n\nAt the west gate, Weldon—Germany's representative—spat blood, his face ashen. He was a veteran of countless raids, had tanked bosses for eight-hour marathons without breaking his shield. Yet the knight called Benz had shattered it in twenty minutes. Worse still, Weldon was only one of twenty tankers, and Benz had struck him a mere fifteen times.\n\nFifteen hits to destroy a Level 8 High-grade Shield skill and a unique-rated shield.\n\nWeldon had built his character around defense, not evasion. Which meant Benz's attack power rivaled last year's Grid. No—it exceeded him.\n\n\"Four heavenly kings, then the Demon King?\" Weldon's voice cracked. \"How are we supposed to clear this?\"\n\nHis despair was infectious. No one blamed him for it. Most of Group B understood exactly how he felt.\n\nBut not everyone had given up. Half the survivors remained clear-headed, refusing to let twenty minutes of analysis go to waste.\n\n*She doesn't spam skills. She creates openings with basic attacks first.*\n\n*Her AoE attacks hit hard, but they're limited to single groups.*\n\n*High defense, no healing. The real problem is...*\n\n*...her attack power increases as her health drops.*\n\n*She's a berserker.*\n\nThe west gate's guardian, Benz.\n\nIn truth, she was Mercedes—Grid's knight, a legendary warrior clad in the Hero King's Armor, a myth-rated masterpiece whose greatest strength lay in its passive: attack power increased with every hit received.\n\nBut the players didn't know that. They saw a berserker, pure and simple.\n\n\"Berserkers have a fatal flaw,\" someone called out. \"They trade defense for attack power. Hit her hard at the right moment and we can finish her.\"\n\n\"Save your ultimates. Once she's below threshold, we unleash everything.\"\n\nGroup B had fifty-nine survivors. Forty-one had already fallen—the best players their countries could offer, cut down despite their skill. But the fallen had served their purpose. Benz's health had dropped well below seventy percent.\n\n*Just a little more.*\n\n*At thirty percent—no, the moment she hits forty percent—we strike.*\n\nGroup B rallied near Eat Spicy Jokbal, who could create instant dungeons and reshape the battlefield to their advantage. As they moved into his zone of influence, subtle buffs began to stack, the terrain shifting to favor them.\n\nCoke positioned himself between towering barriers, discarding his offensive gear for a shield and chains. Pure defense, pure crowd control. \"I'll tank until the dungeon's ready.\"\n\n\"Can you hold?\"\n\n\"With everyone here backing me up? With Teacher Peak Sword? I'll manage.\"\n\n\"Then I'm counting on you.\"\n\nEat Spicy Jokbal had faith in Coke. The man had earned his place among the Overgeared King's retainers for a reason.\n\nAnd Coke delivered. He neutralized Benz's assaults with chains and shield work, blocking her sword and creating openings for his teammates to strike.\n\nFive minutes. For five full minutes, Coke held Benz's aggro alone—though \"alone\" was generous. Priests channeled healing, paladins layered buffs, and magicians hammered Benz with spell bombardments. It looked like a duel in a narrow corridor, but it was fifty-nine against one.\n\nStill, Coke felt the strain building. Fighting a higher-level opponent drained stamina at an accelerated rate. Every impact against his shield jarred his arms. As Benz's health dropped and her attack power spiked, the priests couldn't keep pace with the healing demands.\n\n\"Coke!\"\n\nHe heard his name and dropped flat on instinct. A red streak passed overhead—Iyarugt, charged to seventy percent magic power in its special sheath, manifesting in its Excited State. The blade punched through Benz's chest, and she staggered for the first time since the battle began. Her health gauge plummeted to forty percent.\n\nIn that moment...\n\n\"...Sweet.\"\n\nIyarugt materialized—an elderly, horned demonkin savoring the air. He was Hell's greatest swordsman, a warrior who'd dueled Great Demons. Even weakened, his instincts remained sharp. He recognized Benz's strength immediately.\n\nNo time to waste. He swung.\n\n\"Great Mountain Lineage.\"\n\nMercedes activated White Tiger's Attitude—though the system displayed a different name. A skill from the World Crushing Sword of the Noble White Tiger. Defensive stance engaged.\n\nCoke switched from chains to sword. He triggered his ultimate alongside the rest of Group B. They were banking on berserker mechanics: health drops, defense drops.\n\nThey were wrong.\n\nBenz wasn't a berserker. Her armor increased attack power when damaged, but she suffered no defensive penalty. In fact, White Tiger's Attitude had just boosted her defense by one hundred ninety-eight percent, albeit at the cost of eighty percent of her attack power.\n\n\"What...?\"\n\n\"This is impossible!\"\n\nThe ultimate skills struck home—and barely dented her. Benz layered Noble Valor and Knight's Resolution, pushing her defense to absurd heights. When the barrage ended, she still had twenty percent health remaining. Purple and red aura wreathed her armor, reminiscent of Grid's fighting energy.\n\nThe bandage covering her eyes disintegrated. Deep, universe-spanning eyes locked onto the heart of Group B's power—onto Iyarugt himself.\n\n[The West Gate Guardian Benz's deep eyes are looking at you.]\n\n[Some of your stats and skills are forcibly revealed to the West Gate Guardian Benz.]\n\n[You cannot resist.]\n\n[The West Gate Guardian Benz's sharp sword energy threatens you. Strong pressure causes your body and mind to shrink back. All speeds reduced by 30%. Skill casting speed reduced by 20%.]\n\n[You cannot resist.]\n\nThe debuff hit like a hammer. No one could shake it off.\n\nThen wings erupted from Mercedes' back. Fighting energy—incomplete but devastating—surged through her armor. She moved with ultimate attack power, cutting Iyarugt down first.\n\n*This...!*\n\n*Grid's...!*\n\nOnly two people recognized her. Coke and Peak Sword, both Overgeared members, both intimately familiar with Grid's inner circle. They saw through Benz's disguise to the truth: this was Mercedes, the legendary knight.\n\nAnd with that recognition came crushing certainty. They would never reach the Demon King.\n\nMercedes unleashed a bombardment, black magic power radiating from her silver form. Two kills per strike. Ten kills per second.\n\nEvery ultimate was on cooldown. They'd exhausted their strength at the worst possible moment. Even the dungeon Eat Spicy Jokbal had painstakingly constructed crumbled before her assault.\n\nTotal wipe.\n\n***\n\n[Group B, which attacked the west gate, has been wiped out.]\n\n[The West Gate Guardian has received significant damage. Attack before full recovery is recommended.]\n\nThe notification appeared simultaneously before Groups A, C, and D.\n\nSilence. Grim expressions. Thirty minutes, and Group B had been annihilated.\n\nNo one criticized them. The surviving members of the other groups were too shocked by the sheer power of the heavenly kings. This wasn't weakness on Group B's part. Their opponent had simply been overwhelming.\n\nThe spectators, however, saw things differently.\n\n\"Group B was too weak.\"\n\n\"Only group without American rankers. Barely any Overgeared members, no Damian.\"\n\n\"Feel sorry for the Koreans. Would've been a good chance to snatch medals from other countries.\"\n\n\"Sorry for them? How many more articles do we need about some small nation?\"\n\n\"Mei Xiao, you can do it! Win gold and become a national hero—huh?\"\n\nThe Chinese spectators' excitement died mid-cheer. Mei Xiao was in Group C. Group C, which boasted PvP champion Zibal and Soul Predator Seuron—supposedly the highest firepower composition.\n\n[Group C, which attacked the south gate, has been wiped out.]\n\n[The South Gate Guardian has received significant damage. Attack before full recovery is recommended.]\n\nSame result. Same fate.\n\nAnd Group D—Damian, Katz, Jishuka.\n\n[Group D, which attacked the north gate, has been wiped out.]\n\n[The North Gate Guardian has received significant damage. Attack before full recovery is recommended.]\n\n\"What the hell is this...?!\"\n\nEvery eye turned to the last remaining group. Kraugel was being pummeled by a rain of seafood. Shell fragments exploded in synchronized bursts, pinning him in place. Crab claws clamped onto his Achilles tendons. Chris—ranked first overall—struggled against fishing nets. Regas and Pon wallowed in the mudflats like festival-goers at a mud wrestling event.\n\n\"...\"\n\nWould they even lay eyes on the Demon King? The world watched in collective anxiety.\n\nAll except Grid. He simply continued hammering in silence."
}