{
  "id": 953,
  "title": "Chapter 952",
  "content": "[Benz (Mercedes), the foolish yet loyal knight, has defeated all invaders. Compensation will be distributed after the competition.]\n\n[Vin (Asmophel), the eternal second-place who betrayed his comrades and earned a heart demon, has defeated all invaders. Compensation will be distributed after the competition.]\n\n[Kobold (Noll), the vampire earl who hungers for praise and affection, has repelled all invaders. Compensation will be distributed after the competition.]\n\nGrid couldn't help but laugh at the system's descriptions of his four heavenly kings. Each notification captured their personalities with brutal accuracy—amusing and bittersweet in equal measure.\n\n'If I'm going to do anything about Asmophel's situation, I need to deal with the empress soon...'\n\nWhich meant he needed more power. The revenge he'd exacted through Muto and the insane dragon iron had been satisfying, but ultimately superficial. To truly settle old scores, he needed overwhelming force.\n\n*Ttang!*\n\nGrid hammered away at the anvil, Item Auto Production handling the repetitive work while he waited for the final notification.\n\nPiaro might not be the strongest of the four heavenly kings, but he was the one Grid trusted most. And right now, he was the last one standing. The only group left was Kraugel's.\n\nDid Grid hope the players wouldn't reach him? Not at all. In fact, he *wanted* them to break through the four heavenly kings. If he could face them directly and claim victory, he'd earn greater rewards and create exactly the spectacle the Daejin Group chairman was hoping for.\n\n'They just need to suffer enough before they get through.'\n\nGrid was the only player who knew all the hidden mechanics of the Demon King subjugation event—including the fact that after every group was wiped at the four heavenly kings stage, they'd get another chance. A resurrection and re-challenge opportunity.\n\nThat's why he was so calm.\n\n'Eventually, they'll reach me.'\n\nThe event had been designed this way from the start. Legendary NPCs with an average level of 450? Realistically impossible for current players to raid. Well, it might have been manageable originally—but once Grid had armed them to the teeth, the difficulty had skyrocketed.\n\nAnd Grid had done it deliberately. He refused to let his knights look weak before the watching world. He wanted everyone to know—*his people were strong*.\n\n*Ttang!*\n\nThe cannon barrel was complete. Forty minutes since the event began.\n\n[The Demon King's perk has increased maximum health by 200,000. Total health bonus to date: 800,000.]\n\n[Cardin (Piaro), the explorer who glimpsed the universe within a single seed, has defeated all invaders. Compensation will be distributed after the competition.]\n\n\"Summoning the Reputation Store.\"\n\n[A special service for only the most distinguished celebrities!]\n\nA golden carriage materialized before him.\n\n***\n\n\"Waterspout.\"\n\nSeawater erupted from the mudflat. Mud, fish, shellfish—all of it spiraled upward in a massive vortex that writhed like a rising dragon. The sheer density of it made the technique feel less like a skill and more like a natural disaster.\n\nThe moment Kraugel saw it, nightmare memories surfaced—of being crushed to death. The farmer who'd blown away one of Great Demon Belial's arms. The waterspout before him now had a different edge to it, but the underlying energy felt disturbingly similar.\n\n\"This waterspout...!\"\n\nPlayers screamed as the column of water and debris climbed into the sky, then plummeted downward. No—they *cursed*. They'd already been tormented by absurd techniques like Flying Pebbles, Clam Digging, Crab Fishing, Drawing Octopus, Calling Seagulls, and Water Sediment. And now they were going to be crushed by a vortex of mud and seafood?\n\nIt was more humiliating than terrifying. While the entire world watched, they peeled octopuses off their faces. They were dragged into the mudflat, scratched by scallops and crabs, pecked by diving seagulls. This wasn't a glorious battle.\n\n\"You bastard fisherman...! *Ahhh!*\"\n\nRage overwhelmed them. They forgot about the audience entirely as they activated their defensive skills in desperation.\n\nThe vortex crashed down and obliterated them. The crushing weight rendered every defensive measure meaningless.\n\n\"...\"\n\nSilence descended on the mudflat. Only two figures remained standing—Kraugel and Chris.\n\n\"...He *is* the person I think he is, right?\"\n\nThe heavenly king called Cardin...\n\nWhen he'd used Plankton Sprinkling to make every shellfish in the area grow to monstrous size, Chris had begun to suspect. But he hadn't been willing to accept it—not until the waterspout.\n\nKraugel didn't deny it. \"You're right.\"\n\n\"...Then the Demon King?\"\n\n\"Can't you guess?\"\n\n\"...How are we supposed to win?\" The realization hit Chris like a hammer. The identities of the four heavenly kings and the Demon King. It was surreal—he was more terrified of Grid than he was of the fisherman standing before him.\n\n\"Retrieve Fishing Nets. Shoot Ink.\"\n\nThe fisherman snatched two squids from nets that came flying through the mudflat and fired them like guns. Perfect accuracy—both shots struck eyes. Kraugel and Chris went blind.\n\n\"Threading Bait.\"\n\nThe fisherman moved like lightning, hooked Chris, and *yanked*. He used the momentum to launch himself at Kraugel, driving a farming spade toward his throat.\n\n\"Breaking the Shell.\"\n\nThe technique's original name was Fated to Perish—a fraudulent skill that guaranteed death. In the 0.1 seconds Kraugel had to respond, a single thought crossed his mind.\n\n*Should I burn Quick Command?*\n\n'No. Give up.'\n\nThis wasn't an opponent he could defeat even if he threw everything at it. Group A was already finished. Looking at the bigger picture, Kraugel was certain—\n\n'We'll get another chance.'\n\nHe didn't resist. Five seconds of immortality, then death.\n\nAnd he'd been right.\n\n[Group A, assigned to the east gate, has been annihilated.]\n\n[The East Gate Guardian has suffered significant damage. It is recommended to attack before full recovery.]\n\n[All challengers taste despair before the overwhelming might of the four heavenly kings!]\n\n[The first challenge has failed.]\n\n[The second challenge will now begin. All challengers are resurrected.]\n\n[The four heavenly kings' health is fully restored. However, their skill cooldowns remain unchanged, and their stats have been reduced by 30%.]\n\n[If the second challenge fails, bronze medal rewards will be removed from all medal tiers.]\n\n***\n\n*7. If participants fail to breach the gates, S.A. Group may grant a re-challenge opportunity. Implementation method to be discussed with Shin Youngwoo.*\n\nThe seventh clause of the agreement between S.A. Group and Grid. Created out of uncertainty and fear about just how powerful the four heavenly kings might be.\n\n\"So it came to this.\" Chairman Lim Cheolho chuckled as he confirmed the rankers' failed first attempt. Honestly, it was an unexpected outcome even in the event's initial planning stages. The named NPCs Grid had collected over the years were strong, certainly—but facing 100 rankers solo should have been impossible.\n\nThen came the variables. NPC growth. Grid's item-crafting ability.\n\nGrid was genuinely unusual. Other players collected named NPCs, bound them close, treated them like pets. Grid gave them *freedom*. The current situation was the result.\n\nPiaro could farm to his heart's content. Asmophel went hunting for the surviving Red Knights, atoning for his sins. Mercedes worked independently, gaining insight every time Grid was away. Noll managed the vampire city while controlling his bloodlust with Piaro's help.\n\nAll of them had grown beyond predicted parameters. And Grid's blacksmithing had improved so dramatically that his legendary and myth-rated items had transformed the four heavenly kings into absolute monsters in just a few months.\n\nFour hundred rankers unable to break through a single heavenly king? It was almost unbelievable.\n\n\"Was it intentional?\" Director Yoon Sangmin asked, baffled by the unexpected results. His tone was cautious. \"Did Grid thoroughly analyze their personalities and histories, raising them as efficiently as possible to draw out their absolute maximum potential?\"\n\nIf so, Grid was no fool. He was a genius whose past behavior had all been an elaborate act.\n\nLim Cheolho shook his head. \"It wasn't intentional.\"\n\n\"...\" Yoon Sangmin had been observing the Five Miracles alongside Chairman Lim Cheolho. His initial hostility toward Grid had faded as he watched. He understood now—Grid wasn't someone who calculated ahead. Or rather, he only calculated *after* acting. At least until last year.\n\n\"Grid's intellect is developing, but the way he fostered the four heavenly kings isn't something born from knowledge. It's possible because of his pure heart.\"\n\n\"Heart...\" It wasn't a word that seemed to fit Grid. Yoon Sangmin leaned back in his chair and laughed pleasantly. \"I think I understand why you and the development team are so fond of him.\"\n\n\"How could I not be? Grid is someone who respected our children—the NPCs—from the very beginning.\"\n\n\"You must feel sorry for him.\"\n\n\"What do you mean?\"\n\n\"Grid—the Demon King—will be defeated.\"\n\nThe first challenge ended in forty minutes. The second challenge against weakened heavenly kings would likely conclude much faster. Grid had at most an hour and a half, meaning his health couldn't exceed two million. Realistically, he wouldn't have time to craft items.\n\nChairman Lim Cheolho laughed at Yoon Sangmin's concern. \"You wrote the contract with Grid, but you still haven't grasped how much he's changed. An hour and a half? For the current Grid, that's more than enough time.\"\n\nThen he declared with certainty:\n\n\"A thoroughly prepared Grid is no weaker than the four heavenly kings. He won't be defeated easily.\"\n\nToday, Grid would become the ideal that players aspired to—a source of burning passion."
}