{
  "id": 956,
  "title": "Chapter 955",
  "content": "Grid had learned—through blood, sweat, and countless battles—how to shatter a unified front. The Seven Guilds. The Immortal Guild. The Eternal Kingdom. The Saharan Empire. Vampires. Red Knights. Each had taught him the same lesson: strike at their primal fears, and even the strongest coalition crumbles.\n\nHe'd been a slow learner. But he'd learned well.\n\n**[You have put the Sweet Candy in your mouth.]**\n**[All stats will increase by 30% for 5 minutes until the candy is melted.]**\n**[Blacksmith's Rage has been used. Attack power has increased by 25%, and attack speed has increased by 40% for one minute.]**\n\nThe moment the door burst open—its shriek echoing like the death cries of the Four Heavenly Kings—Grid unleashed everything.\n\nFear. \n\nThe oldest, simplest emotion. It spread through crowds like wildfire.\n\n'Pinnacle Kill.'\n\nTwo thousand percent attack power compressed into a single strike.\n\n\"Death Penalty.\"\n\nThe words themselves carried weight. Language shaped perception. When Seuron raised his blade to block, he was already too late. The Demon King's sword bent through impossible angles and punched through his sternum.\n\n**[Critical!]**\n\nSeuron's face froze in disbelief as his body dissolved into gray ash. Grid met the horrified stares with cold indifference. A small mercy, really—Seuron would never spread those hemorrhoid rumors again. \n\n*Truly magnanimous of me.*\n\nGrid's gaze swept past the crowd, locking onto a figure standing in the rear. Arms crossed. Perfectly still.\n\nKraugel.\n\nTheir eyes met across the chaos.\n\n\"Crazy—!\"\n\n\"Everyone calm down! Surround him!\"\n\nThe players swarmed. Shock rippled through their ranks—Seuron, a key player, deleted in one blow—but fear didn't paralyze them. These were professionals. They didn't mourn. They adapted.\n\nShield-bearers formed a wall. Spear-wielders probed for openings. When the Demon King's sword flashed out in retaliation, shields intercepted. Forced back, he vaulted skyward.\n\n'Fierce.'\n\n'This is the real thing...'\n\nThe momentary stalemate gave them time to truly *see* him. Long black hair spilling past three horns. Red eyes burning behind a gray mask. Wings spread wide. Hands oversized, tipped with blade-like claws. His posture radiated contempt, as if they were insects beneath his notice.\n\nEven his name was different. While most Named NPCs bore gold lettering, **<span style=\"color:darkred;border:2px solid gold;padding:2px;\">Demon King</span>** pulsed in deep crimson framed by gold. Extraordinary. Oppressive.\n\n\"SCATTER!\"\n\nChris's roar broke the spell. The sky *opened*.\n\nRain hammered down. Players scrambled backward—but they'd surrounded him too tightly. Distance became a luxury they couldn't afford.\n\nThe Demon King dropped like a meteor, one massive hand clamping over a tanker's face.\n\n\"Storm of Slaughter.\"\n\nWind *screamed*. Rain lashed horizontal. Lightning exploded in cascading chains, each bolt acting as both repellent and magnet—shields jerked from grips, weapons torn away by invisible forces.\n\nThose who escaped the perimeter could only stare, mouths agape. German representative Weldon hung limp in the Demon King's grasp, a gazelle in a lion's jaws. Lightning coiled around them both in a corona of destruction. Dozens of players combusted into gray pillars. Blood mixed with rainwater. Steam hissed where rain met lava, shrouding the battlefield in hellish fog.\n\n\"Weldon! MOVE!\"\n\n\"Snap out of it!\"\n\nThe German contingent's desperate shouts went unheard. How could the Demon King's grip be so strong? But no—Weldon was ranked 6th among guardian knights. He had escape skills. Physical restraint alone shouldn't hold him.\n\nWas it fear, then? Partly. Anyone who'd watched Seuron die would be terrified. But tankers *lived* in fear. Confronting it was their job. So why—\n\n\"Hngh...\"\n\nThe fingers pressed against his forehead, cheeks, throat. Each touch sent *pleasure* cascading through his nerves. Weldon's breathing grew ragged. He didn't *want* to escape.\n\nThe rankers who noticed his flushed face understood immediately.\n\n'Bewitchment magic.'\n\n'Incubus-type? Makes sense—he's got the looks.'\n\n'Shit. This complicates things.'\n\n\"GET YOUR HEADS IN THE GAME!\" Goshar thrust his hands forward, encasing Weldon in protective earth. \"SHIELDS UP!\"\n\nThe command mobilized them. Melee fighters unleashed ranged skills. Mages stacked barriers over allies trapped in the storm's radius.\n\nToo late. The candy-buffed Grid had already carved through them. Rankers who'd survived mere *seconds* in the field staggered toward death.\n\n\"This damage...!\"\n\n\"Where are the survivors?!\"\n\nGray pillars multiplied. Mages frantically searched for living targets, but bodies turned to ash faster than they could heal. Futile.\n\n\"Regas, stop.\" Pon caught his friend's arm before he could charge into the maelstrom. His gaze shifted to Jishuka.\n\nBehind her, a massive firebird materialized.\n\n\"Fly Up!\"\n\nThe Red Phoenix *screamed* skyward, raining fire across the battlefield. Unlike Grid's reproduced legendary bow, Jishuka's myth-rated original wielded devastating power—and its flames *healed* allies.\n\n\"YES!\"\n\nPlayers and spectators alike had witnessed this technique obliterate heavenly kings while saving dozens. They didn't doubt it would break the Demon King's stranglehold.\n\nThe Demon King's laugh was a blade against glass.\n\n\"*Pathetic*.\"\n\nHe reached up almost lazily. The colossal phoenix *vanished* into his palm like smoke.\n\n**[Skill Deleted]**\n\nDark Bus' Ring. Grid had come prepared to burn every card in his deck. Not just for the rewards. For *her*.\n\n*You're not escaping me, Yura.*\n\nFrozen players gawked at empty air where the phoenix had been. Grid turned toward the camera, his message clear.\n\n---\n\n『What—was that a *taunt*?!』\n\n『He's staring right at us!』\n\nThe commentators recoiled as the camera zoomed on the Demon King's masked face. That expression seemed to say: *Your heroes are insects. Watch them squirm.*\n\nGrid would've been mortified. He'd been trying to smile *gently* for Yura. Instead, the world saw pure malevolence.\n\n『The storm lifted!』\n\n『Strong skill, but short duration. Long cooldown, most likely. The players need to capitalize—NOW!』\n\n『Regas and Pon are engaging! Pon's spear pins his foot—Regas' kick snaps his head back! Beautiful coordination!』\n\n『Damian's buffs focus on Chris and Jishuka! Chris swings—the Demon King dodges! He's hyper-aware of Chris's threat level!』\n\n『Even so, Jishuka's arrow finds its mark! Right through the chest!』\n\n『The Demon King can't swing his sword!』\n\nBrilliant tactics. Jishuka knew the Demon King's defense and health eclipsed the Heavenly Kings'. Rather than aim for his heart, she targeted his sword-arm, creating mechanical constraints through injury. When he tried switching hands—\n\n『Mei Xiao's silk binds his left arm!』\n\n『Katz and Peak Sword press the advantage!』\n\nFour hundred versus one. Players who'd conquered the Heavenly Kings twice now operated like a well-oiled machine, hammering the seemingly invincible Demon King from all angles.\n\nCheers erupted. The crowd roared.\n\nThe Overgeared members felt ice in their veins.\n\n'*It's a trap.*'\n\nGrid never fought defensively without reason. He was *baiting* them, letting damage accumulate toward some goal—\n\n**—Kuhahahaha!**\n\nDemonic laughter echoed from the *east*. Heads snapped toward the sound. Panic rippled through the formation.\n\n*The Demon King we're fighting is a clone. That's the real one!*\n\nWrong. The laughter was an Alarm spell—misdirection while Grid slipped the noose.\n\n\"I'll take payment now.\"\n\n\"—?!\"\n\nEyes swiveled back. The Demon King stood outside the encirclement, untouched.\n\n\"Kneel Down.\"\n\n**100,000 Army Blockade Sword.** Twenty percent damage to all visible enemies. Three-second *blockade*—total immobilization, skill and magic lockout. A technique that devoured fighting energy but wielded apocalyptic power against masses.\n\nEvery player, mid-swing or mid-cast, crashed to their knees simultaneously.\n\nSilence swallowed the stadium. Hundreds of rankers *kneeling* before a single entity.\n\n\"Kh...! Nngh...!\"\n\nThe battlefield became a graveyard of the living. Confusion. Terror. Rage. All rendered moot.\n\nOnly one man remained standing.\n\nSword Saint Kraugel, arms still folded, gaze locked on the Demon King.\n\nEvery spectator willed him to act. *Save them. You're the only one who can.*\n\nKraugel didn't move.\n\n\"Let's settle this in the finals.\"\n\nLast year's promise echoed between them. Kraugel refused to break his word with Grid—even if it meant defeat. Even if the world condemned him.\n\n*We fight one-on-one.*\n\nGrid read the message in those unwavering eyes as his hand closed around Chinese representative Mei Xiao's throat.\n\nHis answer was clear.\n\n*Agreed.*"
}