{
  "id": 957,
  "title": "Chapter 956",
  "content": "**[Party Member 'Mei Xiao' has died.]**\n\n\"No!\"\n\n\"Damn it!\"\n\nCries of fury and disgust erupted across the battlefield as Mei Xiao collapsed, her body dissolving into motes of grey light without even a chance to resist. The players watching weren't mourning a friend—they'd barely known her during the brief span of the National Competition. What horrified them was far more pragmatic: Mei Xiao possessed the rare ability to lock down high-mobility opponents. Against the Demon King, she had been irreplaceable.\n\nThat's precisely why Grid had sacrificed raw damage potential to unleash 100,000 Army Blockade Sword. Rather than scattering his assault across multiple targets, he'd immobilized everyone and executed the most dangerous threat first. Cold. Calculated. Ruthless.\n\n*I won't fall until it's just you and me.*\n\nThrough the pillar of grey light marking Mei Xiao's death, Grid's gaze locked onto Kraugel, who stood motionless in the distance. Then Grid burst skyward with **Fly**, and the world exploded into violence.\n\nDozens of arrows, daggers, and spears converged on his position from every angle. Yet notably absent was magic—not a single spell streaked toward him. The **Duke of Wisdom** effect, amplified by his Demon King manifestation, had succeeded. It warped the perceptions of every mage on the battlefield, whispering that *casting offensive magic against the Demon King would be their doom.*\n\nGrid's wings—the Demon King's twisted version of **Lantier's Cloak**—wrapped protectively around his body.\n\n**[You have suffered 5,900 damage.]**\n\n**[You have suffered 7,990 damage.]**\n\n**[Attack blocked!]**\n\n**[Attack blocked!]**\n\n**[You have suffered 7,540 damage.]**\n\n**[You have suffered 4,620 damage.]**\n\nThe bombardment continued. These weren't ordinary players—they were world-class rankers. Yet Grid weathered the storm. His four heavenly kings had endured for one hour and thirty-eight minutes. For Grid, whose total health now exceeded 1.9 million, his astronomical defense had become a more formidable weapon than any blade.\n\n*He's actually surviving this!*\n\n*Please tell me he doesn't have self-heals. If he can regenerate, we'll be here for half a day!*\n\nBeneath their disciplined facades, the players were rattled. Skills that should have torn through defenses were blocked outright or dealt pathetic four-digit damage. They switched to basic attacks—faster activation, easier to chain—yet even collectively, they'd barely shaved 100,000 health from the monster. Considering that most participants wielded unique-rated or legendary weapons, the Demon King's defense defied reason.\n\n\"The hell? Is he covered head to toe in myth-rated gear?\"\n\n\"His stats are insane.\"\n\n\"Get out of the way!\"\n\nJust as morale began to fracture, a white horse surged across the rocky terrain toward the airborne Demon King. Atop it sat one of the Overgeared Kingdom's 10 meritorious retainers—curly hair, neatly trimmed beard, bronze skin, and deeply set eyes that had made him a heartthrob across South European audiences for years.\n\nPon.\n\n\"Going full power. Watch yourselves.\"\n\nThe Overgeared members knew the Demon King's true identity. Pon knew. Yet he didn't hesitate. Grid had manifested as an enemy on the grandest stage in Satisfy, where honor and rewards were everything. Friendship had no place here.\n\n\"**Rail Spear!**\"\n\nPon's grip tightened. The spear in his hands became a lance of compressed white light—impossibly straight, impossibly fast. It carved a luminous boundary across the sky like a comet tearing through the void.\n\n**[You have suffered 41,300 damage!]**\n\n\"Gah—!\"\n\nThe blow struck true, punching through Grid's back. **Rail Spear** ignored a percentage of defense by sheer velocity alone, and Grid hadn't dodged. Pain exploded through his spine as the white horse below stumbled back to earth. Pon grinned up at the Demon King.\n\n\"Hurt, does it?\" He patted the black spear forged from Belial's remains. \"Courtesy of our guild master.\"\n\nPride saturated every syllable. Pon, Jishuka, all of them—they'd become this strong because of Grid.\n\nGrid smiled behind his mask.\n\n*I could only make those items because of all of you.*\n\nBut he couldn't speak those words. Not as the Demon King.\n\nMore wyvern riders descended from above, unleashing torrents of flame. Grid spun like a top, blade extended toward the eight players who'd followed Pon's lead and launched themselves from the ground.\n\n\"**Link.**\"\n\n\"…!\"\n\nWhere Pon's **Rail Spear** had drawn a single perfect line, Grid's **Link** painted thirty. The individual blades were weaker and lacked Rail Spear's auto-hit property, but they overlapped, multiplied, became *inescapable*. And Grid's base stats and equipment already eclipsed Pon's.\n\n\"Koff!\"\n\n\"Gahk—!\"\n\nAll eight players had believed they could replicate Pon's success. Instead, they disintegrated into grey light before hitting the ground. Blood splattered across the rocks and froze where it landed.\n\nThe commentators fell silent.\n\n『The players... couldn't react to that attack?』\n\n『No, the assassins reacted. They tried to dodge mid-air, but without flight abilities, they had no leverage.』\n\n『Perfect defense, overwhelming offense... I genuinely don't know who can bring him down. I'm not even playing and my head is pounding.』\n\n『The optimal strategy was Player Jishuka and Player Mei Xiao maintaining crowd control. With Mei Xiao gone...』\n\n『Wait. Hold on. This is...』\n\n『...』\n\nAcross multiple broadcast booths, commentators went quiet almost simultaneously. Because when they listed the Demon King's attributes—incredible durability, devastating damage, flight capability, field magic—one name kept surfacing.\n\n*...Grid?*\n\nYes. The Demon King's combat profile matched Grid's almost perfectly. But none dared voice it. The Demon King lacked Grid's signature floating golden hands. More importantly, the Demon King seemed *stronger* than Grid. If they mentioned the comparison, it would create the absurd equation: **Grid > Demon King > 400 world-class players**. Better to say nothing.\n\nMeanwhile, portions of the audience—particularly Chinese viewers—erupted into outrage.\n\n\"Kraugel, what the hell are you doing? Why are you just standing there?\"\n\n\"Kraugel *let* Mei Xiao die! He let China's star get picked off!\"\n\n\"He's waiting for everyone else to exhaust the Demon King so he can swoop in for the medals! Pathetic!\"\n\n\"Despicable country-hopper!\"\n\nThe accusations were irrational—players had no obligation to protect each other when contribution determined rewards. But rationality meant nothing to people watching their nation's sole hope die. Other countries' audiences found the finger-pointing absurd.\n\nStill, some whispered:\n\n\"Even so... it is pretty disgusting.\"\n\n\"Yeah. Everyone's cooperating except him. He's just being blatantly greedy...\"\n\n\"Guess he doesn't care about his image anymore after losing first rank. Let's see if he can solo the gold medal like he's planning.\"\n\n\"If he doesn't get gold after this, he'll never live it down.\"\n\nKraugel had anticipated this reaction. He didn't care. He'd entered the National Competition for Grid, not glory.\n\n『Ah! The players are mounting a counteroffensive!』\n\nAmid the turbulent atmosphere, the commentators' volume surged. Japan's representative, **Katz**, gathered blood from fallen allies across the battlefield.\n\n\"**Blood Spear.**\"\n\nEight crimson lances materialized and skewered the Demon King. **Regas** vaulted upward to deliver a devastating strike while **Zibal**, mounted on his pegasus, slammed Grid with crushing waves of mystical energy.\n\n**[The pegasus' aura is consuming your mana.]**\n\n**[The pegasus' aura is consuming your stamina.]**\n\n**[The pegasus' aura is slowing fighting energy accumulation.]**\n\n**[The pegasus' aura is reducing mana regeneration.]**\n\n**[Resistance failed.]**\n\n*Troublesome. No wonder he beat Yura.*\n\nThe pegasus passively drained the resources of all enemies within range while crippling regeneration. A devastating counter to Grid, whose Demon King transformation granted massive health and stamina bonuses but *nothing* for mana. Every skill he used consumed enormous mana reserves. The pegasus was a direct threat.\n\nFor a moment, Grid considered activating **Transcend** to eliminate it. But the battlefield was vast, the pegasus swift, and layers of overlapping shields from a dozen mages sealed every approach vector. There was no opening.\n\nThen the Overgeared members pressed their assault—Chris, Jishuka, Regas, Pon, Katz—and Grid felt his fighting spirit ignite.\n\n\"**1,000 Ton Sword!**\"\n\n**Chris's** ultimate technique slammed into Grid's chest.\n\n**[You have suffered 61,700 damage!]**\n\n**Jishuka's** arrow pierced his thigh before he could trigger **Revolve**, and the damage stuck. Chris alternated between Grid's Greatsword and Yetima's Greatsword, his **Tyrant** class amplifying his strength to rival Grid's own. The players watched the Demon King's health gauge drop by a full tenth and dared to hope.\n\n**[The Sweet Candy has dissolved. All stats will return to normal values.]**\n\nGrid's buffs expired. Yet he smiled.\n\n*Five minutes...*\n\nHe'd survived five minutes alone against four hundred. That was all he needed.\n\n**[Cannon Aiming at the Battlefield]**\n\n**[Rating: Legendary**  \n**Durability: Infinite | Attack Power: 6,500~11,300**\n\n**Effect:**  \n* Automatically generates, loads, and fires shells every 1-5 minutes. Longer charge time = greater damage.  \n* +50% Lightning Damage  \n* +10% Divine Damage  \n* +50% Damage vs. Humans/Humanoids  \n* +200% Damage vs. Structures  \n* Inflicts splash damage (50% of direct hit) in a 10-meter radius.  \n* Chance to generate magnetic field on firing.\n\n*A cannon forged by melting the blade Grid created to enlighten a god. Enhanced Blue Dragon's Breath and Astaroth's Horn form the shells. Pavranium operates the mechanism.*\n\n*The pavranium's ego focuses solely on aiming and firing at the owner's designated target, not protection.*\n\n**Conditions of Use: Grid, Pagma.**  \n**Weight: 6,150**]\n\nUp to 11,300 attack power. One-to-five-minute cooldown. Devastating siege potential. The golden cannon had already shattered the front line's defensive formation. Now it tracked Zibal and his pegasus in Grid's field of vision.\n\n\"**Shoot!**\"\n\n\"—!?\"\n\n*Who's he yelling at?*\n\nThe players were momentarily baffled by the Demon King's abrupt command, but none turned to look. They'd been tricked once by his feints. Only fools made the same mistake twice.\n\nZibal ignored the shout as well, focused entirely on maintaining the pegasus' health. His reaction came too late.\n\n\"Zibal!\"\n\n\"...What?\"\n\nA sphere wreathed in crackling lightning arced through the sky—watermelon-sized, glowing ominously. The shell that had demolished the mage formation now streaked toward him in real-time. Zibal read the trajectory with crystal clarity: the pegasus was the target. He had no choice.\n\n\"**Raiders!**\"\n\nSomething plummeted from above. The white magic machine—over five meters of reinforced plating—interposed itself between Zibal and oblivion. Thunder split the world. **Raiders** absorbed the cannon blast and pitched backward, systems screaming.\n\n\"*Insane!*\"\n\nAs a war machine, **Raiders** reduced damage from siege weapons by an enormous margin. Yet *one hit* had nearly crippled it? Zibal dismissed the pegasus and frantically boarded Raiders as it crashed.\n\n\"Scatter.\"\n\nThe Demon King unleashed a rolling wave of dark energy, forcing every player back. Then his gaze locked onto Raiders.\n\n\"**Baal's Eyes.**\"\n\n**[Analyzing target item's stats, options, and production method.]**\n\n**[Item Replication skill activated!]**\n\n**[Dismissing Triple Layers. Equipping Valhalla of Infinite Affection.]**\n\n**[The legendary-rated 'Triple Layers' will serve as material for the artifact-rated 'Magic Machine: Raiders'.]**\n\n**[Replication duration: One day. At the end of this period, the replicated item will be permanently destroyed!]**\n\nFrom the moment Grid first laid eyes on the magic machine, he'd dreamed of this. Zibal's triumphant return had been a gift.\n\nA mount... To operate something so foreign, Grid unleashed a power he'd never before used in combat.\n\n\"**Granting an Ego.**\"\n\n**[The soul of legendary great magician Braham has been implanted into Magic Machine: Raiders.]**\n\nBeneath the Demon King's feet, a pitch-black giant opened blazing eyes.\n\n\"Ah... *Ahhh...*\"\n\nThe world held its breath."
}