{
  "id": 958,
  "title": "Chapter 957",
  "content": "The crowd erupted. Viewers across the world leaned forward in their seats. Raiders descended onto the battlefield like a titan of myth, and the roar was deafening.\n\nYura. Chris. Two powerhouses who couldn't withstand this white colossus. If they fell, surely the machine could crush the Demon King. The players who'd begun to despair after witnessing the King's overwhelming strength felt hope reignite in their chests. This was Raiders—the artifact that could dispel frustration and banish hopelessness with its mere presence.\n\n\"Zibal!\"\n\n\"Go! You can win this!\"\n\n\"ZIBAAAAL!\"\n\nHumanity united under a single banner, chanting one man's name. In that instant, Zibal achieved what he'd always dreamed of—he became the protagonist of the world.\n\nRaiders knelt like a knight swearing fealty. Zibal strode up its leg and knee, leaping into the boarding seat embedded in its chest. His roar echoed across the battlefield: \"Believe in me!\"\n\nTwenty-one seconds. That was the maximum operational time Zibal could sustain. But Raiders' attack power exceeded ten thousand. Its agility might lag, but the sheer scale of its body and weapon compensated with devastating accuracy. And Zibal possessed the Ancient Rider class—a unique ability that amplified his mount's performance beyond normal limits.\n\nHe didn't doubt the damage he could inflict if he pushed Raiders to its absolute peak. This wasn't arrogance. This was confidence earned by defeating Yura and Chris directly. To honor them, to honor their sacrifice, he had to trust in Raiders' strength completely.\n\n*I have to win the gold medal.*\n\nHe reached for the synchronization—\n\n\"Baal's Eyes.\"\n\nThe Demon King's voice drifted across the arena, languid and faintly amused.\n\nReality twisted.\n\nThe black armor hovering before the Demon King began to shift. Hundreds of thousands of fragments scattered like a flock of startled crows, then reassembled. The armor lengthened, compressed, expanded—cycling through forms in the span of a heartbeat.\n\n\"What—?\"\n\nThree seconds. That was all it took.\n\nWhere armor once stood, a giant now towered. Sleek dragon scales wrapped around black metal. A magic machine—identical in form to Raiders save for its obsidian coloring.\n\n\"What the hell is this...?\"\n\nThe Demon King had a magic machine.\n\nPlayers stumbled backward. The commentators fell silent. The crowd screamed. Across living rooms worldwide, viewers dropped their snacks, hands frozen mid-reach.\n\n—*Hello? Hello?*\n\nEvery Korean household trying to order chicken went quiet. Confused restaurant owners stared at suddenly silent phones. The phenomenon was so shocking that an entire nation forgot about fried chicken.\n\nThe Demon King had thrown the world into chaos.\n\n***\n\n\"That looks just like Zibal's machine.\"\n\n\"It's summoned by the Demon King. It won't be weak.\"\n\nThe quickest high rankers began analyzing the black colossus. Meanwhile, every member of Overgeared stood frozen in disbelief—the same players who'd been confidently leading their allies mere minutes ago.\n\n*Grid isn't the Demon King?*\n\nThe ones drowning in confusion were the Overgeared members themselves. They *knew* Grid was the Demon King. But Grid summoning a magic machine?\n\n*But Grid doesn't have a magic machine...*\n\nYet there it stood.\n\nWhich meant... the Demon King wasn't Grid.\n\n\"...How embarrassing.\" Pon covered his burning face. He'd been shouting at the Demon King earlier like they were old friends, thinking it was Grid the entire time.\n\n*Of course Grid couldn't fight 400 people alone. What a ridiculous mistake, all because of those four heavenly kings. Wait...*\n\nPon was Grid's friend and comrade, but he wasn't Grid himself. He didn't know every facet of Grid's abilities—certainly not the Eyes of Pagma-Baal's Contractor Version. He'd never dreamed Grid could copy artifacts.\n\nA shout snapped him from his thoughts.\n\n\"What?! How—why do you have Raiders?!\"\n\nZibal's voice cracked across the battlefield from his boarding seat.\n\nHe was shouting at the Demon King. Five meters tall, with two golden horns and eyes burning emerald green. Unlike Zibal's pure white Raiders, this machine was midnight black. But otherwise? From the mana boosters mounted on its back to the tip of its head to the soles of its feet—every structure, every rivet, every curve matched Raiders perfectly.\n\nOthers might not notice immediately. But Zibal recognized it at first glance. He'd been with Raiders for over a year. Every morning started with maintenance, with cleaning, with learning every inch of his partner.\n\nHe didn't understand. \"HOW DO YOU HAVE RAIDERS?!\"\n\nThe empire had excavated exactly four magic machines in recent years. Each possessed different appearances and characteristics—unique as people. Scholar Corlei of Fourth Prince Edan's court had studied ancient texts and confirmed: no two artifacts were identical.\n\nYet here stood a perfect duplicate.\n\nConfusion gave way to outrage. Raiders was his *soul companion*. This thing dared to wear his partner's face. Zibal's vision tinged red seeing it stand beside an AI, watching the S.A. Group hand this ability to a boss on a silver platter...\n\n\"Hoo... Hoo...\" \n\nZibal forced the anger down. Losing his composure in battle was suicide.\n\n*If I get worked up and charge in, it'll just waste time and resources.*\n\nReaching a decisive blow would be nearly impossible if the black machine matched Raiders' specs. Worse, the Demon King's magic power clearly exceeded his own—meaning longer operational time.\n\n*I shouldn't have summoned it at the start.*\n\nDecision made. To overcome the S.A. Group's machinations and vindicate both himself and Raiders, he'd defeat this Demon King.\n\n\"Listen up! The magic machine functions as a mount!\"\n\n\"...\"\n\nThe players tensed as the black giant loomed. They understood Zibal wanted to share strategy, but revealing how to counter his absolute weapon? Exposing that to the entire world? No player would ever—\n\nZibal was making a noble sacrifice.\n\nHis willingness to defeat the Demon King shone through every word. The players' morale surged as they grasped his resolve. Several high rankers and Overgeared members felt genuine admiration. The reason Zibal could reveal his weakness was confidence. Total confidence that even knowing the strategy, the world couldn't threaten him and Raiders.\n\n*It's not a bluff. The machine still has hidden potential.*\n\n*Or he's confident he can develop it further.*\n\n*Zibal... After two years away, he's changed completely.*\n\nIt wasn't an overestimation. Zibal genuinely possessed that confidence. Even revealing the strategy wouldn't compromise him—the machine had untapped potential, and his Ancient Rider class provided unique advantages.\n\n\"The machine can't operate unless someone boards it directly. It runs on mana and burns through it rapidly. Even the continent's ten great magicians can only maintain operation for three minutes maximum. Using Mana Drain to extend that? Theoretically possible. But the pilot can't cast any skills or magic while piloting.\"\n\nInformation flooded out—data useful beyond just this battle. The players absorbed every word. They didn't know when the Demon King would strike. Though strangely, it felt like the King himself was listening with genuine interest.\n\n\"Ultimately, the best strategy is buying time. All of you are skilled enough for that. The machine lacks ranged attacks. Remember my fight with Yura and Chris? It swung the spear. At four meters, it might *feel* ranged, but...\"\n\nNow came the critical information. Zibal revealed one physical weakness to the world—just one.\n\n\"Keep maximum distance and target the boosters on its back. You won't break them—the durability's too high. But every hit disrupts the mana flow and restricts movement. Target the boosters relentlessly.\"\n\n*I'll need to reinforce that vulnerability immediately through upgrades.*\n\nThe 350 surviving players wore expressions of grim determination.\n\n*Noble of him to reveal his weakness.*\n\n*We won't let his choice be in vain. We'll stop the Demon King.*\n\nEvery player respected Zibal in that moment. Of course, that respect had an expiration date. They'd compete against him eventually at future National Competitions. They had to remember this weakness, exploit it later. Mock him for being a fool.\n\nZibal simply grinned.\n\n*I'll be stronger by then.*\n\nMagic machines were classified as items—enhanceable items. Artifact-rated, true, probably as difficult to enhance as myth-rated equipment. But the bonuses from each enhancement level were extraordinary. The booster weakness he'd revealed today? Easily compensated with a single upgrade.\n\n*The problem is needing at least twenty enhancement stones per attempt...*\n\nAnd success rates in the decimals. But Zibal believed that with enough blessed enhancement stones from this year's rewards, enhancing Raiders was achievable. After confirming battlefield signals with the other players, Zibal dismounted and recalled his machine.\n\n\"Recall, Raiders.\"\n\n*The moment I summon it again is when I'll deal the killing blow.*\n\nHe summoned his two-headed hippopotamus—the mount that boosted his and his party's defense. Then he locked eyes with the Demon King, who'd stopped using Fly and now stood atop the black machine's head.\n\nBattle cries erupted across the field:\n\n\"Ranged DPS, attack the moment he enters the boarding seat! Unload everything!\"\n\n\"Magicians, this is your time! Hit those boosters the instant it moves!\"\n\n\"Focus the cannon for now! Swords and spears can't reach it anyway!\"\n\n\"A great magician can run it for three minutes tops! We just need to survive that long!\"\n\n*Move, Demon King.*\n\nThe players focused with laser intensity, running through scenarios. Arrows would blanket the boarding seat. The Demon King would abandon his terrifying field magic and swordsmanship for the machine's power. Then, when he dismounted and revealed himself, Raiders' spear would pierce his chest. Victory was inevitable.\n\nThen—\n\n\"Huh?\"\n\n\"...Wait, what?\"\n\nReality diverged from expectation.\n\nThe Demon King didn't board the machine. He stood on its head, arms crossed arrogantly.\n\nSo why—\n\nWhy was the magic machine moving?\n\nAn unpredicted variable materialized instantly. Confused players whirled toward Zibal.\n\n\"...What the fuck?\" \n\nZibal sat frozen on his hippopotamus, jaw hanging open. He had no advice to give.\n\n\"How is it? Adapted yet?\" The Demon King murmured to the machine.\n\nAn answer echoed in his mind: —*I was delayed fixing some messy procedures.*\n\n\"Can you use magic?\"\n\n—*Theoretically possible with modifications, but my soul is too weak. As is, I'm limited to basic spells.*\n\n—*Mana Drain.*\n\nBraham—the legendary great magician. The genius who'd created a massive golem army that nearly destroyed the Eternal Kingdom.\n\nMana saturating the atmosphere and earth surged toward the dark machine. Output far exceeding Raiders' capacity flooded in. The boosters held three times Raiders' magic power. The result?\n\nThe boosters became three times faster.\n\nA colossal spear swept across the battlefield like a pillar from the Parthenon. An eraser meant to obliterate every player in its path.\n\nIt had enthusiasm.\n\nJust no accuracy.\n\n\"Why aren't you hitting anyone?\"\n\n—*I have no experience fighting physically with my own body.*\n\n\"...Jesus Christ.\"\n\nWell, Grid didn't need to worry—Braham could still use basic magic. He laughed as a skill triggered.\n\n\"Divinity. Baal's Eyes.\"\n\n[**Checking the target item's stats, options, and production method.**]\n\n[**The Item Replication skill is activated!**]\n\n[**The legendary-rated item 'Failure' will be used as material for the myth-rated 'Red Phoenix Bow.'**]\n\nHe had to slaughter as many enemies as possible while the machine lasted. Non-negotiable. The black colossus continued moving. Without losing balance, Grid drew back a bowstring that materialized from nothing.\n\nA red phoenix screamed across the sky.\n\n\"No fucking way—what is this?!\"\n\n\"That bastard has no conscience!\"\n\nCurses erupted from every throat.\n\nYes—even Zibal had a conscience. Which meant he wasn't qualified to be the protagonist yet. True protagonists acted alone. True protagonists had no conscience whatsoever."
}