{
  "id": 959,
  "title": "Chapter 958",
  "content": "# Chapter: The Demon King's Wrath\n\n## [Magic Machine: Raiders]\n\n**[Rating: Artifact**  \n**Durability: 12,540/15,888**  \n**Attack Power: 13,888 | Defense: 9,888**\n\n**★ Enhanced by transcendent knowledge: Pilot's intelligence now links directly to Raiders' performance.**\n\n**★ Enhanced by transcendent knowledge: Mana consumption increased to 2,964 per second. Raiders operates at triple output.**\n\n**★ Enhanced by transcendent knowledge: Pilot may now cast magic and use skills. WARNING: Resource-intensive abilities risk severing the neural link.**\n\n* Passengers without Rider class proficiency cannot utilize skills aboard Raiders.\n* Raiders consumes 988 mana per second. Rider class pilots consume 588 mana per second. Raiders will forcibly eject when pilot's mana depletes.\n* Pilot cannot be harmed until Raiders' durability reaches zero.\n* Primary Weapon - Spear Calling Out for Destruction: Weight exceeds conventional measurement. 95% chance to inflict Fracture or Stiffness. 100% chance to severely reduce target's equipment durability.\n* Secondary Weapon: Locked to riders who have mastered Supreme-grade riding techniques.\n* Tertiary Weapon: Information available only to pilots achieving perfect synchronization.\n* Raiders resists abnormal status conditions (physical conditions excepted).\n* Reduces magic and siege weapon damage by 40%.\n* Deals 150% additional damage to fortifications.\n* Deals 80% additional damage to all races except gods and dragons.\n\n*The Saharan Empire has excavated four magic machines from ancient ruins. Information regarding these artifacts remains scarce across all historical and mythological records.*\n\n**Boarding Requirements: Level 300 or higher.**  \n**Weight: Immeasurable.]**\n\n---\n\nRaiders wasn't something you wore—it was something you *became*. Anyone meeting the level requirement could pilot it, but only those with true riding mastery could unlock its devastating potential. Without the Rider class, a pilot's personal stats meant nothing to the machine.\n\nEven so, Raiders was a beast.\n\nAfter level 300, each point of strength granted 0.7 attack power. Grid's **+4 Enlightenment Sword** boasted **4,611 attack**. Each stamina point gave 0.9 defense. His **+3 Valhalla** provided **1,622 defense**. Even combining his full battle regalia—helmet, gauntlets, boots, cloak—Raiders' raw specifications *doubled* his output.\n\nAnd that wasn't counting the fractures, the stiffness, the sheer devastation it inflicted on enemy equipment.\n\nNo wonder Chris fell.\n\n*'The empire has four of these monsters?'*\n\nGrid's jaw tightened. Through Raiders' specifications, he'd glimpsed the true might of the Saharan Empire. The legendary Grandmaster Zikfrector—the strongest NPC Chairman Lim had ever mentioned—served that empire. The thought of facing such overwhelming power sent ice through his veins.\n\n*'I'm afraid.'*\n\nHe wouldn't deny it.\n\n*'But I have no choice.'*\n\nGrid drew the copied **Red Phoenix Bow** to full extension, steadying his breathing. The empire dreamed of continental domination. They would come for the Overgeared Kingdom regardless. Beyond strategy, beyond politics, he carried a personal obligation—Piaro's vengeance. Asmophel's vindication.\n\nThis was inevitable.\n\n\"**Fly Up!**\"\n\nThe crimson phoenix erupted from his bowstring, streaking toward the magician line. Those ice blossoms slowing Raiders, those sand constructs grabbing at its limbs, the constant explosive barrages against the boosters—the spellcasters were the true threat.\n\n\"Not on my watch!\"\n\nCoke dashed forward, shield raised between the phoenix and his allies. Sweat poured down his face.\n\n*'Just... survive one hit.'*\n\n\"**I will be a barrier to defend my allies!**\"\n\nThe skill activated—**Wall of Protection**, the technique Vantner himself called \"the strongest shield in the world.\" Translucent barriers materialized around Coke's shield, forming a towering wall of force. Could it withstand the Demon King's phoenix, which blazed hotter than even Jishuka's divine flames?\n\nThe crowd held its breath.\n\n\"Tsk.\" Grid clicked his tongue, already anticipating the block. Wall of Protection excelled specifically against projectile attacks. More importantly, he knew Coke's capabilities firsthand—the Overgeared Kingdom's secret weapon.\n\nThe phoenix *slammed* into the barrier.\n\nFire exploded across the battlefield. Embers rained like hellfire. Cheers erupted from every corner of the arena.\n\n\"Holy shit, he actually stopped it!\"\n\n\"I thought Haster would be this year's rising star, but—\"\n\nCoke consistently exceeded expectations. Every performance elevated his reputation among international rankers. Of course, compared to Grid himself, the gap remained astronomical.\n\nGrid stood atop Raiders' head, black flames deflecting the ambient magic bombardment. The Demon King raised the **Red Phoenix Bow** again. This time, twin phoenixes materialized simultaneously.\n\n**[God's Command activated! Cooldown reset!]**\n\n\"You've got to be kidding—\" Coke's face went ashen. He tried raising his shield, but his arms trembled violently. That first collision with the divine flames had mangled the muscle beneath his armor.\n\nRankers rushed to support him, but Grid had already shifted targets. The first phoenix streaked toward Coke as a feint. Mid-flight, it curved *over* his head like a living predator, diving toward the magicians behind him.\n\nThe flames moved with surgical intelligence. Grid's mastery far exceeded Jishuka's—and the **Elf Thimble** transformed his area-of-effect attacks into precision strikes.\n\nMore than ten magicians incinerated before they could scream.\n\n\"How the hell does he shoot that well?!\"\n\nTen minutes. The battle had barely lasted ten minutes, yet the Demon King kept revealing new layers of power like peeling an onion.\n\n*'What was even the point of Grid not being here?'*\n\nThey'd celebrated his absence. Dreamed of championships without that overwhelming presence. Instead, the fox reigned in the tiger's absence, and his brutality made them long for the devil they knew.\n\nThe black giant leaped, breaking free from grasping earth spells. Its eyes locked onto Jishuka.\n\n\"Start with the magicians,\" Grid commanded, pulling Raiders back.\n\nJishuka posed a legitimate threat—one of the few damage dealers who could actually *hurt* him. Her arrows found gaps in his defense, whittling down his health bar. But Grid had grown comfortable with injury. Between his vampiric skills, recovery titles, and regeneration items, health had become a renewable resource. With **1.9 million HP**, he could afford to bleed.\n\n\"Priority: eliminate the spellcasters.\"\n\n*They* were the problem. Seventy remained despite his opening salvo. Their restraint magic turned Raiders from a juggernaut into a sluggish target.\n\nThe giant pivoted away from Jishuka and *charged*. Three-meter strides at triple output devoured hundreds of meters in heartbeats. Fire and smoke parted before the mechanical colossus. Magicians scattered like frightened birds.\n\nNone died.\n\n『 The Demon King's magic machine has abysmal accuracy. 』\n\n『 Agreed. Since deployment, it hasn't landed a single melee strike. 』\n\n『 Fast compared to Zibal's Raiders, but ineffective. The players must be relieved. 』\n\nCommentators and spectators relaxed. Unlike Zibal's competent piloting, the Demon King's control seemed amateurish. Just a fast mount.\n\n\"Is it half-finished?\" Players read the shift in momentum.\n\nThe Demon King's Raiders was a clumsy piece of scrap metal. This realization emboldened them. They used the stumbling giant as a springboard, climbing toward Grid himself.\n\nHe sheathed the bow and drew the **Enlightenment Sword**, black flames exploding around him to repel the assault. Items. Always reliable. Items never failed him.\n\nInside his mind, Braham's voice trembled with barely restrained fury.\n\n—*These insects dare...*\n\nBeing treated as mere decoration—a passenger in what should be *his* domain—ignited the legendary magician's pride. Shame curdled into rage.\n\n—**Fireball!**\n\n\"What the—?!\"\n\nMassive spheres of flame materialized above Raiders' head. Players whipped toward Zibal, accusation in their eyes.\n\n*'You said magic machines couldn't cast spells!'*\n\n*'You specifically said they could only use the equipped weapons!'*\n\nZibal gaped, more shocked than anyone. This wasn't ordinary fire magic—this scale, this destructive aura—\n\n\"That's **Meteor**!\" someone screamed.\n\nThe legendary spell rained devastation. Shield barriers melted like wax. Dozens of magicians became ash sculptures before crumbling.\n\n『 The... the magical output... 』\n\nThe precision, too, was flawless. Every fireball found its mark. The commentators scrambled for explanations.\n\n『 Is the magic machine itself the Demon King's true body? 』\n\n—**Wind Cutter!**\n\nThis time, a tornado manifested—but not singular. *Dozens* of blade-edged cyclones spawned simultaneously, racing across the battlefield like scythes.\n\nDr. Magic, the broadcast's resident expert, nearly leaped from his seat.\n\n『 T-That's **Chaos Tornado**! 』\n\n『 Chaos Tornado? 』\n\n『 Large-scale annihilation magic derived from Wind Cutter! The legendary great magician Braham used it centuries ago to erase the Etel tribe from existence! 』\n\nHis hysteria infected the crowd. Chaos Tornado would transform the arena into a graveyard. The magician count had dropped from eighty to barely thirty. Tanker shields resembled melted slag. Raiders emitted black smoke from its overtaxed systems.\n\nBraham's fury remained unsated.\n\n—**Chain Lightning!**\n\nThe great magician unleashed everything in his arsenal, determined to scour this *insult* from existence. Chain Lightning—a spell one grade above the basics—manifested as crackling waves four times wider than Grid's **Storm Demonic Energy Field**.\n\n\"SCATTER!\"\n\nAbsolute chaos. Three hundred ninety-nine players fled in all directions.\n\nOne moved forward.\n\nHaster—emperor of FPS games, one of Lim Cheolho's Five Miracles, inheritor of Red Sage Winfred's legacy, master of **Heroic Story**—charged directly into the lightning storm.\n\nAn orange translucent shield bloomed around him, nullifying the cascading electricity. **Heroic Story**: for ten seconds, complete immunity to all skill and magic damage. A power rivaling Grid's **God's Command**, inherited from the Seven Malignant Saints themselves.\n\nEven legendary magic shattered against that shield. Haster pierced through the spell barrage, closing on Raiders as black smoke poured from its overloaded frame. This was his moment. His debut. If he struck down the Demon King before the world, his legend would be reborn.\n\nHe believed absolutely in Winfred's teachings. In Heroic Story's invincibility. Ten seconds to demolish the Demon King, then escape unscathed.\n\nBut Heroic Story only blocked *magic and skills*.\n\nNot basic attacks.\n\n**[You have suffered catastrophic damage!]**\n\n**[You have died.]**\n\nFive seconds.\n\nHis glorious return lasted *five seconds*.\n\n---\n\nAcross the Pacific, Hurent watched the broadcast and burst into laughter.\n\n\"Welcome to my world, Haster.\" He shook his head, grinning savagely. \"You're not on his level. None of us are.\"\n\n*Pine caterpillars should stick to eating pine needles.*\n\nLike the other Miracles, Hurent had no idea Lim Cheolho had given them that title. His self-awareness had been shattered long ago.\n\nGrid did that to people."
}