{
  "id": 96,
  "title": "Chapter 96",
  "content": "Chapter 96\n\nThe notification flashed across my vision.\n\n> [You have joined the Tzedakah Guild.]\n\nI pulled up the guild information window.\n\n> **Guild Name:** Tzedakah\n> **Level:** 5 (57,630,440/100,588,127)\n> **Reputation:** 612,140\n> **Master:** Jishuka\n> **Number of Members:** 18/80\n> **Affiliation:** None\n> **Alliances:** None\n> **Hostile Relationships:** Rio Kingdom/ Fire Dragon Trauka/ Yatan Church/ Iron Style Group/ Helding Clan/ Couch Clan\n> **Inclination:** Neutral\n> **Territory:** None\n\nMy excitement drained away as I read the details.\n\n\"What is this?\" I gestured at the floating window. \"The number of members is small since it's a group of elites, fine. But you don't have any alliances or territory? And why do you have so many hostile relationships?\" I jabbed a finger at one line in particular. \"Why is a red dragon hostile to you?\"\n\nJishuka waved a hand dismissively. \"We haven't felt the need to make an alliance yet. The enemies came from quests and raids.\" She shrugged. \"Don't worry about the red dragon. He won't do anything unless we enter his territory.\"\n\n\"Putting all that aside.\" I crossed my arms. \"Why don't you have a territory? As a top level guild, shouldn't the Tzedakah Guild have a territory?\"\n\nIt had been one year since Satisfy opened. Some top guilds belonged to certain countries and built up their achievements, receiving territory from kings or nobles. The land might be barren at first, but depending on how the guild managed and developed it, those empty fields could transform into bustling cities. Huge tax revenues would follow. In other words, acquiring territory was one of the ultimate goals of a guild.\n\nSo why didn't the Tzedakah Guild have one?\n\nJishuka leaned back against the workbench. \"Grid, you're mistaken. Our guild is the strongest guild, not a top guild.\" She traced a finger along the wood grain. \"Fewer members means a limit to how much we can raise our guild level. You can see by our level that we're behind. The top guilds are estimated to be around level seven or eight right now.\"\n\nI stared at her. \"So... A bad guild with low level and no territory.\" *How can this guild make me rich?*\n\nIt seemed like I joined the wrong guild.\n\n*I should leave.*\n\nFootsteps echoed on the threshold.\n\n\"Listen to a person's words to the end.\"\n\nI turned to see Pon striding into the smithy. The spearman who'd fought so well in the raid against Malacus.\n\n\"Our guild might be low in level.\" He planted his spear butt on the floor. \"But we have steadily built up reputation through quests and raids. Many nobles and nations know about us. We've received countless offers of territory from them.\" He paused. \"We just refused.\"\n\nI blinked. \"You refused the territory?\"\n\nOther guilds were desperate to grab any scrap of land they could. They'd lick the feet of nobles and royalty for a chance at ownership. So why did the Tzedakah Guild refuse?\n\nNone of it made sense.\n\nI laughed. \"You should bluff more moderately. Why would a guild say no to territory?\"\n\n\"Because of you.\" Jishuka pointed at me with one long finger. Even that simple gesture looked seductive. \"We had to make the entire continent our area of activity while searching for the unknown craftsman. That made it difficult to have a base and manage it.\" Her gaze held mine. \"The nobles and royal families started making suggestions about us becoming their subordinates around the time of your appearance.\"\n\nMy throat went dry. \"You gave up territory just to find me?\"\n\n\"Yes.\" She nodded. \"But strictly speaking, we didn't give it up. It's just on hold for a while. We can get territory in any country we want at any time.\"\n\nI'd never imagined how much the Tzedakah Guild needed me. The weight of it settled on my shoulders.\n\n\"But why do you want me so much?\" I glanced between them. \"You know now that I have a hidden job, but at that time, didn't you just know me as a blacksmith?\"\n\n\"The reason we want you is because you're a blacksmith.\" Jishuka's tone was matter-of-fact. \"Your hidden class is irrelevant.\"\n\nPon took over the explanation. \"The average user level in Satisfy is eighty. High-level users like us are just a fraction of the two billion players, so there's always a shortage of equipment available for high-level users.\" He shook his head. \"The items with the performance we want are rarely dropped through hunting or raids. We have to rely on produced items.\"\n\nThe door to the back room opened and Khan emerged carrying a tray of refreshments. Despite being an NPC, Pon respectfully accepted the teacup offered to him.\n\n\"A blacksmith who can produce high-level items is very rare.\" Pon sipped the tea. \"Among users, there are no advanced blacksmiths. Even the advanced NPC blacksmiths are only available in major cities.\" He set the cup down. \"And those advanced blacksmiths only have a low chance of making epic or higher rated items. The burden of investing the materials and the commission fee is very high.\"\n\nJishuka picked up the thread. \"Then epic rated arrows that not even advanced blacksmiths could make appeared. We thought that the maker had the ability to produce the items we wanted.\" She smiled. \"So we earnestly searched for you.\"\n\nWarmth spread through my chest. The Tzedakah Guild recognized my abilities first and searched for me. I'd made the right decision in joining them.\n\n\"We came looking for you.\" Jishuka stood up straight. \"You have the ability we want.\"\n\nOver the next hour, all seventeen members of the Tzedakah Guild gathered at Khan's smithy. They welcomed me with enthusiasm, eyes bright with expectation. The attention made me shift my weight from foot to foot.\n\nBut something nagged at me. Not one person asked about my class.\n\n\"Isn't anyone interested in my class?\"\n\nJishuka's expression softened. \"It isn't that we have no interest. Everyone, including myself, is curious about the exact class.\" She glanced at the others. \"But we won't ask because we know that hidden classes are reluctant to disclose information about their class.\"\n\n*Hoh.* That was considerate.\n\nAs I started liking the guild more and more, Jishuka cut to the chase.\n\n\"Grid, in the future, I want to commission items for the guild members. We want epic or higher rated items suitable for our level.\" She pulled out a small ledger. \"We'll buy the completed items for an appropriate price.\"\n\n\"It's okay if you give me money.\" I rubbed the back of my neck. \"But it will take a while to obtain the materials and production methods required...\"\n\n\"If you tell us what you need, we'll get it for you.\" She closed the ledger. \"You just have to worry about making it.\"\n\nThat was... convenient.\n\n\"Okay.\" I nodded slowly. \"But I don't have a lot of capital, so I can't make too many items at once.\"\n\nJishuka made a confused sound. \"Capital? Why do you need capital? The guild will supply the materials and production methods. All you need is time and the technique.\"\n\nMy mind went blank. \"Eh?\"\n\nFree materials and production methods? This sounded like a dream.\n\n*No, don't get too excited.*\n\nIt was strange. Suspicious that they were so nice from the beginning. I couldn't believe in people, especially women. They might stab me in the back.\n\nI eyed Jishuka warily. \"You'll give me the materials for free and then buy the finished item from me?\" My voice came out flat. \"Why are you giving me the materials and production methods? Isn't it just a loss for you?\"\n\n\"Hah?\" Jishuka looked genuinely confused. \"What are you talking about? Aren't you a blacksmith of our guild? It's natural for the guild to support our blacksmith with materials and production methods.\"\n\nRegas laughed from where he'd been listening on the side. \"Grid, a competent blacksmith is a talent that all guilds covet. They have to give blacksmiths the best treatment to prevent them from going to other guilds.\" He grinned. \"It's obvious that a guild with a competent blacksmith will have a huge growth gap with a guild that doesn't have one.\"\n\n*Wow.* A blacksmith class. Wasn't it a total honey-like class?\n\nBut this was only for competent blacksmiths.\n\n*Blacksmiths are very difficult to grow... So the value of an exceptional blacksmith is very high. However, Pagma's Descendant has fraudulent blacksmith skills, so it's honey.*\n\nI once again felt the greatness of a legendary class and appreciated it.\n\n*I want to start working.*\n\nEnthusiasm filled me and I turned to Jishuka. \"So who am I making an item for?\"\n\nPon's hand shot up. \"Me!\"\n\nVantner grabbed Pon's hand and raised his own. \"No, me first!\"\n\nToban shouted from across the room. \"Of course, the master should be first! Then the chief of staff!\"\n\n\"What does chief of staff have to do with the sequence?\" Someone else called out. \"Don't abuse your authority.\"\n\nAll members of the Tzedakah Guild were rankers. They all aimed to level up, and being armed with stronger items would make it faster and easier to hunt. Obviously, all of them wanted their item made first.\n\nWell, I had to exclude Regas, who was laughing without saying anything.\n\n*Regas is a martial artist who trains his body, so it seems like he doesn't care about items. That reminds me.*\n\nI pointed to two men who couldn't hide their uncomfortable expressions, then at Toban. \"Toban. And you two.\"\n\n\"Huh?\"\n\nThe three people called became filled with anticipation. They misunderstood that I would make them items.\n\nHowever, it was the opposite.\n\n\"I will make your items last.\"\n\n\"W-Why?\"\n\nI looked at Toban. \"You were nasty when I asked to join the Guardian of the Forest raid last time.\"\n\n\"Heok?\" His eyes widened. \"It was a few months ago, but you still remember? Strictly speaking, it was indifference, not nastiness!\"\n\n\"Shh.\" I turned to the other two. \"And you two.\"\n\nI checked their IDs. One was a Hispanic male with black hair called Rook. The other was a slim, middle-aged man called Jeep.\n\n\"The two of you came here before. Didn't you?\"\n\nIt wasn't long after the production making game with Euphemina. They were the two people who'd entered Khan's smithy to ask about Euphemina's whereabouts. At that time, they'd ignored me and disregarded Khan since he was an NPC.\n\n\"Our relationship is like this, right?\"\n\nI smiled and the two of them looked at each other before bowing.\n\n\"We're sorry for that time!\" They spoke in unison. \"We were so impatient that we were rude! We sincerely apologize!\"\n\nI shook my head. \"You need to apologize to Khan, not me.\"\n\nKhan was watching me and my new colleagues happily. The two people apologized to Khan, but the words rang hollow.\n\n\"What?\" I crossed my arms. \"Are you still ignoring NPCs?\" My voice hardened. \"Well, regardless of whether you ignore NPCs or not, it doesn't matter to me. However, Khan is different. Khan is my precious friend, and if you don't respect him, I will never produce any items for you.\"\n\nThe change was immediate. Their faces paled.\n\n\"I'm sorry, Khan.\"\n\n\"Please forgive us.\"\n\nRook and Jeep's apologies were sincere this time. It seemed that they realized even an NPC could be a valuable asset to someone.\n\n*They'll do well.*\n\nI didn't want to criticize them anymore. After all, I'd also ignored NPCs that I didn't need. So the conclusion was simple.\n\nJishuka made the decision. \"I want you to make a spear for Pon first.\"\n\n\"As revealed in the Malacus raid, Pon currently has a low level weapon.\" She gestured at his spear. \"He can't exert the maximum amount of power in a high-level raid. He's one of the pure physical damage dealers in our guild, so we have to prioritize his weapon.\"\n\nPon approached and pulled out a scroll. \"I already have a production method.\"\n\nThe notification appeared.\n\n> ['Gale Spear Production Method' has been acquired.]\n\nI opened the details.\n\n> **[Gale Spear Production Method]**\n> \n> Prerequisite: Advanced Blacksmith Mastery Level 4.\n> \n> * Gale Spear: A spear made of mithril. It is very light so the more skilled the user, the more the power can be maximized. However, this lightness can be a disadvantage.\n> \n> User Restriction: Level 240 or higher.\n\n*Ohh.* Following the Divine Shield, I got another free production method. Pleasure rushed through me as Pon asked carefully, \"Is it possible?\"\n\nI replied as if it was no big deal. \"Of course.\"\n\nThe Tzedakah Guild members stirred.\n\n\"It means he at least has Advanced Blacksmith Mastery level four...\"\n\n\"Isn't the first ranked blacksmith still at the intermediate level?\"\n\n\"Is his excellent combat skills and mastery of blacksmith techniques because of the hidden class?\"\n\n\"It must be one of the best among the hidden classes...\"\n\nI learned the production method in front of them.\n\n> [You have learned how to make the Gale Spear.]\n\nThe full specifications unfolded.\n\n> **[Gale Spear]**\n> \n> Rating: <span class=\"rarity-rare\">Rare</span> ~ <span class=\"rarity-legendary\">Legendary</span>\n> \n> <span class=\"rarity-rare\">Rare Rating Information:</span>\n> Durability: 210/210 | Attack Power: **290**\n> Attack Speed: **+5%**\n> * Attack speed will increase by 0.5% for every attack that connects.\n> \n> <span class=\"rarity-epic\">Epic Rating Information:</span>\n> Durability: 280/280 | Attack Power: **336**\n> Critical Chance: **+5%** | Attack Speed: **+5%**\n> * Attack speed will increase by 1% for every attack that connects.\n> \n> Unique Rating Information:\n> Durability: 363/363 | Attack Power: **400**\n> Critical Chance: **+5%** | Attack Speed: **+10%**\n> * Attack speed will increase by 1% for every attack that connects.\n> * The skill 'True Illusion' will be generated.\n> \n> <span class=\"rarity-legendary\">Legendary Rating Information:</span>\n> Durability: 444/444 | Attack Power: **493**\n> Critical Chance: **+10%** | Attack Speed: **+10%**\n> Accuracy: **+5%**\n> * Attack speed will increase by 1.5% for every attack that connects.\n> * The skill 'True Illusion' will be generated.\n> \n> A spear made of mithril. It is very light so the more skilled the user, the more the power can be maximized. However, this lightness can be a disadvantage.\n> \n> User Restriction: Level 240 or higher. More than 750 strength. More than 400 agility. Advanced Spear Mastery level 2 or higher.\n> \n> Weight: 200\n\n*Ohh, it's a good spear.* It wasn't inferior to the Sword of Self-transcendence that I'd made.\n\nI looked up at Pon. \"In order to create one spear, I need fifteen kilograms of mithril ore, 1st tier high-grade Tipan wood, and four griffin tendons.\"\n\nPon made an excited sound. \"I'll acquire them for you now.\" He hefted his current spear. \"Then while you're making the new spear, I'll look for the whereabouts of the Divine Shield that was stolen. So don't worry about anything during the production.\"\n\nI nodded, tension easing from my shoulders. \"Okay. I'll concentrate and make a good spear.\"\n\nI was standing on a stage. The guild was filled with expectations for the creator of the Special Jaffa Arrows. And I was ready to surprise them.\n\n*For some reason, I have a lot of confidence today.*\n\nOf course, there was a chance it might be ruined. But there was no reason to be blamed if I made a rare rated item. The result of production was clearly luck. So there was no need to be burdened.\n\nI started to concentrate on my breathing."
}