{
  "id": 960,
  "title": "Chapter 959",
  "content": "**Chapter [X]**\n\n\"The Americans are trolling. ㅡㅡ;\"\n\nThe chat scrolled with variations of the same sentiment. Viewers across the globe were losing faith.\n\nKraugel stood at the periphery, passive and calculating. Zibal's misinformation had sown chaos among the raid forces. Haster had charged the Demon King head-on like a kamikaze pilot—and died just as uselessly, his death a hammer blow to morale.\n\nIt was pathetic. Even their most devoted fans fell silent. The American audience squirmed in collective shame.\n\n\"We're going to lose, aren't we?\"\n\n\"Of course. Look at that thing. How the hell do you beat *that*?\"\n\nHaster's idiotic charge had been the final straw. Hope collapsed. Hundreds of millions of viewers resigned themselves to watching three hundred players get slaughtered by an unbeatable monster—clowns performing a futile circus before the executioner's blade.\n\nThe Demon King prepared to deliver the killing blow. \n\nThen the massive magic machine beneath him buckled, dropping to one knee. A malfunction in the casting process, perhaps. The Demon King stood atop its head, perfectly balanced despite the sudden lurch, and spoke in a voice like grinding stone:\n\n\"All of you will die.\"\n\nSilver energy erupted from his blade—the 100,000 Army Massacre Sword. A skill that dealt sixty percent of his attack power thirty times over to every target within ten meters, no exceptions, with a ten-minute cooldown. The technique should have manifested as purple-red light, but this time it gleamed silver as it swept toward the surviving magicians.\n\nThree hundred players remained. \n\nThe audience expected surrender. Mass logout. Anything but continued resistance.\n\nThey were wrong.\n\n\"The cannon bombardment comes exactly every five minutes.\"\n\n\"It fires in the direction he's looking. Read his gaze, anticipate the shot.\"\n\n\"The moment he switched from bow to sword, his health regeneration rate dropped significantly. He lost the Red Phoenix Bow's passive effect—Jishuka was right. The Demon King's natural recovery is abnormally slow for a boss of this caliber.\"\n\n\"He spins like a top before activating skills. It's a casting motion—if we physically restrain him mid-spin, we might cancel the skill entirely.\"\n\n\"The poison fog from his armor is nasty, but it deploys slowly. Maintain safe distance and we can avoid it.\"\n\nRankers didn't break easily. They *adapted*.\n\nTen minutes of one-sided slaughter. One hundred players already dead. But those who remained weren't mourning—they were *analyzing*. Data collection. Pattern recognition. Counter-strategy development. This was raid fundamentals.\n\n\"He adds rotational momentum to his footwork...\" Jishuka's eyes tracked the increasing plumes of black smoke pouring from the Demon King's magic machine. It was overloading, moments from critical failure. The pilot was losing his temper. Good. Angry people made mistakes. \"Damian, prepare to move. We counterattack the moment that machine explodes.\"\n\nDamian hesitated. \"His health is still nearly full. Isn't it premature to paint targets on ourselves?\"\n\n\"Three hundred of us. *Three hundred*. If every single person lands a few thousand damage, we burn through two million health.\"\n\n\"He's airborne. Only a handful can engage him simultaneously.\"\n\n\"He'll come down. Eventually, he has to come down. And when he does, we end the slaughter.\"\n\nJishuka had identified Grid's fundamental weakness: resource dependency. Powerful skills, yes—but each consumed massive amounts of mana and stamina, with punishing cooldowns. He'd been burning abilities non-stop for ten minutes. He was running on fumes. Fly wasn't infinite. They couldn't give him time to recover.\n\n*Transcended Link is his last wide-area skill. We have to interrupt his footwork.*\n\nJishuka had fought beside Grid when he was nobody. The skill had evolved, but she still recognized the underlying framework. She could read him.\n\n*One hundred dead in ten minutes. Higher casualties than projected, but acceptable.*\n\nShe and Chris had ordered maximum dispersion across the battlefield—minimize clustering, minimize damage from area-of-effect attacks. Some players hadn't trusted the command. They'd huddled together for comfort. Grid's skills had punished them brutally for it, especially the magicians. \n\nStill. Acceptable losses. Three hundred versus one. The advantage remained overwhelming.\n\nPon leaned close, watching her nock an arrow. \"That's really Grid? How the hell did he get a magic machine?\"\n\n\"His clone copied his equipment. Maybe killing it unlocked some duplication ability.\"\n\n\"Combination. Transformation. And now *copying*?\" Pon shook his head. \"That's absolutely broken.\"\n\nJishuka's lips curved—not quite a smile. \"Have you forgotten? Common sense doesn't apply to our leader.\"\n\nShe'd glimpsed the incomprehensible once before, when she'd witnessed Kraugel—the Sky Above the Sky—operate on a level beyond mortal limitation. Now she felt the same vertigo watching Grid. Whether as friend or enemy, he defied understanding.\n\nThe difference? As an enemy, Grid inspired *terror*.\n\n*We crossed a line we shouldn't have.*\n\nHer blood sang. She was a predator. She *devoured* threats.\n\nJishuka licked her lips, strangled her anxiety, and drew her bowstring taut. She waited—patient, precise—for the exact moment the Demon King launched himself from the magic machine.\n\nThe charged arrow punched into his chest.\n\nThe Demon King hurtled backward.\n\nThe magic machine detonated.\n\nDamian's voice boomed across the raid channel: \"OFFENSIVE! NOW!\"\n\n\\[You have consumed Sweet Candy.\\]  \n\\[Hermes Shoes equipped.\\]  \n\\[Skill Enhancement activated.\\]  \n\\[Baby Dragon's Fire consumed.\\]  \n\\[Valbun Sword equipped.\\]\n\nAcross the battlefield, rankers deployed their Reputation Store purchases—items hoarded specifically for the Four Heavenly Kings and the Demon King. Their reputation reserves were nothing compared to Grid's, which meant every purchase had to *count*.\n\nChris's greatsword hammered into the Demon King before he could recover from the blast. Devastating damage. The Demon King tried to counter, but Regas's fist drove him back into the ground.\n\n\"*Kuek*—!\" Pon's spear impaled the Demon King's chest. Damian's holy blade followed, chaining into critical damage. Poison fog billowed from the Demon King's armor, but they pushed through, ignoring the damage-over-time. They weren't fragile enough to flinch from this.\n\n\"*Annihilate!*\"\n\nIyarugt emerged from its sheath—fully charged, *intoxicated*. Peak Sword's attack power surged by five hundred percent. It was the same lethal technique that had defeated Kraugel in two strikes last year.\n\n> \\[You have suffered 230,900 damage!\\]  \n> \\[Weak point exposed—gap between shoulder blade and armor!\\]\n\nThe Sweet Candy buff and Damian's holy enhancement shattered the Demon King's armor at the vulnerable joint. \n\nAnd that was just the *opening*.\n\nHundreds of players swarmed the Demon King, still pinned by Pon's spear.\n\n\"Blood Rain.\"\n\nThe Demon King's blood jetted skyward, then fell like crimson hail. A wide-area attack—the same technique that had devastated Kobold's forces and empowered Katz, completely reversing that earlier battle.\n\nBut here? The Demon King was *grounded*. Immobilized. Bleeding. Momentum shifted violently to the players.\n\nMeanwhile, across the battlefield, Eat Spicy Jokbal was completing his dungeon construction—a small fortress that would amplify ally recovery rates and block the artillery bombardment.\n\n\"Huhu. The tide has turned completely.\"\n\nIn the Daejin Group executive boardroom, the assembled presidents—summoned by Chairman Lee Jinmyung—leaned forward with gleaming eyes. The Demon King who had massacred players for ten straight minutes was now being beaten into the dirt.\n\n\"Three Koreans are carrying. South Korea might take multiple golds.\"\n\n\"Two golds puts us top three, doesn't it? I'm telling you, the event ROI will be *astronomical* if Korea exceeds projections.\"\n\nThe executives who didn't know the Demon King's identity buzzed with excitement. The heads of the companies running National Competition tie-in events were practically salivating.\n\nBut Chairman Lee Jinmyung, the president of Daejin Motors, and three PR directors sat rigid. They knew *exactly* who the Demon King was. They'd been counting on Grid to reveal himself *after victory*. \n\nThis development was catastrophic.\n\n*There's no value if he loses.*\n\nWould the public celebrate a loser? Absolutely not. If the Demon King was defeated, he'd face mockery, not acclaim. Ridicule, not endorsement. *Abandoning his nation to play villain, and he couldn't even pull that off.*\n\n\"Tsk.\"\n\nLosers couldn't be corporate flagships. Lee Jinmyung watched the half-gray mask covering the Demon King's face crack, red blood seeping through the fissures. He clicked his tongue.\n\nGrid had been a big fish. But this? Pathetic.\n\n*He made promises he couldn't keep.*\n\nLee Jinmyung despised people who couldn't maintain composure under pressure. Grid wasn't worthy of his granddaughter. The chairman felt vaguely ashamed for having considered such a man even briefly. He shook his head, lit a cigarette, and began mentally drafting succession plans around Yura instead.\n\nHis eyes stayed on the monitor, but his mind was elsewhere—\n\n『—*NO!* WHAT—?! THAT'S—!!』\n\n\"...Hm?\" \n\nThe commentators were *screaming*. Lee Jinmyung blinked, his train of thought derailing. He couldn't parse what they were saying, couldn't process what was happening on screen. He stubbed out his cigarette—\n\n\"*YES!*\"\n\nThe president of Daejin Motors punched the air, grinning like a maniac.\n\n\"...What?\"\n\nWhat the hell? Why was the head of Daejin Motors acting like a sports hooligan in front of the entire executive board? Chairman Lee Jinmyung frowned, finally focusing on the monitor.\n\nOn screen, the wounded Demon King—beaten, bleeding, surrounded—*detonated*.\n\nNuclear fire consumed the battlefield.\n\nWhen the light faded, over two hundred of the three hundred players were *gone*. Turned to gray ash. Among the dead: Chris, first-ranked player. Multiple core members of Overgeared.\n\nThe commentators lost their minds. The survivors stared, shell-shocked, at the smoking crater.\n\nChairman Lee Jinmyung sat frozen.\n\nThen he shot to his feet.\n\n\"*YES!!*\"\n\n\"...?!\" \n\nThe executives gaped. The owner of the Daejin Group—the infamous dictator, the man whose charisma bordered on tyranny—was *celebrating* in front of his subordinates like some drunk uncle at a baseball game. Had they hallucinated? \n\n\"*STINGRAY!*\" The chairman even used a *chuimsae*—the traditional fisherman's cry of triumph when hauling in a prize catch.\n\nChairman Lee Jinmyung was just as euphoric as the Daejin Motors president. Pride swelled in his chest.\n\n*Yes. I was right about him. I can absolutely use my exceptional grandson-in-law.*\n\nUncontrollable greed glittered in Chairman Lee Jinmyung's eyes as he watched Grid standing in the smoking ruins."
}