{
  "id": 961,
  "title": "Chapter 960",
  "content": "**Chapter: The Demon King's Gambit**\n\nThe instant Grid's feet left the magic machine, ice flooded his veins. \n\nArrows—silent, traceless—materialized from nowhere, streaking toward his heart.\n\n*Shit.* Of all the attacks he'd deflected during this brutal melee, Jishuka's arrows remained the one constant threat. Soundless projectiles fired from impossible angles demanded focus he couldn't spare while managing three hundred other opponents. Two months ago, she'd returned from a hidden quest wearing that same predatory expression—the look of someone who'd transcended their limits.\n\n*Should've known she'd become a monster.*\n\nThe realization struck him like a hammer blow. Here, on terrain that favored her completely, Jishuka had ascended to the realm reserved for the absolute elite. Years of maintaining peak performance had finally borne fruit—she'd reached the sky above the sky. An amazing achievement. Having her as friend and ally should have been a comfort.\n\nInstead, his thoughts turned elsewhere.\n\n*Yura.*\n\nHis chest constricted. Yura, who'd earned a legendary class only to face nothing but frustration since. Talented, dedicated, relentless—yet somehow, fortune refused to smile on her. Grid knew misfortune when he saw it. He'd lived it. The weight of her struggles was written in every failed attempt, every near-miss. He wanted to help her. Wanted her to keep fighting.\n\nThe arrows punched through his defenses like paper.\n\nThe impact hurled him from the magic machine. Behind him, the construct detonated in a blossom of fire and twisted metal. The shockwave caught him mid-flight, spinning his vision into a nauseating kaleidoscope. Warning notifications flooded his peripheral vision—durability losses across multiple items.\n\nBut panic was a luxury Grid couldn't afford.\n\nHe forced his inner ear to cooperate, twisted mid-tumble, and landed in a combat crouch with his blade already angled to intercept. His Insight stat screamed warnings. The Slaughterer's Eye Patch highlighted trajectories in his vision.\n\nNone of it was enough.\n\nChris slammed into him—1st ranked player, one of the Ten Meritorious Retainers—with the force of a wrecking ball. Then Regas grabbed him and threw him like a ragdoll into Pon's waiting spear. Damian's holy blade bit deep. Peak Sword's follow-up strike painted red lines across his armor.\n\nThree hundred players descended on him like a human avalanche.\n\n*So this is the power of numbers.* The thought came bitter as he crashed to his knees. *Whoever said \"there's no shame in overwhelming force\" can go straight to hell.*\n\nFrom the moment he hit ground, he lost control. Attacks hammered him from every angle—a storm of steel and magic that locked him in place as surely as chains. Even weak strikes became dangerous when stacked hundreds-deep. His health bar plummeted, hemorrhaging hundreds of thousands of points per second.\n\n*Too arrogant. I was too damn arrogant.*\n\nHe'd walked into this battle radiating confidence. After all, only he fully understood the Demon King Subjugation's mechanics. He could prepare countermeasures that no one else could predict. Better yet, the National Competition ran on isolated servers—he could use every blacksmithing skill in his arsenal without consequence.\n\nFrom that foundation of advantage, he'd made a fatal leap in logic. He'd dismissed most of the players as fodder. Outside his guild members and a handful of elite rankers, the rest would fold under a single skill or a few basic attacks.\n\nHe'd imagined a one-versus-thirty fight.\n\nNot one-versus-four-hundred.\n\nThe misjudgment was glaring now. Landing hits proved frustratingly difficult—the players maximized their numerical advantage, constantly cycling in and out to neutralize his offensive output. Their defense coordination was equally impressive. These were national representatives, champions of their countries. They wouldn't die easily.\n\nBut the killing blow to his strategy? *Information.*\n\nHis own guild members—Jishuka, Chris, and the others—were feeding intelligence to every player on the field. The moment they'd confirmed the Demon King's identity, they'd assumed command. Most of his wide-area skills had been rendered useless through tactical positioning. When he'd cloned the Red Phoenix Bow and activated Fly Up!, expecting to catch dozens in his sight, he'd found the battlefield suspiciously empty. His embarrassment then had been profound.\n\n> [You have suffered 3,900 damage!]\n> \n> [You have suffered 10,040 damage!]\n> \n> [The durability of Valhalla of Infinite Affection has decreased by 19.]\n> \n> [You have received the abnormal status 'Bleeding.']\n> \n> [You have resisted.]\n> \n> [The title effect 'First King' has activated Great King's Dignity!]\n> \n> [You have counterattacked and reflected the status effect!]\n\nThe notifications became a monotonous drumbeat of suffering. Each second felt like an eternity. The one-sided beatdown dragged him back to school days—helpless, cornered, overwhelmed.\n\nBut something was different this time.\n\nThe memory didn't shake him. That particular demon had been exorcised long ago. He still had relationship trauma to work through, but that battle could wait.\n\n> [The title effect 'First King' has activated!]\n> \n> [A shield will be created to absorb damage equal to health lost in the last minute. Terrain adaptation increases by 100%. Movement speed and defense increase by 10%.]\n\nSeventy percent of his health—gone in seconds. The emergency shield bought him breathing room. His awareness expanded, taking in the battlefield with crystalline clarity. Players gasped from Valhalla's poison aura. Others stumbled under Great King's Dignity. Many teetered on the edge of collapse.\n\nYet not one retreated.\n\nMedal hunger consumed them completely. The chance to land one more hit on the Demon King overrode survival instinct.\n\nGrid's mind raced through options.\n\nHe had enough mana for the combo—Freely Move into Fly, then unleashing Transcended Link. Three skills that could extract him from immediate danger and cut down dozens of players in the process.\n\n*And then what?*\n\nHis mana would crater. Fly would fail. He'd crash back to earth and the cycle would repeat—except next time, he'd be running on fumes. He might kill dozens. He'd never achieve victory.\n\n*Belial's fire could carve an escape route... but same result.*\n\nMana. Always mana.\n\n*And Alarm isn't ready.*\n\nHe'd set the Alarm-Magic Missile combo as conservatively as possible, unable to perfectly predict when the Four Heavenly Kings would fall. Too early to rely on it now.\n\nOther options flickered through his mind—Noe, Randy, the Overgeared Skeletons, the light elemental, Tiramet. Should he summon them to weather this crisis?\n\n*Too soon.*\n\nNoe's defense skill and stat-drain ability would help, certainly. But not enough. Pet and master together wouldn't outlast three hundred coordinated players. His summons would be eliminated quickly, leaving him isolated again. Besides, the light elemental had a specific purpose.\n\n> [You have suffered 23,000 damage!]\n> \n> [The durability of Valhalla of Infinite Affection has decreased by 37.]\n\nCracks spider-webbed across the crimson half-mask covering his face—the item formerly known as Bizarre Mask. Blood seeped through the fractures, cold against his skin.\n\n*Wait.*\n\nHis pulse quickened.\n\nThe crisis crystallized with sudden, shocking clarity. Defeat. Failure. Concepts he'd experienced countless times yet never grew accustomed to. Words he refused to accept as destiny hammered at his consciousness.\n\nBut something was wrong.\n\nHe felt *excited*. Not desperate. Not frustrated. *Excited*.\n\nIntuition surged. There was an answer he hadn't considered—wisdom forged from years of accumulated experience finally bearing fruit.\n\n*The power of lies.*\n\nMemory crashed over him: Kraugel versus the Hero. The way the Hero had weaponized Belial's deceptive power, creating multiple clones to devastating effect.\n\n*But I won't use it that way.*\n\nHe lacked the Hero's superhuman reaction speed and adaptability.\n\n*However, I have something better.*\n\nOvergeared. The very essence of his existence. The Hero didn't possess Khan's legacy—didn't have access to Valhalla of Infinite Affection and its trump card: Moving Fortress.\n\nThe skill description materialized in his mind:\n\n> **Moving Fortress** (Can be manually activated when health drops below 10%)\n> \n> - Converts Valhalla of Infinite Affection's durability to defense (1 durability = 2 defense)\n> - Grants immunity to all status effects (including physical conditions)\n> - Duration: 1 minute\n> - Sets current durability to 30 points (afterward, restores durability by one-third of maximum)\n> \n> *Warning: If durability reaches zero, this item will be permanently destroyed.*\n> \n> **Impregnable:** Releases half of all damage received in the last five minutes across a 50-meter radius.\n> \n> Cost: Permanently reduces maximum durability by 200\n> Cooldown: 10 minutes\n\n*I can do this.*\n\nThe puzzle pieces aligned with satisfying precision. This wasn't genius-level strategy—just competent tactical thinking. But for Grid, it was a revelation.\n\n\"Blackening,\" he whispered. \"Belial's Power.\"\n\n> [The Rune of Darkness has unleashed the power of Great Demon Belial!]\n> \n> [Humans cannot contain all three of Belial's powers simultaneously.]\n> \n> [Half-demon transformation initiated. Your body withstands the pressure of immense demonic energy. However, wielding all three powers at once remains impossible.]\n> \n> [Select one of Belial's powers: Darkness, Fire, or Illusion.]\n> \n> [You have selected: **Illusion**!]\n\nHis health drained as clones erupted into existence. His perspective fractured and multiplied—suddenly he was seeing from a dozen viewpoints simultaneously. Enemy faces surrounded him. Enemy backs surrounded him. Feet, crowns, weapons—everything flooded his expanded vision at once.\n\n\"What the—?\" Terror blanched the players' faces. They recognized this technique. They'd seen it before.\n\n\"Spread out! Move!\" Chris's command rang with desperate urgency.\n\n『I-Isn't that the Hero's clone technique...?』\n\n『W-Why does the Demon King have access to that power...?』\n\nThe international commentators stumbled over their words.\n\n**- what the hell is happening**\n\n**- no way. no fucking way.**\n\nThe crowd and stream viewers reeled in collective shock.\n\n\"Moving Fortress,\" the Demon King rasped through blood-flecked lips. Status effects from Jishuka's arrows evaporated like morning dew.\n\nGrid seized control. The players who'd been pummeling him seconds ago now found themselves surrounded by clones. He closed the distance to Chris in a heartbeat and grabbed the man's collar.\n\n\"Gah! Let go!\"\n\n*Not a chance.* Grid's grin was pure malice as he leaned close. \"**Impregnable.**\"\n\nThe skill unleashed five minutes of accumulated punishment in a single catastrophic pulse. Half of every strike he'd endured—now returned to sender, distributed equally across fifty meters.\n\nHundreds of gray death-pillars erupted skyward. Dust and debris choked the air.\n\nThrough the chaos, a green light blazed. Then came the white giant—Zibal's magic machine Raiders, charging through the destruction like an avenging angel.\n\n\"**GRIIIIID!**\"\n\nWhile others still doubted, still processed, Zibal had already reached certainty. He understood Grid's capabilities. Most people dismissed the notion of one man fighting four hundred—convinced themselves it was impossible. Zibal knew better. If anyone could do it, Grid could. Simple logic, really. And that logic had led him to the truth.\n\nA massive spear hurtled toward Grid's battered form.\n\n\"Flash.\" Grid barely got the word out. The light elemental materialized and detonated in a supernova burst, searing Zibal's vision white. The spear sailed wide, impaling empty air.\n\n\"Get off that thing and fight me properly.\" Grid's laugh was dark and rich—a natural villain savoring the moment. Behind his cracked mask, obsidian eyes found their next target.\n\nJishuka.\n\nShe trembled under that gaze.\n\nNot from fear.\n\nHer expression was pure ecstasy—the look she reserved for one man alone. The look that said she'd just witnessed something magnificent."
}