{
  "id": 962,
  "title": "Chapter 961",
  "content": "**Did he plan this from the start?**\n\nFrom the moment that Charging Shot struck Grid, unease had coiled in Jishuka's chest. The timing of the magic machine's explosion—too perfect. Grid's defense had opened like a wound, and the scattered players converged on him like sharks to blood.\n\nThey'd walked straight into his trap.\n\nThat opening wasn't weakness. It was bait.\n\n\"Brilliant bastard.\" A shiver ran through her as she recalled the vision: five Grids in crimson armor, moving in perfect synchronization. Heat flushed her cheeks. She wanted to crack open his skull and study the folds of that devious brain—to understand what made a tactician of his caliber tick.\n\nThe Demon King's gaze fixed on her.\n\nJishuka's breath caught. Around them, eighty players remained—among them monsters like Damian and Zibal with his war machine. Chris and Peak Sword had fallen, along with most of the Overgeared members. Yet Grid's attention didn't waver. He looked only at her.\n\n*He considers me the greatest threat.*\n\nPride swelled in her chest.\n\n**Thwick—thwick—thwick—!**\n\nBlack arrows cut through the air, silent as assassins. Only Jishuka knew their exact count, their vectors, their timing. Grid charged forward, heedless of the death streaking toward him from multiple angles. He had no time to calculate defense or evasion.\n\nHe came at her like a maddened bull, fixated on the red cape that was Jishuka herself.\n\n\"Then come!\"\n\nJoy surged through her. The arrows found their marks—philtrum, the bridge between his eyes, dead center of his forehead. A feast of perfect shots. The Tzedakah members used to say she hunted like a beast—relentless, merciless. Against her prey, there was no such thing as restraint.\n\nAny reasonable opponent would have faltered.\n\n*'Pagma's Swordsmanship.'*\n\nMoving Fortress rendered him immune to physical attacks. Blood streamed down his face from the embedded arrows. He didn't so much as blink.\n\n*'Link.'*\n\nGrid closed the distance and unleashed a storm of energy blades. Jishuka pivoted, drawing her bowstring as she widened the gap. She slipped past several strikes and retaliated mid-dodge.\n\n**[You have suffered 8,930 damage!]**\n\n**[You have suffered 7,590 damage!]**\n\n**[You have suffered 13,580 damage!]**\n\nEvery shot struck true. She avoided his armor and pauldrons, targeting flesh and weak points. But evasion had limits. Her agility was unmatched among archers, yet Grid's sword was faster. Each strike flowed seamlessly into the next—a chain of death she couldn't fully escape.\n\n**[The target has received 29,300 damage.]**\n\n**[The target has received 25,760 damage.]**\n\nTwo hits. Over half her health gone. She used her quiver and bow as shields, deflecting some blades while the rebound momentum carried her out of range. As Grid's foot came down, steel jaws snapped shut around his ankle—a trap she'd laid during the exchange.\n\nFive seconds of restraint. Anyone who moved would shred their own leg.\n\nGrid ignored it and surged forward. Moving Fortress didn't just protect against arrows—it made him an unstoppable juggernaut.\n\n\"God, that's good,\" Jishuka murmured, voice thick with something between admiration and desire. He was brilliant *and* relentless. What a combination.\n\nBut this was where it ended. The debt between them—the professional distance of creditor and debtor—made anything else impossible. If she voiced what she felt now, she'd just look like a snake trying to leverage his emotions.\n\n*'Then I'll go down swinging.'*\n\nShe nocked her final arrow and drew with everything she had. A different target this time—not the seams of his armor, but dead center mass. Point-blank range. The arrow struck Valhalla of Infinite Affection.\n\nAnd Grid's blood ran cold.\n\nThe armor's durability had dropped to 30 after activating Moving Fortress. It would last one more minute at most. This shot would tear it to shreds.\n\nHe moved to trigger Freely Move—his last trump card—but the arrow was already in flight.\n\n**CRASH.**\n\nValhalla exploded into a thousand fragments. Jishuka's ability to read, judge, and act in the span of a heartbeat had paid off.\n\nUnfortunately, Grid wasn't that fast. He wasn't a chosen genius like Kraugel, blessed with supernatural reflexes.\n\nBut he was Grid.\n\nThe Enlightenment Sword—impossible to categorize as spear or blade—pierced Jishuka's waist at nearly the same instant as her arrow destroyed his armor.\n\n**[You have been struck with a serious blow!]**\n\n\"I'm a proud woman,\" Jishuka whispered as her legs gave out. She collapsed into Grid's arms like a broken doll. \"Sorry... about the armor.\"\n\nNot an apology for the shot. An apology for destroying Khan's masterpiece. That's why she'd hesitated when she first noticed the weakness—why she hadn't targeted it immediately.\n\nGrid understood. His hand came up to stroke her crimson hair. \"I'm the one who should apologize.\"\n\n\"Heh... *cough*—\" Her body began to disintegrate, pixels of grey light rising from her skin. Within seconds, she vanished in a pillar of ascending data.\n\nThe notification of Jishuka's death flashed across every screen.\n\n\"**GRIIIID!**\"\n\nThe white giant—Raiders—finished tearing through the vampire Tiramet and charged across the battlefield.\n\n*'Tiramet's down already.'*\n\nMagic machines truly were monsters. Grid wondered if the event rewards would include materials to craft one as he opened his inventory. Out came the Dragon Harpoon and a hammer.\n\nNo armor meant no slugfest with Zibal.\n\n\"Spear Shot.\"\n\nThe massive harpoon—forged for the drake raid during the 2nd National Competition—flew like a ballista bolt. It slammed into Raiders' chest, and the war machine ground to a halt.\n\n\"What, you're not getting out to fight me properly?\" Grid secured the harpoon's chain to the ground with a peg and vanished into the chaos of the battlefield.\n\nNext target: Pope Damian.\n\n*'Linked Kill Wave Pinnacle.'*\n\nGrid became a crimson whirlwind, crossing the distance in a spinning assault. The Enlightenment Sword howled in his grip. Damian, barely recovered from the explosion's wounds, threw up a defensive barrier.\n\nIt shattered like Valhalla had.\n\n\"**Scream,**\" Grid announced—the Demon King's voice echoing the technique's alternate name. Damian's shield failed on the first strike.\n\n\"Ugh—!\"\n\nA massive golden halo manifested behind Damian's back in a desperate last-ditch effort.\n\n**[You have died.]**\n\nToo late.\n\n\"**GRIIIID!**\" Raiders tore free from the Dragon Harpoon and thundered toward him.\n\nThis time, Grid didn't dodge. He stood his ground, ebony hair whipping in the wind, and met the charging war machine head-on. Inside the cockpit, Zibal's legs trembled.\n\nBehind the half-mask, Grid's eyes were calm. He'd already confirmed what he needed: his earlier explosion had obliterated Eat Spicy Jokbal's fortress position. The golden cannon charged a shell filled with the Blue Dragon's Breath.\n\nAnd fired.\n\n\"Kh—!\"\n\nJust before Raiders reached the armorless Grid, the cannon shot hammered into its side. The impact sent the war machine reeling. A magnetic field erupted, electromagnetic currents seizing Raiders' systems and locking it in place.\n\n\"Grid...!\" Desperation twisted Zibal's face. He screamed, unable to change the tide after unknowingly feeding Grid false information earlier.\n\nGrid's voice cut through the chaos, clear and respectful. \"You performed wonderfully this year.\"\n\n\"...\"\n\nTwo years ago, Grid had crushed him like an insect. Now that same man offered acknowledgment. Zibal didn't know whether to laugh or cry as he recalled Raiders and summoned his pegasus instead. He dove toward Grid one last time.\n\nEighty surviving players descended on the Demon King.\n\nThe armor was gone. The body he'd trained for years was as battered as theirs. Everyone sensed it—the end of this brutal, beautiful war.\n\nGrid felt it too. He drew a deep breath and closed his eyes.\n\n**『S-Surely he's not surrendering?』**\n\n**『He has no choice. His resources are depleted, and he lost his armor. It wouldn't be strange if he decided he can't endure any longer.』**\n\nThe commentators discussed the Demon King's imminent fall. The crowd roared. Viewers around the world leaned forward in anticipation.\n\nThen stars bloomed across the sky.\n\nHundreds of them.\n\nBeneath that false constellation stood the Demon King and eighty charging players.\n\nThe bombardment began.\n\nTwo hundred Magic Missiles—set with Alarm spells to activate simultaneously—rained down like artillery. They punched through skulls and spines, shattered the ground, turned the battlefield into a hellscape. Players screamed as the surprise assault tore through their ranks.\n\n*'Noe. Randy. Can you Become the King of the Dead?'*\n\nA second Demon King materialized. A tiger wreathed in black flames. A lich. A death knight.\n\n**『Ah... Ahhh...』**\n\nMinutes later, two figures remained.\n\nOne was battered, gasping for breath. The other stood unmarked by battle. The second man spoke first, his expression complicated.\n\n\"You've lost your immortality.\"\n\n\"Yeah. Everyone was too strong.\"\n\n\"...\"\n\nSword Saint Kraugel understood immediately. This wasn't a fair fight—not anymore. He began removing his armor, intending to end it by his own hand.\n\nThe Demon King stopped him. \"Extremely Honorable Painting.\"\n\nThe skill activated. The Demon King's image wavered, flickered, dissolved. In his place stood the world's most recognizable figure—the Overgeared King. The Hero King.\n\nGrid.\n\n**『G...Grid?!』**\n\nFor those who'd doubted, the revelation hit like a hammer. The Demon King Subjugation's ratings exploded. Every portal site's #1 real-time search query changed simultaneously.\n\n**GRID.**"
}