{
  "id": 963,
  "title": "Chapter 962",
  "content": "An Extremely Honorable Painting was a work of pure fortune. The world's greatest artist had spent a lifetime pursuing one, and Picasso's creation—the first in 177 years—had earned him legendary status, untold wealth, and access to quests no other painter could dream of.\n\nGrid's reward?\n\n**[Protagonist of the Extremely Honorable Painting]**\n\n**[One-time limited skill.**\n\n**When activated, you will revert to your state when this painting was created.**\n\n**Only stats and skills are affected. Titles, class, status, race, and age remain unchanged.]**\n\nA glorified checkpoint. Useful in theory, catastrophic in practice. The moment he used it, every stat gain, every hard-won improvement since that day would vanish. He'd sworn he would never touch it.\n\nUntil now.\n\n**[You recalled yourself at the time the Extremely Honorable Painting was drawn.]**\n\n**[Past memories, forgotten glories, and lost flesh permeate your present form.]**\n\n**[You have returned to the moment captured in paint!]**\n\n**[Your level has decreased. All stats have fallen. Skill data has been altered.]**\n\nWind swept across the battlefield. Long hair shortened, strand by strand. Bestial fangs and claws retracted. Corded muscle vanished beneath black armor. Wings dissolved into a crimson cloak. Three horns melted away, replaced by a graceful silver crown.\n\nThe Demon King died. Grid remained.\n\nThe cost was immediate. Three levels gone. The Goddess' enhancement to his blacksmithing and Pagma's Swordsmanship—reverted. Pagma's Eyes, the Contractor variant—erased. Two hundred thirty-four random elixirs worth of permanent stat gains—wiped clean.\n\nBut his equipment told a different story. The Enlightenment Sword, previously enhanced to +4, now glowed with the lesser power of +1. Yet Valhalla, shattered moments ago, stood whole again. The God Hands materialized around him, no longer fused into that battlefield cannon.\n\n*The painting doesn't just restore me. It restores everything I was wearing.*\n\nA save state for his entire existence at that frozen moment in time.\n\n'Only a few months ago.'\n\nIt felt like decades. Pride warmed his chest—proof of how far he'd pushed himself since that portrait session. Without hesitation, he allocated his saved stat points, then activated the Goddess' blessing.\n\n**[295 points invested in Agility.]**\n\n**[Pagma's Swordsmanship Lv. 4 enhanced to Great Swordsman Pagma's Swordsmanship.]**\n\n**[Mastery grants: +40% physical attack power, +50% critical hit rate, +80% critical damage.]**\n\n**[Sword Dance footwork execution time reduced by half.]**\n\n\"What... is this?\"\n\nFor the first time in Grid's memory, Kraugel sounded lost. The man who'd solved every puzzle Satisfy threw at him stood across the crater, White Tiger Sword halfway to its sheath, expression cracked with genuine confusion.\n\nItems didn't repair themselves mid-combat. Bodies didn't reconstruct from catastrophic damage. This defied everything Kraugel knew about the game's systems.\n\n\"One thing you should understand.\" Grid's voice carried across the devastation. \"I have nothing left to gain from playing the Demon King.\"\n\nNo more lies. No more disguises. Just Grid.\n\nHe didn't mention being *weaker* than before. Kraugel had been reset to level one barely two years ago—complaining about a few lost weeks would be pathetic by comparison. Besides, most of those elixir gains had gone to dexterity anyway.\n\n\"Come.\"\n\nThe restoration felt like shedding ill-fitting clothes. Lighter. Sharper. *Right.*\n\nGrid closed the distance.\n\n\"**Drop.**\"\n\nThe sky answered. Authority manifested as an invisible blade, crashing down with the weight of heaven itself—the same instant skill that had crippled dozens of rankers in the Demon King fight.\n\nKraugel's blade met it. White Tiger thorns erupted as the swords connected, meeting the Enlightenment Sword's black flames in a shower of sparks.\n\n*Thud-thud-thud!*\n\nTwo heartbeats, accelerating in perfect synchronicity. One the former pinnacle, one the current peak. Through fire and thorns, their pulses merged into a single war drum.\n\nGratitude flooded through Grid's exhaustion. Kraugel had entered this competition solely because Grid had asked. Had endured the world's criticism to preserve this moment. Had *waited*, knowing what Grid truly wanted.\n\n\"I won't disappoint you.\"\n\n\"Yes.\"\n\nA promise, sealed without words. They disengaged simultaneously, both spinning away from the bind—but with completely different intent. Kraugel rode the repulsive force, channeling it into his next strike. Grid used the momentum to flow seamlessly into his combination.\n\n\"**Transcend Storm Sword.**\"\n\n\"**Linked Kill.**\"\n\nShockwaves rippled outward—one strike meant to annihilate, one meant to nullify. The slick ground beneath them might as well have been solid steel for all the traction they lost. Nothing existed beyond their exchange.\n\nGod Hands fired Magic Missiles from above. Four Control Swords materialized to intercept. The White Tiger Sword's weight suddenly doubled, and Grid dropped to one knee—then activated Fly, driving that knee straight into Kraugel's chin.\n\nKraugel caught his ankle mid-ascent and slammed him earthward. Valhalla's impact triggered its poison fog. Kraugel's spinning blade reversed the toxic cloud back toward its source. Grid activated Kill. Kraugel's White Light Steps—capable of a hundred different vectors—barely evaded the lethal strike.\n\nLantier's Cloak should have blocked the counter.\n\n\"**Crying Tiger.**\"\n\nIntangible energy punched *through* the cloak, through Valhalla itself, and into Grid's torso. He convulsed like he'd been hit by a car.\n\n\"**Full Moon.**\"\n\nThe circular slash carved into Grid's chest. Blood streamed down his lowered face, hidden from the cameras.\n\nBut he was smiling.\n\nThis was the Kraugel he remembered. His friend, his rival—finally back in true form. The self-confidence Grid had been craving blazed through every exchange.\n\nThe earth never stopped shaking. Neither of them could pause—Grid too busy deflecting razor-sharp strikes to even wipe the blood from his eyes. The White Tiger Sword's unique rating meant its weight-shift ability was a genuine threat. He couldn't meet it head-on.\n\n*Careful. Wait for a clean opening.*\n\nKraugel's assault halted, forced to defend against Grid's instant activation of Unbreakable Justice.\n\n\"**Weapon Ascension.**\"\n\nSword energy screamed skyward. Even blocking, Kraugel took damage, blood misting from the impact. He twisted into an upward slash. Grid dodged—then looked up.\n\nHis sword energy was still rising, tearing through the clouds, disrupting the Storm Demonic Energy Field's deployment.\n\n*Was that intentional?*\n\nThe thrill of fighting someone who thought three moves ahead sent electricity down Grid's spine.\n\n\"**Link.**\"\n\nFaster than the Hero version. Kraugel hadn't fully adapted to the accelerated sword dance tempo. Control Sword failed to intercept—he was forced to evade.\n\n\"...\"\n\n\"...\"\n\nBoth were breathing hard now, though neither would show it. They locked eyes across the scarred battlefield.\n\nKraugel slid the White Tiger Sword back into its sheath. Drew himself into the iaido stance.\n\nTesting the range.\n\n\"...\"\n\nThat yellow dragon *dopo* rippled in the wind, the embroidered serpent seeming to writhe across Kraugel's back. Black hair, matted with sweat and blood, framed eyes of perfect calm.\n\nAs Peak Sword had proven countless times, the sword-drawing stance was equivalent to a drawn bow. Grid was already in the kill zone. Advance or retreat—it didn't matter.\n\nHe was already within Kraugel's range.\n\nPeak Sword's quiet voice cut through the eliminated players' observation room. \"...Time starts flowing again the moment Grid moves.\"\n\nHe couldn't bring himself to add that Grid was at a severe disadvantage.\n\n\"...\"\n\n\"...\"\n\nPerfect stillness. Only the God Hands drifting overhead and the four Control Swords maintaining their orbit proved time hadn't frozen. How long had they been fighting? It felt like hours since the explosion.\n\n*...Item Creation.*\n\nWithout breaking eye contact with Kraugel's ready stance, Grid activated the skill. The Immediate Item Completion Scroll from the Reputation Store materialized in his inventory.\n\n---\n\n『...』\n\n\"...\"\n\nThe commentators had been silent for minutes. The spectators sat in stunned quiet.\n\nIn retrospect, the signs had been everywhere. S.A Group's constant refrain: *'This will be a competition created by players.'* The Overgeared members exploiting the Four Heavenly Kings' weaknesses first. Kraugel refusing to cooperate with the raid despite the inevitable backlash.\n\n『...The puzzle pieces fit. The person fighting Kraugel right now is the real Grid.』\n\nEven when the Demon King used abilities identical to the Hero's. Even when Zibal *shouted Grid's name*—they'd refused to believe it. Accepting it would have shattered their understanding of what was possible.\n\nBut now, with the Demon King's true face revealed, denial was no longer an option.\n\n『Demon King Grid was vastly stronger than base Grid. Twenty times the health, at minimum. The transformation must have provided extraordinary buffs.』\n\n『Exactly. No other explanation for soloing four hundred players. We should consider the current Grid as fundamentally separate from the Demon King version.』\n\nRationalization, not diminishment. They were *trying* to make sense of it.\n\n\"...\"\n\nThe stadium held its breath. Millions of viewers watched in silence, unable to hear the commentators' trembling voices. Logic didn't matter anymore. What mattered was the outcome.\n\nGrid versus Kraugel. Former peak versus current peak.\n\nThird confrontation.\n\nFinal clash.\n\nWho would win?\n\nThe entire world understood, instinctively, that this was the last time these two would meet like this. Throats tightened. Hands clenched.\n\n\"Doesn't matter who wins! I'm cheering for both!\"\n\n\"**AAAAHHHHH!**\"\n\n*This* was why everyone had obsessed over the PvP bracket. Not nationalism. Not prize money.\n\nThis reunion.\n\nThe unfinished story between two legends, finally reaching its conclusion. The chapter everyone had been waiting a year to read.\n\n\"Take it, Grid!\"\n\n\"Kraugel, this is yours!\"\n\n\"God, just—both of you win somehow!\"\n\nThe Demon King Subjugation, intended as the grand finale, had been reduced to a mere opening act. The real event was unfolding now.\n\nEven S.A Group hadn't predicted this.\n\n\"I'm worried their names will completely overshadow the National Competition itself.\" Yoon Sangmin's half-joke landed in uncomfortable silence. Nobody laughed.\n\nThe S.A Group executive boardroom felt heavy with tension.\n\n---\n\nMeanwhile, in Daejin Group's executive boardroom:\n\n\"Grid drives *our* car. No—he'll be the face of our entire conglomerate.\"\n\n\"Ohh!\"\n\n\"God Grid will be my son-in-law.\"\n\n\"...Ohh?\"\n\nChairman Lee Jinmyung's declaration drew reactions disturbingly similar to unhinged internet comments. Several executives looked deeply uncomfortable. The president of Daejin Motors, however, shot both thumbs up with shameless enthusiasm.\n\n\"God Grid as your son-in-law! Truly worthy of the God Chairman!\"\n\n\"...\""
}