{
  "id": 964,
  "title": "Chapter 963",
  "content": "People called Yura blessed. No phrase fit her better. Born with every advantage—talent spanning multiple disciplines, striking beauty, an upright character untouched by arrogance—she shone in everything she did.\n\nHer achievements in Satisfy had become her wings. When other Korean rankers abandoned the first National Competition, she stood alone, shouldering her nation's honor. That responsibility made her a role model. Praise flowed endlessly, and Yura accepted it. She believed she deserved it.\n\nThen she met Grid.\n\nGrid was her opposite in every way. Where she had talent, he scraped by on stubbornness. Where luck blessed her path, misfortune hounded his. He must have fallen countless times. She could picture him collapsing from setbacks, sleeping with tear-stained cheeks.\n\nBut he never quit.\n\nSteel forged through flame—that was Grid. While others gazed at mountaintops, he focused on the next hill. When others climbed ten steps, he took one. When they rested, he kept moving. Slow. Steady. Relentless.\n\nMisfortune grabbed at his ankles with every stride. He endured. When rare fortune came, he didn't rest on it—he worked harder. Eventually, impossibly, he reached the summit.\n\nYura congratulated him then. Truly. Sincerely. She respected the brutal road he'd walked, understood better than anyone in the world just how extraordinary his achievement was. Even with all her natural gifts, she could never be the best.\n\nThat realization crushed her pride like glass.\n\nShe couldn't accept it—being born with advantages everyone else lacked, yet still falling short. So she pushed herself harder. Tried again and again. She had to prove herself worthy, erase this shame, before she could face him as an equal.\n\nShe failed.\n\n\"...\"\n\nDuring the fourth National Competition, gold and silver medals hung around her neck. They felt hollow. Yura's eyes trembled as she stared at the monitor, despair bleeding through her composure. The Demon King on screen was Grid. Grid was in Hell, facing hundreds of weapons alone, while humanity booed and cursed his name.\n\n\"Why...\"\n\nSpears and swords pierced his flesh. Blood painted him crimson. Every scream twisted her heart.\n\n\"...Why go this far...\"\n\nShe didn't understand why he'd become the Demon King. Wealth? Glory? Some vague desire? But victory wasn't necessary—four hundred against one was absurd, unwinnable. Grid could achieve his goal without this. He must have some contract with S.A. Group guaranteeing that.\n\nYet he fought to win.\n\nHis fingertips wouldn't respond. Blood choked his screams. Still, his fighting spirit never wavered. Yura understood why.\n\n*'There will be someone fighting to protect you.'*\n\nHe'd said those exact words.\n\nSince then, her grandfather's calls had stopped. Shrewd as always, Yura pieced together what happened behind her back.\n\n\"Why...\"\n\nGrid survived the initial onslaught. A massive explosion carved through hundreds of players. Eighty remained. He squeezed out his last reserves of strength, weathered crisis after crisis, even lost his immortality.\n\nThen the last enemy fell.\n\nGrid stared into the camera before turning toward his old rival Kraugel. Through his broken mask, his eyes found Yura directly.\n\n*'Believe in me.'*\n\nThe same look he'd given her before.\n\nPain lanced through Yura's chest. What Grid was doing—fighting for her—it meant something. Everyone else thought she could handle anything alone. A superwoman who needed no help.\n\nBut Yura wasn't a superwoman. Better than most, yes. Capable of solving everything alone? No.\n\nHer vision blurred. Fists clenched white-knuckled. Viola's hand landed on her shoulder. When had she arrived?\n\nViola thought Yura truly was delicate after all.\n\n***\n\n\"...\"\n\n\"...\"\n\nSilence stretched between them. Overhead, four swords and golden hands clashed in tireless fury. The audience didn't realize both fighters teetered on the edge of mental exhaustion. Kraugel concentrated on controlling four blades simultaneously. Grid read attack timings while designing an item in his head. Neither could achieve their normal focus.\n\nThe God Hands and controlled swords collided eighty-nine times. Magic Missile struck one blade, sending it tumbling toward Kraugel's feet. Grid spotted his opponent's right shoulder dipping. Kraugel drew.\n\nThe flash reached Grid the instant he equipped Doran's Ring. Point-one seconds too late.\n\n**[You have suffered 18,500 damage!]**\n\n**[Doran's Ring is equipped.]**\n\nThe ring's effect failed—equipped after damage, not before.\n\n\"Kugh...!\" Grid's face twisted. He stepped back, raising the Enlightenment Sword. Steel met steel as Kraugel's follow-up swing crashed against his guard.\n\n**[...The black flames have exploded!]**\n\n**[The target has received 3,200 damage.]**\n\nKraugel had already reached communion with the Enlightenment Sword. The Sword Saint's class ability saw through its nature, reducing the black flames' damage. He penetrated the inferno and kicked Grid's chest.\n\nAnother wasted opportunity. Doran's Ring restored a mere 900 damage from the kick.\n\nKraugel rotated diagonally. The White Tiger Sword rose from below, aimed straight at Grid's chin.\n\nGrid activated Weapons Ascension, reading the exact timing through high insight and the Slaughterer's Eye Patch's power. Bottom-up attacks were predictable when fighting bosses—Grid excelled at countering them. He twisted his head aside and swung the Enlightenment Sword in retaliation.\n\n\"...?!\"\n\nA stone pillar erupted along the White Tiger Sword's path, slamming into Grid's abdomen.\n\n> **When attacked, there is a normal chance of 'Pillar' being released. The giant stone pillar has a blasting effect of up to five meters. The damage applied is 50% of the weapon's attack power.**\n\nThe World Crushing Sword of the Noble White Tiger's passive effect.\n\nGrid flew backward, smashing into the half-destroyed pipe organ. He shook his head, staggered upright—\n\nA blade tip filled his vision. Aimed directly between his eyes. Instinctive terror flooded his nervous system, demanding immediate response.\n\nGrid moved to block, then hesitated. This wasn't Kraugel's most threatening attack. Just before piercing Grid's face, the White Tiger Sword twisted trajectory like Pinnacle Kill—\n\nThe Enlightenment Sword intercepted it.\n\n\"...\" \n\nKraugel's expression darkened, though he tried hiding his surprise. Several times now, Grid had read him. When he flew on his knees. When he dodged bottom-up attacks twice. Each moment sent a thrill down Kraugel's spine.\n\nThe man before him had evolved into something equal.\n\nGrid was no longer the Overgeared King compensating for inadequate sense, judgment, and ability with superior gear. The Hero King had battled countless heroes, accumulated vast experience. His pressure felt completely different from the Hero—that artificial intelligence displaying abilities at an excellent but predictable level.\n\nGrid's current prowess threatened Kraugel's innate senses and talent.\n\n\"Pinnacle!\" Grid's superior strength forced the White Tiger Sword back.\n\n\"Tearing the Sky.\" Kraugel countered immediately.\n\n\"Revolve!\" Grid responded in kind.\n\nUnease gnawed at Grid's mind. When both fighters possessed one counter skill, whoever used it first faced overwhelming disadvantage.\n\n*Could Kraugel have developed a new counter technique?*\n\nIce raced down Grid's spine. Kraugel created new sword skills constantly.\n\n\"Quick Command.\"\n\n\"...!?\"\n\nBlack and white wings flashed into existence on Kraugel's back. He vanished.\n\nPinnacle's force—amplified to extremes by two overlapping counters—carved through empty ground. Kraugel reappeared on the cracked earth.\n\nThe White Tiger Sword already carved through Grid's shoulder. Triple damage stacked. Quick Command's power—one of three supreme offensive passive skills. It ignored physical laws by evading 'definite' attacks, then returned the user to their original position after four seconds with their next strike dealing triple damage.\n\nSwift and devastatingly effective. But that return mechanic could become poison. If used to dodge a wide-range attack lasting over four seconds, the user would warp back into danger. Incomplete, like Grid's God's Command with its fatal reliance on probability.\n\nOf course, if Kraugel allied with the seven malignant saints, those constraints would vanish. Yet he refused affiliation with any force—neither malignant saints nor gods. If he wanted to join a side, he would've joined a guild already.\n\nOnly one guild had ever tempted him.\n\n*'Mine is Overgeared.'*\n\nGrid didn't know this. He ground his teeth. From his perspective, God's Command was absolute garbage. He'd lost over a third of his health while Kraugel bore only minor injuries.\n\nThe world held its breath watching two men clash without summoning pets or drinking potions, as if bound by unspoken agreement. Even chicken shop owners forgot their ringing phones, transfixed by their screens. Wave shattered the ground. Splitting the Sky swept toward the heavens.\n\nThe battlefield constricted. The gap between Grid and Kraugel shortened. Collisions multiplied. Grid borrowed the Slaughterer's Eye Patch's power, slashing at Kraugel's waist. Kraugel relied on Super Sensitivity to save himself from fatal injury, cutting Grid's thigh.\n\nMany realized Grid faced an uphill battle as exchanges accumulated.\n\nThen Grid finished crafting his item.\n\n\"Item! Production!\" he shouted like an anime protagonist.\n\n『 ...? 』\n\n\"...?\"\n\n\"...?\"\n\nMaking an item... during battle? Commentators, spectators, viewers—all sweated bullets. Too absurd for words.\n\nGrid didn't care.\n\n\"Blue Dragon Sword Breaker!\" \n\nBrilliant light erupted from his left hand. A dark blue blade wreathed in electric currents manifested. The blade forged from Great Demon Astaroth's remains featured a deep groove running its length.\n\nCameras caught Kraugel's eyes widening.\n\nOnline communities worldwide exploded.\n\n—*A sword breaker against the Sword Saint ;;*\n\n—*Wow! A super cheap deadly move!*\n\n—*That light...*"
}