{
  "id": 965,
  "title": "Chapter 964",
  "content": "The waiting room buzzed with tension as eliminated players watched the screens in silence. Their minds churned with questions—why had Grid been chosen as the Demon King? What rewards was he receiving? Was this preferential treatment they could challenge?\n\nYet no one spoke. Every eye remained locked on the battle unfolding above. This was a rare opportunity to witness two of the world's strongest players clash at full strength, and they refused to miss a single moment.\n\nMinutes passed. The fierce exchange gradually shifted in Kraugel's favor, and then—Grid drew a new weapon. A sword breaker.\n\nHe shouted something about crafting it on the spot, though clearly he'd pulled it from his inventory. Still, the intent was unmistakable.\n\n\"A sword to break swords,\" someone murmured. \"Obviously designed to counter the Sword Saint.\"\n\n\"Will it even work, though?\"\n\n\"No one uses those things anymore.\"\n\n\"Without the right passive skills, they're nearly impossible to control.\"\n\n\"Grid experimented with one years ago. For like, five minutes.\"\n\nJishuka turned to Chris, her brow furrowed. \"This seems reckless.\"\n\nThough an archer, Jishuka had studied swordsmanship extensively. She'd devoted herself to understanding every combat discipline, hoping to apply those concepts to archery and cover its weaknesses. She wanted to reach the absolute peak, and that required comprehensive knowledge.\n\n\"I think he's making a mistake,\" she admitted, tension creeping into her voice.\n\nFrom everything she'd observed, Grid fought by faithfully executing techniques he'd learned through experience. His accumulated knowledge was vast enough to handle most situations, but his creativity... that was limited.\n\nKraugel, by contrast, was creative from start to finish. His experience matched Grid's, yet his lower stats and the quality gap in his items put him at a disadvantage. This was already their fourth confrontation.\n\nGrid would be pushed onto the defensive. Hard.\n\nTalent—that was the difference. Grid worked relentlessly to compensate for his lack of natural genius. His control surpassed most players here, certainly, but against Kraugel? The gap was insurmountable. Even with the threatening sword breaker, there was no guarantee Grid could wield it effectively. Kraugel might deflect it entirely, and Grid would pay dearly for using an unfamiliar weapon.\n\nJishuka bit her nail, unable to shake her unease. She couldn't understand why Grid had made this choice.\n\nChris stroked his chin. \"It's definitely risky. If Kraugel's a professional race car driver, then Grid's... a regular guy with two years behind the wheel.\"\n\n\"Too harsh,\" Jishuka snapped. \"Give our Grid more credit than that.\"\n\n\"I'm not trying to disparage him. It's just an honest comparison—\"\n\n\"Three years. Call it three years of experience.\"\n\n\"...Fine.\"\n\n*What's the difference between two and three years?* Chris resisted the urge to argue, recognizing the fierce protectiveness in Jishuka's tone. She was violent and terrifying at times, but for Grid? She'd make an exceptional wife. Devoted beyond measure.\n\nHe shook his head and continued at her prodding. \"So if Kraugel's a professional driver and Grid has four years of experience—\"\n\n\"Three years.\"\n\n\"Right. Four years of experience versus a professional—the gap is obvious.\" Chris smiled. \"But here's the thing. Kraugel's driving a Chinese knockoff. Grid's driving a Ferrari.\"\n\nThey knew Grid better than anyone. Between raw talent and overwhelming gear, which concept reigned supreme?\n\nBeing overgeared. Always.\n\nGrid proved it repeatedly. Would he really pull out an ordinary sword breaker after directly experiencing Kraugel's superior technique? Impossible. That weapon was a Ferrari. A Lamborghini. Something that would compensate for his relatively inferior skills.\n\nChris was certain.\n\nOn the screen, the sword breaker clashed against Kraugel's blade.\n\nThen something extraordinary happened.\n\nThe weapon *pulled* at Kraugel's sword, dragging it into the grooves along the blade's edge with magnetic force.\n\n\"What the—\"\n\n\"What kind of effect is that?!\"\n\n\"How does that even work?!\"\n\nThe waiting room erupted. Players surged forward, stunned.\n\nJishuka clasped her hands together and shouted in excitement. Chris's eyes widened.\n\n*Is that a Bugatti?*\n\n***\n\n**[Blue Dragon Sword Breaker]**\n\n**Rating:** Legendary  \n**Durability:** 350/350  \n**Attack Power:** 695  \n\n* Attack speed +40%  \n* +50% lightning damage  \n* +30% shadow damage  \n* Emits a magnetic field with high probability of attracting sword-type weapons  \n* When a sword is pulled, decreases target weapon's durability. If target weapon is below epic rating, normal chance of activating **Weapon Destruction**—completely destroys target weapon regardless of current durability.  \n\n*A sword forged by the legendary blacksmith Grid. Deep grooves along one edge form a saw-like blade designed to catch and shatter swords. Every swordsman in the world should fear this weapon.*\n\n*Enhanced with Strengthened Blue Dragon's Breath and Astaroth's Horn, elevating its lightning properties to their peak.*\n\n**Requirements:** Level 300+, Advanced Sword Mastery Lv. 1 or higher  \n**Weight:** 280\n\n***\n\nThe sword breaker crackled with blue lightning. Its form was unconventional—the blade short and thick, clearly not designed for conventional attacks. The fine grooves reduced the total metal content, seemingly weakening its structural integrity.\n\nYet its threat was undeniable. No swordsman could face a weapon *born to break swords* without fear.\n\nIf Kraugel were an ordinary swordsman, the pressure would have been overwhelming. But as the Sword Saint—the absolute master of all bladed weapons—he wasn't shaken.\n\nKraugel unleashed a torrent of strikes, driving Grid backward with explosive force. The White Tiger Sword lashed toward Grid's right side. Grid blocked with the Enlightenment Sword while sweeping the sword breaker toward the White Tiger Sword—quick, ruthless.\n\nBut even that speed had limits.\n\nKraugel slid along his own blade and closed the distance, driving his elbow into Grid's left wrist. The sword breaker, reaching for the White Tiger Sword, jerked toward the ground. Kraugel slammed his shoulder into Grid's chest, then whipped his blade upward again.\n\nThe White Tiger Sword struck like a serpent, disrupting Grid's mental rhythm with each slash. Grid retreated. Close combat was suicide against this level of technique.\n\nStill, Kraugel didn't relent. He clung to Grid viciously, denying him the space to properly swing either weapon. Fists flew alongside sword strikes. His storm-like assault at close range left even the commentators speechless.\n\nYet Grid didn't falter. The fiercer Kraugel's offense became, the calmer Grid grew. Most of his accumulated experience came from desperate, life-or-death battles. Grid fought *better* when the situation worsened.\n\n*Divinity. Item Combination.*\n\nGrid clenched his teeth and activated the skill, merging his equipped Valhalla of Infinite Affection with the Triple Layers beneath it.\n\nTwo armors. Fused.\n\nPhysical damage reduced by 30%. Cutting and stabbing damage reduced by 50%. And the passive—**Sword Breaker**—transferred from Triple Layers to the combined armor.\n\nGrid's expression shifted.\n\n\"...?!\"\n\nKraugel's eyes widened as his thrust connected.\n\n**[Target received 3,880 damage.]**\n\nIt wasn't just the dramatically reduced damage.\n\n**[Domineering White Tiger Sword's durability decreased by 25!]**\n\nThe sword Grid had forged and gifted to Kraugel *screamed* in protest.\n\n*He added the sword breaker effect... to armor?*\n\nThat was... borderline underhanded.\n\nKraugel's composure cracked. He stepped back—only for the Blue Dragon Sword Breaker to slash toward him. Despite its shorter reach compared to the Enlightenment Sword, it was dangerously close.\n\nKraugel reacted instantly, attempting to deflect the blow by sliding his sword along the breaker's edge, avoiding the grooves.\n\nIt didn't work.\n\nThe blade that should have been one with him refused to obey. The White Tiger Sword jerked sideways, pulled by invisible force, and locked into the saw-like teeth. Magnetic attraction.\n\n*What?*\n\nKraugel's blood ran cold. The sword breaker rendered technique irrelevant. It was an absurdity *more* deadly against those at the pinnacle of swordsmanship—a predator that violated the very concept of skill.\n\n\"Pinnacle Kill.\"\n\nThe strike carrying suffocating killing intent descended toward Kraugel's chest. Kraugel frantically *ripped* the White Tiger Sword free from the magnetic grip.\n\nThe price was steep.\n\n**[Domineering White Tiger Sword's durability decreased by 153!]**\n\n\"Kugh...!\"\n\nOver a tenth of his sword's durability—*gone* in a single exchange.\n\nKraugel's face twisted. He activated **Quick Command**, illusory wings spreading as he flickered out of position. It was exactly what Grid had anticipated.\n\n\"**Fly**.\"\n\nGrid canceled Pinnacle Kill mid-swing and launched into the air—not to track Kraugel, but to target the four Control Swords battling the God Hands.\n\n*Don't tell me—*\n\nKraugel paled, reading Grid's intent. Quick Command finished, and he snapped back to his original position—just as Grid shattered all four swords facing the God Hands.\n\nThe newly freed God Hands unleashed Magic Missiles at Kraugel.\n\nKraugel triggered **Sword Curtain**, blocking the barrage.\n\nGrid's voice rang out from above. \"Do you have thirty swords? Bring them all out.\"\n\nHe floated in the sky, arms folded, four golden hands arrayed around him like guardians. The sight was achingly familiar to everyone watching—but somehow even more domineering, more arrogant than when he'd played the Demon King.\n\n\"**Transcended Link**.\"\n\nA storm of energy blades scoured the ground. The God Hands wielding Mjolnir dove toward Kraugel. Kraugel deployed True Clouds and Control Sword, attempting to intercept them—\n\nGrid appeared like a phantom and obliterated every summoned blade.\n\nSword fragments scattered across the arena, each piece reflecting Kraugel's face like a shattered mirror. Hundreds of fractured reflections.\n\nFor the first time, Kraugel wore an expression no one had ever seen.\n\nConfusion.\n\n\"...It's over soon.\"\n\nThe players in the waiting room felt it in their bones. Their voices rose, mingling awe with exhilaration.\n\nThey had witnessed the ideal they should pursue."
}