{
  "id": 966,
  "title": "Chapter 965",
  "content": "**Chapter: The Demon King's Final Stand**\n\nKraugel—a man whose achievements transcended mortal limits—fled.\n\nNo other word fit. The Sword Saint retreated, each step calculated to maximize distance from his pursuer. The moment Control Sword lost its effectiveness, the four golden constructs became unstoppable. God Hands hammered through terrain and air alike, indifferent to elevation or obstacles. They came for him with mechanical precision.\n\nThrough Kraugel's narrowing field of vision, Grid advanced. The accumulated fighting energy wreathed him in crimson light—100% maximum output. Every stat amplified. Strength and agility now exceeded Kraugel's by a devastating margin.\n\nA blade materialized from Kraugel's inventory. Control Sword deployed, streaking toward Grid's throat. It struck true—then tangled with the Blue Dragon Sword Breaker's magnetic field and exploded into fragments. Another sword lost. How many remained? Five? Four?\n\nThe battlefield had become a demonstration of overwhelming force. Grid pushed forward behind the God Hands' barrier while the sword breaker devoured Kraugel's arsenal, one blade at a time. Each weapon that met the azure lightning shattered like glass.\n\n*-...This is what 'overgeared' actually means.*\n\n*-Is Grid selling these? I need fifteen.*\n\n*-Sure, just mortgage your house.*\n\n*-Do you own a house worth twenty billion won?*\n\n*-As if he'd sell it for that. Everything Grid makes stays with Overgeared Guild.*\n\n*-So if I join Overgeared...*\n\n*-They don't accept just anyone, genius.*\n\nEvery eye in the arena fixed on Grid's left hand. The sword breaker crackled with blue lightning, circuits of power flowing across its surface. In a single match, the weapon had elevated from 'exceptional equipment' to 'Earth's greatest treasure'—a masterpiece coveted by millions watching worldwide.\n\nIn the waiting room, Peak Sword stroked his chin thoughtfully. *'We should register Grid's works as national treasures.'* This precise sentiment explained why he chaired South Korea's Patriotic Association.\n\nAnother sword disintegrated against the breaker.\n\nKraugel stopped retreating.\n\nHe gathered power in his toes, muscles coiling—then exploded upward like a spring trap.\n\n\"—!\"\n\n*Fast.*\n\nGrid registered the movement a heartbeat too late, his sword breaker still completing its follow-through. White Light Steps propelled Kraugel across the distance instantly. Goosebumps rippled across Grid's arms.\n\n\"Meteor Sword.\"\n\nEnergy erupted from Kraugel's blade in a concentrated lance.\n\nGrid dropped low, boots finding purchase. \"Kill!\"\n\nEven with pressure crushing his shoulders, Grid unleashed the counter. Naturally, he used the Enlightenment Sword. The sword breaker's fundamental damage output lagged too far behind, penalties crippling any skill channeled through it.\n\nThe collision between Meteor Sword and Kill tore through the battlefield. Shockwaves radiated outward fifty meters, toppling the decorative marble columns distributed across the arena floor. Without a roof to support, the pillars simply fell—expensive rubble.\n\n\"Condemnation Sword.\"\n\n\"—!?\"\n\nKraugel had been pacing himself, mixing skills with basic attacks to manage cooldowns and maximize effect windows. Why chain skills now?\n\nGrid's confusion lasted half a second before he responded with Drop, footwork already shifting into Linked Kill Wave Pinnacle's opening stance. Instinct screamed danger. Condemnation Sword wasn't Meteor Sword's equal—it rivaled Space Sword itself.\n\nThe interwoven techniques roared. Black flames erupted across stone pillars that thrust from shattered ground. Two God Hands intercepted the spire targeting Grid's ribs. The other two hammered toward Kraugel's face, only to meet White Tiger Sword in defense.\n\nAs the aftershocks faded, Grid swung the sword breaker to shred White Tiger Sword's durability. Kraugel reversed his grip, angling the blade outside the magnetic field's range. He'd mapped the effective radius. Control Sword no longer wasted itself.\n\nWhite Tiger Sword aimed for Grid's collarbone—the junction between Valhalla and Triple Layers, where fewer barbs protected the gap. The durability drain halted. Kraugel's knee drove into Grid's chest, creating space. He recovered his weapon and activated Space Sword.\n\n*Ah.*\n\nToo late, Grid understood. Kraugel had shifted to skill-spam tactics specifically to neutralize the Blue Dragon Sword Breaker. The strategy held merit—the breaker couldn't match skill-amplified attacks in direct collision.\n\nBut resource limits existed. Could Kraugel sustain a pure skill rotation?\n\n\"Freely Move.\"\n\nGrid activated the ability granted by his Secret Hero title. Last year, this skill had carried him beyond Space Sword's reach. Now he'd close the distance through the dimensional cut, then end the match with Linked Kill Wave Pinnacle—cooldown refreshed by God's Command.\n\nThe evasion failed.\n\n\"—?!\"\n\nKraugel's Space Sword had evolved into a targeting-type skill. Just as legendary blacksmiths refined equipment through cycles of creation, disassembly, modification, and transformation—Kraugel configured his swordsmanship, enhancing and altering its properties. The ultimate technique that lost to Freely Move last year had been restructured into a homing attack.\n\n**[You have suffered 32,090 damage!]**\n\n**[Your left arm has been severed!]**\n\n**[Agility and Strength drastically reduced due to limb loss!]**\n\n\"**KUAAAAK!**\"\n\nBlood erupted in an arc between heaven and earth, both split apart by the technique. Grid clutched his shoulder and collapsed. The Blue Dragon Sword Breaker—which had dominated the entire battle—fell with his severed arm.\n\nKraugel didn't hesitate. He surged forward, blade descending without mercy. Every cut carved away Grid's remaining health.\n\n**[Target has received 4,120 damage.]**\n\n**[White Tiger Sword durability decreased by 21.]**\n\n**[Target has received 4,390...]**\n\n**[White Tiger Sword durability...]**\n\nFragments of the White Tiger Sword scattered through Grid's blood. His health plummeted toward zero. The God Hands, once again ensnared by Control Sword, hung motionless. Complete reversal.\n\n『T-This is unbelievable...!』\n\n『Grid has suffered catastrophic injury and can't even defend himself...!』\n\nCommentators' voices cracked with shock. Half the audience roared approval. The other half sat frozen. Amid the chaos, a face surfaced in Grid's fading consciousness.\n\nYura.\n\n*I can't lose.*\n\nHe remembered arriving at that school reunion, emotions raw and unstable. Without her intervention, he'd have remained entangled with Ahyoung for months. When hair loss from tax stress had driven him to desperation, Yura's recommendation had proven as effective as Vantner's veteran advice. She'd been there through the darkest period. Saved his youth, in a sense. He'd wanted to embrace her properly.\n\n*She fought for me. On broadcasts. Every single time.*\n\nHe sometimes dreamed of their restaurant visit—her pleasant company, the way she smiled. He'd always known Yura was beautiful. That day, he'd discovered she could be adorable. For the first time, he'd truly registered that she was younger than him.\n\nHe didn't want to lose her. She belonged beside him.\n\n**[You have lost 3,250 health.]**\n\nWhite Tiger Sword weakened as sustained damage eroded its structure. But Grid's situation matched—worse, even. The shield from First King title, healing from Tiramet's Power, lifesteal from Cray's Power—every survival mechanism exhausted during the battle's grueling duration.\n\nKraugel was no different. His cards were spent.\n\nWhile Daejin Group's chairman shouted himself hoarse, while Yura's eyes clouded with tears, while Chris debated Ferraris versus Bugattis—\n\nGrid and Kraugel had fought without pause. Dozens of minutes of ferocious combat, every technique deployed. Neither possessed survival cards any longer.\n\nNone related to *survival*, anyway.\n\n\"Storm Demonic Energy Field.\"\n\nThe clouds Kraugel had torn through at the battle's opening had scattered to wind. New formations had gathered overhead—dense, heavy with moisture. Rain and lightning both waited in those depths. Grid saw them clearly now. Losing his arm had forced his gaze upward.\n\n\"—!\"\n\nGrid's health sat below 5,000. Kraugel hesitated, unable to deliver the finishing strike—\n\nLightning hammered the ground where he stood.\n\nNot a single bolt. A barrage targeted the Sword Saint's position, chasing his movements. Kraugel relied on Super Sensitivity to evade, awareness pushed to absolute limits.\n\nGrid rose.\n\nHe reclaimed the Blue Dragon Sword Breaker from the blood-soaked arena floor. Enlightenment Sword went between his teeth. The sword breaker filled his remaining hand.\n\nDivinity—a skill that eliminated casting time and cooldowns for blacksmithing abilities. Once per day, up to two uses in a single activation. Twice.\n\n*Item Combination.*\n\nEnlightenment Sword and Blue Dragon Sword Breaker unified.\n\n*Item Enhancement.*\n\nGrid attempted to consume his remaining enhancement scrolls. Time ran out. Kraugel was already attacking again, strikes flowing in an unbroken sequence. Using scrolls mid-combat against this opponent? Impossible.\n\n\"Crushing Sword!\"\n\n\"100,000 Army Massacre Sword.\"\n\nThe sword breaker had become one with the Enlightenment Sword. Now it channeled his ultimate techniques. White Tiger Sword exploded into fragments. Kraugel entered Immortal State. Single-armed and stat-crippled, Grid still unleashed 100,000 Army Massacre Sword—thirty consecutive strikes through Item Combination's amplification. Devastating.\n\nGrid paid the price. Crushing Sword fractured his remaining wrist and shattered equipment. His arm hung limp. His health evaporated. Immortal State activated.\n\n\"**Kraugel!!**\"\n\n\"**Grid...!**\"\n\nKraugel drew a replacement blade for his destroyed White Tiger Sword. Grid lunged toward the momentary vulnerability, attack speed crippled by his fractured wrist. The counterattack missed. In that window, Kraugel armed himself.\n\nAnother sword met the combined weapon.\n\nShattered.\n\nAnother sword drawn—\n\nBroken.\n\nThe cycle repeated. Grid and Kraugel's immortality durations expired simultaneously.\n\nEvery remaining blade in Kraugel's inventory manifested at once—five swords, a final assault. The rain of steel descended toward Grid.\n\nKraugel followed. He chanted Poem that Praises the Sword, body becoming one with his weapon, consciousness unified with cutting edge. The killing thrust aimed for Grid's heart.\n\nBlocked.\n\n\"Linked Kill Wave Pinnacle.\"\n\n\"—!?\"\n\nThe skill everyone called garbage without high Luck. The variable named God's Command. Five swords disintegrated against Linked Kill. Pinnacle fell upon Kraugel's steel-transformed body.\n\nHis vision dissolved to gray. Red text appeared.\n\n**[The Demon King Subjugation has failed.]**\n\nGrid had won.\n\nA wild grin split Grid's face. He spoke to himself, voice barely audible.\n\n\"Daejin Motors.\"\n\n\"...?\""
}