{
  "id": 967,
  "title": "Chapter 966",
  "content": "The broadcast lingered on Grid as he surveyed the devastated arena. Where marble columns and ornate tapestries had once stood, only rubble remained. The ceiling had collapsed. Shattered pillars lay as dust. The grand organ that had filled the space with music was now mere kindling.\n\nAlone in the ruins, the Overgeared King's expression shifted through a dozen emotions. His wounded face seemed caught between laughter and tears—the elation of victory warring with regret over what the victory had cost. But beneath it all was something else. A depth in those dark, sunken eyes that captivated everyone watching.\n\nGasps rippled through the stadium. Grid was only thirty. Four years ago, when he'd first appeared on the world stage, every emotion had been written plainly across his face. Now, standing in those ruins, he had become something else entirely. The world held its breath.\n\n\"...Daejin Motors.\"\n\nThe words fell like stones.\n\nThe spell shattered. Hearts that had been racing cooled in an instant.\n\n*—Did he seriously just drop a sponsorship?*\n\n*—The second coming of Comet Group.*\n\n*—I can't with this guy.*\n\nFor four consecutive years, Grid had topped the list of 'Most Desired Spokesperson' among advertisers worldwide—despite refusing every offer. This was why. When he chose to promote something, he owned the moment completely.\n\n***\n\nChaos erupted in the Daejin Group boardroom.\n\nReports flooded in from every continent. Within minutes, \"Daejin Motors\" had claimed the top search term across Asia, Europe, the Americas, Africa, and Australia. The entire planet was suddenly interested in a Korean automotive brand.\n\nEven if much of that interest was negative, it didn't matter. Noise marketing existed for a reason. Global brand recognition—achieved in seconds.\n\n\"YES!\" The Daejin Motors president shot to his feet while his counterparts from other subsidiaries watched with barely concealed envy. \"That's Grid for you! My future grandson-in-law is something else! But how did he time it so perfectly?!\"\n\nThe man was practically vibrating. Billions of viewers. Peak ratings. The kind of exposure that couldn't be bought for any price.\n\nChairman Lee Jinmyung, however, remained perfectly still.\n\nHe knew better than to rush when opportunity knocked. Leaning back in his chair, fingers steepled, he considered every angle before speaking. \"Don't release the promotional materials.\"\n\n\"I—I'm sorry?\" The PR director blinked.\n\nThis was the moment. Grid's name dominated every conversation on earth. He'd rejected offers from the world's largest companies. If news spread that he'd chosen Daejin Group instead, the publicity would be astronomical.\n\nYet Lee Jinmyung, who had approved the campaign an hour ago, was now calling it off. The PR director stood frozen in confusion, not daring to question the chairman's reasoning. The Daejin Motors president, emboldened by his excitement, asked what everyone was thinking. \"Chairman, I must confess I don't follow your thinking. Could you share your reasoning?\"\n\n\"I'm going to trust Grid. His words carry more weight than a thousand press releases.\"\n\nChairman Lee Jinmyung had initially dismissed Grid as a talented young man blessed by circumstance—a dragon hatched in a humble stream through sheer luck. He'd been wrong.\n\nGrid had described himself as \"stupid\" during their first meeting. Terrible humility, that. Because the chairman now understood the truth.\n\n'The boy's a genius.'\n\nHe would leverage this situation brilliantly. Looking back, even the timing of his approach regarding Yura had been calculated.\n\n'Those eyes...'\n\nIt sounded like something from a novel. In seventy years, Chairman Lee had met thousands of people. He'd never once thought to describe anyone's gaze as \"deep.\" Yet there Grid stood on that screen, thirty years old, and those eyes held depths that shouldn't exist in someone so young. The dragon's ascent wasn't finished. Grid would climb much, much higher.\n\n'Perhaps he dreams of empire...'\n\n*Thump. Thump.*\n\nThe old man's heart hammered in his chest. For the first time in decades, he felt it—the desire to be part of something greater. To help someone exceptional achieve their potential. Not just because Grid was courting his granddaughter. Because Grid himself was worth following.\n\n***\n\nThe Demon King Subjugation awards ceremony had the energy of a wake.\n\nThe event had ended. The players had secured five medals—gold, silver, and bronze distributed among those who'd contributed to defeating the four heavenly kings and the Demon King himself. These were the *minimum* guaranteed rewards. Had they actually succeeded in the subjugation, three additional medals would have been awarded. Most participants left disappointed.\n\nNot everyone, though. Jishuka's dominant performance had earned her two gold medals. Thanks to her, Brazil jumped to ninth in the overall rankings. Rio celebrated like they'd won the World Cup.\n\nChris's gold and silver pushed Canada to second overall. \n\nThe United States secured first place through Kraugel and Zibal's combined efforts. American pride ran hot.\n\nChina, meanwhile, seethed. They'd fallen from second to fourth—pushed down by South Korea, of all nations. Chinese representatives hadn't won a single medal while the Koreans claimed gold. Korea had leaped from sixth to third in the standings.\n\n\"Not even top three this year? When did we fall so far?\"\n\n\"Damn it... beaten by South Korea...\"\n\n\"Don't blame the players. They were sabotaged by S.A. Group, not outskilled. Think about it—how is it fair that a Korean player got to be the Demon King? The whole competition was rigged. China is the real third place.\"\n\nGiven that Demon King Grid had killed China's rising star Mei Xiao in the opening moments of the final battle, their anger wasn't entirely unreasonable.\n\nA press conference was called to address the controversy. Executive Director Yoon Sangmin of S.A. Group and National Competition Committee sat alone before nearly a thousand reporters, microphone in hand, utterly composed.\n\nThe first question came from CMM, America's largest news network. \"Billions of viewers witnessed Grid receive special treatment as the Demon King. There's widespread consensus that S.A. Group shows favoritism toward Korean players. How do you plan to address these concerns?\"\n\n\"We won't, because they're baseless. Grid received no preferential treatment.\"\n\n\"Excuse me?\"\n\n\"The Demon King Subjugation is now a permanent annual event. Each year, a qualified top-ranking player will be selected for the Demon King role, exactly as Grid was selected this year. A player may only serve as Demon King once in their career. This should clarify that the event wasn't designed specifically for Grid.\"\n\n\"You're saying next year's Demon King will receive the same rewards Grid did?\"\n\n\"Assuming they achieve the same results, yes. We've determined the Demon King Subjugation perfectly embodies our goal of 'competition that unites players.' Both participants and the Demon King will receive substantial rewards. The National Competition is meant to bring the world together.\"\n\n\"What about stat corrections?\"\n\n\"Stat corrections?\"\n\n\"The stat bonuses Grid received as Demon King. Most complaints focus on that rather than rewards. The consensus is that excessive stat inflation enabled his 1-versus-400 victory. If next year's Demon King gets the same bonuses, people will complain again. The event becomes a lottery for whoever gets lucky enough to be chosen.\"\n\n\"Ha! I appreciate the concern, but you've misunderstood. The only correction we gave the Demon King is the bare minimum to qualify as a raid boss—health.\"\n\n\"...I'm sorry?\" The CMM reporter looked lost. Before he could formulate a follow-up, other journalists jumped in.\n\n\"You're saying health was the *only* benefit?\"\n\n\"Correct. The Demon King receives 500,000 additional health every ten minutes until the gates to the final chamber are breached. That's standard raid design. An inevitable advantage.\"\n\n\"If it's 500,000 per ten minutes, and the four heavenly kings lasted one hour and thirty-eight minutes... Grid should have had 4.5 million health?\"\n\n\"Ah, no. Grid only received 200,000 health per ten minutes.\"\n\n\"What? Didn't you just say 500,000?\"\n\n\"That's the standard. Next year's Demon King will receive 500,000 per ten minutes.\"\n\n\"Then why was Grid different—\"\n\n\"Grid's four heavenly kings were too powerful. We were forced to impose constraints.\"\n\n\"...\"\n\nToo powerful, so they *nerfed* him? If the Demon King Subjugation would be held annually going forward... that meant Grid had fought under harsher conditions than every future participant would face. They'd thought he received special treatment. It was reverse discrimination.\n\nYoon Sangmin displayed the documentation. The numbers confirmed it—Grid had received only 200,000 health per ten-minute interval. More startling was the accompanying footage. Throughout the entire four heavenly kings raid, Grid hadn't complained once. He'd maintained perfect composure despite the penalty.\n\nHe'd borne it like it was his responsibility. Like anything less would shame him as the world's top-ranked player.\n\nSilence blanketed the press conference. Around the world, millions of viewers sat equally quiet. All of them, for that moment, grasped the kind of person Grid truly was.\n\nA Japanese reporter broke the spell. After receiving Director Yoon's acknowledgment, he spoke carefully. \"You mentioned the four heavenly kings were Grid's subordinates. Are you referring to NPCs in Grid's employ?\"\n\n\"Correct.\"\n\n\"Did S.A. Group provide any support for them?\"\n\n\"In the application form for future Demon Kings, it's clearly stated that the four heavenly kings must be the player's own NPCs or pets. They must use their own power to truly embody the Demon King role.\"\n\n\"What stat corrections did the four heavenly kings receive?\"\n\n\"Similar to the Demon King himself. We provided additional health to qualify them as raid encounters. However, the exact amount varies based on the heavenly king's individual level, so I can't give specific numbers.\"\n\n\"What about other stats?\"\n\n\"Nothing. For reference, this year's four heavenly kings received no health bonus at all.\"\n\n\"...What?\"\n\nGrid and his subordinates—the monsters that had each slaughtered over a hundred top players—had been fighting at their actual, unmodified strength? That meant Grid's NPCs were individually more powerful than four hundred of the world's best rankers. And Grid was a *king*. Surely he commanded more than just four subordinates.\n\n*How much power does this man actually possess?*\n\n*Could he challenge the Saharan Empire?*\n\nDirector Yoon's press conference, intended to quell controversy, had instead amplified it tenfold. Every reporter in the room was thinking about Grid. Though Yoon Sangmin continued speaking, eyes kept darting toward the clock. They were waiting. Grid's own press conference was scheduled next.\n\nBut time crawled. Minutes stretched like hours.\n\nThen Yoon Sangmin stood. The conference room doors opened.\n\nA handsome Asian man entered, his expression carved from stone. Determined. Like he had something important to say.\n\n\"I am Grid.\""
}