{
  "id": 968,
  "title": "Chapter 967",
  "content": "# Press Conference\n\n\"I am Grid.\"\n\nThe introduction was simple. Grid surveyed the conference venue with the practiced ease of a king—over a thousand reporters packed the room shoulder to shoulder. Yet his pulse remained steady. Leading a nation had taught him to weather far worse scrutiny than this.\n\nHe studied the sea of faces before him, then pointed at a blonde woman in the third row. \"You. Ask your question.\"\n\nThe selected reporter represented Canada's national broadcaster—CBC. Grid had chosen her deliberately. Unlike many of her colleagues, whose intentions he could read at a glance, she radiated nothing but professional curiosity. No agenda. No axe to grind. The perfect opening.\n\n\"Caroline Mitchell, CBC Cultural Department.\" The woman stood, composure intact despite being thrust into the spotlight. \"Congratulations on your victory. How does it feel to defeat four hundred rankers single-handedly?\"\n\n\"I'm pleased, naturally.\"\n\n\"Did you expect to win from the start?\"\n\n\"Of course not. I got lucky.\"\n\n\"In what way, specifically?\"\n\nGrid allowed himself a slight smile. The answer was complex—the fortuitous timing of Duke of Wisdom's Magic Contemplation ability, which led the enemy mages to misread his capabilities entirely. Even more crucial was Kraugel's decision not to engage. But revealing such tactical details would expose vulnerabilities he preferred to keep hidden. More than that, it would paint a target on Kraugel's back, and Grid refused to throw his rival under the bus for the sake of a sound bite.\n\n\"No comment.\"\n\nHe moved on smoothly, pointing to another raised hand.\n\n\"Director Yoon Sangmin stated that you received no special treatment—that your ability to reflect magic and summon the magic machine represents your natural capabilities. Can you confirm this?\"\n\n\"Correct.\"\n\nGrid had laid all his cards on the table during the Demon King Subjugation. The exposure carried risks, but he'd already prepared his countermeasures. Let them think Duke of Wisdom's magic reflection was an innate power. Let them believe he'd summoned the magic machine rather than duplicating it. The truth was his to protect.\n\n*They don't even know duplication is possible,* he thought. The concept remained incomprehensible to anyone outside his inner circle.\n\nThen came the curveball.\n\n\"Your magic machine is identical to Zibal's—down to the empire's emblem in the exact same location. This suggests your machine originated from the Saharan Empire. How did you acquire an imperial weapon?\"\n\nThe question was logical. Grid hadn't anticipated it. He hesitated—\n\nAnother reporter jumped in. \"Did you receive it as a gift during your visit to the imperial palace?\"\n\n\"...\"\n\n*The emperor... gave me a gift?* The notion was absurd. An ancient artifact, handed over like a party favor? Yet as Grid's silence stretched, he realized the assumption wasn't entirely baseless. The empire had initiated the peace treaty. Grid had visited at the emperor's personal invitation. Perhaps their relationship was closer than the world realized?\n\nThe press corps interpreted his silence as confirmation. Fingers flew across keyboards. Within minutes, headlines populated the internet: *\"Does Grid Enjoy the Saharan Emperor's Favor?\"* and *\"Saharan Empire and Overgeared Kingdom: Eternal Allies?\"*\n\nGrid suppressed a wry smile. *Well... I don't actually dislike him.*\n\nEmperor Juander defied his reputation as a tyrant. Despite conquering the continent through ruthless force, he'd still extended an olive branch to someone who would inevitably become an obstacle. The gift of Mercedes—a legendary knight worth infinitely more than any magic machine—proved that.\n\n*Though technically, he sent her for Piaro, not me.*\n\nThe emperor had been deceived by Great Demon Astaroth into branding his loyal friend a traitor. Upon learning the truth, Juander had dispatched Mercedes to ensure Piaro's remaining years passed in comfort. Of course, he'd never imagined Piaro would transform into a farmer—or that the man would spend his peaceful retirement sharpening the blade of revenge aimed at the empress.\n\n*Piaro's heart is... complicated.*\n\nThe next questioner wore the grim expression of someone with a grievance. Chinese press. Grid had expected this.\n\n\"Early in the battle, you used a skill that brought hundreds of players to their knees. In that window, you assassinated Mei Xiao. What was your intent?\"\n\nChina hated him. After Grid had defeated their hero Hao, he'd become an eyesore—the foreign interloper standing atop their coveted summit. The Chinese media had framed Mei Xiao's death as a deliberate slight, a malicious act targeting their nation.\n\nGrid knew all this. Which was precisely why he'd prepared his response with care.\n\n\"Mei Xiao is exceptionally talented—one of the new generation's finest. At the battle's outset, she represented one of my most significant threats. I had to eliminate her first. If I'd failed, I would have lost the Demon King Subjugation.\"\n\n\"...So you acknowledge her abilities?\"\n\n\"Anyone who watched this year's National Competition would acknowledge them.\"\n\n\"I—that's true.\" The reporter's stern expression cracked. He actually blushed, embarrassed at asking such an obvious question, then sat down and began typing with renewed enthusiasm.\n\nAcross China, viewers softened. Grid had made it look effortless—as natural as water flowing downhill. The message was clear: Mei Xiao was a genuine rising star. Grid harbored no prejudice against China.\n\nChinese social media lit up:\n\n*—If he hated us, he wouldn't praise Mei Xiao.*\n\n*—Grid's favorite food is jjamppong! Chinese noodles!*\n\n*—Grid is pro-China.*\n\n*—Simple fools. You're deceived by empty flattery.*\n\n*—Flattery? He's stating facts. Why call it flattery? Aren't you just a bitter troll?*\n\nApparently, every nation had its share of bitter trolls. Grid filed that away. Khan's death had taught him an invaluable lesson: control your emotions, minimize your enemies. The strategy was already bearing fruit.\n\nAn Argentine reporter ventured carefully, \"Did you eliminate Seuron first for the same reason?\"\n\n*No, it's because Seuron spread rumors about my hemorrhoids.*\n\nGrid swallowed the words and manufactured a smile. \"Exactly. I was wary of Seuron's ability—he grows stronger as casualties mount.\"\n\n---\n\nThirty minutes evaporated. Questions and answers flowed in practiced rhythm.\n\n\"You used the same skill twice in succession. What ability enabled that?\"\n\n\"I'll only say it's a hidden card.\"\n\n\"Did you and Kraugel arrange your one-on-one match beforehand?\"\n\n\"No.\"\n\n\"A small minority in South Korea has criticized your choice to compete individually rather than represent the nation, claiming it harmed the country's overall ranking. Your response?\"\n\n\"I understand their disappointment.\"\n\n\"How do you rate Zibal after his long absence?\"\n\n\"His development is remarkable. He's become a player to watch carefully.\"\n\n\"God of War Ares is considered the frontrunner to be the next Demon King. Your thoughts?\"\n\n\"I'd include Ares among the candidates. Also Pope Damian—Rebecca's Daughters defending those gates would be terrifying.\"\n\n\"The Overgeared Kingdom has grown substantially. Do you plan territorial expansion?\"\n\n\"Please confine questions to the National Competition.\"\n\nTime flowed smoothly. Reporters asked what their audiences wanted to know. Grid answered with practiced skill. Within hours, his press conference dominated trending news across six continents.\n\nMost reporters seemed satisfied, if slightly disappointed the event was ending. They wanted to maintain good relations with Grid—inflammatory questions served no purpose.\n\nThen one reporter gathered his courage.\n\n\"You've reportedly received endorsement offers from Bentley, Rolls-Royce, Maybach, and other luxury marques. Yet immediately after the Demon King Subjugation, you suggested signing with Daejin Motors instead. Does your decision relate to Player Yura?\"\n\nThe connection was obvious. Grid's comments had catapulted Daejin Motors into global consciousness. Everyone now knew Yura was the Daejin Group chairman's granddaughter. The relationship between Grid, Yura, and Daejin Motors practically drew itself.\n\nStill, most reporters had avoided the topic—it was too personal. Indeed, sharp-eyed staff members were already moving to escort the American journalist away for his inappropriate question.\n\nGrid stopped them with a raised hand.\n\nHe'd been waiting for this.\n\nFacing the wall of cameras, Grid deployed his prepared answer. \"I chose Daejin Motors because I personally admire their new luxury sedan, the King General Sys. Originally, I planned to sign with a supercar brand you'd all recognize. Then I happened to pass a Daejin dealership and saw the King General Sys on display. I entered as if bewitched. A helpful salesman offered a test drive, and I was sold—the beauty, the handling, everything impressed me.\" He paused. \"Of course, there was one regret. Despite being positioned as a luxury brand, the price point was quite reasonable compared to the world's top marques. Consequently, certain specifications didn't fully satisfy me. I wanted a King General Sys, so I contacted Daejin Motors directly.\"\n\n\"...What was your inquiry?\"\n\nThe reporters recognized the promotion for what it was, yet they had to ask. Grid had orchestrated this perfectly. His excitement appeared genuine as he continued. \"Daejin Motors was willing to design the God General Sys specifically for me. Their prompt, personalized customer service impressed me deeply. That's why I agreed to become their model.\"\n\nSilence.\n\n---\n\nInside Daejin Group headquarters, employees exchanged bewildered glances.\n\n\"What's the God General Sys? Did we agree to build this for Grid?\"\n\nGrid's earnest delivery made it impossible to distinguish fiction from fact.\n\nThe Daejin Motors president began sweating. \"...We need to make it.\"\n\n\"A car that has captured global attention. It requires premium design and specifications that rival Rolls-Royce.\"\n\n\"Yes, sir...\"\n\nGrid had protected his valuable colleague while securing advertising fees and a new vehicle. Meanwhile, the Daejin Group enjoyed astronomical free publicity. Everyone won.\n\n---\n\n*This incredible guy... helped me?*\n\nYura waited outside the conference room, her eyes slightly bloodshot. Had she been crying? The sight triggered Grid's protective instincts without conscious thought.\n\n\"Are you okay?\" His hand reached out before he could stop it.\n\n\"Would you like to come to my room for ramyeon?\"\n\n*Click. Click-click-click!*\n\nCamera flashes erupted. The reporters who'd lingered one step behind Grid had found their real scoop.\n\n\"Ah—\"\n\nWhile Grid stood frozen, Yura moved closer. The press corps looked like predators scenting blood.\n\nFrom a safe distance, Peak Sword turned to Coke. \"If Yura and Jishuka fight, who wins?\"\n\n\"I don't dare imagine such a thing...\""
}