{
  "id": 969,
  "title": "Chapter 968",
  "content": "Grid's first instinct had been to find Yura. But the moment the Demon King Subjugation ended, he'd been swept up by the Overgeared members flooding into the waiting room. A year had passed in the real world—he couldn't just brush them off. Then came the press conference.\n\nBy the time he'd thought to reach out, she was already here.\n\n*She came on her own?*\n\nGrid's chest tightened with unspoken words—apologies, reassurances, the desperate plea for her not to quit the game. Now she stood before him in a den of reporters, their cameras poised like the jaws of starving beasts.\n\n\"Would you like to come to my room? I can make ramen.\"\n\n*Click! Click click!*\n\nCamera flashes erupted. Grid's frown deepened as he turned toward the assault of light. Yura had endured immense pressure throughout the entire Competition, and now she was being ambushed. Worse—her eyes were red. She'd been crying.\n\nHe could already imagine the headlines.\n\n\"This isn't an official event.\" Grid stepped between Yura and the cameras, his voice cutting through the chaos. \"You need permission before taking photographs.\"\n\nYears as the Overgeared King had taught him how to command a room. His presence pressed outward like a physical weight, and the reporters actually stepped back—\n\n*Click! Click click!*\n\n—for all of three seconds.\n\nThen the frenzy resumed. Yura's pale face seemed to glow in the storm of flashes, isolated in her own private moonlight. Her trembling gaze held the fragile beauty of something about to shatter. The reporters—men and women alike—looked ready to betray their countries if she so much as whispered a command.\n\n\"Everyone, if you don't calm down—what the hell?\"\n\nThey'd become fanatics. Ragged breathing. Bloodshot eyes. Cameras raised like weapons. Grid felt like he'd stumbled into a zombie film.\n\n\"Player Yura! You dominated this year's Competition but refused nearly every interview. Is something wrong?\"\n\n\"Will you avoid Player Zibal again in next year's PvP?\"\n\n\"Why come here alone? Are you picking up Player Grid?\"\n\n\"Is your beauty evolving because of love? The dating rumors with Player Grid have persisted for four years. How long have you been together?\"\n\n\"Why won't you break up?!\"\n\n\"*When* will you break up?\"\n\nThe questions spiraled from professional to invasive in seconds.\n\n*How many times do I have to say we're not dating?*\n\nHe wasn't dating anyone. Not Yura. Not Jishuka. He'd said it hundreds of times over four years, but no one believed him. And why would they? Yura was often spotted with him in reality, Jishuka in-game.\n\nWhat Grid *didn't* know was that neither woman had ever denied the rumors.\n\nHe'd have to make this crystal clear. Again. The anti-fans were piling up as it was. Damn it—he'd never even held their hands.\n\nWell. Okay. He'd held their hands. Supported them by the waist when they were drunk. But that didn't *mean* anything. It wasn't fair to Yura or Jishuka to let people assume otherwise.\n\nGrid steeled himself and shouted, \"We aren't dating!\"\n\n*Click! Click click!*\n\n\"We are *not* dating!\"\n\n*Click click!*\n\n\"Yura and I are *not* together!\"\n\n\"...\"\n\nHe bellowed it several more times. Finally, the flashes stopped.\n\nOther men would *kill* for a scandal with Yura. Grid kept denying it like his life depended on it. The first few times, they'd thought he was just embarrassed. But now, with Yura standing there like a stone statue, all the light draining from her eyes...\n\n*Did Grid... reject her?*\n\nImpossible. Inconceivable. The notion that any man would reject Yura defied belief itself. Yet the reporters studied her pale, almost translucent face and began to wonder.\n\n\"...\"\n\nOne by one, they lowered their cameras. Even the broadcast crew in the back started shutting down their equipment. This was getting dangerous. If Grid and Yura *were* lovers, they might get away with prying. But if they weren't...\n\nIn the tense silence, Yura spoke for the first time.\n\n\"You're right.\" Her voice was as beautiful as her face, soft enough to make the reporters feel weightless. \"We're colleagues. Not lovers.\" She paused. \"I know that Grid has the same relationship with Jishuka. Isn't that correct?\"\n\nFrom the moment the reporters had appeared, Yura had looked only at Grid. She still hadn't looked away.\n\nGrid recognized the golden opportunity to end four years of rumors. He smiled widely. \"That's right! Absolutely correct! I'm not dating Jishuka!\"\n\n\"So—\"\n\n\"Huh?\"\n\n\"I'm going to try.\"\n\n\"What?\"\n\n\"I want to be your lover.\"\n\n\"Huh? Wait—what?\"\n\n\"...!!\"\n\nGrid's brain short-circuited. The words made no sense. His wide smile remained frozen on his face while his thoughts scrambled to catch up. Behind him, cameras rose again like a tide. Yura didn't stop them this time. If she let this moment slip away, she'd never find the courage again.\n\nUnder the watch of dozens of cameras, Yura drew a shaky breath and repeated: \"Please date me.\"\n\n\"...\"\n\nHer ears were crimson. The reporters finally noticed the tremor in her voice, the way her beautiful eyes shimmered with vulnerability. They understood, instinctively, how much courage this moment demanded. Without meaning to, they began rooting for her.\n\n...All except one person.\n\n\"A-Are you *crazy?*\"\n\nGrid.\n\nNot because he didn't like Yura—he did. From the day they'd first met, she'd intrigued him. Over five years, that intrigue had deepened into genuine fondness. Her actions toward him had always been thoughtful, supportive. Setting aside her appearance entirely, he *liked* Yura.\n\nBut none of it made sense. She was a legendary beauty. Wealthy. Educated. Kind. Why would someone like her confess to *him?* And why *here,* with reporters from around the world circling like vultures?\n\nIt felt like a dream. An impossible fantasy.\n\n*Click click!*\n\nMore photos. Videos now, too. Grid snapped back to reality. Yura's face was scarlet, her eyes darting wildly, her breathing ragged. She was on the verge of a panic attack. Yet still, she held his gaze. Desperate. Sincere. Sad.\n\nHe couldn't turn away anymore. He didn't understand—but he knew her heart was real.\n\n\"Let's go back to the hotel.\" Grid reached out and took her small, soft hand. \"We'll talk there.\"\n\n\"Ah...!\"\n\n*Click! Click click!*\n\nThe flashes intensified. How was Grid supposed to feel right now? He had zero experience holding hands with women. Meanwhile, the reporters scrambled to capture Yura's expression as she turned even redder.\n\n\"Follow them.\"\n\n\"Move!\"\n\n\"On it!\"\n\nPeak Sword, Toon, and Coke appeared from down the hallway, cutting through the crowd to escort Grid and Yura safely away. Peak Sword and Toon were grinning like proud parents watching their children on a first date.\n\n***\n\n**Yura's Hotel Room**\n\nIt took twenty minutes for Yura's breathing to settle.\n\n\"Feeling better?\" Grid sat across from her, cradling warm tea.\n\nYura nodded, her face still flushed. \"Yes...\"\n\n\"Good. Then I have to ask.\" He met her eyes. \"Why the hell do you like *me?*\"\n\nShe'd asked him to date her. That meant she liked him—not as a friend or colleague. Romantically.\n\n\"An ugly, bad-tempered idiot...\" He stopped himself from adding *like you* to the end. That would sound condescending. He tried to think objectively. \"Why would you like someone like that?\"\n\nMaybe it was the resources. Plenty of people were fascinated by the Overgeared King.\n\nBut what about Shin Youngwoo himself? In Grid's experience, Shin Youngwoo had never been attractive. Shin Youngwoo was *different* from Grid.\n\nShin Youngwoo was a man who had never been loved. Women had laughed at his face, called him ugly, disgusting. Some avoided him entirely. The ones who didn't? They mocked him. And it wasn't just his appearance—his dark, selfish personality had built walls no one could cross.\n\nHe used to blame the world for making him that way. Not anymore. He knew better. It was his nature.\n\nLook at Damian. Bullied as a kid for liking anime and action figures. Still bright. Still loved by everyone.\n\n\"...\"\n\nGrid's expression twisted. The old wounds were still there, buried deep but never fully healed. They ached like phantom limbs.\n\n\"At first, it was curiosity,\" Yura said quietly. \"Back when I believed I was the best. I was interested in someone who looked weaker than me but refused to fall.\"\n\n\"...\"\n\nThe Doran rescue. When Yura was still a Yatan Servant. Before anyone understood what 'Immortality' meant. Of course she'd been curious.\n\n\"Later, I felt compassion. Empathy. I learned about your past—the misfortune, the pain. I wanted to help. I watched you sometimes.\" She smiled faintly. \"Then I realized you were fundamentally different.\"\n\nYura had lost her parents young. Stood alone at their funeral, watching her grandfather shed not a single tear. Been forced into a future she never chose. Pain had rooted itself deep in her heart.\n\n\"I was busy healing my own wounds. I only loved myself. I trampled others to escape reality.\" She'd destroyed countless lives as Yatan's Servant. Among them, Grid and Irene. She still couldn't bring herself to say Doran's name aloud. \"But you... You might have been in more pain than me. More alone. Yet you always fought to protect others.\"\n\n\"That's a stretch. You're only seeing part of me. The things you like are just illusions. Misunderstandings.\"\n\n\"No.\" Yura set down her cup. Her eyes had stopped shaking. She'd glimpsed his self-loathing and refused to let it stand. \"Those things were just catalysts. The reason I like you is because you're Shin Youngwoo. Your voice. Your scent. Your personality. Your habits. Your expressions. Your face...\"\n\nAll the things he hated about himself.\n\n\"I like all of it.\"\n\nFive years wasn't a short time. Yura had seen countless sides of Grid. She liked them all.\n\n\"...\"\n\nGrid's heart pounded. Yura was looking directly at him now, her smile brighter than he'd ever seen. More beautiful than ever. He lost himself for a moment.\n\n\"You know... this is my first time saying it after learning the truth. You look really surprised.\"\n\nThe absurd statement snapped him back. Grid shook his head and smiled wryly. \"You're delusional.\"\n\nHe couldn't believe it.\n\nIrene's face flashed in his mind. Guilt coiled in his chest.\n\nYura saw his expression falter and stood. \"I didn't mean to make you uncomfortable. I just wanted you to know how I feel.\"\n\nShe was giving him time. Space.\n\n\"By the way...\" Grid glanced down. \"Why are you holding a pot?\"\n\n\"I'm making ramen.\"\n\n\"Ramen? You know how to cook?\"\n\n\"There's a recipe on the packet. I just need to wash the noodles and follow the instructions.\"\n\n\"*Wash?* Hey, give me that!\" Grid lunged forward. \"Don't squeeze dish soap on it—put that down!\"\n\n\"The guest should sit quietly.\"\n\nDespite everything, the tightness around Grid's heart eased. He'd never seen Yura's expression this relaxed, this bright.\n\nStill, she really needed to hand over that ramen packet first."
}