{
  "id": 97,
  "title": "Chapter 97",
  "content": "# Chapter 97\n\n*Then first...*\n\nGrid pulled up his skill window.\n\n> **[Legendary Blacksmith's Craftsmanship Skill]**\n> Lv. 2 (76.3%)\n> \n> Produce equipment items that you know how to make.\n> You can create the production methods for a new item with the 'Legendary Blacksmith's Creation' skill.\n> \n> There is a certain probability of producing rare~ epic rated items.\n> There is a rare probability of creating unique rated items.\n> There is a very rare probability of creating legendary rated items.\n> \n> * All stats of a production item will increase by 12%.\n> * When rare rated items are produced, all stats will permanently rise by +2 and reputation throughout the continent will rise by +30.\n> * When epic rated items are produced, all stats will permanently rise by +4 and reputation throughout the continent will rise by +80.\n> * When unique rated items are produced, all stats will permanently rise by +12 and reputation throughout the continent will rise by +300.\n> * When legendary rated items are produced, all stats will permanently rise by +25 and reputation throughout the continent will rise by +1,000.\n> * Something special will occur with every five legendary items created. (Currently 2/5)\n\n> **[Legendary Blacksmith's Breath]**\n> Lv. 2 (42.5%)\n> \n> When you are concentrating on making an item, the will of Pagma's Descendant will fill the production item.\n> All stats of a production item will increase by 7%.\n> There is a rare chance of giving special features to your production items.\n\nHis production skills had jumped from level 1 to 2 shortly after the item production game with Euphemina. Over the last two months, he'd hammered out countless normal, rare, and epic items. Two legendary pieces on top of that.\n\nAnd yet both skills sat stubbornly at level 2.\n\n*The experience gain is garbage compared to level 1.*\n\nStill, the Craftsmanship skill was pushing 80%. A few more serious production sessions would tip it to level 3.\n\n*The problem is Breath. It's random, so grinding the experience is hell.*\n\nHe gave his all every time he worked. Twenty-plus hours per item, sometimes more. According to the skill description, Breath should activate whenever he made something. But this vague concept of \"concentration\" was trickier than it sounded. Breath only triggered occasionally, no matter how hard he focused.\n\nIt hadn't even fired when he made the legendary Divine Shield. That shield came out exactly as the production method specified. No additional options. Just the baseline legendary stats.\n\n*I made a legendary item and Breath didn't proc. Looking back, it's kind of terrifying.* He grimaced. *Then again, there was the Sword of Self-transcendence.*\n\nThat sword had started as an ordinary longsword production method. Somehow it jumped to legendary rating, and the only explanation was Breath activating at the perfect moment. Phoenix had called it a sword that appeared once every century.\n\n*The key to my production is whether Breath triggers or not.*\n\nFor most blacksmiths, the critical factor was rating. Normal, rare, epic, unique. They prayed for the highest possible outcome every time they struck the anvil. Grid used to be the same. He'd hoped desperately for rare, epic, unique, or even legendary ratings with every craft.\n\nHis perspective had shifted.\n\nRating mattered, sure. But Breath played just as critical a role.\n\n*If Breath doesn't trigger, I produce exactly what the production method says. Same as any regular blacksmith.* He flexed his fingers, feeling the calluses. *But when Breath activates, the value skyrockets because of the bonus options.*\n\nDepending on which options appeared, a Breath-enhanced rare item could outperform a non-Breath epic. Breath didn't always grant new options, of course. The effect was random. But even without new options, the base stats increased. Always a net gain.\n\n*Maybe Breath needs to level up before it triggers more consistently.*\n\nSince he couldn't activate it intentionally, there was no shortcut to raising the level. Just keep making items. Keep grinding.\n\n*Which means more grinding in the future. Getting rich isn't easy.*\n\n\"Hey, Grid.\"\n\nHe glanced up from his introspection. Vantner stood nearby, fidgeting with his axes.\n\n\"If you don't mind, can you repair my weapon? It got torn up pretty bad against Malacus.\"\n\nGrid's expression didn't change. \"If you pay me.\"\n\nHe'd never actually repaired an item with his own hands before. All his time went into production. But several pieces of his own equipment had lost durability in recent combat. No reason to refuse when Vantner asked.\n\nGrid turned to the old blacksmith. \"Khan, you have repair tools?\"\n\n\"Of course.\"\n\nKhan retrieved an anvil, hammer, grindstone, and iron from a storage chest. The anvil and hammer both had 'Repair' prefixed to their names. Grid frowned at them.\n\n\"Why distinguish these for repairs? Can't regular anvils and hammers work?\"\n\nKhan's expression grew sly.\n\n\"Repair hammers and anvils are disposable. You're right that we *can* fix items with ordinary tools.\" He tapped the side of his nose. \"But we don't. Can't charge premium repair fees if customers think it's easy work.\"\n\n\"What?\"\n\n\"Why use disposable tools? To make customers think 'hammers and anvils must be consumed' during repairs. It's theater. Emphasizes the favor we're doing them.\" Khan chuckled. \"Because of this bit of advertising, we charge much higher repair fees. A money-making trick invented by ancient blacksmiths. That's why repair tools exist.\"\n\nSo *that* was why repair costs were always so inflated? Grid felt a strange mix of irritation and admiration.\n\n*It's actually smart. Finding new revenue streams like that.* He filed the lesson away. *I should learn from this.*\n\nVantner passed over his twin axes.\n\n> **[Twin Bloody Axes]**\n> Rating: Unique\n> Durability: 39/500 | Attack Power: 250\n> \n> **Critical Chance:** +20% | **Critical Damage:** +30%\n> \n> * There is a constant probability of attacking two times.\n> * Can cause bleeding when a critical hit occurs.\n> \n> It is the weapon of the butcher of Kirim Peninsula, Fang. The number of people killed by this axe is immeasurable.\n> \n> **User Restriction:** Level 200 or higher. More than 1,000 strength. Advanced Axe Mastery level 1 or higher.\n> \n> **Weight:** 700\n\nVantner had mentioned investing everything into strength, so the weapon matched his build perfectly.\n\n*But something's off.*\n\nAxe-type weapons typically boasted higher attack power than one-handed swords. Twin axes especially, with damage output comparable to greatswords. Yet the Twin Bloody Axes seemed weak for their rating and usage requirements.\n\n\"Vantner.\" Grid studied the weapons more closely. \"Isn't the attack power low for axes at this rating?\"\n\nVantner nodded.\n\n\"Yeah, you noticed. Compared to twin axes with similar requirements, these are about 60 points weaker on attack power. I only use them because I like the options, but honestly...\" He sighed. \"Fang's raid was brutal. The weapon feels like a letdown. Almost like a bug. Hey, wait.\" His eyes narrowed. \"I'm the same age as Pon. Why do you call him 'Pon' but call me 'Mister?' Huh? You trying to disrespect me?\"\n\nGrid ignored the sudden outburst. He turned the axes in his hands, feeling their weight distribution.\n\n\"Appraisal.\"\n\nThe Legendary Blacksmith's Appraisal skill activated.\n\n> [The blacksmith who becomes a legend can appraise items with an excellent discerning eye. If a hidden feature exists in the target item, it will be found.]\n\n*Ttiring~*\n\n> **[Genuine Twin Bloody Axes]**\n> Rating: Unique\n> Durability: 39/500 | Attack Power: 250~380\n> \n> **Critical Chance:** +20% | **Critical Damage:** +30%\n> \n> * There is a constant probability of attacking two times.\n> * Can cause bleeding when a critical hit occurs.\n> * Causes confusion when a critical strike is activated.\n> * The skill 'Genuine Conversion' will be generated.\n> \n> It is the weapon of the butcher of Kirim Peninsula, Fang. The number of people killed by this axe is immeasurable.\n> \n> The joint part of the left-hand axe is offset. As a result, it isn't easy to transmit force and the power of the axe isn't exercised properly.\n> \n> But this is an intentional device designed to change the power (weight) of the axe from time to time in order to confuse the enemy. Clicking the button hidden below the joint will cause the seams to engage and increase the attack power.\n> \n> It is a weapon where you can feel the pleasure of disturbing and confusing the enemy.\n> \n> **User Restriction:** Level 200 or higher. More than 1,000 strength. Advanced Axe Mastery level 1 or higher.\n> \n> **Weight:** 700\n\n> [You have discovered a hidden feature in the item!]\n> \n> [Insight has increased by 10.]\n\n\"Wow.\"\n\nGrid had used Appraisal dozens of times since acquiring the skill. This was the first time it had actually revealed a hidden feature.\n\n*This is incredible. And my Insight jumped by 10 points at once!*\n\nHe clenched his fists, barely containing his excitement. Around him, guild members perked up.\n\n\"What? Did Vantner's axes just... change?\"\n\n\"Did the shape transform? No, wait...\"\n\nVantner's face had gone pale. \"D-Did something go wrong with the repair?\"\n\nIf a blacksmith lacked the skill to properly repair an item, its maximum durability would permanently decrease. Vantner was clearly worried about that outcome.\n\nGrid's eye twitched.\n\n*What does he take me for?*\n\nHow could a legendary blacksmith fail at basic repairs?\n\n*Besides, I haven't even started yet.*\n\nHe thrust the axes into the furnace. Flames roared as the metal began to glow cherry-red.\n\n**Ttang! Ttang! Chiik.**\n\nQuenching. Tempering. Forging. The cycle repeated. The heated axes slowly reborn under his hammer. Vantner watched in tense silence, apparently afraid to interrupt.\n\nThirty minutes passed. After a final pass with the grindstone, Grid held up the fully restored Genuine Twin Bloody Axes.\n\n\"Here.\"\n\n\"Heooook!\"\n\nVantner's shriek echoed through the smithy as he examined the transformed weapons.\n\n\"Vantner?\" Jishuka called from across the room.\n\nHis exclamation had drawn everyone's attention. Jishuka approached, eyes wide with curiosity.\n\n\"What's all the noise about?\"\n\nVantner's voice trembled. \"T-That... I don't... Look for yourself.\"\n\nHe shared the item information with the guild. Shock rippled through the group.\n\n\"What is this?\"\n\n\"The item changed? That's impossible!\"\n\nThe smithy erupted into chaos.\n\nGrid picked at his ear, unfazed by the commotion.\n\nJishuka strode up to him. \"Grid! What kind of magic is this?\"\n\n\"Magic?\" He met her ruby-red gaze directly. \"What magic?\"\n\nHis lips curved into a slight smirk.\n\n\"This is all skill.\"\n\nA legendary skill that only he could use in all of Satisfy.\n\n---\n\n**Glossary of Common Korean Terms.**\n\n**OG:** Glossary Link.\n\n**Current schedule:** 20 chapters a week.\n\nCheck out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day."
}