{
  "id": 970,
  "title": "Chapter 969",
  "content": "The quiet slurp of noodles filled the hotel suite, followed by a satisfied sigh.\n\n\"This is...\" Yura's face flushed with pleasure as she set down her chopsticks. \"I had no idea instant noodles could taste like this.\"\n\nShe'd read about ramyun countless times—seen it referenced in forums, heard players discuss it between raids. But reading about something and experiencing it were entirely different matters. The broth had a richness that rivaled anything her family's personal chefs had prepared, and the noodles themselves possessed a satisfying chew that made her wonder why she'd never tried this before. The seasoning, slightly unfamiliar yet perfectly balanced, sent a pleasant tingle across her tongue.\n\n\"And the preparation time...\" She dabbed at her mouth with a napkin, the gesture as refined as if she were dining at a Parisian restaurant rather than eating instant noodles in a hotel room. \"No ingredients to wash, no complicated steps. Remarkable.\"\n\nAcross from her, Grid had abandoned all pretense of etiquette. His face hovered inches above the bowl as he drained the last of the broth in long, satisfied gulps. \"Perfect,\" he declared, setting the empty bowl down with a thump.\n\nAnd it *was* perfect. The water ratio had been exact, the eggs added precisely one minute and forty-five seconds before he killed the heat, the scallions scattered in at the eight-second mark. The trinity of instant noodle preparation, executed flawlessly.\n\n*I really have improved,* he thought with no small amount of pride. He'd bet good money he could go head-to-head with a Michelin-starred chef in a ramyun competition. The thought led him down another path entirely. *Should I try making jjampong when I get back to South Korea? Would it be better than takeout?*\n\nThe old Grid would have balked at the idea—all that ingredient preparation, the time investment, the effort. But as he watched Yura across the table, saw the contentment on her face as she enjoyed something he'd made (even if it was just instant noodles), he found himself warming to the idea of cooking as a hobby.\n\n\"Hold still.\" Yura leaned forward with a fresh napkin, reaching across to wipe a spot at the corner of his mouth. The sudden proximity brought with it a floral scent that made Grid's pulse quicken.\n\n\"...\" He felt heat rising to his face and shot to his feet before she could notice. \"I—bathroom. Need to use the bathroom.\"\n\n\"Wait, what—?\" Yura blinked up at him, startled by the sudden movement.\n\nBut Grid was already moving, retreating to the bathroom and closing the door behind him. He braced himself against the sink and stared into the mirror, checking his teeth for stray bits of chili powder. Nothing. His teeth were healthy, no gaps for food to lodge in. They gleamed white under the bathroom lights.\n\n*Am I handsome?* \n\nHe rinsed his mouth and studied his reflection more carefully. The face staring back looked identical to the one in that painting Picasso had created—the extremely honorable painting that everyone had praised while Grid himself assumed it had been heavily edited. Lauel, the Overgeared members, even Irene and Lord had accepted it as an accurate representation without question.\n\n*I suppose I do look better than I used to.*\n\nFour years of consistent exercise had done that. Where his features had once seemed soft and undefined, they now possessed a sharpness that photographs well. His skin, perhaps the most dramatic change, showed no trace of the acne that had plagued his younger years. Four years of daily training, of sweating out toxins and building discipline—it showed.\n\nGrid experimented with different poses. Shoulders back, highlighting his frame. A three-quarter turn to show his profile. \n\n*...Actually pretty good.* \n\nHis smile widened as confidence bloomed in his chest. He washed his hands and ran them through his hair carelessly—three, four rough passes that should have left it disheveled. Instead, his hair fell into place as if styled by a professional, every strand cooperating perfectly. The same dexterity that made him exceptional at blacksmithing translated here too. Years of precise movements in Satisfy had trained his muscle memory to a degree that expressed itself even in the real world.\n\nHe emerged from the bathroom feeling more composed, only to stop short in the living room doorway.\n\n\"Wow...\"\n\nSunlight streamed through the windows, catching Yura in its glow. She looked like something out of a painting herself, beautiful enough to steal his breath. Even after years of knowing her, he still wasn't immune to that beauty.\n\n*She changed clothes?*\n\nThe jeans and sweater from earlier had been replaced by a flowing one-piece dress that highlighted her figure in ways that made Grid's mouth go dry. Her legs, pale and elegant, seemed to stretch on forever.\n\n\"Are you going somewhere?\" he asked, settling into the seat across from her.\n\nYura shook her head, a faint blush coloring her cheeks. \"No.\"\n\n\"Ah.\" Just wanted to be comfortable, then. Grid pushed the observation aside and moved on. \"When are you flying back to South Korea?\"\n\n\"I thought I'd coordinate with your schedule. You can take my plane.\"\n\n\"Really? That would be excellent. Private jets are incomparably more comfortable than commercial flights.\"\n\n\"Consider it available whenever you need it.\"\n\n\"Would you really do that?\" \n\nGrid had been mulling over purchasing his own plane lately. The convenience factor would be invaluable, especially for his parents when they wanted to travel. But the price tags had given him pause—the model he preferred would run over 100 billion won. He *could* afford it, technically, but spending such a massive sum in one transaction sat poorly with him.\n\n\"Then I'll take you up on that offer. I don't need it often, but it would be perfect for sending my parents overseas.\"\n\n\"Yes! I'll make sure everything's ready whenever you need it!\" Yura's eyes lit up the moment he mentioned his parents.\n\nGrid studied her suspiciously enthusiastic expression before broaching a more delicate topic. \"Did you hear from your grandfather?\"\n\n\"...Yes.\" Her expression softened. \"He promised to stop pressuring me about inheriting the company. Thanks to you.\"\n\nShe'd gotten the full story from her grandfather—how hard Grid had advocated on her behalf, how seriously he'd taken her situation. The knowledge had moved her nearly to tears. She'd told Grid everything then: her parents' history, her grandfather's expectations, her father's dreams that she now carried. She wanted to honor her father's memory through Satisfy, not through a corporate boardroom.\n\n\"You protected my dream,\" she said quietly. \"I'll spend my life repaying that kindness.\"\n\n\"Just stay by my side. That's all I need.\"\n\n\"By your side...\"\n\n\"Let's build the Overgeared Guild together. Make it something incredible.\"\n\n\"...\"\n\n*Of course.* Yura fought down the disappointment that threatened to show on her face. She knew his feelings—could read the growing warmth in how he treated her. But Grid himself hadn't fully acknowledged them yet, and rushing him would only push him away. She understood his position, the complications with Irene. She could wait.\n\nThe doorbell chimed.\n\n\"Who could that be?\" Yura rose from the couch, frowning. They weren't expecting anyone—\n\nThe world tilted suddenly. She'd barely slept, had been running on nervous energy all day. Between her conversation with her grandfather and working up the courage for this meeting with Grid, she'd depleted her reserves without realizing it. Her legs buckled.\n\n\"Careful!\" Grid caught her before she could fall, one arm sliding around her waist, the other supporting her neck. His hands were warm and solid, and suddenly his face was mere inches from hers.\n\n\"Grid...\" she breathed.\n\nHis heart hammered against his ribs. Her lips were right there, soft and slightly parted. The control he'd been maintaining snapped like an overtightened wire. For just a moment, Irene's image in his mind flickered and dimmed. Every instinct urged him forward—\n\nThe door crashed open.\n\nThey sprang apart like guilty teenagers. Grid's head whipped toward the entrance, and his eyes went immediately to—well, to a specific anatomical feature of the intruder before his brain caught up and processed the face attached to them.\n\n\"Jishuka?!\"\n\n\"Well, well.\" The archer leaned against the doorframe, a knowing smile playing across her lips. \"What do we have here?\"\n\n\"This isn't—we weren't—\" Grid stammered.\n\nYura, still catching her breath, managed to compose herself first. \"How did you get in here?\"\n\nJishuka reached into her pocket and pulled out a knife.\n\n\"...\"\n\n\"Oops, wrong pocket.\" She tucked the blade away and produced a keycard from her other pocket. \"My father owns this hotel chain. I called in a favor. When I couldn't reach my dear friend Yura, the staff was happy to provide access.\" Her smile sharpened. \"So. Shall we try that again? What exactly were you two doing?\"\n\nThe temperature in the room seemed to drop several degrees under Jishuka's stare. Grid felt like an insect being examined under a magnifying glass.\n\nAfter a beat of painful silence, Jishuka's expression shifted to something lighter. \"Oh, I almost forgot to mention. I'm relocating to South Korea today.\" Her gaze slid to Yura, predatory and deliberate. \"There's a pest problem that needs my attention.\"\n\nYura met the challenge head-on, straightening her spine. \"Welcome to South Korea, then. I look forward to competing alongside you at next year's National Competition.\"\n\n\"Competing *alongside* me?\" Jishuka's laugh was sharp. \"Sweetheart, I'll be entering every event you're in. The medal count stays the same, but at least I'll have a front-row seat.\"\n\n\"You're letting personal feelings interfere with team strategy. That's unprofessional.\"\n\n\"Unprofessional?\" Jishuka's eyebrow arched. \"I'm not getting paid to play Satisfy. I'm not a professional anything. I do what I want.\"\n\n\"It's about responsibility. As national representatives, we have an obligation to separate personal matters from our duties.\"\n\n\"Rich, hearing that from someone who just got caught in such a *compromising position*.\"\n\nThe air between them crackled with tension. Grid, trapped in the crossfire, felt his higher brain functions shutting down.\n\n*Since when did they hate each other this much?*\n\n---\n\n\"It's been too long.\"\n\nThe clearing outside Empress Aria's cemetery was quiet save for the rhythmic *thunk* of an axe striking wood. Kraugel approached the man splitting logs with mechanical precision, waiting until Kirinus set down his tool and turned.\n\nRecognition flickered across the spearsman's weathered face. \"You return to me after all this time.\" He studied Kraugel with eyes that missed nothing. \"Muller's path would be faster. Easier. Why choose this stubborn, slow road?\"\n\nKraugel dropped to one knee. \"Even Sword Saint Muller relied on the spear when the situation demanded it.\"\n\n\"I heard you proclaimed the sword the strongest weapon on the continent.\"\n\n\"I still believe that. But I want to learn the spear regardless.\"\n\nThe truth was simple: Kraugel's class had proven less versatile than he'd assumed. Blue Dragon Sword Breaker had exposed that weakness brutally. But watching Grid adapt, seeing him switch between different weapons to suit each situation—that had been the real revelation. There wasn't just one path to strength. Kraugel had the talent to master multiple weapons. He simply needed the discipline to do so.\n\nKirinus regarded him for a long moment, then nodded slowly. \"You've finally opened your eyes. Combat is the same regardless of how you reach it—only the journey differs. But the journey matters as much as the destination.\" He planted his axe in the chopping block. \"I'll honor the Sword Saint's legacy and respect your will.\"\n\n[A hidden quest has been created!]\n\nThree years. The quest would require him to remain in this one location, training, for three full years. His level would stagnate. Other players would pass him in the rankings. Everything he'd built could crumble.\n\nKraugel didn't hesitate. \"Thank you for accepting me as your student.\"\n\nHe had only one true rival—Grid. And he intended to keep it that way forever, constantly pushing forward, constantly proving himself. That meant growing stronger through any means necessary, even if the path seemed counterintuitive.\n\nThe competitive fire that drove him demanded nothing less."
}