{
  "id": 971,
  "title": "Chapter 970",
  "content": "A day after the National Competition ended, the media firestorm hadn't subsided—if anything, it had intensified. Yura's public confession dominated every news cycle, trending across social media platforms worldwide. The story of the legendary blacksmith and Korea's goddess had captured the public imagination.\n\nThe excitement reached fever pitch when word spread that Grid and Yura would be arriving at Incheon International Airport together. Thousands gathered: broadcasters jockeying for position, reporters clutching cameras, and ordinary citizens hoping to glimpse the couple everyone was talking about. Despite Grid's private anxieties, the crowd's mood was supportive. People admired Yura's courage and agreed that Grid was worthy of such a bold declaration.\n\nThen Grid appeared with Jishuka.\n\nThe Brazilian archer walked beside him, her arm linked intimately through his. Yura trailed slightly behind.\n\nThe airport fell silent.\n\nReporters lowered their cameras. Fans who'd been calling out Grid and Yura's names simply... stopped. In that pregnant pause, Grid felt the temperature of the room drop twenty degrees. He could practically feel the hostility radiating toward him in waves, see the exact moment he transformed from romantic hero to something far less flattering in ten million people's eyes.\n\n*It's just friendship,* Grid thought desperately as he walked that gauntlet of judgment. *She's a colleague. A friend. This doesn't mean anything.*\n\nBut the killing intent boring into his back suggested the crowd disagreed.\n\nJishuka, blissfully unaware of Grid's internal crisis, smiled and pressed closer to him. Yura, watching this display, had her own suspicions about who'd leaked their arrival time to the press.\n\n***\n\nGrid's Village—the nickname that had stuck after his building's completion sparked a development boom—was still growing. Six additional high-rises were under construction around his penthouse, and Jishuka had claimed one for herself.\n\n\"Perfect location,\" she said, gesturing to the building directly adjacent to Grid's.\n\nHe examined the architecture with growing unease. Like his own penthouse, Jishuka's occupied the top floor. Unlike his, it featured floor-to-ceiling windows with no privacy screening whatsoever. The garden and pool were completely exposed. Anyone in Grid's building could see straight inside.\n\n*Why install a privacy wall on the other sides but not this one?*\n\n\"When does construction finish?\" he asked.\n\n\"Two weeks.\" Jishuka turned to him with an expression of theatrical helplessness. \"I'll need somewhere to stay until then. South Korea is still so unfamiliar to me, and a woman alone in a foreign country...\" She trailed off meaningfully. \"I suppose I could get a hotel.\"\n\n\"Don't be ridiculous. Stay at my place. I have plenty of room.\"\n\nShe was a friend who'd traveled halfway around the world. The least he could do was offer her a guest room. Jishuka's face lit up with genuine joy.\n\n\"Thank you, Grid!\"\n\n\"W-wait, don't just—!\"\n\nBut she was already hugging him.\n\n***\n\nOne day of hosting Jishuka had left Grid utterly exhausted.\n\n*Do all South American women dress like this at home?*\n\nHe shook the thought from his mind as he settled into his capsule. Almost two days had passed since he'd last logged in—an eternity by his standards. As the neural interface engaged, Grid knew exactly where he needed to go first.\n\nIrene.\n\nYura's confession had scrambled his thoughts. The lines between Satisfy and reality, between NPC and human, between duty and desire—all of it felt suddenly, uncomfortably blurred. Irene existed only in the game. Did that make his feelings for her less real? Did developing feelings for Yura in the real world constitute betrayal? The questions had no easy answers, but he needed to see Irene to know his own heart.\n\nHe found her in the palace gardens, standing by the reflecting pool. Her profile was as beautiful as ever, but time had changed her. She was older now—older than him, in fact, by the ordinary measures of aging. The sight sent a spike of pain through his chest.\n\n\"Your Majesty!\" Irene spotted him and hurried over, her face brightening.\n\nGrid met her halfway and pulled her into a tight embrace. \"I've missed you,\" he said quietly. \"We have so much to talk about. Let's stay up all night.\"\n\n\"Yes, Your Majesty.\" She buried her face against his chest, and her happiness was so pure, so complete, that Grid felt something in him settle.\n\nHe couldn't betray this. Wouldn't betray this.\n\n\"I love you,\" he said.\n\n\"Your Majesty...\" Irene glanced around at the servants and courtiers pretending not to watch. \"There are too many eyes.\"\n\nYears ago, she would have treasured such public displays. Age had brought dignity, restraint. Grid, seized by sudden defiance, released her and turned to their audience.\n\n\"I LOVE IRENE!\" he shouted.\n\n\"Y-Your Majesty!\" Irene turned scarlet, but she was smiling—radiant, beautiful, alive.\n\nTheir eyes met, and in that moment, the king and queen demonstrated what it meant to love without reservation. The court would talk about it for days.\n\nThat evening, as they walked through the gardens together, Irene stopped suddenly. She studied Grid's face with the perceptiveness that had always seen past his masks.\n\n\"You're the same as the day we met,\" she said. Then, more quietly: \"I saw that look once before. When Sua confused you.\"\n\nGrid said nothing.\n\n\"I'm mortal, Your Majesty. I can't stay by your side forever.\"\n\n\"Irene, what—\"\n\n\"I want you to find someone who can be with you for all of time.\"\n\n\"Don't say that.\"\n\n\"I'm saying it because I love you.\" Her blue eyes held sadness and iron determination in equal measure. \"Please. Don't grieve for something inevitable.\"\n\nThey existed in different streams of time. Grid had prepared himself for this, had known it was coming, but preparation proved useless against the reality. He saw his own future in Irene's eyes: her aging, her death, his continuance. And he understood, in that moment, that he would never—could never—love an NPC again.\n\nHe wept without meaning to.\n\n***\n\nThree days after the National Competition, Lauel was buried in administrative work when the system notifications appeared:\n\n> [The maritime Kingdom of Media has been destroyed.]\n> \n> [The Saharan Empire has absorbed all territories and holdings of Media.]\n> \n> [The survivors of Media harbor intense hatred toward the Saharan Empire. Their desire for vengeance will last for generations.]\n> \n> [The Saharan Empire's momentum grows! For the next 10 days, all Saharan players will gain +10% experience and +5% item drop rate.]\n\nLauel frowned. Media was where the Behen Archipelago was located—he'd visited personally. Small but prosperous, with considerable military strength despite its size. For the Empire to destroy it overnight...\n\n*Magic machines.*\n\nHe immediately convened an emergency meeting with the ten meritorious retainers. Before they could assemble, a whisper arrived—from Ares, the God of War himself.\n\n-My people secured the White Dragon's Eyes first. You're welcome.\n\nLauel had never heard of such an item, but revealing ignorance to Ares would be a mistake.\n\n-And your point is?\n\n-Compensation. Reduce the weapon prices you're charging us by seventy-five percent.\n\nLauel understood the pressure Ares was under. Since Hexetia's blessing, blacksmiths had flooded into the Overgeared Kingdom, and Lauel had weaponized that advantage ruthlessly. He'd cornered the arms market, tripled prices, and squeezed every kingdom on the continent. Valhalla was recruiting soldiers faster than they could arm them, burning through gold to equip even basic troops.\n\nThe complaints from other kingdoms had been vicious. But Ares had never joined them—Grid had helped him once, and Ares remembered. Still, there were limits to friendship when you ruled a kingdom.\n\n-I'll discuss it with King Grid and get back to you.\n\n-I'll be waiting for good news.\n\nAres disconnected without pressing further. The confidence in his tone bothered Lauel. He went immediately to Sticks, whose ancient knowledge had proven invaluable countless times before.\n\n\"The White Dragon's Eyes can reflect any power directed at them,\" Sticks explained.\n\n\"Any power?\"\n\nThat kind of artifact would be priceless. The Empire would absolutely covet it. But why had Valhalla intercepted it? Why was Ares demanding compensation?\n\nLauel gathered the ten meritorious retainers, but even their collective wisdom couldn't piece together the full picture. Two hours later, Faker returned from his intelligence network with answers.\n\n\"Media salvaged the White Dragon's Eyes from an underwater ruin ten days ago. The Empire's spy network learned of it within hours. Media tried to hide the artifact, but...\" Faker shrugged. \"The Empire's intelligence apparatus is extensive.\"\n\n\"So they destroyed an entire kingdom for one item,\" Lauel murmured. \"But why would they—\"\n\nHe froze. The pieces suddenly clicked into place.\n\n\"The evil eyes' king.\"\n\nThe ten meritorious retainers looked confused. Lauel stood, covering half his face with one hand, leaving a single eye visible—mimicking the gesture he'd seen from their new allies.\n\n\"Think about it. The Empire wants continental unification. Species like the elves, dwarves, orcs, vampires, giants, water clan—they're all obstacles. But which one poses the greatest threat?\"\n\nUnderstanding began to dawn on several faces.\n\n\"The evil eyes,\" Lauel continued. \"Specifically, their king. We've all heard the reports of his power. And the White Dragon's Eyes can reflect any power...\" He let the implication hang.\n\n\"They could use it to destroy him,\" someone breathed.\n\n\"Exactly. And Ares knows about King Grid's alliance with the evil eyes' king. He intercepted the Eyes before the Empire could claim them, and now he's leveraging that to negotiate better trade terms. He's holding the artifact hostage, essentially—if we don't cooperate, the Eyes go to the Empire, and our alliance with the evil eyes collapses.\"\n\nSilence fell over the conference room as the full scope of the situation became clear.\n\n\"Valhalla's strategists are better than I gave them credit for,\" Lauel admitted. \"They predicted the Empire's move, understood the geopolitical implications, and positioned themselves as the kingmaker.\" He grimaced. \"This is what I get for focusing on the National Competition.\"\n\n\"So what do we do?\" someone asked. \"If the White Dragon's Eyes reach the Empire—\"\n\n\"Don't worry about the evil eyes' king.\"\n\nGrid strode into the conference room. He was wearing unusual glasses—the lenses were transparent but tinged with violet, catching the light strangely.\n\nEveryone stared.\n\nGrid grinned at their baffled expressions. \"The evil eyes' king can control his power now. The White Dragon's Eyes won't be a threat to him.\"\n\nHe adjusted the glasses slightly. The violet tint deepened.\n\n\"Trust me on this one.\"\n\nThe Saharan Empire's campaign for continental unification had begun. And the Overgeared Kingdom, whether by fate or design, stood at the very center of the coming storm."
}