{
  "id": 972,
  "title": "Chapter 971",
  "content": "\"What are those?\"\n\nThe glasses Grid wore had an unusual quality. The transparent lenses gleamed as if crafted from extraordinary gemstones, yet a jarring black liquid with a purple sheen swirled within them.\n\n'Is that liquid intentionally injected?'\n\nIf Grid wanted sunglasses, this seemed an odd choice. They'd be impractical—interfering with vision rather than protecting it.\n\n\"These will become the eyes of the Evil Eyes' King.\"\n\nRather than explain further, Grid shared the item information with everyone gathered in the conference room.\n\n> [Ether Glasses]\n> \n> [Rating: Epic\n> Durability: 187/210\n> \n> * Incomplete ether effect.\n> * **Charm +80**\n> * **Vision -2**\n> * The abnormal 'blurred vision' state will occur once per second.\n> \n> Crafted by the rising accessory maker Elizabeth using ether diamonds.\n> \n> The beauty of the ether diamonds is gorgeously expressed. Perfect for those who crave attention.\n> \n> The ether possesses partial magical properties, but when injected into the lenses, it disturbs the field of view. The wearer will experience some discomfort.\n> \n> Weight: 5]\n\nGlasses fell under the accessory category—one of the easiest pieces of equipment to transfer between users.\n\n\"Try them.\" Grid handed the glasses to Lauel. Unlike weapons or armor, glasses could be freely given to others by the owner. No formal transfer procedure was needed. As long as the recipient didn't resist, they simply had to rest on the ears and nose.\n\n[You have received the Ether Glasses.]\n\n[Your eyesight has deteriorated. Your vision is blurred.]\n\n\"...Disorienting.\" Lauel adjusted the glasses on his face, narrowing his eyes. Cloudy fog and ripples distorted everything he saw. \"The ether effect is incomplete.\"\n\nLauel removed the glasses and channeled magic at the lens. Condensed wind struck the surface from his palm. The lens didn't crack. There was no repulsion. The magic simply vanished as if it had never existed. Absorbed—that was the only explanation.\n\n\"Incredible...\"\n\n\"This is perfect!\" \n\nGrid explained to Lauel and the ten meritorious retainers, who were examining the glasses with wonder. \"Ether is a substance from another world that absorbs magical power. Once the Evil Eyes' King wears these glasses, all magic emanating from his eyes will be absorbed by the lenses. The White Dragon's Eyes won't be able to reflect his power, eliminating any risk of destruction. He'll finally be able to see the world.\"\n\nGrid spoke matter-of-factly, but this was the core breakthrough. The Evil Eyes' King had been blind from birth—his own devastating power sealed behind closed eyelids. The evil eye curse destroyed everything it touched, an overwhelming force he'd never been able to control. He yearned to see the world. These Ether Glasses could fulfill that desperate wish.\n\n\"This is the perfect gift for him. He'll value you more than you can imagine.\"\n\nAn item that could transform the Evil Eyes' King—a being even the empire feared—into a steadfast ally. Lauel immediately grasped the astronomical value of the Ether Glasses. A treasure born from the convergence of Kraugel's intelligence, Elizabeth's craftsmanship, and Grid's reward from the Demon King Subjugation.\n\n\"We need to reach the evil eyes' village immediately. We must secure the king's allegiance before the empire makes their move.\"\n\nThe ten meritorious retainers stirred with purpose. The grace period Ares had granted them wouldn't last forever. They all suspected Valhalla would consider negotiations with the Overgeared Kingdom as merely a backup plan. Discussions with the empire might already be underway—Valhalla stood to gain far more by establishing friendly relations with the empire in exchange for the White Dragon's Eyes.\n\nLauel's expression grew contemplative. \"We should move quickly, but I'm concerned about the incomplete ether effect. Is that why the durability degrades so rapidly?\"\n\nThe glasses showed 187 durability when Lauel first received them. After absorbing a single basic spell, it had dropped to 186. Grid nodded, his expression grim. \"Exactly. Every spell absorbed consumes durability.\"\n\n\"Does the amount lost depend on the spell's power?\"\n\n\"No, fortunately not. I tested with Zednos and Laella—the durability decreases by the same amount regardless of magical strength.\"\n\n\"Then the magic output from the Evil Eyes' King shouldn't be an issue.\"\n\n\"Wrong. It's a massive problem. The magic constantly radiating from his eyes is virtually infinite. This level of durability will only last a few minutes.\"\n\n\"Infinite...\"\n\n\"Whether it's truly infinite or simply inexhaustible, the result is the same.\" Grid opened his inventory and produced another ether diamond—palm-sized, with a small amount of purple-black liquid swirling inside. \"I'm going to disassemble and reassemble Elizabeth's glasses. Once I reach 100% understanding, I can learn the production method.\"\n\nGrid had received seven rewards from the Demon King Subjugation—eight if the Demon King's Appearance event was included.\n\nHe'd chosen ether diamonds for three of those rewards.\n\nOnly three, for several reasons. First, Elizabeth's assistance was necessary to craft ether diamonds into functional glasses. Second, once Grid mastered Elizabeth's technique, he could recreate the glasses at higher quality.\n\nThe third reason was more frustrating. Grid couldn't separate the ether from the diamonds through any physical method. As a substance from another world, even Sticks and Braham didn't fully understand it. After considerable trial, Grid had attempted to extract the ether by destroying one diamond—but the moment it touched air, the ether evaporated without a trace.\n\nHe'd wasted one of his three precious ether diamonds.\n\n'If I could obtain pure ether...'\n\nThe possibilities were tantalizing. Imagine mixing ether into Valhalla of Infinite Affection—he'd gain magical protection surpassing even the Duke of Wisdom. Mages would struggle to harm him.\n\n\"Then we'll head to the evil eyes' village first and protect the king. Your Majesty can join us after crafting the improved glasses.\"\n\nThough Grid possessed a portable furnace, proper items required a smithy with comprehensive facilities and tools. Better working conditions increased the chances of producing higher-rated equipment. Grid nodded. \"Don't take unnecessary risks. The empire has some seriously strong bastards.\"\n\nThe safest approach would be deploying powerhouses like Piaro, Mercedes, Noll, Asmophel, and Singuled—but no one wanted that. Those individuals only had one life.\n\n\"The truce with the empire is still in effect. We'll be fine. Don't worry.\"\n\nThe ever-reliable Lauel snapped his fingers. A group of chibi-bodied figures poured into the conference room from outside.\n\nThe Destiny Guardians—sixteen evil eyes Grid had rescued from a dungeon in the past, now serving as Lauel's guards.\n\n\"You who desires to transcend, to glimpse past and future... We have answered your noble soul's call and arrived at this destined hour. From this moment forward, we shall defend your fate. This burden weighs upon the Destiny Guardians' shoulders... Kukukuk!\"\n\n\"...\"\n\nThe evil eyes' appearance was unsettling—mainly because they spouted this nonsense every time they appeared. The ten meritorious retainers wore awkward expressions as Lauel swept back his bangs. His silver hair caught the moonlight, seeming to scatter stars.\n\n\"My soul, imprisoned in solitude, trembles as it faces your destiny. I pay tribute to the eyes shrouded beneath black cloth and pose a question in Lauel's name. Destiny Guardians, do you possess the courage to weather a raging storm of fate?\"\n\n\"Kukuk... courage? It flows from our very 'essence,' never to fade... Kukukukuk!\"\n\n\"You know no fear? Magnificent! I sense the power of language in your words! The black dragon sealed within my arm begins to stir...!\"\n\n\"Huhuhut... The master of the great evil eyes has never known fear since birth. Even if the black dragon in your arm awakens, we shall never retreat... Eh?\" \n\nThe evil eyes had been speaking with enthusiasm when they suddenly froze. They'd spotted Grid standing behind Lauel.\n\n\"Y-You are the symbol of reincarnated past lives, who forged a connection with our great king—master of dark flames and white ice, seer of the world's truth!!\"\n\n\"Grid!!\"\n\nThe startled evil eyes broke into nervous sweats and averted their gazes. They feared meeting Grid's eyes might result in being dragged to a cave and handed pickaxes. When the evil eyes abruptly fell silent, the ten meritorious retainers couldn't help but feel awe toward Grid.\n\n'What? He overwhelmed the evil eyes species with just his presence...?'\n\n'He silenced the evil eyes who fear nothing in this world!'\n\n'My Liege! You command my respect!'\n\nThe evil eyes were actually a formidable species despite their cute appearance. Once they released the seals on their eyes, they could harm or immobilize targets through sight alone. Yet even the mighty evil eyes cowered before Grid. His dominance was absolute!\n\n\"...I'm heading to the smithy. I'll meet you at the evil eyes' village as soon as possible.\"\n\nGrid left the muted evil eyes behind and strode toward his workshop, resolved to craft durable Ether Glasses.\n\n'If I can harness his power, this is an opportunity to recruit someone potentially stronger than Piaro. I can't let this slip away.'\n\n***\n\n\"Wouldn't it be wiser to wait for the Overgeared Kingdom's response?\"\n\nGod of War Ares—the second player to establish a kingdom after Grid—had traveled to the empire with his military adviser, Sima Hui. He wore a deep helmet to conceal his identity, accompanied by Valhalla's finest players. Interestingly, they were escorting Sima Hui rather than Ares. Of course, this was Ares' command—he refused to risk losing a named NPC he'd finally obtained after six expeditions to the East Continent.\n\n\"The Overgeared Guild will stall as long as possible. The White Dragon's Eyes will lose their value if we wait for their answer.\"\n\nAres and Sima Hui had traveled directly to Titan to negotiate with the empire. They intended to deliver the White Dragon's Eyes and establish friendship between Valhalla and the Saharan Empire. While Ares preferred an alliance with the Overgeared Kingdom, Sima Hui's perspective differed.\n\n\"The Overgeared King is a master craftsman who restored the reapers' treasures. Unless I'm gravely mistaken, he likely already understands ether's properties and will use it to aid the Evil Eyes' King. He'll have prepared countermeasures against the White Dragon's Eyes and won't negotiate with us until he observes tangible consequences.\"\n\n\"Isn't that thinking too cynical? Like us, the Overgeared Kingdom views the empire as the greatest threat. They supported Valhalla's founding to keep the empire in check. Why would they treat us coldly now?\"\n\n\"Fear.\"\n\n\"Fear?\"\n\n\"Your Majesty's ability to conscript and cultivate soldiers' strength means Valhalla's power will inevitably soar. Cooperating with Valhalla to overcome the empire is like mounting a tiger's back to chase a lion. Even if the empire falls, they'll worry what comes next.\"\n\n\"...\"\n\nAres had sensed it. He'd been drawn to Grid's item-crafting abilities and had sought friendship with the Overgeared Kingdom out of gratitude for past aid. But now bitterness crept in as realization struck. 'The Overgeared Kingdom is deeply wary of us.'\n\nHe remained lost in thought before speaking with half-lidded eyes. \"Understood. I'll fully commit to your plan—strengthening ties with the empire while depleting resources from both the empire and the Overgeared Kingdom. No more hesitation.\"\n\n\"A wise decision. Shaking hands with the empire temporarily doesn't require direct hostility toward the Overgeared Kingdom.\"\n\n\"Mm... But are we truly going to the imperial palace? We may bring the White Dragon's Eyes, but I'm still the king of an enemy nation. Will the Emperor actually meet us? I'd be relieved if he simply didn't execute us...\"\n\n\"We don't need to meet the Emperor. The Grandmaster has already detected our movements. He'll likely initiate contact.\"\n\n\"Grandmaster?\"\n\n\"The empire's most powerful figure, wielding authority over military forces. His reputation from a century ago was legendary—his name reached even my homeland.\"\n\n\"Reputation on the East Continent...? A century ago? His longevity must be considerable.\"\n\n\"He's a transcendent. You might think of it as a form of immortality.\"\n\n\"Transcendent...? Immortal? You mean a legend?\"\n\n\"Not quite the same.\"\n\n\"...\" Ares sensed the Grandmaster was no ordinary being.\n\nJust as he opened his mouth to ask for details, a knight approached. \"I've come at the Grandmaster's command. Are you the King of Valhalla?\"\n\nAres initially mistook the knight for a Red Knight due to the crimson armor, but the design was different. In the absence of light, the armor appeared more black than red.\n\n\"Isn't it polite to introduce yourself before questioning others?\"\n\n\"I am Susan of the Neo Red Knights. I'll ask again—are you the King of Valhalla?\"\n\n\"...\"\n\nSima Hui nodded on behalf of the wary Ares. \"That's correct. You stand before King Ares, father of Valhalla and the distinguished God of War.\"\n\n\"Follow me.\" \n\nSusan guided Ares and his entourage to a castle—a structure so vast its boundaries couldn't be measured at a glance. Despite her apparent high rank in the empire, she led Ares' party toward this grand fortress without passing through a single checkpoint.\n\n\"...!\"\n\nAfter riding for several dozen minutes, Ares fell speechless at what lay before him. The palace, constructed from mysterious timber and stone, radiated brilliant hues—shining bright enough to blur the boundary between night and day.\n\n\"This is the Celestial Palace, where the Grandmaster resides.\"\n\nThe Celestial Palace! A palace not housing the Emperor bore such a grand title...? Ares struggled to comprehend. His vigilance heightened as Susan urged, \"Enter.\"\n\n\"My escorts...\"\n\n\"They may accompany you.\"\n\n\"...\"\n\nThey weren't even disarming them?\n\n'Is harming the Grandmaster beyond our capabilities?'\n\nHow formidable was this individual? Tension mounting, Ares entered the palace. The Grandmaster sat deep within the grand hall, his eyes slowly examining Ares.\n\n\"I wondered why Valhalla moved with such unusual haste. So a precious asset of the East serves under your banner. A pleasure to meet you. I believe we can maintain a beneficial relationship moving forward.\""
}