{
  "id": 973,
  "title": "Chapter 972",
  "content": "**Chapter: The Weight of Leadership**\n\nAccessory crafting belonged to specialists—jewelers and artisans who'd spent years honing that particular trade. No matter Grid's mastery at the forge, he couldn't simply produce rings or necklaces without the proper skills.\n\nBut he'd discovered a loophole.\n\n*Item Understanding.*\n\nThe realization had struck him recently: this fundamental ability of Pagma's Descendant was more powerful than he'd ever imagined. Through observation, use, repair, disassembly, and reconstruction, he could achieve perfect comprehension of any item—and with that understanding came the ability to recreate it.\n\nWhich meant accessories weren't beyond his reach. The process would take time, certainly. Days or weeks of patient work to reach 100% understanding. But Grid had never feared hard work.\n\n*The problem isn't knowledge. It's execution.*\n\nEven with the production method for the Ether Glasses burned into his mind, he lacked the delicate touch required for accessory work. His hands knew hammers and anvils, not the fine tools of a jeweler.\n\nBut there was another way.\n\n*Item Modification.*\n\nThe skill allowed him to reimagine any item he fully understood, reshaping it into something new. He could fuse the Ether Glasses with a helmet or mask—transform them from accessory to armor. And armor? Armor he could make in his sleep.\n\n*Just like the Overgeared King's Crown.*\n\nElizabeth would handle the Ether Diamond itself, crafting it with her jeweler's precision. Grid would complete the work by integrating it into a proper defense item. Item Modification had limited uses, but this investment was worth it.\n\n*An investment in the Evil Eyes King. In a potential alliance.*\n\nThe defensive properties excited him even more. If he could create armor with exceptional magic resistance, he might eventually mass-produce it. The entire Overgeared Guild could benefit.\n\n*Time to get to work.*\n\nGrid lost himself in the forge, the world narrowing to metal and fire.\n\nHis extended presence in the smithy didn't go unnoticed. After three days, Panmir—chief blacksmith of the Overgeared Kingdom and first ranked craftsman on the continent—found himself increasingly worried.\n\n*Shouldn't the king be out hunting? Questing?*\n\nThe fourth National Competition had lit a fire under the playerbase. Experience gains were surging. Level gaps closing. Chairman Lim Cheolho's predictions were coming true: as players advanced, class distinctions mattered less. Normal class rankers—the vast majority—had tasted hope during the competition. That hope had ignited into obsessive determination.\n\nEveryone wanted to become the next Grid.\n\nThe long-term experience buffs from competition rewards meant nearly every serious player was grinding constantly. And during this critical period, Grid stood at a forge making glasses while the 10 Meritorious Retainers defended some remote village.\n\nThe weight of leadership, Panmir realized, was crushing.\n\n*The more you have, the more you have to lose. And yet he carries it all without complaint.*\n\nThe Overgeared Kingdom wouldn't crumble easily. Not with foundations this solid. Panmir felt that weight settle on his own shoulders—the responsibility of maintaining excellence in Grid's absence. He made his rounds through the smithy district, visiting each forge, encouraging every blacksmith.\n\n*Tang! Tang! Tang!*\n\nThe sound of hammers rang day and night, the heartbeat of Reinhardt itself.\n\n***\n\nLepio was barely worth the title of estate—just rice paddies and mountains stretching in every direction. Remote, peaceful, and utterly unremarkable. One of the more obscure territories in the Gauss Kingdom.\n\nPerfect for hiding.\n\n\"Never would've guessed the Evil Eyes' village was tucked away here,\" one of the Meritorious Retainers observed. \"The Empire's going to have a hell of a time finding this place.\"\n\n\"Kukukuk... Headless one, you speak with ignorance.\" The Evil Eye guide's voice carried theatrical weight. \"This is not merely a 'village.' This is the sacred convergence of darkness and chaos. We do not 'hide.' We have *sealed* ourselves, lest our power run rampant and—\"\n\n\"Why do you keep calling me headless? I have a head. See?\" Vantner tapped his helmet. \"And I don't understand half of what you're saying.\"\n\n\"...\"\n\nThe other Meritorious Retainers exchanged pitying glances. Vantner was the only one completely immune to the Evil Eyes' dramatic speeches—mostly because he wasn't paying attention.\n\nEuphemina diplomatically changed subjects. \"It's a beautiful place.\"\n\nAnd it was. Instead of the desolate wasteland they'd imagined—some blighted realm of darkness—they'd found a charming settlement of rounded cottages with colorful roofs.\n\n\"Bet those colors really pop in the sunlight,\" someone commented.\n\n\"Kukukuk. The moon is superior. When we bathe in cold moonlight, our blood stabilizes, and the beast within us quiets—\"\n\n\"You're underground though. No moonlight down here, right?\"\n\n\"...\"\n\nRegas' innocent observation deflated their guide instantly. His shoulders slumped.\n\n*Tactless honesty,* the group realized, *is the Evil Eyes' weakness.*\n\nJishuka cut through the awkwardness. \"Let's see the king. The Empire won't wait forever.\"\n\nFaker and the Overgeared Shadows had already dispersed throughout the village, analyzing defensible positions and potential invasion routes. Within minutes, the Destiny Guardians led the Meritorious Retainers to the castle.\n\nIt was adorable.\n\nWith Evil Eyes averaging barely four feet tall, every structure had been built to their scale. The castle rose perhaps six inches above its gates—a miniature fortress that would've looked more at home in a child's toy collection.\n\nThe moment they crossed the threshold—all except Euphemina, who hung back—three figures appeared on the ramparts.\n\n\"We have been expecting you.\"\n\nThe Evil Eyes' ministers stood in theatrical poses, hair swept artfully across their faces, hands positioned just so.\n\n\"You come to defend our great king. We know this. You serve Grid, the only human to resist our gaze. We acknowledge this.\"\n\n\"However, an audience cannot simply be granted. We must verify your worthiness.\"\n\n\"Understand—our king's power transcends mortal comprehension. His gaze alone can unravel life and destiny. The unworthy who meet him face eternal damnation. This test is for your protection. Submit.\"\n\nThree eyepatches fell simultaneously.\n\nThe exposed Evil Eyes began to rotate, hypnotic patterns swirling.\n\n**[You have made eye contact with an Evil Eye.]**\n**[Your spirit and soul yield before the mighty Evil Eye.]**\n**[Status Effect: SUBMISSIVE]**\n**[For 3 seconds, your actions will not be your own!]**\n\nThree seconds. Barely anything. Yet the effect was devastating.\n\nVantner dropped to all fours and barked. Jishuka's hands moved involuntarily to measure her chest. The others found themselves performing equally bizarre, involuntary actions.\n\n*Three seconds to make us kill each other,* Lauel realized with cold clarity. *Just three seconds.*\n\nThe Meritorious Retainers—some of the strongest players on the continent—felt genuine fear.\n\nWhen the effect ended, the ministers' expressions softened. \"You are not yet qualified for an audience. Perhaps another time.\"\n\n\"This is for your safety, you understand. We mean no offense.\"\n\n\"Accommodations will be provided. Rest. Prepare. When the Empire comes, you will defend our king and our home.\"\n\nTheir tone held no hostility. Only gratitude and concern.\n\n\"Impressive intelligence network,\" Lauel murmured, shaking his head. \"Though I suppose it's not a network at all, is it? Future Sight gives them perfect information. Remarkable species.\"\n\n\"...\"\n\n\"Everyone, listen up.\" Lauel's voice carried command. \"The Empire will attack. We don't know when, but it's coming. Until then, we guard the king. It won't be easy—waiting for an enemy to strike on their terms never is—but this is the mission. We cannot lose the Evil Eyes King.\"\n\n\"Understood.\"\n\nThe Meritorious Retainers and Shadows established a defensive perimeter, rotating patrols, securing chokepoints.\n\nThree days passed.\n\n\"Hope we're not too late.\"\n\nCoke, Zednos, and Laella arrived with six hundred elite soldiers, each equipped with Grid's mass-produced battle gear. The reinforcements transformed the village into a fortress.\n\n*We could stop a Red Knight cold with this force.*\n\nThe gathering was unprecedented. The 10 Meritorious Retainers, including Faker and Yura—legendarily elusive. Elite troops numbering in the hundreds. The Overgeared Shadows.\n\nThe Overgeared Guild feared no invasion. Not from the Empire. Not even from a Great Demon.\n\n*This time,* Lauel thought with fierce pride, *we'll handle it without needing Grid.*"
}