{
  "id": 974,
  "title": "Chapter 973",
  "content": "Six days had passed since the Overgeared Kingdom's forces took up positions in the evil eyes village.\n\n\"The empire has at least five million players under its banner,\" Pon said, cutting through his colleagues' optimistic chatter about repelling an imperial invasion. \"What happens when they issue a quest to all of them? We'll be swept away in the tide.\"\n\nSilence fell over the group. The image materialized in everyone's mind—wave after wave of five million players, an endless assault. How long could they possibly hold out?\n\n\"I never considered the players,\" Coke admitted, his face pale. Several other Overgeared members looked equally shaken, fear creeping into their expressions.\n\nLauel stepped in before panic could take root. \"Quest rewards don't come cheap. War quests especially—their payouts are several times higher than standard missions. Even the empire can't afford to mobilize hundreds of millions of players, no matter how deep their coffers.\"\n\n\"Wait,\" someone said. \"Is having too many players actually a problem?\"\n\n\"It's complicated. Many players enlist in the army or become knights. Moving soldiers and knights is easy—they're bound by duty and don't require massive rewards.\"\n\nPeak Sword groaned. \"Why the hell would anyone enlist in the *army*? In a *game*?\" As a Korean who'd completed his mandatory military service, the thought of volunteering for another stint—even a virtual one—baffled him. He couldn't fathom the psychology behind it.\n\nThe other members, however, understood perfectly.\n\n\"Military service isn't mandatory everywhere like it is in Korea. Plenty of people romanticize army life.\"\n\n\"Right. They'd never enlist in reality, but in a game? Why not?\"\n\n\"Huh.\"\n\n\"That's actually a disadvantage for us. Since most of our players are Korean, they'll never join the army, even in-game.\"\n\n\"So the Overgeared Kingdom has less control over its player forces than other nations?\"\n\n\"Exactly. And it'll stay that way unless Korea unifies quickly.\"\n\n\"That's bizarre...\"\n\nThe notion that real-world politics could bleed into the game fascinated them all. But duty called.\n\n\"Shift change,\" someone announced.\n\nThe Overgeared members dispersed throughout the village.\n\n***\n\nDay ten of their station at the evil eyes village.\n\n\"I'm so bored.\"\n\n\"I want to hunt. If the empire's going to attack, why haven't they shown up yet?\"\n\nVantner and Peak Sword—the two least patient of the ten meritorious retainers—had reached their breaking point. The evil eyes village was a completely isolated underground settlement with no entertainment and no hunting grounds. Ten days of gate duty had ground them down into restless, anxious shells of themselves.\n\n\"Everyone else is probably hunting right now.\"\n\n\"Yeah. Not hunting during the National Competition buff period is a massive waste.\"\n\n\"We're hemorrhaging efficiency...\"\n\n\"If there was even a single hunting ground nearby, I'd grind between shifts, but there's *nothing*...\"\n\n\"Ugh...\"\n\n\"God...\"\n\nThey checked the time obsessively, willing their shift to end so they could log out, crack open a beer, and zone out in front of the TV.\n\n\"Hm?\"\n\nPeak Sword and Vantner, stationed before the small castle that housed the evil eyes king, turned toward an alley across the street. Three exceptionally short evil eyes stared back at them—barely a meter tall, with round faces and flushed cheeks. One had a runny nose, a string of snot dangling from his nostril.\n\n\"They're kids.\"\n\n\"How cute.\"\n\nThe evil eyes were already doll-like in appearance. Even the ones with scars or fiercer features had an undeniable charm. But the *children*? Peak Sword and Vantner smiled like doting fathers and waved.\n\nThe children shyly retreated deeper into the alley.\n\n\"They're precious as long as they don't *talk*.\"\n\n\"Yeah. As long as they keep their mouths shut.\"\n\nBoth men remembered their first day in the village. The Destiny Guardians had verified their identities and ushered them through, straight into the enthusiastic welcome of a thousand evil eyes. It had been hell. Like facing a thousand Lauels at once, each determined to engage them in philosophical debate. They'd nearly lost their minds.\n\nThank god they'd prepared earplugs in advance—simple items designed to resist curses, normally classified as junk. Who knew miscellaneous items could be lifesavers?\n\n\"The king's theatrics must be off the charts. Can you imagine the conversations God Grid had to endure to befriend him? Grid truly is divine. A lesser man would've cracked. Actually, the first time I met God Grid—\"\n\n\"...\"\n\nAnd there it was—Peak Sword's daily worship of Grid. Vantner pulled out his well-worn earplugs, about to jam them in his ears, when the three evil eyes children emerged from the alley and approached.\n\n\"This area is restricted,\" Vantner said, his tone harsh despite his affection for the kids. He couldn't afford to let his guard down, no matter how adorable they were.\n\n\"Assassins from the empire might come. Don't play around here. Go somewhere else. Better yet, stay inside your homes.\"\n\nThe children lingered, exchanging glances. Then, in unison, they brought their hands forward from behind their backs. They each held candy shaped like fern leaves.\n\n\"For you. We risked our necks to get these.\"\n\n\"Did you steal candy your mothers hid?\"\n\n\"Kukukuk? What nonsense. My mother would never dare mistreat me. The power sleeping within me is a violent entity that disregards even the bonds of blood. Kukukuk.\"\n\n\"...I have no idea what you just said. But, uh, thank you.\"\n\nKnowing how dangerous it was for the evil eyes to acquire goods from the outside world, Vantner and Peak Sword each took only one candy. They gently urged the children to go home.\n\nThe children hesitated, then bowed.\n\n\"You are the first—and last—humans we have ever bowed to. You should be honored.\"\n\n\"Uh...\"\n\n\"Thank you for protecting our great king.\"\n\nBlushing with embarrassment, the children fled. Peak Sword and Vantner watched them go, an uneasy feeling settling over them.\n\n\"Shit.\"\n\n\"You just raised a death flag.\"\n\nA classic setup. The stoic kids suddenly showing gratitude, right before disaster struck. It was straight out of every movie and manhwa they'd ever seen.\n\n\"Contact Lauel—gah!\" Peak Sword's hand flew to his sword hilt. Two shadowy figures materialized from thin air, blocking the children's path.\n\nThe children froze. Peak Sword and Vantner launched themselves forward.\n\nBut the assassins were skilled. Daggers flashed through the air, forcing the two men to deflect. In that heartbeat of delay, the assassins seized the evil eyes children by their throats, clearly intending to use them as hostages.\n\nIt didn't work.\n\nPeak Sword and Vantner were too strong.\n\n\"Where do you think you're going?\"\n\nThe assassins barely dodged the sword that whistled past their heads. Notably, they didn't use the captured children as shields—their mission was to take the children alive.\n\nPeak Sword adopted his draw stance. \"What do you want with a bunch of kids?\"\n\nThe assassins didn't answer. They hurled daggers equipped with explosive enchantments. Vantner raised his shield to intercept. The resulting blast shook the street, and through the billowing smoke and dust, the assassins prepared to flee.\n\n\"You really think it's that easy? Hah.\"\n\nSomething spun through the haze—Vantner's shield, whirling like a boomerang. The assassins crossed their daggers to block, but the impact drove them back, grunts of pain escaping their lips.\n\nVantner caught his returning shield with a grin. \"Good. I was getting bored anyway. Put the kids down and fight properly.\"\n\n\"Tch!\"\n\nThe assassins knew better. Facing the 1st ranked guardian knight Vantner and the 1st ranked quickdraw swordsman Peak Sword was already a losing proposition. And this place was crawling with enemies. The longer they fought, the worse their odds.\n\nOne assassin threw down a smoke bomb. While Peak Sword and Vantner were momentarily disoriented, they'd escape the city. Or so they thought.\n\n\"Hey,\" said the evil eyes child with the runny nose, still caught in the assassin's grasp. \"Look at me.\"\n\n\"What—\"\n\n\"You touched my body. Do you want to die?\"\n\nThe assassins' plan to kidnap the children had been based on a simple assumption: young evil eyes would have underdeveloped powers. They were wrong.\n\nThe child removed his eyepatch.\n\nThe assassin holding him froze solid.\n\n\"Ah—aaaaaah!\" The other assassin tried to throw his captives away, but it was too late. The power of the evil eye activated through sight alone—the most unreasonable force in the world.\n\n'How—'\n\nThis assassin had been more careful. His captives were bound so tightly they couldn't even lift their fingers to remove their eyepatches. He'd done everything right!\n\nHe activated his stealth skill, preparing to vanish before the smoke cleared. But something was wrong.\n\nThe smoke wasn't dissipating. It was *thickening*, rolling like fog over a lake at dawn, obscuring everything.\n\nThe assassin's blood ran cold. The two children he'd just tied up were now standing in front of him, unbound.\n\n*When did they—*\n\nThe children's laughter echoed through the impossible fog.\n\n\"Wander lost in this mist forever. Kuk... kukukuk! Kuhahahaha!\"\n\n\"No—aaaah!\"\n\nHis screams meant nothing. The fog only grew denser.\n\n\"Wow...\" Peak Sword moved through the smoke screen easily, staring at the assassins. Both were clearly high-ranking operatives. One had frozen to death where he stood. The other thrashed and screamed, lost in hallucinations.\n\n*They even defused the death flag...*\n\nThe evil eyes species was absolutely terrifying. Now he understood why Grid and Lauel were so fixated on securing them as allies.\n\n\"The illusion isn't permanent,\" one child said, pointing at the hallucinating assassin. \"I recommend neutralizing him quickly.\"\n\nPeak Sword nodded and approached, binding the assassin and removing his mask. An NPC. That meant they could attack him freely. If these had been imperial NPCs, the armistice agreement would have prevented any aggression.\n\n*Mercenaries, then.*\n\nPeak Sword and Vantner surveyed the village. Fierce battles raged throughout the streets.\n\n\"So... what do we do?\"\n\n\"What *can* we do? We stay here.\"\n\nTheir mission was critical. Guarding the gate meant protecting the evil eyes king.\n\n\"It's dangerous. Don't go home—get inside the castle.\"\n\nAs Peak Sword and Vantner ushered the children toward the gates, dozens more figures materialized from thin air.\n\nThe invasion was far from over.\n\n\"Let's deal with you first, then we'll worry about the evil eyes.\"\n\nPeak Sword and Vantner faced the assassin squad without a trace of tension.\n\n\"This is going to be so much fun.\"\n\n\"Finally. I was dying of boredom.\"\n\n\"You're both insane!\"\n\nThe lead assassin scowled and gestured. His team surged forward as one.\n\nIyarugt roared to life."
}