{
  "id": 975,
  "title": "Chapter 974",
  "content": "**Chapter 974**\n\nChris placed the mission's odds of success above ninety percent.\n\nFour months remained on the truce with the empire—a system-enforced agreement that prevented either side from attacking the other directly. With the Overgeared members guarding the evil eyes' village, the empire couldn't launch a straightforward assault. Even if they tried, the defenders only needed to hold the gates until Grid arrived.\n\nThen the empire adapted.\n\nRather than invade directly, they hired external forces.\n\nChris's expression darkened. *Those imperial bastards...*\n\nHe swung Grid's greatsword in a wide cross, catching two assassins slipping through the shadows. The blade cleaved through their light armor effortlessly—Chris possessed the highest attack power among the defenders, after all.\n\n*Dammit. This is getting messy.*\n\nFrom his vantage point on a nearby rooftop, Chris surveyed the village. Battles raged across every district. The assassins operated in pairs, and each duo was powerful enough to overwhelm two elite units.\n\n*They're handling a hundred high-level players like it's nothing...*\n\nWere these really just mercenaries?\n\nChris activated his Tyrant class abilities and shot forward. The further he traveled, the more his damage output increased.\n\n\"Viscount Chris!\"\n\nThe Overgeared soldiers looked relieved despite their precarious situation. Chris descended like a storm wind, cutting down the assassins threatening his men.\n\n\"Assemble your troops at the castle,\" he ordered the unit commanders. \"Defend the evil eyes' king. The gates must not fall.\"\n\n\"Yes, sir!\"\n\nAs one of the twin leaders among the ten meritorious retainers—the other being Jishuka—Chris had full authority to direct troops. His soldiers responded with crisp salutes, rallying another unit as they moved toward the castle.\n\nMeanwhile, Chris continued across the rooftops, eliminating assassins as he made his way toward the village center.\n\nThe heart of the settlement was a small library—currently defended by Lauel, Jishuka, Pon, and Regas. The concentration of top rankers there wasn't coincidental. It was one of the village's most critical locations.\n\n\"I'm here,\" Chris announced, breaking through the encircling assassins to reach Lauel's side.\n\nJishuka provided covering fire while Lauel—who somehow looked like he'd aged ten years—glanced up.\n\n\"The empire wants what's in this library,\" Lauel said. \"The sealed knowledge.\"\n\n\"Obviously...\"\n\nElsewhere in the village, assassins appeared in pairs. Here, they numbered in the dozens.\n\nChris cut down three more before speaking. \"What the hell are these guys? They're not using doors—they're just *appearing*. Not even Faker can do that, and he's unlocked the right arm.\"\n\n\"Akashic records,\" Lauel replied.\n\n\"Magic?\"\n\n\"A transcendent magician who's achieved enlightenment can weaken the fabric of space itself. It enables dimensional transportation on a mass scale.\"\n\n\"This doesn't feel like Mass Teleport—they're scattered everywhere. Can any great magician do this?\"\n\n\"I don't know about ordinary great magicians. But for a transcendent? Absolutely.\"\n\n\"A transcendent...\" Chris's eyes widened. \"Goldhit.\"\n\nOne of the empire's Five Pillars. The Master of the Tower of Eternity.\n\n\"That makes sense. But if they keep sending waves like this, how long can we hold? There's a limit to our stamina.\"\n\nChris voiced his concern openly. He didn't doubt Lauel—the man was brilliant, but even geniuses made mistakes. Yet this time, Lauel seemed unworried.\n\n\"A transcendent's mana isn't infinite,\" Lauel said calmly. \"Just like our stamina.\"\n\n\"Whether they charge head-on or warp in, we can't stop an all-out assault.\"\n\n\"Kukuku... A volume offensive? No need to worry about that.\" Lauel's lips curved. \"The empire doesn't have infinite money.\"\n\n\"...What?\"\n\n\"They're paying for this. Moving external forces costs them compensation. They can't afford to flood us with troops.\"\n\nChris frowned. \"The empire has to *pay* to move their vassals? Why wouldn't they move them for free?\"\n\nNearly every kingdom on the continent paid tribute to the empire. They were effectively slaves. Why would deployment cost anything?\n\n\"Do you know why those kingdoms never resist?\" Lauel asked.\n\n\"...No?\"\n\n\"Because they believe the empire's power is limitless. The empire can never show weakness. The moment they stop offering payment, other nations will question that power. Their dominance would crumble.\"\n\n\"So they have to pay every time they mobilize external forces?\"\n\n\"It's a bluff—an expensive one. The empire projects infinite strength to maintain their grip.\"\n\n\"But you keep saying the empire is poor. Why?\"\n\nIt didn't add up. This was the empire that had dominated the continent for centuries, monopolizing resources and conquering nations. How could they be *poor*?\n\nWhile they talked, Lauel wove magic with surgical precision. He adjusted wind currents to enhance Jishuka's arrows while disrupting the assassins' throwing techniques. He triggered minor earthquakes to herd enemies toward Chris. Despite having few combat skills, Lauel was devastatingly effective.\n\nHis brain was the real weapon.\n\n\"I realized something watching the magic machines at the National Competition,\" Lauel said. \"How much manpower and money did the empire invest in excavating those ancient artifacts? How much went into restoring and operating them?\"\n\n\"So the empire is poor because of the magic machines?\"\n\n\"No. The machines are just one symptom. I asked myself a more fundamental question.\"\n\n\"Which is?\"\n\n\"If the empire is truly as wealthy as everyone believes, why do they struggle against the Overgeared Kingdom and Valhalla?\"\n\n\"...?\"\n\n\"Why not just produce and dispatch infinite troops? If money is no object, why show restraint at all?\"\n\n\"Ah...\" Lightning seemed to strike Chris's mind.\n\nLauel had observed the empire's tactics carefully—and discovered their limits.\n\n\"You're a genius,\" Chris said quietly.\n\nLauel laughed. \"Time is fair to everyone.\"\n\nAs Grid grew stronger, so did Lauel. He studied. He thought. He accumulated knowledge and expanded his vision.\n\n\"I don't know what kind of genius Ares recruited,\" Lauel added, activating a pre-set trap that flushed out hidden assassins. He covered half his face with his hand, smiling. \"But whoever it is needs to be ready for me.\"\n\nLauel was certain of one thing: Grid and Kraugel had grown so powerful that strategy and tactics were becoming obsolete against them. They were approaching absolute force.\n\nAt that moment, grey pillars erupted throughout the village—markers of invader deaths.\n\nBoth Chris and Lauel turned south without speaking. That was where the pillars rose fastest.\n\nYura's zone.\n\nChris clicked his tongue. \"Lauel, even if your predictions are wrong, I don't think the empire can break through.\"\n\n\"...Agreed. Let's go inside. Time to switch shifts with the evil eyes.\"\n\nThe evil eyes' magic power wasn't limitless, just like human stamina. Unlike their king, ordinary evil eyes could only use their full power for two hours daily.\n\nBut two hours was more than enough.\n\n\"H-Help!\"\n\n\"Please, spare me!\"\n\nThe eyes' power brought even hardened assassins to their knees. In half an hour, the evil eyes eliminated most of the remaining threats before rotating out to let the rested Overgeared members take over.\n\nThe empire's advance teams collapsed without achieving anything.\n\n\"You're decent,\" one assassin gasped. \"Power like that... transcends the human framework.\"\n\n\"Haha... You get what you pay for.\"\n\n***\n\nNineteen days after the meritorious retainers departed for the evil eyes' village.\n\n[Your understanding of the **Ether Glasses** is now at 100%!]\n\n[The **Ether Glasses** production method has been acquired.]\n\n\"Finally.\"\n\nGrid stepped back from the forge. Nineteen days of wrestling with those damned glasses—but he'd done it. He now had the production method, which meant he could convert the glasses into different forms. Helmet. Face shield. Whatever worked best.\n\n*Given that I can use it myself...*\n\nA helmet made more sense than a face shield. Shields and masks occupied the same equipment slot, and Grid had no intention of abandoning his Slaughterer's Eye Patch—the artifact had proven invaluable during the Demon King Subjugation.\n\n*I need a helmet at least as good as Triple Layers. Combine the glasses with a proper helm...*\n\nGrid set his baseline and activated Legendary Blacksmith's Reconstruction. Then he paused.\n\nThe White Tiger's Breath.\n\nThe White Tiger Sword summoned stone pillars. Could he create a helmet as hard as rock by incorporating the breath?\n\n*Would make my head as thick as stone...*\n\nA perfect opportunity to increase his defense.\n\n*...Later. I'll get another Ether Diamond and add the White Tiger's Breath when I make my personal helmet.*\n\nFour of Grid's eight National Competition rewards were sacred creature breaths. He now possessed one Red Phoenix's Breath, one Blue Dragon's Breath, one White Tiger's Breath, and two Black Tortoise's Breaths.\n\nSoon his equipment would contain the power of all four sacred creatures.\n\n*Kukuku... Once I get pure ether, I'll be unstoppable.*\n\nWouldn't that be enough to challenge the empire?\n\nGrid frowned slightly, catching himself. Just yesterday—or so it felt—he'd been intimidated by the \"powerhouses\" he'd encountered at the empire. Now he wasn't afraid.\n\nWas he getting arrogant?\n\nNo. His self-image had improved after crushing Garam. His experience as the Demon King had built genuine confidence.\n\n\"Huehue...\"\n\nGrid thought about the empire's strength, then checked the calendar. No emergency messages from the evil eyes' village yet, which meant the empire hadn't invaded. \n\nGood. That gave him time to finish modifying the item."
}