{
  "id": 976,
  "title": "Chapter 975",
  "content": "# Day Twenty\n\n\"Stop this futile resistance!\"\n\n\"You're only making it worse for yourselves!\"\n\nThe enemy had come again. Like the attackers who'd appeared on the first day, and those who'd struck yesterday, they materialized out of nowhere. And if their boastful threats were any indication, these invaders all shared one fatal misconception—they thought they were strong.\n\n\"Come and get it!\" Vantner roared with savage glee. \"We're right here!\"\n\nPeak Sword pumped his fist. \"City guards, move up! Overgeared on me!\"\n\n\"...Could you *please* stop calling us that.\"\n\nDespite the complaint, the Overgeared members were brimming with energy. Vantner and Peak Sword in particular radiated barely-contained violence. After ten days of tedium, combat was a welcome release.\n\nPeak Sword activated Five Combined Strikes. Iyarugt blurred through the air five times in rapid succession. Five attackers collapsed, dead before they hit the ground.\n\n[The experience of Iyarugt has increased by 0.1%!]\n\n\"Excellent.\" Peak Sword couldn't suppress a satisfied smirk. These daily skirmishes didn't just sharpen his technique—they fed experience directly into the item.\n\nBeside him, Vantner crushed an enemy's skull with the mace concealed behind his shield. \"Why are you so fixated on that sword?\"\n\n\"What?\" Peak Sword blinked. \"Where's this coming from?\"\n\n\"You won gold medals. If you asked Grid to forge something with those materials, you could get a weapon far stronger than Iyarugt. So why stick with it?\"\n\nIt was a fair question. Peak Sword had been wielding Iyarugt as his primary weapon for over a year now, steadily accumulating item experience. The process was glacially slow—growth items leveled at a snail's pace. When he could request something more immediately powerful, why endure this grind? Even if Iyarugt eventually reached its final rating, who could guarantee it would surpass a weapon crafted from one of the Four Auspicious Beasts' materials?\n\nPeak Sword considered the question seriously before answering. \"Performance aside, I believe the demonkin Iyarugt could become a tremendous asset to Grid. You know he has powerful NPCs at his disposal, but he hesitates to deploy them—their lives aren't infinite. Iyarugt, though, is classified as a pet. No risk of permanent death. Once I complete the final upgrade, I'll have given Grid a new weapon he can actually *use*.\"\n\n\"Wait.\" Vantner's shield bash sent an approaching assassin flying. \"You're planning to give it back?\"\n\n\"Of course. I'm just the item's caretaker.\"\n\n\"Shit...\" Vantner trailed off, momentarily speechless. Everything Peak Sword did—every choice, every sacrifice—was for Grid's benefit. But Peak Sword had his own life, his own goals. How could someone dedicate *years* to serving another person?\n\nVantner pulverized another attacker and pressed further. \"Why go this far for him? Look, I'm grateful to Grid. I like the guy. I'd die for him a hundred times over in combat. But sacrificing *years* of my own progression?\" He shook his head. \"I couldn't do it. I don't think I ever could.\"\n\nThis went beyond simple loyalty. Self-sacrifice of this magnitude? It was borderline inhuman.\n\nPeak Sword shrugged, unfazed by Vantner's incredulous stare. \"The main reason is that Grid is Korean.\"\n\n\"...What?\"\n\n\"First, there's the tax situation. In South Korea, professional gaming isn't recognized as having legitimate business expenses. Grid pays nearly fifty percent of his earnings in taxes—income tax, national pension contributions, health insurance premiums. He's funneling half his profits back into the country, and he could easily be earning billions of won through foreign income if he wanted to avoid it.\"\n\n\"So you're grateful he's... making your country richer?\" Vantner sounded bewildered. \"Are you secretly the president? Why would that matter to you?\"\n\n\"The Patriotic Association of South Korea doesn't think like foreigners do.\"\n\n\"Your patriotism is *insane*.\"\n\n\"It runs in the blood—generations deep. I feel genuine gratitude toward Grid, and helping him feels like serving my country. I'll dedicate myself to him for life.\"\n\n\"You're not normal.\"\n\n\"I've been told that since childhood.\"\n\n\"That wasn't a compliment.\" Vantner grunted. \"Maybe I'd understand if Grid and I had something in common.\"\n\n\"Grid will never be bald, so that's not happening.\"\n\n\"You bastard!\"\n\n---\n\n# Day Twenty-Two\n\n\"Not again...\"\n\nExhaustion had carved itself into the faces of the Overgeared soldiers. Over ten days of relentless invasions, each one a sudden ambush. The mental strain was suffocating. Worse, the basic combat skills of these enemies far exceeded the soldiers' own capabilities. Without the premium recovery potions from Reidan's alchemy facility and Grid's mass-produced equipment sets, they'd have been slaughtered a dozen times over.\n\nPale hands touched armor, feeling the scars beneath.\n\n---\n\n# Day Twenty-Five\n\n\"The soldiers are at their breaking point.\"\n\n\"Where the hell are the reinforcements?\"\n\n\"Imperial troops have seized Lepio Village. The road's blocked—no one can get through.\"\n\n\"Damn it!\"\n\nThe six hundred elite soldiers of the Overgeared Kingdom were running on fumes. Stamina potions—gone. Their armor hung in tatters, weapons chipped and cracked from endless combat. And without blacksmiths or forges in the evil eyes' village, repairs were impossible.\n\nBut there was a silver lining. A significant one.\n\nThe high level of their opponents meant experience gains were astronomical. The soldiers had gained an average of twenty levels through the ordeal. Several had even hit level three hundred and completed their third advancement. They were rapidly becoming the elite core of the Overgeared military.\n\n*If* they survived to make it home.\n\n---\n\n# Day Twenty-Eight\n\n\"Open the way.\"\n\n\"This area is under active assault. Entry is restricted.\"\n\n\"Restricted? You dare deny passage to the Saharan Empire's army?\"\n\nImperial regulars had arrived at the village entrance, demanding access. The Overgeared forces held the chokepoint, refusing entry. The imperial soldiers couldn't advance past the defensive line.\n\nA roadblock—the same tactic the empire itself had pioneered. They'd seized every entrance to Lepio Village to prevent Overgeared reinforcements from reaching the evil eyes' settlement below. Now their own strategy had been turned against them.\n\n---\n\n# Day Thirty-One\n\n\"Ungh...\"\n\nThe Overgeared soldiers' morale had all but evaporated, yet the imperial blockade gave them no option to withdraw. Invaders continued materializing to assault them. Their equipment was falling apart. Reinforcements still hadn't broken through.\n\nWave after wave of despair crashed over soldiers who'd already exhausted their physical and mental reserves.\n\n\"...\"\n\nEven the evil eyes civilians defending the rear flanks had fallen silent two days ago, too drained to speak their unnerving words. Meanwhile, the imperial observers watched with relaxed contempt, their mockery deepening the Overgeared soldiers' anguish.\n\n*Thwip! Thwip!*\n\nJade-green magic bullets streaked through the sky. Newly-appeared invaders dropped dead on the spot.\n\nA beautiful black-haired woman stood before the weary soldiers.\n\n\"You're safe now.\"\n\nYura would protect what belonged to Grid if it meant dying a hundred times over. She formed another magazine of magic power bullets and reloaded.\n\n---\n\n# Day Thirty-Three\n\n\"Hah... hah...\"\n\nEven the ten meritorious retainers were flagging. They'd rotated shifts to maximize rest, but equipment durability was finite. Through dozens of skirmishes, their armor and weapons had reached the breaking point. Repair kits—depleted. When they switched to backup gear, their combat effectiveness plummeted. The enemies felt stronger. Their numbers seemed to swell.\n\nThey prayed for relief. For allies to arrive.\n\nBut they couldn't show weakness before the soldiers, so they ground their mental fortitude to dust in silence.\n\n\"...\"\n\nEven Peak Sword and Vantner, the most aggressive members of the group, had stopped enjoying the fight. The strategic reality was brutal—entering the evil eyes' village required spatial magic channeled through the fountain in Lepio, which was completely occupied by imperial forces.\n\nNear impossible.\n\n\"What now?\" someone asked quietly.\n\n\"What do we do?\"\n\nAll eyes turned to Lauel. It was a testament to his position—like Grid himself, the Overgeared members believed in him implicitly. Whatever skeptics might say, Lauel had built this kingdom.\n\nLauel shrugged. \"We've done our part.\"\n\n\"...\"\n\n*That's it? No solution?*\n\nLauel smiled at his colleagues' obvious frustration. \"It's over now. Our mission was always to hold until the time came. We've accomplished that.\"\n\n---\n\n## Lepio Village\n\n\"The cockroaches lasted longer than expected.\"\n\nThe speaker looked perhaps ten years old—a young girl smiling with cold cynicism far beyond her apparent age.\n\n\"Now they've reached their limit.\"\n\nA Black Knight standing at her side reported, \"Intelligence confirms the enemy's spirit has completely broken.\"\n\n\"You told me that days ago.\"\n\n\"Ah—apologies. A few days ago, I reported their morale was *beginning* to decline.\"\n\n\"And now it's completely shattered?\"\n\n\"Yes, Your Excellency. They've been fighting randomly-appearing enemies for over twenty days. It's remarkable they've lasted this long at all.\"\n\nFive golden lines adorned the side of the knight's helmet—the insignia of the First Black Knight, commander of the order. Yet this middle-aged veteran treated the little girl with utmost deference.\n\nNaturally. The girl was Magician King Goldhit—the continent's strongest mage, master of the Tower of Eternity, and one of the empire's Five Pillars. The Black Knights might represent imperial might, but before Goldhit, even they were subordinates.\n\n\"Mm. I'll trust your assessment, Captain. I'll send the final wave.\"\n\nOver the past month, Goldhit had dispatched nearly ten thousand troops into the evil eyes' village via the fountain—a warp device that offered fascinating insight into demonkin magical theory. Still, even she wasn't omnipotent. The sustained expenditure of magic power had worn her down.\n\nFifty knights assembled before her.\n\n\"You summoned us...\"\n\nThe Blue Flame Knights of the Gauss Kingdom. Their swords burned with cerulean fire, and their skill rivaled that of the empire's Black Knights. Of course, they paled in comparison to the Black Knights' scale—a thousand-strong order backed by virtually unlimited imperial resources.\n\nGoldhit addressed their commander. \"Stand at the fountain. I'll transport you to the evil eyes' village. Sweep away what's left of the Overgeared forces.\"\n\nThe knight commander's jaw tightened. The Overgeared Kingdom was Gauss's sworn enemy—they'd been at war since the days when Grid served the Eternal Kingdom. The Gauss Kingdom considered the Overgeared upstarts a public menace.\n\nThis commander had lost countless soldiers to the Overgeared military. He *wanted* revenge.\n\nBut not like this. Not as an imperial puppet.\n\nHe was a knight of Gauss, not the Saharan Empire. Why should he answer to them?\n\n\"Well?\" Goldhit's frown deepened as the commander remained silent. Killing intent flooded the air. The Blue Flame Knights struggled to breathe.\n\nGoldhit and the Black Knight captain pressed down on them with pure presence. This was *their* territory, after all.\n\nThe knight commander stared at Goldhit's small feet for a long moment, then lowered his head.\n\n\"...No objection. We'll eliminate the enemy.\"\n\nResistance was futile. The empire had paid two hundred gold crowns for operational control of the Blue Flame Knights. The arrangement was clear.\n\n*We fight for Gauss's interests. Not the empire's.*\n\nThe commander made his peace with it. Goldhit grinned and sent them through with a pulse of magic.\n\n\"They're going to die anyway.\"\n\nThe Overgeared nobles and soldiers holed up in that village would be crushed. Soon, the evil eyes' king would fall, and the vast repository of demonkin knowledge would belong to the empire.\n\nTo study the eyes of a *living* specimen...\n\n\"Kukuku...\"\n\nGoldhit was practically giddy. The suffering of the past month had been worthwhile.\n\n\"The Overgeared King has arrived.\"\n\nA Black Knight entered the barracks with the report, his tone bland. No urgency whatsoever. Why would there be? The Overgeared King wasn't an enemy—not currently. And even if he tried something, there were two Black Knights and the Magician King herself present.\n\n\"Hmm...\" Goldhit rose and made her way to the village entrance.\n\nA black-haired man stood waiting, arms folded. The silver crown on his head proclaimed his royal status—a pathetic affectation, in Goldhit's estimation.\n\n\"It's been a while,\" she greeted him.\n\nGrid's expression was thunderous.\n\n\"Still kidnapping children and raising them like livestock, I see.\"\n\n\"What's the difference between livestock and children?\"\n\n\"...Excuse me?\"\n\n\"Both are powerless. Both exist to be consumed.\"\n\nGoldhit glanced downward—toward the underground village where the Overgeared Kingdom struggled. *You're pigs, too.*\n\n\"Don't waste my time. Go home. How can a king abandon his throne so frequently?\"\n\nIn truth, Goldhit had once been interested in Grid. Fascinated by living legends. Something close to admiration, perhaps. Not anymore. Her grudge against him for stealing the thunder stone ran deep.\n\nShe turned to leave, dismissing him—\n\nThen froze.\n\nMagic power saturated the air. She looked up sharply. A storm was gathering overhead.\n\n\"There are nearly three months remaining in our truce agreement,\" Goldhit said carefully, her previous contempt replaced by wariness. \"Overgeared King, you cannot attack us. You understand better than anyone that you cannot violate the system's causality. It isn't worth the penalty.\"\n\nGrid was a player. He understood perfectly what she meant by 'causality'—the game's enforcement mechanisms.\n\nBut Grid also knew how to exploit the system.\n\n\"Is this the struggle of livestock?\" he asked mildly.\n\nRain began to fall.\n\n\"Storm Demonic Energy Field.\"\n\nThunder roared. Indiscriminate devastation swept through the soldiers blocking the entrance, empire and Overgeared alike caught in the blast.\n\n\"You *madman*!\" Goldhit shrieked, conjuring ten overlapping shields to protect herself.\n\nThe wrath of the Magician King—a sight few had witnessed and fewer still survived. The precursor to calamity itself.\n\nGrid was one of those few. Fighting energy surged through him as the Hero King met Goldhit's eyes without flinching.\n\n\"You don't have the right to stand in my way.\"\n\n\"...!\"\n\n*Someone who doesn't fear the Magician King?*\n\nThe Black Knights' expressions hardened. They hadn't anticipated this response. And the pressure radiating from the Overgeared King far exceeded their expectations."
}