{
  "id": 977,
  "title": "Chapter 976",
  "content": "**Chapter [X]**\n\n*He's insane.*\n\nThe fundamental flaw in large-scale attack magic was simple: it couldn't discriminate. Friendly fire was inevitable nine times out of ten. Yet here stood the Overgeared King, summoning lightning across a two-hundred-meter radius while his own soldiers stood within range. It was a blatant declaration of war.\n\nAnd he was striking his own troops.\n\nGoldhit's orb trembled. The magic felt *familiar*—magnetism rippling through the air, distorting her concentration. Thunder crashed through her ears, fragmenting the spell she'd been weaving. She threw up a shield at the last second.\n\nThe lightning struck.\n\n*...That's it?*\n\nHer confusion deepened. Grid's magic was *wrong*. The magnetism alone proved it transcended ordinary spells—slowing her casting, disrupting her control. But the raw power behind it was pathetic. She'd layered ten shields. Two would've been enough.\n\nShe'd known Grid possessed Braham's soul. Which meant—\n\n*He hasn't mastered the enhanced magic yet.* That had to be it. *Or he's afraid of the Empire. Killing their soldiers would be crossing a line he can't uncross.*\n\nShe needed to test him. Push harder.\n\n\"Overgeared King!\" Goldhit called out, keeping her voice steady. \"You violated the agreement first!\"\n\nA legend. A king. She couldn't afford condescension, even if the man was clearly a scheming bastard. To gauge his true strength, she'd have to drive him to the edge.\n\nThe ground trembled as she chanted. Her earthquake spell would split the earth beneath the Overgeared soldiers, swallow them whole—\n\nGrid scoffed.\n\nHer spell *dissolved*.\n\n*What—*\n\nHigher knowledge. He'd dissected her spell mid-cast and *negated* it at the source. Her teacher's words echoed in her mind:\n\n*\"My master was omnipotent. He grasped the structure of any spell and severed it before activation. Every magician save Mumud was helpless before him. That was why they feared the Duke of Wisdom.\"*\n\nThe Duke of Wisdom.\n\nPure knowledge, wielded like a blade. Achieving the power of a hundred with the cost of one. She'd dismissed it as mythology. Exaggeration. Impossible.\n\nGrid had just proven her wrong.\n\n*This power is real—*\n\nLightning struck her crown.\n\nTen thousand damage. The attribute bypassed magic resistance entirely, though the raw strength remained disappointingly weak. Still—even a needle could pierce stone given enough repetition.\n\nTwelve strikes. All to the head. The lightning fell randomly across the two-hundred-meter radius, yet somehow each bolt sought *her* with unsettling precision.\n\n*He has complete control.*\n\nLarge-scale magic couldn't distinguish targets because control at that range was impossible. Grid controlled every bolt across two hundred meters.\n\n*This is the Duke of Wisdom's true strength.*\n\nThe storm faded. No more lightning fell, but her body still trembled from residual shocks.\n\n*\"Your talent is unmatched. A genius born once a century. You will become the world's greatest magician.\"*\n\nHer master's praise scattered like ash.\n\n*\"All magicians honor you as their king.\"*\n\n*\"Of course. I am supreme among our kind.\"*\n\nHeat flooded her face. Shame. She'd called herself *supreme*.\n\n\"Eek...!\"\n\nPetty emotions. Worthless. She glared at Grid—\n\nThen stopped.\n\nFear.\n\nShe couldn't bear whatever contempt waited in his eyes.\n\n*Better to retreat.*\n\nA new truth crystallized: *Goldhit cannot defeat Grid.*\n\nShe stood frozen, a mouse before a serpent, sweat coating her skin. To obtain enhanced magic, she'd need to revise everything—her approach, her attitude toward this man. But there was hope. From their first meeting, she'd expressed favor toward him. She could build on that foundation.\n\n\"E-Enter.\" She opened the path immediately.\n\nGrid's gaze remained fixed on the ground.\n\n***\n\n\"...\"\n\nFor over twenty days, the Overgeared members trapped in the evil eyes' village had concealed their situation. They'd feared Grid would lose focus on his smithing if he knew. At first, they'd maintained control.\n\nGrid never noticed.\n\nBut when Reidan's reinforcements moved, reports reached him. First from Piaro, who'd recognized the crisis. Then Mercedes delivered further details.\n\nNone of it had shaken him. He'd remained immersed in his work—the task before him, the wish of his comrades. He trusted them. He'd never doubted the strength of his ten meritorious retainers, his Overgeared members.\n\nThen he arrived at Lepio Village and understood.\n\nThis was worse than he'd thought.\n\nReidan's troops, sent ten days ago, still couldn't breach the village perimeter. Fury ignited in Grid's chest. The sight of Goldhit's face stoked it higher. His killing intent surged—strong enough that his hand twitched toward his weapon.\n\nBut the system recognized her as an 'ally.' All he could deploy was Storm Demonic Energy Field.\n\nPerhaps his luck stat helped. The storm vented some of his rage.\n\n**[The target has received 10,000 damage.]**\n\n**[The target has received 10,000—]**\n\n**[The target has received 10,000—]**\n\n**[You have analyzed the target's spell with Duke of Wisdom's authority! The target's spell has been destroyed!]**\n\nThe random lightning found Goldhit again and again. The Duke of Wisdom's power sealed her magic. Whatever flaw existed in the body she currently inhabited forced her retreat.\n\n\"E-Enter.\"\n\n\"...Tsk.\"\n\nGrid didn't want to look at her again. But he couldn't waste time. The imperial soldiers struck by lightning had survived—heavy armor and quality items sparing them serious injury. He moved through their nervous ranks and glanced at his forces.\n\n\"Let's go.\"\n\n\"Yes!\" The Overgeared soldiers fell in behind him. The imperial troops didn't block their path. With Commander Goldhit opening the way, the knights and soldiers had no authority to intervene.\n\n\"Is it acceptable?\" the Black Knight asked quietly.\n\nGoldhit nodded. \"The Grandmaster will stop him.\"\n\nHe was watching. Soon he'd arrive with the White Dragon's Eyes.\n\nEven with Grid's presence, the evil eyes' king was destined to die.\n\n***\n\n\"Charge!\"\n\n\"This is our land! These demonkin have fed off our territory like parasites—and the Overgeared Kingdom shields them! We have justice on our side!\"\n\nThe Blue Flame Knights materialized inside the village, teleported like the invaders before them. They intended to expel the demonkin and discipline the Overgeared Kingdom—their kingdom's primary enemy.\n\nThis was *their* territory. Enemies had no place here.\n\nBlue flames erupted along the knights' swords. Overgeared soldiers—armor shattered, flesh exposed—fell beneath the burning blades. Chests split open. Blood sprayed. Yet none of them broke.\n\nA soldier with a severed chest coughed blood and kept fighting. Another switched his sword to his off-hand when his dominant shoulder was cut. Those who lost legs *crawled* forward.\n\nThe Blue Flame Knights felt ice in their spines.\n\n\"These bastards—*urk*!\"\n\nBefore the knight could strike again at the soldier clinging to his leg like a zombie, an arrow punched through his throat. Silent. Lethal.\n\nThe signal.\n\nTheir formation collapsed.\n\nArrows emerged from darkness itself, never ceasing. The Blue Flame Knights' vanguard crumbled. Overgeared soldiers clambered over corpses, mounted their enemies' chests, and drove swords down like rabid animals.\n\n\"Were they trained by Jude?\" someone muttered.\n\nJishuka stood behind her soldiers, bow drawn. Her blazing red hair caught the firelight. Her tanned skin gleamed with sweat. Beautiful in the darkness, deadly as she released another arrow.\n\n\"Damn.\" She exhaled slowly. \"If you won't run, neither can I.\"\n\nThirteen arrows left. She'd planned to conserve them for self-defense until reinforcements arrived. But her soldiers refused to flee. They fought to the last breath.\n\nShe couldn't abandon them.\n\n\"...We go back together.\"\n\nShe nocked another arrow. The shaft vanished mid-flight, reappearing buried in an enemy's heart. At the same moment—\n\n**[Critical Hit!]**\n\n**[Weak Point Successfully Struck!]**\n\n**[Total Weak Point Kills: 10,000,000!]**\n\n**[An achievement worthy of legend!]**\n\n**[Advanced Bow Mastery has evolved into Sure Death Bow Mastery!]**\n\n\"Huh?\"\n\n*Only ten million?*\n\nFortunate no one could read her thoughts. Then the notifications continued.\n\n**[A holy voice whispers in your ear.]**\n\n*—You...World Tree...Aura...*\n\n**[★Hidden Class Quest★ Povia's Descendant has appeared!]**\n\n\"...!\"\n\nPovia. The legendary elf archer. The greatest archer the world had ever known. Becoming her descendant meant inheriting a legend—\n\nJishuka had met the requirements without even trying. But—\n\n**[Do you accept this quest?]**\n\n\"What if I don't?\"\n\n*—...*\n\n**[Do you truly wish to reject this quest?]**\n\n\"Yes.\"\n\n**[Quest rejected.]**\n\nThe choice shocked no one more than the system itself. Yet for Jishuka, it was natural. She'd been called a godly archer for years.\n\n\"I'm going to *surpass* Povia. Why the hell would I become her descendant?\"\n\nShe smiled.\n\nAn ordinary person would never understand. But that was the confidence of a genius.\n\nHer unexpected choice triggered something new.\n\n**[You have qualified for the hidden class 'Bow Sage.' A class change quest will be issued.]**\n\n\"Heh.\"\n\nWarriors grew through battle. These past weeks of hell had forged a stepping stone to greatness.\n\nJishuka grinned and swept the battlefield with Hawk Eyes. Overgeared members fought across every front. All of them were breaking their limits in these extreme circumstances.\n\n\"I'll make sure we collect the proper price.\"\n\nThe Overgeared Guild was no longer a one-man show. \n\nAn arrow formed from pure magic power punched through a Blue Flame Knight's throat. The remaining knights stared, astonished, at the god who loosed arrows without touching her quiver."
}