{
  "id": 978,
  "title": "Chapter 977",
  "content": "**Chapter Text - Rewritten**\n\n\"What's your relationship with her?\" Sage Sticks asked, his eyes fixed on the distant figure of Magician King Goldhit.\n\nGrid stiffened. \"Relationship? We're enemies. She wants to kill me, I want to kill her—standard stuff.\"\n\nA knowing smile played at Sticks' lips. \"Then why does she look at you like *that*?\"\n\n\"Like what? She's injured, isn't she?\"\n\n\"The Magician King's mana regeneration exceeds even that of elves blessed by the World Tree. She was recovering in real-time throughout your entire confrontation. If she'd wanted to continue, she could have.\"\n\nGrid blinked. \"Wait—I thought Mercedes said magicians had weak constitutions?\"\n\n\"Goldhit is an exception to many rules.\"\n\n\"Sticks... you're not actually intimidated by her, are you?\"\n\nThe sage laughed, though it sounded slightly strained. \"Her magical prowess far exceeds mine, Your Majesty. I'm a scholar first, a spellcaster second.\"\n\n\"Don't sell yourself short. You can wield elemental magic—that's no small feat.\"\n\n\"Basic techniques I picked up while pursuing knowledge. Hardly worth mentioning before the continent's greatest living mage.\"\n\n*Oh no. Not again.*\n\nThe pieces fell into place. Goldhit's spell had failed purely because Duke of Wisdom triggered at the perfect moment. Through sheer dumb luck, Grid had appeared to effortlessly counter the Magician King, leading her to wildly overestimate his magical capabilities. It was the kind of absurd misunderstanding that plagued mediocre fiction—yet Grid's life seemed determined to imitate precisely that.\n\n*But you know what? I'll take it.*\n\nAfter years of suffering under catastrophic bad luck, this felt like justice. The scales were finally balancing.\n\n*This is character development!* Grid told himself with only moderate delusion. *The protagonist always gets a power-up arc!*\n\nHis mood considerably improved, Grid approached the fountain at the village entrance. A grotesque cherub statue spat water from its... lower anatomy. The evil eyes had previously manipulated specific parts of the statue to reveal the hidden entrance.\n\n\"Now, which parts did they twist...? I should message Lauel—\"\n\n\"Allow me.\"\n\nSticks had spent considerable time conversing with the Destiny Guardians, his scholar's curiosity driving him to learn everything he could about the reclusive evil eyes species. His hands moved with practiced precision across the statue, and reality *tore*—a shimmering portal blooming in the air.\n\n\"Hmm. The degradation is worse than I expected.\"\n\n\"What do you mean, degradation?\"\n\nGrid caught the way Sticks' expression tightened. The curse. \"Wait, Sticks, you're not—you're okay, right?\"\n\n\"...\" The high elf turned a flat stare on him. \"I meant the *portal's* lifespan, Your Majesty. Not mine.\"\n\n\"Portals have lifespans?\"\n\n\"Everything does. Especially constructs built from raw mana—they're inherently unstable. This one's suffered external interference as well.\"\n\n\"What kind of interference?\"\n\n\"Goldhit's work, unless I'm mistaken. She's woven some incredibly complex spell into its foundation. The alterations have accelerated its decay dramatically.\" Sticks frowned. \"At this rate, it'll collapse within the year.\"\n\n\"And if it collapses?\"\n\n\"The evil eyes will be permanently cut off from the surface world.\"\n\n\"Can you rebuild it?\"\n\n\"Not one of this caliber. Only the ancient giants possessed that knowledge, and they vanished centuries ago.\"\n\n\"Then the evil eyes need to relocate anyway.\" Grid nodded decisively. \"We'll bring them to the Overgeared Kingdom.\"\n\n\"I was hoping you'd say that.\" Genuine enthusiasm crept into Sticks' voice. \"Their library contains knowledge I've sought for decades. You have my full support.\"\n\nTogether with the former Giant Guild members and two thousand soldiers, they stepped through the failing portal.\n\nWhat greeted them turned Grid's blood to ice.\n\n---\n\nThe village entrance was a war zone.\n\nOvergeared soldiers blocked the gates—or rather, what remained of them. Armor hung in shreds. Crude bandages barely covered wounds that should have killed. These men had been fighting for *weeks* without reprieve, ground down to their very souls.\n\nYet they stood unbroken.\n\nTheir eyes held the cold clarity of tempered steel. Across from them, enemy soldiers clad in pristine plate armor and expensive silk cowered like beaten dogs. They had superior equipment, fresh bodies, greater numbers—but their spirits had shattered.\n\n*What the hell happened here?*\n\nBeyond the standoff, movement caught Grid's eye.\n\nA woman with raven-black hair drove her blade through a knight's belly. Before he could scream, she pressed a gun to his forehead.\n\n\"M-mercy—*please*—\"\n\n*BANG.*\n\nHis head exploded in a spray of crimson.\n\n\"**RAAAHHH!**\"\n\nThe Overgeared soldiers roared, a sound more beast than human, shaking the very ground.\n\nThe enemy line crumbled backward.\n\nThe woman turned, blood painting her porcelain features, and *smiled*—radiant as dawn breaking over a massacre.\n\n\"Oh! You're back.\"\n\n\"Y-Yura.\" Grid's voice cracked slightly. \"You've been... busy.\"\n\nHe'd watched her fight before, but this was different. Her sword vanished mid-swing through a spatial tear—Hell Leap—and reappeared behind her opponent, piercing his spine before he realized death had come. Her movements defied prediction, flowing through impossible angles.\n\n*I couldn't block that. Not even close.*\n\nA treacherous thought crept in: *If we got married and had a domestic dispute...*\n\nGrid shuddered. Yura's combat instincts would absolutely translate to real-world brawls. He'd witnessed it firsthand with other rankers.\n\n*Note to self: never make Yura angry.*\n\n---\n\nThe Empire had divided the evil eyes village into sixteen strategic points: the eastern and western entrances, the central library, the eight major roads connecting entrance to library, the king's castle, and the four castle approaches. Each point had been assigned Imperial strike teams.\n\nThe Blue Flame Knights had deployed their elite forces to the library and castle gates.\n\n\"Short break's over.\"\n\nPeak Sword cracked his neck. Beside him, Vantner rolled his shoulders with a grunt. Both men slowly rose to their feet.\n\nThirty knights faced them.\n\nFull plate armor of masterwork quality. Yellow cloaks bearing noble insignia. Silver longswords with crossguards that screamed *expensive*. This wasn't the usual rabble—these were retainers of major nobility, possibly even royalty.\n\n\"Well. Shit.\" Peak Sword exhaled slowly. \"They're bringing out the big guns.\"\n\nFor a month, they'd held this position against relentless assault. They'd bled, killed, and survived through grit and desperation. But these knights radiated danger on an entirely different level.\n\n\"Stay sharp,\" Vantner rumbled, raising his shield. \"One mistake and they're through.\"\n\nBehind the knight formation stood their commander—a young man with his helmet off, showcasing flowing hair and aristocratic features. His nameplate glowed silver.\n\n**[Apollo]**\n\nQuasi-named NPC.\n\n\"Level 400 minimum.\" Peak Sword grimaced. \"At least twenty levels above me. And quasi-named NPCs have inflated stats.\"\n\nEven working together, he and Vantner would struggle. And Apollo had brought thirty veteran knights as backup.\n\n\"Soldiers! Fall back into the castle!\" Peak Sword barked. \"The evil eyes will give you orders—follow them!\"\n\n\"**We refuse, my lord!**\"\n\n\"We won't abandon the Marquis!\"\n\n\"You and Earl Vantner retreat—we'll buy time with our lives!\"\n\nThe soldiers' eyes burned with genuine devotion. For a month, they'd fought alongside Peak Sword and Vantner, watched them bleed and sacrifice for every inch of ground. That loyalty ran bone-deep now.\n\nPeak Sword's expression darkened. \"Get. Out. You're *limiting* what he can do if you stay.\"\n\n\"...Him?\"\n\n*CLANG. CLANG. CLANG.*\n\nThe sword at Peak Sword's waist rattled violently in its sheath.\n\n*—You absolute MORON. Summon me already! SHIT. Following you is ruining my reputation—*\n\n\"...\"\n\nOver three years and two months, Iyarugt's soul had strengthened enough to manifest speech without being drawn. Unfortunately, proximity to Peak Sword and Vantner had... altered his vocabulary. Hell's legendary swordsman now sounded like a street thug.\n\n*At least Huroi isn't here,* Peak Sword thought with genuine horror. That man could corrupt a saint. *Iyarugt would be dropping slurs within a week.*\n\n\"Alright, alright.\" Peak Sword grasped the hilt. \"Let's go.\"\n\nHe drew the blade.\n\nCrimson metal sang free, beautiful and terrible.\n\n*—Listen up, brat. This sword's just a vessel for my soul. If it breaks, I don't know what happens—maybe I go free, maybe I disintegrate. So DON'T. BE. STUPID.*\n\nDespite the harsh words, genuine concern resonated through the soul-link.\n\nPeak Sword smiled. \"Don't worry. I'll never let you break.\"\n\nAcross the courtyard, Apollo's eyes widened—then narrowed with avarice.\n\n\"What a magnificent blade. Far too beautiful for trash like you.\" His voice dripped poisonous courtesy. \"I'll be taking that.\"\n\nPeak Sword snorted. \"Pfft.\"\n\n\"Something funny?\"\n\nApollo released his aura—a suffocating pressure meant to crush lesser men.\n\nPeak Sword didn't even blink. He'd defeated the Hero himself at the National Competition. A quasi-named NPC wasn't going to intimidate him.\n\n\"Why am I laughing? Because you're a *dog* barking at the moon.\" Peak Sword's grin turned vicious. \"You want this sword? You can't even comprehend what it *is*, and you think you're worthy? Sit. Down.\"\n\n\"...You'll regret those words.\"\n\n\"Nah. But you will. **Iyarugt—MANIFEST!**\"\n\nThe blade erupted with bloody radiance.\n\nApollo and his knights recoiled as the aura solidified, condensing from mist to form. Vantner grabbed the soldiers and hauled them backward, eyes wide.\n\nA figure took shape.\n\nAn elderly man, spine bent with age, wrapped in crimson flames. A horn jutted from his forehead—proof of his demonic heritage. The legendary Sword Demon of Hell. Great Demon Zepar's only equal. The blade that had ended a thousand masters.\n\n\"Took you long enough, you little shit.\"\n\nIyarugt's aged form blurred forward, sword already in motion.\n\n\"—!?\"\n\nApollo's eyes barely registered the attack. His knights didn't even manage that.\n\nThe blade traced a perfect arc—*Full Moon.*\n\nSteel screamed. Bodies separated at the waist. Blood fountained toward the sky in grotesque symmetry.\n\nSeven knights died before they understood death had come.\n\n\"Hmm. A few decent ones in the batch.\" Iyarugt licked blood from his sword, crimson eyes locking onto Apollo. \"You'll last longer than three seconds. Maybe even five.\"\n\nThroughout his imprisonment with Peak Sword, Iyarugt had achieved five \"limit breaks\"—transcendent moments that pushed soul-bound entities beyond their constraints. He'd recovered nearly half his original power. The manifestation wouldn't last long in this weakened state, but for these *small fry*?\n\nMore than enough.\n\n\"**Sublime Sword.**\"\n\nHis blade pierced reality itself, aiming for the one point that would end Apollo's story."
}