{
  "id": 979,
  "title": "Chapter 978",
  "content": "Like certain pets—elementals, for instance—Iyarugt possessed no concept of leveling. But this wasn't a limitation. The demon sword grew by reclaiming what he'd lost.\n\n[* By defeating powerful opponents, he regains fragments of his former strength. Victory by victory, skill by skill. (5/10)]\n\nThe notation in Iyarugt's status window was clear. Each named boss he felled pushed back the boundaries of his seal. At present, his Sublime Sword technique delivered four times the force of Peak Sword's Annihilate—approaching the devastating threshold of Linked Kill Wave Pinnacle.\n\nApollo's shield caught the strike, but the impact tore through his guard. His left arm, shield and all, tumbled through the air.\n\n\"Captain!\" The knights' horrified shouts rang across the battlefield.\n\nApollo triggered Hit a Pressure Point—a fourth advancement emergency skill—to stem the arterial spray. Through gritted teeth, he demanded, \"Explain this. The evil eyes were *banished* from hell. Why does a demonkin fight for them?\"\n\nIyarugt had no interest in philosophy. Only the refinement of his blade mattered. He didn't explain himself to anyone.\n\n\"Irrelevant.\"\n\n\"...\"\n\nThe temperature dropped. Before Apollo could respond, Peak Sword's voice cut through the tension from behind Iyarugt.\n\n\"How about examining your own actions first?\" Peak Sword's accusation carried across the plaza. \"You invaded their home! You've terrorized innocent people and shattered their peace! You're the barbarians here!\"\n\nApollo's expression tightened. \"Then we failed to introduce ourselves properly. We are the Blue Flame Knights, sworn to the Gauss royal family. This territory falls under our kingdom's jurisdiction. We have both the right and the *duty* to secure our borders. The evil eyes are the invaders—not us.\"\n\n\"Gauss Kingdom? But—\" Peak Sword faltered. \"The evil eyes haven't harmed your people!\"\n\n\"Can you guarantee that?\" Apollo's voice remained level despite his injury. \"They're demonkin. Exiled from hell itself. And before we debate their nature, consider the fundamental security concern. If you discovered an armed force living beneath your Overgeared Kingdom... would you simply allow it?\"\n\nPeak Sword's face fell. He had no counterargument. The scenario was too clear—imagine a foreign army tunneling beneath South Korean soil. Intolerable.\n\n\"I... I understand your position,\" Peak Sword admitted, shoulders sagging. \"Technically, you're the aggrieved party here...\"\n\nHis honesty lasted all of three seconds.\n\n\"Screw it! Gauss Kingdom's our enemy anyway! We're wiping you out!\"\n\nSometimes ignorance was the better part of valor. Peak Sword drew his new blade—a longsword Grid had forged from Belial's Horn, marginally superior even to Iyarugt in raw specifications.\n\n\"Iyarugt! Exterminate them!\"\n\nThe demon sword became a streak of crimson light. Peak Sword, meanwhile, adopted his Draw Sword stance.\n\n\"Hell Moon Cut.\"\n\nIyarugt carved through the front line in a single pass, then pivoted to face the encircling knights.\n\n\"Annihilate.\"\n\nPeak Sword's sweeping arc caught everyone surrounding Iyarugt. It was reckless, overwhelming aggression—and it forced Apollo's hand. Blue flame erupted along his blade's edge, condensing into sword energy that resembled liquid fire.\n\n\"My fire protects the realm!\"\n\nThe wave of force crashed forward. Peak Sword, locked in his Draw Sword recovery, couldn't dodge. Vantner charged into the gap, shield raised—\n\nThe impact shattered the air. Vantner's boots carved trenches in the stone as he absorbed Apollo's strike. *Completely different league,* he thought, arms screaming. Fourth advancement opponents were simply beyond them at this stage.\n\nIf a third advancement class could dominate a second advancement player, what did that make someone at the fourth threshold?\n\nApollo's stats had plummeted after losing an arm, yet his damage output still exceeded their defensive limits.\n\nInternal injuries flaring, blood on his lips, Peak Sword shouted, \"Iyarugt! Take that guy out already!\"\n\n\"You're not my master. Shut up.\"\n\nDespite the rebuke, the demon sword engaged Apollo directly. He recognized the threat—if Apollo remained active, Peak Sword would fall.\n\nDemonkin swordsmanship diverged fundamentally from human schools.\n\nIyarugt's blade work was a dazzling storm powered by inhuman vitality and physical superiority, suppressing Apollo through sheer overwhelming force.\n\nApollo saw the openings—one, two deliberate gaps in Iyarugt's guard—but didn't commit. His instincts screamed *trap*. Those apparent weaknesses would transform into lethal counters the moment he overextended. With both arms, he might have seized those opportunities. Now? His misjudgment on that first exchange was proving fatal.\n\n\"Yes! Keep it up!\"\n\n\"Push him, Iyarugt!\"\n\nPeak Sword and Vantner cheerfully stayed out of the duel. They were battered, bleeding, and would only provide openings. Fewer than ten Blue Flame Knights remained, and the two Overgeared members vented their stress through enthusiastic shouting.\n\n\"You BASTARDS!\"\n\nThe surviving knights seethed. These two cowards were *hiding behind the demon* while cheering like spectators.\n\n\"We'll handle *you* personally!\" Blue flames ignited along four blades simultaneously. Years of synchronized training produced coordination that approached artistry.\n\n\"Gah!\" Two swords pierced Peak Sword's left side while he blocked the other pair. Two more came from the right—he'd die if he didn't react perfectly. Pride forgotten, Peak Sword threw himself into a roll, barely escaping the converging attacks.\n\nAs he scrambled across blood-slicked stone, his thoughts turned to Grid. *I can barely manage four opponents. Grid fought FOUR HUNDRED. How? Just... how is he so absurdly strong?*\n\n'Too cool!' Even on death's threshold, Peak Sword's admiration was boundless. \"God Grid is the beeeeeest!\"\n\n'He's lost it again.' Vantner shook his head, using a sword he'd picked up to supplement his failing shield. His actual shield was down to critical durability, the metal cracked and warped. \"...!?\"\n\nThe Blue Flame Knights weren't merely skilled—they were *royal* knights. Their swordsmanship featured no wasted motion, no exploitable patterns. Their strikes hit hard enough to threaten even Vantner's enhanced defenses.\n\nThe inevitable occurred. Four blazing swords converged. Vantner's battered shield exploded into fragments.\n\n\"Ah, hell! I'm done!\" Vantner went down, a blade buried in his gut.\n\nPeak Sword couldn't help—he was in identical straits, already perforated several times.\n\n\"Oh, come on! You're the tanker! You're supposed to protect *me*! I should outlive you!\"\n\n\"...\"\n\nThe 10 Meritorious Retainers of the Overgeared Kingdom. Living legends. The soldiers had expected an inspiring display of martial excellence.\n\nThis was decidedly not that.\n\n\"We're joining the fight!\"\n\n\"Move out!\"\n\nThe soldiers, restrained until now by Vantner's orders, surged forward. They'd reached their limit. If their commanders fell here, their sacrifice meant nothing. The soldiers knew they might die—but they'd trained alongside these men for over a month. They weren't abandoning them now.\n\n\"Wait—no! Fall back!\" Peak Sword gasped, the soldiers' intervention buying him momentary breathing room. He coughed blood, waving them off desperately. \"We can resurrect! You only have one life! Stop!\"\n\n\"Don't be stupid!\" Vantner roared, using his shoulder as a battering ram to create space, protecting soldiers from the knights' riposte. He glared at the sealed gates above them. \"Damn it! Even now those evil eyes won't—\"\n\nIf there was ever a time to open the gates and provide support, it was *now*. But the evil eyes did nothing.\n\n'We're dying for these people. And they won't lift a finger.'\n\nThe weight of futility crushed their morale. Every sacrifice suddenly felt hollow.\n\nThen a flower bloomed on the battlefield. A red blossom, sprouting from a Blue Flame Knight's chest.\n\n\"...?\"\n\nThe knight stared down in confusion. Blood poured from his nose. He tried to scream—couldn't—and collapsed. The flower wilted instantly, petals scattering. Each petal dissolved into blood, soaking the ground crimson. The beautiful bloom had never been a flower at all, but arterial spray erupting from a punctured heart.\n\n\"What—?!\"\n\nWho struck without warning? Who'd entered the battle? Knights and soldiers alike spun, searching for the phantom assailant.\n\n\"...Hah. We're alive.\" \n\nPeak Sword and Vantner shared exhausted grins. They recognized this signature.\n\nThe shadow who guarded the Overgeared Kingdom—Death God Faker.\n\nAnother knight crumpled, a second red flower blooming from his spine.\n\n'Where IS he?'\n\nPanic rippled through the Blue Flame Knights. They focused, desperate, scanning every shadow, every angle. Useless. Faker had invoked Lantier's ultimate technique—a state of perfect stealth and fluid mobility that transcended visual tracking.\n\n*Thump. Thump. Thump.*\n\nOnly heartbeats filled the air now. Silence reigned as, one by one, the remaining Blue Flame Knights died without ever seeing their killer.\n\n\"...Gotta admit, he's got style,\" Peak Sword muttered, sitting heavily.\n\n\"Too much style. Makes me sick,\" Vantner agreed, collapsing beside him.\n\nThey turned their attention to Iyarugt's duel.\n\nThe demon sword and Apollo had ranged across half the plaza, their exchange of blows carrying them far from the gates. Then a black blade fell between them like a thunderbolt.\n\nFaker.\n\nThe momentary distraction shattered Apollo's precarious balance. Any hope of reversing the duel evaporated. Within seconds, the Blue Flame Knight Captain fell.\n\nComplete victory. Against all odds, Peak Sword and Vantner's forces had survived with fewer casualties than anticipated.\n\nGrid arrived shortly after, surveying the exhausted survivors with evident relief.\n\n\"You've earned your rest. We'll handle things from here.\"\n\n\"Go. You've all fought hard enough.\"\n\n\"Hehe... logging out...\"\n\n\"King Grid!\" The soldiers erupted into cheers. Their reinforcements—their king—had arrived with a full army at his back.\n\n\"I won't forget what you've done here.\" Grid's gaze swept across the survivors, cataloging faces, noting injuries. These soldiers would be rewarded accordingly.\n\n\"Your Majesty.\" Sticks approached, face troubled. \"I sense powerful magic within the castle.\"\n\n\"The castle?\" Grid followed his gesture toward the sealed gates. No signs of forced entry. \"You mean the evil eyes' king?\"\n\n\"I can feel him, yes. But there's another presence—as strong as the king... no, *several times stronger.*\" \n\nSticks, who'd remained composed even facing Magician King Goldhit, couldn't keep the tremor from his voice. \"Someone's breached the inner sanctum.\"\n\nSomeone more powerful than their host.\n\n\"No—\" Grid's blood went cold. \"Open the gates! Now!\"\n\nHe charged through the entrance, soldiers streaming behind him. Blood marked the corridor leading to the throne room—trails and smears originating from where the evil eyes' ministers had stationed themselves. The implication was unmistakable.\n\n\"Damn it!\"\n\nThe king was in danger. Dread clawed at Grid's chest as he sprinted through the passages. He burst into the great hall—\n\n[You have encountered someone who transcended time itself.]\n\nA slender figure held the evil eyes' king in an effortless grip. Beautiful features, wearing exhaustion like a second skin.\n\n\"The one who advances his own fate,\" the figure mused, studying Grid with detached curiosity.\n\nZikfrector. The Grandmaster.\n\n\"Hmm. For convenience's sake... I'll eliminate you, Overgeared King.\"\n\n[Unknown survival instinct activated! Fighting energy charged to maximum!]\n\n\"Release him!\" Grid fused Blade Aiming at the Gods with his Enlightenment Sword, channeling everything into 100,000 Army Massacre Sword. Dozens of crimson energy blades screamed toward the Grandmaster.\n\nZikfrector lifted the evil eyes' king like a shield. The barrage struck harmlessly.\n\n\"Death holds no dominion over me,\" the Grandmaster said, tone flat. \"Though that doesn't render me invulnerable. You'll die regardless.\" \n\nHe produced a white mirror, fingers moving to untie the band covering the king's eyes—\n\n\"Mass Teleport!\"\n\nReality folded. Sticks' spell deposited Grid directly beside the captive king. Grid's hand moved on pure instinct, pressing the Ether Glasses—easily transferable accessories crafted by Elizabeth—onto the king's face.\n\n\"...?\"\n\nThe Grandmaster's fatigue visibly deepened."
}