{
  "id": 98,
  "title": "Chapter 98",
  "content": "# Chapter 98\n\n\"A skill that permanently improves item performance?\" Jishuka's eyes gleamed with curiosity. She leaned forward slightly. \"I've never heard of such a thing.\"\n\nThe archer was fishing for details. Her gaze locked onto Grid with an intensity that made his palms sweat.\n\n*She won't be able to sleep tonight if I don't tell her.*\n\nGrid shifted his weight. He had no real reason to keep it secret. More importantly, he wasn't the type to make a woman lose sleep over something like this. He wiped his hands on his pants.\n\n\"The appraisal skill. My appraisal skill can discover hidden features in items.\"\n\nA wave of murmurs rippled through the smithy.\n\n\"Just an appraisal skill?\" Someone's voice cracked with disbelief. \"I can't believe it.\"\n\n\"I didn't even know items had hidden features.\" Another guild member shook his head. \"This is incredible.\"\n\nVantner hefted his transformed axes. \"If Grid appraises my sword, will it improve like these babies?\"\n\nThe top rankers buzzed with excitement. Grid watched them, a rare sensation building in his chest. It felt strange and intoxicating that these high-level players were shaking over someone who hadn't even hit level 100.\n\n*Even if they're top rankers, they've never met a legendary class before.*\n\nThe thought settled in his mind like warm honey. *I'm the only legendary class right now!*\n\nThat rare sense of superiority lasted exactly three seconds before Jishuka cut to the heart of the matter.\n\n\"Do hidden features exist in all items?\"\n\nGrid shook his head. \"No. Items with hidden features are extremely rare.\" He paused, letting the silence stretch. \"But who knows? There might be hidden features in the equipment you're wearing right now.\"\n\n\"Can you appraise all our items?\" Jishuka's cheeks flushed slightly as she asked.\n\nThe color in her face made her look even more striking. Grid's pulse quickened.\n\n*Kuk! I won't! I can't lose my heart to a woman again!*\n\nWomen were enemies. Women were enemies. Women were enemies.\n\nHe repeated the mantra internally until his breathing steadied. Finally, he nodded.\n\n\"Of course I can appraise them.\" Grid's lips curved into a smile. \"That is, if there's money involved.\"\n\nThe smithy erupted.\n\n\"Please appraise my equipment!\"\n\n\"Me too!\"\n\n\"I'll pay whatever it costs!\"\n\nThe guild members surged forward. Not a single person asked about the price.\n\n*They don't even care about the cost.* Grid's mind raced. *Rankers really are loaded!*\n\nHe needed to set an appraisal price. The Eye of Pallalian came to mind. That was the most expensive appraisal item on the market.\n\n*It was around 14 or 15 gold, wasn't it?*\n\nThe Eye of Pallalian could appraise items of all ratings. Grid had used one on Pagma's Rare Book. But even that legendary appraisal item couldn't discover hidden features. His skill operated on a higher level entirely.\n\n*Should I charge 30 gold per appraisal?* He hesitated. *No, is that too expensive?*\n\n30 gold translated to roughly 36,000 won. Almost the price of two whole chickens.\n\nThen again, his appraisal skill had no penalties. It didn't require specific materials. It consumed no mana. He could use it infinitely. Each appraisal took less than a minute. If he charged 30 gold per item, would that seem greedy?\n\n*Money is always so vague.*\n\nHe understood now why blacksmiths invented the concept of repair tools. It justified the fees.\n\n*Should I commemorate joining the guild by offering free appraisals?*\n\nThe thought died as quickly as it formed. *I'm not planning to become a philanthropist.*\n\nIf money was on the table, he needed to grab it. He'd spent nearly two million won on that disastrous date with Ahyoung. Clothes, haircut, the meal. All of it wasted. He needed to recoup those losses somehow.\n\n\"One appraisal costs 30 gold!\" Grid's voice cut through the chatter. \"I'll appraise any item for 30 gold! If I find a hidden feature, you pay an additional 300 gold!\"\n\nHe didn't think it was expensive. So what if others did? The value of an item would skyrocket if a hidden feature emerged. Vantner's axes had probably increased in worth by several thousand gold at minimum. From that perspective, 30 gold was a bargain. The guild members understood this better than Grid himself.\n\n\"30 gold for appraisal and 300 if you find something?\" A warrior stroked his chin. \"That's pretty cheap, actually. Okay! Appraise all my equipment!\"\n\nThey formed a line in front of him.\n\nGrid stared at the queue. All he saw were walking sacks of money.\n\n*If I get 10 appraisal requests per person, I'll earn 4,500 gold from 15 people.* His breathing quickened. *Plus the bonuses when I find hidden features.*\n\n4,500 gold equaled roughly 5.4 million won. Two months of his old salary, earned in a single session. Tears pricked at the corners of his eyes.\n\n*I'm so happy!*\n\nThe wound Ahyoung had left on his heart felt warmer. Satisfy truly was his haven.\n\nMeanwhile, the guild members chatted amongst themselves as they waited in line.\n\n\"Isn't this basically a lottery?\"\n\n\"Kahahaha! I brought everything from my warehouse!\" Vantner slapped his thigh. \"The more items I appraise, the better my odds, right?\"\n\n\"That's brilliant.\" Someone snapped their fingers. \"I'll grab all my equipment from storage too!\"\n\nThe guild members started calling the discovery of hidden features \"winning.\"\n\n*Winning.* Grid savored the word. *I like it.*\n\nHe felt like a lottery ticket vendor. Time to start the appraisal business. But first...\n\n\"Khan.\" Grid turned to the elderly blacksmith. \"How much should Vantner pay for repairing his axes?\"\n\nKhan scratched his beard. \"At least 20 gold, considering the repair tools and time invested.\"\n\n\"How much do repair tools cost?\"\n\n\"50 silver.\"\n\n\"...\"\n\nGrid wheeled back to face the waiting guild members.\n\n\"When you leave an item for appraisal, let me repair it too! I'll restore any item to perfect condition!\" He gestured at Vantner's gleaming axes. \"You all saw what I did with these, right?\"\n\nThe appraisal and repair business commenced. Grid watched the tide of gold flow into his inventory.\n\n*This is more efficient than producing items.*\n\nOf course, crafting still had its merits. Permanent stat increases. Reputation gains. The jackpot possibility of creating something above unique rating. The appraisals and repairs would remain a side business. A very profitable side business.\n\n***\n\n\"The guild warehouse has plenty of mithril ore.\" Pon scanned the auction house listings. \"Let's see. Tipan wood and griffin tendons.\"\n\nPon and Regas stood together, searching for materials to craft the Gale Spear.\n\nRegas leaned against the auction counter. \"Pon, no matter how skilled Grid is, creating an epic item on the first try is difficult. We should secure enough materials for at least five spears.\"\n\nPon nodded slowly. \"The probability of an advanced blacksmith producing epic-rated items is about one in ten.\" He sighed. \"I'd like to gather materials for 10 spears, but Tipan wood and griffin tendons are expensive. I only have enough money for three attempts.\" He rubbed the back of his neck. \"I'd appreciate it if even one of the three turns out epic. Well, can't be helped if all three end up rare-rated. I'll have to live with it.\"\n\n\"Now that Grid's part of our family, you can request items anytime.\" Regas clapped his friend's shoulder. \"Don't stress about it. Still, it's a shame. If I had the money, I'd cover the material costs.\"\n\n\"Don't worry about it.\" Pon waved him off. \"How many times do I have to tell you to stop throwing money at people so easily? Anyway, the griffin tendons at the auction house are ridiculously overpriced. Think we could find a cheaper direct seller?\"\n\n\"Let's look together.\"\n\nThey left the auction house and began touring the market district, searching for merchants who might sell griffin tendons. Unfortunately, the material was too precious. No one had any in stock.\n\nPon stopped mid-stride. \"Winston's grown into a big city, but this is still...\"\n\nHis words died in his throat. A group of users wearing golden mace guild emblems appeared in the market square. Pon's hand drifted toward his weapon.\n\n\"Why are people from the Giant Guild here?\"\n\nThe Giant Guild was arguably the largest guild in Satisfy. Over 500 members with an average level of 130. Their guild master, Chris, ranked third on the unified rankings. Worse, Chris had recently been appointed lord of Pedro.\n\nRegas's perpetual smile faded. \"Wasn't Chris made lord of Pedro recently? Why are these guys in Winston instead of their territory?\"\n\n\"Yeah.\" Pon's jaw tightened. \"Pedro is south of here. Completely opposite direction.\"\n\nThe normally cheerful Regas grew tense. The Giant Guild was the Tzedakah Guild's greatest enemy. They'd been at each other's throats since the days of L.T.S.\n\n\"They came to Winston knowing we're here.\" Pon backed toward the auction house. \"They must have ulterior motives. We should avoid them for now.\"\n\nIn L.T.S, the Giant Guild hadn't posed much threat. But Satisfy was different. The Giant Guild had started playing from launch day, while Tzedakah joined nine months late. The gap in power hadn't closed yet. Direct confrontation would be suicide.\n\nPon returned to the auction house without finishing his market search. He grimaced as he purchased the overpriced griffin tendons.\n\n\"Those Giant Guild bastards just made my gold disappear.\"\n\nDespite his grumbling, Pon's mood improved when he imagined the Gale Spear Grid would craft for him.\n\nWhen they returned to Khan's smithy, both men froze.\n\n\"Yes! I wonnnnnn!!!\"\n\n\"Amazing! That's the third winner!\"\n\nThe guild members surrounded Grid in a chaotic circle, shouting and laughing.\n\nPon blinked. \"What are you doing?\"\n\nGrid sat in the center of the commotion, examining a mountain of equipment piled before him. He picked up a sword.\n\n\"This is a loss!\" He tossed it aside and grabbed a helmet. \"Loss as well!\" A shield. \"Another loss!\" Boots. \"Loss!\" Gauntlets. \"Loss!\"\n\n\"...\"\n\nPon and Regas exchanged bewildered glances. They had no idea what was happening.\n\nVantner noticed their confusion and swaggered over. He held out his transformed axes like trophies.\n\nPon's eyes widened. \"What is this? A bug? Is this a bug?\"\n\n\"Hehehehe.\" Vantner's grin stretched ear to ear. \"Grid has an appraisal skill that discovers hidden features in items. When he finds one, the item's performance shoots through the roof. Like my axes.\" He stroked the weapons lovingly. \"That's right. These beauties. Kukukuk. Kuahaha! How is it, Pon? Jealous?\"\n\n\"Kuk!\"\n\nPon wanted Grid to craft his Gale Spear immediately. But before that...\n\n\"Appraise all my equipment!\"\n\nHe thrust his gear at Grid. Unfortunately, every single item came back as a failure.\n\nBy the end of the day, Grid had appraised close to 300 items for the Tzedakah members. Only three possessed hidden features, including Vantner's axes.\n\nThe guild members remained positive. Three winners meant three members had grown significantly stronger. The guild's overall power had risen.\n\n*He joined the guild and boosted our strength in half a day.* Jishuka watched Grid work. *He really is the person we've been looking for.*\n\n*All that effort finding Grid paid off.* Regas smiled.\n\nGrid tallied his earnings. Approximately 10,000 gold. Over 10 million won in cash.\n\n*I earned 40 million yesterday, and now this.* His heart raced. *If I keep earning like this, I'll pay off the debt soon.*\n\nThe debt wasn't even a problem anymore. He could become truly rich. The money wasn't the only benefit. Repairing and appraising hundreds of items had increased his understanding of them significantly.\n\n*None reached 100% understanding, but this is positive long-term.*\n\nThe problem was the quality of the guild's equipment. Higher-rated items were harder to understand. He'd appraised and repaired Vantner's unique axes, but his understanding only reached 30%. Still, if he ever had the chance to disassemble and explore these items, today's work would form a solid foundation.\n\nGrid's mood lifted. He reached out to Pon.\n\n\"Do you have the materials for the Gale Spear?\"\n\n\"Of course.\" Pon handed them over.\n\nGrid was finally going to produce an item. The guild members leaned forward with anticipation.\n\nThen Grid frowned at the crowd. \"I've been curious about something. There are a lot of people here. It's been half a day already. Don't you want to go hunt?\"\n\n\"What!\" Someone checked the time. \"We've been here that long?\"\n\n\"It's already night outside?\"\n\n\"I haven't hunted at all today.\"\n\n\"I'm starving.\"\n\nThe guild members had lost track of time completely, too caught up in the appraisal lottery. Now they worried about falling behind in the rankings. They hurried toward the exit.\n\n\"Work hard, Grid!\"\n\n\"Pon, show us that spear when it's done!\"\n\n\"Make him a rare spear at least!\"\n\n\"Shut up, Vantner!\"\n\nThey said their goodbyes with the casual warmth of friends.\n\n*Friends.*\n\nThe word felt strange in Grid's mind. Awkward. But not bad.\n\n\"Now then.\"\n\nThe smithy emptied. As usual, only Khan and Grid remained.\n\nGrid turned toward the furnace. \"Let's start the item production.\"\n\n---\n\n**Glossary of Common Korean Terms.**  \n**OG: Glossary Link.**  \n**Current schedule: 20 chapters a week.**\n\n**Check out my Patreon for early access to a certain number of unedited chapters and well as achieve the goals for extra chapters. The early access chapters will be updated after I finish releasing all chapters for the day.**"
}