{
  "id": 980,
  "title": "Chapter 979",
  "content": "**Silence.**\n\nThe ministers lay dead. The sanctuary they'd scraped together from nothing—*gone*. His people, suffering under his worthless reign. The Overgeared soldiers who'd bled to defend them. All those who'd fallen...\n\nThe King of the Evil Eyes sat motionless upon his throne, small fists clenched white. This was all he could do. *Destroy*. Never protect. Power rendered useless by its own magnitude.\n\n\"You the king here?\"\n\nThe question cut through the stillness. Footsteps approached, trailing the copper stench of blood. Every fiber of the king's being screamed to open his eyes—to unleash the pain of eternity, to rend this intruder apart and appease the vengeful dead.\n\nHe didn't.\n\nHis jaw locked, teeth cutting into his lower lip until blood ran down his chin. He couldn't forget Prime Minister Lauel's warning: *Never open your eyes. The White Dragon's Eyes will doom us all.*\n\nThe soldiers who'd died for his people. Their sacrifice couldn't be for nothing. If he broke now, how could he face their souls?\n\nHe had to *live*.\n\n\"Not even gonna fight back?\" Mockery dripped from the intruder's words.\n\nFingers seized his collar, yanking him from the throne like discarded refuse. *You're right*, the king thought bitterly. *A king who can't protect—can't even avenge—has no right to that seat.*\n\n\"Get your hands off him!\"\n\nThat voice.\n\nThe king remembered it instantly—the first voice he'd ever heard that didn't dissolve into screams. A man who'd met his gaze and *smiled* instead of dying.\n\n*Grid*.\n\nHe'd come. But *why*? Why tether himself to someone so useless? Regret eclipsed gratitude. Grid had chosen wrong. The king's guilt threatened to crush him whole.\n\n\"**100,000 Army Massacre Sword!**\"\n\nRaw power screamed overhead. The shockwave knocked the king back, blood spraying from his mouth. Pain cleared the fog from his mind.\n\n*He's... trying to kill me?*\n\nGrid hadn't come to help? Confusion and agony warred in the king's chest. Then rough hands tore at the bandages covering his eyes. The Grandmaster's fingers worked with surgical precision.\n\nRed and blue light spilled into the world.\n\nThe King of the Evil Eyes' gaze locked onto the White Dragon's Eyes hovering before him. Instinct screamed a single truth:\n\n*I'm going to die.*\n\nFlames that devoured existence itself would reduce him to ash. Cold that froze even fire would shatter his soul to dust.\n\n*I'm sorry.* His apology echoed in the space between heartbeats, directed at ghosts. *Your sacrifices were wasted.*\n\n\"**WEAR THIS!**\"\n\nLight flashed. Grid materialized beside him via Mass Teleport, shoving something over his eyes. The surge of magic power building in the king's cursed gaze—\n\n*Vanished.*\n\n\"Ah...!\"\n\nBehind the strange lenses, the king's eyes widened. The world remained. Intact. *Whole*. Marble pillars stood unmarred. Stone floors stretched unbroken.\n\nFor the first time since birth, the King of the Evil Eyes *saw* without destroying.\n\n\"This... How is this...?\"\n\nHis entire existence had been defined by what he couldn't have. Cut off. Isolated. And now—now the world sprawled before him in all its mundane beauty. The king forgot the blood, the death, the ruin. His gaze traced the pillars with trembling reverence.\n\nA reflection caught his eye. A small boy wearing a crown.\n\n*Me.*\n\n\"Ah... Ahh...\" He touched his face with shaking fingers, confirming what the polished stone showed. Then he looked up, drinking in every corner like a starving man at a feast.\n\n\"Let's get out of here.\" Grid's voice was gentle. \"A much bigger world is waiting.\"\n\n\"Grid...\" The king turned toward him.\n\nThat same brilliant smile from their first meeting. Grid's extended hand seemed to say: *Your loneliness ends here.*\n\n\"I... I can do nothing.\" The words scraped out. \"I'm useless.\"\n\nWas he even worthy of taking that hand?\n\nThe king hesitated. Grid didn't. His large hand closed around the king's smaller ones—child-sized, fragile.\n\n\"Can't you do plenty in the *future*?\" Grid squeezed reassurance into the gesture. \"Now come on. Everyone's waiting. Your people and my soldiers—they're all hoping you made it.\"\n\n\"They... survived...\"\n\nRelief flooded through him like a breaking dam. The king gripped Grid's hand tight.\n\nGrid glanced at Sticks, who nodded. The spell was already complete.\n\n*Flash!*\n\nMass Teleport activated. Grid, Sticks, the King of the Evil Eyes, and—\n\n\"...Huh? *Four?*\" Grid's head whipped around.\n\n\"W-Why is *he* here?!\" He jabbed a finger at the Grandmaster.\n\nSticks looked like he'd seen a ghost. \"I didn't target him. He just... *rode along* with the spell.\"\n\n\"What? That's possible?\"\n\n\"It's *not* possible.\"\n\n\"Then what the hell just happened?\"\n\n\"Precisely. *Fascinating.*\"\n\nWhile Grid panicked and Sticks puzzled over the magical impossibility, the King of the Evil Eyes stared at the crowd gathered outside the castle gates. *People*. Just as beautiful as he'd imagined ten thousand times over.\n\n\"**SURROUND HIM!**\"\n\nOvergeared soldiers snapped into formation, encircling the uninvited guest. Thousands of blades gleamed in the sunlight, all pointed at the Grandmaster.\n\nHe stood motionless. Unperturbed.\n\n\"You should leave.\" Grid kept his voice level. \"Your plan's already failed.\"\n\n\"Indeed.\" The Grandmaster inclined his head slightly. \"A failure.\"\n\nThe objective had been simple: induce self-destruction by exposing the king to the White Dragon's Eyes—courtesy of King Ares' little gift. Clean. Efficient.\n\nGrid had ruined it.\n\n\"How did you acquire Ether Diamonds from a demon's vault?\" The Grandmaster's tone shifted to something almost conversational. \"Hmm. It seems Sima Qian swindled me.\"\n\nThat eastern schemer. The empire had paid handsomely for those Eyes—conceded to nearly every demand Ares' subordinate had made. The White Dragon's Eyes were supposed to be *priceless*.\n\nNow? With Ether Glasses in play? Their value had cratered. At minimum, they were useless against the Evil Eyes.\n\nThe empire had been played for fools.\n\n\"Can't be helped. I'll withdraw.\" The Grandmaster turned with surprising ease, moving back toward Goldhit and the Black Knight.\n\nJishuka appeared at Grid's side, her voice low and urgent. \"Kill him.\"\n\nShe understood the threat. This man would be their greatest enemy someday. This was their chance—strike while the truce neutralized his offense, overwhelm him with numbers.\n\nGrid shook his head. \"We'd be annihilated.\"\n\nGoldhit would unleash wide-area devastation. Their soldiers would be swept away like leaves. There was no guarantee Magic Contemplation would trigger, and it had cooldown issues anyway.\n\nBut the real problem? The Grandmaster himself.\n\nThe empire had five pillars: Bain, the Emperor's shadow. Goldhit, master of the Tower of Eternity. Kyle, the favored genius. Chensler, the armored cavalry leader.\n\nAnd Grandmaster Zikfrector—whose reputation was mysteriously *small* compared to the others. No heroic tales. Nothing flashy.\n\nYet Mercedes had mentioned something telling: the other four *feared* him. Chairman Lim had specifically warned Grid about him. And the Hero King system classified Zikfrector as \"power that transcended time,\" not merely a \"powerhouse of the era.\"\n\nGrid assessed the threat level as equal to Garam.\n\nRight now? He'd lose.\n\n*I have to get stronger.* \n\nToo many mountains still loomed ahead. But they *could* be surpassed—Kraugel had proven that much with a single year of monstrous growth.\n\nPlayers had limitless potential.\n\n*I'll become stronger.* The vow settled in Grid's chest as he turned to the King of the Evil Eyes.\n\nThanks to the Ether Glasses, the king was seeing his wife's face for the first time. His son's. The family embraced, a scene that should've been heartwarming—\n\n*CRACK.*\n\n\"Wait—*SHIT!* Close your eyes! *NOW!*\"\n\nGrid sprinted forward, panic clawing at his throat. He shoved a helmet onto the king's head.\n\nOne with Ether Glasses built in.\n\n---\n\n\"I'm reporting live from Reinhardt, capital of the Overgeared Kingdom!\"\n\nBlacksmiths flooded the streets in unprecedented numbers. Reporters from every major network jockeyed for position, cameras tracking an unfamiliar procession.\n\nDemonkin. In the Overgeared Kingdom. *Peacefully.*\n\n\"They're demonkin? They look adorable.\"\n\n\"Right? I expected horrifying abominations.\"\n\n\"They're like walking dolls!\"\n\n\"Why are they all wearing sunglasses though?\"\n\nA thousand Evil Eyes followed the 10 Meritorious Retainers through the city. The proud, chibi-like demonkin captivated every onlooker. At the head of the procession walked Grid and their king, golden afternoon light washing over Reinhardt's magnificent architecture.\n\n\"It's beautiful...\" The king's voice was hushed with wonder. \"The sky. The sun. The city... Everything is grander than I ever *imagined*.\"\n\nGrid laughed. \"You'd better get used to it. How long are you gonna gawk at scenery you'll see every day?\"\n\n\"It feels... like a dream.\"\n\nThe king stopped walking.\n\nThe entire procession halted. Every eye on the street locked onto him. Cameras from around the world focused in.\n\n\"Thank you.\" The king's voice cracked. \"Truly... *thank you*.\"\n\nHe bowed—deeply, formally—before Grid.\n\nEvery single Evil Eye behind him did the same. A few lost their balance, oversized heads tilting dangerously, but no one noticed.\n\n\"Our people will repay this debt for the rest of our lives.\"\n\nThe king dropped to his knees.\n\nGrid moved to pull him up, but the king refused his touch. \"I will serve you. Grid, please... accept us.\"\n\n\"...!\"\n\nIt made sense, logically. The Evil Eyes were homeless now, dependent on Overgeared's hospitality. Integration was inevitable.\n\nBut Grid hadn't expected a *public declaration*. Not here. Not now.\n\nDemonkin regarded humans as lesser beings. The Evil Eyes' pride rivaled the vampires'. This level of subservience was *unprecedented*.\n\n\"You uprooted our cursed fate.\" The king's voice carried across the silent crowd. \"You saved me when I sat in despair on my throne, my soul freezing to ice. You washed the blood from our darkened sanctuary with light. Grid—I swear loyalty to you. This is our new destiny. The path my people will walk eternally. I rise from my unworthy throne... to stand at your feet.\"\n\nSilence.\n\nTens of thousands held their breath as one. Not even a whisper disturbed the stillness.\n\nLauel covered half his face with one hand, muttering, \"Time just... stopped.\"\n\nWithin hours, the articles exploded:\n\n**[GRID CROWNED KING OF DEMONKIN]**\n\n**[Another Player First—How Does He Keep Doing This?!]**\n\n**[Overgeared Kingdom's Power Reaches New Heights]**\n\n**[COLUMN: Understanding the Evil Eyes Species]**\n\n**[Pope Damian Expresses Desire for Evil Eyes Alliance...]**\n\n**[Walt Disney Wants Evil Eyes Movie Deal—Will Overgeared King License Rights?]**\n\nGrid had secured a formidable asset. Of course, it was only possible because of his companions' sacrifice and effort.\n\nAnd it wasn't the only prize awaiting him.\n\nA certain small dragon would soon enter his life."
}