{
  "id": 981,
  "title": "Chapter 980",
  "content": "The notifications cascaded through Grid's vision in rapid succession. The Overgeared Kingdom had achieved complete integration with the evil eyes—an unprecedented feat. No other kingdom had managed harmonious relations with a demonkin species. The kingdom's reputation had fundamentally shifted, its very nature transformed from \"ordinary\" to \"no discrimination and prejudice.\"\n\nWord spread fast across the continent. Maxong, the water clan's king, personally championed the Overgeared Kingdom's accomplishments to anyone who would listen. Hidden enclaves of non-human species began taking notice. Grid received one hundred thousand reputation and a new title: \"Different Species' King.\"\n\nThen came the quest notifications for every player sworn to the Overgeared banner.\n\n**Process of Understanding Each Other**\n\n**Difficulty: E**\n\n*Peaceful relations strengthen security and national power. Greet the evil eyes who now call the Overgeared Kingdom home. Build rapport.*\n\n*Completion Requirements: Exchange at least ten words with any evil eyes resident. No level restrictions.*\n\n*Failure Conditions: Confusing an evil eyes resident resets progress to zero.*\n\n*Rewards: Increased evil eyes affinity. Gauss Kingdom terrain data (enhanced movement and combat effectiveness in that region). National contribution points.*\n\nThe rewards caught players' attention immediately. National contribution bought access to mass-produced Grid equipment sets—highly sought-after gear. Terrain adaptation bonuses significantly improved both combat performance and mobility. More importantly, the evil eyes were classified among the most formidable demonkin species. Befriending them meant potential access to hell-related content and quests.\n\nPlayers swarmed toward evil eyes settlements scattered throughout the kingdom's territories. The Overgeared leadership planned to leverage their new residents as a strategic asset.\n\n\"Hello! Welcome to the Overgeared Kingdom.\"\n\n\"Welcome?\" The evil eyes resident tilted his head, a disturbing smile crossing his features. \"Kukuku... how interesting. You approach us—beings who struggle with the beasts in our hearts, who know only solitude. Ah, are you perhaps *the same kind*? Does a monster sleep within you as well?\"\n\n\"...?\"\n\nA question mark appeared above the evil eyes resident's head. Quest failed.\n\nThe difficulty proved far higher than anticipated. Most players found their conversations blocked within moments, question marks flooding above their companions' heads as confusion set in. Repeated failures became the norm.\n\n***\n\nGrid remembered the hidden quest well—impossible to forget, really. He'd received it during his infiltration of Eat Spicy Jokbal's Beware Dogs dungeon.\n\n**Insane Dragon Egg**\n\nA legendary quest involving the evil eyes' dream of vengeance against the great demons who'd expelled them from hell. Like the vampires before them, the evil eyes had been driven out. Now they sought an alliance with Nevartan's offspring—an insane dragon child.\n\nGrid had secured the egg from the dungeon master and delivered it to the evil eyes. The quest completion granted him seventeen evil eyes subordinates and opened diplomatic channels with their people. It had been memorable, certainly. But Grid's interest in the dragon egg itself had been purely academic.\n\n\"What exactly will you do with it?\" he'd asked.\n\n\"Guard it until hatching.\"\n\n\"The moment it breaks free, the dragon will comprehend the world's fundamental truths. It will honor its father's memory by allying with us against the great demons.\"\n\n\"In a thousand years, when the dragon reaches maturity, hell will descend into chaos. Huhuhut...!\"\n\nThat conversation had left Grid with a clear impression. According to Satisfy's lore, the dragon wouldn't become relevant for at least a millennium. Adult dragons exceeded even great demons in power. A player-dragon bond would shatter game balance completely—the developers wouldn't allow it. Grid had dismissed any notion of involvement with the young insane dragon.\n\nBut then...\n\n\"My king, the precious destroyer of the future requests an audience.\"\n\nGrid looked up from his desk. \"Destroyer of the future? Who?\"\n\n\"Nevartan's only flesh—the insane dragon who fell to darkness through the machinations of the evil dragon Bunhelier and the 1st Great Demon Baal. Her name is Nefelina, and she will one day destroy hell and Bunhelier to reclaim her honor.\"\n\n\"...The *hatchling*?\"\n\n\"Indeed.\"\n\nDragons. Transcendent species that even gods treated carefully. The strongest existences in any era of the world. Grid's mind reeled at the unexpected situation.\n\nAcross the room, Sticks dropped a book with a loud *crack*. The high elf was trembling, face pale. Dragons terrified him—particularly after the gourmet dragon Reiders had cursed him with an incurable disease.\n\nGrid felt no welcoming warmth for this meeting either. He predicted only harm could come from encountering the hatchling. The reasoning was straightforward: dragons were too powerful.\n\n*I'll end up a pushover.*\n\nNo game framework existed for players to borrow dragon power. The balance would collapse if a dragon lent strength to an individual player. Unless the S.A. Group were complete fools, no beneficial relationship between dragons and players could exist.\n\n*I'll become another victim like Sticks.*\n\nThe evil eyes king urged him forward. \"The destroyer of the future has limited time. I strongly recommend you see her now.\"\n\n\"Limited time? What keeps her so busy?\"\n\n\"She must sleep. Twenty-three hours each day.\"\n\n\"...\"\n\nOnly awake one hour daily! Grid had never encountered a creature that slept more than Noe. The evil eyes king read Grid's amazement and hastened to explain. \"Dragons comprehend the world's fundamental truths the moment they hatch. Digesting such an enormous volume of information requires tremendous physical and mental resources. Rest is essential.\"\n\nHe seemed worried Grid might underestimate the hatchling. Grid considered for a moment, then nodded slowly. \"Fine. Let's meet. But give me a minute first.\"\n\nHe didn't want this meeting, but curiosity about dragons ultimately won out.\n\n*Better consult Lauel before facing a dragon.*\n\n***\n\n\"The hatchling's been living *here*?\"\n\nThe evil eyes king had led Grid to Reinhardt Castle—Grid's own residence. A dragon had been dwelling in his home without his knowledge? The evil eyes king spoke to Grid's bewildered expression. \"She is a great being. Naturally, her will shapes reality...\"\n\n\"It's *so great* to live in someone else's house without permission...\"\n\nNo rent, either. Grid grumbled as they climbed to the top floor—a space containing his bedroom, his family's quarters, and Mercedes' chambers. The evil eyes king opened the largest door.\n\nGrid's bedroom.\n\n\"...?\" His confusion deepened. He stepped inside and froze.\n\nThe bedroom had completely transformed. Golden treasures decorated every surface, and the space had expanded to ten times its original size.\n\n\"What is this?\"\n\nInternal construction without his knowledge was impossible—he'd woken up here this very morning. This was magic, then. Grid belatedly recognized the truth and turned.\n\nAn enormous bed dominated the space, large enough for twenty adult men to lie comfortably. Between sheets of lace rippling in a soft breeze, a black shadow moved.\n\n*Using my bed...*\n\nGrid gained knowledge he'd never wanted. Imagining a lizard several times larger than a human crouching on his mattress, he quietly approached. The lace lifted.\n\n\"You came.\"\n\nA girl with blue hair reclined on the bed, greeting him with languid ease.\n\n\"...Ah!\" The exclamation escaped before Grid could stop it.\n\nThe girl was breathtakingly beautiful. Despite seeing Irene, Mercedes, Yura, Jishuka, and Sehee daily—all stunning women—Grid felt his soul pulled from his body. Her features possessed jewel-like perfection, each element harmonizing flawlessly with the others. No—it transcended perfection. This was beauty beyond human imagination. Her sleepy eyes captivated him while her mouth stirred protective instincts. Simultaneously, valor radiated from her strong brows.\n\nOne woman came to Grid's mind.\n\n*...Marie Rose.*\n\nThe vampire duke commanded all varieties of charm. The girl before him resembled a teenage version of that impossible beauty.\n\n\"You're staring rather obviously.\"\n\nHow long had he been entranced? Grid had gazed at her face for an extended moment before awareness returned. Beautiful, yes, but not human—and the blue name \"Nefelina\" floating above her head confirmed it. A less-than-two-year-old hatchling. A young insane dragon...\n\n**You have met the destroyer of the future—Nefelina.**\n\n**The magic power forming the world's foundation reduces your presence to dust. All actions sealed by overwhelming pressure.**\n\n**You have resisted.**\n\n**Nefelina lacks full maturity, but her spirit remains intact among existing dragons.**\n\n**This encounter is exceptionally rare!**\n\n\"Mm, sorry. My magic power causes you discomfort.\"\n\n\"N-No, I'm fi...ne.\"\n\nHonorifics to someone younger than Lord? Grid was surprised, but it felt necessary. On another level, he was relieved. A transcendent being who viewed humans as ants had apologized to *him*. She'd illegally occupied someone's house, but that judgment came from a human perspective. Clearly, Nefelina was extending him maximum courtesy. The system had even confirmed her sanity.\n\n*Wait... does that mean the other dragons aren't sane?*\n\nA chill ran down Grid's spine.\n\n\"Human. Grid.\" Nefelina called his name in a gentle voice, eyes curved into pleasant half-moons. The difference between her and Marie Rose crystallized in that moment. Marie Rose's smile ignited primal lust. Nefelina's smile felt refreshing, washing away such base instincts.\n\n\"Yes, please go ahead,\" Grid responded politely, momentarily forgetting both her illegal residence and her age.\n\nNefelina's smile deepened. \"I must grow strong and healthy. This requires substantial nutrition. You shall provide me one hundred cows and pigs daily.\"\n\n*Ttiring~*\n\n**A new quest has been created.**\n\n**Hatchling's Livestock**\n\n**Difficulty: SSS**\n\n*Nefelina seeks to make you her supplier. As king of this realm, she expects you to feed and shelter her.*\n\n*Completion Requirements: Provide Nefelina with one hundred cows and pigs daily.*\n\n*Rewards: Marginal affinity increase with Nefelina every hundred days.*\n\n*Failure: Significant affinity decrease with Nefelina.*\n\n**Accept this quest?**\n\nGrid stared at the window for a long moment before awareness snapped back. His teeth ground together. \"...Do you think I'm a pushover?\"\n\nThe evil eyes king blanched. \"K-King! The destroyer of the future is someone we dare not offend... Don't oppose her will!\"\n\n\"Be quiet, you pushover.\"\n\n\"...\"\n\n\"She's the destroyer of the *future*, not the destroyer of the *present*. Correct?\" Grid glared at Nefelina sprawled across his bed.\n\nHis initial intimidation had worn off. A realistic analysis of the situation led to a clear conclusion: he didn't need to fear Nefelina. Two reasons supported this.\n\nFirst, she lacked Vampire Duke Marie Rose's overwhelming presence. Marie Rose's bewitchment froze targets completely. Nefelina's failure to do so meant her current state fell below even Marie Rose's sealed condition.\n\nSecond—though the blanket had initially concealed it—Nefelina's human transformation was unraveling. Her body had swollen to twice its size, and a tail protruded from beneath the covers. The brief duration of her polymorph revealed weak magic reserves. Well, humans couldn't polymorph at all, but still.\n\n*Dragon or not, she's a hatchling less than two years old. Not as absolute as I feared.*\n\nAs the evil eyes had explained, Nefelina couldn't exert full dragon power for another thousand years. By then, Grid would be long dead. He could respect Nefelina, certainly, but he had no reason to fear her.\n\nUnder Grid's continued glare, Nefelina hiccuped in startled surprise. \"...Hiccup!\"\n\nHer voice turned hesitant. \"...Only ten, then. I'll grant you a dragon's blessing...\"\n\n**The quest 'Hatchling's Livestock' has been revised to 'Hatchling's Request.'**\n\n**Hatchling's Request**\n\n**Difficulty: S**\n\n*Nefelina is somewhat greedy. She hopes you will feed her moderately and provide shelter.*\n\n*Completion Requirements: Provide Nefelina with ten cows and pigs daily.*\n\n*Acceptance Reward: Dragon's blessing.*\n\n*Quest Abandonment: Significant affinity decrease with Nefelina. Dragon's blessing revoked. Dragon's curse inflicted.*\n\n\"Mm...\"\n\nTen each of cows and pigs meant twenty animals daily. A considerable burden—impossible for ordinary players, and wasteful even for Grid.\n\n*But if I refuse... Nefelina will just order the evil eyes to feed her.*\n\nHe wouldn't get the blessing, but he needed to find middle ground. After a moment's deliberation, Grid nodded. \"Three. Daily.\"\n\n\"...T-Then my stomach will growl!\"\n\n\"In exchange for three per day, I won't charge you monthly rent.\"\n\n\"...\"\n\nNefelina's eyes wavered. She wrestled with the decision, expression deeply conflicted."
}