{
  "id": 982,
  "title": "Chapter 981",
  "content": "\"What about five each?\"\n\n\"Three.\" Nefelina's voice carried an edge of finality.\n\n\"Four?\"\n\n\"Three.\"\n\nGrid grimaced. \"That's barely enough to—\"\n\n\"Three!\" The hatchling's tail lashed once against the stone floor.\n\n\"...I need time to think. Come back tomorrow.\"\n\n\"Three each!\" Her round eyes narrowed.\n\n\"I said come back tomorrow!\"\n\n\"Yes...\" The small dragon withdrew with surprising meekness.\n\nLauel watched the exchange with raised eyebrows. \"She didn't threaten you. Not once.\"\n\n\"What do you mean?\"\n\n\"A transcendent species just negotiated like she actually *needed* your cooperation.\" Lauel leaned back against the wall. \"Either she's in a weaker position than we thought, or—\"\n\n\"She's not weak.\" Sticks cut across him, voice sharp. \"That hatchling maintains space reconstruction magic constantly. Do you understand what that means? Human magicians can't even *imitate* that spell, let alone cast it continuously while maintaining polymorph.\" The High Elf's fingers drummed against his staff. \"She could slaughter a hundred cows in minutes. Then kill everyone guarding them.\"\n\n\"Then why negotiate at all?\" Grid frowned.\n\n\"Because she's insane.\"\n\nSilence.\n\n\"Excuse me?\"\n\n\"That hatchling is out of her mind.\" Sticks spoke with absolute conviction. \"Dragons are solitary apex predators. They act on whim and desire because nothing in this world can stop them. A human building a house doesn't ask permission from the ants in its foundation. Dragons are the same. But that one?\" He gestured toward where Nefelina had departed. \"She's *negotiating*. She's considering our needs. It's aberrant behavior.\"\n\nLauel rubbed his temples. \"That seems... reasonable, actually. Not crazy.\"\n\n\"By dragon standards, it's madness. Their thoughts crystallize at birth—age means nothing. She's fundamentally different from her own kind.\"\n\n\"So what do we do?\"\n\n\"Study her.\" For the first time since Grid had known him, genuine curiosity replaced the fear in Sticks' eyes. \"A dragon that acts like this? She's unprecedented.\"\n\nGrid cleared his throat. \"About the cows and pigs. Three of each daily—that's eighteen gold. One hundred days would cost me...\" He winced. \"The equivalent of two and a half million won.\"\n\nLauel's stare could have frozen water. \"You're complaining about the cost of securing a dragon's favor? How much do you make per legendary item?\"\n\n\"That's different—\"\n\n\"It's seven hundred thousand won monthly. Less than minimum wage. And she's *blessing* you in return. This is the most obvious investment you've ever seen.\" Lauel crossed his arms. \"Besides, why are you paying with personal funds? Use the kingdom's treasury.\"\n\n\"For a personal quest?\"\n\n\"You *are* the kingdom.\" Lauel's tone sharpened. \"Who funded Overgeared in the first place? Who covers every deficit when national projects fail? Stop acting poor when you spent your own fortune building this nation. The treasury exists for the king's use.\"\n\nGrid opened his mouth. Closed it. He wasn't actually poor—hundreds of billions of won in assets proved that. But he wasn't chaebol-level wealthy either. No private jets in his future.\n\n\"Fine. We'll use national funds.\"\n\nSticks nodded approvingly. \"She's already powerful beyond our ability to remove. Better to negotiate on favorable terms.\"\n\n*The kingdom pays, I get a dragon's blessing.* Grid stood, anticipation quickening his pulse. *I wonder what blessing she'll grant.*\n\n\"Your Majesty.\" Lauel's voice stopped him at the door. \"About the chef from the East Continent. The Poison Master.\"\n\n\"Idan?\" \n\n\"His cooking skill has stagnated for over a year.\"\n\nGrid frowned. \"Why?\"\n\n\"No one will eat his dishes. He gains experience from cooking, but without people consuming the food, the growth rate has hit a ceiling.\"\n\n\"The Overgeared members used to eat his dishes for poison resistance training—\"\n\n\"Their resistance is maxed out now. And his cooking is still lethal to anyone without high poison resistance. We can't feed it to regular soldiers.\"\n\n\"Can't he cook normal food yet?\"\n\n\"His skill improves the baseline quality, but...\" Lauel smiled slowly. \"Which brings me to my idea.\"\n\nAfter hearing the plan, Grid grinned. \"You're a genius.\"\n\n\"I am lonely in my brilliance.\" Lauel sighed dramatically. \"But I've learned to embrace the solitude.\"\n\n\"Right. Enjoy that. I'm leaving.\"\n\n***\n\n\"What the hell is that?\"\n\n\"Holy shit...\"\n\nThe intermediate hunting ground near Reinhardt fell silent as five hundred soldiers materialized along the tree line. Each wore the distinctive mass-produced Grid Set, moving with the synchronized precision of elite troops. At their head, a woman with a golden nameplate—Mercedes—surveyed the terrain with professional detachment.\n\nPlayers froze mid-swing, monsters forgotten.\n\n\"Is there a war?\"\n\nMercedes stopped and gestured. The ranks parted like water.\n\nThrough the gap came three figures: a couple holding hands and a small boy gripping a wooden sword. Grid and Irene walked to the center of the hunting ground where Mercedes spread an embroidered mat across the grass.\n\n\"Sit with me.\" Grid guided Irene down.\n\n\"Of course.\"\n\nThey arranged tea and pastries with domestic ease while Lord brandished his training sword and charged at nearby monsters alongside Overgeared Skeletons One and Two.\n\n\"Hiyah!\"\n\n\"Kiek!\"\n\nGrid beamed. \"Look at his form. Exceptional.\"\n\n\"He takes after you, Your Majesty.\"\n\nThe couple watched their son with undisguised adoration while absolute chaos unfolded around them.\n\nOne player blinked and looked around. \"Where did all the monsters go?\"\n\nThe hunting ground had emptied. Every creature within eyeshot was being systematically corralled toward Lord by five hundred elite soldiers acting as a mob funnel for one six-year-old prince.\n\n\"That's what they mean by diamond spoon.\"\n\n\"I want to be Grid's son...\"\n\nThe players could only stare. But no resentment touched their faces—only wonder tinged with gratitude. Because Grid hadn't forgotten them.\n\nMercedes appeared beside a group of stunned players. \"Follow me.\"\n\nShe led them through the forest with the assured stride of someone who knew exactly where every boss monster would spawn. At each location, she struck precisely enough to break the creature's defenses, then stepped back.\n\n\"Finish it.\"\n\nThe players scrambled to land killing blows. Experience flooded their logs. Items materialized in their inventories—boss-tier drops they'd never have acquired alone.\n\n\"Hooray for Overgeared!\"\n\n\"Long live King Grid!\"\n\nTheir shouts echoed across the hunting ground. Each voice strengthened the kingdom's foundation—a truth Grid understood instinctively.\n\n*Family time as public relations strategy.* Grid sipped tea while Lord's laughter rang through the trees. *Irene's happy. Lord's training. The people love us. And the skeletons gain combat experience.*\n\nAll from Lauel's morning briefing.\n\n\"Your Majesty.\" Mercedes materialized beside the mat. \"I've cleared every boss in range.\"\n\n\"Excellent.\" Grid rose and helped Irene to her feet. \"Shall we relocate to the next picnic spot?\"\n\n***\n\nThe following day, Grid returned to the evil eyes village with their king in tow.\n\nNefelina waited in draconic form—roughly two feet of blue scales, whip-like tail, and eyes the size of saucers. Adorable in a way that made Grid deeply nervous.\n\n\"Four of each.\" She stated it as fact, not negotiation.\n\n\"Three—\" Grid caught himself. \"Is that your final offer?\"\n\n\"Four keeps my stomach quiet.\"\n\nSomething in her tone triggered Grid's instincts. The same intuition that had saved him countless times whispered a warning: *Push further and you'll regret it.*\n\n\"The great destroyer of the future honors me with her consideration.\" Grid inclined his head. \"Four cows and four pigs daily. You have my word.\"\n\n\"Good.\" Her tail swished approvingly. \"I would have been upset if you'd kept arguing.\"\n\n\"I'm sure...\" Grid suppressed a shudder and clapped his hands.\n\nThe door opened. Idan entered on trembling legs, face the color of old parchment.\n\nNefelina cocked her head. \"Who's this?\"\n\n\"Your exclusive chef.\"\n\n\"Exclusive?\" Her tail began wagging. \"A human who cooks only for me?\"\n\n\"My sincere gesture to the great hatchling.\"\n\n\"Hum hum. I like this.\" The tail drummed a pleased rhythm against stone.\n\nIdan looked ready to faint.\n\nGrid leaned close and whispered, \"East and West Continent dragons are very different. Western dragons are *evil*. Make delicious food, or you might become the meal.\"\n\n\"H-Hiik...\"\n\n*Perfect.* Nefelina had full poison immunity—Idan's lethal cooking wouldn't harm her. The evil eyes' undeveloped culinary culture meant she'd never tasted proper seasoning. She wouldn't notice that Idan's dishes were objectively terrible.\n\nLauel's plan in action: secure Nefelina's favor while finally giving Idan the practice he needed.\n\n\"Grid.\" Nefelina's eyes gleamed. \"Your attitude pleases me. I'll grant you an excellent blessing.\"\n\n> **[The quest 'Hatchling's Request' will proceed.]**\n>\n> **[Provide Nefelina with four cows and four pigs daily.]**\n>\n> **[You have received a dragon's blessing for accepting the quest!]**\n\nGolden light erupted around Grid's body—not the pale wash of ordinary buffs, but deep, radiant power that sank into his bones.\n\nHis heart hammered. Players didn't receive dragon blessings. *Humans* didn't receive dragon blessings. \n\nHe might be the first in history."
}