{
  "id": 984,
  "title": "Chapter 983",
  "content": "*Crazy.*\n\nThe word bubbled up in Grid's mind, urgent and irrepressible. He'd been trying to curb such language lately—it wasn't exactly regal. He wasn't Huroi, after all, and kings needed to maintain a certain image.\n\nRight now, though, he couldn't care less.\n\n\"This is absolutely insane.\" Grid watched his experience bar surge upward with each kill. \"The speed—it's ridiculous. Completely ridiculous. You seeing this, Noe?\"\n\n\"I don't understand what you're babbling about, nyong...\"\n\n**[You have defeated a Galgunos Skeleton Soldier.]**\n\n**[15,905,099 experience will be divided.]**\n\n**[You have defeated a Galgunos Skeleton Soldier.]**\n\n**[15,905,099 experience will be divided.]**\n\n**[You have defeated...]**\n\nThe notifications flooded his vision, a relentless cascade of victory. Grid's gaze drifted to the sword in his hand—the **+4 Enlightenment Sword**, its blade crackling with dark flames and red lightning.\n\n*Enlightenment.* The name finally made sense.\n\n**[Enlightenment Lv. 3]**  \n*A persistent passive.*  \n*- Character experience and skill experience acquisition increased by 10.9%.*  \n*- Accuracy and evasion increased by 20.3%.*  \n*- Skills attached to myth-rated items can be upgraded.*\n\nAn experience multiplier. Just like the dragon's blessing, except *better*—this could level up. Combined with the dragon's blessing, Grid gained a constant 20.9% experience boost. Better than even the premium buff potions that cost a fortune in reputation points.\n\nHe'd been wielding this sword for weeks. How had he overlooked something so valuable?\n\nThe first underground floor of Galgunos Temple sprawled before him, a killing field of endless bone and rage. When Grid first descended, disappointment had soured his mood. The skeleton soldiers were weaker than the War God Followers above, their experience yields modest.\n\nThat disappointment lasted exactly five minutes.\n\nUnlike the War God Followers, these skeletons died *fast*. They spawned five times more frequently. And they respawned at an absurd rate.\n\nFor most players, this would be a nightmare. Galgunos Skeleton Soldiers were advanced monsters exceeding level 350. Their durability was poor, but their spears struck with brutal precision—high accuracy, devastating damage, lightning-fast attacks. They'd shred any high ranker with typical 4,000 defense.\n\nGrid's defense exceeded 6,000.\n\nHis 2,400 stamina provided a solid foundation, but the **+3 Valhalla of Infinite Affection** added another 1,600 points. Against his defenses, the skeleton soldiers were eggs hurling themselves at a boulder.\n\nA poisonous boulder, at that.\n\n**[You have suffered 3,900 damage!]**\n\n**[The +3 Valhalla of Infinite Affection has emitted poison!]**\n\nToxic fog bloomed around Grid. The skeletons surrounding him staggered, their bones turning sickly green as their health bars plummeted.\n\n**[The option effect 'Black Flames' has erupted from the +4 Enlightenment Sword!]**\n\nGrid's blade became a blur. Black fire exploded with each strike.\n\n\"**Link!**\"\n\n*\"Kyak kyak! Kyakyakyak!\"*\n\nThe skeletons' death rattles filled the chamber as Grid's forces converged. The **Blade Aiming at the Gods** carved through bone. Randy mimicked Grid's swordplay with mechanical precision. The Overgeared Skeletons crushed skulls with their axes. Tiramet bound enemies in silver thread. Noe pounced on stragglers with feline savagery.\n\nPoison. Flames. Blades. Fists. Crushing bone. Binding thread.\n\nDozens of skeleton soldiers fell simultaneously. What would devastate an ordinary party was a blessing for Grid.\n\n\"Know your place before the supreme demonic beast of Hell!\" Noe delivered the final blows, preening.\n\nGrid allowed himself a moment to breathe.\n\nThe **Unicorn's Blessing** increased resource recovery by 20%. Mid-battle, Grid mounted Overgeared Corn, letting his stamina regenerate while his summons held the line.\n\n**[Status: Annoyed. Depressed.]**\n\n*(I want a female rider, not a male.)*\n\nThe unicorn's discontent barely registered. Better to summon it frequently—build favorability, share experience, raise its level. Each level made the creature more tolerable... or at least, gave Grid hope it eventually would.\n\n*What are they doing?*\n\nGrid's attention caught on the Overgeared Skeletons. They were collecting bone fragments from the battlefield, handling each piece with almost reverent care. The sight reminded him uncomfortably of Yerim at a department store sale.\n\n*They want these?*\n\nAbsurd. No self-respecting player shared miscellaneous loot with their summons. The pet system didn't require it. He wasn't *Nyangmong*, for god's sake.\n\nGrid dismounted in a hurry. **Transcended Link** swept through approaching skeletons in a horizontal arc of destruction. Then he rushed forward, snatching up every piece of loot in sight—including the bone fragments the Overgeared Skeletons had been eyeing.\n\n*High-level undead bones. Should fetch a decent price.*\n\nThe fragments were thick, ugly, and extraordinarily hard. Quality material for defensive items, though bone equipment suffered from poor durability and difficult repairs. Not worth Grid's time to craft.\n\n*Clack! Clack clack clack!*\n\nThe Overgeared Skeletons stared at him. Their normally sinister ⌓ ⌓ eyes shifted upward in what could only be described as puppy-dog pleading. They waved their bony fingers in supplication. Overgeared Skeleton Two gestured too enthusiastically and snapped off a finger against its own jaw. It calmly retrieved the digit and reattached it, good as new.\n\n\"You... actually want these?\"\n\n*Clack! Clack clack!*\n\nBoth skeletons nodded so vigorously their jaws rattled.\n\n\"You're interested in skeleton bones? Why didn't you want them before?\"\n\nThe drop rate for bone fragments sat around 3%—unusually low for miscellaneous items. That implied value, potentially significant value. Grid wasn't inclined toward generosity. The Overgeared Skeletons didn't have an affinity system requiring gifts or maintenance.\n\nBut...\n\nThey couldn't speak, yet their emotions came through crystal clear. High-grade summons with personality. Cute, in their own macabre way. Obedient. Promising.\n\nGrid had expectations for these two. Evolving skeletons. During the Demon King subjugation, they'd worn death knight and lich appearances. Perhaps that could become permanent...\n\n\"Fine.\" His hands trembled as he retrieved two bone pieces. \"Take them. Gifts.\"\n\n*Clack! Clack clack clack!*\n\nPure joy radiated from the Overgeared Skeletons. They embraced each other, then launched into an impromptu dance.\n\n\"Stop that!\" Grid intervened immediately. The last thing he needed was them developing a Dancer subclass. They couldn't dance—the footwork was atrocious. \n\nThe skeletons' shoulders slumped. Then their attention returned to the bone fragments. They began inserting the pieces into their own rib cages.\n\n\"Wait—what?\"\n\nGrid's eyes widened. The Overgeared Skeletons chittered happily, each having added a new rib. And they'd grown—not much, but noticeably. Their frames were slightly larger, bones slightly thicker.\n\nThe change was small but undeniable.\n\n---\n\n**Elizabeth's Workshop**\n\n\"He didn't come.\"\n\nBefore joining Overgeared, Elizabeth's workshop had been invaded by Agnus. Everyone assumed he'd returned to Reinhardt for her.\n\nBut the workshop stood empty.\n\nLauel carried Lord in his arms while Coke maintained a protective perimeter. Neither spoke.\n\nFaker materialized from the shadows. \"We missed him. Agnus disappeared—the Overgeared Shadows lost his trail.\"\n\n---\n\n**A Small Inn, Market District**\n\n\"You came.\"\n\nEuphemina's voice was soft as the bloody figure entered her room. His robe slipped as he collapsed into a chair, revealing green hair matted with sweat and grime.\n\nAgnus. Murderer. Killer of accessory makers across seven kingdoms. A man drowning in accusations.\n\n\"You're badly hurt.\"\n\nBut Euphemina showed no fear. Their previous encounter had revealed the truth—he wasn't the monster the world believed.\n\n*How many curses is he carrying?*\n\nHer expression darkened as she assessed his condition. **Weakness. Poison. Recovery Nullification.** A litany of afflictions, each one a story-bound curse. Not natural debuffs that faded with time, but systemic punishments woven into his very existence.\n\nThe only way to break such curses: kill the cursed, or resolve the underlying story.\n\nPotions wouldn't help. Euphemina pulled out a handkerchief and gently wiped blood from his pale face.\n\n\"You're wanted in seven kingdoms. Do you feel it's unfair?\"\n\nAgnus swatted her hand away, laughing bitterly. \"Kuku... who am I to claim injustice?\"\n\n\"You didn't kill those people.\"\n\nHis shoulders trembled. The laughter died. For a moment, something raw and wounded flickered across his face before the familiar sneer returned. \"Don't waste words. You came for one reason.\"\n\nThere was someone Agnus loved. The only person who'd ever loved him in return. She'd suffered terrible things because of him, and ultimately left this world. If he could save her—bring her back—\n\n\"I'll free Mumud.\"\n\nEverything he'd built—all the strength accumulated through years of refusing to be a victim—Agnus was ready to sacrifice it all.\n\n\"But you *will* keep your promise.\" The smile vanished. The madness receded. His golden eyes locked onto Euphemina's, clear and desperate and entirely sane.\n\nShe met his gaze without flinching. \"On my honor, I will.\"\n\nShe understood what drove this choice. This man had suffered his entire life, and she wouldn't betray him. After completing the Mumud Liberation quest, she'd fulfill her promise.\n\nEven if honoring that promise destroyed him.\n\nFootsteps echoed in the hallway outside—heavy, purposeful, too many. The hunters had found him. Monstrous beings from foreign kingdoms, relentless and brutal, the kind that tore apart body and soul.\n\n\"Kikikik... we meet again.\" Agnus stood, seizing Euphemina by the shoulders. He shoved her toward the window.\n\nThis was his fight. He wouldn't drag the kid into a battle she couldn't win."
}