{
  "id": 985,
  "title": "Chapter 984",
  "content": "Seven kingdoms had suffered the same loss: Murray, Ultina, Violet, Ark, Haken, Rotemon, and Glaucian—each one robbed of a treasured accessory maker by the mad killer's hand. In a world where production class craftsmen were irreplaceable assets, the damage cut deep.\n\nJustice had to be served. The royal families demanded it; the people expected it. When respected artisans were slaughtered, inaction meant forfeiting the trust and prestige that held kingdoms together.\n\n\"Finally caught you, you filthy bastard.\"\n\nHunters from all seven kingdoms poured into the room—royal knights, renowned mercenaries, faceless bounty hunters. Fifteen warriors in total, each with their own methods and motivations. Yet they shared one trait: exceptional skill. Among them, the mercenaries Phildea and Johneman stood out with their brilliant reputations as named NPCs. Even at full strength, Agnus would struggle against both simultaneously. Cursed and weakened as he was now, victory seemed impossible.\n\n\"Listen, Agnus. Stop this pointless resistance and come quietly.\"\n\nNaturally, players numbered among the hunters. Bubat stepped forward, his initiator class perfectly suited for this pursuit. He'd hounded Agnus relentlessly these past months. Had the National Competition not pulled him away temporarily, Agnus would already be awaiting the guillotine.\n\n\"There are thousands surrounding this inn. Even if you slip past us, you'll be captured within the hour. Make this easy on yourself.\"\n\nThe seven kingdoms had spared no expense. Hundreds of troops operated in the shadows—the claim of a thousand-man perimeter wasn't mere bluster. Yet Agnus showed no fear.\n\n\"Why do you insist on spouting the same garbage every day?\"\n\nMadness seeped from his words like poison. Agnus surveyed the enemies closing in and remembered his powerless past—a time when he'd endured suffering without recourse, experienced every flavor of pain simply because he lacked strength. Back then, he'd surrendered to violence. Not anymore. No matter how many times he was beaten down, no matter what he lost, he would never submit. He'd rather fall fighting than kneel. This was Agnus's conviction.\n\n\"Wait.\" Bubat moved to intercept as Agnus drew his sword without hesitation. \"How many times have we done this already? If you die fighting here, your wanted status remains. We'll hunt you to the guillotine eventually. You'll die repeatedly, suffering penalties each time.\"\n\nOnly legal punishment could clear Agnus's criminal record. Until he faced the guillotine's blade, no amount of death would lift his curses. Better to accept execution than live as a fugitive until he quit the game entirely. True, the guillotine's penalty exceeded a normal death... but at least it brought closure rather than endless pursuit.\n\n\"We're in the heart of the Overgeared Kingdom. Make a scene here and Grid will come for us. Won't that tire you out as well?\"\n\n\"Don't really care. Kikikik, you think I'm afraid of Grid?\"\n\n\"...\"\n\nBubat fell silent. Agnus paused. Grid—someone who shared a similar past with Agnus—was a fool who fought for others despite living in a world populated solely by perpetrators and bystanders. Had he forgotten his own misfortunes and suffering?\n\nAgnus despised Grid. The man's actions and ideals turned his stomach. Naturally, he hated anyone who spoke Grid's name. Enough to kill them!\n\n\"Dyulebul!\"\n\nThe demon manifested at Agnus's unhinged summons. A grotesque fusion—lizard head grafted onto a humanoid body. Its appearance triggered primal terror.\n\nBubat knew exactly how devastating that ray of light could be. \"Dammit!\"\n\nTwenty thousand fixed damage erupted from Dyulebul's maw. Worse, an additional eight thousand explosive damage detonated at the point of impact. The small inn couldn't withstand such force. Walls exploded outward. The roof tore away, exposing the night sky. Screams echoed as civilians scattered in panic.\n\n\"...Using any means necessary!\" Bubat ground his teeth. Overgeared soldiers would investigate within minutes. Then Grid would learn what happened. The thought terrified Bubat. What became of the Immortal guild when they'd invaded the Overgeared Kingdom's smithies? Ruined. Scattered like ash. One of the strongest guilds, obliterated.\n\n*My personal quest can't drag the Yak Guild down!*\n\nBubat's decision came instantly. He retreated amid the chaos. The other player hunters did likewise. For them, Grid represented a challenge to aspire to—not an enemy to antagonize.\n\nThe NPC hunters, however, operated under different logic. They recognized Grid's power without fearing or revering it. Natural enough—as NPCs, they couldn't truly comprehend Grid's overwhelming presence. The Overgeared Kingdom's current position remained vulnerable.\n\n\"Haap!\"\n\nDyulebul's ray fired every five seconds. Its spinning tail maintained a constant flame, though the damage proved negligible against skilled opponents. The hunters drew their weapons in unison and charged past Dyulebul to engage Agnus directly. He responded by summoning death knights and liches.\n\nCoordinated strikes quickly subdued the death knights. Lich Mumud, however, failed to unleash his devastating spells. The location constrained him—this inn stood at the marketplace's center. He hesitated, unwilling to catch civilians in the magical crossfire. Open defiance of Agnus's commands. Unavoidable, unfortunately. Weakened by countless curses, Agnus couldn't exert perfect control over Mumud. Impossible to dominate the ironclad will of a super named existence that he'd only obtained through his status as Baal's Contractor.\n\nWithin moments, the hunters drove Agnus onto the defensive. They restrained his limbs and pressed blades to his throat while clicking their tongues in disgust.\n\n\"The filthy murderer is going to suffer.\"\n\nAfter months of pursuit, the hunt had ended. Hatred blazed in the hunters' eyes as they bound Agnus with rope.\n\n\"What's all this commotion in our kingdom?\"\n\nA blonde woman strode into the scene. Taking in the hunters' bewildered expressions, she offered an introduction. \"I am Earl Euphemina of the Overgeared Kingdom. I'll have to ask you to take responsibility for exercising force freely on foreign soil and endangering our people.\"\n\nThe hunters hastily introduced themselves and bowed. \"This man is a heinous criminal who murdered craftsmen across our seven kingdoms. The situation was urgent—we couldn't risk losing him, so we weren't able to secure your consent beforehand. We sincerely apologize and will compensate any damages your land has suffered today.\"\n\nA heinous criminal responsible for murders across seven kingdoms...\n\nTypically, disturbances arising from such an arrest would be overlooked by the host kingdom. Euphemina, however, had no intention of being typical.\n\n\"Are you certain he's the murderer?\"\n\n\"That's correct.\"\n\n\"What evidence do you have?\"\n\n\"He was seen at every murder scene.\"\n\n\"That's sufficient? What if he was framed?\"\n\n\"...Are you trying to defend this man? I'm beginning to doubt the Overgeared Kingdom's intentions. Recent rumors claim you've accepted other species, drawing the Empire's ire. Do you intend to antagonize our seven kingdoms as well over a murderer?\"\n\n\"That's quite a leap. I simply want to confirm why you caused a disturbance in the middle of the Overgeared Kingdom. I'm asking routine questions. Your sensitivity is what's suspicious.\"\n\n\"Why are you being so obstinate about catching a criminal? Is there something between you two?\"\n\nOnly Johneman remained silent, arms crossed. As a mercenary unaffiliated with any nation, international politics held no interest for him. The atmosphere grew tense.\n\n\"Don't speak nonsense.\" Agnus scoffed from his bindings, treating Euphemina like a stranger. \"Is that kid so special? Just take me away. How long do you think I'll stay tied up? Eh? You stupid assholes, kukukuk!\"\n\n\"Shut up!\"\n\n\"If you want me to shut up, gag me and drag me away. Don't waste my time unnecessarily.\"\n\nAgnus openly rejected Euphemina's help. His refusal was so explicit that she couldn't press further. As they hauled him away like a dog, Agnus sent her a whisper.\n\n—*Don't interfere in the future. It's annoying.*\n\n—*But you...*\n\n—*Shut up. This is none of your business. Don't worry, I'll keep my promise.*\n\nAgnus was unfamiliar with goodwill. It made him uncomfortable, displeased—because it was unfamiliar. Euphemina caught the loneliness flickering in his eyes and turned sharply to the hunters. \"...The Overgeared Kingdom will be thoroughly compensated for your unauthorized use of force here.\"\n\nThat was all she could do.\n\n***\n\n[Your level has risen.]\n\nFive levels in a single month. Even with the National Competition's reward buff boosting his gains, it was an unusually rapid pace. The 1st-ranked Chris took over three months to gain a single level. \n\nThe outside world buzzed over Grid's leveling speed. Players worldwide watched as he surged through the rankings. Speculation ran rampant that his newly acquired Different Species' King title was responsible.\n\nYet Grid's attention remained fixed elsewhere. On the Overgeared Skeletons.\n\n\"Still not right?\"\n\n*Clack! Clack clack!*\n\nGalgunos's skeleton soldiers dropped bone fragments when slain. Officially named \"Bone Fragment of a Skeleton Soldier,\" each piece proved frustratingly unique. Ribs, clavicles, left arm bones—the fragments all looked identical to Grid's eyes, but mechanically they remained distinct.\n\nThe Overgeared Skeletons required bone fragments from the *same area* to strengthen specific body parts. Reinforcing the right arm demanded a right arm fragment. Nothing else would suffice.\n\n*This damn mechanic... The drop rate is atrocious.*\n\nWhy did they need to match areas? How many skeleton soldiers would he need to slaughter to fully strengthen both Overgeared Skeletons? With duplicate parts constantly dropping, he might kill tens of thousands without completing the set.\n\n*Each area can only be strengthened once. Duplicate bones are worthless... Huh?*\n\nGrid quickly realized his worries were premature.\n\n[The Skeleton Soldier's Bone Fragment has been acquired.]\n\n*Clack! Clack clack!*\n\nMost bone fragments that dropped were precisely what the Overgeared Skeletons needed immediately. Duplicate areas rarely appeared.\n\n*This is insane...*\n\nGrid watched the Overgeared Skeletons celebrate each new bone fragment and once again appreciated how fraudulent the Good Luck stat truly was. His unlucky life before Satisfy had been unfair and meaningless. The Overgeared Skeletons were transforming.\n\n[The Overgeared Skeletons One and Two have succeeded in strengthening all bone areas!]\n\n[Primary awakening has been completed.]\n\n[The stats of Overgeared Skeletons One and Two have increased significantly!]\n\nBoth skeletons now stood 1.2 times taller. Save for their skulls, every dried bone had thickened substantially. Their physiques had grown dramatically.\n\n...Their skulls had grown too, but proportionally less than their other bones.\n\n*I've got a good feeling about this!*\n\nGrid intensified the hunt. The Overgeared Skeletons sat at level 198—he intended to push them to level 200 for their second advancement class. Not an easy task. The Overgeared Skeletons remained pitifully weak compared to Galgunos's skeleton soldiers. Summoning Tiramet helped briefly before he inevitably died. Ultimately, Grid hunted while protecting the Overgeared Skeletons simultaneously.\n\nSeveral days passed.\n\n[Overgeared Skeleton One and Overgeared Skeleton Two's levels have increased.]\n\n[Overgeared Skeleton One and Overgeared Skeleton Two can advance to their second class.]\n\nGrid achieved his goal. The Overgeared Skeletons danced with joy. Eyes fixed on one point, Grid swayed unsteadily. He swallowed hard, anticipation flooding through him as he pulled up the list of potential second advancement classes."
}