{
  "id": 986,
  "title": "Chapter 985",
  "content": "**[Available Classes - Overgeared Skeleton One]**\n\n**1. Destroyer Skeleton Miner** *(Enhanced mining proficiency)*  \n**2. Destroyer Skeleton Clown** *(Master of laughter)*  \n**3. Destroyer Skeleton Dancer** *(Superior dancing ability)*  \n**4. Destroyer Skeleton Swordsman** *(Advanced swordsmanship)*  \n**5. Destroyer Skeleton Dancing Smith** *(Combines dancing and blacksmithing)*\n\n**[Available Classes - Overgeared Skeleton Two]**\n\n**1. Restorer Skeleton Miner**  \n**2. Restorer Skeleton Clown**  \n**3. Restorer Skeleton Dancer**  \n**4. Restorer Skeleton Mage** *(Enhanced magical proficiency)*  \n**5. Restorer Skeleton Dancing Smith**\n\nWere these options... *correct?*\n\nGrid stared at the notification windows floating before him, his mind grinding to a halt. The silence stretched. Was he trapped in some fever dream? The boundaries between nightmare and reality blurred beyond recognition.\n\nWhen his thoughts finally restarted, he desperately searched for any logical explanation.\n\n*I made them mine. A few times.*\n\nIn Grid's recollection, he'd only occasionally put the Overgeared Skeletons to work in the mines when labor was scarce—perhaps five times at most. Yet here it was, appearing not only in their first advancement but persisting into their *second* advancement class options.\n\nOf course, this was entirely Grid's selective memory. During the skeletons' early levels when they were too weak for combat, mining had been their primary occupation whenever he summoned them.\n\n*Alright... fine. Let's say the mining skill came from those hundred sessions. And the clown and dancer options—those make sense given their laughing and dancing habits.*\n\nGrid nodded slowly to himself. The logic tracked, barely. At least the swordsman and mage classes had unlocked as well. Overgeared Skeleton One had watched him wield a blade countless times, while Overgeared Skeleton Two had observed his spellcasting. Progress through observation—he could accept that.\n\n\"It's fine. This is... manageable.\"\n\nBut then his gaze snagged on the final option.\n\n*Dancing Blacksmith.*\n\nNo matter how he twisted the logic, this made absolutely no sense.\n\n\"Did you *dance* while I was working the forge?\" Grid's voice rose. \"Is that what happened? How am I supposed to believe this?\"\n\nThe blacksmithing path itself was inevitable—their master was a blacksmith, after all, and they'd watched him work hundreds of times. But blacksmithing with the *dancing* modifier...?\n\n*If it were Dancing Swordsman or Dancing Mage, I wouldn't even hesitate.*\n\nThat was the crux of it. Modifiers weren't the problem—modifiers were *powerful*. The issue was where this particular modifier had attached itself.\n\n*I need combat power for their second advancement, but...*\n\nGrid had initially planned to choose Swordsman and Mage. Straightforward. Practical. Yet he understood all too well how modifiers worked in Satisfy. Every additional descriptor increased an item's—or in this case, a class's—potential exponentially. A Dancing Smith would inevitably possess greater long-term value than a standard class.\n\nThe catch? Combat effectiveness would be abysmal in the short term.\n\n*Choosing the ordinary classes over the ones with modifiers... won't that feel like a waste later?*\n\nGrid wrestled with the decision, then sighed. \"Braham, what do you think?\"\n\nHe didn't actually expect a response. Braham's soul remained critically weakened, spending most of its time dormant. But to Grid's surprise, the great magician stirred.\n\n—*Choose the Dancing Smith.*\n\nBraham's reasoning was, as always, annoyingly sound.\n\n—*The destroyer and restorer modifiers from their first advancement carry forward. The same will apply to their third advancement. As you're well aware, modifiers are absolute. The more a class accumulates, the higher its ultimate potential. The Dancing Smith may seem underwhelming now, but thinking long-term, it's the superior choice.*\n\nBraham's sudden investment in the Overgeared Skeletons was notable—perhaps Beriache's legacy stirred something in him. Regardless, his advice carried weight.\n\n\"Alright... I'll do it.\"\n\nAn investment in the future, then. By their third advancement, both skeletons would carry the compound modifiers of destroyer/restorer, dancing, and blacksmith. Grid squared his shoulders.\n\n\"It'll sting now, but there's no alternative. You're both becoming Dancing Smiths.\"\n\n**Kyaak! Kya kya kyak!**\n\nThe Overgeared Skeletons chittered with delight, immediately breaking into their characteristic dance.\n\n**[Confirm class selection: 'Dancing Smith' for Overgeared Skeleton One?]**\n\n\"Co... confirmed.\"\n\n**[Confirm class selection: 'Dancing Smith' for Overgeared Skeleton Two?]**\n\n\"...Confirmed.\"\n\nGolden light erupted around the dancing skeletons' frames. Meanwhile, Grid swallowed his misgivings. Two Dancing Smiths—utterly useless for combat in their current state.\n\n*Just get them to level 300 as fast as possible.*\n\nThe experience penalty from the level gap between him and his summons had been brutal, but as they climbed higher, that gap would narrow and their progression would accelerate.\n\n**[Second class advancement complete for Overgeared Skeletons One and Two!]**\n\n**[Class bonus: Overgeared Skeleton One gains +50 Strength, +50 Stamina, +20,000 Health.]**\n\n**[Class bonus: Overgeared Skeleton Two gains +50 Intelligence, +50 Stamina, +15,000 Health, +5,000 Mana.]**\n\n**[Physical forms updated!]**\n\n**[Status information refreshed!]**\n\n\"Ohhh!\"\n\nAs the advancement completed, the golden radiance condensed inward, absorbed into their bones. When it faded, Grid blinked.\n\nThe chibi skeletons were now... *golden* chibi skeletons. Gleaming. Polished. Where before they'd resembled chewed dog bones, now they looked like miniature sculptures wrought from precious metal.\n\nTheir eyes remained the same, though—those mischievous ⌓ ⌓ shapes that somehow conveyed perpetual mischief.\n\n*...I can't unsee that.*\n\nIt was oddly endearing, actually.\n\n*Well... at least they're cute.*\n\nGrid pulled up their updated information windows.\n\n---\n\n**[Name: Overgeared Skeleton One]**  \n**Class:** Destroyer Skeleton Dancing Smith  \n**Level:** 200  \n**Health:** 25,824 | **Mana:** 160  \n**Strength:** 1,015 | **Stamina:** 450  \n**Agility:** 420 | **Intelligence:** 80\n\n**—Class Skills—**\n\n**[Bone Cracking Lv. 4]**  \nLow probability of destroying bone-based materials (undead, items, structures).  \n**Cost:** None | **Cooldown:** 20 seconds\n\n**[Destroyer Dancer's Blacksmithing Lv. 1]**  \nCraft weapons from 100% bone material. While crafting, *Dancing* and *Skeleton's Patience* activate automatically. Weapons created through this skill triple the success rate of Bone Cracking.  \n**Crafting Time:** 20 minutes  \n**Cost:** Required materials | **Cooldown:** 30 minutes  \n**⚠ Destroyer Nature:** Crafted items may explode during creation, dealing area damage equal to 6x the item's base damage within 10 meters. Overgeared Skeleton One takes damage if caught in blast radius.\n\n**[Dancing Lv. 1]**  \nDance to provoke all enemies within 30 meters.  \n**Success Rate:** 70%  \n**Cost:** None | **Cooldown:** None  \n**Activation Time:** 5 seconds\n\n**—Learned Skills—**\n\n**[Skeleton's Patience]**  \nConditional passive inherited from Legendary Blacksmith's Patience. When triggered, doubles Defense, Strength, and Health.\n\n**[Intermediate Sword Mastery Lv. 7]**  \n*Learned through observation of master's swordsmanship.*\n\n**[Silver Thread...]**  \n*[...Additional skills omitted...]*\n\n---\n\n**[Name: Overgeared Skeleton Two]**  \n**Class:** Restorer Skeleton Dancing Smith  \n**Level:** 200  \n**Health:** 19,000 | **Mana:** 5,000  \n**Strength:** 50 | **Stamina:** 650  \n**Agility:** 220 | **Intelligence:** 1,045\n\n**—Class Skills—**\n\n**[Bone Sticking Lv. 4]**  \nRestores 20% of a skeleton-based undead's health and repairs damaged areas.  \n**Cost:** 1,000 Mana | **Cooldown:** 26 seconds\n\n**[Restorer Dancer's Blacksmithing Lv. 1]**  \nCraft helmets from 100% bone material. While crafting, *Dancing* and *Skeleton's Patience* activate automatically. Helmets gain restoration properties, granting Overgeared Skeleton Two exceptional survivability when equipped.  \n**Crafting Time:** 20 minutes  \n**Cost:** Required materials | **Cooldown:** 30 minutes  \n**⚠ Restorer Nature:** Materials may resist processing by spontaneously regenerating, resetting smelting and forging progress. Manufacturing may need to restart from the beginning.\n\n**[Dancing Lv. 1]**  \n**[Skeleton's Patience]**  \n**[Intermediate Magic Mastery Lv. 7]**  \n*[...Additional skills omitted...]*\n\n---\n\nSix stat points per level. Starting from their base ten per stat and the first-level twenty-point bonus, level 200 should have netted them 1,224 total stat points. Instead, thanks to class advancement bonuses, bone strengthening effects, and the various equipment Grid had crafted for them, their combined stats approached 2,000—comparable to ordinary level 200 *players*.\n\nFraudulent numbers for mere summons. They truly took after their master.\n\nBut that wasn't what gnawed at Grid's mind.\n\n\"This is...\"\n\nHe'd harbored such high expectations after their first advancement. Overgeared Skeleton One creating devastating bone-crushing explosions. Overgeared Skeleton Two unleashing wide-area healing. Instead, reality delivered one skeleton that might accidentally explode its own crafts, and another that might have to restart production indefinitely.\n\n*This is garbage.*\n\nAll his hopes now rested on the third advancement. With the compound descriptor of \"Destroyer/Restorer Dancing Blacksmith Skeleton,\" surely a combat-viable class would unlock then.\n\n—*Perhaps because you're an idiot, your imagination is pathetically limited. Sharing consciousness with you is exhausting. At this rate, my soul will disintegrate from frustration before it recovers.*\n\nBraham's voice cut through Grid's brooding.\n\n\"...What?\"\n\nHow was *he* at fault for Braham's impending death? Grid scowled.\n\n—*Fool. Stop fixating on the blacksmithing aspect. Focus on the provocation skill instead. One skeleton has wide-area provocation combined with explosive damage potential. The other can deploy provocation infinitely. What exactly are you lamenting?*\n\n\"...Ah!\"\n\nUnderstanding crashed over him like cold water.\n\nThe Dancing skill didn't specify enemy *type*. It was area-of-effect. Universal aggro.\n\nUnlike Malacus's Cloak—which didn't affect undead due to their degraded senses and dangerously drew aggro to *Grid himself*—the skeletons' provocation could pull enemies from any category. Better still, as summons, they suffered no death penalty.\n\n*This isn't trash at all.*\n\nA new strategic landscape unfolded before him. The third and fourth advancements might arrive sooner than anticipated.\n\n---\n\n**◇ ◇ ◇**\n\nOne month had passed since the defense of the Evil Eyes Village.\n\nPeak Sword was still a wreck.\n\nVantner watched his guildmate fumble through another hunt with obvious concern. \"Are you still thinking about that knight?\"\n\nThe knight in question—Apollo, young leader of the Gauss Kingdom's Blue Flame Knights. Peak Sword had killed him during the siege, and the act had carved something painful into his psyche. He'd seen himself reflected in Apollo's desperate defense of his homeland. The lonely struggle of a warrior from a weak nation.\n\nPeak Sword hadn't *wanted* to kill him. But the Evil Eyes needed protection. It had been a fair fight. He'd done what was necessary.\n\nYet every time Apollo's face surfaced in his memory, regret followed.\n\n\"...He only had one life.\"\n\nFor players, Satisfy was a game. For NPCs, it was existence itself. No resurrection. No second chances.\n\n\"I'd kill him again if the same situation arose,\" Peak Sword continued quietly. \"I just wish I'd spoken to him before the end. He deserved that much. He was too strong for silence.\"\n\n\"Then next time, say goodbye first.\"\n\n\"...What?\"\n\n\"Greet them. *Then* kill them. Problem solved.\"\n\n\"...\"\n\n\"We're building a kingdom. We're going to fight NPCs—that was inevitable the moment Grid raised his banner. Some of our enemies will be good people. You'll have to cut them down anyway. If you break mentally every time, what then? Will you quit?\"\n\n\"You're right.\" Peak Sword's jaw tightened. \"My resolve was weak. I was short-sighted. From now on... I'll greet my enemies properly before we fight.\"\n\n\"Exactly. Greet them, *then* kill them.\"\n\n\"Right. Yes.\"\n\n\"...\"\n\nThe two men clasped hands solemnly. The Overgeared members watching this exchange could only shake their heads in baffled exasperation. The logic was somehow both touching and completely deranged.\n\nThen—\n\n**&Zednos:** *Explosion in Reinhardt's southern market.*\n\nThe guild chat erupted with activity.\n\n**&Ibellin:** *What happened?*\n\n**&Zednos:** *Agnus showed up. He's causing a scene.*\n\n**&Toon:** *Agnus is HERE? Why? Is he insane?*\n\n**&Jishuka:** *Yes~ He's definitely crazy~*\n\n**&Ibellin:** *(/-_-)* *I'm close. Heading there now.*\n\n*Agnus?*\n\nIn Galgunos Temple, Bullet froze mid-command, his undead and jiangshi pressuring the War God Followers around him. Agnus was unhinged, yes, but never *stupid*. The necromancer always positioned himself to escape when situations deteriorated. Yet here he was, walking into the heart of Overgeared territory where he was an acknowledged enemy...\n\nThis wasn't a rampage. This was something else.\n\n*He's been struggling lately... Did he come here looking for me?*\n\nDamn. Agnus had removed Bullet from his friends list—no way to whisper him. Bullet's concentration shattered. After a moment's hesitation, he recalled all his summons.\n\n\"Huh? What's wrong?\" his party members asked.\n\nBullet scratched his head sheepishly. \"Sorry, but I need to take a break. Been hunting too long.\"\n\n\"You're tired at your level?\"\n\n\"...You dropped from second to fourth in the necromancer rankings, you know.\"\n\nProducing the jiangshi had devoured time he should have spent leveling. Still, even at fourth place, Bullet remained well above the average Overgeared member's level—the necromancer class was simply *that* optimized for hunting.\n\n\"The past is the past. You need to climb back up.\"\n\n\"There's always tomorrow. I'll make it up next time.\" Bullet offered a tight smile. \"I'm heading out.\"\n\nBefore anyone could protest further, he crushed a Return Scroll.\n\nHe felt a pang of guilt toward his guildmates—they'd welcomed him without hesitation, treated him like an old friend rather than a former rival. But some debts transcended guilds. Bullet had given his heart to Agnus once, back when the mad necromancer was still his idol.\n\nAnd Bullet never abandoned someone he'd pledged himself to.\n\nThat was simply who he was."
}