{
  "id": 987,
  "title": "Chapter 986",
  "content": "By the time Bullet reached the collapsed inn, a crowd had already formed. Overgeared Shadows worked methodically through the rubble while Sticks examined scorched earth and splintered wood. Dozens of soldiers kept curious onlookers at bay. Lauel stood apart from the chaos, one hand covering half his face in contemplation.\n\nThe soldiers parted to let Bullet through. As he surveyed the destruction, his face drained of color. The distinctive burn patterns of Dyulebul's light ray scarred the walls and floor—unmistakable evidence of Agnus' involvement.\n\n*But he didn't start this,* Bullet told himself. *He couldn't have.*\n\nHe strode toward Lauel. \"Someone attacked Agnus first. He wouldn't cause trouble here—not in the Overgeared Kingdom.\"\n\nLauel's eyebrow arched. \"And what evidence supports that claim? Agnus is a madman. Unpredictable. He led Immortal before its collapse—you think he doesn't resent what happened? This kingdom had a hand in that. He has every reason to strike at us.\"\n\n\"Agnus isn't stupid.\" Bullet's voice grew heated. \"And Immortal means nothing to him. Veradin built that guild. Veradin hunted him down. Agnus never cared about Immortal itself.\"\n\n\"Then perhaps you should learn the facts before rushing to his defense.\"\n\n\"...!\"\n\n\"You're a member of Overgeared now. Why are you playing advocate for our enemy?\"\n\n\"I—I'm sorry!\" Bullet's head dropped, shame flooding through him. \n\n*What am I doing?* The realization hit like cold water. He'd been so worried about Agnus that he'd skipped the most basic step—simply asking what had actually happened. His concern had blinded him to everything else.\n\n*Grid trusted me.* Despite Bullet's past with Immortal, Grid had forgiven him. Given him the Jiangshi Production method. How must this look to Grid and the others, who considered Agnus an enemy? Bullet couldn't bring himself to lift his head.\n\n\"Please be more careful in the future.\"\n\n\"I will. I promise.\"\n\nIn truth, Lauel felt neither anger nor disappointment. He'd known from the start that Bullet wore his heart on his sleeve—that was precisely why Grid had accepted him into the guild. Old loyalties died hard. Still, Bullet needed to learn when to set emotion aside and think strategically.\n\nLauel's tone softened. \"We failed to apprehend Agnus.\"\n\n\"He escaped?\" Bullet's head snapped up in disbelief. \n\nImpossible. This was the heart of the Overgeared Kingdom—completely secured, crawling with guards and monsters lurking in every shadow. Even Grid himself couldn't have forced his way out. How could Agnus?\n\nLauel shook his head. \"He didn't escape. Someone took him.\"\n\n\"Took him? But—\" The pieces clicked into place. \"The seven kingdoms. He's wanted by all of them.\"\n\n\"Precisely.\"\n\n\"T-Then Agnus—\"\n\nThe full picture emerged in Bullet's mind: Agnus, hunted and homeless, taking refuge in hostile territory out of sheer desperation. And his pursuers tracking him here, striking when they found him.\n\n*Agnus...*\n\nBullet bit his tongue, stopping himself from saying more. Lauel noticed the struggle and sighed internally.\n\n*Agnus has that effect on people.* \n\nIn the early days, Grid had been branded trash by most of the player base—sharp-tongued, poisonous, difficult. Yet his guildmates trusted him absolutely. Perhaps Agnus possessed that same quality—something you couldn't understand without experiencing it firsthand.\n\n\"Do you know where they took him?\"\n\n\"Why do you want to know?\"\n\n\"I—well, I just—\"\n\n\"If you're planning a rescue attempt, abandon that idea now. The seven kingdoms' armies will be guarding him, including some of their finest warriors.\"\n\nAs a necromancer and Jiangshi maker, Bullet excelled in large-scale battles. But against seven kingdoms? An ant challenging an elephant. He knew it was futile. He'd never harbored any fantasy of rescuing Agnus singlehandedly.\n\nBut—\n\n\"I want to help him somehow.\"\n\nHe wanted Agnus to know that someone was fighting for him. That despite past betrayals and suffering, he wasn't alone anymore.\n\n\"I need to show him... that someone cares. That someone's standing with him.\"\n\nWatching Agnus suffer in isolation hurt more than Bullet could articulate. If he could ease that pain, even at cost to himself—\n\nLauel's expression remained cold. \"Out of the question. Have you forgotten your allegiance? If you involve yourself, relations between the Overgeared Kingdom and those seven kingdoms become irreparable.\"\n\n\"Then I'll leave the guild temporarily. I won't use jiangshi. Nothing that could connect me to Overgeared or harm Grid in any way.\"\n\nBullet liked both the Overgeared Guild and Agnus. His gratitude toward those who'd offered friendship and acceptance ran deep. There was no pretense in his words—he genuinely intended to fight alone, risking everything himself.\n\nStill, Lauel's voice remained ice-cold. \"Do you think the Overgeared Guild is some kind of joke? That you can leave and return at your convenience?\"\n\n\"...\"\n\n\"I understand your feelings completely. But you need to remember what you are now—an Overgeared member. Why do you think Grid gave you the Jiangshi Production method? Because he wants you to grow strong and become an asset to this guild. And now you're planning to throw your life away? That's spitting on his generosity.\"\n\n\"...\"\n\n\"The moment you joined Overgeared and received that production method, you accepted responsibility. Don't abandon that responsibility for personal sentiment.\"\n\nLauel felt the waste of it himself. He pitied Agnus. The man's power could be invaluable. But Lauel wasn't in a position to act on those feelings. Since it was impossible, better to let go.\n\nBullet's shoulders sagged. \"If we could just clear his name—prove the charges are false—\"\n\n\"Can you prove they're false? How can you be certain Agnus didn't kill those people?\"\n\n\"I'm certain. Agnus might kill the strong, but I've never seen him harm the weak. Remember what happened with Elizabeth? He needs an accessory maker. Why would he make himself the enemy of every accessory maker on the continent?\"\n\nLauel had considered that angle as well, but something was still missing. \"Do you have any idea who the real culprit is? Can you point to a suspect?\"\n\n\"The Yatan Church.\"\n\nSomething sparked in Lauel's mind—a new possibility crystallizing.\n\n\"Agnus helped Queen Irene and Prince Lord attack the Vatican. He had a symbiotic relationship with Yatan's Church, yet he aided their enemies. That's betrayal in their eyes.\"\n\n\"...\"\n\n\"The Yatan Church has been struggling for a decade—some enigmatic figure has been making their lives difficult. Then Yura's betrayal a few years back. They're paranoid about traitors now. I think they decided to make an example of Agnus. Frame him, punish him publicly.\"\n\n\"Hrmm...\" A plan began forming in Lauel's mind.\n\nThey could help Agnus while simultaneously solving a problem that had been nagging at him. He turned to Faker. \"What's Rose's current location?\"\n\n\"We're closing in. Found several traces of her movements. Should have her pinpointed soon.\"\n\nRose—the second-ranked black magician after Yura's defection, now one of Yatan's Servants. She'd helped summon the 32nd Great Demon Belial. She'd been among the leaders who raided the Vatican last year. From the Overgeared Kingdom's perspective, Rose needed to face justice. Grid and his guild had no intention of forgiving her attempted harm against Irene and Lord. The hunt had continued relentlessly.\n\n\"Give me a moment.\"\n\n\"...?\"\n\nLauel kept Bullet and Faker waiting while he opened his whisper interface. Several minutes passed in silence.\n\nFinally, Lauel swept his silver hair back with a grin. \"Bullet, I have a better solution.\"\n\n\"What is it?\" \n\nAfter waiting anxiously, Bullet's nerves were frayed. When Lauel remained silent, a guild notification suddenly appeared:\n\n> **[Guild Master 'Grid' has issued a kill order on player 'Rose.']**\n\n\"What—?\"\n\n\"We'll threaten her into revealing the truth,\" Lauel explained calmly.\n\nIf one of Yatan's Servants publicly testified that the Yatan Church had framed Agnus, his name would be cleared.\n\n***\n\n*This makes us even for helping Lord and Irene.*\n\nOn the first underground floor of Galgunos Temple, Grid issued the kill order and felt a weight lift from his chest. Owing that bastard Agnus had gnawed at him. Now he could settle the debt and punish Rose at the same time—exactly what he'd wanted anyway.\n\n*Win-win.*\n\nGrid turned his attention back to the Overgeared Skeletons, who were currently collecting bone fragments from defeated enemies. The real challenge lay ahead.\n\n*Choosing production methods.*\n\nObviously, Overgeared Skeletons One and Two would eventually need their own weapons and helmets—equipment tailored to their attributes that would let them demonstrate their full potential.\n\n*Which means they need the best production methods available...*\n\nBut there was a significant problem. The skeletons could only learn one production method each. Teaching them top-tier methods meant requiring rare, difficult-to-obtain materials. \n\n*They won't be able to smith often, and their skills will sit unused most of the time.*\n\nOn the other hand, if he taught them production methods using common, easily-acquired materials, the resulting equipment would be mediocre at best.\n\n*Need to find the right balance.*\n\nHe required production methods with reasonably accessible materials that still produced excellent results—quality without excessive rarity.\n\n\"...Hmm?\" \n\nGrid's gaze fixed on the Overgeared Skeletons' sturdy bone structure. He stared at them with such intensity that the dancing skeletons froze mid-twirl, startled by his sudden scrutiny."
}