{
  "id": 988,
  "title": "Chapter 987",
  "content": "# Chapter: The First Anniversary\n\nGrid ran his fingers across the golden bones of the Overgeared Skeletons, testing their density. Not even a hollow tap—these weren't ordinary remains. Dense, hardened through countless battles, they felt more like tempered metal than calcified tissue.\n\n*If I could forge weapons from these...*\n\nBone traditionally made for exceptional cutting edges, sharper than most metals when properly worked. The trade-off had always been durability—bone shattered, chipped, wore down too quickly for sustained combat. But the Overgeared Skeletons defied conventional limitations. Their frames had absorbed and integrated the remains of Galgunos' skeleton soldiers, creatures that had exceeded level 350. The material classification alone placed them in the blue orichalcum tier, and that was just the beginning. Stronger undead existed. Tougher bones waited to be harvested and absorbed.\n\nThe real advantage? Overgeared Skeleton Two's restoration abilities meant infinite supply. Extract bones, forge items, let them regenerate. A perpetual resource.\n\n*Too perfect.*\n\nWhich meant there had to be a catch.\n\n*One of my Creation slots.*\n\nThe Legendary Blacksmith's Creation skill had strict limitations. Only three methods could be invented at a time, and no existing blueprint covered items forged from living undead bone. He'd have to pioneer the entire crafting process from scratch, burning one of his most precious resources on theoretical potential.\n\n*But if the bones continue to strengthen as they absorb more powerful remains...*\n\nThe investment could compound exponentially. Grid rubbed the smooth skulls of his two skeletal companions, who shifted nervously under his contemplative touch.\n\nA blue notification materialized before his eyes.\n\n> **[You have five minutes remaining in your daily access time.]**\n\nOne month of relentless hunting. Sixteen hours a day in-game, every day, driving his level forward at a pace that left other players scrambling to keep up. The secret wasn't just natural talent—it was rigid discipline. Eight hours of sleep, no more. Structured meals. Regular exercise to keep his body from deteriorating in the real world. A routine he'd maintained for years now, the habits carved so deep they'd become part of his identity.\n\nGrid logged out.\n\nShin Youngwoo emerged from the capsule like a man surfacing from deep water, every muscle screaming exhaustion. His bed called to him, promising unconsciousness until morning, maybe longer. The demon king subjugation had drained something fundamental from him—not just energy, but drive. The aftermath had left him hollow, going through motions, running on fumes.\n\n*Dangerous.*\n\nHe couldn't afford complacency. Every moment he wasted, his competitors gained ground. The gap he'd carved out through blood and sweat could vanish in weeks if he let his guard down.\n\nYoungwoo slapped his cheeks—hard—then stumbled to the bathroom. Cold water shocked his system awake. Simple calisthenics followed, pushing his protesting body through the movements until his heart rate elevated and clarity returned. Shower. Fresh clothes. Winter coat.\n\nToday marked one year since Khan's death. In Satisfy's accelerated timeline, three full cycles had passed. He'd visited the grave every time, maintaining it, paying respects. But here in the real world, there was only one way to commemorate the man who'd changed everything.\n\n*A drink.*\n\nThe elevator chimed as it descended, stopping one floor below his penthouse. Toon stepped in immediately, coat already in hand, reading the situation before Youngwoo could speak.\n\n\"Going somewhere?\"\n\n\"Getting a drink.\"\n\n\"I'll come with you.\"\n\nYoungwoo waved him off. \"Alone tonight.\"\n\n\"No.\" Toon's expression left no room for negotiation. \"If you want to drink alone, I'll sit at another table. Keep my distance.\"\n\nDespite everything—despite the fame, the connections, the entire guild at his back—Toon still saw what others missed. Youngwoo remained fundamentally alone, the same isolated person he'd been before the legendary class, before the fortune and fame.\n\nYoungwoo managed a tired smile. \"I appreciate it, but tonight I need the space. I'm safe here, at least. South Korea treats me like a hero.\"\n\nToon studied him, recognizing the determination in his eyes. *Khan's first anniversary. He needs this.*\n\n\"Separate cars, then. I'll follow at a distance. That's my final offer.\"\n\n\"...Alright.\"\n\nIn the underground parking garage, they climbed into different vehicles. Youngwoo's modest five-year-old sedan pulling out ahead of Toon's luxury car—a contrast that turned heads as they hit the street.\n\n***\n\nRose moved fast.\n\nAs the first-ranked black magician and an official of the Yatan Church, she understood leverage. Her position gave her influence, her abilities commanded respect, and her appearance—striking enough to make her recognizable—provided a platform. She'd cultivated popularity among the ranker community carefully, and now she weaponized it.\n\nThe television interview hit every major network.\n\n\"A guild—one of the strongest in the world—is targeting me specifically. Just me. One person.\" She leaned forward, letting vulnerability show in her expression. \"What am I supposed to do? Abandon everything I've worked for? Quit Satisfy? And what happens to the next person who crosses the Overgeared Guild? How long before this indiscriminate violence comes for someone else? Someone like you?\"\n\nThe response was immediate and explosive.\n\nPublic opinion turned on Grid overnight. The optics were devastating—a massive organization crushing an individual player. It didn't matter what she'd done. Groups suppressing lone individuals always looked tyrannical, and Rose had framed it perfectly. The masses identified with the powerless target, not the influential aggressor. \n\n*They see themselves as potential victims,* Lauel observed, watching the social media firestorm spread. *They're applying pressure preemptively, trying to restrain us before we become a threat to them personally.*\n\nThe Overgeared Guild responded within hours.\n\nHuroi, serving as official spokesman, released a statement through every major channel:\n\n\"Rose is one of Yatan's Servants. In that role, she has slaughtered countless players and NPCs. That's her right—it's part of the game, and we wouldn't normally take issue with it. But when Overgeared members and citizens suffer directly from her actions? That changes everything. She has the right to act, and we have the right to respond. This isn't oppression. It's accountability. The Overgeared Guild will have its revenge. She will answer for what she's done to our people.\"\n\nThe counter-narrative took hold. Revenge, not bullying. Justice, not tyranny. Rose's body count as a Yatan Servant was extensive and well-documented. Support groups formed overnight, defending the Overgeared Guild's position.\n\nBut not everyone was convinced.\n\nThe forums exploded:\n\n*—Overgeared dogs at it again*\n\n*—Look at them monopolizing vampire cities*\n\n*—Their whole country profits from hunting grounds only they can access*\n\n*—They swept the National Competition rewards too. Having a feast on everyone else's suffering*\n\n*—What bullshit. They won those rewards through strength. The hunting grounds are in their territory—why wouldn't they control access? Should they just let everyone flood in until nothing spawns?*\n\n*—Funny seeing people curse Overgeared for succeeding through their own efforts*\n\n*—\"Their efforts\" lol. More like everyone else's suffering*\n\n*—Remember what Katz was like before joining Overgeared? What happens if someone wants revenge on him now? Instant kill order, right?*\n\n*—Peak Sword goes nuclear every time someone mentions race. Human garbage*\n\n*—My group asked Pon to stop making fun of Vantner's baldness and got completely ignored...*\n\n*—What group?*\n\n*—National Baldness Association*\n\n*—...*\n\n*—Overgeared can't be allowed to continue like this. One day they'll control everything*\n\nThe anxiety was real, cutting deeper than simple envy. Primitive fear—the kind that emerged when power concentrated too heavily in one place. An inevitable response, regardless of how carefully the guild managed public relations.\n\nLauel remained unfazed. This was familiar territory.\n\n\"Don't engage with public opinion,\" he advised Huroi. \"Just maintain our position. We're punishing Rose regardless of what anyone thinks.\"\n\nThe strategy was psychological. Apply constant pressure until Rose cracked.\n\nShe recognized the play immediately and reached out. The friend request came through Lauel's interface within hours.\n\n—*Why are you doing this? Is this about the Vatican?*\n\n—*Yes. Our queen and prince were endangered because of your actions. That's not something we can overlook.*\n\n—*I didn't know they'd be there! It was just a quest! I wasn't even leading the attack—why am I being held responsible?*\n\n—*You didn't know the Overgeared Kingdom's royal family would attend the pope's reelection ceremony? You're unaware of the relationship between the pope and our kingdom?*\n\nLauel cut through her excuses with surgical precision, offering a simple choice:\n\n—*Be hunted forever, or testify about Agnus being framed and clear up the relationship between him and our guild. Pick one.*\n\n—*Agnus? Did he join Overgeared? No, that's impossible. Are you covering a debt because he helped the queen and prince?*\n\n—*Just give me an answer.*\n\nRose wasn't easy prey. She'd survived as a high ranker by finding angles, exploiting gaps, reading between lines. As one of Yatan's Servants, she had the potential to become a named NPC under the right conditions—betraying the church would be suicide.\n\n—*No. I refuse.*\n\n*What happens if I turn on the Yatan Church? I can't flee to hell like Yura did.*\n\n—*You'll regret this.*\n\n—*We'll see. I'll post a video every time you come after me. Watch public opinion turn. The Overgeared Guild will be isolated before you know it.*\n\nTough talk. Lauel smiled at his screen.\n\n***\n\nYoungwoo found a quiet street stall tucked away from the main roads. He'd learned to avoid crowds these days—fame made privacy impossible in popular areas.\n\n\"Oh my! Welcome, welcome!\" The owner recognized him immediately, flustering with excitement. \"I wasn't expecting such an important guest. I hope our humble food is good enough—\"\n\nYoungwoo settled onto a stool, offering a genuine smile. \"Five years ago, I couldn't afford instant noodles. This is perfect. Bottle of soju and chicken feet, please.\"\n\n\"Really? Ah, that's right! I heard you built everything yourself. It's amazing at your age!\"\n\n\"I got lucky.\"\n\n\"Luck is nothing without the ability to seize it. That's all you, young man.\"\n\nThe owner's warmth eased something tight in Youngwoo's chest. The soju arrived moments later, clean glass and familiar bottle. He poured carefully, watching the clear liquid catch the light.\n\nThe smell of alcohol hit him, sharp and immediate, dragging him back to the first day he'd met Khan. The old man had reeked of it—not pleasant social drinking, but the desperate, constant consumption of someone trying to drown unbearable pain. His wife and son both gone, leaving him alone in the world.\n\n*How did he survive that?*\n\nThe weight of that solitude, that despair—Youngwoo couldn't even imagine it properly. Yet Khan had endured. More than that, he'd eventually stopped drinking, pulled himself together despite the shaking hands and withdrawal. Youngwoo had laughed at him back then, watching a master blacksmith unable to hold his own hammer steady.\n\n*Such an ass I was.*\n\nBut Khan had persevered, teaching everything to a clueless novice who barely understood the basics of crafting.\n\n*I hope you're happy now.*\n\nKhan had died alone in one sense, but if souls existed, if heaven was real, he'd reunited with his family. Youngwoo had to believe that. Every glass he emptied was a prayer for that belief to be true.\n\nTime passed in a haze. The chicken feet went cold, untouched. The complimentary cucumber garnish dried out on the plate. Three empty soju bottles stood sentinel beside his glass.\n\n*Already time to go.*\n\nHe wanted to linger in memories of Khan, but the schedule wouldn't allow it. Tomorrow's routine demanded sleep, recovery, discipline. Youngwoo raised his final glass toward the night sky.\n\n*Next year. I'll drink with you again next year.*\n\nDid souls persist after death? No definite answer existed, but people mourned anyway, remembered anyway, honored the dead again and again. Youngwoo did the same for Khan.\n\nThe last glass emptied.\n\nAs Youngwoo stood, a voice cut through the quiet: \"Scumbag.\"\n\nFour men in their mid-twenties, drunk and belligerent, watching him with ugly expressions.\n\n\"Setting kill orders, making people's lives miserable... You just want to throw your weight around, right? Real piece of work.\"\n\nYoungwoo ignored them, pulling out cash and handing it to the stall owner with a polite bow. \"I'm sorry for the trouble. Could you pack up the leftovers?\"\n\n\"Of course, of course!\" The owner scrambled for containers, desperate to prevent a confrontation.\n\nNew customers arrived, filing in as the four men rose and surrounded Youngwoo.\n\n\"Look at this tough guy. Making millions and still packing up leftovers? If I had your money, I'd throw it to stray dogs. But you're here playing the humble hero.\"\n\n\"That's Grid!\"\n\n\"Holy shit, it's actually him!\"\n\nThe new arrivals pulled out phones immediately, pretending to take pictures while recording video. Satisfy's greatest player in a drunken argument at a street stall—the scandal would be massive.\n\n\"Hey. Are you ignoring us? When someone talks to you, you should respond. Just once.\"\n\n\"This asshole must be scared. If we were in the game, you'd slap a kill order on us, right? Huh?\"\n\n\"Let's see it. Pagma's Swordsmanship! Ha! Ha!\" The man made exaggerated slashing motions, mocking Grid's signature techniques.\n\n\"Pahahaha! This is hilarious!\"\n\nYoungwoo remained still, but the crowd saw cowardice. The four men circled closer, imitating sword techniques, building momentum. One of them, swept up in the energy, crossed the line—swinging a soju bottle at Youngwoo's head.\n\n\"Young man, no!\"\n\nThe owner lunged forward, trying to intervene. The filming spectators gasped.\n\n\"...Hm?\"\n\nYoungwoo's hand intercepted the bottle mid-swing, fingers wrapping around glass without visible effort. He placed it gently on the table, then raised his other hand toward the men surrounding him. The motion was casual, unhurried—but fast enough that the men flinched backward.\n\nNo punch came.\n\nInstead, Youngwoo's palm settled against each man's cheek in turn, a soft tap more than a strike.\n\n\"Ungh...\"\n\nFour grown men crumpled to the ground, legs giving out beneath them.\n\nThe stall fell silent. The owner, the filming spectators—everyone stared like they'd witnessed something impossible. It wasn't a slap. Barely qualified as contact. Yet all four men lay collapsed, struggling to rise.\n\n\"Thank you for the meal. Prosperity to your business.\"\n\nYoungwoo collected his packaged chicken feet, bowed deeply to the owner, and walked out. Toon waited by the stall entrance.\n\n\"Lauel's work?\"\n\n\"...\"\n\nThe setup was obvious in hindsight. The men positioned perfectly to start trouble just as Youngwoo finished. The convenient spectators with phones ready. The specific emphasis on the Rose situation, the mockery of his frugality—all calculated.\n\n\"Image management.\"\n\nThree hours later, the video titled \"Grid Defeats Four Men Without Fighting\" hit number one globally. Comments poured in, dissecting every second:\n\n*—Guy suffers a one-sided verbal assault and doesn't retaliate. What kind of person does that? What did Rose do to earn a kill order?*\n\n*—Has Overgeared ever issued a kill order before? Only once—against Immortal, for murdering their blacksmiths. Rose is the first since then.*\n\n*—She must've done something truly heinous*\n\n*—Look at Grid bowing 90 degrees to the stall owner*\n\n*—God Grid even packed up the chicken feet...*\n\nThe Patriotic Society's elite team—fluent in four languages minimum—flooded forums worldwide, carefully steering conversations. Public opinion shifted decisively. Rose's defenders vanished overnight.\n\nShe recognized defeat quickly.\n\n—*...I'll clear Agnus' name. But it has to be secret—if the Yatan Church discovers I've betrayed them...*\n\n—*Three days. Not a minute more.*\n\n—*That's not enough time to—*\n\n—*No negotiation.*\n\n—*...Fine. I'll make it work. Just lift the kill order.*\n\nMaking an enemy of the Overgeared Guild was suicide. She'd known it intellectually, but pride had clouded judgment. Now reality had reasserted itself.\n\nInwardly, Rose sharpened her metaphorical knife. Soon she'd summon a new great demon with Prince Benoit's assistance. The Overgeared Kingdom would learn the price of forcing her hand."
}