{
  "id": 990,
  "title": "Chapter 989",
  "content": "\"Euphemina!\"\n\n\"Why would she defend Agnus?\"\n\n\"Wait—framed? Is she serious?\"\n\nThe tens of thousands packed into the square swiveled their attention from the condemned man to the woman who'd spoken. On the elevated platform behind the guillotine, the noble observers from seven kingdoms exchanged puzzled glances.\n\n\"The Yatan Church?\" One leaned forward. \"Who is this woman?\"\n\nThe hunter who'd encountered Euphemina days earlier supplied the answer. \"Earl Euphemina of the Overgeared Kingdom.\"\n\nSeveral observers stiffened. Others scoffed outright.\n\nThe reason for their hostility was simple: the Overgeared Kingdom represented everything they feared. A rebellion that had toppled an ancient bloodline. A symbol of the very chaos every noble on the continent worked tirelessly to suppress. Worse, at the Overgeared Kingdom's founding ceremony, most of these observers' nations had suffered humiliating defeats. The Violet Kingdom's grudge ran particularly deep—one of their barons had been cut down by a common Overgeared *soldier*. As for Gauss, they'd been enemies with Overgeared for far longer.\n\nEarl Chuck of Gauss rose, his face flushed. \"How dare you disrupt another nation's lawful execution! Are you people so uncivilized you don't even understand basic protocol?\"\n\nEarl Dolce of Violet sneered from beside him. \"Look at her, defending a murderer. Makes my skin crawl. I suppose when your kingdom is *founded* on rebellion, you grow comfortable with killers.\"\n\nThe other observers said nothing, but their expressions mirrored the sentiment. Not one glanced at the Yatan follower Euphemina held. The truth didn't interest them—only control did. A criminal needed to be punished. The crowd's fury needed a target. Blaming a shadowy church wouldn't satisfy anyone. Better to execute the man already in chains and be done with it.\n\nEuphemina's voice cut through the murmuring. \"I'll say this once more.\"\n\nEvery eye turned to her. She stood unbowed beneath the weight of noble scorn, her posture radiating the quiet confidence of someone who'd inherited Mumud's vast magical legacy.\n\n\"Agnus was framed. The true culprits behind the craftsmen's murders are the Yatan Church.\" She gestured to the robed figure beside her. \"Tell them.\"\n\n\"Of course.\" The follower's compliance was immediate, his blank expression masking Rose's presence within. She wanted this tedious charade finished—her real body lay vulnerable elsewhere, hidden but helpless while she occupied this meat puppet. \"Everything she said is true. We killed the craftsmen. We framed Agnus for it.\"\n\n\"Why?\" someone shouted.\n\n\"Agnus betrayed us. The Yatan Church doesn't tolerate traitors.\"\n\nEarl Beoris, the most senior observer present and a prominent noble of Glaucia itself, folded his arms. \"That proves nothing. How do we know you're genuine?\"\n\nEuphemina didn't hesitate. She yanked the follower's hood down, exposing the crimson horseshoe brand seared into his forehead. The tattoo of a Yatan priest—impossible to forge, impossible to fake, engraved with profane magic that left no room for doubt.\n\nEarl Beoris and the Ark Kingdom's representative both paled. The remaining five observers, however, didn't even blink.\n\n\"Insufficient evidence,\" one declared flatly. \"A single testimony doesn't prove the Church's involvement. The execution will proceed.\"\n\nSilence crashed over the square.\n\nThen the crowd *erupted*.\n\n\"Finally!\"\n\n\"Kill him! Kill Agnus!\"\n\nThe chant swelled, a tide of bloodlust washing over reason. These weren't Agnus's victims—the necromancer couldn't possibly have harmed this many people personally. No, these were ordinary citizens intoxicated by schadenfreude. The downfall of someone powerful, someone infamous, was entertainment. A wicked man's misery required no sympathy.\n\n\"Cut off his head!\"\n\n\"KILL AGNUS! KILL AGNUS!\"\n\nStanding motionless at the guillotine, Agnus watched the frenzy with cold detachment.\n\n*Of course,* he thought. *Humans never change.*\n\nEvil. That was humanity's core—not something civilization taught them to overcome, but their true nature, barely restrained by laws and customs.\n\n*That's why—*\n\nHis eyes flicked to the quest window hovering before him.\n\n*—I'll become something worse.*\n\nThe only way to survive this world was to be crazier than everyone else.\n\n[Quest Accepted.]\n\n[All restrictions lifted by the power of Great Demon Baal.]\n\n[Stats restored to full strength.]\n\n[All skills unlocked.]\n\nThe chains binding his wrists suddenly felt like tissue paper. He could snap them effortlessly. But Agnus remained still, his golden eyes locking onto a single figure in the crowd.\n\nBullet.\n\nThe fool who'd been manipulated into joining Immortal. The idiot who'd been used and discarded and somehow still hadn't learned.\n\nThat idiot was now standing beside Euphemina, shouting at the mob. \"Are you deaf?! Agnus isn't the killer! He told you himself!\"\n\nNo mention of Euphemina's witness. Why bother? Bullet believed Agnus's word alone was enough.\n\n*Stupid. Stupid to the bitter end.*\n\nSomething unfamiliar stirred in Agnus's chest—an emotion so foreign he couldn't identify it, couldn't remember ever feeling it before. It made his jaw clench.\n\n*Why trust me? I'm not worth it. I'm wicked. I'm alone. I should be alone. So why—*\n\n\"Who the hell are you?!\" an observer bellowed.\n\n\"A necromancer of the Overgeared Kingdom!\"\n\nThat sealed it. The observers shot to their feet, faces purple with rage.\n\n\"Treason! The Overgeared Kingdom has declared itself our enemy!\" Earl Chuck jabbed a finger at Euphemina and Bullet. \"Seize them! They're obstructing justice!\"\n\nThe hunters moved as one, leaping from the platform.\n\nAnd that's when Agnus started screaming.\n\n\"Kuuack! *Kuaaaaah!*\"\n\nThe entire square froze. Hundreds of thousands of players recording the execution swung their cameras toward the guillotine. Agnus thrashed against his restraints, eyes bulging, veins standing out like cords.\n\nEvery person watching—in person or through streams—felt their blood run cold.\n\nThose eyes.\n\nPure. Unfiltered. *Madness.*\n\nThe chains shattered.\n\nThe handcuffs exploded.\n\nThe executioner's head burst like a rotten fruit. Before the corpse hit the ground, it jerked upright as a skeleton soldier, fresh bone gleaming white.\n\nThe crowd that had been howling for blood moments ago now stampeded backward, terror replacing their righteous fury.\n\nThe hunters, though, kept moving. Agnus was one man. They'd deal with him *after* they secured the troublemakers from Overgeared—\n\nLaughter erupted behind them.\n\n\"*Kahahahat!* GET LOST!\"\n\nA death knight materialized at Agnus's side. Their blades moved in perfect synchronization, scything through the hunters' formation. Those who dodged found themselves caught in Mumud's spellwork—the lich had anticipated their every move.\n\n\"Keok—! Cough!\"\n\n\"How is he this *strong*?!\"\n\nThese hunters had captured Agnus in the Overgeared Kingdom, but only after he'd been weakened from fighting dozens of their predecessors. They'd never faced him at full power.\n\n\"Regroup!\" The hunters scrambled to their feet, abandoning Euphemina and Bullet to focus entirely on Agnus—\n\nWho promptly ignored them and lunged at Euphemina and Bullet instead.\n\n\"*You two—I'll kill you!*\"\n\n\"A-Agnus?!\"\n\n\"*DIE!*\"\n\nHis blade punched through Euphemina's guard and into her stomach. Bullet took a similar strike, staggering backward.\n\n\"We're trying to *help* you!\" Bullet screamed.\n\n\"SHUT UP! *SHUT UP!* Kihat! Kuahahahat!\"\n\nReason didn't exist here. Agnus, his death knight, and his lich became a whirlwind of steel and sorcery. Swordwork spun out like spider silk. Destructive magic hammered down like artillery. Dozens of players caught in the assault died screaming. The Yatan follower—the only real evidence of Agnus's innocence—collapsed and rose as another skeleton in Agnus's growing army.\n\nAgnus was *relentless*. He ignored the hunters, ignored the soldiers, focused every ounce of his fury on Euphemina and Bullet.\n\nHad he truly lost his mind?\n\nEuphemina parried another strike, her movements mechanical—then froze.\n\nAgnus's face.\n\nEvery time his blade found flesh, every time Bullet or Euphemina cried out, Agnus's expression twisted. Not with satisfaction. With *agony*. Like each wound he inflicted tore through his own heart first.\n\n*...He's putting on a show.*\n\nUnderstanding crashed over Euphemina. Agnus was severing the connection between himself and the Overgeared Kingdom. If he attacked them publicly, viciously, the seven kingdoms wouldn't see Overgeared as his ally. They wouldn't declare war.\n\nHe was choosing isolation. Again.\n\n\"Bullet!\" Euphemina grabbed the younger man's arm. \"We're leaving!\"\n\n\"What?! What about Agnus?!\"\n\nThis wasn't the plan. Lauel had arranged for Pope Damian to arrive and validate the Yatan follower's confession, to force the seven kingdoms to acknowledge the truth. Instead, Agnus had thrown himself off the guillotine and made everything infinitely worse.\n\nOr had he?\n\nAgnus's sword found Bullet's chest. The death knight Bullet automatically summoned took the blow—only for Agnus's death knight to obliterate it a heartbeat later. Then Agnus's blade pressed against Bullet's throat.\n\n\"Agnus...\"\n\n\"Die. *Kukuk.*\"\n\nSomething flickered in Agnus's eyes. His mouth opened as if to speak—\n\nBut Bullet crumpled first. Not from the shallow cut. From heartbreak. Just like when Immortal fell apart, Agnus had rejected him again. The pain was worse than any wound.\n\nAgnus turned away.\n\nTurned toward the hunters and soldiers, alone against hundreds.\n\n\"All of you...\" His grin was a death's-head leer. \"You think you've only got one life? *Kik, kikik!*\"\n\nEvery person facing him—hunters, soldiers, even the noble observers—felt it. The bone-deep certainty that Agnus *would* kill them eventually. Not today. But someday.\n\nThe square descended into chaos. The mad necromancer and his skeletal legion tore through NPCs and players alike, indiscriminate, merciless.\n\nHe'd become exactly what they'd accused him of being.\n\nLauel's voice whispered into Euphemina's and Bullet's ears through party chat. *We've made our support for Agnus clear enough. Mission accomplished. Return to the Overgeared Kingdom immediately.*\n\nIn his command center, Lauel smiled.\n\nEverything had gone perfectly."
}