{
  "id": 991,
  "title": "Chapter 990",
  "content": "**\"Poor lamb.\"**\n\nFrom a mansion overlooking the execution square, Lauel watched the chaos unfold. Hidden among the crowd, he observed Agnus' breakdown with satisfaction—though not for the reasons any bystander might think.\n\nPerfect. The madman had played his part beautifully.\n\nBy attacking Euphemina and Bullet, Agnus had severed every tie to the Overgeared Kingdom. His declaration to slaughter players and oppose seven kingdoms alike transformed him from a potential ally into something far more valuable: a living catastrophe that would plague their enemies instead.\n\n'Almost as useful as Grid or Faker,' Lauel mused, already composing the retreat orders he'd send to Euphemina and Bullet via whisper.\n\nBullet's message came back immediately—the man wanted to try reasoning with Agnus one more time. Lauel ignored it.\n\nSentiment was a luxury he couldn't afford. Not when tens of millions of lives depended on the choices he made for the Overgeared Kingdom. Others might call him a villain for it. They might be right. Conscience was an expensive indulgence for someone carrying his burdens.\n\n\"Hard life,\" he murmured, allowing himself a moment of genuine regret as he watched Agnus disappear into the crowd, consumed by his own demons.\n\nHe remembered the day Grid had entrusted everything to him. *Leave it all to me. You just do what you want.*\n\nThat oath still bound him. Even when his decisions drew blood. Even when they shattered someone's last hope.\n\n'I'm doing my best for Grid and the Overgeared Kingdom.'\n\nThat would have to be enough.\n\n***\n\n**『Breaking: Agnus' massacre continues. Yesterday's execution square incident leaves the notorious necromancer more isolated than ever...』**\n\nThe news droned from the television screen.\n\nShin Youngwoo crumpled the newspaper in his fist, fresh from his morning run, sweat still cooling on his skin. The headline screamed at him from the wrinkled paper.\n\n**[COLUMN: The Overgeared Guild's Failed Courtship]**\n\n*Nervous about the expiring imperial truce, the Overgeared Guild attempted to recruit the infamous Agnus through predictably dramatic means. Euphemina appeared at his execution like something from a storybook, claiming his innocence.*\n\n*It backfired spectacularly. The Glaucian observers dismissed her testimony. Then Agnus broke free and attacked her—rejecting salvation like a starving, toothless lion too proud to drink another animal's milk. The rampage lasted over an hour...*\n\nEvery news outlet was running the story.\n\n\"Crazy bastard!\"\n\nYoungwoo hurled the newspaper across the room. His anger had nothing to do with the guild's public embarrassment. It was personal. Euphemina and Bullet had extended genuine kindness—and Agnus had spat in their faces.\n\n\"That son of a bitch attacked Euphemina... and Bullet!\"\n\nEuphemina had spent months wandering the continent copying skills—time she could barely spare due to her class limitations. Youngwoo had been patient with her absences precisely because she was irreplaceable. And she'd traveled all the way to Glaucian to save Agnus' worthless neck.\n\nThe memory played again: Euphemina's shocked expression as Agnus' magic tore toward her. Bullet's disbelief as his former comrade turned on him.\n\nUnforgivable.\n\n\"Why does he have to live like that?\"\n\nFrom their first meeting, Youngwoo had despised something in Agnus—that self-loathing twisted into aggression, the warped behavior born from shattered self-esteem. It made Youngwoo want to grab the man and shake some sense into him.\n\n'He's even worse than I used to be!'\n\nThe thought carried a confidence Youngwoo probably didn't deserve, but right now he didn't care.\n\nCold water from the shower finally cleared his head. The instant he stepped out, he logged into Satisfy.\n\nHe had work to do.\n\n***\n\nWithin hours, footage of Agnus' one-hour battle had gone viral.\n\nThe execution square became a stage for the necromancer's brutal efficiency. Blowing away the executioner. Converting the corpse into a skeleton soldier. Flying forward while a wall of undead absorbed dozens of arrows. The summoning speed, tactical awareness, control precision—all of it was perfect.\n\nFor sixty minutes straight, Agnus killed enemies, animated their corpses, and wielded them as shields and weapons. He'd achieved what necromancers dreamed of: absolute battlefield control through mass undead manipulation.\n\n\"Controlling dozens of undead simultaneously like that... is that even humanly possible? Even Kraugel struggles with a few sword projections...\"\n\n\"I know. I couldn't believe it when I saw it. The concentration required to maintain perfect judgment throughout—\"\n\n\"Maybe it's like savant syndrome? You know, exceptional ability in one area compensating for deficits elsewhere?\"\n\n\"Huh. That actually makes sense.\"\n\n\"The dominance stat determines how many undead a necromancer can control, right? So Agnus will only get stronger...\"\n\n\"He could end up rivaling Grid...\"\n\nThe common room on the palace's first floor buzzed with conversation. Grid, passing through the corridor outside, caught every word. His mood soured immediately.\n\n'What's so great about that bastard?'\n\nThen Toban's voice cut through: \"No matter how skilled Agnus is, he'll never match Grid. Grid ends fights in one blow. Watching Agnus struggle with skeleton armies is honestly frustrating.\"\n\n\"Right? Grid would sweep away everything Agnus summons with a single strike.\"\n\n\"Exactly.\"\n\nGrid's irritation evaporated. That was more like it. Obviously he was better than Agnus.\n\n...Never mind that no kingdom possessed weapons capable of destroying an entire undead army in one attack.\n\n'Whatever.'\n\nHumming softly, Grid continued toward his workshop.\n\n***\n\n**Tang! Tang! Tang!**\n\nThe rhythmic hammer strikes echoed through Grid's smithy in Reinhardt.\n\nNormally, his hunting trips required regular returns to resupply potions and repair equipment—the standard logistics that bound every adventurer to civilization. But Grid's circumstances had changed. Blood Absorption and his pets eliminated the need for potions. His legendary blacksmithing skills handled his own equipment repairs.\n\nSo why come back this time?\n\nSomeone else's equipment needed his attention. Specifically, the ether helmet—the \"eye\" of the Evil Eyes' King.\n\n**Tang! Tang! Tang!**\n\nGrid poured his focus into each strike while a small child crouched beside him. The boy—cute despite keeping his eyes tightly shut—spoke with reverence that seemed absurd coming from such a cherubic face.\n\n\"My only king, whose generosity surpasses the vastness of the universe... every time I trouble you like this, I can scarcely lift my head in shame.\"\n\nFew people could remain beside Grid while he worked. The Overgeared King's concentration created an almost physical pressure that drove away even guild members. Most didn't realize Grid himself was unaware of the effect.\n\nThe child sitting beside him was therefore either exceptionally special or too oblivious to notice.\n\nThis time, it was the former.\n\n\"Don't burden yourself.\" Grid didn't look up from his work. \"I'm sorry I can't help you more.\"\n\nThe child's identity: the Evil Eyes' King. Master of cursed power that only legends could withstand. As untouchable in his own way as Grid himself. The image of these two world-class entities sitting together in a modest smithy would have stunned anyone who understood what they were witnessing.\n\n\"My king, do you remember?\" The childlike voice attempted solemnity.\n\nThe unusual seriousness made Grid pause mid-strike. \"Remember what?\"\n\n\"I possess the ability to implant evil eyes into others.\"\n\nGrid's heart lurched.\n\nFinally.\n\nFrom their first meeting, that single statement had ignited Grid's interest. The power of an evil eye. That promise had driven every favor, every effort to maximize his relationship with the Evil Eyes' King. And now—\n\n\"I-I remember.\" Grid set down his hammer carefully. \"Are you offering to give me one?\"\n\n\"I've considered it since the day I pledged my service.\" The king's voice softened with genuine concern. \"But you understand the evil eye is also a curse.\"\n\n\"...\"\n\nThe truth Grid had been trying to ignore. Yes, the evil eye's power came with a price.\n\n\"You would never see your loved ones with both eyes again. You might harm your comrades unintentionally. One eye must remain forever sealed.\" The small figure radiated sorrow. \"I cannot bear to inflict the loneliness and discomfort I've endured my entire life.\"\n\nThe king had lived trapped by his own power. He refused to cage Grid with the same burden—even though offering the evil eye was the only meaningful gift he could provide. Curse or not, the power was undeniable.\n\n\"Hmm...\"\n\nGrid weighed the decision carefully, just as he had when considering whether to sacrifice two Creation skill slots for the Overgeared Skeletons. Minutes passed in silence before he handed the repaired ether helmet to the king.\n\n\"How many types of evil eyes exist? Can I choose which one I receive?\"\n\nSome evil eyes froze their targets. Others induced submission without physical damage. If he could select, the risk dropped dramatically.\n\nThe Evil Eyes' King shook his head. \"I cannot count the varieties that exist. Moreover, the evil eye manifests based on the recipient's nature—their essence shapes the power. Attempting to force a specific evil eye would be meaningless. You will awaken an ability suited to your true self once the assimilation completes.\"\n\nIn other words—\n\n'It's random?!'\n\nGrid's budding headache intensified. Gambling on an unknown evil eye without ether protection seemed insane.\n\n'If I'm unlucky, I'll be wearing an eyepatch permanently...'\n\nHe'd grown accustomed to the Slaughterer's Eye Patch. That meant he understood exactly how annoying it was having half his vision blocked...\n\n'...Wait. Does it actually block my vision?'\n\n> **[Slaughterer's Eye Patch]**\n> \n> **Rating:** Unique\n> **Durability:** 7/7\n> \n> **Effect:**\n> * Generates the passive skill 'Vital Spot Detection'\n> \n> *The Slaughterer endured prolonged torture. He was forced to witness the torture of countless others. Through this suffering, he developed an instinctive grasp of anatomical weaknesses.*\n> \n> *This eyepatch, worn by the Slaughterer for years, absorbed that ability.*\n> \n> **Conditions of Use:** None\n> **Weight:** 0.1\n\nGrid studied the description with fresh eyes. The artifact was special—no mention of vision obstruction, only the hint about perceiving vital spots. The Slaughterer's Eye Patch had never actually limited his sight. There had never been any discomfort.\n\nWhich meant there was no reason to hesitate.\n\nGrid grabbed the startled Evil Eyes' King by the shoulders. \"Give me the evil eye!\"\n\nHis good luck stat had never failed him before. He'd get something useful—he was certain of it."
}