{
  "id": 992,
  "title": "Chapter 991",
  "content": "\"You have chosen your destiny.\" The king's voice carried a solemn weight. \"Very well. If this is Your Majesty's will, I shall not stand in your way. My king—I, Poriorderporonopitonojiodebe—will implant an evil eye within you.\"\n\nGrid blinked. Above the king's head, the system helpfully displayed [Evil Eyes' King] instead of that... whatever that mouthful of syllables had been.\n\n'Ah. Character limit.'\n\nSmart. Even the game recognized some names were too ridiculous to display. Grid filed that information away and promptly forgot the king's actual name.\n\n\"My left eye, if you would.\"\n\n\"As you wish. May your soul bear the weight of what is to come.\"\n\nThe line was so melodramatic that Grid had to suppress a cringe. Before he could fully recover, the king reached up and covered Grid's left eye with one small hand.\n\n'What kind of eye will I get?'\n\nHis heart hammered against his ribs. Good luck stat, don't fail me now. He was eighty percent excited, twenty percent terrified. Surely the system would give him something incredible.\n\n[The Evil Eyes' King has invoked his authority!]\n\n[An evil eye will be transplanted into your body!]\n\n[Analyzing player history and behavioral patterns. Progress: 3%... 4%... 7%... 11%...]\n\n'So the ability is tailored to the recipient's nature...'\n\nThat made sense. The system would scan his entire gameplay history, identify his core tendencies, and grant him an evil eye that matched his essence.\n\n'This is good. Very good.' As a legendary blacksmith who'd forged over seven hundred unique items and survived countless battles, his profile had to be exceptional. 'There's no way I'll get anything ordinary.'\n\nHis expectations soared higher.\n\nThen reality crashed down.\n\n[Progress: 39%...]\n\n'...Oh no.'\n\nThe mental image of his \"essence\" shifted from \"legendary hero\" to \"complete disaster.\" A cold sweat broke out across Grid's back. Memories flooded in—specifically, memories from before he'd become Pagma's Descendant. \n\nThe lying. The scamming. The petty theft. The outbursts. The...\n\n'I've done too many terrible things.'\n\nWorse, he'd spent *years* cursing out the game operators. If someone compiled every insult he'd screamed at his monitor, it would fill a thousand-page manuscript. Hell, probably *two* volumes.\n\n'Dear god, what if there's a Swearing Eye?'\n\nThe image materialized in his mind with horrifying clarity: Grid in the middle of combat, forced to bellow profanities to activate his skills. Public humiliation. International embarrassment. His reputation—\n\n'Actually, the performance might be decent.'\n\nAt his peak, Grid had been a virtuoso of verbal abuse. Even Huroi, with all his rhetorical flourishes and creative insults, couldn't match Grid's raw output. Where Huroi crafted elegant insinuations about one's parentage, Grid simply *unleashed*. An endless torrent of vitriol, each curse more devastating than the last.\n\nIf he had a Swearing Eye, enemy morale would collapse within minutes.\n\n'But it would destroy my image.'\n\nNo matter how effective, he couldn't afford that reputation hit. Not when he represented the Overgeared Guild and Kingdom.\n\n'Please. Anything but the Swearing Eye.'\n\n[Progress: 54%...]\n\nThe analysis crawled forward. Had he really played *that* long? Committed *that* many incidents? The system seemed to be struggling.\n\nGrid forced himself to breathe. This delay was actually a blessing—time to center himself, think positive thoughts.\n\n'Right. Positive thinking. Manifesting good outcomes.'\n\nFire. He had an affinity for fire, didn't he? Tens of thousands of items forged in flames. Pagma had been called the Duke of Fire, and Grid was his successor. Maybe he'd get an Ignition Eye or—\n\n'Stop. Don't jinx it.' He squeezed his eyes shut.\n\n[Progress: 81%...]\n\nThe notification windows began multiplying.\n\n[Unable to determine essence from history and patterns alone—too many conflicting behavioral markers.]\n\n[Expanding analysis parameters to include goals and motivations.]\n\n[ERROR: Too many goals and desires detected!]\n\n[Subject is incompatible with most evil eye variants!]\n\n[Progress: 95%... 100%.]\n\n[CONCLUSION: Subject cannot be adequately defined.]\n\n[Potential system anomaly. Conducting comprehensive achievement review.]\n\n[ERROR: Too many achievements!]\n\n[Escalating to Morpheus core processing for advanced analysis.]\n\nGrid stared at the windows, utterly baffled.\n\n'A *supercomputer* can't analyze one player?'\n\nThis was absurd. This was—\n\n[Analysis complete. Optimal evil eye variant identified.]\n\nHis breath caught.\n\nThe air around his left eye shimmered. Heat prickled his skin—no, not heat. *Energy*. His iris blazed crimson. In the depths of his pupil, the shadows seemed to fracture, split down the middle like a broken mirror.\n\n\"Impossible! That eye...!\" The Evil Eyes' King recoiled, his small frame trembling.\n\nGrid's stomach dropped.\n\n[Evil eye transplant successful!]\n\n[Due to your insatiable greed, you have obtained: Castration Eye!]\n\n\"YOU'VE GOT TO BE KIDDING ME.\"\n\n*Castration?!* Was this some kind of sick joke? Was Satisfy secretly an adults-only game? Every instinct screamed danger. His hand flew to his face, scrambling for the eyepatch, but he'd forgotten to put it on. \n\nPanic clawed up his throat. The Evil Eyes' King stood right in front of him. What if the eye activated? What if he accidentally—\n\n\"I won't allow your comfort.\"\n\nThe activation phrase froze him mid-reach. \n\nBut... nothing happened. The king looked confused but unharmed.\n\n'The evil eye can't affect him?' Grid's racing heart slowed fractionally. 'Or maybe \"castration\" doesn't mean what I think it means?'\n\nWith shaking hands, he pulled up the ability description.\n\n[Castration Eye]\n\n*[An evil eye variant.\n\nBlocks beneficial effects of observed targets.\n\nSignificantly increased effectiveness against targets with atrocious qualities.\n\nMaximum range: 12 meters.\n\nCost: 500 Mana.]*\n\n\"...!\"\n\nGrid's panic transformed into shock. He knew *exactly* what \"beneficial effects\" meant.\n\nCritical hit chance. Evasion rate. Accuracy. Defense penetration. Resistance checks. Item drop rates. Enhancement success rates. Production bonuses. Hidden quest discovery. Everything tied to probability, to *luck*—all of it could be suppressed.\n\n'The power to neutralize positive outcomes...'\n\nThis was incredible. A jackpot. It wouldn't provide flashy debuffs or instant power boosts, but it eliminated *variables*. It ruined an opponent's momentum. If someone was attempting a difficult boss raid, Grid could simply watch them and tank their success rate.\n\n'Wait.'\n\nHis enthusiasm died.\n\n'This will make me the world's worst teammate.'\n\nHe could already imagine it. Raiding with his guild, accidentally activating the eye, watching his friends' critical hits mysteriously vanish and their skills inexplicably fail. Being kicked from parties. Being called a troll, a saboteur, a—\n\n'I thought this was amazing, but the restrictions are crippling.'\n\nDisappointment settled heavy in his chest. He hadn't received a top-tier eye after all. Just as he opened his mouth to complain, the king's trembling voice cut through his thoughts.\n\n\"I-If you cannot appreciate the magnificence of the c-castration eye—\"\n\n\"...\"\n\nThe king *understood evil eyes*. Of course he did. Grid felt naked, exposed. Would the king see his petty jealousy, his selfish disappointment, and lose respect for him?\n\nBut the king's expression shifted—not to disappointment, but to rapturous joy.\n\n\"The demon-like being I have chosen as my sovereign! My king, who shows generosity only to those he favors! Your selfishness, your greed—I feel infinite respect and trust!\"\n\n\"Y-Yeah. It's... it's great.\" Sweat dripped down Grid's temple.\n\nHe fled the smithy before the praise could get worse.\n\nThere was still something on his schedule. Damian—who'd gotten lost trying to help Agnus at Lauel's request—had apparently wandered into the Overgeared Kingdom. According to Lauel, Regas had challenged him to a duel, and the guild chat was exploding with hype.\n\nGrid wasn't about to miss a match between two powerhouses.\n\nBy the time he reached the training grounds, the fight was already underway. Damian glowed with layered buffs, his sword cracking the earth with each strike. Regas flowed around him like water, his devastating combos targeting every opening. They clashed in midair, broke apart, fell—\n\nDamian dropped near Grid's position.\n\n\"I won't allow your comfort.\"\n\n\"Huh?\"\n\nGrid had overlooked something critical. The activation trigger wasn't eye contact—it was simply *looking at the target*. The Slaughterer's Eye Patch covered Grid's eye from others, but it didn't block *his* vision. He needed ether glasses. He needed—\n\n[Castration Eye activated.]\n\n[All beneficial effects blocked for observed target!]\n\n[Effect persists while target remains in view.]\n\n\"...?!\" Grid's eyes went wide. Damian's went wider.\n\nIn an instant, every percentage point of luck, every probabilistic advantage, every small mercy the system granted its players—all of it vanished from Damian. His expression turned ghastly. His body locked up like a statue.\n\nRegas' kick hammered into the back of his skull.\n\nIt should have been nothing. Damian was fully buffed, his defense peaked. Regas' opening strikes were meant to build combo stacks, not deal real damage.\n\nBut Damian crumpled like wet paper.\n\nHe hit the floor. Didn't get up. Just sprawled there like a crushed frog.\n\n\"...?!\" Regas' follow-up kick whiffed through empty air.\n\n'Is this a feint?'\n\nIt had to be. Damian had just activated all his buffs—there was no way he'd suddenly become this weak. The reaction was too extreme. Too obvious.\n\n'He's baiting me.'\n\nMaybe Damian had unequipped his armor mid-fall to fake vulnerability. Maybe he'd temporarily disabled his buffs to create an opening. Either way, this was clearly a trap. The instant Regas committed to an attack, Damian would reverse the momentum.\n\n'The acting is perfect because it's *too* obvious.'\n\nThe damage had been three times higher than expected—but that just confirmed the setup. Regas rolled his shoulders, staying loose, and maintained distance. He watched Damian's prone form, checked his cooldowns, ran mental simulations.\n\nShadow boxing.\n\nMeanwhile, the Overgeared members in the stands kept cheering, oblivious to the tension. Grid joined in, shouting encouragement.\n\n\"Damian! Get up and fight already!\"\n\n\"...\"\n\n*You did this to me and now you're cheering?*\n\nDamian remained motionless, sprawled on the ground, and came to a devastating conclusion: Grid hated him.\n\nA pope commanded more respect than most kings. Damian was revered across the continent. And yet, here he lay, stripped of all fortune, humiliated in front of an audience, while the man responsible *urged him to continue fighting*.\n\nSilent tears traced down his cheeks.\n\nHe felt like a five-year-old denied a toy. Like a bull that had been castrated. The world had ended, and Grid—his idol, his inspiration—had ended it."
}