{
  "id": 993,
  "title": "Chapter 992",
  "content": "Two system messages flashed before Damian's eyes:\n\n[All your beneficial effects are blocked!]\n\n[All buffs that are in effect have been turned off!]\n\nGrid stepped back from the sparring match, an eyepatch covering his left eye. The moment their gazes met, Damian staggered. It felt as though his very existence had been rejected—as if everything that made him strong had simply... vanished. Every buff, every divine blessing, gone in an instant.\n\nGrid's eyes widened behind the patch. *Wiping out buffs that are already active...?*\n\nHe'd suspected the castration eye might interfere with beneficial effects, but seeing it delete active buffs was another matter entirely. A slow grin spread across his face.\n\n*This changes everything.*\n\nThe evil eye consumed 500 mana per activation. The Slaughterer's Eye Patch couldn't control it. Two significant limitations that had frustrated him since acquiring it. But this... this made up for every inconvenience.\n\n*I need more Ether Diamonds.*\n\nOriginally, he'd viewed them as simple production materials. Now he understood their true value. Kraugel had already provided the intel—Elliter Mine in Talima, where the diamonds slept deep underground. The information was solid; Kraugel didn't deal in half-truths.\n\nThe problem? The mine was a forbidden zone.\n\n*The 12th great demon's hand...*\n\nAccording to Kraugel's report, even one of the 12th great demon's hands possessed more power than the entire 33rd Great Demon Belial.\n\n*I'll have to raid it.*\n\nGrid opened his status window. Level 389. He'd pushed hard this past month—dragon's blessing, enlightenment effect, experience buff potions, sixteen hours of daily hunting. But it wasn't enough. Level 399 would unlock 200,000 Army Swordsmanship. Level 400 meant his fourth stats awakening. Both were minimum requirements before he could even think about challenging that mine.\n\n*And the guild needs to be stronger.*\n\nHe looked across the training field where his guildmates had gathered. One month since the National Competition ended, and most still wore the same equipment.\n\n*Time to fix that. Items for everyone. And help them acquire evil eyes.*\n\nDamian had already forfeited the duel, but Grid's attention shifted to Lauel. The man was practically vibrating with excitement, eyes gleaming like a dog that had spotted a treat. If he'd had a tail, it would have been wagging.\n\n*Of course he's already figured it out.*\n\nGrid smiled and removed the eyepatch. His red iris and the pupil resembling a black sun were revealed to everyone present. Heat crept up his neck as the words emerged—he couldn't help himself.\n\n\"I won't allow your comfort.\"\n\n[The castration eye is activated.]\n\n[Blocking all beneficial effects of the target!]\n\n[There are too many targets in sight.]\n\n[You have insufficient mana. The evil eye will apply to only a certain few people.]\n\n\"An evil eye!\" someone shouted.\n\nThe training field erupted. Guild members pressed forward, shock and excitement warring on their faces. Lauel pushed through the crowd, tears already streaming down his cheeks.\n\n\"The evil eyes' king!\" He grabbed Grid's armor with both hands. \"He transplanted an evil eye into you—tell me I'm right!\"\n\n\"You figured it out immediately. Yes, you're right.\"\n\n\"Finally!\" Lauel's voice cracked. \"Finally, I can get one too!\"\n\nHe seized Grid's hands. \"I'm living because of you! Because of your presence, I can become who I'm meant to be!\"\n\n\"Dial it back a notch.\" Grid gently pried Lauel's fingers loose. \"Everyone, listen up. If you want an evil eye, you need to build 100% affinity with the evil eyes' king. Let me explain what that actually means.\"\n\nGrid held nothing back. He described the king's personality—kind but temperamental, with a deeply wounded heart that manifested in chuuni declarations. He detailed the mental assault, the process of receiving the transplant, the strengths and limitations of each evil eye type. His colleagues deserved to know everything.\n\n\"Thank you, Grid!\"\n\n\"This is incredible!\"\n\nGuildmates swarmed him, gratitude overflowing. Lauel was already muttering calculations under his breath, planning his approach. But one person hung back.\n\n\"Damian?\"\n\nThe pope stood apart from the group, expression uncertain.\n\nGrid approached him. \"What's wrong?\"\n\nDamian waved his hands defensively. \"I don't intend to take advantage of your knowledge.\"\n\n\"Take advantage?\"\n\n\"The method to obtain an evil eye. I'm not a member of the Overgeared Guild—I shouldn't benefit from your information.\"\n\n\"What are you talking about? You're our friend and colleague. Why would you exclude yourself?\"\n\n\"...\"\n\n\"I want you to get an evil eye too, Damian. But here's the thing—controlling it properly requires Ether Diamonds. We'll need to raid the great demon's hand to acquire them.\" Grid met his eyes. \"And when we do that, I need you there. The difference between success and failure could come down to your presence.\"\n\n\"You're exaggerating.\"\n\n\"Come to the smithy. You received production materials from this year's National Competition, right? Time I made you something new.\"\n\n\"...\"\n\n\"Weapon or armor? I know you've been using that special sword lately, so I'm guessing your armor needs upgrading more?\"\n\n\"Yes... you're right. I should keep my current weapon.\"\n\nDamian raised his left hand. Bright light coalesced around his fingers like liquid flame. He grasped it with one hand, pulled with the other, and drew forth a dazzling white blade of pure radiance. Holy Sword Summoning—one of the most spectacular weapon skills Grid had ever witnessed.\n\n[Player Damian wishes to share the item information with you.]\n\n[Damian's Holy Sword]\n\n[Rating: Epic (Growth)\n\nPhysical Attack Power: 1,450(+175) Magic Attack Power: 1,090(+81)\n\n* Applies 10% of the wearer's strength to the weapon's physical damage.\n* Applies 10% of the wearer's intelligence to the weapon's magic damage.\n* 30% reduction in cooldown time of divine attribute skills.\n* 40% reduction in the resource consumption of divine attribute skills.\n* 20% increase in the power of the wearer's swordsmanship skill.\n* 10% increase in attack speed.\n* 30% additional damage to evil beings.\n* There is a low probability of generating a random buff when attacking.\n\n★Can grow to the myth rating.\n★The growth rate is very slow.\n\nA sword offered by the heavens to Damian, who has outstanding achievements and has been recognized by the goddess of light. It is a symbol used to punish evil that will grow with Damian.\n\nConditions of Use: Damian.\nWeight: 0]\n\n\"Impressive.\" Grid studied the blade with genuine admiration. A weapon summoning skill combined with infinite potential and that unique divine radiance—even as a legendary blacksmith, he found himself coveting it. The option to convert stats directly into weapon performance was particularly valuable for someone with his absurdly high attributes.\n\n\"It started at epic rating?\"\n\n\"No, rare rating. It only evolved to epic yesterday. Haven't had a chance to enhance it yet.\"\n\n\"At rare rating, the stats addition was below 10%?\"\n\n\"Eight percent.\"\n\n\"So it'll increase with each rating upgrade...\" Grid nodded slowly. \"Unlike symbolic weapons like the First Holy Sword, these options are practical. This is a lifelong weapon.\"\n\n\"Really?\" Damian's face lit up. \"If you're evaluating it that way, I can use it with confidence.\"\n\nComing from the Overgeared King rather than some random merchant, the assessment carried weight. Damian's affection for the sword visibly deepened. Grid felt a twinge of concern.\n\n*It needs to reach at least legendary to truly be lifelong...*\n\nHe knew better than anyone how slowly growth-type items developed. And this one explicitly had 'very slow' growth rate. Grid suppressed a sigh.\n\n\"Sorry to ask, but could I try equipping the sword?\"\n\nIt was summoned through Damian's skill, imbued with his personal mana and divine power. Testing whether his 'wear all items' characteristic applied here would provide valuable data.\n\n\"Of course.\"\n\nDamian didn't hesitate. Despite the holy sword being irreplaceable, he transferred it to Grid without a single objection.\n\n[Damian's Holy Sword has been equipped.]\n\n[It is a summoned item based on a skill. If the original owner recovers the skill, you will lose ownership of the item.]\n\n\"Incredible...\" The blade felt weightless in Grid's hand, responding as though it had been forged for him.\n\n*Pagma was a monster.*\n\nEverything Grid could do, every advantage he possessed, originated from Pagma. The man who'd made a pact with Baal, who'd betrayed Braham, who'd become legend—his genius still shaped Grid's path. Holding Damian's holy sword drove that truth home with perfect clarity.\n\nHe returned the weapon. \"Tell me what armor you need. Let's head to the smithy now.\"\n\n\"Are you sure? I thought you were focused on hunting these days.\"\n\n\"You think I'd hesitate to invest a few days in you?\"\n\nDamian had always supported him without reservation. Grid felt the same gratitude in return. Besides, he owed the man an apology.\n\n*That castration eye really shook him.*\n\nWatching Damian's buffs vanish, seeing the horror in his eyes—Grid wanted to make up for forcing him to forfeit like that.\n\nThey walked to the smithy together.\n\n***\n\n\"This one and this one.\" Damian placed his gold medal rewards on the workbench: <Black Tortoise's Breath> and <White Tiger's Breath>.\n\nDefense mattered more than offense for a pope. He'd chosen water and earth attributes accordingly.\n\n*Perfect.*\n\nGrid smiled and retrieved his insane dragon hammer and anvil. This gave him a chance to work with the Black Tortoise's Breath ahead of schedule.\n\n***\n\n\"No affinity gain! It's not moving at all!\"\n\n\"Gifts don't work, conversation doesn't work—this is impossible!\"\n\nThe Overgeared members' new challenge: raising affinity with the evil eyes' king. It was proving brutally difficult.\n\nGrid had his 'Easily Acknowledged' trait and high reputation, making it relatively simple for him to connect with named NPCs. For everyone else? Named NPCs required careful cultivation—and the evil eyes' king was particularly demanding. His chuuni personality and emotional wounds made him extraordinarily difficult to approach.\n\nThe king treated Overgeared members kindly enough, but bridging that gap to genuine affinity? Two weeks in, only a handful had managed to increase their relationship even slightly.\n\n\"Kukukuk... a symbol of rebirth, but not an easy opponent...\" Even Lauel had struggled. One affinity point in two weeks—barely a start. He wanted that evil eye desperately, wanted to achieve his 'true self.' After another failed conversation with the king, he sighed deeply.\n\n\"P-Prime Minister!\"\n\nRoyman came running—Karin in disguise, still under the impression her secret remained hidden. After training under Piaro for years, she'd earned the title 'Rising Star of the West' and become one of the kingdom's most promising prospects.\n\n\"What's wrong?\" Lauel tensed. Royman's urgency suggested serious news.\n\n\"The King of Valhalla is here to see you.\"\n\n\"God of War Ares?\"\n\nWhy would he visit now, after ending their exchange? Lauel headed straight for the parlor.\n\nAres sat with a teacup, which he set down when Lauel entered. He waved casually.\n\n\"Hey. Want to form an alliance?\"\n\n\"Didn't you already betray us and make a truce with the empire? Now you want an alliance?\"\n\n\"Betray? What betrayal?\"\n\n\"Handing the White Dragon's Eye to the empire.\"\n\n\"I indirectly informed you about the White Dragon's Eye transfer, allowing you to prepare in advance. You resolved it perfectly.\"\n\n\"Is that how you're spinning it?\"\n\n\"Spinning? It's the truth. If I'd really wanted to betray you, I never would have told you the eye existed in the first place.\"\n\n\"...Excellent rhetoric. Your new strategist taught you that?\"\n\n\"Yep.\"\n\n\"...\"\n\nAres' new strategist was far more capable than Lauel had anticipated. He reassessed the situation, already seeing the possibilities.\n\n*This could work out better than I expected.*"
}