{
  "id": 994,
  "title": "Chapter 993",
  "content": "Two months passed in a blur of conflicts and alliances.\n\nWhen the truce with the Saharan Empire finally expired, the Overgeared Kingdom wasted no time forging an alliance with Valhalla. While Grid had been bound by peace terms, Ares had spent that time conquering neighboring territories and expanding his forces.\n\nThe news sent shockwaves through the imperial court. After the White Dragon's Eye incident, the Saharan Empire had been counting on lasting animosity between the two powers. Their strategy had relied on Grid and Ares keeping each other in check while the empire rebuilt its strength. Instead, they found themselves facing a unified front.\n\nWith their plans in ruins, the empire had no choice but to redirect all their attention toward the Overgeared Kingdom. Relentless pressure followed—economic sanctions, military provocations, border skirmishes. Grid responded by fortifying his borders and pouring resources into his war machine. The Overgeared members who'd claimed gold medals at the National Competition received new equipment fresh from his smithy, while massive shipments of weapons and armor flowed to Valhalla, cementing their alliance and filling the kingdom's coffers.\n\nMeanwhile, Yura returned from hell with a prize no other player had ever claimed—a contract with a king elemental. The achievement triggered a world message, and for a brief moment, her name eclipsed even Grid's recent demon king subjugation.\n\n\"I'm envious...\"\n\nThe other Overgeared members, stuck with their lesser elementals, couldn't hide their jealousy even as they congratulated her. Yura herself felt the weight of the accomplishment.\n\n*With this, I'm one step closer...* She was edging toward legendary status, and more importantly, she'd be far more useful in the inevitable war with the empire.\n\nWhile kingdoms prepared for war, religions clashed in the streets.\n\n\"I will erase the false goddess of light from this world!\"\n\n\"Silence, you servants of evil!\"\n\nThe conflict between the Rebecca Church and Yatan Church had metastasized into open warfare. Yatan's forces scattered across the continent, spreading chaos wherever they went, while Rebecca's faithful met them with equal fervor. Yatan Servants and Rebecca's Daughters transformed battlefields into graveyards, leaving multiple kingdoms in shambles.\n\nCuriously, the Overgeared Kingdom remained untouched. \n\nWith the Vatican located within Grid's borders, some attributed this to divine providence. The truth was far more practical—Damian had been working overtime. The young pope went so far as to petition the empire directly.\n\n\"I trust the empire recognizes that the Yatan Church threatens the peace of the entire continent. This is not a burden the Rebecca Church can bear alone.\"\n\nThe emperor's jaw clenched. Damian's request was backed by centuries of tradition and political necessity. Refusing aid to the Rebecca Church would be tantamount to declaring himself an enemy of the faithful. Through gritted teeth, he dispatched imperial forces to reinforce the templars.\n\nAround the same time, Kraugel appeared in the empire. Players spotted him at Empress Aria's grave—a sighting that sparked immediate speculation about him joining the imperial faction.\n\nThe reality was far different.\n\n\"A great evil lives there.\" Kirinus, the continent's finest spearman, pointed toward the imperial palace. After months of watching Kraugel, the NPC had finally decided to trust him with the truth. \"That gorgeous palace, where Empress Marie resides—she is the source of the corruption. She must be eliminated. If we don't remove her, this continent has no future.\"\n\nKraugel studied the distant structure, his expression unreadable. Grid had mentioned wanting to kill the empress once, long ago. At the time, Kraugel had dismissed it as bravado.\n\n*Did you know the whole truth even then?* How long had Grid been carrying this burden alone?\n\n***\n\n『 Breaking news: The Fold Kingdom continues its remarkable economic transformation... 』\n\nThe broadcast played across the continent. Once a struggling tributary state, 70% mountains with soil too poor for proper agriculture, the Fold Kingdom had been transformed by Overgeared investment. Infrastructure projects employed thousands. Agricultural innovations turned barren hills into productive farmland. Military facilities trained a new generation of soldiers.\n\nThe players of the Fold Kingdom prospered alongside the NPCs, and gratitude toward Grid ran deep. Even the royal family had become cheerleaders.\n\n\"We must not waste King Grid's mercy! Don't grow complacent—don't grow lazy! The Fold Kingdom will become a pillar supporting the Overgeared Kingdom!\"\n\n\"Long live King Grid! Long live the Fold Kingdom!\"\n\nWhat had begun as a tributary relationship had evolved into something far more valuable—a fully integrated economic zone. The Fold Kingdom absorbed industries and workers that Reinhardt could no longer accommodate, while providing access to new resources. Grid had created a multi-base empire.\n\n***\n\nThe seven dukes of the Saharan Empire, each commanding elite armies, found themselves stationed at coastal fortresses instead of conquering new territory. The water clan had declared war on the empire.\n\nKing Maxong's forces struck port cities with devastating efficiency, then vanished into the depths before reinforcements could arrive. The hit-and-run tactics forced the empire to spread its military thin, garrisoning every harbor in a futile attempt to predict the next target.\n\n***\n\n[Affinity with the evil eyes' king has increased by 1.]\n\n\"Finally... five points.\" Lauel's voice mixed exhaustion with triumph.\n\n\"Congratulations. At this rate, you'll hit one hundred in... what, a few years?\" Grid's tone was sympathetic.\n\n\"I'll take what I can get...\"\n\nMost of the Overgeared Guild had reclassified their affinity-building efforts as a multi-year project and scaled back their attempts. Only Lauel persisted, visiting the evil eyes' king twice daily without fail.\n\nHis dedication was bearing fruit in unexpected ways. The king had softened toward humans in general after two months of observation. Compared to his millennia of isolation, interactions with these strange mortals proved surprisingly pleasant and informative.\n\nThe king's shifting attitude influenced his entire species. Evil eyes trained with new intensity. The Destiny Guardians operated with unprecedented coordination. Slowly, the demonkin were being integrated into the Overgeared Kingdom's military structure.\n\n***\n\nMore players arrived at the vampire cities every week. The dungeons had been Overgeared territory for years, but rumors of their loot kept drawing challengers who believed they could slip past the guards.\n\nSome succeeded—always into the seventh city. \n\nWhat they found wasn't a hunting ground. It was a slaughterhouse.\n\n[The vampire earl 'Noll' has appeared!]\n\n\"Pathetic worms dare intrude?\" The boy vampire's voice dripped with contempt.\n\n\"No—please—!\"\n\n\"Spare us!\"\n\nTheir pleas died in their throats. Noll's armor negated most damage, and his speed made defense impossible. Every intruder became a sacrifice, and with each sacrifice, the young noble grew stronger.\n\nWhich was exactly what the Overgeared Guild intended. The \"gap\" in the seventh city's defenses wasn't negligence—it was bait. Every overconfident player who slipped through was another stepping stone for Noll's development.\n\n***\n\n\"Lord Chris of Reidan! Today, I claim your head!\"\n\nThe Reidan desert had become a perpetual battlefield. In the early days, the Black Knights' cavalry had ravaged the territory. Now, the empire bled for every inch of sand.\n\nReidan's soldiers had adapted to fighting in the heat and the dunes. The imperial forces, trained on temperate plains, struggled with both terrain and tactics. Every engagement ended the same way—imperial casualties far exceeding their opponents'. The empire needed Reidan to launch a proper invasion of the Overgeared Kingdom, but the gateway was sealed by Duke Chris and the former Giant Guild members who'd sworn loyalty to Grid.\n\n\"You want my head? With this level of skill?\" Chris' greatsword carved through another Black Knight's guard. \"Pathetic.\"\n\n\"Y-You're nothing but a duke of a backwater kingdom...!\" The Black Knights' rage had been building for months, festering with each fallen comrade. They threw themselves at Chris with suicidal fury whenever he took the field.\n\nFrom Chris' perspective, they were experience points with legs.\n\nThe conflict had been formalized two months ago when the emperor made his declaration: \"Overgeared King Grid threatens humanity by consorting with demonkin and inhuman species. He is a disaster that must be put down for the sake of continental peace.\"\n\nThe relationship between the Overgeared Kingdom and the Saharan Empire was now officially that of enemies at war. The system recognized it as such, activating war game mechanics that increased experience gains for player combatants.\n\nThe Overgeared members could now level through warfare itself. Every enemy soldier killed granted experience comparable to hunting monsters. It transformed what could have been a tedious grind into an opportunity for rapid advancement.\n\n\"CHRIIIIS!\" The Black Knights' deputy commander—missing an arm from their last encounter—charged with a wordless roar.\n\nLevel 385. The Black Knights served under the Red Knights, but their leadership matched the legendary order's strength. It wasn't enough. Chris sat at the top of the unified rankings. It would take someone past their fourth advancement to truly threaten him.\n\n[The commander 'Chris' has slain the enemy!]\n\n[Ally morale has increased!]\n\n\"VICTORY!\"\n\nIn Reidan, at the border between kingdom and empire, the Overgeared Kingdom's elite forces grew stronger with each passing day.\n\n***\n\n『 Many cars exist in this world. Only one satisfies me—from Daejin Motors. 』\n\nShin Youngwoo's face dominated advertisements across every platform. Three months after the National Competition, the Daejin Group had finally produced their commercial featuring Grid.\n\n\"You have an presence unlike any model or actor I've worked with,\" the director gushed over coffee in the Daejin Motors headquarters lobby. \"It's almost like... European royalty? That same sense of inherent authority. Remarkable.\"\n\n\"You're being too kind.\" Youngwoo sipped his hot chocolate, eyes tracking the commercial playing on loop overhead.\n\n\"Not at all. I mean every word...\"\n\nThe commercial would air in 198 countries—an unprecedented global campaign. The man sitting across from Youngwoo wasn't just the director, but the president of Daejin Motors himself. He'd originally scheduled a private meeting in his office, but on impulse had suggested the lobby instead. \n\nThe reason was obvious. Every employee in the building was stealing glances at their table.\n\n\"Is that actually Grid sitting in our lobby?\"\n\n\"The rumor's true—he barely edited his character creation. He looks the same in real life.\"\n\n\"It's more than just looks. There's this... presence about him. Like he operates on a different level from normal people.\"\n\n\"Right? Even our president looks like a side character next to him.\"\n\n\"Wait, that's our president?\"\n\n\"...Oh. I didn't even notice him.\"\n\nThe president overheard every word—\"extra,\" \"side character,\" \"background actor\"—and didn't care in the slightest. He was sitting with the single most influential person in the world. His pride was unshakeable.\n\n*I'm bragging about this to my son and grandchildren tonight.*\n\n\"About the new model,\" he continued eagerly. \"The God General Sys—\"\n\n\"The what?\" Youngwoo blinked.\n\nThe ridiculous name he'd improvised during that disastrous press conference had completely slipped his mind. After a moment, recognition dawned.\n\n\"Oh, right. The car I'm supposedly so excited about I can't sleep at night.\" He smiled wryly. \"I didn't think you'd actually use that name.\"\n\n\"Your words, your vision—of course we're using it! In fact, we're producing a custom model exclusively for you.\"\n\n\"That's generous.\"\n\n\"What if we made six instead of one?\"\n\n\"...Six?\"\n\n\"Two for your parents, one for your sister, one for you, one for Yura, and one for Chairman Yoon himself.\"\n\nYoungwoo's enthusiasm died. \"Why bother with—\"\n\nFree cars sounded incredible until you remembered the tax implications. Each vehicle cost nearly 800 million won to produce. Receiving four as \"gifts\" would trigger a tax bill that made his head hurt. He'd rather pay for normal luxury cars for his parents and give Sehee his current vehicle.\n\nThe president noticed his hesitation and misread it entirely.\n\n\"I hope you don't think this is overstepping—trying to flaunt a connection between our families. It's purely commemorative...\"\n\n*Ah.* Understanding clicked into place. This wasn't about generosity. Chairman Yoon wanted to give Grid and Yura matching cars—couple cars. More than that, he wanted the entire Grid family and himself driving identical custom vehicles. A public declaration of their relationship.\n\nIn other words, the chairman wanted bragging rights.\n\n\"Hmm.\"\n\nYoungwoo let the silence stretch. The president fidgeted. His coffee grew cold. Just when the man looked ready to apologize, Youngwoo finally spoke."
}