{
  "id": 995,
  "title": "Chapter 994",
  "content": "\"I understand your grandfather's proposal.\" Youngwoo leaned back in his chair. \"But I have a condition.\"\n\n\"Which is?\"\n\nFor most people, a direct connection to one of Korea's wealthiest families would be priceless. But Youngwoo had no interest in social climbing. What he said next caught the president completely off guard.\n\n\"Big corporations and prominent families are sponsoring rankers these days—building them up at the business or family level. Does Daejin have a program like that?\"\n\nIn the gaming world, 'ranker' meant only one thing: elite Satisfy players.\n\nThe president's eyes flicked toward the conference room door before he lowered his voice. \"We've made certain... investments in that area.\"\n\nIt was true. While Chairman Lee Jinmyung publicly disapproved of his granddaughter's gaming career—mainly because he'd always groomed Yura as his corporate successor—he understood the cultural shift happening. Quietly, Daejin had begun sponsoring and developing rankers at the corporate level. Once they matured and competed in major events, Daejin's brand recognition would rise naturally.\n\nThough with Yura's reputation now, that hardly seemed necessary.\n\n\"I want Daejin to reach out to the other Korean companies and families. Encourage their sponsored rankers to join the Overgeared Guild.\"\n\nThe president's expression soured. The idea of Youngwoo simply absorbing all that carefully cultivated talent—all those resources other companies had invested—struck him as both absurd and insulting.\n\n*Is he trying to take advantage of us?*\n\n\"Wait—I don't mean permanently.\" Youngwoo raised a hand. \"That's not realistic. I'm asking for temporary support. Mercenaries, essentially. Both sides benefit. We'll provide at least unique-grade equipment crafted by the Overgeared Kingdom's finest blacksmiths, plus access to premium hunting grounds.\"\n\n\"You're talking about those border territories in Reidan everyone's been discussing.\"\n\n\"Exactly. Hunt imperial soldiers, level up fast.\"\n\nThe war of attrition against the empire was bleeding the Overgeared Kingdom dry. With an enemy force hundreds of times larger, the constant loss of NPC soldiers was unsustainable.\n\n\"So your ultimate goal is replacing your NPC army with players?\"\n\nDespite his limited Satisfy experience, the president was sharp—the result of decades running a major corporation. Youngwoo nodded, genuinely impressed.\n\n\"You've got it.\"\n\n\"Hmm... All right. I'll present this to the chairman.\" The president drummed his fingers on the table. \"But I doubt the other companies will jump at this. They'll have demands. Probably extensive ones.\"\n\n\"I'll handle the negotiations. Just pass along my message.\"\n\nYoungwoo already knew what they'd want: Grid or other Overgeared members as brand ambassadors, equipment manufactured in the Overgeared Kingdom, advertising space within the kingdom itself. He was prepared to accept all of it.\n\n*Either way, I need money.*\n\nHe could sleep less. With proper time management, he could handle promotional work. The kingdom had plenty of blacksmiths—they could produce whatever inventory the companies needed.\n\n*I'll tap into corporate resources and assets. In exchange, they'll leverage my knowledge and skills.*\n\nThe deal would work. Corporate evaluations of the Overgeared Kingdom were sky-high. Still, binding himself to too many companies at once would dilute his value. Better to start domestic, then expand internationally later.\n\n*This is going to be interesting.*\n\nThese corporate-backed rankers would be easier to coordinate than independent players. He'd gather hundreds of thousands in Reidan to grind down the imperial forces.\n\nOf course, this was all Lauel's master plan.\n\n***\n\nIn Satisfy's cosmology, darkness symbolized evil, and evil meant the great demons. This logic extended to the elemental system. So it made perfect sense that the light elemental king would favor Yura—among all players, she'd hunted more demons than anyone.\n\n**[Light Elemental King Contractor]**\n\n**You can utilize the highest-ranked light elemental.**\n\n**Current level of highest-grade light elemental: 1**\n\n**—Available Elemental Techniques—**\n\n* **The elemental king's energy is infinite. Using the elemental consumes none of the contractor's resources.**\n\n**[Sword of Light]**\n\n**Transforms the elemental into a sword of light.**\n\n**The Sword of Light follows the contractor's commands...**\n\n**[Flash]**\n\n**The light elemental instantaneously moves to the contractor's designated target.**\n\n**If the target possesses significant power, the Flash will shine more intensely...**\n\n**[Elemental King Summoning Lv. 1]**\n\n**Summons an elemental king to the present through the light elemental.**\n\n**The summoned king's abilities are influenced by the contractor's capabilities.**\n\n**Low skill level restricts the elemental king's full power.**\n\n**Duration: 10 minutes**\n\n**Cooldown: 30 hours**\n\n\"...\"\n\nAfter postponing her World Tree visit to focus on hunting in hell, Yura hadn't expected much. Most of her guildmates had contracted with lower or intermediate elementals at best. She'd assumed her outcome would be similar.\n\nAn elemental king.\n\nOnce again, she owed Grid an immeasurable debt. If she hadn't met him in that temple, her entire existence would be different. She'd still be serving Yatan, locked in endless conflict with the Rebecca Church and the Overgeared Kingdom. Living with daily regret.\n\n\"I'll become someone you can rely on.\"\n\n*Step.*\n\nToday, Yura didn't open a gate to hell. Instead, she traveled to Reidan—the desert city surrounded by endless sand.\n\n\"Yura?\"\n\nOn the walls, the exhausted faces of Overgeared members brightened instantly. Since the 4th National Competition began, Yura had been consumed by hell hunting. No one had expected her to join the war effort this soon.\n\nGold medalist in Drawing the Saint Sword. Silver medalist in PvP. One of Overgeared's strongest representatives. Her combat power alone equaled four or five of their top members. Just knowing she'd fight alongside them lifted everyone's spirits.\n\nThen—\n\n\"Hell Leap.\"\n\nThe Overgeared members watched in stunned silence as they realized they'd *vastly* underestimated her growth.\n\nYura didn't just leap through space—she jumped directly into hell itself, abandoning the traditional gate that connected the two realms. And when she returned, demons poured through the opening she'd created, materializing in the middle of the battlefield.\n\n\"What the—?!\"\n\nThe sudden appearance of the crimson dimensional door. Demons flooding through. The imperial soldiers stood frozen, too shocked to even scream as they became demon prey.\n\n\"You can *summon* demons?\" Chris stared, bewildered. A demon hunter... summoning demons? The contradiction was mind-bending.\n\nYura shook her head. \"I'm just opening a passage.\"\n\nHell Leap transferred her body to hell for exactly one second. The destination was random. But Yura had learned to use that single second efficiently—identify her location, confirm demon presence nearby, open a gate, then escape. She'd weaponized an escape skill into a summoning technique.\n\nFor the imperial soldiers, she'd literally opened the gates of hell.\n\n\"AAAAHHH!\"\n\n\"No! Please—spare me!\"\n\nThe gate lasted one minute. More than enough time. Demons with instinctive human-hunger surged through at full speed.\n\n\"Holy shit...\"\n\nThousands of demons massacred the imperial forces. The Overgeared members felt a chill of unease—what would happen when the imperial army was gone? Would they become the next targets?\n\nBut they had Yura.\n\nAs demons finished devouring the soldiers and turned hungry eyes toward the Overgeared forces, Yura's bullets tore through them one by one.\n\n***\n\n\"Hasn't been much prey lately.\"\n\n\"With the Vatican closed, no surprise there.\"\n\nIn a mountain village near the Vatican, Rebecca statues—large and small—dotted every corner. Usually the area teemed with tourists visiting the holy site, but recently it had become a ghost town. The war between the Rebecca Church and Yatan Church had intensified, forcing the Vatican to close its gates to outsiders.\n\n\"Tch.\"\n\nShay was bored out of his mind.\n\nHe and his partners—Kerb and Sniffer—formed a vicious PK group. They'd been working with Dong Pao, a corrupt Rebecca priest, luring tourists to isolated areas and robbing them blind. Ironically, they were also the ones who'd inadvertently helped Grid learn about Marie Rose's location and acquire Kasim.\n\nNot that they'd *intended* to help.\n\n\"I need to blow off steam. This is killing me.\"\n\n\"Maybe pick up an assassination contract today.\"\n\n\"I've done over a hundred commissions this month. I'm sick of it. Too tedious. I need a break.\"\n\n\"Hey. Look.\"\n\nThe trio lounging on the restaurant terrace turned toward the village entrance. Even from a distance, the newcomer screamed money. A man wearing unusual sunglasses. His face and ID were hidden by a full helmet, but his equipment told the story—level 200 gear, every piece enhanced.\n\n\"Doesn't he look like some rich guy's alt character?\"\n\n\"Yeah. All his level 200 items are upgraded.\"\n\n\"Definitely a gold spoon kid.\"\n\nThe items shimmered with that telltale enhancement glow. Perfect prey.\n\nShay's group exchanged knowing smirks and stood. They descended from the terrace, engaged in casual conversation as they passed the unidentified man—\n\n—and kept walking.\n\n*Shit! Get out of here!*\n\nThey quickened their pace, hearts racing.\n\nIron rule: never engage with someone hiding their face *and* their ID. They'd learned that lesson the hard way. That terrible experience with Grid—the one who'd concealed his identity and destroyed them—had left permanent scars. Since then, Shay's group excluded all unknown targets from their PK list.\n\nCall it trauma. Call it wisdom.\n\n\"Man, I miss hunting pushovers like the old days.\"\n\n\"Those kids were basically free money. What are the odds we find marks that easy again? One in a million?\"\n\nStill, caution was why they'd survived this long. The key to successful PKing in one area was maintaining good relations with locals. The villagers saw Shay's group as friendly, helpful people—they'd never suspect them of banditry. Even when Rebecca Church paladins came down investigating, they never looked twice at Shay's party.\n\nImage management was everything.\n\n\"Today's a bust. Maybe we should check the guild board for contracts...\"\n\nThey left the village—and froze.\n\nThe unidentified man had followed them. As they watched, he removed his helmet. Black hair spilled out. The name that appeared above his head—\n\n\"G-Grid!\"\n\nPure hatred radiated from Shay's group. They wanted to kill him so badly.\n\n\"Perfect. You've been operating out of the same spot for years, haven't you?\"\n\n\"T-That... sometimes... j-just sometimes...\"\n\n\"R-Right! Mostly we work other places! We only come back here to unwind!\"\n\n\"I-It's like... you know, visiting home... haha...\"\n\nShay had once ranked in the single digits on the assassin leaderboard. Recently he'd dropped to the top twenty, but he was still exceptional—especially in PK situations, where experience counted for everything.\n\nYet here he was, practically groveling before Grid.\n\nMultiple beatings had instilled genuine fear.\n\n\"Come to Reidan.\" Grid's tone was casual. \"There, you can deceive, kill, and rob imperial players all you want. Wouldn't a bigger stage be more entertaining than this backwater village?\"\n\n\"...You want to use us as war tools?\"\n\n\"Y-You think we'll cooperate?\"\n\n\"Yes. If you don't want to die.\" Grid's expression didn't change. \"I'll kill you here, then place a guild-wide kill order on you.\"\n\n\"...When do we leave?\"\n\n\"Assassination is our specialty. That's why you came to us, right? We'll definitely be useful.\"\n\n\"Good. I'm counting on you. Perform well, and you'll be rewarded.\"\n\nTo deal with the empire, Grid needed to mobilize every contact he had. The fact that most of those contacts were criminals was unfortunate but irrelevant. \n\nFortunately, he was stronger than everyone he had a bad history with.\n\n\"Next is Bubat... hmm...\"\n\nAfter confirming Shay's group would comply, Grid reached for his return scroll—then paused. Since he was already here, curiosity got the better of him. He'd been meaning to check on *that* place. But the exact location escaped him, so he turned to Shay.\n\n\"That dungeon—where was it again?\"\n\n\"Dungeon?\" Shay blinked. \"You mean where the vampire duke is sealed? It's a forbidden area—won't show up on maps.\"\n\nA space where magic and skills were blocked by overwhelming evil influence. The perfect hunting ground for luring players to their deaths.\n\n\"About three kilometers northeast... forget it. Just follow me.\"\n\nExplaining in words would take too long. Shay started walking, and Grid fell in behind him.\n\nA smug smile crossed Shay's face.\n\n*No matter how strong Grid is, he can't match my speed when I activate Master of Swiftness.*\n\nGrid would struggle to keep up and look like a fool. Shay imagined the humiliation on Grid's face and actually hummed to himself as he activated his peak movement speed skill.\n\nBut—\n\n\"...\"\n\nGrid maintained perfect distance behind him. No difficulty whatsoever.\n\nHis agility was naturally high, and he'd recently crafted a full set of movement-speed enhancement items.\n\nShay felt tears threatening. *Filthy bastard. Fucking greedy bastard. Taking everything for himself.*\n\nHe'd finish this job, then cut all ties with Grid forever. Move to the other side of the continent where they'd never cross paths again.\n\n*No—the East Continent,* Shay vowed silently. *I'll go to the East Continent.*"
}