{
  "id": 996,
  "title": "Chapter 995",
  "content": "The world remained blissfully unaware of how precarious the Overgeared Kingdom's position had become. Why worry? Grid would march forth and cut down his enemies—as he always did. The masses accepted this as inevitability, and even the experts didn't dispute it. Grid and his guild had shown them too much, handled too many crises through methods that defied common sense.\n\nBut the truth was far grimmer.\n\nThe Overgeared Kingdom's flame guttered in the wind. The seven dukes' armies remained occupied defending the port cities for now, but the Empire still held its true power in reserve: the Tower of Eternity's magicians, the magic machines, the Red Knights, the Five Pillars. Meanwhile, the Overgeared Kingdom had already expended tremendous effort just to slow the imperial advance.\n\nGrid's hands weren't quite steady. The projections kept trending toward disaster. That's why he'd leveraged every connection, every relationship, scrambled to change companies and call in favors—all to shift the outcome. That's why he'd come here.\n\n>**[Marie Rose's evil influence makes your magic power turbid. All types of spells and skills aren't available.]**\n\n>**[You have resisted.]**\n\nThe cave mouth yawned like a monster's maw. Within, Marie Rose had slumbered—the Vampire Duke sealed by 2nd Pope Chreshler and Rebecca's Daughters, the ultimate vampire who transcended even Shizo Beriache herself. And Grid had broken that seal.\n\n*It happened because of Malacus' Cloak.*\n\nAn accident. Unintentional. But Grid hoped to leverage the aftermath, to make use of his Blood King Candidate title.\n\n**[Blood King Candidate]**\n\n*You have become a candidate to be a blood king.*\n\n*You will give a sense of pressure to ordinary vampires. All ordinary vampires hostile toward you will have their stats decreased by 15%.*\n\n*You will give a sense of confusion to true blood vampires. All true blood vampires hostile toward you will have their stats decreased by 8%.*\n\n*Direct descendant vampires will be interested in you. Any direct descendant vampires facing you will temporally awaken from the Curse of Idleness.*\n\nFour direct descendants sealed—that achievement had evolved his title. The alertness it provoked in direct descendants could rouse them from the Curse of Idleness. For Marie Rose, that might prove... beneficial.\n\n*I am happy to play.*\n\nNoll's words echoed in Grid's memory. When facing Blood King Candidate Grid, the eternal lethargy that plagued him—the sense that *everything was annoying*—had simply vanished. Motivation had flooded in. For the first time since birth, he'd felt genuine emotion: fearsome anger, murderous intent aimed squarely at Grid.\n\nNoll had described it almost reverently: *\"I realized I was alive after feeling that emotion. The Curse of Idleness broke. I felt sorry for all the wasted time, and grateful—grateful that you'd made me angry enough to forget the curse entirely.\"*\n\nThat memory sustained Grid's optimism.\n\n*If Marie Rose resembles Noll in that regard...*\n\nWould she thank him for freeing her from both seal and curse? What emotions would surface? If she felt favorably toward him, would she cooperate? It was almost absurdly optimistic. He might provoke her wrath instead, get himself killed.\n\nBut the circumstances left him grasping at straws. Marie Rose stood among the world's most powerful beings. The potential benefits of securing her as an ally dwarfed even the value of Grid's own life.\n\n*A gamble worth taking. Just once.*\n\nHe'd come here to improve his odds. He'd sent Shay away and entered alone, pickaxe in hand.\n\n*Braham mentioned it before. Marie Rose's evil influence descended from Shizo Beriache. The personality runs deep, runs strong.*\n\nGrid had felt it firsthand. Marie Rose had left this place fifteen, maybe seventeen years ago, yet residues of her malevolent energy still lingered. Which led to a hypothesis: *The cave that sealed her for centuries must be saturated with that influence.*\n\nCaves naturally contained minerals. Grid suspected those minerals had been steeped in Marie Rose's aura for hundreds of years. He didn't expect exceptional performance from them—the evil influence would degrade their quality, perhaps even corrode them into dust. The land surrounding the cave was barren, after all.\n\nBut performance didn't matter. He needed them to curry favor.\n\n*She's sensitive to blood scent. Sensitive enough to detect Malacus' Cloak.*\n\nThat cloak's lingering traces had roused her from a centuries-long seal!\n\n*If I wear items containing her own evil influence, she'll recognize them instantly.*\n\nSometimes his own brilliance surprised him. Grid began scouring the cave for minerals. The entrance held only ordinary stone—he'd need to venture deeper.\n\n>**[Marie Rose's evil influence makes your magic power turbid. All types of spells and skills aren't available.]**\n\n>**[You have resisted.]**\n\n>**[The remnants of the evil influence is eating at your physical and mental strength. You have fallen into the 'weak' and 'confused' state.]**\n\n>**[You have resisted.]**\n\nThe malevolent energy thickened with every step. Grid's resistances held, but Shay's party would've collapsed within minutes.\n\n*They couldn't even reach the entrance.*\n\nGood. The seal remained undefiled. That knowledge eased Grid's tension. He felt grateful once more for the fraudulent resilience of a legend as he reached the innermost chamber.\n\n*Surprisingly spacious.*\n\nFrom outside, the cave seemed modest. Inside, it sprawled vast. Forty minutes of walking down a single passage.\n\n*She slept here for centuries.*\n\nGrid's gaze settled on the coffin dominating the chamber's center—pure white, elegant. He couldn't help imagining Marie Rose's beautiful form within.\n\n\"Ah...\"\n\nEven having prepared himself, her actual beauty stole his breath. Mysterious. Transcendent.\n\nGrid shook off the distraction and examined the chamber walls. Most minerals had already corroded under the relentless evil influence. The search would take time in a space this large.\n\n*This is inefficient.*\n\nWithout the lingering malevolence, he'd have summoned Minor immediately. The Minerals Detector hadn't discovered new ore in ages, had grown restless with inactivity.\n\n*Though he's been keeping busy...*\n\nFor years now, Minor had labored in the library without respite, devouring texts on minerals and geography, expanding his knowledge base. Grid had upgraded the library to purple-tier specifically for Minor's benefit—higher building levels meant broader book selections.\n\n*Minor's detection capabilities are evolving steadily.*\n\nBut for Minor to truly shine, the Overgeared Kingdom needed to expand. Greater territory meant greater opportunity for discovery. Which meant Grid couldn't afford to lose this war.\n\n*Can't lose a single city. Not one.*\n\nThe Overgeared Kingdom embodied Grid and his companions' blood and sweat, their passion and dedication. To let others seize it now? Unacceptable. Unthinkable. Hence his plan to secure Marie Rose's cooperation.\n\n\"Ah...!\"\n\nFinally, after extensive searching, Grid found his quarry. In the chamber's darkest corner—darker than darkness itself, steeped in malevolent energy—minerals glinted.\n\n\"This is it!\"\n\n*Ttang! Ttang! Ttang!*\n\nGrid's pickaxe work remained flawless, the product of countless hours of practice. Any miner who witnessed it would weep.\n\nHowever...\n\n>**[The mining has failed.]**\n\n>**[The mining has failed.]**\n\n>**[The mining...]**\n\n>**[The continuous mining failure has increased the possibility of damage to the stones.]**\n\n\"...?\"\n\nThese minerals had endured Marie Rose's evil influence for centuries. They weren't yielding easily—not even to Grid's expertise. Embedded deep in the rock face, stubborn and unyielding.\n\n*What should I do?*\n\nOne or two more failures risked damaging the mineral, degrading its value. Grid briefly considered bringing Minor down despite the danger, then shook his head.\n\n*I need the residue of evil influence, not the mineral's inherent quality.*\n\nHe'd never expected high performance from degraded ore. The minerals themselves might prove worthless. If mining failures damaged them—so be it. Grid abandoned caution and swung with renewed determination. \n\nSurprisingly, the ore yielded without further resistance.\n\n>**[You have succeeded in the mining.]**\n\n>**[The Unidentified Iron Ore has been acquired.]**\n\n\"Legendary Blacksmith's Appraisal.\"\n\n>**[The information about the target item has been updated.]**\n\n*Ttiring~*\n\n**[Iron Ore with Evil Energy]**\n\n*An iron ore that has been saturated with evil energy for many years.*\n\n*Care is required when handling it.*\n\n*There is a possibility of dying when touching it by hand.*\n\n***Weight:** 5*\n\n**[This item has a hidden function!]**\n\n**[Iron Ore with the Power of Transcendence]**\n\n*An iron ore imbued with the power of an existence that isn't subject to death.*\n\n*Anyone who can cope with the evil influence of the iron ore can obtain the hidden strength behind it.*\n\n** There is an option to add stats when using it as an item making material.*\n\n*However, there is a high possibility that all types of restrictions will arise due to the evil influence.*\n\n***Weight:** 5*\n\n\"Huh...\"\n\nFrom an ordinary perspective, the evil influence made it practically unusable.\n\n\"...Hahaha.\"\n\nBut Grid wasn't ordinary. His eyes, blank with shock moments before, now blazed with excitement. He resumed searching, scouring every corner of the vast chamber.\n\nThe coffin, which had been observing Grid's increasingly manic treasure hunt, finally spoke.\n\n—*Did you wake up Marie Rose?*\n\n\"...?\" \n\nGrid froze mid-swing.\n\nThe coffin continued its introduction. —*I am 2nd Pope Chreshler.*\n\n\"...?\"\n\nWas this Pagma's work too?\n\n*Is he insane?*\n\nThen again... Pagma had sealed 5th Pope Franz's soul into a sword, and Franz had been his friend. As far as Grid knew, Pagma and the second pope had never even met.\n\n*Meaning he could do it without hesitation.*\n\nGrid's expression turned awkward as the coffin pressed on.\n\n—*You woke up Marie Rose, didn't you? Why did you wake the person sleeping inside me?*\n\n\"No. It wasn't me. The coffin was empty when I arrived.\" Grid kept his voice steady, denial automatic.\n\nHe'd overlooked something crucial. The first and second popes—the founders of the Rebecca Church—had transcended the bounds of ordinary humanity. You couldn't deceive a transcendent ego.\n\n—*You're lying to me right now.*\n\nThe coffin launched itself at Grid's head.\n\n*THWACK.*\n\n\"Gah...?\"\n\nBeing beaten by a coffin? Grid had endured countless humiliations, but this ranked among the most absurd.\n\nThe coffin's voice dripped contempt. —*Did you learn to lie from Pagma while inheriting his skills?*\n\n\"...!?\""
}