{
  "id": 997,
  "title": "Chapter 996",
  "content": "# Chapter 996\n\nThe world wasn't particularly worried about the Overgeared Kingdom's war. After all, Grid would simply march out and slaughter his enemies—he always did. The public took this for granted, and even the experts didn't argue otherwise. Grid and the Overgeared members had proven themselves too many times, overcoming crises through methods that transcended common sense.\n\nBut the truth? The Overgeared Kingdom was a candle flickering in a hurricane. While the seven dukes' armies were tied down defending the port cities, the Empire hadn't even deployed their true strength yet—the Tower of Eternity's mages, the magic machines, the Red Knights, the Five Pillars. Meanwhile, the Overgeared Kingdom had already exhausted considerable resources just to stem the tide.\n\nGrid was terrified. Every report brought worse news than the last. That's why he'd thrown himself into diplomacy, leveraged his corporate connections, done everything possible to shift the predicted outcome. And that's what brought him here.\n\n> [Marie Rose's evil influence makes your magic power turbid. All types of spells and skills aren't available.]\n\n> [You have resisted.]\n\nThe cave entrance loomed before him like a monster's maw. This was where Marie Rose had been sealed—the Vampire Duke imprisoned by Second Pope Chreshler and Rebecca's Daughters, the ultimate vampire who transcended even Beriache herself. And Grid had accidentally broken that seal.\n\n*Malacus's Cloak did this. An unintended consequence.*\n\nStill, Grid was counting on his **Blood King Candidate** title to work in his favor.\n\nAccording to Noll, facing Grid as a **Blood King Candidate** had shattered the apathy of the **Curse of Sloth** entirely. For the first time since his birth, Noll had felt genuine emotion—rage, killing intent, but also *life itself*. He'd even expressed gratitude to Grid for making him so angry he'd forgotten the curse.\n\n*If Marie Rose reacts like Noll did...*\n\nWould she thank him for freeing her from both the seal and the curse? What emotions would she feel? And if those emotions were favorable... would she cooperate?\n\nOf course, it was wildly optimistic thinking. He could just as easily provoke her into killing him on the spot.\n\nBut he was desperate. Marie Rose was one of the most powerful beings in the world. The benefit of having her as an ally so vastly outweighed the value of Grid's life that the gamble became obvious.\n\n*It's a gamble worth taking.*\n\nHe'd dismissed Shay and come alone. Now he pulled out his pickaxe.\n\n*Braham said Marie Rose's evil influence was inherited from the progenitor, Beriache. Her personality is exceptionally strong.*\n\nGrid had experienced it firsthand. Even though Marie Rose had left here fifteen to seventeen years ago, her evil energy still saturated the place. Which meant the cave where she'd been sealed for *centuries* would be absolutely drenched in it.\n\nAnd caves naturally contained minerals. Any minerals in this place would be thoroughly soaked in Marie Rose's influence. Grid wasn't expecting them to be particularly powerful—the evil energy would have weakened or corrupted them. But that was precisely what he wanted.\n\n*Marie Rose was sensitive enough to Malacus's Cloak to wake from a centuries-long seal. If I wear items containing her own evil influence, she'll recognize them immediately.*\n\nA brilliant plan, if he said so himself. His thoughts were occasionally extraordinary.\n\nGrid began examining the cave walls, searching for mineral deposits. At the entrance, there was only bare stone. He'd have to go deeper.\n\n> [Marie Rose's evil influence makes your magic power turbid. All types of spells and skills aren't available.]\n\n> [You have resisted.]\n\n> [The remnants of the evil influence is eating at your physical and mental strength. You have fallen into the 'weak' and 'confused' state.]\n\n> [You have resisted.]\n\nThe deeper he ventured, the thicker the miasma became. Grid could resist it thanks to his legendary status, but Shay's party wouldn't have made it ten steps inside.\n\n*They couldn't even enter here.*\n\nKnowing Marie Rose's seal remained intact brought Grid some comfort. Once again, he was grateful for the fraudulent nature of his legend-grade class.\n\nAfter forty minutes of walking down a single winding passage, he reached the innermost chamber.\n\n*It's massive.*\n\nThe space opened up into a vast hall. And there, in the center, stood a coffin of pure white.\n\nThe moment Grid saw Marie Rose sleeping within, his breath caught. He'd tried to imagine her beauty, but the reality made him feel genuine awe. She was... breathtaking.\n\nGrid forced his attention away, turning to examine the chamber walls for minerals. Most had already been corroded by the concentrated evil influence. The space was enormous—this would take time.\n\n*If it weren't for the residual energy, I'd just call Minor.*\n\nHis Minerals Detector hadn't found any new deposits in ages. For years now, the poor man had been confined to the library, reading everything he could find about geology and mineralogy. Grid had even upgraded the library's level to expand its collection for Minor's benefit.\n\n*At least Minor's capabilities keep evolving.*\n\nFor him to be truly useful again, the Overgeared Kingdom needed to expand its territory. The greater Minor's range of operation, the higher the chance of discovering new minerals.\n\n*Which means I absolutely cannot lose land in this war. Absolutely not.*\n\nThe Overgeared Kingdom represented years of blood, sweat, and passion—his and his companions'. He would not let it be taken. He refused to even consider it. And that's why he needed Marie Rose.\n\n\"Ah...!\"\n\nFinally, in a corner so saturated with evil energy it appeared blacker than darkness itself, Grid found what he was looking for.\n\n\"This is it!\"\n\n*Ttang! Ttang! Ttang!*\n\nHis pickaxe work was flawless—the product of countless hours of practice. Any miner watching would have wept with envy.\n\n> [The mining has failed.]\n\n> [The mining has failed.]\n\n> [The mining...]\n\n> [The continuous mining failure has increased the possibility of damage to the stones.]\n\n\"...?\"\n\nThe mineral had endured Marie Rose's influence for centuries, and it wasn't yielding easily. Even Grid's expert technique couldn't crack it.\n\n*What do I do?*\n\nA few more failed attempts would damage the mineral permanently, reducing its value. Should he risk bringing Minor down here?\n\nNo. He shook his head.\n\n*I need the evil influence residue, not the mineral's natural properties anyway.*\n\nHe had no expectations for the mineral's base performance—for all he knew, it was completely worthless. Damaging it through repeated failures wouldn't matter. Grid resumed mining with renewed determination.\n\nThis time, the pickaxe struck true.\n\n> [You have succeeded in the mining.]\n\n> [The **Unidentified Iron Ore** has been acquired.]\n\n\"Legendary Blacksmith's Appraisal.\"\n\n> [The information about the target item has been updated.]\n\n*Ttiring~*\n\n> [**Iron Ore with Evil Energy**]\n> \n> [An iron ore that has been saturated with evil energy for many years.\n> \n> Care is required when handling it.\n> \n> There is a possibility of dying when touching it by hand.\n> \n> Weight: 5]\n\n> [This item has a hidden function!]\n\n> [**Iron Ore with the Power of Transcendence**]\n> \n> [An iron ore imbued with the power of an existence that isn't subject to death.\n> \n> Anyone who can cope with the evil influence of the iron ore can obtain the hidden strength behind it.\n> \n> ★ There is an option to add stats when using it as an item-making material.\n> \n> However, there is a high possibility that all types of restrictions will arise due to the evil influence.\n> \n> Weight: 5]\n\n\"Huh...\"\n\nFrom an ordinary person's perspective, the evil energy restriction made it look terrible.\n\n\"...Hahahat!\"\n\nBut could there be more? Grid's blank stare transformed into sharp focus. He immediately began scouring the entire chamber again.\n\nThe coffin, which had been silently observing, suddenly spoke.\n\n—*Did you wake Marie Rose?*\n\n\"...?\" \n\nGrid froze mid-step, stunned speechless.\n\n—*I am Second Pope Chreshler.*\n\n\"...?\"\n\nWas this Pagma's work too?\n\n*Is he insane?*\n\n...Actually, no. Pagma had sealed his own *friend*—5th Pope Franz—into a sword without hesitation. As far as Grid knew, Pagma and the Second Pope had never even met.\n\n*...So he could do it without guilt.*\n\nGrid's expression turned awkward.\n\nThe coffin pressed again. —*You woke Marie Rose, didn't you? Why did you disturb the one sleeping inside me?*\n\n\"No, it wasn't me. The coffin was already empty when I arrived.\" Grid denied it hastily. Who knew what would happen if he admitted the truth?\n\nBut Grid had overlooked one crucial fact: the first and second popes had elevated the Rebecca Church beyond the realm of ordinary humanity. You couldn't deceive a transcendent ego.\n\n—*You're lying to me.*\n\nThe coffin launched itself through the air and slammed into Grid's face.\n\n\"Eek...?\"\n\nBeing assaulted by a *coffin*? In his entire life—and he'd suffered through plenty—Grid had never experienced something so absurd and unfair.\n\nThe coffin scoffed contemptuously.\n\n—*Did you learn to lie from Pagma while inheriting his skills?*\n\n\"...!?\""
}