{
  "id": 998,
  "title": "Chapter 997",
  "content": "# The Age of Grief\n\nThe history of the Rebecca Church began in humanity's darkest hour. Seven saints who once served the gods had turned traitor, corrupting the faithful and plunging the world into chaos. Great demons walked the earth, bringing with them war and famine that ravaged every kingdom. In this Age of Grief, the people's faith shattered—they cursed the gods who had abandoned them to such suffering.\n\nYet one saint remained true. Where others despaired, this humble soul walked the Path of Penance, seeking redemption not for himself, but for all mankind.\n\nFor his devotion, the goddess of light granted him a holy sword that burned with her divine radiance. With this sacred blade, he drove the great demons back into the darkness. His deeds became legend, sung from village to village, city to city. Righteous warriors flocked to his banner. Together, they raised temples to the goddess and carved monuments to her glory.\n\nThe heroes who followed him crowned him Pope—the first to bear that sacred title. Even among legends, the First Pope stood apart. He had saved humanity when no one else could. The faithful of the Rebecca Church revered him as a being touched by divinity itself.\n\nSuch a man would never choose his successor lightly. For decades, he searched for someone whose potential exceeded even his own. At last, he found Chreshler—a soul worthy of bearing the weight of his legacy.\n\nCenturies had passed since then. Chreshler now existed only as consciousness bound to a coffin of sacred wood. Yet his power remained formidable.\n\nGrid learned this the hard way.\n\n\"I'm telling you the truth! When I got here, your coffin was already empty. Marie Rose had already escaped. I swear it.\"\n\nThe coffin's voice dripped with contempt. *—A really bad liar, aren't you?*\n\n\"What?\"\n\n*—My consciousness is sealed within this sacred wood. I only wake when an intruder approaches. This is the second time I've awakened.*\n\nGrid's confusion deepened. \"I... don't follow.\"\n\n*—The first time I woke, Marie Rose still slumbered within me. Now she's gone.* The voice hardened with accusation. *—So tell me... if YOU didn't free her, who did?*\n\nBefore Grid could respond, the coffin launched itself at him like a battering ram. The sight would have been comical under different circumstances—a casket flying through the air with murderous intent. But Grid couldn't even appreciate the absurdity. The coffin moved with the blinding speed of Faker employing Lantier's assassination techniques.\n\nThe impact drove the air from Grid's lungs.\n\n**[You have suffered 33,780 damage!]**\n\n\"Gah! Are you insane?!\"\n\nPain exploded through Grid's body. One or two more hits like that would kill him outright.\n\n*—Still breathing? I've grown weaker than I thought. Even inhabiting sacred wood has its limits, it seems.*\n\n\"You've got this all wrong!\" Grid gasped. \"I didn't—\"\n\n*—A misunderstanding? A MISUNDERSTANDING?*\n\nThe coffin's tone shifted from anger to something far more unhinged. Grid's blood ran cold as realization struck: Chreshler had once been hailed as the greatest pope in history, a hero whose deeds were carved into the annals of legend.\n\nClearly, that glory hadn't included diplomatic skills.\n\n'Time to get the hell out.'\n\nHe could forget about learning anything from Chreshler—not if he was dead. \"Quick Movements! Blackening!\"\n\nDark energy erupted from Grid's body as he activated his demonic transformation, preparing to vanish—\n\n*—Hmm. Wait. Perhaps you're telling the truth after all.*\n\nToo late. The transformation was already underway.\n\n\"...?!\"\n\nWhat happened next defied everything Grid understood about magic and skills. Chreshler's presence alone—the sheer weight of his divine nature—denied the demonic energy trying to manifest. Grid's Blackening didn't just fail to activate. It was *rejected*. The shadowy haze around him evaporated like morning frost under a scorching sun.\n\n**[Blackening has been forcibly released!]**\n\n**[The supreme divine power is denying your demonic energy!]**\n\n**[There is a severe recoil in your body!]**\n\n**[You have suffered 2,265,320 damage!]**\n\n**[A legend doesn't die easily. Your health is fixed to a minimum...]**\n\n\"Cough! *Cough!*\"\n\nGrid collapsed, blood pouring from wounds that opened spontaneously across his body. He trembled, barely clinging to consciousness.\n\n*—You tried to use demonic energy IN FRONT OF ME?* Chreshler sounded almost impressed. *—That's practically suicide. I'm genuinely surprised.*\n\n\"Hah... hah...\" Grid couldn't manage a coherent response.\n\n*—Well, you survived.* The coffin floated closer, observing Grid's broken form with clinical detachment. *—Being a legend has its advantages. Like a cockroach... always manages to survive.*\n\n\"What...\" Grid wheezed. \"What did you DO to me?\"\n\n*—I did nothing. My existence as Pope simply detected and extinguished your evil energy. It's automatic.*\n\n\"...\"\n\n*—Don't look at me like I'm some kind of monster. Although, to be fair, even this passive defense wouldn't affect Marie Rose. Damn it... I need to recapture her and reinforce the seal.*\n\nGrid said nothing, too busy trying not to pass out.\n\n*—The sacred wood must have degraded faster than I calculated,* Chreshler mused, his anger cooling. *—Actually... you probably didn't break the seal at all. The coffin's divine power simply weakened over time, and Marie Rose woke on her own.*\n\nThat was technically accurate. Grid may have provided the final catalyst—the scent of fresh blood to rouse her—but he hadn't broken any seals. Marie Rose had freed herself.\n\n'Still my fault, though,' Grid thought grimly. Not that he was stupid enough to admit it.\n\nHe downed a potion, waiting for the worst of his injuries to close. \"Did sealing Marie Rose kill you?\"\n\n*—No. I sealed her and lived for decades afterward. Died peacefully at one hundred and ten years old.*\n\n\"Then how are you sealed in this coffin too? Wouldn't you have—\"\n\n*—I sealed her with my holy power while I was alive, yes. But the Third Pope died young. The Fourth and Fifth were too weak to contain her malevolence—I could sense her beginning to stir. So I made a choice.* The coffin's tone turned bitter. *—I died and transferred my consciousness into this vessel of sacred wood, binding myself to it as I had bound her. An eternal guardian.*\n\n\"Pagma helped you do that?\"\n\n*—Yes. That bastard.*\n\n\"...What?\"\n\n*—He PROMISED me I'd maintain my senses even while asleep. That I'd be able to feel Marie Rose within me, always aware of her presence, even in slumber. What utter horseshit.*\n\nGrid blinked. \"I... what?\"\n\n*—I lose ALL sensation when I sleep! I've never felt her! Not once!* The coffin actually sounded petulant. *—Do you have any idea how much I looked forward to waking up and finally experiencing her again? Sigh...*\n\n\"...\" Grid rubbed his temples, feeling the conversation derailing spectacularly.\n\nHe slapped his own cheeks to refocus. \"Can you tell me about Pagma? And about the first intruder who came here—\"\n\n*—Why should I? Are you going to bring Marie Rose back to me?*\n\n\"...\"\n\nThe absurdity of the request rendered Grid momentarily speechless. Chreshler seemed to find this amusing.\n\n*—You're more honest than Pagma, at least. That straightforward reaction is refreshing.* The coffin's lid creaked open invitingly. *—Very well. I'll answer your questions. You've clearly earned the favor of the Goddess of Light—I can sense her blessing upon you, along with those of the three churches. Such devotion deserves reward.*\n\nGrid felt a flicker of satisfaction. Living virtuously really did pay dividends.\n\n*—Lie down inside me.*\n\n\"...Excuse me?\"\n\n*—Actions speak louder than words. I'll show you my memories directly.*\n\nGrid stared at the open coffin, hesitation warring with curiosity. Everything in him rebelled at the idea of lying in a vessel meant for the dead. But only for a moment. His thirst for knowledge won out. Taking a deep breath, Grid climbed inside and lay down.\n\n**[The Sacred Wood Coffin has accepted you.]**\n\n**[The divine power has permeated you in a very small amount.]**\n\n**[The advanced light elemental has responded pleasantly.]**\n\n**[The light of the advanced light elemental has become a bit brighter.]**\n\n**[Dark resistance has permanently increased by 5%.]**\n\n**[In the future, there is a very low chance of adding 5% holy attribute damage to basic attacks.]**\n\n**[Affinity with Chreshler has increased by three.]**\n\n\"...!\"\n\nUnexpected benefits flooded through him. Before Grid could fully process them, darkness swallowed his vision.\n\n---\n\n# A Memory of the Past\n\nWhen Grid's eyes opened again, he stood in a sun-drenched chamber. A man stood before him—perhaps the most beautiful man Grid had ever seen. Long dark hair framed a face that belonged in an ancient painting, the kind of timeless elegance that transcended mortal aesthetics.\n\n'Pagma!'\n\nGrid tried to call out, but no sound emerged.\n\n**[You are in a frozen state in Chreshler's past.]**\n\n**[You are experiencing the past from Chreshler's perspective.]**\n\n**[You are in an observer state. You cannot intervene in the past.]**\n\nAn elderly voice spoke—Chreshler's voice, but aged, crackling with the weight of years. This must be near the end of his natural life.\n\n\"Can you fashion a coffin from the sacred wood?\"\n\nPagma's expression showed no fear of the divine material. \"I've worked with World Tree branches multiple times. That experience should serve me well here.\"\n\nChreshler, seated in a high-backed chair, studied the younger man carefully. \"The Fifth Pope recommended you highly. I'll trust in that judgment.\"\n\nWith permission granted, Pagma set to work.\n\nGrid watched, transfixed. Every movement was deliberate yet fluid—Pagma's hands danced across the sacred wood, suppressing its holy power with techniques Grid had never imagined. The man worked with the confidence of someone who had transcended mere mastery, reaching true artistry.\n\n'Incredible...'\n\nThis was the genius who had pioneered the techniques Grid now wielded. The transformation of a massive tree into an elegant coffin unfolded like a performance, each strike of the tool purposeful and precise.\n\n**[The Sacred Wood Coffin production method has been acquired.]**\n\n**[You have learned the techniques to handle the sacred wood.]**\n\n'...!'\n\nGrid hadn't expected to gain knowledge just from watching. As he marveled at this unexpected windfall, time accelerated. Days condensed into moments. Finally, Pagma stepped back from his completed work—a coffin of pure white wood that seemed to glow with inner light.\n\nChreshler approached it with reverence. \"Beautiful. A fitting vessel for Marie Rose.\"\n\n\"Your Holiness.\"\n\n\"You needn't use that title. I'm retired.\"\n\n\"Old habits.\" Pagma's smile was disarming. \"I've fulfilled my end of our bargain. Now I'd like to ask two favors in return.\"\n\n\"Bold.\" But Chreshler's tone held approval. \"Speak.\"\n\n\"I heard you personally oversaw the funerals of many legends.\"\n\n\"I did. Why?\"\n\n\"I wish to know where they're buried.\"\n\n\"For what purpose?\"\n\n\"To pay my respects. To honor their souls.\"\n\n'...!' \n\nDread coiled in Grid's stomach. He knew—or thought he knew—Pagma's true intentions. Images flashed through his mind: the Undefeated King Madra, suffering for centuries as a mindless undead. The other legends, similarly desecrated.\n\n'No... it can't be.'\n\nGrid forced himself to think rationally. At this point in time, Pagma wasn't yet Baal's Contractor. He possessed no power to create death knights. Perhaps his stated purpose was genuine—nothing more sinister than respect for the fallen.\n\nBut then why did Grid's skin crawl as he watched Pagma's expression? Why did that smile seem less innocent than calculating?\n\n\"And the second favor?\"\n\nPagma drew his sword in one smooth motion. The blade gleamed—an eastern longsword of exquisite craftsmanship.\n\n\"Teach me how to grow stronger.\"\n\nAt the sword's edge, barely visible but unmistakable to Grid's trained eye, sword energy flickered.\n\nThe resource required to master the Undefeated King's techniques. Pagma had already begun planning his path to power."
}