{
  "id": 999,
  "title": "Chapter 998",
  "content": "# Chapter 998\n\nFighting energy—the Hero King's resource—only accumulated during combat. For Grid, this posed a critical problem. The Undefeated King's Swordsmanship devoured fighting energy like a starving beast, and once depleted, his stats would plummet. The danger was unacceptable. What Grid needed desperately was the great swordsman's resource: sword energy.\n\nAnd now, at this very moment...\n\n*Sword energy!*\n\nGrid's pulse quickened. This was his chance to witness how Pagma wielded sword energy in his prime. He could feel it building—an opportunity he couldn't afford to waste.\n\n*He's going to release sword energy!*\n\nThroughout his journey, Grid had seized every opportunity to master Pagma's techniques. Hidden pieces, ancient murals, obscure quests, the Hall of Fame—whenever he followed Pagma's breadcrumbs, the legendary blacksmith's skills became his. But Great Swordsman Pagma's Sword Dance was different.\n\nThat skill had evolved through the goddess's blessing. Grid hadn't learned it from any knowledge or hint Pagma left behind. Which meant it remained incomplete.\n\n*I can't let this slip away!*\n\nGrid's eyes burned with intensity. If he could witness Pagma's battle against Chreshler, if he could truly understand what it meant to be a great swordsman, perhaps he could finally bridge that gap.\n\n\"Huhu, look at you—a man who's committed unforgivable atrocities against humanity.\"\n\nContrary to Grid's expectations, no battle erupted. Chreshler stepped backward instead.\n\n\"You want to cross swords with an old man on death's door? I'm a hundred and ten years old. *A hundred and ten.* My blood pressure spikes just from swinging a blade—I could drop dead on the spot. Tsk, you're a cruel one. Never thought you'd stoop to such tactics.\"\n\n\"...\" Pagma, his blade already drawn, showed no particular reaction. After listening to Chreshler's peculiar deflection, he responded quietly, \"If you'll die tomorrow anyway, what difference does dying today make?\"\n\n\"W-What?\"\n\n\"Your Holiness, please steel yourself and teach me.\"\n\n\"Hah! I've never met such a shameless bastard! The stew tastes wrong, so you add some courtesy and reheat it? In all my years, I've never encountered anyone like you!\"\n\n\"Your Holiness, the current peace won't last forever. After you and the First Pope pass, who will have the power to suppress Hell? The Age of Grief will return—the Yatan Church will rise again, and the great demons will run rampant without fear.\"\n\n\"You know all this, yet you still sealed our church's three sacred treasures?\"\n\n\"It was a friend's request.\"\n\n\"A friend's request? Huhu, what absurdity. A lunatic like you has friends? You don't even understand the meaning of loyalty.\"\n\n\"I will become stronger.\"\n\n\"...?\"\n\n\"I'll become strong enough to defend this world without the Rebecca Church. Without Franz. I was prepared for this when I honored my friend's request. Please—cooperate with me.\" Pagma raised his sword higher.\n\nChreshler clicked his tongue. \"Protect the world's peace alone? You're arrogant, descendant of a fallen god. Tsk, typical yangban thinking.\"\n\n\"I know nothing of the yangbans' history. I've never considered myself a god's descendant. I only want to save humanity—as a human.\"\n\n\"Then you'll kill this old man right here? That's your idea of human duty?\"\n\n\"...Your sacrifice will save tens of millions. It's both righteous and necessary.\"\n\n\"Kuk, kukukuk! You're an arrogant, selfish bastard!\"\n\nChreshler's rage flooded through Grid's shared consciousness. The pope's disgust with Pagma was palpable. \"From any human perspective, you're completely out of line. Can't you see that?\"\n\n\"I'm prepared to bear the consequences.\"\n\n\"Shut your mouth! Your ideals aren't as noble as you believe! Don't you understand? Of course you don't—because you're a yangban! You have no right to speak for humanity!\"\n\n\"What separates a yangban from a human? A yangban lives longer and wields greater power, but we're no different. Our minds, our hatred of evil, our very flesh—all identical to humans. We even bleed the same. All people are equal, so I fight for all people.\"\n\n\"Insane. You're completely insane—a madman who doesn't even recognize his own madness. Fine. Better you die here. Keeping you alive was always too dangerous.\"\n\nWhat happened next bordered on the miraculous. Chreshler's faith manifested like an ocean, generating infinite holy power. That divine energy bent to his will. Hundreds of thousands of light spears erupted forth. Pagma looked as though he'd be skewered instantly, limbs pierced beyond salvation.\n\nBut the opposite occurred.\n\nPagma had already completed two linked sword dances. Grid could read the motion through Chreshler's eyes.\n\n\"Flower Revolve.\"\n\n*...!* Grid's breath caught.\n\nHundreds of petals materialized, each containing concentrated sword energy, spinning in an elegant vortex. Every light spear aimed at Pagma reversed course and returned to sender. Chreshler erected a light barrier to absorb his own attack, and even he couldn't hide his amazement. \"Fascinating swordsmanship. After Muller and the Undefeated King, you're the finest I've seen.\"\n\n\"I can't compare to them in pure swordsmanship. That's precisely why I must evolve.\"\n\n\"Even if it means selling your soul to a great demon?\"\n\n\"...\"\n\n\"Kukuk, you don't deny it.\"\n\nThis man was too dangerous. He couldn't be allowed to live. Chreshler's instincts screamed the warning. His final mission, he realized, was to eliminate this twisted individual before him.\n\n\"The pope once told me something. He wouldn't have chosen me as his successor if not for the crisis at hand. My martial prowess was always too lacking—he never approved. But you? You're worse than I ever was. You sympathize with no one. You're numb to the suffering of those sacrificed for your grand purposes. I don't know if you were born this way or if you've changed, but you're already evil.\"\n\nChreshler's body became wreathed in twelve colors of light. The sword and armor hanging on the chamber wall glowed with five distinct hues and flew to him. He layered over seventeen buffs onto himself and his battle gear. The overwhelming power shattered the stone floor and shook the entire structure. As Chreshler's strength reached its peak, Grid felt utterly exposed. He glimpsed the 'world that transcendents perceive.'\n\n—!\n\nTime ceased.\n\nIn a frozen realm where only light refraction continued, Chreshler advanced by shattering suspended particles in the air. As the distance between them collapsed, Pagma's eyes never blinked. A sword following the path of light—only after it pierced Pagma's shoulder three times did sound arrive belatedly, blood spraying outward. Through Grid's shared vision, he saw the gushing blood separated into countless individual *droplets.*\n\n*He dodged it?*\n\nGrid's throat constricted. Pagma had clearly evaded the pope's light-speed strike. What should have pierced his heart merely gouged his shoulder.\n\n\"...\" Pagma's body began to fortify itself. Grid recognized Blacksmith's Rage among the buffs, but four others were unfamiliar—likely stemming from Pagma's equipment or personal skills.\n\n—!\n\nBlades clashed in the air without sound. The present world resembled a paused film. Blood flowing from Pagma's shoulder froze as thousands of suspended droplets. Against this impossible backdrop, Pagma and Chreshler moved and exchanged blows. Sound only arrived after the collisions. In those gaps, they'd already traded dozens of strikes.\n\n\"Transcend Kill Flower.\"\n\n\"Transcended Linked Kill Wave Pinnacle.\"\n\n\"Linked Revolve Pinnacle.\"\n\n\"Linked Kill Revolve Pinnacle Chop.\"\n\n\"Linked Kill Flower.\"\n\n\"Transcended Pinnacle Kill Chop.\"\n\nThe sword dances flowed endlessly, one into another.\n\n*'Pagma admired Dainsleif and Valhalla, demonstrating his mastery while wielding the sword no hero had ever used. The beauty was indescribable, and his swordsmanship seemed to pierce the very heavens, birthing lightning itself.'*\n\nAlbatino's description—Khan's ancestor's account of Pagma's Sword Dance—surfaced in Grid's mind.\n\nA swordsmanship that pierced the sky. Grid had always dismissed it as poetic exaggeration. The Pagma's Sword Dance he'd learned bore little resemblance to such grandeur. But now? Now he understood. *This* was the genuine article.\n\n\"Cough!\" Pagma, covered in wounds, struggled upright. Chreshler had only taken one clean hit, yet he swayed unsteadily. He cast healing magic to close the wound, but his seventeen buffs were expiring.\n\n\"Damn stubborn bastard,\" the pope's disbelieving voice escaped Chreshler's lips. He grumbled like a petulant child. \"Ah, forget it! I'm done! I quit!\"\n\n\"Hah... hah... hah...\" Pagma lacked even the breath to speak.\n\nHis magic and swordsmanship had both hit their limits. Chreshler removed his armor. \"Too heavy. My body feels like lead.\"\n\n\"Hah... hah...\"\n\n\"You genuinely tried to kill me. Damn it. Getting old is miserable.\"\n\n\"Hah... hah... Thank... thank you...\" Pagma, who'd held on through sheer will, finally collapsed. His fingers trembled. \"Thank you for Your Holiness's teachings... More sword dances... are now possible...\"\n\n\"Tsk.\" Chreshler clicked his tongue. The worry lingered. Part of him still believed Pagma should die here. But he had no desire to suffer further injury from such a calamity. In the end, Chreshler chose retreat.\n\n*Either way, I'll be dead soon. Let those who remain bear this burden.*\n\nHe didn't care anymore. He'd just... rest. That was his final thought. Chreshler's consciousness severed.\n\nHe had died.\n\nChreshler's bluff about dying from overexertion hadn't been an exaggeration after all. In his fading vision...\n\n\"Go peacefully. I will reverently enshrine your soul in the Sacred Wood Coffin.\"\n\nPagma's figure appeared, bowing respectfully.\n\nThen Grid returned to reality.\n\n[**The past experience has concluded!**]\n\n[**You have witnessed and comprehended the Great Swordsman Pagma's Sword Dance!**]\n\n[**The title 'Great Swordsman' has been acquired.**]\n\n[**The new resource 'Sword Energy' has been unlocked through the title effect.**]\n\n[**The Sword Mastery skill effect has increased slightly due to the title effect.**]\n\n[**Great Swordsman Pagma's Sword Dance information has been updated.**]\n\n[**Fusion of sword dances has become relatively unrestricted.**]\n\n[**When wielding a sword, consumed resource will change from mana to sword energy.**]\n\n[**Instead of level increases, sword dances have reset to level 1. Maximum level for all sword dances is three. However, fusion sword dance levels are fixed at one.**]\n\n[**The new sword dance 'Flower' has been learned.**]\n\n\"...\" Grid's eyes opened quietly within the coffin. He was absorbing everything when Chreshler's voice reached his ears.\n\n—*There's nothing special, right? That's all I know about Pagma. He's a bit insane—a liar and an old man's murderer.*\n\n\"Ah... yeah.\"\n\nThere were far too many points to dispute. Grid simply turned away, shaking his head as he rose from the coffin.\n\nHe could feel himself becoming stronger."
}